{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7562659/Climate-activists-CONTINUE-week-long-protest-Bondi-Beach.html", "downloaded_at": "2019-10-11 20:42:25.243488+00:00", "title": "Climate activists to CONTINUE their week-long protest on Bondi Beach", "language": "en", "text": "Disruptive protests that have held Australia's capital cities captive this week are set to continue as climate activists prepare for more demonstrations over the weekend.\n\nOne of the largest gatherings set for this weekend is at Bondi Beach, in NSW, on Sunday, with nearly a thousand people signed on as being interested in attending.\n\nThe event has encouraged protesters to come dressed in blue and green to represent the sea and land where they will collectively form a huge hourglass.\n\nOne of the largest gatherings set for this weekend is at Bondi Beach after over a hundred gathered at Manley to literally place their heads in the sand\n\n'The hourglass symbolises the threat of extinction and that time is running out,' the group wrote online.\n\n'As we head toward the sixth mass extinction, and as governments repeatedly fail to act, it is our duty to rebel in peace.\n\nThe group says it is a strictly non-violent event featuring a range of speakers, photographers and drone pilots to document their actions to social media.\n\nProtesters were also encouraged to bring 'Vegan brunch treats to share' along with swimwear and surfboards for the day on the beach,\n\n'We want the community to know that we are emphatically nonviolent, every day citizens across all social strata who are desperately concerned not just for future generations but the current generation of children,' the event read.\n\nThe event booked for Sunday has encouraged protesters to come dressed in blue and green to represent the sea and land where they will collectively form a huge hourglass\n\nAfter a week of gluing themselves to roads and blocking traffic police have estimated there have been hundreds of arrests but said the majority of protesters have behaved themselves.\n\nQueensland police arrested 125 protesters this week with 43 of them just on Friday.\n\nVictoria only recorded 110 arrests for the week and Adelaide only brought in two men aged 61 and 44 on Friday.\n\nSydney police arrested almost 40 people on Monday with two more later in the week after they fixed a banner to the Harbour Bridge.\n\nVictoria recorded 110 arrests for the week at climate rallies such as the Extinction Rescission (pictured) and Adelaide only brough in two men aged 61 and 44 on Friday\n\nCanberra police said protesters were well behaved with no significant bad behaviour to speak of, in great contrast to Western Australia who saw 65 people arrested when protests took to gluing themselves to roadways.\n\nFriday saw more than 150 people attend Sydney's Manley Beach to literally stick their heads in the sand over climate change.\n\nExtinction Rebellion members said the government was 'sticking their heads in the sand' when it came to addressing climate change.\n\nProtesters were advised to dig their hole big enough to fit their heads - but to ensure they could still breathe.\n\nA man dressed as a pirate superglued his bare feet to a throne like platform in the middle of the protest\n\nThey were asked to bring a shovel and a towel - and to write a message on their bottoms.\n\nThe Facebook event for the day read: 'As we face into the climate emergency, it seems many around us have their heads in the sand, afraid to face the reality of what is coming.\n\nAnother event saw a man dressed as a pirate superglue his bare feet to a throne like platform in the middle of Friday's protest in Perth.\n\nHe then stuck the platform to the ground in the middle of a busy intersection, holding up traffic.\n\nOfficers were required to dissolve the glue to free the man before arresting him.", "description": "One of the largest gatherings set for this weekend is at Bondi Beach, in NSW, on Sunday, with nearly a thousand people signed on as being interested in attending.", "authors": ["Tom Place For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/13/19586708-0-image-a-44_1570797566016.jpg", "published_at": "2019-10-11"}