{"pub": "realclearpolitics", "url": "https://motherjones.com/politics/2019/10/heres-another-impeachable-offense-trumps-war-on-the-constitution", "downloaded_at": "2019-10-09 11:58:37.430886+00:00", "title": "Here’s Another Impeachable Offense: Trump’s War on the Constitution", "language": "en", "text": "Resolved, the president of the United States ought to be impeached for “interfering or endeavouring to interfere with the conduct of investigations by the Department of Justice of the United States, the Federal Bureau of Investigation…and Congressional Committees.” That’s a line from the first article of impeachment against Richard Nixon approved on July 27, 1974 by the House Judiciary Committee on a 27-to-11 bipartisan vote. (You can listen to the roll call for the vote here.) And now Donald Trump is providing today’s House Democrats little choice but to consider a similar charge as their impeachment inquiry proceeds.\n\nAs the New York Times reported on Tuesday morning, “The White House all but declared war on the House impeachment inquiry…intervening for the first time to block the testimony of a key witness as President Trump signaled his administration would try to starve investigators of more witnesses and documents.” That witness was Gordon Sondland, the United States ambassador to the European Union. He is a Trump crony—a fellow hotel magnate—who raised money for the GOP in 2016 and donated $1 million to Trump’s inauguration. A novice in the field of diplomacy, Sondland was given the EU ambassadorship presumably due to his pro-Trump largesse. And he has become embroiled in the Trump-Ukraine scandal. Text messages turned over to House investigators include exchanges between Sondland and fellow American diplomats suggesting that Sondland knew Trump was proposing an inappropriate quid pro quo to Ukrainian President Volodomyr Zelensky—and wasn’t comfortable with it. The House Democrats running the Ukraine investigation had requested that Sondland come in for a private interview. But shortly after midnight on Tuesday morning, hours before he was supposed to report to Capitol Hill, the State Department ordered Sondland not to talk to the congressional investigators.\n\nThen, late Tuesday afternoon, Trump intensified his assault on House investigators by a factor of gazillion. His White House counsel, Pat Cipollone, sent House Speaker Nancy Pelosi and several House Democratic chairs a blistering eight-page letter declaring that the Trump White House will not cooperate with the Democrats’ impeachment inquiry. “President Trump and his Administration reject your baseless, unconstitutional efforts to overturn the democratic process,” Cipollone proclaimed in the letter, which was full of partisan outrage and devoid of legal arguments. He added that Trump “cannot participate in your partisan and unconstitutional inquiry.” In other words, the White House will turn over nada to the Democrats—it will produce no documents, no witnesses.\n\nThis was no shocker. The White House has routinely blocked House Democrats investigating a wide array of alleged Trump wrongdoing from gaining access to witnesses and documents. The White House has thwarted House Judiciary Committee efforts to probe the various alleged instances of Trump obstructing justice outlined in detail in special counsel Robert Mueller’s report by blocking witnesses, including former White House counsel Don McGahn, from being questioned by the committee. Attorney General Bill Barr refused to appear before the panel when told he would be questioned by a committee lawyer in addition to members. On orders from the White House, Corey Lewandowski, Trump’s former campaign manager, declined to answer questions about some of his conversations with Trump when he came before for the committee. Other witnesses questioned as part of the House Democrats’ investigation of the Trump-Russia scandal and Trump’s possible obstructions of justice—such as former Trump senior aide Hope Hicks—also have followed White House instructions to keep mum about their interactions with Trump—without the White House formally invoking executive privilege. Treasury Secretary Steven Mnuchin has impeded the House Ways and Means Committee’s request for Trump’s tax returns, though the law clearly states that the IRS “shall” turn over such records if the committee asks for them. This has forced House Democrats to go to court. The Justice Department has also said nyet to a House request for investigative material related to Mueller’s probe, triggering another court case.\n\nThere are other instances of Trump thumbing his nose at the House’s demands for information and witnesses, and now he is applying that tactic to his impeachment defense. In refusing to make any witnesses and documents available to House Democrats, the White House has been arguing, without any merit, that Congress essentially has no oversight responsibilities that are not part of a legislative process—that is, congressional investigators are prohibited from investigating possible wrongdoing for investigation’s sake. This is an absurd position and one not followed by Republicans when they have been in charge. (Benghazi, anyone?) And though legal experts generally agree that the House’s authority to demand possible evidence of wrongdoing deepens when impeachment is on the table, Trump and his lawyers are now stretching their absurd no-investigations-allowed argument to cover all requests linked to the impeachment inquiry. In his letter, Cipollone is contending that if a president considers an impeachment proceeding to be politically motivated, he does not have to cooperate. There is no such provision in the Constitution.\n\nTrump’s letter and his overall stonewalling is an assault on the Constitution. As any armchair constitutional law expert knows, Congress is a co-equal branch of the government and was empowered by the framers to be a check on presidential power. Trump, Barr, and the president’s legal team have contended that Trump cannot be indicted on federal charges while he is president. Mueller accepted that argument in his final report. But that report clearly said that this does not mean a president can get off scot-free. Mueller noted it was up to Congress to examine the allegations of obstruction he outlined. And he implied (strongly) that the possible punishment for a presidential violation of the law would be impeachment.\n\nThat’s in keeping with the Constitution that awards Congress the right to indict the president, bring him to trial, and then boot him out of office, should he engage in serious wrongdoing. And if Congress has that task, it seems that it also has the right to investigate before doing so. And if it has that right, then it has the right to demand information necessary for such an investigation.\n\nYet Trump declines to recognize this power. In fact, he has insisted that Article II of the Constitution “allows me to do whatever I want.” That’s obviously nonsense. The authors of the Constitution clearly worried that an authoritarian with alliances with foreign interests might one day inhabit the White House and—good for them!—presciently included provisions to be used in such a dire instance. But Trump is waging a war on the Constitution, and all those congressional Republicans who are riding along with him are collaborators. Yes, we are no longer supposed to play this game, but imagine what they would have shouted had President Barack Obama blocked Hillary Clinton from appearing before the Benghazi committee. Imagine if the Clinton White House had refused to hand over documents to the Republicans who controlled Congress and who investigated every -gate they could find.\n\nToday’s Republicans are neutering Congress and weakening its ability to restrain or punish a president who doesn’t play by the rules, who doesn’t respect the law, and who doesn’t give a damn about constitutional checks and balances. By accepting Trump’s defiance of congressional investigations, they are eviscerating their own powers and establishing a dangerous precedent.\n\nAnd with these moves, Trump is forcing the Democrats to widen their impeachment inquiry. House Speaker Nancy Pelosi has wanted to keep the impeachment process narrowly focused on Trump’s alleged misconduct in the Ukrainian caper. Quid pro quo? Then the president must go. But several House committees have long been at work digging into other possible and impeachable wrongdoing: the alleged obstruction, Trump’s violation of the Emoluments Clause (which bans a president from accepting money from foreigners, unless Congress approves), his involvement in the hush-money payments to a porn star, his welcoming of foreign interference in US elections, and more. Some of these acts may eventually be funneled into articles of impeachment in addition to Ukraine-related charges.\n\nOn top of all that now could be Trump’s attempts to cover up his various misdeeds. The House Democrats, after being denied Sondland’s testimony, announced they would subpoena Sondland and related documents. But what if the subpoena is defied, as the Trump administration has ignored other subpoenas in the assorted investigations? The House Dems will then take it to court, as they have other cases. And this issue, like the other cases, may end up with the Supreme Court. Then who knows? But in the meantime, House Democrats can look back 45 years to Nixon and Watergate. Nixon’s refusal to cooperate with congressional investigations was deemed an impeachable offense. Trump’s stonewalling can be regarded in the same manner. It violates the intent of the Constitution and prevents the House from fully examining and reviewing conduct that might be cause for impeachment. Shady dealings in Ukraine that entail Trump abusing the power of his office certainly warrant consideration for impeachment. But Trump’s undermining of the Constitution and the rule of law might even be more deserving of that document’s ultimate punishment.", "description": "", "authors": ["David Corn", "Washington", "Dc", "Bureau Chief"], "top_image": "https://www.motherjones.com/wp-content/uploads/2019/09/20190924_trump-blinds_2000.jpg?w=1200&h=630&crop=1", "published_at": "2019-09-20"}