{"pub": "thehill", "url": "https://thehill.com/policy/technology/overnights/465927-hillicon-valley-warren-turns-up-heat-in-battle-with-facebook", "downloaded_at": "2019-10-15 23:09:01.408854+00:00", "title": "Hillicon Valley: Warren turns up heat in battle with Facebook | Instagram unveils new data privacy feature | Advocacy group seeks funding to write about Big Tech", "language": "en", "text": "Welcome to Hillicon Valley, The Hill's newsletter detailing all you need to know about the tech and cyber news from Capitol Hill to Silicon Valley. If you don't already, be sure to sign up for our newsletter with this LINK.\n\nWelcome! Follow the cyber team, Maggie Miller (@magmill95), and the tech team, Emily Birnbaum (@birnbaum_e) and Chris Mills Rodrigo (@chrisismills)\n\nWARREN TURNS UP THE HEAT: Sen. Elizabeth Warren Elizabeth Ann WarrenSupport drops for Medicare for All but increases for public option Hillicon Valley: Warren takes on Facebook over political ads | Zuckerberg defends meetings with conservatives | Civil liberties groups sound alarm over online extremism bill Feehery: Trump may be down, but he's not out yet MORE (D-Mass.), a top-tier Democratic presidential candidate, is turning up the heat in her battle with one of the most powerful tech companies in the world, Facebook, as she shines a spotlight on the company's rules on political ads.\n\nWarren's campaign ran an ad promoting a false claim about Facebook CEO Mark Zuckerberg Mark Elliot ZuckerbergHillicon Valley: Warren takes on Facebook over political ads | Zuckerberg defends meetings with conservatives | Civil liberties groups sound alarm over online extremism bill Zuckerberg defends meetings with conservative politicians, pundits Warren targets Facebook with ad claiming Zuckerberg supports Trump MORE over the weekend, highlighting the challenge the company confronts as it works to stave off disinformation while also sidestepping questions about the veracity of political arguments.\n\nADVERTISEMENT\n\nCritics have argued that Facebook is abdicating responsibility over its powerful platform, which reaches more than 2 billion people globally, while the company and free speech advocates have insisted it's risky for Facebook to take more control over what political candidates are allowed to say.\n\n\"The policies they've announced are an explicit invitation to politicians to spread falsehoods,\" Paul Barrett, the deputy director of the New York University's Stern Center for Business and Human Rights, told The Hill. \"And that is not something that we ought to applaud.\"\n\nWarren's move: Warren's advertisement, placed on Friday, taunted Facebook by claiming Zuckerberg had endorsed President Trump Donald John TrumpBusiness school deans call for lifting country-specific visa caps Bolton told ex-Trump aide to call White House lawyers about Ukraine pressure campaign: report Federal prosecutors in New York examining Giuliani business dealings with Ukraine: report MORE.\n\n\"Breaking news: Mark Zuckerberg and Facebook just endorsed Donald Trump for re-election,\" Warren's campaign wrote in the first line of a Facebook advertisement, which featured a picture of President Trump and Facebook CEO Mark Zuckerberg shaking hands. \"You're probably shocked, and you might be thinking, 'How could this possibly be true?'\"\n\n\"Well, it's not,\" the advertisement reads. \"But what Zuckerberg *has* done is given Donald Trump free rein to lie on his platform -- and then to pay Facebook gobs of money to push out their lies to American voters.\"\n\nFacebook's response: According to Facebook's archives, the post has accrued hundreds of thousands of views and cost Warren's campaign thousands of dollars to run.\n\nFacebook, though, is not backing down.\n\n\"If Senator Warren wants to say things she knows to be untrue, we believe Facebook should not be in the position of censoring that speech,\" a Facebook spokesperson said in a statement Saturday.\n\nThe larger fight: Warren's ad was a shot at Facebook's handling of another controversy involving a Trump campaign advertisement accusing former Vice President Joe Biden Joe BidenSupport drops for Medicare for All but increases for public option Bolton told ex-Trump aide to call White House lawyers about Ukraine pressure campaign: report Federal prosecutors in New York examining Giuliani business dealings with Ukraine: report MORE of corruption without proof\n\nCable networks, most prominently CNN, refused to run the ad based on their policies against promoting lies. But Facebook has refused to remove the ad.\n\nIn letters, statements and its official policies, Facebook has emphasized that it believes politicians should be exempt from many of its rules on speech.\n\nRead more on Warren's fight with Facebook here.\n\nNOT SHARING IS CARING: Instagram on Tuesday announced a new feature that will allow users to manage which third-party apps they will share data with, giving people more control over their personal information.\n\nThe in-app feature will give users the ability to remove third-party apps that the user approved previously for sharing photos, usernames, or other data.\n\nUsers can go to the \"Security\" feature within Instagram's settings and remove authorization for third-party apps that the user no longer wants to share data with.\n\nInstagram will also be rolling out an \"updated authorization screen\" that will notify users when a third-party app is requesting to use their data, with details on the specific types of data the third-party app wants to use. The user can then either block that app or authorize the use of data.\n\nRead more here.\n\nWRITE ALL ABOUT IT: The Save Journalism Project, an advocacy group that works to expose how tech companies have harmed the journalism industry, on Tuesday told The Hill it is launching an effort to fund freelance stories about Big Tech's effect on vulnerable communities.\n\nThe group is aiming to raise $10,000 through Kickstarter. That initial amount would fund five stories, and the Save Journalism Project plans to continue fundraising after hitting that goal.\n\n\"One of the biggest challenges with freelancing is funding the travel, the research, and the time it takes to write the story, all before you can even pitch it – especially for journalists suddenly laid off and adhering to an unexpected budget,\" John Stanton, a co-founder of the Save Journalism Project and former D.C. bureau chief of BuzzFeed News, said in a statement to The Hill.\n\n\"With this Kickstarter funding, freelancers will have the means to follow the lede, get the story, and educate readers before big tech's death grip decimates journalism completely,\" Stanton, who was laid off in January, added.\n\nThe advocacy group was founded by two journalists, both of whom were laid off in recent months, to bring attention to how tech platforms' stranglehold on digital advertising revenue harms local and online news publishers.\n\nSince launching in June, the group has funded a round of advertisements raising awareness about the issue and compiled resources for beleaguered journalists struggling with mental health issues.\n\nRead more here.\n\nALL THE SPACE LADIES: NASA has pushed its planned first all-female spacewalk up at least three days, after a power system failure at the International Space Station, according to The Associated Press.\n\nUnder the revised schedule, astronauts Jessica Meir and Christina Koch will conduct the spacewalk Thursday or Friday to deal with the problem, rather than Monday as originally planned, according to the AP.\n\nThe power failure involved a critical battery power controller, which the astronauts will now replace entirely rather than installing new batteries as first planned.\n\nNASA scheduled its first all-woman spacewalk last spring, but had to reschedule due to a shortage of medium-sized space suits, according to the AP.\n\nRead more here.\n\nTIKTOK BRINGS ON THE LAWMAKERS: Social media app TikTok on Tuesday announced the hire of two former lawmakers for its team that develops content moderation policies.\n\nFormer Reps. Jeff Denham Jeffrey (Jeff) John DenhamBottom line Ex-GOP Rep. Roskam joins lobbying firm Ex-GOP Rep. Denham heads to lobbying firm MORE (R-Calif.) and Bart Gordon (D-Tenn.) will be part of a team from law firm K&L Gates assisting the Chinese-owned firm with developing a vetting approach for videos posted on the platform.\n\nThey will join a committee of outside experts working with TikTok, one of the most rapidly growing apps on the market, to advise on issues such as children's safety, hate speech, misinformation and bullying.\n\nThe hires are part of an effort to \"increase transparency around our content moderation policies and the practices we employ to protect our community\" and develop \"an even deeper bench of internal leaders so that we are well prepared to tackle the challenges that our continued rapid expansion will bring,\" Vanessa Pappas, TikTok's general manager for the U.S., wrote in a statement.\n\nThe 2-year-old app was the most downloaded in the U.S. in 2018, with 663 million downloads, and it may soon begin to receive the scrutiny that other social media giants face from lawmakers and regulators in Washington, given its ties to China.\n\nSen. Marco Rubio Marco Antonio Rubio10 top Republicans who continue to deny the undeniable George Conway hits Republicans for not saying Trump's name while criticizing policy Furious Republicans prepare to rebuke Trump on Syria MORE (R-Fla.) last week urged regulators to investigate the acquisition of social video platform Music.ly by ByteDance, TikTok's parent company.\n\n\"Ample & growing evidence exists that TikTok's platform for western markets, including the U.S., are censoring content in line with #China's communist government directives,\" he tweeted.\n\nHiring Denham and Gordon is the latest in a series of steps that signal TikTok is bracing for harsher regulation.\n\nRead more on TikTok's recent hires here.\n\nA LIGHTER CLICK: Facebook joins the weight loss industry\n\nAN OP-ED TO CHEW ON: It's time to act together to fight against the manipulation of information.\n\nNOTABLE LINKS FROM AROUND THE WEB:\n\nGermany issues 5G rules that stop short of banning Huawei. (Associated Press)\n\nFacebook said politicians can lie in ads. It's taking down ads from Warren, Biden and Trump for other reasons. (Buzzfeed News)\n\nHow Amazon.com moved into the business of U.S. elections. (Reuters)\n\nWashington State keeps enforcing net neutrality as it hails FCC court loss. (Ars Technica)", "description": "Welcome to Hillicon Valley, The Hill's newsletter detailing all you need to know about the tech and cyber news from Capitol Hill to Silicon Valley.", "authors": [], "top_image": "https://thehill.com/sites/default/files/warrenelizabeth_090219gn23_lead.jpg", "published_at": "2019-10-15"}