{"pub": "metro", "url": "https://metro.co.uk/2019/10/17/netflix-sued-panama-papers-law-firm-laundromats-release-10935087", "downloaded_at": "2019-10-17 10:33:27.222432+00:00", "title": "Netflix sued by Panama Papers law firm over The Laundromat’s release", "language": "en", "text": "The Laundromat stars Gary Oldman and Antonio Banderas (Picture: Netflix)\n\nJurgen Mossack and Ramon Fonseca, the two partners involved in the Panama Papers scandal, have filed a lawsuit against Netflix over new film The Laundromat.\n\nThe two individuals behind now-dissolved Panamanian law firm Mossack Fonseca & Co, filed a lawsuit on Tuesday (15 October) claiming the film, set to be released on Friday, is defamatory and could interfere with a criminal trial.\n\nDirected by Steven Soderbergh, the film sees Meryl Streep’s character Ellen Martin investigate the death of her husband in a boat tour, before finding a trail of dodgy dealings traced back to a Panama City law firm run by Jurgen Mossack (Gary Oldman) and Ramon Fonseca (Antonio Banderas).\n\nThe film is inspired by events in 2016 when 11.5 million confidential files at Mossack Fonseca & Co leaked to the public, but the firms founders have taken action against the film on grounds of defamation and trademark infringement.\n\nAdvertisement\n\nAdvertisement\n\nThe lawsuit (available here) claims the lawyers have been allegedly cast falsely as criminals, stating they’re painted as ‘villains profiting from the death of 20 people killed in the small town boat tour’.\n\nThey also claim the film doesn’t have permission to use their firm’s logo, and have called for a restraining order to prevent the film’s release on Friday so it doesn’t interfere with their right to a fair trial in the US.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\n‘Once the cat is out of the bag, it is impossible to put it back without the consequence of tainting a verdict,’ they state in the documents.\n\n‘This is especially true where the cat is named “Laundromat” and the charges would include money laundering.’\n\nIn response, Netflix on Thursday filed a motion to dismiss the case entirely, although they haven’t addressed the matter of a temporary restraining order against the film.\n\nThe Laundromat premiered at Venice and Toronto film festivals and is set to be released worldwide on 18 October on Netflix.\n\nMORE: Who is in the cast of Fractured and what is the new Netflix film about?\n\nMORE: Netflix’s When They See Us hit with lawsuit over interrogation technique", "description": "The firm involved in the Panama Papers scandal has sued Netflix over The Laundromat's release.", "authors": ["Adam Starkey"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/the-laundromat-main-b1ce_1571307406.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-17"}