{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7531991/Yara-Shahidi-cuts-casual-cool-figure-button-jumpsuit-chic-gold-heels.html", "downloaded_at": "2019-10-05 08:33:13.440013+00:00", "title": "Yara Shahidi cuts a casual cool figure in button down jumpsuit with chic gold heels", "language": "en", "text": "Yara Shahidi helped raise awareness in style at The Power Of Inclusion summit.\n\nThe 19-year-old activist and actress was a vision of casual cool style in a white button down jumpsuit from COS with golden high heels.\n\nYara exuded confidence as she posed up a storm ahead of the event, held in Auckland, New Zealand on Wednesday.\n\nDoing good: Yara Shahidi helped raise awareness in style at The Power Of Inclusion summit in Auckland, New Zealand on Wednesday\n\nShe jazzed up the simple yet chic style with a colorful bracelet and gold hoop earrings.\n\nThe star of Grown-ish looked simply delighted to be in attendance, and commanded attention while speaking with the crowd on stage.\n\nYara is just one of numerous speakers who have been invited to the event.\n\nFor the next two days, more than 60 speakers will be sharing stories relating to the summit's theme of inclusion and representation.\n\nGolden girl: She jazzed up the look with gold hoop earrings\n\nExpressing herself: Yara is just one of numerous guests who have been invited to express themselves at the event\n\nA Harvard student, Yara has been using her platform to raise awareness for issues ranging from human rights to elections. She even founded Eighteen by 18, which encourages young adults to vote.\n\nIn an interview with Town & Country, Yara said her interest in civic engagement stemmed from her 'humanitarian family.'\n\n'My love of history, or even being socially engaged, stems from having, firsthand, people to care about around the globe and at a young age expanding my community beyond these fake borders we put on each other,' she said.\n\nAside from activism, Yara is also a successful actress with roles in the hit series Black-ish and Grown-ish.", "description": "Yara exuded confidence as she posed up a storm ahead of the event, which took place at Auckland, New Zealand on Wednesday.", "authors": ["Christine Rendon For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/03/04/19236410-0-image-a-107_1570072808539.jpg", "published_at": "2019-10-03"}