{"pub": "yahoo", "url": "https://sports.yahoo.com/astros-fan-pelted-with-beer-at-yankee-stadium-reaches-local-celebrity-status-at-world-series-022524777.html", "downloaded_at": "2019-10-23 10:31:51.717928+00:00", "title": "Astros fan pelted with beer at Yankee Stadium gets free tickets, celebrity treatment at World Series", "language": "en", "text": "HOUSTON — Cruz Arcia Jr. took a sip of his beer and was mid-sentence when another Astros fan came his way.\n\nHe looked at Arcia like many people already had before Game 1 of the World Series at Minute Maid Park.\n\n“Are you the guy?” he asked Arcia.\n\nScroll to continue with content Ad\n\nHe was the guy — the guy who got pelted with beer and food at Yankee Stadium in Game 5 of the American League Championship Series, the guy who police had to escort out of his seats, the guy who then taunted the Yankees fans with a 3-1 hand gesture, the guy who immediately became a Houston legend in that moment.\n\nThis Astros fan had to be escorted from his seat after getting beer and popcorn thrown in his face\n\n\n\n(via mhjay_/Instagram) pic.twitter.com/Zj438VT6pP — Bleacher Report MLB (@BR_MLB) October 19, 2019\n\nThe whole encounter went viral on social media. It also caught the attention of a number of Houston Astros players. Chief among them was pitcher Lance McCullers Jr., who saw the video of Arcia and sent out a tweet asking fans to find Arcia so he could give him World Series tickets.\n\nTwitter did its job and now here he was Arcia, wearing the same Jose Altuve jersey that soaked up the beer in the Bronx and sitting in section 127, what he called “really good seats” courtesy of McCullers.\n\n“Can you tell me the story?” the other Astros fan asked Arcia, and so he did. He talked about how he and his friends showed up at Yankee Stadium and they were warned first by their Uber driver and then by a police officer at the stadium not to wear their Astros gear inside the stadium.\n\nHe talked about the taunts and trash talk that lasted for innings.\n\n“People kept saying ‘Take your BBQ [expletive] home’,” Arcia said.\n\nStory continues\n\nThings got ugly, Arcia says, when he went to get some food. A Yankees fan asked to take a picture with Arcia. That’s when, Arcia says, the Yankees fan tried to knock his food out of his hand while they took a selfie. Arcia ended up spilling his food on the Yankees fan and other nearby fans starting throwing things at him.\n\nCell phone video caught Arcia being saved by officers and then taunting the Yankees fans throwing things at him as he was escorted to new seats.\n\n“If I hit someone, I’m gonna piss one person off,” Arcia told his fellow Astros fan. “If I throw up 3-1, I’m gonna piss everybody off. People were throwing beer and I didn’t care. I knew it was getting them mad.”\n\n“You went out like a beast,” the other fan tells Arcia.\n\nArcia, a 21-year-old who works in IT, estimated that about 50 Astros fans had come up to him before Game 1 and either wanted to take a picture or shake his hand. He got three tickets from McCullers and came to Game 1 with the same two friends who were with him in New York. The three of them went to “pretty much every game this season.”\n\nThey had planned a birthday trip to New York trip two months ago. When it lined up with the Astros playing there in the ALCS, they had to get tickets.\n\n“To me, it was worth it,” Arcia told Yahoo Sports. “Even if I didn’t get the free tickets it was worth it because I was out there representing my city. I didn’t do this because I expected it to go viral. I did it because I love Houston. I’ll go over there next year and rep my city again.\n\n“My phone hasn’t stopped ringing for the last three days,” Arcia said. “I’ve gotten so much love from all my Houston people. Everyone’s been tweeting at me, sending me text messages. There’s people sending me money on Venmo and Cash App saying, “Get you a new shirt. Get you a beer.’”\n\nAs he’s saying that, another Astros fan comes up to Arcia wants to snap a picture. He happily obliges. He’ll play the local celebrity role as long as the Astros World Series run will allow.\n\n“I was planning on being here anyway,” Arcia said. “But I know I wouldn’t be able to afford these tickets. I’d be sitting way up there.\n\n“Shout out to Lance — the real MVP.”\n\n———\n\nMike Oz is a writer for Yahoo Sports. Have a tip? Email him at mikeozstew@yahoo.com or follow him on Twitter! Follow @mikeoz\n\nMore from Yahoo Sports:\n\n\n\n", "description": "Astros fan Cruz Arcia Jr. went viral after Yankees fans threw beer and food at him. Now we got free tickets from an Astros player.", "authors": ["Mike Oz"], "top_image": "https://s.yimg.com/ny/api/res/1.2/OTEATkshbwT1FR.1zbxrOg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/qVPeYFA_esGpk6GgmPGgKA--~B/aD0zMDI0O3c9NDAzMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/be80da40-f538-11e9-befb-42c4ac9eabab", "published_at": "2019-10-23"}