{"pub": "politico", "url": "https://politico.eu/article/brexit-proposals-do-not-match-even-remotely-the-irish-backstop-meps-say", "downloaded_at": "2019-10-04 01:22:48.879916+00:00", "published_at": "2019-10-03", "title": "Brexit proposals ‘do not match even remotely’ the Irish backstop, MEPs say", "language": "en", "text": "Boris Johnson speaking in Dublin | Lorraine O'Sullivan/AFP via Getty Images Brexit proposals ‘do not match even remotely’ the Irish backstop, MEPs say European Parliament’s Brexit Steering Group rejects Boris Johnson’s latest plan.\n\nThe U.K. government's latest plans for a Brexit deal “fall short of commitments” and “do not match even remotely” the backstop to prevent a hard border in Ireland, according to the European Parliament’s Brexit Steering Group.\n\nBritish Prime Minister Boris Johnson's proposal envisions setting up a customs border between Northern Ireland and Ireland, and a regulatory border between Northern Ireland and the rest of the U.K. These would be managed by so far unclear systems away from the border, all underpinned by consent from the Northern Ireland Assembly. In effect, Northern Ireland would stay in the EU's single market, but the U.K. as a whole would leave the bloc's customs union.\n\nBut MEPs, who must give their final consent to any withdrawal deal, pointed out three major flaws.\n\n“The proposals do not address the real issues that need to be resolved, namely the all-island economy, the full respect of the Good Friday Agreement and the integrity of the Single Market,\" the statement says.\n\nOn customs and on regulatory aspects, they “explicitly provide for infrastructure, controls and checks,\" but are “unclear as to exactly where and how these would be carried out.” (However, Johnson pledged in the House of Commons today that his customs plan would “not involve physical infrastructure at or near the border or indeed at any other place.”)\n\nIn effect, under Johnson's proposal, Northern Ireland would stay in the EU's single market, but the U.K. as a whole would leave the bloc's customs union.\n\nThe group also says the proposals would “operationally only be worked out in detail by the EU and the UK, or in the UK unilaterally, during the fourteen-month transition period. This does not provide the necessary certainty or fulfil the agreed principles in the Withdrawal Agreement.”\n\nThe statement adds: \"The BSG does not find these last minute proposals of the UK government of 2 October, in their current form, represent a basis for an agreement to which the European Parliament could give consent.\"\n\nThe scheme puts the \"deal under custody of DUP [Northern Ireland's Democratic Unionist Party],\" the group's chairman, Guy Verhofstadt, tweeted. \"This is repackaging old, bad ideas.\"", "description": "European Parliament’s Brexit Steering Group rejects Boris Johnson’s latest plan.", "authors": ["Maïa De La Baume", "David M. Herszenhorn", "Charlie Cooper", "Jacopo Barigazzi", "Hans Von Der Burchard"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/10/GettyImages-1166916754-1200x628.jpg"}