{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/tragedy-woman-82-kills-lifelong-20717204", "downloaded_at": "2019-10-25 00:43:35.201098+00:00", "title": "Tragedy as woman, 82, kills lifelong friend in freak parking accident", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA pensioner caused the tragic death of her ‘lifelong’ friend in a freak parking accident.\n\nA court heard of the ‘guilt and horror’ felt by Patricia Tulip, 82, in the aftermath of the incident.\n\nShe had pulled up outside Joyce Nainby’s home and left her automatic car in reverse instead of neutral.\n\nAs she and passenger Mrs Nainby, 80, got out, the car began to roll backwards as the handbrake was not fully engaged.\n\nTulip got back in to try to stop it, but hit the accelerator instead of the brake by mistake.\n\nThe car shot backwards and Mrs Nainby was knocked over by her still partially open door. She suffered injuries from which she died 10 day later.\n\nHer close friend pleaded guilty to causing her death by careless driving during an appearance at Newcastle Crown Court.\n\nAfter the case, the victim’s family said: “The verdict gives us the closure we need and allows us to move on, which is what our mum and dad would want for us.”\n\nThey thanked hospital staff and friends for their support following the tragedy on Sept 18 last year, and police for their ‘tenacity and professionalism’ in seeking justice.\n\nThe court heard Tulip’s Skoda Roomster had pulled up outside her friend’s home in Brunton Park, Newcastle, when tragedy struck.\n\nJudge Amanda Rippon said: “They both got out. Mrs Tulip believed she had selected park but unintentionally selected reverse gear and failed to apply the handbrake sufficiently.\n\n“The vehicle crept backwards and she re-entered the vehicle and unintentionally pressed the accelerator. This rear movement caused the vehicle to hit Mrs Nainby, it’s suggested she was hit by the inside of the door and propelled backwards.”\n\nThe passenger door was not closed properly as another passenger was going to get out of the back, and swung open, hitting Mrs Nainby, the court heard.\n\n“Mr Nainby says nothing I can do can help alleviate the pain and suffering they have gone through after this tragic incident,” the judge added.\n\nBut the victim’s family recognised Mrs Tulip ‘as a lifelong friend of their mother and wife and she will no doubt feel the horror of what has happened in an acute way’.\n\n“I’m sure they acknowledge the guilt and horror she will feel,” she added.\n\nTulip, of Seghill, Northumberland, will be sentenced on December 3.\n\nShe has now given up her licence but was given an interim driving ban before being released on unconditional bail.", "description": "Patricia Tulip accidentally left her automatic car in reverse and as she attempted to stop it she hit the accelerator instead of the brake by mistake and knocked over Joyce Nainby", "authors": ["Jeremy Armstrong", "Image", "Newcastle Chronicle"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20717016.ece/ALTERNATES/s1200/0_Patricia-Tulip.jpg", "published_at": "2019-10-24"}