{"pub": "washingtonpost", "url": "https://washingtonpost.com/business/2019/09/30/shareholder-lawsuit-alleges-securities-fraud-overstockcom", "downloaded_at": "2019-10-01 00:11:37.351888+00:00", "title": "Shareholder lawsuit alleges securities fraud at Overstock.com", "language": "en", "text": "Byrne resigned Aug. 22 after saying he had become entangled in a “deep state” investigation of the 2016 presidential election and had romanced Russian agent Maria Butina at the urging of the federal government. In his resignation letter, Byrne said his departure was “for the good of the firm.”\n\nAD\n\nShares of Overstock are plummeting after the CEO says he aided in ‘Russian investigation’\n\nThe lawsuit alleges that Overstock shares were “artificially inflated” because of the company’s plan to pay its next dividend, scheduled in the fall, via a company-issued cryptocurrency that could not be resold for at least six months. That plan, the lawsuit alleges, was designed to punish short-sellers who bet against the company. What ensued, the lawsuit alleges, was a “short squeeze” that drove up Overstock’s share price nearly 70 percent, from about $16 to $27, over several days.\n\nAD\n\nAs a result, Ha alleges, he and other shareholders paid “artificially inflated prices” for Overstock stock. Ha is seeking a jury trial.\n\nAccording to government filings, Byrne sold 4.7 million shares between Sept. 16 and Sept. 18.\n\nAD\n\nOn Sept. 18, Overstock announced that it was postponing its digital dividend by three to six weeks. That same day, Byrne said in an open letter to former colleagues that he sold his shares after he received a tip — by text message — that some brokers were overheard on Sept. 12 and 13 at the Bobby Van’s Steakhouse near Wall Street saying that the U.S. Securities and Exchange Commission was going to “put the kibosh on the dividend.”\n\nOverstock’s former CEO sells off his $90M stake, saying he’s worried about ‘Deep State’\n\nHe said he had notified Overstock executives in mid-August of his intention to sell his stake in September. “Now I was in a quandary,” he wrote on his blog. “My decision was made and instructions given three weeks earlier. But now I had also heard a rumor that the SEC was leaking something. What were my duties to the marketplace? Legally, I had none, I think, but it seemed ethically problematic. Do I have inside information if I hear the SEC is leaking something? Or does the fact that the SEC is leaking it make it not inside information?”\n\nAD\n\nLess than a week later, on Sept. 23, Overstock disclosed that its chief financial officer, Greg Iverson, had departed the company on Sept. 17. It also lowered its earnings forecast for the year, citing “significantly” higher costs related to tariffs, insurance and freight shipping. Plus, the company said, customer demand for its retail goods was waning.\n\nAD\n\nThe company’s shares fell more than 18 percent that day. Byrne’s 4.7 million shares — which he sold for between $16.32 and $21.84, for a total of $91.8 million — would have been worth $52.8 million at Sept. 23’s closing price of $11.23.\n\nByrne and Iverson did not respond to requests seeking comment. A spokesman for Overstock said “the company disagrees” with the allegations. “We will vigorously defend the lawsuit and we expect to win,” he said in an email.\n\nAD\n\nInside Overstock.com, where a firebrand CEO and ‘Deep State’ intrigue took center stage\n\nA spokeswoman for the SEC declined to comment.\n\nOverstock’s trading platform for digital currencies, tZero, has been the subject of a years-long SEC investigation. (In August, Byrne joked on a call with investors that Overstock should give investigators “an office within tZero. They have spent so much of the last two years, three years there.”)\n\nOverstock, which is based near Salt Lake City, got its start in 1999 selling excess inventory, such as bedsheets, exercise machines and Star Wars figurines. The company grew rapidly during the dot-com bust, as it sold off excess merchandise from struggling websites. In recent years, though, Byrne shifted his focus to the company’s growing blockchain business.\n\nAD", "description": "The class-action complaint accuses the retailer and two former executives of trying to “deceive the market” in order to inflate its stock price.", "authors": ["Abha Bhattarai", "Reporter Covering The Retail Industry"], "top_image": "https://www.washingtonpost.com/resizer/seY0A6ReRWmc8kkO7bVKz7FX5p0=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RHL3UGWFAUI6TC7XZXRNTYEQKU.jpg", "published_at": "2019-09-30"}