{"pub": "japantoday", "url": "https://japantoday.com/category/sports/cole's-streak-ends-as-nats-rough-up-astros-ace-in-game-1", "downloaded_at": "2019-10-23 10:52:28.004439+00:00", "title": "Cole's streak ends as Nationals rough up Astros ace in Game 1 of World Series", "language": "en", "text": "Houston Astros starting pitcher Gerrit Cole wipes his fave after giving up a double to Washington Nationals' Juan Soto during the fifth inning of Game 1 of the baseball World Series Tuesday n Houston.\n\nbaseball\n\nBy KRISTIE RIEKEN\n\nGerrit Cole trudged slowly off the mound, wiped the sweat from his upper lip and took a handshake and pat on the backside from manager AJ Hinch.\n\nWalking away without a lead — not something Cole and the Houston Astros are used to. Certainly not what they expected in the World Series opener.\n\n\"He's been so good for so long that there builds this thought of invincibility and that it's impossible to beat him,\" Hinch said. \"So when it happens it is a surprise to all of us.\"\n\nThe Washington Nationals roughed up Cole for five runs in seven innings Tuesday night, beating Houston 5-4 to jump ahead in the best-of-seven series.\n\nCole suffered his first loss since May 22. Set to cash in as a free agent this offseason, he had won a single-season record 19 consecutive decisions. His postseason prior to Tuesday was nearly perfect: 3-0 record, one run allowed, and 32 strikeouts in 22 2/3 innings.\n\nIn his first World Series appearance and ninth postseason game, the 29-year-old right-hander gave up his most runs since the White Sox tagged him for six in that May 22 loss.\n\n\"I didn't have my A-game tonight,\" Cole said. \"Outside of a few pitches that tacked on a few runs, we worked pretty well with what we had. These are the two best teams in the world right now so you try not to beat yourself up too much, especially if you've got to grind in those situations.\"\n\nThe Astros gave Cole a lead with a two-run first, but a shot by Ryan Zimmerman an inning later cut the advantage to 1. Cole didn't even turn around to watch where that one landed, simply throwing his right hand up and preparing for the next pitch.\n\nHouston still had the lead when 20-year-old Juan Soto knocked a fastball from Cole onto the train tracks atop left field. Soto struck again in the fifth, lining a two-run double that stretched Washington's edge to 5-2.\n\n\"The Zimmerman pitch was a mistake, and Zimmerman made him pay with a homer,\" Hinch said. \"He never really controlled Soto the whole night. He punched him the first at-bat and then after that Soto took some really good swings.\"\n\nAlong with teammate and Game 2 starter Justin Verlander, Cole is a favorite for the AL Cy Young Award. He led the league with a 2.50 ERA, and he allowed just seven home runs over the last two months of the regular season. No lineup had connected for two home runs against him since Colorado on Aug. 7, a span of 11 starts.\n\nThat award-worthy stuff just wasn't there.\n\nCole struck out six, his lowest total since punching out four on Aug. 1 against Cleveland. After leading the majors with a career-high 326 strikeouts, he never looked so dominant Tuesday. His slider — a swing-and-miss machine this postseason — lacked bite. He threw the pitch 27 times and got just three whiffs.\n\n\"These guys are really tough to put away,\" Hinch said. \"They don't strike out a lot. And they proved tonight they're putting the ball in play.\"\n\n\"The curveball wasn't there until the last two innings,\" catcher Martín Maldonado added. \"The slider was back and forth — one good one, one bad one.\"\n\nCole allowed a single in a scoreless sixth and struck out two in a sharp seventh. By then his fate was all but sealed and instead of helping Houston take advantage of home-field advantage from its 107-win season, his uncharacteristic outing left the Astros in a hole as they chase their second title in three seasons.\n\n© Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "Gerrit Cole trudged slowly off the mound, wiped the sweat from his upper lip and took a handshake and pat on the backside from manager AJ Hinch. Walking away without a lead — not something Cole and the Houston Astros are used to. Certainly not what they expected in the…", "authors": [], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/74/4d/da2af6bd9248a08942cb252b0eed653c1d8c/urn:publicid:ap.org:598f52d369bc4dc08c0176c2fcbf3af2.jpg", "published_at": "2019-10-23"}