{"pub": "reuters", "title": "VW retains access to U.S. public sector contracts, gets second monitor at HQ: Handelsblatt", "url": "https://reuters.com/article/us-volkswagen-usa/vw-retains-access-to-u-s-public-sector-contracts-gets-second-monitor-at-hq-handelsblatt-idUSKCN1VN0EC", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 09:02:51.194864+00:00", "text": "FILE PHOTO: A Volkswagen logo is seen at Serramonte Volkswagen in Colma, California, U.S., October 3, 2017. REUTERS/Stephen Lam\n\nFRANKFURT (Reuters) - Volkswagen (VOWG_p.DE) will not be excluded from public sector contracts in the United States but will instead install a second U.S. monitor at its German headquarters, business daily Handelsblatt reported on Monday.\n\nThe German carmaker had been concerned that an Environmental Protection Agency (EPA) investigation into excess diesel emissions in hundreds of thousands of U.S. vehicles might result in an exclusion, the paper said, citing company sources.\n\nBut an agreement had been reached with the EPA prequalifying VW for public sector contracts, in exchange for a three-year monitoring process that is due to begin this autumn, the paper said, citing company sources.\n\nThis was especially important for its MAN Energy Solutions subsidiary that produces big diesel engines, some of which are used by the U.S. Navy, they said.\n\nThe German automaker admitted using illegal software to cheat U.S. pollution tests in 2015, triggering a global backlash against diesel vehicles.\n\nSince 2017, VW has been laying open legal violations around the test manipulations to an external compliance monitor, Larry Thompson, a former deputy U.S. attorney general, and taking steps to changing compliance and conduct.\n\nThe second monitoring process, to be led by John Hanson of Artifice Forensic Financial Services, would be smaller in reach, less staff-intensive and less comprehensive than Thompson’s, the paper said.\n\n(This story has been refiled to add dropped word from headline)", "description": "Volkswagen will not be excluded from public sector contracts in the United States but will instead install a second U.S. monitor at its German headquarters, business daily Handelsblatt reported on Monday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190902&t=2&i=1425313167&w=1200&r=LYNXNPEF810I4"}