{"pub": "theverge", "url": "https://theverge.com/2019/10/29/20938212/uber-lawsuit-la-ladot-scooter-data-mds", "downloaded_at": "2019-10-29 23:59:58.876137+00:00", "title": "Uber sues Los Angeles as the fight over scooter data escalates", "language": "en", "text": "The fight between the city of Los Angeles and scooter companies over location data is heating up. On Monday, Uber filed a lawsuit against LA’s Department of Transportation (LADOT) pushing back against the requirement that scooter operators share anonymized real-time location data with the city.\n\nThe suit, which was first reported by CNET but has yet to be filed in LA Superior Court, centers on LADOT’s use of a digital tool called the mobility data specification program (MDS). The department created the tool as a way to track and regulate all of the electric scooters that are operating on its streets. MDS provides the city with data on where each bike and scooter trip starts, the route each vehicle takes, and where each trip ends. LADOT has said the data won’t be shared with police without a warrant, won’t contain personal identifiers, and won’t be subject to public records requests.\n\nMDS has proven controversial with scooter companies\n\nNaturally, MDS has proven controversial with scooter companies, which have balked over having to share location data with the city. It’s growing into a bigger problem beyond LA. Cities such as Columbus, Chattanooga, Omaha, San Jose, Seattle, Austin, and Louisville are demanding scooter companies agree to share data through MDS as a condition for operating on their streets.\n\nUber, which owns the dockless scooter and bike company Jump, said MDS would lead to “an unprecedented level of surveillance” and vowed to stop it. It’s leaning on a recent analysis by California’s Legislative Counsel to make its argument. The counsel said MDS could violate the California Electronic Communications Privacy Act, which was signed into law in 2015.\n\nIn August, Uber and Lyft sent a letter to California Attorney General Xavier Becerra, in which the companies argued that LADOT was exceeding its authority with MDS.\n\n“While we support the creation of a global standard for data-sharing for local municipalities, it appears that certain city MDS requirements may be in violation of CalECPA,” the companies wrote. “We have repeatedly raised concerns directly with these municipalities throughout the development and implementation of MDS, and yet they continue to require the MDS as a condition of our operating permits.”\n\nIn a statement, Uber said that it has exhausted its options and had “no choice” but to sue the city.\n\n“Jump riders in Los Angeles have a reasonable expectation of privacy in the trip data created from riding on our bikes and scooters. Independent privacy experts have clearly and repeatedly asserted that a customer’s geolocation is personally identifiable information, and - consistent with a recent legal opinion by the California legislative counsel - we believe that LADOT’s requirements to share sensitive on-trip data compromises our customers’ expectations of data privacy and security. Therefore, we had no choice but to pursue a legal challenge, and we sincerely hope to arrive at a solution that allows us to provide reasonable data and work constructively with the City of Los Angeles while protecting the privacy of our riders.”\n\nA spokesperson for LADOT did not immediately respond to a request for comment. In an interview with The Verge on September 9th, LADOT director Seleta Reynolds said that the city “encoded” privacy protections into the regulations in order to give them “the force of law.”\n\nShe added that it’s a “Day One job and a forever job” of city officials to make sure that the “open source tools that we build do not become tools that people can use to invade the privacy of others.”\n\nUpdated October 29th, 3:01PM ET: “LADOT has the responsibility to manage the public right-of-way, ensuring safety and access for everyone,” a spokesperson said in a statement. “To be effective, the department requires reasonable information about the tens of thousands of shared vehicles operated by transportation technology companies that use our streets for profit. While all other permitted scooter and bike companies are complying with our rules — Uber has repeatedly refused. LA’s requirements have been clear since last November, and Uber agreed to abide by them. By 5 pm Tuesday, we expect Uber to come into compliance or they will face suspension proceedings, which could eventually lead to revocation of their permit.”", "description": "The fight between the city of Los Angeles and scooter companies over location data is heating up. On Monday, Uber filed a lawsuit against LA’s Department of Transportation (LADOT) pushing back against the requirement that scooter operators share anonymized real-time location data with the city.", "authors": ["Andrew J. Hawkins", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/FiZQfetM98TnYsvgxuFkrBe0mKw=/0x170:4800x2683/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19328358/1163246012.jpg.jpg", "published_at": "2019-10-29"}