{"pub": "zdnet", "url": "https://www.zdnet.com/article/sec-pauses-telegrams-1-7b-cryptocurrency-play", "downloaded_at": "2019-10-14 02:10:05.670810+00:00", "title": "SEC pauses Telegram's $1.7b cryptocurrency play", "language": "en", "text": "Secure messaging app Telegram has had its cryptocurrency play paused by the United States Securities and Exchange Commission (SEC), alleging the token offering was unregistered.\n\nThe SEC on Friday filed an emergency action and obtained temporary restraining order against Telegram and a related entity regarding the initial coin offering (ICO). According to the SEC, the token offering has raised more than $1.7 billion of investor funds.\n\nThe SEC's complaint says Telegram Group Inc. and its wholly-owned subsidiary TON Issuer Inc. began raising capital in January 2018 to finance the companies' business, which included the development of the Telegram Open Network (TON) blockchain.\n\nTON is a project designed to introduce blockchain-based payments within the Telegram messaging app.\n\nTelegram sold approximately 2.9 billion digital \"Gram\" tokens to 171 initial purchasers, globally, the SEC said.\n\nSee also: What should you do when your ICO is dead in the water? Flog it on eBay\n\nThe complaint continues, saying Telegram promised to deliver the Grams to the initial purchasers upon the launch of its blockchain by no later than 31 October 2019, at which time the purchasers and Telegram will be able to \"sell billions of Grams into US markets\".\n\nIt alleges Telegram failed to register its offers and sales of Grams, which are securities -- a violation of the registration provisions of the Securities Act of 1933.\n\n\"Our emergency action today is intended to prevent Telegram from flooding the US markets with digital tokens that we allege were unlawfully sold,\" Co-Director of the SEC's Division of Enforcement Stephanie Avakian said.\n\n\"We allege that the defendants have failed to provide investors with information regarding Grams and Telegram's business operations, financial condition, risk factors, and management that the securities laws require.\"\n\nAvakian's fellow co-director Steven Peikin said the SEC has repeatedly stated that issuers cannot avoid the federal securities laws just by labelling a product a cryptocurrency or digital token.\n\n\"Telegram seeks to obtain the benefits of a public offering without complying with the long-established disclosure responsibilities designed to protect the investing public,\" he added.\n\nCryptocurrency trading platform Coinbase last month said it was considering the viability of adding Telegram to its platform, alongside 16 other digital assets. Telegram's potential inclusion may eventually connect the Coinbase platform to TON.\n\nThe SEC earlier this month reached a civil settlement with blockchain company Block.one relating to an unregistered ICO it undertook in 2017-18.\n\nBlock.one said it would pay a $24 million fine whilst \"neither admitting nor denying the SEC's findings\".\n\nSee also: These are the warning signs of a fraudulent ICO\n\nSimilarly, the commission in June announced it was suing Kik Interactive Inc, alleging the Canada-based chat platform conducted an illegal $100 million securities offering of digital tokens.\n\nAt the time, the SEC said that Kik sold digital tokens to US investors without registering the ICO -- a requirement under US securities laws.\n\nThe SEC's action against Telegram follows Facebook's entry into the cryptocurrency world looking even more unlikely, with Mastercard, Visa, eBay and Stripe all dropping out of the social media giant's Libra payments network.\n\nFacebook announced Libra in June, saying it intended to roll out a digital coin in 2020 that would integrate with Facebook services and provide the asset required for e-commerce transactions on its platform.\n\nSeveral major backers were supporting the project at the outset, with the members to form the Geneva-based Libra Association, a consortium to oversee the cryptocurrency and the development of its underlying blockchain.\n\nOther initial members of the consortium included Uber, Lyft, Spotify, Vodafone, Mercado Pago, PayU, and others.\n\nSEE ALSO", "description": "The Securities and Exchange Commission has taken emergency action to halt the digital token offering that has already raised $1.7 billion.", "authors": ["Asha Barbaschow"], "top_image": "https://zdnet2.cbsistatic.com/hub/i/r/2018/04/13/ea263f81-1835-44d2-b109-924a14ae744c/thumbnail/770x578/ff935c018353573ad1de67a423b81034/telegram.jpg", "published_at": "2019-10-14"}