{"pub": "nymag", "url": "https://vulture.com/2019/10/hbo-his-dark-materials-trailer.html", "downloaded_at": "2019-10-03 23:33:12.709461+00:00", "published_at": "2019-10-03", "title": "Watch the Trailer for HBO’s Adaptation of His Dark Materials", "language": "en", "text": "With Game of Thrones over, HBO is betting big, very big, on another fantasy-series adaptation. The network has released a new trailer for its take on Philip Pullman’s His Dark Materials book series (you might best remember them from the title of the first book, The Golden Compass, which was adapted into a movie we don’t talk about). The series stars Logan’s Dafne Keen as the books’ hero Lyra, with James McAvoy as the intrepid Lord Asriel, Ruth Wilson as a frighteningly stern Mrs. Coulter, and Lin-Manuel Miranda trying his darndest to seem gritty as balloonist adventurer Lee Scoresby. Jack Thorne (Harry Potter and the Cursed Child) is writing the show, while Tom Hooper is directing the first two episodes. The project is a co-production with the BBC and reportedly one of the most expensive British drama series to date. You can watch the first trailer below.\n\nThe first season of His Dark Materials follows Lyra, “a seemingly ordinary but brave young woman from another world,” per an HBO release. “Her search for a kidnapped friend uncovers a sinister plot involving stolen children, and becomes a quest to understand a mysterious phenomenon called Dust. As she journeys through the worlds, including our own, Lyra meets Will, a determined and courageous boy. Together, they encounter extraordinary beings and dangerous secrets, with the fate of both the living — and the dead — in their hands.” In short: Please don’t cancel your subscriptions, we put Ruth Wilson in a really intimidating coat!", "description": "Watch the trailer for HBO’s big adaptation of Philip Pullman’s “His Dark Materials” book series produced with the BBC starring Ruth Wilson, Lin-Manuel Miranda, and more.", "authors": ["Jackson Mchenry"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/03/03-his-dark-materials.w1200.h630.jpg"}