{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-royals-botswana/prince-harry-travels-to-botswana-for-next-leg-of-africa-tour-idUKKBN1WB0LN", "downloaded_at": "2019-09-26 07:56:22.767505+00:00", "title": "Prince Harry travels to Botswana for next leg of Africa tour", "language": "en", "text": "JOHANNESBURG (Reuters) - Britain’s Prince Harry was due to travel to Botswana on Thursday to visit conservation and health projects on the next leg of his family’s southern African tour.\n\nBritain's Prince Harry and his wife Meghan, Duchess of Sussex, holding their son Archie, meet Archbishop Desmond Tutu at the Desmond & Leah Tutu Legacy Foundation in Cape Town, South Africa, September 25, 2019. REUTERS/Toby Melville/Pool\n\nHarry, his wife Meghan and their four-month-old son Archie landed in South Africa on Monday for their first overseas tour as a family.\n\nThey drew crowds of well-wishers on their first three days in Cape Town, where they visited non-governmental organisations working with vulnerable communities and the youth.\n\nOn Wednesday, much attention was focused on Archie, who sat on his mother’s lap as the royal couple chatted with Nobel Peace Prize laureate Desmond Tutu at Tutu’s charitable foundation.\n\nHarry, the Queen’s grandson and sixth in line to the British throne, has been visiting southern Africa for two decades for holidays and conservation work.\n\nOn Thursday, he was to start a solo visit to Botswana while the Duchess of Sussex and Archie were to remain in Cape Town.\n\nHarry’s visit to Botswana will begin at a conservation project where he will join school children to plant trees and raise awareness of the fragility of local ecosystems.\n\nHe will then visit a project run by his charity Sentebale which focuses on improving the mental health of young people affected by HIV.\n\nHe will also dedicate an area of forest to the Queen’s Commonwealth Canopy, a project to facilitate the passage of wildlife near the border with Namibia, Zambia and Zimbabwe.\n\nBotswana holds special memories for Harry as it is where he and Meghan visited on holiday shortly after they began dating in July 2016 and returned in 2017.\n\nNext Harry is expected to fly to Angola, where he will visit the landmine clearance project that featured in some of the most famous photographs of his late mother, Princess Diana.\n\nHe ends the solo section of his tour in Malawi, where he will meet President Peter Mutharika, before rejoining Meghan and Archie in South Africa for another township visit, this time near Johannesburg.", "description": "Britain's Prince Harry was due to travel to Botswana on Thursday to visit conservation and health projects on the next leg of his family's southern African tour.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190926&t=2&i=1434043156&w=1200&r=LYNXMPEF8P0DE", "published_at": "2019-09-26"}