{"pub": "realclearpolitics", "url": "https://thehill.com/homenews/administration/466422-top-advisers-economic-warned-trump-on-reelection-chances-ahead-of", "downloaded_at": "2019-10-19 10:42:10.143047+00:00", "title": "Top economic adviser warned Trump on reelection chances ahead of China truce: report", "language": "en", "text": "President Trump Donald John TrumpFlorida GOP lawmaker says he's 'thinking' about impeachment Democrats introduce 'THUG Act' to block funding for G-7 at Trump resort Kurdish group PKK pens open letter rebuking Trump's comparison to ISIS MORE’s top economic adviser arranged a meeting in the Oval Office last week with outside experts who told the president that a continued escalation of the trade war between the U.S. and China could hurt both the economy and Trump’s reelection chances in 2020, The Wall Street Journal reported.\n\nLarry Kudlow Lawrence (Larry) Alan KudlowMORE, the director of the White House National Economic Council, set the meeting for Oct. 8, just two days before Chinese and U.S. officials were scheduled to meet to negotiate trade talks, according to the Journal, citing people familiar with the meeting.\n\nADVERTISEMENT\n\nStephen Moore Stephen MooreNancy Pelosi's gut-check moment on trade and the USMCA Trump adviser: 'He should stop saying things that are untrue' The 'trust busters' versus Google MORE, an economic commentator and former Federal Reserve Board candidate, as well as Lawrence Lindsey, a Republican economist, were reportedly present.\n\n“There was a general consensus that the economy was really strong, the best economy we’ve had in 30 years, and that what’s going to get him reelected is the economy,” Moore said, according to the report.\n\n“We all agreed that the uncertainty about the trade situation with China is a negative,” he continued.\n\nMoore and his colleagues reportedly urged Trump to resolve the trade tensions, saying it would remove “that obstacle to growth right now, you’ll see a nice rebound in 2020, and he’ll be in a very strong position to get reelected,” the Journal reported.\n\nBut Trump during the meeting pointed the finger at the Federal Reserve, saying it deserves to share blame for the economic downturn.\n\nTrump has called on the Fed for months to cut interest rates more drastically than their previous moves. Moore told the Journal that Fed Chairman Jerome Powell and Trump are “in a much better place now.” Trump has been a vocal critic of Powell.\n\nTrump also reportedly called in one of his closest advisers on China, Peter Navarro, into the meeting. Navarro has said the tariffs on Chinese goods are not hurting the U.S.\n\n“Where’s Peter?” Trump said, the Journal reported. “Get Navarro in here.”\n\nNavarro reportedly joined the meeting minutes later.\n\nIt was not immediately clear what impact the meeting had on the president’s stance on trade talks with China.\n\nLast week, the U.S. agreed to delay a round of tariff increases on Chinese goods, and China agreed to increase spending on U.S. agricultural goods.\n\nBut tariffs still remain on $360 billion in Chinese imports.\n\nA Trump administration official confirmed to the Journal that the president hears from a number of different advisers before making decisions on trade talks. The official said his support of the last week’s “first phase” limited trade deal was based on Treasury Secretary Steven Mnuchin Steven Terner MnuchinTop economic adviser warned Trump on reelection chances ahead of China truce: report The Hill's Morning Report - Tempers boil over at the White House Schumer seeks focus on health care amid impeachment fever MORE and U.S. Trade Representative Robert Lighthizer Robert (Bob) Emmet LighthizerPelosi sounds hopeful on new NAFTA deal despite tensions with White House On The Money: Economy adds 164K jobs in July | Trump signs two-year budget deal, but border showdown looms | US, EU strike deal on beef exports Chinese, US negotiators fine-tuning details of trade agreement: report MORE’s negotiations, not due to the meeting.\n\nThe Hill has reached out to the White House for comment.", "description": "President Trump’s top economic adviser arranged a meeting in the Oval Office last week with outside experts who told the president that a continued escalation of the trade war between the U.S.", "authors": [], "top_image": "https://thehill.com/sites/default/files/kudlowlarry_080219upi2_lead.jpg", "published_at": "2019-10-18"}