{"pub": "nymag", "url": "https://thecut.com/2019/09/i-think-about-the-we-are-the-world-parody-for-lebron-a-lot.html", "downloaded_at": "2019-09-16 23:20:16.947256+00:00", "title": "I Think About the “We Are the World” Parody for LeBron a Lot", "language": "en", "text": "Photo: bballvideos/Youtube\n\nI Think About This a Lot is a series dedicated to private memes: images, videos, and other random trivia we are doomed to play forever on loop in our minds.﻿\n\nIf you’re not from Cleveland or obsessed with basketball, you’re probably not burdened with remembering The Decision: the time in 2010 when LeBron James’s contract with the Cleveland Cavaliers was up and it was assumed that, like a small-town film protagonist with dreams of Something Bigger, he’d elect to leave the Midwest for New York City. As a native Clevelander who lived through the madness in real time, I am cursed with the memory of the questionable decisions my city made in a fit of panic. One decision in particular haunts me above the rest: when local celebrities and politicians decided to shamelessly beg LeBron to stay using, I’m sorry to say, a “We Are the World” parody entitled “We Are LeBron.”\n\nIt … did not work.\n\nSee, Cleveland was not exactly known for having the best luck with sports. But what Cleveland did have was LeBron James. This is a man so good at basketball that he singlehandedly gave the city a chance of winning its first major-league championship since 1964. And Cleveland loved LeBron for that. A multistory banner of him hung downtown — arms outstretched like Sports Jesus watching over his city, as if to say, “Hush, my children. I will bring you your championship. Oh, yes.” And we believed him. Much like Gollum, he craved the ring, and he was determined to bring the team to victory. But absent a contract to keep him on the Cavs, everyone knew LeBron’s odds of actually getting that ring would be far greater if he deserted Cleveland for a team with, like, at least one other decent player. Faced with the reality that Cleveland might lose its star, and taking the phrase “desperate times call for desperate measures” a bit too literally, “We Are LeBron” was born.\n\nIt’s been almost ten years since the fateful day “We Are LeBron” debuted, and I’m still no closer to understanding how it happened. I have so many questions, namely: Why “We Are the World”? Maybe, if we had used an iconic charity single originally recorded by a supergroup of artists pleading for world peace to stay on our basketball team in an ironic way, it would have been hilarious. Maybe. Unfortunately, “We Are LeBron” was deeply, devastatingly, cringe-inducingly sincere.\n\nIn the video, local news anchors stood with local politicians and local commercial stars to make their plea to LeBron: You can’t leave. We need you. Nobody will love you more than we do. It’s a level of desperation that would be lazy and offensively over-the-top coming from an ex-girlfriend in a rom-com; from a group of real people with autonomy, it’s just upsetting. Ted Strickland, then-governor of Ohio, stands next to local weatherman Dick Goddard to belt out an off-tempo “Please stay LeBron, we really need you.” Less than six months later, Ted Strickland lost his reelection bid to John Kasich and Ohio gubernatorial elections have been dominated by Republicans ever since. Tim Misny, a Cleveland celebrity famous for his local lawyer commercials featuring the catchphrase “I’ll make them pay,” gets a lower-third graphic during his close-up that reads: “Intimidating TV Lawyer.” It feels like a half-hearted attempt at a joke from the poor sucker tasked with editing the video together, but it’s too late — at this point, all I can do is concentrate on the fact that they thought the TV commercial lawyer singing to LeBron might change his mind.\n\nI routinely pore over the video. I examine the faces for traces of regret. I try to imagine what they’re thinking. Are they wondering, as they should be, “How did I get here?” At the two minutes and three seconds mark, there’s footage of Senator Sherrod Brown, who at least had enough good sense to not physically be present, singing from his Senate office. I’d swear it was hostage footage. You can’t say the man never sacrificed anything for his constituents; there was certainly no foreseeable PR benefit to participating. If anything, it was politically harmful, and the look on the senator’s face said he knew as much. (To be fair, Sherrod Brown has been reelected twice since appearing in the video, and I’m convinced the one thing that saved him was having the good sense to only participate remotely.)\n\nIn the end, LeBron did leave Cleveland. But four years later, he returned. In true third-act fashion, he’d realized a win didn’t mean as much if it didn’t happen in his hometown. In 2016, he broke Cleveland’s curse and won the city its championship. In 2018, I moved to L.A., and six months later, LeBron followed. (Obsessed much?) Luckily, his second move was accepted far more gracefully, and no song or dance was involved. Nonetheless, “We Are LeBron” remains at the forefront of my mind to this day.", "description": "Cleveland, sing-begging is not a good look.", "authors": ["Brittany Van Horne"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/12/12-ITATAL-Lebron.w1200.h630.jpg", "published_at": "2019-09-16"}