{"pub": "breitbart", "url": "https://breitbart.com/news/china-demands-us-lift-tech-curbs-will-safeguard-interests", "downloaded_at": "2019-10-09 07:07:49.005466+00:00", "title": "China demands US lift tech curbs, will ‘safeguard’ interests", "language": "en", "text": "BEIJING (AP) — China demanded Washington lift sanctions on Chinese tech companies and warned Wednesday it will “resolutely safeguard” the country’s interests.\n\nThe Ministry of Commerce criticized curbs imposed on sales of U.S. technology to a group of Chinese companies as interference in the country’s affairs. American officials say those companies provide technology used to repress Muslim minorities in the northwestern region of Xinjiang.\n\n“We strongly urge the United States to immediately stop making irresponsible remarks on the issue of Xinjiang, stop interfering with China’s internal affairs and remove relevant Chinese entities from the Entity List as soon as possible,” said a ministry statement. “China will take all necessary measures to resolutely safeguard Chinese interests.”\n\nThe ministry gave no details of possible retaliation.\n\nDespite the spike in tension, the ministry said Tuesday a trade delegation was going ahead with a trip to Washington this week for talks aimed at ending a tariff war.\n\nThe sanctions announced Monday restrict sales of U.S. technology to a group of Chinese companies working on facial recognition, artificial intelligence and other advanced products. Those technologies are part of the ruling Communist Party’s industry development plans.\n\nThe U.S. government and independent researchers say as many as 1 million Muslims in Xinjiang have been sent to detention camps. The government says those facilities are job training centers and its activities are aimed at thwarting terrorism and radicalism.\n\nBeijing has tried for decades to suppress sentiment in Xinjiang in favor of independence or more autonomy for the territory. Chinese authorities say scattered incidents of violence blamed on radicals are part of an international Islamic terrorist movement, but independent researchers say they see no evidence to support that.", "description": "BEIJING (AP) — China demanded Washington lift sanctions on Chinese tech companies and warned Wednesday it will \"resolutely safeguard\" the country's", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/08/377cc9_china-us-trade-24222-in-oct-2019-photo-chinese-vice-premier-liu-he-stands-640x335.jpg", "published_at": "2019-10-08"}