{"pub": "npr", "url": "https://npr.org/2019/10/13/769445746/orpheus-girl-painful-and-beautiful-puts-a-modern-twist-on-myth", "downloaded_at": "2019-10-13 11:33:56.211630+00:00", "title": "'Orpheus Girl,' Painful and Beautiful, Puts A Modern Twist On Myth", "language": "en", "text": "'Orpheus Girl,' Painful and Beautiful, Puts A Modern Twist On Myth\n\nOrpheus Girl by Brynne Rebele-Henry Hardcover, 164 pages | purchase close overlay Buy Featured Book Your purchase helps support NPR programming. How?\n\nThe myth of Orpheus and Eurydice is a sad one, told by scholars and poets throughout the ages and painted by many a lovelorn Pre-Raphaelite. For those unfamiliar with the story, here it is in a nutshell: Orpheus falls in love and marries Eurydice, who is promptly bitten by a snake and dies. Orpheus travels all the way to the underworld to plead his case to Hades, who tells Orpheus that he will release Eurydice on one condition. Orpheus must walk straight out of the underworld, with his wife behind him, but he must under no circumstance turn around. Of course, Orpheus's doubts get the better of him as he's about to emerge, and he turns around just enough to see Eurydice's spirit pulled back into the underworld forever.\n\nI loved Orpheus and Eurydice as a teen, and their tale full of true love and tragedy. (I also memorized the full cast recording of Phantom of the Opera and wanted Edgar Allan Poe to be my high school boyfriend, so do with that what you will.) Surely a lover with an ounce more of common sense would have persevered long enough to beat Hades's simple trial. When I came across Orpheus Girl, a short novel that not only referenced the classic myth but was also written by established teen poet Brynne Rebele-Henry, I pounced.\n\nIn hindsight, knowing what I know, I probably should have proceeded with a little more caution.\n\nBe warned: Just like the myth, Rebele-Henry's tale of Raya and Sarah is unbelievably difficult. They do actually go through hell before there is even a hint of light at the end of the tunnel, and they drag you right along with them.\n\nRaya turns 16 at the beginning of our story. She lives with her grandmother (Grammy) in an incredibly conservative, overwhelmingly Christian small town in Texas. Grammy's husband abandoned her with a toddler; her daughter did the same thing when Raya was only two. Grammy sees Raya as her \"second chance.\" She sends her to Sunday school and Bible camps, encourages her to wear dresses and bows and makeup, buys her pom-poms and escorts her to cheerleading tryouts every year.\n\nRaya, however, wants none of those things. She is also gay, an abomination in this community where queer children \"disappear\" with disturbing regularity. We get to know Raya through her captivating narrative — an almost stream-of consciousness collage of paragraphs, wherein the order of events is often interrupted by random memories, thoughts about her grandmother, and deep feelings for her best friend Sarah.\n\nReaders will be easily swept up in Raya's voice, that of a teenager with an old soul, a weary spirit trapped in a body that was not meant for the life it was born into and painfully aware of that fact on a daily basis. But every experience with Sarah is new and beautiful, and Raya charts her way into undiscovered country the best she can.\n\nRaya and Sarah's story is a credit to Rebele-Henry's own teen voice, mature beyond her years.\n\nFor the reader, this tale quickly becomes a dangerous game of waiting for the young lovers to be discovered, because you know they will be — at which point their respective families ship them off to Friendly Saviors, a camp meant to \"re-educate\" teens into heterosexuality.\n\nMoreso than Hades's mythic underworld of old, this camp is Actual Hell (and all the trigger warnings that go with that). The teens are tortured mentally and physically, ultimately escalating into electro-shock treatments and drugs. The story becomes unpleasant, uncomfortable, and almost unbearable — but no less poetic or compelling. Rebele-Henry pushes her reader to the brink—you will wish for anyone or anything to come save these poor, wrecked children.\n\nRaya and Sarah's story is a credit to Rebele-Henry's own teen voice, mature beyond her years. The emotionally dramatic narrative, though loose and seemingly disjointed at times, rings incredibly true. It is a tale, much like the myth referenced in the title, similarly painful and beautiful.\n\nAlethea Kontis is a voice actress and award-winning author of over 20 books for children and teens.", "description": "Author and poet Brynne Rebele-Henry transplants the tale of Orpheus and Eurydice to modern-day Texas, for a wrenching tale of two young women whose love lands them in a religious re-education camp.", "authors": ["Alethea Kontis"], "top_image": "https://media.npr.org/assets/img/2019/10/11/81lio2mvgil_wide-6d56a685dfd1c7d3c51257379c91bd73ac51adeb.jpg?s=1400", "published_at": "2019-10-13"}