{"pub": "breitbart", "url": "https://breitbart.com/environment/2019/10/27/climate-alarmists-propose-feeding-cows-seaweed-reduce-methane-farts", "downloaded_at": "2019-10-28 00:34:04.529365+00:00", "title": "Ecologists: Feeding Cows Seaweed Cuts Methane in Farts", "language": "en", "text": "Environmentalists intent on finding new ways to reduce so-called greenhouse gas emissions to curb climate change have proposed a novel method: feed cows seaweed to diminish methane in flatulence, belches, and manure.\n\nErmias Kebreab, an zoology professor at the University of California–Davis, led a team in producing a bovine meal regimen containing varying levels of Asparagopsis armata, a strain of red seaweed, and fed it to 12 dairy cows over a two-month period. In a mix containing just 1 percent seaweed, the cows’ methane emissions went down by a stunning 60 percent.\n\n“In all the years that I’ve worked in this area, I’ve never seen anything that reduced it that much,” Kebreab said.\n\nA 2012 United Nations report revealed that the earth’s cattle population produces more carbon dioxide than automobiles, planes, and all other forms of transport combined. Moreover, the cow pies they drop and the wind they break produce a third of the world’s methane emissions, which traps 84 times as much heat as carbon dioxide.\n\nIn the summer of 2016, EcoWatch published an article confirming that greenhouse gas emissions from livestock actually account for a higher percentage of total global emissions than the world’s 1.2 billion automobiles.\n\nKebreab’s cow experiment sought to replicate results from researchers at Australia’s James Cook University, who mixed bacteria from cows’ digestive systems with red seaweed and discovered a significant decrease in methane production. Their experiment suggested that tweaking a cow’s diet to include 2 percent seaweed could reduce its methane emissions by as much as 99 percent.\n\nLast March, Kebreab and his team initiated a more expansive version of his cow study, using 21 steers over a period of six months. Preliminary results reportedly mirror those of the earlier experiment, but the final analysis will not be ready until December.\n\nPaul Dobbins, a senior specialist at the World Wildlife Fund and former president of a kelp farm in Maine, said that seaweed could provide a key remedy for bovine gas emissions.\n\n“You don’t have to rebuild 10,000 power plants in the world. You basically create a modest feed additive that has a big leverage effect,” he said.\n\nAccording to Dobbins, seaweed farming may be a “triple win.” It furnishes a way to grow nutritious food for both cows and people, provides coastal jobs, and improves the marine environment.\n\n“Everything you do in food production has pluses and minuses relative to the environment,” he has claimed. “Seaweed farming, if done correctly, actually comes out more on the plus side.”\n\nWhile flatulence is an issue, studies have suggested that cow belching is a much bigger problem because of the methane produced in cows’ stomachs.\n\n“Despite misconceptions, most cow methane comes from burps (90%) rather than farts (10%),” Michael Battaglia wrote in October, 2016, in the Conversation.\n\nFollow @tdwilliamsrome", "description": "Environmentalists have proposed adding seaweed to cows' diets to diminish methane emitted in flatulence, belches, and manure. | Environment", "authors": ["Thomas D. Williams"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-538453676-640x335.png", "published_at": "2019-10-27"}