{"pub": "metro", "url": "https://metro.co.uk/2019/10/20/when-is-bruno-tonioli-back-on-strictly-come-dancing-2-10951155", "downloaded_at": "2019-10-20 23:26:26.240480+00:00", "title": "When is Bruno Tonioli back on Strictly Come Dancing?", "language": "en", "text": "Bruno Tonioli has been missing from his usual spot on Strictly this week\n\nIf you’ve tuned in to Strictly Come Dancing this weekend you might just have noticed that Bruno Tonioli is missing from his usual spot on the end of the judges’ table.\n\nYup, Saturday night’s show saw former Dancing With The Stars champion Alfonso Ribeiro take the flamboyant Strictly stalwart’s place – and sharing a spot of dancefloor space with Mike Bushell as he did.\n\nSo what’s happened to Bruno – and just when is he coming back?\n\nHere’s what you need to know…\n\nWhy is Bruno Tonioli not on Strictly Come Dancing this week?\n\nBruno has missed out on this week’s Strictly due to work commitments in America.\n\nThe 63-year-old is also a judge on Dancing With The Stars, the US version of Strictly – and usually flies to the US for the week, returning in time for Saturday night’s live show.\n\nBruno is a judge on Dancing With The Stars in the US – which reunites him with Len Goodman (PIcture: ABC)\n\nHowever in recent years he has missed a week of Strictly each series due to his DWTS commitments – initially missing a week for the first time back in 2017.\n\nAdvertisement\n\nAdvertisement\n\nOn that occasion he was not replaced, with the judging panel reduced to three people that week – however Ribeiro stepped in for him last year and has returned again this year.\n\nWhen will Bruno be back on Strictly?\n\nAlfonso Ribeiro showed Mike Bushell a few moves as he stepped in for Bruno (Picture: BBC)\n\nThe good news is that he won’t be gone for long, as the judge himself confirmed he will be returning for next Saturday night’s show.\n\nTaking to Instagram he shared a snap of himself posing in front of the Dancing With The Stars logo, saying: ‘I’m going to miss you guys! Stay safe and see you in a week.’\n\nBruno added: ‘I’m crap at staying off my phone and so I’m not even going to try.’\n\nSaturday night’s show saw Saffron Barker nab her first perfect 10s of the series as she and AJ Pritchard soared to the top of the leaderboard with their Sinatra-soundtracked foxtrot.\n\nThe results show airs on BBC One on Sunday night at 7.15pm, when one more couple will be leaving the competition for good.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Chris Ramsey thinks ‘being sexy’ will prove to be downfall on Strictly Come Dancing\n\nMORE: Cheryl spotted in Strictly Come Dancing audience as week five kicks off", "description": "Bruno Tonioli was absent from Strictly Come Dancing this weekend - so when is he back?", "authors": ["Caroline Westbrook"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_81716074-e1571582655742_1571583496.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-20"}