{"pub": "guardian", "url": "https://theguardian.com/politics/2019/sep/17/boris-johnson-likely-lose-supreme-court-case-labour-shami-chakrabarti", "downloaded_at": "2019-09-17 10:39:35.053914+00:00", "title": "Boris Johnson likely to lose supreme court case, says Labour", "language": "en", "text": "The supreme court hearing into whether Boris Johnson unlawfully shut down parliament is likely to rule against the prime minister, the shadow attorney general, Shami Chakrabarti, has said.\n\nEleven judges are due to begin a hearing on Tuesday at the court in central London that Johnson’s decision to prorogue parliament for five weeks in the run-up to Brexit was not constitutional and stifled debate.\n\n“I think the supreme court is highly likely, or certainly, let’s put it this way, equally likely to follow in the direction of the highest court in Scotland,” the Labour peer told the Radio 4 Today programme before the hearing.\n\nA case heard in Scotland on 11 September brought by 75 opposition MPs and peers found that the prime minister had acted unlawfully. Another case heard in the high court of England and Wales deemed the issue “political” and non-justiciable. Appeals to both decisions will be heard by the supreme court with a decision due on Thursday.\n\nBefore the hearing scores of protesters opposing the suspension of parliament gathered outside the supreme court.\n\nQ&A What is the UK supreme court and how does it work? Show Hide The supreme court of the United Kingdom was formally established on 1 October 2009. It is the ultimate court for hearing cases of the greatest public or constitutional importance, and is the final court of appeal in the UK, except for criminal cases heard in Scotland. The supreme court took over the judicial functions of the House of Lords, separating the judiciary from the legislature. It brought an end to the system of appealing to the \"lords of appeal in ordinary\" - commonly known as the law lords. The court comprises the president and deputy president and 10 other judges of the supreme court. Judges are appointed by the Queen on the advice of the prime minister, to whom a name is recommended by a special selection commission. The prime minister is obliged to recommend this name. The judgments in all decided cases from the court are published on the court's website.\n\nAmong the demonstrators was a man carrying a sign describing himself as “The Incredible Sulk” in reference to Johnson comparing himself to the Marvel comic character Hulk.\n\nOthers carried signs declaring: “Defend Democracy,” “Don’t Silence Our MP,” “Reopen Parliament” and “They Misled The Queen.”\n\nLady Chakrabarti said: “There are two issues here. The first is the technical issue of justiciable – is the court entitled to be referee when there’s a dispute of this kind between parliament and government?\n\n“Once you’ve dealt with that hurdle you go on to decide whether on the facts of this case, Boris Johnson and his chums were abusive. Whether they abused their prerogative power, to suspend parliament, to shut it down in this way.”\n\nThe justice secretary, Robert Buckland, told the BBC he backed prorogation and the government would argue in court that it was a “proper course” to take.\n\nIn an attempt to distance himself from a Downing Street source who cast doubt on the Scottish judiciary’s independence, he lavished praise on the country’s judges.\n\nBuckland said: “They are world-class. They are world-leading. Let them do their job. And I want to make sure whatever the decision is of the supreme court, we will respect the robust independence of our judiciary.”\n\nAsked if he would respect the result, after Johnson and the foreign secretary, Dominic Raab, both said they would want to review any decision that went against them, Buckland said: “The principle of respecting the independence of our judiciary is one that runs right through our system and we must do that in this instance.”\n\nThe former supreme court justice Jonathan Sumption told BBC Newsnight he thought the government ought to win but suggested judges might be outraged at Johnson’s approach.\n\nHe said: “My own view is that the orthodox opinion is the one held by the English courts. But one has to accept that if you behave outrageously and defy the political culture upon which our constitution depends, a lot of judges are going to be tempted to push the limits.\n\n“And the trouble is Boris Johnson has taken a hammer and sickle to our political culture in a way that is profoundly provocative to people who believe that there ought to be solutions consistent with our traditions.”\n\nIn contrast to recent comments by Jeremy Corbyn’s closest shadow cabinet allies saying they would back remain in a second referendum, Chakrabarti said she needed to remain neutral so she could give the best advice on Brexit deals.\n\nShe also rubbished the shift by the Liberal Democrat leader, Jo Swinson, to back stopping Brexit entirely by revoking article 50, describing it as illiberal and adding that she was dumbfounded a pressure group idea had become party policy.\n\nShe said the Lib Dems were turning their backs on “half the population”.", "description": "Shami Chakrabarti predicts this week’s hearing will rule prorogation was unlawful", "authors": ["Kate Proctor", "Owen Bowcott"], "top_image": "https://i.guim.co.uk/img/media/7ee02a898c1c87e5f34f7bfa20d8c7add8e6ea3c/765_152_2554_1532/master/2554.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0b8db38f6497678de2428587bf09b535", "published_at": "2019-09-17"}