{"pub": "politico", "title": "Berlin hit job could blight German-Russian relations", "url": "https://politico.eu/article/berlin-hit-job-could-blight-german-russian-relations-chechen-rebel-fighter", "language": "", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:12:29.249035+00:00", "text": "BERLIN — It was a textbook hit job. Up until the suspected assassin was arrested carrying a Russian passport, that is.\n\nBerlin is quietly seething over the assassination of a Chechen rebel fighter who was gunned down in broad daylight last week, allegedly by a man authorities believe to be a Russian agent.\n\nThe case, which carries echoes of the poisoning of Russian double agent Sergei Skripal in Salisbury in 2018 and a string of successful assassinations in recent years of enemies of the Kremlin, would mark the first time such a murder has been carried out on German soil in the post-Cold War era.\n\nFor Berlin, which has taken pains to maintain open dialogue with Moscow amid persistent tensions, any Russian involvement in the plot would be viewed as a huge provocation. Moscow, for its part, has denied any involvement in the murder.\n\nIf German authorities determine Russia did order the killing, Chancellor Angela Merkel’s government would have no choice but to publicly protest, sending relations between the two countries into a tailspin just as Germany was hoping to jumpstart its initiative with France to broker an end to the war in Ukraine.\n\n\"There is a lot that remains unclear, the question is whether we can find the answers\" — Martin Steltne, Berlin prosecutor\n\nThough Germany’s continued support for sanctions against Russia have left ties between the two countries tense, Berlin has remained a key partner for the Kremlin.\n\nDespite intense pressure from the U.S. and other allies to abandon its support for the Baltic gas pipeline known as Nord Stream 2, for example, Germany has maintained its firm commitment to the project. Just two days before the killing in Berlin, Foreign Minister Heiko Maas met with his Russian counterpart, Sergey Lavrov, in Moscow to discuss the war in Ukraine, among other issues.\n\nMurder mystery\n\nGerman security services have been scrambling for days to figure out who ordered the Berlin killing and why.\n\n\"There is a lot that remains unclear, the question is whether we can find the answers,\" Berlin prosecutor Martin Steltner said on Monday.\n\nBerlin initially hoped the murder, which occurred in broad daylight, was connected to the city’s drug underworld. The killing seemed too brazen, too reckless to be the work of Russia’s security services.\n\nWhat’s more, Berlin is a hub for Chechen organized crime families and gangland killings are not uncommon.\n\nMuch to the government’s annoyance, however, the evidence so far points in another direction – Moscow.\n\nThe killing occurred just past noon on August 23 in a public park near the city center. A cyclist approached Zelimkhan Khangoshvili, who was walking to a nearby mosque, and shot him in the back of the head with a silencer-equipped Glock 26 pistol, killing him instantly.\n\nThe alleged assassin then sped a few blocks away to the Spree River, where he changed clothes and ditched the bike, pistol and a wig he’d been wearing into the water before heading toward an electric scooter he had parked nearby for his getaway.\n\nA couple of teenagers watched the suspected killer as he disposed of the evidence. They alerted the police who happened to be nearby and officers apprehended a man identified as Vadim Sokolov within minutes.\n\nFalse identity\n\nAccording to the authorities, Sokolov, 49, traveled to Berlin via Paris about a week before the killing. France had granted him a tourist visa a few weeks earlier, enabling him to travel freely within the Schengen area.\n\nOn Friday, Bellingcat, the online investigative platform that revealed the identities of the Russian operatives involved in the Salisbury poisoning, reported that Sokolov’s identity, though not his passport, appears to be fake. His St. Petersburg address, for example, doesn't exist.\n\n\"Despite the fact that he used a legitimate passport, we have determined that no such person exists in Russia’s sprawling, comprehensive national citizen database,\" the site reported, citing Russian databases it has access to.\n\nA high-profile separatist fighter, he was likely on the hit list of Chechen President Ramzan Kadyrov, a close ally of Vladimir Putin who rules Chechnya with an iron fist.\n\n\"In addition, no trace of such a person exists in a trove of hundreds of leaked residential databases, previously obtained and aggregated by Bellingcat,\" the report continued. \"This discovery makes Russia’s claims that the killer is not connected to the Russian state implausible, as no person in Russia is in a position to obtain a valid Russian passport under a fake identity without the involvement of the state bureaucratic and security apparatus.”\n\nKhangoshvili, the victim, was a Georgian citizen of Chechen descent who had fought with separatists in Chechnya trying to drive out Russia, which still controls the Muslim region in the northern Caucusus.\n\nThe difficulty German authorities face in solving his murder is that the list of people who might have wanted Khangoshvili dead is quite long.\n\nA high-profile separatist fighter, he was likely on the hit list of Chechen President Ramzan Kadyrov, a close ally of Vladimir Putin who rules Chechnya with an iron fist.\n\nKhangoshvili was a close associate of another Kremlin foe, former Georgian President Mikheil Saakashvili.\n\nSaakashvili offered his condolences to Khangoshvili’s family via Facebook this week, calling his friend “a brave man and a patriot of Georgia and Chechnya.” He blamed Russia for the murder.\n\nKhangoshvili, who was 41, survived several previous assassination attempts, according to his family, including one in Georgia in 2015, during which he sustained several gunshot wounds.\n\nHe later fled with his family to Germany, where he lived under an assumed name while he pursued his asylum claim. Authorities rejected his initial asylum application.\n\nAt the time of his murder, he was awaiting the results of an appeal.", "description": "A Chechen rebel was gunned down in the German capital, allegedly by a man authorities believe to be a Russian agent.", "authors": ["Matthew Karnitschnig", "Hans Von Der Burchard", "Zia Weise"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/08/GettyImages-1163806250-1200x628.jpg"}