{"pub": "guardian", "url": "https://theguardian.com/uk-news/2019/oct/18/extinction-rebellion-block-oxford-circus-london-pyramid", "downloaded_at": "2019-10-18 10:36:59.714917+00:00", "title": "Extinction Rebellion blocks Oxford Circus in London with pyramid", "language": "en", "text": "Activists lock themselves to structure made of wooden poles at centre of busy junction\n\nActivists with Extinction Rebellion have blockaded Oxford Circus in central London with a pyramid structure made of wooden poles, as they began a wave of actions and demonstrations on the final day of their “October Rebellion”.\n\nAt 9.30am, a whistle was blown to instruct activists to block the roads leading into the junction, one of London’s busiest, which was the scene of days of lively protests by the group in April.\n\nIn minutes, activists had erected the structure in the middle of the road, with three climbing on top and more locking themselves on around its base.\n\nThe latest action comes after 12 days of protests by XR, beginning a week last Monday, which have so far led to more than 1,700 arrests.\n\nGreg Frey, 23, from London, who was locked to the base of the structure with a bicycle lock around his neck, said: “We would love to go home. I would love to have not spent the last 13 days on the streets, but we have no choice. We’re trapped.”\n\nFive Extinction Rebellion protesters were due to appear in court on Friday in connection with disruption to the transport network during the Thursday morning rush-hour.\n\nBritish Transport Police (BTP) said Mark Ovland, 36, from Keinton Mandeville in Somerset, was charged with breaching his bail conditions when he allegedly disrupted a Jubilee line train at Canning Town station in east London at about 6.45am.\n\nOvland is due to appear before magistrates at Highbury Corner later. He was arrested alongside another man, a 35-year-old from Filton in South Gloucestershire, who was arrested on suspicion of obstructing the railway. The unnamed man has been released on bail.\n\nFour other people will appear at the same court charged in connection with an incident at Shadwell station, east London, on the Docklands Light Railway.\n\nThe BTP said they were Margreit Bos, 32, of Chartham in Kent; Martin Newell, 52, of Sparkhill in Birmingham; Philip Kingston, 83, of Patchway in Bristol; and Sue Parfitt, 77, of Henbury in Bristol.\n\nTwo other men, aged 32 and from Lewisham and Kingston upon Hull, were arrested at Stratford station on suspicion of obstructing the railway, BTP said. They have been released on bail.", "description": "Activists lock themselves to wooden pyramid structure at centre of busy junction", "authors": ["Damien Gayle", "Richard Vize"], "top_image": "https://i.guim.co.uk/img/media/33b2612016a9b9ac24b58e95ca290464896bdb65/0_0_6096_3658/master/6096.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9c8f7a6f144bef581877195b39511246", "published_at": "2019-10-18"}