{"pub": "yahoo", "url": "https://news.yahoo.com/tess-holliday-shares-powerful-message-of-selflove-to-radically-love-yourself-is-hard-work-but-my-god-its-worth-it-005340343.html", "downloaded_at": "2019-09-25 04:45:56.235496+00:00", "title": "Tess Holliday shares powerful message of self-love: 'To radically love yourself is hard work, but my god it’s worth it'", "language": "en", "text": "Tess Holliday, the plus-size model and outspoken proponent of body positivity, has built a successful career all while advocating self-love. However, in a recent Instagram post, Holliday admits that choosing to love your body is not an easy feat.\n\nOn Tuesday, Holiday posted a photo of her body on Instagram and shared that, while it is incredibly challenging to practice self-love, doing so is worth it.\n\n\"It’s not easy to choose love towards a body that so many find 'disgusting,' [and] sometimes I wonder if that’s why so many of us spend so much time hating ourselves,\" the model wrote. \"To radically love yourself is hard work, but my god it’s worth it.\"\n\nHolliday goes on to write that her body has served her well, providing her with her two children, helping her survive abuse \"from others and from myself,\" and allowing her connect with others.\n\n“To be able to share my stories and to keep going despite so many obstacles in my way, to be able to see beauty where others see none, that’s my gift,\" Holliday wrote. \"I chose myself, and I hope whoever is reading this can do the same.\"\n\nThe heartfelt and empowering message encouraged many of her fans, who have struggled with body image issues, to thank her for the reminder of how important self-love and acceptance is. Others applauded her for representing people who are so rarely seen in media.\n\n\"Seeing bodies like yours on social media has changed my life,\" one person commented. \"I no longer cry after seeing photos of my body. I actually like my body after so many years of vehemently hating it, and you have helped me get there with your openness about your own body. Thank you. So much.\"\n\nAnother shared: \"It's definitely not easy to see the beauty in many things in life and to find it within yourself is definitely the hardest. Thank you for your encouragement.”\n\nOne commenter wrote: \"As soon as I found your account you've had me questioning why I continue to fight a war with myself since I was so young, walls have not yet broken down but are chipped and cracking and I can see self love shining through and it because of wonderful people like you.\"\n\nAnother fan wrote: \"You’re right, it’s so hard but so worth it. I’m amazed at how far I’ve come and it’s role models like you who helped get me to that place of self love! Truly I thank you for unapologetically being YOU.\"\n\nRead more from Yahoo Lifestyle:\n\nFollow us on Instagram, Facebook and Twitter for nonstop inspiration delivered fresh to your feed, every day.", "description": "Model and body-positive advocate Tess Holliday shared a photo of her body on Instagram and described the importance of self-love, even though it isn't easy.", "authors": ["Hope Schreiber"], "top_image": "https://s.yimg.com/uu/api/res/1.2/kvFJ1q_gdscEyx0fJA8wrw--~B/aD0xOTgyO3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/27afcf70-df28-11e9-bcde-39202150fce5", "published_at": "2019-09-25"}