{"pub": "bbc", "url": "https://bbc.com/news/world-europe-49657908", "downloaded_at": "2019-09-11 07:25:40.780089+00:00", "title": "Jamal Khashoggi 'murder recording transcript' is published", "language": "en", "text": "Image copyright Reuters Image caption The newspaper says Jamal Khashoggi (pictured on sign) told his killers not to cover his mouth\n\nA Turkish newspaper has published new details of a recording which reportedly captured the final moments of murdered Saudi journalist Jamal Khashoggi.\n\nThe prominent government critic was killed in Saudi Arabia's consulate in Istanbul last October.\n\nThe pro-government Sabah newspaper says the transcript is from a recording taken inside and later obtained by Turkish intelligence.\n\nIt includes information such as the journalist's alleged last words.\n\nKhashoggi wrote a column for the Washington Post newspaper and was based in the US before his disappearance.\n\nHe was last seen entering the Saudi consulate in Istanbul on 2 October 2018 to obtain papers he needed to marry his Turkish fiancée.\n\nHis mysterious death piled scrutiny on Saudi Arabia, which released conflicting information regarding his disappearance in the aftermath.\n\nSaudi authorities have since blamed a \"rogue\" operation for his murder and put 11 men on trial.\n\nWhat does the newspaper say?\n\nThe Sabah has consistently made international headlines by carrying details - including some that have been disputed - about the journalist's mysterious death.\n\nThe newspaper published two new reports this week into Khashoggi's death at the hands of a group they label a \"hit squad\".\n\nMedia playback is unsupported on your device Media caption Jamal Khashoggi: What we know about the journalist's disappearance and death\n\nTheir latest report details information from the alleged recording.\n\nIt includes details such as a forensic expert, part of a team sent from Saudi Arabia, allegedly referring to the journalist as an \"animal to be sacrificed\" prior to his arrival.\n\nThe Sabah report says Khashoggi, once inside in the consulate, became suspicious and was told he had to return to Riyadh because of an Interpol order.\n\nThe journalist allegedly refused to comply with the group's requests, which included texting his son, and was then drugged, according to the newspaper.\n\nHe reportedly then told his killers, in his last words, to not keep his mouth closed because of his asthma, but then lost consciousness.\n\nKhashoggi was suffocated with a bag put over his head, the Sabah reports, with the sounds of a scuffle allegedly picked up by the recording.\n\nThey newspaper also alleges the tape captured his alleged dismemberment at the hands of the forensic expert.\n\nPlease upgrade your browser to view this content. Timeline: Jamal Khashoggi's death hide How the story unfolded What happened next? Show all Was this timeline useful? Yes No Thank you for your feedback. Share this chatbot.\n\nReports of the existence of audio recordings from Khashoggi's death have been around since last year.\n\nTurkish officials have publicly confirmed their existence and say they have shared them with international governments but is unclear how the newspaper apparently obtained them.\n\nAlmost a year on from his death, Khashoggi's body has not been recovered despite international pressure.\n\nEarlier this year, a UN expert on extrajudicial killings called for an independent and impartial investigation into his death.\n\nSpecial rapporteur Agnes Callamard described the journalist's death as a \"deliberate, premeditated execution\" and alleges \"the state of Saudi Arabia is responsible\" and should be investigated.\n\nThe Saudi government rejected her report and have consistently denied those responsible for the death were acting on official orders.", "description": "Turkey's Sabah newspaper publishes what it says is a transcript of the Saudi journalist's death.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/10008/production/_108744556_32dcf622-a958-4b65-941d-e4ff49c393ea.jpg", "published_at": "2019-09-11"}