{"pub": "yahoo", "url": "https://sports.yahoo.com/andy-ruiz-vs-anthony-joshua-144100493.html", "downloaded_at": "2019-10-28 00:40:55.082195+00:00", "title": "Andy Ruiz vs Anthony Joshua 2: Eddie Hearn claims world champion is ‘tubby’ and pretending to have lost weight ahead of rematch", "language": "en", "text": "Hearn has labelled Ruiz as tubby\n\nEddie Hearn has labelled Andy Ruiz Jr ‘tubby’ despite the world heavyweight champion appearing to have slimmed down while also displaying his fast hands ahead of the Anthony Joshua rematch.\n\nThe Mexican-American shocked the Brit earlier this year to snatch the belts, but has since appeared to have piled on the weight before resuming training recently for the December 7 date in Diriyah, Saudi Arabia.\n\nScroll to continue with content Ad\n\nRuiz has also posted footage of himself hitting the pads, displaying explosive hands now just six weeks out.\n\n“I thought he looked quite tubby,” Hearn told IFL TV.\n\n“I actually thought he looked heavier than he did previously.\n\nAndy Ruiz Jr appears to have slimmed down (Instagram/andy_destroyer13)\n\n“Make your own mind up. That clip that I saw, which was him training in San Diego, I didn’t think that he looked slimmer than he did last camp.\n\n“There was one picture of him leaning forward.\n\n“The old ‘lean forward’, tucked back, with a little pout, can make you lose half a stone. Maybe he’s done that.”\n\nRuiz has previously revealed his intent to come in lighter for the rematch, having tipped the scales at 268 pounds for the first fight.\n\nHe said: “I think being 10lbs lighter, I’m going to be a better fighter.”", "description": "Eddie Hearn has labelled Andy Ruiz Jr ‘tubby’ despite the world heavyweight champion appearing to have slimmed down while also displaying his fast hands ahead of the Anthony Joshua rematch.The Mexican-American shocked the Brit earlier this year to snatch the belts, but has since appeared to have piled", "authors": ["Jack Rathborn"], "top_image": "https://s.yimg.com/ny/api/res/1.2/qoFzKLjuMpgaLwruo5rs6Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTI7aD03ODg-/https://s.yimg.com/uu/api/res/1.2/kzq4ntP6zWvTxDvM.VPmMQ--~B/aD0zOTQ7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/e1cecfb3ed969c37a86cfe33fcaad5ea", "published_at": "2019-10-27"}