{"pub": "realclearpolitics", "title": "Newt Gingrich: NY Times launches propaganda campaign on race", "url": "https://foxnews.com/opinion/newt-gingrich-nyts-1619-project-examining-american-slavery-is-marred-by-its-own-implicit-racism", "language": "en", "published_at": "2019-08-24", "downloaded_at": "2019-09-03 00:57:40.629048+00:00", "text": "One of the great debates of the 2020 campaign will be whether the key date in defining America is 1619 or 1776.\n\nThe left will assert that America is a terrible country and that its defining moment was the introduction of slavery.\n\nMost Americans will see that as a racist definition of history in its own right and will continue to believe in the exceptionalism created in 1776 by the Declaration of Independence and implemented in 1787 by the Constitution.\n\nCAL THOMAS: NY TIMES REWRITES HISTORY AS PROPAGANDA FOR LEFT-WING DEMS\n\nThis debate is being created by The New York Times’ determination to replace its failed crusade about President Trump and Russia with a new effort to define Trump as a racist – and racism as the greatest problem in America.\n\nTimes Executive Editor Dean Baquet, in a remarkable town hall meeting with his staff, admitted that the two-year effort to destroy Trump through the Russian collusion story had failed. The collapse of the investigation by Special Counsel Robert Mueller had closed off that line of attack.\n\nBaquet admitted: “Our readers who want Donald Trump to go away suddenly thought, ‘Holy s---, Bob Mueller is not going to do it.’… We built our newsroom to cover one story, and we did it truly well. Now we have to regroup, and shift resources and emphasis to take on a different story.”\n\nIn pursuit of the political passion of its left-wing base, the Times has now told everyone it intends to make sure the 2020 campaign is about race and racism.\n\nAfter readers rebelled over the headline \"Trump Urges Unity vs. Racism,\" it was clear that the Times had to pander to the left. As Baquet noted: “Our readers and some of our staff cheer us when we take on Donald Trump, but they jeer at us when we take on Joe Biden.”\n\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\n\nIn pursuit of the political passion of their left-wing base, the Times has now told everyone it intends to make sure the 2020 campaign is about race and racism. Here is its explanation:\n\n“The 1619 Project is a major initiative from The New York Times observing the 400th anniversary of the beginning of American slavery. It aims to reframe the country’s history, understanding 1619 as our true founding, and placing the consequences of slavery and the contributions of black Americans at the very center of the story we tell ourselves about who we are.”\n\nThis is a huge undertaking with deep propaganda purposes. It will require massive networking in much of the entertainment and academic left. The Times will seek to distribute it to schools, so young people can be taught to think of America as defined by slavery. The entertainment world will start making movies and TV series focusing on slavery.\n\nIt is a terrific set-up for a later demand for reparations. It is also an obvious follow-on to the two generations of growing anti-American hostility in the education community and in Hollywood.\n\nNikole Hannah-Jones wrote the opening salvo of the 1619 Project for The New York Times Magazine. She is a brilliant writer, and her essay is worth reading. For most Americans, a lot of the facts will be sobering and thought-provoking.\n\nMuch of the pain of the African-American experience has never been communicated to the average American. It is an important part of the American experience and a significant reminder of how far we have come – and how far we have to go.\n\nIn pursuit of the political passion of their left-wing base, the Times has now told everyone it intends to make sure the 2020 campaign is about race and racism\n\nHowever, the 1619 Project seeks to do much more than educate Americans about the reality of slavery, the tragedy of segregation, the violence against blacks that enforced segregation, the long, slow process of extending civil rights, and enforcing laws against racial discrimination.\n\nFor this project, slavery can’t simply be a major part of American history.\n\nSlavery must be the central fact of American history. It must be, as the Times wrote, “the very center of the story we tell ourselves about who we are.”\n\nThis is much too great an assertion. We need a debate about the nature of America and the dynamic forces of our history. We do not need left-wing propaganda masquerading as the truth.\n\nThe fact is: America was defined much more in 1776 and 1787 than in 1619.\n\nThe 1776 assertion that “we have been endowed by our Creator with certain unalienable rights among which are life, liberty, and the pursuit of happiness” was a universal statement of rights which has resonated across the planet.\n\nJones is just plain wrong when she asserts that our democracy’s \"founding ideals were false when they were written. Black Americans have fought to make them true.”\n\nFirst, the \"founding ideals\" were real, revolutionary and morally compelling. They set the basic framework for freedom in America and much of the world. They were implemented only partially in 1776-1787, but that implementation was real and began moving America toward the exceptional country it has become.\n\nJones writes that for \"the most part, black Americans fought back alone.” African Americans constituted about 10 percent of the Union Army by the end of the Civil War. That meant some 90 percent of the Army fighting to abolish slavery was white.\n\nFurthermore, it was a combination of white Republicans and African-Americans that sustained the Reconstruction of the South along the democratic lines Jones describes. She admits that when the Republicans were finally exhausted, the African-American community could not sustain freedom against resurgent white Southerners.\n\nIn the 20th century, there were many white Americans who campaigned for civil rights – and a number who lost their lives going into Mississippi and elsewhere in defiance of the local segregationist power structure.\n\nWhen Jones writes “the truth is that as much democracy as this nation has today, it has been borne on the backs of black resistance,” she ignores the contributions of millions of non-blacks who believed in a more just and open America.\n\nThe implicit racism in her analysis leaps out when she writes, “It is a truly American irony that some Asian Americans, among the groups able to immigrate to the United States because of the black civil rights struggle, are now suing universities to end programs designed to help the descendants of the enslaved.”\n\nIn an essay that champions civil rights for all Americans, she criticizes Asian Americans who want their civil rights protected.\n\n“We were told once, by virtue of our bondage, that we could never be American. But it was by virtue of our bondage that we became the most American of all,” Jones writes.\n\nBut isn't every American entitled to work to be “the most American of all?”\n\nIsn’t the Vietnamese refugee who fled Communism entitled to work hard and study and become “the most American?”\n\nIsn’t the seventh-generation German, Irishman or Italian eligible to serve the country, risk his or her life, and become “the most American?”\n\nThe debate between the racism implicit in the 1619 Project and the exceptionalism growing out of 1776 and 1787 will be a major part of the 2020 campaign.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nI believe most Americans will seek exceptionalism and American unity over guilt, divisiveness and a racial definition of our history.\n\nThe New York Times failed with its Trump-Russian project and now it is going to fail with its “racist America” project.\n\nCLICK HERE TO READ MORE BY NEWT GINGRICH", "description": "The New York Times' 1619 Project wrongly seeks to make slavery the defining moment in American history. What about 1776?", "authors": ["Newt Gingrich", "Former Speaker Of The U.S. House Of Representatives Newt Gingrich Is The Host Of The"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/08/19/694940094001_6074403578001_6074404234001-vs.jpg"}