{"pub": "reuters", "url": "https://af.reuters.com/article/worldNews/idAFKBN1WJ1OA", "downloaded_at": "2019-10-04 17:12:01.403203+00:00", "title": "Syrian rebels vow to back any Turkish operation into northeast", "language": "en", "text": "BEIRUT (Reuters) - Turkey-backed Syrian rebels pledged on Friday to back a potential cross-border offensive that Ankara has threatened to mount against Kurdish fighters in northeast Syria.\n\nFILE PHOTO: Turkey's President Recep Tayyip Erdogan addresses the 74th session of the United Nations General Assembly at U.N. headquarters in New York City, New York, U.S., September 24, 2019. REUTERS/Lucas Jackson//File Photo\n\nAnkara and Washington have agreed to set up a zone in northeast Syria along the border with Turkey, which wants to expel the Syrian Kurdish YPG militia from the frontier.\n\nTurkey has accused the United States, which helped the YPG defeat Islamic State militants, of moving too slowly to establish the zone. The two countries are also at odds over how far it should extend into Syria and who should control it.\n\nTurkey wants the zone to go 30 km (19 miles) inside Syria and has repeatedly warned it could launch its own operation.\n\nPresident Tayyip Erdogan said on Tuesday that given the lack of progress Turkey had no choice but to act alone — his most direct indication yet of a military incursion.\n\nU.S. support for YPG fighters has infuriated Ankara, which sees them as linked to the Kurdish PKK movement that has waged a decades-long insurgency inside Turkey.\n\n“When it comes to the east of the Euphrates (river) ... it is our duty to fight,” Salim Idris, an official of the Turkey-backed Syrian opposition, told a news conference in southeast Turkey.\n\n“We stand in full force in support of our Turkish brothers in fighting all forms of terrorism represented by the PKK gangs.”\n\nWith ties between the NATO allies already under strain, diplomats and analysts say Erdogan would be unwilling to anger Washington with a full-scale incursion into northeast Syria, where U.S. forces are stationed alongside the YPG.\n\nBut Turkey, which has twice launched military offensives with its insurgent allies in northern Syria in recent years, has been pressing for more efforts to set up the border zone.\n\nU.S. and Turkish troops have so far carried out half a dozen joint air missions over northeast Syria and three land patrols, including one on Friday, in what Washington describes as “concrete steps” to address Ankara’s concerns.\n\nTurkey, which backs insurgents holding tracts of territory in northwest Syria near its border, also has about a dozen military posts in the nearby Idlib region.\n\nThe Turkey-backed Syrian opposition also announced on Friday that a number of Idlib rebel factions were merging with the National Army, the main rebel grouping that Turkey supports in the northwest. The move may help widen Ankara’s influence in Idlib province, where militants formerly linked to al-Qaeda are the dominant force.", "description": "Turkey-backed Syrian rebels pledged on Friday to back a potential cross-border offensive that Ankara has threatened to mount against Kurdish fighters in northeast Syria.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191004&t=2&i=1437051659&w=1200&r=LYNXMPEF93136", "published_at": "2019-10-04"}