{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/15/ocasio-cortez-says-trump-sexually-assaults-women-in-response-to-climate-speech-backlash", "downloaded_at": "2019-10-15 23:05:59.632343+00:00", "title": "AOC Says Trump ‘Sexually Assaults Women’ in Response to Backlash", "language": "en", "text": "Rep. Alexandria Ocasio-Cortez (D-NY) on Tuesday claimed that President Trump “sexually assaults women” in response to criticism over the emotional climate change speech she delivered at the C40 World Mayors Summit in Copenhagen last week.\n\nThe Green New Deal advocate delivered a speech at the C40 summit last week and emotionally proclaimed that her dreams of motherhood now “taste bittersweet” due to the looming threat of climate change:\n\n.@AOC, near tears: My dreams of motherhood \"now tastes bittersweet\" because of global warming pic.twitter.com/hwNUSxtp3l — Tom Elliott (@tomselliott) October 11, 2019\n\n“I speak to you not as an elected official or public figure. But I speak to you as a human being,” she said.\n\n“A woman whose dreams of motherhood now taste bittersweet because of what I know about our children’s future and that our actions are responsible for bringing their most dire possibilities into focus,” she continued as her voice cracked.\n\nOcasio-Cortez responded to critics of her emotional plea by claiming that Trump “sexually assaults women, impulsively allows Kurds to be murdered, [and] boosts videos of shooting journalists.”\n\n“You know, maybe one of the actual problems w/ our politics is that too many politicians don’t feel anything when Americans die bc they can’t afford medicine, or when babies are permanently separated from parents,” the freshman lawmaker wrote.\n\n“GOP only has tears for billionaires & outrage towards ‘others,’” she added:\n\nYou know, maybe one of the actual problems w/ our politics is that too many politicians don’t feel anything when Americans die bc they can’t afford medicine, or when babies are permanently separated from parents. GOP only has tears for billionaires & outrage towards “others.” — Alexandria Ocasio-Cortez (@AOC) October 15, 2019\n\nBoth rationality & emotion are inextricable to good leadership, which balances the two. If a person doesn’t feel urgency in their gut when communities are poisoned or when a young man dies bc he couldn’t afford price-gouged insulin, then they shouldn’t be in politics. At all. — Alexandria Ocasio-Cortez (@AOC) October 15, 2019\n\nOcasio-Cortez’s response, which contained a number of vicious falsehoods against the president, failed to address the stem of the critiques — her emotional plea over climate change, specifically.\n\nDuring the speech, she referred to herself as a “descendant of colonized peoples who have already begun to suffer,” calling Hurricane Maria, which resulted in thousands of casualties, a “climate change powered storm.”\n\nShe told the crowd that her grandfather died in the aftermath of the storm and blamed it, in part, on colonial rule, which “contributed to the dire conditions and lack of recovery.”", "description": "AOC claimed that President Trump \"sexually assaults women\" in response to criticism over her emotional climate change speech.", "authors": ["Hannah Bleau"], "top_image": "https://media.breitbart.com/media/2019/07/GettyImages-1163206719-640x335.jpg", "published_at": "2019-10-15"}