{"pub": "businessinsider", "url": "https://businessinsider.com/facebook-dating-secret-crush-instagram-followers-2019-9", "downloaded_at": "2019-09-06 12:22:17.568555+00:00", "title": "Facebook Dating is roping in Instagram to help with its 'secret crush' feature, and it's a smart way to get millennials to return to Facebook", "language": "en", "text": "Facebook's dating service just launched Thursday in the US, and the company is already calling on Instagram — its younger, much cooler sibling — for help in attracting millenials to the aging platform.\n\nFacebook Dating is now available to users in 20 countries around the world who are looking for potential matches in other Facebook users. To coincide with its US debut, Facebook also announced Thursday an important addition to a feature called Secret Crush, which lets you secretly pick out nine existing Facebook Friends you have a romantic interest in.\n\nThe feature was previously announced, but now, you can include Instagram followers among those chosen nine on your Secret Crush list. The feature will still work similarly: Those on your Secret Crush list will only be notified they're there if they have also listed you as a Secret Crush. If they haven't listed you, or aren't on Facebook Dating, that crush you're harboring on a friend will remain a secret.\n\nRead more: Facebook just launched its dating service in the US, and it has a clear advantage that could help it beat out Tinder and Bumble\n\nOn one hand, this addition could be seen simply as a move by Facebook to further unify its various apps— Facebook, Messenger, Instagram, and WhatsApp — under one brand.\n\nHowever, it's more likely Facebook is taking advantage of Instagram's stature as an app more frequented and preferred among millenials and young adults, who make up a key demographic in the digital dating sphere. A 2018 report from eMarketer found that hundreds of thousands of millennial-age online users were leaving Facebook in favor of apps like Snapchat and Instagram. More and more, Facebook has become inundated with parents and their friends, which in turn has led teens to find other platforms free from adult oversight.\n\nOn some of the most popular dating apps — Tinder, Bumble, and Hinge — a significant chunk of users are people under 30. If Facebook Dating wants to be able to compete with these apps, it needs to incentivize users to return to Facebook for the best pool of romantic interests. And the sheer possibility of finding out that your Instagram crush-from-afar is crushing on you, too, may be enough of a pull.", "description": "The addition of Instagram followers to Secret Crush lists may be Facebook Dating's effort to draw millennials back to Facebook.", "authors": ["Paige Leskin"], "top_image": "https://amp.businessinsider.com/images/5d7156a72e22af0d963fc386-1136-568.jpg", "published_at": "2019-09-05"}