{"pub": "foxnews", "url": "https://foxnews.com/sports/dolphins-fan-beers-game-vendor-police", "downloaded_at": "2019-10-01 15:21:57.381183+00:00", "title": "Miami Dolphins fan charged $724 for 2 beers at stadium, police say", "language": "en", "text": "A vendor at the Miami Dolphins' stadium was arrested Sunday after charging an unsuspecting fan $724 for two beers, police said.\n\nNathan Collier, 33, who was at Hard Rock Stadium in Miami, completed the fan's purchase with a personal card reader and not with the device vendors at the stadium are supposed to use, the Miami Herald reported, citing the police report.\n\nA short time later, the fan received an alert from his bank notifying him of the costly charge to his card, the paper reported. It also displayed the vendor’s name.\n\nThe two beers at Hard Rock Stadium in Miami should have cost the fan about $19.\n\nMIAMI DOLPHINS' ALLEN HURNS TAKES TWO BRUTAL BLOWS TO THE HEAD ON ONE PLAY\n\nCollier was taken into custody without incident, WPLG-TV reported. Police said he had a Square credit card reader in his possession.\n\nCollier was not working for the Hard Rock Stadium’s concessioner or the Dolphins, according to the Herald. His employer was a Kentucky company that employs “walking vendors” at major sporting events and concerts.\n\nEX-NFL PLAYER WHO HAD ARM AMPUTATED AFTER CAR CRASH THANKS BYSTANDERS: 'THEY'RE THE ONES THAT SAVED MY LIFE THAT NIGHT'\n\n“Our onsite supervisor contacted the authorities immediately upon learning of the overcharge on what was Mr. Collier’s unauthorized personal device,” the company told the paper.\n\nOnline court records show Collier was booked into the Miami-Dade County jail Monday on the grand theft charge and possession of a skimming device charges.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nThe expensive beers may have helped the fan drown his sorrows. The Dolphins lost to the Los Angeles Chargers to remain winless for the year.", "description": "An unsuspecting fan at Sunday’s Miami Dolphins game was charged $724 for two beers by a vendor who was arrested for grand theft, according to reports.", "authors": ["Robert Gearty"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/nataniel-collier1.jpg", "published_at": "2019-10-01"}