{"pub": "thehill", "url": "https://thehill.com/policy/technology/465183-south-carolina-oks-google-pumping-drinking-water-to-cool-servers", "downloaded_at": "2019-10-10 15:02:46.568515+00:00", "title": "South Carolina OKs Google pumping drinking water to cool servers", "language": "en", "text": "South Carolina on Wednesday approved allowing Google to pump nearly 550 million gallons of drinking water per year to cool its servers.\n\nThe decision from the South Carolina Department of Health and Environmental Control (DHEC) is the latest salvo in an ongoing battle over whether the tech giant should get state approval to pump from a major water source that critics say is being depleted.\n\nADVERTISEMENT\n\nIn a letter to the company obtained by The State, DHEC said that Google must comply with conditions in the permit, including a cap on the amount of water it can withdraw, or risk losing its DHEC license. The permit expires in 2023.\n\n“We strive to build sustainability into everything that we do, and our data centers are no different,” Google said in a statement to The State. “We’ve been proud to call South Carolina home for more than ten years, and we’re proud of the investments that we’ve made here, including more than $2 billion in capital investment, supporting employment opportunities, municipal improvements, educational programs and local nonprofits.”\n\nGroundwater withdrawals are a source of growing concern in South Carolina as demands on aquifers, large subterranean water supplies that line the state’s coastal plain, rise. Besides Google, megafarms in the center of the state have also come under scrutiny for their water use.\n\nCritics of DHEC’s said Google could get cooling water from rivers in the area rather that siphon off drinking water.\n\n“I don’t’ have a beef against Google itself, but I don’t think it is appropriate to use pristine groundwater for cooling computers, versus providing that water for people,’’ Clay Duffie, manager of the Mount Pleasant Waterworks that draws water from the ground and a local river, told The State. “We are obviously concerned about the [long-term], safe sustainable yield of that aquifer.”", "description": "South Carolina on Wednesday approved allowing Google to pump nearly 550 million gallons of drinking water per year to cool its servers.", "authors": [], "top_image": "https://thehill.com/sites/default/files/google_060618getty.jpg", "published_at": "2019-10-10"}