{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/09/16/seriously-bernie-wants-to-ban-all-deportations-n2553190", "downloaded_at": "2019-09-17 08:25:36.599051+00:00", "title": "Seriously? Bernie Wants To Ban All Deportations", "language": "en", "text": "Sen. Bernie Sanders (I-VT) on Saturday told progressive Latino group Mijente that if elected president, he would have a complete moratorium on the deportation of illegal aliens.\n\n“We are going to end the ICE raids that are terrorizing communities all across this country,” Sanders said. “We are going to impose a moratorium on deportations. And we are going to, as I mentioned — and there are some things that a president can do with executive orders and some things you can’t.”\n\nSanders took to Twitter on Sunday to reiterate his position.\n\nWe must treat undocumented people with dignity. When we are in the White House, we will end the ICE raids which are terrorizing communities all across this country and impose a moratorium on deportations. — Bernie Sanders (@BernieSanders) September 15, 2019\n\nOne of Sanders' campaign staffers told CNN's Annie Grayer that the moratorium is a new policy position.\n\nNEW: During an event with Mijente Latinx leaders and organizers, Senator @BernieSanders was asked if he would call for a moratorium on deportations. Sanders said yes. A senior policy advisor on the campaign confirms to me this is new. — Annie Grayer (@AnnieGrayerCNN) September 15, 2019\n\nBut not only does he want to end deportations, he also wants to provide illegal aliens with free health care and college tuition.\n\n“I am, as some of you know, supportive of a Medicare for All single-payer system and that means that everybody in the country has health care including the undocumented. And mark my words. You’ll see 30-second attacking me for that,” Sanders explained.\n\n“And then you’ll see another set of 30-second ads because when I say I want to make public colleges and universities tuition-free, that also includes the undocumented,” Sanders said. “Now I hope that as soon as possible the undocumented will not be undocumented. That’s the goal.\"", "description": "Facepalm..09/17/2019 4:25:37AM EST.", "authors": ["Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/255/c93fd8b6-b756-4251-9391-751b571f618f.png", "published_at": "2019-09-16"}