{"pub": "businessinsider", "url": "https://pedestrian.tv/news/two-men-charged-with-murder-ex-girlfriend-father", "downloaded_at": "2019-10-20 23:26:34.941852+00:00", "title": "Two Teens Charged After Allegedly Pistol Whipping Man To Death In Queensland", "language": "en", "text": "A 19-year-old man and his friend have been charged with the murder of his ex-girlfriend’s father after allegedly pistol whipping him and leaving him to die in southeast Queensland.\n\nQueensland Police allege the two teenagers forced their way into a Springfield Lakes home at around 8.30pm on Saturday night.\n\nOne of the men allegedly punched 20-year-old Julie Murphy in the face and stole her phone. Nine News reports the man who assaulted her was her ex-boyfriend.\n\nThe pair then drove off in a white ute but were followed by the woman’s father David Murphy, his teenage son, and a 20-year-old family friend in a silver sedan.\n\nPolice say the two cars stopped and the men allegedly got out of the ute and threatened the 49-year-old father with a gun.\n\nOne of the teenagers then allegedly struck Murphy on the head with the gun, causing him to fall to the ground and lose consciousness.\n\nThe 20-year-old driver of the silver sedan tried to help Murphy but was also allegedly assaulted.\n\nThe two teenagers fled the scene again in the white ute.\n\nQueensland Police say emergency services treated Murphy but he was declared dead at the scene.\n\nThe 20-year-old man was taken to hospital with head injuries.\n\nThe two teenagers, one from Springfield Lakes and the other from Molendinar, were taken into police custody just before midnight on Saturday. They were later charged with one count each of murder, common assault, enter dwelling and robbery with violence.\n\nThey are slated to appear in the Ipswich Magistrates Court on Monday.", "description": "A 19-year-old man and his friend have been charged with the murder of his ex-girlfriend's father in southeast Queensland.", "authors": ["Steffanie Tan"], "top_image": "https://www.pedestrian.tv/content/uploads/2018/10/police-sydney-body-1.jpg", "published_at": "2019-10-20"}