{"pub": "heritage", "url": "https://heritage.org/impact/edwin-meese-iii-receives-presidential-medal-freedom", "downloaded_at": "2019-10-09 00:24:39.944992+00:00", "title": "Edwin Meese III Receives Presidential Medal of Freedom", "language": "en", "text": "President Donald Trump has awarded Edwin Meese III the Presidential Medal of Freedom for his distinguished leadership and legal guidance while serving as attorney general under President Ronald Reagan. Meese is The Heritage Foundation’s Ronald Reagan distinguished fellow emeritus and namesake of the Meese Center for Legal and Judicial Studies.\n\nThis prestigious award is the nation’s highest civilian honor, which may be awarded by the president to individuals who have made especially meritorious contributions to the security or national interests of the United States, to world peace, or to cultural or other significant public or private endeavors. Meese received the award during an Oval Office ceremony at the White House.\n\n“I am greatly honored to receive such recognition from President Trump. For many years, I had the privilege of serving the country under President Ronald Reagan. During that time and throughout my life and career, my aim has been to remain committed to the Constitution, the rule of law and the conservative American values that have made America ‘the shining city upon a hill,’” said Meese.\n\n\n\n“I am endlessly grateful for the country and the people that have made the many opportunities throughout my life possible,” he added.\n\n“Edwin Meese III has long been a thought leader and strong conservative voice on matters of law and policy,” the White House said in a release announcing the award.\n\n“As Attorney General, he promoted Federalism and the original public understanding of our Constitution. Since leaving public service, Edwin Meese has continued to champion our Nation’s founding principles through his extensive work at The Heritage Foundation,” the statement continued.\n\n“I’ve known and worked with Attorney General Ed Meese for nearly two decades at The Heritage Foundation and I feel there isn’t a recipient more worthy of this honor,” said Heritage Foundation President, Kay Coles James.\n\n“Ed has lived the life of an authentic public servant, routinely putting duty to the country ahead of his own interests. From serving as one of Ronald Reagan’s most trusted advisers and helping to foster the Reagan Revolution to founding The Heritage Foundation’s Center for Legal and Judicial Studies, Ed has shown the American people the kind of successes that can be achieved when conservative principles are put into practice. Ed’s entire career has reflected an unwavering commitment to the Constitution, the rule of law, limited government, free enterprise, and individual liberty. With all that he has accomplished, Ed remains one of the most kind and humble men I have ever known.”\n\nFor a quarter century, Meese has worked at The Heritage Foundation where he has kept Reagan’s legacy of conservative principles alive in public debate and discourse.\n\nMeese served as the 75th attorney general under Reagan from February 1985 to August 1988. Meese’s time as attorney general was marked by remarkable efforts in counterterrorism, anti-drug initiatives and efforts to combat organized crime.\n\nMore recently, Meese has served on the West Point Board of Visitors, the Iraq Study Group, the National War Powers Commission, and the FBI Counterterrorism Review Commission. He has also been a leader in numerous legal, civic, and educational organizations.\n\n\n\nLearn more about Meese's life and legacy.", "description": "President Donald Trump has awarded Edwin Meese III the Presidential Medal of Freedom for his distinguished leadership and legal guidance while serving as attorney general under President Ronald Reagan. Meese is The Heritage Foundation’s Ronald Reagan distinguished fellow emeritus and namesake of the Meese Center for Legal and Judicial Studies.", "authors": [], "top_image": "https://www.heritage.org/sites/default/files/styles/facebook_optimized/public/images/2019-10/Meese%20Award%20Trump_0.jpg?itok=757sFvpy", "published_at": "2019-10-09"}