{"pub": "marketwatch", "url": "https://marketwatch.com/story/boj-stay-pat-hints-at-possible-action-in-october-2019-09-18", "downloaded_at": "2019-09-19 06:01:49.707830+00:00", "title": "BOJ stay pat, hints at possible action in October", "language": "en", "text": "TOKYO--The Bank of Japan left policy unchanged but hinted at possible action at its next meeting, saying it believes momentum toward achieving its inflation target may be falling short.\n\nThe BOJ said Thursday that it would take that sluggish momentum into account and re-examine economic and price developments at its next regular two-day policy meeting Oct. 30-31.\n\nInflation has been running below 1% recently, short of the BOJ's 2% target.\n\nThe bank cited global \"protectionist moves\" and said overseas economies were slowing down. It said \"their downside risks seem to be increasing.\"\n\nOther central banks, also faced with low inflation, have been easing. The Federal Reserve on Wednesday lowered its policy interest rate by a quarter percentage point for the second time in two months. Last week, the European Central Bank cut its rate target to minus 0.5% and reintroduced a program to buy eurozone debt.\n\nThe BOJ decided to maintain its short-term deposit rate at minus 0.1% and its target for 10-year Japanese government bond yields at around zero. It also reiterated its pledge to keep extremely low rates at least through spring 2020.\n\nThe Japanese central bank reiterated that it wouldn't hesitate to take additional easing measures if there is a greater threat to price stability, a passage the bank added at its previous meeting in July.\n\nSome economists say the BOJ is likely to be forced to join the global trend of easing before too long.\n\nIf it continues to leave its policy unchanged despite its pledge to ease without hesitation, \"the markets would probably interpret this as a sign that the bank is out of ammunition,\" said Takeshi Yamaguchi, an economist at Morgan Stanley MUFG Securities. Mr. Yamaguchi said indicators were pointing to weak domestic demand ahead of an increase in the national sales tax to 10% from 8% on Oct. 1.\n\nThe central bank is growing more open to the idea of cutting short-term interest rates deeper into negative territory despite the side effects on the financial sector, people familiar with the bank's thinking said ahead of the meeting. If the bank were to do so, however, it would look for ways to avoid sharp declines at the longer end of the yield curve, the people said.\n\nWrite to Megumi Fujikawa at megumi.fujikawa@wsj.com", "description": "TOKYO--The Bank of Japan left policy unchanged but hinted at possible action at its next meeting, saying it believes momentum toward achieving its inflation...", "authors": ["Megumi Fujikawa"], "top_image": "https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png", "published_at": "2019-09-18"}