{"pub": "huffpost", "url": "https://huffpost.com/entry/macaulay-culkin-dancing-with-lizzo-on-stage-is-randomly-good-as-hell_n_5daf3cb5e4b08cfcc32366c4", "downloaded_at": "2019-10-22 20:45:05.030200+00:00", "title": "Macaulay Culkin Dancing With Lizzo On Stage Is Randomly Good As Hell", "language": "en", "text": "Macaulay Culkin found himself at home, but not quite so alone when he joined Lizzo on stage at a recent concert.\n\nThe former child star is apparently friendly enough with the “Truth Hurts” singer to not only dance alongside her in front of thousands of concertgoers, but to allow her to make the iconic “Home Alone” face directly in front of him.\n\nBefore launching into her empowerment anthem “Like A Girl” on Monday night, the chart-topping artist recruited Culkin for her version of the call-and-response “Gigolo Game” on stage.\n\nThe actor readily busted a move ― the sprinkler ― as Lizzo and her backup dancers hyped him up.\n\n“When @lizzobeeating asks you to do a silly dance... You get up there and do a silly dance,” Culkin wrote in the caption of a clip of his performance on social media.\n\nAfter Culkin finished dancing, Lizzo poked fun at his “Home Alone” role by recreating his character Kevin McCallister’s shocked expression from the film, much to the audience’s delight.\n\nCulkin, who famously loathes revisiting the role, played it off well. Lizzo then pulled him in for an embrace and asked the crowd to give the actor his due.\n\nDuring a rare interview in 2018, the famously press-averse Culkin sat down with Ellen DeGeneres and revealed he won’t he watch the classic Christmas film anymore and even tries to avoid being in public over the holidays.\n\nAnd when strangers ask him to do “the face,” Culkin said he tends to shoot them down.\n\n“No. Been there, done that already. I’m 37 now, OK? OK,” he told DeGeneres about fan requests.\n\nBut maybe he’d make an exception for his new BFF Lizzo.", "description": "The singer even made the classic \"Home Alone\" face in front of the former child star.", "authors": ["Entertainment Writer"], "top_image": "https://img.huffingtonpost.com/asset/5daf410e210000a521ad395d.png?cache=nxr7qbfhho&ops=1778_1000", "published_at": "2019-10-22"}