{"pub": "businessinsider", "url": "https://businessinsider.com/trump-sell-turkey-f-35-jets-for-no-syria-invasion-2019-10", "downloaded_at": "2019-10-10 03:14:10.593893+00:00", "title": "Trump reportedly offered to sell F-35 jets to Turkey in exchange for not attacking Kurdish forces in Syria", "language": "en", "text": "President Donald Trump reportedly advised Turkey not to invade northeastern Syria and offered to resume sales of the US's fifth-generation aircraft, the Lockheed Martin F-35.\n\nTrump reportedly offered Erdogan \"a really good package,\" in addition to other benefits and a presidential visit, a senior official said, according to a Washington Post report published Wednesday.\n\nThe purported offer marks a departure from the US's policy not to include Turkey in its flagship F-35 program starting in July.\n\nThe US granted F-35 contracts to several allies, including the UK and South Korea, but took Turkey off that list when it purchased Russia's advanced S-400 air defense systems.\n\nVisit Business Insider's homepage for more stories.\n\nIn a phone called between President Donald Trump and Turkish President Recep Tayyip Erdogan on Sunday, the US president reportedly advised Turkey not to invade northeastern Syria and offered to resume sales of the US's fifth-generation aircraft, the Lockheed Martin F-35.\n\nTrump offered Erdogan \"a really good package,\" in addition to other benefits and a presidential visit, a senior State Department official told Washington Post columnist Josh Rogin.\n\nErdogan is still scheduled to visit the White House in November.\n\nTrump made the decision to withdraw roughly 1,000 US troops from the region on Sunday following his call with Erdogan. Thousands of US-backed Kurdish allies are stationed in northeastern Syria, and observers say Trump's decision has left the Kurdish fighters vulnerable to Turkish attack and may even fuel an ISIS resurgence.\n\nTurkey has long cited the Kurdish People's Protection Units, or YPG, and the Kurdish-majority Syrian Democratic Forces (SDF) as terrorist threats with links to the Kurdistan Workers' Party (PKK). The PPK is a Turkey-based rebel group that has been designated as a terrorist organization by the US and Turkey.\n\nRead more: Trump brushes off worries that freed ISIS prisoners will be a threat: 'They're going to be escaping to Europe.'\n\nIsrael's first F-35A Lightning II fighter jet is revealed during a ceremony. Lockheed Martin\n\nF-35s or the Russian S-400\n\nTrump's purported offer to Erdogan marks a departure from the US's policy not to include Turkey in its flagship F-35 program starting in July. The US granted F-35 contracts to several allies, including the UK and South Korea, but took Turkey off that list when it purchased Russia's advanced S-400 air defense systems.\n\n\"The F-35 cannot coexist with a Russian intelligence collection platform that will be used to learn about its advanced capabilities,\" the White House said in a statement at the time.\n\n\"Turkey has been a longstanding and trusted partner and NATO Ally for over 65 years, but accepting the S-400 undermines the commitments all NATO Allies made to each other to move away from Russian systems,\" the statement added. \"This will have detrimental impacts on Turkish interoperability with the Alliance.\"\n\nTurkey, which created over 900 parts for the F-35, was removed from the program and is expected to be replaced by American manufacturers by March 2020, according to Lockheed Martin CEO Marillyn Hewson. The country has said it would buy 100 F-35As.\n\nThe US also withdrew its offer of a $3.5 billion Patriot missile system contract due to Turkey's purchase of Russia's S-400s.\n\nTurkish officials protested the expulsions and described it as a \"mistake which would open irreparable wounds.\"\n\nRussian S-400 air-defense missile systems in Moscow during the Victory Day parade, May 9, 2018. REUTERS/Sergei Karpukhin\n\nRead more: 'This is just chaos': Retired Marine general condemns Trump's decision to stand down as Turkey launches military attacks in Syria\n\nDespite warnings from Congress, Trump sympathized with Turkey and signaled the resumption of F-35 deliveries. Under the Countering America's Adversaries Through Sanctions Act, Turkey's purchase of Russian military equipment makes it liable to US sanctions.\n\n\"It's a very tough situation that they're in, and it's a very tough situation that we've been placed in the United States,\" Trump said to reporters in July. \"We'll see what happens. But it's not really fair.\"\n\n\"Because of the fact that you bought a Russian missile, we're not allowed to sell them billions of dollars' worth of aircraft,\" he added. \"It's not a fair situation.\"", "description": "Trump offered Erdogan \"a really good package\" along with other benefits if he did not invade Syria, a senior US official told The Washington Post.", "authors": ["David Choi"], "top_image": "https://image.businessinsider.com/59603158d9fccd1c008b4edf?width=1200&format=jpeg", "published_at": "2019-10-10"}