{"pub": "independent", "title": "Final Say: The fight for a people’s vote on Brexit is far from over", "url": "https://independent.co.uk/voices/brexit-final-say-peoples-vote-tory-party-prime-minister-boris-johnson-a8955916.html", "language": "en", "published_at": "2019-06-12", "downloaded_at": "2019-09-02 07:26:28.393518+00:00", "text": "Nobody should underestimate what is at stake right now.\n\nPeople talk often of Brexit as the biggest challenge since the Second World War. It is certainly proving to be a lot more difficult and complicated than was promised by those who won the referendum campaign in 2016. How strange it is, how alarming for our democracy, that those who made so many false promises are now making fresh ones in the hope of becoming prime minister.\n\nBut this debate is far too big, far too important to be a question of who is up and who is down on a given day in the Conservative Party. When I see the debate unfolding, I worry for our very future. Not for me and my generation but for the young people who so want a different future to the one being debated and decided by the politicians right now.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nShape Created with Sketch. Theresa May gets emotional during her resignation Show all 13 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Theresa May gets emotional during her resignation 1/13 Reuters 2/13 REUTERS 3/13 PA 4/13 REUTERS 5/13 Prime Minister Theresa May makes a statement outside at 10 Downing Street in London, where she announced she is standing down as Tory party leader on Friday June 7. PA 6/13 REUTERS 7/13 REUTERS 8/13 REUTERS 9/13 AFP/Getty 10/13 REUTERS 11/13 REUTERS 12/13 AP 13/13 AFP/Getty Images 1/13 Reuters 2/13 REUTERS 3/13 PA 4/13 REUTERS 5/13 Prime Minister Theresa May makes a statement outside at 10 Downing Street in London, where she announced she is standing down as Tory party leader on Friday June 7. PA 6/13 REUTERS 7/13 REUTERS 8/13 REUTERS 9/13 AFP/Getty 10/13 REUTERS 11/13 REUTERS 12/13 AP 13/13 AFP/Getty Images\n\nI am old enough to remember the war. I travelled to Germany to witness for myself what nationalism, populism and the breakdown of peace between the great European nations had done. Amidst the rubble I made great friends who have remained friends for the rest of our lives.\n\nNow our young people can see the freedoms and opportunities that flowed from the change which followed being threatened, removed and curtailed, it makes me angry that their future is being decided in this way.\n\nBut those who have campaigned for a people’s vote so that the public can have the Final Say must take heart. We are still in the fight. It is a fight for the very future of our country. And it is a fight we have to win.\n\nIt would be great to think we had the kind of leaders who led Britain through great fights of the past, like Churchill and Attlee.\n\nBut we don’t. And that is why the people, and especially young people, must understand the gravity of what it at stake, and take up their role in making sure the country does the right thing at this crucial moment in our history.\n\nI thought my rallying days were over. But there are two simple reasons why I have joined the fight for a people’s vote: my patriotism and my love of the younger generation. It is their future that counts. It is their future we all have a duty to secure.\n\nDo not let anyone get away with the argument that tearing our country out of one of the most successful partnerships in our history is somehow a great act of patriotism. It is not. And do not let anyone challenge the democratic legitimacy of going to the country and asking for its view in a confirmatory vote on whatever emerges from the Brexit process. We’re already being asked to accept the process under which the new prime minister is being chosen: by a tiny and unrepresentative group of people, namely Tory party members.\n\nThe true national interest requires us to do the right thing for the long term. That means being honest about the damage being done.\n\nAlready, even before we have left the EU, Brexit is damaging our country, our economy, our society and our standing in the world – damage that will be worsened by the kind of ruinous no deal being pledged by some who aspire to become prime minister.\n\nSo be part of the fight. Get involved. Get engaged. Stay involved. Stay engaged. We have to fight for our beliefs and fight for the future we know can come from doing the right thing.\n\nBetty Boothroyd is the former speaker of the House of Commons", "description": "Nobody should underestimate what is at stake right now.", "authors": ["Betty Boothroyd"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/03/23/14/Alamy-Live-Peoples-Vote-March-London-UK-T14136.jpg"}