{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/margaret-hodge-veteran-labour-mp-20748168", "downloaded_at": "2019-10-29 15:14:22.133561+00:00", "title": "Margaret Hodge: Veteran Labour MP re-selected after bitter battle", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLabour MP Dame Margaret Hodge has been re-selected by her local Labour Party to run for the seat of Barking.\n\nDame Margaret tweeted a picture of herself surrounded by colleagues, with a one word message: Victory!\n\nHer Labour colleague Ruth Smeeth (Stoke-on-Trent North) raised a point of order in the Commons to announce that Dame Margaret had been re-selected.\n\nMs Smeeth, parliamentary chair of the Jewish Labour Movement, said: \"I just want to put on record the fact that Margaret Hodge, the honourable (member) for Barking, has been re-selected this evening, against an appalling attack by members of our party and I am delighted she remains a Labour candidate at the next general election .\"\n\nLabour had been accused of anti-Semitism when Dame Margaret Hodge was told she would face a re-selection battle in her east London constituency.\n\nAn outspoken critic of Jeremy Corbyn , on one occasion Dame Margaret told Mr Corbyn to his face that he is an \"anti-Semite and racist\".\n\nDame Margaret was forced into the re-selection fight after activists in her constituency voted for the chance to pick a new candidate.\n\nAt the time, Labour's former deputy leader Harriet Harman said she was \"dismayed more than I can say\" by the vote.\n\nShe tweeted: \"Margaret Hodge, scourge of tax avoiders, racists and anti-Semitism. Champion of progressive policies. Hyperactive local MP. Surely this cannot stand!\"\n\nDame Margaret was the second Labour MP to be \"triggered\" through the party's new ballot procedures which make it easier for local members to force a contest.\n\nShe said at the time that she was \"disappointed\" but would fight to keep her Barking seat.", "description": "The Barking MP had faced a deselection attempt after clashing with Jeremy Corbyn over anti-Semitism in the party", "authors": ["Padraig Collins", "Image", "Dan Kitwood"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article13181310.ece/ALTERNATES/s1200/0_Delegates-Attend-The-2018-Jewish-Labour-Movement-Conference.jpg", "published_at": "2019-10-29"}