{"pub": "theverge", "url": "https://theverge.com/2019/4/30/18523121/bird-electric-scooter-delivery-monthly-rental-sf-barcelona", "downloaded_at": "2019-10-05 14:28:12.507191+00:00", "title": "You can now rent a Bird electric scooter for $25 a month", "language": "en", "text": "If using an app to track down a nearby electric scooter to rent is too much of a crapshoot, Bird is now offering monthly rentals of its battery-powered two-wheelers for a flat rate of $24.99. The company will even deliver the scooter right to your front door, and pick it up when you’re done.\n\nOnly in San Francisco and Barcelona to start out\n\nThe catch is you have to live in San Francisco or Barcelona to sign up for a month-long rental of a Bird scooter. The new service is only launching in those two cities, though if all goes well, the company expects to roll it out in other markets at a later date.\n\nBird first announced its plan for a new concierge service last October. Now it appears Bird Delivery is being coupled with monthly personal rentals to sweeten the deal. Here’s how it will work, according to the company:\n\nAvailable soon in San Francisco and Barcelona, people can open the Bird app and enter information such as where and when they would like their Bird delivered (home, work, elsewhere). After your order is placed, a Bird representative will follow up to confirm details and arrange for a personal Bird, charger, and lock to be delivered. When your rental period expires, Bird will come and pick up the vehicle, charger, and lock from your location.\n\nIn some respects, this is a clever way around San Francisco’s current rules prohibiting all scooter companies except two — Scoot and Skip — from offering dockless e-scooters for rent. The policy, which was enacted in August 2018, was seen as a rebuke to Bird and Lime for dumping their scooters on the sidewalks of San Francisco in 2017 without first seeking the city’s permission. Bird’s delivery service avoids the problem of obtaining a permit from the city to operate a dockless scooter-sharing service by becoming a concierge service instead.\n\nCurrently, Bird’s normal dockless scooters are $1 to unlock (using an app) and then 10-30 cents for every minute of riding. It’s an interesting twist in the fast-paced shared scooter market, which has so far prioritized ubiquity over convenience.\n\nBut scooter companies aren’t just competing with each other; they are also competing with ride-hailing services like Uber and Lyft. Right now, anyone can summon a car to their location with just the tap of a button. With scooter services like Bird, there is some hide-and-seek involved, as riders need to locate the closest scooter using the scooter’s GPS device and the app’s tiny map. Bird is aiming to cut through some of that inconvenience with its new delivery service.", "description": "If using an app to track down a nearby electric scooter to rent is too much of a crapshoot, Bird is now offering monthly rentals of its battery-powered two-wheelers for a flat rate of $24.99. The company will even deliver the scooter right to your front door, and pick it up when you’re done.", "authors": ["Andrew J. Hawkins", "Apr"], "top_image": "https://cdn.vox-cdn.com/thumbor/Idbz3Z5lCI2sXnxrk3TiFn32kd4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15985611/akrales_190321_3312_0002.jpg", "published_at": "2019-04-30"}