{"pub": "washingtonpost", "url": "https://washingtonpost.com/technology/2019/10/13/entire-fortnite-ecosystem-has-been-sucked-into-virtual-black-hole-game-is-down", "downloaded_at": "2019-10-13 23:34:04.544251+00:00", "title": "The entire Fortnite ecosystem has been sucked into a virtual black hole, and the game is down", "language": "en", "text": "This time, players who logged in at 2 p.m. Eastern time witnessed a rocket launch from the Dusty Divot area of the island, which turned into multiple rockets, all zipping around in a manner similar to the rocket that players saw in the first season-ending live event in Season 4. The rockets then converged onto an area where a meteor was landing, and the collision caused players to fly up into the air to witness a black hole suck the entirety of the game inside.\n\nAD\n\nAD\n\nAnd since then, players have been left with nothing but the black hole.\n\nAnyone looking for clues on Fortnite’s multiple social media accounts were left staring at the same image. The same black hole greets all visitors to Fortnite’s Instagram.\n\nAnd intrepid players discovered that inputting the infamous “Konami code” launches a Galaga-style shooting game starring the mascot of Greasy Grove restaurant Durrr Burger.\n\nSome players may not have been able to log in to the game in time to witness the event (which usually happens thanks to the large load of people trying to queue in). But this time, they were treated to their own version of the black hole.\n\nAD\n\nAs the event happened, many Twitch users reported having trouble using the popular streaming service, with more than 4 million people watching the event. Millions more tuned in on YouTube and Twitter, as well. So what happens next? Epic Games has always been mum about its planned changes. Rumors have swirled that the famous Fortnite map was going to be completely replaced, and given that everything’s now gone, it sounds plausible. There’s even hope that Fortnite would finally release as a full game, as the viral hit has technically been in beta since launching September 2017.\n\nAD\n\nWhat if \"The End\" for @FortniteGame is just them removing the \"Early Access\" marker on the loading screens? 🤔 — DrLupo (@DrLupo) October 12, 2019\n\nNo word from Epic Games on when the game will return online.\n\nEpic Games recently announced significant planned changes to the game, including adding AI-charged “bots” to replace human players, in an effort to ease the barrier of entry for even more players. Along with a new matchmaking system that will pair players with groups of similar skill, Fortnite probably needs significant downtime before the changes take place.\n\nAD\n\nEpic Games has previously deployed marketing campaigns for a seasonal transition. To welcome Season 5, Epic Games placed real-life versions of fan-favorite items and locations across the world, like this Durrr Burger suddenly appearing in the middle of a barren California desert.\n\nSeasonal updates have typically been made Thursday morning. It may be a long few days for players of the world’s most popular video game.\n\nAD", "description": "What happens when the world's most popular game shuts down?", "authors": ["Gene Park"], "top_image": "https://www.washingtonpost.com/resizer/jXtejUgJIPKGR8jnk7RhIDCBV-I=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/P6IO643EHBEZ5IE6AVFYY3FTOI.jpg", "published_at": "2019-10-13"}