{"pub": "afr", "url": "https://afr.com/work-and-careers/workplace/big-business-taken-eye-off-the-ball-over-underpayments-20191027-p534kr", "downloaded_at": "2019-10-27 04:00:27.887559+00:00", "title": "Big business 'taken eye off the ball' over underpayments", "language": "en", "text": "He said about 30 businesses had self-disclosed underpayments to the FWO in the last two years in part due to a growing concern about the potential brand damage over the issue.\n\n“I think that has got the attention of directors and boards who are asking questions of businesses to make sure they are compliant so they can avoid being dragged through the headlines.”\n\nMr Brown made the comments at The Association of Payroll Specialists' (TAPS) conference that explored the reasons behind what it described as a \"compliance crisis”.\n\nHead of TAPS, Jason Low, said payroll systems meant “one single problem could see you end up on the front page of the paper”.\n\nHe said one case where someone “forgot to click the box” on a new payroll system had cost a business $350,000 because it meant superannuation was not paid on bonuses.\n\nEmployers started self-disclosing underpayments to the FWO after laws brought in by the Coalition in late 2017 significantly increased fines and liability over underpayments.\n\nRecent underpayment disclosures have been as high as $40 million in the case of Super Retail Group, whose errors resulted in an almost 30 per cent cut in bottom-line profits.\n\nBut by pledging to revamp compliance practices and make “contrition payments” through undertakings with the FWO, employers have managed to avoid prosecution.\n\nAdvertisement\n\n'They've buried all the bodies'\n\nMr Brown said, while most self-disclosed underpayments were “honest mistakes”, some companies had approached the FWO with explanations “we basically don’t believe”.\n\n“They discover the problem 12 to 18 months ago and they have lawyers and the big four [professional services firms] in and they’ve buried all the bodies. They haven’t even left mounds in the lawn - it’s flat and smooth and there’s nothing to see here. As a regulator that pricks our ears and we want to know what happened.”\n\nAt Senate estimates last week, FWO Sandra Parker suggested the agency would push for higher contrition payments following criticism of $200,000 paid by George Calombaris’ Made Establishment restaurant group over $7.8 million in underpayments.\n\n\"What I would say is that we will in future take into account the size of the underpayment as a major factor and we didn't. . . make it as perhaps as high a priority as we think, clearly, the public and others think we should,” she said.\n\nThe general manager of Ascendor payroll software, Richard Breden, said while big business was struggling with compliance, small businesses had no resources to interpret industrial instruments “which equally apply to them and are incredibly complex”.\n\nThere was also “constant interpretation over what we thought was fairly settled”, he said, with recent court rulings allowing regular casuals to claim annual leave and requiring sick leave to be accrued based on hours worked - in opposition to FWO advice.\n\nMr Low questioned that if government agencies “find it hard, what hope do we have?”\n\nAdvertisement\n\nAngela Lehmann, director of single-touch payroll at the ATO, said the agency understood it was “really hard” for business and that it was revisiting its interpretations of workplace rules with the FWO.\n\n“If you look at our laws they are quite old and were written a long time ago and the workplace environment has changed so much,” she said.\n\n“[There’s a sense that] maybe our initial interpretation was fit for purpose at the time but it’s not now.”\n\nMr Brown admitted it “wasn’t the easiest system to comply with” and said the FWO had “constant feedback, particularly from small to medium size businesses, that one of the challenges they find is the complexities of the way [awards] are written”.", "description": "Under-resourced payroll offices and a lax approach to compliance are behind a recent spate of multi-million dollar underpayments by major corporates, experts say.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.3145%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_6%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/c76efa5dcbff20ac7d90036f63471104a78181e4", "published_at": "2019-10-27"}