{"pub": "metro", "url": "https://metro.co.uk/2019/10/06/how-to-watch-i-love-you-now-die-and-what-is-it-about-10870918", "downloaded_at": "2019-10-07 00:11:50.020697+00:00", "title": "How to watch I Love You, Now Die and what is it about?", "language": "en", "text": "I Love You, Now Die focuses on the case of Michelle Carter (Picture: Sky/HBO)\n\nTrue crime aficionados – your time is now thanks to Sky’s new channel, Sky Crime.\n\nA whole channel dedicated to that old notion that true life really is stranger than fiction, looking at crimes that have bewitched, bothered and bewildered people the world over.\n\nOne of its first juicy shows to delve into – sure to be a talking point on social media and beyond – is I Love You, Now Die.\n\nHere’s when you can watch the two-part documentary and what to expect.\n\nWhat is I Love You, Now Die about?\n\nThe two-part documentary series follows the case of the death of Conrad Roy and the involvement of his girlfriend Michelle Carter.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nPeople thought they knew the story of the girlfriend who ultimately encouraged her own boyfriend to kill himself and then demanded to be released from jail.\n\nAdvertisement\n\nAdvertisement\n\nBut, as HBO’s gripping two-part documentary will show, nothing is ever black and white in true crime.\n\nWhen is I Love You, Now Die out in the UK?\n\nThe first episode of the documentary aired in the UK at 2am on Sunday on Sky Crime and is repeated tonight at 9pm.\n\nMichelle Carter was sentenced for the death of Conrad Roy, but is there more to the story? (Picture: Sky/AP)\n\nHow to watch I Love You, Now Die in the UK?\n\nThe documentary is part of Sky Crime’s exciting new line-up.\n\nIf you’re an existing Sky customer, you’ll instantly have access to the show when it airs.\n\nWatch it live from your Sky box or through one of your registered Sky Go devices.\n\nIt will also be available to watch on NOW TV.\n\nThe texting-suicide story captured imaginations across the world (Picture: SKY)\n\nThe documentary originally aired on HBO in the States over summer.\n\nSpeaking before the premiere, a spokesperson for HBO said the documentary ‘raises difficult questions about technology, mental health, and whether or not one teenager can be held responsible for the suicide of another. While many believe that Michelle Carter’s texts urging boyfriend Conrad Roy to end this own life are immoral, the film asks: Is it criminal?’\n\nThey went on to add that the filmmakers had ‘unprecedented access to the families, friends, and communities that were forever changed by the Commonwealth vs. Michelle Carter’ and that the story behind the sensationalised headlines to do with the case will have ‘wider implications for society at large, online and in real life.’\n\nAdvertisement\n\nAdvertisement\n\nSky Crime launched on Sky on 1 October and is also available on NOW TV.\n\nMORE: I Love You, Now Die: The importance of unravelling the untold story you thought you knew\n\nMORE: HBO release trailer for documentary I Love You, Now Die about Michelle Carter texting suicide case", "description": "Sky Crime will air the best true crime tales, starting with HBO's 'text-suicide' documentary I Love You, Now Die. Here's how to watch it.", "authors": ["Jack Slater"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/ILoveYouNowDie-a883_1570372812.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-06"}