{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/md-politics/obama-to-speak-at-cummingss-funeral-in-baltimore-on-friday/2019/10/23/834ed058-f600-11e9-a285-882a8e386a96_story.html", "downloaded_at": "2019-10-24 04:51:54.071008+00:00", "title": "Obama, Clintons to speak at Cummings’s funeral in Baltimore on Friday", "language": "en", "text": "“At the request of Mrs. (Maya) Rockeymoore-Cummings, he will deliver remarks about the remarkable life and legacy of one of this country’s finest public servants,” Obama spokeswoman Katie Hill said in a statement late Wednesday.\n\nCummings was an early supporter of Obama’s 2008 presidential campaign, and the congressman had a photo of the pair hanging in his office on Capitol Hill.\n\nAD\n\nIn a statement after Cummings’s death on Oct. 17, Obama praised Cummings for his work as chairman of the House Committee on Oversight and Reform.\n\nAD\n\n“Steely yet compassionate, principled yet open to new perspectives, Chairman Cummings remained steadfast in his pursuit of truth, justice, and reconciliation,” he said. “It’s a tribute to his native Baltimore that one of its own brought such character, tact, and resolve into the halls of power every day. And true to the giants of progress he followed into public service, Chairman Cummings stood tallest and most resolute when our country needed him the most.”\n\nHillary Clinton remembered Cummings as a ‘giant’: “America lost a giant with the passing of Rep. Elijah Cummings, a man of principle who championed truth, justice and kindness,” she wrote on Twitter after his death. “He fiercely loved his country and the people he served. Rest In Peace, my friend.”\n\nCummings’s body will lie in state Thursday in the Capitol, where lawmakers will hold a memorial service before members of the public pay their respects.\n\nAD", "description": "The late congressman was an early supporter of Barack Obama’s 2008 presidential bid.", "authors": ["Jenna Portnoy", "Reporter Covering Virginia", "Maryland", "D.C. Congressional Delegations"], "top_image": "https://www.washingtonpost.com/resizer/Rl0B5syKjk-8kvapM9G_CkCicq4=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LTST4MXQ7AI6TBUT6SD6IZ4EVI.jpg", "published_at": "2019-10-23"}