{"pub": "townhall", "url": "https://townhall.com/tipsheet/katiepavlich/2019/09/18/american-airlines-mechanic-who-sabatoged-a-plane-had-isis-videos-on-his-phone-n2553333", "downloaded_at": "2019-09-18 23:23:20.950972+00:00", "title": "American Airlines Mechanic Who Sabotaged a Miami Plane Had ISIS Videos on His Phone", "language": "en", "text": "The man arrested for sabotaging the navigation system on an American Airlines plane that was scheduled to take off from Florida earlier this year had ISIS propaganda videos on his cellphone. According to prosecutors, Abdul-Majeed Marouf Ahmed Alani has ties to the Islamic terrorist group through his brother in Iraq. The new revelations came during a bail hearing in Miami Wednesday. Alani is a naturalized citizen from Iraq.\n\nFrom the Associated Press:\n\nAn American Airlines mechanic named Abdul-Majeed Marouf Ahmed Alani accused of disabling a navigation system on a flight from Miami was denied bond today after ISIS videos showing graphic murders were discovered on his cellphone - AP — Breaking911 (@Breaking911) September 18, 2019\n\nA federal judge cited new evidence of potential terrorism sympathies in denying bail for a mechanic charged with sabotaging an American Airlines jetliner.\n\n\n\nU.S. Magistrate Judge Chris McAliley imposed pretrial detention for 60-year-old Abdul-Majeed Marouf Ahmed Alani at Wednesday’s hearing.\n\n\n\nThe new evidence presented by prosecutors includes that Alani has a brother in Iraq who may be involved with the Islamic State extremist group as well as statements Alani made about wishing harm on non-Muslims.\n\n\n\nAlani is a naturalized U.S. citizen from Iraq. He’s not charged with a terror-related crime.\n\n\n\nAlani is charged with sabotaging a Boeing 737 with 150 people aboard at Miami International Airport because ongoing labor negotiations were jeopardizing his chances at earning overtime.\n\nAlani claimed he sabotaged the plane in order to get mechanic overtime pay. Luckily the issue was noticed by pilots before taking off and nobody was hurt. Alani was caught on surveillance video and he conducted the sabotage for seven minutes.\n\nIn recent months, half-a-dozen foreign born naturalized citizens and refugees have been arrested, indicted or sentenced for planning to carry out ISIS attacks in the United States.\n\nEarlier this month, the Department of Justice indicted a 43-year-old man from Pakistan after he traveled to Syria, trained with ISIS as a sniper and weapons expert, and came back to the United States.\n\nThe Department of Justice announced a five-count indictment against 43-year-old Suleiman Al-Amrik for \"conspiracy to provide material support to ISIS; providing material support to ISIS in the form of personnel, training, expert advice and assistance and weapons; receipt of military-type training from ISIS; and obstruction of justice.\" The combined charges carry a lifetime sentence in federal prison.\n\n\n\nAmrik immigrated to the United States from Kazakhstan and is a naturalized citizen. He traveled to Syria, joined and fought with ISIS as a sniper and then came back to the U.S.\n\n\n\n\"As detailed in court filings, Asainov is a naturalized U.S. citizen born in Kazakhstan, who resided in Brooklyn. As alleged, in December 2013, Asainov traveled on a one-way ticket to Istanbul, Turkey, a common transit point to obtain entry into Syria. He subsequently entered Syria, joined ISIS and became a sniper for the terrorist organization. Over time, Asainov rose through the ranks to become an ISIS 'emir' in charge of training other ISIS members in the use of weapons. He also attempted to recruit another individual to travel from the United States to Syria to fight for ISIS,\" DOJ released.\n\n\n\n\n\nIn Tucson, Somali refugees were hitting the gym to become stronger for beheadings on behalf of ISIS.", "description": ".09/18/2019 19:19:05PM EST.", "authors": ["Katie Pavlich", "Matt Vespa", "Guy Benson", "Cortney O'Brien"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/268/11361043-8238-45ff-afdc-829c90a58619.jpg", "published_at": "2019-09-18"}