{"pub": "indiatimes", "url": "https://indiatimes.com/entertainment/hollywood/gwyneth-paltrow-hasn-t-seen-many-marvel-films-because-there-re-so-many-of-them-it-s-confusing-377714.html", "downloaded_at": "2019-10-13 08:46:39.026996+00:00", "title": "Gwyneth Paltrow Hasn’t Seen Many Marvel Films Because There're So Many Of Them & It’s Confusing", "language": "en", "text": "Gwyneth Paltrow Hasn’t Seen Many Marvel Films Because There're So Many Of Them & It’s Confusing\n\nGwyneth Paltrow Hasn’t Seen Many Marvel Films Because There're So Many Of Them & It’s Confusing\n\nIt’s kind of strange to hear that a Marvel actress hasn’t watched many Marvel movies. Gwyneth Paltrow, who plays the role of Pepper Potts, cannot keep a track of the Marvel movie she has featured in.\n\nWhat’s her excuse? She says it’s confusing because there are so many of them.\n\nRemember earlier this year how she had almost forgot she was a part of Spider-Man: Homecoming? And how Jimmy Kimmel poked fun at her? Watch it in the video below.\n\nWhen the 51-year-old host asked if her co-star Holland was angry upon finding out that she had forgotten the movie, Paltrow said that she had not watched the film. \"I never actually saw the movie,\" she admitted, before immediately regretting her words. \"I mean, wait! Cut that out, take that back!\"\n\nAlso, Marvel Studios boss Kevin Feige had revealed that she had no clue that Samuel L Jackson was a part of Marvel Cinematic Universe. By the way, she has starred in five films along with him.\n\nTwitter\n\nDon't Miss 325 SHARES 184 SHARES 155 SHARES\n\nFinally spilling the beans, she told Elle Magazine recently, “It is confusing because there are so many Marvel movies. To be honest, I haven't seen very many of them. It's really stupid and I'm sorry, but I'm a 47-year-old mother,” she said.\n\nTwitter\n\nMeanwhile, she has no idea that her forgetfulness has become a joke on social media. On work front, Gwyneth Paltrow can be seen in Netflix series The Politician.", "description": "It’s kind of strange to hear that a Marvel actress hasn’t watched many Marvel movies. Gwyneth Paltrow, who plays the role of Pepper Potts, cannot keep a track of the Marvel movie she has featured in. What’s her excuse? She says there are so many of them and it’s confusing.", "authors": ["Garima Satija"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/gwyneth_paltrow_hasnt_seen_many_marvel_films_because_therere_so_many_of_them__its_confusing_1570951183_800x420.jpg", "published_at": "2019-10-13"}