{"pub": "foxnews", "url": "https://foxbusiness.com/money/dave-ramsey-seven-steps-to-living-the-life-of-your-dreams", "downloaded_at": "2019-10-02 12:49:26.002768+00:00", "published_at": "2019-10-02", "title": "Dave Ramsey: Seven steps to living the life of your dreams", "language": "en", "text": "For more than 20 years, I’ve had the honor of helping millions of families take control of their money and stop drowning in debt. It’s been awesome to see so many people change their lives!\n\nContinue Reading Below\n\nEarly on, however, I noticed a pattern with the people I was counseling and the callers on my radio show. The thought of getting out of debt was overwhelming to them. The pile of debt in front of them seemed too big, and they didn’t know how to start.\n\nThat’s why I created the Baby Steps. These seven money markers are designed to get you out of debt and show you how to build the kind of wealth you always dreamed of. But taking control of your money doesn’t happen overnight. The Baby Steps are based on the idea that you can accomplish anything if you take it one step at a time.\n\nBaby Step 1: Save $1,000 in a Beginner Emergency Fund\n\nLife happens. Transmissions blow and dryers burn out. An emergency fund takes care of these not-so-happy surprises. Don’t be one of the 60 percent of Americans who can’t cover unexpected expenses. Having $1,000 set aside just for emergencies puts a little buffer between you and the “Check Engine” light on your dashboard.\n\nStep 2: Pay Off All Debt with the Debt Snowball\n\nList all your debts except your house from smallest to largest by balance. Make minimum payments on all of them except the smallest one, and attack that one with a vengeance! Put every dollar you can get your hands on toward that smallest debt and get it out of your life for good!\n\nOnce the first one is out of the way, take that money and add it to the next debt on the list. Keep going all the way down the list, one debt at a time. Every time you pay off one debt, you have more money to throw at the next one.\n\nThat’s what we call it the Debt Snowball: As the snowball rolls over, it picks up more snow. By the time you get near the bottom of your debt list, it starts to look like an avalanche! You’ll be debt-free faster than you ever thought possible!\n\nStep 3: Build a Fully Funded Emergency Fund of 3–6 Months Expenses\n\nOnce you’re out of debt except for your house, go back to that little emergency fund and beef it up to a full 3–6 months of expenses. At that point, you have no debts other than the mortgage, and you have $10,000–15,000 in the bank just for emergencies. Life starts to feel a little different here, doesn’t it?\n\nStep 4: Invest 15 Percent of Household Income Into Retirement\n\nWith no debt and a big emergency fund, you’ve finally freed up your greatest wealth-building tool: your income. So now it’s time to focus on your retirement dream. Once you hit Baby Step 4, I want you to start investing 15 percent of your income into your 401(k) and Roth IRA.\n\nStep 5: College Funding for Children\n\nAfter you’ve gotten your retirement fund going strong, it’s time to think about college for the kiddos. I recommend the Education Savings Account (ESA). Most families can save up to $2,000 a year in an ESA. If you want to do more, you can also check out a 529, but only choose a 529 that leaves you in control of your investments.\n\nStep 6: Pay Off Your House\n\nNow it’s time to reach for the golden ring. Keep going! Don’t stop now! How cool would it be if you actually owned your home instead of the bank? Then do it! Put every extra dollar in the budget toward paying off the mortgage early.\n\nStep 7: Build Wealth and Give\n\nBaby Step 7 is my absolute favorite because it’s the most fun. With zero debt and a big emergency fund, you can now build wealth, give like crazy to good causes, and leave an incredible legacy for your family. This is the goal!\n\nIf there’s one thing I’ve learned from working with millions of families, it’s this: Your situation isn’t hopeless. With a lot of hard work and determination, anyone can get out of debt and build wealth. Because when you live like no one else, you can truly live and give like no one else.\n\nCLICK HERE TO GET MORE FOX BUSINESS", "description": "Here are seven money markers that are designed to get you out of debt and show you how to build the kind of wealth you always dreamed of.", "authors": ["Dave Ramsey"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/Dave-Ramsey-headshot-001.jpg?ve=1&tl=1"}