{"pub": "realclearpolitics", "url": "https://amgreatness.com/2019/10/13/the-strategies-of-targeting-trump", "downloaded_at": "2019-10-16 05:10:15.790158+00:00", "title": "The Strategies of Targeting Trump", "language": "en", "text": "There is no logical Democratic explanation for impeaching Donald Trump. The various factions within the Democratic Party calling for impeachment are united only by their loathing of Donald Trump, the person, and his systematic repeal of the Obama progressive project.\n\nAfter failing with the voting machine gambit, the Logan Act, the 25th Amendment, the emoluments clause, the McCabe-Rosenstein faux-coup, the Comey memos farce, the “resistance” efforts outlined by the New York Times anonymous op-ed writer, the campaign finance violations accusations, Stormy, tax returns, whistleblowers, leakers, the Mueller 22 months charade, and now impeachment 2.0, what exactly is the point of impeaching Trump just 13 months before the election?\n\nHere are the various rationales behind Trump’s Democratic and leftwing opponents’ latest “whistleblower” hoax. None of these scenarios are mutually exclusive.\n\nThe Primal Scream?\n\nThere doesn’t have to be a point to impeachment. Democrats loathe Trump. That is enough. They would have impeached him on day one of his presidency before he set foot in the White House but they did not have control of the House. Now they do, so they can. Who cares whether he is convicted in the Senate? House members just want to go on record that they impeached him and put an asterisk on his presidency at worst, and at best drive his polls down to prevent his reelection.\n\nThe only hesitation after January 2018 when they took over the House was the completion of the Mueller investigation that seemed a certain road to impeachment. When that failed, it took just a few weeks to recoup, get their spirits back up, and resort to the prearranged fallback whistleblower tact. Now they are back on track.\n\nWhy delay when you have a majority in the House? And why explain anything, when Democrats all hate Trump anyway? The point, in MSNBC/CNN style, is to vent, to rage, to scream without needing a strategy at all. Blind furor at this late date is okay. Who cares about polls, pundits, and conventional wisdom, given the exhilaration of just impeaching the SOB?\n\nJust an Impeachment “Inquiry”?\n\nThe impeachment “Inquiry” can do as much damage as a formal vote without the downside of endangering Democrats in purple congressional districts, at least for a while. The aim is to create slow-motion, sustained hysteria, throw out leaks, whistleblowers’ accusations, transcripts, emails, hearsay, and what not, and see what sticks—without House members going on record until there is enough chaos created to ensure positive polls.\n\nThe blueprint is the psychodrama of the Kavanaugh circus that tanked Kavanaugh’s popularity and weakened Trump. The Intelligence Committee, as is Rep. Adam Schiff’s (D.-Calif.) forte, can leak selectively, never release full transcripts, call in anonymous witnesses, and now and then use redactions and immunities.\n\nThe Democrats can wheel Schiff out daily to his media platform to grimace, and in pained expressions suggest that the flabbergasting things he just heard, read, and saw behind closed doors are bombshells, turning points, nails-in-the-coffin, walls-are-closing-in disasters for Trump that he unfortunately cannot divulge in full detail, given the classified nature of his proceedings. If Schiff gets the required poll numbers, the House can vote to proceed.\n\nWhat’s the Better Alternative?\n\nWho says the Democrats ever have to vote on going ahead with impeachment or even hold very many hearings? The point is just to drag everything out under the vague premise that some sort of de facto “impeachment is impending” in sword of Damocles fashion.\n\nThreaten, cajole, wink, and nod—but do nothing of substance is the strategy. It may seem a silly trajectory, but what are the alternatives in a 3.5 percent unemployment economy—and possible “bombshells” coming from prosecutors William Barr, John Durham, or Michael Horowitz?\n\nWould Democrats prefer to introduce in the House legislation to enact the Green New Deal? The wealth tax? Reparations? Health care for illegal aliens? Open borders? Abolish $1.6 trillion in student debt? Or sit back and see whether Andrew McCabe, James Comey, or James Clapper might get indicted in a month or so?\n\nCompared to those alternatives, daily venting and screaming without doing anything at all about the ogre Trump under the guise of exhaustively pondering impeachment inquiries, impeachment voting, impeachment hearings, and impeachment verdicts seem smart.\n\nThe aim, again, is not to offer an alternative agenda to Trump’s issues that for the most part poll far higher than what we have seen on the Democratic candidate debate stage. Trump, the man, is the only issue and thus all that is needed after the Mueller implosion is the proper excuse to smear and slander him again. Impeachment is just a construct to amplify the daily invective.\n\nStigma, Stigma, Stigma?\n\nThe Democrats think they have learned from the long, drawn-out Mueller soap opera, that now speeding, not meandering, is the real key to destroying Trump. One does not wound a king and expect victory. In Trump’s case whatever does not destroy him, makes him stronger. So, the point of this strategy is to fast-track a vote to impeach as soon as possible, preferably in 6 weeks before the Thanksgiving recess, warp the rules of custom and tradition regarding impeachment, and just ram it through. Once Trump is impeached, no one will care whether it was by hook or crook. Instead, all that matters will be that Trump was IMPEACHED! and what is left of his stigmatized presidency won’t be much.\n\nThe Andrew Johnson Route?\n\nTrue, after the House impeachment, the Democrats are never going to get a two-third conviction vote of the Senate, as required by the Constitution, to depose Trump.\n\nSo what is the point of the entire charade? A lot. And given that who really needs a two-thirds, legalistic vote?\n\nAll the Democrats require is to get a 51 percent majority vote for their post-constitutional notion of conviction—a tremendous moral and propaganda victory! They merely need to flip 3-4 RINO Republican Senators, perhaps a Ben Sasse (R.-Neb.), Mitt Romney (R.-Utah) or Lisa Murkowski (R.-Alaska). Once there are 51 votes to convict, the Democrats can boast they won clear majorities in both Houses to remove Trump from office. After all, simple up or down Senate votes are now all it takes to confirm or reject federal justices. Why should only a quirk of an archaic, ossified Constitution, in the manner of its anti-democratic Electoral College, have kept Trump from the righteous retribution of the people?\n\nOnce Trump is quickly impeached, and then a majority in the Senate votes to remove him from office, he’s toast anyway in 2020. No president since Andrew Johnson has ever been both impeached and had a Senate majority vote to convict him. Given the sordid ordeal, like Johnson, Trump supposedly will be a walking dead president all of 2020.\n\nSuccess?\n\nDemocrats know they can impeach Trump. And they believe they can easily peel off at least a few Republican votes in the Senate to join them. Yet once the circus is on, who knows what will turn up—the impeachment equivalent of a Christine Blasey Ford, a hot-rodder like Michael Avenatti, victims like Nathan Philipps, or Jussie Smollett?\n\nDon’t laugh, such theatrics will air all sorts of anti-Trump professional hysterias as a parade of witnesses from Stormy Daniels, to tax lawyers, to psychiatrists, to Anthony Scaramucci/Omarosa performance artists, to legal talking heads like Jeffery Toobin, to wizened “sages” such as Colin Powell and Andrew Card can all be wheeled in to provide both low farce and sanctimonious establishment pieties.\n\nUnder such pressures, who knows exactly how long 14 Senators can hold out? Sinking poll averages each day can presage bleak 2020 scenarios and stampede up-for-reelection senators. Maybe the depressive spectacle can help tank the economy and bring back Recession! Recession! Recession!\n\nRemember 1974 and the Republican hit in the November elections that followed the resignation of Nixon. Fundraising can dry up. Democrats don’t count out a two-thirds-conviction tally, until the votes are cast. The Republicans thought they had a slam dunk confirmation of Kavanaugh, and by the time the freak show was over, the majority party for a time was scared stiff that he’d go the way of Robert Bork.\n\nTrump Caput?\n\nPut so much political and media pressure on Trump that after three years of these serial assaults, and even the animal energy of Trump could fade. Consider all the smears as taps on an eggshell that leave only invisible fissures until the final hit—impeachment—explodes the supposedly invulnerable shell to pieces.\n\nLook what the campaign trail finally did to the similarly septuagenarian Bernie—slimmer and traditionally more careful about weight and exercise than is Trump. So, the aim is to ramp up the pressure, threaten impeachment, and so tax and endanger Trump that he goes the full Nixon pneumonia/phlebitis route and physically either collapses, goes into a coma, or just up and quits. Impeachment is just a pretext for physically and mentally destroying the person of the president of the United States.\n\nSane observers see impeachment as a travesty without either moral or legal grounds to justify removing an elected president 13 months before the 2020 election. But sanity means nothing these days, given the hatred of Trump, the volatility of the electorate, and the furious bias of the media.\n\nAfter all, we are planning to impeach a president on the basis of a “whistleblower” who will not come forward, who is a Democratic partisan, who worked for a current Democratic presidential candidate, who contrary to the whistleblower statutes went first to the Democratic Chairman of what is now the impeachment inquiry committee, Adam Schiff, also chair of the Intelligence Committee, and whose formal complaint was prepped by Democrat-affiliated lawyers. The whistleblower claims second-hand knowledge from leaking White House Staffers who heard a confidential Trump conversation—a conversation whose transcript was immediately released and was at odds in key places with the whistleblower’s second- and third-hand versions.\n\nWe are headed for a train wreck. No one knows for certain which outcome is most likely. Will Trump be so beaten down by the ordeal that he will say and do things that will add to the momentum to convict him? Will there be such chaos and disruption that Trump “fatigue” will ensue, and he and those who support him will be blamed for the mess? Will the voter go into a fetal position and just scream, “I can’t take this anymore! Make it all just go away!”?\n\nOr more likely will impeachment backfire? Will the jump-the-shark travesty finally confirm that the last three years have been an unhinged, evidence-free Democratic effort to destroy the elected president? Will there be hell to pay for the Democrats for their bias and partisanship that took the country through yet another miasma? They may well earn a Trump landslide and 2020 losses in the Senate and House.\n\nOr will impeachment be instead a big nothing?\n\nAmericans are tired of the histrionics of these nonstop beltway melodramas. Impeachment won’t turn off or win over that many voters. Most Democrats will vote against Trump; most Republicans vote for him. And as always, the swing voters, party moderates, and independents will decide the day, mostly on their perceptions of either economic good times or an unforeseen 2020 recession—or what comes from Michael Horowitz, John Durham, John Huber, and Bill Barr. It is not impeachment, stupid!", "description": "", "authors": [], "top_image": "https://amgreatness.com/wp-content/uploads/2019/10/GettyImages-1164511707.jpg", "published_at": "2019-10-13"}