{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Living/couple-paid-off-120k-debt-years/story?id=66068642", "downloaded_at": "2019-10-04 23:58:14.966684+00:00", "title": "How one couple paid off $120K debt in under 3 years", "language": "en", "text": "A Detroit couple, who paid off their combined $120,000 student loan debt in just two and a half years, sat down with \"Good Morning America\" to share their secrets to financial success.\n\nQuenton and Marchelle Ross said they didn’t want their student loan debt to be a lifetime burden, so they came up with a plan to attack it head on.\n\nThe biggest thing they did was cut back on wasteful spending, Quenton told the hosts.\n\n\"So the going out to eat, the buying unnecessary groceries, the buying hypothetical outfits, the shoes that I may wear one day,\" he said. \"We were intentional about, for the short term, sacrifice time.\"\n\nTo ultimately tackle the debt, the couple adopted what’s called the \"snowball method\" -- where they paid off their smallest debt first, then eventually snowballed into taking care of larger payments.\n\n\"The snowball method often works best psychologically because you pay down the smallest debts first and it feels like a win,\" ABC News’ Chief Business and Economics correspondent Rebecca Jarvis said. \"It’s important to remember that you also need to make minimum payments on larger debts too so you don’t rack up additional fees.\"\n\nCombined, the couple brings in $150,000 annually from their jobs. Each pay period, the Ross' made sure they took care of the necessities first, such as their mortgage, food and utilities. Next they made a payment to their student loan provider, putting a dent in their overall debt.\n\nWith the leftover money, the couple restricted their budget, right down to every cent spent on groceries.\n\n\"Marchelle started only buying maybe two or four days instead of buying two weeks worth of groceries,\" Quenton said.\n\nTo help with the effort, Quenton also put in extra time at work. Some weeks he worked around 75 hours to ensure that the debt would be paid off.\n\nAfter nearly three years of budgeting and hard work, their student loan debt became a thing of the past.\n\n\"When we made the last payment, it’s a feeling you can’t describe,\" Quenton said. \"When we got that last knockout punch, it was just like the [Muhammad] Ali moment, where you really feel like you were the champions over that situation.\"\n\nThere are several different strategies for tackling debt. To find the best one for you, Jarvis suggested downloading budget apps on your smartphone, such as Debt Payoff Planner or Debt Manager.\n\n\"Both of these apps allow you to create a step-by-step plan for paying off your debt,\" Jarvis said. \"The plan includes the exact amount that you need to pay on every debt each month to help you stay on schedule plus they’re going to show you when you’ll be completely debt free, what you owe, how must interest you’ll have to pay and over how many payments.\"", "description": "Quenton and Marchelle Ross told Good Morning America their student loan debt couldn't be a lifetime burden, so they came up with a plan to attack it head on.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/191004_gma_debt2_hpMain_16x9_992.jpg", "published_at": "2019-10-04"}