{"pub": "cbc", "url": "https://cbc.ca/news/canada/british-columbia/north-shore-rescue-abandoned-hiker-1.5303849", "downloaded_at": "2019-10-02 00:33:28.506206+00:00", "title": "'Don't abandon someone': North Shore Rescue calls out group for leaving hiker alone | CBC News", "language": "en", "text": "North Shore Rescue is warning hikers not to split up on the trails after a woman was found alone and injured over the weekend.\n\nAccording to team leader Mike Danks, a group of hikers was returning from Coliseum Mountain on the North Shore Sunday when the woman fell behind.\n\n\"For whatever reason, they decided to split the group into a faster group and a slower group,\" said Danks.\n\n\"This person was the slowest hiker and so got left behind.\"\n\nDanks says it's not clear whether the woman was injured before or after she became separated from the group, but noted that splitting up is not a good idea in any situation.\n\n\"Stick together as a group,\" Danks urged.\n\n\"If you have someone who is going a little bit slower, then maybe you can support them by taking the weight out of their pack or helping them along the trail.\"\n\nHe described the area where the group was hiking — behind Lynn Headwaters Regional Park — as quite remote.\n\n\"You don't want to abandon someone in an area like that, ever,\" he said.\n\n\"It's just a very poor decision.\"\n\nA passerby came across the injured woman — who had hurt her ankle — and stayed with her until rescuers responded.\n\n\"Luckily, there was someone who came across this lady,\" said Danks.\n\n\"I think it's a wake-up call for everyone.\"\n\nRescuers later came across the hiking group and had a \"long chat\" with them about the dangers of leaving someone alone on the trails, Danks said.", "description": "North Shore Rescue is warning hikers not to split up on the trails after a woman was found alone and injured over the weekend.", "authors": [], "top_image": "https://i.cbc.ca/1.5303850.1569937916!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/north-shore-rescue.jpg", "published_at": "2019-10-01"}