{"pub": "news24", "url": "https://channel24.co.za/The-Juice/News/Local/tyler-perry-honoured-with-star-on-hollywood-walk-of-fame-20191002", "downloaded_at": "2019-10-05 10:34:04.454577+00:00", "title": "Tyler Perry honoured with star on Hollywood walk of fame", "language": "en", "text": "Cape Town - Award winning actor Tyler Perry received a star on the Hollywood Walk of Fame in the category of motion pictures on Tuesday.\n\nHe was joined by some of his industry peers, Idris Elba, Crystal Fox and Kerry Washington and they paid tribute to him ahead of his acceptance speech at the ceremony.\n\n\"For so many of us Tyler, you have been a North Star\", Kerry Washington said during her tribute.\n\nTaking to his Instagram page, Tyler also shared some pictures from the day and add how he felt about finally receiving a star.\n\n\"Ok, let me explain this photo. So I got a star today on the Hollywood Walk of Fame. Thank you chamber!! I’m so grateful, but onto this photo. @only1crystalfox spoke and moved me. @kerrywashington spoke, and we both were in tears. Then @idriselba came up to speak, and they all were so powerful. I was so moved. To look out and see all the cast from all the shows that I have created made my heart so full,\" he wrote.\n\nThe 50-year-old expressed his gratitude to his supporters and how proud his mom would’ve been.\n\n\"To be able to give opportunities to so many was just so humbling to me. Anyway, the photogs were asking for photos so at that moment the BEAUTIFUL KERRY WASHINGTON was leaving, and they all started snapping pictures of her!! Look at my face. We had such a good laugh about this. Thank you everyone for your support and love all these years. My Mamma would be so proud,\" he added.\n\nSEE THE PICS HERE:", "description": "Award winning actor Tyler Perry received a star on the Hollywood Walk of Fame in the category of motion pictures on Tuesday.", "authors": ["Nolusindiso Mgujulwa"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9426/12349af868e64c5991f49b4d29600671.jpg", "published_at": "2019-10-02"}