{"pub": "yahoo", "url": "https://finance.yahoo.com/news/aramco-pushes-ahead-ipo-major-065746312.html", "downloaded_at": "2019-09-16 09:17:02.624281+00:00", "title": "Aramco Pushes Ahead With IPO Work After Major Attacks", "language": "en", "text": "(Bloomberg) -- Bankers hired for Saudi Aramco’s mammoth initial public offering plan to stick to their schedule to pitch the deal to analysts even after devastating attacks on its biggest facilities slashed oil output by half, according to people with knowledge of the matter.\n\nThe energy giant aims to hold analyst presentations as planned and hasn’t told executives that its plans to list on the Saudi stock exchange as early as November may be delayed, the people said, asking not to be identified because the matter is sensitive. Aramco was considering holding presentations the week of Sept. 22, Bloomberg News previously reported.\n\nBut the magnitude of the attacks, claimed by Yemen’s Iran-backed Houthi rebels, make the chances of the IPO happening in the coming months unlikely, according to one of the people. The extent of any delay would depend on how long Aramco takes to restore its full production, another person said. Aramco lost about 5.7 million barrels per day of output.\n\nA spokesman for Saudi Aramco didn’t immediately respond to requests for comment.\n\nSaturday’s strikes, just days after Aramco hired banks including Goldman Sachs Group Inc. and Morgan Stanley, dealt a blow to the company that had been speeding up preparations for the IPO. The attacks on the world’s biggest crude-processing facility and the kingdom’s second-biggest oil field also risk reducing valuation of Aramco, which Crown Prince Mohammed bin Salman has put at over $2 trillion, according to analysts.\n\nMore Attacks\n\n“There’s a 70% plus chance of delay of the Aramco IPO if they want a higher valuation,” said Mohammed Ali Yasin, the chief strategy officer at Al Dhabi Capital in Abu Dhabi. “The cost of risk that investors were factoring in on Aramco prior to this attack completely needs to change going forward.”\n\nHouthi rebels said on Monday that oil installations in Saudi Arabia remain among their targets and that its weapons can reach anywhere in the kingdom.\n\nOil prices surged by the most on record to more than $71 a barrel after the strike removed about 5% of global supplies. Significant volumes could come back within days, people familiar with the matter said over the weekend, adding that it could still take weeks to restore full capacity.\n\nOn Again, Off Again\n\nDozens of bankers from Citigroup Inc. to JPMorgan Chase & Co. descended on the heart of Dubai’s financial district on Thursday for the kickoff meeting at the opulent Ritz Carlton hotel. Representatives from Saudi Arabia’s sovereign wealth fund and finance ministry were also spotted at the five-star property.\n\nAramco picked Bank of America Corp., Citigroup, Credit Suisse Group AG, Goldman Sachs, JPMorgan and Morgan Stanley for top underwriting roles on the deal along with some Middle Eastern banks, Bloomberg News reported last week. Lazard Ltd. and Moelis are also advising Aramco, people with knowledge of the matter have said.\n\nThe on-again-off-again plans for an Aramco listing had been put on hold as the firm focused on a $69 billion deal for a majority stake in petrochemical maker Saudi Basic Industries Corp. When the preparations were revived this year, many of the banks that won roles initially had to start over, leading some to wonder whether it was worth the effort.\n\nThe strikes are “a concern for the IPO,” said Robin Mills, chief executive officer of Dubai-based consultant Qamar Energy. “It will be all but impossible to proceed if there are ongoing attacks.”\n\n(Updates with analyst comments in sixth and last paragraphs.)\n\n--With assistance from Matthew Martin and Mahmoud Habboush.\n\nTo contact the reporters on this story: Dinesh Nair in London at dnair5@bloomberg.net;Archana Narayanan in Dubai at anarayanan16@bloomberg.net\n\nTo contact the editors responsible for this story: Stefania Bianchi at sbianchi10@bloomberg.net, Alaa Shahine\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Bankers hired for Saudi Aramco’s mammoth initial public offering plan to stick to their schedule to pitch the deal to analysts even after devastating attacks on its biggest facilities slashed oil output by half, according to people with knowledge of the matter.The energy giant aims to", "authors": ["Dinesh Nair", "Archana Narayanan"], "top_image": "https://s.yimg.com/os/mit/media/p/common/images/favicon_new-7483e38.svg", "published_at": "2019-09-16"}