{"pub": "afr", "url": "https://afr.com/world/europe/britain-and-eu-agree-eleventh-hour-brexit-deal-20191017-p531st", "downloaded_at": "2019-10-17 10:31:39.538752+00:00", "title": "Boris Johnson, EU strike Brexit deal - now for Britain's parliament", "language": "en", "text": "London | Britain and the European Union have announced a Brexit deal, which could be rubber-stamped by European leaders at a summit in Brussels late on Thursday (AEDT) - but it's not yet clear if British Prime Minister Boris Johnson has the numbers to get it through his parliament.\n\n\"We’ve got a great new deal that takes back control — now Parliament should get Brexit done on Saturday so we can move on to other priorities like the cost of living, the NHS, violent crime and our environment,\" Mr Johnson said on Twitter.\n\nThe EU also hailed the agremeent: “Where there is a will there is a deal – we have one. It’s a fair and balanced agreement for the EU and the UK and it is testament to our commitment to find solutions. I recommend that [the European Council] endorses this deal,” said European Commission President Jean-Claude Juncker.\n\nSterling has jumped more than 1¢ against the US dollar. But there's still a big challenge: getting a majority of MPs in Britain's hung parliament to back the deal.\n\nDespite being more than 40 MPs short of a majority, Mr Johnson appears to be betting he can get to 320 votes without the backing of the 10 legislators from Northern Ireland's Democratic Unionist Party (DUP).\n\nThey issued a statement earlier on Thursday that they didn't back the deal \"as things stand\". After Mr Johnson announced the deal, the party said its statement \"still stands\".", "description": "After years of torturous negotiations, Britain and the European Union have finally agreed to a Brexit deal.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.3445%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_96/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/eb1c15ba44c084e38ea3c3bbee3d446a0851c019", "published_at": "2019-10-17"}