{"pub": "usatoday", "url": "https://usatoday.com/story/money/2019/10/07/walgreens-kroger-ecigarette-sales-vaping/3902875002", "downloaded_at": "2019-10-07 23:35:11.938245+00:00", "title": "E-cigarette sales discontinued at Walgreens, Kroger as crisis continues", "language": "en", "text": "CLOSE It can take six tries for a child to quit vaping. Here are three key signs your kid might be vaping. USA TODAY\n\nWalgreens and Kroger said Monday that they would stop selling e-cigarettes.\n\nThe move makes them the latest national retailers to get out of the vaping business amid health concerns and growing regulatory scrutiny.\n\nWalgreens, the nation's largest drugstore chain by total locations, will stop selling e-cigarettes permanently, spokesman Phil Caruso said in an email.\n\n\"This decision is also reflective of developing regulations in a growing number of states and municipalities,\" Walgreens said in a statement.\n\nCaruso said Walgreens had not determined a timeline for the phaseout, but \"we plan to exit in an orderly manner.\"\n\nThe company's archrival, CVS Pharmacy, has never sold e-cigarettes, CVS Health CEO Larry Merlo told USA TODAY in August.\n\nVaping crisis: Walmart says it will stop selling e-cigarettes\n\nRegulatory scrutiny: FTC orders Juul, R.J. Reynolds, other vaping companies to provide documents\n\nMore than 1,000 lung illnesses have been linked with vaping, with many connected to black-market marijuana products, according to the CDC. (Photo: Eva Hambach/AFP via Getty Images)\n\nKroger said it \"is discontinuing the sale of electronic nicotine delivery products, or e-cigarettes, at all store and fuel center locations due to the mounting questions and increasingly-complex regulatory environment associated with these products.\"\n\nThe nation's largest retailer, Walmart, announced plans last month to discontinue sales of e-cigarettes.\n\nThe federal government is considering increased regulatory requirements and a ban on vaping flavors.\n\nAt least 1,080 people have had lung illnesses and 18 people have died in connection with mysterious illnesses possibly linked with vaping certain black market marijuana products, according to the Centers for Disease Control and Prevention.\n\nFollow USA TODAY reporter Nathan Bomey on Twitter @NathanBomey.\n\nRead or Share this story: https://www.usatoday.com/story/money/2019/10/07/walgreens-kroger-ecigarette-sales-vaping/3902875002/", "description": "Walgreens and Kroger said Monday that they would stop selling e-cigarettes, becoming the latest retailers to get out of the vaping business.", "authors": ["Nathan Bomey", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/03/USAT/46029f4e-e2d8-406c-aab6-c7a08a1b6971-AFP_AFP_1L05KK.JPG?crop=4956,2788,x0,y385&width=3200&height=1680&fit=bounds", "published_at": "2019-10-07"}