{"pub": "businessinsider", "url": "https://businessinsider.com/protests-over-russian-local-election-make-kremlin-nervous-2019-9", "downloaded_at": "2019-09-07 14:42:31.509383+00:00", "title": "Protests over Russian local election make Kremlin nervous", "language": "en", "text": "FILE - In this Saturday, Aug. 17, 2019 file photo, Police detain an activist during a protest in the center of Moscow, Russia, . People rallied Saturday against the exclusion of some city council candidates from Moscow's upcoming election. A seemingly second-tier local election has evolved into a major challenge to Russia’s President Vladimir Putin, triggering the biggest protests against his rule in seven years and causing divisions among his top lieutenants. (AP Photo/File) Associated Press\n\nMOSCOW (AP) — A seemingly second-tier local election has evolved into a major challenge to Russian President Vladimir Putin, triggering the biggest protests against his rule in seven years and causing divisions among his top lieutenants.\n\nAlthough the protests were sparked by the exclusion of some opposition and independent candidates from the ballot for the Moscow city council election to be held Sunday, they also reflect growing discontent after Putin's nearly two decades in power.\n\nThe protests come amid public irritation over the Kremlin's decision to raise the retirement age and other unpopular moves by the government. The economy, burdened by several waves of Western sanctions, has barely climbed out of recession and remains anemic, spawning frustration over stagnant living standards.\n\n\"The government can't offer any vision of the future, any positive agenda,\" said Tatiana Stanovaya of the Carnegie Moscow Center. \"The authorities treat the public with contempt, and a rift between the government and society is widening.\"\n\nA series of rallies — some sanctioned by city officials, some unauthorized — attracted crowds of up to 60,000 at a time, making them the largest show of discontent since massive demonstrations in Moscow against Putin's rule in 2011-2012.\n\nPolice violently cracked down on some of the protests that weren't sanctioned, beating many and detaining a total of more than 2,400 people. Most detainees were quickly released, but 14 people were accused of involvement in riots; four have been convicted and sentenced to up to four years, while charges against five others were dropped.\n\nPutin's most visible foe, anti-corruption campaigner Alexei Navalny, and a few opposition candidates were put in jail for weeks for calling for unsanctioned protests.\n\nPutin backed the crackdown, saying the government doesn't want to see violence similar to the yellow vest protests in Paris. He charged that election officials barred the opposition candidates from the race because they produced falsified signatures to qualify, which the opposition denies.\n\nIn an echo of the 2011-12 protests, authorities again blame the West for encouraging the protests. The lower house of parliament set up a panel to look into alleged foreign meddling.\n\nThe quick and brutal response contrasted with the authorities' treatment of the 2011-2012 protests, when they let demonstrations continue for months and even made some concessions to the opposition, including a few liberal changes in the electoral law.\n\nA crackdown came when a demonstration on the eve of Putin's inauguration for another term ended in violence. The Kremlin responded with a package of laws that introduced heavy fines and prison terms for taking part in unsanctioned protests and tightened rules for non-government organizations.\n\nThis time, authorities didn't linger and a crackdown came swiftly, reflecting the Kremlin's view of the protests as a clear threat despite their local focus.\n\n\"The government saw it as a direct challenge,\" said Alexei Makarkin, a political expert with Moscow's HSE University. He noted, however, that the excessive use of force by police has drawn criticism from some members of Putin's inner circle.\n\n\"For many in the ruling elite, it was clearly over the top,\" Makarkin said. \"They see those events as a signal that the party relying on force has gained excessive clout, and they don't want it.\"\n\nA longtime associate of Putin, Alexei Kudrin, a former finance minister who now heads the Accounting Chamber, the state audit agency, condemned \"the unprecedented use of force\" by police and demanded a public investigation.\n\nAnd Sergei Chemezov, the head of the state-controlled Russian Technologies corporation, who has been close to Putin since they both were Soviet KGB officers posted to Dresden, East Germany, warned that the country needs an opposition to avoid plunging into stagnation. \"People are angry, and it's not in anyone's interests,\" Chemezov said in a recent interview.\n\nMembers of Putin's human rights council also strongly criticized the brutal police tactics and the criminal charges brought against some of the protesters, describing them as unfounded.\n\nThe protests have dealt a blow to the powerful mayor of Moscow, Sergei Sobyanin, who has been widely seen as one of several potential candidates to succeed Putin. Observers say that other powerful members of Putin's inner circle were jealous of Sobyanin's clout and eager to cast the protests as a sign of the mayor's failure to maintain control over the capital.\n\n\"There is a deep rift between the liberal-minded, pro-modernization part of the ruling elite and the conservative and isolationist part that wants to tighten the screws and confront the West and peddles allegations of foreign interference to justify the crackdown on protest,\" Stanovaya said.\n\nLast weekend, the authorities abruptly changed course, allowing protesters to march across central Moscow unimpeded even though the demonstration wasn't authorized. In a sudden show of clemency, the courts also dropped charges against some of those who were accused of involvement in riots and moved a couple of others from jail under house arrest.\n\nThe about-face appeared to reflect divisions at the top.\n\nThere is no immediate sign that protests could spread to other regions and pose a threat to Putin's rule.\n\nStanovaya said that the brewing discontent in the provinces has been driven by social and environmental issues and hasn't yet focused on Putin. She predicted that political protests will gradually grow across Russia, adding that a violent response by the authorities would only fuel anger and foment more protests.\n\n\"It all depends on how stupid the authorities are,\" she said. \"In Moscow, the authorities' action led to the escalation of the crisis. The government's disproportionate response to the opposition actions has radicalized the situation and caused the conflict to expand.\"\n\nMakarkin said the latest wave of protests in the capital have been driven mostly by politically astute students and members of the middle class, while people in the provinces mostly focus on daily survival and are less interested in politics. He said that protests' future will depend on whether their leaders could offer a platform that would appeal to people in the regions.\n\n\"If they formulate an attractive nationwide agenda and spread it, the government may run into serious problems,\" he said.", "description": "MOSCOW (AP) — A seemingly second-tier local election has evolved into a major challenge to Russian President Vladimir Putin, triggering the biggest protests against his rule in seven years and causing divisions among his top lieutenants.", "authors": ["Vladimir Isachenkov", "Associated Press"], "top_image": "https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png", "published_at": "2019-09-07"}