{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/17/mollie-tibbetts-murder-trial-taxpayers-billed-18k-for-illegal-aliens-expert-witnesses", "downloaded_at": "2019-10-18 01:10:01.287244+00:00", "title": "Mollie Tibbetts Trial: Taxpayers Billed $18K for Illegal's Expert Witnesses", "language": "en", "text": "Iowan taxpayers are being billed about $18,000 to provide a series of expert witnesses to help an illegal alien avoid conviction after charges that he murdered 20-year-old Mollie Tibbetts.\n\nIn August 2018, Cristhian Bahena Rivera, a 25-year-old illegal alien from Mexico, was charged with Mollie Tibbetts’ murder after police said he admitted to confronting and chasing down the young woman.\n\nFollowing a nationwide search, Tibbetts’ body was found in a cornfield in Poweshiek County, Iowa. The illegal alien lived in a region of Iowa that was surrounded by sanctuary cities, as Breitbart News noted, and worked on a dairy farm using a stolen ID and Social Security card after allegedly crossing the U.S.-Mexico border as a child.\n\nThis week, Bahena Rivera’s attorneys, Chad and Jennifer Frese, asked the court to approve three expert witnesses to help in their defense: A Spanish-language interpreter, a forensic DNA expert, and an expert on sleep deprivation.\n\nThus far, Iowan taxpayers have been billed nearly $12,500 to provide the interpreter for Bahena Rivera, while the sleep deprivation expert is costing about $2,500, and the DNA expert is costing about $3,000, according to initial stipends reported by the Des Moines Register.\n\nNext week, Bahena Rivera’s attorneys will argue in court that the illegal alien’s alleged murder confession be thrown out, claiming that his constitutional rights were violated when he was interrogated by law enforcement. For months, the defense has argued this and has successfully gotten the trial delayed to February 2020.\n\nAnother win for Cristhian Bahena Rivera ahead of trial. https://t.co/z42eXhOvCi — John Binder 👽 (@JxhnBinder) October 13, 2019\n\nAs Breitbart News has chronicled, Bahena Rivera has been able to win a series of battles in the court system, getting at least $22,000 worth of taxpayer-funded services including his full-time translator, consistently securing trial delays, and having his trial moved after he claimed that the county where the trial was set to be heard had a population that was too white and not Hispanic enough.\n\nAccording to prosecutors, Bahena Rivera was the last person who saw Tibbetts jogging on the evening of July 18 in Brooklyn, Iowa. That is the night Tibbetts went missing.\n\nBahena Rivera, according to police, said Tibbetts was jogging when he saw her. That is when he said he approached Tibbetts and started talking to her. After Tibbetts told Bahena Rivera that she would call the police if he did not stop following her, the illegal alien allegedly chased her and says he “blacked out” after this.\n\nPolice believe Bahena Rivera stabbed Tibbetts to death, then drove to a cornfield where prosecutors say he placed cornstalks over her to hide her body. The illegal alien has been held on a $5 million bond.\n\nJohn Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.", "description": "Taxpayers are being billed about $18,000 to provide expert witnesses to help an illegal alien charged with murdering Mollie Tibbetts.", "authors": ["John Binder"], "top_image": "https://media.breitbart.com/media/2019/03/Mollie-Bahena-Rivera-640x335.jpg", "published_at": "2019-10-17"}