{"pub": "yahoo", "url": "https://sports.yahoo.com/mlb-team-roundup-cleveland-indians-235455134.html", "downloaded_at": "2019-10-29 02:26:31.304277+00:00", "title": "MLB Team Roundup: Cleveland Indians", "language": "en", "text": "Follow @Rotoworld_BB and @drewsilv on Twitter.\n\n2019 Record: 93-69\n\nSecond Place, AL Central\n\nTeam ERA: 3.76 (4th in MLB)\n\nTeam OPS: .756 (15th in MLB)\n\nScroll to continue with content Ad\n\nWhat Went Right\n\nThe Indians won 93 regular-season games and remained in the hunt for a spot in the playoffs until the final weekend of September. Shane Bieber excelled in his first full major league campaign, delivering 3.28 ERA, 1.05 WHIP, and 259/40 K/BB ratio across 214 1/3 innings. He was named to the American League All-Star team and finished tied for the MLB lead in both complete games (three) and shutouts (two). Francisco Lindor missed the first four weeks of the season due to calf and ankle injuries, but he returned on April 20 and remained healthy the rest of the way while posting a .284/.335/.518 batting line with 32 home runs, 74 RBI, 22 stolen bases, and 101 runs scored in 143 games played. Carlos Santana returned to Cleveland after a somewhat underwhelming 2018 showing in Philadelphia and put up a career-best .911 OPS with 34 home runs and 93 RBI in 158 games at age 33. Oscar Mercado debuted in mid-May and established himself as the Indians’ long-term answer in center field while tallying 15 home runs and 15 stolen bases over his first 115 big league games. Jordan Luplow provided a spark in a platoon role with a .320/.439/.742 batting line in 155 plate appearances against left-handed pitching and a .923 OPS overall. Zach Plesac was a solid rotation presence as a rookie, registering a 3.81 ERA and 1.228 WHIP in 21 starts covering 115 2/3 innings. Brad Hand finished tied for fifth in saves with 34, and Indians relievers as a whole ranked second among all MLB teams with a 3.67 combined team ERA.\n\nWhat Went Wrong\n\nStory continues\n\nDespite racking up 93 wins, the Indians were unable to capture a fourth straight American League Central title and also fell three games shy of the second American League Wild Card spot. There was no postseason baseball in Cleveland for the first time since 2015. Corey Kluber suffered a fractured right ulna when he was struck in the arm by a comebacker during a May 1 start against the Marlins and then strained his left oblique in a late-August rehab outing. He had a disappointing 5.80 ERA in 35 2/3 innings when healthy. Carlos Carrasco was diagnosed with chronic myeloid leukemia in early June and threw only 80 total innings between his 12 starts and 11 relief appearances. Mike Clevinger spent more than 60 days on the injured list between April and June because of an upper-back strain and logged just 126 total innings. Jose Ramirez hit just .198/.294/.292 through his first 279 plate appearances and was essentially unavailable for the final five weeks of the season due to a broken hamate bone. Jason Kipnis struggled to a .245/.304/.410 slash line in what was almost certainly his final year in the organization. Jake Bauers, the team’s Opening Day left fielder, went on to bat .226 with a .683 OPS in 423 plate appearances. Hanley Ramirez was signed in late February and looked poised to serve as the Indians’ primary DH, but he was released on April 23 after hitting .184/.298/.237 with 17 strikeouts in 16 games. Trevor Bauer wore out his welcome in Cleveland and was shipped off to the Reds on July 30 as part of a three-team, seven-player trade. Yasiel Puig, acquired from Cincinnati in that deal, managed just two home runs in 49 games with the Tribe.\n\nFantasy Slants\n\n** It’s a case-by-case, league-by-league, roster-by-roster kind of thing, but Jose Ramirez was probably the most frustrating player in fantasy baseball this year. He went third overall in the average draft, behind only Mike Trout and Mookie Betts, and was basically a SB-only commodity through the first three months of the regular season. In the other standard scoring categories -- batting average, home runs, RBI, and runs scored -- he was a detriment. Ramirez did bounce back in the second half before suffering a fractured hamate bone in late August and he ultimately finished with 23 home runs and 24 stolen bases alongside a good-but-not-great .806 OPS. He should come a lot cheaper on draft day next spring, entering what will be his age-27 campaign.\n\n** There was concern, and rightly so, that Francisco Lindor wouldn’t run as much this year coming off his springtime calf and ankle injuries, but he likely would have set a new career high for stolen bases had he not spent the large majority of April on the injured list. He’ll play all of next season at age 26, and his fantasy upside is through the roof if his health cooperates. In an early-round 2020 mock draft that I conducted with D.J. Short for the Rotoworld Fantasy Baseball Podcast, Lindor went sixth overall, behind Mike Trout, Christian Yelich, Ronald Acuna, Cody Bellinger, and Mookie Betts. Check out the full episode HERE.\n\n** Beyond the aforementioned Yasiel Puig, the Indians also acquired Franmil Reyes in the three-team, seven-player Trevor Bauer trade. Reyes was actually the centerpiece of the Indians’ return in that deal, as Puig is scheduled to become a free agent this winter. Reyes, who’s 24 years old and doesn’t turn 25 until next July, launched 37 home runs with 81 RBI in 150 games this season between San Diego and Cleveland. He hit cleanup for the Tribe in their final two games of the 2019 campaign and could be ready to explode in 2020. Look for a big spike in his ADP, which was 237.3 this spring on Yahoo.\n\n** Another shameless plug here for the Rotoworld Fantasy Baseball Podcast. We did an episode in September breaking down a potential top 10 among starting pitchers for 2020, and Shane Bieber made the list for both D.J. and myself. We always knew Bieber had the control to succeed at the MLB level, but the strikeouts were a surprise, and his arrow is pointing way up leading into 2020. I also had Mike Clevinger among my top 10. He missed a lot of time this year but posted a 2.71 ERA and 12.1 K/9 when healthy. Corey Kluber and Carlos Carrasco aren’t as exciting.\n\n** Oscar Mercado will be a popular name in fantasy drafts next March. He appears locked in as the Indians’ everyday center fielder after showing so well as a rookie, and the 24-year-old speedster quickly became manager Terry Francona’s preferred No. 2 hitter upon his callup from Triple-A Columbus. Mercado stole 29 bases between the minors and majors in 2019, after swiping 37 bags in 2018 and 38 in 2017. It looks like he is developing some power too.\n\n** Brad Hand had some iffy outings throughout August and made only one appearance after September 8 due to arm fatigue, but the 29-year-old right-hander seems sure to open as the Indians’ closer in 2020 and he has the goods to be a top-tier fantasy option. Hand boasts a 2.75 ERA and 405 strikeouts over his last 298 innings dating back to the beginning of the 2016 season.\n\n\n\nKey Free Agents: Yasiel Puig, Jason Kipnis, Tyler Clippard, Dan Otero\n\nTeam Needs: An everyday-caliber second baseman and a power-hitting corner outfielder. Better health would be nice. Even nicer would be a long-term Lindor extension.", "description": "Cleveland won 93 games during the 2019 regular season but failed to make the playoffs. Drew Silva has the latest MLB Team Roundup. (Getty Images)", "authors": ["Drew Silva"], "top_image": "https://s.yimg.com/ny/api/res/1.2/6yRcJYaF0SHmKQ9UY3Ftgg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTguOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/qf8oEWmB9s2UrXAcNI2V_g--~B/aD0xMTMyO3c9MjAxNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/rotoworld.com/28e2a1fb3eb70b0ba8cae5ba5ab56ea8", "published_at": "2019-10-28"}