{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7594915/Shifting-Beauden-Barrett-inspired-says-All-Black-Mealamu.html", "downloaded_at": "2019-10-21 01:36:37.531135+00:00", "title": "Shifting Beauden Barrett to full-back was inspired...", "language": "en", "text": "Keven Mealamu has hailed Steve Hansen for pulling off the “pretty crazy” plan of moving Beauden Barrett to full-back.\n\nBeauden Barrett produced a New Zealand World Cup record 21 carries as the All Blacks thumped Ireland 46-14 in Saturday’s quarter-final in Tokyo.\n\nHead coach Hansen shifted 28-year-old Barrett from fly-half to full-back in the summer, installing Richie Mo’unga at number 10 and creating a dual playmaking system.\n\nNew Zealand´s Beauden Barrett was dominant against Ireland (David Davies/PA)\n\nFormer All Blacks hooker Mealamu helped New Zealand retain their World Cup crown in England in 2015 before retiring with 132 caps and two Webb Ellis Cup titles to his name.\n\nAnd the 40-year-old has revealed his awe and admiration at New Zealand’s class of 2019 pushing towards even greater heights.\n\n“You think to yourself it’s pretty crazy they can put Beauden to full-back: but then you realise through the World Cup how pivotal it is to have Richie in that position at fly-half as well,” Mealamu told the PA news agency.\n\n“It really opens up the game a lot more, to have two guys who can pivot either side of the attack.\n\n“I’ve found out over the years you’ve just got to trust the decisions they make, because sometimes you wonder ‘why did they do that?’ and then a couple of weeks later you find out.\n\n“It’s some good insight for up and coming coaches and players as well.\n\n“It’s not easy firstly for coaches to make those decisions and then secondly as a player to embrace it and go with it as well.”\n\nAaron Smith bagged two tries among New Zealand’s seven in inflicting Ireland’s heaviest-ever World Cup defeat.\n\nNew Zealand´s Keven Mealamu won the World Cup in 2011 (David Davies/PA)\n\nMealamu believes New Zealand are relishing the pressure and playing with dangerous freedom, that will throw up a world of problems for their semi-final opponents England.\n\n“When it gets to the finals you realise you either win or go home,” said Mealamu.\n\n“And in that scenario there’s two types of teams, the team that goes into its shell and doesn’t really play at all and the team that really expresses itself.\n\n“The All Blacks came into the latter category on Saturday and that was awesome to see, because it shows players are really growing as leaders.\n\n“That’s the way to play in play-offs, get out there and express yourself. And the fact they can do that is brilliant.\n\n“It’s getting an understanding of it all. It’s hard to explain what it feels like until you’ve been in the position.\n\n“So for players that haven’t been in that position before that can be something that you can dwell on, or possibly it can blindside you if you haven’t prepared for it.\n\n“But our boys looked really good, they looked like they played open and free.\n\n“And for me it was the same as watching the English, they are another team that really rose to the occasion and embraced it.\n\n“Your team echoes your coach’s persona, so if he’s able to stay cool and calm and deliver clear messages in the heat of battle then the players go out and reflect that.\n\n“And sometimes if it’s the opposite then that’s what you see out on the field.”\n\nIreland’s seventh World Cup quarter-final exit in nine tournaments has spelled the end for Kiwi boss Joe Schmidt, who has relinquished his head coaching role to take a break and spend time with family.\n\nSchmidt led Ireland to their first two wins in history over New Zealand, three Six Nations titles including one Grand Slam and maiden wins in Australia and South Africa.\n\nThe World Cup quarter-final sticking point leaves just one itch Schmidt could not scratch in his six years at Ireland’s helm, but Mealamu insisted that will not dent the 54-year-old’s CV.\n\nMealamu in fact insisted Schmidt will still be on the All Blacks’ radar as a future coaching option.\n\nAsked to appraise Schmidt’s time in charge of Ireland, Mealamu said: “Oh my goodness, to be the first Ireland coach to beat the All Blacks, and for Ireland to beat them twice, I don’t think you can put anything past that.\n\n“You just have to say that and look at how long the Irish and All Blacks have been playing, it was huge to get those wins.\n\n“And the rugby they have been playing, that’s a huge feat for both Joe as the coach and Rory as the captain as well.\n\n“His record speaks for itself, it’s just that one of the hardest things to do is get your timing right to peak at a World Cup. Because there are so many other things that you need to achieve in between.\n\n“He’s definitely got the pedigree to coach the All Blacks. Warren Gatland is coming back as well, and when you look at them as coaches, what they’ve been able to do with other teams has been amazing.\n\n“I know both of them pretty well and they are both really good people.\n\n“I think that’s one of the main reasons why they have done so well, and that puts them in the frame.”", "description": "New Zealand face England in the semi-final next weekend.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/02/wire-19972952-1571620437-336_636x382.jpg", "published_at": "2019-10-21"}