{"pub": "indiatimes", "url": "https://indiatimes.com/technology/news/gujarat-born-pranav-mistry-makes-india-proud-by-being-appointed-as-ceo-at-samsung-s-star-labs-378721.html", "downloaded_at": "2019-10-28 07:35:31.591456+00:00", "title": "Gujarat-Born Pranav Mistry Makes India Proud, Becomes CEO At Samsung's Research Division", "language": "en", "text": "We first knew him as the magical wizard behind the gesture-driven Sixth Sense system, and a talented Indian brain doing remarkable work at one of the world's top engineering institutes.\n\nAnd now Gujarat-born Pranav Mistry has added yet another feather to his cap, after being appointed as the president and CEO of STAR Labs (Samsung Technology And Advanced Research), which is acquired by the South Korean tech giant Samsung Electronics.\n\nSamsung\n\nThe update was shared on Microsoft-owned social media/ networking platform LinkedIn on October 26th, 2019.\n\nPranav Mistry was popularly known for his development of 'Sixth Sense' gesture-controlled wearable computer that we developed while at MIT (Massachusetts Institute Of Technology) Labs.\n\nLater he joined Samsung in 2012, as the Director of Research and is one of the masterminds that created Samsung's first Galaxy Gear smartwatch, which was unveiled to the world in 2013. In 2017, he was promoted to become the vice president at Samsung Electronics.\n\nDon't Miss 526 SHARES 333 SHARES 5.7 K SHARES 676 SHARES 123 SHARES\n\nBorn on May 14th, 1981, in Palanpur, Gujarat, Pranav Mistry's Sixth Sense wearable computer was what got him first recognised in the world. The device could be worn around the neck with a camera that detected gestures made by fingers and registered it as input to do certain kinds of tasks.\n\nHe was also awarded the Young Global Leader in 2013. His work history includes working for major tech giants like Microsoft, Google, NASA among others.\n\nOddly enough, Pranav isn't the only Indian at a leadership position at Samsung. Recently, Samsung acquired audio-electronics brand Harman lead by Agra-born Dinesh Paliwal acting as president and CEO.\n\nTwitter/Pranav Mistry\n\nHarman is the parent company for brands like Harman Kardon, AKG, JBL and Infinity. Samsung's partnership resulted in the South Korean electronics brand upgrade its audio-tech on its devices.\n\nIt is a proud moment for our nation as Pranav Mistry now joins the group of Indians leading global tech companies. Sundar Pichai from Tamil Nadu is leading Google, Satya Nadella from Hyderabad is revolutionising cloud computing at Microsoft, Shantanu Narayen is the CEO of Adobe -- one of the largest editing and design software company in the world.", "description": "Gujarat-born Pranav Mistry has been appointed as the president and CEO of STAR Labs (Samsung Technology And Advanced Research), which is acquired by the South Korean tech giant Samsung Electronics. The update was shared on Microsoft-owned social media/ networking platform LinkedIn on October 26th, 2019.", "authors": ["Monit Khanna"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/pranav_mistry_samsung_sundar_pichai_satya_nadella_microsoft_google_1572241722_800x420.jpg", "published_at": "2019-10-28"}