{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7554841/Robert-Bradbury-guilty-death-Dr-Suzanna-Bull-careless-driving-Edgbaston-Birmingham.html", "downloaded_at": "2019-10-09 18:56:56.656192+00:00", "title": "Robert Bradbury guilty of death of Dr Suzanna Bull by careless driving Edgbaston Birmingham", "language": "en", "text": "A lorry driver who killed a doctor on her bike because he had installed a dashboard tray to be 'one of the lads' has been found guilty of death by careless driving.\n\nRobert Bradbury, 50, was unable to see Dr Suzanna Bull, 32, despite her wearing bright pink clothes and being in the designated cycle lane.\n\nHis vision was blocked by a three-tier dashboard tray table he had fitted to house his 'creature comforts', which included a sat nav, fan and sign emblazoned with his nickname 'the k***ster'.\n\nBradbury, of Birmingham, previously told his trial he had installed it so he could be 'one of the lads'.\n\nHe hit Dr Bull with his 32-tonne Scania HGV near Edgbaston Cricket Ground on October 9 2017.\n\nShe died at the scene as a result of 'catastrophic' injuries from the impact.\n\nRobert Bradbury, 50, (mugshot left) was unable to see Dr Suzanna Bull, 32, (right) despite her wearing bright pink clothes and being in the designated cycle lane when he hit her with his lorry in Birmingham on October 9 2017\n\nBradbury was today found guilty of causing death by careless driving, but the jury failed to return a verdict on the greater charge of death by dangerous driving.\n\nJudge Paul Farrer adjourned the case until October 28 to give the prosecution time to decide whether to hold a retrial on the more serious charge.\n\nHe said: 'There is no reason to suspect that Mr Bradbury presents a danger to the public on the road, so I will not issue an immediate disqualification order.\n\n'Mr Bradbury, you will learn at the latest on October 28 whether the prosecution are going to seek a retrial on count one.'\n\nBradbury, of Acocks Green, Birmingham, did not react when the verdicts were read out, and he was given unconditional bail.\n\nBradbury (pictured outside court last month) was today found guilty of causing death by careless driving, but the jury failed to return a verdict on the greater charge of death by dangerous driving\n\nThe court previously heard Dr Bull had been on a cycle ride with her brother moments before she was hit and was on her way home.\n\nWhen asked why he had the table, Bradbury said: 'Just so I could be one of the lads. They all had one so I got one.\n\n'My gaffer at the time... drove with one in. Nobody said anything to me about it.'\n\nWhen asked about the fatal collision, he added: 'I didn't do anything wrong. All I did was turn up for a day's work. It was six of one and half-a-dozen of the other.'\n\nMichael Duck QC, prosecuting, said Bradbury, had his view blocked by 'creature comforts' he had placed on his tray table.\n\nThey included a large Sat Nav and a sign emblazoned with his nickname 'The Knobster'.\n\nHe told the jury: 'Ms Ball was cycling back into Birmingham city centre after a bike ride with her brother. She was wearing bright, conspicuous pink clothing.\n\n'Mr Bradbury was parked at the traffic lights on Pershore Road in his lorry.\n\n'He was just about to pull off and as he did Ms Ball came alongside him in the cycle lane as entitled to do so and emerged three or four feet in front of him and positioned herself in a way that she should have been seen.\n\n'She had not been seen. The lorry began to move driven by Mr Bradbury.\n\n'It quickly caught up with Ms Ball's bicycle and began to obscure her from view. He turned left straight across her. The consequences are obvious.\n\n'She was dragged under the lorry. She was crushed by the wheels of the lorry and died at the scene. The collision took place just over 20 seconds after he overtook her.\n\nThe scene near Edgbaston Cricket Ground in Birmingham where the fatal collision happened\n\n'This demonstrates that 30 seconds before he had overtaken the cyclist he should have been aware of the presence of that cyclist.\n\n'Lorry drivers spend a lot of time in their vehicles and are entitled to install creature comforts, such as tray tables.\n\n'His table and the items on it such as a large satellite navigation system compromised his view out of the left wind mirror.\n\n'The reality is that there is a very good chance that if the tray table had not been in position he would have seen Ms Ball.\n\n'It was an obstruction and would have obscured Ms Ball by a margin of three to four metres.'\n\nThe court heard Bradbury had been repeatedly warned about dangerous positioning of the tray-table months before the fatal collision.\n\nMr Duck told the court: 'This was not a one off. It was something he had done despite being warned that it was creating an obstruction of view in his mirror.\n\n'It was apparent from an inspection on April 25 that the tray table created a hazard.\n\n'On April 28 an ANPR camera showed cluttering and obscuring of the wind mirror.\n\n'On May 3 for an MOT the tray table and the items were not there. But they were on May 4 and 5 when captured on camera.\n\n'He knew that they created a danger. He knew that if the lorry had gone in on May 3 in that condition it would have failed its MOT.\n\n'When this incident took place items were cluttered on the tray table and the view out of the left wind mirror was obscured.\n\n'He had created a risk and did not pay sufficient attention when turning left across her path.\n\n'The satellite navigation system on the table and a sign with his favoured nickname obscured the wind mirror.\n\n'He had created the danger at that particular junction.\n\n'He had his cab set up in a way that compounded the risk to other road users and he knew it was dangerous. He fell far below the standard of a careful and competent driver.'", "description": "Robert Bradbury, 50, was unable to see Dr Suzanna Bull, 32, despite her wearing bright pink clothes and being in the designated cycle lane in Birmingham on October 9 2017.", "authors": ["Lara Keay For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/15/19496676-0-image-a-44_1570632652003.jpg", "published_at": "2019-10-09"}