{"pub": "indiatimes", "url": "https://indiatimes.com/technology/news/after-50-years-us-is-finally-stopping-use-of-floppy-disks-to-launch-nuclear-missiles-378131.html", "downloaded_at": "2019-10-19 10:58:31.801598+00:00", "title": "After 50 Years, US Is Finally Stopping Use Of Floppy Disks To Launch Nuclear Missiles", "language": "en", "text": "Back in 2014, people in the US experienced an incredibly rude awakening. Thanks to a '60 Minutes' news segment, they found out that that the US military's entire network of precarious and dangerous nuclear missile systems were being controlled by floppy disks.\n\nGetty Images\n\nApparently, despite these missiles being capable of literally wiping out entire cities, the US military was using a network of ancient computers from the '70s, with giant 8-inch floppy disks, to receive launch orders from the President.\n\nClearly that's an incredibly worrisome system, so we're all grateful to hear they've upgraded now.\n\nUS Air Force\n\nThe US strategic command has announced it's replaced the antiquated floppy drives with a \"highly-secure solid state digital storage solution,\" Lt. Col. Jason Rossi told c4isrnet.com. It's still being used in the old computers though, which are part of the original network set up back in the day, called the Strategic Automated Command and Control System, or SACCS. This is used by military personnel in nuclear command centres to send emergency action messages to field forces.\n\nDon't Miss 198.5 K SHARES 49.4 K SHARES 16.6 K SHARES 3.4 K SHARES 1.7 K SHARES\n\nThe reason these old systems are still used is because they were in place long before there was even an Internet. As such, they don't have an IP address, so they're technically unhackable. It is however much harder to maintain as the years go by, given that replacements aren't readily available for hardware that old when it breaks. Most of the time, technicians have to spend hours under microscopes fixing parts themselves.\n\nCBS News\n\nHowever, the Defense Department had planned to replace the old IBM Series/1 SACCS computer by the end of 2017 in order to \"update its data storage solutions, port expansion processors, portable terminals, and desktop terminals.\" It's unclear whether that's actually happened yet, but at least the speed of the whole system will be improved by the addition of SSD technology.", "description": "Back in 2014, people in the US experienced an incredibly rude awakening. Thanks to a ‘60 Minutes’ news segment, they found out that that the US military’s entire network of precarious and dangerous nuclear missile systems were being controlled by floppy disks.", "authors": ["Gwyn D'Mello"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/us_nuclear_floppy_1571467061_800x420.jpg", "published_at": "2019-10-19"}