{"pub": "news24", "url": "https://traveller24.com/Explore/International-Getaways/managing-them-is-a-full-time-job-dutch-farmers-fed-up-with-tourists-trampling-tulip-fields-20190329", "downloaded_at": "2019-10-16 14:03:46.227138+00:00", "title": "Managing them is a full-time job - Dutch farmers fed-up with tourists trampling tulip fields", "language": "en", "text": "Dutch Spring scene with a windmill and colourful tulip fields under a nicely clouded sky YOU MIGHT ALSO LIKE {{item.title}}\n\nDutch farmers have a message for tourists: Please don't trample upon our tulips.\n\nBulb fields close to the Netherlands' North Sea coast are a major tourist drawcard each spring as tulips, daffodils, hyacinths and other flowers bloom and transform the region into a patchwork of vibrant colors that provide the backdrop for many a holiday snap or Instagram post.\n\nThe visitors, however, increasingly are walking into fields, damaging flowers and the bulbs so new signs are urging tourists to enjoy the view but to stay out of the fields.\n\nREAD: Van Gogh's Vase with Poppies receives long-awaited stamp of authenticity\n\nWhile visiting tourists pour money into the region, the damage they do to plants also comes at a cost. If a tulip plant is trampled, the bulb it springs from will not grow sufficiently to be sold.\n\n(PHOTO: iStock)\n\nA similar campaign last year was seen as a little too unfriendly so new signs have been made and farmer Simon Pennings said he plans to place \"ambassadors\" in fields to explain to tourists why they should stay out.\n\nOne of the new banners, with the text \"Enjoy the flowers, respect our pride,\" was placed next to a field Wednesday, but didn't deter a visitor from walking into the field to snap a photo.\n\nPennings has seen it all before.\n\n\"Bicycles, people, dogs, children, we see it all\" in the fields, he said.\n\n\"Last year, I had one field with 300 tourists in it,\" said Pennings. \"Managing the tourists was almost a full-time job.\"\n\nFind Your Escape by searching and comparing flight prices here. You can also sign-up for the Traveller24 Weekly Newsletter – Subscribe here. Or download the News24 App here, to receive expertly curated travel ideas and deals directly to your mobile.", "description": "Dutch farmers have a message for tourists: Please don't trample our tulips.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/6646/c07546f9fdb74c2baf366324ba8a6314.jpg", "published_at": "2019-03-29"}