{"pub": "fox", "url": "https://foxnews.com/media/rep-andy-biggs-on-bolton-deputy-skipping-deposition-says-maybe-dems-impeachment-push-is-viewed-as-illegitamate", "downloaded_at": "2019-10-28 23:35:53.174641+00:00", "title": "Ex-Bolton deputy skipping deposition suggests 'maybe' impeachment push is viewed as 'illegitimate,' Rep Andy Biggs says", "language": "en", "text": "After a former deputy to onetime National Security Adviser John Bolton took legal action against Democrats for their handling of the impeachment inquiry, Republican Rep. Andy Biggs told “America’s Newsroom” on Monday that it could be due to the process being viewed as “illegitimate.”\n\n“I think what this is reflective of is this idea that when you continue to have these ongoing secretive closed-door hearings and you’re not even bringing in the most central figure to this, the person who made the allegations, the whistleblower, maybe it’s viewed as illegitimate,” Biggs said.\n\nCharles Kupperman, a deputy to Bolton, is looking to the courts to resolve a new standoff in the impeachment inquiry, as Democrats threaten him with contempt for defying a subpoena at the direction of the White House.\n\nBOLTON DEPUTY FACES CONTEMPT THREAT AS HE SKIPS DEPOSITION, SEEKS COURT RULING TO RESOLVE STANDOFF\n\nThe subpoena ordered Kupperman to appear for a deposition Monday morning. He did not comply.\n\nIn response to a tough letter from House Democratic leaders, Kupperman attorney Charles Cooper suggested his client is willing to comply with their requests eventually — provided a judge tells him to do so.\n\nHis attorney has claimed Kupperman is facing \"irreconcilable commands\" by the legislative and executive branches that the courts must resolve.\n\nADAM SCHIFF: JOHN BOLTON IS 'KEY WITNESS' IN IMPEACHMENT INQUIRY\n\nThe Sunday letter came in response to a stern warning issued Saturday from House Intelligence Committee Chairman Rep. Adam Schiff, D-Calif., House Foreign Affairs Committee Chairman Eliot Engel, D-N.Y., and House Oversight Committee Acting Chairwoman Carolyn Maloney, D-N.Y.\n\nThe Democrats claimed that the issue of whether Kupperman should comply with a congressional subpoena or White House instructions “cannot be decided by a court,” and they accused the Trump administration of having a hand in the lawsuit to impede the investigation.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nAfter he was subpoenaed, Kupperman filed a lawsuit in federal court on Friday asking a court whether he should accede to House demands for his testimony or to assert \"immunity from congressional process\" as directed by President Trump.\n\n“I view it as illegitimate at this point and the president has urged non-compliance,” Biggs said.\n\nFox News' Ronn Blitzer contributed to this report.", "description": "After Charles Kupperman, the former deputy to ex-National Security Adviser John Bolton took legal action against Democrats for their handling of the impeachment inquiry, Republican Rep. Andy Biggs told “America’s Newsroom” on Monday that it could be due to the process being viewed as “illegitimate.”", "authors": ["Joshua Nelson", "Joshua Nelson Is A Freelance Reporter For Fox News."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Screen-Shot-2019-10-28-at-1.38.31-PM.png", "published_at": "2019-10-28"}