{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7559435/Kendall-Jenner-wishes-Bella-Hadid-happy-birthday-sexy-shares-footage-two-kissing.html", "downloaded_at": "2019-10-10 18:55:14.089094+00:00", "title": "Kendall Jenner wishes Bella Hadid a 'happy birthday sexy' as she shares footage of the two kissing", "language": "en", "text": "They are old friends who have known each other since their teenage years.\n\nAnd to celebrate Bella Hadid turning 23 on Wednesday, Kendall Jenner shared footage of the two kissing.\n\nThe short segment was taken from Travis Scott's Netflix documentary, Look Mom: I Can Fly.\n\nBest of friends: Kendall Jenner wishes Bella Hadid a 'happy birthday sexy' as she shares throwback footage of the two kissing\n\nIt shows Bella lying on the grass, with Kendall straddling her as friends surround them.\n\nThe pair's pals whoop as they briefly embrace, before a laughing Bella lies back with a smile.\n\nBoth top models, Kendall and Bella often work together and share a large social group.\n\nJust having fun: The pair laugh after their kiss\n\nHowever their own friendship predates their current fame, with Kendall first connecting Bella when they were young teens.\n\nThey have plenty in common, thanks to their backgrounds in reality TV.\n\nAt the time Bella was occasionally appearing on Real Housewives Of Beverly Hills at the time, alongside her mom Yolanda, who back then was married to record boss David Foster. Meanwhile Kendall had long been starring beside her big sisters on Keeping Up With the Kardashians.\n\n'I met her for the first time seven years ago over Twitter,' Bella told InStyle. 'That was before we started modeling; I was probably 14 or 15. We met up and had sushi, and now we're best friends. She's a pretty significant human I met online.'\n\nLongtime pals: Kendall and Bella are seen back in May at the Met Gala\n\nAs for their kiss, it comes after Kendall last year publicly commented on rumors that she is gay, saying she simply prefers to keep her romances out of the spotlight.\n\nShe explained to Vogue last year: 'I think it's because I'm not like all my other sisters, who are like, \"Here's me and my boyfriend!\" So it was a thing for a minute because no one ever saw me with a guy. I would always go that extra mile to be low-key with guys, sneaking around all the time.'\n\nand she continued: 'I don't think I have a bisexual or gay bone in my body, but I don't know! Who knows? I'm all down for experience — not against it whatsoever — but I've never been there before.'\n\nOut and about: Kendall was pictured on Monday leaving a meeting in Los Angeles", "description": "They are old friends who have known each other since their teenage years.", "authors": ["Dailymail.Com Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/16/19547574-0-image-a-15_1570722555075.jpg", "published_at": "2019-10-10"}