{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/amazon-interview-questions-jeff-bezos-sat-scores-socratic-method-2019-10", "downloaded_at": "2019-10-20 23:26:09.124862+00:00", "title": "Jeff Bezos' early interview methods: SAT scores and the Socratic method", "language": "en", "text": "Most people think their SAT scores don't matter after college, but most people aren't Jeff Bezos.\n\nThe billionaire Amazon founder would ask every job candidate how they scored on the standardized test before submitting them to a Socratic-style interrogation in the early days of Amazon, The Atlantic's Franklin Foer reported in a profile of the CEO published in the magazine's November issue. Bezos, according to The Atlantic, believed that candidates' SAT scores were a reflection of their intelligence.\n\nBut SAT scores were not the only technique Bezos relied on to measure a candidate's intelligence. Bezos also asked open-ended questions in the Socratic style, such as \"Why are manhole covers round?\" to measure how logical candidates were, The Atlantic reported.\n\nThe fifth employee that Bezos hired, Nicolas Lovejoy, told Wired's Chip Bayers in 1999 that the CEO was \"very, very picky\" with who he hired. \"One of his mottos was that every time we hired someone, he or she should raise the bar for the next hire, so that the overall talent pool was always improving,\" Lovejoy told Wired.\n\nBezos also questioned the other interviewers about their impressions of the candidate and made charts of candidates' resumes on a whiteboard, Lovejoy told Wired.\n\nBezos founded Amazon as an online bookstore from his garage on July 4, 1994 after quitting his Wall Street job and moving to Seattle, Washington. Bezos now has a net worth of $117 billion, Business Insider previously reported.\n\nRead more: Jeff Bezos just sold about $1.8 billion worth of stock. Here's how the world's richest person makes and spends his billions.\n\nAmazon did not return Business Insider's request for comment on whether select job candidates are still asked for their SAT scores.\n\nWhat CEOs look for in potential recruits\n\nBezos isn't the only tech founder to prize intelligence in potential recruits. Bill Gates also screened potential Microsoft recruits for their intellect, but the IQ test was his preferred metric, Business Insider's Shana Lebowitz previously reported.\n\n\"The key for us, number one, has always been hiring very smart people,\" Bill Gates once said in an interview. \"There is no way of getting around that in terms of IQ, you've got to be very elitist in picking the people who deserve to write software.\"\n\nIntelligence is far from the only trait CEOs look for, though. Hyatt CEO and President Mark Hoplamazian, for one, looks for employees who align their jobs with their own sense of purpose. And as Business Insider's Callum Burroughs reported in August, Flywire CEO Mike Massaro assesses potential hires to see how well they fit with the rest of the team.\n\nBezos also screened candidates for high levels of personal accountability, Inc. reported in 2017. This was often done with behavioral questions, where candidates were asked to explain how they would handle a specific situation or how they have handled a similar situation in the past.", "description": "The fifth employee that Jeff Bezos hired in Amazon's early days, Nicolas Lovejoy, said in 1999 that the CEO was \"very, very picky\" with who he hired.", "authors": ["Taylor Nicole Rogers"], "top_image": "https://image.businessinsider.com/5da5cd2b4af9091f83635124?width=1200&format=jpeg", "published_at": "2019-10-20"}