{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7582553/Taylor-Swift-reveals-one-question-gets-asked-deteriorates-mental-health.html", "downloaded_at": "2019-10-17 06:01:34.922423+00:00", "title": "Taylor Swift reveals the one question she gets asked that 'deteriorates' her mental health", "language": "en", "text": "Taylor Swift addressed the one question that will deteriorate her mental health during her Tiny Desk concert on Wednesday.\n\nThe 29 year old singer was the latest to perform as part of NPR's Tiny Desk concert series at NPR headquarters in Washington D.C.\n\nAfter opening her set with The Man and the title track from her new album Lover, Swift revealed the mentally-deteriorating question is 'What will you do if you ever get happy?'\n\nOne question: Taylor Swift addressed the one question that will deteriorate her mental health during her Tiny Desk concert on Wednesday\n\n'Over the course of me doing interviews, which is about 15 or 16 years, I've gotten a question over and over again that I think has the potential to seriously deteriorate my mental health,' she began.\n\n'That question is, \"What will you ever do if you get happy?\" Like what will you write about? Will you just never be able to write a song again? It's an interesting question,' she said.\n\n'When I would get that question as a young person, I'd kind of be like, \"Well, I started out writing songs about stuff I had no idea about,' she said.\n\nInterview: 'Over the course of me doing interviews, which is about 15 or 16 years, I've gotten a question over and over again that I think has the potential to seriously deteriorate my mental health,' she began\n\n'Like I started writing songs when I was 12 years old and they were usually about heartbreak, I had no idea what I was talking about, but I had watched movies and read books,' she added.\n\nShe said that she would 'grab inspiration from character dynamics' and she would probably get inspiration from other stuff happening in the world.\n\n'Then I'd go home and be like, \"What would happen if I were ever happy?\"' Swift joked.\n\nWriting songs: 'Like I started writing songs when I was 12 years old and they were usually about heartbreak, I had no idea what I was talking about, but I had watched movies and read books,' she added\n\n'Would I not be able to do the thing I love the most in the world? Would I not be able to write breakup songs anymore?' I love writing breakup songs. They're so fun to write!\"' Swift mused.\n\nWhen it came to her new album Lover, a much more happy and upbeat album, said to be largely inspired by her three-year relationship with Joe Alwyn, she said she was having a lot of conversations with friends who had been going through break-ups.\n\nShe said that she put a break-up song on Lover, Death By a Thousand Cuts which she said was her, 'proof that I don't have to stop writing songs about heartache and misery, which, for me, was incredible news.'\n\nHappy: When it came to her new album Lover, a much more happy and upbeat album, said to be largely inspired by her three-year relationship with Joe Alwyn, she said she was having a lot of conversations with friends who had been going through break-ups\n\nLover debuted on August 23 to largely positive reviews, debuting atop the Billboard album charts with all 18 songs entering the single's charts simultaneously, setting the record for the most simultaneous singles chart entries.\n\nSwift will perform at the Hollywood Bowl in Los Angeles on Saturday, October 19, with a December 13 show in Madison Square Garden.\n\nShe kicks off her European on June 20, before kicking off her American tour with three performances at the new SoFi Stadium in Inglewood, California on July 24-26.", "description": "Taylor Swift addressed the one question that will deteriorate her mental health during her Tiny Desk concert on Wednesday.", "authors": ["Brian Gallagher For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/06/19820636-0-image-a-4_1571290192279.jpg", "published_at": "2019-10-17"}