{"pub": "theverge", "url": "https://theverge.com/2019/10/11/20909771/porsche-boeing-partnership-flying-cars-rich-people", "downloaded_at": "2019-10-11 19:37:14.400529+00:00", "title": "Porsche teams up with Boeing to build flying cars for rich people", "language": "en", "text": "Porsche and Boeing are teaming up to build luxury, electric-powered vertical takeoff and landing (VTOL) aircraft for rich people to fly above traffic-choked cities. They are the latest companies to announce intentions to explore the risky and potentially dangerous urban air mobility market.\n\nPorsche and Boeing have signed a nonexclusive memorandum of understanding, which means they will look for ways to work together, but they aren’t locked into a binding agreement. As part of the partnership, the companies say they will “create an international team to address various aspects of urban air mobility, including analysis of the market potential for premium vehicles and possible use cases.”\n\nThe word “premium” would seem to indicate that this won’t be a “flying car” for the masses, which is fair considering we’re talking about Porsche here. Many companies interested in creating a network of electric flying taxis have stretched credulity by insisting that people at all income levels will be able to afford to purchase tickets. But given the costs associated with creating an infrastructure to support electric vertical takeoff and landing (eVTOL) aircraft, including landing pads and charging stations, it seems clear that it will be marketed toward the very wealthy — at least to start.\n\nit seems clear that it will be marketed toward the very wealthy — at least to start\n\nPorsche, Boeing, and Boeing’s subsidiary Aurora Flight Sciences will work together to develop a luxury electric flying car that can fly short hops across cities. Aurora has been hard at work at testing its first autonomous electric aircraft. Earlier this year, the unpiloted vehicle took off vertically, hovered for a few seconds, and then landed at the company’s test site in Manassas, Virginia. Boeing said that future flights will test forward, wing-borne flight, as well as the transition phase between vertical and forward-flight modes.\n\nBoeing, and now Porsche, are among dozens of companies that are pursuing some form of urban air taxi service. But as one of the largest aerospace companies in the world, clearly, Boeing has the resources and the engineering prowess to get something in the air sooner than most.\n\nAnd Boeing isn’t the only aerospace giant interested in electric flight. Last year, rival Airbus demonstrated its Vahana eVTOL aircraft in a test flight very similar to Boeing’s. But unlike Boeing, Airbus plans on launching its own flying taxi network.", "description": "Porsche and Boeing are teaming up to build luxury, electric-powered vertical takeoff and landing aircraft (VTOL) for rich people to fly above traffic-choked cities. They are the latest companies to announce intentions to explore the risky and potentially dangerous urban air mobility market.", "authors": ["Andrew J. Hawkins", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/SCJcTz7IrFdHUfoA_SxwVdDoWwY=/0x85:3124x1721/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19278890/20191010_P3_Pressebild_2_City_Section.jpg", "published_at": "2019-10-11"}