{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/strictlys-shirley-ballas-shares-disgusting-20720437", "downloaded_at": "2019-10-25 16:44:22.630168+00:00", "title": "Shirley Ballas gets death threats over her Strictly Come Dancing judging", "language": "en", "text": "Get the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nStrictly Come Dancing head judge Shirley Ballas shared some specifics of the trolling and death threats she's received on the latest episode of The Jonathan Ross Show.\n\nThe 59 year-old has been very open about the threats made on her life after the controversial axing of Dev Griffin and Dianne Buswell from the show.\n\nShe appeared alongside fellow Strictly judges, newcomer Motsi Mabuse and Craig Revel-Horwood.\n\nDetailing some of the worst trolling she's received, Shirley revealed: \"Somebody put a picture with my face on it digging my own grave [with a comment] 'Die b***h' and put me on a chicken spit.\"\n\nThe other judges chimed in on the issue, with Strictly veteran Craig taking a lighter approach.\n\nHe said: \"I always think of it as a comic strip, I never really think of it as anything. Everyone is entitled to their opinion of course.\n\n(Image: ITV)\n\n(Image: ITV)\n\n\"I'm very opinionated. These people who are writing stuff online, I think, need to sometimes be...\" Craig then makes a zip sign across his mouth.\n\nLater he added: \"This is to do with Dev I would imagine. Everyone in the group, especially us as judges, all said professionally that he was the one that should leave and I defend that, of course I'm going to defend that because that was the decision on the night...I'd love to be able to do a big sum up and then put someone through but it's not about that.\n\n\"The dance off is literally about who was good on that night and who did the best on the night.\"\n\nMotsi, who is the sister of pro dancer Oti, admitted that online trolling does get to her.\n\nShe said: \"I get so upset - well angry - then I write everything down, I answer them then I go to my husband and I put on my angry voice and [read my response] then he's like, 'OK darling, do you feel better?'\n\n\"I'm like, 'Yes.' [He says] 'So delete it' so it never gets out but I've got it out of the system.\"\n\n(Image: DIGITAL/EROTEME.CO.UK)\n\nMotsi also revealed that her mum is a big online presence when it comes to her girls: \"For [my mum] it's really crazy, the interest in us.\n\n\"I told her, 'Mum, do not read anything on social media.' She is like in every Strictly group and she's answering [comments]. I'm like, 'Do not answer these people!'\n\n\"Her name is her real name and she just said to me, 'What would you do if it was your daughter?' I said, 'I wouldn't answer, I wouldn't read that stuff!'\"\n\nThey also chatted about the Strictly class of 2019, with Shirley expressing excitement for what's to come.\n\nShe said: \"I think it's the most unpredictable series of all time, actually. Every week something is changing and yes, it's the best season ever.\"\n\nCraig added: \"I think [the contestants] are [nervous] as a matter of fact, I think particularly this year. They take it really seriously.\"", "description": "Head judge Shirley told Jonathan Ross that among other death threats someone sent her a doctored picture of her digging her own grave", "authors": ["Will Twigger", "Image", "Itv", "Digital Eroteme.Co.Uk"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20723547.ece/ALTERNATES/s1200/2_Strictly-judges-on-The-Jonathan-Ross-Show.jpg", "published_at": "2019-10-25"}