{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-eu-nireland/northern-irish-no-deal-brexit-challenge-dismissed-in-court-idUKKCN1VX141", "downloaded_at": "2019-09-12 11:50:04.299812+00:00", "title": "Northern Irish 'no-deal' Brexit challenge dismissed in court", "language": "en", "text": "FILE PHOTO: A woman wearing an Irish flag and a man wearing an EU flag demonstrate in front of the parliament at Westminster, in London, Britain, September 4, 2019. REUTERS/Hannah McKay/File Photo\n\nBELFAST (Reuters) - Belfast’s High Court dismissed on Thursday a case arguing that a British exit from the European Union without a withdrawal agreement would contravene Northern Ireland’s 1998 peace accord.\n\nThe case is one of a series across the United Kingdom challenging Prime Minister’s Boris Johnson’s Brexit strategy. Johnson has said Britain must leave the EU on Oct. 31, whether or not it secures a deal on an orderly exit.\n\nScotland’s highest court of appeal ruled on Wednesday that Johnson’s decision to suspend parliament for five weeks was unlawful and should be annulled, a verdict that will be appealed at the United Kingdom Supreme Court next week.\n\nNorthern Irish rights campaigner Raymond McCord, one of three people backing the case, had argued that a no-deal Brexit would breach the 1998 Good Friday Agreement that brought peace to the British-run province and that leaving without a divorce agreement was not provided for in existing legislation.\n\n“I consider the characterisation of the subject matter of these proceedings as inherently and unmistakably political to be beyond plausible dispute,” Judge Bernard McCloskey said in a 68-page written judgement.\n\n“Virtually all of the assembled evidence belongs to the world of politics, both national and supra-national.”\n\nA lawyer representing Johnson’s government said on Monday that under Article 50 of the EU Treaty, the obligation to negotiate was on Brussels rather than on the member state. UK legislation in 2017 and 2018 “assumes but does not require a Withdrawal Agreement,” said the lawyer, Tony McGleenan.\n\nThe Northern Ireland case had also sought a legal challenge to the suspension of parliament but the court decided to hear the wider case against “no deal”.\n\nJudges for Northern Ireland’s Judge Court of Appeal said they could hear an appeal as early as Friday, if one is lodged. Lawyers in the case were told to return to the court with a decision at 1200 GMT.", "description": "Belfast's High Court dismissed on Thursday a case arguing that a British exit from the European Union without a withdrawal agreement would contravene Northern Ireland's 1998 peace accord.", "authors": ["Amanda Ferguson", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190912&t=2&i=1429029865&w=1200&r=LYNXNPEF8B0RC", "published_at": "2019-09-12"}