{"pub": "businessinsider", "url": "https://businessinsider.com/impeachment-inquiry-into-trump-explained-in-30-seconds-2019-10", "downloaded_at": "2019-10-15 00:48:34.054601+00:00", "title": "The impeachment inquiry into Trump, explained in 60 seconds", "language": "en", "text": "In the past month, Donald Trump's presidency has been upended by a bombshell whistleblower scandal that has now snowballed into a full-blown and fast-moving impeachment inquiry.\n\nHere's how it all started, how an impeachment inquiry could play out, and what all the key players are thinking and saying about the situation.\n\nRead more of Insider's coverage of the impeachment inquiry into Trump and the fallout from the whistleblower complaint.\n\nVisit Business Insider's homepage for more stories.\n\nIn the past month, Donald Trump's presidency has been upended by an explosive whistleblower scandal that snowballed into a full-blown and fast-moving impeachment inquiry.\n\nHow did we get here? And what are the next steps?\n\nHere's a 60-second explanation of what's going on:\n\nIn early September, Rep. Adam Schiff of California, the chairman of the House Intelligence Committee, publicly announced that he had become aware of an urgent whistleblower complaint from an US intelligence official.\n\nThe whistleblower said that in a July 25 call with Ukrainian President Volodymyr Zelensky, Trump used \"the power of his office to solicit interference from a foreign country in the 2020 U.S. election.\"\n\nThe complaint detailed concerns how Trump used the call with Zelensky to pressure the Ukrainian government to investigate former Vice President Joe Biden and his son days after withholding a nearly $400 million military-aid package.\n\nBiden's son, Hunter, served on the board of Ukrainian oil and gas company Burisma Holdings from 2014 to 2019. Trump and his allies have falsely accused Biden of using his power as vice president to urge Ukraine to fire a prosecutor who was investigating Burisma in order to protect Hunter.\n\nThe claim doesn't hold much water. The prosecutor Biden wanted out, Viktor Shokin, was widely considered to be ineffective at his job and at cleaning up Ukraine's notorious culture of corruption. Biden pushed for Shokin's firing because he wasn't cracking down hard enough on corruption, not because he posed a threat to Hunter.\n\nBiden represented the US's official position on the matter, one that was shared by most of the West as well as the International Monetary Fund. The investigation into Burisma was also largely dormant at the time Biden started calling for Shokin's dismissal.\n\nA memo summarizing the call released by the White House confirmed the substance of the whistleblower's complaint. It showed that after telling Zelensky that \"we do a lot\" for Ukraine in terms of military support, Trump asked him for \"a favor\" by investigating Hunter Biden's business dealings and helping to discredit the Russia probe.\n\nAsking a foreign government for material campaign aid is not only unprecedented from a president, but it could even violate campaign finance laws against soliciting aid from foreign nationals. And if Trump did in fact use military aid as a bargaining chip, he could also be impeached on charges of extortion and misappropriation of taxpayer funds.\n\nRead more:\n\nRead the full declassified whistleblower complaint about a phone call between Trump and Ukraine's president\n\nThe notes on Trump's call with Ukraine's president hint at a quid pro quo over investigating Joe Biden's son\n\nThese are the key players you need to know to make sense of the Trump impeachment inquiry\n\nJustice Department veterans say Trump could be accused of breaking 4 laws in the Ukraine whistleblower scandal\n\nHow does an impeachment inquiry work?\n\nThe inquiry is being spearheaded by Schiff, House Foreign Affairs Committee Chairman Eliot Engel of New York, and House Oversight Committee Chairman Elijah Cummings of Maryland.\n\nAs part of the inquiry, the committees have begun subpoenaing relevant documents and calling on witnesses to testify in open and closed sessions.\n\nThe impeachment process begins in the House Judiciary Committee, which draws up articles of impeachment based on the results of the inquiry. The House hasn't yet determined whether they'll limit the scope of the inquiry to the allegations raised in the whistleblower complaint, or if they'll include articles related to obstruction of congressional investigations.\n\nIf the committee passes the articles of impeachment by a majority, they go to the full floor of the House of Representatives and require a simple majority vote of 218 members to pass. Members vote on each article individually, meaning Trump could be impeached on some articles but not others.\n\nFormer President Bill Clinton, for example, was impeached on articles of perjury to a grand jury and obstruction of justice, but he was cleared on a separate perjury-related article and a charge of abusing his office. In January of 1999, the US Senate acquitted Clinton on both charges.\n\nIn order for Trump to be removed from office, two-thirds of the US Senate — 66 members — have to vote to convict him of those articles of impeachment. Currently, the Senate consists of 53 Republicans, 45 Democrats, and two independents who caucus with Democrats.\n\nRead more:\n\nNewly revealed text messages show Trump diplomats' internal turmoil over his pressure on Ukraine\n\nTrump is daring Democrats to impeach him because he thinks he cannot lose in the Senate\n\nRick Perry is the 3rd cabinet official to be subpoenaed in the impeachment inquiry against Trump\n\n'He's giving them all the ammunition they need': Trump is shooting himself in the foot by stonewalling Congress in the impeachment inquiry\n\nRepresentative Adam Schiff is the the most visible face of House Democrats' impeachment inquiry. Reuters\n\nWhat Democrats are saying\n\nAfter the Justice Department released the former special counsel Robert Mueller's report in the Russia investigation, Democratic leadership encouraged House committees to continue to investigate the Trump administration but warned that it was still soon and there wasn't enough compelling evidence to begin impeachment proceedings.\n\nBut House Speaker Nancy Pelosi said Trump's conduct toward Ukraine left House Democrats with no choice but to launch a formal impeachment inquiry last month.\n\n\"For the past several months, we have been investigating in the committees and litigating in the courts whether Congress can exercise its full Article I power, including the constitutional power of approval of articles of impeachment,\" Pelosi said at the press conference.\n\nShe slammed Trump's reported actions as having \"revealed the dishonorable fact of the president's betrayal of his oath of office, betrayal of our national security, and betrayal of the integrity of our elections.\"\n\nNow, almost all of the 235 House Democrats — including many in House leadership and in districts Trump won — have now gotten behind the ongoing impeachment inquiry.\n\nRead more:\n\nPelosi says it's 'almost not worth' impeaching Trump, but that the Constitution and democracy 'is worth it'\n\nAlexandria Ocasio-Cortez responded to Trump calling her a 'wack job,' by saying it is better than being someone who 'betrays our country'\n\nThe Trump whistleblower told the House Intelligence Committee about their concerns before filing an official complaint\n\nWhat Trumpworld is saying\n\nSo far, the White House has largely failed to put forth any consistent messaging on the Ukraine scandal or defense against the impeachment inquiry. In the court of public opinion, Trump and his allies have defended Trump's conduct in several contradictory ways:\n\nThey say the whistleblower complaint isn't credible because it's based on secondhand information, despite the fact that the substance of the complaint is corroborated by the White House's own memo summarizing the July 25 Trump-Zelensky call.\n\nThey argue Biden's conduct was, in fact, corrupt and Trump was justified in asking Ukraine to investigate the Bidens' business dealings in Ukraine.\n\nThey attack Pelosi, Schiff and congressional Democrats as waging an out-of-control partisan war in the \"Kangaroo court\" of Congress.\n\nRead more:\n\nTrump's approach to the impeachment inquiry bears a striking resemblance to how the mafia operates\n\nThe White House is 'paralyzed' and 'teetering on the edge of a cliff' as it grapples with Ukraine fallout and 'Hurricane Rudy'\n\nWhite House says Trump 'cannot permit his administration' to cooperate with the 'partisan and unconstitutional' impeachment inquiry\n\nSen. Mitt Romney of Utah is one of the few GOP members of Congress to forcefully condemn Trump's conduct towards Ukraine. Reuters\n\nWhat Republicans are saying\n\nTrump's staunchest allies in the House like Reps. Matt Gaetz, Jim Jordan, and Mark Meadows have gone all in to defend Trump's conduct and attack the Democrats at every turn.\n\nGOP congressmen who aren't running for re-election, like Rep. Will Hurd of Texas and Rep. John Shimkus of Illinois, have been more open in criticizing Trump. But Republican lawmakers stuck in the middle have been dealt a more difficult hand.\n\nIn an October 4 tweet, Sen. Mitt Romney of Utah — who has criticized Trump in the past — wrote that \"by all appearances, the President's brazen and unprecedented appeal to China and to Ukraine to investigate Joe Biden is wrong and appalling.\"\n\nThat same day, Sen. Ben Sasse of Nebraska admonished Trump for publicly calling on China to investigate Hunter Biden, saying in a statement to the Omaha World-Herald, \"Americans don't look to Chinese commies for the truth. If the Biden kid broke laws by selling his name to Beijing, that's a matter for American courts, not communist tyrants running torture camps.\"\n\nOther than Romney and Sasse, no Republican senators have forcefully condemned Trump's overtures to Ukraine or China.\n\nSen. Ron Johnson of Wisconsin said, \"I know how President [Trump] talks. That's who he is,\" in response to his pressuring Ukraine. Sen. Marco Rubio of Florida described Trump pushing China to investigate Hunter as \"not a real request.\" (Both Senators represent states where Trump's approval rating is underwater at net -11 and net -2, respectively).\n\nRead more:\n\nA Nevada Congressman is the first House Republican to support the Trump impeachment inquiry\n\nTrump is reportedly calling Mitch McConnell up to 3 times a day and raging about GOP senators he views as disloyal\n\nSenate Republicans have barely challenged Trump over Ukraine. Don't expect them to turn against him in an impeachment trial.\n\nWhat the American public thinks\n\nPublic support for the House launching an impeachment inquiry was pretty stable for most of the year, according to FiveThirtyEight's impeachment poll tracker, but it has significantly increased as details about Trump's efforts to pressure Ukraine continue spilling out.\n\nA Fox News poll last week found that a majority of US voters support impeaching Trump and removing him from office.\n\nThe apparent increase in public support for Trump's impeachment was also reflected in a Washington Post/Schar School poll earlier in October, in which a whopping 58% of American adults said they favored House Democrats' impeachment inquiry and 49% said they wanted to see Trump removed from office.\n\nSince July, Post/ABC News polling has found that support for an impeachment investigation has grown by 21 percentage points among Republicans, 25 percentage points among Democrats, and 20 percentage points among those who identify as independents.\n\nA Quinnipiac University poll published September 25 found that just 37% of Americans supported impeaching and removing Trump from office. In a poll published five days later, that number had jumped by 10 percentage points, to 47%.\n\nRead more:\n\nFamiliarity with the Ukraine scandal is rising and so is support for impeaching Trump\n\nA Fox News poll just found that more than half of American voters want Trump impeached and removed from office\n\nJust 30% of Americans say they oppose impeaching President Trump, according to a new Insider poll\n\nSwing voters are on the fence about impeaching Trump, but are more inclined to favor it,", "description": "Here's how it all started, how an impeachment inquiry could play out, and what all the key players are thinking and saying.", "authors": ["Grace Panetta"], "top_image": "https://image.businessinsider.com/5da0dd394af909219a142746?width=1200&format=jpeg", "published_at": "2019-10-14"}