{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7581893/Spain-confirms-king-make-historic-trip-Havana-Nov.html", "downloaded_at": "2019-10-16 23:44:41.961212+00:00", "title": "Spain confirms king to make historic trip to Havana in Nov", "language": "en", "text": "HAVANA, Oct 16 (Reuters) - Spain's King Felipe and Queen Letizia will visit Cuba in November for the commemoration of the 500th anniversary of the founding of Havana, Spain's Foreign Minister Josep Borrell confirmed on Wednesday during a trip to Havana.\n\nThe visit will be a welcome sign of support for Cuba which is facing increasing U.S. hostility. Spain and its former colony have improved ties in recent years within the broader normalization of relations between the European Union and Cuba.\n\nThis will be the first time a Spanish king makes an official visit to the island. Felipe's father King Juan Carlos had traveled to Cuba twice but to attend an Ibero-American summit in 2016 and the funeral of revolutionary leader Fidel Castro.\n\nCuba has sought to improve its relations with the West as it has undertaken modest reforms over the past 10 years to open up its society, modernize its centrally planned economy and attract more foreign investment.\n\nSpain is Cuba's third largest trading partner and maintains strong cultural ties with the Caribbean nation. Prime Minister Pedro Sanchez made the first official visit by a Spanish leader to Cuba in three decades last November.\n\nFormer U.S. President Barack Obama, who sought to normalize relations between the former Cold War foes, visited Havana in 2016. However, his successor Donald Trump has rowed back on the detente, tightening the decades-old U.S. trade embargo. (Reporting by Nelson Acosta; Writing by Sarah Marsh; Editing by Sandra Maler)", "description": "HAVANA, Oct 16 (Reuters) - Spain's King Felipe and Queen  Letizia will visit Cuba in November for the commemoration of the  500th anniversary of the founding...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-16"}