{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7537777/Aussie-tourist-Ryan-Webb-lost-LEG-riding-scooter-Vietnam.html", "downloaded_at": "2019-10-05 08:38:18.249113+00:00", "title": "Aussie tourist Ryan Webb almost lost his LEG while riding a scooter through Vietnam", "language": "en", "text": "An Australian tourist almost lost his leg after a scooter accident left him with a serious infection.\n\nRyan Webb, from Melbourne, was in Vietnam teaching English when he had a small scooter accident which led to an exhaust burn on his leg.\n\nThe burn didn't look too serious so the 28-year-old decided to handle the injury himself and continued work instead of seeking medical assistance.\n\nRyan Webb (pictured) got a burn on his leg after a minor scooter accident which resulted in a serious infection that saw his leg 'literally rotting away'\n\nBut as the days went on, not only did the burn not heal, it turned into an alarming infection and necrosis of his tissue.\n\nNot long after, the burn became cellulitis and soon, Ryan saw his leg slowly 'rotting away'.\n\nRyan was admitted to hospital immediately where numerous treatments and procedures were undertaken in an attempt to keep the swelling and infection under control.\n\nHowever, the infection did not respond positively and it was soon revealed that there was a very real chance of Ryan developing sepsis.\n\n'The wound in his leg literally rotted to the bone. It was at this point he was sent into surgery where they burnt off the surrounding infected tissue and sealed it within a vacuum bandage connected to a tube into a pressure pump,' Ryan's sister, Charlotte Webb, told news.com.au.\n\nThe infection did not respond positively to the numerous treatments and it was soon revealed that there was a very real chance of Ryan Webb developing sepsis\n\nShe went onto add that the experience was extremely painful for Ryan due to his asthma and low resting heart rate which meant that he was not anesthetised during the surgery.\n\n'That combined with the other cleaning/bandage changing procedures that he has endured has made this an incredibly traumatic experience that will scar him for life,' she said.\n\nMs Webb travelled to Vietnam to ensure her brother was receiving proper treatment for his injury which cost approximately $10,000.\n\nRyan was bedridden for 10 days during which his leg was connected to a pump that worked to eliminate bacteria and other harmful fluids from the burn, an experience described as 'uncomfortable' and 'debilitating'.\n\nRyan was bedridden for 10 days during which his leg was connected to a pump that worked to eliminate bacteria and other harmful fluids from the burn\n\nThe pump was removed on September 17 and Ryan was permitted to go home.\n\nThe doctors said that although the injury was improving, there was still a hole inside the wound.\n\nBut Ms Webb said Ryan is taking every day as it comes and has been feeling much more positive since the vacuum was removed.\n\nA GoFundMe page has been set up for his medical bills.", "description": "An Australian man who was on a work trip in Vietnam almost lost his leg after a scooter accident left him with a serious infection.", "authors": ["Mahnaz Angury For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/14/19297292-0-image-a-26_1570194071687.jpg", "published_at": "2019-10-04"}