{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7572387/Rugby-World-Cup-news-Josh-Adams-targets-Shane-Williams-record-World-Cup-try-haul-Wales.html", "downloaded_at": "2019-10-14 23:36:30.173770+00:00", "title": "Rugby World Cup news: Josh Adams targets Shane Williams' record World Cup try haul for Wales", "language": "en", "text": "The World Cup's top try-scorer, Wales' Josh Adams, is in record-hunting mood having fired his side into the quarter-finals.\n\nThe Cardiff Blues winger, 24, has scored five tries in four tournament matches so far - including a hat-trick against Fiji - to keep him level with Japanese flyer Kotaro Matsushima.\n\nAnd Adams now has a Welsh legend in his sights.\n\nJosh Adams has scored five tries so far in the Rugby World Cup pool stage for Wales\n\n'I was told Shane Williams is the record holder for Wales at a World Cup with six,' he said.\n\n'Fingers crossed with three more games to go hopefully I can pip him.'\n\nThe overall record could go too, if Adams continues his run and Wales go far.\n\nJonah Lomu (1999), Bryan Habana (2007) and Julian Savea (2015) all took eight in their best tournaments.\n\n'It wouldn't be bad to join that list, would it?' added Adams.\n\n'There are some legends there.'\n\nShane Williams holds the record for Wales after scoring six during the 2007 Rugby World Cup\n\nMOST TRIES SCORED Josh Adams (Wales) 5 Kotaro Matsushima (Japan) 5 Julian Montoya (Argentina) 4 Kenki Fukuoka (Japan) 4\n\nWilliams took his highest tally in 2007 - when Wales were knocked out in the Pool stages by Fiji - but the current crop are in their best shape at a World Cup since 1987, going into the knockouts unbeaten.\n\nAdams, who only made his Test debut 18 months ago, cannot wait to tear into the French on Sunday.\n\n'It's extremely exciting,' he added.\n\n'You could argue it's the biggest week of my career so far with playing in a World Cup quarter-final.\n\n'I'd never have said I'd be standing here saying that 18 months ago, but I'm over the moon to be here.\n\n'There is no reason why this group of players can't achieve something special. We've got belief in each other and in the squad.'\n\nWales might have beaten France in seven of their last eight meetings since the 2011 World Cup semi-final - only losing the infamous 100-minute Six Nations match by two points in 2017 - but they are wary of their rivals.\n\nOnly eight months ago Les Bleus were 16-0 up at half-time against Wales in Paris, before they collapsed to lose 24-19.\n\nWales recovered from 16-0 down to beat France in their Six Nations clash in February\n\n'France are renowned for being able to turn it on and when they do they're extremely dangerous.,' said Adams.\n\n'They've got some quality players. At times in this competition they've looked really, really good.\n\n'They definitely pose a threat to us without a doubt.'\n\nYoung fly-half Romain Ntamack is confident that France will show their mental fortitude\n\nFrance fly-half Romain Ntamack is determined to prove they are not flaky, though.\n\n'We start matches strongly, we have the opportunity to kill them off, but we don't and teams come back,' the 20-year-old said.\n\n'We hold back, our first-half success deserts us. We have to correct that and we'll correct it this weekend.\n\n'We had a great first half (in the Six Nations match). We put Wales in trouble.\n\n'We have to take that as our working base.\n\n'The goal is to make the same start, last 80 minutes, and if we have the chance, kill off the match.'\n\nWhile Wales have just a week between matches, France will not have played for a fortnight when the quarter-final in Oita is played on Sunday after their England match was cancelled due to Typhoon Hagibis.\n\nBut Adams said he prefers to be battle-hardened having started all four the the Pool games.\n\n'Personally playing, in a funny way, does keep me rugby tough,' the winger said.\n\n'That's helped me.'", "description": "WILL KELLEHER IN BEPPU: The World Cup's top try-scorer, Wales' Josh Adams, is in record-hunting mood having fired his side into the quarter-finals.", "authors": ["Will Kelleher For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/19/19706368-0-image-a-10_1571079561018.jpg", "published_at": "2019-10-14"}