{"pub": "nationalreview", "url": "https://today.com/parents/ad-council-psa-highlights-adopting-teens-foster-care-t165696", "downloaded_at": "2019-10-30 00:02:24.982434+00:00", "title": "AD Council PSA highlights adopting teens from foster care", "language": "en", "text": "Few teenagers are taken out of the foster care system and placed permanently into loving, adoptive homes.\n\nThat is what is being highlighted in a new series of PSAs created by the Ad Council, in partnership with the U.S. Department of Health and Human Services (HHS), Administration for Children and Families (ACF) and AdoptUSKids.\n\nTrending stories,celebrity news and all the best of TODAY. This site is protected by recaptcha Privacy Policy | Terms of Service\n\nAccording to those organizations, approximately one in five youth in the U.S. foster care system waiting to be adopted are teenagers, and since 2013 the number of teens in foster care continues to increase each year. Teens who are 15 to 17 years old wait on average twice as long for an adoptive home as children who are 14 and younger.\n\nAfter 15 years of spreading awareness about this dire issue, the campaign’s newest work uses real stories to showcase the bonds that cement a family together, and highlights some of the many important moments that make teen adoption so rewarding.\n\n“Since our campaign launched 15 years ago, we’ve helped connect more than 32,000 children with their adoptive families through AdoptUSKids.org,” Michelle Hillman, Chief Campaign Development Officer of the Ad Council, said in a statement sent to TODAY Parents. “We’re thrilled to continue this uplifting work and show prospective parents the love that can come from adopting a teen from foster care.”\n\nThe newest ad was created based on the experience of one adopted family.\n\nIn it, a teen is learning to live with his new family. Near the beginning, we see him look at the photos on a wall in the family's foyer, noticing that he isn't in any. By the end, his adoptive mom has added photos featuring him, moving him to enter the kitchen and hold his new mom in a loving and tight embrace.\n\nCue the waterworks!\n\n“In our research for this campaign we spoke to adoptive families across the country, and one theme that was consistent in their stories was an appreciation for the rewards adopting a teen from foster care brought them,” Hillman told TODAY Parents. “Directly inspired by the experiences shared by these adoptive families, we knew that showing a family building memories together and celebrating through a family photo wall would illustrate the many rewards of adopting a teen from foster care and inspire viewers to take the next step to learn more about the process themselves.”", "description": "A new Ad Council PSA shines some light on the need for loving homes to adopt teenagers from foster care.", "authors": ["Alexander Kacala"], "top_image": "https://media2.s-nbcnews.com/j/newscms/2019_43/1499496/ad-council-psa-today-main-10272019_7d7cc1d5ecf7e6bd7387bb6eaf129fea.social_share_1200x630_center.jpg", "published_at": "2019-10-28"}