{"pub": "independent", "url": "https://independent.co.uk/voices/brexit-boris-johnson-jobs-trade-north-east-peter-mandelson-a9127771.html", "downloaded_at": "2019-10-01 11:45:49.763061+00:00", "title": "Boris Johnson is blagging his way through Brexit and trivialising the jobs at stake in the North East", "language": "en", "text": "There are a number of analogies that people use when talking of Brexit but by far the most common is that it is like a divorce. It is seen as a helpful way to explain the difficulties of separation, rather bizarrely given that many of the same people that use it also said it would be the “easiest deal in history.”\n\nYet what is extraordinary about the current situation is that we have a prime minister who seems to be suggesting that yes, Brexit is like a divorce, but that the relationship upon separation will be as good as those halcyon days when you first met and fell in love.\n\nWhen commenting on the North East, Nissan and no deal on the BBC he said: “I don’t think the consequences of a no deal will be anything like as bad as you say. We can manage the just-in-time supply chains. As for tariffs I don’t think there is going to be any incentive on the part of our European friends to put tariffs on when they have a massive trade surplus with us.”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn effect Johnson is saying that nothing will change. Let’s get divorced but stay married. “Get ready” but stay as we are.\n\nEvery line of what he says is wrong and here’s why.\n\nShape Created with Sketch. ‘Brexit is like...’ The Top 20 Twitter analogies Show all 20 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. ‘Brexit is like...’ The Top 20 Twitter analogies 1/20 The Beatles \"Brexit is like Liverpool trashing all its links to The Beatles and spending all its time and energy building Esther McVey World.\" Shutterstock / terry bouch 2/20 The number seven \"Trying to understand Brexit is like trying to figure out what colour the letter seven smells like.\" Shutterstock / jgl247 3/20 Pilots \"Brexit is like being in a plane hurtling towards the ground with the pilot and co-pilot arguing over who would crash it better.\" Shutterstock / View Apart 4/20 Operation \"Brexit is like going to the doctor, being told you need an operation, agreeing to it, then finding out they are going to cut off your cock & sew it to your forhead... ...but refusing to get a 2nd opinion.\" Shutterstock / Dmytro Zinkevych 5/20 Wall \"My mentions have taught me that Brexit is like Trump’s wall. For its devoted fans it has a symbolic value totally unrelated to its workability, its true cost or the glaring self-interest of its proposers, whereas non-believers see nothing but a deranged and costly vanity project.\" Shutterstock / Tony Craddock 6/20 Skydive \"brexit is like a sitcom where at the start of the episode the main character tells a casual lie about being able to skydive to impress someone and now they're at the end of the episode in a plane about to jump\" Shutterstock / Mauricio Graiki 7/20 Crumble \"Brexit is like if Farage & Johnson said “May we make you an *amazing* apple crumble?” & then 18 months later handed you a leaking bag of maggots & offal. You shouldn’t have to eat it.\" Shutterstock / CKP1001 8/20 Punch \"‘Asking me to support Brexit is like asking me to punch my constituents in the face,’ said Anna Turley, the Labour MP for Redcar, which voted 66:34 to leave. ‘It doesn’t make it easier if you tell me my constituents want to be punched.’\" Shutterstock / ZoneCreative 9/20 Fire \"Watching this government deal with Brexit is like being locked outside your house while you can see people inside setting fire to the furniture as the law’s telling you you can’t go in and stop them.\" Shutterstock / Gorb Andrii 10/20 Villains \"Brexit is like living in a superhero movie that has no heroes, just loads of incompetent villains fighting over who is more evil.\" Shutterstock / Aisyaqilumaranas 11/20 Book \"Brexit is like a bad novel. You are so far into it you just want to skip to the end to see if it ended as badly as it had begun. (You throw the book at the wall when you realise it is the first book in a trilogy).\" Shutterstock / Stokkete 12/20 Cricket \"Watching Brexit is like trying to reverse engineer the rules of cricket by listening to the radio. I have absolutely no idea what is going on.\" Shutterstock / ChrisVanLennepPhoto 13/20 Car \"Brexit is like the UK took a motorway exit, then found the road turning into a rutted grassy track, and now the car's stuck in a muddy field, there's no help in sight, it's getting dark, everyone's shouting at the driver, and the passengers are beginning to worry about food.\" Shutterstock / Kolbakova Olga 14/20 Cable \"Watching Brexit is like watching someone try and plug a coaxial aerial cable into a HDMI port. There is a lot of anger, a lot of swearing, and a lot of remarks about how this used to work before.\" Shutterstock / Elnur 15/20 Windows \"#Brexit is like going back to Windows 3.1\" 16/20 Liars \"I'm sure most people remember a kid at school who just lied constantly? Who refused to back down, however outlandish the lie, and however it was disproven? Brexit is like all of those kids from every school have got together, and are now running the country.\" Shutterstock / chairavee laphom 17/20 Donors \"Trying to extricate ourselves from the EU, and Brexit, is like a multiple transplant patient attempting to give all the donated organs back.\" Shutterstock / Luuuusa 18/20 Electricity \"Paying my taxes to pay for Brexit is like asking a guy on death row if he has any change to put in the meter for the electric chair.\" Shutterstock / Fer Gregory 19/20 Bandersnatch \"Brexit is like watching Bandersnatch with your bae where bae is 70,000 Conservative party members hogging the PlayStation controller & choosing the most WTF option every time.! Shutterstock / George Dolgikh 20/20 Constipation \"Brexit is like the shit that never comes. Total constitutional constipation. Ironically Brexit also sounds like a constipation relief medicine.\" Shutterstock / sasha2109 1/20 The Beatles \"Brexit is like Liverpool trashing all its links to The Beatles and spending all its time and energy building Esther McVey World.\" Shutterstock / terry bouch 2/20 The number seven \"Trying to understand Brexit is like trying to figure out what colour the letter seven smells like.\" Shutterstock / jgl247 3/20 Pilots \"Brexit is like being in a plane hurtling towards the ground with the pilot and co-pilot arguing over who would crash it better.\" Shutterstock / View Apart 4/20 Operation \"Brexit is like going to the doctor, being told you need an operation, agreeing to it, then finding out they are going to cut off your cock & sew it to your forhead... ...but refusing to get a 2nd opinion.\" Shutterstock / Dmytro Zinkevych 5/20 Wall \"My mentions have taught me that Brexit is like Trump’s wall. For its devoted fans it has a symbolic value totally unrelated to its workability, its true cost or the glaring self-interest of its proposers, whereas non-believers see nothing but a deranged and costly vanity project.\" Shutterstock / Tony Craddock 6/20 Skydive \"brexit is like a sitcom where at the start of the episode the main character tells a casual lie about being able to skydive to impress someone and now they're at the end of the episode in a plane about to jump\" Shutterstock / Mauricio Graiki 7/20 Crumble \"Brexit is like if Farage & Johnson said “May we make you an *amazing* apple crumble?” & then 18 months later handed you a leaking bag of maggots & offal. You shouldn’t have to eat it.\" Shutterstock / CKP1001 8/20 Punch \"‘Asking me to support Brexit is like asking me to punch my constituents in the face,’ said Anna Turley, the Labour MP for Redcar, which voted 66:34 to leave. ‘It doesn’t make it easier if you tell me my constituents want to be punched.’\" Shutterstock / ZoneCreative 9/20 Fire \"Watching this government deal with Brexit is like being locked outside your house while you can see people inside setting fire to the furniture as the law’s telling you you can’t go in and stop them.\" Shutterstock / Gorb Andrii 10/20 Villains \"Brexit is like living in a superhero movie that has no heroes, just loads of incompetent villains fighting over who is more evil.\" Shutterstock / Aisyaqilumaranas 11/20 Book \"Brexit is like a bad novel. You are so far into it you just want to skip to the end to see if it ended as badly as it had begun. (You throw the book at the wall when you realise it is the first book in a trilogy).\" Shutterstock / Stokkete 12/20 Cricket \"Watching Brexit is like trying to reverse engineer the rules of cricket by listening to the radio. I have absolutely no idea what is going on.\" Shutterstock / ChrisVanLennepPhoto 13/20 Car \"Brexit is like the UK took a motorway exit, then found the road turning into a rutted grassy track, and now the car's stuck in a muddy field, there's no help in sight, it's getting dark, everyone's shouting at the driver, and the passengers are beginning to worry about food.\" Shutterstock / Kolbakova Olga 14/20 Cable \"Watching Brexit is like watching someone try and plug a coaxial aerial cable into a HDMI port. There is a lot of anger, a lot of swearing, and a lot of remarks about how this used to work before.\" Shutterstock / Elnur 15/20 Windows \"#Brexit is like going back to Windows 3.1\" 16/20 Liars \"I'm sure most people remember a kid at school who just lied constantly? Who refused to back down, however outlandish the lie, and however it was disproven? Brexit is like all of those kids from every school have got together, and are now running the country.\" Shutterstock / chairavee laphom 17/20 Donors \"Trying to extricate ourselves from the EU, and Brexit, is like a multiple transplant patient attempting to give all the donated organs back.\" Shutterstock / Luuuusa 18/20 Electricity \"Paying my taxes to pay for Brexit is like asking a guy on death row if he has any change to put in the meter for the electric chair.\" Shutterstock / Fer Gregory 19/20 Bandersnatch \"Brexit is like watching Bandersnatch with your bae where bae is 70,000 Conservative party members hogging the PlayStation controller & choosing the most WTF option every time.! Shutterstock / George Dolgikh 20/20 Constipation \"Brexit is like the shit that never comes. Total constitutional constipation. Ironically Brexit also sounds like a constipation relief medicine.\" Shutterstock / sasha2109\n\nTo get to no deal, Johnson would have to ignore an Act of parliament which states that if parliament has not agreed to a deal by 19 October then he must ask for an extension.\n\nSecond, for him to suggest it will not be “as bad as you say” ignores his government’s own reports which clearly state not only that the country will face widespread disruption and economic damage but that the North East of England will be worst affected due to its industry and reliance on trade with the European Union.\n\nThird, his suggestion that we can manage “just-in-time” supply chains is absolute nonsense. If he has any idea what a “just-in-time” supply chain is – he could ask anyone at Nissan – he will realise that any interruption or delay at the border means slowing or stopping production.\n\nFor a prime minister to say this is not just terrifying but also irresponsible given the jobs at stake – not just because, only this week, leaders from 23 automotive business associations in Europe said the UK’s departure from the EU without a deal would trigger a “seismic shift in trading conditions”, but because it highlights arguably one of the greatest deceits of those advocating for Brexit. That it would be “easy.”\n\nThe reality is that Brexit is a trade deal in reverse. Britain has spent nearly half a century making trade with our biggest market easier and Brexit is about putting the barriers back in place.\n\nTo suggest that we can simply do this at the stroke of midnight on 31 October without affecting critical supply chains is an absurd con. It will cost billions to the consumer and to industry. It is why Vauxhall has announced it will leave Ellesmere Port just outside Liverpool in the event of no deal, taking more than 1000 jobs with it.\n\nJohnson also said he doesn’t think there will be “any incentive on the part of our European friends to put tariffs on when they have a massive trade surplus with us.” This is rubbish.\n\nIf we leave with no deal then we will be operating under WTO rules and these mean there will be tariffs. In some sectors these are high, like those for cars and car parts at 10 per cent. For textiles and chemicals, they are higher. This will cost billions. Sectoral tariffs in the agricultural sector are highest of all.\n\nIt is also important to point out that while Johnson keeps referring to “European friends”, their goodwill will be killed stone dead if we choose to leave in the most disorderly and disruptive way imaginable.\n\nThat’s what “no deal” means. We will be leaving the club and slamming the door behind us. When you get divorced, things change.\n\nBluffing and blagging your way through as the prime minister is trying to do is the last thing Britain needs at the moment. He says all he cares about is leaving on 31 October. But the North East will be living with the results the day after and picking up the pieces for years to come. That’s why we should not act without the public having the final say in a proper vote where the real Brexit choices can be finally spelled out.\n\nLord Mandelson was European Commissioner for Trade between 2004 and 2008.", "description": "There are a number of analogies that people use when talking of Brexit but by far the most common is that it is like a divorce. It is seen as a helpful way to explain the difficulties of separation, rather bizarrely given that many of the same people that use it also said it would be the “easiest deal in history.”", "authors": ["Peter Mandelson"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/07/30/13/mandleson-1.jpg", "published_at": "2019-10-01"}