{"pub": "mirror", "url": "https://mirror.co.uk/news/world-news/cartel-uses-satanic-altar-make-20739983", "downloaded_at": "2019-10-28 02:45:36.189625+00:00", "title": "Mexican drug cartel uses 'Satanic' altar to make mobsters 'immune to bullets'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThese images show a \"Satanic\" altar allegedly used by cartel mobsters to try to make themselves \"immune to bullets\".\n\nThe sinister altar to crime is believed to contain human bones, including 40 skulls, and even a foetus in a jar.\n\nIt was found during police raids in Mexico City where 31 suspects were arrested for allegedly being members of the La Union Tepito cartel.\n\nThe altar was reportedly made with figures referring to the devil, as well as masks and mud jars containing human remains.\n\nPolice allegedly also found skulls covered with blood on the altar.\n\nA resident claimed that the members of the gang carried out Satanic rituals every three days in order to become ‘immune’ to bullets.\n\n(Image: CEN/SSC CDMX)\n\n(Image: CEN/SSC CDMX)\n\nTo the right of the altar was a painted wall full of symbols that included a pyramid topped with a hand, celestial bodies and the head of a goat with a hexagram between its horns, according to photos of the room published by local media.\n\nAuthorities are investigating in order to find out how many victims were murdered in the place, who they are and where the rest of their bodies are.\n\nA spokeswoman for the attorney general's office said authorities were still investigating the origins of the skulls, at least 42 of which had been found.\n\n(Image: CEN/SSC CDMX)\n\nInvestigators also discovered knives, 40 jawbones, the foetus and 30 leg or arm bones at the site, the office said.\n\nIt was not yet clear whether the fetus was human, the spokeswoman said.\n\nTepito, north of the capital's historic center, has long been known as a hotbed of illicit commercial activity.\n\nThe release of nearly all the suspects arrested in the raid on the warren of hidden tunnels and suspected drug laboratories in Tepito was seen as a setback to the government, which has been struggling to get a grip on chronic gang violence.", "description": "The sinister altar, found in Mexico City, contains 40 skulls and a foetus in a jar below 'Satanic' symbols", "authors": ["Ana Lacasa", "Image", "Cen Ssc Cdmx"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20739985.ece/ALTERNATES/s1200/0_PAY-CEN-SanteriaCartel-02.jpg", "published_at": "2019-10-28"}