{"pub": "businessinsider", "url": "https://businessinsider.com/woods-to-write-a-memoir-on-ups-and-downs-of-his-career-2019-10", "downloaded_at": "2019-10-16 23:15:56.268167+00:00", "title": "Woods to write a memoir on ups and downs of his career", "language": "en", "text": "FILE - In this July 16, 2019, file photo, Tiger Woods speaks at a press conference ahead of the start of the British Open golf championships at Royal Portrush in Northern Ireland. Tiger Woods is writing what he describes as his definitive story in a memoir titled \"Back.\" HarperCollins Publishers announced Tuesday, Oct. 15, 2019, it has acquired rights to the first memoir written by Woods. Still be determined is when it will be published. (AP Photo/Matt Dunham, File) Associated Press\n\nNEW YORK (AP) — Tiger Woods is writing what he describes as his definitive story in a memoir titled \"Back.\"\n\nHarperCollins Publishers announced Tuesday it has acquired rights to the first memoir written by Woods. Still be determined is when it will be published.\n\nThe memoir will cover Woods from his youth as a golf prodigy to his rise as the youngest Masters champion and the only player to hold all four major championships at the same time. It will delve into his slide from injuries and his high-profile personal issues that led to divorce, along with his comeback from four back surgeries to win the Masters at age 43 for his 15th career major.\n\nThe only other books to which Woods contributed was \"How I Play Golf\" in 2001 with the editors or Golf Digest and \"The 1997 Masters: My Story\" co-authored by Lorne Rubenstein.\n\n\"I've been in the spotlight for a long time, and because of that, there have been books and articles and TV shows about me, most filled with errors, speculative and wrong,\" Woods said. \"This book is my definitive story. It's in my words and expresses my thoughts. It describes how I feel and what's happened in my life. I've been working at it steadily, and I'm looking forward to continuing the process and creating a book that people will want to read.\"\n\nWoods, who has 81 victories on the PGA Tour and is one short of tying the career record held by Sam Snead, returns to competition next week in Japan.", "description": "NEW YORK (AP) — Tiger Woods is writing what he describes as his definitive story in a memoir titled \"Back.\"", "authors": ["Associated Press"], "top_image": "https://www.businessinsider.com/public/assets/BI/US/og-image-logo-social.png", "published_at": "2019-10-15"}