{"pub": "fox", "url": "https://foxnews.com/us/new-york-city-schools-chocolate-milk-ban", "downloaded_at": "2019-09-18 05:10:51.481566+00:00", "title": "New York City considers banning chocolate milk in public schools: report", "language": "en", "text": "Looks like the New York City school system has some beef with chocolate milk.\n\nThe city's Department of Education (DOE) is reportedly considering a ban on chocolate milk in public schools, suggesting it could serve only white milk to try and eliminate some sugar from students’ diets.\n\n\"The thinking is that these kids are already getting too much sugar, why are they getting it in their milk?’’ a DOE source told the New York Post on Sunday, adding that authorities “are discussing what to do and how to do it.\"\n\nThe U.S. Department of Agriculture (USDA) codified a rule in 2017 that allowed schools to permanently offer flavored non-fat milk as part of the National School Lunch and School Breakfast programs. New York City public schools are required to serve two milk options. They currently serve three: lowfat milk, non-fat milk and non-fat chocolate milk. New York City schools removed whole milk from public schools in 2006.\n\n“Our priority is the health and well-being of our students, and every day, we offer a variety of healthy, delicious and free meal options that exceed USDA standards,” the DOE said in a statement. “We look forward to discussing our menu with these members of Congress.”\n\nNEW YORK CITY TO ALLOW STUDENTS TO SKIP SCHOOL FOR CLIMATE PROTEST\n\nSome parents aren't thrilled about the proposal, saying it would eliminate the only source of calcium from their children's' diets.\n\n\"They prefer the chocolate milk obviously, so if that's the way you're going to get the calcium into the kids, I say go for it,” mother Lori Horsely told WCBS New York.\n\nParent Christy Milas wrote on Twitter, \"This is ridiculous. It’s not the school’s job to parent my kid. And yea I know there are a lot of crappy parents. But it’s one freakin milk. Let the kids be kids.\"\n\n“Not to be a health nazi, but it’s not the worst idea,” parent Luke Ditommasa told the Post.\n\nAnother parent pointed out online, \"It’s all sugar. Sugar isn’t healthy. It’s not the worst thing in the world.\"\n\nHowever, a New York state farmers’ organization had a cow when it heard about the district’s potential proposal.\n\nThe head of the New York Farm Bureau wrote a letter to DOE Chancellor Richard Carranza to express how the move would hurt the more than 4,000 dairy farms in the state.\n\nPIZZA, KALE, CANDY CANE FLAVORS ROLL OUT WELL BEFORE CHRISTMAS\n\n\"New York Farm Bureau appreciates that they have the best interest of students’ health at heart, but removing flavored milk is the unhealthy choice and will do a disservice to the thousands of students who depend on their school to provide a healthy, balanced diet,\" read the letter from Farm Bureau President David Fisher, according to the Democrat & Chronicle.\n\n\"While we understand the intent is to serve healthy meals to children, this ban will have the opposite effect on children who receive meals at school and the nutrients they receive, as well as substantial economic impact on New York dairy farmers that are already experiencing hardship,\" Fisher added.\n\nA group of local members of Congress also sent a letter supporting flavored milk to New York City Mayor Bill de Blasio.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“Banning flavored milk hurts our kids and our hardworking farmers,\" said Rep. Anthony Brindisi, whose district covers a large swathe of central New York. “The data shows that banning flavored milk results in less nutrients for kids, more waste in our lunchrooms, and fewer jobs for our dairy workers.”\n\nThe city Health Department says there are 20 grams of sugar – including 8 grams of added sugar – in an 8-ounce serving of chocolate skim milk, while 8 ounces of regular skim milk contains 12 grams of sugar, the Post reported.\n\nSan Francisco and Washington, D.C., are the only two school districts in the U.S. to ban flavored milk in public schools.", "description": "Looks like the New York City school system has some beef with chocolate milk.", "authors": ["Melissa Leon"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/chocolatemilkistock.jpg", "published_at": "2019-09-18"}