{"pub": "reuters", "url": "https://af.reuters.com/article/sportsNews/idAFKBN1W70GE-OZASP", "downloaded_at": "2019-09-22 15:35:21.194962+00:00", "title": "Tuilagi double leads untidy England to bonus-point win over Tonga", "language": "en", "text": "SAPPORO, Japan (Reuters) - England got their World Cup campaign off to a scrappy start in Sapporo on Sunday with a 35-3 Pool C victory over Tonga, Manu Tuilagi leading the way with two tries.\n\nFour years on from their first-round exit on home soil, England were keen to put on a commanding, clinical performance against the Pacific islanders, particularly after the All Blacks had thrashed them 92-7 in a World Cup warmup earlier this month.\n\nBut the Tongans, led by big-hitting loose forwards Sione Kalamafoni and Zane Kapeli, proved difficult to break down at the Sapporo Dome and it was only rampaging centre Tuilagi’s tries that gave England an 18-3 advantage at halftime.\n\nHis first score was down to pure power, bursting off the back of a five-metre scrum and dragging defenders with him over the line.\n\nThe second, on the half-hour mark, was a demonstration of blazing speed and intelligent timing, Tuilagi making up ground on a flying Jonny May to accept an inside pass and race clear to touch down.\n\nTuilagi’s tries were a reminder of what England have been missing over the last few years, with the 28-year-old Samoan-born centre’s career blighted by multiple injuries.\n\nEngland looked set to kick on from there but a combination of basic errors and indiscipline robbed them of momentum, with coach Eddie Jones caught on camera thumping his desk in fury after yet another mistake gifted the Tongans a penalty.\n\n“There’s a lot of mosquitoes up there, I had to whack a few,” said Jones when asked about his reaction.\n\n“Look, I get emotional, I get angry, I get excited, I get disappointed — that’s all part of coaching.”\n\nThe Australian, who guided Japan to a stunning World Cup victory over South Africa at the last World Cup, said he was proud of the way his side stuck to their task when things were not going their way.\n\n“Sometimes rugby is like that, the ball just doesn’t stick. We left a number of points out there but I was so pleased with the attitude of the players.\n\n“That’s two tests in a row we haven’t conceded a try.”\n\nLOTS TO WORK ON\n\nDespite their pressure, England had to wait until the 56th minute for their third try as hooker Jamie George went over off the back of a driving maul as Tongan legs tired.\n\nEngland somehow failed to claim their fourth score when Henry Slade failed to connect with Elliot Daly with the line at their mercy but replacement front-rower Luke Cowan-Dickie claimed the bonus point try after being sent clear by Jonathan Joseph.\n\nCaptain Owen Farrell, who kicked 15 points, was delighted to get off to a winning start.\n\n“A lot to work on, a lot to build on but to come away with a bonus point win at a World Cup is always a good start,” he said, adding that England had used the kick-and-chase tactic well to nullify Tonga’s physical threat.\n\n“Tonga are a very physical team and to give them targets to hit would be playing into their hands. I thought we chased well and got some opportunities off the back of it.\n\n“There’s still some mistakes that we can look at and get better at but that’s the exciting thing, we still have got a lot more in us.”\n\nTuilagi, wearing a Tongan shirt as he received the player-of-the-match award, said: “We knew coming into this game Tonga was going to be a tough test for us but we managed to get the five points and it’s a great start for our campaign.”\n\nEngland next face the United States in Pool C on Thursday while Tonga take on Argentina on Saturday.", "description": "England got their World Cup campaign off to a scrappy start in Sapporo on Sunday with a 35-3 Pool C victory over Tonga, Manu Tuilagi leading the way with two tries.", "authors": ["Peter Rutherford", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-22"}