{"pub": "metro", "url": "https://metro.co.uk/2019/10/19/son-sends-mum-wedding-anniversary-card-husband-died-14-years-ago-10946763", "downloaded_at": "2019-10-19 12:32:47.048385+00:00", "title": "Son sends mum wedding anniversary card from her husband who died 14 years ago", "language": "en", "text": "Joan Newell-Brown with late husband Harry, her son Joe, and her daughter, Sophie (Picture: Sophie Newell-Brown/Deadline News)\n\nJoan Newell-Brown, 59, lost her husband Harry in a car accident in 2005, just 10 months after they married.\n\nEver since, the anniversary of their wedding, 16 October, has been hard to get through. But thankfully each year Joan’s four sons and daughter help her get through it.\n\nThis year, on what would have been Joan and Harry’s 15th anniversary, their 25-year-old son, Joe, went a step further.\n\nHe decided to send his mum a wedding anniversary card as if it had been written by her late husband.\n\nJoe bought an anniversary card and worked hard to make sure his words sounded like Harry, writing: ’15 years just like that! Where has the time went?\n\n‘Happy anniversary to you darling. You know everyday I’m with you, maybe not physically but in spirit and not a day goes past that I’m not.\n\nThe card Joe sent to his mum on what would have been her 15th wedding anniversary (Picture: Sophie Newell-Brown/Deadline News)\n\n‘With how you have been and even in general. Just wow I married a soldier, you’re so strong and supporting even on your down days, but never worry as I’m always here with you through it all. You’re never alone!\n\nAdvertisement\n\nAdvertisement\n\n‘Happy 15th anniversary Joan. I love you. Harry (plus the kids) xxx..’\n\nJoe’s sister Sophie, 22, shared the card online, writing: ‘My dad passed away two months before their first wedding anniversary meaning my mum’s never received anything on their anniversary apart from us.\n\nThe post has gone viral, attracting loads of comments from people touched by the moving gesture.\n\nDemi Grant wrote: ‘Actual sobbing, that’s the nicest thing.’\n\nJoe and Sophie (Picture: Sophie Newell-Brown/Deadline News)\n\nSame, Demi.\n\nAs you’d expect, Joan had an emotional reaction to the card, too.\n\nSophie said: ‘She was always grateful to my older brothers taking care of her. Joe tried to make the day even more special for her.\n\n‘There’s no dry eyes in the house at the moment.\n\n‘His writing was very similar to dad’s so that must have been very difficult for her. She was just so thankful.’\n\nMORE: Dementia sufferer’s face lights up as she sees husband on their 72nd wedding anniversary\n\nMORE: Bride and groom who met through running replace wedding dance with a 5k\n\nMORE: Seven-year-old’s glorious drawing of wedding cake leaves mum in hysterics\n\nAdvertisement Advertisement", "description": "Joan Newell-Brown, 59, lost her husband Harry in a car accident in 2005, just 10 months after they married.", "authors": ["Ellen Scott"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_90601618_1571483053.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-19"}