{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7621499/One-man-dies-two-badly-injured-Barcelona-knife-brawl.html", "downloaded_at": "2019-10-28 13:42:52.662956+00:00", "title": "One man dies and two badly injured in Barcelona knife brawl", "language": "en", "text": "One man has died and at least two others have been seriously injured after a mass knife brawl broke out in Barcelona last night.\n\nGraphic pictures showed two men lying semi-conscious and dripping with blood at a Barcelona metro station with bloodstains along the length of the platform.\n\nTwo groups of men - suspected to be rival Pakistani gangs - had battled on the streets using an array of weapons including machetes and baseball bats.\n\nToday police confirmed they were investigating the death of a man during the violent clashes.\n\nWounded: A man wearing an FC Barcelona tracksuit lies badly injured in a pool of blood on a station platform last night after a mass knife brawl in Barcelona\n\nClashes: Two groups of men - suspected to be rival Pakistani gangs - had battled on the streets using an array of weapons including machetes and baseball bats\n\nThe brawl broke out at around 10pm last night in Badalona, a city which forms part of the Barcelona metropolitan area.\n\nThe two injured men were seen badly injured at La Sagrera underground station, one of them wearing an FC Barcelona tracksuit.\n\nA spokesman for the regional Mossos d'Esquadra force said: 'We are investigating the death of a Pakistani national last night.\n\n'The incident occurred around 10pm during a fight between a number of people in an area of Badalona known as Salut.\n\n'One of the participants in the fight died as a result of the injuries he suffered. Two other men were seriously injured.\n\n'Officers from Badalona's local police force, the Guardia Urbana, arrested nine men following the fight who are all Pakistani nationals.'\n\nLocal reports said up to 30 men are thought to have been involved in the violence which was described as a revenge attack.\n\nDamage: Blood stains the platform of La Sagrera tube station in Barcelona where one man lies injured after the brawl nearby\n\nPolice are said to be investigating whether the two rival gangs arranged the brutal fight as part of a drugs-related turf war.\n\nBadalona mayor Alex Pastor said the outbreak of violence showed that more police officers were needed.\n\nHe said: 'I'm shocked at the images from the terrible fight yesterday which has left one man dead and three people seriously injured.\n\n'Local police and Mossos [Catalan police] have acted very quickly. Thanks for your hard work.'\n\nHe later added: 'Although our police have pooled efforts and arrested nine suspects, most from Barcelona, it's vital that in Badalona we have more Mossos to help with prevention and avoid cases like this.'\n\nFormer Badalona mayor Xavier Garcia Albiol said: 'The footage is very hard-hitting. A brutal fight has ended with a murder on the streets of Badalona. I am very worried at the situation in some parts of the city.'", "description": "WARNING - GRAPHIC CONTENT: Two men were seen lying semi-conscious and dripping with blood at La Sagrera underground station in Barcelona (above) after the knife brawl last night.", "authors": ["Natalia Penza For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/11/20276532-0-image-a-24_1572262491271.jpg", "published_at": "2019-10-28"}