{"pub": "fox", "url": "https://foxnews.com/faith-values/jesus-saves-runner-nurse-minnesota-race", "downloaded_at": "2019-10-24 23:58:47.971764+00:00", "title": "Minnesota runner with ‘Jesus Saves’ bib saved by nurse named Jesus after collapsing during race", "language": "en", "text": "A Minnesota runner's bib turned out to be more prophetic than he ever could've imagined.\n\nTyler Moon, a 25-year-old General Mills customer operations specialist in the Minneapolis area, entered a 10-mile race earlier this month with a faith-filled message that turned out to be true to his life.\n\nFLORIDA TEENS STRANDED IN OCEAN SAVED BY BOAT NAMED 'AMEN' AFTER DESPERATE PRAYER FOR HELP\n\n\"So, before the race, my name was originally on the bib,\" Moon told Fox News. \"One day I got a thought -- I thought it was from God and that it should be a profession of faith -- and changed it to 'Jesus Saves,' so that another runner or someone in the audience would see it ... that Jesus saves us for eternity.\"\n\nOn race day on Oct. 6 -- a Sunday morning -- he \"felt really good\" after eating breakfast, ready to run the race in his orange Wheaties t-shirt with his bib pinned to his shorts: \"I'd been looking forward to this race for a while.\"\n\nThe former college football player, who has no history of heart trouble, was running eight-minute miles until the eighth mile, when he collapsed, cracking his head on the pavement, according to the St. Paul Pioneer Press.\n\nDALLAS TORNADO AFTERMATH: ‘CROSS OF JESUS STILL STANDS’ AFTER ROOF TORN OFF BUILDING, GIVING HOPE TO COMMUNITY\n\nThankfully, a runner named Jesus \"Jesse\" Bueno, a Lakeville registered nurse anesthetist, was right behind him and quickly helped save his life, alongside another colleague and other medical professionals, who performed chest compressions and assisted his breathing until the ambulance arrived.\n\nMoon, still adjusting after going through cardiac arrest, a concussion, and broken bones in his face, said he is grateful.\n\n“Thank you to everyone who helped me and thanks to all the runners who stopped and saved my life,\" he said. \"I believe God placed all those people there at the right time and the right place for His glory.”\n\nILLINOIS BOY, 11, BREAKS WORLD RECORD, RUNS HALF MARATHON IN ALL 50 STATES\n\nMoon's heart -- which he is set to give to Amy Greene, his fiance, in January -- is just fine.\n\nHe said his now-crumpled up bib had a message that turned out to be \"pretty fitting\" after what happened on that early October Sunday morning.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\n\"When I originally put 'Jesus Saves,' I was hoping that it would help people at the race and in Minneapolis,\" he said. \"I had no idea how far it would go and how it would impact the world ... That's just something I never expected but God's plans are way greater than anything that I could ever think of.\"\n\nNow he encourages everyone to help others just like he was helped -- big or small -- \"just to serve one another.\"", "description": "A Minnesota runner's bib turned out to be more prophetic than he ever could've imagined.", "authors": ["Caleb Parke", "Caleb Parke Is An Associate Editor For Foxnews.Com. You Can Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/TylerMoonRun2.jpg", "published_at": "2019-10-24"}