{"pub": "investing.com", "url": "https://investing.com/analysis/no-fireworks-for-mario-draghis-final-ecb-meeting-200477895", "downloaded_at": "2019-10-25 00:07:20.810930+00:00", "title": "No Fireworks For Mario Draghi's Final ECB Meeting", "language": "en", "text": "As my colleague Fawad discussed earlier in the ECB Preview, today was Mario Draghi’s final meeting as ECB President before Christine Lagarde, who attended the meeting, takes over on November 1. At the September meeting, the ECB lowered the Euro Area Deposit Rate from -0.4 to -0.5, sending rates further into negative territory. In addition, they restarted their bond buying program. Todays meeting was not expected to produce any highlights as many on the member countries were split about last month’s moves.\n\nToday’s meeting was as expected. The ECB left rates unchanged, while Draghi defended the decision to keep policy accommodative given the view of protracted weakness and downside risks, especially in light of low inflation. He said negative rates have been effective. Draghi also once again called on governments to play their part in a recovery, asking them help promote growth with sound and responsible fiscal policy. Before Draghi departure, he said he was proud that he and his colleagues always pursued the mandate of pursing inflation of just below 2%.\n\nwas unchanged immediately after the rate announcement, however had gone bid from 1.1133 to 1.1153 during the press conference as Draghi was declaring how negative rates had helped. Also, Draghi noted that there was a low likelihood of a no-deal Brexit. (Price has since treated on better US PMI data).\n\nOn a daily chart, it appears prices have room to move lower towards 1.1000 as the RSI unwinds and consolidates near the resistance at the 50% retracement level from the June 24 high to the October 1 low, near 1.1150. This level is also just below the 200-day moving average and a long term downward sloping trendline. Horizontal support comes in below 1.1062, an then the important 1.1000 level.\n\nSource: Tradingview, FOREX.com", "description": "Market Overview Analysis by Joe Perry covering: EUR/USD. Read Joe Perry's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-24"}