{"pub": "dailybeast", "url": "https://thedailybeast.com/facebook-slammed-for-including-breitbart-among-facebook-news-publishers", "downloaded_at": "2019-10-25 21:55:18.414117+00:00", "title": "Facebook Slammed for Including Breitbart Among Facebook News Publishers", "language": "en", "text": "Facebook announced Friday that it would begin testing Facebook News, its dedicated feed of links to verified news outlets. Even though publishers have long advocated for Facebook to pay them for their content, the announcement stirred up controversy over who made the cut for the platform’s latest journalism experiment.\n\nThe list of more than 200 outlets featured in Facebook News includes big names like the Wall Street Journal and the New York Times, according to Bloomberg, as well as some smaller niche news sites. It also included far right news site Breitbart News—a new detail about the program that elicited outrage.\n\nBreitbart’s historical role smuggling racist rhetoric and talking points into mainstream political discourse led many to say the site didn’t belong in a group of “Trusted Partners” tasked with serving reliable information. Breitbart is also a partner with Apple’s own editorial partnership program, Apple News.\n\n“Breitbart is not a news outlet. It is a right-wing political operation that spreads lies, foments extremism and pushes white supremacy,” Angelo Carusone, President of the left-leaning media watchdog Media Matters for America, said of the decision.\n\n“Even the Senate Press Gallery denied Breitbart permanent press credentials recognizing that it did not meet the standard of a legitimate news operation.”\n\nIn a statement, Facebook’s VP of Global News Campbell Brown described the thinking behind the project. “People want and benefit from personalized experiences on Facebook, but we know there is reporting that transcends individual experience. We want to support both.”\n\nBrown noted that its selection of partners must meet guidelines prohibiting misinformation, hate speech, and clickbait, standards established and evaluated by third-party fact checkers. The feature’s test will reach roughly 200,000 users in the U.S., according to Bloomberg, and will be available in New York, Los Angeles, Chicago, Dallas-Fort Worth, Philadelphia, Houston, Washington DC, Miami, Atlanta and Boston.\n\nFacebook News, a dedicated tab in the mobile app, will feature only links from publishers, unlike the mix of personal updates, photos, and links in the News Feed tab. Users can choose which outlets and topics to follow and link their existing paid subscriptions to the feature. A team of in-house editors at Facebook will curate a list of “Today’s Stories” surfacing top news from the day.\n\nThe company is paying some publishers between $1 million and $3 million to license their content in a structure not unlike cable news licensing. News outlets will also be able to run ads either on their own sites or via Facebook. The social networking company has had a rocky relationship with publishers in the past, and News Corp CEO Rupert Murdoch has long criticized the company for not paying news outlets for content.\n\nIn a media event Friday, News Corp CEO Robert Thomson lauded Mark Zuckerberg for the move, declaring it a “digital Damascene moment.”", "description": "Critics denounced Breitbart as a “right-wing political operation” that “foments extremism and pushes white supremacy.”", "authors": ["Blake Montgomery"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1572034943/GettyImages-1178141587_1_at9hdz", "published_at": "2019-10-25"}