{"pub": "cnbc", "url": "https://cnbc.com/2019/10/07/nabe-economists-lower-outlook-see-rising-risk-of-recession.html", "downloaded_at": "2019-10-07 23:30:48.502474+00:00", "title": "Economists lower outlook, see rising risk of recession because of Trump's trade war", "language": "en", "text": "The risk of a recession is rising, and the main threat to the economy is the Trump administration's trade war, according to a survey released Monday by the National Association for Business Economics.\n\n\"The rise in protectionism, pervasive trade policy uncertainty, and slower global growth are considered key downside risks to U.S. economic activity,\" said NABE survey chairman Gregory Daco, chief U.S. economist, Oxford Economics.\n\nA small majority of the Washington-based association of business economists also expects that the Federal Reserve will remain on hold through 2019, while 40% of the group saying they expect at least one more rate cut this year.\n\nThe results of the survey, conducted the week of Sept. 9-16, come as many analysts see warning signs in the latest U.S. economic indicators, including a plunge in manufacturing activity to more than a 10-year low in September and a sharp slowdown in service-industry growth to levels last seen in 2016. Those reports last week heightened fears the economy may be flirting with a recession.\n\nFour in 5 of the 54 NABE economists surveyed said the economy is at risk of slowing further, up from the 60% who said so in June. In their latest survey, NABE panelists said they expect real gross domestic product will continue to expand at an average rate of 2.3% this year but will slow to 1.8% in 2020. That's weaker than the group's last forecast in June.\n\nThe panel also expects industrial production to slow sharply from 4% in 2018 to just 0.9% in 2019. That represents a big downward revision from the previous estimate of 2.4% in the June survey. And the group expects corporate profits to grow just 1.7% this year, down sharply from the 4.6% forecast in June.\n\nRising pessimism about corporate profits and a wider economic slowdown have rattled the stock market. Last week, Wall Street's main indexes suffered big one-day drops after employment and manufacturing data suggested that the U.S.-China trade war is taking an increasing toll on the U.S. economy. Adding to those trade concerns, the Trump administration won approval Wednesday to slap import tariffs on $7.5 billion worth of European goods, threatening a further escalation of the trade war instigated by the White House 15 months ago.\n\nTrade policy gets much of the blame in the NABE survey, with just over half the panel citing trade as key downside risk to the economy through 2020. Worries about a slowdown have grown as the trade war with China shows signs of spilling over to the broader economy, based on weakness in key measures of the manufacturing and services sectors. The trade war has also eroded business confidence, prompting companies to pull back on investment.\n\nNABE panelists expect business investment to continue to soften through next year, with real nonresidential fixed investment forecast to rise by 2.9% in 2019 and 2.1% in 2020, more than a full point weaker than in the group's June survey.\n\nDespite the economic damage inflicted by the Trump administration's trade war, the NABE panelists don't believe the policy is succeeding in its goal of reducing the U.S. trade deficit. Instead, they see the trade gap widening significantly — from $920 billion in 2018 to $981 billion in 2019 and to $1.022 trillion in 2020.\n\nMuch of that gap, the panel said, will come from slower export growth — down from 3% in 2018 to 0.1% in 2019. That's a big drop from their June estimate for 2019 of 2.5% export growth. While the group expects the economy to maintain forward momentum for another 12 months, the odds of a recession are expected to rise next year.\n\nPanelists put the odds of an outright recession this year at just 7%, with a 24% seeing a recession starting by the middle of 2020. They put the odds of a recession starting by mid-2021 at 69%.\n\nA lot will depend on whether consumer spending, a key driver of economic growth, remains relatively strong. The NABE panel is generally counting on steady spending by households, forecasting growth of 2.6% this year, compared with 2.4% in the June survey.\n\nNext year, they expect consumer spending to rise by 2.3% in 2020, the same pace they predicted in June. Consumer spending rose 3% last year.", "description": "The main threat to the economy is the Trump administration's trade war, according to a survey of business economists.", "authors": ["John W. Schoen", "Fred Imbert"], "top_image": "https://image.cnbcfm.com/api/v1/image/106120244-1568065415906rts2pwaw.jpg?v=1568065481", "published_at": "2019-10-07"}