{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/three-suspects-nabbed-for-running-an-online-dating-scam-20191030", "downloaded_at": "2019-10-30 23:21:13.824239+00:00", "title": "Three suspects nabbed for running an online dating scam", "language": "en", "text": "Online dating can sometimes expose you to scams. (iStock)\n\nThree suspects have been arrested and have appeared in court for allegedly running an online dating scam.\n\nThe three allegedly lured a 54-year-old victim into believing that she had met a businessman online and are further alleged to have fleeced her out of money \"to help the online lover overcome business related challenges\".\n\nPolice spokesperson Lieutenant Colonel Philani Nkwalase said Gcobisa Sintu, 33 and Tando Magwevana, 34, have since appeared in the Port Elizabeth and East London magistrates courts on October 25 and 26, soon after they were arrested.\n\n\"They were allegedly linked to a syndicate that operated an online dating scam over a period between 2017 and 2018. It is alleged that the syndicate lured a 54-year-old unsuspecting victim, who was made to believe that she met a successful businessman and developed a relationship.\n\n\"The victim was further tricked into offering money to help the online lover to overcome business related challenges, with the hope that the money was going to be paid back,\" said Nkwalase.\n\nLuyanda Bacela, 32, also linked to this incident, was arrested in Belhar, Cape Town on October 15, after a warrant of arrest was issued against her.\n\nShe appeared at the Specialised Commercial Crimes Court in Bellville on October 16, facing charges of fraud worth R844 000.\n\nIt is unclear if this amount is linked to only the 54-year-old victim.\n\nBacela is currently out on R5 000 bail and will be back in court on November 11.\n\nMeanwhile, Sintu was released on a warning and is expected to appear alongside Bacela, while Magwevana is due to appear in the Specialised Commercial Crimes Court in Bellville on November 6.", "description": "Three suspects have been arrested and have appeared in court for allegedly running an online dating scam.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7926/14231ddd19384098843c6919842a7eef.jpg", "published_at": "2019-10-30"}