{"pub": "dailybeast", "url": "https://statepress.com/article/2019/09/sppolitics-mccain-head-steps-down", "downloaded_at": "2019-09-28 10:19:39.008881+00:00", "title": "McCain Institute head Kurt Volker steps down as US diplomat", "language": "en", "text": "Volker's resignation comes amid reports that he was involved in the Trump-Ukraine investigation\n\nPhoto by Stella Atzenweiler | The State Press Graphic published on Thursday, Aug. 23, 2018.\n\nBy Andrew Howard | 12 hours ago\n\nExecutive Director of the McCain Institute Kurt Volker resigned from his position as the U.S. Special Envoy for Ukraine Friday, following reports he collaborated with Ukraine and President Donald Trump.\n\nAn ASU official confirmed Volker's resignation Friday, and said the University could not speak about his future at ASU because the University does not comment on personnel matters.\n\nVolker met with U.S. Secretary of State Mike Pompeo Friday to announce he would be resigning, the official said.\n\nVolker’s name was mentioned in the recent whistleblower complaint, which has sparked an impeachment inquiry for Trump. Trump has defended his actions, including a phone call with Ukraine President Volodymyr Zelensky where Trump requested dirt on former Vice President Joe Biden.\n\nIf that perfect phone call with the President of Ukraine Isn't considered appropriate, then no future President can EVER again speak to another foreign leader! — Donald J. Trump (@realDonaldTrump) September 27, 2019\n\nThe complaint details that Trump told his staff to cut aid to Ukraine unless they helped find information on presidential candidate Biden's son, Hunter Biden.\n\nAccording to the complaint, Volker helped organize meetings with Trump lawyer Rudy Giuliani and Ukrainian officials.\n\nThe complaint also alleges that Volker went to Kiev, the capital of Ukraine, to help guide Ukraine officials on how to handle Trumps’s demands.\n\nEditor's Note: This is a breaking story and will be updated as more information becomes available.\n\nReach the reporter at ajhowar6@asu.edu and follow @andrew_howard4 on Twitter.\n\nLike The State Press on Facebook and follow @statepress on Twitter.\n\nRelated Stories", "description": "Volker resigned from his role as a U.S. Diplomat after his ties to the Trump-Ukraine investigation.", "authors": [], "top_image": "https://snworksceo.imgix.net/asp/86f8625c-8345-4540-bbc8-35616ed242be.sized-1000x1000.jpg?w=800&h=600", "published_at": "2019-09-27"}