{"pub": "breitbart", "url": "https://breitbart.com/border/2019/10/17/tijuana-six-burned-murder-victims-discovered-in-nine-hours", "downloaded_at": "2019-10-18 01:05:08.078160+00:00", "title": "Tijuana: Six Burned Murder Victims Discovered in Nine Hours", "language": "en", "text": "Six badly burned murder victims were discovered in a nine-hour time span earlier this week in Tijuana.\n\nThe first discovery occurred during the early morning hours of Wednesday, according to local reports. Investigators and emergency fire personnel responded to Lienzo Charro del Cañón del Padre Street and located a torched panel truck and a badly burned presumed murder victim. At approximately 4am, emergency personnel responded to a house fire in colonia Cañón del Padre. Four burned murder victims were found inside the smoldering residence. Investigative personnel assigned to the state attorney general’s office located several 9 mm shell casings at the scene.\n\nThe next discovery occurred at approximately 10am in colonia Matamoros. A victim was found inside an abandoned structure. Unknown suspects torched the building before escaping.\n\nAs of Wednesday, the total number of homicides registered in Tijuana stood at 1,790 for 2019. Eighty-one of those happened in October.\n\nThe record-breaking cartel violence continues despite the federal government’s surge of military and police assets to the region since the end of 2018. The bloodshed is generally related to turf wars involving Cártel Tijuana Nueva Generación (CTNG), aligned with El Cártel de Jalisco Nueva Generación, against the Sinaloa Cartel. In some areas, rival factions within the Sinaloa Cartel are fighting for control of the lucrative street-level markets and smuggling routes into the United States. Those involved in the killings are primarily low-level dealers, lookouts, customers, and enforcers. Many of the street-level dealers are targets of rip-crews looking for cash and drugs.\n\nRobert Arce is a retired Phoenix Police detective with extensive experience working Mexican organized crime and street gangs. Arce completed work assignments in the Balkans, Iraq, Haiti, and recently completed a three-year tour in Monterrey, Mexico, for the U.S. Department of State, International Narcotics and Law Enforcement Program. As the Regional Program Manager for Northeast Mexico in charge of the Mexican states of Coahuila, Tamaulipas, Nuevo Leon, Durango, San Luis Potosi, Zacatecas) You can follow him on Twitter or reach him at robertrarce@gmail.com.", "description": "Six badly burned murder victims were discovered in a nine-hour time span earlier this week in Tijuana.", "authors": ["Robert Arce"], "top_image": "https://media.breitbart.com/media/2019/01/AP_110107132455.jpg", "published_at": "2019-10-17"}