{"pub": "guardian", "url": "https://theguardian.com/business/2019/sep/30/forever-21-global-fast-fashion-retailer-files-for-bankruptcy", "downloaded_at": "2019-09-30 04:04:39.163348+00:00", "title": "Forever 21, global fast fashion retailer, files for bankruptcy", "language": "en", "text": "Fashion retailer Forever 21 has filed for Chapter 11 bankruptcy, joining a growing list of bricks-and-mortar players who have failed to navigate the shift towards online shopping.\n\nSince the start of 2017, more than 20 US retailers, including Sears Holdings Corp and Toys ‘R’ Us, have filed for bankruptcy as more customers shift to online retailers such as Amazon.\n\nFounded in 1984, Forever 21 has 815 stores in 57 countries. Last week, the fast fashion retailer said it would exit Japan and close all 14 stores at the end of October. The company plans to close most of its locations in Asia and Europe, but will continue to operate in Mexico and Latin America.\n\nNumber of empty shops in UK at highest level for five years Read more\n\nThe company lists both assets and liabilities in the range of $1bn to $10bn, according to the court filing in the US bankruptcy court for the district of Delaware.\n\nThe retailer said it received $275m in financing from its existing lenders with JPMorgan Chase Bank as agent, and $75m in new capital from TPG Sixth Street Partners, and some of its affiliated funds.\n\nWith these funds, Forever 21 said it intended to operate business as usual and would focus on the profitable core part of its operations.", "description": "Struggling empire is the latest bricks-and-mortar outfit to suffer as shopping moves online", "authors": [], "top_image": "https://i.guim.co.uk/img/media/5844e4f0cc8307261764959ea3dda96bc491eca7/0_84_3500_2101/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=86aa7eb234fdd8e2b6ab51b34dac426e", "published_at": "2019-09-30"}