{"pub": "breitbart", "url": "https://breitbart.com/news/scientists-find-two-new-species-of-giant-parasitic-wasps-in-uganda", "downloaded_at": "2019-10-09 10:49:22.108447+00:00", "title": "Scientists find two new species of giant parasitic wasps in Uganda", "language": "en", "text": "Oct. 9 (UPI) — Finnish researchers conducting field studies in Africa have discovered two new species of giant parasitic wasps.\n\nThe discovery, described this week in the journal ZooKeys, suggests the group of insects known as Afrotropical rhyssine wasps is more diverse than previously thought.\n\nThe largest rhyssine wasp species can grow to lengths of 10 centimeters — nearly 4 inches. The parasitic species lay their eggs inside the larvae of other wasps and beetles that harvest rotting wood.\n\nUntil now, everything that scientists knew about the group of insects in the Afrotropical region was based on just 30 specimens.\n\n“A good example of how poorly tropical rhyssines are known is the species Epirhyssa overlaeti, which is the largest African rhyssine,” lead researcher Tapani Hopkins, a doctoral student at the University of Turku in Finland, said in a news release. “Only two females were known before, one collected in the 1930s in the Congo and the other one in Cameroon in the 1980s. Now, at one single Ugandan site, we found large numbers of both females and males. This completely changed what is known of the distribution of the species.”\n\nDuring their survey in Uganda’s Kibale National Park, researchers collected 456 rhyssine wasp specimens. Until now, some scientists characterized tropical rhyssines as species-poor. But the latest research suggests that designation was based on poor sampling — not an actual lack of species.\n\nIn addition to describing two new parasitic wasp species, Epirhyssa johanna and E. quagga, scientists collected dozens of specimens belonging to ten previously described species.\n\nLike their relatives, both of the new species use a long ovipositor to drill through wood and stab their victims before injecting them with fresh eggs.\n\n“We named one of the new species Epirhyssa quagga, because its colouration resembles that of a zebra,” Hopkins said. “The other species became Epirhyssa johanna. The name Johanna refers to my wife.”\n\nHopkins and company previously surveyed tropical rhyssine diversity in South America.\n\n“In our Amazonian research, we have described ten large-sized South-American species new to science and our understanding of the diversity of South American tropical rainforest parasitoid wasps has changed,” said Turku researcher Ilari Sääksjärvi. “Extending the research to the African continent is important, because our goal is to understand the global diversity of the parasitoid insects which are extremely species rich.”", "description": "Oct. 9 (UPI) — Finnish researchers conducting field studies in Africa have discovered two new species of giant parasitic wasps. The discovery,", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-09"}