{"pub": "metro", "url": "https://metro.co.uk/2019/10/28/diablo-4-confirmed-official-art-book-blizzcon-2019-reveal-expected-10995704", "downloaded_at": "2019-10-28 09:50:34.618734+00:00", "title": "Diablo 4 confirmed again in official art book, BlizzCon 2019 reveal expected", "language": "en", "text": "Diablo 4 – it’s going to be a very busy BlizzCon this year\n\nIt’s not just Overwatch 2 that’s likely to be unveiled this week but also Diablo 4 at BlizzCon, guest starring Lilith.\n\nAfter years of waiting it now seems likely that fans are only a few days away from an official reveal of both Overwatch 2 and Diablo 4, as more details leak from an upcoming artbook.\n\nThe game’s name was already namechecked in a listing for the book on Amazon, but a new preview leaked by fans clearly mentions the game as if it’s something everyone already knows about.\n\nAlongside an image and description of returning character Lilith a line in the book reads, ‘Lilith’s debut in Diablo IV is a reimagining of her form that is far different from her previous appearance’.\n\nAlthough there’s nothing to link the book directly to BlizzCon, it can hardly be a coincidence that it’s being released now. Especially as there are also rumours that a remaster of Diablo II will be announced as well.\n\nAdvertisement\n\nAdvertisement\n\nBlizzard has never formally announced Diablo 4 but they’ve certainly not been shy about admitting they’re working on it, especially after all the backlash from Diablo Immortal at last year’s BlizzCon.\n\nThey’ve far more than just that to make up for now though, following fan fury over their handling of a Hong Kong pro-democracy supporter at a recent Hearthstone tournament.\n\nThat’s going to ensure, for various reasons, a very interesting BlizzCon this weekend, when the fan convention starts on Friday, 1 November.\n\nEmail gamecentral@ukmetro.co.uk, leave a comment below, and follow us on Twitter\n\nMORE: Diablo 4 leaked by German artbook, Diablo 2 remaster rumoured\n\nMORE: Diablo 1 available on GOG.com as more Blizzard classics planned\n\nMORE: Blizzard denies it cut plans to show Diablo 4 at Blizzcon", "description": "It’s not just Overwatch 2 that’s likely to be unveiled this week but also Diablo 4 at BlizzCon, guest starring Lilith.", "authors": [], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/EH1iWYsW4Ak7f7N-f7e3_1572255022.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-28"}