{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/lesufi-plans-to-introduce-grade-r-at-gauteng-schools-by-2024-20190731", "downloaded_at": "2019-10-05 11:43:21.681512+00:00", "title": "Lesufi plans to introduce Grade R at Gauteng schools by 2024", "language": "en", "text": "Gauteng Education MEC Panyaza Lesufi intends to change Early Childhood Development by implementing Grade R at schools across the province by 2024, and moving towards introducing Grade RR at a later stage.\n\n\"Gauteng is committed to improving early childhood development, and more children are accessing this crucial building block of learning. Investment in Early Childhood Development (ECD) is well-documented to be one of the most effective, long-term strategies for poverty eradication.\n\n\"Children learn the skills that will help them flourish, early in life, when the brain has the maximum capacity to develop. Across government policies, ECD is a national priority programme included to support the principle of investment in young children,\" Lesufi said.\n\nThe MEC was delivering his midterm expenditure framework for the 2019/20 year in the Gauteng legislature on Wednesday.\n\nLesufi said he aimed to achieve quality education in the province through five strategic goals:\n\nEarly Childhood Development, which will focus on Grade R universalisation, and begin the preparations for the introduction of Grade RR;\n\nPromote quality education across all classrooms and schools, with a focus on building foundations in the early grades, \"defending the crown\" at Grade 12, promoting a modern skills-based curriculum and the multi-certification of learners;\n\nCreate safe schools, that will embody social cohesion, patriotism and non-violence;\n\nChange the education landscape to accelerate relevant and quality learning, though twinning and resource optimisation, and new school infrastructure;\n\nTo address the needs of Gauteng youth through development programmes and increasing youth employability.\n\nALSO READ: Panyaza Lesufi to move early childhood development centres to his department\n\nLeufi presented a budget of R49.2bn to fund the realisation of these goals.\n\n\"Despite the tough economic conditions facing the country, the provincial education budget has seen above inflation growth. The department’s total budget for the 2019/20 financial year amounts to R49.2bn,\" Lesufi said.\n\nThis budget was anticipated to grow at an average annual rate of 8.4% over the medium-term.\n\n\"This shows the commitment of the ANC government to education as a national priority,\" Lesufi added.\n\nApproximately 4.9% (R2.4bn) of the budget comes through conditional grants, the Education Infrastructure Grant (58%), and the National School Nutrition Programme (35%).\n\nThe bulk of the budget (75% or R37.3bn) would be spent on the compensation of employees.\n\n\"This equals an increase of 10.8% or R3,6bn from 2018/19 financial year. This increase is mainly attributed to the filling of all key vacant posts and providing for inflation related salary increases,\" Lesufi explained.\n\nGET THE NEWS at your fingertips and download the News24 app for Android here now. Get it for your iPhone here.\n\nKEEP UPDATED on the latest news by subscribing to our FREE newsletter.\n\n- FOLLOW News24 on Twitter", "description": "Gauteng Education MEC Panyaza Lesufi intends to change Early Childhood Development by implementing Grade R at schools across the province by 2024.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7923/852fbbc4b5a84e04953fafbe0c40b152.jpg", "published_at": "2019-07-31"}