{"pub": "investing.com", "url": "https://investing.com/news/stock-market-news/daimler-recalls-hundreds-of-thousands-of-mercedesbenz-diesel-vehicles-1995312", "downloaded_at": "2019-10-12 06:56:55.474245+00:00", "title": "Daimler recalls hundreds of thousands of Mercedes-Benz diesel vehicles", "language": "en", "text": "© Reuters. File photo of Mercedes-Benz logo pictured before company's annual news conference in Stuttgart\n\nBy Ludwig Burger\n\nFRANKFURT (Reuters) - German carmaker Daimler is recalling hundreds of thousands of Mercedes-Benz vehicles including Sprinter van models over diesel emissions issues.\n\nDaimler said late on Friday that Germany's road traffic regulator KBA has concluded hearings over certain Mercedes-Benz vehicles with so-called OM651 diesel engines meeting Euro 5 emission standards and has ordered Daimler to carry out recalls.\n\nWeekly Bild am Sonntag on Sunday reported a recall of Mercedes-Benz Sprinter vehicles was imminent after KBA warned the luxury carmaker that the transporter vans may contain illegal engine management software.\n\n\"Mercedes-Benz customers will be notified in writing over further actions if their vehicle is subject to the recall and a software update can be installed,\" the company said.\n\nDaimler said a \"medium six figure\" number of vehicles would be affected by the recall, including 260,000 Sprinter vans from a previous generation of vehicles that went out of production in 2016, and that it was fully cooperating with the regulator.\n\nKBA proceedings with regard to engine control functionality were far advanced but not yet concluded, it said. More orders from the regulator could therefore not be ruled out.\n\nEarnings would not be further affected by the KBA proceedings, it added.\n\nIn June, Daimler issued a profit warning and announced an increase of legal provisions by a high three-digit million euros amount, to cover various ongoing governmental proceedings and measures relating to diesel vehicles.", "description": "Daimler recalls hundreds of thousands of Mercedes-Benz diesel vehicles", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF9A1ZJ_L.jpg", "published_at": "2019-10-12"}