{"pub": "euronews", "url": "https://euronews.com/2019/10/23/the-death-knell-is-ringing-for-the-un-we-can-t-let-this-beacon-of-hope-die-without-a-fight", "downloaded_at": "2019-10-23 15:07:09.696335+00:00", "title": "The death knell is ringing for the UN. We can’t let this beacon of hope die without a fight ǀ View", "language": "en", "text": "24 October is celebrated every year as UN Day, because it was on this day in 1945 that the United Nations Charter entered into force. The charter, the closest we have to a constitutional document for the whole world, is an international treaty that the victors of the Second World War agreed to abide by to ensure peace and prosperity in the post-war period. It bears the strong imprint of the most powerful state since that time, the USA, which is a permanent member of the UN Security Council with veto power, along with China, Russia, France and the UK.\n\nThis year, the UN turns 74 years old, quite a respectable age. Looking back, we can credit the organisation, and the system of multilateral cooperation built around it, with the avoidance of another major war, that is, in spite of the Cold War confrontation and peripheral conflicts still happening all around. Not that these wars haven’t killed, maimed, displaced or otherwise destroyed the lives of millions of innocent people, but at least we have not had a direct confrontation between superpowers with nuclear weapons, which could mean the end of the world as we know it. We should also acknowledge significant progress in advancing human rights, fighting poverty and disease, improving the lives of billions. The world is far from perfect but it could have been worse if the UN did not exist for the last 74 years. That, at least, we can grant to the UN.\n\nWhen I was working at the UN’s headquarters in New York in the 2000s, I remember strongly the emotional appeal of UN Day and of the UN flag as I entered the UN premises. Looking at the sky-blue flag with the map of the world on it, I felt very privileged to be working for humanity as a whole and for our planet. I remember thinking how lucky I was to have been given this privilege and to be paid for it, as I would be willing to volunteer and live on bread and olives, as we say in Greece, just to be able to do this.\n\nThe UN may well be dying, becoming increasingly distant and irrelevant. What is far more serious, though, is that the common good of humanity that the UN was created to represent - the framework of legal rules and ethical principles that should govern the conduct of human affairs at all levels - may be dying with it, too. Georgios Kostakos Executive Director of the Foundation for Global Governance and Sustainability (FOGGS)\n\nUnlike Europe Day, when the European institutions close down for their staff to celebrate a day off with their families, UN Day is a working day for the UN. I remember that UN management asked for volunteers to spend the day (or another day during the same week) with students in the broader New York area. Once, I went to a corner of Brooklyn that I had never been to before, in what looked like a rather rough area where the school was protected with fences and gun checks at the entrance. That did not deter me, of course, as I had survived UN missions to post-war Bosnia, and to South Africa; Mexico and Haiti during their own tense moments in the 1990s.\n\nAfter the first awkward moments, though, and after some tough questions from the students that elicited some honest answers from my side, a human connection was established. I could feel that we had all started to talk about our one and only world, its problems but also its promise, what the UN did and should do better, and what each one of us, young and old, black and white, American or other nationality, should do to make this planet a better place.\n\nI wish we could have such a discussion engaging the whole global village, all seven-and-a-half billion of human beings populating Earth at this point. It is not easy but, if you think about it, it should not be impossible either, with the electronic means that we possess today, social media and also on. For many, the UN is a non-entity, useless or even worse, a tool in the hands of the big powers for global domination. For others, it’s just a group of endlessly quarrelling diplomats and of soft-spoken international civil servants, who basically what they care the most about is their salaries and privileges.\n\nMany would have bad things to say about the record of the UN; from its failure to stop the US invasion of Iraq in 2003 to not averting the collapse of Libya, being unable to prevent or end the war in Syria and allowing the Israeli-Palestinian conflict to go on forever, to not halting the deterioration of the situation in Venezuela and not being able to stop incidents of sexual exploitation and abuse by UN peacekeepers, being unable to tackle climate change, the refugee and migration issues, and so on.\n\nFor me, the UN today is a reflection of the state of our world: full of big promises but bursting at the seams. Its best days are getting all the more distant and there is something brewing that won’t be good for its future. Under pressure from authoritarian and populist leaders the world over, the UN is treading cautiously, with its Secretary-General trying not to upset too many of those who pay for the organisation’s expenses, especially the US.\n\nIt is ironic that this month, when its anniversary is celebrated, the UN may not be able to pay its staff because of the non-payment of contributions by several rich UN member states. One may be justified to think that salaries should be cut or staff reduced in a bloated bureaucracy. That, however, should be done in an organised way and with a vision of a better future guiding it, not haphazardly out of lack of funds that have been promised by countries.\n\nThe UN may well be dying, becoming increasingly distant and irrelevant. What is far more serious, though, is that the common good of humanity that the UN was created to represent, the framework of legal rules and ethical principles that should govern the conduct of human affairs at all levels, may be dying with it, too. The current state of a world increasingly dominated by strongmen who take the liberty to act unilaterally, without consultation, ignoring rules and borders would be very sad, if it was not first and foremost extremely dangerous.\n\nOne would expect the UN and its Secretary-General to speak truth to power, and to engage and inspire all of the world’s citizens. Shying away from these fundamental functions, as seems to be the case these days, just depletes further the already very low political and moral capital of the organisation and leaves it completely at the mercy of its most powerful members and their rudderless leaders.\n\nThe UN needs to reclaim its soul before it is too late, and really focus on the major challenges that are facing humanity today; not just climate change but also food and water security, inequality, the new global cyber-commons, the promises and threats of cutting-edge technologies. As it has started doing with the Sustainable Development Goals (SDGs), which are beginning to galvanise action for improving the condition of people and planet, the UN needs to articulate a vision of a future that is worth living for all human beings, a narrative of inclusiveness and hope, of shared well-being. This is the only way for the UN to justify its continued existence and earn again the support of citizens around the world.\n\nGeorgios Kostakos is Executive Director of the Brussels-based Foundation for Global Governance and Sustainability (FOGGS). He has been extensively involved in global governance, sustainability and climate-related activities with the United Nations and beyond. One of FOGGS’ projects is the UN2100 Initiative for UN reform\n\n____________\n\nAre you a recognised expert in your field? At Euronews, we believe all views matter. Contact us at view@euronews.com to send pitches or submissions and be part of the conversation.", "description": "As the UN turns 74 this week, we can look back on its legacy and credit the organisation, and the system of multilateral cooperation built around it, with the avoidance of major wars. But do its recent failures spell the demise for the UN?", "authors": ["Georgios Kostakos", "Executive Director Of The Foundation For Global Governance", "Sustainability", "Foggs"], "top_image": "https://static.euronews.com/articles/stories/04/25/05/16/1000x563_cmsv2_7c52ebe9-3697-5539-9f65-178552bcb959-4250516.jpg", "published_at": "2019-10-23"}