{"pub": "cnbc", "url": "https://cnbc.com/2019/10/24/vice-president-mike-pence-says-nba-acting-like-subsidiary-of-china.html", "downloaded_at": "2019-10-25 00:42:28.171507+00:00", "title": "Vice President Mike Pence says 'NBA is acting like a wholly owned subsidiary' of China's Communist Party, also blasts Nike", "language": "en", "text": "Vice President Mike Pence on Thursday accused the NBA of \"acting like a wholly owned subsidiary\" of China's ruling Communist Party after a top Houston Rockets executive enraged that country's authoritarian leaders with his support of anti-government protestors in Hong Kong.\n\nPence in a speech also blasted athletic apparel giant Nike for taking steps to placate China by \"checking its social conscience at the door\" after the tweet in early October by Rockets general manager Daryl Morey, which said, \"Fight for Freedom, stand with Hong Kong.\"\n\nPence's criticism of the National Basketball Association during an appearance at The Wilson Center in Washington, D.C., was the harshest from the Trump administration since the pro league effectively apologized for Morey's tweet.\n\nAn NBA spokesman said after the tweet that Morey's views \"have deeply offended many of our friends and fans in China, which is regrettable.\"\n\nPresident Donald Trump previously accused NBA coaches of \"pandering\" to China. Secretary of State Mike Pompeo on Monday said it is \"completely inappropriate\" for China to retaliate against U.S. businesses whose employees have commented on anti-government protests in Hong Kong.\n\nChina is one of the NBA's biggest markets. On the heels of Morey's tweet, nearly all of the NBA's Chinese partners ended or suspended their relationships with the league.\n\n\"Some of the NBA's biggest players and owners, who routinely exercise their freedom to criticize this country, lose their voices when it comes to the freedom and rights of other peoples,\" Pence said in his speech.\n\n\"In siding with the Chinese Communist Party and silencing free speech, the NBA is acting like a wholly owned subsidiary of the authoritarian regime,\" the vice president said.\n\nPence also said, \"Nike promotes itself as a so called social-justice champion, but when it comes to Hong Kong, it prefers checking its social conscience at the door.\"\n\n\"Nike stores in China actually removed their Houston Rockets merchandise from their shelves to join the Chinese government in protest against the Rockets general manager's seven-word tweet: 'Fight for Freedom, stand with Hong Kong.'\"\n\nThe NBA and Nike had no immediate comment when contacted by CNBC.\n\n— Additional reporting by CNBC's Jacob Pramuk and Lauren Thomas", "description": "\"Some of the NBA's biggest players and owners, who routinely exercise their freedom to criticize this country, lose their voices when it comes to the freedom and rights of other peoples,\" Pence said in a speech.", "authors": ["Dan Mangan"], "top_image": "https://image.cnbcfm.com/api/v1/image/106201616-1571932896958gettyimages-1177500545.jpeg?v=1571932923", "published_at": "2019-10-24"}