{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/3/pro-life-pro-choice-doctors-spar-over-medical-nece", "downloaded_at": "2019-10-04 01:22:03.895253+00:00", "published_at": "2019-10-03", "title": "Pro-life, pro-choice doctors spar over medical necessity of abortion", "language": "en", "text": "Pro-choice and pro-life gynecologists are arguing over whether abortion is ever necessary to save a pregnant person’s life.\n\nPro-life doctors say that “errors and assumptions” have distorted a recent statement from the American College of Obstetricians and Gynecologists about the medical need for some abortions.\n\n“We state unequivocally that there is a difference between elective abortion — a procedure done to ensure that a baby is born dead — and the separation of the mother and the baby in order to save the life of the mother,” Drs. Donna J. Harrison, executive director of the American Association of Pro-Life Obstetricians and Gynecologists; Mike Chupp, CEO of Christian Medical Dental Association; and Michelle Cretella, executive director of American College of Pediatricians said Wednesday in a statement.\n\nThe statement comes a week after officials with the American College of Obstetricians and Gynecologists and the Physicians for Reproductive Health — both supporters of abortion rights — declared in a Sept. 25 statement that abortions “can be medically necessary,” citing complications such as renal and cardiac failure that necessitate terminating a pregnancy.\n\n“As physicians, we are focused on protecting the health and lives of the patients for whom we provide care. Without question, abortion can be medically necessary,” the statement reads.\n\nThe medical conflict erupted after Facebook this summer removed two videos posted by Live Action, saying the pro-life advocacy group’s claim that abortion is never necessary was misleading.\n\nFacebook also notified Live Action President Lila Rose that her page and any of her links would have “reduced distribution and other restrictions because of repeated sharing of false news,” according to a message from Facebook officials to Live Action posted online.\n\nBefore being pulled, the videos made by Ms. Rose — who is not a medical doctor — had received 6,000 shares and was trending, according to Facebook’s data.\n\nFacebook’s action evoked public outcry from the pro-life community amid echoed calls that the social media giant is biased against conservatives.\n\nSen. Josh Hawley, Missouri Republican, tweeted that Facebook CEO Mark Zuckerberg, in a private conversation, admitted there “clearly was bias” in his firm’s editorial decision and promised an internal review.\n\nHowever, on Sept. 27, after an external review of Facebook’s internal fact-checking mechanism, the International Fact-Checking Network — a Poynter Institute-associated fact-checking organization — issued a decision that Facebook’s fact-checkers had made the correct decision.\n\n“Science Feedback’s conclusion appears sound and fair, based on the best evidence,” wrote Sarphan Uzunoglu, an assistant professor of multimedia journalism at Lebanese American University.\n\nMr. Uzunoglu “has never taken ‘pro-choice’ or ‘pro-life’ advocacy positions,” said the International Fact-Checking Network.\n\nThe initial decision to rule Live Action’s claim on Facebook about the medical necessity of abortions resulted from an audit by two pro-choice obstetricians with Health Feedback, an arm of Science Feedback, the organization Facebook has hired to sort out the truthfulness of claims.\n\nIn their summary, Drs. Daniel Grossman and Robyn Schickler wrote: “Physicians who evaluated this claim found it to be inaccurate.”\n\nHowever, at that time, Dr. Grossman had served on the board of directors of NARAL Pro-Choice America Foundation and Dr. Schickler was affiliated with Physicians for Reproductive Health (PRH).\n\nIn his assessment, Mr. Uzunoglu also wrote that Science Feedback’s decision to use two doctors with pro-choice ties to vet a pro-life group’s messaging “shows no evidence of bias in the selection process.”\n\nInternational Fact-Checking Network officials faulted Science Feedback for not initially identifying the affiliations of Drs. Grossman and Schickler, saying such lack of transparency “fell short of the standards required of IFCN signatories.” But the network said the information used to call Ms. Rose’s claim false was “based on publicly available scientific evidence.”\n\nOn Wednesday, the pro-life doctors pointed out that 85% of OB/GYNs do not perform abortions and called ACOG’s pro-choice advocacy “extreme.”\n\n“We are glad that ACOG and PRH leadership recognize what all pro-life obstetricians know — that sometimes treatments which result in the separation of the mother and the baby are necessary to save the mother’s life,” said Drs. Harrison, Chupp and Cretella. “However, ACOG and PRH leadership disingenuously imply in their statement that these life saving procedures are the same as elective abortions.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Pro-choice and pro-life gynecologists are arguing over whether abortion is ever necessary to save a pregnant person's life.", "authors": ["The Washington Times Http", "Christopher Vondracek"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/03/103_2019_abortion-tennessee8201_c0-273-6532-4081_s1770x1032.jpg?7a6e9f0c32e647d02893e0ed1f5845212b0e5ef8"}