{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7621699/Vietnamese-woman-claims-15-year-old-brother-youngest-victim-migrant-truck-tragedy.html", "downloaded_at": "2019-10-28 23:37:00.828071+00:00", "title": "Vietnamese woman claims 15-year-old brother is the 'youngest victim' of migrant truck tragedy", "language": "en", "text": "Advertisement\n\nThe older sister of a 15-year-old Vietnamese boy fears he froze to death while being trafficked to Britain to be reunited with his parents.\n\nTeenager Nguyen Huy Hung would be the youngest victim of the tragedy that claimed the lives of 39 people found dead in the back of a freezing trailer in Essex last Wednesday.\n\nHis family has claimed the 15-year-old had longed to be with his father Nguyen Huy Tung and his mother Nyguen Thi Huyen and had spent the past two months travelling to the UK to see them.\n\nWhile his death has not been confirmed by police in Britain, Vietnamese police from the country’s capital Hanoi are supporting his relatives home in the remote village of Cuong Gian.\n\nHis elder sister, 16, who lives in Korea, told friends of Facebook: 'My brother left France for the UK and we have not been able to contact him since then'.\n\nAn uncle has also travelled from the south of the country after the boy’s parents told authorities they lost contact with their son on October 22 - the day of the tragedy.\n\nIt is thought the parents - who are believed to be in the UK illegally - had paid people smugglers at least £10,000 to arrange the passage for their youngest son.\n\nThis is the last photo of 15-year-old Nguyen Huy Hung, who has been missing since he tried to cross illegally to Britain, his family claim\n\nThe family of Nguyen Huy Hung, 15, (centre as a child in 2006 with his older brother and sister) fear he may have been among those who died in a container last week as he tried to get to Britain to see his parents\n\nHis 16 year old brother had remained at the family home while his elder sister was based in Korea.\n\nThe 15-year-old's sister (pictured together in 2006) posted on Facebook: '‘On Monday evening, my brother left France for the UK and we have not been able to contact him since then'\n\nAfter the 39 bodies were discovered in the back of a refrigerated lorry she posted a message on Facebook with an update on the family’s desperate search for information.\n\nThe message read: 'At this moment our family has not received any confirmation from the police so I hope if anyone sees my last post or photo I have posted about 39 people dead in the container in the UK (now deleted) or on any other Facebook group or website please let me know.’\n\nEarlier she had posted: ‘On Monday evening, my brother left France for the UK and we have not been able to contact him since then.\n\n‘There has been news of 39 dead people in the container. All the chronological information matches with the time my brother set off. I hope you can help telling me how my brother is doing.\n\nThe post was accompanied by a photo of her brother with a sad emoji.\n\nMore than 40 people replied to the recent posting by the sister, who used her nickname Tronn, telling her the hoped her brother would be okay.\n\nInside the foyer of the family’s two storey home photos of a much younger Huy Hung with his parents and sibling adorned he walls.\n\nA calendar also carried a photo of the now missing teen when he was aged about ten years old.\n\nA dark wooden carving of Budha dominated the room with ornate carved furniture taken up most of the space.\n\nThe uncle who arrived at the house declined to give his name and refused to answer any questions.\n\nThe plain clothes officer from Hanoi later called local police who arrived and asked Mail Online and other media from Vietnamese organisations to leave the property.\n\nLocal media have since received a request from the Vietnamese Government not to pubish the name of the 15 year old victim.\n\nIt is not known if the parents have made contact with Essex Police to help with the identification of their son. As illegals they are thought to be too afraid fearing arrest - despite Essex Police announcing they would not face any threat of arrest and deportation.\n\nAuthorities in Vietnam have begun visiting the homes of 24 families to collect DNA samples to speed up the identification process of the bodies found in the back of the container.\n\nToday it emerged that the Vietnamese woman who texted her mother as the refrigerated container carrying her and 38 others ran out of air had been deported from Britain days earlier and was trying to return, her family claimed today.\n\nPham Tra My, 26, has not been in contact with anyone back home after sending a final horrifying message as she crossed from Zeebrugge, Belgium, to Purfleet, Essex, saying: 'I can't breathe. Mum, I'm very sorry.'\n\nShe was trafficked to Britain for £30,000 after her parents, who earn around £300-a-month, had the debt added to their mortgage - and now her brother has claimed that her fateful journey across the North Sea was her second crossing.\n\nHe told the Vietnamese press: 'She was arrested a few days ago [in Britain] and they returned her to France. Now we heard she might have died'.\n\nPham had been promised she would travel by car or plane to Britain and was charged for the 'VIP' route - but instead the young woman is feared to have frozen to death inside the cargo container after sending her parents a horrifying series of messages, saying: 'I'm dying.'\n\nHer father Pham Van Thin said: 'We tried to talk her out of it because it would be a very difficult journey - but she said: \"If I don't go, the family would stay in a difficult situation because of the debt\".'\n\n'So she took a risk and we had to agree. We are in shock. I cannot explain our pain. We were all devastated. If I had known she would go by this route, I would not have let her go.'\n\nHe also told CNN that smugglers said the crossing was 'a safe route' and that people would go by aeroplane or car.\n\nThe names of eight suspected victims feared dead by their families, are: Pham Tra My, 26, Hung Nguyen, 33, Anna Bui Thi Nhung, 19, Nguyen Dinh Tu, 26, Le Van Ha, 30, Vo Ngoc Nam, 28, Joseph Nguyen Dinh Luong, 20, and Hoang Van Tiep, 18.\n\nPham Tra My, 26, was the first person named by family as among the 39 dead in the container tragedy and it appears she may have been deported from Britain days earlier\n\nHer parents Nguyen Thi Phong (left) and Pham Van Thin (right) remortgaged to get their daughter a better life abroad - but the £30,000 journey was meant to be by plane and taxi - not the back of a lorry, they say\n\nIn text messages sent at 10.28pm GMT on Tuesday, two hours before they were all found dead, Pham Thi Tra told her mother, 'I love you so much...I'm sorry' (pictured)\n\nWho has been arrested so far? As police in the UK continue their investigations into the 39 migrants who lost their lives trying to enter the country, we keep track of who has been arrested so far. Lorry driver Maurice Mo Robinson: Arrested on suspicion of murder, the 25-year-old was charged with 39 counts of manslaughter, people trafficking and money laundering. He will appear in court in Chelmsford today. Mo Robinson is the truck driver arrested after 39 people were found dead in the back of a lorry he was driving Joanna Maher, 38, and her husband Thomas, also 38: The Warrington couple who previously told MailOnline they had sold the container are understood to have been held on suspicion of conspiracy to traffic people and on suspicion of 39 counts of manslaughter. They have been bailed until next month. Mrs Maher, a mother-of-three, pictured with her trucker boss husband Thomas, told MailOnline that she sold the lorry involved in the deaths of 39 migrants to an Irish haulage firm 13 months ago 48-year-old man from Northern Ireland: The latest arrest took place at Stansted Airport. The identity of the man has not yet been revealed, but police said he has been arrested on suspicion of conspiracy to traffic people and suspicion of manslaughter. 20-year-old man from Northern Ireland: The man was arrested after getting off a ferry on Saturday afternoon.A blue Scania truck that he was driving has been impounded by the police.\n\nThe people smugglers responsible for cramming 39 people into a freezing container lorry were branded 'cruel and evil' by the grieving father of one of the victims.\n\nNyguen Thanh Le spoke out after facing the grim task of supplying a DNA sample to assist in the identification of his 33 year old son Nguyen Van Hung\n\nVietnamese authorities visited his home over the weekend to collect a hair sample that will lead to his music loving son Nguyen Van Hung, also known as Hung Nguyen, being formally identified.\n\nHis shocked family have not heard from him since October 21 when he sent a message saying he was 'going by taxi' to the UK.\n\nIt is thought the music graduate had told his parents he was being smuggled into the UK in a taxi rather than the back of a lorry as he did not want to worry them.\n\nThan Le said:' The people who did this are cruel and evil. The driver only has to stop and let the people out and give them a chance to live.'\n\nThe 55 year old's wife Pham Thi Lan sat opposite sobbing as she recalled her 'loving son' who was kind to the family and his brothers and sisters.\n\nOfficials have yet to confirm their son is among the 39 victims found in the back of a refrigerated lorry.\n\nBut like other families in the rural province abut 170 miles from Hanoi the lack of communication as they were about to embark on the final stage of their journey from Vietnam was confirmation enough to know they had died.\n\nA visit from the local police to collect a DNA sample was further proof for Mr Thi Lan that his son had perished.\n\nVan Hung, the second eldest of six children, had been working in France as a dishwasher at a Vietnamese restaurant when he paid smugglers to take him across the English Channel.\n\nHe had entered France illegally over a year ago with his father saying he had hoped to get work in a nail bar and had been looking forward to reaching the UK.\n\nHe said Van Hung decided to leave his home town in search of better employment. Many others had made it safely to the UK and were able to send money home to support family.\n\nDespite obtaining a degree in music studies from a University in the city of Huey Van Hung had been unable to find a well paid job.\n\nAfter a series of low income jobs he decided to quit Vietnam altogether and move to France. Van Hung would keep in regular contact with his parents ringing or messaging every week or fortnight.\n\nThe calls ended abruptly on October 21st with his last message saying he was being taken by taxi from France and into the UK.\n\nMr Thanh Le said he had no idea how his son got in touch with the people smugglers or how much he had paid for his passage to the UK.\n\nAs family and friends gathered in a sheltered area at the front of their house police called to collect a DNA sample.\n\nThis will be used by Essex based forensic experts to provide a match with the bodies pulled from the refrigerated lorry that had arrived in last week on a ferry crossing from Zeebrugge.\n\nMr Thanh Le said his son had gone abroad for a better life. It was the same reason 18 year old Hoang Van Tiep had left his family in Yen Thanh to risk his life getting into the UK.\n\nHis father Hoag said his teenager son had also told him that he would be travelling by taxi to the UK. The family had raised the £17,500 to pay people smugglers get the teen into the UK.\n\nHis route took him first to Russia before arriving in France in 2018 and last week boarding the ill fated lorry container that became an icy tomb.\n\nNguyen Van Hung's shocked family have not heard from him since October 21st when he sent a message saying he was 'going by taxi' to the UK\n\nAnna Bui Thi Nhung, 19, and cousins Hung Nguyen, 33, and Hoang Van Tiep, 18, (pictured left to right) are all feared to be in the container\n\nCarpenter Le Van Ha, 30, father-of-two Vo Ngoc Nam, 28, and Nguyen Dinh Tu, 26, are also named by family as victims\n\nThe family of the youngest female victim of the freezer container horror have pleaded for her body to be returned to Vietnam so they can say a final farewell.\n\nAnna Bui Thi Nhung, 19, is feared to be among the 39 people who were found dead in the back of a container that arrived from Belgium.\n\nHer elder sister Bui Thi Loan told MailOnline they wanted her body repatriated so that she could be buried in the village that she had left in search of a better life.\n\n'We are praying for a miracle that Anna is still alive, but we do not have much hope,' said the 26 year old.\n\n'All we want now is for Anna to come home. We want to be able to bury her and to mourn her.\n\n'She was just looking for a better life and we are still struggling to understand how this has happened.'\n\nAs Bui spoke the teen's mother lay prone on the bed at the family home too grief stricken to speak or move.\n\nIt comes as the haulage boss and his wife Thomas and Joanna Maher, who were arrested on suspicion of manslaughter, have been released on bail.\n\nThey previously told MailOnline they had owned the container the victims' remains were found in until last year. They have now been bailed until November 11.\n\nRelatives gathered in the courtyard of the house in the village of Yen Thanh in Nghe An Province, abut 170 miles from the country's capital Hanoi.\n\nThey sat smoking and drinking tea as a procession of visitors called to pay their respects at a makeshift shrine bearing a photo of Anna.\n\nThe victims were thought to have been carrying false Chinese passports - but are understood to be from Vietnam\n\nPhotos show the inside of the refrigerated trailer where 39 people were found dead in the early hours of Wednesday morning\n\nMo Robinson was pictured posing in front of a truck wearing a cowboy hat and a drink in hand (left), and also previously larking with police (right). He's in court\n\nJoanna and Thomas Maher, arrested in connection with Essex lorry deaths because of historic links to the lorry. They have now been released on bail\n\nLess than half a mile away in the same village another family had erected a shrine to former soldier Nguyen Dinh Tu.\n\nFamily members revealed that they are certain he was among those who died as he was due to meet with to relatives – both living in the UK illegally – and failed to show up.\n\nHis brother Nguyen Van Tinh said they had made contact with the relatives but admitted as they were living in the UK illegally they had been too afraid to contact police investigating the deaths.\n\nVan Tinh handed MailOnline a photograph of his brother which he requested be sent to Essex Police to help in any identification.\n\nThe photograph shows Dinh Tu sitting on a park bench with his right arm covered with tattoos.\n\nMailOnline has emailed the photograph to Essex Police as well as supplying contact details for the family.\n\nWhile more than half a dozen names of potential victims have been revealed authorities in Vietnam have not made contact with the families to request with identification.\n\nAuthorities in Vietnam confirmed they had been contacted by 24 families fearing their loved ones are among the victims of the lorry death trap.\n\nThe families are from two provincial areas, Ha Tinh and Nghe An.\n\nThe victims were thought to have been carrying false Chinese passports having begun their perilous journey to the UK from China.\n\nThe terrible events of the past few days are but the latest example of the trade in ‘human cargo’ between China and Britain, a 5,000-mile route through Asia and mainland Europe that can take a month\n\nRobinson arrived in the UK at the weekend after a ferry from Dublin to Holyhead. He picked up the trailer, which had been shipped from Zeebrugge to Purfleet. Minutes later, he pulled into the Essex industrial estate and the alarm was raised\n\nClose family members said Dinh Tu, who has a young son, was an acquaintance of Anna who had hoped to work as nail technician after arriving in the UK.\n\n'He did know her as this is such a small place, but they were not that close friends. He would have recognised her when they met up' said a family friend.\n\nFamily members named a third victim from the same village as former policeman Le Van Ha.\n\nThis has led to Yen Thanh being called ' The Village of the Damned' as others among the 39 victims are thought to have originated from the same area where poverty is rife and jobs scarce.\n\nAll three victims had left Yen Thanh some months ago in the hope of finding work in the UK and sending money home to support extended families.\n\nAnna, who left school at 15 with no qualifications, had told family and friends she travelled to China and Germany before reportedly climbing into the ill-fated refrigerated container that ended up in Essex.\n\nHer cousin 30 year old Tran Dinh Luc said she had been a 'happy kind girl' who wanted to make a new life and help support her family after the death of her father two years ago.\n\n'We all miss her terribly but are holding out for a miracle that she did not get in the lorry.\n\n'We want to have her back home. The family will not be able to grieve properly until she is home.'\n\nHer aunt said she has nothing but contempt for those responsible and wants justice for her niece.\n\n'The people who did this must be held to account,' said Vu Thi Bich Thao.\n\n'What sort of people can put others into a container and let them die. It is so cruel.'\n\nThe family have been following developments on their smart phones and were aware that the driver of the lorry had been charged with 39 counts on manslaughter.\n\nBut his arrest is little comfort as they come to terms with the horrific final moments of loved ones as they desperately tried to escape the icy tomb inside the container.\n\n'It makes me so sad to think of how Anna was feeling in those last minutes,' said a friend.\n\n'She, like the others, must have been terrified and wanted to get out.\n\nBich Thao said her niece had wanted to earn money to send home to her mother so that she could pay off her debts.\n\nShe said many of the homes in the village had been built with funds sent back from family members who had moved abroad to find work.\n\nFamily members had clubbed together to find the $10,000 demanded by people smugglers to get Anna into the UK.\n\nPrior to boarding the lorry Anna had posted photos to her Facebook account showing her drinking bubble tea in Brussels.\n\nHer family last heard from her on October 21 and it is the silence in the last dew days that has led them to be convinced she is dead.\n\nA short distance away at the family home of victim Dinh Tu his brother said all he wanted was to be able to arrange a funeral for his younger brother.\n\nHe told how his younger brother had left Vietnam three months ago and worked in a factory in Romania where he was paid just over £400 a month.\n\n'He had to pay for his accommodation out of the money and it was not enough. That is why he tried to get to the UK,' he said.\n\nNguyen Van Tinh said his brother's widow Hoang Thi Thuong was so devastated that she had been admitted to hospital.\n\n'She is not very well,' he said. 'This has hurt the family.'\n\nVan Tinh confirmed that his brother was due to be met on his arrival in the UK by two other relatives who were going to help him find work.\n\nHe said both men were working illegally and had been smuggled into the country.\n\n'They are too afraid to come forward and say anything,' said Van Tinh whose eyes were red rimmed from weeping.\n\nAs is the custom a small shrine bearing fruit and flowers surrounding a photograph of Dinh Tu had been set up in a front room of the house.\n\nVisitors were asked to light an incense stick and place it by the photo, which under a Vietnamese tradition is meant to help guide a soul home.\n\nThe driver of the refrigerated trailer has been charged with 39 counts of manslaughter and people trafficking.\n\nThe 31 men and eight women were initially believed to be Chinese, but several Vietnamese families have now come forward with fears their relatives are among the dead.\n\nMany are believed to have come from impoverished villages in central Vietnam, where some families now fear the worst.\n\nLe Minh Tuan has not heard from his son Le Van Ha since a message over Facebook around a week ago saying 'I'm about to board a car to Britain. I will contact the family when I arrive in England, Dad.'\n\nThat was two days before the refrigerated trailer stuffed with bodies was discovered in Essex, east of London.\n\n'We've heard no news from him since,' Tuan told AFP, his eyes red from crying.\n\n'For sure he was in that lorry. I just want my son's (body) back home,' he said in Yen Hoi village, Nghe An province.\n\nThe 30-year-old left his two young sons and wife in Vietnam in June, travelling to Turkey then Greece and France en route to the UK.\n\nHa hoped to find work to pay back $30,000 paid to smugglers to get him to Europe, and another $8,500 loan to build the family home.\n\n'He wanted to go to pay the debts... and send money back to his kids so they would have a better life,' said his father, clinging to his grandson and weeping.\n\nNearby, the mother of missing 28-year-old man Vo Ngoc Nam said she had not yet heard anything on the fate of her son, who had been working in Romania and planned to travel to Britain.\n\n'I have been waiting anxiously over the past few days for any news from him, but we got nothing,' the stricken mother told AFP.\n\nVillagers planned to gather for Sunday mass later in the day to pray for the 39 victims.\n\nCentral Vietnam is a common feeder for illegal migrants chasing promises of riches overseas. Many end up working in Britain illegally in nail bars or on cannabis farms, heavily indebted and subject to exploitation.\n\nFive people have so far been arrested in Britain in connection with the tragedy, the country's largest murder probe since the 2005 London suicide bombings.\n\nEssex police say they want to fast-track the process of fingerprint identification and DNA testing, but said it would take time.\n\nVietnam media reported that authorities had been contacted by 12 families fearing their loved ones were among the victims.\n\nThe dozen included families from Yen Thanh and Ha Tinh.\n\nEssex Police expect full identification of all the victims to take several weeks.\n\nDreams of a better life: Faces of the migrants who died in truck tragedy while trying to enter UK - as it emerges 25 of the 39 victims may be from the same Vietnamese village\n\nHoping for a better life, here are the faces of the 39 people who are believed to have frozen to death in the back of a truck after a desperate attempt to reach Britain.\n\nThe victims were discovered naked, or with minimal clothing, and had been desperately 'banging on the doors' for help and had 'foam coming from their mouths'.\n\nThe bodies of eight women and 31 men could have been frozen in the truck for several days when they were discovered on Wednesday in Grays, Essex, after the container criss-crossed the Channel via refugee hotspots.\n\nIt is now thought that as many as 25 of the 39 victims are Vietnamese and from the same impoverished coastal region of Yen Than. Relatives said most were going to work in nail salons.\n\nVietHome, a British organisation which tries to help UK-based Vietnamese residents, said it had been sent 20 photographs and names of people feared to have been inside the lorry container.\n\nEight suspected victims have so far come to light: Hung Nguyen, Anna Bui Thi Nhung, Nguyen Dinh Tu, Le Van Ha, Vo Ngoc Nam, Pham Thi Tra My, Joseph Nguyen Dinh Luong and Hoang Van Tiep.\n\nAll 39 people have been moved from Tilbury Docks to Broomfield Hospital in Chelmsford and are being formally identified.\n\nAnna Bui Thi Nhung, 19, from Vietnam paid an agent over $10,000 with the hope of entering the U.K.\n\nThe nail technician who paid £8,800 to make it to Britain\n\nAnna Bui Thi Nhung, 19, from Vietnam paid an agent over £8,000 [$10,000] with the hope of entering the U.K. to work as a nail technician, according to a relative.\n\nHer mother and a sister today cried as they set up an altar with incense and a photo of the suspected victim where family and friends can pray at their home in Do Thanh village.\n\nThe family heard from a friend living in the UK that 'Nhung is one of the victims,' said one of her relatives, who was visiting the missing teen's mother.\n\nNhung and many others from Yen Thanh district, where the village is located, some 200 kilometers (120 miles) south of Hanoi, travel abroad looking to make the type of money they cannot earn back home. One of their main goals is to send back enough to allow their families to build large homes that they would otherwise be unable to afford.\n\nOn October 21, days before her family lost contact with her and the news of the doomed shipping container emerged, Nhung wrote in a Facebook post: 'Being grown up means having to hide your sadness in the dark, and keeping a smile on your face.'\n\nA relative looks at an image of Nhung. The 19-year-old wanted to work as a nail technician, according to a relative\n\nNhung's family said she first left Nhung on her journey overseas in August. She went to China first, before eventually making her way to Germany, then Belgium, where they believe she boarded the fated truck.\n\n'I just want a peaceful life,' Nhung wrote in a caption beneath a photo of her smiling in a green field a few weeks after leaving Vietnam.\n\nLate on Saturday night, Nhung's family, devoid of hope, set up an altar in her memory, with her photo next to her father's.\n\nHer father died of cancer a few years ago. Her mother was unable to work because of health complications and so her loved ones clubbed together to finance a new life overseas, Nhung's family said.\n\n'Nhung didn't have the qualifications to get a good job with handsome pay. Nor do her friends and many others here,' said Nhung's uncle, Hoang Binh.\n\n'Going abroad and sending back money was the only choice,' he added.\n\nBy early September, it was not clear where she was, but Nhung was already well into her trip, and reflecting on her next steps.\n\nBeside a stock image of two children flying kites at sunset, she posted: 'As I grow up, I see that life is not as peaceful as I used to think. When I grow up, I want to go back to my childhood, when I lived freely'.\n\nTon Quang Tuan, one of Nhung's friends living in Berlin, said that 'We went out a few times when Nhung was in Berlin' and added that 'she was in a good mood, very happy,' but they lost contact after she said she had to leave for Britain.\n\nIt was not clear how Nhung had travelled from the Vietnamese countryside to China and then Berlin, but the German capital has emerged in recent years as a staging ground for Vietnamese and other migrants looking to start new lives in Britain.\n\n'I feel lonely in the place I used to dream of everyday,' Nhung wrote on September 25.\n\nIt was unclear where she was - Vietnamese smugglers are said to advise their subjects to live discreetly and not to give away too many clues in order to evade detection from the authorities.\n\nA few days later, Nhung was pictured outside Berlin Cathedral with a cup of bubble tea in her hands.\n\nBy late October, Nhung was in Belgium. She posted photos of herself, again with a cup of bubble tea in her hand, excitedly exploring the sights of Brussels, including the old stock exchange and the bustling Rue Auguste Orts thoroughfare.\n\nIt was from the Belgian port of Zeebrugge that the doomed container eventually departed. Her family believe that she was on board.\n\nIn Berlin, Nhung wrote: 'Back in Vietnam, I thought Europe was pink. But it turns out it's black'.\n\n\n\nThe 'VIP' traveller who paid £30,000 believing she would travel to Britain by plane and car and sent harrowing messages to her mother as she died in the back of a freezing lorry crossing the North Sea\n\nSuspected victim Pham Thi Tra My, 26, sent her mother a series of harrowing messages telling her she 'loved her' and was 'dying because she couldn't breathe' in the moments before her death, her family have claimed\n\nSuspected victim Pham Thi Tra My, 26, from Vietnam sent her mother a series of harrowing messages telling her she 'loved her' and was 'dying because she couldn't breathe' in the moments before her death, her family have claimed.\n\nThey claim to have paid people smugglers £30,000 for their daughter to travel to the UK via China 'in search of a better life'.\n\nShe is from Ha Tinh, an impoverished province in a part of Vietnam where many of the country's illegal migrants come from.\n\nNguyen Thi Phong and Pham Van Thin, told CNN it was 'very painful' to receive the text - saying she must have known she was going to die when she sent it.\n\n'I've lost both my loved one and my money,' her father Pham said, claiming he and his partner scraped together the money to pay for their daughter to travel to the UK.\n\nThe pair, who make around $400 a month between them, said the smugglers did not tell them how their daughter would be transported to the UK.\n\n'The smugglers said that this was a ... safe route, that people would go by airplane, car ... if I had known she would go by this route, I would not have let her go,' Pham added.\n\nA human rights worker in Vietnam, who has spoken with Tra My's family, revealed she made the perilous journey because her family was in debt and she was desperately trying to help them.\n\nHer family claim to have paid people smugglers £30,000 for their daughter to travel to the UK via China 'in search of a better life'\n\n'She had just returned from Japan where she was working to try and pay off the debt. And that was not enough and so she looked for a better future,' she told the BBC.\n\nAsking to remain anonymous, the human rights worker continued: 'For this girl it is very sad that she took the risk because she was dealing with debt that was created by another man in the family.\n\n'And I also learnt that the service that she was using was called 'very important service' and so it is like a business class ticket on the lorry and with that she had to pay double or three times the price of the cheap ticket.'\n\nThe human rights worker added that migrants are told they can vast amounts of money by moving to the UK, and the 26-year-old may have been convinced to purchase a 'VIP ticket' to get there.\n\nHe family mortgaged the house to get that money for her, the human rights worked added.\n\nPham Thi Tra's last text messages were sent at 10.28pm BST on Tuesday - two hours before the truck reached the UK, as it was en route from Belgium.\n\nShe told her mother: 'I'm sorry Mum. My journey abroad hasn't succeeded. Mum, I love you so much. I'm dying because I can't breathe.'\n\nTra My's brother told the BBC on Friday that his sister had told them not to contact her because 'the organisers' did not allow her to receive calls.\n\nHe said she flew to China from her home in Can Lộc, a rural district of Hà Tĩnh Province in Vietnam, then left for France and initially attempted to cross the border into the UK on October 19, but 'got caught' and turned back.\n\nNguyen Dinh Luong, 20, pictured at Montmartre in Paris planned to work in a nail salon when he got to Britain\n\n20-year-old impoverished Vietnamese province with dreams of a better life in a British nail bar\n\nAnother of the suspected victims was revealed to be Nguyen Dinh Luong, 20.\n\nHis father Nguyen Dinh Gia said his son told him two weeks ago he planned to travel to Britain from France, where he had been living illegally since 2018.\n\nHe said he would pay £10,000 [$14,000] for the journey and planned to work in a nail salon when he got to Britain.\n\nBut Gia got a call several days ago from a Vietnamese man saying 'Please have some sympathy, something unexpected happened,' he told AFP.\n\n'I fell to the ground when I heard that,' Gia told AFP.\n\n'It seemed that he was in the truck with the accident, all of them dead,' he added.\n\nHis father told The Associated Press he had not been able to reach him since last week. He had said he would join a group in Paris that was trying to reach England.\n\n'He often called home but I haven't been able to reach him since the last time we talked last week,' Nguyen Dinh Gia said. 'I told him that he could go to anywhere he wants as long as it's safe. He shouldn't worry about money, I'll take care of it.'\n\nHe said his son left home in central Ha Tinh province to work in Russia in 2017, then on to Ukraine. In April 2018, he arrived in Germany then traveled to France. He told his family that he wanted to go to the UK.\n\nLuong's older brother, Pham Dinh Hai, said that Luong had a tattoo of praying hands on a cross on his right shoulder. The family said they shared the information with local authorities. Luong is also from Ha Tinh.\n\nOne of the newly named suspected victims, Nguyen Dinh Tu\n\nThe ex-soldier who left his wife and young son at home\n\nOne of the newly named suspected victims, Nguyen Dinh Tu, 26, had a few months ago asked his wife Hoang Thi Thuong to help him raise £11,000 ($14,000) to cover the cost of an illicit trip from Germany to the United Kingdom.\n\nMs Hoang revealed he had been working illegally in Romania and Germany and had begged her for money to get to the UK.\n\n'I lost contact with him on October 21,' Thuong said with tears in her eyes. 'I have a big debt to pay, no hope, and no energy to do anything'.\n\nTu's father said relatives in the United Kingdom had told him that Tu was inside the truck, and had been planning to pick him up.\n\n'They were supposed to pick him up at the drop-off point but they called and said Tu was in that truck,' Tu's father, Nguyen Dinh Sat, said.\n\n'I haven't heard anything from my son'.\n\nTu had a few months ago asked his wife Hoang Thi Thuong (pictured with her son) to help him raise £11,000 ($14,000) to cover the cost of an illicit trip from Germany to the United Kingdom\n\nFather-of-two Vo Ngoc Nam, 28, is also feared to have been in the ill-fated container\n\nFather-of-two who called his family on day of tragedy asking them to pray for his safe journey to Britain\n\nFather-of-two Vo Ngoc Nam, 28, is also feared to have been in the ill-fated container.\n\nHis wife, Ta Thi Oanh, told Vietnamese media that he had called her last Tuesday afternoon to say he was on the truck going to Britain.\n\nHe asked her to call her parents and ask them to pray for him, but has not been heard of since.\n\nMr Nam's father, Vo Ngoc Luyen, said: 'After reading information about the 39 people in the container in the UK, my family is extremely shocked. We are anxiously waiting for official information from the authorities.'\n\nNam is believed to have travelled to Romania, before Germany and France, to find work. The local report described the family situation as 'difficult'.\n\nHoang Van Tiep, 18, (right) is feared to have died alongside his cousin in the container\n\nThe youngest to die: Victim believed his £13,500 to traffickers would mean a taxi into Britain\n\nBelieved to be the youngest victim, Hoang Van Tiep, 18, is feared to have died with his cousin Hung Nguyen.\n\nTiep left home two years ago after his family got a £13,500 loan to pay for him to travel to Russia and on to France.\n\nHe had left his family in Yen Thanh to risk his life getting into the UK.\n\nHis father Hoag said his teenager son had also told him that he would be travelling by taxi to the UK. The family had raised the £17,500 to pay people smugglers get the teen into the UK.\n\nCousins Hung Nguyen, 33, (right) and Hoang Van Tiep (left) were both feared to be in the container\n\nThe dishwasher who had been trafficked to France and had waited for his cousin before crossing the Channel\n\nHung Nguyen, 33, had been working in France as a dishwasher before his trip to Britain.\n\nHis family paid smugglers £13,400 last year to get him to France, and were asked for a similar amount last week.\n\nHe was reunited with his cousin Hoang Van Tiep for the final leg of the journey to Britain and are feared dead together, their families say.\n\nA picture of carpenter Le Van Ha is kept on a prayer altar at his house in Vietnam's Nghe province\n\nFormer policeman who never met his new baby back home in Vietnam\n\nCarpenter Le Van Ha is feared to have died without ever meeting his three-month-old son.\n\nThe 30-year-old left his heavily pregnant wife and their two young sons in June, when he travelled to Turkey, then Greece and France on his way to Britain.\n\nRelatives said his widow Tran Thi Hoa, 29, was suffering from shock after she only learned he was missing when officials asked her for a photograph to help with identification.\n\nHis father Le Minh Huan said Ha had wanted to send money home to his family, to clear the £23,000 paid to people smugglers and another £6,600 loan to build his family's home.", "description": "EXCLUSIVE: Teenager Nguyen Huy Hung would be the youngest victim of the tragedy that claimed the lives of 39 people found dead in the back of a freezing trailer in Essex last Wednesday.", "authors": ["Paul Thompson In Yen Thanh", "Nghe An Province", "Vietnam", "For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/13/20280122-0-image-a-85_1572268527199.jpg", "published_at": "2019-10-28"}