{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/02/french-government-struggles-allay-health-fears-huge-chemical", "downloaded_at": "2019-10-05 14:58:53.600699+00:00", "title": "French government struggles to allay health fears after huge chemical factory blaze causes stench", "language": "en", "text": "The French government on Wednesday struggled to allay fears of health risks from a fire at a lubricant factory which belched smoke from more than 5,000 tons of chemicals into the surrounding area.\n\nCritics have accused ministers of “communication from another age” after they initially appeared to play down the blaze as a minor security incident.\n\nThe fire broke out last Thursday at the Lubrizol plant, owned by US billionaire investor Warren Buffett and located a few kilometres from the centre of Rouen, a northern French city with a population of 100,000.\n\nThe blaze spewed black smoke 14 miles from the site and has left a lingering stench around Rouen.\n\nA leak from the same factory in 2013 caused consternation across the Channel in Kent over a leak of mercaptan gas. Authorities insisted the stench of rotten eggs, cabbage and garlic was harmless, but emergency services were nevertheless flooded with calls as the fug crept as far as London.\n\nThis time, local authorities produced a list of all the chemicals burned and the “associated risks” in case of combustion, saying none were dangerous.\n\nNormandy security chief Pierre-Andre Durand insisted that tests conducted after the fire showed that fears of asbestos fibres from the plant's destroyed roof contaminating the air had proven \"unfounded.\"", "description": "The French government on Wednesday struggled to allay fears of health risks from a fire at a lubricant factory which belched smoke from more than 5,000 tons of chemicals into the surrounding area.", "authors": ["Henry Samuel", "Janet Daley", "Juliet Samuel", "Michael Deacon", "Sarah Champion"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/02/TELEMMGLPICT000211715594-xlarge_trans_NvBQzQNjv4BqNJjoeBT78QIaYdkJdEY4CnGTJFJS74MYhNY6w3GNbO8.jpeg?imwidth=1200", "published_at": "2019-10-02"}