{"pub": "nymag", "url": "https://vulture.com/2019/10/dolemite-is-my-name-movie-review-2019.html", "downloaded_at": "2019-10-04 23:59:14.745509+00:00", "title": "Dolemite Is My Name Movie Review 2019", "language": "en", "text": "Writers Scott Alexander and Larry Karaszewski give Eddie Murphy his best material in decades. Photo: François Duhamel/Netflix\n\nEverything clicks in the comedy Dolemite Is My Name — it’s almost alarming how easily, breezily, larkishly the film goes down. Eddie Murphy plays the comedian and singer Rudy Ray Moore, who arrested a mid-career fade-out in the 1960s by developing an alter ego called “Dolemite,” a pimp, libertine, and fabulist with roots in black American folklore. The movie, directed by Craig Brewer from a script by Scott Alexander and Larry Karaszewski, connects Moore’s obscurity in early scenes to the passing of an era. The old-style vaudeville houses have closed and are decaying along with the cities surrounding them. What turns people on now are outlaws. Heroes aren’t just hustlers but resplendent hustlers, colorfully flouting the old, accommodationist ways. If the system is crooked, they’ll be crookeder — joyously, filthily, libidinously so. So, Dolemite is commercial dynamite.\n\nIf Dolemite was Moore’s restart button, Moore is Murphy’s. The actor’s swift rise to stardom in the early ’80s came from playing underdogs who were so obviously top dogs that there was no real suspense — only the glee of watching Murphy put down or vanquish one racist adversary after another in blockbusters like 48 HRS, Beverly Hills Cop, and Coming to America. From the outset, he projected such comfort with his stardom and resentment at having to make himself available to press or fans that there was also glee in some quarters when his films began to tank. “Look, children, it’s a falling star!” exclaimed David Spade to a photo of Murphy on a Weekend Update segment of Saturday Night Live that prompted an angry call from Murphy, who reminded Spade that SNL was on the brink of extinction when Murphy helped give it a second wind. Murphy might have lost an Oscar for Dreamgirls when voters were reminded that he wasn’t inclined to stick around for other actors’ close-ups, returning to his fortress of trailers while stand-ins played his scenes. It was sobering. So, coming from behind is new for Murphy. There’s an extra-textual element of fear in his Moore as he vainly pleads with a DJ (Snoop Dogg) to play an old record. Murphy will never not be a poor man, but if wealth were enough, he’d be happy doing animated movies like Shrek. He needs new challenges.\n\nWriters Alexander and Karaszewski give him his best material in decades. With Ed Wood, the pair essentially created the ironic biopic subgenre, in which American go-get-ism is combined with mediocrity and/or a talent so antibourgeois that it flouts the biopic’s wholesome aesthetic. Self-actualization is valued over quality in a way that subtly evokes Albert Brooks’s Defending Your Life, in which doubt, hesitation, or shame are the qualities that keep a person from advancing to a higher plane of existence. The intoxicatingly inept Wood, the defiantly sexist smut-monger Larry Flynt, the punkish provocateur Andy Kaufman are true existentialist heroes, carpe-ing every diem, creating themselves out of nothing. Murphy’s Moore is a rejoinder to F. Scott Fitzgerald’s famous assertion that in America there are no second acts. It’s a comeback as well — at least in film — for the Hustle & Flow director, Brewer, who didn’t find his commercial mojo until Empire.\n\nIn outline, Dolemite Is My Name is as straightforward as a rags-to-riches tale can be. Moore hears stories of a pimp called Dolemite from a homeless man, whom he plies with cash and booze for more and more details. He builds the character while staring at himself in the mirror, putting together his garish costume (ruffled pink shirts, an Afro wig, an elegant walking stick) the way clowning students do when turned loose on piles of old clothes and props. I don’t think Murphy is faking his delight in showing Moore finding his persona. Is there anything more rewarding for a performer like Murphy than nailing a character, making it seem as if that person has always existed in the ether, waiting for the genius to come along and invoke him/her? For Moore and Murphy, making club audiences scream with happiness and then embarking on the black vaudeville “Chitlin Circuit” is reactivating old muscles and finding a new potency. And Moore doesn’t simply invent the character — he invents the means of reaching the public. Spurned by record labels for material judged obscene (this in the age of Deep Throat), he records his act himself in his grandma’s house, getting his audience toasted to simulate the feel of a raucous nightclub. For Alexander and Karaszewski, it wouldn’t be American without a degree of deception.\n\nDespite the threat of poverty, Dolemite Is My Name isn’t deep or dark. It has the buoyant, let’s-put-on-a-show feel of Ed Wood. Moore quickly builds a surrogate showbiz family, in one club inspiring Lady Reed (Da’Vine Joy Randolph) to put her offstage wit to work onstage. (“I’m so grateful for what you did for me,” she tells Moore in a tearful moment, “cause I’d never seen nobody that looks like me up there on that big screen.”) Stirred by the success of Shaft and Superfly while dismayed by Billy Wilder’s lame The Front Page remake, Moore dreams of making it in film and convinces a playwright (Keegan-Michael Key) with pretenses to pen an outlandish action script with “titties” and kung fu, then woos an alcoholic name actor, D’Urville Martin (Wesley Snipes), both to appear in the film and direct it. (This is also a comeback of sorts for Snipes, who embraces his camp side in the manner of Val Kilmer at his most dissolute.) Dolemite Is My Name has the glee of a John Waters movie in which it’s freaks-versus-squares, with freakishness the only healthy design for living.\n\nThe final twist is that Moore, reminded that he’s a little pudgy and “no Billy Dee Williams,” is happy to turn his Dolemite film, mid-shoot, into a slapstick comedy. This is another aspect of the modern Horatio Alger story, in which dignity is jettisoned for the sake of fame but is considered well lost. Rudy Ray Moore’s Dolemite never broke through to a white mainstream, but is now having, pace Fitzgerald, his third act. Like Ed Wood, like Tommy Wiseau, like Tonya Harding, he’s the subject of an award-worthy biopic with an A-list star. He has arrived.", "description": "Everything clicks in the comedy Dolemite Is My Name, in which Eddie Murphy plays the comedian and singer Rudy Ray Moore. It’s almost alarming how easily, breezily, larkishly the film, set to stream on Netflix, goes down.", "authors": ["David Edelstein"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/04/04-dolemite-is-my-name.w1200.h630.jpg", "published_at": "2019-10-04"}