{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201909301974/global-markets-end-tumultuous-quarter-on-quiet-note", "downloaded_at": "2019-09-30 10:44:42.924548+00:00", "title": "Global Markets End Tumultuous Quarter on Quiet Note", "language": "en", "text": "By Paul J. Davies\n\nGlobal stocks were pulled in different directions Monday,with Chinese stocks falling despite manufacturing numbers for September coming in better than expected.\n\nOn the last day of what has been a volatile quarter across markets, shares in Shanghai slipped 0.9%. Official data showed manufacturing activity rebounded in September mainly on improving domestic demand. Chinese stock markets will be closed for the rest of the week to mark the 70th anniversary of the founding of the People's Republic of China.\n\nEuropean stocks were up 0.1% in the Stoxx Europe 600 and the FTSE 100 in London was 0.15% higher. U.S. futures were up 0.3%.\n\nThe past three months has seen huge swings in oil, government bond yields and stock markets as investors grappled with a series of unexpected or complicated economic and geopolitical developments. These included the attack on Saudi Arabia's oil industry and monetary easing from the European Central Bank and the U.S. Federal Reserve.\n\nMonday's Chinese manufacturing data was \"encouraging, given the tighter industrial production restrictions ahead of the 70th Anniversary Celebration for environmental concerns,\" Citigroup economist Xiangrong Yu wrote in a note.\n\nThe Japanese Nikkei 225 was also down 0.6%, while in Hong Kong the Hang Seng rose 0.4% in spite of another weekend of major pro-democracy protests.\n\nBrent crude oil was down 0.6% at $60.70 even though there are several factors threatening to restrict supplies. Saudi Arabia's Crown Prince Mohammed bin Salman said in an interview with \"60 Minutes\" broadcast Sunday that energy prices could hit unimaginable highs if conflict with Iran escalated.\n\nThe Wall Street Journal also reported that the U.S. shale boom was slowing, with production growth of just 1% in the first six months of 2019.\n\nIn Europe, government bond yields rose slightly as Mario Draghi, the outgoing president of the European Central Bank, used an interview to again call for government spending to help the eurozone economy, saying it was now more urgent than before.\n\nMonetary policy could still do its job but the longer it went on, the negative side effects would be more and more visible, he also said in a long interview with the Financial Times.\n\nGerman 10-year bond yields were 0.28 percentage points higher at minus 0.545%, while French 10-year yields were 0.28 points higher at minus 0.251%.\n\nGold was also lower, down 0.45% $1499.70. The WSJ dollar index was up 0.1%.\n\nWrite to Paul J. Davies at paul.davies@wsj.com\n\n(END) Dow Jones Newswires\n\nSeptember 30, 2019 05:08 ET (09:08 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-09-30"}