{"pub": "foxnews", "url": "https://foxnews.com/us/tennessee-teen-bullied-suicide-bisexual-social-media", "downloaded_at": "2019-10-01 00:08:39.632782+00:00", "title": "Tennessee teen kills himself after classmates out him as bisexual on social media, family says", "language": "en", "text": "[Editor's note: This story discusses suicide. If you or someone you know is having thoughts of suicide, please contact the National Suicide Prevention Lifeline at 1-800-273-TALK (8255).]\n\nA Tennessee teenager killed himself after his classmates outed him on social media as bisexual, his family said.\n\nChanning Smith, a 16-year-old student at Coffee County High School in Manchester, died Sept. 22, the same day two other teens allegedly revealed his personal messages on Instagram and Snapchat.\n\nACTIVE-DUTY MILITARY SUICIDES SPIKE TO RECORD HIGH, PENTAGON REPORT SAYS\n\nSmith's brother told WZTV he had no idea why his brother would kill himself and started reaching out to his friends, who said the teen was bisexual and that his messages had been leaked.\n\n“They did it to just completely humiliate and embarrass my brother,” Joshua Smith said. “Being in a small, rural town in the middle of Tennessee, you can imagine being the laughing stock and having to go to school Monday morning. He couldn't face the humiliation that was waiting on him when he got to school on Monday, so he shot and killed himself.”\n\nMOM OF GIRL, 5, WHO SURVIVED DAD'S NEW YORK SUBWAY JUMP SAYS SHE FELT 'SOMETHING WAS WRONG'\n\nThe brother said Smith called the girl who allegedly posted the screenshots to tell her he was going to kill himself — and claims the girl didn't tell anyone about it.\n\nSmith's family is urging Coffee County District Attorney Craig Northcott to press charges, but the family says Northcott told them it'll take at least 30 days to make a decision regarding the case.\n\nIn a statement to WTFV, Northcott said his office \"has encouraged, cooperated in and supported the investigation into the events leading to this death\" and any reports that say he's \"failed or refuse to act is inaccurate.\"\n\nNorthcott has been criticized for previously saying he didn't believe in gay marriage and promised that same-sex partners wouldn't receive protections from domestic violence laws.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nHundreds attended a vigil for Smith on Thursday in Manchester, where they mourned the loss of the 16-year-old. His mother, Crys Smith, had a message for those allegedly involved in her son's death: \"Just because you think it's cute or funny to make somebody embarrassed or humiliate them, think again. Because if somebody would've realized that, my son would not be dead.\"", "description": "A Tennessee teenager killed himself after his classmates outed him on social media as bisexual, his family said.", "authors": ["Nicole Darrah", "Nicole Darrah Covers Breaking", "Trending News For Foxnews.Com. Follow Her On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Channing-Smith.png", "published_at": "2019-09-30"}