{"pub": "reuters", "url": "https://af.reuters.com/article/sportsNews/idAFKBN1X10QZ-OZASP", "downloaded_at": "2019-10-22 13:42:05.346400+00:00", "title": "Mistakes happen but Springboks not worried ahead of World Cup semi-final, says Vermeulen", "language": "en", "text": "TOKYO (Reuters) - South Africa are not concerned the profligacy that tainted Sunday’s victory over Japan will cost them in their upcoming rugby World Cup semi-final against Wales, Duane Vermeulen told reporters on Tuesday.\n\nJapan's Jiwon Koo in action with South Africa's Duane Vermeulen REUTERS/Matthew Childs\n\n“We’re not robots,” the back rower smiled in a conference room at Tokyo’s Keio Plaza hotel.\n\n“Guys try something, and sometimes the ball goes to ground and you make a mistake.\n\n“But as long as it is individual errors, yes - perfect. As long as it is no trend that keeps going throughout the game, and it’s not a system error, then in a way we’re OK with that.”\n\nWhile conceding the Springboks would have to tighten up their handling for Sunday’s match, the forward instead took positives from their defensive performance against a rampant Japanese side in their 26-3 quarter-final win.\n\n“It was a great performance by the team - not to concede a try, and being down to 14 men for a period,” he said.\n\n“That was fantastic to see as a team, because we’ve put a lot of work into that.\n\n“But I think on the other side, on the attacking side, we had a lot of opportunities, we knocked a few balls, and we dropped one or two, but going into a semi-final, you might only get four opportunities or three opportunities.\n\n“And then you need to convert that into points, because you never know when you will be back in their points zone where you can score.”\n\nThe pivotal moment in Wales’s 20-19 win over France came when French lock Sebastien Vahaamahina was sent off shortly after half-time for a blatant elbow on flanker Aaron Wainwright. France had been leading 19-10 at the time.\n\nVermeulen said South Africa will need to be disciplined and at full strength as they bid to reach the final.\n\n“When we play we try not to get cards, not to get any yellows or reds,” he said.\n\n“Because when you get a card you are under pressure ... we felt that at the weekend against Japan with ‘beast’ being off for 10 minutes,” he said, referring to prop Tendai Mtawarira’s yellow card for a spear tackle on Keita Inagaki.\n\n“We had to defend with 14 men, and that makes it difficult. And you can’t have that in knockout games, you lose, you get punished.\n\n“I think that has a massive effect on the game, on the result, so hopefully we can go and play with 15 men all the time.\n\n“It is not a thing we have discussed yet, but hopefully it is something we will discuss this week.”\n\nThe winner of Sunday’s clash will face either New Zealand or England in the World Cup final on Nov. 2.", "description": "South Africa are not concerned the profligacy that tainted Sunday's victory over Japan will cost them in their upcoming rugby World Cup semi-final against Wales, Duane Vermeulen told reporters on Tuesday.", "authors": ["Ossian Shine", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191022&t=2&i=1443655730&w=1200&r=LYNXMPEF9L0MY-OZASP", "published_at": "2019-10-22"}