{"pub": "guardian", "url": "https://theguardian.com/film/2019/sep/05/why-the-third-man-is-an-essential-primer-for-no-deal-brexit", "downloaded_at": "2019-09-05 11:26:17.851650+00:00", "title": "Why The Third Man is an essential primer for no-deal Brexit", "language": "en", "text": "As the classic noir gets a 70th anniversary re-release, it’s hard to ignore the parallels between a shattered postwar Vienna teeming with spivs and the future the Brexiters have in mind\n\nWhat perfect timing for The Third Man to step back out of the shadows. Often hailed as the finest film Britain ever made, a 70th anniversary re-release will see it return to cinemas with the government much in the market for symbols of national grandeur. While Boris Johnson has named his favourite film as Dodgeball – for once, eerily believable – as the great British breakdown goes on it is easy to imagine him waving a tiny Union Jack at Carol Reed’s majestic noir.\n\nIt is true, of course, that there could be no better moment for The Third Man to reappear – just not as a cosy patriotic treat. Rather, it is a cold premonition of no-deal Britain.\n\nIn that, there is a certain poetry. We are where we are in no small part due to endless British war films convincing a generation born in the 1950s that they had lived through the Blitz and could only be happy back in it. But The Third Man is a postwar movie. American hack writer Holly Martins (Joseph Cotten) arrives in Vienna to meet, then mourn, his old friend Harry Lime (Orson Welles), but the city he finds tells a bitter truth about life after wartime. “Smashed and dreary,” the screenwriter, Graham Greene, wrote in the novella drafted as a treatment.\n\nBarring the unexpected, we may still live to see the resemblance. The cosplayers will sputter that Austria was on the losing side in the second world war, ignoring that Britain can’t help but lose the re-enactment, given we’re the only ones fighting it. With Europe declining to drive us into the shelters, no deal provides the solution by dropping a bomb on ourselves.\n\nThe Third Man: behind the scenes of the film noir masterpiece – in pictures Read more\n\nReed and Greene show us the future that follows. “The classic period of the black market,” the voiceover calls it, an ugly scuttle of murky characters and fraught borders, an impoverished place carved up by predatory powers. The screen fills with parallels between then and our soon-to-be now. Official versions of Harry’s death hum with organised disinformation; his lover Anna is a refugee, terrified of being caught with the wrong papers; malign Russian influence lurks.\n\nBut most of all, there are the vultures. To the crooks Greene found at work in the Viennese debris, the godsend of war was allowing them room to get rich. No Deal will be the same: a once-in-a-lifetime chance to tip a whole country into a handful of pockets. Disaster capitalism is just the modern name. There must be a catastrophe – because only that upheaval can allow the firesale of public assets and small businesses, the accompanying wave of deregulation, Britain remade as an offshore hidey-hole that asks no questions (and where those who do ask regret it).\n\nEnter – in that deathless flash of nightlight – Harry Lime. Because what is Lime if not a pioneer disaster capitalist, grasping the opportunities presented by chaos with a stash of tainted penicillin? Now, near the endgame, the point of the past three years is obvious – making possible the feral economy in which business minds such as Harry thrive, stripped of “red tape”, profit its own unarguable logic. “Free of income tax, old man,” he twinkles.\n\nIt almost feels too on-the-nose that his racket takes place in the ultimate captive market – medicine. When the film was first released, the NHS was a year old. Now, it survives as the grand prize in a US trade deal Britons are assured we are first in line for, an army of Harrys poised to sell us an opioid epidemic and health insurance bankruptcies.\n\nWith his loathing of American empire, Greene would be unsurprised to find Big Pharma circling. Yet at first, his villain sprang from closer to home. In Greene’s original novella, Lime and Martins were not Americans, but British subjects, old pals from private school. Harry’s crimes in Vienna are, we discover, those of a charismatic English scoundrel educated to rig the system.\n\nIndeed. It would be interesting to know what the current prime minister makes of Harry Lime – a habitual liar, his moral failures stuffed behind rogueish affability, an amply scaled betrayer of women, a nihilist and narcissist bulldozing through life with a bone-deep conviction that, as the novella puts it, “his happiness will make the world’s day”. Greene knew the type. He knew the poison in our golf clubs and members bars. The spivs and grotesques now running the country might have stepped whole from his pages, whipping up nationalism while discreetly betting against the pound and arranging second passports.\n\nHigh on the ferris wheel at the ghostly Prater amusement park, Harry prices up the tiny lives below. “Would you really feel any pity if one of those dots stopped moving?” Now, the maths of no deal are only deranged if you value those dots above your investment fund. And we – car-factory workers, sheep farmers, research scientists, even film critics, all of us – wander below.\n\nThe funny thing is that Britain’s greatest film was only ever part British anyway. Aside from the involvement of the Hollywood veteran David Selznick and the Anglo-Hungarian producer Alexander Korda, Greene learned of the real-life penicillin racket in Vienna from the Austrian journalist Peter Smolka. Our ruling ghoul squad would no doubt shriek that the continental influence explains the negativity. Others will see Smolka as a small but telling detail in pinning down how a 70-year-old film could map so closely on to our present debacle – an eyewitness to what happens once the rot sets in.\n\nHow does it end? In 1949, American interests won the day: Greene was overruled by Selznick as to how to close the story. The mogul was proved right, refusing Greene’s original happy ending for a cynical parting note. For anyone who has never seen this cruelly brilliant film and wonders what it says about the road ahead, here is the spoiler warning. There is a funeral, a long solitary walk and then a fade to black.\n\nThe Third Man is re-released for one day only on 29 September, and on DVD and Blu-Ray later in the year.", "description": "As the classic noir gets a 70th anniversary re-release, it’s hard to ignore the parallels between a shattered postwar Vienna teeming with spivs and the future the Brexiters have in mind", "authors": ["Danny Leigh"], "top_image": "https://i.guim.co.uk/img/media/969503f1df33b0d2a59a594eb11573a9d66dd85c/0_175_2469_1481/master/2469.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b79707d12af9881a845b9b5c95b84cbe", "published_at": "2019-09-05"}