{"pub": "news.com.au", "url": "https://realestate.com.au/news/2-million-media-house-price-the-new-normal-in-more-australian-suburbs/?rsf=syn:news:nca:news:spa:strap", "downloaded_at": "2019-10-24 07:53:19.041548+00:00", "title": "$2 million median house price the new normal in more Australian suburbs", "language": "en", "text": "It’s no longer enough to be a millionaire to own property in suburbia.\n\nAs we continue our pursuit of the great Australian dream of home ownership, and increasingly view property as the ideal way to grow wealth, some unlikely, lesser known suburbs are set to crack the $2 million median house price.\n\nMORE: What ‘pent-up demand’ is doing to your property\n\nInside Justin Bieber’s epic $13m Beverly Hills mansion\n\nThe likes of well-to-do ‘name’ suburbs such as Vaucluse (median house price of $6.5m) and Toorak (median house price of $3.2m) have been there for some time.\n\nBut now, other aspirational suburbs are moving towards that mark. Including for the first time in Brisbane and Perth. While other upstart addresses are set to join the exclusive club too.\n\nLocations soon to hit the $2 million median are spread right across the country. (They can be seen in the graphic below.)\n\nIt is another indication of a resurgent property market.\n\n“A suburb with a $1 million median used to be considered a premium suburb, but this is no longer the case in Sydney,” REA Group chief economist Nerida Conisbee said.\n\n“In Sydney, even $2 million is unlikely to get you into a premium suburb. with Rosebery, a previously industrial suburb close to Sydney airport likely to hit that level over the next couple of years, perhaps earlier.\n\n“Brisbane isn’t too far from having its first $2 million suburb with Teneriffe about to hit that level. Unlike Rosebery, Teneriffe is one of Brisbane’s best suburbs. The premium market in Perth continues to pick up — Swanbourne has increased by 17.4 per cent over the past 12 months.\n\n“If the premium market recovery continues in Perth, it is likely to hit $2 million over a similar time frame to Rosebery.\n\nSydney’s new upstart suburbs\n\nRosebery’s evolution from an industrial suburb to one much more liveable, has allowed it to blossom as a desirable location, said Simon Cohen, a buyer’s agent from Cohen Handler.\n\n“Rosebery has been gentrified and it’s become a very nice place to live,” he said.\n\n“A lot of young families have moved into the area.\n\n“Kogarah Bay has also really grown as a suburb. It’s waterfront locations is one of its big drawcards. It’s very close to the hospital (St George Hospital) and as such a lot of doctors like to call it home.\n\n“It wasn’t that long ago houses in Mount Druitt started getting $1 million and they are popular for similar reasons to Kogarah Bay — the access to amenities, they are near a Westfield or a hospital. Areas like that always have that good growth.”\n\nMr Cohen’s counterpart in Brisbane, Jordan Navybox said Teneriffe was the most desired suburb in Brisbane.\n\n“It’s at the top of the list for our buyers,” he said.\n\n“It’s right by the river and close to the city. There are some incredible new builds there in terms of boutique residential homes.\n\n“In the late 1990s houses were going for $300,000 to $400,000. Now they are going up to 10 times that.\n\n“It’s a very highly sought after and there is very little stock. There is a lot of interest whenever a property comes up for sale. People have come to us, to help them buy after looking for two years. On average it’s a four to six week buying process for us but the average process for Teneriffe is longer than other suburbs.\n\nPortsea on the comeback\n\n“Portsea has been a millionaire’s playground since Adam was a boy,” said seller’s agent\n\nRob Curtain from Peninsula Sotheby’s International Realty.\n\nBut after something of a lull and a loss of status to neighbouring Sorrento, it is enjoying a resurgence.\n\n“Portsea has definitely picked up in the last 18 months,” Mr Curtain continued.\n\n“About 10 years ago people started moving to Sorrento, but now they are saying it is overpopulated, it is overly busy and they want to come back.\n\n“Portsea has larger blocks of land than Sorrento, so you can get those bigger sales. But there are also less houses, which means less turnover.\n\n“You have both the ocean and the bay beaches. So you have the best of both worlds. It’s also at the end of the road, the southern end of the peninsula. So it’s quieter.”\n\nMr Curtain currently has a five bedroom house on 2,733 sq m on Elizabeth Rd, Portsea for sale.\n\n“Previously it was for sale with another agent at 2.5, that was too much. It will sell in the low 2s, we have had a lot of interest.”\n\nThe jewel in Perth’s crown\n\nPrices in the Perth property market have slumped 19 per cent since the city’s peak in March 2014. That is the deepest fall of any capital city except Darwin, where prices have slumped 28 per cent since their June 2014 peak.\n\nMORE: V8 Supercar star’s home up for sale\n\nThe Aussie suburbs Hong Kong buyers are targeting\n\nHowever there are signs the premium end of the Perth market may help to pull it up, mirroring what is occurring in the Sydney market.\n\nThe exclusive suburb of Swanbourne has almost made up that 19 per cent fall over the last 12 months. As such it is set to become the first Perth suburb to boast a $2 million median house price.\n\n“There has always been consistent demand for premium addresses in Perth,” sales agent Pam Herron from The Agency said.", "description": "It’s no longer enough to be a millionaire to own property in the suburbs. Even lesser-known areas are moving up into stratospheric pricing brackets.", "authors": ["James Macsmith"], "top_image": "https://www.realestate.com.au/blog/wp-content/uploads/2019/10/24090131/capi_1450acf9cfb3e79025d13b572c07e3cd_478ff5b6386a2af7ed12a496763f26f0.jpeg", "published_at": "2019-10-24"}