{"pub": "euronews", "url": "https://euronews.com/2019/10/06/family-u-k-teen-killed-crash-involving-spouse-u-s-n1062941", "downloaded_at": "2019-10-07 00:37:07.774199+00:00", "title": "'Left in the dark':' Family of U.K. teen killed in crash involving spouse of U.S. diplomat seeks answers", "language": "en", "text": "LONDON — The family of a British teen killed in a crash involving a spouse of a U.S. diplomat, who has since left the U.K., are calling for her to come back to face justice.\"She needs to come back and see what she's done,\" Charlotte Charles, the teen's mom, told NBC News Saturday, fighting back tears.The family says they want the suspect in their son's death to return to the U.K. to face a trial. But so far, they've had no answers. No one has been charged in connection with the case yet \"We've just been left in the dark,\" Charles said. \"We've got no answers, we've got nothing from her to say that she's remorseful,\" she added.\n\nHarry Dunn\\'s parents say they want justice for their son. Courtesy of the Dunn Family\n\nHarry Dunn, 19, was killed in late August in a collision near RAF Croughton, an air force base in Northamptonshire in central England that is used by the United States.He was on his motorcycle when he collided with a Volvo XC90 going the wrong way, according to police. A 42-year-old American woman is being treated as a suspect.The U.S. State Department confirmed to NBC News that the other driver was a spouse of a U.S. diplomat assigned to the U.K., but that due to security and privacy considerations, the identity of the diplomat or their spouse could not be revealed.\"We can confirm the family has left the U.K.,\" the State Dept. said, adding that \"any questions regarding a waiver of immunity with regard to our diplomats and their family members overseas in a case like this receive careful attention at senior levels are considered carefully given the global impact such decisions carry; immunity is rarely waived.\"Charles, 44, and the teen's father, Tim Dunn, 55, are hoping U.S. authorities, including President Donald Trump himself, will intervene.\"We need something,\" she added. \"And if they don't give themselves up, then President Trump needs to do something.\"Superintendent Sarah Johnson with Northamptonshire Police said in a statement Saturday that the suspect left the U.K. despite initially telling British investigators she had no plans to leave the country in the near future.Dunn's parents told NBC News they were informed that the diplomat's spouse had gone back to the U.S. when they had a meeting with the police a couple of days after Harry's funeral, which has left them \"in shock.\"Since then, they said there has been little in the way of an explanation or further details.With no one in custody, Charles told NBC News they are desperate for justice for Harry, who she described as a \"free-spirited\" boy with a huge heart and a passion for riding.NBC News legal analyst Danny Cevallos said under international law, diplomats have complete immunity from criminal liability, and almost complete immunity from civil liability, when they are visiting other countries. Cevallos said spouses of diplomats are entitled to diplomatic immunity as well, but the home country can always waive that immunity and allow the receiving country, in this case Great Britain, to prosecute the spouse of the diplomat.\"If I were advising this spouse as a client, I would recommend getting back to the U.S. as soon as you can,\" Cevallos said. \"Because, if for some reason this immunity ends up not applying, you'd rather be back in the U.S. and fighting an extradition than in the U.K. and trying to get out of jail,\" he said.Charles and Dunn said they have had no contact with anyone from the RAF base, U.S. Department of Defense or the U.S. State Department. However, U.S. ambassador to the U.K., Woody Johnson, had sent them a letter, which has been seen by NBC News, expressing his condolences.U.K. Foreign Secretary Dominic Raab told NBC News Saturday that he called the U.S. ambassador \"to express the U.K.'s disappointment with their decision and to urge the embassy to reconsider it.\" Dunn's family said they had received tremendous support from people in the U.S. and Americans living in the U.K.\"We've had many, many messages, and they're all disgusted. Absolutely disgusted,\" Charles said.Cevallos, the legal analyst, said there is little recourse for the victim's family, and as to possible assistance from Trump, he said the president has a difficult decision to make.\"He could waive this immunity, but on the other hand, he would be sending an American back to prosecution in a foreign court,\" he said.Cavellos said it's understandable that the victim's family is frustrated and wants to hear any word of comfort.\"This is one of the most emotionally difficult things about our legal system — that something morally right, like apologizing to a family for causing them a great deal of pain, is often a real legal liability and something that defense attorneys will tell their clients simply not to do,\" he said. \"It's just too risky legally to pick up the phone and say, 'I'm sorry' sometimes.\"", "description": "Harry Dunn, 19, was killed in late August in a collision near RAF Coughton, an air force base in Northamptonshire in central England that is used by the United States.", "authors": [], "top_image": "https://static.euronews.com/articles/4212394/1000x563_nbc-harry1final_cbb29cd830e9ef8e7f2c0a17a69b773d.jpg", "published_at": "2019-10-06"}