{"pub": "time", "url": "https://time.com/5683800/uk-iran-attack-saudi-arabia-oil-facilities", "downloaded_at": "2019-09-23 07:31:25.446552+00:00", "title": "U.K. Says Iran Responsible for Saudi Oil Facilities Attack", "language": "en", "text": "(NEW YORK) — Britain has concluded that Iran was responsible for attacks on oil facilities in Saudi Arabia, U.K. Prime Minister Boris Johnson said Sunday. He said the U.K. would consider taking part in a U.S.-led military effort to bolster the Gulf kingdom’s defenses.\n\nBut the Conservative prime minister also said the U.K. would work with allies to “de-escalate” Middle East tensions that have soared since the Sept. 14 attack on the world’s largest oil processor and an oil field.\n\nBritain had previously held back from attributing blame for the drone and missile attack. Saudi Arabia and the United States say Iran was responsible.\n\nJohnson told reporters flying with him late Sunday to New York for the U.N. General Assembly that now “the U.K. is attributing responsibility with a very high degree of probability to Iran” for the attack by drones and cruise missiles.\n\nThe Brief Newsletter Sign up to receive the top stories you need to know right now. View Sample Sign Up Now\n\n“We will be working with our American friends and our European friends to construct a response that tries to de-escalate tensions in the Gulf region,” Johnson said.\n\nJohnson said he would meet Iranian President Hassan Rouhani at this week’s high-level U.N. gathering. Johnson is also due to hold talks with U.S. President Donald Trump, German Chancellor Angela Merkel and French President Emmanuel Macron. He said he wanted Britain to be “a bridge between our European friends and the Americans when it comes to the crisis in the Gulf.”\n\nThe U.S. and Europe have diverged sharply on how to deal with Iran. European nations, including Britain, still adhere to an international deal designed to limit Iran’s nuclear ambitions, but Trump has pulled the U.S. out of the agreement.\n\nJohnson stressed the need for a diplomatic response to the Gulf tensions, but said Britain would consider any request for military help. The Trump administration announced Friday that it would send additional U.S. troops and missile defense equipment to Saudi Arabia and the United Arab Emirates as part of a “defensive” deployment. Officials said the number of troops was likely to be in the hundreds.\n\n“We will be following that very closely,” Johnson said. “And clearly if we are asked, either by the Saudis or by the Americans, to have a role, then we will consider in what way we could be useful. We will consider in what way we could be useful, if asked, depending on what the exact plan is.”\n\nIran’s president called on Western powers Sunday to leave the security of the Persian Gulf to regional nations led by Tehran.\n\nA U.K. official told The Associated Press that a claim of responsibility for the attacks by Iran-allied Houthi rebels in Yemen was “implausible.” He said remnants of Iran-made cruise missiles were found at the attack site, and “the sophistication points very, very firmly to Iranian involvement.” He spoke on the condition of anonymity to discuss intelligence findings.\n\nThe official did not say whether Britain believed the attack was launched from Iranian soil.\n\nIran denies responsibility and has warned any retaliatory attack targeting it will result in an “all-out war.”\n\nContact us at editors@time.com.", "description": "Britain has concluded that Iran was responsible for attacks on oil facilities in Saudi Arabia, U.K. Prime Minister Boris Johnson said", "authors": ["Jill Lawless"], "top_image": "https://timedotcom.files.wordpress.com/2019/09/boris-johnson-iran-uk-saudi-attack.jpg?quality=85&crop=0px%2C43px%2C1024px%2C536px&resize=1200%2C628&strip", "published_at": "2019-09-23"}