{"pub": "breitbart", "url": "https://breitbart.com/news/kurds-announce-deal-with-damascus-as-turkey-pushes-deep-into-syria", "downloaded_at": "2019-10-13 23:38:13.886746+00:00", "title": "Kurds announce deal with Damascus as Turkey pushes deep into Syria", "language": "en", "text": "Qamishli (Syria) (AFP) – Syria’s Kurds on Sunday announced a groundbreaking deal with Damascus on a Syrian troop deployment near the border with Turkey, as Ankara pressed a deadly cross-border offensive that has sparked an international outcry.\n\nThe announcement came as the United States ordered the withdrawal of almost its entire ground force in Syria.\n\nDefence Secretary Mark Esper said the move to withdraw 1,000 US troops came after Washington learned that Turkey was pressing further into Syria than had been expected.\n\nTurkey’s relentless assault, which has seen air strikes, shelling and a ground incursion manned mainly by Syrian proxy fighters, has killed scores of civilians and fighters since its launch on Wednesday.\n\nThe Kurds feel they have been betrayed by the United States, their once formidable ally in the fight against the Islamic State jihadist group, and left to fend for themselves in the battle against Turkish forces.\n\n– ‘Confront this aggression’ –\n\nThe massively outgunned Kurds described their deal with the Syrian government as a necessary step to stop the assault.\n\n“In order to prevent and confront this aggression, an agreement has been reached with the Syrian government… so that the Syrian army can deploy along the Syrian-Turkish border to assist the Syrian Democratic Forces (SDF),” the Kurdish administration said in a statement.\n\nIt came after Syria’s state news agency SANA said the army was sending troops to the north to “confront the Turkish aggression”.\n\nIn an editorial published in Foreign Policy magazine, SDF chief Mazlum Abdi wrote: “If we have to choose between compromises and the genocide of our people, we will surely choose life for our people.”\n\nKurdish authorities and foreign powers have warned of a major humanitarian crisis, which has already forced tens of thousands to flee their homes.\n\nThey have also warned repeatedly that the hostilities could undermine the fight against IS and allow jihadists to break out of captivity.\n\n– More civilian casualties –\n\nTurkey’s President Recep Tayyip Erdogan said the aim of Operation Peace Spring was to establish a “security zone” that would extend 30 to 35 kilometres (20 to 25 miles) into Syria and run between the Kobane to Hasakeh, a stretch of 440 kilometres.\n\nThe Syrian Observatory for Human Rights war monitor said at least 26 civilians were killed on Sunday.\n\nAmong them was Kurdish news agency ANHA’s correspondent, Saad Ahmad. He died in a Turkish air strike on a convoy of vehicles transporting civilians and journalists.\n\nAt least 60 civilians have now died on the Syrian side of the border, with Turkish reports putting the number of civilians dead from Kurdish shelling inside Turkey at 18.\n\nThe Observatory said pro-Ankara fighters “executed” at least nine civilians on Saturday near the Syrian town of Tal Abyad.\n\nThe Kurds said a female Kurdish party official and her driver were among those killed.\n\n– ‘Blood, not water’ –\n\nAid groups have warned of another humanitarian disaster in Syria’s eight-year-old war if the offensive is not halted.\n\nThe UN humanitarian agency OCHA said the exodus sparked by the fighting had grown to 130,000 people and it was preparing for that figure to more than triple.\n\nFrance’s President Emmanuel Macron, at a joint news conference with Germany’s Chancellor Angela Merkel, said the Turkish offensive — over which both countries have decided to suspend arms exports to Ankara — risked creating an “unbearable humanitarian situation”.\n\nMacron told reporters that he and Merkel had spoken separately with Trump and Erdogan to deliver a single, clear message: “Our common wish is that the offensive must cease”.\n\nPrime Minister Giuseppe Conte of Italy, one of Ankara’s main arms suppliers, said he would press for an EU ban on arms sales to Turkey.\n\nEven Turkish Cypriot leader Mustafa Akinci, who heads of a breakaway state only recognised by Ankara in the north of the east Mediterranean island, chimed in, issuing a highly rare rebuke of the Turkish government.\n\n“Even if we call it Peace Spring, it is blood that is spilling and not water,” Akinci wrote on Facebook.\n\n– Camp ‘without guards’ –\n\nOn the ground, the Kurdish administration in northern Syria said that Turkish bombardment near a camp for the displaced led to nearly 800 relatives of IS members fleeing.\n\nSome 12,000 IS fighters — Syrians, Iraqis as well as foreigners from 54 countries — are detained in Kurdish prisons, according to official Kurdish statistics.\n\nDisplacement camps host some 12,000 foreigners — 8,000 children and 4,000 women.\n\n“The brutal military assault led by Turkey and its mercenaries is now taking place near a camp in Ain Issa, where there are thousands (of people) from families of IS,” a Kurdish administration statement said.\n\n“Some were able to escape after bombardments that targeted” the camp, it said, adding that guards were attacked and the gates of the camp flung open.\n\nAin Issa camp is “now without guards” and 785 relatives of IS jihadists have fled, it said.\n\nAccording to the Observatory, at least 104 SDF fighters have been killed since the start of the Turkish offensive.\n\nTurkish forces and their proxies captured Tal Abyad on Friday afternoon, which left Ras al-Ain, further east, as the last major target in the offensive.\n\nTurkey announced it had seized the key M4 highway, which looks like it might mark the southern limit of its advance in this initial phase of the invasion.", "description": "Qamishli (Syria) (AFP) – Syria’s Kurds on Sunday announced a groundbreaking deal with Damascus on a Syrian troop deployment near the border", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/13/30b2e0_turkish-backed-forces-significant-progress-border-on-day-an-offensive-640x335.jpg", "published_at": "2019-10-13"}