{"pub": "cbc", "url": "https://cbc.ca/news/canada/ottawa/voters-turn-out-advance-polling-stations-1.5320733", "downloaded_at": "2019-10-15 08:11:56.111979+00:00", "title": "'Why not vote now?': Voters turn out in droves at advance polling stations | CBC News", "language": "en", "text": "It's the final week of the federal election campaign, and it turns out many Canadians have already made up their minds.\n\nTwo million Canadians turned out to vote in the first two days of advance polling over the Thanksgiving long weekend, up from 1.6 million during a similar two-day period in 2015.\n\n\"We usually only vote on election day if we've been away,\" said Patty Marchington Monday outside her polling station in Ottawa West–Nepean.\n\n\"We had our minds mostly made up, but reading the candidates' materials helped push us over the edge. [So] why not vote now?\"\n\nMichal Jacob also decided to check voting off her to-do list, since she'll be travelling on Oct. 21, which is election day.\n\nShe also said she \"just wanted to get it over with.\"\n\n\"It's getting a little tiresome with all the parties kind of duking it out and I just decided I don't really have to wait,\" Jacob said. \"I already know who I'm going to vote for.\"\n\nMichal Jacob says she'll be travelling on election day and wanted to make sure her vote was recorded. (Kimberley Molina/CBC)\n\nPolls open longer\n\nFor the first time, advance polling stations were open 12 hours a day.\n\nThose longer hours gave people more chances to vote, said Natasha Gauthier, a spokesperson with Elections Canada.\n\nShe said there's been an upswing in the number of people taking advantage of early voting since 2011.\n\n\"Every election, more and more people take up advance polling or voting by special ballot [or] voting in their Elections Canada office,\" Gauthier said.\n\n\"They really like having a lot of different ways to vote that fit their lifestyles, their schedules.\"\n\nThat includes Louise Charlebois, who said advance voting gave her daughter the ability to vote in their riding of Hull–Aylmer while she was home for the weekend from school.\n\n\"If she hadn't been here ... she probably wouldn't have [voted] where she's studying,\" Charlebois said.\n\nOther people also told CBC News they wanted to include their children to show them the importance of voting.\n\nA sign for Ottawa Centre Liberal candidate Catherine McKenna reminds voters that advance polls were open on the Thanksgiving long weekend. (Chris Rands/CBC)\n\nSomewhat surprising\n\nWhile the higher number of people voting at advance polling stations is a good sign, it may not be indicative of overall turnout, said CBC Polls Analyst Éric Grenier.\n\nInstead, it may be simply due to voters taking advantage of shorter lines or having the weekend off, Grenier said.\n\n\"It is in some ways surprising that turnout is up in an election that has seemed to be a rather negative one, where it hasn't seemed that people have been too engaged,\" said Grenier.", "description": "While their reasons varied, millions of Canadians turned out over the Thanksgiving long weekend to vote ahead of the Oct. 21 federal election.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5320752.1571097913!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/michal-jacob-oct-14-19.jpg", "published_at": "2019-10-15"}