{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/emiliano-sala-transfer-fee-row-20503635", "downloaded_at": "2019-10-06 11:32:33.388372+00:00", "title": "Emiliano Sala transfer fee row highlights football's unsavoury side", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nMore often than not when ­ex-pros talk about their time at a club you hear the usual platitudes.\n\n‘It was great there’, ‘I loved that manager’, ‘The fans were exceptional – I loved them and they loved me’.\n\nIt’s all nicey-nicey.\n\nThe reality, however, is that many former players harbour resentment of the clubs, owners, executives and ­managers they played for – because ultimately they came to realise they were nothing more than commodities to them. Pieces of meat.\n\nThe most grotesque manifestation of that can be seen in the unsavoury argument between Cardiff and Nantes over the ‘ownership’ of tragic Emiliano Sala.\n\nLast week, Cardiff were ordered to pay the first £5.3million instalment of the £15m that had been agreed between the two clubs, after FIFA’s player status committee sided with Nantes.\n\nBut now Cardiff plan to ­appeal to the Court of Arbitration for Sport. The Welsh club argue they are not liable because the original contract Sala signed was ­rejected by the Premier League over some clauses Nantes had demanded.\n\n(Image: ABACA/PA Images)\n\nCardiff say that when the plane he was on crashed into the Channel, Sala had not signed the revised version yet.\n\nOK.\n\nBut when I went on to Cardiff City’s website on Wednesday and typed the player’s name into the search bar, I was presented with a picture of Sala ­pretending to put pen to paper on a deal alongside chief executive Ken Choo.\n\nThe headline read, ‘Record signing – Emiliano Sala is a Bluebird’.\n\nBeneath it was another picture of the player with the headline, ‘Five facts about Emiliano Sala’, and the sub-heading, ‘Get to know our record signing!’.\n\n(Image: AFP/Getty)\n\nWhatever the paperwork says, at that point, you are a Cardiff player.\n\nThat’s why my heart and my head say Cardiff should have just paid the money and taken the loss.\n\nThe other most common sense ­option would have been for the two clubs to say at the beginning, ‘Look, this is an awful situation, let’s split the difference at £7.5m each’.\n\nThey could then have agreed to play an annual pre-season friendly for the next five to 10 years, alternating between Nantes and Cardiff.\n\nThey could have invited Sala’s ­family and friends, flown them over from Argentina and put them up, made a fuss of them and had them present the Emiliano Sala Trophy to the winning side.\n\n(Image: PA)\n\nThe two sets of fans could have mingled with no segregation, and the two clubs could have created a ­long-lasting bond.\n\nThe matter of a few million quid would have been quickly forgotten because some good had come out of an awful situation.\n\nCardiff fans, it must be said, were brilliant in the aftermath of Sala’s death and felt his loss every bit as much as their Nantes counterparts, even though he’d never kicked a ball for their club.\n\nThey made banners and signs, they mourned him and showed the real heart of the game.\n\nThey showed the difference ­between fans and the organisations who own the teams they follow.\n\nNantes and Cardiff both had a chance to show their best side as well.\n\nBut instead they have chosen to behave in a way that makes both clubs look greedy and uncaring – which is the industry I know.em", "description": "Cardiff City and Nantes are still in disagreement over the ownership of Emiliano Sala after he was killed in a plane crash in January", "authors": ["Stan Collymore", "Image", "Abaca Pa Images", "Afp Getty", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article14180262.ece/ALTERNATES/s1200/0_Tributes-To-Emiliano-Sala-Nantes.jpg", "published_at": "2019-10-06"}