{"pub": "washingtonpost", "url": "https://washingtonpost.com/business/2019/09/16/enticed-by-low-mortgage-rates-here-are-other-factors-you-should-weigh-when-determining-whether-buy", "downloaded_at": "2019-09-16 23:12:14.059363+00:00", "title": "Enticed by low mortgage rates? Here are other factors you should weigh when determining whether now is the time to buy.", "language": "en", "text": "\n\nLow rates aren't everything. You should also consider how long you will stay in the home before moving and whether you will recoup your transaction costs. (Steve Helber/AP)\n\nHere’s the big question many people are asking: Should I jump into the real estate market now to take advantage of the historically low mortgage rates?\n\nThe first thing to know: Rates are not everything.\n\nThere is no one-size-fits-all answer, but there are some baseline factors to consider when contemplating this question.\n\nWhat is your core reason for buying, aside from low rates?\n\n“If you don’t have a strong reason or purpose to buy, rates don’t matter,” said Koki Adasi, president of the Greater Capital Area Association of Realtors and a broker with Compass. “A buyer might want to be closer to work, have an easier commute, walkability, to be near shopping and restaurants. Those are core reasons to buy a home, then everything else is ancillary.”\n\nThere may be events in your life that impel you to buy a home — such as getting married or having children. In the late 1970s and early 1980s, interest rates peaked at 18.6 percent. But that didn’t stop people from buying homes. People buy when they need to buy. That hasn’t changed.\n\n[More Chodorov Kaminsky: Don’t get hosed when looking for a plumber]\n\n“My parents bought a home in the 1970s at double-digit rates,” said Sam Khater, chief economist with Freddie Mac. “They bought because they had three kids and needed a place to nest.”\n\nOf course, the price of a home in the 1970s was a fraction of today’s cost. If I could buy a house in Bethesda for $125,000, I would be very willing to pay 18 percent in interest. Of course, I didn’t have an income in the 1970s — I was in elementary school — but I can dream.\n\nBack to the present.\n\n“The decision to buy comes first, then you review mortgage rates and monthly payments to determine how much of a home you can afford,” Khater said.\n\nKhater said people in the millennial generation, ages 23 to 38, are buying homes based upon life circumstances. First-time home buyers make up 45 percent of home purchases. “They are getting married, having kids, and need to settle down.”\n\nHow long do you plan to own the home?\n\n“There are costs to buying real estate,” Adasi said. “If you plan to own the property for less than two years, you probably won’t recoup those costs.”\n\nCosts to purchase property include, but are not limited to, transfer and recordation taxes, title insurance, attorney fees, home inspections, appraisals, loan origination fees and commissions.\n\nWhen purchasing a home, upfront transaction costs for the buyer alone can add up to roughly 3 percent of the sale price. When selling a home, transaction costs can reach 7 to 9 percent of the sale price. Most often, the seller is paying the broker’s commission on top of their side of the transaction costs. Thus, on the purchase and sale of a $400,000 home, combined total transaction costs can reach $48,000.\n\nIf you plan to own the home for two years or less, you will most likely lose money. Gone are the days of big profits from quick flips. Khater estimates that it can take eight or nine years to break even on transaction costs.\n\nLow interest rates do offset the transaction costs over time. The longer you own the home, the more you will benefit from the low rate and the sooner you will break even on those costs.\n\nAnother item of consideration before buying — the glaring headlines in the news about a potential upcoming recession. This should give you pause before buying a home, although it may not be a reason to avoid homeownership all together.\n\n“Geography matters,” Khater said. “If you live in a region of the country whose economies are reliant on manufacturing and trade, you are more exposed to those headlines.”\n\nOther economic regions in the country are more insulated from a potential recession.\n\n[More Chodorov Kaminsky: Your hunt for a home should include research on the neighborhood’s long-term transit plan]\n\n“Rates are low, as low as I’ve ever seen,” said Nathaniel Faust, associate broker with Citi Habitats in New York. “But I wouldn’t say that sales have gone up because of the low rates.”\n\nFaust agrees that rates are not the only factor in making a purchase decision.\n\n“My buyers are still very thoughtful and cautious about what they are doing,” Faust said. “Low rates have gotten buyers out looking, but they want a good deal and they want to make a good choice.”\n\nHe added: “Buyers should know they will be comfortable in the property for at least five to seven years, in case they need to ride out a potential recession.”\n\nWill your mortgage payment be equal to or less than paying rent?\n\nI recently sold a condo unit to a young single man. His reason for buying — his rent was increasing each year. He evaluated the cost to own against the cost of renting and found that a mortgage payment was equal to or possibly less than his rent payment. The low interest rates helped in that calculation. That’s a valid reason for buying.\n\n“There are core financial reasons for buying a home,” Khater said. “For most Americans, the bulk of our wealth is tied up in our home equity. “Paying down a mortgage is a forced savings vehicle. The longer you own the house, the more equity you build up.”\n\nIf I already own a home, should I consider refinancing it?\n\nMany homeowners are taking advantage of low rates by refinancing their mortgages. Let’s say you save $100 per month. That can add up to significant savings on a 30-year mortgage — tens of thousands to hundreds of thousands depending on the size of your mortgage. In the case of refinancing, the same rule applies — if you plan to own the home for another two or three years, you may not recoup the upfront costs of refinancing. The savings apply only if you own the property for a longer period of time.\n\nCan you afford the monthly payments and unexpected maintenance costs?\n\nOne last thought: If you are considering purchasing an investment property while rates are low, ask yourself if you have the stomach to be a landlord. It’s not as easy as one might think or hope. There are local laws to follow; monthly costs for maintenance and unexpected repairs; taxes; insurance; mortgage payments; and calls in the middle of the night for emergency water leaks, etc.\n\nJill Chodorov Kaminsky, an associate broker with Long & Foster in Bethesda and a licensed real estate agent with CORE Real Estate in New York City, writes an occasional column about local market trends and housing issues. She can be reached at jill.kaminsky@icloud.com.", "description": "Low rates aren't everything. You should also consider how long you will stay in the home before moving and whether you will recoup your transaction costs.", "authors": ["Jill Chodorov Kaminsky", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/3gPXHzJ00hkoGClLjXkeREC6kcE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VZAPPUGE5UI6TC7XZXRNTYEQKU.jpg", "published_at": "2019-09-16"}