{"pub": "usatoday", "url": "https://usatoday.com/story/news/politics/2019/10/21/mitt-romney-pierre-delecto-reports/4050901002", "downloaded_at": "2019-10-21 13:22:20.168750+00:00", "title": "'C'est moi': Mitt Romney has been tweeting under the secret account, Pierre Delecto, reports say", "language": "en", "text": "CLOSE GOP Senate lawmakers reacted to Thursday's announced cease-fire in Syria, with the chairman of the Senate Foreign Relations Committee voicing approval, but Sen. Mitt Romney blasting the administration and calling for hearings. (Oct. 17) AP, AP\n\nYou may know him as Sen. Mitt Romney of Utah, the 2012 Republican presidential nominee with a fastidious approach to blowing out birthday candles, but according to news media reports, the mild-mannered Mormon also has an alter-ego who likes to live (slightly more) dangerously on social media.\n\nMitt Romney, you see, is also the mysterious Twitter user Pierre Delecto. And Pierre Delecto is Mitt Romney.\n\n\"C'est moi,\" Romney confessed in French when confronted about the secret Twitter profile by Atlantic reporter McKay Coppins on Sunday.\n\nEarlier that day, Coppins published a profile on Romney in which he shared the existence of the secret social media profile he uses to follow the political discussion.\n\nJust spoke to @MittRomney on the phone, and asked him about Pierre Delecto. His only response: \"C'est moi.\" Updated my story accordingly: https://t.co/kcfIopokWh — McKay Coppins (@mckaycoppins) October 21, 2019\n\n\"What do they call me, a lurker?\" Romney said.\n\nThough he did not divulge the name of the Twitter handle, he let slip that he followed 688 people.\n\nSlate reporter Ashley Feinberg then used that limited data to infer that the Pierre Delecto account was, in fact, Romney.\n\nThe account has since been made private, but according to screenshots of his posts taken by reporters, Romney appears to have primarily used the Twitter profile to anonymously defend himself from posts or comments on the social media platform that he felt were unfair.\n\nFor example, when Soledad O'Brien shared a story from The Hill about Romney's questioning whether he would endorse Trump in 2020, O'Brien wrote, \"Utter lack of a moral compass.\"\n\n\"Only Republican to hit Trump on Mueller report, only one to hit Trump on character time and again, so Soledad, you think he's the one without the moral compass?\" tweeted Delecto in response.\n\nWhen Brit Hume, from Fox News, shared a Daily Caller story about Romney's statement that President Donald Trump's withdrawal from Syria made the U.S. an \"unreliable ally,\" along with the comment, \"Some might say Romney is too.\"\n\n\"Loyal to principle trumps loyalty to party or person, right Brit?\" Delecto replied.\n\nWhen conservative Washington Post columnist Jennifer Rubin tweeted that Romney's way of dealing with Trump was \"nonconfrontation verging on spinelessness,\" Delecto replied, \"Jennifer, you need to take a breath. Maybe you can then acknowledge the people who agree with you in large measure even if not in every measure.\"\n\nAnd when one Twitter user said, \"Congrats GOP Senate. Well done,\" regarding the fallout from Trump's Syria withdrawal, Romney tweeted in his Delecto guise, \"John, agree on Trump's awful decision, but what could the Senate do to stop it?\"\n\nSlate also shared some of the posts liked by Romney via the Delecto account. Many of them were posts that were positive about himself.\n\nFor example, he liked one post from Washington Post reporter Matt Viser, in which Viser asked, \"Who is having the better Saturday?\" with a photo of Romney at a pumpkin patch with his family beside a Trump Twitter rant in which he called Romney \"pompous.\"\n\nWho is having the better Saturday? pic.twitter.com/qFZ4svo6Bt — Matt Viser (@mviser) October 5, 2019\n\nHe also liked a post from blogger Christian Schnieder that shot down Trump's claim that Utah voters were regretting their support for Romney.\n\n\"The people of Utah were so disgusted by Romney's criticisms of Trump they elected him to the Senate in 2018 by a 62%-30% margin,\" Schnieder wrote, to Delecto's delight.\n\nThe people of Utah were so disgusted by Romney's criticisms of Trump they elected him to the Senate in 2018 by a 62%-30% margin https://t.co/I1GsdqYv8D — Christian Schneider (@Schneider_CM) October 5, 2019\n\nUsing the Delecto cover, Romney also liked a number of tweets that were critical of Trump, such as posts from conservative lawyer and fierce Trump critic George Conway, the husband of White House counselor Kellyanne Conway. Slate said Conway \"appears to be a particular favorite\" of Delecto's, including tweets questioning Trump's fitness for office.\n\nHe also liked a tweet from political analysts Jeff Greenfield, who said he was \"reassessing\" his position on using the 25th Amendment to declare the president unfit for office.\n\nI've always thought that \"invoke the 25th amendment!\" was a misguided, futile notion but after this Tweet from the President, I'm reassessing... https://t.co/MFs3MpT6kj — Jeff Greenfield (@greenfield64) October 7, 2019\n\nAnd he was one of more than 19,000 people who liked a tweet from the infamous Devin Nunes's Cow account that slammed former House Speaker Newt Gingrich for hypocrisy in the impeachment of President Bill Clinton.\n\nNo one should be confused by the current phony, one sided, partisan impeachment. I led a serious impeachment effort with a special counsel who said President Clinton was guilty on count fter count. Look at our rules for fairness and the lynch mob approach of Schiff and Pelosi. — Newt Gingrich (@newtgingrich) September 30, 2019\n\nRomney's office did not respond to USA TODAY's request for comment on the Pierre Delecto account.\n\nRead or Share this story: https://www.usatoday.com/story/news/politics/2019/10/21/mitt-romney-pierre-delecto-reports/4050901002/", "description": "\"C'est moi,\" Romney confessed in French when confronted about the secret Twitter profile by Atlantic reporter McKay Coppins on Sunday.", "authors": ["William Cummings", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/21/USAT/aa07ada8-d99f-45b7-8670-8ad63cc30092-AP_Trump_Impeachment_Romney.JPG?crop=5217,2935,x183,y157&width=3200&height=1680&fit=bounds", "published_at": "2019-10-21"}