{"pub": "cnbc", "url": "https://cnbc.com/2019/09/12/steve-jobs-trait-bill-gates-envied-the-most.html", "downloaded_at": "2019-09-12 23:51:00.870412+00:00", "title": "Bill Gates says this is the Steve Jobs trait he envied the most", "language": "en", "text": "Bill Gates and Steve Jobs are two of the most high-profile tech titans of the past century, and they also had a famously fierce rivalry that evolved into a friendship based on mutual respect until Jobs passed away in 2011.\n\nGates, the billionaire co-founder of Microsoft and the world's second-wealthiest person, has praised the Apple co-founder in the past for Jobs' leadership qualities and his uncanny ability to motivate his employees. But, there is one specific trait of Jobs' that Gates is still particularly envious of, Gates says in a new interview with The Wall Street Journal.\n\nThe former Microsoft CEO talks about how he's had to work hard to become a better public speaker throughout his career and admits that public speaking was one area where Jobs easily had him beat, according to the interview, published on Tuesday to promote the new Netflix documentary on Gates' life and career that premieres on Sept. 20.\n\n\"Steve Jobs was always more of a natural at that,\" Gates tells WSJ about Jobs' public speaking abilities, which Gates says allowed Jobs to sell people on any product, even a subpar one. \"He could talk about what, in the case of NeXT Computer [his follow-up after being ousted from Apple], was not that good of a machine, yet mesmerize people to death if they happened to be in the auditorium.\"\n\nGates goes on to say that he wishes he could emulate his former friend and rival in that regard, especially with respect to raising awareness for various philanthropic causes that Gates and his wife, Melinda, champion through their non-profit foundation.\n\n\"I wish I could be as magical because I have causes that are in some ways more impactful and I need to make sure they don't get ignored,\" Gates says in the interview, referring to the work the Bill & Melinda Gates Foundation does to address global issues, from disease prevention research to fighting poverty.", "description": "It's a skill that billionaire Microsoft co-founder Bill Gates is just \"OK\" at, he tells The Wall Street Journal.", "authors": ["Tom Huddleston Jr."], "top_image": "https://image.cnbcfm.com/api/v1/image/103308049-GettyImages-103012166.jpg?v=1532564202", "published_at": "2019-09-12"}