{"pub": "yahoo", "url": "https://news.yahoo.com/pete-buttigieg-may-stealing-joe-152250809.html", "downloaded_at": "2019-10-28 00:27:15.078730+00:00", "title": "Pete Buttigieg may be stealing some of Joe Biden's donors", "language": "en", "text": "Financial anxiety is creeping into former Vice President Joe Biden's Democratic presidential campaign, The New York Times reports.\n\nIn a confidential memo this week, Biden's campaign manager Greg Schultz, asked top donors to \"dig deep\" to help alleviate some of the struggles. The Biden campaign is spending more than it's taking in and only has $9 million in cash on hand, which pales in comparison to Sens. Elizabeth Warren (D-Mass.) and Bernie Sanders (I-Vt.), and even trails South Bend, Indiana, Mayor Pete Buttigieg and Sen. Kamala Harris (D-Calif.). One of the cost-cutting solutions being considered is to have campaign staffers sleep at the homes of volunteers.\n\nIn the same memo Schultz ultimately dismissed concerns and assured donors the campaign \"will have the resources we need to execute our plan.\" But it's not clear if Biden's supporters feel the same way. Bradley Tusk, who served as a re-election campaign manager for former New York City Mayor Michael Bloomberg, hosted a fundraiser Monday for Buttigieg, and he told the Times the crowd was filled with \"a lot of those people you would have thought would be Biden people. And they weren't.\" Tusk said the \"feeling in the room was that Biden has already lost.\"\n\nIt can't be said for certain whether that was an accurate read of the room, but it does fall in line with the perception that Buttigieg is looking to snag the moderate Democratic vote from Biden. Still, not everyone's worried. \"Any other candidate, it might concern you,\" Texas Biden bundler Mike Collier said of the campaign's financial situation. \"But with someone like Joe, I'm not anywhere near as concerned.\" Read more at The New York Times.", "description": "Financial anxiety is creeping into former Vice President Joe Biden's Democratic presidential campaign, The New York Times reports. In a confidential memo this week, Biden's campaign manager Greg Schultz, asked top donors to \"dig deep\" to help alleviate some of the struggles. The Biden", "authors": ["Tim O'Donnell"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-26"}