{"pub": "fox", "url": "https://foxnews.com/sports/jason-kidd-lakers-frank-vogel-tweet-picture", "downloaded_at": "2019-10-23 23:37:36.611334+00:00", "title": "Jason Kidd gets ripped on social media for leaving out Lakers coach in tweet to team", "language": "en", "text": "When Jason Kidd joined Los Angeles Lakers coach Frank Vogel’s staff in the summer, there was immediate speculation that the former NBA point guard was eying a bigger role with the team.\n\nKidd’s motives were questioned again Tuesday when he tweeted a photo of himself with some players from the Lakers, including LeBron James, Anthony Davis and Alex Caruso. The photo included a tiny shot of Vogel over Caruso's right shoulder.\n\nKLAY THOMPSON'S RETURN TO WARRIORS UNCLEAR AS HE RECOVERS FROM TORN ACL, STEVE KERR SAYS\n\n“A new chapter of @Lakers basketball begins tonight,” Kidd tweeted ahead of the Lakers’ game against the Los Angeles Clippers.\n\nNBA fans immediately came after Kidd for the post.\n\nZION WILLIAMSON SPECULATION OVER MENISCUS INJURY 'ASININE,' PELICANS GENERAL MANAGER SAYS\n\nKidd has previously coached the Brooklyn Nets and Milwaukee Bucks.\n\nHe was traded by the Nets to the Bucks after one season for two draft picks.\n\nIn four seasons with the Bucks, he was 139-152 and was fired during the 2017-18 season. He only led the Bucks to two playoff appearances in that span.\n\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\n\nHe then joined the Lakers in the offseason.", "description": "When Jason Kidd joined Los Angeles Lakers coach Frank Vogel’s staff in the summer, there was immediate speculation that the former NBA point guard was eying a bigger role with the team.", "authors": ["Ryan Gaydos", "Ryan Gaydos Is A Sports Reporter For Foxnews.Com", "Foxbusiness.Com. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/PI-NBA-jason-kidd-070214.vresize.94-b8039c3c523ef410VgnVCM100000d7c1a8c0____.jpg", "published_at": "2019-10-23"}