{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/22/letters-to-the-editor-climate-bogeyman", "downloaded_at": "2019-09-22 23:12:35.051386+00:00", "title": "LETTERS TO THE EDITOR: Climate bogeyman", "language": "en", "text": "ANALYSIS/OPINION:\n\nThe Washington Times and many media outlets have printed stories about Swedish teen climate activist Greta Thunberg and other children frightened of climate change (“Prophet or puppet? Teen climate activist Greta Thunberg’s arrival ignites exploitation debate,” Web, Aug. 29). I’ve spent thousands of hours studying the issue and have come up with questions for Greta et al. I can’t answer these questions and neither, it seems, can Greta and her friends.\n\nPrecisely what is climate change? When are the supposedly deadly events the left constanty blathers about going to take place? A bogeyman is defined as an imaginary evil spirit or being used to frighten children. Well, we are seeing a climate bogeyman in the form of Greta, the adults enabling her, and their ilk.\n\nI was born in 1947 in Niagara Falls, Canada. Until the great President Ronald Reagan quashed the U.S.S.R., I lived with a real existential threat; the power plants at Niagara were targets for at least two nuclear Russian missiles. After the tens of thousands of “Ban the Bomb” supplications, approximately 14,000 nuclear missiles still exist.\n\nALAN L. STEWART\n\nSt. Catharines, Ontario\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The Washington Times and many media outlets have printed stories about Swedish teen climate activist Greta Thunberg and other children frightened of climate change (\"Prophet or puppet? Teen climate activist Greta Thunberg's arrival ignites exploitation debate,\" Web, Aug. 29). I've spent thousands of hours studying the issue and have come up with questions for Greta et al. I can't answer these questions and neither, it seems, can Greta and her friends.", "authors": ["The Washington Times Http", "The Washington Times"], "top_image": "", "published_at": "2019-09-22"}