{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/22/learn-how-to-win-customers-and-influence-consumers-at-disrupt-berlin", "downloaded_at": "2019-10-22 14:01:55.091517+00:00", "title": "Learn how to win customers and influence consumers at Disrupt Berlin – TechCrunch", "language": "en", "text": "Every startup is a story and every startup’s success depends — on some level — on how well they can either tell that story or get that story told.\n\nThe best stories are the ones that create an instant brand. One that sparks a relationship or a moment of inspiration with customers and consumers alike. Those are the stories that transform industries and re-contextualize how businesses think of themselves and their competition.\n\nOn the ExtracCruch stage at Disrupt Berlin three of the finest practitioners of the dark arts of branding, public relations, marketing and communications will share their tips and tricks on how to get coverage for a company and how to use that coverage to get at the strategic objectives that companies need to fulfill as they grow.\n\nThese alchemists of allusive include Collette Ballou, the founder of the eponymous Ballou PR; Katy Turner, the managing director of Multiple; and longtime public relations pro, Joanna Kirk.\n\nBallou began her career in European public relations in the aftermath of the dot-com collapse in the U.S. in 2001. Both an investor and an entrepreneur, Ballou has worked with startups and investment firms including 83 North, Accel Partners, Box, Criteo, Eventbrite, Facebook, GoEuro, (now Omio), Lakestar, Pinterest, Stack Overflow, Stripe, TransferWise, Twilio, Waze, WhatsApp and Zendesk. She also is an investor in venture funds . including Cavalry Ventures and Connect Ventures.\n\nBefore founding Multiple, Turner worked in several different roles across the tech industry in the UK and Europe. She began her career at Orange, (in a time when it was actually cool to work for a mobile operator, she says). That role led to positions at Eden Ventures, Videoplaza, and as the chief marketing officer at Tech City UK. In addition to her work at Multiple, Turner also serves as a mentor for Seedcamp and Techstars and sits on the investment committee for the University of Bristol’s Enterprise Fund.", "description": "Every startup is a story and every startup’s success depends — on some level — on how well they can either tell that story or get that story told. The best stories are the ones that create an instant brand. One that sparks a relationship or a moment of inspiration with customers and consumers alike. […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/GettyImages-3244524.jpg?w=715", "published_at": "2019-10-22"}