{"pub": "fox", "url": "https://foxbusiness.com/energy/bp-chief-to-retire-having-steered-oil-giant-through-gulf-spill-fallout", "downloaded_at": "2019-10-04 12:33:17.917566+00:00", "title": "BP chief to retire having steered oil giant through gulf-spill fallout", "language": "en", "text": "BP PLC Chief Executive Bob Dudley will retire next year, after almost a decade steering the U.K.-based energy giant through the aftermath of the Deepwater Horizon crisis.\n\nContinue Reading Below\n\nHe will be succeeded by Bernard Looney, the chief executive of BP’s upstream segment. Mr. Looney will take up the CEO role and join the BP board on Feb. 5, the company said Friday.\n\nMr. Dudley took the reins as CEO from Tony Hayward in 2010, taking over responsibility for the Gulf of Mexico oil-spill containment and cleanup operation. The 2010 explosion killed 11 people and unleashed the worst offshore oil spill in American history, resulting in a $20 billion settlement with the U.S. government. Mr. Dudley also navigated the company through a collapse in oil prices, which forced the entire industry to cut costs and adjust to a world of cheaper crude.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nUnder Mr. Dudley the company embarked on a huge divestment plan and is on track to have sold $75 billion of assets by 2020. It also returned to making acquisitions, most recently buying BHP Billiton Ltd ’s onshore U.S. oil and gas assets for near $11 billlion.\n\n“During his tenure he has led the recovery from the Deepwater Horizon accident, rebuilt BP as a stronger, safer company and helped it re-earn its position as one of the leaders of the energy sector,” said Chairman Helge Lund. “This company—and indeed the whole industry—owes him a debt of gratitude.”\n\nBefore becoming CEO, the American-born Mr. Dudley ran BP’s joint venture with a group of Russian billionaires, TNK-BP Ltd., but was forced out in 2008 following a dispute over control of the company.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nMr. Dudley will formally step down as CEO in February and retire in March.", "description": "Bob Dudley navigated the company through some of its most turbulent times, including a collapse in oil prices", "authors": [], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/01/0/0/Bob-Dudley-BT.jpg?ve=1&tl=1", "published_at": "2019-10-04"}