{"pub": "investing.com", "url": "https://ca.investing.com/news/commodities-news/preciousgold-rises-as-stocks-pull-back-on-waning-trade-deal-optimism-1984125", "downloaded_at": "2019-10-14 11:31:37.488466+00:00", "title": "PRECIOUS-Gold rises as stocks pull back on waning trade deal optimism", "language": "en", "text": "© Reuters. PRECIOUS-Gold rises as stocks pull back on waning trade deal optimism\n\n(Updates prices, adds comments and details)\n\n* Palladium hits record high of $1,706.42/oz\n\n* Brexit hangs in balance as EU demands more UK concessions\n\nBy Sumita Layek\n\nOct 14 (Reuters) - Gold firmed on Monday as a lack of clarity on U.S.-China trade ties pushed investors back to safe havens and drove a retreat in stock markets, while palladium continued its record run to notch up a fresh all-time high.\n\nSpot gold was up 0.4% at $1,494.74 per ounce as of 1011 GMT, having shed 1% last week. U.S. GCcv1 gained 0.7% to $1,498.90 per ounce.\n\nU.S. President Donald Trump on Friday outlined the first phase of a deal to end the protracted Sino-U.S. trade war and suspended a threatened tariff hike, the biggest step by the two countries in 15 months. shouldn't get overexcited with what's happening now especially in terms of the trade dispute, because nothing has dramatically changed and I'd be a little cautious now to conclude that things are heading in the right direction,\" said Hussein Sayed, chief market strategist at FXTM,\n\n\"We had some kind of trade truce, not a trade deal with the U.S. and China ... also, we don't see solid comments that we're going to arrive into a Brexit deal as of now. (These factors) should keep some sort of floor on gold prices.\"\n\nA global index of stock markets slipped as signs of progress in the trade dispute drew mixed a reaction from investors, with some cautioning over a lack of detail in the initial stages of the agreement. MKTS/GLOB\n\nLimiting gold's upside, the recovered from a three-week low hit in the previous session. USD/\n\n\"From a technical point of view, prices are still in a lateral mode, with a first resistance placed at $1,500, followed by another key level at $1,515. Vice versa, a fall below $1,470 would denote further weakness,\" ActivTrades chief analyst Carlo Alberto De Casa said in a note.\n\nInvestors are now looking forward to a summit between the European Union and Britain in Brussels on Thursday and Friday.\n\nHowever, a deal to smooth Britain's departure from the EU hung in the balance after diplomats indicated the bloc wanted more concessions from British Prime Minister Boris Johnson and said a full agreement was unlikely this week. are clearly waiting a fresh catalyst which could come from the trade war or from central banks or to a lesser extent from Brexit,\" De Casa said.\n\nElsewhere, palladium rose 0.1% to $1,701.12 an ounce, having earlier hit a fresh record high of $1,706.42. The metal used in vehicle exhausts to reduce harmful emissions has been grappling with a sustained supply shortfall, helping it rally over $300 since early August when it touched a near two-month low. inched 0.4% higher to $17.61 per ounce and platinum rose 0.4% to $892.65.", "description": "PRECIOUS-Gold rises as stocks pull back on waning trade deal optimism", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPED4U0TY-ORUBS_L.jpg", "published_at": "2019-10-14"}