{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/thomas-cook-plane-graveyard-aircraft-20636442", "downloaded_at": "2019-10-16 21:03:41.587493+00:00", "title": "Thomas Cook plane graveyard where aircraft from bust airline are being stored", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAn airport in Cornwall has become the final resting place for a host of Thomas Cook planes after the holiday firm went bust.\n\nThirty-four planes the airline either leased or owned are currently spread around Europe and the UK, where they will likely remain grounded and updated with new branding before going to new operators.\n\nSeveral of these planes are now being stored and maintained at Newquay airport, in Cornwall - which is expecting several more arrivals in coming days.\n\nThomas Cook collapsed last month after failing to secure an extra £200m needed to keep it afloat.\n\nThe firm's collapse also triggered the biggest ever peacetime repatriation, which aimed at bringing more than 150,000 holidaying Britons back home.\n\nThe tour operators failure saw thousands of people lose jobs - including 9,000 in the UK.\n\n(Image: Universal News And Sport (Europe))\n\n(Image: Rex)\n\nWhen Thomas Cook went into liquidation the firm's fleet of planes - 31 of which they leased - was stranded and not allowed to fly, the BBC reported.\n\nSeveral of these planes have been spotted in Newquay, Cornwall, where they are being put through regular maintenance checks and \"full engine runs\".\n\nRyan Winfield, from Apple Aviation, said some of the stranded aircraft were being retrieved by flight operations companies.\n\n\"At Newquay they are being put in to storage and maintained in an airworthy condition until such time the aircraft owner makes a decision on the plans for them, likely moving to new operators,\" he said.\n\n(Image: Universal News And Sport (Europe))\n\nApple Aviation was currently storing four Thomas Cook planes ahead of their reassignment.\n\nEngineers have to make regular checks to ensure they remain airworthy.\n\nAircraft engineer Sam Hughes lost his job with Thomas Cook in Manchester but has been employed by Apple Aviation in Newquay.\n\nHe said he had been 'quite fortunate' to find work but his former colleagues were 'angry and gutted' at the travel firm's demise.\n\nBut it could be months before the holiday jets are rebranded and repainted for new owners.\n\nIn the hours after the travel firm - which has been in operation since 1841 - ceased trading, the government came under fire for not putting a rescue package together.\n\n(Image: Universal News And Sport (Europe))\n\nAnd calls have been mounted for senior figures within the company to return generous bonuses as 9,000 UK workers saw their jobs wiped out.\n\nPeter Fankhauser told MPs yesterday he was \"deeply sorry\" he failed to save the company but he looked uncomfortable as the chair of the business committee suggested he should personally cough up.\n\nMr Fankhauser has previously said half of the £8.3million package he got since 2014 came is now worthless shares in the travel giant.\n\nMeanwhile some 6,000 of the travel giant's 9,000 UK staff were not paid their month’s wages due at the end of last month.\n\nKicking off the grilling of the boss in parliament yesterday, Chair Rachel Reeves said: \"Your apologies would perhaps ring a bit more true if you were willing to do something about it.\"\n\nShe told the former CEO: \"At the moment \"I'm afraid Mr Frankhauser the number of times you've said 'sorry' when you're not willing to put something back.\"\n\nAsked about his pay Mr Fankhauser said: \"I'm not going to try and defend my base pay because in relation to a normal worker's base salary this is a normal amount.\"\n\nBut he insisted that he \"worked extremely hard and exhaustively hard\" for the money.\n\nMeanwhile, a website has been set up by the Civil Aviation Authority through which Thomas Cook customers could claim refunds for their trips.\n\nIt was set up to enable people with Atol-protected bookings for Thomas Cook holidays due to begin after the firm collapsed on September 23 to obtain refunds.\n\n(Image: Peter Summers)\n\nThis relates to more than 360,000 bookings covering trips set to be taken by 800,000 people.\n\nAtol-protected customers who were already abroad when Thomas Cook failed can also claim for the cost of replacing the parts of their holiday which were financially protected, or out-of-pocket expenses for delayed flights.\n\nThe CAA is aiming to pay refunds within 60 days of receiving a valid form and wants to crack down on fraudulent activity to avoid any delay.", "description": "Thomas Cook planes are being stored and maintained around Europe and the UK ahead of their reassignment including in Newquay, Cornwall", "authors": ["Nick Irving", "Image", "Universal News And Sport", "Europe", "Rex", "Peter Summers"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20636649.ece/ALTERNATES/s1200/4_PAY-Thomas-Cook-collapses-as-last-ditch-rescue-talks-fail211.jpg", "published_at": "2019-10-16"}