{"pub": "metro", "url": "https://metro.co.uk/2019/10/20/love-island-star-curtis-pritchard-shares-amazing-tip-overcome-negative-thoughts-10952649", "downloaded_at": "2019-10-20 23:24:28.127019+00:00", "title": "Curtis Pritchard offers some great advice on beating negative thoughts", "language": "en", "text": "Curtis Pritchard is urging fans to consider what they like about themselves. (Picture: Getty Images)\n\nCurtis Pritchard has offered some pretty sound advice to anybody struggling with negative thoughts.\n\n‘Write five things that are positive about yourself,’ the star suggests, ‘Anything!’\n\nThe 23-year-old explained: ‘So if I was to do it about myself, I’d say I’ve got a smiley personality; I like to talk to people; I love to check on everybody; I like to have a laugh and I’m emotional as well.\n\n‘I’ll say it to myself every morning when I get up – I’ll say it straight away. It’s just a way to start your day off in a positive manner.’\n\nHe went on: ‘If you’re in a down situation and you’re trying to turn your life around, you’re going to be waking up with negative thoughts, you’re going to be waking up feeling like s**t and hating life – not wanting to eat, or wanting to eat more!\n\nCurtis is of course currently dating fellow Love Island star Maura (Picture: PA)\n\n‘With this, you start off on a positive note, you recognise that wherever you are in life, you’re amazing, you’re unique, you’re different from everyone else for the best reasons!’\n\nAdvertisement\n\nAdvertisement\n\nThe reality TV star and WW (formally Weight Watchers) ambassador made the comments after speaking about body positivity at a London recording of blogger Candice Brathwaite’s panel discussion TeaTime at London’s Century Club.\n\nCurtis and his brother AJ, who is a dancer on Strictly (Picture: REX)\n\nIn other recent Curtis news, the professional dancer last week revealed he and fellow Love Island contestant Maura Higgins are now officially a couple.\n\nCongrats guys!\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Alison Hammond learns a move or two from Love Island star Curtis Pritchard\n\nMORE: Love Island’s Maura Higgins and Curtis Pritchard reveal they’re officially a couple", "description": "TV star Curtis Pritchard's in a relationship with fellow Love Island contestant Maura Higgins and is the brother of Strictly's AJ Pritchard.", "authors": ["Jamie Tabberer"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1166803517-e1571594680554_1571605489.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-20"}