{"pub": "cnn", "url": "https://bleacherreport.com/articles/2856917-should-the-dallas-cowboys-be-worried-about-dak-prescott?utm_source=cnn.com&utm_campaign=editorial&utm_medium=referral", "downloaded_at": "2019-10-07 04:07:55.494242+00:00", "title": "Should the Dallas Cowboys Be Worried About Dak Prescott?", "language": "en", "text": "Ron Jenkins/Associated Press\n\nWhen Dallas Cowboys quarterback Dak Prescott struggled last week in New Orleans, it was argued by some that he fell victim to the Superdome, where it's loud and wild and a lot of quarterbacks have died a slow death.\n\nThen came Prescott's performance against the Green Bay Packers on Sunday. Again, he looked off. No, the Cowboys' 34-24 loss wasn't all on Prescott. Packers running back Aaron Jones had four billion yards and 70 touchdowns—OK, he actually had 182 yards from scrimmage and four touchdowns, but it seemed like a lot more.\n\nPrescott and running back Ezekiel Elliott, on the other hand, were mostly stuffed by a tremendous—and still underrated—Green Bay defense.\n\nPrescott connected on a few accurate deep throws to receiver Amari Cooper and Elliott. But overall, the Cowboys star quarterback looks like he took as many steps back as he did steps forward when Dallas was 3-0. The alarming part is it's the second consecutive game he's looked like this. Not coincidentally, he was on fire in the first three games against the Giants (2-3), Washington (winless) and Miami (extremely winless).\n\nIn short, it looks like Prescott is beating up on bad teams and losing to the good ones. Actually, it doesn't look like that; it is that.\n\nThus, it's fair to ask the following question: Should the Cowboys be worried about Prescott?\n\nThe answer is yes.\n\nPrescott will have to play better—a lot better—for the Cowboys to dominate the conference the way so many of us thought they would. If he keeps playing like this in big games, Dallas won't even win the NFC East.\n\nPhiladelphia will.\n\nBy the time Prescott pulled it together Sunday, it was too late. Dallas was down 24-0 midway through the third quarter before engineering its first points: a field goal with just over 20 minutes left in the game. Prescott didn't throw his first touchdown pass—a 40-yard touchdown to Michael Gallup—until the final two minutes of the third quarter.\n\nDown early, Prescott was forced to throw, which allowed him to pile up 463 yards passing but also saw him get picked three times.\n\nTruth be told, it should have been more, but the football he floated into the hands of Green Bay cornerback Kevin King bounced off them—that's why he's a defensive back—and another overthrow was intercepted before a Packers penalty negated it. Actually, \"overthrow\" is generous. Prescott, throwing off his back foot, just tossed it up for grabs to Randall Cobb.\n\nWesley Hitt/Getty Images\n\nThey weren't so lucky on the next potential interception, which King did secure with about 10 minutes left. The turnover, coming after Dallas had climbed within 14, effectively killed any chances of a Cowboys comeback. Prescott threw a score to Cooper a few minutes later, but it was too late.\n\nTo be fair, Prescott was facing a transformed Packers culture in which defense, not offense, now dominates. Green Bay is allowing fewer than 19 points per game and entered Week 5 allowing the third-fewest passing yards per contest.\n\nAnd while it's true the Cowboys made a game out of what looked to be a blowout, the score didn't indicate what the Cowboys and their fans expect. It showed guts, but it also showed a lot to be unnerved about.\n\nTwo losses to two quality opponents due, in part, to a shaky performance from the quarterback is not what contenders are made of. At least, at this point in the season, that's how it looks.\n\nThe Cowboys have guts. Prescott has guts. They were always going to make a late run, though the partial comeback was more about the Cowboys defense than Prescott.\n\nBut if you're the Cowboys, these past two games have to be unsettling.\n\nIf Prescott's season goes on as it has thus far, there will be better days ahead. Games against the Jets and Giants sandwiched around a date with the Eagles would promise a 5-3 mark at the halfway point. Not bad.\n\nBut then come the Vikings, the Lions (not the normal slobs they usually are) and the Patriots.\n\nIf Prescott doesn't play better—a lot better—they could lose all three of those games. Yes, even to the 2-1-1 Lions. (The Lions beat the Chargers and Eagles and gave the Chiefs a nice fight before losing 34-30.)\n\nMichael Ainsworth/Associated Press\n\nThat would be a problem for a team with big ambitions.\n\nIf Prescott can raise his game, it shouldn't be an issue. But after Sunday, the questions are growing about whether he can.\n\nMike Freeman covers the NFL for Bleacher Report. Follow him on Twitter: @mikefreemanNFL.", "description": "When  Dallas Cowboys  quarterback Dak Prescott struggled last week in  New Orleans , it was argued by some that he fell victim to the Superdome, where it's loud and wild and a lot of quarterbacks have died a slow death...", "authors": ["Mike Freeman"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/831/791/hi-res-868f8ff36ecf68d78a6874a1860c28e4_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-10-07"}