{"pub": "thehill", "url": "https://thehill.com/opinion/white-house/459197-trump-can-change-history-by-declassifying-three-obama-era-documents", "downloaded_at": "2019-09-04 03:47:54.601396+00:00", "title": "Trump can change history by declassifying three Obama-era documents", "language": "en", "published_at": "2019-08-28", "text": "My sources tell me President Trump Donald John Trump Poll: 40 percent of voters don't think Trump will win reelection Mattis: 'I'll speak out' about policy issues 'when the time comes' China contests Trump claim it is fentanyl source MORE is putting the finishing touches on a White House initiative to declassify documents that have remained hidden from the public for far too long.\n\nThis welcome effort to provide more public transparency and accountability almost certainly will focus early on the failings of the now-debunked Russia collusion probe. And I’m sure it will spread quickly toward other high-profile issues, such as the government’s UFO files that have been a focus of clamoring for decades.\n\nBut my reporting indicates three sets of documents from the Obama years should be declassified immediately, too, because they will fundamentally change the public’s understanding of history and identify ways to improve governance.\n\nADVERTISEMENT\n\nThe first includes the national security assessments that the U.S. intelligence community conducted under President Obama and Secretary of State Hillary Clinton Hillary Diane Rodham ClintonThe Hill's Morning Report - US coastline readies for Hurricane Dorian to make landfall Swing-seat Democrats oppose impeachment, handing Pelosi leverage Labor Day jitters on both sides of America's political divide MORE concerning the Russia nuclear giant Rosatom’s effort to acquire uranium business in the United States.\n\nThe Committee on Foreign Investment in the United States (CFIUS) — made up of Secretary Clinton and eight other senior federal officials — approved Rosatom’s purchase of mining company Uranium One’s U.S. assets in fall 2010, even as the FBI was gathering evidence that the Russian company’s American arm was engaged in bribery, kickbacks and extortion.\n\nSources who have seen these classified assessments tell me they debunk the last administration’s storyline that there were no national security reasons to oppose Rosatom’s Uranium One purchase or Vladimir Putin Vladimir Vladimirovich PutinNetanyahu, Trump discussing diplomatic gesture before Israeli election: report Media takes hits in bitter partisan era Protests in Russia may show more than what we're ready to see MORE’s successful efforts to secure billions of dollars in new nuclear fuel contracts with American utilities during the Obama years.\n\n“There were red flags raised, and the assessments expose other weaknesses in how CFIUS goes about these approval processes,” one knowledgeable source told me.\n\nUnder Obama, sensitive foreign acquisitions almost routinely were rubber-stamped by the CFIUS, and the approval process sometimes was delegated by Cabinet officials on the CFIUS to lower-ranking aides.\n\nADVERTISEMENT\n\nClinton, for example, claims she allowed a deputy to decide the Uranium One purchase, even as her family foundation collected millions in donations from parties interested in the transaction and her husband, former President Bill Clinton William (Bill) Jefferson ClintonOn pardons, Congress shouldn't take a joke Ex-sycophants highlight the void of competence around Trump Big crowds stir talk of momentum for Warren MORE, collected a $500,000 speech fee from Moscow.\n\nSince Trump took office and Steve Mnuchin took over as Treasury secretary, laudable legislative and administrative changes have been designed to tighten up the CFIUS process, and the percentage of rejected foreign acquisitions has increased because of more aggressive national security vetting.\n\nBut sources say the release of the Rosatom intelligence assessments would identify additional steps that can improve the process and finally would give Americans a complete picture of what happened during one of the most politically controversial CFIUS decisions in history.\n\nA second body of documents crying out for declassification is Obama’s private correspondence with Iranian leaders — in particular, the Oct. 7, 2014, cable he penned to Iran’s Supreme Leader Ali Khamenei, setting the terms for the controversial Washington-Tehran nuclear deal reached in early 2016.\n\nMy sources tell me that letter conflicts with what the Obama administration was telling the American public as it tried to sell the deal politically, and it shows a level of courtship, concession and trust with Tehran that exceeded the U.S. intelligence assessments at the time.\n\nADVERTISEMENT\n\nFor example, my sources tell me that Obama promised Iran it could have a “domestic enrichment capacity” and that Tehran could be restored to a nation “in good standing” under the world’s nuclear non-proliferation treaty, even though U.S. intelligence had corroborated an extensive weapons program that violated that treaty for years.\n\nThe 2014 letter was preceded by at least three other private communications between Obama and officials in Tehran, including two in 2009 and one in 2012. All need to be declassified and released for Americans to better understand the merits of Obama’s approach with Iran.\n\nTrump since has canceled the 2016 deal with Iran and imposed crippling new sanctions. But the true circumstances, promises and communications that led to the deal remain secret. The American public has much to gain from more transparency on this critical issue affecting world peace.\n\nThe final Obama-era tranche that requires declassification concerns Hillary Clinton’s email controversy — a highly classified set of documents that FBI agents identified as important and necessary in the investigation into whether she violated the law by transmitting classified emails on her unsecured private server.\n\nAs I wrote last week, the agents never got to review those documents in 2016 before then-FBI Director James Comey James Brien ComeyTrump suggests watchdog report shows Mueller probe was 'illegal' Trump tweetstorm dominates presidential weekend Does Comey deserve an apology? Not if you read the IG's report MORE unilaterally decided not to seek criminal charges against Mrs. Clinton.\n\nThe Justice Department’s internal watchdog in 2018 provided Congress a classified annex explaining how the FBI intended to examine that secret evidence, but never did. Sources who have seen the annex say it contains explosive revelations about what really happened with Clinton’s emails and the national security concerns that her conduct raised.\n\nUranium One, the Iran deal, Clinton’s emails — all have dominated headlines for many years without a full public accounting.\n\nTrump has an unprecedented opportunity to close the loop on these controversies and to give Americans more transparency and visibility into what happened, as well as how we can make government better when national security is at stake.\n\nJohn Solomon is an award-winning investigative journalist whose work over the years has exposed U.S. and FBI intelligence failures before the Sept. 11 attacks, federal scientists’ misuse of foster children and veterans in drug experiments, and numerous cases of political corruption. He serves as an investigative columnist and executive vice president for video at The Hill. Follow him on Twitter @jsolomonReports.", "description": "Documents that should be declassified immediately involve the Uranium One deal, the Iran nuclear deal and Hillary Clinton’s emails.", "authors": [], "top_image": "https://thehill.com/sites/default/files/clintonhillary_08282019_2.jpg"}