{"pub": "fox", "url": "https://foxbusiness.com/economy/economist-this-alexandria-ocasio-cortez-backed-theory-can-become-a-major-problem", "downloaded_at": "2019-09-03 23:42:01.264013+00:00", "title": "Economist: This Alexandria Ocasio-Cortez backed theory can become a 'major problem'", "language": "en", "published_at": "2019-09-03", "text": "Modern Monetary Theory (MTT) may be popular in Europe, but one economist hopes it never makes its way to the U.S.\n\nContinue Reading Below\n\n“You look at Italy with over 130% debt to GDP. You look at Lebanon 150% -- even us -- we're at about 103% and in fact academic studies show that whenever that debt to GDP ratio is over 90% -- guess what? It slows down economic growth,” former JPMorgan economist Anthony Chan told FOX Business’ Stuart Varney on Tuesday.\n\nThe economic line of thinking argues that debt doesn’t matter and a country that prints its own money can never go bankrupt. However, Chan had a very different explanation.\n\n“Their argument is it doesn't matter as long as the interest rate is below the inflation rate. But over time what happens when that debt to GDP ratio just gets out of control-- over 90%, over 120%, 130% -- it becomes a major problem and then you can't do anything about it but just accept reality,” he explained.\n\nThe concept has also been gaining support among some high-profile Democrats.\n\nAdvertisement\n\nNew York Congresswoman Alexandria Ocasio Cortez, earlier this year, told Business Insider that the theory “absolutely” needs to be “a larger part of our conversation.”\n\nAnd one of its leading proponents, Prof. Stephanie Kelton who wrote \"The Deficit Myth: Modern Monetary Theory and the Birth of the People's Economy,\" also advised Sen. Bernie Sanders' 2016 campaign.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "Modern Monetary Theory can slow economic growth, said Anthony Chan.", "authors": ["Julia Limitone"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/03/0/0/AOC-2.jpg?ve=1&tl=1"}