{"pub": "thenextweb", "url": "https://thenextweb.com/newsletter/2019/10/28/byte-me-9-slack-harassment-vagina-bots-and-pooping-at-work", "downloaded_at": "2019-10-28 09:48:57.938840+00:00", "title": "Byte Me #9: Slack harassment, vagina bots, and pooping at work", "language": "en", "text": "Subscribe to our monthly Byte Me newsletter NOW! And, while you’re here, follow us on Twitter!\n\nWelcome back to Byte Me, our feminist newsletter that makes everyone mad <3\n\nSince we last spoke, Anouk co-wrote and produced a (Dutch) video series called Kramp and it got over 2M views, Cara was accidentally interviewed by Popeye magazine about her football prowess, and Georgina was interviewed by Unfold about her newsletter prowess (and Byte Me). God, we’re talented.\n\nEach month, our gloriously gifted designer, Saïna, illustrates a weird comment or tweet we receive from one of TNW’s misogynistic, or just odd, readers. Here’s this month’s:\n\nThey should fit right in if they visit the Forbidden Planet.#Astronauts #NASA pic.twitter.com/XzOvFw3tHy — Marty MacLaughlin (@MartyMacLaugh) October 18, 2019\n\nEhm, sure, Marty. Let us illustrate that for you:\n\nBY THE WAY! Are you on Twitter? Cos we are. We just launched @byte_me.\n\nFollow us and please be gentle.\n\nthe bloody news\n\nthat’s what she said: are “women-only” events good or bad for feminism\n\nBecause we’re all magical and unique snowflakes who don’t always agree on feminist issues — and subsequently feel like we’re “bad” women — we’re going to discuss something we found online in each newsletter.\n\nFor this month’s that’s what she said, we’re discussing being a “token woman” and positive discrimination. We’ve linked to our full discussion here, and included the TL;DR below…\n\nCara: On one hand, I can definitely see why women would want to attend women-orientated events, especially in an industry like tech which is so male-dominated. But equality can’t be achieved without including men in the conversation.\n\nAnouk: I think ‘mixed’ events are more helpful in the long run, because you want men to listen to these kinds of talks and discussions, too, otherwise you’re just preaching to the choir.\n\nGeorgina: Agreed, but then again, sometimes mixed events take on the same dynamics as a male-dominated office — when a lot of men enter a space they’re comfortable with because they’ve always had access to it without discrimination, they dominate it.\n\nAnouk: It’s definitely okay to market your event as “women-friendly” or whatever label you want to use… just the ‘NO MEN ALLOWED’ is taking it too far, I think, and not that helpful for long-term changes.\n\nGeorgina: But the fact is, there are plenty of male-only spaces, even if they aren’t marketed as such, so female-only spaces are about tipping the scales, and allowing us the “boys club” that men have in business and tech.\n\nThere’s room for women-only events, but you need to understand you’re probably just preaching to the choir. So they have to have a certain purpose beyond just “sexism is bad.”\n\nAnouk: Yeah agreed, but what would that purpose be? The problem I see is: women-in-tech events want to solve inequality in tech… they want to solve the very problem they’re perpetuating.\n\nCara: Well it’s also giving space to women to speak freely in an environment that’s usually dominated by men.\n\nGeorgina: Sometimes women just need spaces to strategize against the patriarchy, like a coven of witches dancing around a fire.\n\nYou can check out our full discussion here.\n\nFeel free to comment on the document with your thoughts, or send us an email\n\nthe best and the worst\n\nIn this section, we ask women much smarter than us about the best and worst piece of professional advice they’ve ever received. This week we’re throwing it back to our AMA with Estelle Caswell, the presenter of Vox video series, Earworm.\n\nCredit: Estelle Caswell\n\nThe best?\n\n“You can change careers and jobs as much as you want. (That was a very freeing piece of advice to embrace.)”\n\nThe worst?\n\n“Get very good at one thing.”\n\ntweets of the month\n\nfeminism started the first time someone said i’m not team edward or team jacob i’m team bella — dirt prince (@pant_leg) October 20, 2019\n\nThe first coder was a woman. The first writer of a compiler was a woman. Even the word “computer” was originally a job title for people, mostly women, who did business-related arithmetic. Yet, some people claim the reason women are underrepresented in tech is lack of interest. — Kareem🔥10x statistician🔥Carr (@kareem_carr) October 19, 2019\n\nwhen a woman tweets an opinion https://t.co/bHaEM0yGm1 — Abby Tomlinson (@twcuddleston) October 23, 2019\n\nword of the month\n\nNext up in our new and improved Dicktionary (sorry):\n\nRemember ‘girl boss,’ the cutesy-feminist term coined by Nasty Gal founder Sophia Amoruso? Meet her older, affluent, pantsuit-wearing sister: SheEO.\n\nLet’s get some obvious issues out of the way first. Yes, we know this kind of gendered language is problematic – CEOs and bosses can be women too, making the word women-specific only perpetuates inequality, blah blah blah… but these things are meant to be tongue in cheek, right? No female entrepreneur in her right mind would actually introduce herself as “Angela Jones, SheEO” to potential new investors. At least, we fucking hope not.\n\nStill, the mere existence of ‘SheEO’ has inspired a bunch of whiny pieces online. “Don’t call me a She-EO,” is the headline of this op-ed a British entrepreneur penned for the Telegraph. She describes her career path, and brings up valid issues like the gender pay gap and unconscious bias in the workplace. But after reading the whole article, it’s clear nobody actually did call her a “SheEO” – she just doesn’t care for the term and thought it would make a catchy headline.\n\nSo let’s not make this problem bigger than it is. And if it makes you feel good, by all means, call yourself a SheEO (loser). Join a whole tribe of SheEO goddesses, for all we care. (They exist, we can’t make this shit up.) Hell, you don’t even need to run a company. Or have a job. After all, we’re not the boss of you. (We actually are, but you wouldn’t know that.) You are the boss of you. #bossbabe. #empowerment. #shetribe.\n\nHere’s how to use “SheEO” a sentence:\n\n“After becoming SheEO for a large energy conglomerate, she struggled with imposter syndrome.”\n\n“6 hacks to look like SheEO material in the workplace.”\n\nDon’t forget…\n\n<3 The TNW shrews\n\nCara (cara@thenextweb.com)\n\nAnouk (anouk@thenextweb.com)\n\n& Georgina (georgina@thenextweb.com)", "description": "Welcome back to Byte Me, our feminist newsletter that makes everyone mad <3", "authors": ["Cara Curtis"], "top_image": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2FCopy-of-Copy-of-Copy-of-Untitled-Design-4.png&signature=d6e4a881d75db8e097df0398bf8cbbd1", "published_at": "2019-10-28"}