{"pub": "cnbc", "url": "https://cnbc.com/2019/06/24/i-retired-at-34-with-3-million-here-are-the-downsides-of-early-retirement-that-no-one-tells-you.html", "downloaded_at": "2019-10-13 00:16:09.341176+00:00", "title": "I retired at 34 with $3 million—here are 5 downsides of early retirement that no one tells you", "language": "en", "text": "Many people have negative views on young retirees: They're spoiled. They're lazy. Their parents helped them. They won the lottery. But none of these things apply to me. I grew up in a middle-income household. I worked hard to earn good grades and pay for college. I was the first one in the office and the last to leave. Sure, I got lucky by landing a high-paying investment banking job and in some of my investments, but I live a frugal life and have always been diligent about staying on top of my finances. All of that played a huge role in my early retirement in 2012, at 34. By the time I *quit my job*, I had amassed a net worth of about $3 million that generated roughly $80,000 in investment income per year.\n\nI don't regret my decision\n\nI won't lie: Early retirement has been a dream come true. I gave up a healthy six-figure paycheck, but I gained something priceless in return: Freedom. People told me I was crazy to leave a high-paying job at such a young age, but I was absolutely burned out and felt disillusioned by my industry of work. I never anticipated how miserable I'd be working in finance, especially after the financial crisis. Early retirement isn't for everyone. But from my experience, the pros outweigh the cons. I get to wake up whenever I want. I no longer have to endure unproductive meetings or put up with nefarious colleagues. I've traveled to more than 20 countries with my wife, wrote a book on how to negotiate a severance and get to coach high school tennis. I also became a dad in 2017. Being a parent has been the toughest full-time job I've ever had; it makes working in investment banking for 13 years feel like a walk in the park.\n\nThe downsides of early retirement\n\nI will admit that there are a few downsides. (I finally understand why researchers say that, no matter how much of a boost we get in freedom or money, we eventually revert back to our normal baseline of happiness.) In a 2017 CompHealth survey, 68% of the 400 late-career physicians surveyed said they were not excited about retirement. Some of the top concerns included losing social interactions at work, a loss of purpose, boredom and depression. That said, here are the biggest negatives of early retirement that no one likes to talk about: 1) You may suffer from an identity crisis. One of the most common questions people ask when they first meet each other is: \"What do you do for a living?\" When you've spent at least a decade working in any job, you may find it incredibly jolting to no longer be identified as the marketing expert, the investment professional or the management consultant. It was only after I left my job that I realized how obsessed I was with my profession. I often wondered: How is the business doing without me? I was there for 11 years. Were they really able to survive without my expertise? But after months of no emails or phone calls begging for me to come back, I finally accepted the fact that I was no longer needed. 2) You may second-guess yourself. When you retire young, you may find yourself questioning whether you made the right choice and regret all the money and status you forewent. I still had a mortgage to pay and was worried that I made a grave mistake. But after some time, my retirement plans grew clearer. I started writing more on Financial Samurai, the personal finance website I started in 2009. It was a cathartic way of dealing any stress and uncertainty. Fortunately, after writing three times a week for the past 10 years, Financial Samurai has grown tremendously. I reinvested 100% of the profits it made and generated a decent amount of passive income.\n\n3) People may treat you like a misfit. Maybe it's because retiring early is unconventional. Or maybe they're secretly jealous you're not grinding away at a day job. Whatever the reason, people won't always give you the same amount of respect as they would to a working-class citizen. Eventually, I grew tired of explaining why I retired early or that I wasn't a trust fund kid. To keep the discussion simple and regain a social identity, I'd simply say I was a writer and tennis coach. 4) You may be surprised that you aren't that much happier. Many people think that once they achieve financial freedom or leave a job they hate, they'll be permanently happier. But, as I mentioned earlier, research has found that any significant amount of elevated happiness is only short-term. One a scale of one to 10, my happiness level skyrocketed to a 10 after I was able to negotiate a pretty solid severance. It was enough to pay for five years worth of living expenses. But not too long after that check hit my bank account, I reverted back to my normal post-retirement baseline of happiness. 5) You may get really, really bored. Retiring early is like finishing the season finale of your favorite TV show. You're glad it got a nice ending, but you're also sad it's over and left wondering what's next. With an extra 10 to 14 hours of free time every day, my productivity suffered and I grew less motivated to achieve great wins. It didn't help that none of my friends or former colleagues were able to hang out. There were no more company holiday parties or various client events. Believe it or not, I actually enjoyed those things! Now, I try to attend various meet-up events in order to make new friends, but my social life mostly consists of the folks I meet through playing tennis and softball. It wasn't until three years later, when my wife joined me in early retirement, that my boredom began to dissipate. We did a lot of traveling, but more importantly, we became parents, which renewed my sense of purpose.\n\nEarly retirement won't solve all your problems", "description": "The freedom of getting to wake up whenever I want and no longer having to put up with unproductive meetings is pretty nice. But early retirement won't solve all your problems.", "authors": ["Sam Dogen"], "top_image": "https://image.cnbcfm.com/api/v1/image/105979977-1561060740775the-sea-makes-sure-to-remind-me_t20_aoglxp.jpg?v=1561060754", "published_at": "2019-06-24"}