{"pub": "metro", "url": "https://metro.co.uk/2019/10/29/ea-officially-returning-steam-starting-star-wars-jedi-fallen-order-11006777", "downloaded_at": "2019-10-30 00:04:45.793073+00:00", "title": "EA officially returning to Steam, starting with Star Wars Jedi: Fallen Order", "language": "en", "text": "Now selling EA games again\n\nStarting next month you’ll be able to buy EA games from Steam again, with EA Access set to appear on Valve’s service next spring.\n\nIt’s been rumoured for a while now, but EA have announced that they will be coming back to Steam, starting with the release of Star Wars Jedi: Fallen Order on 15 November.\n\nYou can already pre-order the game on Steam, while subscription service EA Access is due to make the jump sometime next spring.\n\nWhere this leaves EA’s own store Origin is unclear, but players from both ecosystems will be able to play together in the same game. Not that Fallen Order has any multiplayer, but other popular EA games – such as FIFA, Battlefield, and The Sims – will also be coming to Steam in the near future.\n\nEA left Steam in 2011 in order to start Origin, but while the service has seemed to work fine it’s never evolved into a rival to Steam, despite selling games from other publishers.\n\nAdvertisement\n\nAdvertisement\n\nYou will still need to have Origin installed on your PC to play EA games on Steam though, so it’s presumably not going anywhere soon.\n\nEA Access, which has always been surprisingly good value, is becoming ever more popular though and will be the same price as on consoles and Origin, i.e. £3.99 a month or £19.99 a year.\n\nInterestingly, EA’s reason for going back to Steam is concern over subscription fatigue, with the company choosing to focus on EA Access rather than Origin.\n\n‘Since the time we removed our games from Steam, there’s been this dramatic increase in the number of gaming services, which you would think would be really good for players. But I think in many cases, it’s the exact opposite. It creates more difficulty for players, and providing player choice – from my perspective and speaking on behalf of EA – is really critical’, EA exec Mike Blank told GamesIndustry.biz.\n\n‘It’s an opportunity to make it possible for people to play where they want, to reduce that fragmentation and make it more frictionless… Reducing that fragmentation is really important. It’s the most player-first thing we can do.’\n\nWhen asked about Epic Games Store, Blank didn’t rule the possibility out but instead said he is ‘open to new partnerships’.\n\nEmail gamecentral@ukmetro.co.uk, leave a comment below, and follow us on Twitter\n\nAdvertisement\n\nAdvertisement\n\nMORE: Star Wars Jedi: Fallen Order hands-on preview – judge it by its trailer, do not\n\nMORE: EA includes FIFA in first trial for Project Atlas cloud streaming service\n\nMORE: EA claim UK Parliament loot boxes are ‘surprise mechanics’ and ‘quite fair’", "description": "Starting next month you’ll be able to buy EA games from Steam again, with EA Access set to appear on Valve’s service next spring.", "authors": [], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2015/02/steam-logo_1572366796.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-29"}