{"pub": "dailybeast", "url": "https://thedailybeast.com/emmys-stephen-colbert-and-jimmy-kimmel-mock-award-show-for-going-host-less", "downloaded_at": "2019-09-23 01:33:32.858574+00:00", "title": "Emmys: Stephen Colbert and Jimmy Kimmel Mock Award Show for Going Host-less", "language": "en", "text": "The Emmy Awards followed in the Oscars’ footsteps this year and went without a host for the first time since 2003. When it came time for Jimmy Kimmel and Stephen Colbert, who hosted the award show in 2016 and 2017, respectively, to present on Sunday night, they were quick to express their displeasure with the decision.\n\n“Well, well, well, how’s the whole ‘no-host’ thing going?” Colbert asked from the stage, adding, “What a joke.”\n\n“What a dumb idea,” Kimmel said. “So stupid. You know what has a host? Applebee’s has a host.”\n\n“You know who the real victims are here? It’s us,” the Late Show host said. “Hosting is the only thing we know how to do.”\n\n“I’m sorry, but this show sucks!” Kimmel chimed in as the two hosts continued to flatter each other’s unique hosting skills.\n\n“It’s just sad. Hosts aren’t optional,” Colbert said. “Without a host, who would read the words, ‘You know my next guest from the hit series NCIS: New Orleans?’”\n\n“No one would,” Kimmel answered. “Without a host, who would sit behind a desk and pretend to be interested in Jason Bateman’s vacation story?”\n\nFinally, Colbert said that “if we let this slide, the next thing you know, they’ll start using Alexa to present the nominees.” And with that, the Amazon robot handed the Emmy for Best Actress in a Comedy Series to Fleabag’s Phoebe Waller-Bridge.", "description": "“Well, well, well, how's the whole ‘no-host’ thing going?” Colbert said when he and Kimmel took the stage to present at this year’s Emmy Awards.", "authors": ["Matt Wilstein", "Senior Writer"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1428,w_2538,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1569202027/SC_bjyt0b", "published_at": "2019-09-23"}