{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201910187875/stocks-drop-on-china-data", "downloaded_at": "2019-10-19 10:39:39.412407+00:00", "title": "Stocks Drop on China Data", "language": "en", "text": "By Alexander Osipovich and Max Bernhard\n\nU.S. stocks fell Friday on global growth worries, but major indexes were still poised to close the week with gains after a strong kickoff to corporate earnings season.\n\nThe Dow Jones Industrial Average dropped 256 points, or 1%, as of 4 p.m. Eastern time, dragged down by Boeing and Johnson & Johnson. The S&P slipped 0.4%, while the Nasdaq Composite declined 0.8%.\n\nStill, all three indexes were recently within 3% July's all-time highs, showing the resilience of the U.S. stock market despite concerns about slowing growth at home and abroad.\n\nFriday's declines came after fresh Chinese growth data sparked concerns about the world's No. 2 economy and a slew of negative headlines pummeled some of the biggest U.S. companies.\n\nAmong Friday's movers, Johnson & Johnson had slumped 5.8% after the company said it was recalling one lot of baby powder--about 33,000 bottles--after tests found small amounts of chrysotile asbestos.\n\nBoeing tumbled 5.9% after the disclosure of instant messages from 2016 suggesting that the aircraft maker misled regulators over the safety of a key system on its 737 Max.\n\nTechnology stocks were broadly lower, with Netflix down 5.4% after several analysts cut their price targets for the streaming-video company. Chipmaker Micron Technology tumbled 3.7%, while PayPal Holdings fell 1.9%.\n\nBut the S&P was still poised for a 0.8% increase for the week--its second consecutive week of gains--largely due to upbeat quarterly earnings reports, including from banks like JPMorgan Chase and Citigroup.\n\nOf the 73 companies in the S&P 500 that have reported earnings through Friday morning, more than four-fifths have topped analysts' expectations, according to Refinitiv. That's largely because expectations came down so much in recent months.\n\nCoca-Cola, United Airlines Holdings and health-insurance giant UnitedHealth Group are among the stocks that rallied this week on better-than-expected results.\n\nThe parade of positive corporate news helped ease some of investors' jitters over the trade dispute with China. Following an initial deal last week, President Trump has said he could sign a \"phase one\" deal with his Chinese counterpart Xi Jinping in November.\n\n\"Some of the headwinds around concerns of a slowing U.S. economy and trade tensions have slowed a bit this week,\" said Philip Blancato, CEO and president of Ladenburg Thalmann Asset Management.\n\nOverseas, Chinese stocks dropped sharply after data showed the Chinese the economy slowed further in the third quarter. The benchmark Shanghai Composite Index fell 1.3%, its biggest decline in a month.\n\nFresh data showed that China's economy grew 6% in the quarter as business activity continued to deteriorate. Each quarterly slowdown in Chinese growth has pulled the country's economic performance to new lows not seen since the current measure of output was adopted in 1992.\n\n\"The figures are painting markets in red today,\" said Ipek Ozkardeskaya, a senior analyst at London Capital Group. \"Pulling below 6% would be really bad for investor sentiment, not only in China, but globally.\"\n\nThe benchmark Stoxx Europe 600 fell 0.3%. In the U.K., the FTSE 100 dropped 0.4% and the pound climbed 0.4% against the dollar.\n\nInvestors are watching developments closely before U.K. lawmakers vote Saturday on a draft Brexit agreement struck with the European Union. Prime Minister Boris Johnson is trying to muster enough support for the deal in the U.K. Parliament.\n\nThe yield on U.S. 10-year Treasurys slipped to 1.747% from 1.757% on Thursday. Bond yields move in the opposite direction from prices.\n\nIn commodities, U.S. crude futures fell 0.3% to $53.78 a barrel. Gold futures slipped 0.3% to $1488.20 a troy ounce.\n\nWrite to Alexander Osipovich at alexander.osipovich@dowjones.com and Max Bernhard at Max.Bernhard@dowjones.com\n\n(END) Dow Jones Newswires\n\nOctober 18, 2019 16:25 ET (20:25 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-18"}