{"pub": "guardian", "url": "https://theguardian.com/football/2019/sep/22/jill-ellis-legacy-usa-manager", "downloaded_at": "2019-09-22 16:34:02.929175+00:00", "title": "Jill Ellis can be proud of legacy as she steps down as USA manager", "language": "en", "text": "As well as winning two World Cups, Ellis leaves the women’s game in a stronger place tactically, technically and financially\n\nJill Ellis can be proud of legacy as she steps down as USA manager\n\nThe manager of the US women’s national team, two time World Cup winner Jill Ellis, has talked about her legacy. Having announced at the end of July that she would be stepping down from the post she has held for six years, at Fifa’s conference in Milan to analyse the 2019 World Cup she added to the hype: “It was one of a kind, obviously the second World Cup for me personally, but a wonderful showcase. The numbers don’t lie; our sport is exciting and energising.”\n\nJill Ellis: where does a women's football coach go after two World Cup titles? Read more\n\nEllis was right in saying that the numbers don’t lie. A presentation on the highlights of a 105-page Technical Study Group report into the tournament shows that the game has grown technically and tactically.\n\nWith no difference in the number of goals scored in France and the 2015 World Cup in Canada, 146, you could be forgiven for tempering that claim. But it did feel like a more attacking tournament and, while fantastic goalkeeping can undoubtedly be considered a factor in holding that number down, there are other signs that point to a more exciting game.\n\nGoalkeepers played 26% of their passes “short”, as opposed to 15% in 2011 and 16% in 2015 highlighting an inclination to play out from the back.\n\nPlayers spent exactly the same amount of time on the ball on average as 2015 (2.39 seconds), but the number of one-touch passes in that time had dropped from 132 in 2011 to 108 - players are quicker, have “tactical sophistication”, as Ellis describes it, and are more technically astute on the ball in the same short space of time.\n\nThe Fiver: sign up and get our daily football email.\n\nIn 2015 the average time of the first goal scored in games was 28 minutes 51 seconds. In France, it was 23m 30s. Games were forced open quickly and that the champions’ average was 13 minutes was a testament to their mantra: “Start fast, finish strong.”\n\n“We have a lot of veterans in the team which helps. When you can pounce on a team early it means that team is chasing the game,” said Ellis.\n\n“We started to train it [a back five, their ‘finish strong’ formation] almost a year ago, we call it our ‘close out’ shape, for when you know teams are going to push you hard. It was a defensive strategy but it created a lot of transition moments for us. This is where our team took steps from 2015 in tactical flexibility and game management.”\n\nWomen’s World Cup was ‘a balloon that deflated,’ says Carly Telford Read more\n\nThe personal legacy of Ellis, who will take up an ambassador role with US Soccer and is keeping her options open more widely, is most vividly reflected in two shiny World Cup trophies but the manager and her winning team have impacted the game more widely. When questioned about Gianni Infantino’s five-point plan for women’s football - increasing the number of World Cup teams from 24 to 32, increasing investment to $0.5bn, doubling prize money, a club World Cup and an international world league - during the World Cup Megan Rapinoe, characteristically, shouted the loudest: “Money money money!\n\n“You don’t get an incredible business running it on a budget of a dollar more than last year. You have to bet on the future of the women’s game.”\n\nThat Fifa then, by the end of the World Cup, and reiterated in Milan, announced the proposed $0.5bn investment would be doubled to $1bn shows the impact of pressure from all angles. Ellis is proud of that legacy: “It’s exceptional, we know the platform that this team has, we knew what it had domestically and now we see it also globally.\n\n“Athletes, I get it, you’ve got sponsorship you’ve got responsibilities, but I think what this team has showcased is that you can speak out and still feel connected, respected and loved.”\n\nIt is that attitude that will be missing from coaching in Ellis’s absence. Because she has afforded her players the trust and freedom to talk frankly on issues beyond the pitch like few others. “If things effect the performance then it is time for the manager to step in,” she said. “But when people have open conversations why shouldn’t they talk about politics or social issues? They’re human beings, they’re not just athletes.”", "description": "As well as winning two World Cups, Ellis leaves the women’s game in a stronger place tactically, technically and financially", "authors": ["Suzanne Wrack"], "top_image": "https://i.guim.co.uk/img/media/803cd2e0945f8aae8a2eabbf4860c18aeeee9d59/0_66_3899_2340/master/3899.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6a85c2e9a8518915240ce8ec25d20ecd", "published_at": "2019-09-22"}