{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/huawei-mate-30-pros-slow-mo-camera-makes-apples-slofie-sound-basic", "downloaded_at": "2019-09-19 23:49:51.898016+00:00", "title": "Huawei Mate 30 Pro's Slow Mo Camera Makes Apple's Slofie Sound Basic", "language": "en", "text": "Image: Gizmodo Australia/Sarah Basford\n\nDuring the iPhone 11 series launch, Apple threw us a curveball and announced it was trying to make slow-mo selfies, 'slofies', a thing. Essentially, Apple's new camera will be able to record videos with a high frame rate, which can be slowed down for slow-motion playback. But Huawei's just announced the plagued Mate 30 Pro's version of the 'slofie' will tower over it. Sit down Apple, a 10 has arrived.\n\nApple's Trying To Make 'Slofie' A Thing, Internet Says Nope A lot of things were announced by Apple today but one of them really stood out. Apple, in a classic weird uncle move, is trying to convince the youth they need slow-mo selfies, or slofies, in their life. The internet gave it a piece of its mind – though to be clear, a hands-on might change everything. Read more\n\nAs 2019 begins to round out, it looks like it's starting to become the Year of the Slofie, at least if Apple has any hand in it. Apple's slofie is shaping up to be one of the phone's biggest selling points for lifestyle owners because while the internet's reaction was mixed, it's actually pretty fun. It works by capturing front-facing videos in 120 frames per second (fps) and then slowly playing it back. Regular smartphone videos are usually shot in a more standard 24 or 30 fps.\n\nHuawei's just announced it's also joining the trend with its own version of the feature. But instead, it's promising its camera can capture up to 7680 fps and in HD. Complete madness. For comparison, Apple's 120 fps does the job, but the Galaxy Note 10+ has 960 fps. An extra few thousand frames per second takes it to another level. Gizmodo Australia sighted an example of the Mate 30 Pro's slow-mo feature showing a watermelon exploding and let's just say we've never been more mesmerised by projectile fruit flesh.\n\nSo, if slow-motion is your 2019 vibe, Huawei's offering is miles ahead. You'll just have to consider whether it's worth the risk of having a Google app-less phone.", "description": "During the iPhone 11 series launch, Apple threw us a curveball and announced it was trying to make slow-mo selfies, 'slofies', a thing. Essentially, Apple's new camera will be able to record videos with a high frame rate, which can be slowed down for slow-motion playback. But Huawei's just announced the plagued Mate...", "authors": ["David Tracy", "Sarah Basford"], "top_image": "https://edge.alluremedia.com.au/m/g/2019/09/mate-30-pro.jpg", "published_at": "2019-09-19"}