{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7536375/Sienna-Miller-stuns-suit-Winnie-Harlow-dons-sheer-number-La-Mer-Sorrenti-launch-event.html", "downloaded_at": "2019-10-05 07:26:01.025905+00:00", "title": "Sienna Miller stuns in suit as Winnie Harlow dons sheer number at La Mer by Sorrenti launch event", "language": "en", "text": "Theirs is a luxury cosmetic line treasured by upscale and fashionable clientele around the world, and the famous and fashionable came out in spades to celebrate a new product launch in New York City on Thursday.\n\nWinnie Harlow, Sienna Miller and many other well-known faces made a show and La Mer's Sorrenti campaign launch event that evening at Studio 525 in Manhattan's Chelsea neighborhood.\n\nSupermodel Winnie Harlow stunned in a beige sheer shirt dress, which was artfully layered over a patterned long-sleeve turtleneck shirt.\n\nTall drink of water: Supermodel Winnie Harlow stunned in a beige sheer shirt dress at La Mer's Sorrenti campaign launch in New York on Thursday\n\nSmiling Sienna: Actress Sienna Miller also wore an earthy beige to the event, in a slightly more pared-down ensemble\n\nHarlow's garment was cinched at the waist with a white belt, which appeared to be attached to plastic beige saddlebag pockets.\n\nWinnie's stiletto boots were the focus of her look, however, in a shocking shade of primary yellow that presented her long legs beautifully.\n\nThe 5ft9in Jamaican-Canadian had on a deep violet eye shadow and glossy lip, and wore her long dark hair down over one shoulder.\n\nSienna Miller also wore an earthy beige to the event, in a slightly more pared-down ensemble that featured a low-cut black blazer with decorative buttons and no top underneath.\n\nThe New York-born British actress donned pleated beige harem pants, and also sported funky footwear, in the form of playful pink open-toed sandals.\n\nThe Factory Girl star wore her pretty blond hair slightly feathered, and parted down the middle.\n\nSienna, who has a New York-set film called 21 Bridges coming out next month, was also seen arriving at the event, in the rain.\n\nEarthy girls: Both Sienna and Winnie had touches of beige in their ensembles Thursday\n\nCity girl: The NYC-born Miller, who has a New York-set film called 21 Bridges coming out next month, was also seen arriving at the event, in the rain.\n\nFather-daughter photographer team Mario and Gray Sorrenti were commissioned by La Mer to design new jars for their cream products, and the pair produced a beautiful suite of designs inspired by the sea.\n\nThe beauty company unveiled an ambient mood video for the launch of the new jars on YouTube on Tuesday.\n\nOthers to attend the stylish event on Thursday included the Fosters sisters Erin and Sara, former stars of the TV show Barely Famous and daughters to Canadian rocker David Foster.\n\nThe Barely Famous sisters: The Fosters sisters Erin and Sara, former stars of the TV show Barely Famous, also attended in wine and, again, earth tones\n\nSara was in a wine-colored bodycon maxi dress, while her sister continued the evening's earthy theme in a shiny khaki skirt with strap detail and a darker brown knit cropped sweater.\n\nSara's form-fitting dress was ruched at the hip, giving way to a sexy slit and pointy black boots, while Erin had on adorable fur-trimmed strappy sandals.\n\nAnother gorgeous woman in beige was supermodel Alek Wek, who arrived in a speckled sand and white sleeveless halter shift dress, paired with heeled black sandals.\n\nAnother gorgeous woman in beige: Supermodel Alek Wek arrived in a speckled sand and white sleeveless halter shift dress\n\nCelebrity costume designer June Ambrose made a statement in a feathered violet dress and crimson leather boots.\n\nActress Diana Agron looked pretty in a polka-dotted ink-stained maxi dress with short sleeves, paired with black leather boots and a matching purse.\n\nFashion and beauty influencer Liliana Vasquez rounded out the guest list in a poofy black leather shirt, ruched metallic blue mini skirt, and snakeskin pumps.\n\nVision in violet feathers: Celebrity costume designer June Ambrose made a statement in a feathered violet dress\n\nRorschach style: Actress Diana Agron looked pretty in a polka-dotted ink-stained maxi dress with short sleeves", "description": "Theirs is a luxury cosmetic line treasured by fashionable clientele around the world, and the  fashionable came out in spades to celebrate a new product launch in New York City on Thursday.", "authors": ["Dan Heching For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/07/19285426-0-image-a-4_1570169761528.jpg", "published_at": "2019-10-04"}