{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/baghdadi-raid-video-pictures-pentagon-trump-isis-leader-hideout-a9178541.html", "downloaded_at": "2019-10-30 23:25:29.698394+00:00", "title": "Baghdadi raid video released as Pentagon reveals Isis leader 'fired from his hideout'", "language": "en", "text": "The US Defence Department has released the first images and videos of the special forces raid that killed Abu Bakr al-Baghdadi, the leader of the Isis terror group, in Syria.\n\nIn the videos, around a half dozen American troops can be seen approaching the compound, which is protected on the outside by walls that the US forces then blasted open.\n\nThe death of Baghdadi was announced on Sunday by Donald Trump, who claimed the Isis leader whimpered before taking his own life with an explosion in a tunnel dug within the compound. Special forces then picked through the rubble left behind by the collapsed tunnel to identify the terrorist's body.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nAmerican officials say that six enemy fighters were killed during the special forces raid, while 11 children were safely removed from the house. Two children were reportedly killed during the operation.\n\n\"This operation was exquisitely planned and executed. It demonstrates the United States' global reach and our unwavering commitment to destroy Isis,\" said general Frank McKenzie, following the raid.\n\n\"This was a true inter-agency effort so I commend our partners across the US government,\" he continued.\n\nThe raid came just weeks after Mr Trump announced the US was pulling its troops out of northern Syria, leading to concerns for the safety of American allied Kurds there who had helped fight back Isis.\n\nShape Created with Sketch. Turkey launches offensive into Syria Show all 25 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Turkey launches offensive into Syria 1/25 Turkish soldiers with armored vehicles EPA 2/25 A woman flees with her children during Turkish bombardment on Syria's northeastern town of Ras al-Ain AFP/Getty 3/25 AFP/Getty 4/25 The first group of Turkish infantry prepare to enter Syria on the border Getty 5/25 Civilians flee AFP/Getty 6/25 Smoke billows from targets inside Syria AP 7/25 Turkish armoured vehicles enter Syria in Akcakale Getty 8/25 Civilians leave as smoke rises from Ras al-Ain AFP 9/25 A multi-rocket launcher fires in an unknown location Turkish Defence Ministry via Reuters 10/25 People wave as Turkish soldiers prepare to cross the border Getty 11/25 Girls stand together in Ras al Ain town Reuters 12/25 A woman walks as smoke billows following Turkish bombardment in Syria's northeastern town of Ras al-Ain AFP/Getty 13/25 A Turkish army's tank drives down from a truck towards the border with Syria AFP/Getty 14/25 Turkish jet taxis on tarmac after returning to a military base in southeast Diyarbakir Reuters 15/25 A Turkish armored vehicle drives down a road during a military operation in Kurdish areas of northern Syria EPA 16/25 People sit on belongings at a back of a truck as they flee Ras al Ain town Reuters 17/25 Turkey-backed Syrian opposition fighters enter Tel Abyad AFP/Getty 18/25 Civilians flee AFP/Getty 19/25 People flee Tal Abyad North Press Agency/Reuters TV 20/25 People wave as Turkish soldiers prepare to cross the border into Syria Getty 21/25 Civilians flee with their belongings AFP/Getty 22/25 AFP/Getty 23/25 Turkish President Recep Tayyip Erdogan, right, speaks with Defense Minister Hulusi Akar, left, as they watch the operation by Turkish forces in Kurdish areas EPA 24/25 Smoke rises from the Syrian town of Tal Abyad AFP/Getty 25/25 Turkey-backed members of Syrian National Army prepare for moving to Turkey with heavy armed vehicles EPA 1/25 Turkish soldiers with armored vehicles EPA 2/25 A woman flees with her children during Turkish bombardment on Syria's northeastern town of Ras al-Ain AFP/Getty 3/25 AFP/Getty 4/25 The first group of Turkish infantry prepare to enter Syria on the border Getty 5/25 Civilians flee AFP/Getty 6/25 Smoke billows from targets inside Syria AP 7/25 Turkish armoured vehicles enter Syria in Akcakale Getty 8/25 Civilians leave as smoke rises from Ras al-Ain AFP 9/25 A multi-rocket launcher fires in an unknown location Turkish Defence Ministry via Reuters 10/25 People wave as Turkish soldiers prepare to cross the border Getty 11/25 Girls stand together in Ras al Ain town Reuters 12/25 A woman walks as smoke billows following Turkish bombardment in Syria's northeastern town of Ras al-Ain AFP/Getty 13/25 A Turkish army's tank drives down from a truck towards the border with Syria AFP/Getty 14/25 Turkish jet taxis on tarmac after returning to a military base in southeast Diyarbakir Reuters 15/25 A Turkish armored vehicle drives down a road during a military operation in Kurdish areas of northern Syria EPA 16/25 People sit on belongings at a back of a truck as they flee Ras al Ain town Reuters 17/25 Turkey-backed Syrian opposition fighters enter Tel Abyad AFP/Getty 18/25 Civilians flee AFP/Getty 19/25 People flee Tal Abyad North Press Agency/Reuters TV 20/25 People wave as Turkish soldiers prepare to cross the border into Syria Getty 21/25 Civilians flee with their belongings AFP/Getty 22/25 AFP/Getty 23/25 Turkish President Recep Tayyip Erdogan, right, speaks with Defense Minister Hulusi Akar, left, as they watch the operation by Turkish forces in Kurdish areas EPA 24/25 Smoke rises from the Syrian town of Tal Abyad AFP/Getty 25/25 Turkey-backed members of Syrian National Army prepare for moving to Turkey with heavy armed vehicles EPA\n\nAs it turns out, the US operation was aided at least in part by the Kurdish-led Syrian Democratic Forces (SDF), who a State Department official said played a key role\" in the raid.\n\n\"He, his people, and his intelligence sources, played a key role in all of this,\" the official said, referring to SDF commander general Mazloum Abdi. \"It's a very, very important role. Nobody should underestimate how key the SDF was in all of this.\"\n\nJust days after the raid, Mr Trump announced on Tuesday that the US had also killed Baghdadi's \"number one replacement\" to take over Isis.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\n\"Just confirmed that Abu Bakr al-Baghdadi's number one replacement has been terminated by American troops,\" Mr Trump wrote on Twitter. \"Most likely would have taken the top spot — Now he is also Dead!\"\n\nMr Trump has also fuelled praise for the for a K-9 that was injured during the Baghdadi raid, and even went so far as to post a joking tweet of himself giving the dog the medal of honour.", "description": "The US Defence Department has released the first images and videos of the special forces raid that killed Abu Bakr al-Baghdadi, the leader of the Isis terror group, in Syria. In the videos, around a half dozen American troops can be seen approaching the compound, which is protected on the outside by walls that the US forces then blasted open.", "authors": ["Clark Mindock"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/30/21/isis-leader-abu-bakr-al-baghdadi-raid-syria-us-special-forces-video-pictures-0.jpg", "published_at": "2019-10-30"}