{"pub": "yahoo", "url": "https://news.yahoo.com/joshua-brown-murder-amber-guyger-dallas-police-independent-investigation-205142637.html", "downloaded_at": "2019-10-10 02:53:31.411892+00:00", "title": "Witness in Amber Guyger 'wrong apartment' murder is slain; family demands probe", "language": "en", "text": "The family of a slain Dallas man who was expected to be a witness in a civil case against the city has called for an independent investigation into his killing.\n\nJoshua Brown was shot to death Friday night, 10 days after testifying in the trial of Dallas Police Officer Amber Guyger. Guyger was convicted of murder last week for shooting a neighbor, Botham Jean, in September 2018.\n\nGuyger said she entered Jean’s unlocked apartment, which was one floor above her own, by mistake, and shot him in the belief he was a burglar. Brown, who lived on the same floor as Jean, was a witness for the prosecution in Guyger’s murder trial and was set to testify in a civil suit brought by his family against the city.\n\nJean was black. Guyger is white.\n\nBrown was killed Friday night outside his new apartment, in a different building. On Tuesday, the Dallas Police Department said they had two suspects in custody and a warrant for a third.\n\nLee Merritt, an attorney who represented Jean’s family and is now representing Brown’s, called for an independent investigation by the Dallas County Sheriff’s Office or the U.S. Department of Justice.\n\n“This family and their representatives have consciously avoided speculating about law enforcement involvement in this tragedy; however, due to the proximity of this murder with the trial of Amber Guyger — rumors abound,” Merritt wrote, adding, “A cloud of suspicion will rest over this case until steps are taken to ensure the trustworthiness of the process.”\n\nThose sentiments were echoed by the NAACP Legal Defense Fund after Brown’s death but before the arrests. The organization endorsed calls from Allison Jean, Botham’s mother, for the Dallas Police Department to “clean up inside” amid concerns of evidence tampering during the Guyger trial.\n\nJoshua Brown testifying during the murder trial of former Dallas Police Officer Amber Guyger. (Photo: Tom Fox/The Dallas Morning News via AP, Pool) More\n\n“The circumstances surrounding the murder of Mr. Brown cries out for answers. Most importantly, it demands an independent investigation of how and why he was killed,” said Sherrilyn Ifill, the legal defense fund’s president and director-counsel. “We urge state or federal authorities to follow the trail of misconduct left by this case and fully investigate the circumstances surrounding Mr. Brown’s death. It is critical to public confidence in the administration of justice that witnesses who speak out against police violence are fully protected. The suspicious circumstances of Mr. Brown’s killing should cause great alarm and demand an immediate and piercing inquiry. We echo Allison Jean’s statement that the ‘corruption we saw during this process must stop,’ and support her request for a comprehensive federal investigation of the Dallas Police Department.”\n\nRep. Alexandria Ocasio-Cortez, D-N.Y., referred to Brown’s death as an “injustice” in a Sunday tweet.\n\n“Just when we caught a glimpse of justice for Botham Jean, much of it feels stolen back with the murder of Joshua Brown, a key witness in the case,” wrote Ocasio-Cortez. “My heart breaks for his family and for everyone touched by this tragedy. We must get to the bottom of this injustice.”\n\nAccording to the police, Brown died in a drug deal gone bad. The department said there was an altercation outside Brown’s apartment complex involving three Louisiana men that ended with Brown shooting one of the men and being killed himself before the men fled, taking Brown’s bag and gun. The wounded suspect was brought to a hospital, and survived.\n\nActing on a tip, the police said they found 12 pounds of marijuana, 149 grams of THC cartridges and more than $4,000 in cash in Brown’s apartment.\n\nThere was no testimony at Guyger’s trial indicating that Brown was dealing drugs.", "description": "The family of Joshua Brown, who was expected to be a witness in a civil case against the city of Dallas, has called for an independent investigation into his killing.", "authors": ["Christopher Wilson", "Senior Writer"], "top_image": "https://s.yimg.com/uu/api/res/1.2/MbfaSg.NrWH4ebjeOFQo1A--~B/aD00NDA2O3c9NjUxOTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/37f0caf0-ead2-11e9-bf9d-5cfa30f1309e", "published_at": "2019-10-09"}