{"pub": "investing.com", "url": "https://uk.investing.com/news/stock-market-news/stocks--wall-street-surges-on-hope-of-trade-war-deescalation-1977920", "downloaded_at": "2019-10-11 20:22:24.766253+00:00", "title": "Stocks - Wall Street Surges on Hope of Trade War De-escalation", "language": "en", "text": "Investing.com – Wall Street rose for the third straight session on Friday, as investors were buoyed by hope that the trade talks between the U.S. and China will result in at least a partial deal to de-escalate the current stand-off between the two.\n\nThe rose 357 points or 1.4% by 9:48 AM ET (13:48 GMT), while the S&P 500 was up 39 points or 1.3% and the gained 118 points or 1.5%.\n\nU.S. President Donald Trump told reporters on Thursday that talks between the two countries were going “really well,” which followed a tweet that he will meet with Chinese Vice Premier Liu He on Friday.\n\nTrump again talked up market hopes early on Friday.\n\nU.S. President Donald Trump told reporters on Thursday that talks between the two countries were going “really well,” which followed a tweet that he will meet with Chinese Vice Premier Lui He on Friday.\n\n\"It is still going to be a one step forward, two steps backward tone with the talks, but there are hopes of a de-escalation, \"said Scott Brown, chief economist at Raymond James in St. Petersburg, Florida.\n\nCompanies with exposure to China were higher, with Apple (NASDAQ: ) up 1.3%, NVIDIA (NASDAQ: ) gaining 3.3% and Intel (NASDAQ: ) rising 2.3%. Tesla (NASDAQ: ) surged 1.5%, while Slack gained 5% after it said its active daily users rose by 37% in September from a year ago.\n\nMeanwhile oil companies were up after a report of attacks on an Iranian oil tanker caused futures to surge. Exxon Mobil (NYSE: ) and Chevron (NYSE: ) were both up 1%.\n\nIn commodities, the , which measures the greenback against a basket of six major currencies, was down 0.5% to 97.928 and tumbled 0.8% to $1,488.80 a troy ounce. jumped 1% to $54.05 a barrel.\n\n-Reuters contributed to this report", "description": "Stocks - Wall Street Surges on Hope of Trade War De-escalation", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/wallstreet_3_800x533_L_1412692164.jpg", "published_at": "2019-10-11"}