{"pub": "reuters", "url": "https://in.reuters.com/article/gasoline-india-demand/bpcl-hpcl-buy-more-gasoline-to-plug-supply-gaps-idINKCN1VQ0M9", "downloaded_at": "2019-09-05 07:10:39.500142+00:00", "title": "BPCL, HPCL buy more gasoline to plug supply gaps", "language": "en", "text": "SINGAPORE (Reuters) - India’s Bharat Petroleum Corp Ltd (BPCL) and Hindustan Petroleum Corp Ltd (HPCL) continue to import gasoline to plug a persistent supply gap as their refineries undergo maintenance and upgrade to produce cleaner fuels.\n\nBPCL on Wednesday bought 20,000 tonnes of gasoline for Sept. 16-18 arrival at Kandla at premiums of about $4 a barrel to Singapore quotes on a cost-and-freight (C&F) basis, industry sources who track the fuel said on Thursday.\n\nThis has pushed its total purchases for cargoes scheduled for a seven-month delivery period over March to September to at least 110,000 tonnes.\n\nHPCL has a larger appetite for the fuel, buying more than 155,000 tonnes for September and October, with its most recent purchase made on Aug. 29 from Total, the sources said.\n\nHPCL also has an outstanding tender to buy another 30,000 tonnes for Oct. 10-12 arrival at Visakhapatnam.\n\nHPCL had been actively seeking gasoline since December last year but results of its earlier buy tenders were not clear.\n\nThe companies did not immediately respond to requests for comment.\n\nIndia remains a gasoline exporter despite the buying spree, although its net gasoline exports between January and July this year have been reduced to a monthly average of 950,000 tonnes compared with 1.11 million tonnes for the same period last year, official data showed.\n\nDemand from India alone has been insufficient to drive the Asian gasoline market higher due to expanding refinery capacities in China, where gasoline shipments in July at 1.56 million tonnes were 75% higher than a year ago.\n\nThe average Asian gasoline profit margin this year as of Sept. 4 was $4.12 a barrel, down nearly 45% of its value when compared to the same period in 2018.", "description": "India's Bharat Petroleum Corp Ltd (BPCL) and Hindustan Petroleum Corp Ltd (HPCL) continue to import gasoline to plug a persistent supply gap as their refineries undergo maintenance and upgrade to produce cleaner fuels.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-05"}