{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/11/zuma-to-stand-trial-corruption-charges-arms-deal-south-african-president", "downloaded_at": "2019-10-11 12:28:51.486194+00:00", "title": "Zuma to stand trial on corruption charges relating to $2.5bn arms deal", "language": "en", "text": "The former South African president Jacob Zuma will stand trial on corruption charges relating to a $2.5bn (£1.98bn) arms deal after a high court denied him a permanent stay of prosecution.\n\nZuma, who held office from 2009 to 2018, had applied for 16 charges of fraud, racketeering and money laundering to be effectively struck out.\n\nThe charges relate to a deal to buy 30bn rand of European military hardware for South Africa’s armed forces in the late 1990s.\n\nThe 77-year-old politician was ousted last year after almost a decade in power, following a bitter internal battle within the ruling African National Congress party.\n\nHis successor, Cyril Ramaphosa, has pledged repeatedly to crack down on corruption in South Africa, which faces massive economic and social challenges.\n\nThe charges against Zuma were originally filed a decade ago but then set aside by the National Prosecuting Authority shortly before he successfully ran for president in 2009.\n\nAfter his election, his opponents fought a lengthy legal battle to have the charges reinstated, finally succeeding in 2016. Zuma countered with his own legal challenge.\n\nIn July, Zuma faced questioning by Raymond Zondo, a senior judge, mandated to investigate separate allegations of “state capture” in South Africa during his presidency.\n\n‘State capture’: the corruption investigation that has shaken South Africa Read more\n\nIn a public hearing, Zuma denied he had presided over an immense system of corruption and patronage that drained billions from the country’s exchequer, and told the inquiry he was the victim of a plot by foreign intelligence agencies to seek his downfall.\n\nThe former president later ended his testimony, claiming he was being questioned unfairly.\n\nThe judicial inquiry was set up after an ombudsman’s report uncovered apparent evidence of improper contact between three wealthy businessmen brothers – Atul, Ajay and Rajesh Gupta – and senior officials in Zuma’s administration.\n\nThe report, which stopped short of asserting criminal behaviour, called for an investigation into whether Zuma, some of his cabinet members and some state companies had acted improperly.\n\nThe US Treasury announced on Thursday it was placing the Guptas under wide-ranging sanctions for their role in “a significant corruption network in South Africa that leveraged overpayments on government contracts, bribery and other corrupt acts to fund political contributions and influence government actions”.\n\nIn a statement, the treasury alleged that the brothers were able to expand their businesses after immigrating to South Africa in the early 1990s “due in large part to their generous donations to a political party and their reportedly close relationship with former South African president Jacob Zuma”.\n\n“The family has been implicated in several corrupt schemes in South Africa, allegedly stealing hundreds of millions of dollars through illegal deals with the South African government, obfuscated by a shadowy network of shell companies and associates linked to the family,” the statement said.\n\nZuma has said the three Gupta brothers are his friends but he denies any influence-peddling in their relationship.\n\nThe Gupta family denied the accusations and left South Africa around the time that Zuma was ousted. They are now believed to be based in Dubai.\n\n\n\n", "description": "High court in South Africa denies former president permanent stay of prosecution", "authors": ["Jason Burke"], "top_image": "https://i.guim.co.uk/img/media/2cfdb0051e2d6ace6dca0f8c82a978c68f514694/708_238_2034_1220/master/2034.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0d19c6e0fef18a555c55b851d6e21928", "published_at": "2019-10-11"}