{"pub": "fox", "url": "https://foxnews.com/media/dennis-prager-documentary-no-safe-spaces", "downloaded_at": "2019-10-22 14:03:20.697817+00:00", "title": "Dennis Prager: 'No Safe Spaces' shows the left as 'a purely destructive force'", "language": "en", "text": "The left-wing of the American political spectrum is a \"purely destructive force\" that has taken over elements of academic life, including free speech on college campuses, said Dennis Prager on \"Fox & Friends\" Tuesday.\n\nPrager, a conservatibe radio talk show host and founder of PragerU, was promoting his new film \"No Safe Spaces,\" which examines the politically correct world of academia, driven by the political left.\n\n\"There is an enormous distinction between liberal and left,\" he said. \"Liberals and conservatives have far more in common than either have with the left. The left is a purely destructive force.\n\n\"Whether it's America or Europe or anywhere else. Liberals and conservatives may differ but they have similar values,\" Prager continued.\n\nDENNIS PRAGER ON WHY NEW FILM 'NO SAFE SPACES' IS UNFAIRLY RATED\n\nHe called the film a \"wake-up call\" to the American people and claimed free speech is being trampled on to satisfy a political agenda. He also said most professors are biased against conservative students, ridiculing the way liberal students are shielded from ideas from conservatives.\n\n\"The difference between kindergarten and college is the age of the 'kinder,'\" he observed.\n\nCLICK HERE FOR THE FOX NEWS APP\n\n\"They're... not protecting [people with safe spaces],\" Prager said. \"They're simply censoring.\n\n\"They don't protect conservative students from 90 percent of the professors who teach them the following -- this is the message, really in America today, to American young people. Your past was terrible and your future is terrible,\" he continued.\n\n\"It is a tough time to be a young person in the greatest country in the world.\"", "description": "The left-wing of the American political spectrum is a \"purely destructive force\" that has taken over elements of academic life, including free speech on college campuses, said Dennis Prager on \"Fox & Friends\" Tuesday.", "authors": ["Nick Givas", "Nick Givas Is A Reporter With Fox News. You Can Find Him On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Dennis-Prager-FOX.jpg", "published_at": "2019-10-22"}