{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/10/editorial-three-jeers-for-the-lefts-intolerance", "downloaded_at": "2019-10-11 12:29:28.027323+00:00", "title": "Liberals continue to show little respect for free speech", "language": "en", "text": "ANALYSIS/OPINION:\n\nQ: In the past week, what have each of the following demonstrated:\n\n1.) the mayor of Minneapolis\n\n2.) students at Georgetown University\n\n3.) the Communist Chinese government\n\nA: Intolerance of — and no respect for — free speech, and, regrettably, two of the three were successful in shutting it down.\n\nPresident Trump’s rally at the Target Center in Minneapolis took place Thursday night as scheduled, despite a ham-handed effort on the part of the Democratic mayor, Jacob Frey, to shut it down. Mr. Frey sought to stick the Trump 2020 campaign with a bill for $530,000 for “security,” and it took the threat of a lawsuit by the Trump campaign to force the mayor to back down.\n\nWhile the Trump campaign — and not Minneapolis residents — should pay for most of the costs of policing the event, it’s obvious that the mayor pulled that exorbitant, extortionate dollar figure out of thin air as a politically motivated provocation, if not to prevent the rally from happening. That was made clear soon after plans for the rally were announced in late September, when Mr. Frey said he couldn’t stop the visit, but added that the president’s “message of hatred will never be welcome in Minneapolis.” Stop the visit? Why would that thought even occur to Mr. Frey, who as an elected official has sworn to uphold the U.S. Constitution, presumably including the right to free speech?\n\n“Someone please tell the Radical Left Mayor of Minneapolis that he can’t price out Free Speech,” Mr. Trump wrote in a tweet. “Probably illegal!” The president cited a September 2009 rally — at the same Target Center — staged by President Obama in support of what would become Obamacare, for which the bill for security, including police overtime and street closures, was just $20,000. On Monday night, Trump campaign manager Brad Parscale accused the mayor of “abusing the power of his office and attempting to extort President Trump’s re-election campaign by conjuring a phony and outlandish bill for security in an effort to block a scheduled Keep America Great rally.” Thus, Mr. Trump’s Minneapolis speech went on as scheduled Thursday night. Remarks by the president’s acting secretary of Homeland Security on Monday at Georgetown University, not so much.\n\nOpen-borders leftist protesters at the Washington, D.C., school had no interest in hearing what Kevin McAleenan had to say at a conference on immigration — and didn’t want anyone else to hear it, either. They repeatedly interrupted Mr. McAleenan as he sought to begin his remarks to an audience of immigration-policy wonks, lawyers and students at the conference, sponsored by the Migration Policy Institute. The demonstrators criticized the Trump administration’s “zero-tolerance” policy toward illegal immigration and cited Mr. McAleenan’s role in it, especially the separation of illegal-immigrant families. Conference organizers and other audience members reportedly pleaded with the demonstrators to let Mr. McAleenan speak, to no avail.\n\n“As a career law enforcement professional, I’ve dedicated my career to protecting the right to free speech, and all the values we hold dear in America, from all threats,” he said. “So, we’ll go ahead and try one more time.” But disgracefully, the leftist “tolerance for me, but not for thee” crowd was having none of it, and Mr. McAleenan finally gave up and walked off the stage. He and a reasoned discussion of a perplexing public-policy issue were two more casualties of the hecklers’ veto.\n\nThe left’s iron-fisted, censorious impulse at Georgetown mirrors that of the Communist Chinese government, which constantly seeks to quash all criticism of it. Beijing was true to form last week after the Comedy Central cable channel aired an episode of its cartoon series “South Park” that ridiculed not only the Chinese Communist regime, but also Hollywood’s servile self-censorship to remain in Beijing’s good graces and continue to profit from marketing its products there. The Hollywood Reporter wrote Monday that China had retaliated by “deleting virtually every clip, episode and online discussion of the show from Chinese streaming services, social media and even fan pages.” To their credit, the cartoon’s creators issued a sarcastic faux apology: “[W]e welcome Chinese censors into our homes and into our hearts. We too love money more than freedom and democracy. Long live the great Communist Party of China. We good now, China?”\n\nWhat do these three otherwise-unrelated episodes say about the far left, both here and abroad? What it says to us is that they cannot and will not tolerate the very “diversity” they claim to champion — at least not where it really matters; namely, diversity of thought and opinions.\n\nSign up for Daily Opinion Newsletter Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Q: In the past week, what have each of the following demonstrated:", "authors": ["The Washington Times Http", "The Washington Times"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/10/Election_2020_Trump_37530.jpg-7514c_c0-164-3960-2474_s1200x700.jpg?2944f639b08dceefb0a015e5c4b75c1faf7db595", "published_at": "2019-10-10"}