{"pub": "politico", "url": "https://politico.eu/article/benjamin-netanyahu-falls-behind-israel-election-exit-polls", "downloaded_at": "2019-09-17 23:24:01.132168+00:00", "published_at": "2019-09-17", "title": "Netanyahu alliance fails to win majority in repeat election", "language": "en", "text": "Israeli Prime Minister Benjamin Netanyahu | Lior Mizrahi/Getty Images Netanyahu alliance fails to win majority in repeat election No decisive outcome from second poll this year.\n\nIsraeli Prime Minister Benjamin Netanyahu and his allies failed to garner a majority of seats in Israel's legislature in the country's second inconclusive election this year.\n\nWith 92 percent of votes counted from Tuesday's poll, the prime minister's Likud party is set to take a total of 32 seats, with its right-wing and ultra-Orthodox allies winning a further 24 seats, falling short of the 61 seats required for a majority in Israel's 120-seat legislature.\n\nThe results, following another poll in April that resulted in deadlock, raised new questions about Netanyahu's political future. The prime minister is already facing a possible indictment over corruption charges, and his failure to lead Israel's right-wing camp to victory could further erode his position.\n\nThe centrist Blue and White is set to take 32 seats, and its two left-wing allies a total of 11 seats.\n\nWith neither the centrist bloc nor the right-wing alliance garnering a majority of seats, one option is a national unity government, with Blue and White teaming up with Netanyahu's ruling Likud party. The secular nationalist Yisrael Beiteinu, with nine seats, could also become the kingmaker in the difficult coalition talks ahead.\n\nThe Joint List, an alliance of Arab parties, is set to become the third-largest force in the legislature, with 12 seats. However, no Arab party has ever participated in a ruling coalition in Israel.\n\nThis article has been updated.", "description": "No decisive outcome from second poll this year.", "authors": ["Lili Bayer", "Emma Anderson", "Kalina Oroschakoff", "Daniel Lippman"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/09/GettyImages-1172268535-1200x628.jpg"}