{"pub": "bbc", "url": "https://bbc.co.uk/news/world-europe-49653419", "downloaded_at": "2019-09-11 13:49:58.380327+00:00", "title": "Pope Francis accuses critics of stabbing him in the back", "language": "en", "text": "Image copyright EPA Image caption Pope Francis made the comments on a flight home to Rome after a three-nation trip to Africa\n\nPope Francis has accused his critics of stabbing him in the back, and said he is \"not afraid\" of the Catholic Church splitting.\n\nSpeaking after a trip to Africa, the Pope took issue with conservative clergymen who have criticised him.\n\nThose men do not \"want good for the Church\", but only care about \"changing popes, changing styles, creating a schism\", he said.\n\nUS Catholic leaders have attacked the Pope in the past for his views.\n\nIt is the first time he has spoken so openly about the chance of a split in the Church, which has more than one billion followers worldwide.\n\nWhat did the Pope say?\n\nPope Francis made his comments on a flight back to Rome after a trip to Madagascar, Mauritius and Mozambique.\n\nHe was asked by a reporter about attacks from conservative Catholic leaders, TV channels and websites in the US.\n\nImage copyright Reuters Image caption Meeting the faithful in Antananarivo, Madagascar\n\nSome Catholic leaders - particularly in the US but also some others around the world - have accused the Pope of diluting their faith, and have even called for his resignation.\n\nThey are unhappy with his stances on the environment and immigration. But in particular they are opposed to his moves to allow divorced and remarried Catholics to take Communion.\n\n\"I'm not afraid of schism,\" Pope Francis said, adding that many had happened in the history of the Church. \"I pray that there won't be one, because the spiritual health of many people depends on it.\"\n\nImage copyright AFP/Getty Image caption Pope Francis recently made a trip to Madagascar, Mozambique and Mauritius - where he was photographed\n\nPope Francis suggested political ideology was tainting his critics' views of him.\n\n\"The things I say about social issues are the same things [Pope] John Paul said. I copy him [and they say] 'the pope is too communist',\" he told reporters.\n\nHe praised \"constructive criticism\", but not \"those who smile while stabbing you in the back\".\n\n\"The criticisms do not only come from the Americans [but] from everywhere, including the Curia,\" he said, referring to the Catholic Church's governing body.\n\nHas the church split before?\n\nIn its 2,000-year history the Catholic Church has split a number of times, most notably in 1054, when the Eastern Orthodox Church split off from Rome.\n\nOther splits have led to the rise of antipopes - other men who claim to be the pope and refuse to bow to Rome. Antipope Benedict XIII granted the University of St Andrews in Scotland its university status in 1413.\n\nMore recently, French Archbishop Marcel Lefebvre ordained four bishops without papal approval in 1988.\n\nYou may also be interested in:", "description": "Speaking after a trip to Africa, Pope Francis says he is \"not afraid\" of a Catholic Church schism.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/80F6/production/_108741033_tv056407952.jpg", "published_at": "2019-09-10"}