{"pub": "abcnews", "url": "https://abcnews.go.com/International/wireStory/hong-kong-leaders-town-hall-fails-persuade-protesters-65896738", "downloaded_at": "2019-09-27 09:29:52.436954+00:00", "published_at": "2019-09-27", "title": "Hong Kong leader's town hall fails to persuade protesters", "language": "en", "text": "Hong Kong's beleaguered leader Carrie Lam faced her public with humility, but she may not get the response she hoped for.\n\nInterested in China? Add China as an interest to stay up to date on the latest China news, video, and analysis from ABC News. Add Interest\n\nIn a face-off with an antagonistic audience, Lam quietly took blow after blow as citizens at a town hall session Thursday vented anger at her refusal to give more concessions to finally end more than three months of anti-government protests that have rocked the semi-autonomous Chinese territory.\n\nAfter the dialogue ended, Lam stayed holed up in the building for another four hours to avoid confrontation with angry protesters outside and left only after most of them dispersed.\n\nBut analysts say Lam's hope of using the community engagement to buy some goodwill that will diffuse tensions ahead of rallies planned this weekend in the lead-up to Oct. 1 celebrations of China's National Day is unlikely to succeed.\n\n\"Carrie Lam showed some sincerity,\" said Willy Lam, an adjunct professor at the Center for China Studies at Hong Kong's Chinese University who is not related to the Hong Kong leader. \"She sat through more than two hours of humiliation and demonstrated at least willingness to hear radically different views. She has the guts to face opposition but still it's not good enough.\"\n\nThe protests began in June in opposition to a proposed law that would have allowed some criminal suspects to be sent for trial on the mainland, but have since widened into an anti-China protest spurred by widespread concern that Beijing has been eroding the autonomy Hong Kong was promised when the former British colony returned to Chinese rule in 1997.\n\nDuring the town hall, Lam vowed to work to regain public trust and shouldered the responsibility for causing political havoc with the extradition bill. Yet she offered no concrete actions she will take apart from promises to listen and address deep-seated societal woes such as a lack of affordable housing that the government believes has contributed to the protests.\n\nLam stood her ground against demands for an independent inquiry into accusations of police brutality against protesters and the unconditional release of more than 1,500 people detained since the protests began in June. She also sidestepped calls for direct elections of the city's leaders.\n\n\"It was a good occasion for people to reduce pent-up anger, but it will not cool down emotions because there was no concrete reconciliatory moves,\" Willy Lam said.\n\nNevertheless, he said it was a good sign that the tightly guarded event proceeded without disruption and opens the possibility that future planned dialogue with the community could be more in-depth or even show results.\n\nSo far the only concession the Hong Kong leader has made was a promise to completely withdraw the extradition bill, a move that may have eased tensions had it been made in June but did little to calm things when announced in September. Huge protests have continued on most weekends, as have the clashes with police that often break out after nightfall.\n\nAnother major rally organized by the Civil Human Rights Front is set Saturday to mark the fifth anniversary of the Umbrella Revolution, when protesters occupied key thoroughfares in the city for 79 days in 2014 to demand universal suffrage. That movement ended without any government concession.\n\nProtesters are also organizing \"anti-totalitarianism\" rallies in Hong and many cities worldwide on Sunday against what they denounced as China's tyranny.\n\nThe Front is also planning another big march on Oct. 1, sparking fears of a bloody showdown that will embarrass China's ruling Communist Party as it marks its 70th year in power with grand festivities in Beijing. The Hong Kong government has scaled down National Day celebrations by calling off an annual firework display and moving a reception indoors.\n\nLam's government has insisted that it can handle the conflict on its own, amid fears of Chinese military intervention. Despite the bashing Thursday, Lam vowed to continue talks with various communities, including protesters, to hear their grievances.\n\nThe response to the town hall on social media was generally negative, with many calling it a public relations stunt.\n\nThe dialogue was timed to try reduce potential ferocity at upcoming rallies, but protesters aren't buying it, said Phil Chan, senior fellow at the Institute for Security and Development Policy in Stockholm.\n\n\"I don't think Hong Kong people will fall for it,\" Chan said. \"She was just repeating herself and hasn't accepted another view point other than her own.\"", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/WireAP_5bee954a25f44fc28bdd0b906013b354_16x9_992.jpg"}