{"pub": "investing.com", "url": "https://newsbtc.com/2019/10/18/bitcoin-store-of-value-sentiment-stronger-than-ever-as-economic-collapse-looms", "downloaded_at": "2019-10-18 04:52:57.609590+00:00", "title": "Bitcoin Store Of Value Sentiment Stronger as Economic Collapse Looms", "language": "en", "text": "The state of the world economy just over a decade ago was not a pretty picture. A solution was needed and one was offered in the form of a decentralized peer-to-peer digital monetary system. Bitcoin was born and a decade on it appears to be déjà vu for the global economy.\n\nThis Crash Worse Than 2008\n\nThe previous economic crisis was caused largely by banks engaging in hedge fund trading with derivatives then demanding more mortgages to support the profitable sale of these derivatives. Essentially the bankers brought down the economies of the world and everyone suffered.\n\nBanks have proved that they cannot be trusted and Bitcoin was created out of that notion. As Nakamoto himself wrote;\n\n“The central bank must be trusted not to debase the currency, but the history of fiat currencies is full of breaches of that trust. Banks must be trusted to hold our money and transfer it electronically, but they lend it out in waves of credit bubbles with barely a fraction in reserve.”\n\nUS debt has escalating to unprecedented levels and all signs are pointing to another imminent economic collapse. With a national debt approaching $23 trillion, the situation has clearly spiraled out of control and America, being one of the world’s largest economies, will drag the rest of the planet into the financial quagmire again.\n\nGoldbug Peter Schiff has predicted this collapse time and time again and asserts that it will be far worse than the last.\n\n“The economic collapse that is going to follow the bursting of this bubble is going to be far more dramatic than ’08.”\n\nNaturally Schiff wants to plug his gold funds which do provide a relatively stable store of wealth in times of economic despair. Gold prices rose sharply from 2009 to 2011 as the world picked up the pieces from the last crisis and they are likely to do so again.\n\nBitcoin is Digital Gold\n\nBitcoin, which has often been referred to as ‘digital gold’ is also seen as a store of value and that narrative is now stronger than ever. The majority of millennials will remember the last crash and will be wary of banks and their meddling. Bitcoin is likely to be the choice for them above gold simply because they have been raised with technology and the internet, unlike the generations before them.\n\nThe sentiment has been echoed by Weiss Ratings in a recent tweet which sums up the current situation.\n\n“Bitcoin was an overreaction to the financial crisis and the monetary system that allowed it to occur. Today, instead of functioning as an efficient peer-to-peer system for transferring cash, $BTC is evolving into a store of value like gold.”\n\n#Bitcoin was an overreaction to the financial crisis and the monetary system that allowed it to occur. Today, instead of functioning as an efficient peer-to-peer system for transferring cash, $BTC is evolving into a store of value like gold.#BTC #crypto #cryptocurrency — Weiss Crypto Ratings (@WeissCrypto) October 17, 2019\n\nThe clock is ticking and with the US, and now China, starting to inject cash back into their financial systems in order to keep them afloat, the writing may already be on the wall for the economies of the world.\n\nImage from Shutterstock", "description": "The state of the world economy just over a decade ago was not a pretty picture. A solution was needed and one was offered in the form of a decentralized", "authors": [], "top_image": "https://www.newsbtc.com/wp-content/uploads/2018/05/Gold-Bitcoin-700x400.jpg", "published_at": "2019-10-18"}