{"pub": "cnbc", "url": "https://cnbc.com/2019/09/05/half-of-americans-have-raided-their-retirement-savings-early.html", "downloaded_at": "2019-09-06 12:08:00.275788+00:00", "title": "52% of Americans have raided their retirement savings early—here's why that's a mistake", "language": "en", "text": "More than half (52%) of Americans have tapped into their retirement savings early, according to a recent survey from Magnify Money, and 23% did so in order to pay off debt. Survey respondents also dipped into their savings to cover a down payment on a home (17%), paying for college (11%) and medical expenses (9%).\n\nMillennials (ages 22 to 37) in particular are more likely than Gen X (ages 38 to 53) and baby boomers (ages 54 to 72) to pull from their savings early, the survey found. Education is a priority: 59% of well-off millennials say they would take money from their retirement savings in order to fund their kids' college so that they can avoid student loan debt, a similar survey from investment company Ameriprise found. While they may have good intentions, many financial experts warn against this line of thinking. \"You don't want to derail your retirement for your child's college education when they can get a loan or scholarships,\" certified financial planner Carrie Schwab-Pomerantz tells CNBC Make It. It's best to avoid taking from your retirement early if at all possible, regardless of the reason, Ryan J. Marshall, a New Jersey-based certified financial planner, tells CNBC Make It. \"One of the worst things we see is when people try to play catch up with their retirement later on,\" Marshall says. Here are three major reasons to forgo pulling money from your retirement ahead of schedule.\n\n1. Borrowing early could result in penalties and fees\n\nNot only will taking money out early leave you with less in retirement, but you could also be hit with early withdrawal penalties. With a 401(k) plan, taking money out before turning 59½ can result in a 10% penalty. And if you take out a significant amount of money at once, those withdrawals could push you into a higher tax bracket since you'll have to include withdrawals as income on your tax return. If you have a Roth IRA, the rules for withdrawal are more flexible than those of a 401(k) plan. But, typically, the same 10% penalty applies to any interest accrued on your contributions if you are younger than 59½. Plus, you may also be required to pay taxes on the withdrawal. There are sometimes ways around these penalties, but it's important to be aware that they exist.\n\n2. You'll lose out on compound interest\n\nThe longer your money is invested in the market, the more you'll have in the end. That's thanks to compound interest, in which any interest earned then accrues interest on itself. \"Compound interest is huge and is something you really can't get back once you take a withdrawal,\" Marshall says. \"There isn't a compound interest fountain of youth and we can't go back in time. Once you miss out on the compounding interest effect, it's lost.\"\n\nThere isn't a compound interest fountain of youth and we can't go back in time. Once you miss out on the compounding interest effect, it's lost. Ryan J. Marshall certified financial planner\n\nIf you started investing $250 a month at 25, you'd accumulate around $879,000 by 65, assuming an 8% return on investment. But if you start at 35, you'll have just over $375,000. If you start saving early for retirement, do so consistently throughout your career and leave the money where it is for as long as possible, you'll have a far healthier retirement account than someone who borrows from their retirement fund early. If you need cash, try to tap into other sources before dipping into your 401(k) or IRA.\n\n3. Retirement funds are legally protected\n\nShould you get behind on your bills or experience financial troubles, creditors can take you to court and go after your assets. However, most employer-sponsored retirement funds, such as 401(k) plans, are protected by the Employee Retirement Income Security Act (ERISA). That means that in most situations it won't be possible for others to gain access to your retirement account. But that money is no longer protected if you withdraw it early. Instead, it's best to keep your savings safely stored within your 401(k). Like this story? Like CNBC Make It on Facebook! Don't miss: Self-made millionaires say you should think twice before going to college", "description": "More than half of Americans have dipped into their retirement savings early. Financial advisors say that is a mistake since they could be earning compound interest in the market. Plus, 401(k)s and Roth IRAs often come with early withdrawal penalties and fees.", "authors": ["Anna Hecht"], "top_image": "https://image.cnbcfm.com/api/v1/image/105831322-1554760662540couple22.jpg?v=1555098472", "published_at": "2019-09-05"}