{"pub": "afr", "url": "https://afr.com/policy/tax-and-super/a-wealth-tax-could-deliver-a-happiness-dividend-20191028-p5350v", "downloaded_at": "2019-10-28 05:19:56.070808+00:00", "title": "A wealth tax could deliver a happiness dividend", "language": "en", "text": "When a study released earlier this month showed the wealthiest Americans paying a lower tax rate than any other group, Democratic presidential candidates embraced it as a proof that they were on the right track. While their tax-the-rich proposals vow to create a better economic balance, the candidates often pivot to what they would do with the proceeds: Medicare for All, student loan relief, infrastructure repair, and other expensive programs. Those equations have raised serious doubts, and for good reason. Turning tax revenue into a massive healthcare system – or measurable economic growth – is incredibly complicated. But raising taxes on the wealthy could deliver something meaningful that millions of Americans would feel rather quickly: happiness.\n\nRecent research by two psychologists found that progressive taxes may make the average citizen happier and more content. In the course of their study, Shigehiro Oishi and Kostadin Kushlev of the University of Virginia and Ulrich Schimmack of the University of Toronto eschewed the usual debate about tax increases: Are they bad for economic growth? Instead, they focused on a more emotional one: Do Americans feel happier – and experience a greater sense of fairness – under more progressive taxation?\n\nThe study mined data from something known as the General Social Survey, a program conducted by NORC at the University of Chicago. This statistical survey has been asking Americans a range of consistent questions since the early 1970s, including asking respondents to rank their \"happiness\" using a three-point scale.\n\nThe researchers found a very strong correlation between progressive tax policies and how happy respondents rated themselves. This effect was most pronounced – and statistically significant – among taxpayers in the lowest 40 per cent of incomes. The correlation steadily diminished among higher-income groups, disappearing altogether for the top 40 per cent.\n\nBut correlation isn't causation, so the researchers ran a time-lag analysis to determine whether the institution of progressive taxes influenced happiness levels five or ten years later. Here they found a robust correlation: Progressive taxes predicted happiness for lower-income groups. But it didn't work the other way around: Happiness didn't anticipate progressive taxes. As the researchers put it: \"The temporal sequence seems to flow from progressive taxation to happiness.\"\n\nIn order to rule out other possible explanations, the researchers also ran regression analyses to determine whether other, proximate causes might explain the relationship: crime rates, for example, or unemployment. Only tax policy seemed to account for the outcomes.", "description": "Recent research by two psychologists found that progressive taxes may make the average citizen happier and more content.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.5298%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_23/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/ccdce08e0c80b957130d29d0ccc72a2bbe8f885e", "published_at": "2019-10-28"}