{"pub": "marketwatch", "url": "https://marketwatch.com/story/mortgage-rates-remain-near-recent-lows-why-that-may-not-be-enough-to-push-more-people-to-buy-homes-2019-10-03", "downloaded_at": "2019-10-03 23:27:00.030728+00:00", "published_at": "2019-10-03", "title": "Mortgage rates remain near recent lows — why that may not be enough to push more people to buy homes", "language": "en", "text": "Mortgage rates were in something of a holding pattern over the last week, giving more people an opportunity to score a deal on a home loan.\n\nThe 30-year fixed-rate mortgage averaged 3.65% during the week ending Oct. 3, up one basis point from the previous week, Freddie Mac FMCC, +0.63% reported Thursday.\n\nThe 15-year fixed-rate mortgage fell two basis points to an average of 3.14%, according to Freddie Mac. The 5/1 adjustable-rate mortgage averaged 3.38%, the same as a week ago.\n\nMortgage rates roughly track the direction of the 10-year Treasury note TMUBMUSD10Y, -3.91%, the yield on which has fallen nearly 30% over the last five days.\n\nRecent data has fueled concerns that the American economy could be entering a slowdown. A report that gauges conditions in the services sector came in significantly weaker than was expected Thursday morning, sending the Dow Jones Industrial Average DJIA, +0.47% lower. Other recent reports on private-sector employment and the manufacturing industry have also disappointed.\n\n‘As economic growth decelerates, it is clear that low mortgage rates will continue to support the mortgage market.’ —Sam Khater, Freddie Mac’s chief economist\n\nA weaker economy alone would cause problems for the housing market — people are disinclined to buy a home if they’re worried about their jobs or their bank accounts. But economists have argued that low mortgage rates could counteract this.\n\n“While mortgage rates generally held steady this week, overall mortgage demand remained very strong,” Sam Khater, Freddie Mac’s chief economist, said in the report. “As economic growth decelerates, it is clear that low mortgage rates will continue to support the mortgage market and we expect that to persist for the remainder of the year.”\n\nLow rates are certainly bringing people back into the market who had been priced out — but scoring a deal on a home loan isn’t necessarily the biggest consideration for a buyer. A recent report from Zillow ZG, +1.75% found that life events were behind 35% of buyers’ choices to move, compared with just 21% of people who said they were moving because of dynamics in the market.\n\nOver two-thirds of renters are carrying some form of debt, according to Zillow.\n\nMoreover, high home prices are just one factor contributing to the affordability challenges many would-be buyers are facing. Over two-thirds of renters are carrying some form of debt, Zillow Z, +1.48% found, and nearly a third of Generation Z and millennial buyers said that their debt load caused them to be denied a mortgage. For these renters, as long as they continue to have large amounts of debt, it won’t matter terribly much how low mortgage rates go.", "description": "Economists argue that low rates will continue to prop up the housing market as the economy slows down, but it’s not clear how long that will last.", "authors": ["Jacob Passy"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS584_hometo_ZG_20191003103644.jpg"}