{"pub": "businessinsider", "url": "https://businesstimes.com.sg/garage/home-interior-platform-livspace-plans-to-invest-us30m-to-grow-singapore-business", "downloaded_at": "2019-10-30 08:42:33.897323+00:00", "title": "Home interior platform Livspace plans to invest US$30m to grow Singapore business", "language": "en", "text": "ONLINE home interior and renovation platform Livspace on Wednesday announced the launch of its operations in Singapore, with plans to invest US$30 million to grow its business here.\n\nThe launch marks the first step of the India-based platform’s expansion into the Asia-Pacific region, the company said in a press statement, adding that it also has plans to launch in other countries come 2020. Singapore will serve as its global headquarters.\n\nLivspace expects to cross US$500 million in its gross revenue run rate over the next 30 months, said co-founder and chief executive, Anuj Srivastavam. Its run rate is projected based on the company’s gross revenue for the past two calendar months during a six-month soft launch in Singapore.\n\nRavindran Shanmugam, country head of Singapore for Livspace, said that Singapore’s US$5 billion home-design industry, with a 10 per cent year-on-year growth rate, is a “highly attractive market for Livspace”, adding that the company plans to base over 250 employees here, including central platform teams.\n\nLivspace uses data science enabled algorithms to match homeowners with designers ⁠based on style preferences, individual budgets, scope of work and timelines. Through Livspace’s proprietary design-to-installation platform Canvas, homeowners can first see prior designs of their home and then shop directly for products and services on the same platform. The company also assures the delivery of the project through to final installation.\n\nGet the latest on startups\n\nand business news Terms & conditions Sign up\n\nOutside of Singapore, Livspace serves nine metro areas in India. It has a network of 20 design centres and experience apartments across the country. In India, Livspace has over 80 per cent of market share, and is more than doubling its revenues every year.\n\nThe home interior and renovation platform has raised over US$103 million in capital from top global investors including TPG Growth, Goldman Sachs, Bessemer Venture Partners, Jungle Ventures, Helion Ventures and UC-RNT.", "description": ": THE BUSINESS TIMES Garage - ONLINE home interior and renovation platform Livspace on Wednesday announced the launch of its operations in Singapore, with plans to invest US$30 million to grow its business here. . Read more at The Business Times.", "authors": ["Olivia Poh"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/garage/images/BTGaragedefault600.jpg", "published_at": "2019-10-30"}