{"pub": "arynews", "url": "https://arynews.tv/en/govt-opposition-to-hold-talks-on-azadi-march-this-evening", "downloaded_at": "2019-10-25 16:07:49.829785+00:00", "title": "Govt, Opposition to hold talks on ‘Azadi March’ this evening", "language": "en", "text": "ISLAMABAD: A formal sitting between the government committee and the opposition is set to begin at 5:00 PM today to discuss the issue of ‘Azadi March’ announced by Jamiat Ulema-i-Islam (JUI-F), ARY News reported on Friday.\n\nAccording to sources, the government negotiating team headed by Defence Minister Pervez Khattak would hold talks with the Rehbar Committee having representation of all major opposition parties at the residence of JUI-F leader Akram Khan Durrani this evening.\n\nThe PM Office after a meeting of Prime Minister Imran Khan with the government negotiating team had announced on Wednesday that the government while upholding democratic ideals had decided to allow the proposed ‘Azadi March’on the condition that it takes place within the ambit of law and the Constitution according to the decisions of the Supreme Court of Pakistan and Islamabad High Court.\n\nThe sides are stick to their respective positions on demand of resignation of the prime minister Imran Khan.\n\n“No question arises about resignation of the prime minister, the government team’s head Pervez Khattak has said.\n\nThe opposition parties and the government are in constact contact with allies over the matter.\n\nThe JUI-F also given an application to the administration for the permission for entrance of its march in Islamabad on October 31st, changing earlier date of Oct 27.\n\nThe government has also devised a strategy to tackle the ‘Azadi March’ in case of failure of the negotiatons.\n\nThe government will implement a strategy in three phases, sources said. In the first phase the government’s negotiating committee will hold talks with the opposition and in case of failure of negotiations a crackdown will be launched for arrests at district and divisional levels, according to sources.\n\nFinally, the administration will use the option of force in third stage as the last resort to thwart the protest, sources added.\n\nThe protest rallies at the inter-provincial roads will not be allowed .\n\nIt is pertinent to mention here that containers are already being provided at various highways of Punjab, Khyber Pakhtunkhwa and capital city of Islamabad to thwart the participants of the opposition’s azadi march.\n\nPunjab Police department has cancelled leaves of its employees and containers being supplied at various highways in the province. The government has delegated special powers to deputy commissioners including registration of cases under charges of instigating for mutiny and other serious charges.\n\nComments\n\ncomments", "description": "A formal sitting between the government committee & the opposition is set to begin at 5:00 PM today to discuss the issue of 'Azadi March' announced by JUI-F", "authors": ["Web Desk"], "top_image": "https://arynews.tv/wp-content/uploads/2019/10/Maulana-Fazlur-Rehman-Shehbaz-Sharif-1.jpg", "published_at": "2019-10-25"}