{"pub": "yahoo", "url": "https://sports.yahoo.com/ricky-williams-heisman-trophy-is-sold-for-record-amount-132608027.html", "downloaded_at": "2019-10-19 14:40:52.464975+00:00", "title": "Ricky Williams' Heisman Trophy is sold for record amount", "language": "en", "text": "Ricky Williams' 1998 Heisman Trophy was sold on Friday for a record amount. (Photo credit should read ADAM NADEL/AFP/Getty Images)\n\nA Florida sports memorabilia collector is richer by more than half a million dollars this morning after former Texas running back Ricky Williams’ 1998 Heisman Trophy was sold for $504,000 on Friday — a record amount.\n\nWilliams, who sold his trophy to Brian Hobbs in 2014, was the last Heisman winner to be able to profit off the trophy. After Williams’ year, awardees had to sign an agreement that kept them from selling the Heisman.\n\nScroll to continue with content Ad\n\nThere is no word on the new owner or how much Hobbs profited off the sale, but there had to be some value in selling it now. Hobbs told the Associated Press that the fact that Texas football is having a good season factored into the decision.\n\n“I’ve had it in my collection a long time and I can’t keep everything, so I thought this was good timing for the trophy,” Hobbs said. ”(Texas’) football program is doing well, and it’s a very highly sought-after trophy. ... The timing seemed like the right time for the next collector to have it.”\n\nRipe time to sell the trophy\n\nWhen the auction was announced a few weeks ago, projections were that the trophy would sell for around $500,00. It did, indeed, hit that mark.\n\nThe sale broke the record set by Tim Brown’s 1987 Heisman Trophy that was auctioned off for $435,763 last December. Rashaan Salaam’s trophy had been the previous record sale at $399,608 earlier in 2018.\n\nStory continues\n\nGiven that two have decades have passed since Heisman winners were permitted to sell their trophies, it’s no surprise that the value of trophies on the market are increasing. Williams’ trophy seems particularly valuable given the various circumstances. He had a prolific 1998 season for Texas, when he rushed for 2,327 yards and set what was then the all-time NCAA rushing record at 6,279 yards. Additionally — after some recent struggles —Texas football is back on the national radar, entering Saturday ranked 15th in the AP Poll.\n\nThe Heisman is one of the most recognizable individual trophies in sports, and if another trophy changes hands down the line, there is a new benchmark for how much it will sell for.\n\nMore from Yahoo Sports:", "description": "Williams was the last Heisman winner to be able to profit off the trophy.", "authors": ["Eric He"], "top_image": "https://s.yimg.com/ny/api/res/1.2/tHnm_uncuDoCey6f.CiZmQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD0xMDE0LjQ-/https://s.yimg.com/uu/api/res/1.2/WwXFxnisU0SsUUnI_GS8ug--~B/aD0xNTgwO3c9MTk5NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/e9921f60-e3ee-11e9-b3ff-25949f4c955d", "published_at": "2019-10-19"}