{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/dimitar-berbatov-explains-england-could-20568664", "downloaded_at": "2019-10-13 00:26:36.329010+00:00", "title": "Dimitar Berbatov explains why England could struggle to beat Bulgaria in Euro 2020 qualifier", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nDimitar Berbatov says Bulgaria will be a tougher nut to crack in Sofia than they were at Wembley.\n\nThe ex-Manchester United star understands why England are favourites heading into Tuesday night’s fixture.\n\nBut he says his home country were their worst enemies after conceding an early goal in England's 4-0 win last month – and he believes Gareth Southgate’s men will be greeted by a wall of defenders.\n\nBerbatov says trying to outplay England will be pointless for Krasimir Balakov’s side and is expecting a far more cagey evening.\n\nHe said: “The result wasn’t a good one for us – we made a mistake for the first goal – and we need to correct those mistakes.\n\n(Image: Action Images via Reuters)\n\n“It comes down to us really concentrating when we have the ball.\n\n“That’s because England’s players are very active. They pressure you and force you into mistakes.\n\n“And when you are up against really quick players like Raheem Sterling, Jadon Sancho and Marcus Rashford, you can be in trouble.\n\n“Gareth Southgate has got an exciting team and they play football.\n\n(Image: Getty Images)\n\n“It’s intelligent and interesting – you can see from the way the ball is moved around and the movement of the players that the are ideas there, that the tactics are there.\n\n“So we need to be careful. To control the ball and, if we have a chance, to take it. It will be pretty much the same Bulgaria side that played at Wembley.\n\n“I think we will probably defend more because if we try to outplay England we will have big problems.”\n\nThree key men England must watch out for\n\nBOZHIDAR KRAEV\n\n(Image: REUTERS)\n\nBulgaria's main goal threat will come from striker Kraev, a 22-year-old who plies his trade in Portugal with Gil Vicente, on loan from FC Midtjylland in Denmark.\n\nHe made his name with Levski Sofia, scoring 22 times in 83 games, and has found the net twice in 11 games for his nation.\n\nEndeared himself to Vicente fans in his first game of the season, with the shock winner against Porto.\n\nMARCELINHO\n\n(Image: Getty Images)\n\nThe Brazil-born midfielder was one of Bulgaria’s best players at Wembley in September.\n\nNot that he had a particularly good game, he was just one of the few who weren’t awful.\n\nHe joined Bulgarian side Ludogorets in 2011 and qualified for citizenship two years later before a debut for his adopted nation in 2016 against Portugal.\n\nWANDERSON\n\n(Image: Getty Images)\n\nAnother naturalised Bulgarian who hails from Brazil, he made headlines, of the unwanted variety, in August when an elaborate goal celebration came back to haunt him.\n\nThe 31-year-old Ludogorets star raced to the sidelines to plant a smacker on the lips of his wife after scoring against Slavia Sofia. The goal was then chalked off by VAR for offside.", "description": "EXCLUSIVE: Former Manchester United striker says his home country have learned from mistakes in 4-0 defeat to Three Lions last month", "authors": ["Neil Moxley", "Image", "Action Images Via Reuters", "Getty Images", "Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article14172526.ece/ALTERNATES/s1200/0_Champions-League-Round-of-16-First-Leg-Tottenham-Hotspur-v-Borussia-Dortmund.jpg", "published_at": "2019-10-12"}