{"pub": "washingtonpost", "url": "https://washingtonpost.com/entertainment/pop-culture/the-masked-singer-martin-short-chris-daughtry-our-best-guesses-on-the-celebrities-in-disguise/2019/09/26/40beda7a-be69-4c66-bad0-21786af42441_story.html", "downloaded_at": "2019-09-26 15:06:30.466176+00:00", "title": "‘The Masked Singer’: Martin Short? Chris Daughtry? Our best guesses on the celebrities in disguise.", "language": "en", "text": "As host Nick Cannon said at the top of the show, it’s a bit more challenging to tell just who is under the masks this season. Here are our best guesses on the famous faces behind this season’s crop of mystery performers. (Spoiler alert: We’ll update this post as the other celebrities are revealed.)\n\nButterfly\n\nWhat we know about them: “Like a butterfly, for the past year I’ve been waiting patiently in my cocoon for the promise of metamorphosis,” the Butterfly told us from behind its iridescent costume. The masked celeb referenced achieving “success in many stages of life” and being “terrified by the one place I used to call home” — as a photo of London’s Big Ben flashed on the screen. Before taking the stage to perform a powerhouse cover of “Bang Bang” (by Jessie J, Ariana Grande and Nicki Minaj), the Butterfly promised: “I’m here to take you to church — can I get an amen?”\n\nWhat the judges thought: “That was electrifying,” Nicole Scherzinger said. The former Pussycat Doll and Jenny McCarthy agreed Butterfly is a singer and spent a great deal of time debating whether she is young or “older.” Camera flashes in Butterfly’s intro package led Scherzinger to think of model turned actress Cara Delevingne. Butterfly’s voice made McCarthy think of someone else: singer and “American Idol” alum Fantasia. “The only thing that’s kind of throwing me is that she’s from somewhere else,” McCarthy said, alluding to the Big Ben photo in Butterfly’s intro package. Scherzinger also threw out the name of a “more seasoned” legend: Diana Ross. Robin Thicke and Ken Jeong just seemed stumped.\n\nPrevailing social media theories: Michelle Williams, of “Destiny’s Child” fame; Jessie J\n\nOur guess: The soulful voice and church reference makes us think of Williams.\n\nThingamajig\n\nWhat we know about them: Thingamajig’s intro package sounded like a riddle: Hello, all, how you do? What is a Thingamajig? What does it do?” From behind a feathery disguise, Thingamajig told us they are “more than fashion shoots and dreams.” And Thingamajig alluded to multiple talents: “All the stars led to this gig. I’m the singing, dancing Thingamajig.”\n\nWe didn’t get much from his brief exchange with Cannon, who asked the question on all of our minds. “A Thingamajig,” is, apparently, “a thing that likes to majig.”\n\nWhat the judges thought: The panel was blown away by Thingamajig’s soulful rendition of “I’m Easy” by the Commodores. “Thingamajig, you’re so whatchamacallit,” Jeong joked before admitting he had not been expecting to hear such polished vocals. “You might not be known for being a professional singer,” Scherzinger piped, “but you have a really natural voice and you have a beautiful tone.”\n\nThough a reference to “a magic case” in Thingamajig’s intro package got the panel thinking of a magician, the judges concluded that Thingamajig — who towered over the “about 6-1” Cannon — is probably an athlete. His intro package referenced the number 4, which the judges took to be a jersey number. Thicke said Thingamajig’s swagger made him think of a cross between Larry King and a Muppet (we have no idea what this means) and suggested he could be NFL star turned media personality Michael Strahan. Other panel guesses included Dennis Rodman. (“He’s in North Korea,” McCarthy asserted.) The judges were torn between “lean basketball player” and football player.\n\nPrevailing social media theories: Wayne Brady, of “Whose Line Is It Anyway?” fame; NBA player Iman Shumpert; Indiana Pacers Victor Oladipo\n\nOur guess: Oladipo. The Silver Spring, Md., native has posted soulful covers to YouTube. He also happens to wear a No. 4 jersey with the Pacers.\n\nSkeleton\n\nWhat we know about them: “I have no fear of death and I don’t overeat,” Skeleton told us with a raspy laugh. He mentioned having played “second fiddle,” promising to “knock 'em dead” once he had “the spotlight.” And he certainly got our attention with a melodic rendition of Sugar Hill Gang’s “Rapper’s Delight.” After his performance, Cannon asked why Skeleton shakes his bones, and Skeleton explained it’s because he has “no booty to shake.” A perfectly normal exchange!\n\nWhat the judges thought: “I’m getting Vegas vibes,” Scherzinger said. The panel agreed Skeleton is probably a comedian. “Like a drunk Ken Jeong at a wedding,” Thicke said. The panel threw out Jon Cryer, Nathan Lane and Dana Carvey (he did say “Party on,” Cannon chimed in). Jeong, meanwhile, put his bets on one of his comedy idols. “It’s definitely Martin Short,” the doctor turned comic declared. “I know it in my bones.” But a smackdown-round performance of “Hard to Handle” by the Black Crowes added yet another layer to the Skeleton’s disguise. “He’s soulful!” Scherzinger declared.\n\nPrevailing social media theories: Short.\n\nOur guess: We can’t believe we’re saying this, but Short? This one is tough.\n\nLadybug\n\nWhat we know about them: Ladybug referenced a “lifetime of drama,” and having been “born into the limelight.” Her intro package also alluded to several game shows as Ladybug recalled “spinning my wheels” and a family feud. “I’m here to perform on my own terms without fear of being judged,” she told us before singing Bonnie Tyler’s “I Need a Hero.” She later told the judges: “I’ve been through so much in my life that I just feel so lucky to be here.”\n\nWhat the judges thought: The panel loved her song choice. “I grew up on that,” Thicke said. They agreed she might be a professional singer. Thicke thought of Lily Collins, daughter of Phil. McCarthy brought up Willow Smith, daughter of Will and Jada. “I think you’re a performer who happens to sing very well.” Jeong guessed. “Maybe a Lindsay Lohan.” After detecting a Southern accent, Scherzinger threw out another erstwhile singer from a famous family: Jamie Lynn Spears.\n\nPrevailing social media theories: Spears. Susan Lucci. Kelly Osbourne.\n\nOur guess: Spears, but we’re not totally convinced.\n\nRottweiler\n\nWhat we know about them: They put a lot of stock in their appearance — Rottweiler talked about a love of fashion in his intro package. He also mentioned pigskin and Friday night lights (or is it “Friday Night Lights”?). Rottweiler told us he was bitten by a Rottweiler as a kid, inspiring the unusual costume choice. He also told Cannon that he’s “loyal” and “fierce” with a “bit of a wait-and-see attitude.”\n\nWhat the judges thought: The panel agreed they were about to see an athlete and not a “professional singer” — until Rottweiler stopped the show with his rendition of “Maneater” by Hall & Oates. “I’m so confused right now,” McCarthy confessed. By the end, Scherzinger declared Rottweiler her favorite. Jeong told him: “You’re a star underneath that dog mask. We just have to figure out who that star is.” Thicke said he was lost, but threw out a name anyway: Russell Wilson (“He might be able to sing. He’s with Ciara,” Thicke reasoned). The panel then turned its focus to Boy Band members: Brian Littrell of the Backstreet Boys, 'N Sync’s JC Chasez and Nick Lachey.\n\nScherzinger, meanwhile, upped the ante — and vocal range: “I was like, ‘Bruno Mars come out here!’ ”\n\nPrevailing social media theories: A good deal of social media users are convinced Rottweiler is “American Idol” alum Chris Daughtry.\n\nOur guess: Who are we to argue with Daughtry fans?\n\nTree\n\nWhat we know about them: Tree’s intro package focused an awful lot on being known for one thing and being thought of only once a year — a theme that was paired with Yuletide images. She also used the phrase “getting dolled up.”\n\nThen she performed “High Hopes” by Panic! at the Disco.\n\nWhat the judges thought: “Is it Martha Stewart?” Scherzinger wondered. Jeong thought she must be “famous for something Christmas” — Beverly D’Angelo, he offered. McCarthy suggested Wendi McLendon-Covey (of “The Goldbergs” and “Bridesmaids” fame). She also threw out Zooey Deschanel, whose voice was ruled “too smoky” by Scherzinger. Scherzinger also pointed out that Tree’s intro package included several culinary references — “delicious treats,” among them — which made her wonder if Rachael Ray could be behind the mask. Thicke said he loved how committed Tree was to her character.\n\nJeong, meanwhile, guessed Tree was older than ... well, we never found out because the Tree started dancing in a way that made the comedian backtrack: “You’re a young millennial tree. I’m so sorry!”\n\nPrevailing social media theories: Ray; Ayesha Curry (eagle-eyed viewers noted a prominently displayed “30″ in the Tree’s intro package, which could be a reference to Steph Curry’s jersey number.\n\nOur guess: Curry seems to be a promising guess. But honestly, we’re stumped.\n\nRead more:\n\nThe 37 actors you probably think have an Oscar (but inexplicably don’t)\n\nDolly Parton on 'I Will Always Love You’ is the great tearjerking high point of ‘Country Music’", "description": "Two singers were unmasked in the Season 2 premiere of Fox's wacky reality show. Here are our best guesses for the other celebrities in disguise.", "authors": ["Bethonie Butler", "Reporter Covering Television", "Pop Culture"], "top_image": "https://www.washingtonpost.com/resizer/-kWUbhx9l5XmamKclxpgWehicA8=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/C5G5A6LF5JE7VK3IXZWYHCEPSM.JPG", "published_at": "2019-09-26"}