{"pub": "bbc", "url": "https://bbc.com/news/world-asia-50152253", "downloaded_at": "2019-10-23 10:52:49.742970+00:00", "title": "North Korean leader orders South's hotels at resort destroyed", "language": "en", "text": "Image copyright Reuters Image caption Kim Jong-un ordered the removal of \"all the unpleasant-looking facilities\"\n\nNorth Korean leader Kim Jong-un has ordered the demolition of all hotels and other buildings constructed by South Korea at a famous tourist site.\n\nMr Kim described the complex at Mount Kumgang in the North as being built \"like makeshift tents in a disaster-stricken area\", state media report.\n\nThe resort was once hailed as a symbol of inter-Korean co-operation.\n\nBut after visiting the site, Mr Kim said it would be better off being managed without involvement from Seoul.\n\nCorrespondents say Mr Kim's comments echo recent propaganda in the North that stresses the need to prioritise \"self-reliance\" in order to survive and succeed.\n\nImage copyright EPA Image caption Tours to the resort in North Korea started in 1998\n\nImage copyright AFP Image caption The KCNA news agency released a series of images of Kim Jong-un's visit\n\nThe Mount Kumgang resort, in eastern North Korea, was built in the 1990s by South Korean companies on one of the peninsula's most scenic mountains.\n\nHundreds of thousands of Southern tourists were allowed to visit the site under strict controls but tours were abruptly suspended in 2008 after a female tourist was shot dead by a North Korean guard.\n\nIn 2011 the North seized South Korean assets at the complex and expelled the remaining Southern officials.\n\nOn Wednesday, the North's official KCNA news agency said Mr Kim had visited the resort and declared buildings \"shabby\" and \"just a hotchpotch with no national character at all\".\n\n\"He instructed to remove all the unpleasant-looking facilities of the South side and to build new modern service facilities our own way,\" KCNA said.\n\nImage copyright AFP Image caption Mr Kim, touring the site, said the North should be self-sufficient\n\nMr Kim said it would be misguided to view the resort as a symbol of North-South relations and instead it symbolised dependence.\n\n\"Mount Kumgang is our land won at the cost of blood, and even a cliff and a tree on it are associated with our sovereignty and dignity,\" he was quoted as saying.\n\nState media regularly portray Kim Jong-un as a strong and inspirational leader. Earlier this month a series of photos released by KCNA showed him scaling the country's highest mountain, Mount Paektu, astride a white horse.\n\nImage copyright AFP Image caption Mount Paektu is one of North Korea's most revered places\n\nMedia playback is unsupported on your device Media caption Why do North Koreans revere a mountain?\n\nRelations between North and South Korea are currently at a low point.\n\nThe North is angry that the South continues to carry out low-level military exercises with the US, and earlier this summer rejected all further talks with Seoul.\n\nThe two countries are technically still at war. Although the Korean War ended in 1953 with an armistice, a peace treaty was never signed.", "description": "North Korea's leader described a once flagship inter-Korean complex as \"shabby\" and \"a hotchpotch\".", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/1953/production/_109338460_057489299.jpg", "published_at": "2019-10-23"}