{"pub": "cbc", "url": "https://cbc.ca/life/food/jillian-harris-and-tori-wesszer-s-foolproof-guide-to-hosting-season-1.5324308", "downloaded_at": "2019-10-18 01:07:38.107195+00:00", "title": "CBC Life", "language": "en", "text": "For cousins Jillian Harris and Tori Wesszer, food is more than a necessity. \"Food is love,\" the authors of Fraiche Food, Full Hearts say, and no one embodied that better than their grandmother, Marjorie, who showed her love by frequently hosting family meals.\n\nShe used to cook in northern gold mining camps, serving up big meals using only a tiny oven, recalls Wesszer, a registered dietitian and creator of the lifestyle blog, Fraiche Nutrition. \"In her later years, she was in a wheelchair and she somehow still cooked dinner for everyone.\"\n\nHarris, who rose to fame on The Bachelor and now also runs a lifestyle blog and hosts HGTV's Love It or List It Vancouver and Love It Or List It, Too, adds that their grandmother's hosting wasn't fancy or perfect. \"She would just throw it on the table, sometimes it was good and sometimes it wasn't, but she was happy and we were happy.\"\n\nHarris and Wesszer's grandmother passed away in July and the authors dedicated their new cookbook to the woman they describe as the heart of their family. In addition to featuring many of their grandmother's Ukrainian recipes, such as her signature beet rolls, Fraiche Food, Full Hearts, offers more than 100 recipes for everyday meals as well as celebrations, with numerous vegan, vegetarian and gluten-free options.\n\nIn the lead-up to the holidays, we sat down with Harris and Wesszer to get their advice for how hosts can channel grandma Marjorie and spread some love this season — without stressing or breaking the bank.\n\nWhen you're hosting, how do you decide how fancy or simple to make a meal?\n\nJillian Harris: I think, really gauge it with what you have on your plate, what you feel like doing, what you want to do because you literally could go all Martha Stewart... but you don't have to. Tori and I are both very creative... we both love to tell people how to dress a table and how to do this fancy name tag and this beautiful menu and goodie bags to take home, and if that's something you enjoy doing, do it, but don't let that define you or your party. Do it because you want to do it.\n\nWhen preparing for a celebration, say a holiday dinner, how do you make sure it doesn't get out of control in terms of planning and cost?\n\nJH: Use what you already have and also play into your existing decor. So, if you've already got navys and burgundys and whatnot, play into that. Your guests don't care whether your items are new or old so using older items is fine or borrowing, like if you're hosting dinner and you know your mom has some really amazing china, ask her to bring it over.\n\nTori Wesszer: If you like an eclectic look, you can go to like a Value Village... or sort of a thrift store, and you could make [a lot] for very, very little money.\n\nJH: Totally. Instead of spending forty dollars $40 on a runner, you could go to the fabric store and get a really nice piece of tartan and just drape it and fold it under and iron it. There's a lot of really great ways to save money, for sure.\n\nWhat's your advice for single hosts who are perhaps concerned about shouldering all that work, and cost, on their own?\n\nTW: If you're going to feel stressed out about it, don't try a new recipe for the first time. The great thing about this cookbook, among many things, is that because [the recipes are] so plant-heavy, vegetables don't cost as much as a filet mignon or a prime rib.\n\n[If] you don't have another set of hands, do everything you possibly can ahead of time. Like if you have a pasta sauce, like Jillian's bolognese, make the pasta sauce the day before, even. Have that sitting in the fridge, have your parmesan grated and then maybe the only thing you have to do as your guests come in is boil the pasta, and you look like a rock star — but you've done very little because you do all the sweating before.\n\nHow can hosts plan for meals that need to accommodate multiple dietary restrictions?\n\nTW: The same dish can be made a few different ways. You're not making five different menus, you're making one menu and maybe one dish is made two different ways, but the same base ingredients are there, so it really cuts down on food prep.\n\nMany of the meals in your book have been adapted to be vegan and healthy — but were there some recipes you kept in their original decadent form?\n\nJH: Yeah, like my mom's chocolate cake. It has mayo and sugar, but it is the best damn chocolate cake ever. My grandma's beet rolls... they've got beet leaves, so there's some green to it, but just holding the bread together. Those are a little bit more decadent.\n\nTW: There's definitely a solid handful of recipes in there that we just decided not to mess with. I think we just realized, this is truly the way we eat... I think it's good for people to know these indulgent foods can fit in, in moderation.\n\nMany of these recipes come from different members of your family. If you were each to pick a dish that really represents you, what would it be?\n\nJH: Mine is the bolognese. I just love pasta and sauce.\n\nTW: I feel like my first love is baking so as un-dietitian-ly as this is, the scones probably.\n\nLastly, if you could host a dinner party for anybody, who would your dream guest be and what would you serve?\n\nTW: Grandma. That's, like, 100 per cent. I don't care about all the fame in the world, grandma's definitely there.\n\nJH: And all she would want is beet rolls and wine.\n\n(Photography by Janis Nicolay; courtesy of Penguin Random House)\n\nIshani Nath is a freelance lifestyle and culture reporter with bylines in FLARE, Maclean's, Reader's Digest Canada and more. Follow her @ishaninath.", "description": "As we enter the holiday season, the authors of Fraiche Food, Full Hearts give us their tried-and-true advice.", "authors": [], "top_image": "https://i.cbc.ca/1.5324387.1571326032!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/fraiche-food.jpg", "published_at": "2019-10-17"}