{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKBN1WS0B8-OCASP", "downloaded_at": "2019-10-13 11:40:46.475394+00:00", "title": "Medvedev mauls Zverev to lift Shanghai Masters title", "language": "en", "text": "(Reuters) - Russian Daniil Medvedev pulverized Alexander Zverev 6-4 6-1 to lift his fourth title of the season at the Shanghai Masters on Sunday.\n\nTennis - Shanghai Masters - Men's Singles - Final - Qi Zhong Tennis Center, Shanghai, China - October 13, 2019. Daniil Medvedev of Russia celebrates winning Shanghai Masters with his trophy. REUTERS/Aly Song\n\nGermany’s Zverev started the match with a 4-0 head-to-head record in his favor against Medvedev but had conceded that his opponent was “probably the best player in the world” at the moment.\n\nU.S. Open runner-up Medvedev, playing in his sixth straight final, broke Zverev twice to close out the opening set in front of a packed crowd.\n\nThe 23-year-old was at his ruthless best in the second set as he raced to a 5-0 lead before Zverev finally showed some resistance to hold serve.\n\nYet Medvedev then served out the match with an emphatic ace to claim his second consecutive ATP Masters 1000 crown following his triumph in Cincinnati.\n\nWhen asked why he does not like celebrating his victories on court, Medvedev quipped: “I said it after Cincinnati I think that everyone has been talking that they want to see something new. So I don’t celebrate my wins, just get the win and it’s done.”\n\nMedvedev enjoyed a near-flawless week in Shanghai - claiming the title without dropping a set all week - as he continues as incredible second half of the season.\n\nThe world number four improved his 2019 win-loss record to 59-17, including a Tour-leading 46 victories on hard courts this season.\n\nHe has already qualified for the season-ending ATP Finals in London, alongside Novak Djokovic, Rafa Nadal, Roger Federer, Dominic Thiem and Stefanos Tsitsipas.\n\nAmong the next generation of players coming through, Medvedev is widely tipped to break the stranglehold of the ‘Big Three’ - Djokovic, Nadal and Federer - at the top of the sport and become a regular Grand Slam contender next season.\n\n“It is outrageous what I have done in the last few months,” Medvedev said. “I have worked for it and I hope I’m gonna do much more.”\n\nWith two spots in the London finals still up for grabs, Zverev is in pole position to qualify as he currently occupies seventh spot in the qualification race.", "description": "Russian Daniil Medvedev pulverized Alexander Zverev 6-4 6-1 to lift his fourth title of the season at the Shanghai Masters on Sunday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191013&t=2&i=1440346990&w=1200&r=LYNXMPEF9C0CD-OCASP", "published_at": "2019-10-13"}