{"pub": "yahoo", "url": "https://sports.yahoo.com/report-big-loss-dolphins-players-015853896.html", "downloaded_at": "2019-09-09 06:53:28.731439+00:00", "title": "Report: Big loss has Dolphins' players wanting out", "language": "en", "text": "Whether the Miami Dolphins lost their season opener by 49 points because they had a bad week, or because the front office is resigned to losing as part of a rebuilding phase, multiple players reportedly want out -- now.\n\nPro Football Talk's Mike Florio, citing \"a league source with knowledge of the situation,\" reported Sunday that some players wasted little time after their 59-10 blowout loss to the Baltimore Ravens in ordering their agents to get them traded elsewhere.\n\nSuspicions have arisen that the Dolphins could be willing to lose so they get higher draft picks.\n\nScroll to continue with content Ad\n\nThe speculation intensified on Aug. 31 when the Dolphins traded away tackle Laremy Tunsil, a first-round draft pick in 2016, and six-year veteran wide receiver Kenny Stills, to the Houston Texans, reportedly to receive first-round picks in 2020 and 2021, and a second rounder in 2021.\n\nMiami's talks with Houston were believed to have begun with the Dolphins asking about star edge rusher Jadeveon Clowney. But the Texans instead dealt Clowney to the Seattle Seahawks.\n\nBrian Flores, the Dolphins' first-year coach, has repeatedly said the franchise is not tanking -- in effect, trying to lose to improve their draft selection -- though such admissions are rare.\n\nThe Dolphins finished 7-9 last year, but were projected to be one of the league's worst teams in 2019 by most NFL experts even before Sunday's stinker and the ensuing mutiny reports.\n\n--Field Level Media", "description": "Whether the Miami Dolphins lost their season opener by 49 points because they had a bad week, or because the front office is resigned to losing as part of a rebuilding phase, multiple players reportedly want out -- now.  Pro Football Talk's Mike Florio, citing \"a league source with knowledge", "authors": [], "top_image": "https://s.yimg.com/aaq/c/social/images/social_default_logo-1x1.png", "published_at": "2019-09-09"}