{"pub": "yahoo", "url": "https://news.yahoo.com/donald-trump-inspired-new-show-demagogic-populist-david-simon-123040411.html", "downloaded_at": "2019-10-25 22:45:24.215069+00:00", "title": "Donald Trump inspired a new HBO show about a ‘demagogic populist': David Simon", "language": "en", "text": "The novelist Margaret Atwood credited President Donald Trump for inspiring “The Testaments,” her recently released sequel to “The Handmaid’s Tale.” Two years before, a rendition of Shakespeare’s “Julius Caesar,” performed in Manhattan, stoked controversy when it portrayed the Greek emperor as Trump.\n\nA forthcoming new HBO (T) show from television writer and producer David Simon also counts Donald Trump as its inspiration — and not in a favorable light.\n\nSimon, best known for “The Wire” and “Treme,” says in a newly released interview that the show invokes “the idea of a demagogic populist untethered from the old party system who has a simple, fundamental message that appeals in the most basic way.”\n\nAn adaptation of “The Plot Against America,” a work of alternative history by the late Philip Roth, the show is set to depict the emergence of a proto-fascist America after the election of aviator and isolationist Charles Lindbergh.\n\n“With Lindbergh in that book, it's peace and prosperity,” says Simon. “I'll keep you out of World War II. I'll keep you out of Europe, out of the next European war. And a sense of the other in American life. In that book, it's American Jewry, American Jews, that are the worrisome other that he uses as kindling for a dry run at fascism.”\n\nSimon compared Trump’s political approach to that of Lindbergh’s character in the book.\n\n“There's a very simple message that Trump used effectively to outrun the party system,” he says. “Now the other is people of color, immigrants, people who are not white, people who are not straight, people who are a little bit off of what previous generations of Americans might have called ‘normal, white America,’ you know, and all that that phrase entails.”\n\n“So there's a very real reason to do ‘The Plot Against America’ now,” Simon adds.\n\nThe premise of the show may remind viewers of “The Man in the High Castle,” a program on Amazon Prime (AMZN) that adapted the 1962 novel of that name by Philip K. Dick. The novel and show take place decades after Japan and Germany have defeated the United States in World War II, the latter country becoming a fascist vassal split between the victors. Hulu’s adaptation of Atwood’s “A Handmaid’s Tale” similarly depicts U.S. territory under an authoritarian regime.\n\nSimon is best known for creating the HBO show “The Wire,” which ran for five seasons in the mid-2000s. His other shows include “Treme,” “Show Me a Hero,” and most recently “The Deuce,” starring James Franco and Maggie Gyllenhaal. Simon won an Emmy in 2000 and has been nominated for four since. He previously worked as a journalist for the Baltimore Sun and is the author of “Homicide: A Year on the Killing Streets,” which chronicles his year with detectives from the homicide unit of Baltimore’s police department.\n\nSimon made the comments during a conversation that aired in an episode of Yahoo Finance’s “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.\n\nTelevision writer and producer David Simon appears on Influencers with Andy Serwer. More\n\n‘There is an ethic of how you have to behave’\n\nAfter criticizing Trump, Simon said he believes the president should be impeached, though he acknowledged it may face political hurdles.\n\n“Whether it's successful or not, whether it's politically viable or not, there is an ethic of how you have to behave and what rules have to apply if the American republic is going to survive,” Simon says.\n\n“If you say this doesn't merit the response of the other branch of government to assert for the Constitution and for what the Constitution says fundamentally, then that document's meaningless. And the construct, the checks and balances of the republic, have been rendered moot.”\n\nRead more:\n\n\n\n\n\n\n\n", "description": "David Simon's new show is based on “The Plot Against America,” a work of alternative history by the late Philip Roth that depicts the emergence of a proto-fascist America after the election of aviator and isolationist Charles Lindbergh", "authors": ["Max Zahn"], "top_image": "https://s.yimg.com/uu/api/res/1.2/T.SiESe4Uld568ntVz95jA--~B/aD0xNTEyO3c9MjM3OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/6246ae60-f61b-11e9-b1ff-8f34c97d9086", "published_at": "2019-10-25"}