{"pub": "independent", "url": "https://independent.co.uk/sport/cricket/ashes/ashes-2019-joe-root-england-australia-jofra-archer-steve-smith-ben-stokes-a9106541.html", "downloaded_at": "2019-09-15 23:11:22.480845+00:00", "title": "Ashes 2019: Joe Root reveals what pleased him most as England beat Australia to secure series draw", "language": "en", "text": "England skipper Joe Root expressed his delight at his side's character after beating Australia in the fifth Test by 135 runs at The Oval to ensure they drew Ashes series 2-2.\n\nFour wickets each from Stuart Broad and Jack Leach did for the visitors, who will be content at retaining the urn.\n\nRoot was thrilled by the response to defeat at Old Trafford in the fourth Test and singled out Jofra Archer for special praise.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nRoot said: \"We were excellent this week. Having lost the toss, to play as we did was fantastic. We drove the game all the time and got there in the end.\n\n\"Jofra makes things happen, and he's backed up with other skilful bowlers. Collectively we've shown a lot of character throughout the whole series.\n\nShape Created with Sketch. Fifth Ashes Test in pictures Show all 21 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Fifth Ashes Test in pictures 1/21 England vs Australia England Joe Root tosses the coin Getty Images 2/21 England vs Australia Australia's Pat Cummins appeals unsuccessfully AP 3/21 England vs Australia Australia's Pat Cummins (L) celebrates with teammates AFP/Getty Images 4/21 England vs Australia Ben Stokes bats Action Images via Reuters 5/21 England vs Australia England's captain Joe Root reacts after losing his wicket AFP/Getty Images 6/21 England vs Australia England's Joe Root reacts after losing his wicket Action Images via Reuters 7/21 England vs Australia Australia's Mitchell Marsh celebrates taking the wicket of England's Sam Curran Action Images via Reuters 8/21 England vs Australia Sam Curran walks off after being caught by Australia's Steve Smith Action Images via Reuters 9/21 England vs Australia Marnus Labuschagne attempts to stop a boundary Action Images via Reuters 10/21 England vs Australia England's Jos Buttler hits a six AFP/Getty Images 11/21 England vs Australia England's Jos Buttler raises his bat PA 12/21 England vs Australia Australia's David Warner in action Action Images via Reuters 13/21 England vs Australia Steve Smith of Australia bats Getty Images 14/21 England vs Australia Australia's David Warner leaves the pitch AP 15/21 England vs Australia A packed out Oval watches on as England build a lead on day three Getty Images 16/21 England vs Australia Joe Root has little sympathy as Joe Denly takes one in a painful area Getty Images 17/21 England vs Australia Switcheroo - Ben Stokes reverse sweeps effectively Getty Images 18/21 England vs Australia Joe Denly raises his bat after making fifty Getty Images 19/21 England vs Australia Joe Denly salutes the crowd after falling six short of a maiden Test ton Getty Images for Surrey CCC 20/21 England vs Australia Jos Buttler has his eyes on the ball AFP/Getty Images 21/21 England vs Australia Steve Smith magnificently catches Chris Woakes Getty Images 1/21 England vs Australia England Joe Root tosses the coin Getty Images 2/21 England vs Australia Australia's Pat Cummins appeals unsuccessfully AP 3/21 England vs Australia Australia's Pat Cummins (L) celebrates with teammates AFP/Getty Images 4/21 England vs Australia Ben Stokes bats Action Images via Reuters 5/21 England vs Australia England's captain Joe Root reacts after losing his wicket AFP/Getty Images 6/21 England vs Australia England's Joe Root reacts after losing his wicket Action Images via Reuters 7/21 England vs Australia Australia's Mitchell Marsh celebrates taking the wicket of England's Sam Curran Action Images via Reuters 8/21 England vs Australia Sam Curran walks off after being caught by Australia's Steve Smith Action Images via Reuters 9/21 England vs Australia Marnus Labuschagne attempts to stop a boundary Action Images via Reuters 10/21 England vs Australia England's Jos Buttler hits a six AFP/Getty Images 11/21 England vs Australia England's Jos Buttler raises his bat PA 12/21 England vs Australia Australia's David Warner in action Action Images via Reuters 13/21 England vs Australia Steve Smith of Australia bats Getty Images 14/21 England vs Australia Australia's David Warner leaves the pitch AP 15/21 England vs Australia A packed out Oval watches on as England build a lead on day three Getty Images 16/21 England vs Australia Joe Root has little sympathy as Joe Denly takes one in a painful area Getty Images 17/21 England vs Australia Switcheroo - Ben Stokes reverse sweeps effectively Getty Images 18/21 England vs Australia Joe Denly raises his bat after making fifty Getty Images 19/21 England vs Australia Joe Denly salutes the crowd after falling six short of a maiden Test ton Getty Images for Surrey CCC 20/21 England vs Australia Jos Buttler has his eyes on the ball AFP/Getty Images 21/21 England vs Australia Steve Smith magnificently catches Chris Woakes Getty Images\n\n\"We were not always at our best, but we've fought really hard. Credit to Tim (Paine) and his team.\"\n\nEngland's man of the series Ben Stokes reiterated his disappointment at not winning the Ashes, but admitted the drawn series ensured some pride.\n\nStokes said: \"Obviously it was disappointing in Manchester for us to know that we couldn't get the Ashes back.\n\n\"But we turned up here this week knowing that we still had a huge amount of pride and the Test Championship to play for, and we managed to draw the series, which was the goal at the end of this game.\"\n\nWhile man of the series Steve Smith paid tribute to a \"spectacular\" contest.\n\nSmith said: \"It's been an amazing couple of months in England. The cricket's been spectacular. The series has ebbed and flowed.\n\n\"I've loved every minute and am proud to have been able to perform for Australia and bring the urn home.\n\n\"The middle of the wicket still played pretty well, and Wade applied himself, batted beautifully today. But England played terrific cricket.\"", "description": "England skipper Joe Root expressed his delight at his side's character after beating Australia in the fifth Test by 135 runs at The Oval to ensure they drew Ashes series 2-2. Four wickets each from Stuart Broad and Jack Leach did for the visitors, who will be content at retaining the urn.", "authors": ["Jack Rathborn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/15/20/Joe-Root-was-delighted-with-the-character-England-displayed.jpg", "published_at": "2019-09-15"}