{"pub": "cnbc", "url": "https://cnbc.com/2019/10/30/heres-how-the-fed-rate-cut-affects-you.html", "downloaded_at": "2019-10-30 23:16:44.696907+00:00", "title": "Here's how the Fed rate cut affects you", "language": "en", "text": "The Federal Reserve's decision to cut interest rates by a quarter point for the third time this year is meant to bolster the economy. Everyday Americans may lose some ground. On the one hand, lower rates often mean cheaper loans, which can impact your mortgage, home equity loan, credit card, student loan tab and car payment. However, borrowers may not get the full benefit if the economy is weakening, as the Federal Open Market Committee and Chairman Jerome Powell have suggested it is. In anticipation of an economic slowdown, lenders are less inclined to lend money and may even charge a higher interest rate to hedge against the risk, according to Richard Barrington, a financial expert with MoneyRates.com. Consumers also likely will earn less interest on their savings accounts and, in some cases, lose buying power over time. \"In this case, a Fed rate cut would not be very good\" for savers or borrowers, Barrington said. Here's a breakdown of how it works:\n\nCredit cards\n\nFor starters, the prime rate, which is the rate banks extend to their most creditworthy customers, is typically 3 percentage points higher than the federal funds rate. That not only determines your savings rate, it also is the rate used for many types of consumer loans, particularly credit cards. With a rate cut, the prime rate lowers, too, and credit cards likely will follow suit. Most credit cards come with a variable rate, which means there's a direct connection to the Fed's benchmark rate. As a result, cardholders could see a reduction in their annual percentage rate within a billing cycle or two. Considering the average household owes $8,602, that will save credit card users roughly $1.6 billion in interest, according to an analysis by WalletHub. However, credit card debt will continue to be expensive, with APRs still only down slightly from all-time highs. A quarter-point decrease from around 17.5% saves someone making minimum payments toward the average debt about $1 a month, according to Ted Rossman, industry analyst at CreditCards.com. \"A quarter of a percent decrease isn't going to rescue anyone,\" said Sara Rathner, a credit card expert at NerdWallet. Better yet, shop around for a zero-interest balance transfer offer and \"transfer your existing high-rate credit card debt to a new card with no interest while you still can,\" Rossman advised. If the economy continues to soften, these terms could get less generous, he said. At any time, cardholders can also reach out to their issuer directly to request a break on interest rates.\n\nSavings\n\nMortgages\n\nFederal funds and mortgage rates are not directly linked. Rather, the economy, the Fed and inflation all have some influence over long-term fixed mortgage rates, which generally are pegged to yields on U.S. Treasury notes. Mortgage rates have already been declining for almost a year, noted Tendayi Kapfidze, chief economist at LendingTree, an online loan marketplace, with the average 30-year fixed rate now just under 4%, according to Bankrate. \"Mortgage rates this low at the end of an economic cycle is nearly unprecedented, and may be very well keeping the housing market — and U.S. economy — afloat,\" said Ralph McLaughlin, deputy chief economist and executive of research and insights for CoreLogic.\n\nThat makes this a good time to refinance at a lower rate, which would save the average homeowner about $150 a month, according to Greg McBride, chief financial analyst at Bankrate. \"The refinancing window is still wide open,\" he said. Many homeowners with adjustable-rate mortgages, which are pegged to a variety of indexes such as Libor or the 11th District Cost of Funds, may see their interest rate go down as well, although not immediately because many ARMs reset just once a year. The Fed's third consecutive rate cut will also make it slightly cheaper for consumers to borrow money from a home equity line of credit — a popular way for homeowners to pay for renovations and repairs — or pay back their current HELOC loan. Unlike an ARM, HELOCs could adjust within 60 days, so borrowers will benefit from smaller monthly payments within a billing cycle or two.\n\nAuto loans\n\nFor those planning on purchasing a new car, the Fed decision likely will not have any big material effect on what you pay. For example, a quarter-point difference on a $25,000 loan is $3 a month, according to Bankrate. Auto loan rates have remained low, even after years of rate hikes. Currently, the average five-year new car loan rate is 4.61%, up from 4.34% when the Fed started boosting rates, while the average four-year used car loan rate is 5.34%, up from 5.26% over the same time period, according to Bankrate. However, since new cars are often financed by car manufacturers, this rate cut will lower their costs, as well, and could mean car shoppers will see more favorable rates to come, Kapfidze said. Other factors will also play a role in the overall cost of a car in the months ahead, including increased tariffs on materials.\n\nStudent loans", "description": "For consumers, lower rates do mean cheaper loans, which can impact your mortgage, home equity loan, credit card, student loan tab and car payment. On the flip side, you'll earn less interest on savings accounts and, in some cases, lose buying power over time.", "authors": ["Jessica Dickler"], "top_image": "https://image.cnbcfm.com/api/v1/image/106144303-1569256740343gettyimages-1162886351.jpeg?v=1569256833", "published_at": "2019-10-30"}