{"pub": "politico", "url": "https://politico.com/news/2019/10/17/mulvaney-confirms-ukraine-aid-2016-probe-050156", "downloaded_at": "2019-10-18 01:09:05.122288+00:00", "title": "Mulvaney acknowledges Ukraine aid was withheld to boost political probe", "language": "en", "text": "He added: \"The look-back to what happened in 2016 certainly was part of the thing that he was worried about in corruption with that nation.\"\n\nMore than five hours after the briefing, the White House issued a statement attributed to Mulvaney in which he sought to walk back his earlier comments.\n\n\"Once again, the media has decided to misconstrue my comments to advance a biased and political witch hunt against President Trump,\" the statement said. \"Let me be clear, there was absolutely no quid pro quo between Ukrainian military aid and any investigation into the 2016 election. The president never told me to withhold any money until the Ukrainians did anything related to the server. The only reasons we were holding the money was because of concern about lack of support from other nations and concerns over corruption.\n\n\"Multiple times during the more-than 30 minute briefing where I took over 25 questions, I referred to President Trump’s interest in rooting out corruption in Ukraine, and ensuring taxpayer dollars are spent responsibly and appropriately. There was never any connection between the funds and the Ukrainians doing anything with the server — this was made explicitly obvious by the fact that the aid money was delivered without any action on the part of the Ukrainians regarding the server.\n\n\"There never was any condition on the flow of the aid related to the matter of the DNC server.\"\n\nThe explosive remarks from the West Wing's senior staffer before reporters seemed to provoke alarm among congressional lawmakers and Trump's allies in equal measure.\n\n\"I'm starting to get worried for POTUS now,\" a person close to the Trump campaign said in a text message of Mulvaney's performance. \"Total disaster unless there's some strategy I'm not seeing.\"\n\n\"I thought it was really remarkable,\" said one former White House official, \"because it was either a huge unforced error or a calculated concession.\"\n\nHouse Intelligence Chairman Adam Schiff (D-Calif.), one of the leaders of the Democratic impeachment proceedings, also offered a dour assessment.\n\n\"I think Mr. Mulvaney’s acknowledgment means that things have gone from very, very bad to much, much worse,\" Schiff said.\n\nPressed during the news conference on whether he was describing a quid pro quo with Ukraine, Mulvaney responded that \"we do that all the time with foreign policy,\" and cited the holding back of financial assistance to Northern Triangle countries to affect their immigration policies.\n\n\"I have news for everybody: Get over it. There's going to be political influence in foreign policy.\" - Acting White House chief of staff Mick Mulvaney\n\n\"I have news for everybody: Get over it. There's going to be political influence in foreign policy,\" he said. \"That is going to happen. Elections have consequences, and foreign policy is going to change from the Obama administration to the Trump administration.\"\n\nDemocrats have aggressively accelerated their impeachment inquiry since it was revealed that Trump urged newly elected Ukrainian President Volodymyr Zelensky during a July phone call to review two unsubstantiated charges: that Ukraine was somehow involved in wrongdoing involving Hillary Clinton's emails, and that Joe Biden led efforts to fire a Ukrainian prosecutor in order to protect his son's interests in the region.\n\nAlthough Mulvaney insisted that \"the money held up had absolutely nothing to do with Biden,\" Trump raised both allegations during his call with Zelensky.\n\nMulvaney also pushed back Wednesday against a question regarding a whistleblower complaint that details alleged attempts by White House officials to \"lock down\" records of that conversation. He instead pointed to the release of a readout of the call between the two leaders — which came only after intense pressure from Congress.\n\n\"Everyone wants to believe there's a cover-up,\" he said. \"You don't give stuff to the public and say, 'Here it is,' if you're trying to cover something up.\"\n\nSeveral administration officials are under inspection by lawmakers for their potential roles in a campaign to pressure Ukraine's government, and Mulvaney, who still serves as director of the White House budget office, has been scrutinized regarding the stalled aid to Kyiv.\n\n\"I was involved with the process by which the money was held up temporarily, OK?\" he said. \"Three issues for that: the corruption in the country, whether or not other countries were participating in the support of the Ukraine, and whether or not they were cooperating in an ongoing investigation with our Department of Justice. That's completely legitimate.\"\n\nThe final condition Mulvaney listed appears refer to Attorney General William Barr's investigation of foreign interference in the 2016 election, which detractors have criticized as a White House-backed bid to discredit the work of former special counsel Robert Mueller.\n\nGabby Orr, Andrew Desiderio and Daniel Lippman contributed to this report.", "description": "", "authors": ["-", "Acting White House Chief Of Staff Mick Mulvaney"], "top_image": "http://v.politico.com/images/1155968404/201910/594/1155968404_6095645344001_6095642043001-vs.jpg?pubId=1155968404", "published_at": "2019-10-17"}