{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7616167/Jessika-Power-shows-sensational-body-skimpy-bikini.html", "downloaded_at": "2019-10-26 11:16:44.261155+00:00", "title": "Jessika Power shows off her sensational body in a skimpy bikini", "language": "en", "text": "She underwent a $16,000 breast lift in July.\n\nAnd on Saturday, Jessika Power showed off the results of her surgically-enhanced assets in a skimpy pink bikini.\n\nTaking to Instagram, the 29-year-old MAFS star shared a video flaunting her toned physique as she frolicked on the beach.\n\nJumping for joy! MAFS' Jessika Power (pictured) showed off her busty assets in a skimpy bikini while frolicking on the beach\n\nThe former reality TV star joyfully jumped on the sand while the waves were crashing behind her.\n\nHer golden blonde tresses, which are tied in a high ponytail, flew in the wind while she leapt up and down.\n\n'Of course I manage to look like a dork while trying to be cute and sexy. I’m not cut out for that life and I ain’t complaining,' she captioned the post.\n\nAll smiles: Jessika flaunted her toned physique as she leapt up and down while the waves crashed behind her\n\nFlaunt it! Jessika is no stranger to flaunting her assets are undergoing a $16,000 breast lift and autologous fat graft in July\n\nJessika is definitely no stranger to showing off her sensational body as she has spent more than $50,000 on cosmetic procedures since January.\n\nMost recently, the blonde revealed that she had a $16,000 breast lift and autologous fat graft.\n\nThe 'non-surgical' procedure took fat cells from her 'problem areas', her thighs and buttocks, and deposited them in her breasts.\n\nNew and improved: The 'non-surgical' procedure took fat cells from her 'problem areas', her thighs and buttocks, and deposited them in her breasts\n\nSpeaking to New Idea, she explained it took her doctor just one hour to transform her B-cup breasts into D-cups with the aid of fat grafting.\n\n'I had this little pocket of fat, I don't know what it is, no matter how much dieting I do, no matter how much exercise I do, I just couldn't get rid of it,' she said.\n\nIn addition to her $16,000 breast lift, Jessika has also had lip fillers, cheek fillers and veneers.", "description": "She underwent a $16,000 breast lift in July.", "authors": ["Mary Mrad For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/10/20211554-0-image-a-41_1572081007560.jpg", "published_at": "2019-10-26"}