{"pub": "huffpost", "url": "https://huffpost.com/entry/mayor-pete-buttigieg-health-medicare-plan_n_5d82c487e4b0849d472331c0", "downloaded_at": "2019-09-19 23:06:14.867292+00:00", "title": "From Mayor Pete, Here Comes 'Medicare For All Who Want It'", "language": "en", "text": "Democratic presidential candidate Pete Buttigieg introduced a health care plan Thursday designed to cover nearly everybody and make insurance less expensive for people who have it already, through a combination of expanded government subsidies, limits on medical prices and a new “public option.”\n\nHealth care has emerged as a top issue in the 2020 presidential campaign, with progressives, in particular, excited about the possibility of creating a government-run, “Medicare for All” insurance program that would cover everybody. One of the 2020 front-runners, Sen. Bernie Sanders (I-Vt.), is the idea’s most famous champion. Another front-runner, Sen. Elizabeth Warren (D-Mass.), has endorsed it.\n\nButtigieg, who is the Democratic mayor of South Bend, Indiana, is among the candidates wary of going that far.\n\nAlthough Buttigieg has said he would like to see Medicare for All in the U.S. someday, he has warned that trying to establish a version of it right away would be difficult given public skittishness about such a sweeping change and the practical complications of transforming one-sixth of the U.S. economy.\n\nInstead, Buttigieg has said, he would prefer to create a government insurance program that would be open to everybody but also optional for everybody. He calls this approach “Medicare for all who want it,” and the new campaign proposal, which his advisers distributed to reporters prior to its release, explains the basic logic.\n\n“If private insurers are not able to offer something dramatically better, this public plan will create a natural glide-path to Medicare for All,” the document says. “It gives the American people a choice and trusts them to set the pace at which our country moves in a better direction on health care.”\n\nNotwithstanding the policy differences between the program Buttigieg has in mind and the one Sanders and Warren envision, on Thursday he described his plan in the same way that they do, by emphasizing his desire to confront and overcome special interests that have historically resisted aggressive reforms designed to make health care more affordable.\n\nScott Eisen/Getty Images Pete Buttigieg's health care proposal is termed \"Medicare for all who want it.\"\n\n“For years, Washington politicians have allowed the pharmaceutical industry, giant insurance companies, and powerful hospital systems to profit off of people when they are at their sickest and most vulnerable,” Buttigieg said in a prepared statement. “My ‘Medicare for All Who Want It’ plan will create a health care system that puts power in the hands of each American.”\n\nAnd, although Buttigieg’s plan is less ambitious than the approach Sanders and Warren endorse, it would make health care more affordable for millions of Americans and make sure almost everybody has comprehensive insurance.\n\nAt the same time, it would entail its own set of trade-offs, such as new federal spending that would require new revenue and the retention of a large, wasteful private insurance bureaucracy.\n\nCoverage For More People, And More Affordable Coverage\n\nAlthough Buttigieg’s thinking on the public option and Medicare for All is likely to attract the most attention from the most politically engaged observers, the feature of his plan likely to make the most immediate, widespread impact is its proposal to bolster the insurance now available through HealthCare.gov and state marketplaces like Covered California that the Affordable Care Act created.\n\nIn particular, Buttigieg would guarantee that anybody buying insurance through one of those marketplaces could enroll in the new public option or buy a “gold” private plan, in which premiums would be no more than 8.5% of a household’s adjusted gross annual income. And that is just the maximum amount a consumer would owe. For millions, insurance would cost less, thanks to federal subsidies that already exist but that Buttigieg would make more generous.\n\nThis is one way the Buttigieg would build and improve upon the Affordable Care Act, also known as Obamacare.\n\nToday, people buying coverage through one of the marketplaces are generally eligible for subsidies. But the subsidies are smaller than the ones Buttigieg now proposes, they are designed to pay for the less generous “silver” plans, and they are not available to people whose income is higher than four times the poverty line, which is about $50,000 annually for an individual and $103,000 for a family of four.\n\nThe result is that a significant number of people buying coverage on the marketplaces are still struggling with health care expenses.\n\nTo illustrate the difference, the Buttigieg campaign documents cited a hypothetical example: A 60-year-old in Iowa with an annual income of $50,000. Today, that Iowan has the option to buy a silver plan for $12,000 in premiums over the course of a year, according to the campaign. Under the Buttigieg plan, that 60-year-old could get a more generous gold plan while paying just $4,250 in premiums.\n\nAnother way the Buttigieg plan would improve upon the Affordable Care Act would be by making those marketplace plans, including the new public option, available to anybody. This could make a big difference to workers, especially low-income workers, whose company plans have high premiums, high out-of-pocket costs or both.\n\nButtigieg has said that health care should be a right, not a privilege, and for that reason his plan focuses on bringing the uninsured into the system. The program would automatically enroll anybody eligible for free coverage through either Medicaid or the public option, and it would provide a streamlined “one-click enrollment option” for people whose incomes made them eligible for subsidies.\n\nIt gives the American people a choice and trusts them to set the pace at which our country moves in a better direction on health care. Pete Buttigieg campaign document\n\nThat doesn’t mean enrollment would be compulsory. Even those people subject to automatic enrollment into Medicaid or the public option could choose a different plan or opt out of coverage altogether.\n\nBut Buttigieg also wants “retroactive” enrollment for people with no insurance who end up using medical care, so that they don’t get stuck with crippling bills and so that the providers of that care can get paid for services. “For every month they did not have insurance, they will pay the plan’s premium through their income tax return,” according to the campaign plan.\n\nThe campaign documents do not specify exactly how that part of the new system, or the other automatic enrollment features, would actually work.\n\nLess Disruption, For Better And For Worse\n\nIf an advantage of these public option plans is their relative lack of disruption, a disadvantage is their relative complexity.\n\nBecause they do not envision the kinds of sweeping changes that Medicare for All would bring, they leave in place a patchwork system of private and public insurance programs that beneficiaries find confusing and that end up increasing costs systemwide because they make billing and management of benefits so much more complicated.\n\nBecause so many people would remain in private insurance plans, some of those with serious medical problems would have trouble getting treatment because they would have to overcome private insurance refusals to cover certain therapies.\n\nAnd unlike the leading Medicare for All proposals, including not just the Sanders bill but also a House version from Rep. Pramila Jayapal (D-Wash.), the Buttigieg plan would leave many policyholders on the hook for premiums and out-of-pocket costs, sometimes hefty ones.\n\nThe Buttigieg plan lacks one other key element of Medicare for All. It does not envision the government dictating uniform prices to doctors, hospitals and other providers of care, nor does it envision setting an overall budget for total U.S. spending on medical care.\n\nThese sorts of price controls and global budgets are what allow systems abroad to control health care costs so much more effectively than the U.S. does, and they are why, on paper, Medicare for All could save so much money. But critics have warned that setting prices and then setting them too low could force doctors and hospitals to reduce capacity, causing shortages of care.\n\nAnd like so many other elements of health reform, any serious effort at capping payments to providers faces serious opposition from those providers’ lobbying groups.\n\nAlthough Buttigieg has said he supports regulation, his plan calls for a much milder form. It would simply set a ceiling on what doctors, hospitals and other providers can charge when they haven’t successfully negotiated with insurers to be part of their networks.\n\nThat level would be twice what the traditional Medicare program currently pays, according to the plan. At that level, Buttigieg advisers said, doctors and hospitals couldn’t charge as much to privately insured patients as they do today. They also wouldn’t be able to hit patients with “surprise bills” for out-of-network medical care, an issue making headlines lately.\n\nSpeaking of Medicare, Buttigieg would also bolster traditional Medicare by limiting out-of-pocket expenses for people now on the program. The lack of such a limit, which private policies now have, causes hardship for some seniors on the program.\n\nThe Buttigieg plan has a lot in common with a proposal from the Urban Institute, a well-respected, left-leaning think tank in Washington, that its researchers said would require about $1.2 trillion in new federal spending over 10 years (though some of that would be offset by lower state government spending).\n\nThe Buttigieg campaign did not provide a detailed cost estimate for its own plan, but an adviser told HuffPost that Buttigieg would finance the program through a combination of corporate tax reform and, as time wore on, savings from a more efficient health care system.", "description": "It's not Medicare for All. But Buttigieg's proposal would also make a big difference to a lot of people.", "authors": ["Senior National Correspondent"], "top_image": "https://img.huffingtonpost.com/asset/5d82c7b223000058055717a8.jpeg?cache=vrftigpfhq&ops=1778_1000", "published_at": "2019-09-19"}