{"pub": "thenextweb", "url": "https://thenextweb.com/plugged/2019/10/17/psa-the-pixel-4-comes-with-neither-earbuds-nor-dongle", "downloaded_at": "2019-10-18 04:49:59.135861+00:00", "title": "PSA: The Pixel 4 comes with neither earbuds nor dongle", "language": "en", "text": "When Google revealed the Pixel 4 would start $799, I was surprised the company hadn’t raised prices over the previous year. But now we know it’s cutting corners in at least one way: the Pixel 4 doesn’t come with earbuds or a wired headphone dongle. The company is sending a clear message: Go wireless.\n\nThis is a bit of a shame. I actually thought Google’s USB-C buds were quite good – certainly the best I’ve heard among bundled earbuds that aren’t meant to create an acoustic seal. Their omission is an especially odd choice considering you can’t even buy the new true wireless Pixel Buds until spring of 2020. You’ll have to wait a while if you want the full Google experience.\n\nYou can definitely get better-sounding headphones for a similar price, but nothing I’m aware of with such deep Google Assistant integration. It’s still a great option if you want decent sound quality, a comfortable fit, ambient awareness, and quick, reliable interactions with the Google Assistant. It can do almost anything the fancier wireless Pixel Buds or other Assistant-enabled headphones can.\n\nThe USB-C to 3.5mm dongle will set you back $12, and you can still buy Google’s USB-C buds for 30 bucks. Or you know, find them for half that price on eBay.\n\nFor more gear, gadget, and hardware news and reviews, follow Plugged on Twitter and Flipboard.", "description": "", "authors": ["Napier Lopez", "October"], "top_image": "https://img-cdn.tnwcdn.com/image/plugged?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2018%2F10%2FGoogle-USB-C-Pixel-Buds-1-of-1.jpg&signature=7bfd4b0cb40ec509ee43d9879524dba9", "published_at": "2019-10-17"}