{"pub": "reuters", "url": "https://af.reuters.com/article/topNews/idAFKCN1VP0OP-OZATP", "downloaded_at": "2019-09-04 08:06:34.593535+00:00", "published_at": "2019-09-04", "title": "Pope heads to Mozambique to help consolidate peace", "language": "en", "text": "VATICAN CITY (Reuters) - Pope Francis heads to Mozambique on Wednesday to encourage the country’s fragile peace, starting a three-nation African tour where climate change, poverty and corruption will also be high on the agenda.\n\nPope Francis waves as he departs Fiumicino Airport to begin his visit to the African nations of Mozambique, Madagascar and Mauritius, in Rome, Italy September 4, 2019. REUTERS/Remo Casilli\n\nThe former Portuguese colony emerged from 15 years of civil war in 1992 but it was only last month that President Filipe Nyusi of the ruling Frelimo party and the leader of the Renamo opposition, Ossufo Momade, signed a permanent ceasefire.\n\nWith elections scheduled for October, some fear violence may break out.\n\n“He is coming at a time when we Mozambicans are trying to consolidate peace,” said Manuela Muianga, a biologist and disaster relief manager in the capital, Maputo.\n\n“We Catholics feel that he is a visionary man who can help Mozambique to strengthen hope and make us forget all those things that make us fight against each other. The biggest concern is the fighting between the two parties. I’m sure he will address this,” she said.\n\nFrancis, who is expected to talk about peace when he meets Mozambique’s leaders on Thursday, mentioned his concern in a video message to the country ahead of the seven-day trip, which will also take him to Madagascar and Mauritius.\n\n“I think he is going to give a forceful message to the country’s leaders about their responsibility to bring about peace and reconciliation, but also about addressing the root causes of the conflict,” said Erica Dahl-Bredine, Mozambique country representative for Catholic Relief Services.\n\nClimate change is expected to be a topic in Mozambique and Madagascar. Deforestation, along with soil erosion, made Mozambique more vulnerable when two cyclones hit the country this year.\n\nFrancis, making his second trip to sub-Saharan Africa, will not be able to visit the city of Beira because of the devastation.\n\nAccording to the World Bank, Mozambique has lost 8 million hectares of forest, about the size of Portugal, since the 1970s.\n\nAides say the trip is a key opportunity for the pope to renew appeals enshrined in his 2015 encyclical “Laudato Si” on environmental protection.\n\n“CLIMATE EMERGENCY”\n\nFrancis challenged governments on Sunday to take “drastic measures” to combat global warming and reduce the use of fossil fuels, saying the world was experiencing a climate emergency.[nL5N25S07P]\n\nIn Madagascar, the world’s fourth-largest island, about 44% of forests have disappeared over the past 60 years, according to the French agricultural research centre CIRAD. The environmental danger there is aggravated because 80% of its plant and animal species are not found anywhere else.\n\nPoverty and corruption will also loom large.\n\nAccording to the U.N. World Food Programme (WFP), 80% of Mozambique’s population of about 30 million cannot afford the minimum costs for an adequate diet.\n\nThe WFP says more than 90% of Madagascar’s population of 26 million live on less than $2 a day and that chronic child malnutrition is widespread.\n\nFrancis has called for a fairer distribution of wealth between prosperous and developing countries, and defended the right of countries to control their mineral resources.\n\nHe has branded corruption “one of the most decimating plagues” in society.\n\nMozambique and Madagascar rank in the lowest quarter of Transparency International’s Corruption Perceptions Index.\n\n“Corruption is huge. Many Mozambicans have lost faith completely in their political leaders,” said Dahl-Bredine.\n\nFrancis makes an eight-hour stop in Mauritius, a small island in the Indian Ocean that is relatively rich compared Madagascar and Mozambique.\n\nBut anti-poverty campaigners say Mauritius’ tax treaties and financial services industry facilitate tax avoidance, draining desperately-needed revenues from poor countries.", "description": "Pope Francis heads to Mozambique on Wednesday to encourage the country's fragile peace, starting a three-nation African tour where climate change, poverty and corruption will also be high on the agenda.", "authors": ["Philip Pullella", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190904&t=2&i=1426055354&w=1200&r=LYNXNPEF830JF-OZATP"}