{"pub": "afr", "url": "https://afr.com/companies/energy/interventions-push-up-power-bills-engie-20191010-p52zbk", "downloaded_at": "2019-10-10 03:14:20.638392+00:00", "title": "Interventions push up power bills: Engie", "language": "en", "text": "'\"These will be locked into customers’ bills for decades and may not actually\n\nsatisfy their needs into the future.\"\n\nHe declined to be specific about which of the ''ad-hoc interventions'' were the most problematic, with industry players suspecting that one of those he was referring to is the $5 billion-plus Snowy Hydro 2.0 project.\n\n\"I'm not pointing my finger to such and such,'' he said. \"I'm not pointing at any specific intervention.\"\n\nMr Honorat has been head of the Australasian operations of Engie for 12 months, and before that was chief executive officer of an Engie retail and gas business in France.\n\nWholesale power prices surged after Engie shut down the 1600-megawatt Hazelwood power station in 2017 in Victoria in a staged exit from coal-fired assets in line with a global strategy. The Hazelwood shutdown removed about a quarter of Victoria's baseload supply.\n\nEngie then sold its other big coal-fired power plant, offloading its Loy Yang B coal generator to Chinese-owned Alinta Energy for a bigger-than-expected price of $1.2 billion.\n\nEngie operates the Pelican Point gas-fired generator about 20 kilometres from the Adelaide CBD and has been aggressively stepping up its renewable energy projects.\n\nThey include the 119-megawatt Willogoleche wind farm in South Australia's mid-north, which will be used to support growth at Engie's Simply Energy retail arm.\n\nAdvertisement\n\nMr Honorat said Engie had invested $5 billion into Australia in the past few years and wanted to keep investing, but market interventions by government were making it more fraught.\n\n\"We want to continue to do that but we need to have that stable framework,'' he said.\n\nAsked if he had any advice for AGL as it faced pressure to keep open the ageing coal-fired Liddell power station in NSW, Mr Honorat was circumspect.\n\n\"I'm not sure I have any advice for anyone,'' he said.\n\nHe said risks around technology shifts in the energy sector were best handled by the private operators.\n\n\"Technology risks should be handled by the private sector''.\n\nMr Honorat said governments investing taxpayer capital on energy projects should be approached with \"great caution\".\n\nHe said the private sector was in the best position to choose the most efficient projects, and secure finance from a range of domestic and international debt and equity sources.\n\nAdvertisement\n\n\"Private participants will build new generation in markets where the investment case stacks up, and where policy risk is stable,'' he said.\n\nThis would leave governments to use taxpayers funds on roads, schools and hospitals rather than energy projects that would lead to the impairment of existing energy assets.", "description": "The CEO of the French-owned energy group has warned that an increasing amount of ''ad-hoc'' intervention by the federal government is a bad sign for investors.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2648%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_53/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/dbd23b0abc87a2e146cefc556c2db53701810f7e", "published_at": "2019-10-10"}