{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/16/cancer-cures-wont-reach-patients-if-pelosis-drug-b", "downloaded_at": "2019-10-16 21:06:16.721541+00:00", "title": "Cancer cures won't reach patients if Pelosi's drug bill passes", "language": "en", "text": "ANALYSIS/OPINION:\n\nHouse Democrats recently unveiled H.R. 3, a sweeping proposal that would impose a slew of ill-considered price controls on prescription drugs — and a virtual death knell on innovation\n\nNot surprisingly, patient advocates immediately panned the bill, warning that it would deter medical research and thus prevent scientists from developing future treatments and cures. Let’s call H.R. 3 the Kill Innovation Act — because promising new medicines would be KIA.\n\nThe patients are right — but they’re actually understating the bill’s harmful effects. The legislation could stifle ongoing “post-approval” research into existing treatments that are already on the market. It would prevent scientists from refining current drug formulas to make them safer or testing these medicines in broader patient populations.\n\nIn other words, cures for certain types of cancer, autoimmune diseases, and other chronic conditions may already exist — but they won’t reach patients if H.R. 3 becomes law.\n\nConsider how the drug development process actually works. When scientists discover a promising compound, they conduct years of lab tests, computer models, and animal studies. The vast majority of potential medicines fail in this pre-clinical trial phase — only one in 1,000 compounds shows enough promise to merit further testing in humans.\n\nScientists typically conduct “phase I” clinical trials on healthy humans to confirm an experimental medicine’s safety. If the compound proves broadly safe, scientists move on to “phase II” trials in dozens or hundreds of sick patients. Even though the odds are heavily againt them, occasionally, the FDA approves medicines on an expedited basis after phase II trials.\n\nMore typically, the FDA requires researchers to prove a drug’s safety and efficacy in randomized, double-blind “phase III” trials, which usually involve hundreds or thousands of sick patients. Drug companies then submit their testing data to the FDA for review.\n\nThis research and development process often takes a decade or more and it’s fraught with failure. Only 12 percent of experimental medicines that enter phase I trials ultimately win FDA approval. After accounting for this high failure rate, it costs companies $2.6 billion, on average, to bring a single new medicine to market.\n\nMany people think the research process ends there — but it doesn’t. Companies often conduct extensive post-approval, or “phase IV,” trials to monitor patients for long term side effects.\n\nInnovators also test whether their FDA-approved medicines can effectively treat other, related diseases. Consider the drug Lynparza, which the FDA initially approved in 2017 to treat certain types of ovarian, fallopian tube, and primary peritoneal cancers. The manufacturer conducted extensive post-approval research, which led to the FDA approving Lynparza for certain forms of breast cancer as well.\n\nPost-approval research also delivers new treatment options to broader patient populations. Consider Astagraf XL, which the FDA approved in 2013 to prevent kidney transplant rejections in adults. The company conducted additional testing — and last year, the agency approved the treatment for children too. A rare win for pediatric patients.\n\nFollow-on research isn’t cheap. It adds $300 million, on average, to the typical drug’s R&D cost, bringing the total figure up to $2.9 billion.\n\nH.R. 3 would discourage such research. The bill imposes steep penalties on any drug companies that raise a medicine’s price faster than inflation. In other words, the legislation would prevent companies from updating their prices — even if the new indication is highly valued by patients and the health care system.\n\nIf the House bill makes it harder to recoup the cost of follow-on research, companies won’t make those investments in the first place. Why bother looking for new uses if these post-approval discoveries won’t deliver a financial return?\n\nThe inflation penalty would chill medical innovation — which is reason enough to reject it out of hand. But what makes the policy even less defensible is that it would do nothing to reduce patients’ actual pharmacy bills. The proceeds from the inflation penalty would go directly into the government’s coffers.\n\nSimply put, patients would lose out on the valuable medical discoveries that only post-approval research can deliver, while deriving no benefits in return. That’s not what Americans had in mind when they demanded drug-pricing reform.\n\n• Peter J. Pitts, a former FDA associate commissioner, is president of the Center for Medicine in the Public Interest.\n\nSign up for Daily Opinion Newsletter Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "House Democrats recently unveiled H.R. 3, a sweeping proposal that would impose a slew of ill-considered price controls on prescription drugs -- and a virtual death knell on innovation", "authors": ["The Washington Times Http", "Peter J. Pitts"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/16/B3-PITT-Bat-Bulb-GG_c0-80-680-476_s1200x700.jpg?b0b38b5ae5104a3c81444b0a162936cfeda48e73", "published_at": "2019-10-16"}