{"pub": "washingtonpost", "url": "https://washingtonpost.com/news/voraciously/wp/2019/10/07/you-cant-go-wrong-with-potatoes-but-heres-how-to-pick-the-right-ones", "downloaded_at": "2019-10-07 20:00:50.197788+00:00", "title": "You can’t go wrong with potatoes, but here’s how to pick the right ones", "language": "en", "text": "It seems impossible to think of an ingredient that shows up in more places around the world in more variations than the potato. In terms of universal adoration, the potato might be as good as it gets.\n\n“The New Food Lover’s Companion” by Sharon Tyler Herbst and Ron Herbst proclaims: “Potatoes are probably the most versatile vegetable in the world and can be cooked in any way imaginable.”\n\nA world of potato possibilities! What a prospect indeed! The problem is, the sheer volume can feel almost paralyzing as you browse the varieties at the grocery store — and then you still have to decide what you’re going to make with them. I’ll dig into all their individual characteristics and uses soon enough (see what I did there?), but first a few general potato tips.\n\nBuying. A little dirt on your potatoes? That’s nothing a little scrubbing can’t take care of. Otherwise, potatoes you buy should be in pretty good shape: No cracks, blemishes, wrinkles, sprouts and green tinge, “Food Lover’s Companion” says. Avoid potatoes with bald spots, although new potatoes (potatoes of all types when they’re dug up young) might have spots where their thinner skins have been rubbed off.\n\n[Yes, you need to wash your produce. Here’s how.]\n\nStoring. Potatoes do best at cool room temperature, in dark and well-ventilated spots, for up to two weeks, according to Herbst and Herbst. New potatoes should be used within 3 days of purchase. Environments that are too warm can cause potatoes to sprout and shrivel, and too much light can turn them green. But don’t run the opposite direction and go for the fridge, either. Cold temperatures prompt the starches in most potatoes to turn into sugar, which can result in overly sweet and dark results when cooked. New potatoes can be refrigerated.\n\nPrep. Invest in — by which I mean spend a few bucks on — a sturdy brush for scrubbing the potatoes, which you should do under cool running water. Pat dry with a clean towel. If there are any sprouts or areas of slight green tinge (in large amounts, the chemical that causes the greening, solanine, is bitter and can make you sick), cut them off. Cut potatoes can oxidize and turn brown or pink when exposed to air, which won’t affect the flavor or appearance when cooked. If the discoloring bothers you, drop the pieces in a bowl of cold water.\n\nNow let’s get into specifics. Potatoes come in a large variety of shapes, sizes and colors. (Sweet potatoes are too much of a different beast, so we’ll leave them for a future guide.) Ultimately, all those things are less important than the amount of starch. In “The Food Lab: Better Home Cooking Through Science,” J. Kenji López-Alt breaks potatoes down into three categories: high-, medium- and low-starch. High-starch potatoes (often described as mealy) will generally give you fluffy, tender results and are more prone to breaking down while cooking. They can get very crispy. Low-starch, or waxy, varieties hold their shape much better and cook up denser and creamier, but not as crispy. Here’s a rundown based on the categories of potatoes described by Potatoes USA, the marketing and research organization for American spuds, as well as recipe suggestions.\n\nRussets. The standard-bearer high-starch, low moisture potato, you know these from your typical baked potato. Russets are great for light and fluffy mashed potatoes. They crisp well in french fries, roasted pieces, hash and latkes. López-Alt likes them for a creamy potato salad, as they absorb dressing well.\n\n\n\n(Stacy Zarin Goldberg for The Washington Post)\n\nRECIPE: Essential Mashed Potatoes\n\nYellow. Most famous are the Yukon golds, although you could also come across Yellow Finns and Bintje. “Basically all-purpose potatoes,” says Deborah Madison in “The New Vegetarian Cooking for Everyone.” These medium-starch specimens give you creamy mashed potatoes, and I like how they break down a little bit in potato salad but still hold their shape. Potatoes USA recommends grilling them, too.\n\n\n\n(Stacy Zarin Goldberg for The Washington Post; food styling by Amanda Soto/The Washington Post)\n\nRECIPE: Mustard and Dill Potato Salad\n\nWhite. Specific varieties of this medium-starch potato include White Rose, Kennebec and Cascade. Treat them similarly to yellow potatoes. Potatoes USA suggests using them mashed, noting that their thin skins can add texture to the dish. The group also recommends grilling and frying them.\n\n\n\n(Deb Lindsey for The Washington Post; tableware from Crate and Barrel)\n\nRECIPE: Pesto Cauliflower and Potato Salad\n\nBlue and purple. They’re pretty easy to pick out, of course, though you might see specifics such as Purple Peruvian, Purple Majesty and Adirondack Blue. Potatoes USA describes them as “earthy and nutty,” made for pairing with salad greens or folding into potato salad. The group says microwaving purple or blue potatoes best preserves the color. They generally fall into the medium-starch class. In “One Potato Two Potato,” Roy Finamore and Molly Stevens recommend taking advantage of the moist, waxy flesh in roasting, boiling and for particularly eye-catching mashing.\n\nRECIPE: Fish in Wine Sauce With Potatoes\n\nRed. You’ve probably heard of Red Bliss. Other types include Chieftain and Norland. These low-starch options are extraordinarily difficult to break down, so stay away from mashing them. That very characteristic means red potatoes are perfect for using in situations where you need them to retain their shape, including in soups, stews or potato salad. They can be boiled or steamed, too.\n\n\n\n(Deb Lindsey for The Washington Post)\n\nRECIPE: One-Skillet Sausage and Potato Hash\n\nFingerling. They can come in a variety of sizes and colors, but treat them as you would other low-starch, waxy potatoes. Madison likes them in salads, gratins and stews. They’re naturally an attractive side dish when roasted or grilled.\n\n\n\n(Scott Suchman for The Washington Post)\n\nRECIPE: Grilled Fingerling Potatoes\n\nPetite. These are smaller versions of some of the varieties above. Tiny gold potatoes are easy to find, and they’re great roasted and eaten whole.\n\nMore from Voraciously:\n\nIt doesn’t take hours to make an intense, dark and rich French onion soup\n\nHow to make a better bowl of guacamole\n\nGrab a spoon. It’s time to make sense of the yogurt aisle.\n\nHow to pick, prep and cook leafy greens — a nutritional (and delicious) powerhouse", "description": "All potatoes are good, though some are better for certain dishes than others.", "authors": ["Becky Krystal", "Reporter Covering Topics Related To Food", "October At Am", "Becky Krystal Is A Food Reporter", "The Lead Writer For Voraciously. After Several Years As A General Assignment Reporter In Virginia S Shenandoah Valley", "She Came To The Washington Post In To Work For Tv Week", "Sunday Source. Her Time At The Post Also Includes A Five-Year Stint In The Travel Section."], "top_image": "https://www.washingtonpost.com/resizer/e3vmcdBhswr7tCd1Kk3J1IA34to=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NLLHPDHNRY5OXN6QODS3PBITEY.jpg", "published_at": "2019-10-07"}