{"pub": "fox", "url": "https://foxbusiness.com/healthcare/donald-trump-vaping-e-cig-meeting", "downloaded_at": "2019-09-13 00:57:32.202401+00:00", "published_at": "2019-09-11", "title": "Trump warns against 'very dangerous' e-cigarettes as White House cracks down on flavors", "language": "en", "text": "The Trump administration will roll out new rules banning thousands of e-cigarette flavors in the next several weeks, officials said Wednesday, as President Trump called vaping \"very dangerous.\"\n\nContinue Reading Below\n\nU.S. health officials are urging people to avoid e-cigarettes while the CDC investigates 450 cases of lung illness and six deaths that may be linked to chemical exposure while vaping.\n\n\"We are looking at vaping very strongly,\" Trump said in the Oval Office. \"It's very dangerous. Children have died, people have died. ... We're going to have some very strong rules, regulations, and more important I think we're going to have some very important information come out very shortly. And we'll be reporting that over the next couple of weeks.\"\n\nHealth and Human Services Secretary Alex Azar and acting Food and Drug Administration Commissioner Ned Sharpless said the FDA would consider menthol as \"flavored.\"\n\nThe public will have a chance to weigh in on the proposed restrictions before they go into effect.\n\n\"They've become very rich companies very fast,\" Trump said. \"The whole with vaping has been very profitable. ... But we can't allow people to get sick, and we can't have our youth be so affected.\"\n\n\"A lot of people thing vaping is wonderful, it's great. It's really not wonderful,\" he continued. \"It's got big problems.\"\n\nFormer New York City Mayor Michael Bloomberg introduced a $160 million campaign to end the use of e-cigarettes by teenagers on Tuesday.\n\nThe Food and Drug Administration warned top e-cigarette maker Juul about making claims that its products were a safer alternative to smoking, ordering the company to stop making unproven claims for its products.\n\n\"The law is clear that, before marketing tobacco products for reduced risk, companies must demonstrate with scientific evidence that their specific product does in fact pose less risk or is less harmful,\" acting FDA Commissioner Ned Sharpless said in a statement. \"JUUL has ignored the law, and very concerningly, has made some of these statements in school to our nation's youth.\"\n\nVaping has become especially popular among young people. In 2018, about 3.5 million kids admitted to using a vape product, and the CDC is conducting a youth usage survey to get more up-to-date data.\n\nAccording to reports compiled by Prescient & Strategic Intelligence, it’s a billion-dollar industry that has some youth admitting to spending close to $1,000 a year to indulge. Worldwide, the market accounts for $11.5 billion in revenue.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nFOX Business' Elizabeth McKernan contributed to this report.", "description": "The White House met to discuss proposals to respond to e-cigarette deaths across the country.", "authors": ["Evie Fordham"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/AP19250703424699.jpg?ve=1&tl=1"}