{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-global-markets-q3/global-stocks-stalled-in-third-quarter-as-bonds-boom-and-dollar-zooms-idUKKBN1WF1W8", "downloaded_at": "2019-10-01 09:27:29.647297+00:00", "title": "Global stocks stalled in third quarter as bonds boom and dollar zooms", "language": "en", "text": "LONDON (Reuters) - It has been a pivotal few months for financial markets. China and Europe have halted the global stocks rally, oil has cooled dramatically and rising recession worries have sent gold and government bonds charging again.\n\nPerhaps it was to be expected after such a flying start to the year, but the deterioration in risk appetite has included some eye-catching milestones.\n\nThe switch back into support mode by the top global central banks has swollen the amount of bonds trading at negative rates — where investors pay rather than get paid to lend - to a record $17 trillion.\n\nOver 3.5% returns on U.S. Treasuries following the first Federal Reserve rate cuts since the financial crisis mean they are now having their best year since 2011 while calmer politics and ECB stimulus have given Italian bond markets their best quarter since Mario Draghi’s 2012 “whatever it takes” vow.\n\n“The shear size of the (bond) rally was quite impressive,” said Hans Peterson, global head of asset allocation at SEB Investment Management. “And quite surprising,” he added considering how low bond yields were already.\n\nThere has been much more divergence in equity and foreign exchange markets.\n\nOn one hand, Wall Street's S&P 500 has added another 1% to its 19% H1 surge .SPX, Japan's Nikkei is up 2.4% .N225 and Turkey's battered stock market has bounced back almost 12% after torrid last 18 months. .XU100\n\nIn the drop zone though, Hong Kong’s protests saw the Hang Seng .HKI lose 9% in its worst quarter in four years and plenty of emerging markets from South Africa to Saudi Arabia have buckled badly too.\n\nMSCI’s all country world index .MIWD00000PUS, which now tracks around 2,700 stocks in 49 countries is set for its first quarterly dip of the year but a near 2% rebound this month has limited the damage to a modest 0.5%.\n\nA weaker yuan CNH= means China's big bourses are down as well in dollar terms despite Beijing's stimulus efforts in the face of the trade war. But then again so too are London .FTSE, Frankfurt .GDAXI and Paris .FCHI in Europe.\n\nThe dollar is up over 3% against a basket of top global currencies but sterling’s additional Brexit worries mean it is down a bit more and the euro is more than 4% lower after the ECB’s cut its interest into even more negative territory.\n\nFor a graphic on Global markets third quarter and year-to-date:\n\nhere\n\nDOLLAR CHARGE\n\nIt's been the worst quarter for the Australian dollar, meanwhile, since the end of 2016 as its China-sensitive economy has spluttered while 6.5% has been lopped off its Antipodean cousin, the New Zealand dollar NZD=D4 AUD=D4.\n\n“The U.S. dollar has been very strong really against everything,” explained head of currencies at State Street Global Advisors, James Binny, citing global factors like the trade war.\n\n“It is getting to the point where it is quite expensive. As with anything it is difficult to pick the turning point, but it’s like a stretched rubber band — the more you stretch it the stronger the forces that bring it back.”\n\nAmong commodities there has been a big split too, but there it has been between what’s precious and what’s not.\n\nSafe-haven gold is up 4.5% XAU= and is now on its longest quarterly winning streak since 2011 having been rising since Q4 2018. Equally precious palladium XPD= meanwhile is up for a sixth straight quarter - its best run since 2000.\n\nIndustrial bellwether and China proxy copper MCU3=LX is at the other end of the spectrum. The red metal is down for a sixth quarter in the last seven. It has been black for oil too - it is down over 8% though that is after a 25% surge in the first half of the year.\n\nIn cyberspace Bitcoin is down 22% which might sound calamitous. But it was up 220% in H1.\n\nWhat is perhaps more telling for the overall picture is that FANG stocks, which have been one of the big driving forces for equity markets in recent years, have struggled to make more than 1% this quarter as a set.\n\nFacebook (FB.O) and Amazon (AMZN.O) are both down over 8%, Apple (AAPL.O) and Google (GOOGL.O) are both up over 10%, but streaming giant Netflix (NFLX.O) is down a hefty 27% having been up 38% for the year going into Q3.\n\n“The trend driver right now is the U.S.-China situation. That holds the levels and the direction for currencies now,” said SEB’s Peterson. “The tipping point will be if we get some real progress there.”\n\nFor a graphic on Emerging market stocks suffer in third quarter:\n\nhere\n\nFor a graphic on Global FX markets in 2019:\n\nhere", "description": "It has been a pivotal few months for financial markets. China and Europe have halted the global stocks rally, oil has cooled dramatically and rising recession worries have sent gold and government bonds charging again.", "authors": ["Marc Jones", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-01"}