{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/04/redskins-name-colt-mccoy-starter-quarterback-against-new-england", "downloaded_at": "2019-10-04 23:44:44.688895+00:00", "title": "Redskins name Colt McCoy the starter at quarterback against New England", "language": "en", "text": "\n\nColt McCoy, shown here at training camp, has won the team's starting quarterback job for Sunday's game against New England. (John McDonnell/The Washington Post)\n\nAfter several days of vague comments, secret hints and subterfuge, Redskins Coach Jay Gruden finally walked to an interview lectern at the team’s practice facility Friday and named a starting quarterback for Sunday’s game against the New England Patriots.\n\nIt will be Colt McCoy.\n\nHe was probably the quarterback Gruden wanted to pick all along, something he essentially admitted when he made the announcement.\n\n“Yeah I decided a long time ago, we’re starting Colt and we’ll go from there,” he said.\n\n[The Redskins are on the verge of a lost season. So what do they do with Dwayne Haskins?]\n\nThe move is not a surprise. Gruden has long had a fondness for the player who has been the team’s backup for most of the five-plus years that Gruden has been Washington’s coach. McCoy knows Gruden’s offense, understands the way Gruden thinks and is well-liked in the locker room. Gruden has kept him on the team because he served as a reliable backup to Kirk Cousins and later Alex Smith. With the Redskins 0-4 and going against the Super Bowl champions with Gruden’s job in jeopardy, McCoy is the quarterback Gruden is most comfortable playing.\n\nWhen Smith broke his leg last November, McCoy only lasted for parts of three games until he, too, went down with a broken leg in a Dec. 3 loss at Philadelphia. McCoy’s leg was supposed to have healed by the time the team started offseason workouts but complications from the original surgery led to three more surgeries this past winter, sidelining him until training camp.\n\nStill, McCoy all but won the starting job in the first two weeks of camp, before lingering pain in his surgically-repaired leg forced him to miss the next eight weeks, a fact Gruden conceded on Friday when he said: “Well, it’s his job to lose for sure.”\n\nGruden named Case Keenum the starter before the season, in large part because the 31-year-old had NFL starting experience and was well ahead of first-round draft pick Dwayne Haskins, who started only one year at Ohio State. While Keenum has thrown for 970 yards this season, he has missed several open touchdowns that could have changed the tone of at least three of the four Redskins’ losses. He sprained his foot in a Week 3 loss to Chicago and has been forced to miss some practices since.\n\nGruden replaced Keenum with Haskins in the second quarter of Sunday’s 24-3 loss to the New York Giants. After Haskins was intercepted three times, Gruden took the rare step of announcing a three-man competition for the starting job this week, knowing McCoy would be able to participate in full practices. But even as Gruden said the three would battle, he hinted that he had already made up his mind. Given the numerous references he made to wanting to see how McCoy came out of each practice, the ultimate choice of McCoy seemed likely, especially with McCoy’s familiarity with Gruden’s offense.\n\n[Redskins’ offense will be without Brandon Scherff, Vernon Davis, Jordan Reed against Patriots]\n\n“It means a lot,” Gruden said when asked how much McCoy’s knowledge of the team’s system played in Friday’s decision. “Any coach will tell you that. It’s very important for a quarterback to know your system; otherwise you have to change your system. … I think all three of the quarterbacks know the system, but Colt has the most experience in it. He’s very comfortable with it. But we’ll see. This will be a great test for him; he hasn’t faced a live rush since Philadelphia last year. I think that will be the biggest test for him.”\n\nMcCoy, 33, was a star at the University of Texas and has shown flashes of being a good NFL quarterback, but most of his chances in Cleveland and later with the Redskins have been cut short by injuries. Last year, he completed 34 of 54 passes (63.0 percent) for 372 yards with three touchdowns and three interceptions before he broke his leg.\n\n“I haven’t gotten a lot of time with them outside of Paul [Richardson Jr.] and Trey [Quinn], really,” McCoy said this week, speaking of the team’s receivers. “So the more I can work with those guys, the more confidence I’ll have. … Training camp, although it started out well, it went downhill real fast. I think everyone still has some visions of that, especially me. More than anything, it’s just time and figuring out how I’m moving around, how I’m throwing the ball. It’s my plant leg. So far, it’s felt good.”\n\nGruden would not name a backup for Sunday, setting up what could be a potentially awkward situation in which either the season’s starter, Keenum, or the future starter, Haskins, might not dress.\n\nMore Redskins coverage:\n\nThe Redskins would be a lot of fun if they were as good as Bill Belichick says they are\n\nFive Redskins bright spots on a humiliatingly bad team\n\n‘Coaching malpractice’: Analysts rip Jay Gruden for playing Dwayne Haskins against Giants", "description": "In selecting the veteran, Redskins Coach Jay Gruden was picking the starter he likely wanted all along this season.", "authors": ["Les Carpenter", "Reporter Covering Washington Redskins", "October At Pm", "Les Carpenter Returned To The Washington Post In", "Writes About The Washington Redskins."], "top_image": "https://www.washingtonpost.com/resizer/FBD0QiF3WvaTtgLPIRuh1ZezrpM=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2OGZDMVUUYI6TLGIDWCHXLGKOM.jpg", "published_at": "2019-10-04"}