{"pub": "cbc", "url": "https://cbc.ca/news/politics/canada-votes-2019-campaign-highlights-1.5320852", "downloaded_at": "2019-10-19 14:08:46.448498+00:00", "title": "Need to catch up before election day? Here are some highlights from the past 6 weeks | CBC News", "language": "en", "text": "Everyone always says, a lot can happen in an election campaign. This one has been no exception. Probably few, if any, voters ever would have imagined they'd be talking about whether Justin Trudeau is a racist or whether Andrew Scheer is American.\n\nBut a lot can happen in just under six weeks. If you need to get caught up before you cast your ballot, here are some of the highlights:\n\nTrudeau's brownface/blackface past — Sept 18\n\nThe first big story of the campaign broke on the evening of Sept. 18. Time Magazine published a photo of Justin Trudeau dressed as Aladdin — face painted a deep brown — from his teaching days in 2001. Before the end of the night, there were two photos.\n\nThe next day, there was a video, and then another photo from yet another event.\n\nTrudeau apologized the night the story broke and again the next day, but when pressed to confirm whether there were any more incidents, Trudeau said \"I am wary of being definitive about this.\"\n\nLiberal Leader Justin Trudeau apologizes while answering reporters' questions in Winnipeg about the emergence of images of him in blackface in Thursday. 21:50\n\nSingh hopes Trump is impeached — Sept 26\n\nDuring a campaign stop in Nanaimo, B.C., NDP Leader Jagmeet Singh was asked what he would say to Donald Trump if he were to become prime minister. Singh's reply: \"I hope he gets impeached before I get to speak to him.\"\n\nHe was the first federal leader to speak publicly about the impeachment hearings happening south of the border. And he doubled down the next day, telling a crowd in Victoria, \"I wasn't joking.\"\n\nSingh has been heavily critical of Trump and the U.S. government policy of separating migrant children from their parents at the border.\n\nWhen asked how his words might impact Canada-U.S. relations, he said, \"Canadians expect to have someone who's going to stand up to Mr. Trump.\"\n\nNDP Leader Jagmeet Singh joked that he hopes Donald Trump \"gets impeached.\" 1:08\n\nNDP Leader Jagmeet Singh told a Victoria crowd Friday that he wasn't joking earlier in the week when he said he hopes U.S. President Donald Trump is impeached. 0:12\n\nScheer's pre-politics experience questioned — Sept. 28\n\nThe Liberals demanded an investigation after a Globe and Mail report raised questions about whether Andrew Scheer was overstating his experience as an insurance broker. It reported that there appeared to be no evidence he had ever attained the proper accreditation needed to be a licensed broker.\n\nScheer maintained he received the accreditation, but left the business before the licensing process was finalized.\n\nLiberal MP Marco Mendocino wrote to the Financial and Consumer Affairs Authority of Saskatchewan and the Insurance Councils of Saskatchewan urging them \"to investigate immediately and take appropriate action.\"\n\nScheer was forced to field questions about what exactly he did in the insurance office where he worked for what he said was roughly \"six or seven months.\"\n\nConservative Leader Andrew Scheer faced more questions Monday over his credentials as an insurance broker. Scheer told reporters in Toronto Monday he worked at a firm for \"six or seven months,\" mostly doing clerical work but that \"the licensed brokers finalized all the transactions.\" 1:07\n\nProtest at Bernier event turns ugly — Sept 29\n\nA protest outside of an event featuring People's Party Leader Maxime Bernier turned violent. A row of protesters shouted \"Nazi scum, off our street\" as an elderly couple tried to enter the Hamilton, Ont. venue.\n\nProtesters attempting to prevent people from entering an event for People's Party Leader Maxime Bernier block the path of an elderly woman, yelling at her and her companion. 0:24\n\nDorothy Marston, 81, later told CBC News she and her husband wanted to learn more about the PPC because they felt Bernier was \"being ignored.\"\n\nShe said she was aware that Bernier's comments on immigration have upset people, but said she also has questions about who should be able to come to Canada. She says, in her opinion, immigration has been largely positive, but \"maybe we shouldn't open the floodgates.\"\n\n\"I look at the Middle East and it frightens me, because there's no democracy … and the fighting in Syria and the values are different than ours,\" she said.\n\nAfter Marston's son posted his mother talking about free speech on Twitter, Bernier responded with a tweet.\n\nThank you so much Madam for standing up for free speech! <br><br>We need courageous people like you if we are to keep our country STRONG and FREE. <a href=\"https://t.co/Z672PFnAFc\">https://t.co/Z672PFnAFc</a> —@MaximeBernier\n\nSingh turban moment — Oct 2\n\nWhile campaigning in Montreal ahead of the first French-language debate, Singh was approached by a man who leaned in and quietly told the NDP leader to \"cut off his turban\" so that he would look more Canadian.\n\nA man in Montreal told NDP Leader Jagmeet Singh he would 'look like a Canadian' if he removed his turban. After shaking hands the man said he hopes Singh wins. 0:27\n\nThe encounter happened in the province that prohibits the wearing of religious symbols by public servants, a law Singh has said an NDP government would not challenge in court. About 65 to 70 per cent of Quebecers say they support the law.\n\nHe later told reporters, \"I'm hoping that by being in Quebec and saying, 'Hey listen, I got a turban and a beard and I'm out here talking about loving the language, fighting against climate crisis, investing in people, investing in universal medication for all,' that people can see ... maybe it isn't a good idea to have divisive laws that discriminate [against] people based on the way they look,\" said Singh.\n\nScheer's U.S. citizenship — Oct 3\n\nDespite Andrew Scheer's assertion that \"Everyone who knows me or knows my family knows that my father was born in the United States,\" a good many Canadians probably only learned that fact during the third week of the campaign.\n\nIt may not have been a big deal had Scheer himself not raised concerns himself about the dual citizenship of former governor general Michaëlle Jean, who had both French and Canadian citizenship when she was named to the post.\n\n\"I have a few quick questions for anyone who thinks that Michaëlle Jean is a good choice to be our next GG,\" Scheer wrote in a 2005 blog post. \"Does it bother you that she is a dual citizen (France and Canada)? Would it bother you if instead of French citizenship, she held U.S. citizenship?\"\n\nJean renounced her French citizenship before being sworn in.\n\nScheer was also part of the Harper government when it attacked former Liberal leader Stéphane Dion and former NDP leader Tom Mulcair, accusing them of having divided loyalties as both had dual Canadian and French citizenship while holding public office.\n\nScheer says he started the process of giving up his American citizenship in August.\n\n\"I was born in Canada...I grew up my whole life in Canada,” Conservative Leader Andrew Scheer told reporters asking about his Canada-U.S. dual citizenship. He was also asked about a blog where he raised questions about Michaëlle Jean’s dual citizenship years ago. 3:17\n\nQuebec's law on secularism\n\nPeople attend a demonstration to protest against the Quebec government's secularism legislation in Montreal June 17. (Graham Hughes/The Canadian Press )\n\nDespite ibeing provincial legislation, Quebec's new law banning some provincial civil servants from wearing religious symbols (formerly Bill 21) became a major talking — and arguing — point of the federal campaign. The bill became law in June. It faces a constitutional challenge by groups which argue parts of it force people to give up their identities. A second legal challenge was filed in September which argues the law violates constitutional protections of gender equality and religious freedom.\n\nAll of the federal leaders were grilled on the campaign trail about what they would do about the law and all said they would not intervene in the current court challenges. Bloc Québécois Leader Yves-François Blanchet basically told them that they should butt out of the entire discussion about it.\n\nBut that was difficult, especially for NDP Leader Jagmeet Singh. Many wondered how a man who wears a turban could not intervene. Singh told CBC's The Current that he would rather work on \"changing hearts and minds\" in Quebec, arguing that simply getting rid of a law that 70 per cent of the population supports will not solve anything.\n\nThe Bloc and NDP get a boost\n\nBloc leader Yves-François Blanchet spars with NDP leader Jagmeet Singh during the English-language leaders' debate in Gatineau, Que., Oct. 7. (Justin Tang/Canadian Press)\n\nAnyone who thinks debates don't matter would be wrong this time around.\n\nThe debates actually managed to move national polling numbers which had remained pretty static through the first few weeks of the campaign. The Bloc started to eat into the Liberals' support in Quebec, while the NDP surged by two percentage points with just one week to go before the vote. CBC Poll Tracker, Éric Grenier broke it all down here.\n\nAnd it's perhaps why the word \"coalition\" was suddenly on so many leaders' tongues.", "description": "It may have started off slowly, but as with any campaign, there were plenty of highlights (or lowlights, depending on your point of view).", "authors": [], "top_image": "https://i.cbc.ca/1.5300761.1569615630!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/federal-party-leaders-composite.jpg", "published_at": "2019-10-19"}