{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7626137/Nicki-Minaj-showcases-curves-Harley-Quinn-costume-Kenneth-Zoo-Petty-Joker.html", "downloaded_at": "2019-10-29 15:16:41.277077+00:00", "title": "Nicki Minaj showcases her curves in Harley Quinn costume while Kenneth 'Zoo' Petty is the Joker", "language": "en", "text": "She tied the knot with convicted sex offender Kenneth 'Zoo' Petty on October 21, 2019.\n\nAnd one week later, Nicki Minaj shared a series of snaps while she showed off her Harley Quinn costume alongside her husband - who dressed up as the Joker.\n\nThe 36-year-old rapper flaunted her pert derriere and her ample cleavage in a skintight top with tiny booty shorts while rocking the eye-catching costume.\n\nStrike a pose: Nicki Minaj shared a series of snaps while she showed off her Harley Quinn costume alongside her husband - who dressed up as the Joker\n\nNicki, who was born Onika Tanya Maraj, flaunted her backside in the tiny bottoms that were half blue and half red.\n\nThe Grammy nominated rapper donned fishnet tights with black and white pointed heels.\n\nThe singer wore a blue, white and red crop top that read 'Daddys Lil Monster,' with a choker that read 'Queen' as she toted a baseball bat.\n\nNicki styled her blonde locks partly red and blue while rocking smoky eye makeup with dark red lipstick.\n\nWow: The 36-year-old rapper flaunted her pert derriere and her ample cleavage in a skintight top with tiny booty shorts while rocking the eye-catching costume\n\nHalloween: Nicki styled her blonde locks partly red and blue while rocking smoky eye makeup with dark red lipstick\n\nMeanwhile her husband Kenneth donned a red patent jacket without a shirt beneath it, adding black and white sweat bottoms that said 'sleaze' on the side.\n\nHe had his face painted as the joker with green hair.\n\nShe captioned the photos with: 'Heavy on the sleeeeeze!!!! #HarleyQueen & her love.'\n\nNicki revealed last week that she's married to the convicted sex offender; she shared a clip of cups that read Mrs. and Mr. - and two hats - with one saying Bride and one saying Groom.\n\nShe wrote Onika Tanya Maraj-Petty 10•21•19' as the caption to the items.\n\nAccording to TMZ, Nicki is planning a bigger ceremony set to follow on an unspecified date.\n\nDrink up: Minaj also showed off some Mr and Mrs coffee mugs in the short Instagram video\n\nHis and hers: The rapper confirmed her marriage with a video on Instagram last week that shows off Mr. and Mrs. coffee mugs and bride and groom hats\n\nHer first wedding to her former childhood boyfriend was understood to be a low-key precautionary affair prompted by the looming expiration date on their marriage license.\n\nThe rapper exchanged vows with Kenneth in front of ‘several family members’ at a private Los Angeles home on Monday, the outlet reported.\n\nNicki had flown her pastor, Lydia Woodson-Sloley, from Brooklyn to Los Angeles for her nuptials so she could officiate the wedding, according to another report by TMZ.\n\nThe Queens, New York native opened up on her Beats 1 radio show Queen Radio August 12 of the paperwork process leading up to the altar, as she and Petty had obtained a wedding license.\n\nShe said: 'We still had to pick it up and I was traveling, by the time I came back, we had to renew it again.\n\n'From that time, you have 90 days to get married. That was about a week ago, so now I have about 80 days.'\n\nHappy couple: The star reunited with Petty in 2018 after previously dating as teenagers\n\nMinaj said she was 'very happy about that because my baby makes me so happy' in reference to Perry, who she's been seeing since late last year.\n\nNicki previously said in an interview with The Shade Room: 'You know when you’re a little girl and you want this big beautiful wedding, and I used to think I was one of those girls, I always wanted the fairytale.\n\n'But then the things that used to matter to you don’t matter as much... I’m madly in love with this man, he’s also my best friend.\n\n'The things that used to matter to me before, don’t matter as much now. So yes, we’re going to have a big wedding eventually.'\n\nIt seems Nicki was sure they would tie the knot back in March, just four months into their romance, when she referred to him as her husband.\n\nShe then changed her Twitter name to Mrs Petty in August and often refers to him as her 'Ken to her Barbie'.\n\nIn December, she wrote on Instagram: 'He want me to be his wife- his MISSIS like SIPPI NOW.'\n\nKenneth also appeared alongside Kenneth in a steamy scene in the video for her summer single Megatron.\n\nIt includes the lyrics, 'I f*** him like I miss him/He just came out of prison,' which might have been an allusion to Perry's criminal record, as he's spent extensive time in custody.\n\nMoving forward: She then changed her Twitter name to Mrs Petty in August and often refers to him as her 'Ken to her Barbie;' pictured with him at Fendi Prints On event in Beverly Hills\n\nWhen he was 16, Petty was convicted in 1995 of attempted rape in connection with a September 16, 1994 incident in which a woman said he 'placed a hard circular object' as she walked down a Queens street, leading to believe he was armed, according to The Blast.\n\nPetty's accuser said she led her to a home and into a bedroom and had sex with her by force, and threatened her with a knife when she tied to leave. He spent four years in prison in connection with the incident, and was also placed on the sex offender registry.\n\nNicki and Kenneth first dated when the rapper was only 16 and living in Queens. New York's age of consent is 17, and her boyfriend would have been around 21 at the time\n\nUnderstandably, there was a backlash from worried and angry fans but Nicki defended Kenneth.\n\nShe wrote in the comments section that the attempted rape charge stemmed from a consensual relationship in his teens.\n\nThe comments on the post have since been disabled.", "description": "She tied the knot with convicted sex offender Kenneth 'Zoo' Petty on October 21, 2019. And one week later, Nicki Minaj shared a series of snaps while she showed off her Harley Quinn costume.", "authors": ["Sarah Sotoodeh For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/14/20330492-0-image-a-31_1572360377067.jpg", "published_at": "2019-10-29"}