{"pub": "yahoo", "url": "https://sg.news.yahoo.com/under-20pc-boats-still-fish-053357779.html", "downloaded_at": "2019-10-24 06:59:37.808534+00:00", "title": "Under 20pc of boats still fish in site marked for reclamation, says Penang exco", "language": "en", "text": "State exco Dr Afif Bahardin says less than 20 per cent of fishing boats in the state operate within the area earmarked for the Penang South Reclamation (PSR) project. — Picture Sayuti Zainudin\n\nGEORGE TOWN, Oct 24 ― Less than 20 per cent of fishing boats in the state operate within the area earmarked for the Penang South Reclamation (PSR) project, state exco Dr Afif Bahardin said today.\n\nResponding to an article published in Aliran that criticised the project and its effects on fishermen, the Penang lawmaker said a study showed only one-fifth of the fishermen’s children chose to become fishermen themselves.\n\nHe said data showed that the monthly catch from the southern shores of Penang island has been declining for the past 10 years.\n\n“A Social Impact Assessment (SIA) study conducted at the affected area in 2016 showed that less than eight per cent of fishers today brings in a monthly catch of more than 200kg, a drop from a whopping 58 per cent 10 years ago, this clearly shows that the decline is independent of the reclamation effects,” he said in a statement issued today.\n\nHe said romanticising a fisherman’s work did not gel with the reality that was the reluctance of the younger generation to take over their parents’ occupation.\n\nThe state agriculture and agro-based industry, rural development and health committee chairman said a buffer zone of 250m from the shoreline will be gazetted as a navigation channel to ensure the existing fishermen can continue their fishing activities.\n\nThe channel will be deepened to allow the fishermen’s boats to have easier access to the open sea.\n\n“Additionally, four floating jetties are to be built throughout the channel, which is an upgrade from the current fishing infrastructure,” he said.\n\nTo address concerns of the impact on the fishing ecosystem, Dr Afif said various ecological offset programmes will be undertaken to address these issues.\n\nThis will include the installation of artificial reefs in Pulau Rimau and Pulau Kendi, the setting up of eco-engineering sea walls throughout the south Penang shoreline and mangrove reforestation projects in Tanjung Tempoyak and Pulau Betong.\n\n“Meanwhile, to contain the ecological impact of the reclamation work, a ring of containment bund is to be built around the dredging area followed by a silt curtain to contain sediment from spreading out of the reclamation zone,” he said.\n\nHe reassured the public that the state government is very clear on its goal and agenda in promoting economic growth for the state.\n\n“We try to achieve this while ensuring that minority groups, those who will bear the brunt of such trade-off; in this case, the fishermen are protected,” he said.\n\nHe said the state government has to make difficult decisions in deciding trade-offs to gain benefits for the longer term.\n\n“The state government does not merely reclaim land for the sake of reclaiming,” he said.\n\nHe said it is part of a much larger goal of building a comprehensive transportation network and industrial infrastructure for Pulau Pinang.\n\n“Of course, we are aware that these fishermen will be the group that will bear the brunt of this trade-off,” he said.\n\nHe said the state strictly sticks to its policy to ensure that the fishermen will be not left out from this development by ensuring sustainability of the fishing grounds and providing a better future for them by proposing an alternative income apart from fishing.\n\n“We are aware of the fact that sometimes the right decisions are also unpopular ones,” he said.\n\nHe said the state will have to persevere and balance between the needs of everyone in the state, regardless of race, religion, be it for those on the island or mainland and especially fishermen.\n\n“Polling sentiments do not determine our decision making, it is the wellbeing of all Penangites that guides our decisions, hope this clears the air,” he said.\n\nThe PSR is the state’s plans to reclaim three islands covering 4,500 acres off the southern coast of the island.\n\nIt was not increase the state’s land bank while at the same time be the funding module for the state’s ambitious RM46 billion Penang Transport Master Plan (PTMP).\n\nRelated Articles In Penang, Anwar says not to ignore concerns raised about massive reclamation Penang exco says more discussions needed on proposed single-stream schools Make defibrillators compulsory in public spaces, Putrajaya told", "description": "GEORGE TOWN, Oct 24 ― Less than 20 per cent of fishing boats in the state operate within the area earmarked for the Penang South Reclamation (PSR) project, state exco Dr Afif Bahardin said today....", "authors": ["Opalyn Mok"], "top_image": "https://s.yimg.com/uu/api/res/1.2/x4eXRCNZggnYxU.Sc8CTHA--~B/aD02Njc7dz0xMDAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/mmail.com.my/a4b6410838b39d166f9c9e3117145537", "published_at": "2019-10-24"}