{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/ramaphosa-defends-gordhan-against-malemas-extraordinary-attack-20190718", "downloaded_at": "2019-10-24 14:15:29.252524+00:00", "title": "Ramaphosa defends Gordhan against Malema's 'extraordinary attack'", "language": "en", "text": "President Cyril Ramaphosa has responded to the \"extraordinary attack\" EFF leader Julius Malema launched on Public Enterprises Minister Pravin Gordhan.\n\nDuring Wednesday's debate on the Presidency's budget, Malema warned Ramaphosa not to outsource his government to a \"cabal\", of which Gordhan, or \"honourable Jamnandas\" as Malema consistently referred to him, was at the centre.\n\nREAD: Mkhwebane finds Gordhan violated executive ethics code, SARS 'rogue unit' was unlawful\n\nResponding to the debate on Thursday, Ramaphosa said he could not let this \"extraordinary attack\" go unanswered.\n\n\"No person is above the law, no person is above scrutiny. Every person must answer for their actions,\" he said.\n\n\"That includes the president, that includes honourable Gordhan, that includes even honourable Gordhan.\n\n\"By the same measure, every person is equal before the law and must have recourse to the law. Every person must be able to enforce their rights, whether that means approaching the courts, or any other competent authority.\"\n\nRamaphosa said he was in no position to express a view on the Public Protector's findings.\n\n\"That is a matter that is now before the courts. But I can express a view on the character of the minister and the contribution he has made in the liberation of our country.\n\n\"I have appointed him to a critical and demanding position in the Cabinet because I know him to be a person of commitment and integrity. He has endured and withstood extreme pressure, both under apartheid and in the democratic era. He's been under pressure to abandon principle and to forsake his responsibility to this nation.\"\n\nRamaphosa reiterated that if Gordhan, or any member of his administration, had something for which they must answer, without any exception, they should be hauled before a court to account.\n\nALSO READ: Ramaphosa to Mkhwebane: 'I will wait for court before disciplining Gordhan … if at all'\n\n\"I will be saying to him, go and answer before a court of law. Let the law take its course, that's what our Constitution demands.\"\n\nWhile Ramaphosa addressed the matter, Malema looked down.", "description": "President Cyril Ramaphosa has responded to the \"extraordinary attack\" EFF leader Julius Malema launched on Public Enterprises Minister Pravin Gordhan.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/2636/0a83747df0484d398f60f5166ce4c7c1.jpg", "published_at": "2019-07-18"}