{"pub": "dailymail", "url": "https://thisismoney.co.uk/money/pensions/article-7551755/The-warning-shows-women-start-saving.html", "downloaded_at": "2019-10-10 00:09:06.648913+00:00", "title": "Women must start saving for pension, or risk hardship in retirement", "language": "en", "text": "When you have to stop work to look after children or family, pension savings are a low priority in the face of everyday bills. But missing contributions in the early years can seriously harm your retirement income.\n\nWomen — who are still the most likely to shoulder caring duties — are particularly affected.\n\nResearch from the Pensions Policy Institute (PPI) shows that, by her 60s, the average woman's pension pot is only a third the size of a man's.\n\nRetirement threat: Research from the Pensions Policy Institute (PPI) shows that, by her 60s, the average woman's pension pot is only a third the size of a man's\n\nMore worryingly, there are 1.2 million women in their 50s now with no private pension savings at all.\n\nAlthough partners can help, three-quarters of women over 60 are either single, widowed or divorced when they die, according to the PPI.\n\nAnd after women affected by the increase in state pension age from 60 to 66 lost their High Court battle last week, it is more important than ever to plan for the future.\n\nThe legal decision means up to four million women must continue working — or find another way to make ends meet.\n\nOne solution to plugging the gap could be the self-invested personal pension (Sipp). This allows non-workers to reclaim basic-rate tax on pension savings up to £2,880 a year.\n\nThe full allowance, topped up with tax relief, means £3,600 in total in your nest egg — essentially £720 of 'free' money.\n\n'Even if you're not earning, your partner could pay into the Sipp and you'll still benefit from the tax relief,' says Maike Currie, investment director at fund manager Fidelity International.\n\nSipps are available from low-cost online platforms such as AJ Bell, Hargreaves Lansdown and Interactive Investor.\n\nCharges vary, but, as an example, at AJ Bell it costs 0.25 per cent a year for the Sipp as well as £9.95 per share deal or typically 0.5 per cent annually for a fund.\n\nMinimum investments are low, ranging from no minimum for regular saving at AJ Bell to £40 a month at Fidelity. Lump sums must be larger — at least £1,000 at AJ Bell, for example.\n\nIf you are working, perhaps part-time, you can add more than £2,880 to your Sipp each year. The maximum is 100 per cent of your annual earnings capped at £40,000.\n\nHow do women get started, or boost existing pensions? Find out practical tips for saving more - especially if you go part time or take maternity leave - here. Carrying on paying into your work scheme if you can means you get free top-ups to your pension from your employer. If you've decided to work for yourself, go here.\n\nYou'll need to choose your own investments for a Sipp, as the cost of financial advice makes it prohibitive for smaller pots.\n\nCrucial to those decisions are your age and when you plan to retire, says Jason Hollands, managing director at online platform Bestinvest.\n\n'Those in their 20s and 30s can afford to take more risk with shares,' he says. 'They should spread their money between several funds which invest globally.'\n\nHis picks include Fundsmith Equity and Lindsell Train Global Equity. These have turned £10,000 invested five years ago into £26,140 and £27,120 respectively now, according to data from FE Trustnet.\n\nAt Shore Financial Planning, investment director Ben Yearsley agrees that higher-risk shares and their potential greater gain are best for long-term saving.\n\nAfter women affected by the increase in state pension age from 60 to 66 lost their High Court battle last week, it is more important than ever to plan for the future\n\nHe likes First State Global Listed Infrastructure and Baillie Gifford Global Discovery which have turned £10,000 into £19,750 and £22,490 respectively over five years.\n\nOlder savers have traditionally swapped shares for less risky investments, such as bonds or property, to preserve capital needed to buy an annuity (an income for life) on retirement. But as annuity purchase is no longer compulsory, this approach is outdated, says Mr Yearsley.\n\n'If you're planning to retire at 55 or 60, you may need income for the next 30 years,' he says. 'So you need higher-risk investments for longer.'\n\nHis selection is equity income funds which aim to grow both capital and income over time.\n\nHe likes Franklin UK Equity Income and J O Hambro UK Equity Income which have made £14,510 and £13,020 respectively out of £10,000 in the past five years.\n\nMeanwhile, Mr Hollands likes funds which balance shares with bonds and property, such as Personal Assets Trust and Ruffer. These have grown £10,000 to £13,510 and £11,920 respectively over the same time.\n\nYou can't access a Sipp until the age of 55, when 25 per cent of it can be taken tax-free. You can use the cash to buy an annuity, or keep it invested and take income and capital in stages — called drawdown.\n\nA more flexible alternative is an Isa. This has a £20,000 annual allowance. Although you don't get the tax relief upfront, all gains and income from them are tax-free.\n\nYou could consider a standard personal pension, but Mr Hollands says Sipps have several advantages.\n\nThey are more portable (future employers may be persuaded to pay contributions into them rather than starting you in a new scheme), and have a wider choice of underlying investments.\n\nBut stick to mainstream investments and avoid get-rich-quick schemes which may be inappropriate or even fraudulent.\n\nmoneymail@dailymail.co.uk", "description": "Research shows that, by her 60s, the average woman's pension pot is only a third the size of a man's. There are 1.2 million women in their 50s now with no private pension savings at all.", "authors": ["Jane Wallace For The Daily Mail", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/21/19458958-0-image-a-7_1570564897313.jpg", "published_at": "2019-10-08"}