{"pub": "cnbc", "url": "https://cnbc.com/2019/09/27/facebook-employee-death-was-suicide.html", "downloaded_at": "2019-09-28 00:57:38.942090+00:00", "title": "Facebook confirms employee death was suicide after protest outside its headquarters", "language": "en", "text": "Facebook on Friday confirmed that the death of an employee on Sept. 19 was a suicide.\n\n\"We are saddened by the tragic news that we lost one of our employees, Qin Chen, to suicide last week at our Menlo Park headquarters,\" a spokeswoman for the company told CNBC in a statement.\n\n\"And, we are doing everything we can to support his family and loved ones during this time. All of our actions are being guided by a world leading external expert in suicide prevention. We deeply care about our people and are providing on-site counseling to our employees and those who work on contract with Facebook, and offering mental health and suicide prevention support for all employees. Lastly, we are bringing the community together by creating safe spaces to openly share through our internal resource groups.\"\n\nThe tech company issued the statement after numerous people gathered outside the company's headquarters on Thursday to demand \"justice for Qin.\"\n\n\"Facebook needs to tell us what exactly happened, what happened when he got to work, what happened one week prior,\" said Bill Young, who was one of the volunteers that organized the protest. \"Facebook knows all of this.\"\n\nThere are rumors that Qin may have endured bullying at Facebook, Young said. However, Young is not an employee at the company and he said that most of the protesters did not work there, either.\n\nA spokeswoman for the company pointed to a Facebook workplace harassment policy page. which states that \"Facebook does not tolerate abusive conduct, bullying or other intimidating or aggressive behavior among employees or others covered by this Policy, whether or not it is based on a protected category. If an employee is found to be mistreating his or her colleagues, we will take appropriate action to stop the behavior.\"\n\nWATCH: Sheryl Sandberg says breaking up Facebook doesn't address big underlying issues", "description": "The tech company issued the statement after numerous people gathered outside the company's headquarters on Thursday to demand \"justice for Qin.\"", "authors": ["Salvador Rodriguez"], "top_image": "https://image.cnbcfm.com/api/v1/image/106038243-1564002012231facebook.jpg?v=1566305913", "published_at": "2019-09-27"}