{"pub": "wsj", "url": "https://marketwatch.com/story/the-401k-retirement-is-coming-are-you-prepared-2019-10-18?mod=rsswn", "downloaded_at": "2019-10-19 19:04:59.402390+00:00", "title": "The 401(k) retirement is coming — are you prepared?", "language": "en", "text": "Most retirees rely on retirement income they didn’t personally put away for their futures, although they did work for it. Young adults won’t have that luxury, and they know it, a recent survey found.\n\nAll but 5% of current retirees consider Social Security and a pension plan as their primary sources of retirement income, according to a Wells Fargo WFC, +0.73% survey released Friday. More than six in 10 say Social Security is their primary source of income, and 22% say a pension is. Baby boomers aren’t far behind. More than 40% said Social Security will be their primary source of paying retirement expenses, and 19% said a pension plan (another 22% said they would rely on their 401(k) and individual retirement plan for this spending).\n\nLess than a quarter of Generation X (21%) expect to use Social Security as a primary source of income, while 16% said pensions and 41% said a 401(K) or IRA. The survey, conducted by the Harris Poll on behalf of Wells Fargo, interviewed 2,700 working Americans between 18 and 75 years old (or older), and 1,000 retired individuals.\n\nBut younger adults seem to be well aware they won’t have those options. Almost half of millennials (45%) said they would use 401(k) plans and IRAs to fund their retirement, versus the 13% who said Social Security and the 12% that said a pension plan. Comparatively, 44% of Generation Z -- the group of adults younger than millennials — said they’d rely on their own savings, while 16% said Social Security and 4% said pensions.\n\nNot everyone believes Social Security will exist in the next few decades, but that’s not true. The two trust funds that support the program are facing insolvency in the next 15 years, but if that were to occur, all beneficiaries would still get benefits — just 80% of the amount they’re owed. Congress has yet to act, but experts say it has never let the program fail.\n\nStill, some financial experts advise young clients not to incorporate Social Security benefits into their retirement plans, for fear that they may get less than they expected (and therefore, saved less than they actual needed come retirement). The advantage of this strategy is that millennials would have more money stashed for their futures if they did end up receiving higher benefits.\n\nAlthough younger adults don’t expect to rely on Social Security in retirement, they do worry about where they would be financially if they were not to receive any or all of the benefit. More than seven in 10 retirees agreed they would have “no idea what I would do without Social Security in retirement if it wasn’t there,” compared with 57% of boomers, 66% of Generation X and 64% of millennials.", "description": "Most current retirees rely on money outside of a 401(k) — young adults won’t have that luxury.", "authors": ["Alessandra Malito"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GC524_charli_ZG_20180126102733.jpg", "published_at": "2019-10-18"}