{"pub": "yahoo", "url": "https://news.yahoo.com/drunk-driving-could-start-end-164700932.html", "downloaded_at": "2019-10-27 00:39:45.805543+00:00", "title": "Drunk Driving Could Start to End Forever as Soon as 2024, Government Says", "language": "en", "text": "From Car and Driver\n\nEvery day, 30 people die in accidents related to drunk driving in the United States, according to NHTSA data .\n\nNewly introduced federal legislation in the Senate would require all new passenger vehicles to have passive alcohol-detection systems by 2024.\n\nThese systems would prevent a car from being started if the driver's blood-alcohol content (BAC) is over the legal limit of 0.08. But would the equipment work every time?\n\nPhoto credit: rolfo - Getty Images More\n\nIn an age in which cars are getting loaded up with active and passive safety equipment to the point of being able to (nearly) drive themselves, a few U.S. senators are looking to put one more piece of safety technology on board. This time, it's alcohol-detection equipment. With 30 people dying in alcohol-related vehicle accidents on American roads every day, or about one every 48 minutes, it's no wonder the federal government is looking for a way to make those numbers decline.\n\nSenators Tom Udall (D–New Mexico) and Rick Scott (R–Florida) have introduced legislation that would mandate that all new passenger vehicles come with passive and unobtrusive alcohol detection systems by the year 2024. Their Reduce Impaired Driving for Everyone (RIDE) Act of 2019 is intended to \"promote the research and development of advanced alcohol detection software and will require the implementation of such technology in new motor vehicles.\" Rep. Debbie Dingell (D–Michigan) has introduced similar legislation in the House of Representatives. The legislators' goal: to have technology in every car that will prevent the car from being started if the driver’s BAC is over the legal limit of 0.08.\n\nCurrently, the Driver Alcohol Detection System for Safety (DADSS) program, funded by the federal government, is the leader in the field of driver-intoxication systems. The program rolled out a prototype back in 2015 and has two systems under development to passively detect alcohol in the driver's body.\n\nPhoto credit: DADSS More\n\nThe first is similar to the traditional Breathalyzer that law enforcement uses to check BAC, but doesn't require a deep breath to be blown into the device. SenseAir, the company behind the breath-based technology, is working toward a device that allows the driver to breathe normally; exhaled air enters the sensor port, which measures the amount of alcohol and carbon dioxide molecules present. SenseAir is currently testing for various scenarios based on lung capacity, alcohol consumption, and breathing patterns. The company is trying to eliminate the possibility that a drunk passenger could trip the sensor and register an illegal BAC, which wouldn't allow a sober driver to operate the vehicle.\n\n\n\nPhoto credit: DADSS More", "description": "A new Senate bill calls for onboard test equipment in every new car that would prevent a car from starting if the driver's BAC is at 0.08 or higher.", "authors": ["Mihir Maddireddy"], "top_image": "https://s.yimg.com/uu/api/res/1.2/aO3qX6z5OEtfsjJw_BXFlQ--~B/dz0wO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/car_and_driver_581/35e1ccd157ec42598ee58bb76375d02f", "published_at": "2019-10-26"}