{"pub": "npr", "title": "Optimists For The Win: Finding The Bright Side Might Help You Live Longer", "url": "https://npr.org/sections/health-shots/2019/09/01/755185560/optimists-for-the-win-finding-the-bright-side-might-help-you-live-longer", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:33:06.004186+00:00", "text": "Optimists For The Win: Finding The Bright Side Might Help You Live Longer\n\nEnlarge this image toggle caption Roy Scott/Ikon Images via Getty Images Roy Scott/Ikon Images via Getty Images\n\nGood news for the cheery: A Boston study published this month suggests people who tend to be optimistic are likelier than others to live to be 85 years old or more.\n\nThat finding was independent of other factors thought to influence life's length — such as \"socioeconomic status, health conditions, depression, social integration, and health behaviors,\" the researchers from Boston University School of Medicine and the Harvard T.H. Chan School of Public Health say. Their work appears in a recent issue of the science journal PNAS.\n\n\"We wanted to consider, in the current issue, benefits of psychological resources like optimism as possible new targets for promoting healthy aging,\" says Lewina Lee, who headed the study. She's a clinical research psychologist at Boston University. \"The more we know about ways to promote healthy aging the better.\"\n\nResearchers already knew from previous work that optimistic individuals tend to have a reduced risk of depression, heart disease and other chronic diseases. But might optimism also be linked to exceptional longevity? Lee looked at medical records from two long term research studies — one involving female nurses and the other involving men, mostly veterans.\n\nThe study included 69,744 women and 1,429 men. Both groups completed survey measures to assess their level of optimism, as well as their overall health and health habits such as diet, smoking and alcohol use. In the survey, study participants were asked if they agreed with statements such as \"in uncertain times I usually expect the best\" or \"I usually expect to succeed in things that I do.\"\n\nExplore Life Kit This story comes from Life Kit, NPR's family of podcasts for making life better — everything from exercise to raising kids to making friends. For more, sign up for the newsletter and follow @NPRLifeKit on Twitter.\n\nHealth outcomes from women in the study were tracked for 10 years, while the men's health was followed for 30 years. Researchers found that the most optimistic men and women demonstrated, on average, an 11-15% longer lifespan, and had far greater odds of reaching 85 years old, compared to the least optimistic group.\n\nNow, researchers say they can't tell from this study how optimism might affect longevity. Optimistic people might be more motivated to try to maintain good health — such as maintaining a decent diet, engaging in regular exercise and not smoking.\n\nThey may also be better at regulating stress, Lee says.The burden of unrelieved stress is well known to have negative effects on health, including an increase in heart disease, liver disease and gastrointestinal problems.\n\nClinical health psychologist Natalie Dattilo, with Brigham and Women's Hospital in Boston, says even if it doesn't come naturally, optimism can be taught. In her practice she works mostly with adults who struggle with depression and anxiety — \"a lot of folks who worry,\" she says. Many are pessimistic and \"tend to see things through a half empty glass and typically expect negative outcomes.\"\n\nIn treatment, Dattilo works to expand their world view, so their set of assumptions about the world and themselves are more uplifting and empowering.\n\n\"We examine their thinking under a psychological microscope,\" Dattilo says, discussing why they anticipate a particular negative outcome. \"If we can look at that together, we can begin to uncover systems of beliefs and assumptions people are making about themselves in their lives and we can begin to change those.\"\n\nDattilo challenges patients to pay attention when a negative outlook kicks in, and consciously shift it. \"Just try it on, try on a different thought, attitude or mindset and play that out and just see what happens,\" she advises.\n\nAlso, she emphasizes, optimism isn't simply the absence of depression or sadness or stress.\n\n\"People who think in optimistic ways are still prone to stress,\" she says. \"They are functioning in our society, meeting demands, prone to burn out. And it's not like negative events won't happen.\"\n\nBut the way they cope with problems makes a difference, she says. Difficulties don't tend to cause them distress for extended periods of time.\n\n\"Resilience is our ability to bounce back, to recover,\" she says. \"And what this study shows is that optimism actually plays a very big role in our ability to bounce — even if we experience setbacks.\"\n\nSo, are gloomy curmudgeons doomed to short, brutish lives, even if they are content to be pessimistic? Some people find eternal optimists insufferable.\n\nLewina Lee says she treats pessimistic patients \"all the time.\" While some seem satisfied with their outlook, others are more open to lightening up, once they know how, in order to achieve goals that are important to them.\n\n\"I would try to challenge their negativity and shake it loose,\" she says, and get rid of some of the patients' more rigidly held beliefs for their own benefit.\n\nPessimists who try this will likely end up happier, she suggests. And they might even extend their lives.", "description": "Pessimists may suspect this finding, but researchers who tracked the health outcomes of thousands of adults across many years found optimists were much more likely to reach 85. Optimism is teachable.", "authors": ["Patti Neighmond"], "top_image": "https://media.npr.org/assets/img/2019/08/29/gettyimages-1043837196_wide-0766b4fe539cc10437fadb017ce29dc488191d69.jpg?s=1400"}