{"pub": "usatoday", "url": "https://usatoday.com/story/money/2019/10/03/heating-bills-can-rise-fall-here-tips-lower-cost/3834289002", "downloaded_at": "2019-10-05 13:26:18.451418+00:00", "title": "Fall's here, and so is the struggle to control your heating bill. Here's how you can try.", "language": "en", "text": "CLOSE Steve Gadsby, owner of FurnaceUSA, a heating and cooling installation company, shares his top tricks to keep your home warm and your heating bill down. USA TODAY\n\nWhen fall arrives, so does the need to dial up the heat in much of the United States. That means shelling out money to keep your home warm.\n\nHeating accounts for about 40% of the typical household energy bill, according to the Department of Energy.\n\nBut there are some simple ways to get those costs down without wearing excessive layers as you sit on the sofa shivering while watching \"The Voice.\"\n\n“We all want a warm, cozy home in the winter, but you don't have to suffer,” said Steve Gadsby, owner of FurnaceUSA, an on-demand heating and cooling installation company operating across the U.S. “You don't have to stay cold just to save on your heating bill.”\n\nCheck and replace your furnace air filter often\n\n“Probably the simplest thing that you can possibly do is just make sure that your filter is clean,” he said. “If it's plugged, it can cause all sorts of problems, increase utilities and cause safety problems ultimately.”\n\nEven a slightly plugged filter could mean losing money by hampering air and heat distribution, said Gadsby, 40, who has been in the business since he was 18.\n\n“If your filter is 50% plugged, the air can't travel to the different bedrooms and the different areas around the house nearly as well. So your comfort level might drop ... just by having a partially-plugged filter.”\n\nSteve Gadsby, owner of FurnaceUSA (Photo: USA Today / Grateful Ventures)\n\nRun the fan system 24/7\n\nOften, people overheat a home because they feel cold in one specific location. Constantly running the fan on the furnace redistributes heat throughout the house.\n\n“If you do that, maybe you can turn your thermostat up less than you would have because you feel warmer in the areas that you want to feel warmer,” Gadsby said.\n\nShut off some areas\n\nClose the vents in areas of the house you're not using. But don't shut off too much of your house because you can overheat your furnace, he cautioned.\n\n‘I've seen this before at customers' houses where they shut down 70 or 80% of the house, but at the same time, your furnace needs enough duct capacity for it to properly breathe and properly flow the heat out of the system,\" Gadsby said. \"So you can shut down parts of the house, but you can't shut down most of the house.”\n\nGadsby recommends closing blinds and shades to prevent heat from escaping through the windows. (Photo: USA Today / Grateful Ventures)\n\nClose the blinds\n\n“One of the quickest and cheapest and easiest ways that you can save money on your heating system is just by closing your blinds,” he said.\n\nBut make sure to open blinds and drapes to let in natural sunlight when the sun is shining, which will heat the home naturally, Gadsby said.\n\nGet a humidifier\n\n“In drier climates, adding a new humidifier can also help you feel warmer in the home, which can ultimately mean that you can turn your temperature down a couple of degrees,” Gadsby said.\n\nConsider insulation\n\nAdding attic insulation will help save money on utilities, but you need to factor in how cold the area is that you're in and how long you're going to live at the home to make sure that it's worth it, Gadsby said.\n\nCheck for air leakage\n\nSeal openings around windows and doors that let in cold air with caulking and weather stripping, Gadsby suggested.\n\nMake sure your filter is clean. If it's at all plugged, air and heat distribution around the house will significantly drop. (Photo: USA Today / Grateful Ventures)\n\nGet a programmable thermostat\n\nA programmable thermostat allows users to preset times for the furnace to turn on and off throughout the day.\n\nGadsby suggested having it turn your furnace on when you're en route to or at home, and off when you’re away.\n\n“Why have a warm house if there's not going to be anybody in it?\" he said. “And the same thing goes with night. Most people like their bedrooms a bit colder. Drop the temperature down at night – maybe 20 minutes before you go to bed, have it off all night, essentially – then have it come back up in the morning. Instantly you're using half the gas essentially in your house that you would've otherwise been using.”\n\nCheck out the video for more tips on saving money on heating.\n\nRead or Share this story: https://www.usatoday.com/story/money/2019/10/03/heating-bills-can-rise-fall-here-tips-lower-cost/3834289002/", "description": "When fall arrives, so does the need to dial up the heat in much of the U.S. But here are simple tips for lowering those heating bills.", "authors": ["Cheryl V. Jackson", "Special To Usa Today", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/01/USAT/e7e63ead-bc6f-47c5-95fb-7d3c7481ef62-steve_4.jpg?crop=1911,1075,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-03"}