{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/dancing-ices-trisha-goddard-agony-20750506", "downloaded_at": "2019-10-30 00:08:35.526460+00:00", "title": "Dancing On Ice's Trisha Goddard in agony after suffering accommodation nightmare", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nTrisha Goddard broke down in tears as her training for Dancing On Ice got off to a disastrous start.\n\nThe TV presenter has been living in Connecticut, in the US, since 2010, but rented a room back in the UK after signing up to the ITV show.\n\nBut she ended up in an accommodation nightmare when the room she rented turned out to be no longer available.\n\nAnd to make matters worse, she said she was left in agony after struggling to sleep on the uncomfortable mattress she ended up spending the night on.\n\nTrisha, 61, broke down in tears as she told fans what had happened in an Instagram video.\n\n(Image: Instagram)\n\n(Image: Instagram)\n\nLooking visibly upset as she sat on the edge of her bed, Trisha said: \"Isn’t it weird how something like a really bad bed can just change your mood.\n\n\"So sorry producers if you wanted a happy 'yay I'm meeting my professional', I can hardly stand up or walk for the backache so... ugh. Really ugh.\"\n\nShe captioned the video: \"Apologies!!! This post should be about being excited to meet my @dancingonice #iceskating pro later today, but..... Ugh! My back! Agony!\n\n(Image: Instagram)\n\n(Image: Press Association)\n\n\"Not much sleep for 2nd night after my flight from #nyc Result? I’m feeling really low to think of the dramas I’ve been through to finally find (*last-minute!) accommodation and end up with a bed with a mattress-from-hell for the next freakin’ six weeks training here in the UK!\n\n\"Watch out! You can book and pay for accommodation on a website, only to discover that the place advertised as being available for the dates you need, actually isn’t!\n\n\"Cue nightmare scenarios of wrangling refunds, and trying to find somewhere else, without repeating the cycle..\"\n\n(Image: Instagram)\n\nTrisha said the mattress was like a marshmallow.\n\nThe talk show legend also apologised to her fellow contestant Ian 'H' Watkins, after she'd made fun of him she taking his own pillows with him wherever he goes.\n\nFellow star Caprice Bourret offered to step in and give her somewhere to stay, but thankfully, the owner of Trisha's rented accommodation got in touch and offered to sort it out.\n\nDo you have a story to sell? Get in touch with us at webcelebs@trinitymirror.com or call us direct 0207 29 33033", "description": "The TV presenter's Dancing On Ice training got off to a disastrous start when the room she rented was suddenly unavailable", "authors": ["Vicki Newman", "Image", "Instagram", "Press Association"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20750616.ece/ALTERNATES/s1200/0_Trisha-Goddard.jpg", "published_at": "2019-10-29"}