{"pub": "npr", "url": "https://npr.org/sections/health-shots/2019/09/10/759435118/epa-chief-pledges-to-severely-cut-back-on-animal-testing-of-chemicals", "downloaded_at": "2019-09-10 23:27:40.247452+00:00", "title": "EPA Chief Pledges To Severely Cut Back On Animal Testing Of Chemicals", "language": "en", "text": "EPA Chief Pledges To Severely Cut Back On Animal Testing Of Chemicals\n\nEnlarge this image toggle caption filo/Getty Images filo/Getty Images\n\nThe Environmental Protection Agency says it will aggressively reduce the use of animals in toxicity testing, with a goal of eliminating all routine safety tests on mammals by 2035.\n\nChemicals such as pesticides typically get tested for safety on animals like mice and rats. Researchers have long been trying to instead increase the use of alternative safety tests that rely on lab-grown cells or computer modeling. The EPA's administer, Andrew Wheeler, has now set some specific deadlines to try to speed up that transition.\n\nIn a signed memo made public Tuesday, he's directed the agency to reduce all requests for, and funding of, studies with live mammals by 30 percent by 2025. He says he wants the agency to essentially eliminate all mammal study requests and funding by 2035, with the use of live mammals only allowed after that with special permission.\n\n\"I really do think that with the lead time that we have in this — 16 years before we completely eliminate animal testing — that we have enough time to come up with alternatives,\" says Wheeler.\n\nHe notes that he wrote an op-ed for his college newspaper on the need to reduce animal testing back in 1987.\n\n\"I didn't think we were that far away from banning animal testing then,\" Wheeler says. \"Part of why I'm doing this today is because it's been 30 years and we haven't made enough progress.\"\n\n\"This has been a long-standing belief of mine on animal testing,\" he adds, saying his mother educated him early about the ethical implications of animal testing. \"My older sister is a zoologist, my younger sister is a veterinarian, so I come from this family that cares deeply about animals and the protection of animals.\"\n\nAn environmental advocacy group, the Natural Resources Defense Council, has come out against the move.\n\n\"EPA is eliminating tools that lay the groundwork for protecting the public from dangers like chlorpyrifos, formaldehyde and PFAS,\" NRDC scientist Jennifer Sass says in a written statement. \"Phasing out foundational scientific testing methods can make it much harder to identify toxic chemicals — and protect human health. Once again, the Trump administration appears to be working on behalf of the chemical industry and not the public. Congress should bar the agency from blindfolding itself.\"\n\nWheeler says chemical companies did not lobby him to do take this action. \"This is a long-standing issue of interest to me, personally, and that's what brought this about,\" he says. \"I've not talked to a single chemical company about this.\"\n\nWheeler signed the memo Monday at EPA headquarters, flanked by representatives from animal welfare groups such as the Humane Society of the United States and People for the Ethical Treatment of Animals.\n\n\"This is the only government agency who has made such a commitment with an aggressive timeline,\" says Kathleen Conlee, vice president of animal research issues for the Humane Society. \"We'd love to see other agencies embrace this approach of making timelines with goals.\"\n\nPenelope Fenner-Crisp, a former senior official at the EPA, says the toxicology community has been working hard for years to reduce, refine, and replace the use of animals in testing.\n\nBut, she says, \"I'm always a little troubled with deadlines on efforts like this. You want to have replacements that are as good as or better than the ones that have been used with whole animals. And you can't always dictate the timeline for accomplishing that.\"\n\nFenner-Crisp says there's currently no substitute for some of the more complex and sophisticated toxicities, such as the effect of chemicals on animals' reproductive systems.\n\nThe EPA announced that it will hold an annual conference on the development of new methods and has awarded $4.5 million to five universities to help develop them.\n\n\"I think it's a big day for the field of alternatives to animal testing,\" says Dr. Thomas Hartung, director of the Center for Alternatives to Animal Testing at Johns Hopkins University, which got a grant to develop a new toxicity model for the brain.\n\nOfficials have long mostly given lip service to the idea of finding substitutes, he says.\n\n\"I think this is really taking action. I was very surprised. I did not expect such a strong position,\" says Hartung, who notes that most of the animal tests used by the EPA and other agencies are half-a century old. \"Nothing has really changed. We have seen very few new methodologies being actually applied.\"", "description": "Alternative tests are emerging, the agency says, such as computer modeling and tissue studies of cells grown in the lab. Environmental advocates say the move is too quick, and disregards human health.", "authors": ["Nell Greenfieldboyce"], "top_image": "https://media.npr.org/assets/img/2019/09/10/greenfieldboyceepaanimaltestingraw_wide-05c365c9592ed59a4e78f7de3574386a5536ccc1.jpg?s=1400", "published_at": "2019-09-10"}