{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7592653/The-secret-Jessica-Mauboys-diamond-engagement-ring.html", "downloaded_at": "2019-10-20 06:58:20.431750+00:00", "title": "The secret detail on Jessica Mauboy's diamond engagement ring", "language": "en", "text": "Singer Jessica Mauboy accepted a proposal from her long-term boyfriend Themeli Magripilis last week.\n\nAnd now a secret design detail of her 1.5 carat oval diamond engagement ring has been revealed by jeweller Mondial by Nadia Neuman.\n\nDesigner Nadia told Daily Mail Australia that the custom-design ring included a hidden symbol that was significant to Jessica - a butterfly.\n\nREVEALED: The secret detail of Jessica Mauboy's (R) 1.5 carat diamond engagement ring designed by her partner Themeli Magripilis (L)\n\nThe impressive sparkler features an oval cut 1.5 carat diamond surrounded by little round and marquise cut diamonds with additional round and marquise cut stones on the white gold band.\n\nNadia said she worked closely with Jessica's fiance to craft the perfect ring: 'My main role with Themeli during this process was to ensure the ring reflected his vision and was a one-off piece that was entirely unique to Jess.'\n\nShe also said the pair asked for advice from her stylist Mike Ayoubi as to what would look good for Jess and suit her personal style.\n\n'We knew butterflies meant a lot to Jess, we wanted to incorporate them into her custom design': Designer Nadia Neuman revealed they included a hidden butterfly motif on the ring\n\n'I believe jewellery should have meaning and tell a story about the wearer': Nadia (L) worked closely with Jessica's fiance Themeli and Jessica's stylist to create the stylish, bespoke piece\n\n'I believe jewellery should have meaning and tell a story about the wearer. Pieces I usually custom design have personal inscriptions or symbols embedded in them,' she said, adding that they decided to include a hidden butterfly motif in the design.\n\n'We knew butterflies meant a lot to Jess, we wanted to incorporate them into her custom design,' she said.\n\nThe rose gold butterfly motif was added behind the stone, which was set on a premium white gold band.\n\nA closer look! The impressive sparkler features an oval cut 1.5 carat diamond surrounded by little round and marquise cut diamonds with additional round and marquise cut stones on the white gold band\n\nNadia explained: 'I have always loved butterflies because they are both beautiful and fragile. They represent transformation, progression and growth. And while I don't know Jess' interpretation of butterflies exactly, I know they have always meant a lot to her and generally people who feel an affinity towards butterflies do so for those reasons.'\n\nJess became engaged to Themeli during a holiday in Greece this month.\n\n'We are so happy. I can't wait to spend the rest of my life with my best friend. Thank you for all the love. BIG LOVE JM & Themeli,' she announced at the time.", "description": "Jessica Mauboy accepted a proposal from her long-term boyfriend Themeli Magripilis last week. And now a secret design detail of her 1.5 carat oval diamond engagement ring has been revealed.", "authors": ["Candice Jackson For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/06/19947264-0-image-a-26_1571548042640.jpg", "published_at": "2019-10-20"}