{"pub": "axios", "url": "https://axios.com/espn-cover-story-magazine-78d82e06-368f-4db2-b891-ed4d32299933.html", "downloaded_at": "2019-10-15 12:29:00.999438+00:00", "title": "ESPN unveils \"Cover Story,\" the successor to its print ESPN Magazine", "language": "en", "text": "\"This may be the most cross-functional team at ESPN that I've ever worked with,\" says Alison Overholt, ESPN's vice president of storytelling & special projects and the former editor-in-chief of the now-defunct monthly print publication 'ESPN The Magazine.'\n\nDetails: Each month on a Wednesday, ESPN will release one cover story. Like a magazine it will feature one highly-reported story, with one reporter and one piece of eye-catching imagery.\n\nThe stories will air on SportsCenter at 6:00 a.m., noon and 6:00 p.m. on the day they debut and will be prominently positioned at the top of the feeds on ESPN's apps and its homepage.\n\nThey will feel like magazine stories, with the same sort of inside access, written reporting, and magazine-quality visuals that you would find in print.\n\nEach cover story image will feature a singular image that's highly-focused, just like a typical magazine cover.\n\nOver time, the video components will be aded to ESPN's playlists on YouTube and on ESPN+, its streaming service.\n\nAlerts and social media clips of the story will publish throughout the day.\n\nLeading the charge is a group of top executives from across ESPN's newsroom. Top executives from ESPN's newsmagazine show E:60, ESPN Social, ESPN's creative and photography departments, as well as top ESPN writers and editors will join Overholt in building out the monthly feature.\n\nThere's a short list of talent that will present the stories, due to the fact that each story will require a wide range of written and video storytelling elements.\n\nSome people that you can expect to see anchoring future cover stories include ESPN names like Wright Thompson, Ramona Shelburne and Marc J. Spears.\n\n\"What makes this distinct is that you will follow one journalist across every ESPN platform,\" says Overholt. \"Only a handful of people are able to do that.\"\n\nThe first-ever cover story will be presented by Mina Kimes, the recently-announced host of ESPN's new morning podcast.\n\nKimes will tell the personal story of star wide receiver DeAndre Hopkins for the first time on-camera for ESPN. The feature will include interviews with his mother, who is blind, about how their relationship shaped who he is today.\n\n\"A lot of the elements are historical accounts of things that happened in the past,\" says Kimes. \"Those are things that we don't have great visuals for, so they are better told via writing. But in on-camera interviews, principles can get quite emotional. You get a sense of their state of mind by watching them in a way that you wouldn't just from reading about it.\"\n\nWhat's next: The company is hoping to have each story be sponsored or underwritten by an advertiser.\n\nThe bottom line: \"Our goal here is we wanted to capture what was most impactful and enduring about ESPN magazine and build on it,\" says Overholt. \"We've reinvented the concept of cover story as modern multimedia presentation.\"\n\nGo deeper: A special edition of Axios Sports featuring some of Kendal Baker's favorite ESPN The Magazine covers.", "description": "The new franchise will be the focal point of ESPN's editorial ambitions moving forward.", "authors": [], "top_image": "https://images.axios.com/SjpgjKQvlGxNPLy_TtN-kT8i0-g=/0x0:1920x1080/1920x1080/2019/10/15/1571099723515.jpg", "published_at": "2019-10-15"}