{"pub": "reuters", "url": "https://in.reuters.com/article/uk-malaysia-politics-1mdb-jho-low/u-s-nears-1mdb-recovery-deal-with-malaysian-fugitive-jho-low-bloomberg-idINKBN1X92AZ", "downloaded_at": "2019-10-31 00:08:45.139385+00:00", "title": "U.S. nears 1MDB recovery deal with Malaysian fugitive Jho Low", "language": "en", "text": "FILE PHOTO: A general view of The Exchange 106 in Kuala Lumpur, Malaysia, October 23, 2019. REUTERS/ Lim Huey Teng\n\n(Reuters) - The U.S. Justice Department is close to a deal with fugitive financier Jho Low to recover almost $1 billion (£776.10 million) that was misappropriated from Malaysian investment fund 1MDB, Bloomberg reported on Wednesday, citing a source familiar with the matter.\n\nLow faces charges in the United States and Malaysia over his alleged central role in the scandal at 1Malaysia Development Berhad (1MDB), which was founded by former Prime Minister Najib Razak.\n\nThe settlement could be filed as soon as this week in a California court, the report said. (bloom.bg/34gEooM)\n\nA Justice Department spokesman declined to comment.\n\nThe deal is not expected to include an admission of guilt or wrongdoing and is not tied to the criminal action against Low, the report said.\n\nThe Malaysian government, Wall Street bank Goldman Sachs Group Inc (GS.N) and Deutsche Bank (DBKGn.DE) have all been caught up in the probes into misappropriated funds. Goldman said earlier this month it was cooperating with the Justice Department and other government and regulatory investigations.\n\n“The firm is also engaged in discussions with certain government and regulatory authorities with respect to potential resolution of their investigations,” the bank said in a U.S. Securities and Exchange Commission filing on Oct. 15.\n\nMalaysian and U.S. investigators have said at least $4.5 billion was misappropriated from 1MDB by Low and other high-level officials of the fund and their associates.\n\nLast year, Malaysia filed criminal charges against Goldman over its role as underwriter and arranger of three bond sales that raised $6.5 billion for 1MDB. Prosecutors in August filed criminal charges against 17 current and former directors at its units.", "description": "The U.S. Justice Department is close to a deal with fugitive financier Jho Low to recover almost $1 billion (£776.10 million) that was misappropriated from Malaysian investment fund 1MDB, Bloomberg reported on Wednesday, citing a source familiar with the matter.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191030&t=2&i=1446630620&w=1200&r=LYNXMPEF9T1PR", "published_at": "2019-10-30"}