{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-wizz-air-brexit/wizz-air-boss-looks-to-brexit-as-an-opportunity-to-grow-idUKKBN1W21V9", "downloaded_at": "2019-09-17 23:29:22.010768+00:00", "title": "Wizz Air boss looks to Brexit as an opportunity to grow", "language": "en", "text": "VILNIUS (Reuters) - The boss of Hungarian low-cost airline Wizz Air (WIZZ.L) said he did not expect Brexit to disrupt his operations, and that it could actually present an opportunity to grow as competitors fall away.\n\nFILE PHOTO: A Wizz Air Airbus aircraft is pictured at the London Luton Airport, Luton, Britain, April 13, 2019. REUTERS/Kacper Pempel\n\nChief Executive Jozsef Varadi told Reuters that Wizz Air’s UK subsidiary had all permits that would be needed to operate flights between Britain and EU member countries, as well as nations.\n\nThe carrier, which is headquartered in Hungary but listed in London, founded Wizz Air UK in 2017 as a contingency to ensure full market access to Britain beyond Brexit.\n\nBritish Prime Minister Boris Johnson has vowed to take his country out of the European Union on Oct. 31, with or without a deal to govern its trading relationship with the bloc.\n\n“If a no-deal Brexit happens on Oct. 31, I don’t think you as a customer would notice when it comes to flying Wizz Air,” Varadi said on the sidelines of a conference in Vilnius.\n\n“Possibly further consolidation opportunities would arise as a result of Brexit and Wizz Air UK can become a consolidating platform in the UK,” he added. “We would be interested in backfilling market gaps if airlines go down, or possibly take over some assets and use them in our platform.”\n\nThe EU reserves flights between destinations within the bloc only for airlines that are majority owned and effectively controlled by EU, European Economic Area or Swiss nationals.\n\nEasyJet (EZJ.L), Ryanair (RYA.I) and British Airways-owner IAG (ICAG.L) are among airline groups likely to be most affected when British shareholders are no longer EU nationals.\n\nWizz Air UK bought slots at London Luton from collapsed Monarch Airlines in 2017, growing its presence at the airport.\n\nThe Wizz Air group, the largest low-cost airline in central and eastern Europe, expects that region to account for 70-80% of its growth over the next 6-7 years, Varadi said.\n\nThe airline has ordered 271 Airbus planes, to be delivered by 2036, when it expects to operate a fleet of 300 aircraft.", "description": "The boss of Hungarian low-cost airline Wizz Air said he did not expect Brexit to disrupt his operations, and that it could actually present an opportunity to grow as competitors fall away.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190917&t=2&i=1430887209&w=1200&r=LYNXMPEF8G192", "published_at": "2019-09-17"}