{"pub": "fox", "url": "https://foxnews.com/us/two-in-custody-and-confession-is-made-in-florida-firefighters-murder-authorities", "downloaded_at": "2019-10-24 23:54:20.321114+00:00", "title": "Two in custody, and confession is made in Florida firefighter's murder: authorities", "language": "en", "text": "Two suspects are in custody and a confession has been made in connection with the killing of a Florida firefighter, the Broward County Sheriff announced on Thursday.\n\nWhile speaking at the funeral of slain Coral Springs firefighter Christopher Allen Randazzo, 39, Broward County Sheriff Gregory Tony revealed the new information in the case, WSVN-TV reported, adding that the room then erupted in applause.\n\nFLORIDA SENATE VOTES TO PERMANENTLY OUST BROWARD SHERIFF SCOTT ISRAEL\n\n“We have committed every single resource to bring the justice that is necessary to bring closure to this,” he said. “I’m here to tell you that we have identified all four suspects. Two are in custody, and we have a confession.”\n\nAround 6 a.m. on Saturday, Randazzo, of Pompano Beach, was found dead at a beach resort in Lauderdale-by-the-Sea, according to a Broward County Sheriff’s Office news release.\n\nOFFICERS KILLED IN THE LINE OF DUTY IN 2019\n\nInvestigators said the firefighter and paramedic with the Coral Springs-Parkland Fire Department was last seen leaving a cafe about two minutes away from the resort about 1 a.m.\n\nDetectives classified the case as a homicide, but did not provide further details.\n\nThe identities of the suspects in custody have not yet been released pending charges, according to a sheriff's spokeswoman.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nOn Thursday morning, dozens of first responders, colleagues and loved ones reportedly gathered at a Coral Springs Marriott to say their final farewells to Randazzo.", "description": "Two suspects are in custody and a confession had been made in connection with the killing of a Florida firefighter, the Broward County Sheriff announced on Thursday.", "authors": ["Talia Kaplan", "Talia Kaplan Is A Reporter For Foxnews.Com. Follow Her On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Christopher-Randazzo.jpg", "published_at": "2019-10-24"}