{"pub": "yahoo", "url": "https://news.yahoo.com/argentina-investors-look-ahead-fernandez-023402653.html", "downloaded_at": "2019-10-29 06:02:06.368866+00:00", "title": "Argentina Investors Look Ahead After Fernandez Pulls Out Win", "language": "en", "text": "(Bloomberg) -- Argentina investors are watching for leading candidate Alberto Fernandez’s next steps after the results of Sunday’s presidential election were tighter than expected.\n\nFernandez won the race for the country’s top job with 48% of the vote, above the 45-point threshold needed to win outright. But with 91% of votes counted, the big surprise of the night was that incumbent President Mauricio Macri narrowed Fernandez’s margin of victory to seven points from a 16-point gap in an August primary.\n\nAnalysts and investors are now watching for two key items as they prepare for the market reaction Monday morning. First, what the final composition of congress will be, and how that may impact key legislation ahead, including a debt restructuring. Second, they’ll be keeping an eye on any details Fernandez gives of his economic plan.\n\nIn a speech Sunday evening, Fernandez called on all Argentines to rebuild the country. Alongside him, his vice-president and former president, Cristina Fernandez de Kirchner, asked Macri to take any measures needed to address Argentina’s financial issues. The speeches did not add clarity on who will make up the new economic team, or address bondholders or the International Monetary Fund directly. Macri and Fernandez are expected to have breakfast Monday morning.\n\nRead More: Fernandez Wins in Argentina as Voters Rebuff Macri’s Austerity\n\n“We need a transition team and an economic plan or this gets ugly,” said Siobhan Morden, New York-based head of Latin America fixed-income strategy at Amherst Pierpont. “Sooner the better.”\n\nHere’s what analysts are saying:\n\nTsutomu Soma, general manager of fixed-income business solutions at SBI Securities:\n\nFernandez’s win has already been priced in to the nation’s assets, including concerns of further worsening of the nation’s fiscal conditionThe amount of Argentine assets owned by foreign investors should already be quite limitedThose with any exposure left probably had built their short positions, helping to further limit any risks from the election\n\nJean-Charles Sambor, London-based deputy head of emerging-market fixed income at BNP Paribas Asset Management:\n\nThe asset manager is “cautiously optimistic” on Argentine bonds after Fernandez’s win“A lot of negativity is already priced in. We think we might be a bit below recovery value”Among Argentine securities, the company sees more value in euro-denominated debt and the century bondFernandez is likely to attempt restructuring debt initially in a market-friendly fashion; but, if rhetoric heats up and a market-friendly restructuring plan becomes unlikely, this could potentially be very negative\n\nEzequiel Zambaglione, head of strategy at Buenos Aires-broker Balanz Capital:\n\n“We’ll have to look at the numbers and see what the makeup of Congress looks like, especially in the lower house. But the main market driver will still be what Alberto Fernandez comes out and says in his speech”\n\nAlberto Bernal, chief strategist at broker XP Investments:\n\n“The difference was tight, so Fernandez will have to be a little bit humble about the victory.”“The Fernandez win was priced in, but this tight of a difference was not priced in.”The results show that “something like 44% of Argentina is voting for economic orthodoxy, and still wants to do the right thing in terms of real adjustments. The populist view was not overwhelming, and I think that most of the market was convinced that it was going to be overwhelming.”\n\nJimena Blanco, political research director at consulting firm Verisk Maplecroft in Buenos Aires:\n\n“I don’t expect massive volatility -- markets will be waiting to see who Fernandez appoints to his cabinet and the economic plan he announces”“If anything, this greater balance could have a positive impact for those looking to acquire Argentine assets.”“The implication is that any restructure taken to Congress will be moderated by Macri’s coalition, and also that it will be hard, if not impossible to undo many of the Macri reforms.”\n\nSiobhan Morden, New York-based head of Latin America fixed-income strategy at Amherst Pierpont:\n\nFernandez’s speech on Sunday will be hugely important to how markets react on MondayAlthough Fernandez would not officially take the top job until Dec. 10, “there is no honeymoon,” and he will be expected to offer an economic plan and cabinet appointees quickly“The only solution for Argentina is reform-based fiscal discipline,” she said in an interview. “If this is what voters are saying, it’s that they expect responsible management.”\n\n(Updates with details from Fernandez speech in fourth paragraph.)\n\n--With assistance from Yumi Teso, Lilian Karunungan and Tomoko Yamazaki.\n\nTo contact the reporters on this story: Scott Squires in Buenos Aires at ssquires4@bloomberg.net;Sydney Maki in New York at smaki8@bloomberg.net\n\nTo contact the editors responsible for this story: Daniel Cancel at dcancel@bloomberg.net, Carolina Millan, Andrew Dunn\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Argentina investors are watching for leading candidate Alberto Fernandez’s next steps after the results of Sunday’s presidential election were tighter than expected.Fernandez won the race for the country’s top job with 48% of the vote, above the 45-point threshold needed to win outright", "authors": ["Scott Squires", "Sydney Maki"], "top_image": "https://s.yimg.com/uu/api/res/1.2/j0OslnoTip7Cx2PjenpnRA--~B/aD0xMzMzO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/f8faa99df4e4ad66a02bf4149ebf2bd1", "published_at": "2019-10-28"}