{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7596359/James-Argent-proves-fighting-form-flashes-peace-sign-scooter-ride-London.html", "downloaded_at": "2019-10-21 13:24:31.158693+00:00", "title": "James Argent looks on fighting form as he flashes peace sign on scooter ride in London", "language": "en", "text": "James 'Arg' Argent looked in fighting form as he went for a spin on his scooter in East London after parademics were called to his home over the weekend after concerns he had overdosed.\n\nThe former TOWIE star, 31, proved all was well as he flashed a peace sign while on his journey around the city on Monday.\n\nArg sported a black hoodie and matching tracksuit bottoms for the day and a teal helmet that matched his scooter.\n\nGood mood: James Argent, 31, went for a spin on his scooter in East London after parademics were called to his home over the weekend after concerns he had overdosed\n\nThe TV star completed his look with a pair of black sneakers and a silver chain around his neck.\n\nArg smiled as he went on his journey, likely determined to put the events of the weekend behind him which saw both paramedics and the police called to his home.\n\nHis outing comes shortly after his ex girlfriend Gemma Collins reportedly called 999 over fears Arg had overdosed.\n\nAccording to The Sun , police 'broke into' the TOWIE star's home after he failed to return his friends' phone calls.\n\n\n\n\n\nHappy: The former TOWIE star proved all was well as he flashed a peace sign while on his journey around the city on Monday\n\nTwo police cars and two ambulance crews made their way to Arg's £1.3million home over concerns he had collapsed.\n\nAccording to the publication, Gemma, 38, dialled 999 after Arg's parents were unable to get into his house where he lives by himself.\n\nMedics examined the reality star and his parents reportedly insisted that they could look after him.\n\nCasual: Arg sported a black hoodie and matching tracksuit bottoms for the day and a teal helmet that matched his scooter\n\nHowever, three hours later they are said to have raised the alarm again over 'further concerns for his welfare'.\n\nIn a statement given to The Sun, James insisted he was fine and the reason he did not answer his phone was because he 'wasn't speaking to a certain person'.\n\nHe said: ‘I wasn’t speaking to a certain person so I didn’t reply. They became concerned and called the police and ambulance.\n\nScare: Arg's outing comes after his ex Gemma Collins reportedly called 999 over fears her on/off boyfriend Arg had overdosed\n\n'They turned up and checked on me. They came up to my room to make sure I was fine.’\n\nThe ambulance crew reportedly arrived to his home in South Woodford, North East London, shortly before 1pm with the police arriving soon after.\n\nWhen the cops got inside, they assessed Arg but then got a second call at 4:20pm before a third ambulance arrived.\n\nArg said his parents were already in his home checking up on him when 'this person' called the emergency services again.\n\nAfter the ambulance arrived at his house after 4pm, Arg said he had a quick chat with them on his doorstep, adding the police and paramedics were only at his house for about 10 minutes.\n\nHealth: According to The Sun , police 'broke into' the TOWIE star's home after he failed to return his friends' phone calls (pictured with Gemma in October 2018)\n\nThe reality star added that he was 'slightly embarassed' by the incident and apologised for any wasted police time as he was 'absolutely fine'.\n\nA source had told The Sun: 'James’ friends are beyond worried. Their concern is that if this behaviour keeps on happening that one day soon they will go around to find him dead.\n\n'He has become more and more reclusive and his loved ones are worried about what is going on behind closed doors, away from watchful eyes.\n\n'It took the quick thinking of police to smash through the glass panel on his front door to undo the bolt and get in. Arg needs a wake-up call and hopefully this will be it.'\n\nA source said: 'James’ friends are beyond worried. Their concern is that if this behaviour keeps on happening that one day soon they will find him dead' (pictured in November 2017)\n\nThe source added that Gemma called the emergency services after hearing from Arg's parents and immediately thought the worst.\n\nThe Metropolitan Police said in a statement: ‘Police were called at 13.11hrs to a residential address following concerns for the welfare of male occupant.\n\n'Officers attended with LAS (London Ambulance Service). The male, in his 30s, was spoken to. He was left in the company of family. Officers were called at 16.21hrs to the same address, again due to concerns for the same male’s welfare. The male declined assistance.’\n\nMailOnline has contacted representatives for James and Gemma for further comment.\n\nPost: The scare comes the same weekend Arg posted this snap to his Instagram promoting a range of cleaning products from his home\n\nThe scare came the same weekend Arg posted a snap to his Instagram promoting a range of cleaning products from his home and also said that he has a DJ'ing gig in Marbella coming up next Wednesday.\n\n'Finally moved into my beautiful new home. Thank you so much @nenucoattrendytots for your lovely house warming gifts!\n\n'The smells remind me of Spain which help me not to miss it as much lol ❤️ I can’t wait to be back in Majorca this Wednesday for my gig at @stadium63'.\n\nArg was said to have been sacked from TOWIE after failing a routine drug test, leaving his friends worried about his health.\n\nA source told The Sun that Arg voluntarily agreed to the routine test before he returned to filming because of concerns over his previous issues with drugs and alcohol.\n\nThe source added: 'He has become more and more reclusive and his loved ones are worried about what is going on behind closed doors, away from watchful eyes' (pictured in May 2019)\n\nThe insider added that the production crew of TOWIE are very fond of him and hope he can overcome his issues.\n\nDuring a previous appearance on This Morning, James spoke about his weight, saying he believes he replaces substance abuse with food.\n\nHe said: 'I'm proud at myself I've been able to do really well career wise in the last nine months, I’ve stayed sober but instead of me going out with mates doing drugs... I’m probably acting out on food.'\n\nIn August last year, Arg returned to rehab following a split from Gemma in a brave bid to tackle his demons.\n\nThe TV star spent three months in a facility in Thailand over the festive season in 2016 in a bid to curb his wild ways and revealed that he checked himself in to a programme in order to get the 'ongoing support' he needed.\n\nHe also spent time in The Priory for alleged drink and drug issues in 2014.", "description": "The former TOWIE star, 31, proved all was well as he flashed a peace sign while on his journey around the city on Monday.", "authors": ["Sean O'Grady For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/12/19989058-0-image-a-14_1571659153776.jpg", "published_at": "2019-10-21"}