{"pub": "cbc", "url": "https://cbc.ca/news/world/hong-kong-1.5293071", "downloaded_at": "2019-09-22 16:32:08.996357+00:00", "title": "Hong Kong protesters set fire outside police station, walk on Chinese flag | CBC News", "language": "en", "text": "Protesters in Hong Kong set fire to a barricade outside a police station and did damage inside a subway station on Sunday smashing surveillance cameras and electronic ticket sensors in pro-democracy demonstrations after clashing with police who fired tear gas.\n\nThe protesters used hammers to knock the ticket sensors off gates and spray-painted and broke the screens of ticket machines, using umbrellas to shield their identities.\n\nVideo showed protesters also gathering around a burning barricade outside the Mong Kok police station and some throwing debris into fire.\n\nThe late afternoon attack on Shatin station came as a protest at which activists folded paper \"origami\" cranes was winding down at the New Town Plaza, connected to the station. Activists also spray-painted and trampled over a Chinese national flag at the mall.\n\nAnti-government protesters held a rally in a shopping mall in Sha Tin, Hong Kong, on Sunday. (Aly Song/Reuters)\n\nBefore the origami-folding, protesters at the mall chanted slogans and sang a song that has become their anthem, backed by a small group playing on woodwind and brass instruments through their masks. Many lined the balustrades of the three higher floors overlooking where others gathered in the wide space below.\n\nHong Kong's pro-democracy protests, now in their fourth month, have often descended into violence late in the day and at night. A hardcore group of protesters says the extreme actions are needed to get the government's attention. On Saturday night, police used tear gas and rubber rounds against protesters who threw gasoline bombs toward them and set fires in streets.\n\nAn anti-government protester was seen waving a damaged Chinese nationial flag in the New Town Plaza at Sha Tin in Hong Kong. (Aly Song/Reuters)\n\nHong Kong's leader, Chief Executive Carrie Lam, has agreed to withdraw an extradition bill that sparked the protests in June. But the anti-government protesters are pressing other demands, including fully democratic elections in the semiautonomous Chinese territory and an independent investigation of complaints about police violence during earlier demonstrations.\n\nThe protesters are angry about what they see as creeping Chinese interference in Hong Kong, which returned to China in 1997 under a \"one country, two systems\" formula intended to guarantee freedoms that are not enjoyed on the mainland.\n\nProtesters then stepped on the flag. (Kin Cheung/The Associated Press)\n\nChina says it is committed to the \"one country, two systems\" arrangement and denies meddling. It has accused foreign governments including the United States and Britain of inciting the unrest.\n\nProtesters say Beijing and Lam's government are eroding the \"high degree of autonomy\" and Western-style civil liberties promised to the former British colony when it was returned to China in 1997.\n\nThe unending protests are an embarrassment for China's Communist Party ahead of Oct. 1 celebrations of its 70th anniversary in power. Hong Kong's government has cancelled a fireworks display that day, citing concern for public safety.\n\nTransit authorities closed two stations on the airport express train to guard against a possible disruption of transportation to the transportation hub, but none had materialized by late Sunday afternoon.\n\nThe Hong Kong International Airport Authority said the train would operate between the airport and the terminus station in the centre of the city, without making its usual stops in between. Some airport bus routes were also suspended. Passengers were advised to leave sufficient time to reach the airport.", "description": "Protesters walked on a Chinese national flag, damaged a subway station and burned a barricade outside a police station, in demonstrations over creeping Chinese interference in Hong Kong and a lack of democracy.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5293175.1569165965!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/hongkong-protests.jpg", "published_at": "2019-09-22"}