{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/battlefield-v-finally-has-a-metro-map-and-i-love-the-chaos", "downloaded_at": "2019-10-06 05:32:55.437098+00:00", "title": "Battlefield V Finally Has A Metro Map, And I Love The Chaos", "language": "en", "text": "If a multiplayer shooter goes on long enough, it’ll develop a signature map. That can be the back-and-forth sniping on Team Fortress’ 2_fort, or the dual bases of Halo’s Blood Gulch. For Battlefield, it’s Metro. The tight, claustrophobic map has appeared under various names in multiple games in the series, and was just added to Battlefield V in the form of “Operation Underground.” Anyone looking for a reason to boot it up again should immediately jump into a match on this fantastic, frantic warzone.\n\nMetro first appeared as “Operation Métro” in 2011’s Battlefield 3. It was one of the first maps available to the public during online tests and quickly became a staple of multiplayer. “Metro Only” servers were common, offering a 24-7 dose of close-quarters combat.\n\nUnlike many other maps, Operation Métro was confined. Battles took place in crowded underground subway tunnels, leading to matches that were absolute bloodbaths. Its popularity persisted and earned the map a spot in Battlefield 4's downloadable content. When Battlefield V released, changing the setting back to World War II, it seemed like there wouldn’t be another incarnation. That’s changed with the release of Operation Underground, a revamped version of Metro with a vintage setting.\n\nBattlefield V’s maps generally tend to capture the large scale the series is known for, such as the desert map of Hamada or sunny field of Arras. While there have been game modes that feel more like Metro, adding chokepoints and extra defences, it’s never been quite the same.\n\n“Operation Underground” moves the battle from France to Germany, adding a few new side tunnels for flanking and more areas above ground. The original Metro maps were prone to endless battles in the middle of hallways or the base of stairs. That still happens in Operation Underground, but these additional pathways give players the chance to slink around and turn the tide.\n\nEven though the original Operation Métro was popular, it was also somewhat controversial. Many fans of Battlefield’s large spaces and vehicle-focused combat hated the map for its meat-grinder gameplay and constant stalemates.\n\nOperation Underground seems destined for a similar split. In a few of the matches I’ve played, I’ve watched teams get utterly steamrolled. No matter how hard they’ve pushed or tried to flank, it ended in disaster.\n\nSome players will hate this. If you’re looking to drive a tank or have some cool sniper shots, this is not the map for you. It is the realm of one-hit kills from shotguns, grenades that take out whole squads, and tunnels brimming with machine gun fire. You will die playing Operation Underground, again and again. Sometimes, it will feel like horseshit.\n\nDid you really turn that corner and get cut to ribbons by two stationary gunners? Did that jerk just sprint through the smoke and waste you with a shotgun blast? Yes, and it’s going to happen a lot. But that is part of the Metro maps’ appeal. They are places where you are constantly fighting, never waiting for enemies, and spawning into hellacious battles. You either love it or hate it.\n\nI love it. Operation Underground helps round out Battlefield V’s map rotation, which has had some issues compared to previous games. While rotating rewards from the “Tides of War” encourage players to hop in and complete challenges, the original selection of maps was sorely lacking.\n\nThere weren’t many of them, and only a few were particularly exciting. As Battlefield V has expanded, there have been disappointing tank battle maps and the occasional fast-paced beach assault. There’s no replacing the classics, though, and Operation Underground brings some tried-and-true spice to a sometimes underwhelming multiplayer experience.", "description": "If a multiplayer shooter goes on long enough, it’ll develop a signature map. That can be the back-and-forth sniping on Team Fortress’ 2_fort, or the dual bases of Halo’s Blood Gulch. For Battlefield, it’s Metro. The tight, claustrophobic map has appeared under various names in multiple games in the series,...", "authors": ["Heather Alexandra", "Alex Walker"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/aysh627iakojxb8cw65b.jpg", "published_at": "2019-10-06"}