{"pub": "reuters", "url": "https://reuters.com/article/us-california-prisons/california-bans-private-prisons-and-immigration-detention-centers-idUSKBN1WQ2Q9", "downloaded_at": "2019-10-12 00:31:59.828776+00:00", "title": "California bans private prisons and immigration detention centers", "language": "en", "text": "LOS ANGELES (Reuters) - California moved to end the use of private, for-profit lockups in America’s largest state prison system as well as in federal immigration detention centers in the state under a measure signed into law on Friday by Governor Gavin Newsom.\n\nFILE PHOTO: California governor Gavin Newsom stands next to an American flag as he waits to speak at a news conference in San Diego, California, U.S. October 9, 2019. REUTERS/ Mike Blake/File Photo\n\nThe new law bars the California Department of Corrections and Rehabilitation from entering into or renewing a contract with a private company to run a state prison after Jan. 1, 2020, unless needed to meet court-ordered inmate housing limits. It will ban California from incarcerating anyone in privately-run facilities altogether from 2028.\n\nThe measure, which passed the California legislature last month, does not apply to privately-owned prisons operated and staffed by the state corrections agency.\n\nNewsom said in a statement that he had vowed to abolish private prisons in the state when he took office in January “because they contribute to over-incarceration, including those that incarcerate California inmates and those that detain immigrants and asylum seekers.”\n\n“These for-profit prisons do not reflect our values,” Newsom said.\n\nSupporters of the bill have argued that private prisons are driven to maximize shareholder profits, lack proper oversight or incentives to rehabilitate inmates and have contributed to a culture of mass incarceration by making it cheaper to lock up people.\n\nA total of seven low-security facilities collectively housing more than 5,000 people are at stake, all of them operated either by Florida-headquartered GEO Group (GEO.N), or Tennessee-based CoreCivic (CXW.N).\n\nDefending their business model, the companies say they provided vital extra space when detentions in California’s prisons swelled to more than double the system’s capacity, sparking lawsuits that led to court-ordered cuts to inmate populations.\n\n“For 10 years, we provided safe, secure housing and life-changing re-entry programing for inmates that had faced extreme overcrowding,” CoreCivic spokeswoman Amanda Gilchrist said.\n\nSeparately, GEO Group cited its record as “an innovator in the field of rehabilitative services” and said the bill worked against the state’s goal of lowering inmate recidivism.\n\nDETENTION CENTERS TO CLOSE\n\nThe last three remaining privately-run prisons in California’s corrections system, housing a total of 1,400 inmates, are set to close in four years under the new law when their contracts with the state expire.\n\nPerhaps more significantly, the federal Immigration and Customs Enforcement (ICE) agency stands to lose four privately-run detention facilities holding roughly 4,000 people in California, unless the ban is challenged in court.\n\nOnce the law goes into effect detainees would be transferred to facilities outside California, ICE said in a statement.\n\nThe impact “would be felt almost exclusively by residents of California, who would be forced to travel greater distances to visit friends and family in custody,” ICE said.\n\nSeveral states, including New York, Illinois and Nevada, have adopted similar bans on private prisons, and nearly half of all states have no such facilities, said Kara Gotsch, director of strategic initiatives for the Sentencing Project, a criminal justice reform group.\n\nCalifornia’s share of inmates in private facilities is a small fraction of its total prison population of nearly 126,000.\n\nBy comparison, Texas, which became the first state to outsource incarceration to private companies in 1985, had far more inmates than any other state in for-profit facilities in 2017 at nearly 13,000, or 7.8 percent of its total, said Gotsch.", "description": "California moved to end the use of private, for-profit lockups in America's largest state prison system as well as in federal immigration detention centers in the state under a measure signed into law on Friday by Governor Gavin Newsom.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191011&t=2&i=1439850057&w=1200&r=LYNXMPEF9A25W", "published_at": "2019-10-11"}