{"pub": "yahoo", "url": "https://finance.yahoo.com/news/general-motors-strike-talks-uaw-214316846.html", "downloaded_at": "2019-09-26 07:52:47.913177+00:00", "title": "GM-UAW talks advance toward final phase, but break off for evening", "language": "en", "text": "The UAW told members Wednesday, on day 10 of the union's nationwide strike against General Motors, that talks had advanced, but then negotiators went home for the night.\n\nIn a letter sent to UAW members Wednesday afternoon, Terry Dittes, vice president for the UAW's GM Department, said UAW negotiators have been working \"countless hours\" to reach a tentative contract with GM.\n\n\"All unsettled proposals are now at the main table and have been presented to General Motors and we are awaiting their response,\" Dittes said in the letter. \"This back and forth will continue until negotiations are complete.\"\n\nBut people close to both sides said early Wednesday evening that talks had broken off for the day.\n\nDittes' letter does means subcommittee work is complete and bargainers are entering the final phase of negotiations. Talks ending for the night suggest that wide differences remain on big issues.\n\n\"We will continue to bargain the contract until your bargaining committee is satisfied that we have achieved an agreement that properly addresses our members' concerns,\" Dittes wrote.\n\nGM said, “We continue to talk and our goal remains to reach an agreement that builds a stronger future for our employees and our company.\"\n\nCan I still find the car I want?: How UAW's GM strike will affect availability of vehicles\n\n'Truly saved my life': GM workers on strike fight for benefits as automaker's profits soar\n\nUAW workers on strike against General Motors and other supporters walk the picket line outside of General Motors Detroit-Hamtramck on Wednesday, September 25, 2019 while waiting for Democratic presidential candidate Bernie Sanders to arrive for a brief stop to the auto plant. More\n\nAt 12:01 a.m. Sept. 16, about 46,000 UAW workers at GM facilities nationwide went on strike. The UAW had rejected GM's initial contract proposal made two hours before the old contract expired at midnight Sept. 14.\n\nSince then, bargainers have met daily, including over the weekend, from early morning until evening. It's the UAW's longest strike since 1985 when the union went out for 12 days against Chrysler, according to the Center for Automotive Research in Ann Arbor.\n\nFormer negotiators for GM and Fiat Chrysler Automobiles said the long strike as well as the evening recesses indicate the two sides still have a lot of unresolved issues to hammer out.\n\nUAW members have been angry over GM's decision last fall to idle four of its U.S. factories: Detroit-Hamtramck, Lordstown Assembly in Ohio, and transmission plants Warren and Baltimore.\n\nSources familiar with the initial offer by GM said it included a 2% wage increases in two of the contract's four years and 2% lump-sum payouts in the other years, an offer the union rejected. The 2015 contract provided a 3% wage increase and a 4% lump sum. Likewise, GM had asked for UAW workers to pay 15% of their health care costs, up from the 3% they currently pay. The union rejected that too, and GM walked it back to 3%.\n\nA major issue involves temporary workers. The UAW wants a pathway to make them permanent and give them better benefits along the way. Temporary workers make up 7%-10%, or 4,100, of GM's U.S. hourly workers. They often do the same work as permanent workers, but for less pay and fewer benefits, and they can remain classified as temporary for many years.\n\nGM wants to ensure its ability to tap a temporary workforce. Using lower-paid temporary workers saves money and gives GM flexibility to reduce staff when the market slows. Also, using more temps will allow GM to be more cost competitive with foreign-based companies that build vehicles in the United States.\n\nThe union, during the recession a decade ago, agreed to expanded hiring of temps by GM, Ford and what then was Chrysler. Those workers are paid $15-$18 an hour with no profit sharing, little time off and no job protection.\n\nRegarding the endangered factories, GM said it offered $7 billion in U.S. investment over the next four years. People familiar with the offer told the Free Press about half of the 5,400 jobs would be new and the rest to be counted in the total would be considered retained because of new investment. And, while the $7 billion would be invested in facilities with UAW representation, some would be joint ventures with contracts separate from the union's contract with GM.\n\nStory continues", "description": "All proposals are at the main table and \"back and forth will continue until negotiations are complete.\"", "authors": ["Jamie L. Lareau", "Detroit Free Press"], "top_image": "https://s.yimg.com/uu/api/res/1.2/BuV3RWJXCEW_0kcuwfYRuA--~B/aD00MDAwO3c9NjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_money_325/6cf137e356a9125239e80c144849ed07", "published_at": "2019-09-25"}