{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/beautiful-funny-cheerleader-21-found-20542330", "downloaded_at": "2019-10-09 08:29:47.284055+00:00", "title": "'Beautiful and funny' cheerleader, 21, found hanged in university bedroom", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA grieving mother has told of her agony after her \"beautiful and funny\" cheerleader daughter hanged herself despite showing no signs she was suicidal.\n\nMaths student Alexandra Wilshaw was rushed to intensive care after being discovered in her Durham University bedroom.\n\nBut tragically nothing could be done to save the 21-year-old, from Bourne in Lincolnshire. She was declared brain-dead and died last year on Monday, March 18, reports Lincolnshire Live.\n\nNow more than a year after her death, mum Carol Fowkes, 51, has described her pain and admits she felt as if she had failed Alexandra.\n\n\"We never knew there was anything wrong,\" said Ms Fowkes.\n\n(Image: Lincolnshire live WS)\n\n\"She used to be perfectly fine when we spoke to her over Facetime - I would ask her if anything was wrong and she would tell me that she was OK - she'd seem happy.\n\n\"You just wouldn't have known - she kept it all to herself. There were no signs at all.\"\n\nAlexandra, who had a boyfriend, was showing no signs of depression as she prepared for the next stage of her life.\n\nHowever, an inquest into her death heard that she was attending counselling sessions and had tried to kill herself previously.\n\nMs Fowkes added: \"She had struggled with anxiety and was on anti-depressants but you would never have thought that she would have done anything like that.\n\n\"It was four o'clock in the morning when I heard a knock on the door.\n\n\"The police arrived with my ex-husband. They told me that she [Alexandra] was in intensive care in Durham Hospital.\"\n\nAlexandra was \"always putting others first\" and even donated her organs after her death - helping to improve the lives of others.\n\n(Image: Lincolnshire live WS)\n\n\"She was really vibrant,\" Ms Fowkes continued.\n\n\"Really happy - she really did care about people. She did some tutoring in maths to GCSE students, she was in a cheerleading squad. Alexandra was a bubbly and outgoing girl - she was actually quite loud and funny.\n\n\"And she was beautiful.\"\n\nWith the support of her friends and family, Ms Fowkes has focused on raising as much money and awareness to try and make sure other parents don't go through the heartache she and her family have had to endure.\n\n\"The parents need to know,\" she said.\n\n\"I have spoken to other people from different universities and that's how they feel. I just wish I'd have know how Alexandra was feeling.\n\n\"She was just a lovely girl and she was turning into a lovely woman.\"\n\nMs Fowkes has set up 'Alexandra's Awareness Campaign' by working with the University.\n\nYou can donate here .\n\nFor confidential support, the Samaritans can be contacted for free around the clock 365 days a year on 116 123.", "description": "Alexandra Wilshaw, who was studying maths at Durham University, \"seemed happy\" before she tragically took her own life", "authors": ["Peter Hennessy", "Amber Hicks", "Image", "Lincolnshire Live Ws"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20542415.ece/ALTERNATES/s1200/0_PRIO-Beautiful-and-funny-cheerleader-21-was-found-hanged-in-her-room-at-Durham-University.jpg", "published_at": "2019-10-09"}