{"pub": "businessinsider", "url": "https://businesstimes.com.sg/energy-commodities/oil-rises-on-hopes-opec-will-extend-supply-cuts-weaker-us-dollar", "downloaded_at": "2019-10-16 23:14:12.137525+00:00", "title": "Oil rises on hopes Opec will extend supply cuts, weaker US dollar", "language": "en", "text": "Oil rose on Wednesday, gaining support due to signs that Opec and allied producers will continue to curb supplies in December, a weaker US dollar and as traders covered short positions ahead of an industry report on US crude inventories.\n\n[HOUSTON] Oil rose on Wednesday, gaining support due to signs that Opec and allied producers will continue to curb supplies in December, a weaker US dollar and as traders covered short positions ahead of an industry report on US crude inventories.\n\nBrent crude, the global benchmark, rose 68 cents, or 1.16 per cent, to settle at US$59.42 a barrel. US crude gained 55 cents, or 1.04 per cent, to settle at US$53.36.\n\nBut oil prices pared gains in post-settlement trade after industry data showed a larger-than-expected increase in US oil stocks. Brent edged lower to US$59.15, and WTI to US$53.07.\n\nUS crude inventories in the week to Oct 11 rose to 432.5 million barrels, according to the American Petroleum Institute's weekly report ahead of government stocks data due on Thursday. Crude stocks at the Cushing, Oklahoma, delivery hub rose by 1.6 million barrels, API said.\n\nsentifi.com Market voices on:\n\nAnalysts had estimated US crude inventories rose around 2.8 million barrels last week.\n\nThe Organization of the Petroleum Exporting Countries and its allies meet on Dec 5-6 in Vienna to review output policy.\n\nMarket participants believe the group known as Opec+ could decide to extend production cuts \"and wait until world demand catches up with the supply situation,\" said Andy Lipow, president of Lipow Oil Associates in Houston.\n\nOpec Secretary-General Mohammad Barkindo has said deeper output cuts are an option. On Tuesday, he said Opec would do what it could with allied producers to sustain oil market stability beyond 2020.\n\nOpec, Russia and other producers have agreed to cut oil output by 1.2 million barrels per day until March 2020.\n\n\"You did see the Opec secretary general say Opec could act to keep the market stable, and if we come back under pressure again we might see that again,\" said Gene McGillian, vice-president of market research at Tradition Energy in Stamford, Connecticut.\n\nIn early trading, prices had slipped because of concerns about weaker demand for fuel due to slower economic growth and forecasts of a further rise in US crude inventories.\n\nThe dollar weakened after US retail sales data disappointed investors. Oil is traded in US dollars, so oil typically rises when the dollar falls.\n\n\"The dollar is getting whacked right now. It is pushing into territory we haven't seen since a month ago,\" said Joshua Graves, senior market strategist at RJO Futures. \"If that continues to sell off, that will continue to boost oil prices.\"\n\nOn Tuesday, the International Monetary Fund fed worries about crude demand when it said the US-China trade war would cut 2019 global growth to its slowest since the 2008-2009 financial crisis.\n\n\"The market oversold yesterday on talk of a big build in inventory,\" said Phil Flynn, senior energy analyst at Price Futures Group in Chicago. \"We're seeing some short covering ahead of the (API) report tonight.\"\n\nOptimism about an imminent Brexit deal had supported prices, although this faded after EU sources said talks hit a standstill. Analysts have said any agreement that avoids a no-deal Brexit should boost economic growth and oil demand.\n\nREUTERS", "description": ": THE BUSINESS TIMES Energy & Commodities - [HOUSTON] Oil rose on Wednesday, gaining support due to signs that Opec and allied producers will continue to curb supplies in December, a weaker US dollar and as traders covered short positions ahead of an industry report on US crude inventories. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/17/nz_oiljack_070819_0.jpg?itok=IFcrw8JH", "published_at": "2019-10-16"}