{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/sportsnews/article-7576919/Sportsmail-experts-Martin-Keown-Mark-Clattenburg-react-sickening-scenes-Sofia.html", "downloaded_at": "2019-10-15 23:13:43.341417+00:00", "title": "Sportsmail experts - such as Martin Keown and Mark Clattenburg - react to sickening scenes in Sofia", "language": "en", "text": "England may have walked away from Bulgaria with a commanding 6-0 victory but unfortunately the result was last thing on everyone's minds on Monday night.\n\nThe Euro 2020 qualifier was marred by disgraceful scenes in Sofia as Bulgaria fans directed horrific racist abuse at England's black players - with the match having to be stopped twice.\n\nHere, Sportsmail has collated reaction to the sickening scenes in Sofia on Monday...\n\nEngland's 6-0 victory was marred by shameful racist abuse from Bulgaria fans on Monday\n\nMARK CLATTENBURG - WHO LET THEM BUY TICKETS?\n\nI remember refereeing Czech Republic v Croatia at Euro 2016 when I had to suspend the match because Croatia fans were throwing flares on to the pitch.\n\nWe had been warned about the possibility of this in our security meeting before kick-off, just as the officials on Monday would have been warned about the potential for racist incidents in Bulgaria. I had to halt the game in the 86th minute. I could have taken the players off, but decided to keep them out there.\n\nBy doing that, I didn't let those 'fans' win. I felt getting the game going again was the best way to handle the situation, and I agree with how the officials handled things on Monday.\n\nCroatian referee Ivan Bebek kept the players on the pitch — even though UEFA's three-step protocol says he should have taken them off — and it looked like most of the morons causing trouble left after the second stoppage.\n\nThose racists should never have been in the stadium in the first place. They should never have been allowed to buy tickets or gain entry.\n\nSo, where do UEFA go from here? There is no easy fix, but they have to look at who has access to tickets.\n\nI've seen calls for matches to be abandoned at the first instance of abuse. That would be a disaster and let the racists win.\n\nThe Bulgaria supporters should never have been allowed to buy tickets or gain entry\n\nMARTIN KEOWN - IT'S TIME TO BANISH BULGARIA\n\nWhen it comes to handling racist incidents, the feeling has long been UEFA's punishments do not fit the crime. Pitiful fines, part-stadium closures and so on.\n\nNow, UEFA are the ones on trial. They have to react in the right way. They have to take appropriate action and ban Bulgaria. Stand them down from this competition before they can play their final qualifier against Czech Republic.\n\nThe sanctions have to be of the highest order. I'd never seen racism of Monday's level inside a ground before. How can you run the risk of it happening again? If fans cannot act in a proper way, they cannot be trusted to be in the ground.\n\nThe president of the Bulgarian FA has already resigned, just hours after their prime minister called for him to step down.\n\nThe comments of the team's manager, Krasimir Balakov, who claimed he did not hear any racist chanting, were questionable, too. The level of denial was incredible.\n\nEngland's players and their manager, Gareth Southgate, were remarkably restrained and professional in the way they handled difficult circumstances.\n\nUEFA have their three-step protocol and that has been a long time coming.\n\nNow they have to show themselves to be leaders of change. React in the right way.\n\nBulgaria manager Krasimir Balakov (centre) claimed he did not hear any racist chanting\n\nCHRIS SUTTON - DENIAL IS A BIG DEAL\n\nMonday night in Sofia was depressing. The racist abuse raining down on England's black players was vile and Bulgaria manager Krasimir Balakov's reaction was laughable. He was the only one who didn't hear the monkey chants. He was in denial and denial is a huge part of the problem.\n\nMany on social media rightly condemned the appalling scenes but we also got the whataboutery brigade.\n\n'What do England and their fans expect? English fans have a reputation for xenophobia and violence.'\n\nMaybe there is some truth to these observations, but they miss the point. Just because our fans misbehave, do they deserve to get it back? It's kindergarten stuff, but it's how large swathes of people think. Whataboutery solves absolutely nothing.\n\nSerious change will only come when fans and society stop using history and the actions of others as excuses.\n\nWe cannot change the past but we can be ashamed of it and learn from it.\n\nTo move forward and rid the game of racism, sectarianism, sexism and abuse, we need to stop this blame game.\n\nWe all need to start taking responsibility for our own actions. That includes UEFA.\n\nThe racist abuse raining down on England's black stars during the Euro 2020 qualifier was vile\n\nJILL SCOTT - PLAYERS CAN SET RULES TO HALT BIGOTS\n\nI couldn't believe what I was watching on Monday night. The behaviour of those hurling abuse at England players was disgusting.\n\nWith emotions running high, it would have been difficult for the players to think logically and follow the three-step protocol, so you have to applaud the England squad and Gareth Southgate for how they handled it.\n\nIf it had happened during a Lionesses game, you would hope you could lead by example — but what is the right thing to do?\n\nFining teams and playing games in empty stadiums isn't working. Expelling nations from major competitions isn't the answer, either. Players dream their whole life about representing their country, so why should racist individuals take those dreams away from them?\n\nAnyone who racially abuses players should be dealt with by the police and given lifetime stadium bans.\n\nIt's a crime.\n\nIt's important that UEFA and FIFA speak to players and let them write their own protocol. It should be rolled out for everyone — and it shouldn't stop at football.\n\nRacism needs to be kicked out of life, not just football and not just sport.\n\nEngland and Gareth Southgate have to be applauded for how they handled the horrid scenes\n\nTROY TOWNSEND (KICK IT OUT'S HEAD OF DEVELOPMENT) - WEAK EURO CHIEFS SHOULD BE DITCHED\n\nIf the leaders of FIFA and UEFA continue to be weak in the face of this challenge, then I'm sorry, enough is enough. Your job should be taken away and we should get leaders who have this issue at the top of their agenda.\n\nRacism isn't even on their radar. They can say all the things they want at their conferences, big statements, put the onus on the officials — but this is their competition and I have no doubt what happened in Sofia will happen again.\n\nI would remind UEFA that, through what happened on Monday night, Bulgaria have shown a total lack of respect for their organisation, with some of their messages and chanting, and the T-shirts. That is devaluing the competition.\n\nWhen we see events like Monday night's, there have to be expulsions. Forget points deductions. One option would be to deny Bulgaria entry into the next edition of the Nations League and, if they don't meet certain recommendations between now and the start of the Euro 2024 qualifying campaign, throw them out of that competition, too.\n\nUEFA president Aleksander Ceferin says governments must do more. That's a deflection tactic. I do understand parts of that argument, but UEFA are not being effective in their own area, so I'll take his words with a pinch of salt.\n\nShow that you're doing something yourselves to try to improve the situation. Don't keep letting people off with paltry fines or non-acknowledgement of their actions. Don't stay silent when so many people are talking about this issue.\n\nPeople in the game have had enough. We're fed up listening to your statements where, ultimately, you're saying nothing.\n\nWhy did UEFA not make a statement about what had happened on the night of the game, instead of waiting until the following day? I'm not sure UEFA are strong enough to administer severe punishments but they are the minimum required now. Partial stadium closures, full stadium closures and fines don't matter.\n\nAre they brave enough to say to the Bulgarian FA that they won't participate in the Nations League?\n\nBulgaria either take that on board, or they don't.\n\nIf they don't, they should be eliminated.\n\nWould they even be missed?\n\nUEFA president Aleksander Ceferin says governments must do more to take a strong stance\n\nPAUL INCE - THREE STRIKES? IT HAS TO BE ZERO TOLERANCE\n\nI know UEFA had their protocol of one strike, two strike, three strikes and you're out, but racism should be zero tolerance.\n\nIt felt to me like a boxer and you get two free hits in the face and, on the third one, you are allowed to respond.\n\nI wasn't sure why we were waiting for the first one and the second one and even the third one in the second half. You could still hear the chants, it wasn't as prevalent as in the first-half but it was still there.\n\nThere has to be a stronger deterrent than minimal fines and temporary stadium closures.\n\nIt can't just be about fining them £50,000 or £100,000, that's not a deterrent for me.\n\nThe only way UEFA can do that with these teams is getting them banished from playing in European competitions.\n\nInterviews by Kieran Gill, Claire Bloomfield, Nathan Salt and Tom Collomosse", "description": "England may have walked away from Bulgaria with a commanding 6-0 victory but unfortunately the result was last thing on everyone's minds on Monday night.", "authors": ["Sportsmail Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/21/19758496-0-image-a-50_1571172509577.jpg", "published_at": "2019-10-15"}