{"pub": "guardian", "title": "Monday briefing: No simple backstop alternatives, secret file warns", "url": "https://theguardian.com/world/2019/sep/02/monday-briefing-no-simple-backstop-alternatives-secret-file-warns", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 07:12:44.401711+00:00", "text": "Top story: ‘There isn’t a proper negotiation going on’\n\nHello, Warren Murray with you as we march forward into the week.\n\nLeaked government papers suggest all potential alternatives to the Irish border “backstop” are fraught with difficulty and would leave smaller businesses struggling to cope post-Brexit. The dossier marked “official-sensitive” counters the PM’s claim there are “abundant” solutions to avoid a hard border. It shows findings of all advisory groups informing the government on the Irish border are being kept deliberately under wraps while Boris Johnson tries to get a deal without the backstop.\n\nDozens of Conservatives are being threatened with deselection if they break with the government and back legislation to prevent no deal. A source close to the threatened MPs said: “This is sheer hypocrisy. Almost a quarter of the current cabinet have voted against the party whip. But this is about the national interest, and we’ve moved beyond the point where threats will persuade people to abandon their principles.” Government sources conceded that losing the MPs’ votes could force Johnson to an election. KPMG has warned UK house prices could crash by as much as a fifth if Boris Johnson pursues a no-deal Brexit, with the biggest falls London and Northern Ireland.\n\n‘Catastrophic’ Dorian – Hurricane Dorian has struck the Bahamas as a “catastrophic” category 5 storm bringing winds of more than 180mph (290km/h). It is the equal strongest Atlantic hurricane to make landfall on record, tying with the 1935 Labor Day hurricane.\n\nPlay Video 1:25 Hurricane Dorian wreaks havoc on Bahamas as 'catastrophic' Category 5 storm – video\n\nIn the Bahamas hundreds of people sheltered in schools, churches and other refuges as authorities made a last-minute plea for those in low-lying areas to evacuate. Dorian is not predicted to make landfall in the US but is still expected to cause danger for Florida, Georgia and the Carolinas in the coming days. We have been covering the situation live.\n\nCancer found too late – At least 115,000 cancer patients a year in England are diagnosed when their best chance of survival has passed, partly because of a chronic lack of skilled NHS diagnostic staff, says Cancer Research UK. One in 10 diagnostic posts are vacant and although survival has improved, “it’s not happening fast enough”, said Emma Greenwood from CRUK. The government wants three-quarters of cancers to be picked up early by 2028 and CRUK says many more will have to be caught at stages 1 and 2 to hit the target.\n\nRail delays – A four-day strike will continue to affect South Western Railway (SWR) services today. The company is in dispute with the Rail, Maritime and Transport workers’ union (RMT) over the union’s wish to keep a guard on every train. SWR said it planned to run just over half its normal timetabled services over the course of the strike, which is expected to affect services up to Tuesday morning. Some trains will be cancelled, others replaced with buses and fewer services will run into London Waterloo station.\n\nCall for climate crisis funding – Britain’s biggest environmental groups and charities have warned the government it must double funding to tackle the climate emergency from next year to avoid ecological catastrophe in the future. Greenpeace, Friends of the Earth, Oxfam and Christian Aid are among those calling for at least £42bn to be allocated over the next three years. It is equivalent to about 2% of economic output each year and 5% of total state spending. Among priorities they list are an £11.6bn expansion in transport spending, including a UK-wide car scrappage scheme to remove polluting vehicles, as much as £2.6bn per year for rewilding projects and land management, and billions for sustainable buildings and industry.\n\nTeacher pay boost confirmed – Salaries of newly qualified teachers could rise to £30,000 within four years, the government has said, confirming reports by the Guardian. As part of plans to increase recruitment and improve the status of the profession, the government has said it will fully fund higher payments into the teachers’ pension scheme. The National Education Union also wants the government to reinstate statutory pay progression to help retain experienced teachers. Elsewhere in the public finances, the benefits freeze has left a third of those affected with less than £100 a month to live on after paying for rent and life’s essentials, says Citizens Advice. The government says there are no plans for the freeze to go beyond March 2020.\n\nPeaky district – Birmingham attracted a record number of tourists in 2018 as fans of Peaky Blinders flocked to explore the world associated with the BBC gangster series. The UK’s second-largest city and the wider West Midlands region are becoming significant beneficiaries of the growing phenomenon of so-called “screen tourism”, where fans base a holiday on visiting locations related to popular films and TV shows. The TV show isn’t shot in Birmingham – streets in Greater Manchester and Liverpool are used, but the Black Country Living Museum in Dudley has been a staple filming location in all five series.\n\nToday in Focus podcast: The man who gave birth\n\nFreddy McConnell is a Guardian journalist and trans man who in 2016 decided to begin the process of conceiving and delivering a child. The film he made about the experience is in cinemas now. And: Andrew Rawnsley on the anniversary of the second world war.\n\nToday in Focus Giving birth as a man Sorry your browser does not support audio - but you can download here and listen https://audio.guim.co.uk/2019/08/30-64985-20190902_TIF_Freddy.mp3 00:00:00 00:27:57\n\nLunchtime read: Epic jail\n\nBoris Johnson’s announcement of 10,000 extra prison places comes at a time when jails are beset by overcrowding, drug use, mental illness and self-harm. Deaths have risen by 20% in less than a year, amid such squalor that a Dutch court recently refused to extradite a prisoner to England because of “inhumane and degrading” conditions. A revolution was promised when HMP Berwyn in Wales was opened – but cost-cutting and compromise have made it the most expensive jail per prisoner in England and Wales, when it was meant to be one of the cheapest, while the conditions are stark, the rate of violence is among the country’s worst, and it is not even full yet.\n\nFacebook Twitter Pinterest CGI of the proposed HMP Wellingborough visitor centre. Photograph: Bryden Wood\n\n“It is against this bleak backdrop that the Ministry of Justice has allowed architects Bryden Wood to promote their plans for HMP Wellingborough, a £253m 1,600-capacity prison currently under construction in Northamptonshire,” writes Oliver Wainwright, the Guardian’s architecture critic. “The designs have done away with Victorian-style gallery cell blocks, removed the bars from windows, and arranged the cells in smaller groups around landscaped courtyards … These details aside, however, it looks very much like business as usual: endless warehouse-like sheds punctuated by tiny square windows, forming an institutional assembly line for inmates to be processed like Amazon parcels. So are we stuck with a template basically unchanged since the publication of Hints for the Improvements of Prisons in 1817, which prescribed that the buildings should be “made as gloomy and melancholy as possible”?\n\nSport\n\nMauricio Pochettino felt that Tottenham recovered their togetherness during Sunday’s helter-skelter 2-2 draw at Arsenal after a difficult start to the season and a raft of problems behind the scenes. Johanna Konta conquered her nerves and her opponent, Karolina Pliskova, in three compelling sets to become the first British woman to reach the quarter-finals of the US Open since Jo Durie 36 years ago. Serena Williams eased through a potentially tricky fourth-round meeting with Petra Martic, while Roger Federer comfortably beat David Goffin, winning 6-2, 6-2, 6-0 against the player who grew up idolising him. Charles Leclerc described his maiden Formula One victory as the realisation of a childhood dream but one that he would find difficult to enjoy after the death of his friend Anthoine Hubert. Eddie Hearn has called for the introduction of VAR into British boxing after video replays came to the rescue of the WBC flyweight champion Charlie Edwards. The England midfielder Jade Moore has expressed frustration that poor scheduling is stunting preparations for the new Women’s Super League season. And Western Storm have become the first team to win the Kia Super League title twice, repeating their feat from 2017 against the same opposition as they once again pipped Southern Vipers at the post.\n\nBusiness\n\nGlobal stock prices have fallen after the US and China imposed new tariffs on each other’s goods. Tokyo and Hong Kong declined. MSCI’s broadest index of Asia-Pacific shares outside Japan dropped 0.3% led by the drop in the Hang Seng after another weekend of violent anti-government protests. Mainland Chinese shares fared better, with the CSI300 index rising 0.3% despite the trade row escalation. At the time of writing the pound is worth $1.215 and €1.106 while the FTSE looks like opening higher.\n\nThe papers\n\nThe Guardian leads with “Johnson ready to sacrifice majority by withdrawing whip from rebels”. The Telegraph has “PM warns rebel MPs: back me or be sacked”. The Times’ headline is “I’ll kick you out of the party, Johnson tells Tory rebels”. The FT zeroes in on what a Corbyn government might do: “Labour would cost UK companies £300bn by shifting shares to staff”, as it predicts an election is “likely” amid Brexit turmoil.\n\nFacebook Twitter Pinterest Guardian front page, Monday 2 September 2019.\n\nThe Express leads on the PM’s threat to Tory MPs who don’t toe his line: “Boris vows to boot out Brexit rebels”. The Mail echoes the Telegraph: “Back me or I’ll sack you”. The i has “Fury at Gove warning on Commons no-deal vote”.\n\nThe Mirror and the Sun sidestep Brexit. “Brits kill monkeys for ‘fun’” is the Mirror’s headline – it reports on what it calls “trophy hunt scandals” where tourists are killing animals “on sick safaris”. The Sun leads on Kellie Maloney’s revelation that she attempted suicide after missing her former life as a male boxing promoter: “Kellie: I overdosed because I missed being Frank”.\n\nSign up\n\nThe Guardian Morning Briefing is delivered to thousands of inboxes bright and early every weekday. If you are not already receiving it by email, you can sign up here.\n\nFor more news: www.theguardian.com", "description": "Fury as Tory rebels are threatened with deselection … Hurricane Dorian sweeps across Bahamas … and Britain’s bleak Victorian mindset about jails", "authors": ["Warren Murray"], "top_image": "https://i.guim.co.uk/img/media/b687625757869d2d8a837bd5e37b400c03b65c8a/0_22_2216_1330/master/2216.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=19924d536c9d2aa7a735f50b659cef39"}