{"pub": "yahoo", "url": "https://news.yahoo.com/sterling-slips-investors-await-brexit-082806837.html", "downloaded_at": "2019-10-18 08:53:06.041302+00:00", "title": "Sterling slips as investors await Brexit showdown", "language": "en", "text": "* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh\n\n* Graphic: Trade-weighted sterling since Brexit vote http://tmsnrt.rs/2hwV9Hv\n\nBy Elizabeth Howcroft\n\nLONDON, Oct 18 (Reuters) - The pound retreated on Friday morning, as relief that a Brexit deal had been agreed was replaced by doubts the proposed deal will get through the British parliament in Saturday's vote.\n\nThe pound held at five-month highs of $1.2874 against the dollar, down from Thursday's peak of $1.2988. It was little changed against the euro, at 86.28 pence.\n\nNews of the Brexit deal sent the pound soaring on Thursday. But sterling erased the gains before UK Prime Minister Boris Johnson's next challenge: getting the deal approved in parliament, where he has no majority.\n\nThe Democratic Unionist Party, the Northern Irish party that props up Johnson's government, said it will not vote for the deal.\n\n\"(The pound is) reflecting pessimism over the likelihood of whether the deal will be able to pass through parliament tomorrow,\" said Lee Hardman, currency analyst at MUFG. \"We think it's going to be a close call. We're a little more optimistic.\n\n\"If it's rejected you might get a knee-jerk pound selloff, but we don't think the downside risks are that great. We think there'd be an extension and an election. We don't see no-deal risks coming back to the market.\"\n\nMembers of parliament will vote on the deal on Saturday - the first Saturday session since 1982. Britain's scheduled departure date from the European Union is Oct. 31.\n\n\n\n\n\n\n\nThe most decisive move on Friday would be a change in the DUP's position, but that looked unlikely, MUFG's Hardman said. Opposition Labour Party leader Jeremy Corbyn has also said he could not support the deal.\n\nUnderscoring that the market is on alert for further wild swings in the pound, options linked to volatility expiring within the next week have more than doubled in price since last Friday.\n\nImplied overnight volatility on sterling rose to more than 18%, a new seven-month high.\n\n(Editing by Larry King)", "description": "The pound retreated on Friday morning, as relief that a Brexit deal had been agreed was replaced by doubts the proposed deal will get through the British parliament in Saturday's vote.  News of the Brexit deal sent the pound soaring on Thursday.  The Democratic Unionist Party, the Northern Irish", "authors": ["Elizabeth Howcroft"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-18"}