{"pub": "nytimes", "url": "https://nytimes.com/2019/10/26/opinion/sunday/trump-civil-service-deep-state.html", "downloaded_at": "2019-10-27 11:57:44.342122+00:00", "title": "Opinion | The ‘Deep State’ Exists to Battle People Like Trump", "language": "en", "text": "The swamp of scandal propelled a fed-up cadre of young reformers into action. Boldest and brashest was a patrician New York State assemblyman named Theodore Roosevelt. Government could never work properly until a professional civil service replaced cronyism, Roosevelt declared. “The spoils system of making appointments to and removals from office is so wholly and unmixedly evil, is so emphatically un-American and undemocratic, and is so potent a force for degradation in our public life that it is difficult to believe that any intelligent man of ordinary decency who has looked into the subject can be its advocate.”\n\nA healthy dose of elitism drove Roosevelt’s crusade, as the spoils system had been the path to power for immigrant-driven political machines in big cities like New York. Yet the Civil Service laws he and others created marked the beginning of a shift toward a fairer, less corrupt public realm. By early 1883, reformers in Congress had pushed through landmark administrative reform that abolished “assessments” and instituted a merit-based system of public appointments. Roosevelt helped pass the nation’s first state-level Civil Service law in New York State later that year.\n\nFirst as Civil Service commissioner and then as president, Roosevelt pushed to eradicate the spoils system. By the time he left the White House in 1909, the majority of federal jobs were merit-based career posts.\n\nProfessionalization expanded in the decades that followed. Creation of the Foreign Service established a rigorous entry examination and raised pay. The diplomatic corps was no longer limited to rich young men with time and family money to take overseas postings. The Hatch Act placed sweeping restrictions on political activity by government officials, including the president’s political appointees. Merit-based hiring diversified the work force, making the career Civil Service outpace the private sector in representation of women and minorities, especially in executive roles.\n\nEven before the current moment, however, a backward slide had begun. The expertise of government specialists sank in value amid simmering anti-establishment sentiment. A Republican Party that had built the Civil Service now turned against it. As Ronald Reagan put it, “the nine most terrifying words in the English language are: I’m from the government, and I’m here to help.”\n\nDuring both Democratic and Republican administrations, budget cuts stripped away professional staff from departments and regulatory agencies. Government shutdowns furloughed millions of career workers.", "description": "A merit-based system for hiring federal employees was created in reaction to the rampant corruption of the Gilded Age.", "authors": ["Margaret O Mara"], "top_image": "https://static01.nyt.com/images/2019/10/27/opinion/27Omara-03/27Omara-03-facebookJumbo.jpg", "published_at": "2019-10-26"}