{"pub": "cbs", "title": "Iran admits rocket exploded after technical malfunction", "url": "https://cbsnews.com/news/iran-admits-rocket-exploded-after-technical-malfunction", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:06:05.626623+00:00", "text": "Iran acknowledged for the first time on Monday that a rocket at its Imam Khomeini Space Center exploded after satellite photos showed the blast last week. An official said a technical malfunction during a test caused the explosion.\n\nThe comments by government spokesman Ali Rabiei were the first explanation offered by Iran for Thursday's explosion, which came ahead of a planned satellite launch by the Islamic Republic that the U.S. has criticized.\n\nThe explosion marked the third failure involving a rocket at the Iranian center, which has raised suspicions of sabotage in Iran's space program. But Rabiei dismissed this idea, saying that \"this has been a technical matter and a technical error. Our experts unanimously say so.\"\n\n\"The explosion happened at the launchpad and no satellite had yet been transferred to the launchpad,\" Rabiei said. \"It happened at a test site, not at the launch site.\"\n\nCommercially available satellite images by Planet Labs Inc. and Maxar Technologies showed a black plume of smoke rising above a launch pad Thursday, with what appeared to be the charred remains of a rocket and its launch stand. In previous days, satellite images had shown officials there repainted the launch pad blue.\n\nRabiei also criticized President Trump for tweeting what appeared to be a surveillance photo of the aftermath of the explosion shot by a U.S. spy satellite.\n\nPresident Trump tweeted out this image along with the text, \"The United States of America was not involved in the catastrophic accident during final launch preparations for the Safir SLV Launch at Semnan Launch Site One in Iran. I wish Iran best wishes and good luck in determining what happened at Site One.\" Twitter/Donald Trump account\n\n\"We don't understand why the U.S president tweets and posts satellite pictures with excitement. This is not understandable,\" he said. \"Maybe this is because lack of Iran-related subjects that they raise such issues.\"\n\nThe photo released Friday by Mr. Trump appeared to be a once-classified surveillance photo from American intelligence agencies. Analysts said the black rectangle in the photo's upper-left-hand corner likely covered up the photo's classification.\n\nThe image showed damaged vehicles around the launch pad, as well as damage done to the rocket's launcher. It also clearly showed a large phrase written in Farsi on the pad: \"National Product, National Power.\"\n\n\"The United States of America was not involved in the catastrophic accident during final launch preparations for the Safir SLV Launch at Semnan Launch Site One in Iran,\" the president wrote in his tweet, identifying the rocket used. \"I wish Iran best wishes and good luck in determining what happened at Site One.\"\n\nThe blast followed two failed satellite launches of the Payam and Doosti in January and February. A separate fire at the Imam Khomeini Space Center in February also killed three researchers, authorities said at the time.\n\nOver the past decade, Iran has sent several short-lived satellites into orbit and in 2013 launched a monkey into space. Iran is preparing to launch the Nahid-1, a communication satellite, into space.\n\nThe U.S. alleges such satellite launches defy a U.N. Security Council resolution calling on Iran to undertake no activity related to ballistic missiles capable of delivering nuclear weapons.\n\nIran, which long has said it does not seek nuclear weapons, maintains its satellite launches and rocket tests do not have a military component. Tehran also claims it hasn't violated the U.N. resolution because it only \"called upon\" Tehran not to conduct such tests.\n\nThe tests have taken on new importance to the U.S. amid the maximalist approach to Iran taken by President Trump's administration. Tensions have been high between the countries since Mr. Trump unilaterally withdrew the U.S. from Iran's nuclear deal over a year ago and imposed sanctions, including on Iran's oil industry. Iran recently has begun to break the accord itself while trying to push Europe to help it sell oil abroad.", "description": "This is the third failed rocket launch for Iran this year", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/08/30/bb0f7afd-cec3-4b1f-91f0-b0f4b46218e7/thumbnail/1200x630/4353de93797da95a20c48bd7a45f0e9c/screenshot-2019-08-30-15-32-05.png"}