{"pub": "businessinsider", "url": "https://businessinsider.com/sc/how-qatar-evaluates-solutions-to-harvest-solar-energy-2019-10", "downloaded_at": "2019-10-20 00:19:34.127988+00:00", "title": "This is how Qatar is finding unique ways to harvest solar energy", "language": "en", "text": "Solar energy has always been in the sights of Qatar's planners. With some summer months producing more than 14 hours of daylight with minimal cloud cover, it would only be natural to look to the sun for energy. When the Qatar Environment and Energy Institute (QEERI) first began to consider a solar option for the country they naturally looked to the US and Europe for the most advanced technology. The underlying challenge of solar and wind energy has been storage: How to provide continuous energy when the sun goes down or the wind stops blowing. Batteries that can store power do not necessarily have to look or act like the same sort of D-cell you put in your flashlight.\n\nThe state of Arizona in the US has a renewable policy that mandates that at least 15% of electricity comes from renewable resources and, like Qatar, it's not an ideal environment for wind energy. Early in this century, solar scientists began focusing on researching the potential of concentrated solar power (CSP) for electrical generation. In 2013, one of the biggest CSP plants in the world started operating 100 km from Phoenix, the largest city in the state. By using arrays of thousands of parabolic mirrors intense sunlight is concentrated on a tower in the middle of the facility that contains molten salt at a temperature of 800 degrees Celsius. This molten reactor is used to power two steam generators that provide power to more than 70,000 homes in Phoenix. The molten salt is, in effect, a storage battery because the retained heat can still power the generators long after the sun has gone down.\n\nThe leading innovator in CSP technology is Spain. In fact, a Spanish engineering firm built the CSP plant in Arizona and has successfully replicated the experiment in North Africa, India, and China and has a few prototype demonstrators in southern Spain. CSP technology would be a promising technology for future developments provided the electricity production costs are reduced, due to its capacity to integrate storage and to produce electricity 24 hours a day. However, CSP technology faces some barriers in Qatar's desert environment. There's a reason for that which is best addressed by a Spanish energy scientist who oversees the Solar Testing Facility that QEERI runs at the Qatar Science and Technology Park (QSTP), a member of Qatar Foundation Research, Development and Innovation.\n\n\"For a CSP plant to work effectively it has to be built in an area that has excellent direct normal irradiance (DNI),\" says Dr. Veronica Bermudez, senior research director and energy center director at QEERI. \"Arizona and Spain both have clear blue skies which is a sign of excellent DNI with high irradiation levels. Qatar, on the other hand, has relatively poor direct radiation from the sun due to a wide aerosol and high diffuse atmosphere. This relatively low DNI leads to a reduced conversion efficiency limiting the potential economic competitivity behind CSP being more expensive than conventional solar panel arrays combined with battery systems.\"\n\nCSP-generated electricity cannot compete with power generated from photovoltaic solar panels, which is the subject of QEERI's comparative studies. The growth in the solar panel industry and falling prices equate to lower production costs, and photovoltaics can deliver energy in places where CSP can't because they can produce power from diffuse radiation.\n\nDuring the past seven years, the Solar Testing Facility at QSTP has tested and monitored 23 different types of solar energy technology. In Qatar's harsh summer climate, it takes a more robust technology to withstand the unique elements that can affect the performance of any instrumentation that is operating outside of a controlled environment.\n\n\"Qatar is a unique environment where challenges can be transformed into opportunities. There are unique combinations of corrosive effects, not only from the particulate matter in the atmosphere, but the humidity is detrimental as is the salinity in the atmosphere and the extreme temperatures. The DNI quality is poor due to a combination of these factors,\" says Dr. Bermudez.\n\n\"Our job is not only to determine the most efficient and cost-effective technology to harvest solar energy but also to figure out the most efficient use of that energy,\" she says. \"Although solar is more environmentally sustainable than electricity produced from gas fired turbines, we have to worry about excess capacity and what to do about that. Solving the puzzle of where and how to fit renewables into the energy mix in Qatar is one of our biggest challenges.\"\n\nFind out more about Qatar's work in solar energy.\n\nThis post was created by Qatar Foundation with Insider Studios.", "description": "The Qatar Environment and Energy Institute performs evaluations of solar technologies to harvest the most solar energy.", "authors": ["Sponsor Post", "Created Qatar Foundation With Insider Studios"], "top_image": "https://image.businessinsider.com/5da66f954af9095bae39b9d3?width=1200&format=jpeg", "published_at": "2019-10-18"}