{"pub": "cbs", "url": "https://cbsnews.com/news/democrats-formally-scrap-proposed-virtual-caucus-plans", "downloaded_at": "2019-09-07 02:23:08.776950+00:00", "title": "Democrats formally scrap proposed \"virtual caucus\" plans", "language": "en", "text": "The Democratic National Committee's rules committee on Friday voted to accept a recommendation from the DNC security team to officially scrap the \"virtual caucus\" plans Iowa and Nevada proposed.\n\nThe Rules and Bylaws Committee (RBC) will reconvene within the next two weeks to discuss options Iowa can implement to fulfill the DNC requirement to increase participation.\n\nThe DNC Security Team recommended last week that Iowa and Nevada scrap the virtual caucus plans they had proposed because of concerns with the technology. The states had proposed allowing voters to participate by voting over the phone instead of in person on caucus day.\n\nThe security team wrote a letter to the co-chairs of the RBC committee that said no technology exists that is secure or reliable enough to make virtual caucuses feasible this cycle. The members of the RBC voted in favor of scrapping the virtual component on a conference call Friday afternoon.\n\nNevada's plan will likely not have to institute many changes because their plan called for an additional four days of early-voting for people who can't participate in the in-person caucuses. Nevada can institute this primary-like measure because the state does not of hold the first presidential nominating contest, and therefore doesn't threaten New Hampshire's status as the first formal primary.\n\nIowa Democratic Party Chair Troy Price says he is still working to find a solution to expand absentee access to the caucuses, keeping in mind caucus day is less than five months away. Iowa is cautious of instituting measures that make their nominating process look too much like a primary because it could create a potential calendar conflict with New Hampshire, which is required by state law to hold the first primary.\n\nIf the state party cannot determine a workable solution to expand access, they can ask for a waiver that exempts Iowa from the requirement.\n\n\"The principal reason for considering a waiver request favorably, if we were to get one, would be so that the calendar can remain in place,\" RBC co-chair Jim Roosevelt said.\n\nPrice said he was disappointed in the DNC's recommendation because the state parties \"have worked tirelessly over these last few months on this proposal\" and dedicated \"more than a year of work before it was even proposed.\"\n\nArtie Blanco, an RBC committee member from Nevada, recommended that during the next cycle the DNC work with the state parties on delegate plans because the state parties committed countless hours to the plans without \"any real tangible guidance from the DNC.\"\n\nThe committee members expressed a need for a DNC task force in the next cycle to work with states to understand the extent of threats from outside actors and create secure infrastructure.\n\n\"We are fighting an effort to undermine confidence in the democratic system and that's why we have to be cautious,\" Roosevelt said.\n\nNow, some Iowa Democrats who were planning to participate in virtual caucuses are left wondering how they'll be able to caucus. Michelle Charron from Des Moines said she was excited when she first learned about virtual caucusing because she moves away from Iowa in the winter. Now she is considering traveling back.\n\n\"I could see myself flying back just for the caucus, especially if it looks like Trump has a good chance of winning 2020,\" Charron said. \"I would definitely want to caucus to prevent that.\"", "description": "Nevada and Iowa had proposed allowing voters to participate by voting over the phone instead of in person on caucus day", "authors": ["Eleanor Watson", "Adam Brewster"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2017/02/25/65ed909d-e78b-4076-80e6-56efee1a5475/thumbnail/1200x630g2/c0ea67d66fe0161aa856148a7b23cdf4/2017-02-11t215145z-1812599351-rc1a14e12870-rtrmadp-3-usa-politics-democrats.jpg", "published_at": "2019-09-06"}