{"pub": "thenextweb", "url": "https://deals.thenextweb.com/sales/complete-microsoft-azure-certification-prep-bundle-2019/?utm_source=thenextweb.com&utm_medium=dealfeed&utm_campaign=/sales/complete-microsoft-azure-certification-prep-bundle-2019", "downloaded_at": "2019-10-08 05:13:04.646942+00:00", "title": "Complete Microsoft Azure Certification Prep Bundle 2019", "language": "en", "text": "Most companies are implementing or investigating how to implement cloud technologies within their operations. Now's the time to take advantage of this booming career. According to Microsoft, Azure is being used by 85% of the Fortune 500 companies while salary estimates for Azure Architects are between $130,000 and $170,000. Get in the game by getting Microsoft Azure certified, and be ready for the opportunity to advance your career! This course goes through all of the skills needed to take and pass the Microsoft certification exam, AZ-100 exam: Microsoft Azure Infrastructure and Deployment, as well as AZ-103, which will be replacing the AZ-100 exam later in 2019.\n\nInstructor\n\nScott Duffy loves making complex technical topics easy to understand. This has been the basis of his entire career – as a developer, as a development manager, as a software architect – over the past 20 years. He spends half his time in the world of business, explaining complex technical topics to business owners and stakeholders so that they can understand and agree with his approach to solving their business problems with technical solutions. The other half he spends with developers, explaining the business reasons behind decisions and ensuring that any decisions made on the technical side don't restrict the business in unexpected ways.Scott started teaching courses in 2014, and has taught over 50,000 students. He is a certified Azure developer and architect, and has been developing with Microsoft technologies for 20 years, starting with Classic ASP, and all the versions of .NET. We now live in the cloud era, with Microsoft Azure being prevalent in most large enterprises.", "description": "", "authors": [], "top_image": "https://cdnp2.stackassets.com/2de045f5c08675c61ee700230f0604fdd2e3e557/store/385003e89ed9c8e0938a35490994921cbd3a1c1ecde92e3f84376549f152/sale_18127_primary_image.jpg", "published_at": "2019-10-08"}