{"pub": "afr", "url": "https://afr.com/brand/life-and-leisure/what-it-s-like-to-stay-at-taronga-zoo-s-new-luxury-resort-20191011-p52zs3", "downloaded_at": "2019-10-22 13:32:51.459699+00:00", "title": "What it's like to stay at Taronga Zoo's new luxury resort", "language": "en", "text": "Lauren Sams Luxury Editor Updated Oct 22, 2019 — 10.32am , first published at 10.30am Share\n\nThe best way to adjust to the slower pace of life at Taronga Zoo’s new Wildlife Retreat is to take your cues from one of its permanent residents, Robbie the echidna.\n\nAt 30, Robbie is ready for retirement after a life on the road with the zoo’s Zoomobile program. Luckily for him, Taronga has the perfect place for him to take a breather – the new sanctuary within the retreat. Watching Robbie as we’re guided through the space, nestled within the confines of the 62-room luxury accommodation, is a study in mindfulness.\n\nIt's difficult to imagine you're not that far from the city's CBD. Rick Stevens\n\nRobbie walks slowly, eats slowly, he lives slowly. Nothing seems to bother him – even the small group of children clustered around him as he has his afternoon tea – and that’s exactly the point. Rich in native flora like kangaroo paws and bottlebrush, this is a place to relax.\n\nLocated behind the zoo’s long-established function centre, the Wildlife Retreat is a step up (and then some) from its Roar and Snore offering. From the moment you set foot in the beautifully appointed N’gurra Lodge (where you’re welcomed with a rosehip iced tea – or something stronger, should you wish) to the daybreak walk the following morning (with coffee served in eco-friendly cups) to see the elephants wake up and the zoo at its most tranquil, everything about the retreat is exactly as the name suggests: a true break from the outside world.\n\n“We wanted to do something really tasteful,” says Taronga CEO Cameron Kerr.\n\n“The catalyst for the Wildlife Retreat was the success of Roar and Snore and Zoofari at Western Plains,” says Taronga chief executive Cameron Kerr. “Demand simply outstripped supply.”\n\nWhat’s more, he says, when guests stay overnight at the zoo, they form more meaningful connections with the wildlife, which translates into behavioural changes at home. “We know overnight stays are a really powerful tool for engaging with the community.”\n\nCreature comforts are a big element of the experience. Rick Stevens\n\nTaking the retreat to the next level in terms of luxury was high on Kerr’s agenda. “We wanted to do something really tasteful,” he says. “We don’t have a lot of the things that other hotels have – a pool, for instance. But we put a lot of thought into making it beautiful.”", "description": "Koalas, wallabies and echidnas are all part of the package at Sydney's newest luxury resort, Taronga’s Wildlife Retreat, where your room comes with a zoo.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2132%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_41/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/a758c6193f7b00224d8c2b1fbbf1e1e60de6b7bf", "published_at": "2019-10-11"}