{"pub": "heritage", "url": "https://heritage.org/press/heritage-experts-federal-tax-credit-scholarship-proposal-could-reverse-school-choice-gains", "downloaded_at": "2019-09-04 04:08:27.525194+00:00", "published_at": "2019-09-04", "title": "Heritage Experts: Federal Tax-Credit Scholarship Proposal Could Reverse School Choice Gains", "language": "en", "text": "Today, some members of Congress and the Education Department unveiled a proposal to set up a nationwide federal tax-credit scholarship program. But Lindsey Burke, director of The Heritage Foundation’s Center for Education Policy, and Adam Michel, a senior policy analyst in the Grover M. Hermann Center for the Federal Budget, warned such a proposal could reverse the nation’s school choice gains and recent tax policy reforms.\n\n“It’s wonderful that the Administration wants to advance school choice but a nationwide federal tax-credit scholarship program is the wrong way to do it. This could open the door for further education regulations down the road that neutralize the advantages of private education as well as impede future tax reform efforts.\n\n“Future administrations could use a federal tax-credit scholarship to require that schools adhere to certain admissions and accountability policies. That would mean the federal government could further dictate testing, reporting, academic content, and even bathroom policies for all schools involved.\n\n“This proposal is also outside of the federal government’s jurisdiction. It would grow, rather than reduce, federal intervention in education. It would be better for the Education Department to keep highlighting the great advances that states have made in school choice.”\n\n“Furthermore, the federal tax code is an inappropriate place to intervene in state education policy. This program would complicate tax filing and undermine the important goals of the 2017 tax reform, which worked to remove subsidies and simplify taxpaying for Americans.\n\n“If the Administration along with Congress want to advance education choice for families, they should focus more on military-connected children, Native American students, and students in the District of Columbia. Heritage has documented how education savings accounts for military-connected children could be a useful readiness and retention tool for the military.”\n\n", "description": "Today, some members of Congress and the Education Department unveiled a proposal to set up a nationwide federal tax-credit scholarship program. But Lindsey Burke, director of The Heritage Foundation’s Center for Education Policy, and Adam Michel, a senior policy analyst in the Grover M. Hermann Center for the Federal Budget, warned such a proposal could reverse the nation’s school choice gains and recent tax policy reforms.", "authors": [], "top_image": "https://www.heritage.org/themes/heritage/src/images/bell.png"}