{"pub": "cnbc", "url": "https://cnbc.com/2019/10/01/us-news-world-report-10-highest-paying-lowest-stress-jobs.html", "downloaded_at": "2019-10-02 00:33:40.509383+00:00", "title": "The highest-paying low-stress job in the US pays $208,000 a year", "language": "en", "text": "If you want a job with healthy work-life balance and above-average pay, a field that explores human behavior, culture and history might be the right move.\n\nIn a new analysis of Bureau of Labor Statistics data and extensive interviews with workers across industries, U.S. News & World Report identified archaeologists, anthropologists and cartographers as some of the best occupations for low stress and pay above the national median income of around $50,000.\n\nJob openings in academia and with the government may help keep stress to a minimum for anthropologists and cartographers, while archaeologists may be hired to manage collections at museums.\n\nThe best job that doesn't require a specific level of education is also projected to be the second fastest-growing job through the next decade. The field of wind turbine technicians is expected to skyrocket by 57% through the year 2028 thanks to a growing demand for renewable energy. This type of work can be labor intensive — it involves replacing worn parts, troubleshooting technical programs and collecting data.\n\nData collection and interpretation is a main function for two other well-paying, stress-free jobs that cracked the top 10, survey researchers and statisticians.\n\nThe only tech-focused job on the list is web developer, which is expected to grow by 13% and generally requires, at minimum, a two-year associate's degree. The highest-paying job requiring the least amount of time in school is radiation therapist, which pays over $80,000 and requires a two-year degree.\n\nBut work is all smiles for the top-paying, low-stress job on the list: orthodontist. U.S. News notes that orthodontists interviewed for the analysis enjoy working for themselves or in a practice where they can count on regular business hours.\n\nThe median salary for the role is $208,000 a year, and even those in the lower quartile of earning power still bring in six-figure incomes. It's also the only occupation that requires extensive education and training, calling for a doctoral or professional degree in dentistry before returning to school to specialize in orthodontics.\n\nAre are the 10 best jobs for healthy pay and low stress:", "description": "In a new analysis of Bureau of Labor Statistics data and extensive interviews with workers across industries, U.S. News & World Report identified archaeologists, anthropologists and cartographers as some of the best occupations for low stress and pay above the national median income of around $50,000.", "authors": ["Jennifer Liu"], "top_image": "https://image.cnbcfm.com/api/v1/image/106158267-1569943983160gettyimages-1070943866.jpg?v=1569944045", "published_at": "2019-10-01"}