{"pub": "theverge", "url": "https://theverge.com/2019/10/23/20929530/microsoft-surface-laptop-3-easy-open-up-repair-fix-ifixit-teardown", "downloaded_at": "2019-10-24 02:25:29.839484+00:00", "title": "Microsoft said the Surface Laptop 3 would be easy to open — and it actually is", "language": "en", "text": "Earlier this month, Surface boss Panos Panay showed how you’d be able to get into the Surface Laptop 3 just by lifting off the top plate — and it turns out, it’s pretty much as easy as Panay made it seem, according to iFixit’s Surface Laptop 3 teardown.\n\nPrevious Surface Laptops weren’t easy to open up at all. You had to forcibly pry off the keyboard and top cover assembly to get to the internals — iFixit used a knife on the Surface Laptop — and when you finally got to those internals, it turned out that none of them were user-replaceable. They were so hard to work with that iFixit gave both the Surface Laptop and Surface Laptop 2 repairability scores of zero out of 10.\n\nFor the Surface Laptop 3, though, iFixit says you can loosen up the top cover assembly just by unscrewing four Torx Plus screws on the bottom of the laptop. Once you do, you can use a guitar pick or another soft prying tool (maybe even a fingernail?) to gently lift up the top cover, which is attached to the rest of the computer by magnets and a single flex cable.\n\nHowever, once you’ve taken the cover off, you won’t be able to spec up the Surface Laptop 3 to your heart’s content, as the CPU and RAM are soldered to the motherboard. The only thing you can easily swap out is the M.2 2230 SSD, if you can actually find one.\n\nMicrosoft warns against swapping it, saying that a “skilled technician” should be the only ones to do so, but the only thing holding the SSD down is a single Torx Plus screw — so if you know what you’re doing, and you’re willing to risk voiding your warranty, it looks like you’ll be able to add some storage to the laptop on your own.\n\nIf you’re really crafty, you might be able to repair a broken keyboard, the headphone jack, or even the entire display, but the SSD looks to be the easiest to get to.", "description": "Earlier this month, Surface boss Panos Panay showed how you’d be able to get into the Surface Laptop 3 just by lifting off the top plate — and it turns out, it’s pretty much as easy as Panay made it seem, according to iFixit’s Surface Laptop 3 teardown.", "authors": ["Jay Peters", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/ed3PHjeQMkoyOmyh7Rbwm1wuZ0k=/0x237:1600x1075/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19314168/vtjxLIWYO6HT16GS.huge.png", "published_at": "2019-10-23"}