{"pub": "usatoday", "url": "https://usatoday.com/story/news/politics/elections/2019/10/22/tennessee-officials-pete-buttigieg-slur-leads-dollywood-boycott/4064534002", "downloaded_at": "2019-10-23 08:54:43.461756+00:00", "title": "A Tenn. county official called Pete Buttigieg a slur. It sparked calls to boycott Dollywood", "language": "en", "text": "CLOSE Watch an extended interview with Pete Buttigieg, mayor of South Bend, Indiana, and Democratic presidential candidate, prior to the LGBTQ forum in Iowa. Joseph Cress, Iowa City Press-Citizen\n\nKNOXVILLE, Tenn – County officials in Tennessee moved swiftly Tuesday to distance themselves from a commissioner who used a homophobic slur to describe presidential candidate Pete Buttigieg during a public meeting.\n\nCommissioner Warren Hurst, who's held his seat for 33 years, made the remark ahead of a vote on a gun measure at Monday night's Sevier County commission meeting. He railed against the national Democratic Party and said better presidential candidates could be found in the local jail.\n\nHurst, a toothpick in his mouth, went on to say, \"I'm not prejudiced, but by golly a white male in this country has very few rights, and they're getting took more every day.\"\n\nAt least one woman stormed out of the meeting, but many in the crowd applauded Hurst, and some said, \"Amen.\"\n\nThe county has since received a flood of criticism, including some calls for a tourism boycott of one of the nation’s most popular travel destinations.\n\nThe community is the gateway to the Great Smoky Mountains National Park. It's also home to Gatlinburg and Pigeon Forge, which host dozens of tourist attractions, including Dollywood and restaurants owned by Paula Deen and Blake Shelton. Many social media posts criticizing Hurst’s statements have tagged the tourist attractions and organizations.\n\nSevier County's official Twitter account on Tuesday morning disavowed Hurst's comments, saying they \"do not reflect the opinion or position of Sevier County administration.\"\n\n(Photo: Getty Images / tonda )\n\nThe city of Sevierville followed up with a statement condemning the \"offensive\" remarks.\n\n\"The City of Sevierville Board of Mayor and Aldermen and City administration reject bigotry and prejudice towards any and all persons,\" the statement reads, in part. \"Mr. Hurst’s remarks do not reflect the feelings of our residents, who are friendly, caring people and neighbors.\"\n\nPigeon Forge's city manager, Earlene Teaster, said Hurst's \"disturbing\" comments don't represent the city. \"Pigeon Forge welcomes everyone with open arms. We do not discriminate.\"\n\nThese racists and homophobic old men are benefiting from millions and millions of dollars that pour into Sevier Country every year, and pulling that money would speak louder than his hate. Spread the word. #LGBTQoftwitter#racists#Tennessee#SmokyMountains — Kathie Juengling 🌊 (@KathieJuengling) October 22, 2019\n\nNo one answered the door when Knox News stopped at Hurst's home Tuesday. He did not return phone and text messages.\n\nRep. Gloria Johnson, D-Knoxville, said the comments made by Hurst in Sevierville, which is about 30 miles southeast of her district, were \"embarrassing.\"\n\n\"It was just horrific, and the way people just laughed and mocked was really embarrassing,\" she said. \"We would hope that Tennesseans would be better than that. And folks in Sevier County who rely on tourist dollars – it's that sort of thing that's going to chase people away from their county.\"\n\nDollywood, Johnson said, is \"the most open and welcoming place.\"\n\n\"And then to hear something like that, I could see it just killing anybody's desire to try to come up there,\" she said. \"You've got a fabulous place that's opening and welcoming and friendly, and then you've got officials like that. It just sends a terrible message.\"\n\nDollywood spokesman Pete Owens said Hurst's comments \"do not reflect the Dollywood experience in any way. Dollywood is open and welcoming to everyone, every day.\"\n\n'This is unprofessional'\n\nThe woman caught on camera storming out of the county commission meeting is Sara Thompson, chair of the Sevier County Democrats. She was there to speak out against the gun measure.\n\nThompson told Knox News the meeting was \"respectful\" until Sevier County Mayor Larry Waters asked if any of the county commissioners wanted to comment ahead of the vote.\n\nAt that point, she said, Hurst launched into a \"personal attack on those who had been there and opposed the resolution\" before expanding his comments to Democrats in general and the difficulty of being a white man in America.\n\nAt one point, Hurst used a slur to refer to Buttigieg, a Democratic presidential candidate and the mayor of South Bend, Indiana. Hurst didn't say Buttigieg's name, but the candidate is openly gay.\n\nButtigieg's campaign did not respond to a request for comment Tuesday.\n\nDuring Hurst's speech, Thompson stood up, said, \"Excuse me, this is unprofessional, this is (expletive),\" and walked out.\n\n\"I felt it was better for me to leave the room than to continue a scene or to listen to what apparently followed,\" she said.\n\n'That's all I want to say'\n\nTwo other Sevier County commissioners tried to distance themselves from Hurst's comments but stopped short of condemning them outright.\n\nCommissioner Mike Chambers said he supported the Second Amendment resolution after hearing from his constituents. Supporters of the measure argue red flag laws infringe on their constitutional rights.\n\n\"We stand by our gun owners, and we do support that,\" Chambers said. \"The other things that went on I had nothing to do with.\"\n\nCommissioner Greg Haggard said it was his understanding that the Sevier County Gun Club researched the proposal and asked commissioners to support it. A spokeswoman for the gun club said it doesn't endorse Hurst's comments.\n\nBeyond that, Haggard said Hurst’s comments don’t speak for everyone on the commission.\n\n“That’s pretty much all I want to say,” he said.\n\nFollow Tyler Whetstone and Travis Dorman on Twitter: @tyler_whetstone and @travdorman\n\nRead or Share this story: https://www.usatoday.com/story/news/politics/elections/2019/10/22/tennessee-officials-pete-buttigieg-slur-leads-dollywood-boycott/4064534002/", "description": "Following his remark, Commissioner Warren Hurst went on to say, “I’m not prejudice, but by golly a white male in this country has very few rights.\"", "authors": ["Tyler Whetstone", "Travis Dorman", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/30/USAT/3d8fd8cb-37d8-47cb-956f-edb8f5149e75-Pete_sign.JPG?crop=2883,1622,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-22"}