{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/12/sky-and-storm-advance-to-second-round", "downloaded_at": "2019-09-12 07:18:18.119467+00:00", "title": "Sky and Storm advance to second round", "language": "en", "text": "CHICAGO (AP) - Diamond DeShields scored 25 points and the fifth-seeded Chicago Sky used a dominating second half for a 105-76 win over the eighth-seeded Phoenix Mercury in a first-round, winner-take-all playoff game on Wednesday night.\n\nAstou Nadour and Stefanie Dolson added 16 points apiece for the Sky, who play at fourth-seeded Las Vegas on Sunday in the single-elimination second round. Allie Quigley had 15 points, Cheyenne Parker had 11 off the bench and Courtney Vandersloot had nine points to go with 11 assists as Chicago was making its first playoff appearance since 2016.\n\nPhoenix only trailed 44-41 at halftime despite losing league-leading scorer Brittney Griner with a left knee injury with 8:18 left in the second quarter. Griner was called for an offensive foul setting a screen on Quigley, and it appeared there was knee-to-knee contact. Griner went to the locker room with the help of injured star Diana Taurasi, who was sidelined with a hamstring injury.\n\nGriner returned to start the third quarter with a knee brace, playing briefly before going to the bench for good. She had six points, more than 14 below her average. Chicago used a 12-0 to start the second half and the Sky didn’t look back.\n\nSTORM 84, LYNX 74\n\nEVERETT, Wash. (AP) - Jordin Canada scored a career-high 26 points and the defending WNBA champion Storm beat the seventh-seeded Lynx.\n\nWith Jewell Loyd adding 22 points, the No. 6 Storm, who play at third-seeded Los Angeles on Sunday in the single-elimination second round, got 48 out of their backcourt. Minnesota had one point from starting guards Odyssey Sims and Danielle Robinson. Mercedes Russell contributed 13 points for Seattle.\n\nSylvia Fowles scored inside with 5:52 to play in the fourth quarter to pull Minnesota within 71-67. The Lynx then went nine straight possessions without scoring. By the time Napheesa Collier made a free throw with 1:11 to play, Seattle was up 76-68.\n\nDamiris Dantas led the Lynx with 20 points, Collier had 19 and Fowles 11. Fowles also had 11 rebounds and Collier 10. According to Elias Sports Bureau, Collier is the third rookie in WNBA history to produce a double-double in their playoff debut, joining Candace Parker and Tamika Catchings.\n\nSeattle led 29-21 after one quarter as Canada and Loyd scored 11 points each. Minnesota stayed close because of its frontcourt production but never led after the opening minutes.\n\nTrailing 64-59 entering the fourth quarter, Minnesota got an early basket but Seattle reserves Shavonte Zellous and Sami Whitcomb combined for seven points to push the lead to 10. The Lynx answered with six points but then went cold with six turnovers and four missed shots before Dantas hit a 3 in the final minute.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Diamond DeShields scored 25 points and the fifth-seeded Chicago Sky used a dominating second half for a 105-76 win over the eighth-seeded Phoenix Mercury in a first-round, winner-take-all playoff game on Wednesday night.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/12/stormlynx_56004_c0-128-2675-1687_s1770x1032.jpg?567222f1a10f21fbf4350b6cfe00f5fd2bb0b50a", "published_at": "2019-09-12"}