{"pub": "investingcom", "url": "https://uk.investing.com/analysis/subdued-start-expected-for-europe-uk-jobs-data-in-focus-200432553", "downloaded_at": "2019-09-10 07:51:39.498064+00:00", "title": "Subdued Start Expected For Europe, UK Jobs Data In Focus", "language": "en", "text": "European equity markets were mixed yesterday. The FTSE 100 was hit hard by the continued rally in the pound. The London equity benchmark has a large amount of international exposure, and whenever the pound has a major to the upside, the index usually pays the price. Eurozone equity markets were mixed. Traders are looking ahead to Thursday’s European Central Bank meeting, and there is continued speculation about the possibility of a loosening of monetary policy.\n\n\n\nThere is talk the ECB will cut interest rates, launch a government bond-buying scheme, or perhaps both. Germany is the powerhouse of Europe and the economy contracted in the second quarter, and recession chatter is doing the rounds. At a previous ECB meeting, the chief central banker, Mario Draghi, called for fiscal stimulus, stating that monetary stimulus can’t do everything. There has been talking that Germany is considering launching a fiscal stimulus package, but some in the German government is opposed to such a move.\n\n\n\nOvernight, China posted the latest inflation figures, and CPI was 2.8%, while economists were expecting 2.6%, and the previous reading was 2.8%. Chinese PPI was -0.8%, and the consensus estimate was -0.9%. Pork prices surged on the back of a swine fever outbreak, and that was a contributing factor in the inflation reading, so demand might not be as high as the reading suggests.\n\n\n\nThe Prime Minister lost a vote to hold an early general election again. Parliament has been suspended, and it will reopen in mid-October. Mr. Johnson must either get a majority of MPs to back a no-deal Brexit by 19 October, or he will be forced to seek an extension from the EU.\n\n\n\nUS equity markets started out resonantly positive, but some the gains didn’t last long, and the session ended on a mixed note. It was a quiet day in terms of economic news from the US. The US and China are due to meet next month, and according to Steven Mnuchin, the US treasury secretary, the US is prepared to do a deal, as long as it is good for the US. The lack of hostilities between the US and China is likely to keep stocks in their upward OIl move.\n\n\n\nSterling had a positive run yesterday as the UK economy appears to be in better shape than traders expected. The GDP estimate for July was 0.3%, and economists were expecting 0.1%. Brexit continues to dominate political headlines, and Prime Minister Johnson expressed his desire to strike a deal with the EU, and that added to the pounds positive move.\n\n\n\nGold endured a massive sell-off towards the end of last week, and yesterday it traded below the $1,500 mark –for the first time since late August. The positive move that was experienced on Wall Street at the start trading session prompted traders to drop the metal. The US dollar fell yesterday too, and it is a sign of the weakness in gold when it loses ground on a day when the greenback is weak.\n\n\n\nThe oil market enjoyed a rally yesterday after Prince Abdulaziz bin Salman, the new Saudi energy minister, said the co-ordinated scheme to keep oil production low across OPEC and non-OPEC members, can last; until death do us part’. The update prompted trader to snap up oil as is relatively cheap in light of the geopolitical and economic concerns.\n\n\n\nAt 9.30am (UK time), the UK will post the unemployment and earnings data. The jobless rate is tipped to hold steady at 3.9%, and earnings excluding bonuses are expected to cool to 3.8%.\n\n\n\n– snapped back last week, and if it holds above 1.1000, it might pave the way for 1.1164 to be retested. If the wider bearish trend continues, it might target at 1.0900.\n\n\n\n– last Tuesday’s daily candle has the potential to be a hammer, and if it holds above the 1.2200 area, it might bring 1.2400 into play. Support might be found at 1.1900, should the wider bearish move continue.\n\n\n\n– the weekly candle from mid-August appears to be a bearish reversal, and if the downward movement continues, it might target 0.8872. A rebound in the currency pair might bring 0.9200 into play.\n\n\n\n– rebounded last week, and a break above the 107.15 area – 50-day moving average, it might bring 108.27 (100-day moving average) into play. Should the wider downtrend continue, it might retest the 104.50 area.\n\n\n\nis expected to open 15 points lower at 7,220\n\n\n\nis expected to open 16 points lower at 12,210\n\n\n\nis expected to open 5 points lower at 5,583\n\nDISCLAIMER: CMC Markets is an execution-only provider. The material (whether or not it states any opinions) is for general information purposes only and does not take into account your personal circumstances or objectives. Nothing in this material is (or should be considered to be) financial, investment or other advice on which reliance should be placed.\n\nNo opinion given in the material constitutes a recommendation by CMC Markets or the author that any particular investment, security, transaction, or investment strategy is suitable for any specific person.\n\nOriginal Post", "description": "Market Overview Analysis by CMC Markets (David Madden) covering: EUR/USD, GBP/USD, USD/JPY, FTSE 100. Read CMC Markets (David Madden)'s latest article on Investing.com UK.", "authors": [], "top_image": "https://uk.investing.com/analysis/not found", "published_at": "2019-09-10"}