{"pub": "zdnet", "url": "https://www.zdnet.com/article/windows-10-has-microsoft-cleaned-up-its-update-mess-spoiler-maybe", "downloaded_at": "2019-09-17 11:25:30.427427+00:00", "title": "Windows 10: Has Microsoft cleaned up its update mess? (Spoiler: Maybe)", "language": "en", "text": "Windows 7 end of support looms but you still aren't ready ZDNet's Steve Ranger tells Karen Roby that time is running out for Windows 7 but millions of PCs are still to be upgraded. Read more: https://zd.net/2Zvbvav\n\nIn a perfect world, every software release would be packed with productivity-enhancing features and completely free of bugs. Alas, we do not live in a perfect world. (You've looked around lately, right?)\n\nOne of the realities of software engineering for products at the scale of Microsoft Windows is that you can't catch every bug before you ship. Instead, the goal should be to prioritize the detection of high-impact bugs so that they never reach customers and to develop a quick-response strategy for dealing with those issues that do make it to the general public.\n\nThat was the thinking behind the sweeping changes in Windows Update that Microsoft announced late last year after a series of embarrassing bugs forced the company to pull its October 2018 Update (version 1809) just days after its release. The changes include a more cautious rollout approach, expanded options for pausing updates, and more disclosure of known issues.\n\nThat last change, alas, is a double-edged sword for Microsoft. The new \"release health dashboard\" is a tremendous resource for IT pros and cautious Windows 10 administrators, but it's also a treasure trove for content-hungry tech websites.\n\nIn fact, if you scan recent headlines following the release of version 1903, you might conclude that the latest Windows 10 release is plagued with quality issues. I can practically hear the critics now: \"It's a mess! Just look at all these bugs!\"\n\nSo, I did exactly that. After looking at those issues and their resolution in more detail, a different story emerges. Consider these five bugs, all of which resulted in coverage at ZDNet and elsewhere.\n\nBug 1: Windows Desktop Search may not return any results and may have high CPU usage.\n\nThis bug was caused by a cumulative update that was released on Aug. 30. It was fixed 10 days later, as noted here: \"Microsoft: We've fixed Windows 10 1903's Cortana CPU spike bug.\"\n\nThat's a pretty quick response by any measure, but the entire story is even more interesting.\n\nThe original bug was part of an optional update to Windows 10, a so-called \"D\" week release, made available as a preview of the next month's Patch Tuesday release for \"visibility and testing\" by IT pros and enterprise administrators. The only way to install that update was to manually go to the Windows Update page in Settings and click the Download And Install Now link below the Optional Updates Available heading. (For more on these optional updates, see my \"FAQ: How to manage Windows 10 updates.\")\n\nIn this case, the extra testing worked as designed, helping identify the issue (it only occurs on systems that have been configured with a specific non-default search setting) and allowing Microsoft to roll out a fix that was delivered as part of the normal Patch Tuesday update cycle.\n\nBug 2: Screenshots and Snips have an unnatural orange tint.\n\nWhen is a Windows bug not a Windows bug? When it's caused by a piece of third-party software. In this case, the culprit was a Lenovo utility called Eye Care, which is designed to reduce the blue light from LEDs for use at night.\n\nLenovo has documented a workaround for the issue. In this case, it appears that Windows engineers aren't to blame.\n\nBug 3: Audio in certain games is quieter or different than expected.\n\nYou might have read about this issue three days ago: \"Windows 10 version 1903 users are reporting fresh audio problems, wrecking hit multiplayer games like PUBG.\" That issue was resolved within 72 hours, as ZDNet reported earlier today.\n\nHere, too, the issue isn't in Windows itself; instead, Microsoft claims, the issue is caused by its hardware partners:\n\nAt the request of some of our audio partners, we implemented a compatibility change that enabled certain games to query support and render multi-channel audio. Due to customer feedback, we are reverting this change as some games and some devices are not rendering multi-channel audio as expected.\n\nIf you're a hardcore gamer, you might rank the severity of this bug at an 11 on a scale of 10, but for the vast majority of mainstream users, it was a non-issue. The speed of resolution was impressive.\n\nBug 4: Some NEC devices have Wi-Fi incompatibility issues.\n\nmust read The Windows 10 security guide: How to safeguard your business How do you configure Windows 10 PCs to avoid common security problems? There's no software magic bullet, unfortunately, and the tools are different for small businesses and enterprises. Here's what to watch out for. Read More\n\nThis issue was documented on the release health dashboard on Friday, September the 13th, and it's a perfect example of why even expanded testing can't identify every issue.\n\nThe problem affects \"specific models of NEC PCs\" equipped with Intel Centrino 6205/6235 and Broadcom 802.11ac Wi-Fi cards. After an upgrade to Windows 10, version 1903, the Wi-Fi driver shows a yellow exclamation point in Device Manager and the Wi-Fi connection no longer works. There's a short-term workaround (disable and re-enable the Wi-Fi adapter), and Microsoft says it's working on a resolution with NEC.\n\nWhen I first heard of this issue, my reaction was \"NEC still makes PCs?\" It's been more than a decade since NEC completely exited the global desktop PC market, and that segment of the business is such an afterthought that the company's webpage still proudly boasts of its 2016 models.\n\nNonetheless, the issue was identified, and a compatibility block will prevent that update from being installed automatically until the fix is available.\n\nBug 5: Additional issues related to the Start menu and Windows Desktop Search\n\nThis issue was first reported on Patch Tuesday, Sept. 10, and appears to be related to the cumulative update released that day. According to the issue description, \"a small number of users are having issues related to the Start menu and Windows Desktop Search.\"\n\nAlthough there was initial speculation that this issue is related to the one that was found and fixed earlier, that now seems unlikely. If this issue truly affects only a small number of users, it's probably linked to a configuration change or a piece of third-party hardware or software. In that case, the availability of Windows telemetry is likely to yield the answers. But until that evidence is found, that one is still listed as under investigation.\n\nOf course, the easiest way to avoid this sort of issue is to wait another few months before installing version 1903. In the most significant change of all to Windows Update, this feature update is now optional for all Windows 10 editions (including Home edition) and will only be installed automatically on PCs that are running an unsupported version of Windows 10 that is well over a year old.\n\nVersion 1809, despite its rocky start, is probably the best choice for admins who prefer a cautious approach. And it's comforting to know that the upcoming 1909 release will be light on updated features, making it far more likely that it will avoid many of these teething issues from the start.", "description": "After its botched release of the version 1809 update for Windows 10 last year, Microsoft instituted a sweeping series of changes to Windows Update. Don't be fooled by the headlines: A close look at recent issues with version 1903 suggests those changes are paying off.", "authors": ["Ed Bott"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2019/07/26/ffb855f2-ca59-4b28-90a8-f0bb14aaea6b/thumbnail/770x578/eedcf7968e8fe16d59390d52a912b032/windows-10-cleaning.jpg", "published_at": "2019-09-17"}