{"pub": "cryptonews", "url": "https://cryptonews.com/news/binance-makes-usd-1bn-in-total-ceo-confused-about-bnb-price-4876.htm", "downloaded_at": "2019-10-17 10:31:29.834938+00:00", "title": "Binance Makes USD 1bn in Total, CEO Confused About BNB Price", "language": "en", "text": "Changpeng Zhao. Source: a YouTube video screenshot.\n\nWhile major cryptocurrency exchange Binance made a total of USD 1 billion in profits, also thanks to the new revenue streams, the CEO of the company said he's 'confused' about the price of their native token, Binance Coin (BNB).\n\nIn an attempt to increase the value of the coin, the company every quarter burns BNB worth of 20% of its quarterly profits. During the 9th burn, that happened today, Binance sent BNB 2,061,888 (c. USD 36.7 million) into an inaccessible address, thus showing that their profit in the third quarter jumped to more than USD 183 million and was almost the same as in the two first quarters combined. (Meanwhile, the number of BNB burned in Q3 is 26% higher than during the two previous burns combined.)\n\nCEO Changpeng Zhao confirmed that this latest burn marks a major milestone for the company as its total profit, earned since the exchange was launched in the second half of 2017, surpassed USD 1 billion. However, he also noted that Binance’s profits may be smaller compared to some other crypto exchanges.\n\nThis is interesting. What kind of “corn” should that be? https://t.co/dHfDis7oNU — CZ Binance (@cz_binance)\n\nBinance revenues depend on trading volume, as the company collects fees from traders. However, this volume decreased in the previous quarter.\n\nTrading volume on Binance:\n\nDespite slower trading, the company has managed to diversify its revenues and increase the profit.\n\nKey contributing factors to this growth “include new services like Margin trading, an increased number of fiat on-ramps to make purchasing cryptocurrencies more accessible, and a multitude of other services we introduced that are beginning to bear fruit,” the CEO said. Besides that, the company diversified its revenues with a number of new services, including Futures trading, as well as P2P trading offered to people in China.\n\nMeanwhile, Changpeng Zhao admitted that he's confused about the current BNB price, which is down by 39% in the past 3 months. (In comparison, bitcoin is down by 22% in the same period of time).\n\n\"We believe BNB has grown beyond the point of depending on reducing supply (such as the BNB burn) to increase value. A far bigger portion of BNB value comes from its utility. We prioritize increasing the utility of BNB over short-term profits for Binance,\" he said, later adding that \"even with all the above progress and results, the BNB price declined from its [all time high] near the beginning of the quarter.\"\n\n\"There are many possible reasons for it, although none of them make much sense to me. Yes, there was a drop in the price of bitcoin, our industry’s index. There was some FUD [fear, uncertainty and doubt] on various things (per usual). Regardless of all that, I think (in my biased view) our results out-shine them all. Yet, the price of BNB did decline. Markets often confuse people, even me sometimes,\" he said, adding that they \"still very much strive to be the financial infrastructure provider for tomorrow, and work hard to bring the freedom of money to the masses.\"\n\nAt pixel time (09:19 UTC), BNB trades at c. USD 18.4 and is up by 0.7% in the past 24 hours and by 5.7% in the past week.\n\n__\n\nLearn more: Why is Binance Really Burning its Own Stash of BNB Tokens?", "description": "While major cryptocurrency exchange Binance made a total of USD 1 billion in profits, also thanks to the new revenue streams, the CEO of the company said he's 'confused' about the price of their native token, Binance Coin (BNB).", "authors": ["Sead Fadilpašić"], "top_image": "https://cimg.co/w/articles/0/5da/8359671f1c.jpg", "published_at": "2019-10-17"}