{"pub": "americanconservative", "url": "https://theamericanconservative.com/urbs/why-we-should-preserve-old-diners-and-motels", "downloaded_at": "2019-10-23 08:43:32.685089+00:00", "title": "Why We Should Preserve Old Diners and Motels", "language": "en", "text": "A few months ago, the Internet news cycle noticed a Denver diner owner seeking to sell his retro ’60s property so he could retire. Given the changes to the surrounding area, selling meant redeveloping. And so he ran into a coalition of NIMBYs and historic preservationists—not always, but sometimes the same people—who, according to some, such as the libertarian Reason magazine, want to forcibly devalue a parcel of private property for their own private aesthetic pleasure.\n\nThat’s one way to gloss historic preservation, especially when the structure in question is both commercial and of relatively recent vintage. Aside from the property rights angle, there’s also the YIMBY-urbanist angle: more housing is good, multi-story and mixed-use development is good, and if a cool old diner has had the misfortune of being engulfed by an urban environment that now cries out for density, so much the worse for the diner.\n\nTom’s Diner in Denver, Colorado\n\nI’m not going to go to the mat for the Denver diner, and I tend to think the practical need for housing and the improvement of the urban fabric should be weighed heavily vis-a-vis this sort of marginally historical suburban-style architecture. But the spat called to mind my previous writing on the preservation of midcentury suburban architecture—quirky motels, diners, drive-ins, stores, and car dealers, with their iconic neon signs and slanted roofs. I have a soft spot for such structures, despite a general distaste for the suburban pattern of which they are usually a part.\n\nMany urbanists and preservationists alike view these artifacts as more or less worthless, or at least not worth the trouble of preserving. Preservation, after all, usually takes a fight, and preservationists must spend their political capital wisely. There are legitimate reasons to leave such buildings to their natural fate, especially if intervening means allowing many more indisputably historic structures to meet the wrecking ball. Sometimes the money and the capital simply isn’t there.\n\nFurthermore, while midcentury buildings may have character and quirk, they are aging and have often been poorly maintained, or else considerably modified. The National Register of Historic Places understandably does not care for commercial buildings that have been heavily modified or updated, no longer displaying the architectural features that would identify them as historic in the first place. (And nobody is going to painstakingly deconstruct and restore any of them, like James Madison’s Montpelier mansion, to their original glory.) There are also hard economic considerations. Most preserved architecture is either truly unique or valuable—a cultural asset, a landmark, a tourist attraction. An old building divorced from its original economic function can easily become a white elephant.\n\nThe reality is that most of this “historic” suburban architecture was built at a time when there was plenty of cheap and seemingly infinite greenfield land along what were then relatively recent highways. Many places that were sparsely developed with diners and motels are now densely built commercial corridors, and real estate values and property taxes make it difficult to justify running low-value businesses out of single-story buildings on sizable lots. There is a reason why drive-in theaters, garden centers and nurseries, and small kiddie amusement parks are some of the first legacy businesses to go up for sale as an area densifies.\n\nBeyond all this, some would dispute that a 1950s diner or motel even counts, or can count, as “historic.” History, for them, is not a slightly different building style used within living memory, but something hallowed and ancient, civilizational in importance. As much as I like neon, I can’t make that strong a claim about it.\n\nBut putting aside the question of “history,” are there any objective reasons to keep some of this stuff around? Perhaps I’ve reverse engineered my reasons from my personal preferences. But I like to think that there are.\n\nOne is local character and interest: they are landmarks, and that means something. If you’ve driven around the country a lot, you have almost certainly experienced the odd, deja vu sensation of walking into a Walmart in Arizona with the exact same floor plan as one in Maine. There is a good case to be made that the near-total absence of landmarks or local markers in the places that we live contributes to a certain unease in American life. While this sort of argument often follows from a merely aesthetic critique, it is also deeper than that. It speaks, as have critics of suburbia from Peter Blake to James Howard Kunstler, to a deep human need for home and place. (Kunstler himself would no doubt relish these structures meeting the wrecking ball, but time has a way of hallowing things.)\n\nIn an era before massive hotel, restaurant, and retail chains, every highway and every town had its own unique, and often fantastically overbuilt, signs and buildings. At a certain point, they become part of the fabric of their communities. When they’re all replaced by brand-centric chain architecture, the place loses something real, or rather, the sense that it is a place is damaged. The memories of older residents are severed from today. There is a sense of dislocation. This may ultimately have to yield to more pressing concerns like housing, but it’s still something real, more than mere preference.\n\nThis is what people mean when they complain that “everywhere looks the same.” It is true that suburban sprawl is a common form, but so is the American small town. From Maine to Maryland to Michigan to California, the small town is a recognizable entity.\n\nThe complaint of sameness indicates that recently-built places all feel the same—that there are no local geographic or cultural markers. Home Depot doesn’t even include the old “Your State’s Home Improvement Warehouse” tagline on its facades anymore.\n\nThere is also probably an untapped market for businesses in restored or preserved “retro” buildings. From cassette tapes and records to cartridge-based video games to exterior-corridor motels, everything old is new again. Remodeled retro motels, in fact, are a growing phenomenon. Adaptive reuse projects turning warehouses into breweries or midcentury automobile showrooms into gyms are not uncommon. The profusion of converted retail businesses along older commercial strips suggests that these buildings are not quite as disposable as we often think. Incorporating them more permanently and functionally into the local fabric is a good thing. Like parents digging out their adult children’s ‘80s Nintendo games, communities that have held onto such buildings this long may find that they have become resources rather than liabilities. Maryland urbanist Dan Reed has pointed out how adaptive reuse—a sort of livelier, more dynamic version of historic preservation—can bring new cultural and economic value to the existing built landscape.\n\nRestored Chevy dealership building, now a fitness center, in Hyattsville, Maryland\n\nThere is a final, deeper point: mundane things like aging buildings or obsolete consumer goods are embodiments of a different era, and help us understand that we exist in a stream of time. Previously I’ve recounted how a brief scene in Nineteen Eighty-Four struck me:\n\nWinston Smith stumbles into an old antique store and browses the merchandise: a serious crime in his society. He finds an old record player and a beautiful paperweight. The Party, Winston muses, established its totalitarian hegemony not just by burning books and executing dissidents; it did so also by continually rewriting history and purging it of such things as filled the antique store: unique, interesting, beautiful things, things unmistakably pointing to a very different period of human civilization and thus suggesting the possibility of a very different way of life.\n\nOur own thoughts upon browsing antiques are unlikely to be so dramatic. But the insight that ordinary objects can communicate something valuable about the society in which they are embedded is relevant to preservation.\n\nAn old motel, for example, has very small and sparse rooms, low ceilings, and few amenities beyond television (possibly a CRT) and AC. Families—often much larger than today—used to be perfectly happy staying in such rooms. Yet as with houses, we now demand larger and fancier rooms in larger and fancier buildings. That tells us something about consumer preferences, family formation, greed, and gluttony.\n\nThe existence of the old motel, and the fact that it once satisfied people, can spark reflection on those preferences and their effects on the built and natural environment. They provide a reminder, in our day-to-day surroundings, that we are not living in year zero.\n\nPublic policy requires an awareness of time and history; if it is precisely tailored for exactly the present moment, it is bound to miss very much that is relevant and become obsolete very quickly. How can you know where you want to go if you don’t know where you came from and how you got there? In this way, there may well be a connection between our ersatz politics and the placeless churn that makes up so much of our built environment.\n\nBuildings are little pieces of private property, but streetscapes and neighborhoods writ large are public goods of a sort; they are assemblages of private property, but not merely that. A libertarian absolutist view that defines the public realm out of existence—like that which views a retro diner and community institution as nothing more than a real-estate parcel to be bought and sold—is destructive.\n\nThe actual incentives around preservation—of developers, property owners, communities, and local governments—often fail to align. Business owners who have seen their real estate skyrocket need to retire. If the old building stays, someone has to actually maintain it and find a use for it, preferably a profitable one. If you went to a board meeting and said the old motel on the edge of town needs to stay so we can learn humility and reject consumerism, well, thank you for your input, next please.\n\nThis all might sound like an extremely tortuous way to get back to “save the diner.” It isn’t. It’s much more important than that.\n\nAddison Del Mastro is assistant editor of The American Conservative. He tweets at @ad_mastro.", "description": "", "authors": ["New Urbs"], "top_image": "https://www.theamericanconservative.com/wp-content/uploads/2019/10/diner-resized.png", "published_at": "2019-10-23"}