{"pub": "nytimes", "url": "https://nytimes.com/2019/10/09/opinion/trump-impeachment-constitution-house.html", "downloaded_at": "2019-10-09 18:30:07.604353+00:00", "title": "Opinion | How Will the House Respond to Trump’s Constitutional Escalation?", "language": "en", "text": "On their face, many of the procedural arguments are shaky. The letter states, for example, that the inquiry is “constitutionally invalid” in part because previous impeachment inquiries included an authorizing vote of the House. But neither the Constitution nor the Rules of the House require such a vote. Congress, as the Constitution states in Article 1, Section 5, has the power to “determine the Rules of its Proceedings” — including in the context of impeachment. The Supreme Court has been deferential to that power.\n\nThe letter also criticizes the Democrats’ approach to subpoena power and argues that ranking minority members on committees had greater influence over subpoenas in previous impeachment inquiries. That claim ignores profound changes in recent years in how the House approaches subpoenas — some of which were put in place by zealous Republicans during their investigations of the Obama administration.\n\nFinally, the letter states that if House Democrats “return to the regular order of oversight requests, we stand ready to engage in that process.” But it ends by asking House Democrats to “abandon the current invalid efforts to pursue an impeachment inquiry and join the President in focusing on the many important goals that matter to the American people.”\n\nThe calls for process change, then, aren’t to be taken seriously as an inducement of some kind of mutual accommodation on the part of Congress and the executive branch.\n\nSo why might the White House pick this moment to escalate its political fight? One possibility is that with some polls indicating growing support for impeachment, the president believes that the sooner a floor vote on impeachment happens — even one on authorizing the inquiry and not on any articles themselves — the more likely congressional Republicans are to remain unified or nearly so on the president’s side. If more information about the conduct of President Trump, Secretary of State Mike Pompeo, Vice President Mike Pence or other administration officials is revealed, some House Republicans may find themselves feeling pressured to vote to at least authorize an inquiry.", "description": "The White House wants to reshape the terms of the impeachment political debate.", "authors": ["Molly Reynolds"], "top_image": "https://static01.nyt.com/images/2019/10/09/opinion/09Reynolds1/09Reynolds1-facebookJumbo.jpg", "published_at": "2019-10-09"}