{"pub": "cbc", "url": "https://cbc.ca/news/politics/election-minority-government-function-1.5329358", "downloaded_at": "2019-10-22 15:08:33.935324+00:00", "title": "The voting is over, now the hard part begins for a minority government | CBC News", "language": "en", "text": "The ballots have been cast and counted, but Ottawa will have to deal with uncertainty as Canada's new minority Liberal government finds its feet in the next few days and weeks.\n\nBriefing books for incoming ministers were done weeks ago, but possible political scenarios were still being spun late last week within the halls of government as federal civil servants and party operatives braced for a minority Parliament and the inevitable political spectacle that will follow.\n\n\"Now the fun starts,\" said David Zussman, a former senior public servant and now an adjunct professor at the University of Victoria. \"I've always been interested in what happens after the election.\"\n\nWith the Liberal minority, \"the interesting conversation is what happens Tuesday, Wednesday and Thursday\" of this week, he said.\n\nThe coming days will be a time of not only political calculation, decisions and possible deal-making, but also human frailty as exhausted leaders, MPs, their staff and supporters come to terms with the results at the end of a gruelling campaign.\n\n\"It is a very difficult time, particularly if they are disappointed — or devastated by the outcome — to put together a coherent plan,\" said Zussman.\n\nLiberal supporters watch results as poll numbers come in at Liberal election headquarters in Montreal (The Canadian Press/Paul Chiasson)\n\nThe new government will not have much time to catch its breath with impending ratification of the United States-Mexico-Canada free trade deal by the U.S. Congress and the upcoming Asia-Pacific Economic Cooperation (APEC) summit in Santiago de Chile.\n\nFor Zussman, one of the most striking aspects of this new minority government is the relative youth of some of the party operatives who will fill out the staff positions, who may not have been around during minority government years and know only the freedom and predictability of a majority government.\n\nSome will struggle\n\n\"Some of them will grow and become leaders. Some are going to struggle because their style is not going to work. Their messaging is not going to work.\"\n\nDonald Savoie, the Canada research chair in public administration and governance at the Université de Moncton, said unlike the last two federal elections there will be \"a mad scramble\" in the coming days to not only absorb the results, but also to shift the gears of government back into motion, all in a highly charged political atmosphere.\n\nAnd, if Canadians think they can simply vote and then tune out of politics after Monday, they should think again because the new government will be living on political knife edge.\n\nConservative supporters react to polling results at party headquarters in Regina, Monday (The Canadian Press/Jeff McIntosh)\n\n\"Partisan politics will matter a great deal more because the (electoral) horizon will not be four years. It will be two years,\" said Savoie. \"We've seen it. We saw it with [former prime minister Stephen] Harper.\"\n\nAll of the parties have made an avalanche of promises to an increasingly polarized and volatile voter base, but Savoie said majority governments have more room to manoeuvre and implement bold policy choices. Under a minority, the government is more preoccupied with survival and the next campaign, which could happen at any time.\n\n\"The government will be far more partisan and will look at scoring political points; will look at making appointments to score political points,\" he said. \"Sorry to put it this way, but what's good for the country will matter less than what's good for the party.\"\n\nFor proof, Savoie said look no further than the high political dramas that riveted Ottawa between the election of a minority Liberal government in 2004 and its subsequent defeat, which gave rise to successive Conservative governments which themselves hung on the edge of defeat until 2011.\n\nMinorities must deal\n\nFormer prime minister Paul Martin's government almost went over a cliff in 2005 before he managed to entice Belinda Stronach to leave the Conservatives. He also had to cut political deals with the NDP's Jack Layton over affordable housing, foreign aid, and post-secondary education in order to stave off defeat.\n\nThe biggest survival challenge faced by Harper's government involved a proposed Liberal, NDP, Bloc Quebecois coalition which was promoted in the weeks after the 2008 election as a way to unseat the Conservatives -— an initiative that was only defused by the prorogation of Parliament.\n\nNDP Leader Jagmeet Singh reacts as he watches the Canadian election results come in at his hotel room in Burnaby, B.C., on Monday (The Canadian Press/Nathan Denette)\n\n\"Harper was under the view in 2006 that his government was always in jeopardy every day that he was in the House of Commons and he never looked comfortable looking to the long term in terms of policy-making,\" said Zussman.\n\n\"I think it has quite a dramatic impact on governing because they really can't think medium term, let alone long term. Much of what they do is tactical and it's all about surviving day-to-day and that's not necessarily good over a long period of time because the government can't concentrate on some of the bigger issues.\"\n\nMajor policy shifts tend to get put aside and appointments to various jobs take second place, he added.\n\nAlan Williams, who ran the procurement branch of the Department of National Defence under both majority and minority governments 15 years ago, said minorities do not lead to paralysis, but federal officials are more aware of the need to keep their ministers briefed so as to ensure \"there were no surprises.\"\n\nHe said his experience was the political shape of Parliament mattered less than the personalities and preferences of the leaders.", "description": "The ballots have been cast and counted, but Ottawa will have to deal with uncertainty as Canada's new minority Liberal government finds its feet in the next few days and weeks.", "authors": ["Defence", "Murray Brewster Is Senior Defence Writer For Cbc News", "Based In Ottawa. He Has Covered The Canadian Military", "Foreign Policy Parliament Hill For Over A Decade. Among Other Assignments", "He Spent A Total Of Months On The Ground Covering The Afghan War For The Canadian Press. Prior To That", "He Covered Defence Issues", "Politics For Cp In Nova Scotia For Years", "Was Bureau Chief For Standard Broadcast News In Ottawa.", "Follow", "Murray_Brewster On Twitter"], "top_image": "https://i.cbc.ca/1.5329999.1571720643!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/fedelxn-20191021.jpg", "published_at": "2019-10-22"}