{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/30/gooding-due-in-court-to-face-new-sex-misconduct-al", "downloaded_at": "2019-10-30 23:20:56.609547+00:00", "title": "Gooding due in court to face new sex misconduct allegations", "language": "en", "text": "NEW YORK (AP) - Cuba Gooding Jr. faces a new accuser and new charges in his New York City sexual misconduct case, his lawyer said Wednesday.\n\nThe actor is due in court Thursday for an arraignment on an updated misdemeanor indictment, lawyer Mark Heller said.\n\nThe charges relate to a third accuser in a case that has grown quickly in recent weeks from a lone allegation to a reexamination of Gooding’s behavior with woman throughout his career.\n\nThe 51-year-old, who won an Oscar for his role in “Jerry Maguire,” was arrested in June after a 29-year-old woman said he squeezed her breast without consent at Manhattan night spot.\n\nAn indictment unsealed Oct. 15 included charges Gooding alleging also pinched a woman’s buttocks at a Manhattan nightclub in October 2018.\n\nGooding pleaded not guilty and has denied all allegations of wrongdoing. He is free on his own recognizance.\n\nIn addition, prosecutors have said they intend to have up to a dozen other women not associated with the criminal charges testify that Gooding behaved like that with them in similar settings - bars, hotels and restaurants - as far back as 2001.\n\nThe judge, Curtis Farber, said he’ll rule in December on whether any of those women can take the witness stand.\n\nHeller has argued the case against Gooding is an example of the #MeToo movement run amok and that overzealous prosecutors are looking to turn “commonplace gestures” into crimes.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Cuba Gooding Jr. faces a new accuser and new charges in his New York City sexual misconduct case, his lawyer said Wednesday.", "authors": ["The Washington Times Http", "Michael R. Sisak"], "top_image": "", "published_at": "2019-10-30"}