{"pub": "japantoday", "url": "https://japantoday.com/category/tech/toyota-eyes-olympic-platform-to-boost-hydrogen-tech", "downloaded_at": "2019-10-24 04:33:16.274455+00:00", "title": "Toyota eyes Olympic platform to boost hydrogen tech", "language": "en", "text": "Toyota will include 500 of its new hydrogen-powered Mirai cars in a fleet of vehicles to be used at next year's Tokyo Olympics\n\nBy Etienne Balmer\n\nToyota showcased its next-generation hydrogen-powered Mirai model at Wednesday's Tokyo Motor Show, but with the technology still lagging behind electric, the Japanese firm is hoping for an Olympic boost.\n\nThe automaker is a lead sponsor of the global sporting event through 2024, and will include around 500 of the new fuel-cell vehicles in a 3,700-strong fleet to be used during the Tokyo Games next summer.\n\nAdoption of fuel-cell electric vehicles (FCEVs) has been slow compared with electric cars powered by lithium-ion batteries.\n\nBy the end of 2018, there were just 381 hydrogen stations in service worldwide, while there were 5.2 million lithium-ion battery recharge stops.\n\nSupporters say the technology has plenty to offer in the transition to climate-friendly vehicles, including zero CO2 emissions from operation, faster recharging and more range per recharge.\n\nBut both vehicles and infrastructure remain expensive, in part because of the dangers posed by highly flammable and explosive hydrogen, while there are also concerns about the way the fuel is produced.\n\nAlmost all current hydrogen production comes from fossil fuels, generating annual CO2 emissions equivalent to those of Britain and Indonesia combined, according to the International Energy Agency.\n\n\"At the moment the technology is not very mature,\" said Takeshi Miyao, head of consulting firm Carnorama. \"You need a lot of energy to produce hydrogen.\"\n\nBut some experts believe more efficient hydrogen production will follow naturally if demand for the vehicles increases.\n\n\"Once the market is there, this will enable large-scale investment in low-carbon hydrogen,\" said Erwin Penfornis, vice-president for hydrogen Asia-Pacific at the French firm Air Liquide.\n\nAnd it's that demand Toyota is hoping to stir at the Olympics next year, aiming to also boost the number of its Sora hydrogen buses on the roads of Tokyo from the current 15 to 100 by the summer.\n\n\"The idea is to show that hydrogen can be a part of everyone's life and for people to take that away from the Games,\" Yasunobu Seki of Toyota's Olympic projects department said earlier this year.\n\nToyota released its first-generation Mirai at the end of 2014, and has had modest success so far, selling just 10,000 units of the model, whose name means \"future\" in Japanese.\n\nOn Wednesday, it unveiled its second-generation model, promising up to 30 percent more driving range. The car is set to hit the market in late 2020, with no price tag yet announced.\n\nThe firm is also boosting production capacity in Japan, with the goal of being able to deliver 30,000 fuel-cell vehicles a year by 2021, which is 10 times more than currently possible.\n\nToyota says fuel-cell technology is \"one approach\" among others that it is pursuing, with applications as much for individual cars as for heavy vehicles, including buses and trucks.\n\nIt may be that latter category where hydrogen technology is most rapidly adopted, particularly in China, analysts say.\n\nAlready a champion of lithium-ion battery electric cars, China last March adopted a hydrogen plan that envisions putting a million fuel-cell cars on its roads by 2030.\n\nAnd Toyota has quickly sought to take advantage, signing a deal in April to supply hydrogen equipment to Foton, a subsidiary of China's Beijing Automotive Group (BAIC).\n\nThe Japanese firm has also sealed similar partnerships in recent months with other Chinese companies including FAW and Guangzhou Automobile Group (GAC).\n\nThe deals come against the backdrop of warming ties between Beijing and Tokyo, with China's Xi Jinping expected to make a state visit to Japan next spring.\n\nAnalysts say hydrogen-powered vehicle producers might be smart to focus on commercial vehicles initially.\n\n\"The focus on commercial vehicles makes it easier to deal with the challenge of developing a network of refueling centers, as commercial vehicles typically operate on predictable routes,\" said Janet Lewis, an analyst at Macquarie Capital Securities in Japan. \"As the infrastructure gets built out, there could be renewed interest... for passenger use, which for now is likely to remain a niche area.\"\n\n© 2019 AFP", "description": "Toyota showcased its next-generation hydrogen-powered Mirai model at Wednesday's Tokyo Motor Show, but with the technology still lagging behind electric, the Japanese firm is hoping for an Olympic boost. The automaker is a lead sponsor of the global sporting event through 2024, and will include around 500 of the new…", "authors": [], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/52/5d/9f661248ed24181858f6215afee34eb0fe2b/525d9f661248ed24181858f6215afee34eb0fe2b.jpg", "published_at": "2019-10-23"}