{"pub": "thehill", "url": "https://thehill.com/homenews/campaign/467859-biden-denied-communion-at-catholic-church-over-abortion-stance", "downloaded_at": "2019-10-29 14:03:41.637925+00:00", "title": "Biden denied communion at Catholic Church over abortion stance", "language": "en", "text": "Democratic presidential candidate Joe Biden Joe BidenJudge schedules hearing for ex-Trump aide who refused to appear in inquiry Army officer twice reported concerns about Trump's Ukraine tactics Ex-Trump official's refusal to testify escalates impeachment tensions MORE was reportedly denied communion on Sunday at a South Carolina Catholic church over his abortion stance.\n\nThe former vice president, a devout Catholic, visited Saint Anthony Catholic Church in Florence for mass, but Father Robert E. Morey denied him Holy Communion because of his views on abortion, the South Carolina Morning News reports.\n\nADVERTISEMENT\n\n\"Holy Communion signifies we are one with God, each other and the Church. Our actions should reflect that,” Morey told the newspaper in a statement. “Any public figure who advocates for abortion places himself or herself outside of Church teaching.\n\n“As a priest, it is my responsibility to minister to those souls entrusted to my care, and I must do so even in the most difficult situations,” the statement continued. “I will keep Mr. Biden in my prayers.\"\n\nIn order to receive communion, a Catholic must be in a state of grace and cannot participate in what is deemed a mortal sin, such as abortion.\n\nThe Biden campaign would not confirm to the South Carolina Morning News that he went to the church but said if he did attend he did so privately.\n\nBiden has said he supports Roe v. Wade, the landmark 1973 Supreme Court decision making abortion legal, but has faced some criticism from Democrats for some of his past language and stances on abortion legislation.\n\nA 2006 video unearthed in June showed Biden saying, \"I do not view abortion as a choice and a right.\"\n\nBiden in June was the only Democratic presidential candidate to say he supported the Hyde Amendment, which bans federal funding for abortions. He faced swift backlash before reversing his stance on the issue.\n\n\"If I believe health care is a right, as I do, I can no longer support an amendment that makes that right dependent on someone's ZIP code,\" he said at a Democratic National Committee gala in Atlanta after the controversy.\n\nBiden cited abortion restrictions recently passed by Republican governors for his change in position.\n\n\"I can't justify leaving millions of women without the access to care they need, and the ability to exercise their constitutionally protected right,\" he said.", "description": "Democratic presidential candidate Joe Biden was reportedly denied communion on Sunday at a South Carolina Catholic church over his abortion stance.", "authors": [], "top_image": "https://thehill.com/sites/default/files/bidenjoe_101719getty.jpg", "published_at": "2019-10-29"}