{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7570267/UK-weather-Fortnights-worth-rain-set-fall-just-two-hours-today.html", "downloaded_at": "2019-10-14 10:18:25.194768+00:00", "title": "UK weather: Fortnight's worth of rain is set to fall in just two hours today", "language": "en", "text": "Advertisement\n\nSwathes of Britain were put on flood alert today amid warnings that more than two inches of rain could fall in just two hours today.\n\nForecasters have issued a yellow weather warning stretching from Devon up to Leeds to run from midday to midnight, with the rain due to batter the country for much of the day while moving north.\n\nThe heaviest outbreaks are set for the afternoon and evening, and the Met Office predicted 2.3in (60mm) of rain could fall in some areas while many others would see up to an inch (25mm).\n\nThe Environment Agency has issued five flood warnings and 45 flood alerts for England, including for the area of West London around the River Thames from Putney Bridge to Teddington Weir.\n\nMorning commuters wait in the pouring rain for a Southeastern train at Petts Wood train station in South East London today\n\nA wet weather morning for these London commuters at Petts Wood railway station in South East London today\n\nA wild horse captured in the early morning misty sunrise on the Long Mynd in Shropshire today\n\nA Hunter's Moon rises above Ely Cathedral in Cambridgeshire yesterday evening\n\nA Met Office spokesman said the rain 'brings a risk of flooding and disruption but the situation is uncertain'. The warning follows a spell of unsettled weather which was already affecting most of England and Wales yesterday.\n\nMark Wilson, a forecaster at the Met Office, said: 'It is looking pretty unsettled. Heavy rain across England, Wales and Northern Ireland will push north throughout the day. The rain could cause [road] surface spray, so that could lead to some difficult driving conditions.'\n\nMan rollerblades in the rain wearing only shorts A man rollerblades today in Kensington, West London, wearing only a pair of shorts With the rain pouring down across Britain today, rush hour commuters were warned to take care on the slippery roads. But one man trying to get through the traffic had other ideas, rollerblading through Kensington in West London wearing only a pair of shorts. The bizarre sight was caught on camera on the junction of High Street Kensington and Kensington Church Street at about 8am this morning.\n\nWinds of up to 30mph are also expected in East Anglia and along the North East coast. There is, however, set to be a let-up from mid-afternoon when drier weather could start heading in from the South and South West.\n\nThe warmest temperatures are expected in the South East of England, which could have highs of 16C (61F). The North of England will be slightly cooler, peaking at around 15C (59F).\n\nAfter a wet day yesterday, the rain was forecast to ease off overnight in most parts before becoming heavy again, bringing the risk of foggy patches across the country this morning.\n\nThis evening, downpours could continue to hit the South East and Northern Ireland with lighter rain elsewhere. Parts of the South West and North East should remain dry although with moderate winds.\n\nTomorrow is expected to bring better weather with temperatures up to 16C (61F). Most Britons can expect to stay drier than they have done recently but there could be scattered showers in the North of England.\n\nThe average monthly rainfall for the UK in October is 5in (127mm). Yesterday's top UK temperature was 18.4C (65.1F) at Manston in Kent, while the low was -2.9C (26.8F) at Aboyne in Aberdeenshire.\n\nForecasters have warned of heavy rain throughout today, with a weather warning in place this afternoon from noon (right)\n\nThe Environment Agency has issued five flood warnings (in red) and 45 flood alerts (in orange) for England", "description": "Forecasters have issued a yellow weather warning stretching from Devon up to Leeds to run from midday to midnight, with the rain due to batter the country for much of the day while moving north.", "authors": ["Alex Ward For The Daily Mail", "Mark Duell For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/09/19682326-0-image-a-49_1571041960121.jpg", "published_at": "2019-10-14"}