{"pub": "afr", "url": "https://afr.com/policy/foreign-affairs/time-for-a-free-trade-deal-with-india-20191014-p530gq", "downloaded_at": "2019-10-14 23:22:57.794573+00:00", "title": "Time for a free trade deal with India", "language": "en", "text": "It is yet to be seen whether India’s interest in FTAs will last. Let’s be frank, we heard this \"open for business’ mantra from Prime Minister Modi when he was first elected five years ago.\n\nBack then, Modi allowed the natural protectionism and inertia of the New Delhi bureaucracy to stifle negotiations with a number of countries, including Australia. At the time, that was probably sensible. With a huge mandate for domestic reform, Modi had bigger fish to fry, such as installing 100 million toilets, connecting the Indian countryside to the electricity grid, demonetising and remonetising the Indian economy, and boosting his manufacturing sector with his vast Make in India campaign.\n\nIndia is hard: there is no doubt about it, but – news flash – all FTAs are hard.\n\nSo, where is Australia in this mix, the country that got so close to striking an FTA with India in 2015? We are way behind the starting line. While our foreign minister has been to India a number of times, our trade minister has been there only once, and he wasn’t trade minister at the time.\n\nThe extensive study on the Australia-India economic relationship undertaken by former DFAT Secretary and High Commissioner to India Peter Varghese set out a long-term strategic plan to deepen our trade and investment ties.\n\nOur person-to-person links are growing quickly. Tourist numbers from India are soaring, up more than 50 per cent, and Indian student numbers are up over 30 per cent. We have a vibrant entrepreneurial Indian diaspora in Australia. The country is now our third-largest source of immigrants, surpassing New Zealand.\n\nThe evidence is plain to see for prioritising a deal with India. It is already the sixth biggest economy in the world, and will be third within 15 years. The potential for growth in our economic relationship with India is vast. An FTA could help buffer Australia from the risks in a challenging Australia-China relationship.\n\nTwo-way trade in goods between Australia and India is up 6 per cent, with our exports up 5 per cent, compared with 16 per cent growth with China under the terms of the China-Australia FTA. Growth in trade in services (fuelled by education and tourism) is up 27 per cent year on year, and investment from India is up more than 2500 per cent over the last decade. Australia still invests more in Bermuda and the Cayman Islands than it does in India.\n\nAdvertisement\n\nPrime Minister Scott Morrison has announced he will go to India early next year. The PM and his Indian counterpart have a good relationship, one that could be great, on par with the slightly bizarre love-fest that was Modi and Tony Abbott. Modi has remained, in public at least and during joint India-Australia meetings, in favour of an FTA with Australia.\n\nIndia is hard: there is no doubt about it, but – news flash – all FTAs are hard. China was hard. The Trans Pacific Partnership was really hard. If they are easy, they are not worth the paper they are written on.\n\nAt the last election, the ALP put forward policy which could have tied negotiators hands in terms of the breadth and flexibility of our FTAs - banning investor-state dispute clauses and insisting on unnavigable protections of \"public welfare\", \"safe products\" and \"national treasures\".\n\nBy winning the election in May, Morrison maintained Australia’s dexterity in trade, it’s time to knuckle down and get the remaining hard stuff done.", "description": "A re-elected Indian government is once again interested in bilateral trade deals. That might help balance Australia's tricky relationship with China.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.3512%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_61%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/f8509eb03f0b95e7d372f89c0d8ee323e229fc71", "published_at": "2019-10-14"}