{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7575249/Skull-Pacific-atoll-1940-examined-USF-anthropologist.html", "downloaded_at": "2019-10-15 15:19:57.748968+00:00", "title": "Skull found on Pacific atoll in 1940 is being examined by USF anthropologist", "language": "en", "text": "A skull found on a Pacific atoll in 1940 that has been housed in a museum for decades is being examined to determine if it belongs to Amelia Earhart.\n\nThe aviation pioneer and her navigator Fred Noonan vanished over the Pacific Ocean during an attempt to circumnavigate the globe in 1937.\n\nBone fragments were first discovered on Nikumaroro Island about three years after Earhart went missing.\n\nDr. Erin Kimmerle, a forensic anthropologist at University of South Florida, will now examine the skull and other remains using DNA testing to determine if they are those of the missing explorer.\n\nA skull, (pictured), found on a Pacific atoll in 1940 and housed in a museum is being examined to determine if it belongs to Amelia Earhart.\n\nAmelia Earhart, standing in front of the Lockheed Electra plane, became an international celebrity after flying solo across the Atlantic Ocean. But Earhart, her navigator Fred Noonan and the aircraft vanished in June 1937\n\nDr. Kimmerle told Fox13: 'In 1940 there were human remains found with a camp-site, kind of a castaway site on an uninhabited atoll.\n\n'In the area where they think she might have had an emergency landing. At the time, the island was occupied by the British, and the guy who found them thought this might be her.\n\nThe skull fragments were found in Te Umwanibong Museum and Cultural Center in Tarawa and are believed to have come from a discovery in 1940.\n\nA colonial administrator claimed to have found the bones on the uninhabited Nikumaroro in the Pacific Ocean, but after sending them to Fiji it was believed they were lost.\n\nA National Geographic Society archaeologist Fredrik Hierbert claims he tracked down those bones to the institution and the DNA results are expected in a couple of months.\n\nDr Kimmerle said of her search in Te Umwanibong: 'What we're looking for is ideally a box of bones that would match this exact description. We're trying to find remains that were female and match the description in his report.'\n\nKimmerle assessed the height, age and ancestry of the remains and also took into account Earhart’s dental features and a known sinus condition.\n\n'They had four or five large boxes of remains that were co-mingled. The skulls that were there, there was one set of female remains that matched that description.\n\nThe skull fragments were found in Te Umwanibong Museum and Cultural Centre in Tarawa and are believed to have come from a discovery in 1940\n\nDr. Erin Kimmerle, (pictured), a forensic anthropologist at University of South Florida examines the skull and other remains using DNA testing to determine if they are those of the missing explorer\n\nOne of many theories surrounding her disappearance included Earhart getting lost as they tried to find tiny Howard Island - the intended stop on their flight - and instead landed near Nikumaroro\n\n'I know in forensic work we do, it could take a year, there's a huge backlog. But by using private labs and other people, they're looking to get it done much quicker,' she said.\n\nThe bone fragments were sent for DNA testing to determine if they matched with any of Earhart’s relatives. She has a living niece.\n\nNikumaroro is only 4.5 miles (7.5km) long and 1.5 (2.5km) miles wide, according to Atlas Obscura .\n\nIt sits atop of a peak that is similar to an underwater mountain range, believed to stretch 10,000 feet from the ocean floor.\n\nOne of many theories surrounding her disappearance included Earhart and Noonan getting lost as they tried to find tiny Howard Island - the intended stop on their flight - and instead landed near Nikumaroro.\n\nFrom there it's believed that the aircraft could have been dashed upon the reef surrounding the island and that the pair then perished on the island.\n\nAn addition to that theory is that they could have suffered a terrifying death at the hands of coconut crabs that hunt at night and can grow up to three-feet in length.\n\nThe bones which were discovered by a colonial administrator were allegedly sent to Fiji and believed to have been lost. However, they were tracked down to Te Umwanibong Museum and Cultural Centre (above) in Tarawa\n\nIn 1940, bones were discovered on Gardner Island – now called Nikumaroro (pictured) – 400 miles south of Earhart's planned stopover on Howland Island\n\nAn expedition to find Amelia Earhart's lost plane is being led by the explorer who discovered the Titanic.\n\nScientist Robert Ballard, 77, who was involved in the discovery of the Titanic wreckage, confirmed that if analysis of the bone fragments are revealed to be from the American aviatrix he will return to Nikumaroro Island, in Kiribati.\n\nThe belief that Earhart and Noonan's plane sank near to Nikumaroro was believed by Ballard after an interpretation of a photograph.\n\nThe image was taken by a British officer aboard the S.S. Norwich City which wrecked near the island three months after the pair's disappearance.\n\nA photograph he took to reveal the ship's ill-fated voyage was later analysed and a tiny one millimeter smudge in the top left corner caused much speculation.\n\nThe blurry shape was analysed by the International Group for Historic Aircraft Recovery (TIGHAR) in 2010 after experts digitally enhance the decades old photograph.\n\nThey believed the tiny spot showed the remains of landing gear from Earhart's Lockheed craft.\n\nThe photograph and their other findings were then passed onto Ballard in 2012, who had a proven track record as a finder of lost things from over 60 years of experience.\n\nEarhart and her navigator Captain Fred Noonan, (pictured left and right), vanished over the Pacific Ocean during an attempt to circumnavigate the globe in 1937\n\nSome theorists believe Amelia Earhart's Lockheed Electra may have crashed into the Pacific due to visibility and fuel problems just short of their intended destination on Howland Island, killing both her and navigator Fred Noonan on July 2, 1937\n\nPrior to that, Ballard believed the Navy's version of Earhart's fate - that she died shortly after crashing into Pacific ocean, near the end of her round-the-world flight.\n\nHowever, when presented with the enhanced version of the smudge on the picture, Ballard said at the time: 'I'll be damned... that really narrows the search doesn't it,' according to the New York Times.\n\nThe photographs encouraged him to take on the exploration, which he had put off for years fearing 'too big a search area.'\n\n'The more I read, the more I was convinced I could do it,' the 77-year-old said, according to the Times.\n\nHe hoped his high-definition cameras that 3-D mapped that part of the ocean and the ROVs that could dive down 20,000 feet would reveal more.\n\nAt the time he accepted that the search would present plenty of challenges, adding: 'Imagine searching the side of a volcano at night with a flashlight.'\n\nBut the investigation has currently proved unsuccessful.\n\nBoth underwater and land teams have been searching for any clues as to Earhart's final resting place.\n\nBallard and others remain hopeful, with Richard E. Gillespie, who previously surveyed the area, believing debris may have scattered as time passed.", "description": "Dr. Erin Kimmerle confirmed that  DNA testing will be carried out on a skull found on a Pacific Island to determine if it belongs to missing aviation pioneer Amelia Earhart.", "authors": ["Leah Mcdonald For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/15/19743964-0-image-a-2_1571148189925.jpg", "published_at": "2019-10-15"}