{"pub": "dailymail", "url": "https://dailymail.co.uk/money/cars/article-6455813/Kia-e-Niro-electric-car-drive-review.html", "downloaded_at": "2019-10-05 08:38:10.750403+00:00", "title": "Kia e-Niro electric car first drive review", "language": "en", "text": "It's not often you're invited to one of the world's most heavily armed regions to test a new car, but that's exactly what I've done to get behind the wheel of the latest electric model due to arrive in the UK next year.\n\nI've travelled all the way to the demilitarized zone - or DMZ - separating South from North Korea to try Kia's answer to the Jaguar I-Pace and Tesla Model X, the all-new e-Niro.\n\nWhile it might not have the premium feel to go into battle with these £60,000-plus luxury vehicles, the £33,000 version I've been driving has all the artillery to become a worthy zero-emissions option for British car buyers wanting to ditch petrol and diesel.\n\nIn the zone: Ray Massey has been behind the wheel of the new Kia e-Niro electric car in the demilitarized zone - or DMZ - separating South from North Korea before it arrives in the UK next year\n\nNavigating the driving route around the Imjin River in the city of Paju in the democratic South, the new e-Niro hatchback not only looks but feels like a proper car to drive.\n\nIt's actually the sibling of the Hyundai Kona Electric and shares many of the same underpinnings.\n\nThe fully-loaded First Edition car I've been using - which will be the first to hit British shores in April 2019 - is priced from £32,995, once you take into account the £3,500 plug-in car grant subsidy available to buyers of low-emissions vehicles.\n\nThis gets you black leather upholstery, an eight-way adjustable driver’s seat, heated front seats and leather trimmed steering wheel, satin-finish interior door handles, and high gloss black fascia surfaces.\n\nNot bad for a family car with five seats and enough boot space for a weekend camping trip.\n\nIt feels robust too - far from one of those eccentrically flimsy death-trap bubble-cars that virtue-signalling eco-warriors used to champion in the early days of alternatively fuelled vehicles.\n\nAcceleration – particularly in 'sport' mode - is brisk and instantaneous with good pulling power from the off thanks to a hard-working 150kWh (201bhp) electric motor which propels the e-Niro from rest to 60mph in 7.5 seconds and up to a top speed of 104mph.\n\nOf all the adaptive driving modes available, this will be the most battery-sapping.\n\nHowever, there is a 'normal' and 'eco' setting, the latter of which will extend the range by softening the throttle response.\n\nThe Kia e-Niro is due to arrive in UK showrooms in April 2019, with First Edition cars priced from £32,995 - once you take into account the £3,500 plug-in vehicle subsidy\n\nRay Massey drove the zero-emissions model near the Imjin River in the city of Paju in the democratic South and was impressed how much it felt like a proper car to drive\n\nA hard-working 150kWh (201bhp) electric motor propels the e-Niro from rest to 60mph in 7.5 seconds and up to a top speed of 104mph\n\nSo how far can it go on a single charge?\n\nAccording to Kia, it has revised downwards by nearly 20 miles its driving range to a still impressive 282 miles – which I was on target to achieve during my test drive.\n\nThat means it would just fall short of a 300 mile non-stop trip from London to Newcastle. But a quick booster burst of electricity using the service station network of chargers should supply you with enough power while you're supping on a coffee and stretching your legs.\n\nThe manufacturer claims drivers can boost the battery to 80 per cent capacity in just 54 minutes when it's plugged into the most powerful (100kW) super-fast charger, or 1 hour and 15 minutes with a 50kW version.\n\nA full-charge with a 7.2kW charger will take 9 hours 50 minutes. While using a simple domestic plug will treble that to 29 hours.\n\nRegenerative braking also helps boost electric charge on the move by reclaiming energy that would otherwise be lost.\n\nThe Kia e-Niro is the sibling of the Hyundai Kona Electric and share many of the same underpinnings\n\nKia claims drivers can boost the battery to 80% capacity in just 54 minutes when it's plugged into the most powerful (100kW) super-fast charger, or 1 hour and 15 minutes with a 50kW version\n\nOn a full charge, the Kia Niro has an impressive driving range of 282 miles\n\nThe e-Niro will teach you to be a better electric-car driver\n\nThe car will even coach the driver on how to improve range by recommending when to coast and when to brake- allowing the battery to regenerate with more power while still in motion.\n\nKia said: ’The Coasting Guide Control alerts drivers as to the best time to lift off the accelerator and coast towards a junction, allowing the battery to regenerate under engine deceleration.’\n\nPaddles behind the steering wheel – used like gears despite there being a single continuous automatic transmission – allow drivers to choose between three levels of energy recuperation by the regenerative brakes.\n\nThe car will even coach the driver on how to improve range by recommending when to coast and when to brake- allowing the battery to regenerate with more power while still in motion\n\nThe heavy batteries are located between the two axles, meaning the centre of gravity is low to improve stability\n\nThe e-Niro's relatively low price - compared to rival electric models - could make it a viable option for Britons when it arrives next year\n\nAnd you can track your remaining charge using the eight-inch touchscreen on the dashboard.\n\nNot only does it update you on the range that's left in the battery pack but also highlights the nearest public charging points and even allowing owners to measure their lifetime CO2 emissions – and how much less this would be than a conventional petrol car of similar size.\n\nAnother seven-inch screen in the instrument cluster shows power flows to and from the battery, and can score the driver according to how economically they are driving.\n\nThe lack of a conventional petrol or diesel engine means it is very quiet – and almost silent – to the extent that people can’t hear you coming, especially at low speed in areas with lots of pedestrians. So you do have to be extra careful.\n\nFortunately, the car is nimble enough to perform evasive manoeuvres.\n\nThis is partly thanks to the batteries being located between the two axles, meaning the centre of gravity is low to improve stability.\n\n‹ Slide me › You can track your remaining charge using the 8-inch touchscreen on the dashboard. It even tells you how much further you could travel if you turned the air conditioning off\n\nAnother seven-inch screen in the instrument cluster shows power flows to and from the battery, and can score the driver according to how economically they are driving\n\nLaunch models come with full leather and are fully loaded with kit and safety features\n\nIt should be practical, safe and is covered by a 7-year warranty\n\nThe Kia e-Niro is available in five paint colours, including a shade called Pluto Brown that is unique to the model. However, if you want ‘premium’ paint you have to pay £565 extra.\n\nIn terms of practicality, there are 451 litres of space in the boot – with a compartment beneath the floor to store the charging cable – and flexible seating allows the rear seats to fold down to liberate even more space for load-lugging journeys.\n\nIt should be safe too, thanks to a host of safety systems including electronic stability and traction control, a driver awareness warning, and adaptive smart cruise control which matches the car’s speed to the flow of traffic and brakes automatically if a car cuts in front.\n\nFor peace of mind, Kia’s industry-leading seven-year/100.000 mile warranty also covers the e-Niro’s battery pack and the electric motor, and is fully transferable if the car is sold within the time or mileage limits.\n\nThere's plenty of rear legroom for passengers. And because it's electric it means there's no high transmission tunnel for the person sat in the middle seat\n\n‹ Slide me › There are 451 litres of space in the boot with the seat-backs up. Flexible seating allows the rear seats to fold down to liberate even more space for load-lugging journeys\n\nThere's a small storage compartment under the boot floor to carry the charging cables", "description": "Ray Massey has travelled all the way to the de-militarised zone - or DMZ - separating South from North Korea to try Kia's answer to the Jaguar I-Pace and Tesla Model X, the all-new e-Niro SUV.", "authors": ["Ray Massey For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2018/12/03/17/6954002-0-image-a-14_1543857065392.jpg", "published_at": "2018-12-04"}