{"pub": "mirror", "url": "https://mirror.co.uk/news/world-news/mythical-ancient-lost-city-king-20647847", "downloaded_at": "2019-10-18 11:49:37.586490+00:00", "title": "Mythical and ancient 'lost city of King of the Gods' uncovered in Cambodia", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAn ancient \"lost city\" dating back to the 9th Century has been mapped for the first time.\n\nThe legendary Mahendraparvata was feared lost forever, as scientists could not even agree where it was.\n\nIt was hidden in dense jungle, but advanced aerial mapping has finally allowed its location to be identified after years of searching.\n\nBut now experts say they can confidently state where temples and large palaces once stood, thanks to laser scanning.\n\nThe city is thought to have been the first capital of the powerful Khmer Empire, which ruled over large swathes of South East Asia between the ninth and 15th centuries.\n\n(Image: Getty Images/500px)\n\nIts name means the Mountain of Indra, King of the Gods.\n\nAlthough archaeologists knew of its existence from ancient records, it has long eluded them because the terrain is so difficult.\n\nExploring the area on foot has been incredibly dangerous because the evil Khmer Rouge, which ruled over Cambodia between 1975 and 1979, laid down landmines there.\n\nIt was the location of the Communist regime's last stand before it was finally defeated.\n\n(Image: Getty Images/iStockphoto)\n\nIt is located in the Phnom Kulen highlands, around 30 miles north of Siem Reap.\n\nDamian Evans, from the French Institute of Asian Studies in Paris, told the New Scientist: \"The city may not have lasted for centuries, or perhaps even decades, but the cultural and religious significance of the place has lasted right up until the present day.\"\n\nEven when it was the empire's capital, it was challenging for its inhabitants because it was so mountainous.\n\nThe city was built on a plateau measuring around 30 square miles, and followed a grid system.\n\n(Image: Getty Images/iStockphoto)\n\nMr Evans stated: “It shows a degree of centralised control and planning.\n\n\"What you’re seeing at Mahendraparvata... speaks of a grand vision and a fairly elaborate plan.\"", "description": "Although scientists knew of Mahendraparvata's existence, they have never definitively been able to say where it is", "authors": ["Dave Burke", "Image", "Getty Images", "Getty Images Istockphoto"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20647881.ece/ALTERNATES/s1200/0_Carvings-on-Victory-Gate-Angkor-Thom-Cambodia.jpg", "published_at": "2019-10-18"}