{"pub": "politico", "url": "https://politico.com/news/2019/10/28/trump-impeachment-witnesses-diplomats-congress-059622", "downloaded_at": "2019-10-28 09:49:39.975401+00:00", "title": "Trump impeachment witnesses leave a trail of tantalizing clues", "language": "en", "text": "“Neither government nor conspiracies can operate without a paper trail,” said Austin Evers, executive director of American Oversight, a watchdog group suing the Trump administration for Ukraine-linked documents. “These are busy people. They live by emails, texts and calendars.”\n\nPOLITICO spoke with former U.S. officials and oversight experts and scoured publicly available information from the testimonies. The following are just some of the key clues that witnesses have shared:\n\nTrump’s aid-freeze ‘directive’\n\nOf all the testimonies so far, that of William Taylor, the U.S. diplomat now leading the U.S. Embassy in Kyiv, appears most fruitful for investigators seeking a roadmap to documents they need — documents the State Department is resisting sharing for now.\n\nOne clue in particular stood out: a “directive” Trump is said to have given freezing U.S. military aid to Ukraine. House Democrats are trying to establish whether Trump froze the aid to pressure Ukraine’s government to open investigations into former Vice President Joe Biden, a political rival, and Biden’s son Hunter.\n\nAccording to Taylor’s opening statement, he learned of the directive while participating in a July 18 National Security Council secure video-conference call. A person Taylor described as a staff member of the Office of Management and Budget mentioned it.\n\n“All that the OMB staff person said was that the directive had come from the president to the (acting) chief of staff (Mick Mulvaney) to OMB,” Taylor said.\n\nA great deal will depend on whether the directive was in writing, and if so, whether Trump spelled out why he wanted the aid frozen. But even if it was not written down, there likely are other ways to establish the existence of Trump’s order, from call logs to notes taken by others of various officials’ interactions with the president.\n\nTaylor noted that after the OMB staffer’s explanation, a series of NSC-led interagency meetings followed in which participants concluded the security aid should be resumed. Staffers likely kept notes of those meetings, too. Taylor also mentioned that the Pentagon crafted an analysis of the aid’s effectiveness, another potential document.\n\nThe cable to Pompeo\n\nSecretary of State Mike Pompeo’s role has been an enduring mystery throughout the impeachment inquiry. But both Taylor and Marie Yovanovitch, the former U.S. ambassador to Ukraine that Pompeo pulled out early from her post, offered leads on that front.\n\nTaylor said that on Aug. 29, before he’d personally realized that the U.S. aid to Ukraine might have been frozen to help Trump’s political ambitions, he sent a cable to Pompeo conveying his concern about withholding the aid. Pompeo did not respond, Taylor said.\n\nThe cable itself could prove interesting, but Taylor also added that he’d heard that soon after receiving it, Pompeo took the cable with him to a meeting at the White House focused on security assistance for Ukraine. The notes from that meeting could prove significant, especially if there was any discussion of exactly why the aid was being withheld, or whether Pompeo spoke with the president about it.\n\nIn describing her removal, Yovanovitch mentioned a few tidbits that could shed light on Pompeo’s actions. She said that the State Department had asked her in early March to extend her tour in Ukraine until 2020; a document with that request is likely to exist, and would be evidence of her good standing in the role.\n\nShe also said that in late April she was told to fly back to Washington. That’s when Deputy Secretary of State John Sullivan told her she was being recalled early. According to Yovanovitch, Sulivan told her that she had “done nothing wrong” and that “the department had been under pressure from the president to remove me since the summer of 2018.”\n\nThat is nearly a year’s worth of time for such “pressure from the president.” Investigators will likely want to obtain emails, meeting notes and other materials linking the State Department, the White House and Yovanovitch. While Pompeo’s own communications could prove vital, those of his top aides and assistants – including Sullivan – could be just as enlightening.\n\nFormer U.S. ambassador to Ukraine Marie Yovanovitch. | Mikhail Palinchak, Presidential Press Service Pool Photo via AP\n\nThe administration will likely try to block the release of any document that was generated from the White House, even if it was sent to State, citing executive privilege. Odds are, though, that there are “intra-State” documents that wouldn’t be subject to such a claim. That’s true not just for what happened to Yovanovitch but also for the broader questions about Ukraine policy.\n\nThe “intra-State” conversations could include communications between Pompeo and Gordon Sondland, the U.S. ambassador to the European Union who was heavily involved in Ukraine policy through what Taylor described as the “irregular channel.” In his testimony, Sondland made a point of repeatedly suggesting Pompeo was in the loop. “I understand that all my actions involving Ukraine had the blessing of Secretary Pompeo as my work was consistent with long-standing U.S. foreign policy objectives,” he said.\n\nConversations with Ukrainians\n\nU.S. diplomats who have interactions of any substance with a foreign official typically document them, often through a cable or an email to others at the State Department so that they are up to date. According to the testimonies, there were many such interactions.\n\nFor instance, Bill Taylor referred to an odd June 28 conference call that first included him, Sondland, and others, and which was later broadened to include the new Ukrainian president, Volodymyr Zelensky.\n\nPrior to Zelensky joining, there were cryptic mentions of Trump’s desire to see Ukrainian investigations. Among those mentioning them was Kurt Volker, at the time the U.S. special envoy for Ukraine negotiations. Taylor said he “reported on this call” to Deputy Assistant Secretary of State George Kent and also wrote a “memo for the record” dated June 30 summarizing the conversation with Zelensky.\n\nWhile Taylor, a veteran diplomat with 50 years of government service, has indicated he rigorously documented interactions with the Ukrainians — as well as those with other State Department officials — it's less clear how much Sondland and Volker did the same.\n\nTheir record-keeping could help establish the basics of what was discussed during two critical meetings: A July 10 one in the White House between U.S. and Ukrainian officials; and a July 26 meeting in Kyiv between U.S. and Ukrainian officials. According to Taylor and Fiona Hill, a former National Security Council official, the July 10 meeting was especially explosive as then-national security adviser John Bolton grew livid at Sondland when he realized Trump’s political calculations might be playing a role in shaping Ukraine policy. In Sondland’s opening statement, however, he either leaves out or glosses over that aspect of the meeting.\n\nFormer National Security Council official Fiona Hill. | Evan Vucci/AP Photo\n\nVolker, a former Foreign Service officer, has already handed over a batch of text messages to investigators. He quit as special envoy and has been largely cooperative. Sondland had no diplomatic experience but was given an ambassadorship after donating $1 million to Trump’s inauguration. He has said the State Department has his relevant documents, but the department has been slow to respond to congressional subpoenas for the material.\n\nBut Sondland indicated in his testimony that he prefers to communicate orally when possible, although he insisted that’s not because he wants to avoid creating a record. Attempting to clarify why in some text message exchanges with others he used phrases like “Call me” or otherwise suggested stopping texting, he said, “In my view, diplomacy is best handled through back-and-forth conversation.”\n\nOutreach to Giuliani\n\nOne potentially valuable avenue for investigators is finding any and all communications between U.S. officials and Rudy Giuliani, the president’s personal lawyer.\n\nGiuliani was part of what Hill and Taylor depicted as a shadow foreign policy aimed at pressuring Ukraine to investigate the Bidens; Trump directed some of his diplomats to deal with Giuliani on aspects of U.S. policy toward Ukraine, according to the testimonies, and according to an interview outgoing Energy Secretary Rick Perry gave the Wall Street Journal.\n\nBecause Giuliani is not a U.S. government official, communications with him by U.S. officials — including texts or emails — should, in theory, be easier to obtain because they are unlikely to contain classified material. Giuliani may try to shield his communications by referring to attorney-client privilege, but legal experts insist that argument can be used only in a narrow manner.\n\nAmerican Oversight’s records request to the administration includes senior U.S. officials’ communications with Giuliani; this past week, a judge ordered the State Department to start sending over documents to the watchdog group within 30 days.\n\nThe unnamed\n\nFor every big name brought up in the inquiry, there are lower-level government officials whose own records may prove critical to piecing together the puzzle.\n\nWho was the unnamed OMB staffer Taylor mentioned? Who put Ukraine-related calls and meetings on the president’s calendar? Who wrote up the summaries of conclusions of Ukraine-related meetings at the National Security Council? Who took contemporaneous notes that match those summaries?\n\nIn a sense, the White House already has given Congress the most damning breadcrumb yet: the detailed readout of a July 25 phone call between Trump and Zelensky, in which the U.S. president repeatedly urges his Ukrainian counterpart to investigate Biden.\n\nFor an airtight case proving a “quid pro quo,” though, it might come down to the word of an administrative assistant. Did any White House aides, for instance, take contemporaneous notes of the president linking the military aid directly to political favors?\n\nFor now, the House committees overseeing the impeachment inquiry have put in broadly worded requests and subpoenas for documents. For instance, they’ve demanded “any and all records generated or received by the State Department in connection with or that refer, or relate in any way to the July 25 call.”\n\nThanks to the clues offered so far in the various testimonies, the president’s own advisers may have made that task far simpler.", "description": "", "authors": [], "top_image": "https://static.politico.com/a3/fb/656751d446469ed8af6126fd3922/20191027-william-taylor-ap-773.jpg", "published_at": "2019-10-28"}