{"pub": "metro", "url": "https://metro.co.uk/2019/10/15/gary-glitter-wont-earn-penny-royalties-joker-movie-outrage-song-usage-10925067", "downloaded_at": "2019-10-15 23:07:34.551033+00:00", "title": "Gary Glitter won’t earn royalties from Joker movie after backlash", "language": "en", "text": "Gary’s song is used for two minutes in Joker (Picture: DC Comics, Getty)\n\nConvicted paedophile Gary Glitter won’t earn any royalties from his song being used in the new Joker movie, despite previous reports to the contrary.\n\nThe 75-year-old’s song, Rock and Roll Part 2, features in a scene with Joaquin Phoenix who plays the iconic Batman character in the new standalone film.\n\nViewers were outraged to hear the song and were even more incensed when it was reported that Glitter was set to earn hundreds of thousands of pounds in royalties.\n\nHowever, the record label which owns the master recordings to Glitter’s music says he won’t receive a penny.\n\nSnapper, a London-based label, purchased the rights to the paedophile’s back catalogue in January 1997 before he was sent to prison for abusing three young girls.\n\nAddressing the royalties controversy, Snapper told the Los Angeles Times: ‘Gary Glitter does not get paid. We’ve had no contact with him. People generally come to us. We don’t promote it at all.’\n\nAdvertisement\n\nAdvertisement\n\nIt’s not the first time Rock and Roll Part 2, released in 1972, has featured in Hollywood TV shows and movies. Over the years, it has also appeared in Meet The Fockers, South Park, The Office and Boyhood.\n\nGary Glitter doesn’t receive a penny from his music according to his record label (Picture: Rex Features)\n\nSnapper does not sell physical copies of Glitter’s songs and they are only available as digital streams and downloads.\n\nIn the US, the rights to Rock and Roll Part 2 belong to Universal Music Publishing Group and BMG.\n\nA rep for Universal said: ‘Gary Glitter’s publishing interest in the copyright of his songs is owned by UMPG and other parties, therefore UMPG does not pay him any royalties or other considerations.’\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nTheir response comes after The Sun reported that experts said Glitter would receive a lump sum for allowing the song to be used, while royalties are expected to be paid based on the film’s performance in cinemas, DVD sales and sales of the soundtrack.\n\nIn 2013, it was claimed that Glitter had earned an estimated £1 million in royalties after Oasis sampled lyrics from his song Hello, Hello, I’m Back on their 1995 track Hello.\n\nAdvertisement\n\nAdvertisement\n\nRock and Roll Part 2 plays for around two minutes in The Joker, during a scene where the character walks down a long flight of steps marking his transformation into the villain.\n\nThe Joker, which stars Joaquin Phoenix and Robert De Niro, is out in cinemas now.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Gary Glitter ‘to earn staggering royalties’ from Joker movie as it grosses £234m at worldwide box office\n\nMORE: Paedophile Gary Glitter ‘booed off stage at prison karaoke’", "description": "Gary Glitter won't actually earn a penny in royalties from his song being used in Joker, following backlash from viewers.", "authors": ["Alicia Adejobi"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_88788499_1571158665.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-15"}