{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-usa-ransomware-insurance/global-insurers-face-quiet-strain-from-hacker-ransom-demands-idUKKBN1X41DT", "downloaded_at": "2019-10-25 16:43:11.021101+00:00", "title": "Global insurers face quiet strain from hacker ransom demands", "language": "en", "text": "NEW YORK (Reuters) - Global insurers that cover cyberattacks are facing more claims related to ransom-demanding hackers who cripple businesses’ technology systems, and only stop after receiving substantial payments.\n\nFILE PHOTO: A man types on a computer keyboard in Warsaw in this February 28, 2013 illustration file picture. Kacper Pempel/File Photo\n\nThese hackers use malicious programs known as ransomware to take down systems controlling everything from supply chains to payments to manufacturing. The hackers have grown more sophisticated during the past year, cybersecurity experts say, shifting from individuals and mom-and-pop operations to larger companies that can afford bigger ransoms.\n\nThe effort, known in the cybersecurity industry as “big game hunting,” has been paying off for hackers. It has also been hurting insurers that provide cyber coverage for victims, which are often mid-sized companies desperate to get their systems restored and running quickly.\n\n“They’re large enough to be worth extorting but not large enough to have sufficient network protections to defeat the ransomware,” said Brad Gow, global cyber product leader for insurer Sompo International.\n\nSompo has been fielding a spate of claims related to a ransomware strain known as “Ryuk,” Gow said. He described the victims as companies with annual revenue between $500 million (£390 million) and $1 billion.\n\nGraphic: Common industries targeted by ransomware - here\n\nThe number of attacks and size of ransom demands have been soaring.\n\nBusinesses detected 365% more ransomware attacks in the second quarter than they did a year earlier, according to Malwarebytes, which sells cybersecurity software. The average ransom nearly tripled, to $36,295, from $12,762 between the first and second quarters of this year, according to Coveware, a firm that helps negotiate and facilitate cyber-ransom payments.\n\nCriminals who dispatched the Ryuk strain have demanded as much as $5 million in bitcoin, the Federal Bureau of Investigation said in May.\n\n“We’ve seen an unprecedented amount of ransomware attacks in 2019,” said Eireann Leverett, a senior risk researcher at the University of Cambridge Centre for Risk Studies. The size of losses for those attacks poses a serious risk to the business, Leverett said.\n\nCompanies that have cyber insurance are often covered for a variety of expenses. They include: data recovery, legal liabilities for exposing sensitive customer information, negotiators fluent in hackers’ native languages and the ultimate ransom payments.\n\nCyber experts say the criminals launching ransomware against companies are organised gangs in Russia and eastern Europe, or hackers sponsored by foreign governments. Insurers sometimes have restrictions in their policies to avoid covering attacks by nations, but it can be difficult to know for sure what type of criminal is launching an attack.\n\nInsurers interviewed by Reuters said ransomware attacks are accelerating but declined to say how much they have paid in total claims.\n\nLloyd’s of London insurer Beazley expects to handle double-to-triple the number of ransomware incidents in 2019 as it did last year, including at least another 800 claims by year-end, according to Katherine Keefe, Beazley’s global head of breach response services.\n\nRansomware incidents during the third quarter increased 37% over the prior year quarter, Beazley said.\n\nSimilarly, Chubb Ltd had already responded to the same number of ransomware events by June of this year as it did for all of 2018, said Michael Tanenbaum, its head of cyber for North America.\n\nThe average Ryuk ransomware attack claim from large companies is roughly $2 million, said Wade Chmielinski, a cyber consultant for commercial property insurer FM Global. Claims from smaller companies are typically between $150,000 and $250,000. FM Global does not pay for ransoms, he said.\n\nOne prominent attack in March against Norwegian aluminium maker Norsk Hydro turned out to be a lot more expensive.\n\nNorsk Hydro is among the few public examples available of ransomware striking a business, because publicizing such events can invite more attacks, experts said.\n\nAfter its systems were paralysed by the LockerGoga strain of ransomware, Hydro experienced $60.1 million to $71.1 million (550 million to 650 million Norwegian crowns/£55 million) in related losses during the first half of 2019, the company said in a filing on Wednesday.\n\nIn March, Norsk Hydro identified American International Group Inc as its lead cyber insurer. An AIG spokesman declined comment.\n\nNorsk received a $3.6 million (33 million Norwegian crowns) insurance payout during the quarter and will report additional payouts when “deemed virtually certain,” the company said on Wednesday.\n\nGlobal insurers collected $7 billion to $8 billion in cyber-insurance premiums during 2018, up about 13% from 2017, according to ratings agency AM Best.\n\nBut insurers are grappling with pricing as ransomware attacks become more common. Many of those attacks occur in the dark, making their frequency hard to know or how severe losses are. Although a simple ransom payment is often the cheapest, easiest solution, it also emboldens hackers, said Robert Hudock, a lawyer in Washington who advises clients on dealing with cyber attacks.\n\n“It’s going to be a hard problem to solve,” he said, “if people keep paying the ransoms and the systems keep getting compromised.”", "description": "Global insurers that cover cyberattacks are facing more claims related to ransom-demanding hackers who cripple businesses’ technology systems, and only stop after receiving substantial payments.", "authors": ["Suzanne Barlyn", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191025&t=2&i=1444909504&w=1200&r=LYNXMPEF9O1C4", "published_at": "2019-10-25"}