{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7623765/The-unsuspecting-places-covered-drugs-Adelaide-named-meth-capital-world.html", "downloaded_at": "2019-10-29 02:52:15.429998+00:00", "title": "The unsuspecting places covered in drugs - after Adelaide was named meth capital of the world", "language": "en", "text": "It was last week named the world's ice capital, and further research has found Adelaide is literally covered in traces of drugs.\n\nTraces of cocaine and cannabis have been found at family friendly parks, playgrounds, train stations and on money in the city.\n\nAfter Adelaide was branded the world's meth capital, Today Tonight headed out into the city with testing kits to see just how bad the city's drug problem is.\n\nScroll down for video\n\nAdelaide Railway Station (pictured) was one of the areas found positive for traces of cannabis\n\nThe Hindmarsh Square Playground (pictured) was swabbed and found positive for traces of cocaine\n\nAdelaide Railway Station and the Playford Alive Town Park in Munno Para were both found to have traces of cannabis.\n\nMeanwhile, traces of cocaine were found at the Hindmarsh Square playground.\n\nSwab tests conducted on loose cash came up positive for cannabis and cocaine.\n\nSwab tests were also conducted on Parliament, the Kensington Gardens playgrounds, the Burnside Village toilets and Colonnades Train Station, but those areas tested negative for drugs.\n\nAdelaide was branded the world's ice capital after tests on waste water in cities around the world found the South Australian city had more milligrams of ice per person that any other place tested.\n\nAdelaide had between 507mg and 659mg of ice per 1,000 people every day.\n\nThe Playford Alive Town Park in Munno Para (pictured) tested positive for cannabis\n\nThe study analysed waste water samples from 120 major worldwide cities between 2011 and 2017.\n\nThe only city to come close to Adelaide was Seattle, with 418mg on average over the three years the city's wastewater was tested, according to ABC News.\n\nNo other US cities took part in the investigation.\n\nCanberra and Toowoomba had between 270 and 331mg of ice per 1,000 people.\n\nDespite the startling figures, University of South Australia research associate Richard Bade told the publication methamphetamine use was actually on the decline.\n\n'To put into a bit of context, the study was from 2017 and in fact since that time methamphetamine use in South Australia has actually been on the decrease,' Dr Bade said.\n\n'And there's been plenty of initiatives around that reduction of methamphetamine use in Adelaide.'", "description": "Family friendly parks, playgrounds, train stations and even money have been found with traces of cocaine and cannabis within Adelaide.", "authors": ["Paula Ahillon", "Adam Mccleery For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/23/20303554-0-image-a-2_1572304466103.jpg", "published_at": "2019-10-29"}