{"pub": "yahoo", "url": "https://news.yahoo.com/pressure-builds-president-trump-revelations-003540442.html", "downloaded_at": "2019-10-18 01:22:44.648926+00:00", "title": "Pressure Builds on President Trump As New Revelations Emerge About His Dealings with Ukraine", "language": "en", "text": "As Donald Trump flew to Texas Thursday for a fundraiser and rally, the revelations about the President’s involvement in Ukraine escalated into a full-fledged crisis.\n\nMick Mulvaney, the acting White House chief of staff, undercut the President’s denial of a quid pro quo when he told reporters that Trump withheld military aid as leverage to push Ukraine to investigate Democrats’ activity during the 2016 election—and then reversed himself hours later. Energy Secretary Rick Perry said he contacted Trump’s personal lawyer Rudy Giuliani at the president’s behest to talk about Ukraine—and then resigned. And European Union Ambassador Gordon Sondland told House investigators that Trump had delegated power over U.S. foreign policy in Ukraine to Giuliani, and added that it was “wrong” to link political requests to actions on Ukraine.\n\nIt’s not yet clear how Trump’s mounting troubles will affect the impeachment proceedings in Congress. Even if the Democratic House votes to impeach the President, the Republican-controlled Senate must vote to convict him in order to remove him from office. But the events of the past 24 hours have turned up the pressure on an increasingly embattled Trump.\n\nIn the White House briefing room Thursday, Mulvaney publicly confirmed that Trump wanted Ukraine to investigate Democratic Party actions during the 2016 election in exchange for releasing the flow of military aid. “The look back to what happened in 2016 certainly was part of the thing he was worried about in corruption with that nation, and that is absolutely appropriate,” Mulvaney said, explaining why the aid to Ukraine was delayed. “Get over it. There’s going to be political influence in foreign policy.”\n\n“Did he also mention to me in [the] past the corruption related to the DNC server? Absolutely,” Mulvaney said, confirming that Trump had also brought up the debunked conspiracy that Ukrainian individuals were involved in the investigation into the Russian hacking of the DNC server in 2016. “No question about that. But that’s it, and that’s why we held up the money.”\n\nAfter Trump’s senior-most aide announced publicly that political considerations influenced Trump’s foreign policy, Trump allies scrambled to do damage control. Trump’s personal lawyer Jay Sekulow told TIME Trump’s legal counsel “was not involved” in Mulvaney’s briefing, and a senior official in the Department of Justice also distanced DOJ from Mulvaney’s comments. “If the White House was withholding aid in regards to the cooperation of any investigation at the Department of Justice, that is news to us,” the official wrote in a statement.\n\nThe reaction was swift. Within hours, Mulvaney had walked back his comments, repeatedly asserting that the White House decision to hold up nearly $400 million in military aid had nothing to do with an investigation into hacking the Democratic National Committee’s server and whether that server ended up in Ukraine. “Let me be clear, there was absolutely no quid pro quo between Ukrainian military aid and any investigation into the 2016 election,” he said in a statement. “There never was any condition on the flow of the aid related to the matter of the DNC server.” Mulvaney’s carefully-worded statement pointedly did not mention any other investigations into Democrats, including Trump’s fixation on Burisma, the Ukrainian gas company that once employed former Vice President Biden’s son.\n\nWhile Mulvaney said during the press briefing that the delay in military aid “had absolutely nothing to do with Biden,” his subsequent statement did not mention Burisma or Biden at all. The omission was conspicuous in part because text messages made public by House investigators last week made it clear that Ukrainian officials believed that the White House visit they sought was dependent on their opening a probe into both the DNC server and Burisma. “Once we have a date we will call for a press briefing,” a Zelensky aide texted the U.S. envoy to Ukraine Kurt Volker. The briefing would announce “among other things Burisma and election meddling in investigations,” he wrote. Volker responded, “Sounds great!”\n\nWhile Mulvaney’s comments exploded onto cable news chyrons, Trump’s hand-picked ambassador to the European Union, GOP donor Gordon Sondland, began speaking to House investigators. He told them it would have been “wrong” to withhold military aid in an effort to pressure Ukraine to take on a political investigation. “Let me state clearly: Inviting a foreign government to undertake investigations for the purpose of influencing an upcoming U.S. election would be wrong,” Sondland said. “Withholding foreign aid in order to pressure a foreign government to take such steps would be wrong. I did not and would not ever participate in such undertakings.”", "description": "It’s not yet clear how Trump’s mounting troubles will affect the impeachment proceedings in Congress.", "authors": ["Brian Bennett"], "top_image": "https://s.yimg.com/uu/api/res/1.2/GTyx6TZH1JSo8aqzGxVrmw--~B/aD03MTQ7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/time_72/8b7918e8a9e48ecaa6b7fd2c5960d17e", "published_at": "2019-10-18"}