{"pub": "businessinsider", "url": "https://businessinsider.com/heres-whats-next-for-army-night-vision-technology-2019-10", "downloaded_at": "2019-10-14 23:16:34.125340+00:00", "title": "The US Army just got its hands on the best night-vision goggles in the world — here's what it can do and what's next", "language": "en", "text": "The US Army recently fielded the Enhanced Night Vision Goggles - Binocular, the most cutting-edge technology of its kind fielded to conventional forces.\n\nBut, the ENVG-B also came with other technology, such as the Family of Weapon Sights - Individual that lets soldiers shoot from the hip and around corners.\n\nBy the end of the year, this tech will be linked to the Nett Warrior device, allowing for augmented reality capabilities designed to boost individual soldier and squad performance.\n\nAnd down the road, soldiers will be able to see live video feed from operational Soldier Borne Sensor drones right in their goggles. And while the Army has yet to field this tech, it is already thinking about how to build on it.\n\nClick here for more BI Prime stories.\n\nThe US Army is changing the way it looks at equipping soldiers for battle, shifting from simply adding more and more gear to integrating systems, and one of the best examples is what the service is doing with its new night-vision goggles.\n\nWith the new goggles, the Army didn't just acquire new night-vision technology. It also integrated other new technologies such as connected weapon sights that turn any soldier into a top marksmen and network devices that allow for the sharing of data across augmented reality platforms.\n\nAnd down the road, the service intends to incorporate the new squad-level mini-drones into the mix while moving everything into a plug-and-play open architecture that will allow for the addition of new capabilities as technology advances.\n\n\"For years, dismounted Soldiers have been overburdened by equipment which, while highly effective, often isn't integrated with other equipment,\" Brig. Gen. Anthony Potts, Program Executive Office Soldier, explained in August.\n\nThat's changing.\n\n\"Adding more does not help, but integrating is really what can drive progress,\" Maj. John Nikiforakis, a former Army platoon leader who serves as the Assistant Product Manager for the new Enhanced Night Vision Goggles - Binocular (ENVG-B) program at PEO Soldier, told Business Insider.\n\n\"We're not fielding just one piece at a time anymore. We are trying to field whole sets of equipment that enable that squad to be more lethal,\" he added, explaining that while all these systems can be used individually, \"when you put them all together, that is when you get the most bang for your buck.\"\n\nEnhanced Night Vision Goggles - Binocular (ENVG-B)\n\nA soldier with the ENVG-B during a touchpoint exercise this past summer Patrick Ferraris/PEO Soldier\n\nIn late September, soldiers with the 2nd Brigade Combat Team, 1st Infantry Division at Fort Riley, Kansas became the first to get their hands on L3's ENVG-B.\n\nA replacement for the AN/PVS-14 monocular night vision device (MNVD) that has been in use for nearly two decades, \"the ENVG-B is the most advanced night-vision goggles fielded to conventional forces to date,\" Nikiforakis said. \"There's nothing even close to it.\"\n\nThe new night-vision goggles offer improved situational awareness and depth perception for greater mobility, high resolution white phosphor tubes (a significant improvement over the green phosphor tubes), and thermal imaging for improved target recognition in the face of various battlefield obscurrants.\n\nThe new ENVG-B can be mounted on the Integrated Head Protection System (IHPS), a Ceradyne Inc. product developed as a replacement for the Enhanced Combat Helmet. It was first fielded earlier this year to the 3rd Brigade Combat Team, 82nd Airborne Division at Fort Bragg, North Carolina.\n\nFamily of Weapon Sights - Individual (FWS-I)\n\nSoldier entering a room with the ENVG-B and the FWS-I Courtesy of PEO Soldier\n\nThe ENVG-B is wirelessly connected to BAE System's FWS-I, displaying the weapon sight reticle (crosshairs) in the goggles so that the soldier can fire from the hip or around a corner or over a barrier accurately without looking. This development was fielded along with the ENVG-B in September.\n\nRead more: A Marine tore up distant targets while lying on his back and shooting backwards over his shoulder with the help of this new weapons tech\n\nNot only does the FWS-I allow for rapid target acquisition and reduce exposure to enemy fire — because a soldier doesn't need to expose themself to get a visual around a corner or obstruction — but it has dramatically improved soldier marksmanship.\n\nBrig. Gen. Dave Hodne, the director of the Army's Soldier Lethality Cross-Functional Team, told reporters last October that he \"can't imagine, right now, any future sighting system that will not have that kind of capability.\"\n\nThe FWS-I, like the ENVG-B, runs on AA batteries, but the Army is in the process of developing a standardized tethered battery for improved performance.\n\nNett Warrior\n\n2nd Security Force Assistance Brigade training on new Integrated Tactical Network capabilities using the improved Nett Warrior end-user device US Army/JRTC Public Affairs\n\nThe ENVG-B has the ability to connect to the Android Tactical Assault Kit (ATAK) software on the Samsung Nett Warrior end-user device carried by soldiers for augmented reality capabilities aimed at providing better squad-level performance.\n\nUsing the Nett Warrior device, which was first introduced a few years ago, soldiers can pre-plot targets, pre-plot friendly forces, and connect with other service members integrated into the tactical network.\n\nImportant mission points and objectives, such as a target house, can be digitally marked on a map on the Nett Warrior device and then broadcast into a soldier's field of view in their goggles, and all connected squad members can see the same thing.\n\nThis capability was actually tested successfully back in April at Fort Drum with the 10th Mountain Division.\n\nThe soldiers who received the ENVG-B and FWS-I in September do not currently have this ability, but by the end of the year, the Army will have soldiers with full capability sets.\n\nSoldier Borne Sensor (SBS)\n\nFLIR Black Hornet III FLIR Systems\n\nA next step for the Army may be connecting the FLIR Black Hornet personal reconnaissance drones, which were fielded as part of the Soldier Borne Sensor (SBS) program, to soldiers in the 3rd Brigade Combat Team, 82nd Airborne Division at Fort Bragg, North Carolina a few months ago, to the ENVG-B so that soldiers can see live video from these tiny unmanned assets in their goggles.\n\nRead more: The US Army wants to combine its powerful new night-vision goggles and its new pocket-sized spy drones so soldiers can see the battlefield like never before\n\nWhile there is currently no set timeline on fielding this technology, an attempt by PEO Soldier to explore the art of the possible, the Army has managed to successfully link the two systems.\n\n\"If you were to take it out today and use it, you could see a video feed from the camera on the SBS drone in your night vision goggles without issue,\" Kevin Brown, the Assistant Program Manager for SBS at PEO Soldier, told Business Insider.\n\nThis technology works by sending a wireless signal from the SBS drone to the wireless antenna on the ENVG-B, which then relays the data to the Nett Warrior device. The end-user device then broadcasts the video feed in the goggles in real time. The video the drone operator sees can also be shared wirelessly with every connected member in the squad.\n\nWhat's next?\n\nA New Hampshire Army National Guard soldier shows her team the route they will take during an ENVG-B touchpoint exercise Patrick Ferraris/PEO Soldier\n\nThe Army doesn't want to just stop there though.\n\n\"The fact that the squad leader can see what the SBS drone sees with their ENVG-B is outstanding,\" Nikiforakis told Business Insider. \"But how come the headquarters element can't see the same feed? How come that same feed can't be sent forward to attack aviation?\n\n\"That interconnectivity, the ability to send data across the battlefield,\" he said, \"that is where we should be going. Me seeing one thing is great, but what if I can bring in enablers to enhance that lethality and to really not fight a fair fight.\"\n\nThe service's ambitions here play directly into the larger plans for every sensor-every shooter connectivity for multi-domain operations that the Army, as well as other services, have been looking at more closely as they prepare for high-end warfare against near-peer threats.\n\nThe Army is also pursuing an Adaptive Squad Architecture (ASA) system, something loosely akin to the open architecture for app development for smart phones and related products, to permit the seamless integration of new technologies as they become available to the warfighter.\n\nPEO Soldier has plans to eventually integrate the ENVG-B and its affiliated systems into the ASA.", "description": "The Army is changing the way it equips soldiers for battle, and one of the best examples is what the Army is doing with its new night-vision goggles.", "authors": ["Ryan Pickrell"], "top_image": "https://image.businessinsider.com/5da345184af9094de15c34e4?width=1200&format=jpeg", "published_at": "2019-10-14"}