{"pub": "yahoo", "url": "https://news.yahoo.com/hong-kong-protests-set-escalate-104146570.html", "downloaded_at": "2019-10-04 03:02:25.939631+00:00", "title": "Police Call for Hong Kong Curfew as Shooting of Protester Sparks Fury", "language": "en", "text": "(Bloomberg) -- A Hong Kong police officer who fired a bullet into the chest of an 18-year-old protester may have inadvertently given new life to the months-long movement challenging Beijing’s authority.\n\nDemonstrators hit the streets again on Wednesday following the release of videos showing the man getting shot at close range after striking the officer with a rod. The violent images, juxtaposed with a triumphant Chinese President Xi Jinping celebrating 70 years of Communist rule in Beijing, could now help drive momentum for the protests until local elections in November -- the next big date on the political calendar.\n\n“People were expecting that the government and Beijing would have loved to see the end of everything by National Day,” said Alvin Yeung, an opposition lawmaker. “And obviously, it was a failure -- it was chaotic, and finally a real bullet has been shot at a student, which is a turning point.”\n\n“People are very angry and you can imagine that the general public, especially the younger protesters, will take their anger and turn it into real action, physical revenge,” he said. “This unrest will continue and could escalate.”\n\nHong Kong police groups called on the government Wednesday to access powerful colonial-era laws to impose curfews and other measures to keep people off the streets. “In the face of such a massive series of rioting incidents, we cannot work alone without appropriate measures and support from the top level,” Junior Police Officers’ Association chairman Lam Chi-wai said in a statement.\n\nOver the last few months, pro-democracy demonstrators have seized on violent incidents to rally supporters in a movement that began four months ago to oppose a proposed bill allowing extradition to China.\n\nThere was a high-profile suicide of a protester in June. A month later alleged triad members viciously attacked black-shirted demonstrators on the subway. Then in August a woman was reportedly hit in the eye with a non-lethal round, prompting other protesters to start wearing bloody eye-patches and spray paint “an eye for an eye” while storming the international airport.\n\n‘More Determined’\n\nThe anger was palpable during a protest in central Hong Kong on Wednesday, even as reports emerged that the shot protester was in stable condition and expected to survive. Police fired more than 1,400 rounds of tear gas on Tuesday -- more than half of the total fired since protests began June 9 -- and fired six live bullets, five as warning shots.\n\n“The police force should be disbanded and get sanctioned for what they are doing,” said a man surnamed Lee, who declined to give his full name as he chanted slogans with dozens of others. “We will fight on.”\n\nThe Civil Human Rights Front, which has organized some of the city’s largest peaceful gatherings over the past few months, pledged a “large-scale mobilization” as a result of the shooting.\n\n“We will be even more united, even more determined in our resistance,” the group said in a Facebook post. “From now on, October 1st will be an anniversary for the suppression of Hong Kong people with live rounds.”\n\nSo far nobody has been killed in the protests, a fact that Hong Kong leader Carrie Lam called “quite remarkable” last week. She has defended the police force and commended officers for using restraint in the face of attacks by some protesters wielding metal bars, hammers, bricks, and Molotov cocktails.\n\nWhile Lam withdrew the bill that initially sparked the protests in June, she has refused to give in to other demands by the protesters -- including an independent inquiry into police violence. That stance is backed by China, which has ruled out allowing Hong Kong to pick a ruler who will stand up to Beijing.\n\nSamson Yuen, an assistant professor at Lingnan University who has conducted numerous surveys among protesters including this week, said demonstrators are consistently saying they are motivated by the inability to choose their own political leaders rather than economic factors, as the government insists.\n\n“People are concerned about the illegitimacy of the system,” he said. “The shooting will have a huge impact on the emotion among the protesters. And the fact that the police have insisted it was a right and reasonable action, this will definitely lead to a backlash among the protesters.”", "description": "(Bloomberg) -- A Hong Kong police officer who fired a bullet into the chest of an 18-year-old protester may have inadvertently given new life to the months-long movement challenging Beijing’s authority.Demonstrators hit the streets again on Wednesday following the release of videos showing the man getting", "authors": ["Iain Marlow"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Ia7jr07CdrBB2A2VN_oyXg--~B/aD04MjY7dz0xMjk2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_politics_602/16647511901f6f7fc08eda0826ac1586", "published_at": "2019-10-03"}