{"pub": "businessinsider", "url": "https://businessinsider.com/logan-paul-interview-tiktok-professional-boxing-music-album-tana-mongeau-2019-10", "downloaded_at": "2019-10-19 11:36:41.660609+00:00", "title": "Logan Paul reveals his plans to become a professional boxer, release a music album, and try out TikTok in the future", "language": "en", "text": "Logan Paul, one of the most controversial and popular personalities on YouTube, is set to face off in a boxing match next month against KSI, another YouTuber with a massive following.\n\nThe 24-year-old recently told Business Insider about his training regimen ahead of the fight, and even his aspirations to become a professional boxer.\n\nBeyond boxing, Paul shared that he plans to soon release an album of pop music, hasn't ruled out joining TikTok, and is \"obsessed with doing as much as I possibly can before I die.\"\n\nVisit Business Insider's homepage for more stories.\n\nLogan Paul has never shied away from making risky and questionable career moves in the past, so it should come as no surprise the 24-year-old isn't ruling out anything now.\n\nThe YouTuber recently told Business Insider about his plans for the future, and not once did he mention the platform where he has over 25 million subscribers. His widespread ambitions seem to stem from a proverbial bucket list item: an obsession \"with doing as much as I possibly can before I die,\" Paul said.\n\nFirst up is becoming a professional boxer, a feat he says he's already achieved ahead of his boxing match next month against fellow YouTuber KSI. The bout is the second time the two YouTubers will face off, following their match last year, which generated an estimated $11 million in revenue but ended in a draw. Paul says that while he only trained for a few short months before the fight last year, he's wholly more prepared this time.\n\n\"They're making a machine out of me,\" Paul told Business Insider, referencing his trainers. \"I'm eating 80 pounds a day. I'm drinking the blood of cows, and I'm pushing a lot of weights in the air and putting them down.\"\n\nRead more:How Logan Paul went from making videos in his backyard to becoming a 24-year-old millionaire and one of the most controversial stars on YouTube\n\nIf there's one thing we can be sure Paul doesn't lack ahead of his fight, it's confidence. Paul has challenged Conor McGregor to a fight on at least two separate occasions, and said in a pre-fight press conference that he would kill KSI (along with some poorly placed disses about abortion).\n\nYouTubers KSI and Logan Paul boxing on August 28, 2018. Reuters\n\nIt's the same amount of confidence that Paul brought to a charity track-and-field tournament he hosted earlier this summer, ahead of which he repeatedly claimed that not only was he the fastest YouTuber, but the fastest person in the entire world. Paul put $100,000 on the line behind his claim — which is, admittedly, a drop in the bucket for a guy who brought in an estimated $14.5 million in a single year. However, Paul didn't live up to his claim: He had to be helped off the track after pulling his hamstring halfway through the 100-meter dash.\n\nHowever, professional athletics isn't the only direction that Paul sees himself taking in the future. And maybe it's for the best he's looking beyond YouTube: The platform is where Paul has found himself embroiled in controversy the most frequently. It's where he's shared videos of himself Tasering dead rats, and filming a dead body in Japan's \"suicide forest.\" Although he hasn't been kicked off of YouTube, he's had his ad revenue suspended there, and hasn't been allowed at VidCon — the biggest convention for online video and online creators — since he incited a mob at the event in 2017.\n\nBut YouTube wasn't the first platform that Paul found success on, and it may not be the last. Paul was a star on Vine back when he was a Midwestern high-school student, and he had 9.4 million followers on it before the video-looping app shut down in 2017. His early success led him to drop out of college — where he studied industrial engineering — to pursue his career in entertainment.\n\nJust as the entertainment world has shifted from Vine to YouTube, it's now shifting again. 2019 has been the year of TikTok, and Paul told Business Insider he hasn't ruled out exploring the Generation Z-loved platform. (Paul does have a TikTok account, but he hasn't posted to it since before the app merged with Musical.ly in August 2018.)\n\n\"I'll make some TikToks, who knows?\" Paul said.\n\nAside from his upcoming boxing match, Paul told Business Insider he's planning to release an album of pop music \"soon.\"\n\nLogan Paul trying out a new song at Macau in 2015. Caroline Moss/Tech Insider\n\nBut his time as a self-proclaimed \"weird internet star\" isn't likely to sunset anytime soon as he continues to vlog his crazy antics and host episodes of his podcast \"Impaulsive.\" Paul and his younger brother, Jake, are two of the most well-known, headline-grabbing online stars: Jake's recent wedding to YouTuber Tana Mongeau was essentially the YouTube world's version of a royal wedding, and questions over the relationship's legitimacy has only added fuel to the drama surrounding it.\n\nOf course, Logan Paul has been a part of the story, and chimed in with comments to add even more questions about whether the marriage is all just a \"publicity stunt.\" But Paul told Business Insider this week that Mongeau is essentially now a part of the Paul family.\n\n\"Tana's incredible. She's like a brother to me, but with boobs,\" Paul said. \"She's adjusting like a finely tuned guitar.\"\n\nLogan Paul will fight head-to-head with KSI on November 9 at Staples Center in Los Angeles. The boxing match will also be livestreamed exclusively on the app DAZN.", "description": "Logan Paul, one of the most controversial personalities on YouTube, is set to face-off in a boxing match next month against KSI, another YouTuber.", "authors": ["Paige Leskin"], "top_image": "https://image.businessinsider.com/5da8d36a4af909362c3d7716?width=1200&format=jpeg", "published_at": "2019-10-18"}