{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7631117/Kerry-Washington-dazzles-head-toe-purple-says-Today-visit-new-movie.html", "downloaded_at": "2019-10-30 23:32:35.332738+00:00", "title": "Kerry Washington dazzles in head-to-toe purple as she says during Today show visit new movie '", "language": "en", "text": "Kerry Washington stepped out in New York City early on Wednesday morning for her appearance on the Today Show.\n\nBut that didn't stop the 42-year-old from turning heads in a head-to-toe purple number as she headed inside the studio.\n\nWhen speaking with Hoda Kotb she gave a bit of insight to her latest movie American Son which is set to premiere on Netflix this Friday.\n\nPromo time! Kerry Washington stepped out in New York City early on Wednesday morning for her appearance on the Today Show\n\nFor the occasion she wore a bold purple lip that coordinated with the rest of her eccentric look.\n\nShe bundled up for the cold weather in a purple turtle-neck that she paired with a pair of purple snakeskin pants.\n\nHer short hair was curled to show off a pair of large hoop earrings ahead of her appearance.\n\nStylish: For the occasion she wore a bold purple lip that coordinated with the rest of her eccentric look\n\n'I really feel like this film begins when the credits roll at the end. This is a film about how we have the conversation, how we cross these divides,' she said during her Today Show segment.\n\n'So much what I think this piece is about is unconscious bias and how we make judgement about people,' she said later in the interview.\n\nThe Scandal actress starred in the original Broadway play and as reprised her role for the Netflix adaptation.\n\nKerry is also joined by her original co-star Steven Pasquale and director Kenny Leon.\n\nDetails: She bundled up for the cold weather in a purple turtle-neck that she paired with a pair of purple snakeskin pants\n\n'It was so important for me to allow people the privilege of stepping into the lives of this family and being on this roller coaster ride with them,' she said during a recent interview with ET.\n\n'Because I think it gives us all an opportunity to reflect on who we are as a society right now, reflect on who we are in our marriages, in our homes with our kids and just take stock of where we're at and how we're doing.'\n\nThe film follows Kerry and her on-screen husband as they search for their missing interracial son.", "description": "Kerry Washington stepped out in New York City early on Wednesday for her appearance on the Today Show. But that didn't stop the 42-year-old from turning heads in a head-to-toe purple number.", "authors": ["Shelslaughter At Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/16/20383982-0-image-a-36_1572452797352.jpg", "published_at": "2019-10-30"}