{"pub": "marketwatch", "url": "https://marketwatch.com/story/peloton-ipo-five-things-to-know-about-the-interactive-exercise-machine-company-2019-08-28?mod=rsswn", "downloaded_at": "2019-09-10 23:28:08.647033+00:00", "title": "Peloton IPO: 5 things to know about the interactive exercise-machine company", "language": "en", "text": "Peloton Interactive Inc. is a company that sells connected exercise machines and fitness classes.\n\nHowever, according to the very first substantive section of Peloton’s PTON, +0.00% filing for an initial public offering, that is not what the company is. Instead, it is described as a technology company, a media company, a software company, a product-design company, a retail company, an apparel company and “a social connection company that enables our community to support one another.”\n\nChief Executive John Foley had another explanation in a letter to prospective investors, though: “Peloton sells happiness.”\n\nIn reality, though, Peloton sells exercise bikes and treadmills and streams fitness classes to those devices through a touchscreen included with the machines. And it commands a premium price of thousands of dollars for the machines and $40 a month for a subscription to its classes, over 40% more than it costs to produce both the hardware and content.\n\nPeloton’s need to support seven different companies under one roof is keeping it from turning those healthy margins into anything close to profit, however, despite earlier “weird” claims from the chief executive. The company has racked up more than half a billion dollars in losses since being formed in 2012, even as revenue has exploded higher, doubling to more than $900 million dollars in its most recent fiscal year, which ended June 30.\n\nLess than two months after the end of its fiscal year, Peloton filed to go public in late August, and updated its filing Tuesday afternoon to state that it intends to raise more than $1 billion. Peloton declared a target pricing range of $26 to $29, and plans to sell at least 40 million shares; underwriters will have access to an additional 6 million shares. At the top of its range, Peloton would collect about $1.16 billion before the sale of the additional shares, at a valuation of about $8 billion.\n\nPeloton’s IPO will be led by Goldman Sachs and J.P. Morgan, though they are just the top two of more than 20 banks with a hand in the offering. The company plans to list its stock on the Nasdaq Global Select Market under the ticker symbol PTON.\n\nHere are five things to know about Peloton, based on its nearly 200-page filing with the Securities and Exchange Commission.\n\nSome impressive numbers\n\nPeloton sells two types of fitness machines, a $2,200 exercise bike and $4,295 treadmill, and monthly subscription plans. It disclosed overall sales of 577,000 fitness machines, almost all of them in the United States, and claims 1.4 million “members.”\n\nThose members have roughly 511,000 subscriptions to Peloton’s core streaming offering, which costs $40 a month and is, on average, used by exactly two “members,” according to Peloton. Another 102,000 people or so pay nearly $20 a month for a lesser subscription, which offers exercise classes that don’t require a machine, such as yoga and walking/running.\n\nRevenue has exploded higher as those numbers have grown in the past two years, more than doubling in the most recent fiscal year to move near $1 billion annually. In its 2019 fiscal year, Peloton recorded revenue of $719.2 million from sales of its fitness machines, up from $348.6 million in 2018 and $183.5 million in 2017. Its subscription revenue grew to $181.1 million from $80.3 million in 2018 and $32.5 million in 2017. Overall revenue, which includes apparel and some other business, was $915 million in the year ended June 30, up from $435 million in 2018 and $218.6 million in 2017.\n\nSee also: This dad rant compares ‘ridiculous’ Peloton bikes to cocaine\n\nWhile gross margins topped 40% for both its product and subscription services, Peloton’s net losses grew at an even greater rate than its revenue in 2019, thanks to a surge in spending on sales and marketing as well as general and administrative costs. Its net loss in 2019 was $195.6 million, up from $47.9 million in 2018 and $71.1 million in 2017. The net losses attributable to common shareholders was even higher in 2017 and 2019 due to the exercise of shares and convertible debt in those years.\n\nBut are those numbers trustworthy?\n\nWhile compiling all those numbers for the SEC and prospective investors, Peloton realized that it did not have a good handle on its accounting and reporting, and it hasn’t fixed the issues yet. The company voluntarily included disclosure of an ongoing material weaknesses in its financial reporting in the risk factors section of its filing, an admission that it does not have proper control of its “information technology general controls, controls to address segregation of certain accounting duties, timely reconciliation and analysis of certain key accounts and the review of journal entries.”\n\nAs an emerging growth company, Peloton is not required to have its auditor, Ernst & Young, provide an opinion on these accounting and reporting controls yet, but it clearly believed that the weaknesses it found are serious enough to tell investors anyway. By acknowledging the weaknesses, Peloton admits its lack of competent professionals to monitor and control its financial software and its monthly financial statement preparation process could allow material errors and misstatements in its financial statements.\n\nSee also: Five things to know about the Cloudflare IPO\n\nPeloton’s adjusted metrics are also potentially misunderstood. For instance, the company offers “churn” numbers — which reflect how many customers are cancelling their subscriptions — as “Average Net Monthly Connected Fitness Churn” and says that churn was just 0.7%. However, that number includes an undisclosed number of users who have “paused” their subscription for up to three months, as well as users who prepaid for a year or more of the subscription and cannot cancel yet, and many other factors that could create wide estimates on what it says about actual churn.\n\n1/ $PTON Peloton subscriber churn looks to me to be around 20-30% per year. But they reported churn of 0.7%!!\n\nMath with me here.. the reported churn is a 'monthly' churn, calculated as net cancels in the period, divided by 3 months. So 0.7% = 2.1% per quarter, or around 8.4%/yr. — Inquisitive Investor (@QuisitiveInvest) August 27, 2019\n\nAn expensive workout playlist\n\nPeloton’s workouts include music, just as most gym users have a go-to playlist for gym visits, and the company considers itself “an impactful music-delivery platform.” The filing with the SEC mentions the word “music” 174 times, more than it does the word “exercise” (Peloton obviously prefers the term “fitness,” which is used more than 500 times.”\n\nThe problem with all that music is paying for it. Peloton faces many issues with paying for rights to the songs it plays for users. Peloton disclosed total costs for licensing music over the last three years of $50.6 million, and had three long risk factors related to its ability to properly license music — more risks than it disclosed for cybersecurity and data-management (one apiece). In addition, the company was sued by a consortium of music-publishing companies in March seeking $150 million in damages, injunctive relief and attorneys’ fees; Peloton has responded by alleging the publishing companies and National Music Publishers’ Association Inc. “coordinated to collectively negotiate licenses in violation of the antitrust laws.”\n\nHow can Peloton address its music problems? Well, by being a more conscientious DJ, it says.\n\n“Unlike music streaming services, where having an exhaustive music catalog is vital to be able to compete for customers, we have control over what music we select for our classes,” the company says in its filing. “As a result, we expect to be able to manage music expense such that, over time, these fees as a percentage of subscription revenue will flatten, or even decrease.”\n\nPeloton suggests that it will be able to accomplish that feat by working with artists who are eager to get their music on Peloton workout streams, potentially for a discount.\n\n“We believe we have defined a new standard for musical content development in the fitness and wellness categories, which includes premiering new music, working with artists to co-curate classes based on their own music or influences, and partnering to create new music,” the company said.\n\nEmpire state of mind\n\nPeloton is based in New York City, like two other young companies seeking to go public before the end of 2019, The We Company WE, +0.00% and Datadog Inc. DDOG, +0.00% While on the same IPO trajectory as those New York companies, Peloton actually has closer ties to a much more established New York tech company.\n\nFor more: Five things to know about the WeWork IPO\n\nFour of the five named executive officers at Peloton have spent important chunks of their careers at IAC/Interactive Corp. IAC, -2.57% , including Chief Executive and co-founder John Foley, who co-founded and spent five years as chief executive of IAC subsidiary Pronto.com. The only executive officer who doesn’t have IAC on her résumé is Chief Financial Officer Jill Woodworth, who instead came up through a different New York industry: Wall Street. Woodworth, who is not a certified public accountant, spent more than a decade as a managing partner at underwriting bank J.P. Morgan before being hired at Peloton in 2018.\n\nOperating in Manhattan is not easy on the pursestrings, adding to the growing costs for Peloton. The company began a 21-year lease for a New York production studio to film its streaming content in October 2018, and a month later signed a 16-year lease for a new headquarters that it expects to open in fall of 2020. Peloton disclosed $784.9 million in operating lease obligations, which includes a lease on its current headquarters that runs through 2027.\n\nPower will remain at the top\n\nPeloton will sell shares in its IPO, but it won’t share much power. The company plans to have a dual-share structure in which early investors receive shares with 20 votes to only one vote for holders of common stock. That means CEO Foley and venture investors with large stakes will effectively control the company, and some indexes — including the S&P 500 SPX, +0.03% — that block inclusion of companies that consolidate power with certain shareholders will not accept the company.\n\nFoley owns 6% of the company ahead of the offering, the most of any executive officer — President William Lynch owns 3.1% and CFO Woodworth has 1.5%. The largest holder of Peloton stock ahead of the IPO is Tiger Global, which owns nearly a fifth of the company at 19.8%. Other early investors with large stakes include True Ventures (12%), Fidelity (6.8%), Technology Crossover Ventures (6.7%) and private-equity firm Catterton (5.4%).\n\nMarketWatch staff writer Francine McKenna contributed to this article.", "description": "Peloton Interactive Inc. sells exercise machines and fitness classes, no matter what its filing may want you to believe.", "authors": ["Jeremy C. Owens", "Technology Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HH479_Peloto_ZG_20190411161515.jpg", "published_at": "2019-08-28"}