{"pub": "zdnet", "url": "https://www.zdnet.com/article/breaking-down-the-10-need-to-know-emerging-technologies", "downloaded_at": "2019-10-11 00:16:55.030874+00:00", "title": "Breaking down the 10 need-to-know emerging technologies", "language": "en", "text": "Ten technologies to fix the planet In an uncertain future, these technologies can be a force for progress. Of course, they all have a downside. Read more: https://zd.net/2m245bu\n\nThe world of emerging tech by nature is fast-moving and ever-changing, and consequently, it's difficult to get a handle on the state of the various markets, not to mention leveraging them in driving business innovation. Forrester's emerging tech spotlights have previously identified and characterized the various emerging technologies that are worth your time.\n\nTo help you figure out how to best consume them, Will McKeon-White and I did our best to help simplify this shifting landscape in our latest report, written as a downloadable PowerPoint file: \"Use The Cloud Platforms To Drive Your Tech-Driven Innovations.\"\n\nFrom this research, we came across three key takeaways:\n\nDon't assume your business can't be enhanced by the technologies covered. From healthcare to manufacturing and construction to higher education, adopters of emerging technologies are finding new and innovative ways to enhance what their companies can do. Don't immediately write off using emerging technologies in your organization because you're unsure of how they can fit.\n\nFrom healthcare to manufacturing and construction to higher education, adopters of emerging technologies are finding new and innovative ways to enhance what their companies can do. Don't immediately write off using emerging technologies in your organization because you're unsure of how they can fit. Open source is accelerating, but some technologies are far more proprietary than others. From providing a larger, more engaged development base to enabling deployment flexibility, open-source is ever-growing in popularity, and for good reason. Today, it's far more prevalent in some technologies than others, and vendors are increasingly embracing this trend. Open-source technologies that are currently explicitly proprietary will not only drive innovation but likely adoption, as well.\n\nFrom providing a larger, more engaged development base to enabling deployment flexibility, open-source is ever-growing in popularity, and for good reason. Today, it's far more prevalent in some technologies than others, and vendors are increasingly embracing this trend. Open-source technologies that are currently explicitly proprietary will not only drive innovation but likely adoption, as well. Breadth and strength of services is defining the next wave of cloud competition, and vendors know it. While infrastructure-as-a-service is still a growth market, a status quo has already arisen, one that is unlikely to change rapidly. As such, vendors have realized that next-generation services are their next avenue for net-new competition and are now being fiercely pursued by every vendor covered. This change is rapidly shifting the established market dynamics of the cloud, further contributing to the multi-cloud reality.\n\nAnd while we've touched upon some of the contents of this report in our cloud empowerment webinar and video blog so far, to provide more context on what the PowerPoint contains, we provide a breakdown of the various solutions/services offered by the major cloud providers (Alibaba, Amazon Web Services, Google Cloud Platform, IBM, Microsoft Azure, Oracle, and Salesforce) for the following 10 technologies:\n\nComputer vision refers to a family of tools and technologies used to analyze images and video to understand the objects and features of objects contained in said images.\n\nrefers to a family of tools and technologies used to analyze images and video to understand the objects and features of objects contained in said images. Deep learning is a rapidly evolving machine-learning technique to build, train, and test neural networks that can build probabilistic models to predict outcomes or help identify patterns in data.\n\nis a rapidly evolving machine-learning technique to build, train, and test neural networks that can build probabilistic models to predict outcomes or help identify patterns in data. Natural language generation refers to a family of technologies that work together based on a set of rules, templates, and machine learning to generate language in an emergent, real-time fashion -- from conversations to reports.\n\nrefers to a family of technologies that work together based on a set of rules, templates, and machine learning to generate language in an emergent, real-time fashion -- from conversations to reports. Distributed ledger technology , often referred to as blockchain, is a software architecture supporting collaborative processes around a trusted data set that is shared and distributed, using consensus algorithms to maintain data integrity.\n\n, often referred to as blockchain, is a software architecture supporting collaborative processes around a trusted data set that is shared and distributed, using consensus algorithms to maintain data integrity. Edge computing is a family of technologies that distribute application data and services to where they can best optimize outcomes in networks of connected assets.\n\nis a family of technologies that distribute application data and services to where they can best optimize outcomes in networks of connected assets. Augmented, virtual, and mixed reality technologies are helping merge the digital and physical worlds around us, either through an overlay, the ability to introduce digital elements into your surrounding environment, or the creation of virtual worlds.\n\nare helping merge the digital and physical worlds around us, either through an overlay, the ability to introduce digital elements into your surrounding environment, or the creation of virtual worlds. Additive manufacturing , sometimes known as 3D printing, is an industrial process that allows for the digital design and physical production of components or items with 3D printers.\n\n, sometimes known as 3D printing, is an industrial process that allows for the digital design and physical production of components or items with 3D printers. Digital twins allow the creation of digital models marrying physical and digital data to provide a better understanding of an object's performance or to provide a better end-user experience.\n\nallow the creation of digital models marrying physical and digital data to provide a better understanding of an object's performance or to provide a better end-user experience. Serverless computing is a form of server architecture designed to further abstract development, compute, and run resources from servers — an evolution beyond virtualization -- further removing the need for the infrastructure management and maintenance of servers and instances.\n\nis a form of server architecture designed to further abstract development, compute, and run resources from servers — an evolution beyond virtualization -- further removing the need for the infrastructure management and maintenance of servers and instances. Quantum computing is an emerging computing paradigm and very much still in the R&D stage -- we've yet to see the creation of a true quantum computer, but the technology is one that promises to rapidly increase computing power and efficiency.\n\nThis downloadable PPT also covers:\n\nEach solution's availability in the market today -- is it generally available, is it in beta (or a similar program), or is it still in development and not available today?\n\nin the market today -- is it generally available, is it in beta (or a similar program), or is it still in development and not available today? Relevant open source projects being used to develop these solutions or components of solutions -- is the code itself open source code, is it based on an open source project, or are key components open source-based?\n\nbeing used to develop these solutions or components of solutions -- is the code itself open source code, is it based on an open source project, or are key components open source-based? Third-party solutions being provided through cloud provider marketplaces.\n\nbeing provided through cloud provider marketplaces. Examples and case studies of how the cloud providers have empowered their customers with the technologies.\n\nThis post was written by VP, Principal Analyst James Staten, and originally appeared here.\n\n\n\n", "description": "To keep up with the rapid innovation and disruption happening across all industries and stay ahead of their competition, CIOs and technology leaders should assess and effectively leverage emerging technologies for their net-new values.", "authors": ["Forrester Research"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2019/10/10/3af6f432-69ed-44fa-a7d5-a6f1e630dd64/thumbnail/770x578/82fa0e2f16e05a38314855541f054487/istock-1125581890.jpg", "published_at": "2019-10-10"}