{"pub": "news.com.au", "url": "https://realestate.com.au/news/how-the-fonzie-flat-is-changing-the-face-of-australian-property-and-easing-our-affordability-crisis/?rsf=syn:news:nca:news:spa:fin", "downloaded_at": "2019-10-09 07:03:05.519285+00:00", "title": "How the Fonzie Flat is changing the face of Australian property and easing our affordability crisis", "language": "en", "text": "The Fonz — aka Fonzie, aka Arthur Herbert Fonzarelli — remains the epitome of TV cool, more than 30 years after the hit American sitcom Happy Days wrapped up.\n\nBut that hasn’t stopped the comb-carrying, leather jacket-wearing, motorcycle-riding suburban legend from making another important contribution to popular culture. And also playing a part in helping to solve Australia’s housing crisis in the process, with “the Fonzie Flat”.\n\nMORE: How to execute the perfect house flip\n\nTop 5 deposit hacks for first home buyers\n\nInitially a minor character on Happy Days, The Fonz soon became one of the high rating show’s most popular and important figures.\n\nHenry Winkler’s character is also widely credited with bringing the ‘thumbs up’ sign — indicating everything is OK — into popular culture and was paid homage to on The Simpsons.\n\nAnd now, three decades on, as more Australians than ever before are losing hope of owning their own home, the Fonz has become relevant, and is being revered, yet again.\n\nHis contribution this time? An out of the box idea to help ease housing affordability, or create an extra income stream: The Fonzie Flat — eponymously named for the captain of cool, who rented an attic in the Cunningham’s garage.\n\nWhat is The Fonzie Flat?\n\n“A Fonzie Flat is essentially exactly what Fonzie was doing in Happy Days,” explains Tim Lawless, Head of Research at property data firm CoreLogic.\n\n“It’s independent accommodation, in the garage in that case. Or you can look at a granny flat as the same sort of thing. It’s providing an independent living space within an existing home.\n\n“The reason I think that is becoming more and more important is because we are seeing this trend towards people staying at home with mum and dad longer.”\n\nCoreLogic’s new report Perceptions of Housing Affordability 2019, revealed that 34 per cent of Australians who are still living at home with mum and dad believe they will be at least 30 before they can move up. It’s a dramatic increase from the 20 per cent who felt likewise in the last report in 2017.\n\nThe main reasons young Australians feel this way is because:\n\n1) They can’t afford to move out.\n\n2) Living expenses here are low.\n\n3) They are still studying.\n\n4) They are saving money for a home deposit.\n\n5) They are too comfortable at home and,\n\n6) They have an investment property.\n\nA better quality of life\n\nAs a result, more and more families are looking at a way to keep all parties and all generations to the living arrangement happy. This is where The Fonzie Flat comes in.\n\nIt can also open the way for a new income stream via renting.\n\n“Another factor around that, outside of the whole affordability thing, is investors trying to maximise their yields,” Mr Lawless said.\n\n“So you can have dual living space on the one title. However not every state or council allows you to do that. Some states are more restrictive on whether or not you can get separate rent on one title.\n\n“But more and more we are going to start to see these innovative options, because they allow people to stay at home with mum and dad longer and give everyone some level of independence.\n\n“So the quality of life for both generations is better.”\n\nThese rental yields may also help to get the kids out of the house sooner, and/or into their own home more quickly.\n\nPerceptions of Housing Affordability 2019 also revealed more Australians, particularly the younger generation, hope their families will help them out financially as first home buyers.\n\nMORE: How to avoid mortgage stress\n\nThe best Aussie suburbs to invest in\n\n58 locations where prices are hotting up around Australia\n\n27 per cent of Millennials (22-37 years old) say turning to ‘the bank of mum and dad’ would be of great help in purchasing their first home. That is up from 21 per cent in 2017.\n\nFounder and CEO of property investment advisory firm DG Institute Dominique Grubisa said The Fonzie Flat gives people greater opportunity to live where they want to live.\n\n“It’s definitely growing in popularity,” she said.\n\n“With all the urban sprawl that has occurred, a lot of people don’t want to live further afield. This gives them the option to be where they like to be.\n\n“Some councils are making this easier through Complying Developments. They put out guides so you don’t have to get a DA (development application). They want to encourage that infill.\n\n“A lot of higher density building can give them a headache with all the admin they have to deal with. And they can also ease the stress on housing demand with Complying Developments.”", "description": "Long revered as one of the small screen’s coolest cats, this TV rebel is helping to transform our property market for the better.", "authors": ["James Macsmith"], "top_image": "https://www.realestate.com.au/blog/wp-content/uploads/2019/10/09000316/capi_8d8b9075fca9cba3ff83795b08e4b8df_c911375d9ddf75a85b70477e518a17b5.jpeg", "published_at": "2019-10-09"}