{"pub": "fox", "url": "https://foxnews.com/entertainment/why-women-kill-star-lucy-liu-proud-of-strong-female-acting-roles", "downloaded_at": "2019-10-03 23:31:47.254044+00:00", "published_at": "2019-10-03", "title": "‘Why Women Kill’ star Lucy Liu is proud of her strong female acting roles: ‘I fall into that category more’", "language": "en", "text": "Whether she is playing the role of Ling Woo in the late 90s comedy-drama “Ally McBeal,” asserting herself as assassin O-Ren Ishii in the hard-hitting Quentin Tarantino flick “Kill Bill” or using her state-of-the-art technology, charm and fighting skills to save a kidnapped billionaire-to-be, Lucy Liu’s characters have been strong women and that’s something she doesn’t take for granted.\n\n“I think I've been – I feel like I've been representing it for a very long time,” Liu told reporters at the Television Critics Association summer press tour in Los Angeles. “Not on purpose, but a lot of the characters that I have played have had a very good mind, you know and make decisions based on whatever she wanted. You know, whether they were assassins or whether they were lawyers or detectives, I think I've had the ability to really fall into that category more.”\n\nKRISTEN STEWART TALKS TRAINING FOR 'CHARLIE'S ANGELS' REBOOT: 'I REALLY HATED IT'\n\nAnd for good reason.\n\nThe 50-year-old actress, who stars in the CBS All Access comedy-drama series “Why Women Kill,” said she enjoyed playing this latest part due to the fact that she simply hadn’t been able to commit any crimes in her seven seasons as Dr. Joan Watson on the long-running Sherlock Holmes-Meets-Manhattan series “Elementary.”\n\n“I'm so excited to commit a crime, I can't tell you,\" she said. \"I think it's about time. I'm surprised Joan Watson didn't go crazy and commit a crime before the end of Season 7.”\n\nIn playing her character, Simone Grove -- a socialite in the 1980s who is entrenched in dealing with infidelity in her marriage -- Liu said Grove’s arc in Season 1 of the streaming-only series is an evolution of who she is.\n\nLUCY LIU TO BE SECOND ASIAN AMERICAN WOMAN TO RECEIVE WALK OF FAME STAR\n\n“She has a bit of an affectation and she is also – I mean, I think her whole life is a bit of an affectation and I think it's the lavish décor and the way that she presents herself to society is sort out a facade for where she came from originally. And we sort of find that out as the episodes go on,” said Liu.\n\nLiu also addressed the forthcoming “Charlie’s Angels” reboot film. (Liu starred in the original movie, alongside Cameron Diaz and Drew Barrymore, nearly 20 years ago.)\n\nLiu said she hasn’t had any interaction with stars Kristen Stewart, Naomi Scott and Ella Balinska as they become the new trio.\n\n“I haven't, actually. I mean, I was on my show and then I hadn't even found out about it and someone asked me about it and I was like, I think that's great,” Liu explained. “I don't know what they're expecting, like a catfight. It's so silly.\n\n'CHARLIE'S ANGELS' TRAILER DEBUTS SHOWING THE NEW LADIES IN SOME EXPLOSIVE ACTION\n\n“Back then, it was sort of like such a strange thing especially given the time right now. But I think it's wonderful. I think there's a reason why there are many iterations of that show that we made into a movie, that then became a show that then became a movie. You know, there's a reason why people are attracted to it.”\n\nWhen asked about the industry’s shift toward inclusion and diverse content, the Emmy-nominated actress said it is long overdue and hopes the trend continues to push the entertainment business to offer opportunities to minorities including, of course, Asians and Asian-Americans.\n\n“I think that there is more opportunity for diversity and I think that it's becoming more colorblind,\" Liu said. \"So I don't know that it's specifically because it's Asian. I mean some of the projects obviously are but I think that there's a different level of expectation from the audience. And I think because, as I said, there's so much content -- there is the ability for networks or streaming services to really understand that there is a need and a desire for that and that there's an opportunity for them especially if they have such a viewership and audience.”\n\n‘CHARLIE’S ANGELS’ STAR CHERYL LADD ON HER RELATIONSHIP WITH GOD: 'IT HAS GOTTEN STRONGER AND DEEPER'\n\n“It allows for that, you know, whether it's 'Always Be My Maybe' or whatever it is – it's sort of great that they are giving [opportunities],” she added. “And then they also started to understand the numbers and the idea of Nielsen is not as current as it used to be, so I think they're looking at other things and they have nothing to lose by putting that on the air.”\n\nThe “Kung Fu Panda” franchise voice actress said these opportunities can be life-changing and added that the shift can certainly be seen and felt but noted that there is still much progress to be made.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\n“It only helps them and it makes them create a much more diverse panel for themselves,” she said. “And I think that is now being seen as a much more important part of the entertainment business, whether it's directing or people behind the scenes or people in the crew. It's not just about having one solid thing.”\n\n“So a lot of people who were not given the opportunities before are now being given those opportunities or are asked to come on board because they wanted that or they need that.”\n\n“Why Women Kill” is currently streaming on CBS All Access.", "description": "The A-list star's characters have been strong women and that’s something she doesn’t take for granted.", "authors": ["Julius Young", "Julius Is An La Entertainment Reporter For Fox News."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Lucy-Liu-WWK.jpg"}