{"pub": "townhall", "url": "https://townhall.com/tipsheet/mattvespa/2019/09/27/its-trump-dossier-20-federalist-cofounder-shreds-credibility-of-ukraine-whistleblower-n2553818", "downloaded_at": "2019-09-28 00:59:28.246602+00:00", "title": "Federalist Co-Founder Notes The Real Reason Behind The Media's Trump-Ukraine Obsession", "language": "en", "text": "If there is someone who just brutally rips the liberal media and their bad behavior, it has to be The Federalist co-founder Sean Davis. In fact, most of the staff there does an excellent job torching left-wing narratives and exposing the Democrat-media complex for their idiocy. Since the 2016 election, the media has just been engulfed with Trump Derangement Syndrome. They hate Trump. They hate Republicans. And this has blinded them to being hit with buckshot on a near-daily basis. For two years, they peddled the Trump-Russia collusion myth that was a manufactured lie based on the infamous Steele Dossier, aka Trump dossier, that was compiled by ex-MI6 spook Christopher Steele. It was never fully verified, most of the allegations in it were trash, and even members of British intelligence were skeptical. The FBI was not, as evidenced by their lack of due diligence in verifying this biased piece of political propaganda. A Google search could have pointed out the glaring errors within the dossier. This was a political opposition research project funded by the Clinton campaign and the Democrats. It was based on second-hand sources, some of which were still active in the Kremlin. If anything, this proves Clinton-Russia collusion and interference in the 2016 election. The report by Special Counsel Robert Mueller debunked this entire project. So, the Democrats had to suffer humiliation, as did their media allies—but impeachment was still the end goal. It was why they retook the House in 2018.\n\nSo, alas, this Trump-Ukraine call, where the president supposedly coerced the Ukrainian leadership into opening an investigation into Hunter Biden in exchange for military aid. Oh, the quid pro quo allegations were peddled, the call was made into the new Watergate, and the impeachment train was off and running. A whistleblower complaint was filed, but no one had read it before House Democrats pulled the trigger on this impeachment circus. Alas, the transcript and the complaint were declassified and released. And it proved almost every allegation false. So, shocker, the liberal media was wrong. There was nothing illegal. Nothing—but Davis aptly noted how this whole affair is Steele Dossier 2.0, with the added bonus that this had to be executed to make up for the Left being straight-up wrong about collusion. Davis goes into detail about how this is the same show, produced by the same idiots. The reporting is trash, the sources are anonymous, it’s all second or third-hand which explains the deluge of errors. The New York Times revealed through their sources—so take this with a grain of salt—that the whistleblower is a CIA agent and an expert on Ukraine or something. Davis poked fun of that as well; this guy missed the Ukrainian invasion (via NY Post):\n\nIt's almost like the anti-Trump leaker who peddled a document full of anonymous hearsay has no clue what he's talking about. Are we sure he's not buddies with Christopher Steele? https://t.co/PYUWrfsPQQ — Sean Davis (@seanmdav) September 26, 2019\n\nAt a minimum, the complaint contains numerous factual errors, which is unsurprising since it was not first-hand information. https://t.co/FZ4zPMF2bU — Brit Hume (@brithume) September 26, 2019\n\nThe entire Ukraine information operation was orchestrated not just to provide a counter-narrative to the bombshells in the IG report and declassified documents, but to directly threaten and attack those who are digging into the collusion corruption. https://t.co/VAd4xBJyhK — Sean Davis (@seanmdav) September 26, 2019\n\nThe anti-Trump leaker is said to be an expert on Ukraine at the intelligence agency that had no clue Vladimir Putin was going to invade Ukraine. https://t.co/NIEhrowEJO — Sean Davis (@seanmdav) September 26, 2019\n\nLiberals presented Steele as an operative with impeccable credentials and a deep network of Russian sources. His reports, we were told, set a gold standard for intelligence, so much so that the FBI regularly relied on his counsel. His claims found immediate purchase in the highest circles of American journalism — until they were utterly debunked along with the whole “collusion” theory. Sound familiar? The New York Times, whose reporters were deeply involved in propagating the Russian-collusion hoax, reported on Thursday that the new anti-Trump whistleblower is similarly a career CIA operative “steeped in the details of American foreign policy” and “demonstrating a sophisticated understanding of Ukrainian politics.” The insinuation is that, given this résumé, he must be beyond reproach or partisan animus. […] In his dossier, Steele levied shocking accusations of corruption and impropriety by Trump and his team, going so far as to claim that Trump was bought and paid for by Russian strongman Vladimir Putin, who allegedly had compromising information on Trump that all but forced Trump to do the Kremlin’s bidding. Steele hadn’t gathered or witnessed any of this evidence first-hand. Rather, he relied on anonymous sources, many of them third-hand. “Source B asserted that the Trump operation was both supported and directed by Russian President Vladimir Putin,” Steele wrote. “Source A confided that the Kremlin had been feeding Trump and his team valuable intelligence on his opponents,” including Hillary Clinton, Steele claimed. Referring to the infamous and nonexistent pee tape, Steele said, “The Moscow Ritz Carlton episode involving Trump … was confirmed by Source E. Source F, a female staffer at the hotel when Trump had stayed there … also confirmed the story.” Again, sound familiar? Compare that to the text of the author of the anti-Trump complaint about Ukraine. “I was not a direct witness to most of the events described,” the whistleblower wrote. Just like Steele’s dossier, the complaint is riddled with third-hand rumors, gossip and hearsay gathered from similarly anonymous officials.\n\nDavis added that the FBI weaponized Steele’s document, securing a FISA spy warrant against Carter Page, a former Trump official, without verifying the document because ‘get Trump’ was the battle hymn. With this complaint, he got Democrats and the House Intelligence Committee to run this circus. And it’s once again blowing up in their faces.", "description": ".09/27/2019 20:57:19PM EST.", "authors": ["Matt Vespa", "Cortney O'Brien", "Julio Rosas"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/269/41724fc8-1a25-4051-aed9-4d70fd822625.png", "published_at": "2019-09-27"}