{"pub": "thehill", "url": "https://thehill.com/policy/national-security/466250-diplomat-sondland-to-say-trump-directed-officials-to-work-with", "downloaded_at": "2019-10-17 14:29:22.972982+00:00", "title": "US Ambassador Sondland to say Trump directed officials to work with Giuliani on Ukraine", "language": "en", "text": "U.S. diplomat Gordon Sondland is expected to tell House lawmakers Thursday that President Trump Donald John TrumpGOP congressman slams Trump over report that U.S. bombed former anti-ISIS coalition headquarters US to restore 'targeted assistance' to Central American countries after migration deal Trump says lawmakers should censure Schiff MORE directed administration officials to work with his attorney Rudy Giuliani Rudy GiulianiTrump threat lacks teeth to block impeachment witnesses Sondland could provide more clues on Ukraine controversy Top US diplomat William Taylor scheduled to testify in impeachment probe MORE on Ukraine matters, according to his prepared remarks for testimony as part of the Democrats' impeachment inquiry.\n\nThe U.S. ambassador to the European Union will also distance himself from Trump and Giuliani's efforts to get Ukrainian President Volodymyr Zelensky to investigate one of the president's top 2020 political rivals, former Vice President Joe Biden Joe BidenTrump says lawmakers should censure Schiff Schiff says committees will eventually make impeachment inquiry transcripts public Trump threat lacks teeth to block impeachment witnesses MORE.\n\nADVERTISEMENT\n\n\"We were also disappointed by the President’s direction that we involve Mr. Giuliani. Our view was that the men and women of the State Department, not the President’s personal lawyer, should take responsibility for all aspects of U.S. foreign policy towards Ukraine,\" according to a copy of Sondland's opening statement, which was obtained by The Hill.\n\n\"However, based on the President’s direction, we were faced with a choice: We could abandon the goal of a White House meeting for President Zelensky, which we all believed was crucial to strengthening U.S.-Ukrainian ties and furthering long-held U.S. foreign policy goals in the region; or we could do as President Trump directed and talk to Mr. Giuliani to address the President’s concerns,\" his remarks continue.\n\nSondland maintained that in a phone conversation with the president, Trump stressed there was no quid pro quo for the Ukraine financial aid. Trump has previously said he withheld it in order to pressure more European countries to contribute.\n\n\"Taking the issue seriously, and given the many versions of speculation that had been circulating about the security aid, I called President Trump directly. I asked the President: 'What do you want from Ukraine?' The President responded, 'Nothing. There is no quid pro quo.' The President repeated: 'no quid pro quo' multiple times. This was a very short call. And I recall the President was in a bad mood,\" Sondland added in his statement.\n\nHe also condemned such actions as inviting Ukraine to investigate Biden, stating that he did not take part in such efforts.\n\n“Let me state clearly: Inviting a foreign government to undertake investigations for the purpose of influencing an upcoming U.S. election would be wrong. Withholding foreign aid in order to pressure a foreign government to take such steps would be wrong,” he said.\n\n“I did not and would not ever participate in such undertakings. In my opinion, security aid to Ukraine was in our vital national interest and should not have been delayed for any reason,\" Sondland added.\n\nHis testimony comes as Democrats are rapidly interviewing witnesses about Trump's push for a Biden investigation and questions as to whether he withheld financial aid as leverage for such an investigation.\n\nUpdated at 10:08 a.m.", "description": "U.S.", "authors": [], "top_image": "https://thehill.com/sites/default/files/sondlandgordon_101719gn8_lead.jpg", "published_at": "2019-10-17"}