{"pub": "townhall", "url": "https://townhall.com/tipsheet/leahbarkoukis/2019/09/25/gop-rep-moves-to-strip-nadler-of-judiciary-chairmanship-n2553652", "downloaded_at": "2019-09-25 13:37:44.056416+00:00", "title": "GOP Rep Moves to Strip Nadler of Judiciary Chairmanship", "language": "en", "text": "Republican Rep. Lance Gooden (Texas) introduced a resolution Tuesday to remove House Judiciary Committee Chairman Jerrold Nadler (N.Y.) from his post on the panel for pursuing impeachment proceedings.\n\nThe resolution “would formally recognize the illegality of impeachment proceedings,” according to Gooden.\n\n“In recent days Democrats have sanctimoniously declared their allegiance to the rule of law. I encourage them to follow those rules and hold Chairman Nadler accountable for breaking them,” he said in a statement.\n\n“By law, he may not launch impeachment proceedings until the full House votes for him to do so. This attempted coup against a duly-elected, sitting president is unprecedented and must be stopped. I urge the Majority to move immediately to have him stripped of his chairmanship and that any accomplices on the Judiciary Committee not be considered as a replacement.”\n\nCurious where Texas GOP minds are on impeachment? Freshman US Rep. Lance Gooden is introducing a resolution to remove Judiciary Chairman Jerry Nadler from that post. pic.twitter.com/kzE3SVusGg — Abby Livingston (@TexasTribAbby) September 24, 2019\n\nHouse Democrats like Jerry Nadler have jumped the shark over and over again. I'm fed up with Democrat obstructionism and game playing.\n\n\n\nThat's why today I filed a House Resolution to remove Rep. Nadler as Chairman of the Judiciary Committee.https://t.co/d937eukvyH — Lance Gooden (@Lancegooden) September 24, 2019\n\nGooden's move is largely symbolic, of course, since Democrats hold the majority in the House.", "description": ".09/25/2019 9:36:06AM EST.", "authors": ["Leah Barkoukis", "Guy Benson", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/141/5f9d1279-9dd2-4d75-83a4-0ab35f08e664.png", "published_at": "2019-09-25"}