{"pub": "guardian", "url": "https://theguardian.com/environment/2019/sep/03/they-eat-everything-in-their-path-spains-shellfish-farmers-turn-on-starfish", "downloaded_at": "2019-09-03 23:45:13.028388+00:00", "title": "'They eat everything in their path': Spain's shellfish farmers turn on starfish | Stephen Burgen", "language": "en", "published_at": "2019-09-03", "text": "Galicia has agreed to a cull of the creatures, which are turning up in unusually large numbers and feasting on the region’s key export\n\nGalicia, in north-west Spain, has declared war on an apparently inoffensive creature that is putting livelihoods under threat.\n\nThe region’s shellfish farmers say that an unusually large population of starfish has begun devouring their crop of mussels, cockles and clams. They recently obtained permission from the regional government to cull the starfish, and divers have been hauling up hundreds of kilos a day.\n\n“They devour everything,” says Marco Antonio Ruibal, of the Raxó fishermen’s association in Pontevedra. “They are everywhere, in all the rías. They like shellfish, the same as the rest of us. Starfish principally feed on clams. They live on the seabed and when we dig up the clams, that’s when they eat them.”\n\nThe rías are deep, sunken river valleys that have formed inlets around the city of Vigo and Pontevedra and are the heart of Europe’s shellfish industry. Spain produces 200,000 tonnes of mussels a year, nearly half the European market, with 90% produced in Galicia. The region also produces around 2,000 tonnes of clams.\n\nIt has been known for its mussels and other shellfish since Roman times but it was in the 1940s, when Galicians developed the technique of growing mussels and oysters from ropes suspended from rafts, or bateas, that the industry really took off. Spawn is collected in the wild and then farmed on the bateas.\n\nThe ropes of shellfish are easy prey for the starfish, which climb up and prise open the shells to consume the creature inside. Even an opening of a tenth of a millimetre is enough for the starfish to get at its prey.\n\nThe appearance of starfish in the rías is not a new phenomenon but they have never been seen in such numbers.\n\n“What we don’t know is if this is a one-off or something more long-term,” says Carlos Gabín, director of the marine research centre based in Santiago de Compostela.\n\nFacebook Twitter Pinterest Starfish washed-up on Brighton beach in East Sussex. Photograph: Gareth Fuller/PA\n\nHe said the appearance of the creatures was caused by unknown environmental factors and the abundance of shellfish for starfish to feed on.\n\n“The wealth of the sea has its epochs,” says Ruibal. “There are areas with a lot of molluscs and the starfish are looking for food. If we don’t do anything they will eat everything in their path.”\n\nHe suggests that there may be more this year because there haven’t been many storms or because there are more shellfish for them to prey on. “I think it’s a mix of everything that has worked in their favour.”\n\nThe only way of controlling their numbers is by sending down divers to collect them by hand. In February, divers extracted several tonnes of starfish and in July, says Ruibal, they were bringing up around 500kg in the space of around three hours.\n\n'Like mopping up a flood': throwing in the towel over beach plastic pollution | Maeve Shearlaw Read more\n\nThe starfish dry out within a few days onshore and have little or no economic value.\n\n“Some fishermen talk of a plague but for me a plague is a different concept,” says Gabín. “A plague is when the population is so abnormally large it is capable of destroying whatever it encounters in its path. We need more quantifiable information before we can talk of a plague.”\n\nThe two species of starfish found in the rías are Marthasterias glacialis and Asterias rubens, which, like other starfish, have a decentralised nervous system and can reproduce both sexually and asexually and may live for as long as 10 years. If they sacrifice an arm in a battle with a predator, it will grow back again.\n\n“If you chop off an arm, that can grow into a new starfish,” says Gabín. “For that reason they should never be thrown back into the sea.”\n\nThey have a number of predators, among them other starfish, sharks, fish, gulls and sea otters, but Gabín says that for as yet unknown reasons the predators are either not very numerous or very active at present.\n\nThe shellfish industry is the lifeblood of Galicia, but it is very much a small-scale family business. A recent EU report found that ownership of the region’s 3,500 bateas was distributed among around 2,000 families.", "description": "Galicia has agreed to a cull of the creatures, which are turning up in unusually large numbers and feasting on the region’s key export", "authors": ["Stephen Burgen"], "top_image": "https://i.guim.co.uk/img/media/03c7d46287b0e4ef03eaa1440cb98e19598e736b/0_97_4288_2573/master/4288.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b8d3d48af8e0401b86e587f74bd3a473"}