{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/22/dont-miss-the-qa-sessions-at-disrupt-berlin-2019", "downloaded_at": "2019-10-22 13:20:48.274140+00:00", "title": "Don’t miss the Q&A Sessions at Disrupt Berlin 2019 – TechCrunch", "language": "en", "text": "The early-stage startup community knows that the Disrupt Main Stage is the place to hear and learn from iconic founders, technologists and investment leaders. And the speakers you’ll hear at Disrupt Berlin 2019 on 11-12 December will follow that grand tradition.\n\nHold up a sec. Don’t have a ticket yet? Buy your early bird pass today and save up to €500.\n\nOkay, back to the point at hand. “Always leave them wanting more” — a phrase often attributed to P.T. Barnum — also applies to the Disrupt Main Stage. “More” is what Disrupt attendees frequently tell us they want after hearing our featured guests speak. More time to engage, to ask questions, to take a deeper dive into critical issues and emerging trends.\n\nAnd that’s where the Q&A sessions come into play. They’re a series of smaller, moderated panel discussions — and a place where audience members can interact and ask their top-of-mind questions. Panels consist of a TechCrunch editor to moderate and subject experts, many of whom are the very people who held forth on Main Stage.\n\nEach Q&A Session takes place on the Extra Crunch Stage and, while the topics vary, they focus primarily on these tracks — Artificial Intelligence/Machine Learning, Biotech/Healthtech, Blockchain, Fintech, Gaming, Investor Topics, Media, Mobility, Privacy/Security, Retail/E-commerce, Robotics/IoT/Hardware, SaaS, Space and Social Impact & Education.\n\nIf you’re not familiar with our new Extra Crunch Stage, that’s the place to find fireside chats, panel discussions and to learn all kinds of actionable, how-to tips from successful founders and investors. You know, things you can actually use in your business once the show ends.\n\nHere’s an important aspect you need to understand about our Q&A sessions. The only way to experience a session is to be there in the flesh. We do not record or livestream the content for these sessions. Keep in mind that seating is limited in this smaller, more intimate setting, and it’s strictly first come, first served. Bottom line: get there early if you want a seat.\n\nWhether you want the 40,000-foot view of the Main Stage or the up-close-and-personal take of the Q&A sessions, you find it — and everything in between — at Disrupt Berlin 2019 on 11-12 December. Get your early bird passes now and save up to €500. We can’t wait to see you in Berlin!\n\nIs your company interested in sponsoring or exhibiting at Disrupt Berlin 2019? Contact our sponsorship sales team by filling out this form.", "description": "The early-stage startup community knows that the Disrupt Main Stage is the place to hear and learn from iconic founders, technologists and investment leaders. And the speakers you’ll hear at Disrupt Berlin 2019 on 11-12 December will follow that grand tradition. Hold up a sec. Don’t have a ticket yet? Buy your early bird pass today and […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/48835840827_d66200a8f4_k.jpg?w=600", "published_at": "2019-10-22"}