{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/andrew-yang-tech-entrepreneur-fears-automation-self-driving-cars", "downloaded_at": "2019-10-18 10:35:13.569030+00:00", "title": "Andrew Yang: Tech Entrepreneur Fears Automation & Self-Driving Cars", "language": "en", "text": "Entrepreneur Andrew Yang speaks at the New Hampshire Democratic Party state convention in Manchester, September 7, 2019. (Gretchen Ertl/Reuters)\n\nThe candidate is afraid of automation, something we actually need more of.\n\nAndrew Yang, the tech entrepreneur and gadfly, has definitely cleared the bar for a successful cause candidate.\n\nNot only has he exceeded expectations for his polling and fundraising, not only has he developed a cult following, not only has he got people talking about his signature idea, the universal basic income, he actually has other candidates expressing openness to it.\n\nAdvertisement\n\nIt’s too bad that Yang’s idea is a foolish response to a non-problem. Worse, Yang is trying to persuade people to fear and oppose something that we need more of and that is a key to economic progress and higher wages — namely, automation.\n\nIt is through technological innovation that workers become more productive — i.e., can create more with less — and society becomes richer.\n\nTo hear Yang tell it, robots are on the verge of ripping an irreparable hole in the American job market. He’s particularly alarmed by the potential advent of autonomous vehicles. According to Yang, “All you need is self-driving cars to destabilize society.” He predicts that in a few years, “we’re going to have a million truck drivers out of work,” and “all hell breaks loose.”\n\nAdvertisement\n\nNot to put too fine a point on it, Yang’s fear of automation in general and self-driving cars in particular is completely insane.\n\nAdvertisement\n\nIt can’t be that the only thing holding our society together is the fact that cars and trucks must be operated by people. If innovations in transportation were really the enemy, we would have been done in long ago by the advent of canals, then railroads, then automobiles and highways.\n\nAt a practical level, Yang’s assumption that autonomous vehicles are going to wipe out all trucking jobs, and relatively soon, is unsupported. If progress has been made toward self-driving cars, we’ve learned that the jump to full autonomy is a vast one that will take many years to achieve. There will be time for the sector and people employed in it to adjust.\n\nThis has been the experience of other job categories affected by innovation. Mark Mills of the Manhattan Institute points out how computerized spreadsheets and accounting, word processors, and graphics programs have crimped employment for accountants, typists, and draftsmen. Yet the people once employed in these jobs haven’t been rendered socially and economically inert, threatening the social order.\n\nAdvertisement\n\nThis is because, even as technology makes some jobs obsolete, it creates the space for new ones. Broadly speaking, this is the economic story of the modern world. If it’s true that labor-saving innovations destroy jobs, unemployment should have steadily increased since the Industrial Revolution.\n\nAdvertisement\n\nInstead, unemployment in the U.S. has hovered very roughly around 5 percent for a century (with exceptions, obviously). In the golden post–World War II age, productivity increased robustly, and so did employment and wages.\n\nIf we were actually to experience much higher levels of productivity now, the increased wealth wouldn’t be squirreled away. The wealthier people are, the more they consume, and not just on services, but on concrete goods such as houses and cars.\n\nTo believe otherwise is to think that we have reached our maximum level of consumption and development, in which case we might as well give up now, and throwing $12,000 a year at people — Yang’s idea — isn’t going to save us.\n\nThis is what is most perverse about Yangism, though: It is based on an apocalyptic fear of an imminent revolution in productivity, when we are experiencing extraordinarily low levels of productivity growth. Rob Atkinson of the Information Technology & Innovation Foundation notes that U.S. labor productivity has been increasing at a dismal rate of 1.2 percent per year since 2008, half the rate of the preceding 13 years.\n\nAdvertisement\n\nThis is the problem that everyone should be focused on. But such is the state of the political debate in 2019 that even the winsome and refreshing candidate, Andrew Yang, is a net subtraction to our collective self-understanding.\n\n© 2019 by King Features Syndicate", "description": "Democratic presidential candidate Andrew Yang’s fear of automation in general and self-driving cars in particular is completely insane. It can’t be that the only thing holding our society together is the fact that cars and trucks must be operated by people.", "authors": ["Rich Lowry", "Mairead Mcardle", "Jim Geraghty", "Kevin D. Williamson", "John Mccormack", "Victor Davis Hanson", "Katherine Timpf", "Kyle Smith", "Alexandra Desanctis", "Read More"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/andrew-yang-nh-democratic-convention.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-18"}