{"pub": "townhall", "url": "https://finance.townhall.com/columnists/pauldykewicz/2019/09/03/gold-offers-a-safehaven-investment-in-times-of-crisis-n2552531", "downloaded_at": "2019-09-03 23:38:52.012708+00:00", "title": "Gold Offers a Safe-Haven Investment in Times of Crisis", "language": "en", "published_at": "2019-09-03", "text": "Gold offers a safe-haven investment in times of crisis that has been reflected lately by investors bidding up the price of the precious yellow metal.\n\nThe rise in gold prices seems to have been caused by a combination of negative interest rates in Europe, soaring government debt, trade wars, economic weakening and global conflicts rather than a specific economic disaster such as the Great Recession of December 2007 to June 2009. Nonetheless, the traditional use of gold to provide a safe-haven investment in times of crisis is evident when comparing the price of precious metal funds to equities.\n\nA chart for the past 12 months shows the prices of SPDR Gold Shares (NYSE:GLD) and the iShares Silver Trust (NYSE:SLV) soaring well above the gains of the Dow Jones Industrial Average, the S&P 500 and the NASDAQ. Gold and silver endured a bear market in precious metals between 2011 and 2018 before jumping in value over the past year. During the last 12 months, GLD jumped 25.54 percent and SLV soared 23.36 percent, while the Dow Jones Industrial Average eked out a 1.01 percent gain, the S&P 500 topped the break-even mark by just 0.35 percent and the technology-heavy NASDAQ fell 2.04 percent.\n\nGold Offers a Safe-Haven Investment from Unforeseen Disasters\n\nPhysical gold traditionally serves as a hedge against unforeseen disasters, since it usually lacks a positive correlation to the stock market’s direction. When equities rise, they typically draw investors away from precious metals.\n\nInvestors who expect a bearish market sometimes take positions in gold futures or gold itself as safe-haven investments. When the economy slows and the market drops, investors tend to shift their funds from stocks into gold.\n\nThe latter situation is likely to happen when real interest rates, defined as the rate investors receive after inflation, are low, as they are now. A reduction in interest rates began on July 31 when the Federal Reserve Bank announced a rate cut for the first time since 2008 during the Great Recession.\n\nFurther rate cuts are expected this year, marking a sharp reversal from four rate hikes in 2018, including the Fed’s latest one last December. That boost became the ninth rate increase since December 2015 amid an improving economy. Plus, precious metals prices jumped in the past month after the latest rate cut and hints from Fed Chairman Jerome Powell indicated that another cut may follow as soon as September in response to a slowing global economy.\n\nSilver lagged behind gold until the past month, when SLV jumped 11.17 percent, compared to 6.57 percent for GLD. In contrast, the NASDAQ lost 4.21 percent, the S&P 500 slid 3.20 percent and the Dow Jones Industrial Average dipped 3.06 percent during the same period.\n\n“When the smart money wants safety, it embraces the warm shine of gold,” said Jim Woods, editor of Bullseye Stock Trader, Successful Investing and Intelligence Report. “Being that yields are so low, the relative appeal of the yield-less precious metal makes it all that more attractive. And, if you add gold mining stocks to the mix, you get share price appreciation and a little yield.”\n\nHow to Buy Gold as a Safe-Haven Investment\n\n“The whole sizzle of hard assets investing is that you’re diversifying away from the whole world of paper securities into an age-old reservoir of value,” said New York-based money manager Hilary Kramer. “Companies can fail. Brokerage systems can get hacked. And while it’s rare, fiat currencies can collapse. That’s why I ignore SPDR Gold Trust (NYSE:GLD) and go straight to funds like Sprott Physical Gold Trust (NYSE:PHYS).”\n\nEven though GLD is backed with $43 billion in gold bars, investors never see the yellow metal because the investment is purchased with dollars and people are paid in dollars when they cash out, said Kramer, whose 2-Day Trader service has achieved nine straight profitable trades averaging a gain of 13 percent per position since its launch.\n\n“Sprott funds always give you the option of converting your shares into actual gold and silver bars, which are then delivered wherever you want to store them,” said Kramer, who also heads the Value Authority, GameChangers, Turbo Trader, High Octane Trader and Inner Circle advisory services.\n\nGold Offers Safe-Haven Investments of Various Forms\n\nBoth the GLD and PHYS funds track the gold market, so investors can make or lose money with either depending on where commodity prices go, Kramer said. But she questioned the point of owning gold unless an investor can cash out into something besides paper or an electronic number stored on a bank computer.\n\n“Computers can fail,” Kramer said. “Having the option to call the truck to your door and drop off a few pounds of shiny metal offers you true security, which, again, is what gold is all about. And, of course in the meantime, you don’t pay storage and transportation fees, so your money compounds a little faster. If you’re looking for a place to park up to 5 percent of your portfolio and sleep better at night, this is the place.”\n\nColumnist Paul Dykewicz interviews money manager Hilary Kramer.\n\nThe rally in precious metals, as well as cryptocurrencies, has been driven partly by very easy global monetary policies that stoke speculation among previous metal traders that inflation will increase at some point, Kramer said. Investors also will be watching Global Producer Manufacturing Indexes (PMIs) that are coming out this week from the Institute of Supply Chain Management, with the report on the United States scheduled for Sept. 3. Important economic data also will appear in the August 2019 U.S. Employment Situation report by the U.S. Department of Labor’s Bureau of Labor Statistics on Friday, Sept. 6.\n\nEconomic Strength Hurts Gold as a Safe-Haven Investment\n\nThe enhanced strength of the stock market and some “decent retail company earnings” suggest that the U.S. economy is not weakening as much as some observers thought, Kramer said. If economic data confirm this situation and Fed leaders become confident enough about the economy’s growth to skip a rate cut in December, selling may occur in gold, she added.\n\nA more positive view of buying gold exchange-traded funds (ETFs) came from Bryan Perry, who leads the Cash Machine, Premium Income, Hi-Tech Trader, Instant Income Trader and Quick Income Trader advisory services. Gold is the world’s “greatest hedge against financial calamity,” Perry said.\n\nPerry called gold “the ultimate safe haven” and said it can be acquired easily in an exchange-traded fund (ETF) like the SPDR Gold Shares ETF (GLD), leaving little to discuss about what to buy, but rather how much to buy and at what price, he added.\n\nBryan Perry\n\nFast-Rising Gold Fund Offers a Safe-Haven Investment\n\n“Gold has exploded out of a multi-year trading range on a massive spike in volume, clearly related to the devaluation of global currencies, burgeoning deficit spending and political calamity,” Perry said. “It’s a toxic combination that warrants some of what I call ‘crisis protection’ and owning GLD is the perfect way to do so. Even for purely technical reasons, GLD is a buy at certain levels.”\n\nGLD offers investors a relatively cost efficient and secure way to access the gold market, Perry said. Originally listed on the New York Stock Exchange in November 2004 and traded on NYSE Arca since December 13, 2007, SPDR Gold Shares is the largest physically backed gold ETF in the world.\n\nChina, Japan, Europe, the United Kingdom and other nations either allow currency devaluation or manipulate their respective currency downward to boost exports, Perry said. Further, central banks can be the biggest buyers of gold to hedge their aggressive quantitative easing policies. To that point, the newfound upside in gold prices has only just begun, he added.\n\nTwo Key Reasons Why Gold Offers a Safe-Haven Now\n\nTwo key reasons still draw investors to own gold in their portfolios, even if they “sat out the latest run,” said Bob Carlson, who leads the Retirement Watch advisory service.\n\nThe short- and intermediate-term reason is that gold is a “flight to safety asset,” and thereby justifies taking positions in gold as a hedge, Carlson said.\n\n“There’s Brexit, the debt crisis in Italy — which will be back in the headlines soon, the trade conflicts and various political conflicts around the globe,” Carlson said. “The potential for recessions in Europe and the U.S. over the next year or two also could trigger concerns about the investment markets and economy that increase interest in gold.”\n\nThe long-term reason for buying gold assets is that the U.S. dollar could lose favor among international investors, Carlson said. The dollar has been rising largely because the United States has had the world’s strongest economy and the Fed has provided support for the economy and markets, he added.\n\nEconomic Weakness Enhances Gold’s Appeal as a Safe Haven\n\nHowever, the Fed currently doesn’t have too many options left to reverse the next economic downturn, Carlson said. As the U.S. government continues to run up debt, investors could become less confident that the dollar will retain its value, he continued.\n\nHow people invest in gold depends on their goals, Carlson said. People who are concerned about a currency or economic collapse probably want to own physical gold in a portable form to spend or exchange it. Someone who owns gold strictly as an investment should consider ETFs or other publicly traded vehicles, he added.\n\n“I like iShares Gold Trust (NYSE:IAU) because it usually has the lowest fees,” Carlson said. “Also, hedge funds and other short-term traders tend to prefer other ETFs. Rapid moves by the traders can cause price disruptions in an ETF, causing it to sell at a significant discount or premium to net asset value.”\n\nTime Remains to Buy Gold as a Safe-Haven Investment\n\nEven though gold and silver prices already have begun climbing, there still is time for those who have been waiting to buy precious metals in one form or another, said Rich Checkan, president and chief operating officer of Asset Strategies International, of Rockville, Maryland.\n\nGold and silver have broken out and a “bull market” has been established in each, said Checkan, who suggested that investors start to buy precious metals last year and earlier this year.\n\n“For those who needed to see the trend in place before allocating funds, you have not missed the bull market… it is just underway,” Checkan said.\n\nSilver Joins Gold as Safe-Haven Investments Amid Market Dip\n\nGold is up 45 percent from its December 2015 lows of $1,050 per ounce, Checkan said. Silver has jumped 34 percent since the December 2015 lows of $13.83 per ounce, he added.\n\nThe last bull market in gold and silver spanned from 2001 to 2011, Checkan said. Gold and silver were up 650% and 1,000%, respectively, he added.\n\nBased on that history, the new bull market is “just getting started,” Checkan said. Bull markets in precious metals tend to be long in duration and significant in appreciation, Checkan added.\n\nThe ongoing climb of gold is unmistakable based on its big outperformance of equities during the past year. For investors seeking a hedge against economic weakness and market drops, gold is proving worthy of having a place in their portfolios.\n\nPaul Dykewicz, www.pauldykewicz.com, is an accomplished, award-winning journalist who has written for Dow Jones, the Wall Street Journal, Investor’s Business Daily, USA Today, the Journal of Commerce, Seeking Alpha, GuruFocus and other publications and websites. Paul is the editor of StockInvestor.com and DividendInvestor.com, a writer for both websites and a columnist. He further is the editorial director of Eagle Financial Publications in Washington, D.C., where he edits monthly investment newsletters, time-sensitive trading alerts, free e-letters and other investment reports. Paul previously served as business editor of Baltimore’s Daily Record newspaper. Paul also is the author of an inspirational book, “Holy Smokes! Golden Guidance from Notre Dame’s Championship Chaplain,” with a foreword by former national championship-winning football coach Lou Holtz. Follow Paul on Twitter @PaulDykewicz.\n\nThe post Gold Offers a Safe-Haven Investment in Times of Crisis appeared first on Stock Investor.", "description": "Gold offers a safe-haven investment in times of crisis that .09/03/2019 19:38:53PM EST.", "authors": ["Paul Dykewicz", "Beth Baumann", "Matt Vespa", "Katie Pavlich"], "top_image": "https://media.townhall.com/_townhall/resources/images/thog.png"}