{"pub": "townhall", "url": "https://townhall.com/tipsheet/alexnitzberg/2019/10/22/border-patrol-agents-continue-arresting-previously-deported-criminals-n2555199", "downloaded_at": "2019-10-23 09:36:41.117776+00:00", "title": "Border Patrol Agents Continue Arresting Previously Deported Criminals", "language": "en", "text": "Border Patrol agents continue to capture convicted criminals who have been previously ejected from the United States. According to U.S. Customs and Border Protection, agents apprehended a man on Friday October 18th and discovered via records checks that he was a convicted sex offender.\n\nThe Mexican male had been convicted “for First-Degree Sexual Assault of a Child out of Milwaukee, Wis.,” according to the CBP press release. While the release states that Pedro Mata-Guerrero’s conviction occurred in 2013, Border Patrol agent Anthony Garcia informed Townhall that Mata was actually convicted in 1993. In 2011 Immigration and Customs Enforcement (ICE) removed Mata from the U.S. according to CBP.\n\nOn Saturday October 19th authorities arrested another Mexican male with a record in the United States:\n\n“Agents conducted records checks, which revealed that the man identified as Juan Ramon Avila-Leon, a 49-year-old Mexican national, was convicted on Oct 18, 2018, for Communicating With a Minor for Immoral Purposes out of Shelton, Wash,” according to CBP. “Avila served 364 days confinement for his conviction.”\n\nThe man was kicked out of the country early last month: “Avila was previously removed by Immigration and Customs Enforcement on Sept 5, 2019,” according to CBP. That means only about a month and a half elapsed between when ICE removed him in September and when Border Patrol arrested him in October.\n\nBoth Avila and Mata are “being held in federal custody pending further criminal prosecution,” according to CBP.\n\nThe persistent problem of previously deported criminals seeking to re-enter the country illustrates the need for strong border security. Last month Border Patrol agents came to the aid of a Mexican man who “called 911 after he became lost in the desert after illegally crossing the international border.” It turned out that the man had been “convicted of sex with a minor in 2013 and again in 2014 by Los Angeles County, California. In both cases he was sentenced to more than 150 days of incarceration.” CBP noted that, “In both instances, Castro-Garcia was deported after serving time for his conviction.”", "description": ".10/23/2019 5:34:09AM EST.", "authors": ["Alex Nitzberg", "Matt Vespa", "Timothy Meads", "Julio Rosas"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/133/d63885bf-3c7a-4a9a-bcbd-ac2735c54d62.png", "published_at": "2019-10-22"}