{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/railway-signalman-duty-paid-key-20548085", "downloaded_at": "2019-10-09 22:11:04.032683+00:00", "title": "On duty railway signalman may have paid key role in 1963 Great Train Robbery", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA railway signalman could have played a key role in the Great Train Robbery, a former British Transport Police detective claims.\n\nThomas Wyn-De-Bank was on duty in the signal box close to the spot where the mail train was raided in the early hours of August 8, 1963.\n\nNow retired detective Graham Satchwell believes it is likely he helped the plot to hijack the London-bound train near Bridego Bridge, south of Leighton Buzzard, Beds, on its way from Glasgow with over £2million.\n\nIn his new book Great Train Robbery Confidential, Mr Satchwell reveals Wyn-De-Bank had a criminal past that could have been used by the gang to coerce him into helping them.\n\nPoring over files that have been gathering dust for decades, Mr Satchwell identified inconsistencies in two statements given by Wyn-De-Bank. He also found the signalman failed to follow signal failure procedures after the gang tampered with the light to show a red signal, forcing the driver to stop.\n\n(Image: PA)\n\nAnd his book reveals that even the British Rail worker’s son, Charlie, thought his dad “sailed close to the wind”. Charlie told the author his father had concealed from his bosses that, prior to his employment, he had served time in Bedford prison for bigamy.\n\nA few years after the robbery, one of the signalman’s colleagues told Charlie he suspected Wyn-De-Bank’s involvement in the heist, which was led by armed robber Bruce Reynolds.\n\nMr Satchwell says Wyn-De-Bank failed to make the appropriate calls after the hijacked train was divided by the gang further down the line, or to raise the alarm as robbers including Ronnie Biggs, Charlie Wilson and Tommy Wisbey were making off with mailbags full of cash.\n\nThese decisions could have given the gang vital time to get away with the loot.\n\nAsked about it afterwards, he first said he knew the train had been uncoupled, but then said he did not know.\n\n(Image: Getty)\n\nIn his book, Mr Satchwell writes: “Why was he so negligent? Why didn’t he do his job? It seems to me there are only two possible reasons.\n\n“Firstly, he might have willingly taken part in the robbery. If that is the case, then he was obviously hopelessly ill-prepared for the British Rail enquiry.\n\n“Once the enquiry was overcome his only remaining hurdle would be to give evidence at the trial where his deceit might be uncovered.\n\n“He was certainly aided in hiding the truth, wittingly or otherwise, by the British Railways drive to conceal any negligence on their part.”\n\n(Image: Getty)\n\nMr Satchwell says signalman Wyn-De-Bank of Bletchley, Bucks, might have been persuaded to assist the London\n\ngangsters to avoid his previous criminal conviction coming to light, which would have caused him to lose his job.\n\nHowever, if Wyn-De-Bank was involved he certainly did not become rich from the proceeds.\n\nSon Charlie said that, though and his siblings were all bought brand new bikes a few months after the robbery, there were few\n\nluxuries in the years that followed.", "description": "Thomas Wyn-De-Bank was on duty in the signal box close to the spot where the mail train was raided - with a former detective now revealing it was likely he helped the plot to hijack the London-bound train", "authors": ["Tom Parry", "Image", "Pa", "Getty"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20545571.ece/ALTERNATES/s1200/0_Thomas-Wyn-De-Bank.jpg", "published_at": "2019-10-09"}