{"pub": "thehill", "url": "https://thehill.com/hilltv/rising/466450-progressive-commentator-democrats-addicted-to-slapping-a-new-face-on-old", "downloaded_at": "2019-10-19 10:53:29.721676+00:00", "title": "Progressive commentator: Democrats 'addicted to slapping a new face on old politics'", "language": "en", "text": "Progressive commentator Maximillian Alvarez criticized the Democratic Party, saying its establishment has a tendency to slap “a new face on old politics.”\n\n“Ultimately, what it comes down to is that the Democratic establishment is addicted to slapping a new face on old politics,” Alvarez, a host of left-leaning podcast Working People, told Hill.TV on Friday.\n\nAlvarez pointed to South Bend, Ind., Mayor Pete Buttigieg Peter (Pete) Paul ButtigiegSanders seeks spark from Ocasio-Cortez at Queens rally Biden seeks to fundraise off fact he's running out of money Biden struggles to reverse fall MORE as a prime example.\n\n“Apparently, they’ve learned nothing, except just to get a younger version of Hillary Clinton Hillary Diane Rodham ClintonState cites 38 people for violations in Clinton email review Trump campaign to hold rallies in Mississippi, Kentucky Biden struggles to reverse fall MORE or Joe Biden Joe BidenTrump knocks Romney as 'Democrat secret asset' in new video Giuliani asked State Dept. to grant visa for ex-Ukraine official at center of Biden allegations: report Perry won't comply with subpoena in impeachment inquiry MORE,” he said, referring to the Democratic Party.\n\nAlvarez’s comments come as Buttigieg looks to challenge former Vice President Joe Biden for the support of his centrist base.\n\nButtigieg raised more than $19.1 million in donations in the third quarter of 2019, which marks the third-highest haul of any presidential contender.\n\nA day after the fourth Democratic debate, Buttigieg’s campaign said it raised more than $1 million in a 24-hour period.\n\nThe South Bend, Ind., mayor also appears to be on the rise in the polls.\n\nThe mayor has picked up 4.5 points in the past month in the RealClearPolitics polling index, and currently places fourth behind progressive heavyweight Sen. Bernie Sanders Bernie SandersSanders seeks spark from Ocasio-Cortez at Queens rally On The Money: Supreme Court takes up challenge to CFPB | Warren's surge brings scrutiny to wealth tax | Senators eye curbs on Trump emergency powers Biden seeks to fundraise off fact he's running out of money MORE (I-Vt.). But he still trails Biden by more than 20 points.\n\nBiden, meanwhile, appears to be struggling with donors, who have expressed frustration with the former vice president over his string of verbal gaffes and debate performances.\n\nThe former vice president had a disappointing third-quarter fundraising showing, raising just $15.2 million.\n\nThough Biden entered the race as the front-runner, Sen. Elizabeth Warren Elizabeth Ann WarrenHillicon Valley: GOP lawmakers offer election security measure | FTC Dem worries government is 'captured' by Big Tech | Lawmakers condemn Apple over Hong Kong censorship Sanders seeks spark from Ocasio-Cortez at Queens rally On The Money: Supreme Court takes up challenge to CFPB | Warren's surge brings scrutiny to wealth tax | Senators eye curbs on Trump emergency powers MORE (D-Mass.) has emerged as a top challenger, as made clear during the Ohio debate where she was the target of attacks from rivals.\n\n—Tess Bonn", "description": "Progressive commentator Maximillian Alvarez criticized the Democratic Party, saying its establishment has a tendency to slap “a new face on old politics.”", "authors": [], "top_image": "https://thehill.com/sites/default/files/buttigiegbiden.jpg", "published_at": "2019-10-18"}