{"pub": "guardian", "url": "https://theguardian.com/sport/2019/sep/20/rugby-world-cup-tactics-nick-evans-on-how-the-leading-nations-will-play", "downloaded_at": "2019-09-20 12:58:57.234153+00:00", "title": "Rugby World Cup tactics: Nick Evans on how the leading nations will play", "language": "en", "text": "Australia – Pool D\n\nI look to their big win over the All Blacks in Perth and Nic White was fantastic. The Wallabies changed direction a lot in that game with White (9) often bouncing back on the short side. He was sniping and attacking the 1, 2, 3 defenders on either side of the ruck. What impresses me about him is that when he gets to a ruck his decision is already made because he has his head up and has identified the space.\n\nEngland – Pool C\n\nThey are all about power. You only have to look at their selections at scrum-half (Ben Youngs and Willi Heinz) to see how they are going to play and while they’ve been racking up the tries lately they do not play a lot in their own half. From the set-piece, England will look to the likes of Manu Tuilagi (from either 12/13), Joe Cokanasiga (11) and Billy Vunipola (8) to dent the defence and make the space out wide.\n\nFrance – Pool C\n\nDamian Penaud is a decent bet for the tournament’s top try-scorer because special things happen around him – he’s got such great acceleration, great feet and he’s strong. There was a lineout move recently that caught my eye. The scrum-half was at the front, they brought him around the the No 2 on the inside, the No 12 went hard over the top and that created the space for Penaud (14) out the back coming off the right wing.\n\nIreland – Pool A\n\nSo much of what Ireland do well comes in the first three phases and Johnny Sexton’s (10) wrap-around move is no different. In most cases it will be the third defender facing him and he is going to start square and try to cause disconnection around the fourth and fifth defenders. If you can identify scenarios where the tight forwards are in those positions it can be really effective.\n\nNew Zealand – Pool B\n\nNew Zealand picked both Richie Mo’unga and Beauden Barrett to start against South Africa and I’m sure we’re going to see plenty of Barrett at full-back during the World Cup. Playing two 10s gives them a two-sided attack and Barrett can get into the game a bit more in the wider channels. It can be very effective, especially against teams with line-speed such as South Africa and England.\n\nSouth Africa – Pool B\n\nIt is easy to get line-speed from the inside because you are defending narrowly. But on the outside, it is hard to keep coming. South Africa do it a lot – we saw how effective it can be in Wellington in the recent Rugby Championship, forcing the All Blacks to step back inside. It is driven by the wings and centres and it is very hard to play against because you have to adjust your depth and then find yourself getting hit behind the gainline.\n\nScotland – Pool A\n\nThey have a habit of leaking too many points which means they need to score as many of their own as possible. That makes turnover ball crucial and adds to the important of Hamish Watson (7). Not only can he slow opposition ball down but he can steal it – which gives Scotland the chance to get Finn Russell and Stuart Hogg involved when they transition from defence to attack.\n\nWales – Pool D\n\nWhen they denied England a try all match recently, we saw their ability to avoid over-folding or under-folding too much. If there was a 20-metre blindside, they had four defenders there, if it was 15, there were three. If the opposition have the ball in midfield (see graphic), then they had a solid 6/5 split of two in the tackle and two in the backfield. That defensive organisation is what this Wales team are all about.", "description": "From South Africa’s line-speed to Ireland’s signature backline move, this is what to expect from the world’s best in Japan", "authors": ["Nick Evans"], "top_image": "https://i.guim.co.uk/img/media/30d2686773c5155703480cceff5f062c921e8b19/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1aa1798b9f5e1c925151f52c4ac876a4", "published_at": "2019-09-20"}