{"pub": "nymag", "url": "https://vulture.com/2019/09/couples-therapy-showtime-cast.html", "downloaded_at": "2019-09-26 14:52:42.808680+00:00", "title": "How Couples Therapy Put Therapy on TV (Without Ruining the Therapy)", "language": "en", "text": "Elaine and DeSean in an episode of Couples Therapy. Photo: Courtesy of SHOWTIME\n\nThe Showtime docuseries Couples Therapy is an experiment inspired by a single question: “Is it possible to capture what goes on in therapy while preserving the authenticity?” It seems implausible that a couple diving into their deepest arguments and traumas could be exactly the same in front of a camera as they would be in private. Doing so also raises a briar patch of thorny ethical concerns. But the show’s mission, as envisioned by co-producers Josh Kriegman and Elyse Steinberg, is exactly that.\n\nThe idea of therapy sessions being broadcast as entertainment is hardly new, of course — figures like Dr. Drew regularly provide “counseling” to reality TV personalities, and more than one Real Housewife has broadcast her therapy sessions on Bravo — but those attempts are almost always, to put it mildly, bad, both in terms of therapeutic practice and in the way they exploit trauma for ratings. And unlike Esther Perel’s popular podcast, Where Should We Begin? — an example of therapy made public in a healthier and more serious way — Couples Therapy can’t offer the semi-anonymity of an audio-only production, nor a one-session, one-episode format that ensures couples are only exposed for a single hour. On Couples Therapy, they show up for multiple sessions, episode after episode.\n\nThe couples of Couples Therapy had to be called “participants” rather than “patients,” because a doctor-patient relationship comes with legally required confidentiality. Rather than paying to get therapy, the docuseries paid participants to receive it. Even aside from the strict ethical questions of medical practice, the gut-level voyeurism of watching couples discuss their sex lives, their childhoods, and their financial insecurities can trigger an icky, nauseous sense of overstepped boundaries and exploitation. But Couples Therapy tactfully avoids all those obstacles, suggesting that when filmmakers and participants approach this idea seriously enough, if there’s enough care taken with the design and execution of a series, therapy made so widely visible can still be effective and meaningful for those involved. It can also make for very compelling television.\n\nThe idea for the show came from Kreigman’s experiences with his parents, who are therapists, as well as from his and Steinberg’s 2016 documentary, Weiner. The movie was about Anthony Weiner’s New York City mayoral campaign, but the story was shown almost entirely through his marriage to Huma Abedin, allowing the movie to feel much more human and more complicated than a simple, win-or-loss political story. “The reality of their relationship was way more complicated than it appeared in the public,” Steinberg said. “We came away really wanting to delve into this truth of a relationship that’s way more complicated than it appears on the surface.”\n\nGoing from Anthony Weiner’s marriage to a show about couples therapy was already a wild leap, but the mechanics of how to do it well were an even bigger concern: How do you find participants who won’t turn it into a circus? How do you record the process without interfering? One key was persuading Orna Guralnik, the show’s therapist, to sign on to the project. Her skill and care is a massive feature of Couples Therapy, in part because she’s able to push back when necessary, but always with the clear goal of making useful connections for the participants rather than merely putting their pain on display for the cameras. Guralnik’s insights are occasionally so revelatory that they hit the participants like a wave of surprise; they also give the audience compelling arcs to follow, full of twists and satisfying discoveries. But it took a long time to convince Guralnik to actually appear on camera. “I thought I would talk to them like a consultant,” she said, “someone who could give them some background information.”\n\n“They had to earn my trust,” Guralnik recalled. “Are they going to try to make this into something that it is not? Is there going to be a wish for more drama?” Once she understood their intent, though, Guralnik said she “got super excited about the possibility of someone documenting what really happens [in therapy] as opposed to the endless caricatures we have on film.”\n\nProducers interviewed more than 1,000 couples during the casting process, trying to find people who were sincerely interested in the project, who truly wanted to get therapy, and who were inspired by the idea that witnessing real therapy could be helpful for others. They also needed to screen out individuals who might be harmed by the process of making the show. “It had to be people who were well enough to withstand the pressure and anxiety of this project,” Guralnik said. “You don’t want to get involved with people who are very vulnerable, a suicidal person or a drug addict. We didn’t want to take people who were vulnerable and this could unravel them.” Guralnik was not involved with casting and screening the couples; when she meets them in the first episode, it’s for the very first time. She does know several of the other therapists who were involved with the process, though, and offered advice on what issues wouldn’t be a good fit for the project.\n\nElaine and DeSean, whose last names aren’t used in the show to allow them a small amount of anonymity, discovered the project when Elaine responded to an online recruitment post from the producers. (“She answers a lot of these types of internet questionnaires,” DeSean said. “‘10 Facts Will Reveal How Much You’re In Love With Each Other,’ stuff like that.”) They didn’t think they’d be chosen, but when producers asked them to participate, it was a “no-brainer.” “We were in a space where it was a do-or-die situation for our relationship,” Elaine said. The filmmakers credit their sincere desire to get help, rather than their desire to be on TV, as fundamental to the show’s mission. “They were genuinely looking for help,” Steinberg said, “and this was an opportunity to work with a world-class therapist.”\n\nThe other key to Couples Therapy is the space where the sessions take place. It looks like any typical therapist’s office, a neutral room full of tasteful tchotchkes and comfortable, stylish furniture. It looks so unremarkable that it’s easy to ignore the most important thing about it: You can’t see any cameras. “We created an office where the cameras actually were concealed behind one-way glass,” Kriegman said. “They could come in, sit in the waiting room, do an hour session with Orna, leave, and never once interact with any element of production or see a camera.”\n\nAnother couple in the “office” with Dr. Orna. Photo: Courtesy of SHOWTIME\n\nGuralnik, Elaine, and DeSean all point to the set design as a huge part of their successful experience with the series. “It really made you feel like you were in Dr. Orna’s office. That allowed us to forget that we were being filmed. It doesn’t occur to you because there’s not a camera in your face,” Elaine said. “Every week you’d go in knowing that there’s cameras somewhere,” DeSean added, “but three minutes into the session, you forget.”\n\n“They didn’t include it in the editing,” Guralnik explained, “but for each of these couples, there was some level of checking in on how they were feeling about being part of the project. But it was more a concern for us than for them. They were like, Yeah, yeah, there’s a camera, but can we talk about what happened yesterday?”\n\nThere is one more participant in Couples Therapy: Guralnik’s dog, Nico, an adorable, mid-size black-and-white pooch with floppy ears and bright-blue eyes, who bounces over to greet couples as they walk in the door to Guralnik’s office. (Several participants lean over to pet her before sitting down on the sofa across from Guralnik’s chair.) “Nico is a deeply soothing presence, reminding people of a baseline of safety and goodness,” Guralnik said. “I have seen very tense and guarded people reveal sweet and playful sides in response to her.”\n\nFor the filmmakers, for Guralnik, and for Elaine and DeSean, Couples Therapy is an experiment that worked. “I was utterly floored,” Guralnik said, “in awe of their capacity to translate the essence of each treatment into the language of film.” That may be due to something Kriegman and Steinberg realized several months into the process of making the show: Therapy and filmmaking are a lot alike. “The parallel between therapy and filmmaking is really fascinating. You gather the raw material, and then you sift through it to find the story that is the true story. It was surprising how similar that was to the editing process,” Kriegman said.\n\nIn the case of Elaine and DeSean, that true story began with DeSean’s frustration with Elaine — how much she contacts him at work, how needy she seems, how overbearing and dramatic he felt like she could become, often with no underlying logic or explanation. For Elaine, the frustration was inverse: DeSean was ignoring her, drifting farther away from her needs and desires. Over the course of the show’s eight episodes, Guralnik uncovers a history of early experiences that had been “coloring” the couples’ understanding of one another, often in ways they were completely unconscious of. “Prior to going through [the show] I don’t know that I heard a lot of what he said,” Elaine told me. “I’m painted by my own stuff.”\n\nWhen I asked Elaine and DeSean whether the experience felt more like making a TV show or being in therapy, they didn’t hesitate. “The latter,” DeSean said. “I think Dr. Orna saved our lives, our marriage. Definitely.”", "description": "The Showtime docuseries Couples Therapy is an experiment inspired by a single question: “Is it possible to capture what goes on in therapy while preserving the authenticity?” Here’s how the show pulled it off.", "authors": ["Kathryn Vanarendonk"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/25/25-couples-therapy-lede.w1200.h630.jpg", "published_at": "2019-09-26"}