{"pub": "dailybeast", "url": "https://thedailybeast.com/pontius-pilate-not-as-bad-as-we-thought-new-archaeological-evidence-triggers-reassessment", "downloaded_at": "2019-10-27 11:52:27.234270+00:00", "title": "New Archaeological Evidence Shows Pontius Pilate Not as Bad as We Thought", "language": "en", "text": "When you hear the name “Pontius Pilate” you probably think of Jesus. After all, were it not for Jesus the vast majority of people would never have heard of him. Historians remember Pilate as a rash and headstrong ruler who unnecessarily offended the religious sensibilities of Jews in Roman Judea, plundered the Temple treasury, and—most famously—sentenced Jesus of Nazareth to die. He was, in other words, an ineffective leader whose actions contributed to political unrest in the region and who is best known for executing a Galilean teacher for treason. But new archaeological discoveries in Jerusalem suggest that perhaps Pilate was not as bad as previously thought.\n\nAs reported by LiveScience, archaeologists working in Jerusalem have excavated an important nearly 2000-foot-long street that connected the Temple Mount to the pool of Siloam, an ancient religious site where people would bathe and collect fresh water. The existence of the street was well known to archaeologists ever since its discovery by British archaeologists in 1894, but what has emerged from the more recent excavations was that it was Pilate who was responsible for its construction.\n\nThe archaeologists from Tel Aviv University and the Israel Antiquities Authority who excavated the street discovered a hundred coins dating to between 17 and 30/31 A.D. trapped in the paving stones. This leads them to conclude that most if not all of the construction was performed while Pilate was governor of the region as construction must have been finished by 30/31 A.D., during Pilate’s tenure as governor.\n\nNEWSLETTERS Beast Travel Digest Get the entire world in your inbox. Subscribe By Clicking \"Subscribe\" you agree to have read the Terms of Use and Privacy Policy\n\nDonald T. Ariel, a coin expert who works with the Israel Antiquities Authority, said “Dating using coins is very exact… As some coins have the year in which they were minted on them… statistically, coins minted some 10 years later are the most common coins in [excavations of sites in] Jerusalem, so not having them beneath the street means the street was built before their appearance, in other words only in the time of Pilate.”\n\nThe fact that the street connects the pool of Siloam and the Temple is suggestive and can tell us something about its purpose. In the New Testament Jesus sends a man “born blind” that he heals to complete his healing. The story might suggest that in the first century the pool was a mikvah (or ritual bath) that had a kind of cleansing or purifying function. Pilgrims could stop there to bathe before approaching the holiest place in Judaism. The story involving Jesus might suggest that the two locations both served a kind of healing function: those who had been sick would bathe before presenting themselves to priests, who would evaluate their physical (and, thus, spiritual) health. For Pilate, as a Roman, the link between healing and temples would have been obvious because temples to the god of healing, Asclepius, were as much healing centers as they were religious sites.\n\nThe size of the street—approximately 25 feet wide—and the large stone slabs used to pave it suggests that the road had a certain grandeur to it. Joe Uziel and Moran Hagbi, archaeologists at the Israel Antiquities Authority and co-authors of the recently published article “Pontius Pilate in Jerusalem: The Monumental Street from the Siloam Pool to the Temple Mount” argued that if this was a simple walkway joining two points there would be no need for a thoroughfare of such size: “its finely carved stone and ornate 'furnishings' …all indicate that this was a special street.” Taken together all of this evidence points to the importance of the street for those ascending to the Temple Mount. This would mean that during his time as governor Pilate used funds to construct a road that would help Jewish pilgrims reach the Temple Mount.\n\nThis would be out of character for a man best known for his religious insensitivity and heavy-handed approach to leadership. A former soldier, Pilate took an aggressive stance towards those under his rule. According to the first century Jewish historian Josephus, Pilate flouted the Jewish prohibition against idolatry by having Roman soldiers bring imperial standards that included the emperor’s image into Jerusalem (albeit at night). The incident provoked outrage and a crowd journeyed to Pilate’s residence at Caesarea to implore him to remove the standards. They remained there, prostrate, for five days. After five days of protest, Pilate gathered the crowd in the market-place, seemingly to render a decision on the matter. Instead of speaking, he had soldiers encircle the protesters and draw their swords. He told the Jews gathered there that unless they relented he would have them cut in pieces. In response, the protesters purportedly bared their necks as a sign that they were prepared to die. At this point, Pilate had to back down, and removed the standards from the city.\n\nThe Jewish philosopher Philo, who calls Pilate “inflexible, stubborn, and cruel,” offers another story that also portrays Pilate as an over-zealous ruler. In his Embassy to Caligula he writes that Pilate deliberately tried to “annoy” the Jewish people by setting up gilded shields in Herod’s palace in Jerusalem. When the authorities asked him to remove them, he refused and the people had to write to the Emperor Tiberius asking for his help. Philo adds that Pilate was afraid that the people would reveal to Tiberius “his violence, his thefts, his assaults, his abusive behaviour, his frequent execution of untried prisoners, and his endless savagery.” If true, it would seem that Pilate treated Jesus better than others. Philo is biased, but it’s obvious that Pilate was no diplomat either. On another occasion, Josephus says, Pilate used funds from the Temple treasury to pay for the construction of an aqueduct. Compared to these stories, the biblical descriptions of Jesus’s trial before Pilate make him appear reasonable and thoughtful.\n\nAccording to Josephus, Pilate’s governorship ended after the slaughter of a group of Samaritans near Mount Gerizim. Pilate was then recalled to Rome for a hearing. We do not know what happened but one thing is certain: Pilate did not return to Judea. One historically questionable tradition, relayed in the writings of the fourth century Christian historian Eusebius, says that Pilate committed suicide.\n\nThe discovery that Pilate was responsible for building the street from the pool of Siloam to the Temple Mount suggests that there was another side to the intemperate governor. One in which Pilate funded public works for the benefit of both the local people and their religion. That Pilate would take such steps is especially interesting given that Joan Taylor has suggested that Pilate had been trying to promote the imperial cult in the region. Whether the purpose of the road was to serve religious tourists, benefit locals, or facilitate healing practices, it seems that Pilate’s building project was altruistic in nature: it was something he did either to placate or to please Jewish authorities and locals. All of which suggests that perhaps Pilate was more sensitive and complicated than we have thought.", "description": "Long known as an ineffective leader whose actions contributed to political unrest in the region, recent discoveries may be complicating that picture.", "authors": ["Candida Moss"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1572098298/191027-moss-pontius-pilate-hero_r18g6k", "published_at": "2019-10-27"}