{"pub": "yahoo", "url": "https://finance.yahoo.com/news/inside-lvmh-14-5-billion-180932614.html", "downloaded_at": "2019-10-28 23:42:50.448465+00:00", "title": "Inside LVMH’s $14.5 Billion Bid for Tiffany: ‘It’s Survival of The Fittest’", "language": "en", "text": "The honor of your presence—and spending money—is requested at the union of Tiffany & Co. and LVMH. Maybe.\n\nAfter a weekend of rumors, Tiffany & Co. released a statement saying that its higher-ups have “received an unsolicited, non-binding proposal from LVMH Moet Hennessy—Louis Vuitton to acquire Tiffany for $120 per share in cash.”\n\nAccording to the Wall Street Journal, the offer would set LVMH back $14.5 billion—the most it’s ever paid for a company. The storied jewelry brand board’s of directors will review the offer, and no official decision has been made.\n\nIn engagement ring parlance, the suggested deal is no “She said yes!” Higher-ups at the jewelry retailer will take their time to negotiate. But a sale would be the beginning of a new era for the 182-year-old Tiffany and Co., and yet another example of LVMH gobbling up another prestige property.\n\nDiamonds Grown In a Laboratory Can Still Say, ‘I Love You’\n\nJust this year, the French fashion house launched Fenty, a label designed by the singer Rihanna. In 2017, CEO Bernard Arnault acquired Dior in a deal worth $13.1 billion; it also owns big names like Sephora, Givenchy, Marc Jacobs, and Louis Vuitton.\n\nRepresentatives for Tiffany and Co. directed The Daily Beast’s request for comment to a press release the brand already published. LVMH did not respond to an inquiry.\n\nTiffany has held an indelible stamp on the imagination of many shoppers, partly due to its recognition as a cultural touchstone. The Fifth Avenue flagship served as inspiration for Truman Capote novella Breakfast at Tiffany's (and subsequent legendary Audrey Hepburn film), and Marilyn Monroe sang about the store in “Diamonds Are a Girl’s Best Friend.” It is the namesake of Tiffany Trump, whose father Donald’s most famous property rests adjacent to the store.\n\nBut such endorsements have proved not enough to save the struggling jeweler, which reported disappointing sales last holiday season, falling one percent from 2017. This year, the brand seems almost militant in publicizing its seasonal offerings, like its much ballyhooed $112,000 advent calendar.\n\nExperts told The Daily Beast the LVMH safety net could help resuscitate Tiffany’s, and that the famously cliquey fashion world tends to favor when brands consolidate.\n\n“Today’s landscape is increasingly crowded and challenging,” said Alexis DeSalva, a senior research analyst at the market insight firm Mintel. “Existing brands and retailers need to evolve and understand how to do so efficiently, which for many means joining forces with others or becoming part of a larger group. There’s strength in numbers.”\n\n“Fashion conglomerates wield the power, as long as they are relevant,” said Roseanne Morrison, fashion director of retail strategist company The Doneger Group. “It is about the survival of the fittest, especially as conglomerates recognize true artists and buy into their aesthetic. Investment trumps all.”\n\nTiffany’s seems to prioritize its heritage and instant name recognition over innovation. Though this year the brand made a bid for younger, cooler customers (who still can afford five-figure diamonds), through its collaboration with Lady Gaga, executives have been hesitant to accept that their industry is changing.\n\nThis year, Tiffany’s addressed the need to responsibly source all diamonds but stopped short at offering lab-grown options, which are becoming increasingly popular for millennials desiring ethical (and cheap) engagement rings.\n\nAndy Hart, the brand’s senior vice president of diamond and jewelry supply, told the trade magazine JCK that, “Our position is lab-grown diamonds are not luxury material. We don’t see a role for them in a luxury brand.” Perhaps LVMH, which exists both to inspire change and make money, could push designers to reconsider.\n\n“Customers can identify brands and certainly have preferred brands, but that’s generally as deep as consideration goes when making shopping decisions,” Morrison said. “Whether or not a brand was purchased by another company doesn’t really matter when it comes down to it.”\n\nElizabeth Shobert, vice president of marketing and digital strategy for retail insight company StyleSage, called marriage the “perfect analogy” for any potential acquisition.\n\nStory continues", "description": "The honor of your presence—and spending money—is requested at the union of Tiffany & Co. and LVMH. Maybe. After a weekend of rumors, Tiffany & Co. released a statement saying that its higher-ups have “received an unsolicited, non-binding proposal from LVMH Moet Hennessy—Louis Vuitton to acquire Tiffany", "authors": ["Alaina Demopoulos"], "top_image": "https://s.yimg.com/uu/api/res/1.2/OIXwDtWFsgo9TqcIpOJGcw--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/403c67ece329c58324b8c4af04b4520a", "published_at": "2019-10-28"}