{"pub": "independent", "title": "Can you make a sports career pay?", "url": "https://independent.co.uk/money/spend-save/sports-career-earning-money-income-school-leavers-graduates-a8958076.html", "language": "en", "published_at": "2019-06-14", "downloaded_at": "2019-09-02 07:47:27.576667+00:00", "text": "It’s a great month for sports fans. The Fifa Women’s World Cup is well underway, the ICC Cricket World Cup is in full swing and, more importantly, it’s school sports day season.\n\nAnd while such feats may inspire some adults to dust off their trainers and go for a jog, the lucrative fees, prizes and sponsorship deals that seem to fall at the feet of the elite might play more on the minds of parents and sporty school leavers.\n\nMany sports require a considerable investment to partake in as anything more than a hobby. The question for those graduates and school leavers who want to pursue a career in sport is – can the sport they love ever make them a real income? For parents, managing the costs of giving their child a shot at becoming a professional sportsperson can be a significant financial drain.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nSo is it worth it and can sport ever actually pay?\n\nThe (un)likelihood of reaching the top\n\nNot every kid who picks up a mic gets to be Mick Jagger and not every child who kicks a football will make it as a professional – even if they have enormous talent and investment.\n\nAnalysis from comparison website Money Pug shows that of the 1.5 million boys that attempt to become professional footballers, only 180 make it as Premier League professionals, 1,396 as Football League professionals, and 3,664 as semi-professionals in Non-League.\n\nFor rugby fans the competition is fierce as England has more players than any of the other six nations countries. Rugby-mad kids are as likely to become premiership players as they are to be injured by a mattress, with chances as slim as 0.036 per cent.\n\nCricket star has the highest probability rate out of the country’s most popular sports at 0.16 per cent; compared with becoming a tennis professional which has a 0.0032 chance.\n\nThose who do make it to the big league – literally for once – have the chance to make a substantial amount but the costs of making the effort can also be substantial.\n\nFootball is one of the most popular sports and has training costs per year averaging £6,250 – a far cry from the £12,017 average annual training cost tennis but still far more than cricket, which averages out at £3,040 a year for training.\n\nPotential payout\n\nSome sports are far more lucrative than others for those who do reach the top. For example, the prize money at Wimbledon this year has increased by almost 12 per cent, with the total pot standing at £38m. The singles champions will earn £2.35m while the first-round singles loser will walk away with £45,000.\n\nMeanwhile, many other athletes have to balance training with additional jobs as they try to make ends meet.\n\nOf course, few people if any are sufficiently generally sporty to make a careful assessment of the costs of different sports and decide which one has the greatest cost and greatest likelihood of a decent salary.\n\nMost develop a talent for a specific sport early on and then train extensively to hone that talent. So there’s little point in looking at the profitability of other sports afterwards.\n\nSportswomen face the same training costs and initial investments but, frustratingly, there’s less chance they will be in line for the same kind of money if they do make it to the top.\n\nLast year’s Forbes list of the top 100 highest-earning athletes did not include any women. In fact, the 10 highest-paid female athletes earned a combined total of less than the top three male athletes did individually.\n\nThings are improving; last year Wimbledon agreed to award the same amount to the male and female champions. But there is still a long way to go.\n\nIt hardly needs saying that most professional sportspeople are not global athletes commanding high salaries and sponsorship deals.\n\nMost will need a fallback plan, either for when their professional career comes to an end or to subsidise that career while they pursue it. Some take up training roles within their sports, others work in other sports-related fields.\n\nClearly there will be more opportunities within the more popular sports and that is worth factoring into any long-term career plans just in case a career as the next Harry Kane isn’t possible.\n\nGrowing rewards for e-sports\n\nInterest in so-called e-sports is a growing phenomenon, where computer games are played competitively, with the larger tournaments offering significant prize money.\n\nLast summer Epic Games agreed to provide $100m (£79m) in prize money for Fortnite tournaments. Here in the UK, 600 players earned a combined £2.17m taking part in e-sports competitions in 2018, according to Esports Earnings.\n\nOver in the US, where sporting prowess can lead to university scholarships, e-sports can also pay off. A number of universities there offer scholarships for talented gamers.\n\nHere in the UK, the University of Roehampton has created 15 e-sports scholarships worth £1,500 a year and available from September.\n\nFinally, a sport where the only initial investment needed is in a console.", "description": "It’s a great month for sports fans. The Fifa Women’s World Cup is well underway, the ICC Cricket World Cup is in full swing and, more importantly, it’s school sports day season. And while such feats may inspire some adults to dust off their trainers and go for a jog, the lucrative fees, prizes and sponsorship deals that seem to fall at the feet of the elite might play more on", "authors": ["Felicity Hannah"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/06/13/20/millie-bright-0.jpg"}