{"pub": "fox", "url": "https://foxnews.com/science/more-than-100000-cancer-cases-could-be-caused-by-contaminants-in-tap-water-study-finds", "downloaded_at": "2019-09-20 23:58:48.481303+00:00", "title": "More than 100,000 cancer cases could be caused by contaminants in tap water, study finds", "language": "en", "text": "A toxic cocktail of chemicals found in U.S. drinking water could be the cause of more than 100,000 cases of cancer, a new study by the nonprofit Environmental Working Group (EWG) found.\n\n“The vast majority of community water systems meet legal standards,” said Olga Naidenko, Ph.D., EWG’s vice president for science investigations, in a press release.“Yet the latest research shows that contaminants present in the water at those concentrations – perfectly legal – can still harm human health.”\n\nThe study, published in the research journal Heliyon, conducted an assessment of 22 carcinogenic contaminants which meet national drinking water standards and found that a majority of the risk is due to arsenic, disinfection byproducts and radioactive contaminants. Overall, tap water exposure to the carcinogens studied leads to 105,887 cases of cancer in the U.S. over a statistical lifetime, or 70 years. This is the equivalent of four cancer cases per 10,000 people.\n\nMOSAIC DISCOVERED IN ISRAELI 'BURNT CHURCH' MAY DEPICT JESUS' MIRACLE OF THE LOAVES AND FISHES\n\nLuckily, use of a water filter decreases the risk of exposure to these contaminants.\n\nCancer risk assessments are standard for air quality evaluations under the Environmental Protection Agency (EPA), the study is the first of its kind to perform a comprehensive cancer risk assessment of drinking water pollutants.\n\nFIVE INCONVENIENT TRUTHS ABOUT THE 'CLIMATE STRIKE'\n\n“Drinking water contains complex mixtures of contaminants, yet government agencies currently assess the health hazards of tap water pollutants one by one,” said Sydney Evans, science analyst and lead author of the paper, in a press release. “In the real world, people are exposed to combinations of chemicals, so it is important that we start to assess health impacts by looking at the combined effects of multiple pollutants.”\n\nThe study analyzed water quality profiles for 48,363 community water systems, which provide water for around 86 percent of U.S. homes. The other 14 percent rely on private wells for drinking water.\n\nThe study found that the risk is higher in the western part of the country, due to water scarcities faced there. “Drier conditions decrease water availability from surface water sources, concentrate contaminants in the existing water sources, and prompt communities to use groundwater resources even in areas where underlying aquifers may have higher levels of arsenic or radioactive chemicals,” it found. It also found that those who rely on public water sources in smaller communities are more at risk than in larger ones.\n\nThe study reiterated that most of the water they tested was in compliance with national drinking water standards. E.P.A. data show that only 4.5 percent to 5.5 percent of community water systems had serious violations from 2014 to 2017.\n\n“We need to prioritize source water protection, to make sure that these contaminants don’t get into the drinking water supplies to begin with,” Naidenko concluded.\n\nGET THE FOX NEWS APP\n\nNumerous other contaminants which could potentially be hazardous to public health were not able to be included in the study.", "description": "A toxic cocktail of chemicals found in U.S. drinking water could be the cause of more than 100,000 cases of cancer, a new study by the nonprofit Environmental Working Group found.", "authors": ["Morgan Phillips"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/drinking_water_istock.jpg", "published_at": "2019-09-20"}