{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7551549/Love-Islands-Harley-Brash-shows-figure-skimpy-white-dress.html", "downloaded_at": "2019-10-09 00:24:10.883613+00:00", "title": "Love Island's Harley Brash shows off figure in skimpy white dress", "language": "en", "text": "She's been single since splitting from her fellow Love Island 2019 contestant, Chris Taylor.\n\nAnd Harley Brash was enjoying a night out in London on Tuesday, visiting the Bluebird Chelsea in a skimpy white minidress.\n\nThe reality star, who was the first of the latest crop of Love Island stars to split from their on-screen partner, showcased her svelte physique in the silky number.\n\nAll-white on the night: Harley Brash was enjoying a night out in London on Tuesday, visiting the Bluebird Chelsea in a skimpy white minidress\n\nHarley exuded confidence in her off-the-shoulders number, working her best angles as she posed outside the venue.\n\nThe blonde bombshell matched her knee-high boots to her frock, making the most of her petite frame.\n\nThe starlet styled her long hair down straight and opted to wear no jewellery, letting her all-white outfit take centre stage.\n\nConfident: Harley exuded confidence in her off-the-shoulders number as she headed out solo\n\nBit of all-white: The blonde bombshell matched her knee-high boots to her frock, making the most of her petite frame\n\nSpeaking to Stephen Leng on Fubar Radio, Harley opened up about her break-up from business development manager Chris and admitted to kissing mystery boys since their split.\n\nShe said last month: 'I’m happy being single at the moment. I’m just enjoying myself.\n\n'I’m having fun. I don’t kiss and tell but it is nice.'\n\nKeeping it simple: The starlet styled her long hair down straight and opted to wear no jewellery, letting her outfit take centre stage\n\nOn her split from the business development manager, Harley confessed: 'We were just better off as friends…we had such busy schedules and we both realised that it was better to break it off now and we could still be friends.'\n\nThe TV star also praised her Love Island friendships: 'Everyone has got everyone’s back and best interests at heart. It is like a little family.\n\n'I could ring anyone up from the show and be like, \"look I’ve got this issue I’ve got this problem, can you help us out and give us a bit of advice\" and not one person would say no.'", "description": "Harley Brash was enjoying a night out in London on Tuesday, visiting the Bluebird Chelsea in a skimpy white minidress.", "authors": ["Kate Thomas For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/20/19456718-0-image-a-13_1570561241748.jpg", "published_at": "2019-10-08"}