{"pub": "bbc", "url": "https://bbc.com/news/business-49644025", "downloaded_at": "2019-09-10 07:45:00.296082+00:00", "title": "Jack Ma: Alibaba begins new era as founder departs", "language": "en", "text": "Image copyright Getty Images\n\nAlibaba chairman Jack Ma is due to step down from the e-commerce giant on Tuesday, marking the end of an era for the firm.\n\nHe co-founded Alibaba in 1999 and it has become one of the world's biggest internet firms.\n\nMr Ma's success and colourful style has made him one of China's most recognisable businessmen.\n\nDaniel Zhang, currently Alibaba's chief executive, will replace him as executive chairman.\n\nThe company is now valued at $480bn (£389bn) and Mr Ma is China's richest man, with a net worth of $38.6bn according to Forbes.\n\nHe is also the first founder among a generation of prominent Chinese internet entrepreneurs to step down from his company.\n\n\"I think it will be very hard to replace somebody like Jack Ma,\" said Rebecca Fannin, author of a book on China's technology titans.\n\n\"He is one of a kind. He is the Steve Jobs of China.\"\n\nWho is Jack Ma?\n\nBorn to a poor family in the eastern Chinese city of Hangzhou, Mr Ma began his career as an teacher.\n\nHe bought his first computer at the age of 33 and was surprised when no Chinese beers turned up in his first online search for \"beer\".\n\nWith no background in computing, Mr Ma co-founded Alibaba in his apartment, having convinced a group of friends to invest in his online marketplace.\n\nIt was not the first time he had tried to get a start-up off the ground.\n\n\"Alibaba was his third attempt at a company, he had two trials before,\" said Duncan Clark who has written a book about Mr Ma and is also chairman of investment consultancy BDA China.\n\n\"He saw the promise of the internet quite early on, but it took a while for him to have a vehicle.\"\n\nOver the years, Alibaba has grown from an online marketplace into an e-commerce giant with interests ranging from financial services to artificial intelligence.\n\nIt was originally set up as a trading platform for businesses, before expanding into consumer e-commerce in 2003 and later launching digital payment platform Alipay.\n\nLacking a background in technology and with no particular strength in finance, Mr Clark said charisma and strategic vision have been Mr Ma's biggest assets.\n\n\"His charm is a big part of his leadership, his ability to convince people whether it's customers, employees or critically shareholders.\"\n\nThe author first met Mr Ma two decades ago and the entrepreneur spoke of making Alibaba one of the top 10 internet companies in the world within a decade.\n\n\"[It was] a sort of impossible ambition in a way but somehow he made people believe it,\" Mr Clark said.\n\nMr Ma did turn his firm into an international heavyweight and its listing in New York set a record as the world's biggest public stock offering.\n\nEarlier this year, he argued in favour of the \"996 system\" where workers are expected to work 12 hour days, and a six-day week - a hotly debated topic in Chinese media.\n\nThe flamboyant businessman is also known for enjoying the limelight and featured at an Alibaba event in 2017 wearing a Michael Jackson-themed outfit.\n\nWhat's next for Mr Ma?\n\nThe 55-year-old is expected to focus on philanthropy and education after he steps down.\n\nMr Clark said he has gradually brought technology and finance experts into Alibaba and more recently, Mr Ma has been \"consciously edging himself out\".\n\nThose moves are expected to ensure a more seamless transition for Alibaba to a future without its co-founder.\n\nQuiet, unassuming and known to shy away from the spotlight, Mr Zhang is nothing like his predecessor.\n\nInside Alibaba Mr Zhang is reportedly known as Xiaoyaozi, the name of a character in a Chinese martial arts novel. It means the \"unfettered one\"- someone who stays out of battles but is great at training others.\n\nThat reputation will come in handy as he steers Alibaba through arguably some of its most challenging times. The Chinese market, where it makes two thirds of its revenue, is slowing down.\n\nAt the same time, attempts to expand internationally have struggled.\n\nUS scrutiny of Chinese firms is blocking its growth in the West. In parts of South East Asia and India, analysts say understanding how to work in local markets and with local people is proving to be a challenge for the Chinese company.\n\nThen there's the delayed multi-billion dollar public offering in Hong Kong, reportedly due to pro-democracy protests there.\n\nYet Mr Zhang's greatest challenge may be living up to the image of Mr Ma himself, a man who enjoyed the respect and affection of his staff as well as the international community.", "description": "The charismatic Chinese businessman led Alibaba to become one of the world's biggest internet firms.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/7CDA/production/_108726913_gettyimages-1149303431.jpg", "published_at": "2019-09-10"}