{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7562721/Trainee-plumber-37-accused-smothering-baby-daughter-death.html", "downloaded_at": "2019-10-11 20:33:38.142584+00:00", "title": "Trainee plumber, 37, accused of smothering his baby daughter to death", "language": "en", "text": "Cherinea Denton, 34, pictured outside the Old Bailey last week, met Kevin Eves online\n\nA father accused of smothering his baby daughter following weeks of violence seriously injured another young child 12 years before, a court heard today.\n\nKevin Eves, 37, allegedly caused multiple fractures to eight-week-old Harper Denton before she was found collapsed at the family home in Wixams, near Bedford, on June 12 last year.\n\nThe Old Bailey was told how the baby's mother Cherinea Denton, 34, was unaware that in 2006, Eves, then known as Forbes, had been jailed for hurting another young child in his care.\n\nMs Denton, who met Eves on the internet, had allegedly accepted the defendant's explanation that he had been convicted over a fight at a house party.\n\nProsecutor Sally Howes QC outlined Eves' history of violence towards another young child in his care.\n\nIn 2006, Eves, then known as Forbes, was jailed for nine years after he was convicted of causing grievous bodily harm with intent and wilfully assaulting a child.\n\nThe victim in that case had suffered 'life-threatening' head injuries and fractures to the elbow.\n\nEves had claimed the young boy was injured after he fell on the floor from a washing machine while in his care.\n\nBut the injuries were said to be consistent with the child being 'swung forcefully by the arms such that his head impacted against a surface such as the floor or a wall'.\n\nKevin allegedly caused multiple fractures to eight-week-old Harper Denton before she was found collapsed at the family home on this road in Wixams, near Bedford, on June 12 last year\n\nOther injuries strongly suggested physical abuse over a 'prolonged period of time', jurors heard.\n\nMs Howes told jurors: 'It is the Crown's case that the life-threatening assault upon the toddler is relevant because the nature of the assault and the circumstances surrounding and leading to that assault are so similar to the assault and the circumstances surrounding and leading to the assault upon Harper that it demonstrates a clear and definite propensity to commit life-threatening and fatal assaults upon very young children when left in his sole charge.'\n\nThe court heard how on June 11 last year, Ms Denton fell asleep on the sofa and Eves put Harper into a Moses basket in the main bedroom.\n\nAccording to the defendant, he fed Harper at 1am then woke at 6am to find she had turned 'purple' and was cold to the touch.\n\nHarper was rushed to hospital where she was pronounced dead.\n\nA post-mortem examination of Harper identified 34 rib fractures, 11 classic metaphyseal fractures, two fractured metatarsal bones - one in each foot - and a skull fracture.\n\nThe 'severe' injuries were allegedly inflicted over at least three episodes in the three weeks leading to Harper's death.\n\nWhile the cause of death was unascertained, an expert found the evidence consistent with smothering, the court heard.\n\nEves, of Wixams, has denied murder and grievous bodily harm with intent.", "description": "Cherinea Denton, 34, the mother of baby Harper Denton, was unaware that in 2006, Kevin Eves, 37, of Wixams, near Bedford, had been jailed for hurting another young child in his care, a court heard today.", "authors": ["Mark Duell For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/13/19588254-0-image-a-109_1570798156265.jpg", "published_at": "2019-10-11"}