{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/kevin-clifton-breaks-silence-strictly-20527704", "downloaded_at": "2019-10-07 03:37:25.664470+00:00", "title": "Kevin Clifton breaks silence on Strictly exit as he praises Anneka Rice's 'heart'", "language": "en", "text": "Get the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nKevin Clifton has broken his silence after he and celebrity dance partner Anneka Rice were eliminated from this year’s Strictly Come Dancing .\n\nTaking to Twitter , the Strictly pro wrote: “Thank u @AnnekaRice for a lovely few weeks. You worked so hard and in a short space of time started dancing with your heart.\n\n“Good luck to all the other contestants. Its going to be a cracking @bbcstrictly series”.\n\nKevin, 36, and Anneka, 61, were the second pair to exit the show, in what will be a humiliating departure for last year’s winning pro dancer.\n\nThe pair earned just 11 points of out a possible 14 for their Kill Bill-themed Charleston, which Anneka visibly struggled with.\n\nThey eventually lost in a dance-off to ex-England goalkeeper David James and his partner Nadiya Bychkova.\n\n(Image: PA)\n\nWhile his journey to a second Glitterball victory may be over, Kevin will continue to be part of this season by taking part in group dances and pro performances.\n\nLast year’s winner and Kevin’s girlfriend Stacey Dooley praised his efforts with Anneka in a statement made on her social media.\n\nStacey said: \"Kev and Anneka got knocked out this weekend and I just want to say I am so proud of both of them and especially Kevin because I just think he is the most incredible teacher.\"\n\n(Image: BBC/Guy Levy)\n\nTalking about veteran TV star Anneka, Stacey added: \"I think she was lucky to be with him.\"\n\nShe continued: \"She did that beautiful waltz, its very easy to be proud of someone when you are winning and flying high and its all going brilliantly but its also very important to tell them they are wicked when they get knocked out..so yes..well done!\"\n\nDo you have a story to sell? Get in touch with us at webtv@trinitymirror.com or call us direct 0207 29 33033", "description": "Last year's winner misses out on another shot at the Glitterball trophy after becoming the second pairing to be eliminated from the show", "authors": ["Sofia Petkar", "Image", "Pa", "Bbc Guy Levy"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20525930.ece/ALTERNATES/s1200/0_Strictly-Come-Dancing-2019.jpg", "published_at": "2019-10-07"}