{"pub": "cbc", "url": "https://cbc.ca/life/food/finally-a-fuss-free-way-to-make-gefilte-fish-from-scratch-1.5297031", "downloaded_at": "2019-09-25 23:29:18.623722+00:00", "title": "CBC Life", "language": "en", "text": "(Photography by Ryan Szulc)\n\nGefilte fish, with its complicated cooking process and potent aroma, is nothing if not controversial — but if you’ve had it made well, you know why it remains a fixture of so many Jewish gatherings. And while many families now avoid the whole ordeal by opting for the pre-made variety, we think this from-scratch recipe from Amy Rosen’s new cookbook Kosher Style has the potential to change some minds. Prepared in an easy-to-slice loaf with fresh fish and no poaching required, it’s an approach so simple it may have you ditching the jarred stuff for good.\n\nGefilte Fish Loaf\n\nBy Amy Rosen\n\nI’m not on board with grinding and poaching whitefish for hours and chilling it in its collagen-heavy fish stock. That’s why jarred gefilte fish is such big business. However, this easy take on gefilte fish features fresh fish, a quick bake and slicing sans fish jelly. It’s a slightly sweet and salty tradition, minus the stinky house.\n\nIngredients\n\n2 large carrots\n\n2 onions\n\n2 lb boneless, skinless whitefish fillets such as carp, pollock or pike\n\n4 tbsp sugar\n\n1 tsp pepper\n\n2 tsp sea salt\n\n1 cup matzo meal\n\n3 eggs\n\n1 head leaf lettuce, for serving\n\nJarred beet horseradish, for serving\n\nCurly parsley, for garnish\n\nPreparation\n\nPreheat the oven to 350°F and grease a 9 × 5-inch loaf pan with vegetable oil.\n\nIn a food processor, finely grind the carrots and onions. Transfer the vegetables to a large bowl. Place the fish in the food processor and pulse until finely chopped. Add the fish to the vegetables, then add the sugar, pepper, salt, matzo meal and eggs. Mix well, then spoon into the prepared loaf pan, pressing down firmly with the back of a spatula and smoothing out the top.\n\nBake for 1 hour. Remove the loaf from the oven and run a knife around the edges to be sure it’s not sticking to the pan. Refrigerate for at least 4 hours, but it’s best to leave overnight.\n\nWhen ready to serve, remove the loaf from the pan. Slice and serve cold on a nice piece of leaf lettuce with a dollop of spicy horseradish and a sprig of parsley.\n\nYield: Makes 8-10 servings\n\nExcerpted from Kosher Style: Over 100 Jewish Recipes for the Modern Cook by Amy Rosen. Copyright © 2019 Amy Rosen. Published by Appetite by Random House®, a division of Penguin Random House Canada Limited. Reproduced by arrangement with the Publisher. All rights reserved.", "description": "Skip the jarred stuff and try Amy Rosen’s easy recipe this year.", "authors": ["Cbc Life"], "top_image": "https://i.cbc.ca/1.5297063.1569437277!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/gefilte-fish-headline-img.jpg", "published_at": "2019-09-25"}