{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/greece-hail-strategic-relationship-signing-defence-deal-191005175854999.html", "downloaded_at": "2019-10-05 22:55:01.640109+00:00", "title": "US, Greece hail strategic relationship after signing defence deal", "language": "en", "text": "Athens, Greece - The United States and Greece have signed a revised mutual defence cooperation agreement that analysts say will elevate Athens' strategic value and lead to US investments in Greek military facilities.\n\n\"This is a pivotal point for Greek-American relations,\" US Secretary of State Mike Pompeo said on Saturday after a signing ceremony in Greece's capital.\n\n\"The Greek-US relationship has literally never been stronger.\"\n\nFor the first time, Greece is consenting to an indefinite agreement that does not need to be renewed each year. In return, US armed forces are expected to expand the Sixth Fleet's base on the southern island of Crete and create drone bases and permanent helicopter training facilities in central Greece.\n\nMost importantly of all, perhaps, the US is to establish a new naval and air force base in the northeast Greek city of Alexandroupoli to supply NATO allies Bulgaria and Romania. This bypasses the current route through the Bosphorus, controlled by Turkey.\n\n\"Alexandroupoli is a strategic asset because of the port which is very close to the Balkans and if need be can support operations to the Balkans much more quickly than other ports,\" Efthymios Tsiliopoulos, an analyst for Greek defence news website Defence-point.gr, said.\n\nAlexandroupoli is also acquiring importance as an energy hub. Greece is building offshore storage facilities for natural gas, and will soon start building a gas pipeline from Alexandroupoli to Bulgaria. This will enable shipments of US Liquefied Natural Gas to supply the Balkans, upsetting a Russian monopoly.\n\nSouring US-Turkey ties\n\nBoth the military and energy aspects of the enhanced US-Greek relationship highlight the extent to which it is the result of the souring US-Turkey relationship.\n\nThis recently took a dramatic turn for the worse when Turkey sent state-owned drillships to explore for oil and gas in waters claimed by European Union member Cyprus.\n\n\"We've made clear that operations in international waters are governed by a set of rules,\" Pompeo said. \"We've told the Turks that illegal drilling is unacceptable.\"\n\nGreek Foreign Minister Nikos Dendias, meanwhile, called the agreement signed on Saturday a \"factor for stability in the region\".\n\n191003074430612\n\n\"As such it doesn't aim against anyone, but acts as a message to anyone in the region who thinks they can operate outside the rules of international law and the law of the sea,\" Dendias said.\n\nOil and gas discoveries in the Eastern Mediterranean began in earnest in 2009. Since then, Israel and Egypt have become energy-independent and natural gas exporters. Cyprus is expected to follow suit in the coming years, and Greece, Cyprus and Israel have begun to form a political and energy alliance in recent years.\n\nThis has angered Turkey, which wants Cyprus to agree on how to share its hydrocarbon wealth with the minority Turkish Cypriots before extraction begins.\n\nPompeo on Saturday made clear that the US has picked sides. \"Last March, I met with the leaders of Cyprus, Greece and Israel in Jerusalem,\" he said.\n\n\"We, free countries with free markets, want to achieve energy security together. We want to make sure that rules govern international exploration in the Mediterranean Sea's energy resources, and that no country can hold Europe hostage,\" Pompeo said.\n\nGreek-Turkish and US-Turkish tension in the region has come at a sensitive time for Greek armed forces. Greece's defence budget has been cut virtually in half during the country's eight-year financial crisis, and US investments are expected to help create better facilities the Greek armed forces will also use.\n\nAnalysts say they are also a backup plan for the basing of US forces in the Middle East. \"It means [the US] can withdraw assets from the [warring] areas themselves and keep them on a standby basis … they still need to be in area, in the region, so they can be easily deployable,\" Tsiliopoulos said.\n\nMeanwhile, Greece has called on for greater EU and NATO involvement in patrolling the naval straits between its eastern Aegean islands and Turkey. These straits have been one of the principal crossing points for refugees from Turkey onto EU soil.\n\nThe rate of refugee arrivals in Greece from Turkey has doubled in the past month, accompanied by Turkish threats to release a flood of refugees into Europe.", "description": "Secretary of State Mike Pompeo signs revised cooperation agreement, says Greek-US ties have 'never been stronger'.", "authors": ["John Psaropoulos"], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/5/eaf1daa36b004887b67a98747a4987a4_18.jpg", "published_at": "2019-10-05"}