{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7529243/NRL-WAG-Monisha-Lew-Fatt-leaves-little-imagination-racy-dress-Dally-M-awards.html", "downloaded_at": "2019-10-05 09:04:31.072791+00:00", "title": "NRL WAG Monisha Lew-Fatt leaves little to the imagination in racy dress at the Dally M awards", "language": "en", "text": "NRL WAG Monisha Lew-Fatt pushed fashion boundaries at the Dally M awards in Sydney on Wednesday night.\n\nThe brunette beauty left little to the imagination as she walked the red carpet with her partner Jack Wighton, of the Canberra Raiders.\n\nShe wore a pink and sheer mesh gown by Croatian designer Matija Vuica for Rugby League's night of nights.\n\nWhat was she pink-ing? NRL WAG Monisha Lew-Fatt left little to the imagination as she awkwardly adjust her racy fuschia gown on the red carpet at the Dally M awards in Sydney on Wednesday\n\nHer unique dress featured crinkled fabric wrapped around her body, that strategically covered her modesty.\n\nBefore posing for the cameras, the stunner was seen awkwardly adjusting the skirt of her frock to ensure she did not suffer a wardrobe malfunction.\n\nAfterwards Monisha was able showcase the dress and her statuesque physique for the cameras.\n\nAll eyes on her: Monisha's unique pink and sheer mesh gown by Croatian designer Matija Vuica featured crinkled fabric wrapped around her body and strategically covering her ample assets\n\nHer long and luscious raven locks were styled up in a high pony tail.\n\nFor makeup, the stunner opted for a smokey pink eye shadow, a bronzed flow with glossy lips.\n\nShe accessorised with perspex heels from Tony Bianco and jewellry from APM Monaco for a touch of sparkle.\n\nSuited up: The beauty in pink was soon joined by her Canberra Raiders star partner Jack Wighton who looked dapper in a black suit and tie\n\nTo complete her one-of-kind look, she accessorised with a pink feather purse - reminiscent of Paris Hilton's early noughties fashion - from Olga Berg.\n\nShe was soon joined by her Canberra Raiders star partner Jack Wighton, who looked dapper in a black suit and bow-tie.\n\nThe couple's appearance comes ahead of NRL grand final will air on Sunday October 6 and see the Sydney Roosters take on the Canberra Raiders at ANZ Stadium.", "description": "NRL WAG Monisha Lew-Fatt pushed fashion boundaries at the Dally M awards in Sydney on Wednesday night.", "authors": ["Alisha Buaya For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/02/14/19207466-0-image-a-66_1570024082980.jpg", "published_at": "2019-10-02"}