{"pub": "reuters", "url": "https://in.reuters.com/article/australia-cyber-india/australian-cyber-officials-warned-india-against-using-huawei-newspapers-idINKCN1VU2KN", "downloaded_at": "2019-09-10 02:22:17.895937+00:00", "title": "Australian cyber officials warned India against using Huawei: newspapers", "language": "en", "text": "FILE PHOTO: A Huawei company logo is pictured at the Shenzhen International Airport in Shenzhen, Guangdong province, China July 22, 2019. REUTERS/Aly Song/File Photo\n\nSYDNEY (Reuters) - Australian government officials advised India to ban Chinese technology maker Huawei Technologies Co Ltd from supplying parts for a rollout of a high-speed telecommunications network, Australian newspapers reported on Tuesday.\n\nOfficials from anti-cyberespionage body the Australian Signals Directorate (ASD) were asked about an Australian ban on using the Chinese technology giant to build 5G networks when a delegation visited New Delhi last week, The Australian Financial Review and The Australian reported.\n\n“Indian officials were keen to get an understanding of how the Turnbull government arrived at the decision to ban Huawei, and multiple discussions have been held over the matter,” the AFR said, referring to a move led former prime minister Malcolm Turnbull in 2018.\n\nThe delegation last week, led by Australian ambassador for cyber affairs Tobias Feakin, “explained in detail why high-risk vendors had been banned from Australia’s 5G network,” The Australian reported.\n\nIndia had also consulted the United States on its Huawei ban, the newspaper added, without providing any source.\n\nAustralia in 2018 became the first country to ban Huawei from supplying equipment for a 5G mobile network, citing national security risks, a move the Chinese company criticized as being “politically motivated”.\n\nA Reuters email to a Huawei media representative in Australia, listed on the company’s website, received a bounceback notification.\n\nThe ASD did not immediately respond to an email seeking comment.", "description": "Australian government officials advised India to ban Chinese technology maker Huawei Technologies Co Ltd from supplying parts for a rollout of a high-speed telecommunications network, Australian newspapers reported on Tuesday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190909&t=2&i=1428116177&w=1200&r=LYNXNPEF881ZX", "published_at": "2019-09-10"}