{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7572661/Matt-Lauer-seen-time-Brooke-Nevils-rape-claim-new-book.html", "downloaded_at": "2019-10-14 23:18:29.127517+00:00", "title": "Matt Lauer is seen for first time since Brooke Nevils' rape claim in new book", "language": "en", "text": "Matt Lauer was seen in public for the first time on Monday since Brooke Nevils claimed in Ronan Farrow's new book that the former TV host raped her at the 2014 Sochi Winter Olympics.\n\nThe disgraced anchor was spotted wearing dark shades under a white baseball cap as he was greeted by family members and his dog.\n\nPhotos showed Lauer petting the dog and surrounded by four young boys and his daughter, Romy.\n\nHis public appearance comes amid the rape claims made by Nevils in Farrow's book, Catch and Kill, to which Lauer responded with an open letter.\n\nHe painted Nevils as a bitter lover who had consensual relations with him and grew upset after he stopped speaking to her at work.\n\nMatt Lauer (pictured on Monday) was seen in public for the first time on Monday since Brooke Nevils claimed in Ronan Farrow's new book that the former TV host raped her at the 2014 Sochi Winter Olympics\n\nThe disgraced anchor was spotted wearing dark shades under a white baseball cap as he was greeted by family members and his dog\n\nPhotos showed Lauer (left and right) petting the dog surrounded by four young boys and his daughter, Romy (left)\n\n'I had an extramarital affair with Brooke Nevils in 2014. It began when she came to my hotel room very late one night in Sochi, Russia,' Lauer wrote.\n\n'We engaged in a variety of sexual acts. We performed oral sex on each other, we had vaginal sex, and we had anal sex. Each act was mutual and completely consensual,' he added.\n\n'The story Brooke tells is filled with false details intended only to create the impression this was an abusive encounter. Nothing could be further from the truth. There was absolutely nothing aggressive about that encounter. Brooke did not do or say anything to object.'\n\nHe continued: 'She certainly did not cry. She was a fully enthusiastic and willing partner.'\n\nLater in the letter, Lauer suggested that Nevils accused him because she was upset about their split.\n\n'I admit, I ended the affair poorly. I simply stopped communicating with her. Brooke continued to reach out,' wrote Lauer.\n\n'She admitted to NBC at the time she filed her complaint that she called me late at night while I was home with my family in an effort to rekindle the affair.'\n\nNevils responded to this letter in a comment to NBC News later in the day on Wednesday.\n\nHis public appearance comes amid the rape claims made by Nevils in Farrow's book, Catch and Kill, to which Lauer responded with an open letter. It has also been reported that Nevils (circled with Meredith Vieira) received a 'seven-figure settlement' from NBC after she came forward\n\nComing forward: 'There were eyewitnesses to what happened before and after that moment. She described this event consistently over the year,' said Farrow of her account (Nevils above with Vieira on a trip to Cape Cod)\n\n'There's the Matt Lauer that millions of Americans watched on TV every morning for two decades, and there is the Matt Lauer who this morning attempted to bully a former colleague into silence,' explained Nevils.\n\n'His open letter was a case study in victim blaming and concluded by threatening any other woman who might dare to speak out against him.'\n\nNevils chose to share her story with Farrow, who details her allegations in his new book Catch and Kill.\n\nIt was also revealed that Nevils received a large settlement from NBC after coming forward with her claim.\n\nFarrow shared why Nevils' claims ultimately led to Lauer's demise and how much money she walked away with in an interview with CBS This Morning on Monday.\n\n'Nevils' story has been found credible by NBC and by me and the fact-checkers working on this. She describes an evening that marches one the timeline given by others,' said Farrow of the night in Sochi when Nevils was allegedly raped by Lauer.\n\n'There were eyewitnesses to what happened before and after that moment. She described this event consistently over the years.'\n\nHe then added: 'And look, it's telling that NBC News paid her a seven-figure settlement to ensure that she can't talk about what the network knew about it.'\n\nIt is also now being revealed that it was Nevils' boss and Lauer's former co-host, Meredith Vieira, who encouraged the young woman to come forward.\n\nEmbattled NBC News president Noah Oppenheim has been dealing with he fallout in the wake of this revelations since last week.\n\nSupport system: It was her former boss Vieira (above in Rhode Island with Nevils) who encouraged her to come forward and share her allegations with NBC executives\n\nEmployee relations: Noah Oppenheim (center) met with top members of the NBC News team on Thursday to discuss the events of the previous 24 hours (Lauer on left and Farrow on right)\n\nHe addressed staff after the news broke in a meeting last week, explaining: 'I am sure you guys and folks on your teams have questions, you will have questions in the days ahead, and I want to literally beg you to please ask them.'\n\nHe went on to say: 'Please tell the folks you work with to ask them. Whether it’s this morning or by reaching out to me by phone or email, anytime day or night there is not a question that I’m afraid to answer. I only ask to opportunity to do so.'\n\nLater in the meeting, Oppenheim also explained the reason he and other executives kept quiet as more and more women came forward to accuse Lauer.\n\nIt was Nevils decision to go public with her story in Farrow's upcoming book, and as Oppenheim told staffers on Monday, she decided when she would break her silence,\n\nOppenheim also explained that there was an obligation on their end as well to protect the victim, which is why they were so quiet\n\n'Our first obligation when someone brings forward a complaint is to protect that person’s confidentiality. All of our communication to you guys and externally, frankly to anyone, the words were carefully chosen to characterize it exactly the same way that her attorney was characterizing it,' he explained to those in attendance and others who had dialed in tot eh meeting remotely.\n\n'That confidentially is not something that I am ever going to breach, not only for her sake.'\n\nHe then stated: 'The whole point of that is so she can tell her story whenever, however she chooses to and she is doing so now, I think that is appropriate.'", "description": "Matt Lauer was seen in public for the first time on Monday since Brooke Nevils claimed in Ronan Farrow's new book that the former TV host raped her at the 2014 Sochi Winter Olympics.", "authors": ["Valerie Edwards", "Chris Spargo For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/21/19709590-0-image-a-47_1571085403926.jpg", "published_at": "2019-10-14"}