{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7613061/Bachelor-star-Jessica-Brody-ditches-make-extensions-busty-tattoo-flashing-selfie.html", "downloaded_at": "2019-10-25 23:59:28.735164+00:00", "title": "Bachelor star Jessica Brody ditches make-up and extensions for busty tattoo-flashing selfie", "language": "en", "text": "She's the former Bachelor star who is never afraid to flash the flesh when it comes to social media snaps.\n\nAnd Jessica Brody didn't disappoint this week, as the 31-year-old confidently ditched her hair extensions, fake nails and make-up for a busty lingerie-clad selfie.\n\nThe heavily-inked beauty pouted in the mirror of her bedroom for the jaw-dropping shot, pushing up her ample assets in a very tight black bra with a metal ring in the centre.\n\n'No hair, no nails, no makeup, no shame' Jessica Brody (pictured) shared a very busty selfie with fans this week, as she celebrated her natural beauty\n\n'No hair, no nails, no makeup, no shame,' she wrote alongside the sultry photo, which was met with praise from her legion of followers.\n\n'I like the natural look!' one fan wrote, while another gushed: '...and you still look amazing.'\n\nJessica appeared on the most recent season of The Bachelor as an intruder, and was previously romantically linked to The Project's Tommy Little.\n\nRed hot! Jessica appeared on the most recent season of The Bachelor as an intruder, and was previously romantically linked to The Project's Tommy Little\n\n'I've dated both men and women before': The former Bachelor star publicly came out as bisexual earlier this month\n\nHer saucy post comes one month after she publicly came out as bisexual, during an Instagram Q&A with her fans.\n\nWhen asked if she'd ever date another woman, the stunner said: 'If I met someone that I liked then that's someone I like... I have no preference with gender.'\n\nShe continued: 'Whoever I like I like. I've dated both men and women before.'\n\nShe's the latest in a growing list of Bachelor stars to open up about their sexuality publicly in recent years.\n\nTrailblazers: Megan Marx was the first Bachelor star to come out as bisexual, with the blonde enjoying a highly publicised relationship with her former co-star Tiffany Scanlon\n\nKiss: Alex Nation and Brooke Blurton had a brief fling on Bachelor In Paradise this year\n\nMegan Marx was the first, with the Bachelor In Paradise star enjoying a highly publicised relationship with her former co-star Tiffany Scanlon before they split in 2017.\n\nAlex Nation also had a relationship with a woman after splitting from former Bachelor Richie Strahan, before enjoying a brief fling with Brooke Blurton on Bachelor In Paradise.\n\nDuring the last season of The Bachelor, Vakoo Kauapirura and Rachael Arahill sparked up a romance after being rejected by Matt Agnew - with the pair later describing each other as 'soul mates'.\n\nBut last month, they were pictured arguing in images obtained by Daily Mail Australia - sparking rumours their short-lived fling may have come to an end.", "description": "Former Bachelor star Jessica Brody ditched her hair extensions, fake nails and make-up for a busty lingerie-clad selfie this week.", "authors": ["Nicole Douglas For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/10/20173596-0-image-a-10_1571996359439.jpg", "published_at": "2019-10-25"}