{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/16/nats-fan-asks-judge-postpone-case-so-he-can-stay-up-late-watching-baseball-with-son", "downloaded_at": "2019-10-16 20:47:46.794987+00:00", "title": "Nats fan asks judge to postpone case so he can ‘stay up late watching baseball’ with son", "language": "en", "text": "Jay Friedman, a lawyer in Alexandria, is three years into a battle with the Trump administration over a regulatory rollback over organic food production. The Obama administration set new guidelines for how much space and access to the outdoors certified organic poultry must be allotted. The Trump administration almost immediately repealed the regulations.\n\nAD\n\nNow, Friedman, representing organic food producers, and the Trump Justice Department are locked in a court battle, a motion for which was supposed to be due this week. But that would interfere with Friedman’s ability to watch the Nationals with his 9-year-old son Jed, a Nationals superfan.\n\nAD\n\nHe asked the court to postpone the deadline for the motion.\n\n“Washington D.C.'s professional baseball team, the Nationals (‘Nats’), began this baseball season by losing 31 of its first 50 games,” began Friedman’s formal request for a continuance. “Since that time, due in part to the unflagging support of a certain nine-year old boy closely associated with undersigned counsel, the wheels of justice have turned and the team has rightfully advanced deep in the baseball playoffs.\n\nAD\n\n“The nine-year old and counsel wish to continue to stay up late watching baseball and to attend tomorrow’s game [Wednesday’s Game 5], if it is necessary.”\n\nA lawyer asked a judge for a brief extension due to the @Nationals' playoff run, citing \"unflagging support of a certain nine-year old boy\" who wants to watch the games.\n\n\n\n\"With the consent of the parents and baseball fans at the Department of Justice, this request is unopposed.\" pic.twitter.com/ckfC7SpvlI — Zoe Tillman (@ZoeTillman) October 15, 2019\n\nWell, the Nationals swept the St. Louis Cardinals in four games on Tuesday night. Senior U.S. District Court Judge Rosemary M. Collyer granted the request anyway.\n\n“I’ve never heard of a 9-year-old counsel, but I hope the judge agrees,” Jed told his dad on Tuesday, when shown the motion.\n\nAD\n\n“This is kind of amazing and it’s a great example of what living in D.C. is like and why our government is so demonstrably better than others,” Friedman said in a phone interview Wednesday.\n\nHe and Jed started really paying attention to the Nationals over the summer when the team turned around its sorry start and became a wild card contender. Jed is a major fan of starting pitching — his favorite players and Max Scherzer and Stephen Strasburg, his father said — and delights in the tenacity and precision of Washington’s staff.\n\nAD\n\n“It’s really exciting because that’s not something people focus on in baseball that much anymore, and he’s really excited to be associated with a team that he thinks plays the right way,” Friedman said.\n\nBefore father and son can watch the game, Jed has to finish his supper and practice piano. He’s working on mastering Beethoven’s “Fur Elise.” He practices between innings, too.\n\nAD\n\nHe’s also a competitive chess player; sometimes he and his dad play a game during the broadcasts, Jed trying to replicate the steely demeanor of his favorite pitchers who scheme entire at-bats in their minds.\n\nIt’s not unheard of for the legal system to mold its timing around the sports world. A Georgia lawyer in 2017 asked a judge for an emergency continuance so he could see the Bulldogs play in the Rose Bowl. An Alabama judge in April told lawyers to quit pestering him with motions until after the NCAA tournament, when Auburn made a run to the Final Four.\n\nAD\n\nMost judges and attorneys get it, Friedman said. Lawyers have lives, too.\n\n“Lawyers on TV fight over everything and act like it’s World War III, but my counterpart at the Department of Justice is a perfectly nice and respectful person,” Friedman said. “I told her [about the motion] and she’s fine with it. She sent me a note yesterday afternoon and she said, ‘Everybody here loves it. We’re showing it around the office.’”\n\nAD\n\nShe made sure Judge Collyer knew as much, too. With her permission, Friedman included at the end of his motion, “With the consent of the parents and baseball fans at the Department of Justice, this request is unopposed.”\n\nRead more on the Nationals:\n\nAD", "description": "Jay Friedman and his 9-year-old son Jed have developed a winning routine that involves Beethoven, chess and not having to go to court in the morning.", "authors": ["Jacob Bogage", "National Sports Writer"], "top_image": "https://www.washingtonpost.com/resizer/fb4E2uHia9IOk41Zae_fia2GuaM=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JFW6U2WDS5CQFA2EJHTKS43IUA", "published_at": "2019-10-16"}