{"pub": "dailymail", "url": "https://dailymail.co.uk/money/news/article-7566321/Fergies-West-End-company-2-5m-loan-drama.html", "downloaded_at": "2019-10-13 18:59:48.495315+00:00", "title": "Fergie's West End company in £2.5m loan drama", "language": "en", "text": "In the red: Sarah Ferguson’s firm backed hits including 42nd Street but posted losses of £2.7m\n\nA theatre production company which counts the Duchess of York as a director narrowly avoided going under last month after a £2.5million loan was called in early.\n\nGate Ventures, which has backed West End shows such as 42nd Street and Sunset Boulevard, is scrambling to find new funds after a Chinese investor who promised £7.5million failed to deliver.\n\nAmid Gate's financial troubles, an undisclosed party called in a £2.5million loan early in August, which risked pushing the company under.\n\nHowever, at a hearing at the end of last month, the High Court in London threw out the lender's application to put the company into administration.\n\nThe ruling allows the firm to resume its search for new investors. Gate later said it had a 'potential agreement' from an unnamed backer.\n\nThe firm, chaired by former BBC chairman Lord Grade, posted a £2.7million loss for the year ended June 30, 2019.\n\nSarah Ferguson joined Gate in 2017 as an executive director 'to assist with the branding and marketing of its products and productions'.\n\nHer tea company, Ginger & Moss, had an online joint venture with Gate, which was founded by songwriter Geoff Morrow, who has penned hits for stars including Elvis Presley.\n\nGate's shares, listed in Copenhagen, have dived 99 per cent since floating in 2016.", "description": "A theatre production company which counts the Duchess of York as a director narrowly avoided going under last month after a £2.5million loan was called in early.", "authors": ["Jamie Nimmo For The Mail On Sunday", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/18/19631664-0-image-a-6_1570900352844.jpg", "published_at": "2019-10-12"}