{"pub": "cbc", "url": "https://cbc.ca/sports/hockey/nhl/colorado-avalanche-calgary-flames-recap-1.5308302", "downloaded_at": "2019-10-04 07:40:27.847177+00:00", "title": "CBC Sports", "language": "en", "text": "Mikko Rantanen had two goals less than a week after agreeing to a contract with Colorado, Joonas Donskoi scored twice in his debut and the Avalanche beat the Calgary Flames 5-3 on Thursday night.\n\nRantanen was a restricted free agent heading into the summer and he remained in his native Finland while contract negations dragged on through training camp. The parties finally agreed to a six-year, $55.5 million US deal on Saturday night and Rantanen joined the team on Sunday, four days before the start of the season.\n\nHe scored a go-ahead goal in the first period and added the eventual decisive score on the power play late in the second period, minutes after J.T. Compher gave Colorado a 3-2 lead.\n\nMark Giordano scored 16 seconds after Rantanen's second goal.\n\nJohnny Gaudreau and Sean Monahan each had a goal and an assist for Calgary. David Rittich had 26 saves for the Flames, who started the season the same way last season ended — with a loss.\n\nThe Avalanche defeated Calgary in the first round of last season's playoffs, beating the Western Conference's top seed in five games.\n\nDonskoi got Colorado off to a quick start with a power-play goal 5:59 in, and the teams traded goals the rest of the period.\n\nGaudreau's goal 1:50 into the second period tied it and Donskoi scored into an empty net with 1:09 left in the third.\n\nColorado goalie Philipp Grubauer had 26 saves.", "description": "Mikko Rantanen had two goals less than a week after agreeing to a contract with Colorado, Joonas Donskoi scored twice in his debut and the Avalanche beat the Calgary Flames 5-3 on Thursday night.", "authors": [], "top_image": "https://i.cbc.ca/1.5308552.1570159395!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/mikko-rantanen.jpg", "published_at": "2019-10-04"}