{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-stocks/jd-sports-leads-ftse-100-higher-rate-cut-hopes-support-idUKKCN1VV0N9", "downloaded_at": "2019-09-10 23:31:40.932939+00:00", "title": "JD Sports leads FTSE 100 higher, rate cut hopes support", "language": "en", "text": "(Reuters) - London’s FTSE 100 overcame early losses to close higher on Tuesday as hopes of imminent interest rate cuts from major central banks buoyed sentiment, while JD Sports jumped to an all-time high on upbeat results.\n\nFILE PHOTO: Pound Sterling notes and change are seen inside a cash resgister in a coffee shop in Manchester, Britain, Septem,ber 21, 2018. REUTERS/Phil Noble\n\nThe blue-chip index .FTSE added 0.4%, with JD Sports (JD.L) gaining 8.8% after its gym clothing and premium-branded fashion helped it post higher profit and offset UK retail sector gloom.\n\nThe FTSE 250 .FTMC rose 0.3%, helped in part by a nearly 13% surge in Cairn Energy (CNE.L) as strong half-year results led to a production target upgrade.\n\nIn a sign of ongoing rotation, investors dumped defensive shares and bought stocks of sectors that have underperformed this year, helping an index of banks .FTNMX8350 climb 2.4% for its best day since January.\n\nShares of Lloyds (LLOY.L) and Barclays (BARC.L) rose 4.3% and 4.9%, respectively, while healthcare stocks GlaxoSmithKline (GSK.L) and AstraZeneca (AZN.L) shed more than 2% each.\n\nUK markets also looked past disappointing data from China overnight that had added to fears of a global recession.\n\nSpeculation that the European Central Bank will cut interest rates this week and that the U.S. Federal Reserve will follow suit later this month in the face of slowing economic growth helped stoke some risk appetite.\n\n“Seeing as the ECB are tipped to go down the path of an interest rate cut, stocks are likely to be buoyant between now and the announcement,” CMC Markets analyst David Madden said.\n\nOil heavyweights Shell (RDSa.L) and BP (BP.L) were the biggest boosts to the main index as they tracked a rise in crude prices on hopes that OPEC and other oil-producing countries may agree to extend output cuts to prop up prices.\n\nMid-cap builder Galliford Try (GFRD.L) advanced 8% after it restarted preliminary talks to sell its residential housing businesses to Bovis Homes (BVS.L).\n\nBovis, whose shares dropped 3.5%, nudged up its proposed offer and included a cash element, which Markets.com analyst Neil Wilson said would be “a welcome injection for the newly reorganised Galliford construction division.”\n\nAmong small-caps, online gambling firm 888 Holdings (888.L) slumped 8.6%, its worst day in almost a year, after results showed a hit to earnings from a rise in online gaming taxes and administrative expenses due to Brexit preparations.", "description": "London's FTSE 100 overcame early losses to close higher on Tuesday as hopes of imminent interest rate cuts from major central banks buoyed sentiment, while JD Sports jumped to an all-time high on upbeat results.", "authors": ["Muvija M", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190910&t=2&i=1428231087&w=1200&r=LYNXNPEF890GI", "published_at": "2019-09-10"}