{"pub": "reuters", "url": "https://reuters.com/article/us-usa-economy/lower-mortgage-rates-stimulate-lethargic-u-s-housing-market-idUSKBN1WA1TS", "downloaded_at": "2019-09-25 23:32:20.718481+00:00", "title": "Lower mortgage rates stimulate lethargic U.S. housing market", "language": "en", "text": "WASHINGTON (Reuters) - Sales of new U.S. single-family homes rebounded more than expected in August, the latest sign that the sluggish housing market was starting to get a lift from lower mortgage rates.\n\nThe report from the Commerce Department on Wednesday also suggested the economy continued to grow moderately. It added to solid reports on August retail sales, industrial production, housing starts and home resales in allaying financial market fears of a recession.\n\nA year-long trade war between the United States and China has heightened risks to the longest economic expansion in history, now in its 11th year, prompting the Federal Reserve to cut interest rates for the second time last week. The U.S. central bank cut rates in July for the first time since 2008.\n\n“This positive data caps off a month of redemption for the housing market,” said John Pataky, executive vice president at TIAA Bank in Jacksonville, Florida. “If American consumers remain in good spirits, there is no reason this positive momentum can’t continue, so long as prices remain in check and housing supply does not get critically low.”\n\nThe Commerce Department said new home sales increased 7.1% to a seasonally adjusted annual rate of 713,000 units last month, boosted by a surge in activity in the South and West. July’s sales pace was revised up to 666,000 units from the previously reported 635,000 units.\n\nIt was the second time in three months that new homes sales jumped above 700,000. Economists polled by Reuters had forecast new home sales, which account for about 11.5% of housing market sales, increasing 3.5% to a pace of 660,000 units in August.\n\nNew home sales are drawn from permits and tend to be volatile on a month-to-month basis. Sales vaulted 18.0% from a year ago. New homes sales are benefiting from a shortage of previously owned homes. The median new house price rose 2.2% to $328,400 in August from a year ago.\n\nThe housing market, the sector most sensitive to interest rates, has perked up in recent months in response to a sharp drop in mortgage rates. Reports last week showed housing starts and building permits soared to a more than 12-year high in August, and home resales rose to the highest level in 17 months.\n\nHomebuilders confidence increased in September. The 30-year fixed mortgage rate has dropped about 120 basis points from last year’s highs to an average of 3.73%, according to data from mortgage finance agency Freddie Mac.\n\nWhile other data from the Mortgage Bankers Association on Wednesday showed applications for loans to purchase a home fell last week, they were up strongly from a year ago.\n\nThe dollar rose against a baskets of currencies as investors were drawn to its safe-haven appeal after House of Representatives Speaker Nancy Pelosi on Tuesday announced that the Democrat-led House was moving forward with an official impeachment inquiry on President Donald Trump.\n\nStocks on Wall Street were trading higher after Trump said a trade deal with China could happen sooner than expected. U.S. Treasury prices fell.\n\nREGAINING FOOTING\n\nThe recent improvement in housing data has raised optimism that the housing market could be regaining its footing after hitting a soft patch last year. Residential investment has contracted for six straight quarters, the longest such stretch since the 2007-2009 recession.\n\nThe Atlanta Fed is forecasting gross domestic product rising at a 1.9% annualized rate in the third quarter. The economy grew at a 2.0% pace in the second quarter, slowing from the January-March quarter’s brisk 3.1% rate.\n\nNew home sales in the South, which accounts for the bulk of transactions, advanced 6.0% in August. Sales in the West accelerated 16.5%. But sales tumbled 5.9% in the Northeast and fell 3.0% in the Midwest. Sales last month were concentrated in the $200-749,000 price range. Homes priced below $200,000, the most sought after, accounted for only 10% of sales.\n\nBuilders have complained that land and labor shortages were making it difficult to construct more affordable houses.\n\nFILE PHOTO: A new apartment building housing construction site is seen in Los Angeles, California, U.S. July 30, 2018. REUTERS/Lucy Nicholson\n\n“Builders remain focused on the upper end of the market,” said George Ratiu, senior economist at online listings website realtor.com. “Costs of construction remain an ongoing issue. The inventory of affordable new homes is likely to remain constrained this year.”\n\nThere were 326,000 new homes on the market last month, the fewest since September 2018 and down 1.2% from July. At August’s sales pace it would take 5.5 months to clear the supply of houses on the market, down from 5.9 months in July.\n\nAbout 63% of the houses sold last month were either under construction or yet to be built.", "description": "Sales of new U.S. single-family homes rebounded more than expected in August, the latest sign that the sluggish housing market was starting to get a lift from lower mortgage rates.", "authors": ["Lucia Mutikani", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190925&t=2&i=1433777741&w=1200&r=LYNXMPEF8O1A8", "published_at": "2019-09-25"}