{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/a-report-documents-the-systematic-abuse-inflicted-on-migrant-children/2019/09/15/29f6e388-d0f3-11e9-8c1c-7c8ee785b855_story.html", "downloaded_at": "2019-09-16 02:15:44.173678+00:00", "title": "A report documents the systematic abuse inflicted on migrant children", "language": "en", "text": "Near the U.S.-Mexico border, thousands of migrants are facing a challenging environment in their goal to enter the United States. (John Moore/Getty Images)\n\nTHE TRUMP ADMINISTRATION’S “zero tolerance” policy, which triggered the automatic separation of thousands of toddlers, tweens and teenagers from their families last year, was an act of systematic child abuse orchestrated by a White House bent on prosecuting a war on undocumented migrants. The misery caused by that callous policy was glimpsed at the time — through photographs of sobbing children and accounts from devastated parents — by Americans whose revulsion prompted Mr. Trump to reverse course. Only now has the children’s suffering been methodically documented by a government agency.\n\nA report on the emotional and psychological toll of those family separations, by the Office of Inspector General at the Department of Health and Human Services, makes for harrowing reading. It is a poignant reminder of the human damage intentionally caused by a callous government. Program directors and clinicians at 45 shelters overseen by the department’s Office of Refugee Resettlement (ORR) were interviewed for the report, and their accounts pull no punches.\n\n“Every single separated kid has been terrified,” said one official who dealt extensively with the children. Others described children who wept inconsolably, believing their parents had abandoned them. In one instance, a boy thought his father, detained at the border by the authorities, was dead. In other cases, kids were seized with psychosomatic effects of the trauma they had undergone: “You get a lot of ‘my chest hurts’ even though everything is fine [medically],” said one official. “Children describe symptoms — ‘every heartbeat hurts,’ ‘I can’t feel my heart’ — of emotional pain.”\n\nSuch was the collateral damage on the hearts of children inflicted by a heartless administration.\n\nThe inspector general’s report details shortcomings on the part of the ORR shelters, which, scrambling to accommodate thousands of unaccompanied minors suddenly thrust upon them, hired staffers without first completing background checks and case managers ill-prepared to care for mental health. Clinicians assigned to counsel children were overwhelmed, facing caseloads double those set by agency rules. Low pay, demanding schedules and a scarcity of qualified candidates available to facilities — some in remote locations — impeded the shelters’ capacity to handle what amounted to a humanitarian crisis.\n\nBut blaming the bureaucrats is senseless when the policy itself was at fault. It was then-Attorney General Jeff Sessions who announced “zero tolerance” at the direction of the White House — a strategy of deliberate cruelty explicitly designed to deter Central American asylum seekers from crossing the border. Brutality was not an accidental feature of the administration’s approach; it was the whole point.\n\nMedical groups have warned that children separated from their families are likely to suffer long-term, possibly lifelong, deleterious effects. Long after the Trump administration leaves office, its malice will linger in the lives of those it damaged.", "description": "The collateral damage suffered by these children was inflicted by thanks to a heartless administration.", "authors": ["Editorial Board", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/87Wcm7Tlz5cxY585s5ZM15MWbk0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5K6CXSWWOMI6TFQQ7NLMKURODQ.jpg", "published_at": "2019-09-15"}