{"pub": "yahoo", "url": "https://news.yahoo.com/mick-mulvaney-volunteers-tribute-loses-014120114.html", "downloaded_at": "2019-10-18 03:21:55.686159+00:00", "title": "Mick Mulvaney Has Conservatives Asking: WTF Are You Doing?", "language": "en", "text": "Over the course of about 40 minutes on Thursday, President Donald Trump’s acting chief of staff, Mick Mulvaney, made two startling admissions: that U.S. military aid to Ukrainian had been contingent on an investigation into a debunked 2016 election-interference conspiracy theory and that politics was influencing his boss’ foreign policy.\n\nAnd if all but admitting the president engaged in quid pro quo wasn’t enough, he then proceeded to act like it was the most natural thing in the world… until a few hours later, when he pretended it never happened at all.\n\nIt was, in short, a remarkable afternoon for the acting chief of staff, whose standing in the White House seems a bit more precarious by the day as he himself gets drawn further into impeachment proceedings threatening the president.\n\nThose who know the man say they’re not worried about him in the slightest.\n\n“When you're in the middle of it, trying to make decisions — I think Mick's doing a good job of trying to serve the country and serve the president,” said Rep. Mark Meadows (R-N.C.), an ally of Trump’s, a day before Mulvaney’s press conference. “I do know there's a lot of things that get said that aren't backed up with facts. I'm waiting for the facts to come out before I jump to any conclusions.”\n\nBut others are not so kind when assessing the role Mulvaney is now playing, arguing that he finds himself in over his head as he tries to guide the White House through turbulent political waters.\n\n“He is a smart guy, a very smart guy, but he’s only about 70 percent as smart as he thinks he is,” said Republican strategist Terry Sullivan, who has known Mulvaney since the acting chief of staff’s days in the South Carolina State Senate. “There’s only one person in that entire White House that has a bigger ego than he does, but it’s not by much.”\n\nThe trickiness of Mulvaney’s task—and the difficulty he is having handling it—was on full display Thursday. It was about 20 minutes into the briefing when he was asked whether he was directly involved in withholding funds from Ukraine. After riffing about the president’s dislike of foreign aid, belief the U.S. shoulders too much of it in proportion to others and that the country is corrupt anyway, Mulvaney touched on the 2016 race.\n\n“Did he also mention to me in the past that the corruption related to the DNC server? Absolutely,” he said. “No question about that. But that’s it. That’s why we held up the money.”\n\nAfter pillioring former State Department adviser Michael McKinley who reportedly testified he left the administration because “disturbed by the implication that foreign governments were being approached to procure negative information on political opponents,” Mulvaney went in for the kill.\n\n“I have news for everybody. Get over it,” he advised. “There’s going to be political influence in foreign policy...Elections have consequences and foreign policy is going to change from the Obama administration to the Trump administration.”\n\nAs wild—damning, even—as the admissions may have seemed, Mulvaney actually had the intention of bringing the temperature down, with hopes of clearing the air after his name had cropped up in press reports implicating him in the Ukraine-related scandal. He wanted to “take allegations head on, and show he wasn’t going into hiding,” one White House official said.\n\n“Might as well own it,” the official added.\n\nAnd own it he did—but only for part of the day.\n\nHours after the briefing, Mulvaney tried to backtrack, saying in a statement released by the White House press office: “Let me be clear: there was absolutely no quid pro quo between Ukrainian military aid and any investigation into the 2016 election.” He also claimed that “once again, the media has decided to misconstrue my comments to advance a biased and political witch hunt against President Trump.”\n\nBy that point, however, real damage had been done. Mulvaney’s earlier round of comments had left some close White House allies utterly perplexed and questioning his fitness for the role.\n\n“What is Mulvaney even talking about?” Sean Hannity, a Fox News host and prominent outside adviser to Trump, said on his radio show on Thursday. “I just think he's dumb, I really do. I don't even think he knows what he's talking about. That's my take on it.”", "description": "Photo Illustration by Elizabeth Brockway/The Daily BeastOver the course of about 40 minutes on Thursday, President Donald Trump’s acting chief of staff, Mick Mulvaney, made two startling admissions: that U.S. military aid to Ukrainian had been contingent on an investigation into a debunked 2016 election-interference", "authors": ["Jackie Kucinich", "Asawin Suebsaeng", "Sam Brodey"], "top_image": "https://s.yimg.com/uu/api/res/1.2/pGXsc3vS4efET17EObl0DA--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/c77d7a26dd0d412fc10f98eb2aee7f41", "published_at": "2019-10-18"}