{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/sep/10/theresa-may-resignation-honours-list", "downloaded_at": "2019-09-10 23:33:00.872156+00:00", "title": "Theresa May’s resignation honours list is another sign of our rotting political system | Gaby Hinsliff", "language": "en", "text": "When Theresa May first began to recruit staff for No 10, she made one thing very clear. Anyone joining government in the new, ostentatiously workmanlike, post-Cameron era shouldn’t be doing so hoping to get a gong out of it: they would, the new prime minister is said to have warned, be lucky to get “so much as a chocolate biscuit” at the end. The sentiment encapsulated everything that was meant to have changed since the old Etonian set cleared their desks – so much so that she eventually wheeled it out in public. At an awards dinner she joked that David Cameron’s former spin doctor, Craig Oliver, had confessed to retching into a bin when he heard the referendum result; when he became Sir Craig, everyone else knew the feeling.\n\nFor many, the most sickening aspect of May’s own resignation honours list will be the sight of a woman praised for her work on domestic violence giving a knighthood to a cricketer convicted of it. But the political honours she dished out are, in their own way, just as capable of undermining any remaining legacy. Worse still, they fuel the corrosive belief that all politicians are the same; that even those who promise to be different eventually revert to type. Who imagines Boris Johnson will be any more immune to the temptation of abusing the honours system, given recent threats to stuff the Lords with pro-Brexit peers?\n\nIt was David Cameron who cranked up the patronage machine again, bumping several trusted acolytes up to the Lords and sprinkling MBEs and CBEs around with abandon\n\nFor some, it will be the lead Brexit negotiator Olly Robbins’ knighthood – announced just as it emerges that he is leaving government for Goldman Sachs – that sticks in the craw. But Robbins is arguably one of the more deserving recipients on the list, insofar as anyone can ever be said to deserve a celebratory trip to the palace or the right to sit in unelected, lifelong judgment from the House of Lords. He is a distinguished civil servant who did his best to carry out the impossible mandate imposed on him, under a blizzard of vicious briefing by Brexiters who knew he could not publicly answer back.\n\nYou could even make a case for the former Downing Street chief of staff Gavin Barwell going to the Lords, on the grounds that few know more about the last desperate stages of the Brexit negotiations from the inside. He has both the desire for consensus on which the upper house thrives, and insights into the behaviour of cabinet ministers which should now be shared for the public good.\n\nBut there can be precious little excuse for doling out a CBE to his predecessor, Nick Timothy, a man failing upwards in the most spectacular way possible: forced to resign after masterminding an election strategy and a manifesto that cost his government its majority in 2017, he spent the next two years pouring scorn on successors’ efforts via a Daily Telegraph column. It’s also hard to discern what her spin doctor Robbie Gibb did to deserve his knighthood, either, beyond stick with it through the most miserable of times. Does that qualify as serving his country with unprecedented distinction – the accepted criterion for honours – or merely serving his prime minister? The two have always been wrongly conflated in honours lists, but rarely so excruciatingly as in the last few years.\n\nTony Blair, presumably sensing how it would go down following the so-called cash-for-peerages scandal, which questioned whether some Labour party donors were wearing ermine for all the wrong reasons, didn’t have a resignation honours list. Gordon Brown went for a muted dissolution honours list but it was Cameron who cranked up the patronage machine again, bumping several trusted acolytes up to the Lords and sprinkling MBEs and CBEs around with abandon.\n\nJohnson’s plan for ‘Brexit heroes’ in the Lords will reverberate for years to come | Gaby Hinsliff Read more\n\nCameron did so having waved aside recommendations to reform the honours system – and calls for MPs to have the power of veto over it. Had the Commons been given the chance to run an eye over May’s list, it is hard to tell who would have objected loudest: opposition MPs, or Tories who blame Timothy for costing them a majority, Barwell for holding out against a hard Brexit and Robbins for failing to deliver the promised unicorns. When there is this little agreement on what constitutes public service, or even on which voters’ interests should rightly be served, then the entire idea of honours becomes nonsense.\n\nOutrage is priced into the system now – the backlash against honorary baubles so routine that Westminster is virtually numb to it. But taken together with a wider collapse of confidence in the parliamentary and democratic process, this time the rot goes even deeper. May has diminished herself with an honours list that goes against so much of what she always said she stood for. But she has also diminished the reputation of a political system that has dangerously little credibility left to lose.\n\n• Gaby Hinsliff is a Guardian columnist", "description": "Outrage at baubles has become routine, but the former prime minister’s list is sickening, says Guardian columnist Gaby Hinsliff", "authors": [], "top_image": "https://i.guim.co.uk/img/media/18073ecfb32f5e31ec31fe505d107463599907a6/365_44_4650_2790/master/4650.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=a5c25b94328356ef03c566b42bf054ff", "published_at": "2019-09-10"}