{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/22/sun-advance-to-finals-aces-avoid-elimination", "downloaded_at": "2019-09-23 01:33:54.861397+00:00", "title": "Sun advance to finals; Aces avoid elimination", "language": "en", "text": "LONG BEACH, Calif. (AP) - Jasmine Thomas had 29 points and Courtney Williams added 17 points and 13 rebounds to lead Connecticut to a 78-56 win in Game 3 of the WNBA semifinals and give the Sun a sweep of the series Sunday.\n\nConnecticut advances to the WNBA Finals for the first time since 2005, where it will play either Washington or Las Vegas. The Mystics have a 2-1 series lead over the Aces.\n\nNneka Ogwumike had 17 points to lead the Sparks. Candace Parker was held to just four points. She played just 11 minutes in the game. She sat out the second quarter and took one shot in the third quarter before going to the bench with 5:54 left. She didn’t return to the game.\n\nThomas scored 14 of her 29 points in the third quarter on 6-for-7 shooting to lead the Sun to a 63-44 lead heading into the final quarter. Thomas made big shot after big shot for the Sun. Connecticut led 40-32 at halftime. Thomas had a team-best 11 points in the first half on 3 of 4 shots - all 3-pointers. She took the Sun’s first shot of the third quarter, a 3-pointer, and made it.\n\nWilliams scored the first seven points for the Sun. The Sparks starters combined for just seven points in the first quarter and were a combined 3-for-15 from the field.\n\nThe Sun shot 43.8 percent in the first half while Los Angeles was just 34.9 percent from the field. The Sparks made just 1 of 13 3-pointers in the first half.\n\nThe game was played at Long Beach State because the Sparks’ normal home Staples Center wasn’t available.\n\nACES 92, MYSTICS 75\n\nLAS VEGAS (AP) - Liz Cambage scored 28 points to lead the Aces to a victory over the Mystics in Game 3 of the WNBA semifinals.\n\nThe fourth-seeded Aces staved off elimination after losing the first two games of the series in Washington D.C. The Mystics had their eight-game winning streak snapped, as they hadn’t lost a game since dropping an 85-78 decision in Chicago on Aug. 23.\n\nA’Ja Wilson added 21 points and eight rebounds, while Kayla McBride had 18 points.\n\nLeague MVP Elena Delle Donne led the Mystics with 22 points. Kristi Toliver added 14 points, while Aerial Powers chipped in 13.\n\nAfter falling behind 33-31 midway through the second quarter, the Aces used a 12-0 run in a four-minute span to open up a 10-point lead and never looked back.\n\nThe Aces carried the momentum into the second half, opening the third quarter on a 13-6 run.\n\nThe Mystics, who set a franchise high with 103 points in Game 2 and had scored at least 90 points in eight of their last 10 games, fell to 0-6 when scoring less than 79 points this season. Washington which is 26-0 when scoring 85 or more points this season, finished the game hitting just 38.6 percent (27 of 70) from the floor.\n\nThe Aces, who had lost seven of nine prior to their series-saving win, finished 35 of 72 (48.6 percent) from the floor, including 6 of 14 from 3-point range.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Jasmine Thomas had 29 points and Courtney Williams added 17 points and 13 rebounds to lead Connecticut to a 78-56 win in Game 3 of the WNBA semifinals and give the Sun a sweep of the series Sunday.", "authors": ["The Washington Times Http"], "top_image": "", "published_at": "2019-09-22"}