{"pub": "cnn", "url": "https://us.cnn.com/2018/12/20/opinions/most-popular-2018-opinions/index.html", "downloaded_at": "2019-09-22 07:07:39.817799+00:00", "title": "Most popular op-eds of 2018: A year of drama and disaster", "language": "en", "text": "Want to keep up with the best commentary in 2019? Sign up for our weekly newsletter, Provoke/Persuade.\n\n(CNN) In a year dominated by the Trump presidency and the run-up to the midterm elections, readers came to CNN Opinion looking for insight into the ongoing battles raging in Washington and across America. But politicians and policy divides weren't the only headline makers. Stories of gun violence, celebrity deaths, a royal wedding and a series of horrific natural disasters attracted your attention, too.\n\nHere are excerpts from a selection of some of the most popular opinion pieces of 2018.\n\nJulian Zelizer: Obama's stern warning for Trump\n\nJanuary 13\n\nTo say that Donald Trump is not acting presidential is not to romanticize what we have seen from previous inhabitants of the office. But it is to hold him accountable for going far beyond the proper limits on presidential behavior.\n\nThe biggest danger is that by tolerating Trump's behavior in office, the public will make what he is doing and saying part of our conception of what it means to be presidential.\n\nIt is vital that members of both parties admit what they see when these moments happen and avoid normalizing these kinds of reckless departures from presidential history. For if the political class, and the public, starts to brush these moments off as \"Trump being Trump\" or \"nothing worse than what we have seen\" we will lower the bar so far it will be impossible to ever repair the presidency.\n\nLucia Brawley: Let's be honest about Aziz Ansari\n\nLucia Brawley\n\nJanuary 17\n\nAs a society, we must take this incident -- appearing in the public consciousness during our #MeToo moment -- as an opportunity to have some painful, nuanced conversations.\n\nFor example: Sexual assault and rape are never the victim's fault. But we cannot indiscriminately start destroying careers over consensual sexual activity, which based on her account is what this case appears to be.\n\nWhen we do that, we trivialize the brave victims who are coming forward about actual sex crimes.\n\nRead more here\n\nSimone Biles: I went from foster care to the Olympics\n\nSimone Biles\n\nFebruary 5\n\nAlthough I was young when my foster care ordeal began, I remember how it felt to be passed off and overlooked. Like nobody knew me or wanted to know me. Like my talents didn't count, and my voice didn't matter.\n\nFinding a family made me feel like I mattered. Finding a passion, something I loved and was really good at, made me feel like I mattered. Representing my country and being part of such an amazing Olympic team matters, as does being a role model for those looking to fulfill their own dreams.\n\nRead more here\n\nCameron Kasky, Parkland student: My generation won't stand for this\n\nCameron Kasky\n\nFebruary 15\n\nWe can't ignore the issues of gun control that this tragedy raises. And so, I'm asking -- no, demanding -- we take action now.\n\nWhy? Because at the end of the day, the students at my school felt one shared experience -- our politicians abandoned us by failing to keep guns out of schools.\n\nBut this time, my classmates and I are going to hold them to account. This time we are going to pressure them to take action. This time we are going to force them to spend more energy protecting human lives than unborn fetuses.\n\nRead more here\n\nPeggy Drexler: Why does Melania stay?\n\nPeggy Drexler\n\nFebruary 17\n\nBut perhaps most important, although divorcing Trump would surely please the \"Free Melania\" crowd, the first lady hasn't really shown that she cares much what other people think of her -- or needs to be saved.\n\nShe has not tried particularly hard to win public approval: Besides her scant appearances and botched RNC address, she's become known for wearing the wrong things at the wrong time, like when she donned a pair of Manolos to visit victims of Hurricane Harvey. Which is also why it's perhaps too hopeful to expect that the pressure of these new revelations (which, let's be honest, are likely not new to her) will cause her to leave the life she seems comfortable in -- one that's very clearly sponsored by, if not warmly inclusive of, the President.\n\nRead more here\n\nGloria Borger: The great unraveling: Trump's allies are really worried about him\n\nGloria Borger\n\nMarch 2\n\nNot since Richard Nixon started talking to the portraits on the walls of the West Wing has a president seemed so alone against the world.\n\nOne source -- who is a presidential ally -- is worried, really worried. ...\n\nEven by Trumpian standards, the chaos and the unraveling at 1600 Pennsylvania Avenue are a stunning -- and recurring -- problem.\n\nBut there's an up-against-the-wall quality to the past couple of weeks that is striking, and the crescendo is loud, clear, unhealthy, even dangerous.\n\nRead more here\n\nPaul Callan: The lawyer Trump wants to represent him has been dead for 32 years\n\nPaul Callan\n\nMarch 24\n\nIt's becoming increasingly clear who President Donald Trump really wants to represent him in the Robert Mueller investigation -- and there's a good reason he can't have him.\n\nWhen John Dowd quit this week as lead counsel on Trump's legal team and the President made an effort to recruit \"deep state\" conspiracy theorist and conservative legal commentator Joseph diGenova to the team, the conclusion could only be that Trump wants to go to war against Mueller, using the tactics favored by his onetime mentor Roy Cohn.\n\nIn effect, the President wants to wage an aggressive, and probably dirty war, on the special counsel. Cohn, having died in 1986, isn't available. But there may be other lawyers who can fill that role\n\nRead more here\n\nJonathan Wackrow, former Secret Service agent: Barbara Bush's code name was absolutely perfect\n\nJonathan Wacrkrow\n\nApril 19\n\nAs a special agent with the United States Secret Service, I had the opportunity to work on many protective assignments with Mrs. Bush. While I was never permanently assigned to her detail, I am thankful for two specific moments with Mrs. Bush, ones I will cherish as defining experiences in my career and testaments to her legacy, her candor and grace.\n\nThe first occurred when I was a new agent, assigned to work a midnight shift at the Bush family's summer residence in Kennebunkport, Maine. I was walking in the front yard at daybreak, preparing to end my shift, when Mrs. Bush suddenly appeared.\n\nIn my world, it was better to be unseen, but in this instant, I was in the former first lady's full view with nowhere to hide. Mrs. Bush gave me the warmest smile and said, \"Well, it is good morning for me, but it looks like you have been up all night, so I will wish you a good night's sleep.\" Stunned, I thanked her.\n\nRead more here\n\nPaul Begala: Sean Hannity is a welfare queen\n\nPaul Begala\n\nApril 23\n\nSean Hannity is a lot of things. Needy isn't one of them. Greedy, in President Reagan's framing, seems more like it. Perhaps the program that guarantees Hannity's investments is a wise one. Perhaps, on the other hand, it is a wasteful welfare program. That's not the point. It's the hypocrisy, stupid.\n\nHannity is a very wealthy man. So is Donald Trump. It appears that part of the way they became rich was by decrying welfare for poor folks, then grabbing it for themselves. They view their voters, their viewers, as saps. Stooges. Suckers. As another great huckster said, there's one born every minute. And Hannity is laughing all the way to the bank.\n\nRead more here\n\nEinat Lev: Why Hawaii's volcano is in danger of going ballistic\n\nEinat Lev\n\nMay 10\n\nEveryone has been looking at the Kilauea Volcano's lava flows. Sure, a wall of molten rock consuming a car is quite the sight. But as we all focus on the damage at Leilani Estates, we shouldn't forget that volcanoes are complex systems, where everything is connected. New warnings about flying ballistic blocks and sinking lava lakes help us remember!\n\nThis event -- beautiful, destructive, frightening -- also presents a moment for all of us to appreciate the immense power of the forces that never cease shaping our planet. We are reminded by Kilauea to stay humble in the face of nature. And for volcanologists, the eruption is an opportunity to share with the public what we know about how these massive, intricate systems work.\n\nRead more here\n\nMichael D'Antonio: What Ivanka's smile can't hide\n\nMichael D'Antonio\n\nMay 14\n\nIvanka's smile was undoubtedly offered to calm concerns about him and, perhaps, to distract from the mayhem and death that any thoughtful person could have anticipated as the embassy opened and Trump abandoned America's claim to honest broker status in the Middle East.\n\nIt was the biggest test yet of Ivanka's ability to cast a benign light on a man who regularly creates a shadow too dark for her to dispel.\n\nRead more here\n\nFord Vox: What the $%#@ is wrong with you? Of course it's Yanny! (or Laurel)\n\nFord Vox\n\nMay 16\n\nBut if you're shocked by the Yanny and Laurel differences in your own household and social networks, by all means use this as a moment to reflect on what else you might perceive differently, in the political messaging swirling around us.\n\nIllusions like this fascinate us because they reveal there is a gap between what we perceive to be true and what actually exists. It's baked into our biology; we're equipped with brains that spend far more of their energy and devote far more network activity to processing and changing what we sense. Nothing gets in that isn't dramatically altered before it reaches our conscious awareness.\n\nAll knowledge is a feat of human interpretation. These periodic revelations that we see things differently are one of the all-too-fleeting healthy forces of social media, reminding us that we have to work together if we're going to get things right.\n\nRead more here\n\nIsha Sesay: Biracial, American and now a duchess: Meghan leaves mark on monarchy\n\nIsha Sesay\n\nMay 19\n\nIn a short period, Meghan Markle has ushered in a new sensibility and made the world recalibrate how it thinks about this family we thought we already knew so well.\n\nThe Duchess of Sussex chose to make her wedding day a moment where the world tuned in and were made to think about racial equality and gender equality. She made a decision to send the world a message.\n\nIt was a decision she made with her husband and with the blessing of the members of her new family. And it was powerful.\n\nRead more here\n\nHilary George-Parkin: What Kate Spade modeled for young women -- and their moms\n\nHilary George-Parkin\n\nJune 5\n\nThere's a reason Kate Spade's work appealed just as much to a generation of 12-year-old girls as it did to their moms. At its core, it made the case that femininity, creativity and a sense of playfulness weren't qualities you needed to give up or hide away in order to be taken seriously in the world -- that, in fact, they should be celebrated. It was an idealistic notion, but the woman at the helm, who built what would become a multibillion-dollar brand on boxy handbags and polka-dot prints, was all the proof we needed.\n\nThe idea that whimsy should have a place in the workplace, that \"sophisticated\" doesn't need to mean \"staid,\" that prints should be mixed and colors can be clashed, were, in many ways, ahead of their time. In an industry of dark sunglasses and status handbags, she embraced an unapologetically pretty, preppy, East Coast aesthetic, turning it on its head in the process.\n\nRead more here\n\nS. Nathan Park: US-North Korea friendship would be the perfect bulwark against China\n\nS. Nathan Park\n\nJune 6\n\nIn short, North Korea is in serious need of a military and economic counterweight against China -- and the United States can serve in that capacity. True, it is distasteful to be friends with a regime responsible for massive human rights violations. Yet pragmatism is a longstanding tradition in US foreign relations. Just consider that Mao Zedong was on the short list of history's greatest monsters, but Richard Nixon shook his hand.\n\nPragmatists would look beyond the present conditions and examine how a friendly relationship with North Korea would serve the long-term US national interest. With the rise of China, East Asia is far and away the most important region in the world for the United States. If the United States could count North Korea as a friend, it would be adding a friendly state located at the doorstep of China.\n\nRead more here\n\nDean Obeidallah: Why Sarah Sanders was asked to leave a restaurant\n\nDean Obeidallah\n\nJune 24\n\nThose shocked by these types of protests simply don't grasp the level of emotion that many who oppose Trump feel. I hear it nightly on my SiriusXM radio show and see it firsthand on social media. Even Trump, in a rare moment of honesty, told his supporters a few weeks ago that those who oppose him are not just angry, but \"really, really angry.\" Many view Trump as a true threat to America.\n\nSo, it should come as no surprise that some would also look to hold members of Team Trump responsible as well. After all, Trump administration officials who defend Trump's bigoted policies, his demonization of minority groups and his lies, are complicit. They freely choose to do the work for him and they shouldn't be shocked if some -- not all --Trump opponents lash out at them.\n\nRead more here\n\nDavid Axelrod: Annapolis victims worked hard and honorably to serve their community\n\nDavid Axelrod\n\nJune 29\n\nNo, the shooter apparently wasn't motivated by politics. But the victims died because the newspaper faithfully discharged its obligation to cover the news. So this slaughter should give us pause to reflect on the essential role of the journalist in our society.\n\nThey work hard to get the straight and unvarnished facts to us, to shine a light in dark corners and make sure we know what is going on in our communities, our country and the world.\n\nIt is a mission to which they commit themselves, often for little money and sometimes at great risk -- even, as we now know, in the newsrooms of local papers.\n\nRead more here\n\nLZ Granderson: I forgave my father for walking out on me. I hope he forgave me, too\n\nLZ Granderson\n\nJuly 7\n\nI've been poor and rich. I've been another face in the crowd and a face on television. Inside a crack house and a guest at the White House. And at each junction of my life, the demons regarding my father followed. They had an open invitation courtesy of the anger I kept in my heart. It wasn't until my son asked why hasn't he ever met his grandfather that I realized how foolish I had been.\n\nI wasn't trying to protect my kid. I was trying to punish an absentee father, losing sight of the fact that forgiveness isn't for the offender, but for the offended.\n\nI went to the nursing home hoping to jog his memory, like a scene from \"The Notebook.\" I took my phone out to Facetime, so my son could see and talk to his grandfather for the first time. And I went to the nursing home to say, \"I forgive you.\"\n\nRead more here\n\nPeniel Joseph: France's World Cup win is a victory for immigrants everywhere\n\nPeniel Joseph\n\nJuly 15\n\nIn short, the World Cup champions remind us all that, in an era of globalization, racial and ethnic diversity represent an enduring strength at all levels of society, ones that build cultural and political bridges within and between countries.\n\nFor millions of soccer fans around the world, Africa, in effect, just won the World Cup! This is more than just wishful thinking. The makeup of the French team represents a powerful response against building walls and detention centers to detain and dehumanize immigrant populations.\n\nThe global debate over immigration is the human rights issue of our time. How are we to treat the women, men, children and families who risk their lives for opportunities that thrive in Western society?\n\nRead more here\n\nRuth Ben-Ghiat: Trump and Putin: the pictures tell the story\n\nRuth Ben-Ghiat\n\nJuly 18\n\nThe meeting in Helsinki, Finland, between two men expert in the art of spectacle intended to intimidate the world, proclaiming that Trump's reorientation of America away from liberal democracy is in line with the intentions of his counterpart, Russian President Vladimir Putin.\n\nThe images tell another story: one that gives credence to the belief that Trump's allegiance to Putin goes way beyond ideology. We still don't know the actual reason the summit was held, nor do we know -- yet -- the nature of the hold Putin has over Trump. Yet photographs suggest this was no meeting of equals but an encounter between a supplicant (Trump) and a master (Putin), starting with Putin arriving late to their public encounter, setting it about 45 minutes back.\n\nRead more here\n\nManisha Sinha: What happened the last time a President chose America's enemies over its friends\n\nManisha Sinha\n\nJuly 25\n\nDonald Trump likes to compare himself to Andrew Jackson, but the Andrew he really resembles is Andrew Johnson. What they have in common are delusions of personal grandeur and a tainted ascent to the presidency. Trump was elected by a minority of the American electorate, with help from the vagaries of the Electoral College system and from considerable Russian interference.\n\nJohnson became president thanks to an assassin's bullet. While Johnson immodestly compared himself to Jesus and Moses, Trump claims he is the best at everything, even boasting recently on Twitter that his popularity among Republicans exceeds that of Abraham Lincoln. ...\n\nBut the resemblance between the two men goes deeper. Johnson's white supremacist views were blatant and his policies precipitated a constitutional crisis that put the President at loggerheads with Congress and his own party, the Republicans.\n\nRead more here\n\nSE Cupp: What Laura Ingraham said was awful. And unsurprising.\n\nSE Cupp\n\nAugust 9\n\nTo many, that sounded racist. That's because it is. She isn't complaining that the country's getting older or younger, richer or poorer, that we're having more or fewer children or moving to the suburbs. She's complaining that people who come to America from other countries -- even legally -- are making this country unrecognizable to her. Indeed, to \"us.\"\n\nWho \"us\" means is also clear: Fox News viewers, who are predominantly 65 and older and white. I know many of those viewers, and I'm sad to say that message probably resonated with a lot of them.\n\nRead more here\n\nTimothy Stanley: What it tells us that John McCain drank vodka with Hillary Clinton\n\nTimothy Stanley\n\nAugust 25\n\nJohn McCain once took on Hillary Clinton in a drinking contest. It was at a restaurant in Estonia in 2004, during a congressional tour. Both politicians managed four shots of vodka; the rules were unclear, but Clinton -- McCain's one-time political rival -- was declared the winner, according to the restaurant proprietor (though in her own account, Clinton said they \"agreed to withdraw in honorable fashion,\" rather than name a winner).\n\nThat image sums up the humanity and character of the late Sen. McCain, who will be mourned deeply on both sides of the political aisle. He embodied a more moderate brand of conservatism -- one that could separate politics and friendship -- that now feels distant and very much missed.\n\nHe should have been elected President in 2000, when he ran for the Republican nomination and lost, and if he had made it to the White House, America might have forged a new consensus around a smaller state and a cleaner politics.\n\nToday the country is divided in ways that McCain despaired of. But it should be united in grief for a genuine American hero.\n\nRead more here\n\nJoshua Geltzer: How to prepare for ex-President Trump\n\nJoshua Geltzer\n\nAugust 30\n\nNo one knows how Trump will leave the Oval Office. Maybe he'll resign. Maybe he'll be impeached. Maybe he'll be voted out in November 2020 -- or maybe he'll leave at the end of two terms in January 2025.\n\nBut however he becomes an ex-president, it's impossible to imagine Trump following in Richard Nixon's post-presidency footsteps -- ones that literally traversed empty beaches in a solitary existence. Whether Trump leaves of his own accord after eight years or is abruptly cast out by a vote of the Senate or Electoral College, he is not one to go quietly into the night.\n\nRemember: This is the only presidential candidate in recent memory who refused, even when he appeared to be on the brink of losing the election, to commit to accepting the outcome of the vote. In a career that's careened from real estate to reality TV to politics, there's been one constant: a thirst for more attention.\n\nRead more here\n\nDanielle Campoamor: Ariana Grande reminds us women have no safe place in America\n\nDanielle Campoamor\n\nSeptember 3\n\nAfter Grande's performance, the Rev. Charles H. Ellis III wrapped his right arm around Grande, pulled her close to him and touched her breast. He did this on stage, in a church, during a funeral -- in front of thousands of attendees. Visibly uncomfortable and tense, Grande forced her way through awkward laughs as to not make a scene at the Queen of Soul's eight-hour funeral. ...\n\nThe majority of us have felt what Grande undoubtedly felt on that stage: the undeniable fear that accompanies a violation; the need to keep everyone around you happy while you're internally screaming; the cultural expectation to keep smiling while your bodily autonomy is wholly dismissed.\n\nTo watch it play out at a funeral is not to be shocked by what you've witnessed, but to be reminded that women -- no matter how powerful or famous -- are not granted the same public safety as men.\n\nRead more here\n\nMarianna Spicer Joslyn: I was Anthony Bourdain's 'censor' at CNN\n\nSeptember 22\n\nLike his viewers, I fell in love with Tony. He was a brilliant writer and storyteller, and you saw his toughness and sensed his vulnerability. His team at ZPZ are the most gifted filmmakers I have seen in a long, long time. His shows were brilliantly shot, directed and edited, always. His writing was poetry, although his friends say he denied being a poet.\n\nI can't begin to tell you how much I appreciate and will miss my small part in this program. And my small connection with one of the most brilliant storytellers of our generation. I will miss his voice. I already miss his voice.\n\nI have no claim to being more distraught over Tony's passing than any of his fans, and not in the same league as those who knew and worked with him. But like those who did know him well, I am really angry at his loss, and deeply sad. His kind won't come our way again.\n\nRead more here\n\nRebecca Wanzo: These images of women around Kavanaugh evoke a familiar alibi\n\nRebecca Wanzo\n\nSeptember 26\n\nThis choice is an extension of a strategy we have seen even before the accusations against Brett Kavanaugh emerged late in the confirmation process. Kavanaugh stands poised to be the justice who will cement an anti-abortion rights court. With images of him with his wife, daughters, law clerks, and young female basketball players, he is framed as a man who supports women and their futures. (Kavanaugh has vigorously denied the allegations.)\n\nThey were front and center in the hearings -- a visual counterargument to the idea that women's lives and bodies are not safe in his hands. Now that some women have accused him of assaulting them, the images are even more important. The happy, shining faces of these teenage girls are meant to inspire trust.\n\nImages sell the idea that these girls have been safe in his hands. How could anyone imagine that this man, trusted and loved, would hurt them? And if he has not hurt them, how could he have hurt any other young woman?\n\nRead more here\n\nJennifer Taub: Brett Kavanaugh and I have a lot in common\n\nJennifer Taub\n\nSeptember 28\n\nWe both were raised with conservative politics and attended elite prep schools. We both are religious, with deep faith and a belief in God. We both attended Yale in the mid-1980s. We both, aside from occasional binge drinking, worked hard in school and wrote for the student newspaper. We both studied at Cross Campus Library. We both managed to get into top-tier law schools. He Yale, me Harvard. Although we shared similarities, I do not recall ever meeting him at Yale.\n\nBut there is one place where our similarities end, and that has made all the difference in our lives. While Brett Kavanaugh appears to have moved fluidly from his beer-drinking prep school days into his beer-drinking college years, I was not as fortunate.\n\nIn early fall of my freshman year at Yale, I was raped by an upperclassman. Until that moment, I had expected to maintain my virginity until I was married, or at least until I fell deeply in love. Some of the details are forever seared into my memory, like they were in Christine Blasey Ford's.\n\nRead more here\n\nNic Robertson: The world's leaders may regret laughing at Donald Trump\n\nNic Robertson\n\nSeptember 29\n\nIt was also a laugh that the world -- or at least its leaders -- had at the expense of President Trump.\n\nBeginning his speech at the United Nations General Assembly this week, Trump didn't appear to expect the humorous interlude as he launched into a recital of his achievements in office to date.\n\nThere was no serious stumble, but a short pause, perhaps taking in what was happening. ...\n\nThe lesson for UN delegates who may have laughed is this: Hope you don't get found out.\n\nPresident Trump likes respect. He won't forget. And he may get the last laugh.\n\nRead more here\n\nKelley Paul: My husband, Rand Paul, and our family have suffered intimidation and threats\n\nKelley Paul and US Sen. Rand Paul\n\nOctober 3\n\nEarlier this week, Rand was besieged in the airport by activists \"getting up in his face,\" as you, Sen. Booker, encouraged them to do a few months ago. Preventing someone from moving forward, thrusting your middle finger in their face, screaming vitriol -- is this the way to express concern or enact change? Or does it only incite unstable people to violence, making them feel that assaulting a person is somehow politically justifiable?\n\nSen. Booker, Rand has worked with you to co-sponsor criminal justice reform bills. He respects you, and so do I. I would call on you to retract your statement. I would call on you to condemn violence, the leaking of elected officials' personal addresses (our address was leaked from a Senate directory given only to senators), and the intimidation and threats that are being hurled at them and their families.\n\nRead more here\n\nIn response to Paul's op-ed, Jeff Giertz, Sen. Cory Booker's communication director, wrote a piece explaining the context of Booker's words.\n\nJeffrey Sachs: Trump's failure to fight climate change is a crime against humanity\n\nJeffrey Sachs\n\nOctober 18\n\nPresident Donald Trump, Florida Gov. Rick Scott, Florida Sen. Marco Rubio, and others who oppose action to address human-induced climate change should be held accountable for climate crimes against humanity. They are the authors and agents of systematic policies that deny basic human rights to their own citizens and people around the world, including the rights to life, health and property. These politicians have blood on their hands, and the death toll continues to rise.\n\nTrump remains in willful denial of the thousands of deaths caused by his government's inept, under-funded, and under-motivated response to Hurricane Maria in Puerto Rico last year. The image that will remain in history is of the President gleefully throwing paper towels for a photo op as the people of Puerto Rico around him suffered and died of neglect. In September, Hurricane Florence claimed at least 48 lives, with more likely to come in its aftermath. Last month, Hurricane Michael claimed at least 32 lives, with more than a thousand people reportedly still missing. The final death toll will likely soar in the months ahead as the residual consequences of the storm become more clear.\n\nRead more here\n\nKate Maltby: Pray that you don't win the billion-dollar lottery\n\nKate Maltby\n\nOctober 22\n\nThis week, the winners of two high-rolling lottery jackpots may get to live out their own big-spending fantasies. Tuesday's MegaMillions drawing stands at $1.6 billion and Wednesday's lesser Powerball is still no snip at $620 million. There isn't even a promise of alien invasion to cut short the spending window.\n\nBut in life, as in fiction, there's always still a catch. Is an overnight windfall of this magnitude really worth the hassle? Earlier this year, a New Hampshire woman sued for the right to retain anonymity while claiming her Powerball prize of $560 million. Most states still consider the identity of lottery winners a matter of public record.\n\nIf that sounds like a price worth paying for a half a billion-life change, bear in mind the number of lottery winners who've met grisly ends after the news of their winnings spread.\n\nRead more here\n\nTim Naftali: The midterms put our system against the Agitator in Chief\n\nTim Naftali\n\nOctober 24\n\nHistorically, the balancing against power in Washington has happened despite the fact that too many of us view elections -- especially midterms -- as spectator sports or don't care about them at all. How this can be in a country that prides itself on the blessings of liberty is a question for another time. But what if this healthy cycle of rebalancing is broken in 2018 despite two years of Trumpian chaos, disrespect for large swathes of our society and daily contempt for dissent?\n\nWith only a matter of days to go, the outcome of the struggle in the current three-person race among center-left anger, Trumpist rage and widespread apathy remains remarkably TBD. If our Agitator in Chief's 2018 Provocation Tour falls short, Donald J. Trump will be the clear loser and our constitutional system the winner. But if he manages to cheat history, our political system will face its strongest stress test in the modern era.\n\nRead more here\n\nVan Jones: 16 reasons to be excited about the midterm Rainbow Wave\n\nVan Jones\n\nNovember 7\n\nIn this election, we witnessed the end of two years of one-party rule and the beginning of a new Democratic Party: younger, browner, cooler; with more women, more veterans and the ability to contest and win races from the deep South to the Midwest. ... I call this torrent of inclusive populism \"The Rainbow Wave.\" Here is why I am excited about this peek into the future of our nation and the Democratic Party:\n\n1. Michigan's Rashida Tlaib and Minnesota's Ilhan Omar, both Democrats, will be the first Muslim women in the House of Representatives.\n\n2. Sharice Davids of Kansas and Deb Haaland of New Mexico, also Democrats, will be the first Native American women in the House of Representatives.\n\n3. Colorado Democrat Jared Polis will be the nation's first openly gay governor. Sharice Davids, mentioned above, is also part of the LGBT community. Democrat Kyrsten Sinema still stands a chance of being the first openly bisexual senator.\n\nRead more here\n\nDon Lincoln: A dark matter hurricane is headed our way\n\nDon Lincoln\n\nNovember 19\n\nAccording to a recent paper, the Earth is caught directly in the crosshairs of a cosmic hurricane. A swarm of nearly 100 stars, accompanied by an even greater amount of dark matter, is aimed directly at our stellar neighborhood and there's nothing we can do to stop it; in fact, the vanguard is already upon us. This sounds like a perfect summer blockbuster movie, starring The Rock and Chris Pratt, or maybe Scarlett Johansson and Charlize Theron.\n\nExcept this is for real. But is it a danger? Well, actually, no. Not at all. But it's potentially incredibly fascinating, with lots of interesting scientific interconnections.\n\nRead more here\n\nMarcus Mabry: America faces a crossroads after George H.W. Bush's death\n\nMarcus Mabry\n\nDecember 1\n\nAgree or disagree with Bush's politics, it is his profound decency that is his legacy. Just one example: Read his letter to Bill Clinton after he lost the 1992 election. That dignity and decorum is, perhaps, the greatest difference between Trump and his predecessors.\n\nThat decency deficit is what has led a handful of Republicans to repudiate Trump's politics and tone -- and many more did so before he was the party's nominee.\n\nBut today's Republican Party is the party of Trump, not the party of Bush.\n\nAnd America is at a crossroads. The suburban vote in the midterm elections suggested that many swing voters reject Trump's divisiveness. But do they accept the burdens of global leadership that George H.W. Bush embraced?\"\n\nRead more here\n\nElie Honig: Mueller is about to have his say -- in a big way\n\nElie Honig\n\nDecember 3\n\nThroughout his investigation of Russian interference in the 2016 election, special counsel Robert Mueller has imposed on his team an ironclad rule: Nobody leaks and nobody speaks -- out of court, that is. But when it comes to official court filings -- indictments, plea agreements, sentencing memos -- Mueller has been loquacious and at times downright chatty, disclosing in compelling narrative fashion crucial details about his investigation and giving tantalizing clues about what might happen next.", "description": "CNN Opinion shares some of the most popular political op-eds and social commentary of 2018.", "authors": ["Cnn Opinion"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/181218163812-30-top-takes-of-2018-super-tease.jpg", "published_at": "2018-12-20"}