{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Culture/demi-moore-bares-memoir-inside/story?id=65590706", "downloaded_at": "2019-09-13 18:24:56.943508+00:00", "title": "Demi Moore bares all in new memoir 'Inside Out'", "language": "en", "text": "Ahead of her new memoir, Demi Moore bared it all for the cover of Harper's Bazaar, sharing deeply personal stories about the highs and lows of her personal life, her career in Hollywood and how it has all molded her into the person she is today.\n\nMoore made history while she posed for the fashion magazine 28 years ago. Her close friend, actress Lena Dunham, interviewed Moore for the new article.\n\nThe actress who defined Hollywood in the 1990s, starring in some of the most iconic movies of the decade from \"Ghost\" to \"G.I. Jane,\" said her new book \"Inside Out\" takes a candid look at past relationships, struggles from her childhood, how she overcame addiction and her ascent to fame amid life's pitfalls.\n\nRamona Rosales/The New York Times via Redux\n\nOne vivid memory that Moore, 56, said her memoir includes was when she was just 12 and had to stop one of her mother's suicide attempts.\n\n\"Something very deep inside me shifted then, and it never shifted back,\" Moore wrote in her book. \"My childhood was over.\"\n\nThe actress also opened up about her struggle with sobriety. She got sober for the first time in her 20s, relapsed in her 40s and regained that sobriety in her 50s.\n\n\"Part of being sober is, I don't want to miss a moment of life, of that texture, even if that means being in some pain,\" she wrote.\n\nAlberto E. Rodriguez/Getty Images, FILE\n\nHer memoir also looks back at her marriages and becoming a mother.\n\nMoore first married musician Freddie Moore as a teen and the pair split after just a few years. She then married fellow A-list actor Bruce Willis in 1987 and took on the biggest role of her life, being a mother.\n\nMoore and Willis had three children together: Rumer, Scout and Talluhlah Willis.\n\nAt the height of her career, Moore was the highest-paid actress in Hollywood and walked away to be a full-time mom.\n\nVictor Boyko/GC/Getty Images, FILE\n\n\"My daughters offered me an opportunity to start to change the generational pattern. To be able to break the cycles,\" Moore wrote.\n\nAfter her third marriage to Ashton Kutcher, a miscarriage at 42, and a string of box office hits, the star hasn't lost a beat.\n\nHer new memoir hits bookshelves Sept. 24 just days before her new movie, \"Corporate Animals.\"", "description": "Demi Moore, 56, opens up to Harper's Bazaar about her new memoir that looks at the highs and lows of her life and fame.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/demi-moore-rd-ml-190913_hpMain_16x9_992.jpg", "published_at": "2019-09-13"}