{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7512421/Samsungs-2-000-foldable-phone-launches-today-detailed-care-instructions.html", "downloaded_at": "2019-10-05 07:01:16.632903+00:00", "title": "Samsung's $2,000 foldable phone launches today with detailed care instructions", "language": "en", "text": "Samsung’s highly-anticipated folding phone is set to launch in the US Friday following delays caused by screen malfunctions.\n\nAndroid users can purchase the Galaxy Fold from select Samsung, Best Buy Stores and certain AT&T locations.\n\nHowever, a detailed ‘care instruction’ guide is included that advises consumers to keep it away from objects, to not apply ‘excessive pressure’ and to not expose the Fold to liquids or small particles.\n\nScroll down for video\n\nSamsung’s highly-anticipated folding phone is set to launch in the US Friday following delays due to screen malfunctions\n\nThe Galaxy Fold boasts a 7.3-inch AMOLED display designed with polymer material layered for flexibility -- and is the largest Galaxy smartphone screen yet.\n\nIt is equip with six pro-grade cameras and a Infinity Flex Display can be used as a massive viewfinder.\n\nGALAXY FOLD FEATURES Galaxy Fold has a 7.3-inch AMOLED display designed with polymer material layered for flexibility. There are six cameras around the phone. It comes with 12GB of RAM and 512GB of storage. Users can play, games and stream all at the same time. Costs $2,000 in the US and is available for purchase today at Samsung, Best Buy Stores and also from certain AT&T locations.\n\nUsers can enjoy 12GB of RAM for gaming to streaming and live broadcasting all at ones.\n\nAnd it is equip with 512GB of storage for apps and other media.\n\nThe highly anticipated device from the world's top smartphone maker was originally due to hit the US market in April, but was beset with myriad flaws.\n\nIn an initial test Samsung's Galaxy Fold saw several problems with its display and hinge mechanism that damaged and contorted its screen -- problems that were only illuminated after the company sent the devices to several tech journalists.\n\nThe highly anticipated device from the world's top smartphone maker was originally due to hit the US market in April but was beset with myriad flaws.\n\nIts launch was delayed by screen defects and fixing the issue has taken the firm several months to rectify.\n\nThe phone will cost about 2.4 million won ($1,980) for South Korean buyers ($2,000 in the US).\n\nA detailed ‘care instruction’ guide is included that advises consumers to keep it away from objects, to not apply ‘excessive pressure’ and to not expose the Fold to liquids or small particles\n\nThe company announced in July it would be ready to sell the Galaxy Fold in September after making changes to strengthen the device.\n\nThese include upgraded hinges, to avoid the issue identified by early reviewers.\n\nDelays cost the South Korean tech giant sales that could have provided a decent bump in revenue during the slow summer season.\n\nSamsung's tribulations with its now-notorious Galaxy Fold however, haven't been enough to deter the smart phone giant from dreaming up new collapsible devices.\n\nIt boasts six pro-grade cameras and a Infinity Flex Display can be used as a massive viewfinder. Users can enjoy 12GB of RAM for gaming to streaming and live broadcasting all at ones. And it is equip with 512GB of storage for apps and other media\n\nAccording to anonymous sources quoted in a report from Bloomberg, the company is already designing a second foldable phone that can scale down to a 'compact square.'\n\nThe device will reportedly have a 6.7 inch inner display that will collapse into a square small enough to slide into one's pocket and evoke a retro 'clamshell' design popularized in the heyday of flip-phones.\n\nAndroid users can purchase the Galaxy Fold from select Samsung, Best Buy Stores and also from certain AT&T locations\n\nThe nascent device will also reportedly have an array of cameras on both the front and back, including a hole-punch style front-facing lens similar to the one that appears in the newest addition of the Galaxy Note.\n\nThere will also be two rear-facing cameras which will have different functionality depending on how the phone is positioned -- folded open, the device will be able to use both cameras, but with one half folded shut, users will be limited to only one.\n\nAs noted by Bloomberg, one major advantage the phone will have over Samsung's Galaxy Fold will be its shape.\n\nSamsung's newest smartphone will fold out into what is essentially the shape of a normal smart phone meaning developers won't have to design custom aspect ratios for apps on the device like they do with the more square Galaxy Fold display.\n\nIn theory the phone sounds like an improvement on the larger, more expensive, foldable phones currently in production, however, it remains to be seen whether the device will be able to avoid critical flaws that have plagued devices of its ilk.", "description": "Samsung's foldable phone is set to hit the US market today. The Galaxy Fold will be available at select locations, but the South Korean firm has included a detailed 'care instructions' guide.", "authors": ["Stacy Liberatore For Dailymail.Com", "Joe Pinkstone For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/27/15/19014672-0-image-a-12_1569595981027.jpg", "published_at": "2019-09-27"}