{"pub": "independent", "url": "https://independent.co.uk/independentpremium/thomas-cook-liquidation-closure-flights-travel-tour-company-a9118686.html", "downloaded_at": "2019-09-25 04:41:46.680536+00:00", "title": "Thomas Cook’s problem was simple – the public don’t need mass-market tour companies anymore", "language": "en", "text": "The market economy can be a brutal place. The collapse of Thomas Cook is a reminder of that, as the hundred thousands of people stranded away from home will be very well aware. But they are not the only victims of this failure. The creditors of the company, the foreign hotels who thought they had block bookings through the winter, the shareholders, the employees, and at one remove British taxpayers who have to pay for repatriation flights – the list of losers goes on and on.\n\nEven the apparent winners, such as other travel companies, may suffer. Yes, a competitor has been taken out of the market. But this undermines the reputation of the entire package holiday industry. If a giant can collapse over a weekend, is it a good idea to book with one of the tiddlers?\n\nGiven this widespread misery, it certainly sticks in the craw that the directors should have extracted £47m in bonuses while they were running the company into the ground. This is yet another example of a theoretically sound practice – that managers should receive something on top of their salary if they perform particularly well – that has become corrupted. There is a case for requiring public companies to place directors’ bonuses in some kind of trust account, to be paid over when it is clear that these have been justified by the subsequent performance of the enterprise.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBut Thomas Cook did not have a £47m problem; it had a £1.7bn problem. That was the size of its pile of debt. The business analysts have been warning about the company’s inherent financial weakness for some time, and have highlighted the strategic errors its management have made, especially sticking to a high street and brochure business model in the online age. But I think the problem of Thomas Cook was even bigger. We don’t really need mass-market tour companies any more.\n\nFive things have undermined the Thomas Cook business model.\n\nOne, the rise of the budget airline. Go back 20 years and airline fares were so high that some people would book a charter flight and throw away the hotel voucher that the tour operators were obliged to offer as part of the “package”. Now, if you are prepared to put up with the no-frills service, you can buy a flight at not much more that it would cost the travel company to book it.\n\nTwo, online hotel booking. You can look at the real reviews (and yes, I know you have to weed out the fakes) of hotels and locations, without reading some glossy brochure that makes it all sound better than it is.\n\nThree, changing work patterns. A lot of us have to take a break at short notice, or cancel earlier plans when something crops up. The old model, when you knew several months in advance when you have your two-week holiday, is for many people long gone.\n\nFour, the hospitality industry has lifted its game. Hotel chains have a database of clients and can offer special deals. Cities have improved their information, so that you no longer need a tourist operator to tell people what their attractions are. More people in key locations speak English, making it easier for Anglophone visitors to find their way around.\n\nFinally there is the quest for authenticity. That’s why Club Med-type hols with a rep on site just aren’t the thing anymore – and why Airbnb has done so well.\n\nOf course there are niches. The cruise business is one. But it aims for an older demography than any other branch of the holiday business and one less affected by the forces noted above. Safari holidays are another, but they are top end. Educational package tours still thrive, particularly for retirees. And if you want to go on a skiing holiday there are lots of specialist providers, including Club Med.\n\nInterestingly Club Med is now owned by the Chinese Fosun Group, which was an investor in Thomas Cook, and its potential rescuer before the numbers became too big. The Chinese holiday market is a boom business. Last year 150 million Chinese people travelled abroad, far more than any other country.\n\nBut the big message from Europe at least is that the mass-market package tour business is in structural decline. It is a decline that will continue. And the brutal capitalist system has to adapt to that.", "description": "The market economy can be a brutal place. The collapse of Thomas Cook is a reminder of that, as the hundred thousands of people stranded away from home will be very well aware. But they are not the only victims of this failure. The creditors of the company, the foreign hotels who thought they had block bookings through the winter, the shareholders, the employees, and at one", "authors": ["Hamish Mcrae"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/23/17/front-thomas-cook.jpg", "published_at": "2019-09-24"}