{"pub": "newrepublic", "url": "https://newrepublic.com/article/155295/corporate-america-sapped-green-meaning", "downloaded_at": "2019-10-25 16:00:27.105692+00:00", "title": "Corporate America Has Sapped “Green” of Meaning", "language": "en", "text": "Every American grocery store sells a mountain of stuff bearing the dubious label “green”: sugarcane toilet paper, reusable straws, recycled Nestlé water bottles. Green is the color of solar energy and the Green New Deal, but even some luxury sports car companies claim that they, too, are green. We sleep easily after buying these products, reassured that we are doing our part to fight climate change, and yet the color green also reminds us that we must one day leave such conspicuous consumption behind.\n\nGreen’s contradictory moral associations are built into its history. As The Oxford English Dictionary tells us, the Greeks associated it with nausea and bile (the nauseated face in Apple’s suite of emojis continues this tradition; it’s an unpleasant greenish hue), while the Romans were more enamored with the color. The Latin viridis evoked virility, virtue, and verdure. Dutch, German, and Icelandic speakers also used green to convey freshness, vitality, and inexperience. As the historian Michel Pastoureau has written, people came to associate it with the vagabond spirits that roamed through the precincts of nature—and even some that ventured beyond them: fairies, goblins, leprechauns, and little green men from outer space. Their mystical powers could bring luck—it’s why gaming tables, even now, are surfaced with green felt.\n\nGreen’s political meaning comes to us from German. In the 1970s, the West German radicals who mobilized against industrial pollution and nuclear proliferation called themselves Die Grünen, a.k.a. the Greens. As green politics has gone mainstream, however, activists have had to navigate the political and commercial co-option (“greenwashing”) that comes with newfound popularity. Because the term has never had a consistent meaning, it can cover a multitude of sins. Many “green” disposable diapers, for example, are still made of plastic, moved by trucks to big-box stores around the country, and tinted brown to look more natural. Greener than the alternative, perhaps, but “green”? That depends.\n\nThis opportunistic fuzziness is why some on the left are uncomfortable with the term. As Naomi Klein explains in This Changes Everything, boosters of “green capitalism” promise growth without destruction, but this is little more than a fantasy: Market logic demands constant expansion, and the world’s ecologies have limits. BP and General Motors can tout their “green” energy commitments, but they’re still drilling in the Arctic and punching out cars that pump carbon into the atmosphere. To misquote one of the color’s most successful modern evangelists, it’s too easy to be green.", "description": "The word is used to describe disposable plastic diapers as well as the most ambitious climate legislation ever proposed. So what good is it?", "authors": ["John Patrick Leary"], "top_image": "https://images.newrepublic.com/9ea6762035b9a9f4c856a0d27dae108daf12ae91.png?w=1109&h=577&crop=faces&fit=crop&fm=jpg", "published_at": "2019-10-25"}