{"pub": "yahoo", "url": "https://news.yahoo.com/khashoggis-slaying-saudi-clampdown-persists-211538139.html", "downloaded_at": "2019-09-28 10:20:27.898615+00:00", "title": "A year after Khashoggi's slaying, Saudi clampdown persists", "language": "en", "text": "FILE - In this Dec. 15, 2014, file photo, Saudi journalist Jamal Khashoggi speaks during a press conference in Manama, Bahrain. Nearly one year has passed since the Oct. 2 killing of Khashoggi, whose body has still not been found, no one has been convicted and questions continue to linger over the crown prince’s culpability. At the sidelines of the U.N. General Assembly, relatives of activists detained in Saudi Arabia, and Khashoggi’s fiancée, wondered why those responsible haven’t been punished. (AP Photo/Hasan Jamali, File)\n\nNEW YORK (AP) — Nearly one year has passed since a team of 15 Saudi government agents flew to Turkey and killed Saudi journalist Jamal Khashoggi. His body has still not been found, no one has been convicted and questions linger over the crown prince's culpability.\n\nThe Oct. 2 slaying brought into sharp focus the very concerns over human rights that Khashoggi had spent the last year of his life in exile writing about in columns for The Washington Post— and the reason he may have been targeted. At a time when Crown Prince Mohammed bin Salman's social reforms were being widely hailed in the West, Khashoggi's columns criticized the parallel crackdown on dissent the prince was overseeing.\n\nAt the sidelines of the U.N. General Assembly this week, relatives of rights activists detained in Saudi Arabia — and Khashoggi's fiancée — wondered why those responsible haven't been punished and why the clampdown on dissent has continued seemingly unabated.\n\nKhashoggi had walked into his country's consulate in Istanbul that October morning to collect documents that would allow him to wed his Turkish fiancée, Hatice Cengiz, who waited for him outside. He'd never walk out.\n\n\"Why was Jamal killed? Where is his body? What was the motive for this murder?\" Cengiz told The Associated Press in an interview in New York. \"This murder was not limited to the perpetrators.\"\n\nAgnes Callamard, a U.N. special rapporteur who authored an inquiry into the killing, said the search for justice must not be left to the Saudi judicial system, which is \"so vulnerable to political interference.\"\n\nSaudi Arabia's trial of 11 suspects has been held in secret and does not include the crown prince's top adviser at the time of the killing— Saud al-Qahtani, who has been sanctioned by the U.S. for his suspected role in orchestrating the operation.\n\n\"At times it feels as if justice for Jamal hangs by a thread,\" Callamard said.\n\n\"But that is the very same thread from which democracies are woven, and for that we must demand justice for Jamal,\" she said at an event at the U.N. on Thursday.\n\nHer report, published in June, called for sanctions on the crown prince and said responsibility for Khashoggi's killing falls on Saudi Arabia. The report found \"sufficient credible evidence regarding the responsibility of the Crown Prince demanding further investigation.\"\n\nIn Washington, Congress has said it believes Prince Mohammed is \"responsible for the murder\", despite Saudi insistence he had no involvement in the operation.\n\nPresident Donald Trump condemned the killing, and his administration sanctioned 17 Saudis suspected of being involved, though not the crown prince. Trump, however, has steadfastly resisted calls by members of his own party for a tougher response and has defended maintaining good relations with Saudi Arabia, framing its importance as a major buyer of U.S. military equipment and weapons and saying this creates American jobs.\n\nMeanwhile, numerous critics of the crown prince remained imprisoned and face trial for their acts of dissent.\n\nLoujain al-Hathloul, one of Saudi Arabia's most outspoken women's rights activists, was one of more than a dozen women detained last year, just weeks before the crown prince lifted the ban on women driving — something they been calling for in their push for equal rights.\n\nAl-Hathloul and some of the detained women say they were tortured and sexually abused during interrogations by masked men. They face a range of vague national security charges.\n\nHer sister, Lina al-Hathloul, said she believes the human rights situation in Saudi Arabia is at its worst, even as the country took a major step this year toward dismantling restrictive male guardianship laws by no longer requiring that women have male permission to travel abroad or obtain a passport.\n\n\"Decisions have to be top down. Nothing can be initiated by the people,\" she said, referring to the crown prince's reforms.\n\nLoujain al-Hathloul's family say she had been studying for her master's degree in the United Arab Emirates when she was kidnapped by security forces and forced on a plane to Saudi Arabia, where she was then banned from traveling abroad and later detained in May 2018.\n\nAs time passes, damage to the crown prince's reputation has too been fading, with countries and companies resuming business with the kingdom as it prepares to launch a highly anticipated public offering of the state-owned oil company, Aramco.", "description": "Nearly one year has passed since a team of 15 Saudi government agents flew to Turkey and killed Saudi journalist Jamal Khashoggi.  The Oct. 2 slaying brought into sharp focus the very concerns over human rights that Khashoggi had spent the last year of his life in exile writing about in columns for The", "authors": ["Aya Batrawy"], "top_image": "https://s.yimg.com/uu/api/res/1.2/RC4mxGBW8Ug8uoLf4P5BZw--~B/aD0yMDMyO3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/577ffcdef3a5194310942f6682539411", "published_at": "2019-09-27"}