{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7623257/Pride-Britain-Awards-Louise-Redknapp-exudes-glamour-black-mini-dress.html", "downloaded_at": "2019-10-28 23:46:10.404848+00:00", "title": "Pride of Britain Awards: Louise Redknapp wears black mini-dress", "language": "en", "text": "She's gearing up to release her latest record Heavy Love, her first studio album in almost twenty years.\n\nAnd Louise Redknapp exuded elegance as she attended the Pride of Britain Awards held at the Grosvenor House Hotel in London on Monday.\n\nThe singer, 44, looked nothing short of sensational in a black mini-dress with structured shoulders and long sleeves.\n\nStyle: Louise Redknapp, 44, exuded elegance as she attended the Pride of Britain Awards held at the Grosvenor House Hotel in London on Monday\n\nAdding height to her frame with black heels with a diamond embellishment, Louise also sported a pair of black tights for the evening.\n\nStyling her blonde locks into a ponytail, Louise completed her look for the evening with a black clutch bag.\n\nLouise was joined on the red carpet by a host of stars including Holly Willoughby, Amanda Holden, Emily Atack and host Carol Vorderman.\n\nThe outing comes as Louise insisted she still 'doesn't know' why her marriage to Jamie Redknapp, 46, broke down after 19 years together.\n\nFashion: The singer looked nothing short of sensational in a black mini-dress with structured shoulders and long sleeves\n\nThe singer recently said on This Morning that despite rumours, she 'doesn't blame' her stint on Strictly Come Dancing for the breakdown of her marriage, as she and Jamie split in late 2017, a year after she appeared on the show.\n\nLouise also told Richard Madeley and Judy Finnigan that it took her a 'long time' to get over the split thanks to large amount of people involved, but she's moving forward now as she plots her musical comeback.\n\nLouise candidly spoke about the end of her marriage as she chatted to Richard and Judy about her long-awaited musical comeback.\n\nOutfit: Adding height to her frame with black heels with a diamond embellishment, Louise also sported a pair of black tights for the evening\n\nWhen asked directly what went wrong between her and Jamie, she said: 'I wish I knew, it was really sad and sad times for the whole family. It's something that takes a long time to get over.'\n\nJust a year before she and Jamie split, Louise was a contestant on Strictly in 2016, and during the stint rumours were rife about the show's famous curse.\n\nBut Louise said that actually taking part in the show actually proved that she can't blame anyone for the end of her marriage.\n\nShe said: 'It reminded me that this was no one's fault, and not Jamie's, things go on far deeper than a TV programme.\n\nRadiant: Styling her blonde locks into a ponytail, Louise completed her look for the evening with a black clutch bag\n\n'What the programme did for me just reminded me how much I loved performing. My kids see that now they come to their gigs and say ''do you know what mum it's been a tough time but it's really lovely to see you singing along in a car.\n\n'Times like that I get asked all the time about it, but when there's a whole family involved it's massive in everybody's life.'\n\nLouise also spoke to Richard and Judy about her comeback to music, which comes with the release of her new album Heavy Love in early 2020.\n\nWhen asked whether her new album has any reference to the end of her marriage, she said: 'I never went into making the album with it being about that because you don't, but when you're in the studio naturally you pull your heart out.\n\nCandid: It comes after Louise insisted she still 'doesn't know' why her marriage to Jamie Redknapp broke down after saying it took 'a long time' to get over the split\n\n'There are songs on the album that are never bashing, it was just how I felt as a mother as a wife. This whole album, all you can do is put on what you've been through.'\n\nMore than 100 of the UK's biggest stars will come together at the Daily Mirror Pride of Britain Awards to honour the nation's unsung heroes on the landmark 20th anniversary of the event.\n\nThe awards recognise and celebrate ordinary people up and down the country doing extraordinary things.\n\nSad: Louise divorced husband Jamie in late 2017 after 19 years of marriage. The couple are parents to sons Charles, 15, and Beau, ten (pictured in 2016)\n\nHosted by Carol Vorderman, celebrities and public figures including Prince Charles, Robert Downey Jr, Sir Ben Kingsley, Dua Lipa, Ant & Dec, Chris Pratt, Michael Sheen, Adam Lambert, Christine Lampard, Sir Michael Caine, Jonathan Ross, Suranne Jones, and the judges and casts of Strictly Come Dancing and X Factor will be honouring this year's awe-inspiring winners.\n\nCarol Vorderman said: 'Pride of Britain is such a huge part of my life, it's hard to believe it's 20 years since we first started. In that time, it has found a place at the heart of British life, and the winners represent the very best of us. I never fail to be humbled by them, and this year's are no different.'\n\nThe Daily Mirror Pride of Britain Awards, in partnership with TSB, will be broadcast on ITV on 5th November at 8pm.", "description": "The singer, 44, looked nothing short of sensational as she attended the Pride of Britain Awards held at the Grosvenor House Hotel in London on Monday.", "authors": ["Sean O'Grady For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/19/20294982-0-image-a-99_1572291610184.jpg", "published_at": "2019-10-28"}