{"pub": "marketwatch", "url": "https://marketwatch.com/story/details-emerge-on-which-military-projects-are-losing-their-funding-to-trump-wall-construction-2019-09-04", "downloaded_at": "2019-09-05 02:11:58.255903+00:00", "title": "Details emerge on which military projects are losing their funding to Trump wall construction", "language": "en", "published_at": "2019-09-04", "text": "WASHINGTON (AP) — President Donald Trump’s move to kill or delay hundreds of construction projects on U.S. military bases to fund about 175 miles of fencing along the U.S.-Mexico border is stoking the ire of Capitol Hill Democrats, who promise they won’t replace the money needed to revive the projects. Some are even vowing to try to use an upcoming temporary government-wide funding bill to try to block Trump altogether.\n\nTrump’s move, announced Tuesday by Secretary of Defense Mark Esper, would take the biggest step yet in delivering on his longstanding promise to build a wall to block immigrants from entering the country illegally. But new stretches of fencing proposed along the Rio Grande and through a wildlife refuge in Arizona promise to ignite legal battles that could delay the projects as well.\n\nThe Pentagon promised to reveal Wednesday additional details on which projects will be hit, but half the money will come from military projects in the U.S. The rest will come from projects in other countries.\n\nA Texas congressman said his state will get hit by $354 million in military base cuts, while a new 52-mile stretch of fencing northwest of Laredo promises to rob landowners along the Rio Grande of thousands of acres.\n\n“It takes away from the men and women who are waiting for an air traffic control tower or waiting for a dining building or a dormitory. It affects the morale of our men and women and their readiness. So it’s wrong,” said Rep. Henry Cuellar, D-Texas. “It doesn’t take any input from the local communities. It will take away from the private property rights.”\n\nAssociated Press Construction crews replace a section of the primary wall separating San Diego, above right, and Tijuana, Mexico, below left, in March.\n\nCuellar added, “We are going to do everything we can to stop the president,” suggesting Democrats will look at a must-pass funding bill this month — required to prevent a government shutdown Oct. 1 — to try to take on Trump. But a more likely venue for the battle could be ongoing House-Senate negotiations over the annual Pentagon policy measure.\n\n‘To pay for his xenophobic border wall boondoggle, President Trump is about to weaken our national security by stealing billions of dollars from our military.’ Rep. Debbie Wasserman Schultz\n\nTrump has so far succeeded in building replacement barriers within the 654 miles of fencing built during the Obama and Bush administrations. The funding shift will allow for about 115 miles of new pedestrian fencing in areas where there isn’t any now.\n\n“The wall is being built. It’s going up rapidly,” Trump said Wednesday. “And we think by the end of next year, which will be sometime right after the election actually, but we think we’re going to have close to 500 miles of wall, which will be complete.”\n\nNew stretches of fencing are sure to spark legal battles with angry landowners and environmentalists. The Pentagon plan also fuels the persistent controversy between the Trump administration and Congress over immigration policies and the funding of the border wall.\n\nLawmakers who refused earlier this year to approve nearly $6 billion for the wall must now decide if they will restore the projects that are being used to provide the money.\n\nRomney and Mike Lee object over admin move to delay defense projects in Utah for $54M to help fund border wall. “Congress has been ceding far too much powers to the executive branch for decades and it is far past time for Congress to restore the proper balance of power,” Lee said — Manu Raju (@mkraju) September 4, 2019\n\n“To pay for his xenophobic border wall boondoggle, President Trump is about to weaken our national security by stealing billions of dollars from our military,” said Rep. Debbie Wasserman Schultz, D-Fla., who chairs a key military construction panel. “The House of Representatives will not backfill any projects he steals from today.”\n\nOne of the Senate’s most endangered Republicans in the 2020 election, Arizona Sen. Martha McSally, reported that her state is getting nicked for just $30 million from a project that was being delayed anyway.\n\n“We need to secure our border and protect our military; we can and should do both,” McSally said. “I went to the mat to fight for Arizona projects and succeeded.”\n\nSen. Martha McSally boasted that she ‘went to the mat for Arizona projects’ and as a result her state is having just $30 million pulled from military-base work.\n\nElaine McCusker, the Pentagon comptroller, said the now-unfunded projects are not being canceled. Instead, the Pentagon is saying the military projects are being “deferred.” The Defense Department, however, has no guarantee from Congress that any of the money will be replaced.\n\nCongress approved $1.375 billion for wall construction in this year’s budget, same as the previous year and far less than the $5.7 billion that the White House sought. Trump grudgingly accepted the money to end a 35-day government shutdown in February but simultaneously declared a national emergency to take money from other government accounts, identifying up to $8.1 billion for wall construction.\n\nThe transferred funds include $600 million from the Treasury Department’s asset forfeiture fund, $2.5 billion from Defense Department counterdrug activities and now the $3.6 billion pot for military housing construction announced Tuesday.\n\nThe Pentagon reviewed the list of military projects and said none that provided housing or critical infrastructure for troops would be affected, in the wake of recent scandals over poor living quarters for service members in several parts of the country. Defense officials also said they would focus on projects set to begin in 2020 and beyond, with the hope that the money could eventually be restored by Congress.\n\nThe government will spend the military housing money on 11 wall projects in California, Arizona and Texas, the administration said in a filing Tuesday in a lawsuit brought by the American Civil Liberties Union. The most expensive is for 52 miles in Laredo, Texas, at a cost of $1.27 billion.\n\nThe Laredo project and one in El Centro, California, are on private property, which would require purchase or confiscation, according to the court filing. Two projects in Arizona are on land overseen by the Navy and will be the first to be built, no earlier than Oct. 3. Seven are at least partly on federal land overseen by the Interior Department, including a 31-mile stretch through the Cabezza Prieta National Wildlife Refuge in Arizona, a major wilderness area.\n\nThe 175 miles covered by the Pentagon funding represents just a fraction of the 1,954-mile U.S.-Mexico border.", "description": "President Donald Trump’s move to kill or delay hundreds of construction projects on U.S. military bases to fund about 175 miles of fencing along the...", "authors": ["Associated Press"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ708_wall_t_ZG_20190904171324.jpg"}