{"pub": "marketwatch", "url": "https://marketwatch.com/story/how-retirees-should-plan-for-an-imminent-recession-2019-09-18", "downloaded_at": "2019-09-18 23:20:34.557594+00:00", "title": "Here’s how retirees should plan for an imminent recession", "language": "en", "text": "How should retirees respond to the steadily growing drumbeat of stories about an imminent recession?\n\nNot long ago, you may recall, the 2-year versus 10-year yield curve became more inverted than at any time since 2007, right as the Great Recession was beginning. The federal government revised downward its estimate of second-quarter GDP growth from an already tepid 2.1% to 2.0%. It was reported that parts of America may already be facing a recession.\n\nI therefore am taking a fresh look at how retirees and soon-to-be retirees should respond if they think a recession is coming.\n\nMy advice, in short, is to do nothing. If you already have had in place a sound and appropriate financial plan, then you already have planned for a possible recession. There’s nothing more you need to do.\n\nIf you don’t have such a plan, then you should definitely construct one right away and start following it. But that’s not because I think a recession is about to happen, though of course one could begin at any time. Instead, the reason to start following a good financial plan is precisely because it enables you not to worry about a recession.\n\nI concede that it seems counterintuitive to recommend doing nothing in the face of a possible recession. So let me review why a recession doesn’t automatically lead to losses in your portfolio:\n\n• Recessions do not always coincide with stock bear markets, and vice versa. Of the 36 bear markets since 1900 in the calendar maintained by Ned Davis Research, no fewer than 16 were not associated with a recession in the calendar maintained by the National Bureau of Economic Research (NBER). That is, throughout those bear markets, from beginning to end, the U.S. economy was growing. Of those bear markets that were correlated with a recession, some began the same month as the recession while, in some other cases, as much as 16 months in advance. (See accompanying chart.)\n\n• Faster economic growth does not lead to better stock market returns. In fact, the evidence suggests just the opposite. Consider a study by Jay Ritter, a finance professor at the University of Florida, entitled “Is Economic Growth Good for Investors?” He found that there has been a negative correlation between inflation-adjusted per-capita GDP growth and countries’ stock market returns: “Investors would have been better off investing in countries with lower per capita GDP growth than in countries experiencing the highest growth rates.”\n\n• The S&P 500 SPX, +0.03% historically has done the best in those quarters in which earnings per share (EPS) on a year-over-year basis were between 10% and 25% lower. In such quarters, according to Ned Davis Research, the S&P 500 has produced an annualized average return of 25.0%. When year-over-year EPS growth was above 20%, in contrast, the S&P 500 gained an average of just 2.6% annualized.\n\n• Not surprisingly, given these results, clairvoyance about GDP growth in subsequent quarters is of no or very little help in managing your portfolio. For example, as I discussed in greater length in an earlier column, being able to predict GDP growth four quarters hence leads you to only marginally beat a buy-and-hold portfolio.\n\nIt would be going too far, of course, to conclude from these results that recessions are preferable to economic growth. Still, it is clear, the relationship between recessions and bear markets is so tenuous that retirees are worrying themselves for little more than nothing if they obsess about when the next recession begins.\n\nIf you’re nevertheless the worrying sort, what should you worry about? Deluard responds by reminding us that the stock market’s level can be calculated by multiplying Sales by Profit Margin and P/E Multiple. “Economic growth [i.e. sales] only matters for a fraction of one term” in this equation, since “about half of the revenues of the S&P 500 index companies come from abroad.”\n\nTherefore, if you insist on worrying, you “should spend less time worrying about the next recession and focus on the two second terms of the equation—margins and multiples.”\n\nMark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. Hulbert can be reached at mark@hulbertratings.com.", "description": "A recession doesn’t automatically lead to losses in your portfolio.", "authors": ["Mark Hulbert"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR525_bear_f_ZG_20190918103123.jpg", "published_at": "2019-09-18"}