{"pub": "investing.com", "url": "https://investing.com/news/stock-market-news/firefighters-contain-more-of-deadly-los-angeles-wildfire-1995583", "downloaded_at": "2019-10-13 18:48:49.466164+00:00", "title": "Firefighters contain more of deadly Los Angeles wildfire", "language": "en", "text": "© Reuters. Firefighters battle a wind-driven wildfire called the Saddle Ridge fire in the early morning hours Friday in Porter Ranch\n\n(Reuters) - Firefighters gained further control of a deadly wildfire on the northern edge of Los Angeles that has forced thousands from their homes, officials reported on Sunday, as the warm and dry Santa Ana winds that fueled the blaze were expected to subside.\n\nState fire officials reported the so-called Saddleridge Fire was 41% contained, up from 19% contained on Saturday, when authorities ended the last remaining evacuation order. Some 23,000 people had been cleared from their homes in previous days, the Los Angeles Times reported.\n\nThe fire that began on Thursday had scorched nearly 8,000 acres (3,200 hectares) as of Sunday morning, the California Department of Forestry and Fire Protection (CalFire) reported.\n\nSanta Ana winds brought dry desert air into the Los Angeles basin, whipping up a fire blamed for the death of a Los Angeles man. Officials said he suffered a heart attack while trying to fight encroaching flames on his property instead of evacuating.\n\nForecasters expected winds to change direction and bring a cooler ocean breeze to the area, but smoke still lingered over much of Los Angeles, leading the South Coast Air Quality Management District to issue a smoke warning that remained in effect on Sunday.\n\nThe cause of the blaze was under investigation. Fire officials said they were investigating witness reports in local media linking the fire to a power transmission line.\n\nThe Saddleridge is the largest among a spate of wildfires across California that burned nearly 160,000 acres (64,000 hectares) and destroyed 134 structures, CalFire said, including homes in Los Angeles.", "description": "Firefighters contain more of deadly Los Angeles wildfire", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF9C0JL_L.jpg", "published_at": "2019-10-13"}