{"pub": "thenextweb", "url": "https://thenextweb.com/hardfork/2019/10/21/opportunistic-fraudsters-use-el-chapos-sons-arrest-in-bid-to-steal-bitcoin", "downloaded_at": "2019-10-21 13:08:21.195440+00:00", "title": "Opportunistic fraudsters use El Chapo’s son’s arrest in bid to steal Bitcoin", "language": "en", "text": "Mexican officials have been forced to free Ovidio Guzman Lopez – the son of Mexican drug kingpin El Chapo whose real name is Joaquin Archivaldo Guzman Loera – from custody after cartel gunmen turned Sinaloa into an urban war zone.\n\nNow, opportunistic scammers are seeking to capitalize on the incident by reportedly bombarding the city’s residents with threatening emails seeking payment in Bitcoin in exchange for staving off more violence, the New York Post reports.\n\n“These messages contain threats against those who receive them, demanding money be deposited into an account,” Mexican authorities told Rio Doce newspaper on Sunday.\n\n“However, this is an attempt to extort people or groups to take advantage of events in the city of Culiacan. Residents are asked to ignore these emails,” they added.\n\nThe scammers are also sharing fake videos depicting violent scenes, which the authorities say, aren’t recent and have not been filmed in Sinaloa.\n\nEl Chapo, is a Mexican drug lord and former leader of the Sinaloa Cartel, an international crime syndicate. He is widely considered to have been the most powerful drug trafficker in the world.\n\nNotorious for his escape from El Altiplano, a maximum-security prison near the city of Toluca after digging a mile-long tunnel from a shack outside the prison to the shower inside his cell, Chapo was once ranked as the 10th richest man in Mexico.\n\nOvidio Guzman allegedly took over the cartel with his brother Ivan Archivaldo Guzman Salazar after their father was extradited in 2017.\n\nIndeed, this isn’t the first time scammers have tried to siphon funds from unsuspecting victims – and it’s unlikely to be the last.\n\nJust last month, fraudsters took to impersonating Buckingham Palace, reportedly sending letters asking for Bitcoin BTC donations to save the UK economy.", "description": "Opportunistic scammers are seeking to capitalize on the incident by reportedly bombarding the city's residents with threatening emails seeking payment in Bitcoin.", "authors": ["Yessi Bello Perez", "October"], "top_image": "https://img-cdn.tnwcdn.com/image/hardfork?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2Fbitcoin-crytptocurrency-scammers.jpg&signature=4126aef6a4efd0524cd6a756360eb9cd", "published_at": "2019-10-21"}