{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7588531/Lindsay-Lohan-says-considers-fellow-Masked-Singer-judges-family.html", "downloaded_at": "2019-10-19 12:12:14.944335+00:00", "title": "Lindsay Lohan says she considers her fellow Masked Singer judges 'family'", "language": "en", "text": "It's the ratings juggernaut that's had people guessing across the country.\n\nAnd actress Lindsay Lohan has loved every minute of her time on The Masked Singer.\n\nOn Friday, the 33-year-old told Hughesy & Kate she had 'so much fun' in fact, she considers her fellow judges Jackie 'O' Henderson, Dannii Minogue, Dave Hughes and host Osher Gunsberg 'family'.\n\n'We're family!' Lindsay Lohan (pictured) told the Hughesy & Kate radio show that The Masked Singer was 'so much fun' ahead of Monday night's season finale\n\n'We're family, we're all on a group chat, we're all friends,' said Lindsay, dispelling rumours of on-set rifts once and for all.\n\n'I think that's the beauty of something like [The Masked Singer],' she added.\n\n'We all stay in touch, and I think that's so important because when you do movies, people fall out of touch - and that's sad really.'\n\nAwesome foursome: 'We all stay in touch, and I think that's so important because when you do movies, people fall out of touch - and that's sad really,' said Lindsay of The Masked Singer cast. Pictured (left to right) Jackie 'O' Henderson, Dannii Minogue and Dave Hughes\n\nThe Mean Girls star also confirmed that she has signed on the dotted line for the second season of The Masked Singer, set to air in 2020.\n\n'I'm excited,' she squealed to Hughesy & Kate.\n\nMeanwhile, there are three stars left to be unmasked on the ratings hit - the Monster, the Robot and the Wolf.\n\nMost fans are convinced the Wolf is musical theatre star Rob Mills.\n\nAll the clues for the Robot appear to point towards Cody Simpson, who is currently involved in a steamy relationship with Miley Cyrus.\n\nThe Project's Gorgi Coghlan is believed to be the Monster.\n\nThe Masked Singer Australia finale airs Monday at 7.30pm on Channel 10", "description": "It's the ratings juggernaut that's had people guessing across the country.", "authors": ["Shannon Shipley For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/15/19888090-0-image-a-3_1571409445592.jpg", "published_at": "2019-10-18"}