{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/visiting-giethoorn-car-free-village-netherlands-tarnished-2019-9", "downloaded_at": "2019-09-27 16:29:35.273362+00:00", "title": "A picturesque car-free village in the Netherlands is being overrun by tourists and 'nuisance perpetrators'", "language": "en", "text": "Giethoorn is a car-free village in the Netherlands, about 75 miles from Amsterdam.\n\nThe main form of transportation is by bicycle or foot on the roughly 180 wooden foot arch bridges, or by boat on the over 55 miles of canals, according to Condé Nast Traveler.\n\nSome residents, however, have been complaining about an onslaught of tourists that has been damaging bridges and private property and causing traffic in the otherwise picturesque canals.\n\nVisit BusinessInsider.com for more stories.\n\nGiethoorn is a picturesque, idyllic car-free village in the Netherlands that looks as if it's straight out of a storybook.\n\nThe village, about 75 miles from Amsterdam, doesn't have any roads, which means tourists and its roughly 2,600 residents can get around only by bicycle, foot, or boat, according to National Geographic and World Atlas.\n\nTourists have the option to rent boats and explore the waterways. Locals of the \"Venice of the Netherlands,\" however, have had complaints about the tourists and their behavior in the village. The residents even wrote a letter to the municipal council demanding immediate action against \"nuisance perpetrators in the picturesque canals,\" the regional publication RTV Oost reported.\n\nRead more: VP Mike Pence caused outrage by driving his motorcade through a car-free pristine vacation destination island — here's what happened\n\nTourists have been accused of sailing too fast, some under the influence of alcohol and others without proper permits. Other boat renters have been too young or sailing in the wrong direction.\n\n\"Because water safety is at stake and because the municipality simply has a duty to act when someone breaks the rules,\" the residents wrote in the letter.\n\nThe village started repairing damaged bridges in May, RTV Oost reported, and all homeowners who owned bridges along the parts of the canals frequented by tourists were eligible for collision protection.\n\nTake a look at the one peaceful, but now overcrowded, canals:", "description": "Giethoorn, a car-free village just 75 miles from Amsterdam that has canals instead of street roads, has been facing issues with tourists.", "authors": ["Brittany Chang"], "top_image": "https://image.businessinsider.com/5d8cc9022e22af599202b313?width=1200&format=jpeg", "published_at": "2019-09-27"}