{"pub": "yahoo", "url": "https://sports.yahoo.com/cardinals-wainwright-face-braves-game-3-nlds-203255158--mlb.html", "downloaded_at": "2019-10-05 22:47:35.040425+00:00", "title": "Cardinals' Wainwright to face Braves in Game 3 of NLDS", "language": "en", "text": "Cardinals' Wainwright to face Braves in Game 3 of NLDS Atlanta Braves manager Brian Snitker speaks during a baseball news conference Saturday, Oct. 5, 2019, in St. Louis. The St. Louis Cardinals and Braves are scheduled to play Game 3 of the National League Division Series on Sunday in St. Louis. (AP Photo/Jeff Roberson)\n\nST. LOUIS (AP) -- When October baseball returns to St. Louis on Sunday, Adam Wainwright will get the ball for the Cardinals again. Just like he has for so many big games over the past 14 years.\n\nIt was almost a much different picture. If not for one December trade back in 2003, Wainwright might be pitching for Atlanta in Game 3 of the NL Division Series.\n\nThe 38-year-old Georgia native, who was selected by Atlanta in the first round of the 2000 amateur draft, will make his 13th postseason start when the Cardinals take on Mike Soroka and the Braves in the first postseason game in St. Louis in four years.\n\nScroll to continue with content Ad\n\n''Feeling that playoff buzz in the crowd when the games are actually going on, you can never replace it or replicate it any other place in life that I've seen,'' he said. ''It's just a feeling that is beyond compare. So I'm looking forward to it. I'm excited to be back in the playoffs.''\n\nThe NL East and Central champions split the first two games of the best-of-five series in Atlanta. Paul Goldschmidt homered to help St. Louis rally for a 7-6 victory in the opener, and Mike Foltynewicz pitched seven sparkling innings in Atlanta's 3-0 win in Game 2.\n\nTwo days after Foltynewicz's dominant performance, Soroka takes the mound for the Braves. St. Louis, a regular October playground before its longest drought in two decades, might not seem like the best spot for a playoff debut, but Soroka is no ordinary pitcher.\n\nThe 22-year-old right-hander went 7-1 with a 1.55 ERA in 16 road starts this year, compared with 6-3 and a 4.14 ERA at home. He allowed one earned run in 13 innings in two May starts against the Cardinals, including six effective innings in a no-decision at Busch Stadium.\n\nStory continues\n\n''He's really good at staying pitch to pitch,'' Braves manager Brian Snitker said Saturday. ''It's like he's winning the battle, the small battles within a game, pitch to pitch, hitter to hitter, inning to inning.\n\n''I think he understands that when he gets in trouble that he has something - he's a pitch away from getting out of trouble.''\n\nSoroka said he isn't sure why he has been so good on the road this year compared with at home, but growing up in Canada could be a factor.\n\n''Every important game I would have pitched in would have been either not in Calgary, not even in Canada, usually in another country - Pan Ams in Mexico, games in Cuba, all that kind of stuff,'' he said.\n\n''I think maybe I just got used to being in unfamiliar places and that's when I found I loved to play.''\n\nSoroka was 9 when Wainwright made his postseason debut in 2006, helping St. Louis win the World Series for the first time in 24 years. The 6-foot-7 right-hander has been versatile in the playoffs, going 4-4 with a 3.03 ERA and four saves in 24 appearances.\n\n''He's a ferocious competitor,'' Cardinals manager Mike Shildt said.\n\nFor a long time, Wainwright was hoping to pitch in big games for Atlanta. He was a prep star in Brunswick, Georgia, when he was drafted by the Braves with the 29th overall pick in 2000.\n\nHe had just finished a solid season playing for Snitker at Double-A Greenville when he was shipped off to St. Louis with Jason Marquis and Ray King for J.D. Drew and Eli Marrero.\n\n''When we had him he was a young guy,'' Snitker said. ''You saw great potential. You hated to lose him. I remember when we traded him and I called him.\n\n''But you saw - and I realize - you realized at the time you've got to give up something to get something. And it's just been really cool to see how he's developed, his career, following him.''\n\nDrew hit .305 with 31 homers in his only season with Atlanta, but the Braves were eliminated by the Astros in the first round of the 2004 playoffs - part of a streak of nine straight playoff series losses that is one away from the Cubs' record for postseason futility.\n\nWhile Drew, Marrero, Marquis and King played for multiple teams after the trade, Wainwright never left St. Louis. He ranks fourth on the franchise list with 162 career wins, just one back of Bob Forsch.\n\nHe was limited to eight starts last season because of hamstring and elbow problems, but he decided to keep playing and signed a one-year deal last October. Healthy again, he went 14-10 with a 4.19 ERA in 31 starts this year.\n\n''I always tell these guys, old players means good players,'' Wainwright said. ''You don't get to be an old player if you're not a good player.''\n\n---\n\nJay Cohen can be reached at https://twitter.com/jcohenap\n\n---\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP-Sports", "description": "When October baseball returns to St. Louis on Sunday, Adam Wainwright will get the ball for the Cardinals again.  If not for one December trade back in 2003, Wainwright might be pitching for Atlanta in Game 3 of the NL Division Series.  The 38-year-old Georgia native, who was selected by Atlanta in the", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/I9kffBlVIQMRFHw0_hlo_g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMjQ7aD02ODI-/https://s.yimg.com/uu/api/res/1.2/5AeA83AdYZPOKfWcWcoNxw--~B/aD0zNDE7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201910051316477870676", "published_at": "2019-10-05"}