{"pub": "yahoo", "url": "https://news.yahoo.com/giuliani-refuses-comply-impeachment-subpoena-202829867.html", "downloaded_at": "2019-10-16 23:23:50.113062+00:00", "title": "Giuliani refuses to comply with impeachment subpoena as attorney steps down: ‘I don’t need a lawyer’", "language": "en", "text": "Rudy Giuliani has said he will not co-operate with an impeachment inquiry against Donald Trump and insisted he did not need a lawyer following the arrest of two business associates accused of campaign finance violations.\n\nThe president’s personal attorney posted a letter on Twitter to the House permanent select committee on intelligence in which his lawyer wrote: “Please accept this response as formal notice that Mr Giuliani will not participate because this appears to be an unconstitutional, baseless and illegitimate ‘impeachment inquiry.’”\n\nThe attorney to Mr Giuliani — who was subpoenaed by Congress over documents related to the impeachment inquiry — said the subpoena was “overbroad, unduly burdensome, and seeks documents beyond the scope of legitimate inquiry” in the letter dated 15 October.\n\nIn his tweet posted on Tuesday afternoon, Mr Giuliani also announced his own lawyer, Jon Sale, would no longer represent him.\n\nMr Giuliani described Mr Sale — who he reportedly hired just 14 days ago — as a “lifelong friend” who represented him “for the sole purpose of analysing the request and responding.”\n\nI will not participate in an illegitimate, unconstitutional, and baseless “impeachment inquiry.”\n\n\n\nJon Sale, who is a lifelong friend, has represented me for the sole purpose of analyzing the request and responding. At this time, I do not need a lawyer. pic.twitter.com/l0IR0ikEHD — Rudy Giuliani (@RudyGiuliani) October 15, 2019\n\n“At this time, I do not need a lawyer,” he added.\n\nMr Giuliani’s letter comes on the day of the deadline for him to comply with the congressional subpoena sent by three House committees spearheading the impeachment inquiry into Mr Trump.\n\nDemocrats on Capitol Hill say Mr Giuliani was seeking foreign dirt on Mr Trump’s 2020 political rival Joe Biden in Ukraine. The president had a 25 July phone call with Ukrainian President Volodymyr Zelensky in which he asked for a “favour” and then urged Mr Zelensky to launch an investigation into Mr Biden and his son, Hunter, who worked for a Ukrainian energy firm.\n\nThere has so far been no evidence of illegal wrongdoing by either of the Bidens. Mr Giuliani, meanwhile, is under increasing scrutiny among federal prosecutors over accusations of illegal lobbying in another country without registering as a foreign agent.\n\nExperts previously told The Independent in July that Mr Giuliani must register as a foreign agent for his overseas work. Mr Giuliani has denied the allegations.\n\nIt remains unclear what could happen next, though Mr Giuliani will almost certainly require legal representation if the House committees seek to enforce their subpoena against him.\n\nThe former New York City mayor, who ran a failed presidential campaign in 2008, told ABC News “we will see what happens” if the House decides to enforce the subpoena.\n\nEPA More\n\nRead more\n\nRudy Giuliani needs to register as foreign agent, experts say", "description": "Rudy Giuliani has said he will not co-operate with an impeachment inquiry against Donald Trump and insisted he did not need a lawyer following the arrest of two business associates accused of campaign finance violations.The president’s personal attorney posted a letter on Twitter to the House permanent", "authors": ["Chris Riotta"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ipYy.oGWqFgJsGg1_eiazA--~B/dz0wO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_independent_635/598ba3001cd4d8c3b54de301abc84ee6", "published_at": "2019-10-15"}