{"pub": "marketwatch", "url": "https://marketwatch.com/story/this-low-volatility-dividend-stock-strategy-can-give-you-peace-of-mind-2019-09-09", "downloaded_at": "2019-09-09 23:18:01.413214+00:00", "title": "This low-volatility dividend-stock strategy can give you peace of mind", "language": "en", "text": "(This is the fifth article in a series about dividend stocks in today’s low interest-rate environment based on interviews with professional investors. Links to the previous articles are below.)\n\nInvestors who want to follow a dividend strategy but are worried about a decline in stock prices may be well-served by a low-volatility fund.\n\n“Investors tend to panic when volatility rises,” said Mike LaBella, head of global equity strategy at QS Investors, which manages the Legg Mason Low Volatility High Dividend ETF LVHD, +0.21%. “They tend to sell, which is the worst thing to do.”\n\nThe Legg Mason Low Volatility High Dividend ETF is appropriate for investors who are relatively conservative, LaBella said.\n\nQS Investors is based in New York and has about $20 billion in assets under management.\n\nThe Legg Mason Low Volatility High Dividend ETF quotes a 30-day yield of 3.50%, and its portfolio yield, based on the past 12 months of quarterly dividends, has been 3.69%, according to Morningstar. The ETF pays out all the dividends it receives, and its yield typically ranges between 3.5% and 4%, LaBella said. (Please see funds with similar strategies in the tables, below.)\n\nThat is an attractive range when you consider 10-year U.S. Treasury notes TMUBMUSD10Y, +5.18% are yielding 1.62% and 30-year Treasury bonds TMUBMUSD30Y, +4.83% have a yield of only 2.10%.\n\nThe Legg Mason ETF is made up of 79 stocks screened from the Solactive U.S. Broad Market Index. The index includes about 3,000 stocks of U.S. and foreign companies that have primary listings in the U.S. or American depositary receipts (ADRs).\n\nThe QS Investors team screens the stocks to arrive at a list of 50 to 100 companies that have been consistently high dividend payers, while making sure the payouts don’t exceed earnings, or, in the case of real-estate investment trusts, cash flow. They look ahead, using consensus estimates, to try to screen out companies facing problems. The portfolio is rebalanced quarterly. Stocks with the highest scores take a 2.5% portfolio allocation, while the ETF limits exposure to a stock sector to 25% and limits the exposure to REITs to 15%.\n\n“Just by looking at the first couple of screens, we might have very profitable companies with high dividends that are facing disruption,” LaBella said during an interview.\n\nQS Investors Mike LaBella, head of global equity strategy at QS Investors and co-manager of the Legg Mason Low Volatility High Dividend ETF.\n\nLaBella said an example of the results of the screening is General Electric GE, +2.87%, which “pretty much cut its dividend out of nowhere, if you only looked at their balance sheet and historical earnings profile” in November 2017.\n\nBut in the months before the dividend cut, the ETF didn’t increase its holdings as it ordinarily would have when the stock price fell, because of the increased price and earnings volatility indicated by revisions to analysts’ estimates.\n\nThe ETF sold its shares of GE following the dividend cut, but LaBella said it saved “a significant amount of capital,” because it had not loaded up before the cut, and because it avoided continuing declines after selling the shares.\n\nA one-year volatility review\n\nThe end of this month marks the one-year anniversary of the start of a brutal 19% decline for the S&P 500 SPX, -0.01% that ran through Dec. 24.\n\nThere are always concerns over the economy. When will the current expansion end? How aggressive will the Federal Reserve be with its monetary policy? But investors now have structural worries — will Brexit take place? How much will the disruption to the U.K. and eurozone economies, which are already weak, affect the U.S. stock market? How radical will the transformation of world trade relationships be in the event of a yearslong trade dispute between the U.S. and China?\n\nIt’s worth pointing out that despite all the headlines about a strong U.S. stock market this year, with the S&P 500 returning 20.5% through Sept. 6 (with dividends reinvested), the benchmark index has returned only 5.8% over the past 12 months.\n\nHere’s a comparison of total returns for the Legg Mason Low Volatility High Dividend ETF and the S&P 500 Index over the past year:\n\nFactSet\n\nDuring the S&P 500’s 19% drop (with dividends reinvested) from Sept. 28 through the close on Dec. 24, 2018, the ETF was down only 9%, and its 12-month return has been significantly higher than that of the index.\n\nTop holdings\n\nHere are the 20 largest holdings of the Legg Mason Low Volatility High Dividend ETF as of the close on Sept. 6:\n\nOther dividend-stock ETFs designed for low volatility\n\nHere’s a list of low-volatility dividend-stock ETFs, starting with the Legg Mason Low Volatility High Dividend ETF, with the rest sorted alphabetically:\n\nDividend yields are net of expenses.\n\nHere’s the same group with additional information:\n\nThe only ETF on the list that has been around for at least five years is the Invesco S&P 500 High Dividend Low Volatility ETF SPHD, +1.66%, which was established in 2012. Its five-year total return (with dividends reinvested) of 60% compares with a return of 64% for its benchmark index, the S&P 500. SPHD’s monthly price volatility (standard deviation) for five years has been 3.07, according to FactSet, compared with 3.49 for the ProShares S&P 500 Dividend Aristocrats ETF NOBL, +0.06%.\n\nMore about dividend stocks in a world of low interest rates:\n\n• 25 dividend stocks selected for value by an outperforming money manager\n\n• This dividend-stock strategy is for investors who want an attractive monthly income stream\n\n• Seeking attractive dividend stocks? Here’s how to avoid dogs\n\n• 3 dividend stock picks with yields as high as 12% from a manager who doesn’t focus on dividends\n\n• This ‘resilient’ dividend stock strategy can limit risks to your portfolio\n\nCreate an email alert for Philip van Doorn’s Deep Dive columns here.", "description": "A stable yield and price stability might ease your fear of a recession and economic threats.", "authors": ["Philip Van Doorn", "Investing Columnist"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ936_UPS_20_ZG_20190909113929.jpg", "published_at": "2019-09-09"}