{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/News/refrigerator-saved-lives-family-rebuilds-fallen-tree-decimates/story?id=66490254", "downloaded_at": "2019-10-24 14:09:10.897312+00:00", "title": "'That refrigerator saved our lives': Family rebuilds after fallen tree decimates their home", "language": "en", "text": "It was a freak accident that happened in the blink of an eye for sisters Mariah and Ashley Stone in Lusby, Maryland.\n\n“It sounded like an earthquake,” said 15-year-old Ashley. \"It’s definitely a sound that I think for both of us, we’ll never forget.”\n\nIt was an afternoon just like any other. Mariah and Ashley were home alone from school and watching television with their dog, when a tree suddenly crashed through the roof of their family home last Thursday.\n\n“Everything fell on top of us, between the tree and insulation and the ceiling,” said Ashley.\n\nCourtesy Jenn Stone\n\nCourtesy Jenn Stone\n\nA tree outside their home had completely uprooted from the ground and fell directly on the Stone’s home.\n\nA video captured on the family’s Ring security camera in their living room shows the terrifying moment that the tree came crashing through their home. Ashley and Mariah could be heard frantically screaming.\n\nIn the camera footage, one of the sisters -- who immediately called their parents after realizing what had happened -- cries on the phone, “A tree just fell on the house!”\n\nCourtesy Jenn Stone\n\nCourtesy Jenn Stone\n\n“I’ve never experienced anything like this,” said their father, Francis Stone. “I don’t wish this on nobody, just the mental part of it all -- it’s very draining and I’m at a loss.”\n\nStone, who was at work when the accident happened, said he accessed the Ring camera and saw that there was nothing left of his home.\n\nLuckily, both his daughters miraculously escaped with minor injuries -- and when Stone saw the damage for himself, he realized it could have been worse.\n\n“I opened the door, that was what broke me down,” Stone said. “It was pretty bad because I realize how lucky my daughters were.”\n\nThe family of four is now thanking one special home appliance for breaking the tree’s fall: their refrigerator.\n\nCourtesy Jenn Stone\n\n“If that fridge wasn’t there -- who knows what would have happened,” said Ashley. “The situation could’ve been completely different.”\n\nHer sister Mariah, 14, added, “That refrigerator saved our lives.”\n\nDespite the structural damage to their home and the mental toll that the event has taken on the family, the teens' father is proud of how they were able to overcome the situation as a family.\n\n“After everything and seeing everything, the girls did a great job, they looked out for each other,” said Stone. “They looked out for our other family member too, which was our dog.”\n\n“We’re gonna find a way to come out of this stronger and better,” he added.", "description": "A family in Lusby, Maryland, has a refrigerator to thank for saving their daughters' lives when a tree decimated their home last week.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/house-tree-collapse-ht-aa-191023_hpMain_16x9_992.jpg", "published_at": "2019-10-24"}