{"pub": "cnbc", "url": "https://cnbc.com/2019/09/26/patriot-missile-system-to-saudi-arabia-after-iran-oil-attacks.html", "downloaded_at": "2019-09-26 20:54:26.492974+00:00", "title": "Pentagon to deploy Patriot missile system to Saudi Arabia after Iran oil attacks", "language": "en", "text": "U.S. Soldiers talk after a routine inspection of a Patriot missile battery at a Turkish military base in Gaziantep, Turkey.\n\nWASHINGTON — The Pentagon on Thursday announced that the U.S. will send a Patriot missile battery, radars and roughly 200 support personnel to Saudi Arabia in the wake of the attacks on its oil facilities earlier this month.\n\nDefense Secretary Mark Esper has \"approved putting additional forces on prepare to deploy orders,\" Pentagon spokesman Jonathan Hoffman wrote in a statement. \"While no decision has been made to deploy these additional forces, they will maintain a heightened state of readiness.\"\n\nThose additional forces include two Patriot missile artillery batteries and one Terminal High Altitude Area Defense, or THAAD missile defense system.\n\nTHAAD, one of the world's most advanced missile systems, can target incoming missiles and blast them out of the sky. THAAD interceptors, fired from a truck-based launcher, use kinetic energy to deliver \"hit to kill\" strikes to ballistic threats.\n\n\"It is important to note these steps are a demonstration of our commitment to regional partners, and the security and stability in the Middle East. Other countries have called out Iranian misadventures in the region, and we look for them to reinforce Saudi Arabia's defense,\" Hoffman wrote.\n\nPresident Donald Trump slammed Iran's alleged role in the attacks on Saudi oil facilities, telling world leaders at the U.N. General Assembly on Tuesday that they should pressure Tehran into diplomatic talks.\n\n\"All nations have a duty to act,\" Trump said regarding his call to counter Iranian behavior. \"No responsible government should subsidize Iran's bloodlust. As long as Iran's menacing behavior continues, sanctions will not be lifted, they will be tightened.\"\n\nThe Sept. 14 strikes on the world's largest crude-processing plant and oil field forced Saudi Arabia to shut down half of its production operations. The drone attacks triggered the largest spike in crude prices in decades and renewed concerns of a budding conflict in the Middle East. While Tehran has been widely blamed for the attacks, it maintains that it was not involved.\n\nKevin Breuninger contributed to this report from CNBC's global headquarters in Englewood Cliffs, New Jersey.", "description": "The Pentagon announced that the U.S. will send a Patriot missile battery, radars and roughly 200 support personnel to Saudi Arabia in the wake of the attacks on its oil facilities earlier this month.", "authors": ["Amanda Macias"], "top_image": "https://image.cnbcfm.com/api/v1/image/105715301-154904232015910175118735_30b29fa147_k.jpg?v=1549042433", "published_at": "2019-09-26"}