{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/jake-matthews-safe-ufc-243-melbourne-wants-carlos-condit-next-video", "downloaded_at": "2019-10-07 00:20:12.704695+00:00", "title": "Jake Matthews played it safe at UFC 243, but wants Carlos Condit next", "language": "en", "text": "MELBOURNE, Australia – Jake Matthews beat Rostem Akman with a unanimous decision Saturday (Sunday locally) to close out the preliminary card at UFC 243 at Marvel Stadium in Melbourne, Australia.\n\nTake a look inside the fight with Matthews, who got back in the win column in front of his home fans and has victories in four of his past five fights.\n\nResult: Jake Matthews def. Rostem Akman via unanimous decision (30-27, 30-27, 30-27)\n\nUpdated records: Matthews (15-4 MMA, 8-4 UFC), Akman (6-2 MMA, 0-2 UFC)\n\nKey stat: Matthews landed four times as many strikes as Akman, who hit just 14 percent of what he threw.\n\nMatthews on the fight’s key moment\n\n“The game plan was to take him down. I heard the announcer say he was a good striker, so I decided to strike with him. That’s how Aussies do it.”\n\nMatthews on fans thinking he played it safe\n\n“It’s hard for the fans to understand, but if he was a top-10 fighter, I would have swung for the fences. This was a very dangerous fight for me. He’s a relative newcomer and I’ve been here for 12 fights. I had to show that maturity and experience. I felt completely in control. Most of my fights are a blur, but this one I was aware of everything going on. I’m very happy with that. I got the win, which is the main thing.”\n\nMatthews on what he wants next\n\n“I asked for Carlos Condit this fight, but I know he’s fighting Mickey Gall next. So once Carlos is done smashing Mickey, I’d like to have that legend fight.”\n\nTo hear more from Matthews, check out the video of the full post-fight interview above.\n\nGallery Jake Matthews def. Rostem Akman at UFC 243: Best photos view 7 images", "description": "Take a look inside Jake Matthews' win over Rostem Akman at UFC 243 at Marvel Stadium in Melbourne, Australia.", "authors": ["Matt Erickson", "Ken Hathaway", "Blue Corner", "Mma Junkie Staff", "Mike Bohn", "Abbey Subhan", "John Morgan", "Simon Head"], "top_image": "https://usatmmajunkie.files.wordpress.com/2019/10/jake-matthews-ufc-243-post-fight.jpg?w=1000&h=576&crop=1", "published_at": "2019-10-06"}