{"pub": "arynews", "url": "https://arysports.tv/barcas-messi-receives-record-sixth-european-golden-shoe", "downloaded_at": "2019-10-16 20:46:16.222888+00:00", "title": "Barca’s Messi receives record sixth European Golden Shoe", "language": "en", "text": "BARCELONA: Barcelona forward Lionel Messi picked up a record-extending sixth – and third consecutive – European Golden Shoe award on Wednesday following his outstanding individual 2018-19 domestic campaign.\n\nThe award is presented to the top goalscorer in league football across Europe, with the Argentine finding the net 36 times last season as Barca retained their La Liga title.\n\nMessi was three ahead of nearest rival Kylian Mbappe, who scored 33 times for Paris St Germain as they won France’s Ligue 1.\n\n“My team and my teammates, I would have never been able to win even one of these awards without them,” Messi said at the presentation in Barcelona. “This is a recognition for everyone, all the team.”\n\nThe forward, who won his first Golden Shoe in 2010, admitted he was disappointed to have missed out on Champions League glory again after Barcelona blew a 3-0 first leg lead to Liverpool at the semi-final stage. However, he said he was conscious that the league should be the club’s priority.\n\n“The Champions League is something special and we all want to win it, but we are conscious that the Liga is the most important.\n\n“La Liga can help you reach the Champions League and the Copa del Rey. It is very difficult if you don’t perform well in the Liga to compete in the Champions League.\n\n“We never forget about the Liga and the Copa because we are Barcelona and we always aim to win everything.”\n\nBarca have endured a difficult start to the season, losing twice in their first eight league games. They have won their last three matches to pull themselves into second place on 16 points, two behind leaders Real Madrid.\n\nComments\n\ncomments", "description": "Barcelona forward Lionel Messi picked up a record-extending sixth - and third consecutive - European Golden Shoe award on Wednesday following his outstanding individual 2018-19 domestic campaign.", "authors": [], "top_image": "https://arysports.tv/wp-content/uploads/2019/10/Messi.jpg", "published_at": "2019-10-16"}