{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7623501/Eddie-Jones-insists-new-boy-Ben-Spencer-ready-Rugby-World-Cup-final-against-South-Africa.html", "downloaded_at": "2019-10-29 14:26:39.929581+00:00", "title": "Eddie Jones insists new boy Ben Spencer is ready for Rugby World Cup final against South Africa", "language": "en", "text": "Eddie Jones chuckled on Monday as he greeted Ben Spencer to England’s team hotel with a pat on the back and an arm around the shoulder.\n\n‘Remember… Stephen Donald!’\n\nIt was a reference to the fly-half who, in 2011, was drafted into the All Blacks team for the World Cup final after injuries to Dan Carter, Colin Slade and Aaron Cruden.\n\nBen Spencer flew from Heathrow on Monday to step in for injured scrum-half Willi Heinz\n\nDonald was overweight and on a whitebait fishing trip when he received the phone call from coach Sir Graham Henry, before he kicked the decisive penalty and lifted the Webb Ellis Cup.\n\nNow Spencer has a similar shot at stardom, having flown from Heathrow on Monday to step in for injured scrum-half Willi Heinz. He will have a four-day crash-course before Saturday’s final against the Springboks and, as one of two No 9s, will start on the bench.\n\n‘He’ll have a shirt that fits him, so that’s one significant difference, and he hasn’t been whitebait fishing, so that’s another!’ said Jones. ‘It’s a great opportunity for the kid. He’s excited about it.\n\n‘He’s been in and around the squad for the last couple of years so he knows the game, he knows the players. He is a fit guy and he’s keen to rip in straight away. That’s what you want. We always said to those guys outside the 31 that they need to be ready — and he is ready to go.’\n\nEddie Jones chuckled on Monday as he greeted Spencer to England’s team hotel\n\nStephen Donald (right) got the late call for New Zealand and helped them win the World Cup\n\nSpencer was set to play in the Premiership for Saracens when he got the call over the weekend. The 27-year-old only has three caps but Danny Care, England’s most experienced back-up, lost his place before suffering an injury.\n\nIt is a cruel blow for Heinz, who has offered to remain in Japan to help the team prepare.\n\n‘Willi wanted to stay and we wanted him to stay,’ said Jones. ‘It’s like when you want to get married — if the lady wants to marry you and you offer to marry, then it’s a pretty easy conversation.\n\n‘It’s been tough for Willi. He was in tears in the dressing room but he’s now collected himself and he’s got another role to play. He’s already started mentoring Ben.’\n\nSpencer will play second fiddle to Ben Youngs, with England preparing to face one of the world’s best in Faf de Klerk. Both players have faced him in the Premiership, where he plays for Sale, but now the stakes are significantly higher.\n\n‘He’s a busy nine,’ said Youngs. ‘He likes confrontation, getting in your face in defence. A huge amount goes through him in terms of his kicking game, so he’ll be pretty pivotal to how South Africa play.\n\n‘I’ve had a good few practices over the last few weeks against Will Genia and Aaron Smith and the weekend will be no different with the opportunity to play against Faf. It’s one we’re all relishing.’", "description": "NIK SIMON IN TOKYO: Eddie Jones chuckled on Monday as he greeted Ben Spencer to England's team hotel with a pat on the back and an arm around the shoulder.", "authors": ["Nik Simon For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/20/20297358-0-image-a-6_1572295799656.jpg", "published_at": "2019-10-28"}