{"pub": "nytimes", "url": "https://nytimes.com/2019/10/28/opinion/sleep-disorder.html", "downloaded_at": "2019-10-28 13:22:23.535089+00:00", "title": "Opinion | Early to Bed, Early to Rise, Makes Me Diabetic, Depressed and Sick", "language": "en", "text": "This happens because, even if we force ourselves to wake up early, our metabolism is not ready to perform simple tasks such as properly digesting a meal, for example — we do not produce as much insulin in the morning as normal people do. Our core body temperature also follows an internal rhythm, producing sleepiness or alertness much later. This is true as well for the release of cortisol, melatonin and other hormones essential to the sleep-wake cycle. In the morning, our eyes might be open, but, for all intents and purposes, we are still sleeping.\n\nAnd it’s no use getting exhausted and deliberately “undersleeping” with the intention of falling asleep early the next day — a recommendation I’ve heard a lot, including from doctors. Circadian rhythms operate independently of the sleep-pressure system. This is the case even among “normal” people: Even if you slept miserably last night and woke up very early, it is unlikely that you’ll fall asleep at 6 p.m.; that’s because your circadian rhythms are cycling on as usual, unaffected by your lack of sleep. Your attempt to hit the sack would clash with something called the “wake-maintenance zone,” a three- to four-hour interval of maximum physiological alertness. (In normal sleepers, it occurs from 6 p.m. to 9 p.m.)\n\nDelayed sleep phase syndrome has a genetic basis, as my own unscientific sample demonstrates: My mom also has it, though her case is not so extreme. Apart from that, other mechanisms can account for the disorder. Some studies indicate that our built-in circadian period might be unusually long (say, 25 hours instead of 24); others find dysfunction in our homeostatic sleep drive, a reduced response to the phase-resetting effects of daylight, or an excessive response to the sleep-delaying effects of artificial evening light. There is, as of yet, no cure — only short-term fixes that include the use of a light therapy box and the administration of well-timed melatonin pills. But in the long run, most of us fail to adapt.\n\nHere’s the thing, though. If left to our own devices — if allowed to follow our own biological clocks — we sleep just fine.\n\nIndividuals with extreme cases of the syndrome are unable to work conventional jobs. We are also famously unreliable at keeping appointments and participating in diurnal social activities. We learn to make excuses and tell lies. I often say that I work nights, which is true — it’s just not the whole story. Most people respect work-related excuses, but sneer at health conditions they’ve never heard of.\n\nThat’s the worst thing about having a circadian rhythm disorder: living in a society that places a moral value on the time your alarm clock goes off. Most cultures emphatically equate early rising with righteousness: As we say in Brazil, “God helps those who wake up early.”\n\nBut we late risers are fighting back. In fact, we’ve been plotting while you sleep. For a while now, we’ve been gathering on mailing lists and in online support groups. We share specialists’ names, and new lines of treatment and research; we discuss mandatory accommodations and disability pensions.", "description": "What it’s like living with a chronic circadian rhythm problem.", "authors": ["Vanessa Barbara"], "top_image": "https://static01.nyt.com/images/2019/10/28/opinion/28barbara/28barbara-facebookJumbo.jpg", "published_at": "2019-10-28"}