{"pub": "breitbart", "url": "https://breitbart.com/national-security/2019/10/21/11-killed-chile-riots-triggered-proposed-subway-fare-hike", "downloaded_at": "2019-10-22 13:31:08.073749+00:00", "title": "11 Killed in Chile as Leftist Protesters Turn to Violence", "language": "en", "text": "At least 11 people have died during violent riots in Chile this weekend following huge anti-government demonstrations that initially began in opposition to a four percent rise in subway fares.\n\nAt least 1,554 were arrested as the government deployed over 10,000 troops to control the widespread demonstrations, according to official government statistics. There were also 40 reported outbreaks of looting, while Governor of Santiago Karla Rubilar confirmed that 11 people had died as a result of the violence.\n\nThe demonstrations broke out early last week as a student revolt against a three percent increase in metro fares, with participants storming metro stations as part of a fare-dodging movement. On Friday, the situation escalated after protesters torched at least a dozen stations, causing an estimated $300m (£230m) of damage.\n\nChile declared a state of emergency after protests over a tax on subways grew to include anger over living costs and inequality. Security forces fired tear gas and arrested 1,400+ people. At least 11 people have died, and schools and shops are closed. pic.twitter.com/GVXigtBC1u — AJ+ (@ajplus) October 21, 2019\n\nOn Sunday evening, Chile’s center-right President Sebastián Piñera confirmed that he had scrapped plans to raise the cost of subway fairs but criticized the violent demonstrations, declaring that the country was at “war with a powerful and uncompromising enemy that respects nothing and no one.”\n\n“I have listened humbly to the voice of the people and I will not be afraid to continue doing so, because that is how democracies are built,” he wrote on Twitter. “I have decided to suspend the rise of the subway, which will require the rapid approval of a law until we agree on a system that best protects our countrymen.”\n\n“Everyone has the right to demonstrate peacefully and solidarity with reasons they have to do so,” he continued. “But no one can threaten the safety of any compatriot. Only together will we be able to protect and preserve our democracy. Let’s take care of our families and take care of our country.”\n\nThe unrest is the worst the country has faced since the final weeks of Augusto Pinochet’s military junta, indicating a deep-rooted resentment over economic inequality, despite Chile being known as the most prosperous and stable country in Latin America.\n\n“Something deep is happening in Chile,” political analyst Marta Lagos told the Financial Times. “A huge portion of Chile’s population felt left behind. This is not just a bunch of violent kids, it’s much more than that. This is just the tip of the iceberg. That produces a very volatile situation that everyone was ignoring.”\n\nThe protests come after less than two weeks after similar demonstrations broke out in the Ecuadorian capital of Quito and its largest city Guayaquil after President Lenín Moreno announced an end to a decades-old gasoline subsidy introduced under Rafael Correa’s former socialist administrations.\n\nAs part of the pushback, leftist groups began burning roadblocks and looting businesses throughout the country to pressure the government into scrapping the policy, which they eventually did.\n\nFollow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.", "description": "At least 11 people died while a state of emergency has been declared across parts of Chile following huge anti-government demonstrations.", "authors": ["Ben Kew"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-1177480157-640x335.png", "published_at": "2019-10-21"}