{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/30/report-spygate-prosecutor-very-interested-in-interviewing-john-brennan-james-clapper", "downloaded_at": "2019-10-30 16:06:47.276507+00:00", "title": "Report: Spygate Prosecutor 'Interested' in Interviewing Brennan, Clapper", "language": "en", "text": "The prosecutor leading the Department of Justice’s criminal investigation into the agency’s Trump-Russia probe has former intelligence officials John Brennan and James Clapper in his crosshairs, according to a Wednesday report.\n\nAppointed by Attorney General William Barr, U.S. Attorney of Connecticut John Durham has for months examined what prompted the federal government to launch a counterintelligence investigation into the 2016 Trump campaign and whether the surveillance methods deployed during the probe were legal.\n\nAccording to Fox News, Durham is “very interested” in interviewing former CIA Director John Brennan and former Director of National Intelligence James Clapper as part of his sweeping probe. “According to a source familiar with the situation, Brennan has received word from his attorney that he may be contacted by Durham’s office, but Clapper has received no such communication at this time,” reporter Brooke Singman writes.\n\nThe report comes days after the New York Times revealed the Justice Department administrative review of the Trump-Russia probe had morphed into a criminal inquiry, which enables Durham to subpoena witnesses for testimony and documents. It also authorizes the prosecutor to impanel a grand jury and to file charges.\n\nThe report also coincides with speculation that Justice Department Inspector General Michael Horowitz will soon release his report on alleged Foreign Intelligence Surveillance Act (FISA) abuses during the Trump-Russia. A source told Fox News that Horowitz’s report will “shed light on why Durham’s investigation has become a criminal inquiry.” A reported flashpoint in Durham’s investigation is whether the FBI improperly obtained FISA warrants to surveil former Trump aide Carter Page.\n\nAppearing Monday on the Fox News Channel, Barr weighed in on Durham’s probe, saying the prosecutor is “making great progress” and shared he is “confident” Durham is “going to get to the bottom of things.”\n\n“We’ll let the chips fall where they may,” Barr said. “I think they all know John Durham’s reputation and we’ll just see how it turns out.”", "description": "The DOJ's criminal investigation into the Trump-Russia probe reportedly has John Brennan and James Clapper in its crosshairs.", "authors": ["Joshua Caplan"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-631413276-640x335.jpg", "published_at": "2019-10-30"}