{"pub": "npr", "url": "https://npr.org/sections/health-shots/2019/10/28/773560069/some-pregnant-women-use-weed-for-morning-sickness-but-fda-cautions-against-it", "downloaded_at": "2019-10-28 09:49:15.132312+00:00", "title": "Some Pregnant Women Use Weed For Morning Sickness But FDA Cautions Against It", "language": "en", "text": "Some Pregnant Women Use Weed For Morning Sickness But FDA Cautions Against It\n\nEnlarge this image toggle caption Niklas Skur/EyeEm/Getty Images Niklas Skur/EyeEm/Getty Images\n\nJennifer had a rough start to her pregnancy. \"I had really intense food aversion and really intense nausea,\" says the 28-year-old mother of a five-month-old girl. \"I wasn't eating at all.\"\n\nShe was losing weight instead of gaining it, she says, and couldn't even keep down her prenatal vitamins or iron pills, which she needed to deal with anemia. (NPR is only using her first name to protect her privacy.)\n\nAnd with her first prenatal appointment still weeks away, she began to worry that she wasn't getting enough nutrients to support the pregnancy. \"I was basically in this space, where I felt like I wanted to be a new mom and take care of my child and I wasn't able to do that,\" says Jennifer.\n\nThat's when her husband bought her an ice tea with CBD and THC, two of the main components in cannabis. \"I've never really been a marijuana user,\" she says. \"I don't have anything against it, but I just don't care for it myself.\"\n\nBut that day, she took a few sips of the drink. She says her nausea went away and she was able to eat her first full meal in days. She continued to take a few sips here and there over the next few weeks, when she was unable to eat.\n\nJennifer is among more than 100 women who wrote to NPR about using cannabis during pregnancy. Most of them used it for extreme nausea, vomiting and weight loss, so bad in some cases that they had to be hospitalized.\n\nStudies show that a growing number of pregnant women in the United States are using the drug. And those with severe nausea and vomiting are more likely to.\n\nBut the Food and Drug Administration recently issued a statement in which it \"strongly\" advised women not to use cannabis in any form — including CBD — when pregnant or breastfeeding, because it may pose \"serious risks.\"\n\nThe FDA pointed to research showing that THC, the main psychoactive component of cannabis, crosses the placenta and can affect fetal brain development. There's also evidence it can be passed through breast milk. The agency also noted evidence that prenatal exposure to the drug increases the risk for premature birth.\n\nOver the years, research on the topic has had conflicting results, says Dr. Torri Metz, as associate professor of obstetrics and gynecology at the University of Utah, who studies use marijuana use during pregnancy. \"You can find results that say that marijuana does not have an impact on pregnancy outcomes and you can find other studies that say that it does,\" she says.\n\nStill the research points to some serious concerns. While early studies linking cannabis use to preterm birth and low birth weight weren't conclusive, more recent work has shown a link. The early studies had certain confounding factors, explains Daniel Corsi, an epidemiologist at the Ottawa Hospital Research Institute. The women who used cannabis during pregnancy, also tended to be younger and used substances like tobacco, alcohol and other drugs, all of which can cause adverse birth outcomes.\n\nBut Corsi and his colleagues recently published a study that accounted for those confounding factors.They looked at data on more than 600,000 pregnancies and births in an Ontario hospital between 2012 and 2017. About 1.4% of these women had used cannabis during pregnancy.\n\nThe researchers compared women who used cannabis with those who didn't and who were of similar ages, socioeconomic backgrounds and similar use of alcohol and tobacco. They found that while women who didn't use cannabis had a preterm birth rate of 6.1%, the rate of preterm birth for women who did use the drug during pregnancy was 12%.\n\nSo, while the overall risk of prematurity among women who used cannabis was moderate, it was twice as high as it was for women who didn't use cannabis.\n\nMetz says that researchers have yet to nail down a frequency of use or a concentration of the drug when adverse effects start to show up. But, she says, \"there's definitely no degree of use that anyone has been able to say it's safe.\"\n\nAnd there's some evidence that prenatal exposure to cannabis can have longer term impacts on fetal development.\n\n\"My concern about the use of marijuana during pregnancy is that it will interfere with brain development during the during pregnancy,\" says Nora Volkow, the director of the National Institute on Drug Abuse. \"And that is a period of extraordinary vulnerability.\"\n\nShe says studies done in lab animals suggest that prenatal exposure to cannabis can alter the fetal brain. It affects the development of the prefrontal cortex, which is key to decision making, and it affects parts of the brain involved in our sensitivity to rewards.\n\nHowever, it can be difficult to translate findings from animal studies to humans, she acknowledges. For example, the levels of cannabis that the lab animals are exposed to may not correspond to real-life exposures in pregnant women.\n\nAnd when it comes to understanding the real risks, there are still gaps in the research. For example, how much marijuana are pregnant women using? \"We don't have actually good measures of the type of exposures that some of these pregnant women are subjecting themselves to,\" says Volkow.\n\nThe levels of THC and CBD in different products varies widely, and women may differ in what product they use and how often.\n\nWhat complicates the picture further is that research on cannabis and its health effects is limited, because it's still classified as a Schedule1 drug federally, Volkow notes.\n\nOne thing that concerns researchers and public health officials is that the cannabis market is growing fast with little regulation.\n\n\"Who is monitoring quality control of these products in many of the states that are selling them?\" asks Volkow. \"In many instances there was a big discrepancy between what the product claimed it was providing to the customer and what it actually contained.\"\n\nThe FDA advisory points to reports of contamination of CBD products with THC, pesticides, heavy metals, bacteria and fungus.\n\nWith all of of these unanswered questions, \"we know sufficiently to say that we have to be cautious,\" notes Volkow. \"Why take the risk?\"\n\nFor Metz, when she's counseling her own patients, she talks them through the data available. \"Ultimately it's always a woman's choice what she's going to do with her body and during her pregnancy,\" says Metz. \"But I do think that we need to at least be providing counseling so they can make an informed decision.\"\n\nJennifer remembers worrying about how the drug might affect her baby's health and development. She wanted to know more so she looked at books on child development, which didn't have any information on cannabis. She also looked online, but couldn't find anything conclusive.\n\n\"I was frustrated that I couldn't really find any information,\" she says.\n\nStill, she was cautious about taking a risk when she started using cannabis in her first trimester, using only a small amount of it.\n\n\"I ultimately came to the conclusion that lack of nutrition is far worse than the little bit of marijuana that I'm consuming,\" she says.\n\nAnd as soon as the nausea went away, she stopped.", "description": "Use of the drug during pregnancy has been linked to higher risk for premature birth and low birth weight. But some women with severe nausea feel they're out of other options.", "authors": ["Rhitu Chatterjee"], "top_image": "https://media.npr.org/assets/img/2019/10/25/pregnant_woman-1_wide-5c9f17ba3a11112239466a81f9b0065d5d210883.jpg?s=1400", "published_at": "2019-10-28"}