{"pub": "cbc", "url": "https://cbc.ca/sports/baseball/mlb/toronto-blue-jays-atlanta-braves-recap-1.5269431", "downloaded_at": "2019-09-04 03:46:22.238521+00:00", "title": "Sports-no-CBC", "language": "en", "published_at": "2019-09-04", "text": "Josh Donaldson doubled and drove in three runs, Mike Foltynewicz pitched five scoreless innings, and the streaking Atlanta Braves won their sixth straight game with a 7-2 victory over the Toronto Blue Jays on Tuesday night.\n\nOzzie Albies added an early RBI for the Braves, who are 14-2 since Aug. 16 and 32 games over .500 for the first time since the 2003 team finished 101-61.\n\nTyler Flowers' three-run double in the eighth finished off the Blue Jays, who have lost 12 of 15 to fall a season-worst 30 games under .500.\n\nAtlanta heads into an off day Wednesday with a 10-game home winning streak and at least a 6 1/2-game lead in the NL East.\n\nFoltynewicz (5-5) allowed a baserunner in each of his innings, but none in scoring position. His last threat came from Randal Grichuk, who singled to begin the fifth and was erased on a double play.\n\nThe Braves led 2-0 in the first off Wilmer Font (3-4). Ronald Acuna Jr., mired in a .162 slump since Aug. 13, tripled off the brick wall in right and scored on Albies' single. Albies advanced on Freddie Freeman's opposite-field double down the third base line and scored when Donaldson lined a single to left.\n\nDonaldson lined a double to left in the fifth off T.J. Zeuch, scoring Acuna and Freeman to make it 4-0. Donaldson is 6 for his last 15 with six RBIs over his last three games.\n\nBryse Wilson, the second Atlanta pitcher, gave up Rowdy Tellez's second homer in the last two nights and Derek Fisher's RBI double to make it 4-2 in the seventh.\n\nFoltynewicz walked three and struck out two. Atlanta has won his last nine starts, though the right-hander has a 5.27 ERA over that span.\n\nFont, getting a spot start for the Blue Jays, gave up two runs and four hits in one inning.", "description": "Josh Donaldson doubled and drove in three runs, Mike Foltynewicz pitched five scoreless innings, and the streaking Atlanta Braves won their sixth straight game with a 7-2 victory over the Toronto Blue Jays on Tuesday night.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5269511.1567563722!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/blue-jays-braves.jpg"}