{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7585925/How-hungry-pest-causes-trees-collapse-die-threatening-extra-virgin-dressing.html", "downloaded_at": "2019-10-18 01:26:32.528987+00:00", "title": "How a hungry pest that causes trees to collapse and die is threatening our extra virgin dressing", "language": "en", "text": "Nigella Lawson, above, puts it in her chocolate cake mix and salad dressings. A series of droughts in Spain in the summers of 2012, 2015 and 2017 led to supply shortages and price surges, though spring rains last year saw yields recover\n\nNigella puts it in her chocolate cake mix and salad dressings. Jamie drizzles it over pasta. And millions of home cooks can’t live without it.\n\nOlive oil has poured its way into Britain’s affections over the years. However, the world’s olive supplies are now under threat — from a tiny bacterium called Xylella fastidiosa.\n\nSpread by sap-sucking insects known as spittlebugs or froghoppers, the microbe —invisible to the naked eye — causes a wide range of plant diseases.\n\nThese can be fatal to more than 500 species worldwide, including grapevines, coffee plants and peach trees. Since October 2013, Xylella has been found to attack olive trees, too.\n\nThe disease, known as olive quick decline syndrome or OQDS, has spread rapidly throughout southern Italy, where much of the world’s finest oil is produced.\n\nOnce trees are infected, the bug starts in the leaf-tips and works into the trunks, blocking the xylem (the plant’s arteries) and preventing them from taking up water. Shoots and branches rapidly wither, causing the tree to collapse and die.\n\nIn the Italian region of Puglia, one of the world’s most important olive-growing areas, more than one-sixth of a total of 60 million trees are now blighted by the disease.\n\nWith global climate change likely to bring more frequent and severe droughts and heatwaves, the future for growers around the Mediterranean looks bleak. As if that were not enough, the industry faces two more body blows, either of which could tip it into oblivion [File photo]\n\nOne theory is that the Xylella outbreak was started by an ornamental plant from Costa Rica, but no one knows for sure.\n\nFor most of the growers affected, it is not only a commercial tragedy, but a very personal one, as often families have farmed the same groves for generations.\n\nMany olive trees in Puglia were planted centuries ago. One celebrated example is thought to be 4,000 years old — dating back to the Bronze Age. It still produces olives, though whether it can survive this new threat is uncertain.\n\nIn Italy as a whole, the 2018 olive harvest was a disaster, with yields down by more than 50 per cent following the death of 35 million trees.\n\nAs a result, the country ran out of home-grown olive oil this year and suffered the humiliation of having to import supplies. The cost to the Italian industry has been estimated at well over €1 billion.\n\nBritons consume just over one litre of olive oil per person per year. Yet that pales into insignificance when compared to the world’s biggest users, the Greeks, who get through 24 litres (5.3 gallons) per person annually — almost a pint a week [File photo]\n\nWhether it will wreak devastation in other countries is still unclear. But Xylella has been identified in southern France, the French island of Corsica, northern Portugal, the Balearic Islands and mainland Spain — the world’s largest olive oil producer, with more than half the global market.\n\nOlive oil has been with us for a very long time, having first been made by our Neolithic ancestors about 10,000 years ago.\n\nIn the Old Testament Book of Exodus, the Lord commanded Moses to bring ‘pure oil of pressed olives’ to make a lamp burn continually. The Israelites used the oil for cooking and to anoint priests.\n\nThe tree itself is a potent sign of peace: as when the dove returns to Noah’s Ark carrying an olive branch in its beak.\n\nThe British, though, have always had a rather on-off relationship with olives.\n\nOlive oil has poured its way into Britain’s affections over the years. However, the world’s olive supplies are now under threat — from a tiny bacterium called Xylella fastidiosa, pictured above in a stock image\n\nThe great Victorian cookery writer Mrs Beeton mentioned olive oil in her famous Book Of Household Management, but only as a remedy for flatulence.\n\nIn 1950, pioneering cookery writer Elizabeth David published A Book Of Mediterranean Food, in which she recommended olive oil for cooking. For a long time, though, its use was confined to the middle-classes.\n\nMy mother’s generation did use olive oil, but never for cooking. Bought in tiny bottles from the local chemist, parents would pour it into their children’s ears to clear out excessive wax.\n\nJudy Ridgway, co-author of The Olive Oil Diet, recalls her mother rubbing olive oil into her hair before a perm.\n\nThings have changed dramatically since then.\n\nToday, Britons consume just over one litre of olive oil per person per year. Yet that pales into insignificance when compared to the world’s biggest users, the Greeks, who get through 24 litres (5.3 gallons) per person annually — almost a pint a week.\n\nWhereas extra-virgin oil is made from olives crushed soon after they are picked, ordinary ‘virgin’ oil is refined by an industrial process. As a result, it is cheaper to produce, but lacks flavour [File photo]\n\nLike wine, olive oil can be either very cheap, or extortionately expensive. Lidl sells a litre for just £2.59, while the dearest bottle sold in Harrods — extra-virgin olive oil with black truffle — will set you back £85 for a litre.\n\nBut, again, that does not compare with the Greeks, whose brand Lambda sells the world’s most expensive bottle. Labelled as Ultra-Premium Extra-Virgin, it comes from olives harvested lovingly by hand.\n\nA 500ml bottle in a presentation case with two 18-carat white gold plates inscribed with the name of your choice, costs €11,000 — not far short of £10,000.\n\nIt is possible we’ll all be paying sky-high prices for olive oil in the future, for Xylella fastidiosa is not the only problem facing producers.\n\nA series of droughts in Spain in the summers of 2012, 2015 and 2017 led to supply shortages and price surges, though spring rains last year saw yields recover.\n\nBut with global climate change likely to bring more frequent and severe droughts and heatwaves, the future for growers around the Mediterranean looks bleak.\n\nAs if that were not enough, the industry faces two more body blows, either of which could tip it into oblivion.\n\nThe first was a classic own goal. In 2015, investigators found that vast amounts of olive oil sold under the ‘extra-virgin’ label was actually of far inferior quality.\n\nWhereas extra-virgin oil is made from olives crushed soon after they are picked, ordinary ‘virgin’ oil is refined by an industrial process. As a result, it is cheaper to produce, but lacks flavour.\n\nThere is a big difference between them. As Tom Mueller, author of Extra Virginity: The Sublime And Scandalous World Of Olive Oil, wrote: ‘Once someone tries a real extra-virgin they’ll never go back to the fake kind.\n\n‘It’s distinctive, complex, the freshest thing you’ve ever eaten. It makes you realise how rotten the other stuff is.’\n\nWhat made this scam even more scandalous was that it wasn’t just carried out by criminals on the edges of the industry, but involved seven top brands.\n\nAs if disease, drought and fraud were not enough, this year another scandal emerged.\n\nConservationists revealed how millions of songbirds were being killed by the olive oil industry as a result of mechanised harvesting methods.\n\nLike wine, olive oil can be either very cheap, or extortionately expensive. Lidl sells a litre for just £2.59, while the dearest bottle sold in Harrods — extra-virgin olive oil with black truffle — will set you back £85 for a litre\n\nEvery night at harvest time, between October and January, big olive producers around the Mediterranean suck the fruit from the trees with high-powered vacuum machines.\n\nThey no longer use the traditional method of shaking the trees and collecting the fruit in a sheet on the ground.\n\nBirds such as robins, wagtails, warblers and finches roost at night in the olive trees.\n\nWhen harvesting starts, they are first dazzled by the machines’ bright lights, then sucked into the mechanism — a horrific end for the tiny creatures.\n\nTo make things worse, some unscrupulous harvesters then illegally sell the corpses to hotels and restaurants as ‘delicacies’.\n\nThe death rate is shocking: an estimated 2.6 million birds are killed each winter in Andalusia, southern Spain, alone. Across the whole of the Mediterranean region, the death toll is likely to run into the tens of millions.\n\nAfter BirdLife International drew attention to the carnage, the Andalusian regional government announced an immediate ban on night-time olive harvesting, which does appear to have worked.\n\nThe organisation has now called for other olive-producing regions and countries to follow suit.\n\nBut given its already tarnished image following the fake oil scandal, the industry still has a long way to go to regain public trust.\n\nMeanwhile, scientists worldwide are in a race against time to find a solution to the Xylella threat, which could bring ruin not only to the olive oil industry, but for wine-makers and coffee growers, too.\n\nWithout a cure for the disease, the olive oil industry — worth billions of dollars — could be doomed, and chefs and gourmets will have to find an alternative oil to drizzle over their salads.", "description": "STEPHEN MOSS: Nigella Lawson puts it in her chocolate cake mix and salad dressings. Jamie drizzles it over pasta. And millions of home cooks can't live without it.", "authors": ["Stephen Moss For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/22/19859128-0-image-a-27_1571348458681.jpg", "published_at": "2019-10-17"}