{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/inside-molly-mae-hagues-messy-20645705", "downloaded_at": "2019-10-18 08:53:00.573837+00:00", "title": "Inside Molly-Mae Hague's messy hotel room with clothes strewn across every surface", "language": "en", "text": "Get the biggest Daily Love Island stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nMolly-Mae Hague show off her messy hotel room in her latest vlog.\n\nMost people will understand the pain of packing for a trip and wanting to take multiple outfit options for nights out.\n\nAnd Molly-Mae is no different.\n\nThe Love Island star has admitted she's a bit of a messy pup, and her clothing-strewn hotel room proves it.\n\nThe reality babe, 20, captured her recent trip to New York and Las Vegas with boyfriend Tommy Fury for her YouTube channel.\n\nAs she stands in the mirror to show off her outfit, two open suitcases lie at the side of the room behind her and clothes are strewn all over the floor, bed, tables, and any available surface.\n\n\"So this is my outfit, please ignore the mess, I'm in such a rush,\" she explains.\n\nMolly-Mae has admitted how messy she is before.\n\nAs she talked about moving in with Tommy, she told Mirror Online she was a lot messier than her boyfriend but was going to try to be tidier.\n\nThe 18-minute video follows the couple as they see the sights in New York before heading to Vegas to watch Tommy's big brother Tyson's boxing match.\n\nMolly talked about going to see her PrettyLittleThing billboard in Times Square and the stress of trying to get a good picture with it in the background as it was only visible every 20 minutes.\n\nShe also talked about her exciting run-ins with some members of the Kardashian-Jenner family, and how she completely fan-girled over them.\n\nShe says to the camera: \"So basically guys, you're not going to believe what's just happened.\n\n\"We were just coming in from doing all our bits and bobs this morning, we came into the lobby and I looked to my right and we saw Kendall Jenner.\n\n\"Kendall Jenner is currently sat downstairs in the hotel lobby, she's staying in the same hotel as us and I literally was in shock.\n\n(Image: @mollymaehague/Instagram)\n\n\"We walked past her, Rachel didn't even see her, Rachel's in a world of her own, I clocked her and I just didn't really know what to do and we went to the lift and I was like, 'Rachel it's Kendall Jenner!'.\n\n\"And we just kind of stood there really awkwardly and stared at her for a bit and I'm just currently in shock. She's an absolute joke, she was just sitting there minding her own business, having a cup of tea on her phone and I was like, good for you, enjoy your tea. But it was just madness.\"\n\nShel later says: \" Kim Kardashian was in our hotel yesterday. I was sat this far away from Kim Kardashian and she smiled at me, she fully smiled at me. It was a little bit crazy.\"\n\nTommy and Molly-Mae also head to IHOP for breakfast, and Tommy consumes a whopping 3,000 calories for breakfast.\n\nHe ends up going pale and feeling sick, and Molly-Mae admits she has to run to the toilet too.\n\nThe video ended with the pair climbing into bed together with Ellie-Bellie, Molly-Mae's cuddly elephant who became a big part of their relationship in the Love Island villa.\n\nTommy says he's Ellie-Bellie's dad now and has officially adopted him.\n\nDo you have a story to sell? Get in touch with us at webcelebs@trinitymirror.com or call us direct 0207 29 33033", "description": "The Love Island star has admitted to being messy - and ended up throwing things all over her room as she tried to decide what to wear", "authors": ["Vicki Newman", "Image", "Mollymaehague Instagram"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20646084.ece/ALTERNATES/s1200/0_JS196221160JPG.jpg", "published_at": "2019-10-18"}