{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/nobody-knows-whats-up-with-tomb-raiders-eighth-dlc", "downloaded_at": "2019-09-14 01:39:19.149234+00:00", "title": "Nobody Knows What's Up With Tomb Raider's Eighth DLC", "language": "en", "text": "Back in April, players of the most recent Tomb Raider noticed something surprising. An in-game menu that was being used to list new downloadable tomb levels suddenly listed an eighth slot. The game’s publisher had only ever promised seven.\n\nAt the time, there was still one more of the game’s seven announced bonus tombs to come. Those tombs had been released more or less once a month since the game launched. The final one went live on April 23. Since then, that eighth spot has remained a mystery, and the people behind Shadow of the Tomb Raider won’t say anything about it.\n\nFans have wondered: Why is there an eighth tomb listed when the game’s $44 season pass was only hyped to offer seven? Would this eighth tomb be released for all players for free? Or cost money? Would it be an extension of the season pass?\n\nShadow Of The Tomb Raider's Piecemeal Season Pass Ultimately Improved The Game Last year’s Shadow of the Tomb Raider had a season pass with a packed lineup that must have sounded great in its publisher’s boardroom and maybe in the ears of some fans: seven expansions, one a month, adding a new tomb each time. Can’t miss, right? Read more\n\nUnfortunately, publisher Square Enix and the game’s development studios have been silent. A rep for the publisher didn’t comment on this when we asked in April, nor when we asked again in August and a third time earlier this week.\n\nAt the unofficial Tomb Raider Forums, there’s a 536-page thread dedicated to the mystery of the eighth tomb slot. There, fans speculate about the possibility that data-miners detected evidence of a tomb based on Croft Manor. It is a timeline of a community’s anticipation and disappointment. About 100 pages in, it’s June and the game’s fans are typing live reactions to Square Enix’s E3 press conference. Once a trailer for the marquee Avengers title, which will presumably close the show, starts airing, the Tomb Raider fans realise they’re not getting any news about the eighth tomb. “Sqeenix can take that 8th DLC and cram it,” one user writes. “They could have at least said not to expect anything, but they must live for us being disappointed.” Over the next 400 pages, the cycle repeats. August’s Gamescom show becomes similarly deflating for this loyal group.\n\nFans aren’t forgetting. Recent Tweets from the official Tomb Raider account about topics unrelated to the eighth tomb get replies about them. An August 30 Tweet about fan art elicited: “lol NO. we want DLC8.” A September 9 Tweet confirming the production of a new Tomb Raider movie garnered a ”Yay!!! DLC8 announced soon? :D”\n\nTomorrow marks the one-year anniversary of Shadow of the Tomb Raider’s release. At the Tomb Raider Forums, fans peg that as the last best chance to get news of the eighth tomb. Maybe they’ll announce it. Maybe Square Enix will announce a whole compilation re-release of the whole game and all its DLC and throw in an eighth tomb as a bonus. Maybe, maybe, maybe.\n\nOr, as one user writes on page 534: “I think it’s time to move on, for real this time. It’s healthier to just assume it’s cancelled and if it ever comes, surprise, it finally came.”", "description": "Back in April, players of the most recent Tomb Raider noticed something surprising. An in-game menu that was being used to list new downloadable tomb levels suddenly listed an eighth slot. The game’s publisher had only ever promised seven....", "authors": ["Alex Walker", "Luke Plunkett"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/xcbv3yjuc7jdps5eidni.jpg", "published_at": "2019-09-14"}