{"pub": "yahoo", "url": "https://news.yahoo.com/ex-lawmaker-issa-launch-bid-043738041.html", "downloaded_at": "2019-09-27 00:04:56.116416+00:00", "title": "Run by California GOP stalwart pressures indicted incumbent", "language": "en", "text": "Former congressman Darrell Issa, left, speaks with a reporter after a news conference Thursday, Sept. 26, 2019, in El Cajon, Calif. Issa, a former congressman, announced he will attempt a return to Congress to replace fellow Republican and longtime-U.S. Rep. Duncan Hunter, who is running for re-election while under indictment on corruption charges. (AP Photo/Gregory Bull)\n\nEL CAJON, Calif. (AP) — Wealthy former congressman Darrell Issa says he retired from the U.S. House of Representatives because the Southern California district he served for 18 years had grown too moderate and no longer fit him.\n\nBut Issa says he now sees an opportunity to return to Congress in a neighboring San Diego-area district where voters are more aligned with his conservative values.\n\nIt also has a Republican incumbent headed to trial on corruption charges before the March primary.\n\nWith his name recognition and wealth, Issa's entry Thursday into the race in the 50th District increases the pressure on six-term Rep. Duncan Hunter to step aside, analysts say.\n\nThe former Marine is accused of using campaign funds to pay for family vacations, shopping sprees, bar tabs and extramarital affairs, among other things.\n\nHunter was one of the first to endorse candidate Donald Trump before the 2016 election, but political analyst Carl Luna said Issa's bid sends the message to voters that the Republican party does not want to take a risk.\n\n\"I had wondered whether the president would intervene to pardon Duncan Hunter but this shows that's not happening and Duncan Hunter is increasingly finding himself alone,\" Luna said. \"I could see him striking some type of deal, but it might be too late for that. Federal prosecutors make careers nailing congressional scalps to the wall.\"\n\nIssa did not attack Hunter or call for him to drop out of the race. Instead he said Hunter has been a friend who worked hard for his district and that he personally told Hunter he was entering the race.\n\n\"His current situation is regrettable,\" Issa said. \"He deserves his day in court.\"\n\nLuna said Issa must be careful not to alienate Hunter's base that helped get him re-elected last year while he was under indictment.\n\nHunter, who has pleaded not guilty, declined to comment on Issa's candidacy.\n\nIssa said he told Trump that he would be entering the race after the Senate delayed his confirmation hearing to become director of the U.S. Trade and Development Agency and that running would make better use of him.\n\nIssa said he wants to ensure one of Southern California's last staunchly Republican districts does not flip.\n\n\"I believe that I have the history, the skills, the seniority and the capability to hit the ground running,\" Issa said in the San Diego suburb of El Cajon.\n\nThe former nine-term congressman who made his fortune through a car-alarm company saw the 49th District, which straddles San Diego and Orange counties, flip after he decided not to seek re-election. Democrat Mike Levin won the seat last November.\n\nIssa narrowly won the district in 2016. He retired in January.\n\n\"My politics are conservative politics, so sometimes you have to ask, do you fit the district?\" Issa said.\n\nRepublicans have a big advantage in voter registration in the 50th District, which covers east San Diego County and a small part of southern Riverside County.\n\nSeveral Republicans are still running for the seat, though four dropped out Thursday.\n\nIssa, a chief congressional antagonist of President Barack Obama, endeared himself to many conservatives as chairman of the House Oversight and Government Reform Committee from 2011 to 2015.\n\nHe was a fierce critic of former Secretary of State Hillary Clinton and her response to the deadly 2012 attacks on the U.S. embassy in Benghazi, Libya.\n\nLast year, Ammar Campa-Najjar, a first-time Democrat candidate came within 3.4 percentage points of winning the seat.\n\nHe is running again and said Issa's candidacy \"just highlights the fact that Hunter is vulnerable and we're viable, and that Washington insiders are scrambling to find somebody who could effectively challenge our campaign.\"\n\nAnother Republican challenger, Carl DeMaio, a radio host and former San Diego city councilman with broad name recognition, has vowed to stay in the race.\n\nDeMaio held a news conference next to Issa's. His supporters chanted \"Issa quit!\" referring to Issa's retirement from Congress.\n\nDeMaio brushed off concerns about the Republican vote being divided.\n\n\"No $400 million career network politician is going to muscle this grassroots campaign to the sidelines,\" DeMaio said.", "description": "Wealthy former congressman Darrell Issa says he retired from the U.S. House of Representatives because the Southern California district he served for 18 years had grown too moderate and no longer fit him.  With his name recognition and wealth, Issa's entry Thursday into the race in the 50th District", "authors": ["Julie Watson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/iqvGJZdqOhuV5ZY2e3I4mw--~B/aD0zNjI0O3c9NDk3MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/3537644232bc5bfd0927416139f15791", "published_at": "2019-09-26"}