{"pub": "yahoo", "url": "https://news.yahoo.com/whats-at-stake-for-each-of-the-12-democrats-in-tuesdays-debate-170020251.html", "downloaded_at": "2019-10-15 23:09:36.496909+00:00", "title": "What's at stake for each of the 12 Democrats in Tuesday's debate", "language": "en", "text": "Welcome to 2020 Vision, the Yahoo News column covering the presidential race with one key takeaway every weekday and a wrap-up each weekend. Reminder: There are 111 days until the Iowa caucuses and 385 days until the 2020 election.\n\nWith the clock ticking down toward the start of voting, Democratic candidates are getting more serious — and desperate. Twelve among those still running qualified to appear Tuesday night at Otterbein University in Westerville, Ohio, hosted by CNN and the New York Times — the largest field ever to assemble on one stage for a presidential debate. All of them have the same basic checklist of avoiding gaffes, scoring a viral moment and remembering to plug their website, but each also has a specific agenda, based on their poll standing and positioning. Here is what each hopes to achieve tonight:\n\nTHE FRONTRUNNERS\n\nElizabeth Warren\n\nNational: 23.4 percent\n\nIowa: 22.7 percent\n\nStatus update: Warren is literally the only major candidate who is doing better in the polls now than she was at the start of the summer, having clawed her way back from single digits to lead Joe Biden in Iowa, New Hampshire and many national surveys. Lately she’s been picking a fight with Facebook over its policy of allowing politicians to lie in ads; to make her point, she posted an ad on the network with the intentionally false claim that Facebook CEO Mark Zuckerberg had endorsed President Trump for reelection.\n\nTonight’s goal: Warren has enjoyed a long run of good press and kid-glove treatment from her rivals. In recent weeks, several of them — Pete Buttigieg, Bernie Sanders, Biden — have signaled that the honeymoon is over, launching mild attacks (from both sides) on Warren over her position on Medicare for All. But nothing has knocked the Massachusetts senator off her stride. They’ll almost certainly try again tonight, giving Warren a chance to show off her defensive skills — and, if she succeeds, to continue to build momentum.\n\nJoe Biden\n\nNational: 29.4 percent\n\nIowa: 19.3 percent\n\nStatus update: For weeks now, the former vice president has been fending off an onslaught from the current president over Ukraine, with Trump trying to falsely tar Biden and his son Hunter, and Biden struggling to respond. But it’s important to note that Biden’s poll numbers haven’t declined at all over that period (even as Warren’s have risen). And lately he seems to have found his footing, unveiling an ethics plan on Monday that directly targets Trump and accuses him of creating the “most corrupt administration in modern history.”\n\nTonight’s goal: A plurality of Americans now say they believe Trump’s accusations are hurting Biden’s prospects of becoming the Democratic nominee. Biden’s job Tuesday night is to prove them wrong — to show on live national TV that he can handle the incoming. His main rivals might be wary of attacking him about Ukraine, lest they appear to be endorsing Trump’s attack, but the moderators are almost sure to ask about it — especially since Hunter Biden just gave his first interview on the subject to “Good Morning America” Tuesday morning.\n\nDemocratic presidential candidates, from top left: Elizabeth Warren, Joe Biden, Pete Buttigieg, Bernie Sanders, Kamala Harris, Beto O'Rourke. Bottom, from left: Amy Klobuchar, Cory Booker, Julián Castro, Andrew Yang, Tom Steyer and Tulsi Gabbard. (Photo Illustration: Yahoo News; photos: Reuters) More\n\nTHE SLEEPER\n\nPete Buttigieg\n\nNational: 5.2 percent\n\nIowa: 12 percent\n\nStatus update: Buttigieg was the fundraising leader in the second quarter of 2019, and he raised nearly $20 million in Q3. Other than Warren, he has built the biggest and best early-state ground game. He has the cash and campaign infrastructure to go the distance. But after peaking in the spring, Buttigieg has failed to take off in the polls — with one exception: Iowa. There, the South Bend, Ind., mayor has gained 5 points over the last month, in large part by positioning himself as a center-left alternative to Warren and Biden.", "description": "Tonight’s goals: A plurality of Americans now say they believe Trump's accusations are hurting Biden's prospects of becoming the Democratic nominee. Biden’s job Tuesday night is to prove them wrong. For Pete Buttigieg, it’s all about Iowa. For Bernie Sanders, his campaign hopes the debate will", "authors": ["Andrew Romano", "West Coast Correspondent"], "top_image": "https://s.yimg.com/uu/api/res/1.2/T8wA5FAm3IuJRJaopnDFOw--~B/aD03NTY7dz0xNDA0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/17ff93d0-ef6d-11e9-bf3f-85903d6aa1e4", "published_at": "2019-10-15"}