{"pub": "thehill", "url": "https://thehill.com/homenews/administration/467208-trumps-new-challenge-is-officials-dishing-dirt", "downloaded_at": "2019-10-24 02:24:40.896517+00:00", "title": "Trump's new challenge is officials dishing dirt", "language": "en", "text": "Current and former administration officials are increasingly offering dirt on President Trump Donald John TrumpGraham to introduce resolution condemning House impeachment inquiry Support for impeachment inches up in poll Fox News's Bret Baier calls Trump's attacks on media 'a problem' MORE, creating a serious challenge for the White House in the impeachment inquiry.\n\nThe dam seems to have broken in recent weeks, with several officials defying the administration’s efforts to block their testimony.\n\nSeparately, former Defense Secretary James Mattis James Norman MattisJohn Feehery: Mutiny on the Bounty Amash rips Trump over move to send troops from Syria to Iraq Defense chief says US troops leaving Syria will go to western Iraq MORE and former ISIS envoy Brett McGurk have hammered the president in personal terms, and former national security adviser John Bolton John BoltonPutin, Hungarian leader pushed Trump on Ukraine corruption narrative: reports Gadhafi's ghost still haunts US policymakers Trump job approval slips 2 points in Gallup poll MORE and an anonymous senior administration official are penning tell-all books.\n\nADVERTISEMENT\n\nThe developments underscore the threat posed by the sea of people who have filtered through the government during Trump’s three years in office. The administration has experienced a high turnover, especially in national security positions, and many now have stories to tell.\n\nIt also appears to be getting to Trump, who lashed out Wednesday in a series of tweets.\n\nTrump decried William Taylor, the top U.S. diplomat in Ukraine who offered damaging testimony on Tuesday, as a “Never Trumper.”\n\nHe also described so-called Never Trump Republicans as “human scum” and “worse than the Do Nothing Democrats.” He then discouraged members of his administration from hiring individuals who didn’t support his agenda.\n\nSeveral current and former officials have testified behind closed doors over the past few weeks, including Taylor, former National Security Council official Fiona Hill and ex-U.S. Ambassador to Ukraine Marie Yovanovitch.\n\nCollectively, their testimony has painted a picture of a shadow foreign policy on Ukraine led by Trump’s personal attorney Rudy Giuliani Rudy GiulianiOvernight Defense: Trump's Syria envoy wasn't consulted on withdrawal | McConnell offers resolution urging Trump to rethink Syria | Diplomat says Ukraine aid was tied to political investigations Democrats say they have game changer on impeachment READ: Diplomat describes pressure put on Ukraine to open 'investigations' MORE.\n\n“The cynical take is, of course, that these are folks who see an administration that’s going down and they don’t want to go down with it,” said Peter Loge, a professor at George Washington University who previously worked as an adviser in the Obama administration.\n\n“Another, more optimistic, take is that these are people who have sets of beliefs about America and have decided that partisanship and the rough-and-tumble of politics are one thing, but attacking American institutions repeatedly and what appears to have happened in Ukraine are just a bit too far,” Loge added.\n\nADVERTISEMENT\n\nTrump and his allies have sought to diminish officials as partisan detractors on a crusade against Trump, echoing many of the same arguments made against former special counsel Robert Mueller Robert (Bob) Swan MuellerFox News legal analyst says Trump call with Ukraine leader could be 'more serious' than what Mueller 'dragged up' Lewandowski says Mueller report was 'very clear' in proving 'there was no obstruction,' despite having 'never' read it Fox's Cavuto roasts Trump over criticism of network MORE’s Russia probe.\n\n“President Trump has done nothing wrong — this is a coordinated smear campaign from far-left lawmakers and radical unelected bureaucrats waging war on the Constitution,” White House press secretary Stephanie Grisham Stephanie GrishamDiplomat says Ukraine aid was tied to political investigations White House to cancel subscriptions to New York Times, Washington Post after Trump remarks Bill Press: Mulvaney proves need for daily briefings MORE said in a statement following Taylor’s testimony.\n\nBut the White House may have difficulty undermining the credibility of career officials who have served in multiple administration and were appointed by the president or his Cabinet members.\n\nTaylor, for example, was last appointed by former President George W. Bush to serve as the U.S. ambassador to Ukraine between 2006 and 2009. He came out of retirement in June to head the U.S. Embassy in Kiev under the Trump administration at Secretary of State Mike Pompeo Michael (Mike) Richard PompeoTrump hotel cancels Christian aid group's event to support the Kurds: report Pence on Syria: 'Our troops are coming home' House calls on Russia to release Paul Whelan or else provide evidence of wrongdoing MORE’s request.\n\n“For most of these people, they are motivated exactly by their interest in defending American foreign policy interests, American prerogatives, American democracy and the proper order of business,” said Evelyn Farkas, a former top defense official who worked on Ukraine policy during the Obama administration. “Not one particular person or party.”\n\nAnita McBride, who worked in various roles at the White House and State Department during the Reagan and George W. Bush administrations, said Taylor and others appear to have been driven by what they viewed as an unraveling in U.S. foreign policy towards Ukraine.\n\n“Your guiding light is always, what is U.S. foreign policy,” McBride said. “They don’t really want to be front and center like this, in crosshairs of the political leadership.”\n\nThe criticisms of Trump aren’t just coming from officials testifying as part of the impeachment inquiry.\n\nFormer White House chief of staff John Kelly John Francis KellyMORE has been critical of Trump in private paid speeches since leaving the administration, and former Homeland Security Secretary Kirstjen Nielsen Kirstjen Michele NielsenNielsen on leaving Trump administration: 'Saying no and refusing to do it myself was not going to be enough' Trump's top picks for Homeland Security chief are ineligible for job: reports Singer Brandi Carlile drops out of Fortune event over Kirstjen Nielsen's appearance MORE on Tuesday said she had to quit because she was being asked to do things that weren’t legal.\n\nMattis, who resigned last December and has mostly avoided the public eye since, went after Trump in jarringly personal fashion last week after the president called him “overrated.”\n\n“I earned my spurs on the battlefield; Donald Trump earned his spurs in a letter from a doctor,” he said in one jibe at last week’s Al Smith Memorial Foundation dinner.\n\nMcGurk, the Trump administration’s ex-envoy in the fight against ISIS, has emerged as a withering critic of the president on Twitter and on television. McGurk has hammered Trump over his decision to pull U.S. troops out of northern Syria, questioning his leadership and blasting his abandonment of Kurdish allies.\n\nBolton, who spent more than a year as the president’s national security adviser, has taken thinly veiled shots at his old boss’s North Korea policy during recent speeches at policy think tanks, reportedly raised alarms about the president’s strategy in Ukraine that is now at the heart of an impeachment inquiry.\n\nDemocrats are certain to want to interview Bolton, given testimony from other witnesses that he was critical of Giuliani’s foreign policy, which according to some testimony Bolton compared to a “drug deal.”\n\nHe’s also said to be writing a book about his time in the White House that could be problematic for Trump.\n\nAnthony Scaramucci Anthony ScaramucciScaramucci to Mulvaney: 'Resign, go to confession' Scaramucci calls Trump a 'traitor' to the US Scaramucci: Trump is 'gone' and 'done' MORE, who served a brief stint as the White House communications director and has become one of the most outspoken former Trump aides in criticizing the president, said he believes condemnation from nonpolitical former officials helps sway public opinion on impeachment but would need to be coupled with outcry from elected Republicans — something that seems unlikely.\n\n“Obviously a proverbial wipeout for him would be political commentary,” Scaramucci said. “You get an elected Republican official to say, ‘OK, that’s it, I’ve had enough,’ I think that would really do it here. The apolitical stuff has helped public opinion, but inside the Beltway you’re going to need a few of these political types to say ‘no mas.’ ”", "description": "Current and former administration officials are increasingly offering dirt on President Trump, creating a serious challenge for the White House in the impeachment inquiry.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_102319upi_lead.jpg", "published_at": "2019-10-24"}