{"pub": "huffpost", "url": "https://huffpost.com/entry/rudy-giuliani-fly-vienna-after-arrested-associates-flight_n_5d9fb8d1e4b087efdbab7b0a", "downloaded_at": "2019-10-11 00:18:52.101109+00:00", "title": "Rudy Giuliani Planned Vienna Trip 1 Day After Arrested Associates Were Headed There: Report", "language": "en", "text": "Rudy Giuliani was reportedly planning to leave Thursday for Vienna, Austria, a day after two business associates who helped him with his dealings with Ukraine officials were arrested as they were headed to the same destination.\n\nThe Atlantic’s Elaina Plott reported that Giuliani, President Donald Trump’s personal attorney, told her he would not be able to meet Thursday evening for an interview because he was planning to fly to Vienna in the evening. Giuliani told that to the reporter around the same time that his associates Lev Parnas and Igor Fruman were arrested at Dulles International Airport while waiting to board a flight to Vienna with one-way international tickets Wednesday night, Plott wrote.\n\nScoop: Rudy Giuliani was also planning to head to Vienna tonight--one day after Lev Parnas and Igor Fruman were trying to do the same with one-way tickets. https://t.co/e4lJr6V3Z5 — Elaina Plott (@elainaplott) October 10, 2019\n\nParnas and Fruman were headed to Vienna when they were arrested, The Wall Street Journal first reported earlier Thursday. The Southern District of New York indicted the two Soviet-born Florida businessmen on federal campaign finance charges for allegedly channeling foreign money and making fraudulent straw donations in order to hide their political contributions and give in excess of campaign contribution limits to Trump and other Republican candidates.\n\nAccording to Plott, Giuliani texted her late Thursday afternoon declining to comment on why Parnas and Fruman were headed to Vienna, and why he was planning to be there 24 hours later.\n\nIn comments to the Journal, Giuliani said that while Parnas and Fruman were going to Vienna on issues “related to their business,” he was only going to meet with them when they returned to Washington.\n\nAs the Journal reported, the two men have introduced Giuliani to multiple current and former Ukrainian prosecutors to discuss his attempts at getting the country to investigate former Vice President Joe Biden and his son Hunter, who served on the board of a Ukrainian gas company. Trump’s call with Ukraine’s president about such an investigation is at the center of a House impeachment inquiry into him.\n\nSeparately, House Democrats leading the inquiry issued subpoenas on Thursday to Parnas and Fruman for documents related to their work with Giuliani. Before their arrest, the House requested that Parnas appear for a deposition on Thursday and Fruman on Friday; their counsel declined the request earlier this week.\n\nJay Sekulow, another of Trump’s personal lawyers, told reporters on Thursday that Trump has nothing to do with the businessmen’s campaign finance schemes. Trump himself told reporters he doesn’t “know those gentlemen,” but that “it’s possible I have a picture with them.”\n\nAsked about two men with ties to Rudy Giuliani arrested earlier today, Pres. Trump says, \"I don't know those gentlemen. Now, it's possible I have a picture with them, because I have a picture with everybody.\"\n\n\n\n\"Maybe they were clients of Rudy,\" he adds. \"You'd have to ask Rudy.\" pic.twitter.com/EzCIEA6QMz — ABC News (@ABC) October 10, 2019", "description": "The two associates, Lev Parnas and Igor Fruman, face charges of violating campaign finance laws.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d9fb9272100004207343f30.jpeg?cache=lxwypj7pr0&ops=1778_1000", "published_at": "2019-10-10"}