{"pub": "reuters", "url": "https://reuters.com/article/us-usa-trump-whistleblower-china/beijing-likely-to-pass-on-trump-invitation-to-probe-bidens-china-experts-say-idUSKBN1WI2KA", "downloaded_at": "2019-10-04 01:23:06.728938+00:00", "published_at": "2019-10-03", "title": "Beijing likely to pass on Trump invitation to probe Bidens, China experts say", "language": "en", "text": "WASHINGTON (Reuters) - If China were to act on U.S. President Donald Trump’s surprising request on Thursday to start an investigation into Democratic rival Joe Biden and his family, it would be breaking one of its stated rules: do not meddle in another nation’s internal politics.\n\nBeijing also stands to gain little by helping Trump undermine a political opponent, even in the midst of a bitter trade war that China is eager to end, China experts say.\n\nThe Republican president, the subject of an impeachment inquiry in Congress for asking Ukraine’s president to investigate the Bidens, upped the ante by calling on China to “start an investigation” into 2020 presidential hopeful Biden and his businessman son Hunter.\n\nBeijing has a long-standing public policy of not interfering in foreign countries’ politics. Beijing does “not want to be involved or seen involved in the U.S. presidential elections,” said Jeffrey Bader, a former special assistant to President Barack Obama for national security and a top Asia advisor.\n\nWang Yi, the Chinese government’s top diplomat and foreign minister, said this repeatedly at events around the United Nations General Assembly last week.\n\n“China will never interfere in the internal affairs of the United States, and we trust that the American people are capable of sorting out their own problems,” he said.\n\nChinese officials could “try to hint at a potential exchange of policy concessions for information, if the information is damaging at all,” said Victor Shih, the Ho Miu Lam chair of China and Pacific Relations at University of California San Diego.\n\nHowever, it might make more sense for Beijing to withhold any potentially negative information it may have on Trump’s rival “in order not to increase Trump’s re-election chances,” Shih said. “After all, Trump has upset U.S.-China trade more than any president since Nixon,” he said.\n\nHunter traveled to China with his father, when the senior Biden was vice president, in 2013. The trip came months after Hunter became an unpaid board member of a new investment fund with a Chinese private equity manager, the New Yorker reported. Hunter Biden has repeatedly denied any wrongdoing.\n\n“The Chinese might be tempted to help Trump out and get a better trade deal, but I doubt they will interfere so directly in U.S. politics,” agreed Bonnie Glaser, an Asia expert at the Center for Strategic and International Studies. “They know the risks, which include betting on the wrong horse.”\n\nMUDDYING TRADE TALKS\n\nTrump’s request is also a recipe for bad trade policy, said trade experts. Officials from China and the United States will meet in Washington next week to try negotiate a truce in the trade war that’s resulted in billions of dollars in tariffs and threatens to slow global economic growth.\n\nThe president’s comments could be interpreted as an attempt to draw a link between trade talks and domestic politics, one person briefed on the trade talks said.\n\n“Mingling our own domestic politics with legitimate concerns about China’s unfair trade practices is not a good avenue for getting a big deal done,” the person said.\n\nOver the course of the escalating trade war, Beijing officials have rarely responded to Trump’s volley of insults.\n\n“The Chinese strategy to deal with Trump has been not to get drawn into tit-for-tat verbal battles, but pursue their interests in a very determined way, which is why the U.S.-China trade talks are continuing,” said Evan Medeiros, a professor at Georgetown University and former National Security Council official.\n\nTrump’s public request is also probably a moot point, China experts add. Chinese officials likely already know absolutely everything there is to know about Hunter Biden’s China-related activities or business dealings, thanks to Beijing’s long-standing practice of surveillance.\n\nChina’s Communist Party has historically monitored the activity of foreigners in the country closely, including restricting travel and visas, and sometimes communications and meetings with Chinese citizens and businesses.\n\nOne former U.S. official suggested that if Trump is serious about securing Chinese help in investigating the Bidens, he could try to entice them by promising greater U.S. cooperation in China’s efforts to secure the extradition of dozens of fugitives Beijing is seeking under its “Sky Net” anti-graft campaign.\n\nWashington has long resisted handing over the fugitives, many of them accused of bribery, corruption and embezzlement, because of questions about the impartiality of China’s judicial system and the fairness of the charges.\n\nThe official said, however, that such an offer was unlikely to be enough to sway China to assist any probe targeting the Bidens.", "description": "If China were to act on U.S. President Donald Trump's surprising request on Thursday to start an investigation into Democratic rival Joe Biden and his family, it would be breaking one of its stated rules: do not meddle in another nation's internal politics.", "authors": ["Matt Spetalnick", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png"}