{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/trump-administration-deny-visas-immigrants-cant-pay-for-medical-costs-2019-10", "downloaded_at": "2019-10-05 03:50:10.327268+00:00", "title": "Trump administration to deny visas to immigrants without health insurance or means to pay for medical costs", "language": "en", "text": "President Donald Trump issued a presidential proclamation on Friday, stating that immigrants seeking to live in the US will be denied visas unless they \"will be covered by approved health insurance\" or show that they have \"the financial resources to pay for reasonably foreseeable medical costs.\"\n\nThis latest political move comes in stark contrast to the intentions of the 2020 Democratic presidential candidates, a majority of whom having indicated interest in offering health insurance to undocumented immigrants.\n\nThe proclamation goes into effect on November 3, 2019.\n\nVisit Business Insider's homepage for more stories.\n\nThe Trump administration announced Friday that immigrants who cannot prove that they have health insurance or the means to pay for medical costs will be barred from living in the US.\n\nPresident Donald Trump issued a presidential proclamation that immigrants seeking to live in the US will be denied visas unless they \"will be covered by approved health insurance\" or show that they have \"the financial resources to pay for reasonably foreseeable medical costs.\" The proclamation goes into effect on November 3, 2019.\n\n\"Hospitals and other providers often administer care to the uninsured without any hope of receiving reimbursement from them,\" Trump wrote in the proclamation. \"The costs associated with this care are passed on to the American people in the form of higher taxes, higher premiums, and higher fees for medical services.\"\n\n\"While our healthcare system grapples with the challenges caused by uncompensated care, the United States Government is making the problem worse by admitting thousands of aliens who have not demonstrated any ability to pay for their healthcare costs,\" he continued.\n\nRead more: The Trump administration is planning to roll out a new rule rejecting green cards for immigrants on food stamps and other public aid\n\nIn the proclamation, the president cited unspecified data that showed that lawful immigrants are about three times more likely than United States citizens to lack health insurance.\n\nElizabeth Jamae, an immigration lawyer in San Francisco, told The New York Times she was confused by the proclamation, noting that most green card recipients have already met certain criteria. \"Most people who are receiving green cards already have a job waiting or have a spouse that is employed,\" Jamae said.\n\nThis latest political move comes in stark contrast to the intentions of the 2020 Democratic presidential candidates, a majority of whom have indicated interest in offering health insurance to undocumented immigrants.\n\nSeveral 2020 Democratic candidates responded, including former Housing and Urban Development Secretary Julian Castro.\n\n\"Donald Trump is panicking, and using cruel attacks on immigrants to distract and sow fear,\" Castro wrote on Twitter. \"Immigrants contribute more to this country than Donald Trump or Stephen Miller ever could — and their hate won't stop us from speaking out in defense of immigrants.\"", "description": "The proclamation comes in stark contrast to the 2020 Democratic pool, with a majority intending to offer health insurance to undocumented immigrants.", "authors": ["Lauren Frias"], "top_image": "https://image.businessinsider.com/5c628ccb2628982b471a9f45?width=1200&format=jpeg", "published_at": "2019-10-05"}