{"pub": "yahoo", "url": "https://news.yahoo.com/former-rep-pete-sessions-subpoenaed-sdny-case-2-231058381.html", "downloaded_at": "2019-10-16 01:14:54.989051+00:00", "title": "Former Rep. Pete Sessions subpoenaed in SDNY case of 2 Giuliani associates", "language": "en", "text": "Former Rep. Pete Sessions subpoenaed in SDNY case of 2 Giuliani associates originally appeared on abcnews.go.com\n\nFormer Rep. Pete Sessions, R-Texas, has been subpoenaed in a case related to President Donald Trump's personal lawyer Rudy Giuliani and is fully cooperating with investigators, he told ABC News.\n\n\"I'm cooperating with the U.S. Attorney from the Southern District of New York and will be providing documents to their office related to this matter over the couple of weeks as requested,\" Sessions said.\n\nHe added that he has not been told that he is the focus of the investigation.\n\n\"Nobody has told me I am a target of this investigation, I am fully cooperating, and providing the documents they need,\" he said.\n\nPHOTO: Former US Rep. Pete Sessions speak to the McLennan County Republican Party Thursday, Oct. 3, 2019, in Waco, Texas as he runs to fill the seat of Bill Flores who is stepping down. (Jerry Larson/Waco Tribune-Herald via AP) More\n\nThe Wall Street Journal was the first to report the subpoena.\n\n(MORE: 2 men with ties to Giuliani arrested on campaign finance charges, bond set at $1M)\n\nThe former Texas congressman has been embroiled in a campaign finance violation case involving two associates of Giuliani, Lev Parnas and Igor Fruman, who were charged last in connection with an alleged scheme to circumvent federal laws against foreign campaign donations.\n\nIn the indictment, prosecutors outlined an alleged scheme by the two Soviet-born businessmen, who have been reportedly helping Giuliani investigate Joe Biden's son Hunter Biden, to raise $20,000 for a \"then-sitting U.S. Congressman,\" who \"had also been the beneficiary of approximately $3 million\" from pro-Trump super PAC America First Action during the 2018 midterms. According to the indictment, Parnas allegedly met with the congressman and sought his \"assistance in causing the U.S. government to remove or recall the then-U.S. Ambassador to Ukraine,\" Marie Yovanovitch.\n\nPHOTO: President Trump's personal lawyer Rudy Giuliani with Ukrainian-American businessman Lev Parnas at the Trump International Hotel in Washington, D.C., Sept. 20, 2019. (Aram Roston/Reuters) More\n\n(MORE: Fact-checking Trump's accusations against the Ukraine whistleblower and the Bidens)\n\nThe indictment doesn't name the congressman, but the description matches ABC News' reporting that Sessions had benefited from $3 million in backing from the super PAC during the 2018 cycle, and that during the same month that Parnas raised funds for Sessions, Sessions wrote a letter calling for Yovanovitch's immediate removal.\n\n\"These contributions were made for the purpose of gaining influence with politicians so as to advance their own personal financial interests and the political interests of Ukrainian government officials, including at least one Ukrainian government official with whom they were working,\" the indictment said.\n\n(MORE: Arrest of Giuliani associates tied to Ukraine scandal renews scrutiny on campaign finance rules)\n\nSessions, in a statement last week, stopped short of confirming that he is \"Congressman-1\" in the indictment, but added that if he is indeed the congressman in question, he would not have any knowledge of the campaign finance scheme that the indictment alleges.\n\nSessions also defended his push against the former Ukraine ambassador saying, \"his entire motivation for sending the letter was that I believe that political appointees should not be disparaging the president, especially while serving overseas.\"\n\n\"I was first approached by these individuals for a meeting about the strategic need for Ukraine to become energy independent,\" Sessions said. \"There was no request in that meeting and I took no action. Over time, I recall that there were a couple additional meetings. Again, at no time did I take any official action after these meetings. Separately, after several congressional colleagues reported to me that the current U.S. Ambassador to Ukraine was disparaging President Trump to others as part of those official duties, I wrote a letter to the secretary of state to refer this matter directly.\"\n\n(MORE: Giuliani says he won't comply with a congressional subpoena)\n\nIt's unclear which members of Congress have spoken to Sessions about Yovanovitch.\n\nParnas and Fruman, as well as two of their associates who have also been indicted, are scheduled to appear in court for arraignment and initial conference in New York on Thursday.", "description": "Former Rep. Pete Sessions, R-Texas, has been subpoenaed in a case related to President Donald Trump's personal lawyer Rudy Giuliani and is fully cooperating with investigators, he told ABC News.  \"I'm cooperating with the U.S. Attorney from the Southern District of New York and will be providing", "authors": ["Kyra Phillips", "Soo Rin Kim"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ytR9ZxIF_6pbx4P0FMRV6g--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.go.com/pete-sessions-getty-aa-191011_hpMain_2_16x9_992.jpg", "published_at": "2019-10-15"}