{"pub": "marketwatch", "url": "https://marketwatch.com/story/saudi-arabia-shuts-down-about-half-its-oil-output-after-drone-strikes-spark-fires-2019-09-14", "downloaded_at": "2019-09-15 00:08:37.072460+00:00", "title": "Saudi Arabia shuts down about half its oil output after drone strikes spark fires", "language": "en", "text": "Saudi Arabia is shutting down about half of its oil output after apparently coordinated drone strikes hit Saudi production facilities, people familiar with the matter said, in what Yemen’s Houthi rebels described as one of their largest-ever attacks inside the kingdom.\n\nThe production shutdown amounts to a loss of about five million barrels a day, the people said, roughly 5% of the world’s daily production of crude oil. The kingdom produces 9.8 million barrels a day.\n\nThe coordinated drone strikes on facilities in Saudi Arabia’s Eastern Province mark the latest in a series of attacks on the country’s petroleum assets in recent months, as tensions rise among Iran and its proxies like the Houthis, and the U.S. and partners like Saudi Arabia. The Houthis have also claimed credit for drone attacks on Saudi pipelines, tankers and other infrastructure during a four-year war.\n\nThis attack appeared to be the most effective, starting large fires at Hijra Khurais, one of Saudi Arabia’s largest oil fields, and at Abqaiq, the world’s biggest crude stabilization facility. Khurais produces 1.5 million barrels a day while Abqaiq helps produce up to 7 million barrels a day.\n\nA Houthi spokesman said the attack involved 10 drones. Published images of the fire at the Abqaiq facility showed what appeared to be a huge blaze along with plumes of smoke.\n\nThe Saudi interior ministry said the fires were under control.\n\nSaudi Aramco, the national oil company, held an emergency board meeting on Saturday to manage the unfolding crisis, the people said.\n\nAs the world’s biggest exporter of oil, Saudi officials are discussing drawing down their oil stocks to sell to foreign customers to ensure that world oil supplies aren’t disrupted, the people familiar with the matter said.\n\nThe Saudi government didn’t say who was behind the attack. There were no immediate reports of casualties.\n\nThe Houthis took control of Yemen’s capital, Sana’a, in 2014 during a civil war. Since then, a Saudi-led coalition has fought a war to unseat the Houthis and reinstate a government supported by Saudi Arabia, the United Arab Emirates and other regional powers.\n\nSaudi Arabia and the U.S. say the Houthis are financed and armed by Iran, a charge that Tehran denies.\n\nDisruptions in Saudi oil production could have ripple effects through the global economy, as the kingdom exports more crude petroleum than any other country.\n\nOil futures finished lower on Friday, with both U.S. and international benchmark crude posting sizable weekly falls as worries about the prospect of rising inventories appeared to overshadow a U.S.-China tariff detente.\n\nU.S. West Texas Intermediate crude for October delivery CLV19, -0.05% fell 24 cents, or 0.4%, to settle at $54.85 a barrel on the New York Mercantile Exchange—for a roughly 3% weekly decline, according to Dow Jones Market Data, tracking the front-active contract. November Brent BRNX19, +0.05% shed 16 cents, or 0.3%, to $60.22 a barrel on the ICE Futures, with prices marking a weekly fall of 2.1%.\n\nAn expanded version of this story appears on WSJ.com", "description": "Saudi Arabia is shutting down about half of its oil output after apparently coordinated drone strikes hit Saudi production facilities, people familiar with...", "authors": ["Jared Malsin", "Summer Said"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR312_saudi__ZG_20190914104906.jpg", "published_at": "2019-09-14"}