{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7572507/Saved-Bell-creator-Sam-Bobrick-passes-away-87-suffering-stroke.html", "downloaded_at": "2019-10-14 23:36:47.857548+00:00", "title": "Saved By The Bell creator Sam Bobrick passes away at 87 after suffering a stroke", "language": "en", "text": "TV creator Sam Bobrick has passed away at the age of 87.\n\nBobrick died Friday after suffering a stroke at Northridge Hospital Medical Center, according to friend Adam Carl, who spoke to The Hollywood Reporter.\n\nThe Emmy-nominated writer and playwright was best known for creating the 90s high school sitcom Saved By The Bell.\n\nRemembered: Saved By The Bell creator and veteran writer Sam Bobrick has passed away at 87 years old\n\nThe sitcom, which is set to be rebooted in 2020, originally began as the Disney Channel show Good Morning, Miss Bliss before being canceled, picked up by NBC, renamed and recast.\n\nBobrick was born in 1932 in Chicago. He got his first job in the industry working in ABC's mailroom after graduating from University Of Illinois.\n\nEarly TV credits include writing for The Ray Bolger Show, kids favorite Captain Kangaroo and the game show Make Me Laugh.\n\nHe was also on the staff of The Andy Griffith Show, for which he wrote 19 different episodes.\n\nBobrick earned an Emmy nomination in 1968 for working on The Smothers Brothers Comedy Hour. He later developed and produced The Paul Lynde Show.\n\nThe writer/creator also contributed to the big screen, writing the story for 1977's The Last Remake Of Beau Geste as well as writing the screenplay for 1982's Jimmy The Kid.\n\nEvolution: SBTB originally began as the Disney Channel show Good Morning, Miss Bliss before being canceled, picked up by NBC, renamed and recast into the show we know today\n\nHopping: Early TV credits include writing for The Ray Bolger Show, kids favorite Captain Kangaroo and the game show Make Me Laugh\n\nClassic: He was also on the writing staff for The Andy Griffith Show, for which he wrote 19 different episodes\n\nIn addition to his work on TV and in films, Bobrick also co-wrote over 40 plays, four of which went to Broadway.\n\nHis Broadway credits include Norman, Is That You? - which was later adapted into a Redd Foxx movie - No Hard Feelings, Murder at the Howard Johnson's, and Wally's Cafe.\n\nBobrick also did an uncredited rewrite for The Wiz before it premiered on Broadway in 1975.\n\nIn addition he was a lyricist and songwriter, penning The Girl Of My Best Friend which was covered by Elvis Presley himself in 1960.\n\nIn the 90s he left TV for good in order to concentrate on his stage work.\n\nPal Adam Carl told THR that Sam 'always said, \"I'm more proud of my worst play than my best TV show.\"'\n\nBehind Broadway: Bobrick's Broadway credits include Norman, Is That You? - which was later adapted into a Redd Foxx movie - No Hard Feelings, Murder at the Howard Johnson's, and Wally's Cafe\n\nFit for The King: In addition he was a lyricist and songwriter, penning The Girl Of My Best Friend which was covered by Elvis Presley himself in 1960\n\nBobrick's stage writing won him the Edgar Award from the Mystery Writers of America for his play The Psychic in 2011 at age 79.\n\nCarl had the highest praise for Bobrick, telling THR: 'Sam was, more than anything, a mensch of the highest order.\n\n'He was a writer who absolutely adored actors — not always a given — and appreciated the contributions they brought to the table. He was never precious or defensive about suggestions or notes; he wanted the work to be the best it could be and cherished a good idea from no matter where it came.\n\n'He was a delightful raconteur, a thoughtful and generous host and never saw milk he couldn't turn into a shake. He was also wickedly and darkly funny. His humor was sometimes barbed, sometimes silly, sometimes absurdist, often self-deprecating. But this above all — he was never ever not funny.'\n\nBobrick is survived by his wife Julie, children Lori, Stefanie, and Joey, their spouses, grandchildren Ariel and Josh, and his beloved 'fourth child' Albert The Wonder Pug.", "description": "Bobrick died Friday after suffering a stroke at Northridge Hospital Medical Center, according to friend, writer, producer and actor Adam Carl, who spoke to The Hollywood Reporter.", "authors": ["Kelvera For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/20/19708400-0-image-a-88_1571082996819.jpg", "published_at": "2019-10-14"}