{"pub": "yahoo", "url": "https://sports.yahoo.com/report-red-sox-front-office-165512559.html", "downloaded_at": "2019-09-22 23:14:29.860729+00:00", "title": "Report: Red Sox front office perceived as 'miserable place to work'", "language": "en", "text": "With Dave Dombrowski out as Red Sox president of baseball operations, who will be the team's next general manager?\n\nIt seems like a desirable job: the team consistently has one of the top payrolls in the league, and the franchise has won four World Series titles in the last 16 seasons. But it's not that simple. Not even close.\n\nThe last two men in charge of baseball operations - Ben Cherington and Dombrowski - were shown the door quickly after winning championships, and those moves are painting the Red Sox in a very bad light, according to ESPN's Buster Olney.\n\nScroll to continue with content Ad\n\nThese decisions loosely frame the industry perception of the Red Sox as a chaotic company, a miserable place to work. Boston owner John Henry needs to understand this, because it is why some of the people he'd probably love to consider as possible replacements for Dombrowski privately dismiss the idea out of hand.\n\nOlney writes that some potential candidates have no interest in working for Henry, because they \"doubt he'd have the patience to back his next general manager through the difficult crossroads ahead.\" That includes the impending free agency of Mookie Betts, a potential opt-out from J.D. Martinez, and an expensive rotation fraught with injuries, among other issues.\n\nThe key to a successful leadership transition in the front office might be Sam Kennedy, who has been the team's president for four years following the departure of Larry Lucchino. As Olney explains:\n\nStory continues\n\nA wide-held view in other front offices is that the highly respected and well-liked Red Sox president Sam Kennedy stands as a thin buffer between the team devolving to the level of the Mets, the team generally regarded by rival executives as baseball's model for dysfunction. \"If Sam ever walked away,\" said one official, \"the whole thing would be a complete mess.\"\n\nFrom a 108-win season and a World Series to the possibility of becoming a complete mess, it's amazing how quickly the tide has turned for the Red Sox.\n\nTOMASE: Why Theo Epstein could be the man for the job>>>>>\n\nClick here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device.\n\nReport: Red Sox front office perceived as 'miserable place to work' originally appeared on NBC Sports Boston", "description": "The search for the Red Sox's next GM could be complicated by the reputation of the front office and the perception of working for John Henry.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/p068ph6Uv.jusWuv1Vhe3Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/JCE15.sbLI5qAl2vT3PjCA--~B/aD00MjM7dz03NTI7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/csnne.com/8e85d8eed1b7240bb0097c4adc084a50", "published_at": "2019-09-22"}