{"pub": "dailymail", "url": "https://dailymail.co.uk/money/markets/article-7556147/Johnson-Johnson-ordered-pay-6-6bn-man-grew-breasts.html", "downloaded_at": "2019-10-10 00:13:41.814681+00:00", "title": "Johnson & Johnson ordered to pay £6.6bn to man who grew breasts", "language": "en", "text": "Johnson & Johnson has been ordered to pay £6.6bn damages to a man who grew breasts\n\nAmerican giant Johnson & Johnson faces a flood of claims after it was ordered to pay £6.6billion damages to a man who grew breasts after taking an antipsychotic drug.\n\nThe staggering award was made by a jury after Nicholas Murray argued he was not sufficiently warned about the side effects of risperdal, used to treat symptoms of schizophrenia, bipolar disorder and autism.\n\nHe had been handed more than £550,000 by a judge, with the extra sum ordered as part of 'punitive damages'.\n\nAnalysts branded the damages 'disproportionate' and expect it to be overturned or cut.\n\nBut it was another costly setback ford drugs firm Johnson & Johnson, which is battling separate damages claims worth billions of dollars over the opioid crisis.\n\nMurray, 26, was prescribed risperdal at the age of nine to fight sleep problems related to his autism.\n\nBut he was later taken off it when he realised his breasts were growing, something his lawyers claim was caused by the drug causing a hormone imbalance.\n\nIn the case in Philadelphia, Johnson & Johnson was accused of not making risks associated with risperdal clear to doctors prescribing the drug and their patients.\n\nThe company faces similar claims from around 13,400 other people.", "description": "The award was made by a jury after Nicholas Murray argued he was not sufficiently warned about the side effects of risperdal, used to treat schizophrenia, bipolar disorder and autism.", "authors": ["City", "Finance Reporter For The Daily Mail", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/21/19511010-0-image-a-16_1570654078331.jpg", "published_at": "2019-10-09"}