{"pub": "reuters", "url": "https://reuters.com/article/us-syria-security-nato-usa/u-s-welcomes-german-security-plan-for-syria-unlikely-to-take-part-idUSKBN1X219Z", "downloaded_at": "2019-10-23 12:24:57.280931+00:00", "title": "U.S. welcomes German security plan for Syria, unlikely to take part", "language": "en", "text": "BRUSSELS (Reuters) - The United States and NATO cautiously welcomed on Wednesday a German proposal for a security zone in northern Syria, though Washington’s envoy to the alliance saying it should be for Europe to take charge and not U.S. forces.\n\nFILE PHOTO: U.S. Ambassador to NATO Kay Bailey Hutchison briefs the media ahead of a NATO defence ministers meeting at the Alliance headquarters in Brussels, Belgium, October 2, 2018. REUTERS/Francois Lenoir/File Photo\n\nGermany, traditionally a reluctant partner in foreign missions, has aired a plan to create the zone to protect displaced civilians and ensure the fight continues against Islamic State militants, although details are still vague.\n\nNATO Secretary-General Jens Stoltenberg told reporters he had discussed the proposal with German Defence Minister Annegret Kramp-Karrenbauer, who is expected to present it to NATO counterparts at a regular meeting in Brussels on Thursday.\n\n“I welcome that NATO allies have proposals on how to move forward,” Stoltenberg told a news conference, while cautioning that any broad future political solution would need to involve “all actors on the ground” - an indirect reference to Russia.\n\nUnder a deal between Russia and Turkey on Tuesday, Ankara agreed to restrict its military operations in northern Syria to the border area Turkish forces have seized from Kurdish control since Oct. 9, after U.S. troops unexpectedly withdrew.\n\nWhile that means Syrian, Turkish and Russian troops will now patrol the Turkish-Syrian border, Germany proposed an internationally controlled security zone involving Turkey and Russia that would need the acceptance of other countries too.\n\nAmid strong disapproval of Turkey’s offensive in northern Syria from NATO governments, the alliance is trying to avoid public criticism of its ally and avoid seeing the 29-member alliance dragged into Syria’s eight-year-old war.\n\nThe German proposal offers a potential way out, NATO diplomats said, adding that it might need United Nations Security Council approval as well.\n\nU.S. Ambassador to NATO Kay Bailey Hutchison described the German plan as involving a European group that would be part of an international peacekeeping force.\n\n“It is certainly a positive,” Hutchison said, although she cautioned that she was unsure of the impact of Tuesday night’s agreement between Russian President Vladimir Putin and Turkish counterpart Tayyip Erdogan on the German proposal.\n\n“There is a lot to be done in that sphere...If the Turks would ask for more help from the international community I think the Europeans could step forward,” she said, adding that it might be for France and Britain to help the German proposal.\n\nHowever, asked if the United States might join any potential European force, Hutchison told reporters: “I don’t think that is in the works right now at all. I think the Europeans have stepped forward. I don’t see the U.S. playing a role there.”\n\nKramp-Karrenbauer said on Oct. 21 when she unveiled the proposal that it should stabilize the region and allow civilians to rebuild and refugees to return on a voluntary basis.", "description": "The United States and NATO cautiously welcomed on Wednesday a German proposal for a security zone in northern Syria, though Washington's envoy to the alliance saying it should be for Europe to take charge and not U.S. forces.", "authors": ["Robin Emmott", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191023&t=2&i=1444096712&w=1200&r=LYNXMPEF9M0T9", "published_at": "2019-10-23"}