{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/tennis/article-7619545/Rafael-Nadal-honeymoons-ONE-day-focuses-tennis-marrying-Xisca-Perello-Mallorca.html", "downloaded_at": "2019-10-28 13:43:35.788323+00:00", "title": "Rafael Nadal honeymoons for ONE day and focuses on tennis after marrying Xisca Perello in Mallorca", "language": "en", "text": "Rafael Nadal is already assured of returning to the world No 1 spot next week, but that did not stop him restricting his honeymoon to just one day.\n\nThe 33 year-old Spaniard married longtime partner Xisca Perello in Mallorca last weekend, and almost immediately started focussing on an upcoming busy run.\n\nThat will see him compete in this week's Paris Masters, then London's ATP Finals and the Davis Cup finals week in Madrid.\n\nRafael Nadal married Xisca Perello before turning his focus back to his packed tennis schedule\n\nThe tennis legend and Perello relaxed for a solitary day in the middle of a busy on-court season\n\n'After the wedding I have the Sunday off and then Monday, Tuesday, practice,' said the businesslike Nadal, who is sure to return to No 1 on November 4, regardless of results in Paris.\n\n'On Wednesday I flew to Kazakhstan [where he played Novak Djokovic in a charity exhibition], and Thursday late night here.\n\n'I take my weeks off during the season. In the world of tennis, you have to find your priorities. We take our time off before the wedding, and now is the moment to be back on the tour.'\n\nRoger Federer won his tenth title in his hometown of Basel on Sunday and was poised to make a late decision on his involvement in Paris.\n\nStars of the sport including fellow Spaniard David Ferrer attended the Mallorca matrimonials\n\nBritish hopeful Cameron Norrie could lie in wait for Nadal when he appears at the Paris Masters\n\nCam Norrie and Kyle Edmund are also in the draw, contesting the last spot in the British Davis Cup team for Madrid. Norrie, who kept up his impressive form by coming through qualifying, will meet former Wimbledon finalist Milos Raonic.\n\nEdmund, who has lost eight straight matches, will face Lithuania's Ricardas Berankis.\n\nNorrie was keen to fend off any end-of-seasonitis, saying: 'It's been a long year but it's also so mental and you tell yourself it's the last tournament of the year,' after coming back to beat Egor Gerasimov of Belarus 2-6, 7-5, 7-6.\n\n'I'd rather keep pushing and not have any regrets. You don't want to go down a break and think, \"I'm done\".'\n\nBritish No 2 Norrie watched New Zealand lose 17-9 to England at the Rugby World Cup\n\nNorrie, largely brought up in New Zealand by British parents, admitted that he had mixed loyalties when it came to England's rugby heroics on Saturday.\n\n'I only watched the end because I was playing my match at the start of it. I was supporting the All Blacks because they are such a sick team,' said Norrie, who stressed that in every other sport he supports England.\n\n'I thought England were incredible in taking them apart and they were just relentless, too good.'\n\nWhile superstars like Nadal are London-bound to the 02 Arena in November, it looks increasingly likely that they will be joined there by the less-known Joe Salisbury.\n\nThe 27 year-old from Putney won the doubles title at the ATP Vienna Open for the second year running, this time in the company of American Rajeev Ram.\n\nJoe Salisbury (right, with doubles partner Rajeev Ram) could be heading to London's ATP finals\n\nIt means that unless results conspire against them completely they will be in the eight-team field at the 02, with Salisbury the sole British representative.\n\nJamie Murray is missing out this year after switching mid-season to partner Neal Skupski.\n\nSalisbury and Ram's 6-4, 6-7, 10-5 win in Austria over Lukas Kubot and Marcelo Melo has put them within touching distance of a first-time berth at the tour finals.\n\n'Our eyes have been very closely on London, so this win is huge for us,' admitted Salisbury. 'It has been one of my goals since the start of the year, but even more so in the past few months. This is a massive, massive step to get there.'", "description": "MIKE DICKSON IN PARIS: Rafael Nadal is already assured of returning to the world No 1 spot next week, but that did not stop him restricting his honeymoon to just one day.", "authors": ["Mike Dickson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/20/20254952-0-image-a-8_1572208861433.jpg", "published_at": "2019-10-27"}