{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7568589/Tottenham-return-Bruno-Fernandes-January-club-braced-Christian-Eriksens-exit.html", "downloaded_at": "2019-10-13 18:57:56.039761+00:00", "title": "Tottenham 'to return for Bruno Fernandes in January' with club braced for Christian Eriksen's exit", "language": "en", "text": "Tottenham are set to renew their interests in Sporting Lisbon midfielder Bruno Fernandes when the transfer window reopens.\n\nThe club were strongly linked with the Portuguese star throughout the summer but a deal could not be made between the two clubs.\n\nNow A Bola, are reporting that the club's interest in the player is 'still alive' and that they will look to go back in for the 25-year-old in January.\n\nTottenham are set to rekindle their interest in Sporting Lisbon midfielder Bruno Fernandes\n\nThe report mentions that a potential move for Christian Eriksen to Real Madrid is a reason why the club could launch a fresh approach.\n\nDanish playmaker Eriksen, is in the last year of his contract and the club could lose him on a free transfer if he does not move on in the January transfer window.\n\nMeanwhile Fernandes was heavily in demand for most of the summer with several European giants reportedly interested.\n\nIt came after a stunning 2018-19 season in which the midfielder scored 31 goals in 50 appearances.\n\nDespite negotiations with various teams, no club was able to match Sporting Lisbon's valuation of the player which was in the region of £65m (€70m).\n\nTottenham had three bids rejected for Fernandes while Manchester United also refused to meet the asking price.\n\nDespite looking downbeat during pre-season training after the end of the summer transfer window, Fernandes has continued his good form into the new season.\n\nFernandes is linked to join the club to replace current playmaker Christian Eriksen\n\nFernandes so far has scored four goals in six appearances in the Primeira Liga.\n\nHe has also established himself as a regular in the national team and played in Portugal's Nations League final win over Netherlands back in June.\n\nTottenham meanwhile have struggled so far this season and are languishing down in 11th place in the Premier League after eight games.\n\nEriksen has featured in all of the club's league games so far though half of which have come off of the bench.", "description": "The attacking midfielder has previously been linked with a multi-million pound move to the Premier League, though Tottenham were unable to meet Sporting Lisbon's valuation of the player.", "authors": ["Kieran Lynch For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/17/19659388-0-image-a-78_1570982731543.jpg", "published_at": "2019-10-13"}