{"pub": "yahoo", "url": "https://news.yahoo.com/us-ambassador-takes-post-united-nations-141833297.html", "downloaded_at": "2019-09-12 23:44:57.488292+00:00", "title": "New US ambassador takes up post at United Nations", "language": "en", "text": "Kelly Craft, at her Senate confirmation hearing June 19, 2019, has taken up her post as the new US ambassador to the United Nations (AFP Photo/Stefani Reynolds)\n\nUnited Nations (United States) (AFP) - US Ambassador Kelly Craft took up her post at the United Nations on Thursday, vowing to defend America's values and interests nine months after the departure of her high-profile predecessor Nikki Haley.\n\nCraft, 57, served previously as US ambassador to Canada where she was involved in negotiations on a new US Mexico Canada free trade agreement.\n\nShe declined to speak with reporters on her arrival at UN headquarters, making her way to the 38th floor offices of UN Secretary General Antonio Guterres.\n\nBut later she made a brief statement without taking questions, after voting on UN resolutions on Libya, the Central African Republic and Colombia.\n\n\"I will defend America’s values and interests. I will stand by our friends and allies. I will advocate for the poor and the weak. And I will never fail to work with those who genuinely wish to advance the cause of human dignity,\" she said.\n\nHaley, who unlike Craft held cabinet rank, emerged as a strong voice of American foreign policy under the US President Donald Trump.\n\nAfter she stepped down at the end of last year, the role was filled by her number two, Ambassador Jonathan Cohen.\n\nCraft is married to coal company CEO Joe Craft, a big fundraiser and contributor to Trump's 2016 campaign and inauguration festivities.\n\nDuring a Senate confirmation hearing in June, she pledged not be an obstacle to climate diplomacy, and said she would recuse herself from UN discussions related to coal.\n\nThe annual UN General Assembly is expected to open September 23 with a summit on climate change with world leaders and UN chief Guterres.\n\nThe United States is the top financial contributor to the United Nations, paying a quarter of the cost of peacekeeping operations and 22 percent of its operating costs.", "description": "US Ambassador Kelly Craft took up her post at the United Nations on Thursday, vowing to defend America's values and interests nine months after the departure of her high-profile predecessor Nikki Haley.  Craft, 57, served previously as US ambassador to Canada where she was involved in negotiations", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/o4s1xlfCFqKyhGp7VzLXAQ--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/f5bbc19135065fcfff40e6ece9650f4ab225fa97.jpg", "published_at": "2019-09-12"}