{"pub": "yahoo", "url": "https://news.yahoo.com/nobel-season-opens-medicine-prize-031202273.html", "downloaded_at": "2019-10-07 12:33:40.140340+00:00", "title": "Trio win medicine Nobel for work on how cells adapt to oxygen", "language": "en", "text": "William Kaelin and Gregg Semenza of the US and Peter Ratcliffe of Britain were announced as the winners of 2019 Nobel Medicine Prize for discoveries on how cells sense and adapt to oxygen availability, which is paving the way for new cancer treatments (AFP Photo/Jonathan NACKSTRAND)\n\nStockholm (AFP) - Three researchers from the US and Britain on Monday shared the Nobel Medicine Prize for research into how human cells sense and adapt to changing oxygen levels, opening up new strategies to fight common diseases such as cancer and anaemia.\n\nWilliam Kaelin and Gregg Semenza of the US and Britain's Peter Ratcliffe split the nine million Swedish kronor ($914,000, 833,000 euros) award.\n\nWhile the fact that humans need oxygen to survive has been understood for centuries, how the body registers and responds to oxygen was little known prior to the trio's pioneering work.\n\n\"They established the basis for our understanding of how oxygen levels affect cellular metabolism and physiological function,\" the jury said.\n\nSemenza studied a gene known as EPO which causes the body to create more red blood cells and isolated the specific DNA segments that help it to adapt to low oxygen levels.\n\nRadcliffe and Semenza then applied this knowledge to show that the oxygen sensing mechanism was present in virtually all human tissues.\n\nKaelin identified another gene, present in patients with a genetic disorder that puts them at far greater risk of certain cancers. The gene rewires the body's ability to prevent the onset of cancer, and it plays a key role in how cancer cells respond to low oxygen levels.\n\nTheir work has shed new light on the specific, cell-level processes the body undergoes when low on oxygen -- from helping our muscles function during exercise to adapting to life at high altitude.\n\nCells' oxygen-sensing ability is also essential during fetal development and in creating new blood vessels.\n\n- Drugs being developed -\n\nA large number of diseases are linked to EPO, including renal failure and severe anaemia.\n\nCancerous tumours use the body's oxygen-regulating tools to hijack blood vessel formation and allow the cancer cells to spread. The Nobel committee said Monday that several trials were underway developing drugs to interrupt this process, potentially short-circuiting tumour growth.\n\n\"Intense ongoing efforts in academic laboratories and pharmaceutical companies are now focused on developing drugs that can interfere with different disease states by either activating, or blocking, the oxygen-sensing machinery,\" the jury said.\n\nKaelin, 61, works at the Howard Hughes Medical Institute in the US, while Semenza, 63, is director of the Vascular Research Program at the Johns Hopkins Institute for Cell Engineering.\n\nRatcliffe, 65, is director of clinical research at the Francis Crick Institute in London, and director of the Target Discovery Institute in Oxford.\n\nMonday's announcement opened an unusual 2019 Nobel season in which two literature laureates will be crowned after a scandal postponed last year's award.\n\nThe Peace Prize will be awarded in Oslo on Friday, with speculation rife that Swedish teenage activist Greta Thunberg could win for her campaign to raise awareness about climate change.\n\nOther names circulating for the honour are Ethiopian Prime Minister Abiy Ahmed, who clinched a peace deal with arch foe Eritrea, and NGOs such as Reporters without Borders and the Committee to Protect Journalists.\n\nBefore that, the Physics Prize will be announced on Tuesday and the Chemistry Prize on Wednesday.\n\nOn Thursday, the Swedish Academy will announce one literature laureate for 2018 and one for 2019, after postponing last year's award due to a sexual harassment scandal that exposed deep rifts among its 18 members.\n\nThe Academy has spent the past year trying to address its issues and restore its honour, and is therefore seen to be steering clear of controversy in its picks.\n\nAmong the writers who have been making a buzz include Poland's Olga Tokarczuk, Kenya's Ngugi Wa Thiong'o, Ismail Kadare of Albania, Joyce Carol Oates of the US and Japan's Haruki Murakami, say critics questioned by AFP.\n\nThe announcement of the Economics Prize will wrap things up on Monday, October 14.", "description": "Three researchers from the US and Britain on Monday shared the Nobel Medicine Prize for research into how human cells sense and adapt to changing oxygen levels, opening up new strategies to fight common diseases such as cancer and anaemia.  William Kaelin and Gregg Semenza of the US and Britain's", "authors": ["Pia Ohlin In Stockholm With Patrick Galey In Paris"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Gemg.nlNVoubnSImIPMEqQ--~B/aD00NDE7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/797bcf4d8a5e5bb02e5f13c057e45d80d3c3da21.jpg", "published_at": "2019-10-07"}