{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/25/democrats-demand-pentagon-probe-trumps-ukraine-aid", "downloaded_at": "2019-09-26 03:58:40.191510+00:00", "title": "Democrats demand Pentagon probe Trump's Ukraine aid delay", "language": "en", "text": "Democratic senators demanded Wednesday that the Pentagon’s inspector general investigate President Trump’s delay of military assistance money going to Ukraine, saying it appears to be part of Mr. Trump’s attempt to get Ukraine to investigate Democratic presidential frontrunner Joseph R. Biden.\n\nMr. Trump delayed the money by weeks over the summer, at about the same time he was asking Ukraine’s president to probe business deals by Mr. Biden’s son, Hunter.\n\nThe money was eventually released, but the senators, in a letter to the Defense Department’s acting inspector general, Glenn Fine, said the delay may have broken the law.\n\n“The delay would appear to have hindered the department’s statutory obligation to provide security assistance to Ukraine at a critical moment, and raises serious questions about whether DoD officials were involved in any scheme to target a political opponent,” Sen. Richard Durbin wrote in a letter joined by colleagues.\n\nA transcript of Mr. Trump’s conversation with the Ukrainian leader over the summer shows the president did pressure Ukraine to investigate Mr. Biden, but there was no quid pro quo offered.\n\nStill, the incident has angered Democrats enough that House Speaker Nancy Pelosi has said her committees are now beginning the impeachment process with an official inquiry.\n\nMr. Trump says the conversation was appropriate and he did nothing wrong. He says Mr. Biden is the one who should answer question.\n\nThe White House had cast the delay in Ukraine military assistance as a move to make sure the money was needed and was being properly spent.\n\nBut both Democrats and Republicans on Capitol Hill say the delay was unseemly and say the money should have gone out as Congress intended.\n\nMr. Durbin asked the inspector general to probe who ordered the money to be held up and what reasons were given.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Democratic senators demanded Wednesday that the Pentagon's inspector general investigate President Trump's delay of military assistance money going to Ukraine, saying it appears to be part of Mr. Trump's attempt to get Ukraine to investigate Democratic presidential frontrunner Joseph R. Biden.", "authors": ["The Washington Times Http", "Stephen Dinan"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2015/03/18/c08d9f0167a51f0c710f6a706700ced0_c0-272-5722-3608_s1770x1032.jpg?af0286c00f0d7ea0835b28127d8947d2fdc816e3", "published_at": "2019-09-25"}