{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/protest-houston-bridge-climate-change-democratic-debate-texas-trump-a9103231.html", "downloaded_at": "2019-09-13 00:57:26.792496+00:00", "published_at": "2019-09-12", "title": "Democratic debate: Greenpeace activists suspend themselves from Houston bridge over climate change", "language": "en", "text": "Environmental activists triggered the closure of part of the Houston Ship Canal after a dozen campaigners suspended themselves from a bridge to draw attention to climate change ahead of the latest Democratic debate.\n\nCampaigners, along with former candidates such as Washington governor Jay Inslee, have been disappointed by the Democratic Party’s decision not to assign one of the twelve scheduled debates solely to the issue of climate change, which many have said ought to be the nation’s – and the world’s – number one priority.\n\nAhead of the third debate in Houston, where the ten top polling candidate will appear, activists from Greenpeace USA suspended themselves from the Fred Hartman Bridge, near Baytown. They were estimated to be hanging around 100ft above the water.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“We’re doing it because we are in a climate change crisis. We have little more than a decade to transition to renewable energies from fossil fuels,” Greenpeace USA campaigner Travis Nichols told The Independent.\n\n“Our campaigners are saying to the oil and gas industry, it can longer be business as usual.”\n\nShape Created with Sketch. The Democrat challengers to Trump in 2020 Show all 22 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The Democrat challengers to Trump in 2020 1/22 Bernie Sanders The Vermont senator has announced that he will be running again in 2020 after losing out to Hilary Clinton in the 2016 Democratic primaries. He intends to run on a similar platform of democratic socialist reform Getty 2/22 Joe Biden The former vice president - poised to be a frontrunner - has announced his run. He recently faced scrutiny for inappropriate touching of women, but was thought to deal with the criticism well EPA 3/22 Elizabeth Warren The Massachusetts Senator has formally launched her bid for president in 2020. A progressive Democrat, she is a major supporter of regulating Wall Street. Reuters 4/22 Bill De Blasio The New York mayor announced his bid on 16 May 2019. He emerged in 2013 as a leading voice in the left wing of his party but has struggled to build a national profile and has suffered a number of political setbacks in his time as mayor AFP/Getty 5/22 Pete Buttigieg The Indiana mayor and war veteran will be running for president. If elected, he would be the first openly LGBT+ president in American history Getty 6/22 Beto O'Rourke The former Texas congressman formally launched his bid for the presidency in March. He intends to run on a progressive platform, stating that the US is driven by \"gross differences in opportunity and outcome\" AP 7/22 Steve Bullock The Montana governor announced his bid on 14 May. He stated \"We need to defeat Donald Trump in 2020 and defeat the corrupt system that lets campaign money drown out the people's voice, so we can finally make good on the promise of a fair shot for everyone.\" He also highlighted the fact that he won the governor's seat in a red [Republican] state Reuters 8/22 Cory Booker The New Jersey Senator has announced that he will be running for the presidency in 2020. If he secures the nomination he said finding a female vice president would be a priority Getty 9/22 Wayne Messam Mayor of the city of Miramar in the Miami metropolitan area, Wayne Messam has announced his bid. He intends to run on a progressive platform against the \"broken\" federal government. He favours gun regulations and was a signatory to a letter from some 400 mayors condemning President Trump's withdrawal from the Paris Climate Accord Vice News 10/22 Kirsten Gillibrand The New York Senator formally announced her presidential bid in January, saying that “healthcare should be a right, not a privilege” Getty 11/22 Kamala Harris The former California attorney general will be running for president in 2020. Introduced to the national stage during Jeff Sessions’ testimony, she has endorsed Medicare-for-all and proposed a major tax-credit for the middle class AFP/Getty 12/22 John Delaney The Maryland congressman was the first to launch his bid for presidency, making the announcement in 2017 AP 13/22 Tulsi Gabbard The Hawaii congresswoman announced her candidacy in January, but is likely to face tough questions on her past comments on LGBT+ rights and her stance on Syrian President Bashar al-Assad Getty 14/22 Andrew Yang The entrepreneur has announced his presidential candidacy, and has pledged that he would introduce a universal basic income of $1,000 a month to every American over the age of 18 Getty 15/22 Julian Castro The former San Antonio mayor announced his candidacy in January and said that his running has a “special meaning” for the Latino community in the US Getty 16/22 Marianne Williamson The author and spiritual adviser has announced her intention to run for president. She had previously run for congress as an independent in 2014 but was unsuccessful Getty 17/22 Eric Swalwell One of the younger candidates, Swalwell has served on multiple committees in the House of Representatives. He intends to make gun control central to his campaign Getty 18/22 Seth Moulton A Massachusetts congressman, Moulton is a former US soldier who is best known for trying to stop Nancy Pelosi from becoming speaker of the house Getty 19/22 Amy Klobuchar Klobuchar is a Minnesota senator who earned praise for her contribution to the Brett Kavanaugh hearings Getty 20/22 Jay Inslee Inslee has been governor of Washington since 2013. His bid centres around climate change AFP/Getty 21/22 John Hickenlooper The former governor of Colorado is running on a sensible ticket. He aims to sell himself as an effective leader who is open to compromise and evidences this with his experience as governor Getty 22/22 Tim Ryan Ohio representative Tim Ryan will be running a campaign that hinges on his working class roots Getty 1/22 Bernie Sanders The Vermont senator has announced that he will be running again in 2020 after losing out to Hilary Clinton in the 2016 Democratic primaries. He intends to run on a similar platform of democratic socialist reform Getty 2/22 Joe Biden The former vice president - poised to be a frontrunner - has announced his run. He recently faced scrutiny for inappropriate touching of women, but was thought to deal with the criticism well EPA 3/22 Elizabeth Warren The Massachusetts Senator has formally launched her bid for president in 2020. A progressive Democrat, she is a major supporter of regulating Wall Street. Reuters 4/22 Bill De Blasio The New York mayor announced his bid on 16 May 2019. He emerged in 2013 as a leading voice in the left wing of his party but has struggled to build a national profile and has suffered a number of political setbacks in his time as mayor AFP/Getty 5/22 Pete Buttigieg The Indiana mayor and war veteran will be running for president. If elected, he would be the first openly LGBT+ president in American history Getty 6/22 Beto O'Rourke The former Texas congressman formally launched his bid for the presidency in March. He intends to run on a progressive platform, stating that the US is driven by \"gross differences in opportunity and outcome\" AP 7/22 Steve Bullock The Montana governor announced his bid on 14 May. He stated \"We need to defeat Donald Trump in 2020 and defeat the corrupt system that lets campaign money drown out the people's voice, so we can finally make good on the promise of a fair shot for everyone.\" He also highlighted the fact that he won the governor's seat in a red [Republican] state Reuters 8/22 Cory Booker The New Jersey Senator has announced that he will be running for the presidency in 2020. If he secures the nomination he said finding a female vice president would be a priority Getty 9/22 Wayne Messam Mayor of the city of Miramar in the Miami metropolitan area, Wayne Messam has announced his bid. He intends to run on a progressive platform against the \"broken\" federal government. He favours gun regulations and was a signatory to a letter from some 400 mayors condemning President Trump's withdrawal from the Paris Climate Accord Vice News 10/22 Kirsten Gillibrand The New York Senator formally announced her presidential bid in January, saying that “healthcare should be a right, not a privilege” Getty 11/22 Kamala Harris The former California attorney general will be running for president in 2020. Introduced to the national stage during Jeff Sessions’ testimony, she has endorsed Medicare-for-all and proposed a major tax-credit for the middle class AFP/Getty 12/22 John Delaney The Maryland congressman was the first to launch his bid for presidency, making the announcement in 2017 AP 13/22 Tulsi Gabbard The Hawaii congresswoman announced her candidacy in January, but is likely to face tough questions on her past comments on LGBT+ rights and her stance on Syrian President Bashar al-Assad Getty 14/22 Andrew Yang The entrepreneur has announced his presidential candidacy, and has pledged that he would introduce a universal basic income of $1,000 a month to every American over the age of 18 Getty 15/22 Julian Castro The former San Antonio mayor announced his candidacy in January and said that his running has a “special meaning” for the Latino community in the US Getty 16/22 Marianne Williamson The author and spiritual adviser has announced her intention to run for president. She had previously run for congress as an independent in 2014 but was unsuccessful Getty 17/22 Eric Swalwell One of the younger candidates, Swalwell has served on multiple committees in the House of Representatives. He intends to make gun control central to his campaign Getty 18/22 Seth Moulton A Massachusetts congressman, Moulton is a former US soldier who is best known for trying to stop Nancy Pelosi from becoming speaker of the house Getty 19/22 Amy Klobuchar Klobuchar is a Minnesota senator who earned praise for her contribution to the Brett Kavanaugh hearings Getty 20/22 Jay Inslee Inslee has been governor of Washington since 2013. His bid centres around climate change AFP/Getty 21/22 John Hickenlooper The former governor of Colorado is running on a sensible ticket. He aims to sell himself as an effective leader who is open to compromise and evidences this with his experience as governor Getty 22/22 Tim Ryan Ohio representative Tim Ryan will be running a campaign that hinges on his working class roots Getty\n\nThe canal is part of the port of Houston and one of the busiest routes connecting regional terminals with the Gulf of Mexico. The port of Houston is home to the largest petrochemical complex in the US.\n\nOn Twitter, the group posted a link to a petition urging people to sign up in support of the Green New Deal, a policy initiative backed by many leading Democrats including Bernie Sanders, Elizabeth Warren and Alexandria Ocasio-Cortez, that would seek to move the US economy to one based on renewable energy over the next decade.\n\n“The Green New Deal could create millions of well-paying, union jobs that sustain families, not poison them,” says the petition.\n\n“It calls for the scale of action that we desperately need to stop climate catastrophe and confront systemic injustices head-on.“\n\nKHOU 11 reported that Harris County sheriff Ed Gonzalez said it and other organisations were monitoring events.\n\nThe Galveston County sheriff’s office said the activists would not be forced to leave. However, when they did so, they would face multiple charges, including obstructing the roadway and obstructing the waterway.\n\nA portion of the water traffic in the ship channel was stopped from Light 102A to 104 due to the demonstration. Traffic was reduced to two lanes.", "description": "Environmental activists triggered the closure of part of the Houston Ship Canal after a dozen campaigners suspended themselves from a bridge to draw attention to climate change ahead of the latest Democratic debate.", "authors": ["Andrew Buncombe"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/12/14/houston-bridge2.jpg"}