{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7542901/Royal-fans-gush-grown-Prince-George-adorable-display-watching-football-family.html", "downloaded_at": "2019-10-06 11:40:28.427222+00:00", "title": "Royal fans gush over 'grown-up' Prince George after 'adorable' display watching football with family", "language": "en", "text": "Advertisement\n\nRoyal fans are gushing over 'grown-up' Prince George after his 'adorable' and passionate display watching Aston Villa yesterday.\n\nThe six-year-old was seen bouncing around and cheering the team on as they played Norwich yesterday alongside his Prince William, 37, Kate Middleton, 37, and Princess Charlotte, 4.\n\nFans couldn't help but comment on how 'adorable' the little royal was, with one saying they couldn't believe how 'grown-up' George had become.\n\nOne wrote: 'How he has grown up! Great to see and every child should experience the elation. A time to win and a time to lose. Life learning lesson.'\n\nRoyal fans were left gushing online after seeing Prince George, 6, put on an excited display at a football match alongside his parents Prince William, 37, and Kate Middleton, 37\n\nMany took to twitter with their excitement, with many calling him 'so adorable', and another commenting that Prince George was so 'grown up'\n\nAnother commented: 'OMG. This video clip is just too adorable!! Future King, Prince George, loving football. You are in good hands, England.'\n\nThe royal family looked delighted as they cheered from the stands at their local stadium on Carrow Road on Saturday to support the Duke of Cambridge's favourite team opposing Norwich City.\n\nPrince George, six, put on a toothless grin throughout the match while wearing the Birmingham cub's T-shirt, before he punched the air as the team scored a goal - in what is believed to be his first ever football match.\n\nThe duke could be seen putting his arm around his eldest son as the pair relished the excitement of their first game together, in what is typically a rite of passage for father and son.\n\nRoyal fans gushed online over the family's 'normal' day out, and praised George as 'so adorable'\n\nBut it seems Prince George stole the show at the game, distracting viewers with his excited reactions to Aston Villa's 5 goals at Carrow Road.\n\nTaking to social media, one wrote: 'This is brilliant, the joy on his face is amazing.'\n\nWhile another commented: 'Beautiful family and Prince George is so cute and excited hehe.'\n\nRoyal fans were delighted to spot the family at the football game, which is believed to have been a first for Prince George and Princess Charlotte, 4,\n\nPrince George, six, put on a toothless grin throughout the match while wearing the Birmingham cub's T-shirt, before he punched the air as the team scored a goal - in what is believed to be his first ever football match\n\nThe duke could be seen putting his arm around his eldest son as the pair relished the excitement of their first game together, in what is usually a rite of passage for father and son\n\nAnother wrote: 'True fan! Go George! Aston Villa.'\n\nAnother viewer commented: 'Love the passion he already has for his team.'\n\nOthers praised the Cambridges for the 'normal' family day out, with many commenting how relatable the family appeared to be.\n\nOne wrote: 'I love how the Cambridges are, normal, happy, loving family, having the blast being together.'\n\nPrince George charmed royal fans with his antimated displays after watching his team score five goals in the match\n\nThe duke could be seen putting his arm around his eldest son as the pair relished the excitement of their first game together, in what is usually a rite of passage for father and son\n\nAnother commented: 'Glad they managed a normal time out with normal people. I think ti's necessary for the kids and it's lovely to be able to witness little times like this from afar.'\n\nPrince William is also an avid football fan and is a regular in the stands at Villa Park. He cheered the club to victory at Wembley last season.\n\nGeorge's love of football has been no secret, and the little Prince was even treated to a sports-themed party at Kensington Palace for his sixth birthday.\n\nAt one point, William and Kate appeared to try and gently calm Prince George as he wildly celebrated another goal\n\nAlthough there was no sign of 17-month-old Prince Louis, the other royal children, including Princess Charlotte top right, put on an excited display as they giggled with delight throughout the match\n\nPrince George's exuberant display appeared to amuse those seated around around the royal family, who couldn't help but crack a smile as he jumped up and down and clapped his hands throughout the game\n\nAccording to Hello magazine, Prince William, 37, and Kate Middleton, 37, hosted the 'after-school bash' event ahead of the little royal's sixth birthday on 22nd July.\n\nAnd the popular prince invited his whole class at Thomas Battersea to the football- themed occasion ahead of the end of term.\n\nThe youngster has proved posed for his official birthday photographs in an England shirt, and was pictured chasing after a ball with his younger sister Princess Charlotte at a polo match earlier this year in July.\n\nBoth George, six, and Princess Charlotte, four, seemed delighted throughout the Premier League match\n\nGeorge's love of football has been no secret, and the little Prince was even treated to a sports-themed party at Kensington Palace for his sixth birthday\n\nIt is believed the royal celebrated his birthday early so that he could enjoy an 'action-packed bash' with his friends from school before the end of term.\n\nPrince William is an avid football fan, follower of Aston Villa and president of the Football Association (FA).\n\nHe took over the role of from his uncle, the Duke of York, in 2006 and has taken a keen interest in all aspects of the game, including his support of the men's and women's national teams.\n\nHe previously spoke out about why he is a fan of the club, and told the BBC a 2015 interview: 'A long time ago at school I got into football big time.\n\nPrince George recently showed off his football skills alongside his younger sister Charlotte while attending a charity polo match\n\nFooty obsessed Prince George was seen enjoying a kick-about with sister Princess Charlotte recently\n\n'I was looking around for clubs. All my friends at school were either Man United fans or Chelsea fans and I didn't want to follow the run of the mill teams.\n\n'I wanted to have a team that was more mid-table that could give me more emotional rollercoaster moments.\n\n'Aston Villa's always had a great history. I have got friends of mine who support Aston Villa and one of the first FA Cup games I went to was Bolton v Aston Villa back in 2000. Sadly, Villa went on to lose to Chelsea.\n\n'It was fantastic, I sat with all the fans with my red beanie on, and I was sat with all the Brummie fans and had a great time.\n\n'It was the atmosphere, the camaraderie and I really felt that there was something I could connect with.'", "description": "Prince George, 6, charmed crowds yesterday after putting on an animated display at a football game. Royal fans gushed online about the little royal, commenting on how 'adorable' he is.", "authors": ["Harriet Johnston For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/10/19357206-0-image-a-27_1570354505378.jpg", "published_at": "2019-10-06"}