{"pub": "fox", "url": "https://foxbusiness.com/small-business/acting-sba-chief-chris-pilkerton-why-small-business-administration-investing-local-entrepreneurs", "downloaded_at": "2019-10-29 14:06:57.878823+00:00", "title": "Acting SBA chief Chris Pilkerton: Why the Small Business Administration is investing in local entrepreneurs", "language": "en", "text": "“I don’t know where I would be without this. It is the best thing I have ever done.”\n\nContinue Reading Below\n\nThese words were spoken to me by a young entrepreneur named Sumiara Yates who became involved in The Foundry, a makerspace located in the heart of downtown Buffalo, New York.\n\nKeeping with the mission of many makerspaces that operate around the country, The Foundry opens its doors to serve the local community as a business incubator, sharing resources, equipment and mentoring to advance education and entrepreneurship. (These businesses range from a successful t-shirt making company to a startup that makes an innovative do-it-yourself wooden bicycle kit.)\n\nThe Foundry is also a recent $100,000 award recipient from the SBA’s pilot Makerspace Training, Collaboration and Hiring (MaTCH) Competition. There is a large variety of makerspaces in this country, and they are well-positioned to serve as a catalyst for small business growth, workforce development and community engagement.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nThe work that occurs within makerspaces complements the SBA’s mission to help businesses start, grow and expand. These dedicated facilities provide a wonderful platform to launch business ventures across urban and rural communities.\n\nThe community engagement theme is not unique to Buffalo. I recently traveled to Philadelphia, Pennsylvania, where I spent time with the makerspace NextFab, also a $100,000 MaTCH Competition award recipient. Similar to The Foundry, NextFab incubates several cutting-edge technology-related businesses, as well as provides construction training and resources for local entrepreneurs.\n\nINSIGHT INVESTMENT’S GAUTAM KHANNA: LOW INTEREST RATES CAN HURT YOU — HERE IS WHAT YOU NEED TO KNOW\n\nWith the goal of meeting locally-based companies’ workforce needs, the makerspace strategically offers training to assist individuals with learning the necessary skills for future infrastructure projects.\n\nIn fact, NextFab also hosts a non-profit called Furnishing A Future which seeks to provide “job readiness training while making sturdy, durable furniture for families transitioning to affordable houses.” This organization provides training to veterans and other underserved populations and is now in a position where recent graduates are even hiring current program trainees.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nMs. Yates works at The Foundry thanks to its partnership with the WNY YouthBuild program, an organization sponsored by the U.S. Department of Labor.\n\nThis partnership is emblematic of the workforce development initiatives that President Trump is prioritizing where private businesses, non-profits and government agencies work together to spur employment opportunities for ambitious American workers. (The president’s National Council for the American Worker is joined by more than 350 companies who have signed the Pledge to America’s Workers, offering more than 14 million employment, education and training opportunities.)\n\nLIZ WESTON: HOW MUCH THE WRONG HEALTH CARE PLAN CAN COST YOU\n\nMakerspaces are a real-life example of the old adage: “Give someone a fish -- feed them for a day; teach someone to fish - feed them for a lifetime.”\n\nSBA is proud to partner with makerspaces across the country to support that vision by offering budding entrepreneurs and those looking to enter the workforce with a means to achieve success for themselves, their families and their surrounding communities. In a world where politics often overshadows these inspiring stories, this is a nice reminder that shared successes begin with collaboration and community.\n\nChris Pilkerton is acting administrator of the U.S. Small Businesses Administration.", "description": "SBA is proud to partner with makerspaces across the country to offer budding entrepreneurs and those looking to enter the workforce with a means to achieve success for themselves, their families and their surrounding communities.", "authors": ["Chris Pilkerton"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/06/0/0/Small-biz-week-pizzeria-.jpg?ve=1&tl=1", "published_at": "2019-10-28"}