{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7602667/Arnold-Schwarzenegger-declares-wasnt-scared-undergoing-emergency-heart-operation.html", "downloaded_at": "2019-10-23 09:15:32.263249+00:00", "title": "Arnold Schwarzenegger declares he wasn't ever 'scared' of undergoing emergency heart operation", "language": "en", "text": "Arnold Schwarzenegger wasn't ever 'scared' of undergoing an emergency heart operation.\n\nThe 72-year-old actor went under the knife in March 2018 to replace a faulty pulmonary valve in his heart - but Schwarzenegger has insisted he didn't fret about the operation.\n\nHe shared: 'It was kind of a surprise. I never get scared about these things.'\n\nThen and now: Arnold Schwarzenegger wasn't ever 'scared' of undergoing an emergency heart operation. Seen here in 1967 [L] and 2019 [R]\n\n'For a minute I was worried it was too close to doing Terminator 6 but I realized right away the movie is a good means to get back into shape again.\n\n'I was home in no time and was back to the gym in no time. Most people baby themselves too much after surgery.'\n\nSchwarzenegger has returned to one of his most iconic and physically demanding on-screen roles in Terminator: Dark Fate.\n\nMore energy: The 72-year-old actor went under the knife in March 2018 to replace a faulty pulmonary valve in his heart. He's seen here in May 2019\n\nBut the Hollywood star has insisted that, in spite of his advancing years, he relished the challenge of playing the deadly cyborg following his heart op.\n\nHe told The Sun newspaper: 'It's no problem. It gets a little bit harder the older you get. The body is not as forgiving as it used to be.\n\n'But you just have to train more, you have to do more reps. That's what it's all about.'\n\nShrugging it off: Schwarzenegger has insisted he didn't fret about the operation. He shared: 'It was kind of a surprise. I never get scared about these things.' Seen here in 1969\n\nMeanwhile, Schwarzenegger recently revealed he 'hates' politics.\n\nThe former professional bodybuilder served as the 38th Governor of California from 2003 to 2011, but he's now admitted to intensely disliking the political world.\n\nSchwarzenegger - who was born in Austria but later relocated to the United States - said, 'I hate politics. Even when I was Governor I never considered myself a politician.\n\n'I was a public servant who created policies to make things better for people.'", "description": "The 72-year-old actor went under the knife in March 2018 to replace a faulty pulmonary valve in his heart - but Schwarzenegger has insisted he didn't fret about the operation.", "authors": ["Dailymail.Com Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/23/20059744-0-image-a-59_1571784848483.jpg", "published_at": "2019-10-22"}