{"pub": "fox", "url": "https://foxnews.com/politics/esper-defends-u-s-withdrawal-from-syria-as-trump-decries-endless-wars-touts-sanctions-on-turkey", "downloaded_at": "2019-10-13 18:41:05.953929+00:00", "title": "Esper defends U.S. withdrawal from northern Syria as Trump decries 'Endless Wars,' touts sanctions on Turkey", "language": "en", "text": "Secretary of Defense Mark Esper defended President Trump's decision to withdraw U.S. forces from northern Syria as Turkey continues to attack the Kurds, while Trump himself denounced getting involved in \"endless wars\" and talked up sanctions against Turkey.\n\nTurkey has moved further into Syria, attacking the Kurds and leaving civilians dead in the process, while the U.S. is leaving Kurdish allies to fight for themselves.\n\nTURKISH FORCES CAPTURE CENTER OF KEY SYRIAN BORDER TOWN\n\n\"It gets worse by the house,\" Esper said on \"Fox News Sunday,\" saying that the U.S. is urging Turkish President Recep Tayyip Erdoğan to cease the aggression. Esper said the U.S. finds itself in a tough situation, as both sides are allies.\n\n\"We didn’t sign up to fight Turkey, a longstanding NATO ally, on behalf of the SDF,\" Esper said, referring to the Kurdish-led Syrian Democratic Forces.\n\nEsper said that roughly 1,000 troops will be withdrawing from the north of the country. A U.S. official told Fox News that forces will not be leaving the country altogether, but will be moving southward.\n\nEsper also stated that the fighting \"has its roots in conflict that goes back 200 years,\" a sentiment that was echoed by Trump himself Sunday morning.\n\n\"The Kurds and Turkey have been fighting for many years,\" Trump tweeted. \"Turkey considers the PKK the worst terrorists of all. Others may want to come in and fight for one side or the other. Let them! We are monitoring the situation closely. Endless Wars!\"\n\nWhile the U.S. is not getting involved militarily, Esper said the administration is \"doing everything we can to get the Turks to stop this egregious behavior.\"\n\nSen. Chris Van Hollen, D-Md., expressed skepticism over Trump's intention to punish Turkey.\n\n\"I don't know what this administration's waiting for,\" Van Hollen told \"Fox News Sunday,\" calling Turkey's actions \"absolutely sickening.\" The Democrat said he is currently working with Sen. Lindsey Graham, R-S.C., on bipartisan legislation that would impose sanctions on Turkey.\n\nVan Hollen said that while Senate Majority Leader Mitch McConnell, R-Ky., has not committed to supporting the bill, he believes that \"momentum is building for the Congress to act.\"\n\nTrump then tweeted that he, too, is working with Graham and other lawmakers from both parties to impose sanctions.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Treasury is ready to go, additional legislation may be sought,\" Trump said. \"There is great consensus on this. Turkey has asked that it not be done. Stay tuned!\"\n\nLast week, Trump vowed to \"totally destroy and obliterate\" the Turkish economy if they did anything \"off limits.\"\n\nFox News' Lucas Tomlinson contributed to this report.", "description": "Secretary of Defense Mark Esper defended President Trump's decision to withdraw U.S. forces from northern Syria as Turkey continues to attack the Kurds, while Trump himself denounced getting involved in \"endless wars\" and talked up sanctions against Turkey.", "authors": ["Ronn Blitzer"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/13/694940094001_6094498192001_6094500292001-vs.jpg", "published_at": "2019-10-13"}