{"pub": "guardian", "url": "https://theguardian.com/cities/2019/oct/21/waving-not-drowning-the-street-children-finding-refuge-in-durbans-surf-scene-photo-essay", "downloaded_at": "2019-10-21 07:37:14.516271+00:00", "title": "Waving not drowning: the street children finding refuge in Durban's surf scene", "language": "en", "text": "“I wanted to get that fresh air,” says 21-year-old Nonjabulo Ndzanibe, explaining why she ran away from her unhappy childhood home to the coastal city of Durban. “I just needed space for myself.”\n\nHaving grown up with a distant father – who spent part of her youth in prison – and a mother whom she didn’t feel loved by, it seemed like a welcome escape when a friend invited her to come and stay in Durban. In reality it would be a long time before she would eventually find refuge through surfing.\n\nNdzanibe did not know that her friend’s sister – with whom they were staying – was working as a prostitute, and that she expected Ndzanibe and her friend to start bringing in money as well. “If we didn’t come back with money, she would slap us.”\n\nNonjabulo Ndzanibe sits on the pavement.\n\nNonjabulo after a surf session.\n\nNonjabulo Ndzanibe on her way to the water.\n\nQ&A What is South African cities week? Show Hide Twenty-five years after the fall of the brutal apartheid regime, South Africa's cities remain hugely divided, both economically and racially. This week Guardian Cities explores the incredible changes taking place, the challenges faced and the projects that bring hope. Africa correspondent Jason Burke reports from the Flats, where violence and death are endemic just miles from Cape Town's spectacular beaches and trendy cafes. Author Niq Mhlongo pens a love letter to the \"other Soweto\", one that visitors to gentrified Vilakazi Street never see. We hear from Port Elizabeth, where one architect is using recycled materials to transform his city, and Durban, where a surf school is changing the lives of vulnerable children. We explore the deadly underground world of zama zama gold miners operating illegally under the city of Johannesburg, visit the Afrikaner-only town of Orania and publish an extraordinary photo essay by Magnum nominee Lindokuhle Sobekwa, who documents life in a formerly white-dominated area where his mother once worked as a domestic helper. Nick Van Mead\n\nAlone in an unknown city, afraid to go back home, Ndzanibe started roaming the streets. Sometimes she made a bit of money helping the police clean up car crash sites. Other times, when she didn’t have a boyfriend to provide for her, she would sleep with random men in order to afford a bed in a night shelter.\n\n“That was hard, because sometimes I wouldn’t even like that person, but I needed the money. To get what you want, you have to sleep with someone, they say. You can’t get anything if you keep your legs closed.”\n\nNdzanibe irons her clothing in the Surf House, a place where homeless children in Durban are being helped.\n\nOne day, as she was walking along the beach, someone introduced her to a surfing club for homeless children, Surfers Not Street Children. They offered her support and a place to stay.\n\nOriginally founded as Durban Street Team by activist and surfer Tom Hewitt in 1998, the organisation was able to track down an aunt of Ndzanibe who was more than willing to have her niece live with her in a loving environment and to get her back into school.\n\nA surf training session organised by Surfers Not Street Children.\n\nSurfers Not Street Children says: “Many children have come through our programmes and gone on to transform their lives … through a multifaceted approach that fuses surfing and mentorship alongside psychosocial care.\n\n“Our ultimate goal is to empower [children] to leave the streets behind for good and become independent. Surfers Not Street Children’s staff is made up of trained professionals and trained former street children, giving it a unique integrity amount the children it serves.”\n\nNdzanibe washes her board down after surfing.\n\nWilliam Zondi: ‘Giving up glue’\n\nYears after 22-year-old William Zondi ran away from home, his father recognised him on television, and learned where he could find him: on Durban’s beach, where he was surfing every day.\n\n“Everyone in the water came out, and told me: ‘Go to your dad’. But I said: ‘Guys, this is not my dad. He never showed me love.’” Zondi refused to go back home with him. “When I see him, there is no happiness for me. Only my mum used to love me.”\n\nWilliam Zondi catches a left-hander.\n\nHis mother died when he was seven years old. Zondi was so unhappy living with his dad and new stepmother that he boarded a train, not knowing where he was going. “I saw beautiful lights in Durban, and decided to get off there.” It was the start of a rough life on the streets.\n\nBeing introduced to surfing by Hewitt gave him something positive to focus on. “[When] I jump in the water, everything I was thinking goes out. I feel free,” Zondi says. But his life was by no means perfect.\n\nZondi in the homeless shelter where he lives in Durban.\n\nOne of the squatter areas of Durban, where street kids sleep.\n\nChildren and young boys in one of the squatter areas.\n\nThe scars on his back and the 9mm pistol he owns tell his story. “I have to have a gun to protect myself,” he says. Sleeping on the streets made him easy prey. “You wake up in the morning and you have no shoes left. The bigger guys take your money, your clothes, everything.”\n\nOnce he got his first surfboard, he would sleep on top of it. “On the streets, they used to steal our boards.” When he got stabbed in an attack, he would rush to the ocean instead of to the hospital. “The salt water burns, but then it closes very quickly.”\n\nSouth Beach was once reserved for white people under South Africa’s apartheid system. Zondi and his friends didn’t get a warm welcome there at first, and kept their distance from the white surfers. “But then they saw me doing big sprays. That’s when they knew blacks really liked this, and they called us over.”\n\n'Only we can change things': life in the gang-ridden other side of Cape Town Read more\n\nIt was surfing that made him stop sniffing glue, wanting to become stronger so he could handle bigger waves. “And that’s how I became fit, became who I wanted to be,” he says, proudly pointing at his shoulders, muscular from hours of paddling.\n\nBut lacking other income, he and his friends still resort to crime to afford food and a place at the shelter. “We just walk and see who are the ones with the big phones. We hold him by his neck until he sleeps, then we take whatever we want and run away.” The police leave them alone in return for some payment. He feels bad about it but he doubts he can ever go back to school and find a job because he has doesn’t have any papers.\n\nHe would love to learn how to read and write, even if it’s just to fill out the forms at surfing competitions. “Then I could write my own name.”\n\nZondi carries his surfboards to the ocean.\n\n• Ilvy Njiokiktjien’s 12-year project Born Free: Mandela’s Generation of Hope documents the lives of people born in South Africa around 1994, the first generation born after apartheid.\n\nFollow Guardian Cities on Twitter, Facebook and Instagram to join the discussion, catch up on our best stories or sign up for our weekly newsletter", "description": "Portraits of homeless children in Durban, South Africa, whose lives have been transformed by the Surfers Not Street Children charity", "authors": [], "top_image": "https://i.guim.co.uk/img/media/c8c4377dabb009d392e4f1984ff5f0092e9d8ee6/0_448_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d2510cdb9b3cbd4ecc499e7574416db8", "published_at": "2019-10-21"}