{"pub": "time", "url": "https://time.com/5686705/u-n-secretary-general-antonio-guterres-terrorism-threat", "downloaded_at": "2019-09-26 03:57:52.968292+00:00", "published_at": "2019-09-26", "title": "U.N. Head Warns World Faces 'Unprecedented' Terrorism Threat", "language": "en", "text": "(UNITED NATIONS) — Secretary-General Antonio Guterres warned Wednesday that the world is facing “an unprecedented threat from intolerance, violent extremism and terrorism” that affects every country, exacerbating conflicts and destabilizing entire regions.\n\nThe U.N. chief told a Security Council ministerial meeting on the sidelines of the annual gathering of world leaders that “the new frontier is cyber-terrorism — the use of social media and the dark web to coordinate attacks, spread propaganda and recruit new followers.”\n\nHe stressed that the response to the unprecedented terrorist threat “must complement security measures with prevention efforts that identify and address root causes, while always respecting human rights.”\n\nRussia, which holds the council presidency this month, organized the meeting on cooperation between the U.N. and three Eurasian organizations in countering terrorism — the Shanghai Cooperation Organization, Collective Security Treaty Organization, and Commonwealth of Independent States.\n\nThe Brief Newsletter Sign up to receive the top stories you need to know right now. View Sample Sign Up Now\n\nThe United States and its Western allies echoed the secretary-general, stressing the importance of respecting human rights in counter-terrorism operations.\n\n“Efforts to counter terrorism that do not respect human rights ultimately breed resentment and violent extremism,” U.S. deputy ambassador Jonathan Cohen said. “When member states or regional organizations conflate terrorism with non-violent political dissent, they do a disservice not only to the protection of human rights and fundamental freedoms, but to our global effort to defeat terrorism.”\n\nHe said the world is witnessing this “dangerous approach” in Syria, where the government and its Russian allies “justify as legitimate counter-terrorist operations airstrikes on civilians, schools, ambulances and hospitals that have killed over a thousand people since April and wounded over 2,000.”\n\nThe United States is also “deeply concerned” by the plight of more than one million ethnic minority Muslims in China’s Xinjiang province who have been arbitrarily detained “under the guise of counter-terrorism.”\n\n“China, like all nations, has every right to respond to actual terrorist threats, but counter-terrorism cannot be used as an excuse to repress the peaceful religious practices of Chinese Muslims and an entire minority group,” the Uighurs, Cohen said.\n\nRussia’s Foreign Minister Sergey Lavrov warned that the “terrorist threat” coming from Syria and Iraq is very rapidly spreading through Africa, including Libya, “and central, southern and southeast Asia are also becoming areas where savage acts of terrorism are perpetrated.”\n\nAlluding to Western criticism, he said, “the double-standards used by some countries make it more difficult to react to the challenges today, including the terrorist challenges.”\n\n“It is unacceptable — I underscore that — using terrorist entities for political purposes,” Lavrov said. “There can be no justification for this.”\n\nVladimir Norov, secretary-general of the eight-nation Shanghai Cooperation Organization, said the fight against terrorism and related threats is one of its main activities and called Wednesday’s meeting “extremely timely” because of increasing instability in the world due to the terrorist threat and its emerging link to transnational crime.\n\nHe said fighters that supported the Islamic State extremist group in Syria and Iraq “are striving to create new strongholds, including in the Eurasian space.” And he warned that “the threat of their access to radioactive and toxic substances is growing, and their possible use of new types of financing and weapons.”\n\nThe organization — which includes Russia, China, India and Pakistan — has half the world’s population and is regarded as the primary security pillar in the region, but Norov stressed that “it’s not a military organization aimed at other states.”\n\nValery Semerikov, secretary-general of the Collective Security Treaty Organization, told the council “the world is under threat of global terrorism” and joint work to combat it is needed today.\n\nHe said the organization — a six-nation military alliance of Russia, Armenia, Kazakhstan, Kyrgyzstan, Tajikistan and Belarus — made an open appeal to the North Atlantic Treaty Organization in May “on increasing trust and developing cooperation” in countering global threats and challenges.\n\n“I would like to address the foreign ministers of NATO and ask them to consider and react to the open appeal lodged by the ministers of foreign affairs of the CSTO,” Semerikov said.\n\nContact us at editors@time.com.", "description": "Secretary-General Antonio Guterres warns the world is facing \"an unprecedented threat from intolerance, violent extremism and terrorism\"", "authors": ["Edith M. Lederer"], "top_image": "https://timedotcom.files.wordpress.com/2019/09/un_secretary_general_antocc81nio_guterres_general-assembly.jpg?quality=85&crop=0px%2C42px%2C825px%2C432px&resize=1200%2C628&strip"}