{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7560683/Extinction-Rebellion-money-men-revealed.html", "downloaded_at": "2019-10-11 00:29:15.102533+00:00", "title": "Extinction Rebellion money men revealed", "language": "en", "text": "A UK billionaire worth £1.2billion and rock band Radiohead are among the major donors ploughing money into Extinction Rebellion.\n\nSir Christopher Hohn, one of the richest men in the UK, has given a hefty £50,000 to the environmental group, who unleashed a three-day Hong Kong-style protest at London City Airport today.\n\nSir Hohn told The Daily Telegraph: ‘I am a personal funder of Extinction Rebellion.\n\n'I recently gave them £50,000 because humanity is aggressively destroying the world with climate change and there is an urgent need for us all to wake up to this fact.’\n\nThe charity he co-founded, the Children’s Investment Fund Foundation (CIFF), is thought to have given a further £150,000 to the climate activist group.\n\nSir Christopher Hohn, one of the richest men in the UK, has given a hefty £50,000 to the environmental group\n\nEnvironmentalist group 'Extinction Rebellion' staging a protest in central London on Thursday\n\nIt is claimed none of the money he donated went towards the group’s acts of civil disobedience.\n\nHis hedge fund, named the Children’s Investment Fund, used to own a two per cent stake in Coal India, a state-backed company based in Kolkata. The stake was sold in 2014.\n\nThe firm extracted more than 400 million tonnes of coal from the ground in the year of the sale.\n\nAndrew Medway, a former bank trader who organises the group’s donations, said more than half of the donations have been raised online and more than 6,000 people have donated more than £600,000 this week.\n\nOther high profile donors include rock band Radiohead, which has already given £250,000, and Joe Corré, the founder of lingerie firm Agent Provocateur founder and son of Dame Vivienne Westwood, who has donated £50,000.\n\nOther high profile donors include rock band Radiohead (pictured) which has already given £250,000\n\nProtestors block the main entrance to London City Airport from the Docklands Light Railway on Thursday\n\nUS organisation Climate Emergency Fund, which is mainly financed by Aileen Getty, 62, the granddaughter of J Paul Getty, once the world’s richest man, has given £330,000 to the protestors.\n\nAs well as donations, a number of stars have joined the protest that started in London on Monday, such as Benedict Cumberbatch, model Daisy Lowe, comedian Ruby Wax and actors Juliet Stevenson and Mark Rylance.\n\nThe climate change activists appealed for donations following a police raid on its warehouse in Kennington, South London, last week in which tents and other equipment were seized.\n\nIts fundraiser for October’s London protests last night generated more than £825,000 so far.\n\nThe donations emerged after police said more than 1,000 activists have been arrested since the protests began on Monday.\n\nThe protests in the capital are part of an \"international rebellion\" happening in cities around the world, calling for urgent action to tackle climate change and wildlife losses.", "description": "Sir Christopher Hohn, one of the richest men in the UK, has given a hefty £50,000 to the environmental group, who unleashed a three-day Hong Kong-style protest at London City Airport today.", "authors": ["Joe Middleton For Mailonline", "George Odling For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/23/19562476-0-image-a-19_1570747048456.jpg", "published_at": "2019-10-10"}