{"pub": "huffpost", "url": "https://huffpost.com/entry/david-benioff-db-weiss-quit-star-wars_n_5db822c5e4b036b6a166b0a2", "downloaded_at": "2019-10-29 13:51:32.320547+00:00", "title": "'Game Of Thrones' Creators David Benioff And D.B. Weiss Quit 'Star Wars' Trilogy", "language": "en", "text": "The “Game of Thrones” creators tasked with making the new “Star Wars” trilogy have left the galaxy far, far away.\n\nDavid Benioff and D.B. Weiss quit their deal with Disney’s Lucasfilm, saying Monday that a new Netflix deal did not allow them to devote enough time to the space saga.\n\n“We love ‘Star Wars,’” the pair said in a statement, per The Hollywood Reporter. “When George Lucas built it, he built us too. Getting to talk about ‘Star Wars’ with him and the current ‘Star Wars’ team was the thrill of a lifetime, and we will always be indebted to the saga that changed everything.”\n\n“But there are only so many hours in the day,” they continued, “and we felt we could not do justice to both ‘Star Wars’ and our Netflix projects. So we are regretfully stepping away.”\n\nThe trilogy was intended to be a post-Skywalker series for the big screen that was set to premiere in 2022. Benioff and Weiss were confirmed in May as the directors of the first film.\n\nLucasfilm President Kathleen Kennedy softened the goodbye, noting they could come back in some form.\n\n“David Benioff and Dan Weiss are incredible storytellers,” she said, according to Variety. “We hope to include them in the journey forward when they are able to step away from their busy schedule to focus on ‘Star Wars.’”\n\nBenioff and Weiss, who were criticized for the final season of HBO’s “Game of Thrones,” reportedly signed in August the $200 million production deal with Netflix that is now scuttling their “Star Wars” plans.\n\n“Star Wars: The Rise of Skywalker” premieres in December and will close out the Skywalker big-screen era.", "description": "The two said their $200 million Netflix deal didn't give them enough time to work on the next generation of the space epic.", "authors": ["General Assignment Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5db82d6720000041325071a3.png?ops=1778_1000", "published_at": "2019-10-29"}