{"pub": "hotair", "url": "https://hotair.com/archives/allahpundit/2019/09/18/trump-hits-back-lindsey-graham-think-weak-not-bomb-iran-remind-iraq-turned", "downloaded_at": "2019-09-18 23:24:49.819254+00:00", "title": "Trump hits back at Lindsey Graham: If you think it was weak not to bomb Iran, remind yourself how Iraq turned out; Update: Bolton rips Trump policy at private event", "language": "en", "text": "My favorite thing about Trump is how little he gives Graham on foreign policy despite Graham kissing his ass relentlessly in hopes of turning him into a hawk. It’s commendable on the merits, in that Trump’s reluctance to wage war is a welcome corrective to the McCain/Graham-style of hyperinterventionism that ruled the GOP for years. But it’s also gratifying on a gut level, even as a Trump skeptic. “One of Trump’s more likable qualities is his penchant for publicly humiliating all the lickspittle Republicans who try and ride his coattails,” writes C.J. Ciaramella of Reason, remembering how Chris Christie was treated during the 2016 campaign. It’s true! What could be more enjoyable than watching Graham toady to the president day and night after dismissing him as a “kook” and a national security threat in 2016, believing that it will buy him influence over foreign policy, and as his reward having him endure daily reminders that Trump is far more inclined towards Rand Paul’s fopo views than Lindsey’s?\n\nThis exchange last night on Twitter was especially humiliating for Graham, and thus especially enjoyable.\n\nThis is literally an act of war and the goal should be to restore deterrence against Iranian aggression which has clearly been lost. — Lindsey Graham (@LindseyGrahamSC) September 17, 2019\n\nThe measured response by President @realDonaldTrump regarding the shooting down of an American drone was clearly seen by the Iranian regime as a sign of weakness. — Lindsey Graham (@LindseyGrahamSC) September 17, 2019\n\nNo Lindsey, it was a sign of strength that some people just don’t understand! https://t.co/EU8AvfH7j9 — Donald J. Trump (@realDonaldTrump) September 18, 2019\n\nMy first thought when I saw Trump’s tweet was that he meant it was Iran, not Graham, that didn’t understand his decision not to attack several months ago was a show of strength. They should have come to the table then, Trump was saying (I thought). Instead they went and attacked Saudi Arabia’s oil facilities, destabilizing energy markets, and now they’ll have to absorb some pain.\n\nBut no, he was definitely talking about Graham.\n\nTrump reacts to Sen. Lindsey Graham's criticism of his Iranian response: \"I actually think it's a sign of strength. … If you ask Lindsey, ask him, 'How did going into the Middle East, how did that work out?' … We have a disagreement on that\" https://t.co/4QcXQ1SA6w pic.twitter.com/Je9zSLIukc — CNN Politics (@CNNPolitics) September 18, 2019\n\nYou will not be surprised to learn that Graham’s preferred course of action is to start bombing Iranian oil refineries. You also won’t be surprised to learn that Trump is reluctant to order military action, dispatching Mike Pompeo to Saudi Arabia instead to “coordinate” an international response — whatever that means. U.S. intelligence sounds confident that the attack on the Kingdom did indeed come from Iran, partly because Saudi missile defenses were trained on Yemen and the Strait of Hormuz in the belief that any potential attack would originate there. Instead the missiles and drones that struck the oil sites came from southwestern Iran, evading detection. The Saudis could take the evidence to the UN Security Council with U.S. support and demand action, but Iran’s friends in Russia are likely to block any resolution imposing consequences. Trump could attack unilaterally, of course, either with conventional military action or cyberwarfare like that mysterious incident with the Iranian missile launch a few months ago.\n\nOr he could back off and let the Saudis handle this, which would be dangerous.\n\n“I’m a little concerned that he’ll go full Trumpian and greenlight a Saudi retaliation,” said Mark Dubowitz, head of the Foundation for Defense of Democracies, a think tank that advocates a hard line against Iran. Dubowitz said such a “worst case scenario” could lead Riyadh to act with impunity if Trump kept the U.S. out of the fray, and that could prompt a serious Iranian retaliation that leads to an escalating cycle of violence. “I’m of the view, based on decades of [Iranian] revolutionary response to American power, that if the United States uses military power, the regime is likely to back down, not escalate. If the Saudis use military power, the regime is likely to escalate,” Dubowitz said.\n\nA Saudi attack rather than a U.S. attack might be a recipe for protracted regional war. Where does that leave the “realist” view on this? Realists sneer at neoconservatives that their regime-change fantasies never work as planned and are in fact based on the foolish conviction that democracy will somehow liberalize fundamentally illiberal cultures. We should only use military force when it serves a concrete American interest, they warn. Well, there’s a looming Sunni/Shiite war in the region right now that’ll disrupt global oil supplies for God knows how long if it gets hot. Does that mean the “realist” view is to hit Iran ourselves, expecting — fingers crossed! — that they’ll absorb the blow and not dare retaliate? Or is the realist view to eschew bombs and tighten sanctions further even though our current sanctions are already onerous and the marginal utility in increasing them is diminishing? Further, Graham is certainly right that *at some point* inaction in the face of provocation signals weakness, which will invite further provocation. If Trump decides to slap Iran on the wrist for the Saudi attack and then Iran hits more oil facilities next month, what’s the move then? America’s posture can’t be “please, please sit down with us and talk!” in response to every move Iran makes.\n\nExit quotation from Pompeo, speaking in the Kingdom today: “The Saudis were the nation that were attacked. It was on their soil. It was an act of war against them directly.” Gulp.\n\nUpdate: Well, here we go. Nothing’s going to get an all-out war of hawks versus doves going like a standoff with Iran.\n\nJohn Bolton, President Donald Trump’s fired national security adviser, harshly criticized Trump’s foreign policy on Wednesday at a private lunch, saying inviting the Taliban to Camp David sent a “terrible signal” and that it was “disrespectful” to the victims of 9/11 because the Taliban had harbored al Qaeda… Bolton also said more than once that Trump’s failure to respond to the Iranian attack on an American drone earlier this summer set the stage for the Islamic Republic’s aggression in recent months. At one point, Bolton, a previous chairman of Gatestone who has resumed his title at the think tank, suggested that had the U.S. retaliated for the drone shootdown, Iran might not have damaged the Saudi oil fields.\n\nI trust the president will receive this news with his characteristic good cheer. An interesting detail to the story: Bolton was introduced as “the best national security adviser our country could have hoped for” by … Rebekah Mercer, one of Trump’s top patrons in 2016 and one of Breitbart’s top patrons to this day (as far as I know). Is Mercer siding with the hawkish establishment against the dovish populists on this one?", "description": "Hawks.", "authors": ["Jazz Shaw", "Ed Morrissey", "John Sexton"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/t-9.jpg", "published_at": "2019-09-18"}