{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7530513/Youve-got-fake-make-know-SUSANNA-REID-reveals-secret-TV-looks.html", "downloaded_at": "2019-10-05 08:03:19.113788+00:00", "title": "'You've got to fake it to make it... I should know': SUSANNA REID reveals the secret to her TV looks", "language": "en", "text": "At 7 o’clock on a Saturday evening, I am trying to follow a complex YouTube tutorial on how to create a ‘smokey eye’. It’s my ideal look for a night out, but I am completely clueless as to how to create it myself.\n\nFrom Monday to Thursday, I have the Good Morning Britain glam squad at work making me look my best (see the before and after pictures, below). Amy blow-dries the frizz from my hair, while Heather or Mel work on my face. They breeze into my dressing room, rolling suitcases of lotions and potions, ready to mask my blemishes and lines while I read the newspapers and briefing notes.\n\nAt home at the weekend, I am cast adrift, and my feeble attempts at a smokey eye quickly turn into a decidedly unglamourous ‘black eye’ before I get out the make-up remover. I turn to my trusty Bare Essentials tinted moisturiser and Lancome mascara, and head out the door.\n\nSusanna Reid, 48, writes in her second sparkling column for Femail that it is okay for women to look red carpet ready as long as they feel good inside\n\nThe working mother has also revealed the secret to her stunning looks on television - a really talented team! (Left) how she looks arriving for work at 4am, and (right) ready at 6am\n\nBut I wouldn’t want to go on air without my ‘armour’ on: make-up gives me a mask to help me do my job. I also have a weekly spray tan and dye my roots fortnightly.\n\nIt’s a case of faking it to make it, and I’m OK with that. I’m all for making ourselves look good — as long as we feel good, too. Feeling under pressure to look the same means we’ve gone too far.\n\nI have found my mood drop on occasion, scrolling through everyone’s ‘I’m having my best life’ Instagram looks. It’s one of the reasons I post bareface selfies on social media because, sometimes, the ‘amazing’ pictures give the wrong impression.\n\nOr consider the scene at the National Reality TV Awards this week. I rarely go out late, given my 4am start for work, but GMB had a clutch of nominations. Forget the red carpet, it should have been called the orange carpet, with the plump-lipped, bronzed cast of Love Island jostling with the team from Geordie Shore. The goody bag was 95 per cent fake tan products.\n\nI’d come straight from cooking my boys steak pie and veg for tea and couldn’t have felt less glam. Luckily, a sequinned dress works wonders — in fact, there appeared to be an unofficial dress code. The amount of flesh on show! Acres and acres of it.\n\nSusanna Reid, 48, (pictured) who is a new Femail columnist, revealed last week why she's stopped trying to be perfect and advises her family to embrace just being good enough\n\nSusanna also said that she turned up for the National Reality TV awards after cooking her boys steak pie and vegetables for the evening. (Susanna on Good Morning Britain on October 2)\n\n‘Fake’ used to be an insult, but now it’s a badge of honour, with hair extensions, tans and nails all artificial, but looking fabulous. No, I couldn’t pick half of these young stars out of a line-up, but they entertain millions every week — and I share their love of a fake eyelash.\n\nThis week's guilty click... When the alarm clock is set to a time you’d usually only get up at to catch a plane, anything that encourages sleep is worth investing in. When I spray and sniff Ren’s & Now To Sleep Pillow Spray (£18, renskincare.com), I feel drowsy. It might be a trick of the mind, but the smell of frankincense and lavender is divinely dreamy. Sleep Pillow Spray, £18, is this week's\n\nGMB had a good night, winning Best Talk Show, while I was thrilled to win Celebrity Personality of the Year and Best TV Presenter. I sipped sparkling water all evening and didn’t stay late — those reality stars know how to party.\n\nAs I left, the cast of The Only Way Is Essex shouted after me: ‘Give him hell tomorrow!’, referring to our own Rottweiler, Piers Morgan. For a man who professes to love winners and hate losers, he seemed oddly grumpy the next morning about my clutch of three awards!\n\nI do think the glitz of reality stars and social media is changing our society. At 20, I barely wore make-up and rarely visited a hairdresser. My graduation photo shows bushy brows and a blotchy complexion that make me cringe when I see it in Mum’s living room.\n\nBut, when I went back to Cardiff University recently, every graduate accepting their certificate had their ‘face on’ and a blow-dry.\n\nEven men are taking far more care of their looks. Just look at the photos of Simon Cowell, 59, on holiday in Mexico. He’s ditched the ‘dad bod’, lost 20lb on his vegan diet and switched cola for green juice. His skin looks smooth and his teeth are gleaming.\n\nThere’s speculation he’s had some ‘help’ — and, if he has, it’s made him look great.\n\nAs for older women, they blow me away. On the GMB sofa, gravel-voiced Bonnie Tyler revealed her smooth skin at 68 is down to ‘Botox twice a year’.\n\nThe TV presenter also revealed that that she thought ‘fake’ used to be an insult, but now it’s a badge of honour, with hair extensions, tans and nails all artificial, but looking fabulous\n\nActress Hayley Mills, 73, has a natural, softly lined face and wildly stylish silver-blonde hair. How does she look so fabulous?\n\nOFF-AIR GOSSIP When I asked Darcey Bussell about the new series of Strictly, she insisted she’s too busy to watch since quitting as a judge. I know the feeling. When you leave, it’s like a fab party going on without you. But she’ll find it hard to shimmy away from the Strictly questions for a long while yet.\n\n‘Not getting up at sparrow’s-fart every morning,’ she claimed, which doesn’t bode well for my hopes of looking that good in 20 years!\n\nAnd Trisha Goddard looks so youthful I couldn’t believe she turns 62 in December. ‘What’s your secret?’ I gasped. ‘I don’t know,’ she mused, before adding: ‘Actually, my secret is chemotherapy. I’m alive.’\n\nShe beat breast cancer back in 2008. She looks incredible, has a renewed zest for life and is pushing out of her comfort zone by going on TV’s Dancing On Ice.\n\nNow there’s a healthy perspective for you. There’s nothing fake about that.\n\nsusannareid@dailymail.co.uk\n\nWHAT I THINK OF THE BBC RACE ROW\n\nI’m a proud ex-BBC employee, but its flip-flop over presenter Naga Munchetty — first censured for sharing her experience of racism, then absolved when the decision caused uproar — doesn’t look good.\n\nAll its stars must be confused. What exactly can they say? At ITV, we’re bound by the same broadcasting impartiality rules. I would never want anyone to be able to tell which way I vote, but we’re encouraged to share our opinions and experiences — and viewers love it.\n\nThat’s especially important when, like Naga (pictured), a presenter has a personal story that’s truly relevant to the news. Otherwise, what are we there for?", "description": "Susanna Reid, 48, says in her second sparkling column for Femail that it's okay for women to look glamorous, as long as they feel good on the inside. She also reveals she is not good at make-up.", "authors": ["Susanna Reid For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/02/21/19224766-0-image-a-24_1570048668488.jpg", "published_at": "2019-10-02"}