{"pub": "news24", "url": "https://parent24.com/Baby/Fun/the-internet-is-just-about-ready-to-adopt-these-miracle-ivf-quintuplets-feel-good-reactions-to-make-your-day-20190709", "downloaded_at": "2019-10-15 23:11:16.551521+00:00", "title": "The internet is just about ready to adopt these miracle IVF quintuplets - feel good reactions to make your day", "language": "en", "text": "The internet is just about ready to adopt these miracle IVF quintuplets - feel good reactions to make your day\n\nHere's how local readers celebrated alongside the Nigerian couple who welcomed their five healthy babies after undergoing fertility treatment - a journey 18 years in the making.\n\nThe internet may not be a shining example of humanities finest, but not all the activity on social media involves intense sparring.\n\n\n\nWe recently published a story on a couple in their 40s who welcomed quintuplets after undergoing IVF treatment. The first-time parents had been childless for 18 years and the internet could not contain themselves.\n\nSome used their comments as a teaching moment (because, you know, quintuplets is how many babies again?), while others took the liberty of offering possible name choices to the couple.\n\nIt seems even the hagglers aren't immune to a feel-good story.\n\nHere are a few of the reactions we loved:\n\nAre you raising higher-order multiples? Share your story with us, and we could publish your mail. Anonymous contributions are welcome.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"At least now you'll have 5 headaches at once. Her 5-0 Infertility. Congrats\" - Isaac, Facebook user\n\n\n\n\n\n\"Fertility drugs [are] dangerous, you might end up with a creche!\" Noelene, Facebook user\n\n\n\nGolf Papi jokes but it's been known to happen: World record: Healthy twin miraculously born more than three months after her preemie sister – and both are thriving!\n\n\n\n\"Anyone [please] help, when there are four we call them fourplets or what?\" - AB, Facebook user\n\n\n\n\"Miracles do happen and congratulations to them\" - Maurice, Facebook user\n\nChat back:\n\nAre you raising higher-order multiples? Share your story with us, and we could publish your mail. Anonymous contributions are welcome.\n\nRead more:", "description": "Here's how local readers celebrated alongside the Nigerian couple who welcomed their five healthy babies after undergoing fertility treatment - a journey 18 years in the making.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9086/f807f197560f44ab8bb28c545559c965.jpg", "published_at": "2019-07-09"}