{"pub": "fox", "url": "https://foxnews.com/opinion/sally-pipes-warren-misleads-harm-medicare-for-all", "downloaded_at": "2019-10-28 00:25:59.737065+00:00", "title": "Sally Pipes: Elizabeth Warren misleads Americans on harm and costs of 'Medicare-for-all'", "language": "en", "text": "Last week, Sen. Elizabeth Warren promised to release her plan to pay for \"Medicare-for-all.\"\n\nThroughout her campaign, Warren has come under fire for refusing to say whether she would raise taxes on the middle class to fund her health care plan. Many of her fellow Democrats — including \"Medicare-for-all\" architect Bernie Sanders — have made clear that the plan would require tax hikes for everyone.\n\nBut Warren isn't just dodging the tax question. Like all \"Medicare-for-all\" supporters, she's misleading the public about the damage her plan would do to the finances and health of every American.\n\nARNON MISHKIN: DEMOCRATIC PRESIDENTIAL RACE HEATING UP – BIDEN, WARREN AREN'T ONLY CANDIDATES WHO COULD WIN\n\nEven \"Medicare-for-all\" supporters acknowledge it would be pricey. A new report from the left-leaning Urban Institute predicts the plan would cost $34 trillion over its first decade. Sanders has said that it could cost up to $40 trillion over 10 years.\n\nThat's more than the cost of Medicare, Medicaid and Social Security combined.\n\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\n\nWarren claims she can finance \"Medicare-for-all\" by taxing the rich. But aggressively taxing wealthy individuals and corporations would only generate enough revenue to cover 40 percent of the cost of \"Medicare-for-all,\" according to a new study by the Committee for a Responsible Federal Budget.\n\nThat's why Sanders has floated a number of new taxes on almost every single American, including a 4 percent tax on each household and a 7.5 percent payroll tax. Sanders claims Americans would pay less for health care under \"Medicare-for-all\" than they currently do, even taking into account their higher tax burden. Warren has promised something similar — that \"Medicare-for-all\" would \"lower costs for middle-class families.\"\n\nAccording to an analysis by an Emory University professor, 70 percent of working, privately insured Americans would pay more for health insurance under a single-payer, \"Medicare-for-all\" system than they do today.\n\nBut the evidence suggests otherwise. According to an analysis by Emory University professor Kenneth E. Thorpe, 70 percent of working, privately insured Americans would pay more for health insurance under a single-payer, \"Medicare-for-all\" system than they do today.\n\nThey'd face even higher taxes if \"Medicare-for-all\" wound up costing more than projected. It wouldn't be the first time budget experts underestimated the cost of a government insurance program. In 1967, the House Ways and Means Committee predicted that the newly created Medicare program would cost around $12 billion by 1990.\n\nMedicare spending actually reached $110 billion in 1990.\n\n\"Medicare-for-all\" advocates claim that the focus on its cost to the federal government is disingenuous. We're already spending well over $3 trillion a year on health care. The Warren/Sanders plan would relieve individuals and employers of that spending — and re-apportion it to the federal government.\n\nSanders and his allies like to cite a study from the libertarian Mercatus Center, which assumes that \"Medicare-for-all\" will adopt the existing Medicare program's low payment rates — and thus save the country $2 trillion over a decade.\n\nOf course, extending Medicare's payment schedule across the entire health care system would reduce payments to doctors and hospitals by 40 percent, relative to private insurance. And it would raise demand for care by 11 percent.\n\nIn other words, \"Medicare-for-all\" posits that doctors and hospitals will have no qualms about treating more patients for less money.\n\nIt's more likely that doctors and hospitals will respond to lower payment rates by reducing the supply of care they're willing to deliver. Americans would find themselves in the same position as patients in the United Kingdom's government-run National Health Service, where more than 4 million are currently waiting for care.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThose Britons pay an awful lot to wait in line. The average household in the United Kingdom pays over £5,000 in taxes each year just for health insurance. That's an increase of 75 percent since 2000. And it's likely to rise further. Two British think tanks predict that each British household will have to pay an additional £2,000 per year to keep the NHS running as the population ages.\n\nThe American people are unlikely to reward politicians who raise their taxes by thousands of dollars — and then tell them to get in line for health care. Perhaps that's why Warren has been uncharacteristically mum on her plan for paying for \"Medicare-for-all.\"\n\nCLICK HERE TO READ MORE FROM SALLY PIPES", "description": "Like all \"Medicare-for-all\" supporters, Warren is misleading the public about the damage her plan would do to the finances and health of every American.", "authors": ["Sally Pipes"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/22/694940094001_6096793220001_6096793622001-vs.jpg", "published_at": "2019-10-27"}