{"pub": "foxnews", "url": "https://foxnews.com/opinion/michael-goodwin-donald-trump-cia-spies-dems-war", "downloaded_at": "2019-09-30 10:44:00.182984+00:00", "title": "Michael Goodwin: Donald Trump now has to battle CIA spies in Dems' war against him", "language": "en", "text": "It would be understandable if President Trump wakes up troubled these days by four words bouncing around his head: \"Loose lips sink ships.\"\n\nUnderstandable — and advisable. The World War II warning against careless talk carries a personal meaning for the beleaguered president. ­Beset by a hostile media and a ruthless opposition party, Trump now must be careful about every word he says, privately and publicly.\n\nThe walls, including those in the White House, have ears.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThat was demonstrated in spades last week, most dramatically by the allegations from a CIA officerthat Trump used a phone call with the president of Ukraine to solicit foreign help in the 2020 campaign. That allegation and others led to a fiery congressional hearing and spurred Democrats to quicken their pace toward impeachment.\n\nCLICK HERE TO GET THE OPINION NEWSLETTER\n\nA second instance of snooping made the “loose lips” point less sensationally but was still disturbing. Before he left the United Nations Thursday, Trump attended a private event to thank the new American ambassador, Kelly Craft, and her staff for their work during the General ­Assembly session.\n\nSome privacy. The president said, “I want to know who’s the person, who’s the person who gave the whistleblower the information? Because that’s close to a spy.”\n\nWe know he said that and more ­because someone at the event, maybe more than one person, secretly ­recorded his remarks, both audio and video, and promptly leaked them to the media.\n\nWhen it comes to brickbats, Trump is perhaps the most battle-tested occupant the Oval Office has ever known, yet the two incidents demonstrate that the war against him has entered a vicious new phase. Efforts to end his presidency, one way or another, have reached a fever pitch, and Trump would be foolish to assume they will fail. His margin for error is approximately zero.\n\nCLICK HERE TO CONTINUE READING MICHAEL GOODWIN'S COLUMN IN THE NEW YORK POST\n\nCLICK HERE TO READ MORE BY MICHAEL GOODWIN", "description": "The walls, including those in the White House, have ears.", "authors": ["Michael Goodwin"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/28/694940094001_6090287564001_6090293338001-vs.jpg", "published_at": "2019-09-29"}