{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7561463/DIY-enthusiast-transforms-cheap-furniture-luxury-designs-savvy-tricks.html", "downloaded_at": "2019-10-13 00:25:44.535601+00:00", "title": "DIY enthusiast transforms cheap furniture into 'luxury' designs with her savvy tricks", "language": "en", "text": "A woman who transforms budget furniture into 'luxury' designs has turned her creative eye for DIY into a booming business.\n\nKylie Grimshaw Hughes, who lives in Queensland, re-purposes flat-pack products and basic household accessories with stylish panels, handles and stencils.\n\nBy sharing the results of her handiwork on her social media account Lux Hax, Ms Hughes has built a thriving fan base and now sells custom overlay panels and door knobs online.\n\nDIY interior decor business Lux Hax is run by Queensland woman Kylie Grimshaw Hughes, who revitalises budget furniture with custom panels and mirrored geometric designs\n\nLux Hax specialises in transforming budget-friendly IKEA furniture like bedside tables, headboards and kitchen cupboards with geometric prints called 'Styl-Panels'.\n\nPanels retail between $19.95 and $114.95.\n\nThe customised panels, which come in a variety of dimensions, should be positioned on the surface of furniture and stuck down using double-sided tape or a construction strength adhesive.\n\nThe business breathes new life into basic Kmart mirrors and glass accessories by fixing made-to-order panels over the frame.\n\nLux Hax also stocks Danish-made wooden door handles for cabinets and presses.\n\nLux Hax specialises in transforming budget-friendly IKEA furniture like kitchen cupboards with geometric prints called 'Styl-Panels'\n\nThe customised panels are stuck onto furniture using double-sided tape or construction strength adhesive\n\nLux Hax also shares clever households hacks from other DIY enthusiasts, including this set of nest tables from IKEA which were sprayed with gold paint to fit the maximalist theme of the sitting room\n\nLux Hax boasts a five star rating online, with a stream of satisfied customers gushing over their revitalised furniture.\n\n'I am in love with my daughter's new chest of drawers - from boring to luxe, what a difference!' a Brisbane mother said on Facebook.\n\n'I placed my order for a Styl-Panel on Tuesday and it come on Thursday - such fast and efficient service!' another woman wrote.\n\nSatisfied customers heaped praise on Lux Hax Styl-Panels for breathing new life into their dull and dowdy furniture\n\nLux Hax also stocks Danish door and cabinet handles (pictured, the $13.45 Skal handles are shown on a TV bench re-purposed into a hall seat)\n\n'The panel is exactly how it's described and portrayed in the photos. It doesn't look like a sticker, it totally transforms the furniture and makes it look a million dollars!\n\n'I'll be a customer again for sure.'\n\nOne woman praised the clever designs and lamented how she 'only wish I'd thought of this first'.\n\nLux Hax offers free delivery across Australia on purchases of $150 or more.", "description": "Australian DIY enthusiast Kylie Grimshaw Hughes transforms cheap furniture into luxury designs and shares the impressive results on her social media account, Lux Hax.", "authors": ["Alice Murphy For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/06/19573968-0-image-a-24_1570773022833.jpg", "published_at": "2019-10-12"}