{"pub": "nymag", "url": "https://vulture.com/2019/10/succession-episodic-storytelling-formula.html", "downloaded_at": "2019-10-15 12:53:53.663185+00:00", "title": "Succession Builds an Episode Better Than Any Show on TV", "language": "en", "text": "Tick, tick, tick … Photo: HBO\n\nThe finale of Succession was a beautiful, bone-rattling thing. The developments that made it feel so surprising, so specifically shocking and yet inevitable, were stories the show’s been building from the beginning. Kendall and Logan’s warped parent/child relationship has been Succession’s fulcrum from the start, tilting from Kendall’s desperate desire for affirmation and toward rebellion.\n\nBut lots of TV series have tried similar slow-burn strategies, and, especially within the past several years, the results have tended to range from mild disappointment to spectacular failure. It’s Hang On Until Episode 8 When It Gets Good Syndrome, the thing that happens when a show is too focused on kicking the can down the road, promising that delayed gratification will be better than immediate pleasure. You could also call it Ozark Syndrome, or House of Cards/Man in the High Castle/Daredevil Syndrome. It is generally but not exclusively Streaming Drama Syndrome, an issue that plenty of non-streaming series have also suffered from. (Game of Thrones, here’s looking at you!) The thing Succession has figured out, the structure that inoculates it from boggy, “you can only appreciate it when you see the whole season” storytelling, is that Succession builds an episode better than any hourlong show on TV right now.\n\nSuccession’s favorite episodic formula is not hard to identify. In nearly every episode of season two, Roys jet off to some new location. For the majority of the hour, they’re either trapped together in that place or they’re split off into parallel stories that act as direct counterbalances to whatever’s happening in the primary location. They travel en masse to the Argestes conference, and everything is pointed toward the potential Piece sale. They go to the Pierce compound on Long Island together; they travel to London to chase down an important shareholder; they descend on Washington for the cruise division’s congressional hearings; they arrive in Dundee, Scotland, to celebrate Logan’s 50 years in business. In the finale, they’re trapped together on the luxurious prison of the family’s Mediterranean yacht, forced to circle each other warily, passing one another awkwardly on the way down the massive inflatable slide, stuck in their bubble of familial angst.\n\nIt’s not quite the same as a bottle episode, that special case of TV storytelling where characters are all stuck together on a single set for an entire episode. There are private spaces inside the Roys’ glamorous self-imposed dungeons — inner sanctums where Logan sits like a king holding court and idyllic coves where Tom and Shiv can go lacerate each other while trapped in paradise. In an active-shooter situation, there are fake safe rooms and real safe rooms, and everyone’s relative status and value are weighed against everyone else’s as they divine the meaning of who gets slotted where. Every new location offers new opportunities to judge one’s worth. Does Tom get the fruit-and-nut welcome basket at the exclusive media conference, or does he get the Champagne-and-paperweight basket? Is Shiv on the family jet to London, or does she need to get there herself? It means that every episode offers its own internal version of a Roy-family power ranking, reframed for wherever new place they find themselves. Once the dynamics of a location have played themselves out, once everyone’s figured out which child is going to ride with Logan to the airport and maneuvered themselves so they’re closer or farther from the center of power, the episode ends and the dance begins again, with everyone shuffling around some new mansion-sized chessboard.\n\nSuccession is still playing a long game. Things that happen early on the show reverberate weeks and months later. Its stories are driven by power and resentment, two motives that can only be satisfying when played out over a sufficiently long time frame. But rather than casting an extended line into the future and spinning its wheels while waiting for a trap to spring, Succession turns each episode into its own distinct battleground, an explosion that’s ineluctable because it’s so relentlessly contained. It’s devastating and it’s also economical: There are many layers and subplots happening at any given moment, side stories about marriages and presidential runs and business divisions. But any major blast — the Pierce sale, the cruise-ship scandal, the proxy battle — is guaranteed to hit every single player. Succession is a show where characters are perpetually vying for their own self-interest, but because each episode is so self-contained, the message it communicates again and again is that their fates are inextricably linked.\n\nMaking episodes with aggressively self-contained conceits is not the only way to make a great TV show. One of the best dramas on TV right now, David Simon’s The Deuce, totally ignores the idea of an episode as a particular conceit and instead plays with the episode as a kind of musical meter: Each unit has its own rhythm, shaped more by emotional beats than a specific problem or theme. Lodge 49, in keeping with its laid-back surfer vibe, uses the boundary of an episode as a frequently useful but not required tool. (Sometimes stuff just happens, man.) But for a long time, the great and canny use of an episodic conceit was a hallmark of many of the best TV dramas, stretching across shows like Mad Men, Breaking Bad, Lost, The Sopranos, and ER, and going back through Northern Exposure, Homicide, Hill Street Blues, and earlier. It’s a tradition that’s gotten a little lost lately, especially on streaming platforms, but often on prestige-cable outlets, too. Succession’s episodic structure feels notable because it feels like it’s doing something TV shows have too often ignored lately. Succession makes the best use of the hourlong episode since Mad Men.\n\nIt’s also worth appreciating because the way Succession builds its stories offers a gorgeous, painfully effective illustration of the show’s deepest ideas. The Roys can jet to London and the Mediterranean, or to a boar-hunting weekend in Hungary; if mobility were the same as freedom, they’d be the freest people in the world. Instead, they arrive again and again at these exclusive places and are effectively locked inside. They get buckled into the mechanisms of each episode’s crisis, and they are incapable of getting off the ride.\n\nSuccession’s episodes tell elegant, opulent, contained stories, and the form mimics the theme. These people are held apart, insular and isolated from everything else. Their lives exist in self-contained spaces, hermetically sealed from the rest of the world. It’s a show built on long story arcs and masterful performances and a delicate balance between satire and gravity, but it’s also built on episodes that are constructed like walled gardens: gorgeous, enclosed, and inescapable.", "description": "Every episode of the HBO series, and season 2 in particular, arranges the Roy family on a new, distinct battleground, where characters vying for their own self-interest are also inextricably linked.", "authors": ["Kathryn Vanarendonk"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/11/succession/11-succession-6.w1200.h630.jpg", "published_at": "2019-10-15"}