{"pub": "hotair", "url": "https://hotair.com/headlines/archives/2019/10/trumps-betrayal-kurds-may-turning-point", "downloaded_at": "2019-10-18 01:08:05.808106+00:00", "title": "Trump’s betrayal of the Kurds may be a turning point", "language": "en", "text": "More and more of his competent advisors will jump ship. If you’re a serious national security professional, why stick around when you realize that Trump isn’t listening to you and instead is taking his talking points from a former Army reservist whose main qualification is being a jerk on Twitter? You will leave, and Trump will have a hard time finding anyone decent to replace you. That’s one of the lessons of the text messages found in the investigation into Trump’s July call to Ukraine. One of the diplomats recruited to deal with Ukraine was brought on very reluctantly. Describing the “new world” of the Trump administration, he said, “I’m not sure that’s a world I want to set foot in.” How many others will decide the same thing and say “no” in the future?\n\nAt some point, we could find ourselves left with nothing but a bunch of Rudy Giulianis—opportunists feeding the president conspiracy theories and promoting their own corrupt personal agendas—and things are going to get way crazier and even more dangerous than they are now.\n\nAnd the responsible adults will leave not just because they know President Trump isn’t listening to them, but also because they know their own reputations are going to be sullied. Usually, even if the public turns against a president, people can still say they served their president honorably. Historically, it’s always been a good resumé item to be a former Deputy Undersecretary of this or that. But what if that’s not the case from here on in? What if it’s a source, not only of guilt and sleepless nights, but of professional shame?", "description": "", "authors": ["Robert Tracinski", "Thebulwark.Com Trumps-Betrayal-Of-The-Kurds-May-Be-A-Turning-Point"], "top_image": "", "published_at": "2019-10-18"}