{"pub": "breitbart", "url": "https://breitbart.com/news/michael-douglas-on-turning-75-feeling-good", "downloaded_at": "2019-10-11 04:01:46.663281+00:00", "title": "Michael Douglas on turning 75: ‘Feeling good’", "language": "en", "text": "Oct. 10 (UPI) — Michael Douglas is “feeling good” following his 75th birthday.\n\nThe actor and producer discussed aging and his family during Thursday’s episode of The Ellen DeGeneres Show.\n\nDouglas turned 75 years old Sept. 25, and shares a birthday with wife Catherine Zeta-Jones, who is 25 years his junior. His father, actor Kirk Douglas, will celebrate his 103rd birthday in December.\n\n“I’m moving right along,” Douglas said. “I had a cancer bout about eight or nine years ago where I sort of thought about [aging]. Once I got a clean bill of health after that, it was kind of straight on, feeling good.”\n\n“Having a younger bride makes me feel good on one side; I’ve got the old man over here on the other side who still has a full head of hair,” he added. “It’s all good. You can’t be an idiot about it. So 75, I look at the 15-year program, if I still got my marbles by the time I’m 90. After that, it’s all golden.”\n\nDouglas said he keeps active by working out and playing golf. He jokingly told host Ellen DeGeneres his golf game hasn’t improved with age.\n\n“I do a cardio mixup with weights,” he shared. “I recently have been having some trouble with my back playing golf, so I’m working with a trainer now, doing a little more core and body work in other areas.”\n\nDouglas is parent to three children, son Cameron with Diandra Luker and son Dylan and daughter Carys with Zeta-Jones, and grandparent to Cameron’s daughter, Lua. He said Dylan, 19, has proven to be a daredevil.\n\n“He just did a skydiving thing,” Douglas said. “I remember that age. It’s a hormonal thing, I think for boys, testing yourself.\n\n“What I did not like is he was the first one to jump,” he added. “I said, ‘Don’t be the first one to jump. Let a couple people go off first to see if there’s any rocks in there.’”\n\nDouglas plays Sandy, an acting coach and a dad to Mindy (Sarah Baker), in the Netflix series The Kominsky Method. The show co-stars Alan Arkin and Nancy Travis, will return for a second season featuring Jane Seymour on Oct. 25.", "description": "Oct. 10 (UPI) — Michael Douglas is “feeling good” following his 75th birthday. The actor and producer discussed aging and his family", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-10"}