{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/28/WS5db64abaa310cf3e35573e93.html", "downloaded_at": "2019-10-28 02:47:04.189541+00:00", "title": "Put some tiger in your tank", "language": "en", "text": "Neither animal part nor nut, discover the healthy taste sensation that's spreading around the world: tiger nuts. [Photo provided to China Daily]\n\nIf you're looking for new ways to eat healthier, you may have already heard about tiger nuts, which are quickly gaining global traction. Contrary to what the name implies, tiger nuts are neither cherished animal parts, nor are they nuts. They are, in fact, edible tubers, much like potatoes. They're a bit larger than a chickpea, and they have a slightly sweet taste and a chewy texture.\n\nKnown by its scientific name Cyperus esculentus, tiger nuts grow wild all over the world because of their hardiness; they're most widely cultivated in Spain, West Africa and India. Above ground, the tiger nut plant, which has many names including yellow nutsedge, looks similar to a tuft of grass. Below ground, though, tiny tubers form along its root system, and just one plant can produce several hundred to several thousand tubers during a single growing season. With its deep, spreading roots, it's not surprising that many people consider it to be a weed rather than a food source.\n\nTiger nuts. [Photo provided to China Daily]\n\nBut for people who do eat those tiny tubers, tiger nuts are healthy in a variety of forms. People in the Valencia region of Spain like to drink a sweet milk-like beverage called horchata de chufa (check out our recipe). In West Africa, tiger nuts are eaten raw as a side dish. Tiger nut oil can be used in salads or for frying. Tiger nut flour, which is high in insoluble fibre, can be used in gluten-free paleo cakes, cookies and breads. A growing number of cosmetics also now contain tiger nut oil due to its high antioxidant content.\n\nGood news: Tiger nuts are also high in monounsaturated fat (that's the fat you want in your diet), vitamins C and E, and minerals such as iron, phosphorus, zinc, potassium and magnesium. They're low in calories – and they may even boost libido, too. So if you're looking to put some tiger in your tank, tiger nuts are a great way to add more nutrition into your diet.\n\nNeither animal part nor nut, discover the healthy taste sensation that's spreading around the world: tiger nuts. [Photo provided to China Daily]\n\nHorchata de Chufa\n\n• 1 cup tiger nuts\n\n• 2 cups cold water\n\n• 2 Tbsp maple syrup\n\n• ½ tsp cinnamon\n\n• Ice\n\nRehydrate the tiger nuts by letting them soak for a minimum of 12 hours in enough water to completely cover them. (You may need to change the water a few times to get rid of any impurities.) After they have finished soaking, discard the water.\n\nUsing a blender, blend the tiger nuts with half of the cold water until a whitish paste forms. Strain the liquid through a strainer into a bowl and add the tiger nut paste back into the blender. Add in the rest of the water and continue to blend for about a minute. Strain the liquid out again, but this time press the paste hard against the strainer with a spoon to remove as much liquid as you can. (Alternatively, squeeze the mixture through cheesecloth.) Put all the liquid collected back into the blender, add some ice, maple syrup and cinnamon, and blend. Serve immediately.\n\nAnd don't throw away all that tiger nut pulp! Dry it out in your oven and then grind it up in your coffee grinder until it becomes a fine flour. You can use it to make delicious high-fibre, gluten-free baked goods.", "description": "", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/28/5db64abaa310cf3e97a32d33.jpeg", "published_at": "2019-10-28"}