{"pub": "investingcom", "url": "https://in.investing.com/news/stock-market-news/bull-run-in-global-equities-is-old-but-not-dead-citigroup-says-1998662", "downloaded_at": "2019-10-03 09:43:37.740343+00:00", "published_at": "2019-10-03", "title": "Bull Run in Global Equities Is Old But Not Dead, Citigroup Says", "language": "en", "text": "© Reuters. Bull Run in Global Equities Is Old But Not Dead, Citigroup Says\n\n(Bloomberg) -- The global rout in equities that kicked off October hasn’t dissuaded Citigroup Inc (NYSE: ). strategists from their optimistic view of the market.\n\nThe bull run in stocks that began a decade ago isn’t over, Robert Buckland, Citigroup’s chief global equity strategist, wrote in an Oct. 2 note. Citi forecasts a 9% gain in global equities by the end of 2020, albeit with “dips along the way.”\n\nStocks worldwide tumbled in the first two days of the month as unexpectedly poor data on U.S. manufacturing and payrolls stoked worries about economic growth. Citi sees a global recession as the biggest threat to its positive view.\n\n“It is too early to call the end of this 10 year global bull market, although the risks remain considerable,” Citi wrote in a note. “Our market targets suggest that U.S. equities will continue to lead the way.”\n\nGlobal equities have had a stellar run in the past decade, with the MSCI All Country World Index nearly tripling from a low in March 2009. While the recent string of bad data is threatening stocks’ best annual gains since 2017, Citi expects central banks to continue supporting risk assets in 2020 by easing policy in response to slowing economies and low inflation.\n\nCiti endorses U.S. equities, while it’s underweight on emerging-market shares as earnings growth is weakening. U.K. stocks, among the worst performers in Europe this year, are its preferred value trade. Within sectors, information technology and health-care stocks are favored, while financials are an underweight despite “tempting valuations.”", "description": "Bull Run in Global Equities Is Old But Not Dead, Citigroup Says", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEB000OS_L.jpg"}