{"pub": "yahoo", "url": "https://uk.style.yahoo.com/kim-kardashian-west-opens-depression-161600842.html", "downloaded_at": "2019-09-15 07:51:30.955025+00:00", "title": "Kim Kardashian West Opens Up About 'Depression' Following Recent Medical Test Result", "language": "en", "text": "From ELLE\n\nKim Kardashian West is reminding her fans that despite her fame and fortune, she isn’t immune to the health concerns that the rest of us face in life.\n\nEarlier this month, the 38-year-old spoke about her recent lupus-related health scare on the season premiere of her hit reality series Keeping Up With The Kardsahians.\n\nNow, the beauty mogul has opened up about the depression she experienced as a result of testing positive for lupus antibodies, stating that she felt it was crucial for her to ‘get it together’ - emotionally and psychologically - for her family.\n\nIn an interview with Entertainment Tonight on Thursday, the mother-of-four discussed her recent health issues.\n\nPhoto credit: Dimitrios Kambouris - Getty Images More\n\n'When you do have a diagnosis, or you get tested for something and you get a result that you weren't expecting, you definitely get in your head and for a second you kinda get this little depression of, like, \"OK, what are all of the possibilities that can happen?\"' the star said.\n\n'\"What's my life gonna look like? I really wanna be active for my kids.\" And so it triggers something,' the KKW beauty company founder explained.\n\nThe star said that she had to focus on being positive for the sake of her husband, Kanye West, and children - North, six, Saint, three, Chicago, 20 months, and Psalm, four months.\n\n‘No matter what's going on in your life, you can take that time to grieve for a second… and then figure out how to be positive about it because it's not going to change,’ she said.\n\n'There's no point in being depressed and staying in that headspace, but I felt it for a minute.'\n\nThe NHS states that lupus – otherwise known as systemic lupus erythematosus (SLE) - is a long-term health condition causing inflammation to the joints, skin and other organs. While there is no cure for lupus, treatment includes anti-inflammatory medicines and steroid tablets, injects and creams.\n\nLady Gaga and Selena Gomez have previously spoken about their experience of living with lupus.\n\nKardashian West, who recently launched her SKIMS size-inclusive shapewear, said that she first began experiencing pain in her hands as a result of the inflammatory lupus disease.\n\n'Until I figured out what was really going on, I just needed to take a break from lifting the baby, and that was really hard for me,' she revealed.\n\n'My baby Chicago was, like, a big baby. She's not light. But I was really worried because I had my baby coming, my baby boy [Psalm], and I thought it would be hard for me.'\n\nThe reality star added that she is now on medication and that ‘everything seems to be fine for right now.\n\n‘I’m just rolling with it day by day,’ she added.\n\n\n\n\n\nYou Might Also Like", "description": "‘I really wanna be active for my kids’", "authors": ["Katie O'Malley"], "top_image": "https://s.yimg.com/uu/api/res/1.2/YyTvNeA5OsHwXjl97CSbeQ--~B/aD0xNDQwO3c9Mjg2ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/elle_865/967c72d7927a2f99db4a0b2922ef36e0", "published_at": "2019-09-14"}