{"pub": "usatoday", "url": "https://usatoday.com/story/opinion/2019/10/27/isis-leader-bakr-baghdadi-demise-triumph-civilization-editorials-debates/2478423001", "downloaded_at": "2019-10-28 00:25:32.181320+00:00", "title": "ISIS leader Bakr al-Baghdadi’s demise is a triumph for civilization over barbarity", "language": "en", "text": "For now, President Trump and his administration deserve credit for bringing the terrorist to justice in a daring raid: Our view\n\nThe founder and inspiration of a terror movement that excelled at instilling fear — via genocide, slickly produced execution videos and brutal subjugation under a self-described caliphate — has been brought to his deserved demise. The death of Islamic State leader Bakr al-Baghdadi during a U.S. military raid, like the killing of al-Qaida founder Osama bin Laden eight years ago, helps fulfill a promise President George W. Bush made after the terror attacks of Sept. 11, 2001.\n\n\"We will rout out the terrorists,\" Bush vowed, \"no matter what cave they think they can hide in, and bring them to justice.\"\n\nTracking down individual terrorist leaders, no matter how notorious, has proved to be extraordinarily difficult; in fact, bin Laden deputy Ayman al-Zawahri remains at large. But thanks to the relentless work of U.S. intelligence services, coupled with the military efficiency of the nation's elite special forces, there really is no place where the world's most wanted terrorists can hide forever.\n\nTwisted interpretation of Islam\n\nAl-Baghdadi learned as much. A careful student of the terrorist savagery promoted by Jordanian jihadi Abu Musab al-Zarqawi, al-Baghdadi founded an insurgent army in 2014 that conquered a swath of territory across Syria and Iraq the size of Belgium. He proclaimed himself a descendant of the Prophet Muhammad's tribe and exhorted Muslims across the world to follow.\n\nUnder his twisted interpretation of Islam, his fighters attempted genocide — according to the United Nations — of the Yazidi religious minority in northern Iraq, killing or enslaving thousands; they also executed 1,700 Iraqi air cadets after capturing a military base.\n\nThe Islamic State, also known as ISIS, either inspired or directly launched attacks across the globe that left more than 1,200 dead, including 130 killed in coordinated shootings in Paris in 2015. Its bloodthirsty ideology spread to the United States, where security guard Omar Mateen swore allegiance to ISIS before slaughtering 50 at an Orlando nightclub in 2016, and a similarly inspired California couple killed 14 in 2015 at a community center in San Bernardino.\n\nVideo image on a militant website on April 29, 2019, purports to show Abu Bakr al-Baghdadi. (Photo: Al-Furqan media via AP)\n\nOTHER VIEWS: ISIS leader was 'the top national security priority of my administration'\n\nAl-Baghdadi refined the art of terror for the internet age, dressing U.S. captives like American journalists James Foley and Steven Sotloff in orange jumpsuits — like those used at the notorious U.S. detainment center Abu Ghraib in Iraq — and broadcasting their gruesome beheadings.\n\nIt remains an open question whether al-Baghdadi's death will staunch the violence of an ISIS organization that has become decentralized and durable since going underground after eradication of the caliphate in March by a U.S.-led coalition. Even though its founder is gone, its hateful ideology endures and new leaders will undoubtedly emerge.\n\nOdds of ISIS reemerging\n\nIronically, the vacuum President Donald Trump created this month by precipitously withdrawing most U.S. troops from Syria could tragically improve the odds of ISIS — with an estimated 15,000 to 30,000 fighters still at large — reemerging.\n\nTime will also tell whether Trump's melodramatic recounting Sunday of al-Baghdadi's last moments (\"He died like a dog. He died like a coward. He was whimpering, screaming and crying.\") was accurate or unnecessarily embellished.\n\nFor now, though, Trump and his administration deserve credit for bringing the terrorist leader to justice in a daring raid that, officials said, resulted in no American casualties. It should be recognized as a significant milestone for the U.S. military and the commander in chief — who would have been blamed and second-guessed had the mission gone tragically awry.\n\nAn evil man's time has ended, and for that all Americans can take comfort. Al-Baghdadi's death is a victory for civilization over barbarity.\n\nUSA TODAY's editorial opinions are decided by its Editorial Board, separate from the news staff. Most editorials are coupled with an opposing view — a unique USA TODAY feature.\n\nTo read more editorials, go to the Opinion front page or sign up for the daily Opinion email newsletter. To respond to this editorial, submit a comment to letters@usatoday.com.\n\nIf you can't see this reader poll, please refresh your page.\n\nRead or Share this story: https://www.usatoday.com/story/opinion/2019/10/27/isis-leader-bakr-baghdadi-demise-triumph-civilization-editorials-debates/2478423001/", "description": "For now, President Donald Trump and his administration deserve credit for bringing the Islamic State terrorist to justice in a daring raid: Our view", "authors": ["The Editorial Board", "Usa Today", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/27/USAT/b7427959-63eb-4cf0-b165-3963da3daf3d-Bakr_al-Baghdadi.ourview.jpg?crop=2499,1406,x0,y96&width=3200&height=1680&fit=bounds", "published_at": "2019-10-27"}