{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7600169/Penny-Lancaster-shares-stunning-snaps-holiday-Tanzania-husband-Rod-Stewart.html", "downloaded_at": "2019-10-22 13:47:52.463846+00:00", "title": "Penny Lancaster shares more stunning snaps from her holiday to Tanzania with husband Rod Stewart", "language": "en", "text": "Penny Lancaster looks to be having the time of her life as she shared several more snaps from her holiday of a lifetime to Tanzania with Rod Stewart.\n\nThe former model, 48, took to Instagram and showed her followers what the couple have been up to on the excursion where they have been spending time soaking up the culture of the local Massai people.\n\nThe couple have been going on the Legendary Expeditions safari with Penny sharing a snap next to man who she called her 'Massai warrior' in the caption.\n\nAdventure: Penny Lancaster, 48, looks to be having the time of her life as she shared several more snaps from her holiday of a lifetime to Tanzania with Rod Stewart, 74\n\nPenny also shared several snaps of herself standing next to a group of Massai women.\n\nShe wrote: 'Sharing my photos that I took of the girls. I could have spent the whole day with them.'\n\nThe TV star and her rock star husband took part in some local activities as part of their tour with Penny sharing a video of herself taking part in a dance with a large group of women.\n\nRod, 74, also shared a photo to his Instagram and told how he was relishing the couple's trip.\n\nTrip: Penny took to Instagram and showed what the couple have been up to on the excursion where they have been spending time soaking up the culture of the local Massai people\n\n'Verified Humbled by the warmth of the local Maasai tribe in one of the family homes,' he wrote.\n\nRod and Penny have been exploring the Serengeti from the comfort of the luxurious Mwiba Lodge, set in a private 51,000-acre wildlife reserve.\n\nThe couple shared a number of pictures showing the whole family - including sons Aiden, eight, and Alastair, 13 - immersing themselves in local customs, as well as making the most of the exclusive setting.\n\nThe five star lodge gives guests the opportunity to see wildlife as well as cultural experiences, giving you access to four different Tanzanian tribal communities.\n\nCulture: Penny shared a video of herself taking part in a dance with a large group of women\n\nPenny wrote: 'Sharing my photos that I took of the girls. I could have spent the whole day with them'\n\nHoliday: Rod also shared a photo to his Instagram and told how he was relishing the couple's trip\n\nFeaturing 10 rented suites laid out in a semi-circular formation and connected by wooden walkways, there is also a spa and swimming pool on site.\n\nPrices for a double room with an all-inclusive stay are in the $1,000 (£769) to $1,250 (£962) range per person in low season.\n\nPenny shared: 'Learning the ways of the Mwiba tribe #legendaryexpeditions #tanzania'.\n\nShe also encountered an elephant while on safari, sharing a beautiful photo of the animal in the wild.\n\n'This elephant is know by the locals as One & a half for his shorter left tusk. He is one of the more elderly of the herd and therefore not in contention for breading so is free to wonder far from the herd. #mwibalodge #tanzania', she wrote.\n\nAfrican adventure: Penny and Rod have been exploring the Serengeti from the comfort of the luxurious Mwiba Lodge\n\nPhoto album: The couple shared a number of pictures showing the whole family - including sons Aiden, eight, and Alastair, 13 - immersing themselves in local customs\n\nUp close and personal: Penny also came close to an elephant while on safari, sharing a beautiful photo of the animal in the wild\n\nLuxury accommodation: The five star lodge gives guests the opportunity to see wildlife as well as cultural experiences, giving you access to four different Tanzanian tribal communities\n\nSir Rod is no doubt enjoying every moment after receiving the all-clear from prostate cancer in July following a secret three-year battle with the disease.\n\nSpeaking recently on Loose Women, a visibly emotional Penny recalled: 'He's very up on his health. He doesn't believe in retirement, he wants to keep going forever, so he's always getting screenings and tests...\n\n'It's emotional. We kept it quiet for two and a half years now. The positive news is we caught it early enough.'\n\nDetailing the gruelling radiation treatment the Maggie May singer underwent to beat the disease, she said: 'Rod and I were travelling into London at the same time every single day, going to the clinic.\n\nBrave: Penny broke down in tears as she discussed Rod's battle with an 'aggressive' form of prostate cancer during a recent episode of Loose Women\n\n'Rod's never done one day, one week the same ever in his entire life. He put his positive head on, along with myself. The nurses had a little room for him. He took his computer, he said this was like my day in the office.'\n\nRod - who also has adult children Sarah Streeter, Kimberly Stewart, Sean Stewart, Ruby Stewart, Renée Stewart and Liam Stewart from previous relationships - and Penny decided not to tell his two youngest children until after he was given the all-clear.\n\nShe said: 'We told the older ones. Aidan was only five or six so wasn't old enough to understand. It would be too much for them [the younger ones] to understand.\n\n'When daddy finally told everybody the good news, and to get the message out there for guys out there over 50 go and get the test, then we told the little ones.'", "description": "The former model took to Instagram and showed her followers what the couple have been up to on the excursion where they have been spending time soaking up the culture of the local Massai people.", "authors": ["Sean O'Grady For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/12/20032354-0-image-a-38_1571743671001.jpg", "published_at": "2019-10-22"}