{"pub": "breitbart", "url": "https://breitbart.com/news/houstons-cole-tries-to-bounce-back-in-world-series", "downloaded_at": "2019-10-27 04:04:25.923582+00:00", "title": "Houston’s Cole tries to bounce back in World Series", "language": "en", "text": "Washington (AFP) – Houston ace pitcher Gerrit Cole tries to avenge his only loss since May when he faces a rematch against Washington’s Max Scherzer in Sunday’s crucial fifth game of the World Series.\n\nThe Astros stumbled in the opener of Major League Baseball’s best-of-seven final at home when the Nationals tagged Cole for five runs on eight hits, two of them homers, over seven innings in a 5-4 victory.\n\nDespite striking out six, Cole suffered his first loss in five months, a run of 19-0 over 25 games with a 1.59 earned-run average and an MLB-best 258 strikeouts in 169 1/3 innings.\n\nIt’s a drubbing the 29-year-old US right-hander must shake off when he takes the mound in Washington.\n\n“The tenacity shown in the first game is something to be admired for sure,” Cole said Saturday.\n\n“They won some two-strike counts. They battled. The intensity grows as we get deeper into October, just the intent and the certainty on the approaches, the focus on the pitches continues to just raise across the board. So you have to respond to that.”\n\nCole must raise his level again now that Washington batters are more familiar with the array of siders, curves, changeups and fastball pitches he will use to try and baffle them.\n\n“I expect them to be good and they are really good,” Cole said. “There are always challenges involved in that. Anticipate having to respond to some things and hopefully we respond well.”\n\nCole hasn’t changed his basic strategy from a season in which he went 20-5.\n\n“My game plan isn’t to go in and strike out 13-14 guys a game. My game plan is to try to execute the pitches,” Cole said.\n\n“If I execute them at a high level and pick the right ones at the right times, my stuff allows me to get swing and miss. If you’re a team, that doesn’t do that, maybe you just swing and miss less.”\n\nThe Nationals were patient in the first two games, young slugger Juan Soto saying he would wait until Cole threw a fastball to make a swing.\n\n“I would expect him to be looking for a fastball after the first at-bat,” Cole said.\n\nCole, a free agent after the Series, is expected to command the top deal ever signed by a major league pitcher, currently $217 million by David Price, and he might pass teammate Zack Greinke’s record for annual value at $34.4 million, especially with the big-spending New York Yankees in the hunt.\n\n“I’m not thinking about anything past the next few days,” Cole said.\n\nWhether on Sunday or in a possible seventh-game appearance, Cole plans to exhaust himself in hopes of getting the Astros a second crown in three seasons.\n\n“I hope I go home with nothing left in the tank,” he said. “I hope I’m absolutely dog tired by the time I get home.”\n\n– ‘Mad Max’ set to battle –\n\nHis Washington counterpart, Scherzer, struck out seven and walked three over five innings, surrendering two runs on five hits in winning the opener.\n\nThe 35-year-old right-hander nicknamed “Mad Max” is a three-time Cy Young Award winner as best pitcher and led the National League in strikeouts from 2016-2018.\n\n“After the first game, he sat down and mapped out his game plan for the next game. He’s all in,” Nats manager Dave Martinez said.\n\nPatient Houston hitters forced Scherzer to throw 112 pitches over five innings and figure to test him once again.\n\n“They don’t chase,” Martinez said. “We’ve got to attack the strike zone. We need to be aggressive, but aggressive in the strike zone.”\n\nScherzer is ready for whatever Houston batters bring in only their second meeting with Scherzer in more than two years.\n\n“It’s just going to be a challenge,” he said. “The only advantage is I don’t face the Houston Astros that much. I could execute better and give their hitters a little bit different look.\n\n“No matter what, it’s always going to be a battle.”", "description": "Washington (AFP) – Houston ace pitcher Gerrit Cole tries to avenge his only loss since May when he faces a rematch against Washington’s Max", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/26/a114c5_washington-pitcher-max-scherzer-start-game-world-series-host-nationals-640x335.jpg", "published_at": "2019-10-26"}