{"pub": "marketwatch", "url": "https://marketwatch.com/story/european-stocks-lower-after-chinese-growth-slows-and-renault-warns-2019-10-18", "downloaded_at": "2019-10-18 10:36:09.990800+00:00", "title": "European stocks lower after Chinese growth slows and Renault warns", "language": "en", "text": "European stocks weakened Friday after the release of data showing a slowdown in Chinese growth and a warning from French automaker Renault.\n\nThe Stoxx Europe 600 SXXP, -0.09% declined 0.12% to 392.59.\n\nThe German DAX DAX, +0.10% fell 0.03% to 12650.98, the French CAC 40 PX1, -0.43% fell 0.34% to 5653.86 and the U.K. FTSE 100 UKX, -0.16% weakened 0.26% to 7163.94.\n\nChina on Friday reported the worst growth in 27 years, as GDP slowed to a 6% year-over-year rate in the third quarter as fixed investment dipped.\n\n“Investment is import intensive, so taxing trade taxes [hurts] investment. Uncertainty about trade also gives companies reason to pause in their investment. However, it is reasonable to suggest that – as long as there are no more trade taxes – the worst of the investment slowdown may be behind us,” said Paul Donovan, an economist at UBS.\n\nRenault RNO, -12.06% fell 12.7% as the company said its operating margin for the year would be 5% instead of 6%, and that revenue should fall between 3% and 4%.\n\nDeutsche Bank downgraded the stock to hold from buy, as the broker pointed out that rising costs more than lower revenue was responsible for the profit warning. “Thus, there is a risk that the situation will not improve next year since most of these additional costs are expected to be recurrent,” the broker said.\n\nOther automakers including Daimler DAI, +0.23% and Fiat Chrysler Automobiles FCA, -1.68% also fell.\n\nDanone BN, -7.81% dropped 7.2% as the yogurt maker reported third-quarter organic sales growth of 3%, which was lower than forecast, and cut its annual guidance to 2.5% growth from 3%. Danone said disappointing U.S. yogurt sales and weakness in European bottled water revenue weighed on its results.\n\nGetinge GETI.B, +20.26% rallied 18% as the Swedish medical technology company reported 4.8% organic sales growth and 3.5% increase in orders during the third quarter.", "description": "European stocks dropped Friday after the release of data showing a slowdown in Chinese growth and a warning from French automaker Renault.", "authors": ["Steve Goldstein", "European Markets Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT581_renaul_ZG_20191018034854.jpg", "published_at": "2019-10-18"}