{"pub": "townhall", "url": "https://twitchy.com/samj-3930/2019/10/08/fail-to-end-all-fails-ellen-barkin-accidentally-shows-how-dumb-she-really-is-while-calling-trump-supporters-dumb-and-rofl", "downloaded_at": "2019-10-08 15:01:34.344411+00:00", "title": "Fail to end ALL fails: Ellen Barkin accidentally shows how DUMB she really is while calling Trump supporters dumb and ROFL", "language": "en", "text": "Helpful hint for folks like Ellen Barkin who think they are smarter than other people because they vote differently from them: If you’re going to call a large group of people dumb and condescend to them like a hateful rage-shrew make sure you DON’T show everyone how dumb you really are while doing so.\n\nSee, this editor is a helper.\n\nEllen must’ve been desperate for attention (any sort) when she tweeted this thread of stupid:\n\ntrump survivors, I mean supporters need to ask themselves only one question cuz the fact is irrefutable…Do you want a dumb president? — Ellen Barkin (@EllenBarkin) October 6, 2019\n\nObvious troll is obvious.\n\nBy now, even you know you’re all pretty dumb so let me rephrase my question…Do you want a president who is as dumb or dumber than you? Think about it… — Ellen Barkin (@EllenBarkin) October 6, 2019\n\nSure, Ellen, we’re the dumb ones.\n\nThere’s a reason people like her read lines someone else wrote for a living.\n\nShe continued …\n\nThe dude can’t spell. I’m not talking about big words like compulsory or obligatory but a single syllable word…moat. He spells it “moot”. But moot is already a ward. With a very different meaning. Can you see how something like this could crate a dangerous situation? — Ellen Barkin (@EllenBarkin) October 6, 2019\n\nCrate.\n\n*sigh*\n\nAnd Ellen thinks Trump supporters are the dumb ones. K.\n\nCreate. Crate. Get it? 😂😂 — Ellen Barkin (@EllenBarkin) October 6, 2019\n\nYeah, she TOTALLY meant to do that.\n\nOh, and ‘ward’.\n\nTotally.\n\nWhat a hyena.\n\nYou obviously havent been burned by autocorrect. Lucky you. — Blueskies (@blueskies6123) October 8, 2019\n\nWe have you criticizing someone's spelling to prove they are dumb and his voters are clearly dumb. Then you say \"moot\" is a ward, not word. Then spell create as \"crate\". I love a self-own. Yours was delightful! — Terry O' (@IrishTea1) October 8, 2019\n\nThank you for making the year 2020 the year for Trump. calling Americans dumb is just one more step closer to make President @realDonaldTrump president of the US for another 4 years. God bless you. — Xaser Nixeus (@XaserNixeus) October 8, 2019\n\nEllen must really want four more years of this.\n\nWhat’s a cuz? Is that your mothers sisters child? — StasheMc'Stashe (@JMHaircut) October 8, 2019\n\nWe do believe this is called a self-own, although Ellen will likely claim she did this on purpose to make some point about spelling errors. And hey, let’s go with that line of reasoning as well – being as stupid as the guy she just called stupid proves a point how?\n\nYeah, fail. So much fail.\n\nRelated:\n\nComplete and TOTAL coward: Clay Travis DROPS Warriors coach Steve Kerr for conveniently having NO COMMENT on NBA/China\n\nNothing to see HERE –> Comey’s FBI spokesman took ‘monetary gifts’ from CNN reporter (then lied about it under oath)\n\n‘Go reread ORWELL’: Kimberley Strassel nails Dems/media about the terrible precedent they set under Obama and it’s PERFECT", "description": "And Ellen thinks Trump supporters are the dumb ones. K.", "authors": ["Sam Janney", "Posted At Am On October", "Sam J."], "top_image": "https://twitchy.com/wp-content/uploads/2019/01/ellen-barkin-new.jpg", "published_at": "2019-10-08"}