{"pub": "rt", "url": "https://rt.com/op-ed/470008-humans-oppose-robot-takeover-sabotage", "downloaded_at": "2019-10-05 10:29:06.693801+00:00", "title": "Robots face ‘sabotage’ from human co-workers fearing they will be replaced. But is that a surprise?", "language": "en", "text": "With nearly two fifths of jobs in the industrialized West in peril due to the rise of automation, humans are fighting back against the rollout of the technology that is to replace them. But why are scientists surprised?\n\nBritish healthcare workers are hostile to their robotic co-workers, committing “minor acts of sabotage” such as standing in their way, according to a recent study by De Montfort University, which chided the humans for “not playing along with” their automated peers. The researchers contrasted the “problematic” British attitude with that of Norwegian workers, who embraced their silicon colleagues, even giving them friendly nicknames.\n\nAlso on rt.com Mind-reading AI may spell end to humanity as we know it, but not because it will enslave us – Zizek\n\nSome 30 percent of UK jobs will be lost to automation within 15 years if current trends continue apace, according to PricewaterhouseCoopers. The percentage is even greater in the US (38 percent) as well as Germany and France (37 percent), but falls to 25 percent in Scandinavian countries like Norway and Finland. Perhaps this explains the difference in workplace interactions between the British and the Norwegians - the latter aren't as worried about losing their jobs to an electronic interloper.\n\nBut perhaps they should be. Robots and AI are beating humans in fields once thought to be safe from automation, including the healthcare field - image-based medical diagnosis, surgery, financial and sports journalism, even art - forcing the readjustment of predictions and shortening the timeline of automation.\n\nThe De Montfort researchers concluded the UK “has a problem with diffusion and take-up of technology” - suggesting that the Scandinavian way of embracing the intruder is the correct one and the UK workers are wrong to want to preserve their positions. But it's human instinct to distrust the automaton - or any other technology that poses a threat to one's way of life.\n\nFor all the warm media coverage given to a single Wisconsin company that held a “chip party” to microchip 41 of its 85 employees, many people (including, apparently, over half that company's own employees) find the whole notion distasteful. For every Elon Musk proposing merging with AI, there's a cognitive psychologist pointing out that this would be “suicide for the human mind.” Much of the industrialized world seems to feel unease about the rapidity of technological development. Technology has been synonymous with progress for so long we've forgotten how to say “no” to developments that don't seem to help anyone except the owners of the technology, but sabotaging robots is a form of expressing that opposition.\n\nRead more\n\nThe same instinct that leads people to sabotage surveillance cameras with paint leads them to push “mall cop” robots into fountains or steal the delivery robots that have become ubiquitous in some cities. All robots have the potential to be surveillance devices, even (especially) those found in the workplace. For a glimpse at the future of hybrid workplaces, one need only look to the dystopian reality of Amazon.com, where the human workers reportedly can't catch so much as a bathroom break and are sometimes assaulted by their robotic colleagues.\n\nAnd as police departments increasingly adopt these technologies - Human Rights Watch has been warning about the adoption of “killer robots” in law enforcement for over five years, concerned that such technology would merely accelerate the “shoot first, ask questions later” model that has become de rigueur in so much of human policing in recent years - the combination of automation with surveillance takes on an even more threatening dimension.\n\nChandler, Arizona, a test site for Waymo's self-driving vans and cars since 2017, has seen over 24 attacks on the AI-powered vehicles. People pelt them with rocks, run them off the road, slash their tires, and otherwise make it clear they aren't welcome. For all that these people are portrayed as ignorant luddites, hidden in the story is the reality of their experiences - a son nearly hit by a self-driving vehicle, a pedestrian killed by one the next city over, other Google-owned vehicles sweeping up private data from unwitting homes. Soon-to-be unemployed truckers certainly understand the gravity of the situation.\n\nAlso on rt.com Get out of my face! Facial recognition technology could enslave mankind like never before\n\nIt remains to be seen how human soldiers will react when robots join them on the battlefield as they have already joined them in the skies. Given US drones' track record of shooting down \"friendly\" soldiers, other countries might want to think twice before following in their footsteps. A Google employee who resigned in protest over the company's military drone project fears killer robots could start their own war - no human aggression required.\n\nThis is part of the motivation behind humans' fear and distrust of robots and AI - that ultimately it will not need us anymore. Even Musk, an evangelist for merging with the machines if ever there was one, views it merely as a route to surviving in the event of an AI takeover. Which begs the question - why are we creating technologies that could render us superfluous?\n\nBy Helen Buyniski, RT\n\nThink your friends would be interested? Share this story!", "description": "With nearly two fifths of jobs in the industrialized West in peril due to the rise of automation, humans are fighting back against the rollout of the technology that is to replace them. But why are scientists surprised?", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5d939fab20302715916f8be1.JPG", "published_at": "2019-10-05"}