{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-election/democratic-debate-who-won-lost-winners-losers-best-warren-biden-sanders-harris-yang-a9103436.html", "downloaded_at": "2019-09-13 07:10:26.735350+00:00", "title": "Democratic debate: Who won and lost the latest 2020 showdown?", "language": "en", "text": "With the conclusion of the third Democratic debate, the top candidates vying to take on Donald Trump in 2020 have wrapped up yet another chance to stand out in a crowded field just months before voters will begin to cast their votes. And, true to a night of televised prime time debate, they sparred in dramatic fashion, with Joe Biden defending his decades of experience in Washington, Elizabeth Warren and Bernie Sanders hoping to stand out with bold new visions for the country, and the others on stage hoping for a breakout moment.\n\nFor Mr Biden, the front-runner who has been dogged throughout the campaigns with attacks over his perceived gaffes and past support of policies that have since been seen as out-of-date, the night was a strong performance. While facing down heated attacks from fellow candidates — including former Housing and Urban Development secretary Julián Castro — the former vice president managed to remain firmly on both feet, defending his record and promising a pragmatic adherence to Barack Obama's legacy on healthcare and other issues.\n\n\"I think we should have a debate on heath care. I think — I know the senator says she's for Bernie. Well, I'm for Barack. I think Obamacare worked,\" Mr Biden said, highlighting the differences in opinion on healthcare between himself and Ms Warren, while reminding the audience once again that he was the vice president to a man who remains a revered figure in the Democratic Party.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nMs Warren, who has surged in polls since her quiet entrance at the turn of the year, also notched a memorable night, in which she brought her plans for big structural change to American voters, but largely kept above the fray of attacks that led some to complain that Americans are tuning out of Washington due to the vitriol of modern American politics. Ms Warren warned of corruption in the US political system, and promised that she would take on that money driven system, and implement policies ranging from Medicare for All to relief for student debt loans for the vast majority of Americans.\n\nResponding to Mr Biden's repeated claims that Medicare for All is a step too far, and that many Americans would reject the idea because they prefer their current healthcare plan, Ms Warren said: \"We all owe a huge debt (to Obama). I've never actually met anybody who likes their insurance company. I've met people who like their doctor...The only difference here is where to send the bill.\"\n\nShape Created with Sketch. The Democrat challengers to Trump in 2020 Show all 22 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The Democrat challengers to Trump in 2020 1/22 Bernie Sanders The Vermont senator has announced that he will be running again in 2020 after losing out to Hilary Clinton in the 2016 Democratic primaries. He intends to run on a similar platform of democratic socialist reform Getty 2/22 Joe Biden The former vice president - poised to be a frontrunner - has announced his run. He recently faced scrutiny for inappropriate touching of women, but was thought to deal with the criticism well EPA 3/22 Elizabeth Warren The Massachusetts Senator has formally launched her bid for president in 2020. A progressive Democrat, she is a major supporter of regulating Wall Street. Reuters 4/22 Bill De Blasio The New York mayor announced his bid on 16 May 2019. He emerged in 2013 as a leading voice in the left wing of his party but has struggled to build a national profile and has suffered a number of political setbacks in his time as mayor AFP/Getty 5/22 Pete Buttigieg The Indiana mayor and war veteran will be running for president. If elected, he would be the first openly LGBT+ president in American history Getty 6/22 Beto O'Rourke The former Texas congressman formally launched his bid for the presidency in March. He intends to run on a progressive platform, stating that the US is driven by \"gross differences in opportunity and outcome\" AP 7/22 Steve Bullock The Montana governor announced his bid on 14 May. He stated \"We need to defeat Donald Trump in 2020 and defeat the corrupt system that lets campaign money drown out the people's voice, so we can finally make good on the promise of a fair shot for everyone.\" He also highlighted the fact that he won the governor's seat in a red [Republican] state Reuters 8/22 Cory Booker The New Jersey Senator has announced that he will be running for the presidency in 2020. If he secures the nomination he said finding a female vice president would be a priority Getty 9/22 Wayne Messam Mayor of the city of Miramar in the Miami metropolitan area, Wayne Messam has announced his bid. He intends to run on a progressive platform against the \"broken\" federal government. He favours gun regulations and was a signatory to a letter from some 400 mayors condemning President Trump's withdrawal from the Paris Climate Accord Vice News 10/22 Kirsten Gillibrand The New York Senator formally announced her presidential bid in January, saying that “healthcare should be a right, not a privilege” Getty 11/22 Kamala Harris The former California attorney general will be running for president in 2020. Introduced to the national stage during Jeff Sessions’ testimony, she has endorsed Medicare-for-all and proposed a major tax-credit for the middle class AFP/Getty 12/22 John Delaney The Maryland congressman was the first to launch his bid for presidency, making the announcement in 2017 AP 13/22 Tulsi Gabbard The Hawaii congresswoman announced her candidacy in January, but is likely to face tough questions on her past comments on LGBT+ rights and her stance on Syrian President Bashar al-Assad Getty 14/22 Andrew Yang The entrepreneur has announced his presidential candidacy, and has pledged that he would introduce a universal basic income of $1,000 a month to every American over the age of 18 Getty 15/22 Julian Castro The former San Antonio mayor announced his candidacy in January and said that his running has a “special meaning” for the Latino community in the US Getty 16/22 Marianne Williamson The author and spiritual adviser has announced her intention to run for president. She had previously run for congress as an independent in 2014 but was unsuccessful Getty 17/22 Eric Swalwell One of the younger candidates, Swalwell has served on multiple committees in the House of Representatives. He intends to make gun control central to his campaign Getty 18/22 Seth Moulton A Massachusetts congressman, Moulton is a former US soldier who is best known for trying to stop Nancy Pelosi from becoming speaker of the house Getty 19/22 Amy Klobuchar Klobuchar is a Minnesota senator who earned praise for her contribution to the Brett Kavanaugh hearings Getty 20/22 Jay Inslee Inslee has been governor of Washington since 2013. His bid centres around climate change AFP/Getty 21/22 John Hickenlooper The former governor of Colorado is running on a sensible ticket. He aims to sell himself as an effective leader who is open to compromise and evidences this with his experience as governor Getty 22/22 Tim Ryan Ohio representative Tim Ryan will be running a campaign that hinges on his working class roots Getty 1/22 Bernie Sanders The Vermont senator has announced that he will be running again in 2020 after losing out to Hilary Clinton in the 2016 Democratic primaries. He intends to run on a similar platform of democratic socialist reform Getty 2/22 Joe Biden The former vice president - poised to be a frontrunner - has announced his run. He recently faced scrutiny for inappropriate touching of women, but was thought to deal with the criticism well EPA 3/22 Elizabeth Warren The Massachusetts Senator has formally launched her bid for president in 2020. A progressive Democrat, she is a major supporter of regulating Wall Street. Reuters 4/22 Bill De Blasio The New York mayor announced his bid on 16 May 2019. He emerged in 2013 as a leading voice in the left wing of his party but has struggled to build a national profile and has suffered a number of political setbacks in his time as mayor AFP/Getty 5/22 Pete Buttigieg The Indiana mayor and war veteran will be running for president. If elected, he would be the first openly LGBT+ president in American history Getty 6/22 Beto O'Rourke The former Texas congressman formally launched his bid for the presidency in March. He intends to run on a progressive platform, stating that the US is driven by \"gross differences in opportunity and outcome\" AP 7/22 Steve Bullock The Montana governor announced his bid on 14 May. He stated \"We need to defeat Donald Trump in 2020 and defeat the corrupt system that lets campaign money drown out the people's voice, so we can finally make good on the promise of a fair shot for everyone.\" He also highlighted the fact that he won the governor's seat in a red [Republican] state Reuters 8/22 Cory Booker The New Jersey Senator has announced that he will be running for the presidency in 2020. If he secures the nomination he said finding a female vice president would be a priority Getty 9/22 Wayne Messam Mayor of the city of Miramar in the Miami metropolitan area, Wayne Messam has announced his bid. He intends to run on a progressive platform against the \"broken\" federal government. He favours gun regulations and was a signatory to a letter from some 400 mayors condemning President Trump's withdrawal from the Paris Climate Accord Vice News 10/22 Kirsten Gillibrand The New York Senator formally announced her presidential bid in January, saying that “healthcare should be a right, not a privilege” Getty 11/22 Kamala Harris The former California attorney general will be running for president in 2020. Introduced to the national stage during Jeff Sessions’ testimony, she has endorsed Medicare-for-all and proposed a major tax-credit for the middle class AFP/Getty 12/22 John Delaney The Maryland congressman was the first to launch his bid for presidency, making the announcement in 2017 AP 13/22 Tulsi Gabbard The Hawaii congresswoman announced her candidacy in January, but is likely to face tough questions on her past comments on LGBT+ rights and her stance on Syrian President Bashar al-Assad Getty 14/22 Andrew Yang The entrepreneur has announced his presidential candidacy, and has pledged that he would introduce a universal basic income of $1,000 a month to every American over the age of 18 Getty 15/22 Julian Castro The former San Antonio mayor announced his candidacy in January and said that his running has a “special meaning” for the Latino community in the US Getty 16/22 Marianne Williamson The author and spiritual adviser has announced her intention to run for president. She had previously run for congress as an independent in 2014 but was unsuccessful Getty 17/22 Eric Swalwell One of the younger candidates, Swalwell has served on multiple committees in the House of Representatives. He intends to make gun control central to his campaign Getty 18/22 Seth Moulton A Massachusetts congressman, Moulton is a former US soldier who is best known for trying to stop Nancy Pelosi from becoming speaker of the house Getty 19/22 Amy Klobuchar Klobuchar is a Minnesota senator who earned praise for her contribution to the Brett Kavanaugh hearings Getty 20/22 Jay Inslee Inslee has been governor of Washington since 2013. His bid centres around climate change AFP/Getty 21/22 John Hickenlooper The former governor of Colorado is running on a sensible ticket. He aims to sell himself as an effective leader who is open to compromise and evidences this with his experience as governor Getty 22/22 Tim Ryan Ohio representative Tim Ryan will be running a campaign that hinges on his working class roots Getty\n\nFor those candidates attempting fo find a breakout moment, it was the two Texans in the race who may have secured those bragging rights. Former congressman Beto O'Rourke drew some of the biggest applause of the night when he promised to take on the National Rifle Association and implement mandatory buybacks for assault-style rifles, a policy he has grown increasingly passionate about since the mass shooting in his home town of El Paso last month.\n\n\"Hell yes, we're going to take your AR-15s,\" Mr O'Rourke said, taking one of the strongest lines on gun buybacks in the field.\n\nMr Castro, the other Texan, also had a memorable night, attacking Mr Biden for his record, and claiming that he is the one who is truly carrying Mr Obama's legacy forward.\n\n\"I'm fulfilling Obama's legacy, and you're not,\" Mr Castro, who frequently attacked Mr Biden throughout the night, said.\n\nFor Mr Sanders and Kamala Harris, the pair delivered strong performances, though perhaps ones that did not stand out compared to past debates.\n\nMs Harris had a memorable moment early on in the debate, when she spoke directly to Mr Trump in her opening remarks, and explained the dangers of his presidency.\n\n\"And now you can go back to watching Fox News,\" she said.\n\nMr Sanders defended his democratic socialist views, and punched back when Joe Biden suggested to him that \"This is America\", as he compared the healthcare systems in the two countries.\n\n\"Yeah, but Americans don't want to pay twice as much as other countries,\" Mr Sanders shot back. \"And (other countries) guarantee health care to all people ... What people want is cost-effective health care.\"\n\nFor the remaining candidates, the crowded field provided little opportunity to stand out, especially in comparison to the heavyweights of the night.\n\nBusinessman Andrew Yang made a splash by announcing his campaign's plan to give $1,000 a month to 12 families via a raffle, in an attempt to highlight his plan for universal basic income that he hopes will offset the damages of automation.\n\nMinnesota senator Amy Klobuchar doubled down on her pragmatic approach to leadership, and suggested that Medicare for All would cost too much, and lead to many people losing their insurance (a claim that was quickly refuted).\n\nNew Jersey senator Cory Booker continued to push an optimistic message, even has he sought to highlight the struggles of minority communities across the US.\n\nPete Buttigieg, the mayor of South Bend, also delivered what has become a somewhat regular debate performance for him, and called on greater American leadership abroad.", "description": "With the conclusion of the third Democratic debate, the top candidates vying to take on Donald Trump in 2020 have wrapped up yet another chance to stand out in a crowded field just months before voters will begin to cast their votes.", "authors": ["Clark Mindock"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/13/01/pri84516247.jpg", "published_at": "2019-09-13"}