{"pub": "blastingnews", "url": "https://us.blastingnews.com/news/2019/10/mexicos-military-police-detain-a-2000-migrants-caravan-headed-for-the-united-states-002999309.html", "downloaded_at": "2019-10-15 14:56:22.557418+00:00", "title": "Mexico’s military police detain a 2000-migrants caravan headed for the United States", "language": "en", "text": "Plans of the migrants evaporated in thin air when the National Guard agents and police of Mexico prevented the 2,000-person caravan from proceeding to the United States. The crowd consisted of people from Africa, the Caribbean, and Central America. Many of them had been waiting for months to get transit visas and were stranded in the town of Tapachula in Mexico. They had with them heavy backpacks, babies and parcels.\n\nThe authorities persuaded them to retrace their steps and some of them did.\n\nThe Daily Mail UK interprets this as a deviation in Mexico’s immigration policy. Even last year, officials would turn a blind eye on migrants who tried to cross over from Mexico to the United States. Many of them were in search of a safe place compared to that prevalent in their countries. However, Mexico bowed to pressure from Washington.\n\nU.S. President Donald Trump threatened to close the border unless Mexico took action to apply brakes on the flow of migrants. The country’s economy depends on exports to the US and the government had no other alternative but to toughen its stand on migrants.\n\nHundreds of migrants stuck in Mexico - they want to claim asylum in the U.S. - blocked a bridge into Texas. https://t.co/IkDGFcNDNe via @NYTimes — Miriam Jordan (@mirjordan) October 10, 2019\n\nIt is necessary to address the issue\n\nPeople seldom like to move out of their homeland and migrate to another country.\n\nDon’t miss the latest news! Click on the topic you interest most. We'll keep you updated with all the news you shouldn't miss. Donald Trump\n\nThey do so under compulsion and there could be many reasons. These could usually be related to humanitarian needs where normal lives are affected. Hence, other countries must take a sympathetic view and address the issue especially when it involves women and children who are vulnerable. Large sections of migrants look at the United States as the best option and Mexico had been extending tacit support to them but things have changed.\n\nThe migrants are receiving less help from the townspeople. In addition, governments in Central America are also working to check the flow of migrants.\n\nso interesting #vice 13,000 Migrant Kids Are Stuck Waiting in Mexico Thanks to Trump’s Policyhttp://www.vice.com/rss https://t.co/Am8EH4ehz7 — Chloe Protz (@Chloeprotz) October 11, 2019\n\nThe Daily Mail UK elaborates on the methods migrants usually adopt to land up in America.\n\nThose belonging to conflict-ridden African countries used to travel to Europe. Once that entry point was plugged, they chose to shift their focus to America. The typical route is by flight from Africa to Brazil where it is easy to get a visa. Then they have to undertake a long and perilous trip north. It is a difficult journey and they have to brave it out before they can even think of entering America.\n\nTrump’s tough stand paid dividends\n\nAccording to the Los Angeles Times, prompt action by Mexican authorities applied brakes on the latest caravan of migrants trying to head north from southern Mexico. There were nearly 2,000 of them from Central American and African countries, Haiti and Cuba and they wanted to enter America. It was the first such caravan since early 2019, but the situation was not the same. Last year, in the initial stages, Mexico did not make efforts to block the caravans. That forced President Trump to talk tough. He described them as an “invasion” and threatened economic retaliation. Consequently, President Andres Manuel Lopez Obrador, who took office Dec. 1, modified the strategy. He yielded to pressure from the White House and Trump praised Mexico’s efforts to check the inflow of migrants.", "description": "The migrants belong to countries in Africa, the Caribbean and Central America and authorities in Southern Mexico have detained them.", "authors": ["Music Crowns", "Oliver Vandervoort", "Asmir Pekmic", "Read More On The Same Topic Prabir Ghose", "Ireland", "An Irishman S Voice Came Out Of A Coffin As It Was Lowered Into The Grave", "Uk Plans To Send A Robotic Spider To The Moon To Map", "Explore The Lunar Surface", "Typhoon Hagibis Strikes Japan", "Affects Some Rugworld Cup Matches"], "top_image": "https://staticr1.blastingcdn.com/media/photogallery/2019/10/14/os/b_1200x630/migrant-caravan-with-mostly-women-children-begins-trek-to-us-border-image-sourceglobal-news-youtube-video_2339023.jpg", "published_at": "2019-10-15"}