{"pub": "zdnet", "url": "https://www.zdnet.com/article/amazon-asks-where-do-you-want-to-take-alexa-next", "downloaded_at": "2019-09-26 01:33:38.664261+00:00", "title": "Amazon asks: Where do you want to take Alexa next?", "language": "en", "text": "How Amazon chooses new form factors for Alexa Miriam Daniel, VP of Echo Devices at Amazon, explains the thinking behind emerging products like the Echo Loop and Echo Frames.\n\nIf you're looking to equip your smart home, Amazon has you covered. Five years after introducing the first Echo smart speaker and more than a year after acquiring the smart doorbell maker Ring, Amazon is refining its smart home offerings The Seattle tech giant introduced several new devices and services on Wednesday that can make your smart home smarter, simpler and more privacy-minded.\n\nAt the same time, Alexa is looking for a way out of the house.\n\n\"We're up to 85,000 Alexa-compatible products for the home,\" Amazon Smart Home VP Daniel Rausch told ZDNet. That's up from 4,000 in 2018. \"This is a proliferation of devices covering use cases in the home. But developers want to see us expand beyond, and we want to expand beyond.\"\n\nTo that end, Amazon on Wednesday announced a number of new devices that aren't ready for a mass audience but could represent the future of voice-based interactions.\n\nFinding the right wearable form factor\n\nFor the first time, Amazon is ready to bring Alexa to wearables. Their first foray into the segment, a pair of wireless earbuds, seems like a safe bet. First of all, listening to music is the top use case for Alexa. Furthermore, according to IDC, hearables are the fastest growing segment within wearables. Global wearable unit shipments in Q2 2019 were 85 percent higher year-over-year, rising to 67.7 million devices. The hearables category of voice assistant connected wireless earbuds and headphones grew 250 percent, accounting for nearly 47 percent of the entire wearables segment.\n\nAmazon's Echo Buds are available for pre-order today at $129.99. But why stop there? According to Juniper Research, wearables will be one of the fastest growing voice assistant categories over the next five years, only behind smart TVs and smart speakers -- areas were Amazon already dominates.\n\nWith the potential there, Amazon is asking customers to guide the direction of its wearables business with Day One Edition products. The Echo Frames eyeglasses and the Echo Loop ring are available on an invite-only basis for now.\n\n\"When we think about the from factors that make sense, we start with the customers in mind,\" Miriam Daniel, VP of Echo Devices at Amazon, told ZDNet. \"Who are they? What do they want to do when they're out and about?\"\n\nThe Frames and Loop were designed for customers who don't to carry another gadget, Daniel said.\n\nIs Amazon‘s Day 1 Edition initiative for testing new Alexa hardware the right move? (Spoiler: Yes) Jason Squared's Jason Cipriani and Jason Perlow walk through the laundry list of new Amazon hardware and services heading into the holiday season. Read more: https://zd.net/2mJPxhc\n\nThe Day One Editions will be rolled out on a limited basis for the purpose of getting customer feedback. \"And if customers love them, we'll double down and build a lot more,\" Amazon wrote on its blog.\n\nThere's no clear answer as to when Amazon will be ready to deliver these products on a wider scale -- if ever, Daniel said. However, that doesn't mean they're not good ideas. the Amazon Echo, she pointed out, was available on an invite-only basis for six months before it was rolled out more widely.\n\nExpanding into automotive\n\nMeanwhile, Amazon received invitation requests from more than a million customers interested in trying out its Echo Auto device. But for this market, Amazon is also relying heavily on its industry partners to lead the way.\n\nGM on Wednesday announced it's rolling out a new in-vehicle Alexa experience -- the deepest integration of the Alexa SDK yet. Starting in the first half of 2020, Alexa will be available not just on new cars but also on model year 2018 and 2019 vehicles with compatible infotainment systems.\n\nWith the potential to reach millions of Chevrolet, Buick, GMC and Cadillac owners, it's the broadest rollout of an embedded Alexa Auto experience to date.\n\nThe Sidewalk protocol: opening up the potential for more IOT devices\n\nBeyond the automotive world and wearables, Alexa could expand into consumer IOT devices outside of the home -- such as a connected dog collar or a backyard weather sensor. For this category of devices, Amazon is asking for inspiration from third-party developers.\n\nAmazon is aiming to spur the development of IOT devices with Sidewalk, a low bandwidth, highly secure network that uses the free 900 MHz spectrum to control devices.\n\n\"As soon as you want to get beyond the perimeter of your home, things get super tricky,\" Rausch said. \"You basically transition into needing a cell connection. And that's battery expensive. It's dollars expensive. And it's also just really complex.\"\n\nThe simple connected devices that could be useful to homeowners -- \"the use cases for the smarts of Alexa outside your home,\" as Rausch put it -- shouldn't cost hundreds of dollars, he said, or require a monthly cell connection. The Ring team was the first internal team to encounter this problem when it built smart sidewalk lights, inspiring the name for the Sidewalk protocol.\n\nAmazon will be publishing the protocol and opening it up to developers next year. The company is also going to publish a reference design called Ring Fetch -- a dog tracker that will use Sidewalk to ping you if your dog leaves a certain perimeter.\n\n\"And then we'll just see what developers invent,\" Rausch said.", "description": "AI assistants are about to break out of the confines of the home and the smartphone: Amazon's latest announcements show the uncertainty and the potential that exists at this juncture.", "authors": ["Stephanie Condon"], "top_image": "https://zdnet3.cbsistatic.com/hub/i/r/2019/09/25/c495193e-99a5-4dd6-90c7-399948f95f49/thumbnail/770x578/fb08010d137a955cdce29acc5a626c51/amazon-echo-buds.jpg", "published_at": "2019-09-26"}