{"pub": "yahoo", "url": "https://news.yahoo.com/biden-unveils-proposal-boost-college-093000305.html", "downloaded_at": "2019-10-08 13:01:47.340321+00:00", "title": "Biden Unveils Proposal to Boost College Access: Campaign Update", "language": "en", "text": "(Bloomberg) -- Joe Biden unveiled an education plan Tuesday that focuses on making colleges more affordable and strengthening pathways to the middle class that do not require a bachelor’s degree.\n\nThe proposal calls for a $750 billion investment in educational opportunities after high school that would be financed, according to the campaign “by eliminating the stepped-up basis loophole and capping the itemized deductions the wealthiest Americans can take to 28%.”\n\nIt would provide two years of community college tuition free while also helping students in the two-year institutions with textbook and transportation costs and other expenses.\n\nThe plan also includes a $50 billion investment in work force training, doubling the maximum value of Pell grants and increasing the number of students eligible to qualify for the grants. It would also halve payments on undergraduate federal student loans and revamp the public loan service forgiveness program. The proposal also calls for investment in historically black colleges and universities and minority-serving institutions, including $18 billion in grants to those schools.\n\n“It’s about our economy because when students like mine get the chance to learn, we’re all better off,” Jill Biden said on a conference call with reporters Monday night. The former vice president’s wife, who still teaches English at Northern Virginia Community College, helped shape the plan.\n\nMany of Biden’s primary rivals, including Elizabeth Warren and Bernie Sanders, have rolled out plans for higher education. Warren proposes to cancel 95% of student debt while Sanders says his plan would eliminate all student debt and abolish tuition for public colleges and universities.\n\nCOMING UP\n\nThe Human Rights Campaign Foundation will host a town hall at the University of California at Los Angeles devoted to LGBTQ issues on Friday. Candidates scheduled to attend are: Warren Cory Booker, Biden, Pete Buttigieg, Kamala Harris, Beto O’Rourke, Amy Klobuchar, Julián Castro and Tom Steyer. Sanders, who has been recovering from a heart attack, also is scheduled to appear, but his campaign hasn’t said whether he still plans to attend.\n\nThe fourth Democratic debate is scheduled for Oct. 15th at Otterbein University in Westerville, Ohio. Twelve candidates are slated to take part: Biden, Warren, Sanders, Booker, Buttigieg, Castro, Harris, Klobuchar and O’Rourke, as well as Tulsi Gabbard, Steyer and Andrew Yang.\n\nThe United Food and Commercial Workers union will host forums in Iowa with Democratic presidential candidates on Oct. 13. Biden, Booker, Buttigieg, Harris and Michael Bennet have confirmed that they will attend.\n\nTo contact the reporter on this story: Tyler Pager in Washington at tpager1@bloomberg.net\n\nTo contact the editors responsible for this story: Wendy Benjaminson at wbenjaminson@bloomberg.net, Max Berley, John Harney\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Joe Biden unveiled an education plan Tuesday that focuses on making colleges more affordable and strengthening pathways to the middle class that do not require a bachelor’s degree.The proposal calls for a $750 billion investment in educational opportunities after high school that would", "authors": ["Tyler Pager"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-08"}