{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7573315/Mystery-strange-looking-creature-lurking-underneath-popular-Perth-beach.html", "downloaded_at": "2019-10-15 02:19:01.098038+00:00", "title": "Mystery as strange-looking creature is found lurking underneath popular Perth beach", "language": "en", "text": "A passer-by has discovered a mysterious creature lying beneath the sand at a popular tourist beach.\n\nThe beach-goer shared pictures of the semi-exposed animal and questioned whether it was a dead body.\n\nBut others had different ideas as to what the brown striped animal at Leighton Beach in Fremantle, south-western Perth could be.\n\nA passer-by has discovered a mysterious creature (pictured) lying beneath the sand at a popular tourist beach\n\n'Found this weird stuff on Leighton beach, looks like a dead body. Does anyone know what it is?' the man who made the discovery wrote in a local Facebook group.\n\nOne commenter in the group where the photos were shared thought it could be a cuttlefish - the bizzare-looking mollusc with an octopus-like face.\n\nAnother believed the animal was a giant squid, while one even wondered if it was an alien creature,\n\n'I think it is radioactive, you should try to pour water to see if it turns purple,' one person joked.\n\n'Then that means it is still alive and you two are about to swap bodies.'\n\nOne person thought it could be shovel-nosed shark, which usually are very flat in shape and brown in colour.\n\nAside from guesses that the object was an animal, some thought it may not even be a living being.\n\nOne person was of the opinion it could be a tribal mask, and another thought it could be part of a tree.", "description": "While the beach-goer who came across the object at Leighton Beach in Fremantle, Perth thought it could be a dead body, others guessed it could be part of a tree, a giant squid or even an alien.", "authors": ["Charlie Coë For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/01/19718402-0-image-a-17_1571100935693.jpg", "published_at": "2019-10-15"}