{"pub": "theverge", "url": "https://theverge.com/2019/7/8/20679946/spider-man-far-from-home-avengers-endgame-blip-thanos-snap-continuity-problems-mcu-marvel", "downloaded_at": "2019-10-05 13:51:57.609523+00:00", "title": "Spider-Man: Far From Home is saving the MCU by ignoring its continuity", "language": "en", "text": "Anyone who goes into Spider-Man: Far From Home hoping that the Marvel Cinematic Universe will keep exploring and extending the tragedy of Avengers: Endgame will be thoroughly disappointed — but it’s a good kind of disappointment. The MCU’s continuity has gotten more and more convoluted and interconnected over the course of more than a decade of movies, as space aliens mingle with Sorcerers Supreme and cosmic threats alter the future, the past, and time itself. If Marvel insisted on tight continuity in its world-building, the narrative burden on creators could be suffocating. Far from Home shows that while Marvel wants to respect its own increasingly preposterous backstory, it doesn’t intend to box its franchise in with it.\n\nThe main way Far From Home deflates that preposterous backstory is by acknowledging up front that it’s preposterous. As true believers will remember, in Avengers: Infinity War, the purple titan Thanos snaps his fingers and evaporates half of all intelligent life in the universe. In Endgame, set five years later, Bruce Banner/Hulk snaps his fingers, and half the people on Earth come back to life at the same ages they were when they first disappeared.\n\nSo, in theory, Far From Home is set on a vastly changed Earth. After the “Blip,” as it’s now known, half of the planet’s population lived through a worldwide genocide and has been struggling for five years with crippling grief and a devastated global infrastructure. The other half of the population has to deal with the fact that everyone they know is suddenly five years older, and history has moved on without them. In short, every single person on the planet should be brutally disoriented and traumatized. The basic institutions of society would be thrown into chaos. Governments would fall, new religions would spring up. Earth would be unrecognizable.\n\nThat’s a script for a downbeat dystopian tale like HBO’s series The Leftovers, which explored the vast changes in society that were caused by just 2 percent of the population disappearing. (It’s essentially a dark mirror of Endgame that concluded years before Endgame.) But Far From Home’s creators wanted it to be a rom-com goof, and they weren’t going to let previous movies get in their way — no matter how many tickets those films sold.\n\nFar From Home opens with Peter Parker’s Aunt May (Marisa Tomei) essentially doing a stand-up routine about how the Blip led to sitcom-style shenanigans because she disappeared for five years, and when she came back, someone else was living in her apartment. Similarly, Spider-Man / Peter Parker’s school is essentially unchanged, except that some kids are now five years older, so they have new positions in the social and romantic pecking order. Peter is severely struck by the death of his mentor, Tony Stark. But beyond that, no one seems worse for wear after what would be, by any objective standard, the single most devastating event in the history of the world.\n\nScience fiction buffs might be put off by this refusal to explore the impact of vast technological and cultural change. Those who like thoughtful politics in their art might feel the adamant insistence on resetting everything to the status quo seems glib. And fans invested in the MCU’s world-building may resent the way Far From Home cheerfully turns Endgame into a punchline, then ignores it. Meg Downey at GameSpot, for example, criticizes the film’s “weird logical hangnails” and wishes it didn’t pretend Spider-Man is the only hero left on Earth.\n\nBut the truth is that the MCU has always had hangnails, and its world-building has never made much sense. Early on in the MCU’s decade-long history, Tony Stark (Robert Downey Jr.) developed clean renewable energy. He creates fully functional artificial intelligence as well. Later, we learn that Hank Pym (Michael Douglas) has technology that allows virtually anything to be shrunk down to the size of a bug. Wakanda has miraculous medical science and military capabilities that are vastly superior to any nation on Earth. And in Endgame, the Avengers develop time travel. Any one of these inventions would revolutionize the world economy and the geopolitical balance more completely than the introduction of the automobile or the nuclear bomb.\n\nBut the world economy in the MCU never experiences a massive economic boom. Transportation and energy infrastructure aren’t transformed or even mildly altered. No wars are sparked. America doesn’t experience an existential meltdown when it is no longer the sole superpower.\n\nSuperhero narratives are generally built on the premise that a handful of people have abilities and powers beyond the norm. Super advanced technology is reserved for making a handful of superheroes super. It never changes everyday life, just as the Blip didn’t change everyday life. People gasp at Iron Man and Thor, but the real miracle in the MCU isn’t hammers or repulsor blasts; it’s the fact that hammers and repulsor blasts don’t change anything significant about the world.\n\nIf they did — if the Marvel universe were truly consistent in any systematic way — many of the MCU’s best moments would disintegrate under their own contradictions. Jessica Jones’ first season, for example, works because the villain, Kilgrave, has mind-control powers that make him an uncontainable, terrifying, overwhelming threat. But his powers only work when he’s close to his targets. Iron Man, with his AI and remote-control robot suits, could take Kilgrave out in 30 seconds without breaking a sweat.\n\nIn a universe where multiple deus ex machinas are just a phone call away, any threat below god level isn’t a threat at all. That is why smaller-scale narratives, from Jessica Jones to Ant-Man and the Wasp, selectively forget that the big guns are out there. Or else, as in Far From Home, they offer unconvincing excuses about why Captain Marvel and Dr. Strange can’t be bothered to save the planet this time around.\n\nIndividual films have ignored or tweaked MCU continuity in smaller ways. In Captain America: Civil War, Ant-Man becomes an international criminal, but Ant-Man and The Wasp avoids most of the implications by casually fast-forwarding past his trial and sentencing to the end of his house arrest. Thor: Ragnarok carefully avoids explaining how the Hulk got into outer space. What happened to Peggy Carter’s former marriage and kids if Captain America went back in time to insert himself into her life again? Are the Netflix shows really part of the MCU or not? Marvel and its many associated directors — who are focused on telling stories, not explaining the stories other people wrote before them — don’t have to answer those questions if they just shrug and move on.\n\nIn superhero comics, decades of intertwined storylines have repeatedly led to creative impasses, prompting companies like DC and Marvel to try various fixes to clear out the continuity deadwood. In the 1980s, DC tried to clear up all its contradictions and confusions by rebooting the entire universe in Crisis on Infinite Earths. Marvel tried an analogous move in the 2000s by creating the Ultimate universe, which featured modernized versions of old characters without the burdensome tangled backstories. But both companies are still so wound up in catering to continuity buffs that they’ve had trouble figuring out how to capitalize on the most successful film franchise in history.\n\nThe MCU hasn’t gotten itself into the same bind as the comics — yet. But Far From Home is an indication that Marvel leadership is aware of the dangers. They’re willing to throw in enough crossovers and continuity shout-outs from film to film to keep hardcore fans interested. But they’re also trying to let individual creators have the freedom to set different tones for different stories, without making it impossible for casual viewers to wander into a lighthearted action movie and enjoy the fun.\n\nTogether, Endgame and Far From Home provide a blueprint for the MCU to keep doing what it’s doing indefinitely. Marvel Entertainment can have its massive periodic crossovers with epic consequential sweeps. And then it can have smaller filler films that don’t worry too much about the impact of those bigger films. Films like Far From Home effectively undo all of the consequences of MCU history by quietly pretending they don’t actually matter. And that’s the right decision for everyone. Who says your friendly neighborhood Spider-Man can’t save the Marvel universe?", "description": "The new Spider-Man movie turns Avengers: Endgame’s drama and Thanos’ snap into a silly joke about the Blip, and that’s the right call for a growing franchise.", "authors": ["Noah Berlatsky", "Jul"], "top_image": "https://cdn.vox-cdn.com/thumbor/hWNzTO8QYP5IOGIh-M_SAGknbGU=/378x0:2017x858/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18277055/Spider_Swing.jpg", "published_at": "2019-07-08"}