{"pub": "aljazeera", "url": "https://aljazeera.com/ajimpact/warren-ocasio-cortez-probe-private-equity-firms-prison-ties-191001173725979.html", "downloaded_at": "2019-10-02 00:37:07.111582+00:00", "title": "Warren, Ocasio-Cortez probe private-equity firms with prison ties", "language": "en", "text": "Five private equity companies invested in prison services - BlueMountain Capital Management LLC, H.I.G. Capital LLC, American Securities, Apax Partners SAS, and Platinum Equity LLC - are getting some mail from progressive Democrats demanding information about their business practices.\n\nSenator Elizabeth Warren and Representatives Alexandria Ocasio-Cortez and Mark Pocan sent letters to the companies asking them to provide information about their stakes in correctional services, their revenue and if they've paid fees for violating federal or state laws.\n\n\"Private equity-owned prison support services use their market power to make millions of dollars off those who are incarcerated, their families, and their communities - often while providing subpar products and services,\" say the letters, dated Sept. 30.\n\nOver the past several years, private equity investment and cheap debt have fueled a wave of consolidation in the prison services industry. Firms including Platinum Equity and their investors have come under increased scrutiny for profiting from correctional facilities.\n\nFor example, Platinum owns Securus Technologies Inc., a prison phone services provider. The company has been criticized for charging as much as $25 for a 15-minute phone call from local jails and for requiring inmates to pay extra fees to open, fund and close accounts.\n\nIn May, New York became the first major jurisdiction in the U.S. to make phone calls free for inmates, with the Department of Corrections agreeing to cover the cost of the service.\n\nThe lawmakers who penned the letters could use information from the companies to build support for their legislation known as the Stop Wall Street Looting Act. That bill would limit the dividends private equity firms can pay themselves and restrict tax breaks for the debt placed on the companies they buy.\n\nThe request follows other congressional probes into private equity firms with links to for-profit colleges and manufactured housing communities.\n\nWarren, who is a leading candidate in the Democratic presidential primary, has released proposals that would make private equity firms responsible for the debts and retirement obligations of the companies they purchase and make their profits contingent on the success of the entities they control.\n\nThe lawmakers requested a response by Oct. 14.\n\n- With assistance by Heather Perlberg", "description": "Letters from US Congress members, including presidential contender, demand details on correctional facility investments.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/1/4fa9f03ae1724b09ba90c8178284f628_18.jpg", "published_at": "2019-10-01"}