{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/08/salvini-migrant-deaths-are-victims-open-ports-policy", "downloaded_at": "2019-10-08 11:39:23.918444+00:00", "title": "Salvini: Migrant Deaths Are Victims of Open Ports Policy", "language": "en", "text": "Populist former interior minister Matteo Salvini has blamed the recent deaths of migrants in the Mediterranean Sea on the leftist government’s open port policy.\n\nMr Salvini said the open ports policy resumed by the Five Star Movement-Democratic Party coalition is to blame for the estimated 13 or more dead off the coast of Lampedusa.\n\n“These deaths are the results of do-gooders, of ‘there is room for everyone’, of open ports, of renewed enthusiasm for the smugglers,” Salvini said in comments reported by Il Giornale.\n\n“The number of landings has tripled. Those who allowed the ports to be reopened, do they mourn these dead people?” the populist League party leader added.\n\nAccording to reports, the vessel shipwrecked near the island of Lampedusa contained around 50 migrants, 20 of which were reported still missing as of Monday afternoon and 22 rescued by the Italian coastguard.\n\nThe shipwreck took place during rescue operations due to adverse weather conditions and the sudden displacement of migrants from the ship. Eight children are also among the 20 or so migrants missing.\n\nMigrant Sea Deaths Plunge Due to Matteo Salvini’s Closed Ports https://t.co/Q68nntVmsT via @BreitbartNews — Allum Bokhari (@LibertarianBlue) May 25, 2019\n\nThe Agrigento prosecutor’s office says it has already launched an investigation into the incident on potential charges of negligent homicide.\n\nAfter telling Italian Prime Minister Giuseppe Conte that Italy “cannot go on like this”, Salvini said that people smugglers were “celebrating” and urged the government to “realise the disaster of having tripled the landings”.\n\nThe open port policy comes after Salvini had closed Italy’s ports to migrant transport NGOs. The move had significantly reduced the number of newly arriving migrants by over 90 per cent.\n\nAlong with reducing the number of migrants, Salvini’s policy during his time as interior minister also reduced the number of drowning deaths in the Mediterranean.\n\nEarlier this year, before Salvini left office, the International Organization for Migration revealed in the first five months of 2019, only 260 migrants had died in the central Mediterranean — the lowest number in years.", "description": "Following the deaths of migrants in the Mediterranean sea Monday morning, populist former Interior Minister Matteo Salvini has blamed the deaths on the leftist government's open port policy.", "authors": ["Chris Tomlinson"], "top_image": "https://media.breitbart.com/media/2019/01/boat-migrants.jpg", "published_at": "2019-10-08"}