{"pub": "bbc", "url": "https://bbc.com/news/business-49677146", "downloaded_at": "2019-09-12 12:47:06.149625+00:00", "title": "Facebook's Libra should be blocked in Europe, France says", "language": "en", "text": "Image copyright Getty Images\n\nFrance says it will block development of Facebook's Libra digital currency in Europe because it threatens the \"monetary sovereignty\" of governments.\n\nFinance Minister Bruno Le Maire said Libra posed financial risks and could be open to abuse.\n\nHowever, he did not spell out how France could keep Libra out of the 28-member European Union.\n\nThe social media giant announced plans for a currency in July, but the project has faced hostility and scepticism.\n\nTalking about Libra at a meeting of the Organisation for Economic Co-operation and Development, in Paris, Mr Le Maire said: \"This eventual privatisation of money contains risks of abuse of dominant position, risks to sovereignty and risks for consumers and for companies.\"\n\nMr Le Maire said he had been in touch with both the incoming and outgoing heads of the European Central Bank about setting up a \"public digital currency\" under the aegis of international financial institutions.\n\n'Serious concerns'\n\n\"Libra also represents a systemic risk from the moment when you have two billion users. Any breakdown in the functioning of this currency, in the management of its reserves, could create considerable financial disruption,\" said Mr Le Maire.\n\n\"All these concerns about Libra are serious. I therefore want to say with plenty of clarity: in these conditions, we cannot authorise the development of Libra on European soil.\"\n\nLibra, which has the backing of payments firms Visa and Mastercard and taxi apps Lyft and Uber, is expected to launch next year.\n\nAlthough Libra would not be decentralised, like other cryptocurrencies, control would be give to a Switzerland-based non-profit association.\n\nBut in another setback for Libra, this week Switzerland said the proposed payments system could face strict rules that typically apply to banks, on top of tough anti-money laundering laws.\n\nThe Group of Seven advanced economies warned in July that it would not let Libra proceed until all regulatory concerns had been addressed, saying that a prolonged discussion over the project might first be required.\n\nThe US Congress is looking into Libra's potential impact, while central bank chiefs, including the UK's Mark Carney, have voiced scepticism. US President Donald Trump has tweeted he is \"not a fan\" of the currency.", "description": "The social media giant faces growing opposition to its planned cryptocurrency.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/179AD/production/_107758669_getty_composite.png", "published_at": "2019-09-12"}