{"pub": "abcnews", "url": "https://abcnews.go.com/US/amber-alert-issued-year-girl-allegedly-abducted-woman/story?id=66180959", "downloaded_at": "2019-10-10 15:19:33.150511+00:00", "title": "Amber Alert issued for 3-year-old girl allegedly abducted by woman in North Carolina: Police", "language": "en", "text": "An Amber Alert has been issued for a 3-year-old girl who was reported abducted in North Carolina Wednesday, allegedly taken by a woman in her 20s, authorities said.\n\nAhlora Ashanti Sample Lindiment was reported abducted at 6:33 p.m. Wednesday from the Phillips Avenue area in Greensboro, the Greensboro Police Department said.\n\nThe 3-year-old was taken from a playground, reported ABC Raleigh station WTVD.\n\n\"We are still in the process of developing information on the possible abductor and will be updating information throughout the day,\" Greensboro Police spokesman Ronald Glenn told ABC News Thursday morning. \"We have had resources working throughout the night continuing to gather information.\"\n\nAhlora's mother, Erica Lindiment, is pleading with the public to help.\n\nGreensboro Police Dept.\n\n\"Even if you don't want to be known, or you don't want to have your name or anything to do with it, you can always leave an anonymous tip,\" she told WTVD. \"Help us find her and make sure she gets home safe.\"\n\nAhlora was last seen wearing a short sleeve pink T-shirt, black jeans and possibly white sandals, said police.\n\nThe suspect is described as a black woman in her 20s who stands at 5 feet 6 inches tall and weighs about 135 pounds, said police. Her hair was in a short ponytail and she was wearing a short-sleeve black crop top with black pants with tiger print faces on them.\n\nAnyone with information is asked to call 911 or the Greensboro Police Department at 336-373-2287.", "description": "Ahlora Ashanti Sample Lindiment was reported abducted at 6:33 p.m. Wednesday.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/amber-alert-ahlora-flt-ht-ps-191010_hpMain_16x9_992.jpg", "published_at": "2019-10-10"}