{"pub": "reuters", "url": "https://reuters.com/article/us-biogen-alzheimers-focus/biogens-secret-campaign-to-bring-its-alzheimers-drug-back-from-the-ashes-idUSKBN1X417G", "downloaded_at": "2019-10-25 16:24:07.061549+00:00", "title": "Biogen's secret campaign to bring its Alzheimer's drug back from the ashes", "language": "en", "text": "CHICAGO (Reuters) - Biogen Inc’s (BIIB.O) shock decision this week to bring its experimental Alzheimer’s drug back from the scrap heap was born out of “top secret” meetings, non-disclosure agreements and six months of hashing over trial data with scientists, regulators and statisticians, researchers told Reuters.\n\nFILE PHOTO: A sign marks a Biogen facility in Cambridge, Massachusetts, U.S. January 26, 2017. REUTERS/Brian Snyder/File Photo\n\nBiogen had announced in March that it would terminate two large clinical trials of aducanumab because they were likely to fail. Within weeks, a group of company researchers set out to understand what went wrong.\n\nAs they studied data from a larger pool of patients who received the drug, they began to question that conclusion.\n\nIn the months that followed, Biogen kept its own trial investigators and committee overseeing the trial in the dark about the possibility that some patients had benefited from high doses of the therapy, researchers told Reuters.\n\nThe company said it brought in outside Alzheimer’s experts and statisticians to help it parse the new findings, and sought feedback from U.S. regulators on whether it could be considered for approval.\n\nThe result, made public on Tuesday, was an astounding reversal. Biogen will seek U.S. approval for the therapy early next year, once again raising hopes for patients suffering from the brain-wasting disease. Biogen shares gained 27% on investor hopes for a multibillion-dollar blockbuster.\n\nThe risks for Biogen remain high. Wall Street analysts cast doubt on whether Biogen’s analysis would pass muster with the U.S. Food and Drug Administration without an additional years-long trial to confirm the findings.\n\nSeveral Alzheimer’s researchers questioned why one trial appeared to succeed, while another with the same design failed.\n\nMany experts say they are reserving judgment until Biogen presents more detailed data in December.\n\nCompany executives are reluctant to characterize their interactions with the FDA, but said they worked closely with the agency until they were confident in the findings.\n\nBiogen was only willing to move forward with seeking approval for aducanumab after meeting twice with FDA. The final decision was made immediately after the second of those meetings, which took place on Monday, Biogen officials said.\n\nFor the FDA “to say it’s reasonable to file an application after two extensive discussions with them, formal meetings as well as a number of informal discussions, I think it’s significant,” Biogen research chief Al Sandrock said in an interview.\n\nA NAIL IN THE COFFIN\n\nBiogen’s earlier decision to terminate the trials was viewed as the final nail in the coffin for the so-called “amyloid hypothesis” - the theory that removing a protein associated with Alzheimer’s could stave off this fatal form of dementia. Many similar drugs had previously failed.\n\nGlobally, 131 million people are expected to be diagnosed with Alzheimer’s by 2050, up from 50 million today. Any successful treatment could be worth $10 billion or more in annual sales, industry analysts say.\n\nThe March announcement also raised concerns about a second therapy, BAN2401, that works in a similar way. Biogen is partnering with Japan’s Eisai on both drugs.\n\nIvan Cheung, Eisai’s chief executive, said in an interview that he expects aducanumab’s revival will energize enrollment in a late-stage study of BAN2401, with results expected in 2022. Patients taking the highest dose of BAN2401 showed some encouraging results in a midstage trial last year.\n\n“That’s why in the Phase III trial, we are only studying the highest dose,” Cheung said.\n\nThe two aducanumab trials - Engage and Emerge - started a month apart in 2015. Each had about 1,640 patients. As they progressed, the company made changes in the trial that expanded the number of patients who received a higher dose.\n\nAs part of a planned “futility analysis,” outside monitors reviewed half of the data as of December 2018 to determine whether the drug had a reasonable chance of success.\n\n“So many of us felt that this might be the drug that would cross the finish line,” said Dr. Sharon Cohen, director of the Toronto Memory program, who led one of the studies. In March, she received the answer: the therapy looked like a dud.\n\nHowever, patients continued to receive treatment in the interim. Cohen believes the fact that some patients got a higher dose for longer helped swing results in the Emerge study, which ultimately showed a benefit.\n\nA CONTRADICTION\n\nA month after announcing the failure, Biogen began analyzing results from both trials, including additional data from patients who later completed treatment.\n\nBy the time Biogen had its first FDA meeting in mid-June, the company knew that one of the studies had succeeded, and understood that dose was important, said Samantha Budd Haeberlein, who runs Biogen’s Alzheimer’s program.\n\n“We did a great deal of analysis in close contact with the FDA to really understand what occurred in these trials,” Haeberlein said. “It took several months to work through that.”\n\nDuring that entire stretch, Cohen said she and fellow investigators were waiting to hear why the drug had failed. They expected a presentation in July during the Alzheimer’s Association annual meeting, but none came.\n\n“I was completely unaware of what had been discovered until last Sunday,” said Dr. Anton Porsteinsson, a principal investigator for the trials from the University of Rochester School of Medicine and Dentistry. Porsteinsson said Biogen asked him to sign a non-disclosure agreement before sharing the new analysis.\n\nCohen said she first reviewed the new data on Monday in what she called a “top secret” meeting. She said the company wanted a few investigators to hear the findings ahead of Tuesday’s announcement, but had concerns about insider trading.\n\nMany still question why only one trial succeeded.\n\n“The signal from the positive trial was kind of convincing,” said Mayo Clinic Alzheimer’s expert Dr. Ronald Petersen, who has been a paid adviser for Biogen. It showed a 23% reduction in a key measure of cognitive decline.\n\n“But the other study, which was meant to be identical, didn’t show it,” he said. “That’s the challenge there.”", "description": "Biogen Inc's shock decision this week to bring its experimental Alzheimer's drug back from the scrap heap was born out of “top secret\" meetings, non-disclosure agreements and six months of hashing over trial data with scientists, regulators and statisticians, researchers told Reuters.", "authors": ["Julie Steenhuysen", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191025&t=2&i=1444831873&w=1200&r=LYNXMPEF9O0NZ", "published_at": "2019-10-25"}