{"pub": "businessinsider", "url": "https://businessinsider.com/hbo-chernobyl-series-invented-nuclear-physicist-character-2019-6", "downloaded_at": "2019-09-20 22:47:25.579560+00:00", "title": "HBO's 'Chernobyl' series invented a main character to depict the world's worst nuclear power plant accident", "language": "en", "text": "If you've never heard the name Ulana Khomyuk prior to the release of the HBO series \"Chernobyl,\" you're not alone.\n\nWhile most of the show's characters were based on real-life participants in the 1986 nuclear disaster, Khomyuk's character (played by Emily Watson) was invented by writer and producer Craig Mazin.\n\nThe miniseries garnered 19 Emmy nominations, including Watson's nomination for Outstanding Supporting Actress in a Limited Series or Movie. The award show will be held Sunday, September 22.\n\nFor a series that airs strongly on the side of accuracy, \"Chernobyl\" took a detour with Khomyuk, who represents multiple Soviet scientists who investigated the cause of the power plant accident.\n\nRead more: What HBO's 'Chernobyl' gets right (and wrong) about the world's worst nuclear power plant accident\n\nWe're first introduced to her character, a nuclear physicist at the Belarusian Institute for Nuclear Energy, when she detects elevated levels of radiation in her home city of Minsk. The scenario is plausible, given that Belarus saw some of the highest levels of contamination following the disaster.\n\nKhomyuk soon traces the source of the radiation to the Chernobyl Nuclear Power Plant, where the core of a reactor opened on April 26, 1986, sending plumes of radioactive material into the air.\n\nIn the series, Khomyuk works alongside Valery Legasov (played by Jared Harris), a real-life chemist who served as the incident's chief scientific investigator. Khomyuk warns Legasov about the possibility of a steam explosion following the initial blast, effectively thwarting a second nuclear disaster.\n\nBut her quest to uncover the facts of Chernobyl may not have been necessary — or entirely accurate.\n\nThe show's three main characters: Boris Shcherbina, Valery Legasov, and Ulana Khomyuk. Liam Daniel/HBO\n\n\"The nuclear scientists investigating the causes of the accident were well aware of the faults of the RBMK reactor years before the accident,\" Adam Higginbotham, author of \"Midnight in Chernobyl,\" told Inverse. \"There was no need for a crusading whistleblower to uncover the causes.\"\n\nFor Mazin, placing a female character at the heart of the investigation made historical sense.\n\n\"One area where the Soviets were actually more progressive than we were was in the area of science and medicine,\" he told Variety's \"TV Take\" podcast. \"The Soviet Union had quite a large percentage of female doctors.\"\n\nStill, Higginbotham questioned whether a woman would have been tasked with such high authority by the Soviet Union.\n\n\"I'm really not sure of which scientists Emily Watson's character might be a composite,\" he told Inverse. \"There were several women in senior positions in the real drama ... but I know of no women involved at that level of the government commission.\"\n\nThough her character can't be traced to a real-life counterpart, Khomyuk serves a larger purpose as the audience's moral compass.\n\nEven compared to Legasav (the story's hero, if there can be one), she is the character most dedicated to unburying the truth among Soviet officials keen on downplaying the incident. She's even arrested by the KGB for speaking too freely about details of the disaster.\n\n\"She would have been a young woman in the Second World War and grew up through the most horrific times and crimes against humanity, would have witnessed extraordinary things,\" Watson told Scotland's national newspaper, The Scotsman. \"I play her as if this is the defining moment of her life, a calling she's been waiting for.\"", "description": "Ulana Khomyuk represents a composite of several Soviet scientists, but some experts have challenged the accuracy of her character.", "authors": ["Aria Bendix"], "top_image": "https://amp.businessinsider.com/images/5cf57a4211e2051fc93ea914-1136-568.jpg", "published_at": "2019-09-20"}