{"pub": "yahoo", "url": "https://news.yahoo.com/israel-unveils-remains-5-000-old-city-195131985.html", "downloaded_at": "2019-10-07 20:12:18.571854+00:00", "title": "Israel unveils remains of 5,000-year-old city", "language": "en", "text": "Israeli archaeologists on Sunday unveiled the remains of a 5,000-year-old city they said was among the biggest from its era in the region, including fortifications, a ritual temple and a cemetery.\n\n\"We have here an immense urban construction, planned with streets that separate neighbourhoods and public spaces,\" Yitzhak Paz of the Israel Antiquities Authority told AFP at the site near the Mediterranean in the country's centre.\n\nHe called it a major discovery in the region from the Bronze Age.\n\nThe archaeological site known as En Esur \"is the largest site and the most important from that era\" in the region, said Itai Elad, another archaeologist overseeing the excavation.\n\n\"It is 650 dunams (0.65 square kilometres), meaning double what we know.\"\n\nA ritual temple was found within the ancient city along with rare figurines with human and animal faces, they said.\n\nIt also included burnt animal bones in a stone basin that they called proof of sacrificial offerings.\n\nThe excavation allowed for an older settlement from some 7,000 years ago from the Chalcolithic period to be uncovered as well, though smaller than the other discovery.\n\nPaz said the ancient city was the \"first steps in the process of urbanisation\" in what was Canaan at the time.\n\nDina Shalem, another of the archaeologists, noted it included fortifications some 20 metres long and two metres high as well as a cemetery.\n\nAround four million fragments were found at the site, including pieces of pottery, flint tools and vases of stone and basalt, said Elad.\n\nSome of the tools came from Egypt, the archaeologists said.\n\nStanding before a wooden table where some of the findings were displayed, Elad showed some of the more impressive of the fragments, including a club that could have been used as a weapon.\n\n\"Thousands of people lived here from agriculture and commerce,\" said Paz, with estimates putting the number at between 5,000 and 6,000.\n\nHe said the site was abandoned in the third century BC for unknown reasons.\n\nThe excavations carried out over the course of two and a half years included the participation of 5,000 teenagers and volunteers.\n\nThe dig preceded the construction of a road in the area, a project whose plans were modified to preserve the site.", "description": "Israeli archaeologists on Sunday unveiled the remains of a 5,000-year-old city they said was among the biggest from its era in the region, including fortifications, a ritual temple and a cemetery.  \"We have here an immense urban construction, planned with streets that separate neighbourhoods and", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-06"}