{"pub": "yahoo", "url": "https://news.yahoo.com/latest-house-oks-bill-punishing-214035772.html", "downloaded_at": "2019-10-30 00:04:06.895966+00:00", "title": "The Latest: House OKs bill punishing Turkey for Syria move", "language": "en", "text": "In this Monday, Oct. 28, 2019 photo, U.S. forces patrol Syrian oil fields. Pentagon is increasing U.S. efforts to protect Syria's oil fields from the extremist group as well as from Syria itself and the country's Russian allies. (AP Photo/Baderkhan Ahmad)\n\nWASHINGTON (AP) — The Latest on House legislation on Turkey and Syria (all times local):\n\n5:38 p.m.\n\nA united House has voted overwhelmingly to punish Turkey for its invasion of northern Syria. The 403-16 roll call was Congress' latest show of dismay over President Donald Trump's policies in the region.\n\nThe measure would restrict arms sales to Ankara and make it harder for top Turkish officials to have access to their personal assets in the U.S. The sanctions would stay in effect until Turkey withdraws from northern Syria.\n\nTrump withdrew U.S. troops from northern Syria earlier this month. That led to a Turkish attack against Syrian Kurds there, who had been a longtime U.S. ally against the Islamic State group.\n\nTurkey has since reached agreement with Russia to divide control over much of the border area. That's led to diminished U.S. leverage there.\n\n__\n\n4:05 p.m.\n\nA bipartisan bill punishing Turkey for its invasion of northern Syria and illustrating both parties' dismay with President Donald Trump's retreat from the region sailed toward easy House approval Tuesday.\n\nThe bill marks both parties' latest show of disapproval for Trump's decision this month to abandon the United States' longtime Kurdish allies against Islamic State fighters by pulling American forces away from northern Syria.\n\nThe measure would bar most U.S. weapons sales to Turkey and slap sanctions on foreigners attempting to send the Turks military equipment. It would also block high-ranking Turkish officials from their assets in the U.S. and restrict their travel here. Trump would be given a waiver to not impose those penalties if doing so would help U.S. \"national security interests.\"", "description": "A united House has voted overwhelmingly to punish Turkey for its invasion of northern Syria.  The 403-16 roll call was Congress' latest show of dismay over President Donald Trump's policies in the region.  The measure would restrict arms sales to Ankara and make it harder for top Turkish officials", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/4X41L1VbiX72xooX8wu5yg--~B/aD0zNjQ4O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/e185af659309ef0b30f74d112cf6849a", "published_at": "2019-10-29"}