{"pub": "businessinsider", "url": "https://businessinsider.com/drinks-of-the-summer-evolution-spiked-seltzer-aperol-spritz-rose-2019-9", "downloaded_at": "2019-09-15 00:05:56.859115+00:00", "title": "White Claw, Aperol Spritz, and canned rosé have all been dubbed the 'drinks of the summer,' and it makes perfect sense with who millennials tell the world they are", "language": "en", "text": "Millennials are thirsty, and it's not for beer or traditional hard liquor.\n\nInstead, they've been quenching their thirst with hard seltzer— the \"drink of the summer,\" according to Sheila Marikar for The New York Times.\n\nHard seltzer has taken the summer by storm, largely thanks to young millennial men who identify as \"bros,\" reported Business Insider's Bethany Biron. \"At barbecues, on beaches, and at fraternity parties, legions of men are suddenly singing the praises of hard seltzer,\" she wrote.\n\nThe carbonated drink is currently enjoying the same attention that other signature drinks did in previous summers. Last year, the drink of the summer was Aperol Spritz. In 2017, it was canned wine. And the summer before that, it was frosé, an evolution of 2015's drink of the summer — rosé.\n\nRead more:Seltzer is officially 'the drink of the summer.' Anyone who's surprised hasn't been paying attention to what millennials like.\n\nBut what do these drinks have in common, besides some brilliant marketing strategies? One word: millennials.\n\nWhile these drinks have driven consumption trends across all demographics, \"they may appeal more to millennials because they are non-polarizing, meaning, for instance, there was no pre-conceived stigma on who a rosé drinker was (or should be),\" Brandy Rand, COO of the Americas at IWSR Drinks Market Analysis, told Business Insider.\n\n\"There are a few crossover traits as well,\" she added. \"Aperol Spritz is colorful, has low-ABV, and [is] refreshing; hard seltzers are refreshing, low-calorie, and portable; rosé has been cited as a millennial color and canned versions are portable.\"\n\nAnd it all says a lot about what the generation likes.\n\nMillennials are all about health, which means drinks with less alcohol and fewer carbs\n\nSpiked seltzer is low in alcohol, calories, and sugar — and that's a big part of its appeal.\n\nOver the past year, there has been 210% increase in spiked seltzer sales, reported Marikar, citing Nielsen data. Its skyrocketing popularity is related to millennials' fixation on health and wellness: They're seeking a healthier alternative to soda, and prefer to consume natural food and drink sans synthetics, she wrote.\n\nApril Gordon, director of marketing at wine and spirit importer Evaton, Inc., told Business Insider there has been a strong trend among millennials looking for a balanced lifestyle. \"In the alcoholic beverage industry, we have seen this come to life with a literal 'thirst' for drinks with a lower alcohol content,\" she said.\n\nConsider Aperol Spritz, the drink of summer 2018, which combines sparkling wine and soda water with low-ABV Aperol liqueur.\n\nRead more: The 7 trends that defined the millennial summer of 2019\n\nMillennials' inclination toward less alcohol and fewer carbs isn't just seen in what they're buying, but also in what they're not buying. Almost a third of millennials say they're cutting back on alcohol, reported Business Insider's Kate Taylor, citing a poll by Bank of America Merrill Lynch. Beer is being hit the hardest, she wrote — 27% of millennials are cutting back on the tailgate favorite, mainly because it makes them \"fat.\"\n\nIt all makes sense. Sanford Health dubbed millennials the \" wellness generation\" for their increased focus on things like fitness and organic goods. Healthier drinks are just the latest iteration of this lifestyle.\n\nMillennials' love for rosé says a lot about their spending habits\n\nNot all wine bottles — or cans — are created equally. ABVs and sugar content range widely across different types of wine; the millennial-acclaimed rosé has more sugar than other drinks of summers past. A representative for Randy Ullom, winemaster for Kendall-Jackson wines, said that when millennials are purchasing wine, they seek options with lower alcohol content, lower amounts of residual sugar, and minimal carbohydrates.\n\nThe wine industry overall is booming among millennials, who are evolving into a vino generation. The generation drank nearly 42% of all wine consumed in the US in 2015 (the year millennials began rosé-ing all day), Business Insider previously reported. They're on track to overcome Gen Xers as the biggest fine-wine drinking generation by 2026.\n\nFrom 2016 to 2017, rosé sales in the US market specifically grew by 53%, according to Beverage Daily, citing Nielsen data.\n\n\"Rosé is fresh, young, and vibrant,\" Ullom told Business Insider. \"What's not to like!\"\n\nIt helps, too, that rosé opens a new door for millennials, both in terms of taste and price.\"Rosé is an entry wine that catapults you to the next level, say light Pinot Noirs and beyond,\" Ullom said. \"The price point is also fairly approachable for the millennial set, ranging in price from $6 to more than $60 a bottle.\"\n\nOne-figure price points matter for a generation that's financially behind and dealing with a high cost of living and student loan debt.\n\nRead more: The best bottle of wine to bring to any holiday party, from Friendsgiving to your in-laws' Christmas dinner\n\nSocial setting matters, but so does social media\n\nWine is also a drink that's about the experience: It goes well with food in the long-run, enhancing a dining experience, Ullom said, and can be shared and enjoyed socially.\n\nStudies have shown that millennials are more inclined to spend money on experiences, which create a longer-lasting payoff, than they are on concrete items. But for the social media generation, experience is about more than just the social aspect.\n\nAnd there's no denying the obvious: All of these drinks were born for Instagram. Rosé's and frosé's millennial pink is trendy, while Aperol Spritz's bright orange is commanding.\n\nRead more: Millennials would rather spend money on experiences than on things. There are 4 reasons why that's a smart money move, according to a financial expert\n\n\"Millennials are calling for a style of wine that is lighter in color and taste, which just so happens to align itself with the 'millennial pink' trend that is tied closely to the Instagram culture of showcasing everything you do, including eating and drinking,\" Gordon said. \"What's more enticing to drink than a beverage that also photographs beautifully?\"\n\nEven spiked seltzer brands have packaging and catchphrases that millennials love to flaunt on social media. Consider the leader of the pack, White Claw, which has been posted by a number of American bros with hashtags like #clawisthelaw and #whiteclawwasted.\n\nConvenience is often part of the experience\n\nThere's also something to be said about booze in a bottle. Spiked seltzer and canned wine are both portable, a huge plus for millennials who are often on the go.\n\nMarian Leitner, co-founder and CEO of canned wine brand Archer Roose, told Business Insider that canned wine is attractive to millennials because it reflects their lifestyles and what matters most to them in a product: convenience, versatility, and transparency, all without sacrificing quality.\n\n\"Millennials want a wine that they can bring to any setting and actually enjoy it, whether it be a dinner party or a tailgate, without the pre-conceived social notions of quality that come along with a bottle of wine,\" she said. \"Add in the fact that canned wine has a significantly lower carbon footprint than bottles, and it's a win-win.\"\n\nAs Rand puts it, the inclusiveness of these drinks has made them versatile for varying occasions, from brunch to beach. \"Consumers today want drink choices that cater to their lifestyle and offer both convenience and experience,\" she said.\n\nAny guesses as to what the drink the summer of 2020 will bring?", "description": "Millennials like drinks that are healthier, affordable, Instagrammable, and convenient — and it shows how much they value wellness and experiences.", "authors": ["Hillary Hoffower"], "top_image": "https://amp.businessinsider.com/images/5d7b94b32e22af07dc29dbc3-1920-960.jpg", "published_at": "2019-09-14"}