{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7593155/Carlo-Ancelotti-jokes-hell-ring-Zlatan-Ibrahimovic-striker-said-wanted-Napoli.html", "downloaded_at": "2019-10-20 12:45:19.063760+00:00", "title": "Carlo Ancelotti jokes he'll ring Zlatan Ibrahimovic after striker said he wanted to move to Napoli", "language": "en", "text": "Napoli manager Carlo Ancelotti has joked that he will be giving Zlatan Ibrahimovic a call after signalling his desire to move to the Serie A club.\n\nIn an interview with Italian outlet Gazzetta dello Sport, the LA Galaxy forward stated that he would relish the challenge of another stint in Italy once his contract with the MLS club expires in December.\n\nAnd Ancelotti, speaking after Napoli's 2-0 win over Hellas Verona on Saturday, was in a jovial mood, jesting that he would be moving immediately to secure the striker's signature.\n\nCarlo Ancelotti has joked he will ring Zlatan Ibrahimovic after saying he wants a move to Napoli\n\n'I'll call him tonight and say we're waiting!,' Ancelotti joked.\n\n'I have a great deal of affection for him, I saw he scored 29 goals in 30 MLS games. Tomorrow, after I've called him, I'll let you know how it went!'\n\nThe Swede joined LA Galaxy in March last year after terminating his contract at Manchester United, and has scored 52 goals for the MLS club since arriving in the United States.\n\nIbrahimovic has scored 52 goals for LA Galaxy since joining the club back in March 2018\n\nHowever, with his contract up at the end of the year, Ibrahimovic admitted to Gazzetta dello Sport that he still harbours ambitions of playing again in Serie A, which, according to him, 'remains the most difficult club in the world'.\n\n'I appreciated the recent documentary about Diego Maradona and nobody was like him. Seeing the love that the city had for him, it makes me feel like I'd enjoy an experience at Napoli: it'd be fantastic to replicate what Diego did there,' he said.\n\n'I'm not saying I will go there, as the final decision depends on many aspects, that that is a fanbase that creates enthusiasm. With me in the team, the San Paolo would be packed every Sunday. Plus there's Carlo Ancelotti, one of the greats.'\n\nNapoli currently sit fourth in the table after eight games of the Serie A season played, and if Ibrahimovic gets his wish he could return to Italy having already represented Juventus and both Inter and AC Milan.", "description": "Carlo Ancelotti has joked that he will ring Zlatan Ibrahimovic after the striker declared his desire to secure a move back to Italy when his contract with LA Galaxy ends in December.", "authors": ["Kishan Vaghela For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/09/19950582-0-image-a-16_1571560215806.jpg", "published_at": "2019-10-20"}