{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/11/dutch-court-clears-doctor-in-landmark-euthanasia-trial", "downloaded_at": "2019-09-11 13:52:29.105669+00:00", "title": "Dutch court clears doctor in landmark euthanasia trial", "language": "en", "text": "A Dutch doctor has been acquitted in a landmark trial that prosecutors and health professionals hope will help clarify how the country’s 2002 euthanasia law can be applied to people with severe dementia.\n\nThe doctor was cleared of any wrongdoing in carrying out euthanasia three years ago on a 74-year-old woman, who was given fatal doses of drugs despite some indications she might have changed her mind since declaring in writing that she wanted euthanasia.\n\nJudges at the Hague district court ruled that the doctor met all criteria for carrying out euthanasia under the Dutch law legalising mercy killing by physicians.\n\nThe doctor was accused of not acting with due care because, prosecutors alleged, she made insufficient efforts to find out whether the patient still wanted to die. To carry out the euthanasia, the physician drugged the patient’s coffee without her knowledge and then had family members physically restrain the woman while delivering the fatal injection.\n\nProsecution spokeswoman Sanne van der Harg said prosecutors would carefully study the judgment before deciding whether to appeal.\n\nUnder Dutch law, people are eligible for euthanasia if they make a considered, voluntary request for it and if their suffering is hopelessly “unbearable”. Patients can draw up a written request for euthanasia to be performed sometime in the future, in an advance directive, which should specify the conditions determining when they want to be euthanised. Doctors must also seek the advice of at least one other independent physician before killing the patient.\n\nEuthanasia cases among people with advanced dementia are extremely rare; there have been fewer than 20 cases since the procedure was legalised in 2002.\n\n“The most important issue we have to judge as doctors is whether there’s unbearable suffering for the patient,” said Dr Rene Heman, president of the Royal Dutch Medical Association.\n\nHe said the organisation is currently working on guidelines for how doctors should handle euthanasia cases in people with advanced dementia.\n\n“As a doctor, you need to make sure people don’t change their minds,” he said.\n\nDutch investigators began scrutinising the case last December, marking the first time a doctor was criminally investigated for euthanasia.\n\nThe 74-year-old woman had renewed her living will about a year before she died, writing that she wanted to be euthanised “whenever I think the time is right”. Later, the patient said several times in response to being asked if she wanted to die: “But not just now, it’s not so bad yet!” according to a report from the Dutch regional euthanasia review committee.\n\n", "description": "Prosecutors had accused doctor of failing to properly consult 74-year-old woman before administering lethal drugs", "authors": ["Associated Press In The Hague"], "top_image": "https://i.guim.co.uk/img/media/0c5b10c3f9b5bed8f9554dfd9ba2da3a684d1caf/0_0_4032_2420/master/4032.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ae0645e7e84082fdf6d4f4e2e7aff5ee", "published_at": "2019-09-11"}