{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/more-victims-of-sexual-offences-are-reporting-the-crime-stats-sa-20191003", "downloaded_at": "2019-10-05 10:55:05.156877+00:00", "title": "More victims of sexual offences are reporting the crime - Stats SA", "language": "en", "text": "Protesters took to Sandton to voice their frustration against gender-based violence. (PHOTO: Sthembiso Lebuso)\n\nThere has been an increase in the number of people reporting at least one sexual offence to the SA Police Service (SAPS).\n\nAccording to the Victims of Crime report which the statistician general of South Africa, Risenga Maluleke, released on Thursday, the percentage of victims reporting this type of crime was 88%.\n\nThis is an increase from the 73% recorded in 2017/18.\n\nHowever, it showed that there was a decrease in reports of sexual offences in the Western Cape and Limpopo between 2017/18 and 2018/19. The figure increased in all the other provinces.\n\nThe report is extracted from the Governance, Public Safety and Justice Survey (GPSJS).\n\n\n\nIt found that there were about 70 000 incidences of deliberate damage to residential property and arson and that female-headed homes in metropolitan areas were the most likely to be victims of the crime.\n\nThe survey found that the number of incidents of other crimes, such as housebreaking, home robberies, hijackings and car thefts, remained more or less the same compared to 2017/18.\n\nMaluleke said the report also found that the Western Cape recorded the highest percentage of people, aged from 16, to have been victims of robberies on the streets.\n\nKnives made up 62% of the weapons used during robberies and 37% were guns.\n\n\"In 2018/19, there were about 1.2 million incidences of theft of personal property affecting 2.5% of people aged 16 or older in South Africa. The most likely victims of this crime were males, white, young adults and people living in the Western Cape and Gauteng.\"\n\nAccording to the report, there was an estimate of 12 000 murders committed during 2018/19 and the deaths affected about 0.07% of households in the country.\n\nMaluleke said the affected households had reported the matter to the police.\n\nHe added that SAPS data recorded 32 000 murders during the same period.\n\nThe reason for the gap between the GPSJS estimates and SAPS statistics is because the survey estimates were based on murders that were known to households.\n\n\"SAPS handle murders that may not be known to households, such as murders of homeless people, immigrants, temporary visitors and gang-related murders,\" said the statistician general.\n\nIncrease in number of people who feel safe walking alone\n\nThe survey also showed that there were about 260 000 home robberies which affected about 1% of households. The robberies took place in metro homes headed by young adults.\n\nThe most common weapons used during home robberies were guns (54%) and knives were used 47% of the time.\n\n\"In 2018/19 there were about 32 000 incidences of hijacking of motor vehicles. This includes hijacking of trucks. About 0.08% of individuals aged 16 and older were hijacked. About 85% of all hijackings were reported to the police,\" the report revealed.\n\nThe survey also found that there was an increase in the number of people who felt safe walking alone in their areas at night. Most of those who felt safe were males.\n\n\"Rural (24%) people felt safer than urban (15%) residents and people in metros (8%) during the day.\n\nAbout 45% of the people in metro areas felt unsafe at night, compared to urban people (42%) and rural people (39%).\"", "description": "There has been an increase in the number of people reporting at least one sexual offence to the SA Police Service, according to the Victims of Crime report.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9360/3c6e84cf79134490abeb23aca580ac1d.jpg", "published_at": "2019-10-03"}