{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7599577/Football-news-Cristiano-Ronaldo-insists-not-planning-retire-time-soon.html", "downloaded_at": "2019-10-22 15:12:24.857017+00:00", "title": "Cristiano Ronaldo insists he is not planning to retire from football any time soon", "language": "en", "text": "Cristiano Ronaldo has claimed he is not thinking about hanging up his boots any time soon.\n\nThe 34-year-old recently spoke about what he might do after his playing career ended, admitting he could enjoy seeing himself 'outside of football', but he has now made it clear that he does not plan to retire soon.\n\nAnd he is convinced his performances on the field - which recently saw him bag his 700th career goal - show that he is still valuable at the highest level.\n\nCristiano Ronaldo has claimed he is not thinking about hanging up his boots any time soon\n\n'Age is just a number. It does not mean that at 34, 35, 36, you are at the end of your career,' he said.\n\n'I can show that with my performances, how I play, the way I play, the way I still feel good, sharp, thinking about the game, more mature.\n\n'This makes the difference.'\n\nRonaldo was named on the shortlist for the Ballon d'Or on Monday night and will be hoping to win it for the sixth time.\n\nBut the Juventus forward also suggested that his focus is on winning trophies with his team, not individual awards.\n\nHe is convinced his performances on the field show that he is still valuable at the highest level\n\n'We want to win Serie A, we want to win the Cup, the Champions League,' Ronaldo said.\n\n'Juventus should think big. We are going to try to win all the trophies.\n\n'We know it will be difficult, especially the league and the Champions League, but I think it is possible. Everything is possible.\n\n'In terms of individual [honours], I have nothing to say as this is individual. It is not the most important thing,' Ronaldo added.\n\n'The most important is the collective awards. If you win the collective awards, you have more chance to win the individual awards... The Ballon d'Or is for me in second place.'", "description": "The 34-year-old recently spoke about what he might do after his playing career ended, but he has now made it clear that he does not plan to retire soon. He is convinced his displays show his worth.", "authors": ["Amitai Winehouse For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/09/20026252-0-image-a-19_1571732671701.jpg", "published_at": "2019-10-22"}