{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/dark-side-k-pops-high-20582518", "downloaded_at": "2019-10-15 09:43:20.579284+00:00", "title": "Dark side of K-Pop industry with daily weigh-ins, dating bans and cosmetic surgery", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nSouth Korea's hugely successful K-Pop industry has been churning out picture perfect boybands and polished pop princesses since the 1990s.\n\nHowever, in recent years the world of carefully crafted images and catchy chart hits has been tarnished by heart-wrenching tragedy.\n\nEarlier this week, K-Pop was sent into mourning once again after singer Sulli was found dead at home aged just 25.\n\nPolice have since suggested they are investigating the possibility she may have taken her own life.\n\nThe tragedy came after Sulli, real name was Choi Jin-ri, retired from music, blaming online abuse, loneliness and exhaustion for her decision to walk away from a successful career.\n\nIn the first episode of her reality show Jinri Shore, she said: \"I was under so much pressure. I often felt scared. We [f(x)] felt so much pressure. I did what someone told me to do without knowing the reason...\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\n\"At some point, I started to realise and started to wonder why I should do this and for what I’m doing this.\n\n\"The clothes were not for me, I think.\n\n\"I said I’m exhausted, but no one listened to me.\n\n\"I felt like I was alone.\"\n\nThe latest tragedy has increased the spotlight on South Korea's hits factory and the pressures facing young artists working in K-Pop.\n\nThere have been swirling rumours about how hard the artists are pushed and the high standards of both beauty and behaviour they are expected to adhere to.\n\nBack in 2013, Minami Minegishi of Japan's AKB48 band hit headlines when she shaved her head and filmed a tearful video confession after she apparently broke the band's no dating rule.\n\n(Image: Visual China Group via Getty Ima)\n\nShe was said to have digressed by spending a night with her boyfriend.\n\nMinami insisted she didn't want to lose her place in AKB48, a group featuring 100 rotating members, and she was instead demoted to trainee status.\n\nIn 2015, pop protege Ahn So Jin, 22, died after plunging 10 stories from an apartment building and her death was eventually ruled a suicide.\n\nShe had made it through to the finals of a reality show to find a replacement member for girl group Kara following the departure of two members.\n\nAhn didn't get through despite having been a trainee with Kara's management company for five years.\n\nHer contract is believed to have ended just a month before her death. The band broke up the following year.\n\nStars are also said to be put under huge amounts of pressure to look good, according to Kim Min-seok, a former trainer with one of K-Pop's top three agencies, YG Entertainment.\n\nBack in 2016, Kim told Vice stars often face daily weigh-ins, strictly controlled diets and even cosmetic surgery.\n\nKim explained: \"If a girl has a bad face and a good body, the problem can be fixed with plastic surgery.\"\n\nCho Shin, assistant manager of international marketing at Warner Music Korea, added: \"Rather than natural looks and talents, K-pop is about being furnished - it's a product.\n\n\"That product could be molded into something impeccable.\"\n\nJenna Park, who runs S K-pop Entertainment, added that \"there's a bright side but also a really dark side to K-pop.\n\nShe alleged some music industry bosses are aggressively changing girl idols' appearances to make them look more Western.\n\nIn 2017, Oh My Girl star JinE confirmed she was taking a break from the girl group to seek treatment for anorexia.\n\nA statement from the band's management company explained: \"We will wholeheartedly support JinE while she rests and receives treatment.\n\n\"We apologize once more for bringing this sudden news to fans and ask that you continue to show Oh My Girl unchanging love and interest.\"\n\nJinE's permanent exit was confirmed weeks later.\n\n(Image: AFP)\n\nJust weeks ago, boyband superstars BTS rocked the industry by announcing they are taking an \"extended period of rest and relaxation.\"\n\nThe seven-piece group's management, Big Hit Entertainment, said the singers will use the time to \"recharge\" while members of the band have said they are looking forward to \"leading a normal ifel\".\n\n\"We would like to announce that for the first time since their debut, BTS will be going on an official and extended period of rest and relaxation...\n\n\"This period of rest will be an opportunity for the members of BTS, who have relentlessly driven themselves towards their goal since their debut, to recharge and prepare to present themselves anew as musicians and creators.\n\n\"This will also provide them with a chance to enjoy the ordinary lives of young people in their 20s, albeit briefly.\"\n\nThe statement continued: \"During this time, the members will rest and recharge in their own personal ways.\n\n\"Should you have a chance encounter with a member of BTS while they are on vacation, we ask that you show consideration for their need to rest and enjoy their private time off.\n\n\"BTS will return refreshed and recharged to return all the love you have an continue to show them. Thank you.\"\n\n* Samaritans (116 123) operates a 24-hour service available every day of the year. If you prefer to write down how you’re feeling, or if you’re worried about being overheard on the phone, you can email Samaritans at jo@samaritans.org", "description": "A spotlight is on the murky world of K-Pop following a number of tragedies that have rocked the Korean music industry", "authors": ["Louise Randell", "Image", "Yonhap Epa-Efe Rex", "Visual China Group Via Getty Ima", "Afp"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20582991.ece/ALTERNATES/s1200/1_Singer-Sulli-found-dead-in-Seoul-Korea-14-Oct-2019.jpg", "published_at": "2019-10-15"}