{"pub": "huffpost", "url": "https://huffpost.com/entry/robert-de-niro-attacks-trump-supporters_n_5d90db91e4b0ac3cddaa3dc0", "downloaded_at": "2019-09-29 23:30:08.183147+00:00", "title": "Robert De Niro Doubles Down On 'F**k Trump' Speech, Hits Back At Critics", "language": "en", "text": "Robert De Niro’s uncensored digs at President Donald Trump are not going anywhere soon.\n\nThe “Goodfellas” actor delivered some choice words for Trump supporters who don’t like his rhetoric when asked on Sunday about his expletive-laced speech about the president at the 2018 Tony Awards.\n\n“Folks on Fox [News] come after you, I remember the Tonys when you came up there and cursed,” CNN’s Brian Stelter said, prompting De Niro to double down on his unfiltered language.\n\n“Fuck ’em. Fuck ’em,” said De Niro.\n\nFor those of you asking for the full interview with Robert De Niro: Here's the video of part one, addressing his criticism of President Trump. pic.twitter.com/2I1NwsmXun — Brian Stelter (@brianstelter) September 29, 2019\n\nDe Niro got a standing ovation at the 2018 award show when he made what appeared to be an off-script political statement while introducing Bruce Springsteen.\n\n“I’m going to say one thing: Fuck Trump,” De Niro told the audience to cheers. “It’s no longer down with Trump, it’s fuck Trump.”\n\nTrump hit back by disparaging De Niro as “a very LOW IQ individual.”\n\nKevin Mazur via Getty Images Robert De Niro criticized President Donald Trump during the 72nd Annual Tony Awards in New York.\n\n“We are in a moment in our country where this guy is like a gangster,” De Niro told Selter when asked why he responds this way. “We say over and over again this is terrible. We are in a terrible situation and this guy keeps going on and on and on without being stopped.”\n\nAsked if he thinks, as an actor himself, Trump may be acting or performing, De Niro said yes.\n\n“In some ways, I think he is,” he answered, “as I think some of these pundits on Fox are too, because I can’t believe that they would actually buy into this craziness. This guy should not be president, period.”\n\nDe Niro has previously slammed Trump as a ﻿racist and a white supremacist.\n\nWhen recently asked by TMZ how he’d feel about Vice President Mike Pence taking the reins if Trump were impeached, De Niro said he’d “deal with” Pence but isn’t holding his breath about an impeachment.", "description": "“This guy should not be president, period,\" he said on CNN. \"This guy is like a gangster.\"", "authors": ["General Assignment Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d90eeef2400005e00d47e98.png?cache=xygyi5lwqp&ops=1778_1000", "published_at": "2019-09-29"}