{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/breaking-dad-who-shook-three-20583306", "downloaded_at": "2019-10-15 11:22:52.580276+00:00", "title": "Dad who shook his three-week-old baby girl to death jailed for eight years", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA teenage dad who shook his three-week-old daughter to death has been jailed for eight years.\n\nThomas Haining admitted killing Mikayla at the family home in Inverness on June 8, 2017.\n\nHaining, who is now 21, was sentenced at the High Court in Edinburgh today.\n\nHe was originally charged with murdering his daughter, however the Crown accepted his guilty plea to the lesser offence of culpable homicide.\n\nThe little girl died following a fatal attack where her head was struck against a door.\n\nHaining had made internet searches for \"what happens when a newborn is shaked hard\" before he fractured the skull and ribs of his child two years ago.\n\nThe tot also suffered bleeding and damage to the brain as a result of the attack.\n\nDuring the trial advocate depute Michael Meehan said the child's mother Shannon Davies had moved in with Haining the previous year.\n\nMr Meehan said that in the two days before the baby met her death she was unsettled and crying more than usual.\n\nMikayla was put in a Moses basket in the living room at the family home and her mother went to bed, with Haining staying with the child to try to settle her.\n\nIn the early hours of the morning the mother went downstairs and looked at her daughter who appeared to be sleeping before going back to bed.\n\n(Image: Daily Record)\n\nHaining later sent her a text saying: \"Babe sorry to bother you where is Mikayla's thermometer.\"\n\nHe then woke the mum up and asked for the thermometer as he said the baby seemed cold.\n\nThey both checked the child's temperature and Haining told her she had woken up and taken a little mil.\n\nThe mother went back upstairs, but Haining woke her again and asked her to take the baby's temperature again.\n\nLater after 5am the mother was woken again by Haining shouting that Mikayla had stopped breathing, and he told her to call 999.\n\nParamedics attended and the baby was taken to Raigmore Hospital, in Inverness.\n\nA CT scan was carried out on the child which revealed widespread bleeding to the brain.", "description": "Thomas Haining pleaded guilty to killing little Mikayla at the family home, but denied murdering her", "authors": ["Peter Davidson", "Kelly-Ann Mills", "Image", "Pa", "Daily Record"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20013244.ece/ALTERNATES/s1200/0_Thomas-Haining-court-case.jpg", "published_at": "2019-10-15"}