{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/british-airways-revoke-300-compensation-20750133", "downloaded_at": "2019-10-29 15:17:08.315631+00:00", "title": "British Airways revoke £300 compensation to 'drunk' couple kicked off flight", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nBritish Airways has rescinded a £300 offer to a 'drunk' couple kicked off a flight for being disruptive after they moaned it wasn't enough.\n\nMum-of-one Victoria Parker had been on a couple's getaway to Greece last month with her partner Paul Dempsey, 44, when they were escorted off their British Airways flight.\n\nBA claim that staff believed the couple were under the influence of alcohol following complaints from other passengers about their behaviour and turfed them off.\n\nThe 41-year-old hairdresser admits she was 'a bit squiffy' and was told she wouldn't be served any more alcohol after a 'couple of glasses of wine and an ouzo' before getting on the plane but denied being disruptive.\n\n(Image: Kennedy News and Media)\n\nHowever after complaining about their treatment, the couple were sent two voucher codes each worth £150 for their troubles as an 'apology'.\n\nYet still furious over forking out £700 for a new flight and hotel, Victoria continued her complaint and demanded a further explanation of what had gone on.\n\nTo the couple's horror, BA investigated the issue and realised that the £300 vouchers and apology had been sent 'in error' - so the airline withdrew the lot.\n\nInstead, BA have backed their staff for booting off the couple and said it was the 'appropriate action' as 'disruptive behaviour will not be tolerated'.\n\nYet Victoria has still refused to accept BA's verdict and in her search for an explanation even speculates that they might have been targeted because the flight was 'oversold' - while there is no evidence of this.\n\nVictoria, from Peterborough, Cambs, said: \"I don't believe what they are saying, it is totally outrageous and none of it makes sense.\n\n\"BA [called] to say the vouchers were no longer valid and the real reason we were kicked off plane was because we were both disruptive.\n\n\"[They said they'd] had a complaint that I wasn't actually fit to fly, whereas at the airport it was because I touched someone's arm.\n\n\"They are back tracking. Why was I cleared through security if I was a disruption? Why has it gone from me touching a man's arm to us both being complained about.\n\n(Image: Kennedy News and Media)\n\n\"They aren't being entirely clear because they are covering it up. And being cagey or just don't know what actually happened. I am so furious about this. It's so corrupt.\n\n\"I don't care about the vouchers. It's the way we were treated.\n\n\"We've been stitched up and they should have investigated it themselves before removing us. Shouldn't it be the captain's decision?\n\n\"I accept I was a bit squiffy after three drinks sat in the sun, but I was not in anyway disruptive.\n\n\"And why would they apologise and offer vouchers in the first place if we were those things?\"\n\nVictoria and Paul had been sat on the plane on the runway for 10 minutes before a member of staff approached and asked them to follow him.\n\nShe claims it 'all happened so quickly' and before they knew it, they were being handed their luggage and told they would have to 'get a flight tomorrow'.\n\nVictoria claims she was told the reason she had being taken off the plane was because she 'touched a man's arm' - which she claims was 'completely fabricated'.\n\nVictoria said: \"I was very shocked and it all happened so quickly.\n\n\"We did wonder whether or not we'd been stitched up. Was it a case of the flight being oversold and they just targeted us?\n\n\"I believe [the complaint I touched a man's arm] is completely fabricated.\n\n\"The airport guy said that it happened as I was walking along the plane. We boarded at the front of the plane and our seats were the very back ones, so it could have.\n\n(Image: Kennedy News and Media)\n\n\"I was carrying a large shoulder bag and walking along such a tiny aisle, but that wouldn't explain why a Greek ground staff member boarded the plane to remove us.\n\n\"The guy at the desk said 'you'll have to get a flight tomorrow'. There wasn't police or security - nothing.\"\n\nVictoria and Paul, an engineer, had enjoyed a week away but claim the experience ruined their happy memories.\n\nAfter being turned away, they were forced to fork out £700 for another night in a hotel and flight home the next day.\n\nVictoria said: \"It really spoiled the holiday.\n\n\"We had to pay for another night in a hotel and flights which came to around £700. That's £700 that we hadn't budgeted for. If we didn't pay it, we'd have been stuck there.\n\n\"They have replied and offered us only £150 [each] and no explanation.\"\n\nA spokesperson from British Airways said: \"Disruptive behaviour will not be tolerated on board our aircraft and we will always take the appropriate action.​\n\n\"Unfortunately this email was sent in error and we have been in contact with our customer to explain this.\"", "description": "Victoria Parker and Paul Dempsey had been on a couple's getaway to Greece when they were chucked off the flight for being 'disruptive', according to British Airways", "authors": ["Sophie Norris", "Image", "Kennedy News", "Media"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20750146.ece/ALTERNATES/s1200/0_PAY-Kennedy-News-and-Media.jpg", "published_at": "2019-10-29"}