{"pub": "reuters", "url": "https://in.reuters.com/article/us-qatar-energy-qp-exclusive/exclusive-qatar-shortlists-partners-for-north-field-expansion-but-says-it-may-go-it-alone-idINKCN1VU127", "downloaded_at": "2019-09-09 11:48:24.154923+00:00", "title": "Exclusive: Qatar shortlists partners for North Field expansion, but says it may go it alone", "language": "en", "text": "DOHA (Reuters) - Qatar has shortlisted international oil firms for a stake in its expanded North Field megaproject, Qatar Petroleum’s chief executive told Reuters, but may still choose to go it alone unless majors offer it significant value.\n\nFILE PHOTO: Qatar Petroleum CEO and Minister of State for Energy Saad al-Kaabi speaks during a news conference in Doha, Qatar June 24, 2019. REUTERS/Naseem Zeitoun\n\nThe expansion of tiny but gas-rich Qatar’s liquefied natural gas (LNG) facilities, already the world’s largest, is one of the energy sector’s most lucrative projects, and the world’s top oil and gas majors have been racing to secure a stake.\n\nInvitations to bid were sent out last month and the result is due to be announced in the first quarter of 2020, Saad al-Kaabi, who is also minister of state for energy, said - if Qatar decides to go with partners at all.\n\n“We like the partnership model for many benefits. But because we don’t need the partners, what’s going out is basically a set of criteria that we have, to demonstrate to us what added value we get for Qatar if you come in,” said Kaabi.\n\n“Maybe they can give us something outside,” he said, referring to LNG assets outside its domestic market.\n\nQP wants to lift its LNG production to around 110 million tonnes per annum from today’s 77 mtpa over the next five years by building four new production facilities.\n\nSpeaking from his office in Doha, Kaabi told Reuters that with the remaining contracts for its completion set to be awarded by the end of 2019, it was now asking a shortlist of majors to bid for a stake in the completed project.\n\nHe did not say how large a slice of the asset would be on offer, and declined to comment on which companies had been shortlisted.\n\nTotal, Exxon Mobil, Shell, and Italy’s Eni have all offered QP stakes in prize assets abroad in a bid to secure a stake in the project.\n\nThose assets, from stakes in sought-after exploration blocks to partnerships in petrochemical facilities, have helped transform QP into a significant international player in top gas and oil provinces from Mexico to Mozambique.\n\nAlthough it says it is confident it can go it alone on developing its LNG resources, finding a home for all the extra supply it is expecting to come online is something oil majors can offer significant help with.\n\nQatar sees another 33 million tonnes of LNG flowing from the new facilities in 2024, and it will also need buyers for another 35 million tonnes as existing contracts expire over the next five years.\n\nKaabi declined to elaborate on the criteria that could help land partners a stake.\n\nUPPING THE ANTE\n\nHe said QP’s decision to self-finance the project, tender for its construction, and drill appraisal wells before offering partners a chance to buy in was part of a strategy to up the ante on what majors must now offer Qatar for a piece of its top asset.\n\nA recently drilled appraisal well produced double the yield that was expected, a potentially good omen for what lies ahead, said Kaabi.\n\n“It means we have a great project with great reserves, and the North Field is very prolific.”\n\nBut the super-wealthy country also faces significant challenges. Global LNG demand is flagging due among other things to the U.S.-China trade war at a time supply from competitors like Australia, the United States and Russia is rising.\n\nMounting tensions between the West and Iran in the Gulf may also affect the country’s ability to ship out gas, while an economic embargo by its neighbors could hurt regional sales.\n\nKaabi said QP would seek more long-term LNG supply deals, including in Europe, after it last month signed an agreement for unloading services at Belgium’s Zeebrugge LNG Terminal, securing its full capacity through 2044.\n\n“We’re going to do more in Europe - you’re going to see,” he said.\n\nQP also expects to sign at least one upstream block in the United States - typically exploration rights or a field in development - before year-end as it looks to capitalize on its $10 billion Golden Pass LNG export terminal in Texas.\n\nFILE PHOTO: The logo of Qatar Petroleum is seen at its headquarters in Doha, Qatar, July 8, 2017. REUTERS/Stringer\n\nThe terminal, a joint venture with Exxon Mobil, is seen coming online in 2024.\n\nDespite the slew of assets acquired over the past year, Kaabi said QP remains hungry for more upstream exploration blocks around the world.\n\n“Anywhere you find the hottest beds in the world, you’ll see us there,” he said.", "description": "Qatar has shortlisted international oil firms for a stake in its expanded North Field megaproject, Qatar Petroleum's chief executive told Reuters, but may still choose to go it alone unless majors offer it significant value.", "authors": ["Rania El Gamal", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190909&t=2&i=1427915622&w=1200&r=LYNXNPEF880ZW", "published_at": "2019-09-09"}