{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7550509/Katy-Perry-flashes-cleavage-powder-blue-bra-sheer-mimics-lingerie-mannequins.html", "downloaded_at": "2019-10-08 15:21:28.091003+00:00", "title": "Katy Perry mimics lingerie mannequins at underwear brand launch", "language": "en", "text": "She's an international pop star known for her sensational vocals, quirky style sense and killer body.\n\nAnd, Katy Perry, 34, flashed her ample cleavage in a powder blue bra and sheer top as she mimicked lingerie mannequins at the launch of The Kit Undergarments on Monday night.\n\nThe Firework hitmaker lent her support to the event by showing up wearing one of their creations beneath a sheer blue polo-neck adorned with a pretty flower sketch, and documenting her fun on Instagram.\n\nWow! Katy Perry, 34, flashed her ample cleavage in a powder blue bra and sheer top as she mimicked lingerie mannequins at the launch of The Kit Undergarments on Monday night\n\nKaty teamed her revealing long-sleeved top with wet-look tomato coloured trousers and a thick orange waist belt.\n\nHer platinum bob was styled sleek and straight and the singing sensation sported a glamorous make-up look, complete with false eyelashes and a fuchsia lip.\n\nOn her Instagram stories, Katy captioned the start of her time at the launch event with: 'About last night. My friends @sweetbabyjamie @simoneharouche launched @thekitundergarments I support it just like their bras support me.'\n\nIn one fun clip, the camera showed many mannequins displaying underwear from the brand, before stopping on Katy who is pretending to be one.\n\nWow! The Firework hitmaker lent her support to the event by showing up wearing one of their creations beneath a sheer blue polo-neck adorned with a pretty flower sketch\n\nFun times: In one fun clip on her Instagram, the camera showed many mannequins displaying underwear from the brand, before stopping on Katy who is pretending to be one\n\nQuirky: Katy teamed her revealing long-sleeved top with wet-look tomato coloured trousers and a thick orange waist belt\n\nBoobs: As she showed off her best model moves, Katy added a sticker to the video which read: \"New message. Boobs\"\n\nAs she showed off her best model moves, Katy added a sticker to the video which read: \"New message. Boobs.\"\n\nMeanwhile, Katy Perry became engaged to actor Orlando Bloom, 42, after her proposed on Valentine's Day.\n\nAnd, sources told US Weekly at the end of last week that the Firework hitmaker and 42 year old Pirates of the Caribbean star are planning a December wedding.\n\nBeauty: Her platinum bob was styled sleek and straight and the singing sensation sported a glamorous make-up look, complete with false eyelashes and a fuchsia lip\n\nWork it: Katy showed up to support her friends who launched the new underwear bran\n\nThe couple first started dating in early 2016, shortly after the Golden Globe Awards that year, though they announced in February 2017 that they had split.\n\nThey reconciled in April 2018, and the Pirates Of The Caribbean star popped the question 10 months later.\n\nPop singer Katy was previously married to actor/comedian Russell Brand from 2010 to 2012.\n\nOrlando was married to supermodel Miranda Kerr from July 2010 to October 2013, and the former couple share a son Flynn Christopher Bloom, 8.", "description": "The Firework hitmaker, 34, showed her support at the launch of The Kit Undergarments on Monday night.", "authors": ["Ellie Phillips For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/15/19446250-0-image-a-32_1570544642152.jpg", "published_at": "2019-10-08"}