{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-usa-autos-labor/uaw-union-pushes-gm-to-boost-u-s-auto-production-idUKKBN1WN23B", "downloaded_at": "2019-10-09 02:44:15.886861+00:00", "title": "GM strike affects about 150,000 auto industry workers - consulting firm", "language": "en", "text": "(Reuters) - The prolonged strike at General Motors Co (GM.N) is estimated to have hit as many as 150,000 workers in the auto industry, a report from research and consulting firm Anderson Economic Group (AEG) showed on Tuesday.\n\nFILE PHOTO: General Motors assembly workers picket outside the General Motors Bowling Green plant during the United Auto Workers (UAW) national strike in Bowling Green, Kentucky, U.S., September 17, 2019. REUTERS/Bryan Woolston\n\nThe strike at the No. 1 U.S. carmaker began on Sept. 16, with its 48,000 members of the United Auto Workers (UAW) union seeking higher pay, greater job security, a bigger share of the automaker’s profit and protection of healthcare benefits.\n\nA key issue separating the two sides is job security, the UAW’s top negotiator wrote in a letter released on Tuesday.\n\nThe union wants GM to commit to building vehicles sold in the United States at UAW-represented factories, UAW Vice President Terry Dittes wrote in a letter to union members.\n\n“We have made it clear that there is no job security for us when GM products are made in other countries for the purpose of selling them here in the U.S.A.,” Dittes said.\n\n“We believe that the vehicles GM sells here should be built here.”\n\nAbout 75,000 employees of auto parts suppliers have either been temporarily laid off or have seen their wages shrink due to the slump in demand from GM, according to the AEG report.\n\nThe total number of workers hit by the strike includes about 25,000 GM salaried workers affected by the plant shutdowns, it said.\n\nAbout 5,000 workers at Michigan auto suppliers have filed for unemployment benefits as a result of the strike, the state’s Unemployment Insurance Agency said on Tuesday.\n\nAEG estimates that the strike has resulted in a $660 million (540.6 million pounds) profit hit for GM and more than $412 million in direct wage losses for all employees through the third week of the strike.\n\nGM’s share price dropped by 2.5% on Tuesday as broader indexes fell. Its share price has lost 9% since the strike began, slicing more than $4 billion from the automaker’s market value.\n\nThe stoppage has also led to $155 million in lost federal income and payroll tax revenue and $9.1 million in lost Michigan income tax revenue.\n\nTalks for a new four-year labor contract took a “turn for the worse” on Sunday after the UAW rejected GM’s latest offer but the two sides were still talking.", "description": "The prolonged strike at General Motors Co is estimated to have hit as many as 150,000 workers in the auto industry, a report from research and consulting firm Anderson Economic Group (AEG) showed on Tuesday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191008&t=2&i=1438538311&w=1200&r=LYNXMPEF971HO", "published_at": "2019-10-09"}