{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/26/jack-hatton-olympic-judo-hopeful-dies", "downloaded_at": "2019-09-26 16:48:02.651826+00:00", "title": "USA judo’s Jack Hatton, an Olympic hopeful and ‘true role model,’ dies at 24", "language": "en", "text": "“It is with our deepest sorrow that we inform you of the untimely passing of one of our students, teammates, brothers, and friends, Jack Hatton,” the center wrote. “Jack has been a member of Pedro’s Judo Center since 2015 and pursuing his dream of becoming a member of the 2020 Olympic Team. Along with being a top U.S. Judo athlete, Jack was kindhearted, caring and an all-around great person. He was a true role model for students at our dojo and judoka all over the country.\n\n“He will be deeply missed by all of us at Pedro’s Judo Center and the rest of the judo world. If you or a loved one is struggling with depression or their mental health, please seek help by calling 1-800-273-8255 or speak to someone.”\n\nOne of the country’s top judokas in the -81 kg division, Hatton placed fifth at the Pan Am Games in August and recently competed at the world championships in Tokyo but did not place. His best international finish was a silver medal won at the Antalya (Turkey) Grand Prix in 2018. He was regarded as a top candidate to make the 2020 Olympic team.\n\nIn announcing Hatton’s death Wednesday, USA Judo wrote on Facebook that “Jack made an indelible mark on all who had the pleasure of knowing him, and he will not be forgotten. We grieve with the entire USA Judo and international judo community during this tough time. USA Judo is in the process of providing grief counseling services for those in need and will share information on services for Jack as they become available.”\n\nA New York City native and the son of a black belt in the sport, Hatton first tried judo when he was 4 and in 2016 joined the New York Athletic Club’s judo program, according to the club’s July magazine. He went on to join Pedro’s program.\n\nThe judo community was stunned by Hatton’s death.\n\n“Jack is one of the best USA Judoka and top athlete at the U81kg division,” world champion Sagi Muki said, via Judoinside.com. “I’m so sad top hear this and I hope he is in a better place. I had a tough fight with him. My heart is broken.”\n\nKhasan Khalmurzaev, the gold medalist in the -81 kg event at the 2016 Summer Olympics, said he is “in shock. Of course I remember Jack and my match against him. He was a very promising athlete and I think he had a great future. It’s a pity. May he rest in piece. My condolences to his family.”\n\nRead more Olympic coverage from The Post:\n\nDriven to the end: Olympic cyclist Kelly Catlin could do it all. Until it all became too much.\n\nIran suspended from world judo over Israel boycott policy\n\nTommie Smith and John Carlos were once sent home for their Olympic protest. Now they’ll get the USOPC’s highest honor.\n\nRussia’s spot in the Tokyo Olympics is threatened amid new doping concerns\n\nThis group is supposed to handle Olympic sex abuse complaints. A report shows its limits.", "description": "The American judo community is mourning the death of a promising young athlete, four days after he turned 24.", "authors": ["Cindy Boren", "Reporter Covering Sports", "With An Emphasis On Politics", "National Stories"], "top_image": "https://www.washingtonpost.com/resizer/RNLEIeiaMjgOf3uccBImiN1dq70=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/G552NAGJJEI6TFQVR4NDFFROAQ.jpg", "published_at": "2019-09-26"}