{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/education/parents-sue-fairfax-schools-allege-improper-seclusion-and-restraint-of-students-with-disabilities/2019/10/08/066166dc-e9f8-11e9-85c0-85a098e47b37_story.html", "downloaded_at": "2019-10-09 00:36:29.194139+00:00", "title": "Parents sue Fairfax schools, allege improper seclusion and restraint of students with disabilities", "language": "en", "text": "A spokeswoman for Fairfax County Public Schools did not immediately return a request seeking comment Tuesday afternoon.\n\nAD\n\nTidd’s son was secluded on at least 745 occasions and excluded from class several hundred more times over seven years, according to court papers. Tidd said she did not receive notice or documentation of the instances of seclusion within 24 hours, despite school system guidelines that say she should have been notified in that time frame.\n\nAD\n\n“We have really no way of knowing what the total is,” Tidd said. “Our trust has been breached.”\n\nThe parents, who filed the lawsuit on behalf of four students, are asking the federal court to bar the school system from using either of the closely related practices on students with disabilities until an alternative system is implemented.\n\nAD\n\nThey also want the court to direct the school system to adopt reforms that prevent the unnecessary seclusion and restraint of students with disabilities and eliminate the practices as disciplinary or punitive measures, the lawsuit states.\n\nDenise Marshall, executive director of the Council of Parent Attorneys and Advocates, a group that works to protect the rights of students with disabilities that joined the parents in the lawsuit, said the school system has abdicated its duty to provide students with a safe environment.\n\nAD\n\n“It’s really disturbing to us any one student or several students have been restrained at such a high rate or placed in seclusion, day after day,” Marshall said. “We know that the students named in the suit are not alone.”\n\nAD\n\nThe Autistic Self Advocacy Network, which champions people with autism, and Communication First, which represents people with speech-related communication disabilities, are also plaintiffs in the suit.\n\nThe parents and disability rights groups accuse Fairfax school employees of secluding or restraining students with disabilities because workers are ill-equipped to “address the disability-related need itself.”\n\n“They have allowed their untrained staff to respond to students with disabilities with no, or limited, training and guidance, forcing staff to assume knowledge and responsibilities for responding to children with disabilities that they profoundly lack,” the lawsuit states.\n\nAD\n\nAD\n\nThe Fairfax school system launched an investigation into its seclusion and restraint procedures after a report by WAMU-FM (88.5) identified hundreds of cases that school system officials failed to report to the federal government as required.\n\nIn the 2015-2016 school year, Fairfax told the U.S. Education Department that not a single student had been secluded or restrained in its 198 schools and education centers. Nine other large school systems, including New York, the nation’s largest district, also reported no instances of seclusion or restraint.\n\nA June report from the federal government found that many school systems do a poor job of tracking seclusion and restraint, making it difficult for the Education Department to ensure that schools are not using the practices excessively.\n\nAD\n\nThe federal report said the findings raise questions about whether the errant reporting discovered in several large districts is “indicative of a more pervasive pattern of restraint and seclusion in U.S. public schools.”\n\nAD\n\nAccording to the lawsuit filed against the Fairfax system, Tidd’s son was isolated in a “six-by-six-foot padded room with a magnetically locked door” and was regularly secluded for reasons that did not pose an imminent threat to himself or others, violating his constitutional rights.\n\nThe Fairfax school system prohibits seclusion and restraint unless the practices are necessary to protect the student or others.\n\nTidd said the boy experienced stress and nightmares as a result of routine seclusion. The 13-year-old now attends a private school where the use of restraint is limited and seclusion is not used, the mother said, and his behavior has improved.", "description": "They say the practices are used to punish and segregate special-needs students.", "authors": ["Debbie Truong", "Reporter Covering Virginia Schools"], "top_image": "https://www.washingtonpost.com/resizer/wPvewH2UCxkk0dGx84erhN2aCqM=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7ZIZUIVIHII6NOSZU7MTCZOG2Q.jpg", "published_at": "2019-10-08"}