{"pub": "yahoo", "url": "https://sg.news.yahoo.com/too-few-local-biz-class-231551529.html", "downloaded_at": "2019-10-24 14:11:51.763134+00:00", "title": "Too few local biz class flyers to keep Malaysia Airlines airborne, Khazanah concludes", "language": "en", "text": "Khazanah Nasional Bhd, through its subsidiary Malaysian Aviation Group Bhd, is the sole owner of Malaysia Airlines Berhad. — AFP pic\n\nKUALA LUMPUR, Oct 24 ― Malaysia Airlines Bhd (MAB) is uncompetitive in the long-haul and full-service sectors as there are not enough premium travellers in the country, Khazanah Nasional Bhd said.\n\nKhazanah managing director Datuk Shahril Ridza Ridzuan told the Public Accounts Committee (PAC) in April that travellers could easily get cheaper airfares if they are willing to transit, even as MAB discounted prices for direct flights.\n\n“That is the fundamental problem with Malaysia as an aviation industry. Unlike Singapore or Hong Kong which has a very high concentration of business users, who are very time-sensitive,” Shahril said in the report published yesterday.\n\n“They just want a direct non-stop flight. That is why Singapore Airlines and Cathay, for instance, have a much bigger business class and they have the ability to fill the business class at higher prices because the underlying users basically are a different market segment.”\n\nKhazanah, through its subsidiary Malaysian Aviation Group Bhd, is the sole owner of MAB.\n\nIn contrast, Shahril said Malaysian consumers are “very price sensitive” and prioritised this over the product or the convenience it offers.\n\n“That is why low-cost seat or low-cost carriers have about a 60 per cent share of market in Malaysia. We just don’t have enough business users in Malaysia for full service airline,” he added.\n\nReplying Betong MP Robert Lawson Chuat, Shahril also said that MAB’s share of the domestic flight market was now just over 20 per cent, below low-cost carrier AirAsia Bhd.\n\nSubang MP Wong Chen also suggested that MAB carve out niches in the middle, upper-middle, and upper segments ― since its competitors all cater to the low-end segment ― all while keeping the costs low.\n\nShahril replied that it would be a conundrum to operate what he jokingly referred to as “high-end airline with cheap costs”.\n\n“High-end cheap, accurate. What we call austerity class. [Laughs]. No. But there must be a point where the overheads of the staff, engineers and all those things, should be able to meet the number of airplanes you have, right?\n\n“Are we already at that point, that optimum point?” Wong asked, to which Shahril explained that MAB is actually at a very competitive cost point.\n\nIn the same proceeding, Shahril also said Khazanah believed that an oversupply of airlines and flights based in the country is the main reason why MAB is struggling to make money.\n\nBesides Khazanah, other carriers based in Malaysia are AirAsia, its long-haul sister company AirAsia X, and Lion Group’s Malindo Air.\n\nOn Tuesday, Economic Affairs Minister Datuk Seri Mohamed Azmin Ali said the government will appoint a strategic partner to take over MAB within the next few months.\n\nAzmin told Parliament that four potential bidders have been shortlisted from 20 received by Khazanah and the airlines’ parent company Malaysian Aviation Group Bhd.\n\nThe sovereign wealth fund has been trying to find new owners for MAB after a RM6 billion capital injection since 2014 as well as a massive restructuring that saw the termination of 6,000 employees failed to result in profitability.\n\nPAC said it is satisfied with Khazanah’s explanation over its RM6.3 billion loss last year, which was due to: a change in the government’s telecommunication policy, financial reporting standards, and a change in investment strategy.\n\nRelated Articles Khazanah confirms leaving KLCC for KL Sentral to save RM20m annually Khazanah: Too many airlines based here bad for Malaysia Airlines, weaker ones need to quit Decision on strategic partner for Malaysia Airlines by early 2020 latest, says Azmin", "description": "KUALA LUMPUR, Oct 24 ― Malaysia Airlines Bhd (MAB) is uncompetitive in the long-haul and full-service sectors as there are not enough premium travellers in the country, Khazanah Nasional Bhd said....", "authors": ["Zurairi Ar"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-23"}