{"pub": "nytimes", "url": "https://nytimes.com/2018/10/22/opinion/free-speech-metoo-lawsuits-snowflakes.html", "downloaded_at": "2019-09-15 00:12:32.181616+00:00", "title": "Opinion | Attack of the Right-Wing Snowflakes", "language": "en", "text": "And, of course, there’s Stephen Elliott, the writer suing Moira Donegan, creator of a crowdsourced spreadsheet of allegedly abusive men in the media industry, as well as the people who contributed to it. Through the suit, he’s trying to force the disclosure of these people’s names, something that would have profound implications for every part of the internet where anonymity is the norm.\n\nThere are many ethical ambiguities in the media men list, a clearinghouse for anonymous allegations where someone wrote that “rape accusations” had been made against Elliott. While Elliott told my colleague Bari Weiss that he has, in the past, been “unaware of boundaries and transgressed them without realizing,” he insists he is innocent of rape, and has no way to clear himself of an anonymous charge that has ruined his life. If this is true, he deserves sympathy.\n\nDonegan, however, didn’t write the allegations against Elliott. And his suit attempts to use her fiery feminism against her, saying she has a “well-documented history of publicly publishing statements professing a hatred of men.” Seeing this, any woman who contributed to the list — or merely forwarded a link to it — might feel the need to temper her anger at the patriarchy online.\n\nDuring the civil rights era, Southern segregationists waged what Elena Kagan once called, in her pre-Supreme Court days, a “campaign which intended to curtail media coverage of the civil rights struggle” through libel lawsuits against journalists. That became more difficult with the 1964 Supreme Court decision New York Times Company v. Sullivan, a case involving a full-page ad in The Times, paid for by the Committee to Defend Martin Luther King and the Struggle for Freedom in the South, that contained factual errors. The court’s decision required people claiming libel to prove “actual malice,” not simply untruths.\n\nRoberta Kaplan, a renowned feminist lawyer who is now representing Donegan, told me that after Sullivan, it became conventional wisdom that defamation lawsuits aren’t “rational or appropriate ways to settle disputes about truth or falsity, except in really exceptional circumstances.”", "description": "Angry men go to court to silence their critics.", "authors": ["Michelle Goldberg"], "top_image": "https://static01.nyt.com/images/2018/10/22/opinion/22goldberg4/22goldberg4-facebookJumbo.jpg", "published_at": "2018-10-22"}