{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7560321/Lawsuit-Officer-played-Russian-roulette-girlfriends.html", "downloaded_at": "2019-10-11 00:29:28.788484+00:00", "title": "Cop who 'killed a colleague while playing Russian roulette had forced other women to play the game'", "language": "en", "text": "The St. Louis police officer charged in the fatal shooting of a female colleague while playing a variation of Russian roulette had a history of forcing other women to also play the game, according to a wrongful death lawsuit filed by the dead officer's mother.\n\nThe lawsuit filed Wednesday by Katlyn Alix's mother also contends Nathaniel Hendren had a 'complicated psychiatric' history and that the city should have known about it before hiring him, according to The St. Louis Post-Dispatch.\n\nHendren has pleaded not guilty to first-degree manslaughter and armed criminal action following the January shooting death of Alix.\n\nAimee L. Wahlers' lawsuit alleges that neighbors heard a 'screaming fight' before the shooting and that Hendren forced other women he'd been in relationships with to engage in sexual activity that involved firearms.\n\nNathaniel Hendren, right, has pleaded not guilty to first-degree manslaughter and armed criminal action following the January shooting death of Katlyn Alix, left,. He had a history of forcing other women to also play Russian Roulette, according to a wrongful death lawsuit\n\nThe civil lawsuit was filed by Alix's mother, Aimee L. Wahlers, pictured, on Wednesday contends Nathaniel Hendren had a 'complicated psychiatric' history and alleges that neighbors heard a 'screaming fight' before the shooting\n\nProsecutors allege Alix and Hendren were drinking and taking turns pointing a gun loaded with one bullet at each other and pulling the trigger.\n\nHendren and his partner, Patrick Riordan, were on-duty but at one of their apartments in the early hours of January 24. Alix, who was off-duty, was also there. Riordan has not been charged with a crime.\n\nAn internal police misconduct report provided to The Associated Press by police accuses Hendren and Riordan of drinking on duty at the time of Alix's death, in violation of department policy.\n\nThe civil lawsuit was filed in St. Louis Circuit Court against Hendren, Riordan, Gary Foster and the city of St. Louis. Foster was the officers' sergeant.\n\nProsecutors allege Alix, pictured, and Hendren were drinking and taking turns pointing a gun loaded with one bullet at each other and pulling the trigger\n\nIt contends that Hendren had a psychiatric history before he was hired that included anxiety, depression, post-traumatic stress disorder and 'suicidal ideations and gestures.'\n\nTalmage Newton IV, the lawyer representing Hendren in the criminal case, has called Alix's death a 'tragic accident.'\n\nNewton told the Post-Dispatch that a cursory review of the civil lawsuit found inaccuracies and misstatements, but he did not elaborate. He said he had no information about the allegation that Hendren forced past girlfriends to play Russian roulette.\n\nNewton did not immediately return a phone message from the AP seeking comment.\n\nAlix met Hendren and Riordan at Hendren's home while the two men were supposed to be working and drank alcohol and other 'unknown substances', according to the lawsuit.\n\nIt alleges that after the screaming heard by neighbors, Hendren put a single bullet into the gun and pointed it at Alix before firing it.\n\nAlix got married for a second time with another police officer Anthony Meyer in October — just three months before her death.\n\nHer death is still raising more questions than it has given answers, such as what she was doing at her colleague's home in the early hours of the morning, why Hendren decided to abandon his patrol and drive 10 miles home in the middle of his shift and how much alcohol was drunk at the home.\n\nThe lawsuit's account of the shooting differs from the probable cause statement filed in the criminal case in which authorities contend Hendren and Alix had taken turns pointing the gun and pulling the trigger.\n\nThat says Hendren placed one round in the gun's chamber and pointed it at Alix and pulled the trigger. She then did the same, aiming at him.\n\nProsecutors say the gun did not go off either time. But on the third attempt, Hendren allegedly fired and shot Alix in the chest.\n\nOfficer Patrick Riordan (center) was on duty with Hendren when he allegedly witnessed the cops play the game that cost Alix her life. He is pictured at his graduation ceremony in April 2017. The civil lawsuit was filed in St. Louis Circuit Court against Hendren, Riordan, Gary Foster and the city of St. Louis. Foster was the officers' sergeant\n\nThe lawsuit claims Hendren forced other women he'd been in relationships with to play Russian roulette and engage in sexual activity that involved firearms. It contends that Hendren had a psychiatric history before he was hired that included anxiety, depression, post-traumatic stress disorder and 'suicidal ideations and gestures'\n\nHendren's partner, Riordan, who is currently on paid administrative leave, told investigators he had told his fellow cops off for playing with the gun and felt so uncomfortable he decided to leave the apartment.\n\nAs he reached the door he heard the shot.\n\nAfter Alix's death Hendren is said to have headbutted the rear window of his police SUV with such force that it shattered.\n\nThat, police say, is why his booking photo shows him with a black eye.", "description": "Nathaniel Hendren, right, has pleaded not guilty to first-degree manslaughter and armed criminal action following the January shooting death of Katlyn Alix, right.", "authors": ["Lauren Fruen For Dailymail.Com", "Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/23/19561644-0-image-a-28_1570745158703.jpg", "published_at": "2019-10-10"}