{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/28/redskins-now-open-idea-trading-trent-williams-asking-price-believed-be-high", "downloaded_at": "2019-10-29 00:19:43.240298+00:00", "title": "Redskins are now open to trading Trent Williams, but asking price is believed to be high", "language": "en", "text": "Multiple people familiar with the views of the Redskins’ front office said a trade of Williams, a former Pro Bowl selection, could happen. One member of the organization said such a deal is “always possible” but also expressed surprise that speculation about a Williams trade resurfaced Monday. NFL Network first reported that the Redskins were open to the possibility of trading Williams.\n\nAD\n\nA person who has dealings with the Redskins’ front office said the team is open to making “a blockbuster deal” involving Williams if an enticing trde offer comes along. But the person, speaking on the condition of anonymity because of the confidential nature of trade talks, expressed skepticism that any team will make an offer that is substantial enough for the Redskins to act.\n\nAD\n\n“No one will do it,” the person predicted.\n\nIt was not clear what the Redskins would deem a suitable offer for Williams. The Cleveland Browns and New England Patriots have been among the teams linked to Williams in trade speculation. The Patriots are 8-0 as they seek a seventh Super Bowl title with Bill Belichick as their coach and Tom Brady as their quarterback. The Browns, at 2-5, have been one of the NFL’s biggest disappointments but apparently remain a potential buyer as the trade deadline approaches at 4 p.m. Eastern time Tuesday.\n\nAD\n\nBefore Monday, the prevalent view around the league was that the Redskins would consider trading Williams during the upcoming offseason but would not do so during the season, even with their record at 1-7 and Williams steadfastly refusing to play for Washington. He did not participate in any offseason workouts or report to the team during training camp or once the regular season was underway, racking up fines and missing salary in the process.\n\nAD\n\nThe situation stemmed in part from the team’s medical staff misdiagnosing a growth on Williams’s scalp during the offseason. The medical issue gave Williams “a scare,” according to a person with knowledge of the situation, and Williams made the decision that he no longer wanted to play for the team. The Redskins’ strategy throughout the standoff had been to wait Williams out in the hopes that financial factors would drive him to return, but with the trade deadline approaching and Williams staying away for the season’s first eight games, the organization has changed its approach.\n\nWilliams isn’t the only Redskins player to be the subject of trade speculation, which isn’t surprising given that the team is in last place in the NFC East.\n\nAD\n\n“It’s interesting when all these reports come up and come out,” interim coach Bill Callahan said. “Some have credence, some don’t, and I look at the trade deadline in terms of our organization, whatever happens, happens. I’m not privy to anything of that nature at this juncture. … If I had something to report, I would. But to speculate, it wouldn’t be fair to anybody, fans, players.”\n\nAD\n\nOther Redskins veterans who fit the profile of potential trade candidates include Pro Bowl right guard Brandon Scherff, who is scheduled to be a free agent in the offseason after he and the team haven’t reached an agreement on a contract extension. Cornerback Josh Norman, who has struggled and has been limited by injuries, has also been mentioned in the trade deadline rumor mill. The 31-year-old’s five-year, $75 million contract — one of the NFL’s richest at his position — expires after the 2020 season. There is also outside linebacker Ryan Kerrigan, a pass rusher who has been one of the team’s cornerstones for several seasons and could be appealing for a contending team. His contract is up after next season.\n\nWhile players may not know until after 4 p.m. Tuesday, they said dealing with rumors and uncertainty is part of the job.\n\n“I’ve been around six years. I’ve been around guys who knew they were going to get traded,” wide receiver Paul Richardson Jr. said. “I’ve been around guys that asked for a trade, so they prepared themselves. Ultimately, we’ve got to come in ready to work. It’s more or less harder for guys who don’t expect it. … Those guys kind of have to prepare themselves for a new beginning.”\n\nAdd to list\n\nAD", "description": "Washington, which previously was unwilling to trade its star left tackle, probably would need to receive a \"blockbuster\" offer before Tuesday afternoon's trade deadline.", "authors": ["Mark Maske", "Sports Reporter Covering The Nfl", "Kareem Copeland", "Reporter Covering The Washington Redskins"], "top_image": "https://www.washingtonpost.com/resizer/-fUvWiJKUFB_1rc2vLbcM7rKmwc=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PCOLGZGLJ4I6RLIKBYA67OR4YE.jpg", "published_at": "2019-10-28"}