{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-cricket-test-nzl-eng/bairstow-left-out-of-england-test-squad-for-new-zealand-tour-idUKKBN1W81QP", "downloaded_at": "2019-09-23 17:35:58.528184+00:00", "title": "Bairstow left out of England test squad for New Zealand tour", "language": "en", "text": "LONDON (Reuters) - England wicketkeeper Jonny Bairstow has been left out of the squad for the two-test series in New Zealand but included in the Twenty20 squad for the tour that begins in November, the country’s cricket board (ECB) said on Monday.\n\nFILE PHOTO: Cricket - Ashes 2019 - Fifth Test - England v Australia - Kia Oval, London, Britain - September 14, 2019 England's Jonny Bairstow is caught out by Australia's Steve Smith Action Images via Reuters/Andrew Boyers/File Photo\n\nThe 29-year-old Bairstow scored 214 runs in this year’s drawn Ashes series, averaging just below 24 in the five tests, with only one half-century to his name in 10 innings.\n\nJos Buttler is expected to keep wicket while Ollie Pope, who last played a test in August 2018, is set for a back-up role.\n\nJason Roy, who struggled during the Ashes with 110 runs in eight innings, was not named in either squad, while all-rounder Ben Stokes, Buttler, Mark Wood, Jofra Archer, Liam Plunkett and Chris Woakes will sit out the T20 series.\n\nFour uncapped players — Dominic Sibley, Zak Crawley, Matthew Parkinson and Saqib Mahmood — have been called up to the test squad.\n\nSibley, who scored 1,324 runs in the County Championship for Warwickshire, is expected to compete for an opening spot, while 21-year-old Crawley has earned his place after scoring 820 runs.\n\nParkinson is set to be spinner Jack Leach’s understudy while Mahmood has been included as veteran fast bowler and England’s leading wicket taker James Anderson is still out of contention while he recovers from a calf injury.\n\n“James Anderson was unavailable for selection in the test squad as he continues his rehabilitation from a calf injury,” the ECB said in a statement.\n\n“The Lancashire seamer will work towards being available for the South Africa tour later this winter.”\n\nEoin Morgan, who led England to their maiden World Cup triumph with a win over New Zealand in July’s final, will return to take up the captaincy for the T20 matches as they step up their preparations for the World Cup in October next year.\n\nEngland begin the New Zealand tour with the first of five T20 matches to be played on Nov. 1, followed by two tests that begin on Nov. 21 and Nov. 29 respectively. The tests will not be a part of the ICC World Test Championship.\n\nEngland test squad: Rory Burns, Joe Denly, Dominic Sibley, Joe Root (captain), Jos Buttler, Zak Crawley, Ollie Pope, Ben Stokes, Chris Woakes, Saqib Mahmood, Matthew Parkinson, Jofra Archer, Stuart Broad, Sam Curran and Jack Leach\n\nEngland T20I squad: Eoin Morgan (captain), Jonny Bairstow, Tom Banton, Sam Billings, Pat Brown, Sam Curran, Tom Curran, Joe Denly, Lewis Gregory, Chris Jordan, Saqib Mahmood, Dawid Malan, Matt Parkinson, Adil Rashid, James Vince", "description": "England wicketkeeper Jonny Bairstow has been left out of the squad for the two-test series in New Zealand but included in the Twenty20 squad for the tour that begins in November, the country's cricket board (ECB) said on Monday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190923&t=2&i=1432990989&w=1200&r=LYNXMPEF8M1C4", "published_at": "2019-09-23"}