{"pub": "townhall", "url": "https://finance.townhall.com/columnists/danieljmitchell/2019/09/11/taxloving-bureaucrats-publish-whiny-paper-n2552928", "downloaded_at": "2019-09-12 07:17:13.966308+00:00", "title": "Tax-Loving Bureaucrats Publish Whiny Paper", "language": "en", "text": "A few years ago, I put together a basic primer on corporate taxation. Everything I wrote is still relevant, but I didn’t include much discussion about international topics.\n\nIn part, that’s because those issues are even more wonky and more boring than domestic issues such as depreciation. But that doesn’t mean they’re not important – especially when they involve tax competition. Here are some comments I made in March of last year.\n\nThe reason I’m posting this video about 18 months after the presentation is that the issue is heating up.\n\nThe tax-loving bureaucrats at the International Monetary Fund have published a report whining about the fact that businesses utilize low-tax jurisdictions when making decisions on where to move money and invest money.\n\nAccording to official statistics, Luxembourg, a country of 600,000 people, hosts as much foreign direct investment (FDI) as the United States and much more than China. Luxembourg’s $4 trillion in FDI comes out to $6.6 million a person. FDI of this size hardly reflects brick-and-mortar investments in the minuscule Luxembourg economy. …much of it is phantom in nature—investments that pass through empty corporate shells. These shells, also called special purpose entities, have no real business activities. Rather, they carry out holding activities, conduct intrafirm financing, or manage intangible assets—often to minimize multinationals’ global tax bill. …a few well-known tax havens host the vast majority of the world’s phantom FDI. Luxembourg and the Netherlands host nearly half. And when you add Hong Kong SAR, the British Virgin Islands, Bermuda, Singapore, the Cayman Islands, Switzerland, Ireland, and Mauritius to the list, these 10 economies host more than 85 percent of all phantom investments.\n\nThat’s a nice list of jurisdictions. My gut instinct, of course, is to say that high-tax nations should copy the pro-growth policies of places such as Bermuda, Singapore, the Cayman Islands, and Switzerland.\n\nThe IMF, however, thinks those are bad places and instead argues that harmonization would be a better approach.\n\n…how does this handful of tax havens attract so much phantom FDI? In some cases, it is a deliberate policy strategy to lure as much foreign investment as possible by offering lucrative benefits—such as very low or zero effective corporate tax rates. …This…erodes the tax bases in other economies. The global average corporate tax rate was cut from 40 percent in 1990 to about 25 percent in 2017, indicating a race to the bottom and pointing to a need for international coordination. …the IMF put forward various alternatives for a revised international tax architecture, ranging from minimum taxes to allocation of taxing rights to destination economies. No matter which road policymakers choose, one fact remains clear: international cooperation is the key to dealing with taxation in today’s globalized economic environment.\n\nHere’s a chart that accompanied the IMF report. The bureaucrats view this as proof of something bad\n\nI view it as prudent and responsible corporate behavior.\n\nAt the risk of oversimplifying what’s happening in the world of international business taxation, here are four simple points.\n\nIt’s better for prosperity if money stays in the private sector, so corporate tax avoidance should be applauded. Simply stated, politicians are likely to waste any funds they seize from businesses. Money in the private economy, by contrast, boosts growth. Multinational companies will naturally try to “push the envelope” and shift as much income as possible to low-tax jurisdictions. That’s sensible corporate behavior, reflecting obligation to shareholders, and should be applauded. Nations can address “profit shifting” by using rules on “transfer pricing,” so there’s no need for harmonized rules. If governments think companies are pushing too far, they can effectively disallow tax-motivated shifts of money. A terrible outcome would be a form of tax harmonization known as “global formula apportionment.” This wouldn’t be harmonizing rates, as the E.U. has always urged, but it would force companies to overstate income in high-tax nations.\n\nWhy does all this wonky stuff matter?\n\nAs I said in my presentation, we will suffer from “goldfish government” unless tax competition exiss to serve as a constraint on the tendency of politicians to over-tax and over-spend.\n\nP.S. Sadly, America’s Treasury Secretary is sympathetic to global harmonization of business taxation.", "description": "A few years ago, I put together a basic primer on .09/12/2019 3:17:13AM EST.", "authors": ["Daniel J. Mitchell", "Beth Baumann", "Alex Nitzberg"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/79/ed949d5d-2764-4f4a-be36-7096da5edacb.jpg", "published_at": "2019-09-11"}