{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/stocks/servicenow-cloud-stock-could-get-stuck-in-a-lingering-formation-15080479", "downloaded_at": "2019-09-07 02:17:46.943648+00:00", "title": "ServiceNow: Cloud Stock Could Get Stuck in a Lingering Formation", "language": "en", "text": "ServiceNow Inc. ( NOW ) is up 51% this year and the company made Jim Cramer's fantasy portfolio that he announced on his Mad Money program Thursday night. Let's pay a visit to the charts and indicators of NOW to see what parameters we need to focus on in the weeks ahead.\n\nIn the daily bar chart of NOW, below, we can see a basing pattern on the left side of the chart from October through January. A sharp gap to the upside starts the rally going up to a July peak. NOW corrected lower into August and it has moved mostly sideways into September.\n\nPrices are trading below the declining 50-day moving average line. The slower-to-react 200-day simple moving average line intersects around $240, which is not all that far below the market.\n\nThe daily On-Balance-Volume (OBV) line has declined from the middle of July telling us that sellers have turned to be more aggressive the past two months. The Moving Average Convergence Divergence (MACD) oscillator has turned up from a low in August but it is still below the zero line.\n\nIn the weekly bar chart of NOW, below, we can see both the tremendous rally over the past three years but some divergences that need to be considered. Prices, even with the recent pullback, are above the rising 40-week moving average line.\n\nTrading volume looks like it has diminished in recent months, which suggests diminished enthusiasm. The weekly OBV line shows improvement in March to May but then it weakens diverging from the price action and signaling more aggressive selling.\n\nThe MACD oscillator crossed to a take profits sell signal in July.\n\nIn this Point and Figure chart of NOW, below, we can see that the software has projected a bullish price objective of $318. A decline to $255.74 will start to weaken this chart. A trade up at $276.93 starts to improve the picture.\n\nBottom-line strategy: Bulls and bears are still figuring it out. We are likely to see a $255 to $277 trading range until further notice.", "description": "ServiceNow: Cloud Stock Could Get Stuck in a Lingering Formation...NOW", "authors": ["Bruce Kamich", "Servicenow", "Cloud Stock Could Get Stuck In A Lingering Formation", "Bulls", "Bears Are Still Figuring Now Out.", "Stocks Quotes In This Article", "James", "Rev Shark", "Doug Kass", "Kevin Curran"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/79e96391-a7d2-11e9-bc6a-47ddfd3b86e7.png", "published_at": "2019-09-06"}