{"pub": "euronews", "url": "https://euronews.com/2019/10/15/more-160-000-have-fled-northern-syria-turkish-offensive-continues-n1066196", "downloaded_at": "2019-10-15 11:24:14.328739+00:00", "title": "More than 160,000 have fled northern Syria as Turkish offensive continues", "language": "en", "text": "The Turkish military incursion into northeast Syria is compounding an already dire humanitarian situation and forcing tens of thousands of people from their homes, according to human rights monitors.\n\nAccording to U.N. Office for the Coordination of Humanitarian Affairs, at least 160,000 civilians have been displaced since the Turkish offensive began on Oct. 9.\n\nThe agency said they continue to receive additional reports of people on the move, so the actual number of displaced could be higher.\n\nThe Kurdish-led authority said Tuesday more than 275,000 people have been displaced, Reuters reported.\n\nRami Abdulrahman from the Syrian Observatory for Human Rights, which is based in London, told NBC News Tuesday that around 250,000 people have fled their homes in northeast Syria, in what he called a \"catastrophic civilian displacement.\"\n\nThe U.N. says to date, most displacements took place from the towns of Tel Abyad and Ras al Ayn in northeast Syria.\n\nNBC News observed intense fighting around Ras al Ayn on Tuesday, with shells landing around the town, as well as rounds of artillery and machine gun fire being heard across the border in Ceylanpınar, Turkey.\n\nThe U.N. said many of those affected by the ongoing hostilities have already experienced immense physical and mental stress as a result of almost nine years of Syria's bloody civil war and repeated displacement.\n\nFor the population along the Syrian-Turkish border who remain in the area, the situation is both dire and unsafe as hostilities continue and humanitarian partners have a limited capacity to respond, it added.\n\nThe U.N. has said an estimated 160,000 people have been displaced since the onset of the operation. Delil Souleiman\n\nPresident Donald Trump ordered American troops in northern Syria to step aside on Oct. 6, clearing the way for an attack by Turkey.\n\nTrump's move was decried at home and abroad as a betrayal of the Syrian Kurds, an important ally in the battle against ISIS.\n\nTurkey aims to neutralize the Kurdish YPG militia, the main element of Washington's Kurdish-led ally, the Syrian Democratic Forces (SDF). Ankara regards the YPG as a terrorist group aligned with Kurdish insurgents in Turkey.\n\nRussia-backed Syrian forces on Monday took rapid advantage of the abrupt U.S. retreat in Syria to deploy deep inside territory held by U.S.-backed Kurdish forces south of the Turkish frontier.\n\nOn Sunday, Washington announced plans for a full withdrawal of about 1,000 troops.\n\nTrump said Monday the U.S. troops coming out of Syria will now redeploy and remain in the region \"to monitor the situation.\" He also said \"a small footprint of U.S. forces\" will remain at At Tanf garrison in southern Syria \"to continue to disrupt remnants of ISIS.\"\n\nTrump also acknowledged that Turkey's invasion is \"precipitating a humanitarian crisis and setting conditions for possible war crimes.\"\n\n\"Unfortunately, Turkey does not appear to be mitigating the humanitarian effects of its invasion,\" he added.\n\nTrump has been steadfast about his decision to pull out, saying he aims to extract the United States from \"endless\" wars in the Middle East.\n\n\"Anyone who wants to assist Syria in protecting the Kurds is good with me, whether it is Russia, China, or Napoleon Bonaparte,\" Trump wrote on Twitter earlier on Monday. \"I hope they all do great, we are 7,000 miles away!\"\n\nThe fighting has also raised concerns that the Kurds would be unable to keep thousands of Islamic State fighters in jail and tens of thousands of their family members in camps.\n\nThe Kurdish-led Syrian Democratic Forces (SDF) and Syrian Observatory for Human Rights said Sunday that close to 800 members of a camp holding the families of ISIS fighters had escaped after Turkish shelling.\n\nNews\n\nThe Turkish Defense Ministry said Tuesday 595 militants had been \"neutralized\" since the operation began.\n\nTrump imposed sanctions on Turkey Monday, announcing plans to reimpose steel tariffs and immediately halt negotiations on a $100 billion trade deal.\n\nU.S. Defense Secretary Mark Esper said he would call on NATO allies to \"take collective and individual\" actions against Turkey when he meets defense chiefs in Brussels next week.\n\nTurkey told the U.N. Security Council Monday that its military offensive into northeast Syria was launched in exercise of its right to self-defense.\n\nIn a speech during a visit to Azerbaijan Monday, Erdogan made clear Turkey would not halt its offensive despite the widespread condemnation it has drawn.\n\n\"We are determined to continue the operation until the end, without paying attention to threats,\" Erdogan said during a speech in Baku. \"We will absolutely finish the job we started. Our battle will continue until ultimate victory is achieved.\"\n\nKeir Simmons reported from Ceylanpınar, Turkey. Yuliya Talmazan and Mo Abbas - from London.", "description": "One human rights observer called the flight from the region a \"catastrophic civilian displacement.\"", "authors": [], "top_image": "https://static.euronews.com/articles/4233702/1000x563_nbc-191015-syria-ras_al-ain-mc-10472_14cc478c03a3d49537d0e8e02cbbf965.jpg", "published_at": "2019-10-15"}