{"pub": "metro", "url": "https://metro.co.uk/2019/10/15/piers-morgan-slams-snivelling-david-walliams-liking-nastiest-tweets-10925380", "downloaded_at": "2019-10-15 23:10:56.588994+00:00", "title": "Piers Morgan slams David Walliams for 'liking nastiest tweets’ about him", "language": "en", "text": "It’s all kicking off between Piers and David\n\nPiers Morgan has criticised David Walliams for appearing to like the ‘nastiest tweets’ about him but apparently being overly friendly to his face.\n\nThe Good Morning Britain host shared a screenshot of a tweet from another user that criticises him, and shows David’s account had liked the post.\n\nThe tweet said: ‘Just a reminder that @piersmorgan released fake photos of torture in Iraq that endangered the lives of British soldiers, refused to apologise and rightfully got sacked.\n\n‘He’s also a big fan of phone hacking and still sees no wrong in this. So no, don’t #SavePiers, #F**kPiers.’\n\nPiers, 54, reshared the post and commented: ‘Amusing that ⁦@davidwalliams⁩ regularly ‘likes’ the nastiest tweets about me, yet is such a snivelling toady to my face.\n\n‘It’s not my fault ⁦@BGT⁩ ratings were so much higher when I was in your chair Dave!’\n\nAdvertisement\n\nAdvertisement\n\nDavid, 48, has not yet responded to Piers’ comments.\n\nIt comes after a petition was launched for Piers to be sacked from GMB after his comments about gender.\n\nSo far, more than 20,000 people have signed a Change.org petition calling for Piers to be removed from hosting the ITV breakfast show.\n\n‘Morgan dictates to his viewers that it’s acceptable to deny an LGBTQ+ person of their rights; it’s acceptable to tell them they don’t exist; it’s acceptable to call them “snowflakes” when they get rightfully upset,’ the petition states.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\n‘These are the lessons Morgan teaches. ITV, as a major broadcasting corporation with a worldwide reach, are currently tarnishing a long-lasting legacy by using one of their highest-performing programmes as a vehicle to spread hate and intolerance.\n\n‘I understand that viewers are important, numbers mean business and high engagement suggests success, but are there really no other ways to achieve it?\n\n‘Despite Good Morning Britain’s current performance, to be conscious of a majority of their viewership being sexist, racist, transphobic, and generally unwilling to accept minorities or viewpoints aside from their own is repulsive, for lack of a better term.\n\nAdvertisement\n\nAdvertisement\n\n‘Wake up to the reality of Morgan’s behaviour. Hate crimes are on the rise, transphobia and discrimination over gender identity is becoming commonplace both upon social media and in the real world, and ITV continue to sit idly and let it play out in the name of entertainment. ‘It should be obvious by now that this has far surpassed an acceptable threshold, with Morgan’s rhetoric and actions sitting firmly in dangerous territory.’\n\nMetro.co.uk reached out to David’s reps but received no comment.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Good Morning Britain viewers vote for Piers Morgan to be fired as poll majorly backfires\n\nMORE: Piers Morgan hits back as Stan Collymore accuses Good Morning Britain of ‘institutional racism’", "description": "Piers Morgan has slammed David Walliams for allegedly liking 'nasty' tweets about him amid calls for the Good Morning Britain host to get sacked.", "authors": ["Alicia Adejobi"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_90028996_1571167399.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-15"}