{"pub": "theverge", "url": "https://theverge.com/2019/10/15/20913658/beats-solo-pro-noise-canceling-headphones-announced-features-specs-price", "downloaded_at": "2019-10-15 14:58:45.040720+00:00", "title": "Beats announces Solo Pro on-ear headphones with noise cancellation", "language": "en", "text": "Sorry to interrupt, Google, but Apple decided to announce a product at the exact time of your Pixel 4 event — and it’s a pretty significant one, at that. Beats is today introducing the Solo Pro, a $299.95 set of wireless headphones that add noise cancellation to the on-ear form factor shared by the company’s long line of previous Solo headphones. These are, for all intents and purposes, the Solo 4 Wireless, but they’ve been rebranded to match the Powerbeats Pro (and iPhone 11 Pro and every other tech product that now has “pro” tacked on to its name). The new headphones, Beats’ first on-ears with active noise cancellation, will ship on October 30th.\n\nBeats wireless headphones are ubiquitous and seemingly everywhere. The company claims its Solo lineup represents the most popular headphones in the world, with over 30 million sold. And the Solo Pros are now the flagship consumer model that the company hopes you’ll start seeing on city streets, on mass transit, at the gym, on the heads of celebrities, and anywhere else you usually spot the Beats logo. The company considers the Solo Pros to be part of a “next generation” of products led by the superb Powerbeats Pro from earlier this year.\n\nThe Solo Pros clearly take after the Solo 3s in appearance, but Beats says they were essentially redesigned from scratch. Some changes are obvious: the metal sliders are now exposed and part of the aesthetic so your hands aren’t always touching plastic. Beats is confident the aluminum sliders won’t move accidentally and will maintain the necessary tension for a good seal and optimal noise cancellation.\n\nThere’s no power button, as the Solo Pros automatically power on when unfolded and power down when folded and stowed in their case. Also, they only come in a matte finish; the glossy, cheap-looking options are gone. Color choices include black, ivory, gray, dark blue, light blue, and red. (The latter three are a limited edition run in partnership with Pharrell Williams.)\n\nThe synthetic leather ear cushions have been redesigned “after extensive testing with users” for a soft, comfortable, and secure fit on as many ears as possible. There’s no more inner seam, and Beats increased their surface area by 70 percent — even though you’d be hard pressed to tell by looking at them. Beats also paid close attention to the clamping force, allowing the Pros to be worn for hours without causing any head pain. That’s the hope, anyway.\n\nBeats has also made a conscious effort to make the Solo Pros more sweat resistant. Solos were never pitched as workout headphones, but they’ve become popular gym companions regardless. It’s good to see Beats embrace this. The headphones are also pretty rugged; I saw them get twisted and contorted, but they didn’t break or come away with any damage.\n\nNoise cancellation is activated with the press of a circular button at the bottom of the left ear cup, right where the 3.5mm line out used to be on previous Beats headphones. That’s completely gone now. So if you want to use these headphones over a wired connection for higher-fidelity audio, you’ll need to buy an adapter that plugs into the Lightning port. Not ideal. Beats has not been spared from Apple’s phasing out of the headphone jack.\n\nBeats has brought its “Pure ANC” adaptive noise cancellation technology from the Studio 3 Wireless headphones over to the Solo Pros. But since the Studios have an over-ear design, the company had to make some adjustments to tuning and its noise cancellation algorithms.\n\nPure ANC efficiently detects and blocks ambient noise — not only on an airplane, but also in a noisy café or a busy office. Pure ANC also evaluates fit and adjusts for leakage caused by hair, earrings, different ear shapes, and movement of your head as you go about the day. Additionally, it simultaneously checks what you’re hearing while noise canceling is applied against the original music content to ensure impressive audio fidelity.\n\nAccording to Beats, the Solo Pros take an audio snapshot of the acoustics of your environment and attempt to cancel out frequencies of common disturbances. Internal mics automatically adapt the effect if you’re wearing glasses, earrings, or something else that might impact the fit of the headphones against your ears — even if that’s just your hair. And then the headphones compare the noise-canceled waveform against the original file to optimize sound quality and make sure NC isn’t introducing unwanted audio artifacts. This processing is possible because of Apple’s H1 chip, which also allows for hands-free “Hey Siri” voice commands and instant pairing with Apple devices. Another thing worth noting: the Beats Pro support the audio sharing feature introduced in iOS 13.1, letting you listen to the same music or movie / TV show as someone else wearing AirPods or the other Beats headphones that offer this feature.\n\nUnlike other headphone makers, including Bose and Microsoft, Beats doesn’t let you adjust the level of noise cancellation on these headphones. It’s either on or off. When ANC is enabled, the Solo Pros can hit up to 22 hours of battery life (on both iOS and Android). If you’re somewhere quiet and don’t need the noise-canceling feature, they can run for up to 40 hours on a charge. Unfortunately, the Solo Pro headphones still charge over Lightning instead of USB-C. But you know what? Anything’s better than Micro USB. They still have the Fast Fuel feature, which provides three hours of battery life on a 10-minute charge.\n\nSince noise cancellation can be isolating, Beats also built a transparency mode into the Solo Pros. With another tap of that bottom button, you can hear your surroundings piped into the headphones clearly — and the company has tried to make that audio sound as natural as possible. These ambient modes can sometimes come off as tinny or overly processed, but Beats wants it to sound like you’re not even wearing headphones when transparency mode is activated. (Bose had similar ambitions with its Noise Canceling Headphones 700.)\n\nAs for how they sound, Beats says the Solo Pros “build upon Solo 3 Wireless’ award-winning sound profile with an evolved acoustic platform to drive improved performance.” They still have 40-millimeter drivers, but the company has reengineered them for “exceptional frequency response with lower total harmonic distortion.” I came away satisfied after a brief time testing them. Our review of the Solo 3s described Beats’ modern sound signature as “more grown-up, restrained, and more tasteful now” — and that remains true of the Solo Pros. They’re a little warmer and more refined than their predecessors as well.\n\nBeats also says the two beam-forming microphones, which work in tandem with a speech-detecting accelerometer, result in excellent voice call quality, which has been another focus of competitors recently.\n\nAre these new Beats headphones worthy of the “Pro” moniker just for adding noise cancellation and an improved build quality to the Solo 3 Wireless formula? Who knows. Maybe. Naming aside, I think those improvements — plus subtle improvements to fit and sound quality — will be enough to make them a hit. Pretty soon, these might be the new headphones you start seeing just about everywhere.\n\nPhotography by Chris Welch / The Verge", "description": "Beats is introducing the $300 Solo Pro headphones, which add noise cancellation to the on-ear form factor shared by the company’s long line of previous Solo headphones.", "authors": ["Chris Welch", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/BWu5Dt388xJyYldBeT03gcM8E-0=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19285431/cwelch_191001_3705_0004.jpg", "published_at": "2019-10-15"}