{"pub": "bbc", "url": "https://bbc.com/news/world-us-canada-49831516", "downloaded_at": "2019-09-25 23:27:29.160199+00:00", "title": "Trump impeachment inquiry: Dissecting the phone call behind it", "language": "en", "text": "Image copyright Getty Images\n\nDetails of a controversial phone call at the centre of the push by Democrats to consider impeaching President Donald Trump have been released. What have we learnt?\n\nA rough transcript of the conversation between the US president and the Ukrainian president in July has just been made public.\n\nIt has been seized on by his critics as evidence that Mr Trump sought foreign help to dig dirt on his potential 2020 rival, Joe Biden. But Republicans say it reveals nothing untoward.\n\nHere are the key passages broken down.\n\n1. The three Biden mentions\n\nOne-line takeaway: This is confirmation that Mr Trump pressed Ukraine to look into Biden.\n\nFull version: The media reported that Donald Trump asked Ukrainian President Volodymyr Zelensky to investigate Joe Biden and his son Hunter in their July phone conversation.\n\nThen Mr Trump confirmed it - more or less.\n\nNow here it is, in black and white - complete with presidential editorialising about how Mr Biden's actions \"sound horrible\". \"There's a lot of talk\" is also a classic Trump verbal construction when he wants to imply nefarious deeds but avoid making a direct accusation.\n\n(Mr Biden did in fact brag about getting the Ukrainian chief prosecutor fired, but no evidence has come to light that he ever tied it to the investigation, let alone any prosecution, of the Ukrainian oil company that employed his son.)\n\nMr Trump refers the Ukrainian president to US Attorney General Bill Barr - although the US Justice Department has said that Mr Barr was never brought into the loop.\n\nThe president even considering such a request is highly irregular, however, given that it might indicate Mr Trump was trying to encourage his Justice Department to initiate a criminal investigation into Mr Biden or his son. What's more, it was the Justice Department that made the decision to withhold the original whistleblower memo from Congress.\n\n2. No quid pro quo but...\n\nOne-line takeaway: Trump asks for a favour but any quid pro quo is suggested not explicit.\n\nFull version: To fully understand the implications of Mr Trump's Biden request, scroll back in the transcript a few paragraphs to this exchange.\n\nAfter some diplomatic niceties, Mr Zelensky thanks Mr Trump for his \"great support in the area of defence\". A week or so before this conversation, the US put a hold on the $250m in military aid Congress had authorised for Ukraine - reportedly at the behest of Mr Trump and without any clear explanation offered.\n\nMr Zelensky goes on to talk about the Javelins (US-made anti-tank missile) Ukraine plans to buy, presumably with the suspended funds.\n\nAs soon as Mr Zelensky finishes, Mr Trump counters with a \"favour\" he would like Ukraine to do. Initially he mentions a cyber-security firm and a missing server - perhaps a reference to conservative conspiracy theories that Russia was not really behind the 2016 election cyberattacks (despite the conclusions of the US intelligence community and the Mueller investigation).\n\nFrom there, Mr Trump turned to talk about the Bidens.\n\nPrior to this transcript's release there was considerable speculation about whether there would be an explicit \"quid-pro-quo\", where Mr Trump conditioned the release of US military aid on Ukraine's willingness to investigate one of the president's top political rivals.\n\nThere's no direct presidential request here, but Democrats calling for Mr Trump's impeachment could point to this passage and say it's not too difficult to connect the dots.\n\n3. European countries need to cough up\n\nOne-line takeaway: This helps Trump's defence. Republicans will point to this section as the real reason why he held back aid.\n\nFull version: Mr Trump's first explanation for why he suspended hundreds of millions of dollars in military aid to Ukraine was because he was concerned about the former Soviet nation's track record of corruption. By Tuesday, however, the president was citing a different reason - that he believed the US was contributing too much to Ukraine and wanted to pressure European nations to do more.\n\nThe White House and Republicans in Congress will point to this passage, early in the phone call, as evidence to support this claim.\n\nMr Trump certainly has a long history of highlighting and criticising what he sees as the comparatively large burden the US carries in terms of military and economic aid compared to its allies, so his explanation is not implausible.\n\nThe question, however, is whether in this case it is more plausible than another explanation - that Mr Trump was using this phone call not to pursue a legitimate foreign policy goal, but to advance a personal political one.\n\nIt's a point Democrats and Republicans are sure to argue over - and one for which the American people will ultimately be the judge.\n\n4. Trump backs Ukraine prosecutor\n\nOne-line takeaway: This Ukrainian prosecutor was fired amid criticism that he was ineffective but Trump says here that he was treated badly.\n\nFull version: The prosecutor in question is Viktor Shokin, who was dismissed by the Ukrainian parliament in 2016. Mr Biden, along with other US officials, European allies and reform-minded Ukranians, viewed Shokin as corrupt and celebrated his removal.\n\nIn Mr Trump's opinion, however, Shokin was a victim, and later in the conversation he said he was \"treated very badly and was a very fair prosecutor\". He follows this up by directing Mr Zelensky to Mr Guiliani - his unpaid personal defence lawyer and former mayor of New York City.\n\nA Tuesday article in the Washington Post detailed the friction Mr Trump's reliance on Mr Giuliani to handle his Ukrainian contacts created within the administration's foreign policy officials. One unnamed aide said the current controversy was a direct result of Mr Giuliani \"injecting himself into the process\".\n\nMr Giuliani has countered that all his contacts with Ukraine were at the behest of the US State Department - an assertion congressional investigators might be interested in learning more about.\n\n5. Flattery from the Ukraine leader\n\nOne-line takeaway: Zelensky is not the first foreign leader to employ flattery in dealing with the US president.\n\nFull version: Setting aside the most controversial portions of the 30-minute exchange, the phone conversation between the two presidents offers another example of the strategy many foreign leaders have chosen to employ in their interactions with Mr Trump.\n\nFlattery, they seem to think, will get them everywhere.\n\nMr Zelensky cites Mr Trump's \"skills and knowledge\" with helping him craft his winning political campaign. He later echoes Mr Trump's rhetoric, saying that his goal is to \"drain the swamp\" in his own country.\n\nToward the end of the conversation, Mr Zelensky notes that the last time he was in New York City, he stayed at the Trump Tower. Frequenting a Trump-owned property has become a fairly common way for foreign officials to curry favour with the president - although the Trump Organisation says it donates all income from such visits to the US. For 2018, for instance, it cut a cheque to the Treasury for $191,538.\n\nThe president's critics have said he is profiting from foreign business in violation of the US Constitution. Mr Trump's conversation with Mr Zelinsky will be one more example they may cite in their public complaints - and legal filings.\n\nMore on this story:", "description": "The BBC's Anthony Zurcher analyses key parts of the transcript of Trump's call with Ukraine president.", "authors": ["Anthony Zurcher", "North America Reporter"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/10276/production/_108966166_trump2_phone976getty.jpg", "published_at": "2019-09-25"}