{"pub": "cbc", "url": "https://cbc.ca/news/canada/ottawa/arrest-abdi-return-hilda-street-judge-dismissed-1.5290411", "downloaded_at": "2019-09-20 23:00:26.728665+00:00", "title": "Judge quashes request to have court visit Abdi arrest scene | CBC News", "language": "en", "text": "A judge has refused the Crown's unusual request to bring Const. Daniel Montsion, his lawyers, and the rest of court to the scene of Abdirahman Abdi's fatal 2016 arrest, claiming it would not be in the \"interests of justice.\"\n\nThe Crown had asked Justice Robert Kelly to consider visiting 55 Hilda St., where Abdi lived with his family before he lost vital signs on the cobblestones out front on July 24, 2016.\n\nMontsion has pleaded not guilty to manslaughter, aggravated assault and assault with a weapon in Abdi's death.\n\nI am not satisfied that taking a view is in the interests of justice. - Justice Robert Kelly\n\nThe Crown lawyers hoped taking the court to the building where Abdi was arrested would give the judge a better appreciation of the \"spatial details\" of the entryway where he was repeatedly punched in the head by Montsion, as well as the available escape routes and the sight lines of some of the witnesses who have already testified.\n\nBut in a ruling Friday, Kelly said he could evaluate those issues based on the evidence already presented.\n\n\"I am not satisfied that taking a view is in the interests of justice,\" he wrote in his ruling.\n\nJustice Robert Kelly ruled that visiting 55 Hilda St., where Abdirahman Abdi died during a violent arrest in 2016, would only provide limited benefit. (Google Maps )\n\nMinimal benefit\n\nSuch a visit is \"very rare,\" Kelly said earlier in the proceedings. Montsion's defence lawyer Michael Edelson told the court he's only been to one in 40 years as a lawyer.\n\nThe officer's lawyers took no position on the Crown's application.\n\nIn his ruling, Kelly said the benefit in this case would be minimal — not enough to justify the visit.\n\n\"It it were, views would be routinely available. But they are not,\" he wrote.\n\nKelly also appeared concerned about the security logistics of such a visit, though both the Crown and Montsion's defence lawyers had consulted with Ottawa police about the undertaking.\n\nWith enough resources, Kelly said security concerns could be addressed, but that there was a context in this case — added security measures needed early in the trial — he could not ignore.\n\nThose measures were installed outside the courtroom after a pair of men hurled insults like \"murderer\" at Montsion and racist slurs at his lawyers.\n\nThe trial is expected to resume on Monday.", "description": "Justice Robert Kelly refused the Crown's unusual request to bring Const. Daniel Montsion, his lawyers, and the rest of court staff to the scene of Abdirahman Abdi's fatal 2016 arrest, claiming it would not be in the 'interests of justice.'", "authors": [], "top_image": "https://i.cbc.ca/1.5002240.1549041328!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/abdirahman-abdi-and-const-daniel-montsion.jpg", "published_at": "2019-09-20"}