{"pub": "atlantic", "url": "https://theatlantic.com/health/archive/2019/09/millions-american-homes-have-lead-water/597826", "downloaded_at": "2019-09-12 07:07:33.452664+00:00", "title": "The Trouble With America’s Water", "language": "en", "text": "Newark is far from the only city that has struggled to keep its drinking water free from lead. Drinking water in the United States is mostly safe, but between 2015 and 2018, about 5.5 million Americans in communities around the nation got their water from systems that exceeded the Environmental Protection Agency’s lead action level of 15 parts per billion, according to a report from the Natural Resources Defense Council. The widespread presence of lead in water in certain areas points to what advocates call a serious failure to upgrade water infrastructure in recent decades.\n\n“The U.S. has not been investing in its drinking-water infrastructure for generations,” says Erik Olson, the senior director for health programs at NRDC, which filed a lawsuit against Newark last year. “A lot of our pipes are 50 or 100 years old or more, and many are lead. And water-treatment plants are still using World War I–era technology for treatment.”\n\nFew substances threaten public health quite like lead. In adults, lead can cause heart and kidney disease; in children, it can permanently lower IQ and lead to behavioral problems. Lead’s damage to the body is difficult to reverse and can last a lifetime. When researchers examined fertility before and after Flint’s lead crisis, they found what they called a “horrifyingly large” increase in fetal deaths and miscarriages. Some experts say the federal action level for lead, the point at which the local water department must take measures to fix the problem, is still too high. For one thing, the 15-parts-per-billion threshold is based on the metabolism of an adult, says Ruth Ann Norton, a lead expert and president of the Green and Healthy Homes Initiative in Baltimore.\n\nThe problem starts with the roughly 50,000 fragmented community public-water systems in the U.S., Olson says, many of which don’t have the resources or expertise to comply with public-health standards. Perhaps most startlingly, the NRDC found that 97 percent of Puerto Rico is served by systems that violate the federal Lead and Copper Rule, mostly by failing to monitor and report on their water quality. Other than Newark, other cities with large populations that have had “action-level exceedances”—lead amounts beyond the EPA’s action level—include Portland, Oregon; Pittsburgh, Pennsylvania; Providence, Rhode Island; Passaic, New Jersey; and the Tualatin Valley in Oregon. Some areas that don’t have major lead problems still struggle with water contaminants like arsenic and bacteria, Olson says.\n\nLead’s toxicity has been known for centuries, but lead remained a popular choice for water service lines installed up to the 1980s. It’s more flexible and durable than iron. About 6 million lead service lines are still in use today, connecting households to water mains. Prior to 1986, copper pipes inside a person’s home could also be joined with lead solder.", "description": "Lead-tainted drinking water is not only a problem in Flint and Newark.", "authors": ["Olga Khazan"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/RTR24OZQ/facebook.jpg?1568170159", "published_at": "2019-09-11"}