{"pub": "fox", "url": "https://foxnews.com/media/jane-skinner-on-shep", "downloaded_at": "2019-09-18 05:10:24.957296+00:00", "title": "Jane Skinner discusses new NFL documentary about 'the Fab Four of Football'", "language": "en", "text": "Former Fox News anchor Jane Skinner Goodell joined Shepard Smith on Tuesday to discuss her new movie, \"A Lifetime of Football\" -- a documentary about four female NFL owners known as 'the Fab Four of Football.'\n\nGoodell, who is married to the current commissioner of the National Football League, Roger Goodell, said she was inspired to make the movie about four owners -- Virginia Halas McCaskey of the Chicago Bears, Martha Ford of the Detroit Lions, Patricia Rooney of the Pittsburgh Steelers and Norma Hunt of the Kansas City Chiefs -- two years ago while discussing potential celebrations to mark the 100th anniversary of the league.\n\n\"They tell the most incredible stories about the league,\" Goodell said of the women, who are now all in their eighties and nineties.\n\n\"Some of them have been there for 50 or 60 years. Virginia McCaskey is 96 years old. Her father is George Halas, who was one of the founders of the league so her first memory of the NFL is from when she was four years old... 1927, she remembers her first game. She was about four and a half.\n\nPITTSBURGH STEELERS' BEN ROETHLISBERGER ON SEASON-ENDING INJURY: 'I CAN ONLY TRUST GOD'S PLAN'\n\nThe stories prompted Goodell to ask: \"is anybody recording this for history's sake.\"\n\n\"Nobody was,\" she said.\n\nThe movie, which was shot by NFL Films, begins with a panel discussion with the four matriarchs of the football families and interweaves interviews with prominent figures and coaches in the NFL as well as archival footage from the league to encapsulate the origin and history of American football.\n\n\"It's a great movie to watch with your kids, your grandparents because isn't that how we all kind of share football anyways?\" Skinner said.\n\nSkinner, who used to host a segment on Smith's show on Fox News called \"Skinnerville,\" said the hardest part of co-executive producing the film was getting the women to speak on camera.\n\n\"The women themselves, are you know, I like to say kind of from the generation of \"we\" and we're living in this generation of \"me\" where you're supposed to talk about yourself and enjoy the spotlight and post a selfie,\" Skinner said. \"They didn't want to talk about it. They would be fine telling those stories privately but they didn't want to tell them publically.\"\n\nAfter a year of convincing, Skinner says she finally helped them realize, \"there's an audience for that and I think they had to recognize that their stories really had value and that people were going to enjoy it so much.\"\n\nCLICK HERE FOR THE FOX NEWS APP\n\n\"'A Lifetime of Sundays' is a special film that shines a light on four remarkable women who have had an enormous impact on the NFL, yet remain relatively unknown to many fans,\" Connor Schell, executive vice president of content at ESPN said in a press release. \"We are thrilled to share their story as an important part of the NFL's 100 years.\"", "description": "Former Fox News anchor Jane Skinner Goodell joined Shepard Smith on Tuesday to discuss her new movie, \"A Lifetime of Football,\" a documentary about four female NFL owners known as 'the Fab Four of Football.'", "authors": ["Vandana Rambaran", "Vandana Rambaran Is A Reporter Covering News", "Politics At Foxnews.Com. She Can Be Found On Twitter"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/17/694940094001_6087183359001_6087181078001-vs.jpg", "published_at": "2019-09-17"}