{"pub": "foxnews", "url": "https://foxnews.com/entertainment/billie-lourd-to-play-late-grandmother-debbie-reynolds-grandkid-on-will-grace", "downloaded_at": "2019-09-20 02:27:41.685862+00:00", "title": "Billie Lourd to play late grandmother Debbie Reynolds' grandchild on 'Will & Grace'", "language": "en", "text": "Billie Lourd is paying tribute to her late grandmother Debbie Reynolds in the sweetest way.\n\nOn Thursday, it was revealed that the 27-year-old Lourd will guest-star on the upcoming, final season of \"Will & Grace.\"\n\nAccording to Deadline, Lourd will play Fiona Adler, the niece of Grace Adler (played by Debra Messing) and the daughter of Grace's sister (played by Mary McCormack). In the original series, Reynolds' portrayed Grace's mom, Bobbi Adler.\n\nBILLIE LOURD AND LATE MOM CARRIE FISHER WILL REUNITE IN 'RISE OF SKYWALKER'\n\n“The episode is especially meaningful because of Billie’s relationship to the show,” the show's co-creator and executive producer, Max Mutchnick, told the outlet. “We’re thrilled to have Billie. And best of all — she’s really good.”\n\nReynolds played Bobbi Adler in 11 episodes from 1999 to 2006 and earned an Emmy nomination for Outstanding Guest Actress in a Comedy Series in 2000\n\nDEBBIE REYNOLDS HAD A PREMONITION OF CARRIE FISHER'S DEATH, CLAIMS PAL\n\nBack in May, it was revealed that Lourd will share the big screen with her late mother, \"Star Wars\" actress Carrie Fisher, in the film franchise's forthcoming final installment.\n\nCLICK HERE FOR THE FOX NEWS APP\n\n\"Star Wars: The Rise of Skywalker\" is using extra footage of Fisher from when she filmed her role in 2015's \"The Force Awakens.\" Director J.J. Abrams told Variety that he initially wrote Lourd out of the scenes, but she insisted on being in them.\n\nFisher, who portrayed Princess Leia, died at the age of 60 on Dec. 27, 2016, four days after she suffered a massive heart attack on a flight from London to Los Angeles. Reynolds died after suffering a stroke the very next day. She was 84", "description": "Billie Lourd is paying tribute to her late grandmother Debbie Reynolds' in the sweetest way.", "authors": ["Mariah Haas"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Debbie-Reynolds-and-Billie-Lourd.jpg", "published_at": "2019-09-20"}