{"pub": "foxnews", "url": "https://foxnews.com/media/joe-biden-describes-his-first-day-as-president-and-climate-actions-part-of-it", "downloaded_at": "2019-09-05 02:12:17.335123+00:00", "title": "Joe Biden describes his first day as president, and climate action's part of it", "language": "en", "published_at": "2019-09-05", "text": "Former Vice President Joe Biden on Wednesday described what he'd do on his first day as president, as part of CNN's marathon town hall on climate change town.\n\nBiden slammed President Trump for pulling out of the Obama-era Paris climate accord, saying he's \"dead wrong on basically everything across the board.\"\n\n\"We've got to start choosing science over fantasy here,\" Biden said. \"The fact of the matter is that what he did by removing the United States as the leader of the Paris climate accord -- he, in fact, dissipated enthusiasm across the board.\"\n\nKAMALA HARRIS SAYS SHE SUPPORTS PLASTIC STRAW BAN DURING CNN CLIMATE CHANGE MARATHON\n\nThe 2020 Democratic frontrunner vowed that if he'd been president during the recently held G-7 global summit, \"there would be no empty chair\" at the climate change table, in contrast to the one left by Trump.\n\n\"Folks, this is such an urgent problem,\" Biden continued. \"The first thing I would do as president of the United States is to call a meeting of all the nations who signed on to the accord in Washington, D.C., to up the ante. Because we have learned so much just in the past three years of the science, of what has to happen quicker. And the world knows it.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nBiden was one of 10 Dems who participated in a marathon of town hall-style sessions focused squarely on the \"climate crisis.\"", "description": "Former Vice President Joe Biden revealed what he plans to do on his first day in office if he's elected president on Wednesday night during CNN's climate change marathon.", "authors": ["Joseph Wulfsohn", "Joseph A. Wulfsohn Is A Media Reporter For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/joe-biden-1-AP.jpg"}