{"pub": "news.com.au", "url": "https://news.com.au/national/victoria/news/students-at-st-kevins-college-suspended-for-recording-rap-song-about-sister-school/news-story/bc55db71f10e6b32a0e40c854764f742", "downloaded_at": "2019-10-25 15:58:37.967037+00:00", "title": "St Kevin’s College students suspended for rap song about sister school", "language": "en", "text": "Students from St Kevin's College were last year disciplined for an offensive rap targeting girls from sister school Sacre Coeur.\n\nDays after the furore over young men from a prestigious Melbourne private school reciting a vile chant on a tram, audio has emerged of other students from the same school performing a disgusting, misogynistic rap.\n\nNews.com.au has exclusively obtained footage from a smartphone recording featuring former St Kevin’s College students attacking girls from sister college Sacre Coeur in Glen Iris.\n\nThe students were reportedly suspended for their role in producing and sharing the recording on Soundcloud.\n\nSome of the lyrics include:\n\nSingle life is the only way\n\nF***ing b*tches like (inaudable)\n\nF*** Sacre Coeur\n\nBunch of fake b*tches\n\nCan’t take 10 inches\n\nI got a new b*tch, heads up\n\nThat’s me, only 17\n\nBeen f***ing your b*tch since 13.\n\nA school source, who did not wish to be named, told news.com.au the song was “one of the most disgusting things I have ever heard”.\n\nHe said it “targeted specific girls at Sacre Coeur” and that, when it came to the attention of staff at both schools, the students “were not forced to apologise or anything”.\n\n“When it was reported, other St Kevin’s students talked to (the girls in the song) and pressured them into downplaying the impact on them,” the source said.\n\nA former Sacre Coeur student told news.com.au she remembers the video and “it was bad”.\n\nA spokeswoman for the Toorak school this morning told news.com.au: “We won’t be commenting on student matters.”\n\nIt follows the release of two videos featuring St Kevin’s students chanting lyrics to a song that has been roundly condemned as “disgraceful” and “misogynistic”.\n\nThe first video was filmed on a packed Melbourne tram on Saturday.\n\nYear 10 and 11 students on their way to an inter-school sports carnival chanted the lyrics at the top of their lungs, despite the presence of women and young children.\n\nA second video emerged today of year 12 students chanting the same lyrics at a pub crawl on Monday night.\n\nHeadmaster Stephen Russell responded to the video with a strong message to parents and a public apology. He promised he “will not let this matter lie”.\n\nBut in a second letter to parents, sent to news.com.au, Mr Russell admitted the problem was far worse than he first suspected.\n\n“Sadly, we are aware that the use of misogynistic language such as in the chant on Saturday, is more widespread than we understood and this knowledge has intensified our determination to resolutely reshape our programs and to look to do so much more in this area,” Mr Russell wrote.\n\n“The size of our challenge has been clearly illustrated to me by my knowledge that some recent graduates foolishly and recklessly thought it would be amusing when they were celebrating to use this horrible chant.”\n\nFormer Year 12 student Luka Kiernan, 19, spoke out publicly about the “hypermasculine” culture at St Kevin’s that he says “pervades” every aspect of school life.\n\nBut after going public with his complaints — both to school staff and the media — he was attacked.\n\nMr Kiernan shared a copy of his defaced school portrait that hangs on the school’s High Achiever’s Board. Across his face was the word “traitor” and beneath was the word “snitch”.\n\n“I’ve received quite a lot of harassment,” he said.\n\n“When somebody breaks from the ruling class discipline like I’ve done, when somebody cuts against the grain, they are absolutely victimised because you’re not allowed to leave the ‘boys’ club’ and you’re certainly not allowed to criticise it publicly.”\n\nMr Kiernan told news.com.au the release of a second video “demonstrates how unseriously these students take allegations of sexism”.\n\n“It proves it’s not a minority of extreme sexists, it’s an ingrained culture that is adhered to by the majority of the school population.\n\n“It’s a dogmatic tribalism that’s pedalled by the school. It’s demanded that a key part of your identity is that you are part of the elite class.\n\n“Anyone that goes against that culture is disowned and torched. The people that participate (in sexist chanting) are the most privileged and elite men in Melbourne.\n\n“They know they can probably get away with it. The privilege gives them the confidence to do whatever they want to do.”\n\nNews.com.au reached out to a number of the students in the latest recording but did not received a response at the time of publication.\n\nrohan.smith1@news.com.au | @ro_smith", "description": "Days after the furore over young men from a prestigious Melbourne private school reciting a vile chant on a tram, audio has emerged of other students from the same school performing a disgusting, misogynistic rap.", "authors": ["Rohan Smith"], "top_image": "https://cdn.newsapi.com.au/image/v1/90b5d0384ac901c039af60f8dc066feb?width=650", "published_at": "2019-10-25"}