{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7577211/Sarah-Hyland-Wells-Adams-gush-sweet-posts-mark-second-anniversary.html", "downloaded_at": "2019-10-15 23:16:34.405834+00:00", "title": "Sarah Hyland and Wells Adams gush over each other in sweet posts to mark their second anniversary", "language": "en", "text": "They will soon have a wedding anniversary to celebrate, should all go to plan.\n\nBut for now Sarah Hyland and Wells Adams are busy celebrating their two year anniversary.\n\nThe Modern Family star wrote in a gushing Instagram post: 'If two years feels like a lifetime then I can't wait to spend my eternity with you.'\n\nTwo years strong: Sarah Hyland and Wells Adams celebrated their second anniversary on Tuesday, with sweet Instagram posts\n\nAccompanying two photos of the couple kissing at a concert, she shared with fans that she asked Wells to define the relationship.\n\n'Two years ago I asked when you were going to ask me to be your girlfriend,' she wrote. 'This summer you asked me to be your wife.'\n\nSarah, 28, went on to compliment her love, saying 'You're the calm to my storm. The sun to my moon. The Chandler to my Monica.\n\n'I can't wait to marry you @wellsadams Happy two years baby #ToPlutoAndBack,' she finished.\n\nI asked: Accompanying two photos of the couple kissing at a concert, she shared with fans that she asked Wells to define the relationship. 'Two years ago I asked when you were going to ask me to be your girlfriend,' she wrote. 'This summer you asked me to be your wife'\n\nIn the first photo the 35-year-old stands behind the actress with his arms wrapped around her, as she leans back to kiss him.\n\nThe second shows them both embracing in a kiss with a large crowd behind them.\n\nAnd the former reality TV show contestant didn't hold back either as he wrote about when he knew she was the one.\n\nLove at first sight: While Wells said he always knew He explained: 'I knew I was gonna marry her the 1st night I met her'\n\nHe explained: 'I knew I was gonna marry her the 1st night I met her.\n\n'But I guess how anniversary's work, it's when you decide to become boyfriend/girlfriend. Whatever, I lost that battle.'\n\nWells continued: 'You're my person and I can't wait to drop this day as our anniversary and make a new one with all our friends watching, while they judge our wedding and eat and drink for free... buncha deadbeats.'\n\nWaiting to wed: The couple got engaged back in May of this year and Sarah revealed she picked out the ring ahead of the proposal\n\n'Happy anniversary @sarahhyland, I love you more. +1 anything you say.'\n\nThe caption was alongside a photo of their lips almost touching, from their island engagement earlier this year.\n\nLast month the Wedding Year actress admitted she wasn't exactly surprised when fiance popped the question, since she had already picked out the ring.\n\nWhile on the Ellen show during guest host Dax Shepard's stint, when complimented about her ring she said 'Thanks, I told him what to get,' as the crowd started cheering for the Modern Family star.\n\nShepard then asked how their love story 'took root,' with Hyland explaining that, 'I saw him on The Bachelorette.'", "description": "Sarah Hyland and Wells Adams celebrated their two year anniversary on Tuesday. The Modern Family star said 'If two years feels like a lifetime then I can't wait to spend my eternity with you.'", "authors": ["Kellie Chudzinski For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/22/19760824-0-image-a-43_1571175408327.jpg", "published_at": "2019-10-15"}