{"pub": "yahoo", "url": "https://news.yahoo.com/turkey-bombards-syrian-kurdish-militia-065104500.html", "downloaded_at": "2019-10-11 06:58:29.484061+00:00", "title": "Turkey bombards Syrian Kurdish militia, thousands flee as death toll mounts", "language": "en", "text": "* Trump hopes to mediate between Turkey and the Kurds\n\n* Turkey says 277 militants killed, Kurds say they are resisting\n\n* Trump's fellow Republicans seek sanctions on Turkey\n\n* France calls for urgent meeting of anti-Islamic State coalition\n\nBy Daren Butler\n\nISTANBUL, Oct 11 (Reuters) - Turkish warplanes and artillery hit Kurdish militia targets in northeast Syria on the third day of an offensive that has killed hundreds of people, forced tens of thousands to flee and turned Washington's establishment against President Donald Trump.\n\nSince Trump pulled U.S. troops out of the way following a phone call with Turkish President Tayyip Erdogan, the incursion has opened a major new front in the eight-year-old Syrian civil war and drawn fierce criticism internationally.\n\n\"We have one of three choices: Send in thousands of troops and win Militarily, hit Turkey very hard Financially and with Sanctions, or mediate a deal between Turkey and the Kurds!\" Trump said in a Twitter post on Thursday.\n\n\"I hope we can mediate,\" Trump said when asked about the options by reporters at the White House.\n\nWithout elaborating, Trump said the United States was \"going to possibly do something very, very tough with respect to sanctions and other financial things\" against Turkey.\n\nOn Friday morning, Turkish jets and artillery struck around Syria's Ras al Ain, one of two border towns that have been the focus of the offensive. Gunfire could also be heard inside the town, said a Reuters journalist in Ceylanpinar, on the Turkish side of the border.\n\nHe said a convoy of 20 armoured vehicles carrying Syrian rebels entered Syria from Ceylanpinar on Friday. Some of them made victory signs, shouted \"Allahu akbar\" (God is greatest) and waved Syrian rebel flags as they advanced towards Ras al Ain.\n\nSome 120 km (75 miles) west, Turkish howitzers resumed shelling near the Syrian town of Tel Abyad, a witness said.\n\nTurkey's Defence Ministry said that in overnight operations the Turkish military and its Syrian rebel allies killed 49 Kurdish militants. It says it has killed 277 militants in total.\n\nThe ministry said one Turkish soldier was killed in a clash on Thursday during the offensive, which is targeting the Syrian Democratic Forces (SDF), led by the Kurdish YPG militia.\n\nKurds said they were resisting the assault. At least 23 fighters with the SDF and six fighters with a Turkish-backed Syrian rebel group had been killed, said the Syrian Observatory for Human Rights, which monitors the war.\n\nNATO member Turkey says the operation is necessary for border security against the YPG militia, which it designates a terrorist group because of ties to militants who have waged a decades-old insurgency in southeast Turkey in which more than 40,000 people have been killed.\n\nAnkara has also said it intends to create a \"safe zone\" for the return of millions of refugees to Syria.\n\n\n\n\n\nISLAMIC STATE CAPTIVES\n\nThe SDF have been the main allies of U.S. forces on the ground in the battle against Islamic State since 2014. They have been holding thousands of captured IS fighters in prisons and tens of thousands of their relatives in detention.\n\nFrench Foreign Minister Jean-Yves Le Drian called for an emergency meeting of the coalition of more than 30 countries created to fight Islamic State.\n\nSDF forces were still in control of all prisons with Islamic State captives, a senior U.S. State Department official said in a briefing with reporters on Thursday.\n\nThe United States has received a high-level commitment from Turkey on taking responsibility for Islamic State captives but had not yet had detailed discussions, the official said.\n\nU.S. lawmakers have said Trump gave Erdogan the green light to go into Syria but the official disputed that. \"We gave them a very clear red light, I've been involved in those red lights and I know the president did that on Sunday,\" the official said.\n\nThe SDF said Turkish air strikes and shelling had killed nine civilians. In apparent retaliation by Kurdish-led forces, six people including a 9-month-old baby were killed by mortar fire into Turkish towns, Turkish officials said.\n\nThe International Rescue Committee aid group said 64,000 people in Syria have fled since the campaign began. The towns of Ras al Ain and Darbasiya, some 60 km (37 miles) to the east, were largely deserted.", "description": "Turkish warplanes and artillery hit Kurdish militia targets in northeast Syria on the third day of an offensive that has killed hundreds of people, forced tens of thousands to flee and turned Washington's establishment against President Donald Trump.  Since Trump pulled U.S. troops out of the way", "authors": ["Daren Butler"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-11"}