{"pub": "news24", "url": "https://health24.com/Lifestyle/Ageing-well/News/could-blue-light-from-screens-make-you-old-before-your-time-20191024-2", "downloaded_at": "2019-10-24 14:07:12.003429+00:00", "title": "Could blue light from screens make you old before your time?", "language": "en", "text": "Could blue light from screens make you old before your time? While humans are increasingly being exposed to blue light through widespread use of LED lighting and electronic devices, what are the effects of it over a lifetime?\n\nDaily exposure to blue light from sources such as smartphones, computers and household fixtures could speed your ageing, even if it doesn't reach your eyes, research in animals suggests.\n\nBlue wavelengths produced by light-emitting diodes (LEDs) may damage cells in your brain as well as your retinas, according to the Oregon State University researchers.\n\nImpaired abilities\n\nTheir study of fruit flies found that the lives of those exposed to daily cycles of 12 hours in blue light and 12 hours in darkness were shorter than those of flies kept in total darkness or in light with blue wavelengths filtered out.\n\nThe flies exposed to blue light had damage to their retinal cells and brain neurons, and their ability to climb the walls of their enclosures – a common behaviour – was impaired.\n\nSome of the flies were mutants that don't develop eyes, but even those had brain damage and impaired movement when exposed to blue light. The researchers said this suggests that the flies didn't have to see the blue light to be harmed by it.\n\nThe study was published online in the journal Aging and Mechanisms of Disease.\n\n\"The fact that the light was accelerating ageing in the flies was very surprising to us at first,\" said study leader Jaga Giebultowicz, a professor of integrative biology.\n\n\"We'd measured expression of some genes in old flies, and found that stress-response, protective genes were expressed if flies were kept in light. We hypothesised that light was regulating those genes,\" she explained in a university news release.\n\nIncreasing exposure to blue light\n\nThen researchers wondered how the light was harming them.\n\n\"We looked at the spectrum of light,\" Giebultowicz said. \"It was very clear cut that although light without blue slightly shortened their lifespan, just blue light alone shortened their lifespan very dramatically.\"\n\nShe said humans are increasingly being exposed to blue light through widespread use of LED lighting and electronic devices, but the technology hasn't been around long enough to know its effects over a lifetime.\n\nResults of animal testing are sometimes different in humans.\n\nBut researchers noted that eyeglasses with amber lenses filter out the blue light and protect your retinas, and that phones, laptops and other devices can be set to block blue emissions.\n\nImage credit: iStock\n\n", "description": "While humans are increasingly being exposed to blue light through widespread use of LED lighting and electronic devices, what are the effects of it over a lifetime?", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9505/84b98b19e774495787d48bf67874e5b9.png", "published_at": "2019-10-24"}