{"pub": "abcnews", "url": "https://abcnews.go.com/US/start-here-turkey-begins-offensive-northern-syria-germany-synagogue/story?id=66159740", "downloaded_at": "2019-10-10 15:07:23.029587+00:00", "title": "'Start Here': Turkey begins offensive in northern Syria and Germany synagogue shooting", "language": "en", "text": "It's Thursday, Oct. 10, 2019. Let's start here.\n\nInterested in Start Here Morning Briefing ? Add Start Here Morning Briefing as an interest to stay up to date on the latest Start Here Morning Briefing news, video, and analysis from ABC News. Add Interest\n\n1. Turkey tees off\n\nTurkish President Recept Tayyip Erdogan announced Wednesday that a military offensive in northeastern Syria against Syrian-Kurdish fighters had begun, with a mission to \"prevent the creation of a terror corridor across our southern border.\"\n\nPresident Donald Trump said the U.S. does not support the move, days after the administration’s announcement that American troops would withdraw from the region, ceding control to the Turkish government.\n\n\"The United States does not endorse this attack and has made it clear to Turkey that this operation is a bad idea,\" Trump said in a statement.\n\nABC News Senior Foreign correspondent Ian Pannell joins “Start Here” from Erbil, Iraq with the latest.\n\n2. Synagogue shooting\n\nGerman authorities say an attacker killed two people as he fired shots near a synagogue in the eastern city of Halle Wednesday.\n\nThe assailant shot at the door of the synagogue but was not able to get in as dozens of people inside were observing the Jewish holy day of Yom Kippur.\n\nThe attack was livestreamed on the gaming site Twitch but was later removed.\n\nAmerican University professor Cynthia Miller-Idriss explains that “when we're talking about far-right terror, it's a global issue.”\n\nJens Schlueter/Getty Images\n\n3. Cooperation conundrum\n\nPresident Trump said Wednesday he would cooperate with House Democrats in their impeachment inquiry “if the rules are fair.”\n\nThe White House continues to attack the legitimacy of the probe, blocking witness testimony and documents.\n\nABC News Chief White House correspondent Jonathan Karl tells “Start Here” that “the next question here is going to be whether or not Democrats are going to fight the White House in the courts.”\n\n\"Start Here,\" ABC News' flagship podcast, offers a straightforward look at the day's top stories in 20 minutes. Listen for free every weekday on Apple Podcasts, Google Podcasts, iHeartRadio, Spotify, Stitcher, TuneIn or the ABC News app. Follow @StartHereABC on Twitter, Facebook and Instagram for exclusive content and show updates.\n\nElsewhere:\n\n'In U.S. military custody': The U.S. military has taken custody of two notorious British Islamic State fighters nicknamed \"The Beatles,\" who were responsible for the executions of western hostages.\n\n'The identity of the whistleblower is irrelevant': The lawyers representing the whistleblower whose complaint has plunged President Donald Trump into impeachment proceedings describe the person as a civil servant who has never worked for or advised any political candidate, campaign or party.\n\n'I’m going to keep doing what I’m doing': Sen. Elizabeth Warren said this week she will not stop rejecting PAC money or avoiding closed-door, high-dollar fundraisers beyond the Democratic primary and into the general election if she becomes the party’s nominee.\n\nFrom our friends at FiveThirtyEight:\n\nNathaniel Rakich looks at why, two weeks in, impeachment is becoming more popular.\n\nDoff your cap:\n\nIn Native American communities across the country, there's a common saying: When an Indigenous woman goes missing, she goes missing twice -- first her body vanishes and then her story.\n\nIn 2016, there were nearly 6,000 indigenous women reported missing. Yet, only 116 were logged in the National Missing Persons database, according to the Urban Indian Health Institute.\n\n\"Nightline\" spent two years reporting on the case of Ashley Loring, who was 20 years old when she disappeared from Montana's Blackfeet Nation in June 2017, and her family's desperate search for answers. Watch their story below.\n\nPart 1:\n\nPlay\n\nPart 2:\n\nPlay\n\nIf you have any information regarding Ashley's case, please contact the BIA at (833) 778-4758.", "description": "It's Thursday, Oct. 10, 2019. Here's what you need to know to start your day.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/turkey-airstrikes-syria-getty-aa-191009(2)_hpMain_16x9_992.jpg", "published_at": "2019-10-10"}