{"pub": "yahoo", "url": "https://ph.news.yahoo.com/asias-first-rugby-world-cup-kick-off-game-020124352.html", "downloaded_at": "2019-09-20 08:16:46.283339+00:00", "title": "Japan hosts Asia's first Rugby World Cup as game seeks new horizons", "language": "en", "text": "The whistle that will kick off the Rugby World Cup\n\nThe first Rugby World Cup to be staged in Asia kicks off Friday in Tokyo, as the game seeks to spread beyond its traditional European and southern hemisphere heartlands.\n\nThe battle for the Webb Ellis Cup promises to be one of the most open in history, with at least five or six teams capable of preventing favourites New Zealand from lifting it for an unprecedented third consecutive time.\n\nOrganisers hope stars of the game such as All Black Beauden Barrett, Ireland's Johnny Sexton or South Africa's Siya Kolisi will spark enthusiasm for the game in Japan and Asia more broadly.\n\n\"I'm hoping that this first World Cup in Asia... uplifts rugby in Asia and people start playing rugby,\" Kolisi said on Friday.\n\nThe early signs are good, with officials saying the tournament should be close to a complete sell-out and a staggering 15,000 fans turning out on a public holiday just to watch Wales train.\n\nNinety-six percent of tickets have been sold, World Rugby said on Friday, with organising committee CEO Akira Shimazu predicting \"a truly ground-breaking tournament\".\n\nThe global rugby showpiece will also serve as a tasty amuse-bouche for Japan as it prepares to host the Tokyo 2020 Summer Olympics.\n\nWorld Rugby Chairman Bill Beaumont said they had awarded the tournament to Japan in the hope it would be \"a powerful game-changer for sporting and social change in Asia, the world's most populous and youthful continent\".\n\nOfficials claim that a promotional drive has inspired 1.8 million new rugby participants since 2016, one million of those in Japan.\n\nBut there are also reasons to believe the game in Japan is in need of support, with declining gates for club rugby matches and the country's only Super Rugby franchise, the Tokyo-based Sunwolves, booted out of the competition for commercial and logistical reasons.\n\n- 'Mythical dawn of time' -\n\nMuch will depend on the success of the home team, which gets the tournament underway on Friday with what should be a routine win against Russia.\n\nJapan served up the biggest shock in World Cup history in 2015 when they beat the mighty Springboks 34-32 in a match dubbed the \"miracle of Brighton\" that has even inspired a movie.\n\nThis time, however, no one is taking the Brave Blossoms lightly and they will do well to achieve their goal of reaching their first ever quarter-final by getting out of a pool dominated by Ireland and Scotland.\n\nThe All Blacks remain the team to beat and their crunch encounter with South Africa on Saturday will go a long way to determining the outcome of Pool B -- and maybe the next home of the Webb Ellis Cup.\n\nIreland come into the competition as the world's number one side but often flatter to deceive when it comes to the World Cup and have never ventured beyond the quarter-finals.\n\nMuch rests on the shoulders of fly-half Sexton who at 34 is no longer in the first flush of youth and has suffered an alarming dip in form.\n\nEngland, coached by Eddie Jones -- who led Japan to that famous win over the Springboks -- will also fancy their chances but have been drawn in a tough Pool C alongside bitter Six Nations rivals France and the ever-dangerous Argentina.\n\nJones named a full-strength team for the opening match against Tonga, refusing to relax against the Pacific Islanders.\n\nThe other group sees Australia and Wales as the top teams and either one could trouble the business end of the competition.\n\nBut the gap between the traditional haves and have-nots of World Rugby has shrunk and more upsets are expected -- with Fiji in particular considered a dangerous dark horse.\n\nThe six-week festival of rugby will get underway with what Beaumont promised would be a \"spectacular\" opening ceremony with seats ranging from 50,000 to 15,000 yen ($450 to $150).\n\nThe ceremony will feature a fly-past by the Blue Impulse formation flying squadron and will draw on \"deeply symbolic Japanese cultural references\" to \"tell the story of the mythical dawn of time, rugby's origins and its arrival in Japan\".\n\nWith the tournament held in natural disaster-prone Japan, organisers say they have put in a \"meticulous\" contingency plan against earthquakes and also typhoons, which are very much in season during the competition.\n\nIf a match cannot be played, it will count as a draw, resulting in the intriguing potential scoreline of New Zealand 0, Namibia 0.", "description": "The first Rugby World Cup to be staged in Asia kicks off Friday in Tokyo, as the game seeks to spread beyond its traditional European and southern hemisphere heartlands.  The battle for the Webb Ellis Cup promises to be one of the most open in history, with at least five or six teams capable of preventing", "authors": ["Richard Carter"], "top_image": "https://s.yimg.com/uu/api/res/1.2/EXlfBLy7qH1r3C37MRSzxw--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_sg/News/AFP/41dfc588bccc0a9495c93f86d68d8a0a88d9c8e2.jpg", "published_at": "2019-09-20"}