{"pub": "metro", "url": "https://metro.co.uk/2019/10/20/best-fighting-games-of-the-generation-part-7-super-smash-bros-ultimate-readers-feature-10945555", "downloaded_at": "2019-10-20 00:20:42.058070+00:00", "title": "Best fighting games of the generation, Part 7: Smash Bros. Ultimate", "language": "en", "text": "Super Smash Bros. Ultimate – the ultimate current gen fight?\n\nA reader presents the final part of his round-up of the generation’s best fighters, ending on Nintendo’s epic crossover.\n\nThis is the undisputed king of fighters for this generation. And by a long way. Sorry, SNK Heroines. It is only the third ever fighting game that I have ever played where I would award a 9 out of 10 to, the others being the first two Soulcalibur games. A game that, while it has been adoringly embraced by the e-sports crowd doesn’t really care about appeasing them. This is a game that knows that other fighting games, and games in general, exist and makes the effort to be as much value for money as it possibly can be. Which is such a blast of fresh air it makes you feel like Julie Andrews on that hill in The Sound Of Music.\n\nAdvertisement\n\nAdvertisement\n\nBut it’s not perfect. In fact, the nature of this particular beast makes it difficult to get into. Especially for absolute newcomers. Never mind some of the odd rules where it’s about being blown off the stage and losing lives rather than a simple knockout, you have to be both laser-focused on your chosen character and keep an eye on what’s going on around you. This is not unlike learning to fly a helicopter. Not in a video game which is always terrible, but in the real world.\n\nIt’s very easy to die to a stage hazard when you were concentrating on beating your opponent, or the opponent blowing you away when you got distracted by some weird stuff happening in the background. But like I say, that’s just the nature of it. This game is actually more fun the more chaotic it gets, there’s just no way around that. Not that I see at least.\n\nSingle-player\n\nIncredible. Highly consistent, across the board. However, I will say that I am one of the small but not insignificant few who really enjoyed Subspace Emissary from Super Smash Bros. Brawl on the Wii. I slightly prefer it to World Of Light, which does become a bit of a grind before too long. Yes, I know that Smash doesn’t have controls ideally suited for a platform game but it has always had those elements. But while Brawl boasted higher highs, as it were, Ultimate is more consistent. It is, ultimately, what wins the day. Ha ha. And World Of Light is not your only time sink, there’s plenty more besides. And, like I said, all of it is consistently good, if never sensational. Nothing to compete with early Soulcalibur. Sorry to keep harping on about it, only it’s true.\n\nAdvertisement\n\nAdvertisement\n\nPresentation\n\nI hear that Mortal Kombat 11 on the Switch looks good. This is no surprise. You underestimate Nintendo’s little box of treasures at your peril. And you will always look the fool for doing so. Smash Bros. Ultimate may not be as impressive as NetherRealm’s latest but it’s a looker alright. And those Final Smash attacks can be showstoppers.\n\nAs for the music, it’s only the cream of about three decades of Nintendo’s greatest hits. Not to mention Square Enix, Sega, and Konami. So, you know, worth a listen I would say.\n\nHandling\n\nDeceptively simple. ‘A’ button for throwing, a button for a regular attack, a button for a strong attack and one to block. You can jump, you can pick up items. No long combos to learn. No complex inputs. And then things suddenly get tough and you find yourself having to double jump, attack, and smash attack just to get back to the stage; trying to corner someone and pile on the pressure is much easier said than it is done. It’s as arcade as it gets: it’s not your memory or even muscle memory that’s tested but your reflexes and your reaction times.\n\nI would preface all this by saying it might not be someone’s ideal first fighting game, despite appearances. It is probably much too atypical of the genre for that.\n\nStructure\n\nAs the late Bob Peck observed in Jurassic Park: ‘Clever girl…’ Not only is the way you unlock characters very clever – you can challenge them later on the menu screen should you get beat, and you will – but so is the idea of spirits. These are what you’ll use to get through World Of Light and can range from WarioWare characters to the twins from Project Zero 2. When Sakurai said everybody, he really meant it.\n\nAdvertisement\n\nCast\n\nWell, it’s perfect isn’t it? I think every character you’ve even had a vague fondness for is represented in some form. If you can’t actually play as them, you can use them as a buff. Now, there isn’t a great deal of mechanical difference between the cast members – but it’s enough for even the most casual observer to appreciate. And Bayonetta’s here, seriously, what more could you want? The moon on a stick? Oh, just confirmed as a DLC stage: moon on stick.\n\nPost-launch support\n\nI have yet to buy the season pass and I should have for the purposes of this feature, but I only have so much money. From what I can see, this is impressive. Joker and the Persona 5 content all looks amazing and the drop-down menu attacks for the Dragon Quest heroes is very innovative. The mouth waters at what could be next. And I believe we’ll get a lot.\n\nWe have only ever got one Smash game per generation and I feel this is the last of them. But I think they’ll just keep adding to it rather than make a full sequel. One day, Smash and Sakurai will have enveloped everything, from Bubsy the Bobcat and Captain America up to Freddy Krueger and Doomguy. All will be in Smash. And Kirby will get to consume them and take for himself their power!\n\nFor at the end of all things… there is only Kirby.\n\nMultiplayer\n\nAdvertisement\n\nAfter experiencing this, the idea of lesser games just giving you basic versus and online, then calling it a day, is intolerable. Not that it ever was acceptable in my view. There are so many options here that it could be days before you get bored in a single session. Hell, you can even have a go at creating your own stages! Just like the happy days of Micro Machines Turbo Tournament ‘96 back on the Mega Drive! There is so much here, I’ve barely got round to doing any of it!\n\nOh, and if you really must be a tiresome bore, then you can play as vanilla as you like. But I pity you. Just like Mr. T would.\n\nOnline\n\nIf you really have to, the lack of complex controls and move lists as long as your arm to remember will be something of an equaliser. But it’s still never going to be a substitute for the real thing, you and a mate or two in the same room. That said, you can download other people’s hellish level editor creations for you to muck about in if you’re feeling adventurous. Which is a clever way of utilising online for a nice change.\n\nSo there you have it. It’s been a good generation for fighters but there are some worrying trends. Capcom didn’t even try to reach a wider audience and paid a heavy price, while others are confusing enjoyable single-player content with a soul-destroying grind fest. And I’m not just talking about the developers inflicting them upon us. Many are falling for the old emperor’s new clothes trick and I honestly don’t know why.\n\nEven worse, there are only three games this generation that have thought to add more variety to their multiplayer! Which I find unthinkable and I blame that entirely on the esports crowd, who despite being very few in number end up being the loudest voices. But the only thing they care about is balance. Which is not really the same thing as fun.\n\nWhen you think about it, Mortal Kombat 11 was very… safe. No zany extra modes like karting or chess. And yes, it’s very easy to sneer at such things if you’re a purist snob but they added spice. They got the attention of those that might normally give the genre a wide berth. And that’s the point. These kind of things were never meant for the competitive hardcore, whose interests are so narrow and laser-focused.\n\nI want to be fighting floating swords again, fight in low gravity again, be a cat jumping over obstacles again – in short, I want fighting games to focus on being as fun as they possibly can. And get the grind out of this genre! And when do we want it? Next generation would be nice…\n\nBy reader DMR\n\nBest fighting games of the generation, Part 1: Street Fighter V\n\nBest fighting games of the generation, Part 2: ARMS\n\nBest fighting games of the generation, Part 3: Tekken 7\n\nBest fighting games of the generation, Part 4: Dragon Ball FighterZ\n\nBest fighting games of the generation, Part 5: Mortal Kombat 11\n\nBest fighting games of the generation, Part 6: Soulcalibur VI\n\nThe reader’s feature does not necessary represent the views of GameCentral or Metro.\n\nYou can submit your own 500 to 600-word reader feature at any time, which if used will be published in the next appropriate weekend slot. As always, email gamecentral@ukmetro.co.uk and follow us on Twitter.\n\nMORE: Video game companies think you’re an idiot but they love your money – Reader’s Feature\n\nMORE: Why Hitman 2 is such a great game - Reader’s Feature", "description": "A reader presents the final part of his round-up of the generation’s best fighters, ending on Nintendo’s epic crossover.", "authors": [], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2018/06/screenshot_16_1571444052.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-20"}