{"pub": "yahoo", "url": "https://finance.yahoo.com/news/u-blames-iran-saudi-attacks-031245064.html", "downloaded_at": "2019-09-15 07:46:41.964364+00:00", "title": "U.S. blames Iran for Saudi attacks, 'pretend' diplomacy", "language": "en", "text": "Secretary Pompeo delivers remarks at the Heroes of U.S. Diplomacy Launch Event in Washington\n\nBy Alexandra Alper\n\nWASHINGTON (Reuters) - U.S. Secretary of State Mike Pompeo on Saturday accused Iran of leading attacks on Saudi oil plants that have cut the kingdom's output roughly in half, as he ruled out Yemeni involvement and denounced Tehran for engaging in false diplomacy.\n\nYemen's Iran-aligned Houthi group claimed credit for the attacks on two plants at the heart of Saudi Arabia's oil industry, including the world's biggest petroleum processing facility.\n\nPompeo, however, said on Twitter that there was no evidence the attacks came from Yemen.\n\n\"Tehran is behind nearly 100 attacks on Saudi Arabia while Rouhani and Zarif pretend to engage in diplomacy,\" Pompeo said, referring to Iran's President Hassan Rouhani and Foreign Minister Mohammed Javad Zarif.\n\n\"Amid all the calls for de-escalation, Iran has now launched an unprecedented attack on the world's energy supply,\" he added. The State Department declined to provide any evidence to bolster Pompeo's claim.\n\n\"We call on all nations to publicly and unequivocally condemn Iran’s attacks,\" Pompeo said, warning that the Trump administration would work with its allies to make sure Iran was \"held accountable for its aggression.\"\n\nThe tweets signaled a more hawkish stance in Washington towards Tehran, following signs of a possible thaw in relations between the two nations after months of escalation.\n\nLast year, U.S. President Donald Trump withdrew the United States from a 2015 pact that aimed to keep a lid on Tehran's nuclear ambitions and he has imposed a series of sanctions that have crippled Iran's economy.\n\nBut in recent weeks, Trump has said he would be open to meeting with Rouhani, perhaps on the sidelines of the United National General Assembly in New York later this month. Pompeo has said such talks could take place without any preconditions.\n\nRouhani, for his part, has said that Tehran, which denies seeking nuclear weapons, would not talk to the United States until Washington lifts the sanctions.\n\nRepublican Senator Lindsay Graham, a close Trump ally and a member of the Senate Foreign Relations Committee, said Saturday's attacks showed Iran was not interested in peace and was instead pursuing nuclear weapons and regional dominance.\n\n\"It is now time for the U.S. to put on the table an attack on Iranian oil refineries if they continue their provocations or increase nuclear enrichment,\" Graham said on Twitter.\n\nOthers cast doubt on Pompeo's allegations.\n\n\"This is such irresponsible simplification and it's how we get into dumb wars,\" Democratic Senator and committee member Chris Murphy tweeted. \"Iran is backing the Houthis and has been a bad actor, but it's just not as simple as Houthis=Iran.\"\n\nWashington's allies overseas will want to see solid evidence of Iran's involvement, said Suzanne Maloney, a Middle East expert at the Brookings Institution think tank in Washington.\n\n\"It's credible that the Iranians had something to do with this,\" said Maloney. \"We'll have to wait and see how they'll (the administration) marshal the evidence.\"\n\nSaturday's attacks follow earlier cross-border attacks on Saudi oil installations and on oil tankers in Gulf waters.\n\nSaudi Arabia, which leads a Sunni Muslim coalition that intervened in Yemen in 2015 against the Houthis, has blamed regional rival Shi'ite Iran for previous attacks. Tehran has denied the allegations. Riyadh also accuses Iran of arming the Houthis, a charge denied both by the group and Tehran.\n\nThe White House said the United States was committed to keeping oil markets well-supplied in the wake of the attack and the U.S. Energy Department said the administration could release oil from strategic reserves if necessary.\n\nThe attacks on the two facilities cut Saudi Arabia's crude oil supply by around 5.7 million barrels per day or about 50% of its output.\n\n\n\n\n\n(Reporting by Alexandra Alper; Additional reporting by Tim Gardner and Diane Bartz in Washington; Editing by Marguerita Choy, Tim Ahmann and Daniel Wallis)", "description": "U.S. Secretary of State Mike Pompeo on Saturday accused Iran of leading attacks on Saudi oil plants that have cut the kingdom's output roughly in half, as he ruled out Yemeni involvement and denounced Tehran for engaging in false diplomacy.  Yemen's Iran-aligned Houthi group claimed credit for", "authors": ["Alexandra Alper"], "top_image": "https://s.yimg.com/uu/api/res/1.2/JuxflWhpj3x9L_5iOIRZnA--~B/aD0yOTk7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/9792a9ed38937412105f09f2dcfb903a", "published_at": "2019-09-15"}