{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7565473/Kate-Middleton-s-brother-describes-struggles-depression.html", "downloaded_at": "2019-10-12 09:24:36.611367+00:00", "title": "Kate Middleton´s brother describes his struggles with...", "language": "en", "text": "The Duchess of Cambridge’s brother James Middleton has opened up about his “rebirth” from depression after almost a year undergoing therapy.\n\nThe 32-year-old, who suffers with depression, attention deficit disorder (ADD) and dyslexia, said family members including the Duchess of Cambridge attended his cognitive behavioural therapy sessions with him.\n\nHe described this as a “very big thing” for him, after years of being engulfed in mental darkness which made him feel like he could not speak to them.\n\nJames Middleton with Alizee Thevenet at Wimbledon (Mike Egerton/PA)\n\nMr Middleton told the Telegraph: “The fact is, no matter what experience someone has, your family members are the hardest people [to talk to].\n\n“You also have a very different way of interacting with your family than you do with your friends. And actually, I behave like Kevin from Kevin & Perry.”\n\nOn his depression, he said: “I couldn’t do anything. I couldn’t sleep, I couldn’t read a book, I couldn’t watch a film, I couldn’t eat. If I ate something it just sat there.”\n\nMr Middleton said he contemplated suicide, though he believes he would never have gone through with it, and at his lowest points he would find solace in listening to Stephen Fry’s narration of Harry Potter audiobooks.\n\nAfter therapy and support from his family and his “emotional support dog” Ella, a cocker spaniel, he says he is finally in a brighter place.\n\nMr Middleton recently proposed to his girlfriend, French-born financial expert Alizee Thevenet, 29, in the Lake District – something he said he would not have felt able to do in his previous mindset.\n\nThe royal’s brother, who also described living with dyslexia and ADD as feeling “like a square peg trying to fit into society’s round hole”, works as an ambassador for the charity Pets As Therapy to raise awareness about the healing effects pets can have on their owners’ mental health.\n\nMr Middleton’s sister and her husband Prince William spearhead the Heads Together campaign with The Duke and Duchess of Sussex to end stigma around mental health.", "description": "James Middleton said family members including the Duchess of Cambridge helped him through.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/09/wire-19621922-1570870453-493_636x382.jpg", "published_at": "2019-10-12"}