{"pub": "fox", "url": "https://foxnews.com/media/geraldo-rivera-san-francisco-board-nra-both-in-the-distraction-business", "downloaded_at": "2019-09-11 07:26:55.763628+00:00", "title": "Geraldo Rivera: NRA and San Francisco board 'both in the distraction business'", "language": "en", "text": "The San Francisco Board of Supervisors and the National Rifle Association are both in the \"distraction business,\" according to Geraldo Rivera.\n\nThe board recently declared the NRA a domestic terrorist organization in a move that Rivera asserted was an effort to draw attention away from the city's problems with homelessness and drugs. The NRA responded by suing the governing body to distract from the gun violence epidemic, Rivera claimed Tuesday on \"Hannity.\"\n\n\"The NRA and the San Francisco Board of Supervisors are tailor-made for each other,\" he said.\n\nNRA SUES SAN FRANCISCO OVER 'DOMESTIC TERRORIST ORGANIZATION' DESIGNATION\n\n\"They are both in the distraction business. The Board of Supervisors ... declares them domestic terrorists to distract us from this awful epidemic of homelessness and urban anarchy.\n\n\"The NRA is suing San Francisco and the Board of Supervisors to distract from the undeniable epidemic of gun violence.\"\n\nIn addition, Rivera pointed to the fact the suit will be heard by the U.S. Court of Appeals for the Ninth Circuit, an often reliably liberal San Francisco-based bench, he said.\n\n\"How much of a chance do you think that lawsuit has in the liberals' favorite federal circuit?\" the Fox News correspondent-at-large asked. \"It won't even survive a motion for summary judgment.\"\n\nIn response, former NYPD officer and ex-Secret Service Agent Dan Bongino rebuffed Rivera's claim.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"San Francisco just declared a group of law-abiding gun owners and an organization that defends the Second Amendment in our Bill of Rights [a terrorist organization] and you're saying this is a distraction for them defending themselves?\" he asked.\n\nRivera added President Trump is right to criticize the issues that are prevalent in cities like San Francisco, and the \"failure of the local Democratic regimes,\" but added the federal government and local boards are working together.", "description": "The San Francisco Board of Supervisors and the National Rifle Association are both in the \"distraction business,\" according to Geraldo Rivera.", "authors": ["Charles Creitz"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Geranldo-Hannity_FOX.jpg", "published_at": "2019-09-11"}