{"pub": "news.com.au", "url": "https://kidspot.com.au/news/kmart-scooter-with-missing-wheel-ruins-boys-birthday/news-story/a2c000b886dc5d836dda4ab093a88c95", "downloaded_at": "2019-10-05 10:28:29.589011+00:00", "title": "Kmart scooter with missing wheel ruins boy's birthday", "language": "en", "text": "\"His face when he opened that box made me feel like the worst mother in the world.\"\n\nHow did a company failing in 2008 turn around to become a giant in homewares and fashion with a dedicated social media following?\n\nWhy do we love Kmart so much? 00:21:30\n\nA private meet-up with JoJo Silva, every Barbie accessory ever made and a trip to LegoWorld.\n\nNormally your kid’s birthday present wish list pushes the boundaries of reality, time and most importantly - your wallet.\n\nSo when Helen’s eight-year-old son Tarkyn asked for a scooter that he could take camping - she breathed a sigh of relief.\n\nThe Aussie mum-of-two knew exactly where to get one – her local Kmart store.\n\nAnd it would only set her back $59.\n\n“He was so excited – we were going camping after his birthday and he knew he couldn’t bring his bike,” she tells Kidspot.\n\n“So I went straight to Kmart and bought the scooter.\"\n\nHelen’s eight-year-old son Tarkyn asked for a scooter for his birthday. Source: Madeline Cox\n\n“I just assumed everything was in there\"\n\nBefore buying it, Helen was careful to make sure the box she picked hadn’t been tampered with.\n\nShe knew sometimes people had issues with items going missing from unsealed boxes.\n\n“I double-checked that it was sealed – and grabbed the one from the back of the shelf,” she says.\n\n“The seal was intact. If it had been sticky tape I might have been suspicious - but it had been sealed in the factory.\n\n“I just assumed everything was in there.”\n\nHelen bought the scooter from Kmart for $59. Source: Madeline Cox\n\n“He didn’t understand that there had been a mistake\"\n\nAfter taking such care to ensure the scooter box hadn’t been tampered with – Helen stashed the present away ready for her son's birthday.\n\nYou can imagine her shock when it came time for Tarkyn to open his presents and they spotted the mistake.\n\nThe little boy’s scooter was missing a wheel – and just like that, his birthday was ruined.\n\n“He was so disappointed that he was on the verge of tears,” she says.\n\n“I tried to distract him - but it wasn’t a great start to his birthday.\n\n“He just kept asking me why I had bought something that he couldn’t use. He didn’t understand that there had been a mistake.”\n\nThe scooter was missing a wheel. Source: Madeline Cox\n\n\"I didn’t hear anything back\"\n\nAlthough Tarkyn ended up having a great birthday dinner with his family, Helen couldn’t shake the feeling that she had let her son down.\n\nAll she could do was email Kmart straight away to try to organise a replacement scooter.\n\nThe last thing Helen wanted to do was drive back to Kmart when the family left for a week of camping just three days later.\n\n“But I didn’t hear anything back,” she says.\n\n“So I cancelled an appointment, left the kids with a friend and went back to Kmart myself.”\n\nTarkyn ended up having a great birthday dinner with family. Source: Madeline Cox\n\n\"There was no apology\"\n\nOnce she arrived at Kmart, Helen made a beeline for the returns desk where staff offered her a refund on the scooter in return for store credit.\n\nHelen should have been happy with that outcome – but something about the exchange left the mum with a bitter taste in her mouth.\n\n“There was no apology,” she says.\n\n“They didn’t seem to care that my son’s birthday present had been ruined.\n\n“They just said that the scooter had been made in China – which isn’t an excuse or an explanation.\n\n“I had to go to get a replacement scooter myself.”\n\nHelen said she waited a further five days until she was finally contacted by Kmart. Source: Madeline Cox\n\n\"I didn’t really have time\"\n\nAfter being brushed off in the store, Helen said she waited a further five days until she was finally contacted by Kmart customer service.\n\nShe ended up speaking to a customer service agent on the phone, who apologised for taking so long to reply.\n\nHelen said she was offered a $20 Kmart voucher to compensate her for the inconvenience.\n\n“They said that they had been busy which is why no one replied – but I don’t think that it takes that much time to respond to an email,” she says.\n\n“By the time they replied - I had already fixed it for myself even though I didn’t really have time.”\n\nThree days later, the family went camping. Source: Madeline Cox\n\n\"The problem was my son’s disappointment\"\n\nHelen says that the experience won’t stop her from shopping at Kmart – but will make her think twice before buying a bike or scooter from them again.\n\nThe issue she keeps getting stuck on isn’t that the scooter was faulty, but rather that Kmart didn’t seem to care.\n\n“If something goes wrong, I want a proper response and an apology,” she says.\n\n“I’d rather not waste my time waiting for Kmart.\n\n“They apologised for the inconvenience but that actually wasn’t the point – the problem was my son’s disappointment.\"\n\nKidspot contacted Kmart for comment and had yet to hear back at the time of publication.", "description": "\"His face when he opened that box made me feel like the worst mother in the world.\"", "authors": ["Madeline Cox"], "top_image": "https://content.api.news/v3/images/bin/968d6bd80585f0d64a32c02b820a74c9", "published_at": "2019-10-03"}