{"pub": "foxnews", "url": "https://foxnews.com/media/north-carolina-special-election-republican-trump-fayetteville-rally", "downloaded_at": "2019-09-10 02:20:32.287704+00:00", "title": "Scott Walker: Trump's presence in North Carolina is 'critical' to GOP's hopes", "language": "en", "text": "President Trump's Monday rally in North Carolina is critical to Republicans' hopes ahead of both a special U.S. House election and the GOP's chances in 2020, according to former Wisconsin Gov. Scott Walker.\n\nRepublican contender Dan Bishop, a state senator, has a good chance of winning Tuesday, Walker told host Neil Cavuto Monday on \"Your World.\"\n\n\"President Trump did well there in the past. The left was more motivated going into the 2018 election, which is not uncharacteristic any time you've got an incumbent,\" he said.\n\n\"I think it's going to be critical in North Carolina as it will be going into 2020 that Republican right-of-center voters wake up and realize the left is motivated and we've got to be just as motivated. I think the president being there will remind people just how critically important this election is.\"\n\nTRUMP CALLS FOR END TO GOP COMMITTEE TERM LIMITS\n\nOn \"Your World,\" Walker also pointed to the district's unique structure as another factor in the race.\n\n\"It's all about turnout if you look at the district,\" he said.\n\nLater Monday, Trump will hold a rally in Fayetteville in support of Bishop -- who is facing Democrat Dan McCready after the 2018 U.S. House election was voided.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe special primary and general elections were required after the state elections board in February determined last year's contest tainted when Republican Mark Harris used a political operative who collected mail-in ballots. Harris, who narrowly led after November's votes were counted, opted not to run again.\n\nFormer Rep. Robert Pittenger, R-N.C., who last held the seat, lost to Harris in the 2018 primary. He declined to run in the special election, according to the Charlotte Observer.\n\nThe Associated Press contributed to this report.", "description": "President Trump's Monday rally in North Carolina is critical to Republicans' hopes ahead of both a special U.S. House election and the GOP's chances in 2020, according to former Wisconsin Gov. Scott Walker.", "authors": ["Charles Creitz"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Cavuto-Walker_FOX.jpg", "published_at": "2019-09-09"}