{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Culture/video/scarlett-johansson-criticized-support-woody-allen-65402939", "downloaded_at": "2019-09-07 02:21:04.905975+00:00", "title": "Scarlett Johansson criticized for support of Woody Allen Video", "language": "en", "text": "Transcript for Scarlett Johansson criticized for support of Woody Allen\n\nNow to the fallout for actress Scarlett Johansson who defended woody Allen who says she believes him. Janai Norman has the story. Reporter: Criticism came quickly on social media. Many calling out Scarlett Johansson for previously speaking up for sexual assault victims and now firing defending Allen. Scarlett Johansson is coming to the defense of woody Allen. I'm trying to save your life. Reporter: The \"Avengers\" star at the top of highest female earners list on \"Forbes\" opening up about hi feelings for Allen directing her in movies like \"Match point,\" \"Scoop.\" We're guests. Reporter: And \"Vicky Cristina Barcelona.\" I'm a big girl. Reporter: After the me too movement she shined light on a decades old involvement. How do I feel about woody she muses in an ain't view with \"The Hollywood reporter.\" I love woody I, I believe him and I would work with him anytime. Dylan farrow, his adopted daughter claims Allen molested her back in 1992 when she was 7, an allegation Allen always denied and for which he's never been charged. They resurfaced and his career took a hit. Actors like Selena Gomez and Mira sorvino expressing regret for working with him. Stop. Now, listen. Reporter: Allen filed a $68 million lawsuit against Amazon earlier this year after the streaming behemoth canceled a multifilm contract with the filmmaker arguing that the director's reputation had been tarnished. Johansson spoke to Allen about sexual abuse allegations and I see woody whenever I can and I have had a lot of conversations with him about it. He's direct with me and maintains his innocence and I believe him. She is a vocal supporter of time's up last year calling out James Franco for wearing a time he up pin and after that several acting students he taught accused him. Franco called them inaccurate and said if I've done something wrong, I will fix it, I have to. How could a person publicly stand by a organization that helps to provide support for victims of sexual assault while privately preying on people who have no power? I want my pin back, by the way. Reporter: So much of Hollywood has distanced itself from woody Allen. Some actors who worked with him expressing remorse, not Johansson. She says she believes him and will work with him again. More about that Kevin hart\n\nThis transcript has been automatically generated and may not be 100% accurate.", "description": "The actress said in an interview with The Hollywood Reporter of the controversial director,", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/190905_gma_norman3_0734_hpMain_16x9_992.jpg", "published_at": "2019-09-05"}