{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/trumps-lies-are-finally-called-out-in-rare-statement-from-us-intelligence-community-watchdog", "downloaded_at": "2019-10-02 00:35:37.242559+00:00", "title": "Trump's Lies Are Finally Called Out In Rare Statement From U.S. Intelligence Community Watchdog", "language": "en", "text": "Current U.S. president and white supremacist, Donald Trump, in the Oval Office on September 30, 2019 (Photo: Getty Images)\n\nThe watchdog for the U.S. Intelligence Community issued a rare statement Tuesday in an attempt to correct misinformation currently being spread by the President of the United States. The short version from the Inspector General of the Intelligence Community: The rules for whistleblowers were not recently changed to let secondhand information be deemed credible and urgent. But even if the rules had been changed, the whistleblower had both firsthand and secondhand knowledge.\n\nDonald Trump is currently feeling heat over a whistleblower complaint that shows he pressured the president of Ukraine to investigate Democratic presidential candidate Joe Biden. Trump sent an all-caps tweet on Monday about a conspiracy theory that’s been spreading on websites like the Federalist and TV channels like Fox News, which have falsely claimed whistleblowers previously needed firsthand knowledge in order for their claims to be considered worthy of investigation by the Inspector General.\n\n“WHO CHANGED THE LONG STANDING WHISTLEBLOWER RULES JUST BEFORE SUBMITTAL OF THE FAKE WHISTLEBLOWER REPORT? DRAIN THE SWAMP!” President Trump tweeted on Monday.\n\nTrump was likely reacting to an appearance on Fox & Friends by Sean Davis, cofounder of the Federalist that Monday. Davis helped spread the conspiracy theory, which insists that 1) The whistleblower doesn’t have any firsthand knowledge of Trump’s crimes and 2) The rules were recently changed. Both of those assertions are lies.\n\n“It used to be required that you had to offer direct, personal, firsthand evidence, or else this particular complaint, which is known as an Urgent Concern Complaint, would be dismissed by the Intelligence Community Inspector General. And that was changed sometime in the last year,” Davis said on Fox news, lying through his teeth. The Federalist hasn’t yet issued a correction.\n\nDavis claims that the latest rules, which were most recently published in August, were changed in some Deep State conspiracy against Trump. That change would be relevant, he insists, because the whistleblower submitted his complaint on August 12, 2019. But there were no changes since May of 2018, and even then, there’s never been a requirement that whistleblowers must have firsthand knowledge of corruption or abuse of power.\n\n“The Disclosure of Urgent Concern form the Complainant submitted on August 12, 2019 is the same form the ICIG has had in place since May 24, 2018, which went into effect before Inspector General Atkinson entered on duty as the Inspector General of the Intelligence Community on May 29, 2018, following his swearing in as the Inspector General of the Intelligence Community on May 17, 2018,” the Intelligence Community Inspector General said in a statement published Tuesday.\n\nRules aside, the Inspector General makes it clear that the whistleblower indeed does have firsthand knowledge of some areas in the complaint. The whistleblower form includes a section where you can indicate whether you have firsthand or secondhand knowledge, and the whistleblower has both.\n\nFrom the statement:\n\nThe Complainant on the form he or she submitted on August 12, 2019 in fact checked two relevant boxes: The first box stated that, “I have personal and/or direct knowledge of events or records involved”; and the second box stated that, “Other employees have told me about events or records involved.”\n\nPresident Trump has also accused the whistleblower of being “close to a spy” but the new statement also makes clear that the whistleblower had “authorised access” to the information and followed all the proper procedures in order to alert the Inspector General:\n\nAs part of his determination that the urgent concern appeared credible, the Inspector General of the Intelligence Community determined that the Complainant had official and authorised access to the information and sources referenced in the Complainant’s Letter and Classified Appendix, including direct knowledge of certain alleged conduct, and that the Complainant has subject matter expertise related to much of the material information provided in the Complainant’s Letter and Classified Appendix. In short, the ICIG did not find that the Complainant could “provide nothing more than second-hand or unsubstantiated assertions,” which would have made it much harder, and significantly less likely, for the Inspector General to determine in a 14-calendar day review period that the complaint “appeared credible,” as required by statute. Therefore, although the Complainant’s Letter acknowledged that the Complainant was not a direct witness to the President’s July 25, 2019, telephone call with the Ukrainian President, the Inspector General of the Intelligence Community determined that other information obtained during the ICIG’s preliminary review supported the Complainant’s allegations. The Complainant followed the law in filing the urgent concern complaint, and the ICIG followed the law in transmitting the information to the Acting Director of National Intelligence on August 26, 2019.\n\nAside from accusing the whistleblower of being a spy, Trump also suggested that the whistleblower should be executed, telling a private crowd in New York last week that the U.S. used to be “smart” when it came to treason.\n\n“I want to know who’s the person who gave the whistleblower the information because that’s close to a spy,” Trump said on September 27. “You know what we used to do in the old days when we were smart with spies and treason, right? We used to handle it a little differently than we do now.”\n\nBut Trump hasn’t just accused the whistleblower of treason. The president also said that Adam Schiff, the ranking member of the U.S. House Intelligence Committee had committed treason and that he should be arrested. To be precise, Trump tweeted it as a question “Arrest for Treason?” in an apparent effort to create some plausible deniability that he actually called for the arrest of a political opponent — something more common in authoritarian countries than functioning democracies.\n\nWe’re also learning with each new passing day just how involved Attorney General William Barr is in all of Trump’s dirty dealings. A Washington Post report from last night indicates that Barr is at the centre of Trump’s attempt to blame anyone but Russia for the hacking of Democratic emails during the 2016 presidential election:\n\nAttorney General William P. Barr has held private meetings overseas with foreign intelligence officials seeking their help in a Justice Department inquiry that President Trump hopes will discredit U.S. intelligence agencies’ examination of possible connections between Russia and members of the Trump campaign during the 2016 election, according to people familiar with the matter. Barr’s personal involvement is likely to stoke further criticism from Democrats pursuing impeachment that he is helping the Trump administration use executive branch powers to augment investigations aimed primarily at the president’s adversaries.\n\nThe report states that Barr has been in contact with British and Australian intelligence services and was in Italy as recently as last week apparently hoping investigators there could help discredit the origins of the FBI investigation into Trump’s ties to Russia.\n\nYes, the impeachment inquiry is getting started. But the Trump regime has made it clear that it’s going to do everything in its power to fight back. And with the full force of the U.S. government behind him, including the most powerful law enforcement agencies in the world, Trump has plenty of ammunition to fight with.\n\nHere’s hoping the president is ousted before he can do even more damage to America. It’s just a race against time at this point, but with news outlets like Fox News and the Federalist around, Trump’s supporters will continue to be fed bullshit. How long will they eat it up? Quite a long time, if the past three years are any indication.", "description": "The watchdog for the U.S. Intelligence Community issued a rare statement Tuesday in an attempt to correct misinformation currently being spread by the President of the United States. The short version from the Inspector General of the Intelligence Community: The rules for whistleblowers were not recently changed to...", "authors": ["Matt Novak", "David Tracy"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/e57fz4e4th7romc8o8bv.jpg", "published_at": "2019-10-02"}