{"pub": "breitbart", "url": "https://breitbart.com/border/2019/10/28/will-mexican-cartels-use-car-bombs-near-the-texas-border-again", "downloaded_at": "2019-10-28 23:38:18.889466+00:00", "title": "Will Mexican Cartels Use Car Bombs near the Texas Border Again?", "language": "en", "text": "Over the past few months, President Andres Manuel Lopez Obrador (AMLO) executed a policy of choosing not to target cartel leaders with the hope of lowering overall violence. A shift began, however, on October 8 when Mexico City announced its military would actively target key figures in the state of Tamaulipas, abutting the southern Texas border region. The change could ratchet pressure on cartel chiefs to return to their use of car bombs.\n\nCar bombs became institutionalized as a fear tactic within the Mexican cartel wars on July 15, 2010, in Juarez, after a civilian was killed and dressed in a police uniform. The body was positioned near a car laden with explosives and set for remote detonation. After first responders arrived on the scene, operatives with “La Linea” (an enforcement wing of the Juarez Cartel at the time) detonated the devices while filming the entire incident. Several people were killed–including emergency personnel. The footage was eventually uploaded to social media. The attack demonstrated a quantum leap in cartel techniques, tactics, and procedures (TTPs).\n\nBy the end of 2010, a total of five car bombs were utilized by different cartels in three Mexican states. Two devices were intercepted by police prior to detonation. This breakthrough gave considerable insight into technologies the cartels were leveraging. The favored explosive material is Tovex, commonly used in mining, construction, and oil seismic exploration. Triggering devices vary from cell phones to hard-wired Futaba radio controllers. These can be traced back over the decades to car bombs used in Columbia by the notorious Medellin Cartel.\n\nOn June 29, 2012, at the height of the cartel wars in Tamaulipas, Los Zetas attempted to assassinate Nuevo Laredo Mayor Benjamin Galvan Gomez at his city hall office. A Ford Ranger loaded with explosives was parked and detonated nearby. The blast would be one of the largest to date–injuring seven, damaging 11 vehicles, and causing extensive damage to the municipal building. Mayor Gomez survived. Although ultimately unsuccessful, the attempted assassination demonstrated a new evolution in cartel car bombing tactics.\n\nIn the following years, car bombing incidents appeared to ebb near the U.S. border amid regular fractures within criminal organizations. The Sinaloa Cartel became dominant in the Juarez plaza while Los Zetas splintered and lost territory near the Gulf of Mexico. In 2015, Breitbart Texas published audio of Gulf Cartel leaders discussing the potential use of car bombs as a means to incite terror over rival Los Zetas.\n\nBeginning August 13, 2019, Tamaulipas once again became engulfed in cartel infighting after Cartel del Noreste (CDN) faction of Los Zetas attempted to take control of the Miguel Aleman plaza from the Gulf Cartel, currently aligned with the Cartel Jalisco New Generation. To date, no car bombs have been used in these conflicts. Further south, however, Breitbart Texas reported in April when a car bomb detonated roughly 30 miles from the international tourist hotspot Acapulco.\n\nJaeson Jones is a retired Captain from the Texas Department of Public Safety’s Intelligence and Counterterrorism Division and a Breitbart Texas contributor. While on duty, he managed daily operations for the Texas Rangers Border Security Operations Center.", "description": "The change could ratchet pressure on cartel chiefs to return to their use of car bombs.", "authors": ["Jaeson Jones"], "top_image": "https://media.breitbart.com/media/2019/10/Screen-shot-2015-10-25-at-8.48.24-PM-e14458245908281-640x480-640x335.png", "published_at": "2019-10-28"}