{"pub": "independent", "url": "https://independent.co.uk/sport/football/premier-league/arsenal-news-shkodran-mustafi-emmanuel-petit-criticism-haunt-a9148506.html", "downloaded_at": "2019-10-09 10:49:18.748365+00:00", "title": "Arsenal news: Shkodran Mustafi claims Emmanuel Petit criticism will haunt him for rest of his career", "language": "en", "text": "Shkodran Mustafi claims criticism from Arsenal great Emmanuel Petit will haunt him for the rest of his career.\n\nMustafi has struggled to justify the Gunners's £37m investment, with a series of mistakes costing him a place in Unai Emery's side.\n\nWorld Cup winner Petit labelled the German defender the \"king of blunders\", with the 27-year-old rejecting a move away this summer.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n\"I am self-critical enough to see that I made those mistakes,\" Mustafi told Der Spiegel. \"And I can cope with harsh criticism.\n\n\"But the criticism escalated, became irrational. I became a target. And we reached a point where people held me responsible for defeats in games I didn't even take part in.\n\nShape Created with Sketch. Arsenal winter transfer targets Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Arsenal winter transfer targets 1/10 Arsenal winter transfer targets Josh Kroenke has promised Arsenal plan to be ‘proactive’ in the winter transfer market. But who could they sign? Getty 2/10 Wilfried Zaha Arsenal have not completely given up on prizing Wilfried Zaha away from Crystal Palace. He won't come cheap ... but for the right price Palace may be tempted to cash in, particularly if the 26-year-old fails to impress in the first half of the season. Getty Images 3/10 Eduardo Camavinga The 16-year-old - who enjoyed a breakthrough performance against PSG in Ligue 1 last weekend - is also a target for Manchester United, City and Tottenham. Arsenal could attempt to replicate their William Saliba deal with Saint-Étienne by signing Camavinga and then immediately loaning him back to current club, Rennes. AFP/Getty Images 4/10 Dayot Upamecano If Josh Kroenke is true to his word, and his family do back the club in the winter market, than 20-year-old defender Dayot Upamecano is surely the first player they will attempt to sign. Arsenal came close to landing him this summer, only to balk at Leipzig's £55m price tag having so recently spent a club-record £72m on Nicolas Pepe. Bongarts/Getty Images 5/10 Samuel Umtiti Arsenal will monitor the first half of the 25-year-old's season at Barcelona very closely. The defender's 2018/19 season was hampered by injury and Unai Emery has gone on record about how much he rates the World Cup winner. Icon Sport via Getty Images 6/10 Daniele Rugani Juventus are desperate to get rid of the defender as they scramble to balance the books ahead of this week's Italian transfer deadline. If they fail to offload Rugani he will certainly be available in the winter, and could make a good cut-price solution if Arsenal do indeed manage to sell Shkodran Mustafi this month. AFP/Getty Images 7/10 Robert Arboleda Arsenal came very close to signing the Ecuador international Robert Arboleda from São Paulo on transfer deadline day, instead snapping up David Luiz. But if they are short in defence in five months time, the 27-year-old would make a sensible purchase, especially considering his club were willing to sell. AFP/Getty Images 8/10 Fagner Conserva Another South American defender that Arsenal have preciously explored signing, that they could move for if necessary in January. Plays for Edu's former club Corinthians, which would help speed up any deal. AP 9/10 Everton Arsenal seriously explored signing the 23-year-old Brazil international this summer, but were deterred by his rapidly escalating price tag. But if they are backed by Josh Kroenke this winter, could they return for the Grêmio star? A move to Europe surely beckons for the electric forward, who won the 2019 Copa América top scorer award this summer. REUTERS 10/10 Toby Alderweireld The Spurs defender will be available to negotiate a free transfer to another club from January. Could Arsenal snap him up? It's happened once before... Getty Images 1/10 Arsenal winter transfer targets Josh Kroenke has promised Arsenal plan to be ‘proactive’ in the winter transfer market. But who could they sign? Getty 2/10 Wilfried Zaha Arsenal have not completely given up on prizing Wilfried Zaha away from Crystal Palace. He won't come cheap ... but for the right price Palace may be tempted to cash in, particularly if the 26-year-old fails to impress in the first half of the season. Getty Images 3/10 Eduardo Camavinga The 16-year-old - who enjoyed a breakthrough performance against PSG in Ligue 1 last weekend - is also a target for Manchester United, City and Tottenham. Arsenal could attempt to replicate their William Saliba deal with Saint-Étienne by signing Camavinga and then immediately loaning him back to current club, Rennes. AFP/Getty Images 4/10 Dayot Upamecano If Josh Kroenke is true to his word, and his family do back the club in the winter market, than 20-year-old defender Dayot Upamecano is surely the first player they will attempt to sign. Arsenal came close to landing him this summer, only to balk at Leipzig's £55m price tag having so recently spent a club-record £72m on Nicolas Pepe. Bongarts/Getty Images 5/10 Samuel Umtiti Arsenal will monitor the first half of the 25-year-old's season at Barcelona very closely. The defender's 2018/19 season was hampered by injury and Unai Emery has gone on record about how much he rates the World Cup winner. Icon Sport via Getty Images 6/10 Daniele Rugani Juventus are desperate to get rid of the defender as they scramble to balance the books ahead of this week's Italian transfer deadline. If they fail to offload Rugani he will certainly be available in the winter, and could make a good cut-price solution if Arsenal do indeed manage to sell Shkodran Mustafi this month. AFP/Getty Images 7/10 Robert Arboleda Arsenal came very close to signing the Ecuador international Robert Arboleda from São Paulo on transfer deadline day, instead snapping up David Luiz. But if they are short in defence in five months time, the 27-year-old would make a sensible purchase, especially considering his club were willing to sell. AFP/Getty Images 8/10 Fagner Conserva Another South American defender that Arsenal have preciously explored signing, that they could move for if necessary in January. Plays for Edu's former club Corinthians, which would help speed up any deal. AP 9/10 Everton Arsenal seriously explored signing the 23-year-old Brazil international this summer, but were deterred by his rapidly escalating price tag. But if they are backed by Josh Kroenke this winter, could they return for the Grêmio star? A move to Europe surely beckons for the electric forward, who won the 2019 Copa América top scorer award this summer. REUTERS 10/10 Toby Alderweireld The Spurs defender will be available to negotiate a free transfer to another club from January. Could Arsenal snap him up? It's happened once before... Getty Images\n\n\"I was annoyed (about Petit's criticism). It is one thing when you are criticised by fans or media.\n\n\"But it's a totally different thing if an ex-player, who knows how difficult it can be out there on the pitch, says something like that. I expect those players to be more sensitive and realise what they can initiate with such harsh criticism.\n\n\"Back in the day, it would have been in the papers for maybe a day and people would have forgotten about it. But it is written on the Internet today and will haunt me for the rest of my career.\n\n\"Former players like Petit should really not need to make their mark by talking current players down.\"", "description": "Shkodran Mustafi claims criticism from Arsenal great Emmanuel Petit will haunt him for the rest of his career. Mustafi has struggled to justify the Gunners's £37m investment, with a series of mistakes costing him a place in Unai Emery's side. World Cup winner Petit labelled the German defender the \"king of blunders\", with the 27-year-old rejecting a move away this summer.", "authors": ["Jack Rathborn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/09/09/Mustafi-has-been-hurt-by-the-criticism.jpg", "published_at": "2019-10-09"}