{"pub": "euronews", "url": "https://euronews.com/2019/10/30/racism-campaigners-disheartened-by-uefa-punishment-for-bulgaria-fans", "downloaded_at": "2019-10-30 11:08:14.496630+00:00", "title": "Racism campaigners 'disheartened' by UEFA punishment for Bulgaria fans", "language": "en", "text": "A leading anti-racism in football organisation has said it is \"disheartened, but not surprised\" by UEFA's sanctions against Bulgaria for the racist abuse some of the country's fans directed at black England players during the sides' Euro 2020 qualifier.\n\nFollowing the ruling that Bulgaria must play one home game behind closed doors and pay a fine of €75,000 for racist behaviour, a wave of criticism has been directed at UEFA for failing to tackle the issue.\n\nIn a statement, Kick It Out called for UEFA to overhaul its disciplinary process in response to racism, calling the punishment a missed opportunity.\n\nThe October 14 game, which England won 6-0, had to be stopped twice in the first half due to the racist actions of some Bulgarian supporters, who were seen giving nazi salutes and making monkey noises.\n\nNews of the sanctions sparked accusations that UEFA is unable to tackle racism in the game effectively.\n\nMore: Bulgaria told to play match behind closed doors over fans' racist abuse of England players\n\nCritics compared the response to the former Arsenal striker Nicolas Bendtner's £80,000 fine for displaying a sponsor on his underwear during a match.\n\nA number of football writers and pundits pointed out the lenient punishment showed why footballers may need to take action themselves by walking off the pitch in the face of racist abuse.\n\nAnti-racism charity Show Racism the Red Card tweeted: \"We want to see UEFA and domestic leagues investing more in anti-racism education programmes that can make a real difference to challenging racism in football and wider society.\"", "description": "'Disheartened, but not surprised': Football world reacts to Bulgaria's punishment for racism", "authors": ["Luke Hurst"], "top_image": "https://static.euronews.com/articles/stories/04/26/94/40/1000x563_cmsv2_9401895c-b018-5702-ba70-860ccdc18e1d-4269440.jpg", "published_at": "2019-10-30"}