{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/the-crisis-of-catholic-leadership", "downloaded_at": "2019-10-22 20:42:02.836584+00:00", "title": "Catholic Church Statues & Finances -- Church Faces Crisis of Leadership", "language": "en", "text": "(Tony Gentile/Reuters)\n\nThe Church continues to hit new, dysfunctional lows — and the faithful are noticing.\n\nIn the last 48 hours there have been two big Vatican stories. First, revelations about the Holy See’s financial crisis; second, and more bizarrely, a furious dispute over statues being thrown into the Tiber. But really it’s all one story, the big story of contemporary Catholicism: a disastrous failure of leadership at the top of the Church.\n\nAdvertisement\n\nAdvertisement\n\nVatican finances may not usually be a subject to set the pulse racing, but the last month has been dramatic: Vatican police raided offices and confiscated computers, after finding — to quote a leaked search decree — “serious indications of embezzlement, fraud, abuse of office, money-laundering, and self-laundering.” Other leaks suggested that as much as $560 million of Catholics’ donations to the Vatican were invested in speculative deals that Vatican investigators described as “reckless.” The pattern, even at this early stage of the inquiry, is familiar: The faithful have trusted a leadership class that has done little to deserve their trust.\n\nIndeed, donations are already falling — partly because of the abuse crisis, where once again the Vatican has been less than transparent. In 2017 it emerged that Pope Francis had reduced sanctions against some abusers. Then last year, the Vatican’s former ambassador to the U.S. made a set of spectacular accusations, claiming there had been a concerted effort, featuring many senior figures up to and including the pope, to protect Cardinal Theodore McCarrick from numerous allegations of abuse. A letter from the Catholic Women’s Forum, bearing almost 50,000 signatures, asked for a Vatican response to the ambassador’s claims. None came.\n\nAdvertisement\n\nSilence and confusion have recently become Vatican trademarks, not least where doctrinal questions are concerned. For instance, an ambiguous papal document was used to claim that the Church now blesses divorce and remarriage; instead of clarifying that the Church could never do so, the Vatican allowed the confusion to grow, and when the pope did speak, he piled ambiguity on ambiguity.\n\nSomething similar happened with the female statues that ended up in the Tiber. On October 4, versions of these statues were used during a ceremony in the Vatican gardens to mark the start of a synod (meeting of bishops) on the Amazon region. As the pope looked on, the participants knelt and bowed before the statues. Cue two weeks of debate. Were they, as critics suggested, offering a kind of pagan worship to Mother Earth — or were they, as the statues’ defenders argued, paying an Amazon-flavored homage to the Virgin Mary? Only the Vatican could have given a full answer. But there was no explanation before or during the ceremony; when journalists requested one, they got a series of contradictory, sometimes maddeningly vague, answers. Meanwhile, versions of the statues have been paraded through St Peter’s Basilica, prominently displayed in the synod hall, and exhibited in a well-known Roman church — from which, in the early hours of yesterday morning, they were removed and hurled into the river. Things only reached this stage because the Vatican, in response to the sincere anxiety of many Catholics, refused to clarify what was going on.\n\nAdvertisement\n\nAdvertisement\n\nBut the Vatican isn’t always characterized by silence and inaction. Much of the time there is a frenzy for change, the ecclesiastical equivalent of a midlife crisis in which a man abandons his family, leaves the country, and tries to reinvent his personality from scratch. Out goes the Vatican’s cautious diplomacy and witness to human dignity; in comes an inexplicable desire to flatter Chinese dictator Xi Jinping, with one senior official declaring that “right now, those who are best implementing the social doctrine of the Church are the Chinese.” (Not a word on the Chinese government’s Uyghur internment camps.) Distinguished cardinals are removed without explanation, while newcomers are rapidly promoted only to fall from grace for offenses such as plagiarism and photo-doctoring. One of Rome’s great theological schools, the John Paul II Institute, is gutted and the faculty replaced with fresh faces, some of whom are best-known for attacking Catholic doctrine.\n\nAdvertisement\n\nAnd now, at the Amazon synod, there is another push for “reform,” inspired by radical theologians such as Bishop Fritz Lobinger. Under Lobinger’s scheme, outlined in a 1998 book, Catholics will no longer be chiefly served by seminary-trained priests; instead, every parish will be crowded with part-time clergy. “The word ‘priest’ will be nothing special,” Lobinger fantasized, “because there will be so many priests — the bus-driver, the bank-teller, the postmaster, the butcher.” For Lobinger and his ilk, women priests are a good idea, but the main thing is to reconstruct the priesthood and the sacraments. Figures such as Bishop Erwin Kräutler — a Lobinger fan, and an outspoken critic of Church teaching — are highly influential at the synod and propose, as a first step toward more revolutionary changes, the ordination of married men. If the synod does suggest such a move, it would be another episode that would test the loyalty of Catholics.\n\nSaint Robert Bellarmine, one of the giants of Catholic theology, observed that Catholics might end up having to “resist” a pope. Nobody, Bellarmine wrote, can “judge, punish, or depose” the pontiff: Catholics must acknowledge him as their lawful superior. But it may, in extraordinary circumstances, be right “to resist him, by . . . hindering the execution of his will.” Bellarmine was speaking theoretically. But for many Catholics, it is becoming a very practical distinction.", "description": "The Catholic Church continues to hit new, dysfunctional lows — and the faithful are noticing.", "authors": ["Dan Hitchens", "Robert Verbruggen", "Andrew C. Mccarthy", "Scot Bertram", "Jim Geraghty", "George Will", "Rich Lowry", "William Z. Nardi", "Katherine Timpf", "Read More"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2018/10/pope-francis-bow.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-22"}