{"pub": "marketwatch", "url": "https://marketwatch.com/story/stormy-start-to-october-has-stock-investors-worried-will-q4-be-deja-vu-all-over-again-2019-10-05", "downloaded_at": "2019-10-05 12:23:47.208904+00:00", "title": "Stormy start to October has stock investors worried: Will Q4 be ‘deja vu all over again’?", "language": "en", "text": "iStockphoto an ominous start to the quarter, but maybe not an end.\n\nIf you somehow forgot the stock market turmoil of the last few months of 2018, the first few days of this quarter may have been a stomach-churning reminder.\n\nBut there are some fundamental differences now compared to then, analysts say, and while it doesn’t necessarily guarantee smooth sailing, it’s also possible we’ll avoid the worst of last year’s market carnage.\n\nAs a refresher: the Dow Jones Industrial Average DJIA, +1.42% opened on October 1, 2018 at 26,598. Three months later, shell-shocked traders were rummaging for dusty “Dow 24,000” sunglasses, with the index down 12%.\n\nPut another way, as of Tuesday this week, all three U.S. stock indexes were up handily since the start of the calendar year, but over the past 12 months, with the dismal showing from last year’s fourth quarter baked in, they were negative.\n\nRelated: Here’s how ugly 2018 was for stocks and other assets\n\nThe first two trading days of this quarter may have raised grim memories of last year, with major indexes off to the worst start of a quarter since the global financial crisis of 2008. But there are some important distinctions to draw.\n\n“The Fed paused,” said Chris Dillon, capital markets investment specialist for T. Rowe Price.\n\nThroughout 2018, as the Federal Reserve raised interest rates and allowed its balance sheet to shrink, liquidity evaporated from financial markets. Many investors expected policy makers to keep raising rates – with one hike in December 2018 and perhaps as many as four in 2019, Dillon noted. “We were looking at that and thinking, this is going to be bad for stocks and pull us into a recession. We felt like if the Fed paused, it would reverse the liquidity problem.”\n\nIndeed, with interest rate rises on hold at the start of this year, stocks bounced back. Over the first few months of this year, the yield on the 10-year Treasury note was roughly flat, while stocks recovered most of the ground they’d lost in the fourth quarter.\n\nSee: Investors got spooked by the Christmas market massacre, new fund flow data shows\n\nThen in May news that progress on an expected U.S.-China trade deal had stalled, and the trouble began again with President Trump announcing further import tariffs. Markets have swung on every development in the ongoing trade negotiations since then, and businesses have put expansion plans on hold. Now, Dillon said, “the uncertainty is cutting into the data, and it’s the data that makes the Fed move.”\n\nCentral bank policy may help juice markets, but Diane Jaffee, senior portfolio manager at TCW, is focused on the real economy. Despite recent dismal readings on business activity in the manufacturing and services sectors, Jaffee said, “it’s all about the consumer, consumer, consumer.” For now, despite all odds, the consumer is still strong, though confidence bears watching.\n\nJaffee points to indicators like homebuilder Lennar Corp.’s LEN, +1.67% earnings beat and strong guidance for the early innings of the current quarter . She also takes comfort from comments from Home Depot HD, +0.49% CEO Richard McPhail, who said early in September that the company’s sales metrics provide recession signals a few quarters away. For example, same-store sales growth was ““essentially zero in the year 2000” before the 2001 recession, McPhail said at a conference. “We’re not seeing it right now.”\n\nEven better, while central banks across the globe have bemoaned the lack of fiscal support to help them out, the U.S. economy may benefit over the coming months from a widening government budget deficit. Most retailers are planning to hire at least as many temporary workers for the holiday season as last year, Jaffee pointed out. And the National Retail Federation forecasts a solid 4% increase in sales this year compared to last. Hiring by the government to conduct the U.S. census will also provide a little boost to the economy.\n\n“I think this pushes out the idea of a recession,” Jaffee told MarketWatch. “We can look past the holiday at least into Q2 before we have to start being concerned about economic data.”\n\nRead: Here’s how to play the trade war with ETFs\n\nJaffee expects “flat” corporate earnings growth for the third quarter. The reporting period kicks off October 15 with JPMorgan Chase & Co. JPM, +2.17% and Wells Fargo & Company WFC, +1.51%. But in some other areas, she thinks better year-over-over comparisons may be a boon for investors.\n\nThere’s been a lot of concern about lower oil prices in the wake of the Saudi bombing, for example, but at $52, West Texas crude CLX19, +1.07% is higher than it was last November.\n\nTo be sure, some analysts take a less-rosy view. FTN Financial’s Chris Low has argued for the Fed to make “aggressive cuts” in interest rates for the past month, and repeated that call in a note out after the September factory data.\n\n“We argued it was necessary to get ahead of the markets in September or it would be necessary to make deeper cuts in the fourth quarter,” Low wrote. “September is a terrific example of the Fed giving the market what it expects and the market reacting with disappointment. The sharp drop in breakeven inflation expectations after the rate cut sent the unmistakable message traders had priced in exactly what the Fed intended to do, but nevertheless thought the Fed’s action was inadequate.”\n\nRelated: Central bankers now know: hang together or most assuredly hang separately\n\nLow continued: “The Fed missed their September opportunity, but it is not necessarily too late to act forcefully in October. Keep kicking the can with timid policy responses for too long, however, and there will be a recession.”\n\nT. Rowe’s Dillon splits the difference. He thinks earnings growth may be about 4%, but isn’t sure how markets will respond to results like that, especially in the face of “geopolitical unknowns and atrophying data.”\n\nThat sets up “an uncertain intersection” between central bank support and “deteriorating economic fundamentals,” that will result in “choppy” markets, Dillon said.\n\nIn the week ahead, investors may get some early clues on the U.S. - China trade dispute also, as high-level talks resume Thursday in Washington. On tap next week too: data on September consumer price inflation.\n\nRelated: Predicting what happens next in stocks will get trickier as markets navigate a roller coaster of big events", "description": "As the fourth quarter gets off to the worst start for stocks since the financial crisis of 2008, memories of last year’s fourth quarter may haunt investors,...", "authors": ["Andrea Riquier"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GB935_MLMani_ZG_20180117174328.jpg", "published_at": "2019-10-05"}