{"pub": "reuters", "url": "https://reuters.com/article/us-bankofamerica-results/bank-of-america-beats-profit-estimates-on-surge-in-advisory-lending-idUSKBN1WV1DM", "downloaded_at": "2019-10-16 23:17:59.884773+00:00", "title": "Bank of America beats profit estimates on surge in advisory, lending", "language": "en", "text": "(Reuters) - Bank of America Corp (BAC.N) beat Wall Street estimates for quarterly profit on Wednesday as it earned more in advisory fees and its loan book expanded, easing concerns that lower interest rates would crimp growth at the second-largest U.S. bank.\n\nFILE PHOTO: People withdraw money from Bank of America ATMs in New York U.S., July 16, 2018. REUTERS/Lucas Jackson/File Photo\n\nThe lender’s shares rose 3% as consumer banking, BofA’s biggest business, showed strength in the face of worries over slowing economic growth and added to signs from JPMorgan (JPM.N) and Citigroup (C.N) that U.S. household finances remained healthy.\n\n“In a moderately growing economy, we focused on driving those things that are controllable,” Chief Executive Brian Moynihan said. “Across nearly every line of business, we were seeing strong customer activity.”\n\nOn a conference call with analysts, BofA’s top executives warned about challenges from lower interest rates and expectations of further cuts, but remained confident about meeting its earlier forecast of 1% growth in full-year net interest income.\n\nSince 2015, Wall Street’s marquee banks have benefited from higher interest rates, as they could afford to charge more interest on loans, without having to significantly raise payouts on deposits.\n\nHowever, this year, markets have been buffeted trade tensions and a weakening global economy, forcing the Federal Reserve to cut rates twice this quarter.\n\nBank of America is the most vulnerable among the big U.S. banks to fluctuations in interest rates because of its large deposit stock and rate-sensitive mortgage securities.\n\nBofA took a small hit on its spread and reported a 4 basis-point decrease in its interest margin to 2.41% for the third quarter. But a 5% growth in overall loans helped it overcome the impact of lower rates.\n\nAlong with that, strong performance in investment banking and equities trading boosted total revenue past Wall Street expectations.\n\nRevenue from investment banking fees jumped 40%, while consumer banking revenue rose 3%. The bank’s equity trading business outperformed its peers with a 13% jump.\n\nNet interest income also came in higher at $12.34 billion and accounted for more than half of its total revenue.\n\nNet income applicable to common shareholders fell 21% to $5.27 billion, or 56 cents per share, hit by a $2 billion impairment charge. Excluding the charge, the bank earned 75 cents per share.\n\nRevenue, net of interest expense, rose slightly to $22.96 billion.\n\nAnalysts were expecting a profit of 51 cents per share and revenue of $22.79 billion, according to IBES data from Refinitiv.", "description": "Bank of America Corp beat Wall Street estimates for quarterly profit on Wednesday as it earned more in advisory fees and its loan book expanded, easing concerns that lower interest rates would crimp growth at the second-largest U.S. bank.", "authors": ["Anirban Sen", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191016&t=2&i=1441473043&w=1200&r=LYNXMPEF9F11Z", "published_at": "2019-10-16"}