{"pub": "reuters", "url": "https://reuters.com/article/us-wework-ipo-breakingviews/breakingviews-all-the-we-company-needs-now-is-enlightenment-idUSKBN1WH2GT", "downloaded_at": "2019-10-03 07:47:41.252011+00:00", "published_at": "2019-10-02", "title": "Breakingviews - All The We Company needs now is enlightenment", "language": "en", "text": "WeWork logos are seen at a WeWork office in San Francisco, California, U.S. September 30, 2019. REUTERS/Kate Munsch\n\nNEW YORK (Reuters Breakingviews) - The We Company’s prospectus for its flotation said its mission was “to elevate the world’s consciousness.” Having now abandoned its stock offering and its shamanic leader, the parent of shared-office provider WeWork has at least understood that self-realization is integral to that calling. But it needs more than greater awareness to ensure its survival.\n\nThe New York-based outfit’s investors, including Japan’s SoftBank and its Saudi Arabia-funded Vision Fund, have also cut loose the once revered chief executive, Adam Neumann. His barefoot, weed- and tequila-fueled charisma made him the kind of figure venture-capital investors love to back – until they don’t. In private funding rounds, WeWork’s value ballooned to $47 billion.\n\nSome investment banks involved in the initial public offering pitched possible valuations that were much higher. It wasn’t to be: Investors balked at the company’s private-market worth, half of that figure, and half again, before the operation was formally aborted just this week.\n\nAside from the increasing frequency of reports about Neumann’s weird behavior and self-dealing, they may have taken the unimaginative but realistic view that WeWork was a heavily money-losing real-estate company – a trendier version of IWG, the profitable but mundane Regus operator – rather than a consciousness-elevating technology play.\n\nNewly named Co-CEOs Artie Minson, the former finance chief, and Sebastian Gunningham, previously vice-chairman, have already decided to offload some sideline businesses, dramatically slow WeWork’s previously headlong growth, and get rid of Neumann’s top acolytes. Their challenge will be to show that the company can, in time, turn a profit.\n\nThat’s more than a nice-to-have. A Breakingviews calculator showed that even using generous assumptions, WeWork could burn through another $15 billion within a few years. The IPO was supposed to raise at least $3 billion, and that would have unlocked another $6 billion in debt. Minson and Gunningham will still need to raise billions, even on a less aggressive trajectory.\n\nA new Breakingviews e-book recaps how they got here – and some of the consequences. Only future chapters will conclude whether The We Company really managed to change the future of work or became the poster child for the private-market boom and bust.", "description": "NEW YORK (Reuters Breakingviews) - The We Company’s prospectus for its flotation said its mission was “to elevate the world’s consciousness.” Having now abandoned its stock offering and its shamanic leader, the parent of shared-office provider WeWork has at least understood that self-realization is integral to that calling. But it needs more than greater awareness to ensure its survival.", "authors": ["Richard Beales", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191002&t=2&i=1436396758&w=1200&r=LYNXMPEF911SR"}