{"pub": "thehill", "url": "https://thehill.com/policy/technology/366494-library-of-congress-will-no-longer-collect-every-public-tweet", "downloaded_at": "2019-10-05 13:29:40.112138+00:00", "title": "Library of Congress will no longer collect every public tweet", "language": "en", "text": "The Library of Congress announced on Tuesday that it will no longer archive every tweet posted publicly on Twitter.\n\nThe library had reached an agreement with Twitter in 2010 to acquire the text of every public tweet posted, but now it says it will only collect posts on a “selective basis.”\n\nIn a white paper released on Tuesday, the library said that the shift is due in part to Twitter’s recent decision to double the character limit on tweets and to the increased volume of posts since the agreement was first reached.\n\nADVERTISEMENT\n\nThe increased use of images in tweets was also cited. Under the archiving agreement, Twitter only sent the text of its public tweets.\n\n“The Library generally does not collect comprehensively,” the white paper reads. “Given the unknown direction of social media when the gift was first planned, the Library made an exception for public tweets. With social media now established, the Library is bringing its collecting practice more in line with its collection policies.”\n\nThe report did not include the criteria for how it will select tweets to archive, but it said that in general \"the tweets collected and archived will be thematic and event-based, including events such as elections, or themes of ongoing national interest, e.g. public policy.\"\n\nThe change will go into effect on Dec. 31, and the library will hold on to its archive of every public tweet posted during the first 12 years of Twitter’s existence.\n\nThe library has not yet allowed public access to the collection.", "description": "The Library of Congress announced on Tuesday that it will no longer archive every tweet posted publicly on Twitter.", "authors": [], "top_image": "https://thehill.com/sites/default/files/twitter_080217getty.jpg", "published_at": "2017-12-26"}