{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7601519/Woman-says-sexually-assaulted-ICE-agent.html", "downloaded_at": "2019-10-23 09:16:51.904635+00:00", "title": "Lawsuit: ICE agent threatened immigrant, raped her for years", "language": "en", "text": "An immigration agent threatened a Honduran woman living in Connecticut with deportation if she didn't have sex with him, then raped her as often as four times a week for seven years, impregnating her three times, a federal lawsuit alleges.\n\nThe woman, identified in the lawsuit only as Jane Doe, sued the U.S. Department of Homeland Security, U.S. Immigration and Customs Enforcement and former ICE agent Wilfredo Rodriguez on Saturday. She is seeking $10million in damages.\n\n'My only comment is that my client had a choice, cooperate with ICE or be deported with her family,\" George Kramer, the woman's lawyer, said in an email.\n\n'She remains in a very fragile psychological state. She is not only seeking compensation for the physical and emotional damage she suffered but to change the way those who are cooperating with ICE are treated by those in a position of power and who often wield total control over the ability to remain in the United States.'\n\nAn ICE spokesman said he couldn't comment on litigation but confirmed Rodriguez no longer works for the agency. Homeland Security didn't immediately return a call seeking comment.\n\nImmigration and Customs Enforcement (ICE) agents look on as undocumented man is questioned at the border between San Diego and Mexico. File photo from February 2015\n\nTom Carson, a spokesman for the U.S. attorney's office in Connecticut, said he could not comment on whether there has been or will be a criminal investigation.\n\nThe woman first met Rodriguez in 2006 after her brother was arrested for entering the U.S. illegally, according to the lawsuit.\n\nRodriguez found out she was also living in the country illegally and said that to avoid being deported, she had to become an informant and help the agency locate criminals ripe for deportation. She did her job, according to the lawsuit, pointing ICE to three men living in the U.S. illegally who had stabbed her husband.\n\nBut that wasn't enough for Rodriguez, the lawsuit indicates.\n\nAt one point, while trying to locate someone in 2007, Rodriguez told the woman to go to a motel and tried to have sex with her, the lawsuit claims. When she refused, she says in the lawsuit, he covered her mouth, threw her on the bed, put his gun next to her and said that if she opened her mouth, he would use it. Then, she says, he raped her.\n\nAn ICE agent about to raid alleged immigration violators in Salem, OH in June 2018, as a lawsuit is filed against one former ICE agent for threatening a Honduras woman to have sex with him or face deportation\n\nHe called himself 'The Wolf' and said he was the reason she and her family weren't deported, she says in the lawsuit.\n\nThe woman alleges she first became pregnant by Rodriguez in 2007, then again in 2009 and a third time in 2013. She had an abortion each time, she said in the lawsuit, and Rodriguez paid for one of them.\n\n'There was no question' that was she was pregnant by Rodriguez and not her husband, the lawsuit said.\n\nThe abuse continued unabated, she says.\n\nHe made her perform oral sex on him and participate in 'abhorrent sexual behavior,' the lawsuit states. He would constantly remind her that he was the 'wolf' and threaten to kill her and her family, she says.\n\nShe attempted suicide four times, the lawsuit says.\n\nIn 2014, while working at her job in construction, she received a call. It was Rodriguez, demanding to see her, and she knew it would be for sex, she says. She was so shaken that she fell off a ladder after hanging up and seriously injured her neck, back and ribs.\n\nShe underwent surgery and tried to use it as an excuse not to see Rodriguez - but it didn't deter him, the lawsuit says.\n\nLater, he told her that he was leaving the agency but that if she told anyone what happened, 'she and her family would pay,' according to the lawsuit.\n\nThe woman finally told her story last year when her father, living in the U.S. and fearing deportation because of her friendliness with ICE, applied for asylum. She opened up to an agent who approached her about her father's application, the lawsuit says.\n\nThe agent, she says, suggested she consult an attorney.", "description": "A Honduran woman living in Connecticut claims a former ICE agent, Wilfredo Rodriguez, raped her many times over a span of several years. The lawsuit says he impregnated the woman three times.", "authors": ["Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/03/20063950-0-image-a-18_1571797230937.jpg", "published_at": "2019-10-22"}