{"pub": "indiatimes", "url": "https://indiatimes.com/entertainment/islam-isn-t-so-weak-shabana-azmi-hits-back-after-people-troll-shah-rukh-khan-for-wearing-tilak-378755.html", "downloaded_at": "2019-10-28 13:21:58.160584+00:00", "title": "Islam Isn’t So Weak, Shabana Azmi Hits Back After People Troll Shah Rukh Khan For Wearing Tilak", "language": "en", "text": "And once again Shah Rukh Khan is getting trolled for celebrating Diwali. This time when the superstar posted a picture sporting a tilak, he was called a “fake muslim” by some of the people on social media.\n\nTwitter\n\nThis isn’t the first time, Shah Rukh Khan has been trolled by narrow minded people. He has earlier been trolled for worshipping Lord Ganesha.\n\nPooja done....Visarjan done. Ganpati Bappa Morya!! May the happiness of the world and beyond come into every household & for every family. pic.twitter.com/D8pKXtZk3K — Shah Rukh Khan (@iamsrk) September 12, 2019\n\nThis time as well, trolls said that it was shameful that despite being a Muslim he was wearing a Tilak. While people called him fake muslim, Shabana Azmi who is also a Muslim took a stand for him.\n\nDon't Miss 1.7 K SHARES 487 SHARES 837 SHARES 3.1 K SHARES 635 SHARES\n\nGiving it back to the trolls, Shabana Azmi wrote on Twitter, \"Appalled to read that@iamsrk Diwali greeting invites wrath of rabid Islamists, gets called a “False Muslim” for sporting a tilak!”FUNDOS get a life! Islam is not so weak that it stands threatened by what is a beautiful Indian custom.Indias beauty is in her GangaJamuni tehzeeb.\"\n\nAppalled to read that @iamsrk Diwali greeting invites wrath of rabid Islamists, gets called a “False Muslim” for sporting a tilak!”FUNDOS get a life! Islam is not so weak that it stands threatened by what is a beautiful Indian custom.Indias beauty is in her GangaJamuni tehzeeb — Azmi Shabana (@AzmiShabana) October 28, 2019\n\nOn Saturday, actor Vishwa Bhanu, who has worked in movies like Special 26 and Mardaani, had appealed to Prime Minister Narendra Modi that his Muslim neighbours were hindering his Diwali celebration. He said that they wouldn’t let his wife make Rangoli and they even destroyed the lights.\n\nIndia is a Secular State. We have for long cherished secular fabric of the nation. Why do some people keep forgetting that?", "description": "And once again Shah Rukh Khan is getting trolled for celebrating Diwali. This time when the superstar posted a picture sporting a tilak, he was called a 'fake muslim' by some of the people on social media. And once again Shah Rukh Khan is getting trolled for celebrating Diwali. This time when the superstar posted a picture sporting a tilak, he was called a “fake muslim” by some of the people on so", "authors": ["Garima Satija"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/islam_isnt_so_weak_shabana_azmi_hits_back_after_people_troll_shah_rukh_khan_for_wearing_tilak_1572263798_800x420.jpg", "published_at": "2019-10-28"}