{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/09/heres-the-current-situation-with-huawei-and-the-mate-30", "downloaded_at": "2019-09-05 02:17:16.103771+00:00", "title": "Here's The Current Situation With Huawei And The Mate 30", "language": "en", "published_at": "2019-09-05", "text": "Image: Getty Images\n\nGoogle announced in August the Android OS would not be available on Huawei's upcoming Mate 30 series. Previous reports already confirmed Google was phasing out Android and hardware support for Huawei devices in response to President Trump's trade bans but this marked the first major phone release to fall under the ban hammer.\n\nWith the Mate 30 series set to launch in late September, let's take a look at how we got here and what the final release might look like.\n\nRIP Huawei Mate 30 Pro. We Hardly Knew Ye If you've been eyeing the Huawei Mate 30 Pro as a potential phone replacement, you might want to reconsider. Google has confirmed that the model will be banned from using Google-licensed apps and services. At the very least, this means no Play Store access, no Google applications and no Android 10. In other words, when it comes to non-Chinese markets like Australia, the Huawei Mate 30 will almost certainly be dead on arrival. (And it had such a pretty camera too. Sigh.) Read more\n\nHow did Huawei get to this point?\n\nTo understand why Huawei is facing the full brunt of the US and China trade war, we'll have to take a quick look at some of the relevant movements that led us to this point.\n\nIn August 2018, a federal law signed by US President Donald Trump came into effect banning the US Government from purchasing equipment from Chinese vendors like Huawei or ZTE due to security concerns regarding the suspicion of cyber espionage. Australia also entered the fray banning Huawei's building of infrastructure for a 5G network in mid-2019.\n\nThe issues raised are in regards to close ties between both Huawei and ZTE and the Chinese government. There are fears the Chinese government could use Huawei and ZTE's infrastructure to spy on foreign governments and their citizens. Huawei denies these allegations.\n\nA few months later in December 2018, Huawei's CFO Meng Wenzhou was arrested in Canada at the request of US authorities. It's alleged Wenzhou, who's also the daughter of Huawei founder Ren Zhengfei, violated US sanctions against Iran, with the US later pressing charges of fraud. The court case is ongoing.\n\nSince then, the trade war between the US and China has only worsened. The Trump Administration first imposed tariffs on imported Chinese goods in July 2018 and China responded in kind. The tariffs totalled more than $50 billion in goods, according to the BBC. Duties of up to 25 per cent on a number of imported Chinese goods were applied by the US while China's tariffs ranged between five and 25 per cent on US products.\n\nFrom September 1 2019, the US introduced a fresh round of tariffs, including on US products manufactured in China (like the Apple Watch) and on products made by Chinese-owned companies (like the Huawei Mate 30.)\n\nIn response to the worsening trade wars and Trump's bans on US companies working with China, Google announced it was suspending business with Huawei in May 2019. Google said it would continue to support existing Huawei users by allowing them to use and download app updates provided by Google.\n\n\"We are complying with [Trump's] order and reviewing the implications,\" the Google spokesperson said to Reuters.\n\nThis was in response to Trump's executive order on May 15, effectively blacklisting US companies from working with Chinese ones. US companies can apply for special licences in order to work with Chinese businesses but Reuters has reported since the ban came into effect in mid-May, none of the more than 130 licence applications to sell US goods to Huawei have been granted.\n\nAt the G20 Summit in July 2019, Trump then announced he would lift the ban and allow companies like Google and Qualcomm to continue business as usual with Chinese businesses like Huawei. The thing is, the Temporary General Licence that lifted the ban would only last for 90 days.\n\nIt was suspected Huawei and Google would have enough time to work together on the upcoming release of the Mate 30 series, allowing for an Android OS to be included in the final release. Google later confirmed it would not be the case and now we're left wondering what exactly Huawei plans to do.\n\nHuawei Google ban timeline: July 2018: Trump imposed steep tariffs on Chinese imports. China responds by putting tariffs on US imports into the country.\n\nTrump imposed steep tariffs on Chinese imports. China responds by putting tariffs on US imports into the country. August 2018: A US law outlining the federal government's 2019's fiscal year spending bans purchasing equipment from certain Chinese vendors like Huawei.\n\nA US law outlining the federal government's 2019's fiscal year spending bans purchasing equipment from certain Chinese vendors like Huawei. December 2018: Huawei vice-chairwoman and CFO Meng Wanzhou arrested in Canada, at the request of the US, on conspiracy allegations.\n\nHuawei vice-chairwoman and CFO Meng Wanzhou arrested in Canada, at the request of the US, on conspiracy allegations. May 2019: Google suspends business with Huawei following Trump's trade blacklisting.\n\nGoogle suspends business with Huawei following Trump's trade blacklisting. July 2019: Trump announces he'll relax Huawei ban.\n\nTrump announces he'll relax Huawei ban. September 2019: US imposed further tariffs on Chinese imports, including smartphones.\n\nUS imposed further tariffs on Chinese imports, including smartphones. September 2019: Google confirmed Android OS would not be on Mate 30 series.\n\nGoogle confirmed Android OS would not be on Mate 30 series. September 2019: Mate 30 series is due to be released.\n\nHow is the Mate 30 release now affected?\n\nAs mentioned, while some had initially hoped an Android OS would be included in the final release, thanks in part to Trump's temporary lift of the ban, Google has now confirmed to Reuters that's not the case.\n\nThis means the Mate 30 series will forge ahead with its September 20 release, though it's not yet clear when devices will actually hit stores. It's possible if Google applies for a licence to work with Huawei, it might have some sort of Google-supported functionality but what that might look like is anyone's guess for now.\n\nDid you get it right? The countdown to #HuaweiMate30 starts now!\n\nWe're going full circle in Munich on 19.09.2019.\n\nJoin us live: https://t.co/9ugi5gG9ci#RethinkPossibilities pic.twitter.com/etRYjrBVEC — Huawei Mobile (@HuaweiMobile) September 1, 2019\n\nLifehacker Australia has reached out to Huawei to confirm what's in store.\n\nThe future of Huawei\n\nIt's hard to see the light at the end of the tunnel for Huawei right now with blow after blow being delivered by the trade war between China and the US, but there is one. Huawei has made no secret it's planning to release its own operating system called HarmonyOS, which will likely come on the Mate 30 series. While some suspect it's not yet fully-formed and has a serious shortage of apps compared with Google Play Store, it's the company's only path forward if the situation doesn't improve.\n\nSo, for existing Huawei users in Australia, don't throw your devices in the dumpster just yet. While it might be best to wait until the Mate 30 series launches to see what's in store, Huawei's future isn't dead in the water just yet. Trump's decisions, which is what it's mostly coming down to, have already faced a few back-and-forths, so, with any luck, they might not be permanent ones.", "description": "Google announced in August the Android OS would not be available on Huawei's upcoming Mate 30 series. Previous reports already confirmed Google was phasing out Android and hardware support for Huawei devices in response to President Trump's trade bans but this marked the first major phone release to fall under the ban...", "authors": ["Chris Jager", "Alex Kidman"], "top_image": "https://edge.alluremedia.com.au/m/l/2019/09/Huawei-Mate-30.jpg"}