{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/prince-harrys-sweet-reassuring-comment-20589974", "downloaded_at": "2019-10-16 14:03:14.726203+00:00", "title": "Prince Harry's sweet reassuring comment to Meghan Markle about post-pregnancy appearance", "language": "en", "text": "Get the biggest Royal Family stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nIt's clear for everyone to see how much Prince Harry loves his wife Meghan Markle , and he often gushes about the amazing women he has married.\n\nUnlike other members of the Royal Family, the couple are very affectionate towards each other while out and about on official engagements and fans around the world love seeing their sweet PDAs.\n\nBut his latest adorable comment has melted hearts as the Duke appeared to reassure Meghan about how she looks after having a baby.\n\nDuring their special appearance at the WellChild Awards last night the couple met 10-year-old Emmie Narayan-Nicholas who has Leukemia.\n\n(Image: UK Press via Getty Images)\n\nShe won an award for her idea to set up a restaurant at the hospital where patients and their families could enjoy a three-course meal and took her mum Eve along with her to the glitzy event.\n\nSpeaking about her chat with Meghan and Harry, Eve said: \"When she sat down, I said ‘oh you look amazing and you’ve just had a baby.’\n\n\"Harry looked at her and went ‘See I told you!’ in a way that we would...It did feel like they were very down to earth.\"\n\nHow sweet!\n\n(Image: POOL/AFP via Getty Images)\n\n(Image: POOL/AFP via Getty Images)\n\nIt was an emotional night for Harry and he broke down while talking about Meghan's pregnancy during his speech.\n\nHe said: \"My wife and I feel incredibly privileged to be able to join you once again at this year’s WellChild Awards, and to be in a room with such amazing human beings.\n\n\"It has been over a decade since I first came to these Awards and every year they never fail to surprise and inspire me.\n\n\"Yet this year, it resonates in a different way, because now I’m a father.\n\n(Image: Getty Images)\n\n(Image: Getty Images)\n\n\"Last year when my wife and I attended we knew we were expecting our first child - no one else did at the time, but we did - and I remember…\"\n\nHe trailed off as his eyes welled up and host Gaby Roslin stepped forward to put an arm around him and rub his arm reassuringly and hold his hand briefly behind his back.\n\n(Image: REUTERS)\n\n“Sorry,” he laughed, before continuing: “I remember squeezing Meghan’s hand so tight during the awards, both of us thinking what it would be like to be parents one day, and more so, what it would be like to do everything we could to protect and help our child should they be born with immediate challenges or become unwell over time.\n\n“And now, as parents, being here and speaking to all of you pulls at my heart strings in a way I could have never understood until I had a child of my own.”", "description": "Meghan Markle was given a lovely compliment from a well-wisher at the WellChild Awards last night, and loving husband Prince Harry jumped in with his own sweet remark", "authors": ["Zoe Forsey", "Image", "Uk Press Via Getty Images", "Pool Afp Via Getty Images", "Getty Images", "Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20587521.ece/ALTERNATES/s1200/1_BRITAIN-ROYALS.jpg", "published_at": "2019-10-16"}