{"pub": "realclearpolitics", "url": "https://theblaze.com/news/dave-rubin-is-bringing-his-show-to-blaze-tv", "downloaded_at": "2019-09-04 23:48:16.961145+00:00", "published_at": "2019-09-04", "title": "Breaking: Dave Rubin bringing The Rubin Report to BlazeTV", "language": "en", "text": "Talk show host and comedian Dave Rubin announced that he is bringing his popular show to the BlazeTV platform.\n\nThe announcement was made on Tuesday with Glenn Beck, founder of TheBlaze.com, via a live-stream from his YouTube channel.\n\n\"I just don't buy the YouTube game anymore,\" said Rubin, after citing problems with the platform over free speech.\n\n\"We have to be ubiquitous,\" responded Beck.\n\nRubin explained that BlazeTV paid subscribers would receive early access to video episodes of The Rubin Report. Rubin's current subscribers will receive an extended trial to BlazeTV.\n\nThe comedian often recounts his journey from a left leaning progressive to a free-thinking libertarian, and cites the dangerous level of political correctness and groupthink of the modern left-wing movement. He also has a degree in political science.\n\nIn addition to the agreement with BlazeTV, Rubin announced that he was working to create an app for a membership subscription to his show.\n\nRubin's YouTube channel has garnered more than 222 million views.\n\n\"Dave is an exceptional talent, who - especially at a time when honest conservative and independent voices are being censored or shadow banned - has made invaluable contributions to the national conversation by conducting honest and thoughtful interviews on his weekly program The Rubin Report,\" said Blaze Media CEO Tyler Cardon. \"Dave has been a friend of the network for years, and we couldn't be more thrilled to bring his content to our rapidly expanding audience.\"\n\nHere's the video of the announcement:", "description": "Dave Rubin and BlazeTV are joining forces", "authors": ["Carlos Garcia"], "top_image": "https://theblaze-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F21078406%2F1200x600.jpg/2000%2C2000/jnkqPhJpzmtMrkze/img.jpg"}