{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/trump-william-barr-attorney-general-fbi-cia-investigation-impeachment-ukraine-a9127356.html", "downloaded_at": "2019-10-01 11:46:17.374118+00:00", "title": "William Barr: Trump’s attorney general personally asked foreign officials to aid investigation into CIA and FBI", "language": "en", "text": "William Barr, the US attorney general, held private meetings overseas with foreign intelligence officials seeking their help in a Justice Department inquiry that Donald Trump hopes will discredit US intelligence agencies' examination of possible connections between Russia and members of his presidential campaign during the 2016 election, according to people familiar with the matter.\n\nMr Barr's personal involvement is likely to stoke further criticism from Democrats pursuing impeachment that he is helping the Trump administration use executive branch powers to augment investigations aimed primarily at the president's adversaries.\n\nBut the high-level Justice Department focus on intelligence operatives' conduct will likely cheer Mr Trump and other conservatives for whom \"investigate the investigators\" has become a rallying cry.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nMr Barr has voiced his own concerns, telling lawmakers in April that he believed \"spying did occur\" when it came to the US investigation of the Trump campaign.\n\nThe direct involvement of the nation's top law enforcement official shows the priority Mr Barr places on the investigation being conducted by John Durham, the US attorney in Connecticut, who has been assigned the sensitive task of reviewing US intelligence work surrounding the 2016 election and its aftermath.\n\nShape Created with Sketch. Mueller investigation: The key figures Show all 12 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Mueller investigation: The key figures 1/12 Robert Mueller is the special counsel overseeing the investigation into Russia's meddling in the 2016 election, and potential obstruction of justice by the president. Mr Mueller has a pristine reputation in Washington, where he was previously in charge of the FBI. Throughout his investigation, he and his team have been notoriously tight lipped about what they know and where their investigation has led. REUTERS 2/12 Former FBI director James Comey was the catalyst that led to the appointment of special counsel Robert Mueller. Mr Comey was fired by the president after Mr Trump reportedly asked him to drop his own Russia investigation. Mr Trump has long maintained that the investigation is a \"witch hunt\". AFP/Getty Images 3/12 Deputy attorney general Rod Rosenstein had authority over the special counsel investigation for much of the two years it has been active. Mr Rosenstein found himself with that responsibility after then-attorney general Jeff Sessions recused himself from that oversight. AP 4/12 Attorney general Jeff Sessions's decision to recuse himself from oversight of the special counsel investigation may have cost him his job in the end. Mr Sessions resigned last year, after weathering a contentious relationship with Donald Trump who vocally criticised his attorney general for taking a step back. Mr Sessions recused himself from the oversight citing longstanding Justice Department rules to not be involved in investigations overseeing campaigns that officials were apart of. AP 5/12 Attorney General William Barr is currently responsible for oversight of the special counsel investigation. Mr Barr's office will be the first to receive the Mueller report when it is finished. His office will then determine what portion or version of that report should be delivered to Congress, and also made public. EPA 6/12 Michal Cohn is the president's former personal lawyer, who has been helping the special counsel investigation as a part of a plea deal over financial crimes, and campaign finance crimes, he has pleaded guilty to. Among those crimes, Cohen admitted to facilitating $130,000 in hush money payments to adult film actress Stormy Daniels during the 2016 campaign. Cohen has said he did so at the direction of Mr Trump. Cohen has also admitted that he maintained contacts with Russian officials about a potential Trump real estate project in Moscow for months longer than Mr Trump and others admitted. The talks continued well into 2016 during the campaign, he has said. AP 7/12 Stormy Daniels has alleged that she had an affair with Donald Trump in 2006, soon after Melania Trump gave birth to Baron Trump. The accusation is of particular importance as a result of the $130,000 hush money payment she received to keep quiet about the affair during the 2016 campaign. AP 8/12 Paul Manafort was Donald Trump's former campaign chairman. Manafort was charged alongside Rick Gates for a slew of financial crimes, and was convicted on several counts in a Virginia court. He then pleaded guilty to separate charges filed in a Washington court. Manafort has been sentenced to just 7.5 years in prison for his crimes — in spite of recommendations from the special counsel's office for a much harsher sentence. AP 9/12 George Papadopoulos was one of the first individuals associated with the Trump campaign to be charged by the Mueller probe. He ultimately received a 14 day prison sentence for lying to investigators about contacts he had with Russian officials. AP 10/12 Roger Stone is a well known political fixer and operative, who has made a name for himself for some dirty tactics. He has been charged by the Mueller probe earlier this year, and he has been said to have had prior knowledge that WikiLeaks planned on publishing stolen emails from the Hillary Clinton campaign in 2016. Getty Images 11/12 Rick Gates was charged alongside former Trump campaign chairman Paul Manafort for a range of crimes. Gates, who worked alongside Manafort for a pro-Russia Ukrainian political party. The two were charged with conspiracy and financial crimes. Gates pleaded guilty. AP 12/12 Former national security adviser Michael Flynn was one of the first casualties of the Russia scandal, and was forced out of his position in the White House weeks after Donald Trump took office. Flynn pleaded guilty in 2017 to \"willfully\" making fraudulent statements about contacts he had with Russian officials including former Russian ambassador to the US Sergey Kislyak. Flynn then lied to Vice President Mike Pence about that contact. REUTERS 1/12 Robert Mueller is the special counsel overseeing the investigation into Russia's meddling in the 2016 election, and potential obstruction of justice by the president. Mr Mueller has a pristine reputation in Washington, where he was previously in charge of the FBI. Throughout his investigation, he and his team have been notoriously tight lipped about what they know and where their investigation has led. REUTERS 2/12 Former FBI director James Comey was the catalyst that led to the appointment of special counsel Robert Mueller. Mr Comey was fired by the president after Mr Trump reportedly asked him to drop his own Russia investigation. Mr Trump has long maintained that the investigation is a \"witch hunt\". AFP/Getty Images 3/12 Deputy attorney general Rod Rosenstein had authority over the special counsel investigation for much of the two years it has been active. Mr Rosenstein found himself with that responsibility after then-attorney general Jeff Sessions recused himself from that oversight. AP 4/12 Attorney general Jeff Sessions's decision to recuse himself from oversight of the special counsel investigation may have cost him his job in the end. Mr Sessions resigned last year, after weathering a contentious relationship with Donald Trump who vocally criticised his attorney general for taking a step back. Mr Sessions recused himself from the oversight citing longstanding Justice Department rules to not be involved in investigations overseeing campaigns that officials were apart of. AP 5/12 Attorney General William Barr is currently responsible for oversight of the special counsel investigation. Mr Barr's office will be the first to receive the Mueller report when it is finished. His office will then determine what portion or version of that report should be delivered to Congress, and also made public. EPA 6/12 Michal Cohn is the president's former personal lawyer, who has been helping the special counsel investigation as a part of a plea deal over financial crimes, and campaign finance crimes, he has pleaded guilty to. Among those crimes, Cohen admitted to facilitating $130,000 in hush money payments to adult film actress Stormy Daniels during the 2016 campaign. Cohen has said he did so at the direction of Mr Trump. Cohen has also admitted that he maintained contacts with Russian officials about a potential Trump real estate project in Moscow for months longer than Mr Trump and others admitted. The talks continued well into 2016 during the campaign, he has said. AP 7/12 Stormy Daniels has alleged that she had an affair with Donald Trump in 2006, soon after Melania Trump gave birth to Baron Trump. The accusation is of particular importance as a result of the $130,000 hush money payment she received to keep quiet about the affair during the 2016 campaign. AP 8/12 Paul Manafort was Donald Trump's former campaign chairman. Manafort was charged alongside Rick Gates for a slew of financial crimes, and was convicted on several counts in a Virginia court. He then pleaded guilty to separate charges filed in a Washington court. Manafort has been sentenced to just 7.5 years in prison for his crimes — in spite of recommendations from the special counsel's office for a much harsher sentence. AP 9/12 George Papadopoulos was one of the first individuals associated with the Trump campaign to be charged by the Mueller probe. He ultimately received a 14 day prison sentence for lying to investigators about contacts he had with Russian officials. AP 10/12 Roger Stone is a well known political fixer and operative, who has made a name for himself for some dirty tactics. He has been charged by the Mueller probe earlier this year, and he has been said to have had prior knowledge that WikiLeaks planned on publishing stolen emails from the Hillary Clinton campaign in 2016. Getty Images 11/12 Rick Gates was charged alongside former Trump campaign chairman Paul Manafort for a range of crimes. Gates, who worked alongside Manafort for a pro-Russia Ukrainian political party. The two were charged with conspiracy and financial crimes. Gates pleaded guilty. AP 12/12 Former national security adviser Michael Flynn was one of the first casualties of the Russia scandal, and was forced out of his position in the White House weeks after Donald Trump took office. Flynn pleaded guilty in 2017 to \"willfully\" making fraudulent statements about contacts he had with Russian officials including former Russian ambassador to the US Sergey Kislyak. Flynn then lied to Vice President Mike Pence about that contact. REUTERS\n\nThe attorney general's active role also underscores the degree to which a nearly three-year-old election still consumes significant resources and attention inside the federal government.\n\nCurrent and former intelligence and law enforcement officials expressed frustration and alarm on Monday that the head of the Justice Department was taking such a direct role in re-examining what they view as conspiracy theories and baseless allegations of misconduct.\n\nMr Barr has already made overtures to British intelligence officials, and last week the attorney general travelled to Italy, where he and Mr Durham met senior Italian government officials and Mr Barr asked the Italians to assist Mr Durham, according to one person familiar with the matter, who spoke on the condition of anonymity to discuss a sensitive issue. It was not Mr Barr's first trip to Italy to meet intelligence officials, the person said.\n\nThe Trump administration has made similar requests of Australia, said people who discussed the interactions on the condition of anonymity because they involve an ongoing investigation and sensitive talks between governments.\n\nIn a recent phone call, Mr Trump urged Scott Morrison, the Australian prime minister, to provide assistance to the ongoing Justice Department inquiry, the people said. Mr Trump made the request at Mr Barr's urging, they said. The Trump phone call was first reported by The New York Times.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nTrump administration officials defended the moves as above board.\n\nWhite House spokesperson Hogan Gidley said: \"I'm old enough to remember when Democrats actually wanted to find out what happened in the 2016 election. The Democrats clearly don't want the truth to come out anymore as it might hurt them politically, but this call relates to a DOJ inquiry publicly announced months ago to uncover exactly what happened. The DOJ simply requested the president provide introductions to facilitate that ongoing inquiry, and he did so, that's all.\"\n\nKerri Kupec, a Justice Department spokesperson, said, \"Mr Durham is gathering information from numerous sources, including a number of foreign countries. At attorney general Barr's request, the president has contacted other countries to ask them to introduce the attorney general and Mr Durham to appropriate officials.\"\n\nIn a statement, a spokesperson for the Australian government said it has \"always been ready to assist and cooperate with efforts that help shed further light on the matters under investigation. The [prime minister] confirmed this readiness once again in a conversation with the president.\"\n\nMr Trump still complains frequently that those involved in the investigation of his campaign should be charged with crimes, asserting the FBI search for possible election season collusion between Russia and Trump campaign officials was a witch hunt spurred by agents and bureaucrats opposed to him becoming president.\n\nThat investigation ended earlier this year when special counsel Robert Mueller determined there was insufficient evidence to charge any Americans with conspiring with Russia, and declined to reach a decision about whether the president had sought to obstruct justice.\n\nDavid Laufman, a former Justice Department official who was involved in the early stages of the Russia probe, said it was \"fairly unorthodox for the attorney general personally to be flying around the world as a point person to further evidence-gathering for a specific Justice Department investigation,\" and especially so in Mr Barr's case.\n\n\"Even if one questions, as a threshold matter, the propriety of conducting a re-investigation of the Justice Department's own prior investigation of Russia's interference, the appointment of John Durham - a seasoned, nonpartisan prosecutor - provided some reason to believe that it would be handled in a professional, nonpartisan manner,\" Mr Laufman said.\n\n\"But if the attorney general is essentially running this investigation, that entire premise is out the window.\"\n\nMr Barr's direct involvement in the effort also helps explain part of the controversial July phone call between Mr Trump and Volodymyr Zelensky, the Ukrainian president.\n\nA rough transcript of that call shows Mr Trump said he wanted Ukrainian assistance to help find out \"what happened with this whole situation with Ukraine,\" and possible involvement with the Democratic National Committee computer system that US agencies have determined was hacked by Russian intelligence ahead of the 2016 election.\n\nSome of the president's supporters have suggested Ukraine had a more direct role in the 2016 investigation than currently known, an assertion denied by current and former officials who were involved in the original probe.\n\nA person familiar with Mr Barr's interactions with foreign officials described them as being official introductions to Mr Durham. The attorney general \"is telling people he wants to make sure that the rules governing US agencies have been followed,\" this person said.\n\nA spokesperson for the CIA declined to comment, citing the ongoing review.\n\nA former senior US intelligence official who spoke on the condition of anonymity because of the ongoing investigation denied that the CIA was involved in monitoring any members of the Trump campaign.\n\nAny such operations were conducted by the FBI and were lawful, the former official said, emphasising that the CIA focused on Russia's interference in the election, and the role that Russian officials and intelligence agencies played.\n\nDemocrats are likely to bristle at the notion of the attorney general devoting personal time and energy to travelling overseas asking foreign countries to assist in an investigation of US agencies and personnel, particularly since Democrats have accused Mr Barr in the past of acting in Mr Trump's interests at the expense of the Justice Department's independence.\n\nLast week, House speaker Nancy Pelosi, D-Calif, accused the attorney general of \"going rogue\" after the Justice Department determined the substance of an explosive whistleblower's complaint - alleging that Mr Trump pressured Mr Zelensky to investigate Democratic presidential candidate Joe Biden and his son Hunter, over Hunter Biden's past position on the board of a Ukrainian energy company - did not merit a criminal investigation.\n\nHouse Democrats have launched an impeachment inquiry to further probe the interactions of Mr Trump and his lawyer with the Ukrainians.\n\nDuring the call with his Ukrainian counterpart, Mr Trump suggested that Mr Barr and his personal lawyer, Rudy Giuliani, could help Mr Zelensky's government investigate the matter.\n\nA spokesperson for Mr Barr has said the attorney general was unaware of any such effort, and had not spoken to the president about the issue, nor to Ukrainian authorities.\n\nMr Giuliani has met with Ukrainian officials and urged them to investigate the Bidens, but insists there is nothing improper about that. Mr Giuliani has declined to discuss Mr Durham's investigation.\n\nMr Barr's conversations with foreign counterparts have raised concerns among some intelligence officials that he may be seeking to substantiate conspiracy theories raised by some on the political right to defend Mr Trump.\n\nOne area that has been of sustained interest to Mr Barr and Mr Durham, according to people familiar with the matter who spoke on the condition of anonymity to discuss a sensitive issue, is a murky figure named Joseph Mifsud.\n\nMr Mifsud, a European academic, was publicly linked to Russian interference efforts in late 2017, when Mr Mueller revealed a guilty plea by former Trump campaign staffer George Papadopoulos, who admitted he had lied to the FBI about the details of his interactions with Mr Mifsud.\n\nThose conversations included an April 2016 meeting in which Mr Mifsud allegedly alerted Mr Papadopoulos that the Russians had \"dirt\" on Mr Trump's opponent, Hillary Clinton, in the form of thousands of emails.\n\nA version of that conversation was relayed to US authorities later that summer by an Australian diplomat who had talked to Mr Papadopoulos over drinks in London.\n\nShortly after his name surfaced publicly, Mr Mifsud told Italian media he did not work for Russia. \"I never got any money from the Russians: my conscience is clear,\" Mr Mifsud told La Repubblica. \"I am not a secret agent.\"\n\nSince then, the professor has disappeared from public life, leading to a host of theories about him and his whereabouts. While court papers filed in Mr Mueller's investigation suggested Mr Mifsud operated in Russia's interests, conservatives and conspiracy theorists have suggested he was instead aligned with Western intelligence agencies.\n\nIn an interview on Fox News in April, Mr Giuliani called Mr Mifsud \"a counterintelligence operative, either Maltese or Italian,\" who took part in what sounded to him like a \"counterintelligence trap\" against Mr Papadopoulos.\n\nIt is unclear what Mr Durham or Mr Barr have come to suspect about Mr Mifsud.\n\nMr Barr met with British officials in London over the summer to discuss the Durham probe, said a US official familiar with the matter, who spoke on the condition of anonymity because of the sensitive nature of the investigation.\n\nIn those conversations, according to this official, Mr Barr expressed a belief that the US investigation of Russian interference in the 2016 election stemmed from some corrupt origin, the official said.\n\nIt was not clear what Mr Barr thought was amiss, but he expressed a suspicion that information had been improperly gathered overseas about people connected with the Trump campaign, and that the British may have unwittingly assisted those efforts, the official said.\n\nAnother person familiar with Mr Barr's efforts denied that characterisation, saying he has been seeking cooperation for Mr Durham's work, and not trying to promote a particular theory or accusation against US agents and officers.\n\n\"It's well known within the intelligence community that you cannot ask another government to do something that you're prohibited from doing. That it is standard operating procedure,\" said a former national security official, who spoke on the condition of anonymity because of the ongoing investigation.\n\nAn executive order governing US intelligence activities states that no intelligence agency \"shall participate in or request any person to undertake activities forbidden\" by the order, which was issued in 1981.\n\nAs a young man, Mr Barr worked as a lawyer at the CIA and has an ongoing interest in intelligence matters, according to those who know him well.\n\nIn his public comments about the Russia interference investigation, he has suggested there were failures among former FBI leaders and that intelligence agency rules about spying on Americans should be scrupulously followed regardless of party affiliation.\n\nThere are two primary efforts underway to scrutinise the 2016 investigation and its aftermath.\n\nMichael Horowitz, the Justice Department inspector general, is expected to issue in the coming weeks a lengthy report analysing work done by the FBI and Justice Department to pursue alleged Russian election interference, and the applications for a Foreign Intelligence Surveillance Court order that approved electronic surveillance of the communications of Carter Page, a former Trump campaign adviser.\n\nSeparately, Mr Durham is taking a broader look at the actions of intelligence agencies overseas and domestically. Mr Durham has a long track record of being tasked with difficult investigations that involve the CIA or other intelligence agencies. His past investigations have often lasted years, so it's unclear when Mr Durham's review might wrap up, but it is unlikely to be soon, according to people familiar with the matter who like others spoke on the condition of anonymity to discuss a sensitive issue.\n\nBefore Mr Durham's appointment, another US attorney was tasked with reviewing the Clinton email investigation, but the results of that work are still unknown.\n\nThe multiple investigations show just how much the political conflict of 2016 continues to be an obsession within the government.\n\nLast week, The Washington Post reported that State Department security officials were re-examining aspects of the Clinton email investigation, in which State Department business was conducted on Mr Clinton's private server when she was secretary of state.\n\nThe Washington Post", "description": "William Barr, the US attorney general, held private meetings overseas with foreign intelligence officials seeking their help in a Justice Department inquiry that Donald Trump hopes will discredit US intelligence agencies' examination of possible connections between Russia and members of his presidential campaign during the", "authors": ["Devlin Barrett", "Shane Harris", "Matt Zapotosky"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/01/08/trump-barr.jpg", "published_at": "2019-10-01"}