{"pub": "news24", "url": "https://news24.com/World/News/trump-picks-william-barr-as-next-us-attorney-general-20181207", "downloaded_at": "2019-10-23 15:18:39.584061+00:00", "title": "Trump picks William Barr as next US attorney general", "language": "en", "text": "President Donald Trump said on Friday he had chosen former US Attorney General William Barr to once again lead the Justice Department, a role that would put him in charge of the federal probe into Russian election interference.\n\n\"He was my first choice since day one,\" Trump told reporters outside the White House.\n\nIf confirmed by the Senate, Barr would succeed Jeff Sessions, who was forced out by Trump last month. Sessions's chief of staff, Matthew Whitaker, is currently serving as acting attorney general. Barr would also oversee Special Counsel Robert Mueller's investigation into Russia's role in the 2016 presidential election.\n\nBarr, a lawyer who was previously attorney general from 1991 to 1993 under the late President George HW Bush, has defended Trump's controversial decision to fire then-FBI Director James Comey in May 2017 when Comey was leading the Russia probe.\n\nAfter Comey's firing, Mueller took over that investigation, which includes any possible collusion between Moscow and Trump's 2016 election campaign, and any potential obstruction of justice. The Russia probe has long infuriated Trump, who calls it a \"witch-hunt\" and who has denied any collusion or any obstruction of justice. Comey is set to testify in front of House Republicans on Friday on the decisions made by the Justice Department during the 2016 presidential election.\n\nBarr has said there is more reason to investigate potential wrongdoing by Trump's campaign opponent, Democrat Hillary Clinton, than there is to probe any potential collusion.\n\nMueller was appointed by Deputy Attorney General Rod Rosenstein.\n\nBarr has said political donations show Mueller's team of professional prosecutors tilt uncomfortably to the left. On Twitter, Trump calls them \"17 Angry Dems\".\n\n\"I would have liked to see him have more balance on this group,\" Barr told the Washington Post in July 2017.\n\nAs attorney general, Barr would have ultimate responsibility for the Russia probe, unless he recuses himself. Sessions recused himself from overseeing the investigation.\n\nUS intelligence agencies have concluded Moscow worked to influence the election and tip it in Trump's favour. Russia has denied any interference.\n\nBarr's comments on Mueller and Clinton could stir opposition from Senate Democrats, but the nomination will almost certainly not come up for a vote until next year. Republicans will control the chamber with a 53-47 majority in the new Congress convening in January.\n\n\"I do think he's worthy of consideration. I am concerned he has said some negative things about the Special Counsel's office and some of the prosecutors he had in place,\" Democratic Senator Amy Klobuchar told MSNBC on Thursday after Barr's name surfaced.\n\nKlobuchar is a member of the Senate Judiciary Committee, which has jurisdiction over the nomination.\n\nMueller set to reveal new details\n\nThe news of Trump's plans to nominate Barr comes on what is expected to be a busy day for the Mueller investigation. Special Counsel Mueller faces court deadlines in two pivotal cases.\n\nMueller and federal prosecutors in New York will have to file memos in court on Friday detailing the cooperation of longtime Trump legal fixer Michael Cohen. And Mueller's team will also be disclosing what they say former Trump campaign chairman Paul Manafort lied about when his plea deal fell apart last month. Cohen and Manafort are among five former Trump associates who prosecutors have accused of lying either to federal investigators or to Congress.\n\nAhead of the release of new details from Mueller, Trump went on an angry Twitter offensive early on Friday, saying, without evidence, that Mueller has many conflicts of interests. He also said his team plans to release a rebuttal to any report released by the special counsel.\n\nMeanwhile, the president also confirmed reports that he plans to nominate State Department spokesperson Heather Nauert to be the next US ambassador to the United Nations, filling the spot of Nikki Haley, who will step down at the end of the year.", "description": "If confirmed, Barr, who served as attorney general under George HW Bush, will oversee Mueller's Russia investigation.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/6671/809618b0492441e4b126e9df9537db46.jpg", "published_at": "2018-12-07"}