{"pub": "abcnews", "url": "https://abcnews.go.com/International/wireStory/trudeau-lose-power-canadas-election-monday-66362131", "downloaded_at": "2019-10-18 04:49:59.135861+00:00", "title": "Trudeau could lose power in Canada's election Monday", "language": "en", "text": "Ian Bremmer remembers the first time he met Justin Trudeau, at the annual gathering of elites in the Swiss ski resort of Davos.\n\nBremmer, a prominent foreign policy expert, said Canada's party at the world economic forum is usually \"the sleepiest thing you could do.\" It is typically held at a second-tier hotel, and if you go, it's because you're on the way someplace else. But in early 2016, Canada's new leader, tall and trim, the son of the liberal icon and late Prime Minister Pierre Trudeau, arrived.\n\n\"It was insane. Everyone wanted to be there. He was the superstar on the global stage that year. The idea that a Canadian prime minister would have that kind of impact and star power was insane,\" said Bremmer, president of the Eurasia Group. \"He's still considered one of the good guys, one of the globalists. But let's face it, his star has diminished.\"\n\nPolls show Trudeau could lose to his Conservative Party rival in national elections on Monday or fail to win a majority of seats in Parliament and have to rely on an opposition party to remain in power. Not since 1935 has a first-term Canadian prime minister with a parliamentary majority lost a bid for re-election.\n\nA combination of scandal and high expectations has damaged his prospects.\n\nLast month, photos of Trudeau in blackface and brownface when he was younger surfaced, casting doubt on his judgment. And the boyishly handsome 47-year-old was tarnished by a scandal that erupted earlier this year, when his former attorney general said he pressured her to halt the prosecution of a Quebec company. Trudeau has said he was standing up for jobs.\n\n\"I don't think he's totally negated, but he's not just the draw, the leader, if you like, that people wanted and expected,\" said Robert Bothwell, a professor of Canadian history and international relations at the University of Toronto.\n\nTrudeau's opponent, Andrew Scheer, is a career politician described by those in his own party as bland, a possible antidote for those tired of Trudeau's flash. Scheer, 40, calls Trudeau a phony who can't even recall how many times he has worn blackface. He is promising to scrap the national carbon tax and cut government spending, including foreign aid, by 25 percent.\n\nBut he, too, has had a bumpy ride. He has been criticized for embellishing his resume and for holding dual U.S.-Canadian citizenship, as the Globe and Mail newspaper revealed earlier this month.\n\nTrudeau's father swept to power in 1968 on a wave of \"Trudeaumania,\" and while he had a scare at the polls when he ran for re-election four years later, he would lead Canada for almost 16 years, becoming a storied name in the country's history, responsible for opening the door wide to immigration.\n\nJustin Trudeau reasserted the country's liberal identity in 2015 after almost 10 years of Conservative rule and has been viewed as a beacon of hope for liberals in the Trump era. The Liberal Party leader appeared on the cover of Rolling Stone magazine under the headline \"Why Can't He Be Our President?\"\n\nSensing Trudeau is now in trouble, Barack Obama made an unprecedented endorsement by a former American president, urging Canadians to re-elect Trudeau and describing him as a hard-working, effective leader who takes on big issues like climate change.\n\n\"The world needs his progressive leadership now,\" Obama tweeted.\n\nTrudeau has championed diversity and gender equality. Half of Trudeau's Cabinet is made up of women, four are Sikhs, and his immigration minister is a Somali-born refugee. He has embraced immigration at a time when the U.S. and other countries are closing their doors. And he legalized cannabis nationwide.\n\nHis efforts to strike a balance on the environment and the economy have been criticized by both the right and left. He brought in the carbon tax but rescued and bought a stalled pipeline expansion project to get Alberta's oil to international markets.\n\nHis biggest accomplishment has been negotiating a new free trade deal with America despite President Donald Trump's threats to scrap it.\n\n\"When Trudeau was really under the gun with the most volatile, unpredictable American president in history, Trudeau actually did pretty well by Canadian citizens,\" Bremmer said.\n\nManaging the relationship with the U.S. is perhaps the important issue for a Canadian prime minister, since the country relies on America for 75 percent of its exports.\n\nTrudeau has avoided criticizing the American president, but after weeks of stagnant poll numbers, he embraced the role of Trump's foil, saying he is the only candidate who can stand up to Trump and \"the forces of populism and chaos around the world.\"\n\n\"The challenge for Trudeau always was trying to keep this big, high-profile, international expectation that he's Obama's successor, the progressive hero of the global world,\" said Ian Brodie, former chief of staff to Conservative Prime Minister Stephen Harper. \"With Trump, being the inheritor of Obama's progressive mantle doesn't do any good.\"\n\nNor has it done any good with Saudi Arabia and China, which have punished Canada for speaking up for human rights and the rule of law.\n\nAntonia Maioni, McGill University's dean of arts, said Trudeau is facing a reality check on Monday: \"The difficulty has been for Mr. Trudeau to sort of rise to the expectations that he himself had engendered and others had projected onto him.\"", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/WireAP_545cad622eac46df87d332bab5d7f831_16x9_992.jpg", "published_at": "2019-10-18"}