{"pub": "politico", "url": "https://politico.eu/article/faq-the-uk-british-role-in-the-next-european-commission-brexit-ursula-von-der-leyen", "downloaded_at": "2019-10-29 06:11:24.281624+00:00", "title": "FAQ: The UK’s role in the next European Commission", "language": "en", "text": "The EU on Monday agreed to a Brexit extension until January 31 — but said London must nominate a member of the European Commission.\n\nCommission President-elect Ursula von der Leyen said last week that she would ask Britain to nominate a commissioner if Brexit is delayed. At a news conference in Finland, she said if the U.K. is still in the EU after November 1, \"then of course I would ask the U.K. to send a commissioner.\"\n\nBoris Johnson, however, has made clear he does not want to nominate anyone for von der Leyen's Commission.\n\nThe EU's request raises a host of legal and political questions, with politicians on both sides of the Channel questioning the merits of a British politician taking a seat at the Commission table when the U.K. is on its way out of the EU door.\n\nHere are some of the key questions:\n\nDoes the U.K. have to nominate a European commissioner?\n\nLegally, yes. In 2013, European leaders made a decision that the Commission \"shall consist of a number of members, including its President and the High Representative of the Union for Foreign Affairs and Security Policy, equal to the number of Member States.\" So if the U.K. is still technically a member, then it has to have a commissioner.\n\nBut didn't the EU try to reduce the number of commissioners?\n\nYes. A decade ago there was a push to reduce the number of European commissioners. The EU Treaty says that \"as from 1 November 2014, the Commission shall consist of a number of members ... corresponding to two-thirds of the number of Member States, unless the European Council, acting unanimously, decides to alter this number.\"\n\nThe idea of creating a smaller European Commission was part of a move toward a more \"political Commission,\" according to Kenneth Armstrong, professor of European law at the University of Cambridge.\n\nBut it's 2019 and clearly this hasn't happened. That's because of Ireland, which rejected the Lisbon Treaty in 2008. As a concession to Dublin, which feared being one of the countries without representation, an assurance was given that every country would get to nominate a commissioner, culminating in the 2013 decision.\n\nCan the von der Leyen Commission start work without a British member?\n\nYes. There will be no \"earthquake\" if London fails to nominate a commissioner, said Jean-Claude Piris, a former director general of the Council of the EU's legal service. \"The Commission will work with 27 commissioners,\" Piris said, noting that there have been several times in the past when the Commission functioned without members from all EU countries. At the time of writing, there are 26 commissioners as the Estonian and Romanian members left to take up seats in the European Parliament and were not replaced.\n\nAccording to law professor Armstrong, the European Council could also make a formal decision to reduce the number of commissioners.\n\nCan the EU force the U.K. to nominate a commissioner?\n\nNot really. The Commission could start infringement proceedings if London doesn't nominate a commissioner, but according to Piris, it would take such a long time that Brexit would have happened before it reached court. Armstrong said although infringement proceedings could be launched on an \"accelerated basis,\" it would still be a \"pointless\" exercise.\n\n\"We prefer cooperation over punitive measures,\" said one Commission official.\n\nWhat portfolio would a British commissioner get?\n\nVon der Leyen has the power to create a new portfolio in any policy area she chooses. If London does nominate a commissioner, the president-elect will likely find a relatively minor task for the short-term nominee. Or she could have some fun and put the Brit in charge of multilingualism or perhaps enlargement (seeing as the U.K. will soon be a so-called third country).\n\nThis article is part of POLITICO’s premium Brexit service for professionals: Brexit Pro. To test our expert policy coverage of the implications and next steps per industry, email pro@politico.eu for a complimentary trial.", "description": "Ursula von der Leyen says she would ask the UK to nominate a commissioner if Brexit is delayed.", "authors": ["Lili Bayer", "Eleni Courea", "Emilio Casalicchio"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/10/GettyImages-1178650234-1200x628.jpg", "published_at": "2019-10-28"}