{"pub": "afr", "url": "https://afr.com/property/commercial/homeco-shrugs-off-retail-gloom-with-strong-debut-20191014-p530dt", "downloaded_at": "2019-10-14 05:15:29.016478+00:00", "title": "Mall owner HomeCo surges on ASX debut", "language": "en", "text": "\"Our investment strategy has resonated with investors. We've differentiated ourselves from pure retail players with a high proportion of services.\"\n\nThe HomeCo retail centres comprise the reconfigured former Masters warehouse portfolio.\n\nAs revealed by The Australian Financial Review's Street Talk column, Rich Listers the Oatley family, Aussie Home Loans founder John Symond, Cotton On Group founder Nigel Austin and retail royalty the Besens all piled into the HomeCo float as cornerstone investors, which offered an attractive 6 per cent fully-franked dividend yield.\n\nThey join Mr Di Pilla's Aurrum Group of investors (including UBS star banker Matthew Grounds) which owns 34 per cent of HomeCo, and the founders of Spotlight (10 per cent), Chemist Warehouse (9.6 per cent) and IPO candidate Primewest (5 per cent).\n\nHomeCo will give investors exposure to a national portfolio of 30 retail centres moulded out of the former Masters warehouses, bought for $725 million in September 2016.\n\nOut of these, 21 of them will be trading by the end of 2019 – mostly on the East Coast with the further nine centres to be redeveloped.\n\nIn total, the portfolio is worth $925 million based on a capitalisation rate of 6.85 per cent.\n\nThe operating portfolio comprises 370,000 square metres of gross lettable area with 93.5 per cent occupied on a weighted average lease expiry of 8.8 years.\n\nAdvertisement\n\nAmart Furniture is HomeCo's biggest tenant by income (11.1 per cent), followed by Spotlight Retail Group (5.3 per cent), Super Retail Group (5 per cent), Nick Scali (4.5 per cent), Goodlife (4.2 per cent), Coles (3.7 per cent), Woolworths and Chemist Warehouse (both 2.5 per cent).\n\nMr Di Pilla is the largest individual securityholder, retaining 31.6 million securities – or 15.9 per cent of HomeCo – worth $106 million.\n\nFellow board members Zac Fried, the Spotlight Group executive chairman, owns 19.8 million shares, worth $66 million and Greg Hayes, who is involved in aged care operator Aurrum, owns 8.7 million shares, worth $29 million.\n\nIn total, foundation shareholders comprising the Spotlight, Chemist Warehouse, Primewest and Aurrum Groups, have retained 47 per cent of the stapled entities following completion.\n\nThe group will have around $175 million of undrawn debt (from a $500 million debt facility) to fund its development of new centres with initial gearing at a conservative 31.8 per cent.\n\nIts main competitor will be the Brett Blundy-backed Aventus Retail Property Fund, which owns 20 homemaker centres worth $2.1 billion.\n\nAventus, which floated at $2 four years ago with a market cap of $687 million, is now worth $1.5 billion, with its securities trading at $2.69.\n\nThe two homemaker centre landlords are currently locked in a Melbourne leasing dispute which has gone all the way to the Victorian Court of Appeal, after an initial Supreme Court ruling went in favour of HomeCo.\n\nThe dispute centres around HomeCo's right to sub-lease a former Masters store in Cranbourne to Amart Furniture. Aventus is the landlord.", "description": "Chairman, CEO and major shareholder David Di Pilla rang the bell following the IPO, which was heavily backed by Rich Listers including John Symond.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.1219%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_85/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/373e5a7fbdd829b3f7a0b339c1ef30e59e6eddc6", "published_at": "2019-10-14"}