{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/listeriosis-class-action-case-could-be-delayed-for-years-20191009", "downloaded_at": "2019-10-09 04:36:55.133297+00:00", "title": "Listeriosis class action case could be delayed 'for years'", "language": "en", "text": "The class action brought against Tiger Brands following a listeriosis outbreak caused by some of its products could take years before it finally gets to court.\n\nIn April, Tiger Brands received the summons for a class action linked to the listeriosis outbreak from the Gauteng High Court in Johannesburg.\n\nIn February, the court determined that Richard Spoor Attorneys could go ahead with the class action, representing more than 1 000 people affected by the listeriosis outbreak in 2017 and 2018 that claimed more than 200 lives.\n\nREAD | Listeriosis outbreak: How it started, how it was traced, and how it was finally stopped\n\nOn Tuesday, Spoor said the class action could be delayed \"for years\" as Tiger Brands had issued subpoenas against food-testing laboratories to obtain information about the identities of people or parties who submitted samples for testing listeriosis and the results of those tests during the period of the outbreak.\n\nTwo laboratories - Aspirata and Deltamune - have indicated that they would oppose this as the information is confidential. In a worst-case scenario, the matter could go all the way to the Constitutional Court, which could take years, Spoor said.\n\nTiger Brands has lodged an application in the High Court to compel the disclosure of the documents.\n\n'Fishing expedition'\n\n\"This is a fishing expedition,\" Spoor said. \"There is no reason to believe that anyone other than [Tiger Brands] is responsible for the outbreak.\"\n\nSpoor said his firm might participate in the litigation of the matter between Tiger Brands and the laboratories to speed up the matter.\n\n\"Foremost, is the question of public policy and privacy. We want companies to submit products for testing. From a health and safety point of view, it is desirable for corporations to test often for any signs of contamination and to respond appropriately.\n\n\"But when these companies send their samples to private laboratories to be tested, at their own expense, and the results become public knowledge, it creates a strong disincentive for them to do so.\"\n\nProducts found to be contaminated are not sold to the public. Spoor said chicken, for example, may contain traces of listeria, but this is not a \"train smash\" as it will be cooked, killing the bacteria.\n\n\"But in the eyes of the public, it sounds appalling. So here you have a small manufacturer that submits its products, listeria is found and appropriate measures are taken, so there's no risk to anybody. However, the fact that listeria was found could be very bad for [the company's reputation] if it comes out in public.\n\n\"People could become terrified, even if there is no risk involved.\"\n\nThis is the reason the laboratories want to keep their records confidential, Spoor said. \"It could cause reputational harm that just isn't justified.\"\n\nThat said, the subpoenas are causing a delay in the class action.\n\nConstitutional matter\n\n\"One of the important issues is that this is a constitutional matter. It's about the right to privacy. So this is a matter that could, conceivably, go all the way to the Constitutional Court and that process can take a few years.\n\n\"We really don't want that to happen.\"\n\nThis is why Spoor is contemplating intervening by joining Tiger Brands as an applicant to \"find a solution that is in the interest of the claimants and justice\".\n\nSpoor said a decision on this would be made by Friday.\n\nALSO READ | Listeriosis: Tiger Brands to cooperate with class action - but maintains it's not guilty yet\n\nNews24 has approached a spokesperson at Tiger Brands for comment. This will be added once received.\n\nIn a statement in December last year, the company said it would follow the legal process to bring closure to all parties.\n\n\"Tiger Brands reiterates that no liability has been established against the company for the listeriosis outbreak.\n\n\"However, should liability be determined, the company will respond appropriately to any legitimate claims,\" the statement read.\n\nIn the same statement, Tiger Brands chief corporate affairs officer Mary Jane Morifi said the R1m that the company extended to assist in supporting the class action process, and a hotline to facilitate it, was a sign that the company was committed to finding a resolution for everyone affected.\n\n\n\n\"We are committed to ensuring that the legal process runs smoothly and as quickly as possible. In managing the application for the certification of the class action in this manner, we have been able to substantially shorten the time taken for this part of the legal process,\" said Morifi.", "description": "The class action brought against Tiger Brands following a listeriosis outbreak caused by some of its products, could take years before it finally gets to court.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7104/510377e4351848229f2c80d09568807e.jpg", "published_at": "2019-10-09"}