{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/general-election-poll-brexit-second-referendum-boris-johnson-peoples-vote-a9177441.html", "downloaded_at": "2019-10-30 16:04:03.575020+00:00", "title": "Boris Johnson could be denied election majority if third of pro-EU voters abandon party loyalty, poll finds", "language": "en", "text": "Boris Johnson could be deprived of a majority in the upcoming election if fewer than a third of pro-EU voters abandon party loyalty, a new survey has found.\n\nResearch for the Best for Britain campaign shows the Conservatives could win a 44-seat majority in the Christmas poll, with 364 seats, compared with Labour’s 189, 23 for the Lib Dems, three for Plaid Cymru and one for the Greens.\n\nBut if 30 per cent of voters cast their ballot tactically, it could swing the election to give pro-referendum parties a majority of four, according to a seat-by-seat analysis of 46,000 people over September and October.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn this scenario, the Tories would win 309 seats, Labour have 233, 34 for the Lib Dems, four for Plaid and one for the Greens.\n\nIf 40 per cent of pro-EU people vote tactically, the Tories would win 277 seats, Labour 255, Lib Dems 44, four for Plaid and one for the Greens – delivering a 36-seat majority for pro-referendum parties.\n\nThe SNP are assumed to win 52 out of Scotland’s 59 parliamentary seats in all scenarios, while the Brexit Party was not expected to win a single seat.\n\nIt comes as the country was on course for the first December election in decades, after a bill calling a snap poll passed its Commons stages on Tuesday. Peers are not expected to amend the bill, paving the way for parliament to be dissolved next week.\n\nAt the launch of a new tactical voting site, former Tory rebel Dominic Grieve urged people to cast aside party loyalty to fight Brexit in the election.\n\nHe said: “What is quite clear is that whilst there may be attempts of diverting attention to other issues, Brexit must be the defining issue of this election because bluntly it is likely to have a bearing on every single other topic that is going to follow.\n\n“If Boris Johnson gets a working majority, then he will doubtless take us out of the EU very quickly, provided, particularly, now that the party has been essentially purged of most of its moderate elements.”\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nHe admitted he could be a “direct beneficiary” of tactical voting in the upcoming poll.\n\nMr Grieve also confirmed reports that the Liberal Democrats had stood down their candidate in his Beaconsfield constituency to prevent the Remain vote being split. Labour are expected to stand against him, but he claimed some local Labour members would back him.\n\nFormer Lib Dem leader Sir Vince Cable said tactical voting was “not ideal” but it was a “powerful tool” to fight Brexit.\n\nHe said: “We are a ‘Stop Brexit party’ but we recognise that there are other parties who will be campaigning on that platform as well.\n\n“There are many individual candidates who will be campaigning on that platform – Dominic is standing as an independent and it would be mad if we didn’t get behind him, we will of course 100 per cent – and that kind of thinking has to be reflected across the country.”\n\nLabour MP Anna McMorrin also urged voters to consider ditching their party loyalty for “the fight of our lives” – a sentiment that will likely set her at odds with Jeremy Corbyn.\n\nPollster Lewis Baston said levels of volatility over people’s political allegiance were at the highest since the 1920s during the 2017 campaign, with 35 to 45 per cent of people switching from one party to another.\n\nHe said: “I think in 2019, we are still in this world where there’ll be massive variation between seats.\n\nShape Created with Sketch. Best pictures from Final Say Brexit march Show all 76 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Best pictures from Final Say Brexit march 1/76 Crowds march through central London Getty 2/76 Angela Christofilou/The Independent 3/76 Protesters gather in Parliament Square Led By Donkeys 4/76 Mayor of London Sadiq Khan joins protesters PA 5/76 Angela Christofilou/The Independent 6/76 Angela Christofilou/The Independent 7/76 Angela Christofilou/The Independent 8/76 Angela Christofilou/The Independent 9/76 Anti-Brexit protesters fill Parliament Square in London PA 10/76 Angela Christofilou/The Independent 11/76 Angela Christofilou/The Independent 12/76 Angela Christofilou/The Independent 13/76 Angela Christofilou/The Independent 14/76 Angela Christofilou/The Independent 15/76 Angela Christofilou/The Independent 16/76 Angela Christofilou/The Independent 17/76 Angela Christofilou/The Independent 18/76 Angela Christofilou/The Independent 19/76 Angela Christofilou/The Independent 20/76 A demonstrator marches EPA 21/76 Angela Christofilou/The Independent 22/76 Angela Christofilou/The Independent 23/76 Angela Christofilou/The Independent 24/76 Protesters push a float depicting Dominic Cummings using Boris Johnson as a puppet during the Final Say Brexit march in London PA 25/76 EU supporters react after the result of the vote on the deal delay was announced at the House of Commons REUTERS 26/76 A demonstrator carries his dog draped in EU flag AP 27/76 Thousands of people taking part in a People's Vote march AFP/Getty 28/76 Protesters use their flags to shelter from the rain Getty Images 29/76 Protesters march towards Parliament Square Getty Images 30/76 Anti-Brexit demonstrators carry placards and EU flags AP 31/76 Sir Oliver Letwin MP in Parliament Square, London, during an an anti-Brexit, Let Us Be Heard rally, after it was announced that the Letwin amendment, which seeks to avoid a no-deal Brexit on October 31, has been accepted PA 32/76 Thousands of people taking part in a People's Vote march UK BROADCASTERS POOL/AFP via Get 33/76 A protester with \"Bollocks to Brexit\" stickers on his head Getty Images 34/76 Demonstrators march EPA 35/76 Britain's main opposition Labour Party shadow Secretary of State for Exiting the EU Keir Starmer, shadow Home Secretary Dianne Abbott, shadow Chancellor of the Exchequer John McDonnell, shadow Foreign Secretary Emily Thornberry speaks on stage in Parliament Square AFP via Getty Images 36/76 Anti-Brexit supporters cheer outside parliament AP 37/76 A EU supporter waves flags REUTERS 38/76 Anti-Brexit supporters AP 39/76 Protesters shout and chant demanding a final say Getty Images 40/76 Police look towards protesters Getty Images 41/76 Pro-Brexit protesters outside the Houses of Parliament in London PA 42/76 People taking part in an Anti-Brexit, Let Us Be Heard march head to Parliament Square in London PA 43/76 People taking part in an Anti-Brexit, Let Us Be Heard march in Trafalgar Square PA 44/76 Anti-Brexit supporters cheer outside parliament AP 45/76 People taking part in an Anti-Brexit, Let Us Be Heard march past Trafalgar Square PA 46/76 Protesters shout and chant Getty Images 47/76 Cory (7) sits on his father's shoulders as protesters march towards Parliament Square Getty 48/76 People attend the 'Together for the Final Say' march EPA 49/76 Protesters march towards Parliament Square Getty Images 50/76 Mayor of London Sadiq Khan speaks on stage PA 51/76 A woman in EU costume EPA 52/76 Anti-Brexit protesters fill Parliament Square in London PA 53/76 Anti-Brexit protesters AP 54/76 Anti-Brexit protesters hold an Independent banner Angela Christofilou/The Independent 55/76 Protesters hold an anti-Brexit placard by The Independent stall during the Final Say Brexit march in London Tom Richell 56/76 Anti-Brexit protesters in Parliament Square, London, PA 57/76 Demonstrators hold placards and EU flags AFP/Getty 58/76 An anti-Brexit protester joins in the Final Say Brexit march on 19 October AP 59/76 EU supporters march in London REUTERS 60/76 Sir Patrick Stewart and Paul McGann join in the Final Say Brexit march in London on 19 October PA 61/76 EU supporters march Reuters 62/76 A demonstrator shouts into a megaphone as she marches AFP via Getty Images 63/76 A dog dressed in an anti-Brexit placard is walked in the Final Say Brexit march in London EPA 64/76 EU supporters march REUTERS 65/76 A morris dancer takes part in the Final Say Brexit march in London PA 66/76 Whippets are dressed in EU flag clothing during the Final Say Brexit march in London AP 67/76 Protesters march towards parliament in the Final Say Brexit march in London on 19 October 2019 PA 68/76 An anti-Brexit demonstrator takes part in the Final Say Brexit march in London AFP/Getty 69/76 EU supporters call on the government to give Britons a vote on the final Brexit deal Reuters 70/76 Anti-Brexit protesters Angela Christofilou/The Independent 71/76 An anti-Brexit protester Angela Christofilou/The Independent 72/76 Anti-Brexit protesters demonstrate in London during the Final Say Brexit march on 19 October AP 73/76 Protesters push a float depicting Dominic Cummings using Boris Johnson as a puppet during the Final Say Brexit march in London AFP/Getty 74/76 Protesters march towards parliament from Park Lane in the Final Say Brexit march in London on 19 October 2019 PA 75/76 Marchers visit The Independent stall during the Final Say March in London Tom Richell 76/76 An anti-Brexit protester holds a sign calling for a Final Say during a march in London EPA 1/76 Crowds march through central London Getty 2/76 Angela Christofilou/The Independent 3/76 Protesters gather in Parliament Square Led By Donkeys 4/76 Mayor of London Sadiq Khan joins protesters PA 5/76 Angela Christofilou/The Independent 6/76 Angela Christofilou/The Independent 7/76 Angela Christofilou/The Independent 8/76 Angela Christofilou/The Independent 9/76 Anti-Brexit protesters fill Parliament Square in London PA 10/76 Angela Christofilou/The Independent 11/76 Angela Christofilou/The Independent 12/76 Angela Christofilou/The Independent 13/76 Angela Christofilou/The Independent 14/76 Angela Christofilou/The Independent 15/76 Angela Christofilou/The Independent 16/76 Angela Christofilou/The Independent 17/76 Angela Christofilou/The Independent 18/76 Angela Christofilou/The Independent 19/76 Angela Christofilou/The Independent 20/76 A demonstrator marches EPA 21/76 Angela Christofilou/The Independent 22/76 Angela Christofilou/The Independent 23/76 Angela Christofilou/The Independent 24/76 Protesters push a float depicting Dominic Cummings using Boris Johnson as a puppet during the Final Say Brexit march in London PA 25/76 EU supporters react after the result of the vote on the deal delay was announced at the House of Commons REUTERS 26/76 A demonstrator carries his dog draped in EU flag AP 27/76 Thousands of people taking part in a People's Vote march AFP/Getty 28/76 Protesters use their flags to shelter from the rain Getty Images 29/76 Protesters march towards Parliament Square Getty Images 30/76 Anti-Brexit demonstrators carry placards and EU flags AP 31/76 Sir Oliver Letwin MP in Parliament Square, London, during an an anti-Brexit, Let Us Be Heard rally, after it was announced that the Letwin amendment, which seeks to avoid a no-deal Brexit on October 31, has been accepted PA 32/76 Thousands of people taking part in a People's Vote march UK BROADCASTERS POOL/AFP via Get 33/76 A protester with \"Bollocks to Brexit\" stickers on his head Getty Images 34/76 Demonstrators march EPA 35/76 Britain's main opposition Labour Party shadow Secretary of State for Exiting the EU Keir Starmer, shadow Home Secretary Dianne Abbott, shadow Chancellor of the Exchequer John McDonnell, shadow Foreign Secretary Emily Thornberry speaks on stage in Parliament Square AFP via Getty Images 36/76 Anti-Brexit supporters cheer outside parliament AP 37/76 A EU supporter waves flags REUTERS 38/76 Anti-Brexit supporters AP 39/76 Protesters shout and chant demanding a final say Getty Images 40/76 Police look towards protesters Getty Images 41/76 Pro-Brexit protesters outside the Houses of Parliament in London PA 42/76 People taking part in an Anti-Brexit, Let Us Be Heard march head to Parliament Square in London PA 43/76 People taking part in an Anti-Brexit, Let Us Be Heard march in Trafalgar Square PA 44/76 Anti-Brexit supporters cheer outside parliament AP 45/76 People taking part in an Anti-Brexit, Let Us Be Heard march past Trafalgar Square PA 46/76 Protesters shout and chant Getty Images 47/76 Cory (7) sits on his father's shoulders as protesters march towards Parliament Square Getty 48/76 People attend the 'Together for the Final Say' march EPA 49/76 Protesters march towards Parliament Square Getty Images 50/76 Mayor of London Sadiq Khan speaks on stage PA 51/76 A woman in EU costume EPA 52/76 Anti-Brexit protesters fill Parliament Square in London PA 53/76 Anti-Brexit protesters AP 54/76 Anti-Brexit protesters hold an Independent banner Angela Christofilou/The Independent 55/76 Protesters hold an anti-Brexit placard by The Independent stall during the Final Say Brexit march in London Tom Richell 56/76 Anti-Brexit protesters in Parliament Square, London, PA 57/76 Demonstrators hold placards and EU flags AFP/Getty 58/76 An anti-Brexit protester joins in the Final Say Brexit march on 19 October AP 59/76 EU supporters march in London REUTERS 60/76 Sir Patrick Stewart and Paul McGann join in the Final Say Brexit march in London on 19 October PA 61/76 EU supporters march Reuters 62/76 A demonstrator shouts into a megaphone as she marches AFP via Getty Images 63/76 A dog dressed in an anti-Brexit placard is walked in the Final Say Brexit march in London EPA 64/76 EU supporters march REUTERS 65/76 A morris dancer takes part in the Final Say Brexit march in London PA 66/76 Whippets are dressed in EU flag clothing during the Final Say Brexit march in London AP 67/76 Protesters march towards parliament in the Final Say Brexit march in London on 19 October 2019 PA 68/76 An anti-Brexit demonstrator takes part in the Final Say Brexit march in London AFP/Getty 69/76 EU supporters call on the government to give Britons a vote on the final Brexit deal Reuters 70/76 Anti-Brexit protesters Angela Christofilou/The Independent 71/76 An anti-Brexit protester Angela Christofilou/The Independent 72/76 Anti-Brexit protesters demonstrate in London during the Final Say Brexit march on 19 October AP 73/76 Protesters push a float depicting Dominic Cummings using Boris Johnson as a puppet during the Final Say Brexit march in London AFP/Getty 74/76 Protesters march towards parliament from Park Lane in the Final Say Brexit march in London on 19 October 2019 PA 75/76 Marchers visit The Independent stall during the Final Say March in London Tom Richell 76/76 An anti-Brexit protester holds a sign calling for a Final Say during a march in London EPA\n\n“That’s where exercises like this one, come in very handy. They are a map, not a perfect map by any means but the best thing we have mapping, where the big changes are, which parties are in contention for a seat.\n\n“You can’t just look back at 2017 or 2015 or 2010 to see the geography and party support. It’s all changing.”\n\nThe study was carried out for Hope not Hate and Best for Britain by focaldata, a polling agency that specialises in understanding niche audiences using a technique called MRP (multi-level regression with poststratification) to estimate opinion to each constituency.\n\nThe MRP polling model was used to successfully predict the US election in 2016 and the hung parliament in the 2017 snap election.\n\nThe tactical voting tool will be found on getvoting.org.", "description": "Boris Johnson could be deprived of a majority in the upcoming election if fewer than a third of pro-EU voters abandon party loyalty, a new survey has found. Research for the Best for Britain campaign shows the Conservatives could win a 44-seat majority in the Christmas poll, with 364 seats, compared with Labour’s 189, 23 for the Lib Dems, three for Plaid Cymru and one for the", "authors": ["Lizzy Buchan"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/20/14/final-say-march-94.jpg", "published_at": "2019-10-30"}