{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/23/angel-mom-scolds-sanctuary-senators-imagine-your-child-dead", "downloaded_at": "2019-10-24 06:39:30.795097+00:00", "title": "Angel Mom Scolds Sanctuary Senators: 'Imagine Your Child Dead'", "language": "en", "text": "Angel Mom Mary Ann Mendoza, head of the Angel Families organization, scolded pro-sanctuary city Senators during a Senate Judiciary Committee hearing, asking them to “imagine” their own children being killed by a criminal illegal alien who was released into the United States.\n\nMendoza’s son, 32-year-old police officer Brandon Mendoza, was killed in May 2014 by a drunk illegal alien who was driving the wrong way down a highway in Mesa, Arizona.\n\nDuring her testimony, Mendoza said pro-sanctuary Senators “will never understand” the pain caused by illegal alien crime until it directly impacted them:\n\nUntil one of you who supports sanctuary policies or any elected official shoving these sanctuary policies on us, are directly impacted by illegal alien crime, you will never understand the depth of pain, grief, and hopelessness that they create. [Emphasis added] … These policies are not put on the ballot for voter approval. They are put in place without voter approval. And many people have been convinced by politicians and special interest groups that sanctuary policies keep our communities safer. Nothing could be further from the truth. Just ask our law enforcement officers and I’ve talked to men and women on the front line from Virginia to Arizona, Texas to Montana, and they know the danger of releasing criminal illegal aliens into our communities and neighborhoods. Americans are being victimized and left behind by the very officials they voted into office and who made an oath to protect and uphold the law. This includes immigration law. [Emphasis added] … Every day, Americans are being marginalized as collateral damage by this incredibly dangerous mindset that illegal alien criminals deserve above-the-law protections while they remain illegally present in our country. [Emphasis added]\n\nSen. Thom Tillis (R-NC) has introduced legislation — known as S.2059 — to give victims of illegal alien crime the right to sue sanctuary jurisdictions for protecting criminal illegal aliens, a bill Mendoza unequivocally said she supports.\n\nMendoza mentioned the case of 23-year-old Aaron Hampton who was allegedly murdered by an illegal alien who had been shielded from deportation by former President Obama’s Deferred Action for Childhood Arrivals (DACA) program.\n\n“In November 2018, Aaron Hampton was shot more than 25 times by a repeat offender criminal illegal alien in Springfield, Missouri,” Mendoza described. “ICE had a detainer on Luis Perez and requested Middlesex County, New Jersey to hold him before deportation proceedings following his arrest for felony crimes that included assault, aggravated assault, and child abuse.”\n\n“Had the ICE detainer been honored, as every detainer should be, Aaron Hampton would be alive today,” Mendoza said. Make no mistake, Luis Perez is a repeat offender criminal illegal alien from Mexico who has no right to live in our country.”\n\nMendoza said no American who repeatedly breaks federal law would receive the protections that illegal aliens routinely receive.\n\n“I ask of this committee, would I be shown the same leniency had I broken federal law?” Mendoza said. “Would any state in this union protect me or any other American from being detained, arrested, and prosecuted by the federal government? We all know the answer — a resounding ‘No.'”\n\nMendoza mentioned the case of Jonathan West Jr. in Richmond, California who was killed in a traffic accident by an illegal alien in July. That illegal alien is free today.\n\n“Jonathan West Jr. was on his way home from work on his motorcycle in Richmond, California when Joselyn Escobar, an illegal alien, turned in front of him,” Mendoza said. “He landed on her windshield and was thrown 10 feet into a pole. Jonathan died nine days later. Today, his killer is walking free in California because of sanctuary policies while Jonathan’s mother Gizell lives her biggest nightmare every day.”\n\nLikewise, Mendoza spoke of 33-year-old Sander Cohen and 36-year-old Carlos Wolf who were both killed by a 28-year-old illegal alien in Montgomery County, Maryland last year and received a fine of less than $300.\n\n“November 2018, Sander Cohen, a Fire Marshal, and Carlos Wolf, an FBI agent, were killed on the side of the road in sanctuary Montgomery County,” Mendoza said. “That illegal alien was fined $240. That’s what an FBI agent’s and Fire Marshal’s life is worth in Montgomery County.”\n\nMendoza noted the discrepancy between the punishments for when American citizens commit federal crimes versus when illegal aliens violate federal law, saying she is appalled by the Democrat Senators who are “arguing in favor of criminal illegal aliens and forgetting innocent American victims.”\n\n“American citizens have to pay for their crimes, but repeat offender criminal illegal aliens are being protected by the government who exist to protect and serve American citizens and legal residents,” Mendoza said. “No matter your political affiliation … or party loyalty, imagine your child dead, gone, separated permanently due to the criminal, reckless, and sometimes evil actions of someone who never had a right to be here in the first place, someone whose crimes could have been prevented had federal law not been skirted by dangerous sanctuary policies we’re seeing across this country.”\n\n“And quite frankly I’m appalled to be sitting in the U.S. Senate building and actually listening to American elected senators arguing in favor of criminal illegal aliens and forgetting innocent American victims, never fighting for our rights, for our pain and suffering,” Mendoza said. “I’m disappointed and saddened to see what you’ve become. And today, I ask all the members of this committee, think about your loved ones, think about Americans, think about our loss, and think about the fairness under the rule of law.”\n\nEvery year, about 2,000 Americans are killed by illegal aliens according to an analysis by Rep. Mo Brooks (R-AL). Of the roughly 150,000 federal inmates in Bureau of Prisons custody, more than 40,000 are illegal aliens indicating that more than 25 percent of the federal prison population came to the U.S. illegally. Only about 10 percent of the incarcerated population is in federal custody with the remaining 90 percent in state and local custody.\n\nJohn Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.", "description": "Angel Mom Mary Ann Mendoza, head of the Angel Families organization, scolded pro-sanctuary city Senators during a committee hearing.", "authors": ["John Binder"], "top_image": "https://media.breitbart.com/media/2019/10/Screen-Shot-2019-10-23-at-5.45.39-PM-640x335.png", "published_at": "2019-10-23"}