{"pub": "cbc", "url": "https://cbc.ca/news/world/chris-collins-pleads-guilty-insider-trading-1.5304750", "downloaded_at": "2019-10-02 00:32:43.016562+00:00", "title": "Former congressman Chris Collins pleads guilty in insider trading case | CBC News", "language": "en", "text": "Former congressman Chris Collins pleaded guilty Tuesday in an insider trading case, a day after he resigned from the U.S. House of Representatives and set off a scramble to fill his seat in his Republican-leaning district.\n\nCollins had initially denied charges he leaked confidential information about a pharmaceutical company and was set to go to trial next year in federal court in Manhattan on conspiracy, securities fraud and other charges. But on Monday, the court filed papers saying the Republican from western New York would be withdrawing his not guilty plea and he submitted a resignation letter to Congress.\n\nAfter his plea, Collins expressed regret and said he had failed his constituents.\n\nWith Collins's departure, it will be up to Democratic Gov. Andrew Cuomo to set a special election to replace him. The governor said in a radio interview Tuesday that the timing remains uncertain for an election that's expected to now draw even more candidates to an already crowded field.\n\n\"The question is: When can I do it?\" Cuomo said. \"But sooner rather than later is my inclination.\"\n\nFamily dumped stock\n\nThe case against the 69-year-old Collins stemmed from his business dealings with Innate Immunotherapeutics Ltd., a biotechnology company headquartered in Sydney, Australia. He was the company's largest shareholder and sat on its board.\n\nAccording to the indictment, Collins was attending the Congressional Picnic at the White House in 2017 when he received an email from the company's chief executive saying that a drug developed to treat multiple sclerosis had proven to be a clinical failure.\n\nThe next morning, according to the indictment, the former representative's son, Cameron Collins, began selling his shares, unloading enough over a two-day period to avoid $570,900 US in losses before a public announcement of the drug trial results. After the announcement, the company's stock price plunged 92 per cent.\n\nCameron Collins is accused of passing along the information to his fiancée's father, so he could also dump his stock. The son is expected to plead guilty on Wednesday.\n\nBefore Collins's resignation, three Republicans had launched campaigns since the spring while others had said they were waiting to see whether Collins would seek another term. The declared Republicans are attorney and former judge Beth Parlato, state Sen. Christopher Jacobs, a former New York secretary of state and Erie County, N.Y., clerk, and state Sen. Robert Ortt, a veteran and former North Tonawanda, N.Y., mayor.\n\nMeanwhile, an effort to recruit Medal of Honor recipient David Bellavia to run has been under way for months, led by Republican strategist Michael Caputo, who advised President Donald Trump's campaign. The Iraq war hero ran for Congress in 2012 and lost to Collins in the Republican primary. Bellavia has not said whether he will enter the race.\n\nFor the Democrats, Nate McMurray, whom Collins narrowly defeated in 2018, already had committed to a rematch.", "description": "Former congressman Chris Collins pleaded guilty Tuesday in an insider trading case, a day after he resigned from the U.S. House of Representatives and set off a scramble to fill his seat in his Republican-leaning district.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5304806.1569960297!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/chris-collins.JPG", "published_at": "2019-10-01"}