{"pub": "news24", "url": "https://fin24.com/Economy/South-Africa/ex-saa-chair-dudu-myeni-no-show-in-delinquency-case-20191007", "downloaded_at": "2019-10-07 12:19:42.988170+00:00", "title": "Ex-SAA chair Dudu Myeni no-show in delinquency case", "language": "en", "text": "The former chairperson of national carrier SAA, Dudu Myeni, on Monday failed to show up in court for the start of a case seeking to have her declared a delinquent director.\n\nThe case, which has been in the making since 2017, is being brought by the Organisation Undoing Tax Abuse and the SAA Pilots Association. They say it is based on her leadership when she was chair of the flag carrier's board between December 2012 to October 2017.\n\nNeither Myeni nor her legal representative were present in court on Monday.\n\nThe applicants' attorney, Carol Steinberg, read out to the court examples of the numerous interactions the applicants' lawyers had with Myeni since serving her with a summons in March 2017. She also related the difficulty they encountered when they tried to locate her after legal firm ENS withdrew their services in June.\n\nShe told the court that, when they eventually made contact with her, she said she was unemployed and could not afford a lawyer. The court also heard that contact was made with Myeni on Monday morning, where she indicated her intention of speaking with the judge.\n\nPresiding Judge Ronel Tolmay said it would be improper to make private contact with anyone outside the court process. She has allowed Myeni the opportunity to present herself before the court on Tuesday.\n\nTolmay said that like any citizen, Myeni would be allowed access to state-funded legal aid if she cannot afford a lawyer. Myeni’s previous lawyer, Daniel Mantsha, withdrew his services in September.\n\nSpeaking after the court proceedings on Monday, Outa Chief Executive Wayne Duvenage said the organisation was ready to proceed. He added he was not surprised by Myeni’s no-show.\n\n“She has played a good game of ducking and diving, it is the same behavior that she has previously demonstrated when she appeared before Parliament,” he said, adding “this is a serious case”.\n\nIf she is declared a delinquent director she will be blocked from holding any position as a director in the future.\n\nUnder Myeni’s tenure, the airline suffered losses amounting to R10.5bn, according to Outa. Myeni, who was seen as a close ally of former President Jacob Zuma, has denied allegations linking her to poor governance at the state-owned carrier.", "description": "The former chairperson of the national carrier has been granted the opportunity to present herself in court on Tuesday.", "authors": ["Sibongile Khumalo"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9018/45c9e4b99e0b429385e45884448f17c0.jpg", "published_at": "2019-10-07"}