{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/30/WS5db9767aa310cf3e35574849.html", "downloaded_at": "2019-10-30 14:23:52.218980+00:00", "title": "10 Chinese teenagers win national award for filial piety", "language": "en", "text": "chinadaily.com.cn | Updated: 2019-10-30 19:39\n\nA ceremony that will honor 10 children for their heartwarming life stories will be aired on CCTV-1 and CCTV-4 on November 1, 2019. [Photo/cctv.com]\n\nTo celebrate traditional Chinese virtues and encourage young generations to engage in good deeds, national public benefit event Searching for the Filial Teens will honor 10 children for their heartwarming life stories.\n\nSet up in 2013, the annual project has been one of the best received programs on China Central Television (CCTV). This year, more than 1,000 teenagers nationwide have been registered for the show by CCTV reporters, local government and online nominations.\n\nThe ceremony will be aired on CCTV-1 and CCTV-14 this Friday, with guests like astronaut Yang Liwei, China's first man in space, CCTV news anchor Li Xiuping and personality Ju Ping to present the prizes.\n\nAccording to chief director Zhao Yingxin, the youngest award winner is seven years old, the oldest 15. They come from backgrounds but what they share is their devotion and love for family and parents.\n\nYu Qiwei from Chengdu, Southwest China's Sichuan province, takes care of his mother who suffers from cerebral atrophy after his father died in an accident. Sun Meiping, an 11-year-old from the rural area of East China's Shandong province, helps her father to look after her paralyzed mother.\n\nSeven-year-old boy Zhao Zehua living in Xi'an, Northwest China's Shaanxi province, became an online celebrity for helping out with his family's steamed bun business. Li Xinke, a girl from East China's Zhejiang province, saves money to support the elderly without any family.\n\nDuring the award ceremony, 10 short films introducing their stories will be screened. The audience will be able to hear from these inspiring kids together with CCTV presenters Bai Yansong and Ouyang Xiadan.\n\nOther cultural performances including a student choir and poetry reading will represent classic songs My Country, My Home and Mother in My Dream. To the Most Beautiful Teenager with Filial Piety, a poem written for this project, will create the climax for the entire evening, expressing praise and a vision for a better future.", "description": "To celebrate traditional Chinese virtues and encourage young generations to engage in good deeds, national public benefit event Searching for the Filial Teens will honor 10 children for their heartwarming life stories.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/30/5db9767aa310cf3e97a3974a.jpeg", "published_at": "2019-10-30"}