{"pub": "businessinsider", "url": "https://businessinsider.com/joaquin-phoenix-joker-problematic-connects-mental-illness-and-violence-2019-10", "downloaded_at": "2019-10-05 22:59:28.236703+00:00", "title": "'Joker' makes an explicit connection between mental illness and violence. Here's why that's dangerous and wrong.", "language": "en", "text": "WARNING: Major spoilers ahead for Todd Phillips' \"Joker.\"\n\nThe DC Comics film, in theaters Friday, blames the supervillain's legendary cruelty on his mental illness.\n\nIt suggests that people with mental illnesses are inherently violent, especially without proper treatment.\n\n\"What do you get when you cross a mentally ill loner with a society that abandons him and treats him like trash?\" Joker says, just before shooting his childhood hero in the face on live TV.\n\nDrawing this connection exacerbates stereotypes about people with mental illnesses. It also plays directly into the hands of anti-gun control lawmakers, who often blame mental illness when gun violence occurs.\n\nIn reality, people with mental illnesses are far more likely to hurt themselves — or to be victims of violence — than they are to hurt other people.\n\nVisit Insider's homepage for more stories.\n\nTodd Phillips' \"Joker,\" in theaters Friday, has already stirred up strong reactions to its unapologetic violence and moral ambiguity.\n\nThe new film tells the origin story of Batman's infamous foe. It stars Joaquin Phoenix as Arthur Fleck, a lonely-turned-nihilistic outcast who sees the world as cruel and unjust.\n\nSome have worried that \"Joker\" glorifies revenge and could inspire similarly demoralized men to mimic the villain's actions. Law enforcement officials have expressed concerns about shootings at theaters.\n\nRead more: The NYPD says 'Joker' movie screenings this weekend will be 'closely monitored'\n\nThese concerns certainly feel valid.\n\n\"Joker\" seems to intentionally reflect modern headlines and societal fears, like the rise of dangerous incels and senseless public violence. But rather than reflect the seeming motivations of real-life killers such as Elliot Rodger, Alek Minassian, and Dylann Roof, who claim to have acted out of perceived rejection, self-loathing, and bigotry, the movie does something more troubling. It blames the supervillain's legendary cruelty on mental illness.\n\nThis is your last chance to head back before spoilers.\n\nArthur Fleck is painted as a lonely outcast who struggles with depressive thoughts. Courtesy of Warner Bros. Pictures\n\n\"Joker\" never diagnoses Fleck or clarifies what \"condition\" he has, but it does have him explicitly reference his experiences with mental illness on numerous occasions.\n\nHe's introduced as someone who attends required therapy sessions with a social worker, who was previously \"locked up in the hospital.\" Fleck also specifies that he takes seven different medications, \"Surely they must be doing something,\" his social worker says.\n\n\"The worst part about having a mental illness is people expect you to behave as if you DONT,\" Fleck writes in his journal, replacing the \"O\" with a smiley face.\n\nFleck's journal includes jokes, thoughts, photos of naked women, and disturbing doodles. Warner Bros/YouTube\n\nThe film condemns society's lack of resources for people with mental illnesses but turns them into perpetrators\n\n\"Joker\" tries to signal to its viewers that it cares deeply about Fleck's mental health and that it sympathizes with his plight. Fleck's mental health begins to decline after Gotham slashes funding for social services, forcing him to abandon his therapy sessions and making his medications inaccessible.\n\n\"The movie is very much a commentary on how society doesn't do enough to nurture people who experience mental illness,\" Business Insider's Jason Guerrasio wrote in his review.\n\nBut for a movie that does a lot of hand-wringing about our treatment of people with mental illnesses, it sure gives us plenty of reasons to dislike and distrust them.\n\nThe film explains Joker's characteristic fits of laughter as the symptom of a condition. Niko Tavernise/Warner Bros\n\nEvery aspect of Fleck's neuroatypicality is stigmatized, coded as a reason to be suspicious of him — and used as pretext for his descent into violence.\n\nThe film even explains Joker's characteristic fits of laughter — historically seen as a symbol of his devilishness, of the delight he takes in cruelty — as the symptom of a condition. Here, it's an uncontrollable response to stress, similar to Tourette Syndrome.\n\nRather than effectively advocating for mental health resources, \"Joker\" plainly tells us to be wary of people who exhibit symptoms of mental illness.\n\n\"Joker\" makes explicit connections between his mental illness and his acts of violence\n\nOf course, there's always been a kind of \"he's crazy\" allure about the Joker. Even Heath Ledger's Oscar-winning performance as the villain was criticized for \"exacerbating stereotypes about mental health.\"\n\nRead more: The Joker is one of the oldest villains in comic book history and has undergone several iterations since 1940. Here's how the character evolved over the years.\n\nBut this vague characterization has worked in the past because the connection has never been explicit. \"The Dark Knight\" made a point to muddle Joker's backstory, having Ledger's villain tell multiple different stories about how he got the scars on his face. He was more sociopathic than anything else; he caused chaos for the sake of it.\n\nHeath Ledger posthumously won an Oscar for his role in \"The Dark Knight.\" Warner Bros\n\nPhoenix's Joker, by contrast, has very specific triggers for his violence.\n\nHe commits his first slew of murders because three Wall Street-type men take offense to his Tourettic laughter. He leans further into violence when he stops taking his medications, claiming he feels \"much better\" without them, just before embarking on a killing spree.\n\nMost notably, he names his mental illness as a specific motivation for violence at the end of his climactic monologue, which sounds like the movie's thesis statement.\n\n\"What do you get when you cross a mentally ill loner with a society that abandons him and treats him like trash?\" Joker says, just before shooting his childhood hero in the face.\n\nDrawing this connection plays directly into the hands of anti-gun-control lawmakers\n\nArthur Fleck slowly transforms into the Joker. Niko Tavernise/Warner Bros\n\nNearly one in five US adults live with some form of mental illness, according to the National Institute of Mental Health. And yet, the myth persists that people with mental illnesses should be feared or avoided.\n\nNot only does \"Joker\" play into that stereotype, it also plays directly into the hands of pro-gun lawmakers, who so often blame mental illness when gun violence occurs.\n\nIt seems that many politicians, most of whom are financially backed by the National Rifle Association, see mental illness as an easy scapegoat for our nation's gun violence crisis. After mass shootings, the narrative is often turned towards mental health reform (which, to be clear, we do need) as a means of distracting from the more obvious solution of gun control.\n\nRead more: There have been 289 mass shootings in the US so far in 2019 — here's the full list\n\nPresident Donald Trump, for example, has frequently blamed \"the mental illness problem\" for mass shootings and even suggested \"involuntary confinement\" for mental illnesses.\n\nA memorial in Dayton, Ohio after the mass shooting in August. Photo by Jeremy Hogan/SOPA Images/LightRocket via Getty Images\n\n\"We must reform our mental health laws to better identify mentally disturbed individuals who may commit acts of violence and make sure those people, not only get treatment, but when necessary, involuntary confinement,\" Trump recently said after two shootings in El Paso, Texas and Dayton, Ohio, adding, \"mental illness and hatred pulls the trigger, not the gun.\"\n\nRead more: Trump incorrectly blamed mental illness for mass shootings, but blocked a rule that would have made it harder for some people with mental illnesses to buy guns\n\nConsider how \"Joker\" feeds this talking point: Fleck only begins to commit acts of violence when his friend gives him a gun. But each of his murders is preceded by an explicit mention of his mental illness or, in the case of his laughter, a visible symptom of it.\n\nPeople with mental illness are far more likely to hurt themselves — or to be victims of violence — than they are to hurt other people\n\nIn real life, people with mental illnesses are much more likely to hurt themselves than others. Niko Tavernise/Warner Bros\n\nAccording to Time to Change, a UK-based organization that aims to combat mental health discrimination, \"over a third of the public think people with a mental health problem are likely to be violent.\"\n\nIn reality, there's no factual or scientific evidence to suggest a connection between mental illness and violence.\n\nMass shootings, for example, are very rarely committed by people with mental health issues. And multiple studies have found that less than one percent of annual gun homicides are committed by people with mental health issues.\n\nA Swedish study published in 2006 found that only three to five percent of violent crimes are perpetrated by someone with a mental illness — and a Swedish study published in 2018 found that people with mental illness are nearly five times more likely to be murdered.\n\nMost importantly, as Time noted earlier this year, \"people with mental illness are much more likely to hurt themselves than others. Two-thirds of gun deaths in this country are suicides, according to the U.S. Centers for Disease Control and Prevention.\"\n\nRobert De Niro plays Murray Franklin, a late-night talk show host, in \"Joker.\" Niko Tavernis/Warner Bros\n\nInterestingly, the climactic act of violence in \"Joker\" appears to draw from a real-life incident, but flips it upside down. When the Joker shoots a late-night talk show host on live TV, the mythology of Christine Chubbuck comes to mind.\n\nChubbuck, a newscaster in Florida, shot herself during a live broadcast in 1974. Her story has recently reentered the zeitgeist with multiple films made in 2016 about her life and legacy.\n\n\"She was terribly, terribly, terribly depressed,\" her mother told reporters at the time. \"No close friends, no romantic attachments or prospects of any... She couldn't register with people... She felt if you've tried as hard as you can, you've prepared yourself, you work hard, you reach your hand out to people and nobody takes it, then there's something wrong with your drumbeat.\"\n\nThere are clear parallels between Chubbuck's characterization and the Joker's new origin story. Only in the real-life version, the person who struggled with depression killed herself, not other people.\n\n\"Joker\" paints the villain's violent actions as inevitable because of his depression and psychosis. This only serves to further stigmatize mental illness, painting its very existence as inherently dangerous — and deflecting attention from real predictors of violence.", "description": "The film blames the villain's cruelty on his mental illness — suggesting that people with mental illnesses are inherently violent.", "authors": ["Callie Ahlgrim"], "top_image": "https://image.businessinsider.com/5d98d86f695b5816896248bf?width=1200&format=jpeg", "published_at": "2019-10-05"}