{"pub": "yahoo", "url": "https://news.yahoo.com/hassan-rouhani-tells-united-nations-170007853.html", "downloaded_at": "2019-09-27 02:44:43.056694+00:00", "title": "Hassan Rouhani tells United Nations that he will not meet Donald Trump while sanctions remain", "language": "en", "text": "Hassan Rouhani has ended weeks of speculation about a possible meeting with President Donald Trump, with the Iranian president insisting that he could not talk to the US while sanctions remain in place.\n\n“I can announce here that our response to any negotiations under sanctions is negative,” he told world leaders, gathered at the United Nations.\n\n“The government and people of Iran have remained steadfast under sanctions in the past one and a half years, and will never negotiate under poverty and sanctions.\n\n“Stop the sanctions, so as to open the way for the start of negotiations. Instead of the show of negotiations, you should return to the reality of negotiations.”\n\nThe announcement will disappoint Boris Johnson, the British Prime Minister, French president Emmanuel Macron, and Germany’s Angela Merkel – all of whom have urged both Mr Rouhani and Mr Trump to sit down and talk.\n\nBoris Johnson and Hassan Rouani in Tehran in December 2017, while Mr Johnson was still Foreign Secretary More\n\n“What is important is that, if he leaves the country without meeting with President Trump, this is a lost opportunity,” Mr Macron told Mr Rouhani on Tuesday evening. “Because he will not come back in a few months. And President Trump will not go to Tehran so they have to meet now.”\n\nSince the US withdrew from the nuclear deal in June 2017, Europe has vowed to work with Iran to keep the agreement alive.\n\nMr Johnson, sitting beside Mr Rouhani and Mr Macron, concurred.\n\n“I think I agree with Emmanuel,” he said. “You need to be on the side of the swimming pool and jump at the same time.”\n\nTheir words evidently did little to sway the Iranian leader. Mr Rouhani gave his European counterparts short shrift in his speech, rebuking them for not doing enough to keep the Iran nuclear deal alive.\n\n\"We only heard beautiful words, while witnessing no effective measures,” he said.\n\n\"It has now become clear, for all, that the US turns back to its commitments and Europe is unable and incapable of meeting its commitments.\"\n\nThe Iranian president warned the US that they should not push his country too far.\n\n“Our region is on the verge of collapse. A single blunder can cause a big fire,” he said. “We shall not tolerate the provocative intervention of foreigners.”\n\nMr Rouhani referenced the summer of tanker seizures, saying that “recent incidents have seriously endangered security,” and urging all countries involved to work together peacefully for a resolution.\n\n“Security will not be supplied by American weapons and intervention,” he said.", "description": "Hassan Rouhani has ended weeks of speculation about a possible meeting with President Donald Trump, with the Iranian president insisting that he could not talk to the US while sanctions remain in place. “I can announce here that our response to any negotiations under sanctions is negative,” he told world", "authors": ["Harriet Alexander"], "top_image": "https://s.yimg.com/uu/api/res/1.2/42WdhVcRv01nzJRwJOZsvg--~B/aD0xMjUwO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_258/8ea8d447700f7939ef3d66d0a9c99574", "published_at": "2019-09-25"}