{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7542385/Dietitian-Susie-Burrell-reveals-late-night-snacks-avoid-want-lose-weight.html", "downloaded_at": "2019-10-06 05:37:34.496456+00:00", "title": "Dietitian Susie Burrell reveals late-night snacks you should avoid if you want to lose weight", "language": "en", "text": "Dietitian Susie Burrell (pictured) has listed the treats you should avoid eating if you want to lose weight\n\nIf you're trying to drop a dress size but the waistline just won't budge, your late-night munchies could be holding you back.\n\nDietitian Susie Burrell, from Sydney, has listed the treats you should avoid eating if you want to lose weight - and the healthier alternatives you can eat if you are feeling peckish after dinner.\n\nTaking to her blog, Susie said indulging on hundreds of extra calories can affect hormones, sleep and weight.\n\nSnacks to avoid\n\nSurprisingly, Susie said dark chocolate can do more harm than good to your body if you are trying to lose weight.\n\n'While we are told that dark chocolate is a better option than milk, the reality is dark chocolate is still high in sugar and fats so best avoided at night if your goal is weight loss,' she said.\n\nSusie said you should avoid things like dark chocolate and even hot chocolate after dinner if you want to lose weight (stock image)\n\nWhile milk is associated with better sleep quality, Susie suggested avoiding flavoured dairy beverages such as hot chocolate before bedtime.\n\nShe said while some hot chocolate brands are advertised as low in calories and less sugar, they often contain sweeteners which can 'prime you to seek out more sweet good and keep snacking'.\n\nDespite being touted as the 'healthier' version of crunchy chips, Susie said a close inspection of the label will reveal ingredients that are relatively high in fat and calories.\n\nShe said other treats to avoid are cheese and dips and biscuits.\n\nIf you're feeling peckish in front of the television screen, Susie said plain popcorn is a healthy snack option to eat (stock image)\n\nHealthy alternatives\n\nIf you're feeling peckish in front of the television screen, Susie said plain popcorn is a healthy snack option to eat.\n\n'A couple of cups of plain popcorn contains less than 10g of carbs and is a fibre rich, low calorie snack option,' she said.\n\nContaining virtually no calories, chopped vegetables, berries and passion fruit are perfect for munching on without feeling any guilt.\n\nIf you have a sweet tooth, Susie said low-calorie ice creams are another healthy option to curb your sugar cravings after dinner.\n\n'Not exactly calorie free but a lot lighter than regular ice-cream, the growing range of low calorie treats including Halo Top can contain as few as 100 calories while still offering a sweet hit after your evening meal,' she said.\n\nSusie said you can make low-calorie crackers with Vegemite or light cream cheese with tomato as a healthy snack option.", "description": "Dietitian Susie Burrell, from Sydney, has listed the snacks you should avoid eating if you want to lose weight - and the healthier alternatives you can eat if you are feeling peckish after dinner.", "authors": ["Cindy Tran For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/05/19350598-0-image-a-129_1570334461810.jpg", "published_at": "2019-10-06"}