{"pub": "usatoday", "url": "https://usatoday.com/story/opinion/2019/10/24/dont-trust-facebook-elections-privacy-libra-terrible-idea-column/4075693002", "downloaded_at": "2019-10-24 14:03:40.695497+00:00", "title": "We can't trust Facebook on elections, privacy or risks of a new Libra cryptocurrency", "language": "en", "text": "Facebook and other platforms have enabled election interference and much worse. So far governments have not been willing or able to restrain them.\n\nMark Zuckerberg believes he is entitled to make decisions that affect the lives of billions. I disagree. Mark wants us to leave him alone to run his business. I think that is a terrible idea.\n\nFrom 2006 to 2009, I was one of Mark Zuckerberg’s advisers. My relationship with him was extremely positive and in many ways, I still respect Mark. Unfortunately, Facebook’s success has undermined democracy, public health, privacy and economic competition. The company’s culture, business model and algorithms will continue to cause harm until policymakers and users insist on reform. In 2016, when I first observed bad actors exploiting Facebook to interfere in democracy and infringe on civil rights, I reached out to Mark and Facebook COO Sheryl Sandberg prior to the presidential election to warn them, but they did not take my warning seriously. That is when I abandoned my long support for Facebook and became an activist.\n\nRegulation hasn't restrained Facebook\n\nTestifying Wednesday on Capitol Hill, Zuckerberg acknowledged that Facebook has made mistakes and lost trust. \"This has been a challenging few years for Facebook. We understand we have a lot to do to live up to people’s expectations on issues like privacy and security,\" he told the House Financial Services Committee. He said government regulators should help Facebook tackle these issues, and policymakers should not penalize Libra, the company’s new cryptocurrency project.\n\nNo one should be fooled by Mark. The issues at Facebook begin with a culture that is obsessed with connecting the whole world on a single network and then using a massive trove of personal data to influence the choices and behavior of users. The damage enabled and amplified by Facebook and the companies it owns comes in many forms.\n\nFacebook CEO Mark Zuckerberg testifies before the House Financial Services Committee on Oct. 23, 2019. (Photo: Chip Somodevilla/Getty Images)\n\nElection interference on Facebook, Instagram and WhatsApp in the United Kingdom, the United States, Brazil and othercountries. Terrorism in New Zealand. Mass murders in the United States and Europe. An apparent “textbook example of ethnic cleansing” in Myanmar, according to the United Nations. Extrajudicial killings in the Philippines. Hate speech globally. Bullying of pre-teens and teens, especially on Instagram. Massive invasions of privacy, including the indiscriminate sharing of personal information with other corporations. Anticompetitive behavior against would-be competitors, advertisers and suppliers. The list goes on and on.\n\nLibra cryptocurrency is a terrible idea\n\nNo one at Facebook intended to do harm, but the company’s culture treats harm as an acceptable cost of success. The culture, business model and algorithms drive Facebook to pursue growth and profits without regard for the rights of others, which, at global scale, makes harm inevitable. And government regulation, which Mark said Wednesday that he supports, has thus far been unsuccessful at restraining the company.\n\nThere was plenty of skepticism Wednesday about Facebook’s proposed international cryptocurrency, Libra. Rep. Scott Tipton, R-Colorado, for instance asked about the potential for \"major hacks\" of sensitive information, and even Zuckerberg said the project entailed risk. I think is a terrible idea and should be blocked. Libra has been designed to compete with the dollar and Euro as a reserve currency. Along with control of legitimate force — the military and police — control of currency is the foundation for sovereignty in any country. A reserve currency under the control of a private corporation could threaten democratically-elected governments, something that should not be undertaken lightly.\n\nFirst Amendment champion: Kudos to Facebook CEO Mark Zuckerberg for defending free speech at a tough moment\n\nFacebook argues that Libra would enable mobile banking services in emerging countries without bank branches, but Libra would also allow money to move outside the financial system, potentially avoiding taxation and currency controls. I believe there is a role for stable cryptocurrencies, but full integration into the global financial system should be a prerequisite. Under no circumstances should a private corporation with an awful track record of public accountability be allowed to create one.\n\nScary social media economic model\n\nUsers of internet platforms like Facebook, Instagram, Google, YouTube, TikTok, Amazon, Microsoft and Twitter love the convenience and functionality which they get without a monetary cost. Most people are comfortable giving up some personal data and being targeted with ads. Unfortunately, the reality of Facebook and other internet platforms is much scarier. They employ an economic model that Harvard professor Shoshana Zuboff calls \"surveillance capitalism.\" Practitioners convert human experience into data, process it into a data voodoo doll that is a complete representation of our digital lives, sell behavioral predictions based on what they know and then use the data voodoo dolls to manipulate search results and our behavior.\n\nFacts or fakes: Facebook refusal to curb fake Nancy Pelosi drunk video highlights need for responsibility\n\nThanks to business models based on monopolizing attention, platforms prey on the parts of human psychology that we are powerless to resist. Their algorithms amplify fear and outrage because that is the content most likely to engage the largest number of users. We call such content hate speech, disinformation and conspiracy theories. Platforms do not amplify harmful content because it is good for us. They do so because it is good for them.\n\nThe people who run internet platforms are not bad, but they operate in a business climate with few rules and little enforcement. No government has been able to prevent platforms from enabling election interference or any other violation of societal norms. Policymakers fear that constituents will not tolerate any change in the services they love. Unfortunately, democracy is at risk. Our ability to make our own choices is at risk. Our children’s future is at risk.\n\nRoger McNamee, an early investor in Facebook and Google and founding partner of Elevation Partners, is the author of \"Zucked: Waking up to the Facebook Catastrophe.\" Follow him on Twitter: @Moonalice\n\nYou can read diverse opinions from our Board of Contributors and other writers on the Opinion front page, on Twitter @usatodayopinion and in our daily Opinion newsletter. To respond to a column, submit a comment to letters@usatoday.com.\n\nRead or Share this story: https://www.usatoday.com/story/opinion/2019/10/24/dont-trust-facebook-elections-privacy-libra-terrible-idea-column/4075693002/", "description": "Facebook and other platforms have enabled election interference and much worse. So far governments have not been willing or able to restrain them.", "authors": ["Roger Mcnamee", "Opinion Contributor", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/23/USAT/10c3505e-b751-46b0-b992-093aac53ca73-GTY_1177729974.JPG?crop=4149,2334,x1,y97&width=3200&height=1680&fit=bounds", "published_at": "2019-10-24"}