{"pub": "fox", "url": "https://foxbusiness.com/features/airports-with-cheapest-duty-free-stores", "downloaded_at": "2019-09-22 13:10:41.778464+00:00", "title": "These airports have the cheapest duty-free stores in the world: Report", "language": "en", "text": "If you’re looking for airports with the cheapest duty-free stores, you should head to Malaysia, Singapore or the Cayman Islands, according to a new report.\n\nContinue Reading Below\n\nMake sure to fly into (or out of) Kuala Lumpur International Airport in Malaysia, Singapore Changi Airport and Owen Roberts International Airport in Grand Cayman.\n\nThe suggestions come from travel advice website The Points Guy, which published a guide Wednesday to duty-free shopping, including which airports have the cheapest and most expensive stores.\n\nThe airports with the most expensive duty-free shops overall were Santorini Airport in Greece, Sydney Airport in Australia and Zurich Airport in Switzerland, according to the website.\n\nFor its report, TPG looked at the prices of 13 common duty-free items at 50 airports around the world. Those fit into four main categories: liquor, cosmetics, fragrances and tobacco products.\n\nAdvertisement\n\nKuala Lumpur International Airport in Malaysia (pictured) is one of three airports with the cheapest duty-free stores in the world, according to travel advice website The Point Guy. (iStock)\n\nSingapore Changi Airport (pictured) also has some of the cheapest duty-free stores in the world. (iStock)\n\nOwen Roberts International Airport in Grand Cayman, Cayman Islands, (pictured) is among the airports with the cheapest duty-free stores overall, The Point Guy found. (Google)\n\nTo compare prices, TPG converted foreign currencies to U.S. dollars.\n\nEven though no U.S. airports made it on the cheapest or most expensive duty-free store lists, the website did do a separate comparison among 14 stateside airports.\n\nOverall, Tampa International Airport in Florida was found to have the most expensive duty-free stores, while Daniel K. Inouye International Airport in Honolulu, Hawaii, had the cheapest.\n\nTPG found that Tampa, John F. Kennedy International Airport in New York and Los Angeles International Airport in California had the duty-free stores with the most expensive liquor, while the cheapest could be found in Hartsfield-Jackson Atlanta International Airport in Georgia, Miami International Airport and the Honolulu airport.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nDespite their high duty-free liquor prices, JFK and LAX also had some of the cheapest duty-free cosmetics and fragrances, according to TPG.", "description": "Kuala Lumpur International Airport, Singapore Changi Airport and Owen Roberts International Airport have the cheapest duty-free stores, according to a new report from The Points Guy.", "authors": ["Ann Schmidt"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/Singapore-Airport.jpg?ve=1&tl=1", "published_at": "2019-09-20"}