{"pub": "breitbart", "url": "https://breitbart.com/news/burrows-321-yards-helps-no-2-lsu-down-no-9-auburn-23-20", "downloaded_at": "2019-10-27 04:03:32.233253+00:00", "title": "Burrow’s 321 yards helps No. 2 LSU down No. 9 Auburn, 23-20", "language": "en", "text": "BATON ROUGE, La. (AP) — Joe Burrow bounced up immediately from a high-speed hit that looked like it could have given the LSU quarterback whiplash as he was sent crashing into the Auburn bench area.\n\nTrotting resolutely back to the line of scrimmage, Burrow resumed his school-record eighth career 300-yard passing performance in a tense, top-10 clash that put a premium on grit and perseverance.\n\nBurrow passed for 321 yards and a touchdown, ran for 47 yards and another score, and second-ranked LSU edged No. 9 Auburn 23-20 on Saturday.\n\n“If your quarterback shows toughness like that, it can kind of get your team going,” Burrow said. “If you lay down on the field and don’t hop right back up, it shows your team that you are not really into it.”\n\nThe victory ensured LSU (8-0, 4-0 SEC) would be unbeaten heading into its highly anticipated Nov. 9 tilt at Alabama, which entered this weekend ranked No. 1.\n\nClyde Edwards-Helaire rushed for 136 yards and touchdown for LSU, which wasn’t able to put away Auburn (6-2, 3-2) until Derrick Dillon recovered an onside kick with 2:31 left.\n\n“It was a gut check tonight,” LSU coach Ed Orgeron said, praising the way his players stuck together. “They didn’t want to be denied.”\n\nWhile LSU’s prolific, up-tempo spread offense rolled up 508 yards, the unit didn’t approach its 50.1-point scoring average against an Auburn defense that thwarted LSU drives into its territory with a pair of fourth-down stops and an interception.\n\n“They fought their guts out and our defense played unbelievable,” Auburn coach Gus Malzahn said. “We had opportunities and we didn’t seize the moment. We just didn’t get it done offensively.”\n\nLSU had not previously scored fewer than 36 points in a game, but Auburn’s defensive front put pressure on Burrow, sacking him three times.\n\nStill, Burrow didn’t flinch when he was leveled along the sideline after 14-yard scramble on third-and-12 in the first half. He completed five of his next six throws, ending with a 20-yard touchdown on a fade to Terrace Marshall Jr.\n\nBurrow completed 32 of 42 passes. His top target was Ja’Marr Chase, who caught eight passes for 123 yards.\n\n“We showed toughness today. It was not a pretty win by any means,” Burrow said. “SEC games aren’t going to be pretty. When you can come out on top of a top-10 team and feel like you could have played better, it’s always a good thing.”\n\nBo Nix completed 15 of 35 passes for 157 yards and one late touchdown to Seth Williams that gave Auburn the opportunity to set up a meaningful onside kick.\n\nD.J. Williams rushed for 130 yards for Auburn, which looked primed to go ahead by a touchdown in the third quarter when Williams sprinted into the open field from his own 20.\n\nSafety Grant Delpit forced Williams out of bounds just inside the 10, and Auburn couldn’t parlay the 70-yard run into a touchdown, settling for a field goal to make it 13-10.\n\nThat lead lasted until five minutes remained in the third quarter, in part because Burrow’s screen to Chase was stopped on fourth-and-goal from the Auburn 2. Later in the quarter, Burrow’s pass intended for Chase was intercepted by Roger McCreary at the Auburn 2.\n\nLSU hadn’t trailed that late in a game all season, but LSU finally pushed in front by going back to a running game that had struggled most of the first three quarters. Edwards-Helaire ran four straight times for gains for 45 yards, capped by his 6-yard score to put LSU in front 16-13.\n\nBurrow’s 7-yard rushing TD, capping another run-heavy drive, widened the lead to 23-13.\n\nTHE TAKEAWAY\n\nAuburn: Nix looked more prepared to play in a hostile environment than he did at Florida two weeks earlier. The freshman made his share of plays, but wasn’t quite consistent enough for Auburn to keep pace with a more seasoned and prolific LSU offense down the stretch.\n\nLSU: Defensively, the game was encouraging for LSU, which sacked Nix three times, held his completion percentage below 50 percent.\n\n“When our defense plays like that, nobody is going to beat us,” Burrow said.\n\nBut the offense has stalled in the red zone a half dozen times in the past two games. LSU has gotten away with it so far, but that might not cut it in Tuscaloosa.\n\nFLAG FEST\n\nAuburn and LSU combined to commit 27 penalties for 226 yards. Auburn was flagged 15 times, and much like in their loss at Florida, there were several pre-snap penalties that Malzahn called “a huge problem.”\n\n“We talked about that. I thought we were going to do better. We didn’t,” Malzahn said. “It was loud and all that, but it doesn’t matter.”\n\n‘BAMA BECKONING\n\nLSU players have largely avoided talking about the tilt in Tuscaloosa for fear of getting ahead of themselves. Now it sounds like they’re ready to embrace it.\n\nDiscussing how he expects his team to handle the next two weeks, LSU defensive lineman Rashard Lawrence said, “We live for the big moment.”\n\nUP NEXT\n\nAuburn: Hosts Mississippi on Saturday.\n\nLSU: Heads into its usual off week before its traditional early November date with Alabama.\n\n___\n\nMore AP college football: https://apnews.com/Collegefootball and https://twitter.com/AP_Top25", "description": "BATON ROUGE, La. (AP) — Joe Burrow bounced up immediately from a high-speed hit that looked like it could have given the LSU quarterback whiplash as he", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/26/330afa_auburn-lsu-football-13315-lsu-quarterback-joe-burrow-scrambles-in-an-ncaa-640x335.jpg", "published_at": "2019-10-26"}