{"pub": "yahoo", "url": "https://news.yahoo.com/alexandria-ocasio-cortez-chokes-up-during-climate-speech-my-dreams-of-motherhood-are-now-bittersweet-234032142.html", "downloaded_at": "2019-10-13 00:24:34.489613+00:00", "title": "Alexandria Ocasio-Cortez chokes up during climate speech: My 'dreams of motherhood now taste bittersweet'", "language": "en", "text": "\n\n\n\nU.S. Rep. Alexandria Ocasio-Cortez spoke passionately in Copenhagen about how climate change could affect her becoming a parent. (Photo: Ole Jensen/Getty Images) More\n\nAlexandria Ocasio Cortez spoke passionately about how climate change could affect her own future, including her dream of becoming a parent. The U.S. Congresswoman from New York, who at 29, is the youngest ever to have a seat in the House of Representatives, was in Copenhagen, Denmark on Friday at the C40 World Mayors Summit.\n\n“...I speak to you not as an elected official, or a public figure. But I speak to you as a human being. A woman whose dreams of motherhood now taste bittersweet because of what I know about our children’s future, and that our actions are responsible for bringing their most dire possibilities into focus,” Ocasio-Cortez told the crowd, sounding choking up.\n\n\n\n\n\n“I speak to you as a human being. A woman whose dreams of motherhood now taste bittersweet because of what I know about our children’s future, and that our actions are responsible for bringing their most dire possibilities into focus” -@AOC pic.twitter.com/Np2I9IigM3 — Justice Democrats (@justicedems) October 11, 2019\n\nShe continued by highlighting Hurricane Maria, “a climate-change powered storm,” which killed an estimated 3,000 Puerto Ricans in 2018, according to NPR.\n\n“American citizens. My own grandfather died in the aftermath,” Ocasio-Cortez told the crowd. “All because they were living under colonial rule, which contributed to the dire conditions and lack of recovery.”\n\nOcasio-Cortez also pointed out that the first victims of national disasters are most commonly ones who are already subjected to other discriminatory practices.\n\n“That is not a coincidence,” Ocasio-Cortez continued. “....The climate crisis’s path is first impacting those who have not only contributed to our emissions the least, but have already suffered greatly in the global history of inequality, colonization, and imperialism, stacking one injustice upon another.”\n\nOcasio-Cortez was joined by more than 90 mayors at the C40, as well as city delegates, climate experts, influencers, and business leaders. The event features a global coalition of leading cities, businesses and citizens focused on radical and ambitious climate action.\n\nBefore the event, Ocasio-Cortez shared on Instagram that she was nervous to speak in front of a crowd, according to Refinery29. “...I generally don’t know how well I did until after the fact,” she wrote. “Sadly, I am a perfectionist and I am working on being kinder to myself. It doesn’t help when literally any mistake I make is broadcast everywhere. But that has taught me to roll with it since I can’t hide.”\n\nRead more from Yahoo Lifestyle:\n\nFollow us on Instagram, Facebook, and Twitter for nonstop inspiration delivered fresh to your feed, every day.", "description": "U.S. Rep. Alexandria Ocasio-Cortez spoke passionately in Copenhagen about how the effects of climate change could affect her own future, including her dream of becoming a parent.", "authors": ["Megan Johnson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/BCLcLiMuSshnbRK4zZNtSA--~B/aD0zNTI4O3c9NTM3NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/2de6e1f0-ed3b-11e9-b3ee-2af2427d92f9", "published_at": "2019-10-12"}