{"pub": "atlantic", "url": "https://theatlantic.com/ideas/archive/2019/10/trumps-tweet-makes-me-proud-be-human-scum/600685", "downloaded_at": "2019-10-25 02:25:53.526613+00:00", "title": "I’m Proud to Be Called Human Scum", "language": "en", "text": "Nevertheless, I have opposed Trump’s political ambitions almost from the beginning: I warned against his election in early 2016, I deregistered from the Republican Party in May 2016 when his nomination was guaranteed, and I declined a couple of opportunities to be considered for positions in his administration. In November 2018, I helped found a group called Checks and Balances that has called for conservative lawyers to defend the rule of law against presidential assault; I’ve signed a letter with more than 1,000 other former prosecutors arguing that Trump has committed criminal obstruction of justice; and I’ve publicly called for his impeachment and removal. Though I am sure that Trump does not know me from Adam, I am confident that when he speaks of Never Trumper Republicans who are human scum, he means me.\n\nWhat makes me human scum? Evidently, a belief in enduring American ideals, like the rule of law and the value of a free press. A belief in a system of governance that enshrines the principle of checks and balances in our Constitution—a system in which Congress and the judiciary serve as limits on authoritarian executive overreach.\n\nMany conservative lawyers have been too quiet for too long. Now, in the wake of recent revelations, it is all the more important for us to speak up: First, to make our concerns and objections to Trump—already felt among conservatives devoted to the rule of law—more public, and second, to make sure that crucial legal principles do not get swamped in the counterreaction to Trump.\n\nSo I gladly step forward to reaffirm important American norms. To paraphrase the mission statement of Checks and Balances: I believe in the rule of law, the power of truth, the imperative of individual rights, and the necessity of civil discourse. I believe these principles apply regardless of the party or persons in power. I believe in “a government of laws, not of men.” I believe in free speech, a free press, separation of powers, and limited government.\n\nIn support of these values, I stand against an administration—any administration—that attempts to undermine the rule of law and denigrate these American truths: A president cannot overrule constitutional precedent by executive order; a president cannot order the Department of Justice to investigate his political opponents for alleged criminal acts; a president cannot “open up” the libel laws, or govern by lies; a president cannot punish political opponents who exercise their First Amendment freedom of speech.\n\nNo president should ever call the press the “enemy of the people”; no president should use his position for self-enrichment; no president should use his executive authority to withhold military aid authorized by Congress as leverage to solicit an investigation of his political opponent; and most assuredly, no president should seek to divide the nation, lifting up those who advance racial and religious grievances at the expense of national unity.", "description": "If the president thinks my support for the Constitution and the rule of law justifies that epithet, I’ll wear it as a badge of honor.", "authors": ["Paul Rosenzweig", "Senior Fellow At The R Street Institute", "A Principal At Red Branch Consulting"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/GettyImages_539489828-1/facebook.jpg?1571946897", "published_at": "2019-10-24"}