{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/kanye-west-boasts-undoubtedly-greatest-20719030", "downloaded_at": "2019-10-25 00:39:48.909761+00:00", "title": "Kanye West boasts that he is 'undoubtedly the greatest artist of all time'", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nIt's no surprise that Kanye West has proudly labelled himself \"the greatest artist of all time\", as he has always been quite fond of his own character.\n\nThe husband of Kim Kardashian made the bold statement in an interview about his new album, politics and religion to radio DJ Zane Lowe, where he mostly talked about himself.\n\nThe rapper boastingly shared: \"I am unquestionably, undoubtedly, the greatest human artist of all time.\n\n\"It's not even a question at this point. It's just a fact.\"\n\nKanye is soon due to release his album Jesus Is King, but he also announced that this Christmas he's releasing a new \"Sunday Service album\" called Jesus is Born after his recent move to convert to Christianity.\n\nWest confessed: \"Now that I'm in service to Christ, my job is to spread the gospel, to let people know what Jesus has done for me.\n\n\"I've spread a lot of things. There was a time I was letting you know what high fashion had done for me, I was letting you know what the Hennessey had done for me.\"\n\n(Image: GC Images)\n\nThe American star added that he's \"no longer a slave\", and is \"a son of God\", admitting that he's \"free\".\n\nHe also revisited the time of his Sunday Service performance at Coachella, and his Yeezus tour, which included a Jesus Christ lookalike.\n\n\"God was using me and it lined up amazing, like, literally the Sunday was Easter Sunday, Kanye said of his performance at Coachella,\" he reflected.\n\n(Image: Getty Images)\n\nKanye went on to discuss his meeting with US President Donald Trump .\n\nThe pair met last year, and Kanye made a decision to wear a Make America Great Again cap.\n\nWest also talked about his bid to run for President in the 2024 US Presidency. He said he is \"likely\" to run for President.\n\n(Image: Getty)\n\n\"There will be a time when I will be President of the United States and I will remember…any founder that didn't have the capacity to understand culturally what we're doing.\"\n\nHe finished off by dishing the dirt and addressing his ongoing beef with Drake.\n\n(Image: Getty)\n\n\"Me and Drake had this disagreement and he refused to speak to me for six months.\n\nThat was so painful…You cannot be in service to God and be mad at your brother next door…I go to Drake’s house with no security and just leave my number.\"", "description": "The rapper, 42, has branded himself as 'unquestionably, undoubtedly, the greatest human artist of all time'", "authors": ["Brogan-Leigh Hurst", "Image", "Gc Images", "Getty Images", "Getty"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20331921.ece/ALTERNATES/s1200/1_The-2019-Met-Gala-Celebrating-Camp-Notes-on-Fashion-Street-Sightings.jpg", "published_at": "2019-10-24"}