{"pub": "cbc", "url": "https://cbc.ca/sports/olympics/summer/trackandfield/moh-ahmed-bronze-medal-track-field-worlds-1.5303101", "downloaded_at": "2019-10-01 00:12:51.072104+00:00", "title": "Sports-no-CBC", "language": "en", "text": "Canada's Moh Ahmed stumbled after being clipped by an opponent late in the men's 5,000-metre final at the track and field world championships but recovered to reach the podium, earning a bronze medal in a time of 13 minutes 1.11 seconds on Monday in Doha, Qatar.\n\nAhmed led the race with about 500 metres left, dropped to fifth position and climbed back to third on the straightaway at Khalifa International Stadium to hold off Telahun Haile Bekele (13:02.29) of Ethiopia and Norway's Jakob Ingebrigtsen (13:02.93).\n\n\"I don't know where the hell I am,\" Ahmed told Scott Russell of CBC Sports after only his fourth 5,000 race of the season, including Friday's heat. \"It's definitely surreal. I made moves. I told myself I don't want to be a passenger. We want to make moves.\n\n\"I was sort of boxed in and I somehow snuck right through on the inside, took the lead with three laps to go and I said, 'F-it, let's go.' Third is good. I've been every single position off the podium and it's good to be on the podium on the first go here.\"\n\nWATCH | Moh Ahmed fights back to reach podium in Doha:\n\nCanadian Moh Ahmed reaches the podium with a time of 13 minutes 1.11 seconds. 3:03\n\nAhmed, 28, will race the 10,000 final on Sunday at 1 p.m. ET, the final day of the 10-day world championships.\n\nMuktar Edris successfully defended his world title in Monday's 5,000 in 12:58.85, with Ethiopian teammate Selemon Barega right behind in second (12:59.70).\n\nIt takes great courage and determination to fight back as he did over the final 100 metres. — CBC Sports analyst Dave Moorcroft on world 5,000-metre bronze medallist Moh Ahmed\n\nCBC Sports analyst Dave Moorcroft, who ran a world-record 13:00.41 in 1982, was impressed with Ahmed's time in hot and humid conditions.\n\n\"He was brilliant tactically,\" Moorcroft said. \"There was lots of jostling but he kept his composure and he didn't panic, even when Jakob Ingebrigtsen, Edris and Barega passed him.\n\n\"It takes great courage and determination to fight back as he did over the final 100 metres. He dragged the finish out of most of the field and showed amazing decision-making.\"\n\nEyeing podium in 10,000m\n\nWhat makes Ahmed's run so remarkable, Moorcroft pointed out, is he stayed out of trouble for the opening nine laps and let the Ethiopians do the heavy lifting.\n\n\"When he struck,\" said Moorcroft of Ahmed, \"he took the initiative away from [Edris and Barega] but they had the strength and speed to hang in and strike 200 metres from home to take gold and silver.\"\n\nTwo years ago, Ahmed placed sixth in the world final, posting a time of 13:35.43 in London.\n\n\"I almost had [an Olympic] medal in 2016,\" said Ahmed, who was fourth in Rio in 13:05.94. \"In 2017, I kind of fell off a little bit [and] 2018 was a terrible year for me [and] I said 'not again' with 150 [metres to go on Monday].\"\n\nThe Somalia-born, St. Catharines, Ont.-raised Ahmed won a Canadian title in 13:54.92 in late July in Montreal, one month after he ran a season-best 12:58.16 at the Diamond League's Golden Gala in Rome.\n\nEarlier this month, he paced his Bowerman Track Club teammates through 4,600 metres at sub-Olympic standard pace (13:13.50) at the Portland 5,000.\n\nRookie pro Justyn Knight 10th\n\nJustyn Knight, the former NCAA track and cross-country star at Syracuse University, placed 10th of 14 finishers in 13:26.63 on Monday. The first-year pro with Reebok Boston Track Club debuted at worlds in 2017, placing ninth in 13:39.15.\n\nWATCH | Justyn Knight discusses his performance in Doha:\n\nCanadian Justyn Knight reflects on his 10th place finish. 1:48\n\nKnight, 23, has time on his side, noted Moorcroft, and should learn and be inspired by Ahmed's achievement.\n\nAfter Monday's race, Ahmed brought the Toronto native into his celebration on the track with the Canadian flag.\n\n\"It's good to taste it,\" said Ahmed, the 2015 Pan Am champion in Toronto. \"I remember the 2014 Commonwealth Games [in Glasgow], fresh out of university [at Wisconsin-Madison], Cam Levins got third and said, 'Come with me.' It's good to do that for the young ones and [Knight] is a talented kid. I've been keeping my eye on him and have tried to mentor him as best as I could.\n\n\"We're really good buddies, and he's the next one up [in Canada]. I'm not going to be young forever.\"", "description": "Canada's Moh Ahmed stumbled after being clipped by an opponent late in the men's 5,000-metre final at the track and field world championships but recovered to reach the podium, earning a bronze medal in a time of 13 minutes 1.11 seconds on Monday in Doha, Qatar.", "authors": ["Doug Harrison Has Covered The Professional", "Amateur Scene As A Senior Writer For Cbc Sports Since Previously", "The Burlington", "Ont.", "Native Covered The Nhl", "Other Leagues For Faceoff.Com. Follow The Award-Winning Journalist"], "top_image": "https://i.cbc.ca/1.5303144.1569871051!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/ahmed-moh-190930-1180.jpg", "published_at": "2019-09-30"}