{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/27/mi-jung-hur-takes-2-shot-lead-into-weekend-in-indy", "downloaded_at": "2019-09-28 01:17:18.942522+00:00", "title": "Mi Jung Hur takes 2-shot lead into weekend in Indy", "language": "en", "text": "INDIANAPOLIS (AP) - Mi Jung Hur shot a 2-under 70 in windy conditions Friday to take a two-stroke lead into the weekend at the Indy Women in Tech Championship.\n\nA day after opening with a bogey-free 63, Hur had six birdies - four on par 5s - along with two bogeys and a double bogey to get to 11 under at Brickyard Crossing, the layout that features four holes inside the Indianapolis Motor Speedway oval.\n\n“It was very windy out there,” Hur said. “It was tough conditions on the course with the down and hurting wind, but I tried to enjoy with the wind. Living in Texas, which this is like normal in Texas, so it helped me a lot when I practice with this kind of wind on the range.”\n\nThe South Korean player won the Ladies Scottish Open last month for her third LPGA Tour victory.\n\nSakura Yokomine of Japan was second, following an opening 65 with a 70.\n\n“It was super windy today compared to yesterday, but I was managing to be able to shoot under par, so I was happy,” Yokomine said.\n\nMarina Alex, coming off the United States’ Solheim Cup loss to Europe, was 7 under with Puerto Rico’s Maria Torres. Alex had a 71, and Torres shot 68.\n\n“Conditions were crazy, so much different than yesterday,” Alex said. “Ton of wind from the start to finish. Some tough hole locations out there, too, with just the wind direction and how you were trying to get to the hole.”\n\nKendall Dye (69), Amy Olson (72), Tiffany Chan (65) and Pornanong Phatlum (72) were 6 under.\n\nHur birdied three of the first seven holes, then dropped strokes on the par-4 eighth and ninth. She rebounded with birdies on Nos. 10, 12 and 14, but gave two strokes back with the double bogey on the par-4 16th.\n\n“You have to forget about the bogeys,” Hur said. I’m just trying to focus on every shot and putt.”\n\nThe 29-year-old Hur was 12 when she first met close friend Yokomine.\n\n“Just having fun with her on the course, Hur said.\n\nYokomine and Torres are winless on the LPGA Tour.\n\n“One shot at a time,” Torres said. “I’ve been trying to work on being present on the shots. Now I have to keep it up for four rounds, just trying to hit every single shot with the information that we have.”\n\nDefending champion Sung Hyun Park and 2017 winner Lexi Thompson missed the cut. Park followed an opening 70 with a 77. Thompson, winless at the Solheim Cup, shot 76-71.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Mi Jung Hur shot a 2-under 70 in windy conditions Friday to take a two-stroke lead into the weekend at the Indy Women in Tech Championship.", "authors": ["The Washington Times Http"], "top_image": "", "published_at": "2019-09-27"}