{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7631521/Bishop-shot-church-wedding-critical-condition.html", "downloaded_at": "2019-10-30 23:27:48.087305+00:00", "title": "Bishop shot at church wedding 'in revenege act' still in critical condition", "language": "en", "text": "The family of a bishop who was shot in the chest while presiding at a church wedding in New Hampshire says he is still recovering from multiple gunshot wounds and remains in critical condition.\n\nStanley Choate, 75, was shot in the chest during the ceremony on October 12 at the New England Pentecostal Ministries in Pelham.\n\nDale Holloway, 37, of Manchester, faces charges of attempted murder and assault stemming from the shooting, which also wounded 60-year-old bride Claire McMullen. He has pleaded not guilty.\n\nChoate's oldest child, John Choate, told a Tufts Medical Center news conference in Boston on Wednesday that the family doesn't know Holloway.\n\nBishop Stanley Choate was shot in the chest during the attack at New England Pentecostal Ministries during a wedding ceremony. The bishop is pictured with his wife Ruth\n\nChoate's son, John Choate, told a Tufts Medical Center news conference on Wednesday that the family doesn't know Holloway. He thanked the first responders and medical staff that helped his father. He said the bishop constantly preaches love and forgiveness\n\nDale Holloway faces charges of attempted murder and assault stemming from the shooting, which injured bride Claire McMullen and bishop Stanley Choate. He has pleaded not guilty\n\nThanking the first responders and medical staff that helped his father, John said: 'While he has made slow progress, he has remained in critical condition since the incident.'\n\nHolloway is said to have stormed the wedding at the New England Pentecostal Ministries in Pelham.\n\nAuthorities said they are still investigating a motive but have said the groom, Mark Castiglione, is the father of a man recently charged with killing Holloway's stepfather.\n\nBrandon Castiglione, 24, is accused of killing Luis Garcia, 60, in Londonderry on October 1.\n\nChoate's son John said Wednesday: 'We want to stress that NEP Ministeries does not know the man accused of shooting my father, nor was the shooter a member of the ministry.'\n\nHe said the bishop constantly preaches love and forgiveness, adding: 'What I can tell you is, the bishop constantly teaches love and forgiveness, demonstrates kindness by helping anyone he could, always trying to do the right thing and his family and congregation alike respect and honor him.'\n\nHe said his father, who oversees five churches, has written books and recorded gospel albums.\n\nChurch minister Luis Garcia who was shot in the neck and killed. He is pictured with wife Patti\n\nAuthorities said they are still investigating a motive but have said the groom, Mark Castiglione, left, is the father of a man recently charged with killing Holloway's stepfather. Brendon Castiglione, right, was arrested over the death of Holloway's stepdad Luis Garcia\n\nHolloway is also accused of attacking his public defender during a jailhouse meeting, sending Michael Davidow, 52, to intensive care with a brain hemorrhage and no memory of the beating.\n\nAt his arraignment in the beating case, Holloway denied assaulting Davidow and said he got the attention of the officer after noticing the attorney had a nosebleed, WMUR-TV reported.\n\nHe said: 'I flicked the lights twice and knocked on the window for someone to come give him aid to his nose bleeding. His nose started bleeding and I ran to help, so I don't see where I went wrong here.'", "description": "Stanley Choate, 75, left, was shot in the chest during the ceremony on October 12. Dale Holloway, 37, right, has pleaded not guilty  to attempted murder and assault.", "authors": ["Associated Press", "Lauren Fruen For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/21/20396500-0-image-a-80_1572469649497.jpg", "published_at": "2019-10-30"}