{"pub": "metro", "url": "https://metro.co.uk/2019/10/06/circle-paddy-tears-confides-georgina-cerebral-palsy-10872420", "downloaded_at": "2019-10-07 00:07:04.608242+00:00", "title": "The Circle: Paddy tears up as he confides in Georgina about his cerebral palsy", "language": "en", "text": "Paddy and Georgina get emotional (Picture: Channel 4)\n\nNewcomer to The Circle, Paddy, just opened up to Georgina about his cerebral palsy and fans can’t handle how emotional the conversation got.\n\nIt all came about after contestants began playing a game called Paddy’s Picks, where they are given a theme and can select a photo from their private albums to match it, before Paddy decides which player’s picture was best.\n\nIn one of the categories, called No Filter, Georgina – who has Crohn’s – ends up sharing a photo of herself in a hospital bed.\n\nPaddy remarks: ‘It takes courage to put a picture like that up.’\n\nLater in the episode, he decides to start a private chat with Georgina to tell her that very sentiment.\n\nHe tells Georgina: ‘I think we could have a lot in common in terms of obstacles we’ve had to overcome. That picture you posted last night of you in the hospital was brave.’\n\nAdvertisement\n\nAdvertisement\n\nPaddy is then unsure whether or not to open up about his own disability, but decides to in the end.\n\nGeorgina in hospital bed (Picture: Channel 4)\n\nHe continues: ‘I know how hard it is to talk about your condition when people ask. I know this because I have cerebral palsy in my legs. I haven’t told people yet but felt I could trust you with this.’\n\nGeorgina is taken aback by the revelation, as Paddy hasn’t previously chosen to share any photos clearly showing his cerebral palsy to the group.\n\nThey both start crying.\n\nShe messages back: ‘May I ask why you feel you want to hide it from the group? It can remain our secret, but I don’t want you to feel like it’s something that you have to keep quiet.’\n\nPaddy responds: ‘It’s not that I’m ashamed or scared. It’s that I wanted to feel what it would be like for once to just be me and not be “that disabled guy”‘.\n\nThat was such a powerful conversation!\n\n*Sends Paddy and Georgina a virtual hug* #TheCircle pic.twitter.com/NWRe3pSmki — The Circle (@C4TheCircle) October 6, 2019\n\nFans immediately took to social media to share how emotional watching the scene made them.\n\nOne tweeted: ‘I cried when he told Georgina about his disability. When are humans gonna stop labelling each other and just see everyone as equal humans?’\n\nAdvertisement\n\nAdvertisement\n\nWhile another wrote: ‘Absolutely loved that chat between Georgina and Paddy, and the reason why this show is so different from Big Brother. When you are not face to face, it can lead to the best conversations because you are genuinely being yourselves.’\n\nThen another tweeted: ‘Genuinely powerful discussion of the Patient Experience of Georgina’s Crohns & Paddy’s Cerebral Palsy.’\n\nThe Circle continues Monday at 10pm on Channel 4.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Woody turns detective with Ella on The Circle to try to sniff out any catfishing contestants\n\nMORE: Richard Madeley’s wife Judy fell off sofa laughing as he flirted with Woody on The Circle", "description": "The Circle newcomer, Paddy, just confided in Georgina about his cerebral palsy and fans are getting super emotional about it all.", "authors": ["James Besanvalle"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/paddy-and-georgina_1570398871.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-06"}