{"pub": "businessinsider", "url": "https://businessinsider.com/samsung-frame-tv-deal-2019-9", "downloaded_at": "2019-09-16 23:24:07.095251+00:00", "title": "The Samsung Frame TV looks like a piece of art when not in use — right now, you can save up to $1,000 on one", "language": "en", "text": "Samsung\n\nThe picture quality of TVs is getting better and better, but TVs are also getting more and more subtle. Gone are the days when owning a TV meant using up a large portion of your living room. Now, you can have a TV that blends into the background — like Samsung's Frame TVs, which look like picture frames when they're not in use, allowing you to display photos and other images on your wall.\n\nSamsung has announced some pretty big discounts on its Frame TVs, making now an excellent time to buy one.\n\nThere are plenty of reasons you might want a Frame TV. As mentioned, they'll look like a natural part of your living room, but they also offer a pretty incredible picture quality. The TVs leverage Samsung's QLED technology, meaning that you'll get incredibly deep black levels and super bright and vivid colors. The TVs offer a 4K resolution and HDR support too.\n\nSamsung has also put a lot of effort into developing a smart platform for its TVs, and the Frame TVs are no exception to that rule. You can install your favorite streaming apps and services right to the TV — including the new Apple TV app.\n\nSo how much will you save on a Frame TV as part of this deal?\n\nFor the 43-inch model you'll pay $899.99— which is $600 off the normal price of $1,499.99. Sizes range up to the 65-inch model, which is available for $1,799.99. That's $1,000 off the normal price of $2,799.99. You'll save on the bezels, which turn the TV into a picture-looking device, too. Bezels come at up to $80 off, which isn't bad at all. That said, you might not need to buy a bezel separately unless you want a second one — during the sale, if you buy a Frame TV, you'll get a matching bezel for free.\n\nThe Frame TV sale runs until September 29. You can get a Samsung Frame TV for yourself using the link below.", "description": "Samsung's Frame TV offers a classy-looking design that blends into its surroundings — and the TV looks like any other painting or picture when not in use.", "authors": ["Christian De Looper"], "top_image": "https://amp.businessinsider.com/images/5d7ff9602e22af305353b9a5-1334-667.jpg", "published_at": "2019-09-16"}