{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/us-will-defend-international-order-being-undermined-by-iran-pentagon-chief", "downloaded_at": "2019-09-16 23:26:28.170163+00:00", "title": "US will 'defend' international order being 'undermined by Iran': Pentagon chief", "language": "en", "text": "US Defence Secretary Mark Esper said Monday that the US military is preparing a response to the attack on major Saudi Arabia oil facilities.\n\n[WASHINGTON] US Defence Secretary Mark Esper said Monday that the US military is preparing a response to the attack on major Saudi Arabia oil facilities.\n\nAfter briefing President Donald Trump in the White House, Mr Esper singled out Iran as undermining international order, without directly pinning blame on Tehran for the attack.\n\n\"The United States military, with our interagency team, is working with our partners to address this unprecedented attack and defend the international rules-based order that is being undermined by Iran,\" he said in a tweet.\n\nMr Esper said he and the Pentagon leadership met with Mr Trump in the wake of Saturday's attack, which analysts say appear to have involved drones and possibly cruise missiles launched from a nearby country.\n\nsentifi.com Market voices on:\n\nEarlier he also spoke with Saudi Crown Prince Mohammad bin Salman as well as Iraqi Defence Minister Najah al-Shemmari.\n\nThere was, however, no suggestion of what kind of response Washington or its Gulf allies were considering.\n\nThe Iran-supported Huthi rebels in Yemen claimed responsibility for the attack.\n\nBut the Riyadh-led coalition fighting the Huthis said earlier on Monday that the weapons were Iranian-made, and it remains unclear where they were launched from.\n\nAFP", "description": ": THE BUSINESS TIMES Government & Economy - [WASHINGTON] US Defence Secretary Mark Esper said Monday that the US military is preparing a response to the attack on major Saudi Arabia oil facilities. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/09/17/nz_esper_170939_0.jpg?itok=v5gupRtX", "published_at": "2019-09-16"}