{"pub": "reuters", "url": "https://in.reuters.com/article/uk-china-basketball-nba/nba-scraps-media-access-to-teams-in-china-amid-hk-tweet-backlash-idINKBN1WQ0AO", "downloaded_at": "2019-10-11 12:51:49.593960+00:00", "title": "NBA scraps media access to teams in China amid HK tweet backlash", "language": "en", "text": "SHENZHEN, China (Reuters) - The National Basketball Association said on Friday it won’t make the Brooklyn Nets and the Los Angeles Lakers available to media for the rest of their China visit, amid a furore over a tweet by a Houston Rockets executive supporting Hong Kong’s protesters.\n\nA man with his head wrapped in a Chinese national flag is seen near a building with a partly-removed banner advertising an NBA China game between Brooklyn Nets and Los Angeles Lakers, in Shanghai, China October 9, 2019. REUTERS/Aly Song/Files\n\nThe teams had been scheduled to address news conferences on Friday afternoon in Shenzhen, ahead of Saturday’s exhibition game in the southern Chinese city on the border with Hong Kong that the league says will proceed as planned.\n\n“We have decided not to hold media availability for our teams for the remainder of our trip in China. They have been placed into a complicated and unprecedented situation while abroad and we believe it would be unfair to ask them to address these matters in real time,” the league said in a statement.\n\nNo players or executives were made available for official briefings this week in China as the league grappled with the backlash from the quickly deleted tweet by Rockets general manager Daryl Morey last weekend in support of Hong Kong anti-government protests. The China market is estimated to be worth more than $4 billion for the NBA.\n\nChina has accused the West of stirring up anti-Beijing sentiment in Hong Kong, and Chinese state media has characterised Morey’s tweet as the latest example of meddling in China’s affairs. NBA Commissioner Adam Silver defended Morey’s freedom of expression in a statement issued on Tuesday, further angering Beijing.\n\nFan events were cancelled this week and partners have cut ties with the NBA, underscoring the severity of the situation for the league. Athletes such as Lakers star forward LeBron James and league figures have also declined to answer questions when spotted by reporters at various venues in Shanghai and Shenzhen.\n\nPACKED STANDS\n\nThe first of the two exhibition games scheduled in China took place on Thursday night, which the Nets won 114-111. It was well-attended and saw little in the way of patriotic protest. The crowd waved Chinese flags in the arena before the game started, but the packed stands gave the players a huge welcome on court and shouted enthusiastically throughout the game.\n\nBut Chinese fans who did not have a ticket could not watch: state television CCTV and Tencent (0700.HK), who hold the rights to show the NBA in the country, are not carrying any of the China games on their platforms.\n\nHouston Rockets sneakers and other merchandise have been pulled from several Nike (NKE.N) and NBA stores in major Chinese cities, with the franchise’s direct association with Morey making it a central target of the furore. Managers at some of the Nike stores said they had been instructed to remove the goods via an internal memo from management.\n\nIn a Facebook post on Sunday, Nets owner Joe Tsai, the co-founder of Chinese e-commerce giant Alibaba (BABA.N), attempted to play mediator. But his post invited more controversy in the United States after he labelled protesters in Hong Kong as “separatists”.\n\nChen Minqi, a 20-year-old Chinese Lakers fan, said outside the hotel in Shenzhen where the Lakers were staying that Morey shouldn’t interfere in other countries’ affairs.\n\n“Still, sport is sport and we shouldn’t punish the Lakers and the NBA for his mistake,” Chen said.", "description": "The National Basketball Association said on Friday it won't make the Brooklyn Nets and the Los Angeles Lakers available to media for the rest of their China visit, amid a furore over a tweet by a Houston Rockets executive supporting Hong Kong's protesters.", "authors": ["David Kirton", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191011&t=2&i=1439601756&w=1200&r=LYNXMPEF9A0KU", "published_at": "2019-10-11"}