{"pub": "investing.com", "url": "https://newsbtc.com/2019/10/08/ethereum-forms-bottom-formation-as-analysts-see-room-to-fly", "downloaded_at": "2019-10-09 01:10:55.560624+00:00", "title": "Ethereum Forms Bottom Formation as Analysts See “Room to Fly”", "language": "en", "text": "Ethereum (ETH) and the aggregated crypto markets have lost the upwards momentum that they incurred yesterday as Bitcoin failed to move past its near-term resistance level that exists around $8,400.\n\nDespite today’s slowdown in the aggregated markets, analysts are now noting that Ethereum may be forming a bullish bottom formation that could give it significantly further room to surge in the near-future.\n\nEthereum’s Price Climb Slows as it Stabilizes Around $180\n\nAt the time of writing, Ethereum is trading up marginally at its current price of $179.50, and it is currently sitting slightly below its daily highs of $184 that were set at the peak of the market’s upwards surge that occurred yesterday.\n\nIt is important to note that Ethereum is closely tracking Bitcoin’s price action, and it is highly probable that it will remain closely correlated with BTC in the near-term while the markets struggle to determine which direction they will trend for the foreseeable future.\n\nRegardless of this correlation, however, analysts are noting that Ethereum may be currently laying the groundwork for its current price levels to mark a long-term bottom that is followed by its next noteworthy uptrend, with Peter Brandt – a prominent analyst – explaining that he sees “bottoming construction” while looking at the ETH/BTC chart.\n\nIt is imperative that Ethereum begins climbing higher in the near-term if this possibility is to be validated, as another drop to its range lows could invalidate this and signal that further weakness is imminent.\n\nETH Has “Room to Fly” in Near-Term, Claims Analyst\n\nThe bottoming formation that Brandt pointed to may soon be validated, as The Crypto Dog, another popular cryptocurrency analyst on Twitter, explained in a recent tweet that he believes ETH has “room to fly” in the near-term, marking an upside target at 0.026 BTC on his chart – a notable climb from its current price of 0.0218 BTC.\n\n“I reckon $ETH / $BTC has some room to fly, once it breaks ~0.0223,” he explained.\n\nI reckon $ETH / $BTC has some room to fly, once it breaks ~0.0223 pic.twitter.com/aJAC7qG5D3 — The Crypto Dog📈 (@TheCryptoDog) October 8, 2019\n\nThe next few days and weeks will provide significant insight into where major altcoins like Ethereum will head next amidst Bitcoin’s consolidation period, as a failure for ETH to climb from its current prices could mean that significantly further losses are inbound.\n\nFeatured image from Shutterstock.", "description": "Despite today’s slowdown in the aggregated markets, analysts are now noting that Ethereum (ETH) may be forming a bullish bottom formation.", "authors": [], "top_image": "https://www.newsbtc.com/wp-content/uploads/2019/10/shutterstock_1056873134-1200x780.jpg", "published_at": "2019-10-08"}