{"pub": "hotair", "url": "https://hotair.com/archives/jazz-shaw/2019/09/30/gop-doesnt-impeachment-playbook-dont-need-one", "downloaded_at": "2019-10-01 00:14:25.181678+00:00", "title": "The GOP doesn’t have an “impeachment playbook” because they don’t need one", "language": "en", "text": "The Sunday morning shows, along with all of the subsequent cable news coverage yesterday, were focused on the impeachment story. (There’s a surprise for you.) But one theme emerged that the media seems to be running with today. The thumbnail version is that the Republican Party and all of President Trump’s supporters are in some sort of “chaos” and they can’t decide how to push back against the Democrats on this.\n\nOne good example showed up this morning in the Associated Press. “GOP Split Over Impeachment Pushback.”\n\nThe president’s lawyer insists the real story is a debunked conspiracy theory. A senior White House adviser blames the “deep state.” And a Republican congressman is pointing at Joe Biden’s son. As the Democrats drive an impeachment inquiry toward a potential vote by the end of the year, President Donald Trump’s allies are struggling over how he should manage the starkest threat to his presidency. The jockeying broke into the open Sunday on the talk show circuit, with a parade of Republicans erupting into a surge of second-guessing… Senior White House policy adviser Stephen Miller, meanwhile, noted that he’s worked in the federal government “for nearly three years.” “I know the difference between a whistleblower and a deep state operative,” Miller said. “This is a deep state operative, pure and simple.”\n\nI suppose this is a useful way for the press to keep everyone focused on impeachment and paint a picture of a Republican Party in disarray and a Republican president under siege. This was predicted by many of us a while ago. Once the Russia Russia Russia story had imploded, they were going to need a new narrative heading into the primary season. And this one fits the bill perfectly.\n\nHere’s the thing. Aside from the people working directly for the White House, nobody else in the GOP needs a “playbook” or any set of talking points. They aren’t the ones facing impeachment. Whatever hot or cold take the various Republican congressmen and party leaders want to offer is completely up to them. (And yes, that even includes Mitt Romney.) This fight is going to come down to the House Democratic leadership versus the President.\n\nAs to how it will play out, notice how Reuters opens its coverage, describing how the Hunter Biden story is “a debunked conspiracy theory.” Really? We obviously don’t know if anything technically illegal was going on and the Ukranian government may have ended the investigation, but… come on, man. At the same time that the Vice President was leading our diplomatic initiatives with that nation, his son, who had zero experience or expertise in the energy industry, winds up on the board of a major national energy company drawing a princely salary? And Joe Biden later goes on to brag about getting a prosecutor looking into the matter fired by threating to cut off a huge amount of U.S. foreign aid. You’re calling that debunked?\n\nIf you want a prediction, I’ll offer one up here. President Trump will go into his usual mode of flat denials and aggressive social media pushback against both the media and the Democratic leadership. None of that will change a thing for Nancy Pelosi, Adam Schiff and all the rest. They’ve been waiting until they thought enough outrage had been generated against Trump that they would have the votes for impeachment. With that goal seemingly in the bag, they’ll hold some hearings and proceed to a vote to impeach, which is something they’ve wanted since Trump was sworn in.\n\nAfter that, the Senate will take up the case. Cocaine Mitch will push through the trial process as quickly as possible. Schumer won’t be able to attract enough Republicans to come anywhere near the 2/3 margin they need. (They might pick up Collins and one or two others.) Trump will go down in history joining Bill Clinton and Andrew Johnson in the impeached but not convicted club and press on toward trying to win a second term and use the impeachment effort to raise more campaign cash.\n\nSound about right?", "description": "Clown car", "authors": ["Jazz Shaw", "Ed Morrissey", "John Sexton"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/Pelosi-impeachment.jpg", "published_at": "2019-09-30"}