{"pub": "zdnet", "url": "https://www.zdnet.com/article/spot-robot-dog-unleashed-this-is-why-you-should-buy-one-says-boston-dynamics", "downloaded_at": "2019-09-25 13:48:09.973327+00:00", "title": "Spot robot dog unleashed: This is why you should buy one, says Boston Dynamics", "language": "en", "text": "Boston Dynamics' \"robot dog\" could soon be trotting down your street After a quarter century of robotics R&D, the most YouTubed robotics company in the world is going to market.\n\nRobot maker Boston Dynamics is finally ready to put its Spot mechanical dog into action in places like construction, public safety, and oil and gas operations.\n\nAnd following its viral video from earlier this year showing a pack of the short four-legged robots effortlessly hauling a truck, it's released a new video, below, to show off the robot's versatility in both the office and a range of field environments.\n\nLike Boston Dynamics' other robots, Spot for now isn't aimed at consumers but rather industrial applications. The company boasts in the video that Spot has a top speed of 3mph and a swappable battery that lasts about 90 minutes before needing replacement.\n\nIt's also got 360-degree vision, crash protection and can work in dusty and wet industrial environments at temperatures of between -20°C to 40°C (-4°F to 104°F). It can carry a payload of 14kg, or 31lb.\n\nThe company says early customers are already testing Spot to monitor construction sites, inspect gas, oil and power facilities, and in public-safety scenarios.\n\nThere are no details about pricing, but the company indicates on its sales page that it is interested in hearing from organizations that want to test Spot for particular applications. In videos, it has already shown Spot with an attached customizable robotic arm that can open doors even when faced with moving obstacles.\n\nTesting partners get access to the Spot software development kit (SDK), which enables the customer's application to \"command poses and velocities, configure payloads, and access robot perception and payload data\".\n\nBoston Dynamics also has an Autonomy SDK that provides access to mapping, navigation, and mission editing.\n\nFortunately, Spot looks less menacing than the military-like SpotMini prototype it showed off last year when it announced it would start selling the robot in 2019.\n\nBoston Dynamics is these days owned by SoftBank, which took it off Google-parent Alphabet's hands in 2017.\n\nAlong with the launch of Spot, Boston Dynamics has showed off its Atlas bipedal robot Atlas doing a gymnastics routine, including a handstands, front rolls, jump and splits, and a 360-degree spinning jump.", "description": "Boston Dynamics is inviting industrial customers to try Spot in various working scenarios.", "authors": ["Liam Tung"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2019/09/25/b55d7dda-ab51-4aa8-9bee-9bd3bc63a78e/thumbnail/770x578/b60daba01799fd903e3bd0667696c20b/bostondynamicsspotdogsept19.jpg", "published_at": "2019-09-25"}