{"pub": "yahoo", "url": "https://sg.finance.yahoo.com/news/introducing-first-multifunctional-baby-pod-084500333.html", "downloaded_at": "2019-10-24 09:56:16.858379+00:00", "title": "Introducing the First Multifunctional Baby Pod - Super Safe & Cosy for Sleep, Change, Play and Travel", "language": "en", "text": "HONG KONG, CHINA - Media OutReach - 24 October 2019 - The baby box is specially designed by a renowned Singaporean designer and has been awarded a grant by the Design Singapore Council.\n\n\n\n\n\n\n\n\n\nAngel Babybox, the luxurious multifunctional baby pod, can open up to become a playing & changing mat and flat pack away for travelling and storage.\n\n\n\n\n\nThe Angel Babybox has launched the first super-safe, multifunctional, cosy pod for babies 0-6 months. It's a beautifully designed luxurious, protective pod and has been rigorously tested and awarded the same safety certification as cots and cribs for domestic use (BSEN1130).\n\n\n\n\n\nIdeal for modern parents, it's an evolution of a baby sleeping pod and a traditionally Finnish baby box which is a simple box with a tight fitting crib sheet for the baby to sleep, providing an super snuggly safe, comfortable cosy place for them. It's also uniquely multifunctional, it opens up to become a luxurious playing and changing mat and flat packs away simply for travelling or storage.\n\n\n\n\n\nMultifunctional, luxurious, comfortable and convenient. Ergonomically designed and made with the modern parent and baby in mind.\n\n\n\n\n\nSleep time. It's a safe, soft and sturdy sleeping pod. You can pop your baby down for a deep sleep, snooze or just be! While you potter nearby.\n\n\n\n\n\nChanging and playtime. It opens up to become a large soft cushioned playing and changing mat.\n\n\n\n\n\nTravel time. It is flat packs away simply and is made of the highest quality lightweight, strong, durable, reinforced, shock absorbing flexible foam. Ideal for families on the go it's perfect for taking with you on holiday or visiting friends and family and it folds away saving valuable space at home.\n\n\n\n\n\nLuxurious and soft to the skin: specially chosen materials, soft and luxurious 100% pure Japanese cotton for the comfort of your baby.\n\n\n\n\n\nAs safe as a cot\n\nLovingly made with care and thoughtfulness, the clever designers at Angel Babybox can put mums, dads and carers minds at rest in the knowledge that is even secure than a traditional pod.\n\n\n\n\n\nThey will be reassured to know that this pod has achieved the same standards of safety as baby cots and is certified with the highest UK safety standard, the BSEN 1130.It is so strong, safe and secure it can hold 200N of strength and weight as well as being light.\n\n\n\n\n\nThe high sides, dual enhanced fasteners and sturdy base gives the pod improved safety, usability and comfort. There are no soft, loose bedding in the baby's sleep area, except for a tight fitting crib sheet. We say it's the pod reborn for the new generation.\n\n\n\n\n\nQuick one-step transformation\n\n\n\n\n\nThis new pod is set to be the modern family's baby essential. The larger opening to smaller base angled design ergonomically facilitates easy management of carrying your little baby bundles in and out. The pod is compact, light, easy to assemble, and transport in its carry case, making it for it's so easy to take away or pack away.\n\n\n\n\n\nThe highest quality products used\n\n\n\n\n\nThe Angel Babybox people travelled the world to find the safest, most luxurious, modern and ecological materials to create this essential for all baby homes. It's made of ecological, and soft 100 percent pure Japanese cotton and non-toxic foam so it is comfortable with a luxurious feel for your baby.\n\nStory continues", "description": "HONG KONG, CHINA - Media OutReach - 24 October 2019 - The baby box is specially designed by a renowned Singaporean designer and has been awarded a grant by the Design Singapore Council.      Angel Babybox, the luxurious multifunctional baby pod, can open up to become a playing & changing mat and flat", "authors": ["Angel Babybox"], "top_image": "https://s.yimg.com/uu/api/res/1.2/6OarHrHZNNW84oX9eusUAw--~B/aD0xNzEzO3c9MTcxMztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/mediaoutreach_175/6aa4c882e711bd7c5d5d5d94dc493753", "published_at": "2019-10-24"}