{"pub": "yahoo", "url": "https://news.yahoo.com/womans-faith-in-humanity-restored-after-receiving-lost-wallet-in-the-mail-from-good-samaritan-175011137.html", "downloaded_at": "2019-09-13 18:16:46.361170+00:00", "title": "Woman's 'faith in humanity' restored after receiving lost wallet in the mail from good Samaritan", "language": "en", "text": "A woman, who lost her wallet in Las Vegas, said there is \"proof good humans exist and are out there\" after it was mailed to her home address by a good Samaritan.\n\nAlong with her wallet, driver's license and credit cards, Aimee Scott of St. Peters, Mo., said the act restored her \"faith in humanity,\" after she had resigned never to seeing her wallet again.\n\nOn Friday, Scott had accidentally left her wallet behind in a cab, the day before she was set to fly home. Immediately, she canceled her credit cards, went through a TSA check to get on her plane, and was issued a new driver's license.\n\nOn Wednesday, however, she received a package in the mail.\n\n“I received this envelope addressed to me,” Scott told Fox2Now. “I opened it up. It was my wallet with a cute little letter from Jen in Arizona.”\n\nJen McAnally, from Peoria, Ariz., was in Vegas for a bachelorette party when she spotted Scott's wallet on the floor of a cab. After the driver told her he had no way to contact Scott, McAnally made it her mission to get the wallet back to its rightful owner.\n\nMcAnally first attempted to find Scott on social media to let her know her wallet had been found and was in good hands, but had no luck in locating her.\n\n“I just felt like hanging onto it. It was better than leaving it, you know? Didn’t want someone to get a hold of it and anything bad to happen,” McAnally told the news outlet.\n\nAlong with the wallet, McAnally sent a letter to Scott.\n\n\"I found your wallet on Friday night in a cab in Vegas,\" the letter read in part. \"The driver said he had no way to track you. I didn’t want to leave it for some scumbag to find it. Hopefully losing this didn’t ruin your weekend. Sorry we couldn’t get it to you sooner.\"\n\nScott was able to track down Mcanally on Facebook to thank her, and now others on the social media site are praising her good deed.\n\n“For me, it’s basic human decency,\" McAnally told Fox2Now. \"Weird to be getting praised for that ,but happy I was able to make her day.”\n\nScott and McAnally did not immediately respond to Yahoo Lifestyle’s requests for comment.\n\nRead more from Yahoo Lifestyle:\n\nFollow us on Instagram, Facebook, Twitter and Pinterest for nonstop inspiration delivered fresh to your feed, every day.", "description": "A woman, who lost her wallet in Las Vegas, said there is \"proof good humans exist\" after her wallet was mailed to her by a good Samaritan.", "authors": ["Hope Schreiber"], "top_image": "https://s.yimg.com/uu/api/res/1.2/q5GWAhpO8Fnu9NINVthSxw--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/video/ktvi_st_louis_449/ac862006006e3bd7e5d3abf7ac545c21", "published_at": "2019-09-13"}