{"pub": "cbc", "url": "https://cbc.ca/news/entertainment/new-leonard-cohen-album-1.5291011", "downloaded_at": "2019-09-20 22:58:03.920381+00:00", "title": "New Leonard Cohen album of previously unreleased songs coming November | CBC News", "language": "en", "text": "A new posthumous album of previously unreleased Leonard Cohen music was announced by Sony Music on Friday.\n\nEntitled Thanks for the Dance, the album will be released on Nov. 22.\n\nThe iconic Canadian singer, songwriter and poet from Montreal died in Los Angeles on Nov. 7, 2016, at age 82.\n\nSony Music said in a written statement the album is a collection of never-heard-before music sketched out while Cohen and his son, Adam Cohen, were working on their collaboration You Want it Darker. The elder artist had asked his son to bring these works to completion.\n\nThe album was made in several locations with contributions from numerous other artists, many of them former Cohen collaborators.\n\nJavier Mas, acclaimed player of the Spanish laúd, a stringed instrument, who accompanied Cohen on stage for his last eight years of touring, flew to Los Angeles from Barcelona to capture the late artist's spirit using Cohen's own guitar.\n\nAt a music festival in Berlin, Adam Cohen invited friends to lend their talents. Damien Rice and Leslie Feist contributed vocal tracks, while Richard Reed Parry of Arcade Fire played bass.\n\nIn Los Angeles, Jennifer Warnes, a close friend and collaborator of Cohen's known in part for her own soulful interpretations of some of his songs, sang background vocals.\n\n\"In composing and arranging the music for his words, we chose his most characteristic musical signatures, in this way keeping him with us,\" Adam Cohen said in the Sony statement. \"What moves me most about the album is the startled response of those who have heard it. 'Leonard lives!' they say, one after the other.\"\n\nThe first song from the album premiered on CBC Radio's q with Tom Power on Friday.\n\nThe announcement comes on the same day Canada Post is set to honour Cohen with a new set of stamps.\n\nThe three-stamp set will be unveiled at an event at the Montreal Museum of Fine Arts this afternoon.\n\nCanada Post says it will produce four million stamps, a number it believes will be sufficient for fans and collectors worldwide.\n\nThe stamps will be available to the public as of Saturday — which would have been Cohen's 85th birthday — with Canada Post hosting a special event at a downtown Montreal post office.\n\nThe design of the stamps has been a closely-guarded secret ahead of Friday's event, which will take place in the shadow a massive Cohen mural on Crescent Street that has become a mainstay of the Montreal landscape.", "description": "A new posthumous album of previously unreleased Leonard Cohen music was announced by Sony Music Friday. Entitled Thanks for the Dance, the album will be released on Nov. 22.", "authors": [], "top_image": "https://i.cbc.ca/1.5014259.1549904236!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/leonard-cohen.jpg", "published_at": "2019-09-20"}