{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7546933/US-deadly-flu-season-Australias-sickened-272-000-killed-662.html", "downloaded_at": "2019-10-07 20:29:31.012523+00:00", "title": "US may be in for a deadly flu season after Australia's sickened more than 272,000 and killed 662", "language": "en", "text": "One of Australia's most serious flu seasons is coming to an end, and it could mean a severe outbreak is on its way to the US.\n\nSo far, there have been more than 272,000 laboratory confirmed cases of the flu and 662 deaths, according to a report from Australia's Department of Health.\n\nFlu season also started particularly early this year. In Australia, flu season typically lasts from June to October, peaking in August and September. However, this year, the season began in April and peaked in June and July.\n\nJust two years ago, the 2017 flu season in Australia was its worst in 20 years, with more than than 229,000 laboratory confirmed cases of the flu and 745 deaths.\n\nStrains migrated to the US, where the 2017-18 season that hit six months later was among the deadliest in recent memory, killing nearly 80,000 people.\n\nHealth experts say this should be taken as warning sign that whenever the Southern Hemisphere has a particularly bad flu season, it means the Northern Hemisphere will likely have one as well.\n\nAs Australia gets over another severe flu season, health experts say the next severe outbreak is likely headed to the US (file image)\n\nDuring the last full week of January 2018, the Centers for Disease Control and Prevention (CDC) reported that one of every 14 visits to doctors and clinics nationwide that week was for symptoms of the flu.\n\nThat made it the highest level since the deadly swine flu pandemic in 2009.\n\nNearly 180 children died during the 2017-18 season, 80 percent of whom were not vaccinated, according to the CDC.\n\nComparing the death tolls of the US and Australia is difficult because, for one, the population of the US is more than 13 times larger.\n\nSecondly, Australia's health department only counts deaths ruled by a hospital as caused by influenza.\n\nMeanwhile, the CDC counts deaths in which the flu lead to deaths from causes such as sepsis and pneumonia.\n\nNonetheless, US health experts say it's important to get your flu shot as soon as possible.\n\n'It's too early to tell for sure, because sometimes Australia is predictive and sometimes it's not,' Dr Daniel B. Jernigan, director of the influenza division at the CDC, told the New York Times.\n\n'But the best move is to get the vaccine right now.'\n\nWhat's worrying health experts in the US is that the new flu season has already claimed its first pediatric victim: a four-year-old boy from Perris, California, who had underlying health issues.\n\n'We should never forget that the flu still kills,' Dr Cameron Kaiser, a public health officer for Riverside County, said in a statement.\n\n'I always recommend people get their flu shots every year, but a death so early in the flu season suggests this year may be worse than usual.'\n\nHowever, there are fears that the flu shot for the US, the UK and Canada could be a mismatch.\n\nOfficials from the World Health Organization chose the strains for the Northern Hemisphere's shot in February, and those for the Southern Hemisphere last week.\n\nThe strains chosen for the Southern Hemisphere were influenza A/H3N2 and B/Victoria, which are different than those picked for the North.\n\nDr Danuta Skowronski, an influenza expert from the University of British Columbia told Stat News, that she believes this means the prediction for the North was wrong and its flu jabs may be ineffective.\n\nThe flu vaccine comes in the form of a shot or a nasal spray. For those who choose to go with the injectable, there are two options.\n\nThe first is a trivalent vaccine, which protects against two influenza A strains, H1N1 and H3N2, and one influenza B strain.\n\nThe second option, the quadrivalent flu vaccine, protects against the same strains as the trivalent vaccine, as well as an extra influenza B virus.\n\nLast year, for the first time in two years, the CDC updated its recommendations to include the nasal spray, known as FluMist.\n\nThe nasal spray uses live, weakened viruses which are meant to teach the body to recognize and ward off flu strains if you become infected.\n\nThe shot works similarly, but uses dead strains of the virus.\n\nAccording to the CDC, children between six months old and eight years old should get two doses of the flu vaccine – with four weeks in between doses.", "description": "The 2017 flu season was Australia's deadliest in 20 years and was followed by a similar one in the US. As Australia gets over another severe flu season, health experts say the US is likely next.", "authors": ["Mary Kekatos Health Reporter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/16/19402922-0-image-a-12_1570463278582.jpg", "published_at": "2019-10-07"}