{"pub": "metro", "url": "https://metro.co.uk/2019/10/22/watchmen-comic-book-references-and-easter-eggs-you-probably-missed-in-episode-1-10961197", "downloaded_at": "2019-10-22 15:14:25.970643+00:00", "title": "Watchmen comic book references and Easter Eggs you missed in episode 1", "language": "en", "text": "The references die-hard fans missed…(Picture: HBO)\n\nDie-hard Watchmen fans couldn’t contain themselves when they heard the comic book was going to be brought to TV – although there’s loads you probably missed in episode one.\n\nThe series is based on Alan Moore’s classic graphic novel of the same name, with the synopsis telling us: ‘Watchmen takes place in an alternative, contemporary reality in the United States, in which masked vigilantes became outlawed due to their violent methods.\n\n‘Despite this, some gather around in order to start a revolution while others are out to stop it before it is too late, as a greater question rises above them all; who watches the Watchmen?’\n\nRegina King leads the cast as Detective Angela Abar – aka Sister Night – joined by co-star Tim Blake Nelson (O Brother Where Art Thou?) as her detective partner, Looking Glass.\n\nEpisode one dropped in the UK last night and is already being compared to Game of Thrones, but the season one premiere was laced with numerous references and call-backs to characters and moments that fans of the literary work will pick up on immediately.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nAll the Easter Eggs and comic book references you probably missed in episode 1\n\nAdvertisement\n\nAdvertisement\n\nRorschach’s mask\n\nThis revised version of Watchmen is set in Tulsa, Oklahoma, which we quickly learn is home to a white supremacist group known as the Seventh Kavalry. Their mask of choice was the one worn by Rorschach, a character from the graphic novel. Although we later see another version of Rorschach.\n\nHe works for chief of police Judd Crawford, and his mask – which is plain silver – becomes scarier to whoever is looking at him.\n\nThe mask is pretty eerie… (Picture: HBO)\n\nDr Manhattan on Mars\n\nIn a very brief news broadcast, we see Dr Manhattan on Mars – where the graphic novels left him – creating structures out of sand.\n\nThe episode also features several references to watches, most notably in the title of the five-act play Ozymandias (Jeremy Irons) tells his servants he’s writing, The Watchmaker’s Son.\n\nThese have been placed there with Dr Manhattan in mind. Before he became the blue atomic god, he was Jon Osterman, whose father was a meticulous fixer of time-pieces.\n\nThe Comedian\n\nIn the series, this symbol is referenced just before we meet baker-by-day, masked vigilante-by-night Angela Abar (Regina King), who we see teaching bakery in her child’s class.\n\nWhen she cracks eggs into a glass bowl, the yolk forms to make a smiley face (creepy).\n\nThis was the badge of The Comedian, who dies at the very beginning of the comics.\n\nThe shocking end to this episode – the death of Judd! – is clearly a reference to this, emphasised by the splash of blood on his police badge.\n\nDid you spot any plot holes in episode 1? (Picture: HBO)\n\nPresident Robert Redford\n\nAdvertisement\n\nAdvertisement\n\nIn the comics, we learn that the actor and director was planning on running for office in the 1988 election. And now, Redford has succeeded in ousting Richard Nixon, who remained America’s leader in the comics for far longer then he did in real life, and has been in the White House since the 1990s.\n\nSquid\n\nWhen asked by Entertainment Tonight what Watchmen newbies need to know going into this series, Damon Lindelof – referring to the graphic novel’s climactic events – said: ‘In November of 1985, an enormous alien squid landed in the middle of New York City and killed three million people.’\n\nOur first hint of this is a poster in the background of the aforementioned classroom scene depicting a giant octopus. The words ‘Anatomy of a squid’ lie below it.\n\nJust one scene later, when sirens blare out, we see everyone pull their car over to prepare for… a squid rain shower. The world is still feeling the after-effects of that event, which happened 30 years ago.\n\n‘Adrian Veidt officially dead’\n\nWe see a newspaper with this headline. Arian Veidt is the aforementioned Ozymandias, who we later see alive and well in an unknown location.\n\nFans will be kicking themselves that they didn’t notice (Picture: HBO)\n\n‘Save us!… and I’ll look down and whisper “No”‘\n\nIn an eerie video sent to the Tulsa police force, we learn the Seventh Kavalry have appropriated the famous mantra taken from Rorschach’s journal.\n\n‘Who watches the Watchmen’\n\nThis quote isn’t uttered in the episode, but Lindelof can’t quite resist hinting at it.\n\nAdvertisement\n\nIn the scene where Judd addresses the secret police force of Tulsa, he caps his speech with the Latin phrase ‘Quis custodiet ipsos custodes?’, which translates as ‘Who will guard the guards themselves?’.\n\nSister Night\n\nWhen we see Angela, in costume as Sister Night, sat in Judd Crawford’s office, she’s drinking from a mug that’s shaped in the face of Nite Owl.\n\nThis is the hero from the comics whose mask was worn by both Hollis Mason and Dan Dreiberg at different stages.\n\nAnd later, Angela’s children are also using owl-themed chopsticks.\n\nNite Owl\n\nIn the same scene, there’s a book titled Under the Hood sitting on Judd’s desk, which is the autobiography of Hollis Mason and details the events leading up to his first appearance as Nite Owl, and discusses the formation of a superhero team named The Minutemen.\n\nFans can’t get enough (Picture: HBO)\n\nDollar Bill\n\nWhen Angela ambushes the white supremacist compound, she spots a poster featuring Dollar Bill, a bank-sponsored superhero mascot from the graphic novels.\n\nThe poster in question shows him dragging a black man out of a bank captioned with the disturbing text: ‘Our banks are clean and safe and family-oriented and we keep the riff-raff out.’\n\nOwl Ship\n\nIs the hovercraft vehicle that chief of police Judd and his accomplice Pirate Jenny the same one from the Watchmen comics? No. Lindelof told IGN that the tech created by Dan Dreiberg is now commonly used by law enforcement after being replicated by them rather than being Archimedes, the name of the precise one used by characters in Moore’s work.\n\nAdvertisement\n\nThe Minutemen\n\nIn what is quite clearly a loving send-up of Ryan Murphy’s American Horror/Crime Story anthology shows, we see bus posters and TV trailers for a new series called American Hero Story: The Minutemen.\n\nFor those who don’t know, this is the league of masked adventurers formed by Captain Metropolis and Silk Spectre in the graphic novels that was designed to recruit costumed fighters to help America. In the trailer, we see the show features Captain Metropolis.\n\nWatchmen is available to stream on HBO in the US and Sky Atlantic and NOW TV in the UK.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Watchmen episode 1: All the burning questions we have as HBO series finally arrives\n\nMORE: Step aside Game Of Thrones, Watchmen episode 1 hailed ‘best pilot ever’", "description": "The Watchmen comic book references and Easter Eggs you probably missed in episode 1.", "authors": ["Abbie Bray"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/watchmen-ee3a_1571755080.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-22"}