{"pub": "metro", "url": "https://metro.co.uk/2019/10/09/not-my-cup-of-pee-civil-servant-fired-for-urinating-in-kettle-10887407", "downloaded_at": "2019-10-09 18:55:23.139621+00:00", "title": "Not my cup of pee: Civil servant fired after urinating in kettle", "language": "en", "text": "That might not be water in there… (Picture: Getty)\n\nIn most workplaces, there’s a smorgasbord of in-office microaggressions that seem to come with the job. The swapping of desk chairs, the thievery of meals in the communal fridge, the list goes on.\n\nBut one Australian civil servant has committed an act so heinous it makes the aforementioned transgressions look like team-building activities.\n\nAn employee from South Australia has just lost his job because he urinated in the office kettle.\n\n‘The thorough investigation found that a particular individual was at fault and this employee has since been terminated from the department,’ a department spokeswoman told AAP.\n\nIf you haven’t reached boiling point yet, just you wait.\n\nOther staff members were concerned there was also blood in the kettle-dwelling urine.\n\nFortunately, tests ran on the liquid concluded that there was no blood. It was just a whole lot of pee.\n\nAdvertisement\n\nAdvertisement\n\nBecause it wouldn’t be the public service without a drawn-out, highly bureaucratic process with administrative hoop after administrative hoop, it took one year for the investigation to be finalised.\n\nSo, although the human services worker urinated in the kettle in March 2018, he was only dropped from the role in July 2019.\n\nCan you imagine how on-edge his unfortunate colleagues would have been for an entire year? Friends, we raise an unsullied cuppa to you.\n\nAlso BRB, stocking up on a litre-capacity thermoses.\n\nMORE: How to celebrate Dia de los Muertos without culturally appropriating\n\nMORE: World’s only bodybuilding triplets are competing against one another\n\nMORE: Mixed Up: ‘Don’t tell me to pick a side – I am mixed-race, so I am both’\n\nAdvertisement Advertisement", "description": "An employee from South Australia has just lost his job because he urinated in the office kettle.", "authors": ["Serena Coady"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2017/08/dv1397026_1570632553.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-09"}