{"pub": "investing.com", "url": "https://ph.investing.com/news/commodities-news/gold-prices-edge-back-above-1500-on-weak-pmi-data-72260", "downloaded_at": "2019-10-24 16:06:32.616591+00:00", "title": "Gold Prices Edge Back Above $1,500 on Weak PMI Data", "language": "en", "text": "© Reuters.\n\nInvesting.com --- Gold prices crept back above $1,500 an ounce Thursday as more weak economic data out of Europe and Japan kept up hopes of yet more monetary stimulus.\n\nManufacturing activity in fell at the fastest rate in three years, and stayed near stagnation in the , according to surveys by IHS Markit. The defied expectations for a decline and rose fractionally, but that didn’t stop gold adding to its gains as the morning went on.\n\nManufacturing weakness has been largely priced in during a year-long global slowdown, and bond yields only drifted down a couple of basis points as a result. In Europe, bonds and other havens also got a measure of support from unconfirmed reports suggesting that the U.K. government will aim for a snap election to push its Brexit agenda through, rather than pass its withdrawal bill before going to the country.\n\nBy 11:30 AM ET (1530 GMT), for delivery on the Comex exchange were up 0.5% at $1,503.45 a troy ounce, while was up 0.6% at $1,500.47 an ounce.\n\nwere up 1.2% at $17.79 an ounce while were up 0.2% at $925.80.\n\nPlatinum has been the standout performer so far this week, gaining over 4% while gold had been largely stuck below $1,500 until Thursday.\n\nElsewhere, Mario Draghi, whose negative interest rate policy has done much to propel gold this year, bowed out from his eight-year tenure of the European Central Bank presidency with a gloomy assessment of the eurozone economy, but the press conference added little to the outlook for future policy, since incoming president Christine Lagarde has said she wants a strategic review of how the ECB conducts its policy when she takes over.\n\nThere were, however, rate cuts elsewhere from Bank Indonesia and the Central Bank of Turkey, underlining that the global trend of lower interest still remains largely intact. Only ‘largely’ intact, though, because Sweden’s Riksbank said it still expects to raise its repo rate back to 0% in December, ending a long experiment with negative interest rates that has had mixed results. The Riksbank said a deteriorating outlook for the economy meant that, once it has raised the repo rate to 0%, it now expects it to stay there for longer than previously thought.", "description": "Gold Prices Edge Back Above $1,500 on Weak PMI Data", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEB1G0BT_L.jpg", "published_at": "2019-10-24"}