{"pub": "huffpost", "url": "https://huffpost.com/entry/coast-guard-calls-off-search-california-boat-fire_n_5d6ea7aee4b0cdfe057699b9", "downloaded_at": "2019-09-04 03:45:28.909393+00:00", "title": "34 Presumed Dead After Coast Guard Calls Off Search In California Boat Fire", "language": "en", "published_at": "2019-09-03", "text": "The U.S. Coast Guard has officially called off the search-and-rescue operation for the dozens of people who were on a scuba dive boat that caught fire off the coast of Santa Cruz Island in California.\n\nThe 34 people who were trapped on the boat at the time of the fire, including one crew member, are presumed dead.\n\n“It is never an easy decision to suspend search efforts,” Coast Guard Capt. Monica Rochester said during a televised press conference Tuesday morning. “We know this is a very difficult time for family and friends of the victims.”\n\nSanta Barbara County Fire Department The 75-foot Conception, based in Santa Barbara Harbor, burns after catching fire early Sept. 2, 2019, while anchored off Santa Cruz Island, California.\n\nThe 75-foot vessel, which is known as the Conception, caught fire in the early hours of Monday morning while on a three-day, live-aboard diving tour of the waters near San Miguel Island.\n\nThe boat was anchored in waters off of Santa Cruz Island as passengers slept onboard overnight.\n\nThe tour, operated by the Santa Barbara-based dive company Truth Aquatics, departed on Saturday morning and was scheduled to return Monday evening.\n\nFive of the boat’s crew members were above deck at the time and were able to escape the fire, Lt. Cmdr. Matthew Kroll told The Associated Press.\n\nAt least 20 of the victims’ bodies ― 11 females and nine males ― have been recovered from the wreckage, Santa Barbara County Sheriff Bill Brown said during Tuesday’s press conference. Authorities will be collecting DNA samples from the bodies in order to identify the remains.\n\nRecovery divers saw four to six other bodies during their search on Monday, but the bodies were unable to be recovered before nightfall, according to Brown.\n\nThe crew members who were able to escape the fire used a dinghy and sought help from a nearby fishing boat named Grape Escape owned by Shirley and Bob Hansen, according to The Los Angeles Times. By the time they reached the boat, the Conception was fully engulfed in flames, the Hansens told the Times.\n\nAll the other passengers, including one crew member, are believed to have been sleeping below deck at the time the fire broke out. Brown said that the fire apparently blocked the exit hatch and the exit to the vessel’s sleeping quarters, also known as the berthing quarters.\n\nDave Reid, who has previously traveled on the Conception, told the AP that the sleeping quarters of the boat is a comfortable but tight area and only has one exit.\n\nReid said that passengers on the Conception navigate a narrow stairway to get from the bunk beds to the top of the deck, which may have complicated any escape efforts for people who were trapped below.\n\nThe cause of the fire is still under investigation. The surviving crew members have provided statements to authorities, officials said Tuesday.\n\nBrown said recovery divers are stabilizing the boat so that they might be able to recover more bodies from the wreckage.\n\nRELATED COVERAGE At Least 25 People Killed, 9 Missing In California Boat Fire", "description": "The dive tour boat, known as the Conception, caught fire off the coast of Santa Cruz Island in the early hours of Monday morning.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d6ea8bd2500005500020a08.jpeg?cache=mw4o4473vr&ops=1778_1000"}