{"pub": "businessinsider", "url": "https://businessinsider.com/best-cities-for-generation-z-live-work-worldwide", "downloaded_at": "2019-09-07 02:22:53.480623+00:00", "title": "The top 20 cities around the world that are ready to welcome Gen Z workers", "language": "en", "text": "The oldest members of Generation Z — those born in 1997 — have just graduated from college. For those considering a new place to live and work, a select group of cities could have the most to offer.\n\nThe 2019 Generation Z City Index by apartment search site Nestpick found the best cities around the world for Gen Zers to live in. Nestpick used Pew Research Center's January 2019 definition of Generation Z: anyone born between 1997 and 2012. But that's not all that defines them. According to Nestpick, Gen Zers are \"digital natives who value security, diversity, and autonomy, and aim to achieve it through pragmatism and determination.\"\n\nThe study examined 110 prominent international cities, focusing on 22 factors that were split into four main categories: digitalization, business, principles, and leisure. The sub-categories across all four major categories included government digitalization, education, environmental action, LGBT+ equality, right to protest, affordability, and concerts, among others. Each city was given a score out of 100, the total of the weighted averages of each of the four categories. You can read a full explanation of the study's methodology here.\n\nThe top spot went to London, which earned perfect scores in three sub-categories: concerts, coworking spaces, and social entrepreneurship. Other highly-ranked cities included Stockholm, Los Angeles, and Toronto.\n\nHere are the 20 cities best equipped for Generation Z's particular wants and needs.", "description": "Nestpick found the cities worldwide that are best equipped for the up-and-coming generation of recent college grads.", "authors": ["Ivan De Luce"], "top_image": "https://amp.businessinsider.com/images/5d71647a2e22af065d1d68e2-750-375.jpg", "published_at": "2019-09-06"}