{"pub": "politico", "url": "https://politico.com/story/2019/09/06/democrats-2020-trump-culture-war-1484034", "downloaded_at": "2019-09-07 02:20:07.657845+00:00", "title": "Democrats bite on burgers and straws — and Republicans feast", "language": "en", "text": "President Donald Trump and outside allies gleefully painted the Democratic presidential field as a bunch of out-of-touch elites. | Alex Brandon/AP Photo 2020 Elections Democrats bite on burgers and straws — and Republicans feast 2020 presidential hopefuls fall for the GOP's culture war trap.\n\nDemocrats’ verbal targeting of everything from plastic straws to cheeseburgers is stoking fears among anti-Trump forces that they’re unwittingly playing into Republican culture wars.\n\nConservative recrimination over the threatened wholesale takeover of society came swiftly after CNN’s marathon climate change forum with Democratic presidential hopefuls this week. Republicans gleefully painted the field as a bunch of out-of-touch elites: In one video, the Republic National Committee shared brief clips from the candidates, including Joe Biden, appearing to advocate a shutdown of coal-burning plants and taking gas-burning vehicles off the road “as rapidly as we can.”\n\nStory Continued Below\n\nThe message: There are no moderates running for the nomination.\n\nAndrew Yang, in the same web ad, said, “We’re going to be OK if the vast majority of the world goes vegetarian immediately.”\n\n“I just don’t even know what to do with ‘Burgergate,’” said Colin Strother, a veteran Democratic strategist from the cattle-rearing state of Texas. “It is such a fringe position that is out of step with an overwhelming majority of Americans — and let us not forget that a pretty wide swath of the country including Texas and the ‘Breadbasket’ are major beef producers.\n\n“In fact,” Strother added, “the earliest primary state of Iowa sold almost a half a billion bushels of corn specifically to feed livestock last year. We have so many very serious issues facing our country that I struggle to understand how burgers even make the top-20 list.”\n\nCOUNTDOWN TO 2020 The race for 2020 starts now. Stay in the know. Follow our presidential election coverage. Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nAnd yet, in her CNN town hall, Kamala Harris was asked whether she supports changing the food pyramid to reduce red meat consumption. She does. And, amid calling for prohibitions on hydraulic fracturing and offshore drilling, the California senator also came out for a ban on plastic straws, even as she acknowledged the inferiority of paper straws.\n\nBernie Sanders similarly waded into fraught territory with his riff on the spiraling world population. He was asked by a teacher from New Milford, Conn., whether he’d be “courageous enough” to make the politically “poisonous topic” of population control a key feature of his plan to address climate change. “Yes,” Sanders replied.\n\n“And the answer has everything to do with the fact that women in the United States of America, by the way, have a right to control their own bodies and make reproductive decisions,” he added. “So I think, especially in poor countries around the world where women do not necessarily want to have large numbers of babies, and where they can have the opportunity through birth control to control the number of kids they have, it’s something I very, very strongly support.”\n\nTodd Carmichael, chief executive of coffee company La Colombe, said he stopped offering straws and uses biodegradable plastic cups as a response to customer demands, not because he thought it would end global climate change. After making the change, his 10-year-old daughter reminded him that the problem is way bigger than straws.\n\n“Taking the straws off the bar was a little like cleaning the windows during a hurricane,” he said. “It’s a false lead, and we can’t take our eye off the ball that is the oil and gas companies.”\n\nElizabeth Warren has managed better than others in wiggling out of the established framing by connecting it back to her own message. Still, her answers left Republicans with enough fodder to serve their own narrative, fueling the argument of some on the left that it doesn’t matter what Democrats say—they’ll all be painted as socialists, regardless.\n\nWarren, asked about the Trump administration’s announced rollback of certain energy-saving light bulbs, and whether it imposed on Americans’ freedoms, seemed exasperated by the question: “Oh, come on, give me a break.”\n\nYet, she went on to explain that there are a lot of ways to change America’s energy consumption: “Some of it is with light bulbs, some of it is on straws, some of it, dang, is on cheeseburgers, right?” Warren said.\n\nShe then cut to a central theme of her candidacy: That this is all part of a distraction propagated by fossil fuel companies, which are pushing to stir up controversy around light bulbs, straws and cheeseburgers when the vast majority of carbon pollution comes from just three industries.\n\n“I actually agree with Elizabeth Warren,” said former Pennsylvania Gov. Ed Rendell, a big Biden supporter, identifying the second half of her answer. “We shouldn’t be talking about banning hamburgers and plastic straws because it just gives the Republicans something to latch onto to avoid confronting one of the harshest realities we face as a nation and as a world.”\n\nStill, Rendell, a self-described “devoted meat-eater,” said Democrats did Republicans a favor by handing them new material.\n\nIndeed, some fell into the trap, said RL Miller, political director of Climate Hawks Vote and president of a related political action committee, mentioning Harris’ answers to CNN. “The issue is not straws. The issue is the oil companies creating systems that need to be dismantled.”\n\nI’m so over paper straws. #LiberalProgress\n\n\n\nThis is exactly what they would do to the economy as well. Squeeze it until it doesn’t work. pic.twitter.com/zKfiZiSHV5 — Brad Parscale (@parscale) July 18, 2019\n\nEven before the town halls, Trump’s reelection campaign and outside allies were weaponizing various daily inconveniences into arguments against making small sacrifices environmentalists believe are needed to help save the planet. The president’s campaign this summer unveiled laser-engraved plastic “TRUMP” straws ($15 for a 10-pack). Trump campaign manager Brad Parscale complained about the ineffectiveness of recyclable paper straws.\n\nOn the heels of the Green New Deal, the sweeping set of environmental goals supported by many in the 2020 field, former White House official Sebastian Gorka centered his CPAC speech around the idea that Democrats want to take away Americans’ pickup trucks and burgers and rebuild their homes.\n\n“The whole straw-burger debate reminds me of Sheryl Crow telling Americans to reuse toilet paper,” said Bryan Lanza, a former Trump campaign official. “It didn’t pass the smell test.”\n\nMiller, a Democratic official who lives in Southern California, acknowledged the cultural sensitivity, particularly around meat, even as she pushed back on the premise that any of the candidates want to “ban” burgers. On a trip to Texas, Miller said she was struck by the T-shirts at Rudy’s “Country Store,” a barbecue joint. On the back, it says, “I didn’t claw my way to the top of the food chain … to eat vegetables.”\n\n“I thought, ‘Oh, boy, my California friends should come to Texas,’” she said. “It was like, you need to listen to people respectfully.”\n\nSouth Carolina state Sen. Dick Harpootlian, the former state party chair who backed Sanders in 2016 and is now with Biden, also said Democrats seem to be botching their messaging on the environment.\n\nHarpootlian joked in a text message that he couldn’t answer the phone cause his mouth was full of barbecue hog while he indulged on a glass of sweet tea “though an environmentally friendly paper straw.”\n\n“About as PC as I get.”", "description": "2020 presidential hopefuls fall for the GOP's culture war trap.", "authors": ["Christopher Cadelago", "Holly Otterbein"], "top_image": "https://static.politico.com/66/16/88b2d70d419dbc8d862c7c526e64/20190906-trump-smirks-ap-773.jpg", "published_at": "2019-09-06"}