{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/07/rand-paul-trump-once-again-fulfills-his-promises-with-syria-withdrawal", "downloaded_at": "2019-10-07 20:15:08.699742+00:00", "title": "Rand Paul: Trump ‘Once Again Fulfills His Promises’ with Syria Withdrawal", "language": "en", "text": "Sen. Rand Paul (R-KY) on Monday praised President Donald Trump for his decision to withdraw U.S. troops from northern Syria, stating the move shows the president continues to fulfill his “promises” to end “endless wars.”\n\n“I stand with @realDonaldTrump today as he once again fulfills his promises to stop our endless wars and have a true America First foreign policy,” Paul, a libertarian who has long opposed intervention abroad, wrote on Twitter.\n\nI stand with @realDonaldTrump today as he once again fulfills his promises to stop our endless wars and have a true America First foreign policy. — Senator Rand Paul (@RandPaul) October 7, 2019\n\nPaul’s praise comes as neoconservative Republicans are expressing disapproval with President Trump’s decision. Sen. Lindsey Graham (R-SC), a staunch defender of the president, called the pullout “unnerving to its core.”\n\n“This impulsive decision by the president has undone all the gains we’ve made, thrown the region into further chaos, Iran is licking their chops, and if I’m an ISIS fighter, I’ve got a second lease on life,” Graham told Fox and Friends. “I will do everything I can to sanction Turkey’s military and their economy if they step one foot into Syria.”\n\nFormer U.S. Ambassador to the United Nations Nikki Haley also criticized the decision, tweeting: “We must always have the backs of our allies, if we expect them to have our back. The Kurds were instrumental in our successful fight against ISIS in Syria. Leaving them to die is a big mistake. #TurkeyIsNotOurFriend.”\n\nHaley’s comments come after the former U.S. diplomat praised President Trump’s foreign policy record as something “every American should be proud of.”\n\n“If you look around the world, President Trump has a record every American should be proud of. In the Middle East, the ISIS caliphate has been destroyed, and we’ve stopped handing billions in cash to Iran that it used to fund terrorism,” she told Fox News ahead of a Sunday fundraiser for the president’s 2020 re-election campaign. “The North Korean regime is no longer testing long-range missiles. America is once again treating the Cuban dictatorship like the pariah it is, and Maduro’s days are numbered in Venezuela.”\n\nThe White House on Sunday announced it will remove U.S troops from northern Syria ahead of a Turkish military mission to remove Kurdish forces from the area.\n\n“Turkey will soon be moving forward with its long-planned operation into Northern Syria,” read the statement. “The United States forces, having defeated the ISIS territorial ‘Caliphate,’ will no longer be in the immediate area.”\n\nIn a series of Monday tweets, President Trump defended his decision, saying “the Kurds fought with us,” and they “were paid massive amounts of money and equipment to do so.”\n\n“I held off this fight for almost 3 years, but it is time for us to get out of these ridiculous Endless Wars, many of them tribal, and bring our soldiers home,” the president wrote.\n\n“WE WILL FIGHT WHERE IT IS TO OUR BENEFIT, AND ONLY FIGHT TO WIN,” he added.\n\nPresident Trump also warned that the U.S. will “totally destroy and obliterate” Turkey’s economy if it wages missions considered “off limits” in the region.", "description": "Sen. Rand Paul (R-KY) praised President Trump for his decision to withdraw U.S. troops from northern Syria.", "authors": ["Joshua Caplan"], "top_image": "https://media.breitbart.com/media/2018/08/Rand-Paul-pucker-Capitol-Hill-ap.jpg", "published_at": "2019-10-07"}