{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/boris-johnson-news-parliament-prorogue-suspend-brexit-commons-latest-a9097401.html", "downloaded_at": "2019-09-09 11:46:36.056766+00:00", "title": "Boris Johnson to suspend Parliament today for more than a month despite Brexit crisis", "language": "en", "text": "Parliament will be suspended today for five weeks despite the ongoing crisis surrounding Brexit, Boris Johnson's spokesman has announced.\n\nIn a historical ceremony known as \"prorogation\" to take place once Commons business is concluded on Monday evening, MPs will be summoned to the House of Lords to hear a message from the Queen halting business in both houses until 14 October.\n\nThe move means the PM will not attempt again to force a snap general election in October if MPs vote down his attempt to do so today.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nOpposition parties have agreed to vote down Mr Johnson's call for an early election on 15 October, which requires a two-thirds majority in the Commons.\n\nShape Created with Sketch. Thousands protest after Boris Johnson requests to suspend parliament Show all 29 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Thousands protest after Boris Johnson requests to suspend parliament 1/29 Houses of Parliament AP 2/29 Downing Street AFP/Getty Images 3/29 Houses of Parliament AP 4/29 Houses of Parliament to Downing Street AFP/Getty Images 5/29 Downing Street AP 6/29 Houses of Parliament Getty Images 7/29 Houses of Parliament EPA 8/29 Houses of Parliament AP 9/29 Whitehall AFP/Getty Images 10/29 Houses of Parliament AP 11/29 AP 12/29 PA 13/29 AP 14/29 AP 15/29 AP 16/29 AP 17/29 AP 18/29 PA 19/29 EPA 20/29 AP 21/29 AP 22/29 AFP/Getty Images 23/29 AFP/Getty Images 24/29 Getty Images 25/29 AP 26/29 AP 27/29 Getty Images 28/29 Getty Images 29/29 Getty Images 1/29 Houses of Parliament AP 2/29 Downing Street AFP/Getty Images 3/29 Houses of Parliament AP 4/29 Houses of Parliament to Downing Street AFP/Getty Images 5/29 Downing Street AP 6/29 Houses of Parliament Getty Images 7/29 Houses of Parliament EPA 8/29 Houses of Parliament AP 9/29 Whitehall AFP/Getty Images 10/29 Houses of Parliament AP 11/29 AP 12/29 PA 13/29 AP 14/29 AP 15/29 AP 16/29 AP 17/29 AP 18/29 PA 19/29 EPA 20/29 AP 21/29 AP 22/29 AFP/Getty Images 23/29 AFP/Getty Images 24/29 Getty Images 25/29 AP 26/29 AP 27/29 Getty Images 28/29 Getty Images 29/29 Getty Images\n\nThey fear that a vote next month might allow the PM to take the UK out of the EU without a deal on Halloween, despite legislation due to become law today barring him from doing so unless he has reached a deal with Brussels or secured parliamentary approval for no-deal.\n\nThe initial prorogration announcement made after leader of the Commons Jacob Rees-Mogg visited the Queen at Balmoral a fortnight ago stated that the longest prorogation since 1945 could begin on any date between 9 and 12 September.\n\nBy choosing the first possible date, Mr Johnson avoids being grilled by MPs at prime minister's questions on Wednesday as well as a 90-minute appearance before a panel of senior parliamentarians on the Commons Liaison Committee later the same day.\n\nBut it also means he has abandoned alternative routes for securing an early election, such as a vote of no confidence in his own government, or a single-line bill overruling fixed-term parliaments legislation.\n\nThe PM's official spokesman said that while the government would obey the law Mr Johnson would not be requesting another extension of the Article 50 EU withdrawal process.\n\nUnder repeated questioning at a Westminster media briefing, he did not rule out the possibility of Mr Johnson resigning.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Inside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\n\"The prime minister is not going to seek an extension,\" the spokesman said.\n\n\"If MPs want to resolve this there is an easy way - vote for an election today and let the public decide.\"\n\nThe spokesman dismissed suggestions that Mr Johnson might appoint another minister or official to request an extension on his behalf, in order to avoid breaking his promise that he would \"die in a ditch\" rather than delay Brexit.\n\n\"The prime minister's government will not be seeking an extension,\" said the spokesman. \"The prime minister's government will not be extending the Article 50 process.\"", "description": "Parliament will be suspended today for five weeks despite the ongoing crisis surrounding Brexit, Boris Johnson's spokesman has announced.  In a historical ceremony known as \"prorogation\" to take place once Commons business is concluded on Monday evening, MPs will be summoned to the House of Lords to hear a message from the Queen halting business in both houses until 14 October.", "authors": ["Andrew Woodcock"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/04/20/house-of-commons-boris-johnson.jpg", "published_at": "2019-09-09"}