{"pub": "businessinsider", "url": "https://businesstimes.com.sg/consumer/indias-tcs-misses-quarterly-profit-estimates-as-demand-slows", "downloaded_at": "2019-10-10 15:30:12.945031+00:00", "title": "India's TCS misses quarterly profit estimates as demand slows", "language": "en", "text": "\"We ended the quarter with steady growth despite increased volatility in the financial services and retail verticals,\" TCS chief executive Rajesh Gopinathan said in a statement.\n\n[MUMBAI] India's largest software exporter Tata Consultancy Services (TCS) on Thursday reported weak quarterly earnings, missing profit estimates as demand for its key banking and financial sector services shrank.\n\nThe Mumbai-headquartered firm posted a 1.8 per cent rise in consolidated net profit to 80.41 billion rupees (S$1.5 billion) for the quarter ended September, up from 79.01 billion rupees a year earlier, the company said.\n\nThe downbeat figures come as India's economy endures a prolonged slowdown - with the software giant's revenues seen as an indicator of the health of the country's IT export sector.\n\n\"We ended the quarter with steady growth despite increased volatility in the financial services and retail verticals,\" TCS chief executive Rajesh Gopinathan said in a statement.\n\nsentifi.com Market voices on:\n\n\"We remain confident as the medium and longer term demand for our services continues to be very strong, as evidenced by our Q2 order book - the highest in the last six quarters.\"\n\nKnown as India's second-most valuable company, TCS was at the forefront of an IT boom that saw the country become a back office to the world as firms - largely in developed nations - subcontracted work, taking advantage of a skilled English-speaking workforce.\n\nTCS earns more than 80 per cent of its revenues from Western markets including Britain, the United States and Europe.\n\nThe September-ended quarter is generally considered a strong one for India's IT service exporters due to increased spending from clients in Western markets.\n\nBut US-China trade tensions have sparked fears for the global economy, with the International Monetary Fund forecasting the weakest growth in a decade.\n\nIndia, Asia's third-largest economy, saw growth fall to five per cent in the June quarter, according to official data as manufacturing activity and consumer demand cooled.\n\nMany financial agencies have revised India's growth projections for the 2019-20 financial year, with some warning that a stronger dollar would cause the rupee to fall throughout 2019, stoking inflation and eroding demand further.\n\nOn Thursday, ratings agency Moody's revised the country's GDP growth forecast to 5.8 per cent from a previous estimate of 6.2 per cent for the financial year 2019-20, lower than the 6.1 percent projected by the Reserve Bank of India.\n\nTCS shares were down 0.80 per cent in Mumbai after the earnings announcement.\n\nThe company's rival Infosys is expected to announce its quarterly results on Friday.\n\nAFP", "description": ": THE BUSINESS TIMES Consumer - [MUMBAI] India's largest software exporter Tata Consultancy Services (TCS) on Thursday reported weak quarterly earnings, missing profit estimates as demand for its key banking and financial sector services shrank. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/articles/2019/10/10/file6zs4w69ijtdey7tfot2.jpg?itok=ceswc35d", "published_at": "2019-10-10"}