{"pub": "businessinsider", "url": "https://businesstimes.com.sg/stocks/investors-too-cautious-on-repeat-of-2008-jpmorgan-blackrock ", "downloaded_at": "2019-10-05 01:28:18.669153+00:00", "title": "Investors too cautious on repeat of 2008: JPMorgan, BlackRock", "language": "en", "text": "[NEW YORK] Investors are pumping the brakes too hard on equities amid concern a repeat of the 2008 financial crisis is around the corner, according to JPMorgan Chase & Co and BlackRock Inc.\n\nAnastasia Amoroso, a global investment strategist at JPMorgan in New York, said probable US Federal Reserve rate cuts in October and December will buoy stocks. The Trump administration, under pressure to lift the slowing US economy, may strike a more conciliatory tone with China in next week's trade talks, she said during a panel discussion on Bloomberg TV.\n\nBlackRock's Rick Rieder, speaking on the same panel, said he agreed that equities will probably grind higher.\n\n\"You have most investors who've been through 2008 and they see crises and they always err on the side of the next one is coming,\"said Mr Rieder, the firm's New York-based chief investment officer for fixed income. \"I actually don't think that's right.\"\n\nsentifi.com Market voices on:\n\nMs Amoroso and Mr Rieder are endorsing stocks even as other investors and strategists sound the alarm on risk assets, citing a global economic slowdown, intensifying US-China trade war and geopolitical risks from North Korea to Turkey and Argentina. Still, they're both encouraging a selective approach. Neither identified specific markets.\n\nFor Ms Amoroso, the priority is quality, yield and secular growth in technology and health care assets. There's also value in some short duration high-yield debt, she said.\n\nMr Rieder, meantime, said the front-end of the US Treasury yield curve offers \"great risk-reward\", although he's more cautious on the riskiest bonds.\n\n\"You have to be really careful in the high-yield market,\" he said.\n\nBLOOMBERG", "description": ": THE BUSINESS TIMES Stocks - [NEW YORK] Investors are pumping the brakes too hard on equities amid concern a repeat of the 2008 financial crisis is around the corner, according to JPMorgan Chase & Co and BlackRock Inc. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-10-05"}