{"pub": "euronews", "url": "https://euronews.com/2019/10/04/watch-live-irish-deputy-minister-simon-coveney-reacts-to-latest-brexit-plans", "downloaded_at": "2019-10-05 10:28:59.983634+00:00", "title": "Irish deputy PM Coveney says Brexit deal 'not mission impossible'", "language": "en", "text": "Finding a new Brexit deal is not \"mission impossible\" and could succeed, Irish foreign minister Simon Coveney said on Friday — but any new agreement must also secure an open Irish border.\n\nEarlier, he had said that British Prime Minister Boris Johnson's new Irish border proposal fell short of what was needed to strike a deal.\n\n\"This is not mission impossible. There is a deal to be done here,\" Coveney said, adding that changes to the Withdrawal Agreement would have to achieve the same outcome of no border infrastructure on the island of Ireland.\n\n\"I believe it's possible to do that with goodwill and energy on all sides, and I think we'll get that next week.\"\n\nHe said the EU remained concerned about the possibility of a no-deal Brexit, which many businesses fear would have damaging economic repercussions for Britain and the EU.\n\nOn Wednesday, Johnson submitted new proposals to the EU that he hopes will lead to a withdrawal agreement, although the bloc has responded with deep scepticism, saying more concessions are needed.\n\n\"I'm not interested in quarrels with anybody,\" Coveney said. \"We are... we're trying to find a way forward on a very, very complex and difficult issue. We respect the United Kingdom's decision to leave the European Union. But that creates, potentially, very difficult problems to solve on the Island of Ireland.\"\n\nHe added: \"The proposal from the British prime minister as it stands today, won't be the basis of an agreement. But if it's a stepping stone, to a landing zone, then I think it's... it should be seen in a positive light.\"", "description": "Irish deputy PM Coveney says Brexit deal 'not mission impossible'", "authors": [], "top_image": "https://static.euronews.com/articles/stories/04/20/75/46/1000x563_cmsv2_afd935bc-5c7f-55e0-b060-03aedd540663-4207546.jpg", "published_at": "2019-10-04"}