{"pub": "investingcom", "url": "https://ph.investing.com/news/stock-market-news/stocks-dive-on-china-brexit-worries-manufacturing-weakness-44942", "downloaded_at": "2019-09-04 00:01:39.909290+00:00", "title": "Stocks Dive on China, Brexit Worries, Manufacturing Weakness", "language": "en", "published_at": "2019-09-03", "text": "© Reuters.\n\nInvesting.com - Stocks started September with another round of nasty volatility.\n\nThe fell 0.69% on Tuesday. The dropped 1.08%. And the was off 1.1%.\n\nU.S. financial markets were closed Monday for Labor Day.\n\nThere were plenty of reasons for the slump.\n\nThere was the imposition of new 15% tariffs on goods imported from China and a similar tariff imposed by China on U.S.-made imports. The two sides have mostly toned down the rhetoric, but talks expected this month have not yet been scheduled.\n\nA weak report on U.S. from the ISM dowing contraction in the sector for the first time in three years.\n\nConcerns continued about political chaos in the United Kingdom that could affect the British and European economies. After the close of trading, Prime Minister Boris Johnson lost a vote that allows tomorrow for debate for a no-deal Brexit.\n\nAntitrust worries increased for Alphabet (NASDAQ: ). Some 30 states are planning to join an antitrust probe of the Internet giant, the Washington Post reported Tuesday. Google shares were off about 1.7%.\n\nAnd there were new worries about when Boeing will be able to get the 737 Max airliner back in the air. Boeing (NYSE: ) was off 2.66%, the weakest performer, and contributed 66 points to the Dow's 286-point loss.\n\nMany investors coped with the volatility by seeking safe havens, especially gold and Treasury securities. jumped $26.50 to $1,555.90 an ounce in futures trading in New York and there was talk the metal could move higher.\n\nSome stocks held their own because of predictable cash flows and little exposure to geopolitical issues, including American Tower (NYSE: ) and Everest Re Group (NYSE: ).\n\nAmong the eight Dow stocks that showed gains were Procter & Gamble (NYSE: ), Coca-Cola (NYSE: ) and Walmart (NYSE: ), all classic defensive stocks.\n\nThe yield fell to 1.472% after hitting a two-and-a-half-year low of 1.429%.\n\nmoved lower, with falling $1.16 to $53.94 a barrel in futures trading. , the global benchmark, was off 40 cents to $58.26 a barrel.\n\nWith Tuesday's losses, the S&P 500 is 4% from its peak in July. The Dow is off 4.67% and the Nasdaq is off 5.58%. All three indexes remain firmly in the black on the year, however.\n\nBut the averages are still below their Autumn 2018 peaks, suggesting that there are powerful resistance forces that could limit the market's gains. Fueling the resistance is the uncertainty caused by the U.S.-China trade fight as well as uncertainty in Europe over Brexit and also economic uncertainty in Latin America.\n\nWednesday may see some pressure from food processor Tyson Foods (NYSE: ), which cut full-year guidance in part because of commodity-price volatility and costs associated with enhancing food safety. Shares fell 6.2% after hours.\n\nIn addition, traders will be watching to see where Hurricane Dorian is heading and for signals on where the August jobs report will land. The report is due before Friday's open.\n\nKidney-dialysis-center operator DaVita HealthCare Partners (NYSE: ), American Tower (NYSE: ), reinsurance company Everest Re Group (NYSE: ) and Nextera Energy (NYSE: ) were among the top S&P 500 performers Tuesday.\n\nAlexion Pharmaceuticals (NASDAQ: ), IPG Photonics (NASDAQ: ), oil-and-gas producer Concho Resources (NYSE: ) and Westinghouse Air Brake Technologies (NYSE: ) were among the S&P 500's biggest laggards.", "description": "Stocks Dive on China, Brexit Worries, Manufacturing Weakness", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPED2R0T2_L.jpg"}