{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7623465/Donald-Trump-Melania-hand-candy-trick-treaters.html", "downloaded_at": "2019-10-28 23:35:02.202235+00:00", "title": "Donald Trump and Melania hand out candy to trick-or-treaters", "language": "en", "text": "President Trump and first lady Melania Trump handed out commemorative Halloween candy to trick-or-treaters at the White House Monday night.\n\nThe president and first lady opted not to dress in costume - with POTUS in a navy suit and FLOTUS in a belted coat with an autumn-colored patchwork design - but they seemed delighted by some of their guests' outfit choices.\n\nEarly on, a child in an inflatable dinosaur suit got a point of approval from the president. Trump patted a little boy, dressed as a mini U.S. Marine, on the cheek. A different Marine came through and saluted Melania Trump. The first lady comforted a sad Belle, wearing the trademark yellow dress.\n\nPresident Trump patted a little boy, dressed as a mini U.S. Marine, on the cheek as he went through the line\n\nBOO! President Trump and first lady Melania Trump handed out candy in front of a spookified White House\n\nTwo Marines make way for President Trump and first lady Melania Trump to greet trick-of-treaters at the White House Monday night\n\nPresident Trump (left) and first lady Melania Trump (right) arrive on the South Lawn Monday night for the White House's Halloween festivities\n\nPresident Trump and first lady Melania Trump smile as they walk out to meet the crowd at the White House Monday night\n\nHundreds of pumpkins were used on the stairs leading out to the South Lawn\n\nThe White House was decorated Monday night in a haunted forest theme, with black spooky trees and pumpkins galore\n\nCreepy black trees were used on the Truman Balcony to give the White House the look of a haunted forest\n\nDINO-MITE: Early on, President Trump gave a point of approval to a young man in an inflatable dinosaur costume\n\nThe mini Marine marches off after getting special attention from President Trump\n\nA child in a Minion costume posed a logistical problem for President Trump, who ended up just putting the candy bar on the child's head\n\nThe candy quickly took a tumble as the child walked away from the president and first lady\n\nA White House minion leads a Minion away, as more children come through to take candy from the president and first lady\n\nA little girl dressed as a Monarch butterfly grabs a Hershey's candy bar from first lady Melania Trump\n\nFirst lady Melania Trump looks spooked by a child sporting a skeleton costume\n\nThe Trumps admire a little girl dressed up as a Monarch butterfly\n\nThe Trumps give a bemused expression to a creepy clown walking through the line Monday night\n\nThe United States Air Force Strolling Strings played recognizable tunes including the themes from 'Harry Potter' and 'Game of Thrones'\n\nWhite House Press Secretary Stephanie Grisham tweeted out a photo of the festive decorations before trick-or-treaters arrived\n\nA child in an inflatable Minion costume posed a challenge to the Trumps, who ended up putting candy on the kid's head.\n\nIt quickly fell to the ground.\n\nCounselor to the President Kellyanne Conway - not in costume - was spotted jumping the line and then posing for selfies.\n\nThe first couple stayed outside for 38 minutes.\n\nThe White House was decorated with a haunted forest theme.\n\nBlack trees surrounded the South Portico with branches wrapping around the columns and climbing up to the Trump Balcony, while pumpkins trailed down the East and West staircases, their vines intertwined along the railings.\n\nFog machines pumped out white mist to give the South Lawn a spooky aura.\n\nHanding out candy to kids is a long time tradition at the White House for the president and first lady.\n\nMamie Eisenhower first started celebrating the holiday at the executive mansion in 1958, according to the White House Historical Association. But it was the Nixons who started to invite local children to participate.\n\nPresident Trump admires the costume of a young police officer, toting a jack-o-lantern candy basket\n\nTwo more dinosaurs come through, a popular costume at the White House this year\n\nPresident Trump and first lady Melania Trump greet a young jockey\n\nWhite House reporters who traveled with President Trump to Chicago aboard Air Force One Monday were treated to peppers dressed as jack-o-lanterns\n\nPresident Trump and first lady Melania Trump are silhouetted against the White House during the annual Halloween festivities\n\nThe president and first lady hand out candy in front of the White House made to look like a haunted forest\n\nPresident Trump and Melania Trump stayed outside for 38 minutes handing out candy as the sun set Monday night\n\nMarines salute the president and first lady as they exit the White House Halloween festivities Monday night\n\nThe United States Air Force Strolling Strings played a number of recognizable songs including the theme from the 'Harry Potter' movies and the television show 'Game of Thrones.'\n\nIn addition to the sweet treats, there were fun activities for the kids, including checking out a space suit from NASA and a tractor from the Department of Agriculture.\n\nThe Department of the Interior gave out Junior Ranger Explorer and Fishing books, badges, and stickers.\n\nAnd the Secret Service brought Presidential Limo known as 'The Beast,' for the kids to check out.\n\nEarlier in the day, reporters traveling with the president aboard Air Force One to Chicago got to partake in a little Halloween cheer too, as their stuffed peppers featured Jack-o-Lantern faces.", "description": "President Trump and first lady Melania Trump handed out commemorative Halloween candy to trick-or-treaters at the White House Monday night.", "authors": ["Emily Goodin", "U.S. Political Reporter", "Nikki Schwab", "Senior U.S. Political Reporter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/22/20301726-0-image-a-36_1572301376517.jpg", "published_at": "2019-10-28"}