{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/corrie-star-lucy-fallon-first-20738030", "downloaded_at": "2019-10-28 00:29:21.174091+00:00", "title": "Corrie star Lucy Fallon had her first smear test after Sinead's cancer death storyline", "language": "en", "text": "Get the biggest soaps stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nCoronation Street star Lucy Fallon has revealed she booked her first smear test following her co star Katie McGlynn's tragic storyline.\n\nKatie played Sinead Osbourne, who died from cervical cancer on the soap earlier this week.\n\nThis inspired Lucy, 23,to get her cervical screening, also known as a smear test, which checks for abnormal cells that could lead to cancer.\n\nShe has now urged other women to do the same, saying the process isn't painful and it could be potentially life-saving.\n\nThe actress, who plays Bethany Platt, spoke out on Friday as viewers watched Sinead die on Coronation Street.\n\n\"I went for my first smear test a few weeks ago. It was painless and took less than 2 minutes. Gals, go for your smear tests. It could save your life x\" she tweeted.\n\n(Image: Getty Images for Nickelodeon Sli)\n\nIn the soap Sinead, who was diagnosed a year ago, was informed she couldn't have had cervical screening (a smear test) because she was told she was too young at 24.\n\n\"I'm 24 you can't get cervical cancer at my age. I've never even been for a smear test,\" she said.\n\nSinead's story has prompted calls from viewers to lower the age for cervical screening.\n\n(Image: ITV)\n\nA smear test checks the health of the cervix and helps to prevent cancer.\n\nThe NHS states that all women and people with a cervix aged 25 to 64 should be invited by letter for the test and receive results usually in about two weeks.\n\nIt isn't recommended for anyone younger because in the UK, per 100,000 women, about four people are diagnosed with cervical cancer under the age of 25.\n\n(Image: Instagram)\n\nOne of Lucy's followers told her: \"A smear test saved my life and it is far easier and less painful than the follow up treatment if things are wrong. So important to have them it can save your life.\"\n\n\"I second that,\" said another.\n\n\"They found abnormal cells at my smear last year. Could have turned cancerous if not caught in time. Smear tests are so important!\"\n\nLucy, whose character has become a unlikely villain on the street after kissing Sinead's husband Daniel, spoke out about the impact of Sinead's tragic story as she took time away from cobbles at the re-launch - and second birthday - of the Inflata Nation attraction in Trafford Park.\n\n(Image: John Gladwin/Sunday Mirror)\n\nShe said: \"It's been really hard. It's one of those stories that's so important and so many people have been affected by it.\"\n\nIn her dying hours Sinead was forced to confront the devastating news that Daniel, played by Rob Mallard, had shared an emotionally-charged kiss with Bethany.\n\nCoronation Street worked closely with charities Mummy’s Star, the charity dedicated to women and their families affected by cancer during pregnancy, and Jo’s Cervical Cancer Trust on the storyline to ensure accuracy.", "description": "Lucy had her smear test after the show's heartbreaking death, and has urged other women to do the same", "authors": ["Verity Sulway", "Katie Fitzpatrick", "Image", "Getty Images For Nickelodeon Sli", "Itv", "Instagram", "John Gladwin Sunday Mirror"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20665919.ece/ALTERNATES/s1200/1_Nickelodoen-Slimefest.jpg", "published_at": "2019-10-27"}