{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/conservatives-balk-at-trump-congratulating-chinas-communist-party/2019/10/01/cf07a672-e44f-11e9-a6e8-8759c5c7f608_story.html", "downloaded_at": "2019-10-01 15:20:32.031975+00:00", "title": "Conservatives balk at Trump congratulating China’s Communist Party", "language": "en", "text": "President Trump meets with Chinese President Xi Jinping during a meeting on the sidelines of the Group of 20 summit in Osaka, Japan, in June. (Susan Walsh/AP)\n\nPresident Trump congratulated China on the 70th anniversary of Communist rule there in a tweet that belies America’s foreign policy position and ignores decades of human rights abuses.\n\n“Congratulations to President Xi and the Chinese people on the 70th Anniversary of the People’s Republic of China!” Trump tweeted Tuesday morning.\n\nShortly thereafter, House Republican Conference Chairwoman Liz Cheney (Wyo.) released a statement contradicting the president, and pointing to the People’s Republic of China’s oppressive governing tactics.\n\n“This is not a day for celebration,” Cheney said in a joint statement with Rep. Mike Gallagher (R-Wis.). The United States will use the occasion to “rededicate ourselves to ensuring that the Chinese Communist Party is left on the ash heap of history,” they added.\n\nTrump’s cheerful commemoration of China came as pro-democracy protests in Hong Kong against Chinese rule turned violent and one teenage protester was shot by police.\n\n[Protester shot as police disperse anti-China protests in Hong Kong]\n\nSen. Ben Sasse (R-Neb.) also released a statement that deeply contrasted with the Republican president.\n\n“Today Chinese tyrants celebrated 70 years of communist oppression with their typically brutal symbolism: by sending a police officer to shoot a pro-democracy protester at point-blank range,” Sasse said. “The freedom-seekers in Hong Kong mourn this anniversary, and the American people stand with them against those who deny their God-given dignity.”\n\nAnd Sen. Tom Cotton (R-Ark.) said, “From the Great Leap Forward to the Cultural Revolution to the camps in Xinjiang today, it has been a ghoulish 70 years of Chinese Communist Party control.”\n\nEven congressional allies of Trump, like Rep. Chip Roy (R-Tex.) took issue with Trump’s tweet. “I will pass,” Roy tweeted about offering his congratulations.\n\nTrump’s critics on Twitter blasted him over his celebratory tweet for China.\n\n“Congratulations to the people of Hong Kong for standing up for freedom. And best wishes to the people of China for freedom and democracy in the near future,” wrote conservative columnist Bill Kristol.\n\nAnother conservative writer, Dan McLaughlin, similarly responded to Trump.\n\n“I don’t celebrate the Soviet revolution in Russia, the Nazi takeover of Germany, or the Khmer Rouge taking power in Cambodia,” he tweeted. “For the same reasons, I do not celebrate Chairman Mao’s revolution in China.”\n\nTrump’s relationship with Xi has been rocky. Trump has called the Chinese president a friend, and yet, in the midst of a protracted trade war between the nations, Trump recently referred to Xi as an enemy.\n\nBut Trump’s congratulatory tweet to Xi as the leader oversaw a massive military parade appeared rather chummy.\n\n[China marks Communist Party’s 70th anniversary with grand show of power]", "description": "“Congratulations to President Xi and the Chinese people on the 70th Anniversary of the People’s Republic of China!” President Trump tweeted.", "authors": ["Congress", "Campaigns", "Health Policy", "Pennsylvania Politics", "October At Am"], "top_image": "https://www.washingtonpost.com/resizer/w3h-76Mb2J6rlFlmn60P523S3Qs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FVSOV3XEKYI6TJXIQ5M4LR7WBA.jpg", "published_at": "2019-10-01"}