{"pub": "usatoday", "url": "https://usatoday.com/story/news/politics/2019/10/30/john-bolton-asked-testify-trump-impeachment-inquiry/4101841002", "downloaded_at": "2019-10-30 23:23:33.424237+00:00", "title": "Former national security adviser John Bolton scheduled to testify in impeachment inquiry", "language": "en", "text": "CLOSE House Intelligence Committee Chairman Adam Schiff defended Lt. Col. Alexander Vindman, who testified to impeachment investigators on Tuesday. Schiff also said President Trump wants to punish the whistleblower first reported Trump's phonecall. (Oct. 30) AP, AP\n\nWASHINGTON – Former National Security Adviser John Bolton, who has emerged as a key witness and a central figure in the impeachment inquiry, has been scheduled to testify next week.\n\nBolton was asked to appear before the House Intelligence, Foreign Affairs, and Oversight Committees on Nov. 7, according to an official with knowledge of the proceedings. Two other National Security Council staffers, Michael Ellis and John Eisenberg, were asked to appear on Nov. 4, the official told USA TODAY.\n\nA scheduled deposition, however, does not guarantee Bolton's appearance before the committees. Some lawmakers have indicated they would be open to subpoenaing the former national security adviser to compel his testimony.\n\n\"Bolton is going to do his own thing. So you know he's, he's unpredictable at best,\" Rep. Stephen Lynch, D-Mass., said to reporters outside the room in the Capitol basement where State Department official Christopher Anderson was testifying behind closed doors.\n\nWhen asked if Bolton would be subpoenaed, Intelligence Committee Chairman Adam Schiff, D-Calif., would not comment, but said, \"We certainly hope that he will cooperate. He obviously has very relevant evidence to provide.\"\n\nMore: Members of Congress begin debate on impeachment resolution on 'sad day': The latest\n\nWitnesses' testimonies over the past several weeks has highlighted Bolton's role in Ukraine policy. Ambassador Bill Taylor's testimony described how Bolton thought efforts to link a White House meeting between Ukrainian President Volodymyr Zelensky and Trump were akin to a \"drug deal.\"\n\nRead or Share this story: https://www.usatoday.com/story/news/politics/2019/10/30/john-bolton-asked-testify-trump-impeachment-inquiry/4101841002/", "description": "Some lawmakers have indicated they would be open to subpoenaing  John Bolton to compel his testimony if he does not show up on Nov. 7.", "authors": ["Nicholas Wu", "Christal Hayes", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/15/USAT/ee436d82-684a-4978-a8cf-cc4ec321fcb9-AFP_AFP_1KV55B.JPG?crop=2049,1152,x110,y371&width=1600&height=800&fit=bounds", "published_at": "2019-10-30"}