{"pub": "yahoo", "url": "https://news.yahoo.com/photos-white-death-in-argentina-the-hunger-of-poverty-feeds-tuberculosis-175332973.html", "downloaded_at": "2019-10-25 16:54:46.386847+00:00", "title": "PHOTOS: 'White death' in Argentina: The hunger of poverty feeds tuberculosis", "language": "en", "text": "Cristian Molina takes his tuberculosis medication at his house in the shantytown of Luján in Buenos Aires, Argentina. (Photo: Magali Druscovich/Reuters)\n\nBUENOS AIRES, Argentina — In a poor Buenos Aires suburb, Cristian Molina’s jeans and denim jacket hide his unhealthily slight frame, his legacy from years of a poor diet that left him susceptible to the tuberculosis infection he contracted earlier this year, a disease of poverty that is making a comeback in Argentina.\n\nMolina, 26, lives in the shantytown of Luján near the wealthy capital with his parents, six siblings and four nephews. Doctors think one brother contracted the disease in prison and then spread it around the family when he returned home.\n\nCases of the “white death” illness, closely linked to malnutrition and poor housing, have been on the rise since the turn of the decade as Latin America’s third-largest economy has been battered by repeat recessions and inflation.\n\nCurrently, fast-rising prices and recession are driving more people below the poverty line and stoking homelessness and hunger. The poverty rate stood at above 35 percent in the first half of the year, hurting Argentine President Mauricio Macri, who is expected to lose the general elections on Sunday.\n\nBrigida Simaniz (not pictured) watches over her son Nicolas as he is examined in March by Laura Lagrutta, a pulmonologist specializing in children with tuberculosis, at Dr. Raul Vaccarezza Institute in Buenos Aires, Argentina. (Photo: Magali Druscovich/Reuters) More\n\n“Tuberculosis is the collateral damage of poverty,” said Laura Lagrutta, an Argentine respiratory specialist focused on treating children with the disease.\n\nAccording to the latest figures from the World Health Organization, there were 10,320 reports of new and relapsed TB cases in Argentina last year. The number of cases, which had dropped steadily since the 1980s, started to rise again after 2010.\n\nTuberculosis kills 5,000 people every day globally and is one of the world’s biggest killers.\n\nFarm-rich Argentina is still better off than some of its South American neighbors, including Brazil and Peru, where incidence of the disease is higher. But the infection rate in Argentina is rising at a worrisome pace.\n\nMarcela Natiello, coordinator of the national TB and leprosy control program, said a declining trend since the 1980s had reversed in 2013, linked to “multiple and complex causes.”\n\n“TB primarily affects the most vulnerable populations with low economic resources, residing in poor, badly ventilated and overcrowded environments,” she said, adding that over half of all cases were in the populous area around Buenos Aires.\n\nMariela, an infectious disease specialist intern, analyzes an X-ray of 24-year-old patient Jorge, who is currently undergoing treatment for tuberculosis, in Buenos Aires, Argentina, Jan. 29, 2019. (Photo: Magali Druscovich/Reuters) More\n\nRecord numbers\n\nDoctors said the rise in the number of cases was straining some hospital wards where patients with TB are being treated.\n\nPatricia Figueroa, a social worker at the Muniz public hospital, said the facility was struggling with overcrowding as it faced a growing number of TB patients, which she described as “a record in recent history.”\n\n“Due to overcrowding, the hospital is discharging patients with low risk of contagion in order to receive high-risk ones, something very dangerous,” she said, adding that the hospital was looking at how to add more beds to other wards to accept more people.\n\nIn slums around the country, Reuters spoke to many people with the disease, who all described living in cramped housing and said they lacked an ample supply of nutritious food.\n\nIn Villa 31, a populous shantytown neighborhood in the capital, Luli, 19, has gone through a year of treatment since contracting the disease while she was pregnant. She says her now-months-old baby luckily did not get infected.", "description": "In a poor Buenos Aires suburb, Cristian Molina’s jeans and denim jacket hide his unhealthily slight frame, his legacy from years of a poor diet that left him susceptible to the tuberculosis infection he contracted earlier this year, a disease of poverty that is making a comeback in Argentina.", "authors": ["Yahoo News Photo Staff"], "top_image": "https://s.yimg.com/uu/api/res/1.2/TRIj7rjd.Nq4lxH65Rp_8w--~B/aD00MDE2O3c9NjAxNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/14c9f2a0-f670-11e9-8fff-d8d416ca331b", "published_at": "2019-10-24"}