{"pub": "cnbc", "url": "https://cnbc.com/2019/10/16/google-pixel-4-could-take-advantage-of-huaweis-troubles-but-becoming-mass-market-isnt-easy.html", "downloaded_at": "2019-10-16 06:46:30.312255+00:00", "title": "Google Pixel 4 could take advantage of Huawei's troubles — but becoming a phone for the masses won't be easy", "language": "en", "text": "Pixel 4 smartphones are displayed during the Made by Google event in New York, U.S., on Tuesday, Oct. 15, 2019. Bloomberg | Bloomberg | Getty Images\n\n\"With Huawei facing huge challenges, particularly in Europe, now is the time for Google if it's serious about moving the needle with Pixel,\" Geoff Blaber, vice president of Americas research at CCS Insight, said in a note.\n\n'Vacuum' in Europe\n\nHowever, headwinds remain and could make it tough for Google to challenge Huawei, even with the Chinese technology giant's current issues. Google's smartphone strategy under its older Nexus lines of phone was not really about mass market scale. Instead, it used to release the devices to show off the best of what its Android software had to offer so other vendors could follow. But recently, with the Pixel line of phones, it has become serious about being a big handset player. Rick Osterloh, Google's senior vice president of devices and services, told The Verge in 2017 that the company hopes to be selling in \"high volumes in five years.\" Huawei's issues have sparked debate about what other companies could take advantage of. In particular, Europe is seen as a key battleground, since Huawei is the number two player by market share, behind Samsung. Huawei saw its shipments fall 16% year-on-year in the second quarter, according to Canalys. But Google's lack of relationships with mobile carriers on the continent could make it tough for it to challenge Huawei with the Pixel 4. \"The consequences of Huawei's entity listing has left a vacuum in Europe and a huge opportunity for share gain. However, given the Pixel's limited operator support in Europe, it's far more likely to be Samsung that benefits,\" Blaber told CNBC in an email, referring the the U.S. blacklist.\n\nIn many European countries, carriers are crucial for making expensive, high-end phones a success because they offer fixed-term contracts with monthly payments that often make a device more affordable for consumers. At its launch event Tuesday, Google announced the Pixel 4 would be carried by a number of U.S. networks including AT&T and Verizon. But very few European carriers have the phone. \"We have to keep in mind that these two vendors (Google and Huawei) compete on two different battlegrounds: three out of four Pixel phones are sold in the U.S., whereas Huawei is effectively non-existent there,\" Bryan Ma, vice president of devices research, told CNBC. \"Conversely, a key beachhead in Huawei's overseas momentum is in Europe, where Google's Pixel line has had a limited presence.\" \"Most of the carriers that were announced last night were U.S.-based. So if Google's priorities are still focused there, then it's unlikely that they would take much share from Huawei,\" Ma said.\n\nHuawei resilience\n\nFor its part, Huawei has remained relatively resilient. In the second-quarter of 2019, it was still the second-largest smartphone player in the world. It must be noted however, that the Mate 30, which does not have licensed Google apps, was released in the third quarter. Analyst firms have yet to release third quarter numbers. Huawei also released its own operating system called HarmonyOS in August. The company has insisted on several occasions that it still wants to use Google's Android. But Richard Yu, the head of Huawei's consumer division, said the company could \"immediately\" switch its devices to HarmonyOS if needed.\n\nEach morning, the “Beyond the Valley” newsletter brings you all the latest from the vast, dynamic world of tech – outside the Silicon Valley. Subscribe: By signing up for newsletters, you are agreeing to our Terms of Use and Privacy Policy.", "description": "With Huawei on a U.S. blacklist, analysts say there is a \"vacuum\" in Europe that Google could take advantage of — but a lack of partnerships with carriers could hold it back.", "authors": ["Arjun Kharpal"], "top_image": "https://image.cnbcfm.com/api/v1/image/106183724-1571201359202gettyimages-1176009332.jpeg?v=1571201478", "published_at": "2019-10-16"}