{"pub": "yahoo", "url": "https://news.yahoo.com/security-forces-arrest-31-cartel-194635232.html", "downloaded_at": "2019-10-23 12:16:23.582263+00:00", "title": "CORRECTED-Security forces arrest 31 cartel suspects in raid on Mexico City drug labs -authorities", "language": "en", "text": "(Corrects statement of Mexico City's public security secretary in paragraph 6, making clear he did not refer to a specific criminal group)\n\nBy Lizbeth Diaz\n\nMEXICO CITY, Oct 22 (Reuters) - Security forces arrested 31 suspected cartel members on Tuesday in a raid on a warren of clandestine tunnels and alleged drug laboratories in Mexico City, authorities said.\n\nGovernment officials said dozens of police and security force members swooped down on buildings in the central Tepito neighborhood of Mexico City, long known for its contraband activity.\n\nVideos on Twitter purportedly of the raid showed soldiers in battle gear brandishing assault rifles alongside armored vehicles and police trucks blocking an intersection and highway before dawn.\n\nOmar Garcia, Mexico City's public security secretary, said two laboratories used to produce synthetic drugs and 50 kg (110.23 lb) of chemical precursors were seized during the raid.\n\nMore than two tons of marijuana and 20 kilos of cocaine were also seized, he said, along with an unspecified amount of money and a weapons cache that included rocket launchers and grenades.\n\nSpeaking at a press conference, Garcia said the raid led to the arrest of 31 people. The Union cartel and other criminal groups have operated in Tepito for years. In his remarks, Garcia referred only to an unnamed gang.\n\n\"This ministry learned of collusion between this criminal group and authorities from Mexico City ... the decision was made to act fast,\" said Garcia, who gave no details.\n\nThe show of force comes as the government has faced criticism after back-to-back outbreaks of spectacular acts of violence last week. These included a rampage by cartel gunmen during the attempted arrest of a drug lord's son and a gunfight that killed 13 police officers.\n\nMexico sent special forces on Monday to patrol the northern city of Culiacan after the city-wide assault by gunmen that led authorities to free Joaquin \"El Chapo\" Guzman's son in a storm of bullets.\n\nPresident Andres Manuel Lopez Obrador has been strongly criticized for authorities' botched handling of the Culiacan arrest, which critics say risks encouraging cartels to use more force than ever before to resist arrests. But the left-leaning populist has insisted the decision to release Ovidio Guzman was made to save lives.\n\nThe country was hit by a record number of homicides in 2018. Lopez Obrador, who took office in December, has promised that a security strategy premised on \"hugs, not bullets\" can correct the \"failed policies\" of past administrations and help stem the tide of Mexico's drug-related violence.\n\nAccording to an official with the Marines branch of Mexico's armed forces, who asked not to be named as he was not authorized to speak to the press, 11 caches of drugs stashed in liquor stores and at least two underground tunnels controlled by the Union cartel were uncovered in Tuesday's raid. (Reporting by Lizbeth Diaz Writing by Delphine Schrank; Editing by Tom Brown)", "description": "Security forces arrested 31 suspected cartel members on Tuesday in a raid on a warren of clandestine tunnels and alleged drug laboratories in Mexico City, authorities said.  Government officials said dozens of police and security force members swooped down on buildings in the central Tepito neighborhood", "authors": ["Lizbeth Diaz"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-22"}