{"pub": "marketwatch", "url": "https://marketwatch.com/story/defensive-plays-lead-european-stocks-as-german-confidence-still-bleak-2019-09-24", "downloaded_at": "2019-09-24 13:48:26.865714+00:00", "title": "Defensive plays lead European stocks as German confidence still bleak", "language": "en", "text": "Led by defensive plays, Europe stocks advanced Tuesday as a key economic report showed German business confidence still bleak.\n\nRising for the fourth day in five, the Stoxx Europe 600 SXXP, +0.10% rose 0.19% to 390.53, as pharmaceuticals, household products firms and food producers led the way, all sectors that are relatively less exposed to the swings of the economy.\n\nThe German DAX DAX, -0.02% rose 0.07% to 12350.76 as the Ifo business climate index in Germany rose marginally in September, but the expectations component fell to a decade low.\n\n“A much welcome rebound, but the details weren’t uplifting,” said Claus Vistesen, chief eurozone economist at Pantheon Macroeconomics. “We always have to be careful fitting stories to these data, but it looks to us as if the ECB’s recently announced measured have succeeded in providing a modest lift to the current assessment, while expectations are still hampered by unchanged, and elevated, global uncertainty.”\n\nThe French CAC 40 PX1, +0.17% rose 0.22% to 5643.37 and the U.K. FTSE 100 UKX, -0.40% declined 0.14% to 7315.47 after the U.K. Supreme Court ruled that suspending Parliament was unlawful. See London Markets\n\nAfter a slight advance for the Dow industrials DJIA, +0.06% on Monday, U.S. stock futures ES00, +0.30% were higher.\n\nStocks in the spotlight included EQT Partners , as the Swedish private equity firm surged to 84.50 crowns after pricing its initial public offering at 67 crowns.\n\nVolkswagen VOW3, -2.33% shares fell over 2% as German prosecutors charged executives including CEO Herbert Diess with market manipulation in connection with the diesel emissions scandal that erupted in 2015. Read more on VW.\n\nVW’s majority owner Porsche Automobil Holding PAH3, -2.43% fell over 2% as well.\n\nK+S SDF, -4.18% shares fell 4% as the German chemicals producer said it was cutting its fertilizer production due to weak demand, which will hurt operating profit by up to 80 million euros.\n\nEvotec EVT, +3.27% climbed 5% as the company announced a drug discovery collaboration with Takeda Pharmaceuticals, where the Japanese firm will pay an undisclosed upfront fee as well as milestones that can reach around $170 million per program.\n\nTUI TUI, +7.26% rose 4.3%, extending Monday’s rally, as the travel company reiterated its fiscal year underlying profit guidance that may fall as much as 26%. The company said it’s assessing the short-term impact of Thomas Cook’s insolvency.", "description": "Led by defensive plays, Europe stocks started higher as a key economic report showed German business confidence still bleak.", "authors": ["Steve Goldstein", "European Markets Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR913_kands__ZG_20190924043526.jpg", "published_at": "2019-09-24"}