{"pub": "breitbart", "url": "https://breitbart.com/news/officials-controlled-explosion-at-collapsed-new-orleans-hotel-brings-crews-closer-to-retrieving-two-bodies", "downloaded_at": "2019-10-21 04:09:26.150427+00:00", "title": "Officials: Controlled explosion at collapsed New Orleans hotel brings crews closer to retrieving two bodies", "language": "en", "text": "Oct. 20 (UPI) — Officials said they detonated explosions in downtown New Orleans Sunday, toppling two cranes at a partially collapsed Hard Rock hotel, securing the precarious construction site and taking a further step toward recovering the bodies of two people still stuck within its rubble.\n\nA section of one of the cranes fell into the street while part of the second crane was hanging from the collapsed building following the detonation that New Orleans Fire Chief Tim McConnell described as a success.\n\n“I don’t think it could have gone much better,” McConnell said during a press conference. “If you look at the front crane, it went down exactly as we expected it to do. And the rear crane, the back portion came down right outside the building where we already had a partial collapse and stuff in the street.”\n\nFollowing an initial assessment, the explosion shattered three windows at the city’s historic Saenger Theatre and one of the falling cranes damaged a sewer line, which they had anticipated and was “the least of our worries,” he said.\n\n“We think we’re going to be fine, and that’s really, really good,” he said. “Right now, we’re going through with engineers and assessing the building.”\n\nMayor LaToya Cantrell said the city was in a better state now than eight days ago when the 18-story building that was under construction collapsed, killing three people and injuring 30 others. Over 100 workers were at the site when the incident occurred.\n\nAnd now that the site is more stable, the next task will be to remove two bodies still stuck within the building’s rubble to bring closure to their families, she said.\n\n“My timeline is right now. It’s today,” she told reporters on when she hopes to retrieve their bodies. “We have our firm that is on the ground … with the mission being to remove the victims from the site.”\n\nShe said the next step following the explosion of the cranes was to retrieve the bodies, which were protected during the implosion.\n\nAuthorities located the bodies and coordinated the explosion to prevent them from being moved in order to aid their recovery, McConnell said.\n\n“We do believe both victims are exactly where they were prior to it,” he said. “That was our goal — to make sure we could get to them and not let it drop in that area… That was our goal and we succeeded at that.”\n\nAfter the bodies are removed, the next step will be to demolish the rest of the building, and a timeline will be determined following a more thorough assessment of the area.\n\n“To be clear, I don’t want anything salvaged,” Cantrell said. “We want a complete demolition.”\n\nThe area around the site was under an explosion order, which was lifted following the detonation while an evacuation order has been reduced, the city said on its website.\n\nThe evacuation zone has been reduced. If you are not in the red zone on the map, you are allowed to return. Individuals in the red zone must remain evacuated. Text HARDROCK to 888777 for updates on evacuation. pic.twitter.com/DG2rjs2U6h— NOLA Ready #HardRockCollapse (@nolaready) October 21, 2019\n\nThe controlled demolition of the cranes was originally scheduled for Saturday, but was delayed to better prepare the area, officials said.", "description": "Oct. 20 (UPI) — Officials said they detonated explosions in downtown New Orleans Sunday, toppling two cranes at a partially collapsed Hard Rock", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-20"}