{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-europe-migrants-ministers/germany-warns-of-repeat-of-2015-eu-migration-chaos-idUKKBN1WN16C", "downloaded_at": "2019-10-08 12:54:22.062785+00:00", "title": "Germany warns of repeat of 2015 EU migration chaos", "language": "en", "text": "LUXEMBOURG/BRUSSELS (Reuters) - Germany warned on Tuesday of a repeat of the chaotic influx of migrants that caught the European Union unprepared in 2015, with Greece and Cyprus sounding alarms over a resurgence of arrivals from neighbouring Turkey.\n\nFILE PHOTO: German Interior Minister Horst Seehofer attends the weekly cabinet meeting at the Chancellery in Berlin, Germany, September 25, 2019. REUTERS/Michele Tantussi\n\nEU ministers met to discuss migration as Greece has again become the main gateway to Europe for people fleeing wars and poverty in the Middle East, Asia and Africa, with U.N. data showing nearly 45,600 arrivals by sea so far this year.\n\n“If we leave all the countries on the EU’s external border (to fend for themselves), there will never be a common European asylum policy,” German interior minister Horst Seehofer said.\n\n“And if there is no common European asylum policy, there is a danger that uncontrolled immigration will once again take place, throughout Europe. We have seen this before and I do not want it to happen again,” he told reporters in Luxembourg.\n\nThe bloc is wary of any recurrence of the 2015 crisis that sowed bitter divisions among EU states, strained social and security services and fuelled support for populist, anti-immigration, eurosceptic and far-right parties.\n\nGreece saw the highest monthly arrival numbers in August since the 2016 EU-Turkey deal that greatly reduced sea crossings there, according to a document - seen by Reuters - prepared by Finland, which currently holds the bloc’s rotating presidency.\n\nTurkey has long complained that the EU support promised in exchange for keeping a lid on migration to Europe is inadequate given that it now hosts around 3.5 million Syrian refugees.\n\nThe pressure on overcrowded migrant camps on Greece’s Aegean islands is rising anew. Charity group Oxfam said over 13,000 men, women and children were now crammed into the Moria camp on Lesbos that was designed to accommodate 3,100 people.\n\n“The situation of children in the Moria camp is particularly worrying,” Oxfam said in a statement, stressing that many of those under-age were on their own.\n\nThough the deal with Turkey helped contain the 2015 crisis, rights groups condemned it for undercutting international humanitarian law on providing safe haven for refugees, and aggravating the suffering of those already in distress.\n\nIn return for Turkish help, the EU pledged 6 billion euros on refugee projects in Turkey. The EU says the money has since been delivered, but Ankara disputes this and has asked for more.\n\nSpain has received the second highest number of seaborne migrants this year with nearly 30,000, followed by Italy at nearly 8,000, Malta at close to 1,600 and Cyprus at about 800, according to United Nations data.\n\nRelative to population size, however, Cyprus is currently under the heaviest pressure, according to the Finnish note.\n\nCyprus, Greece and Bulgaria said in a separate document at the ministerial meeting, which was also seen by Reuters, that the situation bore “alarming elements of an emerging crisis”.\n\n“Europe cannot be caught unprepared for a second time...The EU will have to consider positively the allocation of further funds to those countries of the broader region of the Eastern Mediterranean route affected by immense migratory flows.”\n\nHOSTING BOAT MIGRANTS\n\nMaria Ohisalo, the interior minister of Finland, said the EU must address the situation in both the eastern Mediterranean as well as along the sea routes linking Africa to Italy and Malta.\n\nRome and Valletta will try to enrol on Tuesday more EU peers in a migrant relocation scheme they agreed with France and Germany last month for migrants rescued at sea.\n\nThe plan was largely seen as a political gesture towards Italian Prime Minister Giuseppe Conte, who adopted a more EU-friendly tone after winning a general election that saw the ouster of the staunchly anti-immigrant Matteo Salvini.\n\nSeehofer has said Germany could take in a quarter of migrants who reach Italy by sea. Rescue boats have repeatedly been stranded in the sea for weeks this summer as EU states quarrelled over who should host those onboard.\n\nMore member states may express support on Tuesday but the plan would still not be automatic or obligatory, meaning the usual “coalition of the willing” would step in while those opposed to accommodating the new arrivals are left alone.\n\nThe refusal of Hungary, Poland and their ex-communist peers on the eastern flank of the EU to help the “front-line”, Mediterranean member states by hosting some migrants has eroded the bloc’s unity since 2015.", "description": "Germany warned on Tuesday of a repeat of the chaotic influx of migrants that caught the European Union unprepared in 2015, with Greece and Cyprus sounding alarms over a resurgence of arrivals from neighbouring Turkey.", "authors": ["Gabriela Baczynska", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191008&t=2&i=1438440073&w=1200&r=LYNXMPEF970Q3", "published_at": "2019-10-08"}