{"pub": "dailybeast", "url": "https://thedailybeast.com/wwe-star-jerry-the-king-lawler-sues-tennessee-sheriff-over-sons-death-court-docs", "downloaded_at": "2019-09-22 15:22:07.988756+00:00", "title": "WWE Star Jerry “The King” Lawler Sues Tennessee Sheriff Over Son’s Death: Court Docs", "language": "en", "text": "Jerry Lawler, the WWE wrestler known to fans as “The King,” has picked a new kind of fight: a lawsuit against Tennessee Sheriff John Doolen over the death of his son, Brian Christopher “Grand Master Sexay” Lawler, who died by suicide while in Hardeman County Sheriff’s Office custody. The case, filed July 26 in Hardeman County Court, seeks $3 million in compensatory damages and undetermined punitive damages for the suicide, which Lawler and his attorney say could have been avoided.\n\n“I think everyone will agree that preventable suicides must be prevented and this was a preventable one,” Lawler’s attorney Jeffrey Rosenblum said at a press conference Monday afternoon. “You put a suicidal man in a cell with shoelaces and bolts coming out of the wall. It doesn’t make sense.”\n\nBrian Lawler (from here referred to as “Brian”) was pronounced brain dead on July 29, 2018, after hanging himself in his jail cell the night before. He had been in Hardeman County custody since July 7, 2018, following an arrest for driving under the influence. The lawsuit claims the arrest was unfair, as both a blood test and a breathalyzer showed Brian had no alcohol in his system. When a bond was set at $40,000, his father declined to pay it, electing instead to try and transfer Brian to a rehabilitation center. Brian had been diagnosed with major depressive disorder and had a history of drug and alcohol addiction.\n\nJerry Lawler (from here referred to as “Lawler”) claimed that when he visited his son at the jail, Sheriff Doolen had seemed invested in Brian’s welfare. “That was the first time I even met Sheriff Doolen,” Lawler said at the press conference. “It was very convincing. He brought Brian into the meeting. He said, ‘Brian, you need help. If you don’t believe you need help, just go into the bathroom and look at yourself.’ He looked bad. I went into the bathroom with him and he started crying.”\n\nBut Brian did not find much help for his addiction problems in the county jail, according to Lawler. Not long after the first meeting, the wrestler received a phone call from his son. “He said, ‘Dad, Sheriff Doolen lied. They haven’t given me any help. They won’t even give me the medicine I’ve been taking,’” Lawler said at the press conference. “That was one of the last times I spoke with my son.”\n\nWhen Brian was assaulted by another inmate on July 28, 2018, the lawsuit alleges that the jail failed to provide him adequate medical care, “despite Brian having a significant open wound about his eye and urging jail staff to take him to the hospital because of a suspected concussion.” Instead, they placed him in a solitary confinement cell and left Brian with both his shoelaces and a selection of large bolts protruding from the wall. In the complaint, Rosenblum claims the jail did not assess Brian for suicide risk, even though they knew his medical history and that Brian had attempted suicide twice before in 2013 and 2015.\n\n“Not only does the above set of facts constitute a gross deviation from the accepted standard of care from a healthcare liability perspective,” the filing reads, “but it also constitutes a civil rights violation on the part of all defendants.”\n\nWhile in solitary, Brian repeatedly cried for help, the complaint states, but was ignored. One correctional officer, William Gonzalez, also named as a defendant in the case, told investigators that he saw what appeared to be Brian with a towel over his head, standing on a concrete bench in his cell under one of the wall bolts. Instead of checking on him, Gonzalez finished taking out the garbage. Minutes later, noticing that Brian had not moved, Gonzalez asked a co-worker to take a look. After two officers peeked into the cell, they decided to open the door, and found Brian hanging from his shoelaces. They cut him down with children’s scissors. He was taken off life support the next morning.\n\n“ I think everyone will agree that preventable suicides must be prevented and this was a preventable one. ” — Attorney for WWE Star Jerry “The King” Lawler\n\nFollowing the wrestler’s death, Tennessee District Attorney General Mark Davidson requested a criminal investigation. The Tennessee Bureau of Investigations, which conducted this investigation, declined to comment for this story, but reportedly shared some of their results with Lawler and his attorney.\n\nRepresentatives for the Hardeman County Sheriff’s Office did not respond to requests for comment. “They knew it was coming,” Rosenblum said. “There has been no acceptance of responsibility. There has been no effort to settle this suit.”\n\nLawler, a veteran wrestling Hall of Famer, made a name for himself as The King of Memphis in the '70s and ’80s. He started out as a “heel” (wrestling jargon for the “bad guy”) before transitioning into a “face” (the “good guy”), and quickly became a star, racking up more than 200 titles and a long-running fake feud with comedian Andy Kaufman. In 1992, Lawler semi-retired from wrestling to become a commentator, where he became famous for squealing “Puppies!” at female wrestlers with big breasts. Like his father, Brian Lawler was also a professional wrestler, performing first as a masked performer named “Nebula” before taking the name “Too Sexy” Brian Christopher, and later, “Grand Master Sexay.”\n\nDuring their wrestling careers, the father and son Lawlers often riffed publicly about their relationship, at times vehemently denying they were related at all; at others, performing a bitter resentment. In one WWE Raw episode from 2011, according to Bleacher Report, Lawler commented on one of Brian’s matches, and took his opponent’s side, calling Brian a “bigger screw-up than Charlie Sheen.” In response, the son marched over to the announcement desk, and slapped his father in the face.\n\nBut at the press conference Monday, the kayfabe was over. The family sat solemnly around the desk of Rosenblum’s law offices, answering questions from reporters. Brian’s mother and Lawler’s first wife, Kay McPherson, speaking softly and deliberately, told the crowd she wanted to help prevent another family from going through what she had been through.\n\n“We’re a grieving family and we’re sticking together trying to help each one get through each day,” she said. “I think about him everyday. You think about him when you go to bed at night. You think about him when you wake up in the morning. You think about him all day.”", "description": "Brian “Grand Master Sexay” Lawler died by suicide while in police custody, where a lawsuit claims he was placed in solitary confinement after being assaulted by another inmate.", "authors": ["Tarpley Hitt"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1564470183/190729-hitt-lawler-tease_kgsw1g", "published_at": "2019-07-30"}