{"pub": "hotair", "url": "https://hotair.com/archives/allahpundit/2019/10/18/dem-snafu-impeachment-trial-will-force-many-2020-hopefuls-spend-several-key-weeks-washington-instead-campaigning", "downloaded_at": "2019-10-19 11:07:53.420816+00:00", "title": "Dem snafu: Impeachment trial will force many 2020 hopefuls to spend several key weeks in Washington instead of campaigning", "language": "en", "text": "A nifty piece by BuzzFeed contemplating a major unintended consequence of the Democrats’ pursuit of impeachment. The Senate’s rules when the president is on trial are clear: Attendance is mandatory. Mitch McConnell has already announced that the proceedings will run six days a week (Sundays are off) beginning each day at 12:30 p.m. ET and running until … who knows when. Conventional wisdom has it that House Dems will vote on impeachment before Thanksgiving and the Senate will take up the matter shortly thereafter, with the trial set to run throughout December.\n\nThe first Democratic presidential vote, in Iowa, takes place on February 3.\n\nAll of which means that no fewer than six Democratic presidential candidates will be stuck spending prime campaign time bogged down in the Capitol as jurors in Trump’s case instead of out on the trail in the early states stumping for votes. Specifically, it’s Michael Bennet, Cory Booker, Amy Klobuchar … and Kamala Harris, Bernie Sanders, and Elizabeth Warren. Two of the three members of the top tier along with a candidate who was top-tier once before this year and might be again will have their campaigns completely upended by the House’s impeachment fever. Remember a few weeks ago when Harris told colleagues, “I’m f***ing moving to Iowa,” in hopes of reviving her campaign? Uh, no she’s not. Not until January. Thanks to Nancy Pelosi.\n\nIt’s not as if senators can rely on showy moments during the trial like dressing down a witness during a committee hearing. Because senators are the jurors of an impeachment trial, they must live through every politician’s nightmare of sitting and watching the proceedings without speaking… Because the senators would be so tied up, [former Marco Rubio campaign manager Terry Sullivan] recommends they announce up front that they will suspend campaign activities during the trial, similar to how John McCain suspended his campaign during the 2008 presidential race over the financial crisis. Then, said Sullivan, they should try to make the most out of nightly TV appearances and national media attention. Or in other words, “Take the crap sandwich you’ve been served as a campaign and try to make it into filet mignon.”… One political aide working for a senator in the race described it as a mixed bag. Senators cannot grandstand during the trial, but they are able to hold press conferences afterward or talk about it on TV. Ultimately, they will still be a part of what should regularly be the biggest story of the day.\n\nIt’s not just a question of the candidates who are affected by the trial, it’s a question of the candidates who aren’t. As chance would have it, both of the top “moderates” in the race, Joe Biden and newly minted centrist Pete Buttigieg, aren’t members of the Senate and will be completely free to press their advantage in Iowa, New Hampshire, and South Carolina. They’re also free of course to comment on the day’s impeachment trial testimony as it happens, before proceedings have concluded and senators are able to weigh in. Kamala Harris is trying to reposition herself belatedly as a somewhat liberal centrist alternative to the progressives in the field; how’s she going to get a leg up on, say, Buttigieg in doing that when he’ll be on the trail making his case 12 hours a day and she’ll be sitting in stony silence in the Senate?\n\nBut wait, it gets worse. What if everyone’s wrong about the timetable on impeachment? As I say, the CW has it that the process will be done by the start of 2020, but Erick Erickson believes that’s too optimistic. There’s no special counsel report on Ukraine available to House Dems which they could use to expedite their fact-finding, he notes. Democrats need to do the legwork here themselves. How long might that take?\n\nBased on all my conversations, my best guess is that the Democrats are going to drag out their fact-finding mission until Thanksgiving, then spend the period of Thanksgiving to Christmas building articles of impeachment. They would then refer the matter to the Senate at the end of the year and the Senate would take it up after the first of the year.\n\nImagine Warren, Sanders, and Harris being waylaid in Washington by Trump’s trial in the final weeks before Iowa. The current timetable is bad enough, taking them off the trail for part of November and virtually all of December (all in the name of pretending to carefully consider the evidence before casting the most predictable vote of their lives). But at least in that case they’re back on the stump for the last month before the caucuses, putting in face time with voters and regaling them with impeachment war stories. If Erickson’s right, though, they might lose that entire final month instead of December. Picture poor Bernie Sanders trying to manage his health while also doing occasional late-night weeknight flights to Iowa before turning immediately around after a rally and getting back to D.C. before noon.\n\nNow, a question: Is this a feature of impeachment for Pelosi instead of a bug? My guess is that Nancy strongly prefers Biden as the nominee, not just because he knows him well but because she’s a bottom-line politician. Who’s most likely to beat Trump in the general election? Virtually every poll says it’s Biden. Biden is also enough of a known quantity ideologically that it’d be harder for Republicans to tar him, and by extension downballot Democrats, as wild-eyed radicals than it would be if Warren or Sanders topped the ticket. All of that sounds good to Pelosi. And so you begin to wonder — if she can give Biden a little edge by delaying impeachment for a few weeks, forcing Warren and Sanders to stay put in Washington into next year, why not do it? A few weeks means nothing to Democrats in the House. It could mean a lot in creating an advantage for an “electable” centrist Democrat in the race.\n\nAnother question, though: How much will in-person retail campaigning really matter? Yeah, granted, voters in Iowa and New Hampshire expect face time with the candidates but they’ll understand that these are extraordinary circumstances. How much would the Warren campaign suffer if, say, they organized a bunch of “virtual rallies” in the evening during the impeachment trial in which the candidate agreed to appear via closed-circuit TV at select locations in the early states? She could take questions remotely from people in the audience just to make clear to them that she’s interacting with them personally, not airing a recorded spiel. Imagine, say, three or four one-hour virtual rallies a night, beginning at 8 p.m. Then, on Sunday, she could fly out to an early state and barnstorm for 12 hours before returning to D.C. It’ll be grueling but campaigning is grueling already. And at least virtual rallies would prevent them the candidates from having to fly out on weeknights for rallies before turning around in the wee hours.\n\nThe only wrinkle with virtual rallies is that some desperate competitor, maybe Harris, is destined to try to show off their comparative energy to primary voters by flying out in the evening and appearing in person. If Warren’s doing simulcasts five nights a week while Harris is actually landing in Iowa three nights a week, say, how much does Harris benefit from that? If her polls start to climb, will Warren be forced to start flying out on weeknights too? There’s a strong prisoner’s dilemma here.\n\nI’m tempted to say that Buttigieg is the chief beneficiary of all this just because no one expects low-energy Grandpa Joe to become a dynamo on the trail with the competition suddenly off the field. But will the spotlight on impeachment actually leave him in the shadows? Voters will be hanging on what the actual jurors in Trump’s trial have to say after the day’s proceedings are over. Between that and Mayor Pete’s 8,000th rote speech about health care, what’s more likely to attract interest from Iowans and New Hampshirites?", "description": "Uh oh.", "authors": ["John Sexton", "Ed Morrissey", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/10/e-3.jpg", "published_at": "2019-10-18"}