{"pub": "yahoo", "url": "https://news.yahoo.com/trumps-stonewalling-could-speed-up-impeachment-203653682.html", "downloaded_at": "2019-10-12 00:37:22.850254+00:00", "title": "Trump's stonewalling could speed up impeachment", "language": "en", "text": "President Trump’s lack of cooperation with the Democrats’ impeachment inquiry is likely to speed up the process, rather than slow it down, Democratic aides told Yahoo News.\n\nDemocrats already believe they have enough evidence to impeach Trump, in the form of a whistleblower complaint and a partial transcript of a July 25 phone call between Trump and Ukrainian President Volodymyr Zelensky in which Trump asked the Ukrainian government to investigate former Vice President Joe Biden, a Democratic rival for the presidency, and his son Hunter.\n\n“This isn’t complicated,” said one House Democratic leadership aide.\n\nWhile Democrats have not ruled out a legal strategy seeking to compel the White House to release documents or allow government employees to speak to congressional investigators, they do not see that as a likely path in the near term, multiple Democratic congressional aides have told Yahoo News.\n\nThe impeachment inquiry in the House, then, is an exercise to gather as much additional information as possible before sending articles of impeachment out of the Judiciary Committee to the full House for a vote, likely in December, the aides have said.\n\nFor example, Gordon Sondland, the U.S. ambassador to the European Union, agreed Friday to testify next week before the three House committees conducting the depositions for the impeachment inquiry: Intelligence, Foreign Affairs and Oversight. He had originally been blocked by the State Department from doing so.\n\nBut Sondland indicated in his letter to the committees that he could not hand over relevant documents and copies of text messages that had been requested by committee staff. “Ambassador Sondland does not control the disposition of his documents,” Sondland’s attorney said in a statement.\n\nThat is the kind of information that could be pursued through the courts, but Democratic staff already have copies of text messages provided to them by Kurt Volker, former U.S. ambassador to NATO, that show Sondland offering another diplomat reassurances that Trump had not offered any quid pro quo to the Ukrainians in exchange for investigating Biden.\n\nNBC News has reported that before Sondland sent those texts denying a quid pro quo, he spoke by phone to Trump directly.\n\nPresident Trump speaks to reporters as he departs for travel to Minnesota from the South Lawn of the White House on Thursday. (Photo: Jonathan Ernst/Reuters) More\n\nTrump’s White House counsel, Pat Cipollone, sent a blistering letter to Democrats Tuesday refusing to cooperate with their impeachment inquiry, saying that the process “violates fundamental fairness and constitutionally mandated due process.”\n\nSpeculation in the press immediately moved to whether the Democrats might seek redress through the courts in a process that could end up at the Supreme Court.\n\nBut none of the committee chairmen have made any comments about litigation, an aide pointed out. And multiple interviews with knowledgeable Democratic aides revealed that there’s not much appetite for slowing down the process this way.\n\nDemocrats don’t feel desperate for more information, so a lack of cooperation almost certainly won’t prevent Democrats from holding a vote in the full House sometime in December, as one knowledgeable source said is most likely.\n\nTrump’s stonewalling might give the White House some days when Democrats are not able to fill the news cycle with new developments, creating a vacuum that Republicans can fill with their own spin. But so far, there has been no shortage of news.\n\nFor example, on Thursday, Democrats issued a subpoena to Energy Secretary Rick Perry, the same day that two men associated with Trump lawyer Rudy Giuliani — and suspected of helping Giuliani and Trump in a scheme to pressure the Ukrainians — were arrested at Dulles International Airport in Virginia as they prepared to board a one-way flight to Germany.", "description": "Democrats believe they have enough evidence to impeach Trump, in the form of a whistleblower complaint and a partial transcript of a phone call between Trump and Ukrainian President Volodymyr Zelensky in which Trump asked Ukraine to investigate former Vice President Joe Biden and his son.", "authors": ["Jon Ward", "Senior Political Correspondent"], "top_image": "https://s.yimg.com/uu/api/res/1.2/zIp_FEFOFjcGl0qa6_a5UQ--~B/aD0yOTEyO3c9NDM2ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/982f1390-ec58-11e9-bc5b-fd2e75e05533", "published_at": "2019-10-11"}