{"pub": "metro", "url": "https://metro.co.uk/2019/10/05/four-homeless-men-dead-in-new-york-killing-spree-10867010", "downloaded_at": "2019-10-05 22:56:24.470757+00:00", "title": "Four homeless men dead in New York killing spree", "language": "en", "text": "Police were called to Manhattan after four homeless men were found dead (Picture: Twitter/ CBS12)\n\nPolice in New York are investigating after four homeless men were found dead in Manhattan early this morning.\n\nThe New York Police Department said the men were killed in their sleep by an attacker who hit them with a metal object, according to the New York Times.\n\nLieutenant Thomas Antonetti said a fifth victim was taken to hospital with critical injuries.\n\nHe also confirmed that officers had arrested a 24-year-old man, who is being held in custody, and recovered a three foot long metal object, described as similar to a construction stud.\n\nPolice received a 911 call just before 2am about the assaults, which took place in Chinatown.\n\nPolice said a man was discovered with ‘severe trauma to the head’ on The Bowery and a second man, who was taken to hospital, was found shortly afterwards.\n\nWATCH: Multiple homeless men killed overnight in New York. Police have a person in custody. https://t.co/Vf9y33XtTb — WPEC CBS12 News (@CBS12) October 5, 2019\n\nAdvertisement\n\nAdvertisement\n\nThree other victims, who all died, were found on Broadway and East Broadway.\n\nLt Antonetti said the police were working to identify those who had died.\n\nThree other men were found on Broadway and East Broadway with fatal injuries, the spokeswoman said.\n\nIn January 2019, an estimated 3,588 people were living on the streets in the city.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "The men were killed in the early hours of Saturday morning", "authors": ["Tim Green"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_88485514_1570283576.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-05"}