{"pub": "indiatimes", "url": "https://indiatimes.com/technology/news/if-caught-cheating-on-pubg-mobile-you-ll-be-banned-for-10-years-from-the-game-377298.html", "downloaded_at": "2019-10-07 20:00:27.589693+00:00", "title": "If Caught Cheating On PUBG Mobile, You'll Be Banned For 10 Years From The Game", "language": "en", "text": "If Caught Cheating On PUBG Mobile, You'll Be Banned For 10 Years From The Game\n\nIf Caught Cheating On PUBG Mobile, You'll Be Banned For 10 Years From The Game\n\nWhen you're playing a competitive online game, you can expect to find cheaters trying to use hacks or glitches to give themselves an edge.\n\nPUBG sees this a lot too, as does the mobile version of the game. And now they're starting to crack down hard.\n\nSo beware cheaters. If you're caught running illegal cheating software, emulators, or something similar, you could find your account banned from the game for 10 years. PUBG Mobile recently posted an announcement saying, \"We have always strived to deliver a gaming environment that is fair and enjoyable for each and every player and prevent cheating.\"\n\n\"We take this issue very seriously; as such, each account in violation has received a 10-year ban. We would like to remind all players about the importance of fair play, and thank you for keeping PUBG MOBILE fair and fun,\" they added.\n\nDon't Miss 145 SHARES\n\nAnd you'd best be warned, PUBG Mobile has already brought the ban hammer on a number of cheaters, 3,500 to be exact. And that's just in September.\n\nSo if you come across cheaters in-game, don't be disheartened by the stolen win. Instead make a note of their player tag and report them in the game. When someone gets banned, PUBG Mobile is actually keeping a list updated here.\n\nBut that doesn't mean you report someone just because you lose, that's just bad sportsmanship. It's possible they're just better at the game than you are. You can improve yourself as well, maybe you just need to keep a few important tips in mind.\n\nAnd if PUBG isn't your thing, the other hot new game on the block is Call of Duty Mobile. This particular title is also free, and has also been developed by Tencent Games. Since it launched last week, it's taken Android by storm, reaching the top downloads list.\n\nSo dive right in, but leave the dirty tricks at home guys.", "description": "When you’re playing a competitive online game, you can expect to find cheaters trying to use hacks or glitches to give themselves an edge. PUBG sees this a lot too, as does the mobile version of the game. And now they’re starting to crack down on them hard.", "authors": ["Gwyn D'Mello"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/cheaters_smartphone_game_pubg_mobile_call_of_duty_mobile_mobile_gaming_app_hacks_emulator_1570452329_800x420.jpg", "published_at": "2019-10-07"}