{"pub": "cnbc", "url": "https://cnbc.com/2019/09/07/we-cant-really-buy-into-the-bond-yield-bounce-wells-fargo.html", "downloaded_at": "2019-09-07 13:37:15.960554+00:00", "title": "'We can't really buy into' the bond yield bounce, says Wells Fargo rate strategist", "language": "en", "text": "Don't get too bullish on the bond yield bounce.\n\nSo says Wells Fargo Global Head of Rate Strategy Michael Schumacher, who warned investors on Thursday not to look at the recent rally in U.S. Treasury yields through rose-colored glasses.\n\n\"We can't really buy into it,\" he said on CNBC's \"Futures Now\" amid a broad-based rally in both stocks and bond yields that followed an agreement between U.S. and Chinese trade officials to restart negotiations in October.\n\n\"We think about all the catalysts out there: trade, Brexit, Hong Kong,\" Schumacher said, adding that while U.S.-China trade headlines turned notably positive on Thursday, they didn't convince him that we were any closer to an immediate resolution.\n\n\"Is it in Donald Trump's interests right now to try and strike a deal? Probably not, most likely not until early next year. What about the Chinese government? We're not so confident there's a deal coming there, either,\" he said. \"The way we look at it is, yeah, there's a brief period of good news right now, but you've got so many choppy factors out there.\"\n\nThose worrisome factors have led to extremely depressed bond yields, particularly on the U.S. 10-year Treasury note. Bond yields move inversely to bond prices, which means as yields have plummeted, bond prices have skyrocketed.\n\n\"If you think about [bonds] fundamentally right now, we'd say they are overvalued today,\" Schumacher said.\n\nBut with $17 trillion of sovereign debt and $1 trillion of corporate debt now trading at negative yields, it's getting tougher for investors to know where to turn, the strategist acknowledged.\n\n\"What kind of saver, what sort of investor, wants to get a negative real yield?\" he said. \" Now, the comeback to that is, 'OK, we get it, but it's not really a fundamental market right now.' ... Trade is dominating. Brexit's important. Hong Kong is out there. Until these factors calm down a fair bit, the fundamentals simply don't matter that much.\"\n\nAs such, Schumacher predicted the 10-year would \"bounce around\" for the rest of 2019, in line with the market's recent volatility.\n\nAnd, for investors, very short-maturity Treasurys — of 1-year duration or less — is the best place to wait out the roller-coaster ride, he said in a Thursday phone call with CNBC.\n\nBonds continued their climb late Thursday.\n\nDisclaimer", "description": "Don't trust the rebound rally in bond yields, warns Michael Schumacher, global head of rate strategy at Wells Fargo Securities.", "authors": ["Lizzy Gurdus"], "top_image": "https://image.cnbcfm.com/api/v1/image/104010654-GettyImages-485109228.jpg?v=1567715024", "published_at": "2019-09-07"}