{"pub": "dailymail", "url": "https://dailymail.co.uk/money/mortgageshome/article-7430811/First-time-buyers-skipping-flats-buying-three-bedroom-houses-instead.html", "downloaded_at": "2019-10-22 13:46:52.450476+00:00", "title": "First-time buyers are skipping flats and buying three bedroom houses instead", "language": "en", "text": "First-time buyers are leapfrogging smaller homes and moving straight into three-bedroom houses, research has revealed.\n\nAnalysis from Zoopla found that two-thirds of those looking to buy their first homes are seeking houses rather than flats, rising to 80 per cent outside of London, with the average first-time buyer looking for a three-bedroom house.\n\nAs a result, the gap between the price paid for a property by the average first-time buyer and that paid by everybody else is shrinking.\n\nIn 2018, first-time buyers bought property at an average price 8 to 15 per cent lower than the regional average, compared to 20 to 25 per cent pre-2007.\n\nFirst-time buyers are opting for three bedroom houses rather than traditional smaller homes\n\nTo get around this, these buyers are now taking out longer mortgages, allowing them to pass affordability tests for bigger loans - with the average term now lasting 30 years compared to 25 years just over a decade ago.\n\nZoopla's Richard Donnell said: 'First-time buyers are not compromising on size and price of home.\n\n'Our analysis suggests that they are taking the long-term view and buying a home with a longer-term horizon than they may have done in the past.\n\n'Three-bedroom homes remain the primary housing type in demand and this drops to two-bedroom homes in London where housing costs and affordability pressures are greatest.'\n\nResearch undertaken by Zoopla in June found that an average first-time buyer - or couple buying - needs a household income of £54,400 to secure a mortgage on their first property.\n\nThe analysis also found that buying a first home is rapidly getting more expensive, as rising house prices increase deposits required to be put down and salaries needed for a mortgage.\n\nPotential first-time buyers typically need to earn at least nine per cent more to secure their first property than they did just three years ago.\n\nThis comes to a household income of £54,400 to buy a first home, some £4,500 more than in 2016, with the national average deposit required currently standing at £38,418.\n\nThe ability to buy a house and thus demand to do so depends heavily on an area's house prices\n\nFirst-time buyers need to have a larger income to buy in all regions compared to 2014\n\nThis varies dramatically by region however, with the average first-time buyer deposit currently ranging from £26,000 in the North to £140,000 in London.\n\nDespite this the number of first-time buyers has been rising faster than any other buyer group, the research found, with first-time buyers accounting for 36 per cent of all housing sales in 2018.\n\nRichard Donnell added: 'First-time buyers have been the driving force behind the housing sales market in recent years. Lower mortgage rates, and improving mortgage availability have supported the growth in numbers across the country.'", "description": "Analysis from Zoopla found that two thirds of those looking to buy their first homes are seeking houses rather than flats, rising to 80 per cent outside of London.", "authors": ["Will Kirkman For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/09/05/14/18107594-0-image-a-7_1567690058568.jpg", "published_at": "2019-09-06"}