{"pub": "atlantic", "url": "https://theatlantic.com/national/archive/2014/06/the-seven-signs-youre-in-a-cult/361400", "downloaded_at": "2019-10-30 23:16:33.637008+00:00", "title": "The Seven Signs You're in a Cult", "language": "en", "text": "Several years ago, the founder of IHOP, Mike Bickle, created a list of seven ways to recognize the difference between a religious community and a cult. Written down, the signs seem clear:\n\n1. Opposing critical thinking 2. Isolating members and penalizing them for leaving 3. Emphasizing special doctrines outside scripture 4. Seeking inappropriate loyalty to their leaders 5. Dishonoring the family unit 6. Crossing Biblical boundaries of behavior (versus sexual purity and personal ownership) 7. Separation from the Church\n\nBut when it’s your friends, your faith, your community, it’s not so obvious. For several years, roughly two dozen people, all younger than thirty, had been living together in Kansas City, Missouri, and following the leadership of Tyler Deaton, one of our classmates from Southwestern University in Texas. In the summer of 2012, Tyler had married Bethany; by the fall, she was dead. What started as a dorm-room prayer group had devolved into something much darker.\n\n* * *\n\nI met Bethany and Tyler during the week of their freshman orientation in 2005. Small, with a heart-shaped face and bright blue eyes, Bethany’s effortless wit and warm presence quickly attracted a devoted group of friends. She often spoke about the “glories of the world” and its wonders over brunch in the dining hall. We bonded over our shared love of stories and would often stay up late discussing our dreams of becoming great novelists and joining the ranks of our literary heroes.\n\nOne day during that first week, I found Tyler in the school’s chapel. He was seated at the piano, the late-afternoon sunlight illuminating his dark eyes and hair as he swayed back and forth, stomping the pedals and singing a popular evangelical chorus in a voice full of heartache and passion:\n\nYour love is extravagant Your friendship, it is intimate I feel like I’m moving to the rhythm of your grace Your fragrance is intoxicating In the secret place Because your love is extravagant\n\nAt the end of the song, he came over and introduced himself. Something about the nasally pitch of his voice made me wonder if he was gay. A few months later I would work up the courage to ask him; the question offended him so much that I didn’t bring it up again until the end of that year, when he conceded that he had been “struggling with same-sex attraction” for years.\n\nThat semester, we became close friends. Early on, I felt as though Tyler often tried to manipulate people into doing what he wanted, but he was also a committed Christian, zealous and humble. Inspired by his sensitivity toward others and bravery in confronting his personal demons, I learned to ignore my initial reservations and trust him.\n\nTwo years later, in the summer of 2007, Tyler returned from a trip to Pakistan and announced that God was going to launch a spiritual revolution on our campus. Those of us who knew him well were surprised by the changes in his personality. He had always been extraordinarily perceptive, but now this ability had reached uncanny levels. He could describe conversations he wasn’t involved in that were taking place on the other side of campus. He said God was always speaking. He claimed he could tell what we were thinking, when we were sinning; he said he could feel in his own body what God felt about us.", "description": "A former member of a tight-knit college prayer group describes his community's disintegration—and how one of its members ended up dead.", "authors": ["Boze Herrington"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2014/04/bethanylede2.jpg.jpg/lead_large.jpg", "published_at": "2014-06-18"}