{"pub": "news24", "url": "https://health24.com/Medical/Dementia/News/are-pro-soccer-players-more-likely-to-develop-dementia-20191025-2", "downloaded_at": "2019-10-27 00:18:01.870408+00:00", "title": "Are pro soccer players more likely to develop dementia?", "language": "en", "text": "Are pro soccer players more likely to develop dementia? According to a Scottish study, former soccer players are over three times more likely to die of neurodegenerative diseases than the general population.\n\nFormer professional soccer players have a significantly increased risk of death from brain diseases such as Alzheimer's and Parkinson's, a new study finds.\n\nFormer soccer players were about 3.5 times more likely to die of neurodegenerative diseases than people in the general population, according to a study in Scotland.\n\nRepeated head blows\n\n\"This analysis revealed that risk ranged from a fivefold increase in Alzheimer's disease, through an approximately fourfold increase in motor neuron disease, to a twofold in Parkinson's disease in former professional [soccer players] compared to population controls,\" said study leader Dr Willie Stewart.\n\nStewart is a consultant neuropathologist and honorary clinical associate professor at the University of Glasgow.\n\nPrior studies of contact sports athletes, particularly National Football League (NFL) players in the United States, have tied repeated head blows to another degenerative brain disorder called chronic traumatic encephalopathy (CTE).\n\nDeceased Hall of Famers Frank Gifford and Junior Seau were among the NFL players who developed CTE.\n\nIn one study at Boston University, risk of CTE was linked to length of time playing tackle football.\n\nLess likely to die of other common diseases\n\n\"While we don't yet know absolute risk of developing CTE among football players, this study found that the risk of developing CTE increased by 30% per year played,\" said Dr Ann McKee, director of Boston University's CTE Center.\n\nAccording to the centre, CTE symptoms – including mood and memory problems – generally begin appearing years after the onset of head impacts.\n\nIn the current study, Stewart's team analysed the causes of death among nearly 7 700 former Scottish male professional soccer players and more than 23 000 people in the general population born between 1900 and 1976.\n\nWhile former soccer players were more likely to die from neurodegenerative disease, they were less likely to die of other common diseases, such as heart disease and some cancers, including lung cancer.\n\nDeaths among former soccer players were lower than expected up to age 70, and higher than expected over that age, according to the study. The results were published in the New England Journal of Medicine.\n\nMany questions still unanswered\n\n\"Our data show that while former [soccer players] had higher dementia rates, they had lower rates of death due to other major diseases. As such, whilst every effort must be made to identify the factors contributing to the increased risk of neurodegenerative disease to allow this risk to be reduced, there are also wider potential health benefits of playing [soccer] to be considered,\" Stewart said in a university news release.\n\nThe study was funded by the Football Association and the Professional Footballers' Association. (In Europe, soccer is called football.)\n\n\"The whole game must recognise that this is only the start of our understanding and there are many questions that still need to be answered,\" said Greg Clarke, Football Association chairman. \"It is important that the global [soccer] family now unites to find the answers.\"\n\nImage credit: iStock\n\n", "description": "According to a Scottish study, former soccer players are over three times more likely to die of neurodegenerative diseases than the general population.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9514/2d3f0d6087de4941b3a7aff0b3fb1076.jpg", "published_at": "2019-10-25"}