{"pub": "fox", "url": "https://foxnews.com/sports/patrick-mahomes-injury-chiefs-nfl-travis-kelce", "downloaded_at": "2019-10-18 11:18:20.760904+00:00", "title": "Patrick Mahomes injury draws unsettling reactions from Chiefs teammates: 'It looked deformed'", "language": "en", "text": "Kansas City Chiefs tight end Travis Kelce was among those who appeared to be left unsettled after his teammate and reigning NFL MVP Patrick Mahomes reportedly dislocated his kneecap during Thursday night’s game against the Denver Broncos.\n\nMahomes suffered the injury in the second quarter of the Chiefs’ 30-6 blowout of the Broncos. Video appeared to show the team’s medical staff popping his dislocated kneecap back into place.\n\nPATRICK MAHOMES APPEARS TO HAVE KNEECAP POPPED BACK IN PLACE AFTER INJURY IN CHIEFS-BRONCOS GAME\n\nKelce was asked about the injury after the game.\n\n“His knee didn't even look like a knee. It was all out of whack,” he said, according to ESPN.\n\nChiefs offensive lineman Laurent Duvernay-Tardif relayed to reporters what Mahomes was saying when he went down.\n\nPATRICK MAHOMES' ANKLE INJURY LEADS CHIEFS FANS TO TURN TO HIGHER POWER IN HOPES HE HEALS QUICKER\n\n“He was saying, ‘It’s out, it’s out,’” Duvernay-Tardif said. “Nobody really understood what he meant at that time and then we saw it. That's when we started panicking.\"\n\nAdam Reiter, the team's center, had Mahomes on top of him during the play.\n\n\"I think I was just yelling, 'Get off me,' but I didn't realize it was him,\" Reiter said. \"And everybody's telling me, I'm hearing from the refs, 'Just stay still, stay still.' And I'm just laying on my stomach face down. I just had to listen to the refs and not move. As soon as I realized it was his voice, I was like, all right, I'm not moving an inch.\"\n\nAccording to the Kansas City Star, Tyreek Hill screamed into the air and took off his helmet in frustration while Demarcus Robinson had to get away from the scene as quickly as possible.\n\n\"It looked deformed,\" Robinson said, according to the Star.\n\nMahomes is expected to miss at least three weeks with a dislocated kneecap, the NFL Network reported Friday. There is reportedly “real optimism” he will be able to play after those three weeks. He is set to undergo an MRI at some point on Friday.\n\nIt’s unclear what the Chiefs will do at quarterback at this point. Veteran Matt Moore is the team’s backup.\n\nMahomes let fans know he remained optimistic after the injury.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\n“Awesome team win! Love my brothers! Thank you for all the prayers! Everything looking good so far!” he tweeted.", "description": "Kansas City Chiefs tight end Travis Kelce was among those who appeared to be left unsettled after his teammate and reigning NFL MVP Patrick Mahomes reportedly dislocated his kneecap during Thursday night’s game against the Denver Broncos.", "authors": ["Ryan Gaydos", "Ryan Gaydos Is A Sports Reporter For Foxnews.Com", "Foxbusiness.Com. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/NFL-Patrick-Mahomes11.jpg", "published_at": "2019-10-18"}