{"pub": "wsj", "url": "https://wsj.com/articles/bud-light-brewer-plans-slimmed-down-ipo-in-hong-kong-11568269011?mod=rsswn", "downloaded_at": "2019-09-12 11:34:54.220119+00:00", "title": "Bud Light: Brewer Plans Slimmed-Down IPO in Hong Kong", "language": "en", "text": "The parent of Budweiser is betting investors will go for a lighter brew.\n\nTwo months after calling off a blockbuster initial public offering in Hong Kong, European beer giant Anheuser-Busch InBev SA started shopping a slimmed-down version of its Asia business to investors in the city and is hoping to pull off a deal in the coming weeks.\n\nThe business, Budweiser Brewing Co. APAC Ltd. is aiming to raise $5 billion in an IPO that could be completed by the end of September, according to people familiar with the matter.\n\nThe share sale is likely to be formally launched next week, some of the people said. Budweiser Brewing plans to line up several large institutions that will commit to buying chunks of stock as cornerstone investors in the IPO, one of the people added.\n\nAs global beer sales have stalled, major brewers such as AB InBev and Carlsberg are flocking to China. WSJ’s Steven Russolillo in Hong Kong tests their strategies, sipping the beers specially crafted to win over Chinese drinkers. Photo composite: Sharon Shi. Video: Clément Bürge\n\nThe offering comes as Hong Kong’s market is recovering from a summer of protests in the city that have caused business disruptions and dragged down prices of retail and property stocks. Still, bankers say they are optimistic about a pickup in deal activity and many investors have cash to put to work, which should help demand for new stock sales.\n\nBudweiser Brewing, which sells beers such as Budweiser, Stella Artois, Corona and Hoegaarden in Asia, on Thursday filed a draft prospectus with Hong Kong’s stock exchange. JPMorgan Chase & Co. and Morgan Stanley are advising the company on the IPO.\n\nIn mid-July, AB InBev canceled a nearly $10 billion listing of its Asian business, blaming market conditions at the time. A deal of that size would have been the year’s biggest IPO. At the time, several prospective investors said they were deterred by high valuations that the company was seeking.\n\nShortly after calling off the deal, AB InBev carved out its Australian unit—which had been part of the company it earlier tried to list—and sold it to Japan’s Asahi Group Holdings Ltd. for $11.3 billion. It said it would use the proceeds to help reduce debt.\n\nThe company now planning to list in Hong Kong derives most of its sales from China, South Korea, India and Vietnam—countries where beer consumption is growing more rapidly.\n\nBudweiser Brewing said its revenue grew 10.5% in 2018 to $6.74 billion, while net profit last year rose about two-thirds to $959 million.\n\nThe company could fetch a market valuation of between $44 billion and $54 billion, Bernstein Research estimated in a research note Thursday.\n\n“It’s not immediately clear why (AB InBev) is in such a rush to complete the IPO following the Australia deal,” the analysts wrote, adding that the company could be trying to take advantage of high beer valuations in China or may have an acquisition deal planned for the Asia business.\n\nThe Hong Kong-listed stocks of Chinese brewers have performed better than the broader market this year. China Resources Beer Holdings Co., the country’s largest brewer, and Tsingtao Brewery Co. have each climbed more than 50%, versus the Hang Seng Index’s 4.8% gain. China Resources Beer currently trades at about 54 times forecast 2019 earnings, while Tsingtao trades at 34.9 times, according to Refinitiv data\n\n“Many beer stocks are richly valued,” said Gary Zhang, a partner at Shenzhen Grand Gold Capital Co., an asset manager that holds some stocks in Hong Kong. He said China’s beer market is fairly saturated, and more consumers are instead going for other types of alcohol like wine and baijiu, a spirit distilled from sorghum.\n\nAB InBev, which makes one out of every four beers sold world-wide, owns hundreds of brands in dozens of countries after a global buying spree that gave it Budweiser, Stella Artois and Corona. But those deals saddled the Belgian brewer with about $100 billion in debt; meanwhile, beer sales have slowed in the U.S. and other major markets.\n\nWrite to P.R. Venkat at venkat.pr@wsj.com and Joanne Chiu at joanne.chiu@wsj.com", "description": "Two months after calling off a blockbuster listing in Hong Kong, European beer giant Anheuser-Busch InBev started shopping a slimmed-down version of its Asia business and is hoping to pull off a deal in the coming weeks.", "authors": ["P.R. Venkat", "Joanne Chiu", "Joanne.Chiu Wsj.Com"], "top_image": "https://images.wsj.net/im-106477/social", "published_at": "2019-09-12"}