{"pub": "businessinsider", "url": "https://businessinsider.co.za/gupta-private-jet-r440-million-2015-model-bombardier-global-6000-2019-9", "downloaded_at": "2019-09-13 18:37:57.042211+00:00", "title": "The Gupta family's private jet is on sale for R440 million", "language": "en", "text": "The Gupta family's private is on sale for roughly R440 million.\n\nThis after it was seized by Canada's export credit agency after the family defaulted on its debt.\n\nThe plane, which previously flew president Cyril Ramaphosa to Japan, features onboard wifi and space for 14 people.\n\nFor more stories, go to Business Insider SA.\n\nA private jet previously owned by the infamous Gupta-family is on sale, and could reportedly be sold for as much as R440 million.\n\nAn advertisement for the 2015-model Bombardier Global 6000 was placed in Business Day’s lifestyle section on Tuesday.\n\nThe advert by Jetcraft aircraft sales did not explicitly mention that the plane was owned by the Gupta-family.\n\nHowever, Geoffrey York, Africa correspondent for The Globe and Mail in Canada, spotted that the plane’s registration number is ZS-OAK, which was formerly owned by the family.\n\nWanna buy the former Gupta jet? Make an offer! After ZS-OAK was seized from the Guptas by Canadian bankers for loan defaults, brokers have been trying to sell it for the past 10 months. Latest ad is in Business Day. Only 328 landings so far! pic.twitter.com/qVVxzmfj62 — Geoffrey York (@geoffreyyork) September 11, 2019\n\nOakbay was the name of the Gupta family’s business in South Africa.\n\nJetcraft confirmed to Netwerk24 that the aeroplane was previously owned by the Gupta family.\n\nTimesLive reported that an agent trying to sell the plane is hoping to sell the plane for $30 million, or R440 million.\n\nThe plane, which once flew president Cyril Ramapshosa to Japan when he was deputy president, features onboard wifi with space for 14 passengers.\n\n\n\nAccording to the advertisement, it has only landed 328 times and has flown 1,256 hours.\n\nThe Gupta-family bought the plane with help from Canada's export credit agency, Export Development Canada (EDC), which reportedly paid up to 80% of the price, TimesLive reported.\n\nIn 2018, the EDC attained a court order to ground the plane after the Gupta family defaulted on its $41 million, roughly R579 million, loan.\n\nThe SABC reported that the plane was frequently used by South African ministers to Dubia while it was on charter.\n\nThe Gupta family, with close ties to former president Jacob Zuma, has been implicated in widespread corruption, and was allegedly involved making Zuma’s ministerial appointments.\n\nCompiled by James de Villiers.", "description": "The plane, which previously flew president Cyril Ramaphosa to Japan, features onboard wifi and space for 14 people.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/3951/5d0216f8373342ccb64a33faa5474463.jpg", "published_at": "2019-09-13"}