{"pub": "cnn", "url": "https://bleacherreport.com/articles/2853063-nba-wont-allow-ninja-style-headwear-to-be-worn-by-players-during-games?utm_source=cnn.com&utm_campaign=editorial&utm_medium=referral", "downloaded_at": "2019-09-09 23:20:50.514155+00:00", "title": "NBA Won't Allow 'Ninja-Style Headwear' to Be Worn by Players During Games", "language": "en", "text": "Michael Perez/Associated Press\n\nThe NBA will no longer allow players to wear the \"ninja-style\" headbands that some players wore last season, according to Adrian Wojnarowski of ESPN:\n\nThere was a prevailing theory as to why the NBA might be taking such a stance on an otherwise innocuous piece of gear:\n\nSuffice to say, this ban on the \"ninja-style headwear\" was met with bemusement around the NBA world.\n\n\"I love that someone at the nba had to type the words 'ninja-style headwear' and 'consistency of size and length' as their job today,\" Detroit Pistons star Blake Griffin tweeted.\n\nHe wasn't alone:\n\nAs controversies go around the NBA, this one is pretty mild. But enough players wore their headbands in the aforementioned \"ninja style\" that there could be some pushback from the players regarding this ruling. It seems like a pretty big stretch to consider them as a safety hazard of any kind, as the NBA has posited.\n\nIt seems like less of a stretch that Nike and the NBA might want to ensure that NBA players are wearing headbands with official branding and logos on them, or not turning headbands with that branding inside out.\n\nSo this is probably a story that will evolve as the NBA season nears. In other words, we may not have heard the last of the \"ninja-style headwear.\"", "description": "The  NBA  will no longer allow players to wear the  \"ninja-style\" headbands that some players wore last season, according to Adrian Wojnarowski of ESPN:       There was a prevailing ...", "authors": ["Timothy Rapp"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/827/288/hi-res-7e2cf52411174ea1a8903cbbbbd3b715_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-09-09"}