{"pub": "cbs", "url": "https://cbsnews.com/news/incoming-european-central-bank-head-christine-lagarde-on-president-trump-twitter-habits-60-minutes-2019-10-18", "downloaded_at": "2019-10-19 10:59:36.846331+00:00", "title": "Incoming European Central Bank head Christine Lagarde criticizes President Trump's Twitter habits", "language": "en", "text": "In an interview with 60 Minutes correspondent John Dickerson before she assumes the helm of the European Central Bank, Christine Lagarde criticizes President Donald Trump's Twitter habits and his trade war with China. Lagarde also hints she has room to lower already negative interest rates in Europe if economic conditions call for another cut. Dickerson's interview with Lagarde will be broadcast on 60 Minutes, Sunday, October 20 at 7 p.m. ET/PT on CBS.\n\n\n\nLagarde believes central bankers need to be independent to do their jobs well. What would she tell President Trump, who has tweeted his opinions, even mocked U.S. Federal Reserve policy on the social platform? \"Market stability should not be the subject of a tweet here or a tweet there. It requires consideration, thinking, quiet and measured and rational decisions,\" she tells Dickerson\n\n\n\nPresident Trump's trade war with China will give the entire world's economy \"a big haircut,\" Lagarde says. She implores the world's leaders to work together to find consensus, \"My very, very strong message to all policymakers is please sit down like big men, many men in those rooms and put everything on the table, and try to deal bit by bit, piece by piece, so that we have certainty.\"\n\n\n\nBritain's threatened exit from the European Union is a \"source of great sadness,\" Lagarde says. \"It will affect both the UK and certain countries in the European Union, Ireland in particular, Germany, the Netherlands. And everybody will be a little less well-off as a result.\"\n\n\n\nEuropeans are already worrying about a potential recession due to a slumping manufacturing sector. When she takes over the ECB, Lagarde's use of interest rates to stimulate Europe's economy will be limited because rates are already in negative territory. She acknowledges there is only so much central bankers can do, but interest rates in Europe can go lower. \"There's a bottom to everything, but we're not at that bottom at this point in time.\"\n\n\n\nDickerson interviewed Lagarde last month at her home in Normandy and at the International Monetary Fund headquarters in Washington D.C., which she led since 2011. She takes over as president of the ECB on November 1.", "description": "\"Market stability should not be the subject of a tweet here or a tweet there.\" Christine Lagarde, incoming head of the European Central Bank, on what she would say to President Trump about the global economy. 60 Minutes reports, Sunday", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/18/487b0de7-6574-4503-97af-f712b3945552/thumbnail/1200x630/19878bb9c24bfe4f61538a39e0cb44b3/lagardepreview.jpg", "published_at": "2019-10-18"}