{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/sanders-gets-personal-in-a-conversation-about-israel-policy/2019/10/28/77ab8e1c-f993-11e9-8190-6be4deb56e01_story.html", "downloaded_at": "2019-10-29 02:15:03.579717+00:00", "title": "Sanders gets personal in a conversation about Israel policy", "language": "en", "text": "The comments, at a conference in Washington hosted by the liberal Jewish organization J Street, were Sanders’s most direct attempt yet to fuse his heritage to his political approach and policy agenda.\n\nAD\n\nHis participation also served as a stark reminder of the distinctive space he occupies in the Democratic field. Sanders is the only prominent Jewish candidate, a vocal critic of Israeli Prime Minister Benjamin Netanyahu, a staunch Palestinian defender and the preferred candidate of the nation’s first two Muslim congresswomen.\n\nAD\n\nSanders was one of 10 Democratic White House hopefuls who made appearances or sent videos for the three-day summit that concluded Monday. Sanders, Sen. Elizabeth Warren (Mass.) and South Bend, Ind., Mayor Pete Buttigieg all said they would be willing to make foreign aid to Israel contingent on the country forging more peaceful relations with Palestinians.\n\nThat posture highlighted the party’s shift in recent years toward embracing more restrictive relations with a longtime ally. As conservative Israeli political leaders pursue a hard-line agenda and cozy up to Trump, Democrats are rethinking their relationship with Israel, holding a sometimes messy intraparty debate that has cut along generational and ideological lines.\n\nAD\n\nSome of the disagreements about the future of relations with Israel and Palestinian territories were evident at the convention, where some candidates advocated a more cautious approach than Sanders, Warren and Buttigieg.\n\nAD\n\nFormer vice president Joe Biden did not bring up placing conditions on foreign aid in a video address that was played at the convention. And Sen. Michael F. Bennet (Colo.) advocated for applying pressure on Israel several ways, rather than settling on one that “is going to become a partisan litmus test.”\n\nBut it was remarks by Sanders, who has long been reluctant to talk about himself, that stood out most. He brought a subdued crowd to life as he walked onstage to join a moderated discussion with Tommy Vietor and Ben Rhodes, former Obama White House aides who now host a popular podcast.\n\nAD\n\nDrawing on his Jewish heritage and visits to the region — “As a kid, I spent many months on a kibbutz in Israel,” he told the crowd — Sanders sought to emphasize that is he not choosing Palestinian rights over Israeli rights, even as he has been highly critical of Netanyahu’s practices.\n\nAD\n\n“I believe absolutely not only in the right of Israel to exist but the right to exist in peace and security,” Sanders said. “But what I also believe is the Palestinian people have a right to live in security and peace, as well.”\n\nSanders said U.S. aid should be contingent on Israel’s conduct in the region, saying the United States should not give “carte blanche to the Israeli government.”\n\nAD\n\nLater, Sanders was asked how he would weather attacks from Republicans alleging Democrats are weak on Israel or, worse, anti-Semitic. He again pointed to his upbringing.\n\n“Being Jewish may be helpful in that regard,” Sanders said. “It’s going to be very hard for anybody to call me, whose father’s family was wiped out by Hitler, who spent time in Israel, an anti-Semite.”\n\nSanders recently won an endorsement from Rep. Ilhan Omar (D-Minn.), whose comments about Israel have stoked controversy and drawn criticism from both political parties. Omar, who is Muslim, was rebuked by party leaders earlier this year for suggesting that Israel’s allies in American politics were motivated by money rather than principle. She later apologized.\n\nAD\n\nAD\n\nOmar plans to hold a rally with Sanders in Minneapolis next weekend. On Sunday, Sanders held a rally with Rep. Rashida Tlaib (D-Mich.), the first Palestinian American woman sworn into Congress. In August, Israel denied entry to Omar and Tlaib after Trump expressed disapproval of their planned trip.\n\nJ Street was founded in 2007 to lobby for a two-state Israeli and Palestinian solution and has become an influential group in the presidential sweepstakes. It rose to prominence during the Obama administration, supporting policies such as the Iran nuclear deal.\n\nNow, the group is raising the prospect of using the billions of dollars in annual aid the United States provides to Israel as it seeks to encourage less hostility toward Palestinians.\n\nAD\n\n“Our aid is not intended to be a blank check,” J Street President Jeremy Ben-Ami told attendees Sunday. “Congress and the next administration, at a minimum, should take the necessary steps to gain visibility into how our assistance is being used, how our dollars are being spent, and to ensure that all existing laws regarding those uses are being followed.”\n\nAD\n\nThe Democratic candidates addressed more than 4,000 conference attendees. In his video, Biden called a two-state solution “the best, if not the only, way to secure a peaceful future for a Jewish Democratic state of Israel,” but he did not use the word “occupation” or discuss specific negotiating strategies.\n\nWarren was more direct, saying that the “creation of a sovereign Palestinian state” would “ensure an end to Israeli occupation.” She reiterated a campaign pledge to make aid to the country conditional on the peace process with Palestinians.\n\nAD\n\n“If Israel’s government continues with steps to formally annex the West Bank, the U.S. should make clear that none of our aid should be used to support annexation,” Warren said.\n\nButtigieg told the audience that Democrats should fight back when the president accuses them of anti-Semitism.\n\nAD\n\n“It shouldn’t be hard to be against bad policies and to be against anti-Semitism,” he said. “You can be committed to the U.S.-Israel alliance without being supportive of any individual choice by a right-wing government over there.”\n\nOther Democrats were more cautious. Sen. Amy Klobuchar (Minn.), Bennet, and former housing secretary Julián Castro suggested, in different ways, that it would be rash to threaten aid to Israel before any negotiations began.\n\nAD\n\nJewish voters and political donors, who overwhelmingly support Democrats, have generally welcomed criticism of Netanyahu and his policies. And a younger generation of Democrats has shown an increasing willingness to break from past orthodoxy, which called for showing more unquestioning support for Israel.\n\nTwenty-seven percent of Democrats said they sympathize more with Israel, while 25 percent said they sympathize more with the Palestinians, according to a Pew Research Center poll conducted in early 2018. The findings contrasted with 2016, when a Pew poll showed 43 percent sympathized more with Israel, compared with 29 percent who sided more with the Palestinians.\n\nIn his remarks Monday, Sanders argued that “it is not anti-Semitism to say that the Netanyahu government has been racist.” He added, “That’s a fact.”", "description": "At a convention for the liberal Jewish organization J Street, Sanders said his faith and background make it easier for him to criticize Israel.", "authors": ["Sean Sullivan", "Reporter Covering National Politics", "David Weigel", "National Reporter Covering Politics"], "top_image": "https://www.washingtonpost.com/resizer/EBuZ6BKC5_furtD3rSrJQ2O4NSQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2JVDVHHZ2QI6TAMQNPSN5NLOAE.jpg", "published_at": "2019-10-28"}