{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7618575/Eddie-Jones-goes-incognito-NFL-hat-England-head-coach-watches-Wales-vs-South-Africa-semi-final.html", "downloaded_at": "2019-10-27 12:11:46.145246+00:00", "title": "Rugby World Cup final: Eddie Jones goes incognito as England coach watches South Africa beat Wales", "language": "en", "text": "Eddie Jones went undercover in Yokohoma - disguising himself as a fan of the NFL's Houston Texans - as he scouted Rugby World Cup final opponents South Africa against Wales.\n\nThe England head coach watched on as the Springboks edged a tight battle 19-16, confirming themselves as England's opponents next week.\n\nSouth Africa's analysts face a formidable task to find many weaknesses in the England team after Jones's side crushed the New Zealand juggernaut 19-7 in the other semi-final on Saturday.\n\nEddie Jones went undercover at the World Cup semi-final as South Africa edged Wales\n\nJones' donned a Houston Texans cap as he scouted the semi-final ahead of Saturday's final\n\nThe Australian-born coach was caught with his cap pulled low over his face as he watched intently with a pen in hand - as England's first final since 2007 draws closer.\n\nEngland's semi-final victory over the All Blacks was hailed as taking the game to a new level, and the performance of the side captained by Owen Farrell will have struck fear into Wales and South Africa even before they kicked-off their semi-final.\n\nSouth Africa blasted past host nation Japan 26-3 to reach the semi-final, but did not top Pool B after losing 23-13 to New Zealand - making England firm favourites for the final.\n\nThe tournament's finale will kick-off at 9am on Saturday.", "description": "Eddie Jones went undercover in Yokohoma - disguising himself as a fan of the NFL's Houston Texans as he scouted Rugby World Cup final opponents South Africa against Wales.", "authors": ["Tomiles For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/10/20239924-0-image-a-8_1572172210263.jpg", "published_at": "2019-10-27"}