{"pub": "usatoday", "url": "https://usatoday.com/story/news/world/2019/10/11/turkish-forces-push-into-kurdish-held-syria-death-toll-rises/3942628002", "downloaded_at": "2019-10-11 20:08:56.135173+00:00", "title": "100,000 displaced, death toll rises, hospital closes as Turkish forces push into Kurdish-held Syria", "language": "en", "text": "CLOSE President Donald Trump defended a plan to move U.S. troops out of Northern Syria despite a backlash Monday from the GOP. USA TODAY\n\nA major hospital along the border has been abandoned and tens of thousands are fleeing south as Turkish forces continue to launch a military offensive into Kurdish-controlled parts of Syria.\n\nSecretary of State Mike Pompeo warned Turkish leaders against the offensive on Friday, threatening a \"real cost\" to Turkey if it continues down its current path.\n\n\"We’re using every economic and diplomatic tool to convince them to cease this activity,\" Pompeo said in an interview with The Tennessean. \"It’s a bad thing, and we’re working to convince [Erdogan] that moving into Syria this way is putting at risk the lives of the Kurdish people, and others as well, Christians and other ethnic minorities and religious minorities.\"\n\nWith airstrikes and artillery, Turkey has launched an offensive aimed at crushing Kurdish fighters in northern Syria. (Photo: f.duckett, AP)\n\nTowns and villages along the border have been hit with heavy shelling over the past few days, and residents are fleeing south to seek shelter. Doctors Without Borders, the international medical charity also known as MSF, said one of its hospitals along the border has closed.\n\nThe humanitarian impact of Turkey's \"Peace Spring\" offensive is already being felt. The United Nations said Friday that an estimated 100,000 people have already been displaced and are seeking shelter in host communities, collective shelters and schools.\n\n“This escalation can only exacerbate the trauma that the people of Syria have already endured through years of war and of living in precarious conditions,” said Robert Onus, MSF emergency manager for Syria, in the release.\n\nMore from Syria: Turkish strikes hit civilians as Syria offensive intensifies\n\nOn the Syrian side, at least seven civilians have been killed, according to the Kurdish Hawar news agency and the Syrian Observatory.\n\nTurkish officials say Kurdish militia have killed at least nine civilians, including a 9-month-old boy and three girls under 15, by firing mortars into border towns, the Associated Press reports.\n\nMourners carry the coffin of ten-month-old Mohammed Omar Saar, killed during incoming shelling from Syria Thursday, in Akcakale, Sanliurfa province, southeastern Turkey, at the border with Syria, Friday, Oct. 11, 2019. (Photo: Lefteris Pitarakis, AP)\n\nTurkey's Defense Ministry said four soldiers have been killed in the offensive, according to the Associated Press.\n\nThere are various reports of how many Kurdish fighters have been killed.\n\nThe military offensive is also raising concerns about the fate of Kurdish-run prison camps holding thousands of Islamic State prisoners.\n\nKurdish forces on Friday posted a video to Twitter saying that relatives of Islamic State families were \"rioting\" and attempting to escape.\"\n\nTurkey's military stepped up airstrikes and a ground offensive into Kurdish-held parts of northeastern Syria after President Donald Trump's decision to withdraw U.S. troops who fought alongside Kurds battling the remnants of the Islamic State group.\n\nTrump said Monday that he was delivering on a campaign promise to pull U.S. troops out of \"these ridiculous endless wars.\"\n\nTurkey launched the assault because it views a Kurdish militia that dominates the U.S.-backed Syrian Democratic Forces, or SDF, as a terrorist group. This group, the People's Protection Unit is aligned with the Kurdistan Workers' Party, or PKK, which has fought for autonomy in eastern Turkey for years. As part of that effort, the PKK carried out a wave of bombings and other attacks in Turkey.\n\nRead or Share this story: https://www.usatoday.com/story/news/world/2019/10/11/turkish-forces-push-into-kurdish-held-syria-death-toll-rises/3942628002/", "description": "Since Turkish forces launched a military offensive into Kurdish-controlled parts of Syria, border towns have been subject to heavy shelling.", "authors": ["Grace Hauck", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/10/USAT/20ef9221-b6f6-4704-a9a4-86dbedd7fb78-AP_Turkey_US_Syria-2.JPG?crop=2923,1644,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-11"}