{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/trump-unga-un-speech-globalists-patriots-antisemitic-a9118581.html", "downloaded_at": "2019-09-24 15:22:39.378987+00:00", "title": "Trump uses antisemitic trope during UN speech", "language": "en", "text": "Donald Trump used an anti-semitic phrase during his speech to the UN General Assembly, referring to “globalists” trying to take over the world.\n\n“The future does not belong to globalists. The future belongs to patriots. The future belongs to strong, independent nations,” the president said, while discussing international trade.\n\nReferring to the term “globalist,” Israeli newspaper Haaretz has written that: “White supremacists have used the term as a barely concealed dog-whistle for several years, but the problem comes when it’s used in the ‘globalist vs. nationalist’ economic debate.”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nMr Trump went on to urge world’s leaders to prioritise their own nations, with strong borders and one-on-one trade deals, rather than work towards transnational organizations and alliances.\n\n\"Globalism exerted a religious pull over past leaders causing them to ignore their own national interests,\" he added. \"Those days are over.\"\n\nMore follows…", "description": "Donald Trump used an anti-semitic phrase during his speech to the UN General Assembly, referring to “globalists” trying to take over the world. “The future does not belong to globalists. The future belongs to patriots. The future belongs to strong, independent nations,” the president said, while discussing international trade.", "authors": ["Peter Stubley"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/24/16/donald-trump-globalism.jpg", "published_at": "2019-09-24"}