{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/ap/article-7567375/Burakovsky-scores-OT-Avalanche-beat-Coyotes-3-2.html", "downloaded_at": "2019-10-13 04:58:57.296417+00:00", "title": "Burakovsky scores in OT, Avalanche beat Coyotes 3-2", "language": "en", "text": "DENVER (AP) - Andre Burakovsky scored at 3:29 of overtime and the Colorado Avalanche beat the Arizona Coyotes 3-2 on Saturday night.\n\nPavel Francouz had 34 saves in his first NHL start, and Nazem Kadri and Tyson Jost scored less than two minutes apart as the Avalanche started the season with four wins at home.\n\nFrancouz was signed as a free agent in May 2018. His only two appearances before Saturday were in relief last season.\n\nAntti Raanta was equally sharp in his first start of the season, stopping 29 shots. Michael Grabner and Nick Schmaltz scored for the Coyotes.\n\nBurakovsky got the winner after a back-and-forth extra period. Burakovsky collected the puck close in and sent a high shot past Raanta for his second goal and second winner in as many games.\n\nAfter nearly 50 minutes without a goal, the teams combined for three in a span of 2 minutes, 30 seconds.\n\nArizona Coyotes center Barrett Hayton (29) and Colorado Avalanche left wing Pierre-Edouard Bellemare (41) fight for position during the first period of an NHL hockey game, Saturday, Oct. 12, 2019, in Denver. (AP Photo/Jack Dempsey)\n\nThe Avalanche scored first at 6:57 of the third on Kadri's first of the season. With Jason Demers off for tripping, Cale Makar took a shot from the point that Raanta stopped. Kadri grabbed the rebound on the left side, avoided defenseman Jordan Oesterle and beat Raanta high.\n\nThe second goal came 1:49 later when Jost, battling in front, knocked in another rebound, giving Colorado a 2-0 lead with his first of the season.\n\nGrabner made it 2-1 41 seconds later with a blast from the right circle that beat Francouz to the top corner. The Coyotes tied it at 16:03 on Schmaltz's second goal of the season.\n\nNOTES: Arizona RW Phil Kessel played in his 1,000th NHL game and 778th in a row Saturday night. Kessel is the 21st active player with a 1,000 games played and his consecutive games streak ranks third among current players. ... Avalanche LW J.T. Compher missed his second straight game with a lower-body injury. ... Coyotes LW Lawson Crouse was out of the lineup with an upper-body injury.\n\nUP NEXT\n\nCoyotes: At Winnipeg on Tuesday.\n\nAvalanche: At Washington on Monday.\n\n___\n\nMore AP NHL: https://www.apnews.com/NHL and https://www.twitter.com/AP_Sports\n\nColorado Avalanche left wing Andre Burakovsky (95) moves the puck away from Arizona Coyotes right wing Michael Grabner (40) during the first period of an NHL hockey game, Saturday, Oct. 12, 2019, in Denver. (AP Photo/Jack Dempsey)\n\nArizona Coyotes defenseman Jakob Chychrun (6) shoots from a knee as Colorado Avalanche left wing Pierre-Edouard Bellemare (41) connects during the first period of an NHL hockey game, Saturday, Oct. 12, 2019, in Denver. (AP Photo/Jack Dempsey)\n\nArizona Coyotes defenseman Jakob Chychrun (6) breaks his stick while trying to defend against a Colorado Avalanche center Tyson Jost (17) shot on goal during the first period of an NHL hockey game, Saturday, Oct. 12, 2019, in Denver. (AP Photo/Jack Dempsey)\n\nArizona Coyotes defenseman Jakob Chychrun (6) and Colorado Avalanche left wing Andre Burakovsky (95) chase the puck along the boards during the second period of an NHL hockey game, Saturday, Oct. 12, 2019, in Denver. (AP Photo/Jack Dempsey)\n\nColorado Avalanche left wing Gabriel Landeskog (92) moves the puck against Arizona Coyotes center Clayton Keller (9) during the first period of an NHL hockey game, Saturday, Oct. 12, 2019, in Denver. (AP Photo/Jack Dempsey)\n\nColorado Avalanche defenseman Nikita Zadorov (16) holds back Arizona Coyotes center Vinnie Hinostroza (13) during the second period of an NHL hockey game, Saturday, Oct. 12, 2019, in Denver. (AP Photo/Jack Dempsey)", "description": "DENVER (AP) - Andre Burakovsky scored at 3:29 of overtime and the Colorado Avalanche beat the Arizona Coyotes 3-2 on Saturday night.Pavel Francouz had 34...", "authors": ["Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/05/wire-19645366-1570940052-362_636x382.jpg", "published_at": "2019-10-13"}