{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/25/tax-reform-20-will-make-america-even-greater", "downloaded_at": "2019-09-25 23:27:21.360593+00:00", "title": "'Tax Reform 2.0' will make America even greater", "language": "en", "text": "ANALYSIS/OPINION:\n\nPresident Trump has confirmed that next year he will be running for re-election on another tax cut, which Larry Kudlow, the president’s top economic adviser, has termed “Tax Reform 2.0.” Details yet to be finalized, but the 2020 Tax Reform 2.0 tax cuts will expand Tax Reform 1.0’s benefits for average Americans and the middle class.\n\nDemocrats have had a lot of trouble understanding the first tax reform passed in 2017. But those tax reform/tax cuts were focused on job creation for middle class workers and raising wages. Where do the progressives now running the Democratic Party think the millions of jobs created since the passage of the 2017 tax cuts came from?\n\nSix to seven million jobs have been created since Election Day 2016, with the stock market boom creating $12 trillion in increased wealth for America. Markets anticipated Mr. Trump’s Blue-Collar boom generated by the 2017 tax reform/tax cuts and Mr. Trump’s deregulation, particularly in energy.\n\nThose policies are why America now has the lowest unemployment in 50 years, and the lowest unemployment in American history for blacks, Hispanics, Asians and youth. Wages are now rising faster for lower-income workers than for those at higher-income levels.\n\nBut Democrats still don’t seem to understand how that happened. Nor do they seem to understand how jobs are created in a capitalist economy. They demonstrated that the last time they were in power. Unemployment remained over 9 percent for most of President Obama’s first term, and economic growth never recovered, even in Mr. Obama’s second term. Wages and middle-class incomes remained flat throughout Mr. Obama’s entire two terms in office.\n\nMr. Obama was re-elected in 2012 only because he was articulate enough to double talk his way out of any responsibility for his terrible recovery. It helped that Democrats control most of the major media, which claimed that Mr. Obama’s terrible recovery, averaging less than 2 percent economic growth, was the “new normal.” America could no longer do any better they said.\n\nBut voters got their chance to take their country back in 2016. Mr. Trump and American voters never got the message that America could no longer recover and grow. That is why voters surprised the Democrats in 2016. Democrats apparently had no idea voters were so unhappy over Mr. Obama’s economics. They were misled by their own media.\n\nTax Reform 2.0 should include making the middle-class tax cuts permanent. Otherwise, they are set to expire after Mr. Trump’s second term. Those tax cuts could not be made permanent in 2017 because Republicans could not get a single Democratic vote for the tax reform/tax cuts. Republicans only had enough votes on their own, under the budget rules, to pass the reforms with the tax cuts most responsible for creating all the jobs, rising wages and booming economic growth.\n\nTax Reform 2.0 should also include abolishing the hated “death tax,” which is very unpopular among the grassroots of both parties. This tax, which was imposed more than 100 years ago ostensibly to fight World War I, raises less than 1 percent of federal revenue and is very costly to our economy. Most people agree that “death should not be a taxable event.”\n\nAnd 2.0 should include indexing capital gains for inflation, which Mr. Trump can do on his own by regulation. That would be very effective in further increasing jobs, wages and growth.\n\nDemocrats, completely out of touch with reality, are running on reversing exactly the policies that created Mr. Trump’s Blue-Collar boom. They are running on repealing the 2017 tax reform/tax cuts, with even more tax increases that would throw America and its workers back into recession.\n\nAnd Democrats are running on reversing Mr. Trump’s deregulation, especially in energy, with the Green New Deal that would eliminate fossil fuels and America’s energy independence, increasing the cost of electricity three-fold. That would condemn most of today’s cars and trucks to the ash-heap and put an end to air travel.\n\nGlobal climate change is the villain cited as a major threat to our planet, justifying Democratic far-left anti-fossil fuel policies, and their criticism of President Trump for leaving the Paris Accord.\n\nThe fact is global warming stopped years ago, the planet has recently been cooling, and America’s coastal cities are not going underwater. Otherwise, why would the Obamas spend millions of dollars to buy an estate in Martha’s Vineyard that is only a football’s throw to the ocean.\n\nTax Reform 2.0 will not affect nature or sea levels. But it will assure continuing, robust economic growth, and the rising tide of jobs and wages for 99 percent of America’s workers.\n\n• Lewis K. Uhler is founder and chairman of the National Tax Limitation Committee and Foundation. Peter J. Ferrara is a senior policy adviser for the Foundation and teaches economics at Kings College in New York.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "President Trump has confirmed that next year he will be running for re-election on another tax cut, which Larry Kudlow, the president's top economic adviser, has termed \"Tax Reform 2.0.\"", "authors": ["The Washington Times Http", "Lewis K. Uhler", "Peter J. Ferrara"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/25/B1uhlerLGtaxreform_c0-650-1600-1582_s1770x1032.jpg?f22c556e22e0384ac0783970d48940e31a731810", "published_at": "2019-09-25"}