{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7539301/Vicky-McClure-reveals-sick-filming-Line-Duty-threw-Adrian-Dunbars-flat.html", "downloaded_at": "2019-10-05 08:13:45.187886+00:00", "title": "Vicky McClure reveals she was so sick filming Line Of Duty she threw up in Adrian Dunbar's flat", "language": "en", "text": "Vicky McClure has revealed that she threw up in co-star Adrian Dunbar's flat during filming for the last series of Line Of Duty.\n\nThe actress, 36, said that while on location in Belfast to make season five of the hit police drama, she didn't feel too great and had to make a quick getaway.\n\nWhen she ran into Adrian, who plays Ted Hastings in the show, in the lift he told her 'you look green' and called their bosses to let them know she wasn't coming in.\n\nNot so glam: Line Of Duty star Vicky McClure, 36, revealed that while filming the latest series of the hit police drama she was sick in co-star Adrian Dunbar's flat\n\nVicky, who plays Kate Fleming in Anti-Corruption Unit 12 on TV, revealed the story while speaking at a Red Smart Women Week event in London on Thursday.\n\nShe told the audience: 'Last series I was so ill and Adrian, who lives next door, saw me in the lift and he said \"you look green\".\n\n'I ran into his flat and threw up. He rang and said she can't come to set!'\n\nVicky also revealed that she has fun with the Line Of Duty cast and they often played jokes on each other while filming.\n\nCrime: Vicky, who plays Kate Fleming in the show, is part of in Anti-Corruption Unit 12 along with Adrian, who stars as Ted Hastings and Martin Compston who acts the role of Steve Arnott\n\nSet secrets: The actress also revealed how the cast try to make each other laugh when on set by drawing pictures in their notebooks\n\nShe said: 'On screen, we mess about. We have those notebooks which we open in the scene and we like to draw in them - I’ll let you imagine what. So, we can show each other in scenes.'\n\nVicky looked relaxed as she spilled some set secrets and looked every inch the TV star in a stylish black outfit with green ankle boots.\n\nShe accessorised her elegant look with several necklaces and bracelets as well as pushing her blonde hair back.\n\nTV star: Vicky looked stylish in a black outfit and green boots with a chunky gold heel at a Red Smart Women Week event in London on Thursday\n\nVicky also said she doesn't spend more than three weeks away from her producer and actor fiancé Jonny Owen while filming.\n\nThe Line of Duty star films the BBC drama away from home in Belfast, and has said she finds filming 'tough' because it's hard to be away from Jonny.\n\nVicky said: 'I have to balance it. I don't do more than three weeks because I start losing my head.'\n\nHowever Vicky said she is lucky that Jonny, who starred in UK version of Shameless and appeared with her in This Is England '90, understands her hectic schedule.\n\nCosy: Vicky said she doesn't spend more than three weeks away from her fiancé Jonny Owen, pictured at the Loyalty & Love Rankin exhibition in London on Wednesday, while filming\n\nShe added: 'Jonny is in the industry so he understands. You have to be dead not to go into work.'\n\nBack in April Vicky spoke candidly about her love life while on Elizabeth Day's How To Fail podcast, as she admitted she 'just knew' her fiancé was the one when they first met.\n\nThe star revealed: 'When we first spoke it was on the phone. I came off the phone and I just knew. I absolutely know.'\n\nVicky went on: 'We literally lived together from a week of meeting. We have basically stayed together from that time until now. We've never lived apart. Seven years in March. I am not sure about fate but I couldn't see my life without him.\n\n'I've never loved anyone more than I've loved Jonny. It sounds cheesy but I love him more and more every day. Things get better and better. Seven years with someone - I feel really lucky. I've had relationships where I didn't have that.'\n\nThe couple worked together on This Is England '90, and Vicky said that the series is still relevant today.\n\nShe said: 'People still contact me on social media and come up to me in the street, it’s a timeless piece.\n\nHit show: Vicky and Martin, pictured, both star in the show and a sixth series is in the works\n\n'It’s called This is England, not this was. Abuse, race and all the issues in it are still here they haven’t changed. And now Lol’s style is bang on trend.'\n\nDespite the long hours and work away from home, Vicky said she is determined to keep working in the 'fickle industry'.\n\nShe said: 'I don't know when this will end, my career. I wait until the contract lands in my hand then it's real.\n\n'I've had so much rejection and been so close. They say they love you, they really want you and I think, that means they don't. It can be a fickle business.'", "description": "Vicky McClure, 36, (main) revealed that while filming the hit police drama in Belfast she ran into Adrian Dunbar (together inset), who plays Ted Hastings, and he told her she looked 'green'.", "authors": ["Bryony Jewell For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/20/19312796-0-image-a-70_1570218105632.jpg", "published_at": "2019-10-04"}