{"pub": "cbs", "title": "Transcript: Rep. Eric Swalwell on \"Face the Nation,\" May 5, 2019", "url": "https://cbsnews.com/news/transcript-rep-eric-swalwell-on-face-the-nation-may-5-2019", "language": "en", "published_at": "2019-05-05", "downloaded_at": "2019-09-02 07:10:14.413462+00:00", "text": "The following is a transcript of the interview with Democratic Rep. Eric Swalwell of California that aired Sunday, May 5, 2019, on \"Face the Nation.\"\n\nMARGARET BRENNAN: We turn now to Congressman Eric Swalwell who joins us this morning from Mason City Iowa where he is campaigning for the Democratic presidential nomination. Welcome to \"Face the Nation,\" Congressman. I know you are very--\n\nREPRESENTATIVE ERIC SWALWELL: Good morning, thank you.\n\nMARGARET BRENNAN: You are very much involved as well with these hearings and these investigations. So let's start there before we talk about your 2020 platform. This hearing that we were just talking about that the attorney general did not show up for in the center of the room, one of your Democratic colleagues put a bucket of Kentucky Fried Chicken and an actual chicken. It obviously got a lot of press attention but is this really the tone that Democrats want to set?\n\nREP. SWALWELL: Margaret, the- the tone we want to set is to highlight that America was attacked by the Russians in 2016. The basic function of a government is to protect its people from a foreign attack and we needed the attorney general to come to Congress, a separate branch of power and tell us what the Russians did who they worked with and what we could do next. And he chose not to show up and there's gonna be consequences for that. And that was highlighted by another colleague of mine. But the bigger issue here is he didn't show up.\n\nMARGARET BRENNAN: He didn't show up. They argue over these procedural arguments in regard to having other lawyers staff lawyers question alongside congressmen like yourself. For you, you think this is just a refusal to comply because of what?\n\nREP. SWALWELL: You know, Margaret, I don't care if we asked him to meet us here in Mason City to tell us about what the Russians did. We are a separate branch of power and we have the right to ask so we can protect the American people, and again I think this is more about not wanting to play an away game. He had a home game with the Senate with Chairman Graham. He didn't do so well there, it looks like he lied to Congress, and he didn't want to come the next day where he would face even more tough questions. And again the bigger picture here, if we are not able to protect our people from a foreign attack do we really actually have a government that can defend us.\n\nMARGARET BRENNAN: You said- you seem to agree with Speaker Pelosi that the attorney general lied specifically here. What is it that you are taking issue with?\n\nREP. SWALWELL: Well first he prejudged the report before he even became attorney general I think he should have never been confirmed but once confirmed should have recused. Second he falsely accused the Obama administration of spying on the Trump campaign. Third he mischaracterized at the press conference and to Congressman Christ what Bob Mueller's view was on the report. And finally and most importantly he missed the deadline last week to give us the full Mueller report. There have to be consequences for that. For that reason I think you have to move this obstructor out of the way and I'm recommending that we impeach Attorney General bar so that we can get the information we need to protect our country. Did you read all the Muller report yes there's an eighth of it that I'm not allowed to read that I should be allowed to read.\n\nMARGARET BRENNAN: Well your leadership has the ability to read it but we know that there's a- a reason for that objection. But I want to get to the point of the- the sweeping and systematic Russian interference that is laid out in the report is substantiated. But I know you have been talking because you are also in an intelligence role on that House committee saying a number of things that I want to quote back to you. Up until this point you said when you were asked in January, \"do you believe the president right now has been an agent of the Russians?\" You said, \"yes,\" you were asked again at the end of that month by a questioner, \"I'm still not hearing any evidence that he's an agent of Russia.\" And you said, \"Yeah I think it's pretty clear it's almost hiding in plain sight.\" The Mueller report did not substantiate any conspiracy or coordination with Russia. Do you regret prejudging the outcome?\n\nREP. SWALWELL: No, actually I- I- I think I should have been louder, considering the top of your show and you talked about the phone call between Vladimir Putin and the president, at the president's request. And- and Margaret the Mueller team was not even allowed to look at the financial entanglements. So, I think it's really hard to draw a conclusion about conspiracy if they couldn't look at the president's tax returns, they couldn't look at the president's loans from the--\n\nMARGARET BRENNAN: You still believe he's an agent of Russia?\n\nREP. SWALWELL: I think he acts on their behalf. I mean, again I think 10 years from, now we are going to- we're going to look at what happened this week and we're going to say, \"Are you kidding me?\" After Russia attacked the United States, after the special counsel laid out 200 pages of links between the Russians and the Trumps and how they tried to help him, our president instead of calling the Russian president saying, \"don't do this again,\" he talked to him for an hour and a half and said that the Russian president was smiling. I mean that is just nutty, Margaret. That is putting the Russian's interests ahead of the United States' interests.\n\nMARGARET BRENNAN: This, along with other investigations, the administration is pushing back on. Given the level of pushback, do you think that this is stirring up enough frustration among Democrats that they might change the judgment and go ahead with impeachment? Do you support impeachment of the president?\n\nREP. SWALWELL: This president is taking us down that road. It's- it's maybe the only road to save the country, but right now, you know, I'll- I'll tell you with the attorney general, I think we should move to impeach him first. Now, I'm- I'm a father of a- a 2-year-old and a 6-month-old. We're going through the terrible twos. When my son misbehaves, we take a toy away. We know if we don't do that he's only going to get worse. We have a really bad kid at the White House and unless we start showing that there are consequences for their actions, he's only going to get worse and the next kid, the next president is going to look at what we did now and judge their actions based on whether there were consequences or not. So we have to start taking this president seriously and speaking the only language they know, which is force and consequence.\n\nMARGARET BRENNAN: So, you're running for president. Day one, more sanctions on Russia?\n\nREP. SWALWELL: Yes, but also day one is take the oath and go on a global affirmation tour to assure our NATO allies and others that we are still with them and we need them to be a check on Russia.\n\nMARGARET BRENNAN: Congressman, more to talk about with you, but we're gonna have to leave it there.\n\nREP. SWALWELL: I look forward to that.\n\nMARGARET BRENNAN: Pick that conversation up--\n\nREP. SWALWELL: Thank you.\n\nMARGARET BRENNAN: --another time and we will be back with our political panel.", "description": "The following is a transcript of the interview with Rep. Eric Swalwell that aired Sunday, May 5, 2019, on \"Face the Nation\"", "authors": [], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/05/05/d0ecf72a-c212-4397-8dd9-34f0f5e76fdc/thumbnail/1200x630g2/d84af2cd318a5043a08d940c2716e629/screen-shot-2019-05-05-at-11-11-22-am.png"}