{"pub": "yahoo", "title": "Disney World to Close Early on Tuesday as Hurricane Dorian Nears Florida Coast", "url": "https://news.yahoo.com/disney-world-close-early-tuesday-220428411.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 01:00:02.736745+00:00", "text": "With Hurricane Dorian barreling towards the Florida coast, Walt Disney World will close early on Tuesday.\n\nThe company said on Monday that both the Magic Kingdom Park and Epcot would close at 3 p.m. ET, with Disney’s Hollywood Studios and Animal Kingdom shutting down at 2 p.m. ET. Both ESPN’s Wide World of Sports and Blizzard Beach Water Park will be the closed the entire day.\n\nDisney resort hotels will remain open, but Disney’s Fort Wilderness Resort and Campground will also close at 3 p.m. on Tuesday.\n\nAlso Read: 'The King' Film Review: Timothée Chalamet Fights for the Crown, On and Off the Battlefield\n\nThe Category 4 storm, which is currently over the Bahamas, is expected to get close to the Florida coast on Monday night. The current path of the storm has it affecting the Orlando area somewhere between Tuesday night and Wednesday morning. It was downgraded from a Category 5 on Monday.\n\nThe hurricane center is still forecasting that Dorian will stay just off the U.S. coast. Evacuations were ordered for parts of Florida and, later Monday, the Georgia and South Carolina coasts. A hurricane warning is in effect along Florida’s east coast, while a storm surge warning has also been issued in other parts of Florida and Georgia as well.\n\nBy Monday afternoon, the storm had top sustained winds of 145 mph, which was down from the 185 mph in the morning.\n\nRead original story Disney World to Close Early on Tuesday as Hurricane Dorian Nears Florida Coast At TheWrap", "description": "With Hurricane Dorian barreling towards the Florida coast, Walt Disney World will close early on Tuesday.The company said on Monday that both the Magic Kingdom Park and Epcot would close at 3 p.m. ET, with Disney’s Hollywood Studios and Animal Kingdom shutting down at 2 p.m. ET. Both ESPN’s Wide World", "authors": ["Tim Baysinger"], "top_image": "https://s.yimg.com/uu/api/res/1.2/iD7txlqLmrB.nhv2sa5CPg--~B/aD00MDA7dz02MTg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/thewrap.com/c3ff8e8efa776d190d76c9852df909a6"}