{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/26/post-bolt-worlds-track-enters-new-territory-minus-", "downloaded_at": "2019-09-26 16:49:32.476436+00:00", "title": "Post-Bolt worlds: track enters new territory minus Usain", "language": "en", "text": "DOHA, Qatar (AP) - A new era of track and field begins Friday at the world championships.\n\nFor the first time since 2003, the sport’s biggest event outside the Olympics will take place without Usain Bolt.\n\nThe effervescent Jamaican, who made the sprints can’t-miss entertainment any time he was on the track, has left a void since his retirement after worlds in 2017.\n\nBut also created some new opportunities .\n\n“It’s weird, because usually when he’s around, there’s a different energy. It’s almost like pandemonium in a way,” said Justin Gatlin , who got the win in 2017, while Bolt finished a surprising third in his farewell 100-meter race. “Now, you feel like everyone is an opponent. Everyone has their opportunity of being really good and stepping up to the plate to be able to place.”\n\nAlso missing from these championships is South African middle-distance runner Caster Semenya, who is barred from defending her latest 800-meter world title in Doha because she has refused to follow new IAAF rules requiring her to medically reduce her natural testosterone level to be allowed to compete in certain races.\n\nThe IAAF will award her a gold medal from the 2011 worlds at a ceremony because a Russian who finished in front of her was disqualified. But Semenya is not expected to attend the ceremony.\n\nOver 10 high-heat and high-intensity days, athletes will offer a glimpse of what things might look like next year at the Tokyo Games. Bolt won’t be running there, either.\n\nHere are some people to know and top events to watch:\n\nGATLIN VS. COLEMAN VS. DE GRASSE\n\nGatlin will have his work cut out for him in defending his 100-meter title. First, he’s 37 and going up against the next generation. Second, he felt something grab in his hamstring during a meet in Croatia in early September (he said he’s healthy). American teammate Christian Coleman , who has the world’s leading time in the 100 this year at 9.81 seconds, will be a formidable foe as he chases after a Bolt-like 100-200 double.\n\nIt’s been a rocky summer for Coleman, who is eligible for worlds after the U.S. Anti-Doping Agency dropped his case for missed tests because of a technicality. Coleman’s top rival in the 200 is Noah Lyles, a 22-year-old who celebrates like Bolt - and runs like him, too.\n\nDon’t discount Canada’s Andre De Grasse , who captured silver (200) and bronze (100, 4x100) at the 2016 Rio de Janeiro Olympics.\n\nOn the women’s side, American sprinter Tori Bowie (100) and Dafne Schippers (200) of the Netherlands are out to defend their titles. Jamaicans Elaine Thompson and Shelly-Ann Fraser-Pryce are favored in the 100. Dina Asher-Smith of Britain is the one to beat in the 200.\n\nWIDE OPEN 800\n\nThe IAAF’s stance on Semenya and other female athletes affected by its new testosterone regulations was revealed in a decision published by the Switzerland-based Court of Arbitration for Sport. The medical process has been criticized as unethical by experts and Semenya has refused to take medication to alter what she calls her genetic gifts.\n\nAt least two other runners, Francine Niyonsaba of Burundi and Margaret Wambui of Kenya - both Olympic medalists - say they also are affected by the rules.\n\nWith none of those women in the lineup, Americans Ajee Wilson and Raevyn Rogers, along with Lynsey Sharp of Britain, are among the favorites.\n\nFELIX’S FORM\n\nDecorated sprinter Allyson Felix didn’t make the U.S. squad in an individual event as she works her way back from giving birth. But she was named to the 4x400 relay pool as the team tries to defend its title. She’s an 11-time world champion.\n\nFelix hasn’t competed that much since giving birth to her daughter, Camryn, in late November during an emergency C-section. The 33-year-old Felix is looking toward Tokyo in hoping to make her fifth Olympic team.\n\nHURDLES FALLING?\n\nIn the men’s 400-meter hurdles, Karsten Warholm of Norway, Abderrahman Samba of Qatar and Rai Benjamin of the U.S. are all making a run at Kevin Young’s top mark of 46.78 seconds that was set in 1992. All three have run under the 47-second threshold over the last year or so.\n\n“We’ll see how it goes,” Benjamin said.\n\nHURDLES FALLING, PART II?\n\nIn the women’s 400 hurdles, Olympic champion Dalilah Muhammad broke the world record in the rain July 28 at the nationals in Des Moines, Iowa. Her time of 52.20 seconds was 0.14 seconds faster than that by Yuliya Pechonkina of Russia on Aug. 8, 2003.\n\nThat record could tumble again, with American teammates Sydney McLaughlin, Ashley Spencer and reigning champion Kori Carter in the field. Zuzana Hejnová of the Czech Republic could crash the party.\n\n___\n\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "A new era of track and field begins Friday at the world championships.", "authors": ["The Washington Times Http", "Pat Graham"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/26/qatar_world_athletics_78273_c0-8-2485-1456_s1770x1032.jpg?bedd3c03eb4cbf7fe1dcf1a18ebec9d9cd275a09", "published_at": "2019-09-26"}