{"pub": "realclearpolitics", "url": "https://msn.com/en-us/news/politics/former-top-state-dept-aide-tells-impeachment-investigators-he-quit-over-ukraine/ar-AAISxw3?li=BBnbcA1", "downloaded_at": "2019-10-16 20:45:49.232363+00:00", "title": "Former Top State Dept. Aide Tells Impeachment Investigators He Quit Over Ukraine", "language": "en", "text": "© Anna Moneymaker/The New York Times Michael McKinley, center, a former top aide to Secretary of State Mike Pompeo, arriving Wednesday on Capitol Hill.\n\nCorrection: October 16, 2019 This article has been revised to reflect the following correction: Because of an editing error, an earlier version of a picture caption with this article misidentified Michael McKinley. He is at the center, not the back left.\n\nA former top aide to Mike Pompeo, the secretary of state, told impeachment investigators on Wednesday that he resigned because he was upset that the Trump administration had wrestled Ukraine policy away from career diplomats, according to three people familiar with his closed-door deposition to the House Intelligence Committee.\n\nIn several hours of continuing testimony, Michael McKinley, who until last week was a senior adviser to Mr. Pompeo, described his mounting frustration with how politicized the State Department had become under President Trump, saying that the last straw for him was the ouster of Marie L. Yovanovitch, the former ambassador to Ukraine whom Mr. Trump ordered removed.\n\nMr. McKinley’s testimony was the latest in a string of accounts given by top career diplomats and administration officials to impeachment investigators about how experts were sidelined as the president pursued his own agenda on Ukraine, including in a July telephone call when Mr. Trump asked President Volodymyr Zelensky of Ukraine to investigate former Vice President Joseph R. Biden Jr. and other Democrats.\n\nSign Up For the Morning Briefing Newsletter\n\nTaken together, the interviews have corroborated many aspects of the intelligence whistle-blower complaint that prompted the impeachment inquiry, which alleged that Mr. Trump abused his power to enlist a foreign government for his own political gain.\n\nWhile Mr. McKinley told lawmakers that he did not have detailed knowledge about the Ukraine matter, he said the handling of the issue was emblematic of a troublesome trend at the State Department, the people said, speaking on condition of anonymity to describe a closed-door deposition. He spoke of his frustration with Rex W. Tillerson, the former secretary of state, saying he had gutted the department, and praised Mr. Pompeo for his leadership.\n\nBut Mr. McKinley said he was alarmed at how poorly diplomats were treated. Ms. Yovanovitch, a 30-year veteran of the Foreign Service, testified privately last week that she was abruptly removed from her post after a monthslong push by Mr. Trump to get rid of her on the basis of “unfounded and false claims by people with clearly questionable motives.”\n\nDemocratic lawmakers who participated in the questioning of Mr. McKinley said he fit the mold of other witnesses the impeachment inquiry has interviewed.\n\n“Another career Foreign Service officer with a 33-year career trying to do the right thing,” said Representative Harley Rouda, Democrat of California, as he left the deposition. Mr. Rouda said that Mr. McKinley, like some other witnesses, provided the committees with an opening statement.\n\nMr. Trump complained about the impeachment inquiry Wednesday during a meeting with Italy’s president at the White House, accusing House Speaker Nancy Pelosi of doing “this country a great disservice” and predicting that Democrats would lose the 2020 presidential election because the party pursued his impeachment.\n\nThe president called Representative Adam B. Schiff, the Democratic chairman of the House Intelligence Committee, “purely fraudulent” and said that Republicans have been treated by Democratic lawmakers with “great disrespect.”\n\nRepresentative Mark Meadows, Republican of North Carolina, said after he left the hearing room that Mr. McKinley had been both “complimentary of Secretary Pompeo,” and made clear he was “supportive” of Ms. Yovanovitch.\n\nMr. Pompeo has defended the administration’s actions regarding Ukraine, saying that the impeachment inquiry has sparked a “silly gotcha game” in Washington.\n\nMr. McKinley appeared voluntarily before the committee, which did not issue a subpoena to compel his testimony, according to an official involved in the inquiry.\n\nHe arrived on Capitol Hill Wednesday as the House’s impeachment inquiry accelerated, with daily, hourslong depositions that Democratic lawmakers hope will expose the activities of Rudolph W. Giuliani, the president’s personal lawyer, to pressure Ukraine’s government to dig up damaging information about Mr. Trump’s political rivals.\n\nThe steady stream of diplomats and White House officials have appeared before the committees despite Mr. Trump’s vow not to cooperate with the inquiry. Mr. McKinley’s testimony further sets the stage for Thursday’s expected deposition of Gordon D. Sondland, the ambassador to the European Union and a Trump loyalist.\n\nIn the past week, witnesses have described a shadow foreign policy led by Mr. Giuliani, Mr. Sondland and Rick Perry, the secretary of energy, that was designed to sideline the diplomats with formal responsibility over relations with Ukraine.\n\nKurt D. Volker, who served as Mr. Trump’s envoy to Ukraine before resigning late last month, was back at the Capitol Wednesday after testifying two weeks ago for more than eight hours.\n\nMr. Volker’s return on Wednesday, which had not been disclosed earlier, was for the purpose of reviewing the transcript of his earlier deposition, according to a person familiar with the situation. It is not unusual for witnesses in congressional investigations to be given an opportunity to review the official transcript of what they said.\n\nMr. Volker was not expect to provide additional testimony to lawmakers on Wednesday.\n\nJulian Barnes contributed reporting.", "description": "A former top aide to Mike Pompeo, the secretary of state, told impeachment investigators on Wednesday that he resigned because he was upset that the Trump administration had wrestled Ukraine policy away from career diplomats, according to three people familiar with his closed-door deposition to the House Intelligence Committee.", "authors": [], "top_image": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAISJDo.img?h=169&w=300&m=6&q=60&o=f&l=f&x=843&y=216", "published_at": "2019-10-16"}