{"pub": "reuters", "url": "https://reuters.com/article/us-britain-eu-banks-survey/no-deal-brexit-threat-sends-banking-volumes-in-britain-to-28-year-low-idUSKBN1WF2D7", "downloaded_at": "2019-10-01 00:18:19.418907+00:00", "title": "No-deal Brexit threat sends banking volumes in Britain to 28-year low", "language": "en", "text": "LONDON (Reuters) - The threat of a no-deal Brexit has sent profits and sentiment in Britain’s financial services falling at their fastest pace since the global financial crash a decade ago, a CBI/PwC survey showed on Tuesday.\n\nFILE PHOTO: Canary Wharf and the City of London financial district are seen from an aerial view in London, Britain, August 8, 2019. REUTERS/Hannah McKay/File Photo\n\nThe latest quarterly survey by the CBI, a business trade body and consultants PwC, said that in the three months to Sept. 30, the level of business activity at banks fell at its fastest pace in 28 years.\n\nBanking, insurance and investment funds bring in billions of pounds in tax revenues for the British economy, but direct access from London to its most important market, the European Union, could be blocked if there is a no-deal Brexit on October 31.\n\nThe quarterly survey of 83 firms found that optimism about overall business in financial services fell at the quickest pace since September 2008 when the Lehman Brothers crash deepened the 2007-2009 financial crisis.\n\nThe level of optimism has now been flat or falling for 15 consecutive quarters.\n\n“The sector is the jewel in the crown of the UK’s world-leading services industry,” said CBI Chief Economist, Rain Newton-Smith.\n\n“While it’s encouraging that investment plans have improved, the threat of a ‘no deal’ Brexit is hitting confidence.”\n\nBritain has yet to secure a divorce settlement with Brussels, with only a month to go before it leaves the EU.\n\nFinancial firms in Britain have spent millions of pounds opening hubs in the EU to cope with whatever form Brexit takes.\n\nProfits fell at their quickest pace since June 2009, but headcount in banking grew at the fastest pace in since December 2006, probably due to increased regulatory requirements, the survey showed.\n\nAndrew Kail, PwC’s head of financial services, said there has been a drop-off in plans to launch new products and services as firms batten down the hatches in expectation of a turbulent few months.\n\nLooking ahead to the December quarter, business volumes are expected to fall further, the survey showed. For the coming year, new regulation, Brexit, IT spending and customers switching to rivals would hit business most.", "description": "The threat of a no-deal Brexit has sent profits and sentiment in Britain's financial services falling at their fastest pace since the global financial crash a decade ago, a CBI/PwC survey showed on Tuesday.", "authors": ["Huw Jones", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190930&t=2&i=1435681815&w=1200&r=LYNXMPEF8T1K4", "published_at": "2019-09-30"}