{"pub": "metro", "url": "https://metro.co.uk/2019/10/02/dull-challenges-no-surprise-bake-off-contestants-hit-wall-10847038", "downloaded_at": "2019-10-05 05:55:40.484096+00:00", "title": "It's no surprise the Bake Off contestants are hitting a wall", "language": "en", "text": "There was a distinct lack of sharpness this week, and it was almost an anticlimactic episode after the roaring 20s (Picture: Channel 4)\n\nHarsh comments maybe, but I think the lack of last week’s booze (or perhaps too much of it) has resigned the judges to being grumpy. Thank goodness for the presenters, eh!\n\nFor instance, we now know how much Prue hates mauve, thanks to Priya’s ‘nasty mauve’ blueberry cream – and Prue’s assessment came across somewhat cruel.\n\nThen again, it is week six and time to get down to serious business. After saying goodbye to both Helena and Michelle last week, it’s beginning to feel like there’s no more room to mess up. The playoffs are over and we should be getting into a more intense and gripping tent from now on.\n\nHaving said that, there was a distinct lack of sharpness this week, and it was almost an anticlimactic episode after the roaring 20s. This week’s challenges were a bit dull and unoriginal and, in my opinion, should have been set much earlier on in the competition.\n\nAdvertisement\n\nAdvertisement\n\nWe started off with a ‘simple’ meringue, as the bakers put it, and were back to the recurring theme of substance before style. Henry cracked out a french twist, and nearly all of them were nutty, which was a slightly surprising angle. Most original idea from this round came from Michael inspiring himself with a Terry’s Chocolate Orange.\n\nThe presentation of the meringues was stunning, and I often think the artwork department don’t get enough credit for the beautiful illustrations showcasing how the final bake should look.\n\nThe problem is it can end up a bit like a Pinterest challenge with the reality looking nothing like the fantasy. Fortunately for our tent bakers, most were presentable, although Priya’s aforementioned mauve and David’s flavours weren’t to the judges’ taste.\n\nAlice, Michael and Rosie all suffered with chocolate overwhelm, so this is my takeaway from this week: meringue and chocolate is a tricky combo and a simple meringue needs to be just that – simple.\n\nPriya’s exit was swiftly confirmed as Steph nabbed ‘Star Baker’ for a third week running (Picture: Channel 4)\n\nAs a side note, bonus points must go to Henry (my forever most stylish tent resident this season) who successfully matched his shirt and tie with his meringue decoration – I love red.\n\nI’m a bit surprised that the bakers found the technical challenge to make a verrine tricky – it is quite an enjoyable and visually satisfying dessert to make although with Prue’s vague instructions, I’m sure it was a bit more stressful.\n\nAdvertisement\n\nAdvertisement\n\nPanna cotta is a pretty common dessert to have in a baker’s repertoire, a bit like a Victorian sponge. Sable biscuits are similar to tackling shortbread and it was a bit disappointing that the hardest challenge was finding out if your biscuit fit the glass or not.\n\nI suppose from a judging perspective, a verrine means you can’t hide behind anything. It’s a 360 degree view of your work, and while it looks simple and should be simple in its execution, if you complicate the preparation it leaves room for lots of very visible mistakes.\n\nUnfortunately by this point in the proceedings, Birthday Boy Michael had already resigned himself to the fact that he was going. I’m not sure what’s happened to everyone’s energy but the bakers definitely seem to be hitting a mid-season wall.\n\nThe Celebratory Bomb showpiece confirmed that this episode was focused on… the presentation of layers. Maybe chocolate too, but that’s it.\n\nI liked that Stylish Henry was devising new ways of prepping his mousse layers, as aside from horse syringes, we’ve been lacking some homemade innovative designs. Unfortunately it wasn’t perfectly executed, but the bigger picture shows it was a compliment to his skills as a baker to find out-of-the-box ways of tackling challenges.\n\nMeanwhile, the remaining boys were having their version of a water cooler chat by a fridge: ‘The least laddy lad’s club discussing gelatine setting temperatures’. I think I’d qualify for that club – where can I join?\n\nI was unfortunately not surprised to see Priya go this week (Picture: Channel 4)\n\nThe most gripping part of this episode was when the bakers turned their bombs out of their moulds – like children emptying out their buckets of sand on the beach and hoping for a perfectly four-turreted sandcastle.\n\nAdvertisement\n\nThis held a certain amount of hypnotic power while we as a nation willed them to succeed – and succeed they did. I was surprised – and perhaps it’s a little mean to say – almost disappointed there wasn’t one disaster after such a build up. It’s Bake Off after all.\n\nI’m not quite sure why Steph had stuck Doritos around her celebratory bomb, but that glaze was on point and ‘one of the best things I’ve had to eat for a long time,’ according to Paul. I didn’t think it was possible but that might be even better than a handshake?\n\nI rarely comment on production, but when Paul called Michael’s bomb gaudy, and the camera panned to Priya glancing at her showpiece, felt more than a little like shady, and clunky foreshadowing from the producers.\n\nPriya’s exit was swiftly confirmed as Steph nabbed ‘Star Baker’ for a third week running, and I was unfortunately not surprised to see Priya go this week, (especially after the editing tip-off) – and certainly less surprised than Henry.\n\nSmartest move for the week: I like that Henry had prepped his goodbye and ‘what to nick from the tent’ list! Apron, bowl and wooden spoon… he must be hoping to not get caught as I would have been trying to wheel a fridge freezer out of there!\n\nAdvertisement\n\nNext week is looking more promising, with the promise of Carnival and all things brightly coloured. Let’s hope it’ll bring some cheer to those grumpy judges.\n\nMORE: What it’s like to be a Great British Bake Off contestant\n\nMORE: Bake Off emergency protocol: When in doubt, add alcohol\n\nMORE: When you have a Bake Off disaster, the GBBO tent is a lonely place", "description": "Former contestant Selasi Gbormittah shares his thoughts on the Great British Bake Off's dessert week", "authors": ["Selasi Gbormittah", "Great British Bake Off Semi-Finalist"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_87091138_1570018090.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-02"}