{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/5/foxs-nfl-pregame-show-takes-place-in-broadcast-hal", "downloaded_at": "2019-09-05 07:07:34.975919+00:00", "title": "Fox's NFL pregame show takes place in broadcast Hall of Fame", "language": "en", "text": "From the moment Terry Bradshaw rode his horse through Hollywood and Beverley Hills, everyone knew Fox’s NFL Sunday pregame show was going to different. It can also claim to be something else - a Hall of Fame inductee.\n\nThe pregame show, which kicks off Fox’s 26th season covering the league on Sunday, was inducted into the National Association of Broadcasting’s Hall of Fame in April. It takes its place beside “Wheel of Fortune,” ”Jeopardy,” ”Meet the Press” and “All In The Family.”\n\n“If I would sum up in one word, it would be pride,” Jimmy Johnson said. “We’re all egotistical but we all take pride in the job that we do, and we work at it. Being recognized like this is an amazing achievement.”\n\nThere were many skeptics when Fox said it would have a one-hour pregame show. Instead it went on to break new ground.\n\nThe show was as much about entertainment as it was about getting fans up to speed on the latest news leading up to kickoff. It had Jillian Barberie delivering the weather and later evolved to include picks by comedians Jimmy Kimmel, Frank Caliendo and now actor Rob Riggle.\n\nIt also hasn’t been afraid to leave the comfortable surroundings of its Hollywood studio with yearly trips to military bases, aircraft carriers and service academies.\n\n“David Hill (Fox Sports’ first president) had a vision and Ed Goren (Fox Sports producer) brought it together,” Bradshaw said. “We were not afraid to do things that at the time were considered not normal, but it ended up we were at the forefront.”\n\nBradshaw and Howie Long have been the constants while Johnson has been part of the crew for all but the four seasons when he coached the Miami Dolphins (1996-99). Curt Menefee and Jay Glazer were added in 2007 while Michael Strahan joined the crew a year later after retiring from the New York Giants.\n\nLong and Bradshaw said coming into their group can be daunting, but that each one has done a good job.\n\n“I knew I had to prove myself,” Glazer said. “My second week in the studio I got the “Spygate” tape (when the New England Patriots were disciplined for videotaping New York Jets coaching signals from an unauthorized location) and that was when they realized I was able to bring something different to the table.”\n\nJohnson added that he feels like his second stint at Fox has gone a lot smoother because he isn’t as guarded about his opinions and there weren’t any rumors about him returning to coaching.\n\n“Our show to this day we talk football but it is an entertainment show,” Menefee said. “It is so much about chemistry - we love and respect each other. We have a good time all year around that when we show up it is hanging out with friends.”\n\n“Fox NFL Sunday” producer Bill Richards said it took some time for the new additions to blend in, but that everyone being themselves made the transition easier.\n\n“We do have pregame and postgame but for most of the day you’re sitting with four of your best friends watching football,” he said “If you do that every Sunday, you’re either going to have great friends or you’re going to move on to something else.”\n\nStrahan has been able to see the show as both a player and analyst. He said that when Long and Bradshaw would come to training camp or conduct interviews for features, that meant the game was big that week.\n\nNow being part of the crew, Strahan said it took a couple years for him to be able to act naturally in front of the camera. He also said if it wasn’t for the pregame show, all of his other opportunities on other shows would not exist.\n\n“This show gives you all the tools because you have to be able to handle live television, think on your feet, own your mistakes and not take yourself too seriously,” he said. “To be able to watch Curt hosting and monitoring traffic was a huge help.”\n\nLong said the ceremony in Las Vegas was special because Hill and Goren were part of the festivities and there was a lot of reminiscing about the first couple of seasons.\n\n“When you say it out loud how long we have been doing it, it does go to show that we have caught lightning in a bottle,” he said. “Everything you see is genuine and realistic. The framework of the show is spelled out, but the reactions are spontaneous.”\n\nFox will conclude the season in Miami by televising its ninth Super Bowl. Bradshaw is eager to see what teams will be able to get there, but he is also appreciating still being able to be part of the broadcast.\n\n“I appreciate everything we have been able to accomplish, but it is all going too fast,” he said.\n\n___\n\nAP Sports Writer Mike Marot in Indianapolis contributed to this story.\n\n___\n\nFollow Joe Reedy at www.twitter.com/joereedy\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "From the moment Terry Bradshaw rode his horse through Hollywood and Beverley Hills, everyone knew Fox's NFL Sunday pregame show was going to different. It can also claim to be something else - a Hall of Fame inductee.", "authors": ["The Washington Times Http", "Joe Reedy"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/05/fox_nfl_sunday_hall_of_fame_22692_c0-151-3600-2249_s1770x1032.jpg?86a0ad2941f4f8cac64fde118e16286d6ebd0c8d", "published_at": "2019-09-05"}