{"pub": "arstechnica", "url": "https://arstechnica.com/tech-policy/2019/10/fcc-will-ban-huawei-and-zte-equipment-in-us-funded-telecom-projects", "downloaded_at": "2019-10-29 23:57:52.306784+00:00", "title": "FCC plans Huawei/ZTE ban, may require ripping out existing network gear", "language": "en", "text": "Federal Communications Commission Chairman Ajit Pai is moving ahead with a ban on equipment from Chinese vendors Huawei and ZTE in US-funded telecom projects. The FCC will vote on Pai's proposal at its November 19 meeting, the commission said in an announcement and fact sheet released yesterday.\n\nPai's proposal \"would bar communications companies from using any support they receive from the FCC's Universal Service Fund (USF) to purchase equipment or services from companies posing a national security threat, like the Chinese companies Huawei Technologies Co. and ZTE Corp.,\" the announcement said.\n\nThe order specifically designates Huawei and ZTE \"as companies that pose a national security risk\" and would create \"a process for designating other suppliers that pose a national security threat,\" the FCC said. Huawei's network gear is used by numerous small, rural Internet providers.\n\nNext month's vote is the end result of a Notice of Proposed Rulemaking (NPRM) that the FCC approved in April 2018. As is standard practice, the FCC took public comment on the NPRM before finalizing the plan.\n\nPai issued this statement yesterday:\n\nWhen it comes to 5G and America's security, we can't afford to take a risk and hope for the best. We need to make sure our networks won't harm our national security, threaten our economic security, or undermine our values. The Chinese government has shown repeatedly that it is willing to go to extraordinary lengths to do just that. And Chinese law requires all companies subject to its jurisdiction to secretly comply with demands from Chinese intelligence services. As the United States upgrades its networks to the next generation of wireless technologies—5G—we cannot ignore the risk that the Chinese government will seek to exploit network vulnerabilities in order to engage in espionage, insert malware and viruses, and otherwise compromise our critical communications networks.\n\nThe FCC's $8.5 billion Universal Service Fund, which is paid for by Americans through fees on their phone bills, consists of four programs: the Connect America Fund, which gives ISPs money to deploy broadband in rural areas; Lifeline, which provides discounts on phone and broadband service to low-income consumers; the E-Rate broadband program for schools and libraries; and a telecom access program for rural health-care providers.\n\nPai's order would create a rule that prohibits the use of USF money to purchase equipment or services from Huawei, ZTE, or any other companies added to the list in the future. Huawei and ZTE were the first designated firms because of \"both companies' ties to the Chinese government and military apparatus,\" the FCC said.\n\nRip-and-replace order may come later\n\nThe order being issued next month will not prohibit USF recipients from continuing to use equipment or services they already obtained from Huawei or ZTE. However, funding recipients \"may not use USF funds to maintain, improve, modify, or otherwise support such equipment or services in any way,\" the FCC said.\n\nAnd although next month's vote won't immediately require ripping out existing equipment, the FCC said it may do that in the future. Pai is also asking commissioners to vote November 19 on another Notice of Proposed Rulemaking that proposes requiring USF-funded telecoms \"to remove existing equipment from covered companies, starting with Huawei and ZTE, from their networks,\" the FCC said.\n\nFor this additional NPRM, the FCC would again ask the public for comment and finalize the plan later. The process takes at least a few months.\n\n\"To mitigate the impact on affected entities, and in particular small, rural carriers, the FCC would propose to establish a reimbursement program to help offset the transition cost,\" the FCC said. To determine that cost, the FCC said it would conduct \"an assessment to find out how much Huawei and ZTE equipment is in these networks and the costs to remove and replace it.\"\n\nThe items up for a November 19 vote appear to have bipartisan support within the commission. Republican Commissioner Brendan Carr tweeted his support yesterday, saying, \"I have no doubt that China intends to spy on persons and businesses within our borders. We must secure our telecom networks from this threat.\"\n\nDemocratic Commissioner Jessica Rosenworcel seems inclined to approve Pai's proposal next month but said that the FCC should go even further.\n\n\"We need cybersecurity policies that target all our network providers—not just our Universal Service recipients,\" Rosenworcel said in a statement provided to Ars. \"In addition, we need to be mindful that in a global economy, our networks will still connect to insecure equipment abroad. So we should start researching how we can build networks that can withstand connection to equipment vulnerabilities around the world, including virtualizing the radio access part of our networks.\"\n\nWhile Huawei and ZTE have denied spying for China, the Trump administration has imposed a series of trade restrictions on the companies.", "description": "Ban on Chinese vendors would affect recipients of Universal Service funding.", "authors": ["Jon Brodkin"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/10/getty-huawei-logo-760x380.jpg", "published_at": "2019-10-29"}