{"pub": "thehill", "url": "https://thehill.com/regulation/467071-ginsburg-awarded-berggruen-prize-for-pioneering-gender-equality", "downloaded_at": "2019-10-23 15:00:15.073891+00:00", "title": "Ginsburg awarded Berggruen Prize for 'pioneering gender equality'", "language": "en", "text": "Supreme Court Justice Ruth Bader Ginsburg Ruth Bader GinsburgGinsburg says she never stopped working out after latest cancer diagnosis Majority disapprove of Trump Supreme Court nominations, says poll Buttigieg defends court-packing proposal at Democratic debate MORE has been honored with the 2019 Berggruen Prize for Philosophy & Culture, an award annually given to “thinkers whose ideas have profoundly shaped human self-understanding and advancement in a rapidly changing world.”\n\nThe Berggruen Institute announced Ginsburg's selection on Wednesday, saying in a statement that she had been chosen because of her work \"pioneering gender equality and strengthening the rule of law.\" The justice will receive $1 million with the prize, which she will donate to a charity of her choice, the Berggruen Institute said.\n\nADVERTISEMENT\n\n\"It is a true honor to have Supreme Court Justice Ruth Bader Ginsburg as the recipient of this year's Berggruen Prize,\" Berggruen Institute Founder and Chairman Nicolas Berggruen said in a statement. \"I am delighted the Jury has chosen to honor such a prolific leader in the field of jurisprudence.\n\n\"Throughout her career, Ginsburg has used the law to advance ethical and philosophical principles of equality and human rights as basic tenets of the USA. Her contributions have shaped our way of life and way of thinking and have demonstrated to the world the importance of the rule of law in disabling discrimination.\"\n\nGinsburg was selected for the award after being among a field of 500 nominees and a shortlist of five finalists. The Berggruen Institute in its announcement lauded her decorated history as a gender equality rights advocate, lawyer and judge.\n\nThe institute also cited several notable opinions Ginsburg has written on the Supreme Court, including her opinion in United States v. Virginia, Olmstead, a case that struck down Virginia Military Institute's male-only admissions policy.\n\n\"Few in our era have done more to bring vital philosophical ideas to fruition in practical affairs than Ruth Bader Ginsburg,\" Kwame Anthony Appiah, Chair of the Berggruen Prize and Professor of Philosophy and Law at New York University, said in a statement. \"She has been both a visionary and a strategic leader in securing equality, fairness, and the rule of law not only in the realm of theory, but in social institutions and the lives of individuals.\"\n\nThe Berggruen Prize for Philosophy & Culture is a prize awarded annually to a \"thinker\" that the institute believes is helping shape society. Canadian philosopher Charles Taylor received the first award in 2016 for his work in the humanities.\n\nThe honor for Ginsburg comes as she embarks on her 27th year on the Supreme Court. Despite undergoing three weeks of radiation treatment for a malignant tumor on her pancreas in August, Ginsburg was on the bench earlier this month as the court began the latest term.\n\nGinsburg is scheduled to receive the award at a private ceremony at the New York Public Library in December.", "description": "Supreme Court Justice Ruth Bader Ginsburg has been honored with the 2019 Berggruen Prize for Philosophy & Culture, an award annually given to “thinkers whose ideas have profoundly shaped human self-understanding and advancement in a", "authors": [], "top_image": "https://thehill.com/sites/default/files/mreportginsburg.jpg", "published_at": "2019-10-23"}