{"pub": "thehill", "url": "https://thehill.com/policy/national-security/466054-volker-returns-to-capitol-hill-to-review-deposition-transcript", "downloaded_at": "2019-10-16 21:05:12.294514+00:00", "title": "Former Ukraine envoy unexpectedly returns to Capitol Hill", "language": "en", "text": "American diplomat Kurt Volker Kurt VolkerMulvaney helped organize controversial Ukraine meeting State Dept. official told to 'lay low' after voicing concerns about Giuliani: Dem lawmaker Top State Department official arrives for testimony in impeachment probe MORE, a key figure in the Ukraine controversy, arrived unexpectedly on Capitol Hill Wednesday, entering the closed-door space where House members have been interviewing witnesses as part of their impeachment inquiry into President Trump Donald John TrumpWarren defends, Buttigieg attacks in debate that shrank the field Five takeaways from the Democratic debate in Ohio Democrats debate in Ohio: Who came out on top? MORE.\n\nVolker, who formerly served as the U.S. special envoy to Ukraine, was one of the figures named in the whistleblower complaint and one of the first officials to testify before the House about Trump and Rudy Giuliani Rudy GiulianiGiuliani urged Trump to eject exiled Turkish cleric from US: report State Dept. official told to 'lay low' after voicing concerns about Giuliani: Dem lawmaker White House, Pentagon, Giuliani reject House subpoenas MORE's efforts to get Ukrainian President Volodymyr Zelensky to open a corruption investigation into former Vice President Joe Biden Joe BidenWarren defends, Buttigieg attacks in debate that shrank the field Five takeaways from the Democratic debate in Ohio New study: Full-scale 'Medicare for All' costs trillion over 10 years MORE, a top 2020 Democratic White House hopeful, and his son.\n\nADVERTISEMENT\n\nTwo sources familiar with the matter said he was in the Capitol to review his deposition transcript, a standard procedure.\n\nIn his opening statement earlier this month, which was obtained by news outlets, Volker defended his record, praised ousted U.S Ambassador to Ukraine Marie Yovanovitch and said he had no involvement in the Trump-Zelensky phone call on July 25.\n\nBoth Republicans and Democrats seized on Volker's testimony as evidence to support their claims.\n\nDemocrats said Volker validated previous claims from a government whistleblower that the president had sought to pressure his Ukrainian counterpart into investigating the Bidens while withholding military aid to the country.\n\nHours after Volker's marathon closed-door testimony on Oct. 3, Democrats on the three committees leading the impeachment investigation released selected text messages Volker had provided between himself, U.S. Ambassador to the European Union Gordon Sondland and Bill Taylor, who is currently the top diplomat in Ukraine.\n\n\n\nDuring a July 19 exchange between the three, Volker wrote about Trump's upcoming call with Zelensky: \"Most impt is for Zelensky to say that he will help investigation — and address any specific personnel issues — if they are any.\" Volker noted that he had met Rudy Giuliani, Trump's personal lawyer, for breakfast that morning.\n\n\n\nSix days later, just before the call took place, Volker told Andrey Yermak, a top advisor to Zelensky: \"Heard from White House — assuming President Z convinces trump he will investigate / 'get to the bottom of what happened' in 2016, we will nail down date for visit to Washington.\"\n\nMeanwhile, Republicans said his testimony supported their claims that there was no promise to withhold Ukraine aid in exchange for a Biden investigation.\n\n\"He said there was no quid pro quo whatsoever,\" said Rep. Jim Jordan James (Jim) Daniel JordanTop State Department official arrives for testimony in impeachment probe 10 top Republicans who continue to deny the undeniable Ex-Trump aide to tell Congress she objected to Ukrainian ambassador's removal: report MORE (Ohio), the top Republican on the House Oversight and Government Reform Committee.\n\nVolker testified just days after resigning from his special envoy position. Days later, he stepped down as the head of the McCain Institute.", "description": "American diplomat Kurt Volker, a key figure in the Ukraine controversy, arrived unexpectedly on Capitol Hill Wednesday, entering the closed-door space where House members", "authors": [], "top_image": "https://thehill.com/sites/default/files/volkerkurt_100319.jpg", "published_at": "2019-10-16"}