{"pub": "yahoo", "url": "https://yahoo.com/entertainment/aoc-blasts-abc-sinclair-allowing-141220868.html", "downloaded_at": "2019-09-13 19:28:01.048618+00:00", "title": "AOC Blasts ABC And Sinclair For Allowing Debate Ad Showing Her Picture In Flames", "language": "en", "text": "Click here to read the full article.\n\nNew York Rep. Alexandria Ocasio-Cortez criticized ABC and Sinclair for a GOP group’s ad that ran during Thursday night’s Democratic debate in which her picture was shown set on fire.\n\n“GOP’s message: No policy, no facts, just displays of violence + corporations like @ABCNetwork & Sinclair who amplify them. They profit from burning my likeness on TV. But who pays for heightened security? Who answers the phones for the threats resulting from a violent, false ad?” she wrote on Twitter.\n\nMore from Deadline\n\nGOP’s message: No policy, no facts, just displays of violence + corporations like @ABCNetwork & Sinclair who amplify them. They profit from burning my likeness on TV. But who pays for heightened security? Who answers the phones for the threats resulting from a violent, false ad? https://t.co/Gr1XhEbwDC — Alexandria Ocasio-Cortez (@AOC) September 13, 2019\n\n\n\n\n\nThe ad, which ran in markets including New York and Washington D.C., came from the New Faces GOP PAC, which is led by Elizabeth Heng, who last year sought to unseat Democrat Jim Costa in a California House district.\n\nThe ad opens with an image of Ocasio-Cortez as Heng says, in voice-over, “This is the face of socialism. Does Alexandria Ocasio-Cortez know the horrors of socialism?”\n\nThe spot then shows the image of Ocasio-Cortez burning and dissolving to skeletons.\n\n“My father was minutes away from death in Cambodia before a forced marriage saved his life,” Heng says in the spot. She is the daughter of Cambodian immigrants who fled the communist Khmer Rouge.\n\nOcasio-Cortez first called out the spot on Thursday night, tweeting that “Republicans are running TV ads setting pictures of me on fire to convince people they aren’t racist. Life is weird.”\n\nThe ad ran during the debate in some markets, but not nationally. ABC, which owns WABC-TV in New York, has not issued any comment yet, and a spokesman for Sinclair, which owns WJLA-TV in Washington, could not immediately be reached.\n\nLearn more about \"New Faces GOP\" super PAC that paid for ads attacking @AOC during the #DemDebate in FCC records using @OpenSecrets political ad tracker: https://t.co/1rJRNEYEZe pic.twitter.com/f8s7cxSbP9 — Anna Massoglia (@annalecta) September 13, 2019\n\n\n\n\n\nHeng defended the ad on Thursday night, and in a new tweet on Friday.\n\nShe wrote that Ocasio-Cortez’s response “is the Democratic party in a nutshell. They are more offended by truthful words than the acts of their political ideology that has killed millions of innocent victims. I don’t care about @AOC feelings – I care about stopping her lies about the lies of socialism.”\n\n.@aoc response is the Democratic party in a nutshell. They are more offended by truthful words than the acts of their political ideology that has killed millions of innocent victims. I don't care about @AOC feelings – I care about stopping her lies about the lies of socialism. — Elizabeth Heng (@ElizabethHeng) September 13, 2019\n\n\n\n\n\nSign up for Deadline's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.", "description": "New York Rep. Alexandria Ocasio-Cortez criticized ABC and Sinclair for a GOP group's ad that ran during Thursday night's Democratic debate in which her picture was shown set on fire. \"GOP’s message: No policy, no facts, just displays of violence + corporations like @ABCNetwork & Sinclair", "authors": ["Ted Johnson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/nejQKNM8ZW7B6zL2WTE0gQ--~B/aD0yNDk4O3c9MzcyNztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/deadline.com/249752db32eb6e5bab4ef2ddde558d62", "published_at": "2019-09-13"}