{"pub": "cnbc", "url": "https://cnbc.com/2019/09/09/stocks-are-expected-to-break-out-to-new-highs-barring-any-errant-presidential-trade-tweets.html", "downloaded_at": "2019-09-09 23:18:55.056874+00:00", "title": "Stocks are expected to break out to new highs, barring any errant presidential trade tweets", "language": "en", "text": "The stock market is itching to make new highs, and it may soon, as long as progress continues to appear to be made on the trade war front. Technical market analysts, who watch stock charts, see an opportunity for stocks to break above previous highs, after the S&P 500 rose above its 50-day moving average last week and crossed above August highs, two signals of positive momentum. For fundamental analysts, there are other positives in place for stocks, including a possible bottom in interest rates, central bank easing and a pick up in some economic data. But the one wild card is the trade war, which appears to be making progress with talks planned for October between U.S. and Chinese officials. The S&P 500 is about 1.7% away from its late July high of 3,027.98, and stocks have recently been driven higher by strength in technology and consumer discretionary stocks. Both sectors are within 2% of all-time highs. \"Technically, it set itself up, and now it has to keep itself there,\" said Scott Redler, partner with T3Live.com. \"For the camp that wants to see new all-time highs, they would like to see the S&P 500 to hold 2,940 to 2,955. The longer it holds that, the more likely it will be make 3028, the all-time high.\" September has started off on positive footing after August's decline. Usually a weak month, the S&P 500 was up 1.7% so far for September, as of Monday. On Monday, the S&P closed at 2,978, down 0.2%. Stocks started Monday higher, but were mixed to flattish in afternoon trading, as technology stocks gave up some gains. Small caps, however, were outperforming, with the Russell 2000 up 1.2% in afternoon trading. Small caps are a sector that has been lagging and was expected to rise as the market returned to its highs. Bond yields, which have moved to worrisome low levels in August, have been higher in September. The 10-year Treasury was yielding 1.63% Monday afternoon.\n\n'Shakeout summer'\n\n\"Last week's action was meaningful from a trading basis, in that we broke above the August range, the upper end of the range being 2,940,\" on the S&P 500, said Ari Wald, technical analyst at Oppenheimer. \"I think the underappreciated point for us is the market is coming off cyclically oversold levels.\" in the past 52 weeks, the S&P has moved higher by just 2.75%, he added. \"After such little market progress, we're starting to see signs conditions are getting better and global equities are beginning to base in a move higher,\" said Wald. He said the market is still reacting to last year's sell-off, and is now in a position for a move higher. \"When it's done raining, it's still wet outside, and that's what we had in 2019. The storm was in 2018 when we had the big downturn in December,\" Wald said. \"2019 has been base building... It was our case there would be a shakeout summer.\" Wald said there is also a negative attitude on the part of investors, which could act as a contrarian positive. \"The way things are shaping, I think we could experience a nice run up in the equity market in the next 12 months. Clients, and investors, are just coming up with every reason possible not to buy stocks. it's very telling, on a contrarian basis,\" he said.\n\nTrump tweets\n\nJames Paulsen, chief investment strategist at Leuhtold Group, said there are fundamental factors at work, that are also helping stocks and could push them to highs. \"It's near an all-time high but a mid-morning tweet could put it back,\" said Paulsen, adding that the trade headlines have created turbulence for stocks. Strategists say tweets from President Donald Trump could move the market in either direction, and recently his trade tweets have been more negative than positive. \"It does seem, since the Trump tweet [on trade] in early August...the biggest thing that's changed since then is the global economic reports have gotten better on average,\" said Pauslen. Paulsen said he has been watching economic surprise indexes, and they are rising globally. The indexes measure beats against misses on economic data, and when they are positive it is perceived as good news for the stock market. \"Momentum might be improving. Along with that is recession fears are receding. Rates are going back up,\" said Paulsen. When rates hit very low levels in August, the move reflected fears of a recession and stocks were also shaky. Paulson said the improvement in the economic data is coming as some prior central bank easing is having an impact. \"We're focused on the Fed and the ECB, but there's been easing for nine months, and that's starting to come home to roost.\" But he cautions that if the yield curve does not steepen and is inverted that could undermine investor confidence, since it is a recession warning. The yield curve is inverted when short term intrest rates are higher than long duration rates. He said the Fed should cut rates by 50 basis points to help the process. The European Central Bank meets this week and it is expected to take some action to possibly cut its already negative yields and boost its asset purchase program. The Fed meets next week, and it is expected to cut interest rates at least by a quarter point. JP Morgan equity strategists expect the stock market to rise into year end, and they see a list of reasons to be positive about. \"Better technicals, light positioning, more favourable seasonals, signs of a trough inactivity momentum, potential de-escalation in trade uncertainty, 2nd Fed cut— which might move ahead of market expectations this time, and finally the up coming restart of ECB's QE are likely to be the positive catalysts for this up move, in our view,\" the strategists wrote in a note.\n\nU.S. economic surprise index", "description": "The stock market is itching to make new highs, and it may soon, as long as progress continues to appear to be made on the trade war front.", "authors": ["Patti Domm"], "top_image": "https://image.cnbcfm.com/api/v1/image/106074382-1565622763348rts2masx.jpg?v=1565622826", "published_at": "2019-09-09"}