{"pub": "cbs", "title": "Brain trauma suffered by U.S. diplomats abroad could be work of hostile foreign government", "url": "https://cbsnews.com/news/brain-trauma-suffered-by-u-s-diplomats-abroad-could-be-work-of-hostile-foreign-government-60-minutes-2019-09-01", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:33:53.505471+00:00", "text": "In 2016 and 2017, 25 Americans, including CIA agents, who worked in the U.S. Embassy in Cuba suffered serious brain injuries causing impaired vision and memory loss among other persistent problems. Now we have learned that at least 15 American officials in China suffered unexplained brain trauma soon after. As we first reported in March, the FBI is now investigating whether these Americans were attacked by a mysterious weapon that leaves no trace. Over many months we have been collecting evidence of what appears to be a hostile foreign government's plan to target Americans serving abroad and their families.\n\nMark Lenzi: For me it was November of 2017, when I started to feel lightheaded a lot. I was getting more headaches, my wife was getting headaches too.\n\nMark Lenzi\n\nMark Lenzi is a State Department security officer who worked in the U.S. Consulate in Guangzhou, China. He says that he and his wife began to suffer after hearing strange sounds in their apartment.\n\nMark Lenzi: Picture holding a marble. Then, picture if you had like a six foot in diameter funnel, metal funnel. The sound that marble would make as it goes around and it progressively gets faster as it gets, goes down towards the hole at the end. It's a sound like I've never heard before.\n\nScott Pelley: Was this subtle? Like, \"Did I hear that?\"\n\nMark Lenzi: No. It was, it was actually somewhat loud. I heard it about three or four times. Always in the same spot. Always over my son's crib and always right before we would go to bed.\n\n\"This was a directed, standoff attack against my apartment.\"\n\nLenzi wears prescribed glasses because sensitivity to light is among his persistent symptoms.\n\nMark Lenzi: The symptoms were progressively getting worse with me. My headaches were getting worse. The most concerning symptom for me was memory loss, especially short-term memory loss.\n\nMark Lenzi believes he was targeted because of his work. He uses top secret equipment to analyze electronic threats to diplomatic missions.\n\nMark Lenzi: There is no shadow of a doubt in my mind that this was a directed attack against my neighbor and I.\n\nHis neighbor was Catherine Werner, who lived one floor up. She's a U.S. Commerce Department trade officer who promoted American business from the Guangzhou Consulate.\n\nCatherine Werner\n\nCatherine Werner: I woke up in the middle of the night. I could feel this sound in my head. Um, it was intense pressure on both of my temples. At the same time, I heard this low humming sound, and it was oscillating. And I remember looking around for where this sound was coming from, because it was painful.\n\nScott Pelley: When did you first notice that you weren't feeling well?\n\nCatherine Werner: October of 2017, I started to get hives all over my body. Really bad hives. I woke up with headaches every day. Um, I started to feel tired. The simplest things would just make me very, very tired.\n\nScott Pelley: Were these symptoms growing worse over time?\n\nCatherine Werner: They were. Yes. My symptoms would get so bad that I would throw up, or I would wake up with nosebleeds.\n\nShe says even her dogs were throwing up blood. Werner assumed her illness was connected to China's toxic smog. She didn't know it at the time but her symptoms were the same that American officials in Havana had suffered since 2016. The U.S. Embassy there is all but closed as a result.\n\nThe U.S. Embassy in Havana, now all but closed\n\nCatherine Werner: We hadn't heard about what happened in Cuba. I mean, there were headlines in the news about hearing loss and um, attacks to our diplomats, but we didn't know the details.\n\nCatherine Werner became so ill, her mother traveled from the U.S. to live with her.\n\nCatherine Werner: She spent almost three months with me. During that time she also got very ill. Um, and she and I shared the same symptoms.\n\nScott Pelley: What sort of symptoms did your mother have?\n\nCatherine Werner: Headaches and um, ringing in our ears. Um, we also started to both um, have difficulty recalling words.\n\nAfter reporting her experiences, Werner was medically evacuated to the U.S. for treatment. U.S. agencies are investigating, but Mark Lenzi has a theory.\n\nMark Lenzi: This was a directed standoff attack against my apartment.\n\nScott Pelley: It was a weapon?\n\nMark Lenzi: Oh, of course it was a weapon.\n\nScott Pelley: An energy weapon--\n\nMark Lenzi: Absolutely.\n\nScott Pelley: What sort of energy is this that we're talking about?\n\nMark Lenzi: I believe it's RF, radio frequency energy, in the microwave range.\n\nA clue that supports that theory was revealed by the National Security Agency in 2014. This NSA statement describes such a weapon as a \"high-powered microwave system weapon that may have the ability to weaken, intimidate, or kill an enemy over time without leaving evidence.\" The statement goes on to say \"…this weapon is designed to bathe a target's living quarters in microwaves.\" The NSA disclosed this in a worker's compensation case filed by former NSA employee Mike Beck.\n\nScott Pelley: When you look back across your career is there any incident that leads you to believe that it could be responsible for your Parkinson's disease?\n\nMike Beck: Yes.\n\nMike Beck\n\nIn the 1990's Beck and an NSA co-worker were on assignment overseas. Years later, he says they developed Parkinson's Disease at the same time.\n\nMike Beck: In 1996 a colleague of mine, Chuck Gubete, and I traveled to a hostile country and worked there for about a week. And um, I can't say where the hostile country-- the identity of it.\n\nScott Pelley: Because it's still classified?\n\nMike Beck: Yes.\n\nBut it was not Cuba or China.\n\nScott Pelley: You believe that you and Chuck Gubete were attacked with this microwave weapon?\n\nMike Beck: Yes. I had a pretty good working knowledge of the hostile country's intelligence services, what they do to people, what they have done, what their modus operandi is.\n\nMike Beck says more intelligence has come in recently which he shared in a classified briefing with congressional investigators.\n\nScott Pelley: Mike, you can't discuss any of these details because they're all classified. But in your opinion, does the new information that you briefed the House and Senate Intelligence Committee staff on in any way relate to what happened in Cuba and China?\n\nMike Beck: It's relevant to the Cuba and China cases.\n\nIs an invisible weapon targeting U.S. diplomats?\n\nNo one has officially confirmed that what Beck says happened to him is related to at least 40 Americans injured in China and Cuba. While Beck suffers from Parkinson's the recent patients are being treated for the same kind of symptoms that doctors would expect from a concussion. Dr. Teena Shetty is Mark Lenzi's neurologist.\n\nDr. Teena Shetty: So Mark initially came to me reporting symptoms of headache, memory loss, sleep difficulties, emotionality, and irritability.\n\nScott Pelley: And what did you make of that in the early days?\n\nDr. Teena Shetty: I was very surprised. He did not have any history of any trauma or blow to his head, but he reported a constellation of neurologic symptoms which are characteristic of mild traumatic brain injury, without any history of associated head trauma.\n\nExactly how their brains were injured is the subject of a study at the University of Pennsylvania Center for Brain Injury and Repair. Dr. Shetty is not part of that study, but her patient, Mark Lenzi, is.\n\nDr. Teena Shetty: The presumption is that something happened which caused a functional brain injury of widespread brain networks because he has symptoms to reflect a multitude of brain networks.\n\nWhat Dr. Shetty describes mirrors the findings published so far by the University of Pennsylvania study.\n\nRobyn Garfield: They have said that our symptoms are exactly what they saw in Cuba, and that we have the full suite of findings that they had there.\n\nRobyn and Britta Garfield\n\nRobyn and Britta Garfield are among the 40 patients enrolled in the University of Pennsylvania study. Like Catherine Werner, Robyn Garfield is a trade officer with the Commerce Department. He was posted with his wife and two young children in Shanghai.\n\nRobyn Garfield: I don't know when the sound started. Um, I do know that it was for months on end.\n\nBritta Garfield: I was sitting next to Robyn and something I felt like hit me from the left side. Um, and at first it felt like an electric shock um, and then it paralyzed me, so I was not able to move or speak.\n\nScott Pelley: It hit you so hard you felt like you were in danger in the room?\n\nBritta Garfield: Yes.\n\nThey say the children suffered blurred vision and loss of balance.\n\nScott Pelley: Your daughter was literally falling down?\n\nRobyn Garfield: Yes. She fell down multiple times that day.\n\nBritta Garfield: We went on a walk and she just fell on her face. It was very abnormal. She never does that. And then a second time she completely lost her balance and just fell to the side.\n\nIn 2018, the secretary of state, Mike Pompeo, confirmed the case of Catherine Werner. U-Penn found her brain injuries matched the Cuba victims.\n\nMike Pompeop on May 23, 2018: We had an incident in Guangzhou that the medical indications are very similar and entirely consistent with the medical indications that have taken place to Americans working in Cuba.\n\nBut for reasons that are unclear, the State Department is raising doubt about the other 14 China cases. The State Department's medical office sent Mark Lenzi this note that says, \"We have reached the decision that your symptoms and findings do not correlate with the Havana cohort.\"\n\nMark Lenzi: They tried to deny it. They tried to cover it up. They tried to minimize it.\n\nScott Pelley: Why would the State Department minimize this?\n\nMark Lenzi: Because it's China, because we have such a large trade relationship with them. You can push around Cuba. Their trade, you know, relations are minimal. With China, that's a different beast. Right?\n\nState Department doctors told Robyn Garfield his illness stems from a baseball injury 17 years ago, which does not explain his wife and children.\n\nRobyn Garfield: It is a very complicated geopolitical relationship between the U.S. and China. So that, to me, feels like why this determination's being made.\n\nScott Pelley: What does it mean for your benefits today that the State Department is refusing to call this an attack?\n\nRobyn Garfield: It has significant impact on our, our life. Our finances. My career as well, likely. I have not been afforded time for my rehabilitation. Being classified as a preexisting injury means that I don't have access to paid leave. It also means that after one year my medical bills will not be covered currently.\n\nThe China patients have the attention of at least one member of the Senate Foreign Relations Committee. Jeanne Shaheen wrote Secretary Pompeo, \"The group from China is increasingly feeling isolated and left behind by… the State Department.\"\n\nFeb. 1, 2019 letter from Sen. Shaheen to State about attacks\n\nThe State Department declined an interview, but in a statement to 60 Minutes it said, \"We will continue to provide our colleagues the care they need, regardless of their diagnosis or the location of their medical evacuation.\" A State Department official told us that the Cuba patients are victims of an attack. But State hasn't made the same determination for the China patients. The department has asked the National Academies of Science to assist in the medical investigation.\n\nState Department statement in response to questions from 60 Minutes for this report\n\nThe FBI is also investigating. Intelligence sources told us that in addition to Cuba and China, Russia is a suspect. But if microwaves were used, the technology is not rare. It could be more than one country is using it. U.S. Intelligence is still debating what caused the injuries.\n\nScott Pelley: You were in harm's way and you didn't know it.\n\nCatherine Werner: Exactly. I didn't know it, and I'm afraid that others may be in harm's way and may not know it. I don't know what the future looks like for me. But I would do anything in my power to prevent this from happening to somebody else serving their country.\n\nIn July, the medical team from the University of Pennsylvania published a second study about the victims from Cuba. Using advanced brain imaging, they were able to present the first scientific evidence that the diplomats did in fact have physical damage to the structure of their brains.\n\nProduced by Michael Rey, Oriana Zill de Granados and Robert G. Anderson. Associate producers, Emily Gordon and Aaron Weisz.", "description": "Since 2016, dozens of American officials have come home from Cuba and China with unexplained brain trauma. Evidence shows it may be the work of another government using a weapon that leaves no trace", "authors": ["Scott Pelley"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/03/17/99366ec8-55a4-47f9-a91c-82a0827825ae/thumbnail/1200x630/0c4b4d81c8058d1c108978de0d47a2b2/consulate-sign-shanghai.jpg"}