{"pub": "thehill", "url": "https://thehill.com/homenews/senate/464865-senate-intel-report-finds-kremlin-directed-russian-social-media-meddling-in", "downloaded_at": "2019-10-09 00:54:20.819445+00:00", "title": "Senate Intel report urges action to prevent Russian meddling in 2020 election", "language": "en", "text": "In a bipartisan report , the panel said Congress should consider legislation to increase the transparency of political advertisements on social media. It also called on social media companies to improve efforts to notify users of exposure to disinformation, three years after Russian actors directed by the Kremlin interfered in the 2016 presidential election.\n\nADVERTISEMENT \"This challenge requires an integrated approach that brings together the public and private sectors,\" the committee wrote. \"This approach must be rooted in protecting democratic values, including freedom of speech and the right to privacy. The Federal government, civil society, and the private sector, including social media and technology companies, each have an important role to play in deterring and defending against foreign influence operations that target the United States.\"\n\nThe report is the second volume to be released as part of the committee’s two-year investigation into Russia's interference in the 2016 election. The first volume, released in July, focused on Russian efforts to interfere in U.S. voting infrastructure.\n\nThe panel recommended Tuesday that the Trump administration “reinforce with the public the danger of attempted foreign interference in the 2020 election,” such as establishing an interagency task force to monitor foreign use of social media to spread disinformation.\n\nSchumer also criticized McConnell for \"hindering a full response\" to election vulnerabilities ahead of the 2020 elections, saying that McConnell \"continues to block a full-throated U.S. response today by burying meaningful election security bills in his legislative graveyard.\"\n\nThe panel cited the “close-ties” of Yevgeny Prigozhin, the director of the IRA, to Russian President Vladimir Putin as evidence of “significant Kremlin support, authorization, and direction of the IRA’s operations and goals.”\n\nThe committee wrote that IRA social media disinformation efforts were part of a “broader, sophisticated, and ongoing information warfare campaign designed to sow discord in American politics and society,” and noted that IRA activity involved in spreading malicious content on Facebook, Twitter, Instagram and YouTube increased after Election Day 2016.\n\nThe IRA aimed disinformation on social media at African Americans “more than any other age group or demographic” in order to exploit “hot-button issues with racial undertones,” according to the committee, through the use of Instagram accounts, Facebook pages and Twitter trends.\n\nAs part of efforts to target black Americans, the report detailed how IRA operatives posing as American activists convinced some individuals to sign petitions and to sign up for self-defense classes. The committee cited this an example of ways the IRA “furthered its reach” from the digital to the physical world.\n\nADVERTISEMENT\n\nThe panel said that the IRA carried out “a social media campaign designed to provoke and amplify political and social discord in the United States” with the goal of favoring Trump over Clinton.\n\nAs part of his probe, Mueller indicted 13 Russian individuals and three businesses for “information warfare against the United States,” including Prigozhin. Last month, Prigozhin, who is known as “Putin’s chef” due to his catering company’s use by the Kremlin, was also sanctioned by the Treasury Department for his efforts to interfere in the 2018 midterm elections.\n\nThe committee recommended various steps to take to prevent these types of interference efforts from happening again, including that Congress “consider whether any existing laws may hinder cooperation and whether information sharing should be formalized,” and that Congress “consider legislation to ensure Americans know the source behind online political advertisements, similar to existing requirements for television, radio, and satellite ads.”\n\nCommittee Chairman Richard Burr Richard Mauze BurrHealth advocate predicts Trump administration won't follow through on vaping measures Trump takes heat from right over vaping crackdown Donald Trump thinks you're dumb MORE (R-N.C.) said in a statement that “Russia is waging an information warfare campaign against the U.S. that didn’t start and didn’t end with the 2016 election.\"\n\nBurr noted that Russia’s goal is “broader: to sow societal discord and erode public confidence in the machinery of government. By flooding social media with false reports, conspiracy theories, and trolls, and by exploiting existing divisions, Russia is trying to breed distrust of our democratic institutions and our fellow Americans.”\n\nSen. Mark Warner Mark Robert WarnerDonald Trump thinks you're dumb Iran-linked group targeted email accounts for US presidential campaign, government officials Hillicon Valley: Clapper praises whistleblower complaint | Senators urge social media giants to take action against 'deepfakes' | Tim Cook asks Supreme Court to protect DACA | Harris pushes Twitter to suspend Trump MORE (Va.), the top Democrat on the committee, emphasized in a statement that “there’s no doubt that bad actors will continue to try to weaponize the scale and reach of social media platforms to erode public confidence and foster chaos. The Russian playbook is out in the open for other foreign and domestic adversaries to expand upon – and their techniques will only get more sophisticated.”\n\nBoth Burr and Warner recommended various steps that Congress, social media companies and law enforcement should take to prevent or lessen social media interference efforts during future elections, with Burr emphasizing the need for stakeholders to “work together” and for Americans to “use social media responsibly, as discerning and informed consumers.”\n\nWarner advocated for Congress to “step up and establish guardrails to protect the integrity of our democracy,” while also demanding “transparency” from social media companies on the content users are exposed to, and making sure these companies take steps to identify non-authentic users.\n\n“It’s our responsibility to listen to the warnings of our Intelligence Community and take steps to prevent future attacks from being waged on our own social media platforms,” Warner said.\n\nThe panel is expected to release three more volumes detailing the findings of its probe this fall, including those on its findings regarding the intelligence community’s assessment of Russian interference, the Obama administration’s response to Russian interference and on whether there was coordination between the Trump campaign and Moscow sometime in the fall leading up to Election Day.\n\nSen. Kamala Harris Kamala Devi HarrisDemocratic candidates' polling and fundraising numbers don't quite match up 2020 Democrats hit Trump's planned Syria withdrawal Harris pitches six months of paid family, medical leave MORE (D-Calif.), who is running for the 2020 Democratic presidential nomination, put out a statement after the report was released, calling on social media companies to “step up their efforts to fight disinformation and remove inflammatory content on their platforms, including by ensuring their workforces are diverse enough to identify and understand the cultural nuances that foreign actors exploit to divide and harm Americans.”\n\nHarris also urged Trump to “stop playing into our adversaries’ hands,” saying that “with every dishonest and inflammatory tweet, the president advances the interests of our adversaries by dividing the American people. This bipartisan report should cause social media companies to seriously question the role they play in advancing the president’s dangerous rhetoric.”\n\nLast month, Harris called on Twitter to suspend Trump’s twitter account after his attacks on the anonymous whistleblower who came forward recently alleging election interference efforts by Trump.\n\nSen. Amy Klobuchar Amy Jean KlobucharKlobuchar pulls in nearly million in third quarter, campaign says Klobuchar hits Booker on fundraising: 'I'm not going to put out threats about getting out of it' Klobuchar compares Trump's handling of Ukraine phone call to Watergate MORE (D-Minn.), another 2020 Democratic presidential candidate and the ranking member of the Senate Rules Committee with jurisdiction over election security, also spoke out on Tuesday during an event in Minneapolis in support of passing election security legislation following Russian interference efforts in 2016.\n\n“We have a common set of facts about what happened, and we know that there is a continued threat against our democracy,” Klobuchar said. “What we need to do now is address these facts with a common purpose — to protect our democracy and make sure our election systems are resilient against future attacks.”", "description": "The Senate Intelligence Committee on Tuesday recommended a set of sweeping steps for Congress, President Trump and social media companies to take to prevent Russian disinformation efforts from impairing the 2020 elections.", "authors": [], "top_image": "https://thehill.com/sites/default/files/kremlin_031618upi3_lead.jpg", "published_at": "2019-10-08"}