{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/08/over-30-civil-rights-groups-demand-an-end-to-amazon-rings-police-partnerships", "downloaded_at": "2019-10-08 16:18:04.972987+00:00", "title": "Over 30 civil rights groups demand an end to Amazon Ring’s police partnerships – TechCrunch", "language": "en", "text": "Over 30 civil rights organizations have penned an open letter that calls on government officials to investigate Amazon Ring’s business practices and end the company’s numerous police partnerships. The letter follows a report by The Washington Post in August that detailed how over 400 police forces across the U.S. have partnered with Ring to gain access to homeowners’ camera footage.\n\nThese partnerships have already raised concerns with privacy advocates and civil liberties organizations, who claim the agreements turn neighbors into informants and subject innocent people to greater risk and surveillance.\n\nHad the government itself installed a video network of this size and scope, it would have drawn greater scrutiny. But by quietly working with Ring behind the scenes, law enforcement gets to tap into a massive surveillance network without being directly involved in its creation.\n\nThe new letter from the civil rights groups demand that government officials put an end to these behind-the-scenes deals between Amazon and the police.\n\n“With no oversight and accountability, Amazon’s technology creates a seamless and easily automated experience for police to request and access footage without a warrant, and then store it indefinitely,” the letter reads. “In the absence of clear civil liberties and rights-protective policies to govern the technologies and the use of their data, once collected, stored footage can be used by law enforcement to conduct facial recognition searches, target protesters exercising their First Amendment rights, teenagers for minor drug possession, or shared with other agencies like ICE or the FBI,” it says.\n\nAdditionally, the letter points out these police deals involve Amazon coaching cops on how to obtain surveillance footage without a warrant. It also notes that Ring allowed employees to share unencrypted customer videos with each other, including in offices based in Ukraine. And it raises concerns about Amazon’s potential plans to integrate facial recognition features into Ring cameras, based on patents it filed.\n\nThe groups also point to the map released by Amazon Ring, which now shows over 500 cities with Amazon-police partnerships across the U.S.\n\nThe groups’ letter is not the first to demand action.\n\nSenator Edward J. Markey (D-Mass.) also last month wrote to Amazon to get more information about Ring and its relationships with law enforcement agencies.\n\nBut unlike Sen. Markey’s investigative letter to Amazon’s Ring, today’s letter has specific demands for action. The groups are asking mayors and city council members to require their local police departments to cancel their Ring partnerships. The groups also want local government officials to pass new surveillance oversight ordinances that will ensure police departments can’t enter into any such partnerships in the future.\n\nAnd they want Congress to investigate Ring’s dealings with police more closely.\n\nThe letter itself was published online and signed by the following organizations:\n\nFight for the Future, Media Justice, Color of Change, Secure Justice, Demand Progress, Defending Rights & Dissent, Muslim Justice League, X-Lab, Media Mobilizing Project, Restore The Fourth, Inc., Media Alliance, Youth Art & Self Empowerment Project, Center for Human Rights and Privacy, Oakland Privacy, Justice For Muslims Collective, The Black Alliance for Just Immigration (BAJI), Nation Digital Inclusion Alliance, Project On Government Oversight, OpenMedia, Council on American-Islamic Relations-SFBA, Million Hoodies Movement for Justice, Wellstone Democratic Renewal Club, MPower Change, Mijente, Access Humboldt, RAICES, National Immigration Law Center, The Tor Project, United Church of Christ, Office of Communication Inc., the Constitutional Alliance, RootsAction.org, CREDO Action, Presente.org, American-Arab Anti-Discrimination Committee, and United We Dream.\n\nAccording to Evan Greer, Deputy Director at Fight for the Future, the letter has not yet been mailed. But the plan, going forward, is to use it in local organizing when groups on the ground make deliveries to local officials in cities where the partnerships are live.\n\n“Amazon has created the perfect end-run around our democratic process by entering into for-profit surveillance partnerships with local police departments. Police departments have easy access to surveillance networks without oversight or accountability,” said Greer. “Amazon Ring’s customers provide the company with the footage needed to build their privately owned, nationwide surveillance dragnet. We’re the ones who pay the cost – as they violate our privacy rights and civil liberties. Our elected officials are supposed to protect us, both from abusive policing practices and corporate overreach. These partnerships are a clear case of both,” Greer added.", "description": "Over 30 civil rights organizations have penned an open letter that calls on government officials to investigate Amazon Ring’s business practices and end the company’s numerous police partnerships. The letter follows a report by The Washington Post in August that detailed how over 400 police forces across the U.S. have partnered with Ring to gain […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/ring-doorbell.jpg?w=601", "published_at": "2019-10-08"}