{"pub": "fox", "url": "https://foxnews.com/opinion/lessons-learned-church-doughnuts-mike-kerrigan", "downloaded_at": "2019-10-13 09:54:54.572673+00:00", "title": "Mike Kerrigan: Lessons learned from church and doughnuts", "language": "en", "text": "Ronald Reagan believed if you want more of something, subsidize it, and if you want less of something, tax it. My father, then a nascent Reagan Democrat, strongly agreed with the principle. So strongly, in fact, that it factored into my childhood introduction to Roman Catholicism.\n\nTo instill in his children a lifelong habit of attending Mass on Sundays, dad frequently stopped at a bakery on the way home from church. In Boston of the late '70s, pastries could be found on every corner, so it was easy. While the family waited inside his silver Ford Granada – the red interior of which foreshadowed frosted ambrosia to come – dad would run in and grab a dozen doughnuts.\n\nHe did this mainly with me, his middle child, in mind. My younger brother and older sister, who each needed less spiritual get-up-and-go, were unaffected by the ruse. On me, whose love of the sweetened dough was unrequited, the subsidy worked well.\n\nKELLY SHACKELFORD: NEW SUPREME COURT TERM WILL SIGNAL IF RELIGIOUS LIBERTY IS MAKING A COMEBACK\n\nPerhaps it worked a little too well. Often during the Gloria, my mind wandered not to eternal glories but more temporal ones to come, such as maple frosting and Boston cream. Communion hymns like “Taste and See” were mildly distracting, while recessionals like “This is the Feast of Victory for Our God” practically had me licking my chops.\n\nThe levy dad imposed was a simple one – five laps around the house for each additional doughnut I desired to eat.\n\nThe distracted devotion did not disturb my dad, who saw his primary job as putting the posteriors of posterity in the pews. A deeper understanding of the Mass, he reasoned, would grow in time. Was Thomas Aquinas, after all, dialed into the liturgy so young out of saintliness, or because crullers didn’t yet exist?\n\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\n\nThe old man’s plan worked. By the time we got home, though, his subsidy had created a new problem: I couldn’t stop at just one doughnut. We were a family of five, so after everyone had eaten their allotment, seven savory sirens still sang sweetly from the counter.\n\nA tax on my subsidized behavior was now in order. The levy dad imposed was a simple one – five laps around the house for each additional doughnut I desired to eat. If it was meant to deter me it failed, as I viewed perimeter-running simply as a cost of doing business.\n\nI’d lace up my shoes, race around the course and devour my reward, repeating until satisfied. I don’t recall ever trading a full 35 laps for the extra baker’s half dozen, although I probably came close a few times.\n\nIt seems my dad was better at subsidizing than taxing. Or perhaps he enjoyed looking up from Red Sox box scores to see his hefty kindergartener dart past the kitchen window every minute or so. That must be why he didn’t just buy a half-dozen.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nOur next-door neighbors, lovely people, were not Catholic. They probably questioned the strange ritual they saw play out over the hedges Sunday after Sunday in our yard.\n\nI hope they’re reading this and see I turned out okay. I don’t much care for long distance-running, but I have grown in my love of the Holy Mass. And doughnuts.\n\nCLICK HERE TO READ MORE FROM MIKE KERRIGAN", "description": "To instill in his children a lifelong habit of attending Mass on Sundays, dad frequently stopped at a bakery on the way home from church.", "authors": ["Mike Kerrigan", "Mike Kerrigan Is An Attorney In Charlotte"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/doughnut-stack-istock-1280.jpg", "published_at": "2019-10-06"}