{"pub": "washingtonpost", "url": "https://washingtonpost.com/health/new-parents-join-a-real-movement-for-their-babies-and-themselves-hiking/2019/09/06/8d4e15dc-b87a-11e9-a091-6a96e67d9cce_story.html", "downloaded_at": "2019-09-07 14:41:15.846827+00:00", "title": "New parents join a real movement for their babies and themselves: Hiking", "language": "en", "text": "Six-year-old Mason Hodges can rattle off any number of plant and animal species when out in the woods, his knowledge deeper than many adults. He’s also environmentally aware and understands he should treat the Earth with respect.\n\nHis mother, 47-year-old Shanti Hodges, credits this to how he’s been hiking with her since birth. Shanti is the accidental founder of a movement that is now well over 200,000 families strong. Hike it Baby began right after Mason was born, when Utah-based Shanti found herself feeling cooped up indoors and out of touch with the hiking community she loved.\n\n“When I had Mason, I knew it would feel isolating,” she says, “but I didn’t expect to feel like I had no friends or that I couldn’t get out into nature.”\n\nHodges knew about various active mom groups, such as Stroller Strides, but that wasn’t what she was after. “I didn’t want to work out, I just wanted to get outside,” she says. “I knew it would be good for me and for the baby.”\n\nWhile the outside part was key, so too was the socialization she could find with a group of like-minded newer parents.\n\n“You can try meetup groups, but they end,” Hodges says. “I wanted to be part of an ongoing community. When we’re out there, we help each other with the kids, our energy is lighter and we feel better after.”\n\nThe new mom got things rolling by inviting a few others to meet up with their babies and young children at a local trail. In short order, their numbers swelled. Hodges named the group Hike it Baby, started a newsletter and found her tribe. Six years in, she says, Hike it Baby has been good for both her and Mason.\n\n“Right away, Mason was easier to manage,” she says. “He was happier, we got along better, and I was able to spend time with other adults with an appreciation for the outdoors.”\n\nResearch backs up what Hodges intuited — that nature is good for kids on many levels. A recent systematic review in Health Place found that immersive nature experiences for children benefits self-esteem, self-efficacy, resilience and academic-cognitive performance.\n\nLawrence Rosen, a pediatrician and founder of the Whole Child Center, agrees. “It’s never too early to get kids outside,” he says. “We always want evidence of safety when prescribing things for babies and young children, but there are also things we just know, and this is one of them.”\n\nRosen points to the many benefits children and families can garner from time in nature. “We know from thousands of years of experience in a variety of cultures that families who are more connected to nature tend to be happier and healthier,” he says. “You are away from electronics and pollution, and you forge community with others.”\n\nThere’s also the sleep factor with babies and young children, who are notorious for depriving parents of the same, he says.\n\n“Being outside in the fresh air, running around and exploring promotes good sleep,” Rosen says.\n\nHodges has found this to be true with Mason.\n\nCollin O’Mara, president and chief executive of the Reston, Va.-based National Wildlife Federation, says the same applies to his children, ages 2 and 7. “Their sleep definitely improves after outdoors time,” he says.\n\nO’Mara and his wife have made outdoors time a priority for their family from the start, he says.\n\n“We want to encourage a lifelong love of nature because it has so many auxiliary benefits,” he says. “It helps children develop critical thinking and gives them hands-on learning, all of which [can] lead to improved ability with math and science when they enter school.”\n\nIn an era where so much of children’s lives are scheduled and scripted, O’Mara values the creativity his children develop in nature.\n\n“Take a kid to a playground and they’ll get bored after a little while,” he says. “But take them to the woods and they will play for hours and never tire of it. A rock, for instance, can take on multiple roles over several hours.”\n\nRosen says that by taking children into the great outdoors, parents are modeling healthy habits. “From birth, kids pick up on their parents’ physical activity levels and mind-set,” he says. “If you get your kids out early, they will follow suit.”\n\nFor many new parents, the idea of getting their babies and young children outside might hold appeal, but can feel intimidating. On a practical level, Rosen says parents with access to parks and forests should consider sun protection, checking for ticks and proper clothing for the temperature.\n\nHodges has learned from experience how to make hiking with babies an easier experience. “It’s easy to think you need to bring everything when you have a baby,” she says. “But think about the distance and adjust your gear accordingly.”\n\nA short hike, for instance, might require that you bring little more than a diaper and a few wipes in a Ziploc bag.\n\n“One important tip is to always carry a plastic bag,” Hodges says. This will help keep dirty diapers and the like separated from everything else.\n\nFinding a community like Hike it Baby is also a good way to go. “Then if you do forget something, you have somebody there to back you up,” Hodges says. “Also, if you have older kids, they can help keep the younger kids hiking on and like the role of ‘leader’ to toddlers.”\n\nThink small when you first begin venturing out.\n\n“Don’t try to get epic when you first start hiking with a baby,” Hodges says. “Go for things around your neighborhood. While you might have been an avid hiker pre-baby, things are different, especially in the beginning with a new baby or toddler.”\n\nBut take heart, keep at it and before you know it, your child will be leading the way when it comes to the outdoors.\n\nSays O’Mara: “Given a choice between going fishing and watching the latest Disney movie, our kids will choose fishing every time. They’re waiting to get outdoors as soon as they’re up.”\n\nRead more\n\nPlaying outside seems to help kids’ vision\n\n10 ways to help kids fall in love with being outside\n\nPeople who spend more time outdoors lead more fulfilling lives, research shows", "description": "Outdoors group finds that nature is good for their kids on many levels.", "authors": ["Amanda Loudin", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/UHx-w51QGhzoHWySc3ws7g_hMpE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EOL2ZGF7OMI6TKFQP3MKBVO4LU.jpg", "published_at": "2019-09-06"}