{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/17/corey-lewandoski-blast-democrats-opening-remarks", "downloaded_at": "2019-09-17 23:24:59.353019+00:00", "title": "Corey Lewandowski blasts Democrats in opening remarks", "language": "en", "text": "Former Trump campaign manager Corey Lewandowski will offer a vigorous defense of the president when he testifies before the House Judiciary Committee Tuesday, according to opening remarks obtained by The Washington Times.\n\nMr. Lewandowski will come out of the gate swinging at Democrats, pointing a finger at the Obama-era intelligence community for failing to stop Russian meddling in the 2016 election.\n\n“The Obama-Biden administration and the intelligence community, overseen by James Clapper, Jim Comey and John Brennan had the responsibility to the American people o ensure the integrity of the 2016 election,” he plans to say. “I leave it to this committee and the American public to decide how successful - or not - they were in doing this jobs.”\n\nAnd Mr. Lewandowski intends to blame Democrats, accusing them of taking the nation down a “rabbit hole” of Russian collusion allegations fueled by “Trump haters.”\n\n“As for actual ‘collusion’ or ‘conspiracy’ there was none,” the remarks say. “What there has been,however, is harassment of the president from the day he won the election.”\n\nMr. Lewandowski will also insist Trump campaign did not collude with Russia to influence the 2016 election, pointing to the conclusions of ex-special counsel Robert Mueller.\n\nMr. Mueller found no evidence of members of the Trump campaign colluded with Russia.\n\n“As the special counsel determined, there was no conspiracy or collusion between the Trump campaign and any foreign government, either on my watch or afterward,” the prepared remarks say. “Not surprisingly after the Mueller report was made public, interest in the Fake Russian collusion narrative has fallen apart.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Former Trump campaign manager Corey Lewandowski will offer a vigorous defense of the president when he testifies before the House Judiciary Committee Tuesday, according to opening remarks obtained by The Washington Times.", "authors": ["The Washington Times Http", "Seth Mclaughlin", "Jeff Mordock"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/17/trump_russia_probe_29349_c0-0-5146-3000_s1770x1032.jpg?4c3d9320447bca87cdfee1f027a25186cc8ccd1c", "published_at": "2019-09-17"}