{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/africa/mining-ghanas-bauxite-would-bring-in-billions-from-china-but-it-could-also-taint-the-water-for-5-million-people/2019/10/25/e4726518-e3a7-11e9-b0a6-3d03721b85ef_story.html", "downloaded_at": "2019-10-28 09:49:15.132312+00:00", "title": "Mining Ghana’s bauxite would bring in billions from China. But it could also taint the water for 5 million people.", "language": "en", "text": "Ghana’s leaders want to mine the bauxite, which they see as the country’s ticket to economic growth, thanks to a big-name partner — China. Campaigners and water experts say the environmental cost is too high: Mining would taint the water, they claim.\n\nAD\n\n“When you take the mountain off, you change the hydrology and ecology,” said Ronald Abrahams, a chief officer of the Water Resources Commission, the government agency tasked with managing the use of Ghana’s water resources. “It will not be the same. It will change everything, and we won't have a source of a river which is so reliable and has served this nation for ages.”\n\nAD\n\nGhana is looking to mine bauxite to uphold what it calls a barter deal with China’s Sinohydro Corp. Limited. Sinohydro delivers $2 billion worth of infrastructure projects across the country, which Ghana would pay back with proceeds from the sale of the refined bauxite. (The Ghanaian government’s plans include building a refinery to process the raw bauxite.)\n\nChina is the top buyer of minerals and rocks from Africa, pouring tens of billions of dollars into mining across the continent over the past decade — an investment that has fueled the country’s reign as the world’s largest aluminum producer.\n\nThe Asian powerhouse is also Africa’s biggest funder of infrastructure projects. It has pledged reams of cash for roads, bridges, power plants and oil refineries.\n\nThese buyer and funder identities often intersect as China offers big-ticket loans in exchange for access to lucrative resources in Ghana, Guinea, the Congo and beyond. But analysts say the high-profile deals, touted by both Chinese and African officials as a shared path to prosperity, rarely lift the continent’s poorest residents and can harm the environment.\n\nAD\n\nAD\n\nNeither the Chinese government, through its embassy in the Ghanaian capital, Accra, nor Sinohydro, which is a state-owned corporation, responded to requests for comment.\n\nMuch is unknown about the government’s mining plans in the Atewa, a 90-square-mile tract of mountainous forestland. The three major rivers that originate there — the Densu, Birim and Ayensu — provide drinking water to three regions of Ghana, including to the 1 million people in Accra.\n\nBauxite typically is found in the topsoil and extracted through strip mining, which requires removing layers of soil and rock to access the minerals below. Elsewhere, bauxite mining has had devastating consequences. A 2018 Human Rights Watch report on bauxite mining in Guinea found that the country’s dozens of open-pit operations had destroyed farmlands, damaged water sources, and coated homes and crops in dust.\n\nAD\n\nAD\n\nEnvironmental campaigners warn that if mining in the Atewa begins, runoff from the operations would contaminate the three rivers and smaller streams and would pollute surrounding areas with bauxite dust. Ultimately, they fear the evergreen forest — with its waterfalls and rare butterflies, frogs and monkeys — will disappear.\n\nTheir worries were reinforced in March when the U.S. Forest Service visited the Atewa to provide technical consultation to Ghana’s government. Its report said mining could lead to a “potential significant and permanent impact” on the forest reserve and its importance as a water source.\n\n“If the forest is gone, it means the rainfall pattern will change, and that means our livelihoods will change,” said Emmanuel Tabi, a local assembly representative for the area. His constituents live near the forest and rely on it for water for use at home and on their farms.\n\nThe U.S. report also pointed to what campaigners and those living in the communities surrounding the forest have complained of — a lack of transparency in the plans and how the impacts will be addressed.\n\nAD\n\nAD\n\nAbrahams, of the Water Resources Commission, said government representatives reassured him they were listening to concerns about the environmental impact at a workshop on bauxite mining and aluminum development this month. He hoped this meant the plans would be dropped.\n\nBut in public comments, Ghana’s leaders seem resolute on mining the forest.\n\nLands and Natural Resources Minister Kwaku Asomah-Cheremeh said in September that pilot exercises had shown the forest and water bodies would not be destroyed.\n\nHe was echoing comments made by Ghanaian President Nana Addo Dankwa Akufo-Addo, who dismissed claims that mining in the Atewa would threaten the creatures of the forest.\n\nAD\n\n“I am satisfied by what I have been told and what has been demonstrated to me that it is possible for us to get that red mud out without disturbing the wildlife that there is in the Atewa mountains,” he said at a sustainable development conference in May.\n\nAD\n\nThe government agency responsible for carrying out the plans, the Ghana Integrated Aluminum Development Corporation, did not comment for this story despite multiple requests.\n\nA robust opposition to the plan has formed. Ghanaian environmental activists and organizations walked for six days from Atewa to Accra in March 2018, carrying water from the forest. They have erected billboards and placed a notice in Ghana's national newspaper in an attempt to dissuade mining companies from bidding for bauxite mining concessions. A collection of Ghanaian civil society organizations is now considering filing a class-action suit to protect the forest from mining.\n\nAD\n\nKyebi, a community bordering the forest reserve, figured prominently in the last big fight over mining, in 2017. Ghana has long been known for its gold mining, but illegal small-scale mining so polluted bodies of water throughout Ghana that experts warned the country may have to import its water by 2020. A nationwide campaign followed, along with a temporary ban on all small mining operations.\n\nAD\n\nOne of the most outspoken critics of illegal mines? Akufo-Addo, the president.\n\nSome residents of nearby towns say a mine would bring jobs to the area, and with jobs would come workers buying goods and services, like 41-year-old Ama Gifty Asare’s roadside breakfast food in the town of Odumase.\n\nAD\n\n“I don’t have a problem with it, for employment’s sake,” Asare said. “I will get to trade more.”\n\nMany others say they don’t like the plans.\n\n“Five million people use that water. It passed from village to village and town to town,” said Mohammed Awudu, a 52-year-old farmer whose house in Kyebi is a short walk from one of the rivers flowing from the Atewa. “Most in the community can't say anything about it. Most of us don't like it, but we can't say anything because we don't have power.”\n\nAn environmental group called A Rocha Ghana has been leading the fight against the government’s plans, working to amplify voices like Awudu’s.\n\nAD\n\nOn the lawn of the organization’s outpost in Kyebi is a reddish-brown boulder of bauxite, a reminder of what campaigners want the government to keep in the ground. A poster of Akufo-Addo lines one of the walls inside the office, his face next to a quote from his 2017 inauguration speech:\n\n“We should all recognize the danger we face by the alarming degradation of our environment and work to protect our water bodies, our forests, our lands, and the oceans.”\n\nDanielle Paquette in Dakar, Senegal, contributed to this report.\n\nAD", "description": "Ghana’s government has faced significant backlash over the proposal.", "authors": ["Stacey Knott"], "top_image": "https://www.washingtonpost.com/resizer/6Qy16n3TMOQWUg_0z6tITLcgf2g=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KNIGT7XJGMI6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-25"}