{"pub": "metro", "url": "https://metro.co.uk/2019/10/15/primark-online-retailer-told-shoppers-avoid-buying-clothes-amazon-10921153", "downloaded_at": "2019-10-15 15:08:19.270464+00:00", "title": "Primark online: Why the store doesn't want us buying its clothes on Amazon", "language": "en", "text": "You no longer have to go to a Primark store to buy Primark clothes – but that’s not necessarily a good thing (Picture: Getty)\n\nPrimark has hit the headlines today after shoppers realised that, despite the store not have an e-commerce platform, it was actually possible to buy Primark clothes online.\n\nThe affordable clothes retailer, which was founded back in 1969, has its own website where you can browse some of the clothes available to buy. However, it’s not possible to purchase the items online and customers instead must head to one of their stores to make a purchase.\n\nJohn Bason, finance director of Primark parent company Associated British Foods, told The Wall Street Journal in 2017 the reason why Primark don’t sell their clothes online is: ‘The cost to support home delivery can’t be supported with our price points.’\n\nGlobal e-commerce platform Amazon do now sell Primark’s clothes online – but not as part of an official partnership with the high-street store and Primark are urging their customers not to buy their clothes online.\n\nAdvertisement\n\nAdvertisement\n\nWhy Primark doesn’t want you buying their clothes on Amazon\n\nAfter Amazon made headlines for selling Primark clothes online, Primark released a statement via their official Twitter account explaining why their customers should still shop for their ranges in store:\n\n‘We do not have a commercial partnership with Amazon and any Primark products which appear on the site are being re-sold by third parties, at higher prices,’ Primark said. ‘We encourage our customers to visit us in our stores to find the best value.’\n\nWe do not have a commercial partnership with Amazon and any Primark products which appear on the site are being re-sold by third parties, at higher prices. We encourage our customers to visit us in our stores to find the best value. — Primark (@Primark) October 15, 2019\n\nTo shop Primark online, customers simply need to type ‘Primark’ into the search bar on Amazon and the clothes they have available will appear.\n\nHowever, Amazon only sell a limited range of Primark items on their site for now, including the store’s popular Disney and Harry Potter ranges.\n\nBut, as Primark highlighted, the pieces are more expensive, with one customer writing on Twitter that Amazon charge, ‘huge amounts for the same product’ that can be found for cheaper in store.\n\nMORE: Stacey Solomon’s new Primark collection has your autumn wardrobe covered\n\nMORE: Shopper calls out Primark for typo on Friends T-shirt\n\nAdvertisement Advertisement", "description": "Shoppers realised this week that, despite Primark not have an e-commerce platform, it is actually possible to buy Primark clothes online.", "authors": ["Rachael Martin"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_75151391_1571147933.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-15"}