{"pub": "businessinsider", "url": "https://businessinsider.com/cultivated-week-of-september-27-2019-9", "downloaded_at": "2019-09-28 01:17:29.325579+00:00", "title": "CULTIVATED: Here's who's raking in millions on cannabis deals, cannabis legislation passes the House, and more.", "language": "en", "text": "Welcome to Cultivated, our weekly newsletter where we're bringing you an inside look at the deals, trends, and personalities driving the multibillion-dollar global cannabis boom. Sign up here to get it in your inbox every Friday.\n\nHappy Friday,\n\nLots of cannabis-related news this week.\n\nTo start off, I'd like to highlight an exclusive list we put together, taking a peek under the hood of all of the cannabis deals in the past year — from the wild RTO market in the last quarter of 2018, to the near-billion dollar mega-mergers throughout this year.\n\nIn any public offering or M&A deal, there's always investment bankers making money. To figure out who's profiting on cannabis deals, we pulled data from Dealogic and did a lot of our own reporting to identify the top dealmakers at the banks advising on these transactions.\n\nBecause THC is federally illegal in the US, most of the fees from these deals have flowed to a small group of midsize Canadian shops like Canaccord Genuity and GMP Securities.\n\nClick the link below to check out our exclusive reporting.\n\nNow, let's break down the big news in cannabis this week:\n\nOn the SAFE Banking Act\n\nThe SAFE Banking Act, which would allow cannabis businesses to access commercial banking services like checking accounts and opening lines of credit, passed the House on Wednesday by a huge margin: 321 to 103, with 91 Republicans voting in favor.\n\nWhile yes, there was some other important stuff happening in the House that day (Donald who?), it shouldn't be overlooked that this was the first time a standalone cannabis bill has come to a House floor vote — and passed overwhelmingly. The amount of Republican support also bodes well for a version of this bill passing the Senate, experts say.\n\nThe chair of the Senate Banking Committee, Mike Crapo, told Politico he wants a vote on the bill before the end of the year, and that he's confident about its prospects in the Senate. Even Republicans who don't support cannabis legalization, like Rep. Steve Stivers, supported the banking bill as a way to protect small businesses from dealing with large sums of cash, and all the problems that may pose. We reported on some of those issues last year.\n\nAnalysts are mixed on whether the bill will pass the Senate. Cowen's team of cannabis analysts said they expect the SAFE Banking Act to become law before 2020, based on the level of Republican support for the House version. Stifel analysts said the bill faces a tough pass in the Senate, and large financial institutions will still \"tread lightly\" if the bill is passed.\n\nIt's important to note that the SAFE Banking Act, if passed, likely would not provide enough of a legal framework for bulge bracket investment banks and institutional investors to enter the cannabis industry. It's aimed at small businesses, not capital markets.\n\nCanna-business owners still applauded the legislation, including Canndescent's Adrian Sedlin, who said the bill will help US cannabis companies from paying \"usurious rates\" for financing and dealing with an all-cash payroll.\n\nAs well, cannabis legalization advocates said that while the bill helps the cannabis industry, it does not go far enough in supporting the restorative justice aim of the cannabis legalization movement, which seeks to help those affected by the War on Drugs access the wealth-creating opportunities of the newly-legal industry.\n\nI spoke with Seke Ballard, the CEO of Good Tree Capital — which pools money from accredited investors and lends to minority cannabis entrepreneurs — about the bill last week before it passed. While he said that bank financing is \"a step in the right direction\" for minority entrepreneurs, he cautioned that it's not a \"silver bullet.\"\n\n\"The challenge with the banking bill is that it doesn't go far enough. And frankly, action on banking is probably the most important source of leverage for broader action. If Congress passes the SAFE Act without accompanying legislation to ensure restorative justice for the harmed individuals and communities, then how likely is it that they can generate the political support to pass the restorative justice elements separately?\" Ballard told me.\n\nOther legislation, including Rep. Jerrold Nadler's MORE Act, go much further in both protecting financial institutions as well as creating funds that would help minority entrepreneurs start cannabis businesses.\n\nOn the state front, Pennsylvania Governor Tom Wolfe announced his support for legal cannabis, and New York Governor Andrew Cuomo said he will work with his counterpart in Connecticut to come up with a legalized cannabis regime that is consistent across the region.\n\nOn vape-related illnesses\n\nThe spate of vape-related illnesses continues. On Friday, the CDC gave updated numbers — 805 illnesses and 12 deaths — and told reporters on a call that 77% of people who were ill reported using vapes containing THC. While the CDC said THC isn't solely to blame, and e-cigarettes are not, by any means, off the hook, the CDC encouraged people to stop vaping.\n\nThe CDC also noted that most of the THC-containing products that were tied to the illnesses were obtained from \"informal sources,\" such as people's friends or from a dealer. A recent study of 18 THC-containing vape cartridges commissioned by NBC News showed that 13 out of the 15 cartridges obtained from the illicit market contained vitamin-E acetate — a substance which has been linked to the illnesses — and ten of the illicit cartridges were found to contain the pesticide myclobutanil, which can turn into hydrogen cyanide when heated. The cartridges bought at legal dispensaries did not contain vitamin-E acetate.\n\nSome states, including Massachusetts, have placed a temporary moratorium on vape products. Public health experts and officials warned that these bans may turn consumers back to regular old cigarettes.\n\nI spoke to Canopy Growth's new CEO, Mark Zekulin, on the sidelines of the Concordia Summit on Monday. As the cannabis giant prepares to release vapes in Canada (\"Cannabis 2.0\"), Zekulin said that regulated products are safer, and allow for \"tamper-resistant\" and \"traceable\" supply chains. \"More regulation is a good thing,\" said Zekulin.\n\nBank of America cannabis analyst Christopher Carey downgraded Canopy Growth from Buy to Neutral on Friday morning and said that the headline risk associated with vape-related illnesses is weighing down share prices in the sector.\n\nVape pen sales are down significantly since August in states with legal cannabis dispensaries, according to data from Headset, a cannabis market research firm.\n\nWe have a timeline on the vape illnesses here, and we're constantly updating it.\n\nAnd just a quick plug: I'll be moderating a talk with Trulieve CEO Kim Rivers at the Arcview Investor Forum in New York on Wednesday. If you're at the conference, come say hi!\n\nMore stories from around the BI newsroom:\n\nMarijuana stocks have dominated the Toronto Stock Exchange for the last 3 years. Here are the top 10 performers. The Toronto Stock Exchange released a ranking of the top 30 performers over the last three years on Thursday. Two of the top 10 companies are cannabis companies, and two more serve the industry. The outperformance of the industry is not a surprise, according to the vice president of global business development for TSX. Canada legalized recreational use of cannabis in 2018.\n\nCapital raises, M&A activity, partnerships, and launches\n\nCanadian LP Pure Global Cannabis signed a joint venture with KMT-Hansa Corp, to cultivate and process hemp-derived CBD products in Yunnan Province, China. It's the second Canadian LP to enter into an agreement with a Chinese CBD company.\n\nIsrael-based PlantEXT, which develops intellectual property and products for pharmaceutical cannabis entered into an agreement with BB1 Acquisition Corp to pursue a reverse takeover on the TSX Venture exchange in late Fall of this year. The company is looking to raise up to $7 million through a private offering.\n\nHawaii-based psychedelic biotech company Orthogonal Thinker raised $2.5 million in funding to develop its product, Psilly, a plant-based psilocin pro-drug. Psilocin is found in \"magic mushrooms\". The new funding brings Orthogonal's total funding to $4 million.\n\nGreenlane Holdings has entered into an agreement to acquire Conscious Wholesale, which sells cannabis accessories in Europe.\n\nCuraleaf launches \"ground flower pods\" for medical consumers in New York. Each Curaleaf Ground Flower Pod contains 350mg of active cannabinoids, the company said.\n\nHarvest Health & Recreation is partnering with The Last Prisoner Project to help prisoners convicted on cannabis charges eventually land jobs in the new industry once they are released.\n\nCannabiniers — the makers of Two Roots, a cannabis-infused beer — is launching a line of THC and CBD-infused seltzers.\n\nExecutive moves\n\nJohn Malone joins the Shryne Group as its new general counsel. Malone was previously at Arent Fox, LLP.\n\nMassachusetts-based cannabis company 4Front has added two new members to its board: Betty Aldworth, the executive director of Students for Sensible Drug Policy, and Kathi Lentzsch the CEO of Bartell Drugs.\n\nLewis Koski left his eponymous consulting firm, Freedman & Koski, to become the COO of the Florida-based Metrc, LLC, a \"seed-to-sale\" tracking firm.\n\nUS cannabis company Harvest Health & Recreation announced the departures of Steve Gutterman, the company's president (personal reasons) and board member Frank Bedu-Addo (to focus on personal business endeavors), the company said. Harvest is looking to replace Bedu-Addo.\n\nChart of the week\n\nThis one is from our exclusive list of the bankers raking in millions on cannabis deals. Here's what the cannabis league table for investment banks look like, from 2015 through September 23, 2019. As you can see, Canaccord Genuity still leads the pack:\n\nShayanne Gal/Business Insider\n\nStories from around the web\n\nTests show bootleg marijuana vapes tainted with hydrogen cyanide (NBC News)\n\nSales of illicit vaping products find home online (Wall Street Journal)\n\nJourney of a tainted vape cartridge: from China's labs to your lungs (Leafly)\n\nEarly signs of vaping health risks were missed or ignored (Bloomberg)\n\nDr. Sanjay Gupta on medical marijuana: We are in an age of wisdom, but also an age of foolishness (CNN)\n\nHow Republicans learned to love a pot bill (Politico)\n\nDid I miss anything? Have a tip? Just want to chat? Send me a note at jberke@businessinsider.com or find me on twitter @jfberke.", "description": "In this edition, we break down a whirlwind news week in the cannabis sector — from banking legislation to vape-related illnesses.", "authors": ["Jeremy Berke"], "top_image": "https://www.businessinsider.com/public/assets/BI/US/og-image-logo-social.png", "published_at": "2019-09-27"}