{"pub": "theverge", "url": "https://theverge.com/2019/4/25/18513874/quark-review-gopro-snowboarding-kitesurfing-stabilizer", "downloaded_at": "2019-10-05 14:50:35.615408+00:00", "title": "Quark stabilizer review: GoPro without the nausea", "language": "en", "text": "Adrenaline junkies know that buying a GoPro is usually just the start. They’ll soon be tempted by an endless selection of mounts and accessories that promise to capture on video what they feel with every jump, turn, and crash.\n\nOne such accessory is the Quark stabilizer from Noir Matter. It’s a single-axis gimbal that does one thing and one thing only: keeps your GoPro shots level, even when you’re not.\n\nYou might be asking yourself why you would want a $199.99 stabilizer in the age of GoPro’s impressive HyperSmooth stabilization. Fair question, and one I set out to answer while snowboarding the slopes of the Austrian Alps and kitesurfing the lagoons of the Western Sahara.\n\nOur review of Noir Matter Quark Stabilizer Verge Score 8 out of 10 Good Stuff Keeps your GoPro level\n\nCompact\n\nHandy case Bad Stuff Expensive\n\nNot waterproof\n\nRequires heavy-duty mounts Buy for $199.99 from Noir Matter\n\nUnlike bulky three-axis stabilizers that remove the vibration and shake seen in many action videos, the relatively compact and lightweight Quark only corrects tilt by keeping the camera level. This also allows it to correct rolling movements for cameras mounted in the lines of a looping kite, for example, or on the end of a selfie stick while the camera is swung overhead. Quark lasts between two to four hours per charge over its Micro USB connector.\n\nThe side-by-side video below demonstrates its value. Both videos were shot using the same GoPro Hero7 Black camera, the same helmet mount, and the same rider on the same mountain slope. The video on the right doesn’t make you want to vomit, however, as the Quark works to offset the tilting of my head as I carved into the turns.\n\nI also tested the Quark with a GoPro Hero6 Black from 2017. The resulting video was level, but the straight-from-the-camera shots produced by the Hero7 + Quark were far superior thanks to GoPro’s new HyperSmooth stabilization tech. The Quark stabilizer did very little to smooth the video from the Hero6.\n\nMounting the Quark and GoPro to your board can produce some fantastic shots. Even though the camera was shaking like mad on a loose board mount, the Quark kept the GoPro horizontal while the Hero7 Black’s built-in stabilization did the rest. I think the result speaks for itself:\n\nYou can also capture stunning 360-degree video using a neat around-the-head trick with the Quark and GoPro attached to a standard selfie stick:\n\nQuark also corrects rotating and swiveling video captured by cameras mounted in the lines of a kite while kitesurfing. Below M’ohamed “Momo” Hassik performs a trick that would have normally caused the camera (and video) to flip upside down. Instead you get a video as clean as his landing:\n\nNovice kitesurfers should note that kite lines can easily get tangled in the Quark / GoPro combo — they snagged at least three times during one aggressive 30-minute session, although they eventually shook loose without injury. Also, Quark isn’t built to be submerged in the water. Its IP66 rating means it can withstand exposure to jets of water, but not continuous immersion. If you’re not super confident flying your kite, then Quark probably isn’t for you yet.\n\nUnfortunately, I also broke two GoPro mounts during my testing.\n\nQuark weighs 140 grams on its own, which is a bit more than the 116-gram weight of the GoPro Hero7 Black. Combined, that’s enough to notice on a helmet, board, or selfie-stick mount, but not enough to affect your maneuverability. However, the extra weight applies some serious torque to your GoPro mounts.\n\nFirst, the combo managed to jiggle loose a standard 3M mount glued poorly onto the curved surface of my snowboard. Later, the Quark / GoPro pair managed to break an arm off the Beastmount Kiteline V2 mount when the kite crashed into a shallow lagoon during an aborted jump. (Quark sells a more rugged line mount that I didn’t test.) Both the Quark and GoPro survived the impacts, but I was lucky to recover them.\n\nLesson learned: always attach a leash to the Quark / GoPro.\n\nGrid View Put it on the end of a selfie stick.\n\nNoir Matter’s Kite Line mount, sold separately (not the one that broke).\n\nMy flimsy board mount (that failed).\n\nQuark ships with a handy case that holds the GoPro and stabilizer.\n\nNot too heavy for a helmet mount.\n\nQuark also supports a moving time-lapse mode. It’s fine, but a little confusing to get just right. And it needs to be mounted on a tripod or something else in order to prevent it from spinning your action camera around like a top.\n\nQuark lists for $299.99 — just $50 less than the flagship GoPro Hero7 Black camera — but it’s available for $199.99 for a “limited time only,” according to Noir Matter. It ships with a handy carrying case that’s big enough to carry both the Quark and the attached camera. Even with the discount, this is not a GoPro accessory you buy unless you’re certain you’ll use it. It does, however, do one thing and it does it well by minimizing camera tilt and roll. My Hero7 Black videos are certainly better for having used it.\n\nPhotography by Thomas Ricker / The Verge", "description": "Price at $199.99, the Quark single-axis stabilizer from Noir Matter does one thing and does it well: keeps your camera level even when you’re not. Something even GoPro’s Hypersmooth can’t fix.", "authors": ["Thomas Ricker", "Apr"], "top_image": "https://cdn.vox-cdn.com/thumbor/SGG6Zhpj2Nl0L1sBcZSlNe7gIfo=/0x549:4032x2660/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16186936/IMG_6414.jpg", "published_at": "2019-04-25"}