{"pub": "zdnet", "url": "https://www.zdnet.com/article/wanted-someone-brave-enough-to-fill-the-biggest-job-in-government-tech", "downloaded_at": "2019-10-17 09:16:40.652829+00:00", "title": "Wanted: Someone brave enough to fill the biggest job in government tech", "language": "en", "text": "NHS embarks on its digital transformation: Where do you start? NHS has paper-based systems, multiple technologies and needs a data architecture. ZDNet UK Editor in Chief Steve Ranger talks about the moving parts and the challenges getting the NHS ready for innovation in the future.\n\nThere is a new vacancy in the Civil Service and it isn't exactly an entry-level role: the successful candidate will become no less than the government's chief digital information officer (GCDIO), the biggest job in government IT.\n\nThe GCDIO will be recruited as a Permanent Secretary, which is the most senior level of the Civil Service, and will be reporting directly to John Manzoni, its chief executive.\n\nIt is not the first time that the role has been advertised; actually, the government has been looking for a digital leader for over two years. Back in 2017, the job was advertised as chief digital officer, and it has now relaunched with a surplus of seniority.\n\nSEE: IT jobs in 2020: A leader's guide (ZDNet special report) | Download the report as a PDF (TechRepublic)\n\nThe 9-to-5 involves \"enhancing Her Majesty's government's reputation as the world's most digitally-advanced government\" – in other words, championing the government's digital transformation outlined in a strategy that was set out in 2017.\n\nAnd with the UK currently losing its lead in international rankings of most digitally-savvy governments, falling last year from the first place to the third, this new position is one likely to be brimming with challenges.\n\nMark Thompson, professor in digital economy at the University of Exeter, told ZDNet that the role was long overdue – and that the candidate will have to demonstrate serious skill, \"if they are to have any chance of pushing through the considerable inertia and resistance that generally meets any proposal for significant change.\"\n\nSo do great responsibilities, in this case, mean great enough powers? In a speech at the Southbank Centre last month, the Cabinet Office minister Oliver Dowden certainly asserted so, highlighting that the role is an unprecedented one. \"This will be (...) the first time, I believe, someone at permanent secretary level has been appointed to lead a function,\" he said.\n\nThe new GCDIO will be responsible for overhauling legacy IT systems, strengthening cybersecurity and leveraging data technologies to improve efficiency – all of which are objectives that have been previously identified by various reports as unsuccessfully tackled by the government.\n\nTake legacy IT, for instance. Only last March, Dowden noted that 86 key strategic projects are still awaiting to go fully digital.\n\nThe government's cybersecurity strategy, for its part, has been one of the favourite targets of Labour MP Jo Platt, who said that it is both \"not fit for purpose\" and \"does not put the public interest first\".\n\nThis is not without reason: in a report on the progress of the UK's national cybersecurity programme, the National Audit Office (NAO) highlighted this year that there is still a lot of space to improve.\n\nDespite important commitments from the government to improve cybersecurity, the report concluded that it was hard to say with certainty whether the programme will provide value for money once it completes in 2021.\n\nAnd on data? Things don't look much better. The government launched a National Data Strategy (NDS) in 2017 to encourage trust in the data ecosystem and improve data quality. But once again, the NAO reported that there lacked a clear and sustained strategy on data, which could result in the NDS being nothing but a missed opportunity.\n\nGavin Freeguard, programme director at the Institute for Government, was one of the signatories of a letter to the government urging it to adopt a sharper focus on data through improved infrastructure, engagement with citizens and building of trust.\n\n\"Our view is that government data is still not being used enough by departments to improve how they operate,\" he said.\n\nThe government did promise to appoint a chief data officer (CDO) – but that was over two years ago, and the vacancy is still open, too.\n\nSEE: What is a CIO? Everything you need to know about the Chief Information Officer explained\n\nPerhaps it's unsurprising then that a lack of leadership was identified as one of the key obstacles standing in the way to a digital government in a report from the House of Commons' Science and Technology committee, which found that the government's digital momentum had slowed. The Cabinet Office declined to provide further comment.\n\nMark Thompson, for one, believes that government won't easily address the fundamental issues that need tackling. Politicians are still not educated to understand digital business models, he said, or their implications to transform public services – and a new GCDIO will \"almost certainly not\" bring about a successful digital strategy unless this changes.\n\n\"Appoint a GCDIO by all means, but don't bother unless she or he has top political backing, that is sustained through a five-year programme of radical change,\" he said.\n\n\"During this time, she or he would need to educate and build a cadre of 'digital alumni' across key powerful positions in public services who would collaborate and support one another.\" That's just one more idea for the future GCDIO to add to what is likely to be a very long to-do list.", "description": "After being left vacant for two years, one of the biggest jobs in government tech could soon be filled. But candidates face a long list of challenges.", "authors": ["Daphne Leprince-Ringuet"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2014/09/05/e68f0588-34e5-11e4-9e6a-00505685119a/thumbnail/770x578/7e0be7857a7c3f2be16c2c2eb25e16e2/government-uk.jpg", "published_at": "2019-10-17"}