{"pub": "businessinsider", "url": "https://businessinsider.co.za/trade-war-impact-on-global-mergers-q3-volume-3year-low-2019-9", "downloaded_at": "2019-10-01 04:55:21.496287+00:00", "title": "5 things you need to know in SA business today and why global M&A activity has tumbled to a 3-year low", "language": "en", "text": "1. The findings of a five-year investigation by the Competition Commission were released yesterday. It found that a lack of competition in the private healthcare industry is fuelling increasingly unaffordable healthcare costs. It's also incentivising doctors and private health facilities to over-treat patients, sending them to hospital more frequently and for longer periods without any real medical benefit. This is particularly true in areas like Gauteng and the Western Cape where there are more hospitals and doctors. More.\n\n2. In his first weekly email newsletter to the nation, President Cyril Ramaphosa has stressed that a new growth strategy needs to be adopted to turn the economy around. He said it would be finalised within weeks. More.\n\n3. A weaker oil price in August, together with a solid jump in mining exports, helped to push SA's trade balance from a deficit to a surprisingly large surplus. South Africa exported R6.84bn more than it imported in August. This was much better than expected. More.\n\n4. The volume of commodities transported by state-owned freight rail and port group Transnet fell in 2019 due to a contraction in the mining sector and a weak economy, but \"stringent\" cost cutting means after-tax profit still rose by 25.5%. More.\n\n5. Steinhoff has changed Pepkor Europe's name to Pepco Group. Steinhoff said the name change will link the business directly to Pepco, which sells cut-price clothes, shoes and household goods in Poland, Romania and Hungary. More.\n\nWhy global M&A activity tumbled to a 3-year low\n\nReported by Daniel Strauss\n\nGlobal merger and acquisition volume plunged in third quarter as the US-China trade war continued to cloud the global economic outlook.\n\nTotal global M&A sunk 16% year-over-year to $729 billion in the third quarter, posting its lowest quarterly volume since 2016, according to data compiled by Refinitiv. Merger activity in the US saw its lowest quarterly volume since 2014, falling 40% from the same period last year to $246 billion.\n\nDealmaking in Asia also tumbled 20% to $160 billion - the lowest level of activity since 2017 - as Hong Kong's role as a global financial hub was threatened by weeks of pro-democracy protests, according to Reuters.\n\nActivity levels in Europe stood in sharp contrast to other parts of the world, with M&A volume jumping more then 45% to $249 billion, according to Refinitiv.\n\nThe global slowdown in dealmaking came as companies have been assessing the economic backdrop in the face of the US-China trade war and other headwinds. The economic uncertainty stemming from trade war likely overshadowed the low cost of debt financing for acquisitions, according to a report from Reuters.\n\nSeveral large deals were also called off in the third quarter, including the $200 billion merger of tobacco giants Philip Morris International and Altria Group.\n\nReceive a daily email with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "President Cyril Ramaphosa pushed for a new growth plan in his brand-new newsletter to the nation.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9418/b62654fcd7b845bab16ba225fa4df722.png", "published_at": "2019-10-01"}