{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-germany-politics-cdu/merkels-conservatives-descend-into-infighting-after-vote-rout-idUKKBN1X814N", "downloaded_at": "2019-10-29 14:11:00.336320+00:00", "title": "Merkel's conservatives descend into infighting after vote rout", "language": "en", "text": "BERLIN (Reuters) - German Chancellor Angela Merkel and her protege Annegret Kramp-Karrenbauer are facing open criticism from fellow conservatives after a state vote rout that threatens to blow open the question of who will run for chancellor in a 2021 election.\n\nFILE PHOTO: Annegret Kramp-Karrenbauer waves with fellow candidates Jens Spahn and Friedrich Merz after being elected as the party leader during the Christian Democratic Union (CDU) party congress in Hamburg, Germany, December 7, 2018. REUTERS/Fabrizio Bensch/File Photo\n\nIn a fourth electoral setback this year, the Christian Democrats (CDU) slumped into third place in the eastern state of Thuringia behind the far-right Alternative for Germany (AfD) which won nearly a quarter of the votes.\n\nThe result, which Kramp-Karrenbauer described as “bitter”, has caused a split in the CDU over whether it should break a taboo and work with the radical Left party, which came first in the state election.\n\nSenior German conservative Friedrich Merz, still a potential conservative chancellor candidate despite losing the party leadership contest to Kramp-Karrenbauer last year, blasted Merkel, a long-time rival, and demanded change.\n\n“The appearance of the whole German government is abysmal and something has to change,” Merz told ZDF television late on Monday. He blamed Merkel, saying a lack of leadership had cast a fog of inaction over the country for years.\n\n“Most of all, it is the chancellor who is at the centre of the criticism,” he said, adding that he doubted the coalition would last two more years.\n\nMerkel, who has led Europe’s biggest economy for 14 years, has said she will not stand for a fifth term in 2021 but has tried to choreograph her exit from power by promoting her ally Kramp-Karrenbauer.\n\nHer strategy is unravelling.\n\nDoubts have grown over Kramp-Karrenbauer’s suitability as a chancellor candidate after a series of mistakes. In addition, the fragile coalition with the Social Democrats (SPD), themselves in turmoil, may not last long beyond a leadership vote in December.\n\nHead of the CDU’s youth wing Tilman Kuban has also renewed his demand for a ballot of members on who should be the next chancellor candidate, an affront to Kramp-Karrenbauer who had hoped to be the party’s automatic choice.\n\n“At the moment we have an open question about the leadership of the conservative bloc,” he told ZDF.\n\nAfter the dismal showing in Thuringia, where the CDU lost 11.7%, the party’s local leader Mike Mohring ruffled feathers in Berlin by indicating he may be willing to work with the Left party, seen by some as successors of East German Communists.\n\nEven though Thuringia’s popular Left leader Bodo Ramelow, who has led the state there since 2014, is a pragmatist from western Germany, some in the CDU were angry.\n\nBy the end of the day, Mohring had rowed back, saying he would not form a coalition with the Left although he would accept an invitation to talks with Ramelow.", "description": "German Chancellor Angela Merkel and her protege Annegret Kramp-Karrenbauer are facing open criticism from fellow conservatives after a state vote rout that threatens to blow open the question of who will run for chancellor in a 2021 election.", "authors": ["Madeline Chambers", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191029&t=2&i=1446145306&w=1200&r=LYNXMPEF9S0QT", "published_at": "2019-10-29"}