{"pub": "dailybeast", "url": "https://thedailybeast.com/senate-dems-plead-with-key-gop-senator-to-probe-trump-ukraine", "downloaded_at": "2019-10-09 22:00:35.403779+00:00", "title": "Senate Dems Plead with Key GOP Senator to Probe Trump-Ukraine", "language": "en", "text": "As the investigation into President Trump’s push to get Ukraine to dig up dirt on Joe Biden intensifies on both sides of the Capitol, Senate Democrats are putting pressure on Senate Foreign Relations Chairman Jim Risch (R-ID) to start doing something to get answers about a situation that is quickly becoming a U.S. foreign affairs crisis.\n\nIn a letter sent to Risch on Wednesday, all the Democrats on the committee, led by Sen. Robert Menendez (D-N.J.), said the panel has a duty to “examine the serious questions raised by these events.”\n\n“As the Committee charged with jurisdiction over U.S. foreign policy, it is incumbent on us to understand fully all the facts, including the circumstances surrounding the delay in U.S. security assistance to Ukraine, the early departure of the U.S. ambassador to Kyiv, the Department of State’s role in these matters, as well as the implications these events may have on U.S-Ukraine relations, and U.S foreign policy more broadly.”\n\nThe senators called on Risch to “promptly convene hearings”—mentioning specifically testimony from Secretary of State Mike Pompeo—and use all of the committee’s powers to “fully examine these matters.”\n\nWhile committees in the Democrat-led House are moving fast on their investigation, the only movement in the GOP-controlled Senate has come from the Intelligence Committee, which has already heard from the acting Director of National Intelligence and is likely to hear from more witnesses in the near future.\n\nRisch, who replaced former Sen. Bob Corker (R-TN)—a frequent Trump critic—at the helm of the committee this year, has so far evinced no great interest in the Ukraine matter and has mostly advanced the GOP’s current talking points. “This conversation that the president had with the head of Ukraine is a typical conversation,\" Risch said on Sept. 25, according to Idaho media.\n\n“What happened is pretty simple, the former President Barack Obama tapped Joe Biden to review the corruption, report on it... to protect the U.S. funds that were there,” he went on. \"Within weeks after that, the gas company—the heart of corruption in the Ukraine, hired Joe Biden's son for the tune of $50,000 a month, plus his law firm for another $100,000 a month.”\n\nThe committee's majority has released no official statements to date about the Ukraine issue. On Sept. 24, the day that Speaker Nancy Pelosi formalized an impeachment inquiry over the Ukraine news, Risch sent out a press release touting his meeting with the United Kingdom’s new foreign minister. A spokesperson for Risch did not immediately respond to a request for comment.\n\nThough few Democrats expected their Republican colleagues to conduct an aggressive investigation into Trump and Ukraine, many had held out hope there would be at least be a few hearings on the issue.\n\n“At a minimum, we should be having hearings about this,” said a Democratic aide. “At a minimum, we should be calling Pompeo to testify. That’s an easy thing.”\n\nThat’s left some of them pining for Corker, said the aide. “He obviously wasn’t afraid about standing up to the president. We’re losing a lot of those voices committed to accountability.”", "description": "The chairman of the Senate Foreign Relations Committee, Sen. Jim Risch, hasn’t expressed any desire to find out more about President Trump’s pressure campaign in Ukraine.", "authors": ["Sam Brodey", "Congressional Reporter"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_3432,w_6102,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1570216028/RTS2CZ8J_h2mn4k", "published_at": "2019-10-09"}