{"pub": "independent", "url": "https://independent.co.uk/voices/vaping-smoking-nicotine-trump-ban-wet-lung-death-toll-cigarettes-a9118556.html", "downloaded_at": "2019-09-24 15:20:09.815555+00:00", "title": "Vaping is no cure-all for smoking addiction – because it's not just the nicotine that gets people hooked", "language": "en", "text": "I’ve been smoking for 11 years. And so for more than a decade I’ve had this complicated, love-hate relationship with cigarettes and more realistically, a battle against the craving for nicotine.\n\nI’ve tried to replace this craving with endorphins from training for marathons, adrenaline from extreme sports like white-water rafting or surfing, or even training myself to count to ten at stressful moments, but it is hard to cut the ties to an old friend.\n\nTobacco was there with me for those first nightclubs, for break ups, make ups and stressful circumstances. It’s like returning to the comfy arms of that oversized jumper you wear at Christmas, you miss the taste, the feeling of nicotine as it tingles through your body and the sense of calm that fills you.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nI started smoking when I was 16, surrounded by a social circle that smoked and influenced me to try it. After fighting a reluctant voice in the back of my mind, I was tempted to try something that I knew was bad for me, which was taboo.\n\nLike a kid in a sweet shop with chocolate smeared around their mouth, I inhaled the taste, the nicotine tantalising my taste buds. I was hooked. Not only on the nicotine, but on the strange social aspect, on the new-found friendships and unusual relationships uncovered in the smoking areas of clubs, pubs and outside of restaurants.\n\nShape Created with Sketch. Smoking ads throughout the years Show all 18 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Smoking ads throughout the years 1/18 A 1929 advert for Chesterfield cigarettes that featured in Cosmopolitan magazine 2/18 A 1900 advert for Ogden's Guinea - Gold Cigarettes that featured in the Illustrated London News Getty 3/18 A 1918 advert for Strand cigarettes that featured in Bruno's Bohemia Anton Raath 4/18 A 1939 newspaper advert for Piccadilly cigarettes Wellcome Library 5/18 A 1941 advert for Camel cigarettes featuring baseball player Joe DiMaggio 6/18 A 1929 advert for Chesterfield cigarettes that featured in Cosmopolitan magazine in the US 7/18 A 1952 advert for Craven 'A' cigarettes featuring England footballer Stanley Matthews Science Museum 8/18 A 1950 advert for Chesterfield cigarettes featuring baseball player Bub McMillan 9/18 A 1930 advert for Old Gold cigarettes that featured in Motion Picture magazine in the US 10/18 A 1931 advert for Lucky Strike cigarettes that featured in the Literary Digest Rex 11/18 A 1952 advert for Player's Navy Cut cigarettes that featured in the Picture Post Getty 12/18 A 1952 advert for cigarettes with the Du Maurier filter that featured in the Picture Post Getty 13/18 A 1974 Health Education Council poster warning against the danger of smoking whilst pregnant Getty 14/18 One of four posters from a 1998 campaign warning teenagers that smoking causes damage to the heart and lungs from the first cigarette PA 15/18 One of four posters from a 1998 campaign warning teenagers that smoking causes damage to the heart and lungs from the first cigarette PA 16/18 One of four posters from a 1998 campaign warning teenagers that smoking causes damage to the heart and lungs from the first cigarette PA 17/18 A poster from a 1999 campaign from the Health Education Authority urging women not to smoke whilst pregnant PA 18/18 Steve Plumb, 40, from Peterborough, stands next to a 2003 poster issued by the British Heart Foundation (BHF) warning of the dangers that smoking cigarettes can have on the heart PA 1/18 A 1929 advert for Chesterfield cigarettes that featured in Cosmopolitan magazine 2/18 A 1900 advert for Ogden's Guinea - Gold Cigarettes that featured in the Illustrated London News Getty 3/18 A 1918 advert for Strand cigarettes that featured in Bruno's Bohemia Anton Raath 4/18 A 1939 newspaper advert for Piccadilly cigarettes Wellcome Library 5/18 A 1941 advert for Camel cigarettes featuring baseball player Joe DiMaggio 6/18 A 1929 advert for Chesterfield cigarettes that featured in Cosmopolitan magazine in the US 7/18 A 1952 advert for Craven 'A' cigarettes featuring England footballer Stanley Matthews Science Museum 8/18 A 1950 advert for Chesterfield cigarettes featuring baseball player Bub McMillan 9/18 A 1930 advert for Old Gold cigarettes that featured in Motion Picture magazine in the US 10/18 A 1931 advert for Lucky Strike cigarettes that featured in the Literary Digest Rex 11/18 A 1952 advert for Player's Navy Cut cigarettes that featured in the Picture Post Getty 12/18 A 1952 advert for cigarettes with the Du Maurier filter that featured in the Picture Post Getty 13/18 A 1974 Health Education Council poster warning against the danger of smoking whilst pregnant Getty 14/18 One of four posters from a 1998 campaign warning teenagers that smoking causes damage to the heart and lungs from the first cigarette PA 15/18 One of four posters from a 1998 campaign warning teenagers that smoking causes damage to the heart and lungs from the first cigarette PA 16/18 One of four posters from a 1998 campaign warning teenagers that smoking causes damage to the heart and lungs from the first cigarette PA 17/18 A poster from a 1999 campaign from the Health Education Authority urging women not to smoke whilst pregnant PA 18/18 Steve Plumb, 40, from Peterborough, stands next to a 2003 poster issued by the British Heart Foundation (BHF) warning of the dangers that smoking cigarettes can have on the heart PA\n\nI was hooked on being part of this exclusive club. I was hooked on stepping away from my workplace and having a moment to myself, to collect my thoughts and reflect on the day. I was hooked on the comforting ritual of rolling a cigarette with a cup of tea and watching the world go by.\n\nI have been a serious smoker, a social smoker and a failed quitter, and I can tell you, excuses for lighting up are not hard to come by. “Oh, I need a cigarette to wake me up in the morning”, “I’m not hungry, I’ll have a smoke instead”, “My wine doesn’t taste as good without a ciggie in my hand,” (welcome back taste buds!) “My goldfish has died, I need a smoke to calm my nerves”. The list is endless.\n\nOn the face of it, vaping seems to offer some answers, even if the growing number of headlines about potential risks and related deaths have started to spook people. Most serious smokers have tried vaping – out of simple curiosity perhaps, but also to see if it might just help them drop this habit which eats away their finances and leaves them with a disgusting chesty cough.\n\nWhen I gave it a try, however, I still wanted the flavour and the nicotine, so I stayed away from fruity flavours and went for a vape that actually tasted like a cigarette.\n\nBut the thing that tempted me to become a smoker in the first place was missing, the membership of a social gang, borrowing lighters from each other, sharing filters. Sure you can stand outside and talk to fellow smokers who aren’t vaping but you end up (or at least I do) eyeing up their cigarette, missing that tangible feeling between your fingers rather than a cold piece of metal your purse your lips onto. I can see why there has been evidence that almost 60 per cent of vapers smoke cigarettes too. It’s a different experience.\n\nWhat we smokers never seem to consider enough is the obvious and very serious risks of smoking, things like heart disease, heart attack and stroke. We can be utterly blind to it, and me especially. My mum had a stroke when I was four years old and my Dad has had a heart attack in the last ten years.\n\nAnd yet, despite seeing the physical and psychological damage my parents have suffered from medical conditions no doubt exacerbated by their past smoking habits, I still find it challenging to stop smoking. I am disgusted by my habit, and by the fact that I still itch for a cigarette, or eye up a stranger who has a pouch of tobacco when I’ve had a glass of wine. But why can’t I stop? Because wine tastes so much better with a cigarette, or so I tell myself.", "description": "I’ve been smoking for 11 years. And so for more than a decade I’ve had this complicated, love-hate relationship with cigarettes and more realistically, a battle against the craving for nicotine. I’ve tried to replace this craving with endorphins from training for marathons, adrenaline from extreme sports like white-water rafting or surfing, or even training myself to count to", "authors": ["Vicky Carter"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/06/19/11/vaping.jpg", "published_at": "2019-09-24"}