{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/7/a-shaman-unnerves-vladimir-putin", "downloaded_at": "2019-10-07 20:10:43.454147+00:00", "title": "A shaman unnerves Vladimir Putin", "language": "en", "text": "ANALYSIS/OPINION:\n\nRussian President Vladimir Putin has deliberately cultivated the image of a macho guy, a man’s man, who fears nothing. He rides a stallion bareback; he dives for underwater treasure (and conveniently finds some). He fires assault rifles with deadly accuracy. Mr. Putin is tough. Do not mess with him.\n\nA shaman, from sparsely-populated Northeastern Russia’s Yakutia (also called Sakha), has a quite different view: Mr. Putin is possessed by the devil, and the shaman has been called by higher forces to drive out his evil spirits. Mr. Putin may be able to annihilate his judo opponents, but the evil forces in his body stand no chance against the supernatural powers that the shaman can unleash on him.\n\nThe shaman is one Alexander Gabyshev, a graduate in history from Yakutsk University. After graduation, he worked as a janitor. When his wife died, he retreated into the forests for three years of meditation. He declared himself shaman (translation: medicine man, witch doctor), after he had visions, one of which ordered him to walk to Moscow to purge the Kremlin of Mr. Putin.\n\nBy the way, the shaman’s proposed pilgrimage left Mr. Putin’s devils plenty of time. At his normal pace, Mr. Gabyshev would reach the Kremlin walls in 2021. Mr. Putin’s day of reckoning lay two years in the future, unless the shaman resorted to public transportation.\n\nThus, Shaman Gabyshev began a 3,000-mile trek to Moscow to deploy his magic powers to exorcize Mr. Putin. He began his journey in March, pushing a cart with his possessions and wearing a Japanese military cap with floppy ear flaps.\n\nAs his pilgrimage progressed through the largely-deserted Trans Baikal steppes, Mr. Gabyshev was joined by disciples for the walk-about to the Kremlin.\n\nThe tenacious shaman had covered more than 1,000 miles when the Kremlin decided to stop his pilgrimage. In Ulan Ude on Sept. 9, 200 of his followers assembled on the city square to demand the release of two of their colleagues jailed for drunkenness. Later, they escalated their demand to the firing of the city mayor.\n\nKremlin authorities decided the shaman was going too far: He was arrested by armed and masked Russian security agents in Buryatia near the border with Irkutsk province. The charge was incitement to extremism for remarks against President Putin. He had violated article 280 of the criminal code of the Russian Federation.\n\nUpon his arrest by masked agents armed to the hilt, the FSB handed the shaman over to medical authorities who declared him insane after a cursory examination. The FSB ruled that he should be sent back to his remote village in Sakha, where he could return to forest meditation if he wished. Maybe this time his visions might direct him away from Mr. Putin.\n\nIn any case, Mr. Gabyshev’s arrest and insanity diagnosis raised the shaman-Putin-exorcism story to fourth place in Russian social media. It attracted the attention of Amnesty International, which designated Mr. Gabyshev an “international prisoner of conscience.”\n\nWhattsap.ru is inviting members to join the group “Shaman-goes-to-Moscow” with the appeal “Together we are power.” In the invitation, it is noted that “the group has been formed to enable Yakutia Shaman Alexander Gabyshev to make it to Moscow on foot and to drive evil from Russia. Sign up and propose your own video to share with friends.” So far, the group has 563 followers.\n\nOther social-media commentators complain about Mr. Putin’s “punishment psychiatry,” and Orthodox believers cite Jesus’ love for those possessed by demons. One skeptic writes that if the authorities claim mental illness for Mr. Gabyshev, this proves he is sane.\n\nWhile a Western public may find the shaman’s exorcism quest funny, Mr. Putin does not. A high percentage of Russians believe in the supernatural. Russian security forces even employ mind readers in their intelligence operations.\n\nAs writes Russian expert Paul Goble: “Gabyshev’s appearance recalls that of Rasputin at the end of the Imperial times and those of extra-sensory figures … at the end of Soviet ones, mystical figures all who attracted attention because people were searching for something.” If Mr. Gabyshev becomes tomorrow’s news, the Russian people will still be searching for something, and there are plenty of other shamans, witches and sorcerers in the superstitious Russia to take his place.\n\nThe Kremlin hopes that the returned Gabyshev will stay put. With winter approaching, they may get their wish.\n\n• Paul Gregory is a research fellow at Stanford University’s Hoover Institution.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Russian President Vladimir Putin has deliberately cultivated the image of a macho guy, a man's man, who fears nothing. He rides a stallion bareback; he dives for underwater treasure (and conveniently finds some).", "authors": ["The Washington Times Http", "Paul Gregory"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/07/BgregoryLGputinrasp_c0-840-1600-1772_s1770x1032.jpg?d140ec5306981766c476add7dac1a0629aeb59ba", "published_at": "2019-10-07"}