{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7628353/Ricky-Martin-husband-Jwan-Yosef-welcome-fourth-child-family-photo-son-Renn.html", "downloaded_at": "2019-10-30 02:28:41.904613+00:00", "title": "Ricky Martin and husband Jwan Yosef welcome fourth child with first family photo of their son Renn", "language": "en", "text": "Fatherhood looks good on Ricky Martin and husband Jwan Yosef, as they recently welcomed their fourth child.\n\nJust this August, they shared the first photo of their daughter Lucía, who was born last December.\n\nMartin took to Instagram Tuesday with another photo, this time showing a first glimpse of their newborn son Renn.\n\nNew addition: Ricky Martin and husband Jwan Yosef took to Instagram Tuesday, showing a first glimpse of their newborn son Renn\n\nThe adorable family photo shows Martin cradling the infant as the two dads smile, the photo cropping off the tops of their heads.\n\nHe captioned the photo of the cute trio: 'Nuestro hijo Renn Martin-Yosef ha nacido.'\n\nThe 47-year-old also took to his story with the photo and an English translation: 'Our son Renn Martin-Yosef has been born!'\n\nHe announced just last month that he and Yosef were expecting another child via surrogate.\n\nNumber four: The 47-year-old also took to his story with the photo, writing: 'Our son Renn Martin-Yosef has been born!'\n\nBusy year: Just this August, they shared the first photo of their daughter Lucía, who was born last December\n\nMartin thanked his family while accepting the National Visibility Award at HRC's 23rd Annual National Dinner.\n\nHe said: 'Jwan, I don't see you, but my husband Jwan, I love you. My beautiful twins Valentino and Matteo, they're also here, I love you with all my heart.\n\n'Lucía, my baby girl who is not here with us, she stayed at home with Grandma, but she's also the light of my life.'\n\nBig announcement: He announced just last month that he and Yosef were expecting another child via surrogate\n\nFamily man: Martin thanked his family while accepting the National Visibility Award at HRC's 23rd Annual National Dinner\n\nExpecting: He added, to enthusiastic applause: 'And by the way, I have to announce that we are pregnant. We are waiting'\n\nMartin added, to enthusiastic applause: 'And by the way, I have to announce that we are pregnant. We are waiting.'\n\nThe former Menudo member announced that he'd married Yosef, 35, a Syrian-Swedish painter, last January.\n\nMartin had previously fathered twins Matteo and Valentino, both 11, via surrogacy in August of 2008.", "description": "He announced just last month that he and Yosef were expecting another child via surrogate, while accepting the National Visibility Award at HRC's 23rd Annual National Dinner.", "authors": ["Glenn Garner For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/00/20354228-0-image-a-95_1572395105969.jpg", "published_at": "2019-10-30"}