{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/17/mississippi-states-passing-woes-hinder-hills-produ", "downloaded_at": "2019-10-17 06:27:13.318164+00:00", "title": "Mississippi State's passing woes hinder Hill's production", "language": "en", "text": "STARKVILLE, Miss. (AP) - Mississippi State’s lack of a consistent passing attack is hampering running back Kylin Hill’s production.\n\nWith opposing defenses loading up to stop the ground game, Hill has been held below 50 yards in each of Mississippi State’s last two games. Teams began focusing on Hill after he rushed for over 100 yards in each of his first four games this year.\n\nIt’s not going to get any easier: Next up is No. 2 LSU (6-0, 2-0 Southeastern Conference), which has the SEC’s second-ranked run defense.\n\nHill opened the SEC season with a bang, rushing for 120 yards and three touchdowns in a 28-13 victory over Kentucky last month. But it’s been a different story lately as Mississippi State (3-3, 1-2) has dropped two straight games. In a 56-23 loss to No. 11 Auburn, Hill was held to just 45 yards on 17 carries. Last week, things went backward again for Hill with just 13 yards on 11 carries as Mississippi State fell 20-10 to Tennessee.\n\n“There were some schematic things we could’ve done better,” said Mississippi State head coach Joe Moorhead. “But (Tennessee) didn’t do anything out of the ordinary from what we had seen on tape. But I think we have to play with more physicality, play with more strain and more finish. Then there’s things we should do to get Kylin more on the perimeter, and that is something I point to myself that we can get done better.”\n\nAnother factor for the lack of success on the ground has been an inconsistent passing game.\n\nThe Bulldogs have dealt with injuries and inexperience at quarterback, whether it’s senior Tommy Stevens or freshman Garrett Shrader under center. Moorhead has said Shrader will start against LSU.\n\nIn their first four games of the season, the Bulldogs were completing 72 percent of their pass attempts. But that number is barely over 50 percent in the past two games, allowing opposing defenses to creep more guys in the box to handle Hill.\n\n“That’s a small part of it, but not that much,” Moorhead said. “Kylin is still over 600 yards (rushing) and over 100 yards a game. Obviously the last two games have not been up to standard, but that’s going to happen.”\n\nHill could have a tough time finding running room against LSU. The Tigers are yielding just 91.8 yards rushing per game and 2.8 yards per carry.\n\nMoorhead has dealt with this scenario before.\n\nDuring Moorhead’s offensive coordinator days at Penn State, defenses tried a variety of ways to slow down All-America running back and eventual first-round draft pick Saquon Barkley. When that option was taken away, however, Penn State was able to make explosive plays in the passing game.\n\nThus far, Mississippi State hasn’t taken advantage of that aspect.\n\n“There were games at Penn State where we arguably had the best player in the country,” Moorhead said. “Defenses were trying to do some unique things to try to keep it down. But the difference was, when that was happening we were able to create explosive plays down the field in the pass game.\n\n“That’s something I’ve talked about in the past. When they are bottling up the run game, we got to find a way to take advantage of it and move the ball. We’d been doing that earlier in the year, but did not take advantage of it (against Tennessee).”\n\nIn order to improve this weekend, Shrader noted it comes down to “small details.”\n\n“It was more missed assignments than anything,” Shrader said. “Every time (Hill) got the ball Tennessee had two or three guys there. It’s just the small details and seeing things on the fly that we didn’t pick up, which really stunted our run game.”\n\n___\n\nMore AP college football: https://apnews.com/Collegefootball and https://twitter.com/AP_Top25\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Mississippi State's lack of a consistent passing attack is hampering running back Kylin Hill's production.", "authors": ["The Washington Times Http", "Paul Jones"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/17/mississippi_state_helping_hill_football_31453_c0-216-5184-3240_s1200x700.jpg?48c42b2789ee0d08ce9a91ab8317603cc81a12f8", "published_at": "2019-10-17"}