{"pub": "businessinsider", "url": "https://businessinsider.com/fields-leads-no-4-ohio-state-past-northwestern-52-3-2019-10", "downloaded_at": "2019-10-19 12:33:21.126861+00:00", "title": "Fields leads No. 4 Ohio State past Northwestern 52-3", "language": "en", "text": "Ohio State quarterback Justin Fields (1) escapes pressure from Northwestern defensive end Earnest Brown IV during the first half of an NCAA college football game Friday, Oct. 18, 2019, in Evanston, Ill. (AP Photo/Charles Rex Arbogast) Associated Press\n\nEVANSTON, Ill. (AP) — Justin Fields threw for four touchdowns, J.K. Dobbins rushed for 121 yards and No. 4 Ohio State pounded Northwestern 52-3 on Friday night.\n\nThe Buckeyes (7-0, 4-0 Big Ten) did exactly as expected and blew the game open early, jumping to a 31-3 halftime lead.\n\nFields completed 18 of 23 passes for 194 yards. The sophomore transfer from Georgia matched his career high for TDs through the air. He now has 22 passing and 30 overall on the season.\n\nThe nation's second-leading rusher, Dobbins scored from the 5 in the second quarter after breaking off a 67-yard run. He also caught a 19-yard touchdown pass in the first half.\n\nThe junior now has 947 yards rushing after finishing with more than 1,000 in each of his first two seasons.\n\nChris Olave caught two TDs. Blake Haubeil kicked a 55-yard field goal that tied the second-longest in the history of the storied program. And the Buckeyes racked up 480 yards in remaining unbeaten heading into their showdown at home with No. 6 Wisconsin next week.\n\nThe loss was the fourth in a row for Northwestern (1-5, 0-4). The Wildcats haven't beaten a top-five opponent since the 1959 team opened with victories over No. 2 Oklahoma and No. 5 Iowa.\n\nAidan Smith, making his second straight start, was 6 of 20 for 42 yards and an interception. Smith and Hunter Johnson, who started the first four games before sitting out the loss at Nebraska two weeks ago because of a lower-body injury, were listed with the first team on the depth chart this week.\n\nThrough the first six games, Ohio State outscored opponents 296-53 — an average of 40.5 points that was the biggest differential among FBS schools. The Buckeyes came in leading the Big Ten in scoring and were tops in the conference in total yards and yards per game by wide margins.\n\nWith a defense that ranked second in the nation and conference to Wisconsin going against one of the country's worst offenses, the Buckeyes made it look easy.\n\nOhio State went 70 yards on the game's opening possession, with Fields hitting a wide-open Olave down the middle for a 20-yard touchdown.\n\nNorthwestern's Charlie Kuhbander kicked a 33-yard field goal with just over three minutes left in the first quarter. Fields made it 14-3 early in the second when he hit Dobbins on a slant. And after the Wildcats punted, the Buckeyes needed just two plays to bump the lead to 18, with Dobbins carrying the load.\n\nOhio State added 10 more points in the closing minutes of the half to break it open.\n\nTHE TAKEAWAY\n\nOhio State: Consider this a good tuneup for the big showdown next week for the Buckeyes, who will get an extra day of rest.\n\nNorthwestern: Whether it's Smith or Johnson starting at quarterback, the Wildcats continue to stall on offense.\n\nUP NEXT\n\nOhio State: The Buckeyes face a huge test when they host Heisman Trophy hopeful Jonathan Taylor and Wisconsin on Oct. 26.\n\nNorthwestern: The Wildcats will try to stop the slide when Iowa visits on Oct. 26.\n\n___\n\nMore AP college football: http://apnews.com/tag/Collegefootball and", "description": "EVANSTON, Ill. (AP) — Justin Fields threw for four touchdowns, J.K. Dobbins rushed for 121 yards and No. 4 Ohio State pounded Northwestern 52-3 on Friday night.", "authors": ["Andrew Seligman", "Associated Press"], "top_image": "https://www.businessinsider.com/public/assets/BI/US/og-image-logo-social.png", "published_at": "2019-10-19"}