{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7586639/Court-hear-bid-ban-Commons-vote-PM-s-Brexit-deal.html", "downloaded_at": "2019-10-18 02:05:03.300901+00:00", "title": "Court to hear bid to ban Commons vote on PM´s Brexit deal", "language": "en", "text": "A legal bid arguing Boris Johnson’s Brexit deal is unlawful and attempting to prevent it being voted on by MPs is set to be heard at Scotland’s highest civil court.\n\nCampaigner Jolyon Maugham QC is behind the legal challenge which will be heard at the Court of Session in Edinburgh.\n\nHe argues the new deal contravenes a current law stipulating it is “unlawful for Her Majesty’s Government to enter into arrangements under which Northern Ireland forms part of a separate customs territory to Great Britain”.\n\nThis part of the Taxation (Cross-border Trade) Act 2018, Section 55, was put forward by the Conservatives’ right-wing group of MPs known as the European Research Group (ERG).\n\nChanges to the agreements around Northern Ireland were a key part of the new Brexit deal agreed between the Government and the EU on Thursday.\n\nThe anti-democratic backstop has been abolished. The people of Northern Ireland will be in charge of the laws that they live by, and – unlike the backstop – will have the right to end the special arrangement if they so choose. #GetBrexitDone #TakeBackControl — Boris Johnson (@BorisJohnson) October 17, 2019\n\nThe Prime Minister tweeted it removes the “anti-democratic” Irish backstop.\n\nThe case will be heard at the Court of Session in Edinburgh (Jane Barlow/PA)\n\nThe EU’s chief negotiator Michel Barnier said under the new agreement Northern Ireland would be part of the UK’s customs territory, not the EU’s, but would “remain an entry point” into the EU single market and aligned to some EU rules on goods.\n\nThis means they must be checked on entry to the island of Ireland, rather than border checks between Northern Ireland and the Republic.\n\nMr Maugham, whose legal team earlier took legal action to try to prevent a no-deal Brexit by ensuring the Prime Minister obeys by the Benn Act, is seeking a court order, or interdict, banning the Government from putting the new deal before Parliament for a vote on Saturday.\n\nHe tweeted: “We do not understand how the Government might have come to negotiate a Withdrawal Agreement in terms that breach amendments tabled by its own European Research Group.\n\n“Unless and until Section 55 is repealed by the UK Parliament, it is simply not open, as a matter of law, for the United Kingdom to enter into such an agreement.”\n\nHe said if the court rules the new deal is “unlawful”, the Government will have to request a Brexit extension.\n\nMr Maugham added: “If the Government wants to seek Parliament’s consent to repeal section 55, it can and should seek that consent.\n\n“But it must not negotiate unlawful trade deals and then present them to Parliament as a fait accompli.”\n\nAnnouncing the new deal on Thursday, Mr Johnson tweeted: “We will leave the EU’s Customs Union as one United Kingdom and be able to strike trade deals all around the world.”", "description": "Campaigners argue the new deal struck between the Government and the EU contravenes existing law on customs arrangements.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/02/wire-19866334-1571363354-818_636x382.jpg", "published_at": "2019-10-18"}