{"pub": "americanconservative", "url": "https://theamericanconservative.com/dreher/i-will-shoot-you-i-said", "downloaded_at": "2019-10-05 13:32:45.576112+00:00", "title": "‘I Will Shoot You!’ I Said", "language": "en", "text": "Here’s a line no child should ever hear their father say: “If you come onto this property, I will shoot you!”\n\nMy kids heard me shout it three times this afternoon, at a large (6’5″) man in his twenties who was pursuing his mother. I saw her in the street and invited her to come shelter in my house. He followed her up my driveway, screaming at her. He only stopped when I threatened him with violence — and then only after I yelled it several times.\n\nI called 911. A sheriff’s deputy came and arrested the young man. This was not the first time I’ve called 911 on this guy. He and his mother moved in to a rental house on our block a few months back. The first time I called was when I saw him screaming and cursing at her in their front yard, and he took a swing at her. It has been a nightmare over there all summer. According to the deputy today, the sheriff’s department has been out ten times to deal with him.\n\nThe man is bipolar, and won’t stay on his medication. He is large, and extremely intimidating. His mother is scared to death. After the first incident, I went to their landlord, a dentist in town who does not live here. He denied that what I said happened had actually happened, and when I told him that my daughter and I had witnessed it ourselves, he got cagey, and said that if it did happen, there wasn’t anything he could do about it.\n\nThat turns out to be untrue, as further research showed. But I don’t know what we neighbors can do about this at all.\n\nThe young man is in jail tonight, because by returning to the house, he violated a judge’s order. He was not supposed to be living there … but his mother, whose safety the judge’s order was meant to protect, allowed him to be there. She claimed to us and to the deputy that she didn’t realize he wasn’t supposed to be there. I don’t know if I believe that or not. She also said that she is the only person that young man has in the world, and that without her, he might be homeless.\n\nI pity her greatly. I seriously do. As I said, she is terrified of him. She wept, and said that he used to be such a bright, kind boy. When mental illness descended on him a few years ago, it turned everything for them into a catastrophe. She is plainly desperate. You would have to have a heart of stone not to feel for her.\n\nYet her paralysis is going to get her hurt, or worse. I told her today that we cannot live like this anymore, and that we will not live like this anymore. This neighborhood should not have to live in fear because her son will not take his medication, and because she insists on tolerating his scary abuse of her. What’s more, he medicates himself not by taking his prescribed drugs, but by smoking pot. He offered to sell some pot to a neighbor on this street once. Imagine raising kids with this guy around.\n\nThe thing is … what if the mom is right? What if it really is the case that there is no institution for him, that he would become a homeless insane man, sleeping on the streets? I don’t know what the law is in my state governing cases like this, or what kinds of resources are available for people like that young man and his mother. Put yourself in her place. She loves him so much that she is willing to endure his rages, and the humiliations he puts her through in public (he stands in the yard and curses her at the top of his lungs, using filthy language) because in her mind, the alternative is homelessness.\n\nHowever, like others on this street, I too have children. Children who live in fear now. Children who had to watch their father put himself between a violent, insane man and his mother, and threaten to use his gun on the violent man if he came closer. They deserve better than this.\n\nTen times the sheriff’s deputies have been here over the past four months because of this violent young man’s behavior. This is a nice neighborhood of middle and working-class families. It is also a neighborhood whose peace and safety is held hostage in part by the de facto indifference of an absentee landlord.\n\nI’m not sure what happens next, but that dangerous, insane young man cannot come back to that house, or this street. Not after today. I don’t know what it’s going to take, but we hit the breaking point today.\n\nI am not a big Second Amendment guy, but I am grateful that in this country, and in this state, one is allowed to own a gun. I am grateful that I do own a gun, and know how to use it. I am also grateful that I live in a state with a castle law, and that if that insane man had come after his mother, to whom I had given shelter, and me, on my own property, I could have used deadly force to stop him — and would not have been charged. Thank God it didn’t come to that. This time. I have to use the time that that man is in jail this next week to make sure that there isn’t a next time. Not on this street.\n\nUPDATE: Some of you are misinterpreting my “not a big Second Amendment guy” comment, so let me clarify. My point was that I am not the sort of person who thinks much about the Second Amendment. I support it, of course, but I think about the First Amendment all the time; not the Second. Yesterday, however, I stumbled into a situation that illustrated the importance of protecting gun rights. Many liberals like to think of Second Amendment people as gun nuts. Yes, gun nuts exist, but I ain’t that guy. Yet the same Second Amendment that protects gun nuts (within limits; I do not oppose all gun control) also makes it possible for ordinary suburban dads like me to have a weapon to protect an abused mom from her violent insane adult son.\n\nThank you, Second Amendment.\n\nAlso, there was this sad, thoughtful comment left by a reader. It reminds us that there are real human beings in this story:\n\nI’m sorry, Rod. As a father of a child like that I feel for both your neighborhood and that mother. My oldest daughter is a teen with a diagnosis related to bipolar, and she is currently in a residential program where she is finally doing well (please pray for our family as she completes the program and comes back home hopefully early next year). We moved into a new neighborhood a couple years ago, and I don’t recall how many police runs we had to our house because our dd was violent, destroying things, and threatening my wife and other kids. She’s a big, solid girl, and I’m the only one strong enough to restrain her in a rage. If I’m not there…bad things can happen. And did (which led to residential). If she doesn’t get the help she needs, my fear is she will be like the son in your story. I see her face in the face of every homeless person I meet. It’s making me tear up right now. The mental health care in this country is crap. I would use stronger words, but not here. There are not enough beds in residential, not enough transition homes, no longterm living solutions. Other than jail. You do what you have to to protect your family and neighborhood. But please do everything you can to love on that mother. She’s isolated, afraid, and feels everyone blames her. She needs you and your neighbors more than you know.\n\nThat mother in my neighborhood is not a bad person. She is a mom who loves her son, but who is also terrified of him, and doesn’t know what to do. There is no good solution for her. The situation cannot continue as it is, because he poses a danger to her and to the neighborhood. But I think of my three children, and how I would feel if one of them became bipolar, and was faced with the choices that poor woman faces. I’m not saying this to exonerate her. Her irresponsible refusal to act has put herself and the neighborhood in danger. But I am saying, again, that you’d have to have a heart of stone not to have compassion for her.", "description": "", "authors": ["Rod Dreher"], "top_image": "http://www.theamericanconservative.com/wp-content/uploads/2019/09/0-1.jpg", "published_at": "2019-09-22"}