{"pub": "dailymail", "url": "https://thisismoney.co.uk/news/article-7535961/Treasury-face-losing-28bn-motorists-switch-tax-free-electric-cars-experts-predict.html", "downloaded_at": "2019-10-14 10:16:35.930898+00:00", "title": "Treasury face losing £28bn as motorists switch over to tax-free electric cars, experts predict", "language": "en", "text": "The Treasury is facing the loss of £28billion in revenue as people switch to tax-free electric cars, say experts.\n\nThe Government has pledged to make Britain carbon neutral by 2050, which means it will lose revenue from fuel duty.\n\nThis has fallen by nearly £19billion a year since 2000 and all £28billion will soon be lost if the system does not change, according to a think-tank.\n\nBoris Johnson is said to be pressing for fuel duties to be cut by 2p per litre in the forthcoming Budget.\n\nRebekah Stroud, a research economist at the IFS, said: 'The bigger challenge is that revenues are now set to disappear entirely over coming decades as we transition to electric cars' (pictured: a Tesla Model S electric car)\n\nThis would cost £1billion a year in lost revenue on top of the £5.5billion lost since 2010-11 arising from the failure to increase rates in line with inflation, the Institute for Fiscal Studies reported.\n\nRevenue from fuel duties now stands at £28billion a year, which is 1.3 per cent of national income after peaking at 2.2 per cent of national income in 1999-2000, the IFS said.\n\nHad it remained at that level, the Treasury would currently be getting an extra £19billion, according to the report.\n\nBut the Government's commitment to reaching zero net emissions by 2050 means that revenue from fuel duties will completely disappear over the next few decades, it said.\n\nThe IFS called for new taxes which can gradually replace fuel duties. 'These should reflect at least distance driven, and ideally vary according to when and where journeys take place,' it said.\n\nThose driving in busy places would pay more, but most journeys would be taxed less heavily than at present, it added.\n\nThe Treasury is facing the loss of £28billion in revenue as people switch to tax-free electric cars, say experts (pictured: the front of the Treasury Office in London)\n\nRebekah Stroud, a research economist at the IFS and co-author of the IFS Green Budget, said: 'Another 2p cut [in fuel duty], as reportedly mooted by the Prime Minister, would cost a further £1billion a year.\n\n'The bigger challenge is that revenues are now set to disappear entirely over coming decades as we transition to electric cars.\n\n'The Government should set out its long-term plan for taxing driving, before it finds itself with virtually no revenues from driving.'", "description": "The Government has pledged to make Britain carbon neutral by 2050, which means it will lose revenue from fuel duty. The revenue generated by fuel duty currently stands at £28billion.", "authors": ["Claire Ellicot Political Correspondent For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/01/19277670-0-image-a-114_1570147428741.jpg", "published_at": "2019-10-04"}