{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/best-current-credit-card-signup-bonuses", "downloaded_at": "2019-10-05 00:07:49.860039+00:00", "title": "12 of the best credit card offers in October, from 75,000 Delta miles to the best rewards card for beginners", "language": "en", "text": "Signing up for a rewards credit card and earning its welcome bonus is one of the easiest ways to earn a ton of points, miles, or cash back.\n\nWhile some credit card bonuses stay largely the same, others increase from time to time. Pay extra attention to these limited-time offers.\n\nIn October, you can score up to 75,000 miles with Delta's co-branded credit cards. And the Chase Sapphire Preferred Card's offer remains a great way to get started with some of the most valuable points around.\n\nRead more personal finance coverage.\n\nIf you want to earn points and miles, there's no quicker route than signing up for a rewards credit card and earning its sign-up bonus. This typically requires meeting a minimum spending requirement in the first three months or 90 days, and it's well worth it — you'll be rewarded with thousands of points or miles to put toward your next trip, or with a sizeable amount of cash back.\n\nBefore you apply for any new cards, make sure you understand how credit card applications affect your credit score. Then, scroll down to check out some of the best sign-up offers available in October.\n\nKeep in mind that we're focusing on the rewards and perks that make these credit cards great options, not things like interest rates and late fees, which can far outweigh the value of any rewards.\n\nWhen you're working to earn credit card rewards, it's important to practice financial discipline, like paying your balances off in full each month, making payments on time, and not spending more than you can afford to pay back. Basically, treat your credit card like a debit card.\n\nWelcome offer: 60,000 Chase points after you spend $4,000 in the first three months\n\nAnnual fee: $95\n\nIf you want a rewards credit card with points that can be used with a variety of travel partners, you can't go wrong with the Sapphire Preferred. It's one of the best general credit card picks if you're new to the world of points and miles or if you don't want to pay the $450 annual fee of the Chase Sapphire Reserve, as the Sapphire Preferred has a $95 annual fee.\n\nThe card has been offering a 60,000-point sign-up bonus for the last several months, and you can use those points to book travel directly through Chase, or you can transfer them to partners like British Airways, Hyatt, Singapore Airlines, and United.\n\nBeyond earning some of the most valuable points around, the Sapphire Preferred offers primary car rental insurance and doesn't charge foreign transaction fees.\n\nWelcome offer: 60,000 Amex points after you spend $5,000 in the first three months\n\nAnnual fee: $550\n\nIf you travel frequently and can put its many, many benefits to use, the Amex Platinum can be an easy decision even with its $550 annual fee. See how Business Insider's David Slotnick got more than $2,000 in value from the card in his first year for more info.\n\nSome of the card's top perks include a 5x earning rate on airfare purchased directly from the airline, up to $200 in airline fee credits each calendar year, up to $200 in Uber credits each cardmember year, and up to $100 in Saks Fifth Avenue credits each calendar year.\n\nThe card also stands out for its airport lounge access benefits. As a card member, you can access Amex Centurion Lounges, Delta Sky Clubs (when you're flying Delta), Priority Pass lounges, Air Space Lounges, International American Express Lounges, Escape Lounges, and Plaza Premium Lounges.\n\nYou can use the Amex Membership Rewards points you'll earn with this card to book travel with airlines like British Airways, Delta, and Emirates, and with hotel partners including Marriott.\n\nWelcome offer: 60,000 SkyMiles after you spend $2,000 in the first three months. Plus, earn a $50 statement credit when you make a Delta purchase in the first three months. This offer is only available until October 30.\n\nAnnual fee: $95; waived the first year\n\nDelta and Amex announced many positive updates to its lineup of co-branded airline credit cards. While the changes won't take effect until January 30, 2020, three Delta consumer credit cards are offering elevated welcome bonuses now through October 30.\n\nNext year, the Gold Delta Amex will add 2x miles at US supermarkets and at restaurants and a $100 Delta flight credit when you spend $10,000 on the card in a year. The card will no longer offer an Medallion Qualification Dollar waiver benefit for elite status, and the reduced Delta Sky Club admission perk will be discontinued. The annual fee will be increasing slightly, to $99.\n\nWelcome offer: 100,000 Marriott points after you make $5,000 in qualifying purchases in the first three months. Plus, get a 0% APR on purchases for the first six months, then a variable rate of 17.49% to 26.49%.\n\nAnnual fee: $125\n\nThis is a good month for business credit card welcome bonuses, as several of them are currently elevated. One example is the Marriott Bonvoy Business Amex, which is offering 25,000 more points than its standard welcome bonus now through October 23.\n\nBeyond the welcome bonus, this card offers an annual free night award for hotels that cost up to 35,000 points, and cardholders get complimentary Marriott Silver status. This could be a good choice for your business if you travel frequently and could make good use of Marriott points for an upcoming vacation.\n\nWelcome offer: 75,000 SkyMiles and 5,000 MQMs after you spend $3,000 in the first three months. Plus, earn a $100 statement credit when you make a Delta purchase in the first three months. This offer is only available until October 30.\n\nAnnual fee: $195 ($250 if application is received on or after January 30, 2020)\n\nLike the Gold Delta Amex, the Platinum Delta card is offering an elevated welcome bonus in October to celebrate the upcoming changes to the Delta line of Amex cards.\n\nIf you apply for the Platinum Delta Amex on or after January 30, 2020, you'll pay a higher annual fee of $250. However, at that time, the card will also be adding 3x miles (up from 2x) on Delta purchases, plus 2x miles at restaurants and US supermarkets. Additionally, the card will gain a statement credit of up to $100 to cover the application fee for Global Entry or TSA PreCheck.\n\nWelcome offer: 50,000 Amex points after you spend $10,000 and another 50,000 points after you spend an additional $15,000 all on qualifying purchases in the first three months\n\nAnnual fee: $595\n\nUntil December 4, the Business Platinum Amex is offering an elevated welcome bonus of up to 100,000 points. You'll have to spend a total of $25,000 in the first three months to earn the full bonus, but if your business can easily meet that spending requirement, it could be well worth it.\n\nBased on The Points Guy's valuations, 100,000 Amex points are worth $2,000. The card's standard welcome bonus is for 75,000 points, so now's a great time to apply if you were already considering the Business Platinum.\n\nCard benefits include up to $200 in airline incidental fee credits each year, up to $200 in annual Dell statement credits, complimentary Gold status with Hilton and Marriott, and airport lounge access. If you enroll by December 31, you can also get a year of Platinum Global WeWork access, which means you can use coworking spaces around the world.\n\nWelcome offer: 50,000 miles after you spend $3,000 in the first three months\n\nAnnual fee: $95 (waived the first year)\n\nThe Venture Rewards card has consistently added benefits over the last year or so. While previously you could only use miles to erase purchases on your statement, you can now transfer them to a variety of airline programs, including Air Canada, Air France/KLM and Etihad. There are occasionally transfer bonuses that help you stretch your miles further, too.\n\nThis card offers a strong lineup of benefits considering the reasonable $95 annual fee (that's waived the first year). You get an application fee credit of up to $100 for Global Entry or TSA PreCheck, and earn 10x miles when you book hotels through the hotels.com/venture landing page.\n\nEarning 10 miles per dollar on hotels is hard to beat, and that's in addition to the free night for every 10 paid nights you book that you'll earn through the Hotels.com Rewards program. You'll also earn 2x miles on all non-hotel purchases.\n\nWelcome offer: 30,000 bonus points after you spend $3,000 in the first three months\n\nAnnual fee: $0\n\nIf you prefer earning cash back to points and miles, the Wells Fargo Propel is a great choice. It earns 3 points per dollar on dining, on travel, gas stations, rideshares, and on popular streaming services, and 1 point per dollar on everything else. That's a strong selection of bonus categories, and it's even better when you consider that this card has no annual fee.\n\nThe Propel Card also includes cell phone protection, and there are no foreign transaction fees.\n\nWelcome offer: 35,000 Amex points after you spend $2,000 in the first three months\n\nAnnual fee: $250\n\nIf you eat out or buy groceries on a regular basis, the Amex Gold card is made for you. You'll earn 4 points per dollar at restaurants, and 4 points per dollar on the first $25,000 spent at US supermarkets each year (then 1 point per dollar). The card also offers up to $120 in dining credits each year, split into $10 each month, at Grubhub, Seamless, The Cheesecake Factory, Ruth's Steak House, or participating Shake Shack locations.\n\nAs with the Amex Platinum, you can use the Amex Membership Rewards points earned from this card to book travel with more than 15 airline partners and three hotel programs (Choice, Hilton, and Marriott).\n\nWelcome offer: 125,000 points after you spend $3,000 in the first three months\n\nAnnual fee: $89\n\nThis is a solid hotel co-branded credit card thanks to its annual free night benefit – each year after your account anniversary, you'll get a free night certificate that you can use at IHG hotels that cost up to 40,000 points per night. The card also offers complimentary Platinum Elite IHG status and a statement credit of up to $100 to cover the cost of Global Entry or TSA PreCheck.\n\nThe IHG Premier Card just launched a new sign-up offer that gets you 45,000 more points than the previous 80,000-point bonus. So if you can fit any IHG points stays into your upcoming travel plans, that higher bonus — combined with the annual free night — make this a strong option.\n\nWelcome offer: 80,000 points after you spend $5,000 in the first three months\n\nAnnual fee: $95\n\nThe Ink Business Preferred card offers the highest sign-up bonus among Chase cards that earn Ultimate Rewards points. Plus, it has generous bonus categories — you'll earn 3 points per dollar in the first $150,000 in combined purchases you make on categories including travel, shipping, and advertising (and 1 point per dollar on everything else).\n\nThis card has a $95 annual fee, and it offers benefits like primary rental car insurance when you're renting a car for business purposes.\n\n12. 75k points with the Brex corporate card\n\nWelcome offer: 75,000 points upon sign-up with the Brex Corporate Card for Startups and the Brex Corporate Card for Ecommerce\n\nAnnual fee: None\n\nThe two versions of the Brex corporate card could be worth a look if you have a small business and are willing to make this your exclusive corporate card. When you do, you can earn up to 7x points on purchases, and you can redeem points with seven airlines, including JetBlue and Singapore Airlines. The Brex Corporate Card for Startups and the Brex Corporate Card for Ecommerce are offering elevated bonuses of 75,000 points to those who sign up by October 31.\n\nRead more: Brex corporate credit card review\n\nMore credit card coverage", "description": "The best credit card offers of October, including bonuses from Marriott, Delta, and the Amex Platinum.", "authors": ["Sarah Silbert"], "top_image": "https://image.businessinsider.com/5d7933a42e22af0cf7025264?width=1200&format=jpeg", "published_at": "2019-10-04"}