{"pub": "breitbart", "url": "https://breitbart.com/news/bruce-springsteen-surprised-relative-from-1800s-also-played-guitar", "downloaded_at": "2019-10-22 14:02:29.898924+00:00", "title": "Bruce Springsteen surprised relative from 1800s also played guitar", "language": "en", "text": "Oct. 22 (UPI) — Bruce Springsteen said on Jimmy Kimmel Live he recently discovered that a relative of his from the 1800s also played guitar.\n\nThe music icon said on Monday that he made the discovery while visiting a museum exhibit in his hometown of Freehold, N.J., dedicated to his life and career.\n\n“They traced the Springsteens all the way back to the Revolutionary War,” Springsteen told Kimmel who has taken his talk show to Brooklyn for the week.\n\n“They traced up to the Civil War and the most interesting thing was they had a small parlor guitar, which is what people played in those days,” he continued.\n\n“A small guitar going back to the 1800s, supposedly from one of my relatives so I’m not the first guitar player in the Springsteens,” he said.\n\nSpringsteen also discussed his upcoming Western Stars film and how his children were not interested in his career.\n\n“Your kids are into you watching them,” Springsteen said. “Kids don’t want to go anywhere and see 50,000 people cheering for their parents. They would like to see 50,000 people boo their parents.”\n\n“Our kids have been relatively uninterested in the job that I’ve done their entire lives,” he said.\n\nSpringsteen and his wife Patti Scialfa are parents to 29-year-old Evan James, 27-year-old Jessica Rae and 25-year-old Sam Ryan.\n\nWestern Stars, which features the music star performing songs from his album of the same name, is set to hit theaters on Friday.", "description": "Oct. 22 (UPI) — Bruce Springsteen said on Jimmy Kimmel Live he recently discovered that a relative of his from the 1800s also played guitar. The", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-22"}