{"pub": "nymag", "url": "https://thecut.com/2019/08/im-finally-making-money-but-it-doesnt-feel-great.html", "downloaded_at": "2019-09-03 23:50:21.142410+00:00", "title": "‘I’m Finally Making Money, But It Doesn’t Feel Great’", "language": "en", "published_at": "2019-08-28", "text": "The Cut’s financial advice columnist Charlotte Cowles answers readers’ personal questions about personal finance. Email your money conundrums to mytwocents@nymag.com Photo: Express/Getty Images\n\nDear Charlotte,\n\nFor the first time in my life, I’m making a really good salary, and so is my husband. We’ve always been very careful with money. We both maxed out our 401(k)s and IRAs even when we made tiny starting salaries. We have a healthy emergency fund and an investment account that we filled in our 20s. We have no children, a mortgage with a cheap monthly payment, and healthy parents who support themselves.\n\nNow that we have all these extra funds, we could be saving a lot more, but instead we spend it on fun vacations and nice clothing. I went from a ten-year-old reliable Japanese car to a Tesla, and a random thrift-store purse to a super-nice one from France. I’m a painter (not my day job) and have bought so much paint on sale that I could probably never buy paint again. Before I even got out of bed yesterday, I spent $450 on a warehouse sale from this brand I’ve become obsessed with. I buy clothes on Instagram constantly. It’s like now that I have all this extra money, I feel like I’ve become this whole new person I don’t recognize. How can I go back to being someone who’s fine with mismatched plates and thrift-store items, instead of this trend follower with a perfect house filled with nice shit that doesn’t matter?\n\nI understand why you miss your old life. It feels good to live simply and to work toward larger financial goals. The problem, it seems, is that you never really envisioned the life you’d lead once you actually accomplished those goals and had money to spare. Now that your discipline has paid off — you’ve not only attained financial stability, but actual wealth — you don’t know what to do with it. Your spending feels wild and out of control because you identify as someone who usually shows more restraint. It sounds like you’re struggling to reconcile that responsible part of yourself with the one who wants to live a little — and now has the means to do so.\n\nI suspect you may also be feeling a little bit lonely. Studies have found that upward mobility, particularly when it involves transitioning to a higher socioeconomic class, can be isolating because it moves people away from familiar social circles and into unfamiliar ones. The research shows that this is especially pernicious among women and minorities because they have fewer mentors and models to look toward as they make their way up the income ladder. It’s also tough to talk about — having a surplus of money isn’t exactly a “problem,” nor a situation that most people can relate to.\n\nRight now, it seems like you’ve been following a sort of rich-person life template that’s readily available on Instagram and social media. It’s a seductive world of handwoven throw pillows and tasteful ceramics, and it’s also a bottomless money pit. Still, it doesn’t seem like you’ve gone off the rails. I get the feeling that you see yourself as someone spraying hundred-dollar bills out of a grenade launcher, but let’s look at reality. You bought a purse, some clothes, paint on sale, and an environmentally-friendly car that will save you gas money over the years? Cut yourself some slack, and chalk it up to a learning experience.\n\nYou don’t necessarily need to save more — it seems like you’re doing fine in that department. Instead, you need to find a new source of the virtuous feeling that you used to get from socking money away, and that involves exploring new things to do with it. In other words, you should spend some time rethinking your priorities now that you have more money to spend on them.\n\nI suggest an exercise that financial adviser Manisha Thakor got me to try a few years ago: Write down everything you spend your money on, every day, for a couple of weeks (I use the Notes app on my phone, but anything goes). Then look at your list and highlight the things that felt worthwhile and satisfying. Did those new paints bring you a lot of pleasure? Are you still excited about that shirt you bought last week? Did you come home from that nice vacation feeling closer with your husband? Or maybe none of those things were that great, in retrospect, and you wish you’d put that money toward your friend’s fundraiser or, say, a political cause instead.\n\nIt may sound corny, but keeping better track of where your money goes will give you more clarity on the expenses that are meaningful to you. In doing this exercise, you’ll probably find that spending money on experiences, especially ones that strengthen your relationships, makes you happier than buying stuff — research indicates that this is the case. But it’s okay to experiment, even if it means you make some bad, expensive decisions on Instagram on a Saturday morning. In Marie Kondo parlance, pay attention to what spending habits bring you joy, versus what makes you feel overwhelmed, guilty, or nothing at all.\n\nSpeaking of guilt: It sounds like you have some. That’s fine and normal. I don’t mean that you should feel bad about having money. Instead, it’s good to be aware that you’ve been lucky — plenty of people never get to see the fruits of their labor in the same way that you have. Amanda Clayman, a financial therapist based in L.A., recommends gratitude exercises (writing down a few things per day or per week that you’re thankful for), which have been shown to help people in your situation. “When you focus more on what you have, it helps you stay focused on what’s important to you, instead of what you’re missing,” she says.\n\nWhile your new life may seem unrecognizable, that doesn’t mean you’ve lost the ambition and drive that got you here — you just need to learn to redirect them.", "description": "For the first time in my life, I’m making a really good salary. But now that I have all this extra money, I feel like I’ve become this whole new person I don’t recognize.", "authors": ["Charlotte Cowles"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/08/28/28-my-two-cents.w1200.h630.jpg"}