{"pub": "yahoo", "url": "https://news.yahoo.com/mechanic-accused-sabotaging-american-airlines-145159580.html", "downloaded_at": "2019-09-19 23:15:29.429085+00:00", "title": "Mechanic Accused of Sabotaging American Airlines Flight May Have Ties to Terrorism, Prosecutors Say", "language": "en", "text": "A federal judge Wednesday denied bail to an American Airlines mechanic accused of tampering with an aircraft with 150 people on board, saying he had seen evidence suggesting the mechanic had terrorist sympathies.\n\nAbdul-Majeed Marouf Ahmed Alani, a naturalized U.S. citizen who was born and has family in Iraq, was arrested Sept. 5 after admitting to investigators he had tampered with the aircraft’s navigation system before it took off from Miami International Airport. Alani told investigators he had been involved in a contract dispute with the airline, and had disabled the system so he could get more overtime working to fix the problem. He was charged with “willfully damaging, destroying or disabling an aircraft.”\n\nBut prosecutors presented what they said was new evidence in court, alleging that Alani lied about traveling to Iraq in March to visit his brother, whom he had previously told a colleague was a member of ISIS, the Miami Herald reported.\n\nThey also said that they had found an ISIS video on Alani’s phone showing an execution, accompanied by an Arabic text message from Alani to somebody else asking Allah to take revenge against non-Muslims, according to NBC News. They also said he had sent $700 to somebody in Iraq.\n\nIn response, Magistrate Judge Chris McAliley denied Alani bond. “I have evidence before me that suggests you could be sympathetic to terrorists,” he said, ruling Alani posed a danger to the community and a flight risk. If convicted on Friday, Alani faces up to 20 years in prison.\n\nAlani’s defense said his actions did not endanger the people on board the airline. “We don’t believe he intentionally endangered the safety of people,” said assistant federal public defender Christian Dunham, arguing that the flight had a backup navigation system. “I think the government is blowing this out of proportion.”\n\nThe plane ended up not taking off after the incident on July 17. As it sped down the runway, pilots were alerted to an error and aborted takeoff, and the plane was returned for maintenance at which point a piece of foam was discovered glued into the flight’s navigation system.", "description": "Prosecutors said a mechanic accused of tampering with an American Airlines flight in Miami had terrorist sympathies.", "authors": ["Billy Perrigo"], "top_image": "https://s.yimg.com/uu/api/res/1.2/HpG28fwbDJuEgmdgcSNrsw--~B/aD02ODM7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/time_72/197e71e7086e81ef7347e274300d101b", "published_at": "2019-09-19"}