{"pub": "foxnews", "url": "https://foxnews.com/media/eric-swalwell-trump-betrayal-ukraine", "downloaded_at": "2019-09-25 04:35:50.629060+00:00", "title": "Rep. Swalwell accuses President Trump of 'betrayal' over Ukraine phone call", "language": "en", "text": "Rep. Eric Swalwell, D-Calif., accused President Trump of \"betrayal\" Tuesday after House Speaker Nancy Pelosi formally announced an impeachment inquiry over the commander-in-chief's interactions with Ukraine's president.\n\n\"When you ask a foreign government for help you owe them something which means one day you may have to put another country's interests ahead of America's interests, which to me is betrayal,\" Swalwell said on \"The Story with Martha MacCallum.\"\n\nTrump allegedly pushed Ukraine President Volodymyr Zelensky to investigate former Vice President Joe Biden and his son Hunter.\n\nBiden has acknowledged that while he was vice president, he successfully pressured Ukraine to fire its top prosecutor, Viktor Shokin, while Shokin was investigating the natural gas firm Burisma Holdings — where Hunter Biden was on the board. Shokin himself had separately been accused of corruption.\n\nTRUMP VOWS TO RELEASE TRANSCRIPT OF CALL WITH UKRAINE'S PRESIDENT\n\nSources told Fox News that Trump personally ordered White House Acting Chief of Staff Mick Mulvaney to freeze nearly $400 million in military aid to Ukraine just days before he allegedly discussed the potential investigation of the Bidens with Zelensky.\n\nWhen MacCallum asked Swalwell about the importance of the intelligence community whistleblower report, the congressman said it was not needed for an investigation and described it as \"color.\"\n\n\"We already have the president's admission... he's copped to the crime. So we don't really need the whistleblower report,\" Swalwell said. \"I think it will add color to the investigation.\"\n\nSwalwell also said Trump's alleged comments during the phone call was enough for impeachment.\n\n\"But again, if that had never happened -- if he had never worked with the Russians or embraced their help or obstructed justice or took money from foreign nationals, this act alone would be impeachable, \"Swalwell said.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe congressman also believes direct \"quid pro quo\" statements are not needed, that the president's own words are enough to impeach.\n\n\"When you listen to the president's own words, by asking the Ukrainians to do this when you ask somebody to do something you owe them something in the future... that's enough,\" Swalwell said.\n\nFox News' Gregg Re contributed to this report.", "description": "Rep. Eric Swalwell, D-Calif., accused President Trump of \"betrayal\" Tuesday on the heels of House Speaker Nancy Pelosi announcing Tuesday the formalization of an impeachment inquiry over the commander-in-chief's phone call with Ukraine's president.", "authors": ["Victor Garcia"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/McCallum-Swalwell-Trump_FOX-AP.jpg", "published_at": "2019-09-25"}