{"pub": "businessinsider", "url": "https://businessinsider.com/who-is-anduril-founder-ceo-brian-schimpf-2019-10", "downloaded_at": "2019-10-27 00:24:25.458284+00:00", "title": "The left-leaning cofounder of a $1 billion defense startup building drone destroyers and a virtual border wall says if they don't do the work, the United States military loses", "language": "en", "text": "Everyone in tech knows Palmer Luckey, the virtual-reality wunderkind who said he was fired from Facebook after he supported a pro-Trump meme group during the 2016 election. His new company, Anduril, takes on traditional defense contractors with next-generation tech.\n\nThe company's lesser-known cofounder and chief executive is Brian Schimpf, who rose through the engineering ranks at Palantir and joined Anduril with the goal of equipping government agencies with the most advanced defense technology on the planet.\n\nIt's already shipping military-grade drones capable of taking out other drones and has installed sensor-laden sentry towers along the Mexico border to help detect unauthorized crossings.\n\nSchimpf, a self-described \"lifelong Democrat,\" argues that the defense work that Anduril is doing is necessary for the United States to sustain its military superiority over Russia and China.\n\nClick here for more BI Prime stories.\n\nWorking at Anduril isn't for everyone.\n\nThe Irvine, California-based company has been called tech's most controversial startup, known for its surveillance tools designed to detect migrants and traffickers crossing into the US from Mexico.\n\nAnduril is also closely associated with Peter Thiel, the Trump-supporting venture capitalist whose firm is one of the company's main backers, and Palmer Luckey, the virtual reality whiz who donated to a pro-Trump meme group during the 2016 election and started Anduril after getting fired from Facebook.\n\nThat makes CEO Brian Schimpf's presence at the helm of the company all the more remarkable.\n\nA self-described \"lifelong Democrat,\" the New York-raised Schimpf is one of Anduril's five cofounders and the most obvious incongruity in the company's upper ranks.\n\nSchimpf may not share Luckey's politics, but he's as enthusiastic about the company's mission, which he insists is nonpartisan.\n\nAnduril's products, which include high-tech watchtowers and attack drones, will be relevant in any administration, Trump or no Trump, he tells Business Insider. \"It doesn't matter who's in charge.\"\n\nAt a time when working with the US military and immigration agencies has become taboo among Silicon Valley's tech establishment, Anduril is rushing to fill the void. It has shipped dozens of drones to military clients here and in Europe, and has contracts with half a dozen agencies of the Department of Defense to install surveillance systems at military bases and along the Mexico border, according to reporting by NBC News and Bloomberg.\n\nIt's easy to understand the business motive guiding Anduril and its other founders. But while some members of Silicon Valley have chosen to dismiss the company as a fringe MAGA crew, the 35-year-old Schimpf embodies the more difficult questions and conflicting impulses that the tech industry is now trying to come to terms with.\n\n\"Everyone who I know, knows me well and knows why I'm doing what I'm doing,\" he said on the phone, shrugging off a question about whether he's felt any stigma with acquaintances because of his job.\n\nHe stresses that the employees at Anduril are a politically diverse group, and that another cofounder Matt Grimm, is a political liberal. The passion for innovation and the urge to change the world — the formula to Silicon Valley's success that now seem in such disarray — are as aligned as ever at Anduril, in Schimpf's view.\n\n\"People know what they signed up for here,\" he said. \"Everyone is selected into this mission.\"\n\nBefore he raised money from Peter Thiel, he worked for him at Palantir\n\nNamed for a sword in \"The Lord of the Rings,\" Anduril bills itself as the scrappy challenger to defense contractors like Lockheed Martin and Boeing. It combines off-the-shelf hardware with custom software to bring next-generation technology to military bases and conflict zones, \"faster and more effectively\" than its competitors. The goal is to equip soldiers with the most evolved tech on the planet, before supercharged states like China and Russia crack it.\n\nThe company boasts 140 employees, mostly engineers, and a rich, $1 billion valuation among private investors.\n\nSchimpf has been preparing for a career in government from the time he was a college junior. At Cornell, he was part of a team of students working on a self-driving car for the DARPA Grand Challenge, a contest funded by the most prominent research group at the Department of Defense. The challenge brought him to the Mojave Desert for a semester, where the mostly undergraduate contestants tested their vehicle over cliffs and washboard terrain.\n\nIt unlocked in Schimpf a desire to create technologies that solve hard problems. He looked at the \"big names in tech,\" but it was a conversation with a former classmate about Palantir, a then four-year-old data analytics startup from Palo Alto, that got him thinking about joining a startup before it was cool or lucrative to do so.\n\nAnduril's cofounder and chief executive Brian Schimpf. Anduril\n\nHe remembers his friend \"gave a horrible description of what (Palantir) did,\" which was understandable. The company founded by Facebook board member and venture capitalist Peter Thiel has a reputation for secrecy because of its work with large corporations and government agencies to manage, analyze, and secure data. Schimpf flew out to meet with dozens of employees and interview for a job.\n\nHe wound up staying at Palantir for almost a decade.\n\nIn his first role as an engineer, Schimpf tinkered with the company's software to make it more useful for government, policing, and military organizations. The role had a degree of purpose he enjoyed, and Schimpf grew an appreciation for the clientele's dedication.\n\n\"It's often hard to perceive how folks in the government view their job, especially in the national security space. It is very much a calling. It is something that they are very passionate about,\" he said. \"It changes how you think about what you can do to support them.\"\n\nHe spent a year working with its commercial customers but found \"optimizing insurance was never as exciting as counterterrorism.\" He rose to director of engineering, as the company's staff exploded from about 60 employees at the time he joined to more than 2,000.\n\nAnduril aspires to be Stark Industries\n\nThe story goes that the day Luckey was fired from Facebook, he reached out to Trae Stephens, a former engineer at Palantir who left to become a partner at Founders Fund. The two had met through the firm a year before and became friends, discussing half-baked ideas for a defense tech company that they likened to Stark Industries.\n\nThe cofounders gave their pitch to a room full of Palantir's directors, which Schimpf also attended. He signed on as the fifth cofounder.\n\nAnduril has close to 150 employees, mostly engineers based in Orange County. Anduril\n\nFrom the start, the goal was to take the best minds in artificial intelligence, autonomous systems, and computer vision out of Silicon Valley and bring them into the defense tech industry.\n\n\"Nobody who's top in those fields is going to Northrop or Lockheed. It's just not happening,\" Schimpf said.\n\n\"The reality is they're going to Google, they're going to Facebook, they're working on, frequently, things like ad optimization. I don't think it's for lack of interest in the national security space. There's incredibly interesting problems. There's a lot of people who are very passionate about it. I think it's for lack of a place to go where they feel like they can have impact and work on the technologies and problems they want to work on.\"\n\nIt wasn't clear at the beginning how recruiting would go, for any number of reasons. The first product was a system to monitor the Mexico border. Luckey's alleged ties to an pro-Trump group made him an outcast in the liberal tech world, while investor Thiel was scorned in the valley as a member of Trump's presidential transition team.\n\n\"The question we always get from folks in college is thinly veiled around, 'Is this company set up to be a pro-Trump conspiracy?' Or something along those lines,\" Schimpf said of campus recruiting.\n\nAnduril found that when employees are clear and candid about the work they do and why they believe in it, candidates respond. Most would agree that some border security is a necessity, Schimpf said. Democrats have protested that building a wall is wasteful and \"doesn't solve the problem,\" but many in Congress have supported legislation tied to broader security measures, like funding for hiring border personnel and technology used to monitor the perimeter.\n\nSchimpf says the team feels compelled to build next-generation defense tech\n\nThe company's sensor-laden sentry towers are only the start. Its core product is software. The Lattice system uses radar, cameras, and artificial intelligence to stitch together a complete picture of what's happening in a defined area. Today, the software can detect a person entering the area, but it can't tell if they are unauthorized or armed.\n\nSchimpf said only a minority of the company's revenue comes from US Customs and Border Protection.\n\nIn October, Anduril revealed a drone that's capable of locking onto other drones and ramming them out of the air. The goal is to help the military remove the \"constant threat\" of enemy drones dropping explosive devices, Schimpf said. A drone and missile attack in Saudi Arabia last month annihilated two oil facilities that process most of the country's crude supplies. The attacker was not immediately clear.\n\nAnduril's Interceptor drone seeks out target drones, identifies them, and then asks an operator's permission to attack. Anduril\n\nThough critics accuse the company of abetting Trump's border and immigration policy, Schimpf defends the work as nonpartisan. He argues that a startup can simply do more, faster, to evolve the government's defense tech than the big defense contractors can.\n\n\"It boils down to a question of democratic values,\" Schimpf said. \"Do you believe the world is a better place with a strong US power? Or do you believe it's better with, say, a strong Chinese military power?\"\n\n\"That is fundamentally why we are working on this,\" he added. \"It's not one of those things that if some people in the US don't work on this, no one moves forward. China and Russia are making progress.\"\n\nThat perspective may not yet be shared by his Northern peers in Silicon Valley. And for Schimpf, that's probably just fine.", "description": "Brian Schimpf, the lesser-known cofounder and CEO of Anduril, likens the unicorn defense tech startup to Stark Industries.", "authors": ["Melia Russell"], "top_image": "https://image.businessinsider.com/5daf99bd4af9092b5563a5a2?width=1200&format=jpeg", "published_at": "2019-10-26"}