{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7553957/Coleen-Rooney-Rebekah-Vardy-FEUD-Social-media-ERUPTS-memes-WAGS-war.html", "downloaded_at": "2019-10-09 10:57:09.373725+00:00", "title": "Coleen Rooney and Rebekah Vardy FEUD: Social media ERUPTS with memes as the WAGS go to war", "language": "en", "text": "Following Coleen Rooney's accusations that Rebekah Vardy has been planting false stories about her life, the Internet was awash with hilarious and shocking memes.\n\nOn Wednesday morning, the presenter and philanthropist, 33, took to Instagram and Twitter to 'expose' the pregnant I'm A Celeb star, 37, for allegedly taking stories from her social media accounts and selling them to them to the press.\n\nNaturally, fans were delighted with the shock spat and soon took to Twitter to share a number of memes and messages about the feud, including many users saying they were reaching for popcorn and others comparing it to a Footballer's Wives episode.\n\nShocker: Following Coleen Rooney's accusations that Rebekah Vardy has been planting false stories about her life, the Internet was awash with hilarious and shocking memes (the WAGs pictured together in 2017)\n\nColeen took to social media to accuse her pregnant friend Rebekah of selling stories on her private life in an extraordinary rant. She revealed she had been suspecting that someone had been betraying her and that she thought of a plan.\n\nShe admitted she has been planting false Instagram stories on her private page and blocking all her other friends to prove that Rebekah, 32, was the guilty party.\n\nShe admitted that stories about her basement flooding, gender selection and so on were only viewed by Rebekah and these were subsequently followed by outlets.\n\nRebekah subsequently hit back at the star and insisted the claims were false.\n\nDelighting! One tweet featured a screengrab showing Larry Lamb and Alison Steadman in Gavin And Stacey, with her character Pam saying: 'It's all the drama, Mick. I just love it!'\n\nHappy days! Fans soon took to Twitter to share a number of memes, with many likening the feud to a storyline from hit noughties TV show Footballer's Wives (Pictured: Tanya Turner, played by Zoe Lucker, and Laila Rouass' character Amber Gates)\n\nFans soon took to Twitter to share a number of memes, with many likening the feud to a storyline from hit noughties TV show Footballer's Wives.\n\nIn the hit show, Tanya Turner, played by Zoe Lucker, was in a long-standing war with Laila Abdesselam Rouass' character Amber Gates.\n\nOne tweet featured a screengrab showing Larry Lamb and Alison Steadman in Gavin And Stacey, with her character Pam saying: 'It's all the drama, Mick. I just love it!'\n\nShocker: One user shared a screengrab from The Inbetweeners, with Simon saying: 'I dunno, I think that's a bit dodgy, mate'\n\nHa! Getting in on the action, the official account for Netflix penned: 'we're going to have to make a documentary about this, aren't we'\n\nAnother fan was so thrilled by the highly dramatic turn of events that they branded the scenario: 'Dynamite' alongside a picture of SpongeBob character Patrick.\n\nGetting in on the action, the official account for Netflix penned: 'we're going to have to make a documentary about this, aren't we'.\n\nOne of Coleen's supporters suggested she be awarded for her efforts, with the user writing: 'the pulitzer prize for investigative reporting goes to coleen rooney'.\n\nPointless host Richard Osman wrote: 'I will vote for any political party who agree to immediately give us the rest of the day off so we can follow this Coleen Rooney/Rebekah Vardy thing properly.'\n\nIn her original post, Coleen wrote: 'For a few years now someone who I trusted to follow me on my personal Instagram account has been consistently informing The Sun newspaper of my private posts and stories.\n\n'There has been so much information given to them about me, my friends and my family - all without my permission or knowledge. After a long time of trying to figure out who it could be, for various reasons, I had a suspicion.\n\nThe full statement: Coleen made these claims on social media after discovering she had been betrayed by someone close to her and wrote that it was Rebekah Vardy\n\n'To try and prove this, I came up with an idea, I blocked everyone from viewing Instagram except ONE account. '\n\nShe continued: '(Those on my private account must have been wondering why I haven't had stories on there for a while). Over the past five months I have posted a series of false stories to see if they made their way into the Sun newspaper.\n\n'And you know what, they did! The story about gender selection in Mexico, the story about returning to TV and then the latest story about the basement flood in my new house.\n\nOh my! The scenes were likened Kerry Washington's TV show Scandal\n\n'It's been tough keeping it to myself and not making any comment at all, especially when the stories have been leaked, however I had to. Now I know for certain which account/individual it's come from.\n\n'I have saved and screenshotted all the original stories which clearly show just one person has viewed them. It's......... Rebekah Vardy's account.'\n\nShe also wrote: 'This has been a burden in my life for a few years now and finally I have got to the bottom of it......'", "description": "Following Coleen Rooney's accusations that Rebekah Vardy has been planting false stories about her life, the Internet was awash with hilarious and shocking memes", "authors": ["Ciara Farmer For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/11/19486274-0-image-a-23_1570617284366.jpg", "published_at": "2019-10-09"}