{"pub": "yahoo", "url": "https://news.yahoo.com/she-stole-lives-woman-convicted-153116041.html", "downloaded_at": "2019-10-20 00:46:08.242644+00:00", "title": "'She stole their lives': Woman convicted of passing school bus, killing 3 kids in crash", "language": "en", "text": "FULTON COUNTY, Ind. – Nearly a year after Alyssa Shepherd drove past a stopped school bus, killing three siblings as they crossed a two-lane highway to board the bus, a Fulton County jury convicted her of reckless homicide in the children's deaths.\n\nShepherd, prosecutors say, was driving a pickup truck that struck and killed twins Xzavier and Mason Ingle, both 6, and their sister Alivia Stahl, 9, and also critically injured Maverik Lowe, 11, as they crossed the highway north of Rochester on Oct. 30. Lowe, who's still recovering from his injuries, has had more than 20 surgeries since the crash.\n\nShepherd was found guilty Friday of three felony counts of reckless homicide. The jury also found her guilty of a felony count of criminal recklessness and a misdemeanor count of passing a school bus causing injury when the arm is extended. She faces up to 21 years if given the maximum amount on each count.\n\nRelated Video: Bus Driver Grabs Student Stepping Toward Car\n\nThe parents of Mason and Xzavier, Shane and Brittany Ingle, and Michael Stahl, Brittany's ex-husband and Alivia's dad, told reporters after the verdict that they were relieved, and have no sympathy for Shepherd, who they believe has shown no remorse for the crash.\n\n\"I don't think we'll ever feel closure,\" Brittany Ingle said. \"But this will go toward healing.\"\n\nOct. 30, 2018: Twin boys, sister killed by pickup truck at Indiana school bus stop\n\nGifts at a memorial on the site of the crash on Thursday, Nov. 1, 2018. More\n\nShepherd and her attorneys quickly left the courtroom after the verdict was read early Friday evening and made no statement.\n\nEarlier Friday, Shepherd took the stand in Fulton Superior Court. Family members of Shepherd and the victims, had filled the Fulton County courthouse this week to hear testimony from witnesses and law enforcement.\n\nWhen asked by her attorney when it started to sink in that she’d hit and killed three children after driving past a school bus, Shepherd described emotions ranging from disbelief to hysteria.\n\nBut at first it was confusion, according to her testimony. She remembered seeing blinking lights and something that appeared to be a large vehicle. But she didn't see a bus, Shepherd says, nor did she see the red sign telling her to stop.\n\nWhen she'd realized what she'd done, Shepherd says she was hysterical.\n\n\"The only way I can describe it is an out-of-body experience,\" Shepherd said, according to the account provided to IndyStar by the small number of reporters who were allowed into the packed courtroom, \"I was a mess.\"\n\nThe four children were crossing the highway to board their school bus about 7:15 a.m. when prosecutors say Shepherd blew by a stopped school bus. The road was dark but prosecutors said the bus lights and stop arm were clearly visible.\n\nWhether Shepherd was behind the wheel that morning was not being disputed, according to statements made from the defense and prosecution during the trial. Jurors instead decided whether Shepherd’s actions were reckless or simply accidental.\n\n\"The thing that makes me sick here,\" Fulton County Prosecutor Michael Marrs said, \"is that this never should have happened.\"\n\nThe scene is investigated on State Rd. 25 in Rochester, IN, where a pickup truck hit and killed three young children and critically injured a fourth as the children crossed the street to get on a school bus, Tuesday, Oct. 30, 2018. The bus was stopped with lights and stop indicators in use. More", "description": "Alyssa Shepherd was found guilty of three felony counts of reckless homicide for the Oct. 2018 crash that killed three siblings.", "authors": ["Crystal Hill", "Indianapolis Star"], "top_image": "https://s.yimg.com/uu/api/res/1.2/8G_nxEF7XqtIwp4m3vgNlQ--~B/dz0wO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-us/usa_today_news_641/cf0e90df3a7fc2a2dd2f7f1f726dc7ca", "published_at": "2019-10-19"}