{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/bitcoin-network-transfers-1-billion-for-price-of-a-cup-of-coffee", "downloaded_at": "2019-10-15 08:01:26.538826+00:00", "title": "Bitcoin Network Transfers $1 Billion ‘For Price of a Cup of Coffee’", "language": "en", "text": "The CEO of cryptocurrency exchange Bitstamp has highlighted Bitcoin’s (BTC) utility after funds worth almost $1 billion changed hands for less than $4 in fees.\n\nBitcoin fees too small to comprehend\n\nAs blockchain monitoring resource BitInfoCharts confirmed on Oct. 14, the transaction at wallet and storage provider Xapo involved a total of 112,027.29 BTC.\n\nPreviously, Bitstamp had transferred around 107,800 BTC of its funds to Xapo, paying a fee of 0.0234 BTC — or 0.0000217%.\n\nThe subsequent transaction, handled by Xapo itself, saw an even more microscopic amount paid to miners to approve the funds’ transfer. At $3.89, the fee rate was equivalent to 4.1724762780401154e-7% — too small to write sensibly using standard decimals.\n\nAs Bitstamp CEO Nejc Kodrics summarized, the funds “transferred in a single transaction for the price of a cup of coffee.”\n\n73 million Bitcoin Days Destroyed\n\nWhen the first transaction took place, other commentators noted how easy it was to use Bitcoin for huge wealth transfers without the need for government approval or trusting middlemen.\n\nNonetheless, Bitstamp sending coins to Xapo raised eyebrows for another reason. According to data uploaded to Twitter, the transaction saw 73 million Bitcoin days destroyed (BDD).\n\nThe metric implies the funds involved had not moved for a considerable length of time before exiting the Bitstamp wallet.\n\nAs Cointelegraph reported in August, BDD can be used to gauge investor sentiment. At the time, it was suggested that the Bitcoin price itself could be due for another bullish phase.", "description": "Bitstamp sparked two transactions involving almost $2 billion, which attracted total fees of under $200", "authors": ["William Suberg"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvMjQxZWQ4ZmQwZGUwZTI2ODU3ZTRiMDhmYzVjMGMyNzcuanBn.jpg", "published_at": "2019-10-15"}