{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/07/democrats-in-red-states-having-a-rough-time-defending-impeachment-back-home", "downloaded_at": "2019-10-08 05:13:17.897750+00:00", "title": "Democrats in Red States Struggling to Defend Impeachment Back Home", "language": "en", "text": "House Democrats in red states who have come out in support of impeachment are having a rough time defending their decision back home.\n\nDemocrats who are back home for two weeks in districts that supported President Trump in 2016 are having to answer questions on impeachment – whether they like it or not.\n\nAt one town hall, Illinois, Rep. Sean Casten (D-IL) was confronted by a woman who “tore into” House Speaker Nancy Pelosi (D-CA) and House Intelligence Committee Chairman Adam Schiff (D-CA), accusing them of “lying their little butts off,” according to a report by Politico.\n\nShe said the whistleblower complaint “looks like a bunch of 13-year-old girls gossiping.”\n\nAt another event, another constituent asked Casten why he was not condemning former Vice President Joe Biden’s actions. Trump has said Biden and his son Hunter Biden should be investigated for their actions in Ukraine. Biden pressured Ukraine to fire the chief prosecutor, who had opened a corruption investigation on a Ukrainian gas company that employed his son for over $50,000 a month. The Bidens have denied any wrongdoing.\n\nCasten has told his constituents that there’s “no there thereon the Biden story,” and that a voter who asked him about Ukrainian meddling in the 2016 election was espousing a “deep-down-the-rabbit-hole, crazy conspiracy theory,” according to Politico.\n\nFox River Grove resident Steven Wood said he remains convinced that Trump did nothing wrong. He and his wife had a heated exchange with Casten, after the lawmaker called Trump’s immigration policies “racist” and his claims about Biden “crackpot conspiracy theories.”\n\nRep. Elissa Slotkin (D-MI), another Democrat in a Republican-leaning district, has also been confronted at town halls back home.\n\nAccording to a report from the Detroit News, Slotkin’s recent support of an impeachment inquiry has raised “a cacophony of applause, boos and mingled shouts of ‘Let her speak’ and ‘Fake news,'” at crowded gatherings.\n\nA former Republican precinct delegate, Gwen Bliss, said she is disgruntled by Slotkin’s impeachment support.\n\n“I hope she understands that when she puts herself forward as our representative that she represents us and, if we are this divided about this issue, I wouldn’t go forward with any of this,” she said.\n\nAnother resident, Bill Long, urged Slotkin to instead wait for more facts to emerge. He told her:\n\nThis is a serious matter that I think you guys are treating too lightly. Plus, frankly, if you guys go ahead and impeach him, we may never have this meeting again because you might be out of here and be replaced by a Republican. That would be sad because you seem like a bright young lady.\n\nAlready two Republicans have declared challenges to Slotkin since she came out in support of impeachment last month, State Board of Education member Nikki Snyder of Dexter and auto dealership general sales manager Mike Detmer.\n\nSome Democrats are trying to avoid talking about the issue back home altogether.\n\nRep. Ben McAdams (D-UT) — who supports an impeachment inquiry — declined on Thursday to comment on impeachment, then released an ambiguous written statement, but was then forced to clarify his position as he visited a senior center, according to a report by the Salt Lake Tribune.\n\nHe reportedly made two attempts at stating his position, before exiting “amid shouts from constituents” at an event on Friday. He had initially not intended to take questions from the media, saying he preferred to focus on health and wellness.\n\n“We have other work to do,” he reportedly said, “and we can not allow this issue to paralyze a Washington that is already low on results.”\n\nRep. Jared Golden (D-ME) has refused to say whether he thinks the president should be impeached.\n\n“I don’t agree with anyone that is rushing to conclusions or making assumptions,” he said at an event, according to the Press Herald. “This needs to be a fact-finding mission for the good of our country.”\n\nRep. Susan Wild (D-PA) has been also trying to avoid the topic of impeachment.\n\nAt a Teamsters Local 773 meeting in Lehigh Valley, she tried to push back against the idea that Democrats are “living, breathing and foaming at the mouth for impeachment.”\n\n“I get really testy on this when people say that, because I spend 90% of my committee time in education and labor,” she said, according to NPR.\n\nShe said “not a single person” has asked her about impeachment at any of her events back home.\n\nDavid Potter, a Trump supporter, said he may vote for Wild, but said if she is for impeachment, he will vote for the Republican.\n\n“Because if you’re going to basically fight against the president when his goal is to make America great, then you should come up with a plan to make America great and not try to, you know, get in a fight with the president,” he said.\n\nDemocrats hope to carry Georgia for the first time since Bill Clinton’s election in 1992, but they may have a tough time with Republicans like Bill Schilleci, a resident in Forsyth County in Georgia’s 7th district.\n\nHe told the Atlanta Journal-Constitution, “This impeachment thing started before Donald Trump put his hand on the Bible.”\n\nRep. Lucy McBath (D-GA) decided to support an impeachment inquiry last month, drawing protests outside of her office.\n\n“Democrats like Lucy McBath have been looking for any excuse they could find — no matter how baseless or ridiculous — to impeach the president,” said Stewart Bragg, the executive director of the state Republican Party.\n\n“It is outrageous and disgusting. So let’s do something about it.”\n\nFollow Breitbart News’ @Kristina_Wong.", "description": "House Democrats in red states who have come out in support of impeachment are having a rough time defending their decision back home.", "authors": ["Kristina Wong"], "top_image": "https://media.breitbart.com/media/2019/10/House-Democrats--640x335.jpeg", "published_at": "2019-10-07"}