{"pub": "yahoo", "url": "https://yahoo.com/entertainment/cardi-b-fights-back-tears-163025642.html", "downloaded_at": "2019-10-12 17:51:19.360021+00:00", "title": "Cardi B Fights Back Tears Over Titanic-Sized Birthday Ice From Offset", "language": "en", "text": "Cardi B got emotional over her birthday gift from Offset, which happened to be enough bling to sink the Titanic.\n\nThe famous rappers celebrated Cardi's 27th birthday on Friday, and when Offset presented his wife her gift, she almost lost it.\n\nRelated:\n\nOffset Says Alleged Assault Victim Begged To Be Beaten Up, Demands Case Against Cardi B Be Thrown Out\n\nMigos’ Offset Reveals Secret Love Child Days Before Cardi B Engagement\n\nView photos\n\nDelivering the duel bling on a rose-pedaled plate, the \"I Like It\" rapper couldn't believe her eyes.\n\nOffset gave her a gigantic heart-shaped diamond surrounded by several smaller heart diamonds.\n\nNo ring would be complete without a separate matching band, which Cardi also got.\n\nView photos\n\nShe could hardly contain her emotions when presented the pricey presents, and couldn't even talk.\n\nShe finally snapped out of it after Offset placed the rings on her.\n\n\"I deserve this,\" she is seen saying to the camera.\n\n\"I love you husband,\" Cardi declared in front of everyone.\n\nView photos\n\nNeedless to say, Cardi was happy with her gift. The Migos rapper even got a fat kiss from his happy wife.\n\nOffset shared his own footage from the birthday dinner, captioning it, \"HAPPY BIRTHDAY TO MY QUEEN U DESERVE EVERYTHING THAT COME YOUR WAY I LOVE YOU AND OUR FAMILY TOGETHER .\"\n\nThe duo are used to public display of affection.\n\nOffset shared a raunchy tribute video to Cardi on her birthday.\n\nIn the NSFW video, if their tongues weren't touching (12x in the video we should add), one of them was groping the other\n\nCalling Cardi the \"love of my life,\" he wrote, \"THIS DAY IS YOUR SPECIAL DAY I LOVE YOU, HAPPY BDAY!!NOT JUST ME AND FAMILY BUT THE WORLD LOVES YOU.\"\n\nCardi wrote back, stating, \"I love you babe thank you for everything.\"", "description": "Check out this ice.", "authors": ["Whitney Vasquez"], "top_image": "https://s.yimg.com/uu/api/res/1.2/vEFptEbMfQvbY8cHfOlJ8w--~B/aD0xMTAzO3c9MTk2NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/theblast_73/332f0546236af2b962fd37a78a41a276", "published_at": "2019-10-12"}