{"pub": "washingtonpost", "url": "https://washingtonpost.com/health/as-sicilys-mount-etna-began-to-erupt-her-ballet-training-turned-out-to-be-good-prep/2019/09/27/f1edfb40-be9e-11e9-a5c6-1e74f7ec4a93_story.html", "downloaded_at": "2019-09-29 23:30:43.474318+00:00", "title": "As Sicily’s Mount Etna began to erupt, her ballet training turned out to be good prep", "language": "en", "text": "Giannella M. Garrett on Mount Etna, Europe's highest and most active volcano. Garrett credits her ballet skills with helping her climb the volcano. (Tobias Schorr)\n\nI dug the toe of my hiking boot into the crumbly, scorched sands as I marched up the curvy rim of the crater’s slope. Plodding one baby step at a time, I ignored the 10-story drop-off on my left. A stumble or stray thought might easily send me hurtling down a long, pebbly abyss, or initiate an avalanche of volcanic debris.\n\nIt was the final day of a week-long expedition on Sicily’s Mount Etna, Europe’s highest and most volatile volcano. Eruptions occur here nearly every year. Shifting clouds and frequent downpours had prevented my group from approaching the 10,912 foot summit for five days. So we traversed Etna’s steep flanks on daily-six hour hikes instead, through magnificent birch forests, icy snow patches and in some places knee-deep in ash from previous eruptions.\n\nWhen we awakened one morning to news of an overnight eruption and a forecast of finally clear skies, our local guide told us we better get there quickly in case lava flows and explosive activity shut down the mountain.\n\nA gondola ride up the 8,200-foot ascent tossed us around like an errant swing set. It was followed by a grueling three-hour trek over a volcanic smorgasbord of chunky lava — ropy pahoehoe formations, cinder cones and a goulash of grit. All the while, nature’s soundtrack of subterranean rumbles dispatched a frisson of menace.\n\nHard hats clipped on, gas masks at the ready, we prepared for the possibility of ash emissions and basalt block explosions, which can claim lives in an instant. (Nine tourists were killed by a surprise explosion in 1979; two in 1987.) Finally, we arrived at a lookout, just beneath Etna’s 10,000-foot-high Southeast crater, with a direct view of the fiery flank eruption of ruby magma.\n\nI had signed up months in advance for this “Etna Discovery” hiking and study tour, organized by German-based Volcano Adventures, but with no time to prepare for this grueling expedition described as requiring moderate to excellent physical condition.\n\n\n\nGiannella M. Garrett enjoys her favorite pastime: ballet. (Melanie Futorian)\n\nInstead, I’d depend on my singular routine exercise for the past 40 years — a daily one-and-a-half hour classical ballet class. It was a commitment I kept to doggedly, but I often wondered, what was I gaining that I could apply outdoors? And in this case, would I be able to keep up with experienced hikers?\n\nTo my surprise, I returned to our rustic, timber wood mountain lodge each night exhausted but elated that I had not only endured, but had also completed a few extra activities that some of the others sat out because of issues with acrophobia, exhaustion and sore knees. I credit my ballet training for accomplishing the demands of this expedition. And once back home, I also concluded that hiking had improved my ballet.\n\n'Strong feet, ankles, toes'\n\nI started studying classical dance in my late 20s when I moved to New York. It provided a safe, indoor exercise activity. I soon discovered it offered a lot more: expressive movement, a meditative routine and appreciation for an art form hundreds of years old.\n\nAt 66, I appreciate how ballet has helped me counteract gravity’s inevitable sag, encouraged good posture and expanded the array of activities I feel confident engaging in — such as hiking.\n\nWas this synergy I felt between ballet and hiking on point? I got in touch with Richard Anton Marsden, a former New York City Ballet dancer, and nature aficionado and ballet coach.\n\n“Balance, alignment, strong feet, ankles and toes are the foundation of ballet and they are necessary for hiking,” he said. “The fondu, which is a plié on one leg, strengthens the feet and helps land jumps. Going on relevé, or half toe, promotes muscle memory and coordination so if you’re about to fall you can catch yourself faster.”\n\nAwareness of the position and movement of the body in space and reacting quickly to that with necessary adjustments is called proprioception. Elizabeth Barchi, a staff physician at Harkness Center for Dance Injuries at NYU Langone Orthopedic Hospital, said ballet develops proprioception because “it requires both an intense awareness of your body and mental discipline.”\n\nA foot injury led Brooklyn-born Carlos Kerr, a soloist with the Tanz Luzerner Theater dance ensemble in Lucerne, Switzerland, to hiking. “My left foot had tendinitis in the top part of my metatarsal that was affecting mobility of the big toe,” he said. “I went to see a specialist in Zurich. She prescribed hiking to help strengthen the smaller muscles in my feet.”\n\nLauren Borowski, a staff physician at the Harkness Center specializing in bone health and stress injuries, said she sees the synergy between dance and climbing Etna.\n\n“Hiking on uneven terrain forces you to utilize the muscles and tendons around the ankle,” she said. In ballet, “dancers learn hip, knee and ankle alignment, which is really helpful when you’re doing a lot of repetitive movement like hiking. Being able to keep your knees tracking over your toes is important, so you don’t develop patellofemoral knee pain, or ‘runner’s knee,’ which is common to hiking.”\n\nKerr followed the Zurich specialist’s advice and took a two-hour hike up Mount Pilatus, a 6,982-foot massif that towers over Lucerne, then hopped on a tram to reach its peak.\n\n“Above the clouds, I realized hiking can really be uplifting,” he said. “As a dancer, you always feel that endurance is in your favor because our ballet repertoire can go from adagio [slow movement] to grand allegro [big fast moves] and become very aerobic quickly.”\n\nHe recalled a performance that required intense mental attention and physical presence for 90 minutes straight. “When I’m hiking and surrounded by nature, I go into a similar feeling as if I’m in class,” he said. “Aware of the ground. How my foot articulates. How I navigate the rocks.” And, yes, his toe healed.\n\n“Ballet takes a lot of mental and emotional discipline to keep yourself going day in and day out,” Barchi said. “I coach students about learning to break things down so it doesn’t feel so overwhelming. Just focus on what’s in front of you. That’s tough, but it’s a useful skill in every part of your life, even hiking.”\n\nCross-training\n\nThere was a time when ballet dancers were discouraged from participating in other athletic endeavors.\n\nBarchi performed as a principal dancer with Brandywine Ballet in West Chester, Pa., for six years through college and medical school. She said she remembers being told that running might cause her to develop big thighs, considered unesthetic for ballerinas. “Now the leadership in the big ballet companies understands that it’s in the cross-training that they can really push the technique and get that strengthening,” she said. Willowy and ephemeral are no longer prerequisites for ballet bodies.\n\nFor Leah Merchant, a soloist with Pacific Northwest Ballet in Seattle, said “hiking is a little selfish in that I get to go consume beauty instead of create it when I dance.”\n\n“Dancers are the border collies of the art world,” she said. “We’re trained to need the physical exhaustion. We’ve worked years and years, and we’re conditioned to want that. We have to be able to push our boundaries and we have to push past our comfort zones, like fear of heights or those moments where you feel you can’t make it any longer.”\n\nBorowski, who completed an undergraduate degree in dance while preparing for medical school, said she agreed. “There are so many boundaries dancers push,” she said.\n\n“Whether it’s performance anxiety onstage or in a class, or trying a new lift with a partner, those are cliffs you might fall from,” Borowski said. “But you just have to try, and trust your partner, yourself, and the work you’ve put into it to hold you.”\n\nAt times, climbing Etna felt like dancing with danger.\n\nThere are weeks when gazing into the ballet mirror reflects back a chaos of distorted lines and missteps. That’s when I remind myself to look beyond my feeble attempts at perfection.\n\nThe more I keep dancing and hiking, the more I discover the joy and power of filling space with movement, living in the present, evading injury and embracing the unexpected.\n\nRead more\n\nHow to reset your body clock and get better sleep, with hiking boots and a tent\n\nAt 78, this ballerina is still going strong\n\nExercising even a little can improve your health\n\nHow to build up your workout — and your health — in small steps", "description": "Balance and strength from dance training prepared her for the physical demands of a grueling and dangerous expedition.", "authors": ["Giannella M. Garrett", "September At Am", "Giannella M. Garrett Lives In New York. Her Articles", "Photographs On Travel", "Dance Have Appeared In Major Publications."], "top_image": "https://www.washingtonpost.com/resizer/dEoAvcDsuu9phPpHVXGGSF_gWPw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3SMPKXW3FEI6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-27"}