{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/29/the-latest-all-blacks-make-11-changes-to-face-cana", "downloaded_at": "2019-09-30 04:05:24.422022+00:00", "title": "The Latest: All Blacks make 11 changes to face Canada", "language": "en", "text": "TOKYO (AP) - The Latest on Day 11 of the Rugby World Cup (all times local):\n\n11:50 a.m.\n\nNew Zealand has made 11 changes from the starting XV that beat South Africa for its second Pool B match against Canada on Wednesday in Oita.\n\nOnly lock Scott Barrett and captain and No. 8 Kieran Read in the forwards, and flyhalf Richie Mo’unga and fullback Beauden Barrett in the backs kept their starting spots after defeating the Springboks 23-13 in Yokohama nine days ago.\n\nThe two Barretts are starting with their third brother, Jordie, who is on the right wing. They will be the second trio of brothers to start in a Rugby World Cup match behind the Vunipola brothers in 1995 for Tonga. Elisi and Manu Vunipola started against France, and Fe’ao came off the bench to become the first trio to play in the same game. Four days later, against Scotland they all started.\n\nNew Zealand: Beauden Barrett, Jordie Barrett, Jack Goodhue, Sonny Bill Williams, Rieko Ioane, Richie Mo’unga, TJ Perenara; Kieran Read (captain), Matt Todd, Shannon Frizell, Scott Barrett, Patrick Tuipulotu, Angus Ta’avao, Liam Coltman, Atu Moli. Reserves: Codie Taylor, Ofa Tuungafasi, Nepo Laulala, Sam Whitelock, Ardie Savea, Brad Weber, Ryan Crotty, Ben Smith.\n\n___\n\n11:45 a.m.\n\nScotland and Samoa meet in Pool A on Monday as the Rugby World Cup group-stage approaches the halfway mark.\n\nThe Scots are coming off a 27-3 loss to Ireland, which then lost in a World Cup shocker to host Japan. The Samoans opened with a win over Russia but have been forced to reshuffle the lineup because of injuries and the suspension of two players for high tackles.\n\nThe second weekend off the tournament culminated with Six Nations champion Wales holding off a resurgent Australian lineup on Sunday night to take control of Pool D.\n\nThere’s a rest day on Tuesday, before the defending champion All Blacks are back in action on Wednesday against Canada.\n\n___\n\nMore AP Rugby World Cup: https://www.apnews.com/RugbyWorldCup and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Latest on Day 11 of the Rugby World Cup (all times local):", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/26/the_week_that_was_in_asia_photo_gallery_10818_c0-143-2762-1753_s1770x1032.jpg?c0a3374ff63ca19ca70569a23d7b9232b0c2f844", "published_at": "2019-09-29"}