{"pub": "realclearpolitics", "url": "https://quillette.com/2019/09/16/understanding-americas-cultural-and-political-realignment", "downloaded_at": "2019-09-17 13:10:36.761896+00:00", "title": "Understanding America’s Cultural and Political Realignment", "language": "en", "text": "Understanding American politics has become increasingly confusing as the old party labels have lost much of their meaning. A simplistic Left vs. Right worldview no longer captures the complexity of what’s going on. As the authors of the October 2017 “Pew Survey of American Political Typologies” write, “[I]n a political landscape increasingly fractured by partisanship, the divisions within the Republican and Democratic coalitions may be as important a factor in American politics as the divisions between them.”\n\nTo understand our politics, we need to understand the cultural values that drive it. The integral cultural map developed by philosopher Ken Wilber identifies nine global cultural value systems including the archaic (survival), tribal (shaman), warrior (warlords and gangs), traditional (fundamentalist faith in God), modern (democracy and capitalism), and postmodern (world-centric pluralism). When combined with Pew’s voter typologies, Wilber’s cultural levels offer a new map of America’s political landscape.\n\nOf Wilber’s nine global value systems, the Traditional, Modern, and Postmodern categories are most useful to understanding our moment. Traditional culture values disciplined adherence to assigned gender and social roles: men are providers and heads of households, marriage is between one man and one woman, and the institutions of the military, law enforcement, and the clergy are all highly respected. Historically, traditional cultures were monarchies or states ruled by “strongmen.” Modern culture superseded traditional systems in the West during the Enlightenment, and values rationality, democracy, meritocracy, capitalism, and science. Individual rights, free speech, and free markets harness an entrepreneurial spirit to solve problems.\n\nPostmodern culture offers a borderless, geocentric political view that values pluralism. It challenges a pro-American narrative by focusing on the horrors of American history, including the exploitation of Native Americans, slavery, and persistent inequality disproportionately affecting historically disadvantaged groups. Those left behind by modernity and progress now seek recognition, restoration, and retribution via a politics of protest, and show little interest in building political organizations or institutions. We are currently living in a postmodern political moment of disruption, best described by author Helen Pluckrose in her Areo essay “How French Intellectuals Ruined the West: Postmodernism and its Impact, Explained”:\n\nIf we see modernity as the tearing down of structures of power including feudalism, the Church, patriarchy, and Empire, postmodernists are attempting to continue it, but their targets are now science, reason, humanism and liberalism. Consequently, the roots of postmodernism are inherently political and revolutionary, albeit in a destructive or, as they would term it, deconstructive way.\n\nWhen we overlay Pew’s data with Wilber’s Value levels, six cultural political categories emerge: Traditional Left and Right, Modern Left and Right, and Postmodern Left and Right.\n\nTraditional Left: Devout and Diverse\n\nIf you live in an urban bubble, you may not even recognize the Traditional Left. Pew identifies these Democrats as “Devout and Diverse,” mainly comprised of minorities. Pew describes them as “…fac[ing] the most difficult financial challenges among all Democratic categories.” They are “the most religiously observant Democratic-leaning group, and the only one in which a majority (64 percent) says it is necessary to believe in God to be moral and have good values… they have a strong support for the social safety net and further action on racial equality.” These Democrats don’t support gay rights or increasing immigration and, as Pew notes, “40 percent describe their own ideology as conservative.” They are the oldest of the Democratic voter groups and make up around six percent of all engaged voters.\n\nTraditional Right: Country First\n\nWhile the Devout and Diverse voters have almost no public profile in the media, the Traditional Right is perceived to be much larger than it is. Pew refers to them as “Country First” Republicans, who “fear America risks losing our identity as a nation.” They have largely negative views of scientists and artists, and are the most elderly of all typology groups. Primarily comprised of white men, they hold a generally favorable view of Trump and uniformly oppose same-sex marriage. They make up about six percent of all engaged voters.\n\nWhile both Republicans and Democrats have socially conservative, anti-gay, anti-immigrant voters in roughly the same numbers, the social conservatives on the Right play a more prominent role in American politics, partly because they play a larger role in the GOP, and partly because the media like to highlight them to fit their own narrative. Based on their aging demographic, the traditional value level is unlikely to be as significant a force in future elections.\n\nModern Left: Opportunity Democrats\n\nThe Modern Left is best represented by Pew’s “Opportunity Democrats,” who are optimistic and pro-business. They believe “most people can get ahead if they are willing to work hard” to achieve the American Dream. Almost half of them say “most corporations make a fair and reasonable amount of profit.” They are primarily white, financially well off, and describe themselves as moderate. They are socially inclusive, liberal on immigration, and supportive of gay rights. They are also less likely to believe that blacks and women face structural barriers to advancement. Until recently, this group defined what it meant to be a Democrat, but they have lost their center of power. Today, they make up around 13 percent of all engaged voters.\n\nModern Right: Core Conservatives and New Era Enterprisers\n\nTwo different groups in Pew’s study represent Modern values among Republican voters. The larger and older of the two are called “Core Conservatives,” while the younger, smaller group Pew calls “New Era Enterprisers.” Both groups share modern values evidenced by their belief in the power of capitalism and democracy. Both believe in the power of the free market and the importance of America’s global leadership. Both remain optimistic about the possibilities afforded by the American Dream. They make up the 66 percent of Republicans who support the “Dreamers.” Their pro-immigration position is also confirmed in a Gallup report, which states that “… significantly more Republicans favor a path to citizenship than support building a border wall or deporting illegal immigrants.”\n\nCore Conservatives are the largest Republican voter group. Made up of mostly white men, they enjoy the highest rates of home ownership of any voter group, and a majority believe that they’ve achieved the American Dream. They are the best educated of any Republican group, yet have the most negative attitudes toward the impact colleges have on our country. They are most likely to invest in the stock market and their most important issue is the economy. “Sixty-eight percent express a positive view of US involvement in the global economy ‘because it provides the US with new markets and opportunities for growth.’” In addition to their largely pro-free market and pro-immigration views, they have the most favorable view of Donald Trump among all voting groups. They represent 20 percent of all engaged voters.\n\nNew Era Enterprisers, meanwhile, are young, urban, and much more ethnically diverse. Pew points out that they are “strongly pro-business and generally think that immigrants strengthen, rather than burden, the country.” Innovation and entrepreneurship are most important to them. They are pro-immigration and pro-gay rights with the highest opinion of a role for government among any Republican group. Only a quarter of them self-identify as strong Republicans. They are the least supportive of Donald Trump among Republican groups, and the least likely to express negative attitudes toward the Democratic Party. They make up nine percent of all engaged voters.\n\nTogether these two modern Republican groups total 29 percent of engaged voters, and represent the center of power within the GOP.\n\nPostmodern Left: Solid Liberals and Disaffected Democrats\n\nThe two Pew voting groups which make up the Postmodern Left are “Solid Liberals” and “Disaffected Democrats.” Both groups have negative views of capitalism and are concerned about America’s treatment of minority groups.\n\nSolid Liberals is a bit of a misnomer as they tend to reject liberalism in its classical form. They are progressives who hold strongly negative views of businesses, question or reject the concept of the American Dream, and see the world through the lens of identity politics. They are mostly white, well-off, and well-educated, and they are the most secular voters found across voting groups. Ninety-seven percent strongly disapprove of Trump’s job performance. They are unlikely to have friends outside their political circle, and over half of this group would say “that a friendship would be strained if someone voted for Trump,” much higher than any other Democratic group. It isn’t just Trump they dislike. They are highly partisan in general and the least tolerant of Republicans among all Democrat groups. They are the largest engaged Democratic voting group and the largest of all voting groups in Pews voter typologies. They make up 25 percent of engaged voters.\n\nPew characterizes Disaffected Democrats as a “financially stressed, majority-minority group [that] supports activist government and the social safety net…” They are unhappy with America and their “disaffection stems from their cynicism about politics, government and the way things are going in the country. Disaffected Democrats would be the most likely to see the world through the lens of identity politics.”\n\nA large majority of Disaffected Democrats say their side has been losing in politics, while fewer than half believe that voting gives them a say in how the government runs things, highlighting another hallmark of their beliefs: they have very little faith in the system.” They believe government has failed them and that, “poor people have hard lives because government benefits do not go far enough to help them live decently.” Unlike the white elite Postmodern Democrats, they often have lived in the same neighborhood their entire lives. They make up 11 percent of all engaged voters.\n\nTogether these two diverse progressive groups make up 36 percent of all engaged Democratic voters, which makes them the largest of any groups on the Left or Right. When pundits refer to the Democratic Party moving “leftwards” there are trying to capture this movement toward the postmodern level—the new center of gravity of cultural power on the American Left.\n\nPostmodern Right: Market Skeptic Republicans\n\nThe group that is least understood in American politics is the Postmodern Right. While postmodernism on the Left focuses on the failure of modernity to address social justice in term of identity politics, the Postmodern Right questions the fundamental economic worldview of the Modern Right. In Pew’s survey, they show up as a new category named “Market Skeptic Republicans.”\n\nLike those on the Postmodern Left, they share a strong skepticism of America exceptionalism, an overriding pessimism about the country, and they are critical of both political parties. They are the first ever “Republican-leaning group that is deeply skeptical of business and the fundamental fairness of the nation’s economic system.” They do not believe in lower taxes, which until recently defined the modern GOP, and they have an unfavorable view of banks and other financial institutions. Unlike other Republicans, Market Skeptic Republicans believe American capitalism is unfair, “an overwhelming share (94 percent) say the economic system unfairly favors powerful interests.”\n\nThe media often lumps them in as traditional conservatives because of their opposition to immigration. But that’s a mistake. They favor legal abortions in higher numbers than the Traditional Left Democrats, and they are the most secular of all Republican groups. They are also most interested in a white identity politics, mirroring those on the Left.\n\nThey are also the least loyal to the GOP. As Pew notes, “They stand out for their criticism of both political parties when it comes to caring about the middle class.” They hold a more favorable view of Donald Trump than most other Republican groups. Though not well known and ignored by the media, they are a larger voting group than the religious Right in the Republican Party, making up 10 percent of all engaged GOP voters.\n\nUsing Pew’s voter groups on an integral value map illuminates how polarization is causing divisions within, and well as between, America’s Left and Right. It also shows that the center of American politics has moved from a modern base which held the center of gravity for over a century to a new postmodern base. Today, the Democratic Party energy’s is centered at that postmodern level, while the center of the GOP remains modern.\n\nPews Voter Typologies By Cultural Worldview\n\n\n\n% engaged voters % engaged voters Postmodern Left 36% Postmodern Right 10% Modern Left 13% Modern Right 29% Traditional Left 6% Traditional Right 6%\n\nWhat this Map Tells Us about the 2016 Election\n\nIn 2016, instead of hiring DC-based consultants, Donald Trump listened to conservative talk radio to plot his strategy. Just as a bat uses sonar, Trump bounces ideas off audiences and recalculates his path accordingly. He intuitively understood that the element unifying the different aspects of the Traditional and Modern Rights was their united opposition to the growing dominance of the urban elite, and the identity politics favored by the Postmodern Left. He exploited those tensions by aggravating them and antagonizing the mainstream media as a means of uniting the Right.\n\nIn addition, his post-truth worldview and ability to criticize establishment Republicans provided him with access to a new, postmodern Republican voting group—Market Skeptics. Writer David Ernst has argued in the Federalist that Trump is the first President to “turn postmodernism against itself,” because he grasped the postmodern idea of the anti-hero.\n\nIf politics flows downwards from culture, then it was only a matter of time before a politician mastered the role. Love him or hate him, Donald Trump cracked that code. Tony Soprano, Walter White, and Frank Underwood are just a few recent examples of the enormously popular characters who have, each in their own way, stood in for the role of the complicated bad guy who fascinates millions of Americans.\n\nClinton’s Loss\n\nNo one told Hillary Clinton that the political landscape in which she and her husband had learned politics had changed. In the 1990s, Bill Clinton successfully navigated the values divide between moderns and traditionalists by polling and then speaking successfully to both traditional and modern voters on the Left and center-Right. That’s not the political world Hillary inherited.\n\nNeither she nor Bill are at home with the postmodern voters that are now the largest voting group in the Democrat coalition. Bill Clinton repeatedly proved to be a liability in the 2008 and 2016 races because he failed to understand the demands of the newly “woke” Democrat coalition. Hillary was a modern candidate in a postmodern party without the cultural translation skills she needed to communicate with progressives. Many of those progressives voted in unusually high numbers for Green party candidate Jill Stein or simply stayed home.\n\nWhat to Expect in 2020\n\nTrump will again seek to unite his coalition by goading the Postmodern Left. Though incumbents are usually judged by how they performed in office, Trump will try to make these opponents the focus of his 2020 campaign, just as he did in 2016. The more he’s scolded by the media, the better his chances will be of reuniting his coalition. However, this strategy risks losing New Era Entrepreneurs, and losing any voting group on the Right makes Trump’s re-election difficult.\n\nDemocratic primary voters, meanwhile, are becoming more postmodern. The pressure to move from the modern liberal to progressive postmodern worldview in the crowded primary field risks alienating modern Democrats. Worse, whoever wins the progressive primary will need to work hard to attract any modern voters in the center and on the Right. Though two aging straight white men lead the polls in the primary as of this writing, the reality of a postmodern base in the Democratic coalition doesn’t bode well for straight white male candidates, and offers new opportunities to candidates who are female, black, Latino, or gay.\n\nThe challenge for Republicans is that the Traditional Right voting block is aging out. The divisions around business and the role of government between Market Skeptic Republicans and Core Conservatives are as profound as—if not greater than—the divisions on the Left. Worse, their larger voting coalitions are demographically much older. Trump risks pushing the remaining younger entrepreneurial, ethnically diverse voters into the Democrat coalition.\n\nThere is, however, one bright spot in this chaos. According to Wilbur’s theory, a new “integral” value system is emerging that “transcends and includes” the best aspects of earlier value systems. Jordan Peterson’s popularity may be an early sign of this—while embracing aspects of tradition, science, and therapeutic culture, his message and best-selling book appear to be resonating.\n\nIf this marks an early shift towards integral values, such a move could put an end to our vicious culture wars as new leaders emerge with the ability to see multiple viewpoints and accommodate their contradictions. Understanding American politics will continue to be hard work. But only when we understand culture will we understand politics so that we can transform it for the better.\n\nCorrection: An earlier version of this article misspelled Ken Wilber’s name as Ken Wilbur. Quillette apologises for the error.\n\nRich Tafel is the director of the American Project at the Pepperdine School of Public Policy. You can follow him on Twitter @richtafel\n\nFeatured pic courtesy of whitehouse.gov\n\nShare this: Pocket\n\nWhatsApp\n\n\n\nEmail\n\nPrint\n\n", "description": "", "authors": [], "top_image": "https://i1.wp.com/d24fkeqntp1r7r.cloudfront.net/wp-content/uploads/2019/09/10234328/north-dakota-1-2.jpg?fit=1200%2C800&ssl=1", "published_at": "2019-09-16"}