{"pub": "politico", "url": "https://politico.eu/article/uk-offers-brexit-mini-deals-side-step-brussels", "downloaded_at": "2019-09-11 07:26:33.565856+00:00", "title": "UK offers Brexit mini-deals to side-step Brussels", "language": "en", "text": "Many EU27 capitals have been approached by London with offers of arrangements that would ameliorate the impact of a no-deal Brexit on both sides | Tolga Akmen/AFP via Getty Images UK offers Brexit mini-deals to side-step Brussels EU officials see the move by London as an attempt at divide and rule.\n\nThe U.K. government is trying to bypass Brexit negotiations with the European Commission by proposing so-called mini deals to national capitals directly, diplomats say.\n\nMany EU27 capitals have been approached by London with offers of deals or bilateral arrangements that would ameliorate the impact of a no-deal Brexit on both sides, according to two diplomats. The move has infuriated Commission officials, including EU chief negotiator Michel Barnier, who are concerned that a patchwork of partial deals could be more beneficial to the U.K. than the Withdrawal Agreement negotiated by Theresa May's government last year.\n\nA spokesperson for the U.K.'s Department for Exiting the EU said it is \"untrue\" the U.K. is trying to bypass talks with the Commission.\n\nAt a meeting of Brexit EU27 officials last week, almost “all delegations mentioned that they were being approached by the U.K. on several issues,” said one of the diplomats. These included topics such as data protection, plus social security benefits and health entitlements of British citizens living in other parts of the EU.\n\nGermany is among the countries approached by London with an offer of a mini deal on social issues, three EU27 diplomats say. “It's a sign of British desperation” said one of the diplomats.\n\n“I see it as a clear attempt by the British side to go to countries and give them something they care about, such as citizen rights, to create goodwill and also weaken the EU’s common line that London must first ratify the Withdrawal Agreement before negotiations about future relations and trade can begin,” said Volker Treier, head of foreign trade at the German Chamber of Commerce.\n\nLuxembourg Prime Minister Xavier Bettel told POLITICO his country has already come to an agreement with the U.K. that would come into effect if there is no deal. He said this is not a secret mini deal but “an agreement with the U.K. about voting rights, so Luxembourgers can vote for local elections in Great Britain, that maybe not change the result at the end but at least they have civil rights in the U.K. and that was important for that, I signed that with [British Brexit] Secretary [Stephen] Barclay.”\n\nA Czech diplomat said no such a deal or any offer had been made by Johnson's government to Prague.\n\nThe representative of the Commission at a meeting of Brexit officials last week noted approvingly that member countries are resisting offers of side deals from London. “Whatever the U.K. is offering has no solid legal basis,\" according to one of the diplomats.\n\nAt a separate meeting of EU ambassadors on Wednesday last week, Barnier warned against an apparent attempt at divide and rule by the U.K. He said it is important that putting in place contingency measures for no deal should not lead to a slew of uncoordinated mini deals that could end up being more advantageous to the U.K. than the Withdrawal Agreement.\n\nBrexit experts in the Council who are part of the EU's Article 50 Working Group have been asked by the group's presidency to report by Wednesday on offers made by Boris Johnson's government, setting out in which sector an offer exists; to what goal; and whether any deal has been done. The answers will not be disclosed but will be discussed in a seminar to coordinate the bloc's response, an EU official said.\n\nSo far though, London doesn't appear to be having much luck. “They came to offer a mini deal, but they had not much to offer,\" said one EU diplomat, \"They couldn't offer us to open a manufacturing plant that gives jobs, because they have no manufacturing. They couldn't offer us defense, because we have NATO. They couldn't offer money because their GDP is big but no so big. They could only offer to open one more bank branch.\"\n\nA spokesperson for the U.K.'s Department for Exiting the European Union said: “This story is untrue and seems to conflate two separate strands of work.\"\n\nThe spokesperson said that the U.K. is seeking changes to the Withdrawal Agreement and to that end, lead negotiator David Frost is in talks this week with the Commission's Task Force 50 in Brussels while Brexit Secretary Stephen Barclay spoke to EU negotiator Michel Barnier by phone last week.\n\n“Secondly, we are speaking to Member States about key bilateral arrangements in areas such as Citizens Rights to ensure we are ready to leave on 31 October, whatever the circumstances,” the spokesperson added.\n\nCristina Gallardo contributed reporting.\n\nThis story has been updated.\n\nThis article is part of POLITICO’s premium Brexit service for professionals: Brexit Pro. To test our expert policy coverage of the implications and next steps per industry, email pro@politico.eu for a complimentary trial.", "description": "EU officials see the move by London as an attempt at divide and rule.", "authors": ["Jacopo Barigazzi", "Hans Von Der Burchard", "Maxime Schlee", "Paul Dallison"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/09/GettyImages-1167093209-1200x628.jpg", "published_at": "2019-09-10"}