{"pub": "guardian", "url": "https://theguardian.com/education/2019/oct/01/oxford-professors-children-refused-visas-to-join-her-in-uk", "downloaded_at": "2019-10-01 09:26:10.690236+00:00", "title": "Oxford professor’s children refused visas to join her in UK", "language": "en", "text": "Amber Murrey, an American academic, was “ecstatic” about being appointed associate professor in geography at Oxford University last year. But the dream turned sour two weeks ago when the Home Office refused to grant visas for her two daughters, aged four and nine, to live with her in the UK.\n\nDr Murrey used an immigration lawyer to make sure the visa applications for her daughters, who have US passports, went smoothly, and was not anticipating a problem. Her husband has business commitments overseeing property renovations in Cameroon, where he is from, and the couple had included joint written consent for their daughters to live with her in Oxford.\n\n“When I read those three unemotional sentences saying they were denying my children entry to the UK I felt complete disbelief,” she says. “I had already packed the girls’ bags and bought their school uniforms. It is insane that you can have a legal document with both parents’ consent to have the children with their mother and they simply say no, that can’t happen.”\n\nHer case will add to a tide of anger among academics, who say the Home Office’s hostile immigration environment is making it difficult for talented people from abroad to forge an academic career in the UK.\n\nMy nine-year-old said: 'I know why they’ve rejected me, it’s because I have been misbehaving, Mama.' We both cried hard\n\nThis is the second time in a month that the Home Office has refused a visa to an American academic based at Oxford University. Last month Education Guardian reported that Dr Elizabeth Ford, a music historian about to start a fellowship at Oxford, was given two weeks to leave after eight years in the UK, because the Home Office said it had granted her last visa erroneously.\n\nYoung overseas academics say that universities are now so frightened of the tough new visa regime that, in some cases, they are automatically rejecting international candidates for jobs they should be eligible for.\n\nDr Murrey, an expert on social change in Africa, who has published widely and previously held positions at universities in Cairo, Massachusetts and Ethiopia, took up her post in Oxford last year. Without proof of residency she couldn’t set up schooling or somewhere to live in advance, so the couple decided she should establish a base in Oxford before moving the family. While she has been returning to Cameroon to see her daughters and husband in the university holidays, she says this has been an emotional strain.\n\n“It has been really hard, because I need to spend more time with my daughters but I am wary of being out of the UK for too long in case it jeopardises the terms of my tier 2 visa,” she says.\n\nThe news has hit the family hard. Murrey says: “My nine-year-old had been so excited about her new school, and our apartment near a meadow. After I told her their visas had been denied she told me: ‘I know why they rejected me, it’s because I’ve been misbehaving this week, Mama’. We both cried very hard.”\n\nUS academic given two weeks to leave UK after eight years Read more\n\nThe Home Office rejection letters say that under immigration rules a child may only be given a visa if both parents are living together in the UK. This would be waived if the parent living here had sole responsibility for the children, or the other partner had died.\n\n“This policy seems to operate under the guise of keeping families together, but it is splitting mine apart,” Murrey says.\n\nUltimately the couple want the whole family to live together in Oxford, but Murrey says that right now they are just trying to “do what is best for our daughters”.\n\nShe doesn’t know whether she has been singled out as a risk because her husband is from Cameroon. “We have family members and friends there who have been rejected for British visas in the past,” she says.\n\nThe Wellcome Trust, a health research charity, has evidence of around 100 cases in which academics, especially from African countries, have been refused visas to come to the UK for conferences, often for spurious reasons.\n\nThe African Studies Association UK found that at least 17 delegates were refused entry for its biennial academic conference at Birmingham University last year.\n\nInsa Nolte, a lecturer in African culture at Birmingham, is frustrated that academics can’t appeal against these decisions. “There is no process to identify immigration officers who consistently misjudge cases or who make racist assumptions,” she says.\n\nGender pay gap expert among top professors quitting Brexit Britain Read more\n\n“If we are going to find solutions to global concerns like food security and climate change, we need to collaborate with academics across the world.”\n\nMeanwhile, young international academics who have gained their PhDs in Britain say some universities, fearful of the tougher visa rules, are automatically rejecting non-UK nationals for jobs for which they should be eligible.\n\nDr Lisa Kayjani, an American who did her PhD in sociology at Edinburgh University, says: “In one case it was a job at another university I knew I could get a visa for. There was a pop-up as soon as I clicked the box saying I would need a visa. It said: ‘It is extremely unlikely that we would be able to sponsor you and we recommend that you abandon the application now’.”\n\nShe applied anyway, but at 1am the next day received a rejection email. “It was clear that was an automated response, presumably because I was not a UK national.”\n\nKayjani has given up applying to British universities. “Living with the hostile environment in the UK has worn me down so much that I don’t want to be an immigrant any more. The emotional tax is too great. I’m going home.”\n\nA young Canadian academic, who wished to remain anonymous, recently encountered a similar pop-up window when applying for a full-time lectureship that should have qualified her for a tier 2 visa at a London university.\n\n“It said: ‘It is highly unlikely that you would obtain permission to work in the UK on the basis of an offer for this … job. It is therefore recommended that you do not continue with your application’.”\n\nUK-led cancer and climate trials at risk as British researchers become liability Read more\n\nShe says this felt like a sign saying: “foreigners go home”. She blames the government rather than universities, but says that after a year of applying for jobs she is beginning to feel desperate.\n\nGareth Edwards, a senior geography lecturer at the University of East Anglia and co-founder of International and Broke, which campaigns against high visa costs for academics, says international academics are getting this sort of pop-up warning when applying for permanent lectureships. “Those jobs are most certainly eligible for sponsorship,” he says.\n\nMelany Cruz, a Chilean PhD student at Birmingham University, applied for an academic position elsewhere and also got an apparently automated rejection at 1am the next working day. “I’m sure not many HR people are working at 1am. I don’t think my application ever made it to the panel,” she says. “It is starting to feel impossible to find a job as an international PhD student, which is such a shame as I love what I do.”\n\nPaul Boustead, chair of the HR practitioners’ group Universities Human Resources, says universities want to recruit the most talented staff but some roles are simply “unlikely to obtain a work permit”.\n\nThe Home Office says:“We welcome international academics from across the globe and recognise their contribution to the UK’s world-leading education sector. All UK visa applications are considered on their individual merits, on the basis of the evidence available, and in line with the immigration rules.”", "description": "US family split as Home Office makes it increasingly difficult for overseas academics to work in UK universities", "authors": ["Anna Fazackerley"], "top_image": "https://i.guim.co.uk/img/media/7680b312250f1e788f8834b1c78ab644c3b4ca95/0_329_5804_3482/master/5804.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9c47bed0978d870613db0049765f6f35", "published_at": "2019-10-01"}