{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7574331/League-title-barometer-success-Liverpool-judged--Moore.html", "downloaded_at": "2019-10-15 08:12:10.410106+00:00", "title": "League title is `barometer of success´ by which...", "language": "en", "text": "Liverpool chief executive Peter Moore believes adding a long-awaited league title to their Champions League triumph is the “barometer of success” by which the club is judged.\n\nA sixth European Cup was secured in June, less than a month after the Reds were narrowly pipped by Manchester City to the Premier League by a point despite a tally which would have guaranteed top spot in 25 of the last 27 seasons.\n\nThe league resumes on Saturday with Jurgen Klopp’s side – in possession of the only 100 per cent record in England’s top four divisions – eight points clear of City and set for another title challenge.\n\nLiverpool won their sixth European Cup in June (Mike Egerton/PA)\n\n“I think that is what our fans want,” Moore exclusively told the PA news agency.\n\n“We were so close last year, 97 points, and in any other year we would have won it.\n\n“But the club goes on and I think that (a league title), for many of our fans, would sit alongside our Champions League triumph as the barometer of success.\n\n“As a club off the pitch we have a set of visions, missions and values and at the top of that sits supporting the team to ‘win trophies’.\n\n“Two words, because ultimately that is what our fans want and that is what we need to deliver.”\n\nCity have been the domestic benchmark for their rivals, with four Premier League titles, four League Cups and two FA Cups since 2011.\n\nHowever, Moore insists Liverpool are following their own path.\n\n“We feel good about the club in its entirety and we don’t compare ourselves with any other football club,” he added.\n\n“What Liverpool had to do was bring in a world-class manager, which we have, bring in a world-class squad, which we have, play exciting football, bring in players that are going to draw crowds no matter where they go – we’ve done that – build financial security at the club, we’ve done that.\n\n“It all sets us up for success going forward. It is not a question of us comparing ourselves versus another club.”\n\nExactly nine years ago Fenway Sports Group – then New England Sports Ventures – completed their £300million purchase of the club.\n\nTheir first job was paying off the £237million owed to major creditors Royal Bank of Scotland – ruling out any threat of the club’s holding company being put into administration.\n\nThey inherited a club, unthinkably, in the Premier League’s bottom three with six points from their opening seven matches during the short-lived reign of Roy Hodgson.\n\nSustained investment in the squad and infrastructure has elevated the American group to the highest point of their ownership, with the club posting £125m record profits – re-invested back into the squad even before the financial results were announced in February – winning the Champions League and starting this season brilliantly.\n\nJohn W Henry and Tom Werner secured a £300million deal to buy Liverpool in 2010 (Nick Potts/PA)\n\nIt has not all been plain sailing with walk-out protests over ticket price rises in 2016 and a recent issue over the failed attempt to trademark the word ‘Liverpool’ but on-field success has appeased fans.\n\n“From a prestige perspective it (the Champions League victory) kind of gets us back to where we once were in what we liked to call ‘European royalty’, so the impact is massive,” said Moore.\n\n“When we look at the health of the club our revenues have doubled in the last five years and been reinvested back into the squad. We have steadied the ship from some dark days nine years ago.\n\n“We take great pride in our business model: a self-sustaining football club.\n\n“Simply, you drive revenues as best you can to invest on the pitch and that investment on the pitch pays off and global sponsors and advertisers want to be a part of that.\n\n“They continue to give the football club revenue which will again drive investment on the pitch and we win more games.\n\nA wide smile, fiery passion, heavy metal football and so many memories\n\n\n\nCongratulations to Jurgen Klopp! 4️⃣unforgettable years at @LFC#PL #OnThisDay pic.twitter.com/hqwfAR36Fv — Premier League (@premierleague) October 8, 2019\n\n“It is a virtuous cycle and that is the modern business model for high-performing football clubs: invest, invest, invest for success.\n\n“Yes, we had that headline, £125million, but all of that money, by the time we had announced that, had been reinvested in players like Virgil Van Dijk, Alisson Becker, Naby Keita and Fabinho. But the club is in fine shape financially.\n\n“I think, as you saw from Jurgen’s comments, he has the squad he likes and we have locked this squad up on long-term contracts, which is important.\n\n“He has built the chemistry and these players are content, motivated and excited to win – not just for Jurgen and the coaching staff but for the people of Liverpool and broader global fanbase.”", "description": "A sixth European Cup was secured in June, less than a month after Liverpool were narrowly pipped by Manchester City to the Premier League by a point.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/09/wire-19729658-1571126688-718_636x382.jpg", "published_at": "2019-10-15"}