{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/rick-and-morty-season-4-trailer-reveals-first-look-at-return-of-mr-poopybutthole-10873689", "downloaded_at": "2019-10-07 12:15:11.108367+00:00", "title": "Rick and Morty brings back Mr Poopybutthole in season 4 trailer", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nRick and Morty season four’s first trailer has finally dropped, teasing the return of the uber-happy Mr Poopybutthole.\n\nThe spectacularly named character was last seen in a post-credits scene of the final episode of season three, where it was revealed that he had started a family. Justin Roiland’s character broke the fourth wall to tell viewers that he would be back season four, but referencing the delay, he joked: ‘However long it takes.’\n\nTurns out, it didn’t take long at all (well, two years). Footage released by Adult Swim shows the inter-dimensional being teaching a university class (in a top hat and cane no less) and having to fight off a gang of now-rabid students.\n\nMr Poopybutthole is back for season four of Rick and Morty (Picture: Adult Swim)\n\nAdvertisement\n\nAdvertisement\n\nThe rest of the trailer shows Rick and Morty knee-deep in space battles, magic and all kinds of mind-bending, genre-twisting cartoon nonsense.\n\nThe fourth cycle of the show comes two years after the third, and its no coincidence that Mr Poopybutthole is glimpsed at in the new trailer; he’s the character most commonly associated with the show’s long hiatuses.\n\nFans of the show are already second-guessing what could happen in the next run, anticipating that Evil Morty will play a pivotal role in the proceedings.\n\nCaption: Rick and Morty season4 teasers: Evil Morty is back\n\nProviders: Adult Swim/Twitter/RickandMorty\n\nIt also appeared that, yes, we could be getting a Kanye West episode of the cult hit too, so you should probably start preparing yourself for that already.\n\nThe programme has also faced a sad turn of events in the last few weeks; one of its producers, Michael Mendel, sadly passed away at the age of 53.\n\nRick and Morty season four will air in November. UK viewers can catch the show on Channel 4.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: What do the cast of Rick and Morty look like ahead of season 4?\n\nMORE: First look at Rick And Morty season 4 as pictures finally drop – but where on earth is Morty?", "description": "Rick and Morty teased the return of Mr Poopybutthole in the newest trailer for season 4, which sees the unlikely duo go intergalactic.", "authors": ["George Griffiths"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_88789853_1570449485.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}