{"pub": "yahoo", "url": "https://news.yahoo.com/are-too-many-dems-running-for-president-132539618.html", "downloaded_at": "2019-09-13 00:57:27.724963+00:00", "published_at": "2019-09-12", "title": "Are too many Dems running for president?", "language": "en", "text": "“The 360” shows you diverse perspectives on the day’s top stories.\n\nWhat’s happening:\n\nThe Democratic presidential primary features more candidates than any race in modern American history. At its peak, the field contained 24 contenders. Heading into Thursday’s debate, there are still 20 people left in the race.\n\nOnly 10 candidates met the criteria set by the Democratic National Committee to qualify for the debate. Failure to make the stage led a few to drop out of the race, but many who came up short have indicated they will keep campaigning.\n\nWhy there’s debate:\n\nThe large field of candidates has raised concerns that voters might be overwhelmed by the choices. Some also worry that lower-tier candidates are taking up debate airtime that could be used to help voters decide among the frontrunners. Others have also suggested that some candidates remain in the race to promote themselves over the earnest desire to compete for the presidency.\n\nAll these factors could hurt the chances the eventual nominee has of beating Donald Trump or gaining control of Congress in 2020. Beto O'Rourke and Steve Bullock have faced pressure to drop out of the race and compete in Senate races in their respective home states of Texas and Montana, a path recently taken by John Hickenlooper of Colorado.\n\nOn the other hand, there are those who believe that a large field actually benefits the Democrats by presenting a broad and diverse set of candidates to excite voters, who will carry that enthusiasm into the general election. Others point out that it is far too early to demand low-polling candidates drop out, since no actual primary votes will be cast for another four-and-a-half months.\n\nWhat’s next:\n\nBarring a surprise dropout by one of the top-tier contenders, the debate stage for the next Democratic debate in October will be a bit more crowded. Each of the 10 candidates in Thursday's debate has already qualified. They will be joined by the wealthy hedge fund manager Tom Steyer, who recently met the donor and polling thresholds to participate. Primary voting will begin with the Iowa caucuses in February.\n\nPerspectives\n\nToo many candidates has a negative effect on the race.\n\n“Huge fields of candidates are bad for the parties, bad for the quality of the debate within that party, and probably bad for the country as a whole.” — Jim Geraghty, National Review\n\nAt this early stage, any candidate could break through.\n\n“The current state of the field is etched in sand — the first big wave or gust of wind could shake it all up. Someone whose name is not in this column at all today could be on everyone's Twitter feed tomorrow.” — Paul Begala, CNN\n\nVoters might be overwhelmed by too much choice.\n\n“A surplus of candidates will give Democratic voters what behavioral scientists like me call ‘choice overload.’ Simply put, having too many choices can make it harder to make a decision, and this is likely to have a profound — profoundly negative — effect on the 2020 campaign.”\n\n— Lilly Kofler, Politico\n\nMany voters are still undecided.\n\n“While the Iowa caucus is just a few months away, many voters are still undecided at this stage. The state of the race could adjust rapidly as more voters start to pay closer attention and make up their minds.” — Grace Panetta, Business Insider\n\nA big field is needed to represent the broad spectrum of potential Democratic voters.\n\n“Maybe the most important reason the field is so damn crowded is that the Democratic Party is still sorting through an identity crisis in the aftermath of 2016. A host of candidates look at recent history and think: The Democratic Party doesn’t really know what it’s looking for, and in this time of chaos, maybe the answer is me.” — Dylan Scott and Tara Golshan, Vox\n\nThe large Democratic field is an advantage to Republicans.\n\n“It gives us the opportunity to create chaos every single day. … They're making our jobs easy.” — Republican strategist Sarah Dolan to NBC News\n\nRecent history shows how much can change at this point in the race.\n\n“428 days away from Election Day in 2008, polls forecast a Hillary Clinton-Rudy Giuliani race, rather than Barack Obama versus John McCain. At a similar point in 2012, Rick Perry led the Republican field.\" — The Economist\n\nSome candidates are putting personal interest over what’s best for the party.", "description": "A historically-large field of Democratic primary candidates is vying for the party's presidential nomination. Does this large group help create a bigger tent for Democrats or is it muddling their 2020 message?", "authors": ["Mike Bebernes"], "top_image": "https://s.yimg.com/uu/api/res/1.2/MA8Ea8RTyRllaXwJlD89EQ--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/45c4c190-d560-11e9-b77c-d5ec0061288c"}