{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/08/WS5d9bd640a310cf3e3556f02e.html", "downloaded_at": "2019-10-08 01:25:55.641206+00:00", "title": "Airbnb to offer new science sabbatical", "language": "en", "text": "Xinhua | Updated: 2019-10-08 08:20\n\nTourists cruise the western Antarctic peninsula. [Photo provided to China Daily]\n\nAirbnb is offering a handful of people concerned about the environment a chance to participate in scientific research on how to help preserve it during an all-expense paid trip to Antarctica.\n\nThe Antarctic Sabbatical, as the travel company is dubbing it, will give five people the opportunity to study how widely micro plastics have infiltrated the region. Over a month's time in December, they'll be trained in lab work in Chile, collect snow samples in Antarctica, climb key glaciers and even visit the South Pole.\n\nScientist Kirstie Jones-Williams, who will be helping to train and guide the volunteer researchers, says the goal of the program isn't to create more scientists but rather global ambassadors on the dangers of pollution and more.\n\n\"The science itself that we're doing isn't enough,\" she says.\n\n\"Actually, one of the biggest threats to our sort of natural environment isn't necessarily the lack of information that we have ... but it's more the disenfranchisement that can occur with policymakers and apathy and eco-fatigue.\n\n\"One of the main things is to get a bunch of people that can take the messages that we learn back to their respective countries.\"\n\nIt's the second offering in Airbnb's sabbatical program, which offers users a chance to take time to do more than see the sights but actually do some good. Earlier this year, Airbnb selected five people to spend three months in Grottole in southern Italy to help preserve the way of life in the town, which is in danger of disappearing.\n\nAirbnb's Chris Lehane says both sabbaticals are part of the company's larger goal of more eco-friendly travel and to raise awareness of tourism's global footprint.\n\n\"Airbnb is not going to solve climate change, but we all have a responsibility to do what we can and use our capacity to help take steps forward,\" says Lehane, senior vice-president of global policy and communications.\n\n\"A lot of travel in the world takes place in and around big events. Can we find ways when people are going to travel around these big events, to make them much more sustainable?\"\n\nNo scientific background is required to be selected for the Antarctic trip: However, a love of the environment and the ability to complete some of the physical tasks, such as collecting samples, climbing glaciers and enduring bitter cold, is paramount.\n\n\"It is hard to work in cold environments so people that ... perhaps work well under pressure, work well when they're tired, that's actually quite key,\" Jones-Williams says.\n\n\"And to actually ask questions, and people that are really hungry to get as much as they can out of this experience. It's really people that kind of respect the scientific process.\"\n\nThe five will stay in Airbnbs in Chile for their training for about two weeks and will stay at a camp provided by Antarctic Logistics & Expeditions in Antarctica for about a week.\n\nAirbnb will partner with the Ocean Conservancy to use the research for advocacy.\n\nNick Mallos, a conservation biologist and ocean-debris specialist for Ocean Conservancy, calls it an \"incredible opportunity\", and notes that the group has long worked with \"citizen science volunteers\" to help clean up the environment.\n\n\"We've seen the power of when you train and empower individuals to perform science, they can generate invaluable information and data that ultimately then can form solutions,\" he says.", "description": "Airbnb is offering a handful of people concerned about the environment a chance to participate in scientific research on how to help preserve it during an all-expense paid trip to Antarctica.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/08/5d9bd640a310cf3e979ffb90.jpeg", "published_at": "2019-10-08"}