{"pub": "breitbart", "url": "https://breitbart.com/tech/2019/10/20/sallie-mae-sales-team-rewarded-with-hawaii-trip-as-student-debt-tops-1-6-trillion", "downloaded_at": "2019-10-20 23:27:12.542395+00:00", "title": "Sallie Mae Sales Team Rewarded with Hawaii Trip as Student Debt Tops $1.6 Trillion", "language": "en", "text": "Sallie Mae sales employees were rewarded this week with a five-day, all-expenses-paid trip to Hawaii for achieving a record year of $5 billion in student loans, adding to the reported $1.6 trillion in student loan debt for Americans.\n\nAccording to a report by the New York Post, 100 Sallie Mae salespeople were rewarded this week with a trip to Maui, Hawaii. The employees were rewarded for their effort toward a record financial year in which they lent $5 billion in student loans to 374,000 families.\n\nRay Quinlan, the CEO of Sallie Mae, told NBC News this week that some Sallie Mae employees chose to bring their families with them on the five-day trip, even though the company had not offered to pay for them.\n\n“We said, ‘Hey, look, Maui is a pretty nice spot,’” Quinlan said. “And so if you wanted to stay a few days or want to bring family, that’s up to you.” Quinlan went onto say that the trip was organized this year to recognize the hard work of the sales staff.\n\nSallie Mae has come been widely criticized for its treatment of families seeking loans to further their children’s education. One student, Paige McDaniel, told reporters that she was forced to declare bankruptcy after Sallie Mae attached $200,000 in interest to her $120,000 graduate school tuition.\n\n“When I told them that, you know, I couldn’t afford that, could we make some payment arrangements, they essentially said, ‘So sorry, we’ll put a lien on your house and garnish your wages if you don’t make those payments,’” McDaniel said in a comment.\n\nIn a statement, a spokesperson for Sallie Mae said that the majority of their borrowers pay off their loans. According to their internal statistics, only two percent of their customers default on their loans each year.\n\n“College should be more affordable, and student loan providers have an obligation to lend responsibly,” the company wrote in a short statement. “That’s why we assess every applicant’s financial situation, and if they haven’t demonstrated their ability to handle the debt, we say no.”\n\nSallie Mae loans make up a small percentage of the $1.6 trillion in student loans held by Americans, most of which are federal loans. The ballooning cost of college and massive student loan debt is recognized as reaching crisis levels by politicians on both sides of the aisle.", "description": "Sallie Mae sales employees were rewarded this week with a five-day, all-expenses-paid trip to Hawaii for achieving a record year of $5 billion in student loans, adding to the reported $1.6 trillion in student loan debt for Americans.", "authors": ["Tom Ciccotta"], "top_image": "https://media.breitbart.com/media/2019/10/Hawaii-Sunset-640x335.jpg", "published_at": "2019-10-20"}