{"pub": "wsj", "url": "https://barrons.com/articles/good-company-rich-brilliant-willings-energy-efficient-leds-01570727125?mod=rsswn", "downloaded_at": "2019-10-10 18:25:11.349870+00:00", "title": "Good Company: Rich Brilliant Willing’s Energy Efficient LEDs", "language": "en", "text": "Text size\n\nWhen Theo Richardson, Charles Brill, and Alexander Williams met as classmates at Rhode Island School of Design (RISD), a friendship was forged over furniture.\n\nThey were studying furniture design, and after graduating in 2006, the three each found themselves working in the fine arts, architecture, and interior design worlds in New York City. Sharing a studio in an East Village basement, the former classmates started out using the space to work independently on their own projects.\n\nThat didn’t last long. Working together so closely, their ideas just naturally began to meld together, forming what would eventually become Rich Brilliant Willing (RBW), their innovative design firm that focuses on LED-centric lighting fixtures for residential, workplace, and hospitality spaces.\n\nThe name is a playful twist one each of the founder’s last names, something Brill, the firm’s managing partner, says “fittingly spoke to our shared aspirations.”\n\nIncorporated in 2009, RBW has taken the playful philosophy behind its name to its striking minimalist designs. The company doesn’t outsource its production. Instead, it’s in control of all parts of its manufacturing, with a design studio and factory that makes products by hand in Industry City, Brooklyn, and a separate showroom for its work located in Soho.\n\nIn a decade, RBW went from an idea bounced around between college friends to a firm that has provided lighting to headquarters for Silicon Valley giants like Uber and Yelp.\n\nTHE ITEM\n\nJust take a look through RBW’s list of lighting options on its website and you’ll find an extensive, diverse collection that could illuminate a host of spaces. It offers smaller fixtures for sconces to outdoor lighting installations to futuristic chandeliers that vary in size and shape.\n\nFor instance, the brand has various “Palindrome” chandeliers that curve and loop onto themselves like cursive signatures written out in the air. Not every design is so bold. The “Centro” designs offer subtler, smaller circular fixtures that could be well-suited for bathrooms or lighting up corridors.\n\nUnder their workplace banner is everything from small sconce lights that could fit in hallways to large installations that could hover over boardroom tables.\n\nMike Garten\n\nPRICE\n\nAs with the wide range of designs, prices vary. There are the smaller “Brim” lights, smaller customizable sconce displays that price from around $260 to $390. Outdoor options like the small “Ledge Round” sconce sells for $220. On the other end of the spectrum, look to the larger chandeliers that could be priced at $9,580, such as the “Pilot 16,” or much higher, such as the “Cinema 864 121212 Plated,” for $49,740.\n\nDESCRIPTION\n\nRBW has seen a lot of success in a relatively short amount of time. When it comes to understanding what niche of the lighting world their company fits into, the founders emphasize their versatility.\n\n“Our fixtures are designed to enable a wide set of configurations of sizes and finishes,” says Richardson, the company’s director of development. “Our highly flexible lean manufacturing process also allows us to offer such a quick lead time.”\n\nWHAT’S THE GOOD?\n\nThe firm made a commitment to switch over entirely to LED (light-emitting diode) lighting in 2011. Brill says the company saw “rapid changes in LED technologies and the creative possibilities it can offer industrial designers like us to explore unique forms while delivering the quality of light and saving energy consumption.”\n\nHighly energy efficient, LEDs also last a lot longer. Richardson says RBW’s commitment to energy efficiency and sustainability efforts squares with the company’s ambition to “become pioneers in decorative lighting by adopting all of our fixtures to LED.”\n\nThey recently achieved B Corporation certification, granted to businesses that hit a high standard for social and environmental impact, public transparency, and legal accountability.\n\n“It shows our continued commitment contributes to crafting energy-efficient collections and allowing designers and consumers to have the choice to do so without sacrificing beautiful designs,” Richardson says.\n\nMike Garten\n\nWHAT’S NEXT\n\nLast year, RBW gave its customers something of a glimpse into the future when it presented a conceptual design for thin, flexible lighting panels that used OLEDs (organic light-emitting diodes)—think of them as the next generation LED. They presented the installation that they made with OLED manufacturer OLEDWorks at their Soho showroom during NYCxDesign.\n\n“OLEDs are an emerging source of illumination that resembles thins hefts of light. On the forefront of LED technology, they have, until now, gone largely unexplored in the world of lighting design,” Richardson says. “As manufacturing volumes increase, lighting with OLEDs is expected to become more commonplace, beginning with niche applications in automotive, aerospace and industrial applications.”\n\nFor the immediate future, Brill says RBW is always looking to push itself and “find problems to solve.”\n\nHe adds that the company is looking to see what new results they could have by further combining design with technology. Brill says look for things like WiFi-dimming controls and color-tunable LED collections in RBW’s future.", "description": "The Brooklyn-based brand illuminates hip Silicon Valley office spaces and private homes alike", "authors": ["Brian Mastroianni"], "top_image": "https://images.barrons.com/im-115771/social", "published_at": "2019-10-10"}