{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/stocks/halliburton-has-reached-a-major-downside-price-target-so-a-new-look-is-warranted-15105494", "downloaded_at": "2019-09-26 16:46:04.254557+00:00", "title": "Halliburton Has Reached a Major Downside Price Target: What Now?", "language": "en", "text": "During the Lightning Round of Mad Money Wednesday night one caller who wanted to pick the brains of Jim Cramer asked about Halliburton Co. (HAL) : \"I'm not buying any oil or oil service stocks,\" said Cramer. Jim is an accomplished fundamental analyst and understands secular trends but Halliburton is back near the crisis lows of 2008 so as a card-carrying technical analyst I prefer to go with the charts and not the known fundamentals.\n\nLet's check out the zigs and zags of the charts and indicators.\n\nIn the daily bar chart of HAL, below, we can see that the bears have been in control of the chart the past 12 months as prices have been more than cut in half from around $40 to under $18 but things have started to change since May. The level of volume has been heavier since late May suggesting a potential shift in ownership from weaker hands to stronger hands.\n\nPrices are below the declining 50-day moving average line but the line was tested in July as well as this month. The declining 200-day line has not been tested this year at all.\n\nThe daily On-Balance-Volume (OBV) line declines from October to late May and then diverges from the price action with equal lows in June and August despite that prices made a lower low. The OBV line has yet to turn up and move above the July high but this is a potential start.\n\nIn the lower panel is the 12-day price momentum indicator (today's price minus the price twelve days ago). Here we see another bullish divergence as this indicator makes a higher low from May to August with prices making a lower low. The rate of HAL's decline is slowing and that is a subtle sign that buyers are finding these lower price levels more attractive.\n\nIn the weekly bar chart of HAL, below we can see what looks like a large double-top formation (some might call it a triple top). The height of this pattern projected downward gives you a $20 price target. Prices are below the declining 40-week moving average line and the line looks like it is beginning to bottom.\n\nThe weekly OBV line has been weak since May 2018 but recently it shows a good move to the upside. The 12-week price momentum study shows a large bullish divergence with higher lows in June than back in December of 2018. When compared to the price action showing lower lows in price we get the divergence.\n\nIn this first Point and Figure chart of HAL, below, we can see that a downside price target of around $17 is being projected. This would not be a new low in price but rather a retest of the prior nadir.\n\nIn this second longer-term Point and Figure chart of HAL, below, we can see that a long-term price target of $20 was reached.\n\nBottom-line strategy: HAL has reached a long-term downside price target and the trading volume has increased in recent months. The reason(s) why HAL might appreciate in price are not known yet but investors seem to be discounting something more positive in the future. Maybe HAL is worth putting on your year-end shopping list?", "description": "Halliburton Has Reached a Major Downside Price Target: What Now?...HAL", "authors": ["Bruce Kamich", "Halliburton Has Reached A Major Downside Price Target", "What Now", "A New Technical Look Is Warranted.", "Stocks Quotes In This Article", "Doug Kass", "Jim Collins", "Stephen Guilfoyle", "Bob Lang", "Peter Tchir"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/e1ac282a-6517-11e9-a10a-01f90ce9e71f.jpg", "published_at": "2019-09-26"}