{"pub": "breitbart", "url": "https://breitbart.com/news/biden-higher-education-plan-offers-free-community-college-student-loan-relief", "downloaded_at": "2019-10-08 15:55:32.739870+00:00", "title": "Biden higher education plan offers free community college, student loan relief", "language": "en", "text": "Oct. 8 (UPI) — Democratic presidential candidate Joe Biden unveiled a plan Tuesday that would allow Americans two no-tuition years of community college or other training, a venture that would cost taxpayers $750 billion per year.\n\nThe free community college proposal is similar to the one former President Barack Obama and Biden, his vice president, advocated years ago.\n\nBiden said the plan would be a federal-state partnership, with the government covering 75 percent of the cost and states 25 percent. He also proposed $50 billion in workforce training, community-college business partnerships and apprenticeships.\n\nThe proposal would also reduce student loan debt for those who work public service jobs, such as teachers or serving in the military. Biden’s plan would waive up to $10,000 per year of student loans for up to five years.\n\nThe plan stops short of more expensive and farther-reaching proposals of other Democratic challengers, like the four years of free tuition proposed by Sens. Elizabeth Warren and Bernie Sanders.\n\nBiden’s vision increases access to higher education for low-income students, minorities and undocumented migrants under the DACA program. It also includes bigger Pell Grants and new money for historically black colleges and universities.\n\nBiden’s wife, Jill, is a longtime community college professor in northern Virginia.\n\n“My students inspire me,” she told reporters. “They’re single parents and veterans. They juggle multiple jobs and care for their families. Many of them are first-generation college students.\n\n“They work so hard and ask for only one thing in return: Opportunity. And every American deserves that.”", "description": "Oct. 8 (UPI) — Democratic presidential candidate Joe Biden unveiled a plan Tuesday that would allow Americans two no-tuition years of community", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-08"}