{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/brexit-trump-food-hygiene-standards-trade-department-memo-a9145971.html", "downloaded_at": "2019-10-07 20:16:41.190946+00:00", "title": "Trade department would lobby for government to accept Trump's demands for weaker food hygiene standards after Brexit, Whitehall memo says", "language": "en", "text": "The international trade department will lobby for the UK to accept demands from Donald Trump's administration for rules on food safety to be relaxed as part of a post-Brexit trade deal with the US, according to leaked Whitehall memo.\n\nThe document, prepared for Theresa Villiers, the environment secretary, warns that the US government will try to force the UK to agree to weaken standards that stop people eating contaminated products.\n\nIt suggests that the Department for International Trade will push for the demands to be accepted but that these efforts should be resisted, raising the prospect of a major battle between Whitehall departments.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIf the UK agreed to lower standards to match US regulations, it would allow food products to be sold even if they were contaminated by maggots, animal hair and rat droppings.\n\nThe memo, drawn up by officials at the Department for Environment, Food and Rural Affairs (Defra), says that lowering sanitary and phytosanitary standards (SPS) in order to meet US demands could put the prospect of a trade deal with the EU at risk, because European standards are significantly higher.\n\nAllowing lower-quality goods into the UK could also prompt the EU to erect a hard border on the island of Ireland in order to protect its single market, the document warns.\n\nMr Trump's administration is lobbying UK ministers to agree to weaken food regulations to allow US products such as chlorine-washed chicken and hormone-enhanced beef into the UK.\n\nThis could force UK farmers to lower their own standards in order to compete.\n\nThe US Food and Drug Administration decides the extent to which food products sold to consumers can contain contaminants including rodent hair, animal faeces, insect fragments and maggots.\n\nFor example, cocoa beans are allowed to contain up to 10mg of mammal faeces per pound, while ground paprika can contain up to 75 insect fragments and 11 rodent hairs per pound.\n\nThe UK does not currently allow any such contamination.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nThe Defra briefing warned that agreeing to the US's demands could damage public health in the UK.\n\n\"Weakening our SPS regime to accommodate one trade partner could irreparably damage our ability to maintain UK animal, plant and public health, and reduce trust in our exports,\" it says.\n\nThe document, which was obtained by Unearthed, the investigative wing of Greenpeace, also said that accepting weaker regulations would \"severely limit\" the UK's ability to strike a deal with the EU.\n\n\"Any significant movement could have implications for other [free trade agreements] or export arrangements, which are based one existing standards\", it said.\n\nShape Created with Sketch. Opposing protesters flock to parliament on would be date of Brexit Show all 30 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Opposing protesters flock to parliament on would be date of Brexit 1/30 Pro-Brexit leave the European Union supporters attend a rally in Parliament Square after the final leg of the \"March to Leave\" in London AP 2/30 The protest march which started on March 16 in Sunderland, north east England, finished on what was the original date for Brexit to happen before the recent extension Reuters 3/30 AP 4/30 Reuters 5/30 PA 6/30 Reuters 7/30 EPA 8/30 A Brexit supporter sips a can of Stella in protests outside of the Houses of Parliament AFP/Getty 9/30 Dedicated anti-Brexit campaigner Steve Bray and likewise pro-Brexit campaigner Joseph Afrane go head to head near the Houses of Parliament AFP/Getty 10/30 A pro-Brexit marching band in Parliament Square Getty 11/30 Remain supporters wave EU flags from a bus in Parliament Square PA 12/30 A Brexit supporter shouts slogans outside parliament EPA 13/30 A Brexit supporter protests outside parliament Reuters 14/30 A Brexit supporter protests outside of the Houses of Parliament Getty 15/30 Brexit supporters protest outside of the Houses of Parliament REUTERS 16/30 A pro-Brexit flag is waved in Parliament Square AP 17/30 The March to Leave nears the Houses of Parliament Reuters 18/30 A Brexit protester holds a sign outside parliament EPA 19/30 Brexit supporters carry the coffin of democracy AFP/Getty 20/30 Brexit supporters march outside parliament AFP/Getty 21/30 Brexit supporters take part in the March to Leave protest in London PA 22/30 Brexit supporters protest outside parliament AFP/Getty 23/30 A Brexit supporter holds a sign outside the Houses of Parliament Getty 24/30 A man holds satirical paintings of politicians Reuters 25/30 An pro-Brexit float on the March to Leave march in London Reuters 26/30 Far-right activist Tommy Robinson addresses protesters outside the Houses of Parliament Getty 27/30 A Brexit supporter outside the Houses of Parliament Reuters 28/30 A Tommy Robinson supporter arrives at the Houses of Parliament Getty 29/30 A jogger gestures rudely at a Brexit supporter outside of the Houses of Parliament AFP/Getty 30/30 A Brexit supporter outside the Houses of Parliament PA 1/30 Pro-Brexit leave the European Union supporters attend a rally in Parliament Square after the final leg of the \"March to Leave\" in London AP 2/30 The protest march which started on March 16 in Sunderland, north east England, finished on what was the original date for Brexit to happen before the recent extension Reuters 3/30 AP 4/30 Reuters 5/30 PA 6/30 Reuters 7/30 EPA 8/30 A Brexit supporter sips a can of Stella in protests outside of the Houses of Parliament AFP/Getty 9/30 Dedicated anti-Brexit campaigner Steve Bray and likewise pro-Brexit campaigner Joseph Afrane go head to head near the Houses of Parliament AFP/Getty 10/30 A pro-Brexit marching band in Parliament Square Getty 11/30 Remain supporters wave EU flags from a bus in Parliament Square PA 12/30 A Brexit supporter shouts slogans outside parliament EPA 13/30 A Brexit supporter protests outside parliament Reuters 14/30 A Brexit supporter protests outside of the Houses of Parliament Getty 15/30 Brexit supporters protest outside of the Houses of Parliament REUTERS 16/30 A pro-Brexit flag is waved in Parliament Square AP 17/30 The March to Leave nears the Houses of Parliament Reuters 18/30 A Brexit protester holds a sign outside parliament EPA 19/30 Brexit supporters carry the coffin of democracy AFP/Getty 20/30 Brexit supporters march outside parliament AFP/Getty 21/30 Brexit supporters take part in the March to Leave protest in London PA 22/30 Brexit supporters protest outside parliament AFP/Getty 23/30 A Brexit supporter holds a sign outside the Houses of Parliament Getty 24/30 A man holds satirical paintings of politicians Reuters 25/30 An pro-Brexit float on the March to Leave march in London Reuters 26/30 Far-right activist Tommy Robinson addresses protesters outside the Houses of Parliament Getty 27/30 A Brexit supporter outside the Houses of Parliament Reuters 28/30 A Tommy Robinson supporter arrives at the Houses of Parliament Getty 29/30 A jogger gestures rudely at a Brexit supporter outside of the Houses of Parliament AFP/Getty 30/30 A Brexit supporter outside the Houses of Parliament PA\n\nDespite these risks, the Defra memo suggested that the Department for International Trade, led by Liz Truss, is likely to lobby for the UK to \"accommodate\" US demands.\n\n\"Defra will come under significant pressure from DIT to accommodate the US's asks,\" it said. \"DIT are concerned about the ability for controversial SPS issues to help us negotiations [with the US].\"\n\nThe memo recommends that Defra “push back strongly” against DIT pressure “to secure our positions, particularly on dispute settlement, handling of custom terms and definitions, and around controversial issues (hormone beef, chlorine chicken)”.\n\nAnd it points out that many areas of food regulation are devolved matters, meaning the UK's regional governments could effectively scupper the prospects of a deal with the US.\n\nIt was reported last week that Boris Johnson had scrapped plans for the UK to remain tied closely to EU standards after Brexit.\n\nHowever, his spokesman said on Monday: \"The government has been clear throughout that we have no plan to reduce any of our standards in this area.\"\n\nBut Barry Gardiner, Labour's shadow international trade secretary, said: “A trade agreement with the USA risks opening the floodgates to food imports produced to much lower standards.\n\n“Their rules specify 'acceptable levels' of rat hairs in paprika, insect fragments in peanut butter, maggots in orange juice and rat droppings in ginger. The right level should be zero. Undercutting our farmers and food manufacturers like this would drive many of our producers out of business and put jobs at risk.”", "description": "The international trade department will lobby for the UK to accept demands from Donald Trump's administration for rules on food safety to be relaxed as part of a post-Brexit trade deal with the US, according to leaked Whitehall memo. The document, prepared for Theresa Villiers, the environment secretary, warns that the US government will try to force the UK to agree to", "authors": ["Benjamin Kentish"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/11/10/15/caged-hens.jpg", "published_at": "2019-10-07"}