{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/13/the-kurds-a-bitter-history-of-betrayal", "downloaded_at": "2019-10-13 08:48:40.986060+00:00", "title": "The Kurds – a bitter history of betrayal", "language": "en", "text": "Donald Trump has given the green light for a Turkish invasion of Kurdish territory. He’s not the first US leader to turn his back on this ethnic group\n\nThe old Kurdish proverb is quoted so often that it would be hackneyed if it were not so true. An ethnic minority of about 30 million people spread across the Middle East, the Kurds have “no friends but the mountains”, they say. The aphorism proved itself again this week.\n\nThe Kurds, the fourth-largest ethnic group in the region, have been campaigning for their own state since the late 1800s. In the dismemberment of the Ottoman empire that followed the first world war, they saw their chance. The boundaries of a possible Kurdistan were considered in the negotiations after the 1918 armistice, but after Turkey fought back, the French and British tore up those plans and divided Kurdish-inhabited lands between Turkey, Iraq and Syria.\n\nErdoğan has managed the unthinkable: uniting all the other Middle East rivals Read more\n\nA short-lived Kurdish kingdom inside modern-day Iraq was crushed by 1924 with the assistance of the British.\n\nLast week’s decision by the White House not to stand in the way of Turkish invasion builds on a bitter history of Kurds being embraced, then spurned by capricious American administrations going back to 1975.\n\nThat year, Iraqi president Saddam Hussein made a surprise peace deal with the Shah of Iran. American guns and money that had been flowing to the Kurdish peshmerga forces fighting Hussein were abruptly cut off. The Iraqi dictator’s army promptly counterattacked the stranded Kurdish fighters.\n\nBy the 1980s, the Americans viewed Hussein more favourably. The Ronald Reagan administration continued supporting his war against the now-Islamic Republic of Iran even as his soldiers gassed and bombed Kurdish communities in a campaign that Iraqi courts have now recognised as a genocide. A chemical weapons attack in the northern city of Halabja in March 1988 killed up to 5,000 people, mostly civilians.\n\nIn 1990 Hussein’s invasion of Kuwait turned him back into an American enemy. A US-led force pushed Iraq out of Kuwait and the George Bush administration encouraged Iraq’s Shiites and Kurds to rise up against Hussein’s regime. Iraq’s southern uprising was crushed, but resistance in the north, followed by the imposition of a no-fly zone by western forces led by a UK initiative, allowed the creation of an autonomous Kurdish zone which became an autonomous republic. This ultimately failed as they got no US support and were routed when the Iraqi army regrouped.\n\nThe Kurdish nationalist struggle had a resurgence in Turkey in the 1980s with the formation of the Kurdistan Workers’ party (PKK). The militant group has waged a guerrilla war against the Turkish state for 35 years. The conflict has killed an estimated 40,000 people and the PKK is classified as a terrorist group by the US, EU and UK, among others.\n\nIn the chaos of the Syrian civil war, Kurdish fighters took control of key cities from the Syrian army, and defended them from Islamic State when the group began to expand after 2014. The US, desperate for a reliable ally in Syria, assisted the Kurdish fight against IS with air strikes and, eventually, money and weapons. Turkey watched the budding alliance with increasing alarm.\n\nAfter last week’s phone call with the Turkish president Recep Tayyip Erdoğan, Trump surprised the world – and many in his own administration – by announcing US troops would stand aside, effectively allowing the Turkish army to enter north-eastern Syria and clear the border areas of the Kurdish fighters that Ankara considers to be terrorists, and who until a few days ago were the US’s staunchest allies in the fight against IS.", "description": "Donald Trump has given the green light for a Turkish invasion of Kurdish territory. He’s not the first US leader to turn his back on this ethnic group", "authors": ["Michael Safi"], "top_image": "https://i.guim.co.uk/img/media/29e64c6aa53996f93c7a7de31a9b3dfa620823ef/0_192_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=1b679c3d3deeb46551f72ae1a9607863", "published_at": "2019-10-13"}