{"pub": "cbc", "url": "https://cbc.ca/sports/tennis/denis-shapovalov-davis-cup-finals-roster-1.5328879", "downloaded_at": "2019-10-22 13:31:31.954580+00:00", "title": "CBC Sports", "language": "en", "text": "Fresh off his first career ATP Tour title, Denis Shapovalov has been named to the Canadian team for the inaugural Davis Cup Finals.\n\nShapovalov, who won the Stockholm Open on Sunday, will be joined by Montreal's Felix Auger-Aliassime, Milos Raonic of Thornhill, Ont., and Vancouver's Vasek Pospisil at the Davis Cup Finals, Nov. 18-24 in Madrid.\n\nCanada is in Group F with Italy and the United States.\n\nThere are six groups in the 18-team event. The group winners and the next two best teams advance to the quarter-finals.\n\n\"I think we've got a very powerful team both in singles and doubles,\" Shapovalov said. \"Any of us can play either event.\n\n\"I'm excited to be teamed with these guys. I think we have a great shot of going deep and potentially finishing as one of the top teams.\"\n\nWATCH | Shapovalov wins 1st ATP title:\n\nRichmond Hill, Ontario's Denis Shapovalov defeats Serbian Filip Krajinovic 6-4, 6-4 in the Stockholm Open final. 1:30\n\nIt marks the first time the Davis Cup champion will be crowned at a neutral site during a week-long event. Previously, the World Group had ties over the course of a year with best-of-five series played at a home venue.\n\nShapovalov, from Richmond Hill, Ont., jumped seven spots to No. 27 in the world rankings this week after capturing the Stockholm Open crown. He won both singles matches over Slovakia in his seventh and most recent Davis Cup appearance earlier this year.\n\nAuger-Aliassime, Canada's top-ranked men's player at No. 18, won the fifth and final match of the tie against Slovakia in his third Davis Cup appearance. The 19-year-old has been in three ATP finals this year.\n\nThe 32nd-ranked Raonic is 18-6 in Davis Cup play.\n\nPospisil, who missed the first half of 2019 after undergoing back surgery, will be making his 20th Davis Cup appearance. He won the Las Vegas Challenger on Sunday to jump 23 spots in the rankings to No. 168.\n\nCanada's best Davis Cup result in the Open era was reaching the World Group semifinals and falling 3-2 to Serbia in 2013.\n\nShapovalov, Auger-Aliassime and Raonic all are entered in this week's Erste Bank Open in Vienna, Austria.", "description": "Denis Shapovalov, who won the Stockholm Open on Sunday for his first ATP title, will be joined by Felix Auger-Aliassime, Milos Raonic and Vasek Pospisil at the Davis Cup Finals, starting Nov. 18 in Madrid.", "authors": ["The Canadian Press"], "top_image": "https://i.cbc.ca/1.5328901.1571673315!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/shapovalov-denis-191020-1180.jpg", "published_at": "2019-10-21"}