{"pub": "businessinsider", "url": "https://businessinsider.com/self-employment-freelancer-disability-insurance-important", "downloaded_at": "2019-10-09 18:55:09.096634+00:00", "title": "When I started working for myself I never thought about disability insurance, but I've come to realize it couldn't be more important", "language": "en", "text": "I started looking into disability insurance after hearing how a family member struggled for income after getting into an accident.\n\nLong-term disability insurance would replace my income for a period of time if I were to be too injured or sick to work.\n\nI wish I'd looked closer at two important clauses: own-occupation (in which the policy pays when you can't do your own job, as opposed to any job) and partial disability, which would pay out if I were only able to work part-time.\n\nPolicygenius can help compare disability insurance policies to find the right coverage for you »\n\nSomething I didn't anticipate looking into when I became a full-time freelance writer was disability insurance. Sure, I knew that getting my financial paperwork in order is important — I took out a life insurance policy, and got my estate planning completed — but it never crossed my mind what would happen if I wasn't able to work before I retired.\n\nWhat really put the nail in the coffin is when I heard that a relative of mine had gotten into a major car accident and it took him months to recover. During that time, he and his family had to scramble for income because he was the sole earner.\n\nAs a breadwinner in my own family, this concerned me because I didn't want to put my husband in a position where he'd have to work extra long hours to pay for our bare necessities. Sure, we have a sizable emergency fund, but what happens if that runs out?\n\nThat was the point when I was more serious about taking out a disability insurance policy. As a freelancer, I wasn't sure what my options were or what I should look for.\n\nDisability insurance protects your income in case you're unable to work\n\nAs someone who is self-employed, I don't have an income if I can't work. Think of disability insurance as a safety net of sorts, one where you can protect your income in case something happens.\n\nThere are two kinds of disability insurance you can look into: short-term and long-term. Short-term will start paying out a portion of your salary for a shorter period of time, like three to six months. Long-term will do so for a longer period of time, like years.\n\nFor freelancers, short-term disability insurance isn't typically available (it's more commonly offered by an employer) and from my own experience, not worth it. That's because I have a sizable emergency fund that will see me for a least a year before I need to be concerned. However, you need to figure out what's best for your situation.\n\nPolicygenius can help compare disability insurance policies to find the right coverage for you »\n\nYou can choose when insurance kicks in, and how long it lasts\n\nFor everyone, you'll need to meet some basic requirements — things like that you're generally in good health or are of a certain age. I'm thankful I don't have pre-existing conditions, because in some cases it may make you ineligible for coverage with certain insurers.\n\nIn addition, I also needed to prove I've been earning steady income from my freelancing. In this case I had to show proof of income for the past two years, so I used my tax returns.\n\nOnce I did that, then I was able to choose the amount I wanted to be paid out per month in case something does happen. My husband and I took a good look at our bare bones expenses and used that number as a benchmark.\n\nThen came choosing the elimination period and the benefit period. The elimination period is how long I would have had to wait after becoming disabled to start receiving benefits. The shorter the period, the more expensive the policy can be — I ended up choosing 90 days since that was an option offered by the group plan I was under.\n\nThe benefit period is how long I wanted to receive benefits. Most are good for a few years and you can choose to be covered all the way until retirement. I opted for five years because again, that was what the group plan offered.\n\nGet clear on exactly what your policy covers\n\nOne of my friends asked me to look into some important clauses in my disability insurance policy. I'm so thankful she did, because it opened my eyes that my income may still be at risk.\n\nFirst, there's the own occupation clause. This is where the insurance company considers you too disabled to work at your current position. Mine is currently at two years, meaning if I'm disabled, those first two years I'm covered if I can't work as a freelance writer.\n\nHowever, after two years it will switch to any occupation, meaning if I can't work as a writer but can work as a barista at Starbucks, for example, then the policy won't pay out anymore. Depending on what you're comfortable with, you can increase the term of the own occupation clause, though your premiums could go up.\n\nAnother benefit I wished I looked more into is the partial disability or residual disability benefit. This means that it you can work but not full-time, you'll still get a payout. For example, let's say you recovered and have the energy to write for three days a week instead of five because of rehab treatments, you'd still receive a monthly check.\n\nIt sounds like a lot to think about on top of all other things you need to juggle as a freelancer, but it's worth it knowing my family would be taken care of during challenging times.", "description": "I didn't anticipate looking into disability insurance when I started freelancing. It never crossed my mind what would happen if I couldn't work.", "authors": ["Sarah Li Cain"], "top_image": "https://image.businessinsider.com/5d9dddd73b33a77e61778004?width=1200&format=jpeg", "published_at": "2019-10-09"}