{"pub": "investing.com", "url": "https://za.investing.com/news/forex-news/forexdollar-firms-as-traders-look-to-trade-talks-fed-for-direction-1964188", "downloaded_at": "2019-10-07 20:43:06.195197+00:00", "title": "FOREX-Dollar firms as traders look to trade talks, Fed for direction", "language": "en", "text": "© Reuters. FOREX-Dollar firms as traders look to trade talks, Fed for direction\n\n* Dollar index up slightly on the day\n\n* Sterling edges lower on Brexit worries (Updates with afternoon trading)\n\nBy Saqib Iqbal Ahmed\n\nNEW YORK, Oct 7 (Reuters) - The dollar edged higher against a basket of currencies on Monday as traders awaited U.S.-China trade talks later in the week for clues to the state of the prolonged trade war between Washington and Beijing, even as chances of a deal appeared low.\n\nInvestors' overall appetite for risk was weak on Monday after a Bloomberg report said that Chinese officials were reluctant to agree to U.S. President Donald Trump's broad trade deal. U.S.-China trade talks are scheduled to resume next Thursday and Friday, when Chinese Vice Premier Liu He meets with U.S. Trade Representative Robert Lighthizer and Treasury Secretary Steven Mnuchin in Washington.\n\n\"The tone of markets overall has softened again today following news that Chinese officials are reluctant to agree to a broad trade agreement with the U.S.,\" Shaun Osborne, chief market strategist, at Scotiabank in Toronto, said in a note.\n\nThe , which measures the greenback against a basket of other currencies, was up 0.17% at 98.979.\n\nThe dollar strengthened against the safe haven Japanese yen after a Fox Business reporter tweeted that the Chinese Commerce Ministry said that China is ready to do a deal with the United States on parts of negotiations both sides agree upon. dollar was last up 0.36% against the yen at 107.32 yen.\n\nStill, lingering concerns over the trade war pressured trade-oriented currencies such as the Australian dollar, which slipped 0.56% against the greenback.\n\n\"A trade agreement between the United States and China still does not seem to be imminent,\" Marc-André Fongern, a strategist at MAF Global Forex in Frankfurt said.\n\nInvestors also awaited the U.S. Federal Open Market Committee's minutes from its September meeting, due on Wednesday, for clues to whether the Fed will cut rates at its October meeting, in what would be its third interest rate cut for the year.\n\n\"(Fed Chair Jerome) Powell and his colleagues might increasingly consider a more aggressive loosening of monetary policy,\" said Fongern.\n\n\"This would only temporarily weaken the dollar, as it looks set to remain in demand as a safe-haven currency,\" he said.\n\nWhile the dollar has been in favor for many months now thanks to its relatively high interest rate and a strong economy, the ongoing trade war with China and a scramble for funding in U.S. money markets have added fuel to the fire in recent weeks.\n\nThe greenback hit a 28-month high against the euro early last week. On Monday, the common currency was up about flat on the day.\n\nSterling slipped against the greenback as investors grew increasingly concerned that Britain and the European Union were no closer to agreeing a Brexit withdrawal deal. The pound was 0.3% lower on the day. Speculators raise dollar positions\n\nhttps://tmsnrt.rs/35bKsA3 Graphic: World FX rates in 2019\n\nhttp://tmsnrt.rs/2egbfVh\n\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^>", "description": "FOREX-Dollar firms as traders look to trade talks, Fed for direction", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEE760YM_L.jpg", "published_at": "2019-10-07"}