{"pub": "thehill", "url": "https://thehill.com/blogs/blog-briefing-room/news/467841-jury-awards-20m-to-missouri-police-officer-who-alleged-he-was", "downloaded_at": "2019-10-29 06:11:02.730109+00:00", "title": "Jury awards $20M to Missouri police officer who alleged he was discriminated against for being gay", "language": "en", "text": "A jury has awarded $20 million to a Missouri police officer who alleged he was discriminated against for being gay.\n\nSt. Louis County Police Sgt. Keith Wildhaber filed a complaint to the U.S. Equal Employment Opportunity Commission and the Missouri Commission on Human Rights after he was told to \"tone down your gayness\" and denied a promotion, CNN reported.\n\nADVERTISEMENT\n\nThe officer was seeking a promotion to lieutenant when a restaurant owner, John Saracino, who sat on the St. Louis County Board of Police Commissioners, told him, \"\n\nThe command staff has a problem with your sexuality.\"\n\n\"If you ever want to see a white shirt [i.e., get a promotion], you should tone down your gayness,\" Saracino told Wildhaber, according to the lawsuit, CNN reported.\n\nSaracino has said the conversation didn’t happen.\n\nWildhaber did not receive the promotion or other promotions because \"he does not conform to the County’s gender-based norms, expectations, and/or preferences,\" CNN reported the lawsuit said.\n\nThe officer filed a second complaint after he was reassigned to a midnight shift about 27 miles from his home.\n\nThe jury’s decision prompted county officials to request the heads of the police department to step down, including County Executive Sam Page.\n\nWildhaber’s attorney Sam Moore told CNN in a statement that he was “ecstatic” about the results.\n\n\"This has been a long and difficult road for Keith,\" Moore said. \"His bravery and courage in standing up for what is right should be an inspiration for employees everywhere.\"\n\nThe Hill reached out to the department and Moore for comment.", "description": "A jury has awarded $20 million to a Missouri police officer who alleged he was discriminated against for being gay.", "authors": [], "top_image": "https://thehill.com/sites/default/files/gavel_istock_0.jpg", "published_at": "2019-10-29"}