{"pub": "vice", "url": "https://news.vice.com/en_us/article/evjmmj/he-was-sentenced-to-only-two-days-in-jail-a-lawsuit-says-three-months-later-he-killed-himself-in-his-cell", "downloaded_at": "2019-10-09 00:23:29.029472+00:00", "title": "He Was Sentenced to Only Two Days in Jail, a Lawsuit Says. Three Months Later, He Killed Himself in His Cell.", "language": "en", "text": "Want the best of VICE News straight to your inbox? Sign up here.\n\nRobert Wayne Johnson was allegedly sentenced to two days in a rural Mississippi jail for not paying a fine. Three months later, still in his cell, Johnson strangled himself with his shoelaces.\n\nNow, his widow, LaToya Johnson, is suing the county, the sheriff’s office, and several correctional officers. She filed a wrongful death lawsuit in a Mississippi federal court on September 30, alleging that he was unlawfully held past his release date, not provided with mental healthcare, and not properly monitored after he became suicidal.\n\nRobert Wayne Johnson, a father of five, was given two days in jail and 199 hours of community service as punishment for not paying money he owed to a Meridian municipal court, according to the suit. In the complaint, LaToya says he wasn’t able to pay the fine because he had lost his job and couldn’t afford it. He was jailed in Kemper Neshoba Regional Correctional Facility, under the Kemper County Sheriff's Office.\n\nREAD: The U.S. isn't counting prison suicides even though the law requires it.\n\nRobert Wayne made another suicide attempt while jailed before his death, the complaint says. LaToya alleges that the jail ignored her husband’s mental health issues and other inmates’ repeated warnings that he had been tying shoelaces around his neck in the days leading up to his death on Jan. 9, 2018. In the hours before he died, he slit his wrists as well, the suit says.\n\nThe complaint says that Johnson was transferred to an unmonitored segregation cell with all of his belongings, including the shoelaces, after a “scuffle” with another inmate over Johnson being upset his fellow inmates had alerted a guard to his suicide attempt. Johnson killed himself approximately 14 minutes after being placed in isolation.\n\nThe lawsuit also alleges that Johnson was unlawfully held beyond his release date, and accuses the jail of failing to properly monitor inmates’ release dates. According to the suit, when Johnson wasn’t released after two days he began to panic because he didn’t know why he was still in jail, and worried that he had been mistakenly sentenced on a felony charge.\n\nThe Kemper County Sheriff’s Office did not immediately respond to a VICE News request for comment.\n\n“Not only did I lose my husband and best friend, but his children lost their father, his parents lost a son, and his siblings lost a brother. So many others lost a good friend in him,” Johnson said in a news release after the complaint was filed.\n\nMississippi has faced scrutiny over its record on mental healthcare. Earlier this year, a federal judge called for increased oversight of Mississippi’s treatment of people with mental illness. A 2011 Justice Department investigation also found the state was “unnecessarily institutionalizing persons with mental illness.” Sheriffs in the state have also long said that they’re overburdened with mentally ill inmates who require extensive care, according to the Jackson Clarion-Ledger.\n\nMississippi, which has a high poverty rate but has not yet expanded Medicaid to increase health care services for the poor, also ranks among the states that offer worst access to mental health services, according to Mental Health Care America.\n\nCover: In this July 22, 2015 photo, The Waller County jail cell where Sandra Bland was found dead is seen in Hempstead, Texas. (AP Photo/Pat Sullivan, file)", "description": "Robert Wayne Johnson's wife is suing a Mississippi county, saying he was held past his release date and not provided with mental healthcare.", "authors": [], "top_image": "https://video-images.vice.com/articles/5d9cab985050a6000a26294c/lede/1570550849585-JailHouseSuicide.jpeg?crop=1xw:0.8328xh;0xw,0.1672xh&resize=1200:*", "published_at": "2019-10-08"}