{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-usa-trump-whistleblower/second-whistleblower-in-trump-ukraine-scandal-comes-forward-lawyer-idUKKCN1WL09H", "downloaded_at": "2019-10-06 13:13:07.848040+00:00", "title": "Second whistleblower in Trump-Ukraine scandal comes forward - lawyer", "language": "en", "text": "WASHINGTON (Reuters) - A second whistleblower, with first-hand knowledge of President Donald Trump’s dealings with Ukraine, has spoken with the intelligence community’s internal watchdog, the lawyer representing the official said on Sunday.\n\nMark Zaid confirmed in an interview with ABC’s “This Week” that the second official, also from the U.S. intelligence community, has been interviewed by the inspector general. Zaid represents the first whistleblower who filed a complaint involving a July 25 phone call Trump held with Ukraine’s president in which he asked him to investigate a Democratic rival, former Vice President Joe Biden.\n\nThe existence of the second whistleblower followed stirrings of discontent within Trump’s own Republican Party after he called on China on Friday to investigate Biden’s son, who had business dealings in China.\n\nRepublican U.S. Senators Mitt Romney, Ben Sasse and Susan Collins all have expressed concerns about Trump reaching out to foreign countries to help him in his 2020 re-election bid.\n\nThe telephone call and the whistleblower complaint prompted House of Representatives Speaker Nancy Pelosi to launch impeachment proceedings on Sept. 24 against Trump, saying his actions jeopardized U.S. election integrity and threatened national security.", "description": "A second whistleblower, with first-hand knowledge of President Donald Trump's dealings with Ukraine, has spoken with the intelligence community's internal watchdog, the lawyer representing the official said on Sunday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-06"}