{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/ufc-243-melbourne-robert-whittaker-israel-adesanya-play-by-play-live-results", "downloaded_at": "2019-10-06 00:20:39.342032+00:00", "title": "UFC 243 play-by-play and live results", "language": "en", "text": "MELBOURNE, Australia – MMA Junkie is on scene and reporting live from Saturday’s UFC 243 event, and you can join us for live play-by-play and official results beginning at 6:45 p.m. ET (3:45 p.m. PT).\n\nThe event takes place at Marvel Stadium in Melbourne, Australia. The main card airs on pay-per-view following prelims on ESPN2 and UFC Fight Pass/ESPN+.\n\nIn the main event, middleweight champion Robert Whittaker (20-4 MMA, 11-2 UFC) takes on interim champ Israel Adesanya (17-0 MMA, 6-0 UFC) in a title unification fight. In the co-feature, Dan Hooker (18-8 MMA, 8-4 UFC) Al Iaquinta (14-5-1 MMA, 9-4 UFC) at lightweight.\n\nFollow along with our round-by-round updates and official results beginning at approximately 6:45 p.m. ET for the UFC Fight Pass/ESPN+ prelims, 8 p.m. ET for the prelims on ESPN2, and 10 p.m. ET for the main card on pay-per-view.\n\nTo discuss the show, be sure to check out our UFC 243 discussion thread. You can also get behind-the-scenes coverage and other event notes from on-site reporters John Morgan (@MMAjunkieJohn) and Ken Hathaway (@kenshathaway) on Twitter.\n\nEnjoy the fights, everyone.\n\n* * * *\n\nCurrent fight\n\nMegan Anderson vs. Zarah Fairn\n\nRound 1 – Quick start for Fairn, as she rushes forward to strike. Anderson a bit overwhelmed to open but grabs the clinch to slow things down. She tries to slip around to the back. Fairn punches as she defends, but Anderson stays firm in the position and trips the action to the canvas. She’s not quite on the back, so she steps over with the left leg, and she’s now in mount. Anderson controlling the head with her left arm. Legs are grapevined. Short right hands for Anderson. She’s heavy on top. Fairn wraps the body, but Anderson postures once she lets go and delivers a few punches. Fairn turns briefly to her side, but Anderson presses her flat again. More punches and elbows land from the top. Anderson not doing a ton of damage, but she’s certainly in control. Fairn turns to escape. Anderson tries to take the back but winds up falling over. Still, she’s got the triangle in place. Nice transition. Patient work on the bottom, cinching it up and turning to the side. Squeeze is there, and Fairn has to tap.\n\nResult:\n\nRecap:\n\nPhotos:\n\nRecords: Megan Anderson (8-4 MMA, 1-2 UFC), Zarah Fairn (6-2 MMA, 0-0 UFC)\n\nDivision: Women’s featherweight\n\nBroadcast: ESPN2\n\nReferee: Greg Klenjans\n\nJudging:\n\nResults\n\nBruno Silva vs. Khalid Taha\n\nRound 1 – Silva switches stances early as they set up in the center. Taha kicks at the legs. Silva very mobile to start. They both fire off big shots, but a Taha left hand lands clean and sends Silva to the floor. He pops right back to the feet, and they work briefly in the clinch before moving back to the center. Silva’s right eye already showing the damage from Taha’s power. Kicks traded to the body. Punches traded, as well. Silva with a nice kick to the body. He lands an overhand right, as well. Taha misses on a kick, but he follows with a clean right hand that scores. Silva kicks to the body, but it lands to the cup, and we get a brief pause. Silva whiffs on a big kick on the restart. He misses on a takedown, as well. Still, Silva pushes forward and is able to wrap the body. Silva with a knee in the clinch, and it lands directly to the groin again. Taha grimaces and falls to the floor. Taha takes a moment, but we carry on. Taha runs out on the restart, but Silva slips away. Big punches traded. Silva wraps the body, and we finish in the clinch. MMA Junkie gives the first to Taha, 10-9.\n\nRound 2 – Silva out quickly and looking to strike. Taha right sends the action to the canvas, and then he just misses what would have been an illegal kick to the head of a seated opponent. Silva pops back up, and he’s retreating as Taha looks to attack. Silva survives the storm, and he changes levels, working hard to bring the fight to the floor. Taha gets to guard. Silva postures and punches hard to the body. Taha just misses an upkick. A second does land. Taha trying to scramble, but Silva adjusts and stays on top. Half-guard for Taha. Silva wants to strike, but he’s focused on keeping his position, as well. Taha back to full guard. Short punches and elbows landing from the top. Silva postures again, but Taha answers with dangerous upkicks. Less than a minute, and Taha turns to his knees. Silva controls the head. Choke isn’t there, but he’s keeping the action on the canvas. Silva steps over the right leg and tries to slip to the back. Taha turns to defend, and the round ends there. MMA Junkie gives it to Silva, 10-9.\n\nRound 3 – Silva misses a big spinning kick to open. Taha kicks to the leg, but Silva grabs it and instantly takes the fight to the floor. Taha knows he can’t stay there and alertly gets immediately back to his feet. Silva with the underhook on the left side and pressing the action to the cage. Silva working hard for the takedown. Taha counters by grabbing the neck and then snaps the action down to the canvas, but Silva works almost immediately back to his feet. He wants a takedown, but it’s not there. Silva slips away, but he looks exhausted. He shoots from range, but Taha sprawls well and starts punching the head. He slips around to the back and wants the choke. Not there, but he traps the arm and spins. Arm triangle is there. Taha slips off to the side and starts the squeeze. It’s there, and Silva has to tap.\n\nResult: Khalid Taha def. Bruno Silva via submission (arm-triangle choke) – Round 3, 3:00\n\nPhotos: Khalid Taha vs. Bruno Silva photos\n\nRecords: Bruno Silva (11-4-1 MMA, 0-1 UFC), Khalid Taha (14-2 MMA, 2-1 UFC)\n\nDivision: Bantamweight\n\nBroadcast: UFC Fight Pass/ESPN+\n\nReferee: Greg Klenjans\n\nNadia Kassem vs. Ji Yeon Kim\n\nRound 1 – Kassem rushes forward looking to strike, but she walks into a straight punch and hits the deck. She pops back up, but Kim fires more punches. Kassem in trouble early. She has to scamper away and reset. She moves back in to engage and gets to the clinch, where she’s able to toss the action to the canvas. Slick move there, and she takes top position and lans a few big pinches. Kim tries to control the wrists, and Kassem backs away. Kim scrambles up, as well, and we start trading on the feet. Kim the more accurate striker, and she’s landing clean. Kassem already looks a little tired halfway into the first. Still, she’s game to scrap. Kim controlling the center. She’s measured in her approach, and she’s accurate when she strike. Kassem moving well on the outside, but she’s struggling to really get a rhythm. She grabs a Thai clinch, but she can’t control the action there. Round ends on the feet, and MMA Junkie gives to Kim, 10-9.\n\nRound 2 – Kassem kicks the leg, but Kim with a perfect counter over the top. Kim walking forward, and Kassem looking to retreat and counter. She lands a nice kick to the body, but Kim returns fire with rapid punches over the top. Kassem kicking to all levels, but Kim unaffected and continues to punch. She’s stalking from the center. Jab lands clean. Right hand scores. Kassem lands a kick to the body and takes. deep breath. She is findign success with the kicks, but the punches are a problem. Kim starts to flurry, and time is called during the middle to replace Kassem’s mouthpiece. Questionable decision there. On the restart, Kim begins again. Kassem trying to swing back, but she’s outgunned. Kassem slips away and tries to reset. She’s using the kicks to keep space, but Kim pushing through and looking to finish this fight. Punches continues to land clean. Big left scores. Kassem covering on the fence in the final minute. Kim looking to end it. Blood pouring from the nose. Body shot lands clean and drops Kassem just before the bell, and this fight is over just before the bell.\n\nResult: Ji Yeon Kim def. Nadia Kassem via TKO (punches) – Round 2, 4:59\n\nPhotos:\n\nRecords: Nadia Kassem (5-2 MMA, 1-2 UFC), Ji Yeon Kim (9-2-2 MMA, 3-2 UFC)\n\nDivision: Women’s flyweight\n\nBroadcast: UFC Fight Pass/ESPN+\n\nReferee: Jim Perdios\n\nJamie Mullarkey vs. Brad Riddell\n\nRound 1 –\n\nResult:\n\nRecap:\n\nPhotos:\n\nRecords: Jamie Mullarkey (12-2 MMA, 0-0 UFC), Brad Riddell (6-1 MMA, 0-0 UFC)\n\nDivision: Lightweight\n\nBroadcast: ESPN2\n\nReferee:\n\nJudging:\n\nMaki Pitolo vs. Callan Potter\n\nRound 1 –\n\nResult:\n\nRecap:\n\nPhotos:\n\nRecords: Maki Pitolo (12-4 MMA, 0-0 UFC), Callan Potter (17-8 MMA, 0-1 UFC)\n\nDivision: Welterweight\n\nBroadcast: ESPN2\n\nReferee:\n\nJudging:\n\nRostem Akman vs. Jake Matthews\n\nRound 1 –\n\nResult:\n\nRecap:\n\nPhotos:\n\nRecords: Rostem Akman (6-1 MMA, 0-1 UFC), Jake Matthews (14-4 MMA, 7-4 UFC)\n\nDivision: Welterweight\n\nBroadcast: ESPN2\n\nReferee:\n\nJudging:\n\nYorgan De Castro vs. Justin Tafa\n\nRound 1 –\n\nResult:\n\nRecap:\n\nPhotos:\n\nRecords: Yorgan De Castro (5-0 MMA, 0-0 UFC), Justin Tafa (3-0 MMA, 0-0 UFC)\n\nDivision: Heavyweight\n\nBroadcast: Pay-per-view\n\nReferee:\n\nJudging:\n\nLuke Jumeau vs. Dhiego Lima\n\nRound 1 –\n\nResult:\n\nRecap:\n\nPhotos:\n\nRecords: Luke Jumeau (13-4 MMA, 2-1 UFC), Dhiego Lima (14-7 MMA, 3-5 UFC)\n\nDivision: Welterweight\n\nBroadcast: Pay-per-view\n\nReferee:\n\nJudging:\n\nSergey Spivak vs. Tai Tuivasa\n\nRound 1 –\n\nResult:\n\nRecap:\n\nPhotos:\n\nRecords: Sergey Spivak (9-1 MMA, 0-1 UFC), Tai Tuivasa (10-2 MMA, 3-2 UFC)\n\nDivision: Heavyweight\n\nBroadcast: Pay-per-view\n\nReferee:\n\nJudging:\n\nDan Hooker vs. Al Iaquinta\n\nRound 1 –\n\nResult:\n\nRecap:\n\nPhotos:\n\nRecords: Dan Hooker (18-8 MMA, 8-4 UFC), Al Iaquinta (14-5-1 MMA, 9-4 UFC)\n\nDivision: Lightweight\n\nRankings: Iaquinta No. 6, Hooker No. 14\n\nBroadcast: Pay-per-view\n\nReferee:\n\nJudging:\n\nRobert Whittaker vs. Israel Adesanya\n\nRound 1 –\n\nResult:\n\nRecap:\n\nPhotos:\n\nRecords: Robert Whittaker (20-4 MMA, 11-2 UFC), Israel Adesanya (17-0 MMA, 6-0 UFC)\n\nDivision: Middleweight\n\nRankings: Whittaker No. 1, No. 9 pound-for-pound; Adesanya No. 2, No. 11 pound-for-pound\n\nBroadcast: Pay-per-view\n\nReferee:\n\nJudging:", "description": "Check out live play-by-play and official results from UFC 243 in Melbourne, Australia.", "authors": ["John Morgan", "Mmajunkie Staff", "Mma Junkie Staff", "Mike Bohn", "Sportsbook Wire", "Dave Doyle", "Blue Corner", "Farah Hannoun"], "top_image": "https://usatmmajunkie.files.wordpress.com/2019/10/robert-whittaker-israel-adesanya-ufc-243-official-weigh-ins.jpg?w=1000&h=576&crop=1", "published_at": "2019-10-05"}