{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7612831/Students-St-Kevins-College-Melbourne-recorded-rap-song-girls-sister-college.html", "downloaded_at": "2019-10-26 00:13:45.857536+00:00", "title": "Students at St Kevin's College in Melbourne 'recorded rap song about girls at sister college'", "language": "en", "text": "Students at an elite Melbourne boys school have allegedly recorded a misogynistic rap targeting girls at a sister college and published it online.\n\nLyrics in the rap sung by students allegedly from Toorak's $19,000-a-year St Kevin's College include the line 'F*** Sacre Coeur, bunch of fake b****es' - in reference to a girls school in nearby Glen Iris.\n\nThe students involved have reportedly been suspended but a school source has claimed they were not made to apologise.\n\nThe source told news.com.au, who obtained footage of the rap being played on a phone, the students who sang it were specifically targeting girls at the sister college.\n\nSaying the rap was one of the 'most disgusting things (they) ever heard', the source also claimed the girls referenced were pressured by other students from St Kevin's not to speak out.\n\nOther x-rated lyrics allegedly included the rapper saying 'that's me, only 17 ... been f***ing your b***h since 13'.\n\nA spokesman for the school said they would not comment on student matters.\n\nIt comes after students from the same school sang a cricket chant while on their way to an athletics tournament last Saturday.\n\nDressed in their school's striped blazers, they chanted: 'I wish that all the ladies, were holes in the road... And if I was a dump truck, I'd fill them with my load.'\n\nStudents at an elite Melbourne boys school have allegedly recorded a misogynistic rap targeting girls at a sister college and published it online (recording of the rap on a phone pictured)\n\nThe video was shared by a frightened passenger who described the chant as 'disgusting' and said she was too afraid to confront the boys.\n\nA second video is also believed to show Year 12 students from St Kevin's chanting the same song during a pub crawl on Monday.\n\nFormer pupil Luka Kiernan, who graduated last year, told the ABC the video reflected the 'hyper-masculine, totally misogynistic culture that really pervades all levels at St Kevin's'.\n\nFormer pupil Luka Kiernan, who told the ABC another video of students on a tram singing a sexist chant reflected the 'hyper-masculine, totally misogynistic culture' at St Kevin's, has had his photo at the Toorak college vandalised (pictured) by other students\n\nDressed in their school's striped blazers, students on the tram chanted (pictured): 'I wish that all the ladies, were holes in the road... And if I was a dump truck, I'd fill them with my load.'\n\nMr Kiernan has since had his photo at the Toorak college vandalised by other students with the word 'traitor' and 'snitch scrawled across his profile.\n\nHe told 7NEWS.com.au the graffiti showed those involved were 'quick to rally against anyone who goes against them'.\n\nHeadmaster Stephen F. Russell first apologised for the students 'offensive' actions on the tram in a statement.\n\n'Students upset by the behaviour have already come to me and we have been following through in both a disciplinary and pastoral manner today,' he said.\n\nMr Kiernan (pictured) said the graffiti showed those involved were 'quick to rally against anyone who goes against them'.\n\n'We have always and will continue to challenge such poor behaviour and misogynistic attitudes through programs at school and with the co-operation of parents.'\n\nHe has now said in a newsletter to parents 'the use of misogynistic language such as in the chant on Saturday, is more widespread than we understood'.\n\n'This knowledge has intensified our determination to resolutely reshape our programs.'\n\nDaily Mail Australia has contacted St Kevin's College for comment.", "description": "Lyrics in the rap sung by students allegedly from Toorak's $19,000-a-year St Kevin's College include the line 'F*** Sacre Coeur, bunch of fake b****es' - in reference to a girls school in Glen Iris.", "authors": ["Charlie Coë For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/11/20174298-0-image-a-7_1571997959409.jpg", "published_at": "2019-10-25"}