{"pub": "thestreet", "url": "https://realmoney.thestreet.com/investing/alphabet-s-decline-has-done-some-damage-to-its-charts-get-defensive-15112981", "downloaded_at": "2019-10-03 07:18:18.115538+00:00", "published_at": "2019-10-02", "title": "Alphabet's Decline Has Done Some Damage to Its Charts - Get Defensive", "language": "en", "text": "The charts of Alphabet ( GOOGL ) have turned weak and longs may need to adjust their positions.\n\nIn this daily bar chart of GOOGL, below, we can see that prices moved lower Tuesday and closed weak. Today prices gapped below the cresting 50-day moving average line and could also close weak.\n\nThe On-Balance-Volume (OBV) line is pointed and close to making a two-month low, and signals that sellers of GOOGL have been more aggressive.\n\nThe Moving Average Convergence Divergence (MACD) oscillator is pointed down and close to the zero line and an outright sell signal.\n\nIn this weekly bar chart of GOOGL, below, we can see a possible triple top formation. Prices would need to go below $1,000 to complete the top pattern so we have a long way to go.\n\nPrices could soon test the rising 40-week moving average line.\n\nThe weekly OBV line is bearish and the MACD oscillator is narrowing towards another take profits sell signal.\n\nIn this Point and Figure chart of GOOGL, below, we can see that the software has projected a possible downside price target of $1,111.\n\nBottom line strategy: GOOGL has turned lower with the indicators suggesting further declines. The decline in GOOGL in May was brutal and this decline may not be pleasant either.", "description": "Let's check out the recent price action....GOOGL", "authors": ["Bruce Kamich", "Alphabet'S Decline Has Done Some Damage To Its Charts - Get Defensive", "Let'S Check Out The Recent Price Action.", "Stocks Quotes In This Article", "James", "Rev Shark", "Jim Cramer", "Bob Lang", "Paul Price", "Doug Kass"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/44f5e4a9-9f56-11e9-9fed-0d79de0869ec.png"}