{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7595805/Self-driving-SCOOTERS-drive-charging-points-busy-areas.html", "downloaded_at": "2019-10-21 10:31:33.045665+00:00", "title": "Self-driving SCOOTERS will drive themselves back to charging points and busy areas", "language": "en", "text": "Self-driving scooters could soon be whizzing around without riders in a tech development designed to improve cities' transport-sharing networks.\n\nA California-based start-up, Tortoise, is working on self-driving technology with which bikes and scooters drive themselves home after someone has used them.\n\nAnd taxi-hailing app Uber announced earlier in the year that it was working towards the same goal.\n\nSet to launch next month, the initiative is a progression for the temporary bike, scooter and Segway hire schemes which already exist around the world.\n\nIt could mean fewer of the bikes and scooters are left lying around in obscure places and that they all return to charging stations or busy areas when not in use.\n\nThe self-driving scooter technology would drive it back to a charging point or a transport hub if someone has left it somewhere it's not likely to be needed\n\nCalifornia-based startup, Tortoise, is working on the technology and said the scooters would drive themselves on uncomplicated routes where there aren't too many people\n\nTortoise's scheme would help to keep the arrangements running smoothly and avoid the bikes and scooters ending up scattered around the city.\n\nIf able to drive themselves back to docking stations it would be easier for the operators to recharge, replace and retrieve the gadgets, CityLab reported.\n\nAlthough the technology isn't in use yet, video has surfaced online of a scooter driving itself with the help of stabiliser wheels.\n\nAnd the company is hoping to put its tech into use in the city of Peachtree Corners, Georgia, to see if it can ease congestion at lunchtimes.\n\nIt plans to roll out the technology there in November, as well as in two as-yet-unnamed cities in Europe.\n\nTortoise said its technology would try to travel on simple routes where there aren't many people.\n\nIf the scooter fell over – like the technology's namesake – it wouldn't be able to get back up on its own and would need an employee to go and pick it up.\n\nAnother tele-operated scooter demo, this time from startup @TortoiseHQ\n\n\n\nRetrofitted onto existing scooter, powered by a @Raspberry_Pi, camera and microcontroller.\n\n\n\nThey will offer the service for a fixed price per month to save on operations cost and prevent urban clutter.#MME pic.twitter.com/b4ULsvkG73 — Edward Miller (@TweetEdMiller) October 1, 2019\n\nTortoise said last month that it was aiming to put the technology into Peachtree Corners, Georgia, to begin with\n\nA spokesperson told CityLab: 'The system would automatically ping the operator letting them know human intervention is required.\n\n'Because we’ll be optimizing for smooth routes with not a lot of foot traffic (when possible) the hope is that this isn’t as huge of an issue as it currently is with scooters.'\n\nThe benefit of having the scooters drive themselves would be the ability of them to return to places where they will be useful.\n\nFor example, if someone used one to get home from the city centre and left it near their house further out of town, it could return itself to a train station or busy area where people might be more likely to use it.\n\nA risk, however, is that the technology is expensive and therefore a target for thieves.\n\nA robo-scooter in development by Segway will be worth more than $1,000 (£769).\n\nUber revealed in January this year that it was developing self-driving bikes and scooters which could return themselves to charging stations.\n\nUber said it hoped it could avoid the problem of dumped scooters and bikes that have plagued current services.\n\nIt remained tight-lipped on the project, but said it would bring 'sensing and robotics technologies' to shared bikes and scooters.\n\n'The New Mobilities team at Uber is exploring ways to improve safety, rider experience, and operational efficiency of our shared electric scooters and bicycles through the application of sensing and robotics technologies,' it said at the time.", "description": "California-based start-up, Tortoise, is developing technology which could drive public hire scooters and bikes back to places they're needed after people have used them and scattered them about.", "authors": ["Sam Blanchard For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/11/19984952-0-image-a-2_1571652096113.jpg", "published_at": "2019-10-21"}