{"pub": "townhall", "url": "https://townhall.com/columnists/paulcurry/2019/09/22/the-lefts-impeachment-frenzy-is-a-win-for-the-president-n2553465", "downloaded_at": "2019-09-22 23:11:27.937663+00:00", "title": "The Left’s Impeachment Frenzy is a Win for the President", "language": "en", "text": "Democrats really need to stop with their impeachment hysteria. Not liking someone is not a sufficient reason to overturn an American election. Disagreeing with someone’s interpretation of the extent of Constitutional authority is not a sufficient basis for negating a Supreme Court confirmation. Yet this is precisely what the left is doing today, and they are destined to fail. Although such a failure would be greatly welcomed, televised, and a tremendous boon to President Trump, it will also have lasting, detrimental, consequences for the republic.\n\nIt’s been nearly three years since Donald Trump was elected President, and for the duration of that time, Democrats have been all but chanting their favorite word, ‘impeachment’. In fact, the call for nullifying the election began even before Trump took office. It’s now been one year since Brett Kavanaugh was confirmed to the Supreme Court. Since that time, a wide chorus of the left has been shrieking for his impeachment. ‘Impeachment’ is not a punctuation mark; it doesn’t belong in every sentence.\n\nDebunked conspiracy theories and failed smear campaigns have fueled each of these calls for extreme Congressional action. The soaring economy and record low unemployment, coming at a time when the Democratic clown car of a primary is making an extreme left turn off of a cliff, have only emboldened Democrat’s efforts for impeachment. Impeachment has become the left’s cheap substitute for winning elections. A childish tantrum is thrown when things do not go their way.\n\nStated reasons for impeaching the President have included the laughable Russia collusion hoax, despite the Mueller Report finding that such collusion did not exist, to obstruction of justice, which Mueller himself stated did not occur, as he was allowed to complete his investigation unimpeded. Some of the hysterical calls for impeachment even cite, without any basis, abuse of power. Abuse of power? Like, say, using Congressional impeachment power to overturn a fair election and out of fear of losing another one? It was Texas Democrat Al Green who recently stated, “I'm concerned that if we don't impeach the president, he will get re-elected”. That is an abuse of power. Still, buckling under pressure from radical elements, and terrified of an impending primary challenge, House Judiciary Committee Chairman Jerry Nadler has charged forth his impeachment inquiry.\n\nLast week, a much-maligned, New York Times article rekindled last year’s failed attempt to thwart Brett Kavanaugh’s nomination to the Supreme Court. The Times article, based on a new book about Kavanaugh, quotes Max Stier, a former attorney for Bill Clinton during his impeachment, claiming to have witnessed Kavanaugh acting inappropriately towards a woman at a 1983 drunken dorm party at Yale. Of course, the article omitted any mention of Stier’s past association with the Clinton defense team, the fact that the woman supposedly involved made no corroborating statement, and her friends’ claims that she has no memory of anything happening. The article also failed to question why Stier neglected to bring this up when he was defending Bill Clinton, for nearly the exact same thing, and Kavanaugh was an attorney for Ken Starr. Still, that was enough to get the left’s impeachment ire up. After all, Nadler has been for impeaching Kavanaugh since January.\n\nSenators Amy Klobuchar and Kamala Harris immediately came out to sing songs of a Kavanaugh impeachment. Klobuchar called last year’s Senate confirmation process a sham. Which part was a sham? Was it when Senators Harris, Feinstein, and Klobuchar chose to sit on Christine Blasey Ford’s allegations for two months? Was it when the Democrats patiently waited until the 59thminute of the 11thhour, when the hearings were complete, to even bring up Ms. Ford’s allegations? They sat on it because the circus was not about Ms. Ford and was not about Justice Kavanaugh. It was about a conservative replacing a more moderate on the Court. It was about their failure to capture the White House and the Senate. It was another tantrum, like crying Russia collusion, obstruction of justice, and abuse of power, where none exists. It was about the failure to win elections.\n\nYou can choose to believe the Russia hoax. You can choose to believe the Kavanaugh smears. You can ignore the Mueller Report, the gaping holes in Christine Ford’s testimony, and the manipulations of Democrats in Congress through all of the past three years. What you cannot do is simply impeach anyone who disagrees with you whenever an election does not go your way. If you want to remove Trump from office, there is a perfect and prescribed manner of doing so, it comes next year on November 3rd.\n\nEvery single President since Ronald Reagan has served with a House of Representatives controlled by the opposing party, as has every current Supreme Court justice. Common sense dictates that this will continue for every future President and justice. If every one of them can reasonably anticipate impeachment by the party that loses, then the presidency will cease to exist, the Supreme Court will cease to exist, and this country will cease to exist.\n\nThere is, however, some comforting news should the Democrats continue on with their impeachment frenzy. They will ultimately be unsuccessful. Be it by failing to achieve impeachment in the House, or failing to secure a conviction in the Senate, attempts to remove either President Trump or Justice Kavanaugh will fail. The bright side is that it will be a tremendous boost for Trump’s 2020 re-election when Ruth Bader Ginsburg will be 87, and Stephen Breyer 82.", "description": "Democrats really need to stop with their impeachment hysteria. Not .09/22/2019 19:07:03PM EST.", "authors": ["Paul Curry", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/205/fabe474d-d19a-4454-8791-b6e1a4c6a0d1.png", "published_at": "2019-09-22"}