{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/mcdonalds-stock-price-slides-as-q3-earnings-sales-fall-short-2019-10-1028619973", "downloaded_at": "2019-10-22 15:37:08.375518+00:00", "title": "McDonald's slides as weak US growth leads to earnings miss (MCD)", "language": "en", "text": "Justin Sullivan/Getty Images\n\nShares of McDonald's dipped as much as 4% on Tuesday after the the fast-food chain reported third-quarter sales and profit that fell below Wall Street estimates.\n\nThe company posted $1.61 billion in profit for the quarter, falling below analysts forecasts of $1.69 billion as sales in the US slumped.\n\nUS same-store sales growth slowed to 4.8% during the period, down from an increase of 5.7% in the second quarter.\n\nWatch McDonald's trade live.\n\nMcDonald's shares traded as much as 3.3% lower on Tuesday after the company posted third-quarter profit and revenue that fell short of analyst estimates.\n\nHere are the key numbers from the company's earnings report:\n\nRevenue: $5.43 billion, compared to $5.48 billion expected by analysts\n\n$5.43 billion, compared to $5.48 billion expected by analysts Earnings per share: $2.11, versus $2.21 estimated by analysts\n\n$2.11, versus $2.21 estimated by analysts Net income: $1.61 billion, versus $1.69 billion forecasted by analysts\n\nThe fast-food chain also reported global same-store sales growth of 5.9%, outpacing expectations of 5.7%, according to Bloomberg.\n\nWhile international sales rose, McDonalds struggled to grow its business in the US. Domestic same-store sales climbed 4.8%, slowing significantly from last quarter's 5.7% growth.\n\nThe company said national and local promotions as well as price increases for some menu items fueled the growth in US same-store sales.\n\n\"Results for the quarter and nine months in constant currencies reflected stronger operating performance primarily due to an increase in sales-driven franchised margin dollars, partly offset by lower gains on sales of restaurant businesses, mostly in the U.S.,\" the company said in its earnings report.\n\nMcDonald's returned $2.4 billion to shareholders during the period through stock buybacks and dividends. The company also approved an 8% hike in its quarterly dividend to $1.25 per share starting in the third quarter of 2019.\n\nThe fast-food space has been shaken-up in recent months with the explosion in popularity of plant-based meat alternatives from companies like Beyond Meat and Impossible Foods.\n\nBurger King — one of McDonald's biggest competitors — has seen success with its US rollout of the plant-based Impossible Whopper this year. McDonald's said in September that it plans to team up with Beyond Meat to test a veggie burger at select locations.\n\nShares of McDonald's are up 14% year-to-date.\n\nRead more: 'A license to print money': A former chemical engineer and Ph.D. with no market experience now makes a living day-trading full-time. Here's his 3-step process to finding that one successful trade that makes his day.\n\nMarkets Insider", "description": "Shares of McDonald's dipped as much as 4% on Tuesday after the the fast-food chain reported third-quarter sales and profit that fell below Wall Street est...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5daf10c9cc4a0a5d653a4157-1308/screen-shot-2018-08-10-at-115941-am.png", "published_at": "2019-10-10"}