{"pub": "huffpost", "url": "https://huffpost.com/entry/jason-momoa-united-nations-climate-change_n_5d8f640be4b0019647a9505f", "downloaded_at": "2019-09-28 21:25:30.499457+00:00", "title": "Jason Momoa Delivers Searing Speech On Climate Change At UN Headquarters", "language": "en", "text": "Jason Momoa made an impassioned plea to the United Nations on Friday on behalf of the island nations of the world that are “drowning” due to the effects of climate change.\n\nThe Hawaii-born “Aquaman” star, who is of Native Hawaiian descent, joined world leaders at the U.N. General Assembly to review the progress made by the SAMOA Pathway, a U.N. program adopted in 2014 that aims to address the unique environmental concerns impacting small island developing states.\n\nMomoa called the experience “life-changing” in an Instagram post Friday.\n\n“It takes an amazing team and support system to pull off something like this,” he wrote. “I am deeply grateful to my wife and children, my mother.”\n\nIn his speech, Momoa talked about the impacts of ocean plastic pollution and rising sea levels.\n\n“Island nations contribute the least to this disaster, but are made to suffer the weight of its consequences,” he said. “Our governments and corporate entities have known for decades that immediate change is needed. Yet change still has not come.”\n\nMomoa shared a video of his entire speech on Instagram, which he described as, “No BS. Nothing sugar coated, just straight from the heart.”\n\nMomoa charged that humans are the “only species willing to force disharmony with the natural balance of our world.”\n\n“We are the living consequence of forgotten traditions,” he added.\n\nMomoa has been outspoken about the effects of climate change and ocean pollution on numerous occasions.\n\nLast month, he used his social media platform to help spread awareness about the fires across the Amazon rainforest to his roughly 13 million Instagram followers.\n\nBrazil’s National Institute for Space Research reported that the Amazon wildfires showed an 84% increase over the same period last year.\n\nWatch a video clip of his entire speech at the U.N. below:", "description": "The \"Aquaman\" star spoke \"straight from the heart\" on behalf of small island nations under threat from rising sea levels.", "authors": ["Trends Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d8f66582400005e00d3b9fe.jpeg?cache=prqmnat0cj&ops=1778_1000", "published_at": "2019-09-28"}