{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/inyoung-you-michelle-carter-suicide-manslaughter-charges-gender-bias-2019-10", "downloaded_at": "2019-10-30 23:21:40.927243+00:00", "title": "2 women have been criminally charged over their partners' suicides. Why do men escape the same blame?", "language": "en", "text": "A Massachusetts grand jury indicted 21-year-old Inyoung You this week on involuntary manslaughter in connection with her boyfriend's suicide.\n\nThe case bore striking similarities to the landmark 2017 conviction of Michelle Carter, who was deemed criminally culpable in the 2014 suicide of Conrad Roy.\n\nBoth women were accused of sending a deluge of abusive text messages to their partners, urging the men to kill themselves.\n\nExperts said it's noteworthy that both cases have involved female defendants — and could indicate a possible gender bias within the criminal justice system.\n\nThe vast majority of domestic violence cases are brought against men, and therefore \"one would assume when it comes to threats and harassment,\" men are also the most likely perpetrators, one expert told Insider.\n\nBut charging anyone with involuntary manslaughter over a suicide — regardless of gender —is rife with legal and logistical complications, the experts said.\n\nSuicides are complex, nuanced, and rarely caused by one single cause or person, a suicide expert told Insider.\n\nVisit Insider's homepage for more stories.\n\nFor the second time in recent years, authorities in Massachusetts have pressed involuntary manslaughter charges against a woman over the suicide of her partner.\n\nOn Monday, Suffolk County prosecutors announced that a grand jury indicted 21-year-old Inyoung You in connection with the suicide of her boyfriend, Alexander Urtula, a Boston College student. They accused You of sending Urtula more than 47,000 text messages, verbally abusing him and urging him to kill himself.\n\nThey also said You physically abused Ursula, used manipulation to control him, and was even present at the parking garage where Urtula died. You is currently in her native South Korea and has not yet faced the charges in court.\n\nThe case against You immediately drew comparisons to those against Michelle Carter, a 22-year-old woman convicted of involuntary manslaughter in connection with the 2014 suicide of her friend, Conrad Roy.\n\nAlexander Urtula and Inyoung You. Suffolk County District Attorney's Office Like You, Carter was also accused of sending Roy a deluge of abusive text messages urging him to kill himself, and did not seek help even as she listened to him die over the phone. She is currently serving 15 months in jail.\n\nYet in the wake of the two high-profile manslaughter cases against women, experts told Insider they could not recall a similar instance of a man being charged with manslaughter in connection with his partner's suicide.\n\nThat fact struck the experts as noteworthy, given that women are statistically more likely than men to experience domestic or sexual violence, and about equally as likely as men to experience psychological aggression from an intimate partner.\n\nDaniel Medwed, a law professor at Northeastern University, told Insider it's rare to charge someone with manslaughter over another person's suicide, so the fact that both recent cases involved female defendants may at this point be nothing more than a coincidence — but it could also point to a larger, more worrying trend of gender bias in the criminal justice system.\n\n\"It could be an element of gender bias, especially I think in the Carter case,\" Medwed said. \"[There's] this idea of a woman somehow being manipulative and preying upon the vulnerabilities of some clueless boy.\"\n\nMedwed said the vast majority of domestic violence cases are brought against men, and therefore \"one would assume when it comes to threats and harassment,\" men are also the most likely perpetrators.\n\n\"We shouldn't ignore the gender dynamic. We shouldn't discount gender as a factor,\" he said.\n\nMen also send abusive, coercive texts to their partners — but they haven't faced manslaughter charges like You and Carter yet\n\nBut part of the apparent discrepancy could be the complex nature of suicide, and the documented differences between the ways men and women make suicide attempts, Jonathan Singer of the American Association of Suicidology told Insider.\n\nWomen in domestic violence situations are at an increased risk of suicidal ideation and suicide attempts, and according to the Centers for Disease Control and Prevention, women are roughly three times more likely to attempt suicide than men. Yet men are four times more likely to complete a suicide, because they tend to use more lethal methods than women.\n\nProsecutors said Alexander Urtula suffered 18 months of abuse at the hands of Inyoung You. Suffolk County District Attorney's Office Singer said it's highly likely that many women have experienced psychological abuse from their partners, just as Urtula and Roy did, and many may have also received texts urging them to kill themselves.\n\nBut that may be where the similarities end. Even if such abuse contributes to women's suicide attempts, they are statistically more likely to survive, Singer said. And since suicide attempts don't typically result in criminal charges, the men who abuse women in the same way that prosecutors say You and Carter abused Urtula and Roy often escape criminal punishment.\n\n\"What I suspect is that since most abusers are men, and since women are more likely to attempt suicide, what we see in the newspapers about (Urtula and Roy's deaths) is the exception,\" Singer said. \"It's more likely that you have male abusers increasing the risk of a suicide attempt that ends in a non-lethal suicide attempt.\"\n\nSinger added that such an outcome likely works in an abuser's favor, helping perpetuate and prolong the abuse.\n\n\"If I were an abuser and I was doing classic, abusive things … and my girlfriend makes a suicide attempt, I would say, 'See, look how f---ed up you are. I'm the only one who is here for you.'\"\n\nExperts say suicides shouldn't result in involuntary manslaughter charges at all\n\nMichelle Carter sits in Taunton District Court in Taunton, Mass. Charles Krupa, Pool, File via AP\n\nBoth Medwed and Singer questioned the ethics of pursuing involuntary manslaughter charges at all when it comes to suicides.\n\nFirstly, suicides are complex, multifaceted incidents that are generally not caused by a single factor or person.\n\nSinger urged caution in casting judgments on both Urtula and Roy's deaths, as details presented by police, prosecutors, and family members may not present a full picture of the men's circumstances and mental states before their deaths.\n\n\"One of the things that the general public should keep in mind is that it's easy to reverse-diagnose suicide,\" he said. \"You can look at a situation like this after the fact and say, 'Ah clearly those texts were the cause.' It could also have been things we have no documentation about.\"\n\nFor instance, it's possible that Urtula had contemplated or attempted suicide before he met or began a relationship with You. It's also possible he experienced long-term depression or anxiety, unbeknownst to his family members or friends. Singer noted that Urtula's suicide also occurred just before he was set to graduate — it's possible he felt anguished or hopeless about his future, or any number of other emotions.\n\n\"That's not uncommon for people just out of college,\" Singer said. \"Hindsight is 20/20. Don't fall into the trap of saying, 'Oh, we know what happened here.'\"\n\nBut even if You did not cause Urtula's suicide, experts said there's no question her alleged behavior and abuse was morally reprehensible.\n\nMedwed said he believes You was much more culpable in Urtula's death than Carter was in Roy's — prosecutors allege You physically abused Urtula and was present as he died, whereas Carter's relationship with Roy took place mostly through text and phone exchanges and they had limited physical interaction.\n\nFamily members of Conrad Roy comforted one another during Carter's trial in Bristol Juvenile Court in Taunton, MA on Jun. 13, 2017. Pat Greenhouse/The Boston Globe via Getty Images\n\nBut regardless of the accusations against You, Medwed said he believed involuntary manslaughter was the wrong way to charge her.\n\nInvoluntary manslaughter occurs when someone recklessly and unintentionally causes the death of another — for example, driving while intoxicated and causing a crash that kills someone.\n\nBut Medwed said with suicides, \"it's harder to show whether you consciously disregarded this huge risk, whether you knew this person was suicidal.\"\n\nAnother key factor is that Urtula and Roy were directly responsible for their own deaths. That makes it hard to attribute the cause of death to another person, Medwed said.\n\nAfter Roy's death and Carter's trial, Medwed helped create a bill in Massachusetts to criminalize \"coerced suicide\", which would target a narrower range of behaviors, such as encouraging or manipulating someone into suicide or a suicide attempt, despite knowing that the victim previously considered or attempted suicide.\n\nThe new bill would be an alternative to charging someone with manslaughter, and Medwed suggested a maximum sentence of five years.\n\nIt's easy for people to look at the details emerging in You's case and say, \"This is horrible, let's throw the book at her,\" Medwed said. \"But you want to craft a law that captures much more nuanced cases.\"\n\nHe continued: \"With manslaughter, you have to prove a direct cause … It's much harder to prove that causation with a suicide. I just don't think manslaughter is a good crime to fit these situations.\"", "description": "Experts told Insider they could not recall a similar instance of a man being charged with manslaughter in connection with his partner's suicide.", "authors": ["Michelle Mark"], "top_image": "https://image.businessinsider.com/5db9ea12e94e860b133f2269?width=1200&format=jpeg", "published_at": "2019-10-30"}