{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7599297/Kim-Kardashian-joined-friends-family-dinner-celebrate-39th-birthday.html", "downloaded_at": "2019-10-22 13:37:43.817920+00:00", "title": "Inside Kim Kardashian's 39th birthday bash: Star enjoys 'relaxing' celebrations with family", "language": "en", "text": "Advertisement\n\nKim Kardashian was joined by her family and friends as she celebrated her 39th birthday over dinner and a scrumptious cake with an epic bash in Palm Springs.\n\nThe thrilled reality star took to her Instagram Stories on Monday night to reveal that her favourite Armenian restaurant Carousel had personally came over to cater for the bash and also shared clips of her being surprised by a churro stand as well as a beignet truck.\n\nNo Kardashian festivity would be complete without their adorable brood, and Kim was quick to share cute snaps and clips of her children North, six, Saint, three, Chicago, 21-months and Pslam, five-months, enjoying the company of their equally sweet cousins.\n\nBirthday girl! Kim Kardashian was joined by her family and friends as she celebrated her 39th birthday over dinner and a scrumptious cake with an epic bash in Palm Springs\n\nSharing a sultry selfie, Kim delightedly added the caption: 'Thank you so much for all of the birthday love! I had the best most relaxing birthday ever! I Spent the weekend w my amazing friends in Palm Springs and then had a family dinner at my house tonight thrown by my mom and Kanye.\n\n'My favorite Armenian restaurant Carousel came and catered and then was surprised with a beignet truck and churro stand! I got amazing gifts from my whole family and Kanye for me the most amazing bags. But he donated $1 million to my favorite charities that work so hard on prison reform on my behalf from him and the kids. This makes my heart so happy!'\n\nKim was dressed down for dinner in a white zip-up hoodie and a black tank top and seemed to wear minimal makeup. She teamed it with large gold hoop earrings and long gold chain necklaces.\n\nYummy! The thrilled reality star took to her Instagram Stories on Monday night to reveal that her favourite Armenian restaurant Carousel had personally came over to cater for the bash\n\nTreats: After dinner the entire group was treated to a churro stand and a beignets food truck outside\n\n'Most relaxing birthday ever!' Kim happily shared the events of the night with her millions of followers as she shared a sultry Instagram snap\n\nFor a sleek look, the mother-of-four had her hair parted in the middle and swept into a sleek, tight, bun.\n\nTracy Romulus, Kim's close friend, snapped the reality TV star sitting at the table and blowing out candles on a cake.\n\nThe Keeping Up With the Kardashian star shared videos of her daughters North, six, and Chicago, 21-months, with their cousin Penelope Disick, seven.\n\nKim called them 'fashionista' as they strutted by and cousin Stormi Webster trotted behind them. She can be heard telling the trio they 'forgot someone' as Kylie Jenner instructs her daughter.\n\nThe kids of the family seem to be having the most fun of the family, giving piggyback rides and playing around.\n\nLow-key glam: Kim was dressed down for dinner in a white zip-up hoodie and a black tank top and seemed to wear minimal makeup\n\nMake a wish! The stunning brunette was seen making a wish before blowing out the candles while everyone cheered\n\nNext gen: The Keeping Up With the Kardashian star shared videos of her daughters North, six, and Chicago, 21-months, with their cousin Penelope Disick, seven\n\nWait for me! Cousin Stormi trotted behind as Kim called for the other three to wait for her\n\nNorth and Saint, three, are seen exploring the 'jungle' on their counter thanks to all of the floral arrangement Kim was gifted.\n\nAmong the flowers was two large round displays of roses in white and pink, and a life size display of brown roses in the shape of her Body fragrance, shaped after her bare form.\n\nAfter dinner the entire group was treated to a churro stand and a beignets food truck outside. Kim raved over the truck and jokingly asked 'did you get me the whole beignet truck forever?'\n\nHer eldest son, Saint can't seem to choose between a churro and ice cream he's eating. She managed to get the ice cream from him in an agreement to have it later.\n\nSuper cute: Stormi headed towards her mom Kylie Jenner who could be heard off screen\n\nNeed a lift: The kids of the family seem to be having the most fun of the family, giving piggyback rides and playing around\n\nExploring inside: North and Saint, three, are seen exploring the 'jungle' on their counter thanks to all of the floral arrangement Kim was gifted\n\nWay out: Saint peeked his head between large floral arrangements\n\nRoses for you: Among the flowers was two large round displays of roses in white and pink\n\nCome to life: There was also a life size display of brown roses in the shape of her Body fragrance - which was shaped just like her sensational curves\n\nBig donor: Kim also revealed during the night that her husband Kanye West and their kids donated $1 million to prison reform charities in her name\n\nIt seemed long with mom Kris, her sister Kourtney and her three children were there, but it's unknown who else attended.\n\nIn honour of her birthday, Kim also revealed that her husband Kanye West and their kids donated $1 million to prison reform charities in her name.\n\nKim revealed the six-figure donation towards the end of the night, by sharing a 'certificate of donation in honor of Kim Kardashian West.' From Kanye and their four children, North, six, Saint, three, Chicago, 21-months and Pslam, five-months.\n\nThe donation was made to prisoner reform organizations Cut 50, Buried Alive Project, Equal Justice Initiative and Antic-Recidivism Coalition.\n\nShe shared it with hearts and went on to say '[Kanye] donated $1 million to my favorite charities that work so hard on prison reform on my behalf from him and the kids. This makes my heart so happy!'\n\nIt comes as she was the darling of social media, on Monday, with her famous pals wishing her well.\n\nMore sweets for me: Her eldest son, Saint can't seem to choose between a churro and ice cream he's eating. She managed to get the ice cream from him in an agreement to have it later\n\nCelebrations: Kylie shared throwbacks with her sister and dubbed it 'Kim Day'\n\nGushin: Khloe gushed over her sister in a long post while also sharing a slew of stunning snaps of Kim\n\nThroughout Monday, Kim was celebrated on social media by her family and friends.\n\nHer older sister Kourtney, 40, shared two throwbacks with her sister, one in matching plaid outfits as girls and one as teenagers.\n\nKourtney said, 'Happy birthday Kimberly Noel Kardashian West. I love you forever.'\n\nKylie, Khloe and Kendall all shared birthday tributes for Kim, with the billionaire dubbing it 'Kim Day.'\n\n'For all the years of your life, you have glowed from the inside out. There has always been a magnetic energy about you,' Khloe shared. 'You have forever had an immense amount of courage and faith... I pray, on your birthday and every day of your life, that you forever feel loved, respected and appreciated!'\n\nTwinning: Kourtney shared two throwbacks with Kim, one in matching plaid outfits\n\nA little older: The second saw them as teens, in which Kourtney playfully stuck her tongue out for the camera", "description": "Kim Kardashian was joined by her family and friends as she celebrated her 39th birthday over dinner and a scrumptious cake with an epic bash in Palm Springs.", "authors": ["Jabeen Waheed For Mailonline", "Kellie Chudzinski For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/09/20026248-0-image-a-72_1571732697681.jpg", "published_at": "2019-10-22"}