{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7542903/MAFS-Cyrell-Paule-boyfriend-Eden-Dally-reveal-sex-baby.html", "downloaded_at": "2019-10-06 11:44:24.770304+00:00", "title": "MAFS' Cyrell Paule and boyfriend Eden Dally reveal sex of their baby", "language": "en", "text": "Cyrell Paule and boyfriend Eden Dally are expecting a baby boy.\n\nOn Sunday, the Married At First Sight star and her Love Island beau threw a gender reveal party at their home in Sydney's Drummoyne.\n\nSurrounded by blue balloons and confetti, Cyrell, 30, and Eden, 27, announced that they're awaiting a son, who is due in February 2020.\n\nPink or blue? MAFS' Cyrell Paule and boyfriend Eden Dally revealed they are expecting a baby boy at gender reveal party at their Sydney home on Sunday. Pictured with Cam Merchant\n\nThey gave the news gathered in the backyard surrounded by friends including Cyrell's former MAFS co-stars Jules Robinson, 37, and Cameron Merchant, 35, as well as Mick Gould, 32.\n\nEden, who was not aware of the baby's sex, looked absolutely delighted to learn that he was having a boy.\n\nCyrell had learned the child's sex some time before, but wanted to surprise her boyfriend.\n\nBaby love! Surrounded by blue balloons and confetti, Cyrell, 30, and Eden, 27, announced that they're awaiting a son, who is due in February 2020\n\nSweet: They gave the news gathered in the backyard surrounded by friends including Cyrell's former MAFS co-stars Jules Robinson, 37, and Cameron Merchant, 35\n\nDaddy's boy: Eden, who was not aware of the baby's sex, looked absolutely delighted to learn that he was having a boy\n\nPut it there! The delighted reality star shook hands with Cameron, clearly pleased\n\nThe brunette showed off her growing baby bump in a stretchy yellow frock as she posed with pink and blue balloons, as well as cakes and sweets in the same tones.\n\nCyrell styled her tresses in relaxed waves, and opted for a glamorous makeup palette including bold brows, a false set of lashes, kohl liner and a natural lip.\n\nClose by was beau Eden who showed off his buff frame in a light blue collared shirt with several buttons left undone, black jeans rolled up and white lace-up shoes.\n\nShe knew! Cyrell had learned the child's sex some time before, but wanted to surprise her boyfriend\n\nDressed up: The brunette showed off her growing baby bump in a stretchy yellow frock\n\nMates from TV! Former Married at First Sight star Mick Gould was also in attendance\n\nGuests indulged in donuts and other sweet treats, while Cyrell sipped on a non-alcoholic, fruity drink.\n\nCyrell first announced her pregnancy in August, telling New Idea the news came as a surprise as she and Eden weren't planning a baby.\n\nAt the time, the couple expressed concerns that some people would dismiss their child as a 'publicity stunt'.\n\nSweet treats! The pair posed with pink and blue balloons, as well as cakes and sweets in the same tones\n\nSurprise! Cyrell first announced her pregnancy in August, telling New Idea the news came as a surprise as she and Eden weren't planning a baby\n\nCyrell said the negativity had been 'sad' and 'exhausting', adding: 'I wouldn't be surprised if my child is going to get called a publicity stunt.'\n\nThe feisty star began dating Eden earlier this year, months after her 'marriage' to electrician Nic Jovanovic fell apart on MAFS.\n\nShe confirmed their relationship on an episode of Talking Married in April, following weeks of dating rumours.", "description": "Cyrell Paule and boyfriend Eden Dally are expecting a baby boy.", "authors": ["Marta Jary For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/10/19357360-0-image-a-24_1570354677516.jpg", "published_at": "2019-10-06"}