{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7566107/Jadon-Sancho-speaks-need-deliver-England-work-defeat-Czech-Republic.html", "downloaded_at": "2019-10-12 16:09:57.773581+00:00", "title": "Jadon Sancho speaks about need to deliver as England get back to work after defeat to Czech Republic", "language": "en", "text": "England star Jadon Sancho has revealed he puts pressure on himself every game in his bid to become one of the world's best footballers.\n\nSancho got back down to work on Saturday alongside his England team-mates as they look to respond emphatically following their disappointing 2-1 loss to the Czech Republic on Friday in their Euro 2020 qualifier.\n\nThe Three Lions take on Bulgaria in Sofia on Monday night and can seal their spot in next summer's Euros with victory if Kosovo, who sit third in Group A, fail to win against Montenegro.\n\nJadon Sancho and his England team-mates took part in a recovery session in Prague\n\nJordan Henderson enjoys a dip in the pool at the Three Lions' team hotel on Saturday afternoon\n\nMason Mount, who made his first England start on Friday, has a chat with Kieran Trippier\n\nHarry Maguire and his England team-mates lost 2-1 to the Czech Republic on Friday night\n\nAnd after Gareth Southgate's side took part in a recovery session on Saturday at their hotel in Prague, Borussia Dortmund star Sancho has spoken about his need to deliver week in week out for both club and country.\n\nSancho told the FA's official website: 'I feel like every time I play, because I'm an attacker the fans are expecting something, like for me to provide and help the team.\n\n'So that's my motivation when stepping out, to try and impact on the game. These days you get judged on how many games you play and how many goals you scored, people start to talk if you're not doing those things.\n\nHarry Kane stretches his muscles during Saturday afternoon's recovery session\n\nTrippier and Co will be desperate to bounce back on Monday night against Bulgaria\n\nSancho works out with resistance bands at the Three Lions' headquarters in Prague\n\n'For me, it's a personal thing and I really want to do well for my team so every time I'm out on the pitch I want to give 100 per cent and come up with an assist or a goal.\n\n'I have to put pressure on myself in every game because I know if I get a goal and an assist, even if we come away without a result, I can say at least I did try and help the team.\n\n'Obviously, you're not happy that you've lost but you can take something away from the game and move on to the next one.'\n\nEngland have the chance to qualify for the Euros on Monday night against Bulgaria in Sofia", "description": "Sancho got back down to work on Saturday alongside his England team-mates as they look to respond emphatically following their disappointing 2-1 loss to the Czech Republic.", "authors": ["Jonathan Spencer For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/16/19630034-0-image-a-54_1570895655543.jpg", "published_at": "2019-10-12"}