{"pub": "businessinsider", "url": "https://businessinsider.com/the-belgian-air-force-intercepted-russian-nuclear-capable-jets-2019-9", "downloaded_at": "2019-09-17 23:33:50.909753+00:00", "title": "Belgian F-16s scrambled to intercept 2 Russian nuclear-capable supersonic bombers over the Baltic Sea", "language": "en", "text": "Belgian Air Force F-16s scrambled to intercept two Russian Tu-160 Blackjack supersonic, nuclear-capable bombers, accompanied by two Sukhoi Su-27 Flanker fighters over the Baltic Sea on Tuesday.\n\nThe Belgian Air Force has been guarding the Baltic airspace since September 3, when it took over the police mission from fellow NATO member Hungary, which was supported by Spain and the UK in its mission. Four Belgian F-16s and at least 60 soldiers have been deployed to protect Baltic airspace from unwelcome incursions, according to the Belgian Ministry of Defense.\n\nTuesday's interception was Belgium's first since it began its rotation over Baltic airspace, and seemingly at very close range.\n\nRussian aircraft have engaged in several provocative actions over NATO airspace this year. In June, British Typhoon fighter jets scrambled to intercept Russian Su-30 Flanker fighters twice in two days.\n\nBut NATO countries aren't merely reacting to Russian aggression. In August alone, US and UK aircraft sent clear messages to Russia:\n\nUS B-2 Spirit stealth bombers flew with UK F-35s, the B-2's first time flying with non-US F-35s.\n\nB-2 Spirit bombers landed in Iceland for the first time. The B-2, which operates from Whiteman Air Force Base in Missouri, Andersen Air Force Base on Guam, Diego Garcia in the Indian Ocean, and Royal Air Force Fairford in the UK, needs specific conditions to support its stealth capabilities.\n\nB-2 bombers flew their first extended sorties over the Norwegian Sea earlier in September — right in Russia's backyard.\n\nNATO countries share the mission of protecting Baltic airspace, as the Baltic countries — Estonia, Latvia, and Lithuania — don't have the infrastructure to protect their own airspace and are considered at risk of destabilization or invasion by Russia.\n\nRead more: Watch a top F-22 pilot fly 10 death-defying maneuvers in a 2-minute hyperlapse video", "description": "The Belgian Air Force intercepted two Russian Tu-160 supersonic, nuclear-capable bombers at close range in Baltic airspace.", "authors": ["Ellen Ioanes"], "top_image": "https://amp.businessinsider.com/images/5d812bac2e22af49fe732617-2732-1366.jpg", "published_at": "2019-09-17"}