{"pub": "vice", "url": "https://vice.com/en_us/article/59nqv8/johnny-depp-forced-to-turn-medical-records-over-to-amber-heard", "downloaded_at": "2019-10-22 13:25:20.696427+00:00", "title": "Johnny Depp Forced to Turn Medical Records Over to Amber Heard", "language": "en", "text": "Johnny Depp has been ordered by a Virginia judge to turn over medical records and other documents to Amber Heard, the latest turn in a wildly messy defamation lawsuit he filed against her in March. The court ruled on Friday, October 18 that Depp must turn over medical records and other documents to Heard by November, including anything that would show whether he's been accused of being physically abusive to past romantic partners.\n\nDepp and Heard met in 2011, and were married in 2015; Heard filed for divorce in May of the following year, requesting a temporary restraining order against Depp and accusing him of assaulting her in their Los Angeles apartment. They finalized their divorce in January 2017, agreeing to a $7 million settlement. The process was drawn-out and volatile by all accounts; Heard's attorney Pierce O'Donnell dryly told People after the agreement was reached, \"In the words of Gerald Ford, 'Our long national nightmare is over.'\"\n\nThe language both sides used in finalizing the divorce was extremely careful, complete with a statement released that seemed to deny any allegations of abuse. It read, in full, \"Our relationship was intensely passionate and at times volatile, but always bound by love. Neither party has made false accusations for financial gain. There was never any intent of physical or emotional harm.\" The Guardian reported that ABC News was forced to retract a statement from Heard's lawyers that claimed she had been \"vindicated in the court of public opinion.\" One of them, Samantha F. Spector, subsequently said that the statement had been made without Heard's knowledge and wasn't true, adding, \"We regret the error and apologize to Johnny Depp.\"\n\nThe fragile peace was short-lived, however. In 2018, Heard penned an op-ed for the Washington Post, which Depp quickly filed suit over, claiming it defamed him. While Heard's piece didn't mention him by name, and was largely about the broader #MeToo movement, it contains many implicit references to her 2016 allegations of domestic abuse against Depp. \"[T]wo years ago, I became a public figure representing domestic abuse,\" Heard wrote, \"And I felt the full force of our culture's wrath for women who speak out.\" She also likened an unnamed famous man's ecosystem to the Titanic, writing,\n\nI had the rare vantage point of seeing, in real time, how institutions protect men accused of abuse. Imagine a powerful man as a ship, like the Titanic. That ship is a huge enterprise. When it strikes an iceberg, there are a lot of people on board desperate to patch up holes—not because they believe in or even care about the ship, but because their own fates depend on the enterprise.\n\nDepp's response was to sue Heard for $50 million in Fairfax Circuit Court in Virginia, claiming that the op-ed \"depended on the central premise that Ms. Heard was a domestic abuse victim and that Mr. Depp perpetrated domestic violence against her,\" which his attorneys described as categorically false. The suit blamed Heard's op-ed for Depp being officially dropped from Pirates of the Caribbean in December 2018, news that came three days after her op-ed was published. (Rumors that Depp wouldn't be continuing with the franchise had circulated months before.) His complaint also called her allegations part of an \"elaborate hoax\" to \"generate positive publicity for Ms Heard and advance her career.\"\n\nThe lawsuit that has only gotten more venomous and byzantine as the year has gone on, with Depp claiming in May that Heard had actually been the abuser, physically attacking both him and past romantic partners. A court filing from Depp claimed that she had abused \"prescription amphetamines\" and non-prescription drugs, \"hit, punched and kicked\" Depp and \"frequently threw objects into my body and head,\" including \"heavy bottles, soda cans, burning candles, television remote controls, and paint thinner cans, which severely injured me.\" Depp also accused her of fabricating physical injuries Heard said she'd sustained from him attacking her.\n\nHeard is represented by a team of lawyers headed by Roberta Kaplan, the co-founder of the Times Up Legal Defense Fund. They responded to the suit by trying to have it dismissed altogether, calling it \"meritless bullying.\"\n\nBut Heard's team also moved in September to compel Depp to turn over a variety of documents during the discovery process in the lawsuit, which are, they say, crucial to proving that the substance of what Heard claimed about Depp being abusive was true. Specifically, they asked for any documents or records relating to his alleged substance abuse, any written agreements he might have signed with other past partners that would relate to violence or abuse, payments to any potential witnesses to any abuse, any prior arrests and surveillance footage from properties he owns. Separately, they also asked that Depp be forced to sign a HIPAA waiver that would give his physicians permission to turn over records on a finger injury he claims to have sustained when Heard allegedly threw a glass vodka bottle at him, which he claims injured his hand and severed the tip of one finger.\n\nDepp's lawyers argued in response that the records requests were overly broad and a severe invasion of his privacy. In a court hearing in Virginia on October 18, one of Depp's attorneys, Robert B. Gilmore, called the discovery request \"a fishing expedition, plain and simple,\" adding, \"It's intended to harass Mr. Depp, and it's intended to distract the court, the parties, the jury from what’s the sole issue in this case.\"\n\nJudge Bruce D. White didn't agree, ordering Depp to turn over the discovery documents by November 14 and sign a HIPAA waver by Friday, October 25. In a statement, Roberta Kaplan, Heard's attorney, called it a significant victory for their side:\n\n\"We are very pleased that the Court granted our motion to compel in full. Mr. Depp's position on discovery in this case has been nonsensical, as if he were the one being sued. But it is Mr. Depp who started this lawsuit on the theory that Ms. Heard somehow made up all the abuse that forced her to obtain a restraining order against Mr. Depp back in 2016. Now that the facts in his own lawsuit are making him uncomfortable, Mr. Depp wants to hide evidence commonly understood to be connected to incidents of domestic violence: his decades-long abuse of drugs and alcohol, his past history of violence, and medical records showing among other things the laundry list of prescription medications he takes daily and injuries from his drug-induced rages. But that is not how litigation works. Mr. Depp started this fight. Ms. Heard intends to finish it by proving, if necessary, the truth of what really happened.\"\n\nDepp's lead attorney Benjamin Chew didn’t immediately respond to a request for comment; after the hearing, however, he told Courthouse News they would comply with the ruling. \"We look forward to discovery,\" he told the outlet.\n\nDepp's financial and legal troubles have been legion in the last several years. A June 2018 Rolling Stone profile outlined his complicated morass of personal woes, including a lawsuit against his former business managers, in which he accused them of mismanaging his money and they counter-sued, alleging he'd squandered his millions on wine and islands. That case was settled in July of that year, shortly before it was set to head to trial. Depp later called the Rolling Stone profile itself \"a sham,\" telling British GQ \"I was shafted\" in a much gentler and more flattering profile.", "description": "This is the latest development in the messy legal saga that centers on Heard's 2018 'Washington Post' op-ed that Depp says defamed him.", "authors": [], "top_image": "https://video-images.vice.com/articles/5dade7fa5c1f5f000a31fab5/lede/1571679962888-GettyImages-506416178.jpeg?crop=0.9815950920245399xw:1xh;center,center&resize=1200:*", "published_at": "2019-10-21"}