{"pub": "fox", "url": "https://foxbusiness.com/technology/mind-your-own-business-act-seeks-greater-data-and-privacy-protections-for-consumers", "downloaded_at": "2019-10-22 20:48:24.808730+00:00", "title": "Mark Zuckerberg defends Libra cryptocurrency to House Dems as Facebook privacy woes fester", "language": "en", "text": "Facebook founder and CEO Mark Zuckerberg will field questions Wednesday on Capitol Hill about his company's foray into cryptocurrency, an initiative greeted with skepticism by lawmakers and regulators alike.\n\nContinue Reading Below\n\nDuring a hearing called by the Financial Services Committee in the Democratically-controlled House of Representatives, lawmakers may also press the magnate on the hot-button issue of data privacy, GOP complaints that the social media giant censors conservative viewpoints and the veracity of political ads.\n\nWhile Zuckerberg has acknowledged that he must win back the trust of regulators and the public, he believes Libra would be a beneficial innovation, particularly in companies without widespread access to banks. Libra was designed to avoid some of the complaints about older and more volatile cryptocurrencies, with a link to dominant world currencies such as the dollar and the British pound.\n\nFacebook is leading the Libra's development, but it plans to cede control afterward to a Switzerland-based governing body, the Libra Association, in which it will have no more power than any of the other numbers. The social media giant would retain authority over Calibra, a digital wallet developed especially for LIbra.\n\nThe initiative's timing has proved awkward for Facebook, which has faced mounting scrutiny since U.S. intelligence agencies said the platform and rivals like Twitter were leveraged by Russian operatives seeking to influence the 2016 presidential election in the U.S. More recently, Sen. Elizabeth Warren -- the Massachusetts Democrat seeking her party's nomination to run against Trump -- has called for the company to be broken up, and Democratic Sen. Ron Wyden introduced a bill to strengthen privacy protections for consumers and hold businesses accountable for violations.\n\nThe Mind Your Own Business Act \"would give American consumers an easy, one-click way to stop companies from selling or sharing their personal information, give consumers radical transparency into how corporations use and share their data, and impose harsh fines and even prison terms on executives at corporations that misuse Americans' data and lie to the government,\" according to a statement from Wyden’s office,\n\nAmong other things, the bill would strengthen protections for consumers who don't want their data mined so that third parties can target them with ads.\n\nIdentity theft protection and data privacy are critical to \"everyone’s financial well-being these days,\" said Robert M. Ryerson, an expert in the field and the author of \"What’s the Deal With Identity Theft -- A Plain English Look at Our Fastest Growing Crime.\"\n\nRyerson praised Wyden’s bill but cautioned that a private identity theft plan that includes restoration services in the event of a breach is still the best safeguard.\n\n\"The sad fact is that today, all or most of our personal data is in the cloud already, and accessible by various entities we need to interact with, from medical professionals, to motor vehicle commissions, to employers, etc.,\" Ryerson told FOX Business. \"With ID theft continuing to be the fastest-growing crime in most years, this much-needed legislation is both timely and practical.\"\n\nStocks in this Article FB FACEBOOK INC. $182.34 -7.42 (-3.91%)\n\nCompanies that fail to abide by the proposed standards could be fined up to 4 percent of revenue.\n\n\"Mark Zuckerberg won't take Americans' privacy seriously unless he feels personal consequences,\" Wyden said. \"I spent the past year listening to experts and strengthening the protections in my bill. It is based on three basic ideas: Consumers must be able to control their own private information, companies must provide vastly more transparency about how they use and share our data, and corporate executives need to be held personally responsible when they lie about protecting our personal information.\"\n\nThe law in many ways mirrors the European Union’s General Data Protection Regulation (GDPR), which was implemented across member states in 2018. It sets stringent fines for companies that fail to safeguard consumer data and allows consumers to block firms from collecting their information.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE", "description": "New legislation could be a boost to consumers advocating for greater data and privacy protections.", "authors": ["Kristian Dyer"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/05/0/0/facebook-ap-iStock.jpg?ve=1&tl=1", "published_at": "2019-10-18"}