{"pub": "politico", "url": "https://politico.com/story/2019/09/24/trump-immigration-impeachment-democrats-1509947", "downloaded_at": "2019-09-25 04:37:42.198984+00:00", "title": "Trump to push message of law and order amid impeachment furor", "language": "en", "text": "President Donald Trump. | Stephanie Keith/Getty Images White House Trump to push message of law and order amid impeachment furor A White House gathering of sheriffs to discuss immigration will take place as Democrats accuse the president of subverting the Constitution.\n\nPresident Donald Trump plans to meet with a group of sheriffs at the White House on Thursday to discuss his administration’s plans on immigration — an event that comes as he prepares to make the issue a central focus of his fall legislative agenda and 2020 campaign, but also amid House Democrats’ launch of a formal impeachment inquiry against him.\n\nThe gathering will take place the same day the acting director of national intelligence, Joseph Maguire, appears on Capitol Hill to testify about a whistleblower complaint reported to involve, in part, a phone call between Trump and Ukraine’s president in which Trump discussed a political opponent, former Vice President Joe Biden. That call — which Trump has vowed to release as an unredacted transcript — has been the focus of increasing calls for his impeachment if the conversation proves to have involved a quid pro quo offer: seeking Ukraine’s help to get dirt on Biden in exchange for military aid to the country.\n\nStory Continued Below\n\nThe White House setting offers the president a backdrop of law and order even as the impeachment process enters its most intense phase yet. Many of the sheriffs planning to attend the meeting, which will also include acting Homeland Security Secretary Kevin McAleenan, are in Washington this week for a conference focused on immigration and border security hosted by the Federation for American Immigration Reform, a group with close ties to the Trump White House that supports reducing overall levels of immigration to the United States. The sheriffs will urge Trump to continue pushing for immigration reform measures that have tormented Congress for years, according to three sources with knowledge of the meeting.\n\n“They want to see some type of action. They want to create a sense of urgency on this,” one of those sources said, adding that more than 100 sheriffs will gather with Republican lawmakers and so-called “Angel Families” outside the Capitol on Wednesday to outline their concerns about the current standstill on immigration policy.\n\nA similar news conference held last year was attended by Rep. Steve King (R-Iowa), who was recently rebuked by the Democrat-controlled House for a series of eyebrow-raising comments on race, and White House counselor Kellyanne Conway.\n\nposter=\"http://v.politico.com/images/1155968404/201909/3888/1155968404_6089163104001_6089162887001-vs.jpg?pubId=1155968404\"\n\nThe meeting between Trump and local sheriffs comes as the White House prepares to release draft legislation that aims to fix loopholes in the legal immigration system and enhance border security. Administration officials have begun circulating the draft to stakeholders, just weeks after White House senior adviser Jared Kushner, who is at the center of the latest immigration push, told GOP senators their party would be wise to unify behind one plan ahead of the 2020 election.\n\nBut some White House officials have pressured the president and Kushner to shelve immigration — an issue Trump’s base cares deeply about — until 2020, despite concerns that Democrats will be even less likely to work across the aisle in an election year and as an impeachment inquiry plays out.\n\nThese officials say the president should focus this fall on passing the USMCA, a renegotiated version of NAFTA that House Speaker Nancy Pelosi (D-Calif.) has so far declined to put to a floor vote, tackling prescription drug costs and avoiding a partial government shutdown when a stopgap spending bill — which is expected to pass the Senate this week — expires just before Thanksgiving.\n\nThat laundry list does not include new gun control legislation, which the White House previously said it planned to get behind after back-to-back mass shootings in August. The president has yet to release any gun-related framework that Republicans can rally around, partly because of the conflicting advice he’s receiving from his adult children Ivanka and Don Jr., as POLITICO reported Monday.\n\nRather, the president has remained fixed on immigration — touting the success of his administration’s partnership with Mexican officials at the southern border, defending his use of military construction funds to break ground on new border wall, and celebrating a recent Supreme Court decision to undo a lower court ruling that barred the administration from enforcing new rules for asylum seekers. Trump even used a portion of his remarks at the United Nations General Assembly on Tuesday to smack down critics of his immigration actions.\n\n“Your policies are not just. Your policies are cruel and evil,” he told a roomful of foreign leaders, referring to those who favor “open borders.”\n\nWhen the sheriffs participating in Thursday’s meeting arrive for their sit-down with Trump, it’s unlikely everyone in the room will be as enthusiastic as the president about his recent actions on immigration.\n\nMorning Shift newsletter Get the latest on employment and immigration, every weekday morning — in your inbox. Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nLast fall, the president surprised dozens of sheriffs, who had come to meet with Vice President Mike Pence and DHS officials, with an invite to join him in the East Room. After delivering brief remarks about immigration, Trump left the 30-plus law enforcement officials standing behind him as he fielded questions from reporters about a critical op-ed published in the New York Times by an anonymous official inside his administration.\n\n“Hey, I’ll ask the sheriffs: Can you imagine? We have somebody in what I call the ‘failing New York Times’ that’s talking about he’s part of the resistance within the Trump administration,” Trump told his guests.\n\n“It kind of took some of our members off guard last year,” said an official with one organization representing law enforcement.\n\nSome members of the group, which will send its executive director to Thursday’s meeting but avoided involvement in planning it, were upset last year when their colleagues told Trump they support all that his administration is doing on the immigration front. “The spokespeople said last year, ‘We support everything you do,’ and that’s not the truth.”\n\n“Some of our members — especially our leaders — are more middle of the road,” the official added.\n\nA White House official did not respond to a request for comment.\n\nShould the Trump administration’s anticipated immigration plan fail to gain traction on Capitol Hill — as some Senate GOP offices have privately predicted it will — the president has already teased a fallback message that largely focuses on his long-promised border wall. As he stood beside a segment of the wall last week that is under construction near San Diego, Trump said his advisers “think we can get it close to 500 miles by the end of next year, depending on certain terrain conditions.”\n\n“You can fry an egg on that wall. It’s very, very hot,” he added, previewing a line he’s likely to recycle on the campaign trail in the months ahead.", "description": "A White House gathering of sheriffs to discuss immigration will take place as Democrats accuse the president of subverting the Constitution.", "authors": [], "top_image": "https://static.politico.com/92/a6/794f01b646feb8d6ce8fa98e479a/20190924-donald-trump-gty-773.jpg", "published_at": "2019-09-24"}