{"pub": "cnbc", "url": "https://cnbc.com/2019/09/27/royal-caribbean-spot-with-nbcu-starts-with-audio-over-a-black-screen.html", "downloaded_at": "2019-09-28 01:05:48.944967+00:00", "title": "NBC has a new TV ad format that starts with sound over a black screen", "language": "en", "text": "A new ad spot from Royal Caribbean created with NBCUniversal gives new meaning to audio-first: The 30-second commercial begins with just sound over a black screen.\n\nThe spot, called \"Perfect Day,\" premiered Thursday in prime time on NBC. The ad will run three more times on Bravo, USA and E!, and will appear near \"energetic\" scenes from shows on those networks to create a \"compelling juxtaposition of sound and energy that will capture viewers' attention,\" an NBCUniversal spokeswoman said. Adweek first reported on the ad on Thursday.\n\nThis new format of ad from NBCUniversal is called \"Must Hear TV\" and was first announced as an offering in June at the Cannes International Festival of Creativity, the industry's most illustrious awards event and conference. Royal Caribbean is the first brand to use the ad product.\n\nThe ad begins with four seconds of a black screen with the sounds of a water park. Then, words begin to pop up on the screen: \"This is turning it up a notch,\" they read. Then, \"Without your remote.\" Then the ad continues with full color and visuals a few seconds later. The spot promotes Royal Caribbean's new private island resort Perfect Day at CocoCay in the Bahamas.\n\nRoyal Caribbean worked with its creative and media agencies, MullenLowe and MediaHub, on the commercial.\n\nThough four seconds of black screen doesn't sound like much, it's an interesting twist for TV, where every second is valuable for a brand. It's also long enough perhaps to confuse viewers, who might hear the sounds and be curious to find out more (or wonder if there's something wrong with their television).\n\nNBCUniversal has been testing out a number of other commercial innovations, like ShoppableTV, which lets viewers buy products in the environment of the shows they're watching. For instance, viewers watching the French Open tennis tournament in May were able to buy Lacoste's Novak Djokovic clothing collection while watching him play, Ad Age reported at the time.\n\nDisclosure: NBCUniversal is the parent company of CNBC and CNBC.com.\n\n", "description": "Royal Caribbean is the first brand to use NBCUniversal's audio-focused \"Must Hear TV\" commercial format.", "authors": ["Megan Graham"], "top_image": "https://image.cnbcfm.com/api/v1/image/106153348-1569609948580royalcaribbean.png?v=1569610005", "published_at": "2019-09-27"}