{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/sportsnews/article-7540689/Derby-winger-Tom-Lawrence-apologises-total-error-judgement-drink-drive-crash.html", "downloaded_at": "2019-10-05 12:42:04.146815+00:00", "title": "Derby winger Tom Lawrence apologises for 'total error of judgement' after drink-drive crash", "language": "en", "text": "Derby winger Tom Lawrence has issued a statement apologising for 'a total error of judgement' after he was charged with drink driving.\n\nLawrence and team-mate Mason Bennett will be fined six weeks wages and will serve an additional 80 hours of community and rehabilitation work, which will include a drink aware course, following last week's crash.\n\nThe crash left Richard Keogh's career hanging in the balance, with the Derby captain having been ruled out until December next year after suffering two ruptured ligaments.\n\nDerby winger Tom Lawrence has apologised after he was charged with drink driving\n\nLawrence's statement on Derby's official website read: 'Following the events of the evening of the 24th September I wish to offer my sincere apologies to the football club; our Chairman, the manager, my teammates and all our supporters for my indiscretions that night.\n\n'It was a total error of judgement on my part, out of character for me and I am deeply disappointed in my behaviour and upset for my teammate and our Captain Richard Keogh.\n\n'Going forward, I will make every effort to make amends by working diligently to give something back to our local community and I will strive to repay all the faith and support I have received from everybody during my time at the club in the best way I know how, on the field of play.'\n\nLawrence and Mason Bennett have been fined the equivalent of six weeks wages\n\nOn Friday Bennett issued a statement in which he said that he is 'ashamed' of his actions.\n\nThe Derby forward said: 'On the night of Tuesday 24th September, I made huge mistakes after consuming alcohol. What I did was wrong.\n\n'Being a footballer and someone who young fans look up to I know the example I set is key. I am ashamed.\n\nRichard Keogh has been ruled out for 15 months after being involved in the car crash last week\n\n'At 23 I am old enough, and I was brought up, to know better.\n\n'I understand that such actions have serious consequences. I take full responsibility for my actions and accept the punishment that the club has issued.\n\n'I have to and will learn from these events and will strive to be a better person.\n\n'There's no excuse for what I've done. I'm sorry to my family, my friends, the club, all Derby supporters and to the wider football community, I let you all down.'", "description": "Derby winger Tom Lawrence has issued a statement apologising for 'a total error of judgement' after he was charged with drink driving.", "authors": ["Jeorge Bird For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/11/19330588-0-image-a-18_1570272521462.jpg", "published_at": "2019-10-05"}