{"pub": "politico", "url": "https://politico.com/news/2019/10/20/trump-mcgahn-testify-grand-jury-052591", "downloaded_at": "2019-10-20 23:22:03.207959+00:00", "title": "Justice Dept. confirms Trump Jr. and McGahn did not testify to Mueller grand jury", "language": "en", "text": "“The Special Counsel’s reasons remain unknown,” Howell wrote. “The reason is not that the individuals were insignificant to the investigation. To the contrary, both of the non-testifying individuals named in paragraph four figured in key events examined in the Mueller Report. Assessment of these choices by the Special Counsel is a matter for others.”\n\nTrump Jr. was present at the now-famous June 2016 Trump Tower meeting in which Trump campaign officials met with Russians. Before that meeting, he also received an email offering “dirt” on Democratic president candidate Hillary Clinton.\n\n“If it’s what you say, I love it,” Trump Jr. responded.\n\nAn attorney for Trump Jr., Alan Futerfas, did not immediately reply to a request for comment on the confirmation that his client never testified.\n\nThe Mueller report says Trump Jr. declined a voluntary interview, but several lines that follow that statement are blacked out.\n\nLawyers for other witnesses in the probe have said they believe Trump Jr.’s attorneys informed prosecutors he would assert his Fifth Amendment right against self-incrimination if called to the grand jury and that Mueller’s team elected not to force his testimony by asking a judge to grant him immunity.\n\nIn April, prior to release of the report, one of the president’s personal attorneys tamped down talk that Trump Jr. exercised his constitutional right to remain silent.\n\n“I can tell you I have no knowledge that anybody took the Fifth,” Rudy Giuliani said at the time.\n\nDonald Trump Jr. was present at the now-famous June 2016 Trump Tower meeting where campaign officials met with Russians. He also received an email offering “dirt” on Democratic president candidate Hillary Clinton. | Chip Somodevilla/Getty Images\n\nMueller used a grand jury extensively in the Russian-interference part of his investigation, but it appears to have played little role in the inquiry into potential obstruction of justice by the president.\n\nIn that part of the investigation, witnesses — including many White House officials — were interviewed at Mueller’s office. The move was widely seen as a courtesy aimed at avoiding a potential clash between Mueller’s office and the White House.\n\nMcGahn’s attorney, Bill Burck, told POLITICO on Sunday that there was no need for McGahn to go in front of a grand jury because he was willing to answer prosecutors’ questions.\n\n“Don McGahn voluntarily agreed to be interviewed. There was no need for a grand jury subpoena,” Burck said.\n\nMcGahn’s extensive interviews, which total about 30 hours, provided a key part of the narrative surrounding several episodes of potential obstruction. Mueller ultimately reached no legal conclusion about those instances.\n\nLimiting the use of a grand jury in the obstruction probe also gave the Justice Department greater leeway to make that portion of the report public with few redactions.\n\nHowell noted in her order last week that Mueller’s final report disclosed that one person highly central to the investigation — President Trump — was not interviewed or called before the grand jury. The special counsel considered subpoenaing Trump because of dissatisfaction with written responses to prosecutors’ questions but elected not to do so, the judge observed.\n\nThe document that confirmed the lack of grand jury testimony by Trump Jr. and McGahn is a court declaration filed by Associate Deputy Attorney General Bradley Weinsheimer, the Justice Department’s highest ranking career official.\n\nWeinsheimer’s declaration relates to a part of the House-Justice Department legal fight about supporting documents for Mueller’s report, including dozens of FBI reports detailing interviews with key witnesses in both parts of the special counsel probe.\n\nIn a court filing earlier this month, the Justice Department said the process of sharing so-called 302 reports from the Mueller probe with the House was ongoing. DOJ lawyers said they had yet to turn over the summaries of interviews with McGahn, former national security adviser Michael Flynn, former Trump aide Steve Bannon and former White House communications director Hope Hicks.\n\nThe House has received FBI reports on Mueller interviews with other key players, including Chris Christie, Michael Cohen, Corey Lewandowski, Paul Manafort, Rod Rosenstein, Chris Ruddy, Sarah Huckabee Sanders and Sean Spicer.\n\nKyle Cheney contributed to this report.", "description": "", "authors": [], "top_image": "https://static.politico.com/ce/93/5588c83c41efa4b79cee67abe977/20191020-mcgahn-ap-773.jpg", "published_at": "2019-10-20"}