{"pub": "usatoday", "url": "https://usatoday.com/story/sports/2019/10/14/usa-gymnastics-progress-hurdles-remain/3969312002", "downloaded_at": "2019-10-14 11:28:27.868039+00:00", "title": "USA Gymnastics making progress on reform, but status remains uncertain with Tokyo looming", "language": "en", "text": "CLOSE SportsPulse: As we march towards the 2020 Summer Olympics in Tokyo, here are three fun facts about one of the United States' biggest stars, Simone Biles. USA TODAY\n\nSTUTTGART, Germany — The Tokyo Olympics begin in a little over nine months, and the gymnasts aren’t the only ones living with uncertainty.\n\nUSA Gymnastics remains in bankruptcy proceedings and is still in settlement negotiations with the survivors of Larry Nassar’s abuse. It also is waiting for the U.S. Olympic and Paralympic to lift the threat of decertification. With its future still very much in limbo, the governing body’s new leadership is operating as if it will keep its status, in hopes that will prove it deserves to be allowed to.\n\n“We have plans in place to address (the criteria the USOPC will consider), and we have already done steps to address them as well,” Li Li Leung, who took over as USA Gymnastics’ CEO in March, told USA TODAY Sports. “We’re progressing on the trajectory that we had planned for ourselves and put in place, and have updated the USOPC on the progress.\n\n“I believe they are pleased with the progress so far,” Leung added. “But we still have a lot of work to do, and we acknowledge that, as well.”\n\nLi Li Leung, new USA Gymnastics president and CEO. (Photo: WENDY BARROWS photography, AP)\n\nHundreds of girls and young women, including Olympic champions Simone Biles, Aly Raisman, Gabby Douglas and McKayla Maroney have said they were abused by Nassar, the longtime team physician for USA Gymnastics and Michigan State. Horrific enough, the abuse also revealed serious deficiencies in the way USA Gymnastics operated.\n\nThe CEO at the time, Steve Penny, was forced out over criticism he and the federation had mishandled abuse complaints. He was later charged in Texas with tampering with evidence, a third-degree felony, after it was revealed he had ordered medical records to be removed from the Karolyi ranch, where the national team had held its training camps.\n\nGymnasts complained of a culture of fear and intimidation, and criticized the next CEO, Kerry Perry, of doing next-to-nothing to engage with them or the Nassar survivors. Perry was eventually forced out, too.\n\nAfter USA Gymnastics failed to adequately vet interim head Mary Bono, new USOPC CEO Sarah Hirshland had had enough, announcing in November 2018 that she was moving to strip its status as the sport’s national governing body.\n\nWORLD CHAMPIONSHIPS: Simone Biles becomes most-decorated gymnast, male or female\n\nOPINION: Simone Biles sets the standard in gymnastics and maybe any sport you can name\n\nThat seemed to finally get the federation’s attention. Chief operating officer Ron Galimore, who helped provide a cover story for Nassar, was ousted. Kathryn Carson, who had been general counsel for the U.S. Golf Association, was appointed chair of the board.\n\nAnd, in February, USA Gymnastics announced it was hiring Leung, a former gymnast and longtime NBA executive, to be its new CEO.\n\nVisibility has been a priority for Leung, as has been soliciting feedback. She, Carson and Stefanie Korepin, recently hired as the chief programs officer, were all here at the world championships, and all three were seen mingling with the gymnasts and their coaches.\n\n“We want to hear them, we want to listen to them,” Leung said.\n\nThat has not gone unnoticed.\n\n“I’m really, really appreciative of Li Li’s leadership,” said Tom Forster, women’s national team coordinator. “I really appreciate her understanding what all of the athletes are going through and being supportive. I’m really, really happy about that.”\n\nBut it will take more than a few photo ops to turn USA Gymnastics around.\n\nThe USOPC has said the federation needs to show improvement in leadership stability, financial stability, athlete safety and rebuilding trust in the community in order to retain its governing body status.\n\nLeung has slowly been doing the first, and her hiring has been a dramatic departure from what the organization, and others in the Olympic movement are used to seeing. Rather than people insulated in the sport or even the Olympic movement, Leung’s hires have had a mix of gymnastics and business experience.\n\nKorepin, for example, is a former rhythmic gymnast who spent the last decade in the renewable energy field.\n\n“My belief is the more diverse perspectives we have around the table, the more robust the discussion is,” Leung said. “And the end product is better because of it.”\n\nAfter consulting with survivors – both male and female, of all generations – USA Gymnastics revamped its SafeSport policies. It has begun rolling out webinar seminars, and will eventually have programs for athletes, coaches, parents and gym owners.\n\nThe SafeSport team also went to every regional gymnastics conference, as well as some state conferences.\n\n“It’s important that the community understands it is a shared commitment,” Leung said. “That everyone in the community needs to get on board in order to be able to provide the safest environment possible for our athletes.\n\n“That’s the only way that we can all be successful.”\n\nThe USOPC put the decertification process on hold while USA Gymnastics goes through bankruptcy, but Hirshland said she’s “pleased” with the changes so far. Leung has been in frequent communication with the USOPC, and Hirshland recently met with her and the rest of the federation’s leadership to discuss the changes they’ve made and what they plan to do going forward.\n\n“(Leung) is, in many respects, rebuilding the organization,” Hirshland told USA TODAY Sports, “and we believe that’s what needed to happen.”\n\nThat doesn’t mean USA Gymnastics is in the clear, however, even with the Olympics rapidly approaching.\n\nHirshland said the decertification process will likely remain stayed as long as USA Gymnastics is going through bankruptcy. But she said the USOPC also has contingency plans in place should it no longer become tenable for USA Gymnastics to oversee the sport.\n\nIt can’t completely shield the athletes from distractions, Hirshland said, but it can assure them that their training won’t be disrupted.\n\n“The tools they need, the resources, the training environments, all of those things -- we have ample opportunities to ensure that that doesn’t change,” she said.\n\nWhile the future of USA Gymnastics is, of course, of interest to the athletes and their coaches, it’s also not an overriding concern. They will give their input when asked, but it is the job of USA Gymnastics and USOPC leadership to fix the problems that never should have occurred in the first place.\n\nTheir job is to compete. And regardless of what happens, there will be gymnasts representing the United States in Tokyo.\n\n“The U.S. Olympic Committee still be there and the girls, the elites, will still be there,” said Brian Carey, father and coach of Jade Carey, who won a team gold and silver on vault at the world championships. “We just go ahead and focus on us.”", "description": "USA Gymnastics has overhauled leadership in wake of Larry Nassar abuse, and revamped safe sport policies with suggestions from survivors.", "authors": ["Nancy Armour", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/13/USAT/ad989c80-72de-4266-9ec4-ce303e7b3e5e-li_li_AP_USA_Gymnastics_Leung.JPG?crop=2272,1278,x372,y209&width=3200&height=1680&fit=bounds", "published_at": "2019-10-14"}