{"pub": "investing.com", "url": "https://in.investing.com/analysis/indian-markets-trading-at-decisive-levels-200432563", "downloaded_at": "2019-10-29 02:29:07.720636+00:00", "title": "Indian Markets Trading at Decisive Levels", "language": "en", "text": "Wishing All The Viewers A Very Happy And Prosperous New Year !\n\nNifty View - A Week Ahead\n\nNifty closed at 11627.15 gaining 43.25 points on the day of Diwali Muhrat Special Trading Session of one hour. During the entire last week, Nifty could not surpass the high made on 22nd October and Nifty closed almost flat for the week forming 4 red candles out of 5 trading days.\n\nWhat Next For Nifty in Coming Days ??\n\nIn the coming days we may see some correction in benchmark Index as it is facing resistance to cross 11700 levels on closing basis. Market seems uncomfortable at these levels and may correct to downside levels upto 11583 - 11531 - 11492 - 11421 in the coming days ahead. Upside resistance are located between 11679 to 11715. For any further upside, Nifty needs to sustain and close above these levels. 29th October could be a trend changing date in Nifty. It that happens so, one can go short for the above given targets in Nifty with closing basis stop loss of 11715 (spot level).\n\nIn the coming week, 6 Nifty Companies including Vedanta, HCL Tech, Indian Oil, Adani, Yes Bank and Dr. Reddy's Lab shall announce its Q2 earnings. So far the Q2 earnings of Nifty companies has been good.\n\nTECHNICAL LEVELS OF OTHER IMPORTANT INDICES..\n\n1. Bank NiftyClose : 29516 We may see some correction in Bank Nifty as well with downside targets of 29436 - 29364 - 29318 - 29220 - 29111 and 29025. Resistance : 29702. In our last week article we clearly mentioned Bank Nifty shall outperform Nifty's movement and that has exactly happened.\n\n2. Nifty FMCGClose : 31803 Downside Targets : 31630 - 31492 - 31354.\n\nIt is advisable for readers to keep booking profits and be selective in choosing shares at these crucial levels of Nifty.", "description": "Market Overview Analysis by Kushal Lakhani covering: . Read Kushal Lakhani's latest article on Investing.com India.", "authors": [], "top_image": "https://in.investing.com/analysis/not found", "published_at": "2019-10-28"}