{"pub": "businessinsider", "url": "https://businessinsider.com/tropical-storm-dorian-canada-damage-hurricane-2019-9", "downloaded_at": "2019-09-08 23:31:59.423408+00:00", "title": "Dorian toppled a huge construction crane and wrecked buildings in Canada despite it losing its hurricane status", "language": "en", "text": "Hurricane Dorian has been downgraded to a post-tropical cyclone since it pummeled the Bahamas and moved north along the East Coast, but it's still causing plenty of damage.\n\nAfter it made landfall as a Category 1 storm in North Carolina, Dorian moved past New England before making landfall once again in eastern Canada Sunday morning. The storm has since knocked out power for hundreds of thousands of people, toppled a huge construction crane and ripped roofs off apartments in the city of Halifax, the Associated Press reported.\n\nHurricane warnings remained in effect for parts of Nova Scotia and Newfoundland, according to the National Hurricane Center, as winds in the storm could reach up to 80 miles per hour.\n\nThe storm caused concern when it initially made landfall as a Category 2 storm and toppled a massive construction crane in downtown Halifax\n\nLocal authorities urged anyone who lived close to the seashore to evacuate as a precaution. Public Safety Minister Ralph Goodale said on Twitter that the government will deploy the military to help with recovery efforts after the storm passes.\n\nRead more: Videos show Hurricane Dorian battering North and South Carolina before the storm made landfall\n\nThe damage comes less than a week after the storm surprised Bahamians by devastating several areas. Experts initially found the storm difficult to forecast, but Dorian quickly proved to be a devastating combination for the low-lying islands as it moved at a walking pace, brewing over the islands and sending 15-20 foot storm surges that overwhelmed the communities.\n\nAt least 40 people have been reported dead in the Bahamas, and 70,000 were left homeless after the storm devastated the country's Abaco and Grand Bahama islands.\n\nRead more about Hurricane Dorian:\n\n'Our government failed us': Bahamians were left to coordinate rescue efforts on social media after Hurricane Dorian\n\nHurricane Dorian left at least 40 dead and 70,000 homeless in the Bahamas, and recovery efforts have devolved into 'chaos'\n\nBefore-and-after images of the Bahamas from space reveal Hurricane Dorian's destruction — swipe back and forth to compare", "description": "Dorian knocked out power to hundreds of thousands of people, toppled a huge construction crane and ripped roofs off apartments in the city of Halifax", "authors": ["Ellen Cranley"], "top_image": "https://amp.businessinsider.com/images/5d753257f4fc247f7c7f0372-1920-960.jpg", "published_at": "2019-09-08"}