{"pub": "reuters", "url": "https://reuters.com/article/us-asia-storm-japan-emperor/japans-pm-visits-disaster-zone-government-to-postpone-emperors-parade-idUSKBN1WW08O", "downloaded_at": "2019-10-17 08:08:45.066317+00:00", "title": "Japan's PM visits disaster zone; government to postpone emperor's parade", "language": "en", "text": "TOKYO (Reuters) - Japan’s prime minister visited communities on Thursday that were hit by a powerful typhoon, while the government said it was postponing a parade for Emperor Naruhito’s formal enthronement next week because of the disaster.\n\nJapan's Prime Minister Shinzo Abe speaks attends the conference Communication Connecting Europe and Asia, in Brussels, Belgium September 27, 2019. REUTERS/Francois Lenoir\n\nTyphoon Hagibis killed at least 77 people last week when it lashed wide swathes of Japan with heavy rain and powerful wind, setting off landslides and widespread flooding as rivers burst their banks. Nine people are missing and 346 were injured.\n\n“We’ll do everything possible to restore your lives,” Abe told two elderly women at an evacuation centre, getting down on his knees to talk to them as they sat on blankets on the floor.\n\nAbe visited Fukushima and Miyagi prefectures, which suffered heavy damage in the storm. Both were also hard hit by a tsunami set off by a March 11, 2011, earthquake, which triggered a meltdown at a nuclear power station in Fukushima.\n\nFukushima has seen the highest number of casualties from the typhoon, with at least 28 dead as of Thursday.\n\nAbe said the government would spend 710 million yen ($6.53 million) to help with disaster relief.\n\nFinance Minister Taro Aso has said the government had 500 billion yen in reserves for disaster recovery and would consider an extra budget if needed.\n\nWith winter approaching and some parts of Fukushima seeing below-average temperatures, concern is rising about the health of people in evacuation centres, some of whom lost everything in the floods.\n\nThe Ministry of Land and Transportation said on Thursday that levees had broken in more than 100 places, and authorities warned that with heavy rains forecast for the weekend, more flooding could occur.\n\nThe government will postpone the parade celebrating the emperor’s Oct. 22 enthronement, said Yoshihide Suga, chief cabinet secretary, at a news conference, adding that new dates were still being considered.\n\nOther events connected with the enthronement will proceed as scheduled, he added.\n\n“We are looking into new dates after considering a number of issues,” Suga said. He declined to be more specific, but national broadcaster NHK said the parade would be rescheduled to Nov. 10.\n\nEmperor Naruhito is set to proclaim his enthronement in a centuries-old ceremony attended by some 2,500 people, including heads of state and other dignitaries from nearly 200 countries.\n\nThe emperor, 59, acceded to the throne in May after his father, Akihito, became the first monarch to abdicate in two centuries.", "description": "Japan's prime minister visited communities on Thursday that were hit by a powerful typhoon, while the government said it was postponing a parade for Emperor Naruhito's formal enthronement next week because of the disaster.", "authors": ["Elaine Lies", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191017&t=2&i=1441774426&w=1200&r=LYNXMPEF9G07D", "published_at": "2019-10-17"}