{"pub": "metro", "url": "https://metro.co.uk/2019/10/20/sanitary-product-brand-always-to-remove-feminine-logo-to-be-more-inclusive-10950757", "downloaded_at": "2019-10-20 13:23:39.214490+00:00", "title": "Sanitary product brand Always to remove feminine logo to be more inclusive", "language": "en", "text": "On some Always products, the Venus gender logo can be seen which some people object to (Photo by: Education Images/Universal Images Group via Getty Images)\n\nEarlier in the year, transgender campaigner Ben Saunders asked sanitary product brand Always why they include feminine logos in their packaging.\n\nAt the time, another activist who goes by Melly Bloom on Twitter made the same complaint asking why it was ‘imperative’ to have the Venus sign on their products.\n\nBoth feel that the company, owned by Proctor & Gamble, exclude transgender and non-binary people who use the items.\n\nSince both complaints were made, Always has said it will now aim to remove the signs from their packaging from December 2019, with aims to have it distributed everywhere by February 2020.\n\nMelly’s tweet to the brand read: ‘Could someone from Always tell me why it is imperative to have the female symbol on their sanitary products?\n\nAdvertisement\n\nAdvertisement\n\n‘There are non-binary and trans folks who still need to use your products too you know!’\n\nIn response to the tweet from July, the North American Customer Care Team wrote: ‘At Always, we care about the needs and preferences of our customers,’ urging Melly to get in touch.\n\nAnd now, they’ve written back to Ben saying they have taken on the advice and will be making changes. A delighted Melly has shared the letter sent to Ben on her Twitter.\n\nCould someone from @Always tell me why it is imperative to have the female symbol on their sanitary products? There are non-binary and trans folks who still need to use your products too you know! #queerandhere pic.twitter.com/G6nzSmaW39 — Melly Boom 💥 (@MellyBoomBoom_) July 12, 2019\n\nThe letter read: ‘We listened to you and our marketing team worked a solution. We are glad to inform you that as of December we will use a wrapper design without the feminine symbol.’\n\nThe note, signed from the Always team, reminded Ben that they might come across old packaging after December as distribution sometimes takes a while.\n\nIt said that the new design should be available in stores early in the new year.\n\nOh really? 😌 Finally someone got through to them. It pays for the “minority” to be heard. pic.twitter.com/Zr0yvs7dGz — Melly Boom 💥 (@MellyBoomBoom_) October 16, 2019\n\nWhile the move was praised by Melly, others felt it was somewhat problematic of the brand. The decision has polarised social media users.\n\nOne person backed the move, saying: ‘I understand that you guys love girl positivity but please understand that there are trans men that get periods, and if you could please do something about the symbol on your pad packaging, I’d be happy. I’d hate to have any trans males feel dysphoric.’\n\nAdvertisement\n\nAdvertisement\n\nBut another user felt it was eliminating femaleness, saying: ‘Why are corporates so willing to alienate their core demographic at the drop of a hat because a few people tell them that recognising female biology is ‘exclusionary’?’\n\nIn the same vein, another wrote: ‘I’m so glad and thankful that people can be who they feel they are, but it feels like [cis] women are so offensive to people, being shunned and don’t have rights!’\n\nWe’ve contacted Ben, Melly and Always for comment and will update the article if they reply.\n\nMORE: Man gets shut down after rant branding periods ‘disgusting’ and women’s ‘fault’\n\nMORE: University agrees to give out free sanitary products after student used own money to provide them\n\nMORE: Girls in primary school experience period poverty too – where are their free sanitary products?\n\nAdvertisement Advertisement", "description": "Transgender campaigner Ben Saunders asked sanitary product brand Always why they include feminine logos in their packaging.", "authors": ["Faima Bakar"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_90836022_1571576471.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-20"}