{"pub": "investing.com", "url": "https://ca.investing.com/news/stock-market-news/update-1private-equity-firm-catalyst-now-holds-about-16-of-hudsons-bay-shares-1965088", "downloaded_at": "2019-09-10 23:46:26.724431+00:00", "title": "UPDATE 1-Private equity firm Catalyst now holds about 16% of Hudson's Bay shares", "language": "en", "text": "© Reuters. UPDATE 1-Private equity firm Catalyst now holds about 16% of Hudson's Bay shares\n\n(Changes sourcing, adds background)\n\nBy Jessica DiNapoli\n\nNEW YORK, Sept 10 (Reuters) - Catalyst Capital Group Inc holds roughly 16% of Hudson's Bay Co shares after investors took part in its tender offer, bolstering the buyout firm's position against a take-private deal, according to a Canadian securities filing made on Tuesday.\n\nCatalyst said in August it had acquired about 10% of the department store retailer's stock, but had not disclosed its total holdings. The private equity firm will continue opposing a C$1.74 billion offer from Hudson's Bay's executive chairman, Richard Baker, according to the filing.\n\nReuters first reported the buyout firm's total stake Tuesday.\n\nCatalyst's total holdings are important because for any deal of Baker's to move forward, the retail executive needs support from shareholders.\n\nBaker made an offer to acquire Hudson's Bay, the owner of luxury department store Saks Fifth Avenue, in June, saying that the company was best suited to face challenges in retail as a private company.\n\nA special committee at Hudson's Bay said Baker's current offer, made with a consortium of shareholders holding 57% of the company, was \"inadequate.\"\n\nCatalyst and other shareholders including hedge fund Land & Buildings Investment Management LLC have said Baker's proposal falls short in providing sufficient value.\n\nBaker and his consortium would need roughly 21.5% of shareholders - a majority not affiliated with his deal - to approve his offer. for Baker and Hudson's Bay's special committee declined to comment. Hudson Bay itself did not immediately respond to requests for comment.", "description": "UPDATE 1-Private equity firm Catalyst now holds about 16% of Hudson's Bay shares", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB6208D_L.jpg", "published_at": "2019-09-10"}