{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/qatar-to-end-controversial-migrant-worker-restrictions ", "downloaded_at": "2019-10-16 23:44:56.145850+00:00", "title": "Qatar to end controversial migrant worker restrictions", "language": "en", "text": "[DOHA] Qatar announced plans Wednesday to scrap key aspects of its controversial \"kafala\" labour rules, including the requirement for some workers to obtain employers' permission to change jobs and exit permits to leave the country.\n\nQatar has made a series of reforms to its employment regulations since being selected to host the 2022 World Cup, which set motion a vast construction programme employing foreign workers.\n\nRights groups have long said the system fuels abuses.\n\nLast year, the exit visa requirement was dropped for the majority of workers, but the authorities are now extending that to the remainder, including domestic staff and employees of government bodies including Qatar Airways.\n\nsentifi.com Market voices on:\n\n\"Cabinet has adopted new legislation related to a new law for minimum wage and also a new regulation to facilitate labour transfer to a new employer... and a draft law to abolish exit permits,\" Labour Minister Yousuf Mohamed al-Othman Fakhroo said.\n\nThe proposals will now be drafted formally \"within a month or so\" and should become law by \"around the end of the year\", he told AFP.\n\nJust 333,000 of the country's 2.7 million people are Qatari citizens, according to official statistics.\n\nSpeaking on the sidelines of an event marking the centenary of the International Labour Organization (ILO), Mr Othman said the new regulations aimed to make Qatar \"an attractive place for investors, for skilled workers.\"\n\nHe did not specify the level of the new minimum wage, but the government had set it temporarily at 750 riyals (S$282) per month.\n\n'A START'\n\nAn Indian worker in the textiles industry, who declined to be named, said Qatar needed to do more but the move was \"definitely a start\".\n\n\"They have labour laws but how many people come forward to complain? People don't come forward because they don't want to lose their jobs,\" the worker said.\n\nSome two million foreigners work in Qatar, many employed directly or indirectly on vast infrastructure projects for the 2022 World Cup.\n\nIn February, the gas-rich Gulf state said it was committed to labour reforms, following an Amnesty International report that it was failing to stop widespread abuse of workers.\n\nDoha said it was on course to deliver \"lasting\" change after the rights group said it was \"running out of time\" to implement the reforms before the football contest.\n\nThe ILO praised Qatar for the latest \"the sweeping reforms\" and voiced hope that other countries with similar systems would follow suit.\n\n\"With these announcements we can officially announce the abolishment of kafala,\" said the head of the UN agency's Qatar project office, Houtan Homayounpour.\n\n\"It is huge news for the millions of workers who are here and the State of Qatar.\"\n\nRegional analyst and King's College London assistant professor Andreas Krieg said the reforms \"were the final step in liberalising the labour market in Qatar\".\n\n\"The Qataris feel the pressure from the international media to make changes and they really recognised this since 2017 that they have to make concessions and improvements - and they have,\" he said.\n\nAFP", "description": ": THE BUSINESS TIMES Government & Economy - [DOHA] Qatar announced plans Wednesday to scrap key aspects of its controversial \"kafala\" labour rules, including the requirement for some workers to obtain employers' permission to change jobs and exit permits to leave the country. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-10-16"}