{"pub": "politico", "url": "https://politico.com/story/2019/09/04/trump-backs-boris-johnson-brexit-1480625", "downloaded_at": "2019-09-05 00:07:13.746550+00:00", "title": "'Boris knows how to win': Trump backs Johnson amid Brexit turmoil", "language": "en", "published_at": "2019-09-04", "text": "President Donald Trump told reporters, \"Boris is a friend of mine, and he's going at it. There's no question about it.\" | Evan Vucci/AP Photo White House 'Boris knows how to win': Trump backs Johnson amid Brexit turmoil\n\nPresident Donald Trump on Wednesday expressed confidence in British Prime Minister Boris Johnson, saying that the United Kingdom’s embattled leader “knows how to win” as he faces an intraparty rebellion over his handling of the Brexit political crisis.\n\n“Boris is a friend of mine, and he's going at it. There's no question about it,” Trump told reporters in the Oval Office following a briefing on Hurricane Dorian.\n\nStory Continued Below\n\n“He’s in there. I watched him this morning. He's in there fighting,” Trump said. “And he knows how to win. Boris knows how to win. Don't worry about him. He's going to be OK.”\n\nJohnson endured a stinging defeat in the House of Commons on Tuesday night after a troop of fellow Conservative Party members voted with a majority of lawmakers to stop Johnson from yanking the U.K. out of the European Union on Oct. 31 without a deal.\n\nAppearing before members of Parliament on Wednesday, Johnson acknowledged he wanted a general election in mid-October in an effort to re-establish his mandate, after previously claiming he did not wish to have another national vote.\n\nposter=\"https://static.politico.com/f2/7f/e5fc75d54c00b03553716e940a58/a01416f4568446e69bb5c4eb0285776c\" true\n\nVice President Mike Pence, who is scheduled to meet this week with Johnson, also weighed in Wednesday on the turmoil in Westminster. Asked whether the administration stands with the prime minister, Pence responded that the United States “stands with the United Kingdom in its decision to leave” the EU.\n\nThe vice president — who spoke to reporters in Reykjavík, Iceland, hours before embarking for London — added that U.S. officials “hope to see the European Union and the United Kingdom come together around that negotiating table that Prime Minister Johnson spoke of just a few days ago and reach an agreement that will meet the needs of the aspirations of the people of the United Kingdom and also provide for an orderly Brexit.”\n\n", "description": "\"He's in there fighting,” Trump said of the embattled prime minister.", "authors": ["Quint Forgey"], "top_image": "https://static.politico.com/12/b4/317a46114ae493bf8fd0a3d3eb05/20190904-donald-trump-ap-773.jpg"}