{"pub": "yahoo", "url": "https://news.yahoo.com/yuan-falls-to-fresh-11-year-lows-morning-brief-101029343.html", "downloaded_at": "2019-09-08 13:21:21.733320+00:00", "title": "Yuan falls to fresh 11-year lows: Morning Brief", "language": "en", "text": "Thursday, August 22, 2019\n\nGet the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. Subscribe\n\nWHAT TO WATCH\n\nDick’s Sporting Goods (DKS) results will be released ahead of the opening bell. Wall Street analysts are projecting that Dick’s will report positive same-store sales growth for the first time in two years. Analysts are also predicting lowered guidance to reflect the tariffs.\n\nDick’s is expected to report second-quarter adjusted earnings of $1.20 per share on $2.21 billion in revenue, according to data compiled by Bloomberg. Same-store sales, a closely-watched metric, are expected to have risen 1.1%.\n\nAfter the market close, apparel retailer Gap (GPS) is expected to release second quarter results. The retailer is expected to report adjusted earnings of 53 cents per share, which is a decline of 30.7% from last year. Gap revenue is expected to total $4.02 billion, a decline of 1.6% from the same period last year.\n\nFinally, analysts are expecting cloud giant Salesforce (CRM) to report adjusted earnings of 47 cents per share on $3.95 billion in revenue during its second quarter. Investors will be paying attention to what the company says about how the trade war is affecting its business. The options market is implying a 6.5% move in either direction follow its report.\n\nOther notable earnings reports scheduled for today include Hormel Foods (HRL) before market open and Ross Stores (ROST) after market close.\n\nRead more\n\nTOP NEWS\n\nIn this Tuesday, Aug. 6, 2019, photo, a man walks by a money exchange shop decorated with Chinese yuan banknotes and other countries currency banknotes at Central, a business district in Hong Kong. China's yuan has weakened again after signs its decline was stabilizing helped to reassure financial markets. (AP Photo/Kin Cheung) More\n\nYuan falls to fresh 11-year lows: China's yuan fell to fresh 11-year lows on Thursday amid worries about the deepening Sino-U.S. trade war, despite support from major state-owned banks in both the spot and forwards markets. Spot yuan ended the domestic session down 0.34% at 7.0875 per dollar, its weakest such close since March 14, 2008. [Reuters]\n\nChina warns US tariffs will 'escalate trade friction’: China appealed to Washington on Thursday to \"meet each other halfway\" and settle a trade war instead of going ahead with planned tariff hikes Beijing warned will trigger retaliation. [Associated Press]\n\nSoftBank will let people invest in IPOs with less than $10: SoftBank Corp.’s brokerage unit plans to do something that may be a first in capital markets. It will allow individuals in Japan to participate in initial public offerings with as little as a 1,000-yen note (worth a bit less than a 10-dollar bill). [Bloomberg]\n\nTrump administration to appeal ruling blocking price disclosure for drug ads: The Trump administration is appealing a court ruling that struck down its plan to compel pharmaceutical companies to disclose wholesale prices of their drugs in televisions advertisements. [Reuters]\n\nMORE FROM YAHOO FINANCE\n\n'The bleeding hasn't stopped yet' for U.S. dairy farmers\n\n3 events reveal a potential ‘textbook’ of China’s information operations\n\nWhy Target is shocking everyone and putting Amazon on notice\n\nLow interest rates are giving the housing market a boost\n\nHow the company behind Smirnoff and Guinness is transforming marketing\n\nTo ensure that the Morning Brief is delivered to your inbox, please add newsletter@yahoofinance.com to your safe sender list.\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.", "description": "Top news and what to watch in the markets on Thursday, August 22, 2019.", "authors": ["Yahoo Finance"], "top_image": "https://s.yimg.com/uu/api/res/1.2/kducXyiW9pVz9gFzMUSeIQ--~B/aD0yMzMzO3c9MzUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-08/51c516e0-b9de-11e9-ae79-b4497fb04d6f", "published_at": "2019-08-22"}