{"pub": "indiatimes", "url": "https://indiatimes.com/entertainment/shehnaz-gill-s-rival-himanshi-khurana-rubbishes-reports-of-joining-bigg-boss-13-as-wild-card-entry-378416.html", "downloaded_at": "2019-10-23 10:01:03.582831+00:00", "title": "Himanshi Khurana:Shehnaz Gill's Rival Himanshi Khurana Rubbishes Reports Of Joining Bigg Boss 13 As Wild Card Entry", "language": "en", "text": "‘Main Punjab ki Katrina Kaif hoon’! That’s how Bigg Boss 13’s housemate Shehnaz Gill addresses on the show. And when she says so, Salman Khan is seemingly in awe while he laughs off at her innocence.\n\ngossipgiri.com\n\nShehnaz Gill is undoubtedly one of the most popular contestants on the show. She is the favourite of many viewers, and evicted contestants including Koena Mitra and Abu Malik think she has Salman Khan’s support too.\n\npinimg.com\n\nSo, when the news started doing the rounds that her arch-enemy outside of the Bigg Boss house, Himanshi Khurana is one of the wild card entires on Bigg Boss 13, fans were all excited to see them face off on the reality TV show.\n\nDon't Miss 781 SHARES 126 SHARES 2.4 K SHARES 5.7 K SHARES 3.3 K SHARES\n\nTwitter\n\nHowever, Himanshi Khurana has rubbished the claims. She has denied being a part of the show. She took to Instagram to share with her fans that she will not going to Bigg Boss house.\n\nBut, at the same time, she confirmed that was indeed approached for the show. Here’s why she denied the offer.\n\n\"From last few days rumours were doing round that I was going to Bigg Boss 13. So here is an official announcement from me. I am not going in Bigg Boss house as wild card contestant and I want to clear many things with my audience and national media.\"\n\n“First of all, I had a meeting with Bigg Boss team. They want me as a contestant over there for the show. But since their rules are against my values, I had avoided participation in the show. But now their rules have changed and they want me as wild card contestant, but I am jam packed with my schedule.\n\nThere are several other names including that of Hussain Kuwajerwala doing the rounds too.\n\nWho do you want to see on Bigg Boss 13 as wild card contestant? Let us know in the comments section below.", "description": "Shehnaz Gill's rival Himanshi Khurana has rubbished the claims of joining Bigg Boss 13 as wild card contestant. She has denied being a part of the show. She took to Instagram to share with her fans that she will not going to Bigg Boss house. But, at the same time, she confirmed that was indeed approached for the show. Here’s why she denied the offer.", "authors": ["Garima Satija"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/bigg_boss_1571822787_800x420.jpg", "published_at": "2019-10-23"}