{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/09/19/aoc-slavery-has-disenfranchised-dcs-statehood-and-its-time-for-that-to-change-n2553406", "downloaded_at": "2019-09-20 02:27:12.969137+00:00", "title": "AOC: Slavery Has 'Disenfranchised' DC's Statehood – And It's Time For That To Change", "language": "en", "text": "Progressive darling Rep. Alexandria Ocasio-Cortez (D-NY) on Thursday took part in a hearing about the District of Columbia and whether or not statehood should be granted. According to the freshman Congresswoman, the reason D.C. doesn't have statehood – or a voice in federal elections – is because of \"disenfranchisement\" and slavery.\n\nAOC explained that her Puerto Rican family, despite living in an American territory, never lacked the right to vote in federal elections, USA Today reported.\n\n\"I wish that upon no citizen of the United States of America,\" she said. \"Where the disenfranchisement of Puerto Ricans was rooted in the colonialist and imperialistic history that we've had in policies of the United States, the issue of D.C. statehood is rooted in a different evil in our history, which is the history of slavery in the United States.\"\n\n\"It is a profound injustice and a thick irony of our history that the people who fled here to the District of Columbia to free slavery because of the enlightenment of this community are now disenfranchised,\" she said.\n\nOcasio-Cortez took to Twitter to reiterate her position.\n\nDC was the 1st territory in the United States to free the enslaved.\n\n\n\nIt’s where Black Americans fled the tyranny of slavery & towards greater freedom, to DC. Yet today it’s where 2nd class citizenship reigns, and the right to vote is denied.\n\n\n\nIt’s time to recognize DC statehood. https://t.co/AkfaRHw38C — Alexandria Ocasio-Cortez (@AOC) September 19, 2019\n\nSpeaker Nancy Pelosi (D-CA) took to Twitter to voice her support for the bill and granting the District statehood.", "description": "Facepalm..09/19/2019 22:26:23PM EST.", "authors": ["Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/196/d9606a71-5861-4565-a541-18c22e8a8158.png", "published_at": "2019-09-19"}