{"pub": "washingtonpost", "url": "https://washingtonpost.com/nation/2019/10/15/zsolt-borkai-orgy-tape-hungary-elected-mayor", "downloaded_at": "2019-10-15 11:23:06.255214+00:00", "title": "A mayor was caught on tape having an orgy on a yacht. Days later, he was reelected.", "language": "en", "text": "It might be difficult to dream up a political crisis more scandalous than the one that recently implicated Zsolt Borkai, the mayor of Hungary’s sixth-largest city, a week before his reelection campaign was set to come to a close.\n\nBut not even a viral sex tape making the rounds on adult websites was enough to derail Borkai, the married father of two and an ally to the country’s authoritarian, right-wing prime minister, from winning another term on Sunday as mayor of Gyor, the urban center of northwestern Hungary.\n\nAD\n\nAD\n\nStill, the orgy imbroglio appeared to help force the first major loss for Fidesz, the conservative party headed up by Viktor Orbán, in the nine-plus years since the populist leader became prime minister. At least 10 of Hungary’s 23 largest cities, including the capital of Budapest, elected opposition candidates who had joined against Orbán’s populist brand of autocracy.\n\nThe “Borkai-gate” saga, as it has been called in Hungarian media outlets, began when an anonymous blogger calling himself only “the Devil’s Advocate” began putting up posts accusing a Fidesz mayor of “corrupt practices.” According to the Budapest Business Journal, the blogger — whose posts have since been taken down — claimed he had been working as a lawyer for Fidesz politicians, but quit his job after receiving threats from the party’s leadership.\n\nThen, the writer posted links to a leaked video of Borkai, 54, engaging in a cocaine-fueled orgy aboard a yacht. He and his lawyer, the blogger charged, had used government money to fund their romp on the Adriatic Sea and hire the escorts who appeared in the video.\n\nAD\n\nAD\n\nAt first, Borkai, who won gold on the pommel horse in the 1998 Olympic Games and had been mayor of Gyor since 2006, staunchly denied that the video was of him. “I consider the lies published about me to be part of an opposition campaign aimed to divert attention away from their own incompetence,” his campaign said last week in a statement to Hungary Today.\n\nBut later media reports confirmed that his attorney had indeed benefited from his ties to the mayor, who allowed him to buy farmland outside the city in 2012 through an offshore company — and for far less than market price — only to resell it at a higher value.\n\nMeanwhile, a left-wing newspaper reported that one of the young women who appeared in the sex tape had received the equivalent of nearly $10,000 in government grants to open a wedding-dress rental company with her sister.\n\nAD\n\nAD\n\nDays later, Borkai reneged: “The published recordings picturing me were made years ago,\" he told a local television station on Oct. 7, according to Hungary Today. “Some of the footage is manipulated, other parts are genuine.” Although he apologized for the tape, he still denied charges of money laundering, hiring escorts, or using cocaine.\n\nBut he still refused to resign, sending Hungary’s conservative political circles into a tailspin.\n\nThe image of a sex tape on a yacht came in sharp contrast to the ruling party’s ethos: Orbán, a staunch authoritarian who has restricted local media and railed against migration, has painted himself as a defender of Hungary’s Christian culture. He said he would punish cities that voted to abandon Fidesz, whose slogan is “God, nation, family.”\n\nAD\n\nLate last week, meanwhile, the opposition party put up posters at a Fidesz headquarters that instead read, “Public funds, cocaine, whores.”\n\nAD\n\nThe country’s pollsters were thrown for a loop, with five of them assembling a last-minute news conference on Thursday in which they retracted many of their initial predictions about local elections. With Borkai-gate now in play, it would be hard to know what would happen next. “If only it was erotica,\" one pollster remarked, “and the more tasteful kind at that.”\n\nAnd other members of Fidesz turned against Borkai. The incumbent mayor of Budapest, who was also running for reelection, called his actions “unacceptable, indefensible, and undignified.” Even an anonymous opinion piece in Magyar Nemzet, a conservative Hungarian newspaper closely tied to Orbán and his party, said the embattled mayor should resign.\n\nAD\n\n“Zsolt Borkai dumped a cartload of tacks onto the floor, and he is now forcing his own family and his fellow politicians to walk around barefoot, in blindfolds,” said the editorial, which was later taken offline, credited to a publishing error by the newspaper’s editor. “This situation could have been easily avoided. He should have stepped down days ago.”\n\nAD\n\nAfter several days of silence, Borkai himself announced an “extraordinary press conference” set for Friday evening. It was finally happening, media outlets speculated: The mayor was going to resign.\n\nThen, an hour before the news conference, he mysteriously backed out. Amid the ensuing scandal, Borkai posted a photo of him and his family on Facebook, showing the four of them standing side-by-side at a rock concert on Saturday.\n\nAD\n\n“We persevere,” the photo said, “for better or worse.\"\n\nThe following day, he won the election.\n\nFollowing Borkai’s unexpected victory, Orbán has been expected to expel him from Fidesz. As the party’s chairman, he has the final say on the matter. As of early Tuesday morning, however, the prime minister had not commented on the matter.\n\nAlmost unbelievably, Borkai was not the only mayor whose campaign was tarred by a sex-tape scandal — nor the only one to win his election this weekend in spite of such a scandal. Opposition candidate Tamás Wittinghoff, running for a mayoral post in a suburb of Budapest, also had a sex tape leaked.\n\nLoveday Morris in Berlin contributed reporting.\n\nAD", "description": "Zsolt Borkai is an Olympic gymnast and the former president of the Hungarian Olympic Committee.", "authors": ["Teo Armus", "Reporter On The Morning Mix Team"], "top_image": "https://www.washingtonpost.com/resizer/PAxgRoNoo7JlS8ejpeQM2bVY1fk=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IXNY5FWVZFCCHFU2UP557KCX5Q.jpg", "published_at": "2019-10-15"}