{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/17/recent-australian-dominance-whets-appetite-for-wbbl-season-five", "downloaded_at": "2019-10-16 21:01:38.964803+00:00", "title": "Recent Australian dominance whets appetite for WBBL season five | Megan Maurice", "language": "en", "text": "Women cricketers will strike out on their own for the first time when the new domestic Twenty20 competition begins\n\nWith the dust from the winter sport finals only just settled, cricket season is rolling into town a little earlier than fans are accustomed to. The fifth iteration of the Women’s Big Bash League begins this weekend and with the standard of the competition lifting year on year, there are plenty of reasons to be excited about its launch at North Sydney Oval on Friday.\n\nThe first four seasons of the WBBL ran parallel to the men’s competition, with many matches played as double headers. This year, Cricket Australia have made the decision that the women will strike out on their own, filling what has traditionally been a lull in sporting content between October and December.\n\n'We knew it was right': cricketers Nat Sciver and Katherine Brunt get engaged Read more\n\nIt’s a bold and exciting move from an organisation that has been fiercely supportive of their female players recently, with a new parental leave policy and a commitment to offer pay parity for the T20 World Cup announced in the past week. While the A-League and W-League competitions are peddling the old “it’s not women’s sport, it’s just sport” line, Cricket Australia has backed its female players to be the stars of their own show.\n\nWith the appeal of T20 cricket being the relatively quick and exciting games, double headers that asked fans to be at the ground for in excess of eight hours and included breaks of over two hours between matches were not sustainable. A return to the focus on quick-fire excitement will make for a much-improved fan experience.\n\nSo much of modern sport is soulless, surrounded by concrete and finished off with a $15 serving of hot chips that are indistinguishable from the cardboard box they come in. On the flipside there is the WBBL and its splendid suburban grounds, where you can happily bring a picnic from home or grab a sausage sandwich from an old-fashioned canteen – all while watching some of the world’s best cricketers put on a show on the other side of a white picket fence.\n\nAustralia’s women have been destroying all in their path in 2019. From their total dominance in the Ashes series in England, to clean sweeps against the West Indies and Sri Lanka, they have been on another level to their international opponents. It sets the stage perfectly for a domestic competition where the national team’s stars are split between the eight clubs. And unlike in the men’s BBL, all the big names are out on the field every week.\n\nCricket Australia commit to pay parity for women's World T20 Read more\n\nAlyssa Healy’s world record 148 not out against Sri Lanka in the latest T20 series will have Sixers fans eagerly anticipating her return. Meanwhile Australia captain Meg Lanning is also in stunning form and will be looking to lead her Perth Scorchers into the finals series after a disappointing fifth-place finish last season.\n\nThe epic finals series of 2018-19 will not be easily forgotten. In the jaw-dropping semis the Heat took down the Thunder on the final ball of the match with the catch of the season from Haidee Birkett. Just as the crowd were recovering from that heart-hammering workout, the Sixers and the Melbourne Renegades finished with a tie to send their match into a super over, which the Sixers eventually won. The final also came down to the last over of the day at Drummoyne Oval, with Brisbane’s Beth Mooney smashing the winning runs in a victory for the underdogs.\n\nThe WBBL is striving to be the best women’s domestic competition in the world and they are attracting some of the biggest names in the world to the league. From the Stars’ South African batter Mignon du Preez to the Thunder’s new Pakistani off-spinner Nida Dar, it is a league brimming with excitement.\n\nCricket Australia reveals ground-breaking parental leave policy for players Read more\n\nBut emerging youngsters are also making their mark after the women’s game has enjoyed growth behind the scenes at the grassroots level. With a steadily increasing participation rate across the country, six in every 10 new cricket participants are female. With each season of the WBBL there is a crop of new talent waiting in the wings, ready to push through to the elite level. Competition for places is heating up.\n\nAt 18 years of age and juggling the WBBL with Year 12 exams, Annabel Sutherland is an exciting prospect for the Melbourne Stars. Since debuting for the Renegades at just 15, she is looking to make her mark – much in the same way the WBBL as a competition hopes to as, after four seasons, it steps out of the shadow of its male counterpart.", "description": "Women cricketers will strike out on their own for the first time when the new domestic Twenty20 competition begins", "authors": ["Megan Maurice"], "top_image": "https://i.guim.co.uk/img/media/8899c21cd981273252dd61f6283b6c7a2ab04808/74_195_4671_2804/master/4671.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7778d654879834d87d24e4e8b1286365", "published_at": "2019-10-16"}