{"pub": "fox", "url": "https://foxnews.com/media/gregg-jarrett-trump-ukraine-witch-hunt", "downloaded_at": "2019-10-08 15:12:02.672752+00:00", "title": "Gregg Jarrett: Ukraine probe has morphed into the 'Nancy Pelosi-Adam Schiff witch hunt'", "language": "en", "text": "House Speaker Nancy Pelosi, D-Calif., and House Intelligence Committee Chairman Rep. Adam Schiff, D-Calif., have hijacked the Ukraine investigation and are using it as an excuse to initiate a \"witch hunt\" against President Trump, Gregg Jarrett said Tuesday on \"Fox & Friends.\"\n\n\"It absolutely is a witch hunt,\" he said. \"Instead of [a] Russian collusion witch hunt, the media and Democrats have now sort of seamlessly transitioned to the Ukrainian witch hunt. Which is really the Nancy Pelosi, Adam Schiff witch hunt.\n\n\"The fact of the matter is that the president's conversation was not a crime, it's not an impeachable offense,\" Jarrett continued. \"In the beginning, Democrats and the media said, 'oh the conversation is a crime.' Until the Department of Justice criminal division said, 'we looked at the transcript. It's not a crime. It's not a campaign violation.'\"\n\nDEMOCRATIC CONGRESSWOMAN EXPLAINS WHY OFFICIAL IMPEACHMENT VOTE HASN'T HAPPENED YET\n\nJarrett also said Democrats have subjectively accused Trump of an \"abuse of power\" to give themselves a wide berth with which to smear and demean the president before trying to remove him from office.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Democrats have embraced this amorphous concept known as abuse of power, which is nowhere in the Constitution,\" he said.\n\n\"And the trouble with that is that it's sort of shifting sands of subjective interpretation that can be abused for political reasons -- exactly what the framers did not want.\"", "description": "House Speaker Nancy Pelosi, D-Calif., and House Intelligence Committee Chairman Rep. Adam Schiff, D-Calif., have hijacked the Ukraine investigation and are using it as an excuse to initiate a witch hunt against President Trump, said Gregg Jarrett, Tuesday on \"Fox & Friends.\"", "authors": ["Nick Givas", "Nick Givas Is A Reporter With Fox News. You Can Find Him On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/schiff-jarrett-pelosi-AP-FOX.jpg", "published_at": "2019-10-08"}