{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/30/WS5db977a0a310cf3e3557484b.html", "downloaded_at": "2019-10-30 12:10:09.540844+00:00", "title": "UK goes to polls to try and sort out Brexit: China Daily editorial", "language": "en", "text": "chinadaily.com.cn | Updated: 2019-10-30 19:44\n\nAfter more than three years of political bickering and wrangling over Brexit that have deeply divided the country, the United Kingdom has arrived at what is once again being called a defining moment.\n\nPrime Minister Boris Johnson declared it was time to unite the country and get Brexit done after he won a vote in the House of Commons to call an early general election by a convincing vote of 438 to 20.\n\nTo be held on Dec 12, two and a half years ahead of the next scheduled election in 2022, it will be the first December election in the country for nearly 100 years, and it is being taken as another sign heralding that the Brexit impasse is about to be broken.\n\nJohnson returned from Brussels earlier this month with a new deal, and surprised everyone by ushering the bill past its first hurdle in Parliament. And with polls showing people are becoming increasingly fed up with the whole sorry mess, it is being predicted that his Conservative Party will win the election convincingly, as many voters believe he will finally bring to an end the unedifying squabbling over how, or indeed whether or not, to leave the European Union.\n\nBusinesses and much of the public alike are at their wits end with the divorce stuck in limbo. But even with popular sentiment now predominantly swinging toward let's move on after three years that have cast a shadow over the country's economic prospects and left the nation deeply divided, it remains to be seen whether Johnson can secure a majority in Parliament.\n\nAfter all, ditches have been dug all over the country after he failed to meet the Oct 31 deadline, having declared he would rather be \"dead in a ditch\" than have to accept an EU extension, showing that there are many he needs to win over.\n\nAlso getting fed up with the Brexit uncertainty is the EU. Now that the bloc has agreed to delay Brexit for another three months — already the third postponement — European Council President Donald Tusk tweeted on Tuesday he hopes this extension will be the last, imploring Britain to \"Please make the best use of this time\".\n\nThe rest of the world, too, would like Britain to use the time well. For as well as inflicting irreparable damage on Britain's claim to be the cradle of democracy, the will-it won't-it drama has been another weight dragging on the global economy, which needs all the buoyancy it can muster given the ongoing altercation between the two largest economies.", "description": "After more than three years of political bickering and wrangling over Brexit that have deeply divided the country, the United Kingdom has arrived at what is once again being called a defining moment.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/30/5db977a0a310cf3e97a39758.jpeg", "published_at": "2019-10-30"}