{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-usa-fed-repo-graphic/graphic-repo-ructions-then-and-now-idUKKBN1W815R", "downloaded_at": "2019-09-23 11:58:31.314296+00:00", "title": "Graphic: Repo ructions - Then and now", "language": "en", "text": "NEW YORK (Reuters) - Investors were jolted last week when rates in an obscure part of the U.S. lending market spiked, prompting fears of bigger problems for the financial market and broader economy.\n\nFILE PHOTO: Federal Reserve Board building on Constitution Avenue is pictured in Washington, U.S., March 19, 2019. REUTERS/Leah Millis/File Photo\n\nCash available to banks for their short-term funding needs all but dried up early last week, and borrowing costs in the $2.2 trillion repurchase agreement - or repo - market soared as high as 10% at one point on Tuesday, about four times the Federal Reserve’s policy rate.\n\n(Graphic: U.S. repo rate, here)\n\nOn Tuesday, in a first since 2008, the “effective” or average interest rate in the federal funds market, which the Fed aims to influence, settled above the top-end of the Fed’s current range of 2.25%, at 2.30%. Investors worried that the Fed may be losing control of its own interest rate.\n\n(Graphic: Fed funds rate vs Fed's target range, here)\n\nThat forced the Fed to inject hundreds of billions of dollars in temporary cash into the banking system the past few days, its first major market intervention since the financial crisis more than a decade ago, to prevent borrowing costs from spiralling even higher.\n\nIt has also revived memories of how ructions in the repo market were a symptom of funding problems for investment banks in 2008.\n\nMuch has changed, however, since the last time the repo rate was the buzz of Wall Street.\n\nSECURED VS UNSECURED RATES:\n\nA key difference between now and 2008 is the reason for the spike in the repo rate. In 2008 it was mostly about rising counter-party risk, effectively the fear among banks that they would not be paid back, that upended the market.\n\nThis latest jump in the repo rate, though, is likely due to a confluence of more technical factors, including quarterly corporate tax payments and settlement on $78 billion in Treasury notes and bonds on Sept. 16 that led to a severe drop in cash for wholesale lending, analysts said.\n\nWhile the repo rate - which uses Treasuries as collateral - seized up this week, the three month U.S. Dollar LIBOR interest rate - the average interest rate at which a bank can get unsecured funding from another bank - has stayed in check.\n\n(Graphic: U.S. repo rate & dollar 3-month LIBOR, here)\n\nTHE TED SPREAD\n\nThe TED spread, which warns investors of potential market downturns and volatility, is not flashing caution. The spread, which measures the difference between the rates on 3-month Treasury bills US3MT=RR and 3-month LIBOR, widens in periods of financial stress, as it did in 2008.\n\nRight now, though, the spread is the narrowest it has been in nearly a decade, pointing to investor confidence in the U.S. financial system.\n\n(Graphic: TED spread, here)\n\nBANK RESERVES\n\nPart of the reason why the repo rate exploded higher last week was due to the scarcity of bank reserves - deposits that commercial banks park at the Fed, analysts said.\n\nWhen banks reserves are low they have less to lend out to liquidity-starved investors.\n\n(Graphic: Bank reserves at the Fed, here)\n\nBanks have seen their reserves fall due to the U.S. central bank shrinking its balance sheet over the last two years. This means they have less to lend to other banks as liquidity dries up.\n\n(Graphic: The Federal Reserve's balance sheet, here)\n\nDEALERS’ HOLDINGS\n\nPrimary dealers’ Treasury holdings have grown from nearly nothing in 2008 to about $200 billion as government borrowings ballooned over the last decade. Dealers need to fund these inventories, which may be putting pressure on the repo market.\n\n(Graphic: U.S. primary dealers' Treasury holdings, here)", "description": "Investors were jolted last week when rates in an obscure part of the U.S. lending market spiked, prompting fears of bigger problems for the financial market and broader economy.", "authors": ["Saqib Iqbal Ahmed", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190923&t=2&i=1432924697&w=1200&r=LYNXMPEF8M0RG", "published_at": "2019-09-23"}