{"pub": "abcnews", "url": "https://abcnews.go.com/International/wireStory/suicide-bomb-southern-afghanistan-kills-20-65710757", "downloaded_at": "2019-09-19 09:39:30.511577+00:00", "published_at": "2019-09-19", "title": "Governor: Suicide bomb in southern Afghanistan kills 20", "language": "en", "text": "A powerful suicide truck bomb devastated a hospital in southern Afghanistan early Thursday morning, killing 20 people and wounding 97 others, according to the province's governor, while a deadly drone strike in the country's east was blamed on U.S. forces.\n\nInterested in Afghanistan? Add Afghanistan as an interest to stay up to date on the latest Afghanistan news, video, and analysis from ABC News. Add Interest\n\nThe Taliban, who claimed responsibility for the suicide bombing, have carried out nearly daily attacks since peace talks with the United States collapsed earlier this month.\n\nThursday's massive explosion destroyed part of the hospital in Qalat, the capital of southern Zabul province, and left a fleet of ambulances broken and battered.\n\nLocal residents, many of whom had come to see their sick family members, used shawls and blankets to carry the wounded inside the destroyed building, while authorities scrambled to take the worst of the wounded to hospitals in nearby Kandahar.\n\nHours earlier, a drone attack in eastern Afghanistan's Nangarhar province blamed on U.S. forces killed at least 16 and wounded tens of others, most of them civilians, said Jawaid Zaman, presidential adviser on tribal affairs.\n\nThe U.S. forces in Afghanistan said they carried out a strike in eastern Nangarhar targeting Islamic State positions in the area.\n\n\"We are aware of allegations of the death of non-combatants and are working with local officials to determine the facts,\" said Col. Sonny Legget, U.S. Forces-Afghanistan.\n\nAngry residents of the area where the strike occurred carried 12 of the bodies to the provincial capital Jalalabad Thursday morning protesting the attack, said provincial council head Ahmad Ali Hazrat. Many more people are believed to be missing.\n\nAttaullah Khogyani, spokesman for the provincial governor, also said the target was Islamic State group militants who are in the area.\n\nBut according to Zaman the local residents had provided prior notice to the local authorities that they would be collecting dried fruit. As many as 50 people were in the fields when the aerial attack occurred, he said.\n\nMeanwhile in southern Zabul province, Governor Rahmatullah Yarmal said the death toll was 20 with many of the 97 injured in critical condition. There were contradictory figures of the dead and wounded in the early hours immediately after the 6 a.m. suicide truck bombing.\n\nMorning prayers had just finished when worshippers were stunned by the ear-splitting blast that destroyed parts of a mosque adjacent to the hospital and the hospital building, said Mahboob Hakimi, a resident of Qalat.\n\nWindows in his home nearly two kilometers (over one mile) away were shattered by the blast, he said.\n\nA Taliban spokesman, Zabihullah Mujahed, said in a tweet the target was a nearby intelligence office, which he claimed was destroyed and \"tens of intelligence operatives killed/wounded.\"\n\nProvincial council chief Atta Jan Haqbayan said the wall of the National Security Department (NDS) building was damaged. He couldn't say whether any personnel were among the casualties.\n\nGov. Yarmal said many of the dead and wounded were women and children. On Twitter, an Afghan National Security Forces personnel posted a picture of a six-month-old child saying they were searching through the rubble for the parents and sought the public's help.\n\nPresident Ashraf Ghani's spokesman, Sediq Sediqqi, condemned the attack in Zabul, tweeting that the Taliban \"continue to target civilians while their leaders travel to Iran and Russia,\" a reference to the Taliban negotiators recent forays seeking support abroad.\n\nThe U.N. Security Council condemned the continuing high number of attacks in Afghanistan in recent weeks, including Thursday's attack in Qalat that the Taliban claimed responsibility for, \"in the strongest terms.\"\n\nThe U.N.'s most powerful body stressed that \"further violence must stop\" and strongly condemned \"the heinous and cowardly terrorist attacks in Kabul and against an election campaign rally in Charikar, Parwan province, on Sept. 17.\"\n\nA council statement \"underlined the need to hold perpetrators, organizers, financiers and sponsors of these reprehensible acts of terrorism accountable and bring them to justice.\"\n\nThe violence has further rattled the country as it prepares for national elections later this month. Two separate bombings on Tuesday, including one that targeted Afghan President Ashraf Ghani's election rally, killed 48 people, mostly civilians. The Taliban took responsibility for both attacks.\n\nSuhail Shaheen, the Taliban's spokesman for their political office in the Middle Eastern state of Qatar, said in a tweet that a cease fire had been part of a U.S.-Taliban deal before President Trump declared it \"dead.\" He did not elaborate and earlier defended Taliban attacks prior to an agreement signing, saying both sides in the conflict had carried out attacks.\n\nMeanwhile, former Afghan President Hamid Karzai made an appeal to the Taliban to end their attacks and to negotiate with Afghans, saying that the country can construct its own peace deal without the U.S. and ask for American troops to leave.\n\nThe former president has been a strong and consistent critic of U.S. air strikes and night raids.\n\nKarzai was speaking to local reporters invited to his home in the Afghan capital. He was critical of U.S. airstrikes and of Ghani's decision early in his tenure to sign a forces protection agreement with the U.S., saying it gave Americans immunity from Afghan civilian deaths.\n\nKarzai was a vocal critic of the so-called Bilateral Security Agreement during his time in office, refusing to sign it.\n\nThe former president, whose press meeting was televised, opposed upcoming polls saying, \"elections can only happen in an independent, peaceful country, not now.\"", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/WireAP_515d679163ba460fad99f59b451bf6b4_16x9_992.jpg"}