{"pub": "hotair", "url": "https://hotair.com/archives/ed-morrissey/2019/10/22/thr-will-chinas-influence-hollywood-block-no-safe-spaces-theaters", "downloaded_at": "2019-10-23 12:18:02.630506+00:00", "title": "THR: Will China’s influence in Hollywood block No Safe Spaces from theaters?", "language": "en", "text": "Surprisingly, the answer to this question appears to be no … for now. The upcoming documentary No Safe Spaces by comedian Adam Carolla and my friend and colleague Salem* Radio host Dennis Prager opens on Friday. The Hollywood Reporter’s Paul Bond writes that its distributor is thus far succeeding in adding “hundreds” of more screens for the free-speech film, thanks in large part to the NBA’s craven surrender to China:\n\nCapitalizing on the controversy swirling around China, which censors the internet and Hollywood movies, a documentary film from comedian Adam Carolla and talk-show host Dennis Prager that tackles free speech is beefing up its theatrical distribution plans. On Monday, The Hollywood Reporter obtained two exclusive clips from the movie, called No Safe Spaces, that directly take on China. They are a couple of risky scenes, given China-owned AMC Entertainment is set to exhibit the film in several of its theaters early in the film’s distribution pattern. “Free speech is unique to the United States; in Russia and China you go to jail if you say anything nice about gay people,” Carolla says in one clip. In another, a cartoon character dubbed Firsty sings, “I’m the First Amendment; without me you’d be living in China,” in a scene meant to invoke images of a protester who stood down a tank in Tiananmen Square in 1989.\n\nCarolla and Prager have been working on No Safe Spaces for a considerable amount of time, long before the NBA scandal erupted. Now that it has, however, both the NBA and Hollywood have gotten mighty defensive about their relationships with Beijing and the Xi government as critics scrutinize it more closely. That makes their documentary even more timely, but it also appears to put its distribution on a collision course with China’s economic power:\n\nNo Safe Spaces was to screen a couple of times in Harkins Theatres in Phoenix on Oct. 25 then slowly roll out from there, but Harkins added several screenings and the distributor, Atlas Distribution, says it has been scrambling to get wide more quickly by booking hundreds more theaters, including many owned by AMC. Dalian Wanda Group purchased AMC for $2.6 billion in 2012, making China’s largest private company also the worldwide leader in theater chains.\n\nThat’s one aspect of China’s influence on the American film that has gone largely unnoticed. There has been plenty of discussion in the wake of the NBA’s craven retreat from Beijing about how access to the box office in China impacts and influences how films are written and produced. Studios, especially those involved in big-budget films, tend to adapt storylines around China’s sensibilities, with some efforts much less subtle than others.\n\nThis information points to another subtle influence — access to American theaters. Bond describes Dalian Wanda Group as a “private” company in China, but just how “private” any company in China’s communist-controlled economy can be is an open question. The Xi regime had no problem using regulators to yank back on Dalian Wanda’s leash a couple of years ago when they thought the company was getting a little too global for their tastes. One has to wonder whether Beijing will exercise that same sort of oversight when it comes to running films critical of China. So far so good, Bond reports, but it might not stay that way.\n\nNo Safe Spaces isn’t primarily about China anyway, as the Christian Post noted last week. It focuses much more on the way political correctness in the US has morphed into flat-out censorship and fascism, especially on college campuses:\n\nIn “No Safe Spaces,” comedian and podcast record-breaker Adam Carolla teams up with popular radio talk show host and author Dennis Prager to travel the country exploring how relevant the First Amendment is today on college campuses and across the U.S. The two men also talk to progressive and conservative experts and explore their own upbringings to highlight the intolerance in America today. “What’s happening now in the United States is you are not to be heard on a college campus or at your place of work, this is brand new,” Prager says in the film.\n\nHere’s just one of the stories told by Carolla and Prager:\n\nDennis and I will be at an AM 1280 The Patriot event this evening in the Twin Cities to discuss the film as well as many other issues. Larry Elder, another of my Salem Radio colleagues and friends, will join us on stage. The main event will take place at 7 pm CT, so if you’re in the Twin Cities, drop by and see us.\n\nBy the way, NBA commissioner Adam Silver still insists that engagement is the way to go with China, and indeed that the league has “no choice” in that regard. Jim Geraghty wonders what would change his mind from that conclusion:\n\nSilver’s attempt to reframe the discussion in terms of “isolationism” term is an inartful dodge. No one’s complaining about the NBA’s programs in Senegal, the Philippines, the Czech Republic, Argentina, Bahrain, or Canada. (The Portland Trail Blazers did end their sponsorship with a rifle scope manufacturer who has contracts with the Israeli military, but the team insists it has nothing to do with anti-Israel protests.) The current controversy has nothing to do with NBA exhibition games in Japan, or Vancouver, or Mumbai, or foreign players on NBA rosters. This isn’t about abstract “isolationism,” this is about how the NBA, its coaches, and players instantly went quiet about Chinese human-rights abuses as soon as it became clear that speaking out would jeopardize the league’s lucrative deals in that country. Nor is Silver’s description of “attempt a better understanding of other cultures” particularly accurate. This isn’t a divide over cultures, this is a divide over government policy. The Chinese government is currently cracking down on protesters in Hong Kong through violent means, and Houston Rockets general manager Daryl Morey wrote one tweet about it. The Chinese government responded with full-spectrum outrage. The Chinese government believes that no one in the NBA should criticize their policies, and the NBA players, coaches, and league officials appear to agree. When Laura Ingraham tells the players to “shut up and dribble” in response to criticism of Trump, the league and its players are defiant. When Xi Jinping effectively says the same through policy choices and state media, the league and its players meekly acquiesce. … What would Silver have to see to conclude that the NBA’s partnerships in China are no longer worth pursuing? … We never seem to reach the point where advocates say, “oh, no, wait, we were wrong, this approach isn’t working at all.”\n\nProbably at the same point as those sweet, sweet Chinabucks stop flowing to Silver and the rest of the NBA. And, for that matter, to Hollywood. Let’s hope No Safe Spaces can get onto those screens without Beijing’s bowdlerization.\n\nNote: For full disclosure, Hot Air is owned by Townhall Media Group, a subsidiary of Salem Communications. Dennis and I have known each other for years and have participated in many events together, including tonight’s event in the Twin Cities. No one at TMG or Salem participated or directed in the writing of this post. Other than me, of course.", "description": "Plus: NBA commish says \"we have no choice but to engage...\"", "authors": ["Ed Morrissey", "John Sexton", "Karen Townsend", "Jazz Shaw"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/10/no-safe-spaces.png", "published_at": "2019-10-22"}