{"pub": "yahoo", "url": "https://sports.yahoo.com/week-ahead-down-stretch-come-175502679.html", "downloaded_at": "2019-09-20 23:12:55.754143+00:00", "title": "Week Ahead: Down the Stretch We Come", "language": "en", "text": "For many pitchers returning from major arm injuries midseason, the remainder of the year is more of a ramp up for their next full season. Padres right-hander Dinelson Lamet looks like he’s at full strength already.\n\nLamet missed all of 2018 following Tommy John surgery, but finally returned to the Padres in early July. There have been some hiccups in his 13 starts since returning, though he’s really come into his own lately. Featuring a fastball-slider combo that’s nearly unhittable, Lamet had arguably his best start of the season this week when he fanned 14 Brewers in only six innings. It was his third double-digit strikeout game this year.\n\nAlways a high strikeout pitcher in the minors, there was some thought Lamet would need to shift to the pen because of his lack of a third pitch. That anxiety was unfounded, as he’s fared very well as a starter with a 12.6 K/9 that trails only Gerrit Cole, Chris Sale, and Max Scherzer among starters. Lamet’s ERA metrics also show slightly better expected results than his still-strong 3.84 ERA.\n\nScroll to continue with content Ad\n\nAnother good sign for Lamet has been his slight uptick in velocity since returning, with a fastball averaging 96 mph, ranking 13th among starters. Lamet’s ERA and strikeout rate have improved with each month so far, another good sign indicating hitters still aren’t able to adjust to his elite two pitches.\n\nLamet is set to cap off his great second half with a two-start week vs. the Dodgers and at Arizona. Those matchups could be more favorable, but Lamet’s late-season ascension should keep him in fantasy lineups to close out the year and make him a popular name entering 2020.\n\nStory continues\n\n-Blake Snell had a successful return from the injured list this week, albeit very abbreviated. He threw only 26 pitches over two innings against the Dodgers. The results were encouraging, but Snell is still clearly building back strength with velocity that was down slightly and limited use of his secondary pitches. Snell could have a two-start week ahead as the Rays try to secure a Wild Card spot, and it will be interesting to see how hard the team pushes him this week as they try to extend their season. He’s certainly usable based on his strong return this week but should probably be treated more like a relief pitcher who is unlikely to throw five innings and qualify for a win.\n\n-One of the centerpieces of the return for Edwin Diaz and Robinson Cano, Justin Dunn is getting a late-season cup of coffee in the Mariners starting rotation. He failed to make it out of the first inning in his debut but was better vs. a poor Pirates lineup on Wednesday. The M’s have held Dunn under 40 pitches, so he’s not much of an option despite a possible two-start slate next week, but could be worthy as a keeper stash after an outstanding year at Double-A with a 3.55 ERA and 158/39 K/BB in 131.2 innings at Double-A.\n\n-This has not only been the year of the home run but also the year of the groundball pitcher, considering the success of some of the league’s top groundball specialists such as Dallas Keuchel, Dakota Hudson, and Marcus Stroman. One groundball pitcher who has emerged quietly is Brewers right-hander Adrian Houser, who has a 3.83 ERA in 103.1 innings between starting and relief this year, along with an elite 54% groundball rate. Although manager Craig Counsell has exercised a quick hook with Houser, he’s been a valuable piece of a banged up rotation late this year and has a 3.18 ERA over his last eight outings. The success has been somewhat surprising after posting an ERA above 5.00 in the minors last season, but he has a chance to help fantasy owners over the last week as a two-start pickup, albeit with his final outing at Coors Field.\n\n-If your league is coming down to the wire in the final week, don’t forget about the possibility of Game 163. It will be in play if there’s a tie atop the NL Central or for a Wild Card spot. Teams it could impact include Oakland, Cleveland, Tampa Bay, St. Louis, Chicago, Milwaukee, and Washington. Starting pitchers like Brett Anderson, Shane Bieber, Charlie Morton, Jack Flaherty, Kyle Hendricks, Jordan Lyles, and Anibal Sanchez at least have the remote prospect of an extra start that could make-or-break final fantasy baseball standings.\n\nGoing Twice…\n\nNotes: Probable pitchers as of Friday, September 20, and are subject to change.\n\nAmerican League\n\nStrong Plays\n\nGerrit Cole: @SEA, @LAA\n\nMike Clevinger: @CHW, @WAS\n\nJake Odorizzi: @DET, @KC\n\nDecent Plays\n\nBlake Snell: BOS, @TOR\n\nHomer Bailey: @LAA, @SEA\n\nDylan Bundy: @TOR, @BOS\n\nAt Your Own Risk\n\nKolby Allard: BOS, NYY\n\nClay Buchholz: BAL, TB\n\nSpencer Turnbull: MIN, @CHW\n\nJhouyls Chacin: @TB, BAL\n\nDillon Peters: OAK, HOU\n\nRoss Detwiler: CLE, DET\n\nJustin Dunn: HOU, OAK\n\nNational League\n\nStrong Plays\n\nPatrick Corbin: PHI, CLE\n\nMax Scherzer: PHI, CLE\n\nAaron Nola: @WAS, MIA\n\nNoah Syndergaard: MIA, ATL\n\nDinelson Lamet: LAD, @ARI\n\nDecent Plays\n\nMarcus Stroman: MIA, ATL\n\nAdam Wainwright: @ARI, CHC\n\nMadison Bumgarner: COL, LAD\n\nZach Eflin @WAS, MIA\n\nCaleb Smith: @NYM, @PHI\n\nSandy Alcantara: @NYM, @PHI\n\nAlex Young: STL, SD\n\nJon Lester: @PIT, @STL\n\nAdrian Houser: @CIN, @COL\n\nAt Your Own Risk\n\nTim Melville: @SF, MIL\n\nStreamer City\n\nThe following pitchers are generally available in over 50 percent of fantasy leagues and have favorable match-ups this week:\n\nAmerican League\n\nTuesday, September 24: Anthony Kay vs. BAL\n\nKay’s early results have been mixed, but he performed well at Baltimore in his last start (two runs allowed in four innings) and gets a slightly more favorable assignment facing them at home. Baltimore has the 10th worst OPS in MLB vs. lefties (.737).\n\nWednesday, September 25: Brett Anderson @ LAA\n\nAnderson doesn’t fan enough batters to really help in shallow leagues but has a nice matchup to finish off his year vs. the Angels. He’s allowed just three earned runs over 18.2 innings in three starts against Los Angeles, who are now without Mike Trout and Shohei Ohtani.\n\nSaturday, September 28: Martin Perez @ KC\n\nPerez caps off his year at KC, the worst hitting lineup in the AL against lefties (.686 OPS). The favorable matchup against opposing starter Glenn Sparkman also increases his win chances.\n\nNational League\n\nThursday, September 26: Chase Anderson @ CIN\n\nEven despite the late-season contributions of Eugenio Suarez, Aristides Aquino, and Freddy Galvis, the Reds are still 19th in OPS against right-handers. Anderson has allowed two or fewer runs in four of his last five outings.\n\nThursday, September 26: Tyler Beede vs. COL\n\nBeede’s overall numbers are nothing to get excited about, but he’s thrown consecutive scoreless starts and allowed a total of four earned runs in his last four outings. This is a great opportunity against a Rockies lineup with a .672 OPS on the road.\n\nFriday, September 27: Vince Velasquez vs. MIA\n\nThe inconsistency that has been Velasquez’s career has continued this season, and that inconsistency has included some hot and cold performances against the Marlins. It’s tough not to use him, with Miami holding the lowest OPS in MLB vs. right-handers (.661).\n\nTotal Games\n\nAmerican League\n\n5: KC, NYY\n\n6: BAL, CLE, HOU, LAA, MIN, OAK, SEA, TB, TEX, TOR\n\n7: BOS, CHW, DET\n\nNational League\n\n5: ATL\n\n6: ARI, CHC, CIN, COL, LAD, MIL, PIT, SD, SF, STL\n\n7: MIA, NYM\n\n8: PHI, WAS\n\nThe Infirmary\n\nHere’s some injuries to prominent players from the last week, and other players to watch for in the coming week. You can get a full listing of injured players at Rotoworld's Injury Page .\n\nNick Ahmed: Day-to-day (hand)\n\nJosh Bell: Day-to-day (groin)\n\nDellin Betances: Out for the season (Achilles)\n\nMookie Betts: Day-to-day (foot)\n\nBo Bichette: Day-to-day (head)\n\nGarrett Cooper: Status uncertain (knee)\n\nDylan Covey: Status uncertain (shoulder)\n\nCharlie Culberson: Out for the season (face)\n\nCorey Dickerson: Out for the season (foot)\n\nFreddy Galvis: Day-to-day (knee)\n\nDomingo German: Out indefinitely (suspension)\n\nLucas Giolito: Out for the season (lat)\n\nCole Hamels: Day-to-day (shoulder)\n\nAaron Judge: Day-to-day (shoulder)\n\nJason Kipnis: Out for the season (wrist)\n\nKetel Marte: Day-to-day (back)\n\nJ.D. Martinez: Day-to-day (groin)\n\nJeff Mathis: Day-to-day (back)\n\nLuis Rengifo: Out for the season (hand)\n\nJean Segura: Day-to-day (hamstring)\n\nSam Travis: Day-to-day (head)\n\nBlake Treinen: Out for the season (back)\n\nMike Trout: Out of the season (foot)\n\nFelipe Vazquez: Out for the season (legal)\n\nKolten Wong: Status uncertain (hamstring)", "description": "Seth Trachtman looks at two-start pitchers for the final week of the MLB season, including Padres flamethrower Dinelson Lamet. (Getty Images)", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/7JSM2M6hKQQAgPegXm6zig--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTguOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/28vKVZLtzZLIcUEqgS_npg--~B/aD0xMTMyO3c9MjAxNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/rotoworld.com/33f158a3516edf52d80b4fe98a891e18", "published_at": "2019-09-20"}