{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7540069/MasterChef-Australia-new-judges-replacing-Gary-Matt-George-MasterChef-Australia.html", "downloaded_at": "2019-10-05 12:36:20.647184+00:00", "title": "MasterChef Australia: new judges replacing Gary, Matt and George on MasterChef Australia", "language": "en", "text": "Gary Mehigan, Matt Preston and George Calombaris wrapped up their judging and hosting duties on MasterChef Australia earlier this year.\n\nAnd it seems Channel 10 will soon announce who their replacements will be, according to the Herald Sun.\n\nA spokesperson from Channel 10 told the publication: 'The identity of the new MasterChef judges is a hot topic and we welcome speculation. Sit tight, their identities will be revealed very soon.'\n\nGuess who (might) be coming to dinner! With Gary Mehigan, Matt Preston and George Calombaris leaving MasterChef Australia earlier this year it seems Channel 10 will imminently announce their replacements (Pictured: Food writer Melissa Leong)\n\nDaily Mail Australia has approached the network for comment.\n\nRumoured to be taking over the roles are 2012 MasterChef Australia winner Andy Allen, celebrity chef Jock Zonfrillo, and food writer Melissa Leong.\n\nAndy Allen won season four of the competitive cooking show, beating out Audra Morrice and Julia Taylor.\n\nThe former electrician now works as the head chef of Sydney's Three Blue Ducks, which he also co-owns.\n\nBack on the scene: MasterChef 2012 winner Andy Allen is expected to be named as one of the new judges of the new season of the competitive cooking show\n\nEsteemed food writer Melissa Leong was also tipped to join the panel.\n\nThe food critic has been featured on Australian Gourmet Traveller, Restaurant Guide and Time Out Sydney.\n\nShe was also a judge on SBS's competitive cooking show The Chefs' Line, which makes her a likely candidate for on the revamped MasterChef Australia.\n\nCulinary prowess: Rounding out the third judging spot could potentially be Jock Zonfrillo, who was a former heroin addict, trained under the rigors of celebrity chef Marco Pierre White\n\nRounding out the third judging spot could potentially be Jock Zonfrillo, who was a former heroin addict, trained under the rigors of celebrity chef Marco Pierre White.\n\nBack in 2018, he told the Good Food Guide: 'If it wasn't for food I would have died... Luckily for me, I somehow fluked upon cooking.'\n\nKnown for his brand of culinary prowess as the head chef of the award-winning Orana restaurant in Adelaide it looks like he could be headed to front the hit reality cook show.", "description": "Gary Mehigan, Matt Preston and George Calombaris wrapped up their judging and hosting duties on MasterChef Australia earlier this year.", "authors": ["Alisha Buaya For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/06/19324148-0-image-a-17_1570252173832.jpg", "published_at": "2019-10-05"}