{"pub": "townhall", "url": "https://redstate.com/elizabeth-vaughn/2019/09/23/astonishing-transformation-scott-presslers-group-cleaned-l.a.-homeless-camp-9-hours-removed-50-tons-garbage", "downloaded_at": "2019-09-23 11:54:33.905167+00:00", "title": "Astonishing Transformation: Scott Pressler’s Group Cleaned Up L.A. Homeless Camp In 9 Hours; Removed 50 Tons of Garbage", "language": "en", "text": "Screen Grab: Scott Presler’s before photo. https://twitter.com/ScottPresler/status/1175423027661557761?\n\nConservative activist Scott Presler continued to deliver on his pledge to clean up Democrat-led cities across the country. He tackled his biggest project yet on Saturday. Wearing hazmat suits, he and a group of 200 volunteers spent nine hours removing 50 tons of garbage from an L.A. homeless camp. The photographs show a remarkable transformation.\n\nIn the video below, Presler shows what the camp looked like before they went to work.\n\nNine hours later, the results speak for themselves.\n\nThis is one of the proudest moments of my life. I’ll never forget the day we cleaned up a homeless camp in LA. #LosAngelesCleanup pic.twitter.com/jTetowuLAu — #ThePersistence (@ScottPresler) September 21, 2019\n\nImagine if the left spent less time crusading for the rights of migrants crossing into the U.S. illegally and more time solving the problems of American citizens requiring assistance.\n\nIt’s not hard. Presler shows us what it takes. Why have the leaders of these largely Democrat controlled cities ignored the problem for so long and allowed conditions to deteriorate to such hazardous levels? There are common sense solutions to these problems if liberals would stop crying about conditions at the border and act.\n\nAs Presler says, #StopTalkingStartDoing.\n\nThe federal govt has to step in here. Closed military bases could be used for temporary housing, drug rehab and mental health counseling—we should spend our money on Americans in need FIRST. https://t.co/UO04uYWrRY — Laura Ingraham (@IngrahamAngle) September 21, 2019\n\nPresley told reporters, “The highlight of the day was when a homeless woman said to me, ‘Thank you for keeping your promise.’”\n\nHis next project will be a third cleanup in Baltimore scheduled for October 5th.", "description": "Astonishing Transformation: Scott Pressler’s Group Cleaned Up L.A. Homeless Camp In 9 Hours; Removed 50 Tons of Garbage", "authors": ["Elizabeth Vaughn", "Alex Parker", "Cindy Simpson", "Sister Toldjah", "Posted At Am On September"], "top_image": "https://www.redstate.com/wp-content/uploads/2019/09/Screen-Shot-2019-09-23-at-6.11.18-AM.png", "published_at": "2019-09-23"}