{"pub": "guardian", "url": "https://theguardian.com/football/2019/oct/18/manchester-united-job-not-too-big-ole-gunnar-solskjaer", "downloaded_at": "2019-10-19 10:59:42.315199+00:00", "title": "Manchester United job is not too big for me, says Ole Gunnar Solskjær", "language": "en", "text": "After a quip about a packed media room being “noisy”, Ole Gunnar Solskjær was asked whether being Manchester United manager was too much for him.\n\nHis side have nine points from eight league matches before Liverpool’s visit on Sunday, so the question addressed a sizeable issue. Solskjær’s response was to laugh. “No, I’ve never felt it’s too big for me,” he said. “I’m confident in what we’re trying to do and I’m confident in my staff. The coaching and what’s happening here every single day, I’ve been so impressed. The improvement is there to see for us but it’s about results: start winning games, start scoring goals. We need to create more chances because at the back we’ve looked solid.\n\n“But we haven’t been adventurous enough, taking enough risks. If you watch the best teams they take more risks with the ball, they make more runs in behind and that’s part of the process for the boys. When they’re losing confidence maybe they want to play it a bit more safe but it’s not safety that does it here – at this club you do take risks.”\n\nOle Gunnar Solskjær needs more time and respect at Manchester United | Rob Smyth Read more\n\nThe surprise has been just how flat United have looked. Solskjær started the season promising vibrant play but the defeat at Newcastle United before the last international break again lacked spark. The team there were without Paul Pogba, Anthony Martial and Jesse Lingard. Pogba remains injured and it is not certain the other two will be fit to face Liverpool.\n\n“Of course, when you lose the majority of your creativity that we started [the campaign] with, you’re going to struggle to create as many chances as you’d like,” Solskjær said. “Against Newcastle we had 75% possession but [we] can’t carve that opening. The pressing up high has been very good, all the attitude and desire has been good but not enough chances have been created – and, chances haven’t been taken.\n\n“Sometimes that’s confidence; that’s human nature – you see players missing chances they won’t normally miss. But it’s up to us to keep working and get the ball in between the posts. That goal never moves.”\n\nPogba has been photographed with Zinedine Zidane in Dubai, where the midfielder has been working on his rehabilitation, but Solskjær brushed that aside despite Real Madrid’s manager wanting to sign the player last summer. “I’ve not heard Paul say he doesn’t want to be here,” Solskjær said. “Paul wants to stay here and play well. Paul is part of our plan. When you’re at Man United, you do get pictures, speculation. I don’t have any problem with that at all.”\n\nLiverpool are European champions and boast a maximum eight wins so far this season but Solskjær was informed the 49 points he has from his first 27 matches gives him two more than Jürgen Klopp got from the same number with Liverpool. It is a welcome positive note as the Norwegian seeks to arrest United’s nosedive towards the relegation zone that they sit only two points above. “I don’t hold on to stats like this,” he said, adding: “We’re heading somewhere, we feel, but need results and I expect the players to come out and prove why they’re at Man United.”\n\nSince March 2009 Liverpool have claimed only one league win at United, the 3-0 victory against David Moyes’s side in March 2014. If Solskjær’s team are not favourites he does not repeat the error Moyes made when billing Liverpool as such before that loss.\n\nThe Fiver: sign up and get our daily football email.\n\nThe Scot was criticised for this and Solskjær’s take is cuter. “They’re doing well in the league but we’re looking forward to this game,” he said. “It’s the perfect game for our players, the perfect game for our fans. We’ve had a tough time, a difficult time lately, but I’m sure we’ll give them a good game.”\n\nThe challenge is made tougher by their depleted ranks. David de Gea and Pogba are unavailable because of muscle and ankle problems respectively. Eric Bailly and Timothy Fosu-Mensah are long-term absentees, and Solskjær is unsure whether Luke Shaw, Aaron Wan-Bissaka, Martial, Diogo Dalot, Phil Jones, Mason Greenwood – who has signed a new contract to 2023 with the option to extend by a year – and Lingard will be ready.\n\nAs always, Solskjær strove to be upbeat. “The mood here is always good,” he said. “We’ve come a long way on what you call the culture, the environment we’re working in, and it’s a positive one; it’s working towards something. The staff and players know when it’s Liverpool coming up, it’s a game that’s going to be watched by so many and when you sign for Manchester United this is the first one you look forward to.”", "description": "Ole Gunnar Solskjær said the Manchester United job is not too big for him as he prepared for Sunday’s visit of leaders Liverpool", "authors": ["Jamie Jackson"], "top_image": "https://i.guim.co.uk/img/media/c5fec3df5cad251364104042427e0c20c91c6985/47_153_2925_1755/master/2925.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d2ef04697f4a2d82ba2eb1e29f800a88", "published_at": "2019-10-18"}