{"pub": "investing.com", "url": "https://investing.com/analysis/usd-hits-important-support-and-is-primed-for-upswing-200472837", "downloaded_at": "2019-10-11 20:21:12.929281+00:00", "title": "USD Hits Important Support And Is Primed For Upswing", "language": "en", "text": "The is setting itself up for a sizable move that we won't watch disinterested. The charts have sent their message, upon which we have acted. Let's assess the outlook for the days ahead as it stands right now.\n\nToday, we will cover the USD Index as opposed to the individual currency pairs. It's also tradable, as there are futures on it (DX symbol) as well as ETFs, for instance the and the .\n\nIn short, based on the overnight decline to the previous lows and the rising support line, Thursday's waiting order has been executed, opening the long position in the USD Index.\n\nLet's take a closer look.\n\nDaily USD\n\nThe USD Index declined in a visible manner Thursday and it moved a bit lower on Friday as well. At the moment, the USD is trading at 98.36, so the new long position is almost flat (profitable, but very insignificantly). No wonder - the position is open for less than 24 hours so far and its potential is likely to be realized in the following days (or weeks, if you choose to follow the medium-term trade).\n\nDouble Support\n\nThe early October low and the rising red support line based on the August lows is likely to trigger a reversal, just as it did in September. Please note that, just as it was the case in September, the USD Index might move below the red line temporarily (perhaps to the 50-day moving average at about 98.15 or so) before rallying. Such a move would not invalidate the bullish setup at all.\n\nOur comments on USD's long-term charts remain up-to-date:\n\nWhy are we focusing on the long positions in the USD Index? Because of the long-term trend, which remains up.\n\nLong-Term USD\n\nWeekly USD\n\nThe USD Index is after a major long-term breakout and this breakout was already verified a few times. The most recent rally is just the very early part of the post-breakout rally. Much higher USD Index values are likely to follow in the upcoming months. The long-term trend is up as even the dovish U-turn by the Fed, rate cuts, and myriads of calls from President Trump for lower U.S. dollar and much lower (even negative) interest rates, were not able to trigger any serious decline. What we saw instead was a running correction that's the most bullish kind of corrections. It's the one in which the price continues to rally, only at significantly smaller pace.\n\nThank you.", "description": "Forex Analysis by Przemyslaw Radomski, CFA covering: US Dollar Index Futures, PowerShares DB US Dollar Bullish, PowerShares DB US Dollar Bearish. Read Przemyslaw Radomski, CFA's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-11"}