{"pub": "fox", "url": "https://foxnews.com/politics/lawmakers-clash-over-ukraine-witness-hearings-as-trump-tells-gop-reps-to-close-it-out", "downloaded_at": "2019-10-30 16:05:25.372294+00:00", "title": "Lawmakers clash over Ukraine witness hearings as Trump tells GOP reps to ‘close it out’", "language": "en", "text": "This week's spree of closed-door interviews with witnesses as part of the Trump impeachment probe has fueled a political war over House Democrats' handling of the process, with Republicans accusing their counterparts of tipping the scale during these sessions even as Speaker Nancy Pelosi tries to clarify rules for the inquiry going forward.\n\nTensions spilled over Tuesday after the questioning of Army Lt. Col. Alexander Vindman, who testified that he had concerns about President Trump’s July phone call with Ukrainian President Volodymyr Zelensky. A source familiar with the deposition told Fox News that House Intelligence Committee Chairman Adam Schiff, D-Calif., blocked multiple lines of questioning, raising objections to any questions “that came within six degrees of the whistleblower” who originally flagged that call in a complaint to the intelligence community watchdog.\n\nDEMS INTRODUCE RESOLUTION FORMALIZING IMPEACHMENT INQUIRY PROCESS\n\nWhen Vindman was asked about whom he may have shared details of the July 25 call with, the source said Schiff shut down the questioning, saying: “We are not going there.”\n\nThe complaints were echoed by GOP leaders, who accused Schiff of blocking their lines of questioning. Rep. Devin Nunes, the top Republican on the House Intelligence Committee, accused Schiff of coaching Vindman.\n\n\"I mean, they've been bad at most of these depositions, but to interrupt us continually to coach the witness, to decide ... what we're going to be able to ask the witness,\" he said on “Hannity.”\n\nAccording to his written opening statement, Vindman said he does not know the identity of the whistleblower. GOP Rep. Jim Jordan, though, rejected claims by Democrats that they were trying to figure out who the whisteblower is during that questioning.\n\n\"We're trying to figure out who our witness list is!\" he said. Referring to a Democrat-authored resolution establishing guidelines for impeachment hearings, he said: \"There will be witnesses called. We would like to figure out who those witnesses should be.\"\n\nPresident Trump, meanwhile, urged fellow Republicans to “close it out!”\n\n\"Republicans are very unified and energized in our fight on the Impeachment Hoax with the Do Nothing Democrats, and now are starting to go after the Substance even more than the very infair [sic] Process because just a casual reading of the Transcript leads EVERYBODY to see that the call with the Ukrainian President was a totally appropriate one,\" Trump tweeted. \"... This Impeachment nonsense is just a continuation of the Witch Hunt Hoax, which has been going on since before I even got elected. Rupublicans [sic], go with Substance and close it out!\"\n\nRep. Steve Scalise, R-La., also accused Schiff and Speaker Pelosi of running a “Soviet-style process” that denied due process to Republicans and the White House.\n\nSchiff, on the other hand, dismissed Republican complaints about the process, saying Monday that nearly 50 Republicans can participate in the depositions despite their allegations that members are being shut out.\n\n“Republicans can spuriously attack the process,” he tweeted. “While we expose the truth.”\n\nThe clash points to increasingly heated tensions over the way the impeachment hearings are being handled by House Democrats. It feeds into broader complaints by Republicans that Democrats are using the Ukraine call as a pretext for a pre-ordained impeachment probe.\n\nBut the impeachment probe witnesses continue to offer damaging testimony, including the allegation last week that the administration indeed linked U.S. military aid to the push for Ukraine to launch the sought-after investigations.\n\nMore clashes could come Wednesday during the closed-door questioning of State Department officials Christopher Anderson and Caroline Croft.\n\nUnder particular scrutiny will be the role that Trump lawyer Rudy Giuliani played in conducting his own investigation into the Biden family's activities into Ukraine, and how that may have affected administration policy.\n\nAccording to prepared remarks, Anderson will say that former National Security Adviser John Bolton warned him and former U.S. envoy to Ukraine Kurt Volker that Giuliani was a key voice with Trump on Ukraine and “could be an obstacle to increased White House engagement.”\n\nThat testimony will take place a day before a scheduled vote on the resolution setting the impeachment inquiry process.\n\nAt the heart of the probe is the July call where Trump urged Zelensky to “look into” the conduct of former Vice President Joe Biden (and Biden’s son Hunter) in regard to Ukraine, as well as the country’s activities in the 2016 election. Trump has called the phone call “perfect” and claimed there was no quid pro quo tied to military aid.\n\nGOP REPS SAY SCHIFF STOPPED IMPEACHMENT WITNESS FROM ANSWERING CERTAIN GOP QUESTIONS\n\nVindman voiced concerns about the investigation request during his interview Tuesday, but was also questioned over his statement that it was not “proper to demand that a foreign government investigate a U.S. citizen.”\n\nA source told Fox News that Vindman struggled for several minutes when asked to point to Trump’s language in the transcript that backed up the claim that it was a demand. Vindman later stated that Trump was the party with the most power, or \"superior,\" so the \"whole thing [call] was a demand asking for a favor.\"\n\nThe transcript of the call itself shows Trump asked Zelensky to \"do us a favor\" and \"get to the bottom\" of Ukraine's activities in 2016, and \"look into\" the Bidens' activity as well.\n\nAccording to prepared remarks, Vindman told investigators he went to his leadership because he believed the call was not proper. The source said Vindman described the call as \"wrong\" but when pressed, Vindman said he was not a lawyer and not alleging it was a crime.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nVindman said he was concerned \"about the impact on national security, U.S. relations and loss of bipartisan support for Ukraine.\" The source said Vindman's testimony suggested there were \"policy differences, not a legal issue.\"\n\nFox News Catherine Herridge, Mike Emanuel and Ronn Blitzer contributed to this report.", "description": "This week's spree of closed-door interviews with witnesses as part of the Trump impeachment probe has fueled a political war over House Democrats' handling of the process, with Republicans accusing their counterparts of tipping the scale during these sessions even as Speaker Nancy Pelosi tries to clarify rules for the inquiry going forward.", "authors": ["Adam Shaw"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/30/694940094001_6099068262001_6099068641001-vs.jpg", "published_at": "2019-10-30"}