{"pub": "fox", "url": "https://foxnews.com/world/ex-cia-officer-terrorism-suspect-kidnapping-italy", "downloaded_at": "2019-10-28 00:30:16.520458+00:00", "title": "Ex-CIA officer linked to 2003 kidnapping of terror suspect leaves Italy, fears for safety, report says", "language": "en", "text": "A former CIA officer implicated in the 2003 kidnapping of a terrorism suspect in Milan has left Italy out of fears for her safety, Italian media reported Saturday.\n\nSabrina de Sousa, 623, is one of 26 people convicted by Italy in absentia over the 2003 kidnapping of Egyptian cleric Hassan Mustafa Osama Nasr, also known as Abu Omar.\n\nSousa denied involvement but was the only one to be sentenced for the abduction.\n\nItalian President Sergio Mattarella pardoned De Sousa in 2017 but she was still required to perform community service through 2020.\n\nDe Sousa, a Portuguese-U.S. citizen, said she decided to leave Italy after Secretary of State Mike Pompeo and CIA Director Gina Haspel’s visit to Rome earlier this month, Il Corriere Della Sera reported.\n\n“I was terrified of the consequences that I could face,” De Sousa said. “The arrival of Haspel in Italy confirmed to the Italian government that the U.S. administration had washed its hands of my case.”\n\nIt was unclear what connection, if any, Pompeo and Haspel’s visits had with De Sousa’s case. Il Corriere della Sera quoted her as saying “recent changes to the Whistleblower Act” will allow her to reveal further details on the case.\n\nDe Sousa’s lawyer, Andre Saccucci, did not immediately respond to Fox News’ request for comment.\n\nWASHINGTON POST PUBLISHES AL-BAGHDADI HEADLINE REFERRING TO ISIS LEADER AS 'AUSTERE RELIGIOUS SCHOLAR'\n\nThe kidnapping of Nasr was part of the CIA’s controversial “extraordinary rendition” program, implemented under President George W. Bush, and entailed taking terror suspects to foreign countries where torture was allowed.\n\nNasr claimed he was transferred to his native Egypt and tortured.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nDe Sousa has denied any involvement, claiming she was not in Milan on the day of the cleric’s abduction. If extradited, De Sousa would have been the first CIA officer and U.S. diplomat imprisoned over the agency’s “extraordinary rendition” program.\n\nFox News’ Cristina Corbin contributed to this report.", "description": "A former CIA officer implicated in the 2003 kidnapping of a terrorism suspect in Milan has fled Italy out of fears for her safety, Italian media reported Sunday.", "authors": ["Bradford Betz", "Bradford Betz Is An Editor For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Sabrina-de-Sousa-GettyImages-644009288.jpg", "published_at": "2019-10-27"}