{"pub": "cbc", "url": "https://cbc.ca/radio/thecurrent/in-a-bunker-hospital-in-syria-a-director-made-it-his-mission-to-document-the-plight-of-innocent-civilians-1.5337808", "downloaded_at": "2019-10-29 00:19:47.083138+00:00", "title": "CBC Radio", "language": "en", "text": "In a bunker underneath suburban Ghouta, southeast of Damascus, Syrian doctor Amani Ballour ran a hospital known as The Cave.\n\nAs she and her team of mostly female doctors worked, warplanes dropped bombs in the chaos of the civil war overhead. Supplies, food and medicine were in short supply, but victims, many of them children, had nowhere else to go.\n\nOscar-nominated director Feras Fayyad captured what it was like for Dr. Ballour, her team and their patients. He says his reasons for doing so went beyond filmmaking.\n\nHe told The Current's guest host David Common that it became \"his mission\" to \"document everything around us,\" in the hopes it could be used to seek justice for the innocent victims of the civil war.\n\n\"If we didn't manage to make a film, we [were] sure that we will keep this footage, and share it with any high organization who work for the justice process to put the war criminals in the court,\" he said.\n\nFayyad's efforts did result in a film, The Cave, which opens in Toronto and Vancouver on Friday.\n\nThe documentary has been called hard to watch by critics, but Fayyad thinks viewers should watch his film even if it makes them uncomfortable.\n\n\"The film should put people in an uncomfortable position to look through the terrible reality around us,\" he said, adding that he wants western audiences to feel motivated to take action.\n\n\"We need your help. We need you, your empathy. We need your pressure on your politicians,\" he said.\n\nDirector Feras Fayyad and his crew shooting in Idlib, Syria. (National Geographic)\n\nFor Fayyad, it was important to tell this side of the story in order to show future generations where Syrian society has been, and how much further it needs to go.\n\n\"I want to keep it like a historical record to show the people in the future: 'Look where we've been, and look what we have to do to change for a democracy, and for more equality,' but also as evidence for the most horrific and barbaric war that we've experienced.\"\n\nWritten by Mac Cameron. Produced by Julie Crysler.", "description": "Director Feras Fayyad's new film, The Cave, is about a team of doctors working in an underground Syrian hospital, desperately trying to save lives as the war raged above them.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5338374.1572288084!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/dr-b.jpg", "published_at": "2019-10-28"}