{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/20/this-date-in-baseball", "downloaded_at": "2019-10-20 17:02:31.149460+00:00", "title": "This Date in Baseball", "language": "en", "text": "Oct. 21\n\n1959 - The Major League Players Association approved two All-Star Games in 1960, to be held at Kansas City’s Municipal Stadium and New York’s Yankee Stadium.\n\n1973 - Bert Campaneris and Reggie Jackson hit two-run homers in the third inning as the Oakland A’s defeated the New York Mets 5-2 in Game 7 of the World Series. It was the second straight World Championship for the A’s.\n\n1975 - Carlton Fisk broke up one of the best games in World Series history with a homer in the 12th inning to give the Boston Red Sox a 7-6 victory against the Cincinnati Reds, forcing a seventh game.\n\n1976 - The Cincinnati Reds won the World Series in four games with a 7-2 victory over the New York Yankees. Johnny Bench had two home runs for five RBIs. It was the Reds’ second straight championship and marked the first time a team had swept the playoffs and World Series.\n\n1980 - The Philadelphia Phillies became World Series champions for the first time in their 98-year history with a 4-1 triumph over the Kansas City Royals in Game 6.\n\n1992 - The Toronto Blue Jays took a 3-1 lead in the World Series with a 2-1 victory over the Atlanta Braves. Pitcher Jimmy Key got the victory and catcher Pat Borders hits a home run. It marked a record 10 straight postseason games in which Toronto had hit a home run.\n\n1995 - Atlanta edged Cleveland 3-2 in Game 1 of the World Series behind Greg Maddux’s two-hitter, the 15th in Series history.\n\n1996 - Atlanta’s Greg Maddux teamed with Mark Wohlers to pitch the 100th shutout in World Series history, a 4-0 win over the New York Yankees for a two games-to-none lead.\n\n1998 - The New York Yankees closed out their historic season with 3-0 victory at San Diego, sweeping the Padres in four games to win their record 24th World Series championship. The Game 4 victory gave the Yankees 125 wins against 50 losses - for a .714 winning percentage, the best in the majors since their Murderers’ Row club of 1927.\n\n2000 - In the first Subway Series since 1956, the New York Yankees earned a record 13th straight World Series victory, a 4-3 win over the New York Mets, surpassing their record set in the late 1920s.\n\n2001 - Randy Johnson pitched seven solid innings to beat Atlanta 3-2 and send Arizona to its first World Series. The Diamondbacks reached the World Series faster than any expansion team, doing it in only their fourth year of existence.\n\n2004 - MVP Albert Pujols hit a game-tying double, Scott Rolen followed with a home run and the St. Louis Cardinals suddenly erupted against Roger Clemens, startling the Houston Astros 5-2 to take Game 7 of the NL championship series.\n\n2006 - The World Series had a pair of rookie starters for the first time. Anthony Reyes pitched brilliantly into the ninth inning, to help St. Louis cruise past Detroit and Justin Verlander 7-2 in Game 1.\n\n2007 - Dustin Pedroia drove in five runs and Boston advanced to the World Series with an 11-2 win over Cleveland. The Red Sox, who rallied from a 3-0 deficit in the ALCS three years ago, came back from a 3-1 deficit against the Indians.\n\n2009 - Jayson Werth homered twice, Shane Victorino and Pedro Feliz also connected and the Philadelphia Phillies beat the Los Angeles Dodgers 10-4 in Game 5 to win their second straight NL pennant.\n\n2015 - Daniel Murphy and the New York Mets finished a playoff sweep of the Chicago Cubs and advanced to the World Series. Murphy homered for a record sixth consecutive postseason game and the Mets brushed aside the Cubs 8-3, capping a National League Championship Series in which New York never trailed.\n\n2017 - Charlie Morton and Lance McCullers combined on a three-hitter, Jose Altuve and Evan Gattis homered and the Houston Astros reached the World Series, blanking the New York Yankees 4-0 in Game 7 of the AL Championship Series.\n\nToday’s birthdays: Jose Ruiz 25; Jose Lobaton 35; Zack Greinke 36.\n\nOct. 22\n\n1910 - After three straight losses and trailing Philadelphia 3-2 in the ninth, the Chicago Cubs tied the score and then won 4-3 in 10 innings for their only victory as the A’s won the World Series in five games.\n\n1972 - The Oakland A’s won their first World Series with a 3-2 victory over the Cincinnati Reds in Game 7. It was the first championship since 1930 for the franchise, then located in Philadelphia.\n\n1975 - A ninth-inning RBI single by Joe Morgan gave the Cincinnati Reds a 4-3 victory over the Boston Red Sox and the World Series title in seven games. It was the first title for the Reds in 35 years.\n\n1986 - Gary Carter’s two home runs at Fenway Park gave New York a 6-2 victory and pulled the Mets even with Boston Red Sox in the World Series after four games.\n\n1987 - The St. Louis Cardinals won their third straight home game to take a 3-2 lead in the World Series with a 4-2 victory against the Minnesota Twins.\n\n2000 - In their first matchup since Roger Clemens beaned Mike Piazza in July, Clemens came close to hitting Piazza again - this time with the jagged barrel of a broken bat. Piazza fouled a grounder off a letter-high inside pitch and his bat shattered, with the largest chunk - the barrel head - going back to the mound. Clemens picked up the splintered wood and threw it angrily in front of Piazza as he ran toward first, missing the Mets’ star by about 2 feet. Clemens then pitched the best World Series game of his career with a two-hit, nine-strikeout shutout before leaving after eight innings in the Yankees’ nervous 6-5 victory.\n\n2003 - Alex Gonzalez led off the bottom of the 12th with a solo homer, lifting Florida to a 4-3 victory over the New York Yankees in Game 5 of the World Series. The loss to Florida snapped the Yankees’ winning streak in extra-inning World Series games at seven. Only one World Series game had ever gone longer, Boston’s 14-inning win over Brooklyn in 1916.\n\n2010 - Texas clinched its first pennant with a 6-1 victory over the defending World Series champion New York Yankees in Game 6 of the AL championship series.\n\n2011 - Albert Pujols hit three impressive home runs to tie the World Series record, amassing five hits and six RBIs as the St. Louis Cardinals romped past the Texas Rangers 16-7 for a 2-1 edge. Pujols joined Babe Ruth, who hit three homers in 1926 and again in 1928, and Reggie Jackson’s performance in 1977. His six RBIs tied the record in a game, matching Bobby Richardson in 1960 and Hideki Matsui in 2009. Pujols also matched the Series mark for hits in a game set by Paul Molitor in 1982.\n\n2012 - Hunter Pence hit a bizarre, two-run double, Matt Cain pitched his second clincher of October and the San Francisco Giants beat the defending World Series champion St. Louis Cardinals 9-0 in Game 7 of the NL championship series. Series MVP Marco Scutaro produced his sixth multi-hit game of the series and matched an LCS record with 14 hits.\n\n2016 - Kyle Hendricks outpitched Clayton Kershaw, Anthony Rizzo and Willson Contreras homered early and the Chicago Cubs won their first pennant since 1945, beating the Los Angeles Dodgers 5-0 in Game 6 of the NL Championship Series. Hendricks pitched two-hit ball for 7 1/3 innings and Aroldis Chapman got the final five outs.\n\nToday’s birthdays: Corbin Burnes 25; Jesse Biddle 28; Drew VerHagen 29; Darren O’Day 37; Robinson Cano 37; Ichiro Suzuki 46.\n\nOct. 23\n\n1910 - Philadelphia’s Jack Coombs won his third game of the World Series, beating the Chicago Cubs 7-2 as the Athletics took the championship in five games. Eddie Collins had three hits, including two doubles, to lead the A’s attack.\n\n1935 - Gabby Hartnett was selected National League MVP by the Baseball Writers Association of America, with Dizzy Dean finishing second.\n\n1945 - Branch Rickey announced the signing of Jackie Robinson by the Brooklyn Dodgers organization.\n\n1981 - The Los Angeles Dodgers beat New York 5-4 in the third game of the World Series to narrow the Yankees’ lead to 2-1.\n\n1984 - Rick Sutcliffe, who went 16-1 for the Chicago Cubs after arriving from Cleveland two days before the June 15 trading deadline, was a unanimous choice as National League Cy Young Award winner.\n\n1986 - Bruce Hurst’s complete-game victory gave the Boston Red Sox a 4-2 win and 3-2 lead in the World Series against the New York Mets.\n\n1993 - Joe Carter became the second player in baseball history to end a World Series with a home run, hitting a three-run shot off Mitch Williams in the ninth inning that gave the Toronto Blue Jays their second straight championship with an 8-6 victory over the Philadelphia Phillies in Game 6.\n\n1996 - The New York Yankees mounted the second biggest comeback in World Series history to beat the Atlanta Braves 8-6 in 10 innings and tie the series 2-2. The Braves had a 6-0 lead after five innings. The Yanks cut the lead in half in the top of the sixth. Braves manager Bobby Cox brought n closer Mark Wohlers for a two-inning save against the bottom third of the Yankee order in the eighth. Charlie Hayes led off the inning with a dribbler down the third base line that stayed fair and Darryl Strawberry followed that up with a line drive single to left. After Mariano Duncan grounded into a fielder’s choice to take Strawberry off the bases, backup catcher Jim Leyritz came to the plate for his first at bat of the night. With a 22 count on him, Leyritz jumped on a Wohlers slider and hit it over the left field wall to tie the game. With the bases loaded n the 10th, Steve Avery walked Wade Boggs to bring in the deciding run for the Yankees.\n\n1997 - The Florida Marlins moved within one win of their first World Series title as Moises Alou hit his second three-run home run of the Series against Cleveland Indians pitcher Orel Hershiser. Rookie Livan Hernandez pitched into the ninth inning of Game 5 and Florida held off the Indians, 8-7.\n\n2005 - The Chicago White Sox hit two dramatic home runs for a 7-6 victory against the Houston Astros and take a 2-0 lead in the World Series. Paul Konerko and the fireworks. Konerko, the ALCS MVP, hit a grand slam in the seventh inning to give the White Sox a 6-4 lead. After the Astros tied the score in the ninth against Chicago closer Bobby Jenks, Scott Podsednik hit a one-out homer off Houston closer Brad Lidge into the bleachers in right-center field to win the game.\n\n2018 - Andrew Benintendi, J.D. Martinez and pinch-hitter Eduardo Nunez led the Boston Red Sox to an 8-4 win over the Los Angeles Dodgers in the opening game of the World Series.\n\nToday’s birthday: Kyle Gibson 32.\n\nOct. 24\n\n1911 - The World Series between the New York Giants and the Philadelphia Athletics was resumed after six days of rain, and Chief Bender beat Christy Mathewson 4-2 to give the A’s a 3-1 lead.\n\n1963 - Sandy Koufax of the Los Angeles Dodgers became the first unanimous winner of the Cy Young Award. Koufax won the pitchers’ Triple Crown, leading the league in wins (25), strikeouts (306) and ERA (1.88). Koufax set a record for shutouts by a left-handed pitcher with 11. The previous record of nine shutouts had been held by Babe Ruth for nearly 50 years.\n\n1981 - The Los Angeles Dodgers came back to beat the New York Yankees 8-7 in a sloppy 3½-hour marathon and tied the World Series 2-2. The Yankees blew a 6-3 lead. On one play, Reggie Jackson lost the ball in the sun and it bounced off his shoulder for a two-base error.\n\n1987 - Kent Hrbek’s grand slam highlighted a 15-hit barrage as the Minnesota Twins pounded the St. Louis Cardinals 11-5 at the Metrodome to force the World Series to a seventh game.\n\n1992 - The Toronto Blue Jays took baseball’s championship outside the United States for the first time, beating the Atlanta Braves 4-3 in 11 innings in Game 6 of the World Series.\n\n1994 - Atlanta’s Greg Maddux became the first pitcher to win three straight Cy Young Awards, unanimously sweeping the NL honor. Maddux was 16-6 with a 1.56 ERA, the third-lowest in 75 years.\n\n1995 - Eddie Murray singled home pinch-runner Alvaro Espinoza in the bottom of the 11th inning, to give the Cleveland Indians a 7-6 victory over the Atlanta Braves in Game 3 of the World Series.\n\n1996 - The New York Yankees took a 3-2 lead over the Atlanta Braves in the World Series after Andy Pettitte outpitched John Smoltz for a 1-0 win in the last game played at Atlanta-Fulton County Stadium.\n\n2000 - Benny Agbayani hit a go-ahead double in the eighth inning as the New York Mets handed Orlando Hernandez his first postseason defeat, beating the Yankees 4-2 to cut their World Series deficit to 2-1. The Mets also ended the Yankees’ record 14-game winning streak in the World Series.\n\n2004 - Boston’s Curt Schilling became the first starting pitcher to win a World Series game for three different teams, as the Red Sox beat the St. Louis Cardinals 6-2, for 2-0 lead in the Series. Schilling, the fifth pitcher to win a World Series game with a team from both leagues, had won with the Philadelphia Phillies in 1993, and the Arizona Diamondbacks in 2001.\n\n2005 - Scott Podsednik homered in the bottom of the ninth inning and Paul Konerko hit the 18th grand slam in World Series history in Chicago’s 7-6 win over Houston in Game 2 of the World Series.\n\n2007 - Boston set a record for runs and victory margin in a World Series opener as the Red Sox flattened the Rockies 13-1. Boston finished with 17 hits, becoming the first club to hit eight doubles in a Series game since 1925. Rookie Dustin Pedroia became only the second player to lead off the Series with a home run. Orioles outfielder Don Buford homered in 1969 as a leadoff batter in Game 1 off Tom Seaver of the New York Mets.\n\n2012 - Pablo Sandoval became the fourth player to hit three home runs in a World Series game, connecting twice against Justin Verlander and once off Al Alburquerque to lead the San Francisco Giants over the Detroit Tigers 8-3 in the series opener.\n\nToday’s birthdays: Rafael Devers 23; Eric Hosmer 30.\n\nOct. 25\n\n1911 - Fred Merkle’s 10th-inning sacrifice fly scored Larry Doyle to give the New York Giants a 4-3 win over the Philadelphia Athletics in the World Series. The victory cut the A’s lead in the Series to 3-2.\n\n1978 - Gaylord Perry of the San Diego Padres becomes the first pitcher to win the Cy Young Award in both leagues. Perry wins the National League award with a 21-6 record and a 2.72 ERA.\n\n1981 - Steve Yeager and Pedro Guerrero hit back-to-back homers in the seventh inning to lead the Los Angeles Dodgers to a 2-1 win over the New York Yankees and take a 3-2 lead in the World Series.\n\n1986 - The New York Mets rallied for three runs with two outs in the 10th inning against the Boston Red Sox and pushed the World Series to a decisive seventh game. The tie-breaking run scored on Boston first baseman Bill Buckner’s error on Mookie Wilson’s slow grounder.\n\n1987 - The Minnesota Twins, behind Frank Viola, won their first World Series championship by beating the St. Louis Cardinals 4-2 in Game 7, becoming the first team to win four home games.\n\n1997 - Cleveland’s Chad Ogea beat Florida with his arm and bat to force a Game 7 in the World Series. Ogea allowed a run on four hits over five innings and got two hits with two RBIs and a run scored in a 4-1 victory over the Marlins. Ogea drove in the first two runs of the game with a bases-loaded single in the second.\n\n2003 - Florida’s Josh Beckett threw a shutout to lead the Marlins to a 2-0 victory over the New York Yankees to win the World Series. Pitching on three days rest, Beckett, who was named MVP of the series, allowed five hits in Game 6 as Florida won its second title in seven seasons.\n\n2005 - Geoff Blum homered in the top of the 14th inning in his first World Series at-bat to help the Chicago White Sox defeat Houston 7-5 in Game 3. At 5 hours, 41 minutes, it was the longest game by time in Series history and matched the longest in innings. The Boston Red Sox and Brooklyn Dodgers also went 14 innings in Game 2 of the 1916 World Series.\n\n2017 - George Springer hit a two-run drive in the 11th inning and the Houston Astros won a thrilling home run derby at Dodger Stadium, beating Los Angeles 7-6 to tie the World Series at one game apiece. The teams combined for a Series record eight homers.\n\nToday’s birthdays: Juan Soto 21; Pedro Martinez 48.\n\nOct. 26\n\n1911 - Danny Murphy of Philadelphia had four hits as the Athletics beat the New York Giants 13-2 to win the World Series in six games. The A’s put the game out of reach with a seven-run seventh inning.\n\n1940 - Detroit outfielder Hank Greenberg won the American League MVP with Cleveland pitcher Bob Feller finishing second. Greenberg hit .340 with 41 home runs and 150 RBIs. Greenberg, who won the award in 1935 as a first baseman, became the first player to win the MVP again playing a different position.\n\n1977 - Sparky Lyle of the New York Yankees became the first American League relief pitcher to win the Cy Young Award. Lyle posted a 13-5 record with 26 saves and a 2.17 ERA in a league-leading 72 appearances.\n\n1982 - Steve Carlton of the Philadelphia Phillies became the first pitcher to win four Cy Young Awards, taking National League honors. The 37-year-old lefthander led the league in wins (23), innings pitched (295.2), strikeouts (286) and shutouts (6). Carlton also won the award in 1972, 1977 and 1980.\n\n1985 - Dane Iorg’s two-run single and a disputed call by first base umpire Don Denkinger in the ninth inning gave the Kansas City Royals a 2-1 victory over the St. Louis Cardinals and tied the World Series after six games. St. Louis scored its run on a bloop single by Brian Harper in the eighth inning.\n\n1991 - Minnesota’s Kirby Puckett homered off Charlie Leibrandt to give the Twins a 4-3, 11-inning win over the Atlanta Braves and force a Game 7 in the World Series.\n\n1996 - The New York Yankees won their 23rd World Series by beating the Atlanta Braves 3-2 in Game 6. John Wetteland, who allowed a run in the ninth, hung on to get his fourth save of the series and capture Series MVP.\n\n1997 - Edgar Renteria ended one of the most thrilling Game 7s, singling with two outs in the bottom of the 11th inning to give the Florida Marlins their first World Series championship with a 3-2 win over the Cleveland Indians. The 5-year-old Marlins became the youngest expansion team to win a championship.\n\n2000 - The New York Yankees became the first team in more than a quarter-century to win three straight World Series championships, beating the New York Mets 4-2. The Yankees matched the Oakland Athletics’ three in a row from 1972-74, and won their fourth title in five years.\n\n2002 - The Anaheim Angels overcame a 5-0 deficit to beat the San Francisco Giants 6-5 and force a Game 7 in the World Series. Scott Spezio hit a three-run in the bottom of the seventh to cut the Giants lead to 5-3. Darin Erstad opened the eighth with a home run off Todd Worrell. Tim Salmon and Garret Anderson followed with singles to chase Worrell. Robb Nen came in and gave up a two-run double to Troy Glaus. It was the biggest comeback in Series history for a team facing elimination.\n\n2005 - Jermaine Dye singled home the only run in the eighth, and the Chicago White Sox beat the Houston Astros 1-0 to win their first World Series title in 88 years.\n\n2008 - Joe Blanton became the first pitcher in 34 years to homer in the World Series, Ryan Howard drove in five runs and the Philadelphia Phillies romped over the Tampa Bay Rays 10-2 to move within one win of their first championship since 1980.\n\n2018 - Max Muncy ended the longest World Series game ever with a leadoff home run in the 18th inning and the Los Angeles Dodgers outlasted the Boston Red Sox 3-2 to pull within 2-1. Muncy connected off Nathan Eovaldi, who was in his seventh inning of relief.\n\nToday’s birthdays: Joe Palumbo 25; Dwight Smith Jr. 27; Erik Skoglund 27; Dominic Leone 28; Francisco Liriano 36.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Oct. 21", "authors": ["The Washington Times Http", "Compiled Paul Montella"], "top_image": "", "published_at": "2019-10-20"}