{"pub": "yahoo", "url": "https://sports.yahoo.com/los-angeles-lakers-alex-caruso-photoshopped-photos-jacked-nba-drug-test-213643584.html", "downloaded_at": "2019-09-04 23:40:16.249668+00:00", "title": "Alex Caruso hit with 'random' drug test after jacked photoshop pictures of him go viral", "language": "en", "published_at": "2019-09-04", "text": "The NBA hit Alex Caruso with a random drug test just days after clearly fake photos of him looking jacked went viral. (Harry How/Getty Images)\n\nLos Angeles Lakers guard Alex Caruso isn’t jacked.\n\nSure, he’s in great shape. He’s a professional athlete, after all. But “jacked” isn’t generally the term used to describe the lanky, balding 6-foot-5 point guard.\n\nScroll to continue with content Ad\n\nLast month, the Lakers posted several shirtless photos of Caruso working out in the team facility to social media. Naturally, It didn’t take long for several users to photoshop the pictures to make Caruso look much, much bigger than he actually is.\n\ncan we just skip the NBA season and give Alex Caruso the MVP already? pic.twitter.com/ZGMH0eDdAn — LakeShowYo (@LakeShowYo) August 31, 2019\n\nHowever, not everyone picked up on the joke — including, it appears, the NBA league office.\n\nCaruso was hit with a “random” offseason drug test this week, just one week after the fake pictures went viral.\n\nMr. Silver is always watching. pic.twitter.com/9JVL7R2PxV — Silver Screen & Roll (@LakersSBN) September 3, 2019\n\nCoincidence? Maybe. The NBA sends out its drug tests randomly all throughout the year. It’s entirely possible that it was just Caruso’s turn.\n\nStory continues\n\nOr — and this explanation is way more entertaining — someone in the league office saw the fake pictures and fell for it, which prompted the drug test to try and bust the 25-year-old for taking performance enhancing drugs.\n\nEither way, it doesn’t sound like Caruso is worried about passing that test.\n\nMore from Yahoo Sports:", "description": "The NBA hit Alex Caruso with a random drug test just days after clearly fake photos of him looking jacked went viral.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/a4LLtPZ_VmODdwfF.RjSiQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05OTAuOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/ruSAajWrsw5cozLxl33NCw--~B/aD0yMDE2O3c9MjYwNDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/be555360-cf5a-11e9-9dbb-8a38d795bf3e"}