{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-2019-ireland-last-fixture-pool-a-quarter-finals-samoa-johnny-sexton-a9143886.html", "downloaded_at": "2019-10-05 12:31:30.949796+00:00", "title": "Rugby World Cup 2019: Johnny Sexton remains Ireland’s talisman ahead of pool finale with Samoa", "language": "en", "text": "Johnny Sexton’s ability to predict what happens next on the pitch has ensured the World Player of the Year is peerless, according to teammate Chris Farrell.\n\nThe Leinster fly-half remains the talisman on whom Ireland hang their Rugby World Cup ambitions, with boss Joe Schmidt confident the 34-year-old will be fully fit for the Pool A finale against Samoa.\n\nUnderstudies Jack Carty and Joey Carbery provide plenty of skill and panache at the backline’s pivot, but none in green can rival Sexton at his spiky, demanding and ruthless peak.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nMunster centre Farrell said Sexton takes visualisation to the next level.\n\n“Johnny sees things unfolding before they happen; and that just comes from his experience, because he’s seen so many things on a rugby field,” Farrell said.\n\nShape Created with Sketch. Rugby World Cup team of round two Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Rugby World Cup team of round two 1/15 1, Ellis Genge (England) The loosehead prop may have only come on for England at half-time, but there had not been a run at the World Cup from a prop quite like what Genge produced against the USA. A barn-storming run saw him outpace one defender and trample over another, breaking the best part of 50 metres before it took two men to stop him. He was also excellent in the scrum to win countless penalties as the USA wilted. AP 2/15 2. Julian Montoya (Argentina) It takes something special to shine in Agustin Creevy’s absence, but Montoya delivered with an excellent hat-trick to help lead Argentina to victory over Tonga. Montoya was smart to stay wide following a lineout for his first try, was the beneficiary of the rolling maul for the second and powered his way over from close range for a classy 26-minute hat-trick. AP 3/15 3. Levan Chilachava (Georgia) It’s not often a Georgian makes the team of the round, but Chilachava lead an inspired Georgian pack to dominate Uruguay in their Sunday clash, scoring a try in the bonus-point victory and monstering the opposition front row in the scrum. REUTERS 4/15 4. Luke Thomspon (Japan) A herculean effort from the lock as Japan upset the odds to beat Ireland. Thompson did not miss a single tackle in a standout display with fellow lock James Moore. Getty Images 5/15 5. Lood de Jager (South Africa) The Springbok needed a big performance to strengthen his case for selection in what is a very competitive area for South Africa, and the giant second row delivered emphatically with a man-of-the-match performance. He may not have got on the scoresheet, but his impact in destroying Namibia’s gameplan was standout nonetheless. AP 6/15 6. Aaron Wainwright (Wales) A young player whose development at the World Cup is really turning heads. Wainwright did not look out of place up against one of the greats of the game against David Pocock, and it was his ball-carrying ability that really stood out in an eye-catching performance. Getty Images 7/15 7. Lewis Ludlam (England) A remarkable rise to prominence saw Ludlam score his first World Cup try for England in the demolition of the USA, but it was his all-round performance last week that earns him his place in the side. From nowhere, Ludlam is emerging as a very important member of the England team. AFP/Getty Images 8/15 8. Michael Leitch (Japan) Another substitute who made such a strong contribution to a winning cause. Leitch came on after the half-hour mark to replace Amanaki Mafi and lead by example, setting the tone for Japan’s latest great upset. EPA 9/15 9. Gareth Davies (Wales) Australia could not keep Davies out of the game in Tokyo, with the scrum-half twice intercepting Will Genia and Bernard Foley and nearly bagging himself a third in the second half. He was also excellent at injecting pace into the game and tried to catch the defence napping throughout. Getty Images 10/15 10. Felipe Berchesi (Uruguay) The Uruguayan was excellent in Uruguay’s victory over Fiji, with the South American’s forced to double-up across the round by playing Georgia a handful of days later. Berchesi had to make do with a team on the back foot more often than not, yet managed to release his outside backs to run Fiji ragged. AFP/Getty Images 11/15 11. Makazole Mapimpi (South Africa) Mapimpi emerged from the shadow of Cheslin Kolbe to star in South Africa’s rout of Namibia, scoring two tries to trigger the landslide victory. Mapimpi may not get the shower of praise that his elusive teammate receives, but he showed how dangerous he can be with the ball in hand, showing a devastating turn of pace backed up by some serious power. REUTERS 12/15 12. Ryoto Nakamura (Japan) Going up against the talented duo of Chris Farrell and Garry Ringrose, Nakamura did himself proud with a number of eye-catching tackles and defensive work that any centre would be proud of. He also proved the glue between fly-half Yu Tamura and the dangerous wings outside him. AFP/Getty Images 13/15 13. Lukhanyo Am (South Africa) The third Springbok to feature in the side, Am enjoyed possible his best outing at international level, bagging a try himself on the 57-3 victory immediately after half-time as they picked up where they left off. AP 14/15 14. Kotaro Matsushima (Japan) The only man to retain his spot in the side after yet another strong showing in Shizuoka, Matsushima is establishing himself as one of the must-watch players at the World Cup. One brilliant mazy run in the second half stood out among a lengthy highlight reel. AFP/Getty Images 15/15 15. Telusa Veainu (Tonga) The full-back returned to the Tonga side for the first time in two years and marked his comeback with a brilliant showing, scoring twice in their losing effort against Argentina and producing a sublime finish for his second try after combining with Cooper Vuna. AP 1/15 1, Ellis Genge (England) The loosehead prop may have only come on for England at half-time, but there had not been a run at the World Cup from a prop quite like what Genge produced against the USA. A barn-storming run saw him outpace one defender and trample over another, breaking the best part of 50 metres before it took two men to stop him. He was also excellent in the scrum to win countless penalties as the USA wilted. AP 2/15 2. Julian Montoya (Argentina) It takes something special to shine in Agustin Creevy’s absence, but Montoya delivered with an excellent hat-trick to help lead Argentina to victory over Tonga. Montoya was smart to stay wide following a lineout for his first try, was the beneficiary of the rolling maul for the second and powered his way over from close range for a classy 26-minute hat-trick. AP 3/15 3. Levan Chilachava (Georgia) It’s not often a Georgian makes the team of the round, but Chilachava lead an inspired Georgian pack to dominate Uruguay in their Sunday clash, scoring a try in the bonus-point victory and monstering the opposition front row in the scrum. REUTERS 4/15 4. Luke Thomspon (Japan) A herculean effort from the lock as Japan upset the odds to beat Ireland. Thompson did not miss a single tackle in a standout display with fellow lock James Moore. Getty Images 5/15 5. Lood de Jager (South Africa) The Springbok needed a big performance to strengthen his case for selection in what is a very competitive area for South Africa, and the giant second row delivered emphatically with a man-of-the-match performance. He may not have got on the scoresheet, but his impact in destroying Namibia’s gameplan was standout nonetheless. AP 6/15 6. Aaron Wainwright (Wales) A young player whose development at the World Cup is really turning heads. Wainwright did not look out of place up against one of the greats of the game against David Pocock, and it was his ball-carrying ability that really stood out in an eye-catching performance. Getty Images 7/15 7. Lewis Ludlam (England) A remarkable rise to prominence saw Ludlam score his first World Cup try for England in the demolition of the USA, but it was his all-round performance last week that earns him his place in the side. From nowhere, Ludlam is emerging as a very important member of the England team. AFP/Getty Images 8/15 8. Michael Leitch (Japan) Another substitute who made such a strong contribution to a winning cause. Leitch came on after the half-hour mark to replace Amanaki Mafi and lead by example, setting the tone for Japan’s latest great upset. EPA 9/15 9. Gareth Davies (Wales) Australia could not keep Davies out of the game in Tokyo, with the scrum-half twice intercepting Will Genia and Bernard Foley and nearly bagging himself a third in the second half. He was also excellent at injecting pace into the game and tried to catch the defence napping throughout. Getty Images 10/15 10. Felipe Berchesi (Uruguay) The Uruguayan was excellent in Uruguay’s victory over Fiji, with the South American’s forced to double-up across the round by playing Georgia a handful of days later. Berchesi had to make do with a team on the back foot more often than not, yet managed to release his outside backs to run Fiji ragged. AFP/Getty Images 11/15 11. Makazole Mapimpi (South Africa) Mapimpi emerged from the shadow of Cheslin Kolbe to star in South Africa’s rout of Namibia, scoring two tries to trigger the landslide victory. Mapimpi may not get the shower of praise that his elusive teammate receives, but he showed how dangerous he can be with the ball in hand, showing a devastating turn of pace backed up by some serious power. REUTERS 12/15 12. Ryoto Nakamura (Japan) Going up against the talented duo of Chris Farrell and Garry Ringrose, Nakamura did himself proud with a number of eye-catching tackles and defensive work that any centre would be proud of. He also proved the glue between fly-half Yu Tamura and the dangerous wings outside him. AFP/Getty Images 13/15 13. Lukhanyo Am (South Africa) The third Springbok to feature in the side, Am enjoyed possible his best outing at international level, bagging a try himself on the 57-3 victory immediately after half-time as they picked up where they left off. AP 14/15 14. Kotaro Matsushima (Japan) The only man to retain his spot in the side after yet another strong showing in Shizuoka, Matsushima is establishing himself as one of the must-watch players at the World Cup. One brilliant mazy run in the second half stood out among a lengthy highlight reel. AFP/Getty Images 15/15 15. Telusa Veainu (Tonga) The full-back returned to the Tonga side for the first time in two years and marked his comeback with a brilliant showing, scoring twice in their losing effort against Argentina and producing a sublime finish for his second try after combining with Cooper Vuna. AP\n\n“We talk about doing work in the ‘mind gym’ to see things before they happen, or as early as possible as they unfold because we’ve seen it in our heads before.\n\n“He’s played so much rugby of such a high standard that he’s naturally seen a lot of things happen, and he’s able to see things earlier.”\n\nSexton captained Ireland for the first time in Thursday’s patchy 35-0 win over Russia where Schmidt’s men sealed the bonus-point victory but precious little else.\n\nThe British and Irish Lions star laid on two tries before being withdrawn at half-time to sit on the bench and ice his troublesome thigh after the interval.\n\nIreland’s reliance on Sexton has never been greater, but regular skipper Rory Best has always allowed the fiercely competitive playmaker the stage to make his points and lead the team in his areas of expertise.\n\nBest, Sexton and company must still strike back from their damaging shock 19-12 loss to Japan by beating Samoa to secure a quarter-final berth.\n\nThat defeat by the tournament hosts leaves Ireland vulnerable to a last-eight clash with back-to-back world champions New Zealand.\n\nWhile Sexton might be able to forecast events on the field, neither he nor his team-mates are in any mood to look ahead to knockout rugby.\n\nBut the 26-year-old Farrell still believes Sexton can command top billing at this World Cup.\n\n“He’s so exciting to play with because he gives you space and time on the ball,” said Farrell.\n\n“He’s so consistent in what he does that you really know what you’re getting from him every single time. He’s a real leader and he’s shown that again on Thursday.\n\n“You know just during the week all the micro chats he’ll be having, and not just with the same players over and over again, he goes and seeks players out.\n\n“He gets what he wants out of them. He has so much experience and knowledge of the game that you have to take on board whatever he says.\n\n“When you reflect on what he says you sometimes end up looking back at the video and realising he’s dead right.\n\n“He’s so accurate in what he says to you. And he can make you a better player just by you talking to him.”\n\nPA", "description": "Johnny Sexton’s ability to predict what happens next on the pitch has ensured the World Player of the Year is peerless, according to teammate Chris Farrell. The Leinster fly-half remains the talisman on whom Ireland hang their Rugby World Cup ambitions, with boss Joe Schmidt confident the 34-year-old will be fully fit for the Pool A finale against Samoa.", "authors": ["Nick Purewal"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/05/06/johnny-sexton.jpg", "published_at": "2019-10-05"}