{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Living/13-black-cats-instagram-follow-halloween-season/story?id=66452295", "downloaded_at": "2019-10-23 09:47:58.047915+00:00", "title": "13 black cats on Instagram you'll want to follow this Halloween season", "language": "en", "text": "The ancient Egyptians revered them as gods, and the Pilgrims thought they danced with the devil. Whether omens or idols worthy of worship, black cats have garnered attention throughout history.\n\nNowadays, you’ll find black cats appearing all over the place in pop culture, mostly as comic relief. Some of these more famous felines include Salem from \"Sabrina the Teenage Witch,\" or Thackery Binx from the Halloween cult classic \"Hocus Pocus.\"\n\nNational Black Cat Day is Oct. 27, and to get you in the spirit this spooky season, here are our top-13 Instagram-famous black cats you need to follow no matter how you feel about the feline's controversial color. Call it superstition, but you may want to check out these accounts before Halloween.\n\nSpotticus Maximus\n\nThis \"formerly feral kitten\" is now an \"apartment ornament,\" according to his Instagram bio. Spot is based in San Diego and loves to entertain with clever captions and funny faces on his feed.\n\nNathan the Beach Cat\n\nWith more than half a million followers, Nathan is one of the more famous felines on our list. This black cat based in Australia loves the great outdoors and -- as his handle suggests -- even the beach!\n\nBitty Boo/ \"Artemis\"\n\nBitty Boo, or \"Artemis,\" is based in New Haven, Connecticut, and loves vamping for photos. She’s even got a \"boyfurriend,\" who also has a following on Instagram.\n\nBlack Cat Trails\n\nThis trio of black cats is the definition of spooky squad goals. Each of their latest posts is an ode to Halloween, and they appear to be living their best nine lives in northern Wisconsin.\n\nCats Coffee Music Art and Cats\n\nFrom his posts, Batcat the black cat gets around. He frequents the local café, music and art scene, and we can't say we disapprove.\n\nMeatball and Olive\n\nThis pair of black cats is probably the most adorable set of feline best friends we’ve ever seen. They do everything together, from roasting their \"hooman\" to challenging followers to tell them apart, to snuggling up under a cozy blanket.\n\nBronte and Chloe\n\nAnother pair of black cat buddies on our list, Bronte and Chloe are absolutely beautiful. Bronte has green eyes and Chloe has yellow eyes, and our eyes are watering at this precious Australian pair.\n\nSophie the model\n\nSophie the model works her angles and her looks, and she needs us -- her fans -- to know that. From bandanas to pink tutus to taco costumes, this photogenic cat can pull off any look.\n\nOriginal Vampire Cat\n\nSign us up to join this fang club. Mamba, otherwise known as Nosferpawtu, looks like he’s been ready for Halloween since Nov. 1, 2018, and we are living for his amazing assortment of spooky costumes.\n\nPrincess Monster Truck\n\nAccording to her bio, this cat was rescued from the New York streets. When she’s not posing for the camera with her signature underbite, she’s raising awareness about a missing dog or giving a shoutout to one of her many furry friends.\n\nAri the Panther\n\nAri the kitten is based in Brooklyn, and though she may be small, \"panther\" is right. She can stretch her body into unheard-of shapes, and in between catnaps, her selfie game is strong.\n\nCole and Marmalade\n\nWith 640,000 followers, Cole and Marmalade are the most followed felines on our list. Although Cole is a black cat and Marmalade is orange, together they epitomize the two colors of Halloween, and their antics are too funny not to follow.\n\nVan Cat Meow\n\nWillow the Van Cat looks like she is having the time of her life adventuring around Australia with her human. Apparently she’s in search of the world’s greatest scratching post.", "description": "Whether omens or idols worthy of worship, black cats have always made headlines throughout history.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/black-cat-gty-er-191022_hpMain_16x9_992.jpg", "published_at": "2019-10-23"}