{"pub": "yahoo", "url": "https://finance.yahoo.com/news/goldman-banker-arrested-over-u-193732457.html", "downloaded_at": "2019-10-20 12:50:46.480156+00:00", "title": "Goldman Banker Arrested Over Insider Trading Allegations", "language": "en", "text": "(Bloomberg) -- A Goldman Sachs Group Inc. investment banker was arrested over allegations of insider trading, according to court records unsealed on Friday.\n\nBryan Cohen, a vice president, leaked nonpublic information for almost three years in exchange for cash as part of an international insider trading scheme that led to $2.6 million in illicit gains, according to a separate complaint from the U.S. Securities and Exchange Commission that didn’t identify his employer.\n\nSome information was tied to pending deals involving Syngenta AG and Buffalo Wild Wings Inc., the documents show.\n\nA Goldman spokeswoman confirmed Cohen was an investment banker who worked in the consumer retail division. The bank was unaware of the allegations until Cohen was arrested on Friday. He has since been placed on leave.\n\n“We are cooperating with the authorities on the situation regarding Mr. Cohen,” Nicole Sharp, a representative for the firm, said in an emailed statement. “Protecting client confidential information is our highest internal priority and we condemn this alleged behavior.”\n\nAn attorney for Cohen didn’t immediately respond to a request for comment.\n\nThe accusations are the third insider-trading allegations lodged by U.S. prosecutors against a Goldman banker in the past 18 months.\n\nCohen, 33, shared the information with a trader who hasn’t been identified, and who subsequently passed it on to George Nikas, who realized the gains, according to the SEC complaint. Nikas, a 54-year-old New York restaurateur who owns the chain GRK Fresh, was also charged by prosecutors. Cohen expected and received an unspecified amount of cash in exchange for the tips he provided, the filings show.\n\nCohen has been with Goldman for almost 10 years, starting in the London office before being transferred to New York in 2017. The insider tips were shared between April 2015 and November 2017, according to the SEC complaint.\n\nThe complaint offers a detailed view of how the alleged scheme unfolded. For example, shortly after Cohen moved to New York, Buffalo Wild Wings contacted Goldman to help as the Minneapolis-based casual dining chain was approached by Arby’s Restaurant Group Inc. Cohen was made aware of the potential acquisition the same day, Oct. 17, 2017. Nikas purchased 22,000 Buffalo Wild Wings shares between Oct. 20 and Oct. 27 for $2.5 million, selling 9,000 of them by Nov. 1 for an initial profit of $79,074.\n\nAfter the market close on Nov. 13, news broke of a potential Buffalo Wild Wings acquisition. The next day, the restaurant chain’s stock price rose 24%, and Nikas sold his remaining shares for a profit of $343,298, according to the complaint.\n\n(Adds details on transaction throughout.)\n\nTo contact the reporters on this story: Sridhar Natarajan in New York at snatarajan15@bloomberg.net;Matt Robinson in New York at mrobinson55@bloomberg.net\n\nTo contact the editors responsible for this story: Michael J. Moore at mmoore55@bloomberg.net, Steve Geimann, Linus Chua\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- A Goldman Sachs Group Inc. investment banker was arrested over allegations of insider trading, according to court records unsealed on Friday.Bryan Cohen, a vice president, leaked nonpublic information for almost three years in exchange for cash as part of an international insider trading", "authors": ["Sridhar Natarajan", "Matt Robinson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/jFpPpzGBWKcbna6h_0ysqg--~B/aD0xMzM0O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/cbb6ef58845728d6487394541e00a083", "published_at": "2019-10-20"}