{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7567609/Scots-backing-independence-hits-50-poll-finds.html", "downloaded_at": "2019-10-13 08:56:28.742864+00:00", "title": "Scots backing for independence hits 50%, poll finds", "language": "en", "text": "The threat to the United Kingdom was laid bare today as a poll found support for Scottish independence has hit 50 per cent.\n\nThe population north of the border is now split down the middle over whether to leave the union, according to Panelbase research.\n\nCrucially, voters also seem to believe that the Scottish economy will fare better on its own after Brexit.\n\nThe findings in the poll, conducted for the Sunday Times, will be seized on by Nicola Sturgeon, who has been demanding a fresh independence referendum.\n\nThe SNP is holding its annual conference in Aberdeen this week, and has been using the Brexit issue to bolster support.\n\nThe 50-50 split in the Panelbase survey is a record high, and a five point increase on the average backing for independence last year.\n\nThe 50-50 split in the Panelbase survey is a record high, and a five point increase on the average backing for independence last year\n\nThat level mirrored the 55-45 per cent margin by which independence was defeated in the 2014 referendum - which was meant to be a 'once in a generation' event.\n\nThe last poll in June showed support for independence at 49 per cent.\n\nGiven a choice between No Deal Brexit and an independent Scotland, leaving the union was ahead by 54 per cent to 46 per cent.,\n\nThe latest research found 45 per cent of Scots believe the nation will be better off economically as an independent country within the EU rather than staying in the UK after Brexit.\n\nJust over a third (35 per cent) disagreed while one in five (20 per cent) said they did not know.\n\nThe findings were released on the morning of the SNP's autumn conference in Aberdeen, where the party's Westminster leader is expected to tell delegates Scottish independence will be the focus of any forthcoming general election campaign.\n\nHe will say that retaining the party's majority of Scottish seats at Westminster will re-affirm the mandate to hold another referendum on Scottish independence.\n\nThe poll indicates large gains for the SNP at the next general election, with the party on 39 per cent, up one percentage point since June.\n\nThe Conservatives are also predicted to gain at 21 per cent, up three percentage points since June, while Labour are on 19%, up two.\n\nThe Liberal Democrats are unchanged on 13 per cent and the Greens unchanged on 2 per cent, while the Brexit Party was on 5 per cent, down four percentage points since June.\n\nThe findings in the poll will be seized on by Nicola Sturgeon (pictured in Edinburgh last week), who has been demanding a fresh independence referendum\n\nSir John Curtice, professor of politics at Strathclyde University, told the Sunday Times the Conservatives face losing more than half of their Scottish seats.\n\nHe calculates the SNP will win 48 seats - up from 35 at the 2017 general election - with the Scottish Tories falling from 13 to five, Labour from seven to one, and the Lib Dems rising from four to five.\n\n:: Panebase surveyed 1,003 voters in Scotland between Wednesday and Friday", "description": "The population north of the border is now split down the middle over whether to leave the union, according to Panelbase research.", "authors": ["James Tapsfield", "Political Editor For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/08/19647994-0-image-a-5_1570952775843.jpg", "published_at": "2019-10-13"}