{"pub": "nationalreview", "url": "https://news.sky.com/story/snake-on-a-plane-scottish-grandmother-finds-python-in-shoe-after-australia-flight-11648080", "downloaded_at": "2019-10-05 07:14:25.793330+00:00", "title": "Snake on a plane: Scottish grandmother finds python in shoe after Australia flight", "language": "en", "text": "Snake on a plane: Scottish grandmother finds python in shoe after Australia flight\n\nSnake on a plane: Scottish grandmother finds python in shoe after Australia flight\n\nThe snake has been identified as a non-venomous spotted python. Pic: SPCA\n\nScottish grandmother Moira Boxall returned from a trip to Australia to discover a snake curled up inside a shoe in her suitcase.\n\nThe reptile, which had smuggled itself onto her 9,000-mile flight from Queensland to Glasgow, had begun shedding its skin during the journey.\n\nPaul Airlie, Ms Boxall's son-in-law, told Australian broadcaster ABC News that the grandmother had initially mistaken the creature for a toy placed in her luggage as a prank.\n\nAfter realising the snake was real, she covered the shoe with a box and called Airlie, who contacted the Scottish SPCA.\n\nImage: The reptile was found curled up in a shoe after the 9,000 mile flight. Pic: SPCA\n\nScottish SPCA animal rescue officer Taylor Johnstone said: \"I can confirm that we removed a snake from a property in Bridge of Allan.\n\nAdvertisement\n\n\"I responded to a call from a woman who had just returned from a holiday in Australia who had found a small snake inside her shoe in her suitcase.\n\n\"When I arrived, the snake had been contained by the caller, so I safely removed the snake from the property.\"\n\nMs Boxall is apparently not keen to return to Australia after the ordeal, her son-in-law said.\n\nThe SPCA later identified the snake as a non-venomous spotted python and said it is now in quarantine in Edinburgh.\n\nImage: The snake had begun shedding its skin during the flight. Pic: SPCA\n\nThis is not the first time snakes have attempted to stow away on planes.\n\nA study by scientists from the University of Queensland found brown tree snakes, which devastated bird populations on Guam, travelled to the Pacific island by hitching a ride on military planes during World War II.\n\nIn 2018, a man tried to sneak a python onto a Barbados-bound flight from Miami by hiding it inside a computer hard drive.", "description": "Moira Boxall, who discovered the reptile hidden in her suitcase, initially thought it was a toy.", "authors": ["Emily Mee", "News Reporter"], "top_image": "https://e3.365dm.com/19/02/1600x900/skynews-snake-plane-python_4589625.jpg?20190225160115", "published_at": "2019-02-25"}