{"pub": "breitbart", "url": "https://breitbart.com/middle-east/2019/09/27/saudi-arabia-u-n-iranian-attacks", "downloaded_at": "2019-10-05 06:13:53.672180+00:00", "title": "Saudi Arabia at U.N.: ‘No Half-Measures’ Against ‘Vile and Cowardly’ Iran", "language": "en", "text": "Saudi Arabia’s foreign minister urged the world to unite against the “vile and cowardly” Iranian regime in his speech to the United Nations General Assembly on Thursday, identifying Tehran as a global threat that does not respond well to “appeasement.”\n\nMinister Ibrahim bin Abdulaziz Al-Assaf used the example of the September 14 attack on key Saudi oil facilities as an example of the threat Iran poses to the world. A combined million and drone attack, he said, took 5.7 barrels of oil out of production, sending global oil prices soaring. Yemen’s Shiite Houthi rebels claimed responsibility for the attack, but both Saudi and American officials concluded that the drones could not have come from Yemen and Iran clearly executed the attack.\n\nThe Houthi rebels, who have waged a civil war against Yemen’s legitimate government since 2015, are closely allied to the Iranian regime.\n\n“I had hoped to talk today about the efforts of my country … to fulfill the purposes of the United Nations Charter,”Al-Assaf said, opening his speech. “I wanted to talk about the country’s ongoing economic development and reforms in various fields – the vision that takes us back to our true Islamic faith that rejects all forms of extremism.”\n\n“However, the aggressive act of September 14 on the kingdom’s oil facilities violated the principles of this organization as enshrined in its Charter and threatened the security, stability, and prosperity of our region and the world. This aggression requires, from all of us, a historic position,” he continued.\n\nAl-Assaf plainly blamed Iran for the attack and called it “a flagrant violation of international laws and regulations” and “violations of international peace and security and … a significant threat to global oil supplies.”\n\nHe went on to excoriate Iran for being “a vile and cowardly regime which hides behind its affiliated militias, pushing them to claim responsibility … that same regime views our states and peoples only as a battlefield to achieve its subversive agenda.”\n\n“We’ve known this regime for 40 years. It is good at nothing but masterminding explosions, destruction, and assassinations – not only in our region, but also throughout the world,” Al-Assaf continued, identifying Middle Eastern nations like Bahrain, Kuwait, and Lebanon – but also European states like France and Denmark – as having been the target of Iranian terrorist attacks. Iran has also orchestrated terrorist attacks in Argentina and maintains a close relationship with Hezbollah-affiliated members of the socialist regime in Venezuela.\n\n“We are dealing with a rogue and terrorist regime,” Al-Assaf asserted.\n\nThe foreign minister decried prior attempts to negotiate with Iran as “half-measures” and “appeasement,” not naming President Barack Obama directly as the architect of pro-Iran policies but blaming “partial and interim agreements” like the Joint Comprehensive Plan of Action (JCPOA), or Iranian nuclear deal, for emboldening the regime.\n\n“Appeasement with the Iranian regime … has increased its terrorist and aggressive activities over the last four years,” Al-Assaf said.\n\n“The recent attacks are a real test of the international community’s will. This organization, as well as the entire world, is faced with a moral and historic responsibility to take a firm and unified position,” he added. “Utmost pressure should be applied using every tool available to end the terrorist and aggressive behavior of the Iranian regime.”\n\nIran has two choices, he said in concluding his speech: “either become a normal state that respects international laws and norms or face an international unified position that chooses all instruments of pressure and deterrence.”\n\nThe foreign minister ended his speech with a threat to those who wish to harm his country: Saudi Arabia “will stop at nothing to defend its holy sites and its sovereignty.”\n\nThe attack on Saudi Arabia’s Abqaiq facility this month triggered global economic panic, given how much of the world depends on Saudi oil. Thanks to the oil boom in the United States, American oil prices were largely unaffected. The Trump administration nonetheless issued a stern condemnation of the attack. Secretary of State Mike Pompeo referred to it as “an act of war” by Iran.\n\nThe Iranians have rejected any responsibility for the attack but nonetheless praised it as successful.\n\n“Despite lack of equipment, Yemen has smart people. They adopted a clever retaliatory measure in recent days and used their right to self-defense,” Alaeddin Boroujerdi, an Iranian lawmaker, said of the attacks. “Yemen’s measure was a reaction to various illegal actions and war crimes of Saudi Arabia and had nothing to do with the Islamic Republic of Iran.”\n\nIranian President Hassan Rouhani admired that the missiles “did not hit a school, a hospital or a market, but attacked an industrial center to warn their enemies.”\n\nFollow Frances Martel on Facebook and Twitter.", "description": "Saudi Arabia's foreign minister urged the world to unite against the \"vile and cowardly\" Iranian regime in his speech to the United Nations General Assembly.", "authors": ["Frances Martel"], "top_image": "https://media.breitbart.com/media/2019/09/Abdulaziz-Al-Assaf-640x335.jpg", "published_at": "2019-09-27"}