{"pub": "realclearpolitics", "url": "https://thehill.com/opinion/campaign/463663-take-trump-literally-and-seriously-in-minnesota", "downloaded_at": "2019-10-01 11:44:25.059703+00:00", "title": "Take Trump literally and seriously in Minnesota", "language": "en", "text": "The last time a Republican won Minnesota’s electoral votes was in 1972, when President Nixon nearly swept the map, carrying every state except for Massachusetts and the District of Columbia. Going into the 2016 elections, a lot of people treated Minnesota like a lock for Hillary Clinton Hillary Diane Rodham ClintonClinton jokes she 'never' had to tell Obama not to 'extort foreign countries' Krystal Ball: Potential Ocasio-Cortez endorsement of Sanders would be 'a no-brainer' Trump asked Australian leader to help look into Mueller probe's origins: report MORE, but then Donald Trump stunned Democrats by nearly winning the state.\n\nAs President Trump Donald John TrumpKamala Harris calls for Twitter to suspend Trump account over whistleblower attacks Clinton jokes she 'never' had to tell Obama not to 'extort foreign countries' John Dean: 'There is enough evidence' to impeach Trump MORE continues to ramp up his re-election campaign, he just announced yet another campaign rally in Minnesota. He’s made it clear he’s taking another run at Minnesota’s electoral votes, and it’s not just bluster — Trump is putting his money where his mouth is. Mathematically, it makes sense, and not just because the margin was so close in 2016. Democrats could win back Michigan, Pennsylvania and Wisconsin in 2020 but still lose the White House if President Trump flips Minnesota. It’s part of a larger play by the president’s team to contest not just Minnesota, but also New Mexico, Nevada and New Hampshire, states he lost in 2016 but are by no means unwinnable for Republicans.\n\nMuch as Democrats would like to think they’re just paying the president’s legal bills, the RNC and Trump campaign are clearly using their massive war chest to invest in states they intend to contest. In Minnesota this represents a national investment by the GOP the likes of which we haven’t seen in a generation for a presidential race, and it’s already producing results. Right now, the president’s team is on track to have as many as 30 paid staff on the ground by the end of October – this October – and the Trump team turned out more than 600 volunteers at trainings across the state this summer, including 250 at one of them.\n\nADVERTISEMENT\n\nLast year suburban voters helped Democrats carry the 2nd and 3rd Congressional Districts — seats Republicans had held for years despite repeated Democratic attempts to flip them. But that’s not the whole story. Republicans flipped just a few U.S. House seats in 2018, and two of them were in Minnesota, both largely rural districts that Democrats had held firmly for years. Republicans are counting on that shift to help them carry the state next year, which is why the leading Super PAC supporting President Trump’s re-election is making a big investment in Minnesota on top of what we’re seeing from his campaign and the Republican National Committee.\n\nNational Democrats and the Minnesota Democratic Farmer Labor Party (DFL) have to take the president literally and seriously when he talks about making Minnesota a priority in this campaign, and not just because we want to elect a Democratic president. The president’s performance and Republican turnout will have an impact up and down the ballot, and there’s a lot more at stake in Minnesota than just electoral votes. The DFL is defending a U.S. Senate seat, they’re trying to pick up one or two competitive House seats while defending three others, and, with the 2020 census and redistricting right around the corner, they’re fighting to defend their majority in the state House of Representatives and retake the majority in the state Senate.\n\nWhile our party is focused on a primary fight, President Trump and the Republican Party is focused on the general election. And Democrats can laugh all they want at Trump’s push to expand the map to states like Minnesota. But failing to take it seriously and respond appropriately could not only cost Democrats the White House, but also set back the DFL for years to come.", "description": "Democrats could win back Michigan, Pennsylvania and Wisconsin in 2020 but still lose the White House if President Trump flips Minnesota.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trump-minnesota-rally-getty-060518.jpg", "published_at": "2019-09-30"}