{"pub": "blastingnews", "url": "https://us.blastingnews.com/world/2019/10/kim-jong-un-rides-a-white-horse-to-snow-covered-mount-paektu-003001201.html", "downloaded_at": "2019-10-17 11:34:59.769284+00:00", "title": "Kim Jong-un rides a white horse to snow-covered Mount Paektu", "language": "en", "text": "Mount Paektu is the highest mountain in north korea and Kim Jong-un climbed it once again. He was on horseback. The mountain holds a special significance for the people of the country because it is the birthplace of Kim Jong-un's father. Kim has scaled the 9000-feet (2,750-metre) peak more than once. It usually preceded any major announcement. Obviously, the world is curious to know what the leader has to say.\n\nIt is common knowledge that the hermit kingdom is in a crisis and affected by the sanctions imposed on it because of its nuclear ambitions. Kim had shown a willingness to discuss the issue and met Donald Trump for face-to-face talks twice but they were non-productive.\n\nThe BBC reports about another round of talks between officials of the United States and North Korea held earlier this month in Sweden.\n\nIt followed a brief meeting President Donald Trump had with Kim Jong-un at the DMZ in June. The talks held now failed to arrive at an acceptable formula. In the words of the North Korean envoy, the negotiations have \"not fulfilled our expectation and finally broke off.\" The US, on its part, maintained that the discussions were “good.” Incidentally, before the talks began, North Korea conducted its 11th test this year by launching a new type of ballistic missile.\n\nDon’t miss the latest news! Click on the topic you interest most. We'll keep you updated with all the news you shouldn't miss. Donald Trump\n\nThe North Korean state media called Kim Jong-un’s horseback ride “a great event of weighty importance in the history of the Korean revolution” https://t.co/jZlpwrrlDj — New York Times World (@nytimesworld) October 16, 2019\n\nPrevious visits to Mount Paektu\n\nMount Paektu is an active volcano located some distance from Pyongyang, the capital of North Korea. It is on the border between North Korea and China and Koreans consider it to be the birthplace of Dangun who founded the first Korean kingdom.\n\nThat was more than 4,000 years ago. Kim Jong-un came to the mountain in 2017 a few weeks before he gave his New Year’s address. The global community welcomed it because it dropped hints of a changed perception related to the South and a possible diplomatic thaw.\n\nThe images, released by the state news agency, were accompanied by a gushing text about the “noble glitters” in the leader's eyes, and labelled the horseback ride “a great event of weighty importance” for the nation. https://t.co/84yxgu4P9n — The Times (@thetimes) October 16, 2019\n\nSubsequently, he visited it in 2018 along with Moon Jae-in, President of the South. In fact, Kim Jong-un climbed Mount Paektu at least three times.\n\nThe BBC quotes KCNA, the official news agency as saying – \"His march on horseback in Mt Paektu is a great event of weighty importance in the history of the Korean revolution.\"\n\nKim Jong-un keeps the world guessing\n\nAccording to Independent UK, the trip of the North Korean leader to Mount Paektu could be a prelude to a major announcement. That is the opinion of analysts because Kim Jong-un pays a visit to this place before he announces any shift in policy.\n\nHe did it in 2017 just before his country launched its largest intercontinental ballistic missile, and weeks before hinting at a diplomatic thaw with its southern neighbor.\n\nLast year he accompanied South Korean President Moon Jae-in to the top of the mountain. It was part of a historic summit. However, the progress on denuclearization is slow and the North has conducted several short-range missile tests in the recent past. President Donald Trump has not assigned much importance to such activities. He is determined to arrive at a diplomatic deal that could cement his legacy.", "description": "The North Korean leader went up this mountain in the past before making any major announcement and the world is waiting to know what is in his mind.", "authors": ["Music Crowns", "Oliver Vandervoort", "Zeegee Cecilio", "Ramon Sanchez", "Read More On The Same Topic Prabir Ghose", "Meghan Markle Says Archie Has Ginger Colored Hair Like His Father Prince Harry", "The Netherlands", "Family Of Seven Adults Lived Nine Years In Isolation", "If Michelle Obama Contested She Could Be The Democratic Party Frontrunner"], "top_image": "https://staticr1.blastingcdn.com/media/photogallery/2019/10/17/os/b_1200x630/north-koreas-kim-rides-white-stallion-ahead-of-great-operation-image-sourcethe-star-online-youtube-video_2340603.jpg", "published_at": "2019-10-17"}