{"pub": "independent", "url": "https://independent.co.uk/life-style/gadgets-and-tech/news/google-21-birthday-doodle-homepage-search-engine-history-internet-archive-a9121906.html", "downloaded_at": "2019-09-26 16:44:34.406961+00:00", "title": "Google turns 21: What the search giant’s homepage looked like when it first began", "language": "en", "text": "It is Google’s 21st birthday, and it is looking very grown up.\n\nThe home page of Google and the search results that show when you use it are nowadays a frenzy of rich content: showing not just web pages but doodles, sports results, and images.\n\nBut back in 1998, when the site was born, it looked wildly different.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThere are recognisable parts of the old version of the site: it’s similar colourful design, and that all-important search box.\n\nBut much else is very different. For one, the site was at that time referred to as “Google!”, with the shouting exclamation mark that introduced it to the world.\n\nIf you would prefer to actually use the old version of Google yourself, it is saved inside of the internet archive. Clicking this link will take you to that cached version – and you can even fast forward to how it looked later on, too.\n\nOver time, the search page actually becomes more simple, dropping the “special searches” and newsletter sign up in favour of the very simple page that appears to users today. But, of course, that appearance only hides the vast complexity that underpins today’s Google, including the autocomplete option that cleverly guesses what you might be searching, and the live search results that show you information even before you stop typing.\n\nGoogle’s official story began in 1995, at Stanford University, where founders Larry Page and Sergey Brin first met. Page, then considering Stanford for graduate study, was being shown around by student Sergey Bring – and there the pairing began.\n\nShape Created with Sketch. The best Google Doodles Show all 50 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The best Google Doodles 1/50 Mister Rogers Google Doodle celebrating children's TV presenter Mister Rogers Google 2/50 Lucy Wills Google Doodle celebrating haematologist Lucy Wills Google 3/50 Falafel Google Doodle celebrating falafel Google 4/50 St George's Day Google Doodle celebrating St George's Day Google 5/50 James Wong Howe Google Doodle celebrating Hollywood golden age cinematographer James Wong Howe Google 6/50 Seiichi Miyake Google Doodle celebrating Seiichi Miyake, developer of tactile paving Google 7/50 Walter Cronkite Google celebrates US broadcast journalist Walter Cronkite's 100th birthday 8/50 Lantern Festival 2016 Google celebrates the last day of the Chinese New Year celebrations with a doodle of the Lantern Festival Google 9/50 Google Doodle celebrating Sergei Diaghilev Google Doodle celebrating art critic Sergei Diaghilev Google 10/50 George Boole Google marks mathematician George Boole's 200th birthday 11/50 Sergei Eisenstein Google Doodle celebrating soviet film director Sergei Eisenstein Google 12/50 41st anniversary of the discovery of 'Lucy' Google marks the 41st anniversary of the discovery of 'Lucy', the name given to a collection of fossilised bones that once made up the skeleton of a hominid from the Australopithecus afarensis species, who lived in Ethiopia 3.2 million years ago 13/50 Elizabeth Garrett Anderson Google celebrates physician and suffragist Elizabeth Garrett Anderson 180th birthday 14/50 Sir William Henry Perkin Google Doodle celebrating chemist Sir William Henry Perkin Google 15/50 Nelly Sachs Google Doodle celebrating poet and playwright Nelly Sachs Google 16/50 Thanksgiving 2018 Google Doodle celebrating Thanksgiving 2018 Google 17/50 Nigerian Independence Day Google Doodle celebrating Nigerian Independence Day Google 18/50 Mary Prince Google Doodle celebrating abolitionist Mary Prince Google 19/50 Father's Day 2016 Google celebrates Father's Day 20/50 Ebenezer Cobb Morley Google Doodle celebrating \"father of football\" Ebenezer Cobb Morley Google 21/50 Octavia E Butler Google Doodle celebrating science fiction author Octavia E Butler Google 22/50 Tamara de Lempicka Google Doodle celebrating painter Tamara de Lempicka Google 23/50 Johann Carl Friedrich Gauss Google Doodle celebrating mathematician and physicist Johann Carl Friedrich Gauss Google 24/50 Fanny Blankers-Koen Google Doodle celebrating Dutch Olympic gold medalist Fanny Blankers-Koen Google 25/50 John Harrison Google Doodle celebrating clockmaker John Harrison Google 26/50 Guillermo Haro Google Doodle celebrating astronomer Guillermo Haro Google 27/50 St. David's Day Google Doodle celebrating St. David's Day Google 28/50 Carter G Woodson Google Doodle celebrating Carter G Woodson, a pioneering African-American historian Google 29/50 St Andrew's Day Google Doodle celebrating St Andrew's Day Google 30/50 Gertrude Jekyll Google Doodle celebrating horticulturist Gertrude Jekyll Google 31/50 Children's Day 2017 Google Doodle celebrating Children's Day 2017 Google 32/50 Studio for Electronic Music Google Doodle celebrating the Studio for Electronic Music Google 33/50 Olaudah Equiano Google Doodle celebrating abolitionist Olaudah Equiano Google 34/50 Fridtjof Nansen Google Doodle celebrating Norwegian explorer Fridtjof Nansen Google 35/50 Ladislao José Biro Google celebrates Ladislao José Biro's 117th birthday 36/50 Amalia Hernandez Google Doodle celebrating ballet choreographer Amalia Hernandez Google 37/50 Dr Samuel Johnson Google Doodle celebrating lexicographer Dr Samuel Johnson Google 38/50 British Sign Language Google Doodle celebrating British Sign Language Google 39/50 Eduard Khil Google Doodle celebrating baritone singer Eduard Khil Google 40/50 Fourth of July Google Doodle celebrating Fourth of July Google 41/50 Victor Hugo Google Doodle celebrating author Victor Hugo Google 42/50 Google Doodle celebrating Giro d'Italia's 100th Anniversary Google Doodle celebrating Giro d'Italia's 100th Anniversary Google 43/50 Google Doodle celebrating St. Patrick's Day Google Doodle celebrating St. Patrick's Day Google 44/50 Google Doodle celebrating St. David's Day Google Doodle celebrating St. David's Day Google 45/50 Steve Biko Today's Google Doodle features anti-apartheid activist Steve Biko Google 46/50 The history of tea in Britain Google celebrates the 385th anniversary of tea in the UK 47/50 Nettie Stevens Google celebrates geneticist Nettie Stevens 155th birthday 48/50 William Morris Google celebrates English polymath William Morris' 182 birthday with a doodle showcasing his most famous designs Google 49/50 Professor Scoville Google marks Professor Scoville’s 151st birthday 50/50 Sophie Taeuber-Arp Google marks artist Sophie Taeuber-Arp's 127th birthday 1/50 Mister Rogers Google Doodle celebrating children's TV presenter Mister Rogers Google 2/50 Lucy Wills Google Doodle celebrating haematologist Lucy Wills Google 3/50 Falafel Google Doodle celebrating falafel Google 4/50 St George's Day Google Doodle celebrating St George's Day Google 5/50 James Wong Howe Google Doodle celebrating Hollywood golden age cinematographer James Wong Howe Google 6/50 Seiichi Miyake Google Doodle celebrating Seiichi Miyake, developer of tactile paving Google 7/50 Walter Cronkite Google celebrates US broadcast journalist Walter Cronkite's 100th birthday 8/50 Lantern Festival 2016 Google celebrates the last day of the Chinese New Year celebrations with a doodle of the Lantern Festival Google 9/50 Google Doodle celebrating Sergei Diaghilev Google Doodle celebrating art critic Sergei Diaghilev Google 10/50 George Boole Google marks mathematician George Boole's 200th birthday 11/50 Sergei Eisenstein Google Doodle celebrating soviet film director Sergei Eisenstein Google 12/50 41st anniversary of the discovery of 'Lucy' Google marks the 41st anniversary of the discovery of 'Lucy', the name given to a collection of fossilised bones that once made up the skeleton of a hominid from the Australopithecus afarensis species, who lived in Ethiopia 3.2 million years ago 13/50 Elizabeth Garrett Anderson Google celebrates physician and suffragist Elizabeth Garrett Anderson 180th birthday 14/50 Sir William Henry Perkin Google Doodle celebrating chemist Sir William Henry Perkin Google 15/50 Nelly Sachs Google Doodle celebrating poet and playwright Nelly Sachs Google 16/50 Thanksgiving 2018 Google Doodle celebrating Thanksgiving 2018 Google 17/50 Nigerian Independence Day Google Doodle celebrating Nigerian Independence Day Google 18/50 Mary Prince Google Doodle celebrating abolitionist Mary Prince Google 19/50 Father's Day 2016 Google celebrates Father's Day 20/50 Ebenezer Cobb Morley Google Doodle celebrating \"father of football\" Ebenezer Cobb Morley Google 21/50 Octavia E Butler Google Doodle celebrating science fiction author Octavia E Butler Google 22/50 Tamara de Lempicka Google Doodle celebrating painter Tamara de Lempicka Google 23/50 Johann Carl Friedrich Gauss Google Doodle celebrating mathematician and physicist Johann Carl Friedrich Gauss Google 24/50 Fanny Blankers-Koen Google Doodle celebrating Dutch Olympic gold medalist Fanny Blankers-Koen Google 25/50 John Harrison Google Doodle celebrating clockmaker John Harrison Google 26/50 Guillermo Haro Google Doodle celebrating astronomer Guillermo Haro Google 27/50 St. David's Day Google Doodle celebrating St. David's Day Google 28/50 Carter G Woodson Google Doodle celebrating Carter G Woodson, a pioneering African-American historian Google 29/50 St Andrew's Day Google Doodle celebrating St Andrew's Day Google 30/50 Gertrude Jekyll Google Doodle celebrating horticulturist Gertrude Jekyll Google 31/50 Children's Day 2017 Google Doodle celebrating Children's Day 2017 Google 32/50 Studio for Electronic Music Google Doodle celebrating the Studio for Electronic Music Google 33/50 Olaudah Equiano Google Doodle celebrating abolitionist Olaudah Equiano Google 34/50 Fridtjof Nansen Google Doodle celebrating Norwegian explorer Fridtjof Nansen Google 35/50 Ladislao José Biro Google celebrates Ladislao José Biro's 117th birthday 36/50 Amalia Hernandez Google Doodle celebrating ballet choreographer Amalia Hernandez Google 37/50 Dr Samuel Johnson Google Doodle celebrating lexicographer Dr Samuel Johnson Google 38/50 British Sign Language Google Doodle celebrating British Sign Language Google 39/50 Eduard Khil Google Doodle celebrating baritone singer Eduard Khil Google 40/50 Fourth of July Google Doodle celebrating Fourth of July Google 41/50 Victor Hugo Google Doodle celebrating author Victor Hugo Google 42/50 Google Doodle celebrating Giro d'Italia's 100th Anniversary Google Doodle celebrating Giro d'Italia's 100th Anniversary Google 43/50 Google Doodle celebrating St. Patrick's Day Google Doodle celebrating St. Patrick's Day Google 44/50 Google Doodle celebrating St. David's Day Google Doodle celebrating St. David's Day Google 45/50 Steve Biko Today's Google Doodle features anti-apartheid activist Steve Biko Google 46/50 The history of tea in Britain Google celebrates the 385th anniversary of tea in the UK 47/50 Nettie Stevens Google celebrates geneticist Nettie Stevens 155th birthday 48/50 William Morris Google celebrates English polymath William Morris' 182 birthday with a doodle showcasing his most famous designs Google 49/50 Professor Scoville Google marks Professor Scoville’s 151st birthday 50/50 Sophie Taeuber-Arp Google marks artist Sophie Taeuber-Arp's 127th birthday\n\nInitially, the pair were said to have fallen out about just about everything. Eventually, however, they came to realise they could work together, and they did: to create a website called Backrub.\n\nThat website soon had its name changed, to Google. That name was chosen because of the number 1 followed by 100 zeroes, an attempt to reflect the fact the pair were trying to organise the vast amount of information in the world.\n\nFrom there, Google continued to grow. It received its first investment, for $100,000, in August 1998 – marking one of its many birthdays. The technology grew, too, from the first server made of lego to the vast farms that power the company today.\n\nSo, too, grew the website itself, from the clunky vision of the early web that it appeared as in 1998 to today’s deceivingly simple homepage.", "description": "It is Google’s 21st birthday, and it is looking very grown up. The home page of Google and the search results that show when you use it are nowadays a frenzy of rich content: showing not just web pages but doodles, sports results, and images.", "authors": ["Andrew Griffin"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/26/17/google.jpg", "published_at": "2019-09-26"}