{"pub": "independent", "url": "https://independent.co.uk/voices/brexit-deal-vote-latest-boris-johnson-letwin-amendment-mps-a9162686.html", "downloaded_at": "2019-10-19 12:31:38.009941+00:00", "title": "As MPs finally hear what Brexit really means, Boris Johnson's deal is unravelling fast", "language": "en", "text": "Boris Johnson must always have known that his best tactic to get his Brexit deal through Parliament was to bounce the Commons into accepting it. It is a bad deal and does not survive close scrutiny. The Commons is proving it so, as the prime minister tries and fails to convince his critics this morning.\n\nThe Johnson deal, it is increasingly clear, means everything and nothing – especially the parts about worker, consumer and environmental protection, now in the woolly Political Declaration, which is about as legally binding as the the sincere personal pledge by Johnson never to put an economic border down the Irish Sea.\n\nJohnson, the “greased piglet”, the most shameless snake oil salesman on political history, a man this title has described as boasting the \"morals of an alley cat\", should not be taken at his word by any Labour or Liberal Democrat (or, for that, matter Tory) MP.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHence the PM's attempt to pull off the \"Boris bounce\" and hoodwink the Commons with a rushed vote. Hence too the dramatic urgency of a Saturday sitting. Hence dishing out a think 500 plus page legal text on the very morning of the \"meaningful vote\", and when there to be complex arguments about its terms. Hence the whipping. Hence the bogus promises given to all sides.\n\nShape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty\n\nAs Tony Blair says, if Johnson has been promising to liberalise labour markets to his Thatcherite European Research Group mates as well as pledging to protect workers rights to Labour backbenchers, both cannot be right. Johnson will most likely follow his own Thatcherite instincts and not those of the Labour old left. Hence, too, the refusal to publish the accompanying legal advice and a fresh economic assessment of the damage his deal will do, though the country deserves to know how many jobs will be lost under the Johnson plan, cooked up a bunch of ideologies who want to relive the 1980s.\n\nThe Johnson deal can morph (indeed, is designed to evolve) quite easily into no deal when the transition period ends in 2020, or 2021. That needs to be outlawed via a new Benn Act. The arrangements for Northern Ireland need to be tested legally against the Belfast Good Friday Agreement. The deal needs to be put to the people for a Final Say. The Johnson deal will soon unravel.\n\nThe holes and contradictions and obfuscations in the Johnson deal represent the seeds of its own destruction. It is promising too many things to many people that cannot be simultaneously true. The Letwin amendment gives parliament and people the time and space to look through the Johnson deal and discover its true and often horrifying nature. It puts into slow motion the conjuror Johnson’s sleight of hand. It will make ministers account for their policy before granting the deal parliamentary approval.\n\nAbove all it will give the voters the ability to fully understand – for the first time in fact – to understand what Brexit really means, to make their own judgement and to choose their destiny in the final say referendum which remains the only way out of the Brexit crisis.", "description": "Boris Johnson must always have known that his best tactic to get his Brexit deal through Parliament was to bounce the Commons into accepting it. It is a bad deal and does not survive close scrutiny. The Commons is proving it so, as the prime minister tries and fails to convince his critics this morning.", "authors": ["Sean O'Grady"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/19/11/Johnson.jpg", "published_at": "2019-10-19"}