{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/2019/09/11/north-carolina-republicans-overrode-budget-veto-while-democrats-were-ceremony", "downloaded_at": "2019-09-12 07:25:50.181875+00:00", "title": "North Carolina Republicans vote to override a budget veto in half-empty Assembly during 9/11 remembrance", "language": "en", "text": "While most North Carolinians were remembering the lives lost on Sept. 11, 2001, the Republican leaders in the General Assembly took advantage of a half-empty House and voted to override the governor’s budget veto Wednesday morning.\n\nGov. Roy Cooper (D) said in a news conference that House Republicans called for a “surprise vote” while he and House members were honoring first responders on the anniversary of 9/11.\n\n“Republicans called a deceptive surprise override of my budget veto,” Cooper said. “Unfortunately, it’s the people of North Carolina who lose.”\n\nHouse Minority Leader Darren Jackson (D) said he told his caucus members that they did not need to be in attendance and that state Rep. David Lewis (R), chairman of the Rules, Calendar and Operations Committee, gave Jackson his word that there would be no votes, according to the News & Observer.\n\nRepublican leaders denied giving any such assurance. The Associated Press reported that the office of Republican Speaker Tim Moore provided audio from Tuesday’s floor session of Lewis saying that recorded votes would happen Wednesday.\n\nRepublicans also disputed the claim by the governor and other Democrats that many of them were attending events remembering 9/11 victims and first responders. Local news reports said only one or two Democrats claimed to have been attending a 9/11 memorial at the time of the vote.\n\nRepublicans were unable to override the veto for about two months as long as Democrats were present in the chamber, Cooper said. The General Assembly needs a three-fifths majority to override a veto, which Republicans lack.\n\nThe House is allowed to conduct business as long as at least 61 of 120 members are present. There were 64 members present Wednesday morning.\n\n\n\nNorth Carolina Gov. Roy Cooper (D) said Wednesday that House Republicans called for a “surprise vote” while he and House members were marking the anniversary of 9/11. (Gerry Broome/AP)\n\nRep. Jason Saine (R) made the motion to review the budget shortly before 9 a.m., according to the News & Observer, and Moore dismissed objections from the Democrats present.\n\nThe vote went ahead with the members present. The result was a veto override, 55 to 9.\n\nDemocrats in the chamber cried foul, and Jackson later said he wants Lewis to recall the veto before it reaches the Senate.\n\n“This is a tragedy. This is a travesty of the process, and you know it,” Rep. Deb Butler (D) yelled before the vote began. “Mr. Speaker, how dare you, Mr. Speaker!”\n\nState Rep. Mary Belk (D) said at a news conference that Moore “kept talking over us. He turned off our mics,” the AP reported.\n\nIn a tweet shortly after the vote, Democratic state Sen. Jeff Jackson called Republicans’ behavior “plainly unethical.”\n\nBREAKING: After telling Democrats there were no votes, House Republicans just called a *surprise vote* and overrode the Governor’s veto on the budget, 55-9 (with almost half of members absent).\n\n\n\nVeto still stands in the Senate.\n\n\n\nPlainly unethical behavior by Republicans today. — Sen. Jeff Jackson (@JeffJacksonNC) September 11, 2019\n\nAs Moore threatened to have Butler removed from the chamber, her Democratic colleagues surrounded her to prevent her arrest, according to video of the confrontation. Butler told Moore he would have to answer to the people of North Carolina.\n\n“It’s a great day for North Carolina,” Moore told the local TV outlet CBS 17.\n\nClarification: An earlier version of this article overly generalized the reason for Democrats’ absence from the General Assembly session. This version has been updated.\n\nRead more:\n\nDemocrats didn’t win in North Carolina’s special election, but here’s why they’re still celebrating\n\nWhy Trump cares so much about this special election in North Carolina\n\nWhy Democrats’ big gerrymandering win in North Carolina matters\n\nThe top five governor’s races of 2019 and 2020", "description": "The GOP state legislators did not have the votes to override the governor's veto as long as Democrats were present.", "authors": ["Lateshia Beachum", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/cEVGR2W9X8H3H0QuqGEEdVlGZ_A=/1484x0/d1i4t8bqe7zgj6.cloudfront.net/09-11-2019/t_90513e42b2614488a4922fe8a6e44015_name_1___1920x1080___30p_00_00_18_03_Still018.jpg", "published_at": "2019-09-11"}