{"pub": "marketwatch", "url": "https://mansionglobal.com/articles/1930s-connecticut-mansion-that-was-home-to-children-s-book-illustrator-robert-lawson-131686", "downloaded_at": "2019-10-08 11:39:28.314084+00:00", "title": "1930s Connecticut Mansion That Was Home to Children’s Book Illustrator Robert Lawson", "language": "en", "text": "Listing of the Day\n\nLocation: Westport, Connecticut\n\nPrice: $3.299 million\n\nThis brick-and-clapboard Georgian Colonial was the longtime home of children’s book authors and illustrators Robert and Marie Lawson.\n\nRobert Lawson's \"They Were Strong and Good,\" a children's book about the lives of his parents, won the Caldecott Medal for the most distinguished picture book for children in 1941. Four years later, he was given the Newbery Medal for his children's novel \"Rabbit Hill,\" which is set in and around his country home in Westport.\n\nRobert Lawson also illustrated other authors’ books for children, including the beloved \"Mr. Popper's Penguins\" by Richard and Florence Atwater and \"The Story of Ferdinand\" by Munro Leaf.\n\nThe Lawsons worked at easels that faced each other in a studio (now a den) in the north end of their home, according to an obituary in The New York Times. He died in 1957 at the age of 64. She died in 1956 at 62.\n\nMore: A Waterfront House in Connecticut Comes With Four Lots\n\nKnown as Rabbit Hill, the three-story house was built in 1936 and extensively renovated and expanded by the current owners soon after they bought it in 2000.\n\n\"They expanded the house for their family, using a well-known local architect, Peter Cadoux,\" listing agent Cathy McGee said. \"It’s all been updated, but they maintained the original character of the home.\"\n\nAs part of the renovation, the owners connected the garage to the house by adding a mudroom area, laundry room, powder room, back staircase and a family-style cook’s kitchen, turning the original kitchen into a full-service butler’s pantry.\n\nThe kitchen \"has been nicely renovated, with lighter colors,\" Ms. McGee said. \"It’s a real working kitchen, all updated to today’s standards.\"\n\nIt features an island with a breakfast bar and sink, a dedicated baking center, a dining area for six to eight people, and a waist-high wood-burning fireplace that can be used for cooking, with three rack heights, a swivel pot arm and custom iron doors.\n\nOpposite the kitchen is a large family room with 10-foot ceilings, a fireplace and windows on three sides.\n\nMore: Close to Downtown Westport, this Timeless Waterfront Mansion is on Connecticut’s Gold Coast\n\nA previous owner added a pentagonal, two-story library with floor-to-ceiling built-in cherry bookcases, a vaulted ceiling and French doors that open to a patio.\n\nThe second-floor master suite has his-and-hers bathrooms and closets and a private balcony that overlooks the pool and gardens. This level also has another three en-suite bedrooms as well as a fully outfitted guest or in-law suite at the end of the hall and separated by a landing.\n\nArchitectural and design details include the original brick façade, French pocket doors between the living and music rooms, five-inch-wide white oak flooring, custom cabinetry and moldings, and dormer windows on the third floor.\n\nThe property is very private, \"set back off the road and up on a hill,\" Ms. McGee said.\n\n\"The house is sited squarely in the middle of the six acres,\" she said. \"It has a privacy gate in front and a circular drive.\"\n\nThe property is dotted with mature plantings, including old-growth boxwoods, climbing hydrangeas, Japanese cut-leaf maples, a pair of ginkgoes, and stewartia and linden trees.\n\nFrom Penta: Christie’s to Offer Art Collection of Ron Miller and Diane Disney Miller\n\nAs depicted on the cover of \"Rabbit Hill\" a pair of pin oak trees still flank the front door. There are also vegetable, herb and flower cutting gardens.\n\nA signed first edition of “Rabbit Hill” on a shelf in the house. Steve Rossi\n\nStats\n\nThe 10,560-square-foot house has five bedrooms, seven full bathrooms and two partial bathrooms. It sits on a 5.66-acre lot.\n\nAmenities\n\nAmenities include a pool and a heated four-season pool house with a kitchenette, mature gardens, a three-car garage, extensive stone walls, central air conditioning, a Sonos sound system and a whole-house generator.\n\nMore: One of Connecticut’s ‘Grand Old Ladies’ Will Ask $6.7 Million\n\nNeighborhood Notes\n\nThe house is just outside the town center, Ms. McGee said.\n\n\"Westport is a destination town in Connecticut,\" she said. \"It’s a water community and it’s highly sought after.\"\n\n\"It has amazing beaches and public services, and a public golf course,\" she said. \"The schools are highly ranked—it’s just a phenomenal town.\"\n\nFor commuters to New York, the property is close to the Merritt Parkway and the Metro-North train station, she said. By express train, it’s about a 70-minute ride from Westport to Manhattan’s Grand Central Terminal.\n\nAgents: Cathy McGee and Emily Gordon, Coldwell Banker\n\nView the original listing. Write to Listing of the Day", "description": "The Westport house has been extensively renovated and expanded", "authors": ["Bill Cary"], "top_image": "https://static.mansionglobal.com/production/media/article-images/2b9e2a97cbb0c67c3599d25afb1dafc7/large_2.060119_D8E8243-1.jpg", "published_at": "2019-10-08"}