{"pub": "cnbc", "url": "https://cnbc.com/2017/05/10/websites-and-apps-millionaires-and-billionaires-use.html", "downloaded_at": "2019-09-30 05:29:47.395999+00:00", "title": "The super wealthy have their own exclusive versions of Amazon, Tinder and Instagram", "language": "en", "text": "When the ultra-rich use the internet, they don't do it the same way as the rest of us. In place of Amazon, Instagram and Tinder, they turn to their own exclusive apps and websites, as seen on an upcoming episode of CNBC's \"The Filthy Rich Guide.\"\n\nThe Filthy Rich Guide | CNBC\n\nOver-the-top shopping To buy anything from a $18 million private jet to a $52 million yacht online (yes, really), the filthy rich turn to James Edition, a shopping site that specializes in extravagant items and brands itself as \"The World's Largest Luxury Marketplace.\" The site lets users search by category, such as \"Helicopters\" or \"Yachts,\" or by brand, if you're specifically looking for a Rolex or a Porsche. You can even book travel through the site, including hotel stays and activities like a polar bear safari. But sometimes the rich are looking for items even more over-the-top. Luckily, the site's \"Extraordinaire\" category sells items like a chair made of chrome-plated AK-47s, presumably for the billionaire who has everything.\n\nA post shared by Rich Kids Of Instagram (@richkidsofinstagram) on May 6, 2017 at 6:38am PDT\n\nThe other rich kids of Instagram\n\nBut what good is it to be rich if you can't show it off? While the average person might turn to Instagram to brag about their wealth, the mega-rich can afford to boast on \"Rich Kids,\" an exclusive photo sharing network. For $1,000 a month on Rich Kids, you're guaranteed to only see photos from other wealthy patrons. Similar to the check marks that denote verified Facebook and Twitter accounts, the app's prohibitive monthly fee ensures that everyone who uses it is certifiably wealthy.\n\nCaiaimage | Sam Edwards | Getty Images", "description": "The filthy rich don't use the internet like the rest of us.", "authors": ["Emmie Martin"], "top_image": "https://image.cnbcfm.com/api/v1/image/104460272-Rich_couple_champagne.jpg?v=1529475058", "published_at": "2017-05-10"}