{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/anti-china-demonstrations-in-hong-kong-quickly-devolve-into-clashes-and-chaos/2019/09/29/1ee4aa38-e23d-11e9-be7f-4cc85017c36f_story.html", "downloaded_at": "2019-09-29 23:31:04.123732+00:00", "title": "Hong Kong police smash anti-China demonstration, creating chaos", "language": "en", "text": "\n\nRiot police officers are seen amid tear gas during a demonstration in Admiralty district Hong Kong. (Athit Perawongmetha/Reuters)\n\nAn unauthorized march against totalitarianism and Beijing’s grip on Hong Kong quickly devolved into chaos Sunday, as police fired rounds of tear gas and made arrests to stop the crowd of thousands from protesting — kicking off another day of conflict in what has become the new normal in this global financial hub.\n\nIt was among the most aggressive police responses in the 17 weeks of demonstrations, amid growing sensitivity over the rapidly approaching anniversary of the founding of the People’s Republic of China. Several people were seriously injured, including an Indonesian journalist based in Hong Kong who was hit in the eye by a projectile while live-streaming the event for her publication.\n\nAs police intensify their efforts to crush the protests, they are facing more resistance from ordinary people who are increasingly joining protests and hurling abuse at officers.\n\nDespite the forceful police response, the protesters persevered and scattered across central areas of the city. Some set fires, broke windows at subway stations and threw bricks at officers. Street battles broke between protesters and police who struggled to keep the demonstrators at bay with rubber bullets and tear gas.\n\n[‘We are back’: Hong Kong protesters mark anniversary of Umbrella Movement in face of police water cannons ]\n\nResidents and tourists were caught in the crossfire, clutching their faces and running in fear in several areas, including the neon-lit luxury shopping district of Causeway Bay.\n\nAbout 5 p.m., police launched an aggressive clearance operation against protesters occupying Harcourt Road, where clashes have broken out frequently during the past four months. Police pushed young demonstrators to the asphalt road and dragged them away, leaving pools of blood. Hong Kong’s hospital authority said 13 people were admitted to hospitals by 7:30 p.m., including one in serious condition.\n\nThe protesters are determined to show Beijing that they wholly reject the erosion of their promised freedoms and see this as their opportunity to push for the right to directly elect the leaders of the city.\n\n“If they respect us, then we will respect them,” said Michael, a 28-year-old protester who works in the banking industry. “But if they don’t respect our democracy or human rights, then why do I need to respect them?”\n\nProtesters tore down signs and flags hoisted in advance of the 70th anniversary celebrations, setting fire to some.\n\n\n\nAnti-government protesters run away from amid blue-coloured sprayed water during a demonstration near the Legislative Council building. (Athit Perawongmetha/Reuters)\n\nAt times, riot police appeared outnumbered. Shoppers at a luxury mall in central Hong Kong looked on as police and protesters engaged in a pitched battle. Protesters crouched, created a phalanx of umbrellas and tossed bricks and bottles toward the officers. Police fired round after round of tear gas.\n\nThe protesters inched forward as rubber bullets shredded their umbrellas. When it appeared the police might be outflanked, officers made a hasty retreat. Protesters seized the moment, rushing toward officers piling into police vans.\n\nDemonstrators, cheered by onlookers and fellow marchers, hit the vans with poles and bottles as the vehicles sped away. The road was littered with glass and spent tear-gas canisters clinked across the asphalt as the protesters continued their march.\n\nAt nightfall in the nearby neighborhood of Wan Chai, residents left their homes and workplaces to jeer at police and pelt their vehicles with bricks and bottles.\n\nPolice responded by firing tear gas into the crowd, which included elderly residents.\n\nSeveral protesters were hurt during the day, including one who was briefly unconscious and another who was dragged away by several officers because he couldn’t walk. Several bled while ambulances rushed to the scene.\n\n\n\nRiot police officers fire tear gas to disperse anti-government protesters after a march in Hong Kong. (Athit Perawongmetha/Reuters)\n\nPolice arrested protesters, lining them up against a wall outside a government building plastered with posters and graffiti denouncing police violence. Officers frisked the protesters and took them away. A spokeswoman for the police force said she could not immediately give the number of arrests.\n\nAfter one clash, police regrouped and then charged protesters. “Go, go, go,” a commanding officer shouted as dozens of tactical and riot officers sprinted down the street. Officers tackled demonstrators, pinning them to the ground and blocking journalists’ cameras as they made arrests.\n\n\"Go, Go, Go!\" Raptor and riot police charge toward Pacific Place in Hong Kong this afternoon appeared to be lead by Rupert Dover. pic.twitter.com/3WHLCfGLdZ — Timothy McLaughlin (@TMclaughlin3) September 29, 2019\n\nThe protest movement was sparked in June by a bill that would have allowed the extradition of criminal defendants from Hong Kong to mainland China. The bill has since been withdrawn, but protesters’ demands have grown to include direct elections for Hong Kong leaders and an independent investigation into police use of force, amid growing sentiment that officers have acted with impunity during the demonstrations. The movement has also taken on a distinctly anti-Beijing flavor.\n\nProtesters have become increasingly aware of the risks of their continued participation in the demonstrations. Police have arrested more than 1,500 people in the past four months with charges including rioting, unlawful assembly, assaulting police officers and possession of offensive weapons. After demonstrations ended Saturday and Sunday, police stopped and searched young people in buses, trams, at convenience stores and elsewhere in the city.\n\nOne of the many arrests from the resulting police charge today in Hong Kong. Officers trying their hardest to keep photographers and videographers away and block their cameras pic.twitter.com/mIkTFyjC91 — Timothy McLaughlin (@TMclaughlin3) September 29, 2019\n\n“We can’t make fear grow in our hearts,” said Michael, the 28-year-old. “If we are not going to go out now, then when?\n\n“If we really lose this time, we may not get the right to come out ever again, just like it is in China.”\n\nJoshua, a 22-year-old protester, said he grows more afraid before each march. Sometimes he feels like throwing up, he says, worrying that he could be the next to be cuffed and hauled away. He gave only his first name because the demonstration was unauthorized.\n\n“If this is our path to democracy, then it is a sacrifice I am willing to make,” he said.\n\n“Fight for Hong Kong!” he shouted amid the marching crowd. “Stand with freedom!”\n\n\n\nAn anti-government protester throws a molotov cocktail towards riot police officers inside the Wan Chai station during a demonstration in Hong Kong. (Athit Perawongmetha/Reuters)\n\nCasey Quackenbush and Tiffany Liang contributed to this report.\n\nRead more\n\nUnidentified flinching object: In Hong Kong protests, police wage assault on facts\n\n‘I couldn’t breathe’: Hong Kong protesters allege beatings and torture by city’s police\n\nHong Kong protests threaten to rain on China’s anniversary parade\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "description": "Police hit hard against protesters in what is likely an effort to deter demonstrations on the upcoming anniversary of the People’s Republic of China.", "authors": ["Shibani Mahtani", "Reporter Covering Southeast Asia", "Hong Kong", "Timothy Mclaughlin", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/aHh_HKgW7Q8hdD8aKGjE6nOXiGA=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6CF6HUHC4II6TNAD644ITGMC2I.jpg", "published_at": "2019-09-29"}