{"pub": "businessinsider", "url": "https://pedestrian.tv/music/dominic-fike-like-a-version-2019", "downloaded_at": "2019-10-18 01:09:24.992617+00:00", "title": "Dominic Fike Puts His Best Curl Forward With A Clairo Cover For ‘Like A Version’", "language": "en", "text": "Don’t let the shitty wig fool you, Dominic Fike is bloody good. He stepped into the Triple J studios this week to blast through a rendition of Clairo‘s ‘Bags’, turning the gentle indie track into a fuzzy fast-paced rock banger.\n\nDominic Fike brought his best weave and impressive guitar skills to the bigger studio, transforming Clairo’s sombre track about exploring a crush on a girl into a driving track that deserves every replay I’m giving it right now.\n\nIf you’re wondering if this is another track that I’m going to be putting on my extensive, multi-disc Best Of 2019 compilation–I am. It’s not as massive and sack-whipping as Denzel Curry‘s ‘Bulls On Parade’ or Cub Sport‘s gut-wrenching ‘When The Party’s Over’ but it’s good and fun and makes me yearn for the warm smooch of summer.\n\nDominic also whipped through his own track, ‘Phone Numbers’, which has him stepping out from behind the guitar to show off his impressive rhyme-spitting skills and tbh I am furious at this multi-talented son of a binch who pulled a multi-million dollar record deal while in prison for breaking house arrest.\n\nIn saying that, anyone who is good enough for Kevin Abstract to want to produce films for, then they’re good enough for me.\n\nTake a moment to sit back and watch Dominic Fike’s Like A Version this week, and enjoy The Good Day™.\n\nI also love that he’s wearing a Weezer shirt in this set as well, because he absolutely slipped a rendition of ‘Say It Ain’t So’ into his Melbourne show this week and a total of ten (10) people in the sold-out crowd knew what the fuck was going on. I simply must respect that move.", "description": "Florida rapper, singer, and muso, Dominic Fike, donned his best curls and put the big fuzz on Clairo's crusher hit 'Bags' for this week's Like A Version.", "authors": ["Courtney Fry"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/10/dominic-fike-LAV-fb.jpg", "published_at": "2019-10-17"}