{"pub": "washingtonpost", "url": "https://washingtonpost.com/entertainment/books/meghan-daums-merciless-take-on-modern-feminism-woke-ness-and-cancel-culture/2019/10/24/77f47d40-efaf-11e9-8693-f487e46784aa_story.html", "downloaded_at": "2019-10-24 16:30:16.652889+00:00", "title": "'The Problem with Everything,' by Meghan Daum book review", "language": "en", "text": "Part memoir and part jeremiad, “The Problem with Everything” is replete with examples of what Daum views as intolerant, self-righteous woke-ness: She highlights the young-adult fiction authors forced to withdraw their books “when social media mobs attacked them” for purported “racial insensitivity” or cultural appropriation, for instance, and the “self-congratulatory reverence” displayed by white liberal admirers of Ta-Nehisi Coates, the “unofficial paterfamilias of the wokescenti.” Commenting on the controversies surrounding Brett M. Kavanaugh’s nomination to the Supreme Court, Daum writes that although she found Christine Blasey Ford’s allegations of sexual assault “moving, compelling and entirely credible,” she was “less moved by the sloganeering that rose up around them.” The “Believe Survivors” trope, she argues, draws no distinction between violent rape and lesser forms of male creepiness (groping, leering), and sacrifices due process for the accused to outraged assertions of male sinfulness.\n\nAD\n\nAD\n\nDaum is hardly the first to complain about the excesses of the “wokescenti,” to use her term, and she admits that her own irritation at “the smug vibe of many young activists” may be partly middle-aged angst. Born in 1970, Daum describes herself as a classic “Gen Xer,” raised to believe in the value of “toughness”: Those entering adulthood should expect “to get tossed around a bit,” she writes. Gen Xers “registered opinions without being smacked down on social media moments later. We made mistakes in private and, in turn, respected the privacy of others in their mistakes,” she points out. “The same cannot be said for the relationship between my generation and those that are coming up behind us.”\n\n“The Problem with Everything” offers plenty of Daum’s trademark zingers, on topics like trendy T-shirts bearing feminist slogans — “narcissism repackaged as revolution” — and the pornography-fueled millennial obsession with eliminating body hair (“hardly an evolutionary advantage; if the cavemen had been sticklers for the shaved look, we would all have died out twenty-thousand years ago.”) But Daum’s book is messy; it meanders from topic to topic, and one-liners often stand in for real analysis. Daum spends little time contemplating the kinds of exclusion, injustice and pain that may lie behind the millennial intolerance she decries, and she offers no way forward beyond urging “empathy” for those “grappling with the confusions of their own doctrines.”\n\nToo often the book gets bogged down in the same kind of narcissistic palaver Daum derides. “I never much believed that the personal is political,” she declares, because “let’s face it, more often than not the personal is just personal. In my case, the personal wasn’t unique or even necessarily all that interesting.” Nevertheless, she goes on to describe, at some length, her childhood, her young adult forays into New York’s media world, her evolution from would-be fiction writer to essayist, her divorce and her growing obsession with aging.\n\nThere isn’t much Gen X toughness on display here, and Daum’s detours into bildungsroman don’t enhance her critique of the modern left. She dwells on her many hours spent alone in her New York apartment “trying to beat back migraines, fantasizing about sex with strangers while exhaustively reading comments on Talking Points Memo.”\n\nEventually, Daum stumbles across Free Speech YouTube, where she finds some kindred spirits: John McWhorter, Glenn Loury, Christina Hoff Sommers, Jordan Peterson, even Camille Paglia. She is “invigorated, even electrified” by their willingness to ask un-PC questions: “Are we using multiculturalism as a cover for tolerating human rights abuses in other countries? . . . Are there biological sex differences that help explain the gender wage gap?” Daum “lapped it all up. I couldn’t get enough. These videos felt like a safety net, even a warm embrace. . . . I was going a little crazy.” Saint Paul on the road to Damascus? Probably not.\n\nAD\n\nAD\n\n“I hesitate to characterize this as a midlife crisis,” Daum writes, for “that seems too generic.” But, of course, it’s exactly that generic. Daum isn’t wrong to worry about the ways in which “social-justice activism [is] eating itself,” but her book ultimately devolves into a chronicle of navel-gazing — the kind that can only be experienced by those with a bit too much time on their hands, and a bit too much (dare I say) “privilege.”\n\nIt’s particularly hard to know what to make of “The Problem with Everything,” because Daum ultimately seems to disavow part of her own argument. Attending her college reunion, she is moved to reflect on “the passing of time,” which “had yanked some of our certainty out from underneath us.” Tomorrow, she notes, with some satisfaction, “the young people now nipping at my heels will be walking the brick paths at their own school reunions, feeling some combination of embarrassment and pride at how they used to be.” And perhaps, she muses, “the problem with everything isn’t meant to be solved. It’s meant to feed us . . . it’s meant to invite our smartest selves to join hands with our stupidest selves and see where the other leads us.”\n\n“To be human is to be confused,” Daum opines — but a bit more clarity would have been welcome in what could have been a truly audacious cultural critique.\n\nRosa Brooks is a professor at Georgetown University Law Center and author of “How Everything Became War and the Military Became Everything.”\n\nAt 7 p.m. on Nov. 6, Meghan Daum will be in conversation with Kyra Phillips at Politics and Prose at Union Market, 1270 Fifth St. NE.\n\nTHE PROBLEM WITH EVERYTHING\n\nMy Journey Through the New Culture Wars\n\nBy Meghan Daum\n\nGallery. 256 pp. $27\n\nAD", "description": "“The Problem With Everything” is a gutsy but flawed book.", "authors": ["Rosa Brooks"], "top_image": "https://www.washingtonpost.com/resizer/6Edhtn1gwSF7j259ySQMppiDlIM=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GGVR7QXVCAI6TDHQJTEZ65GRE4.jpg", "published_at": "2019-10-24"}