{"pub": "guardian", "url": "https://theguardian.com/football/blog/2019/sep/14/champions-league-inequalities-juventus-ronaldo", "downloaded_at": "2019-09-15 10:56:00.469726+00:00", "title": "Champions League is back – but don’t expect a real match until February | Jonathan Wilson", "language": "en", "text": "I n the distance the anthem swells. Inappropriate advertising hoardings are covered up. A continent prepares to give thanks to Gazprom for providing them with football. The Champions League returns on Tuesday, unleashing an excited flurry of anticipatory questions: Can Liverpool defend their crown? Will Pep Guardiola stop overcomplicating things and, after a nine-year break, finally lift his third European title as a manager? Will Juventus’s gamble on Cristiano Ronaldo pay off? Are Barcelona and Real Madrid as shambolic as they appear? Who will Paris Saint‑Germain lose to hilariously this time? But mostly, when does the real stuff start?\n\nDoes any other competition that so regularly ends so brilliantly go through such a protracted clearing of the throat? Last season only one side managed to eliminate a club with a higher annual revenue in the group stage. The year before there were four sides eliminated by teams with lower annual revenues and before that just one again. Of the last 48 teams to reach the knockout stages, only six did not follow a remorseless financial logic – and even then it is hard to claim that Ajax or Basel putting out Benfica, or Roma qualifying ahead of Atlético Madrid, really counts as especially noteworthy.\n\nUefa agrees deal with clubs to cap prices for away fans in European competition Read more\n\nLook at the bookmakers’ odds. Groups A, B, D and E are regarded as foregone conclusions, with even the second favourites to qualify 9-2 on or shorter. Only Group F appears as a genuine four-way battle, with Zenit, seeded in the highest pot by dint of winning the Russian championship, fourth favourites to go through at 6-4. That in effect means that in the other seven groups, there will be 84 matches to decide whether Atalanta’s high press can oust a Shakhtar in transition after the departure of Paulo Fonseca, whether Antonio Conte can bring enough focus to Internazionale to challenge Borussia Dortmund and whether Valencia can overcome the chaos prompted by the dismissal of their manager, Marcelino, this past week to edge out Ajax.\n\nOr to put that another way, in six of the eight groups one side is rated 50-1 or longer to come top. The Czech champions, Slavia Prague – drawn with Barcelona, Dortmund and Inter – are 100-1, which is to say the same starting price as Foinavon, the most outlandish Grand National winner in history.\n\nThis is the curse of the competition: it is not just that there is a small cabal of super-clubs far stronger than the rest; it is that there is also a small group of outsiders whose only chance is whatever the football equivalent of a pile-up at the 23rd fence would be. Dinamo Zagreb, for instance, have won the Croatian league in 13 of the last 14 seasons; in that time they have totalled four points in Champions League group games. Lose the game, take the money, go home, win the league, repeat, trapped on a mezzanine of futility.\n\nFacebook Twitter Pinterest Dinamo Zagreb’s head coach Nenad Bjelica has a tough Champions League task on his hands. Photograph: Ole Martin Wold/AFP/Getty Images\n\nPerhaps Dinamo and other sides like them are happy enough with the format. They make a lot of money without a lot of effort and that sustains their hegemony at home, while they also have a glitzy shop window in which to advertise any promising young talent they may be able to sell for profit. But as a report commissioned this summer by Uefa into the polarisation of European football showed, attendances outside the big five leagues are falling, with the attention increasingly drawn to the elite.\n\nFor a time the biggest clubs seemed to be satisfied as well. Football, the game itself, the thing played on the pitch, it must always be remembered, tends to be a minor consideration.\n\nThe Fiver: sign up and get our daily football email.\n\nReal Madrid’s director general, José Ángel Sánchez, has said the club must see itself like Disney, as a content producer. Champions League group games provide content. Delight as Cristiano Ronaldo scores a hat-trick! Marvel as Neymar nutmegs a full‑back! Gasp as Lionel Messi skips by four defenders! Brief YouTube clips rarely convey that the opponent being outwitted is a Belarusian journeyman being paid 100 times less a week than the star.\n\nBut the remorseless logic of football’s neoliberal economics has taken effect. The Champions League has made the rich richer to the point that domestic titles have become almost worthless. It is why Juventus took their gamble on Ronaldo last summer, paying €100m for a 33-year-old in order, as they saw it, to provide the attacking thrust that would transform appearances in two of the previous four finals into a first Champions League success since 1996. When the subsequent European campaign ended with a quarter-final defeat by Ajax, the manager, Max Allegri, despite five Serie A titles in a row, was replaced.\n\nThere is an epic quality to this, taking in the classic themes of greed and ambition, now set against the ticking clock of Ronaldo’s continued fitness as an elite athlete. It is undeniably great content. But in terms of football it unfortunately produces between two and seven intriguing games per super‑club, beginning next February.\n\nChampions League group-by-group guide: predictions and star players Read more\n\nLittle wonder, then, that Europe’s non-Premier League elite are so desperate to alter the format of the Champions League. It manifestly needs changing. A group stage in which roughly 80% of the games are largely meaningless while amplifying and reifying pre-existing financial inequalities cannot stand.\n\nBut the plan proposed by the Juventus chairman, Andrea Agnelli, for four groups of eight somehow managed to make worse the structural inequality while comprising a raft of games that earlier results could have rendered entirely meaningless (as opposed to the present structure, in which a lot of theoretically meaningful games are rendered meaningless because one side is so much stronger than the other).\n\nThat proposal appears to have been headed off by Premier League clubs – not, of course, for the good of the game, but because it threatened the financial advantages they have from being in the Premier League. The great irony is that, beyond the supreme marketing, the reason for the Premier League’s popularity, for all its imbalances, is that it remains far less predictable than any other major league. There may be a lesson there.", "description": "The group stages of the Champions League have become predictable and merely reinforce financial inequalities between the biggest clubs and the also-rans", "authors": ["Jonathan Wilson"], "top_image": "https://i.guim.co.uk/img/media/4c0bfb71388d7fb0de4c5c2fb9e9a57b19ffa6ee/202_183_3551_2131/master/3551.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tb3BpbmlvbnMucG5n&enable=upscale&s=ce0c2bffe67c58af6a2552a15a98a540", "published_at": "2019-09-14"}