{"pub": "dailymail", "url": "https://dailymail.co.uk/money/pensions/article-7601257/Councils-spending-social-care-helping-fewer-elderly-people.html", "downloaded_at": "2019-10-26 00:22:58.859639+00:00", "title": "Councils are spending more on social care but helping fewer elderly people", "language": "en", "text": "A dwindling number of elderly people are receiving long term care, despite a jump in spending and in requests for help to local councils.\n\nA burgeoning social care crisis is sparking some 5,245 pleas for assistance a day - an extra 195 a day compared with the year before - from 1.3million adults of all ages.\n\nBut shortly after the Government promised a social care overhaul in the Queen's Speech - without offering any detail - it emerged that the number of over-65s getting long term care shrank for the third year in a row in 2018-19.\n\nOverhaul delayed: A dwindling number of elderly people are getting financial support towards long term care\n\nThe Government has long delayed publication of plans to improve the system, prompting politicians and the finance industry to tout their own ideas, including calls for free basic care and a massive injection of cash.\n\nNew figures from NHS Digital reveal around 39,000 fewer elderly people are getting long term care from local councils than three years ago, down to about 548,500 - amid fears that cash-strapped authorities are taking a harder line in care assessments.\n\nThere was a small rise in the number of younger adults receiving long-term care over the past three years, but the overall trend was still downwards.\n\nNearly 80 per cent of the £14.6billion councils spent on social care last year went to people needing long term residential, nursing and community support, and two thirds of recipients were aged over 65.\n\nHow is care paid for at present? Under the current system someone's assets - including the family home - is depleted down to £23,250 if they need to go into a care home. If you need care in your own home, your assets must be depleted to a level set by your local council, which cannot be lower than £23,250, but your home is excluded from this means test. The Tories' plan to revamp this in the last election was to deplete an individual's assets - including their home - down to a £100,000 floor, no matter whether they need care in their own home or in a residential home. This proved politically toxic and was swiftly dropped. The party then mooted a cap on bills, promised another consultation on social care and postponed further discussion until the summer of 2018. The promised plans are still awaited, but the Government said in the recent Queen's Speech: 'We will bring forward substantive proposals to fix the crisis in social care to give everyone the dignity and security they deserve.'\n\nOverall, some 1.3million new requests for help were received by councils in 2018-19, up 3.8 per cent on the year before, against a backdrop of an aging population with growing care needs and funding pressures on local authorities.\n\nDespite fewer elderly people receiving support, spending by local councils on adult social care rose to £18.7billion, up 4.5 per cent on the year before. Spending on long-term care increased the most, by 4.8 per cent.\n\nMeanwhile, the average cost of residential care for a person aged over 65 rose from £604 a week in 2017-18 to £636 a week in 2018/19.\n\nThe average cost of nursing care increased from £638 to £678 per week.\n\nThe report by NHS Digital was based on data from 152 councils with adult social services responsibilities, and aimed at giving insight into their activity and expenditure.\n\nRecent figures showed more people are fighting the outcome of care assessments, which involve needs and means tests.\n\nData from the social care ombudsman revealed a dramatic rise in complaints, to 212 between the start of April and early June this year, according to a Freedom of Information response to financial services firm Quilter.\n\nThat puts complaints on course to reach 1,100 this year - a massive jump on the 725 received in 2017/2018 and 715 the year before.\n\nTracy Crookes, financial planner at Quilter, said of the latest figures from NHS Digital: 'While it is unsurprising the cost of social care is going up, the more worrying trend is the figure that the number of people receiving long term care has dropped.\n\n'This is despite the fact the number of requests has increased to an extra 195 per day. This is not just a statistic, however. These are elderly people desperately in need of long-term support being turned away because the system is broken.\n\n'Navigating the current social care system is overwhelming complex, made worse that the people who have to navigate it are generally already overwhelmed with numerous emotional and financial difficulties.\n\n'The level of complexity means there is room for interpretation by local authorities and given they are cash-strapped they may be taking a hard line. But their assessments are not always right.\n\n'In fact the figures from the Ombudsman show if you challenge their decision there is a high likelihood the decision will go in your favour. Going through the hassle can be time-consuming but it is worth it to get the funding from the state that you deserve.\n\n'Despite the clear problems we still have not seen any concrete solutions presented by the government on how they plan to fix it. This ultimately means that family and friends are left to pick up the pieces and millions of unpaid carers are propping up the system.'", "description": "A burgeoning social care crisis is sparking some 5,245 pleas for assistance a day - an extra 195 a day compared with the year before - from 1.3m adults of all ages.", "authors": ["Tanya Jefferies For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/11/20038444-0-image-a-6_1571826017105.jpg", "published_at": "2019-10-23"}