{"pub": "arstechnica", "url": "https://arstechnica.com/science/2019/10/plate-tectonics-runs-deeper-than-we-thought", "downloaded_at": "2019-10-05 11:04:44.883453+00:00", "title": "Plate tectonics runs deeper than we thought", "language": "en", "text": "It’s right there in the name: “plate tectonics.” Geology’s organizing theory hinges on plates—thin, interlocking pieces of Earth’s rocky skin. Plates’ movements explain earthquakes, volcanoes, mountains, the formation of mineral resources, a habitable climate, and much else. They’re part of the engine that drags carbon from the atmosphere down into Earth’s mantle, preventing a runaway greenhouse climate like Venus. Their recycling through the mantle helps to release heat from Earth’s liquid metal core, making it churn and generate a magnetic field to protect our atmosphere from erosion by the solar wind.\n\nThe name may not have changed, but today the theory is in the midst of an upgrade to include a deeper level—both in our understanding and in its depth in our planet. “There is a huge transformation,” says Thorsten Becker, the distinguished chair in geophysics at the University of Texas at Austin. “Where we say: ‘plate tectonics’ now, we might mean something that’s entirely different than the 1970s.”\n\nPlate Tectonics emerged in the late1960s when geologists realized that plates moving on Earth’s surface at fingernail-growth speeds side-swipe each other at some places (like California) and converge at others (like Japan). When they converge, one plate plunges down into Earth’s mantle under the other plate, but what happened to it deeper in the mantle remained a mystery for most of the 20th century. Like an ancient map labeled “here be dragons,” knowledge of the mantle remained skin-deep except for its major boundaries.\n\nNow a marriage of improved computing power and new techniques to investigate Earth’s interior has enabled scientists to address some startling gaps in the original theory, like why there are earthquakes and other tectonic phenomena on continents thousands of miles from plate boundaries:\n\n“Plate tectonics as a theory says zero about the continents; [it] says that the plates are rigid and are moving with respect to each other and that the deformation happens only at the boundaries,” Becker told Ars. ”That is nowhere exactly true! It’s [only] approximately true in the oceanic plates.”\n\nThere are other puzzles, too. Why did the Andes and Tibet wait tens of millions of years after their plates began to converge before they grew tall? And why did the Sea of Japan and the Aegean Sea form rapidly, but only after plates had been plunging under them for tens of millions of years?\n\n“They’ve been puzzling us for ages, and they don’t fit well into plate tectonic theory,” says Jonny Wu, a professor focused on tectonics and mantle structure at the University of Houston. “That’s why we’re looking deeper into the mantle to see if this could explain a whole side of tectonics that we don’t really understand.”\n\nPlate Tectonics meet Slab Tectonics\n\nThe Plate Tectonics theory’s modern upgrade is the result of new information. Beginning in the mid-1990s, Earth’s interior has gradually been charted by CAT-Scan-like images, built by mapping the echoes of powerful earthquakes that bounce off features within Earth’s underworld, the way a bat screeches to echo-locate surroundings. These “seismic tomography” pictures show that plates that plunge down from the surface and into the mantle (“subduct” in the language of geologists) don’t just assimilate into a formless blur, as often depicted. In fact, they have a long and eventful afterlife in the mantle.\n\n“When I was a PhD student in the early 2000’s, we were still raised with the idea that there is a rapidly convecting upper mantle that doesn’t communicate with the lower mantle,” says Douwe van Hinsbergen, a professor of global plate tectonics at the University of Utrecht. Now, that seismic tomography shows “unequivocal evidence that subducted lithosphere [plate material] goes right down into the lower mantle.” This has settled decades of debate about how deep the heat-driven convection extends through the mantle.\n\nvan Hinsbergen and his colleagues have mapped many descending plates (dubbed “slabs”), scattered throughout the mantle, oozing and sagging inexorably toward the core-mantle boundary 2,900 kilometers (1,800 miles) below our feet, in an “Atlas of the Underworld.” Some slabs are so old they were tectonic plates on Earth’s surface long before the first dinosaurs evolved.\n\n\n\nFluid solid\n\nSlabs sink through the mantle because they are cooler and therefore denser than the surrounding mantle. This works because “the Earth acts as a fluid on very long timescales,” explains Carolina Lithgow-Bertelloni, the endowed chair in geosciences at UCLA.\n\nHigh-pressure, high-temperature diamond-tipped anvil apparatuses can now recreate the conditions of the mantle and even the center of the core, albeit on a tiny scale. They show that rock at mantle pressures and temperatures is fluid but not liquid, solid yet mobile—confounding our intuition like a Salvador Dali painting. Here rigidity is time-dependent: solid crystals flow, and ice is burning hot.\n\nBut even by the surreal standards of Earth’s underworld, a layer within the mantle between 410 and 660 kilometers (255-410 miles) deep is especially peculiar. Blobs in diamonds that made it back from there to Earth’s surface reveal it to be rich in water, where carbon, that once was life on—or in—the seafloor, waits as carbonate minerals to be recycled into the atmosphere, where diamonds grow fat over eons before, occasionally, being recycled into the crowns of royalty. Earthquake waves are distorted as they pass through it, showing the 660-kilometer-deep boundary has mountainous topography with peaks up to 3 kilometers (2 miles) tall, frosted with a layer of weak matter.\n\nCalled the “Mantle Transition Zone,” this layer is a natural consequence of the increasing weight of the rock above as you go deeper underground. At certain depths, the pressure forces atoms to huddle tighter together, forming new, more compact minerals. The biggest of these “phase transitions” occurs at a 660-kilometer-deep horizon, where seawater that was trapped in subducting slabs is squeezed out of minerals. The resulting dryer, ultra-dense, and ultra-viscous material sinks down into the lower mantle, moving more than 10 times slower than it did in the upper mantle.\n\nFor sinking slabs, that’s like a traffic light on a highway (in this analogy your commute takes about 20 million years, one-way), so slabs typically grind to a halt like cars in a traffic jam when they hit the 660-kilometer level. Seismic tomography shows that they stagnate there, sometimes for millions of years. Or, they pile-up, buckle, and concertina. Or, they slide horizontally. Or, sometimes they just pierce the Transition Zone like a spear.\n\nIt’s these differences in how slabs cross the Mantle Transition Zone that’s the key to explaining those puzzling phenomena on Earth’s continents.\n\nPulling back the subducted bedsheet\n\nTo see how the Andes were affected when a slab crossed the Mantle Transition Zone, Wu’s PhD student Yi-Wei Chen worked with Wu and structural geologist John Suppe, using seismic tomography pictures of the Nazca Slab that’s in the mantle under South America.\n\nThey clicked the equivalent of an “undo” button to “un-subduct” the slab: “Like a giant bedsheet that’s fallen off the bed, we could slowly pull it back up and just keep pulling and see how big it was,” says Wu. Their technique is borrowed from the way geologists flatten-out contorted crustal rocks in mountain belts and oil fields to understand what the layers were like before they were folded. Using the age of the Pacific Ocean floor, the rate that ocean plates are being manufactured at midocean ridges, and the configuration of those ridges, the team compared the subduction history of South America with a large database of surface geological observations, including the timing of volcanic eruptions.\n\n“Our plate model is just a model, but there is a huge catalog of tectonic signals, especially magmatism, to work with,” says Wu. “We started to see a link between when the slab reached the mid-mantle viscosity change and things that were happening in the surface.”\n\nThey found that the main uplift of the Andes was delayed by 20–30 million years after the most recent episode of subduction began, a delay that matches the time for the slab to arrive at, stagnate in, and then sink below the Mantle Transition Zone. Delays like that—millions of years between the start of subduction and the start of serious mountain building—have also been recognized in Turkey and Tibet.\n\nHow can a slab sinking through the Mantle Transition Zone build mountains on an entirely different plate, 660 kilometers away through the mantle?\n\nIt’s a mantle wind that blows continents into mountains\n\n“If you take something that’s dense and you make it go down, that’s going to generate flow everywhere, and that is the ‘mantle wind,’ so there’s nothing mysterious about it!” says Lithgow-Bertelloni.\n\nGeodynamicists like Lithgow-Bertelloni and Becker use a different approach than Wu’s bedsheet-like un-subduction process. Instead, they code the equations of fluid dynamics into computer models to simulate the flow of high-pressure rock. These models are constrained by the physical conditions in Earth’s mantle gleaned from high-pressure experiments and by the properties of earthquake waves that have traveled through those depths. By playing a “video” of these simulations, scientists can check the behavior of slabs in their models against the “ground truth” of seismic tomographic images. The better they match, the more accurately their models represent how this planet works.\n\n“How the geometry evolves has to conform to physics,” says Becker. “The deformation is different in the mantle from the shallow crust because things tend to flow rather than break, as temperatures and pressures are higher.”\n\nTheir models show that, as slabs sink below the Mantle Transition Zone, they suck mantle down behind them, creating a far-reaching downwelling current of flowing rock. And it’s that down-going gust of mantle wind that drags continental plates above it, like a conveyor belt, compressing them and squeezing mountain belts skyward in places like the Andes, Turkey, and Tibet.\n\nThe location of the slabs relative to that 660-kilometer horizon determines what kind of mountain chain you get. If a subducting slab hasn’t yet sunk below the 660-kilometer layer, you get the kind of mountains envisaged by classic plate tectonics—without extreme altitudes and confined to a narrow belt above the subducting slab. Examples include the ones around the Western Pacific and Italy: “We think the present-day Apennines are an example of that,” says Becker.\n\nThe bigger mountain belts east of the Pacific and the Tibetan Plateau are in a different category: “Once the slab transitions through the 660, you induce a much larger scale of convection cell. That’s when we are engaging what we call whole mantle ‘conveyor belts.’ And it’s when you have those global conveyor belts and symmetric downwelling rather than a one-sided downwelling, that’s when you get a lot of the [mountain building],” Becker said.\n\nSo one slab sinking below the Mantle Transition Zone can create a mantle undertow that squeezes up mountains on an entirely different plate, 660 kilometers above it. This new level of tectonics now makes sense of other geological puzzles.", "description": "At 52 years old, plate tectonics has given geologists a whole new level to explore.", "authors": ["Howard Lee"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/10/GettyImages-960356664-760x380.jpg", "published_at": "2019-10-03"}