{"pub": "foxnews", "url": "https://foxnews.com/world/iran-threatens-higher-uranium-enrichment-stockpile-quickly-increasing", "downloaded_at": "2019-09-08 11:42:22.572818+00:00", "title": "Iran threatens higher uranium enrichment as stockpile ‘quickly increasing,’ official says", "language": "en", "text": "Iran continued to antagonize the U.S. and Europe on Saturday by publicly threatening to push uranium levels beyond what the country has previously reached – possibly even to weapons-grade levels, an official said.\n\nBehrouz Kamalvandi of the Atomic Energy Organization of Iran told reporters that not only can Iran enrich uranium “much more beyond” current levels, but it has also been pumping uranium gas into advanced centrifuges, another violation of the 2015 nuclear deal.\n\n“Under current circumstances, the Islamic Republic of Iran is capable of increasing its enriched uranium stockpile, as well as its enrichment levels, and that is not just limited to 20 percent. We are capable inside the country to increase the enrichment much more beyond that,” Kamalvandi said.\n\nHe also warned several times that Iran’s stockpile is “quickly increasing\" and added \"we hope they will come to their senses,\" referring to the international community.\n\nIRAN INJECTS GAS INTO ADVANCED CENTRIFUGES, VIOLATING DEAL\n\nPresident Trump announced last year that the United States was leaving the nuclear deal, formally known as the Joint Comprehensive Plan of Action, which he called \"the worst deal ever” for the U.S.\n\nSince then, tensions between the U.S. and Iran have spiked, with mysterious attacks on oil tankers near the Strait of Hormuz, Iran shooting down a U.S. military surveillance drone and other incidents across the wider Middle East following Trump's decision.\n\nThe 2015 nuclear pact allows for 3.67 percent uranium enrichment, and Iran has already hit up to 4.5 percent. The country has reached up to 20 percent, which analysts say is a short technical step from 90 percent, or weapons-grade level enrichment.\n\nIran has also started using 20 IR-6 centrifuges and 20 IR-4 centrifuges, Kamalvandi said. The former can produce enriched uranium 10 times faster than an IR-1 centrifuge; an IR-4 can do it five times as quickly.\n\nThe country intends to get even more centrifuges up and running within two months and use them in cascades, or large groups of centrifuges that enrich uranium even quicker, Kamalvandi said.\n\nIran was limited to using 5,060 IR-1 centrifuges under the nuclear deal.\n\nTehran’s move to use more advanced centrifuges indicates it could be about a year before it would have enough material to build a nuclear weapon, experts estimate.\n\nKamalvandi insisted Saturday that “the Islamic Republic is not after the bomb.” But he warned that Europe – which remains in the nuclear deal – needs to make a decision on how to move forward.\n\nROUHANI SAYS IRAN'S RESPONSE TO BILATERAL TALKS WILL ALWAYS BE 'NEGATIVE'\n\nFrench President Emmanuel Macron has reportedly offered Iran a $15 billion line of credit to offset the country's financial woes due to sanctions, under the condition that Iran comes back in compliance with the 2015 deal. President Trump has said economic sanctions against the rogue nation have been working, and Macron's offer indicates such.\n\n“If Europeans want to make any decision, they should do it soon,” Kamalvandi said.\n\n\"As far as the other side does not implement their commitments, they should not expect Iran to fulfill its commitments,” he added.\n\nDespite upping their ante, Kamalvandi said Iran will allow U.N. inspectors to continue to monitor nuclear sites. An official from the International Atomic Energy Agency was slated to meet with Iranian officials on Sunday.\n\nFollowing Iran’s announcement Saturday, Defense Secretary Mark Esper said, “The Iranians are going to pursue what the Iranians have always intended to pursue.”\n\nPresident Trump has said he is open to talks with Tehran, but Iranian President Hassan Rouhani said his country always will say \"no\" to bilateral talks with the United States.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nAlso Saturday, satellite images appeared to show Iran's Adrian Darya-1 oil tanker off the coast of Syria – where Tehran promised it would not go after the tanker was released from custody in Gibraltar last month\n\nThe Adrian Darya-1 turned off its tracking system on Monday. Iranian and Syrian officials have not acknowledged the tanker’s new location.\n\n\"Anyone who said the Adrian Darya-1 wasn't headed to Syria is in denial,\" National Security Adviser John Bolton tweeted Friday. \"We can talk, but Iran's not getting any sanctions relief until it stops lying and spreading terror!\"\n\nThe Associated Press contributed to this report.", "description": "Iran continued to antagonize the U.S. and Europe on Saturday by publicly threatening to push uranium levels beyond what the country has previously reached – possibly even to weapons-grade levels, an official said.", "authors": ["Melissa Leon"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/07/iran-missle-Getty.jpg", "published_at": "2019-09-07"}