{"pub": "euronews", "url": "https://euronews.com/2019/10/06/biden-said-he-was-prepared-trump-attacks-now-he-s-n1062926", "downloaded_at": "2019-10-07 00:26:47.296716+00:00", "title": "Biden said he was prepared for Trump attacks, but now he's struggling to respond", "language": "en", "text": "WASHINGTON — Joe Biden launched his presidential bid with a clear message to his party: no one was more equipped to take the fight directly to Donald Trump.\n\nBut the last two weeks have tested just how ready the Democratic frontrunner really was for the kind of all-out assault the president has launched against him, and his family.\n\nBiden had always expected, and close allies had long warned, that Trump and his allies would try to make his family an issue. One of his final hurdles before joining the race was a family meeting to make sure the tight-knit Biden clan was ready.\n\n\"They're not naïve,\" Biden would say of his family members after that get-together. \"From the time they were born,\" they have \"been in the public eye.\" He said they understood that \"the primary will be very difficult. And the general election running against President Trump, I don't think that he's likely to stop at anything in whomever he runs against.\"\n\nNow, longtime confidants of the former vice president say that even he could not have anticipated that the president would escalate his attacks so dramatically, or so early. And his reluctance to discuss his family in the campaign is a major reason why he has chosen not to respond forcefully to Trump's current assault.\n\n\"It's way beyond anything I quite frankly thought he would do,\" Biden said during a candidate forum last week.\n\nThe current onslaught is threatening to overwhelm Biden's candidacy at an already difficult time, with his frontrunner status in the Democratic presidential field imperiled by tightening polls, slower fundraising and now a full-fledged assault by Trump and his allies.\n\nBiden's third White House bid had already endured a series of trials, beginning before he even launched his candidacy in April: accusations of inappropriate physical contact, heightened scrutiny on his Senate record, and at times halting debate performances.\n\nThrough it all, his campaign has pointed out that his status as the frontrunner in a crowded primary field had proven remarkably enduring, especially on the question of which Democrat voters think could best take the president on in a general election.\n\nAdvisers say that growing support for impeachment in the polls shows that the public is focused on the developing White House scandal.\n\n\"This campaign will continue to focus on the issues that impact people's lives while simultaneously hammering Donald Trump for his unprecedented abuse of power and correcting the record on the mountain of lies Trump and his allies continue to spread about Joe Biden,\" deputy campaign manager Kate Bedingfield said in a memo Saturday.\n\nStill, the scope of the challenge appears far greater now. As one longtime Biden associate put it: \"If he survives this, he should be president.\"\n\nThe campaign has been buried in free advice from a vast network of allies — most of it encouraging a more aggressive response by the candidate himself to the president.\n\nBut while his headquarters has been working overdrive to push back on a false Ukraine narrative and almost daily escalations by the president, Biden himself has been reticent to respond in kind, given that his son, Hunter, is squarely in the middle of Trump's attacks.\n\nHis longstanding aversion to discussing family matters publicly — influenced greatly by the grief he's borne publicly since his earliest days in the Senate — has been an obstacle for advisers to overcome as they pushed for a stronger voice.\n\n\"As a father myself, I think any of us in public life who have to face groundless accusations against our families it makes us defensive, it makes us angry, it makes us unhappy. But I know Joe is motivated by a calling to solve this problem and move us forward and help bring the country together,\" Sen. Chris Coons, D-Del., said in an interview with NBC News.\n\nStill, it took until Thursday night in Reno, Nevada, for Biden to offer his most forceful response yet to Trump, telling an audience that he \"will put the integrity of my whole career in public service to this nation up against his long record of lying and cheating and stealing any day of the week.\"\n\n\"Let me make something clear to Mr. Trump and his hatchet men and the special interests funding his attacks against me: I'm not going anywhere.\"\n\nOn Friday, he sought to turn the focus back on the president.\n\n\"We gotta get something straight. All this talk from the president about corruption comes from the most corrupt president we've had in modern history, he's the definition of corruption,\" he said.\n\nAnd Saturday, the campaign turned his remarks in Reno into a television ad, part of a $6 million buy up against a larger media blitz by the president's campaign.\n\nThe array of challenges Biden now faces threatens what had been his biggest asset: the appearance of strength, and his own contention that he was the Democrat with the best chance of defeating Trump.\n\nHis response to the adversity, especially the nearly daily assaults by the president and his allies, is shaping up as the ultimate stress test for his candidacy.\n\nReflecting on his possible 2016 campaign in his recent memoir, \"Promise Me, Dad,\" Biden said that had he run, it would not have been \"a cautious, trim-around-the-edges campaign,\" but would instead \"go big. Because frankly, at this point in my career and after all my family had been through, anything less just wasn't worth it.\"\n\nThe Biden 2020 campaign has, though, at times felt constrained by the frontrunner position he began with, in the most crowded Democratic field in a generation and with a Democratic electorate that has changed since he and Barack Obama won the White House in 2008.\n\nAt times he's joked about the new reality, as when he was asked in August about a dynamic within the GOP. \"I'm still trying to figure out my party!\" he quipped.\n\n\"He's in a new world,\" said Philipe Reines, a longtime adviser to Hillary Clinton. \"He can litigate every day that the world should be like it was 10, 20, 50 years ago, but he's not going to win that fight.\"\n\n\"The environment he's in doesn't require him to be as nasty as Donald Trump,\" Reines said, \"but it does require him to stand up for himself quickly and forcefully and out of his mouth. And if he does that, then he is proving his argument of the case, that he's the best to take him on.\"\n\nThe Biden campaign insists that Trump's clear focus on him is an asset in the campaign, and has helped rally Democrats to his side. They saw an influx in online donations in the final days of the fundraising quarter, pushing him over the $15 million mark.\n\nBut that figure was still short of hauls from Sen. Elizabeth Warren, D-Mass., as well as Sen. Bernie Sanders, I-Vt., and South Bend, Indiana Mayor Pete Buttigieg.\n\nMeanwhile, a national poll released by Monmouth University Wednesday was the latest to show Warren out front of the Democratic pack. Biden's lead over the Democratic field in the Real Clear Politics polling average — once as high as 26.8 points — is now down to 1.7.\n\nAnd in a potentially ominous sign, the Monmouth poll released Wednesday also showed that 43 percent of respondents believed Trump's claim that Biden pressured Ukrainian officials not to investigate his son's business dealings, while 37 percent did not. One-in-five voters said they weren't sure.\n\nBut another longtime Biden confidant insisted that the former vice president would not be knocked off stride, and said his willingness to endure the crucible was a testament to how motivated he was to defeat Trump.\n\n\"He has been hit with everything but the kitchen sink,\" the Biden ally said. \"He knew this was going to be awful but he just couldn't live with himself if he didn't run and Trump went on to win.\"", "description": "The president's attacks on the Democratic frontrunner are threatening his campaign at an already perilous moment.", "authors": [], "top_image": "https://static.euronews.com/articles/4212362/1000x563_nbc-191004-joe-biden-ac-804p_f309025af7f927cccad8ef0015f944ad.jpg", "published_at": "2019-10-06"}