{"pub": "cbs", "title": "Hackers tweet racial slurs from Twitter CEO Jack Dorsey’s account", "url": "https://cbsnews.com/news/jack-dorsey-hackers-tweet-racial-slurs-from-twitter-ceo-account-today-2019-08-30", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:01:26.244024+00:00", "text": "Jack Dorsey's Twitter account has been hacked. Twitter said Friday afternoon that \"the account is now secure and there is no indication that Twitter's systems have been compromised.\"\n\nA slew of tweets — many of which included racial slurs — were posted from the Twitter co-founder and CEO's account Friday. He has more than 4.2 million followers.\n\nOne of the tweets included a Twitter handle for the person who claimed to take credit for the operation. That account was quickly suspended.\n\nThe account is now secure, and there is no indication that Twitter's systems have been compromised. — Twitter Comms (@TwitterComms) August 30, 2019\n\n.@Jack’s account has been hacked. The Tweets are coming from a source called Cloudhopper. Cloudhopper was the name of the company Twitter acquired a long time ago to help bolster their SMS service. Looks like the hackers are Tweeting via the old SMS service... pic.twitter.com/YcU3DTn9wS — Sam (@Hooray) August 30, 2019\n\nThe hacked tweets included sexist, racist and anti-Semitic comments, as well as bomb threats directed at Twitter headquarters. One of the tweets featured the N-word and another praised Hitler.\n\nThe group that hacked the account appears to call themselves the \"Chuckling Squad\" and tweeted as Dorsey telling his followers to join their Discord and \"Chuckle with us.\" The server appears to no longer be accessible. CBS News has reached out to Discord for further comment.\n\nThe hacked tweets have since been removed from Dorsey's account.", "description": "The hacked tweets included sexist, racist and anti-Semitic comments, as well as bomb threats", "authors": ["Sophie Lewis"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/08/30/a6ba0d8a-4013-4d98-b858-5d883020c286/thumbnail/1200x630/5fe1563e9b5a534330f2025177060d93/gettyimages-1052220140.jpg"}