{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/disabled-boy-6-forced-go-20720321", "downloaded_at": "2019-10-25 16:38:49.014735+00:00", "title": "Disabled boy, 6, forced to go to toilet in living room after 'council mishap'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA mum has said her disabled son is being forced to go to the toilet and wash in the living room after a 'council mishap' left them in \"unlivable\" conditions.\n\nBlake Hostick, six, was left unable to walk, eat or talk after complications with the flu in February 2018 resulted in him contracting an ultra-rare neurological condition.\n\nHe is now is sleeping, washing, eating and going to the toilet in the living room until a new extension can be built at his east Hull home.\n\nBut plans are in disarray after surveyors \"got their measurements wrong\" and failed to contact his family for months.\n\nHe spent nine months in hospital before moving back to his three-bed Annandale Road home, where he lives with mum Kirsty, stepdad Joseph and brothers Kayleb, eight, and Haydon, 11.\n\n(Image: Joseph Dowell)\n\n(Image: Joseph Dowell)\n\nFull-time carer Kirsty, 32, said the council had agreed to the adaptations Blake needs in December 2018 - but construction work is unlikely to start until at least the new year.\n\nIn the meantime, the house is only set to get even more crowded, with Kirsty expecting her fourth child in February, reports Hull Live.\n\n\"We just don't know how it's going to work,\" she said.\n\n\"Blake is sleeping in the living room, so that's now his bedroom, a living room, a dining room, a physio room and even a bathroom.\n\n\"And the baby coming will present an extra difficulty, we're going to be hard up for space.\"\n\nThe family hope to extend the house into the back garden to create a bedroom and bathroom for Blake.\n\nWith the toilet and bathroom currently upstairs, they were told they should bed-bath Blake and were given a special toilet for the living room to avoid having to carry him upstairs.\n\n(Image: xxxxxxxxx WS)\n\n\"It's not very dignified,\" Kirsty said. \"It's a little inhumane. He hates it, he doesn't want to do that in the living room.\n\n\"It'd be a massive step to be able to do all those normal things again.\"\n\nHull City Council said: \"Because of Blake's considerable disabilities now and in anticipation of his future needs, it is proposed to build for the family a significant extension.\n\n\"However it has proved difficult to get the required size of extension into the triangular shape of the family’s garden.\n\n\"This has required further careful planning and a new solution has been proposed. Unfortunately, assessing, planning and undertaking works of this nature can take time. It is anticipated that actual construction will start in the new year.\"\n\nBut Blake's stepdad Joseph questioned that proposed start date after a surveyor who visited them last week told them that previous measurements had been incorrect.\n\n(Image: xxxxxxxxx WS)\n\n\"They told us that before the new surveyor came but he's come along and said it's all wrong,\" he said.\n\n\"The council has already said our current situation is unlivable and they can't relocate us anywhere.\n\n\"It's ridiculously frustrating, just giving us a start date would make it so much more comforting.\"\n\nAnd he said the delays had been made worse by the most recent surveyor not having any contact with them for nearly two months.\n\nAfter trying to get hold of him since May, Joseph said he spent just 10 minutes at the house during his visit on October 14.\n\nHe said that when Kirsty asked the surveyor when the changes were likely to be made, he replied: \"Not any time soon, love.\"\n\nJoseph said: \"Kirsty was beside herself, she couldn't believe it.\n\n(Image: Joseph Dowell)\n\n\"They're meant to be professionals, people we rely on. And especially when working with disabilities they're absolutely integral to everyday life and getting the job right is vital.\n\n\"And maybe not just getting it right, but having a bit of empathy too.\n\n\"But rocking up after months and saying that, when we already struggle as a family, it's absolutely unforgivable.\"\n\nThe family are now fundraising for treatments for Blake that are not available on the NHS.\n\nAnyone wanting to support them can donate to their GoFundMe page here .", "description": "Blake Hostick, six, was left unable to walk, eat or talk after complications with the flu resulted in him contracting an ultra-rare neurological condition", "authors": ["Abigail O'Leary", "Image", "Xxxxxxxxx Ws", "Joseph Dowell"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20720972.ece/ALTERNATES/s1200/0_Flu-son.jpg", "published_at": "2019-10-25"}