{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/lithuanias-central-bank-considering-ibm-for-its-lbchain-dlt-platform", "downloaded_at": "2019-10-23 10:02:41.997471+00:00", "title": "Lithuania’s Central Bank Considering IBM for Its LBChain DLT Platform", "language": "en", "text": "Lithuania’s central bank, Bank of Lithuania, has selected technology behemoth IBM and IT services firm Tieto as the finalists contending to develop its blockchain platform.\n\nFinancial technology news outlet FintechFutures reported on the contest’s developments on Oct. 23. Per the report, both firms will test their platform and the winner will be selected later in 2019 as part of the project dubbed LBChain.\n\nThe project's manager at the Bank of Lithuania Andrius Adamonis commented:\n\n“The final testing session will show which solution is most suitable for market needs. [...] We believe that the greatest advantage of LBChain is its versatility. We strive to create a platform that would not only serve for testing products or services that are already offered on the market, but would also be used to create those that might currently exist only in a financial architect’s mind.”\n\nPowered by Hyperledger and Corda\n\nAdamonis also explains that the upcoming platform is meant to solve multiple problems currently faced by financial innovators. The basis for the system is Hyperledger’s Fabric and R3’s Corda, and will supposedly allow for testing many different financial products and services.\n\nThe central bank also notes that it has already tested systems of fintech companies from three different European countries. These include solutions for compliance with Anti-Money Laundering and Know Your Customer regulations, as well as for cross-border payments and an unlisted share trading platform.\n\nAs Cointelegraph reported yesterday, IBM is also working with blockchain platform TBCASoft and telecommunications conglomerate SoftBank to develop a cross-carrier telecommunications blockchain payment solution.", "description": "Bank of Lithuania has selected IBM and IT services firm Tieto as the finalists for its blockchain platform dubbed LBChain", "authors": ["Adrian Zmudzinski"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvNzI4YjMyYjFmMTUyNWI0MjgwNjY4YjllNTFiNWU2OGMuanBn.jpg", "published_at": "2019-10-23"}