{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7584055/Uber-founder-Travis-Kalanicks-rise-fall-revealed-new-book.html", "downloaded_at": "2019-10-19 12:07:18.260318+00:00", "title": "Uber co-founder Travis Kalanick's rise and fall is revealed in new book", "language": "en", "text": "Google founder Sergey Brin 'tried to steal' former Uber boss Travis Kalanick's girlfriend, hours after announcing he was turning against his business, a new book has revealed.\n\nKalanick was stunned in 2014 when Brin unveiled the first self-driving car for Google, which until then had been an Uber ally, because he felt it threatened his company.\n\nNew York Times tech journalist Mike Isaac details the rise of the ride-hailing app, and the controversial workplace culture that nearly brought it down, in new book, Super Pumped: The Battle for Uber, released last month.\n\nAccording to Isaac, Kalanick's humiliation took a far more personal twist that night, with Brin even chatting up the Uber founder's now-ex-girlfriend Gabi Holzwarth, a musician and dancer, during a dinner with Silicon Valley heavyweights.\n\nKalanick told a colleague that Brin, who at the time was going through a messy divorce after having an affair with a younger female employee, had put his hand on Holzwarth's leg.\n\n'Google was going out of its way to screw him, and now he watched as the man who was going to kill his company tried to steal his girlfriend,' Kalanick thought, according to Isaac.\n\nGoogle and Uber would later lock horns in a multi-million dollar lawsuit over the allegedly stolen driverless car technology – but it was here that the animosity apparently began.\n\nUber co-founder Travis Kalanick's success with the app came to an end in 2017 after he was forced to step down following numerous PR scandals\n\nDrama: Kalanick went to war with Google, which had injected $250million into Uber in 2013, after its founder Sergey Brin (right) tried to 'steal' his girlfriend Gabi (left) while in the midst of his divorce from wife Anne Wojcicki (right)\n\nIsaac's book is full of eye-popping details about Uber's rise to a valuation of $68billion at its peak, more than Facebook.\n\nBut the company's ruthless practices at its inception nearly destroyed the company in a death spiral of PR nightmares – and even forced Kalanick out as chief executive in 2017.\n\nThe book depicts life at Uber as a mixture of the college film Animal House, The Wolf of Wall St and the writings of 16th century philosopher Thomas Hobbes, who talks about a 'state of nature' that resembles a civil war.\n\nUber's rise to the top is detailed in NYT tech journalist Mike Isaac's new book Super Pumped, released last month\n\nUber overstepped the mark in almost every conceivable way including hiring ex-CIA and NSA employees to form a 'corporate espionage force' to spy on drivers and competitors.\n\nIsaac paints Kalanick as prototypical of startup culture and his story raises questions about the culture of founder worship that has elevated bosses like Mark Zuckerberg to extreme wealth and power with little oversight.\n\nKalanick, 43, came from a middle class family in Northridge, California where his father was a civil engineer – inheriting his head for numbers and strong analytical skills.\n\nFrom his mother, who worked as an advertising executive at the Los Angeles Daily News, Kalanick learned the charisma that won over her clients and he became a natural salesman.\n\nBy the time he was in middle school, he was highly competitive, learned to code, but suffered 'relentless' bullying because he was a math wiz.\n\nHe scored a 1580 in his SATs, 20 points shy of perfect, and went to UCLA to double major in computer science and economics.\n\nKalanick became obsessed with the Internet and built a Napster-like search engine to find music online called Scour, dropping out to work full time on the project.\n\nKalanick, 43, was raised in a middle class family in Northridge, California, with parents Donald and Bonnie (left) who died in 2017. He learned to code while he was in middle school and attended UCLA after scoring a near-perfect SAT score\n\nKalanick's father was a civil engineer and his mother worked as an advertising executive at the Los Angeles Daily News\n\nHe managed to get $4million from venture capitalists but under grossly unfair terms – he would never forget that either - and Scour ultimately went bankrupt in 2000 when the recording industry sued it for $250million.\n\nA year later Kalanick tried to launch another version called Red Swoosh which he sold in 2007 for $20million, earning him $2million.\n\nHe then dabbled as an angel investor until he met fellow budding tech entrepreneur Garrett Camp, who had sold his now-defunct social network StumbledUpon to eBay for $75million in 2007.\n\nCamp came up with the idea for UberCab, the original name for the service, after watching a scene in the film Casino Royale where James Bond controls his Aston Martin with his phone showing a map with the car moving.\n\nHe was further inspired after becoming frustrated with having to wait a half-hour to hail a taxi in San Francisco.\n\nThe first version of Uber was launched in March 2009, in the form of a website to which users had to log in.\n\nThe cab rides were pricier than a normal taxi - by one-and-half times the rate - but they believed customers would be willing to pay more for on-demand service with luxury cars.\n\nAt the time of its launch, Uber's slogan was 'Everyone's Private Driver.'\n\nBut the company really took off when it gave out thousands of free iPhones to drivers.\n\nBefore launching Uber, Kalanick (pictured in 2006) created a file sharing company called Red Swoosh which he sold in 2007 for $20million, earning him $2million\n\nThe beginning: The company originally launched in 2009 under the name of 'ubercab' and was only available as a website\n\nIt was later made into an app, but the company was quickly hit with fines and sanctions due to violations\n\nIt faced its first bump in the road in October 2010 when San Francisco transit officials showed up at Uber's head office and threatened to shut it down for breaching regulations.\n\nBut Kalanick's response was: 'We ignore it'.\n\nThe company instead only made a change to its name by dropping the word 'Cab', and Uber was born.\n\nKalanick would soon land Uber's first substantial chunk of funding from legendary Silicon Valley investor Bill Gurley, who put in $11million for 20 per cent of the company, which valued it at $50million.\n\nWith complete control over the business, Kalanick's personality molded everything about it in his image, for better and for worse.\n\nIsaac writes that every day Kalanick 'went to war' in an 'existential battle' for survival.\n\nKalanick saw Uber's business as a political campaign in which 'the candidate is Uber and the opponent is an a**hole named taxi.'\n\nHis plan was to flood a city with free rides for passengers and bonuses for drivers so that by the time regulators knew what was happening it was too late.\n\nIf they complained, he would weaponize his users and get them to send texts or emails to city officials to fight back.\n\nUber was co-founded by Canadian Garrett Camp (pictured right with CEO Dara Khosrowshahi) and went public this year. Kalanick brought the company to success by poaching engineers from Google including Anthony Levandowski (left)\n\nUber, which was worth $68billion at its peak, more than Facebook, went public this year. Above is the New York Stock Exchange during the company's IPO in May\n\nKalanick idolized tech pioneers like Jeff Bezos and ripped off the Amazon founder's 14 principles, only with a distinctly Uber-like twist.\n\nNumber 1 on Bezos's list was 'customer obsession' while Kalanick's was 'always be hustlin'.\n\nAt Number 8 on Bezos' list was 'dive deep'. In the same position on Uber's version was 'Super Pumped'.\n\nBy 2012 Uber was in New York, Chicago, Los Angeles and Paris, with London soon to follow.\n\nBut what caused the company to truly explode was abandoning the luxury model, an idea which Kalanick stole from rival service Zimride, now known as Lyft.\n\nIsaac writes that Kalanick mocked Lyft's co-founder John Zimmer on Twitter with '#clone tweets', even though he was the copycat.\n\nKalanick even contacted investors he knew Lyft was targeting and warned they would miss out on investing in Uber if they signed up with his rival, causing many to back off.\n\nUber staff even turned up at Lyft 'driver events' where they handed out free beer, pizza and cookies as well as bonus codes to sign up with Uber.\n\nTens of millions of dollars venture capital flowed into the company which Kalanick took without giving investors any control over the operation.\n\nKalanick, pictured with ex-girlfriend Gabi Holzwarth at the 2016 Met Gala, was rubbing elbows with celebs at the height of his success\n\nCritics claimed he was suffering from 'aspirational baller syndrome' due to his frivolous spending and constant partying after he made it big. Above he is pictured with his ex Gabi, model Liu Wen, Wendi Murdoch and CEO of Qeelin Christophe Artaux in 2015\n\nKalanick began to hang out with the celebrity crowd and the likes of actress Sophia Bush (pictured at a party in 2016) and Leonardo DiCaprio. He also managed to recruit Arianna Huffington (left) on to the board of Uber\n\nThat included Google who invested more than $250million Uber in 2013, which cemented the company's place in Silicon Valley.\n\nKalanick had few friends outside of work and drove himself hard with 18-hour days and employees were expected to do the same.\n\nThe company offered free dinners but were not served until 8.15pm.\n\nBut his hyper-aggressive practices began to have real world consequences. In Las Vegas, where the taxi industry had ties to organized crime, some Uber drivers were being assaulted.\n\nIn New York City, Uber's presence threatened the taxi medallion industry, where a license to operate had peaked to $1million.\n\nThese tensions would culminate in cases like that of NYC livery driver Doug Schifter, who shot himself in the head outside City Hall in 2018 after he was struggling to cope with the change and was working 120-hour weeks.\n\nBut Uber refused to bow down to any resistance, and when it was fined for $12million for 120,000 violations by the Philadelphia transit code, it simply paid the hefty sum and carried on.\n\nUber brought in an accelerated background check program to make it easy for drivers to sign up, a decision which later came back to haunt them when drivers became embroiled in sexual assault allegations.\n\nAspirational baller syndrome: Friends feared that Kalanick had become a douchebag with too much money. Travis partying with Snoop Dogg in 2013\n\nThe company spent millions in lobbying to elect politicians who favored them, especially those who agreed Uber drivers were only contract workers and not employees.\n\nThe distinction meant the company did not have to pay for benefits, insurance, or employment tax - even if it weakened morale for its drivers.\n\nIn Austin, where Uber was being forced to comply with regulations, the company responded by treating it as a 'hostage situation', pulling out of the city completely and encouraged users to complain.\n\nIn 2015, when New York City Mayor Bill de Blasio suggested capping the number of Ubers, it retaliated by calling the app 'De Blasio's Uber', with fewer cars and waits up to half an hour.\n\nUsers were invited to 'take action' with a button which emailed a pre-written form to the mayor. De Blasio backed down but ultimately imposed the cap four years later.\n\nAs the Uber backlash gathered steam it focused on Kalanick who tech journalists dubbed the emperor of what they called 'a**hole culture.'\n\nBut in his mind, he was a visionary who was going to change the world, even if the public saw him differently.\n\n'For all of Kalanick's talents he couldn't see this wasn't a turf war, it was a popularity contest. Now that blind spot was becoming a liability,' Isaac writes.\n\nThe toxic culture within the company is getting worse, too.\n\nUber's unofficial motto was 'kill or be killed' and if you hit your targets you could get away with anything.\n\nIt even designed an algorithm to work out the lowest possible salary a new hire might accept before making an offer to them.\n\nIt introduced a 'Safe Rides Fee', an optional $1 charge intended to make passengers feel secure by providing a more reliable driver.\n\nBut in reality, it meant nothing and was just another way to make more profit, Isaac writes. One former employee called the practice 'obscene'.\n\nKalanick even turned down the idea of adding a tipping option on the app because he didn't understand how it would benefit drivers, the book states.\n\nKalanick was also threatened by Brin's plan to develop a driver-less car (left) prompting him to develop his own version through Uber (right), but was later sued for millions\n\nThings took a more sinister twist in December 2014 when an Indian woman was raped while being driven home by an Uber driver, a story which went viral and highlighted the company's problematic culture.\n\nThe more Uber pushed, the harder reality pushed back.\n\nUber's accelerated hiring practice became a factor in a slew of cases of sex crimes on passengers by drivers.\n\nKalanick believed they were 'innocent until proven guilty', and when cases fell through due to lack of evidence or victims failing to go to court, a cheer went up at Uber's HQ, Isaac writes.\n\nBut Kalanick suffered a real blow in 2014, when Sergey Brin announced Google's plan for the first driverless car at an event at the Terranea Resort in Rancho Palos Verdes in California.\n\nGoogle showed off a video of an egg shaped white vehicle doing laps around a parking lot, making Kalanick realize the company could 'destroy Uber, and would do it smiling.'\n\nAsked on stage if Google had plans to create a ride-hailing service, Brin didn't deny it, leaving Kalanick fuming.\n\nAt the time Brin was divorcing his wife Anne Wojcicki, the mother of his two children, after he was caught having an affair with Amanda Rosenberg, a Google marketing executive who at 27 was 13 years his junior.\n\nBut according to Isaac, that didn't stop him chatting up Kalanick's girlfriend, Holzwarth, at dinner that night.\n\nKalanick even secretly snapped a photo of the pair and sent it to a colleague to show Brin was a liability.\n\nPlaying hardball: Kalanick was known to employ ruthless tactics against his competitors, including Lyft, by spying on them and poaching its investors\n\nHe even mocked Lyft's co-founder John Zimmer (left) on Twitter with 'clone' tweets, even though he was the copycat, the book claims\n\nBrin later asked Holzwarth to hang out and talk by the pool while Kalanick 'stewed' on the sidelines.\n\nKalanick fought back by setting up a $40million self-driving car institute in Pittsburgh and began to poach engineers from Google including Anthony Levandowski, the golden boy of the whole project.\n\nBut it backfired when Google sued him and Uber for allegedly stealing proprietary information.\n\nUber was forced to settle for $245million and agreed not to use any of Google's technology, leaving its driverless car program in limbo.\n\nIn 2015 Uber hit a staggering landmark of $10billion in revenue and Kalanick celebrated with a blowout week-long party in Las Vegas which cost the company $25million.\n\nUberettos, as staff were known, had already proved themselves adept at spending the company's money at a previous party in Miami.\n\nThis time around they were warned not to throw beer kegs off buildings and anyone who threw up in hotel grounds would be fined $200.\n\nThe party was dubbed X to the x referring to the exponential growth Uber was experiencing.\n\nStaff were given a wristband that got them into venues that had been hired out just for them, like the XS club where DJs David Guetta and Kygo were playing.\n\nSome Uber staff took it too far with one employee hiring two prostitutes who ended up stealing his laptop with all his work secrets on it.\n\nManagers were doing drugs including, cocaine, ecstasy, marijuana, with their subordinates and one staff member stole a party transport shuttle and took it on a joyride, Isaac writes.\n\nThey were even treated to a performance by Beyonce and Jay-Z, who took $6million in equity in Uber as payment - it would go up by 50 per cent in less than a year.\n\nUber also faced strikes and complaints from its drivers due to its low wages and lack of benefits\n\nUber drivers protest outside the Uber offices on May 8, 2019 in London\n\nKalanick came under fire for trying to get around paying benefits, insurance, or employment tax by calling its drivers 'contract workers' instead of employees\n\nKalanick began to hang out with the celebrity crowd and the likes of Sophia Bush and Edward Norton became friends with him. Leonard DiCaprio was also a frequent guest in their social circle during this time.\n\nFriends feared that Kalanick was a victim of 'aspirational baller syndrome' as they called it, essentially a 'douche bag with too much money.'\n\nBut Kalanick didn't care and loved partying in Ibiza where he met Oprah Winfrey and tried to convince her to come on the board of Uber. When she declined, he recruited Arianna Huffington instead.\n\nKalanick's lifestyle trickled down to his staff who were partying and visiting strip clubs so much, the expenses were called 'T*ts on Travis.'\n\nCocaine and alcohol use were common at Uber offices, as was sexual harassment.\n\nAt one office in Thailand a male boss forced a female employees head into a pile of cocaine and forced her to snort it in front of them.\n\nMeanwhile the money kept rolling in and a $3.5billion injection from the Saudi government valued Uber at a staggering $62.5billion.\n\nFor his 40th birthday he chartered multiple yachts on the Aegean sea and flew in a slew of models to party.\n\nKalanick was reaping the benefits of his success but would later face a rude awakening when disgruntled drivers organized strikes due to Uber's low rates and long hours.\n\nBut it was his decision to join Donald Trump's tech advisory council that sealed his fate and effectively forced him to step down.\n\nThe #deleteuber movement started in early 2017 over Uber's perceived cashing in on Trump's ban on travelers from Muslim countries.\n\nHis image took another blow after he was seen arrogantly shouting at an Uber driver in a video published by Bloomberg\n\nAfter a slew of PR scandals, Kalanick met with Uber investors at the Ritz Carlton in Chicago in 2017 where he was told to step down. He remains a board member\n\nUber thought it was helping by getting rid of surge pricing to New York's JFK airport during a strike by regular taxi drivers, but critics saw it as opportunism.\n\nThe campaign summed up a lot of grievances against Uber; the exploitative labor practices, the corporate culture and, most of all, Kalanick himself.\n\nWithin a week 500,000 people deleted their Uber account.\n\nLyft twisted the knife by donating $1million to the American Civil Liberties Union which made them seem more socially conscious, and helped them get an extra $500million in additional funding.\n\nThat same year, former Uber engineer Susan Fowler published a blog detailing the sexual harassment she endured while working at the company and it went viral.\n\nThe dark ops unit of Uber, known as SSG, became public and reports revealed it had been following and taking photographs of officials who could potentially regulate the company.\n\nReporters exposed Uber's 'God Mode' or 'Heaven' program which let staff track users on rides in real time on a map, as well as another program called 'Hell', a real time tracker of Lyft drivers - two shocking breaches of privacy.\n\nThen there was Greyball, the technology which identified people working for transit officials or police and stopped them from hailing Ubers so they could not enforce the law.\n\nAnother scandal erupted when Holzwarth, who had by now broken up with Kalanick because of his long working hours, told journalists about a night at an 'escort karaoke bar' in South Korea when Uber executives apparently went off with prostitutes in front of him.\n\nBloomberg also published a video taken by an Uber driver who picked up Kalanick and tore into him.\n\nKalanick arrogantly shouted back at the driver that he was to blame, adding: 'Some people don't like to take responsibility for their own s***!'\n\nIsaac writes that after watching the video Kalanick fell to the floor in front of other executives and writhed around saying: 'What is wrong with me?'\n\nRachel Whetstone, Uber's head of PR, tried her best to console him, saying: 'You aren't a terrible person. But you do do terrible things.'\n\nKalanick tried to do damage control by getting former Attorney General Eric Holder to write a report on the company's culture.\n\nBut Holder ultimately concluded Uber had to fully reform and Kalanick should go.\n\nIn June 2017, Kalanick met with Uber investors at the Ritz Carlton in Chicago where he was told to step down. He remains a board member.", "description": "Uber's bumpy road to success as well as the company's 'macho' workplace culture which nearly brought it down, in new book, Super Pumped: The Battle for Uber , released last month.", "authors": ["Daniel Bates For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/17/19894338-0-image-a-16_1571417068395.jpg", "published_at": "2019-10-18"}