{"pub": "yahoo", "url": "https://news.yahoo.com/hillary-clinton-turning-back-the-clock-on-american-women-233349589.html", "downloaded_at": "2019-10-30 10:50:48.015967+00:00", "title": "Is the 'clock turning back' on American women?", "language": "en", "text": "Hillary Clinton, in an essay that published this week, cautions that opportunities for American women could vanish if the U.S. does not prioritize their economic advancement.\n\n“[F]ighting to give women and girls a fighting chance isn’t just a nice thing to do. It isn’t some luxury that we only get to when we have time on our hands. This is a core imperative for every human being in every society,” Clinton writes in “The Shriver Report: A woman’s nation pushes back from the brink,” a report that features essays compiled by Maria Shriver and the Center for American Progress.\n\nClinton warns that American women lag behind other first-world countries in a slew of important attributes, including life span, equal pay and employment opportunities.\n\n“In places throughout America large and small, the clock is turning back,” says Clinton, noting that while women now hold approximately half of U.S. jobs, the country doesn’t crack the top 10 rankings of countries where women thrive economically.\n\nWomen earned about 81 percent of males’ median wages in full-time jobs in 2012, according to the Bureau of Labor Statistics’ annual report released in October. That’s an increase from 62 percent in 1979, the first year comparable data was available. The BLS says women who never married earn nearly 96 percent of a man’s wages; married women take home considerably less, at 77 percent.\n\nAnd while some numbers illustrate an improvement, women in poverty face dire prospects. According to a BLS studies released in 2013:\n\n* Families maintained by working women were much more likely, at 27.2 percent, to live below the federal poverty level than male-headed households, at 15.8 percent. This is true at all education levels and across all races and ethnicities.\n\n* In 2011, the percentage of working-poor women increased, while it fell for men.\n\n* Forty-six percent of women in single-parent households receive government assistance like Medicaid or Supplemental Security Income.\n\nSimilar figures give Clinton pause, and stir concern that the country is walking back some advancements in gender equality.\n\n“I’m very proud of my own daughter, and I look at all these young women I’ve been privileged to work with or know through Chelsea, and it’s hard to imagine turning the clock back on them,” Clinton writes. “We have work to do.”\n\nKim Jacobs Walker, a 48-year-old entrepreneur and mother of two in Austin, Texas, suggests the clock metaphor isn’t exactly accurate:\n\n“Perhaps a better analogy would be a pendulum, where time moves forward but sentiments swing wildly from one extreme to another until the pendulum at last succumbs to gravity, coming to a stop on middle ground,” Walker wrote in a first-person account for Yahoo News last week about gender equality. “The pendulum swung hard from the extreme conservatism of the '40s and '50s to the insistent demands of women's rights advocates during the '60s and '70s.”\n\nWalker argues that when circumstances swing back — inevitably, for many women — to when they choose to re-enter the workforce, their years of experience in managing households, community groups and other difficult hands-on work should be impressed upon employers:\n\n“For women to achieve true economic equality, we have to start believing that an empathetic heart is worth as much as a strong arm; that it really is difficult to spend the day with a room full of toddlers; and that stay-at-home moms who run PTAs and booster clubs actually do have experience that translates meaningfully to administrative and management jobs when they're ready to re-enter the workforce.”", "description": "Hillary Clinton cautions that opportunities for American women could vanish if the United States does not prioritize their economic advancement.", "authors": ["Tim Skillern"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ZJHTFQb0hcBmynjeGSAasQ--~B/aD00NjA7dz03NTk7c209MTthcHBpZD15dGFjaHlvbg--/http://l.yimg.com/os/publish-images/news/2014-01-18/0bd5a613-1b12-4db2-90ce-15192ce717e1_chart2.png", "published_at": "2014-01-19"}