{"pub": "independent", "url": "https://independent.co.uk/news/business/no-deal-brexit-government-debt-rocket-institute-for-fiscal-studies-warning-a9146826.html", "downloaded_at": "2019-10-08 06:30:44.748232+00:00", "title": "Government debt set to rocket to levels not seen since the 1960s in event of a no-deal Brexit, Institute for Fiscal Studies warns", "language": "en", "text": "Government debt is set to soar to levels not seen since the 1960s in the event of a no-deal Brexit, a leading economic think-tank has warned.\n\nThe Institute for Fiscal Studies (IFS) said following last month's spending review that government borrowing was on course to top £50 billion next year, more than double what the Office for Budget Responsibility was forecasting as recently as March.\n\nHowever, in the event of even a \"relatively benign\" no-deal Brexit, the IFS said that could rise to almost £100bn - while debt would climb to almost 90 per cent of national income for the first time since the mid 1960s.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn its annual \"green budget\", the IFS warned that in those circumstances, next year's \"mini boom\" in public spending would be followed by another \"bust\" as ministers tried to get the public finances under control.\n\nAnalysis by Citibank for the IFS calculated UK national income was already between £55bn and £66bn lower than it would have been if the country had voted Remain in the 2016 EU referendum.\n\nAs a result, Britain had missed out \"almost entirely\" on the global growth of the past three years.\n\nShape Created with Sketch. Business news: In pictures Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Business news: In pictures 1/11 Corbyn wishes Amazon a happy birthday In a card sent to Amazon CEO Jeff Bezos on the company's 25th birthday, Labour leader Jeremy Corbyn writes: \"You owe the British people millions in taxes that pay for the public services that we all rely on. Please pay your fair share\" 2/11 No deal, no tariffs The government has announced that it would slash almost all tariffs in the event of a no-deal Brexit. Notable exceptions include cars and meat, which will see tariffs in place to protect British farmers Getty 3/11 Fingerprint payment NatWest is trialling a new bank card that will allow people to touch their hand to the card when paying rather than typing in a PIN number. The card will work by recognising the user's fingerprint NatWest/PA Wire 4/11 Mahabis bust High-end slipper retailer Mahabis has gone into administration. 2 Jan 2019 Mahabis 5/11 Costa Cola Coca-Cola has paid £3.9bn for Costa Coffee. A cafe chain is a new venture for the global soft drinks giant PA 6/11 RIP Payday Loans A funeral procession for payday loans was held in London on September 2. The future of pay day lenders is in doubt after Wonga, Britain's biggest, went into administration on August 30 PA 7/11 Musk irks investors and directors Elon Musk has concluded that Tesla will remain public. Investors and company directors were angry at Musk for tweeting unexpectedly that he was considering taking Tesla private and share prices had taken a tumble in the following weeks Getty 8/11 Jaguar warning Iconic British car maker Jaguar Land Rover warned on July 5, 2018 that a \"bad\" Brexit deal could jeopardise planned investment of more than $100 billion, upping corporate pressure as the government heads into crucial talks AFP/Getty 9/11 Spotif-IPO Spotify traded publically for the first time on the New York Stock Exchange on Tuesday. However, the company isn't issuing shares, but rather, shares held by Spotify's private investors will be sold AFP/Getty 10/11 French blue passports The deadline to award a contract to make blue British passports after Brexit has been extended by two weeks following a request by bidder De La Rue. The move comes after anger at the announcement British passports would be produced by Franco-Dutch firm Gemalto when De La Rue’s contract ends in July. The British firm said Gemalto was chosen only because it undercut the competition, but the UK company also admitted that it was not the cheapest choice in the tendering process. 11/11 Beast from the east economic impact The Beast from the East wiped £4m off of Flybe’s revenues due to flight cancellations, airport closures and delays, according to the budget airline’s estimates. Flybe said it cancelled 994 flights in the three months to 31 March, compared to 372 in the same period last year. 1/11 Corbyn wishes Amazon a happy birthday In a card sent to Amazon CEO Jeff Bezos on the company's 25th birthday, Labour leader Jeremy Corbyn writes: \"You owe the British people millions in taxes that pay for the public services that we all rely on. Please pay your fair share\" 2/11 No deal, no tariffs The government has announced that it would slash almost all tariffs in the event of a no-deal Brexit. Notable exceptions include cars and meat, which will see tariffs in place to protect British farmers Getty 3/11 Fingerprint payment NatWest is trialling a new bank card that will allow people to touch their hand to the card when paying rather than typing in a PIN number. The card will work by recognising the user's fingerprint NatWest/PA Wire 4/11 Mahabis bust High-end slipper retailer Mahabis has gone into administration. 2 Jan 2019 Mahabis 5/11 Costa Cola Coca-Cola has paid £3.9bn for Costa Coffee. A cafe chain is a new venture for the global soft drinks giant PA 6/11 RIP Payday Loans A funeral procession for payday loans was held in London on September 2. The future of pay day lenders is in doubt after Wonga, Britain's biggest, went into administration on August 30 PA 7/11 Musk irks investors and directors Elon Musk has concluded that Tesla will remain public. Investors and company directors were angry at Musk for tweeting unexpectedly that he was considering taking Tesla private and share prices had taken a tumble in the following weeks Getty 8/11 Jaguar warning Iconic British car maker Jaguar Land Rover warned on July 5, 2018 that a \"bad\" Brexit deal could jeopardise planned investment of more than $100 billion, upping corporate pressure as the government heads into crucial talks AFP/Getty 9/11 Spotif-IPO Spotify traded publically for the first time on the New York Stock Exchange on Tuesday. However, the company isn't issuing shares, but rather, shares held by Spotify's private investors will be sold AFP/Getty 10/11 French blue passports The deadline to award a contract to make blue British passports after Brexit has been extended by two weeks following a request by bidder De La Rue. The move comes after anger at the announcement British passports would be produced by Franco-Dutch firm Gemalto when De La Rue’s contract ends in July. The British firm said Gemalto was chosen only because it undercut the competition, but the UK company also admitted that it was not the cheapest choice in the tendering process. 11/11 Beast from the east economic impact The Beast from the East wiped £4m off of Flybe’s revenues due to flight cancellations, airport closures and delays, according to the budget airline’s estimates. Flybe said it cancelled 994 flights in the three months to 31 March, compared to 372 in the same period last year.\n\nIt warned that a no-deal Brexit was likely to mean two years of zero growth - even with a \"substantial\" fiscal and monetary response by the government and the Bank of England.\n\nEven when it returned to growth, it would remain weak at just 1.1 per cent, leaving the economy 2.5 per cent smaller than it would have been.\n\nCiti said that leaving the European Union with a Brexit deal should see the economy continuing to grow, albeit weakly at around 1.5 per cent a year. However further delay to Brexit would mean continued economic uncertainty with \"very poor\" growth of around just 1 per cent a year.\n\nOverall, Citi, said that remaining in the EU would be the best outcome for economic growth.\n\nHowever, if this happened under a Labour government committed to carrying out its policies on tax, nationalisation, share ownership and labour policy regulation, it was impossible to say whether the net effect would be better or worse than leaving the EU with a more \"growth-friendly\" set of policies.\n\nThe IFS said ministers had now effectively abandoned former chancellor Philip Hammond's tax and spending rules, including his manifesto commitment to balance the budget by the mid 2020s.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nIt said the government's day-to-day spending plans for public services were now close to the levels implied by Labour's 2017 election manifesto, and far higher than those in the Conservative manifesto.\n\nIFS director Paul Johnson said the figures meant chancellor Sajid Javid could not afford any big tax giveaways when he comes to deliver his first budget. He said that in the event of no-deal, any measures to support the economy would have to be strictly temporary.\n\n\"The government is now adrift without any effective fiscal anchor,\" he said. \"Given the extraordinary level of uncertainty and risks facing the economy and public finances, it should not be looking to offer further permanent overall tax giveaways in any forthcoming budget. In the case of a no-deal Brexit, though, it should be implementing carefully targeted and temporary tax cuts and spending increases where it can effectively support the economy.\n\nPress Association", "description": "Government debt is set to soar to levels not seen since the 1960s in the event of a no-deal Brexit, a leading economic think-tank has warned. The Institute for Fiscal Studies (IFS) said following last month's spending review that government borrowing was on course to top £50 billion next year, more than double what the Office for Budget Responsibility was forecasting as", "authors": ["Gavin Cordon"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/12/06/09/markets.jpg", "published_at": "2019-10-08"}