{"pub": "yahoo", "url": "https://news.yahoo.com/russia-detains-shaman-mission-banish-putin-104608482.html", "downloaded_at": "2019-09-19 23:52:46.563439+00:00", "title": "Russia detains shaman on mission to 'banish Putin'", "language": "en", "text": "Moscow (AFP) - Russian police on Thursday said they had detained a Siberian shaman trekking towards Moscow on a mission to expel \"demon\" President Vladimir Putin, picking up a crowd of supporters on the way.\n\nPolice in the eastern Siberian region of Buryatia told Interfax they had detained Alexander Gabyshev, the shaman, on a highway near Lake Baikal and would put him on a flight back to his home region where he is \"wanted for committing a crime\".\n\nGabyshev's eccentric bid to walk from his home city of Yakutsk to Moscow, a distance of over 8,000 kilometres (5,000 miles), has seen a group of followers join him on the way.\n\nHis simply expressed statements about Putin captured public attention, prompting opposition protests as well as a sharp response from the authorities and muck-raking reports on pro-Kremlin television.\n\n\"God said that he's a demon,\" Gabyshev told the TV Rain channel in July. \"Nature doesn't like him. Where he is, there are cataclysms and acts of terror.\"\n\n\"Once he's gone, there will be a thousand years of calm and prosperity,\" he said, wearing a Che Guevara T-shirt and surrounded by people at a gathering in Chita.\n\nGabyshev's supporters on Thursday morning said in online videos that he was snatched from their camp by masked security officers in the night without explanation. The highway was blocked to carry out the detention.\n\nOnline, people mocked the authorities for arresting Gabyshev, who had been walking openly and giving interviews all summer, for a crime he allegedly committed months ago.\n\n- Kremlin 'truly afraid'? -\n\nOne of the shaman's companions told the Znak.com news website that Gabyshev may be accused of organising an \"extremist community,\" a charge punishable by up to two years in prison.\n\nOpposition leader Alexei Navalny ridiculed the official reaction to the shaman, suggesting it showed the Kremlin's paranoia about any sign of dissent.\n\n\"The great Putin with his huge approval ratings got so scared of the Yakut shaman that 20 people with automatic rifles arrested him,\" Navalny tweeted.\n\nHuman rights watchdog Amnesty International urged Russian authorities to release Gabyshev, whose whereabouts were unknown after his detention.\n\n\"The shaman's actions may be eccentric, but the Russian authorities' response is grotesque. Are they truly afraid of his magical powers?\" said the group's Russia director Natalia Zvyagina.\n\nAsked about the shaman, Putin's spokesman Dmitry Peskov told journalists that \"the Kremlin cannot be aware of criminal prosecution of every Russian citizen, that would be impossible.\"\n\nWhen the long-haired self-proclaimed shaman reached the Siberian city of Ulan-Ude in August, he was accosted by a group of rival \"patriotic\" shamans who ordered him not to enter the city.\n\nClashes ensued and several of those accompanying Gabyshev were detained, sparking a broader standoff in the city.\n\nHeated opposition protests began early this month in Ulan-Ude in support of the detained followers of the shaman, but also reacting to alleged falsification of local elections.\n\nRiot police and masked agents roughly broke up protests last week and detained and charged leading figures, including a regional lawmaker, who was pulled out of the broken window of his car, local media said.\n\nThe local governor, Alexei Tsydenov, on Thursday appealed to residents to \"slow down\".\n\nGabyshev began the trek in March. He had walked about a third of the way to Moscow, dragging a cart with his belongings. He planned to reach Moscow in 2021.\n\nShamanism is still practised in numerous regions of Russia, including Yakutia where customs involving thanking nature spirits are incorporated into daily life.", "description": "Russian police on Thursday said they had detained a Siberian shaman trekking towards Moscow on a mission to expel \"demon\" President Vladimir Putin, picking up a crowd of supporters on the way.  Police in the eastern Siberian region of Buryatia told Interfax they had detained Alexander Gabyshev", "authors": ["Maria Antonova"], "top_image": "https://s.yimg.com/uu/api/res/1.2/bNq9HKnGkT7ro8hORMmOow--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/6226a18f9599a59addf252b33d486ebdcdca681f.jpg", "published_at": "2019-09-19"}