{"pub": "marketwatch", "url": "https://marketwatch.com/story/china-claims-the-us-has-weaponized-the-issuance-of-visas-2019-10-23", "downloaded_at": "2019-10-23 15:12:02.005853+00:00", "title": "China claims the U.S. has ‘weaponized’ the issuance of visas", "language": "en", "text": "BEIJING (AP) — China on Wednesday accused the U.S. of having “weaponized” the issuance of visas following the reported inability of a top Chinese space program official to obtain permission to travel to a key conference in Washington.\n\nForeign Ministry spokeswoman Hua Chunying told reporters that the head of the Chinese delegation to the International Astronautical Congress wasn’t able to obtain a visa following an Oct. 12 interview, making it difficult for Chinese representatives to attend important events at the meeting.\n\nReports said the vice chairman of the China National Space Administration, Wu Yanhua, had planned to attend the congress.\n\nHua said the U.S. has “weaponized” visa issuances and “repeatedly defied international responsibilities and obligations and impeded normal international exchanges and cooperation.”\n\nShe said that “threatened and damaged the legitimate rights and interests of all parties in the international community.\n\nThe U.S. Embassy in Beijing said it couldn’t discuss individual visa cases because of privacy issues.\n\nHua said that “for some time, the U.S. has frequently rejected and delayed visa applications, revoked long-term visas of Chinese applicants and investigated and harassed the Chinese scholars, students, businesspeople, and scientific and technical personnel.”\n\nChina last year launched more missions to orbit than any other country, and is on track to do the same this year. Those missions include the first-ever soft-landing of a space craft on the far side of the moon.\n\nHowever, close ties between the Chinese space program and the country’s military have limited its participation in multinational efforts, including the International Space Station. China is instead building its own permanent station and has invited other countries to join in the effort.\n\nThe visa incident also comes amid a simmering trade war between China and the U.S. in which accusations that China steals or coerces foreign firms into handing over sensitive technology have played a major role.", "description": "The visa incident comes amid a trade war between China and the U.S. where accusations that China steals sensitive technology have played a major role.", "authors": ["Associated Press"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT846_Chinav_ZG_20191023094955.jpg", "published_at": "2019-10-23"}