{"pub": "yahoo", "url": "https://news.yahoo.com/brett-kavanaugh-sexual-assault-tweet-backlash-180752719.html", "downloaded_at": "2019-09-15 23:14:45.403017+00:00", "title": "New York Times under fire for tweet comparing Brett Kavanaugh sexual assault allegation to 'harmless fun'", "language": "en", "text": "The New York Times staff took to social media on Saturday to share a book excerpt which includes a fresh allegation of sexual misconduct against Supreme Court Justice Brett Kavanaugh, and the tweet they penned caused a huge wave of backlash. Kavanaugh, who was previously accused of sexual assault by Dr. Christine Blasey Ford, was a student at Yale when the alleged incident occurred.\n\nThe article, “Brett Kavanaugh Fit In With the Privileged Kids. She Did Not,” reported the story of Deborah Ramirez, a fellow Yale student who claimed that at a dorm party Kavanaugh \"pulled down his pants and thrust his penis at her, prompting her to swat it away and inadvertently touch it.\"\n\nThe paper of record wrote, in a now-deleted tweet from their Opinion account, “Having a penis thrust in your face at a drunken dorm party may seem like harmless fun. But when Brett Kavanaugh did it to her, Deborah Ramirez says, it confirmed she didn’t belong at Yale in the first place.”\n\nReaction to the grossly phrased tweet was swift and harsh.\n\nWriter Roxanne Gay, who is a contributor to the New York Times, called the tweet “such a profound lapse in judgment and common sense. Sexual assault isn’t harmless fun. What the hell is going on at the NYT?”\n\nFeminist author Jessica Valenti was equally disgusted, tweeting, “I keep hearing how feminism has gone too far, yet here’s the nation’s most important newspaper calling sexual assault ‘harmless fun.’”\n\nShe followed up with another tweet pointing out that the Times is an important publication and what they write can have a harmful impact, “Calling this s*** ‘harmless fun’ is how you make it OK for another man to do this to another woman.”\n\nPolitics writer Amanda Marcotte made a sharp observation in a tweet. “What is doubly frustrating if that, if you’ve ever seen or been on the receiving end of such ‘fun,’ you know the perpetrators do not think it harmless. The harm is the fun.”\n\nShe continued, noting, “‘Harmless’ is how it’s justified to others, leaning on sexist notions that women don’t matter, so harming them is harmless.”\n\n“Who thought an act of sexual assault was harmless fun?” added political strategist (and Nancy’s daughter) Christine Pelosi.\n\nThe Times phrasing shocked many, and the paper deleted the tweet with an explanation that it was “poorly phrased.” That tweet has also since been deleted.\n\nThe paper deleted its tweet following backlash. (Photo: Twitter) More\n\nFinally, the paper actually apologized in a subsequent message, acknowledging that the earlier tweet was “offensive.”\n\nWe deleted a previous tweet regarding this article. It was offensive, and we apologize. https://t.co/gbUdweKbDg — New York Times Opinion (@nytopinion) September 15, 2019\n\nRead more from Yahoo Lifestyle:\n\nFollow us on Instagram, Facebook, Twitter and Pinterest for nonstop inspiration delivered fresh to your feed, every day.", "description": "\"Sexual assault isn't harmless fun,\" writer Roxane Gay said of the newspaper's tweet about the latest allegation of sexual misconduct facing the Supreme Court justice.", "authors": ["Tanya Edwards"], "top_image": "https://s.yimg.com/uu/api/res/1.2/MHpEsXsmH7qES9nu31kchw--~B/aD02ODM7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/8e7bd2c0-d7db-11e9-afff-fe7151492a71", "published_at": "2019-09-15"}