{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7538025/Guard-youth-prison-attacked-three-kids-cricket-bats-Victoria.html", "downloaded_at": "2019-10-05 08:01:58.760724+00:00", "title": "Guard at youth prison 'attacked by three kids with cricket bats' in Victoria", "language": "en", "text": "Graphic images of a guard's bloodied and bruised face have been released in court after three inmates allegedly attacked two workers at a youth justice centre.\n\nAt least one inmate at Malmsbury Youth Justice Centre allegedly threw punches at youth worker Anthony Milbourne's face and head on Thursday night.\n\nImages released by the Bendigo Magistrates Court on Friday reveal blood oozing from Mr Milbourne's broken nose, mouth and cheek, with cuts across his face.\n\nGraphic images of a Victorian guard's bloodied and bruised face have been released in court after three inmates allegedly attacked two workers at a youth justice centre\n\nImages released by the Bendigo Magistrates Court on Friday reveal blood oozing from Mr Milbourne's broken nose, mouth and cheek, with cuts across his face\n\nAt least one inmate at Malmsbury Youth Justice Centre allegedly threw punches at youth worker Anthony Milbourne's face and head on Thursday night.\n\nImages released by the Bendigo Magistrates Court on Friday reveal blood oozing from Mr Milbourne's broken nose, mouth and cheek, with cuts across his face.\n\nMr Milbourne went to the aid of his colleague Justin White, who was allegedly being assaulted with a cricket bat, before he separated the accused inmate.\n\nThe man allegedly began punching Mr Milbourne's head and face, court documents reveal.\n\nThe latest assault at the centre allegedly started after Mr White asked the inmates to pack up volleyball equipment and come inside.\n\nInstead, one of the accused grabbed a 'hard plastic cricket bat', his co-accused opened the door to him and a third accused followed him into the unit.\n\nTwo 18-year-olds and a 19-year-old have been remanded to an adult prison until their scheduled appearance at Kyneton Magistrates Court on October 14\n\nOne of the accused grabbed a 'hard plastic cricket bat', his co-accused opened the door to him and a third accused followed him into the unit\n\nAn inmate allegedly confronted Mr White, who asked him to put it down, before repeatedly hitting him in the head with the cricket bat as he backed away.\n\nMr White fell to the ground, allegedly continuing to be assaulted including being kicked.\n\nThat's when Mr Milbourne stepped in and was allegedly assaulted.\n\nThe youth jail was sent into lockdown on Friday after staff refused to work amid safety concerns, prompting the Community and Public Sector Union to meet with management.\n\nTwo 18-year-olds and a 19-year-old have been remanded to an adult prison until their scheduled appearance at Kyneton Magistrates Court on October 14.\n\nA series of attacks at Malmsbury Youth Justice Centre (pictured) has led to the Community and Public Sector Union meeting with management on Friday\n\nThe trio has been charged with intentionally causing injury, recklessly causing injury, affray and assaulting an emergency worker over the attack.\n\nFormer worker Ken Rose said it will take a tragedy to make authorities listen.\n\n'Nothing will happen until someone dies and how sad is that for family and their mates,' he told Ten News.\n\nThe day before the attack, another male employee was assaulted by a youth at the centre, allegedly with a makeshift weapon made of wood.\n\nThe attack comes after several youths reportedly escaped a unit at the centre in March when a swipe card was taken from an overpowered staff member.\n\nWorksafe has launched an official investigation into the latest incident.\n\nThe justice department has been contacted for comment.\n\n\n\n", "description": "Images released by the Bendigo Magistrates Court on Friday reveal blood oozing from Mr Milbourne's broken nose, mouth and cheek, with cuts across his face.", "authors": ["Australian Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/16/19302866-0-image-a-5_1570201887083.jpg", "published_at": "2019-10-04"}