{"pub": "yahoo", "url": "https://sg.style.yahoo.com/former-nba-star-dwyane-wade-230001209.html", "downloaded_at": "2019-10-23 16:45:39.003520+00:00", "title": "Former NBA Star Dwyane Wade Signs Multi-Year Deal With WarnerMedia", "language": "en", "text": "WarnerMedia has signed recently-retired NBA star Dwyane Wade to a wide-ranging agreement that will see him join Turner’s NBA and college basketball studio coverage as well as develop entertainment projects.\n\nAs part of his Turner Sports role, Wade will be a basketball commentator, appearing primarily on TNT’s Tuesday night “Players Only” studio coverage, alongside Shaquille O’Neal and WNBA star Candace Parker. Wade will also be featured on TNT’s big NBA events like the playoffs and All-Star Game. Wade will also make studio appearances at the NCAA Final Four and National Championship, as part of Turner Sports and CBS Sports’ combined coverage of the event.\n\nWade will also serve as a creative director for projects on Turner’s digital sports outlet, Bleacher Report.\n\nAlso Read: Here's How the NBA's TV Partners Will Discuss the League's Thorny Situation With China On the Air\n\nAdditionally, Wade and his 59th & Prairie Entertainment production will develop a number of entertainment projects for WarnerMedia. Additional details on these projects will be announced at a later date.\n\n“Dwyane is a special talent. He’s a transcendent star with a charismatic, engaging and thoughtful personality on and off the court,” Jeff Zucker, chairman, WarnerMedia New and Sports, said. “We’re thrilled to welcome him to the WarnerMedia family and we could not be more excited to partner with him on these special projects.”\n\nWade played for 16 years in the NBA, spending the majority of those with the Miami Heat. He won three titles, all with the Heat, and was named NBA Finals MVP in 2006. He retired after the most recent season.\n\nWarnerMedia is set to launch its own streaming service, HBO Max, next spring.\n\nRead original story Former NBA Star Dwyane Wade Signs Multi-Year Deal With WarnerMedia At TheWrap", "description": "WarnerMedia has signed recently-retired NBA star Dwyane Wade to a wide-ranging agreement that will see him join Turner’s NBA and college basketball studio coverage as well as develop entertainment projects.As part of his Turner Sports role, Wade will be a basketball commentator, appearing primarily on", "authors": ["Tim Baysinger"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ljdbHpiiIaeYgicwP9OrGA--~B/aD00MDA7dz02MTg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/thewrap.com/83d33db6d3016f3e899e4b1409120a1e", "published_at": "2019-10-22"}