{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/shadow-of-tomb-raider-isnt-getting-a-new-tomb-but-will-soon-be-free-of-unpopular-outfit-restrictions", "downloaded_at": "2019-10-16 07:27:58.398456+00:00", "title": "Shadow Of Tomb Raider Isn't Getting A New Tomb, But Will Soon Be Free Of Unpopular Outfit Restrictions", "language": "en", "text": "There’s nothing like the announcement of a “definitive edition” of a game to wring some answers out of a game studio and their marketing team. And so, with the announcement of Shadow of the Tomb Raider: Definitive Edition for November 5, we finally can stop wondering about two important Tomb Raider things.\n\n1. Is there going to be a surprise eighth bonus tomb?\n\nNo, though it does sound like one had been considered. Shadow of the Tomb Raider was released last September alongside the promise of seven more bonus tombs (each with an accompanying sidequest) for people who bought the season pass. Back in April of this year, the in-game menu that listed these bonus tombs started listing an eighth one as “coming soon.” No one associated with the game would ever say why. (We kept asking.)\n\nToday’s Definitive Edition announcement mentioned that the new release of the game will include “all seven post-launch DLC.” So, what was up with that eighth listing?\n\n“With the release of our Season Pass’s final DLC ‘The Path Home’, the team wanted to explore the potential for additional content for our community,” a rep for the game told Kotaku today. “After careful consideration, the team chose to create the Definitive Edition outfit ‘Croft Fitness’ which will be available November 5th, 2019.”\n\nNo new tomb, but a new outfit instead. That’s not what the hardcore fans were hoping for, but at least everyone now knows. And it’s not like those seven other tombs didn’t amount to anything. Many of them were pretty cool.\n\n2. Is the game ever going to lighten up with its clothing restrictions?\n\nYes. Shadow of the Tomb Raider is full of outfits for Lara Croft to wear. Some are the kind of hiking and hunting outfits you might expect to see on an athletic and deadly British treasure hunter. Others are tribal outfits meant to reflect the kinds of clothes that would be fashionable in the remote Mayan city that serves as the hub for a lot of the game. There are three dozen outfits in the game, only a third of them tribal, but players can only put Lara in the tribal outfits when she is in the game’s massive hub, but not when she’s in any other areas.\n\nThis restriction has frustrated many players. After all, if you go through the trouble to unlock a new outfit in a game, it can be annoying to not be allowed to wear it, even in a game that stresses realism and cultural immersion as much as possible. Fans have repeatedly asked for this to be patched out.\n\nThat restriction will be loosened for the Definitive Edition. “Players who have completed the game can choose to turn off outfit restrictions in the main game hub,” a rep said today. Anyone playing the game from the start will be forced to adhere to the old restrictions in their initial play-through but will then have more freedom in the endgame.\n\nChanges made for the Definitive Edition will also be offered as part of a free update for Shadow of the Tomb Raider owners who bought the season pass. Those who have the game but don’t have the pass will be able to buy an upgrade to the full edition. It’s unclear if regular Shadow owners will get that outfit restriction change. We’re asking.\n\nAnd with that, one of gaming’s great 2019 mysteries is put to rest.", "description": "There’s nothing like the announcement of a “definitive edition” of a game to wring some answers out of a game studio and their marketing team. And so, with the announcement of Shadow of the Tomb Raider: Definitive Edition for November 5, we finally can stop wondering about two important Tomb Raider things....", "authors": ["Cecilia D'Anastasio", "Sarah Basford"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/alz6ea39gkkkwx8rhccz.jpg", "published_at": "2019-10-16"}