{"pub": "euronews", "url": "https://euronews.com/2019/09/24/on-the-menu-a-culinary-tour-of-shanghai", "downloaded_at": "2019-10-05 11:22:45.671105+00:00", "title": "On the Menu: A culinary tour of Shanghai", "language": "en", "text": "From traditional street food to Michelin-starred restaurants, Shanghai boasts a colourful and vibrant food scene - with its own distinctive flavours. In our latest episode of Metropolitans, we explore this buzzing mega-city - meeting some of its best chefs and sampling some of its gastronomic delights.\n\nFrom Chinese Dim Sum and Georgian khinkali, to Swedish pitepalts, South African souskluitjies, to Italian Ravioli and traditional Jewish Kreplach. Dumplings are universal and come in all shapes, sizes and flavours. The word \"Dim Sum\" is Cantonese and is commonly translated to “touch the heart”. These small portions of food can be savoury or sweet and prepared steamed, baked or fried.\n\nThe Western world has finally caught up to the little parcels that the Chinese have been eating since the 10th century in the teahouses of the Sung Dynasty. Metropolitans' host Damon Embling joined top chef - Yumin You - at the Nanxiang Mantou dim sum restaurant to try his hand at making some dim sum stuffed with pork.\n\nThe Tianzifang district\n\nThe team stops off at the Tianzifang Quarter, a labyrinth of Shanghai-style food stalls where one can find various meats on skewers: pork and chicken with a chilli sauce accompaniment. Daily, thousands of visitors flock through the narrow streets.\n\n\"I think it's good that you have such a wide choice, from meat to fish to pasta, bread, spicy, sweet and sour,\" says Italian tourist Sofia Orlando. \"When you think of Chinese food, you think of dumplings or rice first, but there is so much more.\"\n\nThe Donghu Hotel\n\nFresh out of a buzzing bazaar, lunch takes the programme to the Donghu - a traditional Chinese hotel. Damon is introduced to authentic Shanghainese cuisine by executive chef Hong Xing Yu, who invites our host for a delectable sampling of fried shrimp with crab meat and crab roe.", "description": "From traditional street food to Michelin-starred restaurants, Shanghai boasts a colourful and vibrant food scene - with its own distinctive flavours. Euronews' Metropolitan scours the buzzing mega-city - meeting some of its best chefs and sampling some of its gastronomic delights.", "authors": [], "top_image": "https://static.euronews.com/articles/stories/04/16/94/40/1000x563_cmsv2_ade3b31b-37f6-5034-822f-f5c4a049cfb0-4169440.jpg", "published_at": "2019-09-24"}