{"pub": "theverge", "url": "https://theverge.com/2019/10/15/20915338/league-of-legends-animated-series-fighting-game-cards-arcane-runeterra-project-l-trailers", "downloaded_at": "2019-10-16 03:55:36.387228+00:00", "title": "League of Legends expands with animated series, fighting game, and more", "language": "en", "text": "The universe of League of Legends is about to get a whole lot bigger. The wildly popular PC strategy game has been a hit since it debuted back in 2009, but until now it’s also been the only game in the series. Today at its 10th anniversary celebration, developer Riot Games revealed a surprisingly large slate of new games and other experiences all set in the League of Legends universe.\n\nHere’s the rundown:\n\nA fighting game: Riot previously revealed that it was working on a fighting game, and today the company officially unveiled “Project L,” a 2D fighter featuring League characters. Unfortunately, that’s all we know right now. The game is still “in early stage development,” according to Riot, and there’s no word on when we’ll hear more.\n\nAn animated series : For years Riot has been releasing gorgeous animated shorts and music videos, and now the company is expanding on that with a full animated series set in League. It’s called Arcane, is being produced in-house, and will be available next year. Here’s a brief plot synopsis: “Set in utopian Piltover and the oppressed underground of Zaun, the story follows the origins of two iconic League champions — and the power that will tear them apart.”\n\n: For years Riot has been releasing gorgeous animated shorts and music videos, and now the company is expanding on that with a full animated series set in League. It’s called Arcane, is being produced in-house, and will be available next year. Here’s a brief plot synopsis: “Set in utopian Piltover and the oppressed underground of Zaun, the story follows the origins of two iconic League champions — and the power that will tear them apart.” A digital card game : Another fantasy series, another card game spinoff. Following directly in the footsteps of games like Hearthstone and The Elder Scrolls: Legends is Legends of Runeterra, a free-to-play CCG coming to both PC and mobile next year. While the premise may not seem all that unique, the monetization model does sound interesting. Riot says that players will be able to “directly purchase any card with either earned or paid currency.” So long, blind packs.\n\n: Another fantasy series, another card game spinoff. Following directly in the footsteps of games like Hearthstone and The Elder Scrolls: Legends is Legends of Runeterra, a free-to-play CCG coming to both PC and mobile next year. While the premise may not seem all that unique, the monetization model does sound interesting. Riot says that players will be able to “directly purchase any card with either earned or paid currency.” So long, blind packs. A mobile version of Teamfight Tactics: Teamfight Tactics launched a few months back, and the auto-battler has since become one of the most popular game modes within League of Legends. Now it’s getting a standalone version on mobile devices. It’ll be launching early next year. Riot also says that, on both PC and mobile, Teamfight will have a new structure that cycles through “new sets of champions and abilities every three to four months.”\n\nAn e-sports management game : League of Legends is currently in the midst of its annual World Championship, but if that’s not enough e-sports to keep you satisfied, this game should help. It’s called, appropriately, League of Legends Esports Manager, and it’s exactly what it sounds like: a game where you manage a pro League team. The game will launch with support for the Chinese LPL next year, and eventually it’ll support other regional leagues as well. Interestingly, revenue from the game will be shared with the real-world pro teams featured within it.\n\n: League of Legends is currently in the midst of its annual World Championship, but if that’s not enough e-sports to keep you satisfied, this game should help. It’s called, appropriately, League of Legends Esports Manager, and it’s exactly what it sounds like: a game where you manage a pro League team. The game will launch with support for the Chinese LPL next year, and eventually it’ll support other regional leagues as well. Interestingly, revenue from the game will be shared with the real-world pro teams featured within it. A mystery: Riot also teased yet another game codenamed “Project F,” which is described as “a very early development project that explores the possibilities of traversing the world of Runeterra with your friends.” That’s it. That’s all we know.\n\nOn top of all of those announcements, Riot also revealed the long-awaited mobile version of League of Legends, along with its first non-League project: a tactical shooter called “Project A.” And there are also changes coming to the core League of Legends game as well. Fans can expect a new hero — a support called Senna — on November 10th, and the iconic Summoner’s Rift map is also getting what Riot describes as its biggest changes in years, with new dynamic features being added later this year. It’s looking like a busy few years for the company.", "description": "For its 10th anniversary, Riot Games announced a number of League of Legends spinoffs including an anime called Arcane, a card game called Legends of Runeterra, and a fighting game known as \"Project L.\"", "authors": ["Andrew Webster", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/RnhieTC09EhTZRcDyRaaiI0n0oU=/68x0:960x467/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19291264/Screen_Shot_2019_10_15_at_9.50.43_PM.png", "published_at": "2019-10-15"}