{"pub": "nymag", "url": "https://nymag.com/strategist/article/antoni-porowski-favorite-things.html", "downloaded_at": "2019-10-08 15:04:48.189763+00:00", "title": "Antoni Porowski on His 10 Favorite Things 2019", "language": "en", "text": "Louis Vuitton Leather Tab Hoody\n\nI know it’s kind of insane, but I can be very frugal with certain things and then with other things I tend to splurge. It’s a lot easier for me to splurge on something that I’m going to use very, very often. I love my Champion hoodies, I love my H&M hoodies, and they’re good for day to day. But this is a thick, luxe, cashmere hoodie that’s amazing on flights. I can dress it up with skinny Saint Laurent jeans and a nice boot, or I can just wear it with ripped jeans and sneakers. It’s very carefully thought-out: The stitching on it is perfect, the collar is a little more narrow, and the hood is really nice and deep, as well. I’m obsessed — this is a weird detail to be obsessed about — with ribbing. When you have high-quality ribbing, that’s nice and tight and structured, there’s something nice about that.\n\nI have these conversations with my stylist, Chloe Hartstein, and we always think like, Oh, who do we want to look like for this? And we’ve started looking at 1990s airport aesthetic. So that’s kind of what we’ve been going for recently. Like big, chunky sweaters, tie-dye, oversized cargo pants. Or the way Lady Diana used to wear these awesome Harvard sweaters when she used to go to the gym, so there’s a little bit of that as well. The one you can get online has a little logo on it. But the one that I bought was actually at a Louis pop-up, and the piece was off the runway, so it didn’t even have a logo on it. Which I liked even more, because I kind of get grossed out by logos sometimes.", "description": "Antoni Porowski shares the things he can’t live without, including Rimowa Original Cabin Spinner Luggage, Louis Vuitton Leather Tab Hoody, Bumble and Bumble Bb. Texture Hair (Un) Dressing Creme and Byredo Chai Candle.", "authors": ["Antoni Porowski", "Dominique Pariso"], "top_image": "https://pixel.nymag.com/imgs/daily/strategist/2019/10/07/antoni-porowski-wiclw/07-wiclw-antoni-porowski.w1200.h630.jpg", "published_at": "2019-10-08"}