{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7537547/Emaciated-animal-struggles-stand-desperately-hunts-food-Greenland.html", "downloaded_at": "2019-10-05 06:22:34.637324+00:00", "title": "Emaciated animal struggles to stand as it desperately hunts for food in Greenland", "language": "en", "text": "Harrowing photographs have emerged of an emaciated polar bear struggling to stand.\n\nBritish-Brazilian photographer, Joe Shutter, 30, captured the shots while on an expedition in Greenland.\n\nThey show a gaunt polar bear struggling to stand up while its skeletal frame protrudes through its sagging skin.\n\nBritish-Brazilian photographer, Joe Shutter, 30, captured the harrowing shots while on an expedition in Greenland\n\nThey show a gaunt polar bear struggling to stand up while its skeletal frame protrudes through its sagging skin\n\nThe creature struggles to walk and looks dejected as it points its mud-dappled snout towards the camera.\n\nMr Shutter said: 'I visited Greenland last year and we were lucky enough to see five polar bears.\n\n'This year we only saw one - and he was in a sorry state. You're not guaranteed to see polar bears of course but the one we did see was painfully thin and snuffling around in the dirt - there was no ice or snow around it.\n\n'The captain of the boat I was on - who has been visiting this part of Greenland for over 30 years - said the bear was in trouble, that he was too weak heading into winter. It was quite poignant, quite cutting to see really, to watch a bear in such bad shape.'\n\nThe creature struggles to walk and looks dejected as it points its mud-dappled snout towards the camera\n\nMr Shutter said: 'I visited Greenland last year and we were lucky enough to see five polar bears. This year we only saw one - and he was in a sorry state'\n\nPolar bears spend most of their lives on the sea ice of the Arctic Ocean and an established population has inhabited northern Greenland for generations.\n\nMr Shutter (pictured) added: 'It was quite poignant, quite cutting to see really, to watch a bear in such bad shape'\n\nUsually, the distinctive bears have a thick layer of body fat and a water-repellent coat that insulates them from the cold air and water.\n\nMainly surviving on a diet of seal, which has a very high fat content, bears can sustain themselves for long spells without eating.\n\nAccording to the WWF, because of ongoing and potential loss of their sea ice habitat resulting from climate change, polar bears were listed as a threatened species in the US under the Endangered Species Act in May 2008.\n\nScientists have divided the total polar bear population into 19 units or subpopulations.\n\nOf those, the latest data from the IUCN Polar Bear Specialist Group show that one subpopulation is in decline (Southern Beaufort Sea) and that there is a high estimated risk of future decline due to climate change and data deficiency.\n\nAccording to the WWF, because of ongoing and potential loss of their sea ice habitat resulting from climate change, polar bears were listed as a threatened species in the US under the Endangered Species Act in May 2008\n\n'I think we're all aware of the dangers we're facing,' continued Mr Shutter.\n\n'The issues of plastic pollution and retreating sea ice - it's quite galling, quite thought provoking to see its effects in the flesh. It may just have been this was an old bear whose time had come, but it seemed to have no energy - not like the playful bears I saw last year.\n\n'I think that is what's most striking about Greenland. It is a mind-blowing place, simply mind-blowing. But it is both epic and fragile, you get a real sense of what's at stake. We must all do our bit to protect our most at-risk environments.'", "description": "British photographer Joe Shutter, 30, captured the harrowing shots while in Greenland. The gaunt polar bear is seen struggling to stand and support its skeletal frame.", "authors": ["Isabella Nikolic For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/12/19294296-0-image-a-38_1570187721764.jpg", "published_at": "2019-10-04"}