{"pub": "huffpost", "url": "https://huffpost.com/entry/donald-trump-foreign-leader-phone-call_n_5d839724e4b0849d47252648", "downloaded_at": "2019-09-19 23:06:22.434884+00:00", "title": "Donald Trump Denies Saying Something 'Inappropriate' During Call With Foreign Leader", "language": "en", "text": "President Donald Trump on Thursday denied making an “inappropriate” comment to a foreign leader during a phone call, as The Washington Post reported a day earlier.\n\nHis comments come as a House panel gathered to question the internal watchdog of the U.S. intelligence community about a whistleblower complaint that reportedly accuses Trump of having made a troubling “promise” to a world leader.\n\n“Another Fake News story out there ― It never ends!” the president tweeted in response to the Post’s story about the complaint. “Virtually anytime I speak on the phone to a foreign leader, I understand that there may be many people listening from various U.S. agencies, not to mention those from the other country itself. No problem!”\n\nTrump, who revealed top-secret information to Russian officials in 2017, questioned whether anybody is “dumb enough” to believe that he would say something “inappropriate” on the phone with a foreign leader.\n\nAnother Fake News story out there - It never ends! Virtually anytime I speak on the phone to a foreign leader, I understand that there may be many people listening from various U.S. agencies, not to mention those from the other country itself. No problem! — Donald J. Trump (@realDonaldTrump) September 19, 2019\n\n....Knowing all of this, is anybody dumb enough to believe that I would say something inappropriate with a foreign leader while on such a potentially “heavily populated” call. I would only do what is right anyway, and only do good for the USA! — Donald J. Trump (@realDonaldTrump) September 19, 2019\n\nThe Post reported Wednesday that a U.S. intelligence official filed the complaint with Intelligence Community Inspector General Michael Atkinson’s office on Aug. 12. The New York Times reported Thursday that the complaint was related to a series of interactions — not just a single discussion with a foreign leader.\n\nDuring a closed-door hearing with the House Intelligence Committee on Thursday, Atkinson repeatedly refused to confirm or deny the substance of the complaint, The New York Times reported.\n\nAtkinson found the complaint to be credible and considered it a matter of “urgent concern,” he wrote in a letter to House Intelligence Committee Chairman Adam Schiff (D-Calif.) earlier this month.\n\nBut Acting Director of National Intelligence Joseph Maguire did not believe the complaint met the definition of an “urgent concern” about which Congress needed information, Atkinson wrote.\n\nMaguire has refused to hand over the complaint to Congress, as the law typically requires, according to the Times. His reluctance to do so prompted Schiff to subpoena him. He is scheduled to testify before the committee on Sept. 26.\n\n“Although I believe and appreciate the acting DNI is acting in good faith, the acting DNI’s treatment of the Complainant’s alleged ‘urgent concern’ does not appear to be consistent with past practice,” Atkinson wrote.\n\nSchiff told reporters after the briefing Thursday that he did not get an answer from Atkinson about whether the White House had tried to suppress the complaint.\n\n“We’re determined to do everything we can to determine what this urgent concern is, to make sure that the national security is protected and to make sure that this whistle-blower is protected,” he said, according to the Times.\n\nThis story has been updated with information about Maguire and Atkinson’s assessment of the complaint and additional comment from Schiff.", "description": "A House panel questioned a U.S. intelligence official about a whistleblower complaint allegedly involving the president and a world leader.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d8398983b00002efad768e4.jpeg?cache=tiwgrp8wrr&ops=1778_1000", "published_at": "2019-09-19"}