{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/richard-madeley-awkwardly-denies-pervy-20464386", "downloaded_at": "2019-10-05 10:26:05.702267+00:00", "title": "Richard Madeley awkwardly denies 'pervy' flirting with Zoe Ball's son on The Circle", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nRichard Madeley was forced to awkwardly deny flirting with Zoe Ball's son on The Circle.\n\nThe veteran presenter had a very revealing exit chat with host Emma Willis on Friday night's live show following his hilarious stint on the show.\n\nThe former This Morning host, 63, spent last week pretending to be a 27-year-old girl named Judy - and his wife fell off the sofa laughing.\n\nThings did get a bit strange when Woody, the son of Zoe Ball and Fatboy Slim, started sending him some suggestive messages.\n\nWhen asked about flirting with Woody, Richard said: \"No, no excuse me. Woah. Now that would be seriously pervy, wouldn’t it? Woody had a little flirt with Judy.\"\n\n(Image: Channel 4)\n\nRichard revealed that Judy was watching back at home and had no idea who he was going to be.\n\nHe said: \"I was shocked. Judy fell off the sofa laughing. She was watching at home alone. She said she literally fell off the sofa. We should have had a camera in he corner of the room.\n\n\"She thought it was hilarious. She approved but she didn't think I could do it. She thought 'how can this 63-year-old git that I’m married to possibly carry off being a 27-year-old girl'.\"\n\n(Image: Channel 4)\n\n(Image: Channel 4)\n\nViewers got to see Richard watching back some footage of the show - and he was stunned to discover who the catfish were.\n\nRichard claimed he had rumbled single mum Sammie was not know she said she was, while also suspecting Jay was also a catfish.\n\nHe said: \"I spent so any years with Judy working in Liverpool doing This Morning. I knew the person pretending to be Sammie was a Scouser. You get a subtext that comes through, it's weird.\n\n\"There was nothing James messaged that was ever suspicious in itself. It was just too good to be true. I thought 'it's too much mate'. I figured he was probably cat fishing.\"\n\n(Image: Channel 4)\n\n(Image: Channel 4)\n\nThe Circle viewers pleaded with show bosses to get Richard back on the show.\n\nOne fan said: \"So good to have #RichardMadeley back on #TheCircle to tell #EmmaWillis and all about his experience being \"Judy\". It is fantastic to see Richard's reactions to viewing the other players previously talking to him\"\n\n\"Was determined not to get pulled into #TheCircle but Richard Madeley really is TV gold,\" added another.\n\nA third said: \"I wish Richard Madeley was still in there\"\n\n\"I would fight a dragon for Richard Madeley,\" said a fourth.\n\n(Image: Channel 4)\n\nAfter a hilarious few days completing tasks voted for by the public, Richard/Judy’s secret mission came to an abrupt end when he was blocked by the influencers.\n\nBut before he left, Richard had the power to grant immunity to one of the remaining players for the next vote.\n\nGeorgina got the shock of her life when the TV presenter knocked on the door and emerged into her room.\n\nRichard revealed his words of encouragement for Georgina’s ileostomy bag profile photo were from the heart.\n\nHe said: \"Our conversation was totally real. It wasn't for effect and I wasn't telling fibs.\n\n\"Everything I said to you about your bag and your bravery and wearing it and putting it on camera was completely genuine.\n\n\"It's the only genuine thing I've done all week. And it's the bravest thing I've ever seen.\"\n\n*The Circle airs on Channel 4 at 10pm", "description": "The veteran presenter admitted wife Judy Finnigan 'fell off the sofa' while watching him pretend to be a 27-year-old girl", "authors": ["Kyle O'Sullivan", "Image", "Channel"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20464383.ece/ALTERNATES/s1200/0_Richard-Madeley-awkwardly-denies-pervy-flirting-with-Zoe-Balls-son.jpg", "published_at": "2019-10-04"}