{"pub": "guardian", "url": "https://theguardian.com/sport/blog/2019/sep/04/stuart-broad-david-warner-nemesis-ashes-fourth-test", "downloaded_at": "2019-09-04 23:48:09.712851+00:00", "published_at": "2019-09-04", "title": "Stuart Broad is David Warner’s nemesis yet again in Ashes duel | Geoff Lemon", "language": "en", "text": "Australian opener was dismissed for the fifth time in the series by England’s quick who currently has the left-hander’s number\n\nSome Test series are defined by a single match-up. With the 2005 Ashes being used to fill every gap in the broadcast schedule during this year’s edition, there have been plenty of chances to see the full suite of performances but the duel that decided the result surely has to be Andrew Flintoff taking down Adam Gilchrist.\n\nHowever powerful Australia’s batting from the late 1990s through the first decade of the 2000s, there were plenty of times when the team was saved by Gilchrist. Until his arrival Australian wicketkeepers had averages in the 20s and chipped in with a few runs. A No 7 who averaged over 50 for most of his career and finished with 17 centuries completely changed the game. That is what England had to neutralise and Flintoff was able to do it.\n\nSteve Smith and the rain frustrate England on first day at Old Trafford Read more\n\nSkip forward to 2019 and there are some parallels to be drawn: another Australian batsman with the proven ability to devastate bowlers; a right-arm English seamer coming round the wicket to the left-hander, using that angle to move the ball and create discomfort; and a growing sequence of dismissals, during which the batsman begins to look unsettled and tentative, the pattern feeding itself.\n\nIn other ways Stuart Broad’s working over of David Warner has been entirely unlike its antecedent: Flintoff operated at much higher pace and often used reverse swing to target a No 7 by hooping the ball into his stumps while Broad is bowling to an opener with the new ball and using seam away to take his edge, with the odd in-ducker to find pads or timber.\n\nThe duel may not prove decisive either, if Warner’s teammate and suspension partner Steve Smith keeps churning out runs the way he has every time he’s been allowed to bat since their joint return to the side. But if Smith had even half of Warner’s usual output backing him up, Australia’s position in the series would not be in any question.\n\nInstead Broad has been able almost to neutralise Warner’s influence entirely. So far he has knocked the Australian over for 2, 8, 3, 0 and added another 0 on Wednesday in Manchester.\n\nWarner’s other two dismissals have been to Jofra Archer for five and 61. That lone score in double figures came in the first innings at Leeds, surviving a fearsome working over from both bowlers with the ball at times hooping and jagging too much to take a wicket. Warner battled through for a score that should have been match-winning, only for a miracle finish to take that away. But it did show the influence he could have even while struggling.\n\nFacebook Twitter Pinterest Stuart Broad rejoices after striking in the first over of the match to remove David Warner. Photograph: Jon Super/Shutterstock\n\nIt was Broad who snuffed out any optimism from that innings, getting his man with a second-ball duck in the second innings at Headingley, and another second-baller here. Before the match Australia’s coach, Justin Langer, said that one could respond to senior players being short of runs with “a smile on your face, because you know they’re not far off”. But a sequence extending into its fourth Test may be outpacing his capacity to stay sanguine.\n\nWarner’s long-term quality is not in question. Players with 21 Test hundreds are not found in every dressing room. But on his third tour of England the attacking opener has never yet been influential in winning a match, let alone a series, and at 32 years of age he is unlikely to be back for another shot. He has come back into the side after the ball-tampering scandal because of how good he is but he would not want to give administrators too much opportunity to start thinking about moving him on.\n\nAshes: Overton says wind hit bowlers’ run-up rhythm and helped Smith weather storm Read more\n\nThe slump has been a surprise. Warner was one run away from topping the World Cup list in England only a few weeks ago, racking up 647 with three centuries. He even played his one-day cricket in what felt closer to his Test match mode, taking his time to build big innings. He seemed set for a substantial Ashes. There is no way to quantify whether the difference has been in fields or in bowlers or in facing the red Dukes ball versus the white Kookaburra; or whether it is something less technical, less tangible, like the lasting scrutiny of an Ashes series settling in the way that a manic global tournament might not.\n\nPerhaps it is the cumulative effect of “getting a couple of good balls”, as he brushed off the issue earlier in the series, but then growing in concern as a couple becomes a bushel.\n\nAll one can see is that Test-match Warner right now is not himself, caught in two minds and then caught in the cordon. For his duck on Wednesday he left his bat out like shopping that he had forgotten on the front step, scolding himself for absent-mindedness when the consequences became known. He has done similar things a couple of times, as well as being jagged on the pads and also losing his leg stump. The ways to get out are multiplying, the ways off strike are not. With every innings that Broad holds Warner, England’s chance to hold Australia grows.", "description": "The Australian opener David Warner was dismissed for the fifth time in the series by England’s Stuart Broad who clearly, currently, has the left-hander’s number", "authors": ["Geoff Lemon"], "top_image": "https://i.guim.co.uk/img/media/34beb4177f8b198d91c28b7d7f7c27bd3eb5f023/199_159_2298_1379/master/2298.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9fa83b4fdc4a5c5e168f8e556422d0b1"}