{"pub": "yahoo", "url": "https://news.yahoo.com/mick-mulvaney-melts-down-under-152551846.html", "downloaded_at": "2019-10-20 17:11:04.963067+00:00", "title": "Mick Mulvaney Melts Down Under Brutal Grilling By Fox’s Chris Wallace", "language": "en", "text": "Days after his disastrous White House press briefing in which he admitted President Donald Trump was seeking out a quid pro quo with Ukraine before saying never mind, acting White House Chief of Staff Mick Mulvaney struggled to walk back his comments under the intense and relentless grilling of Fox News Sunday anchor Chris Wallace.\n\nAlmost immediately during the Sunday morning broadcast, Wallace pressed Mulvaney on his remarks, asking why he said during the press conference that military aid to Ukraine depended on investigating the actions of Democrats during the 2016 election, prompting Mulvaney to assert that he never actually said that.\n\n“Again, that’s not what I said, that's what people said I said,” he replied before saying there were “two reasons” why the United States would have held up aid: corruption and whether other European nations were helping with aid.\n\nMick Mulvaney Has Conservatives Asking: WTF Are You Doing?\n\nWallace, meanwhile, didn’t let Mulvaney’s spin go unchecked, telling the chief of staff that anyone listening to the briefing could “come to only one conclusion” before playing clips Mulvaney confirming that Trump withheld aid unless the Ukrainians investigated the Democrats.\n\nMulvaney continued to insist that he had been misinterpreted and that aid was only contingent on corruption and additional European assistance, causing the Fox News anchor to fire back.\n\n“I hate to go through this but you said what you said,” Wallace stated. “And the fact is, after that exchange with [ABC News correspondent] Jonathan Karl, you were asked another time why the aid was held up. What was the condition for the aid? And you didn’t mention two conditions, you mentioned three conditions.”\n\nWallace, once again, threw Mulvaney’s own remarks back in his face, playing yet another clip from the press briefing of Mulvaney claiming military aid to Ukraine was contingent upon them cooperating with the Trump administration and investigating the Democrats.\n\nThe Trump aide, however, attempted to brush off his previous remarks by saying he didn’t actually use the words “quid pro quo,” prompting Wallace to point out that when Karl pressed him on whether or not there was a quid pro quo, Mulvaney said that “happens all the time.”\n\nFox News Host Ed Henry: Not ‘Media’s Fault’ Mick Mulvaney Admitted Quid Pro Quo\n\nThe two would go back and forth over this issue for a few more minutes, with Wallace repeatedly cornering Mulvaney over his previous comments and the chief of staff flailing away and struggling to present even a laughable defense.\n\nAt one point, Wallace asked Mulvaney whether he had offered his resignation to Trump in the wake of the blowback and criticism he received over the press briefing. Mulvaney said the topic was “absolutely not” discussed with the president, adding that he is “very happy working there.”\n\nCNN, meanwhile, reported Sunday that prior to the impeachment crisis that Trump finds himself currently embroiled in, there were internal efforts to push Mulvaney out as acting chief of staff. Those efforts subsided, however, when the push for impeachment heated up in the wake of the Ukraine scandal late last month.\n\nBesides the issues surrounding the Ukraine scandal and impeachment, Wallace also grilled Mulvaney on the president’s sudden reversal on next year’s G7 summit, which Mulvaney announced last week would be held at Trump’s personal property.\n\nAsked by Wallace why the president “caved” to the bipartisan backlash, Mulvaney said Trump was “honestly surprised at the level of pushback,” adding that the president “still considers himself to be in the hospitality business.”\n\nWallace seized on the “hospitality business” comment and pressed Mulvaney if the president understood why it “looked lousy.” The acting chief of staff's retort: “I think he thinks people think it looks lousy.”\n\nSean Hannity Goes Off on Mick Mulvaney: ‘I Just Think He’s Dumb’\n\nRead more at The Daily Beast.\n\nGet our top stories in your inbox every day. Sign up now!\n\nDaily Beast Membership: Beast Inside goes deeper on the stories that matter to you. Learn more.", "description": "Days after his disastrous White House press briefing in which he admitted President Donald Trump was seeking out a quid pro quo with Ukraine before saying never mind, acting White House Chief of Staff Mick Mulvaney struggled to walk back his comments under the intense and relentless grilling of Fox News", "authors": ["Justin Baragona"], "top_image": "https://s.yimg.com/uu/api/res/1.2/pdyKurpOoFtA3hgMHIxuvw--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/cd5b66237289d395946597d318620d9a", "published_at": "2019-10-20"}