{"pub": "news24", "url": "https://news24.com/Video/SouthAfrica/News/watch-sssssssurprise-snake-catcher-finds-not-1-but-2-black-mambas-in-bedroom-closet-20190723", "downloaded_at": "2019-10-07 20:17:00.933677+00:00", "title": "WATCH: Sssssssurprise! Snake catcher finds not 1, but 2 black mambas in bedroom closet", "language": "en", "text": "A KwaZulu-Natal family were forced to vacate their home for the night after noticing a black mamba slither its way into their bedroom closet earlier this month. (Screengrab)\n\nA KwaZulu-Natal family fled their Inanda home for a night after they spotted a black mamba slithering into a bedroom wardrobe earlier this month.\n\nThey ended up spending the night at a neighbour's house.\n\n\"They had seen the snake at midnight and luckily for them, the neighbour said that they could spend the remainder of the night in his house,\" Nick Evans, the owner of the KZN Amphibian and Reptile Conservation, told News24.\n\nEvans was sent to capture the snake but was surprised to find a second snake in the cupboard.\n\n\"I suspect that the mating pair entered the home to find some warmth,\" he said.\n\nIn the video, Evans can be heard describing the snakes as \"chilled\" due to their lack of movement.\n\n\"It was freezing down in the Inanda Valley, particularly at that time of the morning,\" he said.\n\nWith mating season under way, snakes will find unusual spots to hide to keep warm.\n\nEvans told News24 that the snakes were there for a day and did not attack any of the family members because it was not in their nature to do so.\n\n\"These snakes had plenty of time to attack and kill the residents, but they didn't. Instead, they did what they usually do: Shy away and hide.\"\n\nThe snakes were released three days after they were captured.\n\nGET THE NEWS at your fingertips and download the News24 app for Android here now. Get it for your iPhone here.\n\nKEEP UPDATED on the latest news by subscribing to our FREE newsletter.\n\n- FOLLOW News24 on Twitte", "description": "A KwaZulu-Natal family fled their Inanda home for a night after they spotted a black mamba slithering into a bedroom wardrobe.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9145/cd5707e28928447eab87bd420736763f.jpg", "published_at": "2019-07-23"}