{"pub": "americanconservative", "url": "https://washingtonpost.com/opinions/2019/09/30/we-need-justice-yemen-justice-khashoggi/?arc404=true", "downloaded_at": "2019-10-05 13:42:17.422201+00:00", "title": "Tawakkol Karman: We need justice for Yemen — and justice for Khashoggi", "language": "en", "text": "Tawakkol Karman is a Nobel Peace Prize laureate.\n\nThe government that orchestrated the brutal murder of Saudi journalist and Post contributing columnist Jamal Khashoggi is now applying the same approach to my country. Just as Saudi Arabia reportedly sent a squad to execute and dismember Jamal, it has also sent forces — with its ally, the United Arab Emirates — on a mission to destroy and chop up Yemen.\n\nA year ago, the world was shocked by the murder of a Saudi journalist at his country’s consulate in Istanbul, in a heinous crime committed in flagrant disregard of the sanctity of diplomatic facilities and the basic rules of international law. The Saudi regime tried to deny any connection to the crime, but international pressure forced it to admit it happened — and that Saudi citizens were involved.\n\n[Read this piece in Arabic]\n\nThough Jamal’s killing shocked the world, few in Yemen were surprised. Saudi Arabia is committing crimes in Yemen with the same atrocity and recklessness. When confronted by the international community, it shrugs off responsibility and blames others. Sound familiar?\n\nFor the past five years, a coalition led by the Saudi government has bombarded Yemen from the sky. It has targeted wedding and funeral halls, markets, residential neighborhoods, infrastructure and even archaeological sites, some dating back 4,000 years. More than 60,000 people have died in the conflict, and more than 3 million have been displaced. In early September, 135 people died from a single Saudi-led strike on a Houthi militia detention center.\n\nDespite this callousness, Yemen’s plight has often been forgotten around the world — and the responsibility for this, too, can be laid at Saudi Arabia’s doorstep. Cash is Saudi Arabia’s preferred foreign policy. It has used aid, arms transactions and oil money to silence the world from effectively pursuing Jamal’s killers, and it is using the same policy in relation to Yemen. Too few around the world have spoken up on our behalf as a result.\n\nJamal was an exception. He was one of the rare voices in Saudi Arabia who welcomed the wave of democratic change that began in 2011 in the Middle East, eliciting the ire of the Saudi authorities. Jamal used his articles to support peace in Yemen, taking an early stance against further conflict and calling on Saudi Arabia to establish a historic reconciliation.\n\nJamal also reached out to many Yemeni youths and journalists, and on every occasion, he emphasized the importance of Yemenis finding local solutions. He stressed that this was contingent on the liberalization of Yemeni political decision-making, so decisions were not made in the interests of Saudi Arabia or Iran when both countries had divergent goals that did not necessarily coincide with those of the Yemeni people. Jamal’s arguments convinced many in Yemen, who no longer view Saudi Arabia as a champion simply seeking to restore their state.\n\nIn my last meeting with Jamal in Istanbul two months before his death, we agreed to make a joint effort to stop the war under the slogan “Stop the war, stop the coup, stop the hunger.” I will not forget his words to me that day: “I will help you with all I can, if not for Yemen, then for my country, Saudi Arabia, which has lost so much because of the war economically and morally. \"\n\nJamal’s tragic, horrifying murder has contributed to a global awakening against Saudi abuses in the region and expanded the scope of the antiwar movement in Yemen and beyond. Thus, while the war in Yemen and murder of Jamal seem to be separate issues, the recklessness and cruelty of the leader behind both atrocities have made them inextricably linked. And so justice for both crimes is linked as well: Increased scrutiny of the real perpetrators of Jamal’s murder could galvanize the push to end the war in Yemen. And the prosecution of those involved in war crimes and violations in Yemen would add further impetus to the trial and punishment of Jamal’s assassins.\n\nSaudi atrocities in the Middle East are myriad. Real justice will involve justice for all its victims.\n\nRead more about Jamal Khashoggi:\n\nA missing voice, a growing chorus\n\nRobert Menendez: Trump betrayed U.S. moral leadership with Saudi Arabia. So Congress had to act.\n\nEzzedine Fishere: Jamal Khashoggi symbolized the promise of reconciling political Islam and democracy\n\nAsli Aydintasbas: The liberal world order crumbled a year ago. We’re still reeling.\n\nIyad el-Baghdadi: Saudi Arabia is suffocating the Arabic public sphere. We must fight back.\n\nDavid Von Drehle: Hollywood loves triumphant journalism stories. This isn’t one of them.", "description": "Saudi atrocities in the Middle East are myriad. Real justice will involve justice for all its victims.", "authors": ["Tawakkol Karman"], "top_image": "https://www.washingtonpost.com/resizer/FO4nlJaghmF2JSr4rrksc1aqAso=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VLR5FDQNJNEEPJMZBU6TA52JF4.jpg", "published_at": "2019-09-30"}