{"pub": "yahoo", "url": "https://news.yahoo.com/amazon-fish-wears-natures-bullet-193303067.html", "downloaded_at": "2019-10-17 06:29:38.734969+00:00", "title": "Amazon fish wears nature's 'bullet-proof vest' to thwart piranhas", "language": "en", "text": "FILE PHOTO: Diver Reeson checks on the Arapaima fishes in the tropical section of Europe's biggest freshwater aquarium Aquatis in Lausanne\n\nBy Will Dunham\n\nWASHINGTON (Reuters) - One of the world's largest freshwater fish is protected by the natural equivalent of a \"bullet-proof vest,\" helping it thrive in the dangerous waters of the Amazon River basin with flexible armor-like scales able to withstand ferocious piranha attacks.\n\nResearchers from the University of California, San Diego and University of California, Berkeley on Wednesday described the unique structure and impressive properties of the dermal armor of the fish, called Arapaima gigas. They said their findings can help guide development of better body armor for people as well as applications in aerospace design.\n\nThe fish, also known as pirarucu, gets up to 10 feet (3 meters) long and weighs up to 440 pounds (200 kg). Arapaima, a fish that can breathe air and survive up to a day outside of the water, inhabits rivers in Brazil, Guyana and Peru infested with piranhas, known for razor-sharp teeth, incredible bite strength and deadly feeding frenzies.\n\nThere long has been an evolutionary arms race in which predators develop ways to kill - like sharp teeth - and other animals develop ways to stay alive like the dermal armor seen in various fish, dinosaurs and mammals over time. Arapaima's scales, the researchers said, possess all the best attributes of a bullet-proof vest, but the elements are better integrated into one solid piece combining imperviousness and flexibility.\n\n\"Such lightweight and tough materials like fish scales are the sexy topics that materials scientists are pursuing,\" said Wen Yang, a UCSD materials scientist who helped lead the study published in the journal Matter.\n\n\"It is true that the natural armor is similar to artificial body armor because of the similar scale overlapping system. However, the natural armor such as these fish scales is tough and much lighter, without impeding body flexibility and locomotion,\" Yang added. \"Remember that the fish scales were developed through hundreds of millions of years. They are very advanced.\"\n\nThe researchers conducted laboratory tests of the scales.\n\nThe scales, they found, have a hard mineralized outer layer to resist penetration that is bound to a tough-but-flexible inner layer by collagen – the main structural protein in skin and other connective tissues in the body.\n\nThis structure means the scales can become deformed when bitten by a piranha but are not torn, broken or pierced, protecting the fish from injury.\n\n\"We were able to see how the collagen fibers deform without a catastrophic failure including the mechanisms of twisting, folding, sliding, stretching, delamination,\" Yang said.\n\nThe study was backed by the U.S. Air Force Office of Scientific Research.\n\n\n\n\n\n(Reporting by Will Dunham; Editing by Sandra Maler)", "description": "One of the world's largest freshwater fish is protected by the natural equivalent of a \"bullet-proof vest,\" helping it thrive in the dangerous waters of the Amazon River basin with flexible armor-like scales able to withstand ferocious piranha attacks.  Researchers from the University of", "authors": ["Will Dunham"], "top_image": "https://s.yimg.com/uu/api/res/1.2/3GDf2MoL4wHQ0TBHz7lvLw--~B/aD0yOTI7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/9fffa2db3f6cc21a14d27f8d272997e7", "published_at": "2019-10-16"}