{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7568285/Hugh-Grant-blasts-unendurable-cinema-volume-levels-screening-Joker-local-Vue.html", "downloaded_at": "2019-10-13 18:47:24.811698+00:00", "title": "Hugh Grant blasts 'unendurable' cinema volume levels after a screening of Joker at his local Vue", "language": "en", "text": "Hugh Grant has blasted 'unendurable' volume levels in cinemas after sitting through a screening of Joker in his local Vue.\n\nThe actor, 59, took to Twitter to complain that his trip to watch the film in Fulham was 'pointless' due to the deafening noise levels of the psychological thriller.\n\n'Am I old or is the cinema MUCH TOO LOUD? Unendurable. Pointless. @vuecinemas,' he tweeted.\n\nHowever Vue cinema were quick to respond to his tweet, assuring him that sound settings are 'regularly checked to ensure they comply with health and safety standards', and promising to look into the matter.\n\nHugh Grant has blasted 'unendurable' volume levels in cinemas after sitting through a screening of the Joker in his local Vue cinema\n\nBut the Paddington 2 actor was snapped back and asked how they could possibly help if they didn't know which cinema he had gone to, adding that the 'joke was on him'.\n\nMany fans also shared their thoughts on noise levels in cinemas, agreeing that films appear to be getting increasingly louder, leading to uncomfortable viewing.\n\n'The cinema is much too loud. Unbearable!' One Twitter user wrote.\n\n'Far too loud. I don't go anymore,' another said.\n\n'I went to see the Girl On The Train and the intro was so loud it frightened me. I had to walk out and ask for my money back. I will not be going again,' one said\n\nThe actor, 59, took to Twitter to complain his trip to watch the film in Fulham was 'pointless' and complained of the defeaning noise levels of the psychological thriller\n\nThe actor, 59, took to Twitter to complain that the trip to watch the film in Fulham was 'pointless' due to the deafening noise levels of the psychological thriller\n\n'I'd love to take my grandchildren to the cinema but I had such a bad headache after the last time that I took them - I daren't!' another wrote.\n\n'Vue are ALWAYS too loud - any multiplex cinema is painful for the first 1/4 hour - dread to think what damage they do our ears!' one said.\n\nSound levels in cinemas have even prompted members of the British Tinnitus Association, who work to prevent hearing damage, to launch a survey on noise in public spaces, the Observer reports.\n\nThe size of cinema, audience number and age can all have an effect on the perception of sound.\n\nA spokesperson for Dolby cinema said loud noises can often be confused with feelings of 'discomfort' during a film.\n\nThe Paddington 2 actor was snapped back and asked how they could possibly help if they didn't know which cinema he had gone to\n\n'While a scene may be perceived as loud, these are brief moments and well within the industry standards. An area that can be confused with loudness is when we feel discomfort: this could be loudness or distortion.\n\n'Distortion is when a sound system was not appropriate for the size of room it is installed in and at peaks causes distortion, which is objectionable to a listener,' they told the publication.\n\nIt comes after Joker stirred controversy on its opening weekend, after some fans stormed out of theaters around the world saying the movie was too disturbing and 'triggering'.\n\nIt comes after Joker is stirred controversy on its opening weekend, after some fans stormed out of theaters around the world saying the movie was too disturbing and 'triggering'\n\nThe R-rated supervillain flick smashed October opening-day box office records after taking home $39.9 million in domestic ticket sales on Friday, and is on pace to take in an eye-watering $92 million weekend total.\n\nBut not everyone embraced the dark, ultra-violent film, which sees Joaquin Phoenix portray Arthur Fleck, the embattled clown who later transforms into Batman's most iconic nemesis.\n\nOn fan wrote on Twitter: 'Literally just walked out of a screening of Joker. Way too terrifying to be there with all this going on the way the movie glamorizes gun violence and mental health issues.'\n\nOthers have gone as far as calling for the movie to be banned from theaters, saying that it promotes violence and could even inspire a mass shooting.", "description": "The actor, 59, took to Twitter to complain that the trip to watch the film in Fulham was 'pointless', due to the deafening noise levels of the psychological thriller.", "authors": ["Sophie Law For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/15/19656506-0-image-a-131_1570975390780.jpg", "published_at": "2019-10-13"}