{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/24/mike-pence-rips-nike-and-the-nba-for-exporting-communist-censorship", "downloaded_at": "2019-10-24 23:53:54.075154+00:00", "title": "Mike Pence Rips Nike and the NBA for Exporting Communist Censorship", "language": "en", "text": "Vice President Mike Pence criticized American corporations on Thursday for submitting to Chinese censorship demands, singling out Nike and the NBA.\n\n“Lately, China has also been trying to export censorship, the hallmark of its regime by exploiting corporate greed,” Pence said.\n\nThe vice president spoke at the Woodrow Wilson International Center for Scholars about the future of the United States and China relationship.\n\nHe referred to the recent attempt by Chinese authorities to punish the Houston Rockets NBA team after the manager of the team retweeted a supportive message for the rights of protesters in Hong Kong. He specifically criticized Nike for removing Houston Rockets merchandise from China after the regime moved to punish the team.\n\n“Nike promotes itself as a so-called social justice champion, but when it comes to Hong Kong, it prefers checking its social conscience at the door,” Pence said.\n\nHe also cited several players and owners in the NBA for caving to Chinese demands.\n\n“Some of the NBA’s biggest players and owners who routinely exercise their freedom to criticize this country lose their voices when it comes to the freedom and rights of the people of China,” he said.\n\nHe criticized the NBA for acting like a “wholly-owned subsidiary” of the Communist Party in China.\n\n“A progressive corporate culture that willfully ignores the abuse of human rights is not progressive, it is repressive,” Pence said.\n\nHe urged all American corporations to stand up for American values of freedom and democracy as President Donald Trump worked to balance the country’s economic relationship with China.\n\n“When American corporations, professional sports, pro athletes embrace censorship, it’s not just wrong, it’s un-American,” he said.\n\nPence signaled support for the protesters in Hong Kong, noting that its society was a representation of what a free China could look like.\n\n“We respect the sovereignty of nations, but America also expects Bejing to honor its commitments,” Pence said. “And President Trump has repeatedly made it clear that it would be much harder for us to make a trade deal if the authorities resort to the use of violence against the protestors of Hong Kong.”", "description": "Mike Pence criticized American corporations on Thursday for submitting to Chinese censorship demands, singling out Nike and the NBA.", "authors": ["Charlie Spiering"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-1177955488-640x335.jpg", "published_at": "2019-10-24"}