{"pub": "heritage", "title": "Why China’s Intellectual Property Theft Is a Concern for National Security", "url": "https://heritage.org/asia/commentary/why-chinas-intellectual-property-theft-concern-national-security", "language": "en", "published_at": "2019-04-02", "downloaded_at": "2019-09-02 07:10:36.923024+00:00", "text": "A wide-ranging series of cyberattacks by Chinese hackers has been uncovered by cybersecurity firm Accenture Security’s iDefense.\n\nThe hackers’ target, according to The Wall Street Journal? At least 27 universities located across the United States, Canada, and Southeast Asia.\n\nThe connection among most of the affected institutions is reportedly their involvement in research of military-use maritime technology. Some of the schools have been the recipients of Navy contracts, host research hubs, or employ faculty with maritime expertise.\n\nIn 2018, The Wall Street Journal reported that the same Chinese hacker group, sometimes known as Temp.Periscope, has been a persistent threat with a history of breaching Navy contractors.\n\nTemp.Periscope has been blamed for cyberattacks that have resulted in the compromise of sensitive material related to military technology, including plans to construct a new supersonic anti-ship missile to be deployed by American submarines.\n\nThe recent cyberattacks reportedly sought to exploit the relationship between academic institutions and the information-sharing that takes place among them.\n\nSpear-phishing emails containing malware, a common method for cyber-intrusion and information collection, were sent to the targets. The emails were disguised as legitimate correspondence from another affected university.\n\nThese types of efforts are anything but novel at this point, and the danger they pose to American national security remains high.\n\nA 2018 indictment by the Justice Department revealed the extent of intrusions by another group of Chinese hackers, whose attacks gained unauthorized access to more than 45 technology companies and U.S. government agencies, stealing hundreds of gigabytes of sensitive information.\n\nThis rampant theft of intellectual property is not without its economic costs. Previous estimates suggest that intellectual property theft, including by China, costs the United States billions every year in potential revenuelost, placing strains on U.S. companies and hampering innovation and growth.\n\nThe theft of new technologies goes beyond the oft-reported economic concerns and presents a potentially larger national security issue.\n\nThe fact that many victims of these cyberattacks are upstream defense resources, such as contractors and universities, is concerning. It’s a reminder that China’s efforts to secure new technology are unbiased.\n\nBecause they are unlikely to have the same level of security infrastructure as that employed by some government installations, universities present a unique opportunity for malicious actors to gain access to new technical or industrial knowledge.\n\nAs such, universities can be low-hanging fruit for Chinese hackers.\n\nSpending billions of dollars to develop and field new defense technologies, only to have their effectiveness compromised by a data breach, can be costly for developers and for taxpayers.\n\nMore importantly, it can endanger U.S. service members who rely on that technological advantage to accomplish their missions safely.\n\nThe United States must continue to take the dangers posed by cyberattacks and intellectual property theft seriously.\n\nEncouraging U.S. companies and institutions to identify and secure vulnerabilities in their computer networks is an important step, but the U.S. must also develop and employ more direct deterrents against those actors that engage in cybertheft toward U.S. entities.\n\nStrengthening U.S. defenses against cyberattacks can be a difficult task. Coordinating these efforts across a network of various institutions doesn’t make it any easier.\n\nIt remains clear, however, that China’s continuing theft of intellectual property creates economic and security risks that the U.S. cannot afford to leave unmitigated.", "description": "A wide-ranging series of cyberattacks by Chinese hackers has been uncovered by cybersecurity firm Accenture Security’s iDefense.\n\nThe hackers’ target, according to The Wall Street Journal? At least 27 universities located across the United States, Canada, and Southeast Asia.", "authors": ["Riley Walters", "Commentary By", "Policy Analyst", "Asia Economy", "Spring Member Of The Young Leaders Program At The Heritage Foundation"], "top_image": "https://www.heritage.org/sites/default/files/styles/facebook_optimized/public/images/2019-04/GettyImages-804476426.jpg?itok=2snMqOjJ"}