{"pub": "npr", "url": "https://npr.org/sections/health-shots/2019/09/14/760680901/air-ambulances-woo-rural-consumers-with-memberships-that-may-leave-them-hanging", "downloaded_at": "2019-09-15 00:02:14.045590+00:00", "title": "Air Ambulances Woo Rural Consumers With Memberships That May Leave Them Hanging", "language": "en", "text": "Air Ambulances Woo Rural Consumers With Memberships That May Leave Them Hanging\n\nEnlarge this image toggle caption Sarah Jane Tribble/Kaiser Health News Sarah Jane Tribble/Kaiser Health News\n\nOn a hot June day in Fort Scott, Kan., as the Good Ol' Days festival was in full swing, 7-year-old Kaidence Anderson sat in the shade with her family, waiting for a medevac helicopter to land.\n\nA crowd had gathered to see the display prearranged by staff at the town's historic fort.\n\n\"It's going to show us how it's going to help other people because we don't have the hospital anymore,\" the redheaded girl explained.\n\nMercy Hospital Fort Scott closed at the end of 2018, leaving this rural community about 90 miles south of Kansas City, Kan., without a traditional hospital. The community has outpatient clinics run by a regional nonprofit health center and — at least temporarily — an emergency department operated as a satellite of a hospital a county away.\n\nSince the hospital closed, air ambulance advertising has become a more common sight in Fort Scott mailboxes. At least one company's representative has paid visits to a local nursing home and the Chamber of Commerce, offering memberships. A prepaid subscription would guarantee that if an AirMedCare Network helicopter comes to your rescue, you would pay nothing.\n\nNationwide, though, state insurance leaders, politicians and even one of the nation's largest air ambulance companies have raised concerns about the slickly marketed membership campaigns. The memberships often don't include every ambulance company in an area, and the choice of which medevac service answers a call is out of a consumer's hands.\n\nThe air ambulance industry expanded by more than a hundred bases nationwide from 2012 to 2017 and prices increased as well, according to a recent federal report. The median price charged for a medevac helicopter transport was $36,400 in 2017 — a 65% increase compared with the roughly $22,100 charged in 2012, according to the March report from the U.S. Government Accountability Office.\n\nPrivate insurance frequently does not cover the full cost of the trips, and consumers often are surprised to get a bill showing they are responsible for the bulk of the charges. However, both Medicare and Medicaid control the price of the service, so enrollees in those government insurance programs face much lower out-of-pocket costs or have none.\n\nAirMedCare Network, which includes 340 bases across mostly rural America, has more than 3 million people enrolled in memberships, said Seth Myers, president of Air Evac Lifeteam, one of the medevac companies under the AirMedCare Network umbrella.\n\nOne brightly colored AirMedCare advertisement mailed in southeastern Kansas promised entry in a summer vacation giveaway as an incentive to sign up. A one-year membership is $85 — unless you are 60 or older, which qualifies you for a discount. Buying multiyear memberships increases the odds of winning that summer trip.\n\n\"We're a safety net for people in rural areas,\" Myers said. \"Generally, if I tell you the names of the towns that most of our bases are located in, you wouldn't know them unless you lived in that state.\"\n\nIncreasingly, though, state regulators have a skeptical view.\n\nNorth Dakota Insurance Commissioner Jon Godfread called the memberships \"another loophole\" that air ambulance companies use to \"essentially exploit our consumers.\" The state banned the memberships in 2017, noting that the subscription plans don't solve the problem of surprise medical bills as promised.\n\nToo often, the company responding to a patient's call for help is not the one the patient signed up with, Godfread said. North Dakota has nine different air ambulance operators that respond to calls, and patients have no control over which will be called, he explained.\n\nAir Evac's Myers said his company, which operates mostly in the Midwest and Texas, said his company just doesn't get complaints from customers about other companies picking them up. He counted three this year.\n\nTexas Rep. Drew Springer, a Republican, introduced a bill passed by the state legislature this year that would require companies to honor the subscriptions or memberships of other air ambulance companies.\n\nBut Texas Gov. Greg Abbott, also a Republican, vetoed Springer's reciprocity bill, saying it would unnecessarily intrude on the operations of private businesses.\n\nMyers said that AirMedCare Network was \"very careful to educate the legislature and the governor's office\" in Texas. A letter signed by Myers and other industry executives noted that the 1978 Airline Deregulation Act — a law created for the commercial airline industry — protects them. The federal law limits states' ability to regulate rates, routes or services. The law is at the core of the industry's defense of its prices.\n\nLike North Dakota, though, Montana used insurance regulations to limit the memberships. A 2017 law requires air ambulance subscriptions to be certified by the state's insurance department. As of August, no company had applied for certification — essentially opting out of the state.\n\nAir Methods, one of the nation's largest private air ambulance companies, decided memberships \"aren't right for patients,\" according to an email from Doug Flanders, the company's director of communications.\n\nWhile membership programs promise customers will avoid out-of-pocket expenses, in reality the contractual fine print \"isn't as cut and dry,\" she said in an email.\n\nPatients who sign up for memberships and have private insurance would still receive a bill and then must work through their insurance company's claims, denial and appeal processes before the membership benefits take effect.\n\nAnd while Air Evac's Myers said the AirMedCare Network memberships or subscription fees replace copays and deductibles, Air Method's email highlighted in bold print that \"a membership is not necessary\" for Medicare patients because federal law prohibits companies from charging more than copays and deductibles.\n\nMyers said having a membership offers peace of mind particularly to those Medicare enrollees who do not have an added supplemental insurance plan that covers transportation.\n\nAlso, because the memberships are not officially insurance or a covered benefit, air ambulance companies can end them at any time \"without obligation to notify the customer,\" stated the Air Methods email. This means a patient could believe his or her emergency air transport was taken care of, only to face a rude awakening when the bill came.\n\nAir Methods is the preferred helicopter service for Fort Scott's dispatch service, according to city officials. Yet, Midwest AeroCare operated the helicopter that dropped in during the Good Ol' Days festival.\n\nMidwest AeroCare is part of the AirMedCare Network — not Air Methods. Families like the Andersons were there looking for reassurance that someone would come for them if needed, said Dawn Swisher-Anderson, Kaidence's mom. Her son, Connor, has frequent and severe asthma attacks that require hospitalization.\n\n\"It's obviously scary with a young one when he's having breathing complications,\" Swisher-Anderson said.\n\nOnce the helicopter landed, a tall pilot and two crew members stepped out and the onlookers quickly formed a line on the grass. Susan Glossip, who brought her grandchildren to see the helicopter, encouraged them to pose for a picture.\n\nMidwest AeroCare representative Angela Warner stood nearby and asked whether she could post the picture on the company's Facebook page.\n\nAfter Glossip said yes, Warner began talking about the membership program emphasizing that \"with Fort Scott losing its hospital ... having a helicopter be able to fly in can mean the difference between living and dying for some people.\"\n\nGlossip agreed and asked for a membership brochure.\n\nKaiser Health News is a nonprofit news service covering health issues. It is an editorially independent program of the Kaiser Family Foundation that is not affiliated with Kaiser Permanente.", "description": "State regulators and even one medevac company have raised doubts about prepaid subscriptions and promised benefits offered by air ambulance companies. Gaps in coverage can be a problem.", "authors": ["Sarah Jane Tribble"], "top_image": "https://media.npr.org/assets/img/2019/09/13/emshelicopter2_wide-2721fe84f758e76defe5da4f3f6e9a3676e48a72.jpg?s=1400", "published_at": "2019-09-14"}