{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7599953/Love-Island-Australias-Anna-McEvoy-bursts-tears-five-bikini-clad-intruders-join-show.html", "downloaded_at": "2019-10-22 13:56:47.671099+00:00", "title": "Love Island Australia's Anna McEvoy bursts into tears as five bikini-clad intruders join the show", "language": "en", "text": "The Love Island Australia girls were left shaking in their boots on Tuesday, after five new bikini-clad intruders entered the villa.\n\nDuring a lunch date with Sophie Monk, the girls were left distraught after learning they wouldn't return to the villa that night - with a 'bomb squad' of babes joining the lads instead.\n\n'They're all going to be swayed,' Anna McEvoy - who is partnered with Josh Packham said, after breaking down in tears over the news of the new arrivals.\n\n'They're all going to be swayed': Love Island Australia's Anna McEvoy (pictured) burst into tears on Tuesday's show as five bikini-clad intruders entered the villa\n\nCartier Surjan added: 'Our guys are so easily tempted. But if a girl walks in and it turns their head, at the end of the day you know that guy wasn't worth your time.'\n\nThe 'bomb squad' includes model Angel Ellis-Holley, sales executive Biannca Rose, hairdresser Jordan Caylass, retail assistant Tea Fraser and model Isabella Green.\n\nAnna continued: 'Literally the moment another girl comes in there, they will be all swayed.'\n\nJaw-dropping! Five new gorgeous ladies (pictured) entered the Love Island villa on Tuesday night - much to the dismay of the original ladies\n\nFeeling sad too, boys? Upon hearing the news, the six remaining males didn't have quite the same reaction as the females to the 'bomb squad'\n\n'I know I'm jealous, I'm the most jealous person ever.\n\n'This is actually my worst nightmare. That is why I'm having a mental break down over this,' Anna added.\n\nThrough tears, she simply added: 'I like Josh.'\n\nWhat a bombshell! Isabelle Grace (pictured) is just one of the sizzling new arrivals set to tempt the men away from their partners on the show\n\nThe group then received a text confirming the dreaded news they were waiting for, which read: 'The girls that drove past in the Jeep will be taking your place for now. You will stay in the Hideaway until further notice.'\n\nUnsurprisingly, the lads weren't quite as upset with the news of the new arrivals.\n\nThe five men swiftly got to know the jaw-dropping 'bomb squad' during a flirty speed-dating challenge, while the girls remained alone in the hideaway.\n\nI've got a text! The girls received the news that they would be in the hideaway until further notice - while the men got to know the new bombshells during a speed-dating event", "description": "The Love Island Australia girls were left shaking in their boots on Tuesday, after five new bikini-clad intruders entered the villa.", "authors": ["Nicole Douglas For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/14/20036178-0-image-a-7_1571750119965.jpg", "published_at": "2019-10-22"}