{"pub": "businessinsider", "url": "https://businessinsider.com/wework-postpones-ipo-indefinitely-under-new-co-ceos-2019-9", "downloaded_at": "2019-10-01 00:24:55.564443+00:00", "title": "WeWork shelves IPO for now under new leadership", "language": "en", "text": "WeWork is shelving its initial public offering after a tumultuous six weeks that saw its cofounder and CEO step down.\n\nThe flexible-office-space company still plans to go public in the future, its new co-CEOs said in a Monday statement.\n\nRead more WeWork news here.\n\nWeWork is postponing its initial public offering indefinitely.\n\nCo-CEOs Artie Minson and Sebastian Gunningham said in a statement on Monday: \"We have decided to postpone our IPO to focus on our core business, the fundamentals of which remain strong. We are as committed as ever to serving our members, enterprise customers, landlord partners, employees and shareholders. We have every intention to operate WeWork as a public company and look forward to revisiting the public equity markets in the future.\"\n\nWeWork bonds hit a record low on the news.\n\nSee more: Sex, tequila, and a tiger: Employees inside Adam Neumann's WeWork talk about the nonstop party to attain a $100 billion dream and the messy reality that tanked it\n\nAfter WeWork's parent, The We Company, filed on August 14 to go public, it faced intense scrutiny of its finances and leadership from prospective investors, the media, and business giants like Sam Zell.\n\nConcerns included WeWork's path to profitability, its conflicts of interest, and the ability of CEO Adam Neumann to lead a public company. In the first half of the year, WeWork had a loss of $690 million on $1.5 billion in revenue.\n\nThe company considered cutting its valuation by more than 50%, ousted Neumann, and delayed its IPO on September 17, before ultimately withdrawing its filing to go public.\n\nFounded in 2010, WeWork has exploded from a single outpost in New York to 528 locations in 111 cities. Its business focus has matured along the way — previously known for loud, open rooms with communal desks for millennial entrepreneurs, the company now does about 40% of its business with companies with over 500 employees, offering corporate build-outs and private floors for the likes of BlackRock and Microsoft.\n\nAlso read: How WeWork spiraled from a $47 billion valuation to talk of bankruptcy in just 6 weeks\n\nHave a WeWork tip? Contact this reporter via encrypted messaging app Signal at +1 (646) 768-1627 using a non-work phone, email at mmorris@businessinsider.com, or Twitter DM at @MeghanEMorris. (PR pitches by email only, please.) You can also contact Business Insider securely via SecureDrop.", "description": "The flexible-office company still plans to operate as a public company in the future, its co-CEOs said in a Monday statement.", "authors": ["Meghan Morris"], "top_image": "https://image.businessinsider.com/5d603a4f91b6f6799808bea5?width=1200&format=jpeg", "published_at": "2019-09-30"}