{"pub": "nationalreview", "url": "https://nationalreview.com/corner/bernie-sanders-to-participate-in-democratic-primary-debate-despite-heart-procedure", "downloaded_at": "2019-10-05 06:59:18.660344+00:00", "title": "Bernie Sanders to Participate in Upcoming Democratic Primary Debate Despite Heart Procedure", "language": "en", "text": "Sen. Bernie Sanders speaks in Des Moines, Iowa, August 10, 2019. (Scott Morgan/Reuters)\n\nPresidential candidate Bernie Sanders will participate in the Democratic primary debate scheduled for October 15, according to the Sanders campaign.\n\nThe campaign confirmed to The Hill on Thursday that Sanders will appear at the debate in Ohio along with eleven other Democratic candidates.\n\nOn Wednesday Sanders’ campaign confirmed that the candidate had undergone heart surgery to clear a blocked artery. Doctors successfully inserted two stents into the artery during surgery.\n\nAdvertisement\n\nAdvertisement\n\nThe campaign cancelled events and postponed purchases of TV ads in Iowa after the incident.\n\n“Senator Sanders is conversing and in good spirits,” said campaign adviser Jeff Weaver in a statement after the procedure. “We are canceling his events and appearances until further notice, and we will continue to provide appropriate updates.”\n\nSanders later put out a tweet thanking well-wishers and his doctors, while calling once again for universal medicare coverage, one of his central campaign issues.\n\nThanks for all the well wishes. I'm feeling good. I'm fortunate to have good health care and great doctors and nurses helping me to recover. None of us know when a medical emergency might affect us. And no one should fear going bankrupt if it occurs. Medicare for All! — Bernie Sanders (@BernieSanders) October 2, 2019\n\nAt 78 years old, Sanders is the eldest in a Democratic primary field that also includes Joe Biden (76) and Elizabeth Warren (70).\n\nFormer president Jimmy Carter, who is currently the longest-lived president in history at 95, recently suggested imposing an age limit for prospective presidential candidates.\n\n“If I were just 80 years old, if I was 15 years younger, I don’t believe I could undertake the duties that I experienced when I was president,” said Carter at a September 19 conference at the Carter Center in Atlanta.", "description": "Presidential candidate Bernie Sanders will participate in the Democratic primary debate scheduled for October 15, according to the Sanders campaign.", "authors": ["Zachary Evans", "Andrew C. Mccarthy", "Alexandra Desanctis", "Kevin D. Williamson", "John Yoo", "Jim Geraghty", "Kyle Smith", "David French", "Mairead Mcardle", "Victor Davis Hanson"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2019/08/bernie-sanders-des-moines-iowa.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-03"}