{"pub": "investing.com", "url": "https://uk.investing.com/news/stock-market-news/exclusive-airbus-defence-unit-sees-cash-challenge-adopts-efficiency-plan-1976750", "downloaded_at": "2019-10-09 08:32:28.184208+00:00", "title": "Exclusive: Airbus defence unit sees cash challenge, adopts efficiency plan", "language": "en", "text": "By Tim Hepher\n\nLONDON (Reuters) - Airbus (PA: ) Defence and Space has issued an internal warning of significant challenges in meeting cashflow and other targets for 2019 as it rolls out an internal efficiency plan called \"Momentum\", people familiar with the matter said.\n\nIt is the second time in as many years the group's second largest division has been forced to urge its 33,000 staff to save more cash in the final quarter of the year, a period when government customers are often slow in finalising payments.\n\nThis year, the squeeze has gained extra urgency as Airbus remains locked in a dispute with Germany over a freeze on arms exports to Saudi Arabia, imposed after the killing of journalist Jamal Kashoggi by Saudi operatives just over a year ago.\n\nAirbus says the moratorium on defence export licences has disrupted an already long-delayed Saudi border systems contract.\n\nAirbus Defence and Space staff have been urged to take steps to improve the division's cash position by the end of 2019, the people said, adding no figures were available.\n\nOne part of that effort is Momentum, a new plan aimed at achieving durable improvements in performance over a long term.\n\nResponding to a Reuters query, an Airbus spokesman confirmed the focus on improving cash as well as the new efficiency plan.\n\n\"In early fall, as is rather customary, management has reminded the teams inside Airbus Defence and Space that we have to work hard in order to meet our targets by year-end,\" the spokesman said.\n\n\"Our particular focus in 2019 is on achieving our free cashflow objectives. Momentum, in its current phase, is one supporting tool in our instrument box to make that happen.\"\n\nAirbus took a total of 208 million euros ($228 million) in first-half charges related to the Saudi contract, but has declined to put any numbers on the fallout to its cashflow.\n\nThe group is targeting a positive free cashflow before M&A and customer financing of approximately 4 billion euros in 2019 after an outflow of 3.981 billion euros in the first half blamed partly on higher inventories due to delayed jetliner deliveries.\n\nAirbus Defence and Space is the group's second largest division by sales and contributes some 17% of its revenue.\n\nThe division supplies aerial refuelling tankers, satellites and military transport planes, and contributes to the four-nation Eurofighter Typhoon combat jet. It has also partnered with France’s Dassault Aviation (PA: ) to study a successor to the Eurofighter and the French Rafale.\n\nDivisional chief executive Dirk Hoke has urged Berlin to relax the Saudi export ban, saying it will not lead to far-reaching changes in the Gulf kingdom. But Chancellor Angela Merkel's government has said there is no reason to alter the moratorium which has been extended to March next year.", "description": "Exclusive: Airbus defence unit sees cash challenge, adopts efficiency plan", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF980K2_L.jpg", "published_at": "2019-10-09"}