{"pub": "independent", "url": "https://independent.co.uk/sport/general/boxing/deontay-wilder-vs-tyson-fury-2-next-fight-andy-ruiz-jr-vs-anthony-joshua-2-a9091496.html", "downloaded_at": "2019-09-04 23:40:17.593101+00:00", "title": "Deontay Wilder vs Tyson Fury 2: American casts doubt over rematch and pushes for winner of Andy Ruiz Jr vs Anthony Joshua 2", "language": "en", "published_at": "2019-09-04", "text": "Deontay Wilder has cast doubt over a rematch against Tyson Fury and wants to become the undisputed world heavyweight champion instead by facing off against the winner of Andy Ruiz Jr vs Anthony Joshua 2.\n\nThe American had announced his plan to rematch with Luiz Ortiz later this year before facing off a second time against the Gypsy King, pencilled in for next February.\n\nBut Wilder is sceptical about Fury, who faces little-known Otto Wallin on September 14, and the Brit’s desire to meet him once again after narrowly avoiding a knockout in their draw last year.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“In my opinion, I don’t feel Fury wants to fight me again anyway,” Wilder told 78SportsTV.\n\n“If this opportunity comes about, I think Fury will pass up his opportunity, he would want me to fight for the unification, and then come back and fight him.\n\nShape Created with Sketch. September top 10 pound-for-pound boxers in the world Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. September top 10 pound-for-pound boxers in the world 1/11 Who is the best pound-for-pound boxer in the world? The ranking of The Independent's 10 best male boxers on the planet. Take a look through to see who comes out on top. AP 2/11 10. Manny Pacquiao (62-7-2) The Filipino looked sensational to outpoint Keith Thurman, flooring the American and rolling back the years at 40 years old to confirm himself as the No 3 welterweight in the world at worst. Considering the illustrious names on his resume, a place inside the top 10 pound-for-pound list and a world class win this year confirms his place here. AP 3/11 9. Juan Francisco Estrada (39-3-0) The two-weight world champion grabbed the lineal super flyweight title against Sor Rungvisai to snatch his pound-for-pound status and the WBC gold. Getty Images 4/11 8. Mikey Garcia (39-1-0) Despite coming up short against Errol Spence in their welterweight bout, Garcia is still a modern great as a four-weight world champion. Getty Images 5/11 7. Gennady Golovkin (38-1-1) Despite suffering the first loss of his career against Canelo Alvarez, Golovkin's stellar career keeps him in our rankings. Getty Images 6/11 6. Errol Spence (25-0-0) After his impressive win over Garcia in which he didn't drop a round, Spence added another big name to his record. Shawn Porter will be next, to unify the belts and perhaps further close the gap between himself and rival Terence Crawford in the P4P standings. Getty Images 7/11 5. Oleksandr Usyk (16-0-0) The undisputed, undefeated, unified cruiserweight world champion moves up in weight, but injury has delayed his debut against Carlos Takam. Getty Images 8/11 4. Naoya Inoue (18-0-0) The man nicknamed the 'monster' destroyed Emmanuel Rodriguez in two rounds to win the IBF world bantamweight title, elevating his status as one of the world's most dangerous fighters. Getty Images 9/11 3. Terence Crawford (35-0-0) Another three-weight world champion, Crawford enters our top three and reaffirmed his place as one of the sport's greats after a knockout win against Amir Khan. Getty Images 10/11 2. Canelo Alvarez (52-1-2) One loss and a whole heap of controversy but Canelo's record is one to be celebrated, a three-weight world champion and still just 28. The biggest star in the sport and an impressive win over Daniel Jacobs cements his standing, arguably has a claim to the throne, but he just misses out here. Getty Images 11/11 1. Vasyl Lomachenko (14-1-0) There can only be one. The king of the amateur game has stepped up to become the king of the professionals. Just 15 fights into his career and despite one career defeat, the current unified lightweight world champion sets records for days. Loma won a world title in his third fight, became a two-weight champion in his seventh, and a three-weight champion in his twelfth fight. The king. Less magic against a brave Luke Campbell, but more brutality, slashing body shots and exquisite balance and movement. Who's next? Commey, Lopez, Davis? Getty Images 1/11 Who is the best pound-for-pound boxer in the world? The ranking of The Independent's 10 best male boxers on the planet. Take a look through to see who comes out on top. AP 2/11 10. Manny Pacquiao (62-7-2) The Filipino looked sensational to outpoint Keith Thurman, flooring the American and rolling back the years at 40 years old to confirm himself as the No 3 welterweight in the world at worst. Considering the illustrious names on his resume, a place inside the top 10 pound-for-pound list and a world class win this year confirms his place here. AP 3/11 9. Juan Francisco Estrada (39-3-0) The two-weight world champion grabbed the lineal super flyweight title against Sor Rungvisai to snatch his pound-for-pound status and the WBC gold. Getty Images 4/11 8. Mikey Garcia (39-1-0) Despite coming up short against Errol Spence in their welterweight bout, Garcia is still a modern great as a four-weight world champion. Getty Images 5/11 7. Gennady Golovkin (38-1-1) Despite suffering the first loss of his career against Canelo Alvarez, Golovkin's stellar career keeps him in our rankings. Getty Images 6/11 6. Errol Spence (25-0-0) After his impressive win over Garcia in which he didn't drop a round, Spence added another big name to his record. Shawn Porter will be next, to unify the belts and perhaps further close the gap between himself and rival Terence Crawford in the P4P standings. Getty Images 7/11 5. Oleksandr Usyk (16-0-0) The undisputed, undefeated, unified cruiserweight world champion moves up in weight, but injury has delayed his debut against Carlos Takam. Getty Images 8/11 4. Naoya Inoue (18-0-0) The man nicknamed the 'monster' destroyed Emmanuel Rodriguez in two rounds to win the IBF world bantamweight title, elevating his status as one of the world's most dangerous fighters. Getty Images 9/11 3. Terence Crawford (35-0-0) Another three-weight world champion, Crawford enters our top three and reaffirmed his place as one of the sport's greats after a knockout win against Amir Khan. Getty Images 10/11 2. Canelo Alvarez (52-1-2) One loss and a whole heap of controversy but Canelo's record is one to be celebrated, a three-weight world champion and still just 28. The biggest star in the sport and an impressive win over Daniel Jacobs cements his standing, arguably has a claim to the throne, but he just misses out here. Getty Images 11/11 1. Vasyl Lomachenko (14-1-0) There can only be one. The king of the amateur game has stepped up to become the king of the professionals. Just 15 fights into his career and despite one career defeat, the current unified lightweight world champion sets records for days. Loma won a world title in his third fight, became a two-weight champion in his seventh, and a three-weight champion in his twelfth fight. The king. Less magic against a brave Luke Campbell, but more brutality, slashing body shots and exquisite balance and movement. Who's next? Commey, Lopez, Davis? Getty Images\n\n“He ain’t really no king, he don’t have a title. I revived his career for him, you’re welcome.”\n\nWith Ruiz Jr and Joshua battling for the WBA, IBF and WBO belts on December 7 in Saudi Arabia, Wilder is eager to put his WBC strap into the mix in search of finding the first undisputed heavyweight champion since Lennox Lewis in 2000.\n\n“I think he would do that anyway, but I would want him to do it as well, to give a unification,” Wilder added.\n\n“One champion, one face, one name. That has never left my mind.”", "description": "Deontay Wilder has cast doubt over a rematch against Tyson Fury and wants to become the undisputed world heavyweight champion instead by facing off against the winner of Andy Ruiz Jr vs Anthony Joshua 2.  The American had announced his plan to rematch with Luiz Ortiz later this year before facing off a second time against the Gypsy King, pencilled in for next February.", "authors": ["Jack Rathborn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/04/13/gettyimages-1164408221.jpg"}