{"pub": "bbc", "url": "https://bbc.com/news/world-us-canada-50067575", "downloaded_at": "2019-10-16 13:47:08.161563+00:00", "title": "Jailed British tourists entered US 'deliberately'", "language": "en", "text": "Image copyright Getty Images Image caption Parts of the US-Canada border are extremely remote\n\nA British family detained in the US after crossing the border from Canada intentionally entered the country illegally, officials have said.\n\nThey said the vehicle was captured on video \"slowly and deliberately\" driving through a ditch to enter the US.\n\nTwo adults in the vehicle had previously been denied travel authorisation to the US, Customs and Border Protection (CBP) said.\n\nOne couple involved claimed the group had crossed the border accidentally.\n\nDavid Connors, 30, and his wife Eileen, 24, said they were travelling with their young baby and family members - two more adults and young twins - on 3 October when, to avoid an animal, they veered on to a small road.\n\nBut CBP said that remote video surveillance captured the vehicle crossing a ditch before pulling back on to a road in Lynden, Washington state, and continuing west. The group was pulled over by a border patrol agent shortly after.\n\nThe occupants were arrested for illegally entering the US without inspection. During processing, records revealed the two adults that had previously been denied access to the US, CBP said on Tuesday.\n\nAfter their arrest, the family was moved across the country from Washington state to Pennsylvania, to be housed in a family migration detention centre.\n\nThe Connors said they had been \"traumatised\", detailing the \"scariest experience of our entire lives\", in a sworn statement that was provided to BBC News by their lawyer.\n\nThe family statement is the basis for a legal complaint lodged by their lawyer with the US Department of Homeland Security inspector general.\n\nUS immigration authorities have confirmed that the couple were being held, but denied their allegations of mistreatment.\n\nThe family expects to be released and sent back to the UK on Wednesday.\n\nYou may also be interested in...\n\nIn June last year, a French woman spent two weeks in US immigration detention after accidentally straying across the border from Canada during an evening jog.", "description": "Officials say two of the adults had previously been denied travel authorisation to the US.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/18622/production/_109247899_gettyimages-646265934.jpg", "published_at": "2019-10-16"}