{"pub": "nymag", "title": "Jussie Smollett’s Empire Character Is Being Banished to a Whole Other Continent", "url": "https://vulture.com/2019/08/how-empire-is-writing-out-jussie-smollett.html", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:05:22.359093+00:00", "text": "Photo: Chuck Hodes/FOX\n\nDespite Empire leaving the narrative door open for Jussie Smollett to return after the criminal charges against him were dropped, his character, Jamal Lyons, will 100 percent not be appearing in the show’s final season. Instead, he’ll be luxuriating off-screen in everyone’s fourth-favorite island country: England! Empire showrunner Brett Mahoney confirmed to TVLine that Smollett’s character and his new husband, Kai, will take their honeymoon phase away from the mean, music-obsessed streets of New York City. “Jamal is taking a sabbatical from the family,” Mahoney explained. “He doesn’t want to be caught up in Lyon family drama, which is very much in keeping with his point of view last season — that the family business should be something that the family moves away from. Jamal and Kai have decided to stay in London.”\n\nEarlier this year, Smollett claimed he was on the receiving end of a racist, homophobic attack from two men on a late Chicago evening. He was soon charged with filing a false police report, and prosecutors were subsequently able to lay out how Smollett allegedly planned his own attack. He pleaded not guilty to 16 felony counts, and the criminal charges against him were eventually dropped by Cook County. Still, the City of Chicago is currently suing Smollett for investigation fees that exceed $130,000.", "description": "Jussie Smollett will indeed be written out of Empire for its upcoming final season, where the show will keep him in London permanently.", "authors": ["Devon Ivie"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/05/09/09-jussie-smollett-empire.w1200.h630.jpg"}