{"pub": "foxnews", "url": "https://foxnews.com/world/iraq-stampede-deadly-islam-holy-ashoura-karbala", "downloaded_at": "2019-09-10 23:32:30.732599+00:00", "title": "Iraq stampede kills dozens at pilgrimage during Islamic holy holiday", "language": "en", "text": "More than 30 people were killed and nearly 100 injured in Iraq after a stampede was set off while Shiite Muslims celebrated one of the holiest days of the year.\n\nAt least 10 among the injured pilgrims were in critical condition, according to the officials.\n\nThe stampede happened near the gold-domed Imam Hussein shrine toward the end of the Ashoura procession in the holy city of Karbala – about 50 miles south of Baghdad, on Tuesday.\n\nIRANIAN FEMALE SOCCER FAN 'BLUE GIRL DIES AFTER SETTING HERSELF ON FIRE\n\nEvery year, hundreds of thousands of Shiite Muslims travel to Karbala for the somber day of Ashoura, which commemorates the killing of the Prophet Muhammad's grandson, the Imam Hussein, by a rival Muslim faction in what is now Iraq, in 680 A.D.\n\nHussein and his descendants are seen by Shiites as the rightful heirs to the prophet. Hussein's killing has been attributed with cementing the schism between Shiite and Sunni Islam.\n\nIt took place during the so-called “Twireej\" run, which is when tens of thousands of people run toward the shrine around noon. The run is said to symbolize when the maternal cousins of Imam Hussein’s half-brother al-Abbas ran from a nearby village to rescue him, only to find out that he had been killed.\n\nJORDAN PARLIAMENT CALLS FOR EXPELLING ISRAEL ENVOY, REACTING TO 'VIOLATIONS' AT JERUSALEM HOLY SIT, REPORT SAYS\n\nA spokesman for Karbala province's media office told the BBC that the stampede was triggered when one person stumbled, causing others to fall. However, the Associated Press said the stampede began after a walkway collapsed.\n\nNo Iraqi media released images of the walkway collapse or ensuing stampede.\n\nIn recent years, Ashoura processions have been attacked by extremist Sunni militants. In 2004, at the height of Iraq's sectarian violence, 143 people were killed in near-simultaneous suicide and other bombings at shrines in Baghdad and Karbala during the Ashoura procession.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nEarlier in the day, hundreds of thousands of black-clad pilgrims held Ashoura processions amid beefed-up security in Karbala and in the capital, Baghdad, marching through the streets. Many of the faithful beat their chests and lashed themselves with chains in a symbolic expression of grief and regret for not being able to help Hussein before his martyrdom.\n\nThe Associated Press contributed to this report.", "description": "More than 30 people were killed and nearly 100 injured in Iraq after a stampede was set off while Shiite Muslims celebrated one of the holiest days of the year.", "authors": ["Lucia Suarez Sang"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/AP19253514240519.jpg", "published_at": "2019-09-10"}