{"pub": "independent", "url": "https://independent.co.uk/voices/boris-johnson-brexit-deal-eu-irish-dup-reject-vote-commons-a9159901.html", "downloaded_at": "2019-10-17 14:33:26.139551+00:00", "title": "404 Not Found", "language": "en", "text": "Credit where it is due. He got his deal. The Shawshank Redemption-style odyssey is almost complete, or so we are led to believe. Where only a matter of a few months ago the European Commission insisted that the withdrawal agreement could not be renegotiated, it has been renegotiated.\n\nWhere the EU stated that the Irish backstop was the only way to meet the requirements of the Good Friday Belfast Agreement and the integrity of the EU single market, now it is not the only way. And, on the other side, where an economic border was once regarded by Theresa May and every Tory MP, including Boris Johnson, as “something no British prime minister could ever accept”, er this prime minister has accepted precisely that.\n\nSo we have come a long way in a few days. Those who said the EU only agrees things at the very last moment look vindicated too. A “free trade” agreement is in the offing, something too many folk will mistake for full access to the EU’s markets – though it is nothing of the sort.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nStill, this is no moment to rejoice. It is not the first time a breakthrough deal has been struck in Brussels, only to die in a ditch at Westminster. Not at all. There is many a slip ‘tween cup and lip, as someone once said. Or thank god for Ulster.\n\nThe Democratic Unionist Party, heirs to Paisleysim, have made it plain that they at least will not support an economic border between their part of the United Kingdom and the rest of it. Today, goods can move freely from Belfast to Birmingham or Brighton and back. In future, it will not be so frictionless. In the long run, the DUP sense, rightly, that the centre of political gravity will shift with the centre of economic gravity – towards Dublin.\n\nArlene Foster and her colleagues are used to resistance; it is in their DNA as the cliché goes. “Ulster Says No!” is an old slogan, and this is hardly the first time a bunch of Tory politicians in London have sold them out. The DUP, and their Spartan band of Tory allies, have the power to scupper the deal “as it stands”. As it stands, they have little choice but to do so. Without the DUP on board, and with legally unenforceable safeguards on environment and workers' rights removed in the Political Declaration, no self-respecting Labour MP will volunteer to support Johnson. They’d be swiftly deselected.\n\nSecond, this is moment of democratic outrage. A new Tory prime minister, with no electoral mandate, selected by a tiny group of activists, is about to take the UK out of the EU on harsh hard Brexit terms, whether the British people like it or not – indeed whether the House of Commons likes or not too. The hopeful sign is that, at last, the opposition parties – led now for a change by Labour – will unite and succeed in attaching a second Final Say referendum to any “deal”. There should be a substantial majority for this in the Commons, according to the past indicative votes. If he was smart and crafty enough, which he is, Johnson should reluctantly embrace the idea. If he secretly still harbours doubts about leaving the EU, it would be an elegant way out for him; something of a win-win.\n\nOf course, a new referendum would take time, and be prey to the manipulations of Dominic Cummings – but it would at least be a democratic seal of approval for what is now proposed. The chances are that it would be rejected in favour of Remain, but it might easily swing back to Leave and the Johnson deal. No matter: Either way, the British people would have their say.\n\nThere will be many attempts to paint the Johnson deal as superior to the May deal, and one that achieves all the objectives of all concerned, as if by magic. In reality, it is the kind of hard Brexit once dismissed – Britain outside the EU customs union and single market, and end to free movement of labour, added red tape, added delays, added barriers to British business and people living, working and doing business with our largest trading partner. The car industry, aerospace, agriculture, the City and much else will suffer badly.\n\nOnly the absence of tariffs and quotas on goods makes it a better deal than WTO terms, the only alternative deal still favoured by some in the Johnson circle. Yet goods represent only about 15 per cent of the British economy in any case; in services, especially financial services, there is no guarantee that the UK will enjoy anything like the unfettered access it does today: Far from it.\n\nThe Johnson deal, then, is a bad deal, done for bad motives and with bad consequences. It splits the UK into two economic zones; it deprives us of our ability to make a living; and it has no direct democratic legitimacy. It deserves to be rejected, by parliament and people.", "description": "Credit where it is due. He got his deal. The Shawshank Redemption-style odyssey is almost complete, or so we are led to believe. Where only a matter of a few months ago the European Commission insisted that the withdrawal agreement could not be renegotiated, it has been renegotiated.", "authors": ["Sean O'Grady"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/17/07/boris-johnson.jpg", "published_at": "2019-10-17"}