{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/binance-futures-bucks-dismal-volume-trend-trades-a-record-700m", "downloaded_at": "2019-10-16 07:26:59.187354+00:00", "title": "Binance Futures Bucks ‘Dismal’ Volume Trend — Trades a Record $700M", "language": "en", "text": "Binance’s Bitcoin futures product is the only winner in a lackluster market this week as trading volume hits local lows.\n\nResearch highlights “very low” activity\n\nAnalysis of various platforms’ trading volumes by exchange eToro’s senior market strategist Mati Greenspan on Oct. 15 revealed cryptocurrency markets had all but bottomed out in terms of activity.\n\nFrom a peak of around $4 billion per day several months ago, Bitcoin (BTC) now sees less than $200 million change hands, he said referencing data from research outlet Messari.\n\nOther players told a similar story, including derivatives giant BitMEX and P2P exchange Localbitcoins.\n\nFutures providers likewise have not escaped; both CME Group and newly-launched Bakkt continue to see what Greenspan describes as “very low” activity.\n\nBinance sets unlikely $700 million record\n\nThe downtrend follows fresh losses across crypto assets in recent weeks. As Cointelegraph reported, Bitcoin remains down around 20% versus levels several weeks ago.\n\nBinance Bitcoin futures trading volume. Source: Skew Markets, Twitter\n\nDespite the difficult conditions, not every business appears equally affected. As analyst Skew Markets noted on Twitter, Binance’s futures product in fact set a new daily trading volume record on Tuesday.\n\nMore than $700 million of activity occurred on its BTC/USD futures product, making it the third most traded behind Huobi and BitMEX’s offerings. By comparison, Bakkt managed 10 BTC ($81,000).\n\nSkew previously noted last Saturday was a particularly slow day for BitMEX — its volumes dipping to $1 billion versus $14 billion highs in late June.", "description": "Most crypto exchanges put in fresh trading volume lows, with the exception of Binance’s Bitcoin futures, which conversely set record highs", "authors": ["William Suberg"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvNWI3YjdiYzU4NWRlMTIyZTNkOWVmMDQ2ODRlYThlZWUuanBn.jpg", "published_at": "2019-10-16"}