{"pub": "cbs", "url": "https://cbsnews.com/news/transcript-representative-jim-himes-on-face-the-nation-october-20-2019", "downloaded_at": "2019-10-20 17:06:33.995324+00:00", "title": "Transcript: Representative Jim Himes on \"Face the Nation,\" October 20, 2019", "language": "en", "text": "The following is a transcript of an interview with Representative Jim Himes that aired Sunday, October 20, 2019, on \"Face the Nation.\"\n\nMARGARET BRENNAN: We begin this morning with a top Democrat on the House Intelligence Committee Connecticut Congressman Jim Himes who joins us from Stamford. Congressman, we just laid out what has developed over the course of the week. When will Democrats have heard enough to actually move forward with drafting articles of impeachment?\n\nREPRESENTATIVE JIM HIMES: Yeah that's- that's a great question Margaret. It's- It's a little hard to answer because of course every single day we're presented with sort of jaw dropping new information. I don't think any of us anticipated that the chief of staff would- would basically confirm that military aid was being held up in favor of a crackpot theory that somehow the DNC server made its way to Ukraine. I- it's almost embarrassing to see the words White House behind the chief of staff peddling a completely rebuked crazy theory. But- but I guess the best I can do to answer your question is- Margaret we have a little bit more work to do to understand exactly who was involved in stopping that military aid from flowing and what they knew. We have a little bit more work to do in understanding who exactly gave the order to fire Ambassador Yovanovitch, a profoundly well-respected diplomat. Presumably the secretary of state signed off on that and on what basis did he do so? And then lastly Margaret, I would say at the very center of this whole ugly episode of the use of military aid of a White House meeting in an effort to get an investigation of Joe Biden and to get Ukraine to interfere in our election is Rudy Giuliani and Rudy Giuliani has refused to appear before the committee. But he is at the very core of this question and so I, in my opinion I don't speak for the chairman--\n\nMARGARET BRENNAN: Can you proceed without him?\n\nREP. HIMES: Well I think we can again. One of the- one of the shocking things about this investigation is that all of the facts that are out there that support this notion that military aid was withheld that a White House meeting was withheld- you know, it comes from the administration. It comes from the chief of staff. It comes from the transcript. So we have a lot of what we need. But Rudy Giuliani running around, meeting with heads of state on behalf of the president's political interests is a profoundly shocking and important thing for us to understand. So while I guess we could sort of piece together exactly what happened based on what the administration has disclosed, I really think it's important to talk to Rudy Giuliani.\n\nMARGARET BRENNAN: So in terms of what's happening behind closed doors, Republicans argue that this process is overly secretive and there was a letter sent to your committee on Friday by nine Republicans who accuse Chairman Schiff of knowingly withholding committee documents from the minority. Why is that happening?\n\nREP. HIMES: Well, it- first of all, it's not happening. As a Democrat on the committee, I will tell you that we are getting witnesses canceled at the last minute. We are getting documents at 10 o'clock the night before a- a witness comes in. And so as a Democrat, I often don't see documents until well after I would like to. But Margaret, bigger picture here, what is happening- and you're going to talk to my friend and colleague Will Hurd shortly- what is happening is that there is no way for the Republicans to defend the actions of the president here. What the chief of staff Mick Mulvaney said- there's no way for them to defend that behavior. So as a result what they're doing is that they're- they're attacking the process. Now let me- let me just spend a second on that process. The previous impeachment inquiries of Nixon and of Clinton, the Congress was handed a fully done investigation in the case of Clinton by a special prosecutor Starr. In the case of Nixon, by a- by a different special prosecutor. We're doing that now and an investigation doesn't happen in the light of day, but I will tell you that there will be open hearings. Every transcript after--\n\nMARGARET BRENNAN: When?\n\nREP. HIMES: --they're scrubbed for classified information will be released publicly and this will ultimately be all out there for the American people to see and what the American people will see is that there is not one word of testimony, written or spoken, which contradicts the notion that the president used the assets of the United States- military aid, a White House meeting- to advance his political interests of getting Ukraine to meddle in the next- in the upcoming presidential election.\n\nMARGARET BRENNAN: When is that first public hearing and when will those documents be made public?\n\nREP. HIMES: Well, again, you know, when you're shocked by the chief of staff basically saying that there was a prid- quid pro quo, it's a little hard to make any predictions whatsoever about what the timing will be. My belief is Margaret- and again you know shocking things happen every single day- my belief is that the speaker of the House would like to get this wrapped up by the end of the year. I think that's probably possible. I think that having cooperation from the White House, which maintains that everything is perfect and so why not cooperate in my- in my mind- having cooperation would allow it to move much faster. But I think in any event the speaker is going to try really hard to get this wrapped up by the end of the year.\n\nMARGARET BRENNAN: As we laid out, there were some contradictions in testimonies this week. Fiona Hill testified. She confronted Ambassador Sondland when he was discussing that offer of a meeting between the two leaders in exchange for opening an investigation. This morning, Mick Mulvaney said that John Bolton who, according to the Hill, objected- never actually did raise a red flag. Sondland says no one ever objected. How do you- how do you reconcile that without calling John Bolton and the NSC lawyer to testify themselves?\n\nREP. HIMES: Yeah. Well, you know, there- there- there have been some inconsistencies and I can't get into the details of the testimony. But, you know, it will surprise nobody to know that when a witness comes before the Congress, they recount the story in the way that makes them look the best. And so there will always be some tension around the facts. But- but again, we- we- we shouldn't get lost on the details of a particular meeting. The fact is- and we know this from any number of opening statements that have been released to the public by witnesses- the fact is that pretty much everybody that was inside the White House, from the whistleblower to all of the other witnesses that have released opening statements, had profound discomfort with what Rudy Giuliani was doing and believed- and again, this is all very public- believed that military aid was being held up for the president's partisan gain.\n\nMARGARET BRENNAN: OK. Congressman Himes, thank you very much for joining us this morning and as you said we are bringing now into the conversation your friend Texas Republican Congressman Will Hurd.", "description": "The following is a transcript of an interview with Representative Jim Himes that aired Sunday, October 20, 2019, on \"Face the Nation.\"", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/20/184ccaf1-a374-4cee-9eac-7c08ea212a1f/thumbnail/1200x630/f2a50761e0b1090cf43b26c3bf120745/himes2.png", "published_at": "2019-10-20"}