{"pub": "foxbusiness", "url": "https://foxbusiness.com/media/rokus-stock-dropped-dramatically-after-downgrade-but-upgrade-after-bell-could-provide-rebound", "downloaded_at": "2019-09-21 03:40:16.853687+00:00", "title": "Roku's topsy-turvy week", "language": "en", "text": "This week streaming player Roku must have felt like it was swimming against the tide.\n\nContinue Reading Below\n\nEarly in the week, Roku's stock took a hit when media giant Comcast and social media kingpin Facebook announced threats to Roku's turf. The stock rebounded when the company announced a new product line mid-week, but Friday took a major wallop when Pivotal Research Group initiated coverage of the company -- but with a \"sell\" rating sending the stock down to a near 20 percent drop. However, good news came after the bell with some came newfound support from a major financial player.\n\n“We see dramatically more competition that will likely drive the cost of OTT devices to zero,” Pivotal analyst Jeffrey Wlodarczak wrote in a note sent to investors on Friday morning.\n\nWhile the stock for the \"over the top\" device provider is up more than 252 percent for the year, this week is indicative of just how volatile the streaming landscape is for Roku -- and other players.\n\nWlodarczak cited a variety of recent market developments, such as Comcast’s announcement of a free alternative, the Xfinity Flex streaming box, which they will give to their internet-only subscribers, that, he feels, “is likely to be copied by other distributors.”\n\nAdvertisement\n\nThis will put pressure on hardware and subscription revenues, but it does improve prospects for subscription video-on-demand services offered through them, as well as advertising and \"other\" revenues that can be generated via free, ubiquitous distribution.\n\n“Unfortunately for Roku, their already high advertising splits (50/50) with OTT players also potentially sets them up to be undercut by competitors and distributor’s already massive content spend gives them enormous leverage,\" the report contends.\n\nThis all leads Wlodarczak to question how Roku can compete with the “big boys” led by Comcast, which Pivotal rates a “buy,” and that this will make Roku’s “growth much more difficult.”\n\n\"In our view Roku stock still looks dramatically overvalued despite the recent pullback and we are initiating with a 'sell' and a $60 target price,” the report concluded.\n\nThe report did provide a bright spot for Roku, saying its “management deserves a lot of credit for what they have created and Roku is one of the few OTT investment pure-plays.”\n\nWhen asked for comment, a Roku spokeswoman told FOX Business, “We don’t comment on the views of one analyst,” and attempts to reach Wlodarczak for additional comment were unsuccessful.\n\n\"In our view Roku stock still looks dramatically overvalued despite the recent pullback and we are initiating with a 'sell' and a $60 target price” Pivotal Research Group analyst Jeffrey Wlodarczak\n\nAfter the closing bell, Oppenheimer Funds countered with an announcement that they are maintaining their “Outperform” rating and raising their price target to $155 from $120 “after evaluating the impact of Roku's international expansion plans and the slew of new OTT streaming services coming to market in 4Q and in 2020.”\n\nOppenheimer’s upside scenario analysis is $200 if “smart TV penetration continues to grow globally” and if a “consolidated market structure prevails.” The firm also estimates “that Apple+, Disney+ and a mix of others (notably HBO Max) will provide $21/share in combined upside,” and that they “see Roku ‘cashing in on their US market penetration (~33%), promoting and selling SVOD subscriptions directly, with competition from new entrants (Comcast’s and FB’s Portal) as being too late.”\n\nThis shows Oppenheimer takes the exact opposite view of the impact of Comcast’s Xfinity Flex streaming box, as well as Facebook’s offering, on Roku's prospects moving forward.\n\nTicker Security Last Change %Chg ROKU ROKU INC 108.05 -25.71 -19.22%\n\nOppenheimer also sees the United Kingdom market adding $10 a share if they can take share from legacy brands “through a similar playbook to the US: drive consumer adoption through high-quality, modestly priced TVs through OEM [original equipment manufacturer] partnerships.”\n\nWhen Wall Street opens for trading Monday morning, possibly this upgrade - which predicts Roku’s stock price will return to the levels it opened with this week - could provide a bounce.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "Two analysts see Roku's stock going in different directions", "authors": ["Jason Schott"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2017/11/0/0/roku-device.jpg?ve=1&tl=1", "published_at": "2019-09-20"}