{"pub": "yahoo", "url": "https://news.yahoo.com/fugitive-couple-overpowered-guards-captured-074728390.html", "downloaded_at": "2019-09-12 12:48:47.665548+00:00", "title": "Fugitive couple who overpowered guards captured in Arizona", "language": "en", "text": "By Rich McKay\n\n(Reuters) - A fugitive husband-and-wife team wanted for murder and arson have been captured in Arizona, police said on Thursday, nearly three weeks after they overpowered guards and escaped custody in Utah last month.\n\nThey were considered armed and dangerous.\n\nBlane Barksdale, 56, and Susan Barksdale, 59, had been on the run since Aug. 26, when they broke free from two guards who were taking them from upstate New York to Tucson, Arizona to face murder charges over the killing of an elderly man and burning of his house last April.\n\nThe couple had driven the captured guards and another inmate in the transport vehicle to Arizona, where they commandeered a GMC Sierra pick-up truck, officials said earlier.\n\nThere were few details available about how the two were taken into custody by U.S. Marshals Service agents and Navajo County Sheriff's deputies on Wednesday, police said.\n\nThe Navajo Sheriff's Office announced the arrests early Thursday on its Facebook page, and said more information would be released to the public at a press conference in Phoenix later in the morning.\n\nBlane Barksdale was recently added to the Marshals' 15 Most Wanted list, with a $25,000 reward offered for information that leads to his capture, and $10,000 for Susan Barksdale's arrest.\n\nHis wanted poster warned people not to be deceived by the appearance of the Barksdales.\n\n\"While they may look friendly, both have demonstrated a propensity for violence and should be considered armed and dangerous,\" the wanted poster said.\n\nBlane Barksdale was described as having Nazi swastika tattoos and the couple were said to be associated with white supremacy groups, and members of such groups may have been helping them hide out, officials said.\n\nRepresentatives with the Marshals office and the Navajo County Sheriff's office were not immediately available for comment to Reuters early Thursday.\n\n\n\n\n\n(Reporting by Rich McKay in Atlanta; Editing by Alex Richardson)", "description": "Blane Barksdale, 56, and Susan Barksdale, 59, had been on the run since Aug. 26, when they broke free from two guards who were taking them from upstate New York to Tucson, Arizona to face murder charges over the killing of an elderly man and burning of his house last April.  The couple had driven the", "authors": ["Rich Mckay"], "top_image": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "published_at": "2019-09-12"}