{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7624823/Bring-brutality-Englands-defensive-mastermind-says-ahead-Rugby-World-Cup-final.html", "downloaded_at": "2019-10-29 14:27:53.865363+00:00", "title": "England's defensive mastermind relishing physical battle with Springboks in Rugby World Cup final", "language": "en", "text": "England's defence guru, John Mitchell, has spoken throughout this Rugby World Cup about the team's innate 'brutality' – and he has acknowledged that they will need it on abundance on Saturday.\n\nThe New Zealander took considerable satisfaction from seeing the Red Rose players physically dominate the All Blacks during their semi-final showdown in Yokohama last weekend.\n\nBut he knows that they will need to summon up even greater levels of power and ferocity in the final, as they take on a massive Springbok side who eventually pounded Wales into submission two days ago.\n\nEngland defence coach John Mitchell is priming his team for the Rugby World Cup final\n\nSouth Africa's big-hitters are England's opponents - and Mitchell wants to match them\n\nAs he assessed the showpiece contest that lies ahead, Mitchell said: 'What we are going to witness are the two most powerful rugby teams in the world. They are strong and well-coached, and the gain-line is going to be huge.\n\n'Going back to our DNA; we feel it's really important to us. We feel there is more to bring out and we are still going to have to work hard for each other.'\n\nEngland are pretty clear about what awaits them at the same Yokohama Stadium on their day of destiny, November 2 – heavyweight rivals who are determined to harness their imposing size to devastating effect.\n\nMitchell added: 'They play in a particular way. They have four second rows who love winning the gain line. They have their own armoury. Last week, we dealt with a lot of speed and a lot of footwork. This week, they are going to be a team that is more direct.\n\n'Pressure is definitely coming to come, that asks questions of your fundamentals, so it will come down to the core basics that are really important to us. Supporting your mate on the floor and in the carry is really critical, with the pressure likely to come in the air and on the floor.\n\n'Both teams enjoy dominating the gain line and kicking, and are effective in that area. We feel we are very adaptable too – we don't just play one way, so that's one of our strengths. The Boks have very fast wingers who can finish, very capable kickers and huge guys who love carrying the ball.'\n\nThere has been a concerted, collective effort to downplay the magnitude of the 19-7 victory over the All Blacks which surely goes down as the greatest in England's history. Players and coaches alike are mindful of the fact that they have not yet earned a tangible prize and they want one – the ultimate one.\n\nEngland have been training while expecting a very different test to that posed by the All Blacks\n\nMitchell, like Eddie Jones, has downplayed England's monumental win over New Zealand\n\nMitchell echoed the sentiments of head coach Eddie Jones and his squad, saying: 'It was a good performance, certainly one that's needed when you play New Zealand. In reality, all we have done is present ourselves with another opportunity at the right end of the tournament. We want to get better and we feel we can get better as well.'\n\nIn this last week of a long tournament, following months spent in high-intensity training camps, England have had good fortune in keeping most of their players fit and available.\n\nWilli Heinz has been replaced by Saracens scrum-half Ben Spencer this week, but the other casualties appear destined to shake off minor bumps and niggles in time to face the Springboks.\n\n'Jonny May is better than last week, which is a good sign,' said Mitchell. 'Owen (Farrell) is getting through a couple of knocks. Kyle Sinckler is a little bit tight, but I can't see any of them being doubts at this point.'", "description": "CHRIS FOY IN TOKYO: England's defence guru has spoken throughout this World Cup about the team's innate 'brutality' - and he has acknowledged that they will need it on abundance on Saturday.", "authors": ["Chris Foy For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/07/20313776-0-image-a-24_1572332527774.jpg", "published_at": "2019-10-29"}