{"pub": "cnbc", "url": "https://cnbc.com/2019/10/09/syria-kurds-mobilize-as-turkey-poised-for-imminent-attack.html", "downloaded_at": "2019-10-09 10:45:52.882877+00:00", "title": "Kurds mobilize in Syria as Turkey poised for imminent attack", "language": "en", "text": "A Turkish army's tank drives towards the border with Syria near Akcakale in Sanliurfa province on October 8, 2019.\n\nThe Kurdish-led civilian administration in northeastern Syria issued a \"general mobilization\" call along the Syrian border with Turkey on Wednesday as Ankara poised for an imminent invasion of the area in the latest major escalation in the war-ravaged country.\n\nTurkey has long threatened an attack on the Kurdish fighters in Syria whom Ankara considers terrorists allied with a Kurdish insurgency within Turkey.\n\nExpectations for that assault rose after President Donald Trump on Sunday abruptly announced that American troops would step aside ahead of the Turkish push — a shift in U.S. policy that essentially abandoned the Syrian Kurds, longtime U.S. allies in the fight against the Islamic State group in Syria.\n\nBut Trump also threatened to \"totally destroy and obliterate\" Turkey's economy if the Turkish push into Syria went too far.\n\nTurkey has been massing troops for days along its border with Syria and vowed it would go ahead with the military operation and not bow to the U.S. threat over its plans against the Kurds.\n\nA senior Turkish official said Wednesday that Turkey's troops would \"shortly\" cross into Syria, together with allied Syrian rebel forces to battle the Kurdish fighters and also the Islamic State group.\n\nTrump later cast his decision to pull back U.S. troops from parts of northeast Syria as fulfilling a campaign promise to withdraw from the \"endless war\" in the Middle East. Republican critics and others said he was sacrificing a U.S. ally, the Syrian Kurds, and undermining American credibility.\n\nFahrettin Altun, the Turkish presidency's communications director, called on the international community in a Washington Post op-ed published Wednesday \"to rally\" behind Ankara, which he said would also take over the fight against the Islamic State group.\n\nTurkey aimed to \"neutralize\" Syrian Kurdish militants in northeast Syria and to \"liberate the local population from the yoke of the armed thugs,\" Altun wrote.\n\nIn its call for mobilization, the local Kurdish authority known as the Autonomous Administration of North and East Syria, also urged the international community to live up to its responsibilities as \"a humanitarian catastrophe might befall our people\" in the region.\n\n\"We call upon our people, of all ethnic groups, to move toward areas close to the border with Turkey to carry out acts of resistance during this sensitive historical time,\" it said.\n\nThe statement said the mobilization would last for three days.\n\nEarlier on Wednesday, IS militants targeted a post of the Kurdish-led Syrian Democratic Forces in the northern Syrian city of Raqqa, which was once the de facto IS capital at the height of the militants' power in the region.\n\nThe Kurdish-led SDF, which is holding thousands of IS fighters in several detention facilities in northeastern Syria, has warned that a Turkish incursion might lead to the resurgence of the extremists. The U.S. allied Kurdish-led force captured the last IS area controlled by the militants in eastern Syria in March.\n\nIn Wednesday's attack, IS launched three suicide bombings against Kurdish positions in Raqqa. There was no immediate word on casualties. Raqqa is being Silently Slaughtered, an activist collective that covers news in the northern city, reported an exchange of fire and a blast.\n\nThe Britain-based Syrian Observatory for Human Rights, a war monitoring group, said the Raqqa attack involved two IS fighters who engaged in a shootout before blowing themselves up.", "description": "Turkey has long threatened an attack on the Kurdish fighters in Syria whom Ankara considers terrorists allied with a Kurdish insurgency within Turkey.", "authors": [], "top_image": "https://image.cnbcfm.com/api/v1/image/106171934-1570611858899gettyimages-1174524788.jpeg?v=1570611910", "published_at": "2019-10-09"}