{"pub": "metro", "url": "https://metro.co.uk/2019/10/18/scientists-are-baffled-by-a-mysterious-yellow-blob-with-720-sexes-10941125", "downloaded_at": "2019-10-19 11:08:31.522983+00:00", "title": "Scientists are baffled by a mysterious yellow blob with ‘720 sexes’", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nA zoo in Paris has got scientists scratching their heads after revealing a strange organism known only as the ‘blob’.\n\nThe living organism appears to be a slimy mould, but experts say it acts like an animal.\n\nAlthough it has no mouth, stomach or eyes it can apparently digest food.\n\nKnown as Physarum polycephalum, it also moves (despite not having arms or legs) and is able to heal itself in under two minutes if it gets cut in half.\n\nAdvertisement\n\nAdvertisement\n\nThe blob has been put on display by the Paris Zoological Park, which claims that it has 720 sexes. Although, that’s probably a bit misleading. What they mean – according to Tanya Latty, a slime mold researcher at the University of Sydney – is that the blob has 720 known mating types.\n\n‘Whether or not a slime mold can mate with another slime mold depends on its mating type which is determined by particular genes,’ Letty told Cnet.\n\n« Le #blob est difficile à placer dans l’arbre du vivant. (…) Il nous apprend bien des choses sur la richesse de la vie sur Terre », explique @BrunoDavidMNHN.\n\nRendez-vous dès samedi au @zoodeparis pour entrer dans la blob-zone ! 🎉@CNRS #RDVSauvage #5AnsZoodeParis pic.twitter.com/B6lQ7gnjDQ — Zoo de Paris (@zoodeparis) October 16, 2019\n\nBruno David, director of the Paris Museum of Natural History, confirmed that the origins and structure of the blob has scientists baffled. ‘The blob is a living being which belongs to one of nature’s mysteries,’ he said.\n\n‘It surprises us because it has no brain but is able to learn, and if you merge two blobs, the one that has learned will transmit its knowledge to the other.’\n\nThe unicellular being is believed to be about a billion years old.\n\nThe blob is a unicellular being that’s a billion years old (Reuters)\n\nPetri dishes containing cultures of Physarum Polycephalum better known as the blob (AFP)\n\nThe blob was named after a 1958 science-fiction horror B-movie, starring a young Steve McQueen, in which an alien life form – The Blob – consumes everything in its path in a small Pennsylvania town.\n\nAdvertisement\n\nAdvertisement\n\n‘We know for sure it is not a plant but we don’t really if it’s an animal or a fungus,’ said David.\n\n‘It behaves very surprisingly for something that looks like a mushroom (…) it has the behaviour of an animal, it is able to learn.’", "description": "This is...weird", "authors": ["Jeff Parsons"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_90125444_1571409216.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-18"}