{"pub": "investingcom", "url": "https://in.investing.com/analysis/natural-gas-weekly-closing-above-2548-may-result-in-gapup-opening-ahead-200431888", "downloaded_at": "2019-09-07 13:48:41.735753+00:00", "title": "Natural Gas: Weekly Closing Above $2.548 May Result In Gap-up Opening Ahead", "language": "en", "text": "On analysis of the movements of futures, in different time frames, I find that , Natural Gas futures have shown good strength; which looks evident enough for a gap-up opening on the first trading session of the upcoming week. No doubt that the growing pessimism among the traders about Natural Gas, which has constantly been trading in a bearish phase since February 2019; but the Natural Gas futures have given a clear signal about the upcoming bouncing move on September 5th, 2019.\n\nI find that the futures have been constantly struggling to sustain above the level of $2.495, which indicate the thick presence of Natural Gas bulls; who look too aggressive to cross the level of $2.721 during the upcoming week. No doubt that a gap-up opening on the first trading session of the upcoming week will confirm the continuity of an uptrend ahead.\n\nWatch my video on Natural Gas futures below.\n\nFinally, I find that the futures look ready to bounce upward during the month of October 2019. No doubt that the formation of a bullish hammer on September 5th, 219, amid the volatile move, has been confirmed by the follow-up move on September 6th, 2019; will continue to keep the current uptrend intact during the upcoming weeks. For watching my upcoming videos on Natural Gas and other commodities, subscribe to my YouTube channel ‘SS Analysis’\n\nNatural Gas Futures Daily Chart\n\nNatural Gas Futures 4 Hr. Chart\n\nNatural Gas Futures 1 Hr. Chart\n\nDisclaimer\n\n1. This content is for information and educational purposes only and should not be considered as an investment advice or an investment recommendation. Past performance is not an indication of future results. All trading carries risk. Only risk capital be involved which you are prepared to lose.\n\n2. Remember, YOU push the buy button and the sell button. Investors are always reminded that before making any investment, you should do your own proper due diligence on any name directly or indirectly mentioned in this article. Investors should also consider seeking advice from an investment and/or tax professional before making any investment decisions. Any material in this article should be considered general information, and not relied on as a formal investment recommendation.\n\nNatural Gas Futures Analysis Before Advent of An Uptrend On September 5th, 2019", "description": "Commodities Analysis by Satendra Singh covering: Natural Gas Futures. Read Satendra Singh's latest article on Investing.com India.", "authors": [], "top_image": "https://in.investing.com/analysis/not found", "published_at": "2019-09-06"}