{"pub": "marketwatch", "url": "https://marketwatch.com/story/activision-blizzard-faces-corporate-culture-crisis-following-gamer-suspension-2019-10-10", "downloaded_at": "2019-10-10 18:40:11.778503+00:00", "title": "Activision Blizzard faces corporate culture crisis following gamer suspension", "language": "en", "text": "As Activision Blizzard Inc. faces a backlash from the gaming community for siding with China over the Hong Kong protests, one analyst is concerned that the internal backlash within Blizzard may be more harmful for the company as a clash of corporate cultures comes to a head.\n\nActivision Blizzard ATVI, -0.40% shares declined 0.5% to $53.18 in recent activity, and are down 4.1% for the week. In comparison, both the S&P 500 index SPX, +0.55% and the tech-heavy Nasdaq Composite Index COMP, +0.45% are down 0.5% for the week. Over the past 12 months, however, Activision Blizzard shares have dropped 28%, compared with a 5.4% gain in the S&P 500 and a 7% gain in the Nasdaq.\n\nEarlier in the week, Activision Blizzard suspended professional video game player Blitzchung for a year after supporting Hong Kong during a post-game interview. The controversy has blown up on the internet on reddit and other sites as loyal Blizzard gamers voice their dismay for the suspension, alleging the company is selling out to preserve Chinese sales.\n\nActivision Blizzard derives 5.2% of its total revenue from mainland China, nearly double from a year ago, according to estimates from FactSet. The company reported annual revenue of $7.26 billion in 2018. Blizzard, known best for its World of Warcraft games, merged with Activision back in 2008 and in 2015 the company was added to the S&P 500 index SPX, +0.55%.\n\nCowen analyst Doug Creutz, who has a market perform rating on the stock and a $48 price target, said in a recent note he estimates it’s more like 10% when it comes to the company’s revenue from China, and is most concerned that investors are counting on Blizzard to turn around the company’s fortunes and that Activision management just alienated that part of the business.\n\nMost worrisome to Creutz was that “plaques devoted to two of Blizzard’s eight core values - ‘Think Globally’ and ‘Every Voice Matters’ - were covered up in front of Blizzard’s headquarters, possibly by current employees.”\n\nNot everyone at Blizzard agrees with what happened.\n\n\n\nBoth the \"Think Globally\" and \"Every Voice Matters\" values have been covered up by incensed employees this morning. pic.twitter.com/I7nAYUes6Q — Kevin Hovdestad (@lackofrealism) October 8, 2019\n\n“In the wake of the departure of long-time CEO Mike Morhaime and the first-ever major restructuring the company has had to go through, there have been reports about concerns within Blizzard about the growing direct influence of Activision corporate in decision-making,” Creutz said.\n\nMorhaime’s advisory role at Blizzard ended in April, after announcing he was stepping down as president and CEO a year ago.\n\n“We suspect that the decision to punish Blitzchung, which almost certainly had input from senior Activision management, was met with dismay by a meaningful portion of Blizzard’s staff,” Creutz said. “Investors are counting on a turnaround at Blizzard to reinvigorate growth, but if the internal culture is in turmoil, there is a lot of risk to that thesis.”\n\nTiming for the controversy could not have been worse as the company is holding its annual Blizzcon event on Nov. 1.\n\n“After last year’s disappointing event, Blizzard has a lot of pressure to deliver a very positive experience this year,” Creutz noted. “The possibility (likelihood) of protestors disrupting events has to be of concern to the company. A heavy-handed approach to dealing with that eventuality could cause further damage to the brand.”\n\nOf the 34 analysts who cover Activision Blizzard, 26 have overweight or buy ratings, seven have hold ratings, and one has an underweight rating, and an average price target of $57.24, according to FactSet.", "description": "As Activision Blizzard Inc. faces a backlash from the gaming community for siding with China over the Hong Kong protests, one analyst is concerned that...", "authors": ["Wallace Witkowski"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GB549_activi_ZG_20180110175247.jpg", "published_at": "2019-10-10"}