{"pub": "thehill", "url": "https://thehill.com/opinion/white-house/467822-its-not-the-quid-pro-quo-with-ukraine-that-matters", "downloaded_at": "2019-10-29 23:59:25.249007+00:00", "title": "It's not the 'quid pro quo' with Ukraine that matters", "language": "en", "text": "Notwithstanding the near death of Latin as a subject of study in American schools, Americans all at once are taking great interest in three simple Latin words — quid pro quo. Language commentators have been busily tracing the history and explaining the meaning of the phrase, but whether in politics, business, diplomacy or personal affairs, it is a simple idea: I will do something for you if you will do something for me in exchange.\n\nQuid pro quos make the world go round. We could enter into the endless debate over whether any human action is truly altruistic, but even accepting that some acts are devoid of self-interest, there is no escaping that our lives are filled with quid pro quos. Consider these, for example: I pay rent and you provide me with shelter. You look after my dog when I’m on vacation and I look after your cat when you are away. Business deals are nothing but quid pro quos, although social responsibility advocates would like to change that. Marriage vows are quid pro quos — did you ever witness a wedding in which only one individual took vows?\n\nAnd so it is in foreign affairs, though it may be unclear at times just what the quid is in return for some of President Trump Donald John TrumpJudge schedules hearing for ex-Trump aide who refused to appear in inquiry READ: Army officer to tell investigators he twice reported concerns over Trump's Ukraine dealings Murkowski, Collins say they won't co-sponsor Graham's impeachment resolution MORE’s generous quos. Indeed, Democrats and Republicans alike have protested the president’s precipitous withdrawal of U.S. troops from Syria as a gift to Russia and Iran with no obvious benefits for the United States.\n\nADVERTISEMENT\n\nBut in the case of Trump’s July phone conversation with Ukrainian President Volodymyr Zelensky — in which Trump asked Zelensky, as “a favor,” to look into the actions of former vice president Joe Biden Joe BidenJudge schedules hearing for ex-Trump aide who refused to appear in inquiry Army officer twice reported concerns about Trump's Ukraine tactics Ex-Trump official's refusal to testify escalates impeachment tensions MORE and his son, Hunter, in Ukraine — Democrats say they have an open and shut case of impeachable quid pro quo.\n\nAsking a foreign leader to investigate a political rival may be cause for impeachment, but not because it involved a quid pro quo. Would Democrats be less intent on impeachment if Trump had asked for the favor without threatening to withhold military assistance? Of course not. The alleged offense is not that there was a quid pro quo, but rather that the president asked a foreign leader to dig up dirt on a man who could be Trump’s opponent in the 2020 election.\n\nIf demanding a quid pro quo is an impeachable offense, the State Department might as well shut down. Foreign relations could not be conducted without the quid pro quo.\n\nI’m sure there are Latin teachers, few as they may be, who are delighted with the public obsession with the language they work every day to nourish and keep alive. But arguing about the meaning of quid pro quo and whether or not Trump demanded a quid pro quo is a distraction from the serious business of deciding whether to impeach a president.\n\nThe question before the House of Representatives is not whether the president sought the quid of a Ukrainian investigation of Biden in return for the quo of continuing military aid. Rather, the question is whether asking the Ukrainian president to investigate Biden and his son is a high crime and misdemeanor.\n\nJames L. Huffman is a professor of law and the former dean of Lewis & Clark Law School in Portland, Ore. He was the Republican nominee in the 2010 U.S. Senate election in Oregon. Follow him on Twitter @JamesHu41086899.", "description": "If demanding a quid pro quo is an impeachable offense, the State Department might as well shut down.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpd_10022019getty.jpg", "published_at": "2019-10-29"}