{"pub": "bbc", "url": "https://bbc.com/news/world-us-canada-50172228", "downloaded_at": "2019-10-24 16:02:02.386358+00:00", "title": "California: Power cuts expected as Kincade wildfires rage", "language": "en", "text": "Image copyright AFP Image caption Fires are engulfing around 10,000 acres\n\nMore than half a million people are facing power cuts in California as wildfires rage through the state.\n\nThe Kincade fire has engulfed 10,000 acres of land and has not been contained, says the California Department of Forestry and Fire Protection.\n\nIt is being driven by strong north winds and is moving south, a California Fire spokeswoman said.\n\nThe worst of the winds are expected to arrive on Thursday afternoon.\n\nImage copyright Getty Images Image caption A home burns in Geyserville, California\n\n\"It looks like at its worst, southern California will see wind gusts of 55mph. Down in some of the coastal areas the winds could reach 75mph later today,\" Forecaster Marc Chenard told the Reuters news agency.\n\nEvacuation orders were sent out in the town of Geyserville, California, the county sheriff's office said.\n\n\"This fire is moving fast, please pay attention to evacuation orders,\" state Senator Mike McGuire tweeted.\n\nImage copyright Getty Images Image caption The worst of the blazes are expected to run into Friday\n\nMore than 308,000 customers in seven counties, including Los Angeles, San Bernardino and Ventura in southern California, are under consideration for power shutoffs, according to the Southern California Edison.\n\nPacific Gas & Electric has shut off power in 15 counties, affecting about 178,000 people.\n\nThe fires are believed to have started in a mountainous area near Kincade Road and Burned Mountain Road.\n\nEarlier this month, wildfires razed 4,700 acres north of Los Angeles, California, and forced thousands to flee.", "description": "The fires have already engulfed 10,000 acres in the state and evacuation orders have been sent out.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/1594B/production/_109359388_mediaitem109359387.jpg", "published_at": "2019-10-24"}