{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/celebrities/2019/10/30/kevin-hart-shares-emotional-video-breaking-silence-major-car-crash/2505818001", "downloaded_at": "2019-10-30 11:18:57.393507+00:00", "title": "Kevin Hart breaks silence after major car crash: 'I'm thankful for simply still being here'", "language": "en", "text": "CLOSE Comedian Kevin Hart was seriously injured after his car crashed early Sunday. USA TODAY\n\nNearly two months after suffering a major back injury in the crash of his vintage muscle car in California,Kevin Hart made a return to social media to thank fans for their support and reflect on how his point of view has altered.\n\n\"I was involved in an accident. My world was forever changed,\" read text at the beginning of a video posted to Hart's Instagram late Tuesday in his first post since the day before the accident.\n\nThe video shared news footage of the crash, which occurred in Malibu just after midnight on Sept. 1. Hart, 40, was a passenger in his 1970 Plymouth Barracuda when it drove off Mulholland Highway and rolled down an embankment, according to a California Highway Patrol collision report obtained at the time by USA TODAY.\n\nLater, the video cut to personal footage taken at the hospital, where Hart struggled to walk, even with the help of two nurses and a walker. He also shared shots from physical therapy sessions in the gym and pool while displaying a major scar on his back.\n\n\"Basically you realize that you're not in control,\" the comedian reflected in a voiceover. \"No matter how much you think you're in control, you're not in control. At the end of the day, it can all be over, man.\"\n\nDwayne Johnson to Kevin Hart after crash: 'We have a lot more laughing to do together'\n\n\"Life is funny, because some of the craziest things that happen to you end up being the things that you needed most,\" Hart continued. \"In this case, I feel like God basically told me to sit down. When you're moving too fast and doing too much, sometimes you can't see the things that you're meant to see. But after my accident, I see things differently. I see life from a whole new perspective. My appreciation for life is through the roof.\"\n\nHart thanked his family, friends, fans and \"the people that simply ride with me and have been with me.\"\n\nHe added: \"Don't take today for granted, because tomorrow's not promised. More importantly, I'm thankful for God, I'm thankful for life, I'm thankful for simply still being here. The road to being a bigger and better me. I'm looking forward to an amazing 2020.\"\n\n\"Your true fans were concerned, praying & missing you deeply,\" commented Hart's wife, Eniko. \"Thank you ALL for your kind words and allowing us to heal during this time.\"\n\nDwayne Johnson, Hart's friend and a vocal supporter after his accident, commented, \"beautifully said. Love u brotha. Onward.\"\n\n\"God bless u brother!\" added Jamie Foxx.\n\nKevin Hart's wife Eniko says he's 'going to be just fine' after car accident in California\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/celebrities/2019/10/30/kevin-hart-shares-emotional-video-breaking-silence-major-car-crash/2505818001/", "description": "Kevin Hart returned to Instagram to thank fans for their support after he suffered a major injury from a car crash on Sept. 1.", "authors": ["Hannah Yasharoff", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/11/USAT/ab5c4363-b8ec-40b4-a617-4e0b08a3aa4b-AP_Kevin_Hart_Crash.JPG?crop=2807,1579,x0,y0&width=1600&height=800&fit=bounds", "published_at": "2019-10-30"}