{"pub": "yahoo", "url": "https://sports.yahoo.com/even-terrell-owens-thinks-antonio-brown-has-gone-too-far-173238538.html", "downloaded_at": "2019-09-07 02:19:32.848833+00:00", "title": "Even Terrell Owens thinks Antonio Brown has gone too far", "language": "en", "text": "Even Terrell Owens thinks Antonio Brown has gone too far.\n\nThe Hall of Fame receiver, who wasn’t always the easiest-going guy in the locker room during his playing days, recorded a short interview with fellow receiver Brandon Marshall for The Players’ Tribune and offered Brown some advice.\n\nScroll to continue with content Ad\n\n‘Just step back’\n\nOwens said, “I really want to talk to” Brown.\n\nAsked what he’d say, Owens replied, “Just take some steps back. Whatever frustrations you have, whatever feelings you’re having, just step back. Allow your football to do the speaking for you.”\n\nMarshall, who is not currently on a roster (he worked out for the Indianapolis Colts last month), would advise Brown: “The game is short-lived. Humble yourself.”\n\n‘Find a way’\n\nOwens, of course, once held a shirtless media conference in his driveway while doing sit-ups, a moment that has lived in NFL infamy.\n\nHe believes the Oakland Raiders should stick with Brown but “find a way, behind closed doors, as men” to work things out.\n\n[Watch live NFL games all season long for free on the Yahoo Sports app.]\n\nBut when it was noted that Brown took things public - he posted a photo of a fine letter from general manager Mike Mayock on Instagram on Wednesday - Marshall said he’d consider moving on from Brown already.\n\n“You can’t win with that type of distraction. If he’s going to get better, then ok,” Marshall said. “But if he’s going to continue this behavior - which he probably will... You can’t win with that. This is the first week of the season.”\n\nMore from Yahoo Sports:", "description": "Owens would like to talk to Brown about how he's handling things.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/DQGepam_MoHBQsvUKNux0w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NDIuOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/W53V_Y6HHUagj1ohOuOMCA--~B/aD0xODU4O3c9MjUyMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/b12a6610-d0d8-11e9-bdee-c76e09c30205", "published_at": "2019-09-06"}