{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/25/chicago-teachers-strike-sidelines-athletes-future-", "downloaded_at": "2019-10-25 22:16:37.798277+00:00", "title": "Chicago teachers' strike sidelines athletes, future hopes", "language": "en", "text": "SPRINGFIELD, Ill. (AP) - A strike by school teachers in Chicago has spread from the picket line to the playing field.\n\nThousands of high school athletes, shut out of class for more than a week, are arguing, rallying and even filing lawsuits for the chance to compete in post-season play. Hanging in the balance, they say, are not just the pursuits of state-championship glory and lifelong memories, but scholarships that for some represent a lone opportunity to attend college and, in some cases, escape drugs and violence in city neighborhoods.\n\n“We’ve been working for this goal of making this stage, running in the postseason, since June,” said Ian Bacon, a senior cross-country runner at Jones College Prep and a plaintiff in a lawsuit filed Thursday against the Illinois High School Association. “This fight … it’s not just for us. It’s for all the future student-athletes that may find themselves in this situation.”\n\nAbout 25,000 members of the Chicago Teachers Union walked out Oct. 17 . They continue to negotiate with administrators for the nation’s third-largest school system, but disagreement remains over issues such as class sizes and staffing. The work stoppage also idled action on the gridiron, tennis court, soccer field and cross-country course.\n\nCTU Vice President Stacy Davis Gates, a basketball player in her Indiana school days, was sympathetic to the young competitors, saying, “This sucks.”\n\n“Student athletes spend a lot of time in preparation to make sure that they can meet the highest level of competition,” Gates said. “I am not going to say anything to them that’s going to make this feel any better because it will never feel any better.”\n\nA Chicago Public Schools spokesman did not respond to a request for comment.\n\nThe strike came at the very moment competitors were gearing up for state playoff runs. Solorio Academy missed its chance to win a second state soccer championship in three years because the tournament began last week. The lawsuit by Jones Prep and other cross-country teams argues that a different interpretation of an IHSA rule could still allow runners to answer the state-meet gun on Nov. 9. Football teams that have completed eight games and won at least five were expected to be seeded for the playoffs by the IHSA Saturday. But IHSA rules stipulate that the strike must end by Tuesday night, allowing the teams to suit up for three days of practice before going full-tilt in the first playoff round Nov. 2.\n\nSimeon Career Academy at 6-1 is ranked third in the state in Class 6A by The Associated Press, but was ineligible for the playoffs because a regular-season game fell through, leaving the team short of the eight required. The IHSA agreed on Friday to waive that rule for Simeon and two other schools, allowing them to be seeded, but rejected Simeon’s request to skirt the three-practice requirement. That means the strike would have to end by Wednesday to give eligible schools a chance to play.\n\nAlso Friday, the cross-country runners’ request for a judge to let them participate in state-qualifying races Saturday played out in a packed Cook County courtroom, but there was no immediate ruling.\n\nThe post-season, players say, is what piques college recruiters’ interest.\n\n“We don’t have the opportunity to make it out of Chicago,” said Khalyl Warren, a Simeon Career Academy senior. “We’re talking about kids who, all their lives, they’ve been through struggles and been through things that no child should have to go through, gangbanging in most of our areas, drug-selling. Sports is the only way out.”\n\nWarren, a 6-3, 290-pound offensive lineman who’s accepted a football scholarship from Southeast Missouri State, organized a rally by idled players outside Mayor Lori Lightfoot’s office Friday morning to call for an end to the strike.\n\nMissing the post-season hurts college recruits’ chances of playing on the next level, said Josh Helmholdt, Midwest analyst for Rivals, a media organization that rates prep gridders. But the greatest impact is on elite athletes who are juniors hoping to sign letters of intent to major college programs before next fall and on lower-level seniors still scrapping for scholarship offers from smaller schools.\n\nIt’s not hopeless, Helmholdt said, but playoff games do provide talent showcases.\n\n“You’re losing more valuable games as it relates to your overall resume,” Helmholdt said. “A college coach who sees something against semifinal opponent, that carries more weight than doing it against a team you blew out 48-0.”\n\nBogan High School senior quarterback James Brown, whose 3-4 team was less concerned about playoff laurels than enjoying “Senior Night” and other end-of-season festivities, said he believes his small-school scholarship hopes were hampered during an awkward telephone conversation last week in which he was embarrassed to tell a football coach that he wasn’t playing because of the strike.\n\n“This has got to end,” Brown said. “It’s too much for everyone. People are suffering and we need our education.”\n\n___\n\nFollow John O’Connor at https://twitter.com/apoconnor .\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "A strike by school teachers in Chicago has spread from the picket line to the playing field.", "authors": ["The Washington Times Http", "John O'Connor"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/23/chicago_schools_strike_city_budget_39825_c0-360-4321-2880_s1200x700.jpg?6439bfffa1847edaa916e551845788afbbdee136", "published_at": "2019-10-25"}