{"pub": "businessinsider", "url": "https://businessinsider.com/barstool-execs-strategy-sports-betting-app-barstool-bets-2019-9", "downloaded_at": "2019-09-19 23:13:44.108464+00:00", "title": "Inside Barstool Sports' strategy to become advertising's gateway to gamblers with its new sports betting app, Barstool Bets", "language": "en", "text": "Barstool Sports is jockeying to become the home for a new generation of gamblers as sports betting becomes legal in more places in the US.\n\nThe digital-media brand launched a new app, Barstool Bets, earlier this month to familiarize more sports fans with betting and draw in experienced gamblers with programming made for them.\n\nBarstool's CEO, Erika Nardini, and founder, Dave Portnoy, explained the strategy to Business Insider.\n\nBarstool doesn't aspire to run a sportsbook, as Fox does through Fox Bet. Instead, the company wants to become the gateway to the nation's sports betters to pull in new advertising dollars and other revenue streams like affiliate revenue.\n\n\"We are trying to build really this huge database throughout the country that we know, these are people who know how to gamble,\" Portnoy told Business Insider. \"When the new states turn on and make it legal, we think we'll have a powerful database of people who enjoy doing this type of behavior.\"\n\nSports betting is in Barstool's DNA\n\nFor Portnoy, the push into sports betting is a return to form.\n\nPortnoy launched Barstool in 2003 as a print newsletter for gamblers and fantasy sports players, which drew in advertising support from offshore sportsbooks and poker companies, like Party Poker. Barstool later morphed into a more general-audience sports brand, after US regulators cracked down on the online poker sites, limiting the advertising opportunities for a site focused solely on gambling.\n\nNow that the regulatory tide has changed again, thanks to a 2018 US Supreme Court ruling that opened the door for individual states to legalize gambling, Barstool sees an opportunity to make a land grab for an audience that has always been close to its DNA.\n\nBarstool is not the only media or sports brand trying to win over US gamblers. ESPN airs a sports gambling news show called \"Daily Wager\"; Turner Sports' Bleacher Report has a studio inside the sportsbook at the Caesars Palace Las Vegas Hotel & Casino; and Fox is operating a sportsbook, Fox Bet, with The Stars Group, to give a few examples.\n\n\"Dozens of media companies that are trying to get a seat on that luxury ship known as sports betting,\" Tim Hanlon, a media and marketing consultant at The Vertere Group, told Business Insider. \"The coach ticket is stuff like [what Barstool Bets is doing.] ... The other extreme is the beginnings of how to tie sports rights into the actual sports betting itself.\"\n\nSports betting could bring in as much as $7 billion in extra advertising revenue in 2019, analysts at Evercore ISI estimated last year, with about half of that going toward digital advertising, a space dominated by Google and Facebook.\n\nBarstool thinks it's in a prime position to get those dollars. About 65% of its audience already say they bet on sports, the company said, based on a survey of its audience in August.\n\nBarstool Bets, which is still being fine-tuned, has a daily sports betting game and mobile-forward content made for gamblers\n\nThe new app, Barstool Bets, launched in the US on September 5 to coincide with kickoff the 2019 NFL season.\n\nIt features a free, daily betting game in which players can win cash prizes — the cost of which is offset by advertising — inspired by the daily fantasy sports games from companies like FanDuel.\n\nThe contest is designed to get Barstool's audience more familiar with live sports betting and draw in experienced betters in places where gambling is not yet legal.\n\n\"It's very, very new in terms of being legal and so there's a need for education,\" Nardini said. \"We think that we can be that influence and that brand that experienced betters, new betters, sports betters, turn to.\"\n\nBarstool also hopes the game will keep sports fans more engaged with its app during live matchups. On the Thursday through Sunday of launch weekend, there were more than 70,000 contest entries, Barstool said.\n\nThe app also has content made for gamblers, including livestreams of Barstool personalities with actual money on the line who are reacting to games, as well as other long- and short-form video for a mobile audience, podcasts, blogs, live events, and analysis.\n\nThe execs said their content strategy would set Barstool apart from its broadcast competitors.\n\n\"The way they're approaching content is very similar to the way that they've approached typical sports commentary or traditional content,\" Nardini said. \"There is no one who is going to be hungrier, more prolific, more engaging, more authentic around sports betting than us.\"\n\nAdvertising is Barstool Bets' main revenue stream, but it will also other revenue models, like affiliate\n\nToday, the app makes most of its money from advertising. Barstool Bets has three main advertising partners, Nardini said: PointsBet, FanDuel, and MGM. Ads for companies like Hooters have also appeared in the app.\n\nDown the line, Barstool Bets will work with partners to host live events at sportsbooks and casinos and incorporate brands into its content, Nardini said. It also plans to roll out an affiliate model, to earn revenue for referring its audience to other sites, possibly sportsbooks when gambling is legalized nationally.\n\nNardini told Digiday that Barstool, which raised $15 million from The Chernin Group last year, aimed to reach $100 million in revenue by 2020.\n\nShe told Business Insider that she expected sports betting to be a growing part of the company's revenue, starting next year.\n\n\"It's one of our single biggest areas of focus,\" Nardini said. \"A lot of the revenue associated with sports betting will be determined on the state rollout and where it's legal and when. But, strategically and proportionately, this will be a big driver for us going into 2020 all the way through 2023 and beyond.\"\n\nBarstool, as a whole, has been working to diversify its revenue streams, which include advertising, merchandising, subscription, and live and pay-per-view events. Podcasts are big business, too; Variety reported that podcasting had come to make up about 35% of Barstool's revenue.\n\nBut the company's controversial culture can also be a turnoff for some sports fans and advertisers. Its personalities, including Portnoy, are known for making unfiltered, offensive comments. Portnoy recently threatened in a tweet to fire employees if they talked about unionization. Barstool, which Portnoy said had a core demographic of 21- to 40-year-old men, has also been accused of creating a culture of cyberbullying and online sexual harassment, as The Daily Beast has detailed.\n\n\"We are spontaneous and authentic in a way that millions of fans find relatable and real, which is not understood or appreciated by everyone,\" Nardini said, in a statement to Business Insider.\n\nBarstool Sports' website has averaged more than 5 million unique visitors a month, on desktop and mobile, this year, according to ComScore. That makes it larger than FanDuel and on par with Fox Sports but smaller than Yahoo Sports and Bleacher Report.\n\nBarstool said its internal tracking by Google Analytics was greater, with 13 million uniques in August. The execs said Barstool, overall, had about 49 million followers across platforms, like Twitter, YouTube, and Instagram, where people can chat or otherwise engage with its personalities around sports betting.\n\n\"We also know that we can make sports-betting cultural, which is really what you're seeing us do,\" Nardini said.", "description": "Barstool Sports' founder, Dave Portnoy, and CEO, Erika Nardini, explain how the company is building an audience of sports betters with Barstool Bets.", "authors": ["Ashley Rodriguez"], "top_image": "https://amp.businessinsider.com/images/5d82995c2e22af047f27dcb2-1920-960.jpg", "published_at": "2019-09-19"}