{"pub": "washingtonpost", "url": "https://washingtonpost.com/entertainment/museums/in-the-galleries-from-artist-timothy-johnson-a-heady-exhibition/2019/10/17/435f1d2a-ee8c-11e9-b648-76bcf86eb67e_story.html", "downloaded_at": "2019-10-19 11:13:59.421114+00:00", "title": "In the galleries: From artist Timothy Johnson, a heady exhibition at Touchstone Gallery", "language": "en", "text": "In addition to such frisky anachronisms, Johnson winks at the viewer by featuring the visages of local artists, notably himself. His balding, gray-bearded head plays the part of Holofernes’s severed one in a tableau based on the biblical tale of Judith — the only one of these mostly unbloodied scenes with a gory body.\n\nAD\n\nAD\n\nJohnson wears a red clown nose in a painted selfie, part of a series of pictures of heads on stakes, each mounted atop an actual wooden post. This rogue’s gallery suggests that a lineup of heads impaled on poles looks a lot like a string of likenesses hung in a portrait museum.\n\nAlso at Touchstone, Claudia Samper precisely places birds in 3-D space. “Urban Nest” consists of realistic drawings of feathered creatures, some in black-and-white and others painted colorfully, layered amid both naturalistic and geometric settings. The Argentina-born Virginian uses sheets of clear Mylar to position the various elements on different levels. Trained as an architect, Samper constructs miniature environments for animals — human as well as avian — to navigate.\n\nRobin Bell\n\nD.C. video and projection artist Robin Bell is known for hauling his equipment outside to paint fleeting graffiti on local edifices. With “Refractions,” he invites viewers inside. The show at Lost Origins Gallery is a partial replica of his studio, which is a short walk away.\n\nAD\n\nAD\n\nThe artist has filled the space with video monitors, mostly turned vertical, as well as obsolete mini-TVs and relief sculptures of old TV sets. The active screens present a variety of visual information, including documentation of the political slogans Bell has projected on the Trump hotel, the Supreme Court building and other imposing D.C. structures. (One segment shows the confiscation of Bell’s equipment by the U.S. Capitol Police in March.) Other images are projected onto the walls and atop the video screens, while an interactive setup incorporates live feed of gallerygoers into the jittery montage. “The idea is that people are inside the piece,” Bell said recently.\n\nAn assemblage that Bell brought from his studio, inspired by Dante’s “Inferno” and Rome’s mythic history, combines plastic skulls, a wolf’s head and video of Bell’s bygone dog. It shows that the artist can construct historical narratives as well as deliver topical communiques.\n\nThe most striking attraction is secluded in an alcove. Using a process he declines to reveal, the artist has managed to project ephemeral images in front of a whirring fan so that they appear to dance in midair. Bell has many things to say. But visitors to “Refractions” could spend all their time marveling at how he says them.\n\nAD\n\nAD\n\nRefractions: Prints and Projections by Robin Bell Through Oct. 27 at Lost Origins Gallery, 3110 Mount Pleasant St. NW.\n\nSpurlock, Tarrat and Jakes\n\nIn 2005, artist Langley Spurlock and poet John Martin Tarrat began to illustrate every known chemical element. “Secrets of the Elements 5” finishes the task — although the subtitle of their Studio Gallery show, “At Infinity’s Edge,” acknowledges the possibility of more discoveries beyond Oganesson, which now tops the periodic table at atomic number 118.\n\nUsually, Spurlock provides a computer-generated illustration that’s paired with a few lines by Tarrat. But the duo like variety, so Titanium is represented by a rolling, tattooed suitcase. (The element is used in tattoo inks.) Curium, employed in Mars rovers, yields a tinkertoy explorer. Nihonium gets a manga-style treatment, and Krypton’s name is written by a lighted tube. (Inside is argon, much cheaper than Krypton.)\n\nAD\n\nAD\n\nSome of the histories invoked by the pictures and text are complex, but others are easily read: Tennessine is hailed in the form of a whiskey bottle, and Sodium, the most basic substance celebrated here, inspires 11 poems. That’s one for each of its atoms.\n\nDownstairs at Studio, Carolee Jakes’s “Invoking Melpomene” is a show of subtle, shimmering woodcuts. Melpomene is the muse of theater, but the most significant inspiration for these prints appears to be the ocean. The nine-part “Water” is a fugue of white lines that eddy through various shades of blue. Like the sea itself, the suite is simultaneously dynamic and calming.\n\nLangley Spurlock & John Martin Tarrat: Secrets of the Elements 5: At Infinity’s Edge and Carolee Jakes: Invoking Melpomene Through Oct. 26 at Studio Gallery, 2108 R St. NW.\n\nAD\n\nAD\n\nLee and Dunklin\n\nSome artists make work that quietly encourages contemplation. Korean-born Virginia glass artist Jubee Lee is more demanding. A single cushion faces “After the Big Wind Stops, I See Gentle Waves,” her installation in a lowlight gallery at IA&A at Hillyer. “Sit,” the mat seems to command.\n\nAssuming a meditative position, the viewer gazes at 136 translucent panels, engraved with black-and-white horizontal gestures and assembled to resemble a partitioned Asian screen painted with a landscape. Gently illuminated from behind, the stylized vista suggests dark sea and light sky at daybreak. Adding significantly to the ambiance is a small pool of rippling water at the piece’s center. In such a setting, gazing at the sea is easy to imagine. Gazing into one’s self may be harder.\n\nAD\n\nIn an adjacent room, also darkened, multiple cushions await below a screen on which Oregon artist Clay Dunklin is bathed in yellow light as he smears his face with goo. “Song of the Wind” is a video self-portrait that distorts his face with kaleidoscopic effects. Both the actual anointing and the virtual fragmenting of his face represent the fluidity of existence. The boundary between body and world is firm and yet slippery.\n\nJubee Lee: After the Big Wind Stops, I See Gentle Waves and Clay Dunklin: Song of the Wind Through Oct. 27 at IA&A at Hillyer, 9 Hillyer Ct. NW.\n\nAD", "description": "“Fables of Decapitation” is at Touchstone Gallery", "authors": ["Mark Jenkins"], "top_image": "https://www.washingtonpost.com/resizer/DykcVqe8nBprYTQYBAPPJ39q9Uw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7MZKYHHQ5MI6TNSIO26PQ3VWPY.jpg", "published_at": "2019-10-17"}