{"pub": "businessinsider", "url": "https://businesstimes.com.sg/banking-finance/hsbc-q3-pre-tax-profit-falls-18-flags-challenging-revenue-outlook ", "downloaded_at": "2019-10-28 07:36:57.040400+00:00", "title": "HSBC Q3 pre-tax profit falls 18%, flags challenging revenue outlook", "language": "en", "text": "HSBC Holdings Plc on Monday posted an 18 per cent drop in quarterly pre-tax profit, missing analyst forecasts, and said it would no longer be able to meet its 2020 return-on-equity target due to a challenging revenue growth outlook.\n\n[HONG KONG/LONDON] HSBC Holdings Plc on Monday posted an 18 per cent drop in quarterly pre-tax profit, missing analyst forecasts, and said it would no longer be able to meet its 2020 return-on-equity target due to a challenging revenue growth outlook.\n\nHSBC has been looking to step up cost-cutting efforts amid a gloomier business outlook brought about by an escalating trade war between China and the United States, an easing monetary policy cycle, unrest in its key Hong Kong market, and Brexit.\n\nPre-tax profit at Europe's biggest bank by assets was US$4.8 billion for the third quarter ended Sept 30, versus US$5.9 billion a year earlier, HSBC said in a statement to the Hong Kong stock exchange.\n\nThe profit was lower than the US$5.3 billion average of analysts' estimates compiled by the bank.\n\nsentifi.com Market voices on:\n\n\"The revenue environment is more challenging than in the first half of 2019, and the outlook for revenue growth is softer than we anticipated at the half-year,\" the bank said, adding it did not expect to meet its return on tangible equity target of 11 per cent in 2020.\n\nStay updated with\n\nBT newsletters Terms & conditions Sign up\n\nThe London-headquartered lender, which generates the bulk of its revenue and profit in Asia, said it would rebalance capital away from low-return businesses and adjust its cost base.\n\n\"These actions, or any continuing deterioration in the revenue environment, could result in significant charges in 4Q19 and subsequent periods, including the possible impairment of goodwill and additional restructuring charges.\"\n\nThe results are HSBC's first under interim chief executive Noel Quinn, and is widely seen by shareholders and insiders as a report card on his auditioning for the role full time.\n\nMr Quinn, 57, has made no secret that he is keen to secure the permanent appointment from chairman Mark Tucker, who said in August the search for a CEO would take six to 12 months.\n\nA veteran of the bank since 1987, Mr Quinn faces the tough task of showing progress on HSBC's key priorities of further cost reduction and turning around its perennially underperforming US business.\n\nREUTERS", "description": ": THE BUSINESS TIMES Banking & Finance - [HONG KONG/LONDON] HSBC Holdings Plc on Monday posted an 18 per cent drop in quarterly pre-tax profit, missing analyst forecasts, and said it would no longer be able to meet its 2020 return-on-equity target due to a challenging revenue growth outlook. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/28/rk_HSBC_281019.jpg?itok=tFwlLDu7", "published_at": "2019-10-28"}