{"pub": "bbc", "url": "https://bbc.com/news/entertainment-arts-49808839", "downloaded_at": "2019-09-25 04:40:34.937596+00:00", "title": "Brittany Howard finds freedom after Alabama Shakes", "language": "en", "text": "Image copyright Brantley Gutierrez Image caption Brittany Howard: \"If I was going to make a solo record, I knew it had to be something true.\"\n\nIn the middle of making her new album, Brittany Howard decided to record the air conditioner.\n\nHolding a microphone to ceiling, she captured the unit's electromagnetic pulse, turned it into a tape loop, then transposed it onto a keyboard.\n\n\"In the end, I think we were overly ambitious,\" she reflects. \"Because it turned out to be terrible.\"\n\nThe experiment may have been scrapped, but it illustrates the sense of freedom Howard felt as she made her first solo album.\n\n\"I actually made some music the way I hear it,\" she says. \"No-one tells me they don't like it, no-one says they don't like this bass part, or this arrangement's too crazy. It was just up to me to make my own mistakes.\"\n\nImage caption The singer was raised on a junk-yard in rural Alabama, and was a postal worker before Alabama Shakes hit the big time\n\nHoward was last seen as the frontwoman of Alabama Shakes, the roots-rock revivalists who won an armful of Grammys for their debut album, Boys & Girls, and its 2015 follow-up, Sound & Colour.\n\nBut by the time they finished their most recent tour, in 2017, the singer-songwriter felt drained and exhausted. Facing 30, she was also considering what another decade in the band might look like.\n\nA lightbulb flickered into life during a long drive through the plains of Oklahoma with her wife, musician Jesse Lafser.\n\n\"I thought, 'What do I want for the rest of my career?' And I said, 'Well, it'd be cool if I did something on my own'.\n\n\"I just felt unwilling to give things away any more.\"\n\nOnce she decided to go it alone, the band were the first people she called.\n\n\"We sat in a circle and we just talked about it. It was bittersweet, for sure, because we've grown up together, we've changed our lives together - but I think everyone walked away from the room knowing that it wasn't necessarily so much an ending as it was like, 'OK, here's a new beginning'.\"\n\n'Banging my head'\n\nHoward set about writing her debut solo album in Topanga, California, in the middle of a heatwave - playing all the instruments herself in a \"sweaty greenhouse\" no bigger than a double bed.\n\n\"Topanga is a really beautiful mountain area with flowers and bees and birds - but I was just absolutely miserable when I first got there, banging my head against the wall going, 'I can't think of any new songs. I can't think of anything, I can't do anything.'\n\n\"But once I stopped trying, the songs came, and they came really complete. I could just hear all the parts.\"\n\nFreed from the constraints of working with a band, she indulged her wildest musical ideas - mixing decades worth of P-Funk, psychedelic blues, hard rock, Southern soul and gospel with free-wheeling imagination.\n\nIn lesser hands it would be a mess, but Howard has a firm grip on song structure, never allowing musical complexity to get in the way of a melody; while her vocals, always the highlight of Alabama Shakes' albums, are typically soulful and nuanced.\n\nThe emotional territory she covers is just as broad and uncompromising.\n\nGeorgia is an undulating R&B ballad about falling in love with an older woman; while He Loves Me discusses her relationship with God (\"I don't go to church any more/I know He still loves me\") over a lurching Benny & The Jets rhythm.\n\n'There's a racial line'\n\nHer most striking lyrics come on Goat Head, as she discusses growing up as the child of a poor, interracial couple in rural Alabama.\n\n\"When I was born - or rather when my sister was born in 1984 - that was like the first wave of mixed babies, little brown babies,\" she says.\n\n\"My mama would go around town, pushing my sister and I in a cart to the grocery store, and people would actually come up to her and lecture her. They would say, 'Do you know what you've done?'\"\n\nIn the song, she recalls an incident that happened when she was a baby, but was told about later, where \"someone cut off a goat's head, and they put it in the back of my dad's car and slashed his tyres, and smeared blood all over his car\".\n\n\"It's always been a part of me, that story,\" says Howard. \"Because Athens was a beautiful, peaceful country place, where people are neighbours and we really care about each other. But there's a racial line, or there was at least, and that's why I wanted to write that song. Just to explain where I was coming from.\"\n\nShe recalls happier childhood experiences on Stay High - an ode to her father, and the joyous nights of games and music he'd instigate when he got home from the \"grind and hustle\" of his day job.\n\n\"My family didn't have a lot of money, so music was a free activity,\" she says. \"We could dance or we could sing with it, or we could play on buckets with it.\"\n\nHer older sister Jaime was her role model, playmate and idol, she recalls. More importantly, she inspired her to play piano.\n\n\"She learned by ear and she'd try to play Beethoven pieces and things like that. And I would just sit in this blue chair in my grandmother's living room, and I would turn round and round and round and listen to her play, and I'd go, 'Do it again, do it again'. We could sit with that piano for hours and make it so entertaining.\"\n\nBut Howard's world was torn apart when Jaime died of retinoblastoma, a rare of form of eye cancer, when she was just 13.\n\n\"My whole family was devastated,\" she says. \"We had prayed and she didn't make it. It was like, 'How could God do this to a child? How could he do this to our family?'\"\n\nThey stopped going to church. Howard's parents divorced. And, because the family house had burned down during Jaime's illness, the singer lost almost every trace of her sister.\n\nAlthough her new album isn't about Jaime, it carries her name, \"so it would no longer bring me sadness,\" Howard says.\n\n\"She was my first teacher. She was the one who taught me to love music, and who taught me to be imaginative and creative. She left me with all those things I hold near and dear to me, so it only felt appropriate to put her name on there - because I feel like I didn't do it alone.\"\n\nImage copyright Brantley Gutierrez Image caption \"I got bills like everybody else,\" says the star\n\nJust as Jaime was crucial to her musical education, Howard had help in the studio as she fleshed out her album - with jazz drummer Nate Smith, keyboardist Robert Glasper and Alabama Shakes bassist Zac Cockrell turning her demos into a full-band affair.\n\n\"I'd tell them, 'I want you to stick to the song, but I want you to do it your way. Do what moves you'. And because they're so emotive, it made the whole process very simple and wonderful.\"\n\nThe adventurous approach didn't stop with the air conditioner - Smith plays the drums with chopsticks on Stay High - and Howard rails against the modern trend for auto-tuned technical perfection.\n\n\"You know, you don't need the best gear, the most expensive stuff, to make something wonderful. In fact, it's a lot more fun, being creative with things that are kind of worthless junk,\" she says.\n\nThe record, which was released last Friday, has already received glowing reviews. Rolling Stone magazine called it \"strikingly bold\" while Allmusic's Stephen Erlewine said repeated listens would prove \"profound and nourishing\".\n\nFor Howard, who finished the album last year, it's just a relief to finally get it out there.\n\n\"I've been like a chicken with a giant egg,\" she laughs. \"I've been sitting on this forever.\"\n\nFollow us on Facebook, or on Twitter @BBCNewsEnts. If you have a story suggestion email entertainment.news@bbc.co.uk.", "description": "The singer on why she left her band and how her late sister Jaime inspired her first solo record.", "authors": ["Mark Savage", "Bbc Music Reporter"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/10B47/production/_108932486_002efd0e-07bb-42bb-90e0-7c4c3347ee3e.jpg", "published_at": "2019-09-25"}