{"pub": "cryptonews", "url": "https://cryptonews.com/videos/bitcoin-rap-battle-debate-hamilton-vs-satoshi-369.htm", "downloaded_at": "2019-10-05 13:16:08.664024+00:00", "title": "Bitcoin Rap Battle Debate: Hamilton vs. Satoshi", "language": "en", "text": "Alexander Hamilton, an American statesman and one of the Founding Fathers of the United States, and Satoshi Nakamoto, the Bitcoin creator, engage in a battle rap debate on the merits of centralized and decentralized currencies.(This is a new project of Reid Hoffman, Co-founder of LinkedIn.) Read More\n\nBitcoin giveaway rules: http://bit.ly/coinrul\n\n___\n\nLyrics:\n\nHAMILTON\n\nBefore we begin, everyone do me a favor\n\nAnd read a little thing I wrote called the Federalist Papers\n\nI explain how a nation’s unlikely to survive\n\nWithout a strong central government to keep it alive\n\nWhen I launched the central bank, Jefferson called me ill\n\nNow you have my face to thank on every ten dollar-bill\n\nWhen America was cash-strapped, I pushed past that\n\nNow some sicko makes crypto and our nation backtracks?\n\nSATOSHI\n\nDecentralized currency. Yes, I invented it\n\nI’m sure many governments wish they had prevented it\n\nTheir national cash is how they keep control\n\nBut freedom to the people was my ultimate goal\n\nAm I a pseudonym? A group of men? It doesn’t even matter\n\nI invented Bitcoin cause fiat is a disaster\n\nA man from Japan or a damn hologram?\n\nI’m the reason open season on crypto began\n\nHAMILTON\n\nDoes anybody know what this crypto-thing means?\n\nTo me, sounds like the new Get Broke Quick scheme\n\nA bunch of fools from across the land\n\nInvesting in something they don’t even understand\n\nBuying Litecoin, Dash, Bitcoin Cash\n\nIt’s all gonna crash, and be gone in a flash\n\nAll this unsupported money’s an irrational prank\n\nAnd I’ll be laughing all the way to my National Bank\n\nSATOSHI\n\nHahahahahah, yeah dude, super funny\n\nAs if banks these days still helped people make money\n\nThe rich get richer and we follow like we’re all sheep\n\nThe banks serve Wall Street, crypto serves all streets\n\nThe interest in crypto’s on rapid ascent\n\nWhat’s your current interest? Half a percent?\n\nI’m sorry, the bank’s gone past its peak\n\nBut I want info encrypted, not hacked and leaked\n\nHAMILTON\n\nIf this crypto system will be our salvation\n\nIt needs to be centralized, needs regulation\n\nIf our central database gets… how you say, “hacked?”\n\nInsurance will just make a case to get your money back\n\n‘Cause in fact, it’s tracked, and the money leaves a trail\n\nCentral currency is strong, cryptocurrency is frail\n\nUntraceable money — wow, so clever\n\nOne typo in your address? Now it’s gone forever\n\nSATOSHI\n\nCrypto is frail? That’s the essence of your lesson?\n\nYour money leaves a trail? Yeah, a trail to a recession\n\nA buncha rich white guys made this system\n\nWhy would they ever change this, when It’s made them rich men!\n\nMovie moguls fought hard against the VCR\n\nHorse and buggy manufacturers all hated the car\n\nSo why would I take my advice from the banks?\n\nI don’t need a bailout to survive. Thanks\n\nSATOSHI BACKUP SINGER:\n\nThe system is so broken\n\nWe need that crypto token\n\nHAMILTON BACKUP SINGER:\n\nThe system isn’t broken\n\nCan we trust crypto tokens?\n\nHAMILTON:\n\n(It’s gotta be)\n\nCentralized!\n\nSATOSHI:\n\nDecentralized!\n\nHAMILTON:\n\nCentralized!\n\nSATOSHI:\n\nDecentralized!\n\nHAMILTON:\n\nWe need control!\n\nSATOSHI:\n\nFree enterprise!\n\nHOST / DEBATE MODERATOR:\n\nBring me the facts\n\nPlease testify...\n\nSATOSHI\n\nFiat's the way a government controls the populace\n\nHAMILTON\n\nGovernment protects its people. All of this is obvious\n\nThey keep the peace, and so they KEEP control\n\nYou want us ruled by crypto-miners no one even knows\n\nSATOSHI\n\nOh, it’s that \"Strong Central Government\" bit again\n\nThey protect people, but only their citizens\n\nCrypto has no borders, it's a true global currency\n\nAnd censorship resistance for those who need it urgently\n\nHAMILTON\n\nBanks earn trust by assuming liability\n\nYou know a key, we know the customer explicitly\n\nWill the real Satoshi please stand up?\n\nNope, you’ll still be hiding when crypto busts\n\nSATOSHI\n\nYou don’t need to trust the people, you just need to trust the code\n\nEvery record’s in the network, you’re just one node\n\nAnd when you find a flaw, there’s a software update\n\nNow try updating cash… go ahead, I’ll wait\n\nHAMILTON\n\nWait? Cash works! You immediately pay\n\nCrypto's a far worse medium of exchange\n\nCan’t bitcoin the dentist, can’t bitcoin my breakfast\n\nCan’t even use bitcoin at bitcoin conventions\n\nSATOSHI\n\nNo currency starts with universal adoption\n\nIt takes time for places to make it an option\n\nPlus billions of people don’t have bank accounts\n\nNo savings, no interest, no checks to bounce\n\nHAMILTON\n\nYou’re saving the world? But what’s the price you’re paying?\n\nThe only change you’re creating is climate change\n\nPower grids spiking all across the land\n\nOverheated, no one needs it, hope it all is banned\n\nSATOSHI\n\nFrom the king of paper currency, the hypocrisy!\n\nFor bills and forms in triplicates, you’re killing all the trees\n\nDon’t like my power usage? Stop targeting my rights\n\nI own my purchased power and the market sets the price\n\nHAMILTON\n\nIt’s gonna get real dark if this is crypto’s night\n\nThey use your currency for crimes, that’s your kryptonite\n\nSATOSHI\n\nMost crime is done with Benjamins, not the blockchain\n\nThere’s a reason most dollars carry traces of cocaine\n\nHAMILTON\n\nWhere’s your proof of work? That’s pure speculation\n\nThose darknet black markets need more regulation\n\nSATOSHI\n\nThe world’s fulla currencies. And this one makes it worse?\n\n1 hundred eighty now, Bitcoin’s a hundred-eighty-first\n\nHAMILTON\n\nIt’s not the currency itself, it’s the method, man\n\nYou can’t build things that last without a central plan\n\nSATOSHI\n\nCrypto is a balance to the centralized model\n\nCause things fall apart. The center cannot hodl\n\nHAMILTON\n\nIf you end up having problems, I’ll feel bad for you, son\n\nSATOSHI\n\nI’ve got 99 problems but a Bit ain’t one", "description": "", "authors": [], "top_image": "https://cimg.co/w/videos/0/5d7/1360c4de94.jpg", "published_at": "2019-10-04"}