{"pub": "yahoo", "url": "https://finance.yahoo.com/news/gbp-usd-price-forecast-british-162140786.html", "downloaded_at": "2019-10-30 09:14:48.456143+00:00", "title": "GBP/USD Price Forecast – British Pound Showing Signs Of Life", "language": "en", "text": "The British pound has pulled back against the US dollar during early trading on Tuesday but has also found enough support at the 1.28 level to turn things around and show signs of life. By doing so it should send this market back towards the 1.30 level. That is a large, round, psychologically significant number that will continue to push the market around. As Brexit continues to steal headlines, this will have a major influence on this pair. The 200 day EMA sits just below which of course is supportive, and therefore I believe that traders are going to continue to look at these pullbacks as short-term buying opportunities based upon value.\n\nGBP/USD Video 30.10.19\n\nIf the market were to break down below the 200 day EMA I think that there is a lot of clustering around the psychologically important 1.25 level, which is obviously a large, round, psychologically significant figure. To the upside, a break above the 1.30 level opens up the possibility of a move to the 1.33 handle, something that would be rather impressive. That being said, the market is probably going to be moving more or less on headlines yet again, but it seems as if traders are trying to price and the idea of a “no deal Brexit” being very unlikely. As long as that’s the case, the British pound is probably undervalued from the longer-term standpoint. The market has certainly changed its overall trend, so having said that it’s likely that DIPs will continue to be supported underneath.\n\nPlease let us know what you think in the comments below\n\nThis article was originally posted on FX Empire\n\nMore From FXEMPIRE:", "description": "The British pound has pulled back a bit during the trading session on Tuesday, showing signs of support at the 1.28 level. The market bouncing from there is a good sign, as we continue to see reasons for value hunting.", "authors": ["Christopher Lewis"], "top_image": "https://s.yimg.com/uu/api/res/1.2/MHZcRNE9G3mTnXh7Ei.vbQ--~B/aD00MTA7dz02MTU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/fx_empire_176/2352e9bae57506c1f7815b2d80050ac4", "published_at": "2019-10-29"}