{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201910175465/us-manufacturing-production-declined-in-september", "downloaded_at": "2019-10-17 14:25:04.717070+00:00", "title": "U.S. Manufacturing Production Declined in September", "language": "en", "text": "By Sarah Chaney and Amara Omeokwe\n\nU.S. manufacturing production fell in September for the second time in three months, suggesting trade frictions and slowing global growth are denting a key segment of the U.S. economy.\n\nManufacturing output, the biggest component of industrial production, fell 0.5% in September from a month earlier, the Federal Reserve said Thursday. Production at factories was dragged down by a strike at General Motors, the Fed said. Excluding autos, manufacturing output was still down 0.2% last month, suggesting broader based weakness in goods production.\n\nOverall industrial production, which includes output at factories, mines and utilities, dropped 0.4% in September, due to both faltering manufacturing and mining activity.\n\nThe U.S. is a service-oriented economy, meaning manufacturing accounts for a small share of gross domestic product. Still, the sector is highly sensitive to swings in global demand, making it an important indicator of broader economic shifts.\n\nUnderlying domestic demand in the U.S. economy has flashed signs of slowdown recently, with both consumers and employers showing hesitance. Retail sales declined 0.3% in September from a month earlier, and job openings declined 4% in August from a year earlier.\n\nA loss of momentum in U.S. manufacturing aligns with weakening factory output overseas.\n\nThe manufacturing output index in Germany, a key export economy in the Eurozone, fell to 101.5 in August from 105.8 a year earlier, Organization for Economic Cooperation and Development figures show.\n\nSurveys of purchasing managers across the globe pointed to deepening declines in factory activity in September. The U.S. was not immune. The Institute for Supply Management's survey of supply-chain managers showed manufacturing activity contracted for the second straight month to the lowest level since 2009.\n\nFaltering manufacturing activity across the global economy is squeezing broader economic growth. Global growth is expected to fall to 3% this year, according to new estimates from the International Monetary Fund, down from an estimate of 3.2% in July and a 3.8% pace as recently as 2017. The IMF attributed the sharp slowdown over the past two years primarily to rising trade barriers that have stunted manufacturing and investment around the world.\n\nWrite to Sarah Chaney at sarah.chaney@wsj.com and Amara Omeokwe at amara.omeokwe@wsj.com\n\n(END) Dow Jones Newswires\n\nOctober 17, 2019 09:30 ET (13:30 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-17"}