{"pub": "washingtonpost", "url": "https://washingtonpost.com/national/2019/09/23/abortion-restrictions-are-costing-states-millions-dollars-fees-other-side", "downloaded_at": "2019-09-23 17:25:19.882083+00:00", "title": "Abortion restrictions are costing states millions of dollars — in fees for the other side", "language": "en", "text": "In the past four years, taxpayers in states trying to restrict abortion access have paid almost $10 million in attorney fees for abortion providers. That price tag is likely to keep growing as more abortion restrictions are challenged, including three in federal courts today.\n\nIn an effort to overturn Roe v. Wade, these states are passing laws that severely limit or prohibit abortion, hoping that the courts will uphold them. But when, instead, those new laws are thrown out, the state has to pay the legal expenses for the abortion advocates. That puts taxpayers in the position of having to pay for the attorneys on both sides of abortion battles that often last for years.\n\nThis is the result of a special provision that allows the courts to order reimbursement to people who successfully challenge laws that violate civil rights.\n\nThe latest — and by far largest — recent reimbursement was ordered by a federal judge in Texas last month, awarding $2.3 million to the lawyers who successfully blocked a state law to limit abortions.\n\nIn the last four years, states have paid at least $9.8 million in abortion providers’ attorneys fees When abortion limits are overturned, the courts can order states to pay the lawyers for the other side. The figures below don’t include fees for the state’s legal team. Year State Amount 2019 Texas $2,297,860 2019 Alaska $98,625 2019 Ohio $382,530 2019 Mississippi $755,274 2017 Arizona $550,000 2017 Missouri $156,000 2016 North Carolina $1,043,316 2016 Alaska $995,000 2016 Alabama $1,700,000 2016 Wisconsin $1,600,000 2016 North Dakota $245,000 Source: Center for Reproductive Rights, media reports DAN KEATING/THE WASHINGTON POST In the last four years, states have paid at least $9.8 million in abortion providers’ fees When abortion limits are overturned, the courts can order states to pay the lawyers for the other side. The figures below don’t include fees for the state’s legal team. State Amount Year Texas $2,297,860 2019 Alaska $98,625 2019 Ohio $382,530 2019 Mississippi $755,274 2019 Arizona $550,000 2017 Missouri $156,000 2017 North Carolina $1,043,316 2016 Alaska $995,000 2016 Alabama $1,700,000 2016 Wisconsin $1,600,000 2016 North Dakota $245,000 2016 Source: Center for Reproductive Rights, media reports DAN KEATING/THE WASHINGTON POST In the last four years, states have paid at least $9.8 million in abortion providers’ attorneys fees When abortion limits are overturned, the courts can order states to pay the lawyers for the other side. The figures below don’t include fees for the state’s legal team. State Amount Year Lead Organization Texas $2,297,860 2019 Center for Reproductive Rights Alaska $98,625 2019 Plannned Parenthood Ohio $382,530 2019 Plannned Parenthood Mississippi $755,274 2019 Center for Reproductive Rights Arizona $550,000 2017 Center for Reproductive Rights Missouri $156,000 2017 Planned Parenthood North Carolina $1,043,316 2016 Planned Parenthood and ACLU Alaska $995,000 2016 Center for Reproductive Rights Alabama $1,700,000 2016 ACLU Wisconsin $1,600,000 2016 Planned Parenthood North Dakota $245,000 2016 Center for Reproductive Rights Source: Center for Reproductive Rights, media reports DAN KEATING/THE WASHINGTON POST\n\nThe judge in the Texas case, which was brought by the abortion provider Whole Woman’s Health, said too much of the financial burden of the abortion fight is falling on taxpayers.\n\n“Whole Woman’s Health likely didn’t need the number of lawyers involved in the case,” Judge Lee Yeakel wrote. “Yet this court finds that the State’s tactics compelled an increase in manpower by Whole Woman’s Health. Both parties are culpable in driving the cost of this litigation to an extreme height, with the people of the State of Texas left to pay all of the expense of both sides.”\n\nWomen in poverty bear the greatest burden of poverty restrictions\n\nThe clinic challenged a 2013 law that required doctors to have admitting privileges in a local hospital and required abortion clinics to be equipped as outpatient surgical centers. The Supreme Court ruled in the clinic’s favor in 2016.\n\n\n\nAbortion rights advocates celebrate outside the Supreme Court in June 2016 after the court's ruling in Whole Woman's Health v. Hellerstedt. (Michael Reynolds/EPA)\n\nThe lawyers for Whole Women’s Health sought $4.5 million for 6,044 hours of work for the case, with hourly billing rates ranging from $265 to $995, for an average of $740.\n\nThe state claimed that the rates were too high, the bills were vague and the hours were excessive.\n\nAfter reviewing the objections, Yeakel approved 5,745 hours of work and said a fair average price to pay for a lawyer in Austin was $400 an hour.\n\nWith Neil M. Gorsuch and Brett M. Kavanaugh’s appointments to the Supreme Court, states have rushed to pass additional restrictions that, if upheld, would overturn the 1973 Supreme Court ruling that created a constitutional right to abortion nationwide.\n\nA trial starts today over a two-day waiting period for abortions in Tennessee, and a federal court in Atlanta will hear arguments over a new Georgia law that would forbid abortion after six weeks. In San Francisco, a federal court will hear arguments from Planned Parenthood over the Trump administration’s rules on what doctors must tell pregnant women.\n\n\n\nPeople wait Aug. 12 in Nashville for the start of a Tennessee state Senate hearing on a \"fetal heartbeat\" abortion ban. (Mark Humphrey/AP)\n\nHow often does the Supreme Court overturn precedents on civil rights?\n\nStates are trying to limit the financial burden with novel strategies. Several recent abortion laws included a “trigger” provision that the law would not go into effect until a similar law had been upheld in another state or the Supreme Court had overturned Roe. If the new restrictions don’t go into effect, the state doesn’t have to defend them in court.\n\nCritics of the laws have said that the costs of the states’ own lawyers, plus their outside legal counsel, and the attorneys fees awarded to the other side could all be used instead to promote the health of children and pregnant women.\n\nThey pointed to a 2017 study by the Center for Reproductive Rights and Ibis Reproductive Health that indicates that states that pass more abortion restrictions have worse health outcomes for women and children.\n\nNew laws are widening the gap in access to abortion\n\nAlthough the Center for Reproductive Rights was part of the legal team that received the $2.3 million reimbursement award in Texas, senior staff attorney Jenny Ma said the money should be going elsewhere.\n\n“The saddest part is that these states are spending hard-earned taxpayer money defending lawsuits,” Ma said, “when they could be using those funds to support their citizens.”", "description": "In the last four years, taxpayers in states trying to restrict abortion access have paid almost $10 million in attorney fees for abortion providers. That price tag is likely to keep growing as more abortion restrictions are challenged, including three in federal courts today.", "authors": ["Dan Keating", "Reporter On Data Graphics", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/pmdT19WwlURWH5zqpmuBmPt8Uvk=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2GES7WB4QII6NAF42BTRD7JBEU.jpg", "published_at": "2019-09-23"}