{"pub": "dailymail", "url": "https://dailymail.co.uk/home/books/article-7585075/Thousands-entered-meet-winner-Ive-won-thanks-Granny.html", "downloaded_at": "2019-10-18 01:22:50.989081+00:00", "title": "Thousands of you entered, now meet our winner: I've won - and it's all thanks to Granny!", "language": "en", "text": "We are delighted to announce that we have chosen the winner of our Daily Mail First Novel Competition — and entrants will be relieved to hear that, unlike the Booker prize, the judges’ decision was unanimous.\n\nThousands of you submitted a synopsis and first chapter for consideration, and we were hugely impressed by the breadth of talent and imagination.\n\nOur winner is Louise Morrish, 45, a secondary school librarian from Alton in Hampshire. She says she owes her success to her late grandmother, Betty, who not only taught Louise to read, but also inspired the main character in her novel.\n\n‘I didn’t have the best time when I was at school,’ says Louise. ‘Academically I did well, but socially it was difficult for me, so books were a form of escape.\n\nLouise Morrish, 45, (pictured) from Hampshire, revealed the inspiration behind her novel that won her the Daily Mail First Novel Competition\n\n‘I’m very lucky because at the school where I now work, reading time is built into the curriculum. Our library is designed to be a relaxing space to give you a break from social media. You can sink into a beanbag with a book and forget screens.’\n\nLouise wins a £20,000 advance, a publishing contract with Penguin Random House and the services of leading literary agent Luigi Bonomi.\n\nHer novel, The Coffin Club, is a wonderfully complex story about wartime memories, ghosts, old age, ambition, secrets and murder.\n\nIt follows the story of Betty Shepherd, 110, and her carer, Tally, as the secrets of Betty’s past catch up with her and the other members of the Coffin Club, a group where everyone is over 100 years old.\n\nLouise says: ‘The inspiration came partly from my mum, who told me about a club in New Zealand where people got together to talk about death and make plans for their funerals — including designing their own coffins.\n\n‘But my grandmother also played a part in this book. She lived through two world wars — I was doing some research into the period she talked about and discovered lots of incredible stories about the Special Operations Executive, a secret organisation that operated in World War II.\n\n‘I started to think my centenarian could have a secret past in the SOE that she had never told anyone about. That’s why I named my main character Betty Shepherd, after my grandmother. ’\n\nMother-of-three Louise (pictured) who has been writing for 20 years, revealed she hopes to use her £20,000 prize to help her eldest son at medical school\n\nLouise is married to Darren, an English teacher and songwriter, and they have three children: Andrew, 19, and 16-year-old twins Ellen and William.\n\nLouise squeezes her writing in to what little time she has left between work and her sports routine, which includes endurance running, kickboxing and touch rugby.\n\n‘I’ve been writing for 20 years, but more seriously for the past ten,’ she says. ‘I signed up for an online writers’ course with the Faber Academy and that was a big step.\n\n‘The group all made comments and suggestions. It makes you feel quite vulnerable, but it is incredible how supportive everyone was and how helpful I found it. I am so thrilled to have won this competition, but I have no illusions about how hard it is to make a proper living out of writing. I know I’ll keep working part-time at my job, which I absolutely love.’\n\nAnd as for that £20,000 prize? Louise’s eldest son, Andrew, is in his second year of medical school in London, which is very expensive, so she’s hoping to help him out.\n\nAnd the family has always longed to see the Northern Lights.\n\n‘It’s been on my bucket list, so now perhaps we could all go.’\n\nWINNER THE COFFIN CLUB by Louise Morrish A sallow moon shines like a jaundiced eye through the bedroom window. Watching her. Sleep will be elusive tonight, Betty knows. Always the way when it’s a full moon. She really ought to close the curtains, but it would make no difference. The moon will still be there, whether she can see it or not; a monthly reminder. As if she could ever forget. From the bedroom next door, she can hear Tally’s rumbling snores. Her carer would have slept through the Blitz, Betty has no doubt. Lucky girl. Sighing, she hoists herself up in the bed, reaches for her glasses on the night stand. Yesterday’s paper lies folded next to them, half read. She’ll try the cryptic, see if that’ll send her off. The moon’s light is enough to see by, if she squints. She rummages in the pockets of her bedjacket. But instead of the pencil she expects to find, she unearths a balled Kleenex, a rusty hat-pin, and a key whose lock she cannot recall. She wipes at her eyes with the crusty tissue, peers at the key, turning it over in her wrinkled palm. It is an odd shape, with too many protrusions. How had it come to be in her pocket? She turns the key over and over, her brain grinding with the effort of remembering. An image flickers in the recesses of her memory and she thinks she has it, but no. She tries again, groping in the dark, her mind tripping and stumbling over memories long forgotten, terrified of the empty spaces she can sense, but not see. The dog emits a soft growl. ‘What is it boy?’ Betty pushes herself further up the pillows, and as she does so a vaguely familiar, smoke-hoarse voice comes clear to her across the years. ‘A skeleton key’ll open almost anyfing.’ A movement snags her eyes; there, in the far corner of the bedroom, almost invisible in the shadows, stands a figure. As the person slowly approaches, Betty’s fingers instinctively tighten around the key. She knuckles her glasses further up her nose, trying to bring the man into focus. He is almost at the bed when recognition pierces the blackness of her memory like a lighthouse beam; it is a man she knows only as ‘Mr Smith the lock-picker’. Betty’s heart stutters. Is she hallucinating? She hasn’t seen her security instructor ‘Mr Smith’ since 1943. Yet here he is, looking exactly the same as he did back then, face narrow as a ferret’s, greasy haired, wearing the same threadbare brown suit. There is a sudden waft of Woodbines, a smell that takes Betty straight back to Wanborough Manor, Special Training School No 5.\n\nLiterary agent Luigi Bonomi, says she fell in love with Louise's (pictured) character Betty, the moment that she first read about her\n\nAND OUR FIVE RUNNERS-UP Congratulations to our five highly commended runners-up… SIGHTLINE by Marie Challoner from Cambridgeshire A ten-year-old girl obsessed with insects and body farms discovers the corpse of a missing teenage boy and decides to follow the police investigation in this dark thriller. SOONER OR LATER by Laura Dunlop from Glengormley, Northern Ireland Cassie, who works for a bridal magazine, has the perfect fiance and the perfect life — but a visit to a fortune teller sows seeds of doubt, and the fairytale starts to unravel. THE DEVIL’S PRIZE by Kathryn Koon from Hertford A time-shift novel switching between the reign of Queen Anne and World War II, with the eras linked by a missing diamond that appears in an aristocratic portrait. THE QUEEN WHO NEVER WAS by Priscilla Todd from Walsall An historical novel based on the real life of Arbella Stuart, the niece of Mary Queen of Scots, who became the centre of a plot to succeed the childless Queen Elizabeth I. THE MOVE by Unity Wroe from Brighton When Olivia and her husband Mark move from London to glitzy New York, he begins an affair while she struggles with IVF treatment — but she will have her revenge.\n\nWHAT THE JUDGES SAID\n\nSelina Walker\n\nPublisher, Century and Arrow\n\nThe Coffin Club really stood out. I loved 110-year-old Betty, who is sympathetic, believable and funny. The book is original, warm and just a little sad. I can’t wait to read the full novel.\n\nLuigi Bonomi\n\nLiterary agent\n\nI fell in love with Betty the moment I first read about her. People who played an important role in her life come back to her in hallucinations, and secrets that she has long kept hidden might soon be unravelled.\n\nPeter James\n\nBestselling author\n\nThis is a highly original and very compelling story. Profound, funny and sad, it unflinchingly addresses a challenging issue of our modern, changing world.\n\nI loved it.\n\nFern Britton\n\nTV presenter and author\n\nI am delighted that The Coffin Club has won. Louise Morrish delves into the taboo of death in a truly original, heartfelt and human way.\n\nSandra Parsons\n\nDaily Mail Literary Editor\n\nI was immediately pulled in by Betty, who is old but not past it. The sudden appearance of her former security instructor is as entertaining as it is unexpected, and there are delicious undercurrents of secrecy and menace.", "description": "Louise Morrish, 45, from Hampshire, has been selected as the winner of the Daily Mail First Novel Competition. She explained why she owes her success to her late grandmother, Betty.", "authors": ["Daily Mail Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/19/19851222-0-image-a-5_1571335231215.jpg", "published_at": "2019-10-17"}