{"pub": "yahoo", "url": "https://finance.yahoo.com/news/time-cash-chips-nvidia-stock-140144668.html", "downloaded_at": "2019-09-11 07:33:38.872602+00:00", "title": "Time to Cash in Your Chips on Nvidia Stock", "language": "en", "text": "Shares of Nvidia (NASDAQ:NVDA) have been ripping higher lately. NVDA stock is up nearly 10% over the past four trading days alone, outpacing even the torrid gains for the semiconductor stocks in that same time frame. While certainly some of the rally was warranted given a decent earnings beat, Nvidia stock has now come too far, too fast. Look for a pullback in NVDA over the coming weeks.\n\nShould You Buy Nvidia Stock Ahead of Today's Earnings? Not So Fast! More\n\nSource: michelmond / Shutterstock.com\n\nNvidia reported earnings on Aug. 15 with earnings per share of $1.24 beating estimates for $1.15. Revenues, however, were less impressive, coming in roughly in line at $2.58 billion. The revenue numbers actually represented a 17.3% year-over-year decline. Yet NVDA stock still moved up big following the report, adding on over 20%. An 8% earnings beat with flat revenue means that most of the move was obviously due to a big multiple expansion.\n\nInvestorPlace contributor Chris Lau noted yesterday that the average analyst price target was $189.96 — implying less than 5% upside from current levels. That doesn’t look too rewarding to me.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nNvidia stock is certainly getting more expensive from a fundamental view. The trailing price-to-earnings ratio now sits above 40 and at a premium to the five-year average of 34. It has risen sharply even factoring in that most recent earnings beat. Price-to-sales is just over 10, far exceeding the five-year average of just 7.5 and nearing the highest levels ever. Other valuation metrics, such as price-to-book and dividend yield, are similarly rich. NVDA is most assuredly not a cheap stock at current levels.\n\nNvidia Stock Charts\n\nNVDA stock is getting overbought on a technical basis. The five-day relative strength index just breached the 75 level which has marked short-term tops in the past. The moving average convergence/divergence is also fast approaching readings that signaled the rally may be getting overdone. Bollinger Percent B broke above 1 before weakening, yet another sign of too much exuberance. Nvidia stock is trading at a large premium to the 20-day moving average. This has usually been a prelude to a pullback.\n\nMore importantly, NVDA failed to break past major resistance at $184 yesterday. Nvidia stock traded up to a high of $183.98 only to subsequently reverse course and close well off the highs. This type of intra-day reversal pattern is often indicative of a significant top. The buyers have finally become exhausted and the sellers are in control. It is especially powerful near major resistance and following a strong rally like just evidenced in NVDA stock.\n\nThe Bottom Line on NVDA Stock\n\nI previously had a bullish outlook on NVDA with shares trading at the $155 area. Now that Nvidia has rallied sharply, my viewpoint has changed as well — because price does matter. The current P/E ratio expanded by 33% since late May, moving from 30 to 40. The oversold technicals back then have now flipped to overbought. It’s time to take a more bearish stance on NVDA stock.\n\nInvestors should use any further strength in the Nvidia stock price to take a short position. The initial downside price target would be the 20-day moving average at the $165 area. A significant break above resistance at $184 would be a logical stop out level.", "description": "Shares of Nvidia (NASDAQ:NVDA) have been ripping higher lately. NVDA stock is up nearly 10% over the past four trading days alone, outpacing even the torrid gains for the semiconductor stocks in that same time frame. While certainly some of the rally was warranted given a decent earnings beat, Nvidia", "authors": ["Tim Biggam"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.3fnqJkiGF7eQ8wXUdyeTw--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/22951c8da6b6cf144945769a2a8b2655", "published_at": "2019-09-10"}