{"pub": "washingtonpost", "url": "https://washingtonpost.com/weather/2019/09/22/autumnal-equinox-is-monday-first-day-fall-heres-whats-out-balance", "downloaded_at": "2019-09-22 16:33:45.901917+00:00", "title": "The autumnal equinox is Monday. On the first day of fall, here’s what’s in and out of balance.", "language": "en", "text": "\n\nSunrise behind the Washington Monument, Sept. 18. (Kevin Ambrose)\n\nThere are only two days each year, one in March and one in September, when daylight and darkness are in near-perfect harmony no matter where you are on Earth.\n\nOne of them is on our doorstep: The autumnal equinox arrives in the early morning hours of Sept. 23 (at 3:50 a.m. Eastern), marking our traditional passage from summer to fall here in the Northern Hemisphere and winter to spring if you live south of the equator.\n\nThe autumnal equinox is the halfway point between our longest and shortest days of the year — a time when Earth and the sun seem to stand in geometrical balance. It’s the exact moment when the sun appears straight over Earth’s equator (zero degrees latitude) and our entire planet receives roughly equal amounts of daylight and darkness.\n\nA not so equal day\n\nEvery six months when we have an equinox, we focus a lot on the word “equal” — after all, the word “equinox” comes from Latin and means “equal night.” But when we delve into the science a bit more, we’ll see that Mother Nature isn’t exactly in perfect balance.\n\nFor one thing, the sun will be up for slightly more than 12 hours on Sept. 23. This is true no matter where you are on Earth.\n\nIn Washington, sunrise is at 6:56 a.m. and sunset at 7:03 p.m., giving us 12 hours and 7 minutes of daylight. The sun in Chicago will be up for 12 hours and 8 minutes, and in Anchorage, the days are still 12 hours and 16 minutes long. Even down in Sydney, sunrise and sunset are 12 hours and 7 minutes apart.\n\nThis not-so-equal daylight happens for two reasons: One is that Earth’s atmosphere refracts, or bends, light, which causes the sun to appear higher in the sky than it is. The other is how we define the length of the day.\n\n“Sunrise is defined by the appearance of the top of the sun above the horizon, while sunset is the disappearance of the top of the sun below the horizon,” David Policansky explained on Capital Weather Gang earlier this year. Because the sun looks like a large, lumbering disk (not a tiny point in the sky), we add a few minutes to the length of the day just by nature of the way we define the words sunrise and sunset.\n\nSo what exactly is “equal” about the equinox?\n\nWell, the exact location of sunrise and sunset is one. Only on the spring and autumn equinoxes can we say that everyone on Earth sees the sun rise due east and set due west along the horizon (though to be fair, this doesn’t hold true near the North and South poles, where the sun is either rising or setting for the first time in six months).\n\nAnother unifying trait about the equinoxes is that they coincide with our fastest daylight changes of the year. In the middle latitudes of the Northern Hemisphere, we see the greatest loss in daylight around the autumnal equinox in September and the greatest gains in daylight around the spring equinox in March.\n\nBut even the change in daylight is not so equal, either. If you live closer to the equator, the change in daylight is much less dramatic than it is at higher latitudes. Around the autumnal equinox Washington loses 2 minutes and 30 seconds of daylight per day, while Miami loses only 90 seconds. Meanwhile, Seattle sees daylight vanish by nearly 3½ minutes each day, and in Fairbanks, Alaska, the difference is more than 6½ minutes.\n\nSo even though we all see just over 12 hours of daylight on the equinox, this is really the only thing that faraway geographic locations have in common. The sun’s rays are still far stronger and more intense near the equator than they are near the poles, despite daylight hours being nearly equal. For example, the midday sun in Honolulu reaches 68.5 degrees above the horizon on Sept. 23, while in Fairbanks, the sun angle climbs only to 25.0 degrees — that’s already a tad lower than the midday sun on the winter solstice in Washington.\n\nEquinox vs. equilux?\n\nWith all this discussion of equal daylight and darkness, it’s worth pointing out that we do experience a day when sunrise and sunset are exactly 12 hours apart. But it won’t be until a few days after the equinox. We sometimes hear this day referred to as the equilux, or day of “equal light.”\n\nIn Washington, the equilux is on Sept. 26, when sunrise and sunset are at 6:59 a.m. and 6:59 p.m., respectively. For the next 172 days after that (until March 17), the sun will be visible for under 12 hours each day. We continue to lose daylight for three more months — that is, until the winter solstice on Dec. 21, when our daylight hours bottom out at 9 hours and 26 minutes.\n\nEven though the autumnal equinox is upon us, fall may take its time arriving this year. The National Oceanic and Atmospheric Administration is forecasting a warmer-than-normal fall across the entire United States.\n\nForecasts aside, as our average temperatures steadily drop with each passing week, it won’t be long before summer surrenders to fall. This year’s equinox may not feel very autumnal, but it’s a harbinger of the dark season and cooler weather we can expect in the months ahead.", "description": "Fall officially begins at 3:50 a.m. Eastern on Monday.", "authors": ["Justin Grieser", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/ODRKvABwsgURFytp2jKchTFnZgE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/R2AIQTTIX5CDXG6DSLJVGSAAIY.jpg", "published_at": "2019-09-22"}