{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/oct/27/greta-thunberg-old-enough-scare-world-are-teens-really-too-young-to-vote", "downloaded_at": "2019-10-27 12:06:34.595221+00:00", "title": "Greta Thunberg is old enough to scare the world. Are teens like her really too young to vote? | Catherine Bennett", "language": "en", "text": "Despite being effectively exiled by a Conservative government, Shamima Begum, who joined Isis aged 15 – and whose withdrawn citizenship is currently the subject of appeal – now finds herself a Tory asset. As well as being inhumane, Sajid Javid’s continued resistance to her return appears, considering her proved cautionary value, singularly ungrateful.\n\nWho else, recently, has done as much as Begum, former teenage delinquent, to supply his party with an argument whose effectiveness, so long as it is not examined for more than a couple of seconds, could contribute to the outcome of the next election? Ken Clarke has already threatened amendments to the withdrawal agreement bill that would reduce the voting age, perhaps fatally for Johnson, to 16. If future electoral success depends, for the presiding sociopaths, on keeping young adults away from decisions afflicting their futures, the party needs to put together, if only for appearances’ sake, something resembling a reason why. Much of what could once be claimed – 16-year-olds are too flighty, apathetic, biddable etc – looks threadbare now that Scottish teenagers, enfranchised in 2014, have proved they could be competent and enthusiastic voters.\n\nCourtesy of its own idiocy, David Cameron’s Fixed-term Parliaments Act, the party must also justify a system that – at least in theory – commits to the outcome of a non-Scottish not-quite-18-year-old being electorally marginalised until the age of 23.\n\nAt some point, the most bitter opponents of universal suffrage had to abandon claims that female hysteria and uneducated weak-mindedness would undermine democracy. But the objections to 16-year-olds voting were not, before Scotland, dissimilar. With theirs the only party now opposed to a lowered voting age, Conservative supporters must now come up with objections more compelling than, for instance, how can a mere 16-year-old hope to comprehend the nuanced complexities of “Get Brexit Done”?\n\nEnter, in her refugee camp, the widow Shamima Begum. No sooner had appeals for clemency focused on her young age when she was radicalised in east London – against the official line that she bore full responsibility – than her name was invoked by those hostile to extending the franchise.\n\nFacebook Twitter Pinterest ‘Shamima Begum, who joined Isis aged 15 – and whose withdrawn citizenship is currently the subject of appeal – now finds herself a Tory asset.’ Photograph: ITV News\n\n“Ironically,” noted a Spiked contributor, “she was slightly below the age that many of the chattering-class leftists who use her youthfulness as a defence want to lower the voting age to.” A correspondent to the Guardian asked, in response to a compassionate editorial about Begum’s vulnerability, how it squared with support for votes at 16. “You cannot have it both ways.”\n\nIf so, the opposite surely applies. If Begum was, as the home secretary’s decision suggests, as culpable at 15 as a grownup would have been, this must enhance the claim to adult voting rights, against Tory objections, of her entire cohort. Jeremy Hunt said, promisingly for this extension of democracy, “she knew the choices she was making”. Claims of her adult-level agency will also have implications for the sort of Sajid Javid supporters who, simultaneously, dismiss Greta Thunberg as a groomed child. Again in Spiked, we discover that, unlike calculating Begum, Thunberg, at 16, is “a patsy for scared and elitist adults”.\n\nAdult voters can only rejoice that the legitimacy of their voting rights is not directly related, as is evidently the case for younger citizens, with the activities of especially controversial peers. No one, surely, after seeing a Spiked editor incite riots on the television, would conclude that the dangerous folly of extending voting rights to angry white men aged between 40 and 70 is thereby established.\n\n'There might be a case for protecting young people from the discovery that a once-respected office is occupied by a lying moral degenerate.'\n\nAdmittedly, the random bad person = no suffrage argument is barely more desperate than the conventional Tory line, deployed in April when the voting age was last discussed in the Commons, that its reduction would offend against age-privilege consistency. Even though that does not exist. “Someone is either old enough or they are not,” Chloe Smith said, for the last government. Yes, how can it be that we prohibit frontline combat for the youngest soldiers, ditto, at various ages, access to alcohol, fireworks, gambling and cigarettes, while proposing that young people be allowed the unhealthy, perilous and all-too-often-regretted high that is going to the polling station? Don’t the current array of age privileges, Tory speakers asked, amount to an argument for the status quo? Well, not to anyone who can tell the difference between a ballot box and a tattoo parlour, obviously. There is no one, all-licensing, age of majority.\n\nThanks, not least, to this same party – since it allowed 15-year-olds to vote in its recent leadership contest – we can be certain that cognitively, 16-year-olds are as qualified as their parents to assess how much damage Boris Johnson will inflict on their futures. Though from a health perspective there might be a case for protecting young people, for as long as possible, from the discovery that a once-respected office is occupied by a lying moral degenerate, and the associated risks of accelerated cynicism or, worse, copycat behaviour.\n\nOnce a final traditional objection – of near vox-pop level naivety – is acknowledged, in the wake of the Scottish reform, to be the occasional outcome of, rather than the justification for, youth disenfranchisement, perhaps it’s no wonder traditionalists are reduced to turning, or attempting to turn, the arguments of children’s rights champions on their heads. It is as if child protection were incompatible with a child’s right to be consulted. But they go together. Since 1990, a UN convention has enshrined young people’s right to participate in decisions about their lives “and make their views known”.\n\nIt’s possible, of course, that Welsh, English, and Northern Irish teenagers really are as dismally clueless in comparison with their Scottish peers, as the current arrangements, and their supporters, suggest. To rephrase the government spokesperson: “Someone is either Scottish or they are not.” Even in these divided times, it looks a little discriminatory.\n\n• Catherine Bennett is an Observer columnist", "description": "Young people can be sanctified or demonised. But they’re not seen as fit to help shape the future", "authors": ["Catherine Bennett"], "top_image": "https://i.guim.co.uk/img/media/571b8e9c9098b5caeead27aeeb9d1f19c28f3711/0_74_2200_1320/master/2200.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tb3BpbmlvbnMucG5n&enable=upscale&s=9a6cc3baff18a4f9bac4559dce5ca2ed", "published_at": "2019-10-27"}