{"pub": "heritage", "url": "https://heritage.org/education/commentary/house-democrats-new-bill-would-drive-college-costs-even-further", "downloaded_at": "2019-10-17 10:31:29.834938+00:00", "title": "House Democrats’ New Bill Would Drive Up College Costs Even Further", "language": "en", "text": "House Democrats on Tuesday introduced a bill that combines some of the worst higher education policies into one bundle.\n\nThe bill, titled the College Affordability Act, would overhaul the Higher Education Act of 1965. While that law certainly needs significant revision, this proposal would replicate, and in some cases double down on, the unwise policies that led to our current $1.6 trillion student debt crisis.\n\nAmericans simply cannot afford the College Affordability Act.\n\nDe Facto Loan Forgiveness\n\nWhile this bill doesn’t outright cancel student debt, students would see significantly more of their loan balances forgiven under the proposed restructuring of payment plans.\n\nThe College Affordability Act would cap monthly payments and enable students to enroll in an income-based repayment plan. Students who make regular payments would then have the remainder of their loan balances forgiven after 20 years.\n\nWhile some students are already enrolled in this type of plan today, tying even more payments to income and capping monthly payments would cause the bill left to taxpayers at the 20-year mark to skyrocket.\n\nParent borrowers would also qualify for income-based repayment under this proposal. The parent PLUS loan program is one of the most egregious drivers of tuition inflation, as parents tend to take out large loan balances.\n\nIt is simply bad policy to potentially leave taxpayers on the hook for parents who took out student loans on behalf of their adult children.\n\nDe Facto ‘Free’ College\n\nWhile “free college” is technically absent from this bill, make no mistake—that is the goal.\n\nTitle IV of the College Affordability Act includes a federal-state partnership called America’s College Promise. This entails a grant program to states to help eliminate the cost of community college while maintaining funding for four-year public institutions.\n\n>>>Why College Costs Are Out of Control\n\nAccording to the committee’s bill summary, “This program creates the foundation and makes a down payment toward future investments in four-year debt-free college for students across the country.”\n\nThis federal-state partnership would come with a $500 million fund to ensure the implementation of best practices in the states, as well as ensure equity in higher education.\n\n“Free” college, whether for community college students or bachelor’s degree students, will drive up college costs. The only difference is that taxpayers will get the bill—and if history is any indicator, that bill will increase every year.\n\nMassive Increase in Who Qualifies for Aid\n\nThe bill’s proposed changes to the Pell Grant program mean additional spending and more taxpayer exposure.\n\nThe College Affordability Act would permanently index Pell Grant funding to inflation, which would increase the maximum Pell award significantly.\n\nAdditionally, the bill proposes increasing the number of eligible semesters to 14, making it possible for graduate students to use Pell Grants for tuition.\n\nGenerally speaking, graduate students have a much easier time paying off their loans than bachelor’s degree holders. The federal government should have no role in providing free money to students who would fare well in the loan market.\n\nThe College Affordability Act also proposes lifting the ban on allowing incarcerated individuals to qualify for Pell Grants. Allowing prisoners to go to college on the backs of American taxpayers would result in increased spending while millions of Americans (who do not qualify for grants) struggle to pay off their loans.\n\nReturn of Obama-Era Regulations\n\nThe College Affordability Act would reinstate the Obama-era war on for-profit colleges.\n\nOperating under the assumption that the only bad schools in America are for-profit schools, the College Affordability Act would reestablish the “gainful employment” rule, which singled out proprietary institutions and threatens their eligibility for funding under Title IV of the Higher Education Act.\n\nThe bill also calls for a new enforcement unit within the Department of Education, which would undoubtedly be dedicated to limiting the ability of for-profit institutions to operate.\n\nThere is no doubt that some for-profit institutions are not high quality enough to make Americans comfortable sending their tax dollars to subsidize them. However, bad institutions exist across the higher education sector, including four-year nonprofit institutions.\n\nIf higher education regulations are to exist, they should certainly be sector-neutral in their application.\n\nWrong Direction for America\n\nThis bill comes with a price tag estimated at $400 billion. Yet it opens the door for a massive increase in the federal government’s power to regulate and fund higher education in America.\n\nThis will likely result in costs that far surpass the $400 billion of taxpayer money initially being spent.\n\nThe College Affordability Act includes absolutely no provision to drive down college costs or insulate taxpayers from students’ inability to pay off their loans. In fact, through increased access to income-based repayment, taxpayers are even more exposed.\n\nAmericans deserve a Higher Education Act reauthorization that protects their interests and addresses the root causes of the student debt crisis. The College Affordability Act does neither.", "description": "House Democrats on Tuesday introduced a bill that combines some of the worst higher education policies into one bundle.\n\nThe bill, titled the College Affordability Act, would overhaul the Higher Education Act of 1965. While that law certainly needs significant revision, this proposal would replicate, and in some cases double down on, the unwise policies that led to our current $1.6 trillion student debt crisis. \n\nAmericans simply cannot afford the College Affordability Act.", "authors": ["Mary Clare Amselem", "Policy Analyst", "Mary Clare Is A Policy Analyst At The Heritage Foundation."], "top_image": "https://www.heritage.org/sites/default/files/styles/facebook_optimized/public/images/2019-10/GettyImages-1176112232.jpg?itok=tyw0JaLU", "published_at": "2019-10-17"}