{"pub": "fox", "url": "https://foxbusiness.com/economy/trump-says-china-wants-to-talk-as-the-trade-was-drags-on", "downloaded_at": "2019-09-10 02:20:03.633586+00:00", "title": "President Trump says 'China wants to talk' after suffering its worst year in 57 years", "language": "en", "text": "article\n\nShortly after the U.S. and China agreed on their next round of trade negotiations, President Trump suggested officials from Beijing are eager to continue discussions.\n\nContinue Reading Below\n\nDuring a rally in North Carolina on Monday night, Trump hinted the ongoing trade war was taking a toll on the Chinese economy – impacting everything from supply chains to relocation decisions and job cuts.\n\n“I want China to do well and I hope they do well, but they’ve had now the worst year in 57 years – I wonder why,” Trump said. “Unless we’re going to make a good deal or a fair deal for our country, let’s face it, we cannot go back to a situation where [the U.S.] giving hundreds of billions of dollars to China becomes standard fare. Not going to happen.”\n\nAt the outset of September, a new round of tariffs went into effect on goods from both countries. The U.S. implemented tariffs worth 15 percent on a host of goods from China, a decision that was met with countermeasures.\n\nChina subsequently filed a complaint with the World Trade Organization (WTO), asking the organization to facilitate “consultations” with the U.S. to reduce or end tariffs.\n\nAdvertisement\n\nOn Monday, the president said tariffs are “a beautiful thing” when implemented properly. He also reiterated the fact that China is “eating the cost” of the levies.\n\nAs previously reported by FOX Business, manufacturing companies are leaving China and heading to Vietnam, Taiwan and Thailand in order to lessen the financial burden of the tariffs.\n\nOfficials from the U.S. and China last week agreed to hold another round of talks in Washington D.C. next month. The two sides will hold consultations in mid-September to prepare.\n\nIt will be the thirteenth round of high-level economic talks between the world’s two largest economies.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "The president said a deal would not happen unless it is beneficial for the U.S.", "authors": ["Brittany De Lea"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/Trump-Rally-Thumb.jpg?ve=1&tl=1", "published_at": "2019-09-10"}