{"pub": "dailybeast", "url": "https://thedailybeast.com/how-a-university-of-south-carolina-biohacker-embedded-his-college-id-in-his-hand", "downloaded_at": "2019-10-22 16:02:28.149752+00:00", "title": "How a Teen ‘Biohacker’ Embedded His College ID in His Hand", "language": "en", "text": "Three weeks ago, robotics-obsessed Evan Bryer stumbled upon the website for the aptly named biohacking company Dangerous Things.\n\nAlong with advertisements for bundle deals on microchips, the Seattle-based company’s site proclaims: “Human, upgrade thyself.”\n\nAnd so he has.\n\nNow the mild-mannered freshman computer-science student at the University of South Carolina has four microchips in his hands, which he installed himself.\n\n“They have made things a bit easier when meeting new people because it lets me give them my contact information instantly,” the 18-year-old Michigan native told The Daily Beast on Tuesday. “The biggest difference is definitely it as a conversation piece, though. It’s a great conversation starter, if nothing else.”\n\nIn his left hand, Bryer has embedded a radio-frequency identification chip the size of a grain of rice with his USC student ID and phone contact information. In his right hand, he’s got a password manager and links to his social-media accounts. He also put LED lights in each hand that blink from beneath his skin when a keypad or phone has been connected.\n\n“I can rewrite them as many times as I want,” said Bryer. “Maybe my workplace will have me scan in with a badge, or I could hook these up to my door lock at home or use it to get into my car.”\n\nThe site, Bryer said, recommends that people get the implantation done by a piercing shop, but sends customers “everything you would need to do it yourself.”\n\nBryer’s biohacking experiment was first reported by his school’s student newspaper, The Daily Gamecock.\n\n“I just did it at my desk,” he told the student paper, “with a pre-sterilized syringe.”\n\n“You are putting a needle into your skin so of course it’s going to hurt a bit,” said Bryer. But in the end, it was no worse than giving blood, and he was guided by members of the forum on the Dangerous Things site, which has frequently asked questions and community projects, along with pages like “What is the best way to store cryptocurrency?”\n\nThe site was founded by Amal Graafstra, who wrote the book RFID Toys: Cool Projects for Home, Office, and Entertainment . The chips implement the same technology used for everyday office access cards and contactless payment in stores.\n\nIn 2016, Charlie Warzel wrote the definitive first-person piece about fintech—and biohacking oneself—when he traveled to Stockholm to get a microchip implanted in his hand in what he called “a bid to see for myself what the future of money—as is currently being written by Silicon Valley—might look like.”\n\nThousands of Swedes have opted to replace their keys, credit cards, and even train tickets with the devices since 2015. For his piece in BuzzFeed, Warzel underwent a month-long experiment to live without cash or physical credit cards and, eventually, state-backed currency completely.\n\nAmericans spent upwards of $3.68 billion using tap-to-pay technology in 2014, according to eMarketer. In 2015, that number more than doubled to $8.71 billion, Warzel reported. In 2019, it is expected to hit $210.45 billion, he wrote.\n\nA company in River Falls, Wisconsin, made headlines in August 2017 when it embedded 40 employees with microchips and gave them “I Got Chipped” T-shirts. The company told USA Today that employees would use the device to bypass company badges and computer log-ins.\n\nThose headlines were met with mixed responses from some concerned about surveillance—to be clear, the embeds did not have GPS—but Three Square Market President Patrick McMullan said anyone that worried about privacy should probably just take their cellphone “and throw it away.”\n\nBack at the South Carolina campus, Bryer said he was taken aback by the overwhelmingly positive response from friends and fellow students—especially over the LED lights. But his parents were less excited.\n\n“I told them about it once I had gotten written up by the school newspaper; it’s easier to ask for forgiveness than permission,” said Bryer, who has always been interested in robotics and hopes to go into software engineering or cybersecurity. “They weren’t that surprised that I would do something like this, but they were surprised that it was possible.”\n\n“I’d say they were confused.”", "description": "In his left hand, the 18-year-old has a radio-frequency identification chip with his student ID and contact information. In his right hand, he’s got a password manager.", "authors": ["Olivia Messer"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1571758324/191022-Messer-Student-ID-Microchip-tease_oeuish", "published_at": "2019-10-22"}