{"pub": "cnbc", "url": "https://cnbc.com/2019/09/29/street-fires-in-hong-kong-amid-battles-between-protesters-and-police.html", "downloaded_at": "2019-09-29 23:29:25.826586+00:00", "title": "Street fires burn in Hong Kong amid running battles between protesters and police", "language": "en", "text": "An anti-government protester throws a molotov cocktail during a demonstration near the Legislative Council building in Hong Kong, China, September 29, 2019. Athit Perawongmetha | Reuters\n\nHong Kong police fired a water cannon, rubber bullets and round after round of tear gas at petrol bomb-throwing protesters on Sunday in some of the most widespread and violent clashes in more than three months of anti-government unrest. Running battles in the Causeway Bay shopping district, Wan Chai bar area and the Admiralty district of central government offices followed a night of showdowns with police in the Chinese-ruled city, where street fires burned as dusk fell. More protests are planned in the run-up to China's Oct. 1 National Day, marking the 70th anniversary of the founding of the People's Republic. Police fired tear gas from the roof of the Legislative Council building, which activists trashed and daubed with graffiti weeks ago. Protesters, many of them wearing their trademark black with face masks, took cover from the tear gas behind umbrellas, some throwing tear gas canisters back at police.\n\nBarricades, bombs\n\nRiot police officers detain anti-government protesters during a demonstration at Admiralty district in Hong Kong, China September 29, 2019. REUTERS/Tyrone Siu Tyrone Siu | Reuters\n\nThey built barricades with trolleys and trash cans and other debris. One threw a petrol bomb at police in the Wan Chai metro station where an entrance was set ablaze. Others were trying to smash cameras over Bank of China ATMs but failed, spray-painting the screens instead. At least one petrol bomb landed on the grounds of central government offices where several windows were smashed. There were street fires on the main drag of Hennessy Road. Police, who raise placards warning of retaliation before firing tear gas or firing a water cannon, a tradition dating back to British rule, made several arrests, often in swoops, grappling people to the tarmac. There were no immediate reports of serious injuries. The water cannon fired blue dye, which elsewhere in the world is used to make identification of offenders easier. Ho, a 25-year-old working at an investment bank, was scattering bricks along a road in Wan Chai for others to use. \"When the police come we have to move quickly and we need to pick these up as we run,\" he said. Asked how he knew when the police were coming, he said supporters were following police all day, trying to listen in on their plans. The government said the city's leader, Carrie Lam, will be out of town for China's National Day, despite her having sent out invitations for celebrations at home.\n\nAnti-government protesters set a fire during a demonstration in Wan Chai in Hong Kong, China, September 29, 2019. Athit Perawongmetha | Reuters\n\nSome shops closed ahead of expected demonstrations, while the MTR metro service shut stations, a move that has made it a target of violence in the past. Protesters shouted anti-China slogans and called for their \"five demands, not one less\" of the government, including universal suffrage and the dropping of all charges against their arrested colleagues. About 200 China supporters dressed in red T-shirts gathered on top of Victoria Peak, overlooking the harbor, at around midday. They sang the Chinese national anthem and chanted \"I love China.\" Angela, a housewife in her 40s, a Chinese flag sticker plastered on her cheek, said the pro-democracy protesters were \"thugs.\" \"If the government takes violent action I don't object,\" she said. \"We have tolerated enough. I think I have emotional problems because of the riots. Because it's not safe to go out.\"\n\nChange of heart", "description": "Hong Kong police fired a water cannon, rubber bullets and round after round of tear gas at petrol bomb-throwing protesters on Sunday in some of the most widespread and violent clashes in more than three months of anti-government unrest.", "authors": [], "top_image": "https://image.cnbcfm.com/api/v1/image/106154732-1569779474158rtx756j3.jpg?v=1569779546", "published_at": "2019-09-29"}