{"pub": "thestreet", "url": "https://realmoney.thestreet.com/investing/stocks/sussing-fed-plus-apple-amgen-other-earnings-market-recon-15145783", "downloaded_at": "2019-10-30 11:47:17.446366+00:00", "title": "Sussing the Fed -- Plus Apple, Amgen and Other Earnings: Market Recon", "language": "en", "text": "Let There Be Light\n\nLiving out on Long Island, the populace is quite used to going a few days here and there without electrical power. The soil for large swaths of the island can be rather sandy. You don't really need a big storm to knock down trees that then knock down power lines. A few times a year, a squirrel or a bird will try to build a home in or on a transformer box and end up taking down entire neighborhoods. We have a foot locker filled with flashlights and batteries at the ready for these occasions, but it is with some relief that the family welcomes back the luxuries of modern living when the lights come back on.\n\nIt is with far less delight that market participants welcome back the nation's central bankers from their \"eight times a year\" blackout period. We think we know what FOMC will do this afternoon. We really face far less certainty as to what Fed Chair Jerome Powell will signal, and how markets will perceive this signalling.\n\nGratefully, there will be no utterly foolish economic projections made this day, as they were made just last month, in mid-September, and the famous \"dot plot\" is published just four times a years. For the record, it is the process that I consider foolish, not every single projection made by each dot plotter.\n\nInteresting Day Ahead\n\nThe truth is that I hate when stocks that I remain long end up running higher into an earnings report. It is with some relief that I see names I like back up a little just before the event. That's one reason why I was so happy to see Apple (AAPL) take a 2.3% hickey on Tuesday. That name had been on a pre-earnings tear, and I had really been thinking of popping out of the shares ahead of the digits and then trying to pop back in after the shares sell off on Wednesday evening. Then again, trading AAPL has worked out in truth less often than has just holding the shares through thick and thin.\n\nMarkets often react similarly to monetary policy announcements. There is equity market elevation ahead of the event. We have certainly seen that. Then there is a very quiet event day, up until the announcement. We probably still see that. Then there is the algorithmic jitterbug precisely at 2 p.m. ET as human traders have drawn on all bids and offers while trying to quickly read the statement. Then more quiet. The Fed Chair takes the podium, usually beginning with a \"good afternoon,\" and within a few minutes, the market will choose a direction. The gnashing of teeth comes within a half hour after that.\n\nTo somewhat complicate matters ahead of the big event, the Bureau of Economic Analysis will release its advance estimate (first release, to be followed by two scheduled revisions) for Q3 GDP before Wednesday's opening bell. Economists look specifically today for strength, or lack thereof, in consumer spending, and if that area is considerably weaker, did that missing strength end up in residential investment?\n\nConsensus is for headline economic growth of 1.7% q/q SAAR (quarter over quarter, seasonally adjusted annualized rate), and that is precisely in line with what we see in the Atlanta Fed's GDPNow model. Readers know I follow Atlanta on this data point rather closely.\n\nProfit Taking\n\nAlso interesting, or so I thought, was the fact that the Information Technology sector suffered from a spate of profit taking one day ahead of the FOMC statement, as that sector still leads the overall market over one week's time. Semiconductor stocks, still up 3.5% over five sessions, were hit especially hard on Tuesday, taking software and hardware down with them. On a day where the broader markets moved really sideways, the tech-heavy Nasdaq Composite gave up 0.6% and the even tech-heavier Nasdaq 100 surrendered 0.8%.\n\nThe good news for investors was that the trading volume on Tuesday was simply in the churn. Volume both at the New York Stock Exchange and directly attributable to the S&P 500 increased to the highest levels seen in over a week's time, while volume both at the Nasdaq market site and related only to components of the Nasdaq Composite dropped significantly on Tuesday from Monday. This implies that Tuesday's action was more about profit taking and not about portfolio distribution.\n\nOne note of serious caution here... Even after Tuesday's sideways-to-downward sloping trade, the Nasdaq Composite closed at a 2.9% premium to it's own 50-day simple moving average. The S&P 500 closed at a 2.5% premium to that line, and this comes even as this moving average has started sloping in a northerly direction. Why warn about this? Just be aware that both of these \"broader\" large-cap indices, while not quite overbought, are close enough in a technical sense that there could be a negative algorithmic reaction to almost anything.\n\nNot that there has to be such a reaction. Just understand how that works. The bots will race each other to various points of sale, and create momentum attracting more bots. That activity may or may not stop until something breaks technically, which is why I told you how far above the 50-day lines these indices now stand. That's where at least some humans will start reacting to technical damage should a speed event occur.\n\nTwo PM (Eastern Daylight Time)\n\nFutures markets in Chicago are now pricing in a 96% probability of one quarter-point rate cut this afternoon, dropping the Fed Funds Rate target to a range spanning 1.5% to 1.75%. This would at least target this overnight rate in a range that makes sense, given that 30-day paper currently yields just less than 1.65%. Should yields for 30-day T-Bills hold close to the midpoint of the targeted range for the Fed Funds Rate, at least one more reduction might (will) need to be made before this easing cycle concludes. This would be a technical necessity and should not be very difficult even for policy makers to understand.\n\nHowever, I would be surprised if Jerome Powell were to signal a bias toward easing further in December even if that bias does exist. Yes, inflation has been soft, as are inflation expectations. Economies around the U.S. are still in a state of flux.\n\nThe industrial economy within the U.S. remains in an isolated state of recession. Still, with elections in the UK slated for December 12 (and make no bones about it, the outcome there could impact global growth), and Presidents Trump and Xi expected to meet in Chile in mid-November, it might be wise for the Fed Chair to shield his cards as the game progresses.\n\nMyself? I believe it very likely that Kansas City's Esther George and Boston's Eric Rosengren will both dissent in favor of no rate cut, while St. Louis' James Bullard, satisfied with the day's events does not. This dissension, coupled with the need to keep mum on December, will possibly result in a combination of a statement and a press conference that come off publicly as a hawkish... even if that is not the intent.\n\nTuesday Night Earnings\n\n1) Advanced Micro Devices (AMD) , Last $33.03... Met EPS expectations while missing on revenue. Growth seems to be in right places. Still, lackluster Q4 guidance. Margin should improve.\n\nTarget Price: $36 Add: $30 Panic: $28\n\n2) Amgen (AMGN) , Last $208.99... Beat expectations for both EPS and revenue. declining Nuelasta sales growth seems to be successfully replaced by Prolia, Repatha, and Aimovig. Increased full-year guidance for both earnings and sales. Tested key level of $211 on Tuesday ahead of the numbers.\n\nTarget Price: $255 Add: $200 Panic: $192\n\n3) Mercury Systems (MRCY) , Last $72.09.... Beat both EPS and sales expectations. Raised firm's guidance for full-year earnings and revenue, but (and this is a big but) left that EPS guidance below Wall Street consensus. Now you know why the shares sold off overnight. Note here: This week, Lockheed Martin (LMT) nailed down a $34 billion agreement with the Pentagon for a total of 478 F-35 fighter aircraft, including 291 for delivery to the U.S. armed forces. Separately, Lockheed also won a $7 billion contract modification from the U.S. Navy for the F-35s that the naval service has due. Mercury is a key electronics supplier to the F-35 program.\n\nTarget price: $96 Add: $70 (may matter today) Panic: $64\n\nEconomics (All Times Eastern)\n\n08:15 - ADP Employment Report (Oct): Expecting 128K, Last 135K.\n\n08:30 - GDP (Q3-adv): Expecting 1.7% q/q, Last 2.0% q/q SAAR.\n\n10:30 - Oil Inventories (Weekly): Last -1.699M.\n\n10:30 - Gasoline Stocks (Weekly): Last -3.107M.\n\nThe Fed (All Times Eastern)\n\n14:00 - FOMC Policy Decision\n\nToday's Earnings Highlights (Consensus EPS Expectations)\n\nBefore the Open: (GE) (0.12), (LHX) (2.39), (MAS) (0.70), (MCK) (3.59), (SO) (1.14), (YUM) (0.95)\n\nAfter the Close: (AAPL) (2.83), (KLAC) (2.20), (LYFT) (-0.74), (FB) (1.86), (SBUX) (0.70), (TWLO) (0.01), (WDC) (0.29)", "description": "Markets are watching what Fed Chair Powell will signal for future rate cuts during this afternoon's FOMC rate decision....GE", "authors": ["Stephen Guilfoyle", "Sussing The Fed -- Plus Apple", "Amgen", "Other Earnings", "Market Recon", "Markets Are Watching What Fed Chair Powell Will Signal For Future Rate Cuts During This Afternoon'S Fomc Rate Decision.", "Stocks Quotes In This Article", "Paul Price", "Helene Meisler", "James"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/5a522a38-136c-11e8-b8cf-074c479e2d81.png", "published_at": "2019-10-30"}