{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-hongkong-protests/hong-kong-leader-to-meet-key-demand-of-protesters-and-kill-bill-idUKKCN1VP05P", "downloaded_at": "2019-09-04 08:08:14.848164+00:00", "title": "Hong Kong leader to meet key demand of protesters and kill bill", "language": "en", "published_at": "2019-09-04", "text": "HONG KONG (Reuters) - Hong Kong leader Carrie Lam will announce on Wednesday the formal withdrawal of an extradition bill that triggered months of unrest and has thrown the Chinese-controlled city into its worst crisis in decades, Cable TV and other media said.\n\nA government source confirmed the planned withdrawal, which comes just two days after Reuters revealed in an exclusive report that Lam told business leaders last week she had caused “unforgivable havoc” by introducing the bill and that if she had a choice she would apologise and resign, according to a leaked audio recording..\n\nAt the closed-door meeting, Lam told the group that she now had “very limited” room to resolve the crisis because the unrest had become a national security and sovereignty issue for China amid rising tensions with the United States.\n\nLam’s remarks are consistent with a Reuters report published on Friday that revealed how leaders in Beijing were effectively calling the shots on handling the crisis.\n\n“All the efforts we have done are worthwhile,” university student Jessica, 23, said of the withdrawal reports, though adding not all of the protesters’ demands had been met.\n\n“Even though it’s not the result we expected. I believe that this issue has made Hong Kong more united.”\n\nThe protests against the bill in the former British colony began in March but snowballed in June and have since evolved into a push for greater democracy.\n\nThe bill would have allowed extraditions to mainland China where courts are controlled by the Communist Party,\n\nIt was not immediately clear if the announcement of the bill’s withdrawal, due later on Wednesday, would help end the unrest.\n\nThe chief executive’s office did not immediately respond to a request for comment.\n\nHong Kong's benchmark Hang Seng Index .HSI jumped after the report, trading up about 3.4%. The property index also jumped.\n\nThe withdrawal of the draft legislation was one of the protesters’ key demands. Lam has said before that the bill was “dead” but she did not withdraw it.\n\nThe other demands are: the retraction of the word “riot” to describe rallies, the release of all arrested demonstrators, an independent inquiry into the police perceived brutality and the right for Hong Kong people to democratically choose their own leaders.\n\nMichael Tien, a member of Hong Kong’s legislature and a deputy to China’s national parliament, said the government should withdraw the bill and that he would support an inquiry commission.\n\n“The government should withdraw the bill. If the government mentioned (a withdrawal) in June it would have stopped already,” he told reporters, referring to the protests.\n\nHong Kong's Chief Executive Carrie Lam holds a news conference in Hong Kong, China, August 27, 2019. REUTERS/Kai Pfaffenbach\n\nCHINA’S WARNINGS\n\nHong Kong returned to China under a “one country, two systems” formula that allows it to keep freedoms not enjoyed on the mainland, like the freedom to protest and an independent legal system, hence the anger at the extradition bill and perceived creeping influence by Beijing.\n\nThe Chinese government rejected a recent proposal by Lam to defuse the conflict that included withdrawing the extradition bill altogether, three people with direct knowledge of the matter told Reuters.\n\nAsked about the report, China’s foreign ministry said the central government “supports, respects and understands” Lam’s decision to suspend the bill. The Global Times, a nationalistic tabloid published by the Communist Party’s official People’s Daily, denounced it as “fake”.\n\nChina has regularly denounced the protests and warned about the impact on Hong Kong’s economy\n\nChina denies it is meddling in Hong Kong’s affairs but warned again on Tuesday that it would not sit idly by if the unrest threatened Chinese security and sovereignty.\n\nThe unrest had shown no sign of easing by Tuesday night.\n\nRiot police fired beanbag guns and used pepper spray - both anti-riot weapons - to clear demonstrators from outside the Mong Kok police station and in Prince Edward metro station, with one man taken out on a stretcher with an oxygen mask over his face, television footage showed.\n\nVideos showing the man being apprehended by the police in the station have been widely shared on social media with protest groups and activists saying it is evidence of the police brutality they say is widespread and needs to be investigated.\n\nThe police, who have repeatedly denied using excessive force, did not immediately respond to a request for comment. Hong Kong police are due to hold a news conference at 4 p.m. (0800 GMT).\n\nPolice officers assist a man saying he is a Chinese tourist outside the government headquarters during a general strike in Hong Kong, China September 3, 2019. REUTERS/Kai Pfaffenbach\n\nThree men, aged between 21 and 42, were taken to Kwong Wa Hospital late on Tuesday, a hospital authority spokeswoman said.\n\nTwo, including the man stretchered out of Prince Edward station, were in a stable condition and one had been discharged, she said.", "description": "Hong Kong leader Carrie Lam will announce on Wednesday the formal withdrawal of an extradition bill that triggered months of unrest and has thrown the Chinese-controlled city into its worst crisis in decades, Cable TV and other media said.", "authors": ["Farah Master", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190904&t=2&i=1426043258&w=1200&r=LYNXNPEF830I3"}