{"pub": "marketwatch", "url": "https://mansionglobal.com/articles/rare-fifth-avenue-pre-war-condominium-lists-for-28-5-million-207486", "downloaded_at": "2019-09-20 22:38:58.232808+00:00", "title": "Rare Fifth Avenue Pre-War Condominium Lists for $28.5 Million", "language": "en", "text": "A full-floor apartment at a tony Upper East Side building hit the market Tuesday with a $28.5 million price tag.\n\n\n\nLocated directly across Fifth Avenue from the Metropolitan Museum of Art, the 14-story apartment building, which was reportedly once lived in by actress— and later Princess of Monaco—Grace Kelly, was designed by leading architect J.E.R. Carpenter in 1925.\n\n\n\n“The holy grail of New York City architecture are the grand scale pre-war buildings,” the premier buildings being those designed by Carpenter and his predecessor Rosario Candela, said listing agent Dan Kessler, who listed the property along with Byron Anderson of Compass.\n\n\n\n“Only two [of Carpenter’s buildings] have been converted into condos and only one of those buildings is on Fifth Avenue,” Mr. Kessler said. Condo ownership presents more flexibility than owning a co-op or an apartment, he added. Condos boards are also more open to foreign buyers.\n\n\n\nThe wedding cake-style building has multiple distinct tiers decreasing in square footage as the floors increase. This penthouse sits on the penultimate floor of the first tier. “It’s the highest you can be with the largest floor plan,” Mr. Kessler said.\n\n\n\nMore: Newly Renovated House in Bristol Lists for £1.575 Million\n\nThe four-bedroom apartment—one of just 13 units in the building—is being sold by a former Morgan Stanley executive who purchased the home in 2003 for $9.2 million, property records show.\n\n\n\nSpanning 3,673 square feet, and entered through a marble-clad private elevator landing, the home has a living room with a wood-burning fireplace and windows looking out over the museum and across Central Park, according to the listing.\n\n\n\nThere is also a French-polished mahogany library, a formal dining room, a kitchen with an adjacent breakfast room, and separate staff quarters.\n\n\n\nFrom Penta: Art by Women Remains Underrepresented\n\nThe Fifth Avenue building has been “home to prominent New Yorkers from the beginning,” the listing said.\n\n\n\nAlong with Kelly—who reportedly lived there prior to her marriage to Prince Rainier of Monaco—it was also home to Sylvia Green Wilks, the daughter of Wall Street scion Hetty Green, according to the listing. Green Wilks reportedly lived across two floors of the building, using one for her home and the other to store her surplus furniture.\n\n", "description": "", "authors": ["Miabelle Salzano"], "top_image": "https://images.mansionglobal.com/im-109366?width=1280", "published_at": "2019-09-20"}