{"pub": "news24", "url": "https://channel24.co.za/Gossip/News/kanye-west-tells-kim-k-how-her-sexy-look-affects-him-20191014", "downloaded_at": "2019-10-15 23:11:43.865908+00:00", "title": "Kanye West tells Kim K how her sexy look affects him", "language": "en", "text": "Cape Town - In the latest episode of Keeping Up with the Kardashians we got an inside look at how Kim's Met Gala look came together. And you can bet there was drama.\n\nThe night before she turned heads in her stunning but constrictive Thierry Mugler dress, Kanye West (42) expressed disapproval over his wife’s revealing dress, saying it deeply affected him, ET reports. \"You are my wife and it affects me when your pictures are too sexy,\" he said.\n\nBut the 38-year-old reality star did not take it sitting down and clapped back saying he’d always encouraged her to be confident with her sexy looks. \"You built me up to be this sexy person and have confidence and all this stuff,\" she said. \"And just because you’re on a journey and you’re on a transformation doesn’t mean that I’m in the same spot with you.\"\n\nBarely able to breathe in the corset she had to wear under her dress, Kim revealed during her behind-the-scenes video for Vogue that she would be \"walking around mingling, talking, but I cannot hardly sit\".\n\n\"Wish me luck, I won’t be able to pee for about four hours,\" she revealed.\n\nREAD MORE: This is what Kim Kardashian West sacrificed for that incredible Met Gala gown\n\n\n\nAfter criticising her look Kanye calmly said, \"Alright, cool,\" and stormed out of the room, ending the conversation. But by the end of the episode Kanye seemed pretty excited about her look and seemed to enjoy their time on the red carpet.", "description": "Kanye West expressed disapproval over his wife’s revealing dress, saying it deeply affected him.", "authors": ["Dakalo Nemasetoni"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9473/cd50b7fdda8e4e1f82e2558b6a00ef4e.jpg", "published_at": "2019-10-14"}