{"pub": "townhall", "title": "The Gambler: RBG and the Trump Campaign", "url": "https://townhall.com/columnists/billmurchison/2019/08/27/the-gambler-rbg-and-the-trump-campaign-n2552218", "language": "en", "published_at": "2019-08-27", "downloaded_at": "2019-09-02 07:21:37.356036+00:00", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nOver the weekend, the media took notice of Justice Ruth Bader Ginsburg's apparently successful treatment for a malignant tumor on the pancreas. \"No further treatment is needed at this time,\" said Memorial Sloan Kettering Cancer Center in New York City -- which wasn't the same thing as saying \"Justice Ginsburg's Supreme Court tenure is locked down and guaranteed.\"\n\nPossibly the least edifying phenomenon you run across in politics -- a highly unedifying pursuit these days, full of noise and rancor -- is what might be called the death watch, as in how-long-before-we-get-to-replace-old-so-and-so-on-whatever-it-is. Few are the political folk whose disappearances for one reason or another excite public rejoicings. Ginsburg -- a smart, snappy and rigorously honest jurist -- isn't among their number. \"Long may she wave!\" we need to exclaim so as to keep up some pretense of humanity amid all the grossness.\n\nThis is not to deny she's a major player in the 2020 elections -- in one sense, the major player.\n\nMaybe Donald Trump understands, and maybe he doesn't, that his widely supported project of tugging the federal judiciary to the right buys him tolerance he might not otherwise be vouchsafed -- and well could lose if certain things don't change.\n\nThe bare, spare, unsentimental fact is that The Notorious RBG's retirement from the Supreme Court, due to age and health, would allow Trump this year -- next year -- to strengthen a tenuous conservative majority on the court, made possible by the 2016 election, and possibly the next one up. At the same time, he would continue to staff the lower federal benches with conservatives.\n\nHere, in all its quasi-glory, is the main reason many conservatives cut him so much slack. They want a conservative judiciary. They want to fill the Ginsburg seat. This helps counteract the distinct possibility Trump could be wearing out his public welcome.\n\nWitness last week's rants and raves about China and the Fed. The Fed chairman no less a threat to America than a Chinese dictator? So the president would have it. American companies \"hereby ordered\" -- by tweet -- to end their Chinese ties! Aaaarghhhh! This is government by tantrum. Did one other American besides Trump find the experience inspiring? One certainly hopes not.\n\nThus the prospect that ordinary Middle Americans next year could be talked into canceling \"The Donald Show\" is a prospect the show's star seems not to notice. The matches with which he plays so carelessly could start a political forest fire -- putting the country in danger of, God save the mark, a Warren or Harris or who-knows-what-else presidency.\n\nNo democratically elected president should ever take for granted his ability to snap his fingers and make the masses move this way or that. Hillary Clinton did. Look where it got her.\n\nVoters find life in the midst of a political blizzard little to their taste. They don't want insults constantly swirling through the air. They don't want nonstop tweets oozing with personal pride and righteous indignation. Most of the time, unless five decades of journalism have blinded me to reality, they want general well-being and a strong sense of personal freedom to achieve the same, in pursuit of which they tend to anoint those they see as likeliest to encourage or bestow such public ends.\n\nNo one should ever, ever underestimate the cringe factor in public life -- a more general factor than the present White House seems to acknowledge. Every president -- hardly excluding the self-satisfied Barack Obama -- is capable of causing teeth to grind. It is the grim factor Trump is grimly awakening.\n\nFor now, the prospect of a sure-enough conservative federal judiciary, pre- or post-RBG, plays to Trump's long suit. It helps, like his refugee policies, to keep conservatives and many much-desired moderates happy, if nervous.\n\nBetter still, from the standpoint of rolling up crucial centrist votes, would be a widely shared sense of economic well-being, such as we thought we were enjoying prior to last week's Twitter storm, in all its peevish incoherence. What was the point here? Was there a point at all? With DJT, no one can say -- possibly not the president himself, who by Sunday was backing away from the rhetorical precipice.\n\nIf Trump truly desires reelection, he should realize he is pressing his kind of amazing luck -- which is what gamblers do, instinctively. It can work, but not always, even with the likes of RBG hovering tableside.", "description": "Over the weekend, the media took notice of Justice Ruth .09/02/2019 3:19:35AM EST.", "authors": ["Bill Murchison", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/235/03bc6f15-c04f-4521-8e14-da35254d4559.png"}