{"pub": "yahoo", "url": "https://yahoo.com/gma/skydiver-dies-crashing-big-rig-trailer-california-highway-145216195--abc-news-topstories.html", "downloaded_at": "2019-09-28 02:08:16.729471+00:00", "title": "Skydiver dies after crashing into big rig trailer on California highway", "language": "en", "text": "Skydiver dies after crashing into big rig trailer on California highway originally appeared on abcnews.go.com\n\nA skydiver died after she crashed into the rear of a big rig trailer on a California highway, officials said.\n\nThe skydiver, who authorities identified as a 28-year-old woman, was out with a group around 2 p.m. Thursday when the fatal accident occurred on Highway 99 near Lodi, according to a statement from the California Highway Patrol (CHP).\n\nThe woman slammed into the right-hand shoulder of the southbound highway, near Jahant Road, just after she hit the truck, the statement read. It was not immediately clear what caused the incident.\n\n\"Due to those two impacts, due to the blunt force trauma, she was pronounced dead on scene,\" CHP Officer Ruben Jones told ABC Sacramento affiliate KXTV.\n\nPHOTO: A skydiver was struck and killed by a semi after being blown off course and colliding with the truck near Lodi, Calif., Sept. 26, 2019. (Kurt Rivera/KXTV) More\n\nShe and seven others were believed to have been skydiving with the Lodi Parachute Center, authorities told the station.\n\nBill Dause, the owner of the center, identified the woman only as Maria. Dause said at a press conference Friday she had 155 jumps under her belt and had been jumping at his center for the past two weeks.\n\n(MORE: Man dies in skydiving accident near Grand Canyon, instructor escapes with broken leg)\n\nWhen asked about the weather conditions that day, Dause said, \"her decision to jump was a decision she made. She did not believe it was too windy for her to jump and since she is experienced, it was up to her discretion.\"\n\nThree other people have landed on Highway 99 during their jump, but Thursday's incident was the first to result in a fatality, according to Dause.\n\nPHOTO: A skydiver was struck and killed by a semi after being blown off course and colliding with the truck near Lodi, Calif., Sept. 26, 2019. (Kurt Rivera/KXTV) More\n\nIt is not, however, the first death connected to the company.\n\n\"We have had a number of fatalities and I don't know the exact number,\" Dause said in October 2018, according to KXTV. \"Each one has been totally unique. It's not like we've been doing the same thing wrong all the time, or the same parachute failed, or something like that.\"\n\n(MORE: Video: Skydivers injured in mid-air collision)\n\nDause said, at the time, he thought up to 18 people have died with his company since 2000, including four suicides, two heart attacks, and a number of other issues causing the deaths.\n\nAll southbound lanes on Highway 99 were closed for about an hour after the latest incident, according to CHP.\n\nABC News' Lauren Botchan contributed to this report.", "description": "A skydiver died after she crashed into the rear of a big rig trailer on a California highway, officials said.  The skydiver, who authorities identified as a 28-year-old woman, was out with a group around 2 p.m. Thursday when the fatal accident occurred on Highway 99 near Lodi, according to a statement", "authors": ["Ella Torres"], "top_image": "https://s.yimg.com/uu/api/res/1.2/8s_VGeHH6qA7h5IvIkLAug--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.go.com/truck-2-skydiver-ht-ps-190927_hpMain_16x9_992.jpg", "published_at": "2019-09-27"}