{"pub": "dailymail", "url": "https://dailymail.co.uk/home/event/article-7583543/A-monumental-work-penetrating-Iron-Ladys-public-armour-reveal-fragile-heart-beneath.html", "downloaded_at": "2019-10-20 00:25:21.656882+00:00", "title": "A monumental work, penetrating the Iron Lady's public armour to reveal the fragile heart beneath", "language": "en", "text": "Margaret Thatcher: The Authorized Biography. Volume Three: Herself Alone\n\nCharles Moore Allen Lane £35\n\nRating:\n\nThe very last sentence in this third and final volume of Charles Moore’s monumental 3,000-page life of Margaret Thatcher is as short as can be: ‘She gave everything she could.’\n\nNo one, friend or foe, could read her biography without acknowledging the simple truth of that sentence. Hers is a life that is almost as exhausting to read as it must have been to live.\n\nThe portrait of Mrs Thatcher’s years after Downing Street is sad and touching. She had no hobbies or outside interests with which to fill her days\n\nIn the last four years of her premiership, covered in this volume, she seems to have increasingly felt that it was her job to sort out not just all the problems of the country, but all the problems of the world. In his introduction, Moore calculates that during her time in office, more than a million pages of documents crossed her desk, on many of which her fountain pen would make its mark, ‘underlining for support or emphasis, wiggling in displeasure, impatient of punctuation and often bursting into capital letters and exclamation marks’.\n\nWhile reading this extraordinary book I found myself remembering a prophetic piece written by the great satirist Auberon Waugh in August 1989, well over a year before she finally resigned. Mrs Thatcher had, he said, ‘lost her touch… she quite simply gets it wrong every time’.\n\nHe wrote of ‘the almost universal loathing in which Mrs Thatcher is now held in her own party and throughout the upper reaches of the country... even as the country has accepted the major tenets of Thatcherism, it repudiates Thatcher with increasing vehemence. I think the reason this dislike has now crystallised into permanent loathing is that people have begun to see her obstinate determination to lead her party to defeat as the greatest obstacle to future serenity.’ She had, he concluded, fixed herself to the seat of power like ‘a mad, broody hen on addled eggs’.\n\nIT'S A FACT A chance meeting with Laurence Olivier led to Mrs Thatcher using his voice coach to lower her pitch to its famous authoritative tone.\n\nBiographers have a duty to see things from their subjects’ point of view. Moore acknowledges that, by the summer of 1990, Mrs Thatcher’s unpopularity among MPs and in the country at large had become ‘an albatross around her neck’, but he can never quite bring himself to acknowledge what a hindrance she had become to her party’s chances of re-election. When her downfall finally occurs, he calls it ‘Mrs Thatcher’s political assassination’, which is how she saw it, too: ‘treachery, with a smile on its face’. But it was less treacherous than pragmatic, and if Mrs Thatcher had taught the country anything, it was surely the value of pragmatism.\n\nLong before any sort of conspiracy to topple her got going, Lord Carrington told her frankly, ‘Margaret, you’re going to lose the next election to Kinnock. Shouldn’t you consider resigning?’ Far from being treacherous, he was simply telling her the truth, and offering the kindest solution.\n\nHer last four years in government were, Moore writes, ‘even busier than her previous seven’. More than any other political biographer, he gives you the feel of the endless pressure of events on the person in power. Spycatcher, terrorism, the fall of the Berlin Wall, the end of apartheid, ‘no such thing as society’, the ERM, AIDS, Section 28, the Iran-Contra affair, the Poll Tax: small wonder if, in her struggle to deal with them all, Mrs Thatcher lost touch with reality.\n\nThis volume is called Herself Alone, and throughout it Moore emphasises what a solitary figure she cut. Part of this was due to being a woman in a man’s world. But there was also something in her character that was essentially cut-off and unconvivial, less comfortable making friends than making enemies. ‘You men, you’re all so weak’ she once said, after the Dutch had sided with the Germans. When her colleague Geoffrey Howe said she had gone too far, she replied, ‘How typical of a man, Geoffrey.’\n\nAs Moore observes, she was kind to those who worked for her, like secretaries and drivers, but she could be rude and small-minded to those who worked alongside her, such as Cabinet colleagues. She lacked largesse. In her isolation, was she an essentially unhappy person? Her devoted PA (and probably her best friend) Cynthia ‘Crawfie’ Crawford, tells Moore that, in Thatcher’s spartan childhood, ‘She had not been allowed the time to be happy.’ Moore expands on this theme: ‘So she sought the laurels of fame and power, but could never rest on them. She applied her high standards to herself, and, for all her pride in her own achievements, found herself wanting. Her only solution was to press ever onwards.’\n\nHe paints a surprisingly bleak picture of Mrs Thatcher’s family life, too. Contary to his popular image, Denis comes across as a distant, rather guarded and furtive character. When Mrs T said, ‘You men, you’re all so weak’ was she basing her judgment on him? In one of the most bizarre revelations of the book, we discover that, in his twilight years, he formed a friendship with Mandy Rice-Davies, the former good-time girl famous for her role in the Profumo affair. He would often pop by without warning. Rice-Davies tells Moore that he felt the need to put some distance between his wife and himself: ‘He never made telephone calls home.’ Once, at a party, Rice-Davies noticed Mrs Thatcher looking at her. ‘She had a kind of forensic stare. I could catch her looking at me when she thought I wasn’t looking. She was working me out.’\n\nHer children, too, were pretty useless. Mark was, according to one senior US official, ‘a spoilt brat who behaved very badly… He exploited his mother’s position’. In his spivvy way, he would talk to her advisers about how best to capitalise on the Thatcher ‘brand’.\n\nIn her declining years, he would make up for his prolonged absences by bossing her devoted carers about. He was also sometimes known to shout at his mother, who would grow anxious before he called round.\n\nCarol, always seen as the more diligent of the two, was in fact more negligent, visiting her mother more rarely and sometimes announcing that she was going to drop by, but then failing to turn up. She was also responsible for revealing, in her clod-hopping way, her mother’s Alzheimer’s to the world. One day, Mrs Thatcher turned on the television, only to hear a presenter saying something along the lines of, ‘Next we talk to Carol Thatcher about how she’s coping with her mother’s illness.’ Her reaction – understandable, given the circumstances – was to fly into a rage, and threaten to disinherit her daughter.\n\nThe portrait of Mrs Thatcher’s years after Downing Street is sad and touching. She had no hobbies or outside interests with which to fill her days. Instead, she was in the habit of listening to the morning news, then making detailed plans of action, as if she was still in power.\n\nIn retirement, she was as peevish towards John Major as Edward Heath had been towards her. At a dinner party in New York, when someone asked her, ‘Are you trying to show contempt for your successor?’ she answered, ‘On the contrary, I was trying to conceal it.’ When it came to writing her autobiography, when her editor pointed out that there was no mention at all of Labour leader Neil Kinnock, she replied, battily, ‘I refuse to have his name in my book!’\n\nIn retirement, Margaret Thatcher was as peevish towards John Major as Edward Heath had been towards her\n\nCharles Moore’s biography of Mrs Thatcher is an extraordinary achievement: panoramic and particular, underpinned by a deep grasp of contemporary politics, and with an instinctive understanding of the complexities and contradictions of his subject’s peculiar character.\n\nEvery now and then, he leans a bit too close to her political bias: waves through her support for the doltish Archbishop of Canterbury, George Carey, underplays her burgeoning regality and describes Salman Rushdie, a little too blithely, as ‘a classic salon leftist’. But these are tiny quibbles. All in all, with his faultless, flowing prose, he penetrates the formidable public armour to reveal the fragile heart beneath.\n\n‘What none of them felt was her anguish –about what to wear, how to speak, how to look after her husband and children while she climbed to power, how to survive. Friend or foe, they understood little about her. She brilliantly exploited their inattention and their susceptibilities, and was genuinely grateful to the minority who were kind and helpful. But she never ceased to be alone.’", "description": "The very last sentence in this third and final volume of Charles Moore's monumental 3,000-page life of Margaret Thatcher is as short as can be: 'She gave everything she could.'", "authors": ["Craig Brown Event For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/17/19890260-0-image-a-11_1571415273077.jpg", "published_at": "2019-10-19"}