{"pub": "axios", "url": "https://artnews.com/2019/04/01/kaws-auction-record-14-7-million", "downloaded_at": "2019-10-05 05:49:06.544297+00:00", "title": "$14.7 M. KAWS Painting Smashes Auction Record in Hong Kong -", "language": "en", "text": "COURTESY SOTHEBY’S\n\nThe auction world’s exclusive eight-figure club has a new member.\n\nOn Monday night at Sotheby’s in Hong Kong, a painting by the artist KAWS (aka the New Jersey–born Brian Donnelly) sold for a staggering 115.9 million HKD, or about $14.7 million in U.S. dollars, a new auction record for the artist. The result came at Sotheby’s “NIGOLDENEYE® Vol. 1” sale, with The Kaws Album (2005) soaring past its estimate of 6,000,000—8,000,000 HKD ($760,000–$1 million) to that lofty finish.\n\nThe record-shattering piece, which is a riff on the cover art for the Beatles album Sgt. Pepper’s Lonely Hearts Club (1967), easily eclipsed KAWS’s previous record of $2.7 million, which was set last November in New York at Phillips in its 20th-century evening sale by Untitled (Fatal Group), 2004, a work that presents the artist’s take on the classic Fat Albert cartoon.\n\nIn this sale, Sotheby’s was offering pieces from the collection of the streetwear impresario Nigo, who styles his name with the registered trademark (as seen in the name of the auction). It grossed a total of nearly $220 million HKD, or $28 million, across 33 lots, meaning that record-setting painting accounted for about half of the haul.\n\nAside from collecting, Nigo is the creator of the streetwear line A Bathing Ape and co-founder of the clothing label Billionaire Boys Club with the musician Pharrell, and the pieces he was selling displayed a vigorous cross-pollination between art and streetwear: five of the lots were sneakers, four of which were BAPE in collaboration with KAWS. Two lots of two pairs of shoes went for 125,000 HKD, or $15,900, which comes out to about $7,950 a pair (or $3,975 per shoe).\n\nThe sale was almost entirely comprised of work by KAWS. Other top lots from the auction were three riffs on The Simpsons by the artist, all from 2003: Untitled (Kimpsons), which sold for 21.2 million HKD, or $2.7 million; Untitled (Kimpsons #3), for $20.5 million HKD ($2.6 million), and Kimpsons Series, for $7.4 million HKD ($940,000).\n\nKAWS has had quite a time in Hong Kong over the past week, as the Art Basel fair ran in the city. On March 25, the Hong Kong Contemporary Art Foundation opened a survey exhibition, “Along The Way,” organized by the storied Italian curator Germano Celant, and for a short time, a giant inflatable of his character “Companion” was floating in Victoria Harbor before it was taken down two days early due to weather conditions.", "description": "The new high mark came during the sale of pieces from the collection of streetwear mogul Nigo.", "authors": ["Annie Armstrong"], "top_image": "https://www.artnews.com/wp-content/uploads/2019/04/0-1.jpg", "published_at": "2019-04-01"}