{"pub": "yahoo", "url": "https://news.yahoo.com/beto-orourke-hell-yes-going-022311076.html", "downloaded_at": "2019-09-13 18:08:06.190760+00:00", "title": "Beto O'Rourke: 'Hell, yes, we’re going to take your AR-15, your AK-47' to keep children safe", "language": "en", "text": "A month after a gunman opened fire at a Walmart in his hometown of El Paso, killing 22 and injuring more, Beto O'Rourke stood onstage in Houston and was asked about his proposal to buy back military-style assault weapons.\n\nThe question, during the third debate among Democratic presidential candidates, came after several of his competitors had praised his advocacy for gun control in the aftermath of the mass shooting.\n\n“Hell, yes, we’re going to take your AR-15, your AK-47,” O’Rourke said.\n\nCritics call his proposal confiscation.\n\nO’Rourke said the weapons have to go when they’re being used against children. He described meeting a mother who watched her daughter bleed to death in Odessa after being shot with an AR-15.\n\nShortly after the debate finished, the O'Rourke campaign started selling a T-shirt with the sound bite on it.\n\n\"Hell yes, we're going to take your AR-15. Buy your shirt now:\"\n\nAfter El Paso shooting: O'Rourke offers plan to combat white supremacist violence\n\nHell yes, we're going to take your AR-15.\n\n\n\nBuy your shirt now: https://t.co/kEJxoLvfH5 pic.twitter.com/KKpAKX4IL8\n\n\n\n— Beto O'Rourke (@BetoORourke) September 13, 2019\n\nThis article originally appeared on USA TODAY: Democratic debate: Beto O'Rourke says he will confiscate AR-15, AK-47", "description": "O’Rourke said the weapons have to go when they’re being used against children. He described meeting a mother who watched her daughter bleed to death.", "authors": ["Maureen Groppe", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/q9u.UuCYv2Cqvyi6gHqBSQ--~B/aD0yNDI4O3c9MzY0MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/4cb607371765254c37cadc6158cc0085", "published_at": "2019-09-13"}