{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/dozens-flights-barcelona-cancelled-catalan-ruling-191015101614411.html", "downloaded_at": "2019-10-15 15:01:39.851484+00:00", "title": "Dozens of flights from Barcelona cancelled after Catalan ruling", "language": "en", "text": "Dozens of flights from Barcelona's airport have been cancelled or delayed, a day after massive protests and violent clashes in Spain's northeastern Catalonia region over the sentencing of nine Catalan separatist leaders.\n\nAt least 45 flights had to be scrapped on Tuesday, and many passengers had to spend the night at the airport after the protests on Monday led to many flight connections falling through.\n\nThousands of demonstrators gathered at Barcelona's El Prat airport in an attempt to block access roads and bring all operations to a standstill after Spain's Supreme Court sentenced nine of the 12 accused separatist leaders to between nine and 13 years in prison over their roles in a 2017 independence referendum.\n\n\"The majority of the 45 cancelled flights today [Tuesday] are actually derived from yesterday's cancellations, which affected 110 flights,\" a spokesman for Spanish airport operator Aena told Reuters news agency.\n\nHe said most of the protesters did not make it inside the terminal and that there was little infrastructural damage.\n\nThe spokesman said he was not able to provide an estimate of the economic effect or the number of passengers affected by the protests at this stage, as the airlines had not communicated flight fill rates with airport authorities.\n\nMeanwhile, more than 1,000 flights were scheduled to operate normally in Barcelona on Tuesday, Aena said.\n\n'Complete fraud'\n\nThe situation in the Catalan capital, Barcelona, was fairly quiet on Tuesday morning, though train traffic was still partially affected.\n\nAuthorities said three people were arrested and dozens, including police officers, were injured during clashes between protesters and baton-wielding anti-riot police at Barcelona's international airport and elsewhere across the northeastern Spanish region.\n\nThe clashes that started late on Monday stemmed from an online call by Tsunami Democratic, a loose grassroots group, following the Supreme Court ruling.\n\nThe sentencing came two years after the October 2017 referendum on whether to declare the Catalonia region an independent state.\n\n\"I think the conviction is really unfair and I don't understand how this can happen in the 21st century,\" Julia, a 20-year-old protester and student, told Al Jazeera.\n\nAnother protester, 25-year-old Marcar Roos, called the trial \"a complete fraud\".\n\n'We will not give up'\n\nOriol Junqueras, the Catalan regional government's former deputy leader, said the prison sentences imposed on him and eight others - on charges of sedition - only made them and their movement stronger and more determined.\n\nIn his first interview after the sentencing, Junqueras told Reuters that he and others planned to appeal the sentences at the European Court of Human Rights in Strasbourg.\n\n\"We will carry on and not give up because we never have and won't do it now,\" said Junqueras, who was slapped with the longest prison term - 13 years.\n\n\"Prison and exile have made us stronger and makes us even more convinced, if that is possible, in our profoundly democratic beliefs.\"\n\nAll defendants were acquitted of the gravest charge, rebellion. Three other defendants were found guilty only of disobedience and not sentenced to prison.", "description": "Barcelona's airport scraps and delays flights after clashes over prison terms for Catalan leaders injured dozens.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/15/12878729097e4e4ca9bc978cabfc8447_18.jpg", "published_at": "2019-10-15"}