{"pub": "foxnews", "url": "https://foxnews.com/auto/corrupt-politicians-exotic-cars-27-million", "downloaded_at": "2019-10-01 04:30:00.379895+00:00", "title": "Politician's exotic cars seized in corruption probe auctioned for $27 million", "language": "en", "text": "A politician's collection of 25 exotic cars seized in a corruption investigation were sold at a charity auction in Switzerland on Sunday by Bonhams for over $27 million.\n\nThe vehicles were seized in 2016 during a probe into money laundering and mismanagement of public assets by Teodoro Nguema Obiang Mangue. Nguema Obiang is a vice president Equatorial Guinea and son of the country’s president, Teodoro Obiang, who has held the office since leading a 1979 coup.\n\nAccording to a report by the World Bank’s Stolen Assets and Recovery Initiative, the government of Equatorial Guinea claimed the cars belonged to the state and had been shipped to Switzerland for repairs.\n\n'90210' STAR BRIAN AUSTIN GREEN SUED FOR ALLEGEDLY SELLING PHONY CLASSIC PORSCHE\n\nThe case was closed in February under rules that allow the person under investigation to repair the damage or do “everything that could have been expected of him or her to make up for the wrong that was caused.”\n\nThe car collection included several ultra-rare models and raked in more than twice the initial estimate of $13 million. Among them were a 2014 Lamborghini Veneno Roadster that sold for $8.4 million and set an auction record for the brand, a 2014 Koenigsegg One:1 that received a high bid of $4.6 million and a 2003 Ferrari Enzo that went for $3.1 million.\n\nAfter deducting the auction fees, $23.5 million will be donated by the State of Geneva to an independent charity set up to benefit the people of Equatorial Guinea.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM", "description": "Will benefit the people of Equatorial Guinea.", "authors": ["Gary Gastelu", "Gary Gastelu Is Foxnews.Com'S Automotive Editor. Follow Him"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/AU3.jpg", "published_at": "2019-09-30"}