{"pub": "afr", "url": "https://afr.com/world/north-america/damning-evidence-that-trump-withheld-ukraine-aid-for-leverage-20191023-p533fx", "downloaded_at": "2019-10-23 08:29:30.127837+00:00", "title": "Damning evidence that Trump withheld Ukraine aid for leverage", "language": "en", "text": "At stake was nearly $US400 million ($584 million) in support for Ukraine, which has lost more than 13,000 people in its war with Russia.\n\n\"More Ukrainians would undoubtedly die without the US assistance,\" Mr Taylor wrote, according to a copy of his statement obtained by The Washington Post.\n\nThe dramatic revelations came as Mr Trump likened the current impeachment process as a \"lynching\". His comparison with white supremecists' act of terror against black people drew immediate condemnation from across America's political spectrum.\n\nMr Taylor's description of how he learned of the pressure being brought to bear on Ukraine puts renewed pressure on Republicans, who have defended the President's actions, and raised fresh questions about whether the White House is taking the impeachment threat seriously.\n\nWhile polls suggest many Americans remain sceptical about the process, the evidence emerging from the Congressional hearings reinforces the idea that Mr Trump was holding up vital military aid to an American ally facing Russian aggression for personal political gain.\n\nSpeaking at the beginning of what would ultimately become almost 10 hours of testimony, Mr Taylor said Ambassador Sondland and Kurt Volker, a former US special envoy for Ukraine, had sought to explain Mr Trump's position as a \"businessman\".\n\n\"Ambassador Sondland tried to explain to me that President Trump is a businessman. When a businessman is about to sign a cheque to someone who owes him something, he said, the business asks that person to pay up before signing the cheque,\" Mr Taylor said. Volker made the same argument.\n\nAdvertisement\n\n\"I argued to both of them that the explanation made no sense: the Ukrainians did not 'owe' President Trump anything, and holding up security assistance for domestic gain was 'crazy', as I had said in my text message to Ambassadors Sondland and Volker on September 9,\" he said.\n\nRepublicans sought to attack the process behind Mr Taylor's testimony, saying that Democrats had forced the hearing behind closed doors to avoid public scrutiny of their cross examination.\n\nDemocrats expressed shock at the ambassador's evidence.\n\n\"This testimony is a sea change. I think it could accelerate matters,\" said Massachusetts House Democrat Stephen Lynch. \"This will, I think, answers more questions than it raises. Let's put it that way.\"\n\nDespite Wednesay's evidence, impeachment remains unlikely because it would require 20 Republican senators to drop their until-now bedrock support for Mr Trump.\n\nMr Taylor was chosen in May by Secretary of State Mike Pompeo to take over from a former ambassador to Kiev.", "description": "America's top diplomat in Ukraine has delivered a barrage of damning evidence that President Donald Trump put pressure on a foreign nation to dig dirt on his political rivals.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.4656%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_51/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/f7a1fdd8f232abd47ce5cfedc426d16d95559103", "published_at": "2019-10-23"}