{"pub": "bbc", "url": "https://bbc.co.uk/news/entertainment-arts-49738053", "downloaded_at": "2019-09-18 10:38:55.244182+00:00", "title": "Nick Carter gets restraining order against brother Aaron", "language": "en", "text": "Image copyright Getty Images Image caption Nick Carter (left) with brother Aaron in 2006\n\nBackstreet Boy Nick Carter has been granted a temporary restraining order against younger brother Aaron after alleging he threatened to kill Nick's pregnant wife.\n\nThe singer, 39, said the legal move came \"in light of Aaron's increasingly alarming behaviour\".\n\nAaron, 31, must now stay at least 100 feet (30 metres) away from Nick, his family and their Las Vegas home.\n\nIn response, Aaron Carter said he was \"astounded\" by the accusations.\n\n\"I do not wish harm to anyone, especially my family,\" he went on.\n\n'Careful consideration'\n\n\"After careful consideration, my sister Angel and I regret that we were required to seek a restraining order against our brother Aaron,\" Nick Carter said on Tuesday.\n\n\"In light of Aaron's increasingly alarming behaviour and his recent confessions that he harbours thoughts and intentions of killing my pregnant wife and unborn child, we were left with no choice but to take every measure possible to protect ourselves and our family.\n\n\"We love our brother and truly hope he gets the proper treatment he needs before any harm comes to himself or anyone else,\" Carter continued.\n\nImage caption Nick Carter (far right) still performs with his fellow Backstreet Boys\n\nAaron, who rose to fame in the late 1990s as a child singer, acknowledged the restraining order on social media but denied the allegations of threatening behaviour.\n\n\"Take care Nick Carter. We're done for life,\" said the singer, who has a history of drug convictions and mental health issues.\n\nOn a recent episode of US TV show The Doctors, Aaron said he suffered from multiple personality disorder, schizophrenia, acute anxiety and manic depression.\n\nHe later said he did not have any mental health issues and claimed the show had been edited to make it look as if he did, which the show's producers denied.\n\nNick Carter, whose band had hits with such songs as Everybody and I Want It That Way, announced in May that he and wife Lauren were expecting their second child.\n\nLast year it was decided the older Carter sibling would not be charged over a sexual assault accusation from 2003.\n\nFollow us on Facebook, or on Twitter @BBCNewsEnts. If you have a story suggestion email entertainment.news@bbc.co.uk.", "description": "The Backstreet Boys singer accuses younger sibling Aaron of \"increasingly alarming behaviour\".", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/7A3E/production/_108849213_cartersgetty.jpg", "published_at": "2019-09-18"}