{"pub": "nationalreview", "url": "https://catholicworldreport.com/2019/10/01/michigan-governor-axes-funding-for-pregnancy-parenting-support", "downloaded_at": "2019-10-07 20:11:13.369071+00:00", "title": "Michigan governor axes funding for pregnancy, parenting support", "language": "en", "text": "Lansing, Mich., Oct 1, 2019 / 06:34 pm (CNA).- Democratic Governor Gretchen Whitmer has line-item vetoed from the state’s budget $700,000 in funding for the Michigan Pregnancy and Parenting Support Services Program, to the consternation of the Michigan Catholic Conference and a pro-life group active in the state.\n\n“The process that led to these vetoes has been disappointing,” said Tom Hickson, Michigan Catholic Conference (MCC) vice president for public policy.\n\n“It is the hope of this organization that in forthcoming negotiations the Governor and legislature can work together to restore this critical funding.”\n\nThe funding in the Michigan budget for pregnancy and parenting support went to Real Alternatives, a Pennsylvania-based nonprofit that has since 1996 provided counseling for pregnant woman on alternatives to abortion, as well as material help such as baby formula and diapers to mothers up to 12 months after they give birth.\n\nThe program expanded its operations to Michigan beginning in June 2014, working mainly through local Catholic Charities affiliates, with the backing of the Michigan Catholic Conference.\n\nAccording to Real Alternatives’ estimates, the Michigan program has served 8,240 women at 31,958 support visits since 2014. The state has appropriated $3.3 million to the program since its inception.\n\n“This year the Democratic governor of Pennsylvania allocated $7.3 million in funding for the same program in that state; Governor Whitmer’s line-item veto of a meager $700,000 will have a negative impact on low-income women in Michigan and should have been avoided,” said MCC’s Policy Advocate Rebecca Mastee.\n\n“Women deserve better than this veto, and we look forward to working with lawmakers on both sides of the aisle to reinsert this funding into the state budget.”\n\nWhitmer issued 147 line-item vetoes Oct. 1, amounting to nearly $1 billion in cuts to the budget she received from the Republican-controlled legislature, mlive.com reported.\n\nReal Alternatives’ founding CEO Kevin Bagatta told CNA in August that if a woman is alone and poor, she may struggle with the pressures of an unexpected pregnancy. What the Real Alternatives program does is provide a counselor, who helps the woman from conception until 12 months after the baby’s birth, training her how to take care of the baby and herself.\n\nHe noted that it is primarily a counseling program, not a medical program, although the program offers referrals for medical needs, and saves the state of Michigan money that it might have otherwise spent on additional medical care for pregnant women.\n\n“Real Alternatives is perplexed to hear…that against the wishes of Michiganders, Governor Whitmer has line item vetoed the successful Michigan Pregnancy and Parenting Support Services Program,” Bagatta said in an Oct. 1 statement.\n\n“Not only did Michiganders reach-out to their fellow citizens in need through the program, but it also saved taxpayer monies.”\n\nBagatta told CNA that research done in the 1980s found that about 80% of surveyed women who had procured an abortion said that they would not have gone through with the procedure if just one person had taken the time to help them.\n\nToday, Real Alternatives runs the Indiana, Pennsylvania, and Michigan programs from their base in Harrisburg. They helped to start a similar program in Texas.\n\nIn 2013, the Michigan Catholic Conference asked Real Alternatives to help to explain the program to then-Governor Rick Snyder, who put money in the budget to start the state’s program.\n\nCatholic Charities affiliates in the various states are staffed with licensed social workers and trained counselors.\n\nUnder the George W. Bush administration, the program was accepted as meeting the requirements to use Temporary Assistance for Needy Families (TANF) money from the federal government, which states may use as they see fit. This means many of the state programs are funded with federal dollars; Pennsylvania’s program, like Michigan’s, also is funded by some state revenue. Usually the program is accepted in a state with a pro-life governor, Bagatta said.\n\n“Every state gets TANF money. So if you’re a pro-life governor, you can have this program and use your TANF money to do a program like [this],” he explained.\n\nCatholic Charities affiliates are able to dedicate staff specifically for this program as a result of the funding received, Bagatta said, and the funding model provides an incentive for the centers to serve more clients and open specific pregnancy resource programs.\n\nDavid Maluchnik, communications vice president for the MCC, reiterated in August that Real Alternatives provides needed care for women who would otherwise choose abortion.\n\n“[The program] not only provides support and care, it provides formula and [referrals for] pre- and post-natal meds; it gets clothing and shelter to mom and baby where there may otherwise be none; it helps with parenting tips when there’s no one to talk to; it offsets threats to infant mortality and gives young children and mothers a healthy start and a brighter future.”\n\n“In the end, pulling the rug from under low-income women and her unborn or infant child at a time when they’re most vulnerable would constitute a heartless, calculated political maneuver,” he said.", "description": "", "authors": ["Peter D. Beaulieu", "Popes", "Antipopes", "Prophet Weekly", "Joe M", "Peter D. Beaulieu On", "Joe M On", "Gregb On", "Timothy J. Williams On"], "top_image": "https://www.catholicnewsagency.com/images/GettyImages_974429728.jpg?w=600", "published_at": "2019-10-01"}