{"pub": "yahoo", "url": "https://news.yahoo.com/donald-trumps-phony-emoluments-clause-211813238.html", "downloaded_at": "2019-10-22 13:32:14.630525+00:00", "title": "Donald Trump's “Phony” Emoluments Clause Is Real, and He's Probably Already Violating It", "language": "en", "text": "Last week, Donald Trump announced that the United States would host next year's G-7 summit of world leaders at Doral—a Miami golf resort that his company, the Trump Organization, just happens to own. After a critical backlash in which even some Republicans expressed reservations with the president's decision to use American diplomacy to line his pockets, however, Trump changed his mind two days later, casting about for someone to blame for this public relations disaster of his own creation. \"I thought I was doing something very good for our Country,\" he fumed on Twitter. \"But as usual, the Hostile Media and their Democrat Partners went CRAZY!\"\n\nOn Monday, he continued this master class in crisis management by denying the existence of part of the United States Constitution, a document which he took an oath to preserve, protect, and defend some two-and-a-half years ago. \"You people with this phony Emoluments Clause,\" he said to reporters, shortly after expressing irritation that he is no longer running his real estate business while serving as President of the United States, and shortly before alleging—several times—that entering politics cost him \"between $2 [billion] to $5 billion.\"\n\nThe Emoluments Clause, of course, is not \"phony.\" It is, instead, Article I, Section 9 of the Constitution, and it prohibits federal officeholders from accepting \"any present, Emolument, Office, or Title\" from \"any King, Prince, or foreign State\" without first obtaining congressional approval. The purpose of the rule is to prevent officials from taking anything that might be construed as a bribe from a foreign country, thereby dividing the president's loyalties as they conduct official business. (An \"emolument\" is an archaic term that broadly refers to compensation or advantage of any kind.) A related constitutional provision, Article II, Section 1 states that the president may receive only a salary during their White House tenure, and \"shall not receive within that Period any other Emolument from the United States,\" or from any individual state. Or, in plain English, presidents cannot accept anything of value for their work other than their congressionally-appropriated paycheck.\n\nFor some GOP lawmakers, Trump routing the leaders of seven global economic powerhouses, along with their security details, aides, and entourages, to spend money at a resort was too obviously a potential violation office the Foreign Emoluments Clause. \"I didn't see it being a big negative, but it certainly wasn't a positive,\" New York congressman Peter King told the New York Times over the weekend. Idaho representative Mike Simpson called the move \"politically insensitive,\" and expressed frustration to the Washington Post with the White House's failure to anticipate the blowback. To the extent that the federal government would incur expenses at Doral—hotel expenses for Trump's staff, for example, or for members of the U.S. Secret Service—hosting the G-7 summit there might violate the Domestic Emoluments Clause, too.\n\nThe Doral dust-up is just one of many potential Emoluments Clause violations that Trump has cheerfully ignored since taking office. All told, Citizens for Responsibility and Ethics in Washington, a nonprofit government watchdog group and one of several organizations currently suing Trump for alleged violations of these prohibitions, says it has catalogued more than 2,500 of his conflicts of interest. Shortly before his inauguration, Trump rejected calls to divest from his businesses and place his assets in a blind trust, instead turning over control of the Trump Organization to his two eldest sons, Don Jr. and Eric. Even this, Trump opined, might have been an unnecessarily punitive method of pacifying his critics. \"I could actually run my business and run government at the same time,\" he told reporters in January 2017. \"I don’t like the way that looks, but I would be able to do that if I wanted to. I would be the only one to be able to do that.\"\n\nAt the same press conference, Trump tax attorney Sheri Dillon attempted to head off Emoluments Clause troubles for her client, asserting that it does not cover \"routine business transactions\" or \"fair value exchanges that have absolutely nothing to do with an officeholder.\" This is a baffling position that ignores the obvious possibility that foreign leaders seeking to curry Trump's favor, fully aware of what buildings the Trump Organization does and does not own, might be motivated to spend money at his properties instead of patronizing some other business. During Trump's infamous phone call with Ukrainian president Volodymyr Zelensky this past summer, Zelensky took care to inform his counterpart that he stayed at a Trump-branded building during his most recent trip to New York City.", "description": "The president is very upset about the existence of the Constitution.", "authors": ["Jay Willis"], "top_image": "https://s.yimg.com/uu/api/res/1.2/j35bD2ZSDJl8lohZg_KYYw--~B/aD00MTQ4O3c9NjIyMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/gq_402/0d38d6a7754e8c1b800a38f67d506c6d", "published_at": "2019-10-21"}