{"pub": "yahoo", "url": "https://news.yahoo.com/germanys-far-afd-hopes-gains-eastern-heartland-023740433.html", "downloaded_at": "2019-10-27 04:06:36.971725+00:00", "title": "Germany's far-right AfD hopes for gains in eastern heartland", "language": "en", "text": "Bjoern Hoecke, a hardline nationalist who is local head of the Alternative for Germany (AfD) party, is tipped to do well in Thuringia regional elections (AFP Photo/Christof STACHE)\n\nErfurt (Germany) (AFP) - Germany's far-right AfD hopes for more gains in the ex-communist east on Sunday when voters go to the polls in the state of Thuringia, even as the party comes under pressure in the wake of a deadly shooting at a synagogue.\n\nWhile popular premier Bodo Ramelow of the far-left Die Linke party is expected to retain the top spot, one of the AfD's most radical figures is leading its battle for second place with Chancellor Angela Merkel's centre-right Christian Democrats (CDU).\n\nThe campaign has been marked by anger, threats and bitter recriminations, with CDU candidate Mike Mohring labelling the AfD's local leader, the nationalist hardliner Bjoern Hoecke, a \"Nazi\".\n\nAs in other parts of east Germany, which is marking the fall of the Berlin Wall 30 years ago, the anti-immigrant AfD -- short for \"Alternative for Germany\" -- expects strong gains, with polls suggesting it will at least double the 10.6 percent it scored in 2014.\n\nOpinion surveys, however, suggest support for the AfD has softened slightly in the wake of an October 9 attack in the eastern city of Halle, in which a suspected neo-Nazi shot dead two people, having tried and failed to storm a packed synagogue on the Jewish holy day of Yom Kippur.\n\nA poll on Thursday by public broadcaster ZDF gave Die Linke 28 percent, followed by the CDU at 26 percent and the AfD at 21 percent, with all other groups scoring below 10 percent.\n\nIn the eastern states of Saxony and Brandenburg last month, the AfD surged to become the second-largest force, although in both cases the mainstream parties kept a pact not to enter into government with the AfD.\n\n- 'Nothing but outrage' -\n\nWith a population of just over two million people, and a similar agreement between parties not to govern with the AfD, Thuringia's election is unlikely to cause any political earthquakes in Berlin.\n\nBut the vote is being closely watched as a snapshot of the mood in the AfD heartland, especially given the role of Hoecke, a former history teacher considered extreme even within the AfD.\n\nHoecke, 47, has in the past labelled Berlin's Holocaust memorial a \"monument of shame\" and called for a \"180-degree shift\" in Germany's remembrance culture and atonement for the crimes against humanity committed by the Nazi regime.\n\nLast month, Hoecke stormed out of a television interview after some of his statements were likened to those of Adolf Hitler, complaining later that the media had cast him as \"the devil of the nation\".\n\nThe CDU's Mohring ramped up the rhetoric at a recent town hall event in Erfurt when he said: \"To me, Hoecke is a Nazi.\"\n\nWith tensions running high on the campaign trail, police are also investigating death threats against Mohring and Greens co-leader Robert Habeck.\n\nMohring said he had received messages from neo-Nazis threatening him with the same fate as pro-migrant CDU official Walter Luebcke, who was shot dead last June in a suspected far-right murder.\n\n\"Hatred must not be allowed to win,\" Mohring told Bild. \"We have to stick together and hold the line against the right and against Nazis.\"\n\nPolice are also investigating an arson attack on an AfD campaign truck at the weekend, saying they \"cannot rule out a political motive\".\n\nThe AfD started out as a eurosceptic fringe party before reinventing itself as an anti-Islam, anti-refugee party to capitalise on anger over an influx of asylum seekers in 2015.\n\nIt is now the country's largest opposition party in the federal parliament.\n\nIts populist message has resonated strongest with voters in Germany's former communist east where resentment lingers over lower wages and fewer job opportunities.\n\nRamelow on Friday charged that \"the AfD claims to be the party that cares. But in reality, it is a party that knows nothing but outrage\".", "description": "Germany's far-right AfD hopes for more gains in the ex-communist east on Sunday when voters go to the polls in the state of Thuringia, even as the party comes under pressure in the wake of a deadly shooting at a synagogue.  While popular premier Bodo Ramelow of the far-left Die Linke party is expected", "authors": ["Julien Gathelier With Frank Zeller In Berlin"], "top_image": "https://s.yimg.com/uu/api/res/1.2/gKvAA05MKWbDFK3z4xLznA--~B/aD00OTg7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/ab0517512a91788f068a69a90b390fbbf46bf933.jpg", "published_at": "2019-10-27"}