{"pub": "businessinsider", "url": "https://pedestrian.tv/music/harry-styles-lights-up-new-single-2019", "downloaded_at": "2019-10-11 05:11:49.522668+00:00", "title": "Harry Styles Just Dropped A New Track Outta Nowhere And Folks, He’s Horny AF", "language": "en", "text": "Well, happy bloody Friday you lot. Harry Styles has fully blessed our Good Day with brand new music from his hotly-anticipated second album.\n\nYep, Harry Styles is back and he really needs you to know that he definitely fucks now.\n\nThe last 24hrs in Harry Styles‘ contributions to the world have been like a whirlwind romance. First, he gave us all compliments and pearls of wisdom through his website.\n\nThen he turned the Internet onto Full Horn with a no-context sweaty chest pic.\n\nAnd then there was the shirtless, dark-and-broody pic with the text ‘Lights Up’.\n\nNow: this.\n\nA FULL FKN HARRY STYLES ORGY THIS IS NOT A DRILL.\n\nA WHOLE SWATHE OF SWEATY BODIES WRITHING TOGETHER IN A LEVEL OF HUMIDITY THAT I’M NOT SURE HIS PRECIOUS BRITISH BONES ARE EQUIPPED FOR BUT I’M INTO IT ANYWAY.\n\nBoy howdy this is a lot.\n\nIt’s been two whole years since Styles dropped his self-titled solo record, and since then he’s explored his identity and image, turning out look, after look, after look.\n\nREAD MORE Harry Styles Talks Sexuality, Solos And Shrooms In Bumper Rolling Stone Profile\n\nA hot minute ago, some very keen eyes spotted the 25-year-old looking very suspiciously like he was shooting a film clip in Mexico, and now he has bared the fruits of his labours, and hoo boy they’re ripe.\n\n‘Lights Up’ looks to be the first single from his incoming sophomore record Do You Know Who You Are? which is yet to get a release date, but we’ll keep you updated there.\n\nThe song itself is a catchy banger, with Styles crooning in a higher register about stepping into the light and never going back, questioning that if everyone else knows who you are, do you know who you are?\n\nLights Up also feels like it’s got Styles’ classic guitar and piano that we’ve grown to love in his solo career, but with a beat-heavy pivot toward something a bit more hot and heavy. With a bassline that feels like it’s straight from a Latin RnB track, we’re hearing Styles explore how his voice fits in with styles of music outside of indie rock.\n\nSorry I just need to go back and rewatch that video again, and then take a cold shower and a walk around the block. It’s a LOT and I am extremely here for this era of Harry Styles.\n\nOnce more, for posterity:", "description": "Harry Styles has given us a first taste of his next solo record with 'Lights Up', including him on the the middle of a sweaty, writhing orgy of bodies.", "authors": ["Courtney Fry"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/10/harry-styles-lights-up-fb.jpg", "published_at": "2019-10-11"}