{"pub": "marketwatch", "url": "https://marketwatch.com/story/the-ecbs-challenge-pushing-rates-further-into-negative-territory-without-wrecking-eurozone-banks-2019-09-10", "downloaded_at": "2019-09-12 07:15:48.517375+00:00", "title": "The ECB’s challenge: Pushing rates further into negative territory without wrecking eurozone banks", "language": "en", "text": "The European Central Bank is widely expected to push its deposit rate further into negative territory Thursday, but the move comes as investors, economists and policy makers worry that the move could take a further toll on the region’s battered banking sector.\n\nAfter all, the negative rate means banks must pay for the privilege of parking excess reserves at the central bank.\n\nThe worry for policy makers is that a further hit to the banking sector’s profitability would add to worries over financial stability while also limiting the ability of banks to provide new loans to the real economy.\n\nIn other words, further rate cuts could become counterproductive, effectively serving to tighten financial conditions in the eurozone, noted analysts at Rabobank, in a note.\n\nThe Stoxx Europe 600/ex-U.K. Banks Index 184275, +0.14% has rallied 6.8% in September but is down 2.6% for the year to date and is off 18.8% over the last 12 months. That’s compared with a 14.3% year-to-date rise for the pan-European Stoxx 600 Europe Index SXXP, +0.21%, which is up 3.3% over the last 12 months. The S&P 500 SPX, +0.72% is up 18.7% year-to-date and 3.6% over the last year.\n\nSo with that in mind, the ECB is also expected to take steps aimed at easing the pain. In particular, policy makers have indicated the ECB could introduce a tiered system of deposits, which would see only a portion of deposits subject to negative rates.\n\nBut such a system would be complicated and would carry risks of its own. Here’s a quick guide to what is being discussed:\n\nWhat is the deposit rate?\n\nThe ECB’s deposit rate stands at -0.4%. That means banks that park reserves overnight pay a 0.4% annual rate for the privilege. The ECB’s past stimulus measures and other accommodative policies have left the eurozone flooded with massive excess liquidity — or liquidity in excess of that needed to meet short-term obligations. As noted by Luca Cazzulani, deputy head of fixed-income strategy at Milan-based UniCredit Bank, that excess liquidity has pushed money-market rates toward the deposit rate, making it the ECB’s effective policy rate.\n\nFor the ECB, the key question centers on the minimum amount of excess liquidity that is needed to keep money-market rates anchored to the deposit rate, Cazzulani said in a note earlier this month. Having banks pay the deposit rate beyond that amount is unnecessary and painful.\n\nWhat’s the ECB expected to do?\n\nEconomists look for the ECB to cut its deposit rate by 10 to 20 basis points. The jury is out on whether the ECB will also move to launch another round of asset purchases. A previous program of monthly bond buys came to an end in December.\n\nExpectations for a combination of rate cuts and renewed asset-buying were dented in recent weeks as some ECB policy makers appeared to push back against indications from fellow officials that an aggressive program was on the cards for September.\n\nWhat is tiering?\n\nThe ECB isn’t alone in pushing official interest rates into negative territory or in worrying about the effect that move has on the banking sector. Central banks in Switzerland, Japan and elsewhere have adopted tiering systems of various designs. Switzerland, for example, exempts bans from paying negative rates on up to 20 times the reserve requirement, while Japan uses a three-tiered program, in which only a fraction of reserves are charged negative rates, Cazzulani noted.\n\nThe ECB’s task is made more complicated by the region’s 19-nation banking system and the uneven distribution of excess liquidity across the eurozone, economists said, noting differences in ratios of total reserves/required reserves.\n\nWhat are the ECB’s options?\n\nEconomists largely expect the ECB to adopt a two-tiered system.\n\nThe Rabobank analysts described two options: The central bank could introduce a new, lower deposit facility for “‘excess’ excess liquidity,” or it could introduce a “reserves allowance” that comes on top of existing required reserves, with the balance remunerated at the refinancing rate of 0%, the same as required reserves.\n\nIn the first option, the lower deposit rate would apply only to excess reserves above a certain threshold, while all excess reserves below the threshold would still be charged the current -0.4% rate.\n\nThe second option, in which a certain amount of reserves in addition to required reserves are charged at the 0% refinancing rate, may be more appealing, they said, as it would allow the ECB to cut rates further without any additional costs for the banking sector. To make it work, however, the allowance would need to be quite large, the Rabobank economists said, estimating that with excess liquidity seen at around €1.8 trillion ($1.99 trillion), the ECB would need to create an allowance worth around €800 billion to fully offset another 40 basis points of deposit rate cuts.\n\nWhat would it say about future policy?\n\nA tiered system would also see the ECB push back against the idea that it’s ability to drive rates further into negative territory is constrained, but it won’t fully dispel worries about the region’s banking sector.\n\n“If implemented, tiering may weaken the perception of a floor in policy rates, leaving the door open to pricing several rate cuts if necessary,” wrote Cazzulani. “However, while tiering may address direct costs that negative rates have on banks, the ECB would still have to consider the indirect effects that progressively lower rates have on banks (namely a flat curve in a low yield environment).”", "description": "The European Central Bank is widely expected to push its deposit rate further into negative territory Thursday, but the move comes as investors, economists...", "authors": ["William Watts", "Deputy Markets Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ963_ecb_hq_ZG_20190909152846.jpg", "published_at": "2019-09-10"}