{"pub": "reuters", "url": "https://in.reuters.com/article/uk-japan-politics/japan-trade-minister-resigns-amid-melon-donations-scandal-idINKBN1X32U3", "downloaded_at": "2019-10-25 01:48:46.482103+00:00", "title": "Japan trade minister resigns amid melon donations scandal", "language": "en", "text": "TOKYO (Reuters) - Japanese Trade Minister Isshu Sugawara resigned on Friday, following accusations of election law violations just a month after taking up the key post charged with handling a trade dispute with neighbouring South Korea.\n\nFILE PHOTO: Japan's Economy, Trade and Industry Minister Isshu Sugawara attends a news conference at Prime Minister Shinzo Abe's official residence in Tokyo, Japan September 11, 2019. REUTERS/Issei Kato\n\nPrime Minister Shinzo Abe said he had accepted Sugawara’s resignation and asked Hiroshi Kajiyama to take the helm at the Ministry of Economy, Trade and Industry.\n\n“I bear responsibility for his appointment and I deeply apologise to the people of Japan for this result,” Abe told reporters at his office.\n\nSugawara had been under pressure after media said he had given gifts to voters in his Tokyo constituency, such as expensive melons and crabs, and offered condolence money to the family of a supporter, in possible violations of campaign law.\n\nSugawara needed to provide an explanation, Chief Cabinet Secretary Yoshihide Suga had said the previous day.\n\n“I don’t want my problems to slow down parliament deliberations,” Sugawara told reporters on Friday in explaining his resignation.\n\nKajiyama, who will lead trade talks with Seoul should he accept the appointment, previously held a post in Abe’s cabinet as minister in charge of revitalising local economies.\n\nJapan and South Korea have been locked in a bitter trade dispute since Tokyo this year tightened export controls on materials vital for South Korean chipmakers, and then dropped Seoul from a list of countries eligible for fast-track exports.\n\nThe moves were seen in part as retaliation after South Korea’s top court last October ordered some Japanese firms to compensate Koreans forced to work in their wartime mines and factories.\n\nAbe and South Korean Prime Minister Lee Nak-yon met on Thursday and agreed on the importance of cooperating on North Korea and other issues, seeking to rebuild relations amid the feud over history and trade.", "description": "Japanese Trade Minister Isshu Sugawara resigned on Friday, following accusations of election law violations just a month after taking up the key post charged with handling a trade dispute with neighbouring South Korea.", "authors": ["Chris Gallagher", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191025&t=2&i=1444689948&w=1200&r=LYNXMPEF9O01H", "published_at": "2019-10-25"}