{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/best-rewards-credit-cards-by-spending-category", "downloaded_at": "2019-10-13 18:49:04.189720+00:00", "title": "How to pick the right credit card to maximize rewards where you spend the most", "language": "en", "text": "The right card (or cards) for you depends on what types of purchases you make the most. AP/Luis Hidalgo\n\nBeyond earning points, miles, or cash back through a credit card sign-up bonus, one of the easiest ways to rack up rewards is to use a credit card that offers bonus rewards for your most frequent purchases.\n\nFor example, if you spend a lot on dining, you'll want a card that earns bonus points when you eat out, like the Chase Sapphire Reserve or the American Express® Gold Card.\n\nWe'll walk you through the best credit cards for earning rewards dining, groceries, gas, and travel, as well as the best cards for maximizing purchases that don't fall under a popular bonus category.\n\nRead more personal finance coverage.\n\nYou banked the big credit card sign-up bonus, took your dream vacation and now you're excited to do it all over again. Except this time, you want to maximize the rewards credit cards you already have and focus on earning more points and miles on your daily spending.\n\nLuckily, there are lots of rewards credit cards that pay out more than the standard 1 point per dollar spent. If you're looking to maximize rewards on your everyday spending, look no further than the following credit cards. We'll break it down by spending category — from dining to gas to groceries.\n\nKeep in mind that we're focusing on the rewards and perks that make these credit cards great options, not things like interest rates and late fees, which can far outweigh the value of any rewards.\n\nWhen you're working to earn credit card rewards, it's important to practice financial discipline, like paying your balances off in full each month, making payments on time, and not spending more than you can afford to pay back. Basically, treat your credit card like a debit card.\n\nRead more: The best credit card sign-up bonuses available now\n\nDining\n\nWith the average American spending $3,424 on dining between 2017 and 2018, this is a category most people will want to maximize. Luckily, lots of cards offer generous rewards on dining.\n\nThe Citi Prestige® Card offers the highest return on dining spending, with 5x points on these purchases. You may notice that some cards, like the Hilton cards below, offer more than 5x points — but keep in mind that the points multiplier is only half of the equation.\n\nYou also need to know how much each point is worth. We recommend using The Points Guy's valuations to get a sense of how many cents you'll get in value with different loyalty currencies. These valuations are based on all the different ways you can use a given type of points or miles, from redeeming them as statement credits to transferring them to a travel partner to book a flight.\n\nBelow, we'll rank the best credit cards for dining in order of highest to lowest return based on how many rewards you earn per dollar spent, and the value of those rewards based on TPG's estimations.\n\nCredit cards with the best bonuses for dining\n\nRead more: My 5 favorite credit cards for earning rewards on dining out, no matter how much you spend\n\nBased on the numbers, the Citi Prestige is the most rewarding card for dining purchases. But the Amex Gold card or the Chase Sapphire Reserve could be a better option for you if you prefer to earn Amex or Chase points. Citi ThankYou points can be transferred to 14 airline transfer partners including Cathay Pacific, JetBlue, and Virgin Atlantic, but Amex and Chase's loyalty programs partner with airlines and hotels that are arguably more useful for many US-based travelers, such as British Airways, Delta, and Marriott with Amex and Hyatt, United, and Southwest with Chase. In fact, The Points Guy values Citi points (1.7 cents per point) a bit lower than Amex and Chase points (2 cents each)\n\nGas\n\nIf you have a car, gas is a big spending category — and it's one that many cash-back cards pay out big rewards on.\n\nAmerican Express® Business Gold Card: 4 points per dollar spent at the two categories where you spend the most each month, including US gas stations, on up to $150,000 per calendar year, then 1 point per dollar (8% return on spending)\n\nCiti Premier℠ Card: 3 points per dollar spent on travel, including gas stations (5.2% return on spending)\n\nCostco Anywhere Visa: 4% gas stations on the first $7,000 spent per year, then 1% (4% return on spending)\n\nHilton Honors American Express Surpass Card: 6 points per dollar spent at US gas stations (3.6% return on spending)\n\nRead more: The 7 best credit cards for getting maximum points or cash back on your gas purchases\n\nAgain, not all points are created equal, and whether 6 Hilton points is equivalent (or higher than) 4% cash back or 4 Membership Rewards points depends on how you redeem your rewards. Most people will be best off going with the Amex Business Gold card for gas rewards.\n\nThanks to a vast list of hotel and airline transfer partners, you can redeem Membership Rewards points for some incredible travel experiences. If you have a business-class trip to Europe in mind, Membership Rewards transfer partner All Nippon Airways (ANA) offers one of the best deals out there at 88,000 miles round-trip.\n\nHowever, if you're saving up your Hilton points for a high-end resort in the Maldives, it could be worth channeling gas spending toward the Hilton Honors Surpass card.\n\nRead more: Amex Business Gold card review\n\nGroceries\n\nAmerican Express Gold Card: 4x points at US supermarkets, on up to $25,000 per year (then 1x point; 1%-8% return on spending)\n\nBlue Cash Preferred® Card from American Express: 6% cash back at supermarkets on up to $6,000 spent per year (then 1%; 1%-6% return on spending)\n\nHilton Honors American Express Surpass card: 6 points per dollar spent at US supermarkets (3.6% return on spending)\n\nBlue Cash Everyday® Credit Card from American Express: 3% cash back at supermarkets on up to $6,000 spent per year (then 1%; 1%-3% return on spending)\n\nWith 4x points on the first $25,000 spent each year at US supermarkets, the Amex Gold card offers the most generous payout on grocery spending. Considering the average US household spends $4,445 on groceries per year, these limits shouldn't be problematic for most consumers.\n\nEarning 6% cash back on the first $6,000 spent, the Blue Cash Preferred card is a good option if you prefer cash back to rewards points. When maxed out, the 6% back equates to $360 cash back, which is enough for most people to book at least a couple of hotel nights or a round-trip transcontinental flight.\n\nRead more: What a year of grocery spending could earn you with 3 popular credit cards\n\nFlights and other travel\n\nThe Platinum Card® from American Express: 5 points per dollar on flights booked directly with airlines or with amextravel.com, 5 Membership Rewards points on prepaid hotels booked on amextravel.com (10% return on spending)\n\nChase Sapphire Reserve: 3 points per dollar spent on travel (6% return on spending)\n\nAmerican Express Gold card: 3 points per dollar on flights booked directly with airlines or on amextravel.com (6% return on spending)\n\nCiti Prestige: 5 points on air travel, 3 points on hotels and cruise lines (5.1%-8.5% return on spending)\n\nCiti Premier card: 3 points on travel including gas stations (5.1% return on spending)\n\nUber Visa card: 3% cash back back on airfare, hotels and vacation home rentals\n\nCostco Anywhere Visa: 3% cash back on travel worldwide\n\nIf you're looking for lots of rewards for flights, the Amex Platinum card is a great choice. The card earns 5x points on flights booked directly with airlines and one amextravel.com. Prepaid hotel bookings made with American Express also earn 5 points. One reason I'd recommend this card over the Citi Prestige is that the Amex Platinum will soon gain valuable travel protections like trip delay insurance, while Citi has mostly done away with these on its cards. The Platinum card also has no foreign transaction fees, meaning you can use it to earn cash back abroad without paying a 3% fee.\n\nWhile the American Express Platinum is a great option, not everyone will get enough value out of the 5x bonus categories to justify the $550 annual fee. The Chase Sapphire Reserve is a great alternative. While it earns a lower 3 points per dollar spent, this bonus applies to all travel purchases, not just flights. Plus, the card's $450 annual fee is largely offset by the $300 travel credit. Unlike American Express, Chase doesn't restrict its travel credit to a specific airline. The credit automatically applies to any purchases coded as travel. That's why the Chase Sapphire Reserve is such a popular card for earning and redeeming travel rewards.\n\nAll other spending\n\nChase Freedom Unlimited: 1.5% cash back on everything, can be combined with Chase Ultimate Rewards cards to boost your value (1.5%-3%)\n\nChase Freedom: 1% cash back, 5% rotating quarterly category bonuses for up to $1,500 in combined spending (requires activation), can be combined with Chase Ultimate Rewards cards to boost your value (1.5%-3%) (1%-10% return on spending)\n\nDiscover it® Miles: 1.5 miles per dollar spent, and Discover will match all your cash back at the end of the first year (3% return on spending)\n\nDiscover it® Cash Back: 1% cash back, 5% category bonuses when you activate (1-5% return on spending)\n\nCiti® Double Cash Card: 1% when you make purchases, 1% as you pay (2%-3.4% return on spending)\n\nUber Visa card: 2% back on online purchases (1-2% return on spending)\n\nLots of cash-back credit cards offer at least 1.5% cash back on everything, which is a great benchmark to keep in mind on purchases that aren't eligible for bonus points. The Discover it Miles a great option for those looking for a no-annual-fee card with accelerated earning power. Cardholders earn 1.5 miles per dollar spent, which is equivalent to 1.5% cash back. Points are doubled the first year and can be redeemed for statement credits toward travel purchases or transferred to your bank account.\n\nFor those looking to maximize long-term earnings, the Chase Freedom Unlimited is another great option. It earns 1.5% cash back on everything. If you have an Ultimate Rewards-earning credit card like the Chase Sapphire Preferred Card or the Sapphire Reserve, you can convert your Freedom Unlimited cash back to Ultimate Rewards points. Essentially, you could earn 1.5 Ultimate Rewards points per dollar spent on everything, which equals a very solid 3% return on every dollar you spend.\n\nIf you want the flexibility of earning occasional category bonuses, the Chase Freedom and Discover it Cash Back are worth considering. Both cards earn 1% cash back along with 5% on select category bonuses. Bonus categories rotate every quarter and cardholders can earn 5% cash back on up to $1,500 worth of spending when they activate the bonus each quarter. Be sure to check the cash back bonus calendar for both Discover and Chase for a better idea of where you can expect to earn more points.\n\nRead more: Current Chase Freedom quarterly 5% bonuses\n\nFor a more straightforward option, the Citi Double Cash card is solid. Cardholders earn 1% cash back on purchases and another 1% when they pay off the card. Recently, Citi introduced cash back-to-ThankYou points conversions, making the Citi Double Cash card a great way to earn 2 ThankYou points on every dollar spent.", "description": "Rewards credit cards offer bonus points or cash back on various spending categories, from travel to gas to groceries. Here are the top picks for each.", "authors": ["Ariana Arghandewal"], "top_image": "https://image.businessinsider.com/5da0d3e1cc4a0a0f537dc500?width=1200&format=jpeg", "published_at": "2019-10-13"}