{"pub": "yahoo", "url": "https://news.yahoo.com/eu-may-forced-withdraw-nuclear-230015457.html", "downloaded_at": "2019-09-27 02:44:30.767937+00:00", "title": "EU may be forced to withdraw from nuclear deal, Iran told", "language": "en", "text": "The European Union has privately warned Iran that it will be forced to start withdrawing from the nuclear deal in November if Tehran goes ahead with its threat to take new steps away from the deal.\n\nIran has already taken three separate calibrated steps away from the deal, and has warned it will take a fourth in November unless the US lifts economic sanctions.\n\nThe warning to Iran, pre-agreed by the three EU signatories to the 2015 deal, was made at a meeting on Wednesday, and makes clear that the agreement is now on life support.\n\nThe EU told Iran that it would put the issue of Iranian non-compliance into the agreement’s formal dispute mechanism if the next Iranian move away from the deal is significant.\n\nIran says it has been taking advertised, reversible and calibrated steps away from the deal as a reprisal for US sanctions, including its ban on Iranian oil exports, and the failure of the EU to do more to build trade with Iran. Tehran is due to take a fourth step on 7 November.\n\nOne source said: “The difficulty is that Iran says the steps are reversible, but if they learn about building a nuclear bomb, that is irreversible.”\n\nOnce the deal’s dispute mechanism is triggered, both sides have 30 days to prove significant non-compliance, and if necessary a world-wide sanctions snap-back occurs.\n\nSuch a move would be a huge blow to the EU, which has refused for 16 months to join the US in pulling out of the deal. The Trump administration has been trying to persuade the EU to abandon the deal, and the US secretary of state, Mike Pompeo, this week claimed the September 14 attack on the Saudi Aramco oil facilities represented “an awakening” for Europe.\n\nThe EU warning also came after the French president, Emmanuel Macron, failed to broker a new deal between the US and Iran in which the Washington would lift sanctions, and the Tehran would return to full compliance with the agreement.\n\nMacron had hoped the shock of the attack on the Saudi oil fields, ascribed to Iran by both the EU and the US, would jolt the two sides into compromise.\n\nBut Washington’s refusal to lift any sanctions before talks with Iranian officials, and Tehran’s refusal to have any contacts before sanctions were eased significantly made Macron’s mission impossible.\n\nSpeaking to reporters in New York on Thursday, Iran’s president, Hassan Rouhani, urged the United States to “cease this policy of maximum pressure” in favour of “dialogue, and logic and reason”.\n\nHe said: “If we reach a time when these preconditions are taken off the table, of course the possibility exists to talk with America.”\n\nEU diplomats do not see an appetite in Saudi Arabia or the United Arab Emirates to lead a war against Iran. Riyadh wants the US to lead a military response, something President Trump is reluctant to do. The UAE argues that Iran’s move is ultimately counter-productive since it is forcing the EU to rethink its approach.\n\nBut European diplomats still argue that the American strategy is incoherent: Washington has applied a sanctions regime so severe that Tehran has responded militarily, but the president is not yet willing to respond in kind, meaning his only real option is more sanctions.\n\nIn early June, the Iranian government announced it would break from a key component of the Iran deal – the joint comprehensive plan of action – by ramping up its enrichment of low-grade uranium and increasing its stockpile beyond the limitations outlined in the deal.\n\nSo far, Iran has announced that it would breach on its commitments to increase the low-enriched uranium stockpile above the 300kg limit of 3.67% enriched uranium and enrich uranium above the 3.67% level. In September Iran said it would develop more advanced centrifuges that allow for more rapid uranium enrichment.", "description": "EU warns it may have no choice if Iran takes further steps away from dealHassan Rouhani this week urged the United States to ‘cease this policy of maximum pressure’ in favour of ‘dialogue, and logic and reason’. Photograph: Mary Altaffer/APThe European Union has privately warned Iran that it will be", "authors": ["Patrick Wintour In New York"], "top_image": "https://s.yimg.com/uu/api/res/1.2/4OGZ0WU7WN_UCodnbEHBMw--~B/aD0zMDA7dz01MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/the_guardian_765/b3c2924c47fa8a1f18792574081f6964", "published_at": "2019-09-26"}