{"pub": "bbc", "url": "https://bbc.co.uk/news/world-us-canada-49587232", "downloaded_at": "2019-09-06 12:12:35.008670+00:00", "title": "Hurricane Dorian: Trump map mysteriously loops in Alabama", "language": "en", "text": "Image copyright Getty Images Image caption The black loop appeared to have been added to include Alabama in the storm's projected path\n\nWhen President Donald Trump updated the US public on Wednesday about Hurricane Dorian, he used a map that looked identical to one released last week.\n\nBut close observers soon spotted a difference.\n\nA \"cone\" showing the storm's probable path had been extended with a felt-tip pen to include part of the state of Alabama, analysts said.\n\nThe president has insisted in recent days Alabama was at risk, though forecasters said that was not correct.\n\nWhat did President Trump say on Wednesday?\n\nIn an Oval Office briefing, Mr Trump pointed to a National Oceanic and Atmospheric Administration's (NOAA) forecast map from 29 August.\n\nThe chart had a black loop marked around Alabama that was not on the original version from last week.\n\nMr Trump told reporters that Dorian \"would have affected a lot of other states\".\n\nLater on Wednesday at a White House event, when asked about the map discrepancy, Mr Trump offered no explanation. \"I don't know,\" he said.\n\n\"I know Alabama was in the original forecast, they thought it would get a piece of it,\" Mr Trump said.\n\nNOAA directed queries to the White House press office, which did not immediately respond.\n\nImage copyright NOAA Image caption The original National Oceanic and Atmospheric Administration map did not include a black line around Alabama\n\nIn its latest Dorian advisory on Wednesday, the National Hurricane Center (NHC) issued a storm surge warning covering the coasts of Georgia, South Carolina and North Carolina.\n\nThe hurricane hit the Bahamas with winds equalling the highest-ever recorded at landfall, before moving north late on Tuesday. At least 20 people were killed on the archipelago.\n\nWhat did the president say in recent days about Alabama?\n\nIt began on Sunday morning when Mr Trump tweeted: \"In addition to Florida - South Carolina, North Carolina, Georgia, and Alabama, will most likely be hit (much) harder than anticipated.\"\n\nTwenty minutes later, the National Weather Service tweeted from Birmingham, Alabama, contradicting the president.\n\nBut Mr Trump soon afterwards on Sunday told reporters at the White House: \"Alabama is going to get a piece of it, it looks like.\"\n\nMedia playback is unsupported on your device Media caption Aerials show scale of destruction in the Bahamas caused by Hurricane Dorian\n\nAbout an hour later, he said at a Federal Emergency Management Agency (Fema) briefing that the hurricane \"may get a little piece of a great place: It's called Alabama\".\n\nThe same day, NOAA spokesman Christopher Vaccaro made clear in an email to reporters: \"The current forecast path of Dorian does not include Alabama.\"\n\nOn Monday, media organisations said Mr Trump was incorrect about Alabama.\n\nHe seized on remarks by ABC News' White House correspondent Jon Karl, who noted the president had \"misstated the storm's possible trajectory\".\n\nMr Trump tweeted on Monday: \"Such a phony hurricane report by lightweight reporter @jonkarl of @ABCWorldNews.\n\n\"I suggested yesterday at FEMA that, along with Florida, Georgia, South Carolina and North Carolina, even Alabama could possibly come into play, which WAS true.\"\n\nAccording to AP news agency, forecasts from last Friday indicated that a small strip of Alabama might be affected by Dorian.\n\nHowever, by Saturday morning meteorologists were no longer predicting the southern state would be in the hurricane's path.\n\nIt was 24 hours later that Mr Trump began asserting that Alabama was at risk from Dorian.\n\nOn Wednesday evening, Mr Trump cited the original forecasts to argue that he was right all along.\n\nSkip Twitter post by @realDonaldTrump This was the originally projected path of the Hurricane in its early stages. As you can see, almost all models predicted it to go through Florida also hitting Georgia and Alabama. I accept the Fake News apologies! pic.twitter.com/0uCT0Qvyo6 — Donald J. Trump (@realDonaldTrump) September 4, 2019 Report\n\nWhite House spokesman Hogan Gidley confirmed the map had been altered with a black felt-tip pen, known as a sharpie in the US, but did not say who made the edit.\n\nSkip Twitter post by @hogangidley45 Absolutely right @realDonaldTrump! Watching the media go ballistic over a black sharpie mark on a map would be hilarious if it weren’t so sad. The real news that matters here is a deadly hurricane continues up the coast and tens millions of Americans could be greatly impacted. https://t.co/SceSOeuyO5 — Hogan Gidley (@hogangidley45) September 5, 2019 Report\n\nBy Thursday morning #sharpiegate was trending on Twitter in the US and the president tweeted again about Alabama.\n\nSkip Twitter post 2 by @realDonaldTrump Alabama was going to be hit or grazed, and then Hurricane Dorian took a different path (up along the East Coast). The Fake News knows this very well. That’s why they’re the Fake News! — Donald J. Trump (@realDonaldTrump) September 5, 2019 Report\n\nSome analysts noted that it is illegal to alter official weather maps.\n\nAccording to Cornell Law School, US law says anyone who \"knowingly issues or publishes any counterfeit weather forecast\" can face up to 90 days in prison.", "description": "President Trump insisted Alabama was in the storm's path, despite forecasters disagreeing.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/8657/production/_108619343_hi056250355.jpg", "published_at": "2019-09-05"}