{"pub": "foxnews", "url": "https://foxnews.com/tech/5-essential-steps-to-protect-yourself-from-hackers-and-online-criminals", "downloaded_at": "2019-09-21 14:46:04.651585+00:00", "title": "5 essential steps to protect yourself from hackers and online criminals", "language": "en", "text": "Your device is like the Alamo. It’s fortified and sits in one place. But there’s also a gigantic army just outside its walls, eager to break through and destroy everything within. That army will never rest or retreat. The moment you crack a window open, the enemy will swarm you.\n\nHackers and criminals could be in your network right now. Tap or click here for a free check to see if hackers have compromised your router and you don't even know it .\n\nYour email address and your passwords might be for sale on the Dark Web. No big deal, you think? Hackers can use this information to take over your social media, shopping, financial, and other accounts. Tap or click here to check if your email address and possibly your passwords are available to hackers and criminals.\n\nOnly you can safeguard your own device. You have plenty of tools at your disposal, but unless you use them, you will lose this battle. To help you protect yourself from viruses, phishing, malware, and ransomware, here are five tactics that will bolster your defenses and keep the invaders at bay.\n\n1. Do the two-step\n\nFirst, enable two-factor authentication (2FA for short). So many people don’t do this on their favorite sites and apps. Frankly, it’s just dumb not to take action with all the data breaches at this point. Once enabled, to logon to your accounts, you must enter your password as well as an additional verification, such as a one-time access code usualy sent via text to your cell phone.\n\nThis helps in two ways: Your account now has an additional layer of security besides your password to protect your account. Secondly, if anyone tries to access your account without your permission, you'll know right away about their attempt.\n\nBecause the process is different for nearly every platform, we've put together a guide specifically on setting up 2FA on popular websites and apps. Tap or click here for the steps to set up 2FA on your Google, Facebook, Twitter, and other accounts .\n\n2. Use the right Wi-Fi setting\n\nAn unsecured Wi-Fi network is one of the biggest security risks. If your network isn't adequately protected, anyone with basic security know-how could break in, rummaging freely through your personal data. The most widely used standard is Wi-Fi Protected Access 2 (or WPA2).\n\nTo set up your Wi-Fi security, visit the administrator's page for your router. This page is accessed by typing your router's IP address in the URL field of your browser. The most common ones are 192.168.1.1, 192.168.0.1, or 192.168.2.1.\n\nRELATED: Don’t know how to access your router’s admin page? Tap or click here for the easiest way to find your router’s IP address and password.\n\nOnce you're in your router's menu, find a section under Wireless or Security that contains encryption settings. When you find it, you're usually greeted with several options, including WPA2.\n\nIf you see an option for something called WPA3, this form of wireless security is only available on newer routers. Choose this if you can, but if it's not available, stick with WPA2.\n\nWhatever you do, never leave your encryption status set to Open. This means there's no password, leaving your network unprotected for anyone at any time.\n\n3. Choose an effective password\n\nMost of us have the wrong idea about passwords. We think they have to be convoluted messes, like F$%Th5l2K!&. The theory that passwords should be nonsensical and hard to remember reigned for years.\n\nIt started in 2003 with guidelines from the National Institute of Standards and Technology (NIST), which insisted on random combinations of numbers, letters, and symbols. Over the years, cybersecurity experts have changed their tune. Yes, you should still avoid guessable passwords like “p@ssword1” or “letmein.\" But a strong password also can be logical, fluid, and easy to remember.\n\nTap or click here for 7 steps for crafting the perfect password that is hard to guess but easy to remember .\n\n4. Have a good defense\n\nMy top pick ships with the PC you’ve ordered: Windows Defender, Microsoft's internally developed anti-malware application. Not only does this program thoroughly scan your computer for harmful software, but it's the first program to get updates and zero-day defenses from Microsoft's cybersecurity labs and partners.\n\nYou also need a great firewall and security analyzer. Tap or click here for links to these 3 security programs that should be on every Windows PC .\n\n5. Keep on top of things\n\nNo matter what your operating system, you need to download the latest version. Not only does this provide the latest features, but these updates frequently include security patches for zero-day exploits.\n\nThese bugs, often found by researchers, are critically dangerous. In many cases, frequently patching your system is the only way to combat critical security flaws, so make sure you keep your eyes peeled for updates as they come in.\n\nBonus Step: Get my free security alerts\n\nTo keep up-to-date on data breaches and breaking security news, the easiest way is to let me do the work for you. When breaches or security news breaks, I will immediately let you know. Tap or click here to try my free security alerts now.\n\nWhat digital lifestyle questions do you have? Call Kim’s national radio show and tap or click here to find it on your local radio station . You can listen to or watch the Kim Komando Show on your phone, tablet, television or computer. Or tap or click here for Kim’s free podcasts .\n\nCopyright 2019, WestStar Multimedia Entertainment. All rights reserved.", "description": "Your device is like the Alamo. It’s fortified and sits in one place. But there’s also a gigantic army just outside its walls, eager to break through and destroy everything within. That army will never rest or retreat. The moment you crack a window open, the enemy will swarm you.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/cyber-attack-hacker.jpg", "published_at": "2019-09-20"}