{"pub": "atlantic", "url": "https://theatlantic.com/ideas/archive/2019/09/what-first-whistle-blowers-taught-america/598738", "downloaded_at": "2019-09-25 13:37:48.570832+00:00", "title": "America Needs Whistle-Blowers Because of People Like This", "language": "en", "text": "At midnight on April 6, however, Hopkins’s luck changed. Sailing near Block Island, his fleet encountered the HMS Glasgow. Despite the Navy’s overwhelming superiority, the Glasgow managed to elude capture and escape to Newport, leaving 11 Americans dead and 17 wounded. The entire Continental Navy had failed to defeat a 20-gun British frigate.\n\nCommodore Hopkins met with General Washington on April 8 in New London, Connecticut, the first meeting of the two commanders. It did not go well. Washington wanted to coordinate Navy operations with the Army. Hopkins had other priorities and instead took his fleet back home to Providence. Washington would fight the British alone in New York, just as he had in Boston.\n\nHopkins was roundly criticized for the Glasgow fiasco and for the insubordination that led to it. Rather than take responsibility for his own choices, Hopkins blamed his own brother-in-law, Abraham Whipple, captain of the Columbus, and John Hazard, captain of the Providence. Both were court-martialed for the Glasgow debacle.\n\nRead: The problem with the whistle-blower system\n\nCongress was not pleased with Hopkins, either. On May 8, 1776, the legislature appointed a special committee headed by John Adams to investigate his behavior. “I saw nothing in the conduct of Hopkins, which indicated corruption or want of integrity,” wrote Adams in his autobiography. Thomas Jefferson, however, saw the matter differently. In his personal brief in preparation for the inquiry, he noted that Hopkins’s suspicious conduct had continued after his return, because the Continental Navy “has merely acted in defence of trade of Eastern colonies … The objection is [not] that he did not exercise an honest discretion in departing from his instructions but that he never did intend to obey them.”\n\nIn addition to ignoring the needs of his compatriots, Hopkins was accused of favoring Rhode Island in distributing the spoils. Congress had ordered him to turn over all of the captured cannons to Governor Jonathan Trumbull of Connecticut, but Hopkins again defied orders and sent some of them to the governor of Rhode Island, who was an old friend of his. On May 30, Congress intervened, ordering that six cannons be returned from Newport and 14 from New London.\n\nOutrage at Hopkins’s self-serving maneuvers reached its apex in February 1777, when he defied Congress yet again by issuing counterorders to Joseph Olney, who had replaced John Hopkins as captain of the Cabot. Congress had wanted Olney to report immediately for a multi-ship mission under the direction of John Paul Jones. Hopkins instead ordered Olney to complete a six-week cruise already in progress. His defiance of congressional authority fatally undermined the loyalty of his crew. On February 19, 1777, 10 officers of the Warren delivered a petition to Congress demanding his removal from command. Hopkins, they wrote, was guilty of defying congressional orders on multiple occasions, and was responsible for the Glasgow fiasco. He also had deficiencies of character that rendered him unfit for command of the Continental Navy.\n\nThe collective testimony that accompanied the petition paints a portrait of a self-serving man with a profound sense of entitlement. One petitioner, Jas Sellers, said that Hopkins repeatedly cursed the Marine Committee (successor to the Naval Committee) as “a pack of damned fools.” According to Sellers, he also said, “If I should follow their directions, the entire country would be ruined. I am not going to follow their directions, by God.” In addition, Sellers maintained that Hopkins “treated prisoners in a very unbecoming and barbarous manner.” Three other petitioners—Richard Marven, George Stillman, and Barnabas Lothrop—described Hopkins as “a man destitute of principles, both of religion and Morality,” who frequently profaned “the name of almighty God.” Samuel Shaw testified that he heard Commodore Hopkins call the Continental Congress “a pack of damned rascals.” John Reed maintained that Hopkins “treated prisoners in the most inhuman and barbarous manner” and believed that “no man yet ever existed who could not be bought.” John Grannis described Hopkins’s mistreatment of prisoners in detail and referred to his conduct in general as “wild and unsteady.” In response to the avalanche of condemnation, Congress suspended Hopkins on March 26, 1777, pending formal inquiry into the charges.\n\nOnce he became aware of the “plot” against him, Hopkins tried to cast doubt on his critics. One of the signers of the complaint, Marven, was tried by court-martial aboard the Providence on April 3, 1777 (before the news of Hopkins’s suspension had reached the commodore). Marven was found guilty of insubordination, which rendered him “unworthy of holding a Commission in the American Navy.”", "description": "From the dawn of the United States, Congress has supported democracy and public integrity by protecting those who spoke up about abuses of power.", "authors": ["Allison Stanger", "Author Of"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/GettyImages_514887220/facebook.jpg?1569354606", "published_at": "2019-09-25"}