{"pub": "yahoo", "url": "https://news.yahoo.com/cannabis-oil-vaping-hazy-hazards-120542591.html", "downloaded_at": "2019-10-21 13:33:14.607787+00:00", "title": "Cannabis Oil and Vaping: Hazy Hazards", "language": "en", "text": "Dr. Neal Benowitz, a researcher who studies nicotine and vaping at the University of California, San Francisco, in San Francisco, Oct. 8, 2019. (Jim Wilson/The New York Times)\n\nSAN FRANCISCO — For years, a divisive debate has raged in the United States over the health consequences of nicotine e-cigarettes. During the same time, vaping of a more contentious substance has been swiftly growing, with scant notice from public health officials.\n\nMillions of people now inhale marijuana not from joints or pipes filled with burning leaves but through sleek devices and cartridges filled with flavored cannabis oils. People in the legalized marijuana industry say vaping products now account for 30% or more of their business. Teenagers, millennials and baby boomers alike have been drawn to the technology — no ash, a faint smell, easy to hide — and the potentially dangerous consequences are only now becoming evident.\n\nMost of the patients in the outbreak of severe lung illnesses linked to vaping — which has left 1,479 people sick and 33 dead so far — vaped THC, the ingredient in marijuana that makes people high. Until more information is known, officials at the Centers for Disease Control and Prevention have warned people not to vape cannabis products.\n\nTo some scientists, and even industry leaders, warning signs have been apparent for years as vaping cannabis grew in the shadows, propelled by a patchwork of regulations, a wave of state-by-state legalization and a soaring supply of low-cost marijuana.\n\nWhile the government and researchers poured resources into studying e-cigarettes, federal rules sharply limiting research into the health effects of cannabis — because it is classified as a controlled substance with a high potential for abuse — have left a void in scientific knowledge about what THC vaping does to the lungs.\n\nLast year, Dr. Neal Benowitz, a professor of medicine and a researcher on nicotine and vaping at the University of California, San Francisco, sent a letter to Congress warning of the risks posed by leaving a hugely popular practice unstudied.\n\n“Very little is known about the safety or effects of vaped cannabis oil,” he wrote, cautioning that some ingredients mixed into the oils “could have harmful, toxic effect on users, including the potential for causing and/or promoting cancer and lung disease.”\n\n“It’s disgraceful,” Benowitz said in a recent interview as reports of hospitalizations and deaths from vaping-related lung illnesses mounted. “I’m not able to take products we think are potentially harmful and do analysis. I can buy a vape device around the corner, but I can’t bring it into the lab and test it.”\n\nEven members of the legalized marijuana industry acknowledge the lack of hard science about the cannabis vaping products they sell.\n\n“There’s a glaring gap in trying to understand this product,” said Jerred Kiloh, president of the board of the United Cannabis Business Association, which represents 165 marijuana dispensaries in California, where marijuana was legalized for recreational use in 2016.\n\nKiloh, who owns the Los Angeles dispensary Higher Path, said he believed that the vape pens sold in his stores and in other licensed and regulated stores are likely safe because the ingredients were measured and tested by the state. The state Bureau of Cannabis Control did not return calls asking for comment.\n\nVaping oils typically include other additives, solvents and flavor enhancers, and health investigators believe some such ingredients, including vitamin E acetate, could be responsible for some of the lung illness cases. The problem of unknown and potentially dangerous additives, Kiloh and others said, is vastly worse in a soaring black market in the nearly 40 states where recreational marijuana is still illegal.\n\nEven in states where the drug is legal, counterfeit cartridges are cheaper than the licensed, tested and taxed products. It is hard for legal players who pay taxes to compete. A regulated vape pen with half a gram of THC costs $55, compared with $25 or less on the street for an untested product.\n\n“We don’t know what the chemical composition is,” Kiloh said, “and we especially don’t know what the chemical composition is once it’s been combined, heated and inhaled.”\n\nNo Ash, No Rolling Papers\n\nIn the earliest days of cannabis vaping, a small group of innovators saw the technology as a safer way to help medicinal marijuana patients. They hoped that vaping — which entails heating THC so that it turns to an aerosol — would be less harmful to the lungs than inhaling combusted marijuana.", "description": "SAN FRANCISCO -- For years, a divisive debate has raged in the United States over the health consequences of nicotine e-cigarettes. During the same time, vaping of a more contentious substance has been swiftly growing, with scant notice from public health officials.Millions of people now inhale marijuana", "authors": ["Matt Richtel"], "top_image": "https://s.yimg.com/uu/api/res/1.2/uONA8tpeZKDFzAWj19orlg--~B/aD00NDgwO3c9NjcyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_new_york_times_articles_158/8db204b80027ca8b331d4674597052cd", "published_at": "2019-10-21"}