{"pub": "reuters", "url": "https://reuters.com/article/us-nissan-ceo/nissan-ceo-saikawa-admits-receiving-improper-payment-jiji-idUSKCN1VP34J", "downloaded_at": "2019-09-05 02:17:37.209602+00:00", "title": "Nissan CEO Saikawa admits receiving improper payment: Jiji", "language": "en", "published_at": "2019-09-05", "text": "TOKYO (Reuters) - Nissan Motor Co Chief Executive Hiroto Saikawa admitted to improperly receiving stock-related compensation, Jiji news agency reported, in the latest case of financial misconduct among executives at Japan’s second-largest automaker.\n\nFILE PHOTO: Nissan CEO Hiroto Saikawa attends a news conference to release first quarter earnings at the company headquarters in Yokohama, Japan July 25, 2019. REUTERS/Issei Kato\n\nThe admission raises more questions about Saikawa’s ability to steer Japan’s No. 2 automaker through a financial crisis in the wake of the arrest last year of former Chairman Carlos Ghosn, as mounting costs and sluggish sales sap profit.\n\n“I am deeply sorry for causing concern,” Saikawa said, according to Jiji.\n\nIn other comments reported by Kyodo news, Saikawa denied any role in the execution of the rights scheme which resulted in the wrongful payment.\n\n“I thought that proper procedures were being taken,” he said, adding he had mistakenly believed his secretariat had dealt with it properly.\n\nSaikawa told reporters he planned to return the payment. Sources told Reuters that an internal company probe found he had received tens of millions of yen more than he should have through a stock appreciation rights (SAR) scheme.\n\nNissan declined to comment on the reports of Saikawa’s misconduct or his comments to reporters.\n\nThe company’s investigation came after former Nissan director Greg Kelly went public with the allegations earlier this year. Saikawa is expected to share the results of the probe at a board meeting to be held soon, the Asahi newspaper said.\n\nIn an interview with magazine Bungei Shunju published in June, Kelly said Saikawa was granted an exception in 2013 to reschedule a stock-linked bonus that bumped up the payout by 47 million yen ($445,962).\n\nConfidence in Saikawa has already been shaken by accusations he was too close to ousted boss Ghosn, who, like Kelly, is awaiting trial on charges of financial misconduct. Both men have denied wrongdoing.\n\nThe chief executive is under intense pressure to deliver on plans to axe roughly 10 percent of Nissan’s workforce, cut production and close some of Nissan’s plants around the world in its biggest restructuring in a decade.\n\nThe compensation issue also could exacerbate tensions with top shareholder Renault SA, after a failed attempt by the French automaker to secure a full merger with Nissan and to combine Renault with Fiat Chrysler (FCA). Saikawa opposed the deal.\n\nSaikawa was re-appointed by shareholders with the lowest approval rating among the 11 directors in June, promising improved governance and a better standing for Nissan in its relationship with Renault.", "description": "Nissan Motor Co Chief Executive Hiroto Saikawa admitted to improperly receiving stock-related compensation, Jiji news agency reported, in the latest case of financial misconduct among executives at Japan's second-largest automaker.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190905&t=2&i=1426339997&w=1200&r=LYNXNPEF832HW"}