{"pub": "marketwatch", "url": "https://marketwatch.com/story/this-central-banker-got-more-than-he-bargained-for-when-he-agreed-to-take-questions-from-the-public-2019-10-15", "downloaded_at": "2019-10-15 23:08:48.834055+00:00", "title": "This central banker got more than he bargained for when he agreed to take questions from the public", "language": "en", "text": "We’re accustomed to seeing Hollywood A-listers and chart-topping pop stars open themselves up to questions from adoring fans. But it marked a first when Brits were invited by politicians to quiz Bank of England Gov. Mark Carney as he was giving evidence in front of a panel of lawmakers in Britain’s House of Commons.\n\nForget inflation, monetary policy or the impending doom of a possible recession; this is what the public wanted to know: Who’s your favorite band? How tall are you? And can you lend me a tenner?\n\nThe Treasury Committee allowed the general public to email or tweet their burning questions, which it would relay to the central banker as part of an effort to improve engagement.\n\nUnfortunately, only a selection of the questions were ultimately asked of Carney, so those seeking responses to some of the more left-field inquiries were left in the dark. And, thankfully, most of the 150 responses did strike a weightier tone.\n\n“If banks and top-rated funds can do it, why can’t the MPC [the Monetary Policy Committee, which sets interest rates] be replaced with an algorithm?” asked one individual, while another inquired: “How do you feel about so many noneconomists leading central banks?”\n\nBekah from London\n\nHow do you feel about so many non economists leading central banks?#askthegovernor — Superfreak (@SuperFreak1100) October 5, 2019\n\nDale in Chicago mooted, “Do you think the U.S.A. Fed is being bullied by President Trump to lower interest rates,” but this one wasn’t posed.\n\n#AskTheGovernor Do you think the USA Fed is being bullied by President Trump to lower interest rates.\n\nDale, Chicago, USA — Dale Jennings (@stardales) September 19, 2019\n\nInstead the governor tackled less controversial topics such as whether currency dealers should face the same rigorous market-abuse rules that govern stock and bond trading.\n\nAt a separate event earlier in the day, Sir Jon Cunliffe, a deputy governor at the Bank of England, had warned that central banks no longer had much flexibility to ward off downturns because rates are already so low.\n\nBack at the Treasury Committee politicians also chose not to relay to Carney, who has committed to remain in his role through January, the question, “When are we going to see you on ‘Strictly’? ” That one, referencing “Strictly Come Dancing,” the BBC One version of “Dancing With The Stars,” was asked by a Twitter user with the handle Superfreak.\n\nWhen are we going to see you on Strictly? 😉\n\n#AskTheGovernor@stantjazz — Superfreak (@SuperFreak1100) September 22, 2019\n\nThe woman, describing herself on Twitter as a singer-songwriter and economist, added: “Put him in glitter and make him do a sexy dance.”\n\n\n\nThe MPs also declined to ask this rather more impertinent question from one individual: “When is Eeyore Carney going to get deported back to his Canadian swamp for being not conducive to the public good?”\n\nWhen is Eeyore Carney going to get deported back to his Canadian swamp for being not conducive to the public good? #AskTheGovernor — Roger Borg (@RogerBorg9) September 19, 2019\n\nCarney headed the Bank of Canada for 5½ years before taking the BOE job.\n\nFrom the MarketWatch archives (May 2012): Carney-mania in full swing in Canada", "description": "We’re accustomed to seeing Hollywood A-listers and chart-topping pop stars open themselves up to questions from adoring fans. But it marked a first when...", "authors": ["Rupert Steiner", "Bureau Chief"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR527_carney_ZG_20190918104026.jpg", "published_at": "2019-10-15"}