{"pub": "realclearpolitics", "title": "Amid Facile Reports of Chaos, Prudent U.S. Strategy Emerges", "url": "https://amgreatness.com/2019/08/28/amid-facile-reports-of-chaos-prudent-u-s-strategy-emerges", "language": "en", "published_at": "2019-08-28", "downloaded_at": "2019-09-03 00:56:02.646208+00:00", "text": "Almost imperceptibly, as political discourse continues to be a discordant contest between haters and admirers of President Trump with no journalistic distinction between comment and reporting, there has been substantial progress toward an improved strategic environment for the United States and the West generally.\n\nJournalists in general and the American media in particular have never been especially adept at separating good causes from grand strategy. Even venerated commentators such as Walter Lippmann and Edward R. Murrow, let alone Walter Cronkite, tended not to see geopolitical questions outside their apparent moral effects.\n\nIn the Battle of Britain, for example, it was naturally easier to explain in terms that one country that was a dictatorship and engaged in frightful acts of racial discrimination while bombing the civilian population of a democracy. Therefore, for that reason alone, most Americans identified with the victim and supported them over the author of the aggression, regardless of strategic calculation.\n\nBut apart from Franklin D. Roosevelt, who certainly possessed the same instinct to support the underdog, it was not clear to many Americans—except a few specialists, such as the young George Kennan—that if Nazi Germany retained control of what it then occupied, (Denmark, Norway, Belgium, Netherlands, Luxembourg, Austria, most of France, most of Poland, and the Czechs), and retained it for a whole generation so that the occupied population was effectively Germanized, that entity would be more populous and as powerful as the United States. Few saw that such a greater Nazi Germany, surrounded by satellites like Vichy France, fascist Italy, Romania, Bulgaria, and sympathetic states like Franco’s Spain, would be a mortal danger to the preeminence of the United States.\n\nRoosevelt saw that and would have done so even if the German regime had not been so barbarous and wicked as the Nazis. He also realized that without an American presence in Western Europe and the Far East, the democratic—or at least internationally law-abiding—countries in those regions would not be strong enough to assure that those areas did not fall into the hands of aggressive and anti-American regimes.\n\nThis was what loomed likely if Britain lost either the Battle of Britain or the Battle of the Atlantic: the entire Eurasian land-mass, including the whole littoral of the Mediterranean, would be in the hands of Hitler, Stalin, and the imperial Japanese. To conflate two of his famous speeches of the time: “We in this hemisphere, would be living at the point of a gun . . . fed through the bars of our cages by the unpitying masters of other continents.”\n\nRoosevelt produced the blueprint for all subsequent American strategic policy in two speeches to the Congress at the beginning and end of 1941. In his State of the Union message in January, he said: “We must always be wary of those who with sounding brass and tinkling cymbal would preach the ‘ism of appeasement.” And in his war message, the day after the attack on Pearl Harbor, he said: “We will make very certain that this form of treachery never again endangers us.” The United States must not appease its mortal enemies and must always retain the military power to deter a direct attack on it.\n\nAll 13 of the presidents who have followed FDR have minded those guidelines, though some have made a more convincing job of it than others. It was the genius of Roosevelt’s and Winston Churchill’s statesmanship that the Anglo-Americans gained or retrieved France, Germany, Japan, and Italy, all four of the pre-war world’s Great Powers apart from the Big Three victorious allies (the United States, the U.K., and USSR) into the Anglo-American orbit as prosperous democratic allies, as they remain. (And all, with Canada, were together at Biarritz for the G7 summit this past weekend.)\n\nStalin, who precipitated the war with his Nazi-Soviet Pact with Hitler, took 95 percent of the casualties in subduing Nazi Germany, and 99 percent of the physical damage, as between the Big Three, and ended up only with rather secondary strategic assets in Eastern Europe, where Russia was very unwelcome, and from which it had pledged to withdraw.\n\nThe Cold War was another chapter of strategic genius, as the Roosevelt team, without the deceased Roosevelt (Truman, Eisenhower, Marshall, MacArthur, Acheson, Kennan, and Bohlen) designed the containment policy of defensive alliances, with strong economic assistance both directly and through easy access to American markets for the exports of allies recovering from World War II. This was the concept of the “Free World,” even if many of its members, such as Iran, nationalist China, Spain, Saudi Arabia, Pakistan, Turkey, South Korea, and most of Latin America, were not democracies (though many did eventually become democracies).\n\nWhen President Reagan devised a non-nuclear theoretical system of missile defense at high altitudes by use of lasers, and the Soviet deterrent capability was threatened with obsolescence, the entire international Communist challenge, and the Soviet Union itself, collapsed like a souffle.\n\nHow Trump Has Followed the Roosevelt-Churchill Model\n\nIn the intervening years, Islamist fanatics and terrorists generally have tried to avoid Roosevelt’s commandment of retention of deterrent force by launching terrorist attacks that cannot easily be pinned on any country. And the international Left has made a partial comeback of unsuspected ingenuity by subtly supporting an ever more militant environmental movement that has had extraordinary success in convincing a great swath of opinion in democratic countries that the future of the planet requires radical anti-capitalist measures.\n\nThe environmental movement—which 30 years ago essentially was an inoffensive coalition of legitimate conservationists—for these purposes appropriates useful idiots like the Prince of Wales and outright charlatans like Al Gore, to lead the charge to stop the production and use of fossil fuel at exorbitant cost, and to lacerate our societies with deep self-inflicted economic wounds, as in Germany’s craven shut-down of perfectly safe nuclear power in favor of hideously costly and unreliable solar and wind energy. Of course, there are complicated scientific arguments here, but the whole concept of global warming has been exposed as a fraud, and while the climate is probably changing, it is unclear to what extent, in what direction, and for what reasons it is changing.\n\nThe Trump Administration has taken a number of extremely significant and sensible initiatives, even if the public explanation of them has necessarily been incomplete and at times, regrettably simplistic or blunt. It has followed the Churchill-Roosevelt advice of the 1930s and moved to challenge Chinese trade aggression, industrial espionage, and monetary manipulation in good time rather than appeasing it until it is too late to avoid a serious and possibly dangerous rivalry.\n\nIt has, moreover, avoided the hysterical Russophobia of the Democrats and some prominent congressional Republicans in avoiding a freeze-out of Russia that would drive that country into the grasping arms of the People’s Republic of China, which in the worst case would provide surplus manpower and resources management to take advantage of the untapped treasure house of Siberia.\n\nWe must continue to expand the Western world peacefully. We have rolled its eastern frontier back from 120 miles from the Rhine at the western extremity of East Germany in 1991, to somewhere in Ukraine today. We must create the conditions that would strengthen the Western emulators in Russia, who date back to Peter the Great 300 years ago, over the nativists in the Tolstoy-Solzhenitsyn school. We must have the great Russian civilization and the vast Russian Eurasian territory in the West.\n\nThis administration has exploited the encroachments on the Arab world of our former Turkish and Iranian allies, by helping to align Egypt and Saudi Arabia with Israel against Turkish and Iranian hegemony, and have turned the European rebuff of Turkey and President Carter’s undermining of the Shah of Iran to advantage.\n\nWith the disintegration of Iraq and Syria, the Palestinian issue has almost ceased to be a serious problem without the sponsorship of the main Arab powers. This administration has confronted and debunked the extreme claims of the climate militants and has revived the concept of nuclear nonproliferation with respect to Iran and North Korea. And it has ended the easy dumping of over-heavy quantities of exports from long prosperous allies in Europe and Japan that was strategically justifiable in the 1950s but not recently.\n\nAn additional positive development, if it happens, would be the defection of the U.K. from the European Union, always a somewhat anti-American organization, for closer relations with the United States and Canada.\n\nAll of these are legitimate and prudent strategic actions of the United States. Some are original, some had been abandoned by previous administrations, and some had been ineffectively pursued. All are complicated international issues that can only gradually be resolved.\n\nBut they are all in progress and all have progressed appreciably. These are facts easily lost sight of in such a febrile and over-strenuous pre-electoral campaign as this.\n\nContent created by the Center for American Greatness, Inc. is available without charge to any eligible news publisher that can provide a significant audience. For licensing opportunities for our original content, please contact [email protected].", "description": "", "authors": [], "top_image": "https://amgreatness.com/wp-content/uploads/2019/08/GettyImages-624633596.jpg"}