{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/09/minnesota-ag-keith-ellison-rips-into-religious-freedom-license-to-discriminate-against-lgbtq-folks", "downloaded_at": "2019-10-09 18:28:44.314932+00:00", "title": "Minnesota AG Keith Ellison Rips into Religious Freedom", "language": "en", "text": "Minnesota Attorney General Keith Ellison is vowing to fight a court’s ruling that upheld the right of wedding videographers to create videos in keeping with their faith beliefs about marriage.\n\nIn an op-ed at the StarTribune last week, Ellison tore into the three-judge panel of the U.S. Court of Appeals for the Eighth Circuit, which recently ruled in favor of St. Cloud Christian videographers Carl and Angel Larsen. The couple claimed the right to create videos that are consistent with their faith beliefs about marriage between one man and one woman.\n\nEllison announced he will go back to trial to prove “LGBTQ discrimination is not free speech,” he said, as he accused the Larsens of using their faith beliefs as a front to be able to discriminate against LGBT individuals.\n\n“Business owners’ free speech and beliefs are already fully protected under the First Amendment,” Ellison wrote. “What they want is a license to discriminate against LGBTQ folks.”\n\nEveryone deserves to live w dignity & respect but a St Cloud business wants a license to discriminate against LGBTQ folk & the 8th Circuit said that's ok. Appealing to SCOTUS right now is a trap so I'm going back to district court to fight for what's right https://t.co/25bVGl0BiU — Attorney General Keith Ellison (@AGEllison) October 2, 2019\n\nAccording to Ellison, the “right to be free from discrimination in public” is of greater value than religious liberty, though he also claims the First Amendment assures “no law can” tell people what they can believe.\n\nEllison claimed the Eighth Circuit panel is simply telling the Larsens and their video company, Telescope Media Group, “it can hide behind ‘free speech’ to discriminate against LGBTQ couples.”\n\n“We’re not letting it go unchallenged,” he asserted, but added appealing the decision to the U.S. Supreme Court would not be a realistic option:\n\n[T]he current makeup of that court means we’re not likely to win, because the court would have to accept Telescope’s fairy tale as true, since there are no other actual facts on record at this early stage of the case. A loss there would make this kind of discrimination against LGBTQ people the law everywhere in America. Instead, the best path forward is to take the case back to federal district court. There, we’ll be able to help the trial court establish a set of facts based in reality. Then, if it ends up on appeal again, including before the Supreme Court, the appellate courts will have to accept those facts as true, not Telescope’s fanciful story.\n\nIronically, Ellison believes his path is one that keeps “honoring the First Amendment, which allows everyone to believe what they want.”\n\nPresident Donald Trump will hold a Keep America Great rally in Minneapolis Thursday. Minnesota is a key battleground state in the 2020 presidential election.", "description": "MN AG Keith Ellison will fight a court ruling that said wedding videographers can create videos in keeping with their faith beliefs.", "authors": ["Dr. Susan Berry"], "top_image": "https://media.breitbart.com/media/2019/10/Keith-Ellison-640x335.jpg", "published_at": "2019-10-09"}