{"pub": "indiatimes", "url": "https://indiatimes.com/trending/wtf/up-teacher-beats-class-2-student-over-homework-377625.html", "downloaded_at": "2019-10-11 19:43:36.664162+00:00", "title": "In Another Gut-Wrenching Incident, UP Teacher Thrashes Class 2 Student For Not Doing Homework", "language": "en", "text": "In Another Gut-Wrenching Incident, UP Teacher Thrashes Class 2 Student For Not Doing Homework\n\nIn Another Gut-Wrenching Incident, UP Teacher Thrashes Class 2 Student For Not Doing Homework\n\nCorporal punishment is a very common practice in schools across India. This form of abuse ranges from mild to severe forms of physical punishment and, sometimes, even verbal abuse.\n\nIn another blood boiling incident, a class 2 student was beaten up by her teacher in Jaunpur district of Uttar Pradesh for not completing her homework.\n\nAccording to Mirror Now, the little girl said she had not attempted one of the five math questions given to her as homework. She said that the teacher struck her on her shoulder, elbow and back.\n\nBeing subjected to this sort of harassment can be extremely scarring for students that young. Its memory will stay with them for life and it may even have a direct effect on a growing child's personality. But many teachers just don't seem to care about the consequences.\n\nDon't Miss 12.9 K SHARES 19.1 K SHARES 15.2 K SHARES 6.8 K SHARES 4.5 K SHARES\n\nSource\n\nMahesh Chandra, education officer said that they have taken cognizance of the incident. He said that a panel of two persons has been formed to conduct an inquiry into the case, states the report.\n\nIn a similar incident, a teacher of a privately-run school in Andhra beat up a student allegedly for not coming to school for four consecutive days.\n\nThis gross act stills seems take place in schools across the country, while most go unreported, only some come to light.", "description": "Corporal punishment is a very common practice in schools across India. This form of abuse ranges from mild to severe forms of physical punishment and in many cases, goes to the length of verbal abuse. In another blood boiling incident, a class 2 girl student was beaten up by her teacher in Jaunpur district of Uttar Pradesh for not completing her homework.", "authors": ["Kc Archana"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/teacher_1570793375_800x420.jpg", "published_at": "2019-10-11"}