{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7532819/Saturns-ice-moon-Enceladus-spouting-organic-compounds-building-blocks-life.html", "downloaded_at": "2019-10-05 08:36:51.892470+00:00", "title": "Saturn's ice moon Enceladus is spouting organic compounds which may be the building blocks for life", "language": "en", "text": "Saturn's icy moon Enceladus is spouting organic compounds into space that were once dissolved in its ocean and could serve as the building blocks for life.\n\nNitrogen and oxygen compounds were detected by NASA's Cassini spacecraft in one of Saturn's outer rings which is made of ice grains from Enceladus' south pole.\n\nOn Earth, these molecules are the ingredients used to make amino acids, which are key to developing living organisms.\n\nIce grains erupt from plumes at the moon's south pole thanks to its hydrothermal activity — which could potentially also fuel amino acid formation there too.\n\nScroll down for video\n\nSaturn's icy moon Enceladus, pictured, with Saturn on the horizon, is spouting organic compounds into space that were once dissolved in its ocean and could serve as the building blocks for life, a new study has found\n\nGeoscientist Nozair Khawaja of the Free University of Berlin and colleagues analysed data collected by the Cassini spacecraft on the ice grains that are emitted from Enceladus that have formed one of Saturn's outermost rings.\n\nWhile the Cassini mission concluded in the September of 2017 — with the craft burning up safely in the atmosphere of Saturn — scientists are still mining the wealth of information it gathered.\n\nThe researchers used data collected by the spacecraft's so-called 'Cosmic Dust Analyzer', which took mass spectrometer readings to determine the composition of organic materials that were found in the grains.\n\nResearchers believe that these compounds were dissolved in Enceladus' ocean before they evaporated from the water's surface and ended up condensing on ice grains within fractures in the icy moon's surface.\n\nFrom here, the grains were blasted into space by erupting plumes where they accumulated in Saturn's so-called E-ring, which is around 186,000 (300,000 kilometres) wide and comprised of such tiny particles of water ice.\n\n'If the conditions are right, these molecules coming from the deep ocean of Enceladus could be on the same reaction pathway as we see here on Earth,' said Dr Khawaja.\n\n'We don't yet know if amino acids are needed for life beyond Earth, but finding the molecules that form amino acids is an important piece of the puzzle.'\n\nIce grains erupt from plumes at the moon's south pole thanks to its hydrothermal activity — which could potentially also fuel amino acid formation there too\n\nThe organic compounds were detected by NASA's Cassini spacecraft, pictured in an artist's impression, in one of Saturn's rings which is made of ice grains from Enceladus' south pole\n\n'This work shows that Enceladus' ocean has reactive building blocks in abundance, and it's another green light in the investigation of the habitability of Enceladus,' added paper co-author and planetary scientist Frank Postberg.\n\nLast year, the team reported the discovery of large, complex molecules that are believed to float atop the surface of Enceladus' ocean.\n\nThe new study went deeper into the ocean, however, finding compounds dissolved in the waters instead.\n\n'Here we are finding smaller and soluble organic building blocks — potential precursors for amino acids and other ingredients required for life on Earth,' said paper author and physicist Jon Hillier.\n\nThe full findings of the study were published in the journal Monthly Notices of the Royal Astronomical Society.", "description": "Experts led from the Free University of Berlin analysed data collected by the Cassini spacecraft on the ice grains that are emitted from Enceladus that have formed one of Saturn's outermost rings.", "authors": ["Ian Randall For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/03/11/19247496-0-image-a-24_1570097703843.jpg", "published_at": "2019-10-03"}