{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/rugby-x-review-report-ben-ryan-england-argentina-fiveaside-o2-arena-review-mike-friday-usa-rugby-a9177611.html", "downloaded_at": "2019-10-30 14:22:00.274926+00:00", "title": "Rugby X: Fast, furious and frenetic, new format has plenty of razzmatazz – but is that what the sport really needs?", "language": "en", "text": "In to the O2 Arena the crowds came, more than willing to escape a chilly late October evening for the promise of potential – a new format of rugby was to be introduced, one that certain corners of the rugby world had pronounced as the future of the game.\n\nThis is a game played five against five, on a half-pitch, a portable game played without lineouts or traditional scrums. The ball is not allowed to be kicked more than ten metres in the air; penalties kicked in to touch cause a change of possession. It is rugby, just about, but certainly not as you know it. This is Rugby X.\n\nIt is the brainchild of Ben Ryan, Olympic gold medal winning coach of the Fiji Sevens team, and one of the pre-eminent thinkers in the game. Ryan is not a man with delusions of grandeur for the event – in fact, you got the sense he’d have been rather more content with a low-key launch at a school in central London.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nFor that is how he envisages the format in the future, not as a flashy, show-piece, major arena event, but as a tool for social change in rugby, a format to access new areas.\n\n“We are losing players,” Ryan, the event’s technical director, said of rugby as a whole. “We want to expand that top table and we also want more participation.\n\nShape Created with Sketch. Rugby World Cup 2019 best pictures Show all 45 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Rugby World Cup 2019 best pictures 1/45 Rugby World Cup 2019 The tournament takes place in Japan AFP/Getty Images 2/45 Rugby World Cup 2019 France's players attends a training session at the Fuji Hokuroku Park AFP/Getty Images 3/45 Rugby World Cup 2019 Japanese children perform the Haka AFP/Getty Images 4/45 Rugby World Cup 2019 Ireland's Rhys Ruddock attends a gym training session AFP/Getty Images 5/45 Rugby World Cup 2019 Japan's wing Kotaro Matsushima is tackled by Russia's centre Vladimir Ostroushko AFP/Getty Images 6/45 Rugby World Cup 2019 Former New Zealand international Richie McCaw holds the Rugby World Cup trophy during the tournament's opening ceremony AFP/Getty Images 7/45 Rugby World Cup 2019 Japan fans cheer on their team AFP/Getty Images 8/45 Rugby World Cup 2019 An Argentina fan wearing a mask with an image of football player Lionel Messi AFP/Getty Images 9/45 Rugby World Cup 2019 France supporters kiss outside the Tokyo Stadium AFP/Getty Images 10/45 Rugby World Cup 2019 A France supporter dressed as Obelix AFP/Getty Images 11/45 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 12/45 Rugby World Cup 2019 Australia's hooker Silatolu Latu is tackled AFP/Getty Images 13/45 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 14/45 Rugby World Cup 2019 A France fan waits AFP/Getty Images 15/45 Rugby World Cup 2019 Argentina's centre Jeronimo de la Fuente (C) is tackled by France's wing Yoann Huget AFP/Getty Images 16/45 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 17/45 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 18/45 Rugby World Cup 2019 Japan's players bow AFP/Getty Images 19/45 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara (L) and full back Ben Smith interact with fans AFP/Getty Images 20/45 Rugby World Cup 2019 Fans await the start of a game AFP/Getty Images 21/45 Rugby World Cup 2019 Ireland's wing Jacob Stockdale (2nd R) runs with the ball AFP/Getty Images 22/45 Rugby World Cup 2019 England's centre Manu Tuilagi scores a try AFP/Getty Images 23/45 Rugby World Cup 2019 England supporters attend a match AFP/Getty Images 24/45 Rugby World Cup 2019 A dog with ears coloured in pink AFP/Getty Images 25/45 Rugby World Cup 2019 A Wales supporters laughs outside the City of Toyota Stadium AFP/Getty Images 26/45 Rugby World Cup 2019 A US fan wears shows his support for the Eagles against England. Getty Images 27/45 Rugby World Cup 2019 Argentina vs Tonga takes places at the picturesque Hanazono Stadium. Getty Images 28/45 Rugby World Cup 2019 An Argentina supporter celebrates the victory over Tonga. AFP/Getty Images 29/45 Rugby World Cup 2019 Isileli Nakajima celebrates after Japan beat Ireland in one of the great World Cup upsets. AFP/Getty Images 30/45 Rugby World Cup 2019 Getty Images 31/45 Rugby World Cup 2019 The Japan team celebrate following the famous win over Ireland. AFP/Getty Images 32/45 Rugby World Cup 2019 The Tokyo Stadium was lit up by fireworks following Japan's win in the capital. Getty Images 33/45 Rugby World Cup 2019 Japanese fans celebrate in the Tokyo fans park. AFP/Getty Images 34/45 Rugby World Cup 2019 All across the country, Japan fans were jubilant after the incredible win. AFP/Getty Images 35/45 Rugby World Cup 2019 Workers clear the stadium after the match in Tokyo. REUTERS 36/45 Rugby World Cup 2019 Namibia fans show their support ahead of kick-off against South Africa. AFP/Getty Images 37/45 Rugby World Cup 2019 The setting sun cuts through clouds AFP via Getty Images 38/45 Rugby World Cup 2019 Argentina's full back Joaquin Tuculet celebrates AFP via Getty Images 39/45 Rugby World Cup 2019 Scotland fans await the start AFP via Getty Images 40/45 Rugby World Cup 2019 A US supporter waves the US flag AFP via Getty Images 41/45 Rugby World Cup 2019 France's flanker Charles Ollivon catches the ball AFP via Getty Images 42/45 Rugby World Cup 2019 A France supporter poses with a woman dressed as a geisha AFP via Getty Images 43/45 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara scores a try AFP via Getty Images 44/45 Rugby World Cup 2019 Argentina supporters AFP via Getty Images 45/45 Rugby World Cup 2019 Tournament director Alan Gilpin speaks to the media Getty 1/45 Rugby World Cup 2019 The tournament takes place in Japan AFP/Getty Images 2/45 Rugby World Cup 2019 France's players attends a training session at the Fuji Hokuroku Park AFP/Getty Images 3/45 Rugby World Cup 2019 Japanese children perform the Haka AFP/Getty Images 4/45 Rugby World Cup 2019 Ireland's Rhys Ruddock attends a gym training session AFP/Getty Images 5/45 Rugby World Cup 2019 Japan's wing Kotaro Matsushima is tackled by Russia's centre Vladimir Ostroushko AFP/Getty Images 6/45 Rugby World Cup 2019 Former New Zealand international Richie McCaw holds the Rugby World Cup trophy during the tournament's opening ceremony AFP/Getty Images 7/45 Rugby World Cup 2019 Japan fans cheer on their team AFP/Getty Images 8/45 Rugby World Cup 2019 An Argentina fan wearing a mask with an image of football player Lionel Messi AFP/Getty Images 9/45 Rugby World Cup 2019 France supporters kiss outside the Tokyo Stadium AFP/Getty Images 10/45 Rugby World Cup 2019 A France supporter dressed as Obelix AFP/Getty Images 11/45 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 12/45 Rugby World Cup 2019 Australia's hooker Silatolu Latu is tackled AFP/Getty Images 13/45 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 14/45 Rugby World Cup 2019 A France fan waits AFP/Getty Images 15/45 Rugby World Cup 2019 Argentina's centre Jeronimo de la Fuente (C) is tackled by France's wing Yoann Huget AFP/Getty Images 16/45 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 17/45 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 18/45 Rugby World Cup 2019 Japan's players bow AFP/Getty Images 19/45 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara (L) and full back Ben Smith interact with fans AFP/Getty Images 20/45 Rugby World Cup 2019 Fans await the start of a game AFP/Getty Images 21/45 Rugby World Cup 2019 Ireland's wing Jacob Stockdale (2nd R) runs with the ball AFP/Getty Images 22/45 Rugby World Cup 2019 England's centre Manu Tuilagi scores a try AFP/Getty Images 23/45 Rugby World Cup 2019 England supporters attend a match AFP/Getty Images 24/45 Rugby World Cup 2019 A dog with ears coloured in pink AFP/Getty Images 25/45 Rugby World Cup 2019 A Wales supporters laughs outside the City of Toyota Stadium AFP/Getty Images 26/45 Rugby World Cup 2019 A US fan wears shows his support for the Eagles against England. Getty Images 27/45 Rugby World Cup 2019 Argentina vs Tonga takes places at the picturesque Hanazono Stadium. Getty Images 28/45 Rugby World Cup 2019 An Argentina supporter celebrates the victory over Tonga. AFP/Getty Images 29/45 Rugby World Cup 2019 Isileli Nakajima celebrates after Japan beat Ireland in one of the great World Cup upsets. AFP/Getty Images 30/45 Rugby World Cup 2019 Getty Images 31/45 Rugby World Cup 2019 The Japan team celebrate following the famous win over Ireland. AFP/Getty Images 32/45 Rugby World Cup 2019 The Tokyo Stadium was lit up by fireworks following Japan's win in the capital. Getty Images 33/45 Rugby World Cup 2019 Japanese fans celebrate in the Tokyo fans park. AFP/Getty Images 34/45 Rugby World Cup 2019 All across the country, Japan fans were jubilant after the incredible win. AFP/Getty Images 35/45 Rugby World Cup 2019 Workers clear the stadium after the match in Tokyo. REUTERS 36/45 Rugby World Cup 2019 Namibia fans show their support ahead of kick-off against South Africa. AFP/Getty Images 37/45 Rugby World Cup 2019 The setting sun cuts through clouds AFP via Getty Images 38/45 Rugby World Cup 2019 Argentina's full back Joaquin Tuculet celebrates AFP via Getty Images 39/45 Rugby World Cup 2019 Scotland fans await the start AFP via Getty Images 40/45 Rugby World Cup 2019 A US supporter waves the US flag AFP via Getty Images 41/45 Rugby World Cup 2019 France's flanker Charles Ollivon catches the ball AFP via Getty Images 42/45 Rugby World Cup 2019 A France supporter poses with a woman dressed as a geisha AFP via Getty Images 43/45 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara scores a try AFP via Getty Images 44/45 Rugby World Cup 2019 Argentina supporters AFP via Getty Images 45/45 Rugby World Cup 2019 Tournament director Alan Gilpin speaks to the media Getty\n\n“It is only a good thing if we have a really simple tool to get people to come and watch, and enjoy the game and maybe go and watch sevens or fifteens. And then for the entry, developmental level, to have a contact version of the sport in Rugby X that is very simple, that requires the least amount of technical knowledge of any format – you can play it anywhere!\n\n“The Caribbean have already contacted us and talked about running this because of the lack of pitches, as an entry level to propel them into the sevens game. The prison service we have talked with, local councils have talked to us, some of the youth games. There is a lot of interest.”\n\nIt is a smart, and necessary, idea, but you couldn’t help but feel those words rung slightly hollow as Ryan talked deep in the bowels of the O2. There was a strange disconnect between his outline for what Rugby X can be, and what the crowd were provided with at the event.\n\nWith the tagline “it’s rugby, accelerated”, it was always going to be fast. But what could not quite be prepared for was the fire, fury and the frenzy, rugby accelerated to the point where most were simply clinging on for dear life. The games came too close together, the tries too often, and the rule changes made the action hard to follow at times. A laissez faire approach to officiating didn’t help matters.\n\nThe unfamiliarity of the format was perhaps best underlined by England’s lack of celebration at the conclusion of the women’s final, decided by a one-on-one series of tie-breakers at the end of a drawn game – the players did not realise they had won by scoring a third consecutive point in attack, and were preparing another defender. It seemed the players weren’t quite fully up to speed on the format, either.\n\nGiven the relative anonymity of the combatants, certainly to the wider sporting world, and you’d be hard-pressed to find out what actually happened from anyone who attended, and particularly the details. Even Rob Vickerman, ex-sevens star and a true expert on the game, at times struggled to keep up while doing an admirable job shouting out try scorers from pitchside. Substitutions came often and in a sweeping manner and the most ardent of sevens followers were struggling to keep up with the changes in personnel as players came and went before patterns could develop. In the end, Argentina won the men’s competition, and England the women’s.\n\nYou’d be forgiven for feeling a little lost in what was an incredibly artificial atmosphere. There was a coordinated, relentless attack on your senses from the word go: flashing lights and flamethrowers to gee things up; up-tempo pop music blasted at every conceivable opportunity; on-pitch “entertainment” from a man in a bedazzled jacket to make even an inebriated aunt at a wedding cringe.\n\nIt didn’t seem to have occurred to anyone that, in actuality, the rugby held people’s attention. A little bit of time to reflect and catch your breath between games without music blaring or lights flashing wouldn’t have gone amiss. A half-time is something to consider, too, if only to add a degree of structure and break things up a touch.\n\nThe timing was odd, too. Rugby X found itself plonked in the middle of Rugby World Cup Final week, ostensibly to piggy-back off of the tournament’s popularity, but existing more as a weird aside to events in Japan. Will anyone actually remember Rugby X after this weekend?\n\nOrganisers may point to the matinee session (which was healthily attended, though not close to full) as a real sign of potential growth – a good portion of this early crowd were children, enjoying some half-term entertainment.\n\nAnd while some oohed and aahed at the more audacious offloads that a fine set of players produced during the afternoon, the loudest the children ever got was to count down to zero at the end of each game. That seems precisely the sort of engagement such an event is trying to avoid. Figures of 92 or 93 per cent capacity were touted ahead of the later session, but there were more swathes than smatterings of empty seats throughout the evening.\n\nParticularly in the early games, before teams had fully sussed how to defend in the new format, it seemed tries were able to be scored rather simply; a wide pass, one tackle half-slipped through, one well-timed offload. While there is a certain pleasure in a basketball-style end-to-end thriller, it is not demanding to want more meat on the bone, more substance to complement the style. The better games of the night were those that were slightly more messy and inaccurate, those where defences found a degree of parity, and teams truly had to work for their tries. The women’s games stood out in this manner – the physical capabilities of the players seemed closer, and the games were better for it. The England-USA final was an outstanding contest.\n\nSo that was Rugby X, which is, for now at least, more spectacle than sport. It is exactly the sort of harmless fun that pervades sport, which is fine, but should we not yearn for more? If Ryan and like-minded people truly believe this can fundamentally change rugby, this was not, perhaps, the event to convince the naysayers.\n\nThe future of the format seems relatively easy to forecast. Ryan is really driving this as rugby for the community, for those who do not regularly get the opportunity to play the game, and in that sense it has real potential. The prison service links are incredibly intriguing, and the idea of introducing it to schools who do not provide rugby as part of their sporting curriculum something that has been required for a long while. Rugby has consistently failed to access such populations and it remains a game predominantly played by the elite. It would be a better sport if that was not true.\n\nThe event? That’s harder to say. It is a crowd-pleaser, no doubt, but relatively expensive, and plagued with the familiar problems such events have – overpriced food and drinks, endless queueing, etc. But there are also real problems with the lack of attachment the crowd seemed to feel to the teams. How do you expect to keep the crowds coming back if they feel no connection to the players? Is it simply an event at which kids can while away the half-term hours, and the after-work city folk can engage in cathartic drunken reverie, or is it something more?\n\nUSA Men’s Head Coach Mike Friday compared it to Masters Football, the relatively short-lived indoor footballing venture that saw ex-players trundle around uncomfortably at increasingly sparse arenas. Hardly lavish praise, but perhaps that is what Rugby X the event will ultimately become, a novelty sideshow with faces old rather than faces new to add a degree of familiarity, to grab the casual fan. I suspect a celebrity game may be floated (engagement for such events are generally quite good) to try and access a different sort of fan. Greg O’Shea of Ireland, who I understand won a programme called Love Island, was the most popular and widely-recognised player on show, which is perhaps indicative of what the event truly was.\n\nAnd that’s a real shame, for there were some magnificent players on show, outstanding athletes who seemed, unfortunately, secondary to the pomp and circumstance. As one remarked to me afterwards, it was “an experience”.\n\nBut the future of rugby? I have my doubts.", "description": "In to the O2 Arena the crowds came, more than willing to escape a chilly late October evening for the promise of potential – a new format of rugby was to be introduced, one that certain corners of the rugby world had pronounced as the future of the game.", "authors": ["Harry Latham-Coyle"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/30/12/rugby-x-general.jpg", "published_at": "2019-10-30"}