{"pub": "businessinsider", "url": "https://businessinsider.com/simplehuman-kitchen-cabinet-organizer-review-2018-5", "downloaded_at": "2019-10-09 18:41:05.989260+00:00", "title": "I hacked my disorganized kitchen pantry using these DIY pull-out cabinet drawers, and they eliminated so much clutter", "language": "en", "text": "The author's kitchen pantry, organized using Simplehuman pull-out cabinet drawers. Kristin John\n\nSimplehuman products are designed to make everyday tasks as easy as possible; they employ a no-frills, all-function design that just happens to look great.\n\nThe brand backs their hardware with a five-year warranty and has excellent customer service (I know — I had questions!)\n\nInstalling Simplehuman pull-out racks takes all of 10 minutes and will save you untold hours searching about in pantry shelves over the years to come.\n\nWhen my wife and I were designing our kitchen a couple years back, we opted for matching cabinets flanking either side of the fridge. In one of these cabinets, we chose shelving with built-in pull-out drawers; on the other side, we stuck with just the shelves. The logic was that we would use each side of the pantry area differently. The other part of the logic was that basic shelves cost several hundred dollars less than slide-out hardware. And thus it was that for about two years, one side of our pantry remained well-organized, easy to access, and was generally pleasant to use, while the other became a morass of half-empty chip bags, loose batteries, forgotten snack bars, expired condiments, and so forth.\n\nBut what could we do, rip out the whole cabinet and have a new custom piece built? Move to a new state and start the entire home organization process over from the ground up? Buy fewer groceries?\n\nSimplehuman pull-out cabinet organizer drawers sell for $40 - $60 each, prices vary by size. Simplehuman\n\nOur solution to kitchen cabinet clutter ended up being a whole lot simpler than new cabinetry or relocating across state lines; we simply completed a DIY kitchen pantry upgrade using a pair of Simplehuman pull-out cabinet organizer drawers that took me all of 10 minutes to install.\n\n(Ok, actually the installation took about 20 minutes, but I kid you not, the first half of that time involved simply removing all the junk collected over the previous months.)\n\nThe company Simplehuman doesn't make a lot of products — they offer a selection of trash cans, mirrors, soap dispensers, organization products, and that's about it — but what they do make are all top-of-the line in terms of quality and function. And as it happens, simple as most Simplehuman products are in their aesthetic, they also look great. Actually, let me restate that: Because of their simple design aesthetic, Simplehuman products look great.\n\nI should know, because their 10-liter semi-round stainless steel trash can sits beside my desk where I sit every day, their 58 stainless steel touch-free voice activated trash can is in the corner of our kitchen, their dish rack is often on the counter, and a pair of the aforementioned cabinet organizers are permanently affixed to the pantry shelves. The immediate result of installing Simplehuman pull-out cabinet organizing drawers was a pantry with less clutter and easier access. The longer-term result has been less wasted food and a lot less stress and frustration.\n\nAnd by the way, that 10-minute assembly I mentioned earlier? Yeah, I'm not kidding about that. With a drill, one drill bit, one Phillips bit, a ruler (which I used just to be extra sure I installed these things exactly flush with my shelves; you could easily eyeball it), and the provided screws, the install was so easy that I can all but guarantee anyone who was able to use these pull-out drawers could also install them. (For the record, I popped our shelves out and so I had easy access to them while screwing in the organizers; if yours are affixed in place the process will be more involved, but only because you will probably need to use a screwdriver or else buy a compact right angle drill to work in the confined space.)\n\nThese shelves can support 20 pounds each, which means we can load them with all sorts of eats which are then easily accessed when the organizer is drawn out from the cabinet. There are also adjustable divider inserts that allow you to customize the layout of the organizer shelf, something even our custom built-ins over on the other side don't offer.\n\nIf you don't have a dishwasher, you need this dish rack. Simplehuman\n\nAs for the Simplehuman dish rack ($80), when we're not using the dishwasher (whether it's filled or for extra large or extra fragile items), it's another game-changer, and for good reason: It works well.\n\nMade entirely from stainless steel and a durable plastic with a hydrophobic coating, this rack sheds water like a duck's back, meaning that you don't have to worry about your drying rack for clean dishes itself being damp and/or dirty. It has slots for wine goblet stems, posts for drinking glasses, a utensil caddy, and plenty of rows of storage for dishes, bowls, pots, and pans.\n\nIf you don't have a dishwasher, you need this dish rack. If you have a dishwasher that, you don't need this rack, but you won't regret getting it, either. Your large stew pot and your delicate family china will thank you. And yeah, it's expensive as far as dish racks go. But it's also probably the last one you'll ever need to buy.\n\nJust say: \"Open can!\" and like magic, the lid rises. Simplehuman\n\nSimplehuman also makes a touch-free, voice-activated trash can for $200.\n\nWith a wave of the hand near the top of the unit, this trash can automatically opens its lid. Hands full of raw meat trimmings, a dripping coffee filter, or the dreaded baby diaper? Then just say: \"Open can!\" and like magic, the lid rises. Actually, it's more like science, but you get the point.\n\nDo you need a touch- and/or voice-activated trash can? No. But you didn't need that sweet dish rack or those amazingly convenient shelf organizers, did you? But do you want to get rid of them once they have been integrated into your life? No, I don't. I mean no you don't... that's what I meant.", "description": "With a few simple products from Simplehuman, you can transform not only the way your kitchen looks, but the way your kitchen works. The brand also backs their products with a five-year warranty and has excellent customer service (I know — I had questions!)", "authors": ["Steven John"], "top_image": "https://image.businessinsider.com/5af4ba19e988ef1a008b476e?width=1200&format=jpeg", "published_at": "2019-10-09"}