{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/clean-up-clears-out-crime-20191013", "downloaded_at": "2019-10-23 10:07:08.909520+00:00", "title": "Clean-up clears out crime", "language": "en", "text": "Pretty-Girl Mbense, a supervisor at Safe City, peruses video footage of crime hotspots in the CBD. PHOTO: Moeketsi Mamane\n\nAn average of four muggings a day has dropped to zero in a CBD crime hotspot in recent weeks.\n\nThat’s the good news resulting from an anti-crime offensive by Msunduzi’s administrator on a major criminal hotspot in the city centre near the former Ematsheni Beer Hall.\n\nPrivate security sources said previously they experienced around four muggings daily in that area, but since the clean-up last month they have not attended to any.\n\nThe municipality’s Safe City initiative said the clean-up of undergrowth which had become a hideout for thieves, vagrants, drug dealers and addicts appears to have broken the back of the crime in that vicinity. No official statistics have yet been recorded though.\n\nSafe City, which has a control room monitoring live video footage of the CBD, said Msunduzi’s action has helped in drying up the “HQ for criminals”.\n\nCity administrator Sibusiso Sithole ordered the clean-up of a stretch of empty land at the corner of Retief and Hoosen Haffejee streets where Ematsheni was torn down and which criminals have been using to hide or escape.\n\nThe area is opposite the Masukwana Street taxi rank.\n\nThe Witness has reported extensively on crime in the area.\n\nIt was reported last year that on the nearby Masukwana Street dozens of vagrants stormed a supermarket and robbed it, prompting the owner to hire armed guards.\n\nThis year, business owners, concerned people and private security firms formed the Citizens On Patrol (COP) group, which is made up of business owners and private security firms to protect themselves against the onslaught of crime, particularly in the “downtown” area.\n\nSafe City’s Lucas Holtzhausen said Sithole had ordered the clearing of the area after hearing about the organisation’s concerns around a month-and-a-half ago.\n\n“Vagrants used that bush as a hideout. They would rob people and run away into the bush. The police couldn’t go in [after them] because the bush was full of human waste and things like broken glass,” Holtzhausen told The Witness.\n\n“Now we can see them — they have no hiding place.\n\n“That area is rotten with thugs. There is a big drug issue there, and vagrants used to rob people and there was a lot of theft out of cars and trucks. Some days there were three to four robberies. The elderly in particular were targeted,” he said.\n\nHoltzhausen said petty crimes continue to plague the CBD, adding that crime was not really carried out by professional syndicates.\n\n“They will steal smallish items, whatever they can get their hands on, and sell it and buy drugs,” he said.\n\n“By merely cleaning up the [Ematsheni beer hall] area, we’ve solved a big problem.”\n\nA COP representative said: “This goes to show what can happen when the City enforces bylaws. Crime can stop.\n\n“It has made a huge difference. Every other day there were three or four reports of muggings on Retief Street and no one dare chase them.”\n\nCOP said clamping down on loitering and suspicious behaviour has also been shown to encourage people to return to the CBD to shop.\n\nThe chairperson of the Msunduzi Economic Development Agency, Kantha Naidoo, said she has noticed the number of complaints of crime in general from business owners in the downtown area drying up.\n\nShe said the situation made businesses hopeful, but said the City still needs to deal with the vagrant problem.\n\n“The drug problem is still an issue, and we need to establish a rehabilitation facility,” she said.", "description": "An average of four muggings a day has dropped to zero in a CBD crime hotspot in recent weeks.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9355/c4560502cd8f4851b8967f0759c1cffe.jpg", "published_at": "2019-10-14"}