{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-eu-spending/javid-says-he-is-turning-the-page-on-austerity-idUKKCN1VO2U1", "downloaded_at": "2019-09-04 23:48:10.790722+00:00", "published_at": "2019-09-04", "title": "UK's Javid ramps up spending as election talk mounts", "language": "en", "text": "LONDON (Reuters) - British finance minister Sajid Javid said he was “turning the page on austerity” as he promised the biggest spending increases in 15 years, a move widely seen as part of Prime Minister Boris Johnson’s push for an election to break the Brexit impasse.\n\nBritain's Chancellor of the Exchequer Sajid Javid walks on Downing Street, in London, Britain, September 3, 2019. REUTERS/Hannah McKay\n\n“After a decade of recovery from Labour’s great recession, we are turning the page on austerity and beginning a new decade of renewal,” Javid told parliament on Wednesday, taking aim at the opposition Labour Party.\n\nDay-to-day spending, adjusted for inflation, would jump by 4.1% in the next financial year, the first after Britain’s scheduled departure from the European Union on Oct. 31, he said.\n\nIn his first major speech since taking over the public purse strings in July, Javid promised more money for “the people’s priorities” - education, health and the police - after a decade of tight spending controls that have frustrated voters.\n\nHe promised an “infrastructure revolution”, more funding for the armed forces and social care, and no cuts for any government department next year.\n\nOpposition spokesman John McDonnell, who could soon take Javid’s job as finance minister if Labour wins any early election, said the announcement was a sham.\n\n“To come here to try and fool us with references to ‘people’s priorities’ is beyond irony,” McDonnell said. “We are expected to believe that these Tories, who for years have voted for harsh, brutal austerity, have had some form of Damascene conversion.”\n\nThe Institute for Fiscal Studies, an independent think-tank, said the plan would reverse about two-thirds of the day-to-day spending cuts, adjusted for inflation, made since 2010.\n\nMORE BORROWING AHEAD\n\nJavid, a former Deutsche Bank managing director, said he was sticking with Britain’s fiscal rules for Wednesday’s one-year spending plan. But he suggested he would borrow more in the future to take advantage of record-low borrowing costs.\n\nHe has some room to increase borrowing to fund his spending because Britain has steadily cut its budget deficit from almost 10% of gross domestic product in 2010 to just over 1% now.\n\nBut analysts have warned that he could end up weakening Britain’s budget credibility by making big spending pledges at a time when the economy is at risk of recession and the outcome of Brexit remains so unclear.\n\nThe Bank of England revised down its estimate of the impact of the worst-case Brexit scenario on the economy but, at 5.5% of gross domestic product, the hit it forecast would still be severe.\n\nThe Resolution Foundation, a think-tank, said Javid had effectively binned Britain’s fiscal rules as well as austerity, “bringing down the curtain on the era of public spending constraint in spectacular fashion”.\n\nIt said Britain’s weak economy and a recent rise in public borrowing meant Javid, despite his claim, was already probably in breach of the rule that government borrowing should be less than 2% of economic output in the 2020/21 financial year.\n\nJavid said he would review Britain’s fiscal rules ahead of a longer-term tax-and-spending budget statement later this year.\n\nLawmakers were due to vote on Wednesday on a plan to frustrate Boris Johnson’s government by forcing a delay to Britain’s exit from the EU - prompting Johnson to say he would push for a snap election on Oct. 15.", "description": "British finance minister Sajid Javid said he was \"turning the page on austerity\" as he promised the biggest spending increases in 15 years, a move widely seen as part of Prime Minister Boris Johnson's push for an election to break the Brexit impasse.", "authors": ["Andy Bruce", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190904&t=2&i=1426221215&w=1200&r=LYNXNPEF83164"}