{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7592461/Kylie-Jenner-says-Stormi-super-makeup-right-now.html", "downloaded_at": "2019-10-20 00:30:54.680067+00:00", "title": "Kylie Jenner says 'Stormi is super into makeup right now'.", "language": "en", "text": "Her extremely successful makeup company, Kylie Cosmetics, has made her the 'youngest self-made billionaire,' according to Forbes.\n\nAnd being surrounded since day one, it's no surprise that Stormi Webster is following in mom Kylie Jenner's footsteps.\n\nThe 22-year-old beauty entrepreneur revealed on Friday that her 18-month-old daughter 'begs' to wear makeup and is already 'obsessed' with it.\n\nScroll down for video\n\nJust like mama! Kylie Jenner revealed on her YouTube channel on Friday that her 18-month-old daughter, Stormi Webster, was already 'obsessed' with makeup and 'begs' to wear it\n\n'Stormi is actually super into makeup right now. It's amazing,' she said during a YouTube video on her channel.\n\n'Every time I'm wearing lipstick she notices. She looks at me and says, 'lip lip lip'.'\n\nDuring the tutorial video, Kylie continued to explain that as a first-time mother she wasn't yet sure when she'd officially allow Stormi to wear makeup.\n\nLike mother, like daughter: 'Stormi is actually super into makeup right now. It's amazing,' she said during a YouTube video on her channel\n\n'I haven't even thought about when I'm gonna let Stormi wear makeup. I don't know, I'm just going to see,' she continued.\n\n'She might even not want to wear makeup. But honestly, how things are going, this girl is obsessed with makeup. She begs me at this point.'\n\nEarlier in the month Kylie shared an adorable video of Stormi playing with her lip glosses.\n\n'Stormi is testing out Charm for you guys,' Kylie said.\n\nAll in good time: 'I haven't even thought about when I'm gonna let Stormi wear makeup. I don't know, I'm just going to see,' she continued\n\nQuality control! Earlier in the month Kylie shared an adorable video of Stormi playing with her lip glosses\n\nThe youngster then began applying the lip gloss onto her mother's own mouth, but was a little overenthusiastic in the application.\n\n'Mouth,' Stomi was heard saying.\n\n'Only on my lip!' Kylie playfully chided the child.\n\nStormi then adorably opened her mouth wide for the camera, showing off the messy results of the application.\n\n'Okay girl we've got to take that off, we got to take it off,' Kylie said just before the tot began walking away.\n\n'Storm! Oh my goodness. She really is my daughter,' she mused.\n\n'Got in trouble!' Kylie's confession of not knowing when she will actually let Stormi use makeup rather than play with it comes after her elder sister Kim Kardashian recently confessed that she 'got in trouble' from husband Kanye West for letting their daughter North, six, wear makeup\n\nKylie's confession of not knowing when she will actually let Stormi use makeup rather than play with it comes after her elder sister Kim Kardashian recently confessed that she 'got in trouble' from husband Kanye West for letting their daughter North, six, wear makeup.\n\n'I think he had it, he changed all the rules,' Kim, 38, told E! News during her KKW x WINNIE makeup collaboration dinner in New York City.\n\nLike Stormi, North, a lipstick lover, was seen with a bold red pout at the family's annual Christmas Eve party when she was five-and-a-half.\n\n'I'd let her wear — you know, she has a little red for Christmas — I'd let her wear a red lip, or I'd let her do one pop of something,' she continued.\n\n'I'd let her, if she's wearing a black dress, a black lip. So, I kind of got in trouble for that. So, it's now no more makeup.'", "description": "Kylie Jenner revealed on her YouTube channel on Friday that her 18-month-old daughter, Stormi Webster, was already 'obsessed' with makeup and 'begs' to wear it.", "authors": ["Annita Katee For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/00/19941034-0-image-a-212_1571528149824.jpg", "published_at": "2019-10-19"}