{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7595543/Demi-Rose-poses-topless-ripped-denim-thong-racy-Nevada-photoshoot.html", "downloaded_at": "2019-10-21 08:55:10.874523+00:00", "title": "Demi Rose poses topless in nothing but a ripped denim thong for racy Nevada photoshoot", "language": "en", "text": "Advertisement\n\nShe sent temperatures soaring last week when she posed in nothing but a black G-string.\n\nAnd Demi Rose stripped off once again for a cowboy inspired photoshoot in Nevada during her Las Vegas road trip.\n\nThe model, 24, put on a very risqué display as she strolled around Redrock Canyon topless, with her cowboy hat in hand.\n\nRacy display: Demi Rose stripped off once again for a cowboy inspired photoshoot in Nevada during her Las Vegas road trip\n\nDemi ensured she showed off her jaw-dropping curves during the photoshoot and seductively used her hands to protect her modesty.\n\nThe Birmingham beauty undoubtedly turned motorists' heads as she strolled down the road in nothing but a ripped denim thong and fringed cowboy boots.\n\nShe wore her brunette hair in tumbling curls and accentuated her bronzed tan with a glamorous make-up look.\n\nTurning up the heat: The Birmingham beauty undoubtedly turned motorists' heads as she strolled down the road in nothing but a ripped denim thong and fringed cowboy boots\n\nStrike a pose: Demi ensured she showed off her jaw-dropping curves during the photoshoot and seductively used her hands to protect her modesty\n\nWorking it: Demi proved to be a natural on camera as she flaunted her incredible hourglass figure and enviable abs for a series of shots\n\nNewly-single: Demi has recently split up from DJ Chris Martinez and certainly showed her ex what he was missing\n\nDemi proved to be a natural on camera as she flaunted her hourglass figure and enviable abs for a series of shots.\n\nThe Instagram sensation has garnered the attention of 9.4million followers since she propelled to fame after being romantically linked to Kylie Jenner's ex Tyga.\n\nSince then, the swimwear icon has mainly kept her love with DJ Chris Martinez on the down-low, but confirmed their split last week.\n\nPeachy: Demi struck some of her best model poses to show off her pert derriere during the sizzling photoshoot\n\nRise to fame: The Instagram sensation has garnered the attention of 9.4million followers since she propelled to fame after being romantically linked to Kylie Jenner's ex Tyga\n\nNo signs of heartache: Demi has thrown herself into work in light of her split from DJ Chris\n\nDemi and the DJ have vowed to continue as friends and to support each other's careers, despite the split.\n\nA representative for the star told MailOnline: 'Unfortunately Demi & her boyfriend Chris Martinez have parted ways. They have ended as friends and continue to support each other through out their careers.'\n\nThey added of the beauty: 'Demi is single and very happy working on her career in the USA.'\n\nThough Demi is no stranger to flaunting her figure on social media, she has kept her relationship with DJ Chris on the down-low, with the former couple having enjoyed a private romance primarily out of the limelight.\n\nThe model has also been linked to DJ Tom Zanetti in the past. In the wake of their split, Demi took to Instagram to share a snap, of which she captioned: 'Thinking of you.'\n\nConfident: Demi is no stranger to flaunting her figure on social media after rising to fame for being romantically linked to Kylie Jenner's ex\n\nDespite her gruelling travelling schedule, the model insisted to MailOnline she sticks to her 'healthy' routine and she admitted nuts are the fattiest foods she eats.\n\nIn September last year, Demi revealed: 'I try to keep as healthy as I can. With travelling, it's hard to work out, I travel across the world but try to keep my routine...\n\n'Everyone says I'm the healthiest person they know. The fattiest thing I will ever eat is nuts and peanut butter.\n\n'My figure just gains weight so fast. Any bad thing I eat my body isn't used to it and just puts on the weight. That means no birthday cake.\n\n'All I've eaten today is nuts. I've managed to eat a whole pot. I feel guilty as there's a lot of fat in the nuts. That's my treat. So I'm happy.'", "description": "Demi Rose stripped off once again for a cowboy inspired photoshoot, wearing nothing but a ripped denim thong, in Nevada during her Las Vegas road trip.", "authors": ["Connie Rusk For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/08/19980670-0-image-a-78_1571644072718.jpg", "published_at": "2019-10-21"}