{"pub": "reuters", "url": "https://widerimage.reuters.com/story/a-tale-of-two-guantanamos", "downloaded_at": "2019-09-07 03:53:37.513623+00:00", "published_at": "2019-09-07", "title": "A tale of two Guantanamos", "language": "en", "text": "Advertisement\n\nOn the eastern edge of Cuba, lies the tale of two cities, Guantanamo the city and Guantanamo the U.S. naval base. Both are testament to the gulf between the two countries and their cultures.\n\nOn the base, the uniforms are camouflage. In the city, they are for school or sports. Magazines and books fill the spare time of those at the base, while in the city, cafes, parades and dominoes play that role.\n\nAn unidentified detainee walks along a cellblock of a prison at the U.S. Naval Base in Guantanamo Bay. The base is more than a century old, but the Cuban government that came to power with the 1959 revolution has considered it illegal under international law. The U.S. decision in 2002 to send foreign terrorism suspects to a newly constructed detention camp on the base heightened tensions.\n\nA woman rides a train in the city of Guantanamo (top) and an exit door where released detainees are turned over to the countries that have agreed to accept them at the Guantanamo Bay U.S. Naval Base. Now U.S. President Donald Trump has ordered this week that the center remain open after his predecessor, Barack Obama, unsuccessfully attempted to close the widely condemned prison. Its inmate population stands at 41. Just 18 miles (29 km) apart, the base on the bay with 5,500 personnel and the inland city of 217,000 people do not mix. Their radio stations chronicle their separate and distinct lives.\n\nA boy walks along train rails in the outskirts of the city of Guantanamo (top) and a road near a prison at the U.S. Naval Base in Guantanamo Bay. Radio Reloj, a Cuban government-run station, promotes the culture of Cuba under the island's communist leadership. It extols the virtues of a 20-year-old swimmer who qualifies for the World Aquatics Championships in Budapest as well as the booming potato exports to Latin America. The sound of a ticking clock - a \"reloj\" in Spanish - hums beneath the announcements.\n\nA boy runs with a ball during a soccer game in the city of Guantanamo (top) and soccer balls inside a cellblock at the U.S. Naval Base in Guantanamo Bay. At the U.S. naval base, however, Radio Gitmo caters to an expat community, offering tips on the optimal amount of alcohol to consume after dinner and warning of the negative effects of feeding the bay's iguana population.\n\nA sugar cane field near the city of Guantanamo (top) and a buoy near the U.S. Naval Base in Guantanamo Bay. The two Guantanamos capture the stark contrasts of the neighbouring populations with hardly any communication between them. Still, small strands of similarity could be found. At the base, a U.S. soldier patrols the area, while a portrait of Cuban revolutionary hero Che Guevara adorns a wall in the city.\n\nLocal residents play dominoes outside their homes in the city of Guantanamo (top) and a sample cell is displayed within Joint Task Force Guantanamo's Camp VI at the U.S. Naval Base in Guantanamo Bay.\n\nStory An austere, windowless cell for detainees contrasts with locals playing dominoes outside their homes at dusk. A lone prisoner walks along a dark cellblock, while a group of passengers ride the local bus. Guantanamo is a stark mix of military order or spontaneous joy, bunkers or bright blue doors, Caribbean sea or sugar cane fields.", "description": "On the eastern edge of Cuba, lies the tale of two cities, Guantanamo the city and Guantanamo the U.S. naval base. Both are testament to the gulf between the two countries and their cultures.", "authors": ["Carlos Barria"], "top_image": "https://photos.wi.gcs.trstatic.net/WBTnOVC7qqta06gXHeKsQ0w68b-4bAW0fYE1OOmn1bmq5Yo-Z7km9bs03SM1E0HQTH8Ju762YFIwPUFHRPdUQoi9zqKurqghBzc1JYeshEtCRvTeaLoznTLkrRZPnHRN"}