{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/why-trump-gets-away-with-everything/2019/09/22/3b883b6a-dbe3-11e9-ac63-3016711543fe_story.html", "downloaded_at": "2019-09-23 00:12:17.183840+00:00", "title": "Why Trump gets away with everything", "language": "en", "text": "If what Trump did is entirely innocent, you’d assume the White House would want everything to become public so the president could be cleared of suspicion. After all, Trump tweeted on Friday that he had had a “perfectly fine and respectful conversation” and that “there was nothing said wrong, it was pitch perfect!” Further, he accused the whistleblower of being “highly partisan.”\n\nSo why not share all the information available with the House Intelligence Committee? If Trump’s accuser is some kind of “partisan,” why wouldn’t the president want the world — or at least Congress — to know his basis for saying so?\n\nInstead, the White House and Justice Department are stonewalling, thus ripping apart systems of accountability that were put in place to prevent the abuse of the substantial powers we have given our intelligence services. This is part of a larger undertaking by Trump and his minions to block Congress from receiving information or hearing from witnesses, which is part of Congress’s normal and constitutionally sanctioned work of keeping an eye on the executive branch.\n\nWhen Republicans held Congress during President Barack Obama’s administration, it seemed that a missing box of staples might have been enough to launch 100 subpoenas and months of hearings. Now, the GOP is going along with a president whose lawyers — in a court filing trying to block the Manhattan district attorney from getting Trump’s tax returns — are asserting that “a sitting President of the United States is not ‘subject to the criminal process’ while he is in office.” It is a sweeping and astonishing assertion that a president is above the law as long as he sits in the White House, no matter which level of government might be investigating him.\n\nThere’s also this: On Sunday, without admitting that he tried to encourage Ukraine to dig up dirt on Joe Biden, Trump acknowledged discussing the former vice president and his son Hunter during a phone call with Ukrainian President Volodymyr Zelensky in the context of “the corruption already in the Ukraine.” It was classic Trump. Admit to a small piece of a dangerous story floating around about him, and then turn it into a smear of his opposition.\n\nWe have become so accustomed to what is blandly called “political polarization” that we don’t think there is any mystery about why the Republicans rally around Trump no matter what he does or what dangers our republic might face. It’s just what they do now.\n\nAnd so far, this extreme partisanship has worked for Trump and his party. Attorney General William P. Barr’s false account of what special counsel Robert S. Mueller III concluded in his probe of Russian interference in the 2016 election poisoned the public debate because it sat there for weeks before the report itself was released.\n\nThe lie that Mueller had cleared Trump took hold just enough that it turned the discussion of “partisanship” on its head. If Democrats pursued impeachment, the Trumpists argued, they would be the partisans. Fear that this ploy would work has made Democrats in swing districts wary of impeachment.\n\nThus did Trump pick up an additional benefit from Barr’s initial falsehood, backed up by his own party: While Democrats are united in condemning Trump’s behavior, they have been divided on the impeachment question. A split opposition is exactly what Trump wants and needs — although there were signs Sunday that the latest story may be the last straw for many of the more cautious Democrats. Rep. Adam B. Schiff (Calif.), chairman of the House Intelligence Committee, said on CNN’s “State of the Union” that while he had been “very reluctant to go down the path of impeachment,” the latest allegations could make it “the only remedy that is coequal to the evil” involved.\n\nStill, the lesson to Trump so far: If lying and stonewalling work, and your own party is too afraid to challenge you, stick with the program.\n\nYou might think that Republicans who have made national security their calling card since the Reagan era might finally hit the limits of their cravenness in the face of a whistleblower’s bravery. But the party, our politics and our media system are too broken for the old norms to apply.\n\nEven Republican politicians who know how dangerous this situation is thus prefer to stay in their bunkers and hope to survive. The GOP’s electorate is dominated by Trump’s supporters. Staying mum provides protection from opponents inside their own party — and from their own voters. And if they broke ranks, Trump’s media allies would attack them viciously.\n\nBy playing for time, these taciturn Republicans will be able to tell us once Trump is gone how they knew all along just how bad he was.\n\nBut when the greatest threat to our country is the corruption of our constitutional system, might at least some of the GOP’s leading politicians decide that there are worse things than losing a primary, or being upbraided by Fox News?\n\nRead more from E.J. Dionne’s archive, follow him on Twitter or subscribe to his updates on Facebook.\n\nRead more:\n\nGeorge T. Conway III and Neal Katyal: Trump has done plenty to warrant impeachment. But the Ukraine allegations are over the top.\n\nThe Post’s View: What did Trump tell Ukraine’s president?\n\nJennifer Rubin: Americans have a right to know if the GOP actually thinks Trump’s conduct is acceptable\n\nHenry Olsen: Giuliani has got to go\n\nAnne Applebaum: Welcome, Americans, to the Ukrainian swamp", "description": "Republicans rally around him no matter what he does or what dangers our republic might face.", "authors": ["E.J. Dionne Jr.", "Columnist Covering National Politics"], "top_image": "https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7FELHGGVWAI6TCJEDW35VR4X7M.jpg", "published_at": "2019-09-22"}