{"pub": "newrepublic", "url": "https://newrepublic.com/article/154939/democratic-partys-addiction-dirty-money", "downloaded_at": "2019-09-06 12:07:10.696138+00:00", "title": "The Democratic Party’s Addiction to Dirty Money", "language": "en", "text": "A good private equity man is hard to find. It’s not the sort of business in which firms go looking for morally upright corporations—the sort with whom we’d not worry about our politicians having untrammeled contact—to invest in, let alone ones that don’t pay multimillion dollar settlements for paying doctors to run ersatz pill mills or invest in suicidal fossil fuel extraction. Most private equity machers with substantial investment portfolios rake profits from the continued immiseration of the poor. If it’s not fossil fuels or pharmaceuticals, it’s private prisons, or health insurers, or the defense industry.\n\n\n\nThere are a multitude of ways in which any given rich person could be screwing over the working class, including the mere fact of being a rich person. They might not go to work with the goal of doing so, but as their interests are aligned with the furtherance of these buck-raking schemes, a more equitable society would gravely imperil their balance sheets. What, then, does America gain from having them whisper in the ears of our leaders?\n\n\n\nThe problem is far bigger than Joe Biden. Other candidates in the race have gamely attempted the same two-step, violating pledges to reject special interest money and hosting big-dollar fund-raisers. The machinery of the Democratic Party is primed to run on big piles of cash and showers its favor upon those candidates who reliably stack the green. Even as voters demand that the party shed the influence of plutocratic interests, much of the shift toward rejecting the status quo has been rhetorical, not substantive. The Democrats literally demand “dues,” or a certain amount in funds raised, from the congressional committee chairs who raise those funds from the industries they regulate—and they dole out the parliamentary perks to those who deliver the goods.\n\n\n\nClimate activist groups, like the Sunrise Movement, have lately had some success pushing candidates on climate change. Money tainted by fossil fuel profits is arguably worse than many other kinds of big bad donations, in part because of the dramatic urgency posed by climate crisis. The optics of heading from a climate forum to a fossil fuel executive’s fund-raiser are awful. And this kind of conversation—one in which the Democratic front-runner has to explain and defend his attendance at a fundraiser put on by a fossil fuel executive—is beneficial to the larger project of disentangling the Democratic Party from the control of the rich. (Though CNBC reported that Biden’s allies expected the fundraiser to go ahead as planned, with Goldman co-hosting.)\n\n\n\nBut don’t miss the bigger picture. It would be only slightly less appalling if Biden had gone straight to a fancy fundraiser with someone heavily invested in the pharmaceutical status quo, where poor people die from lack of access to drugs; or the hospital status quo, where hospitals can sue patients for the crime of getting sick; or the housing status quo, where housing and tenants are squeezed for the profits of investors.\n\n\n\nTo have any hope of averting climate catastrophe or reversing the decades-long trend toward inequality in this country, several minor miracles need to happen in 2020. But if the politics of 2021 is to achieve anything close to what most Americans require, the path cannot be paved with the boodle and the influence of the wealthy. Their interests are antithetical to this goal. Democratic candidates forget this at their, and our, peril.", "description": "Joe Biden isn't the only candidate who wants to have it both ways, appealing to big donors and campaign-finance reformers alike.", "authors": [], "top_image": "https://images.newrepublic.com/ba1d48f9f14d64a2b3bd93eae30b8cefeea32817.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg", "published_at": "2019-09-06"}