{"pub": "cointelegraph", "url": "https://cointelegraph.com/press-releases/coinbase-challenger-in-europe-change-launches-its-own-equity-like-token", "downloaded_at": "2019-10-05 13:06:10.647887+00:00", "title": "Coinbase Challenger in Europe Change Launches Its Own Equity-Like Token", "language": "en", "text": "Change, a leading cryptocurrency investment app in Europe, announced the launch of its own equity-like token. The fast-growing crypto company offers its services in more than 30 countries across Europe and is regarded as a major challenger to Coinbase.\n\nCommission-free investing & crypto-friendly card\n\nChange offers its customers unlimited commission-free trading of their favourite cryptocurrencies Bitcoin, Ether, Litecoin, XRP and more. Trading volume in the app has been on a fast rise lately with millions of euros worth of cryptocurrency being traded every month. This trend is likely to continue as commission-free investing is swiftly becoming the norm across the world.\n\nAt the beginning of the year, the company launched its crypto-friendly card for European customers. The card gives cryptocurrency investors instant liquidity if they are in need of capital.\n\nAs cryptocurrency investors are increasingly looking to diversify their investments, the company will be adding popular stocks such as Apple or Facebook to its offering early next year.\n\nEquity-like token\n\nBy launching its own equity-like token, Change is one of the first major cryptocurrency companies who plans to turn token owners into shareholders of the company. The new CNG token gives members of the 5,000 strong Change community an upside in case of Change reporting high earnings, is acquired or files for a traditional IPO.\n\nThe token launch comes at a year of big milestones for Change. In addition to a community of thousands, Change is backed and advised by notable investors such as Roger Crook, ex-CEO of DHL and Hubertus Thonhauser, a seasoned VC investor and board member of Tezos.", "description": "Change, a leading cryptocurrency investment app in Europe, announced the launch of its own equity-like token", "authors": [], "top_image": "https://images.cointelegraph.com/images/740_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy80NjljNTI4N2Y0Yjc5NDMxOGRiNGQzMjQ3MGVlNjUzMi5qcGVn.jpeg", "published_at": "2019-09-23"}