{"pub": "usatoday", "url": "https://usatoday.com/story/money/columnist/2019/10/13/401-k-investor-when-should-you-fire-your-financial-adviser/3943470002", "downloaded_at": "2019-10-13 11:37:41.077697+00:00", "title": "Many women didn't pick their financial advisers. But they can fire them when this happens.", "language": "en", "text": "CLOSE After 19 years covering the stock market for USA TODAY, Adam Shell gives his best advice on how to successfully invest in the market. USA TODAY\n\nMost women, sooner rather than later, will end up alone.\n\nSorry, but this is just a sad fact of life. Many of us, consequently, will find ourselves in the position of working with a financial adviser we may not have selected or even like. Since trust is the essential ingredient of a successful adviser-client relationship, this is unpleasant.\n\nThe Boston Consulting Group conducted a study in 2009 titled “Women Want More (in Financial Services),” which discovered women around the world identified the financial services industry as the one they are most dissatisfied with for both service and products.\n\nThat statistic should have set the industry on edge, but there appears to be little change in their marketing and service strategy for women.\n\nEven more startling: In a 2001 article in Financial Advisor Magazine, Tracey Longo found that over 70% of married women fire their investment adviser within one year of their spouse’s death. Why? Because they do not have a relationship with, nor trust their adviser.\n\nSocial Security gets a bump: Cost-of-living increase nudges up benefits 1.6%\n\nStop stressing about lattes:Here's what really kills your budget\n\nHere are three critical factors to consider when you suspect it is time to break up with your financial adviser.\n\nAm I stupid?\n\nIf you don’t understand the investment strategy being employed in your accounts, it is not because you are stupid; more likely, your adviser is not being transparent. There is no mystique in investing. There should be no opaque descriptions. You should understand entirely the reasons your adviser is employing when managing your investments. In fact, you should be able to explain the process clearly enough for a friend or your young children to understand. This does not reduce the need for your adviser; rather, when you know and understand a topic, it builds trust and confidence.\n\nRemember this is your money, not your adviser’s. You should understand everything as though your life depended on it — your future certainly does.\n\nTraders Ashley Lara and John Santiago confer as they work on the floor of the New York Stock Exchange on Oct. 7, 2019. Stocks surged on Wall Street Friday on optimism about U.S.-China trade talks. (Photo: Richard Drew, AP)\n\nDo they have the same investments as you?\n\nMake sure your adviser invests in the same strategies he or she employs for you. If not, why not?\n\nThis is a legitimate question for you to ask your adviser: Do you own the same investments you are putting in my portfolio? The answer should be \"yes.\" If the answer is \"no\" it is important for you to understand why. If your adviser cannot explain why he or she does not own every single investment in your portfolio, you should fire them on the spot. Think of your portfolio as a symphony, or a garden, even a football team. The ultimate outcome is determined by the underlying inputs—each one performs a purpose.\n\nTrust your adviser\n\nYou need to trust your adviser. Shared values are important. I will quote from my 2014 book, \"The Women’s Guide to Successful Investing\": “If you don’t like your advisor and and you don't trust your advisor, you will not enjoy a successful relationship. Women repeatedly report that while the gender of their investment advisor is irrelevant, they desire proactive and clear communication.”\n\nWe don’t care about meaningless phone calls or lunches — women are busy — rather, we want to receive information in a clear, concise form that is convenient for us.\n\nIf you are going to break up, have the conversation directly with your adviser. Make sure no unnecessary transactions take place. You can transfer your assets to your new adviser in kind.\n\nAnd, of course, you know how I feel about fees. Make sure you understand everything you are being charged for at your old adviser as you exit and at your new adviser as you enter. Hidden fees are my biggest bugaboo and should be yours, too.\n\nKick the tires like you would on a new car. Avoiding blowouts is the safest way to grow your assets.\n\nThere are lots of parallels to be drawn between breaking up with your financial adviser and breaking-up with a love interest. But there is one major difference. Money. (Photo: Getty Images/iStockphoto)\n\nRead or Share this story: https://www.usatoday.com/story/money/columnist/2019/10/13/401-k-investor-when-should-you-fire-your-financial-adviser/3943470002/", "description": "Many women find themselves working with a financial adviser they may not have chosen or like. Here's how you know if it's time to fire your adviser.", "authors": ["Nancy Tengler", "Special To Usa Today", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/11/USAT/0248603a-5876-4c12-81e4-13b291a082a9-AP_Financial_Markets_Wall_Street.jpg?crop=5759,3239,x0,y308&width=3200&height=1680&fit=bounds", "published_at": "2019-10-13"}