{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/brett-kavanaugh-sexual-assault-deborah-ramirez-fbi-supreme-court-a9105996.html", "downloaded_at": "2019-09-15 14:26:45.877398+00:00", "title": "Brett Kavanaugh: Trump Supreme Court pick hit with new sexual assault allegation 'not investigated by FBI'", "language": "en", "text": "A new allegation has emerged of sexual assault against Brett Kavanaugh, which was not investigated before his appointment to the US Supreme Court.\n\nA former classmate at Yale University saw Mr Kavanaugh’s penis being pushed into the hand of a female student at a drunken dorm party, according to the New York Times.\n\nThe witness account – which has not previously been made public – appears to echo allegations made by Deborah Ramirez, one of three women who came forward after the judge was nominated by Donald Trump.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nMs Ramirez claimed she was at a party in the winter of 1983/4 when a freshman named Brett Kavanaugh pulled down his pants and thrust his penis towards her while other students laughed.\n\nHer legal team gave the FBI a list of more than 25 people who may be able to corroborate her story, but none of them were interviewed and she was never asked to testify at last year’s confirmation hearings.\n\nThe latest claim – which relates to a different dorm party – comes from Max Stier, who now runs a non-profit organisation in Washington.\n\nShape Created with Sketch. In pictures: Chaos and fury at Brett Kavanaugh's confirmation hearing Show all 21 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. In pictures: Chaos and fury at Brett Kavanaugh's confirmation hearing 1/21 Getty Images 2/21 AFP/Getty Images 3/21 EPA 4/21 Getty Images 5/21 AFP/Getty Images 6/21 AP 7/21 Getty Images 8/21 Getty Images 9/21 AFP/Getty Images 10/21 AP 11/21 AFP/Getty Images 12/21 REUTERS 13/21 AFP/Getty Images 14/21 REUTERS 15/21 AFP/Getty Images 16/21 REUTERS 17/21 AFP/Getty Images 18/21 EPA 19/21 EPA 20/21 AFP/Getty Images 21/21 AFP/Getty Images 1/21 Getty Images 2/21 AFP/Getty Images 3/21 EPA 4/21 Getty Images 5/21 AFP/Getty Images 6/21 AP 7/21 Getty Images 8/21 Getty Images 9/21 AFP/Getty Images 10/21 AP 11/21 AFP/Getty Images 12/21 REUTERS 13/21 AFP/Getty Images 14/21 REUTERS 15/21 AFP/Getty Images 16/21 REUTERS 17/21 AFP/Getty Images 18/21 EPA 19/21 EPA 20/21 AFP/Getty Images 21/21 AFP/Getty Images\n\nMr Stier notified senators and the FBI during the confirmation process that he saw Mr Kavanaugh with his pants down before friends pushed the freshman's penis into the woman’s hand.\n\nHowever the FBI did not investigate his account, the Times reported. Both Mr Stier and Mr Kavanaugh refused to discuss the allegation with the newspaper.\n\nThe Supreme Court Justice was sworn in last October despite testimony from Dr Christine Blasey Ford that he sexually assaulted her while they were both at high school in 1982.\n\nMs Ford alleged that Mr Kavanaugh drunkenly forced her down onto a bed, groped her, attempted to remove her clothes, and held his hand over her mouth so that she could not scream for help.\n\nThe judge vehemently denied the claims during his own evidence to the Senate Judiciary Committee.\n\nMr Kavanaugh was eventually confirmed in the Senate by a vote of 50 to 48 as protesters shouted “Shame! Shame! Shame!” in the public gallery.", "description": "A new allegation has emerged of sexual assault against Brett Kavanaugh, which was not investigated before his appointment to the US Supreme Court. A former classmate at Yale University saw Mr Kavanaugh’s penis being pushed into the hand of a female student at a drunken dorm party, according to the New York Times.", "authors": ["Peter Stubley"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/15/11/brett-kavanaugh-supreme.jpg", "published_at": "2019-09-15"}