{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/mark-sanford-2020-presidential-campaign.html", "downloaded_at": "2019-09-15 10:54:51.786019+00:00", "title": "Mark Sanford on Challenging Trump for the 2020 Nomination", "language": "en", "text": "Mark Sanford, party of one. Photo: Mark Peterson/Redux\n\nThe road back to the campaign trail begins with the Look. Do you know the one I mean? The Look is one of searching, of scanning, of wanting. For half a second, the eyes swell with hope — cartoonish, glassy. Every passing person presents an opportunity. Do you know me? the eyes ask. Can I shake your hand, slap your back, kiss your baby?\n\nMark Sanford was giving the Look left and right. In the direction of the young couple sitting in a hammock. An older couple on a bench. A man approaching on his jog. A golden retriever.\n\nIt was dusk in Mount Pleasant, South Carolina, the suburban town six miles from downtown Charleston where Sanford lives. A short drive from his house, there’s the ocean walk — a beautiful stretch of pavement and palmetto-studded grass that extends through the marsh to a pier on the Cooper River. Sanford walked along the path in his flip-flops. He was preparing for a trip to Iowa, a euphemism for declaring your candidacy for your party’s presidential nomination. Some people recognized him, even offered words of encouragement. Others breezed past, unaware or uninterested in the man whom the president was, in fact, tweeting about at that very moment.\n\n“Can you believe it? I’m at 94 percent approval in the Republican Party, and have Three Stooges running against me. One is ‘Mr. Appalachian Trail’ who was actually in Argentina for bad reasons …,” Donald Trump wrote.\n\nIt can rarely be said that Trump is right, but on this he is, almost: Among Republicans, he maintains sky-high levels of support, though not the 94 percent he claims. According to Gallup, 88 percent of Republicans assess him favorably. When you talk to reluctant Trump voters — not the MAGA-hat-wearing rallygoers but rich white people — they cite the Supreme Court and tax reform as enough justification for their position; that whatever damage he has wrought, these victories denied to conservatives during eight years of Barack Obama are worth it. And besides, many of them think this will all be short-lived. Why bother trying to help a Joe Walsh or a Bill Weld when Trump will probably be defeated in the general?\n\nWhich again raises the question of who deserves more ridicule: the Republicans brimming with cynicism or those who believe they can change the future of the party. Sanford is a conservative from the more innocent time of, like, a few years ago, before Trump and the cultlike creed of his loyal fans supplanted Establishment Republican orthodoxy. News of his candidacy has been welcomed by some of his fellow travelers: Jennifer Rubin, the Washington Post columnist, said she felt “relief” to hear what Sanford has to say. He could be, as the headline read, “the last chance” for their party. In the New York Times, Liz Mair, a “Never Trump” operative, called him “the biggest Republican threat to Trump.” These assessments are undercut by the reality that the Republican National Committee and the state parties seem intent on guarding against legitimate challenges to an internally popular president. There is just one GOP debate scheduled so far, hosted by Business Insider. Trump won’t be attending. South Carolina, Kansas, Nevada, and Arizona have canceled their nominating contests ahead of the October filing deadline. And the GOP primary polling, of course, is bleak. A Boston Herald–FPU survey released on September 11 has Trump up 85 points over Weld (3 percent) and Walsh (one percent).\n\nSanford in Mount Pleasant, South Carolina. Photo: Lauren Matarazzo\n\nBut Sanford, the former governor who was more recently a congressman from South Carolina, doesn’t think he has much to lose. His last years as governor were mired in scandal after he went off the radar to visit his girlfriend in Argentina for several days in 2009 — which wouldn’t have been a problem except for the fact that he had a wife, and a state to run, and nobody knew where the hell he was. His staff told reporters he’d said something about going to hike the Appalachian Trail, which is the only detail that has really stuck after all this time. Still, he was elected to Congress in 2013 and elected again and then again. He lost his seat after last fall’s primary with an assist from Trump, who endorsed Sanford’s opponent and called him “unhelpful to me in my campaign to MAGA.”\n\nSanford retreated for a while. He taught a course at the University of Chicago. But people kept approaching him, he said, with this crazy idea. At first, he dismissed it. But after a while, after “some people I respect and trust” were the ones doing the calling, “I began to break through.”\n\nAs different as American politics is now, it remains standard for its actors to refuse to go away, judgment of the electorate be damned. Once you’ve sipped from the well of the swamp, you never leave the party for long. That’s true even if Washington is more like the Donner Party these days. Or maybe it’s more true now because striving to hang on can so easily be sold as a fight to save the republic — or some shred of it, anyway.\n\nIt was getting darker, and Sanford, wearing Levi’s crusted with grass and dirt and paint, sat down on a bench overlooking the water. “I keep waiting for somebody else to do it,” he said. “Nobody else goes, they keep calling.”\n\nThe only Republicans primarying Trump were the former governor of Massachusetts best known for joining the Libertarian Party ticket with Gary Johnson in 2016 and a one-term tea-party congressman from Illinois best known for tweeting nearly as much as the president. “Finally,” Sanford said, “you’re like, Okay, I’ll roll the grenade down the aisle.”\n\nPhoto: Lauren Matarazzo\n\nSanford’s sure he’s not going to get elected president. It would be “delusional” to think otherwise, and he’s not that. He hasn’t bothered with formal polling. “You will lose to Donald Trump. That’s what it will tell you,” he said. You just have to look at the history of primary challenges to sitting presidents to know that. “It’s not to say it was not worthwhile, because in some cases it completely changed, or partially changed, the debate,” he said. And he knows Trump and his supporters will continue to harass him over the scandal from ten years ago — seeing no irony in their selective outrage over a man’s extramarital curricula. “It’s all kinda out there,” he told me. “2009 was a process of letting go, of saying, ‘I’m not in charge. As much as I might try to be, I am not in charge.’” He and María Belén Chapur broke off their engagement in 2016, after seven years together. “I wish that you could say that you completely control who you fall in love with, but that certainly wasn’t my experience. And so you end up in an awful mess,” he said. “I regret how I handled it … I always feel bad about it. You wish you could hit rewind play on different chapters of your life, but that’s not life.” He encountered some Trump supporters recently at a barbecue with Vice-President Mike Pence. When they saw him, they chanted, “Take a hike! Take a hike! Take a hike! Trump! Trump! Trump!” He laughed as he recalled this, like, What the fuck? Nobody had ever chanted the phrase at him before, he said (which surprised me!), “People compartmentalize like you would not believe,” he said, “You’re sitting there thinking, ‘Now wait, let me get this right. Your guy, we won’t go there, but you’re going to …” He trailed off. “But no, people compartmentalize as you can’t imagine. They give everybody a nickname. I wouldn’t look forward to mine. And they seem to stick with it. They’re very good at it.”\n\nIn this sense, he is clear-eyed and almost transparent about what he’s up to here. He crossed his leg and absentmindedly picked at the nail on his big toe. He crossed his leg and absentmindedly picked at the nail of his big toe. “I don’t mind going into hostile environments to test ideas and to talk to people. I don’t mind that at all,” he said. “I happen to believe the Republican Party will be stronger if we have a debate about what it means to be a Republican. Right now, there’s a robust debate on the Democratic side on what it means to be a Democrat and ‘What are our hopes and values and dreams?’ and all those sorts of things. While on the Republican side, it’s simply sun, moon, and stars revolve around Donald Trump.”\n\nUnlike Walsh, a Trump voter turned Never Trumper whose platform is a reaction to the existential threat Trump poses to the GOP and the country broadly, Sanford has a single issue on his platform (the national debt) and implied exhaustion, or boredom, with the entire subject of the current president — sort of like, Is it really necessary that we talk about this guy all of the damn time? “As bad as he is, he doesn’t have the capacity to sink our republic. Where we’re going in terms of the debts and the deficit issue has the capacity to sink our republic,” Sanford said.\n\n“You got 20-plus Democrats, and Joe Walsh and Bill Weld as well, who will tell you all the character flaws of Trump,” he continued. “I mean, I don’t think that that’s new news.”\n\nA man walking by called out to him.\n\n“What do you say, Mark? You gonna do it?”\n\n“I don’t know. Trying to figure it out!”\n\n“You gotta do it, man!”\n\n“We’ll see!”\n\n“You gotta do it!”\n\nSanford smiled. “Have a good one,” he said.\n\n“You’ve got my vote!”\n\n*This article appears in the September 16, 2019, issue of New York Magazine. Subscribe Now!\n\nSign Up for the Intelligencer Newsletter Daily news about the politics, business, and technology shaping our world. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.", "description": "Former South Carolina governor Mark Sanford announced his 2020 presidential campaign, challenging Trump for the Republican nomination. He’s sure he’s not going to get elected president. It would be “delusional” to think otherwise, and he’s not that.", "authors": ["Olivia Nuzzi"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/09/12/magazine/fullsizerender11_3.w1200.h630.jpg", "published_at": "2019-09-15"}