{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7541305/Big-Brother-season-one-contestant-Cassandra-Waldon-dies-age-56-car-accident-Rome.html", "downloaded_at": "2019-10-05 23:05:57.112402+00:00", "title": "Big Brother season one contestant Cassandra Waldon dies, age 56, after car accident in Rome", "language": "en", "text": "Cassandra Waldon, a contestant on the first season of CBS' Big Brother, died on September 25 after sustaining a head injury last August during a car accident in Rome.\n\nThe Johns Hopkins grad - who was 56 - was living and working in Italy as communications director for the International Fund for Agricultural Development, a United Nations agency.\n\n'She never regained consciousness before her death,' a source at the UN told TMZ on Saturday.\n\nRIP: Cassandra Waldon, a contestant on the first season of CBS' Big Brother, died on September 25 after sustaining a head injury last August during a car accident in Rome (pictured in 2000)\n\n'Her funeral will be held next weekend in her home state of Maryland.'\n\nBig Brother host Julie Chen Moonves posted a touching tribute to Cassandra on Friday.\n\n'Rest In Peace Cassandra,' the 49-year-old Daytime Emmy nominee wrote on Instagram.\n\n'Your light will continue to shine in this world because of the way you lived your life: with class and grace. May your family and loved ones find solace and peace.\n\n'Her funeral will be held next weekend in her home state of Maryland': The Johns Hopkins grad - who was 56 - was living and working in Italy as communications director for the International Fund for Agricultural Development, a United Nations agency (pictured January 24)\n\n'Thank you for your intelligence, warmth, and wisdom': Big Brother host Julie Chen Moonves posted a touching tribute to Cassandra on Friday\n\n'Your light will continue to shine': Back in 2000, Waldon (R) was considered a parental figure during her 72 days as a houseguest - finishing in sixth place as Long Island actor Eddie McGee (M) won the $500K prize\n\n'Thank you for bringing your intelligence, warmth and wisdom to the Big Brother house Season 1. You are in my thoughts and in my prayers. May God Bless your soul.'\n\nBack in 2000, Waldon was considered a parental figure during her 72 days as a houseguest - finishing in sixth place as Long Island actor Eddie McGee won the $500K prize.\n\nEerily, Big Brother's 21st season concluded the same day Cassandra died - September 25 - with Nashville server Jackson Michie winning the $500K prize after 99 days.", "description": "The Johns Hopkins grad was living and working in Italy as communications director for the International Fund for Agricultural Development, a United Nations agency", "authors": ["Cassie Carpenter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/17/19337802-0-image-a-49_1570294359972.jpg", "published_at": "2019-10-05"}