{"pub": "guardian", "url": "https://theguardian.com/sport/2019/sep/05/bianca-andreescu-us-open-belinda-bencic", "downloaded_at": "2019-09-06 12:11:30.406492+00:00", "title": "Bianca Andreescu bears down on big points to reach first US Open final", "language": "en", "text": "Bianca Andreescu was outplayed for extended stretches in her US Open semi-final on Thursday night against the resurgent Belinda Bencic.\n\nBut the 15th-seeded teenager from Ontario was able to find another level when it mattered most in a 7-6 (3), 7-5 victory at Arthur Ashe Stadium, conjuring her best shotmaking on the most important points to reach the final in her first ever appearance in the main draw here.\n\nSerena Williams overwhelms Elina Svitolina to reach 10th US Open final Read more\n\n“I think when I’m down, I play my best tennis,” Andreescu said. “Whenever my back is against the wall, I think I’m just extra focused in those moments.”\n\nBencic, the No 13 seed from Switzerland, held comfortably throughout the opening set without facing a break point, while Andreescu was made to labor through her service games, saving all six break chances she faced including a set point at 4-5, only to run away with the tie-breaker in smash-and-grab fashion.\n\nThen after falling behind 2-5 in the second, Andreescu won the last five games on the trot to race across the finish line after two hours and 12 minutes, becoming the first US Open debutante to reach the final since Venus Williams in 1997 and only the second Canadian woman to make it this far at any major.\n\n“I’ve always dreamt of this moment ever since I was a little kid,” said Andreescu, who struck 40 winners including seven aces to 38 unforced errors. “But I don’t think many people would have actually thought that it would become a reality.”\n\nCertainly not 52 weeks ago when Andreescu was ranked 208th in the world after a first-round loss in the US Open qualifying draw. But she’s won 32 of 36 matches in a remarkable breakout season, capturing titles at Indian Wells and Toronto while surging up to No 15 in the rankings. It’s been more than six months since she lost a completed match.\n\nNow the indefatigable 19-year-old from the Toronto suburb of Mississauga is one win from a first major championship in only her fourth main-draw appearance at a grand slam and can eclipse a record held by Maria Sharapova, who broke through at 2004 Wimbledon in her seventh attempt.\n\nIt won’t be easy.\n\nAndreescu, who is the first man or woman born in the 2000s to reach a final at one of the sport’s four bedrock events, advances to face six-time US Open champion Serena Williams, the No 8 seed who brushed aside Elina Svitolina in Thursday night’s first match and will be taking a fourth crack at moving level with Margaret Court atop the all-time grand slam leaderboard. A triumph for the precocious Canadian would also be notable given that women’s tennis is hardly the province of prodigies and starlets it once was: Not since Sharapova won the 2006 US Open aged 19 has a teenager captured a major title.\n\nThe nearly 19 years between Andreescu and Williams is the largest age difference ever in a women’s grand slam final, eclipsing the previous mark set by 1991 US Open finalists Martina Navratilova and Monica Seles, who were born 17 years and 45 days apart. The pair met once before in last month’s Toronto final when Williams retired with a back injury trailing 1-3 after just 19 minutes.\n\n“Having those four games against her I think is going to help me on Saturday,” said Andreescu, who is unbeaten in seven career matches against opponents ranked in the top 10.\n\nBencic, who was bidding to become only the second Swiss woman to reach a major final after her longtime mentor Martina Hingis, played a cleaner and steadier baseline game throughout the first set in the grand slam semi-final debut for both players, forcing Andreescu to fight off break points in the fourth, sixth and 10th games. But the 22-year-old lost her nerve in the tie-breaker, making her first double fault of the night followed by a glut of unforced errors to gift Andreescu the opener.\n\n“It wasn’t easy at all,” Andreescu said. “She hits the ball really hard and really flat I think every shot. My knees were to the ground. It wasn’t too fun playing her. That’s what makes her such a great player.”\n\nShe added: “But the main reason I won today I think is because I just kept fighting. I never let up.”\n\nThe world No 12 was able recollect and break Andreescu in her opening service game of the second, then a second time for 4-1. But the highest ranked teenager on the tour found a vein of form as her opponent came apart, keeping Bencic off rhythm with a clever mix of angles, slices, high balls and drop shots and breaking three times as many return games to close the show.\n\n“It was just here and there, some stupid mistakes from my side, good shots from her side, some lines, some net cords,” said Bencic, who will return to the top 10 in next week’s rankings after a 43-month absence. “Tennis is very fast. Things turn around very fast. Unfortunately for me today was the other way.”\n\nAfter she pounded a crisp return into the corner on match point that Bencic could scarcely get a racquet on, Andreescu stood on the baseline with an expression of disbelief.\n\n“A lot of emotions are running through my body right now,” she said. “Hopefully I can just keep the momentum going for the finals. Hopefully I can play a little bit better than I did today.”", "description": "The 15th-seeded teenager was able to find another level when it mattered most in a 7-6 (3), 7-5 victory over Belinda Bencic to reach the US Open final", "authors": ["Bryan Armen Graham"], "top_image": "https://i.guim.co.uk/img/media/c6d34c03a32e4b5f06d6cbb4df08cee853ede0e0/0_177_4627_2777/master/4627.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=172bd30def4208f56ea5bf85edd4909f", "published_at": "2019-09-05"}