{"pub": "reuters", "url": "https://in.reuters.com/article/asia-storm-japan-int/japan-rescuers-wade-in-muddy-waters-to-find-typhoon-survivors-idINKBN1WT06G", "downloaded_at": "2019-10-14 03:47:39.083468+00:00", "title": "Japan rescuers wade in muddy waters to find typhoon survivors", "language": "en", "text": "Rescue workers search a flooded area in the aftermath of Typhoon Hagibis, which caused severe floods at the Chikuma River in Nagano, Nagano Prefecture, Japan, October 14, 2019. REUTERS/Kim Kyung-Hoon\n\nNAGANO, Japan (Reuters) - Rescue workers waded through muddy, waist-high waters on Monday searching for missing people after one of the worst typhoons to hit Japan in recent history, with rain forecast to resume later in the day.\n\nAt least 31 people were killed in the typhoon that left vast sections of towns in central and eastern Japan under water, with another 15 missing and 186 injured, public broadcaster NHK said.\n\nTyphoon Hagibis, which means “speed” in the Philippine language Tagalog, made landfall on Japan’s main island of Honshu on Saturday and headed out to sea early on Sunday.\n\nMore than 92,000 households were still without power early on Monday, a national holiday, the Ministry of Economy, Trade and Industry said. That was down from 262,000 households as of midday on Sunday.\n\nGroups of rescuers wearing goggles and snorkels searched for survivors while making their way in waist-high water in Nagano, central Japan, where the Chikuma River inundated swaths of land.\n\nLater in the day, rain is forecast to come back to central and eastern Japan, where soil is already loosened by record-breaking rain from the typhoon, raising fears of further flooding and landslides.", "description": "Rescue workers waded through muddy, waist-high waters on Monday searching for missing people after one of the worst typhoons to hit Japan in recent history, with rain forecast to resume later in the day.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191014&t=2&i=1440566262&w=1200&r=LYNXMPEF9D044", "published_at": "2019-10-14"}