{"pub": "abcnews", "url": "https://abcnews.go.com/US/wireStory/mcdonalds-takes-nibble-plant-based-burger-65873594", "downloaded_at": "2019-09-26 15:13:55.156770+00:00", "published_at": "2019-09-26", "title": "McDonald's takes a nibble of the plant-based burger", "language": "en", "text": "McDonald's is finally taking a nibble of the plant-based burger.\n\nInterested in McDonalds? Add McDonalds as an interest to stay up to date on the latest McDonalds news, video, and analysis from ABC News. Add Interest\n\nMcDonald's said Thursday that will sell the PLT, or the plant, lettuce and tomato burger for 12 weeks in 28 restaurants in Southwestern Ontario by the end of the month. McDonald's says it developed a special recipe using burgers from Beyond Meat, a California-based startup that makes \"meat\" from pea protein, canola oil, beet juice and other ingredients.\n\nThe small-market test is rolling out about six months after rival Burger King began testing the plant-based Impossible Foods burger, a rival to Beyond Meat. It's now selling the Impossible Whopper nationwide because of strong demand from customers.\n\nThe entry of McDonald's, the world's largest burger chain, into the alternative meat arena has largely been seen as a question of when, and not if. Shares of Beyond Meat Inc. rose more than 11% to close at $154.34.\n\nThe burgers aren't really aimed at vegans or vegetarians, but at meat eaters who perceive plant-based eating as healthier and more environmentally conscious. In a recent survey, the consulting firm AlixPartners found that 61% of U.S. meat eaters sometimes order vegan or vegetarian food at restaurants.\n\nMcDonald's says the PLT will be grilled on the same grill used for meat and eggs. Burger King will cook it separately, but only by request.\n\nPETA, the animal rights organization, says it's happy to see more plant-based options on fast food menus, even if they're cooked next to meat.\n\n\"To PETA, helping animals is not about personal purity, it's about reducing suffering,\" PETA President Ingrid Newkirk said in a statement. \"McDonald's is doing that by serving them, and its customers are doing that by buying them.\"\n\nIt's been a breakthrough year for the companies that are trying to perfect the no-meat burger.\n\nBeyond Meat became a publicly traded company in May when it listed its shares for $45 on the Nadaq. By July, those shares had risen more than 430%. Impossible Foods has raised more than $750 million, but remains private.\n\nKFC last month began testing plant-based chicken nuggets and boneless wings at an Atlanta restaurant in partnership with Beyond Meat. Carl's Jr. and Del Taco also selling Beyond Meat products. Tim Hortons has tested a Beyond Meat breakfast sausage in Canada.\n\nImpossible Foods announced in May that it was making meatless \"sausage\" crumbles for the Little Caesars pizza chain in some states.\n\nFans of Wendy's have begun a petition to get the chain to add a plant-based burger to the menu. It's garnered more than 26,000 signatures as of Thursday and earlier this month, CEO Todd Penegor said plant-based burgers are a \"trend that will be here to stay.\"\n\nMcDonald's is pushing forward, albeit in a very limited introduction.\n\n\"Why just a small test? We're in learning mode, so testing is a major part of how we develop our menu,\" wrote Ann Wahlgren, McDonald's vice president of global menu strategy. \"It's how we look- before we leap.\"", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/WireAP_a5bfba336b504b0391d65ff2975f6c7c_16x9_992.jpg"}