{"pub": "yahoo", "url": "https://news.yahoo.com/formal-impeachment-inquiry-launched-heres-093933016.html", "downloaded_at": "2019-09-27 02:45:44.054457+00:00", "title": "A formal impeachment inquiry has been launched: Here's everything we know about the whistleblower complaint and Trump's phone call with Ukraine's president", "language": "en", "text": "President Donald Trump speaks during a meeting at the InterContinental Barclay hotel during the United Nations General Assembly, Monday, Sept. 23, 2019, in New York. The conversation between Trump and Ukraine’s president is just one piece of the whistleblower’s overall complaint _ made in mid-August _ which followed Trump’s July 25 call. (AP Photo/Evan Vucci)\n\nAssociated Press\n\n\n\n\n\nOn Tuesday evening, House Speaker Nancy Pelosi announced that the House will launch a formal impeachment inquiry against President Donald Trump.\n\nOne hundred sixty-nine out of 235 House Democrats support impeaching Trump.\n\nThe impeachment inquiry is linked to a call between Trump and Ukrainian President Volodymyr Zelensky on July 25.\n\nTwo weeks after the call, on August 12, an unnamed intelligence official lodged a formal whistleblower complaint and said they were deeply troubled by a phone call Trump had with a foreign leader, particularly \"a promise\" Trump made.\n\nThe White House eventually released summary notes from the phone call confirming reports that Trump pressed Zelensky to open an investigation into corruption allegations against former Vice President Joe Biden and his son, Hunter Biden.\n\nWe still don't know the precise details of the complaint or why it was of \"urgent concern.\"\n\nFrom impeachment proceedings to the phone call between Trump and Zelensky, to details on the whistleblower to Rudy Giuliani's connection to the scandal, here's everything Business Insider has learned.\n\nOn September 24, House Speaker Nancy Pelosi announced that the House will launch a formal impeachment inquiry against Trump.\n\n\"I'm directing our six committees to proceed with their investigations under that umbrella of an impeachment inquiry,\" Pelosi said at press conference. \"The president must be held accountable. No one is above the law.\"\n\nA majority of House members — 218 out of 435 — support some form of impeachment inquiry.\n\nThe move is linked to a July 25 phone call between President Donald Trump and Ukrainian President Volodymyr Zelensky. An intelligence official lodged a whistleblower complaint two weeks after the call, on August 12. The Intelligence Community Inspector General, Michael Atkinson, deemed it \"credible\" and of \"urgent concern,\" and passed the complaint on to acting Director of National Intelligence (DNI) Joseph Maguire.\n\nMaguire did not transmit the complaint to Congress within the required seven day timeframe.\n\nThe White House released a summary of the phone call on September 25, confirming reports that Trump pressed Zelensky to open an investigation into corruption allegations against former Vice President Joe Biden and his son, Hunter Biden.\n\nAccording to the memo, the Ukrainian leader asked Trump about military aid to Ukraine, which Trump had frozen in the days leading up to the call. Trump then pressed Zelensky to work with US Attorney General William Barr to probe the Bidens.\n\nTrump has denied that he said anything inappropriate during the phone call.\n\nThe complaint has been declassified and is set to be released to public on Thursday, CNN reported.\n\nHere's what we learned so far about impeachment proceedings, the whistleblower complaint, and Rudy Giuliani's involvement. Each bullet point links to a full article on the subject.\n\nHouse Speaker Nancy Pelosi announces impeachment inquiry\n\nWhat we know about the whistleblower complaint\n\nWhat's going on with Ukraine?\n\nWhat is Rudy Giuliani's involvement?\n\nNOW WATCH: 7 secrets about Washington, DC landmarks you probably didn't know", "description": "Here's what we learned so far about the whistleblower complaint, the phone call at the center of it, and Rudy Giuliani's involvement.", "authors": ["Lauren Frias"], "top_image": "https://s.yimg.com/uu/api/res/1.2/zM6QOxl4nzWiEcOzFV1jgw--~B/aD00NDc2O3c9NTk2ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/business_insider_articles_888/04205d86f79e3883106242757d218bb8", "published_at": "2019-09-26"}