{"pub": "foxnews", "url": "https://foxnews.com/media/jim-jordan-coup-trump-russia-fisa-abuse", "downloaded_at": "2019-09-16 23:13:55.886529+00:00", "title": "Rep. Jordan backs up McCarthy's remark that US almost had 'coup' from Trump-Russia probe", "language": "en", "text": "Rep. Jim Jordan, R-Ohio, touted Monday the upcoming release of Justice Department Inspector General Michael Horowitz's report on the FBI's alleged abuse of the Foreign Intelligence Surveillance Act (FISA) during the Russia investigation.\n\nThe ranking Republican on the House Oversight Committee told “America's Newsroom” that he expects the report to be released within weeks.\n\nThe comments came after House Minority Leader Kevin McCarthy, R-Calif., promised Sunday on Fox News Channel that the guilty parties--including former FBI leaders James Comey and Andrew McCabe--will be held accountable.\n\nMCCARTHY PROMISES ACCOUNTABILITY AS BARR REVIEWS IG’S FISA REPORT: ‘THE CLOSEST WE’VE EVER SEEN TO A COUP’\n\n\"We came the closest ever to this country having a coup, and now we need accountability,\" he said on \"Sunday Morning Futures.\"\n\nWhen asked if there will really be accountability, McCarthy promised, \"Yes.\"\n\n“Kevin’s characterization of this is exactly right,” Jordan said, pointing to the actions already uncovered by Horowitz.\n\nHe said lawmakers have learned from Horowitz about the romantic relationship between anti-Trump FBI employees Peter Strzok and Lisa Page, lies under oath by McCabe and about the attempt by Comey to \"trap\" Trump at a meeting at Trump Tower before he became president.\n\nDOJ WATCHDOG SUBMITS DRAFT REPORT ON ALLEGED FISA ABUSES TO BARR\n\nJordan said potential prosecutions for such activity will be determined by U.S. Attorney John Durham, who was tapped by Attorney General Bill Barr in May to probe the origins of the Trump-Russia investigation. He said it will be \"a while\" before Durham's probe is concluded.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nHorowitz's next report will address concerns over whether or not the FBI acted improperly in obtaining a FISA warrant to monitor former Trump campaign adviser Carter Page in the early stages of their investigation of Russian election interference and possible Trump campaign connections.\n\nThe Inspector General's office has already turned over a draft of its findings to Barr.\n\nFox News' Ronn Blitzer contributed to this report.", "description": "Rep. Jim Jordan, R-Ohio, touted Monday the upcoming release of Justice Department Inspector General Michael Horowitz's report on the FBI's alleged abuse of the Foreign Intelligence Surveillance Act (FISA) during the Russia investigation.", "authors": ["Joshua Nelson", "Joshua Nelson Is A Freelance Reporter For Fox News."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Screen-Shot-2019-09-16-at-12.29.50-PM.png", "published_at": "2019-09-16"}