{"pub": "scmp", "url": "https://yp.scmp.com/blog/98452/13-reasons-why-cats-are-just-plain-evil", "downloaded_at": "2019-10-24 14:09:22.216818+00:00", "title": "13 reasons why cats are just plain evil", "language": "en", "text": "I hate cats. There, I said it. Now, while we wait for the internet to descend on me like Sauron’s army, I shall explain why.\n\nAnyone that knows me knows I am not an animal person. Years of nameless, non-descript goldfish, hamsters, rabbits and guinea pigs have created in me a passive indifference to most pets and instilled in me a very “meh” attitude to anything cute and fluffy. I just don't get it. However, there is one thing in particular that baffles me beyond belief, and that's cat videos. Fawning over cats has to be the biggest mystery in the history of the internet, so here are some reasons why you should stop treating cats like balls of innocent, do-no-wrong goodness.\n\nCats don't understand 'no'\n\nLet's be real here. Cats have an attitude problem. No other animals are as moody, temperamental or as difficult to please as cats. You might think you're investing all that time and energy into building a beautiful relationship with your pet. You aren't. Your cat has absolutely no interest in you as a person. You won't be able to train your cat, and they don't have any loyalty to you. This is because cats are naturally unresponsive to punishment; they only respond to praise and rewards. So no matter how many times you spray Mr Bojangles with water for clawing the sofa, he'll never learn.\n\nCats are arrogant\n\nThey definitely have a bad attitude, but even worse, they think they're better than you. They prance around like they own the place, peeing everywhere and expecting you to clean it up for them. They know you will wait on them hand and foot and provide them with a constant supply of food. If a human treated you like that, would you accept it? Of course not.\n\nCats are manipulative\n\nYou probably know that cats purr. An interesting fact that you might not know is that cats also have a “cry” which they use to manipulate humans. This cry is strikingly similar to the cry of a baby or a small child, and humans are programmed to respond to this and try to help. If anything, this proves that even cats know they are evil creatures, and they have to impersonate our children to try and manipulate us into doing their bidding.\n\nOld Snowball isn't as cute now, is he? Photo: Pinterest\n\nCats make you more stupid\n\nOkay, it’s not cats themselves that make you more stupid. It’s the cat videos. The average person has probably spent 7,638 hours watching cat videos. And by spent, I mean wasted. What do you have to show for those hours? Maybe a shortcut to the cutest cat video on the internet, but nothing of real value. You could have read 300 life-changing books in that time, gone on 47 enlightening walks through nature, had countless deep and meaningful conversations with friends and family. It’s not the internet that is ruining our brains, it’s cat videos. Mindless, dull, repetitive and completely devoid of any value, these are the bane of my life and I can’t understand why anyone wants to waste their time watching them.\n\nCats won’t make eye contact with you\n\nIf they accidentally do lock eyes with you, they will blink and narrow their eyes in an evil-villian-caught-in-the-midst-of-a-dastardly-plan-type way. If that’s not sketchy, I don’t know what is.\n\nCats think you are completely incapable\n\nThat’s right, cats think you are stupid. They hunt and bring you dead animals (we’ll get to their sadistic, murderous instincts in a moment), because they think you are too stupid to catch a bird or a mouse on your own. So, not only do you want to share your bed with an oversized rodent, you praise it for bringing smaller, dead (or half-dead) rodents into your house. Nice.\n\nCats are the favoured pets of witches\n\nEveryone knows witch + broomstick + black cat. And if Disney has taught us anything, it's that witches are inherently evil and don't just want to put a spell on you, they want to kill you (Sleeping Beauty wouldn't have been much of story if Maleficent had done her job properly). Enter cats. The perfect heartless sidekick; they don't care whether you live or die, as long as they're getting some tuna at the end of it.\n\nWho me? I'm just an innocent bystander\n\nCats are murdering monsters\n\nAs mentioned above, they like to kill other animals. For fun. Considering cat lovers are so vocal about their love for all things cute and fluffy, it seems strange that people are happy to ignore the fact that cats are tyrants who pick on mice, birds and other creatures. Not only do they kill them (to arrogantly show you that they’re better than you), they usually play with their prey, torturing the poor animals before a slow and painful death. That doesn't sound like cute kitty behaviour to me. That sounds more like ISIS-style terrorism.\n\nCats are the pet of choice for evil villains\n\nCats and evil villains go together like milk and cookies. Some famous examples include Dr Evil from the Austin Powers movie series, with his ugly cat Mr Bigglesworth, Gargamel and Azrael from the Smurfs, and even in the Harry Potter series, caretaker Filch has his own snitching sidekick in the form of Mrs Norris.\n\nEvil attracts evil. Photo: Tumblr\n\nCats think they own you\n\nAt this point some of you may be declaring that cats love to cuddle you, and love to have their bellies rubbed, and that they brush up against you because they are just oh-so affectionate. Wrong. Cats, like a lot of animals, release scents, and these scents send signals to other cats and other animals. Essentially, when a cat is rubbing up against you or lying in your lap, it doesn't want affection, it is marking you as its property. Yup, you just got owned.\n\nCats make you clean up their crap\n\nHow many cat poops have you seen in the wild? Exactly. That's because in the wild, cats dig holes to bury their business. This is because they don't want to challenge the dominant cat on his own turf, so it's a way of admitting who's boss. Any cat that leaves its poop out is saying, \"I'm the alpha here, I don't think anyone here can challenge me.\" So next time you're cleaning up Snowball's poop, just think about what he's really saying to you.\n\nCats idolise snakes\n\nBetween all that purring and meowing, people conveniently forget that cats also hiss. Just like the stick insect pretends to be a stick to disguise itself from predators, cats also use this technique, called mimicry, to try and put off predators. Most animals, big or small, are scared of snakes, which is why cats send their ears back, hiss and spit, in an attempt to mimic a venomous snake. NBD, just worth noting that cats aspire to be an animal THAT CAN KILL YOU.\n\nThis isn't even a sketch, it's a photo. Photo: Tumblr\n\nCats think humans absolutely stink\n\nOh you thought cats were very clean and sanitary, considering it looks like they are always grooming themselves? Not quite. When they lick their paws, and their fur, and everywhere else for that matter, they aren't trying to give themselves a bath, they just want rid of the disgusting stench of human. Truth hurts.\n\nConclusion: stay away from cats\n\nI'm not saying people shouldn't love their pets. I'm just saying cats aren't as wonderful as everyone makes them out to be. Cats themselves no doubt orchestrated this whole obsession in their quest for world domination, but it's time we put them back in their place.", "description": "I hate cats. There, I said it. Now, while we wait for the internet to descend on me like Sauron’s army, I shall explain why.", "authors": [], "top_image": "https://yp.scmp.com/sites/default/files/styles/900x506/public/images/shutterstock_129390089_1.jpg", "published_at": "2019-10-24"}