{"pub": "yahoo", "url": "https://news.yahoo.com/house-democrats-subpoena-giuliani-trump-043356055.html", "downloaded_at": "2019-10-02 00:37:28.416350+00:00", "title": "Pompeo, Democrats trade intimidation charges in Trump probe", "language": "en", "text": "WASHINGTON (AP) — Setting a defiant tone, the Trump administration resisted Congress' access to impeachment witnesses Tuesday, even as House Democrats warned such efforts themselves could amount to an impeachable offense.\n\nSecretary of State Mike Pompeo tried to delay five current and former officials from providing documents and testimony in the impeachment inquiry that could lead to charges against President Donald Trump. But Democrats were able to set closed-door depositions for Thursday for former special envoy to Ukraine Kurt Volker and next week for ousted U.S. Ambassador Marie Yovanovitch.\n\nThe escalating exchange of accusations and warnings signaled yet another stiffening in the confrontation between the executive and legislative branches amid the Democrats' launching of the impeachment inquiry late last week. That followed a national security whistleblower's disclosure of Trump's July phone call seeking help from the new Ukrainian president in investigating Democratic political rival Joe Biden and Biden's son Hunter.\n\nIn a Tuesday evening tweet, Trump cast the impeachment inquiry as a coup \"intended to take away the Power of the People, their VOTE, their Freedoms, their Second Amendment, Religion, Military, Border Wall, and their God-given rights as a Citizen of The United States of America!\" In fact, a coup is usually defined as a sudden, violent and illegal seizure of government power. The impeachment process is laid out in the U.S. Constitution.\n\nPompeo said the Democrats were trying to \"intimidate\" and \"bully\" the career officials into appearing and claimed it would be \"not feasible\" as demanded. House investigators countered that it would be illegal for the secretary to try to protect Trump by preventing the officials from talking to Congress.\n\nSome Trump supporters cheered Pompeo's muscular response to the Democrats. But it also complicated the secretary's own situation, coming the day after it was disclosed that he had listened in during Trump's July phone call with Ukrainian leader Volodymyr Zelenskiy that helped trigger the impeachment inquiry.\n\n\"Any effort to intimidate witnesses or prevent them from talking with Congress — including State Department employees — is illegal and will constitute evidence of obstruction of the impeachment inquiry,\" said three House chairmen, Adam Schiff of the intelligence committee, Eliot Engel of Foreign Affairs, and Elijah Cummings of Oversight.\n\nThey said that if he was on Trump's call, \"Secretary Pompeo is now a fact witness in the House impeachment inquiry.\" And they warned, \"He should immediately cease intimidating Department witnesses in order to protect himself and the President.\"\n\nOn Wednesday, the State Department's inspector general is expected to brief congressional staff from several House and Senate appropriations, oversight, foreign affairs and intelligence committees on their requests for information and documents on Ukraine, according to an aide familiar with the planning. The inspector general acts independently from Pompeo.\n\nThe committees are seeking voluntary testimony from the current and former officials as the House digs into State Department actions and Trump's other calls with foreign leaders that have been shielded from scrutiny.\n\nIn halting any appearances by State officials, and demanding that executive branch lawyers accompany them, Pompeo is underscoring Attorney General William Barr's expansive view of White House authority and setting a tone for conflicts to come.\n\n\"I will use all means at my disposal to prevent and expose any attempts to intimidate the dedicated professionals,\" Pompeo wrote.\n\nWhen issuing a separate subpoena last week as part of the inquiry, the chairmen of the three House committees made it clear that stonewalling their investigation would be fought.\n\n\"Your failure or refusal to comply with the subpoena shall constitute evidence of obstruction of the House's impeachment inquiry,\" the three chairmen wrote.\n\nDemocrats often note that obstruction was one of the impeachment articles against Richard Nixon, who resigned the presidency in 1974 in the face of almost certain impeachment.\n\nVolker played a direct role in arranging meetings between Rudy Giuliani, who is Trump's personal lawyer, and Zelenskiy, the chairmen said.", "description": "Setting a defiant tone, the Trump administration resisted Congress' access to impeachment witnesses Tuesday, even as House Democrats warned such efforts themselves could amount to an impeachable offense.  Secretary of State Mike Pompeo tried to delay five current and former officials from providing", "authors": ["Lisa Mascaro", "Mary Clare Jalonick", "Jonathan Lemire"], "top_image": "https://s.yimg.com/uu/api/res/1.2/hoxOlgs.b5qFXRcbyMvutw--~B/aD0zNDI0O3c9NTEzNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/0da72f54a0411d4498876a6dc95b5478", "published_at": "2019-10-02"}