{"pub": "nyt", "url": "https://cooking.nytimes.com/recipes/1020002-kale-salad-with-cranberries-pecans-and-blue-cheese?smid=pin-share", "downloaded_at": "2019-09-16 11:59:57.783107+00:00", "title": "Kale Salad With Cranberries, Pecans and Blue Cheese Recipe", "language": "en", "text": "This is a no-recipe recipe, a recipe without an ingredients list or steps. It invites you to improvise in the kitchen.\n\nHow about a kale salad? (Stick with me, please.) Just make a mustardy vinaigrette that’ll stand up to the greens — mustard, olive oil, a splash of lemon juice, salt and pepper — then drizzle it over clean, chopped kale with a host of big-flavored mix-ins that wink at whatever season you’re in without being dorky about it: dried cranberries or currants, say; pecans toasted with maple syrup and a pinch of cayenne; some crumbled blue cheese; a spray of croutons. Sweet, salty, spicy, sour. That and a chilled glass of red wine? Why don’t we eat salads for dinner more often?\n\nSam Sifton features a no-recipe recipe every Wednesday in his What to Cook newsletter. Sign up to receive it. You can find more no-recipe recipes here.", "description": "This is a no-recipe recipe, a recipe without an ingredients list or steps It invites you to improvise in the kitchen.\n\nHow about a kale salad (Stick with me, please.) Just make a mustardy vinaigrette that’ll stand up to the greens — mustard, olive oil, a splash of lemon juice, salt and pepper — then drizzle it over clean, chopped kale with a host of big-flavored mix-ins that wink at whatever season you’re in without being dorky about it: dried cranberries or currants, say; pecans toasted with maple syrup and a pinch of cayenne; some crumbled blue cheese; a spray of croutons", "authors": ["Sam Sifton", "Craig Claiborne With Pierre Franey", "Melissa Clark", "Julia Moskin", "Martha Rose Shulman", "Craig Claiborne", "David Tanis", "Alison Roman", "Erin Jeanne Mcdowell", "Alexa Weibel"], "top_image": "https://static01.nyt.com/images/2019/02/17/dining/17NORECIPE-KALE-SALAD/merlin_147765615_0853b467-3319-4fec-a410-63c6482c9bf9-articleLarge.jpg", "published_at": "2019-02-17"}