{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7598723/Star-Wars-Rise-Skywalker-final-trailer-reveals-showdown-Rey-Kylo.html", "downloaded_at": "2019-10-22 13:45:50.414029+00:00", "title": "Star Wars: The Rise of Skywalker final trailer reveals more about Rey and Kylo", "language": "en", "text": "Advertisement\n\nDisney released the final trailer for their highly-anticipated Star Wars: The Rise of Skywalker during halftime of Monday Night Football on ESPN, while tickets went on sale for the first time.\n\nThe trailer (via Star Wars YouTube) represents the final footage to be showcased before The Rise of Skywalker hits theaters around the world on December 19, with another cryptic tease of Palpatine's (Ian McDiarmid) return, along with Luke Skywalker (Mark Hamill), who was killed in Star Wars: The Last Jedi but is likely returning as a 'Force ghost' to help Rey on her journey.\n\nThe trailer teased even more of the epic showdown between the Force-sensitive Rey (Daisy Ridley), who was seen apparently shifting to the Dark Side in the last trailer sporting a black hood and a dual lightsaber, and Kylo Ren (Adam Driver), who has been trying to follow in the villainous Darth Vader's footsteps.\n\nFinal trailer: Disney released the final trailer for their highly-anticipated Star Wars: The Rise of Skywalker during halftime of Monday Night Football on ESPN, while tickets went on sale for the first time\n\nShowdown: The trailer teased even more of the epic showdown between the Force-sensitive Rey (Daisy Ridley), who was seen apparently shifting to the Dark Side in the last trailer sporting a black hood and a dual lightsaber, and Kylo Ren (Adam Driver), who has been trying to follow in the villainous Darth Vader's footsteps\n\nThe special preview that debuted at D23 in August revealed that Palpatine has returned in some way shape or form, after being killed in the 1983 classic Star Wars: Episode VI - The Return of the Jedi.\n\nAfter hearing his unmistakable laugh in that trailer, his voice is heard again in the final trailer, hinting that Rey and Kylo Ren (or \"Reylo\" as they're known) coming together, may be what has brought him back.\n\n'Long have I waited, and now your coming together is your undoing,' Palpatine says in the new trailer.\n\nPalpatine: The special preview that debuted at D23 in August revealed that Palpatine has returned in some way shape or form, after being killed in the 1983 classic Star Wars: Episode VI - The Return of the Jedi\n\nThe trailer begins with Rey undergoing more training, running through the jungle with a lightsaber while dropping her helmet.\n\nShe's seen making great leaps in the jungle and again in the ruins of a massive ship, while Finn (John Boyega) is heard saying 'the Force brought us together.'\n\nHelmet: The trailer begins with Rey undergoing more training, running through the jungle with a lightsaber while dropping her helmet\n\nGreat leap: She's seen making great leaps in the jungle and again in the ruins of a massive ship, while Skywalker is heard saying 'the Force brought us together'\n\nFinn is seen looking through a pair of binoculars, possibly looking for Rey, before the action shifts to a Resistance base where fighters are gathered around Lando Calrissian (Billy Dee Williams).\n\nWe get a small glimpse of Rose Tico (Kelly Marie Tran), along with Poe Dameron (Oscar Isaac), Chewbacca (Joonas Suotamo) and Finn, with Poe stating, 'We are not alone. Good people will fight if we lead them.'\n\nRey is also seen standing alone on the wreckage of a ship in the middle of a storm with crashing waves, stating, 'People keep telling me they know me, no one does,' before Kylo Ren arrives to meet her, stating, 'I do.'\n\nFinn and Lando: Finn is seen looking through a pair of binoculars, possibly looking for Rey, before the action shifts to a Resistance base where fighters are gathered around Lando Calrissian (Billy Dee Williams)\n\nPoe: We get a small glimpse of Rose Tico (Kelly Marie Tran), along with Poe Dameron (Oscar Isaac), Chewbacca (Joonas Suotamo) and Finn, with Poe stating, 'We are not alone. Good people will fight if we lead them'\n\nReylo: Rey is also seen standing alone on the wreckage of a ship in the middle of a storm with crashing waves, stating, 'People keep telling me they know me, no one does,' before Kylo Ren arrives to meet her, stating, 'I do'\n\nA number of TIE Fighters are seen heading towards an ice planet while Palpatine utters his mysterious line, while we also see a strange throne made of stone.\n\nThere is also what appears to be an Easter Egg in the next shot, where the Millennium Falcon is seen dropping in alongside a slew of other Resistance ships, one of which appears to be the Ghost ship from the animated TV series Star Wars: Rebels.\n\nWhen Palpatine says 'your coming together will be your downfall,' Rey is sitting in the Millennium Falcon cockpit with Chewbacca, as Poe and Finn arrive, so it's possible that the 'coming together' could refer to these friends reuniting after being apart for so long.\n\nGame of Thrones: A number of TIE Fighters are seen heading towards an ice planet while Palpatine utters his mysterious line, while we also see a strange throne made of stone\n\nGhost: There is also what appears to be an Easter Egg in the next shot, where the Millennium Falcon is seen dropping in alongside a slew of other Resistance ships, one of which appears to be the Ghost ship from the animated TV series Star Wars: Rebels\n\nComing together: When Palpatine says 'your coming together will be your downfall,' Rey is sitting in the Millennium Falcon cockpit with Chewbacca, as Poe and Finn arrive, so it's possible that the 'coming together' could refer to these friends reuniting after being apart for so long\n\nThere are more shots of Rey and Kylo's epic duel before a shot of a small creature fixing C-3PO's eyes, which were red in the previous trailers and cause speculation the droid could have somehow gone to the Dark Side.\n\nPoe asks what C-3PO is doing, standing alongside a masked new character named Zorii Bliss (Keri Russell), with Rey, Finn, BB-8 and new droid D-0.\n\n'Taking one last look, sir, at my friends,' C-3PO says as R2-D2 and Chewbacca react, while another important shot shows the late Carrie Fisher as Leia giving Daisy Ridley's Rey a hug.\n\nThere are more shots of Rey and Kylo's epic duel before a shot of a small creature fixing C-3PO's eyes, which were red in the previous trailers and cause speculation the droid could have somehow gone to the Dark Side\n\nHug: Another important shot shows the late Carrie Fisher as Leia giving Daisy Ridley's Rey a hug\n\nMark Hamill's Luke Skywalker is heard saying that 'Confronting fear, it's the destiny of the Jedi, your destiny,' over several brief shots including one intriguing moment where Rey and a masked Kylo Ren team up to destroy a black figure together.\n\nThe trailer ends with an intriguing shot of Rey looking up at what appears to be a hooded Palpatine descending in a chair of some sort, perhaps the throne seen earlier while laughing his nefarious laugh.\n\nThe final shot shows Rey holding her blue lightsaber with a slight smile, as Luke Skywalker says, 'The Force will be with you,' while Carrie Fisher's Leia adds, 'Always.'\n\nTogether: Mark Hamill's Luke Skywalker is heard saying that 'Confronting fear, it's the destiny of the Jedi, your destiny,' over several brief shots including one intriguing moment where Rey and a masked Kylo Ren team up to destroy a black figure together\n\nRey and Palpatine: The trailer ends with an intriguing shot of Rey looking up at what appears to be a hooded Palpatine descending in a chair of some sort, perhaps the throne seen earlier while laughing his nefarious laugh\n\nThe Force: The final shot shows Rey holding her blue lightsaber with a slight smile, as Luke Skywalker says, 'The Force will be with you,' while Carrie Fisher's Leia adds, 'Always'\n\nDisney also unveiled on StarWars.com the numerous giveaways and special offers available to fans who attend opening night screenings on December 19.\n\nAll guests who attend the following events will receive a special 'Opening Night' commemorative pin plus a special concession offer.\n\nThose who attend the Star Wars Marathon events, with all nine films, receiving an exclusive blanket.\n\nGiveaways: Disney also unveiled on StarWars.com the numerous giveaways and special offers available to fans who attend opening night screenings on December 19\n\nIMAX has unveiled Star Wars Sundays at AMC Theatres, with fans who purchase a Sunday ticket to Star Wars: The Rise of Skywalker (between December 22 and January 12) receiving an exclusive print from artist Dan Mumford.\n\nThere will be four prints released during the four-week promotion, while supplies last, the first of which can be seen below, featuring a rendition of Rey and Kylo Ren's epic battle.\n\nRegal Cinemas is also launching Star Wars Saturdays, a three week promotion on every Saturday from December 21 through January 3.\n\nStar Wars Sunday: IMAX has unveiled Star Wars Sundays at AMC Theatres, with fans who purchase a Sunday ticket to Star Wars: The Rise of Skywalker (between December 22 and January 12) receiving an exclusive print from artist Dan Mumford\n\nThe first 500 fans who purchase Star Wars: The Rise of Skywalker tickets in IMAX at Regal Cinemas will receive an exclusive collectible ticket designed by Tom Whalen, with a new ticket each week in the three-week promotion.\n\nFans who buy tickets at Alamo Drafthouse locations can also purchase exclusive merchandise as well, with a 'light side' and 'dark side' Mondo pint glasses designed by Cesar Romero ($11 each) and a Birth.Movies.Death Star Wars: The Rise of Skywalker special issue ($11).\n\nThose who purchase their Star Wars: The Rise of Skywalker tickets through the Atom Tickets website or app will also be able to purchase an exclusive, framed collector's ticket ($10 with ticket purchase) for a limited time.\n\nCollectible: The first 500 fans who purchase Star Wars: The Rise of Skywalker tickets in IMAX at Regal Cinemas will receive an exclusive collectible ticket designed by Tom Whalen, with a new ticket each week in the three-week promotion\n\nMerch: Fans who buy tickets at Alamo Drafthouse locations can also purchase exclusive merchandise as well, with a 'light side' and 'dark side' Mondo pint glasses designed by Cesar Romero ($11 each) and a Birth.Movies.Death Star Wars: The Rise of Skywalker special issue ($11)\n\nFramed ticket: Those who purchase their Star Wars: The Rise of Skywalker tickets through the Atom Tickets website or app will also be able to purchase an exclusive, framed collector's ticket ($10 with ticket purchase) for a limited time\n\nJ.J. Abrams, who directed 2015's Star Wars: The Force Awakens, directs Star Wars: The Rise of Skywalker from a script he co-wrote with Chris Terrio (Argo, Batman v Superman: Dawn of Justice).\n\nThe cast also includes returning stars Oscar Isaac as Poe Dameron, John Boyega as Finn, Mark Hamill as Luke Skywalker, Domhnall Gleeson as General Hux, with others returning from the original Star Wars trilogy such as Billy Dee Williams' Lando Calrissian, Ian McDiarmind's Palpatine and Anthony Daniels' C-3PO, plus new characters such as Keri Russell's Zorii Bliss and Naomi Ackie's Jannah.\n\nAfter its Thursday opening night screenings on December 19, Star Wars: The Rise of Skywalker will open nationwide on December 20, going up against 20th Century Fox's Bombshell and Universal's Cats.\n\nDirector: J.J. Abrams, who directed 2015's Star Wars: The Force Awakens, directs Star Wars: The Rise of Skywalker from a script he co-wrote with Chris Terrio (Argo, Batman v Superman: Dawn of Justice)\n\nReturn: The cast also includes returning stars Oscar Isaac as Poe Dameron, John Boyega as Finn, Mark Hamill as Luke Skywalker, Domhnall Gleeson as General Hux, with others returning from the original Star Wars trilogy such as Billy Dee Williams' Lando Calrissian, Ian McDiarmind's Palpatine and Anthony Daniels' C-3PO, plus new characters such as Keri Russell's Zorii Bliss and Naomi Ackie's Jannah", "description": "Disney released the final trailer for their highly-anticipated Star Wars: The Rise of Skywalker during halftime of Monday Night Football on ESPN, while tickets went on sale for the first time.", "authors": ["Brian Gallagher For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/03/20017104-0-image-a-67_1571711771594.jpg", "published_at": "2019-10-22"}