{"pub": "businessinsider", "url": "https://businessinsider.com/new-southwest-companion-pass-requirements-adjust-strategy-cards-2019-10", "downloaded_at": "2019-10-26 02:15:20.666414+00:00", "title": "Southwest is making it harder to earn the Companion Pass in 2020 — here's how to adjust your credit card strategy", "language": "en", "text": "Southwest offers its most frequent flyers the Companion Pass. This benefit lets you bring a friend or family member along on all Southwest flights, for only the cost of taxes and fees.\n\nEarning the Companion Pass has historically required earning 110,000 qualifying points or completing 100 qualifying flight segments in a year, but starting in 2020 the requirements will go up.\n\nNext year, you'll need to earn 125,000 qualifying points to secure the Companion Pass. The qualification for flight segments will remain the same, at 100 segments.\n\nQualifying by earning points is the most viable strategy for many travelers. You can work toward the 125,000 points by signing up for a Southwest consumer credit card like the Southwest Rapid Rewards Premier Credit Card and/or a business card like the Southwest Rapid Rewards Performance Business Credit Card.\n\nRead more personal finance coverage.\n\nSouthwest recently announced that it's increasing the requirements to earn the Companion Pass in 2020. The Companion Pass is one of the best deals for domestic travel — once you earn it, you can designate a friend or family member to travel with you on Southwest flights for almost free (you just have to pay taxes and fees).\n\nSo if you fly Southwest and were planning to earn the Companion Pass, you'll want to pay attention to this update and consider how it could affect your strategy going forward.\n\nHow the Southwest Companion Pass works\n\nOnce you earn the Companion Pass, you can take a companion on any flight with you for only the cost of taxes and fees ($5.60 for domestic U.S. flights). It doesn't matter whether you book your flights with cash or with points — you'll still be eligible to bring a companion.\n\nAnd here's where things get really good — the Southwest Companion Pass is good for the rest of the year in which you earn it and the entirety of the following year. So, if you earn the Companion Pass in February 2020, it will be valid until the end of December 2021 — a full 23 months!\n\nBut, if you earn the Southwest Companion Pass in December 2019, it will only be good for 13 months, until the end of December 2020. To maximize the amount of travel you'll be able to take with your Companion Pass, you'll want to earn it as close to the beginning of the year as possible.\n\nThe new requirements to earn the Companion Pass\n\nStarting in 2020, Southwest flyers will need to earn 125,000 qualifying points or fly 100 flight segments with a calendar year in order to earn the Companion Pass. Previously, the requirement was 110,000 qualifying points or 100 flight segments.\n\nIf you've qualified for the Companion Pass on flight segments in the past (or plan to in the future), there's no change to what you need to do. But, if you plan to qualify for the Companion Pass with points, you'll need to earn an additional 15,000 points within the calendar year. Qualifying for the pass with points is an easier route for most people, as 100 segments in a year is more than most travelers will fly.\n\nAlongside this update to the qualifications for the Companion Pass, Southwest announced that its points will no longer expire, effective immediately.\n\nStrategies to earn the Southwest Companion Pass going forward\n\nThe points you earn from flying on a paid Southwest ticket count toward the Companion Pass, as do points from credit card sign-up bonuses and points from credit card spending.\n\nThat means there's a serious opportunity to earn a bunch of points and qualify for the Southwest Companion Pass relatively quickly by taking advantage of Southwest's co-branded credit card offers. Even though an additional 15,000 points will be required in 2020, you can still make a big dent in that requirement by utilizing credit cards.\n\nHere are the Southwest consumer credit cards available to new applicants, along with their current sign-up bonuses:\n\nAnd here are the Southwest business credit cards:\n\nSouthwest Rapid Rewards Premier Business Credit Card ($99 annual fee) : 60,000-point sign-up bonus after you spend $3,000 in the first three months\n\n: 60,000-point sign-up bonus after you spend $3,000 in the first three months Southwest Rapid Rewards Performance Business Credit Card ($149): 70,000-point sign-up bonus after you spend $5,000 in the first three months\n\nSo, by applying for one of Southwest's business credit cards, you can earn more than half of the points required for the Companion Pass after meeting the minimum spending requirement. And, you can also get a Southwest personal Credit card and earn an additional 40,000 points after meeting minimum spending requirements for a total of 110,000 of the required 125,000 points for the Companion Pass. Note that you can only have one Southwest business card and one Southwest personal card at a time.\n\nOn the way to meeting the minimum spending requirements for each Southwest card, you'll have earned at least 4,000 additional points (assuming none of your spending earned points in any bonus categories). That means you'll be only 11,000 points away from earning your Companion Pass.\n\nIn order to earn those last 11,000 points, you can fly Southwest, spend on your credit card, or even shop through the Southwest Airlines Rapid Rewards shopping portal.\n\nThe Southwest Companion Pass is still one of the greatest deals in the sky for domestic travel, but it's now going to be a little more difficult to earn. Flyers will need to earn 125,000 points in a calendar year or fly 100 flight segments to qualify for the Southwest Companion Pass. Luckily, more than just flying counts toward the points earned, so with a solid credit card strategy you'll still be able to earn the Companion Pass fairly easily.", "description": "Southwest is increasing the requirements for earning the Companion Pass. You'll need to earn 15,000 more points, but it's doable with the right cards.", "authors": ["Caroline Lupini"], "top_image": "https://image.businessinsider.com/5db0980a4af909577721b876?width=1200&format=jpeg", "published_at": "2019-10-24"}