{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/25/case-keenum-misses-practice-foot-injury", "downloaded_at": "2019-09-25 23:27:11.068580+00:00", "title": "Case Keenum misses practice with foot injury", "language": "en", "text": "ASHBURN — Redskins quarterback Case Keenum missed practice Wednesday with a foot injury.\n\nCoach Jay Gruden said Keenum underwent an MRI in the morning, two days after the Redskins’ 31-15 loss to the Chicago Bears. The 31-year-old quarterback was “pretty sore” following the game, Gruden said.\n\nAs of now, Gruden said he assumes Keenum will play next week against the New York Giants.\n\nThe Redskins only held a team walkthrough instead of a full practice, but teams are required to give an estimation of what players would have done under normal circumstances.\n\n“We thought it was important to keep him off his feet for the day,” Gruden said. “We’ll see how he is (Thursday).”\n\nAgainst the Bears, Keenum had his worst outing of the year, throwing three interceptions and losing two fumbles. The performance led fans to call for rookie Dwayne Haskins to take over, but Gruden resisted making a change. He told reporters Tuesday Keenum gives the Redskins the best chance to win and is confident his team can recover from its 0-3 start.\n\nIf Keenum can’t play Sunday, Gruden said Haskins would be the likely starter. Colt McCoy, who had been a candidate to start, is still battling the leg injury he suffered last season and the Redskins need him to see him practice first. He participated in the Wednesday’s walkthrough for the first time since mid-August, but did not throw a pass.\n\nGruden did not say if he intends for McCoy to supplant Haskins for the backup job, if the veteran is healthy.\n\n“If (Keenum) can’t go (Thursday), then obviously the other guys will get the reps, which will be good,” Gruden said. “So that’s a win-win. And if he’s better Friday, and if Case feels like he can go, he can go. We’ll just wait and see.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Keenum,  who threw three interceptions and lost two fumbles against Chicago, underwent an X-Ray following the Bears game.", "authors": ["The Washington Times Http", "Matthew Paras"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/24/Bears_Redskins_Football_52623.jpg-e6364_c0-0-4682-2729_s1770x1032.jpg?5a34d9cf5b8fd1cfff406eaddf9e9af420e262b5", "published_at": "2019-09-25"}