{"pub": "huffpost", "url": "https://huffpost.com/entry/devin-nunes-drops-lawsuit-fake-farmer_n_5d714bc1e4b03b3b730a6814", "downloaded_at": "2019-09-06 12:10:51.848238+00:00", "title": "Devin Nunes Drops Lawsuit Against Constituents Who Called Him A 'Fake Farmer'", "language": "en", "text": "The campaign of Rep. Devin Nunes (R-Calif.) has dropped its lawsuit against a group of constituents who accused him of being a “fake farmer.”\n\nAn attorney for Nunes filed the lawsuit in Tulare County Superior Court last month, claiming the group and other parties — including McClatchy, parent company of the Fresno Bee newspaper — conspired with progressive “dark money” organizations to hurt Nunes’ 2018 reelection campaign.\n\nPeter Kapetan, the attorney who represented the campaign in the lawsuit, confirmed to the Bee on Wednesday that Nunes’ campaign had dropped the litigation.\n\n“We gathered further evidence which supports the plaintiff’s overriding concerns that dark money is being used to influence our elections,” Kapetan said. “Given the new evidence recently discovered, the Nunes campaign committee voluntarily dismissed the lawsuit, and the allegations underlining the lawsuit will be incorporated in a [racketeering] lawsuit filed in Virginia today.”\n\nNunes’ campaign did not respond to HuffPost’s request for further comment.\n\nThe constituent group, which includes a retired farmer and an agrarian scholar, petitioned last year to change the text on Nunes’ ballot label, which describes him to voters as a farmer. They argued that Nunes no longer farms and thus cannot justify calling himself a farmer on the California ballot.\n\nThe group also distributed mailers in Nunes’ district referring to him as a “fake farmer,” according to The Hill.\n\nEsquire magazine reported last year that the Nunes family dairy farm moved to Iowa, thousands of miles from the lawmaker’s California home, in 2006.\n\nSacramento Superior Court Judge Allen Sumner ultimately ruled that Nunes can continue to call himself a farmer.\n\nThe defendants in Nunes’ suit included retired organic fruit tree farmer Paul Buxman, librarian Hope Nisly and agrarian scholar Daniel O’Connell, as well as Michael Seeley, a member of the political group Southern California Americans for Democratic Action.\n\nIn an interview with the Bee last month, Buxman said he petitioned to have Nunes’ ballot changed to make it “honest.” He said he had no idea what “dark money” is, and that he was not seeking any monetary damage or award. When he heard about the suit, he said, he prayed for Nunes.\n\nBrian Whelan, an attorney who represented Buxman and other defendants, said in a news release that his clients “prevailed and won without having had to square off.”\n\nThe new suit Kapetan alluded to is a $9.9 million federal conspiracy lawsuit, filed Wednesday, that names Fusion GPS founder Glenn Simpson and the nonprofit Campaign for Accountability. Fusion GPS is the opposition research firm behind the Steele dossier, a document made public in 2017 that outlined alleged ties between President Donald Trump and Russia. The Campaign for Accountability filed ethics complaints against Nunes last year.\n\nWhelan noted to the Bee that none of his clients are named in the new lawsuit.", "description": "The Republican lawmaker accused the group, which includes a retired fruit tree farmer, of conspiring with \"dark money\" organizations to hurt his campaign.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d714c77250000e213051a68.jpeg?cache=bopzoycq7t&ops=1778_1000", "published_at": "2019-09-05"}