{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/gty-technology-holdings-provides-details-on-q3-earnings-call", "downloaded_at": "2019-10-29 15:07:20.747278+00:00", "title": "GTY Technology Holdings Provides Details on Q3 Earnings Call", "language": "en", "text": "AUSTIN, Texas — GTY Technology Holdings Inc. (Nasdaq: GTYH) (“GTY”), a leading vertical SaaS/Cloud solution for the public sector, will hold its Q3 2019 earnings call at 8:30 am ET on Thursday, November 7, 2019. Conference call details are listed below:\n\nConference ID: 5488886\n\nParticipant Toll Free Dial-In Number: (866) 211-4672\n\nParticipant International Dial-In Number: (647) 689-6739\n\nAbout GTY Technology Holdings Inc.\n\nGTY Technology Holdings Inc. (NASDAQ: GTYH) (“GTY”)) brings leading government technology companies together to achieve a new standard in citizen engagement and resource management. Through its six business units, GTY offers an intuitive cloud-based suite of solutions for state and local governments spanning functions in procurement, payments, grant management, budgeting, and permitting: Bonfire provides strategic sourcing and procurement software to enable confident and compliant spending decisions; CityBase provides government payment solutions to connect constituents with utilities and government agencies; eCivis offers a grant management system to maximize grant revenues and track performance; Open Counter provides government payment software to guide applicants through complex permitting and licensing procedures; Questica offers budget preparation and management software to deliver on financial and non-financial strategic objectives; Sherpa provides public sector budgeting software and consulting services.\n\nForward-Looking Statements\n\nThis press release includes “forward-looking statements” within the meaning of the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995. The company’s actual results may differ from its expectations, estimates and projections and, consequently, you should not rely on these forward looking statements as predictions of future events. Words such as “expect,” “estimate,” “project,” “budget,” “forecast,” “anticipate,” “intend,” “plan,” “may,” “will,” “could,” “should,” “believes,” “predicts,” “potential,” “continue,” and similar expressions are intended to identify such forward-looking statements. These forward-looking statements include, without limitation, the company’s expectations with respect to future performance and anticipated impacts of the business combination. These forward-looking statements involve significant risks and uncertainties that could cause the actual results to differ materially from the expected results. Most of these factors are outside of the company’s control and are difficult to predict. Factors that may cause such differences include, but are not limited to: (1) the ability to recognize the anticipated benefits of GTY’s recent business combination transaction, which may be affected by, among other things, competition, the ability of the company to grow and manage growth profitably and retain its key employees; (2) costs related to the business combination; (3) the outcome of the New York and California lawsuits among the company, OpenGov, Inc. and the other parties thereto; (4) the inability to maintain the listing of the company’s common stock on The Nasdaq Stock Market; (5) changes in applicable laws or regulations; (6) the possibility that the company may be adversely affected by other economic, business, and/or competitive factors; (7) any government shutdown which impacts the ability of the company’s customers to purchase its products and services; and (8) other risks and uncertainties included in the company’s registration statement on Form S-1 (File No. 333-229926), including those under “Risk Factors” therein, and in the company’s other filings with the SEC. We caution you that the foregoing list of factors is not exclusive, and readers should not place undue reliance upon any forward-looking statements, which speak only as of the date made. We do not undertake or accept any obligation or undertaking to release publicly any updates or revisions to any forward-looking statements to reflect any change in our expectations or any change in events, conditions or circumstances on which any such statement is based.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191029005726/en/\n\nContacts\n\nCarter Glatt\n\nSenior Vice President, Corporate Development, GTY\n\ncarter@gtytechnology.com\n\n702-945-2898", "description": "AUSTIN, Texas — GTY Technology Holdings Inc. (Nasdaq: GTYH) (“GTY”), a leading vertical SaaS/Cloud solution for the public sector, will hold its Q3 2019 earnings call at 8:30 am ET on Thursday, November 7, 2019.", "authors": [], "top_image": "https://mms.businesswire.com/media/20191029005726/en/737747/3/GTYLogo_%282%29.jpg", "published_at": "2019-10-29"}