{"pub": "abcnews", "url": "https://abcnews.go.com/International/russia-us-diplomats-approached-missile-test-site-location/story?id=66344451", "downloaded_at": "2019-10-18 01:07:33.061514+00:00", "title": "Russia says US diplomats approached missile test site, location of radioactive blast", "language": "en", "text": "Russia's foreign ministry on Thursday said three American diplomats who were briefly detained in northern Russia had approached a closed military test site where a radioactive blast occurred in August.\n\nThe U.S. diplomats were reported on Wednesday to have been stopped and removed from a train travelling between the closed port city of Severodvinsk and Nenoksa, a village next to the test site on the White Sea in Russia's Arctic.\n\nThe American embassy confirmed the incident, but said the diplomats had informed Russian authorities of their travel in advance.\n\nRussia's foreign ministry said the diplomats had told Russian authorities they intended to visit a different city, Arkhangelsk, which isn't within a restricted zone, but then traveled to the closed area next to the test site.\n\n\"Clearly, they got lost,” the foreign ministry said. \"We are ready to give the U.S. embassy a map.\"\n\nThe ministry spokeswoman, Maria Zakharova, told reporters on Thursday the American diplomats had made two attempts to reach the restricted zone, travelling to Severodvinsk, a port city that's home to Russia's nuclear submarine fleet, with the goal of travelling to an area near the test site.\n\nThe three diplomats were stopped by police at a train station on their first attempt and turned back, but then rented a car with and returned to Severodvinsk.\n\n\"There, they took a local train and went to a populated area where there is a testing ground and other defense facilities nearby,\" Zakharova said. She said Russia would file a formal complaint to the U.S. embassy in Moscow.\n\nA State Department spokesperson told ABC News on Thursday: \"Just as Russian diplomats in the United States travel to learn more about the country in which they live and work, our diplomats travel across Russia as part of normal diplomatic activity in order to better understand Russia. As we’ve said before, the American diplomats were on official travel and had properly filed a travel notification with the Russian authorities.\"\n\nThe State Department earlier had declined to comment on the incident other than to say the three had been on \"official travel and had properly notified Russian authorities.\" Russian media has named the three diplomats as military attaches, but American officials have not identified them.\n\nAFP via Getty Images, FILE\n\nThe village of Nenoksa is located next to a secretive military firing range where Russia is known to test missiles. In August, there was an explosion close to the range that killed at least five people and briefly caused radiation levels to spike 16 times above the norm, sparking a nuclear scare.\n\nRussia has wrapped the incident in secrecy, providing few details. But the Russian atomic agency has said that the blast occurred when an experimental nuclear-powered engine exploded during a test. Independent weapons experts and U.S. officials have suggested that the engine likely belonged to a new nuclear-powered cruise missile, code-named \"Skyfall” by NATO, which President Vladimir Putin has said Russia is developing.\n\nThe reports about the American diplomats come just days after a senior State Department official said the U.S. had concluded the explosion happened when Russia was trying to recover one of the missiles from the sea floor after an earlier failed test.\n\n\"The United States has determined that the explosion near Nenoksa, Russia, was the result of a nuclear reaction that occurred during the recovery of a Russian nuclear-powered cruise missile. The missile remained on the bed of the White Sea since its failed test early last year, in close proximity to a major population center,” Thomas DiNanno, of the State Department's Bureau of Arms Control, Verification and Compliance said in a speech at the United Nations.\n\nPutin has touted the missile, which Russia refers to as \"Burevestnik,\" as having essentially unlimited range. The missile is one of several advanced, nuclear-capable weapons the Kremlin has said it is developing in an effort to counter U.S. missile defense systems.\n\nWorries about the blast were exacerbated by Russia's efforts to conceal its details.\n\nRussia's military initially said no nuclear materials were involved and information about the explosion slowly trickled out over several days. The information blackout drew comparisons in Russia and abroad with the 1986 disaster at the Chernobyl nuclear power station, though the amounts of radiation involved were vastly smaller.\n\nABC News' Conor Finnegan contributed to this story.", "description": "Russia says three U.S. diplomats were stopped on a train close to a site where a nuclear-powered missile is believed to have exploded in August", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/russia-nenoksa-explosion-gty-aa-191017_hpMain_16x9_992.jpg", "published_at": "2019-10-17"}