{"pub": "metro", "url": "https://metro.co.uk/2019/10/12/when-did-princess-eugenie-get-married-and-when-is-princess-beatrice-marrying-edoardo-mapelli-mozzi-10903430", "downloaded_at": "2019-10-12 06:46:59.004971+00:00", "title": "When did Princess Eugenie get married and when is Beatrice's wedding?", "language": "en", "text": "Both York sisters will be wed by the end of 2020 (Picture: Getty)\n\nThe Duke of York and Sarah Ferguson have yet another royal wedding in the diary but they couldn’t be happier, as less than a year since their daughter Princess Eugenie got married, their first child Princess Beatrice got engaged.\n\nBeatrice is due to marry Edoardo Mapelli Mozzi, a British property developer who owns a development and interior design company.\n\nThe Princess’ mother, Sarah Ferguson, said she had ‘tears of joy’ at the news that now both of her daughters would be happily married, but when did Princess Eugenie get married and when is her sister Beatrice following in her footsteps?\n\nWhen did Princess Eugenie get married?\n\nPrincess Eugenie’s wedding to Jack Brooksbank took place a year ago on 12 October 2018.\n\nThe couple got married in front of a star-studded audience of 800 guests at St George’s Chapel at Windsor Castle, the same place where Prince Harry wed Meghan Markle the year before.\n\nAdvertisement\n\nAdvertisement\n\nThe private evening reception was held at the Royal Lodge in Windsor and featured a performance by singer Robbie Williams.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nWhen is Princess Beatrice marrying Edoardo Mapelli Mozzi?\n\nPrince Andrew’s oldest daughter Beatrice announced that she was engaged to her boyfriend, businessman Edoardo Mapelli Mozzi, in September 2019, roughly a year after they started dating.\n\n‘We are extremely happy to be able to share the news of our recent engagement. We are both so excited to be embarking on this life adventure together and can’t wait to be married,’ the couple said in an official announcement.\n\nPrincess Beatrice and Edoardo Mapelli Mozzi got engaged in Italy (Picture: PA)\n\n‘We share so many similar interests and values and we know this will stand us in great stead for the years ahead, full of love and happiness.’\n\n‘I know what a mother feels so I have tears of joy. I am so proud of this sensational news,’ Princess Beatrice’s mother Sarah Ferguson wrote on Twitter. ‘Andrew and I are just the luckiest people ever to have two great sons in law.’\n\nPrince Andrew, Duke of York is eight in line to the throne (Picture: Mark Cuthbert/UK Press via Getty Images)\n\nThe wedding is due to take place next year, in 2020, but further details of the event are yet to be announced, including the date and the wedding venue, although Sarah Ferguson has insisted that the nuptials will definitely be in the UK.\n\nAdvertisement\n\nAdvertisement\n\nMORE: How old is Prince Andrew, who are his daughters and what is his relationship with Sarah Ferguson?\n\nMORE: Who is Princess Beatrice’s boyfriend Edoardo Mapelli Mozzi as the pair announce their engagement?", "description": "Less than a year after Princess Eugenie got married to Jack Brooksbank, her sister Princess Beatrice got engaged to Edoardo Mapelli Mozzi.", "authors": ["Rachael Martin"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89453490_1570813427.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-12"}