{"pub": "bbc", "url": "https://bbc.co.uk/news/entertainment-arts-49726068", "downloaded_at": "2019-09-17 23:30:03.799269+00:00", "title": "Amazon launches HD music streaming", "language": "en", "text": "Image copyright AFP Image caption Taylor Swift's music will be available in \"Ultra HD\" on the service from Tuesday\n\nAmazon Music has become the first of the \"big three\" streaming services to offer music in CD-quality audio.\n\nThe service, which costs £5 more than a standard Amazon subscription, will also offer some albums in \"Ultra HD\", which promises to be better-than-CD quality.\n\nUntil now, Amazon, like its main rivals Apple and Spotify, only streamed music in compressed formats like MP3 and AAC.\n\nSome smaller services like Tidal, Deezer and Qobuz already offer lossless, high-fidelity streaming.\n\nAmazon is calling its service \"HD\" because customers are familiar with the term from television, but it will actually use the same file format - FLAC - as its competitors.\n\nAll three of the major record labels have signed up, with music by Fleetwood Mac, Kendrick Lamar, Taylor Swift, Stormzy and Ed Sheeran now available in Ultra HD.\n\nThe big question, according to Chris Cooke of Complete Music Update, is whether \"Amazon can take what has traditionally been a niche product and make it more mainstream\".\n\nThere have been several attempts to market HD audio in the past, from DVD-Audio and Super Audio CDs to high-quality download stores like Neil Young's ill-fated Pono service. But their audiences have been \"generally quite small\", said Cooke.\n\n\"Anecdotal research suggests that the younger demographic don't really care; and sometimes, even on a decent sound system, it's hard to tell the difference,\" he added.\n\nIndeed in 2015, US radio network NPR ran an online test to see whether its audience could distinguish between three forms of audio compression. On average, it discovered, people only did slightly better than guessing randomly.\n\nImage copyright Amazon Image caption Songs, playlists and albums in HD will be clearly signposted\n\nAmazon's advantage could be its dominance of the smart speaker market, with people listening at home more likely to appreciate a sonic upgrade than commuters streaming music over wireless earbuds.\n\nNotably, the launch of Amazon Music's HD service comes a week before the company unveils its latest range of hardware, which is expected to include a new model of its Echo speaker.\n\nThe service is priced more competitively than its rivals, with a monthly subscription costing £14.99, or £12.99 for Amazon Prime customers.\n\nTidal and Deezer, by comparison, charge £19.99 per month for their lossless tiers.\n\n\"It's interesting they've been able to negotiate that, because I presume Tidal and Deezer will go back to the labels and say, 'We want to bring down the costs of our high-quality audio too,'\" said Cooke.\n\n\"But it may well be that there are such a small number of users on [those services] that the labels are hoping Amazon, being a more mainstream company, will make up for the loss.\"\n\nThe technical bit\n\nSpotify: MP3, 320kbps\n\nApple Music: AAC, 256kbps\n\nAmazon HD: FLAC, 16 bit, 44.1kHz\n\nAmazon Ultra HD: FLAC, 24 bit, 192kHz\n\nIn addition, Amazon Music HD subscribers can stream \"millions more\" songs in Ultra HD, with a bit depth of 24 bits and a sample rate up to 192 kHz.\n\nOne notable enthusiast is Neil Young, who said in a (somewhat hyperbolic) press release that: \"Earth will be changed forever when Amazon introduces high quality streaming to the masses.\n\n\"This will be the biggest thing to happen in music since the introduction of digital audio 40 years ago,\" he added.\n\nSome of the additional money generated by the new service will go to artists and rights-holders, but Amazon could not discuss the terms of its new licensing deals. It confirmed, however, that there were no current plans to offer lossless music for sale on its download store.\n\nFollow us on Facebook, or on Twitter @BBCNewsEnts. If you have a story suggestion email entertainment.news@bbc.co.uk.", "description": "The company is the first of the \"big three\" streaming services to offer CD-quality audio.", "authors": ["Mark Savage", "Bbc Music Reporter"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/10CFF/production/_108836886_2a62da47-282b-4117-ba56-1fc1f104ad9b.jpg", "published_at": "2019-09-17"}