{"pub": "afr", "url": "https://afr.com/chanticleer/westpac-s-big-austrac-dilemma-20191007-p52ydk", "downloaded_at": "2019-10-07 19:58:10.269089+00:00", "title": "Westpac's big AUSTRAC dilemma", "language": "en", "text": "AUSTRAC initiated court proceedings against CBA in August 2017 with the delivery of a 583-page statement of claim. There was some confusion at the time as to whether or not CBA had been ambushed in court.\n\nAUSTRAC denied it had blindsided the bank. But it went through the rigmarole of the court prosecution process before settling the case in June 2018.\n\nIn relation to the breaches by Westpac, an AUSTRAC spokesman confirmed in an emailed statement that the agency was working with the bank in relation to AML/CTF “compliance issues”.\n\n“It is not appropriate for us to provide details at this point in time,” the spokesman said. A Westpac spokesman declined to comment.\n\nFinancial penalty\n\nThe financial world would have come to a very strange place if AUSTRAC was eventually found to have been working on a strategy for prosecuting Westpac for breaches of AML/CTF laws rather than discussing with the bank a settlement of the matter.\n\nIt would be worrying if the financial intelligence agency deferred the imposition of a financial penalty on Westpac for the sake of enhancing its reputation as a tough regulator through the publicity gained from prosecuting the institution.\n\nAdvertisement\n\nProvisioning by boards of directors is already fraught with difficulty as shown by the gradual growth over the past two years of the cost of remediation of banking and wealth management customers.\n\nThe big four banks have put aside $6.38 billion in remediation provisions since 2017, according to UBS banking analyst Jonathan Mott.\n\nIn Westpac’s case, the wealth and banking remediation started in the second half of 2017 with a $118 million provision. The total, in pre-tax terms, has since ballooned to $1.44 billion.\n\nThe growth in remediation provisions is even greater at National Australia Bank. As of March this year its total provision for remediation was $1.1 billion. This has since grown to $2.37 billion.\n\nMott pointed out that since 1997 NAB has provisioned $18.8 billion in \"one-off\" charges across 52 separate items.\n\n\"While we believe NAB is now adequately provisioned for the 'known unknowns' including customer remediation, we believe there is a risk of further significant items especially with a new CEO starting in December,\" Mott said in a note to clients.\n\nThe consistent growth in the financial provisions for customer remediation by the boards of directors of the big four banks is partly attributable to the changing assumptions including the period over which compensation is paid and whether or not the financial adviser was a paid employee or an aligned adviser.\n\nProvisioning for breaches of anti-money laundering laws has an added layer of complexity. The only two major fines are CBA's $700 million payment to AUSTRAC and the anti-money laundering penalty against Tabcorp of $45 million.\n\nAdvertisement\n\nUnder accounting standards, Westpac’s directors must consider two questions before making a provision in the profit and loss statement. First, will the issue under consideration lead to probable outflows of cash from the bank?\n\nSecond, can the amount of money involved in the outflows be reliably estimated?\n\nThe answer to the first question is an emphatic yes. Westpac has disclosed in notes to its full-year 2018 accounts and its 2019 half-year accounts that it could be fined for failure to report a large number of International Funds Transfer Instructions (IFTIs) as required under the AML/CTF Act.\n\nThe breaches relate to one product offered by Westpac’s institutional bank, according to disclosures made in November last year and May this year.\n\nBatch instructions\n\n“These IFTIs relate to batch instructions received from 2009 until recently from a small number of correspondent banks for payments made predominantly to beneficiaries in Australia in Australian dollars,” the bank said.\n\n“Through the product, Westpac facilitates payments on behalf of clients of certain of its correspondent banks. The majority of the payments are low value and made by government pension funds and corporates.”\n\nThe bank said that under the AML/CTF law, the “sender” financial institution of an IFTI transmitted out of Australia, or the “recipient” financial institution of an IFTI transmitted into Australia, is required to report the IFTI to AUSTRAC within 10 business days of the instruction being sent or received.\n\nAdvertisement\n\nWestpac failed to do this over nine years. It is no excuse, but no other country in the world imposes this reporting obligation on correspondent banking relationships.\n\nThe answer to the second question facing Westpac’s directors is harder to ascertain than the first.\n\nIf AUSTRAC has not shared with the bank the likely fines involved in this case, the directors will struggle to calculate a reliable estimate of the cost to shareholders.\n\nAlso, the directors probably need to have some insight from AUSTRAC as to whether it will consider ameliorating circumstances.\n\nThese include the fact that Westpac self-reported the breaches, that the amounts of money involved in the bank transfers were small and Westpac remained a valuable partner of the Fintel Alliance, an organisation formed by AUSTRAC in 2017 to step up the fight against money laundering, terrorism financing and other serious crime.\n\nWestpac said in its half-year report that it was working to remediate its failure to report IFTIs.\n\n\"While the group has systems, policies, processes and controls in place that are designed to manage its financial crime obligations (including its reporting obligations), these may not always have been or continue to be effective, with the group currently working to address areas of control weaknesses in its financial crime management framework,\" the bank's latest risk factors report said.\n\n\"If we fail to comply with these obligations it could impact the ability of financial crime regulators and law enforcement bodies to deal with and minimise financial crime, and we could face regulatory enforcement action such as litigation, significant fines, penalties and the revocation, suspension or variation of licence conditions.\n\n\"Non-compliance could also lead to litigation commenced by third parties (including class action proceedings) and cause reputational damage. These actions could, either individually or in aggregate, adversely affect our business, prospects, reputation, financial performance or financial condition.\"\n\nIn effect, Westpac's directors have put shareholders on alert that its breaches of AML/CTF laws could be very costly.", "description": "Based on its past actions, the financial intelligence regulator will take Westpac to court for breaches of anti-money laundering laws instead of going straight to a pragmatic settlement.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.8054%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_142/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/115a382822b67c970e52e5128908c7bfa2493fc0", "published_at": "2019-10-07"}