{"pub": "metro", "url": "https://metro.co.uk/2019/10/20/incredible-moment-hero-teacher-hugs-student-holding-loaded-shotgun-10950196", "downloaded_at": "2019-10-20 12:29:27.736819+00:00", "title": "Incredible moment hero teacher hugs student holding loaded shotgun", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nA football coach has been hailed a hero for disarming a student holding a loaded shotgun before giving him a bear hug.\n\nThe teacher was filmed by the school’s security cameras as he took the weapon off Angel Granados-Diaz, 19, at a high school in Oregon US.\n\nOther students reportedly ran screaming from the building during the incident on 17 May this year.\n\nIn new footage, Keanon Lowe, 27, wrestled with Granados-Diaz for the weapon before hugging him in a corridor of Parkrose High School.\n\nAdvertisement\n\nAdvertisement\n\nInvestigators believe the student – then 18 – was suffering a mental health crisis at the time and brought the gun into school with the intention of taking his own life.\n\nHe did not intend to harm anyone else with the gun, police said.\n\nFootball coach Keanon Lowe hugs the student after throwing the gun to another teacher (Picture: Multnomah County District Attorney)\n\nThe coach said he kept Granados-Diaz in a bear hug until police arrived (Picture: Multnomah County District Attorney)\n\nA lawyer for Granados-Diaz claimed the teenager thought about ending his life in a bathroom at the school but went into a classroom so that 911 would be called after shots were fired.\n\nHe did not want to kill himself at his home as his mother would have been the one to find him, The Oregonian reported.\n\nClassmates and friends had claimed that Granados-Diaz had split up with his girlfriend and was feeling distressed and lonely.\n\nIn an interview following the incident, Mr Lowe, who is head football and track coach at Parkrose High School, said he had a few moments with the teenager before police arrived.\n\nHe said: ‘It was emotional for him, it was emotional for me. In that time, I felt compassion for him.\n\n‘A lot of times, especially when you’re young, you don’t realize what you’re doing until it’s over.\n\n‘I told him I was there to save him, I was there for a reason and this was a life worth living.’\n\nThe gun taken into evidence in the case against Angel Granados-Diaz (Picture: AP)\n\nMr Lowe said he managed to get the gun away from the student and pass it to a teacher while holding Granados-Diaz down with his other hand.\n\nAdvertisement\n\nAdvertisement\n\nHe wrapped the student in a bear hug until police arrived, he said. Nobody was injured in the incident.\n\nThe coach said: ‘I saw the look on his face, the look in his eyes, I looked at the gun, I realized it was a real gun and then my instincts just took over.\n\n‘I lunged for the gun, put two hands on the gun and he had his two hands on the gun and obviously the students are running out of the classroom.’\n\nGranados-Diaz was given a three year probationary sentence on Thursday after pleading guilty to felony possession of a firearm in a public building and misdemeanor possession of a loaded firearm in public.\n\nHe will also receive mental health treatment as part of his sentence.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Police say the student who brought the gun into school was suffering a mental health crisis and didn’t intend to hurt anyone but himself.", "authors": ["Zoe Drewett"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_90830639_1571571977.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-20"}