{"pub": "breitbart", "url": "https://breitbart.com/news/sexton-shocker-sums-up-night-that-was-all-black-for-ireland", "downloaded_at": "2019-10-19 16:21:23.843259+00:00", "title": "Sexton shocker sums up night that was All Black for Ireland", "language": "en", "text": "Tokyo (AFP) – If Ireland v New Zealand was a battle between Johnny Sexton and Beauden Barrett, the current and former World Players of the Year, the All Blacks playmaker was the undisputed winner.\n\nSexton’s error-strewn performance epitomised a misfiring Ireland side — and more often than not man-of-the-match Barrett was on hand to capitalise on his mistakes as New Zealand romped to a 46-14 win.\n\nThe 34-year-old Leinster fly-half got the biggest cheers from a boisterous Irish crowd when the players were introduced, but some of his decision-making must have left fans baffled.\n\nAt a key moment of the game, with Ireland already 10-0 down, Sexton had the option to attempt a kickable penalty to get some points on the board and settle the nerves of the men in green.\n\nInstead, Sexton chose to kick for the corner but criminally missed touch, and Barrett was on hand to clear the lines after an acrobatic save by Richie Mo’unga.\n\nWith the next action of the game, Sexton overhit a high ball, claimed perfectly by Barrett who again sent the Irish back.\n\nThe basic error seemed to knock the stuffing out of the Irish who failed to score a point in a disappointing first half where they barely threatened the New Zealand line.\n\nIn contrast, two-time Player of the Year Barrett was organising the All Black backs to great effect, more often than not acting as first receiver and distributing flawlessly.\n\nBut Sexton and scrum-half Conor Murray were frequently guilty of overhitting box kicks, which Barrett — operating at fullback — collected without difficulty and set the All Blacks on their way again.\n\n– Look of disgust –\n\nSexton was at fault for Barrett’s first-half try.\n\nHe was caught in possession when he should have passed, the ball was hacked on and Barrett showed composure and silky footballing skills to control the ball and dot down.\n\nAll Blacks coach Steve Hansen said before the game that Ireland were more than a one-man team but “your 10’s pretty important”.\n\nAnd the All Black back row of Sam Cane, Ardie Savea and Kieran Read gave the Ireland playmaker a torrid evening, denying him any time on the ball and making some thumping hits.\n\nSexton’s night hardly improved when chief tormentor Cane came off at half-time to be replaced with another Barrett, Beauden’s brother Scott.\n\nOnly 10 minutes into the second half, Sexton looked away in disgust as a penalty punt for touch skewed off his boot and he cut a dejected figure as he knocked the ball on shortly afterwards, barely seeming to have the energy to stretch for a low pass.\n\nCoach Joe Schmidt eventually withdrew Sexton after 63 minutes but the crowd barely seemed to notice, the Irish fans in the middle of a rousing ovation for retiring captain Rory Best.\n\nIreland’s fortunes took an instant turn for the better, finally getting on the scoresheet a few minutes later, but by then it was far too late.\n\nAnother Barrett had the last word — this time Jordie. Who should provide the pinpoint pass for his try? Brother Beauden, of course.", "description": "Tokyo (AFP) – If Ireland v New Zealand was a battle between Johnny Sexton and Beauden Barrett, the current and former World Players of the Year, the", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/19/944a59_sexton-had-disappointing-evening-in-contrast-barrett-sexton-shocker-sums-640x335.jpg", "published_at": "2019-10-19"}