{"pub": "businessinsider", "url": "https://businessinsider.com/two-charged-in-campaign-finance-case-with-associates-of-giuliani-plead-not-guilty-2019-10", "downloaded_at": "2019-10-18 02:03:27.538679+00:00", "title": "Two charged in campaign finance case with associates of Giuliani plead not guilty", "language": "en", "text": "Ukrainian-born U.S. businessman Andrey Kukushkin is seen in a courtroom sketch as he appears in San Francisco Federal Court Reuters\n\nBy Brendan Pierson\n\nNEW YORK (Reuters) - Two American businessmen charged with conspiring to violate campaign finance laws with former associates of U.S. President Donald Trump's personal lawyer Rudy Giuliani pleaded not guilty on Thursday.\n\nAndrey Kukushkin, 46, and David Correia, 44, entered their pleas before U.S. District Judge Paul Oetken in federal court in Manhattan. The two men were released on bail.\n\nThey were charged in the case last week alongside Ukraine-born Lev Parnas and Belarus-born Igor Fruman, who worked for Giuliani in Ukraine to investigate Democratic presidential contender Joe Biden and his businessman son Hunter.\n\nProsecutors said Parnas and Fruman donated money to a pro-Trump election committee through a shell company to conceal its source, and raised money for former Texas Congressman Pete Sessions as part of an effort to have the Republican president remove the U.S. ambassador to Ukraine. That effort was carried out at the request of at least one Ukrainian official, prosecutors said.\n\nAmbassador Marie Yovanovitch was recalled in May. Yovanovitch testified to a Democratic-led impeachment inquiry on Oct. 11 that Trump ousted her based on \"unfounded and false claims\" after she had come under attack by Giuliani.\n\nParnas and Fruman worked with Correia and the Russian-born Kukushkin in a separate scheme to funnel money from a Russian donor to U.S. politicians in order to aid the donor's efforts to establish a marijuana business, prosecutors said. U.S. law prohibits foreign donations in American elections.\n\nGiuliani himself could face legal jeopardy, as federal prosecutors are examining his interactions with Parnas and Fruman, a law enforcement source told Reuters on Sunday.\n\nParnas and Fruman, who were arrested at Dulles International Airport near Washington last week, are scheduled to make their first appearance in federal court in Manhattan on Oct. 23.\n\nFruman was released on bail on Wednesday, while Parnas has not yet met his bail conditions and remains jailed in Virginia, Assistant U.S. Attorney Nicolas Roos said during Thursday's hearing.\n\nDemocrats in the U.S. House of Representatives started an inquiry on Sept. 24 into whether there were grounds to impeach Trump over his request in a July 25 phone call to Ukrainian President Volodymyr Zelenskiy to investigate Biden, a leading contender for the Democratic presidential nomination to face Republican Trump in the November 2020 election.\n\nOn Thursday, A senior White House official acknowledged that Trump held up $391 million in military aid to Ukraine in part to pressure the Ukrainians to look into an allegation about the 2016 U.S presidential election that has been debunked as a conspiracy theory.\n\n(Reporting By Brendan Pierson in New York; Editing by Grant McCool)", "description": "NEW YORK (Reuters) - Two American businessmen charged with conspiring to violate campaign finance laws with former associates of U.S. President Donald Trump's personal lawyer Rudy Giuliani pleaded not guilty on Thursday.", "authors": ["Brendan Pierson"], "top_image": "https://www.businessinsider.com/public/assets/BI/US/og-image-logo-social.png", "published_at": "2019-10-17"}