{"pub": "npr", "url": "https://npr.org/2019/09/28/765208916/in-rusty-brown-chris-ware-resolves-to-find-the-good-in-everyone", "downloaded_at": "2019-09-28 21:23:41.824584+00:00", "title": "In 'Rusty Brown,' Chris Ware Resolves To Find The Good In Everyone", "language": "en", "text": "In 'Rusty Brown,' Chris Ware Resolves To Find The Good In Everyone\n\nRusty Brown by Chris Ware Hardcover, 1 volume (unpaged) | purchase close overlay Buy Featured Book Your purchase helps support NPR programming. How?\n\nEven if Rusty Brown weren't the latest book from Chris Ware, whose instantly recognizable style and impeccable talent have defined the genre of art comics for some 30 years now, it would still be an event. The bricklike graphical epic documents a handful of ordinary lives in Omaha, Neb., meditating on the cosmic significance of everyday actions and the countless invisible connections linking people together. By looking deeply at the experiences of a bullied young boy and the people around him — including his bully, his sci-fi-writer father and his elderly African American teacher — Ware probes the nature and limits of empathy. It's a subject that obsesses him. \"As human beings, it is our modus operandi to imagine other people's lives, sometimes several times a minute,\" he said via email. \"Many people do it poorly — assuming the worst of others, or that it's themselves others are thinking about when really, we're all just worried about our own problems. Writers make it their profession, but somewhere in between are the rest of us. I really believe that trying to understand others is our number-one super power as human beings.\"\n\nWare went on to reflect on the roots of this project, his goals as a creator and the nature of visual imagination.\n\nYou've worked on this book for more than 16 years. Is it very different from your original conception?\n\n1A Graphic Novelists Chris Ware And Melanie Gillman On Their Latest Projects Graphic Novelists Chris Ware And Melanie Gillman On Their Latest Projects Listen · 34:31 34:31\n\nYes, humiliatingly. Just as my own memories, beliefs and recollections have changed and transformed over the years to suit the self I'd like to pretend I am, this book has quietly adjusted, as well. We all suffer from this very human malady of rewriting, editing and revising our lives; in a way, it's almost what makes us human (and in some cases, what makes life tolerable) ... Comics is the one visual medium where this slow shift is actually palpable; think of how Charlie Brown changed over the 50 years Charles Schulz drew him.\n\nWhere did the project start?\n\nI began thinking of the book with a revenge fantasy about one of my teachers who, for one reason or another, one day in middle school allowed all of my fellow students to criticize/say anything they wanted to about me for an entire class period. As I was already branded as the uber-nerd of the school who had to sometimes be careful what corners to round in case I was jumped on, this experience did not do much for my self-esteem (though it did do a lot to secure my future as a cartoonist). However, I realized pretty quickly that aesthetic revenge was a dead-end idea and especially a dereliction of my moral duties as an artist, so instead of using that self-indulgent anecdote as a springboard, I resolved instead to try to find the good in every character in the book, regardless of how seemingly mean-spirited, terrible or cruel they might be.\n\nI resolved ... to try to find the good in every character in the book, regardless of how seemingly mean-spirited, terrible or cruel they might be.\n\nNot surprisingly, I also believe this is one of the most important \"skills\" we as humans can cultivate: to see, or at least to seek, the very best in others. I even grudgingly believe that Donald Trump must somehow be worthy of some sympathy; his father must have been a truly terrible person for him to grow up so hungry for approval and reassurance that he would make lying, stealing and boasting his sole means of navigating the world (to say nothing of being apparently incapable of sympathy himself). Though I would also very much like him not to destroy our country while he's working through his personal problems.\n\nDo you do a lot of rewriting?\n\nGenerally, no. I do not write scripts and then illustrate them; I sit down at a blank page and start with some vague notion of where the story is going to go, though this notion is almost always immediately rendered obsolete once I start drawing and look into the image that's suddenly appeared on my paper.\n\nI saw some of your sketches once and I was surprised at how dense they were — very different from the spareness of your finished work.\n\nAs adults, we rarely see the world with the clarity and curiosity we did as children; at best, we simply navigate it, lost in our worries about the future and our regrets about the past.\n\nThere is a tremendous difference between drawing and cartooning ... Drawing in comics is more related to the images that we all \"see\" in our minds several thousand times a day, whether we have our eyes closed, our eyes open behind the wheel of a car or our eyes trained on someone we love; it's such an unfathomably strange thing that we humans can do, seeing in our minds without actually looking. Such images are what I try to put down on the page, not what we actually see with our eyes.\n\nWhy do you think you're drawn to this approach?\n\nLanguage limits perception; if one is standing outside and hears an unfamiliar birdcall the sound seems to pierce through the consciousness with a crystalline beauty and clarity. Yet we ask, \"What kind of bird is that?\" so we can \"identify\" it and, ironically, stop listening. This phenomenon also happens with seeing, but much more destructively: As adults, we rarely see the world with the clarity and curiosity we did as children; at best, we simply navigate it, lost in our worries about the future and our regrets about the past. Very rarely do we actually look at and consider the chair we sit down in; we see-think \"chair\" and sit down.\n\nIt's my role as a cartoonist to take these general visual abbreviations created by language (what we think of when we see \"chair\") and reverse-engineer them on the page in a manner that allows the reader to experience the world in a fresh and, hopefully, poetic way.\n\nEtelka Lehoczky has written about books for The Atlantic, The Los Angeles Review of Books and The New York Times. She tweets at @EtelkaL.", "description": "Ware's new graphic novel follows six extremely ordinary people — a teacher, a bully, a father — and meditates on the significance of their everyday actions, and the webs of connection between them.", "authors": ["Etelka Lehoczky"], "top_image": "https://media.npr.org/assets/img/2019/09/27/814u2ojatxl_wide-4839d30964a13e117a12955b5b57f73aa2705396.jpg?s=1400", "published_at": "2019-09-28"}