{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/28/michal-kempny-doubtful-capitals-season-opener-blues-because-hamstring-injury", "downloaded_at": "2019-09-28 21:27:56.409053+00:00", "title": "Michal Kempny doubtful for Capitals’ season opener at Blues because of hamstring injury", "language": "en", "text": "\n\nWashington Capitals defenseman Michal Kempny (Toni L. Sandys/The Washington Post)\n\nWashington Capitals defenseman Michal Kempny is considered doubtful to play in Wednesday’s season opener in St. Louis, Coach Todd Reirden said Saturday. Kempny, who had surgery for a torn left hamstring in April, has been on the ice for all of training camp, but he hasn’t played in any exhibition games and remains in a noncontact jersey.\n\nReirden said the team hasn’t considered starting the season with Kempny on long-term injured reserve, which would require him to miss at least the first 10 games, and he didn’t rule him out for Washington’s second or third games, a back-to-back at the New York Islanders on Friday and then home against the Carolina Hurricanes on Oct. 5.\n\n“Right now, it’s highly likely that he will not be playing in that [season] opener and then from there that can change the very next day,” Reirden said.\n\n[Capitals trim roster to 28 with latest training camp cuts]\n\nReirden said earlier in the week that the team has increased Kempny’s workload throughout training camp, and Kempny passed his skate conditioning test after practice Saturday. As for what the team is waiting for to allow Kempny to experience contact in practice, Reirden said it is \"a timeline that’s set that he has to go through different protocols to get to where he needs to be to be 100 percent, and he’s not there yet.”\n\n“He’s coming along really well for that injury,” Reirden said. “That’s a long-term one, so he’s right on schedule and doing great with it. In a perfect world, if we could have gotten him into one exhibition game and then Game 1, then that would’ve been already ahead of schedule. But he’s doing fine and continues to every day get more comfortable.”\n\nKempny had six goals and 19 assists in 71 games last season, skating more than 19 minutes per game on the top pairing with John Carlson. Reirden listed Martin Fehervary, Christian Djoos and Jonas Siegenthaler as options to skate on Carlson’s left to start the season; Fehervary practiced in that spot Saturday. The Capitals drafted Fehervary in the second round last year, and the 19-year-old has yet to make his NHL debut.\n\n“He’s a young, up-and-coming guy who’s similar to Kempny in terms of how he plays,” Reirden said. \"We’ve seen Christian Djoos with his ability to make plays offensively from that side. And then Siegenthaler is a guy for us that is a big body that can skate well and can defend against top guys. So we’ve got a couple really good options, and we’ll take at some different combinations tomorrow and see how that goes.”\n\nIn other injury news, captain Alex Ovechkin didn’t practice Saturday because of what the team is calling “lower-body maintenance,” and he won’t play in Sunday’s preseason finale at Carolina, though he’s still expected to be ready for the season opener. Forward Liam O’Brien suffered an upper-body injury in a fight Friday night in St. Louis, and while he missed practice Saturday, Reirden indicated that O’Brien will skate Sunday. He won’t be in the lineup for the exhibition finale against the Hurricanes.\n\nRead more:\n\nDmitry Orlov is waiting for his partner on the Capitals’ blue line to be determined\n\nFor Chandler Stephenson, the stakes are high in preseason’s final week\n\nThe future might be arriving fast for Capitals goalie Ilya Samsonov", "description": "“Right now, it’s highly likely that he will not be playing in that [season] opener and then from there that can change the very next day,” Coach Todd Reirden said.", "authors": ["Isabelle Khurshudyan", "Reporter Covering The Washington Capitals", "September At Pm", "Isabelle Khurshudyan Covers The Washington Capitals. A University Of South Carolina Graduate", "She Has Worked At The Washington Post Since", "Previously Reporting On High School Sports", "Local Colleges."], "top_image": "https://www.washingtonpost.com/resizer/4ggMtVnIuUuX-Ui6FGtWCW135N4=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/XXGVBAHGFAI6RBCJD7ZGGYE2GE.jpg", "published_at": "2019-09-28"}