{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/12/donald-trump-blasts-warriors-coach-steve-kerr-weak", "downloaded_at": "2019-10-13 00:15:34.110309+00:00", "title": "Trump blasts Warriors coach Steve Kerr for 'weak and pathetic' China response", "language": "en", "text": "President Trump took another jab at the NBA’s Steve Kerr after the coach known for his outspoken liberal political views refused again to comment on the controversy over China roiling the league.\n\nMr. Trump said the Golden State Warriors coach looked “weak and pathetic” in answering questions from reporters about the NBA’s response to Chinese retaliation over a tweet in support of pro-democracy protesters in Hong Kong.\n\n“So funny to watch Steve Kerr grovel and pander when asked a simple question about China. He chocked [sic], and looks weak and pathetic. Don’t want him at the White House!” tweeted Mr. Trump on Friday.\n\nWhile Mr. Trump’s critics mocked him for misspelling “choked,” those on the right were stunned by what Mr. Kerr did say: He drew parallels between U.S. mass shootings and Chinese state-sponsored human-rights abuses.\n\nAsked about such abuses, Mr. Kerr told reporters that the issue “has not come up in terms of people asking about it,” then added, “Nor has our record of human-rights abuses come up, either.”\n\n“We all have different issues we have to get to. Saying that is my right as an American. It doesn’t mean that I hate my country. It means I want to address the issue,” Mr. Kerr said at a Thursday press availability. “But people in China didn’t ask me about, you know, people owning AR-15s and mowing each other down in a mall. I wasn’t asked that question.”\n\nThe Federalist’s David Harsanyi responded, “What an immense idiot. The Chinese communist state has murdered tens of millions of people. It has concentration camps open right now. People who shoot ARs in American malls are criminals.”\n\nTurning Point USA’s Benny Johnson tweeted that “Steve Kerr really just compared China’s Concentration Camps to Americans owning AR-15s in the United States.”\n\nWhat an immense idiot. The Chinese communist state has murdered tens of millions of people. It has concentration camps open right now. People who shoot ARs in American malls are criminals. https://t.co/vFumkVVdlM — David Harsanyi (@davidharsanyi) October 11, 2019\n\nWhat the what\n\n\n\nProbably because they know such awful occurrences are rare and you know, not carried out by our government like in communist China, Kerr https://t.co/XngZhXIpqT — Dana Loesch (@DLoesch) October 11, 2019\n\nThe NBA has been accused of kowtowing to China after the communist nation canceled a television deal and sponsorships for the Houston Rockets in response to the team’s general manager Daryl Morey tweeting his support for the Hong Kong activists.\n\nThe league canceled media availabilities for the rest of its preseason games in China under pressure from the Chinese government, which also mandated that NBA commissioner Adam Silver cancel his pregame press conference, ESPN reported.\n\n“We have decided not to hold media availability for our teams for the remainder of our trip in China,” the NBA announced in a statement Friday. “They have been placed into a complicated and unprecedented situation while abroad and we believe it would be unfair to ask them to address these matters in real time.”\n\nMr. Silver said last week the NBA was “not apologizing” for Mr. Morey’s tweet, and that the league would “live with those consequences,” while critics have accused the NBA of bowing to China to protect a business and fan relationship worth billions.\n\nLast week, the president said that Mr. Kerr, a longtime Trump critic, “was like a little boy, he was so scared to be even answering the question.”\n\n“He was shaking, ‘Oh, I don’t know,’” said Mr. Trump, adding, “He didn’t know how to answer the question, and yet he’ll talk about the United States very badly.”\n\nAt the press conference, Mr. Kerr said he had met with five U.S. presidents, including a 1984 visit with President Ronald Reagan, who invited the teenage Kerr and his family after his father was killed in Beirut while serving as president of American University.\n\n“For me personally, this was my experience — wow, has the office sunken low,” Mr. Kerr said. “My hope is we can find a mature, unifier from either party to sit in that chair and try to restore some dignity to the Oval Office again.”\n\nThere was no post-championship trip to the White House for the Warriors in 2017 or 2018 after star player Steph Curry said he didn’t want to attend in 2017, prompting Mr. Trump to withdraw his invitation.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "President Trump took another jab at the NBA's Steve Kerr after the coach known for his outspoken liberal political views refused again to comment on the controversy over China roiling the league.", "authors": ["The Washington Times Http", "Valerie Richardson"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/10/Timberwolves_Warriors_Basketball_66652.jpg-f62ef_c0-0-6087-3550_s1200x700.jpg?a5a18da9b5e82fce52b3e754870491d00a0b670d", "published_at": "2019-10-12"}