{"pub": "reuters", "url": "https://ca.reuters.com/article/entertainmentNews/idCAKBN1WF1TE-OCAEN", "downloaded_at": "2019-10-01 00:20:59.961539+00:00", "title": "Sustainable fashion to the fore at Stella McCartney's Paris show", "language": "en", "text": "PARIS (Reuters) - Stella McCartney on Monday unveiled her first collection since linking up with the French luxury group LVMH, showing fluid dresses, wide-legged pants and floral prints that she said were the most sustainable clothes she had made.\n\nWith her father, ex-Beatle Paul McCartney, in the audience, the British designer held her Paris Fashion Week show in the Palais Garnier, the ornate home of the Paris National Opera.\n\nThe show started with outfits in a natural palette, followed later by designs with touches of bright color and bold graphic stripes. Over 75% of the ready-to-wear collection is eco-friendly, according to the label, using recycled polyester, organic cotton and sustainable raffia.\n\nAmber Valletta and Adut Akech strutted down the catwalk in blue-green utility garments while Kaia Gerber, top model Cindy Crawford’s 18-year-old daughter, wore a light floral dress.\n\nThe Spring and Summer 2020 collection is McCartney’s first one since LVMH took a minority stake in her eponymous brand.\n\nThe deal came a few months after the designer bought back a 50% stake from Kering, ending a 17-year partnership with the French conglomerate.\n\n“There is a lot to be done at LVMH in a positive way and I am very excited and open to find some solutions (to sustainability issues)”, McCartney told Reuters after the show.\n\nA pioneer in using recycled fabrics and one of the first major designers to ban leather, fur and animal-derived glues, Stella McCartney has been appointed special adviser to Bernard Arnault, LVMH’s chairman and chief executive.\n\n“If I say to LVMH to stop using leather, they may find that pretty difficult,” McCartney said.\n\n“But if I suggest banning plastic water ... (bottles) in headquarters and stores and replace them with aluminum cans, that is doable. I can not only give advice but also plug in a solution pretty quickly. The list is very long and we have to start somewhere”.\n\nLVMH, absent from an industry “fashion pact” launched under Kering’s auspices, said it was on course to beat a goal of meeting 30% of its energy needs from renewable sources by 2020 and also on track to cut its CO2 emissions by 25% by the same time.\n\nNevertheless, Arnault said on Wednesday that environmental activist Greta Thunberg’s statements on climate change were overly pessimistic and demoralizing for young people.", "description": "Stella McCartney on Monday unveiled her first collection since linking up with the French luxury group LVMH, showing fluid dresses, wide-legged pants and floral prints that she said were the most sustainable clothes she had made.", "authors": ["Laetitia", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-30"}