{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/28/john-legend-elizabeth-warren-is-the-best-candidate-in-2020-race", "downloaded_at": "2019-10-29 04:00:40.981412+00:00", "title": "John Legend: Elizabeth Warren Is the ‘Best Candidate’ in 2020 Race", "language": "en", "text": "Grammy-winning singer and left-wing activist John Legend has expressed enthusiastic support for Sen. Elizabeth Warren’s (D-MA) White House bid, calling her the “best candidate” running for president in 2020.\n\n“My favorite — I’m going to say it, we’ll break news today — is Elizabeth Warren,” Legend said in a wide-ranging interview with Vanity Fair published Monday morning.\n\n“She’s the best candidate running today and she comes at it with joy and with sincerity and with a wealth of knowledge and experience,” the All of Me crooner said of the senator.\n\n“Honestly, I don’t comprehend why guys hate women so much sometimes,” he went on. “You see someone as transparently competent and eloquent and on fire as Elizabeth Warren and then you hear some guys just are not into voting for a woman. Why do guys feel so threatened by the idea of a woman president?”\n\nVanity Fair reports that Legend’s wife, model-turned-left-wing activist Chrissy Teigen, also expressed “love” for Warren, but said she also thinks highly about 2020 White House contender Sen. Kamala Harris (D-CA).\n\n“I also love Kamala Harris,” Teigen said.\n\nAs part of their sit-down with Vanity Fair, Legend and Teigen, both outspoken critics of President Trump, called the president, “sad, and petty, and narcissistic and immature.”\n\n“I think there needs to be jail time for him, for the whole family,” Teigen told the magazine on the topic of the House Democrats’ secret impeachment inquiry into the president.\n\n“I feel like he still gets away with everything if he gets out of his office,” she added. “I know that his first tweet after he’s impeached will be, ‘I didn’t want to be there anyway.’ ”\n\nOf course, Legend and Teigen’s criticisms of the president has not gone way one.\n\nLast month, President Trump took aim at the Hollywood couple for failing to credit his administration on enacting criminal justice reform.\n\n“When all of the people pushing so hard for Criminal Justice Reform were unable to come even close to getting it done, they came to me as a group and asked for my help,” the president tweeted. “I got it done with a group of Senators & others who would never have gone for it. Obama couldn’t come close.”\n\n[M]usician @johnlegend, and his filthy mouthed wife, are talking now about how great it is – but I didn’t see them around when we needed help getting it passed. ‘Anchor’ @LesterHoltNBC doesn’t even bring up the subject of President Trump or the Republicans when talking about,” he added.", "description": "John Legend expressed support for Elizabeth Warren's White House bid, calling her the 'best candidate\" running for president in 2020.", "authors": ["Joshua Caplan"], "top_image": "https://media.breitbart.com/media/2019/04/Johnlegendgoogle1-640x335.jpg", "published_at": "2019-10-28"}