{"pub": "zdnet", "url": "https://www.zdnet.com/article/apple-is-a-hypocrite-so-are-we", "downloaded_at": "2019-10-13 12:21:07.479227+00:00", "title": "Apple is a hypocrite (and so are we)", "language": "en", "text": "× tim-cook-2-17341.jpg\n\nWe're all good critics.\n\nWe see things we don't like and we speak up.\n\nIt's called being an American.\n\nSo many others don't live by our precepts of decency that it frustrates us. Make us livid, even.\n\nLast week, then, it was Apple's turn to fall short of our standards. Cupertino removed the HKmap.live app from its store because it claimed people were using it to target the police during Hong Kong's protests.\n\nPull the other one, many cried. China had put pressure on Apple and, as has been Apple's habit for some time, the company capitulated.\n\nThe evidence was a little too easily obtained.\n\nThe finger-pointing is accurate. Apple long ago decided it was going to bow down to China so that it could convert as many of its population to the Apple cause.\n\nNot its socio-political cause, you understand. Apple has long coveted the idea of Chinese millions buying iPhones and iPads, while those very same products are built in the country.\n\nWhat wasn't there to love? The Chinese put the gadgets together for relatively little, yet, as the country got wealthier, its upper echelons would spend substantial amounts to buy those gadgets. $44 billion worth of those gadgets, at the last count.\n\nSo the same company that would fight the US government over jailbreaking terrorists' phones and its immigration policy would quite happily allow the Chinese government to dictate which apps could be on iPhones, which apps couldn't, and whose servers would hold all the data.\n\nIt's Apple's very sanctimoniousness that makes it such a wholesome target.\n\nApple is a company that snorts at Google and Facebook for their flouting of even basic privacy. It's also the company that's perfectly at peace with allowing socially repressive governments to ensure that Apple's gadgets can't access material espousing the very values on which Apple claims it's built.\n\nYou know, things like Twitter and Netflix.\n\nNaturally, Apple claims it's simply following local laws. It also clings to the notion that participating in repressive countries will somehow help their peoples see the light and become as happy as we in America are.\n\nIndeed, in an answer to the Honorable Ted Cruz in 2017, Apple offered these elevated words: \"We are convinced that Apple can best promote fundamental rights, including the right of free expression, by being engaged even where we may disagree with a particular country's law.\"\n\nCould it be, though, that Apple is succumbing to the most fundamental expression of American rights -- the right to want as much money as we can get our hands on?\n\nThen again, shouldn't we lurch toward a little self-criticism too?\n\nOh, we're high and mighty on our moralizing horses but how often do we act according to our protestations?\n\nIt's been rather clear over the last decade or two that China isn't going to get Gorbacheved into a new enlightenment. Instead, it steadily -- and as quietly as possible -- uses its new-found wealth to increase its influence and hold on other countries.\n\nDoes our knowledge that our iPhones and iPads are manufactured by poorly paid -- and, some say, poorly treated -- people in China affect our purchase of those very gadgets? Not terribly.\n\nWhen we hear about China's oppressive behavior and its enthusiasm for apparently rating its citizens on a trustworthiness score, do we instantly declare that we'll no longer buy products made in China, not even if they're monikered by our favorite politician's daughter?\n\nWe make a judgment about what's important to us and that's usually whatever is easiest and will entertain us the most.\n\nHuman suffering tends not to factor into that. The suffering of others, that is.\n\nHypocrisy is part of the human condition. Behind the steering wheel, we criticize others for the same things we do ourselves. We excoriate stars for doing things we ourselves do -- or would secretly like to do.\n\nWe profess great things about ourselves yet, most days, we contravene our own standards because it's suddenly the expedient thing to do.\n\nJust as we too often shut up in the face of a boss we don't respect because we want to make more money, so Apple shuts up -- or wraps itself in indefensible yarn -- because it wants to make ungodly profits.\n\nSometimes, you can be in too deep and when it comes to Apple's submersion in China, this may be the case.\n\nApple's real problem is that it tries to claim it's a better person than the rest.\n\nIf we were better people than the rest, we'd start boycotting the company. We won't.", "description": "When it comes to China, will Apple be forced to make a choice? Or will it do what so many of us do -- bathe in its hypocrisy till the end?", "authors": ["Chris Matyszczyk"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2019/01/04/b67c611b-8019-43df-9d00-cba7e05ee595/thumbnail/770x578/1c8b65142aac7c585203d5657bbe67de/tim-cook-2-17341.jpg", "published_at": "2019-10-13"}