{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7580941/Amanda-Bynes-asked-join-Dancing-Stars-season-28-didnt-pan-out.html", "downloaded_at": "2019-10-17 01:52:04.009240+00:00", "title": "Amanda Bynes was asked to join Dancing With the Stars for season 28 but it 'didn't pan out'", "language": "en", "text": "Amanda Bynes was almost on this season of Dancing With the Stars.\n\nYet the 33-year-old Nickelodeon star is currently living in a sober group home as she tries to maneuver through her ongoing mental health struggles, The Blast sources report.\n\nBut while it evidently didn't 'pan out' for this season, the star is making small strides in a positive direction and recently joined Instagram while showing off her new bright pink hairstyle.\n\nAlmost! Amanda Bynes was almost on this season of Dancing With the Stars but sources with Us Weekly report that it 'didn't pan out'\n\nDWTS: Sources revealed that an appearance on Dancing With the Stars wasn't the direction Amanda wasn't to take her career\n\n'Doing [the show] just wasn't what she envisioned for her future,' an Us Weekly source said about the star's possible dancing future. 'She's taking things one day at a time.'\n\nBut it seems as though she has her sights set on her own struggles after her 'stress related relapse' back in January.\n\nThe former child star hasn't spoken out about the missed opportunity her most recent move, but does tend to keep fans updated on her rare social media posts.\n\nPink hair: The star debuted her new bright look on Instagram when she came back to social media back in September\n\nBack then: Amanda was spotted heading to the Michael Costello and Style PR Capsule Collection launch party back in July of 2015\n\nBack in June, the Easy A star took some time off after the 2010 film and graduated from FIDM (Fashion Institute of Design & Merchandising) back in December.\n\nShe enrolled back in 2014 after leaving a treatment facility and hit some bumps in the road after she hit some legal troubles which then led her being placed in the custody of her parents.\n\nIn 2014, she was arrested for DUI, but the case was later dismissed but she did seek help in another treatment facility and later revealed she was bipolar and manic depressive.\n\nCongrats Grad: Amanda recently graduated from FIDM with her degree in Merchandise Product Development\n\nAfter that, she headed back to FIDM where she was anticipating her Associate's of Art degree in Merchandise Product Development, she told Paper Magazine back in November 2018.\n\n'My advice to anyone who is struggling with substance abuse would be to be really careful because drugs can really take a hold of your life,' she said during her interview with the magazine.\n\n'Everybody is different, obviously, but for me, the mixture of marijuana and whatever other drugs and sometimes drinking really messed up my brain. It really made me a completely different person. I actually am a nice person. I would never feel, say or do any of the things that I did and said to the people I hurt on Twitter.'\n\nAmong her most controversial tweets was one sent to Rihanna in 2013, in which she told the singer, 'Chris brown beat you because you're not pretty enough'.", "description": "Amanda Bynes was almost on this season of DWTS.The 33-year-old Nickelodeon star is living in a sober group home as she tries to maneuver her ongoing mental health struggles.", "authors": ["Shelslaughter At Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/01/19815162-0-image-a-47_1571272033284.jpg", "published_at": "2019-10-17"}