{"pub": "heritage", "url": "https://heritage.org/press/heritage-foundation-leaders-attend-white-house-social-media-summit", "downloaded_at": "2019-09-04 04:06:11.044236+00:00", "published_at": "2019-09-04", "title": "Heritage Foundation Leaders to Attend White House Social Media Summit", "language": "en", "text": "WASHINGTON — Several leaders from The Heritage Foundation will attend this week’s White House Social Media Summit with President Donald Trump. The White House announced that the Thursday summit “will bring together digital leaders for a robust conversation on the opportunities and challenges of today’s online environment.”\n\nAttendees include Robert Bluey, vice president of communications and executive editor of The Daily Signal; Bridgett Wagner, vice president of policy promotion; Maria Sousa, digital director; Lyndsey Fifield, social media manager; and Jessica Anderson, vice president of Heritage Action for America.\n\n“At a time when social media is having a transformative effect on much of American culture, it’s a welcome opportunity to talk with other digital leaders at the White House,” Bluey said. “Think tanks and publishers are wrestling with important questions about social media. While there are some pushing for heavy-handed government regulation, there’s evidence the market is working and social media companies are responding.”\n\nThe Heritage Foundation, along with its multimedia news outlet The Daily Signal, has a significant presence on all of the major social media platforms, including Facebook, Twitter, YouTube, and Instagram. These platforms have helped Heritage reach millions of people across the globe with its timely policy research and analysis on conservative public policy issues.\n\nHeritage’s digital leadership was recently recognized by the University of Pennsylvania’s Think Tanks and Civil Societies Program, which ranked The Heritage Foundation as the No. 1 think tank for “Best Use of the Internet” in its annual “Global Go-To Think Tank Index.” The index is the largest, most comprehensive database of more than 8,100 think tanks globally, and ranks them in multiple categories. According to the index, 3,750 journalists, policymakers, public and private donors, and functional- and regional-area specialists participate in the process.\n\nFounded in 1973, The Heritage Foundation is the nation’s most broadly supported public policy research institute, with more than a half-million members. Its mission is to develop and promote public policy solutions that advance free enterprise, limited government, individual freedom, traditional values, and a strong national defense.", "description": "WASHINGTON — Several leaders from The Heritage Foundation will attend this week’s White House Social Media Summit with President Donald Trump. The White House announced that the Thursday summit “will bring together digital leaders for a robust conversation on the opportunities and challenges of today’s online environment.”", "authors": [], "top_image": "https://www.heritage.org/themes/heritage/src/images/bell.png"}