{"pub": "washingtonpost", "url": "https://washingtonpost.com/immigration/mexicos-crackdown-on-migrants-is-stalling-us-officials-say-ahead-of-talks-next-week/2019/09/06/b46296a6-d0b3-11e9-8c1c-7c8ee785b855_story.html", "downloaded_at": "2019-09-07 13:37:29.286901+00:00", "title": "Mexico’s crackdown on migrants is stalling, U.S. officials say ahead of talks next week", "language": "en", "text": "\n\nAs a full transport van drives away, another group of migrant families waits for U.S. Border Patrol under the Anzalduas International Bridge in McAllen, Tex., on June 21, after crossing the border from Mexico. (Carolyn Van Houten/The Washington Post)\n\nAs the Mexican government claimed success Friday for its summerlong crackdown on Central American migrants, U.S. Homeland Security officials said the country’s efforts are stalling and that the Trump administration will push for a more aggressive approach during talks in Washington next week.\n\nThe number of migrants taken into custody at the U.S. southern border has dropped by more than half in the past three months, after President Trump forced Mexico to ramp up enforcement by threatening to impose tariffs on the United States’ third-largest trade partner.\n\nMexican Foreign Minister Marcelo Ebrard, who will travel to Washington for talks Tuesday with Trump administration officials, told reporters his government’s deployment of thousands of national guard troops has cut northern migration flows by 56 percent, according to the U.S. government’s own data.\n\n“The Mexican strategy is working,” he said.\n\n[How Mexico talked Trump out of tariff threat with immigration crackdown pact]\n\nU.S. officials are less sanguine, at least in private, pointing out that the number of border crossers taken into custody last month — approximately 65,000 according to preliminary tallies — remains far higher than any other August in at least five years.\n\nOfficials from the Department of Homeland Security said this week they believe Mexico’s effort is flagging and they want more robust interdiction.\n\n“Mexico started off making some gains, and they have executed enforcement operations they’ve never executed before, which the U.S. government has acknowledged and applauded, but those efforts have largely stalled,” said a DHS official who spoke on the condition of anonymity to describe how the United States is planning to approach next week’s talks.\n\n“We’re concerned that Mexico is resting on its laurels and not postured to drive down the numbers to acceptable levels,” the official said. “We know they can do more, and that’s what the United States expects.”\n\nTrump tweeted praise for Mexico’s cooperation earlier in the summer, calling the government of leftist President Andrés Manuel López Obrador a more reliable partner for immigration enforcement than congressional Democrats, who have opposed the administration’s border policies.\n\nBut acting homeland security secretary Kevin McAleenan has said the United States is seeking a return to the “historic lows” registered during the initial months of the Trump administration, when monthly arrests bottomed out at fewer than 20,000.\n\nIn their June 7 accord, U.S. and Mexican negotiators agreed the two sides would reassess their efforts after 90 days. That period has expired.\n\nDuring their June negotiations, the United States pushed hard for Mexico to accept a “safe third country” accord that would require it to take in U.S.-bound asylum seekers from other nations.\n\n\n\nA group of migrant families waits to be taken into custody in McAllen, Tex., on June 21, after moving north through Mexico. (Carolyn Van Houten/The Washington Post)\n\nThe Mexican government resisted that pressure but agreed in a separate accord to initiate talks toward an overhaul of its asylum policies. Mexican officials later said they didn’t believe such measures would ultimately be necessary because their unprecedented crackdown would achieve the results the Trump administration was seeking.\n\nTrump has not tweeted about Mexico’s migration efforts in recent weeks, nor given any indication about whether he planned to insist on that part of the agreement or resume his tariff threat. Homeland Security officials declined to say if the administration plans to renew the threat.\n\nTrump’s trade dispute with China and the administration’s worries about a weakening U.S. economy could make it more difficult for the White House to wield tariffs, especially because the damage would impact major U.S. companies who have manufacturing and assembly plants in Mexico.\n\nEbrard and López Obrador told reporters Friday that Mexico had accomplished what the Trump administration had asked.\n\n“This reduction of 56 percent in the flow of migrants is a result of diverse measures that the government has taken, in compliance with the Mexican migration law,” Ebrard said, citing data from U.S. Customs and Border Protection. “I don’t expect there to be a tariff threat on Tuesday.”\n\nEbrard dismissed the idea that Mexico would implement a safe third country agreement at the White House’s request. Leaders of Mexico’s Senate, which would have to ratify such a deal, have signaled that they would not approve it.\n\n“I’m not sure if they will try to broach that idea at our meeting, but we already have an answer,” Ebrard said, referring to U.S. officials. He added that such a deal “is not in Mexico’s interest.”\n\n“We told them that there is a Mexican strategy that can produce results,” he said. “What we showed is that we were right.”\n\nMexico has deployed more than 25,000 members of its newly formed national guard to help interdict migrants, mostly along the country’s southern and northern borders, Ebrard said.\n\nMigrant advocates say Mexican officials have done little to provide for asylum seekers sent by U.S. officials to wait for their court dates in northern Mexico, under the Migrant Protection Protocols policy, also known as “Remain in Mexico.”\n\nIn the state of Tamaulipas, in the northeastern corner of Mexico, returned asylum seekers are regularly kidnapped and extorted. The state and federal government have argued over who should bear responsibility for the migrants, and neither has made a serious attempt to provide protection, shelter or food, according to migrant advocates.\n\n[When they filed their asylum claim, they were told to wait in Mexico. There, they say, they were kidnapped.]\n\nHomeland Security officials want to continue aggressively expanding the MPP program in Tamaulipas and the Rio Grande Valley, the busiest place along the border for illegal crossings, viewing it as a major deterrent.\n\nAsked for more evidence that Mexican enforcement is waning, DHS officials said they base that view on the fact that while overall migration numbers have fallen, Mexico is apprehending a decreasing percentage of those heading north than they were in June.\n\nDHS officials said they are also concerned by a rebound in the number of mass border crossings by large groups of families.\n\nThe arrival of a single group of 1,036 migrants in the El Paso area on May 30 — the largest ever of its kind — was the incident that led Trump to erupt at Mexico in the first place.\n\nHomeland Security officials said they have had 20 large groups of 100 or more arrive since the June 7 agreement with Mexico, some with more than 200 adults and children.\n\n“Large groups are the easiest for Mexico to deal with, so the fact that they’re missing large groups of over 200 people symbolizes the challenges they’re facing,” said the DHS official, calling it a sign that Mexico was taking its foot off the gas.\n\nConditions at U.S. border facilities have improved substantially since May, when holding cells were badly overcrowded and thousands of underage migrants were held in squalid conditions.\n\nAt one point, border agents had more than 2,800 children in custody, many for far longer than the 72-hour period mandated for their transfer to shelters. But as of Thursday morning, the Border Patrol had 110 children in its custody across the entire southern border, DHS officials said, and the average amount of time in custody has fallen to 22 hours.\n\nThe officials said they still consider the border to be in a “crisis” state nonetheless, because the overall volume of people crossing into the United States remains so much higher relative to previous years. Overall, U.S. authorities remain on pace to make nearly 1 million arrests during the 2019 fiscal year ending Sept. 30, the highest total in at least a decade and almost double the amount taken into custody in 2018.\n\nSieff reported from Mexico City.", "description": "Since a June 7 accord with Mexico, U.S. border arrests have been cut in half. But Homeland Security officials say migration levels are still too high.", "authors": ["Nick Miroff", "Reporter Covering Immigration Enforcement", "The Department Of Homeland Security", "Kevin Sieff", "Latin America Correspondent", "September At Pm", "Nick Miroff Covers Immigration Enforcement", "The Department Of Homeland Security For The Washington Post. He Was A Post Foreign Correspondent In Latin America To", "Has Been A Staff Writer Since", "Kevin Sieff Has Been The Washington Post S Latin America Correspondent Since He Served Previously As The Paper'S Africa Bureau Chief"], "top_image": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2019/07/09/National-Security/Images/DSC_1785.jpg?t=20170517", "published_at": "2019-09-06"}