{"pub": "yahoo", "url": "https://sg.finance.yahoo.com/news/huron-hurn-report-q3-earnings-145902756.html", "downloaded_at": "2019-10-25 17:10:07.069916+00:00", "title": "Huron (HURN) to Report Q3 Earnings: What's in the Cards?", "language": "en", "text": "Huron Consulting Group Inc. HURN will report third-quarter 2019 results on Oct 29, after the bell.\n\nShares of the company have gained 28.5% over the past year, outperforming the 17.2% rally of the industry it belongs to.\n\nQ3 Expectations\n\nThe Zacks Consensus Estimate for revenues in the to-be-reported quarter is pegged at $210 million, indicating sequential decline of 13.9%. Weakness across all three segments — Healthcare, Business Advisory, and Education — is expected to have weighed on the top line.\n\nThe consensus mark for Business Advisory revenues is pegged at $60 million, indicating a 3.2% sequential decline. Education segment revenues are anticipated to be around $55 million, suggesting a sequential decline of 3.5%. Healthcare segment revenues are expected around $91 million, indicating a sequential decline of 10.8%.\n\nIn second-quarter 2019, revenues of $244 million increased 9.4% year over year.\n\nThe Zacks Consensus Estimate for earnings in the to-be-reported quarter is pegged at 66 cents, indicating a sequential decline of 13.2%. Weak operating performance is likely to have hurt the bottom line in the third quarter.\n\nIn second-quarter 2019, adjusted earnings of 76 cents per share increased 90% year over year.\n\nHuron Consulting Group Inc. Price and EPS Surprise\n\nHuron Consulting Group Inc. Price and EPS Surprise More\n\nHuron Consulting Group Inc. price-eps-surprise | Huron Consulting Group Inc. Quote\n\nWhat Our Model Says\n\nOur proven Zacks model does not conclusively predict an earnings beat for Huron this season. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the odds of an earnings beat. But that’s not the case here. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\n\nHuron has an Earnings ESP of 0.00% and Zacks Rank #3.\n\nStocks to Consider\n\nHere are a few stocks from the broader Zacks Business Services sector that investors may consider as our model shows that these have the right combination of elements to beat on third-quarter 2019 earnings:\n\nS&P Global SPGI has an Earnings ESP of +1.72% and a Zacks Rank #2. The company is slated to report results on Oct 29. You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nWEX Inc. WEX has an Earnings ESP of +1.24% and a Zacks Rank #3. The company is slated to report results on Oct 31.\n\nFidelity National Information Services, Inc. FIS has an Earnings ESP of +0.13% and a Zacks Rank #3. The company is slated to release results on Nov 5.\n\n5 Stocks Set to Double\n\nEach was hand-picked by a Zacks expert as the #1 favorite stock to gain +100% or more in 2020. Each comes from a different sector and has unique qualities and catalysts that could fuel exceptional growth.\n\nMost of the stocks in this report are flying under Wall Street radar, which provides a great opportunity to get in on the ground floor.\n\nToday, See These 5 Potential Home Runs >>\n\n\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n\n\nS&P Global Inc. (SPGI) : Free Stock Analysis Report\n\n\n\nWEX Inc. (WEX) : Free Stock Analysis Report\n\n\n\nHuron Consulting Group Inc. (HURN) : Free Stock Analysis Report\n\n\n\nFidelity National Information Services, Inc. (FIS) : Free Stock Analysis Report\n\n\n\nTo read this article on Zacks.com click here.\n\n\n\nZacks Investment Research", "description": "Huron's (HURN) third-quarter 2019 results are expected to reflect a sequential decline in earnings and revenues.", "authors": ["Zacks Equity Research"], "top_image": "https://s.yimg.com/uu/api/res/1.2/dheMOrrEeXRxdMfHO0oLuw--~B/aD00MDA7dz02MzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/76de46512b6b2ed03cb613b33bb84828", "published_at": "2019-10-25"}