{"pub": "hotair", "url": "https://hotair.com/headlines/archives/2019/09/wont-end-well-trump-obscure-new-national-security-advisor", "downloaded_at": "2019-09-20 23:58:37.168776+00:00", "title": "“It won’t end well”: Trump and his obscure new National Security Advisor", "language": "en", "text": "The distracting spectacle of another White House personnel shuffle obscured what a consequential moment this is for Trump’s foreign policy. Often precarious, it now seems to be unravelling altogether, collapsing under the weight of its own contradictions, flawed assumptions, and lack of willing partners. During the past few weeks, Trump’s Afghanistan peace talks fell apart after he withdrew an ill-advised invitation to the Taliban to Camp David; his North Korea nuclear talks appear all but dead, and Pyongyang’s nuclear arsenal is now reported to have grown significantly during Trump’s tenure; and his on-again, off-again trade talks with China have so far resulted only in escalating tariffs that are now unnerving businesses worldwide…\n\nI asked a Republican who knows O’Brien from both the Bush and Trump Administrations whether he was ready for such an enormous challenge. “Nice guy, but in way, way over his head,” the Republican, a former senior Bush Administration official, told me. “I’ve worked with a series of national-security advisers, and he’s not qualified to be national-security adviser,” he added, pointing out that “he has no experience on Russia or arms control or intelligence or covert action or Latin America. Now he’s got the whole world.” The Republican said that he liked O’Brien and just wished that he had said no to the President, predicting, “I don’t think this will end well.”", "description": "", "authors": ["Susan Glasser", "Newyorker.Com News Letter-From-Trumps-Washington It-Wont-End-Well-Trump-And-His-Obscure-New-National-Security-Chief"], "top_image": "", "published_at": "2019-09-20"}