{"pub": "investingcom", "url": "https://in.investing.com/news/commodities-news/softsraw-sugar-prices-edge-up-focus-on-october-expiry-1995862", "downloaded_at": "2019-09-30 11:35:16.605260+00:00", "title": "SOFTS-Raw sugar prices edge up, focus on October expiry", "language": "en", "text": "© Reuters. SOFTS-Raw sugar prices edge up, focus on October expiry\n\nLONDON, Sept 30 (Reuters) - Raw sugar futures on ICE (NYSE: ) were higher on Monday with the market's focus on the expiry of the October contract later in the day while cocoa and coffee prices were slightly lower.\n\nSUGAR\n\n* March raw sugar SBc2 was up 0.08 cent, or 0.6%, at 12.70 cents per lb by 1107 GMT.\n\n* Dealers said the expiry of the October contract SBV9 later on Monday was providing the main short-term focus.\n\n* A modest delivery of about 500,000 tonnes is generally expected, much smaller than the more than two million tonnes delivered at the last expiry. A significant reduction in the net short position held by speculators was seen as potentially bullish. \"It is clear that the funds have begun to cover shorts. No one can be sure that they will continue, but we do know that once they change direction they tend to go on in that new direction with big volumes and for a considerable time,\" broker Marex Spectron said in a market update.\n\n* December white sugar was up $2.10, or 0.6%, at $343.50 per tonne, after peaking at $344, the highest for the front month since late April.\n\nCOCOA\n\n* December New York cocoa CCZ9 was down $13, or 0.5%, at $2,477 a tonne.\n\n* Dealers were awaiting the start of the 2019/20 main crop season in Ivory Coast on Tuesday, with farmgate prices expected to rise to 825 CFA francs from 750.\n\n* March LCCc2 was down 14 pounds, or 0.7%, at 1,866 pounds a tonne with a slight recovery in sterling adding to downward pressure.\n\n* Sterling inched higher on Monday after a week of hefty losses, as the focus remained squarely on Brexit news from the ruling Conservatives' annual party conference. GBP/\n\nCOFFEE\n\n* December arabica coffee KCZ9 fell 0.6 cent, or 0.6%, to $1.0030 per lb.\n\n* November robusta coffee was down $8, or 0.6%, at $1,313 per tonne.\n\n* Vietnam's coffee exports in the first nine months of the year likely fell 12% from a year earlier to 1.27 million tonnes, government data released on Saturday showed.", "description": "SOFTS-Raw sugar prices edge up, focus on October expiry", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC8R1OD_L.jpg", "published_at": "2019-09-30"}