{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/airplane-secret-pilot-flight-attendant-rest-longest-flight-sydney-qantas-2019-10", "downloaded_at": "2019-10-21 13:25:12.751862+00:00", "title": "Here’s how pilots on the world’s new longest flight will stay rested and alert for the 20 hours from New York to Sydney", "language": "en", "text": "Qantas just completed the first-ever nonstop flight between New York and Sydney, Australia, designated \"Project Sunrise,\" and Business Insider was on board.\n\nQantas used the flight to study how pilots and flight attendants can stay rested, alert, and capable during ultra-long-haul flights.\n\nCrews took turns resting in specialized, secret break areas on the plane. While passengers will usually never see these crew compartments, we had a chance to take a look during this unique research flight. Read on to see the inside of these crew quarters.\n\nVisit Business Insider's homepage for more stories.\n\nAustralian airline Qantas successfully completed its first test flight for its \"Project Sunrise\" initiative last weekend – a program to launch regular commercial service from Sydney to New York and Sydney to London.\n\nThe flights, at about 9,900 and 10,500 nautical miles, respectively, represent the farthest – and currently the longest, in terms of time – nonstop flights today.\n\nThe flight won't launch regular commercial service until at least 2022 or 2023, but Qantas used this flight – and plans to do the same for the London route – to conduct research into how pilots, cabin crews, and passengers cope with the long flight time. In particular, data gathered from monitoring of the pilots and flight attendants will be used to help Qantas make a case to Australian aviation regulators that it's safe to have crew work in shifts for potentially 20 hours or more.\n\nThe airline also tested a redesigned cabin service, meant to help passengers minimize the effects of jetlag as they cross 15 time zones, and reduce the magnitude with which an ultra-long-haul flight can exacerbate those symptoms.\n\nRead more: I flew on Qantas' 'Project Sunrise,' a nonstop flight from New York to Sydney, Australia, which took almost 20 hours and covered nearly 10,000 miles — here's what it was like\n\nThis flight also doubled as a delivery of a new Boeing 787-9, from Boeing's Seattle plant. There were only 40 passengers and 10 crew, including four on-duty pilots. Passengers included several Qantas frequent flyers participating in the research study, off-duty Qantas employees, researchers, and media, including this reporter.\n\nBreaks and adequate rest periods during any long flight are crucial for helping pilots and flight attendants remain alert, and they become even more important when the flight lasts almost a full day.\n\nTo ensure they can get some shut eye in a relatively private setting, long-haul planes are designed with specialized crew rest compartments — hidden areas of the plane with cots, or bunks, where crews can rest.\n\nMost passengers will never see these hidden rest areas, but this Project Sunrise test was no ordinary flight; the crew was gracious enough to let us take a look at the whole plane while the bunks were unoccupied early into the flight.\n\nHere are the secret parts of the airplane where pilots and flight attendants go to sleep.", "description": "The four pilots and six flight attendants worked in shifts, and took breaks in specialized crew rest areas.", "authors": ["David Slotnick"], "top_image": "https://image.businessinsider.com/5dad91754af90963fc7b2333?width=1200&format=jpeg", "published_at": "2019-10-21"}