{"pub": "metro", "url": "https://metro.co.uk/2019/10/22/manchester-arena-bombers-brother-pleads-not-guilty-22-murders-10962950", "downloaded_at": "2019-10-22 13:37:35.413645+00:00", "title": "Manchester Arena bomber’s brother pleads not guilty to 22 murders", "language": "en", "text": "Hashem Abedi has formally entered not guilty pleas at the Old Bailey to multiple charges of murder in relation to the bombing of Manchester Arena in 2017 (Picture: PA)\n\nThe younger brother of the Manchester Arena suicide bomber today denied murdering 22 people in the atrocity.\n\nHashem Abedi, 22, was arrested in Libya shortly after his brother Salman detonated a suicide vest as thousands of people left an Ariana Grande concert on 22 May 2017.\n\nThe defendant is alleged to have made ‘successful and unsuccessful attempts’ to buy bomb making chemicals.\n\nIt is also alleged that he made the detonator tubes which were used in the attack.\n\nAbedi was handed over to British police officers and flown back to the UK from Tripoli in July of this year.\n\nHe stood in the dock at the Old Bailey today wearing a grey fleece with glasses held together by dental floss and blue tack.\n\nEmergency services at Manchester Arena after Salman Abedi launched a suicide attack during an Ariana Grande concert (Picture: PA)\n\nHe spoke only to confirm his name and enter his not guilty pleas to 22 counts of murder, one of attempted murder, and one of conspiring to cause explosions.\n\nAdvertisement\n\nAdvertisement\n\nMr Justice Baker set Abedi’s six to eight week trial for 13 January next year and remanded him in custody.\n\nThe Manchester Arena bombing which killed 22 people and left more than 260 injured, led to a nationwide outpouring of grief, with families and friends of the victims left devastated.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "The defendant is alleged to have made ‘successful and unsuccessful attempts’ to buy bomb making chemicals.", "authors": ["Basit Mahmood"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_91173684-e1571746436191_1571746679.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-22"}