{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7550299/Pound-dives-month-low-against-euro-Brexit-fears-spook-traders.html", "downloaded_at": "2019-10-08 13:00:45.475217+00:00", "title": "Pound dives to month low against euro as Brexit fears...", "language": "en", "text": "The pound dived to its lowest against the euro for more than a month as the possibility of a no-deal exit from the EU intensified.\n\nTrading sentiment plummeted after Downing Street claimed the European Union had made a Brexit deal “impossible”, fuelling a war of words with the EU.\n\nSterling slid against the euro and the US dollar after a sell-off was triggered by a statement from Downing Street, highlighting that the Prime Minister had a difficult conversation on Brexit with German chancellor Angela Merkel.\n\nThe pound fell by 0.67% against the euro to 1.112 and slid by 0.52% to 1.222 against the dollar during trading on Tuesday.\n\nThe pound slumped against the dollar on the back of no-deal Brexit fears (PA Graphics)\n\nNeil Wilson, chief market analyst at Markets.com, said: “Sterling is under the cosh again as hopes of a deal between the UK and EU fade.\n\n“The last flicker of hope was snuffed out this morning after a call between the PM and Chancellor Merkel of Germany left the process at an impasse.\n\n“The pound does not like the tone of all this.”\n\nDisappointing productivity data from the Office of National Statistics added to traders’ woes on Tuesday morning.\n\nNew figures revealed at Britain’s productivity fell at the fastest annual pace in five years as Brexit uncertainty compounds an already weak spot in the UK economy.\n\nNevertheless, the pound remains marginally stronger than at the start of August, when it sunk its lowest in more than a year as trading sentiment rapidly deteriorated.\n\nThe London markets are all also down for the day as the stock markets remain on tenterhooks for a trade deal between the US and China.\n\nThe FTSE 100 was 25 points down at 7,172.2 points after morning trading on Tuesday.", "description": "The pound fell by 0.67% against the euro to 1.112 and slid by 0.52% to 1.222 against the dollar during trading on Tuesday.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/13/wire-19442810-1570539215-460_636x382.jpg", "published_at": "2019-10-08"}