{"pub": "cnbc", "url": "https://cnbc.com/2019/10/25/why-jeff-bezos-never-doubted-amazons-potential.html", "downloaded_at": "2019-10-25 16:11:43.887081+00:00", "title": "Why Jeff Bezos never doubted Amazon — even when its stock fell to $6", "language": "en", "text": "After Amazon earnings missed Wall Street expectations on Thursday, the stock took a major hit.\n\nBut it's unlikely you will find Amazon CEO Jeff Bezos stressing over the company's day-to-day stock price.\n\nSince his first letter to shareholders in 1997, Bezos has emphasized his belief that \"it's all about the long-term.\"\n\n\"We will continue to make investment decisions in light of long-term market leadership considerations rather than short-term profitability considerations or short-term Wall Street reactions,\" he said in his 1997 letter, setting a precedent for the future at Amazon.\n\nAfter the company went public in May of 1997, Bezos encouraged his employees to ignore the highs and lows of the company's stock performance. According to the Amazon CEO, the company's fixed cost business model would bring long-term success, and he was correct.\n\n\"We had gone public on a split-adjusted basis, $1.50 a share in today's terms, and the market became very quickly an internet bubble kind of market,\" Bezos said at the Bush Center Forum on Leadership in 2018. \"The stock prices went up very, very high.\"\n\nBut even when the stock went far down, Bezos said he always \"preached\" to employees at all-hands meetings, telling them to not worry.\n\n\"I liked our business, and I liked the fundamentals of our business, but I also knew that the stock price was disconnected from what we were doing on a day-to-day basis,\" he said at the forum.", "description": "You probably won't find Amazon CEO Jeff Bezos stressing over stock price. Since his first letter to shareholders in 1997, Bezos has always emphasized his belief that \"it's all about the long-term.\" Even when its stock fell to $6 during the dotcom bust.", "authors": ["Taylor Locke"], "top_image": "https://image.cnbcfm.com/api/v1/image/104242211-GettyImages-51042944.jpg?v=1572015999", "published_at": "2019-10-25"}