{"pub": "dailybeast", "url": "https://thedailybeast.com/fired-massage-envy-staffer-went-on-to-molest-women-at-new-spa-cops-say", "downloaded_at": "2019-10-13 09:54:15.337170+00:00", "title": "Fired Massage Envy Staffer Went On to Molest Women at New Spa, Cops Say", "language": "en", "text": "When Claire* first lay down on Thomas Winne’s massage table this summer, she had no idea that he’d been accused of assaulting multiple women in her area, on tables just like that one.\n\nIn fact, according to an arrest affidavit, the 20-year-old went to see Winne at the urging of her roommate. His Yelp page was full of glowing reviews, with former clients calling him a “highly knowledgeable” masseur who “really cares about healing his clients.” He billed himself as a licensed massage therapist and nurse who specialized in deep tissue and sports massage.\n\nBut when police arrested the Little Rock, Arkansas masseur last week, Claire learned the truth: That he had been fired from a local Massage Envy parlor just two years earlier, after multiple women accused him of inappropriate touching. The women’s complaints were never made public, and Winne started his new business in an office park just three miles down the road.\n\nClaire said the revelation made her feel betrayed.\n\n“You're supposed to be able to trust licensed medical professionals,” she told The Daily Beast. “You shouldn't have to worry about, when you go into an appointment, that you're going to be sexually assaulted.”\n\nClaire’s first appointment with Winne was unremarkable, according to court documents obtained by The Daily Beast. It wasn’t until her second visit that Winne allegedly flipped her onto her back and began massaging her upper thigh. He asked her if she trusted him, a police report states, then stuck his finger inside her vagina.\n\nThe student told police she was “extremely uncomfortable” with the conduct but afraid to fight back, knowing that the two were alone in the building. She told The Daily Beast that Winne urged her not to discuss what happened, lest someone “get the wrong opinion.” He repeatedly told her the touching was a medical treatment—an attempt to reach her “donut muscle.”\n\nIt wasn’t until weeks later, when she discussed the incident with her roommate’s mother, that Claire says she realized Winne’s behavior was inappropriate. She decided to report him to police.\n\n“He was so rehearsed and confident in what he was doing that it felt like it was something he did all the time,” she said. “I felt like it was my duty to make sure he wouldn't do it again.”\n\nInvestigators now believe Claire’s intuition about Winne was right. In 2012, according to court documents, a woman told Massage Envy management that Winne had penetrated her with his fingers during a massage. She declined to report the incident to police, and the therapist stayed on staff. But four years later, a second woman reported Winne for the same offense.\n\nThe franchise owner brought Winne into a taped interview after the second report, during which he admitted to inappropriately touching the client. He claimed the conduct was a mistake, saying his hand “accidentally slipped” while giving the massage. Massage Envy decided to fire him.\n\nAcross the country, more than 180 women have reported being sexually assaulted at Massage Envy franchises, according to BuzzFeed News. Customers have filed dozens of lawsuits against the company in recent years, and the massage chain recently adopted a new “zero tolerance” sexual misconduct policy.\n\nBut the company declined to answer questions from The Daily Beast about what happens to accused employees after they are fired. In an emailed statement, the company said it supported the decision of any victim to report misconduct, and would supply accusers with contact information for local law enforcement.\n\n“We urge anyone that experiences anything other than a safe, quality massage to report it immediately to the franchise location so that it can be investigated,” they added.\n\nWinne was arrested on Oct. 25 of this year, after nearly five months of investigation. He has yet to enter a plea or secure an attorney, and did not return The Daily Beast’s request for comment. He currently faces three counts of felony rape, stemming from Claire’s complaints and the complaints from Massage Envy.\n\nBuried in the affidavit, however, is a third allegation that predates the others. A Little Rock woman contacted by police this summer said Winne assaulted her years ago, while he was working for a local chiropractor. During a routine massage, the woman said, Winne began rubbing his penis against her arms until he became erect. She did not report the incident to authorities at the time, but did so this year after being contacted by police.\n\n“ I called the massage therapist license board and reported it when I filed my criminal charges ... So why couldn’t Massage Envy or the doctor's office he worked for before have called? ”\n\nReached by phone by The Daily Beast, the owner of the chiropractor’s office, William Carbary, confirmed that he had employed Winne in 2011 and fired him following a complaint of sexual misconduct. He declined to elaborate further.\n\nClaire said she hopes other women will come forward with allegations, and that the case will result in changes. She hopes that all massage parlors will be required to report allegations of sexual misconduct to licensing boards in the future.\n\n“I called the massage therapist license board and reported it when I filed my criminal charges [against Winne],” she said. “So why couldn’t Massage Envy or the doctor's office he worked for before have called?”\n\n“Firing someone isn't enough if they can just go open up their own business,” she added.\n\n*The Daily Beast has changed this name to protect the identity of the alleged victim.", "description": "A woman reported a masseur for sexual assault—and found out he’d quietly been fired by a Massage Envy parlor over similar allegations.", "authors": ["Emily Shugerman", "Gender Reporter"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1541022812/181031-shugerman-massange-envy-tease_nhmnxz", "published_at": "2018-10-31"}