{"pub": "independent", "url": "https://independent.co.uk/life-style/global-climate-strike-protests-best-signs-world-second-friday-greta-thunberg-a9122411.html", "downloaded_at": "2019-09-27 07:15:42.664273+00:00", "title": "Global Climate Strike: Best signs from second Friday of protests around the world", "language": "en", "text": "On Friday 27 September, the second round of protests organised for the Global Climate Strike are due to take place across the world.\n\nLast week, thousands of people in countries including Ireland, Germany, India, Nepal and Australia took to the streets to voice their concerns about the detrimental impact of climate change.\n\nEnvironmental activist Greta Thunberg – who went viral last year when she abstained from school in Sweden to raise awareness of the climate crisis – is at the forefront of the Global Climate Strike movement.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe 16-year-old’s demonstrations outside Swedish parliament in 2018 inspired the #FridaysForFuture movement, spurring environmental activists across the world to take part in school strikes on Fridays.\n\nClick through the gallery above to see a selection of the best signs being held aloft at protests around the world for today’s Global Climate Strike.\n\nOn Monday, Thunberg addressed world leaders as she attended the United Nations Climate Change Summit in New York, three days after the first round of international protests for the Global Climate Strike took place.\n\nThe Swedish teenager explained why she believed her presence at the summit was “wrong”, as she “should be in school on the other side of the ocean”.\n\n“Yet, you all come to us young people for hope? How dare you. You have stolen my dreams and my childhood with your empty words,” the activist said.\n\n“People are suffering. People are dying. And all you can talk about it money and fairy tales of eternal economic growth. How dare you.”\n\nOn Friday morning, Thunberg tweeted her support for those taking part in the second round of Global Climate Strikes.\n\n“Good luck everyone striking around the world. Change is coming!!” the activist stated.\n\nFor all the latest news on the Global Climate Strike, click here.", "description": "On Friday 27 September, the second round of protests organised for the Global Climate Strike are due to take place across the world.", "authors": ["Sabrina Barr"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/27/07/global-climate-strike.jpg", "published_at": "2019-09-27"}