{"pub": "washingtonpost", "url": "https://washingtonpost.com/nation/2019/10/17/cuban-immigrant-asked-asylum-detention-killed-himself-ice", "downloaded_at": "2019-10-17 11:35:47.117530+00:00", "title": "A Cuban immigrant asked for asylum. After months of detention, he killed himself, ICE says.", "language": "en", "text": "Then, on Tuesday afternoon, he was found dead in his cell, Immigration and Customs Enforcement said. The agency said it was caused by “self-inflicted strangulation,” though the case remains under investigation.\n\nHernandez-Diaz, the second detainee to die in ICE custody this month, has a backstory that points to several new realities in the immigration system: An influx of Cubans, who are stuck in detention due to policy changes during the Obama administration. An increasing reliance by ICE on rural jails in Louisiana, where detainees charge they have been kept for months on end. And reports of deaths, suicide attempts, and hunger strikes from those detainees.\n\nAD\n\nAD\n\nHernandez-Diaz’s wife, Yarelis Gutierrez, told BuzzFeed News that the Cuban government persecuted her husband for criticizing the government and attempting to leave the country three times: twice in 1994, and again in 2001. Officials had imprisoned him for nine years, she said.\n\nFor decades after the end of the Cold War until the final days of the Obama administration, the United States bestowed special immigration privileges on Cubans fleeing the communist nation: Once they reached U.S. soil, according to a policy known as “wet foot, dry foot,” they could take advantage of a path to permanent legal residency.\n\nWithout that path, tens of thousands of migrants — many of them from Cuba — are coming to the U.S. as the couple appears to have: traveling to South America and then paying smugglers or following WhatsApp instructions through the Darien Gap, a treacherous section of tropical rainforest and marshland.\n\nAD\n\nAD\n\nGutierrez didn’t return messages late on Wednesday, but in a video she shared on social media, she recounted the couple leaving Cuba. It’s not clear where the couple went next, but her posts on social media indicate that the couple fled to South America and then headed north to the U.S.-Mexico border. The woman’s Facebook friends wrote about having met her while she was selling orange juice in Peru, or otherwise in Trinidad and Tobago and Argentina.\n\n“I’ve gone through millions of struggles but thanks to God being with me, I got past them all,” she said in the Facebook video, posted on June 13. “I asked God to bring me here safely and healthily, for me to be able to cross the jungle without seeing any animals or coming across any dangers.”\n\nIn the video, Gutierrez recalled how she and her husband were left alone during their trek by others in their group and forced to fend for themselves. When they reached Mexico, immigration officials detained them for five days and then allowed the couple to continue on their way north.\n\nAD\n\nAD\n\n“We went through terrible things,” she said. “When we got to Mexico, it was hard for us. We didn’t have economic means, but God always aided us, always found a way to help us. An outstretched hand always appeared.”\n\nHernandez-Diaz and his wife legally entered in May, crossing a bridge into Texas, and asked for asylum. That path has become so common in recent months that thousands of Cubans are now waiting in Ciudad Juárez, across the banks of the Rio Grande and barely halfway away from downtown El Paso, to follow in their footsteps.\n\nAt the border, Hernandez-Diaz said he feared a return to Cuba, BuzzFeed News reported. By June, U.S. Citizenship and Immigration Services officials said that fear was considered “credible,” according to an internal government report obtained by the website, after an interview at the start of the asylum application process.\n\nAD\n\nAD\n\nWhile Gutierrez was released from detention, Hernandez-Diaz remained locked up by ICE. Officials took him to Richwood Correctional Center, a for-profit jail on the outskirts of Monroe, La., in the state’s swampy and mostly rural northern region.\n\nRichwood is one of eight rural jails in the area that have begun immigrants in the past year, as ICE expands its local capacities and the state’s criminal justice reforms cause facilities to empty out of regular prisoners. Out of 51,000 immigrants detained across the country this month, about 8,000 were held in Louisiana, according to the Associated Press.\n\nNathalia Rocha Dickson, a Louisiana immigration lawyer, said that conditions in these facilities are dire: Guards who don’t speak Spanish and who are largely untrained, rotating in and out. Tasteless food served at strict meal times, and a commissary that’s expensive or is unavailable entirely.\n\nAD\n\nAD\n\nLaSalle Corrections, the private-prison company that runs Richwood and most of the other new facilities, has been accused of punishing detainees by putting them in solitary confinement. A representative for the company did not immediately respond to a request for comment early on Thursday.\n\n“We provide the highest levels of service to our population, consistent with ICE’s detention standards, which in the industry is the gold standard,” Scott Sutterfield, a development executive for the company, told WVLA last month.\n\nOne gay detainee told a Mother Jones reporter that he was kept alone for 40 days and started hearing voices. After being prescribed sleeping pills and Prozac in response to suicidal thoughts, he has spent the past two months with just one other person.\n\nAD\n\n“It’s been torture for me,” he said. “Torture by ICE.”\n\nAD\n\nThe agency said in a statement that it “is firmly committed to the health and welfare of all those in its custody and is undertaking a comprehensive agency-wide review of this incident, as it does in all such cases.” Statistically, it said, fatalities in ICE custody are “exceedingly rare.”\n\nIn September, a federal judge ruled that ICE was unlawfully refusing to let detainees held in the Deep South out on parole. None had been released at all this year, down from about 75 percent in 2016. In Hernandez-Diaz’s case, ICE had rejected two of his requests to be released on parole.\n\n“This is what causes people to be hopeless and tired and stuck in the system,” Dickson said. “Why are you keeping people stuck inside detention if they can fight their cases outside detention?”\n\nAD\n\nShe said that she stopped accepting parole cases. “Take your money elsewhere,” she recalls telling possible clients, “because there’s no way you’ll win.\"\n\nAD\n\nThat prolonged detention has led many of the Cuban asylum seekers to refuse meals or go on short hunger strikes in protest — including, reportedly, Hernandez-Diaz.\n\nOn Friday, Richwood separated him from the other inmates in response to his threats, BuzzFeed reported. While he had been seen eating that day and the day after, he had missed his ninth consecutive meal by Tuesday.\n\n“He told me he was going to participate in a hunger strike because of the abuse he endured in detention,” Gutierrez said. “He never said he was going to hurt or kill himself.”\n\nIn an interview with a Mother Jones reporter, she expressed her outrage at her husband’s death. “Today, it was my husband, but how many have there been before?” she said. “How many more will there be if we don’t control this?”\n\nOn Wednesday, Mother Jones reported, the gay man had tried to hang himself, too.\n\nAD", "description": "Roylan Hernandez-Diaz, who had been denied parole while detained at a for-profit facility in Louisiana, is the second person to die while in immigration custody this year.", "authors": ["Teo Armus", "Reporter On The Morning Mix Team"], "top_image": "https://www.washingtonpost.com/resizer/jmbztllC367N81toFUNkLkBfNeQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EIFWM2HKRAI6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-17"}