{"pub": "businessinsider", "url": "https://businessinsider.com/felicity-huffman-sentenced-college-admissions-scandal-2019-9", "downloaded_at": "2019-09-13 20:10:36.852440+00:00", "title": "Felicity Huffman has been sentenced to 14 days in prison for her role in the college-admissions scandal", "language": "en", "text": "The \"Desperate Housewives\" actor pleaded guilty to fraud charges in May and admitted to paying $15,000 to have an SAT proctor correct her daughter's exam answers.\n\nHuffman is one of 51 people charged in the college-admissions scandal and the first parent to be sentenced.\n\nVisit INSIDER's homepage for more stories.\n\nFelicity Huffman has been sentenced to 14 days in prison for her role in the college-admissions scandal.\n\nThe sentencing judge said in federal court in Boston on Friday afternoon that she believed Huffman had taken responsibility for her actions and was not a threat to the public but that \"trying to be a good mother does not excuse this.\"\n\nHuffman is one of 51 people charged in the scandal, in which parents are accused of paying the scheme's ringleader, William \"Rick\" Singer, to bribe college coaches and exam administrators to get their children into elite universities.\n\nHuffman spoke to the courtroom ahead of her sentencing and apologized for her role in the scheme. She admitted to paying $15,000 to have an SAT proctor correct her daughter's exam answers.\n\n\"I am deeply sorry to the students, parents, colleges, and universities who've been impacted by my actions,\" she said. \"I am sorry to my daughter Sophia, and Georgia, and I am sorry to my husband, Will. I have betrayed them.\"\n\nShe apologized to her daughter, who she said did not know about the scheme and unknowingly had her SAT answers corrected.\n\n\"I can only say I am so sorry, Sophia,\" she said. \"I was frightened, I was stupid, and I was so wrong. I am deeply ashamed of what I've done.\"\n\nShe added: \"I take full responsibility for my actions. I will deserve whatever punishment you give me.\"\n\nHuffman's husband, William H. Macy, and 13 other friends attended the sentencing.\n\nThe \"Desperate Housewives\" actor pleaded guilty to fraud charges in May. She is the first parent to be sentenced in the scandal.\n\nFederal prosecutors had asked the judge to sentence Huffman to a month in prison for her role in the bribery scandal, according to a filing from the US Attorney's Office seen by Insider.\n\nAlong with 14 days in prison, Huffman was fined $30,000 and ordered to do 250 hours of community service. She will be on supervised release for a year.\n\nProsecutors said there was 'no excuse' for what Huffman did\n\nAt the sentencing hearing on Friday, prosecutors said there was \"no excuse\" for what Huffman did and hit back at her claim that she was trying to help her struggling daughter.\n\n\"With all due respect to the defendant, welcome to parenthood. There's no instruction manual. Parenthood is exhausting and stressful, but that's what every parent goes through,\" the prosecutor said, according to the BuzzFeed News reporter Julia Reinstein.\n\nThe prosecutor also referred to the case of a mother in Akron, Ohio, who was sentenced to 10 days in jail after lying about her residency to get her daughter into a better school district.\n\n\"If we respect the rule of law, we should not treat defendants differently because of wealth or status,\" the prosecutor said.\n\nHe said Huffman's request of probation and community service was \"no punishment at all.\"\n\n\"Prison is the great leveler. Prison is necessary here,\" the prosecutor said. \"She did this once, but she planned to do this again, signaling an inherent disregard for the laws that govern our society.\"\n\nHuffman had asked for a year of probation, 250 hours of community service, and a $20,000 fine instead. She also filed 28 letters from supporters, including her husband, Macy, and her former \"Desperate Housewives\" costar Eva Longoria.\n\nHuffman, too, had shared a letter with the judge.\n\n\"Please, let me be very clear; I know there is no justification for what I have done,\" Huffman's letter said, according to USA Today. \"Yes, there is a bigger picture, but ultimately it doesn't matter because I could have said 'No,' to cheating on the SAT scores. I unequivocally take responsibility for my actions and will respectfully accept whatever punishment the court deems appropriate.\"\n\n'I talked myself into believing that all I was doing was giving my daughter a fair shot,' Huffman said in a letter to the judge ahead of her sentencing\n\nHuffman's lawyers said in a sentencing memo to the judge that she \"did not seek out Singer to falsify her daughter's test results,\" nor did she enlist her daughter in criminal conduct.\n\nThey said in court on Friday that Huffman's contribution to the scheme, at $15,000, was low compared with others involved.\n\nAs Huffman addressed the court, she cried as she spoke about the day she took her eldest daughter to the SAT testing center, according to Adam Bagni, a journalist with WCVB.\n\n\"I thought to myself, 'Turn around,' and to my eternal shame, I didn't,\" she said.\n\nShe added that her daughter learning about the scheme was the hardest part. She said Sophia told her, \"I don't know who you are anymore, Mom,\" and asked her \"Why didn't you believe in me? Why didn't you think I could do it on my own?\"\n\nHuffman took responsibility for her role in the scandal in the letter to the judge.\n\n\"In my desperation to be a good mother I talked myself into believing that all I was doing was giving my daughter a fair shot. I see the irony of that statement now because what I have done is the opposite of fair. I have broken the law, deceived the education community, betrayed my daughter and failed my family,\" Huffman said.\n\nShe added: \"When my daughter looked at me and asked with tears streaming down her face, 'Why didn't you believe in me? Why didn't you think I could do it on my own?' I had no adequate answer for her. I could only say, 'I am sorry.'\"\n\nRead more: Here's why Lori Loughlin is facing up to 40 years in prison in the college-admissions scandal while Felicity Huffman, who pleaded guilty, is facing less than a year\n\nHuffman admitted to paying $15,000 to have an SAT proctor correct her daughter's exam answers\n\nAn affidavit said that Huffman arranged for her daughter to take the SAT at the West Hollywood Test Center, where her answers were later corrected. Huffman then disguised the $15,000 as a charitable donation for disadvantaged young people.\n\nCourt documents said Huffman arranged for her daughter to be part of the scheme as well but later decided against it.\n\n\"I am ashamed of the pain I have caused my daughter, my family, my friends, my colleagues, and the educational community,\" Huffman said in a statement after agreeing to plead guilty.\n\nProsecutors initially recommended four months in prison for Huffman but later lowered the recommendation to 30 days.\n\nLawyers previously told Insider that Huffman's sentencing could be an indication of what other parents will face, and it might even make some who pleaded not guilty, like the actress Lori Loughlin, change their pleas.\n\nLoughlin has pleaded not guilty in the case. She and her husband, Mossimo Giannulli, are accused of paying Singer $500,000 to guarantee their daughters' admissions to USC. Loughlin and Giannulli have court hearings scheduled for October 2.", "description": "Felicity Huffman admitted to paying $15,000 to have an SAT proctor correct her daughter's exam answers as part of the college-admissions scandal.", "authors": ["Kelly Mclaughlin"], "top_image": "https://amp.businessinsider.com/images/5d7bf08321214c2b89379624-1920-960.jpg", "published_at": "2019-09-13"}