{"pub": "reuters", "url": "https://reuters.com/article/us-usa-trade-china-agriculture/chinese-farm-official-says-good-outcome-from-trade-talks-state-media-idUSKBN1W804S", "downloaded_at": "2019-09-23 04:28:36.420369+00:00", "title": "Chinese farm official says 'good outcome' from trade talks: state media", "language": "en", "text": "BEIJING (Reuters) - China did not cancel planned visits to farms in the United States because of challenges in trade negotiations with the U.S., the country’s senior agricultural representative in the talks said, according to a report by state-backed media group Yicai on Sunday, who added the talks last week achieved a “good outcome.”\n\nChinese officials on Friday unexpectedly canceled visits to farms in Montana and Nebraska scheduled for this week, as deputy trade negotiators wrapped up two days of talks in Washington, casting further uncertainty over a Sino-U.S. trade deal.\n\nLast week’s trade negotiations were constructive and made thorough preparation for talks in early October, said Han Jun, the deputy director of the Office of the Central Rural Work Leading Group, at an event in Washington, D.C., according to Yicai.\n\n“There was a good outcome from the negotiations in the agriculture area too. The two sides had thorough and candid communications,” csaid, according to Yicai.\n\nThe farm visits were planned separately to the trade talks, and the U.S. side has said they will send out another invite another time, Han said, according to the report.\n\nThe farm visits were seen as a goodwill gesture, which could have led to purchases of U.S. soybeans and pork.\n\nThe cancellation pushed major global stock indexes lower on Friday as optimism about a trade deal faded.\n\nChina is willing to further expand the scale of Sino-U.S. agricultural trade and deepen cooperation between the two countries in the agriculture sector, Han said, according to the report.", "description": "China did not cancel planned visits to farms in the United States because of challenges in trade negotiations with the U.S., the country's senior agricultural representative in the talks said, according to a report by state-backed media group Yicai on Sunday, who added the talks last week achieved a \"good outcome.\"", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-23"}