{"pub": "yahoo", "url": "https://yahoo.com/gma/trump-turkey-going-syria-not-problem-152551265--abc-news-topstories.html", "downloaded_at": "2019-10-17 11:39:25.152159+00:00", "title": "Trump on Turkey going into Syria: 'It's not our border'", "language": "en", "text": "Trump on Turkey going into Syria: 'It's not our border' originally appeared on abcnews.go.com\n\nCorrection: This story has been updated to reflect that President Trump, when asked whether he was OK with Turkey’s president refusing a ceasefire, responded, \"It’s not our border.\"\n\nPresident Donald Trump on Wednesday again tried to distance himself and the U.S. from the unfolding fighting and humanitarian crisis in northeastern Syria, telling reporters in the Oval Office, \"It's not our border.\"\n\nAsked at a White House photo op with Italy's president, \"Are you OK -- are you OK with Erdoğan saying that he is not going to do a ceasefire?\" -- referring to Turkey's President Recep Tayyip Erdogan's response to U.S. efforts to broker a stop to the conflict -- Trump, after a lengthy discourse about why the U.S. should not be involved in the fighting, then said, \"So, if Russia wants to get involved with the -- with Syria, that's really up to them. They have a problem with Turkey, they have a problem at a border. It's not our border. We shouldn't be losing lives over it.\"\n\nThe comment comes amid a torrent of criticism, including among Republicans, of Trump's decision to pull back U.S. troops ahead of a Turkish operation against U.S.-backed Syrian Kurdish forces and now to withdraw nearly all American forces from the war-torn country.\n\nInstead, Trump has called for a ceasefire and peace settlement, dispatching Vice President Mike Pence, Secretary of State Mike Pompeo and National Security Adviser Robert O'Brien to Ankara to meet Turkish officials.\n\nBut Erdogan made clear again Wednesday he has no interest in \"sitting at a table with a terrorist organization... We're not looking for a mediator or anything, we don't need it,\" he told Turkish Parliament in a speech.\n\n(MORE: Vice President Mike Pence to head delegation to Turkey for ceasefire talks )\n\nErdogan declined to meet with O'Brien, who arrived Wednesday in Ankara and met with Turkey's foreign minister. On Thursday, Erdogan will meet with Pence and Pompeo, who depart from Washington Wednesday, according to Erdogan's communications director.\n\nDespite Erdogan's comments, Trump denied that Erdogan didn't want a ceasefire, saying while seated next to Italian President Sergio Mattarella, \"We're trying to get Turkey to do the right thing. We want to get wars stopped.\"\n\nTurkey launched an offensive against the Syrian Kurdish forces that the U.S. armed and fought alongside against ISIS, but that Turkey considers a terrorist organization. U.S. officials have denied that the administration has abandoned those Kurdish forces, saying the decision to move troops was \"tactical\" -- or what Trump called \"strategically brilliant\" Wednesday.\n\nWhile a senior administration official told reporters Tuesday that the U.S. still supports Syrian Kurdish forces and does not consider them terrorists, Trump badmouthed them Wednesday, saying, \"They're not angels.\"\n\n(MORE: What you need to know about who’s fighting in Syria and what the US withdrawal means)\n\n\"It is time for us to go home,\" the president said. While Russian and Syrian forces loyal to dictator Bashar al Assad moved into towns and bases once held by U.S. troops, Trump dismissed concern over it: \"If Russia wants to get involved in Syria, that's really up to them.\"\n\n\"I view the situation on the Turkish border with Syria to be, for the United States, strategically brilliant,\" President Trump says amid bipartisan criticism of his administration's decision to withdraw U.S. troops https://t.co/G5REIbltay pic.twitter.com/G12ktXO4SX — ABC News Politics (@ABCPolitics) October 16, 2019\n\nAt a later news conference, Trump again defended his decision to abruptly withdraw U.S. military forces from northeastern Syria, insisting he wasn't surprised and didn’t give Turkey \"a green light\" to launch a military operation, calling a reporter's suggestion he did \"so deceptive.\"\n\n\"When you make a statement like that, it's so deceptive. Just the opposite of a green light,\" Trump said. \"First of all, we had virtually no soldiers there. They were mostly gone, just a tiny little group. They would have been in harm's way. You have a massive army on the other side of the border. I didn't give them a green light. And If anybody saw the letter, and i can certainly release it, I wrote a letter right after that conversation, a very powerful letter. They've been fighting for many, many years. When you ask a question like that, it's very deceptive.\"\n\nStory continues", "description": "Asked at a White House photo op with Italy's president, \"Are you OK -- are you OK with Erdoğan saying that he is not going to do a ceasefire?\" -- referring to Turkey's President Recep Tayyip Erdogan's response to U.S. efforts to broker a stop to the conflict -- Trump, after a lengthy", "authors": ["John Parkinson", "Mariam Khan", "Conor Finnegan"], "top_image": "https://s.yimg.com/uu/api/res/1.2/na7yfN2n.3pdqj7obyN05Q--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.gma.com/trump-oval-01-rt-jt-191016_hpMain_16x9_992.jpg", "published_at": "2019-10-16"}