{"pub": "politico", "url": "https://politico.eu/article/dont-help-boris-johnson-put-lipstick-on-his-brexit-pig", "downloaded_at": "2019-10-16 08:29:01.283436+00:00", "title": "Don’t help Boris Johnson put lipstick on his Brexit pig", "language": "en", "text": "LONDON — European Union leaders must not help Boris Johnson push a Brexit deal through the British parliament if they are able to reach an agreement with the U.K. prime minister later this week. Doing so would deny British citizens a democratic say in one of the most consequential decisions in their lifetimes.\n\nShould the two sides come to an agreement, there will be great temptation to try to get Brexit done by conniving with the prime minster to present parliament with a binary choice between a deal and a painful, cataclysmic exit without one. Should European leaders do that, they will be accomplices in a historic error.\n\nThe tide in the U.K. has long turned on Brexit. Support in parliament has been building for a second referendum, allowing British voters to decide whether to accept whatever deal Johnson has agreed to or simply cancel Brexit altogether. And it’s likely they would choose the latter.\n\nThe trouble is that the U.K. is currently scheduled to quit the bloc at the end of the month. To hold a “people’s vote,” Johnson would have to ask the EU to delay Brexit and the other leaders will have to agree.\n\nThe prime minister is desperate to avoid asking for extra time. But if he can’t get a deal through parliament by Saturday, he will be required by law to do so.\n\nIt’s not the other leaders’ job to rub Johnson’s nose in his failure to negotiate what he pledged to deliver. That’s the task of British politicians.\n\nHis best chance of avoiding this outcome will be to get the EU to help him strong-arm MPs into approving an agreement. His plan for doing that is to persuade other European leaders to imply — or even state — that they will not grant another delay even if the U.K. asks for it.\n\nThat would make the alternative to his deal a chaotic exit from the EU, leading parliament to meekly vote through an agreement it knows is against the national interest for fear of something even worse.\n\nEurope’s other leaders should do Johnson’s dirty work. Of course, they are exhausted by Brexit and are wrestling with their own domestic troubles — not to mention international problems such as Syria and the climate crisis. But they should remember that Brexit will make those problems worse, not better.\n\nIf the U.K. stays in the EU, it can play a big role in tackling these global issues. After all, it has Europe’s strongest military force alongside France and one of its largest economies. The EU will be more powerful in the difficult decades if the U.K. remains at its heart.\n\nThe Brexit process has already been bedeviled with too many lies and misinformation.\n\nWhat’s more, driving MPs onto a no-deal cliff edge in order to get them to accept a miserable deal would sow seeds of resentment. For years to come, pro-Europeans in the U.K. would feel they had been betrayed by their friends across the English Channel and the Irish Sea. That would not lead to good relations.\n\nThe other leaders should also resist another temptation: helping Johnson put lipstick on his deal. The prime minister himself will, of course, say he has achieved his goals when he will actually have made more U-turns than a whirling dervish. But the EU shouldn’t pretend his deal is different from what it really is.\n\nThe likely landing zone will be close to the so-called “Northern Ireland only backstop” Johnson once railed against. To get a deal, he is having to accept that Northern Ireland will follow EU rules on goods, and agree to perform customs checks and collect tariffs on the EU’s behalf when goods leave Great Britain and cross the Irish Sea.\n\nIt’s not the other leaders’ job to rub Johnson’s nose in his failure to negotiate what he pledged to deliver. That’s the task of British politicians. But it’s also not the EU’s business to make the prime minister look like a hero.\n\nSimilarly, the other European leaders shouldn’t put make-up on the “political declaration” that will accompany a new withdrawal agreement. Johnson says he wants to abandon the “level playing field” agreements designed to ensure fair competition across Europe. If he sticks to that, the EU shouldn’t pretend that the U.K. will eventually get a deep free trade agreement when it knows it won’t be prepared to give one.\n\nA core EU value is democracy. But dishonesty corrupts democracy. The Brexit process has already been bedeviled with too many lies and misinformation. The EU should not taint itself by adding to what Johnson, in another context, once called the \"pyramid of piffle.\"\n\nBy all means, EU leaders should cut a deal that is in the bloc’s interests. But they should then let the British parliament and people decide whether they want it.\n\nHugo Dixon is deputy chair of the People’s Vote campaign.", "description": "EU leaders must not conspire with the UK prime minister to force MPs into a corner.", "authors": ["Hugo Dixon", "Cristina Gallardo", "David M. Herszenhorn"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/08/GettyImages-1164153361-1200x628.jpg", "published_at": "2019-10-16"}