{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/23/utah-poll-mitt-romney-mike-lee-underwater-with-negative-approval-ratings", "downloaded_at": "2019-10-24 02:30:38.469652+00:00", "title": "UT Poll: Mitt Romney, Mike Lee Underwater w", "language": "en", "text": "Utah Republican Senators Mitt Romney and Mike Lee are both underwater with negative approval ratings with state voters, according to a recently-released Y2 Analytics poll for UtahPolicy.com.\n\nFifty-one percent of Utahns strongly or somewhat disapprove of Romney, one of Congress’s staunchest critics of President Donald Trump, while 46% said they approve. Four percent of respondents said they are unsure of the freshman senator’s job performance.\n\nLee, who in recent months has championed bill S.286 — which would eliminate “country caps” which effectively limit the number of Indian workers imported into the U.S. for skilled white-collar labor — is more unpopular than Romney among Utah voters, according to the poll. The survey shows 43 percent of state voters approve — 20 percent strongly, 23 percent somewhat — of his performance, while 47% said they disapprove. 11 percent said they don’t know.\n\nThe poll, which surveyed 979 registered Utah voters, was conducted between September 25th to October 8th, concluding four days before Romney criticized President Trump for suggesting China and Ukraine should look into allegations of corruption against former Vice President and 2020 White House hopeful Joe Biden and his son, Hunter Biden. Several weeks later, Romney would face public embarrassment as reporters discovered a social media account under the pseudonym “Pierre Delecto” where the senator “lurked” and occasionally attacked his critics.\n\n“I think these are low approval ratings for Utah’s top members of Congress,” UtahPolicy.com publisher LaVarr Webb said of the results. “It’s just a really difficult time we live in. Congress reflects the divisiveness, so when asked whether we approve or disapprove of someone’s performance, I think that’s reflected in that as well.”", "description": "Utah Republican Senators Mitt Romney and Mike Lee are both underwater with negative approval ratings with state voters, according to a poll.", "authors": ["Joshua Caplan"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-1142602740-640x335.jpg", "published_at": "2019-10-23"}