{"pub": "cbs", "url": "https://cbsnews.com/news/iowa-and-new-hampshire-wont-cancel-2020-gop-primaries", "downloaded_at": "2019-09-11 13:48:59.995854+00:00", "title": "Iowa and New Hampshire won't cancel 2020 GOP primaries", "language": "en", "text": "Republicans in Iowa and New Hampshire are vowing to hold a caucus and primary next year, even as party leaders in a handful of other states have canceled their contests to help smooth President Donald Trump's path to reelection.\n\n\"Under no circumstances will the New Hampshire primary ever be canceled, whether there's token opposition or a serious contest,\" Steve Duprey, New Hampshire's national Republican committeeman, said in an interview.\n\n\"It was never even up for discussion,\" echoed Iowa GOP National Committeeman Steve Scheffler in a separate interview. \"We're not going to shut the door on anyone and say, 'You're not welcome.'\"\n\nAt least three Republicans have stepped up to challenge Mr. Trump's claim to his party's 2020 presidential nomination: former Massachusetts Gov. Bill Weld, former South Carolina Governor and congressman Mark Sanford and former Illinois congressman Joe Walsh. None of them is expected to generate enough support to defeat - or even embarrass - the incumbent president in the months leading up to the November 2020 general election.\n\nStill, Trump allies on the ground in South Carolina, Nevada, Arizona and Kansas moved in recent days to cancel their 2020 primary contests altogether to eliminate the possibility of trouble.\n\nThe Republican parties in South Carolina and Nevada announced Saturday that they would not be holding their presidential nominating contests in 2020, and all Republican delegates will be committed to President Trump. They join the Kansas Republican Party, which confirmed on Friday that it will not hold its caucuses in 2020.\n\nStates have until October to submit their delegate selection rules to the Republican National Committee, and several more state Republican parties could vote to cancel their nominating contests before the deadline.\n\nCanceling primaries is not unprecedented, but it is not common. Republicans and Democrats canceled presidential nominating contests to protect incumbents across 10 or fewer states in 1992, 1996, 2004 and 2012.\n\nIn many cases, the state party has to pay to hold its primaries or caucuses. So if there is an incumbent with considerable support, then the party is inclined not to incur the costs of putting on an expensive primary. According to a Nevada GOP spokesperson, the state party would save nearly $150,000 if it cancels the caucuses for the 2020 cycle.\n\nChairwoman Ronna McDaniel told CBS News last week that the Republican National Committee does not dictate whether the state parties should hold nominating contests. That decision is left to the states. However, Mr. Trump's re-election campaign has dispatched its delegate staff to many of the GOP state conventions where they have observed chair elections and advised on delegate selection rules.\n\nLongtime Iowa Republican operative David Kochel, a frequent Trump critic, said he doesn't ascribe \"a sinister motive\" to the recently announced cancellations. It's often a political party's job to help incumbents win reelection, he said.\n\n\"It does lend itself to the whole sinister anti-democratic thing,\" Kochel added. \"I don't think it's quite that simple.\"\n\nWhile polls suggest the overwhelming majority of Republican voters support Trump, some veteran GOP officials were troubled by the decisions to cancel elections altogether, dismissing the cost-cutting motive as spin.\n\n\"This was a shady backroom deal where a small group of party insiders made a big decision that stops hundreds of thousands of voters from participating in the process,\" said South Carolina Republican operative Rob Godfrey, who previously worked for the state GOP and former Gov. Nikki Haley.\n\nChip Felkel, another veteran South Carolina Republican operative, cried foul as well.\n\n\"What's the RNC and the Trump campaign afraid of?\" asked Felkel, who worked for Jeb Bush's 2016 presidential bid. \"This to me, no matter how they spin it, suggests there's weakness they don't want to reveal.\"\n\nAt least one New Hampshire Republican official went further.\n\nFergus Cullen, a former state GOP chairman, said the push to cancel primaries represent the \"drip drip drip of autocratic tendencies in the Trump administration.\"\n\n\"This is the kind of thing that happens in autocratic nations led by dictators,\" Cullen said. \"One way to ensure that the president of Russia gets 98% of the vote is you don't allow anyone else on the ballot.\"\n\nThe Trump campaign has essentially ignored the prospect of a serious primary challenge when asked. The incumbent president is not expected to accept invitations for traditional primary activities, such as debates.\n\nCampaign spokesman Tim Murtaugh would say only that \"President Trump's election is in November 2020.\"\n\nMr. Trump himself, however, has already given his trio of challengers a derogatory nickname. \"The Three Stooges, all badly failed candidates, will give it a go!\" the president tweeted over the weekend after Walsh and Sanford formally joined Weld in the Republican field.\n\nBoth Walsh and Sanford have begun reaching out to potential supporters in New Hampshire, the state that has emerged as the unofficial staging ground of the GOP's \"Never Trump\" movement. Former state party chair Jennifer Horn has become a fierce Trump critic, as have several former Republican officeholders in the state.\n\nCullen said that primary contest cancellations elsewhere mean that \"New Hampshire is the only game in town\" for a real Trump challenge.\n\n\"If anything, this means that the place to send a message is New Hampshire,\" Cullen said. \"It already was, but now there's literally no other options.\"\n\nEven in the Granite State, however, Mr. Trump is expected to easily beat back primary challengers. And the bar may be high even for those Republicans hoping to embarrass Mr. Trump by denying him a significant portion of the vote.\n\nPresident Barack Obama, for example, won New Hampshire's 2012 presidential primary with only around 81% of the vote.\n\nStill, New Hampshire Republicans will at least get a chance to be heard. The first-in-the-nation primary can only be canceled by changing state law.\n\nNew Hampshire GOP Chairman Stephen Stepanek, who ran the Trump campaign's New Hampshire efforts in 2016, said he could \"never conceive of the New Hampshire primary ever being canceled for any reason.\"\n\nThe level of enthusiasm for Mr. Trump among New Hampshire Republicans \"is just overwhelming,\" he said. He also predicted that Trump will get \"well into the 90s\" in the state's 2020 GOP primary.\n\n\"I think they're going to be very excited to vote for him just to show their support for him,\" Stepanek said.\n\nEleanor Watson contributed to this report.", "description": "Trump allies on the ground in South Carolina, Nevada, Arizona and Kansas moved to cancel the 2020 primary contests", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/08/25/28050552-0626-4328-8324-81ed40bde732/thumbnail/1200x630g2/a6faef1faf930aaf30e0938a97457988/ap-106354923333.jpg", "published_at": "2019-09-11"}