{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-6614883/Scientists-way-bring-shattered-ruined-ancient-artefacts-life-AI.html", "downloaded_at": "2019-10-05 06:36:58.419526+00:00", "title": "Scientists find a way to bring shattered and ruined ancient artefacts back to life with AI", "language": "en", "text": "Shattered remains of once majestic works of art can now be digitally recreated and restored to their former glory thanks to a team of archaeologists.\n\nResearchers have built an AI-powered algorithm that predicts what should surround a surviving archaeological fragment and locates its neighbouring piece.\n\nA virtual image is then produced which aids in the meticulous physical reconstruction of the item.\n\nScroll down for video\n\nFragile remnants of the past often resurface in scattered pieces and full restoration is a time consuming and arduous process. They are often not 'clean' and 'nicely behaved'; rather they are broken, eroded, noisy and ultimately extremely challenging\n\nArchaeologists at Technion and the University of Haifa in Israel say this programme could save endless hours in the restoration of historical items.\n\nTrials with the technology were conducted on pieces of ancient statues and Byzantine frescoes from Cyprus.\n\n'Puzzle solving has been an intriguing problem for many years,' the researchers write in their paper, pre-published on arXiv.\n\n'It has numerous application areas, such as in shredded documents, image editing, biology and archaeology.'\n\nFragile remnants of the past often resurface in scattered pieces and full restoration is a time consuming and arduous process.\n\n'Archaeological artefacts are not \"clean\" and \"nicely behaved\"; rather they are broken, eroded, noisy and ultimately extremely challenging to algorithms that analyse or reassemble them,' the researchers say in their paper.\n\nThree major issues archaeologists face when working to rebuild artefacts are abrasion, colour fading and continuity.\n\nResearchers have built an AI-powered algorithm that predicts what should surround a surviving archaeological fragment and locates its neighbouring piece. A virtual image is then produced which aids in the meticulous physical reconstruction of the item (pictured)\n\nHOW DOES AI DIGITALLY RECREATE FRAGMENTS OF ANCIENT ART? 1. Fragment extrapolation The programme takes a picture of fragments and extrapolates each fragment. This produces a band around it, which predicts not only the eroded region, but also the continuation to the next fragment. Colours and the structure are extrapolated in most cases. Researchers say: 'It is interesting to note that despite of the imperfect extrapolation of, our algorithm manages to solve the relevant puzzle flawlessly. 2. Sampling a set of valid transformations This quality control step ensures the 'transformed fragments' resemble each other but do not overlap. Testing every single transformation is not feasible so the programme samples it uniformly. 3. Finding good matches Researchers generates a dissimilarity score for a given transformation between a pair of fragments Two difficulties arise when attempting to match edges. These are imprecise transformations and spurious edges that should be ignored. 4. Placement After the previous steps the programme then adds one adjacent piece at a time to create a visualisation of the end result.\n\nTrials with the technology were conducted on pieces of ancient statues and Byzantine frescoes from Cyprus. It allowed the puzzles to be solved with greater ease\n\nThe process of the AI generated reconstructions (pictured). Fragments are imaged and inputted before the programme extrapolated what the edges would show. Images are then transformed before being placed individually next to its adjacent pieces\n\nAbrasion creates gaps between pieces and makes neighbouring pieces hard to find.\n\nColour fading makes distinguishing between real and false edges hard to decipher and the irregular nature of the fragments gives an almost infinite amount of possibilities.\n\nMike Heyworth, director of the Council for British Archaeology, told The Times: 'In the analysis of excavated material it is often time-consuming and laborious to match fragments of artefacts such as ceramic vessels which go together and can help to add to our understanding of the finds and their context.'\n\nThe algorithm created by the academics used creases in the clothing of figures to project what the next pieces should look like.", "description": "Archaeologists developed a programme to save endless hours in the restoration of historical items. Trials were conducted on Byzantine art from Cyprus.", "authors": ["Joe Pinkstone For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/01/21/12/8791552-0-image-a-60_1548072947690.jpg", "published_at": "2019-01-21"}