{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/2019/10/02/how-raise-an-optimistic-human-pessimistic-world", "downloaded_at": "2019-10-03 07:26:44.464074+00:00", "published_at": "2019-10-02", "title": "How to raise an optimistic human in a pessimistic world", "language": "en", "text": "But don’t give up. Even though media and technology seem to be the cause of our collective pessimism, they’re also essential for overcoming it, by either using them wisely or knowing when to put them away. Here are six ways to help kids find the silver lining in every cloud.\n\nPut things in perspective. When tragedy strikes somewhere in the world, we relive it every time we turn on the TV, open our social media, check our phone notifications or walk by a supermarket newsstand trumpeting a sensationalistic headline. Parents understand that the media amplifies things for eyeballs and clicks. But kids don’t necessarily get the relationships among sources, sponsors and audience. How you respond to news makes a difference in how kids process it. Help your kids put things in perspective by explaining that the loudest voices capture the most listeners. When you “right-size” things, it lessens kids’ fears and restores hope.\n\nAD\n\nAD\n\nTalk about what you’re grateful for. Counter defeatist attitudes by nurturing your kid’s character. Strong character grounds kids when the world feels chaotic. Take the time to share what you’re grateful for. Encourage children to persevere against obstacles and to have compassion for others. Research shows that expressing gratitude actually makes people happier. Try these character-building movies to kick off the conversation.\n\nFight fake news. A lot of kids say they can’t tell the difference between what’s real and fake online. Confusion, doubt, lack of trust — these things get in the way of being optimistic. But kids have the tools to fight fake news. They can use online fact-checking tools to discover the truth (or at least uncover the fraud). They can refuse to contribute to the spread of false information by not sharing stuff they can’t verify. And they can call out dubious claims when they see them. Taking fact-checking into your own hands is empowering.\n\nStand up to cyberbullies. Teach your child that the buck stops with them. When they see someone getting bullied — and it happens all the time in texts, on social media and in online games — they shouldn’t just stand by. While they should never do anything that would endanger themselves, they can do a lot to assert their support of others. They can call out cyberbullies, report them, stand up for the victim, or just privately message the victim and tell them someone cares. It’s not tattling. It’s truly everyone’s responsibility to keep the Internet a positive, productive place. Standing up to cyberbullies shows you believe you can make a change.\n\nAD\n\nAD\n\nStamp out hate speech. Online anonymity can have some unintended consequences. For example, people think they can spew hateful language or share insulting images without fear of being discovered. That may be true, but hate speech is not a victimless offense. While institutions are beginning to punish those who spread abusive material, no one should wait until that happens. Hate speech hurts people, contributes to an overall negative environment and is sometimes a cry for help from someone in crisis. Explain how to handle hate speech: Don’t respond to it, block people who do it, report offenders and don’t share it. If your child can influence only one person to knock off the negative stuff, then that person will influence someone else, and they’ll influence someone else, and so on.\n\nTune out the world for a while. Grab your kids, grab your spouse if you have one, and shut everything else down. If they’re all there with you, you won’t miss anything. Simply being together, whether it’s to read, have a device-free dinner or talk about an issue, recharges you and sends your kids the message that family time takes precedence over everything else. Experts recommend this kind of self-care because the buildup of bad news can be overwhelming and even debilitating. And if that’s how adults feel, imagine how kids are reacting to the constant barrage. By managing your media and reclaiming your family time, you show your kids what’s really important.\n\nCaroline Knorr is Common Sense Media’s parenting editor. This piece first ran at Common Sense Media, a nonprofit organization that aims to help kids and parents navigate the world of media and technology.\n\nAD", "description": "Parents need to show kids that the tools for a positive outlook are well within their reach.", "authors": ["Caroline Knorr"], "top_image": "https://www.washingtonpost.com/resizer/JtC3etm3m6Pm8dMvPgg8lu0OG7Q=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VFB74HHDUEI6TMFGHUBXEG4F54.jpg"}