{"pub": "mirror", "url": "https://mirror.co.uk/travel/news/worlds-longest-dreamliner-flight-touches-20666306", "downloaded_at": "2019-10-21 15:00:26.981824+00:00", "title": "World's longest Dreamliner flight touches down after nearly 20 hours in the air", "language": "en", "text": "Get the biggest Weekly Travel stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThe world's longest ever Dreamliner flight broke records this week as it touched down after nearly 20 hours in the air.\n\nThe Qantas flight, a test for future routes, was the longest direct route between New York and Sydney, with the journey taking 19 hours and 16 minutes from take-off to landing.\n\nHowever, it still hasn't picked up the accolade for the world's longest commercial flight.\n\nThat trophy still belongs to Qantas though, as the airline ran a commercial flight in 1989 direct between London and Sydney, which was in the air for 20 hours and 9 minutes.\n\n(The good news for passengers is that UK flights to Australia could take just four hours soon thanks to a brand new engine).\n\nStill, the Qantas flight from New York to Sydney makes for a pretty impressive feat, not only because it was the world's first commercial flight direct between the two destinations.\n\nThe airline re-purposed a Boeing 787-9 Dreamliner for the flight, which had a total of 49 passengers and crew on board, including four pilots who operated the service.\n\n(Image: Getty Images for Qantas)\n\nCaptain Sean Golding, who led the four pilots operating the service, said: \"The flight went really smoothly. Headwinds picked up overnight, which slowed us down to start with, but that was part of our scenario planning.\n\n\"Given how long we were airborne, we were able to keep optimising the flight path to make the best of the conditions.\n\n(Image: Getty Images for Qantas)\n\n\"We had a lot of interest from air traffic controllers as we crossed through different airspace because of the uniqueness of this flight. We also had a special sign off and welcome home from the control towers in New York and Sydney, which you don’t get every day.\n\n\"Overall, we’re really happy with how the flight went and it’s great have some of the data we need to help assess turning this into a regular service.\"\n\n(Image: Getty Images for Qantas)\n\nAviation enthusiasts will need to wait a while before they can buy tickets for the route though.\n\nThe flight was a test for 'Project Sunrise', the airline's venture to operate regular, direct commercial flights from Australia's eastern coast to London and New York.\n\n(Image: Getty Images for Qantas)\n\nIn fact, there are two more research flights planned; London to Sydney in November, and New York to Sydney in December.\n\nAt this stage there's no confirmation whether Qantas will go ahead with the services, although the airline has said it expects to make a decision by the end of the year, when the research flights are complete.\n\nThe tests will also include on board research to test ways of 'improving wellbeing on ultra long-haul flights' - although if you have a long flight planned soon, then you might want to check out our top tips for long-haul including easy ways to make the journey that little bit more comfortable.", "description": "Qantas broke records with the world's longest Dreamliner flight this week which touched down after nearly 20 hours in the air", "authors": ["Julie Delahaye", "Image", "Getty Images For Qantas"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20666486.ece/ALTERNATES/s1200/0_Qantas-Set-For-World-First-Commercial-Airline-Non-Stop-Flight-From-New-York-To-Sydney.jpg", "published_at": "2019-10-21"}