{"pub": "wsj", "url": "https://wsj.com/articles/flee-as-fast-as-you-can-a-young-couple-joins-venezuelas-exodus-11570028330?mod=rsswn", "downloaded_at": "2019-10-02 15:32:55.385527+00:00", "published_at": "2019-10-02", "title": "‘Flee as Fast as You Can.’ A Young Couple Joins Venezuela’s Exodus.", "language": "en", "text": "Jonathan Morales and Daliana Loyo on the bus to the Colombian border.\n\nCARACAS, Venezuela—Jonathan Morales and Daliana Loyo were ready to leave. Mr. Morales, a 26-year-old chef, had hidden his life savings of $150 inside the waistband of his underwear. Ms. Loyo, a 23-year-old nurse, had a grilled eggplant for the trip, packed up by her grandmother. All they carried was two backpacks and a borrowed suitcase.\n\nTwo dozen members of their families had already abandoned Venezuela. Their remaining relatives—only the very old, who could no longer travel—came to see them off that June day. They took group photos and cracked jokes to ease their sadness.\n\nVisas to Chile in hand, the young couple took their seats on a bus to the Colombian border. Many of their fellow passengers, who also hoped to leave for good, were traveling without documents. A 22-hour ride stretched in front of them.\n\nMinutes after the bus departed, a man stood up, saying he was from the transportation company. He warned everyone that soldiers tend to board along the route and extort riders. He urged riders to scatter their money and valuables inside their clothes and luggage. He advised some to pretend to be mute.\n\nMs. Loyo greets Mr. Morales outside the Chilean consulate. Mr. Morales's brother, who now lives in Chile, had suggested they apply for visas. To prepare for their trip, the couple shopped for cellphone batteries at a Caracas mall. Mr. Morales hid his money in the waistband of his underwear the day before leaving.\n\nMs. Loyo greets Mr. Morales outside the Chilean consulate.\n\nMr. Morales’s brother, who now lives in Chile, had suggested they apply for visas.\n\nMr. Morales hid his money in the waistband of his underwear the day before leaving.\n\nMigrants are a frequent target of soldiers, and his job was to guide passengers to border crossings and help with paperwork—which could attract unwanted attention.\n\n“If any soldiers get on board,” he said, “you don’t know me. They’ll throw me into jail.”\n\nAmid political turmoil, violence, food shortages and a disintegrating economy, more than 4 million Venezuelans have left their country. It is the largest migration crisis in modern Latin American history.\n\nLeaving is difficult, especially as nearby countries have tightened up migration policies. Some Venezuelans take illegal paths, paying off gangs at the border. Soldiers might rob them of the little clothes and money they carry. Travelers with visas can get extorted as well.\n\nMost of those who leave have little money for food and housing. Finding work is difficult. Xenophobia generated by the mass migration has spawned bouts of vigilante justice in Brazil, Peru and elsewhere after locals accused Venezuelans of crimes or of taking local jobs.\n\nMr. Morales and Ms. Loyo made getting out a priority after they started dating three years ago. They were both working as nurses for a health clinic in eastern Caracas, where they helped save the lives of gunshot victims, heart-attack patients and protesters left bloodied by authoritarian President Nicolás Maduro’s shock troops during antigovernment demonstrations.\n\nStruggling to survive on salaries that could barely pay for a pound of cheese each month, they came to the conclusion that there was no future in Venezuela.\n\n“My grandparents used to tell me, ‘Don’t go,’ ” said Ms. Loyo. “Now they say, ‘Flee as fast as you can.’ ”\n\nThe day before the bus trip, Mr. Morales went to the cemetery with a rag and a bottle of soapy water and washed the headstone over the grave of his teenage brother, Jhonny, who had been shot dead by gangsters four years ago.\n\nHe swept away fallen leaves with a worn-out broom and laid down a fistful of marigolds. A short walk away, he tidied the graves of two cousins, both victims of police shootings. Looters had smashed headstones and broken into nearby graves looking for valuables and the human bones used in Santeria religious rituals.\n\n“Everything around me just screams: Get out of here!” he said.\n\nMr. Morales with his mother at the cemetery where his brother and cousins are buried.\n\nFalling apart\n\nMr. Morales had lived his whole life in a gritty barrio of western Caracas called Caricuao. He followed the advice of his mother, Nanci León, a nurse who told him to study hard and, as she did, get a public-sector job for stability.\n\nThe joy of graduating from nursing school was overshadowed by the murders of Jhonny and his two cousins, all in 2015. The oil-rich country had once been one of the region’s wealthiest, but the economy was quickly falling apart.\n\nMs. Loyo was raised by her grandparents, Rufino and Daria Loyo, on a farm just east of Caracas after being abandoned by her mother as a child. They grew their own eggplants, passion fruit and plantains, which helped shield them from food shortages.\n\nVenezuela’s troubles hit Mr. Morales and Ms. Loyo at their first job. The clinic’s emergency room lacked basic medical supplies, so nurses had to pay for their own first-aid kits.\n\nMs. Loyo spent more on transportation to get to work than she could earn, the equivalent of a few U.S. dollars a month. She barely lasted half a year.\n\nMr. Morales worked through the deadly demonstrations that roiled the Chacao district in 2017. Mr. Morales calls his work as a medic, plucking out buckshots from the bodies of demonstrators, “my contribution to the country.”\n\nBy year’s end, both began new jobs as home-care nurses for elderly patients in a wealthy part of town. Even there the pay was paltry. Mr. Morales decided to use his little savings to take a culinary course, which got him a job at a cafeteria. The job included lunch, which helped resolve the daily concern of how to get enough to eat.\n\nIn June 2018, the couple applied for work visas in Chile at the recommendation of Mr. Morales’ older brother, Jeimison, who had emigrated to Santiago.\n\nMs. Loyo and her grandmother.\n\nRufino Loyo sold fruit to neighbors to help raise money for his granddaughter’s travel expenses.\n\nEach morning for 10 months, Mr. Morales would log onto the Chilean embassy website and check for confirmation their applications were in process, refreshing the page throughout the day. That became challenging as rolling blackouts hit Caricuao, where he shared a cramped apartment with his mother. Their home didn’t have water for much of the past two years, so they collected runoff water in buckets from a nearby factory.\n\nIn January, the U.S. and dozens of countries declared that the legitimate leader of Venezuela was opposition leader Juan Guaidó, and not Mr. Maduro, whose authoritarian regime has overseen the economic collapse. Mr. Morales, haunted by the bloodied protesters he had treated, questioned whether protests would really trigger change.\n\n“What’s the point?” he said. “So I can end up dead like so many others?”\n\nPolls by the Caracas firm Datanalisis show that nearly two-thirds of Venezuelans want to leave the country, and 95% expect living conditions to deteriorate.\n\nMr. Morales and Ms. Loyo began mapping out an eight-day journey by bus and foot to get to Chile without papers, as many family members had done.\n\nEarlier this year, Ms. Loyo had a serious stomach virus. Her treatment cost $50, erasing months of income. “We need to be reborn,” she said.\n\nIn April, Mr. Morales got an email from the Chilean embassy: Their visa application had been approved. Their elation was tempered by the fact that they had no money to pay for the trip. That’s where Peggy Christian, 58, a Venezuelan exile in Denver, came in.\n\nThe couple near Mr. Morales's house.\n\nHelp from abroad\n\nMs. Christian had worked with Mr. Morales caring for a hospice patient in Caracas before she fled to the U.S. on a visa two years ago. She’s among the 43,000 medical personnel—nurses, doctors and hospital technicians—that advocacy groups say have left Venezuela.\n\nMs. Christian had kept in touch with Mr. Morales from the U.S. When he told her about his ordeal, she offered them a loan to pay for the trip to Santiago.\n\n“What’s happening to these youths in Venezuela is the fault of my generation,” she said. “We never thought things would get this bad.”\n\nMs. Christian said she sets aside some of her savings to help former colleagues, even as she deals with her own challenges in the U.S. Unable to obtain certified copies of her university diploma from Venezuela, she hasn’t been able to work as a nurse in the U.S. Instead, she works as a nurse’s assistant, which pays half as much.\n\nMr. Morales’s farewell party.\n\nPhotos of Mr. Morales’s brother Jhonny and two cousins, who were killed in 2015.\n\nNor have things gone well for the seven others whose exits Ms. Christian helped finance. Only one has found a job as a nurse.\n\n“It breaks my heart every day,” Ms. Christian said.\n\nMs. Christian spent $800 to help Mr. Morales and Ms. Loyo travel, purchasing bus tickets to the border of Colombia and then flights to Bogotá; Lima, Peru; and finally Santiago.\n\nMost friends had also left Venezuela, so Mr. Morales’ farewell party was attended by only two of his college classmates.\n\n“I feel like the last violinist on the Titanic,” he said at the gathering.\n\nThe journey\n\nA tense calm fell over the bus after the transportation company worker told passengers to hide their money.\n\nA woman next to Mr. Morales read the Bible’s Book of Exodus. Others tried to sleep, only to be awakened by drips of water leaking from the ceiling or the cockroaches that infested the bus.\n\nMs. Loyo hugs relatives as she's about to leave Venezuela. Mr. Morales and Ms. Loyo board the bus. Friends and family wave goodbye to passengers. Ms. Loyo washes her face on a stop along the bus route. The road to Colombia.\n\nMs. Loyo hugs relatives as she’s about to leave Venezuela.\n\nMr. Morales and Ms. Loyo board the bus.\n\nMs. Loyo cries after saying goodbye to her family.\n\nThe vehicle was silent as it crossed the grassy plains of Venezuela’s heartland. With power scarce, the pitch black of the night was interrupted only by the trash-can fires that National Guard troops huddled around. Holding assault rifles, and at times wearing ski masks, they occasionally flagged down buses for random checks.\n\nAfter about 12 hours, an officer at a checkpoint boarded the bus. Most passengers kept their heads down to avoid attracting attention. The officer inspected national ID cards—and left.\n\nPassengers looked around with smiles as they realized no one had been dragged off. Out of the two dozen checkpoints they passed, it was the only time soldiers boarded the bus.\n\nMore officers awaited the travelers at the border. The next day, the bus dropped off the group a few streets from the Simón Bolívar International Bridge, connecting Venezuela and Colombia. Some 5,000 Venezuelans cross on foot every day, with National Guard soldiers stopping some at random.\n\nMr. Morales and Ms. Loyo quickly walked across. As they stepped onto Colombian territory, a look of relief crossed Ms. Loyo’s face, despite the weight of her oversize backpack.\n\nThe couple crossing the Simón Bolívar International Bridge.\n\nAt the border.\n\nCúcuta, with a population of 750,000, has long been a commerce hub, but many of the Venezuelans who cross over no longer go back. The city has been the main entry point for the 1.4 million who now reside in Colombia.\n\nVenezuelans who have packed their lives into suitcases sit in the city’s central park, Santander Square, with dazed looks, often with no plans on how to begin anew. Scores of young Venezuelan sex workers sell their bodies on the street after dark. Many migrants simply start walking, taking days to reach the next city.\n\nMr. Morales and Ms. Loyo visited Mr. Morales’s former neighbor and fellow nurse, Darwin Vásquez, in Cúcuta. He left Caracas two years ago after being robbed of his motorcycle at gunpoint. Now he works as a truck driver and struggles to support his teenage son as well as his family back in Venezuela. He also rents out a room to Venezuelan travelers.\n\nEscape from Venezuela The couple's planned route included a bus ride to the Colombian border, then three flights to Chile. Bus Caracas Airplane VENEZULA Cucuta Bogota Atlantic Ocean COLOMBIA ECUADOR PERU BRAZIL Lima BOLIVIA Pacific Ocean PAR. Venezuelan population abroad URU. Santiago ARGENTINA Colombia 1,408,055 CHILE Peru 853,429 Ecuador 330,414 Chile 288,233 Brazil 168,357 500 miles Argentina 145,000 500 km Bus Caracas Airplane VENEZULA Cucuta Bogota Atlantic Ocean COLOMBIA ECUADOR PERU BRAZIL Lima BOLIVIA Pacific Ocean PAR. Venezuelan population abroad URU. Santiago ARGENTINA Colombia 1,408,055 CHILE Peru 853,429 Ecuador 330,414 Chile 288,233 Brazil 168,357 500 miles Argentina 145,000 500 km Bus Caracas Airplane VENEZULA Cucuta Bogota Atlantic Ocean COLOMBIA ECUADOR PERU BRAZIL Lima BOLIVIA Pacific Ocean PAR. Venezuelan population abroad URU. Santiago ARGENTINA Colombia 1,408,055 CHILE Peru 853,429 Ecuador 330,414 Chile 288,233 Brazil 168,357 500 miles Argentina 145,000 500 km Bus Caracas VENEZULA Airplane Cucuta Bogota COLOMBIA ECUADOR PERU BRAZIL Lima BOLIVIA Pacific Ocean PAR. URU. Santiago ARG. CHILE Atlantic Ocean 500 miles 500 km Venezuelan population abroad Colombia 1,408,055 Peru 853,429 Ecuador 330,414 Chile 288,233 Brazil 168,357 Argentina 145,000\n\n“It’s been a rough awakening,” Mr. Vásquez said, pointing to his ripped jeans and the soles coming off his shoes. Without a nurse’s license, he can’t work in his profession. He provides free advice to neighbors who can’t afford medical care.\n\nMr. Morales and Ms. Loyo found the bustle of Cúcuta a dramatic improvement from Caracas, which shuts down at night because of crime and rolling blackouts. They watched as people calmly strolled the sidewalks and teams of Rollerbladers glided on a public track after dark. They noticed that drivers actually obeyed traffic signals. In Caracas, carjackers target drivers who have stopped at red lights.\n\nMs. Loyo called home: “Grandma, you’re not going to believe what I’m seeing.”\n\nThe couple in Cúcuta. Mr. Morales's friend Darwin Vásquez gave the couple a room to stay in during their visit. On a layover in Bogota, Mr. Morales and his cousin Glyznel Jiménez talk to their grandmother on the phone. Ms. Jiménez and her daughter. Ms. Loyo and Mr. Morales have more than 20 close relatives who have left Venezuela in recent years.\n\nThe couple in Cúcuta.\n\nMr. Morales’s friend Darwin Vásquez gave the couple a room to stay in during their visit.\n\nOn a layover in Bogota, Mr. Morales and his cousin Glyznel Jiménez talk to their grandmother on the phone.\n\nA new beginning\n\nTwo nights later, Mr. Morales and Ms. Loyo took their first-ever flight, to Bogotá. There, they took advantage of a six-hour layover to visit Mr. Morales’s cousin Glyznel Jiménez, a chemist struggling to get by with a job scaling fish.\n\nMs. Jiménez and her husband had walked to the Colombian border with their 6-year-old daughter on a dirt path earlier this year. They then paid a fee to a gang that controls the illegal routes that lead into Colombia—about $1.50 each. They are considering trying their luck in another South American country.\n\nShare your thoughts What lies ahead for Venezuela’s migrants? Join the discussion below.\n\nThe Brookings Institution estimates the number of Venezuelan migrants could double to 8 million in the next two years, far more than the 6 million who fled war-ravaged Syria. Per capita, Venezuelan migrants have seen less than 2% of the international aid that has been committed for Syrian refugees.\n\nWhile the mass inflow has strained developing nations across Latin America, many of those arriving are trained professionals, new consumers and young workers who could propel growth, said Paula Andrea Rossiasco, a World Bank migration specialist.\n\nA recent study by the bank estimated that it had cost the Venezuelan state $3 billion in educational investments to train the hundreds of thousands of working-age adults now in Peru, where Ms. Rossiasco is based.\n\nA poll earlier this year in Peru found 34% of Venezuelans there were working jobs that required no training. Just 8% had worked unskilled jobs before leaving Venezuela.\n\nThe couple at Lima’s airport, where they spent one night.\n\nIn the airport.\n\nAfter their visit with Ms. Jiménez, Mr. Morales and Ms. Loyo caught the plane for Lima. There, they slept on the floor of the airport, clutching their luggage, before their next flight. On the flight to Santiago the next day, they glimpsed the snow-capped Andes—a staggering sign that they were far from their tropical homeland.\n\nWhen they got to the tiny, 21st-story apartment where Mr. Morales’s brother lives with his family, no one was home. Jeimison Morales was starting his first day manning the fry station at Kentucky Fried Chicken. His wife was working her seven-day-a-week sales gig at a print shop.\n\nMs. Loyo at the window of the apartment where she now lives.\n\nThe improvised bedroom set aside for Mr. Morales and Ms. Loyo had just enough room for a twin bed. It didn’t matter.\n\n“I think this is when the good part begins,” Ms. Loyo said, dancing a jig in the kitchen as Mr. Morales cooked up a broccoli risotto. The simple ingredients needed for the dish would have taken weeks of work to buy in Venezuela, he said.\n\nOn their first few nights in their new home, friends and cousins from Caricuao gave them a walking tour. With debts to pay to Ms. Christian, and hoping to send money home to their families, Mr. Morales and Ms. Loyo were soon knocking on doors and filling out applications at restaurants and shoe stores.\n\nTheir new neighborhood features Venezuelan barbershops and bodegas. The distinct Caribbean-infused accents from Venezuela are never far in Chile, where 300,000 Venezuelans now live.\n\nFriends offered advice on bundling up to protect themselves from the Southern Hemisphere winter.\n\n“I’m not too worried,” Mr. Morales said. “If I get cold, I’ll just think of Maduro.”\n\nMs. Loyo, Mr. Morales and his brother Jeimison on their first walk around the couple’s new neighborhood.\n\nWrite to Kejal Vyas at kejal.vyas@wsj.com", "description": "Jonathan Morales and Daliana Loyo planned for years to follow the flood of family members out of their country, amid political turmoil and a disintegrating economy. They found how hard it is to leave.", "authors": ["Kejal Vyas", "Photographs Oscar B. Castillo For The Wall Street Journal", "Kejal.Vyas Wsj.Com"], "top_image": "https://images.wsj.net/im-109530/social"}