{"pub": "yahoo", "url": "https://sports.yahoo.com/medvedev-advances-first-grand-slam-final-us-open-233338707--ten.html", "downloaded_at": "2019-09-07 02:21:20.825833+00:00", "title": "Medvedev advances to first Grand Slam final at US Open", "language": "en", "text": "Russia's Daniil Medvedev celebrates defeating Bulgaria's Grigor Dimitrov on Friday at the US Open to reach his first Grand Slam final Russia's Daniil Medvedev celebrates defeating Bulgaria's Grigor Dimitrov on Friday at the US Open to reach his first Grand Slam final (AFP Photo/Don EMMERT)\n\nNew York (AFP) - Russian fifth seed Daniil Medvedev advanced to his first Grand Slam final on Friday by defeating Bulgaria's 78th-ranked Grigor Dimitrov 7-6 (7/5), 6-4, 6-3 at the US Open.\n\nMedvedev will play in Sunday's championship match at Arthur Ashe Stadium against the winner of a later semi-final between Italian 24th seed Matteo Berrettini and 18-time Grand Slam champion Rafael Nadal.\n\n\"Finally I'm here after three sets,\" Medvedev said. \"I'm just happy to be in the final.\"\n\nScroll to continue with content Ad\n\nIf second-seeded Nadal can capture his fourth US Open crown on Sunday, he would move one shy of matching Roger Federer's all-time men's record for Grand Slam titles.\n\nThe 33-year-old Spaniard would also draw to within one of the Open-era record of five US Open titles shared by Roger Federer, Pete Sampras and Jimmy Connors.\n\nNadal beat Medvedev in last month's Montreal final in their only meeting, then skipped Cincinnati, where Medvedev won the title.\n\nMedvedev, now 20-2 in the four North American events, beat Berrettini last year at Indian Wells in their only matchup.\n\n\"When I was going to USA, I didn't know it was going to be this good,\" Medvedev said. \"So I have to say I love USA.\"\n\nMedvedev is the first Russian in a Grand Slam final since Marat Safin won the 2005 Australian Open title and the first Russian to reach the US Open final since Safin won the 2000 crown.\n\nAt 23, Medvedev is just the third men's Grand Slam finalist born in the 1990s after Canada's Milos Raonic and Austria's Dominic Thiem. He could become the first '90s-born Slam winner.\n\nMedvedev is only the third Open Era player to reach finals in Washington, Canada, Cincinnati and the US Open in the same year after Ivan Lendl in 1982 and Andre Agassi in 1995.\n\nStory continues\n\nDimitrov, who lost seven of his eight matches just prior to arriving at Flushing Meadows, would have been the lowest-ranked US Open men's finalist since the rankings began in 1973.\n\n\"Good match overall. I think it was just a few points here and there,\" Dimitrov said. \"Yeah, three sets to love, but the score for me doesn't justify the match itself. I think it was a good level. Overall he played really well, fought hard, a lot of the key points he played well. So I don't want to be too down on myself.\"\n\nThe Bulgarian was the lowest-ranked Slam semi-finalist in 11 years and the lowest at the US Open since 174th-ranked Connors in 1991.\n\nUS Open fans gave solid applause to Medvedev. They had booed Medvedev in the third and fourth rounds after he flashed an obscene gesture and later taunted them, saying he thrived on their jeers for the energy to win. He later apologized.\n\nMedvedev took the tie-break after Dimitrov won after Dimitrov netted a forehand and sent another long on the last two points.\n\nThey exchanged breaks to open the second set and again in the fourth and fifth games but Dimitrov netted a backhand to surrender a break and the set in the 10th game.\n\nMedvedev broke for a 3-1 lead in the third set and held to the finish, which came on a service winner after two hours and 38 minutes.\n\n- Nadal in 33rd Slam semi -\n\nNadal will face first-time Slam semi-finalist Berrettini in the Spaniard's 33rd career major semi-final and eighth at the US Open. It's also Nadal's seventh consecutive Grand Slam semi-final.\n\nNadal, who won his 12th French Open title in June, seeks his 27th Slam final, four shy of Federer's record, and second US Open final in three years after retiring with a knee injury in last year's semi-finals.\n\nNadal, who has dropped only one set at Flushing Meadows this fortnight, chases his fourth title of the year.\n\nBerrettini, the first Italian man in the US Open semi-finals since Corrado Barazzutti in 1977, is trying to follow the footsteps of the only Italian men's Slam winner -- Adriano Panatta at the 1976 French Open.\n\nAt 23, Berrettini is the youngest US Open men's semi-finalist since Novak Djokovic in 2010.", "description": "Russian fifth seed Daniil Medvedev advanced to his first Grand Slam final on Friday by defeating Bulgaria's 78th-ranked Grigor Dimitrov 7-6 (7/5), 6-4, 6-3 at the US Open.  Medvedev will play in Sunday's championship match at Arthur Ashe Stadium against the winner of a later semi-final between", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/LMr14otGY85zmwyiGjL8nw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05MjA-/https://s.yimg.com/uu/api/res/1.2/OiDQEe1M7JLDXEKnsrHU7g--~B/aD01NTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/32d6b53ca976d5d788b23d531c15c2e14d0b903f.jpg", "published_at": "2019-09-07"}