{"pub": "msnbc", "url": "https://msnbc.com/rachel-maddow-show/trump-scraps-newspaper-subscriptions-appreciates-fawning-tweets", "downloaded_at": "2019-10-25 00:44:28.426601+00:00", "title": "Trump scraps newspaper subscriptions, but appreciates fawning tweets", "language": "en", "text": "Donald Trump told Fox News this week that the New York Times is a “fake newspaper” that he no longer wants in the White House. The president added on Tuesday, “We’re going to probably terminate that and the Washington Post. They’re fake.”\n\nEvidently, the Republican was referring to the White House’s print subscriptions, not journalists from the news outlets themselves. And while Trump’s declarations routinely generate no follow-though, it appears that in this instance, it’s quite real: the Washington Post and the New York Times will no longer be delivered daily to the White House.\n\nThat, in and of itself, is an extraordinary example of Trump’s pettiness, but it caught my eye because it coincides with a report on the sort of things the president is actually prepared to read.\n\nFox Nation host Tomi Lahren on Wednesday shared a printout of positive tweets about President Trump, including one of her own praising his recent rally in Dallas, that Trump himself signed with a personal note. “Tomi, thank you for everything, best wishes,” Trump’s note to the conservative commentator reads, along with his signature. She in turn thanked Trump for the note. The tweet from Lahren included in the printout praised his rally in Texas last week.\n\nLooking at the tweet, Tomi Lahren’s complimentary post was one of several that had been pulled together for the president, showing online Republican praise for Trump’s recent rally in Texas. Without exception, each of the tweets (a) was written by a supporter of the president; and (b) told Trump how great he was.\n\nIn the case of the Fox Nation host, the president sent Lahren a signed copy of the tweet collection to thank her for her support.\n\nOr put another way, Trump doesn’t want to see print editions of the nation’s most important newspapers, but he does want to see a list of people saying nice things about one of his pep rallies on Twitter.\n\nIt’s worth noting for context that in every modern White House, aides prepare clippings for the sitting president, which are intended to offer a look at how various stories are playing out in the media. Ideally, these collections should be representative of a larger whole, featuring examples of positive and negative coverage.\n\nBut in Donald Trump’s White House, there’s reason to believe things work a little differently. There have been reports, for example, noting that Trump receives a daily folder “filled with screenshots of positive cable news chyrons (those lower-third headlines and crawls), admiring tweets, transcripts of fawning TV interviews, praise-filled news stories, and sometimes just pictures of Trump on TV looking powerful.”\n\nA sheet featuring fawning tweets about his campaign event in Dallas is obviously consistent with this broader practice.\n\nStepping back, is it any wonder Trump is convinced that the polls are wrong and independent news organizations are “fake”? He’s convinced of his broad popularity in part because of the materials his team puts in front of him.", "description": "Trump doesn't want to see print editions of the nation's most important newspapers, but he does want to see a list of people tweeting nice things about him.", "authors": [], "top_image": "http://www.msnbc.com/sites/msnbc/files/styles/ratio--1_91-1--1200x630/public/gettyimages-518048510.jpg?itok=oynLVDa0", "published_at": "2019-10-24"}