{"pub": "yahoo", "url": "https://yahoo.com/gma/dont-deserve-florida-commissioner-ambushes-deputy-month-015504691--abc-news-topstories.html", "downloaded_at": "2019-09-30 04:04:41.219028+00:00", "title": "'You don't deserve to be here': Florida commissioner ambushes deputy of the month", "language": "en", "text": "'You don't deserve to be here': Florida commissioner ambushes deputy of the month originally appeared on abcnews.go.com\n\nA Florida city commissioner shocked his colleagues during an awards ceremony for outstanding officers last week when he claimed one of the honorees was a \"bad police officer\" who had falsely arrested him years earlier.\n\nThe surprise moment came after other city officials in Tamarac, Florida, honored Broward Sheriff's Office Deputy Joshua Gallardo with the deputy of the month award for his role in arresting an alleged gang member who had been wanted for murder.\n\nGallardo accepted his award, took pictures with the city's mayor and was heading back to his seat in when Tamarac City Commissioner Mike Gelin took the microphone and asked him to come back to the front, as seen on a video recording of the meeting.\n\n\"Joshua Gallardo, will you come down for a second? It's good to see you again,\" said Gelin, before erupting into a tirade over what he believed to have been a false arrest in 2015. \"You probably don't remember me, but you're the police officer who falsely arrested me four years ago.\"\n\n\"You lied on the police report. I believe you're a rogue police officer. You're a bad police officer, and you don't deserve to be here,\" he added.\n\nPHOTO: A Tamarac, Florida, commissioner used an awards ceremony to publicly berate a Broward Sheriff's Office deputy. (City of Tamarac) More\n\nGallardo smiled awkwardly as the commissioner berated him, and he even offered a thumbs up as he went back to his seat.\n\n(MORE: School resource officer fired after arresting 6-year-olds)\n\nTamarac Mayor Michelle Gomez and the other city officials looked on in astonishment.\n\n\"Completely shocked. This was not something we were expecting,\" Gomez told ABC Miami station WPLG. \"It was supposed to be a wonderful morning. We were giving the awards for the BSO deputies of the month. It was supposed to be a feel-good time.\"\n\nGallardo arrested Gelin, who was not an elected official at the time, for resisting arrest without violence in 2015, claiming he had refused to remain clear of a crime scene. The charges eventually were dropped.\n\n(MORE: White students allegedly pin down black girl, forcefully cut her 'nappy' dreadlocks)\n\n\"When I shared my video with the state attorney's office to prove that I did nothing wrong, they declined to file charges against me,\" Gelin told WPLG. \"I had a productive conversation with the sheriff yesterday and I will try to resolve things and move forward.\"\n\nOne video of the awkward encounter had nearly 80,000 views on Youtube as of Sunday, just three days after it was uploaded. The Broward Sheriff's Office Deputies Association called the commissioners comments insulting and asked anyone with business ties to him to \"reconsider.\"\n\n\"What should have been a proud moment for Deputy Galardo and the citizens of Tamarac,\" the police union wrote in a statement, \"was quickly extinguished by City Commissioner Mike Gelin.\"", "description": "A Florida city commissioner shocked his colleagues during an awards ceremony for outstanding officers last week when he claimed one of the honorees was a \"bad police officer\" who had falsely arrested him years earlier.  The surprise moment came after other city officials in Tamarac, Florida", "authors": ["Karma Allen"], "top_image": "https://s.yimg.com/uu/api/res/1.2/zjNoF4_KME7mgfWLP27gOw--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.go.com/FL_commissh_190929ka_hpMain_16x9_992.jpg", "published_at": "2019-09-30"}