{"pub": "dailybeast", "url": "https://thedailybeast.com/mcmaster-wants-to-save-the-iran-deal-by-hiding-it-from-trump", "downloaded_at": "2019-09-12 07:15:10.522194+00:00", "title": "McMaster Wants to Save the Iran Deal by Hiding It From Trump", "language": "en", "text": "In a meeting with Senate Democrats last week, President Donald Trump’s top national security aide had a message for those worried that the administration may scuttle the Iran nuclear deal: If Trump doesn’t have to see it, he won’t be able to kill it.\n\nThe point National Security Adviser H.R. McMaster conveyed, according to a congressional Democratic aide, was that “[Trump] wants this out of sight and out of mind.”\n\nMcMaster was more subtle and careful in his words when he hosted a group of roughly 12 lawmakers at the White House, conspicuously timed with the president out of town. But that was the impression he left, three sources familiar with the briefing tell The Daily Beast.\n\nUnder the terms of legislation passed around the negotiation of the Iran nuclear deal, the president is required every 90 days to determine whether Tehran is in compliance. The measure was designed to put President Barack Obama (and anticipated successor Hillary Clinton) in a bind—forcing politically-uncomfortable declarations in support of an unpopular nuclear accord on the regular. But in the age of Trump, the 90-day-deadline has presented an unanticipated problem.\n\n“Trump doesn’t want to have to be embarrassed every 90 days,” a Senate aide told The Daily Beast.\n\nTrump, aides say, has desperately wanted to announce that Iran is in violation of the deal, which puts caps on the country’s ability to produce fissile material and opens it up to stringent inspections in exchange for relief from international sanctions geared to impede the nuclear program. But the facts just won’t support it. Iran is living by the accord even as it's moving forward with its ballistic-missile program and shows no signs of backing off its support for terrorist groups and regional destabilization. Even Gen. Joseph Dunford—the chairman of the Joint Chiefs of Staff and, in theory, Trump’s top military adviser—recently admitted that “Iran is adhering to its [nuclear deal] obligations.”\n\nOn Iran, Trump Turns to … Sean Hannity?!\n\nTwo White House officials told The Daily Beast that Trump winces at having to twice certify that Iran is in compliance with the nuclear agreement, believing it shows weakness that he had to reluctantly do something he clearly did not see as “tough” on Iran. Trump has consulted both Fox News’ Sean Hannity and former UN Ambassador—and staunch neoconservative—John Bolton on the matter. And each has dinged him for certifying the deal while privately urging him not to do so, one official noted.\n\nAt the request of former White House chief strategist Steve Bannon, Bolton had drafted a plan for how Trump could back out of the Iran deal. But he was never able to formally present the document to the president after Bannon was ousted and John Kelly became chief of staff. While Bolton has not been able to visit the White House to advise the president lately, Trump still asks aides about Bolton, wondering where he is and what his advice would be on Iran, according to a person familiar with the situation.\n\n“ Trump has consulted both Fox News’ Sean Hannity and former UN Ambassador John Bolton on the Iran deal. ”\n\nWhite House spokespeople did not respond to requests for comment. Reached by phone, Bolton did not respond when asked if he has spoken with Trump since having his West Wing access curtailed.\n\nWith the next deadline approaching, Trump is expected to announce on Friday that Iran has not lived up to its end of the deal even though top generals have said that’s not true and his own national security and foreign policy team fret the fallout of the deal coming apart.\n\nEnter McMaster. The National Security Adviser has tried to find, what aides described as, a middle ground. In his meeting with Senate Democrats, he implied that it would not be a bad development if they didn’t re-introduce sanctions on Iran even after Trump said the nuclear deal had been violated. Multiple sources familiar with the briefing said that McMaster made a point of never explicitly saying this, for fear that it would leak to the press that he was undermining the president’s preferred policy.\n\n“Hell, I can write the Breitbart headline on that,” joked one of those sources.\n\nBut as he attempted to massage his boss’ decision to decertify the deal, McMaster also made a plea to end these pressure point moments entirely. Even if the deal is decertified, existing law requires this entire drama to replay every three months.\n\n“What he was also trying to tell us is that every 90 days this is going to be an issue if we don’t figure it out,” said the source. “His point is this is always a thing that I have to deal with.”\n\nJohn Kerry Re-Enlists\n\nMcMaster isn’t the only official working behind the scenes to manage the administration’s soon-to-be-announced Iran policy. So too has the Iran deal’s original author, former Secretary of State John Kerry.\n\nAt the invitation of Democratic leader Nancy Pelosi, Kerry took to Capitol Hill on Wednesday to urge House Democrats to hold the line on the Iran deal. He was flanked by the deal’s architects: Obama administration colleagues Ernest Moniz from Energy, Jack Lew from Treasury, State Department troubleshooter Wendy Sherman. Present as well was French ambassador Gerard Araud and British ambassador Kim Darroch, representing two allies and deal signatories who wish to ensure the Iran accord’s survival.\n\nAll emphasized the broad international consensus—from repeated International Atomic Energy Agency reports and elsewhere—that the deal is working. But Kerry also emphasized the second-order effects ripping up the Iran deal would have; mainly, complicating relationships with traditional allies who would no longer trust America to keep its commitments and making a diplomatic solution to North Korea’s nuclear crisis harder to procure. The presence of Sherman, a one-time negotiator with Pyongyang as well, underscored that message.\n\nKerry did not take an explicit position over passing non-nuclear sanctions, sometimes discussed as a measure to allow Trump to save face while keeping the deal, but he suggested that the rest of the world would not draw much of a distinction if it saw the U.S. moving back toward a policy based on hostile rhetoric backed up with sanctions.\n\n“He definitely underscored everything the U.S. does right now is gonna be held up to a different microscope because of the way Trump has treated the nuclear deal,” said a source close to Kerry.\n\nDespite the pressure to remain in the deal, however, Trump is poised to try and impair it while keeping it alive. His policy will effectively kick major decisions to Congress, which will have to weigh whether to “snap back” or even expand sanctions directly related to Iran’s nuclear program, apply alternative sanctions unrelated to the program, or do nothing at all.\n\nThe first option would mean the death of the Iran deal, potentially permitting Iran to place a wedge between the U.S. and its allies and blaming it—rightly—for the collapse of the accord, even as Iran restarts its nuclear program. But after Defense Secretary James Mattis testified that the Iran deal was in the U.S. national interest, that made this option “much less likely,” a Senate aide.\n\nThe second option runs similar risks at lower stakes. The final option keeps most of the current conditions intact but with added doses of uncertainty. In particular, lawmakers and foreign policy officials fear that Iran may claim that Trump has given them permission to scrap the deal themselves.\n\nEven removing the 90-day certification provision runs some risk, aides warn. While it may remove the need for Trump to have to weigh in, reluctantly and petulantly, on the overall accord, it too could be interpreted by Iran and others as a sign of bad faith.\n\n“There is concern that that nuance will be lost on the Europeans and frankly the Russians and the Chinese,” said the congressional Democratic aide. “Our fear is it will be used is a means to an end for certain people.”\n\n—with additional reporting by Andrew Desiderio", "description": "The president can’t kill what he can’t see. At least, that’s the logic being floated by his national security adviser.", "authors": ["Spencer Ackerman", "Asawin Suebsaeng", "Sam Stein", "Senior Nat L Security Correspondent", "White House Reporter", "Politics Editor"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1507852716/171012-swin-ackerman-stein-iran-nuclear-deal-hero_ndh6tk", "published_at": "2017-10-13"}