{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/12/jets-darnold-out-vs-browns-with-mono-could-miss-we", "downloaded_at": "2019-09-13 00:57:28.847323+00:00", "published_at": "2019-09-12", "title": "Jets' Darnold out vs. Browns with mono, could miss weeks", "language": "en", "text": "FLORHAM PARK, N.J. — Sam Darnold is sick and sidelined — likely for several weeks.\n\nNew York Jets coach Adam Gase announced Thursday the second-year quarterback has mononucleosis and will miss at least the team’s game against the Cleveland Browns on Monday night.\n\nTrevor Siemian will start in Darnold’s place, and could be the starter moving forward until Darnold recovers. The Jets have a game at New England in Week 3 before they have a bye-week break, and then games at Philadelphia, at home against Dallas and New England before a road game at Jacksonville on Oct. 27 to cap a rough opening stretch.\n\nWhen a reporter pointed out that mono usually take several weeks from which to heal, Gase nodded.\n\n“Oh, I’m aware,” Gase said. “Good thing we’ve got the early bye week.”\n\nDarnold was sent home by the team Wednesday with what Gase said was “strep throat or something.” Team doctors later told Gase that antibiotics weren’t working as quickly as expected, leading to the diagnosis.\n\n“He’s going through some of these tests to kind of see where he’s at with all this,” Gase said. “I know he’s out this week. Then, past that, I’ll have more information as we go.”\n\nGase said he, offensive coordinator Dowell Loggains and athletic trainer Dave Zuffelato went to Darnold’s home to deliver the news to the quarterback and he took it “not well,” according to the coach.\n\n“He wasn’t real happy about it,” Gase said. “All three of us went over there and he knew something was up when Dowell and myself showed up. I just wanted to make sure it was delivered right, and I figured I could be the bearer of bad news on this one.”\n\nThe coach says Darnold’s biggest concern is weight loss. Gase adds Darnold has already lost about 5 pounds.\n\n“That was something that was alarming to him, that he lost weight already in the last couple of days,” Gase said. “He can’t be in the building right now, so he’s like, ‘I need to get meals over here, I need to make sure that I’m getting enough of what I need to keep my weight.’ I mean, he went right into, all right, how do I maintain?”\n\nGase said Luke Falk will be promoted from the practice squad to serve as Siemian’s backup. The Jets could also look to sign an experienced quarterback for depth.\n\nBut, for now - and probably the next handful of games - it will be Siemian leading New York’s offense.\n\nSiemian was signed as a free agent in the offseason after spending last season with Minnesota. The 27-year-old quarterback played in Denver his first three NFL seasons, and is 13-11 as a starter. He has thrown 5,686 yards and 30 touchdowns with 24 interceptions.\n\nGase said the Jets‘ approach on offense won’t change much with Siemian taking over for Darnold.\n\n“That’s why Trevor’s here,” the coach said. “We signed Trevor specifically because he has 24 starts over his career with a winning record, has a lot of experience, has been on winning ballclubs. He has the respect of the locker room.\n\n“I think the reaction I got and the way that guys looked, it was like: ‘Let’s go.’ There was confidence there.”\n\nThe injury news wasn’t limited to Darnold.\n\nNearly overshadowed in the stunning news about the quarterback was Gase announcing that running back Le’Veon Bell would be among the players sitting out of practice because of a sore shoulder.\n\nBell was solid in his Jets debut last Sunday, his first game in nearly 20 months after sitting out in a contract dispute with Pittsburgh. But, there’s a chance Bell could also miss the game against the Browns. He was having an MRI later in the day.\n\n“I’m waiting to find out the extent of this,” Gase said. “This could be just soreness. We don’t think it’s anything worse than that, but we’re just kind of probably being a little extra cautious.”\n\nWide receiver Demaryius Thomas also sat out after joining the team Wednesday following a trade from New England. The Jets are hoping Thomas will be able to practice Saturday.\n\n“He’s had a hamstring (ailment) for a while,” Gase said. “We knew that. He’s close.”\n\nWhen asked if Thomas would have to practice Saturday to be able to play Monday night, Gase smiled.\n\n“That’s not true,” he said. “We’re running out of bodies.”\n\nLinebacker C.J. Mosley (groin) and defensive tackle Quinnen Williams (ankle) remained sidelined, and defensive lineman John Franklin-Myers (foot) sat out Thursday. One piece of good news for the Jets: safety Jamal Adams was back after sitting out Wednesday with soreness in his hip and back.\n\nGase said the team’s approach in adversity begins with him, as well as general manager Joe Douglas, owner Christopher Johnson and team president Hymie Elhai.\n\n“What’s our attitude going to be? Is it going to be woe is me? The sky is falling?” Gase said. “Or, is it, this is a challenge we’re going to embrace? And, guys just getting tighter in the locker room and everybody coming together and doing their job as well as they can to help us win.\n\n“I think we’re going to look back and this is going to be a good thing for us. I think it’s going to bring that locker room even tighter.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Sam Darnold is sick and sidelined - likely for several weeks.", "authors": ["The Washington Times Http", "Dennis Waszak Jr."], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/08/Bills_Jets_Football_61575.jpg-55c14_c0-206-4915-3071_s1770x1032.jpg?e89b5b4fc8bb685c248cdbde5b2658e90530c231"}