{"pub": "afr", "url": "https://afr.com/life-and-luxury/arts-and-culture/how-indigenous-thinking-can-save-the-world-20190804-p52dq5", "downloaded_at": "2019-10-11 02:26:57.806725+00:00", "title": "How Indigenous thinking can save the world", "language": "en", "text": "\"Meanwhile all these rugged individuals coming from all around the world and all around Australia, they were dying in droves.\" Individualism, I am learning, is one of his bugbears.\n\nThe photographer arrives. \"We're just going to take some photos,\" I tell the waiter in an offhand way. Yunkaporta, though, takes a different approach. \"Is it OK if she takes some photos?\" he asks politely. I feel rude, and realise I've just been guilty of one of the central sins of the moral universe depicted in Sand Talk: making myself \"greater than\".\n\n“If people aren’t able to organise in communities and groups, and they’re not able to support each other, it’s a lot easier to extract things from those communities and the lands they’re living on,\" Yunkaporta says. Arsineh Houspian\n\nHumans, Yunkaporta says, are forever fighting an egotistical impulse to be \"greater than\" something – each other, the land, the waiting staff – and this unchecked impulse is leading us to cultural and ecological disaster. \"Aboriginal culture was designed over thousands of years to deal with this problem,\" he writes. \"This behaviour needs massive checks and balances to contain the damage it can do.\"\n\nOne memorable part of the book takes the reader through five forms of Aboriginal knowledge: kinship-mind, which is knowledge through relationships; story-mind, which comes through narratives; dreaming-mind, which deals in metaphor; ancestor-mind, a transcendental way of thinking which he says is about \"connecting with a timeless state of mind or 'alpha wave state'\"; and pattern-mind, which is about finding patterns and trends and using them to make big picture predictions and find solutions to problems.\n\nHe contrasts these ways of thinking, which are oral and highly contextualised, with \"print-based cultures\", which he describes as \"low-context or field-independent reasoning cultures\". Aboriginal ways of thinking, he says, can help the modern decontextualised person find a grounding in his or her community and environment.\n\nAs I spoon more lashings of eggplant into my bowl, I tell him I agree that the modern Western way of thinking is radically decontextualised and individualistic. But why does that matter? The conversation quickly turns political.\n\n“It isolates everybody and it breaks down the complexity of the system,\" he says. \"There are short-term gains to be made economically by a few people from breaking society down into just individuals who are quite uniform and all speaking the same language.\n\n“If people aren’t able to organise in communities and groups, and they’re not able to support each other, it’s a lot easier to extract things from those communities and the lands they’re living on. It’s easier to frack in a rural community and destroy their water if those people are a series of individuals rather than a series of co-operatives that are all interlinked.\n\n“It’s a pretty widely known formula that social fragmentation is part of that project of neoliberalism. There’s a purpose to it, and it’s extractive.\"\n\nAdvertisement\n\nGiven Yunkaporta's concern for the environment, I'm surprised by his response when I ask him about what I think of as the ultimate environmental issue: climate change.\n\n“How’s that been working out?\" he says when I ask him about the effort to reduce greenhouse gas emissions. \"While we’ve been focused on that one thing and struggling over it, everything is dying. Half of the world’s species since I’ve been born; half of them gone.\"\n\nI go to places that I was at five years ago in the middle of nowhere, and they’ve changed so significantly, and are just dead. Dead places. — Tyson Junkaporta\n\n“But you have to start somewhere,\" I say.\n\n“Yeah, and I’m arguing we start with how we’re thinking and how we’re talking and interacting with each other. That’s a really good place to start.”\n\nYunkaporta's starting point – changing the way we think and interact – seems like a huge task, given the individualistic mindset is built into our modern economic and social institutions. But Yunkaporta thinks people can change, because the alternative is intolerable.\n\n“I don’t think everyone wants to die and for everything to end. Using the predictive process from my culture, the current world system, including the biological system, is going to fall apart. I don’t think people realise the runaway effects that are going on, and the exponential knock on effects. Horrendous things that are going on, the changes that I’m seeing every year in the seasons, in the imbalances, the total loss of...\" Here he stops and sighs.\n\n\"There’s a place in Cairns, that I remember from when I was 13 years old, in the rainforest, and you couldn’t hear the person speaking next to you because of the sound of the animals: the fruit bats, the birds. And a clear stream so full of fish that you could have just closed your eyes and thrown a rock in there and hit a fish. You could pull them out of the stream there were that many. It was thick, the water was thick with fish, the trees were thick with fruit.\n\n\"And exactly 20 years later, when I was 33, I went back to that same place and there was nothing. And this is in the untouched wilderness that all the tourists come and take photos of. Every now and then you’d hear a solitary bird call out. I searched all morning in that creek for a fish. Eventually I found one blind eel under a rock. People don’t see these things. They’re still doing tours through the rainforest to look at this untouched wilderness and I don’t think people quite understand these things unravel. People don’t realise the interconnectedness of things.\n\nAdvertisement\n\n\"Up north there’s a seasonal indicator of a tree that gets red flowers and when the red flowers come on that tree, the oysters are fat. And that’s the time to eat the oysters. That tree stopped flowering a few years ago. I don’t know why, it just doesn’t flower any more. And in that place the oysters don’t get fat. You can’t even eat them. They're tiny, useless, they’re not growing. I go to places that I was at five years ago in the middle of nowhere, and they’ve changed so significantly, and are just dead. Dead places.\"\n\n\"Everthing is dying\" is a mantra for Yunkaporta. It may sound dramatic, but he's pretty much in step with the world's scientific community on that front. A flick through the latest Intergovernmental Panel on Climate Change (IPCC) report on climate change and land has a similiar message. His solutions, though, may seem less in step with science. And at times the book will alienate some readers with what sound like superstitious remedies for ailments, such as treating a ruptured stomach ulcer by rubbing armpit sweat on the patient's face.\n\n\"In those stories there are ways of being that are really clearly described as the ways that you need to live in order to maintain a culture that can survive these things,\" Yunkaporta says. Arsineh Houspian\n\nBut the IPCC report itself makes frequent references to the importance of Indigenous knowledge. It says the following, for example: \"Agricultural practices that include indigenous and local knowledge can contribute to overcoming the combined challenges of climate change, food security, biodiversity conservation, and combating desertification and land degradation.\"\n\nYunkaporta says humans need to recover what he calls a \"wild ability to adapt and change with really hard circumstances\", and that, he says, is something Aborginal culture offers.\n\n\"We’ve been through a lot of apocalypses. We have them in all our stories. There’s volcanoes. There’s massive floods. There are meteorite impacts that cause massive destruction. All of these things are in our oral history,\" he says.\n\n\"And in those stories there are ways of being that are really clearly described as the ways that you need to live in order to maintain a culture that can survive these things. It’s worth looking at. And it’s not the stuff that’s on the surface. It’s not knowing how to make a boomerang. It’s not hunting kangaroos and playing a digeridoo. It’s not those cultural items. Culture is not what your hands touch, it’s what moves your hands.\"\n\nThe Bill\n\nSteamed Dim Sum, $8.50\n\nSpicy salt and pepper squid, $13.50\n\nSweet and sour pork, $23.80\n\nSautéed prawns and eggplant in fish chilli sauce, $30.40\n\nSteamed rice, $5\n\n2 Tsing Tao beer, $18\n\nTotal $99.20", "description": "Thinking like Australia's first nations people would change our view of some of our most intractable problems, says author and Deakin University academic Tyson Yunkaporta.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.1991%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_1%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/dd941b28550152789a0430b2f0ffe7471782e7ad", "published_at": "2019-08-04"}