{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/4/marianne-williamson-2020-candidates-proposes-using", "downloaded_at": "2019-09-04 23:48:12.352882+00:00", "published_at": "2019-09-04", "title": "2020 hopeful Williamson called for using 'power of the mind' to thwart Dorian landfall", "language": "en", "text": "Democratic presidential candidate Marianne Williamson on Wednesday proposed using the “power of the mind” against Hurricane Dorian as the storm neared the United States.\n\n“The Bahamas, Florida, Georgia and the Carolinas…may all be in our prayers now,” Ms. Williamson said on Twitter. “Millions of us seeing Dorian turn away from land is not a wacky idea; it is a creative use of the power of the mind. Two minutes of prayer, visualization, meditation for those in the way of the storm.”\n\nMs. Williams, a best-selling author and self-help guru, deleted the tweet after being mocked online before re-stating her sentiments differently.\n\n“Prayers for the people of the Bahamas, Florida, Georgia and the Carolinas. May the peace of God be upon them and their hearts be comforted as they endure the storm,” Ms. Williamson tweeted later.\n\nPatricia Ewing, a campaign spokeswoman for Ms. Williamson, said in a statement that the candidate’s since-deleted tweet was meant to be a metaphor, multiple outlets reported.\n\n“When others speak of prayer and the mind it’s considered profound, but Williamson is held to a different standard,” said the statement. “Because the comment led to confusion it was replaced.”\n\nMs. Williams doubled down later Wednesday afternoon from her personal Twitter account, meanwhile.\n\n“Prayer is a power of the mind, and it is neither bizarre nor unintelligent. People of faith belong in the Democratic Party, and will be necessary to the effort if we’re to win in 2020,” Ms. Williamson tweeted.\n\n“Millions of people today are praying that Dorian turn away from land, and treating those people with mockery or condescension because they believe it could help is part of how the overly secularized Left has lost lots of voters,” she tweeted.\n\nMs. Williamson, 67, is among 20 candidates who qualified to participate in the first two presidential primary debates organized by the Democratic National Committee in June and July; she failed to meet the requirements to compete in the third debate scheduled to take place in Texas on September 12, though she could still qualify to take place in the fourth debate recently set for Oct. 15.\n\nDorian touched down in the Bahamas over the weekend as a Category 5 storm before veering toward Florida in anticipation of moving up the East Coast.\n\nMs. Williamson has frequently discussed spirituality on the campaign trail and has previously called for a “moral and spiritual awakening” in order to “fundamentally change the patterns of our political dysfunction.”\n\nThe results of a poll released last week by Quinnipiac University found that roughly 1% of Democrats recently surveyed said that they would vote for Ms. Williamson over her fellow White House hopefuls. Former Vice President Joseph R. Biden leads the pack with 32%, followed by Sen. Elizabeth Warren, Massachusetts Democrat, and Sen. Bernie Sanders, Vermont independent, according to Quinnipiac.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Democratic presidential candidate Marianne Williamson on Wednesday proposed using the \"power of the mind\" against Hurricane Dorian as the storm neared the United States.", "authors": ["The Washington Times Http", "Andrew Blake"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/08/03/election_2020_nevada_90821_c0-200-4944-3082_s1770x1032.jpg?8428cc27bc4f926c87936691d17ea7f571831e88"}