{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/6/newt-gingrich-offers-impeachment-advice-trump", "downloaded_at": "2019-10-07 00:15:23.286243+00:00", "title": "Newt Gingrich's impeachment advice to Trump: Tame anger at Democrats, focus on accomplishments", "language": "en", "text": "NAGOYA, Japan — Former House Speaker Newt Gingrich, who led the last impeachment of a president, said President Trump can help himself by taming his frustration over the Democrats’ partisan inquiry and staying focused on highlighting his economic achievements for middle-class voters.\n\nMr. Gingrich points to the example of former President Bill Clinton, the man he helped impeach in 1998, as someone who successfully navigated that difficult path.\n\n“Go back and look at Clinton — he compartmentalized,” Mr. Gingrich said in an exclusive interview. “Clinton was very disciplined about saying, ‘I’m working on the American people’s problems, and I’m not going to talk about that [impeachment].’”\n\nMr. Gingrich, who has offered advice to Mr. Trump since House Democrats announced the formal impeachment inquiry, said the president “just needs to realize he doesn’t necessarily help his case when he stays on this topic.”\n\n“My advice would be to relax — understand, you’re going to lose [in the House],” Mr. Gingrich said. “I don’t worry at all about Trump getting convicted [in the Republican-majority Senate].”\n\nMr. Trump spent much of the weekend tweeting his criticism of what he calls the latest Democratic “witch hunt” — the impeachment inquiry focusing on his efforts to persuade Ukraine’s president to investigate Democratic presidential front-runner Joseph R. Biden. He also engaged in a feud with Sen. Mitt Romney, Utah Republican, who has criticized the president’s actions.\n\n“Not only are the Do Nothing Democrats interfering in the 2020 Election, but they are continuing to interfere in the 2016 Election. They must be stopped!” the president tweeted.\n\nThe former speaker sat down with The Washington Times to discuss impeachment during a leadership summit in Japan sponsored by the Universal Peace Federation, at which he delivered a keynote address. Mr. Gingrich said the president is understandably resentful of the impeachment inquiry after special counsel Robert Mueller’s long-running investigation found no collusion between Russia and the Trump campaign in 2016.\n\n“That’s one of the great dangers he faces,” he said. “First of all, he’s now been through three years of this. And it does wear on you. If you’re president, there does get to be a point where you wonder how are you supposed to cope with this.”\n\nBut he believes Mr. Trump will emerge in a stronger position to win reelection, and he views Sen. Elizabeth Warren, Massachusetts Democrat, as the president’s most likely opponent as Mr. Biden grapples with his own Ukraine controversy.\n\nMr. Gingrich said the impeachment effort has fired up the Republican base like nothing he has ever seen.\n\n“For the first time really in my lifetime, you have an aroused conservative base out there that wants a fight,” he said. “They are totally prepared to go to the mat. If you look at the initial [Republican] fundraising reaction, it seems to me that Trump’s base is reacting a lot stronger than [Democrats’] base. And I think that makes it much more dangerous for the Democrats.”\n\nMr. Trump’s reelection effort raised $45 million online in the third quarter, fueled by 313,000 first-time donors and a big spike in small-dollar donations. The online donations, part of an overall haul of $125 million by the Trump campaign and the Republican National Committee, rose 29% over the second quarter.\n\nAsked whether he believes Democrats will succeed in impeaching Mr. Trump, Mr. Gingrich replied, “Sure.”\n\n“Anytime you’re willing to commit suicide, you can get a lot done,” he said, adding that Speaker Nancy Pelosi is endangering Democrats in pro-Trump districts “who are going to lose their seats.”\n\n“Look at [Rep. Collin C.] Petersen in Minnesota — a 30-point Trump district,” he said. “It’s rural. It’s the kind of district where people just look at this stuff and think it’s all garbage.”\n\nMany Democrats consider the impeachment of Mr. Clinton more than 20 years ago as the same sort of partisan-motivated effort that Republicans say Mr. Trump now faces. Mr. Gingrich said the two cases have significant differences.\n\n“First of all, it’s not an impeachment,” he said of the investigation of Mr. Trump. “It’s a coup. There’s no characteristic comparable to impeachment.”\n\nMr. Clinton was impeached for lying under oath and obstruction of justice, charges that arose from a sexual harassment lawsuit filed by Paula Jones. The impeachment was preceded by independent counsel Kenneth W. Starr’s report to Congress, which substantiated allegations of perjury and obstruction.\n\n“Starr listed 11 things that he believes Clinton’s guilty of, each of which is impeachable,” Mr. Gingrich said. “So we were faced with a report from a reasonably competent person who uses the word ‘guilty.’”\n\nHe said Republicans during Mr. Clinton’s impeachment established procedural rules, including allowing subpoena power for the minority party.\n\n“Until [Democrats] actually vote for the process and they actually set up a set of rules, this is just a bunch of politicians on a witch hunt,” Mr. Gingrich said. “What they’re proposing on two levels is crazy. One is that the Congress can override executive privilege randomly on fishing expeditions. And the other is that any foreign government leader who speaks with an American president needs to be aware that whatever he or she says may be captured by the Democratic Congress. It’s about as deep a hit on national security as you can get.”\n\nSome Republicans who participated in Mr. Clinton’s impeachment now view it differently. Former Rep. Bob Inglis, a South Carolina Republican who helped draft the articles of impeachment and voted to impeach Mr. Clinton, said the accusations against Mr. Trump are more troubling. He said Mr. Trump’s alleged “quid pro quo” communications with Ukraine — the president was withholding military aid, a matter not discussed in the call — are more relevant to the operations of the executive branch.\n\n“The allegations against President Trump are really far more serious. They involve abuse of power, abuse of the office,” Mr. Inglis said Saturday on Fox News. “I think in retrospect it was a mistake to impeach Bill Clinton because the substance of the matter really wasn’t all that essential to the nation. In retrospect, I think it really didn’t go to the heart of the operation of the United States. What we’re dealing here with President Trump does go to the heart of American foreign policy and to the heart of the office. I think we [House Republicans] were sort of blinded by our dislike of President Clinton. In retrospect, I wish we hadn’t done it.”\n\nAlthough Mr. Clinton was impeached, the Senate failed to muster the necessary two-thirds majority to remove him from office, and he completed his second term.\n\nMr. Trump and his allies are targeting Rep. Adam B. Schiff, California Democrat and chairman of the House Permanent Select Committee on Intelligence, as the partisan leader of the impeachment probe. Many in Mr. Trump’s camp also believe they have nearly succeeded in mortally wounding the campaign of Mr. Biden over his alleged strong-arming of Ukraine’s leaders in 2016 to oust a prosecutor who had been investigating an energy company that paid his son Hunter $3 million.\n\n“I think it’s kind of helpful to have Biden disappear,” Mr. Gingrich said. “I think it increases the chaos on their side. If I were a moderate Democrat right now, I’d be really worried.”\n\nHe expects Ms. Warren to emerge as the party’s nominee next year and views it as a good outcome for Mr. Trump.\n\n“My expectation is that as long as the economy does reasonably well, that Trump will win,” he said. “And [if] the Democrats do what I think they’re going to do, which is nominate Warren, it could be like ‘72 — you could have a cataclysmic effect.”\n\nThat was the year President Nixon defeated Democrat George McGovern in a landslide, capturing every state but Massachusetts.\n\nBut two years later, facing certain impeachment and removal from office over the Watergate affair, Nixon resigned.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Former House Speaker Newt Gingrich, who led the last impeachment of a president, said President Trump can help himself by taming his frustration over the Democrats' partisan inquiry and staying focused on highlighting his economic achievements for middle-class voters.", "authors": ["The Washington Times Http", "Dave Boyer"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/02/12/trump_russia_probe_stone_gingrich_13840_c0-0-5760-3358_s1770x1032.jpg?afe9cc17b19a11f4c2bf27635956fedff5723f59", "published_at": "2019-10-06"}