{"pub": "yahoo", "url": "https://news.yahoo.com/number-people-killed-vaping-us-hits-26-202914404.html", "downloaded_at": "2019-10-11 20:07:06.966533+00:00", "title": "Number of people killed by vaping in US hits 26", "language": "en", "text": "The Centers for Disease Control and Prevention said that 26 deaths in 21 states had now been linked to vaping, along with 1,299 cases of injury.\n\nTwenty-six people have died from illnesses associated with e-cigarette use since March, US health authorities said Thursday, while some 1,300 have suffered lung injuries linked to vaping.\n\nOfficials have yet to identify the cause for the outbreak, which dates back to late March, and are pursuing multiple lines of investigation.\n\nThe Centers for Disease Control and Prevention said that 26 deaths in 21 states had now been linked to vaping, along with 1,299 cases of injury.\n\nAmong a group of 1,043 patients for whom there was data on sex and age, 70 percent were male while 80 percent were under 35.\n\nMore than three-quarters of those sickened used tetrahydrocannabinol (THC), the primary psychoactive substance of marijuana, with or without nicotine products.\n\nA report by clinicians in North Carolina last month pointed to the inhalation of fatty substances from aerosolized oils, but a new study by the Mayo Clinic published this week found patients' lungs had been exposed to noxious fumes.\n\nE-cigarettes have been available in the US since 2006, and it is not clear whether the outbreak is only happening now -- or if there were cases earlier that were wrongly diagnosed.\n\nInitially conceived as a smoking cessation device, e-cigarette use has skyrocketed among teens, with preliminary official data for 2019 showing more than a quarter of high school students using e-cigarettes in the past 30 days.\n\nThey were until recently perceived as a less harmful alternative to smoking because they do not contain the 7,000 chemicals in cigarettes, dozens of which are known to cause cancer.\n\nOnly one case of lung injury has been reported abroad, making the outbreak more mysterious still.", "description": "Twenty-six people have died from illnesses associated with e-cigarette use since March, US health authorities said Thursday, while some 1,300 have suffered lung injuries linked to vaping.  The Centers for Disease Control and Prevention said that 26 deaths in 21 states had now been linked to vaping, along", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/QrEDROrPk8ymWsuEA.Yk.g--~B/aD0xMDA1O3c9MTUxMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_US/News/US-AFPRelax/istock_00003422.0a2f6093141.original.jpg", "published_at": "2019-10-10"}