{"pub": "metro", "url": "https://metro.co.uk/2019/10/08/nick-jonas-joins-voice-following-departure-adam-levine-10880085", "downloaded_at": "2019-10-08 09:38:35.521270+00:00", "title": "Nick Jonas joins The Voice following departure of Adam Levine", "language": "en", "text": "Nick Jonas has joined The Voice (Picture: Roy Rochlin/Getty Images)\n\nNick Jonas has announced he’s joining The Voice US following the departure of Adam Levine.\n\nThe 27-year-old singer revealed the news on The Ellen DeGeneres Show on Monday (7 October), where he’ll join the show next year for The Voice season 18.\n\nMeredith Ahr, president of the alternative and reality group at NBC Entertainment said: ‘As a member of one of the hottest pop groups, Nick’s success in navigating all aspects of the music industry is exceptional.\n\n‘We were so impressed by his innate musicality, technical aptitude and passion that he brought to Songland earlier this year and know he will be an incredible fit as a coach on The Voice. We are excited to see Nick lend his mentorship, relatability and breadth of knowledge to a new crop of artists.’\n\nAdvertisement\n\nAdvertisement\n\nOn joining the show, Nick said: ‘I’m so excited to be a part of The Voice family. It’s such an awesome group of individuals, and I can’t wait to help these artists really build and hone in to find their unique voices.’\n\nNick is taking the spot left by Adam Levine’s exit earlier this year after sixteen seasons, with Gwen Stefani filling the void in season 17.\n\nHe’ll be joining John Legend, Kelly Clarkson, and Blake Shelton on The Voice US judging line-up, who all congratulated Nick in a special video on The Ellen DeGeneres Show.\n\nAdam Levine left The Voice in May this year (Picture: Trae Patton/NBC/NBCU Photo Bank via Getty Images)\n\nHis involvement is part of the comeback success of The Jonas Brothers this year, after the band topped the US charts with single Sucker and new album Happiness Begins.\n\nNick has been particularly prolific on the acting front too, having a role in the Jumanji sequel released later this year and starring opposite Daisy Ridley and Tom Holland in Chaos Walking out next year.\n\nThe Voice airs in the US on NBC.\n\nMORE: The Voice US’s John Legend shook as 14-year-old contestant blows judges away\n\nMORE: Taylor Swift returns to The Voice alongside John Legend and Blake Shelton", "description": "Nick Jonas has joined The Voice US as a coach on next year's show.", "authors": ["Adam Starkey"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1171063333_1570520739.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-08"}