{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/london-climate-protesters-defy-police-ban-191015160010632.html", "downloaded_at": "2019-10-15 23:10:56.929087+00:00", "title": "London climate protesters defy police ban", "language": "en", "text": "London, United Kingdom - Extinction Rebellion campaigners said they would challenge a protest ban imposed by police on Monday night, and pledged to continue their disruptive civil disobedience in the capital as planned.\n\nPolice issued the ban across London, from 9pm on Monday.\n\nLess than an hour later, officers moved to clear Trafalgar Square, where protesters had pitched tents at the start of last week, when the latest round of protests by the climate group began.\n\n\"After nine days of disruption we felt it is entirely proportionate and reasonable to impose this condition because of the cumulative impact of these protests,\" said Deputy Assistant Commissioner Laurence Taylor in a statement.\n\n\"This does not mean people are banned from protesting in London. The condition applies specifically to the Extinction Rebellion 'Autumn Uprising',\" the statement continued.\n\n\"If Extinction Rebellion, or any other group, come to us with a proposal for lawful protests then of course we will discuss that with them.\"\n\nThe protest group said it had already taken steps to challenge the decision, writing to London's Metropolitan Police arguing the ban was disproportionate, unlawful and should be removed. The police have, they say, yet to respond.\n\nTobias Garnett, of Extinction Rebellion's legal team, said the group would file a claim in London's High Court for a judicial review of the decision if their letter went unanswered.\n\n\"Criminalising anyone who wishes to protest in any way against the climate and ecological emergency in London is disproportionate and an unprecedented curtailment of the right to protest and the right to free speech and free assembly,\" Garnett told Al Jazeera.\n\nDefying the ban, activists on Tuesday afternoon gathered in front of the headquarters of MI5, the United Kingdom's domestic intelligence agency, for a protest aimed at drawing attention to the risks to food security posed by climate change.\n\nPolice officers carry away an activist as Extinction Rebellion protesters block the road outside MI5 headquarters [Toby Melville/Reuters]\n\nMore than a dozen police vehicles were parked on Millbank along the northern bank of the Thames as a couple of hundred activists blocked the road. Police slowly proceeded to remove a dozen of them who had glued or locked themselves to a caravan.\n\nActivists headed to the protest were being stopped and searched nearby.\n\n\"Everybody is just being peaceful. The amount of police is just over the top,\" Jane Niece, a 53-year-old radiographer who had come from Nottingham for the day, told Al Jazeera.\n\n\"I thought we were living in a free country. It's not free if we're not allowed to protest peacefully, to wear our badges. They will stop you, and people have been searched,\" she added.\n\nMore than 1,450 people have been arrested since the protests restarted eight days ago, according to police figures.\n\n191014170839758\n\nAmnesty International condemned the blanket ban on the climate group's protests as an \"unlawful restriction on the rights to freedom of expression and peaceful assembly\".\n\n\"The government has an obligation to facilitate the exercise of these rights,\" said Allan Hogarth, head of Advocacy and Programmes at Amnesty International UK.\n\n\"This is a heavy-handed and unacceptable move by the Metropolitan police,\" Amnesty's statement continued. \"Certain disruption to ordinary life for protesting is natural, and it needs to be tolerated. The police must respect the rights of those peacefully protesting.\"\n\nEarlier this year, Extinction Rebellion brought much of the capital to a standstill for two weeks, leading to the British Parliament declaring a climate emergency in a non-binding motion.\n\n\"The police have increased their pressure, they seem to be cracking down on protests more than they were in April,\" Jo Rogers, a spokesperson for the group, told Al Jazeera.\n\n\"We're definitely continuing with our plan for actions for the rest of the week.\"", "description": "More than 1,450 protesters have been arrested since Extinction Rebellion took to the streets eight days ago.", "authors": ["Ylenia Gostoli"], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/15/c87b6113e06041669d65202ba4d218df_18.jpg", "published_at": "2019-10-15"}