{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/16/WS5da60bb4a310cf3e35570a66.html", "downloaded_at": "2019-10-15 23:05:03.786659+00:00", "title": "Foreign banks, insurers given broader access", "language": "en", "text": "By Zhou Lanxu,Jiang Xueqing | China Daily | Updated: 2019-10-16 02:11\n\n[Photo/IC]\n\nGreater opening-up in financial sector expected to stimulate vitality of domestic institutions\n\nChina is further opening up its financial sectors to foreign investors by loosening regulatory requirements and lifting business restrictions on foreign banks and insurance companies.\n\nThe State Council announced the revision of regulations on foreign banks and insurers on Tuesday. China relaxed market access rules for foreign insurance companies, such as removing requirements that companies that apply to establish foreign-invested insurers in China have a track record in the business of over 30 years and have a representative office in the country longer than two years.\n\nThe government also liberalized requirements on stakeholders that plan to set up foreign-invested banks in China and requirements on foreign banks that plan branches in the country.\n\nOther revisions include allowing foreign banks to simultaneously set up branches as well as wholly foreign-owned banks — or branches and Sino-foreign joint venture banks — in China. Also allowed is expanding the business scope of foreign banks by lowering their branches' threshold of fixed-term renminbi deposits to 500,000 yuan from ­1 million (to $70,610 from $141,220) per deposit.\n\n\"Revisions of the banking and insurance regulations will attract more market participants in both sectors, stimulate market vitality, push Chinese and foreign-invested financial institutions to improve their competitiveness and benefit China in regard of learning from advanced international ideas and experience,\" Liu Fushou, chief lawyer of the China Banking and Insurance Regulatory Commission, said at a news conference on Tuesday.\n\nHe said the China Banking and Insurance Regulatory Commission will publish detailed implementation measures as soon as possible.\n\n\"The further opening-up of China and the establishment of a fair market environment will greatly help to promote full competition in the Chinese banking and insurance sectors, optimize the shareholding structure of related financial institutions, regulate shareholder behavior and form a rational and diversified market system,\" Liu said.\n\nThe new rules will provide more development room for smaller foreign banks, which have their own expertise in specialized areas, in China, he added.\n\nThe move received warm responses from international financial institutions. Jerry Zhang, executive vice-chairman and CEO of Standard Chartered Bank (China) Ltd, said: \"The new regulations will greatly relax requirements for foreign banks to enter the China market and expand the business scope of foreign banks. This is a huge inspiration to foreign banks, including Standard Chartered, and it will send a highly positive signal to global financial institutions and institutional investors.\"\n\nCG Lai, CEO of BNP Paribas China Ltd, said: \"The development is another positive step for China's financial market liberalization agenda. Foreign banks can continue to contribute to the overall development and deepening of China's market infrastructure and the expansion of global networks for clients, as well as a broader suite of products.\"\n\nA senior executive officer of Mizuho Bank (China) Ltd said in a written note that the policies \"will have positive effects on foreign banks in terms of their expansion of investments and business operations in China. It will provide opportunities … for better development of foreign banks in the country\".\n\nStatistics from the banking and insurance regulator show that the assets of foreign banks and foreign insurers in China accounted for 1.64 percent and 6.36 percent, respectively, of the total assets of the Chinese banking and insurance sectors.\n\nBy the end of the second quarter, foreign banks had set up 41 locally incorporated foreign-invested banks, 116 branches and 151 representative offices in China. Foreign insurers had established 59 locally incorporated foreign insurers and 131 representative offices in the country.\n\nContact the writers at jiangxueqing@chinadaily.com.cn", "description": "China is further opening up its financial sectors to foreign investors by loosening regulatory requirements and lifting business restrictions on foreign banks and insurance companies.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/16/5da63ad0a310cf3e97a15c36.jpeg", "published_at": "2019-10-15"}