{"pub": "businessinsider", "url": "https://businessinsider.co.za/average-salary-in-south-africa-2019-9", "downloaded_at": "2019-09-26 15:12:14.533338+00:00", "title": "This is the average monthly salary in SA - which can double if you work in the electricity sector", "language": "en", "text": "The average monthly earnings in South Africa rose to R21,432 at the end of May this year, according to new Statistics SA data.\n\nThis was 4.9% higher than a year earlier, which meant salaries barely kept up with inflation.\n\nBut workers in the electricity sector saw a large annual increase of 8.7%, and on average earned almost R44,000.\n\nFor more stories, go to www.BusinessInsider.co.za.\n\nThe average monthly earnings (including bonuses and overtime payments) of South African employees rose to R21,432 at the end of May this year – 4.9% higher than a year earlier, according to new Statistics SA data. The consumer inflation rate for May was 4.5%, which means that salary hikes just barely kept up.\n\n\n\nBut workers in the electricity industry saw a large annual increase of 8.7%, the Quarterly Employment Statistics survey showed. Contributing was Eskom’s agreement with unions last year to grant a 7.5% wage hike. The average monthly earnings in the electricity sector reached R43,487 in May - the highest of all the sectors surveyed.\n\nThis was the average monthly earnings in other industries:\n\nTransport, storage and communication: R25,538\n\nMining industry: R25,139\n\nFinancial sector: R24 036\n\nManufacturing: R18,798\n\nConstruction: R16,752\n\nTrade (wholesale, retail, hotels and restaurant workers): R14,266\n\nThe transport industry reported the largest increase of 6.7% in average monthly earnings in the second quarter compared with the first quarter of 2019.\n\nThe QES shows that in the second quarter of the year, almost 10.2m people were employed, 2 000 fewer than in the first quarter of the year – but 141 000 more than a year ago.\n\nIn the past quarter to end-June alone, 16 000 jobs were lost in the construction sector – there are now 30 000 fewer workers in the construction industry than a year ago. But community services (including civil servants, health workers as well as part-time workers for the elections this year) and the mining industry reported increases of 44 000 and 3 000 jobs respectively over the past quarter.\n\nReceive a daily email with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "Electricity workers saw a large annual increase of 8.7%, and on average earned almost R44,000.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8529/84f9dbd4f3454a2890ca6859ff8a2b70.jpg", "published_at": "2019-09-26"}