{"pub": "marketwatch", "url": "https://marketwatch.com/story/20-of-big-4-audited-ipos-report-weaknesses-in-financial-reporting-controls-2019-09-04", "downloaded_at": "2019-09-04 23:40:16.280911+00:00", "title": "20% of Big 4-audited IPOs report weaknesses in financial-reporting controls", "language": "en", "published_at": "2019-09-04", "text": "Exercise-bicycle company Peloton Interactive Inc. voluntarily disclosed material weaknesses in its financial-reporting controls when the company filed for an initial public offering last week. Going public with serious holes in controls, however, is more common than investors may realize.\n\nA MarketWatch analysis of SEC filing data provided by research firm Audit Analytics shows 100 IPO filings in 2019 year-to-date by companies that use a Big 4 audit firm — Deloitte, Ernst & Young, PricewaterhouseCoopers or KPMG. MarketWatch’s analysis of S-1 disclosures for those companies found 20 that have voluntarily disclosed serious issues with internal controls over accounting, financial reporting and the systems.\n\nRead: Peloton IPO: Five things to know about the interactive exercise-machine company\n\nA material weakness in internal controls over financial reporting, or ICFR, is a deficiency, or combination of deficiencies, that creates a reasonable possibility that a material misstatement of the company's financial statements — whether due to error or fraud — will not be prevented or detected on a timely basis.\n\nFirm # of IPOs YTD 2019 # of IPOs with Material Weakness Disclosures % Deloitte LLP 28 7 25.0% Ernst & Young LLP 31 0 0% KPMG LLP 19 7 36.8% PricewaterhouseCoopers LLP 22 6 27.3% Total 100 20 20%\n\nSEC S-1 filing data complied by Audit Analytics from Edgar system. Filings reviewed by MarketWatch.\n\nAll public companies are required to obtain a financial statement audit from an audit firm registered with the Public Company Accounting Oversight Board, the regulator for the audit industry established by the Sarbanes-Oxley law.\n\nAuditor opinions on internal controls over financial reporting are required of most larger public companies under Section 404(b) of the Sarbanes-Oxley Act of 2002. Some companies, those with less than $75 million in public float, are permanently exempt from the auditors’ ICFR opinion. Companies that are not exempt are not required to have their first auditor’s opinion on ICFR until their second year as a public company.\n\nEmerging-growth companies are exempt for the requirement for up to five years, or until they exceed $1.07 billion in revenue. The EGC classification was created by the JOBS Act for companies that have total annual gross revenue of less than $1.07 billion.\n\nPeloton had annual revenues of $915 million for the fiscal year ended June 30, 2019, so it barely still qualifies as an “emerging-growth company,” which allows it to take advantage of reduced reporting and other corporate governance requirements, including the pass on paying its auditor, KPMG, to report on its internal controls over financial reporting for a while.\n\nPeloton will be required to obtain its auditor’s ICFR opinion once it stops being an emerging-growth company. For now, though, its disclosure of internal control weaknesses that management identified during the preparation of the financial statements included in the IPO filing is fully voluntary.\n\nPeloton reported material weaknesses in its S-1 related to information-technology general controls, its controls to address segregation of certain accounting duties, its timely reconciliation and analysis of certain key accounts, and the review of journal entries by management. That means Peloton has detected significant vulnerabilities to accounting manipulation because it does not have enough competent accounting staff and senior management that can provide oversight and detection of errors and potentially fraud, and its systems are not providing sufficient prevention and detection of human error or inappropriate manipulation of accounting information.\n\nThe company’s CFO, Jill Woodworth has been on board only since April 2018. She also fills the position of chief accounting officer. She is a former investment banker who is not an accountant by training or experience, based on her company biography.\n\nThese issues and weaknesses may be typical of most startups and might be expected in small, development-stage low- or no-revenue companies, but are more surprising in a company like Peloton that already has significant revenue.\n\nPeloton, along with the other 19 IPO companies that disclosed material weaknesses in internal control in 2019, may have been more likely to voluntarily disclose the issues because of their desire to go public. Having a Big 4 audit firm at its service during the pre-IPO process may have encouraged a more proactive approach to disclosure.\n\nTo review: Cushman & Wakefield’s IPO: Here are 5 things to know\n\nAlso: Levi Strauss & Co. IPO: 5 things to know about the iconic jeans company\n\nOlga Usvyatsky, an independent researcher and accounting PhD student at Boston College, is doubtful that all companies will be so forthcoming when the disclosures are voluntary. She told MarketWatch: “What are the implications of voluntary ineffective controls disclosures in an S-1? If we are relying on self-disclosure, what happens if there is no disclosure? What mechanisms does the SEC have to enforce self-disclosure?”\n\nThe Sarbanes-Oxley law, and its requirement for an auditor’s opinion on internal controls, was passed in 2002 after the corporate frauds of Enron, Worldcom and Health South, among others, and was intended to restore confidence in public companies’ financial reporting and in auditors’ ability to spot fraud and warn investors. The law added the requirement that management of public companies assess the effectiveness of its internal control over financial reporting, and that auditors give an opinion on management’s assessment of its ICFR.\n\nHowever, the requirement for companies to create and maintain a system of internal accounting controls that provide ‘’reasonable assurances’’ that “transactions are recorded as necessary to permit preparation of financial statements” that comply with Generally Accepted Accounting Principles, or GAAP, has been around since 1977.\n\nIn May, the Securities and Exchange Commission proposed exempting more companies from getting an auditor’s opinion on their internal controls, a proposal that would benefit mostly development-stage biotech and medical-device companies which have been receiving a high number of warnings.\n\nSee this: SEC proposes eliminating auditor checks on controls at low-revenue biotechs\n\nAnd this: Almost half of auditor warnings about potential failure are on IPOs\n\nThe SEC proposal would exempt companies with less than $100 million in annual revenue from the requirement to get an opinion on their internal controls. SEC Chairman Jay Clayton spoke out strongly in favor of the proposal at the time, saying, “Many of these smaller companies — including biotech and health-care companies — will be able to redirect the savings into growing their companies by investing in research and human capital.”\n\nCommissioner Hester Peirce has been even more outspoken.\n\nAt the 2019 CARE Conference on financial regulation effectiveness and the role of academic research, sponsored by the University of Notre Dame’s Mendoza College of Business on May 17, Peirce articulated her support for the proposal:\n\n“Investors are pretty frustrated, investors in these small biotech companies that are pre-revenue. They’re not really excited when there’s a money raise and they’re told ‘your money will be going to pay for the auditor.’ This is not what those investors want their money to be going for.”\n\nBut Peirce doesn’t like the requirement for an auditor’s opinion at all, for any company. In a question from the audience, Indiana University accounting professor Joseph Schroeder reminded Peirce that companies with less than $75 million public float, the smallest companies, are already permanently exempt for the requirement to get an auditor’s opinion on their internal controls.\n\nIs this proposal, he asked, about protecting smaller companies from unnecessary expense or is it disproportionately going to benefit biotech companies?\n\nPeirce responded that the idea was that companies with low revenue or no revenue had less complicated controls. “But, that being said, if I were king or queen for a day, I would make it optional for everyone.”\n\nWhy doesn’t Peirce push a formal proposal of a full repeal of the Sarbanes-Oxley Section 404(b) requirement?\n\nThe audit firms may “take me out,” Peirce quipped.\n\nSee also: SEC proposes to give big investors IPO information edge over retail investors\n\nRead: Behind the push at the SEC to make it easier for IPOs to be launched\n\nIn research published in 2013, “The Effect of Voluntary Internal Control Audits on the Cost of Capital,” Cory A. Cassell, Linda A. Myers and Jian Zhou found evidence that voluntary compliance with 404(b) is more likely among smaller companies permanently exempt from internal controls audit requirements if they have higher sales growth and stronger monitoring mechanisms. For example, companies that engage a Big 4 auditor and have higher institutional ownership more often voluntarily disclose the results of their reviews. However, from 2004 to 2010, only 6% of these smaller companies voluntarily provided reports on ICFR.", "description": "1 out of 5 companies with money to spend on the best advice voluntarily report material control weaknesses at IPO time, but an SEC proposal would exempt...", "authors": ["Francine Mckenna"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HH479_Peloto_ZG_20190411161515.jpg"}