{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/14/monday-morning-news-briefingpm-told-give-ground-brussels", "downloaded_at": "2019-10-14 10:14:36.480838+00:00", "title": "Monday morning news briefing: PM told to give more ground to Brussels", "language": "en", "text": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here and try our Audio Briefings on WhatsApp.\n\nFury as European Union demands more Brexit concessions\n\nIt is the start of a crunch week that will decide the fate of Boris Johnson's Brexit. But Brussels has demanded yet more concessions from Britain - prompting warnings that a deal based on further compromise would never get through Parliament. Michel Barnier, the EU's chief Brexit negotiator, told ambassadors that \"more work needs to be done\". It sparked anger and appeared to sink hopes of an early breakthrough. Officials resume talks today, with time rapidly running out if there is to be an agreement to put to EU leaders at their two-day summit from Thursday. The sticking point remains the Northern Irish backstop. Peter Foster explains why that is so important. And Camilla Tominey reports on warnings from scientists that EU rules could make cancer deaths more likely.\n\nMeanwhile, the Queen's Speech takes place today amid the State Opening of Parliament. Among the plans to be set out is tougher prison sentences for foreign murderers and rapists. In the 22-bill Queen's Speech, the Government aims to set out a Brexit Britain blueprint. Topic by topic, Political Correspondent Amy Jones sets out what will be in the Government's legislative agenda.", "description": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here and try our Audio Briefings on WhatsApp.", "authors": ["Danny Boyle", "Michael Hogan", "Jane Shilling"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/14/112blower14-10-19-xlarge_trans_NvBQzQNjv4BqepFX7Cjaz_vGTytwS0xbx6ObcrhoQOlSpefdeX305PQ.jpg?imwidth=1200", "published_at": "2019-10-14"}