{"pub": "investing.com", "url": "https://investing.com/news/technology-news/ecbs-villeroy-tells-facebook-that-libra-faces-tough-scrutiny-1979547", "downloaded_at": "2019-09-17 11:25:58.769573+00:00", "title": "ECB's Villeroy tells Facebook that Libra faces tough scrutiny", "language": "en", "text": "© Reuters. Francois Villeroy de Galhau, attends the Group of 20 (G-20) high-level seminar on financial innovation \"Our Future in the Digital Age\" on the sidelines of the G-20 finance ministers and central bank governors meeting in Fukuoka\n\nBy Marc Jones and Huw Jones\n\nLONDON (Reuters) - European Central Bank board member Francois Villeroy de Galhau said on Tuesday that \"stablecoins\" like Facebook’s Libra highlight gaps in rules and the media giant's payments project faced a tough regulatory approach.\n\nFacebook's planned Libra is the most well-known of the stablecoins, cryptocurrencies backed by assets such as traditional money deposits, short-term government securities or gold.\n\n“'Stable coins' are quite different from speculative assets like Bitcoins. However, regulators will have to keep a very close eye at the global level, and believe me, we will do it,\" Villeroy said.\n\nFacebook (NASDAQ: ) has said it will apply for a license as a payments services operator in Switzerland, but this may not be comprehensive enough to satisfy regulators.\n\n\"If issuers of stable coins also want to offer banking services such as deposits, financial investments and loans, then they will have to obtain a banking license in all countries where they operate. Otherwise these activities would be illegal,\" Villeroy said.\n\nTo date, new entrants into the payments sector dominated by banks have been far smaller in size than Facebook, one of the Big Tech companies.\n\nVilleroy said these smaller fintech companies don't have the resources to \"disrupt\" banks, but Big Tech could fundamentally redefine activities in the financial system given their size and reach.\n\n\"This new situation is a major challenge for regulators and supervisors,\" he said.\n\nVilleroy said his staff at France's national central bank were looking at the issues around a potential Central Bank digital currency (CDBC).\n\n\"This is a scintillating subject,\" he added. \"We central banks should investigate the many questions it raises... and then decide on its own merits\".\n\nThere was also need for a \"genuine European strategy\" for cross-border retail payments for a sector that is already dominated by non-European firms from the U.S. and China.\n\nA pan-European response was needed, built on existing infrastructure like the ECB's TARGET Instant Payment Settlement (TIPS) system, he said. \"We don’t have much time left,\" Villeroy said.", "description": "ECB's Villeroy tells Facebook that Libra faces tough scrutiny", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8G0Q6_L.jpg", "published_at": "2019-09-17"}