{"pub": "yahoo", "url": "https://news.yahoo.com/couple-surprises-mom-scrabble-pregnancy-announcement-214402814--abc-news-topstories.html", "downloaded_at": "2019-10-04 12:31:29.031816+00:00", "title": "Couple surprises mom with Scrabble pregnancy announcement", "language": "en", "text": "Couple surprises mom with Scrabble pregnancy announcement originally appeared on goodmorningamerica.com\n\nClever pregnancy announcements are commonly seen across the internet these days, but this sweet video of a woman learning she's about to be a grandmother will be playing games with your emotions.\n\nMike Adam and Sarah Arroyo have been married for almost 5 1/2 years, and though they were enjoying the married life, loved ones kept asking them the same question.\n\n\"People kept being like, 'When are you going to have kids? When are you going to have kids?' … They kind of gave up on us,\" Adam told \"Good Morning America.\"\n\nPHOTO: Mike Adam and Sarah Arroyo have been married for more than five years and learned they were expecting a child earlier this year. (Courtesy Mike Adam) More\n\nSo earlier this year when Sarah learned she was pregnant, she and Adam knew that they had to do \"something special\" to tell his mom.\n\nSarah devised the plan: She and Adam, as well as Adam's sister and his mom, Deborah Garofalo, love to play Scrabble together, so Sarah thought that a nondescript round of the classic board game would provide the perfect cover for their announcement.\n\n\"I thought it would be really cute to surprise her in a way that's both unique but unsuspecting,\" Arroyo said.\n\n(MORE: Olympic sprinter Allyson Felix breaks world record held by Usain Bolt 10 months after giving birth)\n\nIn the video, Sarah, who's also filming, makes the first move on the board with \"Grandma,\" followed by Adam placing \"baby.\" Adam's mom at first thought their game was a developing a \"cute theme.\" Then it hit her.\n\n\"My mom had no idea, and she was just crying tears of joy,\" Adam said, laughing. \"I know now I'm 100% the favorite child at least for a little bit.\"\n\nPHOTO: The couple surprised Adam's mother with their pregnancy announcement over a game of scrabble. (Courtesy Mike Adam) More\n\nThe video even caught the eye of \"GMA's\" Ginger Zee, and the heartwarming moment aired on \"GMA\" this morning as a part of the series #YourGMAMoment.\n\n\"Before the segment was even over, my mother's calling me, Facetiming us. She's like, 'Am I on GMA? My phone's blowing up' … We were dying. It was just perfect!\" Adam said.\n\nAdam said his mom was \"over the moon\" to hear the news about her first grandchild.\n\n\"I think my mother's reaction is genuine and priceless,\" Adam said. \"I get choked up even watching it now.\"\n\nPHOTO: The due date for the couple's baby is April 11. (Courtesy Mike Adam) More\n\nAt the moment, the couple does not want to find out the baby's gender. Sarah is 13 weeks pregnant. She said that the positive response has been unexpected but meaningful to the whole family.\n\n\"It's such a wonderful feeling to receive that kind of heartfelt congratulations and excitement. It's different from anything I've ever experienced,\" she said. The reaction of Adam's mom \"was so genuine. We just had to share. She's wanted a grandchild for the longest.\"", "description": "Clever pregnancy announcements are commonly seen across the internet these days, but this sweet video of a woman learning she's about to be a grandmother will be playing games with your emotions.  Mike Adam and Sarah Arroyo have been married for almost 5 1/2 years, and though they were enjoying the", "authors": ["Laura Laughead"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ec7Pw42ZJCnmk2sA9iOYlw--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.gma.com/191003_gma_digital_scrabbleNEW_hpMain_16x9_992.jpg", "published_at": "2019-10-03"}