{"pub": "businessinsider", "url": "https://businessinsider.com/us-diplomat-unaware-of-possible-quid-pro-quo-on-ukraine-source-2019-10", "downloaded_at": "2019-10-27 12:13:45.835883+00:00", "title": "U.S. diplomat unaware of possible quid pro quo on Ukraine: source", "language": "en", "text": "Philip Reeker, U.S. acting assistant secretary of state for European and Eurasian Affairs, arrives to testify in impeachment inquiry against U.S. President Donald Trump Reuters\n\nBy Arshad Mohammed and Karen Freifeld\n\nWASHINGTON (Reuters) - The top U.S. diplomat for Europe did not know U.S. security aid may have been withheld to pressure Ukraine's new president to conduct investigations politically helpful to U.S. President Donald Trump, a source familiar with the matter told Reuters.\n\nPhilip Reeker, the acting assistant secretary of state for European and Eurasian affairs, testified on Saturday before three Democratic-led House of Representatives panels conducting an inquiry into whether to impeach Trump.\n\nThe source, who spoke on condition of anonymity, said Reeker was prepared to tell the committees in the closed-door session he had largely left Ukraine policy to Kurt Volker, then the U.S. special representative for Ukraine negotiations, and to others.\n\nReeker took up his post on March 18, overseeing diplomacy in 50 nations including Russia and Ukraine, as then-U.S. Ambassador to Ukraine Marie Yovanovitch faced public criticism including the allegation, which she and the department denied, that she gave a Ukrainian official a list of people not to prosecute.\n\nThe source said Reeker sought a stronger State Department defense of Yovanovitch - who was brought back early from her post in May - under U.S. Secretary of State Mike Pompeo's name, but this appeared to have been stymied \"from the top,\" though it was not clear if Pompeo himself had objected.\n\nThe impeachment inquiry focuses on Trump's request for Ukraine to investigate a domestic political rival, Joe Biden, the former vice president who is a leading contender for the Democratic presidential nomination to face Trump in 2020.\n\nThe Republican president this year withheld $391 million in security aid to Ukraine that had been approved by Congress.\n\nDuring a July 25 call at the heart of the inquiry, Trump asked Ukrainian President Volodymyr Zelenskiy as \"a favor\" to look into a claim - debunked as a conspiracy theory - that a Democratic National Committee computer server was in Ukraine.\n\nThe unsubstantiated theory could buttress Trump's skepticism of U.S. intelligence agencies' conclusion Russia interfered in the 2016 election to help him against Democrat Hillary Clinton.\n\nTrump also asked Zelenskiy to investigate Biden, and Biden's son Hunter Biden, who had served as a director for the Ukrainian energy company Burisma.\n\nIn the call, Zelenskiy agreed to conduct the investigations. The U.S. aid was released in mid-September.\n\nTrump and other U.S. officials have denied for weeks that they had demanded a \"quid pro quo\" - a Latin phrase meaning a favor for a favor - for delivering the U.S. aid.\n\nBut Trump's acting chief of staff, Mick Mulvaney on Oct. 17 said Trump's withholding the aid was linked to his request that the Ukrainians look into the claims about the Democrats' server. [nL2N2720JM]\n\nThe source said Reeker was unaware in the June-August period of the possibility Trump may have withheld the aid or a meeting to pressure Zelenskiy to carry out the investigations.\n\nReeker knew the aid was being delayed, the source said, but not why and largely left policy toward Ukraine to Volker, to Charge d'Affaires at the U.S. embassy in Kiev Ambassador William Taylor, Ambassador to the European Union Gordon Sondland and George Kent, a deputy assistant secretary of state.\n\nAll four have already testified in the impeachment inquiry.\n\nIn his testimony, Taylor said by mid-July \"it was becoming clear to me that the (White House) meeting President Zelenskiy wanted was conditioned on the investigations of Burisma and alleged Ukrainian interference in the 2016 U.S. elections.\"\n\nHe testified that he was alarmed when he later heard security aid, not just a meeting, was conditioned on the investigations. [nL2N2770HY]\n\nHowever, the source said that Reeker, a veteran career U.S. diplomat, was largely out of the loop on policy toward Ukraine.\n\n\"He knew that Volker and Sondland and Kent were on top of this and were dealing with it on the day to day and he just wasn't,\" said the source. \"His take on this was ... he should let those people do their job.\"\n\nHowever, the source said Reeker tried to get the agency to issue a stauncher defense of Yovanovitch. In March, the agency said allegations she provided a list of people not to prosecute \"are not true and are intended to tarnish (her) reputation.\"\n\nYovanovitch was recalled early despite being told she had done nothing wrong, partly because of attacks on her, including by Trump's personal lawyer Rudy Giuliani, who has told Reuters he provided information to both Trump and the State Department.\n\nThe source said Reeker tried to get the agency to issue a stronger defense in Pompeo's name but the final statement was \"weaker than some folks in the department, including Phil, wanted.\"\n\n(Reporting By Arshad Mohammed and Karen Freifeld; Editing by Daniel Wallis)", "description": "WASHINGTON (Reuters) - The top U.S. diplomat for Europe did not know U.S. security aid may have been withheld to pressure Ukraine's new president to conduct investigations politically helpful to U.S. President Donald Trump, a source familiar with the matter told Reuters.", "authors": ["Arshad Mohammed"], "top_image": "https://www.businessinsider.com/public/assets/BI/US/og-image-logo-social.png", "published_at": "2019-10-26"}