{"pub": "npr", "url": "https://npr.org/2019/09/10/758069166/not-all-lost-jazz-albums-are-created-equal", "downloaded_at": "2019-09-10 23:28:05.225960+00:00", "title": "Not All 'Lost' Jazz Albums Are Created Equal", "language": "en", "text": "Not All 'Lost' Jazz Albums Are Created Equal\n\nEnlarge this image toggle caption Bill Wagg/Redferns/Getty Images Bill Wagg/Redferns/Getty Images\n\nHistorians and critics have pored over the recordings of these jazz greats like Miles Davis, John Coltrane and Stan Getz so exhaustively, it might feel like they've left no stone unturned. And yet, fans are seeing a slew of exciting new discoveries lately from these and other artists — so-called \"lost\" albums by some of the biggest names in jazz.\n\n\"For jazz historians and record producers, the work never finishes,\" Nate Chinen of Jazz Night in America and NPR member station WGBO says. \"There's always another lead to be pursued, another corner to be explored and when we think we know everything about an artist ... There's often something else that we hadn't considered.\"\n\nIn addition to that air of exploration, Chinen says that the jazz industry has \"commercial motivation\" to pump out such albums and cites the 2018 album Both Directions at Once: The Lost Album, released via Impulse! Records, which sourced material from John Coltrane's 1963 sessions and reference tapes as a shining example. \"It sold over a quarter of a million copies.\"\n\nLater this month, Impulse Records! will release another album, Blue World, composed of Coltrane recordings from 1964 that were originally intended for a film score.\n\n\"Coltrane recorded this music for a film in Montreal,\" Chinen says. \"It's a cornerstone of the Québécois film movement. But outside of that movement, it hasn't been all that widely seen. So, the film historians and the jazz scholars didn't connect the dots here and because the music wasn't catalogued by the label it fell into this kind of blindspot.\"\n\nA new record of Miles Davis' lost recordings called Rubberband was just released via Rhino Records. The album features Davis recordings from 1985 with contemporary touches. Vocalist Ledisi is featured on the track \"Rubberband of Life.\" It's because of these contemporary aspects that Chinen doesn't truly consider this a \"lost\" album.\n\nYouTube\n\n\"We have to sort of raise an eyebrow at that term here because there's no way Miles would have envisioned this album because, I mean, Ledisi wasn't recording music in 1985,\" he argues. \"The sound is clearly something from our time, not his. So is it a lost album? I don't know. But it is indisputably some music that Miles Davis made at an interesting moment and because he is who he is people will be interested to hear what this is all about.\"\n\nGetz At The Gate (Live) was released in May 2019 and encapsulates a performance from the late saxophonist Stan Getz that Chinen says offers a fresh perspective on Getz's music legacy.\n\nYouTube\n\n\"When you think of Stan Getz, I think many people think of his bossa nova period,\" Chinen says. \"This was a live recording made in 1961, a few months before he began that journey with jazz samba. ... He's leading a fabulous band with Roy Haynes on drums. He's swinging so hard on the bandstand and so, you have this document of another side of Getz.\"\n\nChinen counts these unearthed live jazz performances as \"an area where the windfall just keeps coming.\"\n\n\"We've seen so many live recordings that become cherished albums now that weren't originally conceived as albums,\" Chinen says. \"It's all to the better, I think.\"", "description": "NPR's Rachel Martin talks to Nate Chinen of member station WBGO and Jazz Night in America about three rediscovered jazz albums from Miles Davis, John Coltrane and Stan Getz.", "authors": ["Rachel Martin", "Vince Pearson"], "top_image": "https://media.npr.org/assets/img/2019/09/05/gettyimages-540274703_wide-90456d666493c75dc2e9eaf9e4502a417d70fcda.jpg?s=1400", "published_at": "2019-09-10"}