{"pub": "breitbart", "url": "https://breitbart.com/2020-election/2019/10/15/fact-check-pete-buttigieg-falsely-claims-trump-silent-on-hong-kong", "downloaded_at": "2019-10-16 05:11:02.173838+00:00", "title": "Fact Check: Pete Buttigieg Falsely Claims Trump Silent on Hong Kong", "language": "en", "text": "CLAIM: South Bend, Indiana, Mayor Pete Buttigieg claimed in the fourth Democrat debate that President Donald Trump has been silent on Hong Kong.\n\nVERDICT: Mostly false. While the president arguably could say more, he has criticized China’s conduct toward Hong Kong — most recently, in front of the entire world at the United Nations.\n\nButtigieg told the audience at the debate: “In a place like China, the people of Hong Kong rise up for democracy and don’t get a peep of support from the president.”\n\nBut that is simply untrue.\n\nThe president told the UN last month:\n\nAs we endeavor to stabilize our relationship, we’re also carefully monitoring the situation in Hong Kong. The world fully expects that the Chinese government will honor its binding treaty, made with the British and registered with the United Nations, in which China commits to protect Hong Kong’s freedom, legal system, and democratic ways of life. How China chooses to handle the situation will say a great deal about its role in the world in the future. We are all counting on President Xi as a great leader.\n\nOne could argue that the Trump administration could say and do more about Hong Kong.\n\nThe same is true of CNN and the New York Times — the co-sponsors of the debate — who failed to ask a single answer about China or Hong Kong. No other Democratic candidates mentioned Hong Kong at the debate, either.\n\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.", "description": "CLAIM: Pete Buttigieg claimed Trump has been silent on Hong Kong. VERDICT: Mostly false. Trump brought it up in his UN speech.", "authors": ["Joel B. Pollak"], "top_image": "https://media.breitbart.com/media/2019/10/Pete-Buttigieg-Getty-640x335.jpg", "published_at": "2019-10-15"}