{"pub": "independent", "url": "https://independent.co.uk/news/world/asia/indonesia-plastic-waste-west-contaminated-containers-a9110611.html", "downloaded_at": "2019-09-18 23:28:06.649985+00:00", "title": "Indonesia to send ‘contaminated’ waste back to West", "language": "en", "text": "Indonesia is sending waste back to wealthy nations after discovering they were contaminated with used plastic and hazardous materials.\n\nThe move came amid a growing backlash in southeast Asia against being a dumping ground for the developed world’s rubbish.\n\nFor now, 547 containers of waste will be returned to their countries of origin, including the UK, although more are being investigated.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nNine containers with at least 135 tons of rubbish were sent back to Australia on Wednesday, customs director Heru Pambudi said at a news conference in Jakarta.\n\n“Some food still remains there with liquid flowing,” Mr Pambudi said as he showed the contents of several containers.\n\nShape Created with Sketch. Rubbish mountain: Everest waste piles up Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Rubbish mountain: Everest waste piles up 1/10 Sherpas discover discarded tents and other litter at Camp Four, the highest camp on Mount Everest on 21 May 2019 Dawa Steven Sherpa / AP 2/10 Workers drag sacks of waste collected from Mount Everest recycling in Kathmandu on 5 June 2019 AFP/Getty 3/10 Discarded tents and climbing equipment litter the Everest mountainside on 21 May 2018 AFP/Getty 4/10 Workers from a recycling company in Kathmandu dump rubbish collected from Mount Everest on 5 June 2019 Reuters 5/10 A sherpa picks up litter among discarded tents and climbing equipment at Camp Four, the highest camp on Mount Everest on 21 May 2019 AP 6/10 Sacks of rubbish collected from Mount Everest are piled up near the base of the mountain AP 7/10 Workers sort through a pile of litter collected from Mount Everest on 5 June 2019 AFP/Getty 8/10 Workers sort through a pile of litter collected from Mount Everest on 5 June 2019 Reuters 9/10 Nepalese soldiers pile up bags that are filled with rubbish found on Mount Everest on 27 May 2019 AP 10/10 Members of the rubbish retrieval expedition pile up empty oxygen cylinders collected on Mount Everest on 27 May 2019 AP 1/10 Sherpas discover discarded tents and other litter at Camp Four, the highest camp on Mount Everest on 21 May 2019 Dawa Steven Sherpa / AP 2/10 Workers drag sacks of waste collected from Mount Everest recycling in Kathmandu on 5 June 2019 AFP/Getty 3/10 Discarded tents and climbing equipment litter the Everest mountainside on 21 May 2018 AFP/Getty 4/10 Workers from a recycling company in Kathmandu dump rubbish collected from Mount Everest on 5 June 2019 Reuters 5/10 A sherpa picks up litter among discarded tents and climbing equipment at Camp Four, the highest camp on Mount Everest on 21 May 2019 AP 6/10 Sacks of rubbish collected from Mount Everest are piled up near the base of the mountain AP 7/10 Workers sort through a pile of litter collected from Mount Everest on 5 June 2019 AFP/Getty 8/10 Workers sort through a pile of litter collected from Mount Everest on 5 June 2019 Reuters 9/10 Nepalese soldiers pile up bags that are filled with rubbish found on Mount Everest on 27 May 2019 AP 10/10 Members of the rubbish retrieval expedition pile up empty oxygen cylinders collected on Mount Everest on 27 May 2019 AP\n\nThey were among 156 containers held in Tangerang port, near Jakarta, which will be returned soon to other countries including the UK, the US, New Zealand, Spain and Belgium.\n\nMr Pambudi said the government has stopped more than 2,000 containers this year in several ports in East Java, Jakarta, Tangerang and Batam, near Singapore.\n\nSo far it has sent back 331, which will be followed by 216 others to France, Germany, Greece, the Netherlands, Slovenia, Canada, Japan and Hong Kong.\n\nAuthorities are still investigating the rest.\n\nHe said 91 other containers will be returned to Australia after administrative processes are complete.\n\nThe government announced in July that it had sent back nearly 60 containers of waste from Australia that were supposed to contain only paper but included household waste, used cans, plastic bottles, oil packaging, used electronics, used nappies and used footwear.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nMr Pambudi said several Indonesian-owned companies that imported the waste must return it to the countries of origin within 90 days.\n\nNo other sanctions were declared, although importing hazardous waste is a criminal offence with penalties of up to 12 years in prison and a fine of up to 12 billion rupiah (£685,000).\n\nChina banned the import of plastic waste at the end of 2017, resulting in more used plastic being sent to developing southeast Asian nations.\n\nA study published in June last year in the journal Science Advances that used United Nations data found other nations will need to find a home for more than 110 million tons of plastic waste by 2030 because of the Chinese ban.\n\nIndonesia and China are among the world’s biggest producers of plastic waste, which is increasingly fouling their land, seas and beaches.\n\nAssociated Press", "description": "Indonesia is sending waste back to wealthy nations after discovering they were contaminated with used plastic and hazardous materials.", "authors": ["Niniek Karmini", "Achmad Ibrahim"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/18/15/ap-19261395066650.jpg", "published_at": "2019-09-18"}