{"pub": "cnn", "url": "https://cnn.com/travel/article/best-classic-restaurants-new-york-city/index.html", "downloaded_at": "2019-09-06 12:11:35.311591+00:00", "title": "The best classic New York City restaurants", "language": "en", "text": "New York (CNN) — You could easily go broke trying to visit every restaurant in New York City's five boroughs. But while there will always be plenty of people chasing the next hot thing -- rainbow unicorn ramen -- there are certain restaurants that have outlasted the rest.\n\nThese spots are known for their style, their service and especially their food , and have survived against cutthroat competition.\n\nSome have even been pioneers behind new cuisines, introducing the city to exciting flavors and innovative ingredients. Not every restaurant on this list has celebrated 100 years, but we have every reason to believe they will.\n\nSo add these best classic restaurants to your list when you travel to New York:\n\n21 Club\n\nThe 21 Club's myriad jockey figurines were donated by horse breeders and owners. wdstock/Getty Images\n\nThe first thing you'll notice is a small townhouse amid the Midtown skyscrapers. Iron jockeys lining the exterior balcony welcome patrons and give this former speakeasy singular curb appeal.\n\nInside the bar room, the toys and memorabilia -- rumored to be gifts from A-list guests of years past -- continue with a jaw-dropping collection of miniature planes, trains, cars and miscellaneous knickknacks hanging from the ceiling. The impressive wine list alone shows that the bar room means business. Its dress code and strict cancellation policy add to it.\n\nThis is a great choice if you're planning on visiting nearby Rockefeller Center. -- Isabela Espadas Barrios Leal\n\n21 Club , 21 W 52nd St, New York, NY 10019, +1 (212) 582-7200\n\nBamonte's\n\nIn pop culture, New York City is synonymous with white-tablecloth, red-sauce Italian restaurants with dark wood and family-style service. But they aren't a relic of the past.\n\nYou can still experience an Italian restaurant straight out of a film at Bamonte's, a classic that has somehow weathered the sweeping gentrification of Williamsburg, Brooklyn by staying one hundred percent true to itself.\n\nThe waiters are always impeccable, the Yankees game is always on during the season, and the spaghetti and meatballs are always made fresh. The address may be in Brooklyn, but the dining room is in another world. -- Lilit Marcus\n\nBamonte's, 32 Withers St, Brooklyn, NY 11211, +1 (718) 384-8831\n\nRelated content American food: The 50 greatest dishes\n\nBarney Greengrass\n\nPractically every New York City neighborhood has a respectable bagel joint. New Yorkers, in case you didn't know, love their bagels and everything that goes with them.\n\nBarney Greengrass on Manhattan's Upper West Side has been in existence since 1908, and its bagels and smoked fix accoutrements are some of the city's finest.\n\nThe sheer variety is impressive -- it's not just lox or whitefish but rather a wealth of options including sturgeon, pastrami salmon, sable, Nova Scotia salmon, kippered (baked) salmon, and the list goes on. -- Stacey Lastoe\n\nBarney Greengrass , 541 Amsterdam Ave, New York, NY 10024, +1 (212) 724-4707\n\nDelmonico's\n\nDelmonico's is on the corner of William and Beaver Streets. SeanPavonePhoto/Getty Images\n\nDelmonico's has existed in some form since the 1820s. Widely hailed as the first fine dining restaurant in the United States, the place has racked up plenty of firsts -- the first standalone wine list menu in the United States, the inventions of Lobster Newburg and the wedge salad, and the first known use of the name \"Baked Alaska,\" among others.\n\nThe restaurant, originally founded by two brothers from Switzerland, has had several changes of address and of ownership over the centuries.\n\nThese days, some things at Delmonico's are still classic -- the steak, the dark wood dining room, the peacock-feather-esque wallpaper -- while others have kept up with the current, such as special Restaurant Week menus, online reservation booking and people calling the neighborhood \"FiDi.\"\n\nYou can still get the Lobster Newburg, though. -- LM\n\nDelmonico's , 56 Beaver St, New York, NY 10004, +1 (212) 509-1144\n\nDi Fara\n\nClose-up on a rectangular pie from Di Fara's. Courtesy bri + lia/Di Fara\n\nThe cash-only spot in Brooklyn welcomes customers visiting from all over the world on a daily basis. Neighborhood residents might saunter by, and, if the line -- which often winds out the door and down the street -- isn't too long, join for a slice of the pizzeria's Margherita.\n\nAt more than $5 a slice and sometimes waits of upwards an hour for that slice (pro tip: order the whole pie), Dominque DeMarco's no-frills pizza joint is doing something right.\n\nAnd that something includes using only the freshest ingredients, according to DeMarco's daughter Margaret Miales, who says her family goes \"the extra mile\" to source their ingredients.\n\nThanks to DeMarco's handiwork -- he's 81 and often still behind the counter tossing around dough and painting it with sauce, fresh mozzarella and other classic pizza ingredients -- it's the stuff of delicious legends. If you're lucky, you'll find yourself front and center when DeMarco wields a pair of scissors and expertly cuts fresh basil over his classic masterpiece. -- SL\n\nDi Fara , 1424 Avenue J, Brooklyn, NY 11230, +1 (718) 258-1367\n\nRelated content These are New York City's best pizza restaurants\n\nGrand Central Oyster Bar\n\nMost train stations are known more for grab-and-go snacks than for fine dining. But the Grand Central Oyster Bar inside Grand Central Terminal breaks all of those rules by providing such high-quality seafood that even locals will brave rush hour crowds to get a table there.\n\nIn a city where everyone is in a hurry, the Oyster Bar takes its time and does things the old-fashioned way, from purchasing fresh fish every morning to graciously walking you through any item on the menu without hurrying you along to order.\n\nIt's just as well suited to a quick meal at the tile-topped bar before catching a Metro-North train to Connecticut as it is for a big celebration dinners with old friends -- just make sure that, whatever you do, you ask for oysters on the half shell. There are plenty of other tasty items on the menu, but it's the simplest dishes that leave nowhere to hide. -- LM\n\nGrand Central Oyster Bar , 89 E 42nd St, New York, NY 10017, +1 (212) 490-6650\n\nJing Fong\n\nEight thousand shrimp dumplings are made at Jing Fong each week\n\nNew Yorkers love brunch so much that it might as well be the city's official competitive sport. On a quiet, compact corner of Chinatown, the neighborhood with arguably the best restaurant-per-square-foot ratio in Manhattan, is one of the ultimate brunch spots -- Jing Fong.\n\nDon't bother with a menu when you have dim sum on the brain -- simply wait for servers to walk by pushing carts of steaming buns, noodles and other Chinese specialties, then point. It's hard to go wrong with har gow, or shrimp dumplings -- the chefs make about 8,000 a week.\n\nThe restaurant is now in its third generation of being owned and managed by the same family, and this fraternal atmosphere permeates -- it's not unusual to see a couple of old-timers spend all day holding court and ordering nothing but a pot of tea.\n\nIn a city where it's normal to get shoved out of a restaurant the minute you stop eating so they can make room for the next paying guests, Jing Fong feels like a throwback in the best possible way. -- LM\n\nJing Fong , 20 Elizabeth St, New York, NY, +1 (212) 964-5256\n\nRelated content 8 of New York City's best rooftop bars\n\nKatz's Delicatessen\n\nKatz's Deli is located on Houston Street on the Lower East Side. Michelle Bennett/Getty Images\n\nI'll have what she's having. With those five words, Katz's, a Jewish-style deli on the Lower East Side, crossed the line from local favorite to international icon.\n\nThese days, fans of \"When Harry Met Sally\" -- the movie in which Meg Ryan uttered the eternally quotable line -- and locals alike line up around the block to grab paper tickets and order pastrami sandwiches the size of a small child.\n\nThe matzoh ball soup is the cure for what ails you, especially if what ails you is sleeplessness or jet lag -- they're open 24 hours on Saturdays, making it the perfect place to acclimate city life. -- LM\n\nKatz's Delicatessen , 205 E Houston St, New York, NY 10002, +1 (212) 254-2246\n\nKeens Steakhouse\n\n\"Keens has a way with mutton,\" or so it was written in the New York Herald Tribune in 1949. And it remains as true 60 years later as it has been since Keens opened its doors in the mid 1880s.\n\nA treasure trove of American antiquities, the restaurant's ceilings are lined with pipes smoked by some of the world's most famous men, from Einstein to Babe Ruth. The artifacts are everywhere you look, including the \"Our American Cousin\" playbill that Abraham Lincoln was supposedly holding when he was shot (though there is no evidence to support that claim, we still kind of love it),\n\nStill, some important and necessary changes have been made: In August 2019, Keens manager Bonnie Jenkins announced that she had removed a number of pieces from the walls that depicted scenes of minstrelsy, blackface and other stereotypical depictions of African Americans.\n\nAside from Keens's unmistakable mise en place, this dining establishment's signature is the signature mutton chop. Derived from 2 pounds of bone-in sheep saddle, the chop is is simply prepared (some salt, some oil and a lot of fire), and served rare with its own juices along with sautéed escarole, shallots and garlic. The perfect sear brings tantalizing caramelization to the center bone and the two fatty flanks that curl around the filets, creating a distinct flavor that is deep, complex, rich and funky -- a cut of meat that makes one feel like Henry VIII.\n\nAll the other classic steakhouse offerings are here and they're all divinely on point. Especially their supersize martinis and house-made bread, both perfect for soaking up all the juicy goodness on display. - Brekke Fletcher\n\nKeens Steakhouse , 72 W 36th St, New York, NY 10018, +1 (212) 947-3636\n\nNew York City's best street for food is Arthur Avenue in the Bronx. Danielle Oteri of Feast on History shows you the best places to go.\n\nLombardi's\n\nThe NoLita landmark has been doing something right since 1905 when the coal-fired pizza spot opened its doors.\n\nThe trendy downtown neighborhood has changed a lot in the hundred-plus years since the first pizzeria (self-proclaimed but no one seems to take issue with the designation) in America emerged, but Lombardi's has remained a staple.\n\nYou'll find red and white checkered tablecloths, close quarters and long waits, depending on what time you swing by (though a limited number of reservations are now accepted).\n\nThe pizza recipe is Gennaro Lombardi's and goes back to Naples, Italy. Fresh mozzarella atop a rich tomato sauce, the original Margherita is finished with fresh basil and Romano cheese. It is the pie to order and serves as an excellent reminder of why NYC is home to the best pizza in the world. - SL\n\nLombardi's , 32 Spring St, New York, NY 10012, +1 (212) 941-7994\n\nNathan's Famous\n\nNathan's Famous' original location is in Coney Island, near the Wonder Wheel and Cyclone. Lilit Marcus\n\nNot every New York City classic meal needs white tablecloths and tuxedoed waiters. At the corner of Surf and Stilwell in the iconic waterfront neighborhood of Coney Island, Brooklyn, sits one of the city's most perfect foods -- a hot dog from Nathan's Famous.\n\nTake one of these kosher all-beef dogs, paired with an ice-cold lemonade, and eat it while sunning yourself on the beach or watching the crowds go by on the boardwalk.\n\nThough the Nathan's brand has since been franchised all over the world, there's still no replacement for the original location and no way to make a hot dog taste better than it does after a whirl on the Cyclone. -- LM\n\nPete's Tavern\n\nPete's Tavern is a haunt of celebrities such as Jimmy Fallon. Bo Zaunders/Getty Images\n\nThis 155-year-old classic New York tavern frequently boasts that it is one of the city's oldest continuously operating bars.\n\nHow to do it like a local? Sitting at the patio is a must -- that is, if you manage to snag one of the coveted corner tables. You'll find some of the best people watching in the city from this picturesque spot a stone's throw from Gramercy Park.\n\nThe menu is straightforward and full of Italian-American favorites. Options include a delicious eggplant parmigiana and homemade lasagnas, among an assortment of other homey delights. The only-on-tap-here Pete's Lager is the best way to wash it down. -- IL\n\nPete's Tavern , 129 E 18th St, New York, NY 10003, +1 (212) 473-7676\n\nWhat goes into Peter Luger's \"Holy Cow\" Sundae\n\nPeter Luger Steak House\n\nRegulars at the Williamsburg, Brooklyn, institution practically scoff when the Peter Luger's waitstaff approaches the table with a stack of large rectangle paper menus. Truly in-the-know diners know what's on the menu -- it's barely changed since 1950, though an iteration of Peter Luger (then Carl Luger's Cafe and Billiards) has been around since 1887.\n\nThen, as in now, steaks and martinis comprise the classic meal, and there's not much more one needs to leave there happy and full -- though the thick-slab bacon appetizer never hurt anyone.\n\nIt's only at lunchtime the dry-aged burgers are served. Patrons belly up to the bar for the juicy delight topped simply with thickly sliced white onion -- and American cheese if one wishes.\n\nIt's a fine option if you can steel yourself from the Porterhouse steak, the dish Luger's does best. If the adage about having a second stomach for dessert is true, then order the Holy Cow Sundae you must. -- SL\n\nRelated content World's 50 best restaurants for 2019\n\nRao's\n\nIf classic is defined by standing the test of time and being sought after nearly 130 years after opening, then Rao's is the undisputed champion. Southern Neopolitan staples including shrimp fra diavolo and linguini and clams and impossible-to-get-tables (there are only 10 of them) cement Rao's as one of NYC's greatest dining establishments.\n\nThe food is solid, but what you're really here for is the cool, old-school vibes -- and the smug contentment over actually getting a seat.\n\nThe walls of the small corner space are covered with autographed photos of every celebrity you can think of. Yankees and Mets fans especially will appreciate the nod to some of baseball's greats.\n\nOrder the tiramisu for dessert, and take a good look around: You may not get this chance again. - SL\n\nRao's , 455 E 114th St, New York, NY 10029, (212) 722-6709\n\nRandazzo's Clam Bar\n\nFried calamari is dropped on our table and just as swiftly picked up when we say we didn't order the appetizer. \"I have too many tables,\" the harried server replies and moves on to the smart table who did actually order the heaping plate of fried seafood.\n\nThis is Randazzo's on a typical Friday night: The Sheepshead Bay spot on the water is one locals have been flocking to for years. When The New York Times' Pete Wells reviewed it favorably in 2013, word about the joint -- and its red sauce -- spread further.\n\nThis isn't exactly an atmospheric place -- water and soda are served with small plastic cups, and a glass of red wine (merlot or cabernet) comes in a small, individual bottle. Enjoy it with one of many old-school, unfussy Italian-American classics such as the shrimp fra diavolo on a bed of pasta (your choice of linguini or spaghetti) or a 1.5-pound broiled lobster accompanied by a glistening bowl of butter. There's a bib for that. -- SL\n\nRelated content The TWA Hotel brings retro style to JFK airport\n\nThe Russian Tea Room\n\nFounded by members of the Russian Imperial Ballet in 1927, the Russian Tea Room is a New York City icon.\n\nSituated in a townhouse on West 57th Street next door to Carnegie Hall, this legendary establishment is a feast for the senses -- a golden ceiling with original tin chandeliers adorned with red Christmas balls and deep red banquettes. Antique samovars and original Russian paintings and Picassos add to the opulent ambience.\n\nThe main dining room is ideal for those who relish the opportunity to see and be seen while indulging in a al ong, decadent lunch, pre- or post- theater dinner, or as one must do at least once, enjoying its namesake afternoon tea service, complete with blinis with caviar. -- BF\n\nThe Russian Tea Room , 150 W 57th St, New York, NY 10019, +1 (212) 581-7100\n\nSripraphai\n\nThere's been an explosion of Thai restaurants in NYC (see Ugly Baby, Som Tum Der and Fish Cheeks), and though they're no longer concentrated in a certain Queens neighborhood, Woodside is still the place to go to experience the city's original taste of Thailand.\n\nA local staple since 1990, it wasn't long before Sriprahai made it onto the food-obsessive's radar. There are over 120 dishes on the behemoth menu, and, unlike many of the new kids on the block specializing in regional cuisine, Sriprahai's offerings are vast and inclusive.\n\nStill, there are fan favorites. Try the papaya salad and soft shell crab out on the patio in warm-weather months. -- SL\n\nSriprahai , 64-13 39th Ave, Woodside, Queens 11317 +1 7188999599\n\nSylvia's Restaurant\n\nSylvia's is one of the most famous restaurants in Harlem. Andrew Pini/Getty Images\n\nSo many of the greats are only known by one name: Madonna, Cher, Bruce. And then there's Sylvia.\n\nFounded in 1962, Sylvia Woods' self-named Harlem mainstay for home-cooked fried chicken, collard greens, mac and cheese and other stick-to-your-ribs classics really does put the soul in soul food.\n\nAnd a truly classic New York City restaurant has to nail the atmosphere as much as it does the food. Sylvia's is not only a local favorite but a bona fide Harlem institution where politicians -- including several U.S. presidents -- and kingmakers come to pay their respects and make their deals.\n\nThough Sylvia herself passed away in 2012, her namesake restaurant lives on, and so does the street named in her honor. -- LM\n\nSylvia's Restaurant , 328 Malcolm X Blvd, New York, NY 10027, +1 (212) 996-0660\n\nTavern on the Green\n\nTavern on the Green has held court in New York City's Central Park since 1934, when it was transformed from a sheep fold into a restaurant. Its enviable, bucolic environs made Tavern an instant hit, an iconic destination where locals and tourists went to celebrate life's big moments, where films had their splashy premiere parties and socialites were wed.\n\nIn the 1980s, the restaurant was a frequent backdrop for films looking to capture what was quintessential New York, from \"Wall Street\" to \"Arthur\" to \"Ghostbusters.\"\n\nWhile the real-life operation suffered setbacks, changes of ownership, closures, demolitions, union disputes, sweetheart licensing deals and the like, its sterling status and reputation has never completely tarnished.\n\nThe latest iteration of Tavern on the Green opened in 2014, after a five-year hiatus, with a decidedly more contemporary, casual vibe, a \"Tavern To Go\" outpost and an outdoor beer garden. The new Tavern retains the charm and sense of occasion of the original, and its idyllic Central Park setting makes a visit always worthwhile. -- BF", "description": "They're the time-tested favorites in a city wild about dining out. From Delmonico's for steaks to Sylvia's for soul food, these are New York City's best classic restaurants.", "authors": [], "top_image": "https://dynaimage.cdn.cnn.com/cnn/w_1200/http%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F190902110021-katzs-deli-new-york-city-super-tease.jpg", "published_at": "2019-09-05"}