{"pub": "marketwatch", "url": "https://marketwatch.com/story/heres-a-list-of-climate-must-reads-from-a-noted-science-journalist-2019-09-30", "downloaded_at": "2019-09-30 10:44:43.101449+00:00", "title": "Here’s a list of climate ‘must-reads’ from a noted science journalist", "language": "en", "text": "Thirteen years after former Vice President Al Gore sounded the climate alarm with his documentary, “An Inconvenient Truth,” it seems that major news media outlets are finally flocking toward coverage of climate change.\n\nIt is none too soon. July was officially the hottest month on record globally and scientists have been turning up the volume on warnings that humankind is running out of time to head off the worst impacts of global warming.\n\nThe ‘Covering Climate Now’ media initiative\n\nCNN held a seven-hour climate Town Hall with Democratic candidates for president, “NBC Nightly News” ran a Climate in Crisis series and MSNBC held a two-day Climate Forum in September, with some of the Democratic presidential hopefuls. But the most ambitious rallying cry may be from the Columbia Journalism Review (CJR), the Guardian and The Nation.\n\nThey’re three respected national outlets that have amassed a world-wide collection of news organizations — 250 at last count, including Next Avenue — committed to covering climate science, impacts and policy. They call it Covering Climate Now. The editors describe the effort as “a global journalism initiative to bring more and better coverage to the story of our time.”\n\nAlso on MarketWatch: ‘Investing in a simple index fund is immoral’ — why climate-change investing has been more talk than action\n\nThe initial push was a week-long blitz of stories leading up to the United Nations climate summit in New York on Sept. 23. Covering Climate Now aggregates its partners’ stories on its website and has an active Twitter feed (#coveringclimatenow).\n\nIn a mea culpa kickoff piece, CJR, in its longstanding role as a watchdog of media trends, copped to another inconvenient truth, declaring that “the media’s minimization of the looming disaster is one of our great journalistic failures.”\n\nSome of the best climate change stories so far\n\nA few of the best climate change stories that have emerged so far include:\n\nAs if to mirror the media’s own shifting priorities, several recent stories call out changing attitudes toward climate science and policy.\n\nFor instance, The Charleston Gazette-Mail profiles how climate is becoming more of a dinner-table topic in coal country.\n\nCBS News also has run a series of pieces based on its own national polling, which shows more than half of respondents favor immediate action to mitigate the effects of climate change. The survey reveals a surprising degree of optimism about our ability to slow down the fast-moving freight train of global warming.\n\nWhat polling on climate change has found\n\nCBS says its polling finds only 9% of respondents declaring themselves as outright climate change deniers. More than a third say, however, (despite growing evidence to the contrary) that the science and impacts have been exaggerated. CBS conducted its survey in early September, in the wake of Hurricane Dorian, which could have skewed responses somewhat.\n\nDon’t miss: How climate change could trigger the next financial crisis\n\nPeople are unquestionably influenced by what’s going on outside their windows or on their TV screens, so it’s not unusual to see spikes in support for climate action in the midst of a catastrophic weather event.\n\nSpeaking of which, the next critical step in climate coverage will be more real-time connection to climate change during coverage of natural disasters in which climate is a likely culprit.\n\nDuring the recent coverage of Dorian, I believe, major TV news outlets once again seemed to revel in breathless play-by-play from correspondents reporting live from windswept beaches. But they devoted relatively little time to explaining the driving forces behind such events.", "description": "Several recent articles call out changing attitudes toward climate science and policy.", "authors": ["Craig Miller"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS079_na_cli_ZG_20190925193308.jpg", "published_at": "2019-09-30"}