{"pub": "yahoo", "url": "https://news.yahoo.com/disney-unveils-official-trailer-live-action-lady-tramp-161309480--abc-news-topstories.html", "downloaded_at": "2019-10-15 16:57:06.676487+00:00", "title": "Disney unveils new official trailer for live-action 'Lady and the Tramp'", "language": "en", "text": "Disney unveils new official trailer for live-action 'Lady and the Tramp' originally appeared on goodmorningamerica.com\n\nDisney just released the second official trailer for its exclusive reimagining of \"Lady and the Tramp,\" and it's giving us all the feels!\n\n(MORE: \"Disney casts adorable rescue dog for 'Lady and the Tramp' live-action remake\")\n\nFeaturing the vocal talents of Tessa Thompson, Justin Theroux, Janelle Monáe and Sam Elliot, the movie is a modern remake of the 1955 animated classic and we're getting a glimpse of more of the new, live version of the timeless tale.\n\nLife is good for Lady, an American cocker spaniel who lives in an upscale suburban neighborhood.\n\nPHOTO: Disney releases second full-length trailer for new live-action Lady and the Tramp debuting only on Disney+ (Walt Disney Studios) More\n\nHer owners, Jim Dear and Darling, spoil her daily. Her neighbors Jock, an outspoken Scottish terrier, and Trusty, a world-weary bloodhound, are always within barking distance.\n\nBut when a baby enters the picture, Lady is no longer the center of attention, and the arrival of cat-loving Aunt Sarah only complicates matters.\n\nLady soon finds herself alone on the streets in an unwelcoming part of town.\n\nFortunately, Tramp -- a streetwise mutt -- quickly teaches Lady the ways of the world.\n\nPHOTO: Disney releases new trailer for live-action Lady and the Tramp. (Walt Disney Studios) More\n\nBefore long, the prim and proper purebred and the fast-talking mutt are partaking in moonlight strolls in the park and romantic spaghetti dinners by candlelight.\n\nTramp savors the independence of a world without leashes or fences alongside his roguish friends Peg and Bull, but Lady misses the comfort and safety of a family, and soon both must decide where -- and with whom -- they belong.\n\nPHOTO: Disney releases new trailer for live-action Lady and the Tramp, debuting only on Disney+ (Walt Disney Studios) More\n\n(MORE: \"Here's basically every title coming to Disney+ in November...\")\n\n“Lady and the Tramp” premieres Nov. 12 streaming only on Disney+.\n\nDisney is the parent company of ABC News and \"Good Morning America.\"", "description": "Disney just released the second official trailer for its exclusive reimagining of \"Lady and the Tramp,\" and it's giving us all the feels!  Featuring the vocal talents of Tessa Thompson, Justin Theroux, Janelle Monáe and Sam Elliot, the movie is a modern remake of the 1955 animated classic", "authors": ["Tony Morrison"], "top_image": "https://s.yimg.com/uu/api/res/1.2/mlbEHAIE8jddHVs0Q0dd4Q--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.gma.com/lady-and-the-tramp-ht-191015_hpMain_16x9_992.jpg", "published_at": "2019-10-15"}