{"pub": "atlantic", "url": "https://theatlantic.com/politics/archive/2019/10/tree-life-and-legacy-pittsburghs-synagogue-attack/600946", "downloaded_at": "2019-10-29 00:17:28.721639+00:00", "title": "America Has Already Forgotten the Tree of Life Shooting", "language": "en", "text": "These circles of grief converged yesterday outside the synagogue here in Squirrel Hill, the city’s Jewish neighborhood. Five sophomore girls from a local Orthodox school said their morning prayers by the garden where the 11 victims have been memorialized. Semi-famous Jewish leaders showed up, from Jonathan Greenblatt, the head of the Anti-Defamation League, to Dani Dayan, Israel’s consul general in New York. Seemingly random locals wandered by with their dogs or their kids. And members of the Tree of Life congregation stood by, ready to tell their stories in one-on-one conversations with anyone who asked.\n\nLaurie Zittrain Eisenberg, a member of the congregation’s board, told me her husband had been on his way to services when the shooting started, and he was turned back by police. Afterward, she said, they discovered they had become members of “the club no one wants to belong to.” She helped solicit artwork to honor the victims, a selection of which is now shown along the building’s fence. Half of the art, she told me, was submitted by teens from Parkland, Florida, where 17 people were killed at Marjory Stoneman Douglas High School in 2018.\n\nRead: Will anyone remember 11 dead Jews?\n\nOver the past year, victims of other mass shootings have routinely made these kinds of overtures to the Pittsburgh Jewish community. Each new attack creates an opportunity for grim reunion: Last spring, members of a cycling group from Newtown, Connecticut, the site of the 2012 Sandy Hook Elementary School shooting, came through Pittsburgh bearing a large packet of seeds—which had been given to them by yet another community victimized by a mass shooting. “They said, ‘Yes, our friends at Columbine sent it to us and asked us to bring it to you,’” Zittrain Eisenberg told me.\n\nThis network of survivors serves as a support mechanism for communities in grief, but it’s also a reminder of how little has changed since the Columbine High School shooting in 1999. Not much is structurally or politically different in the United States today compared with a year ago either, Zittrain Eisenberg said. Other shootings—in Thousand Oaks, Virginia Beach, El Paso, Dayton, and many other places—followed Tree of Life in steady succession. Zittrain Eisenberg is working with a team of volunteers from Tree of Life, who call themselves ambassadors, to reach out to the victims of mass shootings who come after them.\n\nThose working with the community in Pittsburgh know how quickly the world outside it has moved on. Shira Stern, a rabbi from Marlboro, New Jersey, has visited Pittsburgh four times since the attack as a member of the Red Cross’s spiritual-care team, but the shooting has largely faded for members of her community back home. She has been responding to disasters since 9/11, she told me, but none has affected her as much as the Tree of Life shooting, in part because it happened at a synagogue. “As a bereavement counselor, I have found that year two is worse than year one,” she told me, reflecting on her work with survivors. “The mourning rituals are done, but grieving goes on forever.”", "description": "One year after the attack in Pittsburgh, survivors are grappling with a new reality: The rest of the country has moved on.", "authors": ["Emma Green"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/GUSTAFSON_SQUIRRELHILL_HIGHRES_9/facebook.jpg?1572286689", "published_at": "2019-10-28"}