{"pub": "chinadaily", "url": "https://language.chinadaily.com.cn/a/201910/15/WS5da531bea310cf3e355708bf.html", "downloaded_at": "2019-10-15 04:26:00.236036+00:00", "title": "Chinadaily.com.cn", "language": "en", "text": "2020年度国考网上报名10月15日8时正式启动。本次考试主要采取网上报名方式，报考者可在2019年10月15日8:00至10月24日18:00期间登录考录专题网站，提交报考申请，笔试时间定为2019年11月24日。\n\nCandidates review materials before the national civil servant exam at a test center in Nanjing, East China's Jiangsu province, on Dec 10, 2017. [Photo/VCG]\n\nChina plans to recruit about 24,000 civil servants to work for 86 central agencies and 23 institutions directly attached to them in the 2020 civil servant intake, the State Administration of Civil Service said Monday.\n\n国家公务员局10月14日表示，本次国考共计划招录2.4万人，涉及中央和国家机关86个单位、23个直属机构。\n\n【单词讲解】\n\n这里的intake表示某个机构或者某地在特定时间段“新招收或者新纳入的人”，比如，this year's intake of students（今年招的学生），annual intake of immigrants（每年接收的移民）等。此外，intake也可以表示 (食物、饮料、空气等的)摄取量,吸入量，比如，daily salt intake（每天的盐摄入量）， intake of alcohol（饮酒量）等。\n\nThe recruitment, the first after the country's civil servant law was revised, offers more vacancies than about 14,500 last year.\n\n这是新修订的公务员法实施后第一次中央机关及其直属机构公务员招考，招录规模较上年的1.45万余人大幅增加。\n\n\n\n根据国家公务员局的介绍，本次招录有三大特征。\n\n首先突出政治要求，将政治素质（political integrity）考查贯穿始终。\n\n其次，坚持基层导向，招考政策和录用计划向基层一线倾斜。\n\nThe majority of the positions in Party and government agencies above the provincial level will require two years of grassroots work experience, according to the administration.\n\n公告显示，中央机关及其省级直属机构主要招录具有2年以上基层工作经历的人员。\n\nMore than 2,700 vacancies will be open only to those working in some primary-level projects, as well as veterans who have college degrees and served for a minimum of five years.\n\n有2700余个计划定向招录服务基层项目人员，以及在军队服役5年(含)以上的高校毕业生退役士兵。\n\n此外，推进分类考录，进一步提高选人的精准性科学性。\n\nCandidates will be evaluated based on their overall performance in the written tests, a physical examination and an internship.\n\n根据考试成绩、体检结果和考察情况等，择优确定拟录用人员。\n\n\n\n【相关词汇】\n\n党和国家机构改革 reform of Party and State institutions\n\n转变政府职能 transform government functions\n\n简政放权 streamline administration and delegate powers\n\n服务型政府 service-oriented government\n\n\n\n参考来源：中新网\n\n（中国日报网英语点津 Helen）", "description": "本次国考招考政策和录用计划向基层一线倾斜，鼓励引导优秀高校毕业生报考基层职位。", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/15/5da531bea310cf3e97a14874.jpeg", "published_at": "2019-10-15"}