{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7545101/Alfre-Woodard-poses-Clemency-director-Chinonye-Chukwu-Valley-Film-Festival.html", "downloaded_at": "2019-10-07 06:54:59.503462+00:00", "title": "Alfre Woodard poses with Clemency director Chinonye Chukwu at Mill Valley Film Festival", "language": "en", "text": "Clemency star Alfre Woodard and director Chinonye Chukwu were snapped Sunday at the Mill Valley Film Festival in San Rafael, California.\n\nThe 66-year-old actress looked stunning in an embroidered black dress with a sheer shoulder panel, and black sandals at the Northern California venue, which sits north of San Francisco.\n\nThe Tulsa, Oklahoma native, who stars opposite Jason Momoa in the Apple TV series See, had her wavy brown locks parted at the cinematic event and carried a black clutch.\n\nAt the movies: Clemency star Alfre Woodard and director Chinonye Chukwu were snapped Sunday at the Mill Valley Film Festival in San Rafael, California\n\nChukwu wore a sharp seasonal ensemble, perfect for autumn, of a plaid grey jacket over a black top with brown slacks and khaki heels.\n\nShe had her hair parted to the side, and wore a light layer of makeup for a flawless look in the Bay Area.\n\nThe film entered the festival with considerable buzz following its Grand Jury Prize win at Sundance Film Festival earlier this year, and a strong reception at the Toronto International Film Festival last month.\n\nIn it, Woodard - who was nominated for an Academy Award for her performance in 1983's Cross Creek - portrays prison warden Bernadine Williams, who is battling demons after years of overseeing executions at the facility amid the slated execution of inmate Anthony Woods (Aldis Hodge).\n\nFashionista: The 66-year-old actress looked stunning in an embroidered black dress with a sheer shoulder panel, and black sandals at the Northern California venue\n\nMomentum: The film entered the festival with considerable buzz following its Grand Jury Prize win at Sundance Film Festival earlier this year\n\n'Clemency observes the psychological and emotional journey of a prison warden as she struggles with the professional responsibility of carrying out death penalty executions,' Chukwu told Women And Hollywood in a January interview. 'Writing and directing this film was a multi-year soul journey that was transformative and emotionally exhausting.\n\n'Having to dig deep into the subject matter and the depth of human emotion explored in the film was challenging at times, but absolutely necessary.'\n\nClemency is slated to hit theaters December 27.\n\nFocused: The feted actress gave an interview at the California-based film festival\n\nStalwart: Woodard has appeared on popular TV shows such as Luke Cage, Desperate Housewives and Empire", "description": "The film entered the festival with buzz following its Grand Jury Prize win at Sundance Film Festival earlier this year, and a strong reception at the Toronto International Film Festival last month.", "authors": ["Adam S. Levy For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/06/19381980-0-image-a-120_1570427334726.jpg", "published_at": "2019-10-07"}