{"pub": "businessinsider", "url": "https://businessinsider.co.za/south-african-security-industry-surge-in-bodyguard-and-private-investigator-companies-2019-10", "downloaded_at": "2019-10-28 13:31:47.553896+00:00", "title": "The number of registered companies offering body guards in SA has surged – and there are a lot more private investigators around too", "language": "en", "text": "South Africa now has more than 460,000 registered private security officers, according to numbers from a regulator. That is up only slightly from last year.\n\nBut some sectors have seen huge jumps in the number of registered companies offering security services, such as manufacturing security equipment and watching cars.\n\nThe number of providers offering body guards and the number of private investigators registered also increased by more than a third in one year.\n\nFor more stories go to BusinessInsider.co.za.\n\nSouth Africa has seen a big jump in the number of registered companies offering body-guarding services, security consultants, and private investigators, numbers from a sector regulator show – even though the number of security guards employed seems to have flattened out.\n\n\n\nIn the current financial year it has 463,833 security officers registered in South Africa, the Private Security Industry Regulatory Authority (PSIRA) says in numbers accompanying a new discussion document dealing with the levies paid to PSIRA.\n\nThat is up 1.15% from last year.\n\nBut while the number of registered security guards was flat, the overall number of registered security companies grew faster; there are now 9,865 such companies, PSIRA said, an increase of a little under 7%.\n\nThe number of companies registered to provide specific subsets of security services increased faster still – in some cases far faster – as existing operators expanded their offerings and new players moved in on various markets.\n\nSecurity hardware saw the biggest jumps in registrations; South Africa now has well over a thousand manufacturers of security equipment, PSIRA's numbers show, an increase of 64% in the space of a year, while companies that install security equipment also jumped by 40% to well over 2,000.\n\nAlso up by more than 40% is the number of service providers that watch cars.\n\nMore personal services relating to security also saw big surges. There are now 2,739 companies in South Africa that offer body guards, PSIRA says, up 32% from last year. Companies that bill themselves as security consultants also increased by 32%. Registered private investigation firms, meanwhile, jumped by 38% to 1,810 businesses.\n\nBy contrast, the number of companies registered for standard guarding services increased by less than 10%, and the number of businesses that hire out guards for cash-in-transit services increased by 12.5%.\n\nReceive a daily email with all our latest news: click here.", "description": "There are a lot more companies involved in watching cars, manufacturing security equipment, and offering security consulting too, even as the total number of security officers in South Africa remained roughly stable at just above 460,000.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7983/8fd7ac35cb1a40099b9f1257ea782fc5.jpg", "published_at": "2019-10-28"}