{"pub": "japantoday", "url": "https://japantoday.com/category/world/cheers-erupt-outside-parliament-as-brexit-delayed-again", "downloaded_at": "2019-10-20 00:11:45.846303+00:00", "title": "Cheers erupt outside British Parliament as Brexit delayed again", "language": "en", "text": "By MIKE CORDER\n\nA sea of protesters was across the street from Parliament when word arrived that lawmakers in the House of Commons had forced another delay in Britain's protracted Brexit battle.\n\nParliament Square, awash in European Union flags, erupted in cheers.\n\n\"Fantastic news,\" said Paul Craddy, who had traveled from Bristol in western England to join hundreds of thousands of people in a march calling for a \"people's vote\" on Brexit.\n\n\"We need another vote, we need another say now we know what the facts are,\" the 38-year-old consultant said.\n\nThe march came as lawmakers held their first Saturday sitting since 1982 to debate Prime Minister Boris Johnson's divorce settlement with the EU. They voted 322-306 to withhold their approval on the Brexit deal until legislation to implement it has been passed.\n\nJohnson vowed to press on and said he planned to introduce Brexit-implementing legislation to Parliament on Monday. He implied he would request a three-month delay as required but argued against any postponement.\n\nThe latest delay was welcome news for those who poured into London to call for a new nationwide vote on the deal.\n\n\"Another chance for sanity and perhaps rationality to take over, rather than emotion,\" filmmaker Jove Lorenty said as he stood outside Parliament. \"Never give up until the fat lady sings. No one knows what will happen, but we have hope.\"\n\nOrganizers of the noisy but peaceful march said 1 million people took part.\n\nPolice monitoring the protest tweeted: \"We don't provide estimates of numbers as it's such an inexact science. However it is fair to say it is now very busy throughout the procession route.\"\n\nIt was a typically British understatement.\n\nMany in the march were unable to reach Parliament Square because roads were packed with people, from parents with young children to elderly people in wheelchairs.\n\nIn one side street, a group of demonstrators with bells strapped to their legs and wielding sticks put on a traditional folk performance known as a Morris dance and chanted: \"Morris, not Boris!\" to cheers from onlookers.\n\n\"Demos that are fun and joyful are more effective,\" said one of the dancers, Kate Fisher.\n\nElsewhere, the mood was less ebullient.\n\nSarah Spoor, who cares for her two children with disabilities and fears shortages of medicines and medics from the EU if Brexit goes through, choked back tears as she said she was \"distraught\" at the prospect of Britain's departure.\n\n\"It feels like it's coming to the last hurrah before the end. I am devastated,\" Spoor said.\n\nSue Penn, a 58-year-old retiree from Herefordshire close to England's border with Wales, came to London with dozens of people packed into a four-vehicle convoy.\n\n\"I'm more politically aware than I've ever been before. And more angry,\" she said as she marched toward Parliament. \"I don't think we can revoke or cancel Brexit. I think we should give the people another say.\"\n\n© Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "A sea of protesters was across the street from Parliament when word arrived that lawmakers in the House of Commons had forced another delay in Britain's protracted Brexit battle. Parliament Square, awash in European Union flags, erupted in cheers. \"Fantastic news,\" said Paul Craddy, who had traveled from Bristol in…", "authors": ["Burning Bush", "Simon Foston"], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/47/b4/8be42f38df103adcf742c9802959147b1e56/urn:publicid:ap.org:9d9db48f384147da80f31eb57181a957.jpg", "published_at": "2019-10-19"}