{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/11/book-review-the-hidden-nazi", "downloaded_at": "2019-10-11 20:08:23.344906+00:00", "title": "BOOK REVIEW: 'The Hidden Nazi'", "language": "en", "text": "ANALYSIS/OPINION:\n\n“He aimed for the stars, but hit London.”\n\nThat’s a well-traveled post-World War II joke involving Wernher von Braun, the former Nazi rocketry wizard who escaped the advancing Russians and with a number of his fellow scientists was resettled here under Operation Paperclip, contributing significantly to our missile and space programs. (As the authors show, he was also an ardent Nazi. But that’s another story.)\n\nIn the case of SS Gen. Hans Kammler, the subject of “The Hidden Nazi,” the authors believe a similar escape was possible, for similar reasons. The last SS general to be created during WWII, he was responsible for overseeing construction of the slave labor and concentration camps, personally altering the design of Auschwitz to make it a more efficient center of mass murder.\n\nHe was a favorite of Himmler’s, and toward the end of the war, when Himmler persuaded Adolf Hitler to bring the guided missile program under SS control, Kammler was named head of all missile projects. In that capacity, in effect functioning as the official to whom von Braun and his fellow scientists reported, including scientists working on an atom bomb, it’s probable that he had information worth trading for a timely disappearance.\n\nAt any rate, that’s what he did — disappear, totally and completely. Shortly after the war ended, at the insistence of his wife, he was declared officially dead, with an aide testifying to his suicide in Czechoslovakia, but offering no proof of death, military or civilian, of any kind. Nor has a body ever been found.\n\nTumultuous times, to be sure. Nevertheless, it’s hard to believe that the man who had become one of the several highest remaining officials in the Third Reich could simply disappear without significant help.\n\nAnd that, in effect, the seemingly total and unrecorded disappearance of one the world’s last high-ranking Nazi war criminals — some say the third most powerful man in the Third Reich during the last days — is what set Dean Reuter, Colm Lowery and Keith Chester on the epic quest that structures this book.\n\nAs the historian Arthur Herman puts it, “until now no one had the knowledge, persistence and sheer nerve that the authors brought to the job of unlocking the multiple mysteries surrounding this evil genius of the Third Reich. “\n\nTo a great extent it’s a massive document hunt, pulled together with buried, lost or forgotten records, articles, histories, personal recollections, interviews — including a personal interview with Kammler’s remaining family by Dean Reuter — all blended and edited into a highly readable and coherent narrative, whether describing Nazi politics, the construction of killing machines or the various ways in which war criminals avoided justice.\n\nAmong their discoveries: Government documents from the period show that Kammler was in fact in American custody immediately after the war — for some time after his reported suicide. Was he intentionally kept shielded from public sight? Was there a deal made with the Nuremberg prosecutors by our government? If so, what was the quid pro quo? Did the material he traded appreciably benefit our armaments and space programs? And how and where did he assume his new identity?\n\nThere’s no doubt that German rocket expertise was further advanced than that of any other nation at the time, and members of their rocket team were highly prized by both our country and Russia. In fact, as “The Hidden Nazi” points out, the Russians had sent paratroopers to kidnap von Braun after he’d been taken into our custody. As the recovered document puts it, “When Dr. von Braun was taken by American troops in May 1945, a detachment of Russian soldiers attacked American troops holding Dr. von Braun, in an attempt to take him from American power.”\n\n“An insanely dangerous Russian action,” as Dean Reuter describes it, and to my knowledge not an action known to most students of history. But it does demonstrate just how valuable both sides considered von Braun and his rocketry to be during those Cold War years. And it may also demonstrate why von Braun’s boss, a much less savory character, was helped to find a country, probably somewhere south of the border, in which he’d be given a new identity and allowed to live out his retirement years.\n\nIf so, let’s hope his dreams were uneasy, and the justice meted out to Adolf Eichmann might have brought on nightmares.\n\n• John R. Coyne Jr., a former White House speechwriter, is co-author of “Strictly Right: William F. Buckley Jr. and the American Conservative Movement” (Wiley).\n\n• • •\n\nTHE HIDDEN NAZI: THE UNTOLD STORY OF AMERICA’S DEAL WITH THE DEVIL\n\nBy Dean Reuter with Colm Lowery and Keith Chester\n\nRegnery History, $29.99, 396 pages\n\nSign up for Daily Opinion Newsletter Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "\"He aimed for the stars, but hit London.\" That's a well-traveled post-World War II joke involving Wernher von Braun, the former Nazi rocketry wizard who escaped the advancing Russians and with a number of his fellow scientists was resettled here under Operation Paperclip.", "authors": ["The Washington Times Http", "John R. Coyne Jr."], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/11/SAXoPicture-068AA424-363259395_c0-0-877-512_s1200x700.jpg?63cf2d3b06eeff889bc917e4cbde03bc9981d194", "published_at": "2019-10-11"}