{"pub": "townhall", "url": "https://townhall.com/tipsheet/timothymeads/2019/09/13/border-patrol-has-arrested-more-than-400-ms13-gang-members-in-2019-n2553093", "downloaded_at": "2019-09-14 01:41:47.963096+00:00", "title": "Border Patrol Has Arrested More Than 400 MS-13 Gang Members In 2019", "language": "en", "text": "The United States Border Patrol Chief Carla Provost released data regarding the number of gang members apprehended by her men and women in her agency during the 2019 fiscal year through August. According to Provost, BP has arrested at least 445 individuals from the notorious Mara Salvatruchaa gang.\n\n\"This fiscal year through August, Border Patrol agents have encountered & arrested 933 criminal gang members. Some smuggling, some being smuggled, some sneaking in, and some already here,\" Provost tweeted.\n\nThese numbers include the following gangs:\n\nMS-13: 445 18th Street: 165 Paisas: 82 Surenos: 68 Latin Kings: 21 Tango Blast: 19\n\nThis fiscal year through August, Border Patrol agents have encountered & arrested 933 criminal gang members. Some smuggling, some being smuggled, some sneaking in, and some already here. A few:\n\n\n\nMS-13: 445\n\n18th Street: 165\n\nPaisas: 82\n\nSurenos: 68\n\nLatin Kings: 21\n\nTango Blast: 19 pic.twitter.com/LVj8gka4dm — USBPChief (@USBPChief) September 13, 2019\n\nAs I reported on Tuesday, feds recently arrested six illegal immigrants in relation to MS-13 gang violence after they allegedly killed an 18th Street gang member in Towson, Maryland\"\n\nBaltimore County police announced last week that six out of seven suspects arrested in a gruesome gang related murder of a 21-year-old Maryland man were illegal immigrants. Fox News reports that Daniel Alejandro Alvarado Cuella was stabbed to death in July by members of the Mara-Salvatrucha gang, aka MS-13. Cuella's body was found in a Towson apartment with multiple wounds on July 31.\n\nPresident Donald J. Trump has long called attention to the problem posed by MS-13. In 2017, he promised to deport every MS-13 gang member from the country:\n\n\"To any member of MS-13 listening, I have a message for you,\" the President said at the time. \"We will find you, we will arrest you, we will jail you, we will throw you the hell out of the country.\"", "description": ".09/13/2019 21:40:12PM EST.", "authors": ["Timothy Meads", "Matt Vespa", "Katie Pavlich"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/269/fa4c1b3d-01a4-485c-afdc-4f5ce04a4424.jpg", "published_at": "2019-09-13"}