{"pub": "metro", "url": "https://metro.co.uk/2019/10/13/archers-catch-joe-grundys-sad-goodbye-pig-wont-deed-10909005", "downloaded_at": "2019-10-13 08:43:33.150574+00:00", "title": "The Archers catch-up: Joe Grundy’s sad goodbye and a pig that won’t do the deed", "language": "en", "text": "The Archers took a sad turn this week as Joe finally met the maker\n\nThe passing of Joe Grundy finally came.\n\nDear old Joe passed away after a night on the cider at the annual cider pressing party.\n\nThe event almost didn’t take place when the old cider pressed they blagged from Elizabeth at Lower Loxley proved a difficult fix – but thanks to Ed and Will putting aside their swearing and bickering, they pulled it off.\n\nAfter much gnashing of teeth and customary whining, they pulled themselves together (see, they can do it) after reminiscing about how they once joyrode in grandpa Joe’s car across the farm together before crashing it.\n\nAhhh, such a heartwarming tale – and it worked, too.\n\nThe two managed to put their differences aside and work together to get the ancient press into shape ahead of the cider club’s grand pressing.\n\nIt was a fitting way to write Joe’s death into the script – he died doing what he loved, sleeping off a few bottles of scrumpy.\n\nAdvertisement\n\nAdvertisement\n\nThe scenes with Eddie and Joe were emotional – Eddie passes by Joe’s room to check on him after he slipped out early from cider club, only to find him dead in bed.\n\n’Oh, Dad. Is this why you left early?’ He says, simply.\n\nThe emotional speech that followed had many with less cold dead hearts than me in tears – a golden moment for the SWs and a classic, beautifully written Archers episode that brought out the best in everyone.\n\nElsewhere, if you will forgive the change of topic, Basil the pig still won’t get it up. Toby tried to get Kate to give an erotic massage to the beast but she was furious and chucked him out – she wasn’t about to massage a pig in order to get it to mate for meat.\n\nToby takes matters into his own hands and wafts an aromatherapy candle under Basil’s snout to get him in the mood. In classic Fairbrother form, he drops the candle into the stye, leaving Basil traumatised and even less frisky then before, if that’s possible.\n\nRex is furious – what next for Basil?\n\nPhilip and Kirsty get locked out and end up spending hours locked in with Joy, who bombards them with stories and videos of Rochelle. There needs to be some nuance to Joy at some point before she becomes too much of a caricature.\n\nmetro-tag-post-strip]\n\nIt was entertaining to introduce her as a garrulous Geordie with a penchant for butterfly buns and an obsession with her daughter, but she’s at risk of becoming two-dimensional. I’m sure there is more coming soon – but there is only so much we will swallow before she becomes a bore to us as well.\n\nAdvertisement\n\nAdvertisement\n\nI suspect she’s being built up before a big storyline – we shall have to wait and see. Meanwhile, have you seen what our Rochelle‘s show reel yet? You really must.\n\nThat’s if for now – we have butterfly buns to bake.\n\nJoin you next week for Joe’s funeral, Basil’s sex drive and more.\n\nAdvertisement Advertisement", "description": "The passing of Joe Grundy finally came. Dear old Joe passed away after a night on the cider at the annual cider pressing party. The event almost didn’t take place...", "authors": ["Deborah Arthurs"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/09/The-Archers-image-d36d_1570954891.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-13"}