{"pub": "cnn", "url": "https://bleacherreport.com/articles/2859366-former-nba-star-dwyane-wade-reaches-multiyear-contract-with-warnermedia?utm_source=cnn.com&utm_campaign=editorial&utm_medium=referral", "downloaded_at": "2019-10-23 10:01:03.667782+00:00", "title": "Former NBA Star Dwyane Wade Reaches Multiyear Contract with WarnerMedia", "language": "en", "text": "Sarah Stier/Getty Images\n\nFormer NBA superstar Dwyane Wade is joining WarnerMedia on a multiyear deal that will include NBA and NCAA basketball commentating for Turner Sports and working as a creative director for Bleacher Report.\n\nWade's 59th & Prairie Entertainment also landed an agreement with WarnerMedia to create additional projects, with details to be announced at a later date.\n\n\"I'm thrilled and grateful to be joining the WarnerMedia family with many exciting opportunities ahead,\" Wade said in a press release.\n\n\"I have great respect for TNT's team of analysts and their long-standing commitment to quality sports coverage. After 16 seasons in the NBA, I look forward to connecting with my fans in this new role and bringing my own perspective to the game I love.\"\n\nJeff Zucker, Chairman of WarnerMedia News and Sports, also commented on adding Wade.\n\n\"Dwyane is a special talent. He's a transcendent star with a charismatic, engaging and thoughtful personality on and off the court,\" Zucker said.\n\n\"We're thrilled to welcome him to the WarnerMedia family and we could not be more excited to partner with him on these special projects.\"\n\nPer a WarnerMedia press release, Wade will be \"making appearances at TNT's tent pole NBA events.\"\n\nFurthermore, the three-time NBA champion will work as an analyst alongside Shaquille O'Neal and Candace Parker on TNT's Tuesday evening coverage. He'll also join the studio for the NCAA men's basketball Final Four and national championship, which is jointly covered by Turner Sports and CBS Sports.\n\nWade has kept busy in his post-NBA life, partnering with winemaker Jayson Pahlmeyer to create Wade Cellars, a winery based in Napa, California, that launched in 2018.\n\nWade retired at the end of the 2018-19 season after a decorated 16-year NBA career that includes three NBA titles, 13 All-Star nods, eight All-NBA team appearances and the 2006 Finals MVP. He averaged 22.0 points, 5.4 assists, 4.7 rebounds and 1.5 steals per game.\n\nThe Miami Heat drafted Wade third overall out of Marquette in 2003. He averaged 21.5 points on 50.1 percent shooting in 2002-03 and led the Golden Eagles to a Final Four appearance.", "description": "Former  NBA  superstar  Dwyane Wade  is joining WarnerMedia on a multiyear deal that will include NBA and NCAA basketball commentating for Turner Sports and working as a creative director for Bleacher Report...", "authors": ["Paul Kasabian"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/834/539/hi-res-6af69e53fed4e87cd5af10a8e91158c1_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-10-22"}