{"pub": "dailybeast", "url": "https://thedailybeast.com/fox-news-hosts-scold-guest-buck-sexton-for-mocking-greta-thunberg-no-kid-bashing", "downloaded_at": "2019-09-19 23:06:41.950044+00:00", "title": "Fox News Hosts Scold Guest Buck Sexton for Mocking Greta Thunberg: 'No Kid Bashing!'", "language": "en", "text": "Conservative pundit Buck Sexton seemingly thought on Thursday afternoon that he was in a safe space to mock 16-year-old climate activist Greta Thunberg by appearing on Fox News. He apparently thought wrong.\n\nWhile sitting in as the lone male guest-host of Outnumbered—a woman-led daytime talk show—Sexton joined forces with co-hosts Dagen McDowell and Melissa Francis in ridiculing NBC News for launching a “climate confessions” section.\n\n“Climate change is a religious belief for people who think they’re too smart for religion,” Sexton declared. “They’re asking for forgiveness. Do you think there is a world where it makes a difference?”\n\nAfter Francis took an additional shot at NBC for their climate-change section, asserting that people “really don’t love sanctimony,” Sexton took the opportunity to take aim at Thunberg, who recently called on Congress to “listen to the scientists” on climate change.\n\n“The biggest weakness this stuff always has is the spokespersons for this movement. They also have this young girl who is, what, 16? We gonna ask her about the Fed rate next?” he snarked.\n\nImmediately, all three co-hosts, two of whom are overtly right-leaning, took Sexton to task for making fun of a teenager.\n\n“No picking on children,” Francis exclaimed.\n\nDagen McDowell added: “She’s a kid!”\n\nSexton, meanwhile, insisted he was not picking on Thurnberg but just expressing that he felt it was ridiculous for her to testify about climate change in front of Congress, prompting more shout-downs from the panel.\n\n“No kid bashing,” Francis declared.\n\nLiberal co-host Jessica Tarlov reiterated Francis’ point, further noting that Sexton shouldn’t be so cavalier to ridicule a “kid who is more alert to the challenges facing our planet than a great number of people.”", "description": "“No picking on children,” Melissa Francis exclaimed, while Dagen McDowell added: “She’s a kid!”", "authors": ["Justin Baragona"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1080,w_1920,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1568915963/outnumbered_27_zq9fkx", "published_at": "2019-09-19"}