{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/17/babylon-bees-satire-lumped-snopes-serious-news", "downloaded_at": "2019-09-17 23:30:29.398691+00:00", "title": "Babylon Bee stings left wing with satire, and fact-checkers are not amused", "language": "en", "text": "Here’s a faux headline you won’t see on any late-night comedy show: “Ocasio-Cortez Still Brainstorming Ways to Keep Detained Children From Getting Beds, Food.”\n\nAnd “Hillary Proposes Reparations to Anyone Who Ever Lost a Presidential Election to Trump.”\n\nIt’s a sample of what makes The Babylon Bee unique in comedy circles. It also has attracted the ire of a fact-checking website that treats The Bee like any other news source.\n\nThe Babylon Bee describes itself as a “trusted source” of Christian satire (Example: “Study: 78% of Worship Bands Could Use More Cowbell”). Still, the site’s scribes feed off the political cycle like most other modern humorists.\n\nThere is a catch, though, given the tenor of today’s political humor. They collectively mock left-of-center targets with the tenacity that Stephen Colbert and others reserve for Republicans.\n\nThis forum for Christian mockery is making waves for telling jokes most comedians won’t so much as whisper: “Ilhan Omar Blasts Israel for Refusing Palestine’s Generous Gift of Rockets.”\n\nBee Editor-in-Chief Kyle Mann said the site recently reached its highest traffic total to date. Political satire goes viral more easily than other content, said Mr. Mann, who joined The Bee after emailing submissions shortly after the site launched three years ago.\n\nPolitical gags are essential to the site’s brand along with pokes at preachers such as Joel Osteen, who has been mocked for his prosperity Gospel mantra. Beltway banter has drawn a larger crowd in recent months, yet Mr. Mann doesn’t draw a thick line between the two.\n\n“We need to be engaging in current events, to show the power of the Gospel in a way that brings down those idols,” he said.\n\nToward that end, the site doesn’t sink to profane gags like late-night TV’s bleep-a-thon products. While some comics use vulgarity to hammer home a punchline, Team Babylon employs “irony, contrast and absurdity” to make its mark, said Mr. Mann, co-host of the new Babylon Bee Podcast, which takes listeners behind the scenes at the site.\n\nIn recent weeks, Snopes has taken a particular interest in The Bee’s brand of satire. The veteran fact-checkers routinely examine Bee stories as if they were breaking news items from CNN or Fox News.\n\nThe Bee fired back in its inimitable way, mocking how Snopes underplayed former Vice President Joseph R. Biden’s recent flurry of gaffes: “Snopes Rates Biden’s Claim That 2+2=5 as ‘Mostly True.’”\n\nMr. Mann notes that Snopes also has fact-checked his site’s left-leaning competitor, The Onion, but with less vigor than his team endures.\n\n“Their fact-checks of The Onion always put the blame on readers for misunderstanding the satire and never imply that the writers of The Onion are trying to deceive people,” said Mr. Mann, adding that Snopes recently shared a study suggesting The Bee’s stories are “the most widely shared, ‘factually inaccurate content’ on the internet.”\n\nThe Snopes/Bee kerfuffle is about more than digital labels, Mr. Mann said.\n\n“As Snopes has repeatedly put us under the category of ‘Junk News,’ it’s incredibly concerning to us that Big Tech could lump us in with actual fake news and ban us or reduce our reach,” he said.\n\nThe Bee isn’t amused and is hiring legal representation to fend off the attacks.\n\nSnopes responded to a Washington Times request for comment initially but didn’t answer submitted questions or accept an invitation for a phone interview.\n\nWorth noting, The Bee’s political humor doesn’t pull punches when it comes to President Trump.\n\n“Trump Spends Afternoon Shouting From White House Balcony During Twitter Outage,” one recent headline declared. Another declared, “Trump Enraged as Immigrant Child Asks for More Gruel.”\n\nStill, Bee staffers don’t obsess over Mr. Trump like most other modern comics.\n\nBrandon Bassham, a writer for the libertarian-leaning We the Internet TV, said The Bee’s conservative bent serves a public pummeled by liberal comic tropes.\n\n“It’s long been said that conservatives can’t do comedy very well, but nowadays liberals can’t either,” Mr. Bassham said. “‘SNL,’ ‘The Daily Show,’ Samantha Bee … they’re all terrible. [They’re] not funny, and they’re basically shills for corporate Dems.”\n\nThe Bee works best, he said, when it mocks liberals. The site sometimes stumbles, though, when its “right-leaning slant” is too overt.\n\nEmmy-nominated writer Tony Daro applauds The Bee for taking on both sides of the political aisle. The site’s Christian satire, though, doesn’t impress the liberal comic.\n\n“Making fun of evangelicals, while noble, is like shooting fish in a barrel,” said Mr. Daro, who has written for “Saturday Night Live.”\n\nMichael Loftus, a conservative comic and part of the Freedom to Laugh Comedy Tour, said he pays the most attention to The Bee’s “smart” politically charged tweets.\n\n“It never seems mean. The jokes never appear to punch down,” said Mr. Loftus, who has written for the sitcoms “Anger Management” and “Kevin Can Wait.”\n\nIn its early months, The Bee published three or four stories a day. Now, readers might sample as many as nine stories in a 24-hour period. Faster can be better, particularly given the demands of a digital enterprise.\n\n“You have to be nimble in comedy and satire,” Mr. Mann said.\n\nIn the era of perpetual outrage, it’s hardly surprising some Bee readers recoil at a selection of its gags.\n\n“Every single piece we’ve ever written has had somebody upset. … If you’re getting really offended about satire, that just happens to be your sacred cow that’s tipped over,” Mr. Mann said. “We’re definitely not immune from that. … The left has the stereotype of being ‘snowflakes.’ We see it from both sides. Some of the craziest blowback we get is from taking on President Trump.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The Babylon Bee, which describes itself as a \"trusted source\" of Christian satire, is making waves for telling jokes most comedians won't so much as whisper.", "authors": ["The Washington Times Http", "Christian Toto - Special To The Washington Times"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2016/11/01/The_Babylon_Bee_c0-0-598-349_s1770x1032.png?15672e4720e21dd503f2ee4cdc1d413e3390289e", "published_at": "2019-09-17"}