{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-scotland-glasgow-west-50137960", "downloaded_at": "2019-10-22 16:03:11.066165+00:00", "title": "'Pick-up artist' Adnan Ahmed jailed for two years for threatening behaviour", "language": "en", "text": "Image caption Adnan Ahmed was convicted of five counts of threatening and abusive behaviour towards young women\n\nA so-called pick-up artist who targeted \"young and vulnerable\" women has been jailed for two years.\n\nAdnan Ahmed - who called himself Addy A-game - secretly filmed himself approaching dozens of women in Glasgow and Lanarkshire.\n\nAhmed was convicted last month of threatening and abusive behaviour towards five women.\n\nThe 38-year-old from Maryhill, Glasgow, has also been placed on the sex offenders register for 10 years.\n\nPolice launched an investigation after his actions were revealed by the BBC's The Social earlier this year.\n\nThe self-styled \"lifestyle coach\" would approach women in the street, often secretly filming the encounter and posting videos offering advice to other men.\n\nIn the videos, he offered tips on how to overcome \"last-minute resistance\" to sex. One clip included audio of a woman apparently recorded during sex.\n\nMedia playback is unsupported on your device Media caption Adnan Ahmed, also known as Addy A-game, approaches women in the street\n\nFive young women, aged between 16 and 21, gave evidence at his trial about how they had been intimidated by Ahmed in Glasgow city centre and in Uddingston, South Lanarkshire.\n\nPassing sentence, Sheriff Lindsay Wood said Ahmed - who has been on remand in prison since January - had shown a lack of remorse.\n\nHe told him: \"You gave evidence and said that the victims were lying or mistaken, but the jury thought otherwise.\n\n\"It was very obvious when they gave evidence how they were affected.\n\n\"You have acquired notoriety and an unenviable reputation, the public will be wise to such inappropriate behaviour by you and others like you.\"\n\nThe trial heard how Ahmed approached two schoolgirls in a secluded lane in Uddingston, South Lanarkshire, in 2016, when they were aged 16 and 17.\n\nHe called one of them \"pretty\", tried to get her phone number and made her feel \"uncomfortable\" but she walked away.\n\nImage caption Adnan Ahmed, appearing here in one of his online videos, claimed they were educational\n\nAnother woman broke down in court as she described how Ahmed followed her through Glasgow city centre and grabbed her head as he tried to kiss her.\n\nThe BBC investigation into Ahmed earlier this year revealed a wider pattern of predatory behaviour.\n\nAhmed was part of a global network of \"pick-up artists\" who practise what they call \"game\".\n\nYouTube has since removed hundreds of videos and deactivated two channels run by Addy A-Game and another group called Street Attraction following a BBC investigation into the online industry.\n\nA social worker who compiled a background report on Ahmed prior to sentencing described his behaviour as \"entrenched.\"\n\nDefence counsel Donna Armstrong said: \"The accused accepts he was convicted and will change the way he speaks to women.\"\n\nHis two-year sentence was backdated to January when he was first remanded in custody.", "description": "Adnan Ahmed targeted dozens of women on the streets of Glasgow and posted secretly-filmed videos online.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/15DE5/production/_105137598_a-gamepickupartistdwlfsq_frame_0.jpg", "published_at": "2019-10-22"}