{"pub": "yahoo", "url": "https://sports.yahoo.com/jon-gruden-approved-phone-conversation-172203981.html", "downloaded_at": "2019-09-10 02:21:03.399555+00:00", "title": "Jon Gruden approved use of phone conversation in Antonio Brown video", "language": "en", "text": "One of Antonio Brown‘s final acts during his time as a member of the Raiders organization was the release of a video on Friday night that included a recording of a conversation he had with Raiders head coach Jon Gruden.\n\nIn that conversation, Gruden called Brown “the most misunderstood f—ing human being” he’s ever met and asks him to “please stop this s–t and just play football” for the Raiders. It was unclear whether or not Gruden knew he was being recorded, but a report that he found it “awesome” suggested it wasn’t a problem for the coach.\n\nIt also seems that his involvement in the video didn’t come as a surprise. During an appearance on The Dan LeBatard Show, the video’s producer Alejandro Narciso said that Gruden approved the use of the conversation in the video before Brown posted it on social media.\n\nThat seems to fit with Gruden’s generally accommodating nature when it came to Brown during his time in Oakland, but none of it proved to be enough to make it to the start of the regular season with the wideout in the fold.", "description": "One of Antonio Brown's final acts during his time as a member of the Raiders organization was the release of a video on Friday night that included a recording of a conversation he had with Raiders head coach Jon Gruden. In that conversation, Gruden called Brown \"the most misunderstood f--ing", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/TC2AiVidpYytbQfO2rjiNg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMzg7aD02OTY-/https://s.yimg.com/uu/api/res/1.2/QDxMIi3Ktm7P4vdk1NCbmA--~B/aD0zNDg7dz02MTk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/profootballtalk.nbcsports.com/8bc34242a93fec6d2ba3b6cb70a72b5e", "published_at": "2019-09-09"}