{"pub": "news24", "url": "https://channel24.co.za/Gossip/News/ricky-martin-gushing-as-he-announces-baby-number-four-will-make-your-day-20190930", "downloaded_at": "2019-10-30 07:54:37.277864+00:00", "title": "Ricky Martin gushing as he announces baby number four will make your day", "language": "en", "text": "Ricky Martin gushing as he announces baby number four will make your day\n\nCape Town – Ricky Martin and Jwan Yosef are getting ready for baby number four!\n\nAccepting the HRC Visibility Award for his advocacy of LGBTQ rights as well as his philanthropic efforts, he said at the 23rd annual Human Rights Campaign National Dinner in Washington D.C. on Saturday, \"By the way, I have to announce that we are pregnant.\n\n\"We're waiting,\" he said, putting his hand over his mouth, giggling, as the audience erupted in cheers.\n\nWATCH HIS ADORABLE REACTION TO HIS OWN NEWS HERE:\n\nAt #HRCNationalDinner, @Ricky_Martin announces that he and husband\n\nJwan Yosef are expecting a new addition to their family.\n\nCongratulations, Ricky and Jwan! #BabyOnBoard! ?? pic.twitter.com/ngpqk0Rdhg — Human Rights Campaign (@HRC) September 29, 2019\n\nThe 47-year-old married Jwan Yosef in 2017 and the couple is raising three beautiful babies together – twins Mateo and Valentino and baby girl, Lucia.\n\nIn his speech, he also spoke of his life for his family and how they inspire him to keep going.\n\n\"My family is here,\" he said. \"My husband, Jwan, I love you. My beautiful twins, Valentino and Mateo, they're also here. I love you with all my heart. You're my strength. You inspire me every day, you motivate me to keep doing what I'm doing. You guys are amazing kids. You guys are amazing, I love you. Lucia, my baby girl, is not here with us – she stayed at home with grandma. But she's also the light of my life.\"\n\nWhen the Livin' la Vida Loca singer first revealed the couple welcomed a baby girl at the end of 2018, he said the entire family had \"fallen in love with Lucia\", and they couldn't wait to see \"where this stellar baby\" would take them.\n\nWe're sure they'll feel the same and they're beyond thrilled to make it a Martin-Yosef party of five!", "description": "\"By the way, I have to announce that, we are pregnant, we are waiting...\"", "authors": ["Bashiera Parker", "Bparks_"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/126/4d6de5f8a2254638a34a00d1671a9363.jpg", "published_at": "2019-09-30"}