{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/eastenders-fans-tears-jean-slater-20554290", "downloaded_at": "2019-10-11 00:22:39.514231+00:00", "title": "EastEnders fans in tears as Jean Slater discovers Daniel is dead", "language": "en", "text": "Get the biggest soaps stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nEastEnders viewers were left in tears tonight as Jean Slater discovered that her love interest Daniel had died.\n\nOver the last few months, fans have been left touched by Daniel, played by Ade Edmonson, and Jean's blossoming friendship and romance in the cancer ward.\n\nThe pair were initially at odds with one another due to Daniel's cynical outlook on life.\n\nTonight, Jean spoke warmly about how she wanted her family, and most importantly Stacey, to meet Daniel.\n\n(Image: BBC)\n\n(Image: BBC / Jack Barnes)\n\nHowever Jean discovered the devastating news that Daniel was dead after a heartbreaking phone call from his friend.\n\nAs Kat and Mo asked what was wrong, Jean replied: \"That was Daniel's neighbour. He went for a drink with him on Monday night and he found him... found him dead.\"\n\n(Image: BBC)\n\n(Image: BBC)\n\nStruggling to take in the news, Jean continued: \"Daniel's dead.\"\n\nFans flocked to Twitter to comment on the heartbreaking scene.\n\nOne tweeted: \"Aw Jean finding out Daniel’s died is heartbreaking, she finally had some happiness and he’s gone #eastenders.\"\n\nWhile another remarked: \"Aww noo. Daniel's dead. I loved @AdrianEdmondson in #EastEnders.\"\n\nA third remarked: \"Poor Jean, her and Daniel would have been such an adorable couple.\"\n\n*EastEnders returns tomorrow at 8pm on BBC One", "description": "Eastenders fans have been left touched by Daniel, played by Ade Edmonson, and Jean's blossoming friendship and romance in the cancer ward", "authors": ["Rose Hill", "Image", "Bbc", "Jack Barnes"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20554301.ece/ALTERNATES/s1200/0_101019EE-fans-in-tears-as-Jean-discovers-Daniel-is-dead_5812JPG.jpg", "published_at": "2019-10-10"}