{"pub": "washingtonpost", "url": "https://washingtonpost.com/technology/2019/09/16/drug-dealers-are-peddling-steroids-facebook-youtube", "downloaded_at": "2019-09-16 11:59:44.600906+00:00", "title": "Drug dealers are peddling steroids on Facebook and YouTube", "language": "en", "text": "\n\nResearchers uncovered pages, accounts and videos promoting or selling steroids, which are illegal without a prescription, on Twitter, YouTube and Facebook. (AP/AP)\n\nDrug dealers are turning to Facebook and other popular social media sites to peddle steroids, which are illegal without a prescription, raising more questions about whether the companies are properly policing their platforms.\n\nThose substances are being aggressively sold or marketed through posts and videos on sites including Facebook, Instagram, YouTube and Twitter, according to new research by Internet safety nonprofit group Digital Citizens Alliance and cyberintelligence firm GiPEC. During the first half of the year, the researchers say they found more than 100 examples of such pages or posts.\n\nPages, groups and videos pushing steroids and other performance-enhancing drugs could be found through searching for keywords like Human Growth Hormone or Humatrope. Once users land on one of those pages, dealers push using the drugs and may include a way to contact them, like an email address or WhatsApp number.\n\nEven as recently as this week, more than a dozen Facebook pages, YouTube videos and an Instagram account were selling or promoting prescription steroids and other appearance enhancing drugs. After a Washington Post inquiry, the social media companies removed the pages and posts for violating their terms of service, which prohibit illegal drug sales.\n\nThe posts turn devices into drug dealers, said Tom Galvin, Digital Citizens Alliance executive director. “Parents should know that,” he said. Their kids are “gaining access to this online on sites that are mainstream.”\n\n[Google and Amazon list gun accessories for sale, in apparent violation of their own policies]\n\nThe sale of these types of drugs is just the latest example of harmful and illicit content proliferating on social networks. Disinformation, hate speech and illegal sales continue to plague the sites, despite efforts to better moderate content both with thousands of humans and improved algorithms.\n\nAmazon and Google recently were selling firearm and gun accessories on their sites in apparent violation of their own policies. YouTube, Facebook and Twitter played Whac-a-Mole after the Christchurch shooting in New Zealand, when the shooter’s video surfaced and was disseminated across the Web. And Twitter, Facebook and YouTube recently said they removed hundreds of accounts that appeared to be a concerted Chinese effort at spreading political discord regarding protests in Hong Kong.\n\nThat has led some industry critics to question whether the companies are doing enough.\n\n“The model of moderation that platforms use is structurally inadequate to the task,” said Roger McNamee, a Facebook investor who has become one of the most prominent critics of Big Tech. “It appears that the moderation is not actually designed to eliminate those things, it's designed to eliminate the political blowback.”\n\n[The New Zealand shooting shows how YouTube and Facebook spread hate and violent images — yet again]\n\nFacebook, which also owns Instagram, said it removes content that violates its policies as it finds them. “Our Community Standards make it very clear that buying, selling or trading drugs, which include steroids, is not allowed anywhere on Pages, in advertising, or anywhere else on Facebook,” said Facebook spokeswoman Crystal Davis.\n\nYouTube said it removed 90,000 videos for violating its “harmful or dangerous policy” in the second quarter of 2019, and the company works closely with experts, including emergency room doctors and pediatricians, to develop its policies. “We’ve been investing in the policies, resources and products needed to live up to our responsibility and protect the YouTube community from harmful content,” YouTube spokesman Farshad Shadloo said.\n\nTwitter spokeswoman Katie Rosborough pointed to the company’s existing policies, which state Twitter can’t be used for “any unlawful purpose or in furtherance of illegal activities.”\n\n[YouTube disables more than 200 channels for inauthentic activity around Hong Kong protests]\n\nSteroids have previously surfaced as a social media problem. Digital Citizens Alliance first researched the issue in 2013, finding that steroids were being sold on YouTube. Immediately following the report, it appeared the company cracked down. (DCA receives funding from telecommunications, pharmaceutical and tech organizations, as well as some members of the Motion Picture Association of America.)\n\nYouTube, which is part of Google, said it has taken a number of steps to reduce the spread of “borderline content and videos” on its site in recent years.\n\nThe researchers, including Eric Feinberg, the chief executive of New York-based GiPEC, decided to revisit the topic after noticing last year that steroids continued to be sold on the platforms. “They continue to turn a blind eye,” he said.\n\n[Content moderators at YouTube, Facebook and Twitter see the worst of the web — and suffer silently]\n\nIn some cases, the content surfaced to researchers as “Suggested Pages” or “Recommended Videos” they might like due to their searches. While YouTube has recently launched features attempting to reduce illicit content, it only works on English-speaking videos. The researchers found suggested steroid videos alongside videos in foreign languages like Arabic, according to screen shots reviewed by The Post.\n\nIn one example, a Facebook page called “Landmarkchem Raw steroid powders, HGH, peptides & semi-finished for sale” offered a variety of steroids via Facebook’s “shop” function, which is intended to help merchants sell products. The button directed people to the Facebook page of “Lucky Li,” whose email address and Skype name were also listed on the page.\n\nThe researchers contacted Landmark through an email address found on Facebook, and they were offered a wide range of drugs that are supposed to require a prescription, according to emails reviewed by The Post. The emails also gave instructions for administering the drugs.\n\nThe researchers purchased two vials labeled Human Growth Hormone, a substance that is often abused to enhance muscle mass or athletic performance, and three vials of an anabolic steroid known as Deca Durabolin, which is only available with a prescription due to potential side effects such as liver damage. The researcher paid about $360 for the drugs via the PayPal-owned platform Venmo. (Such a transaction violates Venmo’s terms of service.)\n\n[YouTube’s arbitrary standards: Stars keep making money even after breaking the rules]\n\nDrug testing showed that the Deca Durabolin appeared to be legitimate, but the HGH was not — leaving questions about what they were sold.\n\nSteroids can be used to enhance appearance as well as athletic performance.\n\n“It seems like a cruel irony that the same platforms that are fueling a desire to look like celebrities in the social media age are also the platforms that people turn to reshape their body to look like celebrities,” Galvin said.\n\nAdvocates against steroid abuse are calling on the tech companies to do more to stamp out the sales on their platforms.\n\nDonald Hooton Sr., the executive chairman of the Taylor Hooton Foundation, fights steroid abuse in memory of his son. The new research illustrates just how much the issue of steroid abuse has evolved, he said. His son Taylor, a successful high school student athlete whose death was linked to steroid abuse more than 15 years ago, found his dealer while working out at the local YMCA.\n\nHooton Sr. said he was concerned that parents don’t realize such sales could now be happening on their children’s devices, and he called on the tech giants to do more.\n\n“There is no doubt in my mind that they’ve got the capability, engineering skills and the wherewithal to get this crap stopped, to prevent this from going on their platform,” he added.", "description": "The sale of illicit wares across social media platforms raises questions about how well the tech giants are policing their sites.", "authors": ["Cat Zakrzewski", "Technology Policy Reporter", "September At Am", "Cat Zakrzewski Is A Technology Policy Reporter", "Authors The Washington Post'S Technology Newsletter."], "top_image": "https://www.washingtonpost.com/resizer/SkxEzuBp8G73ZgM7UGzpie3XYbM=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/Q7GNBCCKLEI6TDH4FROQTGOCDY.jpg", "published_at": "2019-09-16"}