{"pub": "bbc", "url": "https://bbc.com/news/world-africa-49971678", "downloaded_at": "2019-10-27 03:59:33.930383+00:00", "title": "Libya in chaos as endless war rumbles on", "language": "en", "text": "Image copyright Getty Images\n\nFor almost a decade the Libyan capital, Tripoli, has seen a kaleidoscope of conflict.\n\nThe heady days of the revolution of 2011 - which unseated long-time ruler Muammar Gaddafi - are long gone.\n\nIn the ensuing years there has been a Libya-like rendition of the TV series Game of Thrones, all about violent power struggles, involving competing militias, rival governments and, increasingly, foreign players.\n\nIn the capital these days the distant thud of battle punctuates the rumble of the traffic, but the streets are busy. This is a city fuelled by oil, coffee and resilience.\n\nThe latest round of battle began in April when a renegade commander, General Khalifa Haftar, led forces from his power base in eastern Libya to make an assault on Tripoli in the west.\n\nHe heads the self-styled Libyan National Army, and already controls most of the country. But six months on, Tripoli still eludes the moustachioed military strongman, who is backed by the Tobruk-based government. He is stuck on the southern outskirts of the city.\n\n'Casually tossing a grenade'\n\nGen Haftar has been held off by an array of militias - which often fight each other - now fighting under the banner of Libya's Government of National Accord (GNA).\n\nIt is backed by the UN, but its writ barely runs inside Tripoli, much less outside it. It is struggling to keep the lights on and the water running, even in the capital.\n\nMedia playback is unsupported on your device Media caption Over the last six months at least 1,000 people have been killed, including around 100 civilians and 120,000 displaced\n\nDuring a recent visit to Libya we travelled by pick-up truck through battle-scarred suburbs to reach the lines of the frontline.\n\nThere had been little movement since our last trip in April. At moments it felt like 2011 once again, with young volunteers in flip-flops risking death from the enemy - and themselves.\n\nOne fighter casually tossed his rocket-propelled grenade into the front seat of a truck - after he had tried and failed to fire it.\n\nYearning for peace\n\nThe commander, Salem Bin Ismail, a slight, softly-spoken figure in a camouflage T-shirt, pointed down a deserted road to Gen Haftar's forces, just 500m (1,650ft) away.\n\nFor this veteran of the Nato-backed uprising against Gaddafi, the current conflict is about preventing a return to authoritarian rule in Libya.\n\n\"We have had chaos since 2011. I hope this is the last of the wars. We fought against Gaddafi to get rid of military control. Circumstances led us to fight again,\" he said.\n\n\"We want ballot boxes and elections and civilian rule. We believe in democracy,\" he added.\n\nGen Haftar: A man of many wars\n\nImage copyright AFP\n\nAt age 26 helped Gaddafi overthrow monarchy in 1969\n\nFought against Israel in 1973 Yom Kippur war\n\nLed Libyan troops fighting in Chad in 1980s\n\nCaptured by Chad's army in 1987; disowned by Gaddafi\n\nDefected to the US after release in 1990; lived close to CIA headquarters\n\nReturned to Libya after Gaddafi's overthrow in 2011\n\nNow regarded as Libya's most powerful military commander\n\nBacked by the Tobruk administration that includes the parliament elected in 2014\n\nAlso supported by Egypt's ruler, Gen Abdul Fattah al-Sisi\n\nSaid to have ambitions to become \"the Sisi of Libya\"\n\nProfile: Khalifa Haftar\n\nFor many who defend Tripoli it is more a case of opposing Gen Haftar than backing the GNA - and there are plenty in the capital who support neither.\n\nBut Gen Haftar has powerful friends abroad, including Egypt, the United Arab Emirates (UAE) and Russia. Increasingly the battle for Tripoli is another proxy war in the Middle East.\n\nParallels with Syria\n\n\"This conflict is largely sustained by the foreign powers backing Haftar,\" said Emad Badi, a Libyan non-resident scholar at the US-based Middle East Institute.\n\n\"People give Haftar too much credit. He has become a conduit for foreign powers. I think that the decisions are beyond him,\" he added.\n\nThe GNA too has foreign supporters - Turkey and Qatar - but the big guns are on the other side.\n\n\"Numerically the number of states that are supportive or leaning towards Haftar are a lot more, and have a lot more political capital than Turkey and Qatar,\" said Mr Badi.\n\nImage copyright Getty Images Image caption Numerous attempts to negotiate an end to the conflict have failed\n\nHe believes that even if Gen Haftar manages to enter Tripoli he will not be able to get control of the city, and the battle may drag on, like other long-running wars in the region.\n\n\"If you look at Syria and Yemen, some of the same powers are involved,\" said Mr Badi.\n\n'Burying young people daily'\n\nAs foreign players stoke the conflict, Tripoli counts the cost. The World Health Organization (WHO) says that since April, at least 1,000 people have been killed, including around 100 civilians, and 120,000 displaced.\n\n\"Every day we are burying young people who should be helping us build Libya,\" said Fathi Bashagha, the GNA's interior minister.\n\nHe accused the international community, including the UK, of failing to support the country since 2011.\n\n\"They did not complete the project. They wanted to remove Muammar Gaddafi but they should have supported us to rebuild a country, and to rebuild the army. Instead they left us.\"\n\nThe minister said that with the government focused on the defence of Tripoli, the militant Islamic State (IS) group and al-Qaeda can take advantage of the vacuum.\n\n\"They will use this chance. They can grow now in the desert, and they can move, and nobody can stop them,\" said Mr Bashagha.\n\nAnd he warned of another danger - that Libya will descend into all-out civil war if the conflict continues.\n\n'Existential threat'\n\nThere have been warnings too from German Chancellor Angela Merkel, who said recently that Libya is starting to resemble Syria.\n\nShe is pushing for an international peace conference before the end of the year.\n\n\"It's imperative we do everything we can to make sure this does not escalate into a proxy war,\" she said.\n\nReports of Russian mercenaries, Egyptian military advisers, and Emirati drones in Libya all indicate it may be too late for that.\n\nYou may also be interested in:\n\nThe former UK ambassador to Libya, Peter Millett, expects the German conference to take place, but says progress on the ground is probably a long way off.\n\n\"Haftar can't and won't win, but Egypt and the Emiratis can't afford to lose. The Egyptians want to control their Western neighbour, and they don't want terrorism on their border. For them it's existential,\" he said.\n\n\"For the Emiratis it's more about ideology. They think they can play a big role in Libya as they have in Yemen,\" he added.\n\nImage copyright Getty Images Image caption Buildings are being hit in air strikes\n\nIn the end though, Mr Millett believes the current stalemate will result in a \"raggedy ceasefire\", and exhaustion will lead to back-channel negotiations and some sort of political deal.\n\n\"There will have to be a carve up, and a sharing of oil resources. It will have to be clear that the people and the tribes of eastern Libya will benefit from the money.\"\n\nHe is encouraged by the fact that the UN special envoy for Libya, Ghassan Salamé - a seasoned negotiator - has remained in his post.\n\n\"If anyone can pull a rabbit out of a hat he can, said Mr Millett, \"but it won't be a good-looking rabbit\".", "description": "For years competing militias, rival governments and foreign players have been battling for control.", "authors": ["Orla Guerin", "Bbc News"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/100D1/production/_109354756_gettyimages-1139314226.jpg", "published_at": "2019-10-27"}