{"pub": "fox", "url": "https://foxnews.com/politics/ex-ambassador-says-ukraine-never-raised-quid-pro-quo-concerns-with-him-source", "downloaded_at": "2019-10-04 23:51:18.678672+00:00", "title": "Ex-envoy testified Ukraine never raised quid pro quo concerns with him: source", "language": "en", "text": "Former U.S. envoy to Ukraine Kurt Volker told lawmakers during closed-door testimony Thursday that the Ukrainians never indicated concerns to him about President Trump pursuing a quid pro quo -- linking military aid to an investigation of Joe Biden -- a source familiar with Volker’s transcribed interview told Fox News.\n\nThe question has become a pertinent one as House Democrats move forward with an impeachment inquiry into whether Trump abused his authority by asking Ukraine’s president to investigate Biden, the former vice president and a leading Democratic presidential primary candidate for the 2020 election.\n\nDemocrats, though, seized on text messages Volker released to Congress that show a top official involved in Ukraine matters later expressing concern that Trump was withholding military assistance -- as well as a meeting with the country’s president -- to encourage Ukraine to “launch politically motivated investigations.”\n\nTRUMP FIRES BROADSIDE AT ‘PILLAGING’ BIDENS, CLAIMS UKRAINE PUSH WAS ONLY ABOUT ‘CORRUPTION’\n\n“This is not normal or acceptable,” the committee chairmen -- Reps. Adam Schiff of the Intelligence Committee, Elijah Cummings of the Oversight Committee and Eliot Engel of the Foreign Affairs Committee – wrote in a letter to colleagues Thursday. “It is unethical, unpatriotic, and wrong. American Presidents should never press foreign powers to target their domestic political rivals.”\n\nThe text messages released by Volker to Congress show U.S. officials involved with Ukraine arguing internally last month over whether Trump was engaged in a quid pro quo. \"As I said on the phone, I think it's crazy to withhold security assistance for help with a political campaign,\" Chargé d’Affaires of the U.S. Embassy in Ukraine Bill Taylor said in one text exchange in a chain with Volker and U.S. Ambassador to the EU Gordon Sondland.\n\nBut Sondland pushed back. \"Bill, I believe you are incorrect about President Trump's intentions. The President has been crystal clear: no quid pro quo's of any kind.”\n\nVolker, who was Trump’s special envoy to Ukraine, abruptly resigned his post as U.S. special representative for Ukraine negotiations last week. He voluntarily gave a deposition on Thursday before a House committee as part of the House Democratic impeachment inquiry.\n\nVolker resigned last week after his name surfaced in a whistleblower complaint alleging that Trump sought to pressure Ukraine’s president to investigate Hunter Biden, his father and the company Burisma. Biden’s son was a Burisma board director until departing before Joe Biden announced his campaign for the presidency in April.\n\nFox News on Friday also obtained Volker’s prepared testimony to lawmakers on the Foreign Affairs, Intelligence and Oversight Committees. In it, he details his interactions with Trump lawyer Rudy Giuliani, who was probing whether Burisma had sought to garner influence with Biden by paying high fees to his son. He also said he didn’t find then-Prosecutor General of Ukraine, Yuriy Lutsenko, who he said was fueling those accusations about the Bidens, “credible.”\n\n“In May, 2019, I learned that former New York Mayor Rudy Giuliani planned to travel to Ukraine to look into these accusations,” Volker said. “I reached out to brief him before his visit – specifically, to tell him that Lutsenko is not credible and will be replaced once a new government takes office.”\n\nIn his testimony, Volker sought to distance himself from any investigation, saying, “at no time was I aware of or took part in an effort to urge Ukraine to investigate former Vice President Biden.” He also defended Biden’s integrity, saying, “I have known former Vice President Biden for 24 years, and the suggestion that he would be influenced in his duties as vice president by money for his son simply has no credibility to me.\"\n\nStill, the source familiar with Volker’s transcribed interview said the diplomat told lawmakers he didn’t believe a Ukrainian-led investigation related to Burisma or 2016 election interference, as Trump has also pressed for, would be improper. Volker also said he believes Trump's concerns about Ukrainian corruption were valid, the source said.\n\nFox News’ Mike Emanuel and Ronn Blitzer and The Associated Press contributed to this report.", "description": "Former U.S. envoy to Ukraine Kurt Volker told lawmakers during closed-door testimony Thursday that the Ukrainians never indicated concerns to him about President Trump pursuing a quid pro quo -- linking military aid to an investigation of Joe Biden -- a source familiar with Volker’s transcribed interview told Fox News.", "authors": ["Alex Pappas", "Alex Pappas Is A Senior Politics Editor At Foxnews.Com."], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/04/694940094001_6092110144001_6092107363001-vs.jpg", "published_at": "2019-10-04"}