{"pub": "washingtonpost", "url": "https://washingtonpost.com/nation/2019/10/13/fort-worth-police-officer-fatally-shoots-woman-her-home-while-checking-an-open-front-door", "downloaded_at": "2019-10-13 09:24:14.016013+00:00", "title": "Fort Worth police officer fatally shoots woman in her home while checking on an open front door", "language": "en", "text": "\n\nA frame grab from body camera footage provided by the Fort Worth Police Department. (Frame grab/Frame grab)\n\nA white Fort Worth police officer fatally shot a black woman in her home early Saturday morning, firing through a bedroom window while responding to a call about an open door at the residence, police said.\n\nOfficers were dispatched to the house in the city’s Hillside Morningside neighborhood at 2:25 a.m. Saturday after receiving an “open structure” call, according to a statement from the Fort Worth Police Department. A neighbor told the Fort Worth Star-Telegram he dialed a non-emergency line and requested a welfare check when he noticed that the door was ajar and the lights were on.\n\nWhile searching the outside of the house, police said, an officer saw someone standing near a window. “Perceiving a threat the officer drew his duty weapon and fired one shot striking the person inside the residence,” police said.\n\nAtatiana Jefferson, 28, was pronounced dead on the scene, according to police, who said the officers provided emergency medical care.\n\nBody camera footage released by police Saturday shows two officers walking quietly around the side of the house and peering through two screen doors, then moving down a driveway into a backyard.\n\nOne officer approaches a closed first-floor window and shines a flashlight inside, then swiftly raises his gun. “Put your hands up! Show me your hands!” he yells. A split-second later, he fires a shot through the window. He does not identify himself as an officer in the footage.\n\nAlong with the video, police released images of a firearm officers said they found at the scene, but did not indicate whether Jefferson was holding the weapon or positioned near it when the officer opened fire. Officials did not release the officer’s name, describing him only as a white male who has been with the department since April 2018. He will be placed on administrative leave pending an investigation, according to the department.\n\nThe shooting comes at a time when relations between law enforcement and black residents in the Dallas and Fort Worth area are already under strain following the recent trial of Amber Guyger, a white former police officer who shot and killed her unarmed black neighbor, Botham Jean, in 2018.\n\nEarlier this month, following an emotionally-charged courtroom saga that drew nationwide attention, a Dallas jury convicted Guyger of murder and sentenced her to 10 years in prison for killing Jean, whom she shot after mistaking his apartment for her own. Days after the sentencing, Joshua Brown, a key witness in the case, was shot and killed, stoking rumors that he was targeted because of his testimony. Police attributed Brown’s death to a drug deal gone bad and emphatically denied a connection to the Guyger case, but that has not quelled concerns from some local officials and activists, who have called for an independent investigation, as The Washington Post has reported.\n\n[The Amber Guyger case has sparked emotional fallout across Dallas]\n\nIt is not clear yet whether the officer who shot Jefferson will face criminal charges. Police said they will turn over body camera footage and other evidence from the scene to the Tarrant County District Attorney’s Office, which will decide whether to prosecute.\n\nLee Merritt, a prominent civil rights attorney in the Dallas area who said he is representing Jefferson’s family, said the officer never should have opened fire. Jefferson was at home with her 8-year-old nephew when she heard what she thought was a prowler outside the bedroom window, Merritt wrote in a Facebook post Saturday. When Jefferson went to the window to see what was happening, he wrote, the officer shot her.\n\nMerritt described Jefferson as a “beautiful peaceful woman” who had graduated from Xavier University and worked in pharmaceutical equipment sales. He said her mother had recently fallen ill and that Jefferson was taking care of the house while she was in the hospital. “There was no reason for her to be murdered. None,” he said. “We must have justice.”\n\nMerritt is also currently representing the families of Jean and Brown in Dallas.\n\n[Police name suspects, deny wrongdoing in death of Amber Guyger witness Joshua Brown]\n\nJefferson’s neighbor, 62-year-old James Smith, said he called police to the house in the early hours of Saturday because he thought it was unusual that the doors were open and the lights were on at that time of night. He told the Star-Telegram that he knew Jefferson and her nephew were home alone and wanted to make sure they were all right.\n\nWhen officers arrived, Smith said, they parked around the corner, out of view. Shortly after, he heard the gunshot and watched several more officers run in, he told the Star-Telegram.\n\n“I’m shaken. I’m mad. I’m upset. And I feel it’s partly my fault,” Smith said. “If I had never dialed the police department, she’d still be alive.”\n\nHe said: “If you don’t feel safe with the police department, then who do you feel safe with? Do you just ignore crime or ignore something that’s not right?\" pic.twitter.com/w7nvgtOIwy — Jack Howland (@JHowl04) October 12, 2019\n\nJefferson is one of at least 689 people who have been shot and killed by American police officers in 2019, according to a Washington Post database that tracks such shootings. Of those killed, fewer than three-dozen were female, and just four were black females, according to the database.\n\nFort Worth Mayor Betsy Price released a statement Saturday promising a “complete and thorough” probe of Jefferson’s shooting, as CBS News reported.\n\n“A young woman has lost her life, leaving her family in unbelievable grief,” Price said. “All of Fort Worth must surround Atatiana Jefferson’s family with prayers, love and support.”", "description": "The officer, who is white, shot Atatiana Jefferson, a 28-year-old black woman, through her window after \"perceiving a threat,\" police said.", "authors": ["Derek Hawkins", "National", "Breaking News Reporter", "October At Am", "Derek Hawkins Is A Reporter Covering National", "Breaking News. He Previously Covered Cybersecurity For Powerpost", "Wrote About Law", "Crime", "Politics For The Washington Post'S Morning Mix."], "top_image": "https://www.washingtonpost.com/resizer/CtfB8jkIW6Bm1eKrg4EsIYk6RyI=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JPCKCQQBEBC7PJZBHA2FNQ5VXE.PNG", "published_at": "2019-10-13"}