{"pub": "fox", "url": "https://foxnews.com/entertainment/alec-baldwin-ireland-robert-de-niro-comedy-central-roast", "downloaded_at": "2019-09-10 07:44:04.508338+00:00", "title": "Alec Baldwin takes jabs from daughter Ireland, Robert De Niro at Comedy Central Roast", "language": "en", "text": "Alec Baldwin found himself in the hot seat Saturday night during the taping of his Comedy Central Roast where he took hits from actor Robert De Niro, his daughter Ireland and many more.\n\nThe 61-year-old actor agreed to be the latest target of Comedy Central’s roasts in an effort to raise money for singer Tony Bennett’s charity, Exploring the Arts, which helps public schools in New York City and Los Angeles. According to multiple reports, nothing was off-limits when it came to lambasting Baldwin, including his notoriously hot temper with the paparazzi, his wife who is 26 years his junior, his past substance abuse and his often off-color brand of fatherhood.\n\nALEC BALDWIN HATED PLAYING TRUMP ON SNL, SAYS HE HOPED 'A METEOR HITS THIS BUILDING AND KILLS ME\n\nAccording to Variety, De Niro was a pretty common target for jokes throughout the evening as well, with Roast Master Sean Hayes jabbing him for some of his more screwball roles in recent years.\n\n“Is this the same Robert De Niro that did ‘Little Fockers’ and ‘Dirty Grandpa’?” asked Hayes. “I can’t wait for someone to make you an offer you can refuse. Alec Baldwin needs anger management like Robert De Niro needs better management.”\n\nWhen it was the 76-year-old’s turn at the microphone, he acknowledged how odd it was that he was there at all. He also took a moment to reference his and Baldwin’s respective roles on “Saturday Night Live” this past season.\n\n“Alec, it’s been a privilege playing Robert Mueller to your Donald Trump,” he said. “You are an arrogant a--hole and tonight, we’ve all gotten to say that. I just wish Mueller had roasted Trump as frankly and ferociously as we roasted you.”\n\nA big surprise of the evening came when Baldwin’s daughter, 23-year-old model Ireland, took the stage to take some playful jabs at her dad’s past fatherhood mishaps. Baldwin famously called Ireland a “rude, thoughtless little pig” in a leaked voicemail in 2007.\n\nAlthough he previously admitted that the voicemail hurt his relationship with Ireland, the duo seemed all-smiles at the event Saturday where she not only targeted her dad but praised her mom, Kim Basinger.\n\nALEC BALDWIN REVEALS HE AND WIFE, HILARIA, WILL ‘HAVE A FIFTH’ BABY TOGETHER\n\n\"After years of giving verbal abuse, it’s finally time you receive some,\" Ireland quipped (via Variety).\n\n\"It hasn’t been easy being the daughter of an iconic movie star, but I’m not here to talk about my mother,” she joked. “Or her Oscar. Or her continued respect in this industry.”\n\nShe continued by referencing her dad’s role in “Mission Impossible” saying: “‘Mission: Impossible’ is what I call getting my dad to apologize.”\n\nAccording to People, this isn’t the first time that Ireland has touched on her rocky relationship with her father at a roast. In 2017 she addressed the voicemail debacle directly at Spike TV’s “One Night Only” series.\n\n“I’m here to roast this big old ham I call my father. Speaking of pigs. Some of you may remember me as that thoughtless little pig you read about,” she said at the time. “That was a decade ago, and my dad and I are in a much better place now. He would never say something like that. Because I’m 6’2” and I would kick his a--.”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe roast Saturday, which airs on Sept. 15, enlisted the help of several celebrity roasters, including Ken Jeong, Chris Redd, Jeff Ross, Blake Griffin, Nikki Glaser, Caitlyn Jenner, Adam Carolla and Caroline Rhea.", "description": "Alec Baldwin found himself in the hot seat Saturday night during the taping of his Comedy Central Roast where he took hits from actor Robert De Niro, his daughter Ireland and many more.", "authors": ["Tyler Mccarthy"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/AlexIrelandBaldwin1.jpg", "published_at": "2019-09-09"}