{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/8/patrick-leahy-demands-ag-barr-address-inmate-suici", "downloaded_at": "2019-10-09 00:52:20.937880+00:00", "title": "Sen. Patrick Leahy demands AG Barr address inmate suicide prevention in the wake of Epstein death", "language": "en", "text": "Sen. Patrick Leahy on Tuesday demanded Attorney General William P. Barr answer questions about how federal agencies prevent inmate suicides, especially after the death of accused pedophile Jeffrey Epstein in federal custody.\n\nIn a letter to Mr. Barr and the heads of other federal agencies, the Vermont Democrat asked the Justice Department to turn over data on the number of attempted and completed suicides by federal inmates and detainees in the last five fiscal years.\n\nMr. Leahy said Epstein’s death while in federal custody in Manhattan raised “serious questions about inmate and detainee suicide prevention and protocols at federal facilities.”\n\nIn addition to Mr. Barr, the letter was also sent to the heads of Immigration and Customs Enforcement, the Bureau of Prisons, the Marshals Service, and Customs and Border Protection.\n\nMr. Leahy also called on the Justice Department to publish the complete data on in-custody suicide attempts and completions and what, if any, improvements it has made to suicide prevention training in the last five years.\n\nEpstein was believed to have hung himself in August at the Metropolitan Correctional Center where he was detained on sex trafficking charges. Mr. Barr has claimed that “serious irregularities” were discovered in the prison’s protection procedures.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Sen. Patrick Leahy on Tuesday demanded Attorney General William P. Barr answer questions about how federal agencies prevent inmate suicides, especially after the death of accused pedophile Jeffrey Epstein in federal custody.", "authors": ["The Washington Times Http", "Jeff Mordock"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/03/facebook-message_encryption_51987_c0-0-4693-2736_s1770x1032.jpg?61ff69ae844487b266839a518b744e886f2ff20c", "published_at": "2019-10-08"}