{"pub": "dailymail", "url": "https://dailymail.co.uk/money/article-7398887/5-ways-land-job-interview-leaving-secondary-school.html", "downloaded_at": "2019-10-05 08:07:42.403272+00:00", "title": "5 ways you can land yourself a job interview after leaving secondary school", "language": "en", "text": "Primary school, secondary school, A Levels, university; ever feel like your life is on rails towards a specific point?\n\nContemporary conventional wisdom is that university is a must for anyone turning 18, as it results in better pay and opportunities over the course of your working life.\n\nHowever, as the cost of university becomes more expensive, an increasing number of young people appear to be turning their back on that consensus.\n\nA recent poll by the education charity the Sutton Trust found that 65 per cent of people 16 and under believe a university education is important, down from 86 per cent in 2013.\n\nIf you feel like you never want to take another exam in your life after leaving secondary school, or one of an increasing number who feel as if university isn't for you, then our latest interview cheat sheet has some tips about how you can bag an interview without needing a degree\n\nWhile that's still a large number, it means there might will a sizeable group not heading off to university next month but wondering what they might be doing next after leaving school.\n\nIn our latest interview cheat sheet, This is Money has asked regular contributor and CV guru James Innes and Totaljobs' Lynn Cahillane for some top tips for those who have recently left school to stand out from the crowd.\n\nDo your research\n\nLynn says: 'Leaving school can feel scary enough as it is, but if you add on the extra pressure of trying to land your first job, things can soon feel overwhelming.'\n\nIt can be doubly difficult if you're not entirely sure what it is you want to do.\n\nJames' top tip is that: 'A job search is more likely to be successful if it is targeted, as opposed to just applying for jobs randomly.\n\n'Some type of career plan is therefore a useful tool for school leavers and is more likely to make a job hunt successful.\n\nLynn Cahillane, from jobs site Totaljobs.com, says even if you've never had a job before you'll still likely have some transferable skills worth including on your CV\n\n'Knowing what you want is the first step to achieving success.'\n\nOn that note, James recommends researching what sort of careers are available to you when leaving school, and identifying those 'that match your ambitions, personality, skills, interests, qualifications and experience'.\n\nSchools will often have careers fairs or careers officers, which will allow you to talk through any thoughts you might have on what you want to do or mingle with prospective employers.\n\nWhile the idea of working for the same employer for your entire career is increasingly outdated, you might well find that the first career you end up in is the one you want to do for a long time, so it's worth working out what that first step on the ladder ends up being.\n\nUse your experience\n\n'A lot of school leavers find themselves in a catch-22 situation', says Lynn, 'they need work experience to get a job, but as they have been in full-time education, they lack this desired experience.'\n\nHowever, even if you've never had a Saturday job or work experience through school or anywhere else, that isn't a reason to lose hope. Lynn notes you might still have some transferable skills.\n\nShe says: 'While the skills and experience you developed whilst at school may seem irrelevant to the role you're applying for; you'd be surprised at how much you've learnt that can benefit you in a new job.\n\n'If you had to deal with coursework, explain how that helped you develop your time management skills as well as how you used your initiative to carry out research.\n\n'Did you work in groups for any of your classes? If so, this shows teamwork and communication, two traits every employer wants in their staff.\n\n'And if you led the team, mention how you became a team leader.'\n\nDon't ever be afraid of the idea that this might seem like a child pretending to be an adult, as she says there are plenty of examples of how things you did at school can carry over into the workplace.\n\nShe says: 'If you took on extra responsibilities at school, be sure to include this as it shows an employer that you're trustworthy and not afraid of hard work. The same goes if you had any extra duties when at school.\n\n'Perhaps you were a prefect, mentored younger students, helped out at lunchtime, ran the school shop, or helped to co-ordinate assemblies, study groups or clubs. Did you join any after-school clubs? This shows that you have commitment and dedication.'\n\nEven things you do for fun could still be relevant, as this could prove how well-rounded you are and that you have the drive to do other things.\n\nAnd all this means that if you have some part-time work, volunteering or work experience, you'l be in an even stronger position.\n\nSocial media etiquette\n\nYounger generations like the one leaving school are increasingly likely to use Whatsapp, Instagram and Snapchat rather than old school stalwarts like Facebook or Twitter.\n\nBut that doesn't mean you still shouldn't be aware of what you're posting, especially if it's public.\n\nJames Innes, CV guru and founder of The CV Centre is back with some more tips, this time for potential first-timers after a job just after leaving school\n\nJames says: 'Nowadays it has become common practice for recruiters and HR managers to screen candidates against what they find online; gone are the days of wowing them with just your CV.\n\n'It is a fact that 70 per cent of recruiters searched online to see what they could find on a candidate before making a hiring decision.\n\n'But it seems some have ignored this fact and continue to ignore the impact of their social footprint.\n\n'In this day and age, we all leave behind a digital footprint in some shape or form - it's quite unavoidable. The longer you've been online the bigger it will be.'\n\nThis is Money has previously covered the touchy subject of your social media profile back in 2018, with Pam Lindsay-Dunn of recruitment agency Hays telling us the best course of action is just to make it private, especially if it's personal.\n\n'There's no need to delete your social media profiles', she says, 'but you should make them as private as possible and follow the advice that you shouldn't be posting anything that you wouldn't want current or prospective employers to see.'\n\nHowever, one thing you should make public if you do join it is LinkedIn.\n\nThe professional social networking site might verge on self-parody at times, and isn't one you'll use to keep up with your friend's birthdays or post holiday pictures, but it is useful when it comes to connecting with potential employers, recruiters and for publicising yourself in a professional capacity.\n\nJames adds: 'Make sure you have a professional LinkedIn profile. Many recruiters only look for candidates through LinkedIn so having a strong profile is vital.'\n\nCreating a killer CV\n\nUnless you've done part-time work before it's likely that leaving school and applying for a job is the first time you'll ever mock up a CV.\n\nIt can be hard to master, so don't be disappointed if you don't get it right first time.\n\nThe most important thing, James says, is to 'tailor your CV to every different job role you apply for.'\n\nHe adds: 'Ensure the skills required for the job are clearly demonstrated in your CV by identifying key words from the job ad.\n\n'Having a strong professional profile at the top is an ideal way of achieving this. Most recruiters nowadays use Applicant Tracking Systems to sort through applications and, without those key words, your CV just won't cut it.'\n\nAs well as the tips for what you can include as relevant that Lynn outlined earlier, Totaljobs also recommend outlining any subjects you excelled at in particular, especially if you've developed a passion for something at school and want to turn that into your first job.\n\nOn this note, James recommends that you should 'big up your achievements and any awards you may have won.\n\n'Recruiters look for high achievers both academically and professionally.'\n\nAnd on a purely functional level, make sure you proofread it, and get someone else to do so if you think it's necessary. Avoid any spelling or grammatical mistakes.\n\nIf you need guidance on how to style it, there a myriad of websites out there, including Totaljobs, which offer CV samples and templates.\n\nDrafting a decent cover letter\n\nAs well as your CV, you'll also likely have to send off a cover letter.\n\nThis is Money has already devoted a previous cheat sheet to the art of writing one and the power it can have, but just as a flavour, Lynn recommends making sure it's 'clear and concise' and 'makes your interest in that company and role immediately obvious.'\n\nShe adds: 'Employers are usually not recruiting school leavers for knowledge or experience. They want to understand why you're interested in a particular job.\n\n'Be honest that you're a school leaver but explain why this is the career you want. Did you take any courses that are applicable? If so, mention this.\n\n'Remember, the personal statement is a summary. You can expand on your successes elsewhere in your CV.'\n\nJames echoes this, and says: 'Your cover letter is just as important as your CV, as it is often the first document a recruiter will see on you, so it has to be spot on.\n\n'Make sure there are no spelling or grammatical mistakes and that you have followed any instructions included in the job advert, such as addressing it to a particular person or department.'\n\nOne final thing James notes, is to take the initiative. After all, what better way is to show someone that you want the job than by writing that you do?\n\n'Include a 'call to action' at the end of the letter and be confident about the next steps. State that you would appreciate an opportunity to discuss the application at an interview.\n\n'Why not suggest that you will call them in a week's time?'\n\nAnd remember, if you do get the opportunity to discuss your application at an interview, This is Money's interview cheat sheet has already covered how to answer some of the most taxing interview questions, including the dreaded 'tell me about yourself', how to make the right impression at the start and end of an interview, and what questions you should ask yourself.\n\nIf you have any questions you'd like us to ask the interview experts, email us at editor@thisismoney.co.uk.", "description": "As the cost of university gets more expensive, an increasing number of young people appear to be turning their back on the consensus that university is a must for another turning 18.", "authors": ["Interview Cheat Sheet", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/08/27/14/17742206-0-image-a-57_1566913689138.jpg", "published_at": "2019-08-29"}