{"pub": "fox", "url": "https://foxbusiness.com/real-estate/tallest-buildings-in-the-u-s-do-you-work-here", "downloaded_at": "2019-09-30 02:17:42.009587+00:00", "title": "Tallest buildings in the U.S.: Do you work here?", "language": "en", "text": "The United States is home to some of the best-known skyscrapers in the world, many of them familiar even to people who have never set foot there because of their close-ups in TV and movies.\n\nContinue Reading Below\n\nWhile developers are striving to reach even higher heights, the five tallest at present call Chicago and Manhattan home, with top billing going to One World Trade Center in downtown New York.\n\n1. One World Trade Center\n\nHeight: 1,776 feet\n\nCost: $3.8 billion\n\nDeveloper: Port Authority of New York and New Jersey; The Durst Organization\n\nArchitect: Skidmore, Owings & Merrill LLP\n\nThe building deemed a “bold addition” to the New York skyline soars 1,776 feet, counting the antenna at the top, with over 100 stories and a gross floor area of 3.5 million square feet.\n\nThe iconic landmark, once known as the Freedom Tower, opened in October 2014 and is the main building of the World Trade Center complex in lower Manhattan. With an artistically dynamic structure, the building was designed to smoothly integrate traffic of tourists as well as office tenants\n\nIt “evokes the slender, tapering triangular forms of great New York City icons” and replaces roughly one quarter of the total office space lost on September 11, 2001, in a single building, according to a report from Skyscraper Center.\n\nThe building is known for its growing network of media and tech innovators, with publishing empire Conde Nast overtaking multiple floors.\n\n2. Willis Tower\n\nHeight: 1,451 feet\n\nCost: $150 million\n\nDeveloper: Sears, Roebuck and Company\n\nArchitect: Skidmore, Owings & Merrill LLP\n\nSitting in the heart of downtown Chicago and coming in second is Willis Tower, home to the highest public viewing area in the United States, giving visitors the ability on clear days to see four states: Illinois, Indiana, Wisconsin and Michigan, according to Skydeck.com\n\nThe building, formerly known as Sears Tower, soars 1,451 feet high and has 108 floors above ground with three floors below, according to a report from Skyscraper Center..\n\nThe gross floor area spans 4.56 million square feet and its foundation and the first 50 floors take up an entire city block before the building begins to narrow, according to the report.\n\nConstruction began in 1970 and was finished in 1973. After opening in 1974, it was known as the tallest building in the world for nearly 25 years, the report added.\n\nOne of the many notable tenants includes Morgan Stanley.\n\n3. Empire State Building\n\nHeight: 1,250 feet\n\nCost: $41 million\n\nDeveloper: Alfred E. Smith; John J. Raskob\n\nArchitect: Shreve, Lamb & Harmon Associates\n\nThe Empire State Building, sitting in midtown Manhattan, comes in at number three. The building soars 1,250 feet with a gross floor area of 2.25 million square feet with over 100 floors above ground level.\n\nHighly memorable with its thousands of programmable LED Lights, the building remins a staple in many blockbuster films such as \"An Affair to Remember,\" \"Sleepless in Seattle,\" \"Elf\" and \"The Amazing Spider-Man.\" The building's world-famous 86th-floor Observatory has featured in numerous on-screen romances and real-life proposals.\n\nThe structure was completed in 1931 after only a year of work. Through 1971, it was considered one of the tallest in the world, according to the report, and a $106 million energy-efficient retrofit started in 2009 transformed it into “one of the most sustainable buildings in the world of any age.” The move created a yearly savings of $4.4 million in energy and operational costs, according to the report.\n\nNotable tenants of the building include the employment-oriented service Linkedin and Shutterstock, a provider of stock imagery, music and editing tools, according to Empire State Realty Trust.\n\n4. Bank of America Tower\n\nHeight: 1,200 feet.\n\nCost: $41 million\n\nDeveloper: The Durst Organization\n\nArchitect (design) DesignCook + Fox Architects (architect of record) Architect of RecordAdamson Associates\n\nTaking the No. 4 spot is the Bank of America Tower, sitting at a height of 1,200 feet. According to a report from Skyscraper Center, it has 55 floors above ground with three below ground.\n\nThe tower was “designed to set a new standard in high-performance building,” according to the report, which added that the vision was to create a workspace that emphasizes daylight, fresh air and “an intrinsic connection to the outdoors.\"\n\nThe tower remains an example of cutting-edge green building technology within the Manhattan skyline. Forty percent of the materials used during its construction were regionally sourced, according to the Green Energy Foundation, which helped to reduce energy use for transportation as well as support regional economies.\n\nThe building was created with a recycled material called fly-ash, also known as pulverised fuel ash, in order to save 45 percent of the cement that would have been used in concrete. The move, according to the Green Energy Foundation, eliminated a significant amount of pollution that is normally caused by manufacturing cement.\n\nConstruction began in 2004 and was completed in 2009 with Bank of America serving as its primary tenant, occupying 75 percent of the interior. Although it's not the tallest, it’s the first commercial high-rise to earn LEED Platinum certification from the U.S. Green Building Council, according to the report.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\n5. Aon Center\n\nHeight: 1,136 feet.\n\nCost: $120 million\n\nArchitect: Edward Durell Stone & Associates; Perkins + Will\n\nComing in at number five is the Aon Center in Chicago, which was formerly known as the Standard Oil Building or \"Big Stan,\" with a height of 1,136 feet.\n\nThe building is known as one of the “string of pearl” structures in the Chicago skyline for its height. According to a report from Skyscraper Center, the building has 83 floors above ground with 5 floors below.\n\nWhen it was completed in 1973, it was considered the sixth supertall tower ever constructed while also holding the title of tallest marble-clad building in the world until it was reclad in white granite in the 1990s because of safety concerns, according to the report.\n\nThe building’s shape and scale are reminiscent of New York’s original World Trade Center buildings.\n\nNotable tenants include Microsoft, United Health Group, Integrys, the Federal Home Loan Bank of Chicago, JLL, AT&T and Edelman with Aon remaining the building's largest tenant, according to the Chicago Tribune.", "description": "The top five tallest buildings in the country are calling Chicago and Manhattan home.", "authors": ["Daniella Genovese"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/iStock-Lower-Manhattan.jpg?ve=1&tl=1", "published_at": "2019-09-29"}