{"pub": "businessinsider", "url": "https://businessinsider.com/how-build-billion-dollar-company-5-years-with-huda-kattan-2019-10", "downloaded_at": "2019-10-03 07:49:14.256846+00:00", "published_at": "2019-10-02", "title": "How to build a billion-dollar company in 5 years, with Huda Kattan of Huda Beauty", "language": "en", "text": "Girlboss Radio is a podcast by Sophia Amoruso.\n\nHere, she interviews Huda Kattan, the founder and CEO of Huda Beauty, who discusses her journey from working at Dunkin' Donuts to being named one of Forbes's richest women.\n\nWhen Huda first set out to sell lashes, nobody would bite. When she finally sold what was meant to be a year's stock to a Sephora in Dubai, it sold out in a week.\n\nHuda also described getting up at 5 a.m. every day, working with a life coach, becoming a parent, and her proudest moments so far.\n\nVisit Business Insider's homepage for more stories.\n\nSophia Amoruso: Girlboss Radio is the show for and about ambitious women exploring the wins, losses and insights learned on the winding road to success. I'm so happy you're joining me today.\n\nIf you're a makeup lover, our next guest needs no introduction. She's known all over YouTube and Instagram for her quirky, fun and super helpful videos filled with all sorts of beauty tips. She's also a massive entrepreneur. Her name is Huda Kattan. She's the founder and CEO of Huda Beauty. Huda went from being a makeup artist and YouTuber to a fully fledged entrepreneur who is at the top of her game and has been for a while. In a few short years since Huda launched Huda Beauty with her two sisters, the company has now grown into a billion dollar business. And it all started with some eyelashes, and a willingness to stick to her vision.\n\nHuda Kattan, founder and CEO of Huda Beauty\n\nSophia Amoruso: We have a lot in store for you in this episode, so stay tuned to hear how Huda got started, how she organizes her workdays and how she manages to stay balanced while growing her beauty empire.\n\nHopefully, it's helpful. It was certainly helpful to me. Here's our conversation.\n\nSo Huda, wow. You have about 45 million followers across your social channels.\n\nHuda Kattan: Yeah.\n\nSophia Amoruso: Your company is worth over a billion dollars.\n\nHuda Kattan: Yeah.\n\nHuda Beauty Screen shot of Huda Beauty\n\nSophia Amoruso: Your net worth is over $550 million and you have an incredible chart topping beauty collection, a Facebook watch series. I want to talk about your incredible trajectory, but first I want to start at the beginning because we all have a first job and usually those aren't as glamorous as the kind of things we're going to talk about today. Huda, what was your first job?\n\nHuda Kattan: So I had a couple of jobs I did at the same time when I first started. I was working at a clothing store and then I was also at Dunkin' Donuts, which, I was really good at making coffee, I have to tell you. I was like a barista.\n\nHuda worked at Dunkin' — and it still influences her career\n\nSophia Amoruso: What did you learn from Dunkin' Donuts that you think you might be applying to your career today?\n\nHuda Kattan: Do you know, what's so funny is I feel like very early on, I really liked serving people and I still feel it now, it's really weird, but I feel I love the idea of being of service to people. It's really funny but I feel like we don't think about it a lot of times, but a lot of us actually do like to do that. With your mission Girlboss, that's clearly a huge service to all women. So I think a lot of times we don't think about it but we are serving people and I actually genuinely love it. There's just something about it that just feels very gratifying. Maybe it sounds selfless but it's actually kind of selfish as well. We feel good when we do that , so I love it.\n\nSophia Amoruso: Does Dunkin' know like you worked at Dunkin'?\n\nHuda Kattan: I don't think so.\n\nSophia Amoruso: You should totally do something with Dunkin' and teach us all how to reapply lipstick after we drink our coffee.\n\nHuda Kattan: Maybe, maybe. I wore a lot of makeup when I was at Dunkin' Donuts.\n\nSophia Amoruso: And you worked in finance at some point?\n\nHuda Kattan: Yeah, I graduated. I did my undergrad in finance and I didn't really work in finance because I didn't want to be an investment banker or any of that stuff. I hated it. Very quickly when I like was about to finish my degree, I was like, \"I made a mistake. This was not what I should've done. I should've done marketing,\" but it was too late and it would have taken too long to graduate. So I ended up going in as an investment ... As a recruiter for finance.\n\nHuda Kattan at Facebook Watch's \"Huda Boss\" Season 2 Premiere. Rachel Murray/Getty Images\n\nSophia Amoruso: Oh wow.\n\nHuda Kattan: So I didn't like that either.\n\nSophia Amoruso: There's so many of our guests who start in finance in some way and then just describe how much they hated it.\n\nHuda Kattan: Oh, it's bad.\n\nSophia Amoruso: But I think maybe, I would recommend to our listeners, get into finance and hate it because you end up being a really successful person.\n\nHuda Kattan: It's funny because I think it can be quite ... It can be quite challenging to work in finance. The industry itself, the people who are there are not as friendly. So I think that can be really, really hard for some people.\n\nSophia Amoruso: It doesn't sound very ... Maybe not very funny.\n\nHuda Kattan: Yeah.\n\nSophia Amoruso: And you're probably making more ... You're definitely making more money now than you would have in finance.\n\nHuda Kattan and Sophia Amoruso. Courtesy of Sophia Amoruso\n\nHuda Kattan: Yeah, I know. Well, depending on like what I was doing.\n\nSophia Amoruso: Yeah. So prior to your beauty empire, you were a makeup artist. How did you get your break into that? Because you worked with a lot of celebrities, which I think even that alone is really challenging. How did you get into that?\n\nHuda Kattan: So I was really confused about what I wanted to do as far as what was going to be my next step because obviously I spent my whole entire life building my resume and believing that that was the role I needed to take it. Then we had the financial crash in 2008 that was literally the year I graduated. And I was like, \"Well, this is obviously what I thought was going to be so solid and it's not.\" I'm driving up the road, I'm broke, I have no money but I need to feel good so I'm going to buy lipstick to make myself feel good.\n\nIt was crazy because I really didn't realize what was happening in the world and what was going on. But there was a change and it was an interesting time I think. I'm so glad I studied finance then and I graduated then because had I maybe worked a longer, I would have probably been more patient. If I didn't go through what I went through and if I didn't get fired, I'd still be working there.\n\nSophia Amoruso: So you got fired. What'd you get fired for?\n\nHuda Kattan: My boss said I didn't belong there. He was right. He was right.\n\nSophia Amoruso: That is a really weird reason to get fired.\n\nHuda Kattan: Yeah. He said to me —\n\nSophia Amoruso: \"You don't belong\"?\n\nHuda Kattan: Yeah. He said, \"Why aren't you studying makeup or fashion?\" And I was like, \"I'm going to prove you wrong and work even harder.\" He's like, \"No, you're not.\"\n\nSophia Amoruso: That's a great push in the right direction.\n\nHuda Kattan: It was.\n\nSophia Amoruso: Sometimes things that seem really, really bad and really hard for us ... We're pushed out of things that seem to be our pat and send us in the right direction.\n\nSophia Amoruso attends Girlboss-Prudential Brunch at NeueHouse Los Angeles on September 9, 2016 in Hollywood, California. Randy Shropshire/Getty Images for Girlboss, Inc.\n\nHuda Kattan: Totally, yeah.\n\nSophia Amoruso: You were a very early YouTuber and you mentioned someone who can get into vlogging now. Do you think ... How much harder and more crowded is it now? Are there people that you're seeing breakout right now in the vlogging space?\n\nHuda Kattan: It's definitely happening. There's some people who've come in quite late and they're blowing up really fast and I really think it depends on if what they're offering is something new and something interesting. I think people are looking for people who have a different perspective, a different point of view and they want to hear it. People who aren't afraid to speak their mind. I love following that. So I think there is definitely space. It just depends on what do you think is your point of differentiation?\n\nSophia Amoruso: Are there any up and comers that you would shout out or be like, \"Damn,\" —\n\nHuda Kattan: There's a lot.\n\nSophia Amoruso: I think they're really interesting. Is there a few that we could go follow?\n\nHuda Kattan: There is a lot. Gosh, where do I even start? I obviously know the ones on Instagram a lot. Oh man, there's so many. There is this one girl that I'm obsessed with who just recently got pregnant. Her name is Jesus Gang. She's so dope. She's Nigerian. She's in New York. She's just so beautiful. All her pictures are stunning. She's kind of a natural beauty. She's just so beautiful. I also met this really cute girl the other day. Her name is XOXO Charlie MUA. So adorable. Does a lot of colorful eyes. She's beautiful. Her makeup beat is like lawless. Yeah, I would give the two of them shout outs. They're really sweet.\n\nHuda started her YouTube channel in 2007, and watched the platform surpass blogs\n\nSophia Amoruso: So you started your YouTube channel back in 2007?\n\nHuda Kattan: So I was actually ... I opened my account and I think I was watching videos.\n\nSophia Amoruso: Okay.\n\nHuda Kattan: I wasn't actually making videos yet.\n\nSophia Amoruso: Because we went all the way back to the beginning. It was 2010 when you started making things?\n\nHuda Kattan: To be honest, for YouTube I started but I feel like I didn't really properly do videos until recently. I was popping a video out and people were like, \"Oh my God, your YouTube tutorials are the best.\" And I wasn't doing them regularly. I was really focusing on a blog. Huda Beauty was my blog at the time and that's all I was doing. So it's kind of crazy because now I feel like YouTube is definitely bigger. Blogging has kind of died.\n\nSophia Amoruso: Yeah. How did you build your ... Because people don't go to websites in the same way that they used to.\n\nHuda Kattan: We still get a lot of unique users.\n\nSophia Amoruso: Yeah. Yeah. How did you go about building that audience on your blog?\n\nHuda Kattan: We were using so many ... We were, at the time, it's so funny because I feel like now you do 360 social marketing. You promote yourself on Twitter, you promote yourself on Facebook, you promote yourself everywhere. We were doing that at the time. We were trying to grow ourselves on Facebook. We were just starting on Instagram and we were literally like pushing everything, all the posts, 360 at the time. And that was really good. Facebook was probably the first thing that we used and that was really helpful because we were able to go global really, really well. We were so popular in the Middle East, but getting to other parts of the world, like New York and California or Australia, Asia, we really had to use social media for that.\n\nSophia Amoruso: So you are one of the most followed people on Instagram. You have 37 million followers. Just tell me how. I'm sure it's a really long story, but what are the things that you think primarily contributed to what you've achieved, at least with your Instagram following?\n\nHuda Kattan: Yeah, I think we are not shy or nervous when it comes to beauty, so we definitely pushed the envelope.\n\n... Are nervous when it comes to beauty, so we definitely push the envelope a lot. And I think people like it. Sometimes when I run into people ... Like I was doing a video once with Bella Hadid, and she was like, \"I see the weirdest shit on your Instagram, and I can't stop watching it. I get lost in this vortex on your Instagram page.\" And I feel like that's one thing ... I will put almost anything on my face. I'll almost try any procedure or anything, just because I, first of all, I'm so curious about how it works. And then, secondly, I just think it's fun. And so I think people are like usually interested that we're going to show them something new, most probably.\n\nSophia Amoruso: And you are ... You have a Facebook Watch show called Huda Boss?\n\nHuda Kattan: Huda Boss.\n\nSeason 2 of \"Huda Boss\" is now streaming on Facebook Watch. Kayla Williams/Beck Media\n\nSophia Amoruso: All right.\n\nHuda Kattan: Who is the boss?\n\nSophia Amoruso: You're the boss, just by the way. And you create so much social content. What does your team look like? How do you create that much content across multiple accounts? You've @Huda, you have @HudaBeauty, you have @HudaShop?\n\nHuda Kattan: Yeah, that's right.\n\nSophia Amoruso: Shop?\n\nHuda Kattan: Yeah. HudaBeautyShop.\n\nSophia Amoruso: I followed all three.\n\nHuda Kattan: Oh, I love you.\n\nSophia Amoruso: I already followed you. But what is creating that amount of content like? I mean, you wake up ... How early in the morning does that start?\n\nHuda Kattan: Oh my God. Do you really ... I'm a nerd. I'm not cool. I pretend to be cool on social media, but I'm not.\n\nSophia Amoruso: We're all nerds here.\n\nHuda Kattan: I wake up at, usually on the latest, 6 a.m., but I try to wake up at 5 a.m., pretty diligently every day. And then I start my day really early, and then by 10 a.m. I'm done with my day and I'm ready to start meetings. And I'm very firm on that. That's non-negotiable. If I don't do that, I'm really bitchy.\n\nRead more: I'm an executive headhunter and emotional intelligence expert. Here's my 3-pronged solution for making salary negotiations easier.\n\nSophia Amoruso: And be done with your day by 10 a.m. What does that mean?\n\nHuda Kattan: I've done everything I need to do. I've shot my tutorials, I've done my personal content, I've spent time with my daughter, I've journaled, all that shit that I need to do, like from ... I will do yoga, or whatever it is from 5 a.m. til a.m.. So those five hours for me are everything.\n\nSophia Amoruso: How many hours a night do you sleep?\n\nHuda Kattan: I sleep eight to nine hours a day.\n\nSophia Amoruso: So you go to bed at like, 9:00.\n\nHuda Kattan: Yeah, 8:30, 9:00.\n\nSophia Amoruso: That's amazing.\n\nHuda Kattan: If I wake up at 5:00, I have to go to bed kind of early, so I usually do try to wake up at 6:00 if I can.\n\nSophia Amoruso: So you started Huda Beauty in 2013 with your sisters?\n\nHuda Kattan: Yeah. So complicated.\n\nSophia Amoruso: Yeah, what led you to start your own line? I know you had ... There was a debacle with eyelashes that that started everything.\n\nHuda Kattan: So true. There was no good eyelashes out there. And I have no eyelashes. Literally, when I remove these, if I were to move them up, I have no eyelashes. It's so weird. I am such a hairy person, and for whatever reason I have more hairs on my lip than I do on my eyelashes. It's so weird. So I became very obsessed with them at a very young age. I was like, \"Oh my God, I want lashes. My sisters have beautiful lashes. I feel like a boy.\" And so I didn't know ... I did not want to start a brand. Personally, I did not think I was capable of starting a brand. I always told myself,\" I'm not a business woman. I am not capable of that. That's just, I'm staying in my lane. Content creator, that's who I am.\" And I genuinely love to create content. But then my sisters kind of forced me to start our brand.\n\nAnd I'll be honest, I've gone through a lot of positions and also emotions, and I've transformed a lot as a person. Like having to be in a place where ... I always say this: We don't know what we're capable of. And you get put into position, and you don't even know, all of a sudden you become somebody you never thought you would become. I didn't want to become CEO of our company. My husband was like, \"You have to be.\" And it really taught me so much about myself. It's really crazy. You don't know what you're capable of until you're forced into that position. And so I can't say that enough.\n\nSophia Amoruso: I think people underestimate, they say, \"Work, work, you're working all the time,\" but when you are on a trajectory and you're able to go down rabbit holes and learn things, it's ... Business can be such an opportunity for personal growth, because you're just pushed into things you have absolutely no control over, and you're buried under it and you have to find your way out.\n\nHuda Kattan: If you don't have the personal growth, you won't be able to deal with what's to come. And I feel like we've ... I've always, I do a lot of personal development, and I feel like I do the inside work so I can deal with the outside. If I don't, I literally, I can't talk to people. I can't, I'm almost debilitated. So I think it's really important. I've been forcing my team to do that, too.\n\nSophia Amoruso: And you work with a coach?\n\nHuda Kattan: I do. I've had a life coach for three years.\n\nSophia Amoruso: How is that ... What does your life coach do?\n\nHuda Kattan: She's almost like my therapist.\n\nSophia Amoruso: Do you go to therapy, too?\n\nHuda Kattan: No, I don't. She's kind of both, if I'm honest. She's amazing. She's a psychologist, but she's also genuinely an amazing life coach. And I feel like a lot of times just saying things out loud puts things in perspective, and you're almost like, \"Okay, so I feel this way. I feel frustrated because I want to do this, and I feel like there's so much more that I want to happen,\" but you have all those feelings inside. And then when you start putting them outside, all of a sudden you're like, \"Oh my God, this is actually how I fix this, and this is why this is happening. And maybe I need to be a little patient here.\" But it's just, it puts a lot of clarity. The only thing I will tell you is I know there's a lot of life coaches out there, and I think that you really need to find the right one for you. That's really what changed my life a lot. She's amazing.\n\nSophia Amoruso: So I want to get back to Huda Beauty.\n\nHuda Kattan: Yes.\n\nSophia Amoruso: How did you initially fund it?\n\nHuda Kattan: So I borrowed $6,000 from my sister, and I promised her if I didn't sell the lashes, I was going to wear them all and then pay her back one lash at a time. And she agreed. She's really nice. I actually calculated, I was like, \"Wow, that would have taken me my entire lifetime to pay her back.\" It would have been crazy. And then, so we funded it ourselves, and then it wasn't enough, honestly, so I had to do a couple of makeup gigs. But we were struggling. We were struggling so badly for the first couple of years, and actually, the distributor we had at the time was like, \"Hey, we'll help fund you guys.\" And it was really challenging, because then they ended up not ordering that many products, because I think they wanted to keep our value down, and it was really challenging.\n\nHuda and Mona Kattan Brian Ach/Getty Images\n\nSophia Amoruso: How did you figure out how to make eyelashes?\n\nHuda Kattan: Oh, God. My sister Mona forced me into it, because I was like, \"I'm not going to do this. We're not starting a brand. We're not going to do it.\" She's like, \"No, we are.\" And she actually found manufacturers that we could work with, and I was cutting them up and making them, and she was taking those and sending them over. She forced me to start this. She literally forced me.\n\nSophia Amoruso: Are you so grateful?\n\nHuda Kattan: I am, but I don't know if she's grateful, because I feel like I drive her crazy now.\n\nSophia Amoruso: Well, hopefully she has equity in the company.\n\nHuda Kattan: She has a lot.\n\nSophia Amoruso: She can be grateful for that.\n\nAt first, nobody was interested in Huda's lashes — then they sold out a year's supply in a week at a Sephora in Dubai\n\nSophia Amoruso: You had some early issues, obviously, it sounds like with your distributor.\n\nHuda Kattan: Yeah.\n\nSophia Amoruso: But when you tried to get your lashes into Sephora, they didn't bite.\n\nA Sephora store in Times Square. Reuters\n\nHuda Kattan: No. Nobody bit.\n\nSophia Amoruso: How did you transform that no into a yes?\n\nHuda Kattan: It took a lot of time. I know it's really weird, but I'm a firm believer in energy and all these things. And I always, I know this sounds so weird, and I can't say this enough, I trust my intuition before I trust a logical decision. And I've used it 99% of the time, and the 1% of the time that I haven't, it's always been something I've regretted. So the company knows sometimes I'm going to make a decision that's going to be completely based on gut, and they need to trust it. And I feel like I'm very connected with it.\n\nSo when we were picking out who we needed to go with as a distributor, basically everyone told us they didn't think we had a chance. Finally, somebody, these two girls, they were amazing, they believed in what we were doing. They put us in front of Sephora, and we pitched the hell out of it. Sephora US was not interested in us at the time. Nobody really was, except for this Sephora Dubai Mall. They were willing to try us out and see how we did, and we closed up shop. We sold everything. Everything they had, they had thought they were going to have for a year, we closed out in like, a week.\n\nRead more: I'm a mom who quit my job, sold my house, and invested every dollar I had into launching a company that's grown 2,000% in 5 years\n\nSophia Amoruso: And Dubai's an amazing market for the beauty business.\n\nHuda Kattan: It is, yeah.\n\nSophia Amoruso: Why do you think?\n\nHuda Kattan: I mean, people there love beauty. They're not afraid to experiment with beauty. It's part of the culture from a very young age. I feel like in the States, people don't wear as much makeup. They don't necessarily need to. We have features that can take a lot of makeup. Like my eyelids, if I don't wear a ton of eyeliner, they just look different. I look so much better with liner. So I do feel like it's ... You know, it's so weird. I grew up in Tennessee and I was like, \"Why am I wearing so much eyeliner? I don't understand.\" But it's genuinely our features can take it. I wear crazy lashes.\n\nSophia Amoruso: They're beautiful. I've been looking.\n\nHuda Kattan: Thank you. Thank you.\n\nThe value of having a great product\n\nSophia Amoruso: You've really cut through a lot of noise, and that doesn't come from having a huge audience. You have to have a great product.\n\nHuda Kattan: Thank you.\n\nSophia Amoruso: What would you say the unique value proposition is about Huda Beauty? Because it's, yes, of course it's you, but the product stands for itself.\n\nHuda Kattan: I think a couple of things. I really think we're very innovative when it comes to products, and I feel like it kind of reflects back onto our content. We always push the boundaries when it comes to content, we always push the boundaries with product. We are one of the brands ... Quite frankly, we were the first to do many things, whether it was asking people ... We created these amazing pigments back in 2016 when we first launched makeup, and it was like, you had to use your finger in order to use them, and everybody was so mad at us. But then it became a thing, because your finger was better. And so many other brands started doing it, and we're talking luxury brands, who were telling us very directly, \"We loved it. We were inspired by it.\" Who ... I won't name names, but it was really, it was amazing to see happen. And then we had a lot of things like that happen. And I feel like now there's an expectation on us to deliver high quality but also innovative products.\n\nHuda lashes. Sephora\n\nSophia Amoruso: How do you stay on top of things? Because the beauty industry changes really quickly. There's trends that emerge, what you described with applying makeup with your fingers, and then now we're on to something else. Do you do trend research? Do you just stay close to the content creators that are making things today? We can be really successful, and then be like, \"Oh, that worked,\" and keep doing the same thing.\n\nHuda Kattan: I'm not data-driven though. I refuse to read data.\n\nSophia Amoruso: Okay. So is it all gut? Like, \"This is what's next?\"\n\nHuda Kattan: 100%. Actually, I create trend moodboards for my team to come see. Because they're always like, \"The Pantone color — \" and I'm like, \"It's wrong this year. I guarantee you guys, it's wrong this year. I promise you, I feel like it's something else.\" And I feel also like everybody else is doing something, and why are we going to do the same thing? So a lot of people will be absorbing the same data. I'm like, \"If I'm getting this data, that means all the other companies are getting this data as well. So maybe we need to do something different.\"\n\nYeah, we have the most amazing team we have. We're a little bit under 200 people right now. So we're not small, but we're also not big for a beauty brand. We're actually quite small for a beauty brand. But we have a very interesting team. I feel like they are very intuitive. They understand the importance of feeling and emotion, and putting those things into products, and I think it's really powerful.\n\nSophia Amoruso: How has your role in the company changed? Because you're obviously not someone who just slaps their name on things. This product —\n\nHuda Kattan: Yeah, I feel like I drive everyone crazy because of that.\n\nSophia Amoruso: Wouldn't be as great as it is if you weren't doing that. And I know you're probably very much in the weeds, as all founders are in the very beginning. You have 200 people now, it sounds like you finish the content part of your day at 10:00 AM, and you're very involved with your business. How has your role changed, your contribution to the company, and the team, and the way you're spending your time changed from day one, to year two, to now?\n\nHuda Kattan: It's really weird, because in the beginning, you're doing ... I mean I remember the first lip product that we did. I literally had ... I mean, we had an office, but nobody was in it. I took a plate, like a plate for food, and I was mixing paint to make the shades. And I did everything wrong then. Like we did the packaging, but we didn't finish all the compliance at the time. It was really bad. And so we were such a small team, but we were so gritty and so scrappy. And I feel like now, we're bigger and we're doing things more correctly, but I still feel like we're still so small. So I don't know, maybe in my head I still want to do the small stupid ... Like yesterday, I edited my video for Instagram, and then I created a lot of content for Snapchat. And then I sent it to my team, and was like, \"Oh, can we create this kind of stuff?\" I probably should be less involved. I just can't help myself.\n\nSophia Amoruso: So you got private equity from TSG.\n\nHuda Kattan: Yeah, 2017.\n\nSophia Amoruso: Which is primo money.\n\nHuda Kattan: Yeah.\n\nSophia Amoruso: I can't remember who they've invested in, but —\n\nHuda Kattan: NYX cosmetics.\n\nSophia Amoruso: The best.\n\nHuda Kattan: Yeah. Smashbox. They're great. They do, there's a lot of consumer goods for them.\n\nSophia Amoruso: At what point did you know it was time to take that kind of institutional capital and catapult your business and your valuation to over a billion dollars?\n\nHuda Kattan: Yeah. I felt like there was a point where we needed help, and I just felt like in order to really compete in the beauty industry, we needed more people. And really, really, we have the most amazing team who built the company, but they need better mentors. Because at that point, I was kind of a lot of people's mentor, and I was not the best person, at all. They needed a real product development strategy, real PR strategy, real distribution strategy, and all of my stuff is gut. So I'm always like, \"I feel like we should be there, because that's where I shop.\" And, \"That's where I feel like we need to be because of this.\" And don't get me wrong, we still use a lot of that, but now there is a lot of ... We were just talking about that, there's healthy debate, because I'm like, \"I feel like this.\" And then they give me a reason, and then we kind of, we're all reasonable people. We hire really amazing, kind, genius, reasonable people. And I feel like because of that, we use intuition, but there's also data there, too.\n\nSophia Amoruso: What do you look for when you hire those team members?\n\nWhat it takes to be \"Huda Beauty material\"\n\nHuda Kattan: Oh, we have a type, we call it Huda Beauty material. It's a type, you'll feel it. And if you're in our UK office, our US office, oh man, the Dubai office, there's a type. They're a little quirky. They're not boring. They're really smart. They give so many fucks. I feel like that's a prerequisite. They have to care so much, so much. That's probably the most important thing and then I like nice people. I don't work with assholes.\n\nWhen Huda made it onto Forbes's richest women list\n\nSophia Amoruso: I think the way people work when they take their work personally and they take accountability for their work and they own their work and they also feel like they can go run with their work to a certain extent. It sounds like you're letting people do that more and more —\n\nHuda Kattan: Trying to.\n\nSophia Amoruso: ... and you're listening to smart people's feedback and sometimes getting proven wrong, which can be also really thrilling.\n\nHuda Kattan: It's great because it's like a different perspective.\n\nSophia Amoruso: So you're number 37 on the Forbes richest women list. That's a big deal. How did that feel that moment that Forbes called you and said, \"Listen, you're one of the richest women in the country?\"\n\nHuda Kattan: So I'm very private. So when that number came out, to be honest, I was a little taken back. I felt I had not submitted ... My team had actually shared some data and we didn't realize that that was then going to go into that list and I'm honored to be on the list. I love Forbes. I think it's an amazing publication. I just didn't know I was going to go onto that self-made list. So at the time I was shy, I guess. If that makes sense. I just didn't know. Like we've been very private with everything. Our company had been so successful but been very private about that. And so that was something that I kind of thought we would keep. And then at that point we were like, let's just, for the most part, everything's out there.\n\nSophia Amoruso: Did you celebrate?\n\nHuda Kattan: No.\n\nSophia Amoruso: That's amazing. That's who the boss? You the boss. Just keep moving.\n\nRead more: I dropped out of a Ph.D. program 6 figures in debt, but I'm now a multimillionaire at 33. Here are my 3 tricks for building a hit brand.\n\nHuda Kattan: Yeah. Because the reality is too, I don't think where you are really determines what you're doing. I think where you're going determines who you are. So for me it's like, I always say to my team, \"We may not be where we want to be yet, but it doesn't matter. It's like, where are we going?\"\n\nSophia Amoruso: Where are you going?\n\nHuda Kattan: Where are we going? We're going, ah, you know, I think to put it best, TSG said this to me and I really, I fell in love with them for a few reasons, but one, I feel like they saw the vision and they said to me \"Like Estee Lauder was the 20th century. Huda Beauty is the 21st century.\" So they really understood that Estee Lauder is something that I aspire to be like. I love the idea of becoming a conglomerate and the idea of being something that can change the beauty industry. That's something we talk about a lot.\n\nWe really want to change the face of beauty. I feel like it's time. Beauty has been a certain message for a long time and people want something different. And if there's any brand to do it, we have to be the brand to do it. We do it, we're doing it. But I really want to make sure that people know that it's our commitment. It's our mission.\n\nSophia Amoruso: What is your definition of beauty?\n\nHuda Kattan: When I was young it was something I feel like people either had or they were had nots about it. And you really felt it. Like if you didn't feel beautiful, it felt terrible. And for me it was more of an image at the time. And now I feel like it's completely an emotion. It's completely a feeling. And that's why I feel like it's so empowering. I felt like it was probably not represented correctly and I feel like there is an opportunity to show people how powerful it can be. When people feel beautiful, they feel powerful, like straight up. They feel powerful, they feel empowered, they feel just more strong. They feel strength, feel good.\n\nSophia Amoruso: It's transformative.\n\nHuda Kattan: It is.\n\nHuda Kattan at Beautycon Los Angeles. Gregg DeGuire/Getty Images\n\nSophia Amoruso: You know, Nasty Gal, it was like, it wasn't a leather jacket. It was a leather jacket that a girl bought and basically, it was like —\n\nHuda Kattan: She bought it —\n\nSophia Amoruso: I'm more confident. I'm wearing this and I'm going to go out in the world and this is an alchemical experience. I've been transformed. It was like a prayer to her future, more than it was a purchase.\n\nHuda Kattan: 100%.\n\nSophia Amoruso: That feeling is really important. It's really, really rare that someone can build a brand that gives people that kind of feeling.\n\nHuda Kattan: I mean it's, it's work. We do it all the time. The team is really vested in that, so we do it all the time, but it's something you have to constantly talk about. You have to constantly tell people that that's your mission. Because sometimes they'll forget. They'll take their makeup off and then they'll feel like they're not beautiful anymore. I'm like, well no, you're the same. They're the same person. So it's something that we constantly have to kind of communicate to people and let them know what is facts.\n\nSophia Amoruso: So you're into fragrance now.\n\nHuda Kattan: Yes.\n\nSophia Amoruso: You've launched fragrance recently. Tell me about, is it Kayali?\n\nHuda Kattan: Kayali, yeah. Kayali, which is Arabic, which means my imagination and the concept really is derived around creating these mixes of fragrances. It's my sister's project and I want to support her in it. But it's beautiful. It's beautiful to say the least. She's very talented.\n\nSophia Amoruso: I wish we could all smell it over the podcast.\n\nHuda Kattan: Well make sure you guys get some.\n\nSophia Amoruso: There's so many huge accomplishments over the course of your career. What would you say your proudest moment is? Or what are you proudest of?\n\nHuda Kattan: That's a tough one. I have a lot of personal things that I'm more proud of. I think I'm growing as a human being. My daughter, being a mom to her has been really rewarding. I didn't want to be a parent in the beginning and then I got pregnant accidentally and it's been a beautiful thing. It's taught me a lot of patience. I feel like that's like the thing I've learned most from being a mom is that you need to respect the time and everything and it's been beautiful. She makes me more creative too, which I love. She makes me feel good.\n\nRead more: I prioritized my career over my personal life, and I have (almost) no regrets\n\nSophia Amoruso: So there's this question I ask everybody who comes on Girlboss Radio. There's actually two questions I ask everyone who comes on Girlboss Radio, and one of the things that we talk a lot about is this concept of success. Because you just talked about your daughter and that's not financial, that's not about your career. It's something you're proud of that doesn't have do with what the typical definition of success is, which is being on the Forbes list. Which is having Instagram followers. Everyone wants Instagram followers. What would you say your concept of success is? What does success mean to you?\n\nHuda Kattan: I feel like I have a very clear concept.\n\nSophia Amoruso: All right.\n\nHuda Kattan: It's just happiness. It's pure happiness, feeling really good. Because the reality is last year I hit a point where I realized that when we finally got our investors in and it's something you would assume would make somebody feel really good, I felt really bad. Because I just started thinking about my purpose and how I'm supposed to pay my dues forward. And I realized I wasn't happy with a lot of things. I didn't feel good enough in many ways. And I know that's a whole nother conversation, and it's time to wrap. But it made me understand that happiness. People who are truly, utterly happy were the most successful in my opinion. And that's not something that's easy to come by. And that's why I think it's really important. I wrote down the most important things in my life and I'm a spiritual person, so spirituality is really important, family's really important, health is really important. And then work is the last, but I was doing things the other way around. And I was like, \"Shit.\" That doesn't make me happy. Realizing that my priorities are not in the right place.\n\nThe importance of filling your cup\n\nSophia Amoruso: Another thing that we ask everybody that comes on Girlboss Radio is, what is your most recent girl boss moment?\n\nHuda Kattan: So it wasn't something I did for myself, but it was something that really changed my perspective. My husband took me to Iceland and I let him spoil me. I don't ever do that, like ever. I don't spoil myself. I don't let anybody spoil me. I mean I spoil myself with material things. I don't think that's right, but you know what I mean? This was like a a point where I was like, I'm going to let somebody take care of me and it filled my cup so well. Like it was amazing. I came back into the office and shit was going down. I was like, \"It's okay, we're going to figure it out.\" And people were like, \"What happened to Huda?\" And it was one of the most amazing things. I realized the importance of filling your cup, the most important ways to do that. And I now really put an effort into it, like so much. And I think it's really important to have that balance. I don't do it all the time, but I think it's very important. It just changes your life.\n\nSophia Amoruso: Huda, thank you so much for joining me on Girlboss Radio.\n\nWant to meet more women like Huda Kattan? You can — by joining the Girlboss professional network! Girlboss is a free platform for ambitious women to connect, ask questions, and level-up, together. We're calling it \"professional networking 2.0,\" where connecting is about quality, not quantity. No sliding into DMs, no spam, no mass-connecting. Join fellow founding members and get access to our weekly Digital Fireside chats where you can get advice from entrepreneurs, marketers, creatives and side hustlers from all trades. Head to girlboss.com to sign up and create your profile today.", "description": "For her podcast, Girlboss Radio, Nasty Gal founder Sophia Amoruso interviewed beauty mogul Huda Kattan.", "authors": [], "top_image": "https://image.businessinsider.com/5d93a9392e22af653d0bbad1?width=1200&format=jpeg"}