{"pub": "townhall", "url": "https://twitchy.com/gregp-3534/2019/10/21/yashars-not-a-journalist-california-dem-gets-into-a-fight-with-yashar-ali-over-the-states-new-awful-freelancer-bill", "downloaded_at": "2019-10-21 10:29:41.006220+00:00", "title": "‘Yashar’s not a journalist’: California Dem gets into a fight with Yashar Ali over the state’s new awful freelancer bill", "language": "en", "text": "There’s a new law in California that looks to regulate the number of freelance pieces a writer can get paid for per year before the publication has to consider them a full-time employee:\n\nCalifornia freelance writers are gearing up for Assembly Bill 5 to go into effect https://t.co/x6unOOwJRD — Hollywood Reporter (@THR) October 19, 2019\n\nThis cap? 35 articles a year:\n\nCalifornia is capping freelance writer articles at 35 a year. I could pass that in a month. It’s absolutely ridiculous that the government here wants to hurt people who choose to freelance and have a more flexible career. — Kassy Dillon (@KassyDillon) October 20, 2019\n\nNeedless to say, many freelancers are pissed:\n\nI don’t want to be employed. I’m a full time graduate student and I was just starting to plan to write more for income. — Kassy Dillon (@KassyDillon) October 20, 2019\n\nKnow who is driving this? You guessed it. The unions. — Kassy Dillon (@KassyDillon) October 20, 2019\n\nThe Dems are just trying to help!\n\nCalifornia to moms keeping their hand in the writing game in a flexible way: screw you, lean in. https://t.co/ZVgAr1U3Kw — Inez Stepman (@InezFeltscher) October 20, 2019\n\nWhat they want has nothing to do with it as the state knows best:\n\nOne note is that many many of us DON'T WANT to become employees. Because of health circumstances, life circumstances, or lifestyle choices, we have chosen the freedom not to be tied to one single employer. Laws designed to push us into full time employment are discriminatory. https://t.co/DmaJ5RQs2P — Erin Biba (@erinbiba) October 20, 2019\n\nAssemblywoman Lorena Gonzalez is one of the champions of the law:\n\nThis law would functionally make it illegal for me to do my job in California. @LorenaSGonzalez please rethink this. If you want to talk about the reality of freelance writing careers, I’m around. Contact me at https://t.co/cPuHPkpasehttps://t.co/6bcAOTw6pv — Jennifer Wright (@JenAshleyWright) October 19, 2019\n\nAnd here she is fighting with journalist Yashar Ali who called her out:\n\nCalifornia Assemblywoman @LorenaSGonzalez has launched a direct attack on press freedoms with her bill. I’d say she should be ashamed of herself, but knowing her, shame is not a sensation she’s familiar with. https://t.co/WbL5g4Ho0W pic.twitter.com/V8Qj9Idbbp — Yashar Ali 🐘 (@yashar) October 19, 2019\n\nI didn’t realize we had met. For background, we worked for months wa coalition of freelancers (including @rdotinga) to create what we thought was reasonable relief from Dynamex while protecting staff media jobs. It isn’t perfect but the coalition we worked with said it was “ok.” — Lorena (@LorenaSGonzalez) October 19, 2019\n\nHi, Lorena. Former freelance writer here. Your bill is horrible and will hurt the people you say you’re trying to protect. — Molly Knight (@molly_knight) October 19, 2019\n\nMy bill was about codifying a court decision for all workers. We wrote exemptions for freelancers at the request of freelancers. I understand many don’t think it went far enough, but it was a balance between unions, staff journalists, & needs of freelancers. What do you suggest? — Lorena (@LorenaSGonzalez) October 19, 2019\n\nI suggest letting freelancers write as many pieces as they want. My industry is hemorrhaging full-time jobs because people expect to read content for free on the Internet, not because of scabs. There are no jobs. This bill chokes off the only safety valve. — Molly Knight (@molly_knight) October 19, 2019\n\nFreelancers can write however much they want-but should we let , say the LA Times hire as many freelancers as they want to bust their union or weaken their great new contract or keep folks from organizing. Freelancing can hurt staff jobs. — Lorena (@LorenaSGonzalez) October 19, 2019\n\nAnd bam:\n\nNarcissism in action. @LorenaSGonzalez, who is a California state elected official, can’t stand that she’s facing criticism for her terrible legislation which hurts freelance reporters and writers https://t.co/FGq44eDnWG — Yashar Ali 🐘 (@yashar) October 20, 2019\n\nBut don’t worry. Now Gonzalez want to decide who is and who isn’t a journalist. What could go wrong with that?\n\nOne of the most complicated things about regulating journalism is … suddenly the regulators start deciding who's a journalist https://t.co/e8zLu0mSAW — Ben Smith (@BuzzFeedBen) October 21, 2019\n\nThe law is do to take effect January 1, 2020:\n\nCA's AB 5 bill author says the law's 35-submission limit for journalists is \"a little arbitrary\", as freelancers seek changes before the law takes effect Jan. 1 (@katiekilkenny7 / Hollywood Reporter)https://t.co/CbfZW93Y1Ghttps://t.co/iemTWiPXgb — Mediagazer (@mediagazer) October 19, 2019\n\n***", "description": "\"Narcissism in action.\"", "authors": ["Greg P.", "Posted At Am On October"], "top_image": "https://twitchy.com/wp-content/uploads/2018/01/grab-the-popcorn.jpg", "published_at": "2019-10-21"}