{"pub": "townhall", "url": "https://townhall.com/tipsheet/katiepavlich/2019/09/26/white-house-president-trump-has-nothing-to-hide-n2553754", "downloaded_at": "2019-09-26 14:49:12.860800+00:00", "title": "White House: President Trump Has Nothing to Hide", "language": "en", "text": "In response to the release of a whistleblower complaint and a letter from the Intelligence Community Inspector General Thursday morning, the White House is arguing President Trump has nothing to hide.\n\n\"Nothing has changed with the release of this complaint, which is nothing more than a collection of third-hand accounts of events and cobbled-together press clippings—all of which shows nothing improper. The President took the extraordinary and transparent steps of releasing the full, unredacted, and declassified transcript of his call with President Zelenskyy, which forms the heart of the complaint, as well as the complaint itself. That is because he has nothing to hide,\" White House Press Secretary Stephanie Grisham released in a statement. \"The White House will continue to push back on the hysteria and false narratives being peddled by Democrats and many in the main stream media, and President Trump will continue to work hard on behalf of the American people as he always does.”\n\nYesterday the White House voluntarily released the transcript of a July phone call between President Trump and Ukrainian President Volodymyr Zelensky. It was published after a whistleblower claimed President Trump improperly pressed Zelensky to investigation former Vice President Joe Biden and his son, Hunter Biden, in exchange for military aid. Nowhere in the call did this kind of quid pro quo appear.\n\n\"There's a lot of talk about Biden's son, that Biden stopped the prosecution and a lot of people want to find out about that so whatever you can do with the Attorney General [Barr] would be great. Biden went around bragging that he stopped the prosecution so if you can look into it...It sounds horrible to me,\" Trump said during the call.\n\n\"I wanted to tell you about the prosecutor. First of all I understand and I'm knowledgeable about the situation. Since we have won the absolute majority in our Parliament, the next prosecutor general will be 100% my person, my candidate, who will be approved by the parliament and will start as a new prosecutor in September. He or she will look into the situation, specifically to the company that you mentioned in this issue. The issue of investigation of the case is actually the issue of making sure to restore the honesty so we will take care of that and will work on the investigation of the case,\" Zelensky replied.\n\nMeanwhile, Acting Director of National Intelligence Joseph Maguire is testifying on Capitol Hill about the matter on Thursday.", "description": ".09/26/2019 10:45:28AM EST.", "authors": ["Katie Pavlich", "Cortney O'Brien", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/266/cdd80ea5-7d73-4f66-9231-9b3118d3b3b5.png", "published_at": "2019-09-26"}