{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/19/gustafson-chronicles-her-pro-basketball-journey-fo", "downloaded_at": "2019-09-19 09:39:28.784503+00:00", "title": "Gustafson chronicles her pro basketball journey for the AP", "language": "en", "text": "DALLAS (AP) - I have been playing the game of basketball since I was basically in diapers. For some reason, even back then I thought that putting an orange ball in a basket was quite entertaining. Fast forward about twenty-two years and this still rings true. I am currently living out my dreams as a professional basketball player for the Dallas Wings, and I would now like to take this time to reflect on everything that contributed to my life as a WNBA rookie.\n\nDo you remember that feeling in the last year of elementary school when you felt on top of the world? You were the oldest of all the other students in the school, and everything felt under your control. You had a schedule you were familiar with, and you had the same teacher that you loved. You had your same classmates that you hung out with during lunch every day.\n\nAnd then it all changed: middle school. - At least, this is how I imagined it would be, since I went to an extremely small school and middle school wasn’t all that different for me. Anyway, for the rest of you who went to larger schools, everything probably felt out of your control. You were suddenly thrown into a new building, had to go to different classrooms every hour, and you were forced to make new friends.\n\nWell, I can honestly say that my transition into the WNBA from college ball has gone something like this. A new city, new coaches, and new teammates. A new position, a new offense, and a new (and MUCH faster) pace! All of this newness hit me like a bus, and most of my time spent in training camp was figuring out how to deal with the aftermath.\n\nBeing a rookie, especially in this league, can mean a multitude of things. Whether that be rookie duties (like delivering laundry and uniforms to the other players on game day), roller coaster playing time, or information overloads during practices, trust me I have experienced all of this! I think the best piece of advice I can give to anyone who is entering the WNBA is to understand that there will be a huge, steep learning curve! This learning curve will ultimately be your pathway to success (or not), and it is up to you to fully embrace whatever role you are given.\n\nMy role this season has been to develop my game behind the scenes, implement what I have learned into games, provide a spark of energy whenever our starters needed a break, and to cheer on my teammates. When I was given a second chance with Dallas, I told myself that I was going to take full advantage of every single day and to trust that God’s plan is best!\n\nIf I could summarize everything that I learned this summer in the WNBA by using one word, it would have to be adaptation.\n\nIn the beginning of this summer I didn’t fit the typical mold of what a WNBA post player looks like. I’m undersized (even though I am 6‘3?). I was a back-to-the-basket type player. I was not considered to be an outside shooter. And perhaps most evidently because I was once on the outside looking in, desperately wanting a second chance. All these things and more could have easily counted me out of the WNBA. But guess what? I’m still here.\n\nI’m getting better every day and I love to learn. Currently my top two priorities are implementing a face-up game and improving my 3-point shooting. Most of my days in Dallas and while traveling all over the country were spent doing extra shooting workouts either before or after practices and during my off days. Practices are even more intensified compared to college, with each one requiring a full day’s worth of total focus physically, mentally, and emotionally within a few hours.\n\nOur home games consisted of dressing up for walk-in game-day outfit photoshoots, a far cry from the usual sweats that I arrived in for my college games. Traveling, however, as a WNBA player is not as glamorous as it may seem since we fly commercial. Every week we traveled to a different city across the country, and more often than not we had three or more games per week to play. Our team usually had practices right after we landed and got to our hotel, but the rest of the night we were on our own.\n\nI really grew to like this because that meant I had time to visit and get dinners with family and friends. On game days, either before or after, you probably could have found me in a random hotel fitness center on a treadmill or lifting weights to keep in shape. As a professional athlete, it is extremely important to have self-discipline in order to have longevity in this league. Self-discipline for getting in extra workouts to improve your game and maintain excellent physical shape, self-discipline for studying your opponents by utilizing the coaches and film, and self-discipline even for staying healthy and resting appropriately to recharge your body.\n\nThere is a lot that goes into the days of a professional basketball player - and most days are quite exhausting - but I know that at the end of the day I am doing what I love.\n\nWith the WNBA season over, I’m off to Budapest, Hungary, to play professionally over there this winter. You can follow my overseas adventures on my blog .\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "I have been playing the game of basketball since I was basically in diapers. For some reason, even back then I thought that putting an orange ball in a basket was quite entertaining. Fast forward about twenty-two years and this still rings true. I am currently living out my dreams as a professional basketball player for the Dallas Wings, and I would now like to take this time to reflect on everything that contributed to my life as a WNBA rookie.", "authors": ["The Washington Times Http", "Megan Gustafson"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/19/wings_gustafson_journey_basketball_51320_c0-203-3247-2096_s1770x1032.jpg?db451744423940dfa70fc70b5b778172a53ba1d3", "published_at": "2019-09-19"}