{"pub": "thenextweb", "url": "https://thenextweb.com/artificial-intelligence/2019/10/28/facebooks-new-ai-tweaks-video-so-you-cant-be-identified-by-face-recognition-tech", "downloaded_at": "2019-10-28 07:34:56.287284+00:00", "title": "Facebook's AI prevents you from being identified by face recognition tech", "language": "en", "text": "Facial recognition systems are all the rage among government agencies around the world, as they seek to automate services and keep tabs on their citizens. If there’s a picture of you somewhere, you could potentially be identified in photos and videos from public camera feeds. Now, Facebook has devised a way to thwart this technology.\n\nIts face de-identification tech, developed by three AI researchers who work with the company, modifies your face slightly in video content, so that facial recognition systems can’t match what they see in the footage with images of you in their databases.\n\nYou can see this in action in this video (screenshot above), in which certain details are tweaked, such as the shape of a person’s mouth, or the size of their eyes. Facebook says this can be used with pre-recorded content, as well as with live video.\n\nThis technology could allow for more ethical use of video footage of people for training AI systems, which typically require several examples to learn how to emulate the content they’re fed. By making people’s faces impossible to recognize, these AI systems can be trained without infringing on the test subjects’ privacy.\n\nI imagine this might soon become a standard requirement for government agencies and companies that capture footage of people, whether for security or other purposes. For example, since the state of California banned law enforcement agencies from using facial recognition tech recently, it could mandate that all footage of civilians be processed using a system that incorporates face de-identification tech in order to protect their privacy.\n\nVentureBeat succinctly explained how this de-identification method works:\n\n…the AI uses an encoder-decoder architecture to generate both a mask and an image. During training, the person’s face is distorted then fed into the network. Then the system generates distorted and undistorted images of a person’s face for output that can be embedded into video.\n\nThe outlet also noted that Facebook has no plans to use it in any of its own products. The social network uses facial recognition to identify your friends in uploaded photos for easier tagging, and also to alert you when you’re in someone else’s pictures. The company turned facial recognition off by default last month, which is a small step towards respecting its users’ privacy a bit more.\n\nFind out more about Facebook‘s face de-identification AI in this research paper (PDF).\n\nRead next: Oops — Adobe leaves 7.5 million Creative Cloud accounts exposed", "description": "Facebook's face de-identification tech modifies your face slightly in video content to thwart facial recognition systems.", "authors": ["Abhimanyu Ghoshal"], "top_image": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2FFacebook-face-de-identification-technology-AI-hed.jpg&signature=499411acfd073686b164b934ecbb88d7", "published_at": "2019-10-28"}