{"pub": "cbc", "url": "https://cbc.ca/sports/tennis/bianca-andreescu-us-open-cool-confident-1.5269277", "downloaded_at": "2019-09-04 03:46:31.588776+00:00", "title": "Sports-no-CBC", "language": "en", "published_at": "2019-08-24", "text": "Serena Williams has called her an \"old soul.\"\n\nOthers have called her \"a boss\" on the court.\n\nThe youthful Canadian, 19-year-old Bianca Andreescu, is just getting started.\n\nAfter her second match victory at her first-ever U.S. Open, Andreescu was asked in a post-match interview if anyone scares her at this point.\n\n\"If I just go out there and play my game, I think I can beat anyone right now,\" she said without hesitation.\n\nShe's got the swagger of a champion. The confidence of a player who has won Slams before. And yet this is all new to Andreescu.\n\nWATCH | Andreescu defeats Townsend in 3 sets:\n\nThe 19-year-old Canadian battled past American Taylor Townsend 6-1, 4-6, 6-2 under the lights at Arthur Ashe Stadium. 1:51\n\nYou'd never know it.\n\nThe Mississauga, Ont. native has taken the tennis world by storm this year. And now she's preparing to take to the Arthur Ashe Stadium court Wednesday night for the biggest match of her career.\n\nAs the stakes get higher, the pressure greater, Andreescu keeps rising. She is 16-3 in three-set matches this year, including 11 straight wins. She's 42-4 on the season. Andreescu missed some of the season due to injury. Outside of that she's been nearly unbeatable.\n\nWhat Andreescu is in the midst of right now is nothing short of remarkable.\n\nNow she's preparing to play in her first-ever Grand Slam quarter-final inside the tennis coliseum that is Arthur Ashe Stadium — the largest tennis venue in the world. It's the third time during this year's Open that Andreescu is playing at Ashe.\n\nBianca Andreescu was lauded for comforting Serena Williams when the American star was forced to withdraw from the final of the Rogers Cup last month, handing the 19-year-old Canadian her second WTA win this year. (Vaughn Ridley/Getty Images)\n\nIf she was supposed to be shaken and fazed by the big stage, she's hasn't been.\n\nReminder – Andreescu has never played at the U.S. Open before. Last year she lost in qualifying for the tournament.\n\nBut what a difference a year makes.\n\nAndreescu defeated American qualifier Taylor Townsend 6-1, 4-6, 6-2 on Monday night in front of a rowdy and sometimes rude New York crowd to advance to a final-eight meeting Wednesday with No. 25 seed Elise Mertens of Belgium.\n\n\"I heard some Canadian fans here and there, which was nice, especially in tougher moments,\" Andreescu said after Monday's win. \"It's not easy. I tried not to pay attention to that, but it's hard when it's, like, everyone. I'm glad with how I managed to just keep my cool.\"\n\nAndreescu has provided some memorable moments on the court in her short time in the spotlight.\n\nIt was only last month that she shared that emotional moment on the court in the Rogers Cup Final with Serena Williams.\n\n\"I'm sorry I couldn't do it today,\" Williams said, crying after retiring from the match just four points in. \"Bianca, you're a great sportsperson, woman.\"\n\nBianca Andreescu has been called \"a boss\" on the court, a tribute to her strong play and all-around game. (AFP/Getty Images)\n\nAndreescu then took the microphone at centre court to soak up her championship moment — once again showing poise and grace in the big moment, beginning with acknowledging her competitor.\n\n\"Serena you made me cry. I know how hard it is to pull out of a tournament due to injury. It's not easy,\" Andreescu began. \"This isn't the way I expected to win. You are truly a champion. I've watched you play so many times. You are truly a champion.\"\n\nIt was this moment that won Williams over. In her post-match interview she called Andreescu an old soul for her grace in that moment.\n\nIt sent Andreescu's stardom into greater orbit.\n\nThere's an authentic exuberance and joy that exudes from Andreescu whenever she's in front of the microphone. She seems to be soaking up every one of these moments right now.\n\nAnd while she's shown her ability to act mature beyond her years on the court, finding the right words at the right time and the right shots under pressure, there are still moments that remind spectators of her youth.\n\nLast week when she was told she had cracked the top 10 of the Women's Tennis Association rankings, Andreescu's reaction was memorable.\n\n\"I don't usually check these things, I like to just focus on my game,\" she said, trying to hold back a surprised laughter.\n\n\"Wow, that's all I can say right now.\"\n\nWow, is right. Andreescu has taken Canadian tennis fans on a journey unrivaled in this country.\n\n\"This is just the beginning,\" she said after her Rogers Cup win.\n\nAll you can do is believe her.", "description": "She's got the swagger of a champion. The confidence of a player who has won Grand Slams before. And yet this is all new to Canada's Bianca Andreescu.", "authors": ["Cbc Reporter", "Devin Heroux Reports For Cbc News", "Sports. He Is Now Based In Toronto", "After Working First For The Cbc In Calgary"], "top_image": "https://i.cbc.ca/1.5269436.1567559273!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1165787848.jpg"}