{"pub": "reuters", "url": "https://in.reuters.com/article/us-vale-sa-bhp-group-au-samarco/vale-bhps-samarco-gets-license-to-resume-operations-after-dam-burst-idINKBN1X42GW", "downloaded_at": "2019-10-25 23:58:03.826659+00:00", "title": "Vale, BHP's Samarco gets license to resume operations after dam burst", "language": "en", "text": "RIO de Janeiro (Reuters) - Samarco, a joint venture between Vale SA (VALE3.SA) and BHP Group (BHP.AX), on Friday won permission to resume operations at their Germano iron ore mine, the environmental regulator of the Brazilian state of Minas Gerais said, roughly four years after a fatal dam collapse there.\n\nVale said in a separate release that it expected production at the joint venture, which is trying to restructure $3.8 billion in debt it defaulted on about a year after the accident, to resume toward the end of 2020.\n\nResumption will be contingent on a filtration system - which will take about a year to build - that will allow Samarco to use a “dry stacking” technology to dispose of minings waste, replacing the previous tailings dam based system, the company said.\n\nThe mine, which once produced nearly 25 million tonnes of iron ore a year, will restart at an annual rate of less than a third of that, Vale said, with a potential increase to 14 to 16 million within another six years.\n\nThe Samarco joint venture signed a deal with state and local authorities in March 2016 to create a foundation to oversee the cleanup and after the disaster. It has spent over 6 billion reais ($1.50 billion) so far but some victims have complained about the pace of rebuilding efforts.\n\nVale and BHP have previously denied media reports that they were negotiating a deal that would see the Anglo-Australian multinational unload its stake in the joint venture.\n\nVale on Friday reported weaker-than-expected earnings nine months after another fatal mine accident which has sparked a renewed effort by the company to dismantle its most dangerous tailings dams.", "description": "Samarco, a joint venture between Vale SA and BHP Group , on Friday won permission to resume operations at their Germano iron ore mine, the environmental regulator of the Brazilian state of Minas Gerais said, roughly four years after a fatal dam collapse there.", "authors": ["Marta Nogueira", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-25"}