{"pub": "businessinsider", "url": "https://businessinsider.com/apple-news-does-not-boost-local-news-2019-9", "downloaded_at": "2019-09-13 18:32:08.181796+00:00", "title": "Apple News is favoring national and international outlets over local news", "language": "en", "text": "Apple News, which has 85 million active users, is reportedly glossing over local publishers in favor of national and international outlets, per Columbia Journalism Review. Business Insider Intelligence\n\nCJR showed that in the Trending section, the top 20% of news publishers accounted for 80% of articles — and they're largely not local sources. The service, which was launched in 2015, can be a major driver of traffic to news sites — the Top Stories category accounted for over half of Vox's traffic some days, for instance.\n\nThe dearth of local news is an issue for Apple's service, which boasted about its choice to utilize humans to avoid scandals when it comes to what information gets spread, and who gets highlighted. Tech giants have caught flak for suffocating publishers in general, and local news outlets in particular, and these news aggregation services are meant to pay some of that back by highlighting news and directing traffic to publisher sites.\n\nWhen local publishers do appear in Apple News \"Top Stories,\" they're often overshadowed — even when they were responsible for breaking a story first. Only 8% of articles in the section came from local news outlets, even though local and regional publishers accounted for over 20% of total sources, with not a single cited source in Trending Stories coming from local or regional papers.\n\nThis is in stark contrast to details leaked earlier this week about the prioritization process for editors of Facebook's forthcoming News Tab, which makes it a point to promote local news. Among other priorities, Facebook's editors will promote stories broken by local news outlets, especially when they become national stories. Facebook has faced heavy scrutiny for crushing the local news industry in recent years, and the company itself even found that about one-third of all Americans lack access to real, local reporting.\n\nIn response, the company has launched a number of conciliatory efforts, including The Facebook Accelerator Project and the Facebook Journalism Project, which will injectbetween $5,000 and $25,000 to 23 different newsrooms. But so far, these efforts have proven to be too little to save the industry, and local news outlets continue to struggle. While the execution of Facebook's newly hired News Tab editors is still a question mark, instituting mechanisms to prioritize local news in a systematic way could prove a more effective fix than past efforts.\n\nApple — and other news aggregators — should consider using similar principles in order to live up to their promises of supporting local news and avoid facing backlash similar to that which plagued Facebook.\n\nInterested in getting the full story? Here are two ways to get access:", "description": "Apple News is favoring national and international outlets over local ones – only 8% of articles in the \"Top Stories\" section came from local outlets.", "authors": ["Mariel Soto Reyes"], "top_image": "https://amp.businessinsider.com/images/5d7bab612e22af23876dd212-1136-568.jpg", "published_at": "2019-09-13"}