{"pub": "financialpost", "url": "https://business.financialpost.com/investing/investing-pro/dont-let-the-mini-deal-fool-you-china-and-the-u-s-are-still-a-long-way-from-resolving-trade-war?video_autoplay=true", "downloaded_at": "2019-10-17 14:22:47.029010+00:00", "title": "Don't let the mini-deal fool you: China and the U.S. are still a long way from resolving trade war", "language": "en", "text": "Well, that wasn’t such a big “deal,” was it? As the days go by, the Trump administration’s agreement in principle with China on trade — announced by the President late last week — is looking more and more provisional, circumscribed and short-term. After months of a tariff war that nobody outside 1600 Pennsylvania Ave. really wanted, you have to wonder what it’s all about.\n\nIn the broad strokes, China has agreed to buy US$40-billion to US$50-billion worth of agricultural products from the States every year, which would almost double U.S. farm exports to China — and it’s not at all clear that American farmers could meet that demand anyway. As well, China is offering to not manipulate its currency to benefit its trade position, to open up its market to U.S. financial services firms and to enhance copyright protection — all commitments, it needs to be noted, that it has made before. Apparently, the concessions are to be accompanied by an “elaborate” consultation process, as U.S. trade representative Robert Lighthizer described it, to resolve disputes — which is not exactly the same as a real enforcement mechanism.\n\nThe U.S., meanwhile, has agreed to not implement a tariff rate hike planned for this month. And that’s pretty much it. The extant punitive tariffs, on both sides, remain intact. Thornier issues around China’s treatment of data, its manufacturing sector or government support of its companies — well, that’s to be left for the next phase of negotiations.\n\nImportantly, nothing has been signed, and there will be more talks before there is — probably a month away at the soonest. In the anything-can-happen world of the U.S.-China trade war, that’s an eternity. In the meantime, we are all left to wonder whether the agreement in principle is worth the paper it’s not written on.\n\nShould it come to fruition, this mini-agreement will not be nothing, of course. But it will still be a far cry from a resolution. And it muddies the outlook for what that resolution might eventually look like, or achieve.\n\nTrump had previously rejected anything but a big, comprehensive agreement; now, it seems his administration is quite willing to entertain “progress” by increments. You might take encouragement from thinking that this is at least a small step toward a bigger deal, but if that deal were anywhere near closing, then why announce this small step at all? Why not wait to wrap it into the larger agreement? If anything, not doing so might suggest that a real end to the trade war is still far out of reach.\n\nIncrementalism might also be playing into China’s hand. Given the political situation in the United States, time is on its side. With an impeachment battle to fight and an election campaign to run, the Trump administration will have plenty of other things to worry about should, as seems likely, negotiations drag on well into next year. As the clock ticks, China gets closer and closer to perhaps not having to deal with Trump at all come next November. Should its endgame be to wait Trump out until he is no longer President, it’s in China’s interests to drag this out for as long as possible. The mini-deal also suggests that it can afford to do so.\n\nGauging the success of Trump’s China trade strategy would be easier if the goals were clearer. At first, the putative objective was to eliminate the U.S. trade deficit with China — one of the president’s favourite hobbyhorses on the campaign trail. Then the target shifted to something more ambitious: fundamental, structural reform to the way China manages its economy and competes in global markets. The U.S. has tried to apply pressure by slapping Chinese imports with tariffs, but China has called the bluff. After all, incremental market reform was what China was already doing. With this small agreement, it gets some pain relief without giving up very much.\n\nMore importantly, despite tough talk on trade, Trump has given a pass to China and leader-for-life Xi Jinping in one area where they are really vulnerable: human rights and political freedom. The President has been far less than critical of China’s violent response to pro-democracy demonstrations in Hong Kong; he has said nothing about its repression of the Muslim Uyghur population in Xinjiang. By focusing solely on the economic relationship, however dysfunctional, the U.S. is not only vacating the moral high ground, but also setting aside a lever with which to apply political pressure towards economic reform.\n\nSo, in short, don’t hold your breath for an end to the trade war. And if anything has changed about the way China conducts itself economically or politically when it does end, expect the pace of reform to be incremental and slow — pretty much as it was before the U.S. implemented its first China-specific tariffs in July 2018.\n\nWhich makes you wonder: What was the point of the war in the first place?", "description": "Joe Chidley: After months of a tariff war nobody outside 1600 Pennsylvania Ave. really wanted, you have to wonder what the point of all this was in the first place", "authors": [], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/trump-china-2.jpg", "published_at": "2019-10-17"}