{"pub": "politico", "url": "https://politico.com/story/2019/09/12/warren-2020-social-security-1491222", "downloaded_at": "2019-09-12 12:44:49.124020+00:00", "title": "Warren unveils far-reaching Social Security plan", "language": "en", "text": "Sen. Elizabeth Warren. | Scott Eisen/Getty Images democratic candidates policies Warren unveils far-reaching Social Security plan\n\nElizabeth Warren is staking out new, progressive territory with an expansive Social Security plan, moving further to the left in the 2020 field.\n\nThe Massachusetts senator pledged to increase current and future Social Security benefits by $200 a month and change rules to expand access to the program for a range of vulnerable groups, including low-income families, widows and caretakers.\n\nStory Continued Below\n\nTo pay for the expansion, Warren’s proposal would increase payroll taxes and establish new investment taxes on the highest-earning Americans.\n\nWarren’s proposal also goes several steps beyond her top-polling rivals, former Vice President Joe Biden and Sen. Bernie Sanders, on their own Social Security plans. Warren’s progressive push on a program that’s popular, particularly among older voters, is a clear play for drawing distinctions for herself, while also appealing to a key Democratic primary voter bloc.\n\n“This is about challenging Biden and making a play for the senior vote,” said one person outside the Warren campaign, but with direct knowledge of the Social Security proposal.\n\nPOLITICO Playbook newsletter Sign up today to receive the #1-rated newsletter in politics Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nDespite increasing benefits, Warren’s proposal would keep the program solvent through 2054, according to an analysis by Moody’s Analytics’ Mark Zandi. Under its current status, Social Security is expected to run out of funds in 2035, according to the Social Security Trustees report released in 2019, a timetable that could force benefits to be reduced.\n\n“Unless we act now, future retirees are going to be in even worse shape than the current ones,” Warren wrote in a Medium post, released Thursday morning. “We need to get our priorities straight. We should be increasing Social Security benefits and asking the richest Americans to contribute their fair share to the program.”\n\nWhat would the plan do?\n\nWarren calls for a series of expansions and changes to the Social Security system, including increasing average monthly income by $200 for all Social Security beneficiaries.\n\nThe goal is to shore up a popular program, which is currently facing a cash crunch. Democrats, including Warren, have argued in recent years that Congress should not only preserve Social Security but build on it, as well. As evidence for growing the program, some Democrats point to an increasing share of retirees who are reliant on Social Security as their sole income and the fact that 20 percent of seniors, a record high, are still in the workforce during their retirement years.\n\nIn her proposal, Warren pledges to repeal the Windfall Elimination Provision and the Government Pension Offset, two provisions that limit the amount of benefits for public-sector workers. She also calls for broader coverage for low-income workers by requiring that all those who have put in 30 years of Social Security-covered work will receive an annual benefit of at least 125 percent of the federal poverty line when they retire.\n\nWarren would also broaden what is classified as work under Social Security. She would include people who exit the workforce to care for a family member by crediting their average lifetime earnings with that time. Americans who provide 80 hours a month of unpaid care to a child under 6, a dependent with a disability or an elderly relative would see that reflected in their Social Security earnings.\n\nFor widows and widowers, the plan would also eliminate the minimum age requirement so that they “can receive their full survivor benefits at any age without a reduction,” according to the proposal.\n\n“Social Security benefits track with your income during your working years,” Warren wrote. “That means pay disparities and wrongheaded notions that value salaried work over time spent raising children or caring for elderly relatives carry forward once you retire. That needs to change.”\n\nHow much will it cost?\n\nWarren’s plan doesn’t put a specific price tag on the changes. Rather, her campaign said the plan would extend Social Security’s solvency until 2054, according to one analysis.\n\nBut she does explain how she’d raise the revenue for expanding benefits: charging the top 2 percent of American earners by increasing payroll taxes, removing the Social Security cap on maximum earnings and adding an investment tax.\n\nHow would it work?\n\nIn order to make ambitious expansions to Social Security, Warren’s proposal laid out several ways to raise revenue to cover the cost, including raising the payroll cap on contributions to Social Security.\n\nFirst, Warren’s plan would require Americans earning more than $250,000 to contribute 14.8 percent to Social Security, splitting that rate evenly between employees and employers, at 7.4 percent each. Currently, Americans pay 12.4 percent into Social Security — 6.2 percent by the employee and 6.2 percent by the employer.\n\nSecond, the plan would create a new Social Security contribution requirement on net investment income for individuals earning $250,000 a year or families making more than $400,000.\n\nWarren also pledged to close loopholes in the Net Investment Income Tax, so that the “contribution requirement will ensure that the very wealthy are paying into Social Security even when they report the bulk of their income as capital returns rather than wages,” her post said.\n\nHow does it compare?\n\nSeveral Democratic presidential candidates are proposing changes to Social Security, but Warren’s plan is among the most ambitious.\n\nShe has proposed the most aggressive increases to the payroll cap and the contribution rate for individuals making more than $250,000. By contrast, Biden calls for lifting the cap on “high-wages,” but does not define the range. Sanders also calls for raising the cap to $250,000, but does not increase the contribution rate.\n\nSanders also calls for a tax on investment income, but his rate would be 6.2 percent versus Warren’s 14.8 percent.\n\nAlex Thompson contributed to this report.", "description": "Warren’s proposal would increase payroll taxes and establish new investment taxes on the highest-earning Americans.", "authors": ["Elena Schneider"], "top_image": "https://static.politico.com/ae/d0/6b87235f42ceaaa6b2edb345c870/190911-warren-gty-773.jpg", "published_at": "2019-09-12"}