{"pub": "foxbusiness", "url": "https://foxbusiness.com/markets/nio-tesla-of-china-burns-through-cash-gets-200m-lifeline", "downloaded_at": "2019-09-24 15:17:28.611774+00:00", "title": "Nio, the Tesla of China, crashes after saying it needs $200M", "language": "en", "text": "Chinese electric-car maker Nio is fighting for its survival.\n\nContinue Reading Below\n\nNio on Tuesday said it needed to raise $200 million from chief executive William Li and the Chinese gaming giant Tecent, one of its largest shareholders, after it burned through cash at a faster rate in the second quarter. The company also announced plans to cut about 2,000 jobs, or 20 percent of its workforce.\n\nShares plunged on the news.\n\nTicker Security Last Change %Chg NIO NIO INC 2.11 -0.61 -22.43%\n\n“These measures aim to further improve efficiency and streamline operations within our sales and service network and R&D activities,” Li said in the press release, adding that Nio aims to pursue a “leaner operation through additional restructuring and spinning off some non-core businesses by year end.”\n\nAdvertisement\n\nThe electric-car maker said in its second-quarter earnings release that a reduction of an electric-vehicle subsidy and slowing macroeconomic conditions exacerbated by the U.S.-China trade war led to a 7.9 percent quarter-over-quarter drop in vehicle sales.\n\nNio, in June, recalled more than 4,800 vehicles due to faulty batteries, and said its prioritizing of battery manufacturing capacity \"significantly affected production and deliveries.\"\n\nThe conditions helped spur a loss of 3.3 billion Chinese yuan ($478.6 million) in the April to June quarter, up 83 percent year over year.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nNio canceled its second-quarter earnings call that was scheduled for Tuesday.\n\nShares were down 66.6 percent this year, including Tuesday's losses.", "description": "Nio is fighting for its survival.", "authors": ["Jonathan Garber"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/nio-Getty.jpg?ve=1&tl=1", "published_at": "2019-09-24"}