{"pub": "vice", "url": "https://vice.com/en_asia/article/gyzynq/india-finance-minister-sitharaman-says-car-sales-are-slumping-because-of-millennials", "downloaded_at": "2019-09-12 07:10:17.232612+00:00", "title": "India’s Finance Minister Says Car Sales Are Slumping Because of Millennials", "language": "en", "text": "This article originally appeared on VICE India.\n\nIndia’s automobile industry, one of the country’s biggest employers, has crashed into one of the worst slumps. According to data released by the Society of Indian Automobile Manufacturers (SIAM) on September 9, domestic car sales fell for the tenth straight month in August, declining 31.57 percent to 1,96,524 units from 2,87,198 units in the year-ago period, the lowest in two decades. This is probably happening because of reasons ranging from higher interest rates for car loans, rise in fuel prices, transition to the Bharat Stage Emission Norms (BS VI) to regulate the emission of air pollutants, fine hikes under the recently imposed Motor Vehicles Act, the government considering banning internal combustion engine (ICE) vehicles to shift towards electrically powered cars, increased cost of mandatory car fittings like airbags and reverse sensors, and a general GDP slowdown. But India’s finance minister, Nirmala Sitharaman, says that it’s the millennials’ mindsets that are to blame for the car sales slowdown.\n\nSpeaking about the slowdown at a press conference on Tuesday, September 10, Sitharaman said, “Some studies show that millennials do not want to commit to an Equated Monthly Installment (EMI) to buy a vehicle, and prefer Ola, Uber and metro services.”\n\nWhile she acknowledged that this was one of the factors and said the government was working towards solving the problem, her statement has also made her the target of meme-making millennial trolls on Twitter, leading to the sarcastic hashtag #BlameMillennials trending.\n\nSome millennials are pissed off that fingers are being pointed at them merely for wanting to save funds in the midst of an unemployment crisis and bad economy, especially considering that early research suggests that using cabs and carpool apps can actually be better for the environment.\n\nOthers have also pointed out that Sitharaman is promoting a culture of millennial-blaming, in which those born between 1981 and 1996 are held responsible for killing everything from the economy to the sale of cereal boxes, even though a US Federal Reserve Board research paper said that their consumer habits do not differ significantly from earlier generations.\n\nEven as millennials mock Sitharaman's statement, some say that her theory makes logical sense since the entry of cab apps in India has taken away the appeal of owning a luxury car for many, although it's more likely that the auto industry is a domino in a toppling economy.\n\nMeanwhile, the government is under pressure from the auto industry over reducing insurance costs and slashing GST rates across vehicle categories to drive more car sales.\n\nFollow Shamani Joshi on Instagram.", "description": "Nirmala Sitharaman believes that the millennials’ preference for cab services like Ola and Uber, and public transport is the reason the automobile industry is in breakdown mode.", "authors": [], "top_image": "https://video-images.vice.com/articles/5d78c6815ee5bb000825cc3c/lede/1568197735081-Indias-finance-minister-says-millennials-are-the-reason-car-sales-are-slumping.jpeg?crop=1xw:1xh;center,center&resize=1200:*", "published_at": "2019-09-12"}