{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7556243/Scots-furious-die-World-Cup-clash-Japan-cancelled-Typhoon-Hagibis.html", "downloaded_at": "2019-10-09 22:12:28.855230+00:00", "title": "Scots would be 'furious' if do-or-die World Cup clash with Japan is cancelled due to Typhoon Hagibis", "language": "en", "text": "SRU chiefs would be 'furious' if Scotland's crucial World Cup clash with Japan falls foul of Typhoon Hagibis and remain confident the game will be played even if it is delayed by 24 hours.\n\nEngland's World Cup clash with France in Yokohama on Saturday is already off — the first time in the 32-year history of the tournament that a fixture has been cancelled.\n\nAnd, in the wake of Scotland's 61-0 victory over Russia in their penultimate Pool A encounter on Wednesday, there was growing speculation that the encounter with Japan in Yokohama on Sunday would suffer a similar fate – effectively knocking Gregor Townsend's side out of the tournament.\n\nGregor Townsend is desperate for Scotland's clash with Japan not to be cancelled\n\nSuper Typhoon Hagibis is heading towards Tokyo and Yokohama and will cause havoc\n\nWorld Rugby were due to meet early on Thursday morning to discuss the matter and, with so much at stake for both teams, there appears to be a desire to ensure that the match does take place.\n\nSenior SRU sources have told Sportsmail that they made their position clear and that they would be shocked if a solution was not found, whether that would mean delaying the game 24 hours or moving it to another venue away from the storm.\n\n'We are confident that we will play Japan somewhere,' a source told Sportsmail. 'Yes, this World Cup is in Japan and they are doing a grand job as hosts but it is World Rugby that still have a big say in the final decision-making. It is their tournament.\n\n'We have been fighting tooth and nail to get the game played ever since we heard the typhoon might be coming our way. We take the threat that brings very seriously indeed but it wouldn't be fair for us to go out of the tournament in such a way.\n\n'We are actually pretty relaxed that we will play Japan either on the Sunday or the Monday and will sleep soundly because of that.\n\n'We didn't think the game would be switched as that is a logistical nightmare, although it might have to be if there is no other option.\n\n'Also, look at the bigger picture. The anticipation and excitement around the game, the television rights, the Scotland fans coming from all over the world to support us. It is beneficial not just for us for this game to go ahead but for the whole tournament.\n\n'We think it will and would be furious and surprised if it didn't at some stage.'\n\nUnder World Cup rules, if a match is not played on its designated day, it is viewed as a 0-0 draw, with two points awarded to both teams.\n\nAssuming Ireland secure a bonus-point win over Samoa on Saturday — a match that had initially looked under threat from the weather — they would qualify from Pool A, with Japan joining them if their game against Scotland does not take place.\n\nScotland would be dumped out of the World Cup if they do not get to play their game\n\nIt would, therefore, obviously suit the Japanese for the game to be cancelled completely, leaving Scotland on the next flight home.\n\nThe storm is expected to hit Tokyo and Yokohama on Saturday, hence the decision to call off England's match with France, with both sides already through to the knockout stage.\n\nThe fixture was due to take place in the evening, at around the time Typhoon Hagibis is expected to pass through the area, wreaking havoc.\n\nThe tropical storm is being classified as 'violent' by Japanese meteorologists, with wind speeds likely to exceed 160mph.\n\nThere is still a chance it could change course again and it remains to be seen if World Rugby will delay making a final decision regarding Scotland's game.\n\nThe 40,000-seater stadium at Oita has also been put forward as a possible change of venue if the game was moved from Yokohama.\n\nAlthough Scotland would agree to playing there as a last resort, Sportsmail understands they would prefer the game to be in Kobe.\n\nThere is still a hope that the storm could change course and a decision might be delayed\n\nThey spent eight days there and beat Samoa in the local stadium before they took on Russia in Shizuoka.\n\nWorld Rugby have emphasised their priority commitment to the safety of participants and spectators, but they will also be desperate to avoid significant disruption.\n\nWhile the governing body claim to have insurance which covers such freak occurrences, the loss of two fixtures at the 70,000-capacity Yokohama Stadium would lead to losses of approximately £30million.\n\nLast month, Typhoon Faxai caused considerable damage and led to transport chaos in and around Tokyo, and that was not on the scale of Hagibis, which means 'velocity'.\n\nWhile Tokyo was preparing for the latest storm — with early indications that the vast, busy rail network would shut down this weekend — there were also two earthquakes under the city, measuring 4.5 and 3.5 on the Richter scale.", "description": "SRU chiefs would be 'furious' if Scotland's crucial World Cup clash with Japan falls foul of Typhoon Hagibis and remain confident the game will be played even if it is delayed by 24 hours.", "authors": ["Rob Robertson For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/22/19511232-0-image-a-51_1570655572320.jpg", "published_at": "2019-10-09"}