{"pub": "yahoo", "url": "https://yahoo.com/entertainment/marvels-jeremy-renner-responds-one-112100778.html", "downloaded_at": "2019-10-16 03:57:28.165538+00:00", "title": "Marvel's Jeremy Renner responds to \"one-sided\" death threat allegations from ex-wife", "language": "en", "text": "From Digital Spy\n\nMarvel's Jeremy Renner has responded to allegations from his ex-wife Sonni Pacheco, branding them \"one-sided\".\n\nIn a lawsuit filed against Renner, it was alleged that the Avengers actor threatened to kill himself and his ex-wife, and on one occasion stuck a gun in his mouth before shooting the ceiling.\n\nView photos Photo credit: Getty Images More\n\nThe Hawkeye actor, who is currently in the midst of a custody battle with Pacheco over their 6-year-old daughter Ava, has now hit back at the \"dramatisations\" in his ex-wife's declaration, claiming she made her account with a \"specific goal in mind\".\n\nIn a statement to TMZ, Renner's representative said: \"The well-being of his daughter Ava has always been and continues to be the primary focus for Jeremy.\n\n\"This is a matter for the court to decide. It's important to note the dramatisations made in Sonni's declaration are a one-sided account made with a specific goal in mind.\"\n\nView photos Photo credit: Rob Kim - Getty Images More\n\nRenner and Pacheco married in January 2014 and filed for divorce in the same year in December.\n\nAt the time of their split, Pacheco cited \"irreconcilable differences\" as the reason for their divorce.\n\nBoth parents are seeking full custody of their daughter, with a court hearing set for November 7.\n\nDigital Spy is launching a newsletter – sign up to get it sent straight to your inbox.\n\nWant up-to-the-minute entertainment news and features? Just hit 'Like' on our Digital Spy Facebook page and 'Follow' on our @digitalspy Instagram and Twitter accounts.\n\nYou Might Also Like", "description": "The pair are fighting for custody of their daughter.", "authors": ["Chris Edwards"], "top_image": "https://s.yimg.com/uu/api/res/1.2/XQiK0pyqAwJOZHvZ16YqnQ--~B/aD04Mzg7dz0xNjY5O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/digital_spy_281/0b81ee4d5efa03518947104514ed8366", "published_at": "2019-10-15"}