{"pub": "npr", "url": "https://npr.org/2019/09/17/761511898/american-becomes-1st-person-to-swim-english-channel-four-times-without-stopping", "downloaded_at": "2019-09-17 23:25:15.260805+00:00", "title": "American Becomes 1st Person To Swim English Channel 4 Times Without Stopping", "language": "en", "text": "American Becomes 1st Person To Swim English Channel 4 Times Without Stopping\n\nEnlarge this image toggle caption Jon Washer/AP Jon Washer/AP\n\nSarah Thomas, an American ultramarathon swimmer, has just completed a swim that no other human on the planet has ever accomplished.\n\nThe 37-year-old from Colorado plunged into waters off the shore of Dover, England, in the wee hours of Sunday morning. Her goal: swim the entire length of the English Channel.\n\nThen do it again.\n\nAnd again.\n\nAnd again.\n\nThomas completed the final leg of her swim at around 6:30 a.m. local time Tuesday in just over 54 hours— the first person to cross the channel four times without stopping.\n\nAccording to the Channel Swimming Association, the English Channel is about 21 miles wide.\n\nIn an interview with the BBC, Thomas said she was in disbelief that she had done it and was surprised by a group of well-wishers who were waiting for her on shore when she got out of the water.\n\n\"I'm really just pretty numb,\" she said. \"There was a lot of people on the beach to meet me and wish me well and it was really nice of them, but I feel just mostly stunned.\"\n\nShe also told the BBC that she planned to sleep the remainder of the day, adding: \"I'm pretty tired right now.\"\n\nJust a year ago, Thomas was completing treatment for breast cancer. In a Facebook post on Saturday, a day before starting her epic exploit, Thomas dedicated her swim to \"all the Survivors out there.\"\n\n\"This is for those of us who have prayed for our lives, who have wondered with despair about what comes next, and have battled through pain and fear to overcome,\" she wrote. \"This is for those of you just starting your cancer journey and those of you who are thriving with cancer kicked firmly into the past, and for everyone in between.\"\n\nThe Guardian points out that Thomas is not the first person to swim across the English Channel multiple times — four swimmers have crisscrossed it three times without stopping.\n\nAs the crow flies, Thomas' swim should have been approximately 80 miles long. But the journey ended up being more than 130 miles because of the tides, the Guardian reports.\n\nThe newspaper also says Thomas drank a carbohydrate-laden shake every half hour to keep her body replenished. Her mother, Becky Baxter, said the shake was \"tied to a rope\" and tossed to Thomas from a nearby boat where a crew was keeping a watchful eye on her.\n\nEnlarge this image toggle caption track.rs/ssthomas3; ESRI-National Geographic track.rs/ssthomas3; ESRI-National Geographic\n\n\"She drinks a third of that bottle in 10-15 seconds, and then she takes off again,\" Baxter said, according to the Guardian. \"She is a freak of nature. She really had to dig deep to finish this. She could have quit many, many times. There were several obstacles, but she never quits.\"\n\nBefore Thomas' final leg, a member of her team posted on Facebook about water conditions in the channel at the time: \"Dark, windy, and choppy conditions tonight for the final leg of the English Channel 4 way crossing.\"\n\nAnd there were other obstacles. Thomas told the BBC that the salt water hurt her throat, mouth and tongue.\n\nThe currents on the last leg pushed her \"all over,\" she told the broadcaster, adding: \"I got stung in the face by a jellyfish. [The water] wasn't as cold as I thought it might be, but it was still chilly.\"\n\nThe official Twitter account for the Channel Swimming & Piloting Federation, the governing body for English Channel swimming, called Thomas \"an absolute legend.\"", "description": "Sarah Thomas of Colorado plunged into the record books with her 54-hour feat. She finished Tuesday and said she was stung on the face by a jellyfish during the 130-mile swim.", "authors": ["Brakkton Booker"], "top_image": "https://media.npr.org/assets/img/2019/09/17/ap_19260290279108-1-_wide-1e869a6d8b563af073e0c7e73a67d650c8ba86e4.jpg?s=1400", "published_at": "2019-09-17"}