{"pub": "businessinsider", "url": "https://businessinsider.co.za/photo-video-nasas-hubble-space-telescope-spots-interstellar-comet-2019-10", "downloaded_at": "2019-10-16 20:58:06.371699+00:00", "title": "NASA's Hubble space telescope just took incredible photos of a visiting comet from another star system", "language": "en", "text": "NASA's Hubble Space Telescope has snapped a clear photo of the second interstellar visitor ever detected in our solar system.\n\nThe comet, called 2I/Borisov, came from an unknown star system. It's hurtling past the sun at 177,000 km per hour and is expected to pass close to Mars later this month.\n\nThe photos and time-lapse video from Hubble show a halo of dust surrounding the object's unseen core, just like comets from our own solar system. That's very different than the first interstellar object ever detected, 'Oumuamua, which was an inactive rock.\n\nAstronomers worldwide are racing to study 2I/Borisov with other telescopes. More Hubble observations are scheduled for the coming months.\n\nVisit Business Insider SA's homepage for more stories.\n\nThe second interstellar visitor ever detected is plummeting into our solar system, and NASA's Hubble telescope just snapped a clear photo of it.\n\nThe comet, known as 2I/Borisov, came from another star system, though astronomers don't know exactly where yet. It's named for the amateur astronomer who first spotted it on August 30: Gennady Borisov, who lives in Crimea. Nearly a month later, the International Astronomical Union (IAU) confirmed the object's interstellar origins.\n\nThe comet is hurtling past the sun at speeds of 177,000 km per hour, then is expected to fly near Mars this month, passing outside the planet's orbit and getting no closer to Earth than 300 million kilometers).\n\n2I/Borisov is only the second interstellar object ever found to be passing through our solar system. The first such object, themysterious and cigar-shaped 'Oumuamua (which a few scientists controversially argued could be alien in origin), sped past Earth at a distance of 24 million km in October 2017.\n\n\"The main difference from 'Oumuamua and this one is that we got it a long, long time in advance, \" Olivier Hainaut, an astronomer with the European Southern Observatory, told Business Insider in September. \"Now astronomers are much more prepared.\"\n\nNASA turned the lens of its most powerful space telescope, Hubble, toward the comet and snapped the clearest photo of it yet on October 12. The agency released the image on Wednesday. At the time of the photo, 2I/Borisov was 420 million km from Earth.\n\n\"Whereas 'Oumuamua appeared to be a rock, Borisov is really active, more like a normal comet. It's a puzzle why these two are so different,\" David Jewitt, the astronomer who led the Hubble team that observed the comet, said in a press release.\n\n2I/Borisov looks like comets from our solar system\n\nThe new image reveals a concentration of dust surrounding the comet's core, though the core itself is too small for Hubble to see. NASA has estimated that the core is between 2 and 16 kilometers in diameter.\n\nThat dust halo is characteristic of comets - they hold ice that gets heated up by nearby stars, leading them to shoot out gas and grit into space. The dust could make 2I/Borisov simpler to track than 'Oumuamua, since dust brightly reflects sunlight.\n\nThe Hubble team also shared a time-lapse video clip (below) of the comet; the footage spans seven hours of observations, which is why stars are streaked across the background.\n\nObservations of 2I/Borisov could tell astronomers about the structure and chemistry of the materials that form in whichever star system the object came from. So far, it looks a lot like the comets from our own solar system.\n\n\"Though another star system could be quite different from our own, the fact that the comet's properties appear to be very similar to those of the solar system's building blocks is very remarkable,\" Amaya Moro-Martin, an astronomer at the Space Telescope Science Institute, said in the release.\n\nAstronomers will watch the interstellar object with as many telescopes as possible\n\nMore Hubble observations of the comet are scheduled through January 2020, and astronomers have submitted proposals for even more after that.\n\n\"New comets are always unpredictable,\" Max Mutchler, another member of the Hubble team, said in the release. \"They sometimes brighten suddenly or even begin to fragment as they are exposed to the intense heat of the sun for the first time. Hubble is poised to monitor whatever happens next with its superior sensitivity and resolution.\"\n\nMeanwhile, astronomers are grabbing observation time with every other available telescope, including what Hainaut called the \"big guys,\" like the Very Large Telescope in Chile.\n\nAstronomers expect 2I/Borisov to be brightest in mid-December, when it will get closest to the sun. Mid-sized telescopes should be able to keep observing it until April 2020. After that, larger, more sophisticated telescopes can continue watching it until October 2020, when it will fade back into interstellar space.\n\nOverall, the fact that 2I/Borisov was detected just two years after 'Oumuamua suggests that interstellar visitors may be far more common than scientists previously thought. A recent study found that a few such large objects likely enter our solar system every year, along with hundreds more small objects that are harder to detect.\n\nEach new object that astronomers identify can teach us something new about other star systems.\n\n\"Here we have something that was born around another star and traveling toward us,\" Hainaut said. \"It's the next best thing to sending a probe to a different solar system.\"\n\nDave Mosher contributed reporting to this story.\n\nFor more, go to Business Insider South Africa.\n\nReceive a daily email with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "NASA also released a time-lapse video of the comet, 2I/Borisov, hurtling past the sun. The images show a halo of dust surrounding the alien object.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9486/e5b30227e94f4235b3947ffb46872d5d.jpg", "published_at": "2019-10-16"}