{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/killer-told-police-should-shot-20581925", "downloaded_at": "2019-10-15 08:02:29.447818+00:00", "title": "Killer who stabbed gran 47 times told police he 'should be shot in the head'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA man told police that he should be ‘shot in the head’ after stabbing a grandmother 47 times in a sickening 'revenge' attack.\n\nWilliam Finlay, 57, carried out the gruesome assault on Fiona Canning, 44, at her flat in November last year.\n\nFinlay believed Miss Canning had been “rinsing him” of a £10,000 pension payment, the Daily Record reported .\n\nNeighbours say a blood-covered Finlay admitted to killing his victim, telling them: “I’ve just murdered Fiona.”\n\nHe pleaded guilty on Friday at the High Court in Glasgow to her murder in Camelon, Falkirk, Scotland.\n\nThe facts were read out on Monday as sentence was deferred.\n\n(Image: Daily Record)\n\nThe court heard the pair were neighbours who would often violently argue.\n\nFinlay, an ex-electronics worker, had received a £10,000 pension payment in March last year but was left with £300 a few months later.\n\nProsecutor Margaret Barron said: “He stated to witnesses that Miss Canning had been ‘rinsing him’ and was constantly asking for money.”\n\nFinlay was heard inside Miss Canning’s flat by a neighbour on the night of her death.\n\nFinlay went to a friend’s house later that day covered in blood and confessed to murdering Miss Canning.\n\nThe friend dialled 999 and reported Finlay to the police after he left his house.\n\nOn the way back, other neighbours saw Finlay and asked what he had done, he replied: “I’ve just murdered Fiona.”\n\nThe neighbours raced to Miss Canning’s flat and saw her seated on her couch “just staring into the sky.”\n\n(Image: Daily Record)\n\n(Image: Daily Record)\n\nMiss Canning had “blood all over her body, around her chest and her face was dripping too.”\n\nWhen the neighbours returned to Finlay he shouted: “I’ve murdered her, I’ve done her, I’ve murdered Fiona.”\n\nAmbulance crews arrived and failed to revive Miss Canning using CPR.\n\nPolice found a small kitchen knife near to her couch which was covered in blood.\n\nOfficers arrested then Finlay at inside his flat and he was cautioned.\n\nHe replied: “Junkies bothering me, that’s why I got my revenge.\n\n(Image: Daily Record)\n\n“I took it out on a poor woman who robbed me for thousands of pounds.\n\n“I deserve to be shot in the head for what I’ve done tonight.\n\n“I apologise for doing it, but you can’t apologise for killing someone – this is what happens when you get pushed to the limits.”\n\nA post-mortem examination carried out on Miss Canning showed she received 70 individual sharp force injuries to the body.\n\nMiss Barron added: “At least 49 were stab wounds with two of these later found to be related to medical intervention.”\n\nThe majority of the wounds were to Miss Canning’s chest, neck and heart.\n\nJudge Lady Stacey deferred sentence for reports until next month.\n\nFinlay, from Falkirk, was remanded in the meantime.", "description": "William Finlay, 57, from Falkirk, Scotland, admitted to the killing after telling neighbours “I’ve just murdered Fiona”", "authors": ["Connor Gordon", "Neil Murphy", "Image", "Daily Record"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20581975.ece/ALTERNATES/s1200/0_Man-convicted-of-the-murder-of-Fiona-McDonald-in-Camelon.jpg", "published_at": "2019-10-15"}