{"pub": "reuters", "url": "https://ca.reuters.com/article/entertainmentNews/idCAKBN1W9326-OCAEN", "downloaded_at": "2019-09-25 04:44:59.195529+00:00", "title": "Placido Domingo ends Met Opera career while disputing sexual misconduct accusations", "language": "en", "text": "(Reuters) - Opera singer Placido Domingo on Tuesday dropped out of a performance at the Metropolitan Opera in New York while disputing accusations of sexual misconduct leveled by several women in the classical music world.\n\nFILE PHOTO: Opera singer Placido Domingo sits during an event at the Manhattan School of Music in New York, U.S., May 11, 2018. REUTERS/Shannon Stapleton\n\nDomingo, one of the world’s leading tenors, was due to appear in “Macbeth” on Wednesday. Both he and the Met Opera said he would not perform there again.\n\n“The Metropolitan Opera confirms that Placido Domingo has agreed to withdraw from all future performances at the Met, effective immediately. The Met and Mr. Domingo are in agreement that he needed to step down,” the opera house said in a statement.\n\nMore than three dozen singers, dancers, musicians, voice teachers and backstage staff have said in recent weeks that they had witnessed or experienced inappropriate behavior by Domingo toward women at different opera houses over the last three decades.\n\nDomingo, 78, said in a statement on Tuesday that while he strongly disputes the recent accusations against him, “I believe that my appearance in this production of Macbeth would distract from the hard work of my colleagues both on stage and behind the scenes. As a result, I have asked to withdraw and I thank the leadership of the Met for graciously granting my request.”\n\nThe Spanish singer added that he considered his dress rehearsal in the title role of “Macbeth” to be “my last performance on the Met stage.”\n\nLos Angeles Opera, where Domingo is general director, said last month it would bring in outside counsel to investigate the accusations made in two reports by the Associated Press.\n\nA handful of U.S. regional opera houses and orchestras had previously canceled planned appearances by Domingo but the decision by the Met marked the most serious fallout for the singer from the accusations.\n\nDomingo was one of the “Three Tenors,” along with Jose Carreras and the late Luciano Pavarotti, who brought opera to a wider audience with concerts around the world in the 1990s.\n\nHundreds of women have publicly accused powerful men in business, politics, the news media, sports and entertainment of sexual harassment and abuse since October 2017, fueled by the #MeToo social movement.", "description": "Opera singer Placido Domingo on Tuesday dropped out of a performance at the Metropolitan Opera in New York while disputing accusations of sexual misconduct leveled by several women in the classical music world.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190924&t=2&i=1433509757&w=1200&r=LYNXMPEF8N2B6-OCAEN", "published_at": "2019-09-24"}