{"pub": "guardian", "url": "https://theguardian.com/books/2019/sep/05/beyond-the-sea-paul-lynch-review", "downloaded_at": "2019-09-05 10:29:58.952325+00:00", "title": "Beyond the Sea by Paul Lynch review – poetic novel from an Irish prize winner", "language": "en", "text": "Bolivar, sometimes known as Porky, an experienced fisherman whose hands are large and whose plastic sandals are held together with tape, has done something stupid. To make enough money to fix it before his pursuers cut off his ears, he needs to catch fish. His temporary assistant, Hector, an adolescent who turns up in a sweater with a pirate logo and who has only ever fished the local lagoon, is failing to earn his respect. The South American beach where Bolivar keeps his boat is strewn with symbols of their coming voyage, among them an old man whose “songs are sung to the bones of the dead”. A storm is in the offing; Bolivar and Hector should be returning to port, not leaving it.\n\nIf you have a feeling that the older man has underestimated more than one factor in this mix, that he is ignoring too many aspects of his own life, and that as a result both men are in danger from something yet to happen, you’re right: but the scale of it, the extremity of it and the poetry of it are what Paul Lynch is going to show you. Since 2013, Lynch, who is most often compared to Cormac McCarthy, has caught a few fish of his own. His debut novel, Red Sky in Morning, was a finalist for the French Meilleur Livre Étranger prize and a nominee for the Premier Roman prize. Grace, his third, won the Kerry Group Irish novel of the year in 2018 and was shortlisted for the Walter Scott prize.\n\nAt the outset, Beyond the Sea seems more like a film than a book: a black-and-white two-hander from the mid-1950s, perhaps, with a familiar existential set-up, in which two men, lost at sea in the Pacific, must learn to understand each other if they are to survive; neither of them is quite what he seems. Two hours out, with “caves of dying light in the sky”, Bolivar and Hector bait their hooks. The fishing is good, but the storm is on them before they know it. The boat flounders. The engine expires, the GPS and radio follow it into silence. From now on, as their condition deteriorates and rescue seems less and less likely, Lynch will engage us by having the two men engage with one another on life, death, survival and what it means to be – or even to believe – in the world.\n\nAs rescue seems less and less likely, Lynch will engage us by having the two men engage with one another\n\nFor Bolivar, exactly as you would expect, the world is “without answer”: you can’t discuss things with it, only meet it hands on. “It is what it is,” he repeats. By extension, you are what you are, and what you are is expressed as agency. By contrast, Hector seems pliable, anaemic; he’s glued to, and then mourns the loss of, his cellphone. The self he is now – the part of him in the boat as opposed to the part he has left behind on the land – is not real. It’s a temporary construct, he believes, assumed to deal with his immediate situation: “No matter what way I look at it, I am not here and I am not there. I am not nothing but I am not anything either.” In a desperate attempt to site himself, he makes an effigy of the Virgin Mary out of floating odds and ends, and prays that things will be returned to the way they were; Bolivar, unimpressed, touches the idol’s leg at night and tries to get an erection.\n\nIt’s hard to tell whether their differences are temperamental, cultural or generational, because everything we see is such a highly compressed artefact of the way Lynch narrates. Time, subjective and objective, particularly interests him. It moves so slowly for the men in the boat, he assures us. But when we turn the page it’s Christmas and they are still alive, still drifting slowly westwards through the foul floating rubbish dump of the Pacific gyre, in a physical condition Lynch’s lyrical, deceptively sympathetic prose softens for us but never evades, accompanied by omens of the final sickness, hallucinatory violence and terror of the journey: a “lightning flare so remote that it seems to belong to another age”, “a fleeting unintelligible feeling of some other world” caught in the eyes of a shark.\n\n“You could not have predicted so many things would happen at once,” muses Bolivar, of the speed and comprehensiveness of the disaster, the way reality can so suddenly cease to be what it was a minute ago and become something completely different. This could easily have been one of those novels about what it is to be a man, where men are defined as those whose comprehension of their own circumstances is limited by appetite, material need and a tendency not to talk much. Instead, it turns into something more lyrical but at the same time colder and more shocking, much more self-aware. Contemporary Irish fiction prizes delivery, daring and an implicit trust in the reader: Lynch demonstrates a control over his ideas that comes from a pure lyrical telling, a speech act that, if you let it, will take you anywhere. Beyond the Sea is frightening but beautiful.\n\n• M John Harrison’s You Should Come With Me Now is published by Comma. Beyond the Sea is published by Oneworld (£12.99). To order a copy go to guardianbookshop.comor call 0330 333 6846. Free UK p&p over £15, online orders only. Phone orders min p&p of £1.99", "description": "A frightening but beautiful tale of two South American fishermen, a storm and hallucinatory violence", "authors": ["M John Harrison"], "top_image": "https://i.guim.co.uk/img/media/769e156be7f8b3b89dce1812f0eed4184c2011b6/0_99_4368_2621/master/4368.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d58925cfb508194912e6cc7cf9c4affd", "published_at": "2019-09-05"}