{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7616261/Charlotte-McKinney-stuns-Queen-Hearts-inspired-Halloween-costume.html", "downloaded_at": "2019-10-28 00:37:31.544813+00:00", "title": "Charlotte McKinney stuns in a Queen of Hearts inspired Halloween costume", "language": "en", "text": "She found fame after acting in a Carl Jr's All Natural Burger commercial, which aired during the Super Bowl in January 2015.\n\nAnd the spotlight is still firmly on Charlotte McKinney as she wowed in a figure -hugging dark blue felt playsuit at the Casamigos' Halloween Party in Beverly Hills.\n\nThe model, 26, wore a Queen of Hearts-inspired ensemble to the psychedelic themed bash at Casamigos co-founder Mike Meldman's house on Friday.\n\nBusty: Charlotte McKinney, 26, wowed in the figure hugging dark blue felt play suit at Casamigos Halloween Party in Beverly Hills\n\nThe Baywatch actress stunned in the plunging play suit and wore matching thigh-high stiletto heel boots to perfect the racy ensemble.\n\nCharlotte's playsuit featured red stripes along the zip which ran down the front of the outfit and around a belt.\n\nShe wore her blow dried hair in loose curls and pinned her fringe back into a quiff style to give a voluminous finish to the sexy getup.\n\nDeadly: The model, 26, wore a Queen of Hearts inspired ensemble to the psychedelic themed bash at Casamigos co-founder Mike Meldman's house on Friday\n\nAnd in her hand she carried a toy gun, which she posed with by blowing into the barrel as if celebrating having just fired a shot.\n\nThe party was decked out with custom neon features, graffiti backdrops and featured a pumpkin patch entrance to set the scene.\n\nEach guest was greeted with a Casamigos ice shot before heading further inside to enjoy signature cocktails including the Casa-delic, Magic Marg and Spicy Spirit.\n\nStrike a pose: In her hand Charlotte carried a toy gun, which she posed with by blowing into the barrel as if celebrating having just fired a shot\n\nThe venue's bars were lined with hundreds of bottles of Casamigos tequila and the main 30ft, diamond mirrored, bar acted as a platform for a custom designed light feature that was suspended above.\n\nOther guests included Justin Timberlake and his wife Jessica Biel as well as Rande Gerber and Cindy Crawford.\n\nThe stars were dressed to impress in a number of wild ensembles including an N*Sync outfit and a Seventies disco look.\n\nBlonde: The Baywatch actress stunned in the plunging play suit and wore matching thigh-high stiletto heel boots\n\nCharlotte's appearance comes after the blonde bombshell shared her eight-step skincare routine with Elle.\n\n'The number one thing I do is chug a bottle of water. It gets the engine going and lets my body hydrate,' she said.\n\n'I've got into this new tool by Georgia Louise, which is a butterfly shaped stone that moves my lymph nodes and helps with lymphnatic drainage, which helps me depuff.'\n\nModest: Charlotte covers her chest as she gets out of her car. Her play suit featured red stripes along the zip which ran down the front of the outfit and around a belt\n\nReady: She wore her blow dried hair in loose curls and pinned her fringe back into a quiff style", "description": "Charlotte McKinney, 26, wowed in a figure hugging dark blue felt play suit at Casamigos Halloween Party in Beverly Hills on Friday.", "authors": ["Emer Scully For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/12/20213908-0-image-a-55_1572087759553.jpg", "published_at": "2019-10-26"}