{"pub": "breitbart", "url": "https://breitbart.com/africa/2019/10/01/nigerian-catholics-tell-muslim-president-we-are-tired-of-burying-our-priests", "downloaded_at": "2019-10-05 05:49:48.176498+00:00", "title": "Nigerian Catholics Tell President: ‘We Are Tired of Burying Our Priests’", "language": "en", "text": "Catholic leaders in Nigeria have decried the reigning state of unrest and violence in the country, urging President Muhammadu Buhari to step up to his responsibility of protecting Nigerian citizens.\n\n“Nigerians are tired of losing their dear ones to these killings,” said the national president of the Catholic Laity Council of Nigeria (CLCN), Thomas Adekoya. “Catholics are tired of mourning and burying their priests who are daily murdered for no just cause.”\n\nMr. Adekoya was referring to scores of killings of Christians over the past months at the hands of different Muslim groups, including recent murders of Catholic priests in the country.\n\nThe Catholic Church is at “the receiving end of some of the most bizarre of these killings,” Adekoya said, recounting how Father David Tanko was killed by gunmen in late August while traveling to attend a meeting to seek an end to the violent crisis.\n\n“What made Fr. Tanko’s murder more gruesome was the fact that his assailants not only killed him, they set his body ablaze in his car,” he said.\n\nMr. Adekoya also recalled how earlier that same month, Fr. Paul Offu of Enugu Diocese was murdered, and Fr. Clement Ugwu was kidnapped and killed some months before.\n\nDecrying “the killings of these anointed men of God,” Adekoya said that the government “has lost grip of the security situation in the country.”\n\n“If we hold dear that the protection of lives and property and the welfare of citizens are the greatest responsibility of any government towards its citizens, then our present-day government has fallen far short of the expectation of Nigerians,” he said.\n\nMr. Adekoya is not alone in denouncing the deplorable state of insecurity in the country, especially for Nigeria’s Christians.\n\nThe Catholic Archbishop of Kaduna Archdiocese, Mathew Man’oso Ndagoso, said that the Buhari government must “wake up to its responsibilities” of ensuring adequate security across the country.\n\n“Anybody who cares for this country must be concerned about what is happening today regarding insecurity,” the archbishop said. “What is happening in the North East which has crept into the North West, South East and South West is becoming alarming.”\n\n“I have made this call before and I will still make it that the responsibility of any government either through the ballot or barrels of the gun or through whatever means is to safeguard the life and property of the citizenry,” he said.\n\nAs Breitbart News reported in August, more than 50 lethal, anti-Christian attacks took place in Nigeria during the first six months of 2019, while in 2018 some 2,400 Christians were killed by Fulani Muslims.\n\nNigeria’s President Muhammadu Buhari, who is himself of the Fulani ethnic group, has encouraged a narrative that minimizes the importance of religion in the conflict between Muslims and Christians in central Nigeria.\n\nNonetheless, two local Catholic bishops, as well as other Christian leaders, have insisted that the violence represents a “clear agenda for Islamizing the Nigerian Middle Belt” by using armed Fulani jihadists.\n\nOne of the bishops, Matthew Ishaya Audu of Lafia, said in 2018 that the ongoing attacks are not random or economically motivated, but purposefully target Christians.\n\n“They want to strike Christians,” Bishop Audu said, “and the government does nothing to stop them, because President Buhari is also of the Fulani ethnic group.”\n\nFollow @tdwilliamsrome", "description": "Catholic leaders in Nigeria have decried the reigning state of unrest in the country, urging President Buhari to protect Nigerian citizens.", "authors": ["Thomas D. Williams"], "top_image": "https://media.breitbart.com/media/2019/03/Nigerian-Christian-massacre.png", "published_at": "2019-10-01"}