{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/man-hurls-brick-car-window-20552437", "downloaded_at": "2019-10-10 15:26:55.205988+00:00", "title": "Man hurls brick at car window - then it bounces back and hits him in the face", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA man was caught on CCTV throwing a brick at a car only for it bounce back and hit him in the face.\n\nMartin Craig spotted the incident on his home CCTV on Saturday morning before the man runs away.\n\nMartin, from Brandon, Durham, has since uploaded the footage to Facebook where it has racked up more than 5,000 views.\n\nThe video shows a man walking passed the Citroen Berlingo before quickly returning and picking up a nearby brick.\n\nHe then walks towards the car and launches the brick at it.\n\nHowever, the brick ricochets off the car and strikes the man in the face before landing in front of him.\n\n(Image: Deadline News)\n\n(Image: Deadline News)\n\nThe brick staggers the man as he clutches his head seemingly in pain.\n\nHe takes a couple of moments to take in the pain, almost tripping over the same brick.\n\nThe man then picks the brick up and drops it into a garden next door, and walked away defeated.\n\nMartin today said his car only suffered a few scratches.\n\n(Image: Deadline News)\n\n(Image: Deadline News)\n\nHe said: “Just scratches to glass and paint work. No idea why it was my car he targeted unless he knows that I’m in a wheelchair, so an easy target.\n\n“I just burst out laughing. Think that's karma for you.”\n\nA spokeswoman for Durham Constabulary said the force were aware of the incident.\n\nshe added: “Police were called to reports of shoplifting in Grove Road, Brandon on October 5, at about 6.30am.\n\n(Image: Deadline News)\n\n“Whilst in attendance, officers received reports of an incident of criminal damage in the same street.\n\n“A 40-year-old man was arrested on suspicion of criminal damage to a vehicle and shoplifting.\n\n“He has since been charged with both offences and will appear at Newton Aycliffe Magistrates Court on Thursday, November 7.\n\n“Anyone with any information is asked to call Durham Constabulary on 101, quoting incident number 069 of October 5.”", "description": "Martin Craig spotted the incident on his home CCTV on Saturday morning before the man runs away", "authors": ["Cameron Ward", "Image", "Deadline News"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20553029.ece/ALTERNATES/s1200/0_PAY-CAR_THEFT_KARMA_DN02A.jpg", "published_at": "2019-10-10"}