{"pub": "arstechnica", "url": "https://arstechnica.com/science/2019/10/extreme-disasters-costing-more-but-killing-fewer", "downloaded_at": "2019-10-11 19:38:38.372560+00:00", "title": "Extreme disasters costing more but killing fewer", "language": "en", "text": "With the warming climate, we should expect a change in weather-related disasters. Fewer cold snaps and stronger heat waves are the obvious issues. But we should also see more intense storms, as a warmer atmosphere can hold more water vapor, while droughts may intensify in areas where rain was already sparse as the heat bakes water out of the soil.\n\nAll that suggests the costs of weather disasters will be different—but not necessarily better or worse. Researchers who have tried to study the topic have come up with very mixed results: some show an upward trend in the cost of natural disasters, while others fiercely dispute these analyses. Now, a new study suggests a possible reason for this: while the average damage caused by disasters is staying relatively stable, the most extreme events are increasing rapidly. But in a small bit of consolation, the human costs may be dropping.\n\nA confused literature\n\nIt might seem that analyzing the cost of weather disasters would be simple: identify the disasters, total the cost, and see if there's a trend over time in the warming world. But the reality is more complex. One complication is obvious: offsetting effects. Heat waves are going up in a warming world, but cold snaps are dropping. If these changes have offsetting costs, you could see no effect even as the dynamics shift.\n\nGeography can also average out real changes. For example, the Western US is getting drier, raising the risk of drought, while the northeastern part of the country is seeing more intense rainfall. If you look at the country as a whole, these effects can make it appear as if there were no change despite both regions having more climate-related problems.\n\nAnother complicating factor is that extreme weather is, by its nature, rare and erratic. For example, the US recently went through a multi-year period where no hurricanes made landfall, which would have skewed any disaster trends based on recent data. Finally, there's the fact that we alter our own behavior, in some cases in response to disasters. That could mean more (or more valuable) property in the path of potential weather disasters. But it could also mean that hurricanes alter building codes, while wildfires change how we handle brush clearance and even whether we provide electricity. It's entirely possible that having one disaster could reduce the damage by an equivalent one that struck afterwards, given that we've changed in response to the first.\n\nAll of this has left the disaster literature a bit of a mess. Some papers find trends, others don't, and yet others find that there's simply not enough data to provide a signal that rises above the statistical noise.\n\nThinking big\n\nThe researchers behind the new work took a slightly different approach to doing the analysis, one that's easiest to understand using a diagram from the paper.\n\nThe work tests whether damages behave like the upward curve of the black line in the main graph. If so, then as impact of a stressor—rising temperatures, shown in red at the bottom of the graph—increases, the potential for damage rises in a non-linear manner. If this is the case, we'd expect to see two things. As shown to the left of the graph, the blue curve of existing damages would shift upward, creating a red bulge that still encompasses most of the normal range of events but has more of the high-damage events. As shown in the inset, you'd also start to see damages of a magnitude that simply hadn't occurred previously.\n\nIn this view, the average damages would only change slowly, since prior and present probability curves on the left of the graph overlap so much. But you'd see more of the most-damaging events and a few that had never been seen before.\n\nTo look into this situation, the researchers developed a model that takes into account the cost of disasters and the frequency with which disasters of a given cost take place. They then examined whether these numbers were changing over time. For example, you could figure out damages from the costliest disasters from the 1960s and then see if there were more disasters in this cost range in the 2000s. Or you could also see if the number of disasters that were even more expensive went up over time.\n\nObviously, the researchers had to control for a variety of factors, like population size and GDP of the areas affected by disasters, as wealthier societies have more value at risk. But they also examined whether the climate zone—tropical vs. temperate vs. polar—made a difference.\n\nThe good news\n\nWhat the researchers found matched up well with their predictions. While there was little change in the median cost of a disaster, the frequency of the most expensive disasters grew dramatically over time. In the authors' phrasing, the curve that describes disaster frequency grew a \"fat tail\" among the most expensive disasters. \"Such results indicate that the economic impacts of natural disasters are indeed growing, but not at all scales,\" they argue.\n\nBut there is some good news here. The authors repeated the analysis using human deaths as the measure, rather than economic impact, and found the opposite trend: the human cost has gone down, primarily due to a dramatic decrease in the deaths due to severe droughts. There was, however, a steady increase in the number of people killed by extreme heat events, so the researchers caution that this could wipe out the good news if temperature rises continue unabated.\n\nThere's no reason to think that these results will put an end to arguments about whether climate change is increasing the risk or cost of natural disasters. The topic is far too complicated, and any analysis is going to be limited by the questions it asks and its choices regarding how those are asked. And those limitations definitely apply to this study. There simply aren't many natural disasters that are at the extreme end in terms of cost, so to get any sort of statistical significance, the researchers had to lump together droughts, heat waves, and other events that aren't very closely related.\n\nBut the study is valuable in that it suggests a number of interesting questions. Costly disasters in the tropics didn't increase as much as they did in temperate regions—why's that? What's changed that's caused droughts to be so much less deadly? Getting answers to questions like these could potentially help us plan for the steadily rising temperatures we're expected to see this century.\n\nPNAS, 2019. DOI: 10.1073/pnas.1907826116 (About DOIs).", "description": "While the average cost isn't changing much, the most costly disasters are rising.", "authors": ["John Timmer"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/10/17mep002_fema-aerial-hurricanedamage-pr-photo-by-yuisa-rios-fema-760x380.jpg", "published_at": "2019-10-11"}