{"pub": "afr", "url": "https://afr.com/policy/energy-and-climate/nsw-councils-demand-new-climate-risk-standards-20191014-p530il", "downloaded_at": "2019-10-14 06:37:37.255004+00:00", "title": "NSW councils demand new climate risk standards", "language": "en", "text": "\"The financial implications of the impacts identified to both private and council-owned property value is important for all members of our communities to understand and prepare for.\"\n\nShe said a comprehensive framework would protect local councils, and by extension ratepayers, from having to foot the bill for expensive clean-up efforts as a result of foreseeable events.\n\nShe also said it would protect against the increasing danger, flagged earlier this month by both the Australian Prudential Regulation Authority and the Reserve Bank of Australia, that large swathes of Australia would become uninsurable as a result of climate change.\n\nNeed for a national plan\n\nThe NSW Department of Planning and Environment already requires major new infrastructure projects to assess climate risk in the environmental impact statements. They must assess \"risk and vulnerability of the project to\n\nclimate change\" and \" incorporate specific adaptation actions in the design\".\n\nBut Cr Miller said these guidelines did not go far enough, and needed to be embedded in law. \"We need a national plan about how local, state and federal governments assess climate risk. We can’t make it a political thing. We’ve got whole communities whose properties will become uninsurable,\" she said.\n\n\"I don’t have the confidence that existing frameworks and guidelines do that well enough. There’s a huge opportunity to look at how we put more funding into mitigation – especially where councils can’t afford to do it themselves. It’s much cheaper to invest in infrastructure that stops all of your roads from flooding than to keep paying for them to be maintained.”\n\nShe said the guidelines would also need to address liability, saying a lack of clarity meant local councils would have to pay for failures at the state level.\n\nAdvertisement\n\nShe said the motion wasn't \"overly proscriptive\" but was \"a catalyst for everyone to come together and think about how we’re going to tackle this\". While the motion only addresses the NSW government, she said what was really needed was an \"all-of-government approach\".\n\n\"I think it’s a great opportunity for local, state and federal governments to all work together.\"\n\nInsurance withdrawal 'crisis'\n\nThe motion is backed by seven mayors. Cr Miller said she was hopeful it would get majority support when councils vote on it on Tuesday afternoon.\n\nIf passed, it means local councils will be joining a growing band of interest groups pushing for a more proactive approach to climate risk. The insurance industry has long called for governments to invest in resilience projects.\n\nAPRA has also argued for pre-emptive investment. \"Money spent on prevention and mitigation generates greater sustainability as it makes homes and businesses more capable of withstanding natural perils, reduces the economic and insured losses when disasters do occur, and results in prolonged reductions in premium, thus improving affordability,\" the regulator wrote in a submission to the Australian Competition and Consumer Commission's insurance in northern Australia review.\n\nThe Strata Community Association of Queensland, the industry body for the body corporate industry in Queensland, said the cost of insurance premiums as a result of increasing natural disaster damage was getting to crisis levels, with some of its members unable to secure any insurance.\n\n\"Two years ago, the real concern was the escalating premiums. It is now that insurance simply is not available to some strata communities. The situation is worsening with each month that passes as more insurers are withdrawing from the northern market or limiting their offering in a substantial way. This is now becoming a crisis,\" it stated in its submission to the ACCC's review.", "description": "Local councils in New South Wales will vote on a motion today calling on the state government to develop climate risk standards for new infrastructure projects.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.4628%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_364%2C$y_187/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/6a183718b63436fd06508093a25a15e6cb560acc", "published_at": "2019-10-14"}