{"pub": "cnn", "url": "https://cnn.com/2019/09/17/asia/solomon-islands-taiwan-china-intl-hnk/index.html", "downloaded_at": "2019-09-17 08:26:21.126097+00:00", "title": "Taiwan accuses China of trying to sway elections after losing another ally", "language": "en", "text": "Beijing (CNN) Taiwan has accused the Chinese government of trying to interfere in upcoming presidential and legislative elections on the island after Beijing lured another diplomatic ally away from Taipei.\n\nThe Solomon Islands government voted on Monday unanimously to establish diplomatic relations with Beijing over Taipei, whittling Taiwan's already shrinking number of allies down to 16.\n\nSpeaking on Monday, Chinese Foreign Ministry spokeswoman Hua Chunying said that Beijing \"highly commends\" the Solomon Island's decision, describing the growing flow of countries turning away from Taiwan as \"an irresistible trend of the times.\"\n\nIt's with great regret we end diplomatic ties with #SolomonIslands. 36 years of cooperation & friendship were no match for #Disinformation, falsehoods & dollar diplomacy. #Taiwan remains undaunted & will continue as a force for good in the world. Read on: https://t.co/cFfakxtKOD. — 外交部 Ministry of Foreign Affairs, ROC (Taiwan) 🇹🇼 (@MOFA_Taiwan) September 16, 2019\n\nIn an editorial published by state-run tabloid Global Times Tuesday, the paper said that Taiwan would continue to lose diplomatic ties \"until it reaches zero.\"\n\n\"The reason is simple: China is so strong already and has taken an important role in economic and political arenas. No single normal country will stand on the opposite side of Beijing,\" the article said.\n\nRead More", "description": "Taiwan has accused the Chinese government of trying to interfere in upcoming presidential and legislative elections on the island after Beijing lured another diplomatic ally away from Taipei.", "authors": ["Steven Jiang", "Ben Westcott"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190917111557-01-taiwan-solomon-islands-super-tease.jpg", "published_at": "2019-09-17"}