{"pub": "reuters", "url": "https://uk.reuters.com/article/us-syria-security-turkey-usa-sanctions/scrambling-to-limit-damage-trump-tells-turkey-to-stop-its-syria-invasion-idUKKBN1WT2DU", "downloaded_at": "2019-10-14 23:30:10.536014+00:00", "title": "Scrambling to limit damage, Trump tells Turkey to stop its Syria invasion", "language": "en", "text": "WASHINGTON (Reuters) - U.S. President Donald Trump on Monday demanded Turkey stop its military incursion in Syria and imposed new sanctions on the NATO ally as Trump scrambled to limit the damage from his much-criticized decision to clear U.S. troops from Turkey’s path.\n\nFILE PHOTO: U.S. President Donald Trump addresses conservative activists at the Family Research Council's annual gala in Washington, U.S., October 12, 2019. REUTERS/Yuri Gripas\n\nVice President Mike Pence said Trump had told Turkish President Tayyip Erdogan in a phone call on Monday to agree to an immediate ceasefire. He also said he would travel to the region soon to try to mediate the crisis.\n\nPence said Trump had been firm with Erdogan on the phone.\n\n“The United States of America simply is not going to tolerate Turkey’s invasion in Syria any further. We are calling on Turkey to stand down, end the violence and come to the negotiating table,” Pence told reporters.\n\nTurkey launched a cross-border operation into northern Syria on Wednesday just days after Erdogan told Trump in a phone call that he planned to move ahead with a long-planned move against America’s Kurdish allies in the region.\n\nTrump abruptly announced a redeployment of 50 American troops from the conflict zone to get them out of harm’s way, dismissing criticism that this would leave the Kurds open to attack. This was widely seen as giving Erdogan a green light for his operation.\n\nWith lawmakers in the U.S. Congress moving to impose sanctions of their own, Trump issued an executive order authorizing sanctions against current and former officials of the Turkish government for contributing to Turkey’s military operation in northern Syria.\n\nIn a statement, Trump said he had increased tariffs on imports of Turkish steel back up to 50 percent, six months after they were reduced, and would immediately stop negotiations on what he called a $100 billion trade deal with Turkey.\n\n“Unfortunately, Turkey does not appear to be mitigating the humanitarian effects of its invasion,” said Trump.\n\nTreasury Secretary Steven Mnuchin said the United States had imposed sanctions on Turkey’s ministers of defense, interior and energy, as well as their departments.\n\nThe scenes of carnage from Turkey’s assault have exposed Trump to harsh criticism from Republicans and Democrats alike for abandoning the Kurdish allies who were instrumental in the U.S. battle against Islamic State militants in Syria.\n\nAs Congress has vowed to act if he will not, Trump said Turkey’s action is precipitating a humanitarian crisis and “setting conditions for possible war crimes” but he made clear he had no plans to reverse his decision to withdraw.\n\n“As I have said, I am withdrawing the remaining United States service members from northeast Syria,” said Trump.\n\nU.S. troops coming out of Syria will stay in the region to monitor ISIS and a small footprint will remain at the Tanf base in southern Syria, he said.\n\nSenate Majority Leader Mitch McConnell, a Kentucky Republican allied with Trump, expressed his displeasure with the president’s decision in a statement.\n\n“Abandoning this fight now and withdrawing U.S. forces from Syria would recreate the very conditions that we have worked hard to destroy and invite the resurgence of ISIS,” he said.\n\nA statement from Senate Democratic leader Chuck Schumer and Democratic senators Robert Menendez and Jack Reed said the only person who is able to “immediately stop this tragedy unfolding is the president himself.”\n\n“The first step when Congress returns to session this week is for Republicans to join with us in passing a resolution making clear that both parties are demanding the president’s decision be reversed,” they said.\n\nTrump said his executive order would enable the United States to impose sanctions on those current or former Turkish officials who may be involved in human rights abuses. He said it will authorize sanctions such as blocking of property and barring entry into the United States.\n\nTurkey’s lira, which had weakened some 0.8% in the day, reacted minimally to Trump’s announcement. It stood at 5.9300 at 2018 GMT, from 5.9260 beforehand.", "description": "U.S. President Donald Trump on Monday demanded Turkey stop its military incursion in Syria and imposed new sanctions on the NATO ally as Trump scrambled to limit the damage from his much-criticized decision to clear U.S. troops from Turkey's path.", "authors": ["Steve Holland", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191014&t=2&i=1440881508&w=1200&r=LYNXMPEF9D1PU", "published_at": "2019-10-14"}