{"pub": "cbs", "url": "https://cbsnews.com/news/census-bureau-asks-states-for-licenses-that-typically-include-citizenship-data", "downloaded_at": "2019-10-14 23:23:39.446726+00:00", "title": "Census Bureau asks states for licenses that typically include citizenship data", "language": "en", "text": "The U.S. Census Bureau is asking states for drivers' license records that typically include citizenship data and has made a new request for information on recipients of government assistance, alarming some civil rights advocates.\n\nThe two approaches, documented by The Associated Press, come amid President Trump's efforts to make citizenship a key aspect of federal information-gathering in the run-up to the 2020 Census, despite this year's U.S. Supreme Court ruling that a specific citizenship question can't be included in the 2020 Census questionnaire.\n\nCivil rights advocates worry that the wider net being cast by the Trump administration for such information could chill Latino participation in the population count, which will determine how many congressional seats each state gets and guide the allocation of hundreds of billions of dollars of federal funding. The results of the 2020 Census also will be used to redraw state and local electoral maps.\n\nExperts caution that inaccuracies in state motor vehicle records also make them a poor choice for tracking citizenship, if that is the bureau's goal.\n\nAfter the Supreme Court ruling, Mr. Trump signed an executive order in July requiring the Commerce Department, which oversees the Census Bureau, to collect records on citizenship from federal agencies and increase efforts \"to obtain State administrative records concerning citizenship.\"\n\nThe American Association of Motor Vehicle Administrators told The AP that most, if not all, states recently received requests for information including citizenship status, race, birthdates and addresses. The association has advised members to consult their privacy officers, and \"each state is making their own determination how to respond,\" spokeswoman Claire Jeffrey said in an email.\n\nIn Illinois, Secretary of State Jesse White denied the request.\n\n\"We, as a general rule, are not comfortable with giving out our data, certainly not in such a huge amount. That was the overriding concern,\" said spokesman Dave Drucker.\n\nOther states are weighing what to do. The Florida Department of Highway Safety and Motor Vehicles has received the request but hasn't responded, spokeswoman Beth Frady said.\n\nMotor vehicle agency records are notoriously inaccurate and \"bad at determining when someone is not a citizen,\" said Andrea Senteno, a lawyer for the Mexican American Legal Defense and Educational Fund, which is challenging Mr. Trump's executive order.\n\n\"The Census Bureau usually plans for these types of big changes in their operations many, many years in advance, but they don't have enough time right now to actually plan and provide clear information to the public about how they are going to use these administrative records,\" Senteno said. \"They're flying by the seat of their pants right now.\"\n\nThe bureau also is seeking more state records on individual recipients of public programs. A new request published last month in the Federal Register said the records would be used for the 2020 Census and other research, and they're needed to \"improve efficiency and accuracy in our data collections, and to improve measures of the population and economy.\"\n\nThe records request doesn't explicitly ask for citizenship information, but some demographers who work with the bureau on state-level data suspect it's responsive to the president's executive order.\n\n\"The timing of it, and noticing in the executive order, it's well-stated that this is going to be a push directing the Census Bureau to work on gathering these state inputs; it would lead me to believe that the two are probably connected,\" said Susan Strate, senior manager of Population Estimates Program at the University of Massachusetts Donahue Institute.\n\nStates already share records on food assistance and other programs to help the bureau track traditionally undercounted populations and pinpoint vacant houses. The states' administrative records could cover a host of topics, including citizenship, said John Thompson, a former Census Bureau director in the Obama administration.\n\n\"Here's the confusing thing about it,\" Thompson said: \"They've already been reaching out to states. They've got a number of ongoing programs where they reach out to states for various data.\"\n\nStates typically don't do a good job of tracking citizenship information, said Kenneth Prewitt, a former Census Bureau director in the Clinton administration.\n\n\"People move, divorce, buy homes, pay state taxes, and these behaviors are not tied to any citizenship records,\" Prewitt said.\n\nIn a statement last Thursday, the Census Bureau said it started requesting state administrative records in 2016 to help with the 2020 Census and ongoing surveys. The records include birthdates, addresses, race, Hispanic origin and citizenship status. The bureau didn't answer why it was requesting drivers' license information or why it had made the new request last month for state administrative records when it already receives records from states.\n\nThe bureau said the records it receives are stripped of identifiable information and used for statistical purposes only.\n\n\"Responses to all Census Bureau surveys and administrative records obtained by the Census Bureau are safe, secure and protected by law,\" its statement said.\n\nWhen it comes to the citizenship question, there has been a tension between Trump appointees pushing the president's agenda and career Census Bureau workers who worried that adding a citizenship question would reduce participation and make for a less accurate 2020 headcount.\n\nBureau officials have said they will decide by March 31 on a methodology for tracking citizenship. The 2020 Census count officially begins the next day, on April 1.\n\nSeveral civil rights organizations filed a new challenge in federal court in Maryland last month, claiming Mr. Trump's executive order is \"motivated by a racially discriminatory scheme to reduce Latino political representation\" and gives an advantage to white voters at the expense of Latino voters.", "description": "The request comes after the Trump administration said they wouldn't add the citizenship question to the 2020 census", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/14/ee8a23e2-fe63-41ff-9de1-eeacbf8db384/thumbnail/1200x630/f92483c9ae736f10092b5bbc16b03425/ap-19281782392868.jpg", "published_at": "2019-10-14"}