{"pub": "arynews", "url": "https://arynews.tv/en/baldia-factory-owners-case-mqm-pressure-witness", "downloaded_at": "2019-10-17 14:30:00.144670+00:00", "title": "Baldia factory owners were named in case over MQM’s pressure, claims witness", "language": "en", "text": "Baldia factory owners were named in case over MQM’s pressure, claims witness\n\nKARACHI: An important witness in Baldia fire factory case, Senior Superintendent of Police (SSP) Sajid Sadozai on Thursday recorded his statement before ATC judge, ARY News reported.\n\nThe anti-terrorism court conducted the hearing of the factory fire case where prime suspects, Rehman alias Bhola and Zubair alias Charya, were produced before the court.\n\nMuttahid Qaumi Movement-Pakistan (MQM-P) leader Rauf Siddiqui also appeared before the court.\n\nSadozai while recording his statement before the judge, confirmed the JIT report and said the factory was set on fire over denial of extortion money.\n\nHe said travel history of Hammad Siddiqui showed that he had travelled to Pakistan from Dubai in August 2012 and flown back in March 2013.\n\nThe eye witness claimed that early investigation was influenced by the MQM leaders and naming the factory owners in the case was also result of that pressure.\n\nThe hearing of the case was adjourned till Friday (tomorrow) till 9 am.\n\nRead more: Baldia factory owner makes shocking revelations about incident\n\nThe blaze at Ali Enterprises factory in Baldia Town of Karachi on September 11, 2012, had killed at least 258 people in one of Pakistan’s worst industrial disasters.\n\nThe case took a new turn in February 2015 when Pakistan Rangers, Sindh, submitted a joint investigation team (JIT) report in the Sindh High Court (SHC), which revealed that the factory was set on fire after its owners failed to pay extortion money.\n\nComments\n\ncomments", "description": "An important witness in Baldia fire factory case, Senior Superintendent of Police (SSP) Sajid Sadozai on Thursday recorded his statement before ATC judge.", "authors": ["Web Desk"], "top_image": "https://arynews.tv/wp-content/uploads/2019/07/Baldia_factory.jpg", "published_at": "2019-10-17"}