{"pub": "news24", "url": "https://businessinsider.co.za/discovery-bank-empowerment-scheme-will-be-for-discovery-limited-shares-2019-10", "downloaded_at": "2019-10-19 10:58:27.111284+00:00", "title": "Black Discovery Bank customers will get shares in its listed parent – but a year later details are still scarce", "language": "en", "text": "It has \"made important progress\" in setting up an empowerment scheme that will offer free shares to black clients of Discovery Bank, the bank's parent says.\n\nThose shares will not be in the bank, but in its listed parent company, Discovery Limited.\n\nThe scheme will be announced \"in due course\", Discovery says – nearly a year after first announcing the plan.\n\nFor more stories go to www.BusinessInsider.co.za.\n\nIt has \"made important progress\" on an empowerment scheme aimed at the customers of Discovery Bank, the bank's listed parent Discovery Limited says in an annual report published on Friday.\n\nBut one month shy of a year after first announcing the plan – to give fully vendor-financed shares to black depositors – details remain very scarce.\n\nDiscovery confirmed that 10% of the bank will go to \"qualifying participants\", but clarified that they will not receive shares directly in Discovery Bank. Instead black customers of the bank will be allocated \"an equivalent value of Discovery Limited share\".\n\nDiscovery Limited is the parent company of the bank, Discovery Health, which administers the giant medical aid by the same name, Vitality, and associated businesses such as Discovery Limited.\n\n\n\nThat means that, once shares are handed over, they will be fully liquid and easy to sell on the JSE, where Discovery Limited is listed.\n\nIt will also expose the empowerment scheme participants to the value of the broad Discovery group, with interests in businesses from the United Kingdom to China, rather than the narrow Discovery Bank operation.\n\nDiscovery again reiterated that the shares will be vendor financed, and will come with \"conditional requirements that these participants will need to meet over the term\" of the scheme.\n\nIt did not say what those requirements will be, what the vesting period will be before shares can be sold, or how the equivalent value of Discovery Limited shares will be calculated.\n\nThe offering \"will be announced to the market in due course\", Discovery said.\n\n\n\n\n\nReceive a daily email with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "Discovery says it has \"made important progress\" in a plan for vendor-financed shares due to black depositors of Discovery Bank.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9047/7bc7f1c284e246c9b63e66ddbb0f9601.png", "published_at": "2019-10-18"}