{"pub": "npr", "url": "https://npr.org/2019/09/21/762128858/for-a-black-woman-in-the-military-harassment-was-its-own-battle", "downloaded_at": "2019-09-21 14:48:57.881476+00:00", "title": "For A Black Woman In The Military, Harassment Was Its Own Battle", "language": "en", "text": "For A Black Woman In The Military, Harassment Was Its Own Battle\n\nEnlarge this image toggle caption Emilyn Sosa for StoryCorps Emilyn Sosa for StoryCorps\n\nInspired by her father's passion for military service, Denise Baken joined the Army in 1975 at age 24, looking to follow in his footsteps.\n\nBut the retired colonel didn't realize how closely her father's experience in the military mirrored her own until she faced challenges — both as a woman and an African American — over her 28 years of service.\n\n\"As a black man in the military in the 40s and 50s, my dad had suffered such abuse,\" Baken, 69, told her daughter and son last month, in a StoryCorps interview. \"One time, he was called the N-word, and he got so mad at this officer, he slugged him. And he was the one brought up on charges, and he was reduced in rank.\"\n\nBut her father soldiered on, Baken said, \"Because he loved the military. And it was because of him that I loved the military.\"\n\nLike her father, Baken says she too faced racism, and the mental toll it took was only made worse by the sexism she also says she faced.\n\n\"The guys loved watching women walk away from them, and they would make their comments,\" she said. \"So I made sure I wore a foundation garment so nothing moved. It was just the way we women handled it then.\"\n\nShe wanted to be a role model for younger women below her rank.\n\n\"I tried to be — for some of my young people coming up — their person that they could look to to see someone who led with integrity.\"\n\nIt wasn't always easy. There were times when the mental exhaustion from dealing with discrimination would leave her physically worn out. Baken remembered one interaction with an enlisted female officer in particular.\n\n\"I remember I was walking across a hall, and one woman came up on me and she said, 'You're stooping. Don't ever do that. We're very proud of you.' And that startled me, and I stood up straight and kept walking.\"\n\nAfter that incident, Baken turned down an assignment that could have gotten her promoted from colonel to general. She was ready for a change.\n\n\n\n\"If I was beginning to stoop, somehow maybe they were winning and I didn't realize,\" she said. \"And doggone it, no! I just didn't wanna do it anymore. I wanted out.\"\n\nSo, in 2003, Baken made the decision to move on. She retired from the military, and went on to earn a Ph.D. in biodefense from George Mason University. She now runs her own consulting firm, advising the Department of Defense.\n\nAudio produced for Weekend Edition by Aisha Turner.\n\nStoryCorps is a national nonprofit that gives people the chance to interview friends and loved ones about their lives. These conversations are archived at the American Folklife Center at the Library of Congress, allowing participants to leave a legacy for future generations. Learn more, including how to interview someone in your life, at StoryCorps.org.", "description": "At StoryCorps, retired Col. Denise Baken says the challenges she faced as both a woman and an African American in the Army weighed her down over time, mentally and physically.", "authors": ["Emma Bowman", "Aisha Turner"], "top_image": "https://media.npr.org/assets/img/2019/09/19/baken_npr-edit_wide-f03e8074e1dad6332784e0f3c331ab58e039550b.jpg?s=1400", "published_at": "2019-09-21"}