{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/washington-monument-elevator-acts-up/2019/09/21/e15d7142-dcc7-11e9-a688-303693fb4b0b_story.html", "downloaded_at": "2019-09-22 02:00:02.929648+00:00", "title": "Washington Monument elevator acts up", "language": "en", "text": "“Normal operations resumed after about an hour,” Litterst said. He said tours were on schedule, and he apologized for the inconvenience.\n\nBut if the monument is one of the best-known American symbols, then the elevator inside has also achieved a kind of celebrity for its notoriously faulty operation.\n\nThe towering obelisk on the Mall had just reopened on Thursday. It had been closed since August 2016 for the construction of a visitor-screening facility and to modernize its elevator.\n\nThe elevator takes visitors, half a million per year, to the observation level 500 feet up.\n\nIt was not immediately clear Saturday what caused the interruption in service.\n\nBetween 2014 and the temporary closure of the marble obelisk in 2016, the elevator broke down 24 times.\n\nVisitors were often stranded at the top and faced with the prospect of descending 897 steps.\n\nIn favorable conditions, windows at the top provide a panoramic view for miles into both Virginia and Maryland. By rough calculation, the horizon is about 30 miles away.\n\nIt was cloudy at times on Saturday, but as has been true almost all month in Washington, no raindrops fell to impair visibility.\n\nAmong other things, the lack of rain played a role in America’s foreign affairs. A state dinner for Australian Prime Minister Scott Morrison was held outdoors at the White House on Friday.\n\nAlthough there was a backup plan, President Trump said Friday that he was not expecting any rain. And as it turned out, there was none.\n\nLocal newsletters: Local headlines (8 a.m.) | Afternoon Buzz (4 p.m.)\n\nLike PostLocal on Facebook | Follow @postlocal on Twitter | Latest local news", "description": "The brief interruption in service came only a couple of days after the reopening of the landmark.", "authors": ["Martin Weil", "Local Reporter"], "top_image": "https://washingtonpost.com/pf/resources/images/favicon.ico?d=107", "published_at": "2019-09-21"}