{"pub": "washingtonpost", "url": "https://washingtonpost.com/news/powerpost/paloma/the-energy-202/2019/09/25/the-energy-202-california-defiant-as-trump-administration-threatens-to-halt-highway-funds-over-smog/5d8a4fb8602ff14beb3da8a5", "downloaded_at": "2019-09-25 13:38:59.074495+00:00", "title": "The Energy 202: California defiant as Trump administration threatens to halt highway funds over smog", "language": "en", "text": "THE LIGHTBULB\n\nCalifornia Gov. Gavin Newsom (D) (AP Photo/Rich Pedroncelli)\n\nThe Trump administration is threatening to withhold highway funding from California if it doesn't clean up its air quality. But California leaders are firing back, hard — and accusing the federal government of actually preventing it from cleaning up its pollution.\n\n“We won’t be intimidated by this brazen political stunt,” California Gov. Gavin Newsom (D) said in a defiant statement after the Environmental Protection Agency threat.\n\nCalifornia leaders are angry that the Trump administration took away California's authority to curb greenhouse gas emissions from vehicles last week — which they have repeatedly argued would also help it clean up lung-choking smog in the state.\n\n“We won’t go back to the days when our air was the color of mud,” Newsom said. “We won’t relive entire summers when spending time outside amounted to a public health risk.”\n\nEPA Administrator Andrew Wheeler's letter was made public as California leaders were mounting an offensive against President Trump for his loss of leadership on climate change at this week's United Nations climate summit. They seized on the high-profile forum to show they were the true leaders on environmental issues.\n\n“I don’t know what the hell happened to this country that we have a president that we do today on this issue,” Newsom (D) said to applause in New York, according to the Los Angeles Times. “Because it’s a damn shame. It really is. I’m not a little embarrassed about it — I’m absolutely humiliated by what’s going on.”\n\nNewsom was also quick to insist the threat against his left-leaning state was based in pure politics. Wheeler's letter to the California Air Resources Board said the state “has failed to carry out its most basic tasks under the Clean Air Act” and could risk losing federal money, as Juliet Eilperin and I reported Tuesday, the state is not alone in its struggles.\n\nIt's true that some 40 counties in California do not meet federal air quality standards. California’s mountain ranges form cauldron-like basins in which smog brews. And the high-sky number of people who live in the state, along with the many cars they drive, don’t help.\n\nBut about three dozen other states not targeted with EPA letters also have counties that did not meet standards for six pollutants as of the end of August. And the California Air Resources Board said the federal government isn’t helping it fight pollution from one of its biggest sources there: cars.\n\n“This letter appeared only days after EPA attacked our state authority on cars, increasing air pollution while at the same time limiting our ability to reduce it,” CARB Executive Officer Richard Corey said in a statement responding to Wheeler’s letter.\n\nSpeaking in New York on Tuesday following the U.N. climate summit, Newsom suggested that California is doing more than most states to curb pollution. “We're not asserting a paradigm, we're proving it,” he said of creating jobs in green industries. “That paradigm is now challenged by an EPA that’s been weaponized by the Trump administration.”\n\nNewsom’s predecessor as governor, Jerry Brown, attended the climate summit, too, using it to launch an initiative with a geopolitical rival, China, which is now quarreling with the Trump administration over trade.\n\nThe California-China Climate Institute, based at Beijing’s Tsinghua University and the University of California at Berkeley, will tackle climate problems both technological and political. Brown founded it with China’s most senior and veteran climate policy official, Xie Zhenhua. The Chinese province of Guangzhou will also participate.\n\nBrown acknowledged in an interview with The Post last week he was forming the partnership at a time of deep distrust of China amid the trade war. But he said it made sense “because of California’s unique role in enforcing clean air laws, we’ve developed expertise, engineers, lawyers, technicians.”\n\nThe partnership is especially striking given Trump's ongoing feuds with California on tackling pollution.\n\nTrump “comes along, denies climate change and wants to stop the state that’s doing the most about it,” he said. “It makes no sense. I have to say that borders on the criminal.”\n\nCarol Morello and Steven Mufson contributed reporting.\n\nRead more here:\n\nClimate and Environment Trump officials threaten to withhold highway funding from California for its ‘chronic air quality problems’ Trump administration officials threatened Tuesday to withhold federal highway funds from California, arguing that it had failed to show what steps it's taking to improve its air quality. The move by the Environmental Protection Agency escalates the fierce battle between President Trump and the left-leaning state. Juliet Eilperin and Dino Grandoni\n\nYou are reading The Energy 202, our must-read tipsheet on energy and the environment. Not a regular subscriber?\n\nPOWER PLAYS\n\nA man stands in a flooded street as Hurricane Irma hits Miami in 2017. (Matt McClain)\n\n— The latest sobering climate report: Climate change is already having a major impact on the world’s oceans and frozen regions, according to a new report from the Intergovernmental Panel on Climate Change. And the report, compiled with the help of 100 scientists from around the world, warned that if global warming is left unchecked, the impacts thus far are only a sign of catastrophic consequences still to come, The Post’s Chris Mooney and Brady Dennis report.\n\nGiven current emissions levels, a number of serious impacts are essentially unavoidable:\n\nRising greenhouse gas emissions have already fueled monster storms, deadly heat waves, record sea ice loss and harm to coral reefs.\n\nBy 2050, extreme floods that usually hit coastal cities and small island nations every 100 years will become a yearly occurrence.\n\nBy the end of the century, the world could see a total sea level rise of 3.6 feet. That’s higher than the IPCC estimate in 2013, when the group said the rise would be just over three feet.\n\nBy the year 2100, marine heat waves – blamed for killing corals and other critical ocean organisms – could become 20 times more common in a best-case scenario and 50 times more common in the worst case.\n\nEnvironmental activist Greta Thunberg addresses the Climate Action Summit at U.N. headquarters. (Jason DeCrow/AP)\n\n— “A very happy young girl” strikes back: Climate activist Greta Thunberg had a sharp response to Trump’s seemingly sarcastic description of the 16-year-old climate activist. Trump tweeted a news story about Thunberg’s impassioned remarks to United Nations leaders, saying: “She seems like a very happy young girl looking forward to a bright and wonderful future. So nice to see!” Later, Thunberg adjusted her profile to say just that: “A very happy young girl looking forward to a bright and wonderful future.”\n\nSen. Ron Wyden (D-Ore.). (Susan Walsh/AP)\n\n— Senate confirms nominee for Interior Dept. lawyer who is under investigation: Senators voted 51 to 43 to confirm Daniel Jorjani to be the Interior Department’s top lawyer despite an outcry from Democrats who say he has lied to lawmakers.\n\nThe probe: The Interior Department’s internal watchdog is currently looking into Jorjani’s role in creating the agency’s new Freedom of Information Act policy that enables political appointees to review requests.\n\nThe Interior Department’s internal watchdog is currently looking into Jorjani’s role in creating the agency’s new Freedom of Information Act policy that enables political appointees to review requests. What Democrats said: Before the vote, Senate Minority Leader Charles E. Schumer (D-N.Y.) pointed to previous Interior Department officials, including former secretary Ryan Zinke, who have been the focus of ethical investigations. “It’s obvious that the Interior Department sorely needs transparency.\" And Sen. Ron Wyden (D-Ore.), who called on the agency’s watchdog to expand its investigation of the FOIA policy to include Jorjani, urged Senate Majority Leader Mitch McConnell (R-Ky.) not to “ignore the serous allegations facing this nominee.”\n\nSmoke rises from the Colstrip Steam Electric Station in Colstrip, Mont. (Matthew Brown/AP)\n\n— Some corporations step up on climate: A number of corporations made commitments to curb their contribution to climate change this week even as commitments from world leaders stalled at the United Nations summit. More than 20 multinationals pledged to get 100 percent of their electricity from renewables, The Post’s Steven Mufson reports, “bringing to 300 the number of renewable commitments from companies with $5.5 trillion in revenue, according to the Climate Group.” Other companies pledged to electrify their vehicle fleets, 10 companies committed to accelerating energy efficiency by 3 percent a year and another company said it would more than double its renewable energy purchases to more than 1.5 gigawatts of wind and solar.\n\nAn African elephant on the Masai Mara game reserve in Kenya. (Godong/UIG/Getty Images)\n\n— Court rejects government effort to stop lawsuit against wildlife council: A federal-district court blocked an effort by the Trump administration to dismiss a lawsuit against an Interior Department wildlife protection council that critics argue is stacked with “trophy hunters.” The International Wildlife Conservation Council was announced by then-Secretary Ryan Zinke in November 2017 and its members included a “a National Rifle Association official, six members who are listed as active hunters and five members who are said to represent wildlife conservation groups,” The Post’s Erin B. Logan has reported.\n\n— Court pauses huge logging push in Alaskan rainforest: A federal court halted a major logging operation in Alaska’s Tongass National Forest, the largest such operation on U.S. Forest Service-run land in about three decades, Courthouse News reports. The preliminary injunction stops the agency from pushing ahead with its 15-year plan to log 40,000 acres of the forest. In the ruling, U.S. District Judge Sharon Gleason said the environmental impact statement “does not fully explain to the public how or where actual timber activities will affect localized habitats.”\n\nDAYBOOK\n\nToday\n\nThe Senate Commerce, Science and Transportation Committee holds hearings to examine fishery failures and improving disaster declaration and relief process.\n\nComing Up\n\nThe House Agriculture Subcommittee on Conservation and Forestry holds a hearing on the National Forest System on Thursday.\n\nThe House Science, Space and Technology Committee holds a hearing on forecasting and communicating extreme weather in a changing climate on Thursday.\n\nEXTRA MILEAGE\n\n— Get ready for some hiberation:", "description": "Officials insist they're the true environmental leaders, not Trump.", "authors": ["Dino Grandoni", "Reporter Covering Energy", "Environmental Policy", "September At Am"], "top_image": "https://www.washingtonpost.com/pbox.php?url=https://palomaimages.washingtonpost.com/pr2/52c6aa1c84a498cf04d30db225f7548c-2176-1647-70-8-IJAFZOW2KAI6TINFCYVYVHE4UI.jpg&w=1484&op=resize&opt=1&filter=antialias&t=20170517", "published_at": "2019-09-25"}