{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7565903/Chelsea-keeper-Arrizabalaga-curls-stunning-set-piece-Spain-training.html", "downloaded_at": "2019-10-12 15:21:43.652110+00:00", "title": "Chelsea keeper Arrizabalaga curls in stunning set-piece during Spain training", "language": "en", "text": "Chelsea and Spain goalkeeper Kepa Arrizabalaga has put himself in the frame for set-pieces for both club and country.\n\nArrizabalaga, who is currently gearing up for Spain's Euro 2020 qualifier against Norway on Saturday night, enjoyed a break from his goalkeeping duties during training.\n\nPrior to the international fixture, the shot-stopper was seen practising his free-kicks with his team-mates and he has shown he is not just limited to duties with the gloves.\n\nKepa Arrizabalaga impressed his Spain team-mates with his free-kick abilities during training\n\nThe 25-year-old enjoyed a break from his goalkeeping duties during Spain's training session\n\nwelp, that’s that. Kepa’s taking our free-kicks from now on ¯\\_(ツ)_/¯ pic.twitter.com/Ydnkd4sT3M — amadí (@amadoit__) October 12, 2019\n\nA video has emerged online of the 25-year-old exquisitely curling a free-kick from the edge of the box into the top corner - rocketing off the post.\n\nThe social media user captioned the video: 'Well, that's that. Kepa's taking our free-kicks from now on.'\n\nKepa and his Spain team-mates have enjoyed the perfect start to their Euro 2020 qualifying campaign.\n\nRobert Moreno's side have picked up maximum points from their opening six matches, scoring 17 goals in that time and conceding just three.\n\nSpain could qualify for next summer's showpiece event if they beat Norway away on Saturday night and if Romania fail to win or Sweden lose.\n\nThe Chelsea and Spain star's free-kick flies towards the top left corner of the net\n\nHis exquisite free-kick, from the edge of the box, flies in off the post and into the corner", "description": "Kepa Arrizabalaga, who is currently gearing up for Spain's Euro 2020 qualifier against Norway on Saturday night, enjoyed a break from his goalkeeping duties during training.", "authors": ["Jonathan Spencer For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/15/19627664-0-image-a-19_1570889572266.jpg", "published_at": "2019-10-12"}