{"pub": "townhall", "url": "https://townhall.com/columnists/vijayjayaraj/2019/10/29/china-coal-n2555510", "downloaded_at": "2019-10-29 15:04:12.705694+00:00", "title": "Two Reasons China’s Coal Spree Is Continuing", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nThough the United Nations (UN) continues to turn a blind eye towards China’s accelerated coal use, it has been a matter of concern for various non-profits and radial environmental groups that are desperately trying to end the global use of that energy resource.\n\nWhat makes China hold on to coal despite international pressure and the global movement against fossil fuels?\n\nChina’s subscription to coal is driven by two major reasons: the need for an abundant energy source and the lack of dangerous warming in the recent past.\n\nIrreplaceable Energy Source\n\nChina’s renewable resources are nowhere close to staking a major claim in the country’s total energy production. There is no question of renewables replacing conventional energy sources, at least not with the technology that is currently available.\n\nChina is unabashed about its coal use and even about helping other countries increase their coal use.\n\nAmong conventional energy sources, fossil fuels dominate, with coal contributing more than 70 percent of the country’s electricity.\n\nEven as UN-led climate drama has taken center stage in Europe and North America, China has quietly gone about its business of increasing the production, export, and use of coal.\n\nLast week, China approved two more coal mine projects. The two projects, approved by the government’s National Development and Reform Commission, cost around 1.32 billion USD and represent various measures taken by Beijing to prop up its coal production.\n\nThe construction of 1,837-km long Menghua railway, the longest heavy-loaded coal railway line, is expected to near completion this month. Estimated to have cost around 20 billion USD, it will “connect the coal mining areas in northern China with the industrial hub in the South, starting from Inner Mongolia in the North and ending in Jiangxi Province,” transporting 200 million tons of coal annually, according to Pandrol.\n\nLast month, construction began on a Chinese sponsored coal power plant in Turkey. Situated in the town of Yumurtalik, the 1.7 billion USD project is believed to be “China’s largest ever direct investment\" in Turkey.\n\nIt should also be noted that “China’s top six listed coal-power generators” are not showing any inclination towards aligning with the international call to reduce coal consumption. The country is more keen on reducing electricity prices for its industrial use than reducing emissions from coal-fired power plants.\n\nLack of Dangerous Warming\n\nThe major claim against fossil fuels has been that they contribute to dangerous man-made global warming. However, the changes in global average temperature (GAT) during the past two decades have hardly displayed any dangerous warming.\n\nIf anything, GAT displayed a slowdown in warming between 2000 and 2014, as testified by scientists. In China too, there has been a wide documentation of this slowdown in warming.\n\nIn fact, a 2019 scientific paper analyzed the warming trend in China between 2000 and 2015 and concluded that “there is a regional warming hiatus, a pause or a slowdown in China.” There was an observed slowdown in the warming rate by -0.02 degree Celsius per decade.\n\nSurprisingly, the paper also states that the greenhouse gas induced warming is less than the influence by other natural forces. That is true, as the rapid increase in global atmospheric carbon dioxide concentration failed to cause an increase in the warming rate globally.\n\nBecause of these reasons, Beijing believes there is no immediate danger to climate from carbon dioxide emissions from fossil fuel use. And they are right.\n\nChina has set its priorities correctly, focussing on the urgent need for affordable and abundant energy, instead of playing to the tunes of globalist climate elites at the UN and elsewhere.", "description": "Though the United Nations (UN) continues to turn a blind .10/29/2019 11:04:18AM EST.", "authors": ["Vijay Jayaraj", "Julio Rosas", "Cortney O'Brien", "Leah Barkoukis"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/303/3e8d3297-281e-4705-9bef-31a8db9a75d9.jpg", "published_at": "2019-10-29"}