{"pub": "thehill", "url": "https://thehill.com/opinion/finance/466764-a-big-government-solution-in-search-of-a-small-business-problem", "downloaded_at": "2019-10-22 13:32:24.590203+00:00", "title": "A big-government solution in search of a small-business problem", "language": "en", "text": "Millions of small businesses have something to fear this week, when Congress considers a bill that would wrap them in unnecessary red tape and raise serious privacy concerns for their owners — all while treating job creators like potential criminals.\n\nThe bill in question is the so-called Corporate Transparency Act, which the House has scheduled for a vote today. The goal of the legislation: Prevent criminals from laundering money through shell corporations. Yet it’s a big-government solution in search of a small-business problem.\n\nThe bill’s backers tout it as necessary for promoting corporate responsibility, but big corporations are nowhere to be found in the legislative text. The House bill applies only to companies with 20 or fewer employees, mandating that they file reports to the U.S. Treasury annually, if not more often. This covers nearly 5 million firms — think of your auto mechanic, the corner market, or the beauty salon just down the road.\n\nADVERTISEMENT\n\nEvery business would have to disclose personally identifiable information, down to passport numbers and driver’s licenses, for each of its “beneficial owners” into a searchable government database. What could possibly go wrong? The House bill defines a “beneficial owner” as anyone who “receives substantial economic benefits from the assets” of a small business. What this means is left to regulators, and it potentially could cover tens of millions of people. You don’t have to be a terrorist to want to keep your personally identifiable information from a federal database.\n\nIn any case, no one knows how many bad actors this might catch. To date, none of the bill’s authors has put forward an estimate of the number of criminals or terrorists who set up shell companies on American soil. Instead, the bill treats most small business owners as a potential criminal or threat to national security.\n\nFailure to comply would turn them into a criminal, with penalties of up to $10,000, three years in prison, or both. In some cases, the penalties would cost more than a company can afford to pay.\n\nNor do the concerns end when the report is submitted. The information would go into a federal database containing a treasure trove of personal information on business owners and investors. These individuals are rightly concerned about their privacy, especially with the heightened threat of hacking by real criminals and foreign powers. The 2015 hack of the Office of Personnel Management shows the very real danger; more than 22 million Americans had their personal records stolen. This new database would be even larger, since the Congressional Budget Office estimates it would receive 25 million to 30 million reports every year.\n\nMoreover, any law enforcement agency can request this information without obtaining a subpoena, whether federal, state, local or tribal. Foreign governments also could access the data, if they request it through a federal agency. Nowhere else in America’s legal system do we allow such broad access to personal information. This raises the chance of accidental disclosure. Worse, it raises the possibility of deliberate abuse.\n\nADVERTISEMENT\n\nEven if the privacy concerns weren’t an issue, this still would be a burden that small businesses shouldn’t have to bear. The National Federation of Independent Business (NFIB) estimates the House bill would cost small businesses $5.7 billion over the next decade. It would waste more than 130 million hours of small-business owners’ time on compliance. That money and time could be better spent growing their companies.\n\nThis beneficial ownership information already is available to law enforcement through subpoena, an important privacy protection. A Treasury Department rule became applicable in May 2018 requiring financial institutions to obtain information on the beneficial ownership of their clients. Whereas small businesses are the least equipped to handle this kind of reporting scheme, big banks are much better equipped. There have been no reports about that current system, so it makes little sense to expand it massively.\n\nFully 80 percent of NFIB members say such a mandate is a bad idea. So do 36 other national organizations and trade associations, representing millions of companies from farmers to franchises to self-employed individuals across countless industries. Sadly, Congress failed to ask for small businesses’ input when drafting these bills — and it shows.\n\nMillions of Main Street job creators shouldn’t have to worry about higher compliance costs or loss of privacy. They should not have to prove to the government that they aren’t drug dealers or terrorists, nor should they go to jail or pay huge fines because they failed to fill out a form. When Congress votes, lawmakers should reject the Corporate Transparency Act.\n\nJuanita D. Duggan is president and CEO of the National Federation of Independent Business, a nonprofit, nonpartisan organization that advocates on behalf of small and independent business owners in Washington and in all 50 state capitals. Follow on Twitter @NFIB.", "description": "Small business owners shouldn’t have to worry about higher compliance costs or loss of privacy from the Corporate Transparency Act.", "authors": [], "top_image": "https://thehill.com/sites/default/files/maloneycarolyn_10212019_2.jpg", "published_at": "2019-10-22"}