{"pub": "nyt", "url": "https://nytimes.com/2019/09/24/us/politics/trump-whistleblower-congress.html", "downloaded_at": "2019-09-25 04:38:14.412662+00:00", "title": "White House Seeks Deal for Whistle-Blower to Speak to Congress", "language": "en", "text": "“We applaud the decision to release the whistle-blower complaint as it establishes that, ultimately, the lawful whistle-blower disclosure process can work,” said Mr. Bakaj and I. Charles McCullough III, another lawyer for the whistle-blower.\n\nIntelligence community lawyers have had discussions with the White House and the Justice Department officials about how the whistle-blower can share his complaint without infringing on issues like executive privilege.\n\nAllowing the whistle-blower to meet with congressional investigators would provide the whistle-blower an opportunity to share at least some details of the complaint he filed, even if the full document is not handed over to Congress.\n\nJoseph Maguire, the acting director of national intelligence, said Tuesday that he would work with Congress and the administration to find a resolution in the standoff over congressional access to the complaint.\n\nIn a sharply worded statement, Mr. Maguire pushed back on an assertion by Ms. Pelosi that he had acted illegally by withholding the whistle-blower complaint from Congress.\n\n“In light of recent reporting on the whistle-blower complaint, I want to make clear that I have upheld my responsibility to follow the law every step of the way,” Mr. Maguire said.\n\nMr. Maguire also appeared to defend the whistle-blower, saying that all members of the country’s intelligence agencies “have a solemn responsibility to do what is right, which includes reporting wrongdoing.”", "description": "As House Democrats moved to begin a formal impeachment inquiry, the administration also prepared to release a redacted version of the whistle-blower’s complaint.", "authors": ["Michael S. Schmidt", "Julian E. Barnes", "Maggie Haberman"], "top_image": "https://static01.nyt.com/images/2019/09/24/multimedia/24dc-whistleblower/merlin_148352457_b9c39dec-e25d-4daf-9637-f71e680f1086-facebookJumbo.jpg", "published_at": "2019-09-24"}