{"pub": "yahoo", "title": "Cubs rally for 5 runs in 7th to beat Mariners 5-1", "url": "https://sports.yahoo.com/cubs-rally-5-runs-7th-beat-mariners-5-213435948--mlb.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:04:34.030730+00:00", "text": "Cubs rally for 5 runs in 7th to beat Mariners 5-1 Chicago Cubs' Kyle Schwarber hits a three-run triple against the Seattle Mariners during the seventh inning of a baseball game Monday, Sept. 2, 2019, in Chicago. (AP Photo/Jim Young)\n\nCHICAGO (AP) -- After not scoring for nearly three full games, the Cubs were desperate for a big hit or a lucky break.\n\nBoth played a role in Chicago's late rally on Monday.\n\nKyle Schwarber had a three-run triple to highlight a five-run seventh, and the Cubs snapped a 24-inning scoreless streak in a 5-1 victory over the Seattle Mariners.\n\nScroll to continue with content Ad\n\nAnthony Rizzo went 2 for 2 and drove in a run for Chicago, which remained 3 1/2 games behind the St. Louis Cardinals in the NL Central. The Cubs have a 2 1/2-game lead for the second wild card in the NL.\n\nThe Cubs were coming off back-to-back shutout losses to the Milwaukee Brewers. Before Sunday, they hadn't been shut out in back-to-back games at Wrigley Field since August 2013 vs. the Dodgers.\n\n''Our lineup did an unbelievable job today just being persistent,'' starter Kyle Hendricks said. ''Putting together great at-bats all game. That's what we've been doing the last few days, but had just been hitting balls right at guys and not finding holes.''\n\nJason Heyward led off the seventh with a walk against reliever Matt Wisler (3-3) and stole second. One out later, Kris Bryant walked. Left-hander Taylor Guilbeau then came on to face Rizzo, who stroked a sharp single to center to score Heyward.\n\nOn the play, Bryant and Rizzo advanced on a throwing error by center fielder Jake Fraley, and then pinch-hitter Albert Almora Jr. was intentionally walked to load the bases. Schwarber followed with a grounder down the line that hit off first base and rolled down the line in foul territory as all three runners scored for a 4-1 Chicago lead.\n\nIf the ball doesn't hit the bag, first baseman Austin Nola might have been able to make a play on it, or at least keep it in the infield.\n\nStory continues\n\n''We needed to have that one break,'' manager Joe Maddon said. ''We needed something like that to get us rolling in the right direction.''\n\nAddison Russell plated Schwarber with a grounder to shortstop to cap the rally.\n\nDavid Phelps (2-0) pitched a scoreless seventh inning. Duane Underwood Jr. and Brad Wieck closed it out.\n\nHendricks allowed one run on three hits in six innings, walking one and striking out seven. He was lifted for a pinch-hitter despite only throwing 81 pitches.\n\nSeattle rookie Justus Sheffield left with the lead after tossing five scoreless innings. He allowed five hits, walked two and struck out a career-high seven.\n\nThe Cubs had runners on base in each inning against Sheffield, but went 0 for 8 with runners in scoring position - leaving a total of nine runners on base through five.\n\n''Justus Sheffield was awesome,'' Seattle manager Scott Servais said. ''Really, really excited about what I saw out of him today. In this environment, first time pitching in this kind of setting, I thought he handled it great.''\n\nThe Mariners got their run off Hendricks in the fifth on back-to-back doubles with one out by Dylan Moore and Dee Gordon.\n\nPAINFUL RECORD\n\nRizzo also was hit by a pitch twice to set the Cubs' all-time franchise record at 139. The previous mark was 137 by Frank Chance.\n\n''I saw it on the board, I said, 'Whoa,''' Rizzo said. ''I didn't know I was approaching anything.''\n\nMaddon joked that like Joe DiMaggio's 56-game hitting streak or Cal Ripken Jr.'s record for consecutive games played, Rizzo's mark might never be broken.\n\nROSTER MOVE\n\nThe Cubs recalled RHP Adbert Alzolay from Triple-A Iowa before the game. The 24-year-old is the team's top starter prospect, but will be used out of the bullpen.\n\nTRAINER'S ROOM\n\nMariners: C Omar Narvaez was scratched from the preliminary lineup because of back spasms.\n\nCubs: SS Javier Baez was held out after injuring his left thumb sliding into second base on Sunday. Maddon said Baez might miss Tuesday night's game as well. ... RHP Yu Darvish, who was scratched Sunday with right forearm tightness, is expected to make his next start on Saturday at Milwaukee. ... C Willson Contreras (right hamstring strain) is continuing his rehab stint with Triple-A Iowa and could return this weekend.\n\nUP NEXT\n\nCubs LHP Jon Lester (11-9, 4.36 ERA) faces Mariners RHP Felix Hernandez (1-4, 6.02) in the finale of the two-game series Tuesday night in a matchup of former Cy Young Award winners.\n\n---\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP-Sports", "description": "After not scoring for nearly three full games, the Cubs were desperate for a big hit or a lucky break.  Both played a role in Chicago's late rally on Monday.  Kyle Schwarber had a three-run triple to highlight a five-run seventh, and the Cubs snapped a 24-inning scoreless streak in a 5-1 victory", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/u_j_jXvbviepmyg06gNqMA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMjQ7aD02ODI-/https://s.yimg.com/uu/api/res/1.2/OqSZeHihu4HQissOxcnO6w--~B/aD0zNDE7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201909021611582711870"}