{"pub": "reuters", "url": "https://reuters.com/article/us-mekong-river/new-mekong-dam-in-laos-opens-to-protests-dried-out-downstream-idUSKBN1X80VZ", "downloaded_at": "2019-10-29 14:03:01.766705+00:00", "title": "New Mekong dam in Laos opens to protests, dried-out downstream", "language": "en", "text": "BAN NAMPRAI, Thailand (Reuters) - The first hydropower dam on the lower Mekong River began commercial operations in Laos on Tuesday amid protests from villagers in Thailand who say the Xayaburi Dam and several others in the works will destroy their livelihoods.\n\nActivists and villagers protest against Laos dam on Mekong river outside of Loei, Thailand, October 29, 2019. REUTERS/Soe Zeya Tun\n\nThe 1,285-megawatt Xayaburi Dam’s debut coincides with parts of the Mekong drying to a trickle even at the end of the rainy season, though its builders and operators say it is not responsible for the reduced river flow.\n\nXayaburi, which will sell 95% of its power to Thailand at an average rate of 2 baht ($0.066) per unit, is the first of at least nine more hydropower projects either under construction or planned on the lower Mekong in Laos.\n\nThe new spate of dam-building is poised to turbo-charge already-fraught water and food security disputes after years of worry about the 11 existing Beijing-built dams on the upper Mekong in China are choking the river on which millions depend for their livelihoods in Laos, Thailand, Cambodia and Vietnam.\n\nXayaburi Dam has been nine years in the making and the 135 billion baht ($4.47 billion) project, built and financed by Thai companies and banks, has been controversial since inception.\n\nOn Tuesday, Buddhist monks on the Thai side of the Mekong chanted and provided blessings in a ceremony for the river, which activists from the Freedom Mekong Group says is in danger of dying.\n\n“When Xayaburi dam officially generates electricity ... we won’t be able to know how the river will change and how bad it will deteriorate, said activist Montri Chanthawong.\n\nAbout 150 km (90 miles) to the south of Xayaburi, the fishing village of Ban Namprai is having its driest year in living memory.\n\nVillagers say the Mekong is normally at least 3 meters high at the end of the rainy season, when Ban Namprai typically holds dragon boat races, which this year had to be canceled.\n\nFishermen and fish farmers said that since March, when Xayaburi first started testing their turbines, they’ve seen ever-more erratic river flow that can’t be explained just by a drought earlier in the year.\n\n“I think the future of the river is dire. This is just the beginning,” said Ban Nampai’s village chief, Sangtong Siengtid, 45, who is a fisherman himself.\n\n“With more dams, the once powerful Mekong river will become just a small creek,” he said.\n\nSome fish farmers in the nearby town of Nong Khai have begun moving fish enclosures out of the river and into manmade ponds fed by pumped-in water, said Krit Hemarak, 39, a local fish farm entrepreneur.\n\nXayaburi’s main developers, Thailand’s CK Power PCL , blamed the dried-up patches of riverbed downstream on late monsoon rains and an upstream Chinese dam.\n\nCK Power, a subsidiary of Thai construction company CH. Karnchang Public Company Limited , declined requests for interviews from Reuters and did not respond to written questions.\n\nSlideshow (5 Images)\n\nIts Facebook page features videos of special 6 billion baht ($200 million) “fish ladders” and sediment gates that CK Power says will ensure the Mekong’s fragile ecosystem of fish migration and the sediment crucial to farming in Vietnam’s Mekong Delta will not be harmed.\n\nThe company will invest in “the most sustainable manner”, Thanawat Trivisvavet, CK Power’s managing director, said in an article in a local newspaper on Tuesday.\n\nEnvironmental groups say the technology has not been tested.", "description": "The first hydropower dam on the lower Mekong River began commercial operations in Laos on Tuesday amid protests from villagers in Thailand who say the Xayaburi Dam and several others in the works will destroy their livelihoods.", "authors": ["Panu Wongcha-Um", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191029&t=2&i=1446185313&w=1200&r=LYNXMPEF9S10H", "published_at": "2019-10-29"}