{"pub": "yahoo", "url": "https://finance.yahoo.com/news/us-stocks-wall-street-gains-202529698.html", "downloaded_at": "2019-10-11 00:17:08.626944+00:00", "title": "US STOCKS-Wall Street gains on trade optimism, but Beijing tempers hopes", "language": "en", "text": "(For a live blog on the U.S. stock market, click or type LIVE/ in a news window)\n\n* Beijing open to partial trade deal - BBG\n\n* China offering extra U.S. agriculture purchases - FT\n\n* Fed minutes support an additional rate cut this year\n\n* Chipmakers see biggest gain in over a month\n\n* Indexes up: Dow 0.7%, S&P 500 0.91%, Nasdaq 1.02% (Updates to market close)\n\nBy Stephen Culp\n\nOct 9 (Reuters) - Wall Street rose on Wednesday on hopes of progress in U.S.-China trade talks, though stocks pared gains late after Chinese officials said Beijing had lowered expectations for negotiations this week.\n\nAll three major U.S. stock averages closed in the black, but lost ground as the closing bell approached after Chinese officials said goodwill was damaged by the U.S. Commerce Department's blacklisting of 28 Chinese companies this week.\n\nInvestor sentiment got an early boost following a Bloomberg report that China remained open to agreeing to a partial trade deal with the United States.\n\nSeparately, the Financial Times said Beijing was offering to increase its annual purchases of U.S. agricultural products.\n\n\"A partial deal with China would at least pave the way for a larger deal down the road,\" said Tim Ghriskey, chief investment strategist at Inverness Counsel in New York. \"Every day we get a different tweet and the market takes a different direction. Today is an up day on a favorable tweet.\"\n\nMinutes from the U.S. Federal Reserve's September meeting showed most policymakers supported last month's interest rate cut, and while all were generally more concerned with risks associated with the U.S.-China trade war and slowing global growth among other geopolitical issues, they differed on what that meant for the U.S. economy.\n\n\"There was some dissent in the vote, but everyone's together on the concept of monetary policy setting being data dependent,\" said Joseph Sroka, chief investment officer at NovaPoint in Atlanta. \"And recent data, particularly from the manufacturing sector, would continue to imply there's a good probability of a rate reduction at the October meeting.\"\n\nTrade tensions, signs of slowing economic growth and rising geopolitical tensions have gripped equity markets so far this month, with the S&P 500 and Dow Jones indexes off about 2% since the end of September.\n\nThe Dow Jones Industrial Average rose 182.1 points, or 0.7%, to 26,346.14, the S&P 500 gained 26.34 points, or 0.91%, to 2,919.4 and the Nasdaq Composite added 79.96 points, or 1.02%, to 7,903.74.\n\nAll 11 major sectors of the S&P 500 closed higher, with technology and energy enjoying the largest percentage gains.\n\nTrade-sensitive chipmakers rose, with the Philadelphia SE Semiconductor index rising 1.7%.\n\nMicrosoft led the Dow's gain, advancing 1.9%, while Johnson & Johnson was the blue-chip index's sole decliner.\n\nThe drugmaker's shares dropped 2.0% after a jury awarded $8 billion in punitive damages in a case surrounding its antipsychotic drug Risperdal.\n\nWith third-quarter earnings season coming into focus, analysts now expect earnings for S&P 500 companies to drop by 3.1% year-on-year, the first contraction since the earnings recession that ended in 2016.\n\nAdvancing issues outnumbered declining ones on the NYSE by a 1.95-to-1 ratio; on Nasdaq, a 1.60-to-1 ratio favored advancers.\n\nThe S&P 500 posted 12 new 52-week highs and 11 new lows; the Nasdaq Composite recorded 10 new highs and 120 new lows.\n\nVolume on U.S. exchanges was 5.33 billion shares, compared with the 7.05 billion average over the last 20 trading days. (Reporting by Stephen Culp Editing by Tom Brown)", "description": "Wall Street rose on Wednesday on hopes of progress in U.S.-China trade talks, though stocks pared gains late after Chinese officials said Beijing had lowered expectations for negotiations this week. Investor sentiment got an early boost following a Bloomberg report that China remained open to agreeing", "authors": ["Stephen Culp"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.lLXTcarMWG9jtrcCbWtUQ--~B/aD00NDgwO3c9NjcyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://s.yimg.com/os/creatr-images/2019-10/90aefe70-e94a-11e9-9ae7-7ec950565061", "published_at": "2019-10-09"}