{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3069603&cloc=joongangdaily|home|newslist1", "downloaded_at": "2019-10-29 13:52:19.765441+00:00", "title": "Proportion of temporary workers hits 12-year high", "language": "en", "text": "Temporary workers’ share of the total workforce reached the highest level in more than a decade - despite the Moon Jae-in administration’s strenuous and expensive efforts to reduce that share of workers.Statistics Korea reported Tuesday that the number of workers in temporary employment rose by 867,000 in August from the previous year to reach 7.48 million, accounting for 36.4 percent of Korea’s workforce of 20.56 million.That proportion was the highest since March 2007, when temporary workers accounted for 36.6 percent of the total.Such jobs were 33.0 percent of the total in August 2018.One of President Moon Jae-in’s chief campaign promises in 2017 was greater job security and a reduction in the share of temporary workers to the average of Organisation for Economic Cooperation and Development members.Temporary workers in Korea accounted for 21.9 percent of the total in 2016 under OECD standards, nearly double the average for OECD countries. That figure increased to 24.4 percent this year with the latest data, according to the statistics agency.The government downplayed the results on Tuesday, explaining that this year’s rise was caused by an inclusion of a new category of temporary workers due to changes in calculation standards by the International Labour Organization (ILO). Statistics Korea estimated that as many as 500,000 workers were added due to the change, arguing that this year’s figures should not be compared with those from the past.“Even accounting for such excuses, there was a significant increase,” said Kim Tai-gi, a professor of economics at Dankook University. “This can be explained as a failure in labor policy.”Kim added that stronger labor regulations under the current administration likely discouraged businesses from actively hiring employees for the regular payroll.A recent government drive to increase jobs for older workers also contributed to the increase in temporary workers.“Considering the recent changes in employment trends, there has been an increase in the share of over-60-year-old workers,” said Kang Shin-wook, commissioner of Statistics Korea during a briefing at the Central Government Complex in Seoul. “There is a high possibility that these workers have a fixed employment period.”The government plans to create 610,000 jobs for the elderly this year to deal with an aging population.According to agency data, people over 59 years old held 25.9 percent of all temporary jobs, up 1 percentage point from last year. The share for that age group stood at 22.5 percent in 2016.The average period of employment for temporary workers dropped by 2 months to 2 years and 5 months this year. Wages for regular and temporary workers both rose by 5.2 percent.BY CHAE YUN-HWAN [chae.yunhwan@joongang.co.kr]", "description": "", "authors": [], "top_image": "https://pds.joins.com/jmnet/koreajoongangdaily/_data/photo/2019/10/29204203.jpg", "published_at": "2019-10-29"}