{"pub": "cbc", "url": "https://cbc.ca/sports/olympics/winter/curling/cheryl-bernard-team-scheidegger-substitute-curling-1.5288985", "downloaded_at": "2019-09-18 23:21:04.487406+00:00", "title": "Sports-no-CBC", "language": "en", "text": "Sometimes when curling analyst Cheryl Bernard makes the walk from the broadcast booth down to the ice, the competitive feelings come rushing back.\n\nThe 2010 Olympic silver medallist, who serves as president and CEO of Canada's Sports Hall of Fame, has no plans for a comeback at the elite women's level. But she is planning a return to top-flight competition as a substitute at three upcoming events with Team Scheidegger.\n\n\"I think it'll come back instantly — that desire to want to win,\" Bernard said Wednesday from Calgary.\n\nBernard, 53, has stayed active in the sport since her retirement five years ago. In addition to her television work with TSN, she has played some mixed doubles, is on a competitive senior women's team and also served as an alternate on Rachel Homan's rink at the 2018 Pyeongchang Games.\n\nWith skip Casey Scheidegger due to give birth to her second child this November, Bernard will join the team at a World Curling Tour stop in Calgary next month ahead of the Nov. 27-Dec. 1 Canada Cup in Leduc, Alta., and the Dec. 10-15 National in Conception Bay South, N.L.\n\n\"That's doable for me,\" Bernard said. \"I got excited and I thought, 'You know what, this will be awesome.' I get to go back and play with Kristie Moore, who was on our Olympic team, and maybe kind of mentor the younger girls a little bit.\n\n\"It'll be fun to apply what I've seen from the booth perspective down onto the ice level.\"\n\nCurrently ranked ninth in the world, Team Scheidegger also includes third Cary-Anne McTaggart and second Jessie Haughian. Moore, an alternate on the 2010 Olympic team, plays lead.\n\nThe team is coming off a fifth-place showing at a WCT bonspiel last week in Edmonton, falling to reigning national champion Chelsea Carey in the quarter-finals. Moore handled skip duties at that event with Susan O'Connor subbing at lead.\n\nBernard won a silver medal at the Scotties Tournament of Hearts in 1996, one of four career appearances at the national playdowns. She defeated Shannon Kleibrink to win the 2009 Olympic Trials and reached the final at the Vancouver Games before falling in an extra end to Sweden's Anette Norberg.\n\n\"I don't think it'll take very long for me to fit in and understand the game style that we need to call and where I'll see strengths and weaknesses,\" Bernard said. \"[Situations] under pressure is usually what you'll notice.\"\n\nKeep things fresh\n\nBernard, who said she has talked at length with Scheidegger about the team's style and gameplan, wants to avoid predictability on the ice.\n\n\"Every now and then, throw something different in there and it sets the opposition back on their heels,\" Bernard said. \"So I think this might be the chance for their team to just try some different ways to start an end, different ways to finish a game, without any pressure.\n\n\"There's no pressure on the team either. They don't have their skip, they've got a spare coming in, it's kind of a great opportunity.\"\n\nTeam Scheidegger broke out in 2017 after winning a Grand Slam at the Canadian Open. The Lethbridge, Alta.-based rink won a provincial title in 2018 and returned to the Scotties last season as a wild-card entry.\n\n\"Winning begets winning I think,\" Bernard said. \"They started to win games and then they started to win more games because they believed that they could win games. I think the only difference between a champion on the podium and somebody that hasn't got there is just belief that you can actually do it.\n\n\"Now I see it with them. They're more comfortable when the cameras are on and the lights go on. You can't actually train that. It just has to happen over time.\"\n\nThe Canada Cup winner will earn a berth in the 2021 Tim Hortons Roar of the Rings, which serves as the qualifier for the 2022 Beijing Olympics.", "description": "2010 Olympic silver medallist Cheryl Bernard, who serves as president and CEO of Canada's Sports Hall of Fame, has no plans for a comeback at the elite women's level. But she is planning a return to top-flight competition as a substitute at three upcoming events with Team Scheidegger.", "authors": [], "top_image": "https://i.cbc.ca/1.5289002.1568842678!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/cur-bernard-20140617.jpg", "published_at": "2019-09-18"}