{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/23/plug-and-play-launches-an-accelerator-to-develop-technologies-addressing-plastic-waste", "downloaded_at": "2019-10-23 14:56:45.062218+00:00", "title": "Plug and Play launches an accelerator to develop technologies addressing plastic waste – TechCrunch", "language": "en", "text": "The Plug and Play network of accelerator programs is partnering with the non-profit organization The Alliance to End Plastic Waste to create an accelerator focused on developing technologies to reduce, remove or replace plastics in the industrial ecosystem.\n\nLike Techstars, Plug and Play operates a number of industry-focused accelerator programs around the world and for this program, targeting solutions that will lower the impact of plastic waste on the environment, the accelerator . will operate two programs annually in three different regions — Silicon Valley, Paris, and Singapore.\n\nFor its part, the Alliance to End Plastic Waste will work with the companies that support the organization, which include some of the largest chemical companies and manufacturers of plastic waste, to select focus areas and source specific startups working on solutions.\n\nRepresentative members of the organization include: BASF, Berry Global, Braskem, Chevron Phillips Chemical Company LLC, Dow, ExxonMobil, Formosa Plastics Corporation USA, Gemini Corporation, Geocycle, Grupo Phoenix, Henkel, LyondellBasell, Mitsubishi Chemical Holdings, Mitsui Chemicals, PepsiCo, PolyOne, Pregis, Procter & GambleSealed Air Corporation, Shell, Sinopec, SKC co., ltd., Storopack, SUEZ, Sumitomo Chemical, TOMRA, and Total.\n\nIndustrial companies don’t have the best history when it comes to reinventing their entire business models with new technologies, but at least there’s some effort being put toward these initiatives.\n\nEach program will run for 12 weeks and accept ten startups. In true accelerator fashion there will be a demo day where AEPW and Plug and Play would have the opportunity to invest in participating companies.\n\n“I believe when we bring together all the stakeholders—large corporations, entrepreneurs, startups, and universities—you can create real change,” said said Saeed Amidi, the founder and chief executive of Plug and Play, in a statement. “By devoting resources and attention to this global issue of plastic waste, we can make a difference in the environment. Through this platform I commit to spend more of my time on sustainability-focused initiatives and will invest in 20 startups in this space per year,”\n\nApplications are now open for the first program, which will run from February through May 2020.", "description": "The Plug and Play network of accelerator programs is partnering with the non-profit organization The Alliance to End Plastic Waste to create an accelerator focused on developing technologies to reduce, remove or replace plastics in the industrial ecosystem. Like Techstars, Plug and Play operates a number of industry-focused accelerator programs around the world and for […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2015/12/shutterstock_320894498.jpg?w=600", "published_at": "2019-10-23"}