{"pub": "townhall", "url": "https://townhall.com/columnists/sheriffdavidclarkeret/2019/09/24/democrat-party-primary-clown-car-analysis-n2553600", "downloaded_at": "2019-09-25 04:36:30.299026+00:00", "title": "Democratic Party Primary: Clown Car Analysis", "language": "en", "text": "The Democratic presidential primary clown car is driving in circles, blaring circus music, periodically stopping to toss one candidate out at a time. Five clowns so far have mercifully been tossed out. Cop-hating Mayor Bill de Blasio—whose latest poll had 0% support, is the most recent flunk because even Democratic voters know what he is doing in New York City isn’t good for the country. The 14 or so candidates remaining who qualified for the fourth debate are all colorful and mindless, clapping their arms like seals in front of a camera.\n\nThere is a lot of time between now and the first contest in Iowa in February 2020. However, there are a few observations worth noting as gaffe-machine Joe Biden is driving the clown car right now. He continues leading in the polls currently garnering 25% support among Democratic voters, which doesn’t seem like a lot but given that the first debate had 25 or so people, that is significant.\n\nSitting in the front passenger’s seat is Elizabeth Warren. She continues to rise in the polls as she endeavors to be the next generation Bernie Sanders, except she is nearly as old as he is. Warren who was formerly disguised as a Cherokee Indian is now a Santa Claus-looking clown promising everything to everybody including free healthcare, free education, forgiving student loan debt and a monthly paycheck for every non-working person. The bill for all this exceeds around $5 trillion and oh yeah, by the way, she has no plan to pay for it except to say, tax the rich. All of this is music to the ears of socialists and Democratic voters, and as a result, Warren is drawing what has been described as (but not verified) large crowds to her public events.\n\nBernie Sanders has taken on the image of an aging boxer who believes he has one more fight in him. He doesn’t. He’s your grandfather’s socialist, whose suits fit him like a hobo clown. Warren has stolen his thunder and captured the imagination of his young idealistic and clueless base looking to have their student loan debt forgiven.\n\nAnd then there is Cory Booker. Poor Cory, literally. His campaign is running on empty. He’s the sad-face clown in the car. He reminds me of that kid on the playground who never gets picked for a team in playground basketball. He excitedly yells and screams, “hey pick me, I’m over here, pick me,” but to no avail. He can’t get anybody’s attention because he’s not good enough or worth wasting a pick on. He was once a rising star after the Democratic 2016 convention, but his journey has turned out to be all sizzle, no steak.\n\nAnd then there is shifty-clown Kamala Harris. She is dropping like a lead weight. A Politico story spoke to her 13% drop in Iowa after the first debate that had her surging and tied for first with Biden and Warren. To make things worse, this was a poll apparently commissioned by her chief pollster. In reality, Kamala is even falling behind Andrew Yang for heaven's sake in California polling. Her campaign started with so much promise, and she led in early polls. But her problem is that she couldn’t figure out who she was. As State Attorney General of California, she was tough on crime and a supporter of the police. Once the opposition research on her was revealed, she was finished. Now she has decided to be an advocate for criminals and anti-police lunatics. She recently agreed with a cop-hater's assessment that the police were just taking up space in the crime-ridden neighborhoods and weren’t needed. As Attorney General, she threw people in jail for marijuana possession. Today she is for federally legalizing marijuana. Additionally, on the topic of dope legalization, when asked if she ever smoked marijuana, she reached back to her Jamaican roots to answer yes. She conveniently becomes African American, just as she did when she tried to get her blackness book stamped as she genuflected at the altar of Al Sharpton for a photo-op. And at a campaign stop, her staff left behind campaign strategy notes. That’s a rookie mistake.\n\nIf it sounds like I am overly harsh on Kamala, you would be right. She has no core. I don’t like or trust politicians who engage in situational politics depending on who he or she is meeting with or talking to. She has turned out to be a 2.0 version of Hillary Clinton. The sooner Harris drops out, the better. I’ll pop a bottle of champagne when she does.\n\nAs for Bozo Robert Francis O’Rourke and his plan to confiscate everybody’s semi-automatic rifles? Well, let’s just leave it at that. This isn’t a serious policy proposal.\n\nNone of the other clowns packed in the Democratic primary clown car including Mayor Pete, Julian Castro, Andrew Yang or Amy Klobuchar are worthy of further mention here. And Steyer is just full of himself.\n\nI know it’s still early, things could change, and anybody’s campaign could catch lightning in a bottle as they say. Someone will emerge as the challenger to President Trump in November 2020. I won’t take whoever that is lightly because one of these clowns driving aimlessly in circles could catch that lightning in a bottle and become president of the United States. What a scary thought. If this happens, it will be the GOP's fault for not taking these clowns seriously.\n\nLet’s not make the same mistake the Democrats did in 2016. Arrogance and complacency are the enemies of success. Republicans must act today like it’s a week before the election—all hands on deck and leaving nothing on the field. The stakes are too high.", "description": "The Democratic presidential primary clown car is driving in circles, .09/25/2019 0:36:31AM EST.", "authors": ["Sheriff David", "Clarke", "Katie Pavlich", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/255/587e93a3-a028-400f-bbc0-d33887cfe1ad.png", "published_at": "2019-09-24"}