{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/racing/article-7555449/Irish-trainer-Jessica-Harrington-bidding-second-two-year-old-filly-success-fortnight.html", "downloaded_at": "2019-10-09 19:05:36.517224+00:00", "title": "Irish trainer Jessica Harrington bidding for second two-year-old filly success in a fortnight", "language": "en", "text": "Irish trainer Jessica Harrington tries to win a third group one race for two-year-old fillies within a fortnight when unbeaten Cayenne Pepper lines up in Friday's Fillies' Mile at Newmarket.\n\nHarrington, who already has won the Cheveley Park Stakes (Millisle) and Prix Marcel Boussac (Albigna), said: 'We have always liked Cayenne Pepper and what she's done is already on the board.\n\n'She's three-from-three, she's won on good ground, she's won on fast ground and she won with a bit of ease in the ground at The Curragh last time.\n\nTrainer Jessica Harrington with Alpha Centauri after their win Tattersalls 1000 Guineas\n\n'I was delighted with her victory in the Flame Of Tara Stakes where she saw the mile out well. She made the running then and also on her previous start but she doesn't have to lead.\n\n'She's a straightforward filly who is very laid back so I can't imagine the travelling over to Newmarket would worry her. She's a well-balanced individual who has won on a variety of tracks here in Ireland so the dip should not be a problem either.\n\n'To win a third Group 1 in the space of a couple of weeks would be simply unbelievable.'\n\nShane Foley is congratulated by Harrington after winning Juddmonte Cheveley Park Stakes\n\nEight opponents include Roger Charlton-trained, nine-length Newbury Quadrilateral, the ante-post favourite for next season's 1,000 Guineas, and Hugo Palmer's May Hill Stakes winner Powerful Breeze.\n\nAidan O'Brien runs Group One Moyglare Stud Stakes winner Love.\n\nMeanwhile, for the second day running Sheik Mohammed secured the top lot at the prestigious Tattersall Book One sale when paying £3,255,000 for a Frankel colt which is a half-brother to 2015 Derby winner Golden Horn.\n\nThe Sheik, who again outbid the Coolmore Stud, paid £3,780,000 for a half-brother to 2017 St James's Palace winner Barney Roy on Tuesday.\n\nSheik Mohammed's Godolphin operation also secured a colt by sire Kingman from the family of 2009 Irish Derby winner Fame And Glory for £2,415,000.", "description": "Harrington, who already has won the Cheveley Park Stakes (Millisle) and Prix Marcel Boussac (Albigna), said: 'We have always liked Cayenne Pepper,' the unbeaten horse she's using.", "authors": ["Marcus Townend For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/17/19501954-0-image-a-72_1570640136367.jpg", "published_at": "2019-10-09"}