{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7616069/Laura-Whitmore-reveals-suffered-miscarriage-weeks-finding-pregnant-year.html", "downloaded_at": "2019-10-26 08:47:18.205962+00:00", "title": "Laura Whitmore reveals she suffered a miscarriage weeks after finding out she was pregnant last year", "language": "en", "text": "Laura Whitmore has revealed that she suffered a miscarriage last year.\n\nThe TV presenter, 34 - who has been in a relationship with Iain Stirling for more than two years - revealed that doctors couldn't detect a heartbeat at her 12 week scan.\n\nExplaining that she hadn't initially planned for her pregnancy, the Irish star confessed that she didn't know whether she was meant to 'cry or be emotional' following the heartbreaking news.\n\nHeartbreak: Laura Whitmore, 34, has revealed that she suffered a miscarriage last year\n\nDetailing all in a piece she wrote herself for Hot Press, Laura revealed that she noticed her boobs were 'massive' while on a job in Italy.\n\nAfter coming to the shock realisation that she was pregnant, the blonde beauty admitted that she 'didn't want want her life to change' - but told herself she could still be 'pregnant and have fun' and went to the GQ Awards that very night.\n\nLaura then revealed she went for her 12 week scan at a private clinic at Harley Street.\n\n'In the room I could see the outline of what looked like a jelly baby – just like in the movies. Then silence,' she stated, before admitting the doctor told her: 'I’m sorry there’s no heart-beat.'\n\nAnguish; The TV presenter - who has been in a relationship with Iain Stirling for more than two years - revealed that doctors couldn't detect a heartbeat at her 12 week scan\n\nConcerns; Explaining that she hadn't planned for her pregnancy, the star confessed that she didn't know whether she was meant to 'cry or be emotional' following the heartbreaking news\n\nLaura then admitted she was left 'spinning', explaining: ' I wasn’t sure how I was supposed to react. Should I cry? Was I allowed be emotional for something unplanned?'\n\nThe former MTV host also went on to reveal that she felt 'alone' while coming to terms with what she had been through.\n\nThe miscarriage also made her realise that she does want children.\n\nLaura is in a relationship with Love Island voice-over star Iain since 2017.\n\nIn March last year, the hunk 'happily' admitted that he was punching above his weight by developing a romance with the blonde beauty.\n\nStruggles: The beauty admitted that she 'didn't want want her life to change' - but told herself she could still be 'pregnant and have fun' and went to the GQ Awards (pictured) that very night\n\nSpeaking on the Chris Ramsey Show, host Chris said: 'People tell you, and I do not agree with this and I hate it when people say this to blokes, people tell you you're punching above your weight, and I don't like that.\n\n'One, you're a good looking lad. I find it underhanded. I find it snide. It's basically someone going, 'I'd f*** your girlfriend,' and I don't like it. I don't like it at all. And I don't think you're punching above your weight. I think you're a beautiful man.'\n\nBut the funnyman admitted he was unfazed by the comments, because he agrees with them.\n\n'I don't mind it, because it just means I've done better haven't I?' he said. 'I've got someone who's like me, but much, much better. And Laura's got someone who's like her, but much worse.\n\n'I think I've done quite well out of it, but I'm dead happy because she's lovely and stuff.'", "description": "Laura Whitmore, 34, has revealed that she suffered a miscarriage last year.", "authors": ["Jabeen Waheed For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/09/20210618-0-image-a-29_1572078132286.jpg", "published_at": "2019-10-26"}