{"pub": "businessinsider", "url": "https://businessinsider.com/jennifer-lopezs-versace-grammys-dress-inspired-google-image-search-2015-5", "downloaded_at": "2019-09-21 14:47:52.875668+00:00", "title": "How Jennifer Lopez's infamous 2000 Grammys dress — which was unretired this week — inspired Google image search", "language": "en", "text": "Jennifer Lopez wearing a Versace green dress in 2019 (L) and 2000 (R.) AP\n\nIt was the year 2000 — seven years before anyone had even heard of Kim Kardashian or before Beyoncé walked red carpets nearly nude.\n\nUp until this point, red carpets were fairly tame, fully-clothed affairs.\n\nThat is, until Jennifer Lopez arrived to the 2000 Grammys in that now infamous green Versace gown with a neckline that plunged down to her naval and was held together simply by fashion tape.\n\nAnd before Kim Kardashian self-admittedly \"broke the internet\" with her bare-bottom photos, J.Lo's dress really did.\n\nLopez wore the very same green dress at a Versace fashion show on Friday, sending the internet into meltdown once again, just 20 years later.\n\nActress Jennifer Lopez wears a creation as part of the Versace Spring-Summer 2020 collection, unveiled during the fashion week, in Milan, Italy, Friday, Sept. 20, 2019. (AP Photo/Luca Bruno) Associated Press\n\nIn an essay published in January on Project Syndicate, Eric Schmidt, executive chairman of Google, writes: \"At the time, it was the most popular search query we had ever seen. But we had no surefire way of getting users exactly what they wanted: J.Lo wearing that dress.\"\n\nAs a result, Schmidt says, \"Google Image Search was born.\"\n\nSchmidt further explained how Google expanded from just text to images:\n\nOur co-founders Larry Page and Sergey Brin - like all other successful inventors - kept iterating. They started with images. After all, people wanted more than just text. This first became apparent after the 2000 Grammy Awards, where Jennifer Lopez wore a green dress that, well, caught the world's attention.\n\nE! News recently asked Lopez if she knew she inspired the photo-based search tool, to which she responded, \"I heard that, who knew?!\"\n\nBut Lopez has yet to receive any compensation for her contribution. \"I'm a little bit upset about it,\" she joked. \"I'm sure Versace's in on it as well.\"\n\nWhen asked whether or not she wished she had gotten something from it, she teased, \"Just a small part of it... a truck full of money.\"\n\nToday, Google has thousands of options when looking for J.Lo's Grammys dress.", "description": "J-Lo's green dress at the Grammy's broke the internet in 2000 but you may not know it was that very same dress that inspired Google Images.", "authors": ["Aly Weisman", "Bill Bostock"], "top_image": "https://amp.businessinsider.com/images/5d86096a2e22af72bd006e14-960-480.jpg", "published_at": "2019-09-21"}