{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7605877/Mother-criticised-strict-parents-claims-rigid-rules-make-kids-respectful.html", "downloaded_at": "2019-10-24 08:02:09.107839+00:00", "title": "Mother criticised for being 'too strict' by other parents claims rigid rules make kids 'respectful'", "language": "en", "text": "A mother-of-two who was told her children will 'grow up hating her' for being 'too strict' by other parents claims her rigid routine makes them 'respectful'.\n\nDanielle Hannah Alexander, 32, from Monmouth, South Wales, is mum to five-year-old son Jody and daughter Jade, three.\n\nShe and husband-of-two-and-a-half-years Jamie, 30, a self-employed builder, both work full-time and claim 'rules are a must' for a harmonious household.\n\nThese include banning fizzy drinks, not allowing play dates on school nights and letting them go hungry if they refuse to eat their dinner.\n\nDanielle Hannah Alexander, 32, from Monmouth, South Wales, is mum to five-year-old son Jody and daughter Jade, three (pictured)\n\nA recent international parenting study conducted by My Nametags found UK parents are the strictest in Europe – with respect deemed the most important trait for children to have.\n\nDanielle, a health and social care lecturer in a further education college, said she believes her firm parenting style has made her children respectful.\n\nBut while she is often complimented on their behaviour, she does come in for criticism from some mums and dads.\n\n'I have had many comments regarding my parenting styles, but luckily I am very thick-skinned!' she told FEMAIL.\n\n'Comments have included, \"Why can't you just let it go?\" I have been accused of not letting \"kids be kids\", and people have told me that my children will grow up hating or resenting me for being strict.\n\nDanielle, a health and social care lecturer in a further education college, said she believes her firm parenting style has made her children respectful. Pictured with husband Jamie and Jody and Jade\n\n'The worst thing that someone once said was that the children were sad because I was strict on them. This is totally untrue.\n\n'My children are the happiest, most loving children and I am so proud of them now and for the people they are becoming.\n\n'I think the fact that I have so many rules for their age is probably the most controversial part of my parenting, but I remain firm that they are needed and are beneficial to them.\n\n'The fact that I am so routine is probably another questionable part of parenting. I am fully aware that children need to be spontaneous and free spirited, but when you work full-time, have two small children to raise and a house to maintain, rules are a must.'\n\nDuring term time the children aren't allowed to have their friends over to the house on school nights as it 'causes too much disruption'.\n\nDanielle says her children are the 'happiest, most loving children' and she is 'so proud of them now and for the people they are becoming'\n\n'The routine is dramatically impacted,' Danielle explained. 'However, if there are children out playing in the street, I will allow them to go out and then be called in for dinner.\n\n'As my husband and I work full time, we want to spend as much time with the children as possible so having other children around the house would affect this.'\n\nWhile she is happy for interaction with their friends on weekends, Danielle admitted she is 'very strict' on who comes to their home.\n\n'I am very house proud and respect that my husband worked hard to build our house to what it is now,' she said.\n\n'There have been instances where the children have had certain friends around to play and they have destroyed my house and broken the children's toys and the parent has not stepped in at all.\n\nAs Danielle and Jamie work full time, the couple want to spend as much time with the children as possible - so having other children around the house would affect this\n\n'This is always very difficult for me as, if I have other children in the house, they are required to follow the same rules as my own. My house, my rules!\n\n'Some parents have found this difficult as they do not discipline their own children so feel that I shouldn't do it either.'\n\nWhen it comes to meal times, Danielle insists that all food is eaten at the kitchen table - and she refuses to cook separate meals based on preference.\n\n'If it's not liked, it's hungry tummies!' she explained. 'Each meal must contain at least one portion of fruit or vegetables and they cannot be left.\n\n'I try my best to embed vegetables within the food so they are eating more than the recommended daily amount. I limit the amount of sauces and condiments as I worry about the amount of hidden salt and sugar.\n\n'Both children take a packed lunch to school so I can monitor what they have eaten.'\n\nWhen it comes to meal times, Danielle insists that all food is eaten at the kitchen table - and she refuses to cook separate meals based on preference\n\nShe added that the children know they cannot leave the table until they are finished and must attempt to eat all the vegetables on the plate.\n\n'The only drink they can have is water or sugar free squash,' she said. 'I have never given my children anything fizzy and will avoid giving them anything with added sugar.'\n\nDanielle is equally strict with her bedtime routine, which took her 'months to perfect' and sees them tucked up by 7:45pm and asleep by 8pm.\n\nShe explained that her strict parenting style is born out of her desire to give her children the 'best possible start' in life - and she doesn't believe her rules and structured routine inhibits fun.\n\n'I am a strict parent because of what I expect from my children,' she reasoned. 'I am a very structured and controlled person and I set myself very high targets, so I believe that my children should grow up in a disciplined and regulated environment.\n\nDanielle, pictured with Jade and Jamie, is equally strict with her bedtime routine, which took her 'months to perfect' and sees them tucked up by 7:45pm and asleep by 8pm\n\n'I obviously allow my children to be children, however I do not tolerate any rudeness, poor behaviour or bad manners.\n\n'Naturally, there are times when they present this type of behaviour - they are children - but I cannot sit back and allow it. I would hate for their behaviour or poor choices to influence what they could or could not do or achieve.'\n\nDanielle told how her own parents were strict but not 'unreasonable'; she knew if she broke rules, 'there would be consequences'.\n\nShe grew up in a pub where she was allowed to stay up late and join in with adult conversations, but knew from an early age she had chores to do and missed out on weekends away due to the constraints of the family business.\n\nAfter her parents' divorce she lived with her father and lead a 'very independent' life, but never went too far when it came to pushing boundaries.\n\nDanielle told how her own parents were strict but not 'unreasonable'; she knew if she broke rules, 'there would be consequences'. Pictured with husband Jamie\n\n'I feel that I would be doing my children a disservice if I did not instil rules,' said Danielle.\n\n'Both my children understand that my husband and I work hard for our money, which pays for the house and their toys and days out, and that if they are disrespectful to their belongings, they will be reprimanded.'\n\nDanielle said her children have some understanding of the value of money and earn their keep by helping out around the house.\n\n'Due to their age, the jobs are minimal but they still are able to understand that they are contributing to the upkeep of the house,' she explained.\n\n'Jobs for my son include helping to tidy the toys in the garden, keeping his room tidy, and he loves hoovering!\n\n'Jade helps me sort the washing into the correct piles, she keeps her toys in their boxes and helps me to dust the furniture.'\n\nDanielle said her children have some understanding of the value of money and earn their keep by helping out around the house\n\nIf the children step out of line, Danielle does not smack them as she believes there are more effective ways to discipline them.\n\nThese include the 'thinking step' - five minutes for Jody and three for Jade - and a 'count to three' for them to do what she asks.\n\nIf they're naughty, Danielle often takes their toys off them and puts them on top of the fridge where they can't reach them - and it's up to them to prove they deserve to get them back.\n\nDanielle also uses a penny stack method, where they start off with an equal amount of coins and, if they show good behaviour, a penny is moved to the 'good section'.\n\nIf they make poor choices, a penny is taken away. At the end of the day the children are taken to the shop to spend their money on a treat.\n\nDanielle added: 'One of the most effective things is to ask the child to think about what they have done and ask if they think it was a good or bad decision. This allows them to reflect and make their own decision.'\n\nTo instil good discipline, Danielle also uses a penny stack method, where the children start off with an equal amount of coins and, if they show good behaviour, a penny is moved to the 'good section'\n\nDanielle strongly encourages her children to read, write and colour in every night as it triggers their imagination and improves their literacy skills.\n\n'During the summer holidays, I complied files for each of the children to keep up to date with reading and writing and they loved them!' she said.\n\n'Each book came along with stickers as rewards so they were in competition with each other to see who could progress through their books the quickest and achieve a sticker.'\n\nShe also urges them to do as much physical activity as possible, as she believes team-based sports build confidence and vital interpersonal skills.\n\nAs a family they regularly go on long bike rides, walks and swimming - with Danielle keen to embed education in all their activities.\n\n'As a teacher, I hate to miss an opportunity for learning!' she said.\n\nDanielle strongly encourages her children to read, write and colour in every night as it triggers their imagination and improves their literacy skills\n\nAccording to Danielle, children in the UK are 'lacking in discipline', and in her 10 years of teaching she has noticed a 'dramatic change' in the behaviour of the students coming to her.\n\n'The main problem is that as there has been no discipline at home, the children have never had structure or consequences for inappropriate or poor choices,' she explained.\n\n'We rely on the support of the parents if we are experiencing issues with a young person, but if they do not agree with our values, we are not able to progress.\n\nTop five European countries with strictest parents 1. Britain 2. Ireland 3. France 4. Netherlands 5. Portugal\n\n'So many times I have said to a student that I will be ringing home to speak to parents and the response has been, \"Mum won't care, I can do what I want. She won't believe you, she'll take my side and believe me\".\n\n'Embedding discipline into daily routine is a tried and tested method of achieving results. It concerns me that so many people take a negative stance to this and feel that if you do it, you are denying children a childhood.\n\n'I think that people need to consider a more long term approach as, if you instil the values at a young age, the children grow up knowing and understanding what they are and why they are important.\n\n'If I had a more relaxed style of parenting which did not focus on rules and discipline, my children would not be the people they are today. They thrive on routine and love that I always have things for them to do.'\n\nSpeaking about the research which found Brits are the strictest parents in Europe, Lars B. Andersen, founder and managing director at My Nametags, said: 'Every parent will have a different set of values and style of parenting to the next, there isn't a \"one size fits all\" approach, but it is interesting to see the part nationality plays in these attitudes.'", "description": "EXCLUSIVE: Danielle Hannah Alexander, 32, from Monmouth, South Wales, is mum to five-year-old son Jody and daughter Jade, three, with her husband Jamie, a builder.", "authors": ["Hayley Richardson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/19/20096328-0-image-a-60_1571853950000.jpg", "published_at": "2019-10-24"}