{"pub": "fox", "url": "https://foxnews.com/media/erdogan-turkey-denies-firing-american-troops-northern-syria", "downloaded_at": "2019-10-13 00:22:08.085244+00:00", "title": "Erdogan senior adviser denies Turkey fired at American troops in northern Syria", "language": "en", "text": "A senior adviser to Turkish President Recep Tayyip Erdogan told Fox News on Saturday that Turkey didn't fire on American soldiers in northern Syria days after launching an offensive, contrary to what the Pentagon stated Friday.\n\n\"That's another lie,\" Gulnur Aybet told Fox News' Leland Vittert.\n\n\"We did not fire on American soldiers. [...] That was a lie that was spun by the YPG,\" she said, referring to the largely Kurdish militia that forms the bulk of the U.S.-backed Syrian Democratic forces.\n\nTRUMP PULLS BACK TROOPS FROM NORTHERN SYRIA AHEAD OF TURKISH ASSAULT, PENTAGON OFFICIALS 'BLINDSIDED'\n\nThe Pentagon said Friday that U.S. troops near the border town of Kobane in northern Syria came under artillery fire from Turkish positions. The area where the explosion occurred is an area known by the Turks to have U.S. forces present there, according to the Pentagon. No American troops were injured.\n\nAybet firmly denied that Turkey fired on U.S. troops. She claimed Turkey was \"returning fire that was fired at our territory by the terrorists of that region. We were very careful not to fire on the American observation post there.\"\n\nPresident Trump announced Sunday that the U.S. would pull all troops from northeast Syria, clearing the way for a Turkish air and ground offensive. Erdogan's troops launched an assault on Wednesday and ground forces invaded later that day.\n\nErodgan's adviser told Vittert that Turkey is \"very disappointed [the U.S. is] still working with the YPG.\"\n\nTURKEY'S SYRIA INVASION: MEMBER OF US SPECIAL FORCES SAYS, 'I AM ASHAMED FOR THE FIRST TIME IN MY CAREER'\n\nTurkey views the United States' support of the Kurds and YPG as \"an ill-conceived policy to arm one terrorist group to fight another,\" Aybet said. Turkey considers the YPG equivalent to the PKK, or Kurdistan Workers' Party -- a Kurdish far-left political group that is listed as a terrorist organization by the U.S.\n\n\"I think President Trump is absolutely right in wanting to bring home U.S. troops,\" Aybet told Vittert. \"I think it's very unfair they're hostage to this ill-begotten policy [of] arming one terrorist group to fighter another,\" referring to the Islamic State (ISIS) in the region. The Kurds have detained thousands of ISIS prisoners in the area. After Turkey launched its military operation, many analysts questioned what would happen to the terrorist fighters, and whether the Kurds would be able to keep them emprisoned or they would be released.\n\nTRUMP CALLS TURKEY ASSAULT ON SYRIA A 'BAD IDEA' AS KURDS REPORT CIVILIAN DEATHS\n\nAccording to Aybet, Turkey has two objectives in northeast Syria: clear the YPG from the border region and ensuring the return of between one and two million Syrian refugees.\n\nAccording to the war-monitoring group the Syrian Observatory for Human Rights, 74 Kurdish fighters have been killed since Wednesday, as well as 21 civilians and 49 Turkish-backed Syrian opposition fighters.\n\nFox News' Lucas Tomlinson and Robert Gearty contributed to this report.\n\nCLICK HERE TO GET THE FOX NEWS APP", "description": "A senior adviser to Turkish President Recep Tayyip Erdogan told Fox News on Saturday that Turkey didn't fire on American soldiers in northern Syria days after launching an offensive.", "authors": ["Melissa Leon", "Melissa Leon Is A Reporter For Foxnews.Com. She Can Be Found On Twitter"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/12/694940094001_6094386640001_6094381183001-vs.jpg", "published_at": "2019-10-12"}