{"pub": "reuters", "url": "https://in.reuters.com/article/uk-mideast-crisis-baghdadi-oil/trump-suggestion-of-taking-syrian-oil-draws-rebukes-idINKBN1X60RI", "downloaded_at": "2019-10-28 00:33:11.401227+00:00", "title": "Trump suggestion of taking Syrian oil draws rebukes", "language": "en", "text": "(Reuters) - U.S. President Donald Trump’s suggestion on Sunday that Exxon Mobil or another U.S. oil company operate Syrian oil fields drew rebukes from legal and energy experts.\n\nFILE PHOTO: An airplane comes in for a landing above an Exxon sign at a gas station in the Chicago suburb of Norridge, Illinois, U.S., October 27, 2016. REUTERS/Jim Young/File Photo\n\n“What I intend to do, perhaps, is make a deal with an ExxonMobil or one of our great companies to go in there and do it properly ... and spread out the wealth,” Trump said during a news conference about the U.S. special forces operation that led to the death of Islamic State leader Abu Bakr al-Baghdadi.\n\nExxon Mobil Corp (XOM.N) and Chevron Corp (CVX.N), the two largest U.S. oil companies operating in the Middle East, declined to comment on his remarks.\n\n“International law seeks to protect against exactly this sort of exploitation,” said Laurie Blank, an Emory Law School professor and director of its Center for International and Comparative Law.\n\n“It is not only a dubious legal move, it sends a message to the whole region and the world that America wants to steal the oil,” said Bruce Riedel, a former national security advisor and now senior fellow at the Brookings Institution think-tank.\n\n“The idea that the United States would ‘keep the oil’ in the hands of ExxonMobil or some other U.S. company is immoral and possibly illegal,” said Jeff Colgan, an associate professor of political science and international studies at Brown University. Colgan also said U.S. companies would face “a host of practical challenges” to operate in Syria.\n\nEven getting Exxon or another major oil company to develop Syrian oil would be a “hard sell” given its relatively limited infrastructure and small output, said Ellen R. Wald, a senior fellow at the Atlantic Council’s Global Energy Center.\n\nSyria produced around 380,000 barrels of oil per day before the country’s civil war erupted. An International Monetary Fund working paper in 2016 estimated that production had declined to just 40,000 barrels per day.\n\nStill, the United States should be concerned about the fate of the Syrian oil fields, said Alex Cranberg, chairman of energy firm Aspect Holdings LLC, which has explored production in Iraqi Kurdistan but no longer has active projects in the region.\n\n“It’s not that the oil itself matters much to the U.S., but that its misuse could fund future problems for us” if it falls into the wrong hands, Cranberg said, noting his company has not been approached by the White House.\n\n“U.S. control over the disposition of the fields and the hard currency they offer would provide a significant influence over the shape of Syria’s future,” he said.\n\nRobert O’Brien, a U.S. National Security advisor to the president, said a U.S. military presence will be required to protect the Syrian oilfields, suggesting it also should have a say on their proceeds.\n\n“We’re going to be there for a period of time to maintain control of those and make sure that there is not a resurgence of ISIS and make sure that the Kurds have some revenue from those oil fields,” O’Brien said, speaking to NBC News’ Meet the Press with Chuck Todd.", "description": "U.S. President Donald Trump's suggestion on Sunday that Exxon Mobil or another U.S. oil company operate Syrian oil fields drew rebukes from legal and energy experts.", "authors": ["Lawrence Delevingne", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191027&t=2&i=1445619752&w=1200&r=LYNXMPEF9Q0T6", "published_at": "2019-10-27"}