{"pub": "afr", "url": "https://afr.com/politics/federal/anu-cyber-attack-began-with-email-to-senior-staff-member-20191001-p52wpv", "downloaded_at": "2019-10-05 05:56:08.925833+00:00", "title": "ANU cyber attack began with email to senior staff member", "language": "en", "text": "\"It's data I don't think any us would want to be shared but it's not super private,\" Professor Schmidt said.\n\nInvestigators estimate a team of five to 15 hackers worked round the clock and tried repeatedly to access the university's Enterprise Systems Domain, which houses human resources, financial management and student administration data.\n\nThey first successfully breached the system on November 9 last year by sending a spearphishing email to a senior member of the university's staff. While such tactics often require the recipient to click on a link or download an attachment to be compromised, the hack only required the email to be previewed for the credentials to be stolen.\n\nWithin days, the hackers were able to take control of a webserver and then a \"legacy server\" that was about to be decommissioned which gave access to the entire ANU network.\n\nHowever, on November 30 the attackers were kicked out of the system when a new firewall was installed, but they managed to work their way back in almost a fortnight later.\n\nANU staff detected a fresh spearphishing attempt on December 21, which alerted them to the breach and they regained control of the system, although they thought it had been a one-off attack.\n\nThe hackers continued to try for several months after to re-enter the system.\n\nBut it was only in April when ANU's information technology staff realised the breach had been much bigger when they conducted a routine baseline threat scan.\n\nAdvertisement\n\nThey kept quiet for a few weeks while they investigated and cleaned up the system before going public in June.\n\nThe data the hackers had access to included names, addresses, phone numbers, birth dates, emergency contact details, tax file numbers, payroll information, bank account details and raw student academic records.\n\nThey did not have access to CVs or sensitive information such as health records, counselling or academic misconduct.\n\nThe hackers also ignored intellectual property and research data despite seeing it on the system, with investigators concluding they were just focused on the database.\n\nWhile the motive is unclear, the focus on obtaining personal information is consistent with identity theft but there have been no cases of fraud emerging where this data has been misused. ANU investigators have also scoured so-called \"dark web\" sites for any traces of it.\n\nPart of the difficulty in attributing blame for the attack is the hackers meticulously covered their tracks by removing traces of malware during their time in the ANU system. Investigators said this was a much more sophisticated operation than an attempted hack on ANU's systems disclosed in July last year.\n\n“This wasn’t a smash and grab. It was a diamond heist,” Professor Schmidt said.\n\nHe said. the university had beefed up its cyber security and was going public to be upfront with staff, students and alumni.\n\n\"Rather than hide in shame, we need to confront the reality data was taken, we need to be transparent and we need to make sure breaches like this don't happen again in the future,\" he said.", "description": "Staff, students' and graduates' private information was stolen in a cyber attack on one of Australia's most prestigious institutions.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_3.3111%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/20e8f167d92f49194dc020cee70bc1f6c3871de6", "published_at": "2019-10-01"}