{"pub": "metro", "url": "https://metro.co.uk/2019/10/11/juan-mata-loves-anthony-martial-says-injured-manchester-united-star-incredible-career-ahead-10900784", "downloaded_at": "2019-10-11 13:00:07.052798+00:00", "title": "Juan Mata sends message to injured Manchester United star Anthony Martial", "language": "en", "text": "Juan Mata has sent a message to injured Man Utd star Anthony Martial (Picture: Getty)\n\nJuan Mata ‘loves’ Anthony Martial and says the injured Manchester United star has an ‘incredible’ career ahead of him.\n\nFrench forward Martial scored two goals in his first two appearances for the Red Devils this season but has not been seen since August after suffering an injury.\n\nMuch was expected of Martial when he signed for Manchester United in 2015 to become the most expensive teenager in history.\n\nBut his career at Old Trafford so far has been underwhelming, with the former Lyon star scoring only 36 goals in 116 Premier League appearances.\n\nMata insists he ‘loves’ playing alongside Martial (Picture: Getty)\n\nStill, at the age of 23, there is time to turn things around at Manchester United and his Red Devils team-mate Mata says he can have an ‘incredible career’.\n\n‘I hope it’s really big. He is an incredibly talented player,’ Mata told Sky Sports.\n\nAdvertisement\n\nAdvertisement\n\n‘You can see that since the moment he arrived to the club in his first game against Liverpool.\n\n‘In every training session, the way he treats the ball, the way he takes on people, the way he can win a game by himself.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\n‘I love this kind of player with such big talent and I love to play with them.\n\n‘He is a very, very good player. He is still young and hopefully he has an incredible career ahead of him.’\n\nMartial’s absence has coincided with a disastrous run at Old Trafford, with Manchester United winning just one of their last six league games to drop to 12th in the Premier League table.\n\nFollowing the international break, Ole Gunnar Solskjaer’s struggling side face Premier League leaders Liverpool.\n\nMORE: Arsenal and Emery handed Alexandre Lacazette injury boost", "description": "Juan Mata 'loves' Anthony Martial and says the injured Manchester United star has an 'incredible' career ahead of him. French forward Martial scored two goals in his first two appearances...", "authors": ["Metro Sport Reporter"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1162756849_1570788426.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-11"}