{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Culture/video/hillary-chelsea-clinton-talk-book-gutsy-women-65972807", "downloaded_at": "2019-10-01 15:22:23.387317+00:00", "title": "Hillary and Chelsea Clinton talk the 'The Book of Gutsy Women' Video", "language": "en", "text": "Transcript for Hillary and Chelsea Clinton talk the 'The Book of Gutsy Women'\n\nWe are back now with former democratic presidential nominee, secretary of state, senator and first lady, Hillary Rodham Clinton and her daughter, author and activist Chelsea Clinton, the two have co-authored a new book called \"The book of gutsy women\" highlighting women who inspired them throughout their lives. Welcome. Thank you for being with us. Thank you so much, Amy. We're going to be talking about the book in just a moment but we need to ask you about a couple of big headlines that have been in the news cycle here. First the launch of the impeachment inquiry into president trump, of course. You witnessed firsthand two impeachments, one as part of the house judiciary staff and as first lady. I know you've said that you support impeachment but do you have concerns that the Democrats may be overreaching on this? We don't have concerns about that because I think the evidence concerning Ukraine is so dramatic and irrefutable because it came right out of the white house. So let the impeachment inquiry proceed. I know that they will do a thoughtful, thorough job. Nobody should jump to any What do you think about president trump calling for the accuser, for the whistle-blower to be outed? I think that's really dangerous. From everything we know and we don't know much, this is an experienced person who saw things that bothered him. That's what the whole whistle-blower statute is for and it is to protect their identity and I understand he's going to testify and we'll let the process unfold. How do you see it affecting the 2020 election. I don't know yet but I think there was no choice. Speaker Pelosi was reluctant as we all know, but what I hope the Democrats will do is not only proceed in a very deliberative way on the impeachment inquiry but tell the American people what they've accomplished. They passed legislation on gun safety, improving health, lowering prescription drug costs, doing so many things that the American people really want and need and it goes to the senate and dies, so I think the Democrats have to go on two tracks here but they will do Your emails in the headlines once again with -- Can you believe that? Here we go again. The administration is investigating dozens of current and former state department officials for what they sent have you personally been questioned about this. No, and, look, I think it's an unfortunate diversion. You go and you talk to people who have been experienced diplomats for many years and then you retroactively classify what they said ten years ago, I think it's really a shame that they're doing that and hopefully people will not be distracted. Well, here's today's headline. Your book is out. \"The book of gutsy women\" that you co-authored with your daughter and highlighted over 100 women. How did you pick which women? We've been talking about women who inspire us our whole lives together. I mean so many of my earliest memories are my mother talking about women who inspired her. Some fictional like Nancy drew and some very real like Shirley Chisholm and Geraldine Ferraro so in many ways it's a continuation of that conversation we started more than 30 years ago. I really want to highlight one of the women in the book today because you do such a great job here on \"Good morning America\" highlighting breast cancer awareness month and Betty Ford, the former first lady is in there because when I was a young girl, my mother's best friend who lived across the street got breast cancer, nobody would talk about it, Amy. Nobody would say the words breast cancer. Nobody and so I knew my mother was going over every afternoon to spend time with her. She eventually passed aw and it was not until Betty Ford courageously with a lot of guts not only had her mastectomy but had herself photographed in the hospital room with her husband then president Ford by her side and went on to talk about it and I think -- I really believe saved so many lives. Oh, without a doubt. I mean, we have to talk about it. Awareness is key. Absolutely. To prevention and hopefully eventually treatment. I have to ask, I mean you guys look like you have an amazing what was it like though to work on a book with your mom? You've each written six book, correct? Oh, goodness. Oh, so much fun. It was just such a joy. We laughed a lot. We laugh a lot as you can tell. And it's just so much fun to continue to learn about my mom and to learn with her and to have created something together. Okay, true confessions. I really frustrated by daughter because I write in longhand and I always have when it comes to something long. For memos and notes and obviously other -- if wow, there's an example right there that Chelsea had to decipher and then -- I did. She would take pick you are toos, Amy and then send me to prove she had made progress. I love it. But only excuse I have is that Barack Obama also writes in longhand so I'm in very good company. Can I ask what's the gutsiest thing you've ever done? Oh, boy, I think the gutsiest thing personally make the decision to stay in my marriage. Publicly, politically run for president. And keep going. Just get up every day and keep going. I love it. Chelsea, how about you ask. Oh, goodness, I think I'm so overwhelmed by my mother's answer that I'm a bit out of words. And I'm just so proud to be her daughter. But my most important entity is now as my three kids' mom so I'll just try to be gutsy every day, Amy. Thank you both so much. You can make your follow-up appointment from...\n\nThis transcript has been automatically generated and may not be 100% accurate.", "description": "The former first lady's and first daughter's new book focuses on stories about courageous and resilient women who inspired them.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/191001_gma_clintons_hpMain_16x9_992.jpg", "published_at": "2019-10-01"}