{"pub": "cbc", "url": "https://cbc.ca/news/canada/british-columbia/police-warning-high-risk-sex-offender-vancouver-1.5321283", "downloaded_at": "2019-10-15 23:06:01.375203+00:00", "title": "Police issue warning about high-risk sex offender planning to live in Vancouver | CBC News", "language": "en", "text": "Vancouver police have issued a public warning about a high-risk sex offender who plans to live in Vancouver after his latest release from jail.\n\nTrevor Leonard Smith, 46, poses a high risk of relationship and sexual violence, particularly against children, according to the Vancouver Police Department and the Correctional Service of Canada.\n\nSmith was previously convicted of sexual assault, possession of child pornography, accessing child pornography, assault causing bodily harm, and failure of comply with a court order.\n\nHe is described as white, five feet 10 inches tall, weighing 170 pounds, with grey hair and blue eyes. He also uses the surnames Landry and Williams.\n\nSmith was the subject of public warnings in both 2015 and 2017. His most recent release comes with strict conditions, including:\n\nKeep the peace and be of good behaviour;\n\nReport to a probation officer;\n\nReside at a place approved by a probation officer;\n\nRemain in British Columbia;\n\nAdvise a probation officer of relationships and friendships with females;\n\nNot to consume or possess any controlled substances;\n\nNo contact, directly or indirectly, with anyone under 16 years old;\n\nNot to attend any public park, school ground, recreational centre, skating rink or public swimming pool, public swimming area, community centre, playground, or any other place where a person under 16 years old is reasonable or expected to be present;\n\nNot to use or possess a computer or access the internet, except with prior permission of a probation officer;\n\nNot to possess or access any data encryption, electronic storage device, or computer software without written permission of a probation officer.\n\nAnyone who sees or knows of Smith violating any of these conditions is asked to call 911 immediately.", "description": "Trevor Leonard Smith poses a high risk of relationship and sexual violence, particularly against children, Vancouver police say.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5321339.1571156631!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/trevor-leonard-smith.jpg", "published_at": "2019-10-15"}