{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/katie-price-reveals-how-much-20552385", "downloaded_at": "2019-10-10 15:23:08.327594+00:00", "title": "Katie Price reveals how much she's changed in four years as fans beg her to stop getting surgery", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nKatie Price has never been shy about going under the knife, and now the former glamour model has revealed how much she's changed in the last few years.\n\nShe took to Instagram on Thursday afternoon to compare her face from 2015 to the one she's got now.\n\nThe mum-of-five held up a copy of her most recent autobiography Reborn to show off her ever-changing looks.\n\nIn the snap Katie, 41, pouted and pushed back her hair to display her incredibly smooth skin that didn't have a single line.\n\nAlongside two laughing emojis, she said: \"Comparing my face from 2015.\"\n\n(Image: officialkatieprice/Instagram)\n\nHer Instagram followers were shocked by the image, as many begged her to stop getting so much surgery.\n\nOne commented: \"Naturally beautiful - you DON’T need anymore surgery!\"\n\n\"Enough with the surgery, try it,\" another posted.\n\nA third said: \"Don’t get anymore surgery you look fine.\"\n\n(Image: WENN)\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nAnother agreed: \"Don’t do any more please Katie listen to your mum for once ! Lol.\"\n\nIn August Katie travelled to Turkey for her latest surgery spree.\n\nThis included a face lift, butt enhancement, boob reduction and eye lift.\n\nPals have recently warned that Katie is getting dangerously close to going too far in her quest for perfection, amid reports her children cried after seeing her previous surgical results in April.\n\n(Image: Instagram)\n\nBut Katie has refused to give up, telling We Love TV magazine: \"I love seeing results after surgery and I will always want to change something else.\n\n\"Doesn't everyone? I love it!\"\n\nAnd she laughed off suggestions she'd ever stop having plastic procedures, adding: \"I am trying my best to enjoy being the best version of myself. I just always want to be perfect.\"", "description": "The mum-of-five, 41, held up a copy of her most recent autobiography Reborn to show off her ever-changing looks", "authors": ["Molly Pike", "Image", "Officialkatieprice Instagram", "Wenn", "Instagram"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20552427.ece/ALTERNATES/s1200/0_KP.jpg", "published_at": "2019-10-10"}