{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKBN1X600H-OCASP", "downloaded_at": "2019-10-27 04:01:58.909563+00:00", "title": "Figure skating: Russia's Trusova dominates in Skate Canada win", "language": "en", "text": "Oct 26, 2019; Kelowna, British Columbia, CAN; Rika Kihira (JPN) and Alexandra Trusova (RUS) and Young You (KOR) standing on the podium in the ladies medals ceremony during the Skate Canada International figure skating competition at Prospera Place. Mandatory Credit: Dom Gagne-USA TODAY Sports\n\n(Reuters) - An inspired Alexandra Trusova of Russia landed three quadruple jumps as the Russian teenager won Skate Canada’ ladies program in British Columbia on Saturday.\n\nThe 15-year-old, despite falling on her first of four quadruple attempts, scored a world-leading 241.02 points in her senior International Skating Union (ISU) Grand Prix debut.\n\nA massive 166.62 points in Saturday’s free skate, another best, vaulted the twice world junior champion to the championship.\n\nTrusova had been only third after Friday’s short program but dominated Saturday’s competition.\n\nJapan’s Rika Kihira, the short program leader, finished second with 230.33 points and South Korean You Young joined them on the podium with 217.49 points.\n\nPiper Gilles and Paul Poirier gave Canadians their own reason to cheer when they overcame two-time world medalists Madison Hubbell and Zachary Donohue of the United States to win the ice dance competition.\n\nGilles and Poirier, second after Friday’s rhythm dance, surged to the top in Saturday’s free dance to claim their first International Skating Union Grand Prix gold medal with 209.01 points.\n\nHubbell and Donohue took second (206.31) with Britain’s Lilah Fear and Lewis Gibson third (195.35).", "description": "An inspired Alexandra Trusova of Russia landed three quadruple jumps as the Russian teenager won Skate Canada' ladies program in British Columbia on Saturday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191027&t=2&i=1445355337&w=1200&r=LYNXMPEF9Q01I-OCASP", "published_at": "2019-10-27"}