{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/coronation-street-actor-bill-roache-20540120", "downloaded_at": "2019-10-09 10:46:00.958266+00:00", "title": "Coronation Street actor Bill Roache", "language": "en", "text": "Get the biggest soaps stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nKen Barlow might be turning 80 in tonight's Coronation Street but the man who plays the mild mannered retired teacher has led a VERY different life.\n\nActor William Roache claims he has bedded 1,000 women - and it's certainly earned him some interesting nicknames among his fellow Corrie castmates.\n\nHe says his reputation with the ladies led to him being known as C*** Roache.\n\nBut there was also a darker side to Bill's lothario ways as he admits he couldn't stop cheating on his first wife, Anna Crooper, because he couldn't control his sex drive.\n\nBill, who at 87 is older than his national treasure character, previously told the Mirror: \"Looking back, I didn’t know any better. But what I did find out is it does not bring you happiness and it is not the way to be.\n\n(Image: Sunday Mirror)\n\n“I had the opportunity, I indulged it and I can tell you this: it’s not worth it. The pain that it caused, and there’s all sorts of dangers.\n\n“To love somebody, and to make love to somebody that you love is the most beautiful thing in the world.”\n\nAnd his conquests are believed to include some very famous faces, including cobbles legend, Pat Phoenix.\n\nBut Bill insists it was just a fling.\n\nHe added: \"It was just something that happened one night when we were together. We weren’t right for each other.\n\n\"She invited me round to her flat and we had a few drinks, then one thing led to another.\n\n“At that time, she had a reputation and I had a reputation, and she felt we should meet, as it were. It just happened.”\n\nIn character, Ken has been married four times to three different women, with his relationship with Deirdre one of the most iconic in TV history.\n\nBut he admits he has regretted some of his actions in real life, especially to his first wife, Anna.\n\nBill said: \"I had the opportunity, but that doesn’t mean I should do it. I had rehearsals up in Manchester from Monday to Friday. The opportunity was there.\n\n(Image: Granada)\n\n“There were plenty of girls around. I shouldn’t have done it. I didn’t have any control over my own sex drive. I didn’t have the strength to control it.\n\n“It depressed me. I’m so sorry for the things that I did. The hurt was the children. I’ll always regret that. Every morning I woke up regretting and hurting.”\n\nTragically, Bill's second wife, Sara, died in her sleep in 2009.\n\nBut the family had been hit by earlier tragedy when their daughter, Edwina, died of pneumonia in 1984 when she was just 18 months old.\n\nBill said: \"Edwina had a bad cold. My parents-in-law were babysitting. When we got back, Sara checked on Edwina and she was fine.\n\n(Image: PA)\n\n(Image: ITV)\n\n“We then made a cup of tea and then about 45 minutes later Sara went to check on her again and she was gone, she had died. I felt so guilty, you’re supposed to look after your children.\n\n“It was an unbelievable shock. I knew the funeral was coming up and I knew I’d have to carry the coffin and didn’t know how I would get through it.\n\n“On the actual morning of her funeral I woke up and I saw a bright ball of golden light and Edwina’s face was in the middle of it smiling, and with it came a wonderful feeling of peace. So she’s OK.\n\n“We can look back with joy at the 18 months we had with her. I know for a fact that young children who have died and are calling for their mothers, and she now is a nurse helping them. I know that, I don’t believe it. I know it.”\n\nBill stresses he had stopped womanising when he met Sara, claiming he was \"fed up with it\".\n\nHe added: \"She knew exactly what I was like in the past, but she knew I’d changed. We were so happy together and Edwina’s death actually brought us closer.\n\n“We grieved for some time, then we got to the point that we could talk about her and the actual strength in our relationship because we talked the whole time. The letters that we got were amazing.”\n\nEven though the couple were left reeling following their daughter's death the tragedy did bring them closer together.\n\nAfter Sara's death, Bill was in a relationship woth weather girl Emma Jesson, but the couple split up in 2013.\n\nTragically, his eldest daughter, Vanya, died from liver failure last year.", "description": "The Weatherfield legend has admitted he cheated on his first wife because of his huge sex drive", "authors": ["Mark Jefferies", "Jane Lavender", "Image", "Sunday Mirror", "Granada", "Pa", "Itv"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article12690470.ece/ALTERNATES/s1200/PROD-Interview-with-Coronation-Street-actor-William-Roache1.jpg", "published_at": "2019-10-09"}