{"pub": "reuters", "url": "https://reuters.com/article/us-usa-iran-cyber/iran-checks-cyber-security-at-key-energy-sites-eyes-u-s-threat-idUSKBN1WB23W", "downloaded_at": "2019-09-26 16:53:24.650615+00:00", "title": "Iran checks cyber security at key energy sites, eyes U.S. threat", "language": "en", "text": "DUBAI (Reuters) - Iran has launched an inspection of security at its key Gulf oil and gas facilities, including preparedness for cyber attacks, the Oil Ministry news agency SHANA said, following media reports of Washington weighing possible cyber attacks on Tehran.\n\nU.S. media reports have said the United States is considering possible cyber attacks against Iran after the Sept. 14 attacks on Saudi oil sites which U.S. officials have blamed on Tehran. The Islamic republic has denied being behind the raids which were claimed by Yemen’s Iran-aligned Houthi group.\n\nPirouz Mousavi, head of the Pars Special Economic Energy Zone (PSEEZ), inspected the area and met senior managers, including those in charge of cyber security and emergency response, SHANA said on Wednesday.\n\nThe PSEEZ was set up in 1998 to develop the oil and gas resources in the South Pars field, the world’s largest natural gas reservoir. The offshore field is shared between Iran and Qatar, which calls it North Field.\n\nSeparately, Gholamreza Jalali, head of civil defense which is in charge of cyber security, called for beefing up security at industrial installations and said: “Our enemies consider the cyber domain as one of the main areas of threat against nations, especially Iran,” the semi-official news agency Fars reported.\n\nAfter reports on social media last Friday of a cyber attack on some petrochemical and other companies in Iran, a state body in charge of cyber security denied there had been a successful attack.\n\nNetBlocks, an organization that monitors internet connectivity, earlier reported “intermittent disruptions” to some internet services in Iran.\n\nIran said in June U.S. cyber attacks against Iranian targets had not been successful, after reports the Pentagon had launched a cyber attack to disable the country’s rocket launch systems following the downing of a U.S. military drone.\n\nIran has long been on alert over the threat of cyber attacks by foreign countries. The United States and Israel covertly sabotaged Iran’s nuclear program in 2009 and 2010 with the now-famous Stuxnet computer virus, which destroyed Iranian centrifuges that were enriching uranium.", "description": "Iran has launched an inspection of security at its key Gulf oil and gas facilities, including preparedness for cyber attacks, the Oil Ministry news agency SHANA said, following media reports of Washington weighing possible cyber attacks on Tehran.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-26"}