{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/29/WS5db79ab8a310cf3e35574228.html", "downloaded_at": "2019-10-29 06:12:27.063736+00:00", "title": "'Alternative' tactic ensures Trudeau win", "language": "en", "text": "By Heng Weili in New York and Rena Li in Toronto | China Daily Global | Updated: 2019-10-29 09:49\n\nLiberal leader and Canadian Prime Minister Justin Trudeau and his wife Sophie Gregoire Trudeau wave to supporters after the federal election at the Palais des Congres in Montreal, Quebec, Canada, October 22, 2019. [Photo/Agencies]\n\nJustin Trudeau may have secured his second term as Canadian prime minister because he abandoned a \"sunny\" political approach for a sterner one that warned against a Conservative victory.\n\n\"When Trudeau's operatives portrayed his rival (Andrew) Scheer as Trump 2.0 poised to destroy all that was good about Canada, it was enough to get him reelected,\" said the UK's Independent newspaper.\n\nTrudeau rose to popularity in 2015 after vowing progressive reforms.\n\nBut he sometimes digressed from those principles - he supported the Trans Mountain Pipeline System, a pipeline that carries crude and refined oil from Alberta province to the coast of British Columbia - which didn't sit well with environmentalists. His promise of federal electoral reform also was not kept, which displeased some on the left.\n\nIn Monday's vote, Trudeau's Liberal Party won 157 seats, 13 short of the 170 needed for a majority in the 338-seat House of Commons. That means it will need the help of at least one of the opposition parties - most likely the New Democratic Party.\n\nPerhaps after surviving a tighter election and a recent scandal in which he appeared in blackface on numerous occasions at past parties, Trudeau is looking to broaden his support nationally.\n\nThe scandal was particularly bruising to a prime minister seen by some as lecturing Canadians to be more progressive.\n\n\"Canadians gave me a lot to think about on Monday night when they returned us to government but with a requirement to work with other parties,\" Trudeau said Wednesday in Ottawa in his first post-election news conference. \"I am going to take the time necessary to really reflect on how best to serve Canadians and work with the other parties.\n\n\"We made the decision to move forward on the Trans Mountain pipeline expansion because it was in Canada's interest to do so,\" Trudeau said, adding he has already begun to reach out to leaders in Alberta and Saskatchewan provinces.\n\nDavid Brodie, senior vice-president and general manager at Citizen Relations, a global public relations firm, said that because the Liberals did not win a single seat in Alberta or Saskatchewan, one of Trudeau's first challenges will be how to ensure those regions are represented in the next cabinet.\n\n\"It's a weakened government that will have to rely much more on cooperation with other parties and will need to be very focused on maintaining unity within the government caucus,\" Brodie said.\n\n\"Given they are in a minority, I would expect Trudeau to be much more focused on domestic issues and spend more time in the House of Commons, as they will need every vote they have to pass government legislation,\" Brodie added.\n\nTrudeau said Wednesday that \"the very first thing we will do... will be putting forward a bill to lower taxes for the middle class\", and said he expected other progressive parties to support the measure.\n\nThe 47-year-old prime minister said he would present his new cabinet on Nov 20, but he did not say when he might convene parliament. He would not seek a \"formal or informal coalition\", he said.\n\nDuring a bruising campaign, Trudeau adopted a late change in tactics, warning progressive voters who showed signs of abandoning the Liberal Party, four Liberal campaign sources said.\n\nAs polls indicated he could lose, Trudeau ditched his \"sunny ways\" persona that had swept him to power in 2015 and started chipping away at three smaller parties on the left, warning their supporters that if they didn't vote Liberal, the progressive vote would splinter and allow the Conservatives to gain power.\n\n\"The 40-day campaign was a daily stream of insults, slurs, lies and explosive revelations about Trudeau and his Conservative rival Andrew Scheer,\" the Independent wrote. \"Canada's 43rd election was the nastiest in memory, aided and abetted by social media. The vote saw east versus west, French versus English, urban versus rural, old versus new.\"\n\nDuring the last two weeks of the campaign, Trudeau repeatedly told supporters that voting for the rival New Democrats, Bloc Quebecois and Greens would result in a progressive opposition, not a progressive government.\n\nTrudeau staying as prime minister is a diminished figure, not just internally but externally in terms of the image of Canada in the world,\" Daniel Beland, a McGill University political science professor, told Canadian Broadcasting Corp.\n\n\"The Liberals like to talk progressive, but they govern conservative,\" Jagmeet Singh, leader of the New Democrats, said on Oct 15. \"I want people to dream big. Don't settle for less.\"\n\nIn the end, the Liberals chose a mixture of proposals designed to build upon advances made since 2015, while adding promises for big-ticket items such as expanding a program to provide coverage for the cost of prescription drugs.\n\nReuters contributed to this story.", "description": "Justin Trudeau may have secured his second term as Canadian prime minister because he abandoned a \"sunny\" political approach for a sterner one that warned against a Conservative victory.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/29/5db79ec6a310cf3e97a35b12.jpeg", "published_at": "2019-10-29"}