{"pub": "yahoo", "url": "https://news.yahoo.com/ex-rep-sessions-subpoenaed-giuliani-230540160.html", "downloaded_at": "2019-10-16 03:57:49.155151+00:00", "title": "Ex-Rep. Sessions subpoenaed in Giuliani grand jury probe", "language": "en", "text": "Former US Rep. Pete Sessions speak to the McLennan County Republican Party Thursday, Oct. 3, 2019, in Waco, Texas as he runs to fill the seat of Bill Flores who is stepping down (Jerry Larson/ Waco Tribune-Herald, via AP)\n\nWASHINGTON (AP) — A federal grand jury has subpoenaed former Republican Rep. Pete Sessions for information about his interactions with Rudy Giuliani and several associates who were indicted last week.\n\nThe former lawmaker from Texas is cooperating with investigators and will turn over documents in the coming weeks, said Matt Mackowiak, a spokesman for Sessions.\n\nThe subpoena is part of an ongoing investigation based in New York that includes an inquiry into the business dealings of Giuliani, according to a person familiar with the probe. The person wasn't authorized to discuss the investigation publicly and spoke on condition of anonymity.\n\nGiuliani, the former mayor of New York, is the personal attorney to President Donald Trump.\n\nThe Wall Street Journal, which first reported the Sessions subpoena, said it specifically sought documents related to Giuliani's business dealings in Ukraine and his efforts to oust the U.S. ambassador in Kyiv, as well as information about interactions between Sessions, Giuliani and the four men who were indicted in the Southern District of New York.\n\nThose men include two Florida businessmen, Lev Parnas and Igor Fruman, who are associates of Giuliani and tied to the Ukraine impeachment investigation. They were charged last Thursday with federal campaign finance violations in connection with a $325,000 donation to a group supporting Trump's reelection.\n\nThe federal investigation comes as House Democrats pursue an impeachment inquiry into Trump's dealings with Ukraine, including a summertime phone call in which he pressed Ukraine's president to investigate baseless corruption allegations against Democrat Joe Biden. Giuliani had also been asking Ukrainian officials to dig up dirt on Biden and also pushed for the ouster of the U.S. ambassador to Ukraine, Marie Yovanovitch.\n\nProsecutors allege that Parnas urged a congressman to promote efforts to push out Yovanovitch around the same time that Parnas and Fruman committed to raising more than $20,000 for the politician.\n\nThe congressman wasn't identified in court papers, but the donations match campaign finance reports for Sessions, who lost his reelection bid in November. In May 2018, Parnas posted a photo of himself and his business partner David Correia — who was also named in the indictment — with Sessions in his Capitol Hill office, with the caption \"Hard at work!!\"\n\nSessions spent 22 years in Congress becoming a powerful Republican voice and the muscle behind the GOP's House takeover of 2010.\n\nEarlier this month, Sessions announced an attempted comeback in his boyhood hometown of Waco, about 100 miles (160 kilometers) south of Dallas, running for a seat being vacated by Rep. Bill Flores, one of six Texas GOP congressmen retiring next year.\n\n__\n\nAssociated Press writer Tom Hays in New York contributed to this report.", "description": "A federal grand jury has subpoenaed former Republican Rep. Pete Sessions for information about his interactions with Rudy Giuliani and several associates who were indicted last week.  The subpoena is part of an ongoing investigation based in New York that includes an inquiry into the business dealings", "authors": ["Michael Balsamo"], "top_image": "https://s.yimg.com/uu/api/res/1.2/zWYGeiL2fl7l348QzwVYeA--~B/aD0xNjIzO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/496f75acbeba1ab00e2647a305853129", "published_at": "2019-10-16"}