{"pub": "yahoo", "url": "https://news.yahoo.com/latest-trumps-syria-move-drawing-165641753.html", "downloaded_at": "2019-10-16 21:30:06.301849+00:00", "title": "The Latest: Dems cite insults, quit Trump meeting on Turkey", "language": "en", "text": "WASHINGTON (AP) — The Latest on President Donald Trump and Syria (all times local):\n\n5:20 p.m.\n\nTwo days after President Donald Trump ordered U.S. troops out of northern Syria, he wrote Turkish President Recep Tayyip Erdogan telling him that if he invaded Syria he would be remembered as a \"devil.\"\n\nTrump started his brief letter on Oct. 9 suggesting that they \"work out a good deal.\"\n\nThe president told Erdogan he did not want to be responsible for \"slaughtering thousands of people.\" And Trump said he didn't want to impose sanctions that would cripple Turkey's economy if Ankara invaded Syria to battle Kurdish forces.\n\nTrump told Erdogan that history would look favorably on him if he proceeded humanely. Trump wrote: \"It will look upon you forever as the devil if good things don't happen. Don't be a tough guy. Don't be a fool!\"\n\n__\n\n5:10 p.m.\n\nHouse Republicans are blaming House Speaker Nancy Pelosi for walking out of a briefing with President Donald Trump. They are calling her actions \"unbecoming.\"\n\nTrump met Wednesday at the White House with members of Congress to discuss Turkey and Syria. Democrats say Trump insulted Pelosi, calling her a \"third-rate politician.\" Democratic leaders left shortly thereafter.\n\nHouse Minority Leader Kevin McCarthy is trying to pin the blame on Pelosi, saying she stormed out of the meeting.\n\nHe is calling it a pattern of behavior on Pelosi's part, disregarding that it was actually Trump who walked out of a meeting with Democratic leaders on the issue of infrastructure spending last May.\n\nMcCarthy says the meeting was very productive for the lawmakers from both parties who remained.\n\n__\n\n4:35 p.m.\n\nDemocratic congressional leaders say they walked out of a briefing with President Donald Trump on Turkey after hearing little but insults from Trump.\n\nThe Senate's top Democrat, Chuck Schumer, says Trump insulted House Speaker Nancy Pelosi by calling her a \"third-rate politician.\" Schumer says the meeting \"was not a dialogue. This was sort of a diatribe, a nasty diatribe not focused on the facts.\"\n\nPelosi tells reporters outside the White House that \"what we witnessed on the part of the president was a meltdown.\"\n\nPelosi claims Trump appeared visibly \"shaken up\" after House passage of a bipartisan condemnation of his decision to order the withdrawal of American troops from northern Syria.\n\nPelosi says Democrats \"couldn't continue in the meeting because he was just not relating to the reality of it.\"\n\n___\n\n4:15 p.m.\n\nHouse Speaker Nancy Pelosi says the White House has canceled a classified briefing about Syria for House members.\n\nThe California Democrat says scrapping the meeting prevents Congress from learning about \"the dangerous situation\" caused by President Donald Trump's withdrawal of U.S. troops from northern Syria.\n\nTurkey has invaded the region.\n\nPelosi says she's \"deeply concerned\" because lawmakers have a right to be informed about such decisions.\n\nA Democratic congressional aide says the White House said it couldn't provide administration officials to conduct Thursday's planned briefing.\n\nTwo Senate aides say a classified briefing for senators was also canceled. One aide says it's because key administration officials were traveling to Turkey.\n\nThe aides spoke on condition of anonymity because they weren't authorized to discuss the matter publicly.\n\n—Associated Press writer Alan Fram\n\n___\n\n3:45 p.m.\n\nSenate Republicans are sticking up for the U.S.-allied Syrian Kurds after President Donald Trump defended his pullout of American troops, which cleared the way for the Turkish assault on the Kurds.\n\nGOP Leader Mitch McConnell calls the partnership \"a terrific alliance\" that set the Islamic State group back and says he is \"sorry we are where we are.\"\n\nSen. Roy Blunt of Missouri says Turkish President Recep Tayyip Erdogan \"has not been a reliable ally. The Kurds have been a reliable ally.\"\n\nSen. Joni Ernst of Iowa adds, \"We really have left behind and abandoned a strategic partner, the Kurds, who stood by our men and women in uniform in the fight\" to defeat IS.\n\nAt the White House, Trump defended his decision, saying the Kurds were \"no angels.\"\n\n__\n\n2:45 p.m.\n\nThe House has overwhelmingly voted its bipartisan condemnation of President Donald Trump's withdrawal of American forces from northern Syria.\n\nDespite stark divisions over Democrats' Trump impeachment inquiry, Democrats and Republicans banded together Wednesday and approved a nonbinding resolution by 354-60 vote.", "description": "Democratic congressional leaders say they walked out of a briefing with President Donald Trump on Turkey after hearing little but insults from Trump.  The Senate's top Democrat, Chuck Schumer, says Trump insulted House Speaker Nancy Pelosi by calling her a \"third-rate politician.\" Schumer", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/e6RbUHcdajsK5nkSMVG9Sw--~B/aD0zNDEyO3c9NDgwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/a7332ac6e82ac3683a05877096930709", "published_at": "2019-10-16"}