{"pub": "japantoday", "url": "https://japantoday.com/category/world/update-3-erdogan-says-turkey-to-resume-syria-offensive-if-truce-deal-falters", "downloaded_at": "2019-10-20 00:19:54.223474+00:00", "title": "Erdogan says Turkey to resume Syria offensive if truce deal falters", "language": "en", "text": "By Tuvan Gumrukcu\n\nPresident Tayyip Erdogan said on Saturday Turkey would press on with its offensive into northeastern Syria and \"crush the heads of terrorists\" if a deal with Washington on the withdrawal of Kurdish fighters from the area was not fully implemented.\n\nErdogan agreed on Thursday in talks with U.S. Vice President Mike Pence a five-day pause in the offensive to allow time for the Kurdish fighters to withdraw from a \"safe zone\" Turkey aims to establish in northeast Syria near the Turkish border.\n\nOn Saturday the fragile truce was holding along the border, with just a few Turkish military vehicles crossing the border, Reuters journalists at the scene said. In the last 36 hours, there have been 14 \"provocative attacks\" from Syria, Turkey's defence ministry said, adding it was continuing to coordinate closely with Washington on implementation of the accord.\n\nIf the agreement with the United States, a NATO ally, for the Syrian Kurdish YPG militia to withdraw falters, Turkey will continue its military operation from where it left off, Erdogan said.\n\n\"If it works, it works. If not, we will continue to crush the heads of the terrorists the minute the 120 hours (of the ceasefire) are over,\" Erdogan told flag-waving supporters in the central Turkish province of Kayseri.\n\n\"If the promises that were made to us are not kept, we will not wait like we did before and we will continue the operation where it left off once the time we set has run out,\" he said.\n\nAnkara regards the YPG, the main component of the Kurdish-led Syrian Democratic Forces (SDF), as a terrorist group because of its links to Kurdish insurgents in southeast Turkey.\n\nOn Friday, the Kurdish militia accused Turkey of violating the five-day pause by shelling civilian areas in the northeast and the border town of Ras al Ain.\n\nA senior Turkish official called the accusations an attempt to sabotage the agreement between Ankara and Washington, adding that Turkey was fully behind the deal.\n\n\"Turkey is 100% behind the deal. We already got everything we wanted at the negotiating table,\" the official said. \"It's bizarre to think that we'd violate an agreement that we like,\" the official added.\n\nThe surprise deal to suspend Turkey's military offensive in Syria hinged on Erdogan's demand that Washington agree on a time limit on any ceasefire, a senior Turkish official told Reuters on Friday.\n\nThe deal aims to stem a humanitarian crisis, which displaced 200,000 civilians in the region, and ease a security scare over thousands of Islamic State captives guarded by the YPG, who the Turkish assault targets.\n\nThe planned safe zone would go 32 km (20 miles) into Syria. Erdogan said on Friday it would run for some 440 km from west to east along the border, though the U.S. special envoy for Syria said the accord covered a smaller area where Turkish forces and their Syrian rebel allies were fighting.\n\nErdogan also said on Friday Turkey would set up a dozen observation posts across northeast Syria, and that he would hold talks with Russian President Vladimir Putin on what steps to take in the planned \"safe zone\" next week.\n\nEMERGENCY TALKS IN SOCHI\n\nThe truce also aimed to ease a crisis triggered by President Donald Trump's abrupt decision earlier this month to withdraw all 1,000 U.S. troops from northern Syria, a move criticised in Washington and elsewhere as a betrayal of loyal Kurdish allies who had fought for years alongside U.S. troops against Islamic State.\n\nTrump defended his decision as \"strategically brilliant\" and said the truce reached with Turkey would save millions of lives. Trump later said he held a phone call with Erdogan and that the Turkish leader \"very much wants the ceasefire, or pause, to work\".\n\nBut Trump's move also means the extent of Turkey's ambitions in the region is likely to be determined by Russia and Iran, who both support Syrian President Bashar al-Assad, and look to fill the vacuum created by the U.S. retreat.\n\nAssad has already deployed his forces in territory formerly protected by Washington, invited by the Kurds. Erdogan, who has backed rebels fighting to oust Assad, has said Turkey has no problem with Syrian government forces deploying near the border.\n\nBut Erdogan said on Saturday he would discuss the Syrian deployment in northern Syria in his planned talks with Putin during a visit to Russia's Black Sea resort of Sochi on Tuesday.\n\n\"In certain parts of our operation area, (Assad) regime forces under Russian protection are situated. We will discuss this issue with Mr Putin. We need to find a solution,\" Erdogan said.\n\n\"But the same is valid there too. If it works, it works. If not, then we will continue to implement our own plans,\" he said, without elaborating.\n\nWhile Erdogan and Putin have forged close ties over defence and energy cooperation, as well as efforts to find a political solution in Syria, Moscow has said the Turkish offensive into Syria was \"unacceptable\" and should be limited.\n\nOn Friday, Russian officials discussed with Assad in Damascus the need to de-escalate the situation in northeast Syria, Russia's foreign ministry said on Saturday.\n\n© (c) Copyright Thomson Reuters 2019.", "description": "President Tayyip Erdogan said on Saturday Turkey would press on with its offensive into northeastern Syria and \"crush the heads of terrorists\" if a deal with Washington on the withdrawal of Kurdish fighters from the area was not fully implemented. Erdogan agreed on Thursday in talks with U.S. Vice President…", "authors": ["Burning Bush", "Chip Star"], "top_image": "https://japantoday.com/images/japan-today-social.jpg", "published_at": "2019-10-19"}