{"pub": "bbc", "url": "https://bbc.co.uk/news/world-middle-east-50075703", "downloaded_at": "2019-10-16 20:40:56.951953+00:00", "title": "Turkey-Syria offensive: Not our problem, says Donald Trump", "language": "en", "text": "Image copyright Getty Images Image caption Mr Trump made the comments during a meeting with President Sergio Mattarella of Italy in the Oval Office\n\nPresident Donald Trump has said it is \"not our problem\" if Turkey enters Syria, calling the former US allies the Kurds \"no angels\".\n\nThe US is facing intense criticism for withdrawing its forces from Syria, which some say gave Turkey the green light to launch a cross-border offensive against Kurdish-led forces.\n\nMr Trump told reporters at the White House the US is \"not a policing agent\".\n\n\"It is time for us to go home,\" he said.\n\nTurkey launched the offensive in northern Syria a week ago to push back from its border members of a Syrian Kurdish militia called the People's Protection Units (YPG) and create a \"safe zone\" along the Syrian side of the border, where up to two million Syrian refugees can be resettled.\n\nThe Turkish operation came after Mr Trump ordered the withdrawal of US forces from the area.\n\nKurdish-led forces have been a key ally of the US in the fight against Islamic State in Syria and there are fears the destabilisation could lead to a resurgence of the militants.\n\nWhat did the president say?\n\nMr Trump said he saw the situation on the Turkey-Syria border as \"strategically brilliant\" for the US.\n\n\"Our soldiers are out of there. Our soldiers are totally safe. They've got to work it out. Maybe they can do it without fighting,\" he said.\n\n\"We're watching and we're negotiating and we're trying to get Turkey to do the right thing, because we'd like to stop wars regardless.\"\n\nMedia playback is unsupported on your device Media caption Trump said earlier in October Kurds \"didn't help us in Second World War\"\n\nThe president also said that the Kurds are \"not angels\".\n\n\"They fought with us. We made a lot of money for them to fight with us, and that's okay,\" he said. \"They did well when they fought with us. They didn't do so well when they didn't fight with us.\"\n\nMr Trump added that the Kurdistan Workers' Party (PKK) - a rebel group that fights for Kurdish autonomy in Turkey - \"is probably worse at terror and more of a terrorist threat in many ways than\" Islamic State.\n\nWhat's the context?\n\nAnkara sees the YPG militia as an extension of the PKK.\n\nThe US has designated the PKK as a foreign terrorist organisation and Specially Designated Global Terrorist Entity. The US has previously acknowledged links between the PKK and YPG, but it has rejected Turkey's assertion that the YPG is an extension of the PKK.\n\nThe YPG dominates an alliance of Kurdish and Arab militias called the Syrian Democratic Forces (SDF), which has driven the Islamic State (IS) group out of a quarter of Syria over the past four years with the help of air strikes by a US-led multinational coalition.\n\nOn Sunday, after US troops began withdrawing from the region and Turkish-led forces made gains, the Kurds agreed a deal with the Syrian government for the Syrian army to be deployed on the border to help repel the Turkish assault.\n\nVice President Mike Pence and US Secretary of State Mike Pompeo are heading to Turkish capital, Ankara, to meet Turkey's President Recep Tayyip Erdogan.\n\nThe US announced sanctions against Turkey on Monday.\n\nOn Wednesday, a spokesman for Turkey's President Erdogan said the country's foreign ministry was preparing retaliatory sanctions against the US.\n\nAnkara has vowed to continue its offensive, and has refused to negotiate with Kurdish fighters.\n\nWhat's the latest on the ground?\n\nThe UK-based Syrian Observatory for Human Rights said on Wednesday that Syrian and Russian forces had entered the border town of Kobane, following a deal struck between the Kurds and Damascus in the wake of Turkey's incursion.\n\nDozens of civilians have reportedly been killed in the operation so far and at least 160,000 have fled the area, according to the UN.\n\nThe UN Security Council meanwhile on Wednesday once more called on Turkey to stop its assault.\n\nMedia playback is unsupported on your device Media caption The BBC's Martin Patience explains what's behind the conflict\n\nSyrian government forces entered the strategic town of Manbij on Tuesday – inside the area where Turkey wants to create its \"safe zone\".\n\nTurkish troops and pro-Turkish, anti-government fighters have also been gathering near Manbij.\n\nOver the past two years, hundreds of US troops have visibly patrolled the strategic town, but they left earlier this week.", "description": "His remarks come after Turkey launched an attack into Syria as US troops withdrew from the area.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/9FD4/production/_109261904_tv057341885.jpg", "published_at": "2019-10-16"}