{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7568653/Argentina-coach-reveals-Manchester-City-striker-Sergio-Aguero-not-fully-fit-season.html", "downloaded_at": "2019-10-13 18:54:45.527008+00:00", "title": "Argentina coach reveals Manchester City striker Sergio Aguero has not been fully fit this season", "language": "en", "text": "Argentina manager Lionel Scaloni has revealed Sergio Aguero has not been 100 per cent fit this season.\n\nDespite this, the Manchester City striker is joint top scorer in the Premier League with Tammy Abraham.\n\nBut Aguero's national team coach insists that he has been carrying a knock.\n\nLionel Scaloni has revealed Sergio Aguero has not been 100 per cent fit this season\n\n'Sergio Aguero is not here because he's been carrying a problem and has not been training 100 per cent with his club,' Scaloni said.\n\nIn the latest serialisation of the new book 'Pep's City: The Making of a Superteam', it has been revealed that Pep Guardiola planned a dinner to help Aguero learn his tactical style.\n\nThe manager wanted his striker to press more, hold onto the ball better and work as hard as the rest of the first team squad were to grasp Guardiola's style.\n\nIn an extract published by The Sun on Thursday night, Aguero said: 'Pep asked me to try a new way of playing and I had to adapt. It wasn't easy but I had no choice.\n\n'My game is totally different now from what I was doing five years ago at City. A total transformation. At that meal, we talked about loads of things.\n\n'We kept postponing it and then when we finally met up, we talked about work for 20 minutes or so. The rest of the meal we spent chatting about other stuff, family, life in general.'", "description": "Argentina manager Lionel Scaloni has revealed Sergio Aguero has not been 100 per cent fit this season.  Despite this, the Manchester City striker is joint top scorer in the Premier League.", "authors": ["Jack Kinnersley For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/17/19660852-0-image-a-6_1570985442152.jpg", "published_at": "2019-10-13"}