{"pub": "investingcom", "url": "https://ng.investing.com/news/stock-market-news/stocks--us-futures-flat-after-chines-officials-break-off-extended-us-trip-55053", "downloaded_at": "2019-09-23 11:55:15.302708+00:00", "title": "Stocks - U.S. Futures Flat After Chines Officials Break Off Extended U.S. Trip", "language": "en", "text": "© Reuters.\n\nInvesting.com - U.S. futures were flat on Monday, after Chinese officials cut their U.S. trip short and speculation remained on whether or not the two largest economies in the world will reach a trade deal in the coming months.\n\nBoth sides said the talks were constructive, but neither gave any details about what was discussed. Chinese officials were expected to visit various farming regions but announced on Friday that they were returning home earlier than expected, without announcing any significant breakthrough.\n\nrose 13 points or 0.2% by 6:41 AM ET (10:41 GMT), while lost 15 points or 0.1% and S&P 500 futures were up 1 point.\n\nTesla (NASDAQ: ) fell 0.9% in premarket trade after a Delaware judge ruled that the electric carmaker's board of directors will have to stand trial and defend CEO Elon Musk’s multibillion dollar pay package. The company was sued in June 2018 by shareholders over allegations of corporate waste.\n\nNetflix (NASDAQ: ) was down 0.7% after the success of HBO at the annual Emmys underscored the intensifying competition in the streaming sector. HBO's parent company AT&T (NYSE: ), which inched down 0.2%, plans to offer an expanded streaming service that will compete directly with Netflix and Amazon.com's (NASDAQ: ) Prime Video. Other upcoming offerings from Walt Disney (NYSE: ) and Apple (NASDAQ: ) are also likely to add to competition as viewers gain more streaming options.\n\nElsewhere, Apple (NASDAQ: ) inched up 0.2% after Bloomberg reported that ten of its 15 requests for an exemption from tariffs on imports from China had been approved.\n\nOn the economic front, and PMIs from IHS Markit are released at 9:45 AM ET. The firm's European surveys earlier showed the manufacturing recession in deepening and the also losing momentum.\n\nIn commodities, futures fell 0.6% to $57.70 a barrel following reports that Saudi Arabia could restore output to full capacity as soon as next week. were up 0.8% to $1,527.15 a troy ounce, while the , which measures the greenback against a basket of six major currencies, rose 0.2% to 98.338.", "description": "Stocks - U.S. Futures Flat After Chines Officials Break Off Extended U.S. Trip", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEB301WD_L.jpg", "published_at": "2019-09-23"}