{"pub": "realclearpolitics", "url": "https://insidehook.com/article/sports/what-making-brisket-and-nascar-have-in-common-according-to-dale-earnhardt-jr", "downloaded_at": "2019-09-23 17:21:15.663793+00:00", "title": "Dale Earnhardt Jr. On What BBQ Brisket and NASCAR Have in Common", "language": "en", "text": "Since retiring from being a full-time racer, NASCAR legend Dale Earnhardt, Jr., has not been sitting on his Nationwide-sponsored laurels.\n\nThe 44-year-old almost immediately sped from behind the wheel to the mic and has been working as a broadcaster and analyst for NBC Sports, covering everything from the Kentucky Derby to the Indianapolis 500.\n\nAnd of course, given what he was doing before coming aboard at NBC, Earnhardt is working in the broadcast booth for NASCAR races.\n\nThe new role has offered Earnhardt a fresh perspective on NASCAR.\n\n“When I was racing I knew how hard I was driving and how hard I was working but I couldn’t see the other guys from the vantage point that I have now,” Earnhardt, who was in Las Vegas on behalf of Goodyear’s “Burnout Sweepstakes”, tells InsideHook. “I couldn’t see the entire field and what they were trying to accomplish and do. So I had no real appreciation for just how hard other guys were racing. Now that I can see it, I really do just admire how talented these guys are and how hard they go after it and I try to embrace that. And then when I see anything happen on the racetrack, man, I just try to react naturally to it as if I was hanging out on the couch with my friends.”\n\nBut coming across as casual wasn’t always easy when the 26-time NASCAR Cup Series winner was a rookie broadcaster.\n\n“I think the toughest part for me was just getting over the nerves,” he says. “You’re just so nervous that you’re going to make a mistake. You’re talking to a lot of people and a lot of people are very critical about the broadcasts and hold the broadcast team to a certain standard. When I was a race car driver, I thought the broadcast team had a very heavy obligation and so when I got in that role I’m like ‘Well, okay, I’ve been talking the talk, now I’ve got to walk the walk.’ I’ve always felt like the broadcasters had an important job to do and now I’m doing it so I take it extremely seriously. So I was extremely nervous. Once you can shed those nerves, you really can be yourself.”\n\nWhen you get a brisket man, it is a two-day process … It’s very similar to preparing a race car\n\nWorking for NBC has also allowed Earnhardt to enjoy perks he couldn’t take advantage of when he was driving.\n\n“I think I enjoy going to all the races more as a broadcaster because I’m out from under that performance pressure that I had to perform and succeed and win,” Earnhardt says. “Now that I don’t have that I’m going to these races and really enjoying the festivities and the atmosphere and taking it in as a fan. I’m getting to enjoy a lot more of the perks and explore places away from the racetrack that I wouldn’t have before. When you go out to Sonoma, the wineries and all the amazing restaurants they have there. When we go out to Kansas and places like that the barbecue is amazing.”\n\nAnd barbecue is a subject Earnhardt, who refers to himself as an aspiring BBQ pitmaster in his Twitter bio, is trying to learn as much about as he knows about racing. Interestingly enough, he even sees some parallels between the two.\n\n“Making barbecue reminds me a lot in some ways about racing,” Earnhardt says. “There’s that tailgate atmosphere and the overnight preparation. You know when you get a brisket man, it is a two-day process. You’ve got to get that thing in a tray of whatever mix you want and have it sitting overnight marinating and you’ve got to inject it … You might as well have a whole damn toolbox to get it ready. It’s very similar to preparing a race car. And then you get to share it with so many people. And if it’s good you, make a lot of people happy.”\n\nBut, as with a race involving a 15-car pileup, barbecue doesn’t always turn out good.\n\nDale Earnhardt Jr. grills steaks. (Sarah Glenn/Getty for Texas Motor Speedway)\n\n“The damn thing doesn’t always come out the way that you want it to,” Earnhardt says. “It’s tough. You don’t always win. Sometimes the smoker maybe doesn’t perform the way you expect it and the heat’s just not the way it needs to be or you don’t get enough smoke on it. There are a lot of variables that are both in and out of your control. It’s so similar to racing and preparing a car and then getting through the event to the finish line.”\n\nSo what make of meat has Earnhardt had the most success with thus far?\n\n“Brisket is pretty much my favorite thing to make,” he says. “I feel like that’s what I’m most consistent with. My favorite thing to eat is ribs, but I think for me ribs is probably the most challenging thing, at least for now. It’s hit or miss on ribs for me. I’m having the most difficulty getting consistency with ribs, but brisket is an easy go-to for me.”\n\nAside from ribs, there’s another type of barbecue Earnhardt is aspiring to take to the finish line before his time as a pitmaster gets the checkered flag.\n\n“I’ve never done a whole hog. That’s a long way out there for me,” he says. “I think you need to try to cook each individual area and part of the pig before you try to do the whole thing. You really need to understand. Because even though you’re cooking a whole pig, it’s not a linear experience for the entire thing. You’ve got to have the ribs a certain way and so forth. There’s a lot for me to learn there. I think the ultimate accomplishment is for any kind of aspiring barbecue guy would be to cook a whole hog. I don’t know if I’ll ever do that because that’s like the hardest shit I can imagine.”", "description": "Earnhardt, who now works as a TV broadcaster for NBC Sports, refers to himself as aspiring BBQ pitmaster so we asked him about it.", "authors": ["Evan Bleier"], "top_image": "https://www.insidehook.com/wp-content/uploads/2019/09/GettyImages-865142152-e1568833534175.jpg?fit=637%2C424", "published_at": "2019-09-23"}