{"pub": "marketwatch", "url": "https://mansionglobal.com/articles/san-francisco-prices-stay-flat-two-months-after-breaking-records-207042", "downloaded_at": "2019-09-07 02:18:10.610058+00:00", "title": "San Francisco Prices Stay Flat, Two Months After Breaking Records", "language": "en", "text": "Since breaking records in June, San Francisco’s real estate market has seen two straight months of flat prices, according to a report released Friday by Compass.\n\n\n\nThe city’s median house price was $1.59 million last month, compared to $1.588 million in July. June saw a peak price of $1.75 million, the report found, after a slew of IPOs from local tech companies like Uber and Pinterest.\n\n\n\nMore: Centuries-Old English Country House on the Market with an Upgrade\n\n“The wild card this year in San Francisco has been this rollout of IPOs,” said Patrick Carlisle, Compass’ chief market analyst in the San Francisco Bay Area. “If you take the impact of the IPOs out of the market, one would presume prices will no longer be pushed higher.”\n\n\n\nThose IPOs earlier this year led to a record second quarter, Mr. Carlisle said. And the San Francisco market continues to outperform compared to the larger Bay Area, he added.\n\n\n\nMost other counties in the area have seen declines in median home prices since peaking in spring 2018, but not San Francisco. The city’s limited supply and the influx of interest has kept prices up.\n\n\n\nMedian home prices in “other markets around the Bay Area have fallen year-over-year, generally in the 3% to 5% range,” Mr. Carlisle said. “San Francisco and the market San Francisco impacts the most, which is the Oakland market, are the standout ones as far as performing in 2019.”\n\n\n\nFrom Penta: Sotheby’s to Offer a Private Whisky Collection—the Most Valuable to Ever Hit Auction\n\nMedian prices in the Oakland area are up 3% to 7% for the year to date, compared to 2018, according to Compass’ September report on the region.\n\n\n\nThe summer price slide is typical in many markets, Mr. Carlisle noted. He expects activity, and prices, to pick up again from now until early to mid-November, especially for luxury housing.\n\n\n\n“Luxury home sellers know this is their last chance to sell their home in 2019,” he said. “If they don't get it on the market within the next four or five weeks and then sell it within the next six to eight weeks, then they have to wait until early spring 2020.”\n\n\n\nIndeed, October is historically a big month for luxury home transactions in the city.\n\n\n\n“For the last several years, October has been the biggest month for home sales of $3 million and above of any month of the calendar year,” Mr. Carlisle explained.\n\n", "description": "", "authors": ["V.L. Hendrickson"], "top_image": "https://images.mansionglobal.com/im-104927?size=1.8906942392909896&width=1280", "published_at": "2019-09-06"}