{"pub": "yahoo", "url": "https://news.yahoo.com/state-dept-inspector-general-expected-urgent-ukraine-briefing-213600117.html", "downloaded_at": "2019-10-02 12:52:58.937684+00:00", "published_at": "2019-10-01", "title": "State Dept inspector general requests 'urgent' Ukraine briefing on Capitol Hill", "language": "en", "text": "State Dept inspector general requests 'urgent' Ukraine briefing on Capitol Hill originally appeared on abcnews.go.com\n\nThe State Department’s inspector general is expected to give an \"urgent\" briefing to staffers from several House and Senate committees on Wednesday afternoon about documents obtained from the department’s Office of the Legal Adviser related to the State Department and Ukraine, sources familiar with the planned briefing told ABC News.\n\nDetails of the briefing, requested by Steve Linick, the inspector general at State, remain unknown. Linick is expected to meet with congressional staff in a secure location on Capitol Hill.\n\n(MORE: Democratic chairmen subpoena Giuliani for documents in impeachment probe )\n\nThe unusual nature and timing of the briefing – during a congressional recess – suggests it may be connected to a recent intelligence community whistleblower allegation which describes, in part, the State Department’s role in coordinating interactions between Rudy Giuliani, the president’s personal attorney, and Ukrainian officials.\n\n(MORE: Secretary of State Mike Pompeo was on July call between Trump, Ukraine President Volodymyr Zelenskiy )\n\nThe inspector general is the department's internal investigator and watchdog, and the office generally operates independently of the department's political leadership.\n\nPHOTO: Rudy Giuliani, an attorney for President Donald Trump, addresses a gathering during a campaign event for Eddie Edwards, who is running for the U.S. Congress, in Portsmouth, N.H., Aug. 1, 2018. (Charles Krupa/AP) More\n\n(MORE: Trump admin approves new sale of anti-tank weapons to Ukraine )\n\nThe State Department has faced criticism in recent weeks for connecting Giuliani to multiple Ukrainian officials about re-opening an investigation into for Vice President Joe Biden and his son, Hunter.\n\n(MORE: Pompeo says Democrats want to 'bully' State witnesses, they accuse him of obstruction )\n\nThe State Department's press office and the State Department's inspector general's office did not immediately respond to requests for comment. The committees expected to be part of the briefing did not immediately respond to requests for comment.", "description": "The State Department’s inspector general is expected to give an \"urgent\" briefing to staffers from several House and Senate committees on Wednesday afternoon about documents obtained from the department’s Office of the Legal Adviser related to the State Department and Ukraine, sources familiar", "authors": ["Conor Finnegan", "Katherine Faulders"], "top_image": "https://s.yimg.com/uu/api/res/1.2/yfWjtY3Uc11YsGTWn.8Hzw--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.go.com/dept-of-state-01-as-gty-190815_hpMain_16x9_992.jpg"}