{"pub": "marketwatch", "url": "https://marketwatch.com/story/how-the-trump-administrations-proposed-food-stamp-cutbacks-could-worsen-the-obesity-crisis-2019-10-14", "downloaded_at": "2019-10-14 10:12:58.183492+00:00", "title": "Trump administration’s proposed cutbacks to food stamps could worsen America’s obesity epidemic", "language": "en", "text": "The Trump administration should scrap its proposed changes to food stamp eligibility if it wants to fight the country’s obesity epidemic and encourage families to buy fruits, vegetables and other healthy foods, according to new policy recommendations from the Robert Wood Johnson Foundation, a philanthropic organization focusing on public health and the U.S. obesity problem.\n\nThe administration is mulling changes to the Supplemental Nutrition Assistance Program (SNAP), commonly referred to as food stamps. A comment period on the proposal ended last month. Officials want to limit automatic eligibility for families that already receive other federal public assistance. The federal SNAP income limit is 130% above the poverty line; that’s $33,475 for a family of four.\n\nThe food-stamp program “should have sufficient resources to encourage participants to purchase more fruits and vegetables and help them make healthier purchases,” the Robert Wood Johnson Foundation said; the foundation has worked on health-related programs with the Clinton Foundation and was an early supporter of the Obama-era Affordable Care Act.\n\nThe proposed changes could deepen food insecurity for around 3 million of the 36 million people who now qualify for food stamps, the organization said, and that lack of steady financial or physical access to healthy food is a problem for low-income Americans who are grappling with obesity, an issue that has been described as an “epidemic” by the Centers for Disease Control and Prevention.\n\nFood insecurity is associated with obesity, researchers have previously shown. One reason: High-calorie, high-sugar processed food can be a cheaper option, partly because they also have a longer shelf life than fruits, vegetables and meat. More than 93 million adults or 39.8% of adults were obese in 2015-2016, according to the Centers for Disease Control and Prevention.\n\nOn Thursday, the Robert Wood Johnson Foundation also released new statistics concluding that 4.8 million children between the ages of 10 and 17 were obese between 2017 and 2018. That’s an obesity rate of 15.3% for that age group, down from 16.1% in 2016, though rates are higher for black youth (22.2%) and Hispanic youth (19%).\n\nDr. Richard Besser, the foundation’s president and CEO, urged the administration to rescind the proposal. If more families receive food stamps, he said they can build up savings and earnings to get ahead and still afford groceries, he said. “Any reforms to SNAP should reflect and advance the program’s primary goal of reducing food insecurity, but this proposal would exacerbate it,” he said.", "description": "Research shows obesity is associated with food insecurity.", "authors": ["Andrew Keshner"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT169_food_s_ZG_20191011131325.jpg", "published_at": "2019-10-14"}