{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/09/WS5d9d4408a310cf3e3556f5ce.html", "downloaded_at": "2019-10-09 02:44:46.892163+00:00", "title": "UN Security Council welcomes formation of Syrian Constitutional Committee", "language": "en", "text": "Xinhua | Updated: 2019-10-09 10:20\n\nGeir Pedersen, Special Envoy for Syria, speaks about the Syrian Constitutional Committee, during a press conference, at the European headquarters of the United Nations in Geneva, Switzerland, Oct 2, 2019. [Photo/IC]\n\nUNITED NATIONS - The Security Council on Tuesday welcomed the formation of the Constitutional Committee in Syria, which was announced by UN Secretary-General Antonio Guterres on Sept 23.\n\n\"The Security Council determines that the launch of the Syrian-owned and Syrian-led Constitutional Committee should be the beginning of the political process to end the Syrian conflict in line with UN Security Council Resolution 2254 (2015) that meets the legitimate aspirations of all Syrians,\" said the council in a presidential statement.\n\nThe Security Council expressed its appreciation for UN Special Envoy for Syria Geir Pedersen's diplomatic engagement to finalize the agreement between the Syrian government and the opposition to form the Constitutional Committee.\n\nThe council further emphasized its strong support for Pedersen and the UN initiative to convene the first meeting of the Constitutional Committee in Geneva by Oct 30, 2019.\n\n\"The Security Council reaffirms that there can be no military solution to the conflict in Syria, and that it can only be resolved through the full implementation of (Resolution) 2254,\" reads the statement, which was adopted on Tuesday. \"The Security Council reaffirms its strong commitment to the sovereignty, independence, unity, and territorial integrity of Syria.\"\n\nAccording to the terms of reference that have been agreed on by the Syrian government and the opposition, the Constitutional Committee has been authorized to draft a new constitution.\n\n\"The Constitutional Committee may review the 2012 Constitution, including in the context of other Syrian constitutional experiences and amend the current constitution or draft a new constitution,\" reads the \"Terms of Reference and Core Rules of Procedure\" released by the United Nations on Sept 28.\n\nThe Constitutional Committee comprises 150 members -- 50 nominated by the government, 50 nominated by the opposition, and 50 representatives of civil society.\n\nIt also has a small body of 45 members -- 15 members each from the 50 representatives of the three groups. The small group is responsible for preparing and drafting the constitutional proposals for their adoption by the large body of all 150 members of the committee.\n\nThe idea of the Constitutional Committee was agreed on at an intra-Syrian conference at Sochi, Russia, in January 2018. The committee is considered a key element in the Syrian political process after more than eight years of civil war.", "description": "The Security Council on Tuesday welcomed the formation of the Constitutional Committee in Syria, which was announced by UN Secretary-General Antonio Guterres on Sept. 23.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/09/5d9d4408a310cf3e97a03e0e.jpeg", "published_at": "2019-10-09"}