{"pub": "townhall", "url": "https://townhall.com/tipsheet/cortneyobrien/2019/09/26/trump-i-am-under-siege-n2553746", "downloaded_at": "2019-09-26 14:49:52.307255+00:00", "title": "Trump: I Am Under Siege", "language": "en", "text": "President Trump tweeted that he is \"under siege\" on Thursday following a week of Democrats' calling for his impeachment.\n\nSo cute! Her father is under siege, for no reason, since his first day in office! https://t.co/8wtB3H4fth — Donald J. Trump (@realDonaldTrump) September 26, 2019\n\nLast week (although it seems like ages ago), a whistleblower complaint accused Trump of threatening Ukrainian leader Volodymyr Zelensky to investigate his 2020 rival Joe Biden and his son Hunter, or risk U.S. military aid. Hunter Biden reportedly received millions of dollars for sitting on the board of a corrupt Ukrainian gas company.\n\nHaving learned of the whistleblower complaint, but neither hearing the phone call nor reading the transcript, nor seeing the full complaint, Democrats seized the opportunity to charge Trump with quid pro quo and demand his impeachment.\n\nEven House Speaker Nancy Pelosi, who up until this point had warned her colleagues to slow their roll and maybe focus on other issues, joined them and formally announced an impeachment inquiry Tuesday night. But, when the transcript of the call between Trump and Zelensky was released, it showed no signs of quid pro quo. Pelosi would know that had she read it. What's more, Zelensky himself told the press on Wednesday that \"nobody pushed\" him to do anything.\n\nAnother factor in all this, Trump noted, is the stock market. If Pelosi and the Dems actually go through with this charade, he warned that stocks will drop like a rock.\n\nIf they actually did this the markets would crash. Do you think it was luck that got us to the best Stock Market and Economy in our history. It wasn’t! https://t.co/V0WGVWEWTN — Donald J. Trump (@realDonaldTrump) September 26, 2019\n\nIn fact, Trump suggested it was his economic record that lit the fire for all this impeachment talk.\n\n“The Democrats have been talking about Impeaching Donald Trump since before he was inaugurated.” @SteveDoocy @foxandfriends And for no reason other than the great success we are having with the Economy, the Military, Vets, Tax and Regulation Cuts, HealthCare, and so much more! — Donald J. Trump (@realDonaldTrump) September 25, 2019\n\nIn conclusion:\n\nTHE GREATEST SCAM IN THE HISTORY OF AMERICAN POLITICS! — Donald J. Trump (@realDonaldTrump) September 26, 2019\n\nActually, stay tuned. I'm sure he'll have plenty more to say.\n\nThe whistleblower complaint has reportedly been declassified and is expected to be released today.", "description": ".09/26/2019 10:45:54AM EST.", "authors": ["Cortney O'Brien", "Katie Pavlich", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/266/cdd80ea5-7d73-4f66-9231-9b3118d3b3b5.png", "published_at": "2019-09-26"}