{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2014/jul/17/company-co-founded-nancy-pelosis-son-charged-secur", "downloaded_at": "2019-10-04 23:59:50.060322+00:00", "title": "Company co-founded by Nancy Pelosi's son charged with securities fraud", "language": "en", "text": "The Securities and Exchange Commission (SEC) charged a company cofounded by Paul Pelosi Jr. with fraud on Wednesday after learning that two convicted criminals were running the business.\n\nPaul Pelosi Jr., the son of House Minority Leader Nancy Pelosi (D., Calif.), was the president and chief operating officer of Natural Blue Resources Inc., an investment company he cofounded that focuses on “environmentally-friendly” ventures.\n\nThe SEC charged four individuals with fraud, including former New Mexico Gov. Toney Anaya, and suspended trading in the company’s stock. Pelosi owned over 10 million shares in the company in 2009.\n\nThe SEC said Wednesday the company was “secretly controlled” by James E. Cohen and Joseph Corazzi, both of whom had previous fraud convictions. Corazzi violated federal securities laws and was barred from acting as an officer or director of a public company. Cohen was previously incarcerated for financial fraud.\n\nCohen and Corazzi said they were “outside consultants,” but according to the SEC, they actually controlled Natural Blue’s business decisions “without disclosing their past brushes with the law to investors.” The pair made hundreds of thousands of dollars off the company.\n\n“Cohen and Corazzi concealed their involvement through a so-called ‘consulting’ agreement, but their influence over the issuer spread much further,” said Andrew J. Ceresney, director of the SEC’s Enforcement Division. “Investors in Natural Blue had a right to know who was running the company behind the scenes.”\n\nThe SEC suspended trading in Natural Blue stock. A notice filed in the Federal Register on Wednesday by Jill M. Peterson, assistant secretary of the SEC, revealed that the company has not filed any periodic reports, which are required by law, with the SEC in four years.\n\n“It appears to the Securities and Exchange Commission that there is a lack of current and accurate information concerning the securities of Natural Blue Resources, Inc. because it has not filed any periodic reports since the period ended September 30, 2010,” Peterson said, in the order announcing suspension of trading.\n\nCohen, Corazzi, Anaya, and Erik Perry, a former executive at Natural Blue, were all charged with federal fraud violations. Anaya, who was Governor of New Mexico from 1983 to 1987, and Perry “misled investors by failing to disclose that Cohen and Corazzi were running the company in spite of their criminal or disciplinary histories,” the SEC said.\n\n“Natural Blue and its officers attempted an end-run around the rules designed to prevent recidivists from getting their hands on the controls of public companies,” said Paul Levenson, director of the SEC’s Boston Regional Office.\n\n“While Natural Blue was ostensibly led by Anaya and subsequently Perry, management decisions made by Cohen and Corazzi resulted in no revenues or viable business operations for the company,” the SEC said. “Anaya and Perry each deferred to Cohen and Corazzi in derogation of their responsibilities.”\n\nThe SEC said Natural Blue made “various material misrepresentations about the company, its contracts, and its anticipated revenue in a February 2011 press release as well as on a website and verbally to investors.”\n\nThere is some dispute over Paul Pelosi’s current connection to the company.\n\nThe New Mexico Office of the Secretary of State Business Service Divisioncurrently lists Natural Blue as a company “not in good standing,” with Pelosi listed as its president.\n\nPelosi cofounded the company in 2009. The SEC said Natural Blue’s mission is to “create, acquire, or otherwise invest in environmentally-friendly companies, including an initiative to locate, purify, and sell water recovered from underground aquifers in New Mexico and other areas with depleting water resources.”\n\nAccording to Bloomberg Businessweek, Pelosi served as president and chief operating officer of Natural Blue Resources, Inc. until January 11, 2010. Joseph Montalto is listed as the current president.\n\nHowever, the Mountain View Telegraph cited Pelosi as Natural Blue’s president last year, and Anaya was still leading the company as chairman and CEO at this time.\n\nPelosi and Natural Blue Resources could not be reached for comment.\n\nAnaya will be barred from participating in any penny stock company for at least five years, and fined an amount to be determined later. Perry also settled with the SEC, agreeing to pay $150,000 fine, and permanently banned from serving as an officer or director of a public company and from participating in any offerings of penny stock.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The Securities and Exchange Commission (SEC) charged a company cofounded by Paul Pelosi Jr. with fraud on Wednesday after learning that two convicted criminals were running the business.", "authors": ["The Washington Times Http", "Elizabeth Harrington - Washington Free Beacon"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2014/07/16/pelosi-democrats-2016jpeg-03f65_c0-207-2522-1677_s1770x1032.jpg?e6e515be393f41e30fc95464a41d8487612d4cd2", "published_at": "2014-07-17"}