{"pub": "metro", "url": "https://metro.co.uk/2019/10/08/sorry-avengers-fans-robert-downey-jr-doesnt-want-oscar-nomination-iron-man-10884592", "downloaded_at": "2019-10-09 00:41:40.329572+00:00", "title": "Avenger star Robert Downey Jr said no to Iron Man Oscars consideration", "language": "en", "text": "Robert said thanks but no thanks to Disney (Picture: Rex)\n\nRobert Downey Jr has revealed that he does not want to be put forward for an Oscar nomination for his work on Avengers.\n\nFans recently launched a petition to push Disney to add the actor to their Oscars consideration list after they noticed he wasn’t put forward for the best actor nomination.\n\nRobert has played Tony Stark since the first Iron Man movie – and the first MCU film at that – in 2008, but he made his last appearance as the beloved superhero in Avengers: Endgame.\n\nHowever, now the actor has admitted he was the one to speak up and say ‘let’s not’ when it came to the nomination.\n\n‘I’m so glad you brought this up because there was some talk about it, and I said “let’s not”,’ he said on The Howard Stern Show on Monday.\n\nHe added: ‘I’ll tell you the truth. I didn’t expect [the Marvel Cinematic Universe] to become what it became, and it is this very large, multiheaded Hydra at this point.’\n\nRobert played Tony Stark for 11 years (Picture: Rex)\n\nThe petition from fans reads: ‘We, the undersigned, were so moved by Mr. Robert Downey Jr.’s performance as Tony Stark in Avengers: Endgame that we believe he is unquestionably deserving of the Academy’s Award for Best Actor.\n\nAdvertisement\n\nAdvertisement\n\n‘The creative choices he made and immense depth of emotional energy he infused in Tony Stark forged an unforgettable experience for the viewers.’\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nDisney launched this year’s official For Your Consideration website, which lists the movies from their studio which are being put forward for the Oscars 2020 nominations.\n\nFollowing their success at the Academy Awards at the last Oscars with Black Panther, Disney are clearly feeling lucky again as they’ve put Avengers: Endgame forward for several categories including best picture, best director for Anthony and Joe Russo, best cinematography for Trent Opaloch, best adapted screenplay for Christopher Markus and best original score for Alan Silvestri.\n\nThere’s also: best film editing, best production design, best costume design, best makeup and hairstyling, best sound mixing, best sound editing, and best visual effects.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Kylie Jenner ‘nearly destroyed’ when Travis Scott revealed he didn’t want another baby and marriage\n\nMORE: Stranger Things star David Harbour demands answers ahead of season 4: ‘Is Hopper dead?’", "description": "Avenger star Robert Downey Jr told Disney not to put him forward.", "authors": ["Rebecca Lewis"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/09/PRI_85670802_1570563775.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-08"}