{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/2019100110541/bond-report-treasury-yields-sink-after-us-manufacturing-weakness-raises-recession-fears", "downloaded_at": "2019-10-02 00:34:01.307875+00:00", "title": "BOND REPORT: Treasury Yields Sink After U.S. Manufacturing Weakness Raises Recession Fears", "language": "en", "text": "By Sunny Oh\n\nU.S. ISM manufacturing index at lowest since 2009\n\nU.S. Treasury yields fell Tuesday, erasing their morning climb, as investors piled into haven assets after a worse-than-expected reading in the ISM's manufacturing gauge heightened concerns that a U.S. recession could hit late, next year.\n\nHow are global bond-markets trading?\n\nThe 10-year Treasury note yield was down 2.4 basis points to 1.651%, while the 2-year note rate fell 6.4 basis points to a three-week low of 1.560%, marking its biggest daily drop in five weeks. The 30-year bond yield fell 0.7 basis point to 2.112%.\n\nThe 10-year yield for the Japanese government bond , or JGB, was up 7 basis points to negative 0.15%. The 10-year German bond yield picked up 1.2 basis points to negative 0.56%.\n\nWhat's driving Treasurys?\n\nA disappointing data point spurred inflows into Treasurys, undoing the earlier bond-market selloff. The U.S. Institute for Supply Management's (ISM) purchasing managers index for the manufacturing sector in September (link)came in at 47.8, its lowest reading since June 2009.\n\nEconomists polled by MarketWatch were forecasting a reading of 50.2%. The factory gauge was last seen at 49.1% in August, putting it officially into contraction territory.\n\nAnalysts say the ISM factory gauge can serve as an important indicator of impending troubles for growth. The shrinking of U.S. manufacturing activity has been one of the clearest manifestations of a global trade slowdown. Still, spending by households and a resilient services sector, so far, have kept the impact of the U.S.-China trade war contained.\n\nSee also: Yes, the ISM manufacturing report was bad, but no, it doesn't mean recession is coming (link)\n\nTraders in the fed fund futures market now project a 52% chance of a quarter point rate cut (link)at the Federal Reserve's October 30 meeting, from 40% a day go.\n\nSee: Fed rate-cut in October seen as more likely after weak ISM report (link)\n\nGlobal bond markets came under pressure in the morning in the wake of an auction for Japanese government bonds. The sale saw its biggest \"tail\" for a 10-year note since 2015, a sign that the auction struggled to draw interest from market participants (link). The tail is the amount by which the highest yield the Treasury sold in the auction exceeds the highest yield expected when the auction began.\n\nThis comes after the Bank of Japan indicated on Monday it could curb its bond-buying this month for large swathes of its government debt market.\n\nIn other central bank news, the Reserve Bank of Australia cut rates by a quarter point on Tuesday, bringing its benchmark cash rate down to a record low of 0.75%.\n\nRead: Developed central banks expected to see biggest 'synchronised easing' since 2000 (link)\n\nWhat did market participants' say?\n\n\"A sustained level below 50 for the ISM manufacturing gauge is really worrisome to the market. It's a pretty reasonable predictor of recessions,\" said Tim Magnusson, senior portfolio manager at Garda Capital Partners, in an interview with MarketWatch.\n\n\"We're of the view that it makes sense for the Fed to be cutting more if they want to stay ahead of the curve. The Fed should be looking at ISM and these kinds of numbers, and not so much lagging indicators like wage growth,\" said Magnusson.\n\nJon Hill, an interest-rate strategist at BMO Capital Markets, pointed out that the trade war and strong dollar continue to weigh on domestic goods producers. \"Given this, one has to wonder how impactful incrementally lower rates may or may not be,\" he wrote.\n\n(END) Dow Jones Newswires\n\nOctober 01, 2019 15:25 ET (19:25 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-01"}