{"pub": "reuters", "url": "https://reuters.com/article/us-storm-dorian/tropical-storm-warning-issued-for-bahamas-1300-still-missing-idUSKCN1VW2A7", "downloaded_at": "2019-09-13 01:08:15.218397+00:00", "title": "Tropical storm warning issued for Bahamas; 1,300 still missing", "language": "en", "text": "NASSAU (Reuters) - A tropical cyclone was forecast to move across the northwestern Bahamas in the coming days, potentially bringing more rain and wind to islands already devastated by Hurricane Dorian, the U.S. National Hurricane Center warned on Thursday.\n\nThe Miami-based hurricane center issued a tropical storm warning for islands including hurricane-hit Abacos and Grand Bahama, saying the system could become a tropical depression or storm before making landfall as early as Friday.\n\nHurricane Dorian slammed into the Bahamas on Sept. 1 as a Category 5 storm, one of the strongest Atlantic hurricanes on record to hit land, packing top sustained winds of 185 miles per hour (298 km per hour).\n\nThe tropical cyclone was not expected to bring anywhere near that level of devastation, but was capable of winds of 30 miles per hour and 2 to 4 inches of rain through Sunday, according to the hurricane center.\n\nAid groups rushed shelter material to residents living in the shells of former homes or whose homes had been stripped of their roofs.\n\n“We’re seeing plastic tarps go out all over the islands, and that’s extremely important because now you’ve got another tropical storm coming,” said Ken Isaacs, vice president of programs for U.S. relief organization Samaritan’s Purse.\n\nThe prime minister of the Bahamas, Hubert Minnis, on Wednesday said the official death toll was 50 but was expected to rise.\n\nFormer Prime Minister Hubert Ingraham said he believed “hundreds” were dead on Abaco “and significant numbers on Grand Bahama,” the Nassau Guardian newspaper reported on Thursday.\n\nA worker in a bulldozer cleans debris from the parking lot of a private shopping center after Hurricane Dorian hit the Abaco Islands in Marsh Harbour, Bahamas, September 11, 2019. REUTERS/Marco Bello\n\nMinnis said there were problems coordinating aid due to the level of devastation and he was trying to remove “bureaucratic roadblocks.”\n\nTENT CITIES FOR NEWLY HOMELESS\n\nWith 1,300 people still missing, according to the Bahamian government, relief services are focused on search and rescue as well as providing life-sustaining food, water and shelter.\n\nOfficials have erected large tents in Nassau to house those made homeless by Dorian and plan to erect tent cities on Abaco capable of sheltering up to 4,000 people.\n\nA flood of aid has caused bottlenecks at docks and airports, creating “a lot of delays” in relief supplies, said Nat Abu-Bonsrah of the Adventist Development and Relief Agency, the global humanitarian organization of the Seventh-day Adventist Church.\n\nSlideshow (14 Images)\n\nDue to a shortage of functioning vehicles and facilities on Grand Bahama, the group turned to church members to lend their cars and kitchens for its program providing hot meals to over 400 people a day in Freeport.\n\n“We’ve not been able to reach them as much as we want,” he said of efforts to get hundreds of hygiene kits to survivors.\n\nGroups like Samaritan’s Purse, with their own aircraft or logistics chains, said they had not encountered issues with coordination or government red tape.\n\n“I think we’re accomplishing our mission, any roadblocks we have right now are our own,” said Dennis Clancey, a field operations manager for relief group Team Rubicon, which has deployed mobile medical units to treat patients.", "description": "A tropical cyclone was forecast to move across the northwestern Bahamas in the coming days, potentially bringing more rain and wind to islands already devastated by Hurricane Dorian, the U.S. National Hurricane Center warned on Thursday.", "authors": ["Zach Fagenson", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190911&t=2&i=1428851167&w=1200&r=LYNXNPEF8A1MW", "published_at": "2019-09-13"}