{"pub": "independent", "url": "https://independent.co.uk/travel/news-and-advice/chernobyl-reactor-four-open-tourists-ukraine-nuclear-disaster-a9129591.html", "downloaded_at": "2019-10-02 12:49:33.235613+00:00", "published_at": "2019-10-02", "title": "Chernobyl’s reactor four control room opens to tourists", "language": "en", "text": "The control room of Chernobyl’s reactor four, the site of the world’s most devastating nuclear catastrophe, is to open to tourists.\n\nThe Ukrainian government is throwing open the doors of the facility to the public for the first time, as part of a bigger overhaul to make the disaster zone more tourist-friendly.\n\nEfforts announced by President Volodymyr Zelensky in July include new walking trails and waterways, improved mobile phone reception and the lifting of filming restrictions.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe former nuclear power plant’s control room is where engineers shut down the reactor’s cooling pumps as part of a safety test in April 1986, which led to an explosion that killed at least 28 people in the immediate aftermath and contaminated the surrounding area.\n\nBefore the recent commitment to re-imagining the site as a tourist attraction, visitors could only view the power plant from the outside, as well as visit the eerily deserted town of Pripyat and its dilapidated buildings and never-used Ferris wheel.\n\nShape Created with Sketch. Illegal tour of Chernobyl visits forgotten sites Show all 25 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Illegal tour of Chernobyl visits forgotten sites 1/25 Evening in the ghost town of Pripyat John Levin 2/25 A gas mask hangs in a building inside the Chernobyl Exclusion Zone Ryan Longstaff/SWNS 3/25 Remains of Soviet propaganda in one of the barracks of the abandoned anti-aircraft base Volkhov near the Chernobyl NPP John Levin 4/25 The shell of a television stands inside a building in the Chernobyl exclusion zone Ryan Longstaff/SWNS 5/25 A children's play area inside the Chernobyl exclusion zone Ryan Longstaff/SWNS 6/25 A Soviet-era classroom in the Chernobyl exclusion zone Ryan Longstaff/SWNS 7/25 Tourists inside the Chernobyl exclusion zone Ryan Longstaff/SWNS 8/25 Duga was a Soviet over-the-horizon (OTH) radar system used as part of the Soviet missile defense early-warning radar network John Levin 9/25 In the Pripyat abandoned apartments you can still see the abandoned belongings of evacuated residents of the city John Levin 10/25 \"Ambulance car model RAF-2203 Latvija (nickname Rafik) on the background of the Medical Sanitary Unit 126 in Pripyat. It was a minibus designed and developed by Rīgas Autobusu Fabrika from 1976–1997. They were widely used throughout the USSR as medical cars. Model RAF-2203 also were used in Pripyat\" John Levin 11/25 Remains of Soviet propaganda in one of the barracks of the abandoned anti-aircraft base Volkhov near the Chernobyl NPP Ryan Longstaff/SWNS 12/25 An empty swimming pool inside the Chernobyl exclusion zone Ryan Longstaff/SWNS 13/25 \"Illegal Chernobyl explorers cross the Uzh river in the Chernobyl Exclusion Zone. This is the time when you can safely walk around the abandoned without fear of being caught by the police\" John Levin 14/25 \"A couple of years ago the Ukrainian army began to conduct military exercises in the city of Pripyat. Traces of bullets on the walls and glass of the city are not such a rare phenomenon in Pripyat today\" John Levin 15/25 Interior of a flat in the Chernobyl exclusion zone Ryan Longstaff/SWNS 16/25 \"Chernobyl explorer on the top of huge Soviet radar “Russian woodpecker” or Duga radar. As a rule, we climb up Duga radar at dawn. From a height of 150 metres you have an incredible view of the expanses of the Chernobyl zone\" John Levin 17/25 Interior of a building in the Chernobyl exclusion zone Ryan Longstaff/SWNS 18/25 \"The perimeter of the Chernobyl exclusion zone is protected by barbed wire. But this does not stop the fans of dark tourism\" John Levin 19/25 The Ferris wheel in the amusement park of the ghost city of Pripyat is the hallmark of the city. This ferris wheel was supposed to be launched on May 1, 1986, but the Chernobyl accident destroyed these plans forever John Levin 20/25 \"Pripyat is the main goal of many illegal Chernobyl explorers. To get to the city you need to walk about 40 km on foot. On the way to the ghost town, explorers spend the night in the abandoned villages of the Chernobyl zone\" John Levin 21/25 The Pripyat Ferris Wheel John Levin 22/25 Interior of a flat in the Chernobyl exclusion zone Ryan Longstaff/SWNS 23/25 Interior of a building in the Chernobyl exclusion zone Ryan Longstaff/SWNS 24/25 From inside a kindergarten in the Chernobyl exclusion zone Ryan Longstaff/SWNS 25/25 Another view of the Pripyat Ferris Wheel Ryan Longstaff/SWNS 1/25 Evening in the ghost town of Pripyat John Levin 2/25 A gas mask hangs in a building inside the Chernobyl Exclusion Zone Ryan Longstaff/SWNS 3/25 Remains of Soviet propaganda in one of the barracks of the abandoned anti-aircraft base Volkhov near the Chernobyl NPP John Levin 4/25 The shell of a television stands inside a building in the Chernobyl exclusion zone Ryan Longstaff/SWNS 5/25 A children's play area inside the Chernobyl exclusion zone Ryan Longstaff/SWNS 6/25 A Soviet-era classroom in the Chernobyl exclusion zone Ryan Longstaff/SWNS 7/25 Tourists inside the Chernobyl exclusion zone Ryan Longstaff/SWNS 8/25 Duga was a Soviet over-the-horizon (OTH) radar system used as part of the Soviet missile defense early-warning radar network John Levin 9/25 In the Pripyat abandoned apartments you can still see the abandoned belongings of evacuated residents of the city John Levin 10/25 \"Ambulance car model RAF-2203 Latvija (nickname Rafik) on the background of the Medical Sanitary Unit 126 in Pripyat. It was a minibus designed and developed by Rīgas Autobusu Fabrika from 1976–1997. They were widely used throughout the USSR as medical cars. Model RAF-2203 also were used in Pripyat\" John Levin 11/25 Remains of Soviet propaganda in one of the barracks of the abandoned anti-aircraft base Volkhov near the Chernobyl NPP Ryan Longstaff/SWNS 12/25 An empty swimming pool inside the Chernobyl exclusion zone Ryan Longstaff/SWNS 13/25 \"Illegal Chernobyl explorers cross the Uzh river in the Chernobyl Exclusion Zone. This is the time when you can safely walk around the abandoned without fear of being caught by the police\" John Levin 14/25 \"A couple of years ago the Ukrainian army began to conduct military exercises in the city of Pripyat. Traces of bullets on the walls and glass of the city are not such a rare phenomenon in Pripyat today\" John Levin 15/25 Interior of a flat in the Chernobyl exclusion zone Ryan Longstaff/SWNS 16/25 \"Chernobyl explorer on the top of huge Soviet radar “Russian woodpecker” or Duga radar. As a rule, we climb up Duga radar at dawn. From a height of 150 metres you have an incredible view of the expanses of the Chernobyl zone\" John Levin 17/25 Interior of a building in the Chernobyl exclusion zone Ryan Longstaff/SWNS 18/25 \"The perimeter of the Chernobyl exclusion zone is protected by barbed wire. But this does not stop the fans of dark tourism\" John Levin 19/25 The Ferris wheel in the amusement park of the ghost city of Pripyat is the hallmark of the city. This ferris wheel was supposed to be launched on May 1, 1986, but the Chernobyl accident destroyed these plans forever John Levin 20/25 \"Pripyat is the main goal of many illegal Chernobyl explorers. To get to the city you need to walk about 40 km on foot. On the way to the ghost town, explorers spend the night in the abandoned villages of the Chernobyl zone\" John Levin 21/25 The Pripyat Ferris Wheel John Levin 22/25 Interior of a flat in the Chernobyl exclusion zone Ryan Longstaff/SWNS 23/25 Interior of a building in the Chernobyl exclusion zone Ryan Longstaff/SWNS 24/25 From inside a kindergarten in the Chernobyl exclusion zone Ryan Longstaff/SWNS 25/25 Another view of the Pripyat Ferris Wheel Ryan Longstaff/SWNS\n\nAll of the town’s 50,000 inhabitants were evacuated after the accident, leaving it a ghost town.\n\nHowever, journalists got a first-look at the control room as part of the launch of 21 new tourist routes.\n\nThe room, located under a 36,000-tonne steel containment arch, still has its original display screens and panels of command buttons.\n\nVisitors are only permitted to be in there for a few minutes to prevent overexposure to radiation; respirators, helmets and protective clothing are all provided for those brave enough to venture inside.\n\nAn estimated 200 tonnes of radioactive fuel remain contained inside the plant.\n\nHowever, this is unlikely to put people off based on recent visitor growth.\n\nTourist numbers, already on the up, were given an extra boost by the popular HBO series, Chernobyl, which was released in May. More than 87,000 people have visited Chernobyl so far this year, up from 72,000 in 2018.\n\n“Chernobyl has been a negative part of Ukraine’s brand,” President Zelensky has said previously. “The time has come to change this.\n\n“We will create a green corridor for tourists. Chernobyl is a unique place on the planet where nature was reborn after a huge man-made disaster.”\n\nHe added: “We have to show this place to the world: to scientists, ecologists, historians and tourists.”", "description": "The control room of Chernobyl’s reactor four, the site of the world’s most devastating nuclear catastrophe, is to open to tourists. The Ukrainian government is throwing open the doors of the facility to the public for the first time, as part of a bigger overhaul to make the disaster zone more tourist-friendly.", "authors": ["Helen Coffey"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/02/12/Chernobyl-control-room.jpg"}