{"pub": "yahoo", "url": "https://news.yahoo.com/3-5-magnitude-earthquake-hit-170710460.html", "downloaded_at": "2019-10-06 03:14:46.157982+00:00", "title": "A 3.5 magnitude earthquake hit south of San Francisco", "language": "en", "text": "Mario Anzuoni/Reuters\n\n\n\n\n\nA 3.5 magnitude earthquake hit Colma, which is south of San Francisco, on Saturday morning.\n\nThe earthquake had a depth of 4.7 miles, and there have been no reports of damage from the earthquake so far.\n\nAccording to experts, California has not experienced a major earthquake in around 25 years, which means a massive quake could be yet to come.\n\nVisit Business Insider's homepage for more stories.\n\nResidents of San Francisco and its surrounding area woke up Saturday morning to a 3.5 magnitude earthquake.\n\nThe earthquake hit just south of San Francisco at 8:41 a.m. local time, according to the US Geological Survey. The epicenter was just west of Colma, which is in San Mateo County and south of San Francisco.\n\nThe earthquake had a depth of 4.7 miles, but there have been no reports of damage from the earthquake so far.\n\nColma was founded as a necropolis and known as \"The City of the Dead\" or the \"City of Souls.\" This is because of its vast cemeteries. Dead people outnumber alive people by 1,000 to 1. There are 1.5 million people buried there, and 1,509 residents, according to the city's website.\n\nThose who felt the earthquake are welcome to report their experience to the USGS.\n\nAccording to experts, California has not experienced a major earthquake in around 25 years, which means a massive quake could be yet to come.\n\nNOW WATCH: Nxivm leader Keith Raniere has been convicted. Here's what happened inside his sex-slave ring that recruited actresses and two billionaire heiresses.", "description": "A 3.5 magnitude earthquake hit west of Colma, which is just south of San Francisco. Colma is known as \"The City of the Dead\" because of its cemeteries", "authors": ["Rosalie Chan"], "top_image": "https://s.yimg.com/uu/api/res/1.2/pIwqduHthcw45qfKbBiofw--~B/aD0xMTk2O3c9MTU5NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/business_insider_articles_888/0b09326fdfd6b6c9aa8644b90776fe06", "published_at": "2019-10-05"}