{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7562651/Mason-Mount-gone-battling-Championship-starting-Chelsea-England-year.html", "downloaded_at": "2019-10-11 20:36:26.537397+00:00", "title": "Mason Mount has gone from battling in the Championship to starting for Chelsea and England in a year", "language": "en", "text": "In October 2018 Mason Mount featured as Derby drew 1-1 away to QPR in the Championship.\n\nFast forward a year and, having established himself as one of Chelsea's most important players, the midfielder is is in line to make his first start for England in the Euro 2020 qualifier away to Czech Republic on Friday night.\n\nMount now has an opportunity to cement a place in the starting lineup for Gareth Southgate's side, and the 20-year-old possesses qualities that can be extremely useful for England.\n\nChelsea midfielder Mason Mount is set to make his first start for England vs Czech Republic\n\nPrior to this season Mount hadn't made a competitive appearance for Chelsea's first-team, instead gaining experience on loan, firstly at Vitesse and then at Derby under Frank Lampard.\n\nDerby may not have made it to the Premier League, but Mount did and he has looked at home on the big stage, appearing undaunted when taking on high-profile opponents.\n\nMount's goal for Chelsea against Southampton came as a result of his excellent pressing\n\nAfter playing under Frank Lampard at Derby in the Championship, Mount is now in the top tier\n\nAlready this season he has mustered four Premier League goals in eight appearances. England are certainly in need of a goalscoring midfielder - Ross Barkley is the only midfielder in the current squad to have scored for his country - and Mount could fill that void.\n\nMount's key strength, though, is his pressing, with the youngster frequently forcing opponents into squandering possession.\n\nHe is unafraid to compete in aerial battles, as demonstrated by the build up to his goal in Chelsea's victory against Southampton last weekend.\n\nMount did well to win an aerial battle against Southampton's Yan Valery last weekend\n\nSouthampton temporarily win the ball back but it falls to Jorginho, who finds Willian\n\nMount makes an excellent run into the penalty area and Willian finds him with a neat pass\n\nMount latches onto the ball and then finishes adroitly, with Chelsea going 2-0 up\n\nAfter a goal kick from Angus Gunn, Mount did well to beat Southampton defender Yan Valery to win a header.\n\nSouthampton temporarily regained possession but they were put under pressure and Jorginho then found Willian, who picked out Mount, with the latter having made an intelligent run before scoring.\n\nAlthough he has only been in the team for a couple of months, Mount's importance to Chelsea cannot be underestimated.\n\nWhen Chelsea faced Valencia at Stamford Bridge in the Champions League last month, Lampard's side started well, with the effervescent Mount at the very heart of proceedings.\n\nHowever, Mount had to be taken off with an injury in the 16th minute and Chelsea struggled thereafter, with Valencia eventually prevailing with a 1-0 win.\n\nChelsea lost control of the game against Valencia after Mount was taken off due to injury\n\nFor England, Mount will relish playing behind an attack which has been heralded as one of the most dangerous in world football.\n\nHarry Kane can certainly benefit from Mount's precise passes, while Raheem Sterling and Jadon Sancho will also hope to be found with regularity.\n\nMount's goal threat and ability to make late runs into the box will surely benefit England\n\nMount and Sancho previously played together for England Under-19s, so will already have some understanding of how each other play. In addition, Mount is very close friends with Declan Rice, who was previously at Chelsea's academy and he has of course already shown how well he links up with Tammy Abraham.\n\nHaving steadily risen through the ranks at international level - first playing for England Under-16s in 2014 - Mount now deserves his chance in the spotlight.\n\nEngland's talented attackers will surely benefit from Mount's excellent passes\n\nHe has already featured twice as a substitute for the senior side, but he has an opportunity to truly show his worth, with James Maddison's withdrawal from the squad through illness having played into Mount's hands.\n\nMount is versatile, too, and can play on the left wing if needed, but for England he is most likely to be deployed as a No 10, where he can dictate play to excellent effect.\n\nAs you would expect, Mount is superb at retaining possession - he has recorded a pass completion rate of over 80 per cent in six of his league games this season (via Whoscored) - but it is his quality of passing, especially in the final third, which proves so difficult for defenders to deal with.\n\nMount made an excellent run into the box in Chelsea's victory away to Norwich\n\nHaving burst into the box, Mount then demonstrated his excellent close control\n\nMount intelligently managed to confuse the Norwich defence by shifting the ball inside\n\nAfter managing to make space for himself Mount scored with an emphatic finish\n\nFurthermore, Mount possesses excellent close control and is adept at making late runs into the box. He did so to great effect against Norwich at Carrow Road in August, bursting into the penalty area and fooling the Canaries' defence by shifting the ball inside and then scoring.\n\nDuring his time in charge of England, Southgate has shown that he isn't afraid to give young players opportunities. Mount is the next in line, and if he manages to use his aforementioned qualities to full effect, he could soon become as important for England as he is for Chelsea.", "description": "In October 2018 Mason Mount featured as Derby drew 1-1 away to QPR in the Championship. Fast forward a year and the midfielder is is in line to make his first start for England.", "authors": ["Jeorge Bird For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/12/19585564-0-image-a-59_1570793913019.jpg", "published_at": "2019-10-11"}