{"pub": "businessinsider", "url": "https://businessinsider.com/trump-tweets-syria-show-no-plan-help-kurds-2019-10", "downloaded_at": "2019-10-10 15:19:05.116525+00:00", "title": "Trump's latest tweets on Syria show he has absolutely no plan to help the Kurds as Turkey boasts about killing over 100 of them", "language": "en", "text": "Tweets from President Donald Trump on Thursday showed he has no plan to help Kurdish fighters facing a Turkish military incursion in Syria.\n\n\"I say hit Turkey very hard financially & with sanctions if they don't play by the rules! I am watching closely,\" he said, with no specific plan of action indicated.\n\nTrump has been broadly criticized for a recent decision to pull US troops from northeast Syria, where Kurds are now facing the Turkish military operation.\n\nMeanwhile, Turkish President Recep Tayyip Erdogan on Thursday boasted that over 100 people had been killed in the operation so far.\n\nTurkey's military launched the operation into Syria on Wednesday.\n\nPresident Donald Trump on Thursday continued to defend his decision to abandon the Kurds in northeast Syria in tweets that showed he has no specific plan to thwart the Turkish military operation pummeling Kurdish fighters who bore the brunt of the US-led campaign against ISIS.\n\nTrump also seemed to suggest that the Turkish assault was inevitable, though it only began after he pulled US troops from the region.\n\n\"Turkey has been planning to attack the Kurds for a long time. They have been fighting forever. We have no soldiers or Military anywhere near the attack area. I am trying to end the ENDLESS WARS. Talking to both sides. Some want us to send tens of thousands of soldiers to the area and start a new war all over again,\" Trump said. \"Turkey is a member of NATO. Others say STAY OUT, let the Kurds fight their own battles (even with our financial help).\"\n\nHe added: \"I say hit Turkey very hard financially & with sanctions if they don't play by the rules! I am watching closely.\"\n\nTrump's tweets came after Turkish President Recep Tayyip Erdogan boasted that more than 100 people had been killed in the air and ground offensive in Syria so far. The military operation began on Wednesday.\n\nErdogan in a Thursday speech to members of his AK Party said \"109 terrorists\" had been killed in the military incursion, though it's unclear if all were linked to the Kurdish-led Syrian Democratic Forces (SDF), NBC News reported. The SDF played a vital role in the US-led fight against ISIS that brought about the collapse of the terrorist organization's so-called caliphate.\n\nThis article will continue to be updated.", "description": "\"I am watching closely,\" Trump said of Turkey's military operation against the Kurds, with no indication of a specific plan of action on the horizon.", "authors": ["John Haltiwanger"], "top_image": "https://image.businessinsider.com/5d9f3b71122bd510b2033273?width=1200&format=jpeg", "published_at": "2019-10-10"}