{"pub": "zdnet", "url": "https://www.zdnet.com/article/apple-releases-ios-13-1-and-ipados-just-days-after-ios-13-launched", "downloaded_at": "2019-09-25 04:38:21.570597+00:00", "title": "Apple releases iOS 13.1 and iPadOS, just days after iOS 13 launched", "language": "en", "text": "The best new features in iOS 13 With iOS 13 set to roll out on September 19, ZDNet's Beth Mauder walks you through her five favorite new features and how you can add them to your iPhone. Read more: https://zd.net/2QbuNNR\n\nLess than a week after rolling out iOS 13, Apple has released iOS 13.1 and the initial release of iPadOS. Apple had previously stated the update would be available Sept. 30 but moved up the date after the release of iOS 13 last Thursday. Included in the update are several new features, and, hopefully, bug fixes, stability improvements, and overall performance gains.\n\nNew in iOS 13.1 is the ability to share your phone's audio with another AirPods user, sharing your ETA in Apple Maps, new Shortcuts features, and a new enterprise feature called User Enrollment for BYOD users. The feature protects corporate data by partitioning the device's hard drive, separating things like managed accounts, data, and apps from the personal information stored on the device.\n\nThe first release of iPadOS brings with it a new desktop-class version of Safari that now works with sites like Wordpress and Google Docs, along with more multitasking features and even mouse support.\n\nThe update is now available for iPhone, iPad, and iPod touch users. You'll need to open the Settings app on your iOS device and go to General > Software Update to download and install the update. It's a good idea to get your device ready before you install the update.", "description": "The update will hopefully fix several bugs, as well as add new enterprise features.", "authors": ["Jason Cipriani"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2019/09/19/146c39f3-a392-44ca-b76b-faa92499d5ca/thumbnail/770x578/b7ea788ac6cabe8a2b8b1b2d9666bcfa/dscf0609.jpg", "published_at": "2019-09-24"}