{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/09/WS5d9d326fa310cf3e3556f4c4.html", "downloaded_at": "2019-10-09 02:11:41.685352+00:00", "title": "City girl seeds scents of hope in remote region", "language": "en", "text": "Xinhua | Updated: 2019-10-09 09:05\n\nHong Kong-born Annie Leung still remembers her first visit to the remote mountains of Southwest China's Guizhou province in 2017, and the memories of the wild leeks covering the rolling hills remain fresh in her mind.\n\n\"At that moment, it felt like I was in a fairy tale,\" Leung recalls.\n\nLeung's first trip was not for leisure, but instead to develop business opportunities to help the poverty-stricken inhabitants of Wumeng Mountain, Hezhang county, where finding work in big cities had long been the only way out of hardship for local villagers.\n\nWith its high altitude and favorable climate, flower growing soon became the main focus for the 28-year-old general manager of Guangzhou-based Ganghua Agricultural Technology.\n\nIn the year after her first visit, Leung and her team of professionals traveled around dozens of towns and villages in the county, looking for suitable growing conditions.\n\nShe began to implement her plan as the company signed an investment agreement with the Hezhang officials in May 2018 to build a pastoral complex and a flower-growing center, with the aim of raising the incomes of poor local households.\n\nHowever, it was no easy decision for the young urbanite, who was raised by a nanny and spent her college years in the United States, to pursue a career back home after meeting students from the Chinese mainland.\n\n\"At that time, I seldom did chores, let alone work in the fields,\" she says.\n\nHer journey has not been easy, even though Leung and her team had come prepared. The language barrier and dietary differences affected Leung's employees, who were mostly Cantonese.\n\n\"There even used to be doubts about the choice of location,\" Leung says. \"But these soon disappeared when we saw local officials work night and day to help bring people out of poverty.\"\n\nLeung worked hard to persuade local farmers to plant seedlings with tweezers to improve survival rates, rather than rely on traditional crops like potatoes or corn.\n\nThe local farmers eventually learned that lavender could be used to extract essential oils and make sachets, while coreopsis flowers were ideal for making high-quality scented tea.\n\nLeung's team completed trial plantations of more than 30 varieties of chrysanthemums in 2018 and introduced lavender and sakura seeds from Hokkaido. The seedling project has since generated over 2 million yuan ($280,391) in income for local rural households.\n\nGanghua took its products to Guangzhou, where they proved popular at the 27th Guangzhou Fair held in late August. Leung is also considering retailing their products on the internet.\n\nThis initial success has also boosted Leung's confidence. She now plans to start a demonstration center to inspire more young people from the Guangdong-Hong Kong-Macao Greater Bay Area to join the poverty-reduction cause.\n\n\"Younger generations of Hong Kong people should take on the responsibility of helping in the fight against rural poverty,\" she says.", "description": "Hong Kong-born Annie Leung still remembers her first visit to the remote mountains of Southwest China's Guizhou province in 2017, and the memories of the wild leeks covering the rolling hills remain fresh in her mind.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/09/5d9d326fa310cf3e97a03286.jpeg", "published_at": "2019-10-09"}