{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7586965/Copper-ticks-higher-bleak-China-data-fans-stimulus-hopes.html", "downloaded_at": "2019-10-18 05:01:00.149587+00:00", "title": "Copper ticks higher as bleak China data fans stimulus...", "language": "en", "text": "By Mai Nguyen\n\nSINGAPORE, Oct 18 (Reuters) - Copper prices rose on Friday as dismal economic growth data from China raised hopes of more stimulus measures, while expectations of a soft Brexit and easing U.S.-China trade tensions lifted sentiment.\n\nChina's economic growth slowed slightly more than expected to 6% year-on-year in the third quarter, the weakest pace in almost three decades.\n\n\"The data is (actually) in line with expectations from many analysts in China,\" said a metals trader, adding the country is likely to roll out stimulus measures in sectors such as real estate and infrastructure to boost growth.\n\nThe trader added that China would want to pick up its growth rate in the fourth quarter in order to achieve the country's full-year growth target of 6.0%-6.5%.\n\nThree-month copper on the London Metal Exchange (LME) rose 0.1% to $5,745 a tonne by 0408 GMT, while the most-traded copper contract on the Shanghai Futures Exchange (ShFE) edged up 0.04% to 46,650 yuan ($6,592.15) a tonne.\n\nCopper prices are widely used as a gauge of economic health, which has been hurt by the prolonged trade war between the United States and China, as well as volatilities caused by the lengthy Brexit negotiations.\n\nEuropean Union leaders unanimously backed a new Brexit deal with Britain on Thursday, while China's commerce ministry said China hoped to reach a phased agreement with the United States.\n\nWorld Bank President David Malpass said that clarity over Britain's exit from the European Union would strengthen the outlook for global growth.\n\nFUNDAMENTALS\n\n* CHINA DATA: China's industrial output grew a better-than-expected 5.8% in September, while fixed asset investment grew 5.4% from January-September, matching what analysts had tipped, but slowing from the 5.5% pace in the first eight months.\n\n* CHINA ALUMINIUM: China's aluminium production fell 1.6% from a year earlier, to 2.90 million tonnes in September, official data showed, amid ongoing outages at two key smelters.\n\n* COPPER: MMG Ltd says it expects its Las Bambas mine's production to fall marginally below its forecast after road blockages delayed some copper shipments to its customers.\n\n* TIN: ShFE tin hit its highest since Sept. 12 at 141,970 yuan a tonne, after top refined tin producer Yunnan Tin said it would halt some production. LME tin fell 0.4% after hitting its highest since Sept. 13 on Thursday.\n\n* PRICES: LME aluminium fell 0.1%, nickel rose 0.1%, zinc declined 0.6% and lead dipped 0.3%. Shanghai aluminium advanced 0.1%, nickel fell 0.7% and zinc dipped 0.1%.\n\n* ZINC: Zinc treatment and refining charges are expected to stay at high levels due to rising mine supply from Australia and South Africa.\n\n* BAUXITE: Mining operations in Guinea, Africa's biggest bauxite producer, returned to normal on Thursday after days of slowed production caused by political protests.\n\n* For the top stories in metals and other news, click or\n\nPRICES\n\nThree month LME copper\n\nMost active ShFE copper\n\nThree month LME aluminium\n\nMost active ShFE aluminium\n\nThree month LME zinc\n\nMost active ShFE zinc\n\nThree month LME lead\n\nMost active ShFE lead\n\nThree month LME nickel\n\nMost active ShFE nickel\n\nThree month LME tin\n\nMost active ShFE tin\n\nARBS ($1 = 7.0766 Chinese yuan) (Reporting by Mai Nguyen; Editing by Rashmi Aich and Amy Caren Daniel)", "description": "By Mai NguyenSINGAPORE, Oct 18 (Reuters) - Copper prices rose on Friday  as dismal economic growth data from China raised hopes of more  stimulus measures,...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-18"}