{"pub": "investing.com", "url": "https://in.investing.com/analysis/fundamental-pick--idfc-bank-india-200431803", "downloaded_at": "2019-09-04 00:14:54.869693+00:00", "title": "Fundamental Pick - IDFC Bank (India)", "language": "en", "published_at": "2019-09-03", "text": "We often see the claims that if you invested Rs. 1 Lac in x company in 1990, you would've made Rs. 10 crore by now etc. etc. Well, the stock market is all about post-mortems. Such multi-baggers do attract many newcomers into the stock market and they invest here and there in search of such stocks and get trapped. Therefore, the million-dollar question is - Can you find a stock \"now\" which will become a multi-bagger in the future? We suddenly feel a pin drop silence after this question. The present moment is the key, not the past. We can learn from the past but can not go in past to invest. Past multi-baggers and their post-mortems do tell us what qualities we should see in a good stock but again cut to present and try to make a choice. Again silence! I mean if you choose a particular stock which passes all criteria of value investing and all things are fine, wouldn't it already be fair or overvalued? It's a Catch-22. So, where's the solution?\n\nIn our view, out of so many factors, most important to look out for is - Quality of Management Team. Other things also play their role, but in order to find a stock which is presently undervalued but having the potential for future gains, you'll have to look at the candidates which are averagely placed as of now but having good quality management. If the management team is good, they will clear all problems and will deliver good results in the long term. In Indian Markets, we see one such stock which we are recommending for medium to long and very long term: IDFC (NS: ) First Bank. The new entity after the merger is headed by Mr. Vaidyanathan, who was at the forefront of the Retail Lending revolution which changed the face of the Indian economy at the beginning of this century. The stock is available at dirt-cheap prices if you compare the MPBV (Market Price to Book Value) Ratio with peers. We recommend accumulating this share on a systematic basis.", "description": "Shares Analysis by Windfall India covering: IDFC Ltd. Read Windfall India's latest article on Investing.com India.", "authors": [], "top_image": "https://in.investing.com/analysis/not found"}