{"pub": "usatoday", "url": "https://usatoday.com/story/sports/highschool/2019/10/22/high-school-football-team-forfeits-games-fires-coaches-cancels-season/40358167", "downloaded_at": "2019-10-22 13:20:41.951747+00:00", "title": "HS football team forfeits all games, fires all coaches, cancels season after illicitly using ineligible player", "language": "en", "text": "One of Missouri's storied high school football programs pressed the self destruct button after it was found to have illegally played an ineligible player in Week 1, attempted to cover it up by having him wear a different jersey number, and then denied it happened.\n\nCardinal Ritter College Prep, a St. Louis Catholic school with a proud football tradition, forfeited all its games for use of an ineligible player, then chose to cancel the entire season rather than continue playing under a coaching staff that was also \"permanently released\" from its duties in the aftermath of the scandal.\n\nAt the heart of the issue is a suspension from the 2018 Missouri state championship game, an elaborate plan to evade that suspension, a revealing tattoo and eventually, an embarrassment that has now led to the toppling of the entire coaching staff.\n\nThe entire episode started when running back Bill Jackson was ejected from the 2018 Class 3 state championship game. As a result, Jackson was forced to serve a one-game suspension at the start of the 2019 season in connection with that ejection, which should have sidelined him for the start of the 2019 season against Nazareth Academy in an August game in the Chicago suburbs.\n\nIndeed, it appeared as though Jackson was sitting out the Cardinal Ritter season opener, but as it turns out, he was simply wearing a different jersey and assuming a false identity. The plan was foiled when a STLHighSchoolSports.com investigation noticed that Jackson's right arm tattoos bore a stunning resemblance to the ones on the arm of an alleged freshman player named Marvin Burks.\n\nAfter they were caught in the scheme, Ritter coach Brandon Gregory spoke to local TV outlets and repeatedly said, \"a mistake was made,\" which obliquely acknowledged the Jackson incident, but did not address how he and Jackson had also acted as if he had not participated in Week 1 after the game.\n\nBecause Jackson had not sat out his required game, all seven of Ritter's wins in an undefeated season had to be forfeited. In an effort to sate officials for the Missouri State High School Activities Association, the school decided to proactively cancel the remainder of its season as well.\n\nWith no wins, no future games and no recourse to salvage the season, the MSHSA accepted Ritter's self imposed penalties, including the dismissal of the entire coaching staff.\n\nThe leader of that staff, Gregory, led the program from January of 2016, finishing with a mark of 28-8, including the aforementioned state final berth in 2018. It remains unknown when Ritter will launch a coaching search to fill Gregory's position. For now, everyone around the community is still trying to come to grips with the fact that he and the entire season are over.", "description": "Cardinal Ritter College Prep canceled its entire football season and fired all its coaches after a scandal focused on an ineligible player cover-up.", "authors": ["Cam Smith", "Usa Today High School Sports", "High School Sports", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/a62885feae177d76558f8f81f5dcba3ed846b9b6/c=0-110-1838-1144/local/-/media/2019/10/22/USATODAY/usatsports/screen-shot-2019-10-22-at-1.04.14-am.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-22"}