{"pub": "cbc", "url": "https://cbc.ca/cbcdocspov/features/can-cannabis-reduce-opioid-use-in-addicts-anecdotal-reports-inspire-study-i", "downloaded_at": "2019-09-09 23:18:51.635803+00:00", "published_at": "2019-09-09", "title": "Saving Rabbit: Can cannabis reduce opioid use in addicts? Anecdotal reports inspire study in Toronto", "language": "en", "text": "By CBC Docs\n\nIn 1999, John was pinned down by a car in the auto repair shop where he worked. The injury left him in pain and dependent on prescription opioids for two decades. “Now I’m on Percocet, fentanyl, Remeron, anti-inflammatory [pills], sleeping pills, stomach medication, so you’re taking like 12 pills a night. You’re addicted,” he says.\n\nJohn says he needs these pills just to get through the day. “I don’t want to be high. I want to be able to function. But one day, hopefully, I won’t need fentanyl anymore.”\n\nIn the CBC Docs POV documentary Saving Rabbit, John turns to CBD and THC oil to help curb his opioid addiction.\n\nAfter starting medicinal cannabis, John is down from taking 11 pills each night to two and two halves. “I think marijuana is a far healthier choice, and it seems to work,” he says.\n\nTo find out more about how cannabis may help people with their opioid addictions, we talked to Dr. Hance Clarke, medical director of the pain research unit at Toronto General Hospital.\n\nCannabis legalization may reduce opioid deaths\n\nLegalizing cannabis may have a role to play in decreasing opioid mortality rates. “It’s an evolving idea that was thrust into the forefront when U.S. states legalized cannabis,” says Clarke. “Opioid mortality dropped in those states.”\n\nOne U.S. study, published this summer in Economic Inquiry, showed that recreational marijuana laws reduced annual opioid mortality between 20 and 35 per cent, particularly in people addicted to synthetic opioids such as fentanyl.\n\nLegalization also seems to have an effect on prescription opioid use. Researchers in the U.S. found that in states where medical marijuana was legalized, Medicare patients filled prescriptions for around 14 per cent fewer daily doses of opioids than patients in other states.\n\nThere is a lot of skepticism in the Canadian medical community about cannabis, including using it as a treatment for pain. According to Clarke, only one per cent of doctors prescribe it, despite Canada’s legalization of medical cannabis in 1999 and the establishment of a commercial medical cannabis industry in 2013.\n\n“We know that there is something there,” says Clarke, “but so far, every patient has been trial and error.” Doctors are reluctant to prescribe cannabis without unbiased, peer-reviewed research to support its benefits, he explains.\n\nIs CBD the magic ingredient? More research is needed\n\nClarke says researchers currently aren’t certain which component of cannabis may make it effective in treating pain: THC (the main psychoactive compound found in cannabis), CBD (another compound found in cannabis that does not cause a high) or a combination of both.\n\nWhile CBD impacts the dopamine and serotonin systems in the central nervous system and may have some anti-inflammatory effects, Clarke says, “the story on CBD is certainly not clear-cut.”\n\nThe pot industry is selling pain patients on the merits of CBD oil without research to back up their claims, he adds. And generally, says Clarke, “people probably aren’t taking enough of it to work, so it’s not as effective as it’s claimed to be.”\n\nBut Clarke has seen patients like John, thousands of them, who have been able to reduce their reliance on opioids after trying cannabis. He says it’s worth studying because cannabis has fewer side effects and is, overall, much less addictive than opioids.\n\nStill, doctors need to know how much of what product to give patients to see reliable effects in pain reduction, Clarke notes. In particular, more research is needed on oil products because “lots of people smoke cannabis for pain relief, but you’ll never get the medical community to support smoking.”\n\nLarge-scale study planned in Toronto\n\nCanada is currently the only country in the world with a legal framework for both recreational and medicinal cannabis, which allows researchers like Clarke to lead the way in studying cannabis-based medicine safety and educating the public.\n\nNext year, his team at the University Health Network will embark on the first controlled study where doctors will use cannabis to reduce their patient’s dependence on prescription opioids. They’ll separate patients into groups to study the effectiveness of CBD, THC, and CBD and THC, and compare them to a placebo group.\n\nClark notes that it will be the first study that has not been funded by a cannabis producer. In fact, the researchers hope to test out a range of products from several producers. “We hope, in five or 10 years, to get the information we need in order to standardize treatments so people can get reliable products,” he says.\n\nWhat can patients do in the meantime? Talk to your GP, he recommends, and check out credible sources of information about cannabis on new portals like the one from Shoppers Drug Mart.", "description": "", "authors": ["Cbc Docs"], "top_image": ""}