{"pub": "japantoday", "url": "https://japantoday.com/category/features/health/People-don't-recognize-heart-attacks-when-symptoms-come-on-slowly", "downloaded_at": "2019-10-07 00:12:23.876187+00:00", "title": "People don't recognize heart attacks when symptoms come on slowly", "language": "en", "text": "By Vishwadha Chander\n\nWhen heart attack symptoms start gradually and don't follow exertion, patients are much slower to get to an emergency room and risk missing a critical window for preserving heart function, researchers say.\n\nAmong 474 U.S. patients who arrived in emergency departments with dangerous reductions in blood flow to the heart, those whose symptoms had come on gradually took up to six hours longer than recommended to call for medical help and get to the hospital, the researchers found.\n\nGradual symptoms were not recognized or taken seriously, despite reflecting a medical emergency, and patients took up to eight hours to get help compared with an average of 2.57 hours among those with abrupt or sudden symptoms, the research team reported in the European Journal of Cardiovascular Nursing.\n\nThe American Heart Association recommends that heart attack patients receive care within less than two hours to provide the best chance of avoiding permanent damage to the heart muscle.\n\nIn a sudden heart attack, patients have severe pain from the start. But symptoms of a gradual attack - mild discomfort, breathing trouble and tightness of the chest - are not so obvious, the authors note.\n\n\"Heart attack victims must not worry their symptoms might be a false alarm,\" said Dr Sahereh Mirzaei of the University of Illinois at Chicago, who led the new study. \"Call 911 and get to the emergency department quickly.\"\n\nThe authors analyzed data on patients participating in a larger, multi-state study. The current analysis focused on 343 men and 131 women, ages 29 to 93, who were admitted to hospital emergency department with what was later confirmed to be acute coronary syndrome, which includes conditions that suddenly reduce blood flow to the heart such as heart attacks and unstable angina.\n\nNearly half of the respondents, 44%, reported a gradual onset of symptoms; the rest reported abrupt symptoms. And half of the patients took four hours or more to get to the hospital.\n\nBeing uninsured and having gradual symptom onset were the factors most strongly associated with a longer delay. Having sudden symptoms, or symptom onset after exertion, were strongly tied to getting to the hospital quickly.\n\nPeople with a heart condition, type 2 diabetes, high blood pressure, or who are smokers, may be at greater risk and should be alert to gradual symptoms, especially after physical exertion, Mirzaei said.\n\n\"People with gradual symptoms don't describe what they are feeling as pain, just pressure and tightness. Doctors must explain that tightness and pressure are just as serious,\" said Dr Ashish Jha, a physician and professor at the Harvard T.H. Chan School of Public Health in Boston, who wasn't involved in the study.\n\n\"The innovative part of this study was that the authors tried to examine what slowed people down,\" Jha said.\n\nHe agreed that part of the problem was how patients identified symptoms. \"Whenever there is a new symptom, a lot of people ignore it or try to explain it away.\"\n\nHowever, a bigger study with more patients and data would help understand the issue better, Jha said.\n\nMirzaei noted that there are no public policies to reduce delays in getting to hospitals by helping people recognize their symptoms and seek help quickly.\n\n\"The American Heart Association advises individuals who think they may be having a heart attack to call 911 immediately. Unfortunately, approximately 50% of heart attack victims never call 911,\" she said.\n\n\"Symptoms may come and go, but heart disease does not. Know about your symptoms and seek care immediately,\" Mirzaei said.\n\n© (c) Copyright Thomson Reuters 2019.", "description": "When heart attack symptoms start gradually and don't follow exertion, patients are much slower to get to an emergency room and risk missing a critical window for preserving heart function, researchers say. Among 474 U.S. patients who arrived in emergency departments with dangerous reductions in blood flow to the heart,…", "authors": [], "top_image": "https://japantoday.com/images/japan-today-social.jpg", "published_at": "2019-10-06"}