{"pub": "nymag", "url": "https://vulture.com/2019/09/emmy-predictions-2019.html", "downloaded_at": "2019-09-20 23:07:07.837185+00:00", "title": "Emmy Predictions 2019: Who Will Win This Year?", "language": "en", "text": "Julia Louis-Dreyfus is a shoo-in for another Emmy. Photo: HBO\n\nThe 71st Emmy Awards air this Sunday, September 22. Which nominees will take home Emmy gold? And who should win, but won’t? Lucky for your awards pool, Vulture staffers Jen Chaney, Matt Zoller Seitz, and Kathryn VanArendonk are here to break down their expert Emmy predictions for the major contenders in comedy, drama, limited series, and variety series.\n\nOutstanding Comedy Series\n\nPhoto: Steve Schofield/Amazon\n\n• Barry (HBO)\n\n• Fleabag (Amazon)\n\n• The Good Place (NBC)\n\n• The Marvelous Mrs. Maisel (Amazon)\n\n• Russian Doll (Netflix)\n\n• Schitt’s Creek (Pop)\n\n• Veep (HBO)\n\nMore often than not, Emmy voters tend to reward things they’ve rewarded before, which is why Veep previously won in this category three years in a row. But with Veep ineligible last year, The Marvelous Mrs. Maisel was able to swoop in and conquer. So will Maisel repeat? Or will Veep, in its last season, take home a fourth best-comedy Emmy?\n\nLet’s start with what (probably) won’t win. I can’t imagine Schitt’s Creek walking away with an Emmy because the competition is too stiff and the nomination felt like its own reward. The Good Place should have been in this category several years running, and that it took so long to be nominated makes me suspect it doesn’t have a strong chance of winning either.\n\nThat leaves the five comedies that earned the most nominations overall. Russian Doll scooped up 13 nods, which speaks to the fact that it’s well liked and respected. But it might be a little too offbeat and serialized to capture the votes it needs to win. I wouldn’t be surprised if Barry won — its second season was even better than its first — but it would have to get past Mrs. Maisel, Veep, and Fleabag, and that’s a high bar.\n\nIn any other year, I’d say the voters would do what they always do and go with an established previous winner: either The Marvelous Mrs. Maisel or Veep, which would be a fitting way to bid the HBO comedy farewell. But Fleabag has buzz and cultural momentum behind it that the other two don’t. Everyone loves it and they fell in love with it at exactly the right time, just as Emmy voting was getting underway. —Jen Chaney\n\nThe Emmy should (and will) go to … Fleabag.\n\nOutstanding Lead Actor in a Comedy\n\n• Anthony Anderson, Black-ish (ABC)\n\n• Don Cheadle, Black Monday (Showtime)\n\n• Ted Danson, The Good Place (NBC)\n\n• Michael Douglas, The Kominsky Method (Netflix)\n\n• Bill Hader, Barry (HBO)\n\n• Eugene Levy, Schitt’s Creek (Pop)\n\nI’ll get right to the point: This one is going to Bill Hader for the second year in a row. No other performance in this category comes close to having all the different layers that Hader’s does.\n\nBut let’s run through them nonetheless. I feel the same way about Levy’s nomination that I do about Schitt’s Creek’s for outstanding comedy: nice to be nominated, but probably won’t win. This is Anthony Anderson’s fifth nomination for Black-ish; he’s never won and I don’t see that changing this year. Cheadle is one of the high points of Black Monday, but some voters may not even be familiar with such an under-the-radar cable series. Danson is a treasure on The Good Place, but I think there’s more support for Barry than NBC’s existential comedy.\n\nThere’s a chance that Douglas could win for Kominsky Method, especially since he’s playing a retired actor, a character that may appeal to people in the industry, especially older members of the Television Academy. But I can’t get past the fact that Barry got 17 nominations, and the show couldn’t be what it is without Hader. —JC\n\nThe Emmy should (and will) go to … Bill Hader for Barry.\n\nOutstanding Lead Actress in a Comedy\n\n• Christina Applegate, Dead to Me (Netflix)\n\n• Rachel Brosnahan, The Marvelous Mrs. Maisel (Amazon)\n\n• Julia Louis-Dreyfus, Veep (HBO)\n\n• Natasha Lyonne, Russian Doll (Netflix)\n\n• Catherine O’Hara, Schitt’s Creek (Pop)\n\n• Phoebe Waller-Bridge, Fleabag (Amazon)\n\nThis category is tough. I can imagine a scenario where any of these women might win. That being said, as terrific as both of them are, Applegate and O’Hara seem like the easiest to rule out. Fleabag has a lot of momentum behind it, but I think it will get rewarded in other categories. Brosnahan could repeat, but I am skeptical of that happening either. Lyonne, who carries Russian Doll with a brash, ballsy, and personal performance that also feels like the completion of a comeback story that began with Orange Is the New Black, would be a fun underdog surprise.\n\nBut come on: It’s got to be Julia Louis-Dreyfus, who has won an Emmy for every single season she’s spent playing Selina Meyer on Veep. She’s as close to a shoo-in as this category has. And having observed her work up close, I think she deserves to win one more time. Her ability to capture 1,000 different emotions in a single scene and to make every line of dialogue sound fresh, take after take, is awe-inspiring. In this season of Veep, she showed us what it looks like when a politician fully shifts to the dark side, and she did it fearlessly. —JC\n\nThe Emmy should (and will) go to … Julia Louis-Dreyfus for Veep.\n\nOutstanding Supporting Actor in a Comedy\n\n• Alan Arkin, The Kominsky Method (Netflix)\n\n• Anthony Carrigan, Barry (HBO)\n\n• Tony Hale, Veep (HBO)\n\n• Stephen Root, Barry (HBO)\n\n• Tony Shalhoub, The Marvelous Mrs. Maisel (Amazon)\n\n• Henry Winkler, Barry (HBO)\n\nThis category is dominated by actors from Barry, including Winkler, who won last year and is a justifiably beloved figure in the industry. He could very well win again … or all the Barry nominees could cancel each other out.\n\nThat would leave Arkin, Hale, and Shalhoub. Of those three, I think Hale and Shalhoub — the two Tonys — have the strongest chances. My hunch is that Shalhoub will ultimately prevail, but by a thin margin. Hale has been a magnificent foil to Louis-Dreyfus throughout Veep and has been nominated six times, winning twice. Shalhoub is also popular among the electorate, who nominated him for all eight seasons of Monk and gave him three Emmys for his role in it. Given the love for Marvelous Mrs. Maisel, I think he would have won last year if it hadn’t felt so right to finally give an Emmy to Winkler. —JC\n\nThe Emmy should go to … Stephen Root for Barry. Winkler is great and Carrigan is the definition of a hoot as Noho Hank, but Root’s performance went to deep and constantly surprising places this season. It’s also Root’s first Emmy nomination. This guy’s been a great actor forever. Give him an award!\n\nBut the Emmy will go to … Tony Shalhoub for The Marvelous Mrs. Maisel.\n\nOutstanding Supporting Actress in a Comedy\n\n• Alex Borstein, The Marvelous Mrs. Maisel (Amazon)\n\n• Anna Chlumsky, Veep (HBO)\n\n• Sian Clifford, Fleabag (Amazon)\n\n• Olivia Colman, Fleabag (Amazon)\n\n• Betty Gilpin, GLOW (Netflix)\n\n• Sarah Goldberg, Barry (HBO)\n\n• Marin Hinkle, The Marvelous Mrs. Maisel (Amazon)\n\n• Kate McKinnon, Saturday Night Live (NBC)\n\nMcKinnon has won this award twice, but I don’t think she’ll snag it a third time this year. I’m ruling out Hinkle because if anyone from Mrs. Maisel is going to win in this category, it’s Borstein, who won last year. Gilpin is phenomenal on GLOW, but my guess is that GLOW doesn’t have enough broad support among voters to push her over the edge. Goldberg did exceptional work on Barry this season, but I suspect that, like Gilpin, she’ll be overshadowed by other nominees.\n\nClifford is superb on Fleabag as Claire, who got to crack through her hard shell this season and show a softer side (her delivery of the line “I look like a pencil” alone is Emmy-worthy). There’s a chance she could win, but I suspect this will come down to Borstein, last year’s winner, whose rat-a-tat patter on Maisel is something to behold; Chlumsky, who has been nominated for Veep on five previous occasions but still hasn’t won; and Colman, who, in addition to being a spot-on, self-involved stepmother on Fleabag, is also coming off an Oscar win and delightful acceptance speech that endeared her even more to the public. —JC\n\nThe Emmy should go to … Sarah Goldberg for Barry. I don’t think she gets nearly enough credit for making the narcissistic Sally such an empathetic but still very funny character.\n\nBut the Emmy will go to … Olivia Colman for Fleabag. And I won’t be mad about it.\n\nOutstanding Directing for a Comedy Series\n\n• Barry, “The Audition,” Alec Berg (HBO)\n\n• Barry, “ronny/lily,” Bill Hader (HBO)\n\n• The Big Bang Theory, “The Stockholm Syndrome,” Mark Cendrowski (CBS)\n\n• Fleabag, “Episode 2.1,” Harry Bradbeer (Amazon)\n\n• The Marvelous Mrs. Maisel, “All Alone,” Amy Sherman-Palladino (Amazon)\n\n• The Marvelous Mrs. Maisel, “We’re Going to the Catskills!” Daniel Palladino (Amazon)\n\nI’ll just rule out The Big Bang Theory right now, since it’s tough for any multi-camera series, even a very popular one in its final season, to win in this category. I’ll also cross off the Barry episode “The Audition” and Maisel’s “All Alone” because the other episodes from those series are more compelling nominees.\n\nThat leaves us with the nerve-jangling “ronny/lily” from Barry, the glowing nostalgia of “We’re Going to the Catskills!” from Mrs. Maisel, and the all-forward-momentum of the first episode of Fleabag’s second season. I think it’s going to be a really tight race between these three, but I suspect the audacious action sequences of “ronny/lilly” will win the day. —JC\n\nThe Emmy should go to … This is a close call, but I lean toward Fleabag because it’s so tightly constructed and directed by Bradbeer as if he’s visually channeling Waller-Bridge’s voice.\n\nBut the Emmy will go to … “ronny/lily,” as directed by Hader for Barry.\n\nOutstanding Writing for a Comedy Series\n\n• Barry, “ronny/lily,” Alec Berg and Bill Hader (HBO)\n\n• Fleabag, “Episode 2.1,” Phoebe Waller-Bridge (Amazon)\n\n• The Good Place, “Janet(s),” Josh Siegal and Dylan Morgan (NBC)\n\n• PEN15, “Anna Ishii-Peters,” Maya Erskine, Anna Konkle, and Stacy Osei-Kuffour (Hulu)\n\n• Russian Doll, “Nothing in This World Is Easy,” Leslye Headland, Natasha Lyonne, Amy Poehler (Netflix)\n\n• Russian Doll, “A Warm Body,” Allison Silverman (Netflix)\n\n• Veep, “Veep,” David Mandel (HBO)\n\nWouldn’t it be fun if Erskine, Konkle, and Osei-Kuffour won for PEN15? It definitely would be, but unfortunately, I don’t see that happening. I don’t see it happening for Russian Doll or The Good Place either, despite the strength of the writing on both shows. (Side note: It’s bizarre that “Janet(s)” was nominated for writing but D’Arcy Carden, the woman who played Janet and every other character in that episode, got bupkis.)\n\nThe Barry episode “ronny/lily” stands out more for its direction than its writing, at least in my view. That’s why I see this as a two-script race between the first episode of Fleabag season two and the final episode of Veep. On the one hand, I can imagine many voters wanting to honor Waller-Bridge since Fleabag is predicated on the uniqueness of her voice. On the other, the Veep finale is extremely well written and speaks to the insanity of our political moment by coming at it sideways from a parallel universe. It’s tragedy as comedy. Plus, Veep has only one writing Emmy to its credit and that seems wrong. —JC\n\nThe Emmy should go to … I declare this one a tie and give a prize to both Fleabag’s Waller-Bridge and Veep’s Mandel. Am I allowed to do that? Who cares? Selina Meyer proved there are no rules anymore.\n\nBut the Emmy will go to … Veep.\n\nOutstanding Drama Series\n\nPhoto: HBO\n\n• Better Call Saul (AMC)\n\n• Bodyguard (Netflix)\n\n• Game of Thrones (HBO)\n\n• Killing Eve (BBC America)\n\n• Ozark (Netflix)\n\n• Pose (FX)\n\n• Succession (HBO)\n\n• This Is Us (NBC)\n\nI could write a couple of paragraphs that engage in all kinds of pseudo-statistical Emmy analysis, but let’s be honest: Game of Thrones is going to win. It doesn’t matter that some elements of the final season weren’t as satisfying as they could have been, or that some fans started a petition asking for a redo (as if premium-cable dramas should be treated like lousy putts in miniature golf). On every scale — popularity, narrative scope, production values — Game of Thrones was the biggest show in recent memory. Emmy voters will definitely give it one more trophy for best drama as it heads into the sunset. —JC\n\nThe Emmy should go to … Better Call Saul. It continues to be quietly and consistently excellent, to a degree that is unprecedented for a spinoff prequel to a respected series like Breaking Bad. Maybe it will get an Emmy in this category someday. But it’s not going to happen on Sunday.\n\nBut the Emmy will go to … Game of Thrones.\n\nOutstanding Lead Actor in a Drama\n\n• Jason Bateman, Ozark (Netflix)\n\n• Sterling K. Brown, This Is Us (NBC)\n\n• Kit Harington, Game of Thrones (HBO)\n\n• Bob Odenkirk, Better Call Saul (AMC)\n\n• Billy Porter, Pose (FX)\n\n• Milo Ventimiglia, This Is Us (NBC)\n\nIf Game of Thrones is really on a roll, there’s a chance that Harington could win here. But I don’t expect that to happen, nor do I expect either Brown or Ventimiglia from This Is Us to triumph. And Odenkirk, like the show in which he stars, seems destined to get nominated every year and never win.\n\nI can’t completely put a line through Jason Bateman’s name because voters seem to really like Ozark, which suggests he could be a surprise winner. But if I had to put money on this — which, to be clear, I don’t and I’m not — I would put it on Billy Porter, who has been doing a ton of press and promotion to make sure his terrific performance as Pray Tell isn’t forgotten. —JC\n\nThe Emmy should (and will) go to … Billy Porter for Pose. No one else could play that role but him. Plus, I want to hear his acceptance speech.\n\nOutstanding Lead Actress in a Drama\n\n• Christina Applegate, Dead to Me (Netflix)\n\n• Emilia Clarke, Game of Thrones (HBO)\n\n• Jodie Comer, Killing Eve (BBC America)\n\n• Viola Davis, How to Get Away With Murder (ABC)\n\n• Laura Linney, Ozark (Netflix)\n\n• Mandy Moore, This Is Us (NBC)\n\n• Sandra Oh, Killing Eve (BBC America)\n\n• Robin Wright, House of Cards (Netflix)\n\nMy sense is that neither Davis, who won in this category in 2015, nor Wright, who has been nominated every year of House of Cards’ existence without a win, will take home this Emmy on Sunday night. How to Get Away With Murder doesn’t have a lot of traction behind it, and I’m guessing that a lot of voters would rather put House of Cards behind them, despite Wright’s tenacious performance. As for Moore, her work hasn’t attracted the heft or buzz that the other nominees’ performances have.\n\nLike Bateman, Linney could be a surprise winner for Ozark. But I’m inclined to think that the three women who played three of the more determined, ruthless women on television — Clarke, Oh, and Comer — are at the top of the pack. Clarke could get dinged by the fact that Daenerys’s story line felt a bit rushed in GOT’s finale season. Oh seems like the obvious pick since she won last year. But my eyes are on Comer, who is Oh’s skillfully manipulative dance partner on Killing Eve and wasn’t even nominated last year. —JC\n\nThe Emmy should (and will) go to … Jodie Comer for Killing Eve, whose portrayal of Villanelle is as unpredictable as it is unsettling.\n\nOutstanding Supporting Actor in a Drama\n\n• Alfie Allen, Game of Thrones (HBO)\n\n• Jonathan Banks, Better Call Saul (AMC)\n\n• Nikolaj Coster-Waldeau, Game of Thrones (HBO)\n\n• Peter Dinklage, Game of Thrones (HBO)\n\n• Giancarlo Esposito, Better Call Saul (AMC)\n\n• Michael Kelly, House of Cards (Netflix)\n\n• Chris Sullivan, This Is Us (NBC)\n\nThis is Dinklage’s race to lose. He’s won the Emmy in this category three times before and, whatever you may think of Game of Thrones, he’s been consistently excellent as Tyrion. His performance was one of the strongest parts of the show’s finale and absolutely central to the way the story was resolved. Everyone else in this category is very good. But Dinklage’s work stands out as important and vital in a way that the others don’t quite. —JC\n\nThe Emmy should (and will) go to … Peter Dinklage for Game of Thrones.\n\nOutstanding Supporting Actress in a Drama\n\n• Gwendoline Christie, Game of Thrones (HBO)\n\n• Julia Garner, Ozark (Netflix)\n\n• Lena Headey, Game of Thrones (HBO)\n\n• Fiona Shaw, Killing Eve (BBC America)\n\n• Sophie Turner, Game of Thrones (HBO)\n\n• Maisie Williams, Game of Thrones (HBO)\n\nThe odds are slim that Shaw will win for Killing Eve — at least that’s the consensus over at Gold Derby — which means this will either go to Garner or one of the ladies from Game of Thrones. With four nominees from Westeros, there’s a real chance they’ll split the vote. In any other season, I would have said Headey looks poised to win, but the writers did so little with Cersei in the final GOT season that she wasn’t provided with much of a showcase. Christie got to do some of the more touching, emotional work of the four nominees here, and I can see her winning (and also imagine the internet celebrating that win).\n\nBut there is something to that splitting-of-the-vote possibility, which is why my guess is that Garner, who’s proven her range as an actor not only on Ozark but The Americans and Dirty John, will prevail. —JC\n\nThe Emmy should go to … Gwendoline Christie for Game of Thrones, who radiated both joy and sorrow during the final season.\n\nBut the Emmy will go to … Julia Garner for Ozark.\n\nOutstanding Directing for a Drama Series\n\n• Game of Thrones, “The Iron Throne,” David Benioff and D. B. Weiss (HBO)\n\n• Game of Thrones, “The Last of the Starks,” David Nutter (HBO)\n\n• Game of Thrones, “The Long Night,” Miguel Sapochnik (HBO)\n\n• The Handmaid’s Tale, “Holly,” Daina Reid (Hulu)\n\n• Killing Eve, “Desperate Times,” Lisa Brülhmann (BBC)\n\n• Ozark, “Reparations,” Jason Bateman (Netflix)\n\n• Succession, “Celebration,” Adam McKay (HBO)\n\nGiven the scale and ambition of Game of Thrones, plus this being its last season, I believe it will win here. The question is: Which episode? “The Iron Throne” was a finale peppered with the kind of visual flourishes — remember Dany and her dragon wings? — that seem designed to catch Emmy voters’ attention. “The Long Night,” with its complex battle sequences, could win, too, although it would be more than a little comical to reward an episode that many viewers complained they could not fully see.\n\nBut of the three Game of Thrones episodes nominated, those are the two truly significant ones. For a while I believed “The Long Night” would win, but the more I think about it, the more I think voters will want to reward Benioff and Weiss for their direction. Either way: Internet’s so gonna internet when this category is announced! —JC\n\nThe Emmy should (and will) go to … Game of Thrones for “The Iron Throne.” Purely on a scene-by-scene basis, “The Iron Throne” was well directed and probably deserves the award? [Ducks.]\n\nOutstanding Writing for a Drama Series\n\n• Better Call Saul, “Winner,” Peter Gould and Thomas Schnauz (AMC)\n\n• Bodyguard, “Episode 1,” Jed Mercurio (Netflix)\n\n• Game of Thrones, “The Iron Throne,” David Benioff and D. B. Weiss (HBO)\n\n• The Handmaid’s Tale, “Holly,” Bruce Miller and Kira Snyder (Hulu)\n\n• Killing Eve, “Nice and Neat,” Emerald Fennell (BBC America)\n\n• Succession, “Nobody Is Ever Missing,” Jesse Armstrong (HBO)\n\nIt’s fairly common for the Outstanding Drama winner to also win for writing. But the script for the Game of Thrones finale was definitely not its strongest asset, which opens the door a little bit. That opening could provide the chance to reward a series that has recently become the most talked-about show on television, at least based on Twitter memes and Vulture’s Slack channel.\n\nThat would be Succession, and its wry, dark season-one finale, written by Armstrong. Sometimes the winners in this category go to shows that were good for a very long time but never quite broke through the Outstanding Drama ceiling — see last year’s winner, The Americans, or Friday Night Lights a few years back. This time, Emmy voters may actually try to look to the future. —JC\n\nThe Emmy should go to … “Winner,” the season finale of Better Call Saul. First of all, it’s called “Winner,” so it’s pretty much telling you what it is. Second, that episode is filled with sharp writing, including the brilliantly deceptive speech that Jimmy makes during his bar hearing. Third, it ends with a phrase that is also an origin story: “S’all good, man.”\n\nBut the Emmy will go to … Succession and “Nobody Is Ever Missing.”\n\nOutstanding Limited Series\n\nPhoto: Michael Parmelee/FX\n\n• Chernobyl (HBO)\n\n﻿• Escape at Dannemora (Showtime)\n\n﻿• Fosse/Verdon (FX)\n\n﻿• Sharp Objects (HBO)\n\n﻿• When They See Us (Netflix)\n\nThis was an extraordinary year for limited series, maybe one of the strongest in memory. HBO’s Chernobyl was perhaps the biggest surprise of the year, and not merely because it represented such a profound about-face for creator and writer Craig Mazin, previously known for (and typecast by) the Hangover movies. It drew viewers back, week after week, to a story of manmade disaster and bureaucratic ineptitude, complete with revolting images of people dying of radiation burns and poisoning. It has to be considered the dark horse candidate.\n\nSharp Objects was a master class in elliptical storytelling from its sole director, Jean-Marc Vallée, but the grimness of the subject matter (as relentless as Chernobyl, but without the saving grace of spectacle) might work against it, along with Vallée’s role in seemingly taking away season two of Big Little Lies from its auteur director, Andrea Arnold. Showtime’s Escape at Dannemora was also a surprise coming from director Ben Stiller, not the person you might expect to tell the true-life story of a prison break masterminded by two inmates (Paul Dano and Benicio Del Toro) in a sexual relationship with a prison worker (Patricia Arquette).\n\nFX’s Fosse/Verdon was catnip for fans of Broadway, musical theater, and showbiz history; the murderer’s row of behind-the-scenes producing talent amplified the must-see factor, even more so than the spot-on casting in every major role. But despite strong feminist underpinnings, its early installments played like another entry in the Toxic Male Genius genre, and it might suffer from being nearly impenetrable if you don’t know the main players. Still, it grows in power once you realize that it isn’t going to do the things you expect, and its reverence for the traditions of show business might put it over the top — Emmy voters love shows that reassure them they’re doing exciting, important work.\n\nThe most altogether brilliant achievement in this category is the Central Park Five drama When They See Us, directed and co-written by Ava DuVernay with a precision, visual sophistication, and breadth of vision that marked it as a huge step up from her already impressive filmography of works about or related to the experience of African-Americans in the criminal-justice system. Both structurally and tonally audacious, this was one for the ages, maybe the closest thing to an epic neorealist drama that American television has yet produced. —Matt Zoller Seitz\n\nThe Emmy should go to … When They See Us.\n\nBut the Emmy will go to … Fosse/Verdon.\n\nOutstanding Lead Actor in a Limited Series\n\n• Mahershala Ali, True Detective (HBO)\n\n• Benicio Del Toro, Escape at Dannemora (Showtime)\n\n• Hugh Grant, A Very English Scandal (Amazon)\n\n• Jared Harris, Chernobyl (HBO)\n\n• Jharrel Jerome, When They See Us (Netflix)\n\nThe front-runners in this category are Mahershala Ali of True Detective, who was awe-inspiring as a police detective struggling with memory across three time periods, and Hugh Grant playing parliamentary leader Jeremy Thorpe in A Very English Scandal, an outwardly cheerful yet ruthless character trying to neutralize threats from a much younger lover (Ben Whishaw). Ali won two Oscars back-to-back, which is a hard prestige lure to resist on top of his excellence, while Grant recently has come back into vogue as a character actor and can be relied upon to give a charming, thoroughly English acceptance speech.\n\nBenicio Del Toro was thrilling as a tough and conniving inmate in Showtime’s Escape at Dannemora, but it’s questionable whether he showed us anything new or different in the part. Sam Rockwell’s work as Bob Fosse in FX’s Fosse/Verdon deserved more credit than it got — he was overshadowed by Williams’s fresh and brilliant work as Gwen Verdon — and the actor was further hampered by the fact that he wasn’t Roy Scheider, who had played a far more appealing incarnation of the character in Fosse’s 1979 autobiographical musical fantasy All That Jazz.\n\nThe two most impressive performers in this category are the subtlest. Jared Harris’s performance as safety advocate Valery Legasov in HBO’s Chernobyl was a heartbreaking portrait of a scientist and policy expert being ignored and silenced for the sake of politics; he infused the role with his customary gift for drying out melodrama and tragedy to make it more affecting.\n\nJharrel Jerome, who excelled as teenage Kevin in Moonlight, was the only actor in Ava DuVernay’s When They See Us to play both the teenage and adult incarnations of his character, Korey Wise. The lighting, makeup, and hairstyling helped, but it was mostly Jerome’s masterful body language that sold the character’s evolution — the sense that Wise was so transformed by his unjust experience that the emotional weight he carried had turned physical. It’s as altogether impressive a performance as any of the nominees, coming from an actor who’s still at the beginning of what ought to be a long career. —MZS\n\nThe Emmy should go to … Jharrel Jerome for When They See Us.\n\nBut the Emmy will go to … Jared Harris for Chernobyl.\n\nOutstanding Lead Actress in a Limited Series\n\n• Amy Adams, Sharp Objects (HBO)\n\n﻿• Patricia Arquette, Escape at Dannemora (Showtime)\n\n﻿• Aunjanue Ellis, When They See Us (Netflix)\n\n﻿• Joey King, The Act (Hulu)\n\n﻿• Niecy Nash, When They See Us (Netflix)\n\n﻿• Michelle Williams, Fosse/Verdon (FX)\n\nIn any other year, Amy Adams’s work as the traumatized, homeward bound investigative journalist in Sharp Objects would feel like a sure thing. Consistently outstanding in a variety of movie roles since 2005’s Junebug, she reached a new peak of subtlety as Camille Preaker, seeming to turn the character’s younger incarnation (played Sophia Lillis of the It films) and director Jean-Marc Vallée’s impressionistic flash cuts into scene partners, even though she was acting against nothing and no one when her pieces of the puzzle were filmed.\n\nBut then Michelle Williams came along playing Gwen Verdon in Fosse/Verdon. She has the transformative, quasi-Method intensity that awards voters love to reward whenever the practitioner is a macho guy like Christian Bale, Matthew McConaughey, Leonardo DiCaprio, or, back in the day, Robert De Niro. But it’s a deeply human, accessible performance that never feels like a mere impression. And the story line of the miniseries — an accomplished female performer’s superb work is overshadowed by the death of her more famous male partner — unintentionally rhymes with Williams’s own journey through grief that it seems inconceivable that she won’t win this year.\n\nIn comparison, all of the other nominated performers are going to seem like footnotes, which is a shame considering the strength and skill displayed by Aunjanue Ellis and Niecy Nash in When They See Us, and the daring, chameleonic work of Joey King in The Act and Patricia Arquette in Escape at Dannemora. (Arquette, another national treasure, has a better shot at supporting actress in this category, for playing King’s unhinged mother in The Act.) —MZS\n\nThe Emmy should (and will) go to … Michelle Williams for Fosse/Verdon.\n\nOutstanding Supporting Actress in a Limited Series\n\n• Patricia Arquette, The Act (Hulu)\n\n• Marsha Stephanie Blake, When They See Us (Netflix)\n\n• Patricia Clarkson, Sharp Objects (HBO)\n\n• Vera Farmiga, When They See Us (Netflix)\n\n• Emily Watson, Chernobyl (HBO)\n\nBetween her performance in Escape at Dannemora and her ominous and oppressive turn in Hulu’s The Act, it’s been a peak year for Patricia Arquette. She gave a committed, intense, yet refreshingly non-condescending performance in The Act, playing a drug-addicted mom inflicting Munchausen syndrome by proxy on her daughter (Joey King), inhabiting the character so completely that if you’d never seen Arquette in anything else, you might think she was a brilliant local who’d won the part in an open call.\n\nBut it’s doubtful that anyone can beat Patricia Clarkson, who played a different, even more smothering mother in HBO’s Sharp Objects. Although a less obviously transformational performance than Arquette’s, Clarkson is a lot more crowd-pleasing, bringing an almost Tennessee Williams–like edge of caustic, undermining wit to her character, and injecting a welcome element of borderline camp into an otherwise funereal story. In comparison, the other four outstanding performances in this category — Vera Farmiga as the destructive prosecutor and Marsha Stephanie Blake as a crusading mother in When They See Us; Margaret Qualley’s wide-eyed young Ann Reinking in Fosse/Verdon; Emily Watson as the intrepid Ulana Khomyuk in Chernobyl — don’t stand a chance. —MZS\n\nThe Emmy should go to … Patricia Arquette for The Act.\n\nBut the Emmy will go to … Patricia Clarkson for Sharp Objects.\n\nOutstanding Supporting Actor in a Limited Series\n\n• Asante Blackk, When They See Us (Netflix)\n\n• Paul Dano, Escape at Dannemora (Showtime)\n\n• John Leguizamo, When They See Us (Netflix)\n\n• Stellan Skarsgård, Chernobyl (HBO)\n\n• Ben Whishaw, A Very English Scandal (Amazon)\n\n• Michael K. Williams, When They See Us (Netflix)\n\nWhile Michael K. Williams is heartbreaking in When They See Us, John Leguizamo has a cleaner dramatic arc as Raymond Santana Sr., the father of another of the imprisoned teens. Not only is he at the center of one of the most daringly directed sequences — an elegant passage-of-time montage, built around a series of phone calls — he captures the predicament of a man placed in an emotionally impossible position, having remarried and started a new family while his son was incarcerated, and trying to play peacemaker in their arguments without taking sides. Leguizamo deserves to win an Emmy for his work here. Not only is the performance itself nearly immaculate, it sums up three decades’ worth of his memorable performances as authentic New York characters, some boldly stylized, others achingly real.\n\nIn comparison, Paul Dano in Escape at Dannemora, Ben Whishaw in A Very English Scandal, and Stellan Skarsgård in Chernobyl don’t register quite as strongly. But Skarsgård, a beloved and consistently excellent character actor, feels like the front-runner here anyway, for his performance as a Soviet official who goes from interfering with attempts to deal with the nuclear disaster to endorsing those same impulses.\n\nAsante Blackk, a first-time actor cast as one of the railroaded teens in When They See Us, deserves special mention for the delicacy and transparency of his acting, as well as for the iconic magnetism of his face. He probably won’t win because almost nobody does their first time out, and especially not when they’re as young as Blackk is. But he’s so remarkable that we shouldn’t be surprised if lightning strikes. —MZS\n\nThe Emmy should go to … John Leguizamo for When They See Us.\n\nBut the Emmy will go to … Stellan Skarsgård for Chernobyl.\n\nOutstanding Directing for a Limited Series\n\n• A Very English Scandal, Stephen Frears (Amazon)\n\n• Chernobyl, Johan Renck (HBO)\n\n• Escape at Dannemora, Ben Stiller (Showtime)\n\n• Fosse/Verdon, Jessica Yu, “Glory” (FX)\n\n• Fosse/Verdon, Thomas Kail, “Who’s Got the Pain” (FX)\n\n• When They See Us, Ava DuVernay (Netflix)\n\nThomas Kail and Jessica Yu both directed strong episodes of Fosse/Verdon: The second episode, which flashed back to the beginning of the title characters’ relationship, and the fourth, which contrasted Fosse’s career success directing Pippin! and Liza With a Z with Gwen Verdon’s struggle acting in the short-lived dramatic play Children! Children! Yet neither were as moving and nearly perfect as the fifth, sixth, seventh, or eighth episodes (three of which were also directed by Kail), so it’s puzzling why these two were singled out.\n\nBen Stiller’s direction of the true-life prison drama Escape at Dannemora was a startling departure from everything he’s done in the past — it was even composed in CinemaScope dimensions that emphasized the oppressive architecture of the prison — but it might’ve been better as a self-contained film than as a miniseries. Stephen Frears, a sly veteran with amazing range, made A Very English Scandal brisk and understated, which enhanced both the comedy and the tragedy, but the project seems overshadowed by the grandioseness of other titles in this category — namely the immense, terrifying, often blackly comedic Chernobyl. The HBO miniseries’ sole director, Johan Renck, feels like the front-runner, unless the voters’ tendency to reward projects about show business shifts things in Fosse/Verdon’s direction.\n\nBut by all rights, this should be When They See Us director Ava DuVernay’s year. Equally impressive for its structure, its control of tone, its deployment of period details, the breadth of its research, and the depth of its feeling, it’s one of the finest TV productions to debut in the streaming era. —MZS\n\nThe Emmy should go to … Ava DuVernay for When They See Us.\n\nBut the Emmy will go to … Johan Renck for Chernobyl.\n\nOutstanding Writing for a Limited Series\n\n• A Very English Scandal, Russell T. Davies (Amazon)\n\n• Chernobyl, Craig Mazin (HBO)\n\n• Escape at Dannemora, “Episode 6,” Brett Johnson, Michael Tolkin, and Jerry Stahl (Showtime)\n\n• Escape at Dannemora, “Episode 7,” Brett Johnson and Michael Tolkin (Showtime)\n\n• Fosse/Verdon, “Providence,” Steven Levinson and Joel Fields (FX)\n\n• When They See Us, “Part Four,” Ava DuVernay and Michael Starrbury (Netflix)\n\nIt’s hard to imagine the studious grit of Escape at Dannemora or the incisive drollness of A Very English Scandal besting the other nominees in this category. Craig Mazin seems likely to take it for Chernobyl, because it’s a substantial achievement in its own right, blending historical sweep, journalistic muckraking, and gallows humor, and because it’s the kind of career about-face that voters love to single out. My heart is with Ava DuVernay and Michael Starrbury’s script for the fourth episode of When They See Us, the centerpiece of which is a 45-minute tour de force about the experience of Korey Wise in Rikers Island penitentiary. It boasts expressionist sequences reminiscent of the final half-hour of The Last Temptation of Christ, and wraps up with a series of genuinely cathartic moments. —MZS\n\nThe Emmy should go to … Ava DuVernay and Michael Starrbury for When They See Us.\n\nBut the Emmy will go to … Craig Mazin for Chernobyl.\n\nOutstanding Variety Talk Series\n\nPhoto: Scott Kowalchyk/CBS\n\n• The Daily Show With Trevor Noah (Comedy Central)\n\n• Full Frontal With Samantha Bee (TBS)\n\n• Jimmy Kimmel Live! (ABC)\n\n• Last Week Tonight With John Oliver (HBO)\n\n• The Late Late Show With James Corden (CBS)\n\n• The Late Show With Stephen Colbert (CBS)\n\nWhile I would love it if this award went to Full Frontal, I’m afraid Samantha Bee’s incisive commentary hasn’t reached a level of widespread cultural buzz to make it an obvious choice for Emmy voters. Trevor Noah’s Daily Show has a slightly better chance: He’s gotten more recognition for slowly but surely remaking that show into a new thing. Like Full Frontal, though, it doesn’t feel like that narrative has been quite visible enough for Noah to break through.\n\nIn the short history of this category, it has been remarkably stable. First it was Jon Stewart’s Daily Show in 2015, then Last Week Tonight every year since. I’m not sure that any of the other shows have enough momentum to topple John Oliver. But if the award were to go to another nominee, it might be the year for Stephen Colbert’s Late Show. After a rocky introduction and early months spent getting his footing, Colbert has been ascendant in late night this year. He’s gotten credit for embracing politics, often more directly and sharply than the other big late-night programs, and Colbert has also distinguished himself as both an interviewer and a monologist. It still feels like Last Week Tonight’s award to lose, but from a momentum standpoint it might be time to look toward The Late Show. —Kathryn VanArendonk\n\nThe Emmy should go to … The Late Show With Stephen Colbert.\n\nBut the Emmy will go to … Last Week Tonight.\n\nOutstanding Variety Sketch Series\n\n• At Home With Amy Sedaris (truTV)\n\n• Documentary Now! (IFC)\n\n• Drunk History (Comedy Central)\n\n• I Love You, America With Sarah Silverman (Hulu)\n\n• Saturday Night Live (NBC)\n\n• Who Is America? (Showtime)\n\nLook, Saturday Night Live is probably going to win this. There is a slight chance it goes to Who Is America? instead, because Sacha Baron Cohen’s Showtime series had a couple big breakout moments and people seem to really love it when that guy does pranks by dressing up and doing a silly voice. But SNL has become the default choice in this category, winning the past two years running, and the show’s most recent season was plenty strong enough to validate that decision once again.\n\nFor my money, though, the single best variety sketch series of the year was Documentary Now! Hands down, no question, chisel it in stone, make a fake Sondheim musical about it and then make a fake D.A. Pennebaker documentary about the fake musical. The details are what tip Documentary Now! over the edge from funny into brilliant. The costumes and the fonts and the camera angles and the absolutely obsessive re-creations of editing rhythms and character tics, all of it is meticulous and thoughtful and great. Saturday Night Live will probably win, but Co-op has my heart. —KVA\n\nThe Emmy should go to … Documentary Now!\n\nBut the Emmy will go to … Saturday Night Live.\n\nOutstanding Writing for a Variety Series\n\n• Documentary Now! (IFC)\n\n• Full Frontal With Samantha Bee (TBS)\n\n• Last Week Tonight With John Oliver (HBO)\n\n• Late Night With Seth Meyers (NBC)\n\n• The Late Show With Stephen Colbert (CBS)\n\n• Saturday Night Live (NBC)\n\nGiving this Emmy to Last Week Tonight for the fourth consecutive year feels both safe and correct. It is an intensely writerly show, which is not to say that other late-night shows don’t involve a great deal of writing, too. But Last Week Tonight is like the late-night version of a very funny term paper, written by the kids in your class who actually started doing research the moment they got the assignment rather than spending a few hours in the library the night before it was due. The writing is right up top. It is the thing you celebrate.\n\nYet, in the interest of shaking things up and of rewarding other truly great work, this award should go to Late Night With Seth Meyers, a show that has been consistently crushing its scripted segments. Late Night has been explicit about highlighting its writers as well, especially in its “Jokes Seth Can’t Tell” bit, where women from the Late Night writers’ room come out and perform all the jokes Meyers could never do. An award for Late Night here wouldn’t just be about celebrating the material itself, although it would and should do that. It’d be a way for the Emmys to celebrate positive behind-the-scenes shifts in late-night comedy, and to reward a show that owns its writing and its writers. —KVA\n\nThe Emmy should go to … Late Night With Seth Meyers.\n\nBut the Emmy will go to … Last Week Tonight.\n\nOutstanding Directing for a Variety Series\n\n• Documentary Now!, “Waiting for the Artist,” Alex Buono and Rhys Thomas (IFC)\n\n• Drunk History, “Are You Afraid of the Drunk?” Derek Waters (Comedy Central)\n\n• Last Week Tonight With John Oliver, “Psychics,” Paul Pennolino (HBO)\n\n• The Late Show With Stephen Colbert, “Live Midterm Election Show,” Jim Hoskinson\n\n• Saturday Night Live, “Host: Adam Sandler,” Don Roy King\n\n• Who Is America?, “Episode 102,” Sacha Baron Cohen, Nathan Fielder, Daniel Gray Longino, and Dan Mazer\n\nEverything I said about the variety sketch series category goes double here. Saturday Night Live tends to win this category — it’s won seven of the last nine years — and because SNL is part of the Zeitgeist in a much more broadly visible way than any other show in this category, it feels like a very safe bet. The nominated SNL episode was the one hosted by Adam Sandler, which included several great sketches and an especially poignant moment as Sandler sang a song in memory of Chris Farley. It’s gonna be a hard one to beat.\n\nBut Documentary Now! had some of the best directing anywhere on TV last year. The episode nominated is “Waiting for the Artist,” the show’s Marina Abramovic spoof, and it exemplifies the best of what Documentary Now! can be: goofy and stupid and intellectual and subtle all at one. (Did I mention goofy and stupid?) None of it would work without Rhys Thomas and Alexander Buono’s direction, which is usually so straight-faced that it actively resists the show’s spoofiness. It’s amazing, and I’m thrilled it was recognized with a nomination even though I doubt it will win. —KVA\n\nThe Emmy should go to … Documentary Now!\n\nBut the Emmy will go to … Saturday Night Live.", "description": "Who will win at the 2019 Emmy Awards? Which nominees really should win, but won’t? Vulture staffers Jen Chaney, Matt Zoller Seitz, and Kathryn VanArendonk break down each of the major categories to predict who will go home with the most Emmys.", "authors": ["Jen Chaney", "Matt Zoller Seitz", "Kathryn Vanarendonk"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/19/emmys/veep.w1200.h630.jpg", "published_at": "2019-09-20"}