{"pub": "businessinsider", "url": "https://businesstimes.com.sg/banking-finance/tokio-marine-life-hires-new-chief-marketing-officer-chief-actuary", "downloaded_at": "2019-10-17 08:08:57.577944+00:00", "title": "Tokio Marine Life hires new chief marketing officer, chief actuary", "language": "en", "text": "Gilbert Pak (left) has joined Tokio Marine Life Insurance Singapore as chief marketing officer from Allianz, while Michael Kuek has joined as chief actuary from China Life Insurance Co (Singapore).\n\nTOKIO Marine Life Insurance Singapore (TMLS) on Thursday brought on board Gilbert Pak as chief marketing officer (CMO) and Michael Kuek as chief and appointed actuary.\n\nThe appointments will help strengthen TMLS’s strategic focus in product development and strategy, the life insurer said.\n\nAs CMO, Mr Pak will lead the marketing and product strategy to bring a comprehensive suite of solutions to meet customers’ financial planning as well as wealth protection and creation needs.\n\nBefore joining TMLS, Mr Pak was regional head of product management at Allianz Asia Pacific for eight years. He brings with him over 27 years of marketing, product development, actuarial and financial management experience across Asia.\n\nsentifi.com Market voices on:\n\nMeanwhile, Mr Kuek as chief and appointed actuary will oversee actuarial valuation and pricing, to ensure the sound and prudent management of TMLS.\n\nWith close to 24 years of experience in the insurance industry, Mr Kuek was most recently chief actuary at Chinese state-owned China Life Insurance Co (Singapore) for more than four years. Prior to that, he was chief actuary at Great Eastern Life Indonesia.\n\nBesides possessing the Actuary Fellowship qualification, Mr Kuek is also a certified enterprise risk analyst.\n\nTMLS is part of Japanese insurance giant Tokio Marine Holdings.", "description": ": THE BUSINESS TIMES Banking & Finance - TOKIO Marine Life Insurance Singapore (TMLS) on Thursday brought on board Gilbert Pak as chief marketing officer (CMO) and Michael Kuek as chief and appointed actuary. . Read more at The Business Times.", "authors": ["Fiona Lam"], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/17/pjimage.jpg?itok=qaevGjis", "published_at": "2019-10-17"}