{"pub": "thehill", "url": "https://thehill.com/regulation/court-battles/467108-trump-attorney-president-could-shoot-someone-on-fifth-avenue-and-not", "downloaded_at": "2019-10-23 16:39:11.674421+00:00", "title": "Trump lawyer says president could shoot someone on Fifth Avenue and avoid prosecution", "language": "en", "text": "An attorney for President Trump Donald John TrumpGraham to introduce resolution condemning House impeachment inquiry Support for impeachment inches up in poll Fox News's Bret Baier calls Trump's attacks on media 'a problem' MORE told a federal appeals court Wednesday that Trump could not be prosecuted even if he shot someone on Fifth Avenue in New York.\n\nTrump attorney William Consovoy made the remark during oral arguments in a case involving a subpoena seeking Trump's tax returns and financial records from his accounting firm. The president's attorneys have argued he has blanket immunity from criminal prosecution and even investigation while in office.\n\nADVERTISEMENT\n\nAttorneys and the three appeals court judges, all of whom were appointed by Democratic presidents, frequently referred to Trump’s assertion from his 2016 presidential campaign that he could “stand in the middle of Fifth Avenue and shoot someone” without losing supporters.\n\nJudge Denny Chin asked Consovoy how such a scenario would work under the president’s claims of executive immunity from prosecution and investigation.\n\n“What’s your view on the ‘Fifth Avenue’ example?” Chin asked. “Local authorities couldn’t investigate, couldn’t do anything about it?”\n\n“Nothing could be done, that’s your position?” he added.\n\n“That is correct,” Consovoy responded.\n\nThe Manhattan District Attorney's office has accused Trump of making up privilege claims about his tax returns and other financial records amid a legal battle that seems destined for the Supreme Court.\n\nThe case stems from a subpoena that Manhattan District Attorney Cyrus Vance issued to the accounting firm Mazars seeking the same financial records that are at the heart of separate court battles involving two Democratic-controlled House committees.\n\nCarey Dunne, a lawyer with the Manhattan District Attorney's office, pushed back aggressively against arguments that Trump's records were protected under the constitution.\n\n“There is no privilege for tax returns, whether it's the president or anybody else in the country,” Dunne told the judges. “Yes, he may view them as embarrassing or sensitive. But yes, tax returns do in fact get subpoenaed all the time in financial investigations.”\n\n“They're making this up, your honor, that's all I can say,” Dunne added.\n\nThe judges appeared skeptical of the president's broad claims that he has a blanket immunity from criminal prosecution and even investigation while in office.\n\nThe case has indeed progressed more rapidly than Trump’s legal battles with Congress. The House Ways and Means Committee’s effort to obtain the president’s federal tax returns is still unfolding in the D.C. District Court, as is the president’s lawsuit against members of Congress and New York officials over a recent state law allowing Congress to obtain the president’s returns.\n\nEarlier this month, the D.C. Circuit Court of Appeals ruled in favor of the House Oversight Committee’s effort to subpoena Mazars in another case that could reach the Supreme Court.\n\nVance and Trump's lawyers have agreed to expedite their case in an effort to fast-track it to the Supreme Court. Vance said that his office would not enforce the subpoena while the legal battle plays out.\n\nRobert Katzmann, the chief judge for the Second Circuit, acknowledged that the fight will likely move to the nation’s highest court.\n\n“This case seems bound for the Supreme Court,” Katzmann said.\n\n“I think both sides see that as an inevitability, your honor,” Dunne responded.", "description": "An attorney for President Trump told a federal appeals court Wednesday that Trump could not be prosecuted even if he shot someone on Fifth Avenue in New York.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_101119getty_0.jpg", "published_at": "2019-10-23"}