{"pub": "cnn", "url": "https://cnn.com/2019/10/16/tech/google-pixel-recorder-ai-transcribe-app/index.html", "downloaded_at": "2019-10-16 13:51:56.055341+00:00", "title": "The biggest surprise of Google's Pixel event is a transcription app. Here's how it works", "language": "en", "text": "San Francisco (CNN Business) While Google's latest smartphone, the Pixel 4, got top billing at a major launch event in New York on Tuesday, the unveiling of an AI-enhanced recording and transcribing app was perhaps the biggest surprise of the day.\n\nRecorder is meant for recording meetings, music, lectures, and such. It can recognize and transcribe in real time what you're saying and identify other types of noise like music and applause. The recordings can be searched for specific words. For example, you can search for \"rainbow\" and receive results that show where that word was uttered in each recording.\n\nRecorder will come with the new Pixel phone — Google's flagship handset line for showing off the latest features of its Android app. That phone starts at $799, or $100 more than the baseline iPhone 11 model, and ships October 24. Starting in December, Google will roll Recorder out to older Pixel phone models as well.\n\nWhile Recorder may sound like a fairly simple app, Sherry Lin, the product manager for Recorder, told CNN Business it wasn't easy to make its speedy transcription work without killing the phone's battery life. Google had to figure out how to pack into the handset a lot of AI that's usually tucked away on a remote server.\n\n\"Honestly, when we started out we weren't sure if we could even ship,\" Lin said in an interview Tuesday.\n\nRead More", "description": "While Google's latest smartphone, the Pixel 4, got top billing at a major launch event in New York on Tuesday, the unveiling of an AI-enhanced recording and transcribing app was perhaps the biggest surprise of the day.", "authors": ["Rachel Metz", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191016081511-29-google-live-event-1015-pixel-recorder-transcribe-super-tease.jpg", "published_at": "2019-10-16"}