{"pub": "yahoo", "url": "https://news.yahoo.com/walmart-moves-guns-politicians-note-135558824.html", "downloaded_at": "2019-09-08 11:57:00.030947+00:00", "title": "Walmart Moves on Guns. Politicians, Take Note.", "language": "en", "text": "(Bloomberg Opinion) -- Walmart Inc., the biggest retailer in the U.S. and a leading seller of firearms and ammunition, announced this week that it would stop selling bullets for handguns and military-style rifles, stop selling handguns in Alaska (the last remaining state where it makes such sales), and “respectfully” ask its customers to stop openly carrying guns in its stores.\n\nThe move is welcome in its own right — but it’s especially encouraging as a sign that public opinion is swinging ever more strongly in support of effective gun-control policies. CVS, Kroger, Walgreens and other retailers have also adjusted their policies. If Walmart and others see the case for changing their minds, politicians ought to pay attention.\n\nQuicktakeGuns in America\n\nWalmart took the opportunity to address politicians directly, saying: “We encourage our nation’s leaders to move forward and strengthen background checks and to remove weapons from those who have been determined to pose an imminent danger.”\n\nThe company has acted on guns before. It took assault weapons off its shelves in 2015, for instance. But this latest action is still striking. The recent attack in one of its stores in El Paso, Texas — leaving 22 dead, and followed within hours by another atrocity in Dayton, Ohio — was seen to demand a response. “The status quo is unacceptable,” said Doug McMillon, the company’s CEO. He’s right.\n\nThe announcement will help to strengthen the cultural change that seems to be happening. But to lessen the proliferation of firearms or the danger of guns getting into dangerous hands, political action is needed as well. The two go hand in hand, which is why Walmart’s initiative matters.\n\n“They have their finger on the pulse of what Americans want, and the Senate should take note,” said John Feinblatt, president of Everytown for Gun Safety. (Michael Bloomberg, owner of Bloomberg LP, the parent company of Bloomberg News, founded and helps fund Everytown, a nonprofit that advocates for universal background checks and other gun-violence prevention measures.)\n\nMomentum seems to be building toward meaningful gun-control regulation. Walmart’s chief executive and the company’s courageous board deserve credit for recognizing this, and for adding their weight to the cause.\n\n--Editors: Clive Crook, Mark Whitehouse.\n\nTo contact the senior editor responsible for Bloomberg Opinion’s editorials: David Shipley at davidshipley@bloomberg.net, .\n\nEditorials are written by the Bloomberg Opinion editorial board.\n\nFor more articles like this, please visit us at bloomberg.com/opinion\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg Opinion) -- Walmart Inc., the biggest retailer in the U.S. and a leading seller of firearms and ammunition, announced this week that it would stop selling bullets for handguns and military-style rifles, stop selling handguns in Alaska (the last remaining state where it makes such sales), and", "authors": ["The Editors"], "top_image": "https://s.yimg.com/uu/api/res/1.2/dSfF6wLz2N9CFxLmsnDJ9A--~B/aD02ODM7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_opinion_268/9ceddf4024533565cdb3ddaf02734fd0", "published_at": "2019-09-06"}