{"pub": "marketwatch", "title": "A few simple steps for millennials who want to start investing", "url": "https://marketwatch.com/story/a-few-simple-steps-for-millennials-that-want-to-start-investing-2019-07-31?mod=fa_center", "language": "en", "published_at": "2019-07-31", "downloaded_at": "2019-09-02 06:59:07.074201+00:00", "text": "News headlines might lead you to believe that millennials are striking out on a growing list of financial accomplishments: homeownership, paying off student loans — not to mention summoning the will to resist high-end coffee or avocado toast.\n\nWhen it comes to investing, they might have a point. Investment firm TD Ameritrade surveyed 1,519 people ages 21-37 in 2018 and found that only 50% said they invest — including in their retirement accounts.\n\nBut, surprisingly, investing is likely one of the easier financial goals to meet. In just a few steps, millennials can set the stage for investing, get their first investing accounts going, then look to bigger investing goals.\n\nSet the foundation\n\nBefore you think about jumping into the stock market or other forms of investing, make sure your financial foundation is sound.\n\n“Investing is great, but if you have something else that money could be doing to get your overall financial picture in shape, do that first,” says Katrina Welker, a New York-based certified financial planner. “Get your budget under control and a regular savings habit established.”\n\nGet a handle on these three factors before you start investing:\n\nHigh-interest debt payments: Pay down high-interest debts, like credit cards or a payday loan. Consolidating debt at a lower interest rate can speed up payoff.\n\nYou want the power of compounding interest to work for you, not against you. When you invest, you’re earning interest on the money you put in, which raises the amount you have. Then you earn more interest on that amount. With high-interest debts, it’s just the opposite.\n\nSavings: Build up an emergency fund to cover unexpected expenses so you don’t have to withdraw money from investments.\n\nEducation: Research different approaches to investing and how to best succeed at them. Also understand your timeline; any amount you’d need within five years may be better off in a high-yield savings account or CD. The rate of return won’t be as high, but you’re protected from locking in a big loss if you need to pull out of your investment to get your money when the market’s in a slump.\n\nStart with the essential investment\n\n“Probably the easiest place to start investing is through your employer retirement plan,” Welker says.\n\nRead next: Getting Started: A beginning guide to investing\n\nTake advantage of the decades you have before retirement. By investing 10% to 15% of your income into your retirement account over many years, compounding interest and market returns will likely generate a sizable nest egg.\n\nHere are two common retirement account options:\n\n401(k): Offered by many employers, money is taken directly from your pay and put into an account. Employers often offer to match a portion of what you contribute, which is free money.\n\nOffered by many employers, money is taken directly from your pay and put into an account. Employers often offer to match a portion of what you contribute, which is free money. Traditional or Roth IRA: An individual retirement account lets you contribute on your terms. The difference between the two is how and when you get a tax break. Contributions to a traditional IRA may be tax-deductible in the year they’re made. With a Roth IRA, withdrawals in retirement are tax-free.\n\nNext-level investments\n\nWhether you want to start investing spare change or want to dive into researching and trading stocks, know your goal — and how you want to get there.\n\n“Being ready to invest is a mind-set, and it depends on what you want out of it,” says Heather Townsend, a certified financial planner in Scottsdale, Arizona. “Understand that if you do want to invest, you have to know that the market can have big upswings and downswings. Are you willing to take that risk for the upside?”\n\nThere are two main paths: DIY or with the help of a portfolio management service.\n\nDIY: Do-it-yourself investing can take many shapes. Two common options are online brokers and apps. Online brokers require a more hands-on approach to managing a portfolio online, while apps do most of the work for you.\n\nWhile there are a variety of apps that invest spare change, like Acorns, don’t expect them to yield big earnings, Welker says. “Especially early on, if you want to set up an account and dabble and play, the apps are fine. But if you’re more serious about it, find a portfolio you can invest it in,” she says.\n\nSee: Invest simple with lazy portfolios\n\nAutomated portfolio management: Often in the form of robo advisers, automated portfolio management uses algorithms to build and manage your investment portfolio. You set your parameters, including timeline and risk tolerance, and the robo adviser generally takes care of the rest. These tools can be a quick way to start investing without doing all the legwork yourself.\n\nMore from NerdWallet:", "description": "Set the stage for investing, get your first account going, and start looking to bigger investing goals.", "authors": ["Sean Pyles"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HO100_nerd_m_ZG_20190724182101.jpg"}