{"pub": "thehill", "url": "https://thehill.com/homenews/campaign/466830-yang-disappointed-weather-channel-excluded-him-from-climate-change-special", "downloaded_at": "2019-10-22 13:22:59.079254+00:00", "title": "Yang 'disappointed' Weather Channel excluded him from climate change special", "language": "en", "text": "Democratic presidential candidate Andrew Yang Andrew YangOn The Money: Trump dismisses 'phony Emoluments Clause' after Doral criticism | Senate Dems signal support for domestic spending package | House panel to consider vaping tax Sanders: 'Outrageous' to suggest Gabbard 'is a foreign asset' Clinton attacks on Gabbard become flashpoint in presidential race MORE reportedly said Monday that he is “disappointed” that the Weather Channel didn’t invite him to take part in a bipartisan climate change special set to air next month.\n\nWhile the Nov. 7 special will feature several other 2020 Democrats — including Sens. Elizabeth Warren Elizabeth Ann WarrenWarren to protest with striking Chicago teachers Overnight Health Care — Presented by Partnership for America's Health Care Future — Four companies reach 0M settlement in opioid lawsuit | Deal opens door to larger settlements | House panel to consider vaping tax | Drug pricing markup tomorrow On The Money: Trump dismisses 'phony Emoluments Clause' after Doral criticism | Senate Dems signal support for domestic spending package | House panel to consider vaping tax MORE (Mass.), Bernie Sanders Bernie SandersWarren to protest with striking Chicago teachers Sanders: 'Outrageous' to suggest Gabbard 'is a foreign asset' Democratic strategist: Sanders seeking distance from Warren could 'backfire' MORE (I-Vt.) and Cory Booker Cory Anthony BookerPoll: Biden holds 10-point lead nationally over Warren Trump declines to participate in Weather Channel 2020 climate change special Bennet: Warren 'not being honest about' her 'Medicare for All' plan MORE (N.J.) as well as former Texas Rep. Beto O’Rourke (D) and South Bend, Ind. Mayor Pete Buttigieg Peter (Pete) Paul ButtigiegSanders: 'Outrageous' to suggest Gabbard 'is a foreign asset' Hillicon Valley: Facebook removes Russian, Iranian accounts trying to interfere in 2020 | Zuckerberg on public relations blitz | Uncertainty over Huawei ban one month out Clinton attacks on Gabbard become flashpoint in presidential race MORE (D) — Yang won’t be among the group participating, the Washington Examiner reports.\n\nPresident Trump Donald John TrumpTrump says he doesn't want NYT in the White House Veterans group backs lawsuits to halt Trump's use of military funding for border wall Schiff punches back after GOP censure resolution fails MORE and three GOP challengers — former South Carolina Gov. Mark Sanford Marshall (Mark) Clement SanfordTrump declines to participate in Weather Channel 2020 climate change special Weather Channel to talk climate change with 2020 candidates Trump accuses media, Democrats of going 'crazy' over G-7 at his Miami resort MORE, former Massachusetts Gov. Bill Weld William (Bill) WeldTrump declines to participate in Weather Channel 2020 climate change special Weather Channel to talk climate change with 2020 candidates Trump accuses media, Democrats of going 'crazy' over G-7 at his Miami resort MORE and Illinois Rep. Joe Walsh Joe WalshTrump declines to participate in Weather Channel 2020 climate change special Weather Channel to talk climate change with 2020 candidates GOP presidential challengers condemn decision to host G-7 at Trump resort MORE — were also invited to take part in the special.\n\n\"Andrew Yang has released an extensive and detailed plan to combat climate change and we're disappointed that the Weather Channel didn't reach out to let their viewers hear about it, especially given his place in the polls and fundraising,\" Zach Graumann, Yang's campaign manager, told the Examiner in a statement.\n\nHe added that Yang \"is focused on real solutions for the American people, and as we've seen in the past week, whether it's at the debate or the 10-hour Q&A he conducted on Friday, the American people want to hear what Andrew Yang has to offer. The media needs to learn from the mistakes of 2016 and get it right this cycle.\"\n\nIn a statement to the Examiner, the Weather Channel said it couldn’t interview Yang “in the interest of time.”\n\n\"The Weather Channel decided to choose the top seven Democrats in the polls, in accordance with the [Democratic National Committee] criteria to qualify for the third debate,” the Weather Channel said, adding that at the time of the network’s production deadlines, Sen. Amy Klobuchar Amy Jean KlobucharPoll: Biden holds 10-point lead nationally over Warren Robert Reich sees Democratic race as Warren, Sanders and Biden: 'Everyone else is irrelevant' Democrats lead Trump by wide margins in Minnesota MORE (D-Minn.), former Housing and Urban Development Secretary Julián Castro and Yang were not in the top seven among Democratic hopefuls.\n\n“As this is a bipartisan special, the network invited the three Republican challengers and President Trump. We are encouraged that many of the candidates have plans to address our changing climate and hope to have other opportunities for viewers to hear their thinking ahead of Election Day,” the Weather Channel added.\n\nTrump declined to participate in the event, and former Vice President Joe Biden Joe BidenTrump says he doesn't want NYT in the White House Warren to protest with striking Chicago teachers Schiff punches back after GOP censure resolution fails MORE (D), who remains a Democratic frontrunner, is unable to participate due to a scheduling issue.\n\nYang released a climate plan in August that focuses on private sector investment and nuclear power to achieve his goal of a “fully green” economy by 2049. His largely differs from those of other Democratic candidates due to its heavy reliance on clean nuclear energy.", "description": "Democratic presidential candidate Andrew Yang reportedly said Monday that he is “disappointed” that the Weather Channel didn’t invite him to take part in a bipartisan climate change special set to air next month.", "authors": [], "top_image": "https://thehill.com/sites/default/files/yangandrew_102119gn10_lead.jpg", "published_at": "2019-10-22"}