{"pub": "marketwatch", "url": "https://marketwatch.com/story/democratic-rivals-tee-off-on-elizabeth-warren-at-ohio-debate-2019-10-15", "downloaded_at": "2019-10-16 03:56:29.710862+00:00", "title": "Democratic rivals tee off on Elizabeth Warren at Ohio debate", "language": "en", "text": "Elizabeth Warren repeatedly came under attack during Tuesday’s Democratic presidential debate as rivals accused the Massachusetts senator of ducking questions about the cost of Medicare for All and her signature “wealth tax” plan.\n\nThe pile-on was the clearest sign yet that Warren has a new status in the crowded Democratic primary: a front-runner in the contest to take on President Donald Trump next year.\n\nThe night’s confrontations were mostly fought on familiar terrain for Democrats, who have spent months sparring over the future of health care with moderates pressing for a measured approach while Warren and Bernie Sanders call for a dramatic, government-funded overhaul of the insurance market. But unlike Sanders, Warren refused to say whether she would raise taxes on the middle class to pay for Medicare for All — a stance that’s increasingly difficult to maintain given her more prominent status.\n\nHer rivals seized on the opportunity to pounce.\n\n“I appreciate Elizabeth’s work but, again, the difference between a plan and a pipe dream is something you can actually get done,” said Minnesota Sen. Amy Klobuchar.\n\nRead: 12 Democrats square off over impeachment, health care in Ohio presidential debate: live blog recap\n\nPete Buttigieg, the mayor of South Bend, Indiana, added: “We heard it tonight. A ‘yes’ or ‘no’ question that didn’t get a ‘yes’ or ‘no’ answer.”\n\nWarren insisted that she has “made clear what my principles are here,” arguing that lower premiums would mean that overall costs would go down for most Americans.\n\nFeaturing a dozen candidates, the debate sponsored by CNN and The New York Times was the largest in modern history. It was the first time the White House hopefuls gathered in a little more than a month. In that time, the political landscape has changed with Trump facing an impeachment inquiry in the House centered on his quest to get Ukraine to dig up unflattering details about Joe Biden, another front-runner among the Democrats hoping to succeed him.\n\nThe debate also served as Sanders’ return to the campaign trail following a heart attack earlier this month. The Vermont senator failed to show the same fire as in previous debates. He got applause when he thanked supporters and rivals for their good wishes and declared, “I’m feeling great.”\n\nThe debate touched on foreign policy, too, a subject that has dominated the news in recent weeks as Trump said he was withdrawing most U.S. forces from Syria and then Turkey invaded the northern part of the country to attack Kurdish fighters. The Democratic presidential candidates denounced the president for abandoning Kurdish forces there, who are U.S. allies.\n\nHawaii Rep. Tulsi Gabbard, who served in Iraq with the Army, questioned the need for U.S. involvement in “regime change” conflicts in the Middle East. That prompted Buttigieg to respond: “What we are doing or what we were doing in Syria was keeping our word.”\n\n“I would have a hard time today looking an Afghan civilian or soldier in the eye after what just happened over there,” said Buttigieg, who served in Afghanistan. “It is undermining the honor of our soldiers. You take away the honor of our soldiers, you might as well go after their body armor next.”\n\nBiden had spent months facing sharp criticism from the rest of the field during debates, but he saw few candidates engage with him on Tuesday. Still, he struggled to fully explain why his newly promised ethics plan to prevent conflicts of interest involving his relatives wasn’t applied to his son Hunter when he was hired in 2014 as a director for a Ukrainian energy company.\n\nThat relationship has become a focal point of Trump’s effort to press for a Ukrainian government probe of the Bidens — an effort that was a major factor leading to the House impeachment inquiry into the president.\n\nOn Sunday, Biden had vowed that “no one in my family will have an office in the White House, will sit in on meetings as if they’re a cabinet member, will in fact have any business relationship with anyone that relates to a foreign corporation or a foreign country.”\n\nBut CNN anchor Anderson Cooper asked, “If it’s not OK for a president’s family to be involved in foreign businesses, why was it OK for your son when you were vice president?”\n\nBiden faltered some before offering, “My son did nothing wrong, I did nothing wrong.”\n\nStill, most of the back-and-forth focused on Warren. Taking aim at her proposal to tax the wealthiest Americans, Klobuchar said, “I want to give a reality check here” and former Texas Rep. Beto O’Rourke suggested it was “punitive.”\n\nThe senator said that notion shocked her: “I don’t have a beef with billionaires.”\n\n“Look, I understand that this is hard, but I think as Democrats we are going to succeed when we dream big and fight hard, not when we dream small and quit before we get started,” she said.\n\nAlso debating were California Sen. Kamala Harris, New York entrepreneur Andrew Yang, New Jersey Sen. Cory Booker and former Obama housing chief Julián Castro. Making his debate debut was billionaire activist Tom Steyer.", "description": "Elizabeth Warren repeatedly came under attack during Tuesday’s Democratic presidential debate as rivals accused the Massachusetts senator of ducking...", "authors": ["Associated Press"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT380_debate_ZG_20191015210251.jpg", "published_at": "2019-10-15"}