{"pub": "businessinsider", "url": "https://businessinsider.com/iex-brad-katsuyama-flash-boys-listing-trading-2019-9", "downloaded_at": "2019-09-26 21:10:59.879689+00:00", "title": "IEX's CEO Brad Katsuyama discusses failing to stand up a listings business, if he regrets being as vocal as he has, and what's next for the 'Flash Boys' exchange", "language": "en", "text": "IEX, the startup exchange that was featured in Michael Lewis' 2014 book \"Flash Boys\", exited the business of listing companies on Monday.\n\nThe exchange was able to get only one company, Interactive Brokers, to switch to it.\n\nIEX, which was founded in 2012 and gained regulatory approval to operate as an exchange in 2016, has struggled to gain significant market share, holding just shy of 3% in August.\n\nBrad Katsuyama, IEX's CEO and cofounder, spoke to Business Insider about the decision to walk away from listings, what went wrong, and the state of the exchange overall.\n\nClick here for more BI Prime stories.\n\nIt was over before it even started.\n\nJust more than a year after nabbing its first, and only, listing, IEX announced Monday it was exiting the listings business, with sole customer Interactive Broker returning to Nasdaq, where it had previously been.\n\nGetting companies to move from Nasdaq and the New York Stock Exchange over to IEX had been a point of emphasis for Brad Katsuyama, CEO and cofounder of the exchange, since it gained regulatory approval to do so in 2017.\n\nIn a conversation with Business Insider, Katsuyama explained what went wrong and what the future holds for the exchange, which is now over five years removed from being featured in Michael Lewis' 2014 best-selling book \"Flash Boys.\"\n\nFollowing is a lightly edited transcript.\n\nBusiness Insider: You had news Monday regarding shutting down your listings business. What was the reaction from folks in the building? What was the reaction from customers about seeing you exit listings?\n\n\n\nBrad Katsuyama: Sure. Yeah. The reaction from our clients was really positive. A lot of them viewed it as a non-event. There was a lot of excitement that we'd be focused more on trading and we got a lot of 'Smart choice, focusing on trading. It's your core.' It's kind of the essence of IEX. I think from our core clients it was very positive.\n\nOne interesting part is the reaction from the exchanges, is what was expected. I mean, they definitely try to use the news to pile on and spread around, I think, a lot of nonsense. The funniest thing that I've seen was an email sent to a number of people, got forwarded to me from a few different spots, where they said, 'Interactive Brokers' stock price was lower on IEX than when it was listed on NASDAQ' as kind of the headline.\n\nOur response back to some of the folks who got that was, 'Well, if you do a ten-second comp search, you'd realize, yes, Interactive Brokers was down 6% since listing on IEX, but TD Ameritrade was down 7%, E-Trade was down 15% and Schwab was down to 17%. I think it's just so typical of the fight we're in, generally, where it's, the exchanges are trying to keep people in the dark and they're on this misinformation campaign. We're trying to fight against that by just talking about how the stock markets actually work and trying to educate people.\n\n\n\nIt's symptomatic of why we're focusing back on trading, because it was a challenge to combat these blatant false facts, especially with a constituency, the companies, that have been left in the dark.\n\nThe way it played out with Interactive Brokers. Thomas Peterffy and I, periodically, I've touched base throughout the life of the listing. I think, both of us had the same goal to follow. When the switch happened, and I know there's a lot of chatter on spreads being a reason, spreads widened almost immediately. But the quote size grew 40% and became more stable. That's more of a by-product of who's on IEX and how our market was built. I think over the last year what we've seen that's led to this kind of decision was companies didn't end up following Interactive Brokers. We had been talking about the listings business for some time internally, but also we had made a commitment to Interactive Brokers that we wanted to uphold.\n\n\n\nWhen he expressed the desire to potentially switch back because of a lack of follow on, that was our opportunity to put our cards on the table. We had an incredible conversation and, frankly, that's why we had a joint announcement on Monday morning. We both expected and hoped for follow on. It didn't happen. We're exiting the business and they're moving back to NASDAQ. We continue to be great partners.\n\nOn a trading side, they're continuing to be a great trading partner. They handled this incredibly professionally. It was great to make that announcement in partnership with them, but to try to twist the narrative into something that it's not, I think is what the exchanges are trying to do. But this was a pretty solid decision for both us and Interactive Brokers.\n\nAdena Friedman, Nasdaq President and CEO REUTERS/Brendan McDermid\n\nYou said with your clients it was mostly positive. Did you get the sense that they maybe weren't happy that you guys had even made the decision to go into listings? That they felt it wasn't the right choice?Well, I think one really smart point that we got, which was part of our decision-making process, was their excitement for us to get into listings was really about the opening and closing auctions. In reality, the auctions are likely, if you look forward, going to get disrupted. Meaning, BATS Market Close is challenging the primary, stronghold on the close. Brokers are internalizing more at the close. It feels like the auctions, in many ways, which was one of the big incentives, it's almost like a race to zero. So, that was a factor in our decision to exit. And a lot of clients kind of picked up on that as well.So with all of that said, hindsight's 20/20, was it a mistake to have tried to have get into listings?Yeah, I think there are things that we learned over the last year that I think would have been hard to learn from the outside looking in. I think one of the mistakes we made was the idea that we tried to keep our explicit costs pretty low, because we knew it was going to be tough to take on a 45-year-old duopoly.\n\nI think that one of the things we didn't necessarily account for was the amount of time it was going to take to meet companies to educate them and, frankly, it kind of preyed on one of our weaknesses. It was that we really want to help people understand the markets. So, if I got an an email, or Ronan got an email, from a CEO or a CFO saying, 'Hey look, you're right about IEX, read \"Flash Boys\", we want to learn more about the markets.' The next thing you know we're on a plane to Houston or all over the country, right? West Coast. Silicon Valley. To try to educate.\n\nI think what we learned is that education is an important component, but it wasn't translating into listings. I think, that was a miscalculation that we made that would have been hard to calculate before we officially entered the business.\n\n\n\nBI: Just to kind of be clear, why didn't it translate into listings? What was the impediment there?\n\n\n\nKatsuyama: I think it was a factor of a few things. One is there's a huge amount of inertia and indifference around listings. A corporate executive wanting to switch their listing, still needed to get board approval and you needed one board member just to take the conservative route and be like, 'You know what? I think we're good where we are. We have other things to focus on.' Getting past the board was probably harder than we anticipated. That was one challenge.\n\nSome of the other challenges are there are embedded things. One really interesting example is we had a company right on the cusp of switching and it turned out that they had a convertible bond issued where one of the covenants is that it must be listed or quoted on NYSE or NASDAQ. One interpretation of that is, if you switch to IEX, which is not on this document, which has to be like 25-years-old, it would be a violation of a bond covenant.\n\nThese things pop out of nowhere. There's no way we could have planned for that. The last five yards ended up being much harder than we thought. We were excited about getting to that five-yard line, but that last five yards ended up being a hill much steeper than we had predicted.\n\n\n\nBI: How many times did you feel like you got to the five-yard line with companies?\n\n\n\nKatsuyama: I know we got to the five-yard line with a lot with a lot of companies, but the reality is that those didn't result in listing switches.\n\n\n\nFrom our standpoint, it's a business that is interesting at scale and ultimately we needed to get to scale to make it interesting. After a year we understood that the effort it would take to get the scale was not as good as of a return on investment as our trading business or some of the other opportunities that we have at IEX.\n\n\n\nBI: You mentioned that the clients felt positive about this because it's kind of a focus back to the core of what makes IEX, IEX. Where do you view the future? Is it going to be a case of putting the head down and really focusing on just growing the market share of the exchange, or is it going to be these other possible business ventures?\n\n\n\nKatsuyama: Unequivocally, our number one priority is the exchange trading business. We trade 6,000 stocks a day on average and we listed one. So, once the switch happens, we'll trade 6,000 stocks a day and list zero. Without question, it's our number one priority.\n\n\n\nWe have five new products that we want to launch in the next 12 months, which is kind of unprecedented for us since we've become an exchange. So, clearly, investing in that business, growing the sales effort, connecting with clients on a deeper level, and connecting with more clients, is our number one priority. But there are some other initiatives at IEX that we're building teams around that we think are really interesting opportunities for us.\n\nFrom our standpoint, and another reason I think we came to the decision to exit listings is that we look at any business that we're going to do and we run it through kind of a set of factors. Does fairness matter? Is the competition fair? Does transparency matter to the core client? Does performance matter? Does the end performance really matter? For our trading business, clearly, those are all important factors.\n\nBut things like IEX Cloud, which is really about building a platform that democratizes access to financial data for developers. Fairness, transparency, performance, these are all things that are important. It's the reason why I think it's had such rapid pickup. It's growing literally 13% a month, 30,000 plus users in a very short period of time.\n\nThese are businesses that I think align with our core ethos and who we are as a technology company. When we measured listings against that, it wasn't the same opportunity and it was getting to be more and more off brand.\n\nI'd leave a meeting talking about a machine-learning signal designed to protect investors on our exchange. I'd walk into another meeting where we are being pushed to open and close stocks in the Oculus. That to me, it's kind of one of those moments where the light bulb goes off and says, 'What are we actually doing here?' We're not an events company. We are a technology company and these things became more and more of focus and this decision creates a lot more clarity inside of IEX, for our clients, and it feels really good.\n\n\n\n\n\nThe Oculus Dave Smith/Business Insider\n\nYou said clarity within IEX. Was there pushback internally from employees about going into listings?Going in, not really. Our focus was really on getting the exchange approved. We didn't file for listings rules when we filed our exchange application. Really, the listing decision came after we got approved to be an exchange. It was what was expected of us. The amount of interest, I think, that the people inside the company saw really got us excited that here's another kind of closed network that we can disrupt. So there was excitement to enter, and as we got into the business several years later, we started to understand the realization of this is just not a business that, at this moment in time, IEX feels good about competing in.\n\nOne other lesson that's interesting to point out on listings. Again, hindsight is 20/20. I wish I had this insight before, but it's come to us as we've come to this decision. Our trading business is, our clients understand the problem and wanted a solution, and in coordination with them, we built IEX. We built it with the buyside. We partnered with brokers. That is the lifeblood.\n\nSome of these other businesses have been clients pulling us into different business areas. IEX Astral is a great example where in partnership with some of the largest buy-side firms in the world, they kind of rallied around IEX to say, 'Hey we need your help in aggregating data, normalizing data, storing it, enriching it,' to help them better understand how their orders are being executed. That's a pull. The clients are pulling us in.\n\nListings is we saw the problem. We saw that a 45-year-old duopoly was not serving these companies. They were left in the dark. Most of them had no idea how the stock market works. In a way, in retrospect, we were a solution looking for people to understand the problem. That's not a great business case. That was one of the big lessons learned for us too. There has to be a pull. The clients have to want the solution not, 'Here's a great solution, let me explain to you what your problem is.' That's a backwards business thesis, and we learned that pretty quickly. We haven't even been in the business a year and I think we learned that a while ago.\n\n\n\nBI: You talked about having conversations with people about wanting to open listings in the Oculus. The listings business is about show. It's about the drama of ringing the bell and people getting their moment. You guys are obviously pretty vocal. It sounds like you're going back to just technology being at the core of it, maybe losing some of that showiness. Maybe kind of just more quietly going about the business with some of the products that you're talking about. Is that a fair characterization?\n\n\n\nKatsuyama: Yeah, that's a really good characterization. We aren't an events company. From our perspective, even take our opening and closing bell. It's a tradition in the exchange. Our team really likes it, and we've iterated on many different processes on how can we do this. And we landed on the theme of education. Our opening and closing bell is literally someone trying to press a cube as close to 9:30 am or 4:00 pm, measured to the microsecond. It's hilarious to see some peoples' reaction times are literally like a hundred times the speed of our speed bump. Humans have no chance in a machine-dominated world. It gives us a way to educate. So when you press the button and your time comes up, we will equate that time to some distance around the earth, to some distance inside of IEX as an internal process. Of the hundreds of people that have pressed it, I think one person has been less than five milliseconds from the open, which is 15 times the length of our speed bumps.\n\nIt is kind of an event, but it's an event with a purpose. It's about education. And I think that felt true to us. Setting up a shop in the Oculus did not feel authentic to IEX. I think coming to that realization was another data point along the way that listings was not a business for us, at this moment in time, because those things are important to some players.\n\nT.J. Kirkpatrick/Getty Images\n\n\n\nBI: What about in general? Do you regret being as vocal as you guys have been over the years? A lot of people would say for as loud as you guys were, you haven't been able to kind of put your money where your mouth is and you aren't as relevant as you guys have promised you would be at this point. Do you regret being one of the loudest dogs in the room early on and putting that target on your back?\n\n\n\nKatsuyama: Not at all. I think this was an industry that needed a lot of transparency. I think we had a lot of support, and we had a lot of knowledge that I think we wanted more people to have. When you're loud but you're telling the truth, that's not something that we ever back away from.\n\nFrom an impact standpoint: This year, as an example, it will be a record year in volume and market share. But also, importantly, in revenue and profits as a company. We're larger than the London Stock Exchange on a daily notional basis.\n\nWhen you look at things like more disclosure from the SEC. ATS transparency. We were the first ATS to publish our rules. If you look at the transaction fee pilot, these are all things that we have been linked, arm-and-arm, with investors in fighting for. You see the market changing before our eyes. Maybe not as fast as we'd like to see. But when look at these changes, and you look at the things that we've said, going back to when we started IEX. These things are true. These things are making the market better. Yeh, there's no regrets in terms of the role that we've played in this market.\n\nI think, from our standpoint, we'll continue to be a voice for investors, for brokers. Even look at market data and connectivity. We got loud about that. It's not a business for us. We sacrificed millions of dollars by not participating, But we got loud because it was the right thing to do. That continues to be what we're about, and yeh, we have no regrets on that end.\n\n\n\nBI: So you wouldn't categorize IEX as a failure to this point?\n\n\n\nKatsuyama: No, not at all. I mean, listen, we've been profitable since 2015. We're having a record year. We've had a huge impact. We do more notional than the London Stock Exchange. And I think the market is on the precipice of significant change. We've been a part of advocating for that change. I think the best is yet to come for IEX. But if you had told me we'd be in this position when we started, I would have taken it a hundred times out of a hundred.\n\nBI: You would be happy with the market share you guys currently have? Before you even launched IEX, as you went down this route, you'd be comfortable with where you guys are at in terms of market share?\n\n\n\nKatsuyama: Yeah, I mean, our market share could be bigger if we paid rebates. Our market share could be bigger if we didn't have a speed bump or a machine-learning signal. There are many ways to grow market share. I think growing market share to the extent we've grown it, keeping our principals intact, and continuing to see growth ... Also, more importantly, seeing the dynamics of the industry change. Looking at who our top brokers are and how they're growing. Again, we knew we were headed for a lot of resistance. I think change has been slower than we would have imagined. So yeah, I would have liked to have seen more regulatory change sooner. I would liked to have been approved as an exchange after three months or five months, not two years. But I think where we are today, it's why we're operating a profitable company and why we've remained disciplined, because we know this is a long battle.\n\nSo, if you said, 'Hey, IEX will be here in seven years. Will you take that?' A hundred times out of hundred. We know we're not in a race. This is a marathon in an industry that a lot of times doesn't want to change. We measure success on where we are now, how much progress we've made, and how much momentum we have. All those things line up. If I could have done that in three years, of course I would've taken that. But we're in the position where we're in. We're fighting for things we believe in, and things are moving in our direction. We have a lot of momentum. But, again, we have to be disciplined and I think making this decision was part of that.\n\nIEX's latest video mirrors that of an infomercial IEX\n\nWe've heard from people that at times you've been difficult to work with. Part of that ties into people getting a little frustrated with always wanting to be in the spotlight. Whether it's launching the CNBC commercial or always looking to pick fights when at times people are just like, 'We kind of want to put our heads down and just try to grow this business.' Is that a fair assessment. What would be your response to those claims?I think, from our standpoint we have high standards as a team for conduct. We have high standards for the team in terms of the work we're trying to do and how we're trying to accomplish that. For us it's been pretty purposeful about not trying to be in the spotlight when we don't need to be. We're more comfortable now than we were after \"Flash Boys\". I think without question we're more comfortable behind the scenes. I don't think we seek it out. If we have something to say, we say it. I think from our standpoint that's really key.\n\nIf you look at any startup that has been around for seven years and is growing, we had historically very low turnover as a company for a long period of time. Our board questioned that, and I think we took that as a positive. In reality, a certain amount of getting new people into the company with new perspectives, leveling up in certain instances, these are all things that I think are important.\n\nRob, Ronan, myself, John, obviously, has just recently announced his retirement, but we worked together as a team for 10 years. I think for cofounders that's kind of unheard of. Again, we have high standards at IEX. Our clients have high standards in terms of what they expect from us. And so as a result we hold our employees to high standards.\n\n\n\nBI: You said you're more comfortable now than you were in the aftermath of \"Flash Boys\". Do you regret being featured in that book? In how it's changed your timeline and changed the company's timeline, do you regret having gone down that route as opposed to just making your own bed?\n\n\n\nKatsuyama: No, I think if you look back at the context of \"Flash Boys\" and when it came out, IEX, we were having trouble getting funding. We had a story to tell. And when Michael Lewis wants to tell your story, how can you possibly say no to that? What Flash Boys did is it gave us a platform.\n\nI'm not sure IEX gets approved as an exchange if Flash Boys isn't written, because what it did is it created public awareness. If you look back at the SEC fines and all these other cases that have come as a result, the things in Flash Boys were true. I think, from our perspective, we hit the lottery. We got really lucky that happened.\n\nI'm not exactly sure where IEX is. Great ideas are a dime a dozen. I think you've got to execute it and you need a little bit of luck. Certainly, there's no part of Flash Boys that we regret.\n\nAt the same time we've matured as a company. I think that we pick our spots, and we're cognizant that the industry wants to view us as a change agent, not just a rabble rouser. I think, from our perspective, that's what we've morphed into. It's gained the respect of people who probably at one point didn't like us after \"Flash Boys.\"\n\n\n\nBI: So just going forward, is the future of IEX a tech company that also does run an exchange? These other lines of business, I understand they're core to kind of what you guys do, but they're also more of the tech-type offerings as opposed to specifically just kind of matching trades. Is that the future of what IEX looks like in five years from now?\n\n\n\nKatsuyama: Yeah. There's no question in the near future, the stock exchange will continue to be a core part of IEX's business. But we built our technology from the ground up, and there are other ways to deploy that technology where the return on investment in some of these new businesses is quite high because we've done a lot of the heavy lifting already. So yeh, I do think aspirationally we are a technology company that runs a stock exchange. From our standpoint, the stock exchange gives us credibility, because this technology is being deployed in ways ... It's like a built in use case in many ways. But some of these new opportunities I think are are quite big and we're excited about investing in those and seeing them grow.", "description": "The CEO of the exchange featured in Michael Lewis' book Flash Boys sat down for a Q&A with Business Insider about the state of the exchange.", "authors": ["Matt Turner", "Dan Defrancesco"], "top_image": "https://image.businessinsider.com/5d8ccd252e22af00236b84da?width=1200&format=jpeg", "published_at": "2019-09-26"}