{"pub": "investingcom", "url": "https://ca.investing.com/news/economy/nine-countries-join-us-strategic-minerals-initiative-1976305", "downloaded_at": "2019-09-26 17:09:16.549034+00:00", "title": "Nine countries join U.S. strategic minerals initiative", "language": "en", "text": "© Reuters. Nine countries join U.S. strategic minerals initiative\n\nSept 26 (Reuters) - The United States on Thursday said nine countries have joined its initiative to help discover and develop reserves of minerals used to make electric vehicles, part of an effort to cut the world's reliance on China for the high-tech materials.\n\nSecretary of State Mike Pompeo on Thursday met with foreign ministers from the nine countries on the sidelines of the United Nations General Assembly in New York.\n\nThe countries joining the United States include Australia, Botswana, Peru, Argentina, Brazil, Democratic Republic of the Congo, Namibia, the Philippines and Zambia.\n\nUnder the Energy Resource Governance Initiative (ERGI) announced in June, the United States will share mining expertise with member countries to help them discover and develop their minerals such as lithium, and cobalt, as well as advise on management and governance frameworks to help ensure their industries are attractive to international investors. we see is an opportunity to provide a government to government engagement,\" Frank Fannon, the top U.S. energy diplomat, said in an interview. \"U.S. companies require a certain set of above-ground conditions regardless of what's below ground.\"\n\nWashington grew more concerned recently about its dependence on mineral imports after Beijing suggested using them as leverage in the trade war between the world's largest economic powers. That could interrupt the manufacture of a wide range of consumer, industrial and military goods, including mobile phones, electric vehicles, batteries, and fighter jets.\n\nMining companies in Congo have struggled to secure their sites from small scale prospectors digging for minerals. In June, 43 illegal miners were killed by a landslide at a Glencore (LON: ) GLEN.L facility in Congo, highlighting the challenge.\n\nWhen it first introduced ERGI, the State Department said Canada was part of the initiative, but the U.S. neighbor was not listed as a member on Thursday because Foreign Minister Chrystia Freeland stayed at home for the election campaign period.\n\nA U.S. official said the Trump administration \"remains hopeful that Canada will join the initiative in the near future.\"\n\nThe U.S. Department of Defense is also searching for better supplies of strategic minerals, including rare earths, around the globe. Reuters reported in June that the Pentagon held talks with Malawi's Mkango Resources Ltd , Burundi's Rainbow Rare Earths Ltd and other miners about securing supply.", "description": "Nine countries join U.S. strategic minerals initiative", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEDA210G_L.jpg", "published_at": "2019-09-26"}