{"pub": "guardian", "url": "https://theguardian.com/football/2019/sep/21/liverpool-big-six-away-days-chelsea-jurgen-klopp", "downloaded_at": "2019-09-22 00:30:20.760608+00:00", "title": "Klopp hungry for high-rolling Liverpool to make away days pay", "language": "en", "text": "Just one victory at rivals from the upper reaches cost Jürgen Klopp’s side last season – their visit to Chelsea on Sunday is their first chance to improve on that record\n\nThe last time Liverpool won at Stamford Bridge, Antonio Conte was in charge and Chelsea were on their way to the 2016-17 title. Although Jürgen Klopp only celebrates his fourth anniversary at Anfield next month, Frank Lampard will be the fourth Chelsea manager he has encountered, and though Liverpool are the side with a lead at the top of the Premier League table, they are under more pressure to perform on Sunday afternoon than a carefree young home side just beginning to produce the football supporters want to see.\n\nOne of the side effects of Liverpool and Manchester City slugging it out for the major prize this season is that rookie managers such as Lampard and Ole Gunnar Solskjær have something of a free hit.\n\nKlopp surprised but not worried by Liverpool’s worsening big-six record Read more\n\nNo one sees Chelsea or Manchester United as potential Premier League winners yet. Both clubs can, to an extent, concentrate on restoring the feelgood factor after some testing times under previous managers while taking advantage of the recognition that below the top two, the Champions League places appear to be attainable.\n\nLiverpool are obliged to look at things differently, partly because they expect another season of intense competition from City, and partly due to the knowledge that away form is an area that needs improving.\n\nIn the two seasons since Chelsea won their last title, Liverpool have recorded only a single away win against top-six opposition in the league, against Tottenham a year ago. That stat seems surprising given that Klopp’s side lost only once last season and finished just a point behind City, though not only is Pep Guardiola’s away record against top sides much better, Roy Hodgson and Crystal Palace have won at both Manchester clubs and Arsenal in the past 12 months.\n\nKlopp knows that drawing too often cost Liverpool in the league last season. Yet he also finds it difficult to accept that a point against a good side away from home can be regarded as anything other than a positive result.\n\n“Last season when we drew at Chelsea, Arsenal and Manchester United, they were positive results,” the Liverpool manager explains. “If we had tried to win some of those games we would have lost. You have to make sure you stay in the game first and foremost, then if the chance to win comes along you can try and take it.\n\n“We should have won at Arsenal last season because of the chances we created and that would have been enough, but we cannot change anything now. You cannot always go for the win because if you open up in the last 20 minutes you give the other team a chance. Sometimes you can lose by going for a win, so you have to be sensible and solid and do the right things at the right moment. Your offensive actions have to be protected.\n\n“A draw against a rival team will always be a decent result away from home, but at the same time you have to be looking for the moment in the game when it makes sense to go for it. If it is 1-1 late in a game we don’t take the ball into the corner, but we don’t go nuts either.”\n\nFacebook Twitter Pinterest Alexandre Lacazette evades Alisson before levelling for Arsenal on Liverpool’s visit to the Emirates last season. Photograph: Julian Finney/Getty Images\n\nThat traditional philosophy would have served Liverpool well last season but for City’s remarkable tenacity in the run-in. That the defending champions have already allowed Liverpool to open a five-point gap going into this weekend prompted Guardiola to jokingly award the title to Liverpool after last Saturday’s defeat at Norwich, though Klopp does not feel this season will necessarily follow the pattern of the last campaign.\n\n“We only lost one game last season but I’m pretty sure that will not be the case this year,” he says. “There will be no team who will lose just once, I would say that is unlikely, and after five games the league is definitely not won already.\n\n“We have made a good start, that’s all, but so far nothing has really happened, we have not even created a basis. We have already seen that the league is much different this year. There is not a team who you think will go down with no points. Watford are bottom but performance-wise could be several points better off, and although Wolves are struggling a bit at the moment I think they will end up going back up there.”\n\nSimply by virtue of being away from home, Sunday’s fixture is Liverpool’s biggest challenge of the campaign so far, on the domestic front at least, and it should also test the theory that last season’s top two will simply continue to engage in a private battle for the title.\n\nPremier League title is now Liverpool's to lose? Don't be daft Read more\n\nThat Liverpool can be beaten was amply demonstrated by Napoli in midweek, when Klopp admits his policy of attempting to secure a goalless draw in the Champions League was exposed by the Italians’ persistence. “The performance was good enough to get a point and it was much better than last year against a really strong side,” he says.\n\n“We cannot say the result was bad – we’ve got to look at it as an improvement. If they had not got a penalty it would probably have been 0-0 and we would have been fine with that. If you don’t win, you want a point. We ended up with nothing, but that can happen.\n\n“The performance was good so it’s not the moment to say we have to respond because we were so bad. We were playing a good team and we controlled a lot of the game, we just weren’t as dominant as we would have liked to be in the final third.”", "description": "Just one victory at rivals from the upper reaches cost Jürgen Klopp’s side last season – their visit to Chelsea on Sunday is their first chance to improve on that record", "authors": ["Paul Wilson"], "top_image": "https://i.guim.co.uk/img/media/60478bdc559fa72fe4fe0ac09636f78df9f3cdb9/133_0_4192_2515/master/4192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=f96138d967d939f8b2829685f970377f", "published_at": "2019-09-21"}