{"pub": "vice", "url": "https://vice.com/en_asia/article/evjvap/wild-boars-malaysia-swim-indonesia", "downloaded_at": "2019-09-12 07:09:13.678109+00:00", "title": "Malaysian Authorities Claim Wild Boars Swam to Their Shores All the Way From Indonesia", "language": "en", "text": "Indonesia has its fair share of problems, from pollution, to human rights violations, to the rise of religious conservatism. Sometimes it makes us want to get up and move to another country, but we didn’t realise that Indonesian wild boars wanted to do the same, at least according to Malaysian authorities.\n\nLast week, Malaysia’s Malaccan Head of Farming, Agrobusiness Development, and Cooperatives, Norhizam Hassan Baktee, said that wild boars from the Indonesian island of Sumatra swam across the Malacca strait, invading Malaysia’s Besar Island 15 kilometres off Malacca. He said he also received reports from fishermen of boars swimming ashore in the dead of night.\n\n“Malacca is being invaded by wild boars from Indonesia,” Baktee said.\n\nIndonesia and Malaysia have always had border disputes, but this might be the first time the border-jumpers in question aren’t human.\n\nBesar Island, a protected island, has experienced environmental damage since the migration of these wild boars.\n\n“Besar Island seems to have become a landing point for wild boars before they cross to Ujong Pasir in the mainland. Besar Island had experienced widespread environmental destruction due to the migration of dozens of boars,” Baktee said.\n\nIf left uncontrolled, the number of boars on Besar Island, which is sparsely populated, may come to outnumber the humans living there. Considering the damage they’ve done, the department of wildlife at the Malacca National Park has made efforts to control the growing population of boars on the island.\n\n“National Parks and Wildlife Protection Services has sent three shooters on a mission to save Besar Island from these boars,” he said. He also announced that the wildlife department of the Malacca National Parks Service is already making efforts to control the population of boars on Besar Island.\n\nSuharyono, who goes by one name and is the head of Natural Resource Conservation in Riau in the Indonesian island of Sumatra, doubts the Malaysian government’s claims and said that they are difficult to corroborate.\n\n“Is it even possible for boars to swim so many kilometres across the Malacca strait? We doubt that,” Suharyono said. “It’s also difficult to prove that they came from Indonesia.”\n\nZulhusni, a Sumatran animal activist who goes by one name, said that if the wild boars did, in fact, cross from Indonesia, they most likely crossed from Rupat Island, Riau, just off Sumatra. The island is populated with scores of wild boars and is the closest island to Malaysian waters.\n\n“Even though there are many wild boars on Rupat Island, we’ve never seen or heard of any boars from Rupat crossing the Malacca strait to Malaysia,” Zulhusni said.\n\nThe WWF can’t confirm this either. “We have never received reports that wild boars from Sumatra have crossed the Malacca strait to Malaysia,” Syamsidar, a Riau WWF spokesperson said.\n\nWild boars are known for their ability to swim and adapt to different environments. In an article titled “The feasibility of reintroducing Wild Boar (Sus scrofa) to Scotland,” author R. Leaper wrote that wild boars are skilled swimmers. Despite the fact that the average boar weighs 100 kilograms, they are capable of crossing lakes and rivers. On land, boars can run up to 50 kilometres per hour.\n\nBut the Malacca strait, the second-largest centre for trade and oil transport after the Strait of Hormuz in the Persian Gulf, has tidal currents reaching up to 0,07-1,19 m/second, making it highly unlikely that the boars would have survived the trip.\n\nOn Google Maps, the distance between Besar Island and Rupat Island is 62.59 kilometres. On top of that, the boars would have had to deal with the many boats that sail the strait; over 600 boats a day, according to Stairtrep.", "description": "This might be the weirdest immigration scandal ever.", "authors": [], "top_image": "https://video-images.vice.com/articles/5d77667569c9120008c7fe0c/lede/1568106736293-20312092492_395922195b_k.jpeg?crop=1xw:0.8563xh;0xw,0.0037xh&resize=1200:*", "published_at": "2019-09-12"}