{"pub": "investing.com", "url": "https://coindesk.com/bitcoin-has-failed-but-global-stablecoins-a-threat-say-bis-and-g7", "downloaded_at": "2019-10-18 10:40:40.093547+00:00", "title": "Bitcoin Has Failed But Global Stablecoins a Threat, Say BIS and G7", "language": "en", "text": "Bitcoin and other early cryptocurrencies have failed as an “attractive means of payment or store of value,” says a new report from the G7 and Bank of International Settlements (BIS).\n\nHowever, the October report, argues that widely adopted asset-pegged cryptocurrencies, or stablecoins, such as Libra are a growing threat to monetary policy, financial stability and competition.\n\nWidely adopted stablecoins, dubbed “global stablecoins” in the report, have the potential to reach an international audience and have “significant adverse effects” on the current economic system, it argues.\n\nMeanwhile, “[first generation cryptocurrencies like bitcoin] have suffered from highly volatile prices, limits to scalability, complicated user interfaces and issues in governance and regulation, among other challenges. Thus, cryptoassets have served more as a highly speculative asset class for certain investors and those engaged in illicit activities rather than as a means to make payments.”\n\nStablecoin taxonomy – defined as a money equivalent, contractual or property claim, or right against an issuer for an asset – will remain a preeminent legal question for the time being, the report continues. The effects of stablecoins on incumbent money systems such as wire transfers have yet to be fully understood as well.\n\nWhile stablecoins may offer faster, cheaper and more inclusive payments, they can “only be realized if significant risks are addressed.”\n\nIn a footnote, the G7 report says the Swiss Financial Market Supervisory Authority’s (FINMA) handling of the Libra Association, which falls under the regulator’s purview in Geneva, agrees with the G7’s stablecoin recommendations.\n\nFINMA recently said Libra highlights the need for international coordination and “appropriate prudential requirements” for all services offered over that of a payment system.\n\nThe report on stablecoins was prepared at the request of the G7 in July, soon after the launch of Libra back in June.\n\nBitcoin image via Shutterstock", "description": "", "authors": [], "top_image": "https://static.coindesk.com/wp-content/uploads/2019/10/bitcoin-image.jpg", "published_at": "2019-10-18"}