{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7559519/Victoria-Beckham-jokes-Harper-likens-Mrs-Doubtfire.html", "downloaded_at": "2019-10-10 19:06:58.414752+00:00", "title": "Victoria Beckham jokes Harper likens her to Mrs Doubtfire", "language": "en", "text": "Victoria Beckham has revealed her daughter Harper likens to her to Mrs Doubtfire as she gave away some family secrets during a new make-up tutorial.\n\nThe former Spice Girl also said that husband David, 44, never sees her with her make-up on, as she rarely wears it at home.\n\nThe 45-year-old played makeup artist as she made over world famous artist Lisa Eldridge during the funny new YouTube video.\n\nScroll down for video\n\nWhat a thing to say! Victoria Beckham jokes Harper, 8, likens her to Mrs Doubtfire and revealed husband David never sees her with her make-up on in a funny new YouTube video\n\nIconic: Mrs Doubtfire is a fictional character played by the late, great Robin Williams\n\nThe two applied products from Victoria Beckham’s new make-up line, Victoria Beckham Beauty, and shared beauty tips and tricks with each other.\n\nVictoria told Lisa: 'Harper loves it when I have my make-up done for an event. She says, \"Mummy goes out looking like Mrs Doubtfire\".'\n\nLisa replied: 'Your home atmosphere is so lovely. You have such a warm home.'\n\nVictoria continued: 'David will be like, \"Wow, you've made an effort\". Normally he sees me running around without make-up on at home.'\n\nTrading places: The 45-year-old played makeup artist as she made over world famous makeup artist Lisa Eldridge using products from her own cosmetics range\n\nPared back: Victoria also said that husband David never sees her with her make-up on, as she rarely wears it at home\n\nVictoria said: 'David will be like, \"Wow, you've made an effort\"' about her new look and Harper (left) loves to watch her having her make-up done before events\n\nWhile Victoria prefers a pared-back look these days, she said it wasn't always the case when she was in the Spice Girls.\n\nShe said: '[Back then], we would do 'disco' in the day. You feel like if you put more blusher on, it's going to be OK. There are so many looks I regretted.'\n\nAs Lisa continued to work on her face, she giggled: 'Give me a bit of help Lisa, give me a jawline.'\n\nWhen it was Victoria's turn to do Lisa's make-up, she joked: 'Don't be scared. I do Harper's make-up all the time.'\n\nLaugh a minute: When it was Victoria's turn to do Lisa's make-up, she joked: 'Don't be scared. I do Harper's make-up all the time'\n\nTalking about the Spice Girls, she said: '[Back then], we would do 'disco' in the day. There are so many looks I regretted. We thought more and more blusher was OK' (pic date unknown)\n\nSOS! As Lisa continued to work on her face, she giggled: 'Give me a bit of help Lisa, give me a jawline'\n\nFriday is International Day Of The Girl and Lisa Eldridge’s You tube channel is set up as a charity, with 100% of the advertising revenue is donated to Plan International.\n\nThis means that every time one of Lisa’s makeup videos is viewed, it contributes to a good cause.\n\nLisa has been supporting Plan International UK education projects in Africa for more than two years.\n\nShe initially funded 120 Girls’ Rights Clubs (GRC) in some of Uganda’s poorest communities. 3,480 girls learned about their rights and the value of education.\n\n97% of these decided to complete their education including 200 adolescent mothers who re-enrolled in school.\n\nLisa is now supporting a project in Zimbabwe to give more than 21,000 marginalised girls learning opportunities and the chance of an independent future.", "description": "Victoria Beckham has revealed her daughter Harper likens to her to Mrs Doubtfire as she gave away some family secrets during a new make-up tutorial.", "authors": ["Rebecca Davison For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/17/19548664-0-image-a-195_1570724288099.jpg", "published_at": "2019-10-10"}