{"pub": "yahoo", "url": "https://news.yahoo.com/thirdgrader-cried-happy-tears-when-classmates-organize-toy-drive-after-he-lost-everything-in-a-house-fire-141825169.html", "downloaded_at": "2019-10-01 15:48:08.701453+00:00", "title": "Third-grader cried 'happy tears' when classmates organize Toy Drive after he lost everything in a house fire", "language": "en", "text": "Two weeks ago, a family in Philadelphia, Tenn. lost everything in a house fire. As the family experiences a whirlwind of emotions, the small, tight-knit community has stepped up to help ⁠— including Daniel Hunt's third-grade classmates.\n\nOn Sept. 21, Daniel's mother, Kristen Hunt Wilburn, was fixing lunch and getting ready to head out for the day when their kitchen caught on fire near the oven. \"I tried to find something to put it out with and had no luck so we got out,\" Wilburn tells Yahoo Lifestyle, adding that her husband, Joseph, was at work at the time. \"I sent Daniel across the street to my sister's house to get help while I was on the phone with 911.\"\n\nWhile the cause of the fire remains unknown, the family is thankful that no one was hurt and that they have a community to lean on during this difficult time. \"We have had churches, the Red Cross, neighbors, family, and friends all reach out and help in some way,\" Wilburn says. \"We are very blessed and thankful.\"\n\nBut the community members aren’t the only ones stepping up. Among those pitching in are eight-year-old Daniel's classmates at Philadelphia Elementary School, his third-grade teachers and his peers' parents.\n\nDaniel Hunt, 8, stands in front of the toys his classmates donated to him after he lost everything in a house fire. (Photo: Philadelphia Elementary School, Kristen Hunt Wilburn) More\n\n\"We knew that the kids would want to do something for Daniel,\" Casey MacKintosh, Daniel's homeroom teacher, tells Yahoo Lifestyle. \"We decided it would be fun for them to get to sneak toys in and surprise Daniel by getting toys to replace the ones he lost in the fire.\"\n\nSo on Monday, MacKintosh and the school's fellow third-grade teachers, Emily Petersen and Kelli Montooth, sent a letter home to the students' parents explaining the situation and proposing a secret toy drive for Daniel. For a week, Daniel's classmates and the other third-grade classes secretly brought in toys for Daniel.\n\nToys donated by third-grade students at Philadelphia Elementary School to a peer who lost everything in a house fire. (Photo: Philadelphia Elementary School, Kristen Hunt Wilburn) More\n\n\"It was amazing to witness the excitement these third-grade kids had while sneaking in toys. The entire week, they couldn’t love him enough,\" MacKintosh says. “They gave more than we ever thought. The parents and the students responded with lots of love and donations. They were more than happy to help out.\"\n\nOn Friday, the day of the big reveal, MacKintosh says there was a buzz in the air as Daniel's classmates got more and more excited to see his reaction. After sending him out on a quick errand, she brought all the third-grade classes into the classroom where they piled up the toys. \"When he came in we yelled 'Surprise!' He was speechless for a minute,\" MacKintosh says. \"He said, 'I love it!' Everyone come here,' with his arms open wide. The kids immediately swarmed in for a large group hug.\"\n\nMacKintosh, who describes Daniel as one of the most \"positive, happy students\" she has ever seen, believes that is the perfect example of his character. \"He didn’t immediately start going through the toys,\" MacKintosh says. \"He wanted to give his classmates a hug for what they did for him.\"\n\nWilburn was at work when the school sent the photos and video of Daniel's big surprise. \"I just cried! I couldn’t believe they did such a nice thing for my son,\" Wilburn tells Yahoo Lifestyle. \"It was overwhelming in a good way. Daniel's teachers are absolutely wonderful! They are caring and they truly love all of their students. The students are amazing! I loved their little giggles while they waited to surprise him and seeing how happy they were to do something for Daniel.\"", "description": "After an eight-year-old student lost everything in a house fire, his third grade peers came together to throw a surprise Toy Drive.", "authors": ["Hope Schreiber"], "top_image": "https://s.yimg.com/uu/api/res/1.2/_dP7QlKH.nab597WdTIClw--~B/aD0zMDI0O3c9NDAzMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/74e86100-e3db-11e9-be7e-a8ce593abddf", "published_at": "2019-10-01"}