{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/2019091710277/fedex-hit-by-trade-tensions-and-split-with-amazon-update", "downloaded_at": "2019-09-17 23:23:52.582305+00:00", "title": "FedEx Hit by Trade Tensions and Split With Amazon — Update", "language": "en", "text": "By Paul Ziobro\n\nFedEx Corp.'s profit fell in its latest quarter as added costs to expand services, the loss of Amazon.com Inc. as a major customer and a weakening economic backdrop weighed on results, sending its shares down sharply in after-hours trading.\n\nThe delivery giant lowered its outlook for the year and is taking more cost-cutting steps to try to offset the weaker environment, including reducing the capacity in its global air delivery network, which is feeling the effects of global trade disruption more acutely than other FedEx units.\n\n\"Our performance continues to be negatively impacted by a weakening global macro environment driven by increasing trade tensions and policy uncertainty,\" FedEx Chief Executive Frederick Smith said in a news release.\n\nFedEx said it now expects lower revenue for the coming year than when it last issued a forecast in June.\n\nShares of FedEx fell more than 9% to $157.44 in after-hours trading Tuesday after closing down slightly at $173.30.\n\nFor the first quarter, which ended Aug. 31, FedEx reported a profit of $745 million, or $2.84 a share, compared with net income of $835 million, or $3.10, a year earlier. Excluding integration expenses, per-share earnings were $3.05.\n\nRevenue declined slightly to $17.05 billion.\n\nAnalysts polled by FactSet expected earnings of $3.15 a share and $17.06 billion in revenue.\n\nWrite to Paul Ziobro at Paul.Ziobro@wsj.com\n\nCorrections & Amplifications\n\nThis item was corrected at 6:53 p.m. ET to show that FedEx's profit in the fiscal first quarter a year ago was $835 million, not $8.35 million.\n\n(END) Dow Jones Newswires\n\nSeptember 17, 2019 17:04 ET (21:04 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-09-17"}