{"pub": "cbs", "url": "https://cbsnews.com/news/purdue-pharma-settlement-proposed-sackler-family-could-pay-billions-opioid-crisis-2019-09-10", "downloaded_at": "2019-09-10 23:29:35.865454+00:00", "title": "Sackler family could pay billions in personal wealth to settle opioid lawsuits", "language": "en", "text": "Stamford, Connecticut — CBS News has learned the billionaire Sackler family, who own Purdue Pharma, are willing to give up ownership of the company and pay an additional $3 to $4.5 billion from their personal wealth to settle more than 2,000 lawsuits accusing the drug maker of fueling the opioid crisis.\n\nThe settlement offer comes amid speculation that Purdue Pharma is about to go bankrupt.\n\nOver two decades, while the sale of the painkiller Oxycontin generated billions in profits for the drugmaker, the nation's opioid addiction was reaching a crisis. According to the U.S. Centers for Disease Control and Prevention, overdose deaths linked to prescription opioids have killed more than 218,000 Americans since the late 1990s.\n\nTony LaGreca's son Matthew died in 2014 after a long struggle with prescription opioids. He said his addiction started with a single bottle of Purdue Pharma's Oxycontin to treat a football injury.\n\n\"They're offering a certain amount of money. And first of all the amount of money is way too small,\" LaGreca said. \"There's still millions of people who now are still fighting addiction. And that addiction has come from the initial prescription from opioids.\"\n\nMeanwhile, a threat of bankruptcy looms. A source close to negotiations say there's no timing on a potential filing. But CBS News has learned Purdue has given plaintiffs a deadline of Wednesday to accept the deal, or it will file for bankruptcy.", "description": "Purdue Pharma, the maker of Oxycontin, is accused of fueling the opioid crisis", "authors": ["Mola Lenghi"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2017/03/29/9c198fcb-d0b3-46a2-9397-7087a976758a/thumbnail/1200x630/96e9e3e265088ab72db1e20a7f8c999b/craig-oxycontin-lawsuit-3-2017-3-29.jpg", "published_at": "2019-09-10"}