{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/game-thrones-script-originally-extra-20713138", "downloaded_at": "2019-10-24 14:15:02.558817+00:00", "title": "Game of Thrones script originally had extra incest in season eight", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nYou may not believe it but there was once the possibility of even more incest in Westeros.\n\nGame of Thrones came to an explosive but controversial end earlier this year, but the release of the script for the final season has revealed new details to add context to the episodes. It has also revealed scenes and segments that didn't make the cut - including a key moment in Daenerys's story and her jealousy in regards to Grey Worm.\n\nHowever, another moment could have featured even more incest - in a show that already gave us the likes of twins Jaime and Cersei Lannister along with Jon Snow and aunt Daenerys Targaryen.\n\nAccording to Insider , who viewed the script for the season 8 premiere Winterfell, a gross interaction was toned down for the final cut.\n\n(Image: HBO)\n\nThe episode showed Yara Greyjoy (Gemma Whelan) as a captive of her evil uncle Euron Greyjoy (Pilou Asbaek), but the episode almost went further, with the script saying that he \"kisses his niece on the lips\" after boasting of how he's going to \"f**k the Queen\".\n\nHe would then have told her to \"sit here and s**t yourself like a good little girl.\"\n\nEver classy, Euron!\n\n(Image: HBO)\n\nThe script also included more discussion between Euron and Golden Company leader Harry Strickland about sleeping with Cersei, saying \"She can think of him while I'm inside her\" when Strickland mentions how Jaime Lannister won't like Euron sleeping with his sister-lover.\n\nSomehow we could have had an even more despicable Euron!\n\nAre you glad these scenes didn't make the cut? Let us know in the comments below.", "description": "Hit fantasy series Game of Thrones came to a controversial end earlier this year with season eight", "authors": ["Lewis Knight", "Image", "Hbo"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article16170508.ece/ALTERNATES/s1200/0_Game-of-Thrones.jpg", "published_at": "2019-10-24"}