{"pub": "yahoo", "url": "https://news.yahoo.com/nissan-ev-crossover-coming-soon-152700086.html", "downloaded_at": "2019-09-24 13:58:04.823455+00:00", "published_at": "2019-09-23", "title": "Nissan EV Crossover Coming Soon with Quick Acceleration, Long Range", "language": "en", "text": "From Car and Driver\n\nNissan is working on a new all-electric crossover model, according to a report from Automotive News.\n\nIt will be around the size of a Rogue, have a range of over 300 miles, and go from zero to 60 mph in less than 5 seconds, according to preliminary info shared with dealers.\n\nExpect to see this crossover make its debut sometime next year and go on sale as a 2021 model.\n\nNissan has made a name for itself in the EV world with the Leaf, and it's now planning to branch out with a second electric model that will take the shape of a compact crossover. According to a report from Automotive News, Nissan has already showed this new electric SUV to dealers, and it may arrive as soon as next year for the 2021 model year. That will be just in time to compete with other upcoming electric SUVs including Volkswagen's ID crossover and the Chevy Bolt EUV.\n\nPreviewed by the IMx concept car (pictured), this vehicle will ride on the company's new EV platform and reportedly boasts impressive numbers: a range of 300 miles and a zero to 60 mph time of less than 5 seconds. Those figures compare favorably to the company's current range-topping EV, the Nissan Leaf Plus which is rated at 226 miles of range and sprinted from zero to 60 mph in 6.8 seconds in our testing.\n\nTo achieve these targets, we're guessing that the electric crossover will have a significantly larger battery pack and more powerful electric motor than the Leaf, which has a 60.0-kWh battery and a 215-hp front-mounted motor. The IMx concept used a pair of electric motors, one in front and one in rear, with a combined output of 420 horsepower, so we might expect a similar setup on the production car.\n\nWe hear that Nissan will be sharing more information about the unnamed new EV model as early as next year, so stay tuned for additional details to come.\n\nYou Might Also Like", "description": "Previewed by the IMx concept and similar in size to the Rogue, this new model is said to have a zero-to-60-mph-time of less than 5 seconds and a range of 300 miles.", "authors": ["Joey Capparella"], "top_image": "https://s.yimg.com/uu/api/res/1.2/JPKNOPLQSaMPr18Cdg8qXw--~B/aD0zMTM7dz02MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/car_and_driver_581/c3e621402dff2bfa97019d39d0a8ee38"}