{"pub": "businessinsider", "url": "https://businessinsider.com/google-stadia-game-console-release-date-price-games-2019-6", "downloaded_at": "2019-10-18 01:14:48.213494+00:00", "title": "Google's new streaming video game service is set to take on PlayStation and Xbox, and it's finally got a release date", "language": "en", "text": "Google has a huge new gaming initiative: A Netflix-like video-game streaming platform named Stadia that's set to launch on November 19.\n\nThe service is intended to run high-resolution blockbuster games on any device that runs Google's Chrome — from smartphones and tablets to computers and TVs.\n\nWhen Stadia arrives on November 19, it will only be available as a $129 \"Founder's Pack\" bundle that comes with a controller, a Chromecast Ultra, one game, and three months of \"Stadia Pro\" service.\n\nGoogle plans to launch a free version of Stadia in February 2020.\n\nVisit Business Insider's homepage for more stories.\n\nGoogle is making a big push into the video game industry with a new streaming platform that will compete with the Xbox One, PlayStation 4 and Nintendo Switch. Stadia (pronounced \"STAY-dee-uh\"), will launch on November 19, promising players access to blockbuster games on any device that can run the Chrome web browser — from smartphones and tablets to laptops and TVs.\n\nGoogle shared the first details on Stadia at the Game Developers Conference in March, and has offered just a handful of updates through out the year. The tech giant finally confirmed Stadia's launch date during its October hardware event in New York City.\n\nGoogle vice president and general manager Phil Harrison speaks during a Google keynote address at the Game Developers Conference in San Francisco this past March. Reuters\n\nPlayers who preorder the $129 \"Founder's Pack\" will get access to Stadia on November 19. The pack includes a Google's freshly designed Stadia controller, a Chromecast Ultra, a copy of \"Destiny 2,\" and a three-month subscription to Stadia Pro, with a second three-month pass to share with a friend.\n\nGoogle plans to launch a free version of Stadia in February 2020 — the pro subscription gives players access to 4K resolution with HDR support, and Google will add one new game to their collection each month. Whether you're a pro-subscriber or not, Stadia will sell many of the same blockbuster games available on the Xbox and PlayStation.\n\nThe pitch is simple: If you've got a Chromecast, just a smartphone, or whatever device you're reading this on, you could potentially run Stadia, and you won't have to shell out $300 for a new video game console. Stadia promises to do for video games what Netflix-like streaming services did for TV and film.\n\nHere's everything we know so far:", "description": "Google's taking on heavyweights like Microsoft, Sony, and Nintendo with a new video game platform named Stadia that's set to arrive on November 19.", "authors": ["Ben Gilbert", "Kevin Webb"], "top_image": "https://image.businessinsider.com/5cf9147a11e205398a7d8257?width=1200&format=jpeg", "published_at": "2019-10-17"}