{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/14/arians-winston-needs-to-play-better-teammates-too", "downloaded_at": "2019-10-14 23:25:59.884599+00:00", "title": "Arians: Winston needs to play better; teammates, too", "language": "en", "text": "TAMPA, Fla. (AP) - Jameis Winston’s propensity for turning the ball over isn’t the only thing ailing the struggling Tampa Bay Buccaneers. The absence of a consistent running game and a leaky defense are also making it difficult to win.\n\nWinston threw five interceptions and also lost a fumble during a 37-26 loss to the Carolina Panthers, giving him 87 giveaways in 62 career games - most by any player since the fifth-year quarterback entered the NFL in 2015.\n\nThe closest challengers for that dubious distinction? Blake Bortles (76) and two-time Super Bowl MVP Eli Manning (74), who no longer starts.\n\nBruce Arians said Monday he has no plans to bench Winston, who’s making $20.9 million in the final season of the contract he signed as the No. 1 overall pick in the 2015 draft.\n\nThe 66-year-old coach, who has said one of the biggest reasons he came out of retirement to lead the Bucs (2-4) was it was an opportunity to help Winston realize his potential as a pro, remains confident the quarterback can cut down on mistakes that undermine Tampa Bay’s chances for success if he eliminates a habit of trying to play Superman rather than simply throwing the ball away to avoid opposing pass rushers.\n\n“Incompletions don’t get you beat. Sacks and sack fumbles get you beat,” said Arians, who has also worked with Ben Roethlisberger, Peyton Manning, Andrew Luck and Carson Palmer during a long coaching career.\n\nAsked if any of the other quarterbacks he’s tutored ever had difficulty deciding when to give up on plays, Arians said Roethlisberger was like that early in his career.\n\n“He would never throw a ball away,” Arians said. “Peyton Manning would throw it away in a heartbeat. Ben thought he could make a play out of anything, like Jameis does. He’s made a bunch of them, but he also got hurt a few times holding onto it like that.”\n\nWinston acknowledged Sunday that he has to do a better job of protecting the football.\n\nIt was the fifth time in his career that he’s had at least four turnovers in a game. No other quarterback has more than two such games since Winston entered the league.\n\nArians suggested the performance, coming on the heels of a four-game stretch in which Winston threw 10 TD passes vs. two interceptions, was part of the growing process.\n\nThe coach acknowledged, though, if he has another disastrous outing any time soon, it would be cause for concern.\n\n“I think as we continue to grow together, it will get better and these games will be one in a million - not one every five,” Arians said.\n\nWHAT’S WORKING\n\nKicker Matt Gay has rebounded nicely since missing two extra points, as well as a 34-yard field goal as time expired, that would have beaten the New York Giants on Sept. 22. The rookie is 4 for 4 on field goals and made all 11 of his extra points since.\n\nWHAT NEEDS HELP\n\nWith two starters - right tackle Demar Dotson and right guard Alex Cappa - out with injuries, the Bucs struggled to protect Winston, who was sacked seven times Sunday. And, even though Ronald Jones scored on a 5-yard run in the second quarter and Dare Ogunbowale added his first career TD on a 4-yard run late, the Panthers limited the running game to 42 yards on 14 attempts. And while part of that was related to playing from behind most of the day, it was by far the team’s least productive rushing effort of the season.\n\nSTOCK UP\n\nWide receiver Chris Godwin continues to dazzle. He had 10 catches on 12 targets for 151 yards against Carolina, his third straight 100-yard performance - fourth this season. He leads the team with 43 receptions for 662 yards and six TDs.\n\nSTOCK DOWN\n\nArians said there’s one lineup change he’s considering during the bye week. Punt returner Bobo Wilson fumbled twice - losing one - against the Panthers. The coach said while Wilson is “fearless” in the role, the backup receiver is only averaging about 3 yards per return and the team needs more production.\n\nINJURED\n\nThe Bucs will not practice as a team during the bye week, however Arians said outside linebacker Jason Pierre-Paul will work Tuesday and Wednesday as he prepares to return from a neck injury suffered during an offseason automobile accident. The 10th-year pro, who led Tampa Bay with 12½ sacks last season, is currently on the reserve/non-football injury list.\n\nKEY NUMBER\n\n21. Scoring drives of 70-plus yards yielded by Tampa Bay’s defense (14 touchdowns, seven field goals) in six games, including a 12-play, 99-yard march Carolina finished with Christian McCaffrey’s 1-yard TD Sunday.\n\nNEXT STEPS\n\nBye this week before playing at Tennessee on Oct. 27, the fourth of five consecutive games during a six-week stretch in which the Bucs will not play in their home stadium.\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Jameis Winston's propensity for turning the ball over isn't the only thing ailing the struggling Tampa Bay Buccaneers. The absence of a consistent running game and a leaky defense are also making it difficult to win.", "authors": ["The Washington Times Http", "Fred Goodall"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/13/panthers_buccaneers_football_99821_c0-141-3383-2114_s1200x700.jpg?2ba42cd4bd876899f79b362b0b8acb1c44441ca3", "published_at": "2019-10-14"}