{"pub": "yahoo", "url": "https://news.yahoo.com/son-sheriff-called-immigrants-drunks-110156157.html", "downloaded_at": "2019-10-14 23:33:38.627558+00:00", "title": "Son of sheriff who called immigrants ‘drunks’ at White House event arrested for public intoxication", "language": "en", "text": "The son of a Texas sheriff who used a White House press conference to describe immigrant offenders as “drunks” likely to repeatedly break the law has been arrested for public intoxication.\n\nSergei Waybourn, 24, faces a count of indecent exposure as well as public drunkenness just days after his father, Tarrant County Sheriff Bill Waybourn, was criticised for the comments.\n\nResponding to a California court ruling that banned immigration officers from arresting people on the basis of records that have been proven unreliable, Sheriff Waybourn said 7% of his 4,200 inmates were “illegal aliens”.\n\nHe added: “Of those people that we have in custody, we know for a fact that 72% of them are repeat offenders. So if we have to turn them loose or if they get released, they’re coming back to your neighbourhood and my neighbourhood. These drunks will run over your children and they will run over my children.\n\n“And if that happens I know that you will want, and certainly I will want for you, the full force of the law - and immigration is part of that full force. These people have come into the country illegally.”\n\n\n\n\n\nSergei Waybourn, who is estranged from the family, was apprehended by officers near the AT&T stadium in Arlington, Texas on Friday.\n\nHe has previously been charged with criminal trespass and theft in January, according to local media.\n\nOfficials quickly hit back at the sheriff’s comments on Thursday, which were described as “racist” and “bigoted”. Many pointed out that native Texans were significantly more likely to be arrested than migrants in the state.\n\nSergei Waybourn was arrested on one charge of public intoxication and another of indecent exposure: Tarrant County More\n\nDomingo Garcia, LULAC National President, said: “It is appalling that a man with a badge and gun like Sheriff Waybourn would make such ignorant and twisted racist statements influenced by his far right-wing ideology. We know that in Texas, the data shows that native-born residents are much more likely to be convicted of a crime than immigrants.\n\nUS Representative Marc Veasey, whose district includes part of Tarrant County, added: “These actions are completely unacceptable, let alone by someone who is tasked with protecting and serving our community.\n\n\"There is nothing noble about falsely characterising all immigrants as criminals—the fact is that a majority of research finds that immigrants do not increase crime rates and are less likely to be incarcerated than their native-born peers. The sheriff is simply trying to continue to divide our diverse North Texas community with hateful rhetoric.”\n\nSheriff Waybourn has since argued his comments were taken out of context – and he was only referring to migrants who had been arrested multiple times for driving under the influence.\n\nHis son remains in custody in the Tarrant County Correctional Facility.\n\nIn a statement to local broadcaster WFAA on his son’s arrest, the sheriff said: “It has been many years since he disassociated from our family.\n\n“We, along with many family members have made efforts over the years to help him – all to no avail. It is always sad when drugs take control of a person’s life.\n\n“His choices and actions have lead to this situation.”\n\nRead more\n\n8-year-old girl scales replica of Trump’s ‘un-climbable’ border wall", "description": "The son of a Texas sheriff who used a White House press conference to describe immigrant offenders as “drunks” likely to repeatedly break the law has been arrested for public intoxication.Sergei Waybourn, 24, faces a count of indecent exposure as well as public drunkenness just days after his father,", "authors": ["Vincent Wood"], "top_image": "https://s.yimg.com/uu/api/res/1.2/8.Lot5Oj6AcLS9VZqLUiBA--~B/dz0wO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_independent_635/80fb1b20e74b0dafc6077a2cefde143d", "published_at": "2019-10-14"}