{"pub": "breitbart", "url": "https://breitbart.com/news/edwards-fails-to-avoid-runoff-for-louisiana-governor", "downloaded_at": "2019-10-13 04:57:35.230473+00:00", "title": "Edwards fails to avoid runoff for Louisiana governor", "language": "en", "text": "Oct. 12 (UPI) — Democratic Louisiana Gov. John Bel Edwards fell short of the 50 percent threshold to avoid a runoff Saturday night with one of two Republicans in his re-election bid.\n\nWith 99 percent of the 3,934 precincts reporting, Edwards, 53, had 47 percent — 612,943 of the 1.3 million of votes cast, according to the secretary of state website. In second place was Republican “Eddie” Risponse, a 70-year-old millionaire making his first bid or public office, with 27 percent, and close behind was U.S. Rep. Ralph Abraham, 65, with 24 percent. The remaining 3 percent of the votes were received by a Democrat, Republican and independent.\n\nEdwards would have needed about 40,000 more votes to become re-elected outright.\n\nInstead the governor, who is the only statewide elected Democrat in the state, will face off against Risponse on Nov. 16.\n\nEdwards is the only statewide elected member of his party in the state.\n\nLouisiana holds what’s called a jungle primary, meaning all candidates run against each other, regardless of party affiliation.\n\nLouisiana leans Republican, but 2019 polling shows Edwards in the lead over Republican candidates.\n\nAn October poll shows Edwards with 48 percent support compared to Rispone’s 25 percent and Abraham’s 23 percent, leaving about 4 percent who said they would support someone else.\n\nPresident Donald Trump told voters not to vote for Edwards at a rally Friday in Louisiana, and he may end up endorsing the lead Republican candidate if it gets to a runoff.\n\nTrump won Louisiana by 20 points in 2016.\n\nEdwards won the office four years ago against Republican candidate David Vitter, who was embroiled in a prostitution scandal at the time.\n\nEdwards has a conservative, pro-life and pro-guns stance, which appealed to Republicans or Independents who lean conservative, Michael Henderson, a Louisiana State University professor, told The Advocate.\n\nHowever, his conservative stance could hurt his Democratic vote. Earlier this year, Edwards signed a bill tightening restrictions on abortion, upsetting pro-choice Democrats, especially women.", "description": "Oct. 12 (UPI) — Democratic Louisiana Gov. John Bel Edwards fell short of the 50 percent threshold to avoid a runoff Saturday night with one of two", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-12"}