{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7521937/A-deprived-neighbourhood-drives-higher-risk-premature-death.html", "downloaded_at": "2019-10-05 08:15:51.462684+00:00", "title": "A deprived neighbourhood drives a higher risk of premature death", "language": "en", "text": "The University College London study is the first systematic review of evidence\n\nScientists analysed the findings of dozens of studies conducted after 2010\n\nPeople that live in a poor neighbourhood face a higher risk of ill health and an early death, scientists say.\n\nAnd the longer the person stays stuck in a deprived area, the more likely they are to suffer the health consequences.\n\nResearchers analysed a host of studies for the first systematic review of the evidence between deprivation and poor health.\n\nThey found the most common poor health outcome for people in poor regions was a premature death, followed by obesity, excess drinking and suicide.\n\nThe findings come just days after Jaywick, a town in Essex, was named as the most deprived neighbourhood in England for the third time.\n\nThe longer a person lives in a poor neighbourhood, the more likely they are to face poor health outcomes, scientists say. Pictured - Jaywick, an Essex town that's been named as the most deprived neighbourhood in England for a third time\n\nResearchers led by University College London analysed a host of studies since 2010, finding where you live will indicate health later in life. Pictured, Jaywick\n\nThe study, led by University College London, is the first to collect data on the effects of the neighbourhood over the course of a lifetime.\n\nLead author Dr Stephen Jivraj said: 'The link between where you live and your health and well-being has been one of the most widely tested hypotheses in the field of health geography for 20 years.\n\n'Our study reviews data collected over time and shows the negative health effects of living in a deprived area increase as people get older.\n\n'We suspect this cumulative effect occurs because it gets harder to move to a less deprived neighbourhood, the older you get.'\n\nThe review of 53 studies includes data from countries including the US, UK, Finland, Japan, Sweden and New Zealand.\n\nPEOPLE IN DEPRIVED AREAS GET CHRONIC HEALTH CONDITIONS 10 YEARS EARLIER People who live in the most deprived areas in England can expect to have two or more health conditions at 61 years, which is 10 years earlier than people in the least deprived areas, according to research carried out by the Health Foundation in 2018. They found almost a third (30 per cent) of people with four or more conditions are under 65 and this percentage is higher for people living in socioeconomically deprived areas. It suggests that living with multiple conditions affects a broad range of people and is not always related to old age. The analysis found approximately 14.2million people have two or more conditions, costing the NHS a staggering amount of money. The figure represents nearly a quarter (24 per cent) of all adults living in England. Over half (55 per cent) of hospital admissions and outpatient visits and three quarters (75 per cent) of primary care prescriptions are for people living with two or more conditions. The number of people living with multiple conditions is expected to continue to grow. Sarah Deeny, assistant director of Data Analytics at the Health Foundation said: 'People’s health is a result of a wide range of social determinants including their quality of housing and education, where they live, access to good quality work and affordable food.' Source: The Health Foundation\n\nOf those studies, 18 per cent found that premature death was the most common poor health outcome recorded for those living in a deprived neighbourhood.\n\nSome 16 per cent of the studies found participants in deprived areas were more likely to be obese or have a high body mass index, followed by the 15 per cent which found increased rates of smoking, drinking alcohol and eating unhealthily.\n\nPoor mental health was found to affect those in deprived neighbourhoods in 10 per cent of studies, according to the findings published in the European Journal of Public Health.\n\nSome of the studies looked at the relationship between neighbourhood and health over a period of time of at least 15 years.\n\nThey found cumulative exposure to neighbourhood deprivation predicts the onset and deterioration of poor health.\n\nThe authors wrote: 'The weight of evidence suggests neighbourhood effects accumulate over the life course when exposure to a poor socioeconomic context is sustained.\n\n'This is the case for outcomes of adolescent parenthood, chronic conditions, disability, smoking, BMI, mortality and physical function.'\n\nThe researchers believe the effects can be reversed if a person moves away from a deprived neighbourhood as a child.\n\nThere is a small amount of evidence that suggests the neighbourhood you live in at the age of 30 will impact life in middle age.\n\nThe Health Foundation said there are a multitude of factors that link deprived neighbourhoods and poor health, but these were not investigated in the research.\n\nTim Elwell-Sutton, Healthy Lives assistant director at the Health Foundation told MailOnline said: 'The study looks at the neighbourhood as a whole and not an individual level.\n\nPeople in deprived neighbourhoods have less money and eating healthily is more expensive, The Health Foundation said. Pictured, Jaywick\n\nPremature death was the most common poor health outcome recorded for those living in a deprived neighbourhood in 18 per cent of the studies. Pictured, Jaywick\n\n'But generally we know that people in these neighbourhoods have less money, which affects how in control of your life you feel.\n\n'Eating healthily is more expensive. And we know a safe, warm house is fundamental for health, too.\n\n'Being unemployed or on a zero-hour type contract isn't good for your health either. In more deprived areas, work-life balance may not be as good.'\n\nThe thinktank's own research has found stark differences in healthy life expectancy – the number of years you can expect to live in good health – between poor and affluent areas.\n\nMr Elwell-Sutton said: 'The healthy life expectancy in men and women in the most deprived 10 per cent of communities is 52 years.\n\n'It's over 70 years in the top 10 per cent of affluent areas. 52 years is a long time before people expect to retire.'\n\nDr Jivraj said: 'We believe policy makers need to urgently put more resource into improving deprived neighbourhoods.\n\n'Doing this as early in people's lifespans as possible would have the greatest public health improvement.'\n\nMr Elwell-Sutton said a joint effort needs to be seen between the Government and local communities.\n\nHe said: 'It's really important for governments to invest in things that support local communities, such as community centres, youth centres and parks.\n\n'It's quite hard to measure their impact in the short term. So when budgets are cut, those are the first things to go.'", "description": "The University College London findings come just days after Jaywick, a town in Essex, was named as the most deprived neighbourhood in England for the third time.", "authors": ["Vanessa Chalmers Health Reporter For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/01/13/18966836-0-image-a-2_1569931983443.jpg", "published_at": "2019-10-01"}