{"pub": "cnn", "url": "https://cnn.com/2019/10/16/politics/fact-check-trump-tally-early-october-record/index.html", "downloaded_at": "2019-10-16 20:31:56.326939+00:00", "title": "From IDs in grocery stores to soldiers in Syria: Trump made 129 false claims last week", "language": "en", "text": "President Donald Trump averaged 18 false claims per day last week, subjecting his rally crowds, social conservatives, reporters and Twitter followers to an unceasing barrage of dishonesty.\n\nTrump's 129 false claims obliterated his previous record for the 14 weeks we've been counting at CNN, 90, and nearly doubled his total from the week before last , 66.\n\nIt was not a record for Trump's presidency. He made 240 false claims during a rally-filled week before the 2018 midterms, which we counted at the Toronto Star\n\nBoth of the last two weeks have featured frequent deception about his dealings with Ukraine and the related whistleblower complaint. This past week, Trump made 28 false claims related to the whistleblower and 24 about his phone call with Ukrainian President Volodymyr Zelensky. His single most frequent false claim over these two weeks -- 11 times last week and nine times the week before -- was that the whistleblower's highly accurate account of the call was highly inaccurate.\n\nTrump also made 24 false claims last week about the military, turning to dishonesty to sell his controversial decision to remove US troops from northern Syria in advance of a Turkish offensive.\n\nTrump's high total was, in part, a product of how much he spoke. Among other events, he held two campaign rallies (making 34 total false claims), delivered a speech to the Values Voter Summit of social conservatives (24 false claims), and did a Fox News interview (10 false claims).\n\nThe most egregious false claim: Soldiers in Syria\n\nTrump said a variety of inaccurate things about the American military presence in Syria. One claim was particularly outlandish.\n\n\"Look, we have no soldiers in Syria. We've won. We've beat ISIS. And we've beat them badly and decisively. We have no soldiers,\" Trump told reporters.\n\nThis was probably news to the 1,000 US soldiers in Syria at the time.\n\nThe most revealing false claim: One timeline out, one timeline in\n\nAfter Democratic Rep. Adam Schiff delivered a confusing rendition of Trump's call with Zelensky, Trump began slamming Schiff for putting words in Trump's mouth that were not contained in the (rough) transcript Trump had released the day prior.\n\nThen Trump began telling a completely different story. In this new account, Schiff had only made these comments because he never thought Trump would ever release a transcript -- but Trump outsmarted him by later doing so, and he was \"very embarrassed.\"\n\nTrump is rarely faithful to any particular account of events. If he eventually decides a new story will serve the moment better than the story he's been telling over and over, the old story gets jettisoned.\n\nThe most absurd false claim: Grocery identification\n\nTrying to make a case for strict voter Identification laws, the president returned to a claim for which he received mockery in 2018: Americans, he said, need ID even to buy groceries.\n\nThey very much do not\n\nHere's this week's full list of 129:\n\nThe Ukraine scandal\n\nThe former US ambassador to Ukraine\n\n\"And, again, she may be a very fine person. I just don't know. But even if you listen to the very good conversation that I had, a very, very good, no-pressure, congenial conversation with the new president of Ukraine, he had some things that were not flattering to say about her. And that came out of the blue. So, you know, it would be nice to have somebody that he liked because he's going -- the person will have to deal with the president of Ukraine.\" -- October 12 interview with Fox News' Jeanine Pirro\n\nFacts First: Ukrainian President Volodymyr Zelensky did not criticize former US ambassador to Ukraine Marie Yovanovitch \"out of the blue\" in his July phone call with Trump. The : Ukrainian President Volodymyr Zelensky did not criticize former US ambassador to Ukraine Marie Yovanovitch \"out of the blue\" in his July phone call with Trump. The rough transcript released by the White House shows Trump brought up Yovanovitch, saying: \"The former ambassador from the United States, the woman, was bad news and the people she was dealing with in the Ukraine were bad news so I just want to let you know that.\" Zelensky responded that \"It was great that you were the first one who told me that she was a bad ambassador because I agree with you 100%.\"\n\nZelensky did criticize Yovanovitch. \"Her attitude towards me was far from the best as she admired the previous President and she was on his side. She would not accept me as a new president well enough,\" he said. But he had been prompted by Trump, not disparaging her on his own.\n\nPelosi's comments (four claims)\n\n\"The conversation that I had with the Ukrainian President Zelensky was a very good conv- -- it was a very cordial, very good conversation. The mistake they made -- the opponents, the opposition, the Democrats, the radical Left, deep state, whatever you want to call them -- they came out with a whistleblower report before they saw the conversation. Had they waited one day, Nancy Pelosi wouldn't have made a fool out of herself, and she would have been able to say what I said. Because when she saw it, she said, 'This is not what the whistleblower said.'\" -- October 7 exchange with reporters at signing of trade agreements with Japan\n\n\"And then she saw the call and she said to her people, 'What the hell? Nobody ever told me this was the call.'\" -- October 10 campaign rally in Minneapolis, Minnesota\n\n\"But Nancy Pelosi said, 'Well, that's what he said. Isn't it?' But she was angry as hell when she got to read the transcript. Because she said, 'Wait a minute, that's not what I was told.' But she was stuck, she was stuck.\" -- October 11 campaign rally in Lake Charles, Louisiana\n\n\"And then Nancy Pelosi went on television. She was very angry when she read the actual call...\" -- October 12 speech to Values Voter Summit\n\nFacts First: While we can't be sure what Pelosi might have said in private, there is no public evidence Pelosi said any such things, or that she was underwhelmed by the rough transcript released by the White House. Her official : While we can't be sure what Pelosi might have said in private, there is no public evidence Pelosi said any such things, or that she was underwhelmed by the rough transcript released by the White House. Her official statement on Trump's call was scathing; she said: \"The release of the notes of the call by the White House confirms that the President engaged in behavior that undermines the integrity of our elections, the dignity of the office he holds and our national security. The President has tried to make lawlessness a virtue in America and now is exporting it abroad. I respect the responsibility of the President to engage with foreign leaders as part of his job. It is not part of his job to use taxpayer money to shake down other countries for the benefit of his campaign.\"\n\nThe timing of Rep. Adam Schiff's comments (four claims)\n\n\"I will say this: Adam Schiff took that conversation before he saw it and fabricated a conversation.\" -- October 10 exchange with reporters before Marine One departure\n\n\"This should never be allowed to happen again. When Schiff goes out and speaks before Congress, they never thought I was going to release the transcript of my call, aww.\" -- October 11 campaign rally in Lake Charles, Louisiana\n\n\"Nobody in this room would do what Adam Schiff did. Nobody would ever think of it. By the way, he only did it because he never thought that I was going to release the transcript. ... But he did it and then I released the transcript. They never thought in a million years -- even in terms of violation with another country, but we got approval. So, he's very embarrassed.\" -- October 12 speech to Values Voter Summit\n\n\"...the only thing impeachable is the fraud...that Adam Schiff committed on the American people...because he made up a conversation. He made a conversation that didn't exist...He never thought in a million years that I was going to release the real conversation.\" -- October 12 interview with Fox News' Jeanine Pirro\n\nFacts First: Schiff made his : Schiff made his comments about Trump's call with Zelensky the day after Trump released the rough transcript, not before. Before he started claiming that Schiff did not expect a transcript to be released, Trump had complained that Schiff did not read the transcript available to him.\n\nA \"perfect\" phone call\n\nSpeaking of his call with Zelensky, Trump said that \"everybody that looked at it\" agreed that it was \"perfect.\" -- October 10 campaign rally in Minneapolis, Minnesota\n\nFacts First: Given the major controversy over the phone call, it's very clearly not true that \"everybody\" agrees with this assessment. Trump might have been referring to some subset of his own aides or officials.\n\nThe whistleblower and Biden\n\n\"And the whistleblower who works now for Biden, did you hear this one? Came out yesterday.\" -- October 11 campaign rally in Lake Charles, Louisiana\n\nFacts First: There is no evidence the whistleblower works for Joe Biden. The whistleblower's lawyers said in a : There is no evidence the whistleblower works for Joe Biden. The whistleblower's lawyers said in a statement that \"our client has never worked for or advised a political candidate, campaign, or party.\" Trump was likely referring to a report in the Washington Examiner that alleged the whistleblower had some kind of working relationship with Biden while Biden was serving as vice president.\n\nThe report did not specify what that past relationship might have been. The whistleblower's lawyers said in the statement that \"our client has spent their entire government career in apolitical, civil servant positions in the Executive Branch,\" and added, \"In these positions our client has come into contact with presidential candidates from both parties in their roles as elected officials -- not as candidates.\"\n\nThe Bidens\n\n\"So pathetic to see Sleepy Joe Biden, who with his son, Hunter, and to the detriment of the American Taxpayer, has ripped off at least two countries for millions of dollars, calling for my impeachment - and I did nothing wrong.\" -- October 9 tweet\n\nFacts First: We give Trump wide latitude to express opinions about Hunter Biden's business dealings, but no evidence has emerged to suggest that former vice president Joe Biden profited from his son's career abroad or was directly involved in facilitating it.\n\nHunter Biden and the law\n\n\"And he [Hunter Biden] knows nothing about energy. He knows nothing about oil. Nothing. Zero. You know more than he does. And he walked away with millions of dollars, because of what? It's just illegal. You can't do it.\" -- October 12 interview with Fox News' Jeanine Pirro\n\nFacts First: Trump is free to raise questions about the son of the vice president getting a position on the board of directors of a Ukrainian energy company for a : Trump is free to raise questions about the son of the vice president getting a position on the board of directors of a Ukrainian energy company for a reported $50,000 per month, without a demonstrated expertise in energy issues -- Hunter Biden acknowledged in a subsequent interview that he would \"probably not\" have gotten the position if his father were not Joe Biden -- but it is not illegal for a relative of a prominent politician to be hired for a lucrative job for which others may be better qualified.\n\nJoe Biden and \"corruption\"\n\n\"We have him on tape with corruption. I mean, he's getting the prosecutor for, I guess, John, it was $2 billion -- saying, 'We're not giving you the $2 billion' -- or whatever the amount was -- 'unless you get rid of this prosecutor.' And then he goes, 'Lo and behold, the prosecutor was gone.'\" And: \"He's been caught red-handed. I mean, here's a man who is on tape saying exactly what he's going to do in terms of corruption, and he gets away with it. If that ever happened to a Republican, they'd be getting the electric chair right now.\" -- October 9 exchange with reporters at signing of executive order on regulatory guidance and enforcement\n\nFacts First: The \"tape\" Trump was likely referring to does not show Biden acting corruptly, as Trump suggested, or being \"caught\" in any way. The : The \"tape\" Trump was likely referring to does not show Biden acting corruptly, as Trump suggested, or being \"caught\" in any way. The video , from a 2018 event, is of Biden telling a story of how he used a threat to deny Ukraine a $1 billion (not $2 billion) loan guarantee to successfully pressure Ukrainian leaders to fire a chief prosecutor, Viktor Shokin, who was widely seen by the US government and its European allies to be ineffective in fighting corruption. There is no evidence of Biden wrongdoing.\n\nForeign and military affairs\n\nA timetable for Syria\n\n\"The United States was supposed to be in Syria for 30 days, that was many years ago.\" -- October 7 tweet\n\n\"Again, we were supposed to be in there for a -- just a tiny spot. Like, a 30- to 90-day period. That was many years ago. It's time.\" -- October 7 exchange with reporters at signing of trade agreements with Japan\n\n\"We were put into this battle -- interjected. It was supposed to be a 30 -- a 30-day period. And we've been there for many, many years.\" -- October 9 exchange with reporters at signing of executive order on regulatory guidance and enforcement\n\n\"We were supposed to be in Syria for 30 days.\" -- October 10 campaign rally in Minneapolis, Minnesota\n\n\"And, in Syria, we were supposed to be there for 30 days...\" -- October 12 speech to Values Voter Summit\n\n\"You know, we were supposed to be in -- we were supposed to be in Syria for 30 days...\" -- October 12 interview with Fox News' Jeanine Pirro\n\nFacts First: There was never any specific timeline for the US military's involvement in Syria, much less a timeline of a mere 30 days (or 90 days). (Trump has previously claimed that US involvement was supposed to last \"three months\" or \"four months.\")\n\n\"There was never a 30-day timetable on the US presence in Syria,\" said Syria expert Steven Heydemann, a professor of government and director of the Middle East Studies program at Smith College. \"The previous administration, and officials serving in this administration, have never offered a fixed timetable for the US mission. Official statements have emphasized that the presence of US forces would be short, limited in scope, and small. But beyond general comments along those lines, there has been no statement indicating it would end after 30 days.\"\n\nThe existence of the military\n\n\"And when you think of what I've done, I've strengthened the military to a point where it's never been. The military was so depleted, we were close to not having a military.\" -- October 10 Daily Caller excerpt from interview with Sebastian Gorka for Gorka's book \"The War for America's Soul\" (note: the Daily Caller did not identify the date of the interview, so we are listing it on the date on which the excerpt was published)\n\nFacts First: It is obviously not true that the US was \"close to not having a military\" before Trump took office. US military spending in 2016 was higher than that of the next nine highest-spending countries : It is obviously not true that the US was \"close to not having a military\" before Trump took office. US military spending in 2016 was higher than that of the next nine highest-spending countries combined , according to the Stockholm International Peace Research Institute, which tracks global defense issues. The US spent well over $500 billion per year on the military every year of Obama's tenure.\n\nObama, Turkey and the Kurds\n\n\"If you read today, a couple of reports saying that when President Obama started this whole thing -- as you know, it was started by President Obama -- he created a natural war with Turkey and their long-time enemy, PKK. And they're still there. And they're still hating each other beyond anybody's belief.\" --- October 7 exchange with reporters at signing of trade agreements with Japan\n\nFacts First: Trump can argue that Obama's Syria policy led to the current state of affairs, but Obama obviously did not \"start\" the whole conflict between Turkey and the Kurds or the conflict between Turkey and the PKK in particular. The PKK, or the Kurdistan Workers Party, was founded in 1978. Trump himself has : Trump can argue that Obama's Syria policy led to the current state of affairs, but Obama obviously did not \"start\" the whole conflict between Turkey and the Kurds or the conflict between Turkey and the PKK in particular. The PKK, or the Kurdistan Workers Party, was founded in 1978. Trump himself has claimed the two sides have been fighting for \"200 years\"; some experts trace the conflict to other dates long preceding Obama's presidency.\n\n\"The modern conflict between the Kurds and Turks finds its origins in the aftermath of the First World War,\" said Bryan Gibson, a Hawaii Pacific University assistant history professor whose research focuses on US policy toward Iraq, Iran and the Kurds.\n\nGibson added: \"Moreover, the primary conflict that has been waged since the US became involved in the conflict in 2014 involved Kurdish forces, known as Peshmerga, fighting against the Islamic State, not against Turkey.\"\n\nAmmunition levels\n\n\"When I took over our military, we didn't have ammunition. I was told by a top general -- maybe the top of them all -- 'Sir, I'm sorry. Sir, we don't have ammunition.' I said, 'I'll never let another president have that happen to him or her.' We didn't have ammunition.\" -- October 7 exchange with reporters at signing of trade agreements with Japan\n\n\"When I came into office, a very prominent general told me because it looked like we could have a big conflict with someone. He said, 'Sir, we have no ammunition.'\" -- October 10 campaign rally in Minneapolis, Minnesota\n\n\"When I came in, we had no ammunition two and a half years ago...The general told me, 'Sir, I'm sorry, we have no ammunition.' And no president should ever be in that position.\" -- October 12 interview with Fox News' Jeanine Pirro\n\n\"We had a general come to my office -- respected general. And we were having big trouble with one country -- first week in office, very early. He said, 'Sir, we have no ammunition.' I said, 'You know what? We're going to have ammunition -- a lot of it. And hopefully we'll never going to have to use it, but we have a lot of it.' But I also said, 'I never want to have another President of the United States hear those words from a general.' Because does that put us in bad position, right?\" -- October 12 speech to Values Voter Summit\n\nFacts First: Trump's claim is a severe exaggeration. While we can't be sure what a general might have privately told Trump, it's clearly not true that the world's most powerful military simply \"didn't have ammunition\" when he was inaugurated in January 2017.\n\nHowever, there are some real facts underlying the dubious tale. You can read our full fact check here\n\nThe United Nations budget\n\n\"So make all Member Countries pay, not just the United States!\" -- October 9 tweet (citing a CBS tweet about the UN having a budget deficit)\n\nFacts First: The US is not the only financial contributor to the United Nations, though it is the largest. In 2018, the US was : The US is not the only financial contributor to the United Nations, though it is the largest. In 2018, the US was responsible for 22% of the UN's regular budget and 28% of its peacekeeping budget. And, at the time of Trump's tweet, the US was one of the countries that had not paid its UN fees for the year.\n\nMember countries are assigned different payment requirements. As of Wednesday, the UN website listed 131 of the 193 states as having \"paid their regular budget assessments in full.\" The list did not include the US, which the Washington Post reported \"owes $381 million from prior budgets and $674 million for the regular budget, according to figures provided by the U.S. Mission to the United Nations. It also owes more than $2.6 billion for active peacekeeping missions.\"\n\nThe Kurds and \"a different part of Syria\"\n\n\"Do you remember two years ago when Iraq was going to fight the Kurds in a different part of Syria. Many people wanted us to fight with the Kurds against Iraq, who we just fought for. I said no, and the Kurds left the fight, twice. Now the same thing is happening with Turkey...\" -- October 13 tweet\n\n\"And you know, in the case of Turkey and the Kurds -- I could go into a whole story because I understand it, I think, better than most. But the Kurds were going to fight the Iraqis about a year and a half ago. Remember? And everybody said, 'We have to fight with the Kurds. We have to fight...' And I said, 'Well, wait a minute. We just spent $4 trillion on Iraq. Now, we're going to fight with the Kurds against Iraq? I'm not going to do it.' This was in a different part of Syria -- totally different. They said, 'Well, the Kurds are going to fight, and they're going to fight. It's going to be a horrible war...\" -- October 12 speech to Values Voter Summit\n\nFacts First: Trump's \"different part of Syria\" was actually in Iraq, according to experts on the Middle East. While his comments initially left some analysts : Trump's \"different part of Syria\" was actually in Iraq, according to experts on the Middle East. While his comments initially left some analysts bewildered , he appeared to be referring to the 2017 dispute between the Kurds and Iraq over the contested Iraqi city of Kirkuk, according to Bryan Gibson, a Hawaii Pacific University assistant history professor whose research focuses on US policy toward Iraq, Iran and the Kurds.\n\n\"Trump doesn't seem to know that Kirkuk is in Iraq, not Syria,\" former Obama deputy national security adviser Ben Rhodes tweeted\n\nThe embassy in Jerusalem\n\nTrump told a lengthy story about how he had been told that building a US embassy in Jerusalem would cost $1 billion, so he instead had the existing US consular facility renovated for \"less than $500,000.\" -- October 12 speech to Values Voter Summit\n\nFacts First: The State Department awarded a $21.2 million contract in 2018 for a company to design and build \"compound security upgrades\" related to Trump's decision to turn the existing facility into an embassy. While the initial modification that allowed the building to open as an embassy cost just under $400,000, that was : The State Department awarded a $21.2 million contract in 2018 for a company to design and build \"compound security upgrades\" related to Trump's decision to turn the existing facility into an embassy. While the initial modification that allowed the building to open as an embassy cost just under $400,000, that was not the final total\n\nNATO countries' military spending\n\n\"Out of the 28 countries, 20 of them are delinquent. You know what the 'delinquent' means? That's an old real estate term. 'He's delinquent with his rent.' They're delinquent with their payment. They owe us a tremendous amount of money and they never pay us back. Because if Germany doesn't pay -- they don't add that up, they just say, 'Oh, that's okay.' Then they don't pay. And yet, they're -- if you go back that way, like the old fashioned way -- like you don't pay and you owe it. But they don't pay and they just go on to the next year. They owe us hundreds and hundreds of billions of dollars.\" -- October 9 exchange with reporters at signing of executive order on regulatory guidance and enforcement\n\nFacts First: Trump's numbers are correct: according to NATO : Trump's numbers are correct: according to NATO figures from June, only seven member countries are meeting the alliance's target of spending 2% of GDP each on defense. (An eighth country, Lithuania, is a smidgen short, at 1.98%.) But members not meeting the guideline do not owe the US money and are not \"delinquent\" like a renter would be if they did not pay their rent. Renters have a legal obligation to pay landlords; NATO member countries are not required to meet the guideline, and they do not owe anyone money if they fail to do so.\n\nSoldiers in Syria\n\n\"Look, we have no soldiers in Syria. We've won. We've beat ISIS. And we've beat them badly and decisively. We have no soldiers.\" -- October 10 exchange with reporters before Marine One departure\n\nFacts First: The US had about 1,000 soldiers in Syria at the time. While he had removed soldiers from the area Turkey attacked, he had not removed them from the country.\n\nYou can read our full fact check here\n\nCrowds, polls and elections\n\nPolling on support for impeachment\n\n\"Only 25 percent want the President Impeached, which is pretty low considering the volume of Fake News coverage, but pretty high considering the fact that I did NOTHING wrong. It is all just a continuation of the greatest Scam and Witch Hunt in the history of our Country!\" -- October 9 tweet\n\nFacts First: Public polls from the week Trump spoke put support for impeachment much higher than 25% -- regularly above 40% and as high as 55%.\n\nYou can read our full fact check here\n\nThe polls\n\n\"And that's why my polls went up, I think they said, 17 points in the last two or three days.\" -- October 7 exchange with reporters at signing of trade agreements with Japan\n\nFacts First: We have no idea who \"they\" might be, but there's no public evidence for a 17-point improvement in Trump's poll numbers over two or three days. The polls do not show evidence of a large anti-impeachment, pro-Trump backlash, let alone a giant spike of \"17 points.\" FiveThirtyEight's poll : We have no idea who \"they\" might be, but there's no public evidence for a 17-point improvement in Trump's poll numbers over two or three days. The polls do not show evidence of a large anti-impeachment, pro-Trump backlash, let alone a giant spike of \"17 points.\" FiveThirtyEight's poll average had Trump's approval rating at 41.5% on Monday, basically unchanged from 41.6% three days prior.\n\nThe 2016 election result\n\n\"We won -- 306 to 223. That's a -- pretty big. Remember?\" -- October 10 campaign rally in Minneapolis, Minnesota\n\nFacts First: Hillary Clinton earned 232 votes in the Electoral College, not 223. This was not a one-time slip; Trump has habitually said \"223.\"\n\nMichelle Obama and the Abrams campaign (two claims)\n\n\"Look at the governor of Georgia, where Oprah, President Obama, and Mrs. Obama campaigned; they staked out there and they campaigned. I went there for Brian Kemp, and we won.\" -- October 10 Daily Caller excerpt from book interview with Sebastian Gorka\n\n\"Our friend, Brian Kemp, he did a number on Stacey Abrams. She's still saying, 'What happened? What happened?' She had Oprah. You know, Oprah used to be a very good friend of mine...But she went to Georgia and she campaigned for Stacey. And Obama went and Michelle Obama went and they campaigned.\" -- October 11 campaign rally in Lake Charles, Louisiana\n\nFacts First: Michelle Obama did not visit Georgia to campaign for Kemp's opponent Stacey Abrams. Michelle Obama did not campaign for Abrams at all, a spokesperson for Barack Obama : Michelle Obama did not visit Georgia to campaign for Kemp's opponent Stacey Abrams. Michelle Obama did not campaign for Abrams at all, a spokesperson for Barack Obama told the Toronto Star when Trump began making this claim.\n\nBrian Kemp's victory in Georgia\n\n\"I said Brian, 'Congratulations. You're going to win, you're going to win.' And he won by two and a half points, which was amazing.\" -- October 11 campaign rally in Lake Charles, Louisiana\n\nFacts First: This was a small exaggeration. Kemp beat Abrams by This was a small exaggeration. Kemp beat Abrams by 1.4 percentage points , not \"two and a half.\"\n\nTrump's crowd in Georgia\n\n\"And all Brian Kemp had was Donald Trump. Now, we had a rally at the airport and there were 55,000 people at that rally. That was the day before, maybe two days before the election.\" -- October 11 campaign rally in Lake Charles, Louisiana\n\nFacts First: Nowhere close to 55,000 people attended the Georgia rally Trump held in November 2018 for Republican governor candidate Brian Kemp. As the Washington Post : Nowhere close to 55,000 people attended the Georgia rally Trump held in November 2018 for Republican governor candidate Brian Kemp. As the Washington Post reported later that month: \"Kemp's campaign estimated that 10,000 people attended in total, and the Bibb County Sheriff's Office estimated 12,500 inside and nearly 6,000 outside, according to a fact-check by WMAZ .\"\n\nFox News polling\n\n\"From the day I announced I was running for President, I have NEVER had a good @FoxNews Poll. Whoever their Pollster is, they suck. But @FoxNews is also much different than it used to be in the good old days.\" -- October 10 tweet\n\nFacts First: \"Good\" is subjective, but this \"never\" is still an obvious exaggeration. Trump, who appeared unhappy with a : \"Good\" is subjective, but this \"never\" is still an obvious exaggeration. Trump, who appeared unhappy with a new Fox News poll that showed 55% support for impeaching him, has repeatedly touted Fox News polls that showed good results for him.\n\nDuring the Republican primary in November 2015, for example, he tweeted , \"Wow! @FoxNews poll just came out. #1 with 26%! Almost as importantly, I am the strongest on economic issues by far!\" After Fox News released a January 2016 poll that showed Trump with a large lead among Republican primary voters, he tweeted a graphic of the poll results and the words, \"#FoxNews Poll - THANK YOU!\"\n\nMike DeWine's victory in Ohio\n\n\"Look at Ohio, the governor of Ohio, how important is Ohio? The governor's great. But he was down seven and he ended up winning by seven after that final campaign stop, last day, took him up 14 points.\" -- October 10 Daily Caller excerpt from book interview with Sebastian Gorka\n\nFacts First: Republican Ohio Gov. Mike DeWine beat Democratic opponent Richard Cordray by : Republican Ohio Gov. Mike DeWine beat Democratic opponent Richard Cordray by 3.7 percentage points in the 2018 election, 50.4% to 46.7%, not \"by seven.\"\n\nAndy Barr's victory in Kentucky\n\n\"Andy Barr in Kentucky was down by seven; he won by six.\" -- October 10 Daily Caller excerpt from book interview with Sebastian Gorka\n\nFacts First: Republican Rep. Andy Barr won his 2018 race in Kentucky's 6th District by : Republican Rep. Andy Barr won his 2018 race in Kentucky's 6th District by 3.2 percentage points , 51% to 47.8%, not \"by six.\"\n\nCindy Hyde-Smith's victory in Mississippi\n\n\"Oh also, Cindy Hyde-Smith in the Senate, she was down by 3 or 4 points, and I went down and did two rallies. These aren't speeches, these are rallies -- big deals, with twenty or twenty-five thousand people, or more.\" -- October 10 Daily Caller excerpt from book interview with Sebastian Gorka\n\nFacts First: Hyde-Smith was never trailing in her 2018 Senate race in Mississippi, a Republican-leaning state that hasn't elected a Democratic senator since 1982.\n\nThe crowd in Minnesota\n\n\"Just like we got in a blue area of Minnesota. I think we're going to win Minnesota. Group from Minnesota. Twenty-two thousand seats -- it was like Madison Square Garden plus 1,000 seats. The Timberwolves arena, and -- where they play the NBA games. And it was packed. And we could have sold it out four times. So some things happened.\" -- October 12 speech to Values Voter Summit\n\nFacts First: This was yet another small exaggeration. The Minneapolis arena where Trump held his rally, the Target Center, has a capacity of around 20,000, not 22,000; its website : This was yet another small exaggeration. The Minneapolis arena where Trump held his rally, the Target Center, has a capacity of around 20,000, not 22,000; its website says that the attendance record was 20,200 at a U2 concert in 2005, while Minnesota Public Radio noted that a Timberwolves game in 2017 had an announced attendance of 20,412.\n\nSome empty seats were visible at Trump's rally.\n\nThe crowd outside\n\nTrump claimed that, in addition to the supporters inside the arena in Minneapolis, \"We have 25,000 people that we still love outside.\" -- October 10 campaign rally in Minneapolis, Minnesota\n\nFacts First: There were nowhere near 25,000 Trump supporters outside the arena. \"The president's claim of 25,000 people standing outside was inflated. FOX 9 crews stationed outside the arena saw a few hundred people watching the speech in an overflow area,\" local television station Fox 9 : There were nowhere near 25,000 Trump supporters outside the arena. \"The president's claim of 25,000 people standing outside was inflated. FOX 9 crews stationed outside the arena saw a few hundred people watching the speech in an overflow area,\" local television station Fox 9 reported . Other journalists on scene concurred. Sarah Mearhoff of Forum News Service said she would \"guess-timate in the mid-hundreds,\" though she cautioned that she didn't have a good enough vantage point to be more precise.\n\nGroceries and identification\n\n\"You know, if you want to go out and buy groceries, you need identification. If you want to do almost anything you need identification.\" -- October 11 campaign rally in Lake Charles, Louisiana\n\nFacts First: Americans : Americans do not need identification to buy groceries.\n\nGrocery stores require identification when people are buying alcohol (to confirm they are of legal age) and certain medications, when people are paying by check, and on occasion when people are paying with a credit card. But these are exceptions, not the rule. Millions of Americans buy groceries every day without showing any ID.\n\nThe IRS\n\nSpeaking of what he called \"the ultra-left,\" Trump said, \"And, if given the chance, they would use every instrument of government power, including the IRS, to try to shut you down. They are using the IRS against me.\" -- October 12 speech to Values Voter Summit\n\nFacts First: There is no evidence Trump's opponents on the left are using the power of the Internal Revenue Service against Trump. The service is currently run by a Trump appointee, Charles Rettig.\n\nTrump might perhaps have been referring to Democrats' efforts to obtain his tax returns, or perhaps to a whistleblower complaint by an IRS employee that alleges, according to the Washington Post , that at least one political appointee attempted to improperly interfere with the mandatory audit of the tax returns of Trump or Vice President Mike Pence.\n\nBut neither of these things constitutes the use of the powers of the IRS itself to target Trump.\n\nCar insurance costs in Louisiana\n\n\"I will be in Louisiana tonight (Love it!) to get Republicans to vote for either of our two great Republican Candidates and force a run off with John Bel Edwards, who has done a really poor job of tax cutting, car insurance cost (worst in USA)...\" -- October 11 tweet\n\nFacts First: Louisiana has the second-highest average annual car insurance premiums in the country, not the highest, according to Insure.com rankings regularly : Louisiana has the second-highest average annual car insurance premiums in the country, not the highest, according to Insure.com rankings regularly cited by Louisiana news outlets. Michigan has ranked first for six consecutive years, Louisiana second for three consecutive years.\n\nAccording to Insure.com , the average Michigan premium for 2019 was $2,611; the average Louisiana premium was $2,298. The national average was $1,457.\n\nThe Green New Deal\n\nTrump called Democrats' proposals \"crazy,\" saying, \"They want to spend $99 trillion to redo buildings all over the United States.\" -- October 10 campaign rally in Minneapolis, Minnesota\n\nFacts First: There is no apparent basis for the \"$99 trillion\" figure. While the Democrats' Green New Deal : There is no apparent basis for the \"$99 trillion\" figure. While the Democrats' Green New Deal proposal does call for \"upgrading all existing buildings in the United States and building new buildings to achieve maximum energy efficiency,\" Democrats are not proposing to spend $100 trillion on these upgrades.\n\nAs mentioned in a previous fact check , Trump may have been referring to a $93 trillion figure from a conservative organization, the American Action Forum, but that is a highly imprecise estimate for the entire Green New Deal; the organization estimated it would cost $1.6 trillion to $4.2 trillion to make all housing units environmentally friendly.\n\nHere are the claims Trump made last week that we have previously fact checked in one of these weekly roundups:\n\nThe Ukraine scandal\n\n\"Eight times\"\n\n\"The whistleblower said 'quid pro quo' eight times. It was a little off -- no times.\" -- October 12 speech to Values Voter Summit\n\nFacts First: The whistleblower report did not even use the words \"quid pro quo,\" much less specify a number of times Trump allegedly said them. Trump seemed to be confusing the whistleblower report with a Wall Street Journal : The whistleblower report did not even use the words \"quid pro quo,\" much less specify a number of times Trump allegedly said them. Trump seemed to be confusing the whistleblower report with a Wall Street Journal article -- published before the rough transcript was released -- that said, \"President Trump in a July phone call repeatedly pressured the president of Ukraine to investigate Joe Biden's son, according to people familiar with the matter, urging Volodymyr Zelensky about eight times to work with Rudy Giuliani on a probe that could hamper Mr. Trump's potential 2020 opponent.\"\n\nThe rough transcript\n\n\"This is the most ridiculous thing many people have ever seen. All you have to do is read. All you have to do is read what they wrote down, the stenographers. They wrote down an exact call.\" -- October 7 remarks at briefing with military leaders\n\n\"We have a stenographer report. We have a very, very word-for-word report of what I said; I released it.\" -- October 7 exchange with reporters at signing of trade agreements with Japan\n\n\"I released a transcript of my conversation -- an exact transcript.\" -- October 11 exchange with reporters before Marine One departure\n\n\"And then Nancy Pelosi went on television. She was very angry when she read the actual call, because this was an exact -- I guess stenographers, they took it down.\" -- October 12 speech to Values Voter Summit\n\nFacts First: The document released by the White House explicitly : The document released by the White House explicitly says , on the first page, that it is not an exact transcript of the call.\n\n\"A Memorandum of a Telephone Conversation (TELCON) is not a verbatim transcript of a discussion. The text in this document records the notes and recollections of Situation Room Duty officers and NSC policy staff assigned to listen and memorialize the conversation in written form as the conversation takes place. A number of factors can affect the accuracy of the record, including poor telecommunications connections and variations in accent and/or interpretation,\" the document says.\n\nThe accuracy of the whistleblower\n\nTrump claimed 11 times that the whistleblower complaint about his July phone call with the president of Ukraine was inaccurate, describing the whistleblower's description of the call as \"totally inaccurate,\" \"very wrong,\" \"totally phony,\" \"so off,\" and similar things.\n\nFacts First: The whistleblower's account of the call was largely accurate. In fact, the rough transcript released by Trump himself showed that the whistleblower's three primary allegations about the call were correct or very close to correct. You can read a full fact check : The whistleblower's account of the call was largely accurate. In fact, the rough transcript released by Trump himself showed that the whistleblower's three primary allegations about the call were correct or very close to correct. You can read a full fact check here\n\nSchiff's comments\n\n\"I will say this: Adam Schiff took that conversation before he saw it and fabricated a conversation. To me, that's criminal. What he did is criminal.\" And: \"But the Democrats have committed crimes because they made up the conversation.\" -- October 10 exchange with reporters before Marine One departure\n\n\"Schiff fabricated phone call, a crime.\" -- October 13 tweet\n\nFacts First: While it's fair for Trump to be miffed about Schiff's comments at a congressional committee meeting -- Schiff's mix of near-quotes from Trump, his own analysis, and supposed \"parody\" was at the very least : While it's fair for Trump to be miffed about Schiff's comments at a congressional committee meeting -- Schiff's mix of near-quotes from Trump, his own analysis, and supposed \"parody\" was at the very least confusing -- Schiff's words were not illegal.\n\nThe Constitution includes a specific provision that allows members of Congress to speak freely during official meetings.\n\nForeign and military affairs\n\nISIS fighters and Europe\n\n\"We quickly defeated 100% of the ISIS Caliphate, including capturing thousands of ISIS fighters, mostly from Europe. But Europe did not want them back, they said you keep them USA!\" -- October 7 tweet\n\n\"We captured many, many ISIS fighters -- most of them came from Europe.\" -- October 10 campaign rally in Minneapolis, Minnesota\n\n\"Most of these fighters came from Europe. They came from Germany. They came from France. They came from many countries in Europe.\" -- October 12 speech to Values Voter Summit\n\nFacts First: A minority of ISIS fighters captured in Syria are from Europe, not \"almost all\" or even \"most.\" James Jeffrey, Trump's special envoy to the anti-ISIS coalition, : A minority of ISIS fighters captured in Syria are from Europe, not \"almost all\" or even \"most.\" James Jeffrey, Trump's special envoy to the anti-ISIS coalition, said August 1 that about 8,000 of about 10,000 terrorist fighters being held in northeastern Syria are Iraqi or Syrian nationals; there were \"about 2,000 ISIS foreign fighters\" from all other countries. Trump himself tweeted in February to ask that European countries take back \"over 800\" ISIS fighters captured in Syria.\n\nPercentage of GDP spent on the military (two claims)\n\n\"...the United States is paying over 4% and Germany is paying 1% -- maybe a tiny bit more, but I actually think, the way you calculate it -- because you can look at it many ways -- is probably less than 1%.\" -- October 9 exchange with reporters at signing of executive order on regulatory guidance and enforcement\n\n\"And say what you want, NATO protects Europe. Maybe it's a little bit good for us, but we pay 4.3% and Germany pays 1%. And Germany is supposed to be paying 2%.\" -- October 12 interview with Fox News' Jeanine Pirro\n\nFacts First: The US is spending an estimated 3.42% of GDP on defense in 2019, according to NATO : The US is spending an estimated 3.42% of GDP on defense in 2019, according to NATO estimates issued in June, not \"over 4%.\" Germany is at 1.36%.\n\nMilitary spending\n\n\"We're not a police force. We're the greatest military force ever assembled because of what I've done over the last three years with $2.5 trillion, Mr. Ambassador, we've spent on our military -- $2.5 trillion.\" -- October 7 exchange with reporters at signing of trade agreements with Japan\n\n\"Things are going very well with our military. We've spent $2.5 trillion since I've been president, and rebuilt our military.\" -- October 7 remarks at briefing with military leaders\n\n\"We are rebuilding our military, Jeanine. I spent $2.5 trillion on rebuilding.\" -- October 12 interview with Fox News' Jeanine Pirro\n\nFacts First: Trump was exaggerating. As noted by Todd Harrison, director of defense budget analysis at the Center for Strategic and International Studies, total defense spending for fiscal years 2017, 2018 and 2019 was $2.05 trillion -- and that includes more than three-and-a-half months of Obama's tenure, since the 2017 fiscal year began in October 2016.\n\nHarrison said he thinks Trump must have been including military funding for the 2020 fiscal year to get to \"$2.5 trillion\" figure -- but since the 2020 fiscal year hadn't even started at the time Trump spoke, Harrison said, \"that funding has not been 'spent' in any sense of the word. Additionally, the actual appropriations bills for FY20 are still pending in Congress.\" While a budget deal earlier in the year allocates up to $738 billion for defense, Harrison said, \"until the appropriation bill is passed, the money cannot be spent.\"\n\nThe condition of US military jets\n\n\"We have the greatest soldiers in the world, but they had equipment that was depleted. It was old. We had jets that didn't fly — 50% of our jets didn't fly.\" -- October 12 speech to Values Voter Summit\n\nFacts First: Though it's true that many Air Force jets didn't fly when Trump took office, \"50% of our jets didn't fly\" is an exaggeration. In fiscal year 2016, the Air Force Times reported, 72.1% of the Air Force's fleet was considered mission-capable. It was 71.3% in fiscal year 2017. (The percentage has continued to decline under Trump, : Though it's true that many Air Force jets didn't fly when Trump took office, \"50% of our jets didn't fly\" is an exaggeration. In fiscal year 2016, the Air Force Times reported, 72.1% of the Air Force's fleet was considered mission-capable. It was 71.3% in fiscal year 2017. (The percentage has continued to decline under Trump, dropping to 70% in fiscal 2018.)\n\nAir Force Times senior reporter Stephen Losey, who tracks the data, noted to CNN that the figure had been in the vicinity of 50% for certain planes. For example, the F-35 had a 2017 readiness rate of 54.7%, the F-22 a 2017 rate of 49%.\n\nSo Trump could have fairly pointed to specific jets. But he was wrong when he suggested he was giving a figure for the entire fleet.\n\nThe war in Afghanistan\n\n\"We can beat anybody. We can beat them easy. We're not fighting; we're policing in Afghanistan. But we've been there 19 years.\" -- October 12 speech to Values Voter Summit\n\nFacts First: This was another small exaggeration. The US invaded Afghanistan in October 2001, 18 years ago. This was not a one-time slip; Trump habitually says \"19 years.\"\n\nTrump's position on the war in Iraq\n\n\"Since the United States went to war in Iraq — now, listen to this. I was against going to the war. Nobody cared; I was a civilian. But I got a lot of publicity for whatever reason.\" -- October 12 speech to Values Voter Summit\n\nFacts First: Trump did not publicly oppose the invasion of Iraq before it began. Trump was tentatively supportive of the war when radio host Howard Stern asked him in September 2002, \"Are you for invading Iraq?\" He : Trump did not publicly oppose the invasion of Iraq before it began. Trump was tentatively supportive of the war when radio host Howard Stern asked him in September 2002, \"Are you for invading Iraq?\" He responded : \"Yeah, I guess so. I wish the first time it was done correctly.\" The day after the invasion in March 2003, he said , \"It looks like a tremendous success from a military standpoint.\" Trump did not offer a definitive position on the looming war in a Fox News interview in January 2003, saying, \"Either you attack or don't attack.\"\n\nTrump started publicly questioning the war later in 2003, and he was an explicit opponent in an Esquire article published 17 months after the invasion. That is not the same as \"I was against going to the war.\"\n\nTrade\n\nChina's wealth\n\nTrump claimed that China's wealth \"is down, probably, $22 or $24 trillion\" since his election. --- October 7 speech at signing of trade agreements with Japan\n\nFacts First: There is no apparent basis for any of these figures. Experts on the Chinese economy have even rejected previous Trump claims of a $10 trillion drop in Chinese wealth. You can read a longer fact check : There is no apparent basis for any of these figures. Experts on the Chinese economy have even rejected previous Trump claims of a $10 trillion drop in Chinese wealth. You can read a longer fact check here\n\nThe history of tariffs on China\n\n\"...we're taking in billions and billions of dollars of tariffs every month and we've never had this. We never took in 10 cents from China and we're taking in billions of dollars and tens of billions a year.\" -- October 7 exchange with reporters at signing of trade agreements with Japan\n\nFacts First: The US government has been charging tariffs on imported Chinese goods for more than two centuries, and it took in billions from such tariffs long before Trump imposed his own tariffs. (As always, we'll note it is US importers and consumers, not China, who have paid these tariffs.)\n\nThe Treasury received $14 billion from tariffs on China in 2014 , to look at one pre-Trump year.\n\nTariff aid to farmers\n\n\"I said, 'That's okay. We're going to take $16 billion out of the tariffs and we're going to give it to the American farmer.' And I think they appreciated that. It never gets reported by the 'fake news,' as I say. But it never gets reported. Never. I don't know why. They don't want to do it.\" -- October 7 speech at signing of trade agreements with Japan\n\nFacts First: Trump is entitled to argue that his aid to farmers should get more coverage, but his claim that it \"never\" gets covered is obviously false. Here is : Trump is entitled to argue that his aid to farmers should get more coverage, but his claim that it \"never\" gets covered is obviously false. Here is some CNN coverage on the subject.\n\nWho's paying for the tariffs\n\n\"And also, and very importantly, we've taken in tremendous amounts of money in the form of tariffs from China. China has eaten the cost of those tariffs because they've devalued their currency and they've also pumped a lot of money into their system.\" -- October 7 speech at signing of trade agreements with Japan\n\nFacts First: A : A bevy of economic studies have found that Americans are bearing the overwhelming majority of the tariff costs, and Americans make the actual tariff payments.\n\nUnions and the USMCA\n\n\"In addition to the agreements we're signing with Japan today, we reached a tremendous agreement with Mexico and Canada to replace NAFTA with the new USMCA. And hopefully that'll get done in the not-too-distant future. Everybody wants it. Manufacturers want it, farmers want it, even unions want it.\" -- October 7 speech at signing of trade agreements with Japan\n\nFacts First: The agreement is generally opposed in its current form by major US unions, who have demanded changes to the text; the president of the AFL-CIO federation : The agreement is generally opposed in its current form by major US unions, who have demanded changes to the text; the president of the AFL-CIO federation says it will be a \"disaster for workers\" if it is not amended. As The New York Times has reported, the United Automobile Workers and United Steelworkers, among other unions, have also sought changes.\n\nChina's agricultural spending\n\n\"Well, if you look at the deal, the deal is so incredible. The deal is a great deal. And I have to say it again: The farmers — it's going to be $50 billion dollars' worth of purchase. The most they've ever done was $16 [billion].\" -- October 11 exchange with reporters before Marine One departure\n\n\"Because I want to tell you, I got China to order a lot. And it's true, it's not true. No, it's true. So China in their record year -- of course they'll catch it within you know, $2; 'He was $2 off. He gets a Pinocchio.' ...But their biggest year was $16 billion in agri -- that's a lot. Sixteen billion, that's a lot of corn. Sixteen billion was their biggest year.\" -- October 11 campaign rally in Lake Charles, Louisiana\n\nFacts First: Trump was off by much more than \"$2\": $16 billion is not even close to the most China has spent on US agricultural products in a year. According to figures from the US Department of Agriculture, China spent more than $17 billion every year from 2010 through 2017. Over that time period, its spending peaked at $25.9 billion in 2012.\n\nImmigration\n\nMexican troops at the border\n\n\"We don't protect our own borders. But I want to thank Mexico, the president of Mexico, he's great. Twenty-seven thousand Mexican soldiers are on our border.\" -- October 11 campaign rally in Lake Charles, Louisiana\n\nFacts First: Mexico has deployed a substantial number of troops, but Trump exaggerated how many are being stationed near the US border in particular. Acting Customs and Border Protection commissioner Mark Morgan told reporters in September that 10,000 of the approximately 25,000 troops were on Mexico's own southern border: \"They've created a new national guard within their country: 10,000 troops to the southern border; 15,000 troops to the northern border with the United States.\" Trump himself said in late July that 6,000 of the troops were near Guatemala.\n\nBuilding the wall\n\n\"The wall is moving rapidly. Large sections are being built every day.\" And: \"It's going up very rapidly.\" -- October 7 speech at signing of trade agreements with Japan\n\n\"...we are building the wall faster than anyone ever anticipated it could be built.\" -- October 10 campaign rally in Minneapolis, Minnesota\n\n\"And we built and we're building a wall, and it is going up rapidly.\" -- October 12 speech to Values Voter Summit\n\nFacts First: No new miles of border wall had been built during Trump's presidency as of September 30, according to a fact sheet from Customs and Border Protection. Over Trump's tenure in office, 69 miles of barriers had been constructed in places where \"dilapidated and outdated\" barriers had existed before; that's a pace of about half a mile of replacement barrier per week.\n\nMountain climbers and the wall\n\n\"We had mountain climbers come in to climb -- do you believe this? We had different samples put up and we had mountain climbers, literally, come in. 'Which is the hardest one to climb?'\" -- October 7 speech at signing of trade agreements with Japan\n\nFacts First: There is no evidence that mountain climbers were recruited to test Trump's border barriers. When The Daily Beast : There is no evidence that mountain climbers were recruited to test Trump's border barriers. When The Daily Beast contacted several top mountain climbers and governing body USA Climbing, nobody had any idea what Trump was talking about. Customs and Border Protection refused to comment to CNN, referring questions to the White House.\n\nDemocrats, immigrants and cars\n\n\"In a recent Democrat debate, every single Democrat presidential candidate raised their hand, in favor of giving free government health care to illegal aliens. And then, you wonder why they come to America? Why wouldn't they come? Free health care, free education, free everything. And I jokingly said one time, 'and everybody then gets a Rolls-Royce.' And the fake news said, 'President Trump lied. He said that the illegal immigrants all get a Rolls-Royce.' They don't have a lot of sense of humor. That's the problem with this press, what a bunch of dopes. Free Rolls-Royce. 'The president told a lie. They don't get a Rolls-Royce.' So I'm only kidding about the Rolls-Royce. I just don't want to have a story. You know, I have a bad story. I did it again. I promised the Rolls. I was just kidding.\" -- October 11 campaign rally in Lake Charles, Louisiana\n\nFacts First: That is not exactly what happened. Trump did make a joke at a 2018 campaign rally in Arizona about Democrats wanting to give undocumented immigrants a free Rolls-Royce -- but then, at a rally the next day in Nevada, he made a non-joking claim that Democrats want to \"give them cars.\" He continued to joke about a Rolls-Royce in particular, but he was challenged on the assertion of fact.\n\nHe said in Nevada: \"They want to open your borders, let people in, illegally. And then they want to pay for those people for health care, for education. They want to give them cars, they want to give them driver's licenses. I said last night, we did a great -- we did a great, great rally in Arizona last night, and I said -- I said last night, what kind of car will they supply them? Will it be a Rolls-Royce?\"\n\nDemocrats and borders\n\nTrump three times called Democrats the party of \"open borders,\" saying at the Values Voter Summit, \"They believe in open borders, where anybody can come into our country -- anybody.\"\n\nFacts First: Even Democratic presidential candidates who advocate the decriminalization of the act of illegally entering the country, such as Sen. Elizabeth Warren and former Housing and Urban Development Secretary Julián Castro, do not support completely unrestricted migration, as Trump suggests.\n\nDemocrats and the wall\n\n\"Most of the Democrats, four years ago, they wanted a wall. Now all of a sudden they don't want a wall. You know why they don't want a wall? Because I want it.\" -- October 10 campaign rally in Minneapolis, Minnesota\n\n\"And we built and we're building a wall, and it is going up rapidly. And that is tough because I built it against every single Democrat who, four years ago, wanted it. And the only reason they don't want it now is because I want it. It's the only reason. Only one reason.\" -- October 12 speech to Values Voter Summit\n\nFacts First: Four years ago, Trump was campaigning for the presidency on a controversial promise to build a border wall; there is no evidence the Democrats wanted a wall at that time.\n\nTrump would have at least a slightly better case if he spoke of six years ago, when Democrats supported a comprehensive immigration reform bill that included 700 miles of border fencing. But that was fencing, not the giant wall Trump has proposed -- and many Democrats supported it only as part of a package that included provisions they wanted, most notably a path to citizenship for undocumented immigrants.\n\nFor example, Mary Landrieu, then a Democratic senator for Louisiana, voted for the final bill that included the fencing. But she said during the debate: \"I'm not going to waste taxpayers' money on a dumb fence...I've been in tunnels under the fence. I've watched people climb over the fence. I'm not going to send taxpayers' money down a rat hole.\"\n\nCalifornia and voter fraud\n\n\"We believe only American citizens should vote in American elections. And that's not what's happening. You go out to California, you see what's happening out there? It's a disgrace. The voter abuse, it's a disgrace what's happening in California. -- October 11 campaign rally in Lake Charles, Louisiana\n\nFacts First: There is no evidence for Trump's repeated suggestion of widespread voter fraud by non-citizens in California.\n\nYou can read a full fact check of a previous version of this Trump claim here\n\nPolls and elections\n\nSpecial elections in North Carolina\n\n\"You know, the other night in North Carolina, two weeks ago, we won two congressional races. They thought we'd lose one or the other, was going to be maybe a one point, two point victory. We absolutely won them by so much nobody ever saw.\" -- October 11 campaign rally in Lake Charles, Louisiana\n\nFacts First: This claim was false in one of two ways. If Trump was talking about the race in North Carolina's 9th District, that race was indeed expected to be close -- but it was close, with Republican Dan Bishop winning by : This claim was false in one of two ways. If Trump was talking about the race in North Carolina's 9th District, that race was indeed expected to be close -- but it was close, with Republican Dan Bishop winning by two points , so Trump can't accurately claim that Republicans won \"by so much nobody ever saw.\" If Trump was talking about the race in North Carolina's 3rd District, winning candidate Greg Murphy was widely favored to win handily, and he did.\n\nBoth races were a month prior to his comments, not \"two weeks.\"\n\nApproval with Republicans (two claims)\n\n\"And, you know, I am at 94% approval rating, but still you have people out there -- they don't get it. They don't get it. So we love the Republicans.\" -- October 12 speech to Values Voter Summit\n\n\"And I think -- you know, I have a 94, 95 percent approval rating with the Republican Party.\" -- October 12 interview with Fox News' Jeanine Pirro\n\nFacts First: Trump's approval rating among Republicans is very high, regularly in the 80s and sometimes creeping into the 90s, but it has not been 94% or 95% in any recent major poll we could find.\n\nTrump was at 91% with Republicans in a NPR/PBS NewsHour/Marist poll conducted from Oct. 3-8, 88% with Republicans in a Quinnipiac University poll conducted from Oct. 4-7, 82% in an Ipsos/Reuters poll conducted Oct. 7-8, and 87% in Gallup data gathered from Sept. 16 to Sept. 30.\n\nDemocrats\n\nThe Green New Deal\n\n\"The New Green [Deal] or Green New [Deal] -- you can say it either way, by the way. It doesn't matter; same thing. It doesn't matter. Somebody said, 'Which comes first?' I said, 'It doesn't make any difference. They're both crazy.' No cows, no planes, no people, no energy, no oil, no gas -- no nothing.\" -- October 12 speech to Values Voter Summit\n\nFacts First: The Democrats' Green New Deal environmental resolution does not call for the elimination of cows or planes. (We'll assume the \"people\" part of Trump's statement was a joke.) The resolution calls for a transition to 100% of America's energy coming from \"clean, renewable, and zero-emission energy sources.\"\n\nTrump did not make up his claim about cows and planes out of thin air. A \"FAQ\" page that once appeared on the website of a leading Green New Deal proponent, Rep. Alexandria Ocasio-Cortez, calls for the government to \"build out high-speed rail at a scale where air travel stops becoming necessary.\"\n\nIn explaining why Green New Deal proponents were aiming to get to \"net-zero\" carbon emissions in 10 years rather than the more ambitious goal of zero carbon emissions at all, the FAQ said, \"We set a goal to get to net-zero, rather than zero emissions, in 10 years because we aren't sure that we'll be able to fully get rid of farting cows and airplanes that fast.\" The FAQ was not an official party document and has not been broadly adopted by Green New Deal supporters. Its language about cows and planes does not appear in the text of the Green New Deal resolution many congressional Democrats have endorsed.\n\nDemocrats and voter fraud\n\n\"Democrats also continue to encourage foreign interference in our elections by refusing to support a simple and beautiful thing called voter ID. Maybe I can ask our senators and congressmen: put a bill, it is so popular. You know, if you want to go out and buy groceries, you need identification. If you want to do almost anything you need identification. The only thing you don't need identification for is to vote, the most important single thing you're doing -- to vote. You don't need it. You know why? Because they cheat like hell, that's why.\" -- October 11 campaign rally in Lake Charles, Louisiana\n\nFacts First: There is no evidence that Democrats \"cheat like hell\" in elections, nor that their opposition to voter identification laws has anything to do with \"foreign interference in our elections.\" Voter fraud is exceedingly : There is no evidence that Democrats \"cheat like hell\" in elections, nor that their opposition to voter identification laws has anything to do with \"foreign interference in our elections.\" Voter fraud is exceedingly rare ; the 2016 Democratic platform says this about the party's stance on voter ID: \"We will continue to fight against discriminatory voter identification laws, which disproportionately burden young voters, diverse communities, people of color, low-income families, people with disabilities, the elderly, and women.\"\n\nEconomy\n\nUnemployment for women\n\nTrump said the unemployment rate for women was the lowest in \"71 years.\" -- October 12 speech to Values Voter Summit\n\nFacts First: This was an exaggeration. It has been : This was an exaggeration. It has been 66 years since the women's rate has been as low as it was in September, 3.4%, not 71 years.\n\nJapanese auto companies\n\n\"As you know, in addition to what we're talking about today, they're building -- Japan -- many car plants in the United States, which they weren't doing for a long time. And they're building in Michigan, Ohio, lots of different states.\" And:\"And they've really produced. They're doing a lot of plants, not just auto. Many, many -- many, many plants and factories are being built in the United States by Japan and Japanese companies.\" -- October 7 speech at signing of trade agreements with Japan\n\nFacts First: Just two Japanese car companies, Toyota and Mazda, have announced plans to build a US plant (together) during Trump's presidency; their joint venture is under construction in Alabama. There is no evidence Trump was personally responsible for this investment decision.\n\nTrump has said since 2018 that Japanese Prime Minister Shinzo Abe has told him that more Japanese carmakers will soon announce major US investments. But none of these companies has announced a new US plant since Toyota and Mazda introduced the joint venture in early 2018, though Japanese automakers have made additional investments in existing facilities and Japanese truck company Hino Motors has built a truck-cab assembly plant in West Virginia.\n\nInflation\n\n\"...We have no inflation.\" -- October 7 speech at signing of trade agreements with Japan\n\nFacts First: There is inflation: : There is inflation: 1.7% for the last 12 months ending in September . Core inflation, which excludes food and energy, was up 2.4% for the 12 months ending in September.\n\nTrump could fairly say that inflation is low, but \"no inflation\" is incorrect.\n\nThe unemployment rate\n\n\"You can't impeach a president for having the lowest and best unemployment numbers that we've had in 51 years.\" -- October 7 exchange with reporters at signing of trade agreements with Japan\n\n\"Our jobs numbers are the best they've ever been...overall, they're the best numbers in 51 years.\" -- October 7 remarks at briefing with military leaders\n\n\"Just last month, unemployment reached the lowest rate in over 50 years.\" -- October 9 speech at signing of executive orders on regulatory guidance and enforcement\n\nFacts First: This was another little exaggeration of a number that would seem to need no embellishment. The 3.5% unemployment rate for September was the lowest : This was another little exaggeration of a number that would seem to need no embellishment. The 3.5% unemployment rate for September was the lowest since December 1969 -- just under 50 years ago, not \"over 50 years\" or \"over 51 years\" ago.\n\nCrowds\n\nCrowds in El Paso\n\nTrump said of his crowd at a rally in El Paso, Texas, in February: \"I had 12,000 inside and 35,000 outside.\" -- October 10 Daily Caller excerpt from book interview with Sebastian Gorka\n\nFacts First: Trump had his El Paso rally in a venue with a capacity of 6,500. Though he has claimed that the local fire department allowed him to let in thousands more people, the fire department : Trump had his El Paso rally in a venue with a capacity of 6,500. Though he has claimed that the local fire department allowed him to let in thousands more people, the fire department told the El Paso Times that this is not true and that Trump's crowd was about 6,500.\n\nThere was also no evidence that there were anywhere close to \"35,000\" Trump supporters outside the rally, though estimates for outdoor crowds are less exact. Local journalist Bob Moore tweeted , \"El Paso County Coliseum officials tell me about 6,000 people watched the @realDonaldTrump rally on screens outside.\"\n\nThe New York Times and the El Paso crowds\n\nTrump said that, although his crowd at the El Paso rally was much larger than the crowd at a competing event held by former Democratic congressman Beto O'Rourke, \"The press said we both had 'large' rallies. One reporter in The New York Times actually said his rally was larger than mine...\" -- October 10 Daily Caller excerpt from book interview with Sebastian Gorka\n\nFacts First: The Times did not say O'Rourke's crowd was larger. The Times's main : The Times did not say O'Rourke's crowd was larger. The Times's main news story did not discuss crowd sizes in any detail, while a \"Critic's Notebook\" analysis by the paper's chief television critic, James Poniewozik, discussed Trump's fixation on crowd sizes, and dishonesty about them, but did not render a verdict, saying , \"I will leave it to others to adjudicate whose was bigger. But the night was an example of how nothing threatens this TV president more than a challenge to his ratings.\"\n\nThe judiciary\n\nThe history of judicial vacancies\n\n\"And usually, when a President comes to office, there's no — you have no vacancies. Or the previous President would have — boom. There should be no vacancy, you know, whatever their ideology is...\" And: \"And you go back and check it out, you'll find that others left none, usually none — or one or two — but one, none. One hundred and forty-two.\" -- October 12 speech to Values Voter Summit\n\nFacts First: It is not normal for incoming presidents to have no judicial vacancies to fill, or just \"one or two.\" Like Trump, his predecessors entered office with dozens of openings on federal courts.\n\nAccording to Russell Wheeler, a visiting fellow at the Brookings Institution who tracks judicial appointments, there were 103 vacancies on district and appeals courts on Jan. 1, 2017, just before Trump took office; 53 vacancies on Jan. 1, 2009, just before Barack Obama took office; 80 vacancies on Jan. 1, 2001, just before George W. Bush took office; 107 vacancies on Jan. 1, 1993, just before Bill Clinton took office. So Trump had the most judges to appoint since Clinton, but, clearly, other presidents also had appointing to do.\n\nJudicial appointments\n\n\"So we're going to have 182 new federal judges, not including two Supreme Court judges. And I guess we're already at the 156 number. Jeff and Mark, I think we're at about 156 judges now signed and sitting and doing a great job.\" -- October 9 speech at signing of executive order on regulatory guidance and enforcement\n\n\"To defend our Constitution, we have confirmed more than 160 highly qualified judges to interpret the law as written, including two incredible new Supreme Court justices.\" -- October 12 speech to Values Voter Summit\n\nFacts First: Trump was exaggerating slightly. He had appointed 152 judges to district courts, appeals courts and the Supreme Court as of the day he spoke, according to Wheeler.\n\nJudicial vacancies\n\n\"And I want to thank President Obama for leaving us 138 empty slots, because that's a first. That's a first. I said, 'How many do we have?' He said, 'Sir, you have 138 to 142.' I said, 'You've got to be kidding.' So I want to thank you, President Obama.\" -- October 9 speech at signing of executive order on regulatory guidance and enforcement\n\n\"So why is someone a good or great President if they needed to Spy on someone else's Campaign in order to win (that didn't work out so well), and if they were unable to fill 142 important Federal Judgeships (a record by far), handing them all to me to choose\" -- October 9 tweet\n\n\"Obama gave me 142 -- 142 federal judges. I said, 'How many do I have?' I figured it was none. 'Sir, you have 142.' I said, 'You gotta be kidding.'\" -- October 11 campaign rally in Lake Charles, Louisiana\n\n\"But I said during the course of the first very early period, like a week -- I said, 'By the way, how many federal judgeships do I have?' They said, 'Sir, you have 142.' I said, 'What?' 'You have 142, sir.' I said, 'You've got to be kidding. 142? You mean I have two, one, none?' 'No, you have 142.' And President Obama was not very good at getting it done, because, you know, people held him up and everything else. But, with time, you get them all done. You get them done. But he put a big rush on at the end when he saw we were doing well in the polls, and coming up and up, and it wasn't enough time. So we inherited 142 open federal judgeships, including the court of appeals. First time in history. First time in history anything like that has ever happened.\" -- October 12 speech to Values Voter Summit\n\nFacts First: Trump was not left 138 or 142 judicial vacancies by Obama. According to Wheeler, there were 103 vacancies on district and appeals courts on Jan. 1, 2017, just before Trump took office, plus a vacancy on the Supreme Court.\n\nRepublican Senate Majority Leader Mitch McConnell blocked the confirmation of many of Obama's judicial nominees late in his term; Obama didn't intend to leave the vacancies to Trump.\n\nIt was at least slightly confusing what Trump was calling a \"record,\" but it appears he was referring to the number of judicial vacancies at the end of Obama's term. If he is, that number is not a record; Bill Clinton was left 107 vacancies by George H.W. Bush, according to Wheeler\n\nImmigration\n\nMigrant apprehensions\n\n\"Likewise, we're having a lot of successes. We have tremendous success at the border. I want to thank Mexico for what they've been doing. You look at the numbers; they're tumbling down. This is one on catch and release. Look at that. See that, fellas? Catch and -- would you say that's pretty good? I'd say it's pretty good. I'd say it's pretty amazing, Steve, even for your -- from your standpoint, Steve, fellas. That's some number, huh? Getting down to almost zero.\" -- October 7 speech at signing of trade agreements with Japan\n\nFacts First: While the number of migrants apprehended or deemed inadmissible at the southwest border has : While the number of migrants apprehended or deemed inadmissible at the southwest border has declined since hitting a Trump-era high of 144,255 in May, it is not even close to \"almost zero\"; the number was 64,006 in August, according to official government statistics, and about 52,000 in September, Customs and Border Protection Acting Commissioner Mark Morgan told reporters at the White House last Tuesday.\n\nThe total for the 2019 fiscal year was 88% higher than in the 2018 fiscal year.\n\nAccomplishments and promises\n\nVeterans Choice\n\n\"We got Choice for the vets.\" -- October 10 campaign rally in Minneapolis, Minnesota\n\n\"We approved something called Veterans Choice. The veterans now can go see a doctor outside of the VA, if they have to wait for two weeks or three weeks or three days, they can go and they can see a doctor. We pay the bill, they get better. People were waiting for four, five, six, seven weeks. So our veterans, we're taking care of our veterans.\" -- October 11 campaign rally in Lake Charles, Louisiana\n\n\"Our vets are happy now. We got them Choice.\" -- October 12 interview with Fox News' Jeanine Pirro\n\nFacts First: The Choice bill, a bipartisan initiative led by senators Bernie Sanders and the late John McCain, was signed into law by Barack Obama : The Choice bill, a bipartisan initiative led by senators Bernie Sanders and the late John McCain, was signed into law by Barack Obama in 2014 . In 2018, Trump signed the VA Mission Act, which expanded and changed the program.\n\nThe history of Right to Try\n\nTrump said of the Right to Try law he signed: \"For 50 years, they have been trying to get it. Not that easy. You know, I did it pretty quickly.\" -- October 11 campaign rally in Lake Charles, Louisiana\n\nFacts First: There has not been a 50-year push for a federal Right to Try law, which aims to make it easier for terminally ill patients to access medications that have not been granted final approval. Similar laws have been passed at the state level only since 2014, after the Goldwater Institute, a libertarian think tank, began pushing for them.\n\n\"I have no idea what 'they've been trying to get' for 44 years,\" Alison Bateman-House, assistant professor of medical ethics at New York University's Langone Health, said in response to a previous version of Trump's claim. \"The Right to Try law was a creation of the Goldwater Institute, and it first became state law in 2014 (in Colorado), relatively soon after it was first conceived of.\"\n\nEnergy production\n\n\"Energy, look, we're now the number one energy producer in the world, oil and gas. We weren't close when I got elected.\" -- October 10 Daily Caller excerpt from book interview with Sebastian Gorka\n\n\"We've ended the war on American energy and with your help, right here in Louisiana, the United States is now the number one producer of oil and natural gas anywhere on the planet.\" -- October 11 campaign rally in Lake Charles, Louisiana\n\nFacts First: The US has not just \"now\" become the world's top energy producer, and it did not achieve this status because of Trump's policies: it took the top spot in 2012 -- under the very president he has accused of perpetuating this \"war on American energy\" -- according to the US government's Energy Information Administration. The US became the top producer of crude oil in particular during Trump's tenure.\n\nThe Cameron LNG plant in Louisiana\n\n\"You know, I was here a couple of months ago and they opened the biggest LNG plant I have ever seen in my life. Right? Were you there? And they've been trying to get this thing approved for years and years and years and they couldn't. And then President Trump came along and I got those permits so fast for them. These big energy executives were sitting back and they couldn't get it approved. Nothing they could do, would get it approved. Your governor was lousy, they were all lousy. Nobody could help. That thing was so dead, and I came along and I got it approved and then the consultants probably called up these big energy executive -- 'Sir, we were able to get it approved for you.' I never even saw these people, but I know it was a good thing.\" -- October 11 campaign rally in Lake Charles, Louisiana\n\nFacts First: The permits for the Sempra Energy facility Trump visited in May were granted by the Obama administration. The company : The permits for the Sempra Energy facility Trump visited in May were granted by the Obama administration. The company says on its website: \"The Federal Energy Regulatory Commission authorized the project in June 2014.\" The company confirmed to FactCheck.org: \"You are correct, Cameron LNG was approved in 2014.\"\n\nPre-existing conditions\n\n\"So, we're doing really well in the health care front -- front, but getting rid of the individual mandate -- and pre-existing conditions we take care of. So very important to remember that the Republicans are taking care of pre-existing conditions.\" -- October 10 interview with WDIO News\n\n\"Republicans will protect Medicare and we will always protect patients with pre-existing conditions.\" -- October 10 campaign rally in Minneapolis, Minnesota\n\nFacts First: We usually don't fact-check promises, but this one has already proved untrue. The Trump administration and congressional Republicans have repeatedly put forward : We usually don't fact-check promises, but this one has already proved untrue. The Trump administration and congressional Republicans have repeatedly put forward bills and lawsuits that would weaken Obamacare's protections for people with pre-existing conditions. Trump is currently supporting a Republican lawsuit that is seeking to declare all of Obamacare void. He has not issued a plan to reinstate the law's protections for people with pre-existing conditions if the suit succeeds.\n\nWind power\n\n\"And how about these Democrats? They want to get rid of oil. They want to get rid of natural gas. They want to go to wind ...'Darling, I just can't watch the show tonight. The wind, it just stopped blowing. I can't watch LSU and Florida, there's no wind today.'\" -- October 11 campaign rally in Lake Charles, Louisiana\n\nFacts First: Using wind power as part of a mix of power sources does not cause power outages even when the wind isn't blowing, as the federal Department of Energy explains on its website. \"Studies have shown that the grid can accommodate large penetrations of variable renewable power without sacrificing reliability, and without the need for 'backup' generation,\" the Department of Energy says.\n\nYou can find a longer fact check here\n\nThe New York Times\n\n\"The New York Times basically has given up journalistic standards. They've said, 'We don't care; we'll say anything.' Essentially, they're just making up stories. They don't even call for confirmation; they don't call for quotes. If they're doing a bad story on me, they don't call for a response.\" -- October 10 Daily Caller excerpt from book interview with Sebastian Gorka\n\nFacts First: The New York Times habitually contacts the White House for comment on its articles on Trump. \"This is false. We always reach out to the White House for comment on stories about the President or the Administration,\" Times spokesperson Eileen Murphy told CNN. (The Times obviously hasn't said anything like \"We don't care; we'll say anything,\" but Trump was likely speaking non-literally here.)\n\nRobert Mueller\n\n\"...He (Robert Mueller) absolutely wanted to become the FBI Director, and I said, 'No.' I said, 'Listen, you've been there for...' -- I believe it was 12 years. And I said, 'No.' And it has since been proven that I was right. Plus, we have witnesses to it. I interviewed numerous people that day. And he was one of the numerous people. Making a decision ultimately -- but he was one of the people. I said no -- nicely, respectfully...So when you look at that -- no, Robert Mueller wanted a job to be the director, and I turned him -- very nicely, respectfully -- down.\" -- October 9 speech at signing of executive order on regulatory guidance and enforcement\n\nFacts First: Then-White House chief strategist Steve Bannon has said that Mueller was not seeking the job when he spoke to Trump about it. According to both Bannon and Mueller, Mueller was asked to speak with Trump in an advisory capacity, not as a candidate.\n\nMueller served as FBI director for 12 years between 2001 and 2013. Bannon told Mueller's investigators that Mueller's conversation with Trump in May 2017 was not in the capacity of a candidate to return to the job and that Mueller \"did not come in looking for the job.\" According to the Mueller Report, rather, Bannon said \"the White House had invited Mueller to speak to the President to offer a perspective on the institution of the FBI.\"\n\nMueller said in his congressional testimony on July 24 that while he had discussed the job with Trump, it was \"not as a candidate.\"\n\n\"I was asked to give my input on what it would take to do the job,\" Mueller testified. The \"interview,\" he said, \"was about the job and not about me applying for the job.\"\n\nAsked if he had told the vice president that the one job he would come back for was the job of FBI director, Mueller said, \"Don't recall that one.\"", "description": "New record: Trump made 129 false claims last week, the most since CNN started counting in July", "authors": ["Daniel Dale", "Tara Subramaniam"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191011170646-04-trump-1011-super-tease.jpg", "published_at": "2019-10-16"}