{"pub": "investing.com", "url": "https://ph.investing.com/news/commodities-news/preciousgold-falls-on-stronger-dollar-markets-await-fed-meeting-74477", "downloaded_at": "2019-10-29 14:26:04.392882+00:00", "title": "PRECIOUS-Gold falls on stronger dollar, markets await Fed meeting", "language": "en", "text": "© Reuters. PRECIOUS-Gold falls on stronger dollar, markets await Fed meeting\n\n* U.S. Fed to start two-day meeting on interest rates\n\n* Palladium hovers near record high of $1,808.81/oz\n\n\n\n(Updates prices)\n\nBy Sumita Layek\n\nOct 29 (Reuters) - Gold fell on Tuesday as the dollar firmed\n\nand optimism about a U.S.-China trade deal increased, while\n\ninvestors looked ahead to this week's Federal Reserve meeting\n\nfor signals on future interest rate cuts.\n\nSpot gold was down 0.4% at $1,485.96 per ounce as of\n\n1220 GMT. U.S. gold futures GCv1 fell 0.5% to $1,488.70 an\n\nounce.\n\n\"A slightly stronger dollar and comments out of the U.S.\n\nindicating that they still plan to have a deal by November\n\nsupported the equity market in the U.S. and is keeping the\n\nupside in check for gold,\" UBS commodity analyst Giovanni\n\nStaunovo said.\n\n\"We have probably seen some hedge funds liquidating some\n\ngold positions and putting that money in the equity world.\"\n\nThe dollar firmed against a basket of rival\n\ncurrencies, making the dollar-denominated gold more expensive\n\nfor holders for other currencies. USD/\n\nIn the United States, the S&P 500 index hit a record\n\nhigh on Monday on hopes for possible trade deal between Beijing\n\nand Washington after U.S. President Donald Trump said he\n\nexpected to sign a significant part of the deal ahead of\n\nschedule. MKTS/GLOB Washington was also considering an extension on tariff\n\nsuspensions on $34 billion of Chinese goods. Financial markets are waiting for further clues on the\n\noutlook for U.S. monetary policy from the Fed's meeting starting\n\non Tuesday, where the U.S. central bank is widely expected to\n\ncut its benchmark interest rates for the third time this year.\n\nFEDWATCH\n\n\"The markets have hopes for a rate cut at this meeting, but\n\neven if the Fed would take a pause this week, the markets are\n\nexpecting another cut in this quarter ... which is supportive\n\nfor gold,\" Quantitative Commodity Research analyst Peter Fertig\n\nsaid.\n\nLower interest rates make gold attractive as it reduces the\n\nopportunity cost of holding the metal.\n\nAlso on the radar was Brexit, with Britain heading towards a\n\nDecember election after Prime Minister Boris Johnson's bet on\n\nbreaking the Brexit deadlock with an early vote gained support\n\nfrom opposition parties. Elsewhere, palladium XPD= was down 1.1% at $1,778.73 per\n\nounce, having hit a record high of $1,808.81 on Monday, on\n\nsupply concerns.\n\n\"The market is in its eighth consecutive deficit year and is\n\nlikely to stay in the ninth consecutive deficit year next year\n\nas well as supplies are not really growing,\" UBS's Staunovo\n\nsaid.\n\nSilver fell 1.3% to $17.63 per ounce and platinum\n\nXPT= shed 1% to $909.66.\n\n\n\n", "description": "PRECIOUS-Gold falls on stronger dollar, markets await Fed meeting", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEA660DP_L.jpg", "published_at": "2019-10-29"}