{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7622367/Texas-man-26-nearly-dies-heart-attack-triggered-10-day-energy-drink-habit.html", "downloaded_at": "2019-10-28 23:40:17.561254+00:00", "title": "Texas man, 26, nearly dies of a heart attack triggered by his 10-a-day energy drink habit", "language": "en", "text": "A Texas man suffered a massive heart attack and wound up in the hospital when he was just 26 years old - and his doctors blame the young man's habit of guzzling eight to 10 energy drinks a day.\n\nThe 26-year-old went to the emergency room at Texas Tech University Health Sciences Center at El Paso with chest and left arm pain that had lasted nine hours, according to an article from Case Reports in Emergency Medicine\n\nAll of the patient's vital signs seemed normal, but then doctors found a completely blocked artery leading from his heart.\n\nThe man revealed he typically drank eight to 10 cans - about four liters - of energy drinks, such as Monster, every day and that his chest pain came on shortly after.\n\nThe authors believe this unhealthy habit caused a blood clot to form and, in turn, led to a heart attack.\n\nA 26-year-old Texas man suffered a heart attack after consuming between eight and 10 energy drinks per day, such as Monster and Rock Star (file image)\n\nIn the report, the authors wrote the 26-year-old Hispanic man visited the emergency room with pain in the left side of his chest that was radiating to his left arm.\n\nHe also told doctors that the left arm had gone numb, he had been excessively sweating and felt so nauseous he'd even vomited.\n\nThose are all common signs of a heart attack, but a cardiac event of that scope is rare in otherwise healthy young people, so neither the young man or the doctors immediately guessed that could be what was happening to him.\n\nWhen medical staff examined him, they found his vital signs - including heart rate, blood pressure and oxygen levels - to all be normal.\n\nStill, the young man's symptoms suggested something was amiss with his cardiovascular system.\n\nTo find out what, doctors performed a cardiac catheterization, which involves inserting a thin tube is inserted into the groin, neck or arm and threading it to the heart's vessels to diagnose cardiac conditions.\n\nThe procedure revealed a complete blockage of one of his left arteries as well as other 'mild irregularities'.\n\nThat's when the man revealed he regularly drank between eight and 10 energy drinks per day, including Monster and Rock Star.\n\n'The patient stated that he drank any kind of energy drink he could get access to,' the authors of the report wrote.\n\nEnergy drinks such as Red Bull and 5 Hour Energy contain about 0.34 milligrams of caffeine per milliliter.\n\nAccording to the report, this means the patient was consuming between 1.2 grams and 1.6 grams of caffeine per day - four times the amount recommended by the US Food and Drug Administration.\n\nThe report's authors believe that drinking so much caffeine caused the walls of his coronary artery - which transports oxygenated blood to the heart - to contract.\n\nThis could lead to the formation of a serious blood clot and, in turn, cause a heart attack.\n\nIn the last few years, scientists have been shedding light on several ill effects that energy drinks can cause.\n\nAn April 2017 study from the David Grant USAF Medical Center in California found that one 32-ounce energy drink can cause dangerous arrhythmia, a condition in which the heart beats with an irregular or abnormal rhythm.\n\nAnd a February 2018 study from the University of Waterloo in Ontario, Canada, found that half of Canadian teenagers who consumed energy drinks reported experiencing health problems, including rapid heartbeat, nausea, and in rare cases, seizures.\n\nMore recently, a November 2018 study from the University of Texas at Houston found that just one energy drink narrows blood vessels, which restricts blood flow to vital organs, and increases the risk of stroke and heart attacks.\n\nThe patient had a stent, or a tube, placed into his blockedartery to improve blood flow. After two days, he was released and told not to consume any more energy drinks.", "description": "A Texas man, 26, visited an emergency room after nine hours of chest and left arm pain. After doctors found a blocked artery, he revealed that he had been drinking eight to 10 energy drinks per day", "authors": ["Mary Kekatos Health Reporter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/15/20285342-0-image-a-27_1572278226042.jpg", "published_at": "2019-10-28"}