{"pub": "nymag", "url": "https://thecut.com/2019/09/kentucky-man-charged-over-kissed-a-reporter-while-on-live-tv.html", "downloaded_at": "2019-09-27 15:04:58.677616+00:00", "title": "Man Charged With Harassment After Kissing Reporter on Live TV", "language": "en", "text": "Louisville reporter Sara Rivest during the unwanted advance. Photo: USA Today\n\nLast week, a Kentucky reporter was caught off guard when a man she didn’t know interrupted her live TV segment and kissed her on the cheek, instantly making her uncomfortable. The man, who has since been identified and apologized, is now facing harassment charges.\n\nOn September 20, WAVE 3 reporter Sara Rivest was just starting her live broadcast from Louisville’s Bourbon & Beyond music festival at the Kentucky Exposition Center when a man wearing sunglasses started to approach her. In the segment, which has since gone viral, the man moves behind Rivest, where he pretends to slap her butt — a gesture that’s out of her line of sight. Then, mere seconds later, he walks up to her and kisses her on the cheek while she’s talking, and then quickly runs off. “Okay, that was not appropriate,” Rivest says to the camera, then emits a few nervous laughs and attempts to continue reporting. Later in the segment, when WAVE anchor John Boel asks her if she’s okay, she replies, keeping her composure, that she “might need some help.”\n\nHey mister, here’s your 3 seconds of fame. How about you not touch me? Thanks!! pic.twitter.com/5O44fu4i7y — Sara Rivest (@SRivestWAVE3) September 20, 2019\n\nOn September 26, Louisville Metro Police announced that they had identified the man as Eric Goodman, and that he is facing a misdemeanor charge of harassment with physical contact, the Louisville Courier Journal reports. The same day, Rivest also wrote on Twitter that Goodman had sent her an apology letter, which she went on to read on air. In the letter, Goodman attempts to explain the motives behind his actions — that he was at a bachelor party, and that he was simply trying to be funny — but also stresses that he takes full responsibility for his inappropriate behavior.\n\n“I was wrong to interrupt your job, invade your personal space and leave you feeling powerless,” the letter reads. “Regardless, your ability to maintain a professional composure speaks volume of your strength.”\n\nHey mister, here’s your 3 seconds of fame. How about you not touch me? Thanks!! pic.twitter.com/5O44fu4i7y — Sara Rivest (@SRivestWAVE3) September 20, 2019\n\nOn air, Rivest said that she “absolutely [accepts] Eric’s apology,” as she can tell he “feels bad and is sincere.”\n\n“But his actions,” she continued, “they do have consequences, and from that letter it seems like he also believes he needs to face those consequences. So I also agree with the commonwealth’s decision in this case.”\n\nGoodman is scheduled to appear in court on November 6.", "description": "During a live broadcast, Kentucky reporter Sara Rivest was caught off guard when a strange man kissed her and pretended the slap her but. The man, who has since been identified as Eric Goodman, has been charged with harassment.", "authors": ["Amanda Arnold"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/27/27-man-kissing-kentucky-reporter.w1200.h630.jpg", "published_at": "2019-09-27"}