{"pub": "washingtonpost", "url": "https://washingtonpost.com/national-security/fourth-defendant-in-giuliani-associates-case-arrested-at-new-york-airport/2019/10/16/2c3ea19e-f024-11e9-89eb-ec56cd414732_story.html?tid=pm_pop", "downloaded_at": "2019-10-16 20:31:31.183356+00:00", "title": "Fourth defendant in Giuliani associates’ case arrested at New York airport", "language": "en", "text": "The other three defendants were quickly arrested by the FBI, but Correia’s whereabouts have been unclear until Wednesday morning. Correia is expected to make a brief court appearance Wednesday, and all four defendants are due to appear before a judge Thursday.\n\nAD\n\nAD\n\n“The defendant was taken into custody by the FBI at JFK earlier this morning,” said Nicholas Biase, a spokesman for the U.S. attorney’s office in Manhattan.\n\nIt was not immediately clear if Correia was arriving at the airport or planning to fly somewhere else.\n\nParnas and Furman, who had been helping Giuliani investigate Democratic presidential candidate Joe Biden, were arrested a week ago at Dulles International Airport outside of Washington, D.C., where they had one-way tickets on a flight out of the country, officials said.\n\nGiuliani’s business dealings with the men are part of the federal investigation, according to people familiar with the matter. A grand jury subpoena has been issued to former congressman Pete Sessions, a Texas Republican, who interacted with Giuliani, Parnas and Fruman. Parnas and Fruman are accused of violating campaign finance laws by making donations to Sessions’s campaign that exceeded federal limits.\n\nAD\n\nAD\n\nThe indictment says Parnas met with Sessions in 2018 seeking his “assistance in causing the U.S. government to remove or recall the then-U.S. Ambassador to Ukraine,” the indictment alleges. . . Parnas’s efforts to remove the Ambassador were conducted, at least in part, at the request of one or more Ukrainian government officials.”\n\nGiuliani and Sessions have denied wrongdoing. Parnas and Fruman have not formally entered pleas yet to the charges.\n\nThe arrests mark the first criminal charges to emerge from the U.S. government’s suddenly controversial relationship with Ukraine — a complex web of financial and political interactions linking diplomacy to alleged violations of campaign finance law.\n\nAD\n\nThe indictment does not allege any wrongdoing by the president or his campaign, but the charges of political donations made for the secret benefit of foreign interests adds to the growing legal and political pressure on Trump and his attorney as they try to fend off Democrats’ impeachment efforts.\n\nAD\n\nCorreia is charged with conspiracy as part of an alleged scheme involving donations to Nevada politicians in the hopes of winning support for a marijuana business secretly backed by an unidentified Russian businessman. The third defendant in the case, a California man named Andrey Kukushkin, was arrested last week, according to authorities.\n\nCorreia is not charged in the part of the case involving Sessions, but he has significant ties to the companies under scrutiny. He has been identified as chief operating officer of a company called Fraud Guarantee that he co-founded with Parnas. Giuliani has said he was paid $500,000 for work he did for Fraud Guarantee in 2018 and 2019.\n\nAD\n\nCorreia is also listed as an officer at Global Energy Partners. According to the indictment, Parnas and Fruman disguised the source of a $325,000 donation made in 2018 to America First, the main pro-Trump super PAC, by giving that money in the name of GEP. Federal prosecutors say the company was a front used to disguise the funds’ true source and that the money came from “a private lending transaction between Fruman and third parties.”\n\nGiuliani has also said Parnas and Fruman have been assisting Giuliani in his efforts to get Ukrainian officials to investigate Biden and his son, as well as Giuliani’s claim that Democrats conspired with Ukrainians in the 2016 U.S. election.\n\nAD", "description": "David Correia, one of four men indicted last week in campaign finance case, was taken into custody at JFK airport.", "authors": ["Devlin Barrett", "Reporter Focusing On National Security", "Law Enforcement"], "top_image": "https://www.washingtonpost.com/resizer/BA9Jrn5bHUlRjNeg3i7h0Kbu7rY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/XFODWTHQE4I6TNSIO26PQ3VWPY.jpg", "published_at": "2019-10-16"}