{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7595911/Lindsay-Lohan-calls-Cody-Simpson-Masked-Singer-Australia-taking-furniture.html", "downloaded_at": "2019-10-21 11:31:48.980071+00:00", "title": "Lindsay Lohan calls out Cody Simpson on The Masked Singer Australia for taking her furniture", "language": "en", "text": "American actress Lindsay Lohan has called out Masked Singer Australia winner Cody Simpson during Monday's grand finale.\n\nThe Mean Girls star guessed that the 22-year-old Australian pop star was the celebrity hidden behind the Robot mask.\n\n'If it is you [Cody Simpson], we have a lot to talk about, and this is not the arena for it,' she said cheekily.\n\n'I want my furniture back!' Lindsay Lohan (pictured) called out Australian pop singer Cody Simpson on The Masked Singer Australia during Monday night's episode\n\nThe 33-year-old then announced: 'I want my furniture back! Because I bought your furniture for your house in Venice.!'\n\nThe American actress added, laughingly: 'And if it's not [Cody], I am so sorry.'\n\nBefofe guessing the identity of the LA-based Aussie, Lindsay picked up a few clues that hinted it could be the Golden Thing hitmaker.\n\n'The surfing, the waves, coming back home, and my sister Ali dated him so I have a little insight,' she told her judges after guessing Cody.\n\nIn trouble! 'If it is you [Cody Simpson], we have a lot to talk about, and this is not the arena for it,' Lindsay said to the Robot\n\nLindsay also announced: 'I want my furniture back 'cause I bought your furniture for your house in Venice!'\n\nMeanwhile, her fellow judges guessed 5 Seconds of Summer drummer Ashton Irwin, or singer Niall Horan as the Robot.\n\nMoments later the Waiting For the Tide hitmaker was indeed revealed as the robot.\n\nAfter the announcement, Lindsay was in a complete state of shock, she added: 'I can't believe this!\n\nIt's him! Cody Simpson (pictured) was indeed revealed as the Robot, prompting host Osher Günsberg (left) to ask if Lindsay would be getting her furniture back\n\nAfter the announcement, Lindsay was in a complete state of shock: 'I can't believe this! 'I can't... I can't... I just need a minute. I'm literally in shock right now. I can't even... I'm, like, blushing for my sister, 'cause I know how much she loves you' she said\n\n'I can't... I can't... I just need a minute. I'm literally in shock right now. I can't even... I'm, like, blushing for my sister, 'cause I know how much she loves you.'\n\nHost Osher Günsberg then joked, 'The big question is, is he going to give you your furniture back?', to which Lindsay replied: 'Where is it, even?'\n\n'I don't know. I don't think it ever showed up, actually,' he replied.\n\nMissing furniture: 'I don't know. I don't think it ever showed up, actually,' he replied\n\nLast Tuesday, the Freaky Friday star first suggested the robot was Cody - because he briefly dated her sister, Ali Lohan, 25, last year.\n\nShe said: 'Originally, I was thinking a Backstreet Boy and now I'm thinking it's Cody Simpson.\n\n'Cody Simpson's very proactive in the ocean. And it would be a really big throw-off if it was Cody 'cause he dated my sister for a long time.'\n\nLindsay added: 'I feel like I know you and that's what scares me the most.'", "description": "American actress Lindsay Lohan has called out Masked Singer Australia winner Cody Simpson during Monday's grand finale.", "authors": ["Ali Daher For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/11/19985652-0-image-a-15_1571653056041.jpg", "published_at": "2019-10-21"}