{"pub": "cnn", "url": "https://bleacherreport.com/articles/2854808-lamar-jackson-and-the-ravens-get-a-needed-reality-check-in-loss-to-chiefs?utm_source=cnn.com&utm_campaign=editorial&utm_medium=referral", "downloaded_at": "2019-09-23 00:12:13.473169+00:00", "title": "Lamar Jackson and the Ravens Get a Needed Reality Check in Loss to Chiefs", "language": "en", "text": "Ed Zurga/Associated Press\n\nWhat happened to Baltimore's Lamar Jackson on Sunday is something that has happened at some point in some way to every great young quarterback in NFL history.\n\nHe got a dose of reality.\n\nJackson was good against the Chiefs. He was mentally tough. He was his usual spectacular self. He showed again why he will be a star in this league for years to come.\n\nHe showed fight. The Ravens were behind 30-13 entering the fourth quarter, but he didn't wilt. He kept throwing punches. His nine-yard touchdown run with just more than two minutes remaining in the game, cutting the score to 33-28, was gorgeous:\n\nThere was also this ridiculous play:\n\nAnd this one:\n\nAnd this one:\n\nAll those, just in the fourth quarter.\n\nIt's also true that Baltimore's defense was torched. In some ways, Jackson didn't have a chance.\n\nBut all that context and all those late highlights aside, it was still not a day up to the standard to which we've very quickly come to hold Jackson. He completed just 51.2 percent of his passes and had zero passing TDs after completing 71.9 percent and throwing for seven in the first two games.\n\nIt was that reality check we knew would come eventually.\n\nIt was a healthy one, too.\n\nJackson had made playing in the NFL look easy. The Ravens had one of the most intimidating offenses in football, and he was commanding it brilliantly.\n\nBut whereas in previous weeks Jackson was uncontainable, the Chiefs found an antidote. Whereas in the first two games he was the most devastating multifaceted weapon in the sport, the Chiefs were able for most of the game to make him only dangerous as a runner. It was reminiscent of what some defenses used to do to Mike Vick when he was with the Falcons. They would make Vick a runner and not a quarterback.\n\nThat Jackson, the top-rated passer in the league coming into the game—at 145.2—had a 70.6 rating was a sign the strategy worked. That the Ravens lost 33-28 and fell to 2-1 was another.\n\nThis isn't all on Jackson, of course. This game demonstrated his mortality, but it also showed that until further notice, it's the Chiefs, not the Ravens, who are alongside the Patriots as the class of the AFC. The Ravens will be factors, and Jackson will bounce back from this, but it's the Chiefs who are downright scary.\n\nCharlie Riedel/Associated Press\n\nChiefs quarterback Patrick Mahomes, who was 27-of-37 for 374 yards and three touchdowns, is still, unlike Jackson, totally unstoppable. Mahomes isn't as blazing fast or athletic as Jackson (who is both), but he continues to demonstrate why he is the most dangerous quarterback in football.\n\nIn the future, we may see some remarkable battles between Jackson and Mahomes. But for now, for right now, Mahomes is the king.\n\nJackson was 22-of-43 for 267 yards and again, importantly, had no passing scores. And he wasn't nearly as effective on deep passes as he had been the past two weeks:\n\nHe did rush for 46 yards on eight carries and one touchdown, providing some spectacular moments along the way—like this run, during which he showed, in no uncertain terms, just how scary he is and will be.\n\nBut overall, it was a day in which the Chiefs showed that Superman can be slowed.\n\nAnd there will be days like this for Jackson.\n\nHe's still a Superman, but his weaknesses can be exploited.\n\nThe Chiefs did what they did by creating pressuring up the middle in Jackson's face, enough to disrupt Jackson's throwing rhythm. And then the Chiefs defensive ends played contain, keeping Jackson from hurting Kansas City too badly on the ground.\n\nJackson was excellent at bouncing around the pocket and buying time. But if you look at Jackson's first two games, he was able to sit back—comfortable like he was in lounge chair—and pick apart defenses.\n\nThe Chiefs decided they weren't going to let that happen and would instead take their chances on what Jackson could do when he broke their containment, plus what running back Mark Ingram II could do.\n\nJackson had his TD on the ground, and Ingram had three more. But as a whole, it worked. It showed that if you're going to pick how to die when playing the Ravens, you should pick making Jackson and Ingram beat you on the ground. At least until he figures out how to adjust to that.\n\n\"We just have to do a better job of executing,\" Jackson said in his postgame press conference. \"I feel like that's my job. I'm the field general.\"\n\nAnd a damn good one.\n\nEven in losing, Jackson was special. And we will see the total Jackson again. Very soon. He's too good to limit for long.\n\nHe'll just have to eat this dose of reality. For now.\n\nMike Freeman covers the NFL for Bleacher Report. Follow him on Twitter: @mikefreemanNFL.", "description": "What happened to Baltimore's  Lamar Jackson  on Sunday is something that has happened at some point in some way to every great young quarterback in  NFL  history.  He got a dose of reality...", "authors": ["Mike Freeman"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/829/449/hi-res-80c1c4cc279b5c5a5343483951f1693c_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-09-22"}