{"pub": "dailybeast", "url": "https://thedailybeast.com/trump-peace-talks-with-the-taliban-are-off", "downloaded_at": "2019-09-08 11:45:47.233296+00:00", "title": "Peace Talks With the Taliban Are Off, Trump Announces Via Tweet", "language": "en", "text": "President Trump says he has called off peace negotiations with the Taliban on the eve of a secret meeting at Camp David after a U.S. soldier was killed in a Kabul bombing.\n\nIn a tweet late Saturday, the president said the “major Taliban leaders” and Afghan President Ashraf Ghani “were coming to the United States tonight.”\n\n“Unbeknownst to almost everyone,” Trump said, the Taliban leaders “were going to secretly meet with me at Camp David on Sunday.”\n\nBut “in order to build false leverage, they admitted to an attack in Kabul that killed one of our great great soldiers,” Trump wrote. “I immediately canceled the meeting and called off peace negotiations.”\n\nTrump said he was due to meet with Ghani separately from the Taliban, which has refused to negotiate with the Afghan government. Afghan officials announced Friday that Ghani had postponed his visit to Washington, though it was not immediately clear why.\n\nTrump’s tweet-cancellation of peace negotiations comes after his administration spent months negotiating with Taliban leaders out of Doha, Qatar. The talks had resulted in what U.S. envoy Zalmay Khalilzad described on Monday as an agreement “in principle” to begin withdrawing U.S. troops from Afghanistan. The agreement only needed to be approved by Trump, Khalilzad said earlier this week.\n\nEven as Khalilzad touted the nearly finalized agreement, however, The Daily Beast spoke exclusively with foreign officials and diplomats who said there was still no deal, with the Taliban not agreeing to anything. One former U.S. official familiar with the talks suggested Khalilzad may have gotten “a little over his skis.”\n\nKhalilzad’s announcement of an agreement also sparked scrutiny by U.S. lawmakers. Earlier this week, the House Foreign Affairs Committee called on Khalilzad to attend a hearing on the matter “so that Congress and the American people will have the long-overdue opportunity to understand the contours of your negotiations with the Taliban.”\n\nKhalilzad has been asked three times to appear before the committee for questioning on negotiations with the Taliban, but has yet to grant that request. Meanwhile, the committee's chairman, Rep. Elliot Engel (D-NY), noted in a letter to Khalilzad that there have been “challenges” in “getting information from the Trump administration on this issue.”\n\nShortly after Khalilzad announced the deal earlier this week, a Taliban car bomb tore through a busy area of Kabul near the U.S. Embassy, killing a U.S. service member along with 10 civilians.\n\nOn Friday, Taliban fighters also launched what the group described as a “massive” assault on the western Afghan province of Farah, where fighting was said to still be underway as of Saturday.\n\nTrump cited the violence as the reason for derailed peace talks.\n\n“What kind of people would kill so many in order to seemingly strengthen their bargaining position?” Trump wrote. “If they cannot agree to a ceasefire during these very important peace talks, and would even kill 12 innocent people, then they probably don’t have the power to negotiate a meaningful agreement anyway. How many more decades are they willing to fight?”\n\nThe Taliban had reportedly claimed the attacks were a way to secure a stronger position in peace negotiations with the U.S., but the bloodshed only intensified fears that a deal would do nothing to stop the violence.\n\nThe Afghan government has criticized the idea of a U.S. troop withdrawal, warning that it may just lead to a deadly surge in attacks by the Taliban.\n\nThe group currently controls more territory in the country than at any point since 2001.", "description": "The president announced that “unbeknownst to almost everyone,” he was about to attend a secret meeting with Taliban leaders at Camp David. But that meeting is now canceled.", "authors": ["Anna Kaplan", "Allison Quinn", "Breaking News Reporter"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_3211,w_5710,x_0,y_368/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1567901561/GettyImages-1172289889_j385nd", "published_at": "2019-09-08"}