{"pub": "yahoo", "url": "https://sports.yahoo.com/monday-night-football-viewership-stumbles-214516506.html", "downloaded_at": "2019-09-25 05:00:27.243765+00:00", "title": "‘Monday Night Football’ Viewership Stumbles For NFL & ESPN As Bears Slam D.C.", "language": "en", "text": "Click here to read the full article.\n\nGranted the NFL season is only three weeks old and fall has just begun, but another winless game for the Washington Redskins must be feeling like the team is already in the dead of winter.\n\nScroll to continue with content Ad\n\nTaking a 31-15 pounding from the bounding Chicago Bears last night on Monday Night Football, the Daniel Snyder-owned team skulked off the field at the end of another humiliation. On the other hand, the Bears win was made all the sweeter by QB Mitchell Trubisky coming alive after a slow season start and wide receiver Taylor Gabriel sealing the deal repeatedly.\n\nMore from Deadline\n\nThe Bears defense was DOMINANT on MNF! 😱\n\n🐻3 Forced Fumbles\n\n🐻1 Pick-Six, 3 INTs Total\n\n🐻4 Sacks#Bears100 | @ChicagoBears pic.twitter.com/7XnQHIbaJm — NFL (@NFL) September 24, 2019\n\nHowever, for ESPN and the NFL, that sealed deal was not such a celebration.\n\nSnaring 10.4 million viewers u against a soft Premiere Monday on the Big 4, the ESPN flagship football show dropped 11% from the audience that MNF attracted last week when the Cleveland Browns flattened the New York Jets 23-3.\n\nStory continues\n\nUp against the comparable MNF of last season, last night’s game was down 13% from the viewership that the Pittsburgh Steelers inched a 30-27 victory over Tampa Bay.\n\nWinning primetime on both broadcast and cable as usual, MNF scored a 3.7 rating among adults 18-49. To pour on the math, that’s 10% decline in the key demo from last week and a 16% hit from the third week MNF of the 2018/2019 season.\n\nThe writing was a bit on the ball this morning when a 7.3-metered market result started making the rounds. In a pro-football season that so far has seemed ratings strong compared to previous years (to put it kindly), that early metric was down a hard 17% from the first numbers for the September 15 MNF match-up. Year-to-year, last night’s game took another double-digit tumble with a 13% metered market ratings decline from that Steelers and Buccaneers battle.\n\nLet’s see how those Steelers and the Cincinnati Bengals do on MNF next week to figure out if this is a ratings trend or a pothole.\n\nSign up for Deadline's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.", "description": "Granted the NFL season is only three weeks old and fall has just begun, but another winless game for the Washington Redskins must be feeling like the team is already in the dead of winter. Taking a 31-15 pounding from the bounding Chicago Bears last night on Monday Night Football, the Daniel Snyder-owned", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/sECocl6eXFvaF32j6l2N9Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/T190SfrPx9KmMOCgR61Pmg--~B/aD0zMTc4O3c9NDc2NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/deadline.com/f3436ec0ca0dd8c764ea4d4ba78b3c13", "published_at": "2019-09-24"}