{"pub": "wsj", "url": "https://wsj.com/articles/u-s-manufacturer-h-b-fuller-discloses-potential-sanctions-violation-11569881020?mod=rsswn", "downloaded_at": "2019-10-01 00:11:28.652697+00:00", "title": "U.S. Manufacturer H.B. Fuller Discloses Potential Sanctions Violation", "language": "en", "text": "H.B. Fuller Co. , a U.S. manufacturer of adhesives, said it may have violated U.S. economic sanctions on Iran through the potential resale of its products by some customers of its subsidiaries.\n\nThe St. Paul, Minn., company in a regulatory filing said its hygiene products were possibly resold into Iran through customers of its subsidiaries based in Turkey, starting in 2011, and in India, from 2014.\n\nH.B. Fuller, which makes adhesives used in electronics, furniture, construction and disposable baby diapers, said it made a self disclosure of the possible violation to the U.S. Treasury Department’s Office of Foreign Assets Control, which enforces U.S. economic sanctions, in January 2018. The company said it stopped sales to these customers in fiscal 2018, adding the company doesn’t currently conduct any business in Iran.\n\nStill, this could result in a finding that U.S. sanctions were violated and possible penalties, the company said in its quarterly report filed with the Securities and Exchange Commission last week.\n\nNewsletter Sign-up\n\nThe company discovered the potential violation during a financial review and hasn’t received a response from OFAC, according to company spokeswoman Kimberlee Sinclair. The possible violation could result in monetary penalties ranging from zero to $10 million, H.B. Fuller said in the filing.\n\n“H.B. Fuller never sold any products into Iran,” Ms. Sinclair said. “A customer in the Middle East diverted a small amount of baby diaper adhesive into Iran. We immediately alerted OFAC when we found out.” Ms. Sinclair said the company manufactures baby diaper adhesives in India and has a sales office in Turkey.\n\nThe company said in the filing that it retained legal counsel to conduct an internal investigation on the issue in 2018. Ms. Sinclair said the company has concluded its internal investigation and has submitted the results and findings to OFAC.\n\nThe Trump administration in September increased sanctions on Iran in response to attacks on critical oil supplies in Saudi Arabia. The U.S. last week blacklisted several Chinese companies for allegedly shipping Iranian oil in violation of U.S. sanctions.\n\nWrite to Mengqi Sun at mengqi.sun@wsj.com", "description": "H.B. Fuller, a U.S. manufacturer of adhesives, said it may have violated U.S. economic sanctions on Iran through the potential resale of its products by some customers of its subsidiaries.", "authors": ["Mengqi Sun", "Mengqi.Sun Wsj.Com"], "top_image": "https://images.wsj.net/im-112374/social", "published_at": "2019-09-30"}