{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/drugs-worth-almost-r400k-confiscated-in-kzn-busts-20191012", "downloaded_at": "2019-10-13 00:23:08.761584+00:00", "title": "Drugs worth almost R400K confiscated in KZN busts", "language": "en", "text": "More than R400 000 in illicit drugs were confiscated and two people were arrested in several police raids in KwaZulu-Natal.\n\nThe two people arrested were a 36-year-old woman and 45-year-old man for drug dealing.\n\nPolice arrested the woman in Illovo, allegedly seizing 259 grams of crystal methamphetamine with an estimated street value of R91 000.\n\n\"The suspect was detained at the Amanzimtoti police station where she was charged. She appeared at the Umbumbulu Magistrate's Court [on Friday] on drug dealing charges,\" SAPS spokesperson Brigadier Jay Naicker said.\n\nThe 35-year-old man was allegedly dealing drugs at a taxi rank in Soldiers Way in the Durban CBD when police caught him.\n\nThey found 35 stones of heroin, valued at R6 700, in his possession, according to Naicker.\n\n\"The suspect was detained at the Durban Central police station and charged for dealing in drugs. He also made a brief appearance in the Durban Magistrate's Court yesterday\" Naicker said.\n\nMeanwhile, police conducted an intelligence-driven operation in an abandoned building in Smith Street, Durban, where R300 000 worth of drugs were found.\n\nThe drugs include 1 284 grams of crystal methamphetamine, eight grams of cocaine powder, six pieces of rock cocaine and 190 ecstasy tablets, Naicker said.\n\nHe added, however, that \"investigations into the ownership of these drugs are ongoing\".\n\nKZN police commissioner Lieutenant General Khombinkosi Jula welcomed the arrests and seizures.\n\n\"While we deal with the social challenges which lead to people resorting to drug usage, we will continue to disrupt the activities of drug dealers in the province.\n\n\"The scourge of drug abuse has to be fought in a multi-faceted manner if we want to win this war,\" Jula said.\n\nHe extended his gratitude to others who played roles in the operations.\n\n\"We also welcome the sterling efforts of many organisations and NGOs which are contributing towards rehabilitating and educating our youth on the dangers associated with dabbling in illegal substances,\" Jula said.", "description": "More than R400 000 in illicit drugs have been confiscated and two people have been arrested in several police raids in KwaZulu-Natal.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9353/4a20531d3e9d41dca06f98342b06e50a.jpg", "published_at": "2019-10-12"}