{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/enca-evasive-over-appointment-of-kanthan-pillay-as-news-boss-20191011", "downloaded_at": "2019-10-11 12:45:43.578044+00:00", "title": "eNCA evasive over appointment of Kanthan Pillay as news boss", "language": "en", "text": "Initial election results show a 'dismal' performance for the newly-launched Capitalist Party of South Africa. News24 speaks to \"Purple Cow\" co-founder Roman Cabanac at the IEC's results centre in Pretoria. Watch live. WATCH\n\neNCA (DStv 403) is remaining silent over the alleged appointment of Kanthan Pillay, founder and leader of the Capitalist Party of South Africa (ZACP), as the TV channel's news boss following the death of Ben Said.\n\neNCA didn't respond to media enquiries on Wednesday about whether Pillay was appointed to replace Said – who died in late August – when the appointment happened, and what the official title of the person was who was heading up the news division.\n\nOn Thursday, after a second media enquiry, eNCA spokesperson Lerato Maboi said: \"When we do have any news to share regarding appointments, we will be certain to communicate. Wishing you a great day ahead.\"\n\nOn Wednesday, an insider alleged \"eNCA has employed Kanthan Pillay to replace the late Ben Said. No formal announcement has been made as far as I am aware, but I'm told he is already making important editorial decisions\".\n\n'Particular political system, ideology'\n\n\"Pillay is founder and leader of the Capitalist Party of South Africa, also known as the Purple Cow. It goes without saying that he promotes and supports a particular political system and ideology,\" the insider said.\n\n\"Surely the journalistic and ethical [principles] of an 'independent' news organisation are being compromised? Should it be headed up by a politician pushing a particular party line? Where is the editorial independence and objectivity? Also talk of another line-up change at eNCA.\"\n\nLater on Wednesday, EFF spokesperson Mbuyiseni Ndlozi publicly tweeted that he had allegedly been \"reliably informed\" that Pillay was working as eNCA's news boss.\n\n\"This is the founder of the Purple Cow party which contested the 2019 elections on a highly reactionary ticket. If this is true, then eNCA is doomed for good!\"\n\nWhile the channel isn't forthcoming on the appointment, Pillay's recent tweets may raise questions of a link.\n\nCJ Mogoeng Mogoeng is live on @eNCA right now. — Kanthan Pillay (@KanthanPillay) October 9, 2019", "description": "eNCA (DStv 403) is remaining silent over the alleged appointment of Kanthan Pillay, founder and leader of the Capitalist Party of South Africa, as the TV news channel's news boss following the death of Ben Said.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7398/8636f3413e0243fea8367c0ed33ef017.jpg", "published_at": "2019-10-11"}