{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/09/eureka-robotics-new-robotic-arm-is-designed-for-optical-lenses-and-mirrors", "downloaded_at": "2019-10-09 18:33:09.165638+00:00", "title": "Eureka Robotics’ new robotic arm is designed for optical lenses and mirrors – TechCrunch", "language": "en", "text": "Last year, Nanyang Technological University, Singapore had a small viral sensation on its hands with the release of Ikea Bot. The robot did laps around its inept human counterparts by autonomously assembling an Ikea chair in less than nine minutes.\n\nThat same team is behind NTU spin-off Eureka Robotics, which this morning debuted Archimedes, a six-axis robotic arm designed to pick up and manipulate optical lenses and mirrors. The functionality is decidedly less YouTube video-friendly than its furniture-assembling predecessor, but there’s probably a lot more money to be made in optics.\n\nArchmides is capable of handling multiple-sized lenses and mirrors and loading them into a tray in order to be coated. Introducing a robotic arm into the process can help eliminate defects introduced by human interactions. The challenge, of course, is to create a robotic arm that can handle such delicate objects without damaging them in the process.\n\n“With Archimedes, we have taken accuracy to the tens-of-micron level,” company co-founder and NTU Associate Professor Pham Quang Cuon said in a release tied to the news. “Its accuracy of placing objects is within a tenth of a millimetre, yet it does so with the gentleness of a human touch, made possible by our control algorithms.”\n\nThe robot debuts this week at a robotics trade event in Southeast Asia.", "description": "Last year, Nanyang Technological University, Singapore had a small viral sensation on its hands with the release of Ikea Bot. The robot did laps around its inept human counterparts by autonomously assembling an Ikea chair in less than nine minutes. That same team is behind NTU spin-off Eureka Robotics, which this morning debuted Archimedes, a […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/Photo-1-Assoc-Prof-Pham-Quang-Cuong-working-with-lead-engineer-Dr-Pham-Tien-Hung-who-was-his-graduate-student.jpg?w=600", "published_at": "2019-10-09"}