{"pub": "mirror", "url": "https://mirror.co.uk/news/world-news/isis-treasure-haul-worth-20million-20748647", "downloaded_at": "2019-10-29 15:07:30.901477+00:00", "title": "ISIS treasure haul worth £20million buried in Iraqi desert found by shepherds", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nGold, silver and cash worth £20 million was buried in the Iraqi desert by ISIS and lost, only to be found by shepherds, a relative of Abu Bakr al-Baghdadi has claimed.\n\nThe leader of the terrorist organisation was killed in northwest Syria during a raid by US forces on Saturday night.\n\nIt is believed that a relative of Baghdadi by marriage, Mohammed Ali Sajet, provided US forces with key information that helped them carry out the raid.\n\nMr Sajet said that the ISIS chief was not expecting to be found and had felt his \"high security measures\" and \"excellent\" hiding tactics would keep him safe.\n\n(Image: YAHYA NEMAH/EPA-EFE/REX)\n\n(Image: AL-FURQAN MEDIA/AFP via Getty Im)\n\nIn an interview with Al-Ararabiya he said that Baghadi had been stowed away in an eight-meter tunnel which was five or six meters wide and filled with religious books.\n\nHe also spoke about how top ISIS leaders had buried dollars, gold and silver in the desert.\n\nThe savings plan did not work out particularly well however.\n\nThe Islamic extremists lost the bounty, which was later found by shepherds.\n\n(Image: Anadolu Agency via Getty Images)\n\n(Image: Al-Arabiya)\n\nIn the mellee of the raid - in which numerous ISIS fighters were shot or captured - the fate of the fleeing extremist chief wasn't immediately clear to US officials watching a live stream in the White House.\n\nBaghdadi took his own life and killed children near him when he detonated a suicide vest at the end of a tunnel while US forces and specialist attack dogs bared down on him.\n\nThe news was relayed to the White House in a simple message: \"Got him, 100 percent confidence, jackpot, over.\"\n\nThe operation to take down the 48-year-old Islamic extremist was first suggested roughly a month ago when the US began to receive intelligence on the whereabouts of Baghdadi, including 'helpful' information from the Kurds.\n\n(Image: YAHYA NEMAH/EPA-EFE/REX)\n\n(Image: MAXAR HANDOUT/EPA-EFE/REX)\n\nTwo weeks ago intelligence officials were about 'scope out' the ISIS leader's exact whereabouts near the town of Barisha.\n\nBut it was only three days ago that Trump became aware of the plans to take out Baghdadi.\n\nAs part of the plan the US had to secure permission from Russia to fly over its airspace.\n\nTrump said the White House did not disclose the nature of the operation to Russia, but told Russian officials they would \"like\" it.\n\nAfter playing a round of golf earlier on Saturday, Trump returned to the White House and settled in the Situation Room alongside his top generals and security officials.\n\n(Image: AFP via Getty Images)\n\nMoments after he was in place, at around 9pm UK time, US helicopters lifted off from their air base in Iraq and flew some 500 miles over 'very very dangerous territory', a journey that lasted just over an hour.\n\nWhen they arrived at Baghdadi's compound the helicopters came under gunfire but US forces were able to quickly suppress the assault and land safely.\n\nBelieving the main compound door to be booby trapped, they entered in just seconds by blasting through the wall, said Trump.\n\nUS forces quickly cleared the compound \"with people either surrendering or being shot and killed,\" said Trump.\n\n(Image: REUTERS)\n\nEleven children were removed, uninjured, and taken into care by a third party whom the president declined to name.\n\nSoldiers captured and later imprisoned several Islamic State fighters.\n\nBaghdadi fled into a subterranean area of the complex and into a tunnel, dragging three of his young children with him.\n\nChased by the dogs and confronted by a dead end, Baghdadi - \"whimpering and crying and screaming,\" according to Trump - ignited his suicide vest, killing himself and his children and causing the tunnel to collapse.\n\n(Image: Instagram)\n\nGiving his version of events, Trump said: \"Baghdadi was vicious and violent. And he died in a vicious and violent way, as a coward, running and crying.\"\n\nThe President was also quick to emphasis his involvement in the military action, while heaping curious praise on ISIS's media department.\n\n\"I've been looking for him for three years. I've been looking for him,\" he added.\n\n\"You know, they use the internet better than almost anybody in the world, perhaps other than Donald Trump .\"\n\nQuestions have been raised about how Trump could go into such detail, given that the video stream beamed to the White House was taken from an overhead aircraft.", "description": "Relative of Abu Bakr al-Baghdadi, Mohammed Ali Sajet, claims the terror group buried gold, cash and silver in the Iraqi desert", "authors": ["Milo Boyd", "Image", "Yahya Nemah Epa-Efe Rex", "Al-Furqan Media Afp Via Getty Im", "Anadolu Agency Via Getty Images", "Al-Arabiya", "Maxar Handout Epa-Efe Rex", "Afp Via Getty Images", "Reuters", "Instagram"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20734614.ece/ALTERNATES/s1200/1_FILES-IRAQ-CONFLICT-BAGHDADI-IS.jpg", "published_at": "2019-10-29"}