{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/eos-holds-top-spot-bitcoin-11th-in-chinas-latest-crypto-rankings", "downloaded_at": "2019-10-28 13:18:23.622139+00:00", "title": "EOS Holds Top Spot, Bitcoin 11th in China’s Latest Crypto Rankings", "language": "en", "text": "China’s state-backed tech workgroup has released its fourteenth crypto rankings report, with Bitcoin (BTC) ranked 11th and EOS (EOS) retaining the top spot as of the end of September 2019.\n\nThe listings rank 35 assets in total, as reported on Sep. 29 by the Center for Information and Industry Development (CCID)’s online information portal.\n\nReshuffles\n\nCompared with the last instalment of the rankings this July, Bitcoin has held its position while altcoin Tron has dislodged Ether (ETH) from the second spot. XRP is up from 30th to 20th-ranked asset.\n\nCCID cryptocurrency rankings, Sep. 2019. Source: CCIDnet\n\nQutum (QTUM) has risen from 18th to 8th, Lisk (LSK) from 14th to 7th and Dash (DASH) from 21st to 17th.\n\nChina’s blockchain boom\n\nUnder the aegis of China’s Ministry of Industry and Information Technology, CCID first launched its monthly crypto ratings report back in May 2018, and awarded Ether the top position out of the original 28 coins.\n\nThe assets are evaluated according to three parameters: basic technology, application and innovation.\n\nTron — first included in CCID’s rankings this February — has today reported gains of as high as 25% against the U.S. dollar, perhaps following CEO Justin Sun’s announcement of a major, as yet undisclosed, partnership with an alleged “mega corporation.”\n\nThat same day, China’s President Xi Jinping called for the accelerated national adoption of blockchain technology in an official speech.\n\nPresident Xi’s intervention and positive signs from the People’s Bank of China have this week sparked a major uptick in the domestic blockchain sector — spurring the stock markets and fervent interest among the public.", "description": "China’s state-backed tech workgroup has released its fourteenth crypto rankings report, with Bitcoin ranked 11th and EOS retaining the top spot", "authors": ["Marie Huillet"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvZDMzOTZjZmU1OGFlNWZlMTYyZjk3MjJkNmM2OThkM2EuanBn.jpg", "published_at": "2019-10-28"}