{"pub": "washingtonpost", "url": "https://washingtonpost.com/weather/2019/09/22/tropical-storm-karen-forms-eyes-puerto-rico-additional-tropical-threats-loom", "downloaded_at": "2019-09-22 16:34:23.005720+00:00", "title": "Tropical Storm Karen forms, eyes Puerto Rico as additional threats loom", "language": "en", "text": "Tropical Storm Karen formed Sunday at 5 a.m. just east of the Windward Islands. It’s likely to affect Puerto Rico by midweek as a tropical storm, although it’s not out of the question that it could intensify into a hurricane shortly before either making landfall there or passing just off the coast.\n\nPuerto Rico is extremely vulnerable to a tropical storm or hurricane, given the extensive and ongoing recovery effort in the wake of Hurricane Maria, which hit in 2017. The power grid remains fragile, with outages occurring even without the presence of significant storms and many people still sleeping in temporary structures vulnerable to wind damage.\n\nA tropical storm watch has been posted for Puerto Rico as well as the U.S. and British Virgin Islands. Tropical storm warnings are in effect for Trinidad and Tobago, Grenada and St. Vincent and the Grenadines. As of 11 a.m. Sunday, the center of circulation was between Grenada (to the south) and St. Vincent (to the north), and Karen was moving west-northwest at 13 mph.\n\nMaximum sustained winds were at 40 mph but covered an exceptionally broad area — spreading up to 125 miles away from the center. The storm is in a moderate to highly sheared environment, meaning the surrounding winds are blowing with different speed and/or direction with height, and this will limit the ability of Karen to consolidate its thunderstorms and intensify during the next one to two days, according to the National Hurricane Center.\n\nWhile minor fluctuations in strength are possible for now, Karen is expected to begin intensifying once conditions become more favorable, with lower levels of wind shear, by late Monday.\n\nThe latest forecasts call for Karen to meander north-northwestward through the eastern Caribbean and then turn northward as it approaches Puerto Rico on Tuesday. It’s likely to make its closest pass just east of, or over Puerto Rico, Tuesday into Wednesday. Karen is expected to be at tropical-storm intensity during that time frame, with heavy rains and gusty, damaging winds possible on Puerto Rico.\n\n#Karen is the 4th storm to be named in the Atlantic since September 14 - tying the record set in 1998 for most named storms forming in the Atlantic between September 14 and 22. #Humberto #Imelda #Jerry pic.twitter.com/K2YQUsReN3 — Philip Klotzbach (@philklotzbach) September 22, 2019\n\nThe islands just east of mainland Puerto Rico, including Vieques, Culebra and the U.S. Virgin Islands, could also see tropical-storm conditions and heavy rains, depending on the storm’s exact track. Rainfall amounts would probably vary considerably across Puerto Rico, depending on Karen’s ultimate track and how the storm’s rain bands interact with the island’s topography.\n\nWhile Tropical Storm Karen may initially try to scoot northward, out to sea, it could be deflected west by the circulation around a newly invigorated Bermuda High. This could put impacts to the Bahamas, or even the East Coast of the United States, into play, though there is significant uncertainty about these possibilities.\n\nThe hurricane center specifically mentions that by day 5 of its forecast, the storm could stall as it runs up against that high-pressure area, before moving slowly west.\n\nIn addition, the hurricane center says a tropical wave between Cape Verde and the African Coast has a 90 percent chance of developing into a tropical depression or tropical storm in the next 48 hours. Lorenzo is the next name up on the list, and computer models show that this storm could intensify into a powerful hurricane as it chugs west. However, currently at least, the odds favor it recurving out to sea before it reaches populated areas in the Caribbean or the United States.\n\nMeanwhile, Tropical Storm Jerry continues to scoot northward, and it’s likely to pass just north of Bermuda on Wednesday. Gusty winds and showers are possible on the island, though the blow should be less than that of Hurricane Humberto just seven days prior.", "description": "As Jerry meanders north, Karen has formed and is eyeing Puerto Rico as another wave off the coast of Africa develops.", "authors": ["Matthew Cappucci", "Meteorologist", "Capital Weather Gang", "Andrew Freedman", "Editor Focusing On Extreme Weather", "Climate Change", "Science", "The Environment.", "September At Am", "Matthew Cappucci Is A Meteorologist For Capital Weather Gang. He Earned A B.A. In Atmospheric Sciences Harvard University In"], "top_image": "https://www.washingtonpost.com/resizer/CSG22QfdUPJ2bdgM-mwK9CvfEL4=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RP4IG7XPHBFYVBAGVPAP45PJY4.png", "published_at": "2019-09-22"}