{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/brexit-justin-welby-urges-boris-20734467", "downloaded_at": "2019-10-27 12:09:14.695771+00:00", "title": "Brexit: Justin Welby urges Boris Johnson to tone down 'inflammatory' language", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThe Archbishop of Canterbury has taken Prime Minister Boris Johnson to task for his use of \"inflammatory\" language through the Brexit debate.\n\nJustin Welby told the Sunday Times there was a risk of pouring \"petrol\" on the country's divisions on the issue of Britain's departure from the European Union.\n\nThe archbishop said Mr Johnson had come to symbolise a climate in which Britain had become consumed by \"an abusive and binary approach to political decisions\", and where those with opposing views treated each other as \"total\" enemies.\n\nIn an era in which social media had made it \"extraordinarily dangerous to use careless comments\", and in which hate speech was on the rise, Mr Welby called for political leaders to take more care with their language.\n\nAlthough he said his criticisms were not confined to Mr Johnson and his Government, the Archbishop made it clear he considered the prime minister partly to blame for the fact society had become \"quite broken\".\n\n(Image: Getty Images)\n\n\"I think we have become addicted to an abusive and binary approach to political decisions: 'It's either this or you're my total enemy',\" Mr Welby told the paper.\n\n\"There have been inflammatory words used on all sides, in parliament and outside - 'traitor', 'fascist', all kinds of really bad things have been said at the highest level in politics.\"\n\nMr Welby said he was \"shocked\" by Mr Johnson's recent dismissal of concerns extreme language could encourage death threats against politicians as \"humbug\".\n\nAnd he added political leaders could no longer behave the same way as Mr Johnson's hero, Winston Churchill.\n\n\"Churchill was well known for his somewhat inflammatory putdowns in parliament,\" the archbishop said.\n\n\"But this is happening at a time when we have social media, which amplifies things.\n\n\"In a time of deep uncertainty, a much smaller amount of petrol is a much more dangerous thing than it was in a time when people were secure.\n\n(Image: PA)\n\n\"There is a great danger to doing it when we're already in a very polarised and volatile situation.\"\n\nMr Welby said action was needed to heal divisions \"at almost every level of society, including the political level of society\", adding: \"I don't only blame government. I think we are quite broken.\"\n\nPreviously the Archbishop has been criticised for getting involved in politics after he said he was willing to chair a citizen's assembly as a way of breaking through the Brexit deadlock.", "description": "The Archbishop of Canterbury has warned of the danger of \"pouring petrol\" on the divisive Brexit debate", "authors": ["Nicola Bartlett", "Image", "Pa Archive Pa Images", "Getty Images", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20734466.ece/ALTERNATES/s1200/0_Archbishop-of-Canterbury-meets-Dr-Mohamed-Sayed-Tantawy.jpg", "published_at": "2019-10-27"}