{"pub": "abcnews", "title": "Early education, relationship with teachers paramount for children success, study says", "url": "https://abcnews.go.com/Health/early-education-relationship-teachers-paramount-children-success-study/story?id=65293302", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:05:29.123137+00:00", "text": "They say it takes a village to raise a child and educating one may not be any different.\n\nTo many, it may not come as a surprise that children who receive education such as basic vocabulary and math skills early in life, starting in preschool, are more likely to develop life-long skills that help them do well in school for years to come, especially those in low-income communities.\n\nBut according to a new study published this week in Child Development, not only is early exposure to math and vocabulary a potential catalyst for future positive outcomes, but so is the focus on self-regulation; allowing a child to manage their emotions, behavior and body movement in tough situations. And for that the relationship with the teacher is of paramount importance.\n\n“Behavior management and teachers’ health help create a quality program for children” Dr. Dana Charles McCoy, study author and professor at Harvard Graduate School of Education told ABC News. “Several decades of research has shown that high quality programs can have a good impact.”\n\nSTOCK PHOTO/Getty Images\n\nTeachers in low-income areas of Chicago received training through the Chicago School Readiness Project (CSRP). The idea is that if teachers know the best ways to interact with preschoolers, the children will learn better and taking the time to train teachers makes them feel more valued and appreciated as well.\n\n“Teachers received professional development courses that focused primarily on behavior management strategies in the classroom and how to avoid harsh discipline, but to instead promote behaviors. This reduced their own stress.” Says Dr. McCoy. “Teachers received Masters level mental health education.”\n\n“The teachers received the training and passed it on to the children, improving structural quality and warmth and organization of the teachers into the classroom” McCoy says.\n\nMcCoy suggests that these types of interventions may contribute to a good learning environment for kids, and Marie Spinney, an experienced NYC Department of Education Pre-K teacher, agrees.\n\n“Anytime that you’re able to bring something back to the classroom, any sort of coaching and it works, it does increase learning,” Marie Spinney told ABC News in an interview.\n\n“In the Pre-K level it’s about the process, not as much as the achievement.” Spinney says, \"Being able to focus on the process, on what they need help with, sets them up for kindergarten. Sets them up for success.”\n\nSTOCK PHOTO/Getty Images\n\nAnd the professional development gives teachers confidence too.\n\n“It’s very empowering. You [the teacher] feel more supported. You feel like you’re being valued as a teacher and that feeling helps with the kids because you are excited,” Spinney says.\n\n“Kids need more than academic content. Emotional, social, and cognitive skills help them engage and learn in the classroom and get along with peers and engage in academic content,” McCoy told ABC News. McCoy hopes this study will “shift from talking whether preschool is important to moving conversation to what aspect of preschool creates the biggest impact for kids. What defines a high-quality preschool program and ensures that all kids have the ability to receive those qualities.”\n\nShe went on to say that, “low-income background kids don’t have the same opportunities as people from more advantaged backgrounds. So these types of programs are trying to promote equity and give kids from all different backgrounds the opportunity to succeed.”\n\nHowever, it may not be that simple.\n\nWhile “professional development is worthwhile,” says Spinney, “implementing it may not be as straightforward.”\n\nEach child is different.\n\nAnother study on “Children’s first-person experiences,” points out “that the linguistic environment of a preschool classroom is highly dynamic from the perspective of the learner.” The study suggests that many children often interact with teachers in the classroom frequently, but that the length of these interactions varies from child to child.\n\nMcCoy reminds us, that “early preschool programming can impact trajectories into adulthood,” and that, “this study gives us an idea of what types of practices in the classroom are able to promote education and well-being.”\n\n“The take home lesson, hopefully, can benefit all kids,” she says.\n\nKimberly Dike, M.D., is a senior internal medicine resident physician at the University of Texas Health Science Center at Houston, and a member of the ABC News Medical Unit.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Health/stress-student-rf-gty-jc-190326_hpMain_16x9_992.jpg"}