{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/2019090311688/asia-markets-asian-markets-mostly-gain-after-encouraging-data-on-china-services-activity", "downloaded_at": "2019-09-04 03:45:35.975979+00:00", "title": "ASIA MARKETS: Asian Markets Mostly Gain After Encouraging Data On China Services Activity", "language": "en", "published_at": "2019-09-04", "text": "By Marketwatch and Associated Press\n\nHang Seng, Shanghai rise, Nikkei about flat\n\nAsian markets mostly gained in early trading Wednesday after data showed improving services-sector activity in China last month. Markets started the day near session lows following Wall Street's stumble after poor U.S. manufacturing data raised recession fears.\n\nThe private Caixin China services purchasing managers index rose to 52.1 in August from 51.6 in July, according to the Wall Street Journal (link). Data suggested that domestic demand was stronger than foreign demand and an employment measurement jumped.\n\nOn Tuesday, U.S. stocks slipped (link)after a key gauge of the manufacturing sector signaled the first contraction of activity in three years.\n\nOn the trade-war front, tariff hikes by both the U.S. and China went into effect over the weekend, and President Donald Trump on Tuesday urged China to make a deal soon, since he said terms will be even tougher (link) if he is reelected in 2020. CNBC reported Tuesday (link)that Trump was so angered last month when he learned that China would raise tariffs on U.S. products in retaliation for fresh U.S. tariff hikes that he wanted to double tariffs on Chinese goods. He was reportedly talked out of it after top advisers warned of the effect that could have on the economy and the stock market.\n\nJapan's Nikkei was last about flat, and Hong Kong's Hang Seng Index jumped 1.4%. The Shanghai Composite rose 0.2% while the Shenzhen Composite fell 0.1%. South Korea's Kospi gained 0.2%, while benchmark indexes in Taiwan , Singapore , Malaysia and Indonesia were mixed. Australia's S&P/ASX 200 fell 0.5%.\n\nAmong individual stocks, Nissan (7201.TO) and Mitsubishi Motors (7211.TO) sank in Tokyo trading after industry data found auto sales in South Korea fell sharply (link)amid a consumer boycott against Japanese goods. Fast Retailing (9983.TO) and Nintendo (7974.TO) gained. In Hong Kong, casino operator Galaxy Entertainment (0027.HK) and property developers New World (0017.HK) and Country Garden (2007.HK) rose. Chip maker SK Hynix (000660.SE) jumped in South Korea, and Beach Energy (BPT.AU) sank while Oil Search (OSH.AU) surged in Australia.\n\n(END) Dow Jones Newswires\n\nSeptember 03, 2019 23:25 ET (03:25 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png"}