{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/hulu-and-marvels-helstrom-show-just-found-its-devilishly-good-cast", "downloaded_at": "2019-10-09 00:39:12.973660+00:00", "title": "Hulu And Marvel's Helstrom Show Just Found Its Devilishly Good Cast", "language": "en", "text": "Daimon unleashes his satanic side. (Image: Thony Silas, Nelson DeCastro, and Chris Sotomayor, Marvel Comics)\n\nGhost Rider may not be making the leap to the streaming service any more but the other Marvel show that was revealed in the works for American streaming service Hulu recently just got a big shot in the arm — in part thanks to a literal Marvel.\n\nDeadline reports that Paul Zbyszewski’s series about the titular supernatural Marvel character Daimon Helstrom, son of Satan, has found its main cast. This version of the series will focus around Daimon and his sister, Ana, as they use their chaotically supernatural abilities and connection to the underworld to “pursue the world’s vilest of the vile — with some family drama of their own.” After all, you can’t tell a story about the children of Hell without a bit of family drama, right?\n\nFilling the fiery footsteps of Daimon and Ana will be Grantchester’s Tom Austen and Fear the Walking Dead’s Sydney Lemmon, respectively. Austen’s Daimon is described as “a professor of ethics who moonlights as an exorcist,” concerned less about saving the world from demonic threats as he is safeguarding those closest to him as he relentlessly pursues his demon foes. Lemmon’s Ana, meanwhile, is a ruthless auction house manager by day, “but her true interest lies in hunting down those who hurt others,” working with her brother to stop their father’s potential return.\n\nFilling out the human side of the Helstrom family is Daimon and Ana’s mother, Victoria Helstrom. Played by Homeland’s Elizabeth Marvel, Victoria has spent two decades being institutionalised after being “plagued by demons both real and imagined,” and hopes to repair her fractured relationship with her children.\n\nThe main cast is rounded out by June Carryl, Ariana Guerra, Alain Uy and Robert Wisdom. Carryl plays Dr. Louise Hastings, the psychologist in charge of Victoria Helstrom’s psychiatric care “with a strong faith but an open mind,” who has come to act as a family friend to the Helstroms, including helping Daimon with his anti-demon adventures.\n\nGuerra plays Gabriella Rosetti — an agent of the Vatican dispatched to help Daimon and Hastings uncover acts of demonic interference in the world — while on Ana’s side of the family, Uy plays Chris Yen, Ana’s business partner at the auction house and a “surrogate brother,” aiding her Ana as a loyal friend and assistant. Lastly, Wisdom plays a character only dubbed as “Caretaker:” a “guardian of knowledge of the occult” who Ana turns to to help go on her own demon-hunting escapades.\n\nHelstrom, which has just begun production, currently doesn’t have a scheduled release date. We’ll bring you more on Marvel’s plans for the underworld as and when we learn them.", "description": "Ghost Rider may not be making the leap to the streaming service any more but the other Marvel show that was revealed in the works for American streaming service Hulu recently just got a big shot in the arm — in part thanks to a literal Marvel....", "authors": ["Tegan Jones", "Alex Cranz"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/c15vyqf80t7fwu2og9tk.jpg", "published_at": "2019-10-09"}