{"pub": "yahoo", "url": "https://sports.yahoo.com/nfl-picks-2019-week-1-150855731.html", "downloaded_at": "2019-09-04 23:48:13.836909+00:00", "published_at": "2019-09-04", "title": "NFL picks 2019, Week 1: Who are the experts taking in Bears vs. Packers?", "language": "en", "text": "The Chicago Bears are set to begin their 2019 season Thursday night at home against the Green Bay Packers in a game that will set the table for a year overflowing with Super Bowl hype.\n\nMuch of the drama will surround Mitch Trubisky, who needs to prove on a national stage that he's ready to take his place among the NFL's top quarterbacks. Upending Aaron Rodgers would be a great way to start, but there doesn't appear to be much confidence in his ability to do it. At least, not among experts who've already made their Week 1 pick.\n\nScroll to continue with content Ad\n\nAccording to NFL Pick Watch, 52% of experts polled are taking the Packers to win the game. It's surprising, considering the Bears are home, are returning almost all of their starters from a 12-4 season a year ago, and will field a more confident Trubisky running a well-oiled offense in Year 2 under Matt Nagy.\n\nThe Packers, on the other hand, will debut coach Matt LaFleur, who's caused quite the stir in Green Bay with his philosophy on quarterbacks audibling his play call. How he meshes with Rodgers will go a long way in determining whether the game is even close, let alone whether the Packers can pull off a win.\n\nThe Bears are currently three-point favorites, which is essentially a push considering the home team generally gets a three-point nod.\n\nDespite all the success Chicago enjoyed in 2018, there's still obvious hesitation to anoint them as the Kings of the NFC North. If they slay Rodgers and the Packers in Week 1, confidence in this team will reach an all-time high.\n\nNFL picks 2019, Week 1: Who are the experts taking in Bears vs. Packers? originally appeared on NBC Sports Chicago", "description": "The Chicago Bears are set to begin their 2019 season Thursday night at home against the Green Bay Packers in a game that will set the table for a year overflowing with Super Bowl hype.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/2cgLQbvDeDm0WMOBORxrpQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/a2w1DeuNkumO6dvxCRJkcA--~B/aD0xNzkwO3c9MjY4NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/csnchicago.com/d904623e39f8b7c6e81d85dcfe241d8e"}