{"pub": "usatoday", "url": "https://usatoday.com/story/sports/ncaaf/2019/10/30/acc-teams-looking-for-postseason-berths-down-the-stretch/40498805", "downloaded_at": "2019-10-30 15:59:17.177624+00:00", "title": "ACC teams looking for postseason berths down the stretch", "language": "en", "text": "AP\n\nFourth-ranked Clemson and No. 23 Wake Forest could lead another long line of ACC schools playing after the regular season ends.\n\nTen of the other 12 Atlantic Coast Conference schools enter the regular season's final month with a shot at becoming bowl eligible. Pittsburgh, Virginia and Virginia Tech could reach the six-win threshold this weekend.\n\nEven struggling programs such as Syracuse (3-5) and last-place Georgia Tech (2-5) have a chance to play in December. It might be a stretch for the ACC to surpass last season's record-tying total of 11 bowl participants, but it could be an intriguing November for the league with so many postseason berths within reach for so many teams.\n\nVirginia coach Bronco Mendenhall said in some ways ACC teams can thank Clemson for what's happening.\n\n\"It's wide open with four weeks to go, which I think is great for college football,\" Mendenhall said. \"At some point the number of teams that play Clemson in our league, the learnings that come from that, will improve the programs.\"\n\nThe ACC has 13 bowls available including the Orange, where the league champion or highest-ranked team will play if that team is not in the four-team College Football Playoff. The first CFP rankings will be released next week.\n\nFourth-ranked Clemson (8-0, 6-0) is no playoff lock despite dominating the ACC again. If anything, the Tigers have tried to maintain their standing since their lone hiccup, a 21-20 escape of North Carolina (4-4) in September — which has led to a steady drop from No. 1.\n\nClemson's recent romp since that narrow win has bolstered a perception of the ACC as a two-tiered league consisting of the Tigers and everybody else . High-scoring Wake Forest (6-1, 2-1) looks to prove otherwise in a Nov. 16 showdown that will likely decide the ACC's Atlantic Division.\n\nShould the Demon Deacons come up short, the eventual winner of the wild Coastal Division awaits its chance at Clemson in the ACC championship on Dec. 7 in Charlotte, North Carolina. Anything is possible if the Tigers have another bad day, but the ACC's current jostling of teams suggests balance that will pay off with significant representation in bowl games.\n\n\"By the middle of next month, you'll have a good idea of what teams are going to be capable of getting to six wins,\" ACC Network host Wes Durham said. \"It may be that you have nine or 10 teams that go to bowls, but how many of those nine or 10 teams have the minimum number of (FBS) wins?\n\n\"I think measuring leagues and the strength is a really inexact science. What you can safely say is that no matter the league, you've probably got a really good team, maybe another really good team. Then you've got four or five average to above-average teams and then the bottom, or other, third. I think that's a lot of college football, though.\"\n\nLouisville may be among the ACC's biggest surprises.\n\nAfter last year's 2-10 finish, the Cardinals were predicted to be looking up at the rest of the ACC this season. Instead, they're a win away from being bowl eligible under Scott Satterfield.\n\nThe former Appalachian State coach acknowledged that a bowl bid is \"the elephant in the room.\" But he also stressed that the Cardinals remain a work in progress and is trying to keep players' minds off where they might spend December.\n\n\"You don't go to try and get bowl eligible because if you focus on that you're not going to get it,\" the first-year Louisville coach said. \"Any one of these teams can beat us. We have to focus everything that we have on Miami and hope at the end of the season that what you've done is good enough to warrant a nice bowl.\"\n\nClemson coach Dabo Swinney is preaching the same patience to the Tigers, though his postgame fashion choice after his team drilled Boston College 59-7 offered a hint that his postseason travel ambitions are pretty high.\n\nDressed in a pink sports jacket to support Clemson's \"Think Pink\" initiative to raise awareness of breast cancer, Swinney was asked where he got it. The candid coach replied that it was a $49 coat from Belk, a southeastern department store chain and title sponsor of a bowl game with ACC affiliation in Charlotte.\n\nWith the possibility of playoff games in Arizona (Fiesta), Atlanta (Peach) and the CFP championship in New Orleans, Swinney isn't thinking of a second trip to Charlotte after the league's title game.\n\n\"Shout out to Belk,\" the coach said. \"I love them. But I don't want to go to that bowl. Been there, done that. Y'all aren't going to like me if we're there.\"\n\n___\n\nAP Sports Writers Aaron Beard in Raleigh, North Carolina; Pete Iacobelli in Clemson, South Carolina; and Hank Kurz in Charlottesville, Virginia, contributed to this report.\n\n___\n\nMore AP college football: https://apnews.com/tag/Collegefootball , https://twitter.com/AP_Top25 , and https://podcasts.apple.com/us/podcast/ap-top-25-college-football-podcast/id1138957862?mt=2", "description": "ACC bowl watch: Clemson, Wake Forest are in, 10 others are within reach of postseason eligibility", "authors": [], "top_image": "https://www.gannett-cdn.com/-mm-/927c8e499fabf10c2f17dfa1e3fe75cdf104ae1c/c=0-217-4164-2559/local/-/media/2019/10/30/USATODAY/usatsports/55bbed2156f44f438966057ac19dc3ef.jpg?width=3200&height=1800&fit=crop&format=pjpg&auto=webp", "published_at": "2019-10-30"}