{"pub": "abcnews", "url": "https://abcnews.go.com/International/wireStory/calm-iraqi-capital-bloody-night-protests-66092120", "downloaded_at": "2019-10-07 03:37:58.844460+00:00", "title": "Iraq blames 'malicious' hands as toll from unrest tops 100", "language": "en", "text": "Twelve anti-government demonstrators were killed Sunday in ongoing protests in the capital Baghdad, the latest fatalities in six days of clashes that have left more than 100 dead and thousands wounded.\n\nIraq's government has scrambled to contain the popular anger that has racked Baghdad and a number of southern cities since Tuesday. Security forces responded with a crackdown on the spontaneous rallies of demonstrators demanding jobs, better services and an end to endemic corruption in the oil-rich country.\n\nIn the first official statement from the government accounting for the violence, Interior Ministry spokesman Saad Maan said Sunday that 104 people had been killed in the six days of unrest, including eight members of the security forces, and more than 6,000 wounded. He said an investigation was under way to determine who was behind the most deadly day of violence, in Baghdad on Friday.\n\nThe unrest is the most serious challenge facing Iraq two years after the victory against Islamic State militants. The chaos also comes at a critical time for the government, which has been caught in the middle of increasing U.S.-Iran tensions in the region. Iraq is allied with both countries and hosts thousands of U.S. troops, as well as powerful paramilitary forces allied with Iran.\n\nIraq's most senior Shiite spiritual leader, Grand Ayatollah Ali al-Sistani, has urged the protesters and the security forces to end the violence while the country's prime minister has called on the protesters to go home. Prime Minister Adel Abdul-Mahdi also pledged to meet with the protesters wherever they are and without any armed forces, to hear their demands.\n\nAbdul-Mahdi defended the security forces, saying they were carrying out their duties and would only use force in extreme cases of self-defense.\n\n\"We can't accept the continuation of the situation like this,\" Abdul-Mahdi told his Cabinet late Saturday in televised remarks. \"We hear of snipers, firebombs, burning a policeman, a citizen.\"\n\nSpeaking on Sunday, Maan, the Interior Ministry spokesman, said protesters have burned 51 public buildings and eight political party headquarters. He claimed security forces didn't confront the protesters, adding that \"malicious hands\" were behind targeting protesters and security members alike.\n\nThat contradicted accounts from demonstrators and journalists at the scene who have said they witnessed security forces firing on demonstrators. Some protesters said snipers also took part in breaking up the protests. Maan said most of those killed Friday were hit in the head and heart.\n\nOfficials had said earlier there were attempts at \"sedition\" from snipers who targeted security and protesters alike. They didn't elaborate.\n\nLate Saturday, the prime minister announced a number of measures designed to appease the protesters, including paying out unemployment benefits and providing subsidized housing and land for low-income groups.\n\nStill, demonstrators took to the streets again Sunday— although in smaller numbers. Hundreds gathered on side streets near Sadr City, a Baghdad suburb, some four kilometers (2.5 miles) from Tahrir Square, which has been the destination of the weeklong rallies, although authorities have prevented protesters from reaching it.\n\nA medical official in a local hospital and a security official said 12 protesters were killed and more than 50 others wounded as they repeatedly tried to break through a security cordon to head to the city center. The officials, who did not provide details, spoke on condition of anonymity because they were not authorized to speak to reporters.\n\nSecurity forces have beefed up their presence in central Baghdad, deploying as far as Sadr City to seal off Tahrir Square.\n\nArmy troops blocked a main road Sunday to prevent the protesters from advancing, then fired on them to push them back. After about an hour, there was more intense gunfire, with soldiers firing over the heads of protesters as they tried to advance.\n\nDucking in reaction to the fire, some protesters piled over one another trying to hide behind the wall of a nearby water fountain. One protester carrying a drum chanted \"peaceful, peaceful,\" as others joined in. As the gunfire continued, protesters set tires on fire.\n\nSome demonstrators arrived in rickshaws, which have been used to carry the wounded from the bloody clashes.\n\nThe U.N. envoy for Iraq appealed for an end to the violence and called for holding to account those responsible. \"This must stop. I call on all parties to pause and reflect,\" Jeanine Hennis-Plasschaert tweeted Saturday night.\n\nMeanwhile, Abdul-Mahdi pledged to meet with the demonstrators to hear their demands.\n\n\"I am ready to go wherever our brotherly protesters are and meet them or send them envoys to other locations without any armed forces,\" he said late Saturday. \"I will go and meet them without weapons and sit with them for hours to listen to their demands.\"\n\nHe also decreed that those killed in the protests, whether demonstrators or security forces, would be considered \"martyrs\" eligible for state benefits.\n\nEarlier on Sunday, Baghdad's streets had been mostly quiet and traffic thin as an eerie calm prevailed. Students made it to schools and government employees returned to work. But burnt tires and debris littered thoroughfares while security remained heavily deployed in many neighborhoods.\n\nAtheer Assem, a pizza restaurant owner, said he was able to shop Sunday, the start of the working week, for ingredients for his baked goods. But he said his clients have stopped coming to his shop because of the violence, even though it is in a neighborhood that has not witnessed any protests.\n\n\"The protests are making people afraid to go out,\" he said, estimating his sales to have dropped by 70 percent.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/WireAP_b73c3203355841d3a532ecb63c6b69bc_16x9_992.jpg", "published_at": "2019-10-07"}