{"pub": "atlantic", "url": "https://theatlantic.com/ideas/archive/2019/10/trump-wants-raise-cost-holding-him-account/599278", "downloaded_at": "2019-10-03 07:09:18.873808+00:00", "published_at": "2019-10-02", "title": "Why Trump Is Firing Off a Barrage of Threats", "language": "en", "text": "“I want to know who’s the person that gave the whistle-blower—who’s the person that gave the whistle-blower the information, because that’s close to a spy,” the president said. “You know what we used to do in the old days when we were smart? Right? With spies and treason, right? We used to handle them a little differently than we do now.”\n\nOn Sunday, he demanded to “meet not only my accuser” but also others who “illegally” gave information on his calls to that person. This is a perversion of the whistle-blower process, which is a legal process—contrary to Trump’s accusations of law-breaking—and which is designed to shield people with damaging information from intimidation and retaliation. On Monday, Trump said, “We’re trying to find out about a whistle-blower.”\n\nTrump and his allies, both those on his staff and those in the media, have also gone on the offensive against Congress. The foremost target of this has been Schiff, the California Democrat who is the chair of the House Intelligence Committee. At the start of last week’s testimony from Acting Director of National Intelligence Joseph Maguire, Schiff delivered a slightly exaggerated paraphrase of Trump’s July 25 call with Ukrainian President Volodymyr Zelensky.\n\nSince then, Trump has repeatedly attacked Schiff on Twitter and in remarks. “Rep. Adam Schiff fraudulently read to Congress, with millions of people watching, a version of my conversation with the President of Ukraine that doesn’t exist.” “Adam Schiff therefore lied to Congress and attempted to defraud the American Public.” “I want Schiff questioned at the highest level for Fraud & Treason.” “Rep. Adam Schiff illegally made up a FAKE & terrible statement, pretended it to be mine as the most important part of my call to the Ukrainian President, and read it aloud to Congress and the American people. It bore NO relationship to what I said on the call. Arrest for Treason?” “Why isn’t Congressman Adam Schiff being brought up on charges for fraudulently making up a statement and reading it to Congress as if this statement, which was very dishonest and bad for me, was directly made by the President of the United States?” “Congressman Adam Schiff should resign.” Etcetera.\n\nThis is absurd. First, Schiff was joking, though his joke was ill-advised; he acknowledged in the same hearing that the remarks were intended as satirical. Besides, the transcript was released publicly for anyone who wanted to read it. Even if Schiff had been attempting to pass the paraphrase off as genuine, it’s not “fraud” or illegal to do so, and remarks by members of Congress are broadly protected under the Constitution’s speech-and-debate clause. Although Trump has labeled any number of things he doesn’t like as treason, it should go without saying that none of this rises anywhere near betraying the country. That’s just as well for the president, because if making up elaborate lies were treasonous, he’d be locked up in a brig right now.", "description": "The president’s new strategy for fighting impeachment? Raise the cost of the proceedings higher than Democrats are willing to pay.", "authors": ["David A. Graham", "Staff Writer At"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/RTS2NGVB/facebook.jpg?1570045797"}