{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/reduce-distractions-with-a-customized-do-not-disturb-response", "downloaded_at": "2019-10-13 00:17:24.031510+00:00", "title": "Reduce Distractions With A Customised 'Do Not Disturb' Response", "language": "en", "text": "Image: Shutterstock\n\nFun fact: you don’t have to be driving to take advantage of your smartphone’s Do Not Disturb While Driving feature. You can activate it whenever you want to go device-free — and you can customise the auto-responder so it tells people why you aren’t available and when you’ll respond to their texts or calls.\n\nThink of it like an out-of-office email, but for your phone.\n\nBehavioural design expert Nir Eyal explains the trick in his new book Indistractable: How to Control Your Attention and Choose Your Life. He suggests the following customised message:\n\nHi! This is an automated reply to let you know I’m indistractable at the moment. I will not see your message right away but I’ll get back to you shortly. (I’m not receiving notifications. If this is urgent, reply “urgent” to send a notification through with your original message.)\n\nIf you are using an iPhone, there are still ways for people to reach you in an emergency — they can reply “urgent” as noted above, or call your phone twice in a row.\n\nI’ve been looking for this kind of hack, because my current method of remaining “indistractable” while working has been to keep my phone on silent and turn it face-down—but then I worry that I might miss an emergency call from my parents, who live nearby.\n\nI could set my phone to Do Not Disturb full time, which would still let me receive twice-in-a-row calls from my family, but I like the idea of creating a customised message that can be tweaked to different kinds of situations. (“I’m at work,” I’m on annual leave,” “I’m taking a phone-free day,” etc.) I’m of the generation who grew up with the AIM away message, so I’m already thinking of how I could have a little fun with this.\n\nIt’s also like setting up one of those, what did they used to be called?—answering machines. A socially acceptable way to let people know that you can’t get back to them right now, but will check your messages later.\n\nIf you want to know how to activate and update the DND While Driving auto-responder on your own phone, we’ve got the step-by-step here.\n\nAdd An Auto-Responder To Do Not Disturb iOS: Apple's iOS recently joined Android in offering a \"Do Not Disturb While Driving\" mode. Unlike the normal iOS \"Do Not Disturb\", this mode also lets you auto-respond to anyone who texts. And you can activate it any time, not just when you're driving. Read more\n\nAnd yes, I’m adding “set up a customised DND While Driving message” to my to-do list for this afternoon.\n\nHow about you?", "description": "Fun fact: you don’t have to be driving to take advantage of your smartphone’s Do Not Disturb While Driving feature. You can activate it whenever you want to go device-free — and you can customise the auto-responder so it tells people why you aren’t available and when you’ll respond to their texts or calls....", "authors": ["Chris Jager"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/vinoozsnc9fvhrhep09f.jpg", "published_at": "2019-10-13"}