{"pub": "theverge", "url": "https://theverge.com/2019/9/5/20850693/samsung-galaxy-fold-hands-on-ifa-2019-fixed-display-hinge", "downloaded_at": "2019-10-05 14:45:01.951131+00:00", "title": "How Samsung fixed the Galaxy Fold", "language": "en", "text": "Back in April, we reviewed the Galaxy Fold, and things didn’t go according to plan. We experienced issues with the review unit’s display that appeared to be from debris getting through the hinge and damaging the screen. Other reviewers peeled off a protective film that was meant to be permanent, and it resulted in some major issues for Samsung. After a delay to the release of the $1,980 device, Samsung is back at IFA in Berlin this week with a fixed version that’s sturdier and has made improvements to the hinge mechanism. I got a chance to see exactly what Samsung has changed over the past several months.\n\nYou need to look closely at the updated Galaxy Fold to spot what’s new, but there are some key changes in a variety of areas. The biggest update is that Samsung has now extended the protective film to under the bezels of the device so you can no longer peel it off. I tried to peel it off multiple times and failed, as it’s beyond the bezel and impossible to get your fingernails close to. We’ll need to test this fully, but I’m confident that Samsung has addressed this particular problem.\n\nMost of the other changes are related to the hinge. It feels a little sturdier than before, and the gaps where the hinge meets the display have been trimmed down. Even the gap when the device is closed has been shrunk slightly, which should add up to less debris getting close to the hinge or displays.\n\nVisually, the other big change is that the display now has plastic protection caps at the bottom and top that further block debris from getting underneath it. These are noticeable when you unfold the device, but they should hopefully help stop dirt from getting in the hinge and causing issues. I didn’t have enough time to throw a bunch of dirt and dust at the device, so it’s hard to say whether Samsung has fixed this particular issue, but it’s clear that a lot of work has been done here.\n\nSamsung has also added layers of metal underneath the display to make it feel sturdier, particularly when you touch and interact with the display. This is less noticeable by itself, but when you combine it with the hinge changes, it certainly comes off like a more polished device overall. Other than these hinge and display changes, the device is the same on the inside as it was back in April: it has a Snapdragon 855 processor, 12GB of RAM, and 512GB of storage.\n\nI was surprised that Samsung has done very little on the software side, though. You can now change the Android navigation bar to align it on the left, right, or center of the display, but other than that, little else is new. I was hoping to see more clever ways to make use of the 7.3-inch display or even the smaller 4.6-inch cover display. There are a bunch of multiscreen options from Samsung’s own Android software, but Google, Samsung, and developers are still going to have to figure out how to best adapt Android to make it work better on these emerging dual-screen and foldable devices.\n\nWe’ll be re-reviewing this updated Galaxy Fold soon, but I’m still excited by foldable and dual-screen devices. Samsung proved back in April that this hardware is really early, but it’s exciting that the company is still pushing ahead with this device and trying to make foldable phones a reality. You can laugh at the giant bezels on the display at the front, the main plastic display, or just how thick this device is, but it represents progress. It’s early and probably not worth almost $2,000. But if Samsung and others keep at it, then perhaps in a few years, we’ll all be folding our phones into our pockets and remembering the good old days when a phone used to look like a regular phone.\n\nPhotography by Tom Warren / The Verge", "description": "Samsung has fixed the hinge and display issues on its Galaxy Fold. Back in April, the devices failed for multiple reviewers, and Samsung has made some key hardware changes to the protective film and hinge that should prevent dust and debris from damaging the display.", "authors": ["Tom Warren", "Sep"], "top_image": "https://cdn.vox-cdn.com/thumbor/SNUFjnc0bLRoZW1n1kACh01yccY=/0x142:2040x1210/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19170004/VLS_2824.jpg", "published_at": "2019-09-05"}