{"pub": "investing.com", "url": "https://au.investing.com/news/forex-news/australia-nz-dlrs-in-tight-ranges-ahead-of-key-data-fed-rate-outcome-1958493", "downloaded_at": "2019-09-18 05:15:42.685541+00:00", "title": "Australia, NZ dlrs in tight ranges ahead of key data, Fed rate outcome", "language": "en", "text": "© Reuters. Australia, NZ dlrs in tight ranges ahead of key data, Fed rate outcome\n\nBy Swati Pandey\n\nSYDNEY, Sept 18 (Reuters) - The Australian and New Zealand dollars on Wednesday came back up from recent lows against the greenback, though trading was light ahead of key economic data in both countries and an expected U.S. interest rate cut.\n\nThe Australian dollar AUD=D4 was off 0.18% at $0.6851, slightly higher than a seven-day low of $0.6830 touched in the previous session.\n\nThe New Zealand dollar was down 0.2% at $0.6342 at 0200 GMT after hitting a two-week low of $0.6321 on Tuesday.\n\nInvestors are focused on Australia's August employment data due at 0130 GMT Thursday, which is likely to show the jobless rate rose to 5.3% from 5.2% in July, much higher than the central bank's goal of 4.5%.\n\nA higher number would bolster the case for a rate cut as soon as October. 0#YIB:\n\nIn New Zealand, figures on the country's economic output, also due Thursday, will likely show second-quarter gross domestic product slowed to 2% from a year ago, which would be the weakest pace since 2013. central banks in both countries have adopted an easing bias after recently slashing rates to record lows of 1%. Both have shown openness to move again if needed, signals that have put downward pressure on their currencies.\n\nInvestor attention will also be on a rate decision by the U.S. Federal Reserve, which is all but certain to ease policy to 1.75% to 2% to help offset some of the impact from the country's ongoing trade war with China.\n\nMarkets will focus on any indications about future policy, especially after Fed chair Jerome Powell had described the last cut in July as a \"mid-cycle adjustment.\"\n\nSome analysts believe it may be the last rate cut for a while unless there is more evidence of a U.S. economic slowdown.\n\n\"A 25 bps cut is well priced in, so in the absence of any surprise in the rate move investors will be looking at the message in the statement and subsequent press conference,\" said Nick Twidale, co-founder of Sydney-based trade finance provider X-chainge.\n\n\"The risk probably sits once again with a hawkish cut and if this comes to fruition, then expect stock markets to take a hit along with risk trades overall.\"\n\nOvernight, the dollar was also weighed down by a fall in oil prices and a stronger euro. FRX/\n\nNew Zealand government bonds 0#NZTSY= were slightly up, with yields down 1-2 basis points across the curve.\n\nAustralian government bond futures were little changed, with the three-year bond contract YTTc1 flat at 99.175. The 10-year contract YTCc1 was off 1.5 ticks at 98.855.", "description": "Australia, NZ dlrs in tight ranges ahead of key data, Fed rate outcome", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEABB008_L.jpg", "published_at": "2019-09-18"}