{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7569665/Kane-Brown-mourns-longtime-drummer-Kenny-Dixon-following-tragic-death-car-accident.html", "downloaded_at": "2019-10-14 03:48:41.541362+00:00", "title": "Kane Brown mourns longtime drummer Kenny Dixon following his tragic death in car accident", "language": "en", "text": "Kenny Dixon, who played the drums for country artist Kane Brown, died in a car accident Saturday, his band said.\n\nBrown, 25, took to social media to mourn his colleague in the wake of the tragedy.\n\n'Love you so much dude!!!' the Nashville wrote. 'You started all of this with me from the start in 2015 when no body else believed we would make it out of Chattanooga playing for 500 people and your last show was in a Fn Stadium my guy.'\n\nThe latest: Kenny Dixon (L), who played the drums for Kane Brown (R), died in a car accident Saturday, his band said\n\nThe One Thing Right artist added, 'I know u will be watching over us with that red neck accent that we all love and you will never be replaced bro!!! I promise u that!!'\n\nSarah Hendrick, who was engaged to the musician and shared a son named Levi with him, said in an Instagram post that she was 'at a loss of words' amid the tragic time.\n\n'I don't even know how to write this or ever thought I would have to,' said Dixon's fiancee, who was slated to exchange vows with him in his native Dalton, Georgia next month, according to their wedding site on The Knot.\n\nHendrick continued: 'Kenny passed away last night in a car accident. I know I have to be strong for Levi and God is gonna pull us through this. We have a forever guardian angel watching above us now. Please keep Levi, my family, and Kenny's family in your prayers.'\n\nHeartbreaking: Hendrick was slated to exchange vows with Dixon in his native Dalton, Georgia next month\n\nSad: Hendrick said on social media, 'We have a forever guardian angel watching above us now'\n\nBrown's band confirmed his death in a statement, WSB-TV Atlanta reported .\n\n'It is with profound sadness and disbelief that we confirm we lost our drummer Kenny this weekend in a tragic car accident,' the band told the station. 'He was truly one of the greatest and kindest people on and off stage we've ever known.'\n\nIt was not immediately clear where the fatal accident took place.\n\nOn the job: Brown and Dixon were seen playing at the CMT Awards in Nashville in June", "description": "Sarah Hendrick, who was engaged to the musician and shared a son named Levi with him, said in an Instagram post that she was 'at a loss of words' amid the tragic time.", "authors": ["Adam S. Levy For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/03/19674276-0-image-a-50_1571020328831.jpg", "published_at": "2019-10-14"}