{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Wellness/recovery-cardio-taking-time-taking-fitness/story?id=65078988", "downloaded_at": "2019-09-03 23:42:43.756295+00:00", "title": "Is recovery the new cardio? How taking time for yourself is taking over fitness", "language": "en", "published_at": "2019-09-03", "text": "Five to six times a week, Danielle O’Brien, a 32-year-old nutritionist in New York City, hits the gym or a boutique fitness studio for a workout.\n\nSounds typical, but on top of those workouts, O’Brien adds into her workout schedule an of-the-moment trend in the fitness world: recovery.\n\nShe invests nearly $400 a month in a membership at ReCOVER, which bills itself as New York City’s first dedicated recovery studio. The studio also offers a la carte treatments that range in price from $25 to $130.\n\n“I tend to get achy legs and get pretty sore and tired so it appealed to me as a way to reset both physically and mentally,” O’Brien told “Good Morning America.” “I had accepted a state of, ‘My legs are constantly tired and I feel fatigued.’”\n\nO’Brien now incorporates into her weekly fitness schedule sometimes twice-daily sessions at ReCOVER, doing everything from sitting in an infrared sauna to resting in what almost looks like a spaceship but is actually a CVAC (Cyclic Variations in Adaptive Conditioning) system that fluctuates atmospheric pressure.\n\nDanielle OBrien\n\nShe also uses the studio’s NormaTec Air Compression sleeves, which look like another prop from the space age but actually “deliver a rhythmic air massage to help mobilize fluid in different parts of your body,” according to ReCOVER’s website.\n\n“I notice a big difference in my energy level, and if I’m not doing [recovery], soreness will accumulate and I’m more mentally exhausted,” said O’Brien. “I think part of the reason people feel o much better physically is because recovery is meditative in a way too.”\n\nRecovering from a workout is something that seems intuitive but has actually taken a back seat for many exercisers infatuated with the thrill of intense workouts like spinning, CrossFit and high intensity interval training (HIIT). Now, as those workouts catch up with people's bodies, recovery is taking center stage, experts say.\n\n\"In the 90s and 2000s there was a trend of, 'Oh you need to work out more,'\" said Kamraan Husain, a chiropractor and the director of sports medicine at Tone House, a New York City-based boutique fitness chain. \"It’s no surprise that 20 years later now people see they need to recover. They go hand in hand.\"\n\nTone House is known for its grueling workouts. As its popularity has increased, it created its own in-house recovery program, led by Husain. He focuses on making recovery accessible because it's something everyone needs in their lives, he said.\n\n\"As long as gravity is weighing down on us we are obligated to do recovery,\" he said. \"Society is finally now coming to awareness that recovery is important.\"\n\nWhile boutique fitness studios like Tone House are adding recovery to their programming, other fitness companies are taking a page from their playbooks by franchising recovery and making it a whole experience for customers.\n\nIn 2017, Xponential Fitness, the parent company of fitness brands including Pure Barre and CycleBar, added its first recovery-focused brand to its repertoire, StretchLab, which, as its name implies, offers one-on-one stretching in a group fitness setting. The company expects to have 100 StretchLab locations across the U.S. by the end of the year, according to Lou DeFrancisco, president of StretchLab.\n\n\"We knew that boutique fitness wasn’t going anywhere,\" DeFrancisco said of why Xponential Fitness invested in StretchLab. \"But people are getting their workouts in all great shapes and forms and then waking up and being sore or not able to move.\"\n\nA typical StretchLab customer comes in once or twice a week for an appointment to be stretched with a trained professional the brand calls a \"flexologist,\" according to DeFrancisco. The company offers drop-in sessions as well as membership that range in price from $149 to $500 per month.\n\nHow much recovery is enough recovery?\n\nWhen you don't take time off from working out -- or even time off from the busyness of life -- your body never goes into the anabolic phase, where muscles repair themselves and grow, according to Daniel Giordano, co-founder and director of physical therapy at Bespoke Treatments in New York City.\n\n\"The biggest thing is people don’t allow that [phase] to happen,\" he said. \"Everyone is in the go-go-go phase where you in fact have to relax and let your body recover.\"\n\nThe good news for people overwhelmed by the sheer number, and cost, of recovery options available is that one day off a week is sufficient recovery for most people, according to Giordano.\n\n\"People work out too much which leads to people trying to find a quick fix when in reality you just need to rest,\" he said. \"If you’re working out six days a week that’s fine, you just always need one day of rest.\"\n\nThe biggest key to proper recovery is to make it part of your lifestyle, including eating well, sleeping well and drinking enough water, according to Giordano.\n\n\"People want to do quick fixes and trends and it’s not really about that,\" Giordano said. \"You have to make it more of a lifestyle so it positively impacts both sides of your life, both inside the gym and outside the gym.\"\n\nHusain, of Tone House, recommends spending a minimum of 10 minutes every day of body work, which can mean dynamic movements, stretching and even working out.\n\nEspecially for people who sit all day at a desk, getting blood flowing in the body is critical to helping your body recover, according to Husain.\n\n\"Just move a little more, taking the stairs, walking more around the office, doing more stretches to open the hips,\" he said. \"Think about the small changes you can make every day to improve your health.\"\n\nWhen it comes to nutrition to promote recovery, Giordano recommends keeping it simple by focusing on eating protein and vegetables and staying away from products high in sugar.\n\nThe post-workout meal that everyone buzzes about is a good idea, he says, but you don't need to stress about chugging a protein drink right after.\n\n\"Get some protein in, some carbohydrates and water to build energy and tissue growth, said Giordano. \"If you can get it in 90 minutes later instead of the first 30 minutes [after a workout], that’s OK.\"\n\nBoth Giordano and Husain employ the same philosophy when it comes to pricey recovery products on the market now that can retail for hundreds of dollars.\n\n\"There are other ways to accomplish it, but if the product means you’re going to actually do the recovery, then I 100% advocate for purchasing a tool,\" said Husain. \"If you can’t afford it, go get a [tennis or massage] ball and do some body work.\"\n\nGiordano prescribes a short yoga flow at the end of a workout or in the office for recovery, some dynamic stretching and perhaps the best-known recovery tool, the foam roller.\n\n\"Do 15 to 30 seconds per muscle group before you work out and after you work out, do 30 to 90 seconds per muscle group that you’ve worked,\" said Giordano. \"You’re facilitating blood flow and that helps speed up your recovery.\"\n\nWatch below for a foam rolling 101 video from Giordano's Bespoke Treatments.", "description": "", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/recover-2-ht-er-190826_hpMain_16x9_992.jpg"}