{"pub": "yahoo", "url": "https://news.yahoo.com/serial-killers-myra-hindley-and-rose-west-had-affair-in-prison-solicitor-claims-121538208.html", "downloaded_at": "2019-10-20 13:29:34.202130+00:00", "title": "Serial killers Myra Hindley and Rose West had affair in prison, solicitor claims", "language": "en", "text": "Notorious serial killers Rose West and Myra Hindley were lovers in prison, according to one of their former solicitors.\n\nWest’s ex-lawyer Leo Goatley claimed his client fell for the Moors murderer in 1995 after they were both locked up in the hospital wing of Durham prison.\n\nHe said the women dated each other for a few months before West ended the relationship because Hindley was too “dangerous”, the Daily Mail reported.\n\n\"I recall that Rose was quite taken with Hindley, impressed by her knowledge and ability,” Mr Goatley wrote in his new book 'Understanding Fred & Rose West’.\n\nMyra Hindley (L) and Rose West apparently had an affair in prison (Picture: Getty) More\n\nHe added: “Rose said Hindley had studied various Open University courses.”\n\n\"She said, 'Yeah, Myra, she's all right, we get on, I want to see how it goes'. This was a reference to a flowering, albeit short-lived, lesbian relationship.\"\n\nIan Brady who was convicted of the Moors murders of five children together with accomplice Myra Hindley in the Greater Manchester area of England (Picture: PA) More\n\nBut the romance did not last, with Mr Goatley writing: \"When I visited a few months later, Rose's opinion of Hindley had changed dramatically.\n\n“She was saying, 'You have to watch Hindley, mind. She is very manipulative.'\"\n\nREAD MORE YAHOO NEWS HERE\n\nMost wanted female criminals revealed by Europol\n\nHuman bones found at building site in Leicestershire\n\nDad who raped daughter over two decades and fathered 'at least' six children with her jailed for 40 years\n\nMr Goatley represented West in her in a trial in 1995 where she was accused of murdering ten people in Cromwell St, Gloucester, along with her husband Fred West.\n\nShe crossed paths with Hindley, who had been locked up in 1966 after committing several killings with lover Ian Brady, soon after she was jailed the following year.\n\nThe revelations about West’s fling with Hindley was one of the numerous allegations made in his Mr Goatley’s new book, which is set to be released 25 years after Fred West killed himself in prison.\n\nFred West killed himself in prison (Picture: PA) More", "description": "West eventually dumped Hindley because she was too \"dangerous\".", "authors": ["Jimmy Nsubuga"], "top_image": "https://s.yimg.com/uu/api/res/1.2/2AHJLjRQ1URTIqNl5vrBug--~B/aD0zODg7dz03MjA7c209MTthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/e2c199d0-f268-11e9-bee7-c34b8f6e096e", "published_at": "2019-10-19"}