{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7630561/Ayda-Field-admits-wants-fourth-child-teammate-baby-Coco.html", "downloaded_at": "2019-10-30 14:38:03.837498+00:00", "title": "Ayda Field wants a fourth child with Robbie Williams", "language": "en", "text": "Ayda Field has revealed she would like 'one more' baby as a 'teammate' for her youngest child.\n\nThe actress, 40, has daughter Teddy, seven, son Charlie, five, and baby girl Coco, 14 months, with husband Robbie Williams, 45, and said motherhood is by far her 'greatest pleasure' in life.\n\nSpeaking during her return to the Loose Women panel on Wednesday, Ayda joked that while she would like to expand her family further, Robbie would 'commit her and run away with Gary Barlow into the sunset' if they have more than four children.\n\nJust one more: Ayda Field has revealed she would like 'one more' baby as a 'teammate' for her youngest child (pictured with husband Robbie Williams in July)\n\nAsked if she's planning another baby, she said: 'I'd like to, [but] you never know whats going to happen in the world, will it work, will it not, where we are in our life.\n\n'I'd like one more, but after that I think Rob would commit me somewhere and run away with Gary Barlow into the sunset. Being a mum is my greatest pleasure.'\n\nAyda said it would be good for Coco - who was born via a surrogate - to have a 'teammate' close in age because her siblings are so much older.\n\nShe explained: 'The difference is because Teddy and Charlie were so close in age, they didn't dote on each other, they were more jealous.\n\nOpening up: The actress, 40, made her baby confession during her return to the Loose Women panel on Wednesday's show\n\nDoting: The mother-of-three has daughter Teddy, seven, son Charlie, five, and baby girl Coco, 14 months, with Robbie, 45, and said parenting is by far her 'greatest pleasure' in life\n\n'Whereas with Coco they want to feed her and play with her and show her things, she’s a living doll for them.\n\n'Sometimes I have to remind them she's my child and I'm in charge, but they're the best siblings. I think Coco will want a teammate to rally against her brother and sister, but they're such an amazing unit.'\n\nThe TV personality also discussed her ongoing battle with guilt as a working mother, admitting Teddy wasn't happy to see her return to the ITV1 daytime show.\n\nShe said: '[Teddy said] \"Mommy, I'm so used to you being here that when you go I'm like a flower and half my petals are gone\". I mean, owwwww. I almost broke down in tears when Teddy said that to me.'\n\nFingers crossed: Asked if she's planning another baby, she said: 'I'd like to, [but] you never know whats going to happen in the world, will it work, will it not, where we are in our life'\n\nJust one more: Ayda joked that while she would like to expand her family further, Robbie would 'commit her' if they have more than four children (pictured in December 2018)\n\nThe American-born star said she doesn't believe Robbie feels the same way about leaving their children to go to work and as a mother, she experiences an 'extra sense of guilt'.\n\nAyda added: 'They're used to me being there, so my absence is more marked. They're used to daddy going to work.\n\n'I just don't think Rob feels the same way when he goes to work. He doesn't have the same thing.\n\n'When he's on the plane he feels a sense of duty, whereas with me I feel like, \"Why am I doing this? I'm so selfish\".\n\nBaby of the bunch: The former X Factor judge said it would be good for Coco - who was born via a surrogate - to have a 'teammate' close in age because her siblings are so much older\n\nShe's back! The TV personality appeared on Wednesday's panel alongside (L-R) Coleen Nolan, Brenda Edwards and Jane Moore\n\n'They kind of expect daddy to leave, but you question yourself as a mum, you feel this extra sense of guilt.'\n\nThe former X Factor judge also shared a glimpse into the family's home life, revealing although she is married to one of the UK's biggest music stars, she still has to remind her husband to clear up after himself.\n\n'I never get petty with him, but when I get angry I have to talk to myself,' Ayda said. 'Why the pee on the toilet or on the floor? Why put the dirty clothes next to the hamper and not in it?\n\n'I still step in pee and his clothes are still on the floor... Rob is not tidy!'\n\n'I don't think Rob feels the same way': Ayda also discussed her ongoing battle with guilt as a working mother, admitting Teddy wasn't happy to see her return to the ITV1 daytime show\n\nHappy couple: Ayda and Robbie met when he was living in Los Angeles in 2006 and married at the Angels hitmaker's home in Beverly Hills in August 2010 (pictured in October 2018)\n\nAyda and Robbie met when he was living in Los Angeles in the summer of 2006.\n\nThe couple got engaged over Christmas in 2009 and married at the Angels hitmaker's home in Beverly Hills in August 2010.\n\nTheodora Rose, known as Teddy, came into the world in September 2012, followed by Charlton Valentine, aka Charlie, in October 2014.\n\nAyda and Robbie welcomed their third child, Colette Josephine, known as Colette, via a surrogate in September 2018.\n\nA-list couple: While Ayda made her Loose Women return, Robbie was busy promoting his new album during a series of radio appearances in central London", "description": "The actress, 40, has  daughter Teddy, seven, son Charlie, five, and baby girl Coco, 14 months, with husband Robbie Williams, 45, and said motherhood is her 'greatest pleasure' in life.", "authors": ["Louise Saunders For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/14/20378626-0-image-a-61_1572444360290.jpg", "published_at": "2019-10-30"}