{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7552591/Three-lifeguards-Whitlam-Leisure-Centre-talking-Harry-Nguyen-drowned.html", "downloaded_at": "2019-10-09 02:46:08.077821+00:00", "title": "Three lifeguards at Whitlam Leisure Centre were talking to each other while Harry Nguyen drowned", "language": "en", "text": "A boy who drowned after flailing around in a 1.8 metre deep swimming pool for two minutes could have been saved if the three lifeguards on duty were not chatting to each other.\n\nHarry Nguyen was not a strong swimmer and was struggling to make his way across the 50 metre pool at Whitlam Leisure Centre, in western Sydney, on March 20, 2016.\n\nThe 13-year-old was 'bobbing and waving his arms' as he struggled to reach the pools edge as the lifeguards spoke amongst themselves, Daily Telegraph reported.\n\nHarry Nguyen (pictured) was not a strong swimmer and was struggling to make his way across the 50 metre pool at Whitlam Leisure Centre, in western Sydney, on March 20, 2016\n\nThe year 8 student was trying to get to the edge of the pool for two minutes before sinking for a further seven minutes, a Coroners Court inquest heard.\n\nLifeguard Pawel Walczak rescued and resuscitated him at 2.01pm before paramedics took over but due to sustained brain damage he did not survive.\n\n'The Whitlam Leisure Centre outdoor swimming pool...was not subject to adequate or proper supervision by the lifeguards on duty,' Deputy State Coroner Elaine Truscott said.\n\nShe also offered her condolences to Harry's family have been left devastated over their son and brother's death.\n\n'You will forever be dealing with the loss of your beautiful boy, Harry,' she said.\n\n'The Whitlam Leisure Centre outdoor swimming pool...was not subject to adequate or proper supervision by the lifeguards on duty,' Deputy State Coroner Elaine Truscott said (pictured the swimming pool)\n\nMs Truscott recommended policies to the YMCA NSW who manages the Whitlam Leisure Centre, in light of Harry's death.\n\nShe suggested an improvement of lifeguard supervision, weak swimmers to wear wristbands making it easier to know who needs to be watched over, and to hire a Royal Lifesaving Australia 'mystery shopper' to ensure lifeguards are doing their job correctly.\n\nThe Lesiure Centre has since introduced the the mystery shopper program in August and continue to work to implement much needed changes.", "description": "Harry Nguyen, 13, was not a strong swimmer and was struggling to make his way across the  50 metre pool at Whitlam Leisure Centre, in western Sydney, on March 20, 2016.", "authors": ["Sahar Mourad For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/03/19470886-0-image-a-25_1570586634248.jpg", "published_at": "2019-10-09"}