{"pub": "rt", "url": "https://rt.com/sport/470817-ufc-tampa-joanna-jedrzejczyk-defeats-waterson", "downloaded_at": "2019-10-13 04:58:08.696284+00:00", "title": "‘Bow down!’ Joanna Jedrzejczyk targets UFC strawweight crown after dominant win over Michelle Waterson", "language": "en", "text": "Polish destroyer Joanna Jedrzejczyk dominated a gutsy Michelle Waterson to claim a decision victory in their strawweight bout at UFC Tampa, before warning that she was coming for the title.\n\nThe build-up to the main event in Florida had seen rumors that Jedrzejczyk was struggling to make the weight limit, but she made the mark on Friday and did so again in the octagon on Saturday night.\n\nThe former strawweight champ produced a kicking masterclass as she landed more than 200 strikes in total during the bout, winning on all three scorecards at Amalie Arena, 50-45, 50-45 and 49-46.\n\nFan favorite Waterson was defeated but far from disgraced, showing characteristic heart and almost securing a submission with a rear-naked choke in the third round.\n\nWoah baby so close! Joanna come off with a vengeance! #UFCTampapic.twitter.com/RPqkmK2DTy — Champion Sports Productions (@ChampSportsProd) October 13, 2019\n\nBut it was former 115lbs queen Jedrzejczyk who was the dominant force as she improved her record to 16-3 on her return to the division in which she once defended her title five times.\n\nAfterwards the Pole, 32, vowed that she was coming for the belt now around the waist of China’s Zhang Weili.\n\n“Who’s the real queen? Bow down, bow down,” she said.\n\n\"Who is the real queen?\"@joannamma calls for the strawweight champ to \"bow down\" 👑 #UFCTampapic.twitter.com/vyrbOTeJD8 — ESPN MMA (@espnmma) October 13, 2019\n\nJedrzejczyk’s foot showed signs of heavy swelling in the final round, and the Pole said she had broken it amid the kicking barrage she directed at Waterson.\n\n“I got a broken foot in the end of the second round, beginning of the third. It was hard, but it was an honor to headline a show here in Tampa,” she said.\n\nZhang Weili vs. Joanna Jedrzejczyk is the fight to make. I'm all for it. #UFCTampa — Danny Segura (@dannyseguratv) October 13, 2019\n\nJoanna is still really really good, guys. — caposa (@Grabaka_Hitman) October 13, 2019\n\nIt was a comprehensive defeat for a blood-soaked Waterson, who saw her three-fight win streak snapped, and most likely any chance of a title tilt with it.\n\nThe 33-year-old American slipped to her seventh defeat in 24 fights as a professional, but did nothing to diminish her status as a firm fan favorite but never yielding in the face of the barrage from Jedrzejczyk.", "description": "Polish destroyer Joanna Jedrzejczyk dominated a gutsy Michelle Waterson to claim a decision victory in their strawweight bout at UFC Tampa, before warning that she was coming for the title.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5da2acb720302712cb413aa3.jpg", "published_at": "2019-10-13"}