{"pub": "yahoo", "title": "Residents, protesters converge on Mong Kok Police Station to vent anger at Hong Kong officers", "url": "https://news.yahoo.com/residents-protesters-converge-mong-kok-143236272.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:14:23.610243+00:00", "text": "This story is being published by POLITICO as part of a content partnership with the South China Morning Post. It first appeared on scmp.com on Sep. 1, 2019.\n\nA crowd of residents and protesters converged on Mong Kok Police Station on Monday evening, chanting slogans against the force in an escalation of anger against Hong Kong’s officers over clashes in an MTR station during the weekend .A 300-strong crowd gathered at the intersection of Prince Edward Road West and Nathan Road, with black-clad protesters spraying graffiti on a wall saying “every time police come, we destroy an MTR station” on a wall, while others chanted: “If we burn, you burn with us.”\n\nSome threw eggs at the police station and pointed laser beams, with officers later using a loudspeaker to warn people they were in an illegal assembly and appropriate force would be used to disperse them.\n\nThe tense scene followed a stand-off earlier near Tamar Park in Admiralty, as demonstrators occupied Lung Wo Road briefly after a rally that is part of a two-day citywide strike.\n\nThe movement was the second such widespread industrial action since the political crisis began in June. Protesters are calling for the full withdrawal of the now-shelved extradition bill and an independent inquiry into police handling of the demonstrations.Carol Ng Man-yee, head of the Confederation of Trade Unions which supported the Tamar Park rally, estimated that more than 29 sectors had participated in Monday’s strike, with over 40,000 attendees showing up at Tamar Park. Police had not revealed their count.\n\nNg could not give a figure on the total number of people across the city who went on strike on Monday. In the previous event in August, an estimated 350,000 people took part in the work boycott, with 290,000 attending seven rallies citywide.\n\nNg said Monday’s figures could not be compared to the previous strike because there was only one rally this time, but coupled with bad weather and the pervading sentiment of “white terror”, 40,000 was enough to send an important message to authorities that “Hongkongers do not want to give up”.\n\nRepresentatives from various sectors gave speeches on stage, including lawmaker and pro-democracy camp convenor Claudia Mo Man-ching, as well as ousted pro-independence lawmaker Sixtus Baggio Leung Chung-hang.\n\nAt around 6 p.m., some protesters in black were asked by police to leave and warned they were part of an illegal assembly. A crowd of about 100 then formed on nearby Lung Wo Road, a flashpoint for clashes on previous occasions. Some flashed laser pointers at police and on Central Barracks, a building of the People’s Liberation Army, despite calls from others to stop.\n\nThe stand-off prompted police to raise the red flag, warning of possible use of force, and some demonstrators were pepper-sprayed by officers during a brief confrontation.\n\nThe crowd eventually parted to both sides of Lung Wo Road, but protesters then proceeded to tamper with a traffic light to display the words “free Hong Kong”, and poked holes in water barricades.\n\nPolice once again warned the crowd to disperse.\n\nEarlier in the day, Yuen Hin, 25, a tutor who took the day off work, was among people who had gathered for the rally. He said he felt the local government no longer had the power to solve the growing crisis, and the problem centred on the structure of the Chinese Communist Party.\n\n“It is not a democracy, it is an authoritarian state,” he added.\n\nA secondary schoolteacher, surnamed Lo, 42, said she came after a half-day session at her school where senior students held a gathering at the morning’s opening assembly on campus.\n\n“I’m here to stand in solidarity with young people on the front lines,” she said.\n\nForm Six student Oscar Hong, 17, joined the rally at Tamar after classes. He said his school was pro-Beijing and when he tried to speak to a teacher about the city’s protests, he was dismissed. He said he was not worried about the ongoing protests affecting his examinations.\n\n“If Hong Kong is lost, then it’s useless for me to have good results,” Hong addHis views were echoed by a secondary school representative on stage at the park, who told the crowd: “I would much rather be playing ball now and I really want to go to university, but I am willing to retake my final year [and continue protesting] until [Chief Executive] Carrie Lam gives us a response.”", "description": "The tense scene followed a stand-off earlier near Tamar Park in Admiralty.", "authors": ["Scmp Staff"], "top_image": "https://s.yimg.com/uu/api/res/1.2/cK0zRUm6BXHxEq550gKtoA--~B/aD03NzM7dz0xMTYwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/politico_453/bc34d973288c8a8da9d187630bfcda10"}