{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7598573/Worlds-hair-bank-charges-men-2-500-freeze-cells-lab-bald.html", "downloaded_at": "2019-10-22 13:58:23.032912+00:00", "title": "World's first hair bank charges men £2,500 to freeze cells in a lab if they go bald", "language": "en", "text": "The world’s first hair bank has opened in Manchester, with the intention of making ‘hair loss a thing of the past’.\n\nMen will pay £2,500 to freeze a sample of their hair. Key cells will later be cloned in the lab and injected back into their scalps, with the aim of restoring the hairline of their youth.\n\nBut is a cure for baldness in sight — or is it a ‘hair-brained’ and expensive idea?\n\nSome 6.5 million British men have male-pattern baldness, in which a combination of genes and hormones leads to a gradual loss of hair from the forehead and crown.\n\nMen will pay £2,500 to freeze a sample of their hair. Key cells will later be cloned in the lab and injected back into their scalps (file image)\n\nAt the moment, their options are limited to medication, which can have side-effects, and hair transplants, which produce variable results.\n\nThe drug minoxidil (brand name Regaine) helps around two-thirds of patients, but potential side-effects range from an itchy scalp to a rapid heartbeat.\n\nFinasteride (brand name Propecia) helps around 80 per cent of men but, as Good Health reported earlier this year, has been linked to impotence, infertility and anxiety.\n\nCost is also an issue, with neither drug available on the NHS and continuous use necessary if any hair regrowth is to be maintained.\n\nHair transplants, meanwhile, cost around £7,000 and simply redistribute existing hair, which can lead to disappointing results — as singer Elton John recently related in the Mail.\n\nFurthermore, if recent research is to be believed, the need for a better treatment is more urgent than ever.\n\nEarlier this month, South Korean research linked baldness to air pollution for the first time; while in May, a widely reported survey by Chinese doctors found that some of their patients are starting to go bald 20 years earlier than their fathers because of stress, lack of sleep and poor diet.\n\nSo, could the hair bank be the answer? Since August, its medical director, hair transplant surgeon Bessam Farjo, has been taking samples of hair from men wishing to bank their locks as an ‘insurance policy’ for the future.\n\nAround 100 hairs, including their bulbous roots, are removed from an area measuring 7cm by 1cm at the back of the scalp in a 30-minute procedure under local anaesthetic.\n\nSome 6.5 million British men have male-pattern baldness, in which a combination of genes and hormones leads to a gradual loss of hair from the forehead and crown\n\nThese are frozen at minus 180c in a tissue bank until the man’s hair starts to thin.\n\nThey will then be thawed and tiny cells called dermal papillae extracted from their roots.\n\nFound in clumps at the base of a hair, the dermal papillae contain the ‘instruction book’ for growing new hair, issuing chemical signals that prompt the cells around them to produce hair.\n\nIn those genetically disposed to male-pattern baldness, a hormone called dihydrotestosterone (DHT) attacks the dermal papillae cells around the forehead and crown, meaning their numbers dwindle.\n\nOver time, the hairs produced become shorter and finer and, ultimately, the production of new hair stops altogether, leaving a characteristic ‘horseshoe’ of hair.\n\nAfter extracting the dermal papillae from the stored hairs — which are taken from the back of the scalp because these are resistant to DHT — the plan is to clone them by multiplying them in a dish with a cocktail of nutrients, before injecting them back into the parts of the scalp where hair is thinning.\n\nIt is hoped that, by boosting the numbers of dermal papillae, the new hairs they instruct will be thicker and more like those of a younger man.\n\nThe earlier a man freezes a sample of his hair, says Dr Farjo, the sooner the ‘clock will be stopped’ and the more youthful the result.\n\nYet, it isn’t known how long hair can be successfully frozen for.\n\nIn addition, many promising hair loss ‘cures’ have failed in the past — including one backed by Dr Farjo.\n\nDeveloped a decade ago by the Cambridge-based firm Intercytex, it also centred around multiplying and injecting dermal papillae.\n\nBut, while treated mice grew new hair, the method failed in men.\n\nHowever, more recent research from Durham University and Columbia University in the U.S. found that if the dish containing the dermal papillae is turned upside down as they grow in the lab, the cells clump together as they do on the scalp and are better able to trigger the growth of new hair.\n\nWhile Dr Farjo’s HairClone business has started banking samples, it doesn’t expect to treat its first patients until next year.\n\nTreatment will likely have to be repeated every few years and is expected to cost £3,000 to £7,000 each time, on top of the initial £2,500 fee that covers harvesting and the first year’s storage.\n\nMen will also have to pay a fee of around £100 for each additional year their hair is stored.\n\nInitially, the focus will be on thickening thinning hair, but it is hoped that, eventually, the cells can be used to treat fully bald heads. This would allow other hair loss conditions, such as alopecia areata, in which hair is lost in patches, to be treated. It is usually temporary and thought to be triggered by a rogue immune response, rather than DHT.\n\nThe Trichological Society says that, if successful, the treatment could provide a less invasive alternative to hair transplants, which can take up to nine hours.\n\nDr David Fenton, of the British Association of Dermatologists, sounds a note of caution, however. ‘The science is interesting and the research has been slowly progressing for many years,’ he says. ‘But, while it’s exciting from a research point of view, it is not yet a proven, safe and replicable therapy.’", "description": "The world's first hair bank has opened in Manchester which charges men £2,500 to freeze samples of their hair. The cells will later be cloned in a lab and injected back into their scalps to restore hairline.", "authors": ["Fiona Mcrae For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/00/20013368-0-image-a-15_1571702272841.jpg", "published_at": "2019-10-22"}