{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/5/mika-zibanejad-has-hat-trick-rangers-beat-senators", "downloaded_at": "2019-10-06 03:10:28.501277+00:00", "title": "Mika Zibanejad has hat trick, Rangers beat Senators 4-1", "language": "en", "text": "OTTAWA, Ontario (AP) - Mika Zibanejad had his third career hat trick and added an assist to help the New York Rangers beat the Ottawa Senators 4-1 on Saturday night.\n\nZibanejad, who was drafted sixth overall by the Senators in 2011, is only the second player in Rangers history to record eight points in the first two games of the season. On Thursday night, he had a goal and three assists in New York’s 6-4 home victory over Winnipeg.\n\nArtemi Panarin also scored for the Rangers, and Alexandar Georgiev stopped 31 shots.\n\nBrady Tkachuk scored for the Senators, and Craig Anderson made 26 saves.\n\nZibanejad opened the scoring on a power-play at 6:04 of the first period, and Tkachuk tied it midway through the period.\n\nZibanejad broke the tie at 9:53 of the second and made it 3-1 with a short-handed goal at 12:07. Zibanejad then set up Panarin’s power-play goal early in the third.\n\nNOTES: The Senators announced they will retire Chris Phillips’ No. 4 on Feb. 18. Phillips is the Senators‘ leader in games played at 1,179. He officially retired in 2016. He will join Daniel Alfredsson as the only other modern era players to have a number retired. … Ottawa defenseman Cody Goloubef and center Filip Chlapik were healthy scratches, as were New York centers Greg McKegg and Micheal Haley.\n\nUP NEXT\n\nRangers: Host Edmonton on Saturday night.\n\nSenators: Host St. Louis on Thursday night.\n\n___\n\nMore AP NHL: https://apnews.com/NHL and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Mika Zibanejad had his third career hat trick and added an assist to help the New York Rangers beat the Ottawa Senators 4-1 on Saturday night.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/05/rangers_senators_hockey_78491_c0-794-2789-2420_s1770x1032.jpg?64a61cc24e38d341488789cdebd120c156b6a0d0", "published_at": "2019-10-05"}