{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/education/education-department-threatens-funding-for-university-program-it-sees-as-biased/2019/09/19/321b5010-db04-11e9-bfb1-849887369476_story.html", "downloaded_at": "2019-09-19 23:07:08.040611+00:00", "title": "Education Department threatens funding for university program it sees as biased", "language": "en", "text": "The Education Department is threatening to withhold federal grant money from a Middle East studies program, saying it advances an ideological agenda and promotes a positive view of Islam while virtually ignoring Judaism, Christianity and other religions.\n\nThe agency ordered the Duke-UNC Consortium for Middle East Studies to revise its offerings or risk losing its $235,000 federal grant.\n\nConservatives have long accused universities of harboring anti-Semitic bias and have called for probes into course offerings. But critics in higher education accused the administration of politicizing colleges and universities and violating academic freedom with this latest action.\n\nThe letter, sent in August, was published this week in the Federal Register, and was seen as a move to put other universities on notice. It was not clear whether other programs have been asked to revise their offerings.\n\nThe action represents a rare case of the federal government weighing into the administration of an academic program, but is consistent with how Education Secretary Betsy DeVos and some of her senior aides have tried to reshape U.S. universities they say are ideologically skewed.\n\nIn his letter to university officials, Robert King, assistant secretary at the Education Department, said the program was sponsoring activities that are perhaps consistent with “general principles of academic freedom” but are “plainly unqualified for taxpayer support.”\n\nHe said that it was unclear how many students were studying foreign languages, which is a focus of the grant program, and that many of the topics studied were unrelated to the program’s purpose. He said there was an abundance of offerings on Iranian art and film without any explanation for how that related to the program’s goals.\n\nHe also charged that the program “appears to lack balance” by placing “considerable emphasis” on understanding positive aspects of Islam without any discussion of the positive aspects of Christianity, Judaism and other religions.\n\nHe gave university officials until Sept. 22 to revise their program or risk losing its federal grant for the coming year.\n\nThe Duke-UNC Consortium was founded in 2005 and seeks to bring people on both campuses together for scholarly and cultural events related to the Middle East and Muslim communities around the world.\n\nA spokesperson for the University of North Carolina said in a statement that the consortium “deeply values its partnership with the Department of Education and has always been strongly committed to complying” with Title VI program rules. In keeping with the spirit of this partnership, the Consortium is committed to working with the Department to provide more information about its programs.”\n\nA Duke spokesman declined to comment. A spokeswoman for the Education Department did not reply to a request for comment.\n\nCritics said the agency was out of touch with academia and out of line.\n\n“Academic experts who actually know the region, speak the languages and are immersed in the issues are the ones who have a full understanding of the Middle East and the subjects students need to explore to achieve that understanding,” said Jay Smith, professor of history at the University of North Carolina at Chapel Hill and vice president of the school’s chapter of the American Association of University Professors. “This is political meddling in matters of academic substance. As such, it’s a clear threat to academic freedom.”\n\nLynn Pasquerella, president of the nonprofit Association of American Colleges and Universities, said it is the right and responsibility of the government to ensure that federal funds are being properly used. But, she said, the DeVos administration is wrong to say the courses mentioned in the letter don’t meet the standards.\n\n“I can’t think of anything more critical to meeting national security needs than encouraging students to engage in the type of cultural competence being taught in the courses that were outlined in the [department’s] letter,” she said.\n\nThe Education Department launched its investigation following a complaint from Rep. George Holding (R-N.C.) about a conference sponsored by the consortium on the conflict in Gaza. He wrote DeVos that constituents had told him that there was “severe anti-Israeli bias and anti-Semitic rhetoric at a taxpayer-funded conference.”\n\nOn Thursday, Holding welcomed the Education Department’s demands, saying its findings had painted a “deeply troubling picture.”\n\nKenneth Marcus, the assistant secretary for civil rights at the Education Department, has long criticized programs funded under the grant program as biased against Israel. In 2014, as president of the Louis D. Brandeis Center for Human Rights Under Law, he noted that Congress had directed that the programs reflect diverse perspectives and a range of views, but said that the provision was being ignored.\n\n“Taxpayer dollars are still being used to support biased and academically worthless programming on college campuses,” Marcus wrote.\n\nIn April, the Zionist Organization of America wrote Marcus requesting he look into whether the North Carolina program discriminated on the basis of religion. In June, his office opened an investigation into the universities.\n\nThe focus of the letter sent to university officials is Title VI grants, which fund programs that train students in foreign languages and international affairs to advance U.S. national security and economic interests. Together with a sister program, the government spends about $72 million per year to support about 100 national resource centers on world affairs and languages, among other things.\n\n.\n\nvalerie.strauss@washpost.com", "description": "The Duke-UNC Middle East studies program is accused of having an ideological agenda.", "authors": ["Laura Meckler", "Reporter Covering National Education Policy", "Trends", "The Education Department", "Valerie Strauss", "Reporter Covering Education", "Foreign Affairs", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/iR_tAawgSiYrcYqlEDwjODzScwI=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LCU5NSGYVEI6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-19"}