{"pub": "dailybeast", "url": "https://thewrap.com/newsmax-tv-hires-ex-fox-news-executive-to-serve-as-ceo", "downloaded_at": "2019-09-06 12:11:14.363382+00:00", "title": "Newsmax TV Hires Ex-Fox News Executive to Serve as CEO", "language": "en", "text": "Newsmax TV has hired former Fox News executive Michael Clemente to serve as CEO, the company announced on Monday.\n\n“Michael is one of the most accomplished executives and producers in television and digital news,” said Christopher Ruddy, CEO of Newsmax Media, Inc. in a statement. “He is widely respected in the industry and has won accolades for his high journalistic standards. It’s an honor for us to have him leading our team.”\n\nClemente, who once oversaw long-form programming at Fox News, was the first high profile executive to leave the channel after the company’s longtime president, Roger Ailes, departed the company. Media reports at the time attributed Clemente’s ouster not to sexual misconduct, but rather an internal power struggle between him and then network co-president Bill Shine.\n\nAlso Read: Billy Baldwin Drags Sean Hannity Over Past Comments Like 'All Gays Are AIDS Carriers'\n\nBefore Fox, Clemente spent nearly three decades at ABC News and also did a brief stint at CNN.\n\n“Newsmax has demonstrated the ability to adapt and thrive in the highly transformative digital news world, and was one of the first major online outlets to create a TV brand in cable,” said Clemente in the same press statement. “I’m excited to take on this new role at Newsmax during an incredible period of change, in a country eager for truth, understanding, and engagement in the news process.”\n\nClemente will be joining his old Fox News colleague Bill O’Reilly — who doesn’t officially work or Newsmax — who frequently appears on the channel to offer commentary.\n\nRuddy is known to have been close to President Trump and frequently appears on television to discuss the president’s mood on various matters. He raised eyebrows at the Financial Times Future of News conference last month when he casually told an audience that “the president is not a fact-based president. He’s a salesman.”", "description": "Michael Clemente was the first senior Fox News executive to leave the company after the departure of longtime president Roger Ailes", "authors": ["Jon Levine", "Brian Flood", "Scott Collins", "Ross A. Lincoln", "Margeaux Sippell"], "top_image": "https://www.thewrap.com/wp-content/uploads/2018/04/Screen-Shot-2018-04-09-at-3.20.39-PM.png", "published_at": "2018-04-09"}