{"pub": "metro", "url": "https://metro.co.uk/2019/10/05/james-bonds-daniel-craig-looks-like-man-mission-new-no-time-die-poster-10866854", "downloaded_at": "2019-10-05 22:58:20.983152+00:00", "title": "James Bond’s Daniel Craig looks like a man with a mission in new No Time To Die poster", "language": "en", "text": "No Time To Die will be Daniel Craig’s last stint at James Bond (Picture: Rex / Universal)\n\nA new poster for James Bond: No Time To Die has been released, and we are living for it.\n\nThe picture, unveiled to celebrate global James Bond Day, shows Daniel Craig looking all kinds of moody in his signature tux.\n\nHe can be seen gazing intensely at something in the distance, ahead of his last outing as 007.\n\nAnd we’re absolutely not ready to say goodbye.\n\nThe 51-year-old might not be quite ready to turn his back on the spy, after he made an emotional speech at the wrap party, while bidding goodbye to the team.\n\nAccording to reports, the dad-of-two made a drunken speech at the bash, telling director Barbara Broccoli and the gang just how much he would miss them all after filming came to an end in Italy, last month.\n\nA new No Time To Die poster has been unveiled (Picture: Universal)\n\n‘I just want to say, and I am really quite drunk now so I won’t go on for long, this has been the best, most wonderful experience I have ever had,’ he told the gang who were gathered in what appeared to be a restaurant.\n\nAdvertisement\n\nAdvertisement\n\n‘You have all done the most amazing job. I could not be more proud to work with every single one of you.\n\n‘I would like to thank you for this evening, for Barbara, for putting it on,’ he added in a clip shared to Twitter, filmed by a member of the gathering. ‘Thank goodness, we did this tonight.’\n\nThe cast and crew enjoyed a swanky dinner to celebrate the wrapping of the upcoming film in Matera, and they chowed down on a Bond-themed cake, just in case they didn’t get the movie memo.\n\nCillian Murphy has been linked to the Bond role (Picture: Getty)\n\nDaniel has been joined by a string of famous faces, including Rami Malek and Lashana Lynch in the upcoming instalment, with Naomie Harris and Lea Seydoux returning to the fold.\n\nAnd there has been intense speculation over just who would be stepping into his tux next – with Richard Madden, Idris Elba and Tom Hiddleston among those tipped for the role.\n\nCillian Murphy has also been included in the list, but suggested a woman should take on the role.\n\nSpeaking about the rumours, he told GQ: ‘It seems to be a way of generating business for bookies. ‘So someone who happens to be in a TV show and wears a tux occasionally in a TV show.\n\nAdvertisement\n\nAdvertisement\n\n‘Having said all of that, it’s incredibly flattering to be in that conversation.\n\n‘I think it should be a woman [next].’\n\nNo Time To Die is released in UK cinemas on 2 April, 2020.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Alan Sugar believes he is irreplaceable as he gives himself five more years on The Apprentice\n\nMORE: Strictly Come Dancing’s Dianne Buswell thanks fans and defends Dev Griffin after horror fall", "description": "A new poster for James Bond: No Time To Die has been released, and Daniel Craig looks very tense", "authors": ["Rishma Dosani"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/comp-1570278008_1570278539.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-05"}