{"pub": "yahoo", "url": "https://news.yahoo.com/killing-took-place-york-nicaragua-130056880.html", "downloaded_at": "2019-10-20 13:26:14.019792+00:00", "title": "Killing took place in New York, but Nicaragua hosts trial", "language": "en", "text": "This undated photo provided by Anderson's family shows Haley Anderson. A man accused of killing Anderson, a nursing student in upstate New York is being put on trial for the slaying in Nicaragua. Former Binghamton University student Orlando Tercero is accused of killing fellow student Anderson in 2018. The court proceeding is taking place in Managua, Nicaragua, with a Nicaraguan prosecutor and a Nicaraguan judge applying that country’s law. Witnesses have been testifying from Binghamton via streaming video. (Anderson's family/Broome County District Attorney's office via AP)\n\nBINGHAMTON, N.Y. (AP) — Witnesses have gathered in a small city in upstate New York over the past three weeks to testify in the trial of a man accused of strangling a young nursing student to death. But there is no jury, no American judge and the man accused is seated next to his defense attorney 2,200 miles (3,540 kilometers) away — in Nicaragua.\n\nIn an exceedingly rare legal proceeding, the trial of former Binghamton University student Orlando Tercero in the 2018 killing of 22-year-old Haley Anderson is being held at a court in Managua, Nicaragua, with a Nicaraguan prosecutor and a Nicaraguan judge applying Nicaraguan law.\n\nAmerican prosecutors have no authority over the trial, but the Broome County District Attorney's office in New York is deeply involved as a facilitator for witness testimony. The witnesses have testified, with the help of a translator, via a video link from a room in the district attorney's office in downtown Binghamton.\n\nAuthorities say Tercero, now 23, strangled Anderson at his off-campus residence in Binghamton in March 2018. Anderson, who was from Westbury on Long Island, was found dead in Tercero's bed. The two college students had a romantic relationship but Tercero wanted a more serious relationship, according to trial testimony.\n\nTercero killed Anderson and fled to Nicaragua, which rejected an extradition request from the U.S., according to authorities. Broome County District Attorney Steve Cornwell said the Nicaraguan trial may be the only way to get justice. Tercero is a dual citizen of the U.S. and Nicaragua.\n\n\"We have a duty and a responsibility to see this through whatever court process we can,\" Cornwell said.\n\nThe spectacle of a person being tried in another country under a foreign legal system for a killing that took place on U.S. soil is unusual, but not unprecedented.\n\nLast year, a Cuban man was tried, convicted and sentenced to 20 years under the Cuban legal system in the killing of a doctor in Florida. Unlike the New York case, a Palm Beach County investigator traveled to Cuba for Marcos Yanes Gutierrez's trial and testified in person for the court proceedings, said Florida assistant state attorney Aleathea McRoberts.\n\n\"The trial was very similar to our own system,\" said McRoberts, who also traveled for the trial.\n\nMcRoberts said allowing Gutierrez to evade punishment by simply fleeing to another country was \"unacceptable.\" There is still an American warrant for Gutierrez's arrest, but it is unlikely to ever be served because the U.S. cannot force him to be extradited, she said.\n\nMeanwhile, Tercero's trial began in Nicaragua earlier this month and has included two days of testimony so far. There is no jury and the verdict will be decided by a judge.\n\n\"We will argue against the proof,\" Tercero's defense attorney said, according to an interpreter, the Press & Sun-Bulletin reported earlier this month.\n\nDuring the latest day of testimony on Oct. 11, Tercero was clad in a blue prisoner's uniform, speaking with his lawyer from time to time and sometimes smiling silently. Three prison officers dressed in black stood behind them, carrying firearms.\n\nTercero's mother, Martha Moreno, also attended. When the judge called a recess, the defendant was allowed to approach Moreno. They hugged and held a whispered conversation.\n\nThat same day, in Binghamton, a police investigator testified via the video link that Tercero left a note saying he was sorry. Down the hall, Anderson's friends and supporters watched the bright and grainy livestream from a wood-paneled viewing room.\n\nLegal experts said Tercero could still be prosecuted for the killing under the American legal system, if he is ever extradited, even if he is acquitted in Nicaragua.\n\nThe trial comes just months after the Trump administration leveled sanctions against some Nicaraguan officials, including National Assembly President Gustavo Porras. The move was related to a violent crackdown on street demonstrations in the Central American country last year. At least 325 people died in the crackdown, according to the Inter-American Commission on Human Rights.\n\nBefore that round of sanctions, the U.S. had already imposed sanctions against Vice President Rosario Murillo — who is married to President Daniel Ortega — and other Nicaraguan officials.", "description": "Witnesses have gathered in a small city in upstate New York over the past three weeks to testify in the trial of a man accused of strangling a young nursing student to death.  In an exceedingly rare legal proceeding, the trial of former Binghamton University student Orlando Tercero in the 2018 killing", "authors": ["Ryan Tarinelli", "Gabriela Selser"], "top_image": "https://s.yimg.com/uu/api/res/1.2/gsAujRQ_x5GsXEtoozMioQ--~B/aD0xMTI1O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/ef1480895f478d8a6c2fdee22d6eb802", "published_at": "2019-10-20"}