{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/nick-knowles-says-jungle-can-20751718", "downloaded_at": "2019-10-30 00:07:59.621092+00:00", "title": "Nick Knowles admits I'm A Celeb jungle can be isolating and stars need to stick together", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest I'm a Celebrity stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nNick Knowles has revealed that the celebrity jungle can be isolating, having appeared on the show last year.\n\nThe TV personality, who placed sixth in 2018's I'm A Celebrity, spoke to the Mirror Online at the Pride of Britain Awards .\n\nHe gave some words of wisdom for the famous faces who are heading into the jungle next month.\n\n\"You’ve got to stick together and look after each other\", he said.\n\nTalking about the other celebs in his camp, which included winner Harry Redknapp, John Barrowman, Emily Atack and Sair Khan, he said \"everyone got on like a house on fire\".\n\n(Image: ITV/REX/Shutterstock)\n\n(Image: James Gourley/ITV/REX/Shutterstock)\n\n\"I still meet up with some of them and we still chat on the Whatsapp group\", he added.\n\n\"It’s just come back make sure you support and look after each other.\n\n\"You have to look out for people having a wobble, it can be isolating in there if you are not careful.\n\n\"All about the support.\"\n\n(Image: ITV/REX/Shutterstock)\n\nSome of the celebs rumoured to be heading in include Paul Hollywood's ex Summer Monteys-Fullam, Kate Garraway, Peter Crouch, Brendan Cole, and Olivia Attwood .\n\nNick also opened up about his life away from the cameras, revealing he is most content at home in the solitude of the Cotswolds countryside.\n\n\"Home life is good\", he said.\n\n\"I never talk or comment on my private life, but I am happy.\n\n(Image: Paul Poynter)\n\n\"Work is good, too.\n\n'I am happy bumbling along, I am living where I want to live in the world with a simpler life now.'\n\n\"I moved to a much smaller house and I got rid of 90% of my belongings that I never bothering to look at.'\n\n\"Yesterday is of no interest to me – what is happening tomorrow is.\"\n\n* The Daily Mirror Pride of Britain Awards, in partnership with TSB, will broadcast on ITV on 5th November at 8pm", "description": "EXCLUSIVE: Nick Knowles gave some words of wisdom for future I'm a Celeb contestants, and talked about still meeting up with his ex camp mates", "authors": ["Emmeline Saunders", "Verity Sulway", "Image", "Itv Rex Shutterstock", "James Gourley Itv Rex Shutterstock", "Paul Poynter"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20708505.ece/ALTERNATES/s1200/3_Nick-Knowles_.jpg", "published_at": "2019-10-29"}