{"pub": "breitbart", "url": "https://breitbart.com/news/teenager-petaia-sparkles-as-wallabies-rout-uruguay", "downloaded_at": "2019-10-05 12:25:35.062247+00:00", "title": "Teenager Petaia sparkles as Wallabies rout Uruguay", "language": "en", "text": "Oita (Japan) (AFP) – Teenage wing Jordan Petaia crashed over for a try on his debut as Australia rode out two yellow cards to rout Uruguay 45-10 and stay on course for the Rugby World Cup quarter-finals on Saturday.\n\nPetaia, Australia’s youngest ever World Cup player at 19, scored one try and made another, while Tevita Kuridrani and Dane Haylett-Petty bagged two each in the Wallabies’ total haul of seven.\n\nThe result produced a vital bonus point for the Wallabies to move ahead of Fiji after three games in Pool D, where Six Nations champions Wales remain unbeaten.\n\nBut continuing their theme of this World Cup, the Australians again suffered from disciplinary issues surrounding high tackles, and failed to find consistent rhythm in the first half.\n\n“I thought we were just a little bit off the pace at the start and that’s three times now, three games a little bit off the pace at the start,” said Australia coach Michael Cheika.\n\n“So I don’t know, I’ll have to get my pre-match speech a little bit better. We were reading the first half nicely but it looked like we were just a click away. And then we got the pace up in the second half.”\n\nBefore 34,000 mostly Australian supporters in Oita Stadium, Adam Coleman and Lukhan Salakaia-Loto both spent time in the sin-bin for dangerous tackles in the first period.\n\nFrench referee Mathieu Raynal also acknowledged high shots by Michael Hooper and Kurtley Beale although they escaped with a penalty only.\n\nIt was while Coleman was off the field that Petaia scored his try.\n\nAfter waiting 23 minutes for his first touch of the ball, he showed his class a minute later when came off his wing to take an inside pass and with a turn and twist he slipped through the defence to touch down.\n\nWhen Salakaia-Loto was sent to the sin-bin, and the Wallabies were again defending desperately, Petaia combined with Beale to brilliantly set Kuridrani away for their third try.\n\n– Tongan Thor –\n\nAt half-time, Australia led 19-3, before producing a more controlled second spell to add 26 more points until they conceded a late try.\n\nAfter their initial try to Dane Haylett-Petty in the opening few minutes, the Wallabies’ next two came from counter-attacks after being pinned inside their own half as Uruguay fought to stay in the tournament.\n\nBut the Tier Two side were unable to convert chances into points and despite lighting up the tournament by toppling Fiji in their first game, they now have no chance of making the play-offs.\n\nThe inclusion of Salakaia-Loto and Jack Dempsey to give Australia a bruising back-row presence had an immediate impact when they marched Uruguay back several metres in both a rolling maul from the first lineout and in the first scrum.\n\nBut the cohesion did not remain and the lighter Uruguayans managed to out-muscle the heavier Wallabies at times, and just on half-time Tomas Inciarte touched down from turnover ball — although the try was ruled out for an earlier offside.\n\nTaniela Tupou, known as the ‘Tongan Thor’, was introduced to the front row for the second half and the Wallabies immediately showed more stability as they laid the platform for Kuridrani to score the bonus-point try six minutes after the break.\n\nWill Genia scored two minutes after he took the field to replace Nic White at scrum-half before prop James Slipper barged over for his first try in 94 appearances.\n\nHaylett-Petty scored his second with 12 minutes remaining before the Wallabies went off the boil again and Uruguay backrower Manuel Diana forced his way over just before full-time.\n\n“I think in the first half we did a really good job. Second half, credit to Australia, they’re a big and fast side. We have to get better,” said Uruguay captain Andres Vilaseca.", "description": "Oita (Japan) (AFP) – Teenage wing Jordan Petaia crashed over for a try on his debut as Australia rode out two yellow cards to rout Uruguay 45-10 and", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/05/03e672_australia-wing-jordan-petaia-19-scored-try-on-his-debut-teenager-petaia-640x335.jpg", "published_at": "2019-10-05"}