{"pub": "reuters", "url": "https://af.reuters.com/article/worldNews/idAFKBN1WY08J", "downloaded_at": "2019-10-19 11:42:53.984281+00:00", "title": "Bernie Sanders to rally in New York in comeback from heart attack", "language": "en", "text": "FILE PHOTO: Democratic 2020 U.S. presidential candidate and U.S. Senator Bernie Sanders (I-VT) speaks at a campaign stop in Hooksett, New Hampshire, U.S., September 30, 2019. REUTERS/Brian Snyder/File Photo\n\nNEW YORK (Reuters) - U.S. presidential candidate Bernie Sanders will return to the campaign trail in New York City on Saturday, nearly three weeks after a heart attack that raised concerns about his viability in the Democratic race to pick a challenger to President Donald Trump.\n\nU.S. Representative Alexandria Ocasio-Cortez, one of the leaders of the party’s progressives and a frequent target of Trump attacks, will join the “Bernie’s Back” rally in Queensbridge Park and formally endorse Sanders for the White House, the campaign said.\n\nThe rally will be Sanders’ first event on the campaign trail since his heart attack on Oct. 1, when he had two stents inserted to open a blocked artery.\n\nThe heart attack threatened to derail the campaign of Sanders, 78, the oldest candidate in the crowded field seeking the Democratic nomination to face Trump in 2020. The U.S. senator cancelled campaign appearances and returned to his home in Burlington, Vermont, to recover.\n\nBut Sanders was back to participate in Tuesday night’s three-hour Democratic debate, and he has vowed to resume a full-tilt campaign pushing signature progressive issues such as a government-run healthcare programme and a tax on the wealth of the richest Americans.\n\nThe backing of Ocasio-Cortez, who represents a New York district near where Sanders will hold the rally, is expected to boost Sanders in his efforts to fight off fellow progressive White House candidate Elizabeth Warren, who has passed Sanders in opinion polls.\n\nSanders runs third behind Warren, a U.S. senator from Massachusetts, and former Vice President Joe Biden in most recent national polls, although Sanders raised more money for his campaign in the last quarter than any other Democrat.\n\nU.S. Representative Ilhan Omar of Minnesota, another member of a group of progressive first-term congresswomen known as “The Squad,” announced her endorsement of Sanders on Tuesday.\n\nA third member of the group, Rep. Rashida Tlaib, is also expected to endorse Sanders, and his campaign said Sanders would tour her Detroit district with Tlaib on Oct. 27.", "description": "U.S. presidential candidate Bernie Sanders will return to the campaign trail in New York City on Saturday, nearly three weeks after a heart attack that raised concerns about his viability in the Democratic race to pick a challenger to President Donald Trump.", "authors": ["Simon Lewis", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191019&t=2&i=1442620840&w=1200&r=LYNXMPEF9I07J", "published_at": "2019-10-19"}