{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/worst-things-wear-airport-according-062901299.html", "downloaded_at": "2019-10-20 13:25:44.825519+00:00", "title": "The Worst Things to Wear to an Airport, According to a TSA Agent", "language": "en", "text": "We’re always in pursuit of further refining our ensembles for every destination, whether it’s the airport or the office. And while we’ve done enough traveling to have a general idea of what works and what doesn’t at the airport—those lace-up sandals were awesome until we held up an impatient line of people trying to take them off—we figured there’s still a thing or two we can learn from a true expert. Enter Kimberly Pruitt, a former TSA agent who spent more than five years working as a security officer at Los Angeles International Airport. We sat down with Pruitt to learn the surprising items that always seem to cause an issue when going through security. After you read Pruitt’s tips, we guarantee you’ll rethink your next airport look… After all, no one wants to be the one holding up the security line, right?\n\nScroll down to check out what not to wear to the airport to ensure your next traveling experience is that much smoother.\n\nWhat Not to Wear: Maxi Dresses and Skirts\n\n“If you are opposed to getting patted down, then wearing a maxi skirt or dress isn’t your best bet, because the officer will have to check you are not hiding anything under your skirt,” Pruitt tells us.\n\nWhat to Wear Instead: Loose-Fitting Pants or Leggings\n\nView photos\n\nMoon River Striped Trousers ($59)\n\nView photos\n\nTumi Extended Trip Packing Case ($795)\n\nWhat Not to Wear: Lots of Bobby Pins\n\n“Believe it or not, too many bobby pins will set off the metal detector. If you’re looking to maintain your hair and skip the pat-down, I would suggest getting dolled up after screening,” says Pruitt.\n\nWhat to Wear Instead: Simple Hair Ties or a Soft Headband", "description": "Or, how to avoid the dreaded pat-down.", "authors": ["Kat Collings"], "top_image": "https://s.yimg.com/uu/api/res/1.2/UV5IhJLSJfCnYywouYoaRA--~B/aD05MzM7dz03MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/who_what_wear_581/7469f9070a04ff6cf419d555e856834d", "published_at": "2019-10-20"}