{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/29/verlander-gets-3000th-k-astros-clinch-home-field", "downloaded_at": "2019-09-29 05:06:41.234100+00:00", "title": "Verlander gets 3,000th K, Astros clinch home field", "language": "en", "text": "ANAHEIM, Calif. (AP) - Justin Verlander recorded two strikeout milestones, getting his 3,000th in the majors and career-high 300th of the season, and the Houston Astros clinched home-field advantage throughout the postseason with a 6-3 victory over the Los Angeles Angels on Saturday night.\n\nJose Altuve and Josh Reddick homered to back Verlander (21-6), who became the 18th pitcher to reach 3,000 career punchouts and the 19th since 1900 to reach 300 in a season.\n\nThe right-hander came into the game with 2,994 strikeouts. He achieved the career milestone in the fourth inning when he got Kole Calhoun swinging at a slider. Calhoun reached first, though, on a wild pitch, and Andrelton Simmons then gave Los Angeles a 3-0 lead with a two-run homer to left-center. Brian Goodwin supplied the first run in the second when he lined Verlander’s curveball over the wall in right-center.\n\nAccording to Baseball-Reference and Retrosheet, that’s the first time a pitcher has recorded his 3,000th strikeout on a wild pitch.\n\nVerlander - who struck out 12 in six innings while allowing three runs and four hits - reached 300 in a season for the first time when he got Calhoun on a foul tip in the sixth.\n\nVerlander and teammate Gerrit Cole are the first teammates to record at least 300 strikeouts in the same season since Curt Schilling and Randy Johnson for the Arizona Diamondbacks in 2002. Cole has 316 this year.\n\nIt was Verlander’s sixth game this season and fourth since the All-Star break with 12 or more strikeouts.\n\nHouston rallied with a five-run sixth. Altuve brought the Astros within a run with a two-run shot to left-center off starter José Suarez. Alex Bregman walked and Aledmys Diaz was hit by a pitch from Luke Bard (3-3) before Reddick sent a slider over the right field wall to put Houston on top.\n\nAltuve, who had three hits and drove in three runs, doubled to drive in Kyle Tucker in the seventh to extend Houston’s lead to three runs. Roberto Osuna worked the ninth for his 38th save.\n\nThe Astros are only one game in front of the Dodgers but clinched home field by virtue of having a better intradivisional record. Houston beat the Dodgers in the 2017 World Series to claim its first championship, winning Game 7 on the road.\n\nHouston will face either Tampa Bay or Oakland, who play Wednesday night in the AL wild-card game, starting Friday in the Division Series. The Yankees and Minnesota will meet in the other ALDS, which starts the same day.\n\nFOR STARTERS\n\nSuarez had one of his better outings for the Angels. It was only the second time this season the left-hander has gone five or more innings and allowed two runs or fewer. Suarez allowed two runs and three hits and struck out six.\n\nTRAINER’S ROOM\n\nAngels: Goodwin was back in the lineup and batted second after leaving Thursday’s game due to back spasms.\n\nUP NEXT\n\nCole (19-5, 2.52 ERA) attempts to reach 20 wins for the first time in front of friends and family. The 29-year old right-hander grew up in Newport Beach and lives in Santa Ana during the offseason. Left-hander Dillon Peters (4-3, 4.72 ERA) takes the mound in the Angels’ finale.\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Justin Verlander recorded two strikeout milestones, getting his 3,000th in the majors and career-high 300th of the season, and the Houston Astros clinched home-field advantage throughout the postseason with a 6-3 victory over the Los Angeles Angels on Saturday night.", "authors": ["The Washington Times Http", "Joe Reedy"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/29/astros_angels_baseball_01666_c0-280-3847-2522_s1770x1032.jpg?96b995a89346ecbe800cd74a7f33156034fb86dd", "published_at": "2019-09-29"}