{"pub": "washingtontimes", "title": "How Trump can boost his blue collar boom and avoid recession", "url": "https://washingtontimes.com/news/2019/aug/30/how-trump-can-boost-his-blue-collar-boom-and-avoid", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:02:19.702009+00:00", "text": "ANALYSIS/OPINION:\n\nHeadlines scream about stock markets — and national economies worldwide — being on a roller-coaster ride because of U.S. trade policies and diplomatic engagements. That is because we have a president skilled in the “Art of the Deal” who knows where he wants to go … and how to get there.\n\nYou can’t deal with China without protecting and preserving Hong Kong’s historic independence. The Communist leaders of China realize Hong Kong is the “freedom center” and “freedom marquee” of their region. President Trump will never sell that out. That is central to any deal on China’s economy and markets.\n\nThe same holds for the West. The “deep state” that is Western Europe is now being challenged by Boris Johnson and Brexit. The president has gone to Europe to restore “sanity” and help the prime minister and England exit the European Union and its deadly Brussels bureaucracy. This is step one in doing the same with Washington’s bureaucracy.\n\nMr. Trump could further boost his Blue Collar Boom, and avert recession, by making a free trade deal with Britain when Mr. Johnson liberates his nation from the EU on Oct. 31. Mr. Trump should similarly make such a deal with Japan, isolating China. Mr. Trump can put an exclamation point on his trade roll if he can close a deal with China. A new trade deal with China would produce an historic era of global prosperity.\n\nThe Democratic House should do its part by passing the USMCA trade agreement between the U.S., Mexico and Canada, which Mr. Trump has already negotiated. If they don’t, the American people need to rise up and take that power away from them in 2020.\n\nMr. Trump can further boost his historic Blue Collar Boom, and avoid recession, if the Fed would end its deflationary monetary policy, cut interest rates, stabilize the dollar (by stopping the recent artificial increase in the dollar’s value), and stop declining commodity prices. As Milton Friedman explained in his magnum opus, “A Monetary History of the United States,” for which he won the Nobel Prize, the Fed stumbled into the Great Depression by starving the nation of dollars, when the world was demanding dollars as a safe haven.\n\nFed Chairman Jerome Powell and his colleagues haven’t seen or acted on this as quickly as they should have. President Reagan’s Fed did see it quickly enough though. They adopted the Price Rule to guide their policies by early commodity prices in the market. That avoided monetary policy mistakes to keep Reagan’s booming recovery going ultimately for 25 years, from late 1982 until late 2007. If Mr. Powell’s Fed can act soon enough, which would require another major interest rate cut before the fall, Mr. Trump’s recovery can be similarly as long.\n\nDoubling down on Mr. Trump’s world-leading energy domination, instead of abandoning fossil fuels, as under the Democrats’ Green/Red New Deal, would further boost Mr. Trump’s Blue Collar Boom. Avoiding all the tax increases the Democrats are proposing, which would be the fastest route to renewed recession, would be a further relief to America and its newly prosperous working people.\n\nProgressive Democrats and their media sycophants have not acknowledged a fundamental realignment of blue collar working people, the original Democratic Party backbone, which began as far back as Richard Nixon, accelerated under Reagan, and crested under Mr. Trump. That will turn into a rout if the realignment spreads to blacks returning to their original Republican home in 2020 in response to Mr. Trump’s Blue-Collar Boom, and their all-time record low unemployment.\n\nPolls show Hispanics rewarding Mr. Trump as well for their all-time record low unemployment. Probably women, youth and low-wage workers will as well for their record good economic fortune under Mr. Trump. All are also showing record wage increases. The American people are also enjoying record wealth, in the trillions.\n\nWhat a shocker. For all the claims in the Democratic Party-controlled media about Mr. Trump and racism and fantasy white supremacy, Mr. Trump is actually leading the most inclusive economic recovery in American history.\n\nAll with record low inflation and interest rates. Behold the wondrous results of capitalism. Go back to sleep “woke” Democrats.\n\n• Lewis K. Uhler is founder and chairman of the National Tax Limitation Committee and Foundation. Peter J. Ferrara is a senior policy adviser for the Foundation and teaches economics at Kings College in New York.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Mr. Trump could further boost his Blue Collar Boom, and avert recession, by making a free trade deal with Britain when Mr. Johnson liberates his nation from the EU on Oct. 31.", "authors": ["The Washington Times Http", "Lewis K Uhler", "Peter J. Ferrara"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/08/30/uhler_c0-405-1800-1454_s1770x1032.jpg?d1b987c8155003bf0ec533845c28d0e70cda4f17"}