{"pub": "cryptonews", "url": "https://cryptonews.com/news/samsung-adds-12-new-dapps-to-its-mobile-blockchain-keystore-4916.htm", "downloaded_at": "2019-10-23 09:36:00.174216+00:00", "title": "Samsung Adds 12 New Dapps to its Mobile Blockchain Keystore", "language": "en", "text": "Source: iStock/NguyenDucQuang\n\nThe world's largest smartphone maker, Samsung has added 12 new decentralized apps (dapps) to its mobile wallet marketplace, the Samsung Blockchain Keystore. Almost half of the new dapps are gaming titles.\n\nPer media outlet Decenter, the new gaming dapps are:\n\nDarkTown\n\nYangpa Kisadan (literally “Onion Knights”)\n\n(literally “Onion Knights”) Spookiz Link Puzzle (the first three developed by Itam Games)\n\n(the first three developed by Itam Games) Chinese firm Brink Asset’s Crypto Fishing , which offers players ethereum rewards\n\n, which offers players ethereum rewards Playdap’s DozerBird\n\nAxie Infinity , developed by an eponymous Vietnamese company on South Korean blockchain accelerator Hashed’s portfolio\n\n, developed by an eponymous Vietnamese company on South Korean blockchain accelerator Hashed’s portfolio South Korean cryptocurrency monitoring platform Lyze ’s dapp is another new addition\n\n’s dapp is another new addition Linka , a financial services and credit platform\n\n, a financial services and credit platform Axial Entertainment’s Master Wallet cryptocurrency wallet\n\ncryptocurrency wallet Reditus , a tokenized bonds transfer platform, has also been added\n\n, a tokenized bonds transfer platform, has also been added Gotchu , a blockchain and cryptocurrency data service\n\n, a blockchain and cryptocurrency data service Blockchain platform Aergo, developed by long-term Samsung partner Blocko\n\nThe new additions mean that there are now 30 dapps available on the Keystore – with Samsung keen to add more in the months ahead. Ten of the dapps are in the gaming category – the new additions join the previously added MyCryptoHeroes, CryptoDozer (also a Playdap title), CryptoKitties and The Hunters.\n\nYou can find out more about Samsung’s dapps by checking out our comprehensive guide.\n\nAs recently reported, Samsung has introduced three models of a new blockchain-friendly mobile device, Klaytn Phone, developed in association with Ground X, a subsidiary of chat app giant Kakao. The Klaytn Phone is a special limited edition of the recently released Galaxy Note 10 phone-tablet (phablet), with two Klaytn Phone versions of its Galaxy Note 5 Plus version also available: a 256G model and a 512G version.\n\nAlso, the company is a member of a government-backed “consortium-type” blockchain network that aims to allow citizens to ditch paper-based certificates, employee ID cards, degree certificates, insurance claims documents and more in favor of a mobile-based blockchain solution.", "description": "Samsung has added 12 new decentralized apps (dapps) to its mobile wallet marketplace, the Samsung Blockchain Keystore. Almost half of the new dapps are gaming titles.", "authors": ["Tim Alper"], "top_image": "https://cimg.co/w/articles/0/5db/00f288297b.jpg", "published_at": "2019-10-23"}