{"pub": "cbs", "url": "https://cbsnews.com/news/universal-basic-income-data-show-how-people-spent-the-500-a-month-they-got-for-free", "downloaded_at": "2019-10-03 23:39:02.988515+00:00", "published_at": "2019-10-03", "title": "$500 a month for free: Data show how people spent the money", "language": "en", "text": "The first data from an experiment in a California city where needy people get $500 a month from the government shows they spend most of it on things such as food, clothing and utility bills.\n\nThe 18-month, privately funded program started in February and involves 125 people in Stockton. It is one of the few experiments testing the concept of \"universal basic income,\" an old idea getting new attention due to Democratic presidential candidate Andrew Yang.\n\nStockton Mayor Michael Tubbs has committed to publicly releasing data throughout the experiment to win over skeptics and, he hopes, convince state lawmakers to implement the program statewide. The demonstration was spearheaded by the Economic Security Project, a network focused on basic income in the U.S.\n\n\"In this country we have an issue with associating people who are struggling economically and people of color with vices like drug use, alcohol use, gambling,\" he said. \"I thought it was important to illustrate folks aren't using this money for things like that. They are using it for literal necessities.\"\n\nStockton mayor on efforts to test universal basic income\n\nBy contrast, critics say the experiment likely won't provide useful information from a social science perspective given its limited size and duration.\n\nMatt Zwolinski, director of the Center for Ethics, Economics and Public Policy at the University of San Diego, said people aren't likely to change their behavior if they know the money they are getting will stop after a year and a half. That's one reason why he says the experiment is \"really more about story telling than it is about social science.\"\n\nPlus, he said previous studies have shown people don't spend the money on frivolous things.\n\n\"What you get out of a program like this is some fairly compelling anecdotes from people,\" he said. \"That makes for good public relations if you are trying to drum up interest in a basic income program, but it doesn't really tell you much about what a basic income program would do if implemented on a long-term and large-scale basis.\"\n\nThe researchers overseeing the program, Stacia Martin-West at the University of Tennessee and Amy Castro Baker at the University of Pennsylvania, said their goal is not to see if people change their behavior, but to measure how the money impacts their physical and mental health. That data will be released later.\n\nPeople in the program get $500 each month on a debit card, which helps researchers track their spending. But 40% of the money has been withdrawn as cash, making it harder for researchers to know how it was used. They fill in the gaps by asking people how they spent it.\n\nSince February, when the program began, people receiving the money have on average spent nearly 40% of it on food. About 24% went to sales and merchandise, which include places like Walmart and discount dollar stores that also sell groceries. Just over 11% went to utility bills, while more than 9% went to auto repairs and fuel.\n\nThe rest of the money went to services, medical expenses, insurance, self-care and recreation, transportation, education and donations.\n\nPaying the bills\n\nOf the participants, 43% are working full or part time while 2% are unemployed and not looking for work. Another 8% are retired, while 20% are disabled and 10% stay home to care for children or an aging parent.\n\n\"People are using the money in ways that give them dignity or that gives their kids dignity,\" Castro-Baker said, noting participants have reported spending the money to send their children to prom, pay for dental work and buy birthday cakes.\n\nDem candidate Andrew Yang defends plan to give every American $1,000 a month\n\nZhona Everett, 48, and her husband are among the recipients. When the experiment started she was unemployed and her husband was making $110 a day as a truck driver. They were always late paying their bills, and the pressure caused problems with their marriage.\n\nOnce she got the money, Everett set it up to automatically pay bills for her electricity, car insurance and TV. She's also paid off her wedding ring, donates $50 a month to her church and still has some left over for an occasional date night with her husband.\n\nShe said she and her husband now both have jobs working at the Tesla plant in Fremont.\n\n\"I think people should have more of an open mind about what the program is about and shouldn't be so critical about it,\" she said.", "description": "Under an experimental program in Stockton, California, 125 residents are drawing \"universal basic income\"", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/03/14f4775f-0488-4f15-967a-93df05a204d3/thumbnail/1200x630/75d8c2af665b2707182fba563e7701bc/gettyimages-147225167.jpg"}