{"pub": "businessinsider", "url": "https://businessinsider.com/stock-picks-best-cheap-companies-to-buy-now-goldman-sachs-2019-9?r=rr", "downloaded_at": "2019-09-20 05:10:24.254517+00:00", "title": "Stock picks, best cheap companies to buy now: Goldman Sachs", "language": "en", "text": "The marketwide rotation from growth to value stocks may have crushed many hedge funds— but not everyone is reeling.\n\nInvestors who bought companies thought to be undervalued have benefitted from the recent outperformance of value stocks over the fastest earnings growers. The past few weeks have allowed value investors to take a rare victory lap, considering how much growth stocks have outperformed throughout this bull market.\n\nOne of the big questions on these investors' minds concerns which cheap stocks will be the biggest beneficiaries if this shift persists.\n\nDerivatives strategists at Goldman Sachs have compiled a list of 20 stocks that \"have the potential for continued asymmetric upside.\" In other words, these stocks have rebounded with the recent rotation to value and are more likely to add to their gains than reverse course.\n\nInvestors have already discounted these companies heavily. The average stock on this list has underperformed the S&P 500 by 32% over the past year.\n\n\"While fundamentals will also determine the long-term trajectory of stocks, we use signals from options and credit markets to identify 20 value stocks from among those where our analysts' estimates show strong value scores,\" Goldman's Vishal Vivek said in a recent note to clients.\n\nThe stocks are all buy- or neutral-rated and were skimmed from the top quintile of Goldman's valuation portfolio. Their credit default swap spreads are all tighter than 200 basis points and have not risen over the past month.\n\nThey are listed below, sorted from stocks with the smallest drawdown over the past year to those with the largest.", "description": "These value stocks are already on the rise but still trading at a steep discount to Goldman Sachs' price forecasts.", "authors": ["Akin Oyedele"], "top_image": "https://amp.businessinsider.com/images/5a1302ccf914c350018b4f4e-2732-1366.jpg", "published_at": "2019-09-19"}