{"pub": "yahoo", "url": "https://sports.yahoo.com/manchester-united-mess-why-turning-073000453.html", "downloaded_at": "2019-10-06 11:39:06.692870+00:00", "title": "Manchester United mess: Why is it turning sour for Ole Gunnar Solskjaer at Old Trafford", "language": "en", "text": "Ole Gunnar Solskjaer looks downcast - PA\n\nAway day blues\n\nOle Gunnar Solskjaer won his first nine away matches in charge but, since that dramatic 3-1 Champions League victory against Paris St-Germain at the Parc des Princes, Manchester United have not won on the road - a run of 10 games spanning almost seven months - and go to second-bottom Newcastle United on Sunday desperately needing to end that hoodoo.\n\nScroll to continue with content Ad\n\nTo give United’s travel sickness some context, Aston Villa have won seven away fixtures, Southampton and Wolves five, Bournemouth, Crystal Palace, Sheffield United and West Ham four each and even Newcastle three times since Solskjaer’s team last claimed a win away from Old Trafford. It has contributed to the club’s worst start to a top-flight campaign for 30 years.\n\nWhere are the goals going to come from?\n\nUnited failed to register a single shot on target in Thursday’s goalless draw away to AZ Alkmaar in the Europa League on Thursday. They have now failed to score more than once in 19 of their past 22 matches under Solskjaer and their shooting has been spectacularly wayward and yielded just seven goals in the past nine games.\n\nAgainst League One Rochdale in the Carabao Cup, 23 of their 31 shots missed the target. It has been a similar story in other games - 19 shots off target in the 2-1 defeat against Crystal Palace, 14 off target in the 1-1 draw against Arsenal and 13 failing to trouble the goalkeeper in fixtures against Southampton and Astana.\n\nFew could argue with the decisions to offload Romelu Lukaku and Alexis Sanchez, but they had to be replaced and Solskjaer is already counting the cost of failing to reinforce his attack.\n\nMarcus Rashford has been goal-shy this season Credit: getty images\n\nStory continues\n\nMarcus Rashford looks particularly out of sorts and the lack of goals from midfield and set plays are increasing the pressure on a goal-shy attack and drastically reducing the margin for error at the other end of the pitch.\n\nExcluding penalties, United last scored from a set piece in the Premier League on Feb 27 against Palace against Selhurst Park, which is comfortably the longest run in the top flight without a goal from a corner or an indirect free kick.\n\nWhat has happened to the pressing?\n\nA feature of pre-season was the intensity with which United sought to press from the front as part of a co-ordinated strike high up the field. It was not perfect and needed work but there were signs of a strategy. So what has happened to those plans?\n\nUnited began in that fashion against Chelsea on the opening day - even adjusting the press in the second period to spring the trap once their opponents reached halfway - but things have since fizzled out to the point where it is, once again, hard to discern what the players are being asked to do. There was a fleeting attempt at pressing Arsenal high up but it did not last and, the more games United play, the more cowed they look.\n\nIt is hard to discern what Manchester United's tactics are these days Credit: getty images\n\nSquare pegs in round holes\n\nDanny Gabbidon, a defender under Solskjaer during the Norwegian’s ill-fated nine-month spell with Cardiff City, felt he chopped and changed players too much, often asking them to play in roles they were unfamiliar with. The same is happening at United.\n\nWhy did Solskjaer see fit to start with Mason Greenwood, a centre-forward and arguably his best finisher, wide right against Alkmaar and Daniel James, a winger, through the middle? The experiment lasted just 20 minutes but, even then, Solskjaer reacted by shifting James to the right, rather than his preferred position on the left.\n\nSimilarly, against Arsenal, Axel Tuanzebe started in an unfamiliar left-back position and Ashley Young - who has experience in both full-back positions - on the right. Tuanzebe performed well in the main, and perhaps Solskjaer wanted a player with greater mobility up against Nicolas Pepe, but it was still a huge ask of a 21-year-old centre-half and it was from his mistake in the left-back position that Arsenal equalised.\n\nMason Greenwood was played out of position against Alkmaar Credit: getty images\n\nWhy all the muscle injuries?\n\nRich Hawkins, United’s head of athletic training services, talked in July about the specific work they were doing to try to reduce a surfeit of muscle injuries. “Our key injuries over the last few years have been groins and hamstrings so one of our aims is to ensure everyone is available for the manager on day one of the season, so a lot of the focus initially in training is on those groin and hamstring areas,” he said.\n\nWhatever preventative measures were taken, they do not appear to be having the desired effect. Jesse Lingard became the fourth player to pull up with a muscle injury already this term when he suffered a hamstring strain against Alkmaar. Anthony Martial and Luke Shaw have been out for the past six weeks and counting with thigh and hamstring injuries respectively and Rashford was rushed back against Arsenal after a groin problem sustained at West Ham and did not look fit.\n\nSolskjaer felt the muscle injuries suffered in the final months of last season were a consequence of the team not being fit enough to cope with a change to a more intense pressing game but, after a summer building up fitness levels, the same problems are resurfacing.\n\nJesse Lingard picks up a hamstring injury Credit: getty images\n\nThe Pogba problem\n\nPaul Pogba wanted to quit Old Trafford in the summer and his performances to date, when he has been fit, suggest little else has changed. Trying to build a team around a player who wants out was always going to be a perilous exercise for Solskjaer and Pogba - who seems likely to miss the Newcastle game with an ankle injury that has already seen him sit out four matches - remains as much a problem as a solution at the moment.\n\nThe young players in the squad need direction and leadership from the senior players but the likes of Pogba and Nemanja Matic are failing to provide anything of the sort.", "description": "Ole Gunnar Solskjaer won his first nine away matches in charge but, since that dramatic 3-1 Champions League victory against Paris St-Germain at the Parc des Princes, Manchester United have not won on the road - a run of 10 games spanning almost seven months - and go to second-bottom Newcastle United", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/IKl246Jt3tdeysEnLHyxKw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/DOhk8qcHjj_LPJ8qDNJ6nQ--~B/aD0xMjY4O3c9MjAyODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_818/db7697420eafdd4395faa881dd10a669", "published_at": "2019-10-06"}