{"pub": "townhall", "url": "https://finance.townhall.com/columnists/betsymccaughey/2019/10/02/the-onthejob-coverage-ripoff-n2554015", "downloaded_at": "2019-10-02 12:46:53.135157+00:00", "published_at": "2019-10-02", "title": "The On-The-Job Coverage Rip-Off", "language": "en", "text": "Employer-provided health plans now cost a gigantic $20,576 a year for family coverage, according to the Kaiser Family Foundation. Technically, the employer pays most of it, but labor costs are labor costs. The more that's spent on benefits the less can go to wages.\n\nIn reality, it's $20,000 out of every worker's pocket -- money that could have bought a subcompact car or upgraded a kitchen.\n\nIt's a big problem. A staggering 156 million people -- half the nation -- get coverage through workplace plans, compared with 11 million enrolled in Obamacare.\n\nThe No. 1 reason health costs are soaring: obesity and obesity-linked diseases. An obese adult uses 42% more health care than a healthy-weight adult. A morbidly obese adult uses 81% more. Never mind that you watch what you eat and take care of yourself. Health insurance isn't sold by the pound. When co-workers and their family members need huge amounts of health care, their extra costs are shifted onto you.\n\nThe Democrats running for president aren't leveling with you about the causes of the cost crisis. They don't want to be accused of \"fat shaming.\" Here's the reality:\n\nHealth spending is soaring all across the developed world -- even in countries with socialized medicine, Sen. Sanders. Everywhere, obesity and obesity-related diseases are largely to blame. Nothing will tame costs that doesn't address this issue.\n\nObesity is linked to heart disease, stroke, high blood pressure, colon and breast cancer and the disease that's busting the health care piggy bank, Type 2 diabetes.\n\nDiabetes costs shot up from $21 billion to $90 billion in the last 20 years. Heart disease still costs more, but diabetes is growing faster and will soon overtake it -- unless Americans change their behavior.\n\nThis nation educated the public about smoking and convinced millions to stop. We can do it again to combat reckless, self-destructive eating.\n\nSome people are obese due to genetic reasons, lack access to healthy food or other underlying conditions. But for most, it's poor eating choices.\n\nIn the meantime, generally healthy people who take care of themselves are getting overcharged to pay for co-workers and family members with high health costs. Here's how to fix that.\n\nThe average American consumes $11,000 a year in health care. But averages obscure the truth. A tiny 5% of the population consumes 50% of the health care. Charging everyone the same for health care coverage is a rip-off for the healthy.\n\nAfter all, how many families with employer-provided coverage actually use $20,000 worth of health care a year?\n\nThe way to correct this unjust situation without abandoning the obese and chronically ill is for government to reimburse insurers or employers for the highest-cost patients. It's called reinsurance.\n\nReinsurance is already driving down premiums in the individual insurance market. Obamacare became unaffordable mostly because the law forced all consumers to pay the same, regardless of their health. For the healthy, it's sheer extortion.\n\nThe Trump administration stepped in to help states fix that unfairness and reduce Obamacare premiums using reinsurance. Seven states (Alaska, Maryland, Maine, Minnesota, New Jersey, Oregon and Wisconsin) have lowered premiums by 20% the first year, on average, according to Avalere consultants. You wouldn't know that, hearing the claims that Trump is sabotaging Obamacare.\n\nPeople with preexisting conditions are still covered, but their costs are not borne by premium payers. Four more states are launching reinsurance now. It's being embraced in states led by Democrats as well as Republicans. It works.\n\nPaying directly for high-cost patients is smarter than subsidizing the healthy majority to overpay for insurance.\n\nThe same reinsurance model can be used nationwide to rescue workers from the exploding cost of on-the-job coverage. Premiums will come down, resulting in more take-home pay and fairness. Reinsurance can be funded by repealing the brutal 40% \"Cadillac\" tax on expensive health plans and replacing it with a much gentler cap on the deductibility of those plans instead.\n\nThat's the legislative fix. But in the long run, Americans need to get control of their expanding waistlines. Pols won't say that, of course. Too many chubby voters.\n\nBetsy McCaughey is a former lieutenant governor of New York State. Contact her at betsy@betsymccaughey.com.", "description": "Employer-provided health plans now cost a gigantic $20,576 a year .10/02/2019 8:45:39AM EST.", "authors": ["Betsy Mccaughey", "Beth Baumann", "Leah Barkoukis", "Cortney O'Brien", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/136/24290db6-3bb1-47a7-8765-b63939be747b.png"}