{"pub": "townhall", "url": "https://townhall.com/tipsheet/juliorosas/2019/10/21/kurds-throw-rock-and-garbage-at-us-troops-leaving-northern-syria-n2555088", "downloaded_at": "2019-10-22 13:26:24.192578+00:00", "title": "WATCH: Kurds Throw Rocks and Garbage at US Troops Leaving Northern Syria", "language": "en", "text": "Warning: Article contains graphic language.\n\n\n\nAngry Kurds were filmed throwing rocks and garbage at the armored vehicles of U.S. troops as they left northern Syria.\n\nThe videos taken by local media outlets in the region show the upset civilians in Qamishli, Syria throwing the different objects at the military's vehicles. One man can be heard shouting, \"F*ck America, what happened to you?”\n\n#Kurdish residents in the city of Qamishli block the path of the American forces withdrawing from northern #Syria and throw tomatoes at them following President Trump's order for the #US soldiers to retreat from the region - ANHA pic.twitter.com/PB513uC8ft — Rudaw English (@RudawEnglish) October 21, 2019\n\nWow\n\n\n\nSyrian Kurds throw rotten food and stones to withdrawing US forces in Qamishli, Syria via @adharves pic.twitter.com/TeqP6RpdUx — Ragip Soylu (@ragipsoylu) October 21, 2019\n\nPresident Trump issued the withdrawal to of U.S forces in northern Syria to avoid causalities when the Turkish military invaded the region. The Department of Defense revealed they are not leaving the area entirely, but are redeploying to western Iraq.\n\nThe redeployment away from Syria has been heavily criticized as abandoning the Kurds, who have been the primary local ally in the fight against ISIS.\n\nAs the convoy's entered Iraq, they were still met with angry Kurds, as some shouted, \"F*ck you!\" as they thew stones and other items at the vehicles.\n\nSome locals this time in Erbil, Iraqi Kurdistan, threw stones at arriving US convoy from Syria pic.twitter.com/vIjaZP7dye — Ragip Soylu (@ragipsoylu) October 21, 2019\n\nFormer Secretary of Defense James Mattis warned ISIS will become a threat again without a U.S. presence because the Turkish military and its militias will be focusing on eradicating the Kurds instead.\n\n\"We have got to keep the pressure on ISIS so they don’t recover. We may want a war over, we may even declare it over. You can pull your troops out, as President Obama learned the hard way out of Iraq, but the enemy gets a vote, we say in the military. If we don’t keep pressure on, then ISIS will resurge. It’s absolutely a given that they will come back,\" Mattis said.", "description": ".10/22/2019 9:22:16AM EST.", "authors": ["Julio Rosas", "Matt Vespa", "Leah Barkoukis", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/images/2019/294/1ec6bb54-9e49-454e-bfa5-1cdbd66672ac.jpg", "published_at": "2019-10-21"}