{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/extinction-rebellion-activists-marry-during-protest-on-westminster-bridge-10877927", "downloaded_at": "2019-10-07 20:12:10.255602+00:00", "title": "Extinction Rebellion couple marry during protest on Westminster Bridge", "language": "en", "text": "Tasmin (L) and Melissa staged the wedding surrounded by activists on Westminster Bridge in central (Picture: AFP)\n\nA couple staged a unique wedding in the middle of an Extinction Rebellion protest today.\n\nActivists Melissa and Tamsin tied the knot on Westminster Bridge amid huge protests around the capital.\n\nRupert Reed, an activist present at the quirky event said: ‘This beautiful ceremony seemed to prefigure something about the more beautiful world that XR are trying to build.\n\n‘Thanks to Extinction Rebellion, this beautiful wedding is happening right now in the middle of Westminster Bridge. So happy to witness my friend and longtime comrade Tamsin Omond marrying in this unique way’.\n\nAnother, Sam Knight, added: ‘If this doesn’t go down in the history books then wtf’.\n\nmy friend just got married in the middle of the rebellion and if this doesn’t go down in the history books then wtf#ExtinctionRebelion #LoveNotHate #ClimateJusticeNow pic.twitter.com/rYTfSzoSby — Sam Knights (@samjknights) October 7, 2019\n\nA priest was present for the event – though some have suggested Westminster bridge is not licensed for weddings (Picture: AFP)\n\nCrowds cheered as the pair tied the knot (Picture: Getty Images Europe)\n\nThe pair were among thousands of demonstrators in London today (Picture: AFP)\n\nThe group are staging protests for the next two weeks (Picture: AFP)\n\nThe event came as more than 130 people were arrested across London, as roadblocks and protest sites were set up ahead of two weeks of planned action.\n\nAdvertisement\n\nAdvertisement\n\nTravel disruption is expected around London and worldwide, as the group call for environmental action.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Environmental pair Melissa and Tamsin tied the knot in one of the more unusual weddings you're ever likely to see.", "authors": ["Harrison Jones"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_88845212_1570476359.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}