{"pub": "businessinsider", "url": "https://businessinsider.com/first-texas-visit-new-yorker-biggest-us-state-fair-2019-10", "downloaded_at": "2019-10-19 15:34:09.546194+00:00", "title": "I'm a New Yorker who just spent a day alone at the State Fair of Texas. Here's what I saw walking around birthing barns and butter sculptures.", "language": "en", "text": "The State Fair of Texas is the biggest state fair in the US. I visited on opening day.\n\nShana Lebowitz/Business Insider\n\nI scanned the list of attractions — chainsaw carving (of timber) and auto shows among them — all of which seemed mercifully more humane than this one.\n\nAt 1 pm, it was 95 degrees and the sunshine was relentless. An ant crept slowly down my spine — no, it was just perspiration.\n\nWhy, exactly, was I here? From my climate-controlled office in New York City's Financial District, spending opening day at the biggest state fair in the US seemed a delightful experience. I was headed to Dallas anyway, for a conference: How could I not seize the opportunity?\n\nIn the days leading up to the fair, I told multiple people about my plans to visit. Everyone wanted to know: Was I going alone? (Yes.) Did I often travel by myself? (More or less first-timer.) Had I ever been to Texas? (No; lifelong New Yorker here.) Did I like barbecue? (Vegetarian.) Then ... why was I going? (Adventure?)\n\nThe roughly six hours I spent at the fair proved exhausting and exhilarating. At one point, I wandered dehydrated over to a concession stand selling cold water bottles, only to learn that each one cost eight coupons (the equivalent of $4).\n\n\"Eight coupons!\" I shouted, in my best rendition of a Take-No-Crap New Yorker. \"That's a ripoff!\"\n\nThe proprietor looked at me and smirked. \"Lady,\" he said, \"you're at the State Fair.\"", "description": "I recently visited Texas and spent a day at the biggest state fair in the US. Butter sculpting was disappointing, but the dog show was thrilling.", "authors": ["Shana Lebowitz"], "top_image": "https://image.businessinsider.com/5daa281ccc4a0a675903d023?width=1200&format=jpeg", "published_at": "2019-10-19"}