{"pub": "businessinsider", "url": "https://businessinsider.com/9-17-2019-telecoms-and-technology-forecast-book", "downloaded_at": "2019-09-18 05:10:00.074760+00:00", "title": "THE TELECOMS & TECHNOLOGY FORECAST BOOK 2019: How to navigate the quickly evolving mobile, communications, and technology space", "language": "en", "text": "5G is coming, and wireless networks are poised for transformation thanks to its blazing fast connections, near-instantaneous response times, and massive device support. The networks will support over 1.5 billion 5G phones in use worldwide by 2024.\n\nBusiness Intelligence Insider\n\nCompanies across the digital space need to know what this generational shift will do to enable new practices, expand revenue streams, and embed their technology even deeper into consumer's lives and enterprise workflows. And 5G won't be acting alone: The development of AI technologies will fuel the rise of autonomous cars and trucks and the growth of smart speakers, all of which are acting alongside one another and ushering in a transformed world.\n\nTo help navigate this fast-changing landscape, Business Insider Intelligence has forecast the key figures that will define the next five years for telecommunications and technology leaders. The Telecoms & Tech Forecast Book gives you the data you need to make decisions on how to navigate the quickly evolving mobile, communications, and technology space.\n\nHere are some examples of the forecasts included in the deck:\n\nGlobal smart speaker installed base\n\nGlobal 5G-equipped phone installed base\n\nEnterprise AR & VR headset shipments\n\nAnnual US cellular infrastructure spending\n\nThe companies mentioned in the report are: Amazon, Alibaba, Tencent, Xiaomi, Google, Apple, Roku, Snap, T-Mobile, Sprint, Verizon, Samsung, Motorola, Huawei, UPS, Magic Leap\n\nInterested in getting the full report? Here are three ways to access it:", "description": "The Telecoms & Tech Forecast Book gives you the data you need to navigate the quickly evolving mobile, communications, and technology space.", "authors": ["Peter Newman"], "top_image": "https://static.businessinsider.com/image/5ca235fdffcb2702f16bc065-750.jpg", "published_at": "2019-04-01"}