{"pub": "vice", "url": "https://vice.com/en_us/article/bjw3pw/pulp-fiction-is-best-understood-through-its-obsession-with-fast-food", "downloaded_at": "2019-10-19 10:50:15.885735+00:00", "title": "'Pulp Fiction' Is Best Understood Through Its Obsession With Fast Food", "language": "en", "text": "Do you know what they call a Quarter Pounder with Cheese in Paris?\n\nThanks to Pulp Fiction, released 25 years ago this week, we all do: a Royale with Cheese. “[France] got the metric system, they wouldn’t know what the fuck a ‘Quarter-Pounder’ is,” Vincent Vega (John Travolta) explains to Jules Winnfield (Samuel L. Jackson) at the beginning of the movie.\n\nThis scene kicks off what is arguably Quentin Tarantino’s greatest film, which revels in drugs, gore, and yes, even cheeseburgers. But for all the movie’s now-iconic symbolism, there’s one theme that usually goes overlooked: that all the food eaten or mentioned in Pulp Fiction—from the bowl of Fruit Brute cereal that Vince’s dealer Lance (Eric Stoltz) is having for dinner to the frosted cinnamon Pop-Tarts that Butch Coolidge (Bruce Willis) sticks in the toaster while retrieving his prized watch—is conventionally seen as garbage. Cheeseburgers, milkshakes, bacon pancakes, and other assorted diner favorites are cheap and quickly consumed, the culinary equivalent of the exact type of trashy paperbacks after which Pulp Fiction is named.\n\nWhen Vince and Jules arrive at an apartment to recover a briefcase belonging to their boss, gangster Marsellus Wallace (Ving Rhames), they interrogate the hapless young men in possession of the case. As an icebreaker, Jules asks about the Big Kahuna cheeseburger (“That’s that Hawaiian burger joint!”) that the group’s ringleader, Brett (Frank Whaley), is eating for breakfast—before Jules and Vince eventually shoot up the place.\n\nAfter disposing of what becomes a brain-splattered Chevy Nova, Jules and Vince are hungry for breakfast and opt for a cheapy diner (Tarantino reportedly wrote the diner scenes of Pulp Fiction and Reservoir Dogs with Denny’s in mind, but the company wouldn’t give him permission to film there), which winds up being the same diner that partners-in-crime Ringo (Tim Roth) and Yolanda (Amanda Plummer) decide to rob at gunpoint. (“I bet you could cut down on the hero factor in a place like this,” Yolanda muses.) Later in the film, chronologically speaking, Vince takes Marsellus Wallace’s wife Mia (Uma Thurman) out for a dinner consisting of steak, a burger, and a $5 dollar milkshake at another diner, the 50s-themed Jack Rabbit Slim’s.\n\n\n\nThe way food is discussed in Pulp Fiction is a metaphor for the movie itself, the message being that there is more value in consuming “low-brow” material than people may realize, or give the stuff credit for, at first impression.\n\nFor all the significant movies of 1994 (a year that also produced The Lion King, The Shawshank Redemption, Clerks, Natural Born Killers, and Forrest Gump), it’s Pulp Fiction that, maybe more than any other film in the past quarter century, has come to represent the stylistic benchmark of what contemporary crime cinema has since gravitated toward—and what movies today continue to emulate, especially in terms of meta storytelling, nonlinear narratives, and the endless homage and pastiche culture of the modern era. The way food is discussed in Pulp Fiction is a metaphor for the movie itself, the message being that there is more value in consuming “low-brow” material than people may realize, or give the stuff credit for, at first impression.\n\nBefore it became a pop culture touchstone of twist contests, fictitious Bible verses, and foot massages, some viewers in the 90s were less than impressed with Pulp Fiction when it initially premiered. Critics and pundits argued over what they viewed as Tarantino’s use of gratuitous violence, racism, and perceived lack of morality. In a write-up for the National Review, John Simon wrote that “titillation cures neither hollowness nor shallowness” in Pulp Fiction, while critic Stanley Kauffmann of The New Republic claimed, “ Pulp Fiction nourishes, abets, cultural slumming.” Even Republican then-presidential candidate Bob Dole chimed in, criticizing the movie for promoting “the romance of heroin.” (He didn’t see Pulp Fiction, which is obvious, since everyone knows the terrifying adrenaline shot-to-the-heart scene is probably the single greatest anti-heroin advertisement ever made, second only to the whole of Requiem for a Dream.)\n\nIn response, critics like Ken Dancyger offered alternate views, recognizing Pulp Fiction as capitalizing on the audience’s pre-existing knowledge of American cinema—such as Westerns and gangster movies—which Tarantino used as a platform to build upon to create a fresh aesthetic. Alan Stone, writing for the Boston Review, commended the film for debunking traditional Hollywood machismo and violence, as well as presenting cultural diversity. “There are strong women and strong black men, and the director swims against the current of class stereotype.”\n\nSimilar types of debates about Pulp Fiction—namely, whether the movie serves as substance or slop—symbolically play out on-screen in the form of conversations about food. Several times throughout the film, one character will fail to appreciate the full complexity of a particular food item perceived to be appalling or grimy, until another character enlightens them about how great it actually is.\n\nIn one scene, Quentin Tarantino himself makes a cameo as Jimmie, who recommends investing in good quality coffee for brewing at home with his wife, even though Jules and Vince “would’ve been satisfied with some freeze-dried Taster’s Choice” as they stand in Jimmie’s kitchen, unhappy and covered in blood. Later, Jules mentions that he doesn’t eat pork because he believes pigs are filthy animals (“Sewer rat may taste like pumpkin pie, but I’d never know, ‘cause I wouldn’t eat the filthy motherfuckers”), while Vince extols the merits of bacon and pork chops, and then presses him about his definition of what truly constitutes “a filthy animal.” At Jack Rabbit Slim’s, Mia Wallace orders a $5 milkshake ($8.66 in 2019) to Vince's chagrin, but after tasting it, he changes his mind about its value. (“Goddamn, that’s a pretty fucking good milkshake!”)\n\nTarantino took everything he loved about the movies—drawing from French New Wave to Hong Kong crime thrillers to 70s-style grindhouse flicks—and packaged them together as a sampler platter for American audiences.\n\nA love of guilty pleasures also present as a prevalent theme in conversations about food. Vince talks about the intricacies of smoking hash in Amsterdam and the novelty of drinking beer in a movie theater or at McDonald’s. In Brett’s apartment, Jules says he can’t eat meat because his girlfriend is vegetarian (“which pretty much makes me a vegetarian”), but he does value the taste of a good burger. These types of conversations would come to mirror critics’ reactions to the film, with some repelled due to the viscerality of the subject matter (TriStar supposedly turned down the screenplay for being “too demented”) while others were attracted to Pulp Fiction for exactly these reasons; that the content was too sensational to pass up.\n\nPulp Fiction is the cinematic equivalent of fast food. But that doesn’t mean it’s garbage; on the contrary, it’s quite the opposite. Tarantino took everything he loved about the movies—drawing from French New Wave to Hong Kong crime thrillers to 70s-style grindhouse flicks—and packaged them together as a sampler platter for American audiences. Pulp Fiction is an example of fine cinema made accessible for everybody.\n\nFine films don't have to all walk and talk like Citizen Kane. Sometimes, a great movie can feature men in gimp suits, drug overdoses, shoot-outs in the bathroom, and characters that drop the F-bomb 265 times. Twenty-five years after its debut, critics might still consider Quentin Tarantino’s sophomore film too offensive to be palatable. Some may even consider it filthy. But Pulp Fiction has personality, and personality goes a long way.\n\nOr, as Samuel L. Jackson’s character might say: This is one charming motherfucking pig.", "description": "From the Big Kahuna burger to the $5 milkshake, Tarantino's 25-year-old classic is a bona fide buffet of smart but accessible filmmaking.", "authors": [], "top_image": "https://video-images.vice.com/articles/5daa08f2fbf646000a37f38f/social_lede/1571432664649-Untitled-design.png?crop=1xw:0.9304xh;0xw,0xh&resize=1200:*", "published_at": "2019-10-18"}