{"pub": "bbc", "url": "https://bbc.com/news/world-latin-america-49915690", "downloaded_at": "2019-10-03 07:20:41.150767+00:00", "published_at": "2019-10-03", "title": "El Chapo 'gave $1m to Honduran president's brother'", "language": "en", "text": "Image copyright Reuters Image caption President Hernández has denied any links to drug traffickers\n\nUS prosecutors say jailed Mexican drug lord Joaquín \"El Chapo\" Guzmán gave $1m (£810,000) to the brother of the Honduran president, a bribe that was meant to reach the country's leader.\n\nThe charge was read out at the start of the trial of President Juan Orlando Hernández's brother in New York.\n\nJuan Antonio Hernández was arrested in an anti-drugs operation in Miami in November.\n\nThe president said the claims were \"100% false, absurd and ridiculous\".\n\nThe conservative leader, who enjoys the staunch support of the Trump administration, said the accusations were \"less serious than Alice in Wonderland\".\n\nIn a strongly worded tweet, the 50-year-old president - who has not been charged in the case - also pointed out that the prosecutor did not say he had received the money that was allegedly given to his brother.\n\nWhat happened in New York?\n\nJuan Antonio \"Tony\" Hernández, 41, faces four separate charges, including drug conspiracy to import cocaine into the US and weapons offences. He denies the accusations. If convicted he faces life in prison.\n\n\"The defendant was protected by and had access to his brother, the current sitting president of Honduras, a man who himself has received millions of dollars in drug money bribes,\" said Assistant US Attorney Jason Richman.\n\n\"Bribes he received from some of the largest cocaine traffickers in the world, bribes he received from men like 'El Chapo' and the Sinaloa cartel who personally delivered $1m to the defendant for his brother.\"\n\nThe prosecutor did not say when the alleged transaction by Guzmán took place. Earlier this year, Guzmán was convicted in a US court and sentenced to life in jail.\n\nAccording to Mr Richman, Tony Hernández, a former congressman, was part of a \"state-sponsored organisation\" that distributed cocaine in the US for years, and that corrupt \"mayors, congressmen, military generals (and) police chiefs protected\" him.\n\nMedia playback is unsupported on your device Media caption Why thousands are calling for President Hernández to step down\n\nSome of the cocaine he transported was said to have been labelled with his initials \"TH\".\n\nTony Hernández's lawyer, Omar Malone, said he was being targeted because of President Hernández's tough policies against criminals, including extraditing drug traffickers to the US.\n\nWhat's the background?\n\nPresident Hernández is facing growing calls to step down following the release of a court document linked to his brother's case. It alleged that his 2013 presidential campaign had been financed by drug money, labelling him as a co-conspirator.\n\nHe denies the claims. The president - whom protesters deride as a \"narco-dictator - was re-elected to a second term in 2017 in polls which his opponents said were fraudulent.\n\nMedia playback is unsupported on your device Media caption El Chapo trial: Five facts about Mexican drug lord Joaquín Guzmán\n\nHonduras is a major transit route for cocaine smuggled from Colombia and other South American nations to the US. Thousands of Hondurans have left the country in recent years, mainly for the US, because of violence and poverty.\n\nLast week, Honduras signed a deal with the Trump administration to accept migrants applying to asylum in the US.", "description": "US prosecutors claim the money was meant to reach President Juan Orlando Hernández himself.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/167E0/production/_109082129_4da483dd-80b3-406c-8365-6d14116dc566.jpg"}