{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3069619&cloc=joongangdaily|home|online", "downloaded_at": "2019-10-30 10:48:14.071611+00:00", "title": "Shinkai returns with ‘Weathering With You’", "language": "en", "text": "A scene from the film “Weathering With You” portrays a rainy Tokyo. [YONHAP]\n\nDirector Makoto Shinkai speaks at the press conference held in southern Seoul on Wednesday. [TOHO]\n\nPopular Japanese animation director Makoto Shinkai kept a promise that he made to his Korean fans three years ago to return to Korea with a new animated film. The movie, “Weathering With You,” is the highly anticipated follow-up to the 2016 smash hit “Your Name.”At a press conference held at Lotte World Tower on Wednesday, the director said that he has a special fondness for Korea because it was Korean audiences who were one of the first to recognize and praise his debut feature film, “The Place Promised In Our Early Days” (2004).“I still had a vivid memory of me receiving a prize for the film 14 years ago at the award ceremony held in Coex,” the director said. “I have always visited Korea each time I make a new film and have accumulated so many fond memories here, so Korea always has a special place [in my heart].”Although his works are animated fantasies, the director gets his inspiration from actual natural and social phenomena in Japan, which was also the case for his latest.“I have asked whether or not Korean audiences acutely feel the changes in climate as much as Japan does, but they told me no,” he said as he explained picking weather for his motive. “However, in Japan, there are many natural phenomena - such as the heavy downpour of rain that Tokyo is experiencing nowadays - that led people to worry about the drastic natural occurrences.”Unlike “Your Name,” the main characters in “Weathering With You” - Hodaka and Hina - live in relative poverty.“For ‘Your Name,’ I wanted the audience to yearn for this world, to make them want to live in such a place,” he said. “After three years however, I realized that the social atmosphere has changed. The young people living in contemporary society no longer wish or have a longing for extravagant and wonderful homes. They seem to give up hope from the very beginning and see those things as surreal. So I wanted to depict how the boy and the girl find joy despite their hardships and poverty.”Nevertheless, the director commented that the message of the film is neither constructive nor healthy.“What Hodaka does to save Hina may be illegal, bad and harmful to others,” he said. “But Hodaka runs toward Hina only for her, so he does choose Hina over sacrifice of the rest of Tokyo. But I don’t view Hodaka’s actions as selfish because what he does is to save the person that matters to him most.”The director realizes that the film’s ending may raise controversy, such as whether or not the sacrifice of one person for the greater good is worth it.“But I wonder whether the climate changes that the world is experiencing today is really any fault of the youth,” he said. “Adults and their ways of living life have caused these changes, so young people really have no responsibility over them. I wanted the characters to go in a different direction than what the adults want, leading them to make choices that the adults may not understand.”The film premiered in local theaters on Wednesday.BY LEE JAE-LIM [lee.jaelim@joongang.co.kr]", "description": "", "authors": [], "top_image": "https://pds.joins.com/jmnet/koreajoongangdaily/_data/photo/2019/10/30193834.jpg", "published_at": "2019-10-30"}