{"pub": "independent", "url": "https://independent.co.uk/news/business/comment/energy-bills-price-cap-uk-labour-government-save-a9158296.html", "downloaded_at": "2019-10-16 13:44:10.379508+00:00", "title": "Next Labour government will end profiteering by energy companies, saving families hundreds of pounds", "language": "en", "text": "From electricity and gas, to mobile phone contracts and council tax, it can feel like keeping track of bills is a job in itself. With many people across Britain working the longest hours on average of any country in Europe, it’s no surprise that nearly a quarter of us have never taken the time to switch our energy provider.\n\nThe Labour Party has long argued that the energy market, privatised by Margaret Thatcher in the 1980s, isn’t fit for purpose and we’re being ripped off. Sadly not a year goes by without new price hikes and over-charging, especially for those consumers who aren’t diligently hunting around for a new deal.\n\nIt’s shameless profiteering like this that has led to more than one in 10 UK households being in fuel poverty and more than half of all UK adults stating that money worries are affecting their mental health.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThat’s why in 2017 we proposed an “emergency price cap” to keep annual energy bills below £1,000. This would have provided some short-term relief for hard-working bill-payers while we brought in long-term changes to fix our broken privatised market.\n\nThe Tories had to be dragged kicking and screaming into admitting there was a problem. They did, in the end, promise to bring in their own energy price cap. This promise was followed by 18 months of dither and delay, giving energy companies the time to hike bills up a record number of times. So by the time the Tories finally brought their price cap in at the start of this year, the energy companies had successfully protected their margins by pushing up the average dual-fuel bill and therefore the level of the cap as set by Ofgem.\n\nShape Created with Sketch. Energy saving options in pictures Show all 4 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Energy saving options in pictures 1/4 Nest Thermostat merges cool tech with neat design 2/4 Swan has launched a halogen oven which promises faster cooking as well as energy saving and health benefits 3/4 Duette blinds have a climate control insulating action so rooms stay cool in the summer months and warm in the winter 4/4 Rainshower has a button on the handle that can be pressed to reduce the water used by 40% 1/4 Nest Thermostat merges cool tech with neat design 2/4 Swan has launched a halogen oven which promises faster cooking as well as energy saving and health benefits 3/4 Duette blinds have a climate control insulating action so rooms stay cool in the summer months and warm in the winter 4/4 Rainshower has a button on the handle that can be pressed to reduce the water used by 40%\n\nWhat’s even more absurd is that even after all this, the first cap introduced in January – designed to save customers £76 a year – was increased by £117 just four months later in April. The cap is now set at £1,254 for customers on regular tariffs.\n\nHad the cap been introduced at the lower level, proposed by Labour, immediately after the 2017 election, the 11 million households currently on the default cap would have saved over £600 each so far.\n\nTo add insult to injury, it’s recently been reported that senior industry figures have been lobbying Boris Johnson to scrap even the existing higher cap entirely (see, for example, outgoing Centrica CEO Iain Conn on the Today Programme).\n\nCompare that with the agenda of the next Labour government: we’ll end the privatisation racket, taking the National Grid into public ownership and fundamentally reforming the energy market to bring bills down for British households.\n\nThat’s the choice facing voters: a Tory government that’s in the pocket of the big energy companies, or a Labour government led by Jeremy Corbyn that will stand up for you and your family.\n\nRebecca Long Bailey is Labour’s Shadow Business Secretary", "description": "From electricity and gas, to mobile phone contracts and council tax, it can feel like keeping track of bills is a job in itself. With many people across Britain working the longest hours on average of any country in Europe, it’s no surprise that nearly a quarter of us have never taken the time to switch our energy provider.", "authors": ["Rebecca Long Bailey"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/07/31/19/energy-stock.jpg", "published_at": "2019-10-16"}