{"pub": "axios", "url": "https://washingtonpost.com/business/2018/08/10/trump-is-mad-that-turkeys-economic-crisis-has-made-their-currency-weaker-so-now-hes-making-it-even-weaker", "downloaded_at": "2019-10-07 19:58:10.190132+00:00", "title": "Trump is mad that Turkey’s economic crisis has made their currency weaker, so now he’s making it even weaker", "language": "en", "text": "AD\n\nIt all started with Turkey’s own mistakes — or, more accurately, with Turkish President Recep Tayyip Erdogan’s. He subscribes to the completely backward theory that lower interest rates cause lower inflation, which, now that he’s given himself the power to pick the country’s top central banker and made his son-in-law the finance minister, is actually being put to the test. Spoiler alert: It is not going well. The predictable result is this has made inflation get out of control — it is up to 15.9 percent when they are supposedly trying to keep it to 5 percent — because the central bank has been so slow to raise rates, and, in fact, refused to do so at its most recent meeting.\n\nAD\n\nFar worse than that, though, is this has also sent Turkey’s currency on a downward spiral that threatens to destroy its entire economy. Why is that? Well, there are three things to understand. The first is Turkey needs to borrow a lot of money from overseas; the second is the Federal Reserve’s rate hikes have made holding money in the United States attractive enough that it is hard for Turkey to get what it needs without sweetening the pot for investors by raising rates itself; and the third is, as a result of all its past borrowing, Turkey has foreign currency debts equal to 30 percent of its economy. Put these all together, and you get a pretty classic emerging markets crisis: Money has been leaving Turkey because it can now get good enough returns elsewhere, which is then pushing down the value of their currency so much that their dollar debts are getting harder to pay back. Indeed, through Thursday, the Turkish lira had lost 32 percent of its value against the dollar just since the beginning of the year. If it fell much further, it might push a lot of Turkish banks and businesses that had borrowed in dollars into bankruptcy — assuming they did not get bailed out first.\n\nAnd then it did on Friday.\n\nAD\n\nThis was really two stories. The first one was Erdogan gave a speech doubling down on his failed policies, saying once again all their problems were the result of an “economic war” being waged against Turkey. This, of course, was nonsense. While it was true U.S. sanctions on a few top Turkish officials over an American pastor being detained had put more pressure on the lira this past week, this was far from the main reason their currency has been falling so fast. Turkey has mostly done that to itself — until, that is, Trump started tweeting. He seems to see Turkey’s collapsing currency not as an existential threat to their economy they are trying to forestall, but rather as something they actively want to try to make their exports more competitive. And so he announced he is going to double the steel and aluminum tariffs on them to make up for the fact “their currency” has slid so “rapidly downward against our very strong Dollar!”\n\nAD\n\nThis had the opposite effect of what Trump intended. That is because a trade war would make it even harder for Turkey to get the dollars it needs, so the lira would be even less valuable. Which is why Trump’s tweet made it fall even further than Erdogan’s reality-starved speech had already made it. At one point, it was down as much as 19 percent on the day, before rallying a bit to bring it to “only” a 13.7 percent loss. Since the start of the year, it is now down a full 41 percent against the dollar. And it is not too far away from the level at which Goldman Sachs warned Turkey’s banks would run out of the extra capital they had built up as a buffer against a crisis.\n\nIt’d almost be funny if it were not so tragic. One economically illiterate leader is crippling his own economy and blaming everyone else for it, which then turned out to be partially correct when another economically illiterate leader decided to cripple their economy as payback for what they have done to themselves.\n\nIt is a Coen brothers-level farce the people of Turkey and every other emerging market that’s been caught up in what’s now a broader currency sell-off are not laughing at.\n\nAD", "description": "Turkey has hurt itself with bad policies and tried to blame foreigners for this fact, but then Trump seemed to vindicate the scapegoating by trying to bring the country’s economy down in retaliation for the Turks bringing it down themselves.", "authors": ["Matt O'Brien", "Reporter Covering Economic Affairs"], "top_image": "https://www.washingtonpost.com/resizer/wnAGA9dZ36WiIWFwAWIw6AJ_-po=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IOWX55HHGQI6PET244XKYHTTWY.jpg", "published_at": "2018-08-10"}