{"pub": "mirror", "url": "https://mirror.co.uk/travel/uk-ireland/england-named-one-worlds-best-20667173", "downloaded_at": "2019-10-22 13:35:14.462114+00:00", "title": "England named one of the world's best countries to visit in 2020 by Lonely Planet", "language": "en", "text": "Get the biggest Weekly Travel stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nEngland has been named one of the world's best countries that tourists need to visit for 2020.\n\nThe British hotspot's rich history, breathtaking countryside (and coast), and iconic landmarks from Stonehenge to Buckingham Palace - not to mention the incredible English Heritage sites to explore - have long established it as a tourist favourite.\n\nAs Hugh Grant famously pointed out in Love Actually, it's home to highlights including Shakespeare, Churchill, The Beatles, Harry Potter, David Beckham’s right foot - and David Beckham’s left foot.\n\nTherefore it's no surprise that England took second place in the top 10 list as part of Lonely Planet's annual Best in Travel round-up.\n\nIn fact, England wowed the panel of judges thanks to its \"timeless treasures\" such as the breathtaking castles and cathedrals to be found, the villages and the countryside.\n\nHowever, it's the iconic seaside (and the experience of tucking into fish and chips) which has seen England tipped to be a must-visit destination next year.\n\nIn fact, as the England Coast Path opens new sections in 2020, it will eventually become the longest continuous trail of its kind in the world, granting access to the country’s entire coastline for the first time.\n\n(Image: Getty Images)\n\nAccording to Lonely Planet, Northumberland's coast, the Norfolk Coast and the South West Coast Path are just some of the places visitors won't want to miss out on.\n\nAs for the country that pipped England to the post to be crowned the best to visit in 2020?\n\nBhutan was the winner, having long been a firm favourite with intrepid explorers thanks to its varied landscapes (think everything from mountains to picturesque rivers), as well as its breathtaking monasteries and fortresses.\n\n(Image: Getty Images/iStockphoto)\n\nBhutan was also the setting for Prince William and Kate Middleton's royal tour in 2016 where they met with royal couple King Jigme Khesar Namgyel Wangchuck and his wife Jetsun Pema, and also took on a gruelling six-hour trek to the Tiger's Next monastery.\n\nCheck out the full list of countries below...\n\nTop 10 countries to visit in 2020", "description": "England has been named one of the world's top 10 countries for 2020 by Lonely Planet", "authors": ["Julie Delahaye", "Image", "Getty Images", "Getty Images Istockphoto"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article11170773.ece/ALTERNATES/s1200/Woman-and-dog-walking-the-South-West-Coast-Path-above-The-Rumps.jpg", "published_at": "2019-10-21"}