{"pub": "yahoo", "url": "https://finance.yahoo.com/news/spike-u-mortgage-activity-catches-110000241.html", "downloaded_at": "2019-10-18 11:20:33.014064+00:00", "title": "Spike in U.S. mortgage activity catches big banks flat footed", "language": "en", "text": "By Imani Moise\n\nOct 18 (Reuters) - A surge in U.S. mortgage applications has left Bank of America Corp, Wells Fargo & Co and other large banks scrambling to meet demand, leading to longer closing times and unhappy customers.\n\nThe industry has faced an unexpected swell of demand since the U.S. Federal Reserve began cutting interest rates in July, bankers and industry analysts said. Lenders do not have enough staff to process requests, due to years of job cuts when rates were rising, they said.\n\nBank of America, one of the largest U.S. mortgage originators, now takes 41 days, on average, to close a purchase loan, a person familiar with the matter said. Refinancing has climbed to 60 days, another source said.\n\nBoth are longer than the 30 days realtors and borrowers ordinarily expect to complete a loan, but sources inside the bank said timings are not out of line with rivals.\n\nReuters could not obtain Wells Fargo's average closing times, but a person familiar with its mortgage business said some loans were taking more than 120 days to close.\n\nWells Fargo spokesman Tom Goyda said the average closing time for purchase loans has remained stable this year but acknowledged the average closing time for refinance loans has increased.\n\nThe bank recently announced hiring plans to deal with the backlog.\n\n\"Wells Fargo Home Lending is working to provide a great experience for our customers and meet their expectations during this period of increased demand,\" Goyda said.\n\nGetting a mortgage is a notoriously complicated process, even when rates are stable and banks are amply staffed.\n\nBorrowers must provide reams of documents to meet standards set by banks and Fannie Mae and Freddie Mac, the government-backed providers of mortgage financing. They also need cooperation from lenders, realtors, appraisers and title companies.\n\nSudden spikes in demand can make matters worse.\n\nMortgage applications have increased most weeks since the Fed began cutting rates, according to a Mortgage Bankers Association index. Bank of America, Wells Fargo and JPMorgan Chase & Co reported big jumps in mortgage originations, of 26-58%, when reporting quarterly results this week.\n\nDonnie Keller, a real estate agent from Fort Worth, Texas, said he has had such bad experiences lately with Bank of America that he now cautions his customers against taking out a mortgage there. The bank's slowness has created headaches for borrowers, some of whom have lost out on dream homes, Keller said.\n\n\"They continue to over-promise and under-deliver,\" he said in an interview.\n\nHis frustrations echo complaints from half a dozen real estate agents in New York, New Jersey, North Carolina and California. They told Reuters delays in mortgage closings have hurt borrowers, highlighting Bank of America and Wells Fargo in particular.\n\n\"They have low interest rates, they get the buyers in and then they just completely destroy the deal,\" said Cara Campos, a realtor in Cherry Hill, New Jersey.\n\nThe problem is not lost on the banks.\n\nBank of America has begun hiring mortgage staff and extended its interest-rate lock period from 60 to 90 days, a person familiar with its mortgage business said. That \"lock\" guarantees a customer a certain price, even if rates fluctuate while a loan is being processed.\n\nWells Fargo raised its refinancing lock period twice this year before rates started dropping, according to internal memos. That time frame was at 120 days as of June.\n\nIn addition to hiring, the bank is offering underwriters unlimited overtime pay as an incentive to work through the backlog, a source in the business told Reuters.\n\nIts mortgage staffing is already up 10% from last year, Goyda said. The bank is now advertising more than 100 positions with \"mortgage\" in the title, according to business data tracker Thinknum.\n\nBanks may find it hard to accomplish mortgage-staffing goals because of a strong U.S. job market and the business' reputation for volatile employment.\n\nMortgage-loan officer applications fell 36% in the first quarter, according to the most recent data from the Conference of State Bank Supervisors. The number of people leaving the industry jumped 56%.\n\nLenders want to rely more on digital options to reduce staffing fluctuations and delays, much like non-bank rival Quicken Loans. Quicken has become the No. 2 U.S. mortgage lender in a little over a decade because of the ease with which borrowers can get loans processed quickly online. (http://reut.rs/21jMCEH)\n\nStory continues", "description": "A surge in U.S. mortgage applications has left Bank of America Corp, Wells Fargo & Co and other large banks scrambling to meet demand, leading to longer closing times and unhappy customers.  The industry has faced an unexpected swell of demand since the U.S. Federal Reserve began cutting interest rates", "authors": ["Imani Moise"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-18"}