{"pub": "euronews", "url": "https://euronews.com/2019/10/09/why-the-eu-growing-its-own-soybeans-could-prevent-fires-in-amazon", "downloaded_at": "2019-10-09 18:40:59.987685+00:00", "title": "Why the EU growing its own soybeans could prevent fires in Amazon", "language": "en", "text": "Producing soybean on European soil instead of importing it from countries like Brazil would, according to French President Emmanuel Macron, help in the fight against Amazonian deforestation.\n\nWhy? What role can Europe play? What are the solutions? Euronews takes a closer look at Europe's dependence on soybean imports and the environmental impact.\n\nEuropean farmers relying on imported soybeans\n\nEvery morning, Alexandre, a farmer in France's Auvergne region, gives his livestock hay and then a mix of cereals and leguminous plants of which 10% is soybean, mostly imported from Brazil.\n\nThis soybean is \"probably genetically modified (GMO),\" according to the farmer. \"In theory, it's not\", he added, but in practice, \"we predominantly import GMO soybean from Brazil and the US to feed livestock\".\n\nFor Alexandre, Europe needs to \"give itself the means to develop a non-GMO\" sector because \"it's an economic seed, with a reasonable price\".\n\n\"Furthermore, it has a high protein level which allows for a rapid fattening of animals that is not negligible,\" he added.\n\nAlexandre is far from the only European farmer to rely on soybean.\n\nEvery year, 33 million tonnes of soybeans are imported into the Old Continent, mostly from Brazil and the United States.\n\nTo meet this demand and that of China — the world's biggest importer of soybean — some Brazilian farmers have burnt forest plots to cultivate them, thus contributing to the deforestation of the world's largest rainforest.\n\nThis year, the number of forest fires in Brazil have soared, The scale of the damage grabbed the world's attention and put the issue high up on the agenda of the G7 meeting in August leading to diplomatic tensions between the French leader and his Brazilian counterpart Jair Bolsonaro.\n\nMacron, who invoked France's \"share of responsibility\" for the deforestation of the Amazon rainforest, called on Europe to regain sovereignty over the production of plant-based proteins.\n\nBut to produce enough soybean to match its needs, Europe would need about 15 million hectares, which would amount to \"Austria, Belgium and Slovenia combined,\" according to Marco Contiero from Greenpeace Europe.\n\nWhy does Europe import soybeans?\n\nEurope's reliance on imports dates back to the 1960s and international trade agreements which capped the surface dedicated to cultivating soybean in Europe to concentrate on other cereals instead.\n\nAccording to COPA-COGECA, a powerful federation of agricultural associations based in Brussels, these agreements raise questions about health standards.\n\n\"We cannot import food, agricultural products that do not meet our European requirements,\" Pekka Pesonen, COPA-COGECA's secretary-general, told Euronews.\n\nStill, soybean is increasingly grown in France and the total area cultivated has almost tripled between 2010 and 2017.\n\nMeet a soybean grower in France\n\nNear Chalon-sur-Saone, Lionel has been growing soybeans for more than 10 years but continues to produce other grains to be profitable.\n\nAccording to him, producing soybeans on these lands has several benefits for the environment and for soil conservation which make French soybean more ecological than its Brazilian equivalent.\n\n\"We use fewer inputs, no insecticides, and it's not GM soy,\" he explained.\n\nHe now wants the European Union to provide more resources to develop this \"made in France\" industry and the issue is expected to be on the agenda of the next European Commission.\n\nBut if no long-term solutions are found to reduce European soybean imports, one solution might be to eat less meat. According to Greenpeace, \"the livestock sector — raising cows, pigs and chickens — generates as much greenhouse gas emissions as all cars, trucks and automobiles combined.\"\n\nIn France, the consumption of meat products has already fallen by 12% in 10 years, according to a study by Crédoc. But it is still far from being a European trend on all types of meat.", "description": "Every year, 33 million tonnes of soybeans are imported into the Old Continent, mostly from Brazil and the United States.", "authors": ["Guillaume Petit"], "top_image": "https://static.euronews.com/articles/stories/04/21/76/46/1000x563_cmsv2_6a93e374-898c-5ad9-8272-7dafb32b1508-4217646.jpg", "published_at": "2019-10-09"}