{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-next-results/warm-weather-gets-nexts-autumn-off-to-disappointing-start-idUKKBN1W40JN", "downloaded_at": "2019-09-19 09:38:56.096401+00:00", "title": "Warm weather gets Next's autumn off to disappointing start", "language": "en", "text": "LONDON (Reuters) - Clothing retailer Next made a “disappointing” start to autumn trading which it said was down to unusually warm British weather, rather than uncertainty over Britain’s EU exit.\n\nFILE PHOTO: Shoppers pass a branch of Next retail in London, Britain, September 15, 2016. REUTERS/Toby Melville/File Photo\n\nNext shares were down 4.1% at 0751 GMT on Thursday, paring the stock’s gains for the year so far to 48.2%, after the gloomy assessment of the first few weeks of the autumn season.\n\nWhile it did not give figures, Next said “the warm start to September has done much more to hinder sales than the political temperature” and it has not seen any evidence that shoppers are holding back on small ticket price items due to Brexit.\n\nBritain is due to leave the European Union on Oct. 31, but the government has yet to agree a new deal, increasing the risk of a disorderly “no-deal” Brexit.\n\nNext believes Brexit will only materially affect consumer spending in the event that it triggers inflationary pressure on prices or logistical problems at British ports.\n\nThe retailer also reported a 2.7% rise in first-half profit as robust online sales more than offset a decline at its stores and it maintained its forecast for the full 2019-20 year.\n\nSTORES PROFITABLE\n\nNext, which trades from about 500 stores in the UK and Ireland, about 200 stores in 40 countries overseas and its Directory online business, made a pretax profit of 319.6 million pounds in the 26 weeks to end-July.\n\nThis was up from 311.1 million pounds in the same period last year, on group sales up 3.7% to 2.06 billion pounds.\n\nFull-price sales at Next’s stores fell 3.9% in the period, but they were up 11.9% online, starkly illustrating the clothing industry’s structural shift from physical stores to online.\n\nHowever, the firm says its stores will remain profitable even if they become less productive.\n\nFor 2019-20 Next foresees full-price sales up 3.6% and pretax profit of 725 million pounds, a 0.3% rise on the 2018-19 outcome, with earnings per share growth of 5.2%, reflecting share buybacks.", "description": "Clothing retailer Next made a \"disappointing\" start to autumn trading which it said was down to unusually warm British weather, rather than uncertainty over Britain's EU exit.", "authors": ["James Davey", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190919&t=2&i=1431506210&w=1200&r=LYNXMPEF8I0DR", "published_at": "2019-09-19"}