{"pub": "japantoday", "url": "https://japantoday.com/category/national/hog-cholera-vaccination-may-begin-in-japan-later-in-oct.", "downloaded_at": "2019-10-12 00:21:59.264857+00:00", "title": "Hog cholera vaccination may begin in Japan later in Oct", "language": "en", "text": "Vaccination of pigs in areas of Japan with confirmed cases of hog cholera could commence later this month after a panel of experts approved revised vaccination guidelines, a step necessary for inoculation.\n\nWith Japan struggling to contain hog cholera infections that have resulted in over 140,000 pigs being culled over a year, farm minister Taku Eto is expected to endorse the guidelines soon, enabling 10 prefectures to commence vaccination.\n\nThe ministry had been cautious about vaccination due to the potential impact on pork exports.\n\nAfter inoculation, shipments of live animals and fertilized eggs to unvaccinated areas will be banned because it is difficult to differentiate vaccinated pigs from infected animals, according to the ministry.\n\nShipments of processed meat products will be unaffected.\n\nThe 10 prefectures are Aichi, Fukui, Gifu, Gunma, Ishikawa, Mie, Nagano, Saitama, Shiga and Toyama. Their governors will formulate programs specifying the quantity of vaccines and areas to be checked by the farm ministry before giving final approval.\n\nThe disease, also known as swine fever, only affects pigs and wild boars and has a high fatality rate. It does not affect humans, even if meat from an infected animal is consumed.\n\nThe experts at the Agriculture, Forestry and Fisheries Ministry also decided to boost inspections for African swine fever, which is spreading in Asia, allowing testing at the prefectural level.\n\nSo far, testing for the disease has only been conducted at state facilities.\n\n© KYODO", "description": "Vaccination of pigs in areas of Japan with confirmed cases of hog cholera could commence later this month after a panel of experts approved revised vaccination guidelines, a step necessary for inoculation. With Japan struggling to contain hog cholera infections that have resulted in over 140,000 pigs being culled over…", "authors": [], "top_image": "https://japantoday.com/images/japan-today-social.jpg", "published_at": "2019-10-11"}