{"pub": "cbs", "url": "https://cbsnews.com/news/patricia-heaton-new-cbs-series-carols-second-act-its-my-turn-2019-09-26", "downloaded_at": "2019-09-26 20:51:05.444993+00:00", "title": "With \"Carol's Second Act,\" Patricia Heaton is finally the star", "language": "en", "text": "Patricia Heaton is finally number one on the call sheet. The veteran actress who's perhaps best known for her Emmy-winning portrayal of Debra Barone in the sitcom \"Everybody Loves Raymond\" is returning to CBS as the star of the new comedy \"Carol's Second Act.\"\n\n\"When I did 'Raymond,' Ray was number one on the call sheet. He came out and grabbed the mic and talked to the audience. Then I did a show with Kelsey Grammer and he was the one that came out and grabbed the mic and talked to the audience. So, it's my turn,\" she told \"CBS This Morning.\"\n\nHeaton, who is also the executive producer of the show, plays Carol Kenney, a divorcee in her fifties who pursues her dream of becoming a doctor.\n\n\"First and foremost, I like to make people laugh. So, that's the main goal of the show. But I think a message that I hope gets across is not just for women but men also of a certain age. We bring experience to life, having raised kids and had careers and had losses in our life and come through losses and that's an important thing to convey to the generations below you,\" she said.\n\nFor Heaton, the role matched up perfectly with her own phase in life.\n\n\"I felt like as an actor you want to stretch but play reasonably within your essence. So this is perfect because I'm an empty nester,\" Heaton said. \"So I related to Carol on that level, that she's doing something different. It's new for me to be executive producing. So there were a lot of things I related to. Now I get to explore this phase of my life.\"\n\n\"Carol's Second Act\" premieres Thursday night at 9:30 ET/8:30 CT on CBS.", "description": "\"Everybody Loves Raymond\" is returning to CBS as the star of the new comedy \"Carol's Second Act.\"", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/09/26/a32b7488-9418-4c04-83d4-257b828aa6e3/thumbnail/1200x630/c889e4eda7b01629a049d84e8cd7606e/0926-ctm-patriciaheaton-heaton-1941059-640x360.jpg", "published_at": "2019-09-26"}