{"pub": "nytimes", "url": "https://nytimes.com/2019/09/20/opinion/trump-whistle-blower.html", "downloaded_at": "2019-09-20 22:46:22.949388+00:00", "title": "Opinion | Why the Whistle-Blowing Process Is Breaking Down", "language": "en", "text": "The whistle-blower protection law applicable to intelligence agencies, enacted 20 years after FISA, tries to split the same difference. It empowers whistle-blowing within the intelligence community, but imposes more constraints than any other federal whistle-blower law, including limiting the eventual disclosure of a complaint to the congressional intelligence committees rather than to all of Congress (or the public). The idea animating the statute is that there will be proxies standing in for the role the public usually plays — the inspector general, who receives and reviews the complaint; and the intelligence committees, who, if necessary, can act upon it.\n\nThat process seems to have broken down in this case because, for the first time in the 21-year history of the statute, the executive branch has refused to forward to the intelligence committees a complaint that the inspector general (who, although it shouldn’t matter, was appointed by President Trump) determined to be “credible.” The argument is not, apparently, that the complaint is protected by some kind of constitutional privilege; rather, the government is arguing that the (acting) director of National Intelligence is allowed to override the inspector general’s determination on the merits — and, in such a case, to decline to transmit the inspector general’s findings to Capitol Hill.\n\nThis argument flies in the face of the plain text, structure and purpose of the law — the whole point of which is to remove the intelligence community’s political leadership from having a say over whistle-blower complaints. Indeed, it wouldn’t make much sense to allow intelligence community employees to blow the whistle on their superiors if the superiors get to take the whistle away.\n\nAnother problem , though, is another provision of the law, which provides that “an action taken by the director or the inspector general under this paragraph shall not be subject to judicial review.” In other words, the statute explicitly cuts courts out of the loop — at least largely to prevent a dispute sure to involve highly classified information from seeping into the public domain of the regular federal courts. In practice, that means that, if the intelligence committees and the executive branch disagree about the latter’s disclosure obligations (as they do here), even when the inspector general finds a complaint to be “credible,” we hit a legal impasse.\n\nThe grand bargain has largely held for four decades in part because legal impasses don’t have to become political impasses. Sure, the intelligence committees have sometimes fallen short, but there have also been powerful moments in which those members of Congress have provided critical oversight of the executive branch — including the Senate Intelligence Committee’s yearslong study of C.I.A. abuses of detainees after Sept. 11. In those contexts, the oversight function has been pitched as institutional, not partisan: Congress versus the executive branch, not Adam Schiff versus President Trump.", "description": "The separation of powers has become increasingly subservient to the separation of parties.", "authors": ["Stephen I. Vladeck"], "top_image": "https://static01.nyt.com/images/2019/09/20/opinion/20vladeck/20vladeck-facebookJumbo.jpg", "published_at": "2019-09-20"}