{"pub": "guardian", "url": "https://theguardian.com/books/2019/sep/04/lives-of-lucian-freud-youth-1922-1968-william-feaver-review", "downloaded_at": "2019-09-04 08:06:32.651711+00:00", "published_at": "2019-09-04", "title": "The Lives of Lucian Freud by William Feaver review – youth: 1922-1968", "language": "en", "text": "Lucian Freud painted very, very slowly, requiring sitters to commit themselves to examinations that went on for hundreds of hours. In everything to do with making and looking at art, he proceeded fastidiously (a word he liked), with utmost patience and seriousness. In ways he generally declined to interrogate (“I don’t do introspection”), this epic care was vitally related to the rapid abandon with which he ransacked his world for experience. The slow painter was in love with quickness and with risk. He lived with an improvisatory recklessness he would never have allowed himself in a brushstroke.\n\nWilliam Feaver has been thinking about this life for decades. A series of interviews in the 1990s grew into a settled rhythm of telephone calls “most days”. Freud (who died in 2011, aged 88) didn’t want a biography published in his lifetime; for one thing, he liked to be furtive, not accounted for. But he chose to talk amply with Feaver, whose future book he preferred to call “a novel”. Feaver was more interested in getting things down than making them up; with dictaphone stretched to the limits, he had the most superlative material – and he was bound to it. Large tracts of what we have here are Freud by Freud.\n\nThe first of two volumes, Youth begins with a jokily assertive boy in Berlin, and ends with a painter nearing his 50s, dedicating himself more than ever to his art. In between, it covers the enforced move to England in 1933, swaggering teenage arrival on the Soho club scene, art school in Suffolk, an adventure in the merchant navy, two marriages, much “getting up to things to do with girls”, at least four “broods” of children, and many transits in the Bentley between low-life dives he loved in Paddington and high-life parties with Princess Margaret and debutantes he might take to Annabel’s.\n\nFacebook Twitter Pinterest Freud with Caroline Blackwood in 1953, Photograph: Ullstein Bild/ullstein bild via Getty Images\n\nAs a schoolboy at Bryanston he was already unruly, magnetic and doing detestable things. Refusing to make his bed (a maid’s job), he inspired other boys to follow his lead. He “positioned himself as a non-starter” in lessons and went off to ride horses and draw. Neither Freud nor Feaver go looking for causes; both avoid the methods of grandfather Sigmund. Embarked spectacularly on being himself, the question of what he could do, each moment, in each unfolding situation, seems always to have gripped Freud more than why.\n\nHe discovered that he could do anything he desired. The force of his vitality drew people to him and put him in control. He would get the girl he wanted for the night even if it meant setting the Paddington toughs on her boyfriend. (The artist Joe Tilson, for this reason, was thrown down the stairs.) Guilt did not interest or waylay him. Shutting out his mother, whose devotion he did not want, was apparently no cause for compunction but simply what he needed to do.\n\nHis driving was dangerous and he kept it that way, impatient with any notion of safety. After hitting an ambulance at Hyde Park Corner, convictions accrued as the accepted cost of joyrides. When he gambled (horses, dogs, dice), the stakes were high; he had no interest in a flutter. He wanted “to change things with the bets”, he told Feaver: “either be dizzy with so much money or otherwise not have my bus-fare”. In horror, always, of middle-class security, he courted trouble that would put him on his mettle. He chose the company of fraudsters and burglars, whose resourceful gumption commanded his affection and respect.\n\nGreedily appreciative of “characters”, hungry for crooks, beauties and heiresses, he arranged his own version of la comédie humaine. He always had time for Balzac, and felt affiliation with Henry Mayhew and Henry James. Yet for all the sense of panorama, the intensity he needed was bred in close quarters. He painted what occurred between the bed and the window in cramped hotels and between four walls at Delamere Terrace by the Grand Union Canal.\n\nPainting was the thing that could not be two-timed, paid off or made to wait. As he refined his meticulously graphic style, he made pictures unlike anything by his contemporaries or in the history of art. Zebra-long lashes rimmed saucer eyes; clothes asserted themselves more insistently than the drapery of saints in Memling or Van Eyck. Then he loosened his brushstrokes, confounded his admirers, and made something new again, painting sagging, changeable, feeling flesh. In superlative accounts of the pictures, Feaver articulates their trapped, pinioned force: the couch in The Painter’s Room standing daintily like a foal; Harry Diamond “aggressively bewildered”, squaring up to the palm tree in Interior at Paddington; Freud’s “burnishing of perspicacity” in a portrait of Peter Watson; his wife Kitty a nervous effigy in Girl with a White Dog – “This is an ordeal.”\n\nFacebook Twitter Pinterest Man with a Thistle (1946). Photograph: Anton Novoderezhkin/Tass/Getty Images\n\nHotel Bedroom was painted in Paris after marrying Caroline Blackwood, but that too was an ordeal. Finding the tie of wedlock off-putting while on honeymoon, Freud took up again with a former lover. “It was not a domestic life,” Feaver offers. A brief attempt at establishing a marital home in Dorset looks, at least in retrospect, absurd. Freud spent a few distracted evenings at a Blandford Forum drinking club, went riding at night, and returned to London, leaving the housekeeper weeping at the treatment of “poor Lady Caroline”. He was not offering monogamy, and most of the women who wanted him knew the deal. The ruthlessness was part of what drew them, though their voices are hard to catch here as Freud talks on.\n\nThere were many abortions and many children. He acknowledged 14 and knew there were others he hadn’t “come across”. Some, at least, he was legally bound to support, and how could he afford it? The very question feels wrong-headed in the face of Frank Auerbach’s view: “In a sense, his was a religious faith that these babies would be all right.” They were not all all right, but we don’t hear much about them. Since most of the children were marginal to Freud’s life, they appear here only fleetingly. A few fragments float on the page. One of his sons gets two lines: “He and Suzy took the baby Ali on a trip to the Scillies once, by air. ‘Flying over you could see the dolphins.’”\n\nFeaver lets non-sequiturs produce their own effect. There’s some fine judgment in the way he does this. Early on, I puzzled at the disparate events held together in paragraphs. In the teeming chapters of incident I kept expecting the arrival of a controlled narrative, questions posed and resolved, significant others brought sharply into focus. This biography does not work like that. So what is Feaver doing?\n\nIn a memorable 2013 essay, Julian Barnes discussed Freud as an “episodicist” for whom “one thing happens and then another”. His was not a linear view of life, concerned with connections and continuities. To an extreme extent, he acted on impulse, barely connecting one moment with the next. Every page of this volume affirms the distinction. No course of action on a Saturday (even marriage) affected his choice of what to do on Tuesday and Wednesday. Feaver replicates this episodicism in telling the life story. This is Lucian Freudian biography, packed with momentary stories and fundamentally resisting narrative.\n\nAs for Freud in his long “youth”: readers will reach their own views about the monstrous selfishness of the artist whose art is nonetheless a kind of gift. Feaver won’t tell you what to think about it. To keep admiring the pictures and overlook the worst offences is no answer: better look long and hard. The life, like the art, may make you question what you know about the basic contracts of living.\n\n• The Lives of Lucian Freud is published by Bloomsbury (£35). To order a copy go to guardianbookshop.com or call 0330 333 6846. Free UK p&p over £15, online orders only. Phone orders min p&p of £1.99.", "description": "Lucian Freud lived recklessly and selfishly – and made paintings unlike anything in the history of art", "authors": ["Alexandra Harris"], "top_image": "https://i.guim.co.uk/img/media/8df31d3974133b2c30c31b61b7056a62ae5e5fa0/1573_296_3697_2219/master/3697.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f660590ab1a6d00dd19b418c3b49c8ee"}