{"pub": "hotair", "url": "https://hotair.com/headlines/archives/2019/09/emoluments-clause-meaningless", "downloaded_at": "2019-09-17 00:55:33.560738+00:00", "published_at": "2019-09-17", "title": "The emoluments clause is meaningless", "language": "en", "text": "The ban on titles of nobility was included to distinguish the United States philosophically from the European monarchies; the prohibition of their acceptance was more practical, a shrewd response to the historical problem of courts like that of King Charles II being filled with pensioners of the French government. How we prevent something like this from taking place now, when, in a very real sense, virtually every living American who owns stock is a Chinese pensioner, is difficult to say. But legally preventing them from being named Duhu of the Western Regions is probably not the most pressing issue.\n\nWhich brings us back to the absurd claim that, because he owns hotels at which, among many thousands of other paying guests, foreign businessmen and diplomats have been known to stay, Trump has violated this all-important constitutional dictum. What in the world have his businesses got to do with the foreign emoluments clause? So far as I am aware, Russian oligarchs at Mar-a-Lago present their credit cards, not offers of baronetcy or a Russian Social Insurance card or forms to register as a candidate for the next Duma election. An “emolument” is “any perquisite, advantage, profit, or gain arising from the possession of an office.” Any profits arising from guests staying at Trump’s properties arises, one would think, not from the fact that he has held the office of the presidency for three years but from the rather longer standing one that he owns luxury hotels. (Bill Clinton on the other hand was somewhat newer to the hospitality business when he allowed his most generous financial supporters to rent out the Lincoln Bedroom.) The argument is risible on its face.", "description": "", "authors": ["Matthew Walther", "Theweek.Com Articles Emoluments-Clause-Meaningless"], "top_image": ""}