{"pub": "independent", "url": "https://independent.co.uk/extras/indybest/christmasgifts/advent-calendars/best-vegan-advent-calendar-chocolate-beauty-uk-a9116946.html", "downloaded_at": "2019-09-23 17:29:00.179050+00:00", "title": "10 best vegan advent calendars so you don't have to miss out", "language": "en", "text": "With December now just around the corner (yes, that is right), there’s nothing quite so exciting as counting down to the big day with an advent calendar.\n\nBeing vegan or dairy-free doesn’t mean you have to miss out on the festive fun either, since there’s now plenty of vegan advent calendars just waiting to be opened.\n\nWhether you’re looking for a luxury option to lure you out of bed on a cold winter’s morning or a fun kid’s design to make sure your little one doesn’t miss out, we’ve got you covered.\n\nWe’ve tested a range of different vegan options-including chocolate, sweets, beauty and toy-themed calendars-and rated them for their design, variety of products, value for money, taste and vegan credentials.\n\nHere’s our hand picked selection of our favourite vegan advent calendars.\n\nYou can trust our independent reviews. We may earn commission from some of the retailers, but we never allow this to influence selections, which are formed from real-world testing and expert advice. This revenue helps to fund journalism across The Independent.\n\nDivine dark Chocolate advent calendar: £5, Ocado\n\nDivine’s Dark chocolate range is perfect for vegans and their festive range (which includes dark chocolate coins and a dark chocolate bar with clementine) doesn’t disappoint. For those who prefer traditional dark chocolate (rather than milk alternatives), this is our top pick. The gold and red design is beautifully festive and the calendar itself has an animal theme: behind each window is an animal fact and each piece of deliciously rich dark chocolate is shaped as a woodland creature.\n\nThe 70 per cent cocoa content and the fact the chocolate has six ingredients shows: the chocolate feels luxurious without being too sweet (and avoiding the slightly synthetic test some alternative chocolates have). What’s more, Divine’s ethics are equally impressive: the chocolate is palm oil free and they work with family farmers in Ghana; who co-own the business and receive a share of the profits.\n\nBuy now\n\nThe Pip Box cruelty free beauty advent calendar 2019: £75, The Pip Box\n\nGone of the days where advent calendars are only for chocoholics, now beauty advent calendars are just as popular. With many vegans equally concerned about sourcing both vegan and cruelty-free beauty products, this advent calendar offers the perfect solution.\n\nThis calendar offers excellent value for money (it might be £75 but when you add up the items in the box, they’re worth more than £275!) and is a great way of introducing yourself to some fantastic vegan brands. With a mix of makeup (we love the smooth matte luxe lipstick by MEMI in particular; the perfect shade of festive red); pampering goodies (such as vegan sheet masks) and hair items (like Aveda’s thickness tonic); there’s real variety and nothing’s repeated since it features a whopping 21 different brands. It’s Winter Wonderland design with purple and silver hues make it a lovely addition to your dressing table too.\n\nPre-order now\n\nHotel Chocolat 100% dark chocolate advent calendar: £12.50, Hotel Chocolat\n\nThe health advantages of dark chocolate are plentiful (it’s high in iron and magnesium, for example) but to truly feel the benefit, you’ll need to tuck into something with a high concentration of cocoa.\n\nFor chocolate purists, it doesn’t get better than this: with a 100 per cent cocoa (from single origin Ecuadorian cacao) advent calendar. Its simple grey and silver book-style design contains 24 substantial sized chunks of dark chocolate (sculpted into festive designs such as a Christmas countdown, reindeer and angel).\n\nAt first bite, chocolate is rich and velvety but once chewed, the more savoury, bitter aftertaste emerges, which the calendar bills as “not for the faint-hearted”. It’s obvious the chocolate is of excellent quality but if you’ve got a sweet tooth, this one isn’t for you. However, if you enjoy a more intense blend and are looking for a more traditional, authentic dark chocolate, then give this a try.\n\nBuy now\n\nLivia’s advent calendar: £35, Livia’s\n\nLivia’s Kitchen is known for its range of naturally gluten-free, dairy-free and vegan indulgent treats, and now you can have one every day with their brand new advent calendar. Inside you’ll find a mix of favourites: such as its chewy, caramel-esque raw cookie dough nuggets, shortcake-style millionaire squares and “cookies and dip” snack pot. Vegans who are fed up of the same treats over and over will love the innovative nature of these snacks: the millionaire squares being particularly addictive! Given the smaller range of products, it’s worth noting there are some repetitions in this one but given how great these taste, we’ll doubt you mind.\n\nPre-order now\n\nMoo dairy free advent calendar: £4.99, Ocado\n\nKids with dairy allergies or following a vegan diet will love this fun organic advent calendar. It’s made with organic cocoa, organic raw cane sugar and organic rice powder; giving this chocolate a sweet, creamy-like taste than your little one will love (in fact, our testers couldn’t tell the difference between this chocolate and regular milk chocolate). The animal cartoon pattern (featuring Moo characters, Hammy and friends) will be a big hit with kids, while adults who aren’t dark chocolate fans will also be equally as pleased. What’s more, this calendar is also suitable for those who are gluten-free and soya free.\n\nBuy now\n\nPLAYin choc advent calendar: £55 Ocado\n\nPLAYin choc combines two of children’s favourite things: chocolate and toys.This one has impressive credentials: it’s made from biodegradable, recycled packaging; certified organic by the soil association and is both vegan and kosher. Opening each of the 24 drawers reveals three different treats: a fact card, a 3D cardboard puzzle (our mini tester loved constructing these but we also found it was a great mindfulness activity for adults too!) and a 10g chocolate.\n\nOf all the chocolate we sampled for this piece, we found this calendar’s offering to be one of our favourites. It’s smooth, extra creamy flavour comes from creamed coconut and coconut sugar and thanks to it being free from refined sugar, it didn’t taste overly sweet.\n\nHealth-conscious parents will be happy to let their children tuck into this one-since it only uses a handful of natural ingredients (cacao, coconut sugar, creamed coconut and vanilla) and avoids allergens such as soy or dairy.\n\nBuy now\n\nMontezuma Like No Udder advent calendar: £8.99, Ocado\n\nThis vibrant advent calendar is sure to catch little one’s eyes, along with the fun and festive colouring activity on the back of it. They’ll enjoy the chocolate that’s inside just as much: the soil association organic ingredients create a smooth, velvety milk-like chocolate that rivals Montezuma regular calendars. As well as being vegan, the calendar is also free from gluten, colourings and preservatives.\n\nBuy now\n\nSo Free white chocolate alternative advent calendar: £4.95, Plamil\n\nThis white chocolate advent calendar is a welcome change to the usual milk and dark chocolate vegan varieties on the market. Using cocoa butter, rice syrup powder, cane sugar and vanilla, it offers a decent alternative to white chocolate-although it might taste a little too sweet for some people’s palettes. Made with 100 per cent renewable energy, the calendar also comes with a “no nuts used” disclaimer too; making it ideal for parents of little ones with multiple allergies. And for less than £5, it’s a great budget option for those with a sweet tooth.\n\nBuy now\n\nCocoa Libre dairy free luxury advent calendar: £12, Yumbles\n\nThis luxury advent calendar is ideal for adult vegans wanting to treat themselves to some top-notch chocolate. The picturesque cityscape image will look beautiful on any mantlepiece, while we loved the extra-chunky chocolate pieces (that use rice milk to effectively replicate the taste of regular milk chocolate) that lay behind each door. These artisan chocolates are handmade in an allergen-free facility, meaning they’re also suitable for coeliacs and those with nut allergies.\n\nBuy now\n\nFunctional Food Co Nono Cocoa lux vegan limited edition advent calendar: £15.30, Yumbles\n\nThis calendar offers something completely different from other vegan advent calendars on the market. Firstly, are the ingredients: it uses raw, organic chocolate with a blend of powerful superfoods like baobab, D-mannosa, turmeric and pea protein to create a range of innovative chocolate flavours.\n\nThe bright colours and unusual shapes make each opening a real discovery and highlights, in particular, were the cinnamon apple (moulded to the perfect apple shape); mulled wine and the three-layered blue marzipan (don’t worry, the colours are completely natural). Not only will you be starting the day with a delicious healthy treat but you’ll also be supporting its #nonoexclusion policy; which offers employment to those with special needs and autism. If that wasn’t good enough, their products are free from all 14 allergies making this the perfect calendar for those with many dietary restrictions.\n\nBuy now\n\nThe verdict: Vegan advent calendars\n\nDivine’s dark chocolate advent calendar is our top choice for vegans: it offers great chocolate at a very affordable price; along with a high cocoa content and excellent fairtrade credentials. Should you want to splash out, we really enjoyed trialling PLAYin choc’s calendar; which offers fantastic chocolate with traditional puzzles that both adults and children will love. Finally, for something a little more grown-up, Nono Cocoa lux vegan is a great purchase: an innovative calendar with a ton of health benefits.\n\nIndyBest product reviews are unbiased, independent advice you can trust. On some occasions, we earn revenue if you click the links and buy the products, but we never allow this to bias our coverage. The reviews are compiled through a mix of expert opinion and real-world testing.", "description": "No one following a vegan or dairy free diet needs to miss out on daily treats with a vegan advent calendar from Hotel Chocolat, Ocado and Yumbles", "authors": ["Jenna Farmer"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/23/17/vegan-advent-calendars-indybest.jpg", "published_at": "2019-09-23"}