{"pub": "cbc", "url": "https://cbc.ca/news/canada/toronto/election-racism-analysis-1.5318768", "downloaded_at": "2019-10-15 12:27:43.018350+00:00", "title": "Why blackface didn't push racism onto Canada's election agenda | CBC News", "language": "en", "text": "Although the topic of racism has been a prominent and recurring theme in this federal campaign, there's little evidence the real issues facing racial minorities in Canada are on the election agenda.\n\nIt's a paradox, given key elements of this campaign leading up to the Oct. 21 vote.\n\nLiberal Leader Justin Trudeau was exposed for wearing blackface or brownface three times in his adult life. NDP Leader Jagmeet Singh is the first person of colour in Canadian history to run for prime minister.\n\nA new Quebec law bans people from wearing a hijab, turban or any other religious symbol while working in the province's public sector. People's Party of Canada Leader Maxime Bernier is campaigning on an end to what he calls \"mass immigration.\" And some of the most hotly contested ridings in this election are among the most ethnically diverse in the country.\n\nYet to people who work on improving the lives of Canadians in racialized communities, the debate remains superficial. They're calling for a much deeper look at what needs to be done to tackle the effects of racism on poverty, employment and the justice system.\n\n\"When I'm looking at the campaign and across the parties' platforms, I have to say I'm very disappointed the issues around racial justice [and] racial equity have not been addressed by any party in any substantive way,\" said Avvy Go, director of the Chinese and Southeast Asian Legal Clinic in Toronto.\n\nEven after Trudeau's repeated use of blackface years ago exploded into the spotlight early in the campaign, little changed, said Go.\n\n'I have to say I'm very disappointed the issues around racial justice [and] racial equity have not been addressed by any party in any substantive way,' says Avvy Go, director of the Chinese and Southeast Asian Legal Clinic in Toronto. (Susan Goodspeed/CBC)\n\n\"The focus with respect to that incident was whether Trudeau apologized for his racist act, as opposed to looking at the day-to-day systemic challenges and systemic racism faced by communities of colour and Indigenous people,\" Go said in an interview.\n\nShe wants political parties to move on from the blackface incidents — \"however repugnant and appalling\" — to focus on policy discussions and concrete actions to deal with discrimination and its impacts.\n\nSo why didn't that happen?\n\n\"Conversation about race is often difficult in Canada,\" said Go. \"A lot of Canadians still are not able to come to grips with the idea that there's a lot of racism in our country.\"\n\nDebbie Douglas, director of the Ontario Council of Agencies Serving Immigrants, agreed the campaign has failed to address issues of racism. Her theory is it's rooted in what she describes as a \"polite Canadian\" tendency to pretend that racism doesn't exist, and a misguided belief that talking about it would conjure racism into being.\n\nAli Manek, executive director of The Canadian-Muslim Vote, says no party leader has taken a strong stance against Quebec's religious symbols law, Bill 21. (Greg Bruce/CBC)\n\nAnti-racism groups have been trying to get the issues on the campaign agenda.\n\nThe Toronto-based Colour of Poverty Campaign issued a \"racial justice report card\" last week that examined the Liberal, Conservative, New Democrat and Green parties' platforms, and rated their positions on such issues as criminal justice, employment, immigration and poverty reduction.\n\nIt declared the leading federal political parties are not addressing the concern \"racial inequities are growing and deepening in Canada.\"\n\nIn a pre-election nationwide survey of Muslims, a group called The Canadian Muslim Vote found 79 per cent named Islamophobia as an important issue.\n\nLiberal Leader Justin Trudeau is shown in a 2001 photo published in the yearbook of West Point Grey Academy, a private school where Trudeau was teaching at the time. (Time.com)\n\n\"This election was an opportunity for our party leaders and all parties to address this and I don't think that it's been done in a way that's been satisfactory,\" said Ali Manek, the group's executive director. \"Overall, I've been disappointed.\"\n\nHe's also critical no leader has taken a strong stance against Quebec's religious symbols law, Bill 21.\n\n\"I think all parties have let down the Muslim community and ethnic communities tremendously by not addressing it more head on,\" said Manek.\n\nHe said he believes minority communities must get out and vote Monday at a better-than-average turnout rate to put pressure on the parties for change.\n\nAndray Domise, a writer and community activist in the Toronto area, says when it comes to how race and racism been addressed in the election campaign, the parties and most media have been too focused on 'spectacle' over substance. (CBC)\n\n\"I think that's a real message that we would be sending to the future prime minister of this country that we want a seat at the table and we want our issues to be addressed,\" he said.\n\nSo how have race and racism been addressed in the campaign?\n\n\"Laughably bad, just an all-around disaster from my point of view,\" said Andray Domise, a contributing editor for Maclean's magazine and a black community activist in the Toronto area.\n\nDomise said the parties and most media coverage have been too focused on \"spectacle\" over substance.\n\n\"The purpose of the campaign has been defeated because we're not talking about people's lives; we're talking about how much we like or dislike certain candidates,\" said Domise. \"I'm a lot more interested in structural matters, what is it that policy can affect, that can improve people's material lives.\"\n\nThere's a palpable sense of frustration and missed opportunity coming from everyone interviewed here. There's also a clear call for the parties to propose ideas to tackle the disproportionate rates of unemployment, poverty and incarceration on people of colour. But with just a week left in the campaign, there's little optimism that's going to happen.", "description": "Although the topic of racism has been a prominent and recurring theme in this federal campaign, there’s little evidence the real issues facing racial minorities in Canada are on the election agenda.", "authors": ["Provincial Affairs Reporter", "Mike Crawley Is Provincial Affairs Reporter In Ontario For Cbc News. He Has Won Awards For His Reporting On The Ehealth Spending Scandal", "Flaws In Ontario'S Welfare-Payment Computer System. Before Joining The Cbc In", "Mike Filed Stories Countries In Africa As A Freelance Journalist", "Worked As A Newspaper Reporter In B.C.", "Twitter"], "top_image": "https://i.cbc.ca/1.5289171.1568999202!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/justin-trudeau-brownface.jpg", "published_at": "2019-10-15"}