{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2016/jul/12/obama-admin-sent-taxpayer-money-oust-netanyahu", "downloaded_at": "2019-09-29 05:02:05.181908+00:00", "title": "Obama admin. sent taxpayer money to campaign to oust Netanyahu", "language": "en", "text": "The State Department paid hundreds of thousands of dollars in taxpayers grants to an Israeli group that used the money to build a campaign to oust Prime Minister Benjamin Netanyahu in last year’s Israeli parliamentary elections, a congressional investigation concluded Tuesday.\n\nSome $350,000 was sent to OneVoice, ostensibly to support the group’s efforts to back Israeli-Palestinian peace settlement negotiations. But OneVoice used the money to build a voter database, train activists and hire a political consulting firm with ties to President Obama’s campaign — all of which set the stage for an anti-Netanyahu campaign, the Senate Permanent Subcommittee on Investigations said in a bipartisan staff report.\n\nIn one stunning finding, the subcommittee said OneVoice even told the State Department’s top diplomat in Jerusalem of its plans in an email, but the official, Consul General Michael Ratney, claims never to have seen them.\n\nHe said he regularly deleted emails with large attachments — a striking violation of open-records laws for a department already reeling from former Secretary Hillary Clinton’s handling of official government records.\n\nMr. Netanyahu survived the election, and the U.S. spending was not deemed illegal because the State Department never put any conditions on the money. Investigators also said OneVoice didn’t turn explicitly political until days after the grant period ended.\n\n“The State Department ignored warnings signs and funded a politically active group in a politically sensitive environment with inadequate safeguards,” said Sen. Rob Portman, chairman of the investigative subcommittee. “It is completely unacceptable that U.S. taxpayer dollars were used to build a political campaign infrastructure that was deployed — immediately after the grant ended — against the leader of our closest ally in the Middle East. American resources should be used to help our allies in the region, not undermine them.”\n\nPHOTOS: Famous felons\n\nSen. Claire McCaskill, the ranking Democrat on the subcommittee, said the Obama administration followed the law.\n\nBut she said their investigation exposed “deficiencies” in the State Department’s policies.\n\nOneVoice had been politically active in Israel’s 2013 elections, which should have been a red flag to U.S. officials to put strict controls on how American taxpayers’ money was spent, the investigation said.\n\nWhile it wouldn’t have necessarily disqualified the group, the State Department should have written a specific prohibition against using American money to influence a foreign election, the subcommittee said.\n\nIt’s part of a pattern of bad behavior at the State Department. The Government Accountability Office reviewed more than five dozen department grants and found officials cut corners and missed red flags in 80 percent of them.\n\nThe Israeli Embassy didn’t respond to a request for comment on the findings.\n\nState Department spokesman John Kirby said they had not had time to go through the report and he couldn’t comment on it. He also didn’t comment on Mr. Ratney’s practice of deleting official records.\n\nThe Senate investigation found that the State Department funded two sister groups — OneVoice Israel and OneVoice Palestine — to hire a U.S. political consulting firm, recruit volunteers, build a social media network and run advertising.\n\nBut it was also building its anti-Netanyahu political strategy, at a time when the Israeli leader was quite controversial in U.S. politics, celebrated by Republicans but feuding with the Obama White House over differences in policy.\n\nOneVoice told at least two State Department officials of its political plans, even as it was collecting taxpayer money. But the department “took no action in response,” the subcommittee concluded.\n\nMr. Ratney, one of the two officials, said he remembered getting an email from OneVoice, but didn’t recall seeing the attached file detailing the group’s political strategy.\n\nThe State Department was unable to recover the email, but investigators got it from OneVoice.\n\nMr. Ratney later told investigators he regularly deleted emails with attachments “in order to maintain my inbox under the storage limit.” He told investigators he “did not know [he] was required to archive routine emails.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The State Department paid hundreds of thousands of dollars in taxpayers grants to an Israeli group that used the money to build a campaign to oust Prime Minister Benjamin Netanyahu in last year's Israeli parliamentary elections, a congressional investigation concluded Tuesday.", "authors": ["The Washington Times Http", "Stephen Dinan"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2015/03/15/Mideast_Israel_Netanyahu.JPEG-0f985_c0-77-5184-3099_s1770x1032.jpg?cac18ddb5b0bb5bc2c41b1e8e49196ca97ff8175", "published_at": "2016-07-12"}