{"pub": "cbc", "url": "https://cbc.ca/news/world/whistleblower-complaint-involving-trump-ukraine-released-1.5297833", "downloaded_at": "2019-09-26 14:54:22.663561+00:00", "title": "Whistleblower complaint at centre of Trump impeachment probe released | CBC News", "language": "en", "text": "A redacted version of a whistleblower complaint at the centre of an impeachment probe against U.S. President Donald Trump was released Thursday, and alleges Trump abused his office's power during a phone call with Ukraine's president.\n\nThe nine-page document was released ahead of testimony to House investigators from Joseph Maguire, the acting director of national intelligence, who had released the complaint to Congress and the public this week after weeks of delay.\n\nThe still-unnamed whistleblower, who filed the complaint on Aug. 12, said they were reporting an \"urgent concern\" regarding Trump's behaviour while on a phone call this summer with Ukrainian President Volodymyr Zelensky.\n\n\"I am deeply concerned that the actions described below constitute 'a serious or flagrant problem, abuse, or violation of law or executive order' that 'does not include differences of opinion concerning public policy matters,' consistent with the definition of an 'urgent concern,'\" the nine-page redacted report said, quoting the whistleblower in part.\n\nThe concerns cite Trump's July 25 call with Zelensky in which Trump prodded the Ukrainian president to investigate Democratic political rival Joe Biden, as being was part of \"ongoing concerns.\"\n\nIn the days following the phone call, senior White House officials intervened to \"lock down\" all records of the call, the report said.\n\nThe complaint said the whistleblower learned about the effort from \"multiple U.S. officials.\"\n\nThe whistleblower's statement also raises concerns about the role of Trump's lawyer, Rudy Giuliani, in seeking assistance from Ukraine to benefit the president's 2020 re-election campaign.\n\nIt suggests Ukrainian leadership was \"led to believe\" that a phone was conditioned on whether Zelensky \"showed willingness to \"play ball\" on issues raised by Giuliani.\n\nGiuliani had publicly stated his intention to secure from Ukraine derogatory information about Biden and his son Hunter.\n\nThe complaint also details concerns from U.S. officials about \"Giuliani's circumvention of national security decision making processes.\"\n\nTrump attacks report\n\nTrump quickly denounced the report, tweeting in all capitals only minutes after its release that:\n\nTHE DEMOCRATS ARE TRYING TO DESTROY THE REPUBLICAN PARTY AND ALL THAT IT STANDS FOR. STICK TOGETHER, PLAY THEIR GAME, AND FIGHT HARD REPUBLICANS. OUR COUNTRY IS AT STAKE! —@realDonaldTrump\n\nThe White House claims the complaint \"shows nothing improper.\"\n\nPress secretary Stephanie Grisham argued the complaint \"is nothing more than a collection of third-hand accounts of events and cobbled-together press clippings.\"\n\nGrisham said Trump released a rough transcript of his call with Zelensky on Wednesday \"because he has nothing to hide.\"\n\nShe said, \"The White House will continue to push back on the hysteria and false narratives being peddled by Democrats and many in the mainstream media.\"\n\nHowever, House Democrats who have read the document say it's \"deeply disturbing.\"\n\nIn opening Thursday's House intelligence committee session, chair Adam Schiff said Trump's actions as detailed read like \"a classic organized crime shakedown.\"\n\nSchiff said the whistleblower shows \"more of a dedication of country, more of an understanding of the president's oath of office, than the president himself.\"", "description": "A redacted version of a whistleblower complaint at the centre of an impeachment probe against U.S. President Donald Trump was released Thursday, and alleges Trump abused his office's power during a phone call with Ukraine's president. The nine-page document was released ahead of testimony to House investigators from Joseph Maguire, acting director of national intelligence.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5297209.1569441772!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/zelensky-biden-trump-composite.jpg", "published_at": "2019-09-26"}