{"pub": "cbc", "url": "https://cbc.ca/news/canada/toronto/osstf-strike-vote-1.5321343", "downloaded_at": "2019-10-15 16:51:41.903706+00:00", "title": "High school teachers' union beginning strike votes | CBC News", "language": "en", "text": "The union that represents secondary school teachers in Ontario says it is now beginning the process of conducting strike votes with its members across the province.\n\nIn a statement released Tuesday morning, Ontario Secondary School Teachers' Federation (OSSTF) president Harvey Bischof said the union has been dealing with months of delays and inaction by the province.\n\n\"The government claims that it wants to resolve these negotiations quickly, but from the beginning they have done nothing to help expedite the process, and now they are simply refusing to discuss substantive issues at the bargaining table,\" Bischof said. \"They delayed the start of bargaining by two months and have thrown procedural roadblocks in the way ever since.\n\n\"And so it was thanks to their incessant stalling and delay tactics that it took months for bargaining to get underway in the first place, and now that we are finally at the table they are simply refusing to engage in meaningful discussions about the most important issues. Through five days of bargaining they've brought absolutely nothing of substance to the table.\"\n\nBischof said voting will begin on Oct. 22 and finish on Nov. 15.\n\nEducation Minister Stephen Lecce said in a previous interview that his negotiation team will continue to meet with OSSTF.\n\n\"I have stated consistently for months now, I want to reach a deal that provides predictability and certainty to students, parents and educators,\" he said on Sept. 24.\n\nOSSTF has 60,000 members across the province, including public high school teachers, occasional teachers, educational assistants and more.", "description": "The union that represents secondary school teachers in Ontario says it is now beginning the process of conducting strike votes with its members across the province.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5278589.1568157985!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/harvey-bischof.jpg", "published_at": "2019-10-15"}