{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7602093/J-J-CEO-testified-Baby-Powder-safe-13-days-FDA-bombshell.html", "downloaded_at": "2019-10-23 17:27:39.084568+00:00", "title": "J&J CEO swore under oath Baby Powder was safe days before recall", "language": "en", "text": "Facing off against a plaintiff´s lawyer for the first time about Johnson & Johnson´s Baby Powder, the company´s Chief Executive Alex Gorsky earlier this month insisted that the company's iconic brand was safe.\n\n'We unequivocally believe that our talc and our baby powder does not contain asbestos,' Gorsky testified in an October 3 deposition in a case involving a retired Indiana college professor who alleges his cancer was caused by the Baby Powder he used for decades. The deposition has not been previously reported.\n\nGorsky, citing 'thousands of tests and studies' to support his testimony, said: 'I´m not aware of our baby powder or talc containing asbestos.'\n\nThat´s harder for him to say now. Last Wednesday, just 13 days after his deposition, the US Food and Drug Administration told the healthcare giant it had discovered asbestos, a known carcinogen, in a bottle of Johnson's Baby Powder.\n\nOn Friday, a day after getting the full FDA test results, J&J recalled 33,000 bottles of Baby Powder in the United States.\n\nIt marked the first time the company has recalled Baby Powder for possible asbestos contamination and the first time US regulators have announced finding asbestos in the product.\n\nA bottle of Johnson & Johnson's Baby Powder tested positive for asbestos, the contaminant blamed for causing mesothelioma and other cancers in over 15,000 lawsuits last week - less than two weeks after the company's CEO testified that the products are safe\n\nThe recall is the latest blow to a healthcare conglomerate that has for many years tried to project an image as a caring company.\n\nIt is now facing thousands of lawsuits over a variety of products, including legal action by more than 15,000 consumers claiming its talc powders caused their cancers.\n\nShares in J&J, which in February said it had received subpoenas from the US Justice Department and US Securities and Exchange Commission for documents related to the asbestos contamination allegations, dropped almost 6% on Friday after the recall was announced. The inquiries include a criminal grand jury investigation into how forthright J&J has been about the safety of its powders, according to people familiar with the matter.\n\nIn the deposition, Gorsky was pressed again and again to say - without qualification - that the company´s powders were asbestos free.\n\nBut in answering questions under oath for the first time in the talc litigation, he stuck to his statement that he 'believed' J&J´s powders were clean.\n\nThe FDA finding will make it much more difficult for Gorsky and the company to continue saying that they 'believe' the talc powders are free from asbestos, said Elizabeth Burch, a product liability expert at the University of Georgia School of Law.\n\nShe said the test result and recall lend credibility to what plaintiffs have been arguing in court for months.\n\nJ&J stands behind the safety of its talc and said it's investigating the FDA test result. The company said it proceeded with the recall 'out of an abundance of caution.'\n\nIn a statement on Sunday J&J said: 'Thousands of tests over the past 40 years repeatedly confirm that our consumer talc products do not contain asbestos, including prior tests by the FDA as recently as last month.'\n\nIn a written response to questions from Reuters on Monday, J&J added that Gorsky had no knowledge of the FDA finding of asbestos at the time of his deposition.\n\nThe company also said the FDA notified it on September 20 that a test of its Baby Powder did not find any asbestos.\n\nNeither had the regulator detected asbestos during testing in 2010 using the 'most sophisticated testing techniques available.'\n\nJ&J CEO MAY BE ASKED TO TESTIFY AGAIN IN LIGHT OF THE RECALL\n\nGorsky´s testimony echoed statements he made after Reuters on December 14 last year published an investigation that found J&J knew for decades asbestos lurked in its talc.\n\nInternal company records, trial testimony and other evidence show that from at least 1971 to the early 2000s, the company´s raw talc and finished powders sometimes tested positive for small amounts of asbestos, the Reuters investigation found.\n\nCompany executives, mine managers, scientists, doctors and lawyers fretted over the problem and how to address it, while failing to disclose it to regulators or the public.\n\nJim Kramer, the lawyer who deposed Gorsky this month, said he plans to ask the New York state judge in the case to allow him to question the CEO a second time in light of the FDA´s findings and the recall.\n\nJ&J declined to comment on the possibility of a second round with Kramer or about its legal strategy following the FDA test result.\n\nGorsky faces at least one more deposition, this one ordered by a Missouri judge for Baby Powder cancer cases pending in that state.\n\nThat has yet to be scheduled.\n\nTALC POWDERS ALMOST PULLED FROM PRODUCT LINE - BUT KEPT BECAUSE THERE WAS 'NO REASON TO DROP IT'\n\nIn his daylong videotaped deposition, Gorsky, a former Army Ranger, recounted his efforts to stem the growing controversy over one of the company´s signature products.\n\nSitting at the head of a conference table with the blinds drawn in the midtown Manhattan offices of a mediation firm, he testified that J&J considered dropping talc powders.\n\n'We had discussions internally along the way regarding should we leave ... talc on the market or not,' Gorsky said at the deposition.\n\nWHAT IS MESOTHELIOMA? Mesothelioma is a type of cancer that develops in the lining that covers the outer surface of some of the body's organs. It's usually linked to asbestos exposure. It mainly affects the lining of the lungs (pleural mesothelioma), although it can also affect the lining of the tummy (peritoneal mesothelioma), heart or testicles. More than 2,600 people are diagnosed with the condition each year in the UK. Most cases are diagnosed in people aged 60-80 and men are affected more commonly than women. Unfortunately it's rarely possible to cure mesothelioma, although treatment can help control the symptoms. The symptoms of mesothelioma tend to develop gradually over time. They typically don't appear until several decades after exposure to asbestos. Mesothelioma is almost always caused by exposure to asbestos, a group of minerals made of microscopic fibres that used to be widely used in construction. These tiny fibres can easily get in the lungs, where they get stuck, damaging the lungs over time. It usually takes a while for this to cause any obvious problems, with mesothelioma typically developing more than 20 years after exposure to asbestos. The use of asbestos was completely banned in 1999, so the risk of exposure is much lower nowadays. However, materials containing asbestos are still found in many older buildings. Source: NHS Choices\n\nIn the end, however, Gorsky said the company, which also sells Baby Powder made from cornstarch, stuck with talc because it was confident about its safety and because many consumers liked its feel.\n\n'We had the right testing procedures in place and so there was ... no medical reason or safety reason to withdraw it,' he testified.\n\n'There were in fact differences between cornstarch and talc-based baby powder in its feel, in its absorbency,' said Gorsky, who has been J&J's CEO since 2012.\n\nThe company 'felt it was important to have different options on the market based upon different consumer needs.'\n\nThe plaintiff´s lawyer pressed the 59-year-old Gorsky on his use of the word 'believe' when asked about asbestos in J&J's talc.\n\n'My follow up is,' Kramer said, 'can you not answer the question as I've presented it with a yes or a no?'\n\nGorsky, who said in the deposition he uses Johnson´s Baby Powder and had also used it on his son, didn´t budge. 'I did not personally conduct every single test. I can only ... gauge it based upon the data and totality that´s been presented to me.'\n\nIn its answers to Reuters questions on Monday, the company reiterated that 'Mr. Gorsky is not a scientist and did not conduct the tests. He therefore relies on others to advise him.'\n\nBefore the FDA test result, Gorsky´s focus on what he 'believed' to be true was helpful to J&J's legal position, said Andrew Bradt, a Berkeley Law professor at the University of California.\n\nMany state laws require plaintiffs to prove companies knew a product was defective, and if Gorsky had unequivocally said talc does not contain asbestos then opposing lawyers could seek to undermine his declaration by contrasting it with the results of tests J&J knew about over the years suggesting otherwise.\n\nHowever, in light of the FDA asbestos discovery, plaintiff lawyers could now make it sound like he was being hesitant in his deposition, Bradt said.\n\nDECEMBER INVESTIGATION SUGGESTED J&J KNEW ABOUT ASBESTOS CONTAMINATION 'FOR DECADES'\n\nMuch of the testimony centered on Gorsky´s efforts to quell public and investor concerns raised by the Decembber 14 Reuters investigation and a story published hours later in the New York Times.\n\nThe Reuters report had prompted a stock selloff that erased about $40 billion from the company´s market value in one day.\n\nIn the subsequent days, J&J tweeted, posted on Facebook, ran a series of full-page newspaper ads, published a lengthy rebuttal to the Reuters investigation on its website and announced a $5 billion stock buyback.\n\nIn video posted in December and still featured on J&J´s website, Gorsky emphasized that regulators 'have always found our talc to be asbestos free.'\n\nJim Cramer, the host of the CNBC investing show 'Mad Money,' gave Gorsky the chance to present his side of the story last December, according to copies of emails shown at the deposition.\n\nHours after the Reuters and New York Times articles were published, Cramer sent a message to Gorsky's work email, saying: 'Dear Alex, if you feel these talc stories are not truthful, I would love to know how to refute them! - all the best, Jim.'\n\nAnd that evening, Cramer sent a followup: 'Thank you, Alex. Do not be afraid to overwhelm me. I will work all weekend to tell the truth about your great company!!! -Jim.'\n\nGorsky appeared in person in the 'Mad Money' studio the following Monday, December 17.\n\n'We want to make sure that our trust and integrity that we've earned over the last 130 years is maintained for the next 130 years,' he told viewers.\n\n'We unequivocally believe that our talc, our Baby Powder, does not contain asbestos,' Gorsky said on the broadcast.\n\nIn an email to Reuters, Cramer said his goal 'was to get Alex Gorsky on CNBC first and to ask all the toughest questions ... There were no ground rules and nothing was off the table.' At the end of the December 17 broadcast, there was a disclosure that Cramer's charitable trust owned J&J shares.\n\nIt still has a stake today, Cramer said.\n\nCOMPANY DISMISSED POSITIVE ASBESTOS TESTS AS 'INACCURATE'\n\nWhen the question of previous test results came up in the deposition, Gorsky said occasional findings of asbestos in talc haven't held up under scrutiny.\n\nSuch tests were subsequently found to be 'incomplete or inaccurate,' he said.\n\nA New Jersey judge overseeing thousands of talc lawsuits consolidated in a federal court is expected to rule soon on a J&J request to disqualify expert witnesses hired by plaintiffs, including the head of an asbestos testing lab who testified in earlier trials that he found the contaminant in the company´s powders.\n\nIn a filing Friday, plaintiffs´ lawyers drew the judge´s attention to the FDA finding of asbestos in the bottle of Baby Powder and said they have asked J&J to turn over documents related to the FDA test results and any communications with regulators.\n\nIn a brief conference call Friday with analysts and journalists, J&J officials called the FDA test results 'extremely unusual,' and suggested the sample may have been contaminated by an outside source or come from a counterfeit bottle.\n\nA few hours later, the FDA shot back with a defense of its laboratory analysis, saying it wasn't aware of 'any records pointing to counterfeit Johnson´s Baby Powder in the US market.'\n\nThe FDA declined to provide further comment for this article.\n\n(Reporting by Lisa Girion and Chad Terhune in Los Angeles, and Mike Spector in New York Additional reporting by Dan Levine in San Francisco Editing by Martin Howell)", "description": "Johnson & Johson CEO Alex Gorsky testified that there was no asbestos in Baby Powder in a deposition for a lawsuit claiming it gave a man cancer, less than two weeks before the recall.", "authors": [], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/14/19885822-0-image-a-2_1571836814832.jpg", "published_at": "2019-10-22"}