{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Food/lazy-weeknight-meal-ideas-make-kevin-currys-ingredient/story?id=66022750", "downloaded_at": "2019-10-04 01:22:05.035233+00:00", "published_at": "2019-10-03", "title": "Lazy weeknight meal ideas: Make Kevin Curry's 5-ingredient chicken fried rice and cheese steak quesadilla", "language": "en", "text": "Have you ever looked in your fridge or pantry after a long day and resorted to ordering takeout because you thought you didn’t have the ingredients to make a meal?\n\nWell, now you can make just about any meal you want with a few items you may already have in your kitchen!\n\nSelf-trained home cook and \"Fit Men Cook\" creator Kevin Curry has learned that you don’t need a whole lot to create a delicious and healthy meal.\n\nSimple things like his must-have pantry items -- marinara sauce, chicken broth and coconut milk -- can help you easily make any meal with minimal ingredients.\n\nSimon & Schuster\n\nTo prove it, Curry showed \"Good Morning America\" how to make two different recipes using only five ingredients for those lazy weeknights.\n\n5-ingredient rotisserie chicken fried rice\n\nKevin Marple\n\nIngredients for four hearty servings:\n\nSpray olive oil (or cooking spray)\n\n1lb skinless Rotisserie chicken meat, chopped\n\n3 cups cooked and cooled (Instant) brown rice\n\n2 eggs\n\n1 cup frozen peas and carrots\n\n3 tablespoons lite soy sauce (or more/less to taste)\n\nFresh green onion\n\nToasted sesame seeds\n\nInstructions:\n\nPlace the instant brown rice in the microwave and cook according to instructions given.\n\nRemove the skin from rotisserie chicken, pull the meat from the bone, then chop it into pieces, about 1/2-inch to 1-inch in size.\n\nSet a nonstick skillet on medium high heat. When it’s hot, spray with a little olive oil, then toss in the chicken and cooked rice. Mix it around in the skillet for about two minutes (enough to get a very light sear on the chicken), then make a hole in the middle of the skillet.\n\nBeat two eggs together in a small bowl then pour them in the middle of the skillet.\n\nLet the eggs bubble for a brief second, then immediately begin chopping the eggs up with a spatula and fold them into the chicken and rice. There should be no large, visible chunks of egg.\n\nFold in frozen peas and carrots, then add the soy sauce. Continue stirring for about one minute.\n\nThe heat of the skillet and the food will quickly thaw the peas and carrots, so be careful not to overcook.\n\nRemove from the heat, and if desired, garnish with fresh chopped green onion and toasted sesame seeds.\n\nBonus tips:\n\nCaramelize garlic and chopped green onion in olive oil before adding the chicken and rice.\n\nAdd fresh ginger & red pepper for a spicy kick.\n\nDrizzle 2 teaspoons of sesame oil at the end to enhance flavors.\n\nReduce carbs by adding only half the brown rice and substitute the remaining with steamed cauliflower rice.\n\nFor leftovers, substitute chicken with leftover shrimp cocktail or leftover veggies such as mushrooms and zucchini, and swap leftover brown rice for leftover quinoa (or other grain).\n\n5-ingredient cheese steak and avocado quesadilla\n\nKevin Marple\n\nIngredients for 6 quesadillas\n\nOlive oil spray\n\n2 medium bell peppers, sliced (I used one red and one green.)\n\nJuice from 1/2 lime\n\n1 lb lean flank steak, thinly sliced\n\n1 teaspoon garlic powder\n\nPinch of sea salt and pepper\n\n3 small (~330g) ripe avocados\n\n6 low-carb wheat tortillas\n\n1 1/2 cup shredded cheese (I used Monterrey jack and cheddar blend.)\n\n\n\nInstructions:\n\nSet a nonstick skillet on high heat. Once hot, spray with olive oil and toss in bell peppers.\n\nSear and cook the bell pepper slices until the outside is charred and they are crisp-tender (a bit softer) -- about four to six minutes.\n\nAs the bell peppers cook, squeeze in lime juice to caramelize and soften them.\n\nToss in thinly cut flank steak and continue cooking together in the skillet. As the steak cooks with the bell peppers, sprinkle in garlic, sea salt and pepper. Cook for about 5 minutes or until your desired readiness.\n\nSpread 1/2 of small avocado on half of the tortilla. Add cheese and a serving of the steak mixture. Fold the quesadilla in half. Repeat.\n\nSet a nonstick skillet on medium-high heat and once hot, spray with olive oil and add the quesadilla. Cook on each side for one to two minutes to melt the cheese and toast the outside of the tortilla. Repeat.\n\nEnjoy the quesadillas with fresh salsa, yogurt or Greek yogurt instead of sour cream or even low-calorie BBQ sauce.\n\nBonus tips:\n\nSwap beef with grilled portobello for an easy vegetarian swap.\n\nCut the calories by using less cheese (about 1/4 cup) and by also substituting it with a ripe avocado. It makes the quesadilla rich and creamy just like ones with cheese, but with heart-healthy fats instead.\n\nSwap beef for chicken or shrimp.\n\nThis dish is great for meal prep. You can enjoy these hot or cold the following day.\n\nRecipes reprinted with permission courtesy of Kevin Curry and Fit Men Cook.", "description": "Kevin Curry, author of", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/191003_gma_chef_hpMain_16x9_992.jpg"}