{"pub": "usatoday", "url": "https://usatoday.com/story/news/world/2019/10/22/syria-erdogan-meets-putin-warns-kurds-cease-fire-end/4056235002", "downloaded_at": "2019-10-22 15:12:28.672830+00:00", "title": "With Syria cease-fire set to expire, Erdogan warns Turkey will renew assault if Kurds don't withdraw", "language": "en", "text": "USA TODAY\n\nWASHINGTON – A U.S. brokered cease-fire that suspended fighting between Turkey and Kurdish fighters in Syria will expire within hours, and the Trump administration remains under intense pressure to protect America's Kurdish allies from a feared ethnic cleansing.\n\nBut amid a U.S. military withdrawal from Syria, the Trump administration's ability to address the crisis seemed dramatically diminished.\n\nNowhere was that more evident than in Russia, where President Vladimir Putin and Turkey's leader, Recep Tayyip Erdogan, met to discuss the status of a vital strip of territory along the Syria-Turkey border.\n\nKurdish forces had controlled that territory in northeastern Syria until two weeks ago, when Turkey invaded and began pushing them south. Under the U.S.-brokered cease-fire set to expire mid-day Tuesday, the Kurdish fighters agreed to pull back deeper into Syria and Turkey agreed to stop its assault.\n\nErdogan said Tuesday that 1,300 Syrian Kurdish fighters had yet to vacate a stretch of the border, as required under the deal. But a senior Kurdish official, Redur Khalil, said Monday that his forces were preparing to complete the withdrawal. Khalil also called for an international mechanism to protect Kurdish civilians who want to stay in their towns after the Kurdish fighters leave.\n\nErdogan warned Tuesday that if the Kurdish fighters do not withdraw, “our offensive will continue from where it left off, with a much greater determination.”\n\n“There is no place for the (Kurdish fighters) in Syria’s future. We hope that with Russia’s cooperation, we will rid the region of separatist terror,” he said.\n\nRussia has stepped into the void left by America's withdrawal, offering to patrol the border region and serve as a buffer between the Kurds and the Turks. The Kurds are hoping Russian and Syrian forces can keep Turkey's military at bay and help them maintain some autonomy in the region they carved out for themselves during Syria’s civil war.\n\nPutin is a staunch ally of Syria's brutal president, Bashar al-Assad, who has used chemical weapons to attack his own people amid Syria's horrific civil war.\n\nWhile Erdogan and Putin met in Sochi, a Russian resort town, to discuss the Syrian crisis, the Trump administration continued to send mixed signals about its policy and next steps. Trump has zigzagged between ordering a full withdrawal of U.S. forces from Syria, to announcing he would leave a residual force there.\n\nTrump said Monday that a \"small\" number of U.S. troops will remain in Syria, a shift that came amid blistering criticism from lawmakers in both parties who have denounced his previous decision to withdraw American forces.\n\n“I’m trying to get out of wars. We may have to get in wars, too,” Trump said during a rambling, 70-minute Cabinet meeting on Monday.\n\nOn Tuesday, Trump's top diplomat, Secretary of State Mike Pompeo, said \"some progress has certainly been made\" to stop the Turkey-Kurdish conflict but conceded that the outcome remained unclear.\n\n\"The success of the outcome there is not yet fully determined,\" Pompeo said during a speech to the conservative Heritage Foundation.\n\nHe did not say what the Trump administration would do to keep the cease-fire in place.\n\nContributing: Associated Press", "description": "Amid a U.S. military withdrawal from Syria, the Trump administration's ability to address the Syria crisis seemed dramatically diminished.", "authors": [], "top_image": "https://www.gannett-cdn.com/presto/2019/10/22/USAT/7a98e3ab-647d-4bed-af18-2e6788509749-EPA_epaselect_RUSSIA_TURKEY_DIPLOMACY_SYRIA.JPG?crop=2285,3047,x0,y7&width=2273&height=3047&format=pjpg&auto=webp", "published_at": "2019-10-22"}