{"pub": "dailymail", "url": "https://thisismoney.co.uk/money/markets/article-7621777/Just-Eat-takeover-battle-hots-rival-suitors-clash-swords.html", "downloaded_at": "2019-10-28 23:45:09.132564+00:00", "title": "Just Eat takeover battle hots up as rival suitors clash swords", "language": "en", "text": "The takeover battle for Just Eat heated up on Monday as its preferred merger partner launched an attack on the investment vehicle that is trying to gatecrash the party.\n\nJust Eat has recommended its shareholders accept a merger with Takeaway.com, but investment vehicle Prosus is trying to derail the deal with its own £4.9billion cash bid for Just Eat.\n\nProsus also has a stakes in Delivery Hero and Takeaway.com but is pushing to bring Delivery Hero and Just Eat together and has been selling down its stake in Takeaway.com.\n\nJust Eat has recommended its shareholders accept the merger with Takeaway.com, but investment vehicle Prosus is trying to frustrate the process\n\nTakeaway.com has now demanded that Prosus does not vote in the proposed Just Eat merger, claiming there is a conflict of interest.\n\nThe issue arose after Prosus started selling off its stake in Takeaway.com at below-market prices, which has subsequently pushed Takeaway.com's share price down.\n\nBecause the proposed merger is based on Just Eat shareholders being given shares in Takeaway.com, there is now concern that the deal may not go through because the value of the deal has dropped as shares continue to fall.\n\nOne investor, Cat Rock, has accused Prosus of 'deliberately undermining' the Takeaway.com bid for Just Eat\n\nTakeaway.com said: 'Delivery Hero, with Prosus as its largest shareholder, has a conflict of interest on all matters related to the combination.\n\n'Delivery Hero's own market position, as well as Prosus's position as the largest shareholder in Delivery Hero, in itself gives rise to a conflict of interest.\n\n'Prosus's recent announcement of an unsolicited offer for Just Eat with the intention to make both Just Eat and Delivery Hero part of its global Food Delivery business adds to this.\n\n'As a consequence thereof, pursuant to the existing relationship agreement, Delivery Hero must abstain from voting on any matters relating to the combination in the upcoming EGM (extraordinary general meeting).'\n\nOne investor, Cat Rock, has accused Prosus of 'deliberately undermining' the Takeaway.com bid through its involvement with Delivery Hero.\n\nThe activist investor, which owns stakes in both Just Eat and Takeaway, argued that Delivery Hero's 'bizarre and uneconomic' sale of Takeaway.com stock 'seemed deliberately intended to depress takeaway.com's price'.\n\nCat Rock, which owns a 5.6 per cent stake in Takeaway.com, said it is happy to consider 'fair' offers for Just Eat but believes that the Takeaway.com offer provides more value for shareholders.\n\nAlex Captain, founder and managing partner at Cat Rock, said: 'Prosus and its concert parties cannot be allowed to undermine competing bids for Just Eat.\n\n'The Just Eat board and relevant authorities must take action to restore the integrity of this sale process.'\n\nIt is not known whether Takeaway.com can force Prosus, which is the European investment vehicle of South African tech investor group Naspers, to abstain in the vote.", "description": "Just Eat has recommended its shareholders accept the merger with Takeaway.com, but Prosus is trying to frustrate the process with its own cash bid for Just Eat.", "authors": ["Press Association", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/12/20277830-0-image-a-18_1572265434237.jpg", "published_at": "2019-10-28"}