{"pub": "japantoday", "url": "https://japantoday.com/category/politics/abe-calls-on-suu-kyi-to-ensure-rohingya-can-return-to-myanmar", "downloaded_at": "2019-10-22 13:19:29.992043+00:00", "title": "Abe calls on Suu Kyi to ensure Rohingya can return to Myanmar", "language": "en", "text": "Japanese Prime Minister Shinzo Abe and Myanmar's leader Aung San Suu Kyi shake hands at the state guesthouse in Tokyo ahead of their talks on Monday.\n\nPrime Minister Shinzo Abe urged Myanmar's leader Aung San Suu Kyi on Monday to create an environment in her country that will allow Rohingya Muslim refugees to return from Bangladesh.\n\n\"With regard to the alleged human rights violations in Rakhine State, it is indispensable that the Myanmar government and military take appropriate measures promptly,\" Abe was quoted by the Japanese Foreign Ministry as telling Suu Kyi in their meeting in Tokyo.\n\nRohingya refugees fled to Bangladesh to escape a military crackdown in Myanmar and their repatriation remains a challenge.\n\nSince 2017, some 742,000 Rohingya refugees have fled to Bangladesh in search of safety, according to the United Nations. The Rohingya are considered stateless people in Myanmar where they have for decades faced discrimination and persecution.\n\nSuu Kyi expressed her intention to address the Rakhine issue \"correctly\" and take necessary steps, the ministry said. Abe pledged Japan's support.\n\nAbe kicked off a series of back-to-back meetings with foreign leaders visiting Japan to attend Emperor Naruhito's enthronement ceremony on Tuesday. Suu Kyi is among the dignitaries from over 180 countries expected to take part in the imperial event.\n\nIn a meeting with Palestinian President Mahmoud Abbas, one of the 23 leaders Abe met Monday, the prime minister called for dialogue with Israel and the United States in his support of a two-state solution to the Israeli-Palestinian conflict, according to the Japanese Foreign Ministry.\n\nIn the five days through Friday, Abe is expected to meet with around 50 leaders, including Chinese Vice President Wang Qishan on Wednesday as well as South Korean Prime Minister Lee Nak Yon, possibly on Thursday.\n\nLee's face-to-face talks with Abe would come at a time when Japan-South Korea ties are at the lowest point in years over disagreements related to wartime history and trade policy.\n\nThe meetings will provide an opportunity for Abe to explore bilateral cooperation and discuss growing regional challenges, ranging from tackling North Korean missile and nuclear threats to maintaining a free and open Indo-Pacific region amid Beijing's growing influence.\n\nMeeting with Ibrahim Mohamed Solih, president of the Maldives,\n\nAbe expressed hope his country can deepen ties with the island nation in the Indian Ocean considered important due to its location near critical sea lanes.\n\nSolih told Abe he also recognizes the importance of free navigation in the Indo-Pacific, according to the Japanese Foreign Ministry.\n\nOn North Korea, Abe sought support for Japan's efforts toward resolving the issue of Japanese nationals abducted by Pyongyang in the 1970s and 1980s when he sat down with the presidents of Finland, Slovakia and Nepal, among others. He also held talks with Prime Minister Ukhnaa Khurelsukh of Mongolia, which has close ties with North Korea.\n\n© KYODO", "description": "Prime Minister Shinzo Abe urged Myanmar's leader Aung San Suu Kyi on Monday to create an environment in her country that will allow Rohingya Muslim refugees to return from Bangladesh. \"With regard to the alleged human rights violations in Rakhine State, it is indispensable that the Myanmar government and military…", "authors": ["Ganbare Japan", "Dwindling Gravitas", "Norman Goodman", "Big Cat"], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/1b/49/69aeb0094a3280599840857c7f81b1a76335/aung.jpg", "published_at": "2019-10-21"}