{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/2019/09/25/what-americans-really-think-about-californias-auto-emissions-waiver-what-could-change-their-minds", "downloaded_at": "2019-09-25 13:47:03.979082+00:00", "title": "What Americans think about California’s auto emissions standards -- and Trump’s efforts to stop it.", "language": "en", "text": "The legal battle here has already begun, and both sides will try to enlist public opinion on their side. Our research shows that California could grow public support for its position by framing the argument as states’ rights and by referring to the decades-long tradition in which the federal government allows states to set higher emissions standards.\n\nHow California got to set its own emissions standards\n\nThe 1970 Clean Air Act expanded federal regulation of air pollution caused by motor vehicles. But it allowed California to set more stringent standards, given the state’s prior history of clean air regulation, and allowed other states to follow the California standard. However, to do so, the state needs to request a waiver from the federal Environmental Protection Agency; the EPA grants the waiver unless it finds that California is proposing looser standards or is proposing standards that are inconsistent with the rules outlined in the Clean Air Act.\n\nThe federal government first blocked California’s waiver request in 2007, when the state expanded its list of pollutants to cover not only those affecting local air quality, but also those affecting greenhouse gas emissions. In denying the request, the George W. Bush administration argued that California did not have the authority to make such a shift, even though a prior Supreme Court ruling indicated that it could do so. Soon after Barack Obama became president, however, the EPA reconsidered its prior denial and granted California a waiver in July 2009 that also covered greenhouse gases.\n\nThis latest battle between the Trump administration and California is part of a long-standing partisan conflict involving state and federal government.\n\nAre states, cities and companies taking the lead on climate action?\n\nWhat the public thinks about this\n\nWe sought to understand how the public thinks about this issue in the fall 2018 Cooperative Congressional Election Study, a survey conducted by YouGov. Participants first read that there are a number of issues where there is a tension between state governments and the national government, and that one such issue is the Clean Air Act.\n\nA part of the sample was then asked: “To what extent do you support or oppose states being able to set their own clean air standards?” A plurality of these respondents (52 percent) supported the states’ ability to set their own standards, while about 23 percent were neutral and 25 percent were opposed.\n\nAnother part of the sample read this statement before being asked their views: “For more than 40 years, the federal government has granted California the ability to set its own clean air rules.” Among this group, support for states getting to set their own standard was slightly lower than in the other group (48 percent), although this difference wasn’t statistically meaningful. This suggests that simply citing the long precedent of the California waiver doesn’t change opinion much.\n\nMost respondents also read either an argument favoring states’ rights on clean air standards, an argument against states’ rights, or both. We varied whether this argument was described as a Democratic argument, a Republican argument, or had no party label attached.\n\nFor example, the pro-states’ rights argument without a party label read, “Some argue that states should be free to set their own clean air standards because they may face unique challenges with air pollution.” The anti-state argument read, “Others argue that we need a uniform federal standard and should not allow states to fiddle with an issue as important as clean air regulation.”\n\nThe impact of these arguments depended a lot on whether people first heard about the precedent of the California waiver. When linked to a neutral source, the anti-states’ rights argument lowered support for states setting their own standards, but only if people didn’t know that the California waiver had been around for decades. Moreover, the pro-states’ rights argument was most effective when combined with information about the California precedent. Among people who had read both statements, support for states’ right to set clean air standards was higher (58 percent).\n\nWhat about when party labels were attached to these arguments? Interestingly, we did not find the typical pattern of partisan bias, whereby partisans responded to their own party’s cues. In fact, they were more responsive to the argument advanced by the opposite party, as long it was the argument historically associated with their own party. So Republicans become more supportive of states setting their own clean air standards when exposed to the pro-states’ rights argument advanced by Democrats, and Democrats become more opposed when exposed to the anti-states’ rights argument advanced by Republicans.\n\nWhat comes next in Trump's fight with California about auto emissions standards\n\nThe implications for the Trump vs. California battle\n\nAs in 2007, the fight over California’s clean air authority will likely get tied up in federal courts for many months, and it could be rendered moot if Democrats win the presidency in 2020 and grant California’s waiver once again.\n\nIn the meantime, there is plenty of room to persuade the American public. Our study shows that public opinion on clean air regulation leans in California’s favor, and that this support gets even stronger when people are introduced to pro-states’ rights arguments that refer to California’s long history of setting its own standards. Our research also shows that partisans are particularly susceptible to arguments from the other side: Democrats can persuade Republican voters by making appeals to states’ rights, which has traditionally been a Republican argument. At the same time, Republicans can persuade Democrats by calling for a uniform national standard, much as the Trump administration is doing with its “One National Program Rule.”\n\nDon’t miss anything! Sign up to get TMC’s smart analysis in your inbox, three days a week.\n\nAllan Colbern (@AllanColbern) is assistant professor at Arizona University.\n\nChris Haynes is associate professor at University of New Haven.\n\nJennifer L. Merolla is a professor at the University of California at Riverside.\n\nKarthick Ramakrishnan is a professor at the University of California at Riverside.", "description": "A narrow majority supports the waiver, but some people can be persuaded either way.", "authors": ["Allan Colbern", "Chris Haynes", "Jennifer L. Merolla", "Karthick Ramakrishnan"], "top_image": "https://www.washingtonpost.com/resizer/kkUTP09MnnMaVwJmT-IuHfGvIsg=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2EO7NHW3AAI6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-25"}