{"pub": "bbc", "url": "https://bbc.com/news/world-europe-49746060", "downloaded_at": "2019-09-18 23:20:16.431076+00:00", "title": "France insists world's 'oldest woman' was not fake", "language": "en", "text": "Image copyright Getty Images Image caption Jeanne Calment on her 117th birthday\n\nFrench officials have refused to change the death certificate of the oldest person on record despite claims of fraud by Russian researchers.\n\nJeanne Calment died in 1997 aged 122 but a recent Russian study claimed she had in fact died in the 1930s.\n\nThey claimed her daughter then assumed her identity in order to avoid paying inheritance tax.\n\nBut a group of French specialists have discredited the accusations, stating that her age is \"well-documented\".\n\nWhat did the Russians claim?\n\nRussian researchers Velery Novoselov and Nikolay Zak argued in the Rejuvenation Research scientific journal in December that Calment had in fact died in 1934 aged 59 and that it was her daughter Yvonne who had passed away in 1997 at the age of 99.\n\nThe researchers stated that Yvonne had assumed her mother's identity in order to dodge paying inheritance tax.\n\nThe researchers cited official documentation that seemed to state she had different eye colours at different times - indicating it was not the same person.\n\nThe Russians also noted that the mayor of her town had commented that she looked very young for her age upon visiting her when she was 100.\n\nImage copyright Getty Images Image caption Russian researchers claimed Calment, seen here on her 120th birthday, had actually died in the 1930s\n\nWhat have the French said?\n\nBut a new report, \"The real facts supporting Jeanne Calment as the oldest ever human\", said the claims were a \"conspiracy theory\" based on \"inaccurate facts\".\n\nThe French researchers included Jean-Marie Robine, a specialist on the study of supercentenarians who interviewed Calment in the 1990s.\n\nHe analysed the original data used to validate her identity along with fresh documentation to show \"there was neither tax fraud nor falsification of Jeanne Calment's identity\".\n\nOut of more than 10 million people to have lived to 100, the probability of somebody reaching Calment's age, was \"certainly small, but that is far from making Ms Calment a statistical impossibility\", the report said.\n\nThe Tarascon prosecutor's office on Wednesday rejected any effort to amend Calment's death certificate after viewing the report.\n\nWho was Jeanne Calment?\n\nBorn in 1875 in Arles, France, Calment started attracting international attention in the 1990s as her age advanced.\n\nA colourful character, she enjoyed the limelight, stating \"I await death and journalists\" ahead of her 120th birthday.\n\nCalment also famously smoked and spoke of her fondness for port and chocolate.\n\nShe said she met Vincent Van Gogh when he would buy paint from her uncle in Arles in 1888, calling him \"ugly as sin\" and \"an awful character\".", "description": "An investigation rejects Russian claims that Jeanne Calment actually died at 59, rather than 122.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/7071/production/_108858782_mediaitem108858781.jpg", "published_at": "2019-09-18"}