{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7575213/Britains-acid-killer-Xeneral-Imiuru-aka-Webster-convicted-acid-attack.html", "downloaded_at": "2019-10-15 15:20:32.143248+00:00", "title": "Britain's first acid killer Xeneral Imiuru aka Webster convicted of another acid attack", "language": "en", "text": "Xeneral Imiuru, 20, hurled the noxious substance at Neetta Vaidhya at a cinema in west London on March 8 2017\n\nBritain's first acid killer has been found guilty of dousing an innocent cinema-goer in a dangerous substance just weeks before he killed a mother in a similar attack.\n\nXeneral Imiuru, 20, was jailed for 17 years for throwing acid over Joanne Rand, 47, who later died as a result of her horrific burns.\n\nHe has today been convicted of throwing a noxious substance at another innocent victim, Neetta Vaidhya, three months before the fatal attack on Ms Rand.\n\nHis trial at Oxford Crown Court heard he threw the sulphuric acid at the unsuspecting mother at a cinema in west London on March 8 2017.\n\nShe thought she had been hit by a cup of hot coffee before she realised a burning sensation in her hands and feet and her sock melting.\n\nThe jury heard he had been intending to throw the substance at a man he was arguing with, but it hit Ms Vaidhya by mistake.\n\nThey were told the horrific attack came just three months before he threw acid at Ms Rand as she sat on a bench in High Wycombe, Buckinghamshire, on June 3 that year.\n\nImiuru, also known by the surname Webster, was convicted of manslaughter after Ms Rand died of multiple organ failure and sepsis contracted as a result of her burns 11 days later.\n\nThey were told the horrific attack came just three months before he threw dementia patient carer at Joanne Rand, 47 (pictured before and after the attack) on June 3. Imiuru, also known by the surname Webster, was convicted of manslaughter after Ms Rand died of multiple organ failure and sepsis contracted as a result of her burns 11 days later.\n\nProsecuting in Imiuru's latest acid case, Lesley Bates told the jury: 'Neetta Vaidhya was the unintended victim of an acid incident where the acid was thrown from one person towards another, intending to hit that other but it hit her by mistake - she was in the wrong place at the wrong time.'\n\nImiuru had denied the attack on her, although he refused to leave his prison cell to attend the first day of his trial before Judge Peter Ross in Oxford.\n\nThe Independent Office for Police Conduct was investigating whether a police office investigating the Vue cinema acid attack should have released CCTV at an earlier stage which could have helped bring Imiuru to justice before he the fatal acid incident which killed Ms Rand in High Wycombe.\n\nImiuru has previously suffered acid burns, with a police handout showing scars to his head\n\nThe other assault, which resulted in the death of Ms Rand, happened on June 3 2017, the jury was told.\n\nThen aged 19, Imiuru had become involved in an altercation with another man, who the teenager tried to throw high-strength acid at.\n\nBut it accidentally hit Ms Rand as she sat on a bench after visiting her daughter's grave.\n\nThe attack on the mother-of-three, which took place in High Wycombe, Buckinghamshire, saw Imiuru jailed for 17 years.\n\nMs Rand's family said after he was jailed previously at Reading Crown Court: 'Had this acid attack in March 2017 been investigated properly at the time, Webster the alleged perpetrator, would have been dealt with and may not have been free to carry out the horrific attack in June 3 2017 on Jo and she might still be with us.'\n\nBefore the most recent trial, Imiuru also admitted causing grievous bodily harm to prison officer Paul Flower at HMYOI Aylesbury, throwing urine at HMP Bullingdon officer Yvette Wright, and assault by beating to her colleague Zena Rose by spitting at her.\n\nHe is to be sentenced for all his outstanding convictions at a later date.", "description": "Xeneral Imiuru, 20, hurled the noxious substance at Neetta Vaidhya at a cinema in west London on March 8 2017.", "authors": ["Lara Keay For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/13/19740526-0-image-a-43_1571143814324.jpg", "published_at": "2019-10-15"}