{"pub": "cnbc", "url": "https://cnbc.com/2019/10/08/boeing-20-million-stake-in-virgin-galactic-with-vision-of-hypersonic.html", "downloaded_at": "2019-10-08 12:09:04.065820+00:00", "title": "Boeing taking $20 million stake in Virgin Galactic, with a vision of commercial hypersonic travel", "language": "en", "text": "Boeing's venture arm HorizonX announced on Tuesday that it will invest $20 million in Sir Richard Branson's space tourism company Virgin Galactic, as the two companies hope to mature the technologies needed to make hypersonic air travel possible one day.\n\nThe investment from the aerospace giant comes as Virgin Galactic prepares to become the first human spaceflight company to go public. Virgin Galactic is planning to list on the New York Stock Exchange before the end of the year, through a merger announced in July with Social Capital Hedosophia (SCH), a special-purpose acquisition company (SPAC) created by venture capitalist Chamath Palihapitiya.\n\n\"Our teams have been talking for quite some time now,\" Virgin Galactic CEO George Whitesides told CNBC. \"The broader capabilities of Boeing are unmatched in mobility and experience in human spaceflight, so we're over the moon about this partnership.\"\n\nBoeing will have a minority stake in Virgin Galactic once it goes public, as the investment is in return for new shares of the company. Once the merger closes, Virgin Galactic will have a valuation of $1.5 billion, with SCH retaining a 49% stake.\n\n\"$20 million is a drop in the bucket for the $1 billion that they've raised,\" Brian Schettler, senior managing director of Boeing HorizonX Ventures, told CNBC. \"It's really to catalyze a bigger partnership and align the companies to explore the future of high speed mobility and commercial access to space.\"", "description": "The two companies hope to mature the technologies needed to make hypersonic air travel a commercially-viable business.", "authors": ["Michael Sheetz"], "top_image": "https://image.cnbcfm.com/api/v1/image/106169742-1570534735388vgflightsmall1.gif?v=1570534783", "published_at": "2019-10-08"}