{"pub": "yahoo", "url": "https://sports.yahoo.com/watch-kobe-bryant-duck-questions-140051632.html", "downloaded_at": "2019-09-21 03:43:36.545444+00:00", "title": "Watch Kobe Bryant duck questions about potential NBA franchise ownership (VIDEO)", "language": "en", "text": "Kobe Bryant has been everywhere during his retirement, and the former Los Angeles Lakers star is no stranger to keeping busy. As part of his post-career endeavors, Bryant is part of a Venture Capital fund that he says is trying to help athletes plan for retirement.\n\nBryant and partner Jeff Stibel appeared on CNBC this week to speak about the kind of Investments they are making with their portfolio. During the conversation with host Carl Quintanilla, there came an interesting moment when Bryant appeared to indicate that he could be interested in owning an NBA franchise in the future.\n\nScroll to continue with content Ad\n\nThe segment in question came at about 6:30 in the video above. In it, Bryant tries to dodge Quintanilla’s inquiry about a sports franchise as an investment.\n\nVia CNBC:\n\nStory continues\n\nQUINTANILLA: We had Jerry Jones on the other day talking about streaming rights, how that might change if get a big player bidding for NFL. He thought it might improve the valuation of the Cowboys by 50%. Does sports ownership interest either of you at this point? BRYANT: I’ll let you answer that question because I don’t want to get myself into hot water yet. STIBEL: So we’re going to let Carl answer that. QUINTANILLA: Then we’re all in big trouble. STIBEL: For us, we’re fiscally disciplined. We’re looking for great businesses, great companies and great teams. If that happens to be on the sports side, of course, we’re going to look there. There are great sports franchises. That’s not necessarily our focus. We’re trying to build a franchise here ourselves. QUINTANILLA: I mean, are you’re smiling. Nothing at all, huh? BRYANT: I don’t know what are you talking about. QUINTANILLA: Media overall has to be of some interest. BRYANT: Of course like Jeff said, it’s just important to make smart decisions. We’re not limiting ourselves in anyway whatsoever. But we will look at opportunities as they present themselves and go from there.\n\nIt seems clear that people like Bryant and LeBron James want to follow in the footsteps of Michael Jordan and Magic Johnson by owning sports franchises. They are, generally, a real racket as a public concern, and it keeps former pros in the spotlight.\n\nWe don’t know if Bryant might be looking to invest in a team soon, but he is sure to be on the list of potential owners in the future should a good market come up for sale.", "description": "It seems clear that owning a team is something Kobe at least has his eye on.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/woPZxOd3UiwT5zLsjfnL.g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjEuMjMwNzY5MjMwNzY5Mw--/https://s.yimg.com/uu/api/res/1.2/yrVN5Pos_GbByGnvHD0kDw--~B/aD01ODY7dz0xMDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/homerun/nbcsports.com/48ca603a362fe6bda5787d16ecbc4824", "published_at": "2019-09-20"}