{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/6/pony-up-smu-moves-up-3-spots-to-no-21-after-big-co", "downloaded_at": "2019-10-07 00:07:04.248952+00:00", "title": "Pony Up! SMU moves up 3 spots to No. 21 after big comeback", "language": "en", "text": "DALLAS (AP) - SMU finally loosened up and is now moving up in the rankings. The Mustangs are already bowl eligible halfway through the regular season.\n\nWith an open date next, there is some extra time to ponder the changing momentum and an incredible comeback - both in the last game, and in the program overall in three decades since resuming play after the NCAA death penalty.\n\n“It’s fun when you have a team like this,” second-year coach Sonny Dykes said after SMU overcame a three-touchdown deficit and beat Tulsa 43-37 in triple overtime. “If our guys will just keep believing and keep fighting, this will be one of many comebacks like this that we’ll end up making at some point. … Once you kind of figure that out, then you’re never out of a ballgame.”\n\nThe Mustangs, 6-0 for the first time since the Pony Express days, moved up three spots to No. 21 in the new Associated Press poll Sunday, a week after getting ranked for the first time since 1986. All six of their wins are against FBS opponents.\n\nTulsa, which kept SMU from getting bowl eligible with a win in last year’s finale, took a 30-9 lead into the fourth quarter Saturday night. The Golden Hurricane (2-3) had that big lead despite three interceptions in the first half by Zach Smith, one returned 64 yards by Ar’mani Johnson for SMU’s first touchdown and another in the end zone just before halftime.\n\n“We just stayed the course and played SMU football,” said James Proche, who had an incredible leaping catch for the game-ending 25-yard touchdown thrown by Shane Buechele in the third overtime.\n\nDykes felt his players were a little tight in the first half, and acknowledged that he probably was a bit as well.\n\nThe coach had talked to officials before the game about some pre-snap things he felt Tulsa’s defense did, and got upset when SMU got penalized for a false start in the first quarter. He got an unsportsmanlike penalty when trying the attention of the referee, then called a timeout and was heard using an expletive though the ref’s live mic.\n\n“We all try to kind of ignore some of the noise, and when our players are not used to maybe some of the attention that we got,” Dykes said. “We played a little tight the first half, I thought I probably coached a little tight. … I think the players probably fed off me, so I told those guys, the first half is on me, the second half, just relax and play football.”\n\nEric Dickerson and Craig James were senior running backs the last time SMU was 6-0, in 1982 on way to an unbeaten 11-0-1 season.\n\nThe Mustangs are already eligible to go to a bowl for only the sixth time in 31 seasons since returning from the two years (1987 and 1988) they didn’t field a team after the crippling NCAA sanctions.\n\n“It’s good that we’re to going to go a bowl game, but I think we all kind of felt like we would,” Dykes said.\n\nBuechele, the former Texas quarterback still with another season of eligibility in 2020, is the American Athletic Conference leading passer at 277.5 yards per game. The Mustangs also have Xavier Jones (league-high 12 rushing TDs, second with 107.7 yards per game) and two of the league’s top receivers - Proche (league-high 7.5 catches per game) and Reggie Roberson Jr. (second with 90.8 yards receiving).\n\nJones’ 4-yard TD run on a fourth-down play with 1:02 left in regulation tied the game at 30. The Mustangs, 6-of-6 on fourth-down conversions after halftime, had another on their first OT possession before Jones, who finished with 121 yards, tied the game again with a 3-yard score.\n\nAfter Jones fumbled to start the second overtime, Proche was quickly there to pick up his teammate.\n\nTulsa missed a 43-yard field goal attempt, then was wide left on a 42-yarder to start the third overtime before Proche made the last of his 11 catches for 153 yards to end the game.\n\n“I knew we were going to get another opportunity,” Proche said. “I just kind of felt it.”\n\n___\n\nMore AP college football: https://apnews.com/tag/Collegefootball and http://www.twitter.com/AP_Top25\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "SMU finally loosened up and is now moving up in the rankings. The Mustangs are already bowl eligible halfway through the regular season.", "authors": ["The Washington Times Http", "Stephen Hawkins"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/06/aptopix_tulsa_smu_football_06401_c0-163-3897-2435_s1770x1032.jpg?b50bc2fc86107e0b5f83115f2630b91703c16d7b", "published_at": "2019-10-06"}