{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7623343/James-Milner-reveals-Liverpool-players-tracking-sleep-talking-app.html", "downloaded_at": "2019-10-29 14:37:32.496808+00:00", "title": "James Milner reveals Liverpool players have been tracking their sleep talking through an app", "language": "en", "text": "James Milner has revealed a sleep talking app is the latest craze in the Liverpool dressing room.\n\nThe Reds midfielder says the results have uncovered some bizarre bedtime behaviour, particularly in the case of team-mate Andy Robertson.\n\n'I started using a sleep talking app years ago,' Milner told The Guardian.\n\nJames Milner says a sleep talking app is the latest craze in the Liverpool dressing room\n\n'I don't use it every day but Robbo (Andy Robertson) and I had a laugh. Robbo said: 'I also talk in my sleep.' So we used it and we found it was me who was doing most of the talking – in Spanish. Robbo was making farm noises.'\n\nWhen asked whether Milner was the more intelligent of Liverpool's two funny men, he added: 'You could say that. On the pitch Robbo is unbelievable and off the pitch he is a great character.\n\n'He also had a difficult journey into football but his ability is massive.\n\nMilner says Andy Robertson's positive mindset gives the whole squad a boost\n\n'He's a big presence within the dressing room, lively, enjoys a joke and never shuts up. It's important to have those characters in the squad especially when, like us, you're chasing something special.'\n\nOn Sunday, Liverpool came back from one goal down to earn a 2-1 victory over Tottenham and preserve their six point lead at the top of the Premier League table.\n\nThe Reds host Arsenal on Wednesday in the Carabao Cup round of 16 before returning to Premier League action on Saturday when they travel to Aston Villa.", "description": "James Milner has revealed a sleep talking app is the latest craze in the Liverpool dressing room. He says the results have uncovered some bizarre bedtime behaviour.", "authors": ["Tom Caldon For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/19/20295096-0-image-a-21_1572292195983.jpg", "published_at": "2019-10-28"}