{"pub": "huffpost", "url": "https://huffpost.com/entry/jeff-daniels-james-comey-higher-loyalty-cbs_n_5d9b77a0e4b0993898043ca6", "downloaded_at": "2019-10-07 23:32:12.480842+00:00", "title": "Jeff Daniels Will Transform Into James Comey In This New CBS Miniseries", "language": "en", "text": "Former FBI Director James Comey’s tell-all memoir is hitting the small screen, and Jeff Daniels is slated to play its leading role.\n\nCBS Studios announced Monday that the Emmy winner known for the “Dumb and Dumber” franchise, “Good Night and Good Luck” and “Terms of Endearment” will star as Comey in a four-hour miniseries adaptation of “A Higher Loyalty: Truth, Lies and Leadership.” Production is set to begin next month.\n\nThe show’s director, Oscar-nominated screenwriter Billy Ray, who has worked on films including “Captain Phillips” and “The Hunger Games,” said in a statement that he thought Daniels would be perfect for the role when the duo met backstage after a performance of “To Kill A Mockingbird” on Broadway. Daniels, who was nominated for a 2019 Tony Award for starring as Atticus Finch, will perform in his final show on Nov. 3.\n\nBrendan Gleeson, another Emmy-winner famous for his role as Alastor Moody in the “Harry Potter” series, will play President Donald Trump, who fired Comey in 2017.\n\nThe former FBI director’s memoir, which hit the top of the New York Times bestseller list following its release last year, takes stock of his decades-long criminal justice career. The title is inspired by Trump’s alleged demands for Comey’s allegiance regarding an investigation of former National Security Adviser Michael Flynn. After he left the FBI, Comey testified before the Senate Intelligence Committee and told lawmakers that the president said he expected “loyalty” from the then-FBI director when the two conversed during a private dinner months before he was unceremoniously fired.\n\nThe memoir soon became a thorn in the president’s side, prompting him to lash out on Twitter, attempting to discredit Comey’s account before it even appeared on the shelves.\n\nDaniels has been a vocal critic of Trump, slamming the president in a May MSNBC interview for having “completely soiled the Oval Office.”\n\nNo premiere date for CBS’ program has yet been announced.", "description": "The small-screen adaptation of the former FBI director's memoir will also feature Emmy-winner Brendan Gleeson as Donald Trump.", "authors": ["Trends Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d9b7fce200000f2004ec1a4.jpeg?cache=4jo0e2p1v7&ops=1778_1000", "published_at": "2019-10-07"}