{"pub": "news24", "url": "https://health24.com/Medical/Heart/Heart-and-exercise/less-tv-more-activity-may-mean-extra-years-free-of-heart-disease-and-stroke-20191015-2", "downloaded_at": "2019-10-18 07:05:48.219764+00:00", "title": "Less TV, more activity may mean extra years free of heart disease and stroke", "language": "en", "text": "Less TV, more activity may mean extra years free of heart disease and stroke A new study found that TV watching impacted health regardless of physical activity. Those who seldom watched or never watched TV lived about a year longer free of each type of cardiovascular disease than those who often watched TV.\n\nToo much sitting in front of the TV can be deadly. ~\n\nPeople who watch less TV and are physically active live more years free of heart disease, according to a new study.\n\nPast research has shown people who are highly physically active tend to live more years free of cardiovascular disease. But researchers of a study published in the Journal of the American Heart Association wanted to look specifically at how TV viewing habits fit into the equation.\n\nTV impacts health\n\nUsing data from 13 534 people ages 45 to 64, investigators studied three factors – how much TV people generally watched; how often they were physically active in their leisure time; and how long they lived without having a stroke, heart failure or coronary heart disease.\n\nAfter an average of 27 years, people who were highly active and watched little or no TV lived about two and a half years longer free of stroke, heart failure and coronary heart disease than those who often watched TV and weren't active.\n\nTV watching impacted health regardless of physical activity, the study found. Those who seldom watched or never watched TV lived about a year longer free of each type of cardiovascular disease than those who often watched TV.\n\n\"This study suggests that engaging in any physical activity and viewing less TV could help you live more years free of (cardiovascular) disease,\" said Carmen Cuthbertson, the study's lead author.\n\n\"Because there's such a large cardiovascular disease burden in the US, we wanted to focus on how to extend the years you live in health,\" said Cuthbertson, a postdoctoral fellow in the epidemiology department at the University of North Carolina at Chapel Hill.\n\nThe study was limited, she said, by the fact that participants were asked only about \"leisure time\" activity and not about household chores or physical activity during work or commuting. She said she'd like future studies to incorporate wearable devices to track physical activity and sedentary time.\n\nVarious vascular dysfunctions\n\nBethany Barone Gibbs, a professor of health and physical activity at the University of Pittsburgh who was not involved in the study, applauded the research for focusing not on death, but on how people can live longer lives free of cardiovascular diseases.\n\nWhile the results don't prove frequent TV watching causes heart disease, she said, its findings help clarify how physical inactivity affects health.\n\n\"Studies have shown that people who sit for hours at a time develop various vascular dysfunctions – blood begins pooling in the legs and circulation gets worse, especially in the extremities, which we think causes vascular damage that can lead to the long-term development of heart disease,\" said Gibbs, vice chair of the American Heart Association's Physical Activity Committee.\n\n\"TV watching is just one domain of sedentary behaviour, but it's also a really modifiable behaviour,\" she said.\n\nThe study began in the late 1980s before smartphones and the internet impacted how long people sit in front of screens, Gibbs said. She called for new in-depth research into how cardiovascular health is affected by overall sitting time as well as binge-watching TV.\n\n\"Now, we can sit back and not even have to lift a finger to watch the next show on Netflix,\" she said. \"I think television-watching is becoming an even more important target when it comes to behaviour change and reducing our risk of cardiovascular disease.\"\n\nImage credit: iStock", "description": "A new study found that TV watching impacted health regardless of physical activity. Those who seldom watched or never watched TV lived about a year longer free of each type of cardiovascular disease than those who often watched TV.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7502/c85f387e4ac546e28766e2c004a87338.jpg", "published_at": "2019-10-15"}