{"pub": "news24", "url": "https://traveller24.com/Explore/SAHolidayGuide/your-guide-to-limpopos-best-lodges-for-the-ultimate-in-bush-bliss-20191028-2", "downloaded_at": "2019-10-28 13:33:43.573620+00:00", "title": "Your guide to Limpopo’s best lodges for the ultimate in bush bliss", "language": "en", "text": "YOU MIGHT ALSO LIKE {{item.title}}\n\nBordering Botswana, Zimbabwe and Mozambique, the Limpopo Province is defined by bushveld, wildlife reserves and fossil-rich caves. Ever eaten a Mopani worm? Beef trotters or tripe? Then Polokwane is probably the place to go.\n\nBut if you're keen for a weekend away in a luxe bush lodge and some fine cuisine, spa treatments and game drives, then heading to the lush and romantic Waterberg might just be for you. Or head up even further north to Mapungubwe National Park, where the bosveld is at it its bushiest.\n\nWATCH: See the other Big 5 at the Waterberg's Lapalala Wilderness\n\nYou can get that typical Limpopo wildlife experience in almost every corner in the province, but the Sediko Bush Spa is the main drawcard for Palala - it is absolutely heavenly.\n\nREAD: How to spend a day in Phalaborwa\n\nBeyond the spa, the other amazing experience at Palala is their swimming pools - specifically the poolside service and stupidly comfortable cabanas. The delightful yellow-and-white-striped towels are thick and soft, and after your dip you can relax with a book and a drink from one of the waiters, always at your service.\n\n\n\nMhondoro Safari Lodge and Villa, Welgevonden Game Reserve\n\nThe 5-star luxury accommodation is nestled in the plains of Welgevonden Game Reserve in Limpopo in the shadow of Waterberg, just under three hours from the buzzing Johannesburg.\n\nThis reserve comes with one key difference to its neighbour Marakele National Park - no private vehicles are allowed on its roads. Only safari vehicles and personnel may drive on its winding trails, offering a reprieve of the traffic that can accompany wildlife sightings.\n\nThe pool is also pretty damn swell.\n\n(PHOTO: Gabi Zietsman)\n\nTintswalo at Lapalala Game Lodge\n\nSituated on 50 000 hectares of land, the Lapalala Wilderness is a UNESCO-declared Biosphere Reserve found in the malaria-free Waterberg, Limpopo. Since late last year, it has become home to Tintswalo at Lapalala, also known for its luxe Atlantic, Boulders, Safari Lodge & Manor House accommodation, Lapalala is the latest addition to the family.\n\nIt is luxury, personified. Stay in 5-star tented accommodation or even try its tree-house experience where you can truly feel part of the bush that surrounds you.\n\n(PHOTO: Marisa Crous)\n\nLeokwe Camp\n\nSituated in Mapungubwe National Park far up north, go here if you would like to spend some time in the the wild without the bothers of holiday traffic, noise and big crowds.\n\nYou can explore the tree tops on a raised canopy walk offering views of the Limpopo River, the natural amphitheaters, and enjoy a sunset walk, bush braai or a swim in the rock pool.\n\nBush bliss!\n\nGo for a weekend to this malaria-free, Waterberg biome just outside of Vaalwater. Here, you'll stay in a luxury lodge with sweeping vistas of the landscape and indulge in the very best food, pamper and service.\n\nPerched high on a koppie with expansive views of the Waterberg Mountains, it is the ultimate spoil for burnt out city slickers.\n\nWATCH: The 5-star lodge where elephants drink out of the pool\n\nREAD: Couch Safaris: 7 Top lodges where the animals come to you\n\nAt the very foot of the Waterberg, 205 km North of Johannesburg, you'll find a 5-star bushveld experience like no other. Take in the most incredible sunsets from the extended timber deck, as you sip on a refreshing drink and take it all in.\n\nAlso take your palette on safari! Enjoy open-air boma dinners, bushveld picnic and African flavours at the on-site restaurant.\n\n\n\n\n\n*Compiled by Marisa Crous\n\n\n\n\n\nFind Your Escape by signing up for the Traveller24 Weekly Newsletter – Subscribe here. Or download the News24 App here, to receive expertly curated travel ideas and deals directly to your mobile.", "description": "Bordering Botswana, Zimbabwe and Mozambique, the Limpopo Province is defined by bushveld, wildlife reserves and fossil-rich caves.", "authors": ["Minutes Ago"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9337/c7fdd5890bc64fe4bccec9307a9cbcc2.jpg", "published_at": "2019-10-28"}