{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/im-virginia-k-smith-lifehacker-managing-editor-and-this-is-how-i-work", "downloaded_at": "2019-10-11 00:55:24.011766+00:00", "title": "I'm Virginia K. Smith, Lifehacker US Managing Editor, And This Is How I Work", "language": "en", "text": "Photo: Adam Powers\n\nEvery week, we share the shortcuts, workspaces and productivity tips of our favourite experts. Now, we’re going behind the scenes at Lifehacker. I’m Virginia K. Smith, and this is how I work.\n\nLocation: NYC\n\nCurrent Gig: Managing editor, Lifehacker\n\nCurrent mobile device: iPhone 7\n\nCurrent computer: Macbook Pro at the office; 2014 Macbook Pro at home\n\nOne word that best describes how you work: Triage\n\nFirst of all, tell us a little about your background and how you got to where you are today.\n\nWell if we’re taking it way back, my background is in classical music. I grew up as a serious classical violinist and kind of assumed I was going to do that professionally for a long time.\n\nAs an adult I’ve realised how that kind of training really prepares you for the working world in unexpected ways, as far as collaborating with others, taking constructive criticism, working under huge amounts of pressure... the list goes on.\n\nAnyway, I always really enjoyed writing, history, and lit-oriented stuff, but I was so focused on music that it took me a long time to connect the dots about those things being a potential career path.\n\nI fell into journalism when a friend hooked me up with a job as a copy editor on the school paper in college. I was a freshman with not enough to do, and it seemed like a fun way to earn a little extra spending money.\n\nI loved it, and eventually worked my way up to become the editor-in-chief, and threw myself into other campus publications too. After college, I moved to New York and started working, and one thing led to another, pretty much.\n\nMy first real editorial job was as an intern (and later editorial assistant) at the Daily Beast, and working on the Cheat Sheet was honestly the best possible training in learning the speed of the internet and figuring out how to analyse, package and turn things around really quickly.\n\nI think I’ve been very lucky swinging from vine to vine, job-wise. But also, I’ve been willing to take on any gig that comes my way (I don’t have a specific Dream Job, and therefore don’t have tunnel vision about it), and to cover beats that weren’t necessarily an obvious fit.\n\nI’ve also taken on things like social media work and non-editorial positions at magazines when not enough writing opportunities were presenting themselves, and always learned a lot from that type of experience, as well.\n\nSo staying open to new or varied options has been a huge help. One of the best decisions I ever made was to switch from local news and “culture” blogging to a job writing about New York City real estate, about which I knew virtually nothing at the time (and came to be obsessed with).\n\nThat job also introduced me to the “service journalism” realm, which I love, and is how I ended up at Lifehacker. If I could ever presume to give anyone in this field any piece of advice, it’s this: when in doubt, take the gig. Even if it’s not an “obvious” stepping stone on the career path you have envisioned, you learn something from every job you take on, and that experience adds up in unexpected and really valuable ways.\n\nTake us through a recent workday.\n\nOur mornings are often about figuring out what the edit calendar looks like for the day, finding interesting fodder for stories, and assigning things out as necessary. I tend to block off the first couple of hours of the day for that.\n\nThe rest of the day is roughly spent editing/emailing/working with freelancers, but in practice, lots of different things come up: edit meetings, video meetings, podcast stuff, union stuff, you name it. I’m still working to have a system where I block off more dedicated time away from Slack to dig into longer-tail projects.\n\nWhat apps, gadgets, or tools can’t you live without?\n\nI’m an early riser no matter what, but I’m also big on sunshine (crazy, I know), so last year I bit the bullet and bought one of those wake-up lights, and I love it. I have it set to wake me up to WQXR (New York’s classical station) in the morning, and the combo of the gentle light and classical music is a really nice way to wake up.\n\nI also have one of those Mr. Coffee makers with the timer, so I have that set to start a little before my alarm goes off, and the coffee smell wafts in to help wake me up. Having a Pleasant Morning is really important to me, in case that’s not already obvious.\n\nOther than that I’m not big on gadgets. I just got Airpods and I mostly like them (they were a gift!). Honestly the gadget I use the most around the house is probably my Bose Colour SoundLink bluetooth speaker — it also comes with me to the beach, house parties, etc., and measurably improves the situation every time.\n\nApp-wise, I probably most often use Instagram, Spotify, Lyft, Slack, Twitter, Pocket Reader, Pedometer++, and Wunderlist, which Lifehacker staffers (correctly!) told me to start using for various shopping and to-do lists.\n\nI also like Live Awake for guided meditations, and recently re-downloaded Duolingo to brush up on French before a trip next summer. I want to be a heavy user of Paprika (for recipe tracking, which I’m hopelessly disorganised at), but I haven’t gotten there yet.\n\nPhoto: Virginia K. Smith\n\nWhat’s your workspace setup like?\n\nPretty basic, and not in any way “intentional.” Just a laptop, a monitor, some assorted junk (a tiny plant, energy drinks that were sent to us as a promotion, an Onion day calendar), and my beloved Mr. Coffee mug warmer (I promise this post is not sponsored by Mr. Coffee). I can work anywhere if I have a functioning laptop, so I don’t really think about the rest of the setup much.\n\nWhat’s your best shortcut or life hack?\n\nManaging expectations. I’m not sure if this counts as a shortcut or a life hack, but I am absolutely convinced that it is the key to life both personally and professionally. If you let people know what you need from them and what they can reasonably expect from you, everything in life magically becomes a lot more straightforward.\n\nWho are the people who help you get things done, and how do you rely on them?\n\nMy faithful friend Slackbot really keeps me in line. (I’m always using Slackbot to send me reminders of messages I want to respond to when I have more time, important dates and links, etc.)\n\nAnd the GMG Union (and by extension, the Writer’s Guild of America East)! Job security — and a union contract that ensures reasonable compensation and conditions in which to do said job — makes an enormous difference in quality of work, quality of life and general peace of mind. I couldn’t be more grateful or proud to be at a unionised company.\n\nBeyond that, Melissa (our editor-in-chief) and Alice (our deputy editor) are the people I rely on most! I’m constantly running things by them, getting their input on ideas or strategy… it really runs the gamut.\n\nAlso, maybe it goes without saying, but everything I do relies enormously on our writers and our video team. I could schedule and assign things until I was blue in the face, but if everyone on staff wasn’t sharp, thoughtful, and superhumanly productive, it wouldn’t amount to a whole lot. It’s hard to imagine doing this job with a team that was less tuned-in and communicative than ours.\n\nAlso, I’ve mostly worked at super small companies before this, and it feels so luxurious to have a social team, an art department, an analytics team, and various other people at GMG who help set up our stories for as much success as possible. I really feel lucky to have them, all the time.\n\nHow do you keep track of what you have to do?\n\nNothing fancy. I have a Google Doc called “To Do” where I list out…what I have to do. (I have a separate version of this for personal stuff, like finally switching over to a New York driver’s licence.)\n\nThere are a few items at the top that are there every day (they’re in bold, then I take them out of bold when they’re done). Also, the aforementioned Slackbot reminders, and even the occasional Google Calendar reminder. It’s not a system that another person could probably drop into and make sense of, but it works for me.\n\nHow do you recharge or take a break?\n\nDuring the work day, I’ll sneak into one of the office phone rooms to do a quick meditation for a few minutes, or just go outside to take a walk around the block. I also am trying to be more thoughtful about staying the hell off the internet during my off hours.\n\nWhat’s your favourite side project?\n\nI don’t really have side projects, tbh! I have stopped feeling bad about this. Living well is my side project.\n\nWhat are you currently reading, or what do you recommend?\n\nJust started Michelle McNamara’s book I’ll Be Gone in the Dark (for the office book club, no less!). I often find true crime to be a little lurid or prurient, but this is so thoughtful and completely engrossing. I can’t say enough good things about it.\n\nAlso, my new coffee table book is The Amy Vanderbilt Complete Book of Etiquette, 50th Anniversary Edition, which I got as a birthday gift and absolutely adore. It’s an 800-page etiquette tome with soothing things, like lists of what to stock in the perfect guest bathroom.\n\nAlso, you didn’t ask this, but I have TV recommendations! I recently started watching Are You the One, a dating reality show on MTV that is absolutely bananas and lightyears better than the Bachelor/Bachelorette franchise. I need more people to talk to about this masterpiece of a show. I beg of you, start watching it.\n\nI’ve also really been loving the new season of Insecure, am VERY hyped for the new season of American Vandal, and have gotten back into Washington Week in Review when I need a current events recap that’s not going to spike my blood pressure.\n\nWho else would you like to see answer these questions?\n\nThe editors-in-chief of the other sites at GMG! And also everyone on our executive editorial team.\n\nWhat’s the best advice you’ve ever received?\n\nOnce when I was lamenting “wasting” a lot of my time in college before I really found my footing and started throwing myself into my interests, my professor told me, “If it took you that time to get to the place you’re in now, it wasn’t wasted time.” I think about that all the time, and find myself repeating it to friends pretty frequently. I try to revel in process instead of resenting it.\n\nWhat’s a problem you’re still trying to solve?\n\nI’m still trying to break myself from the myth of multi-tasking. It’s a lie! So, figuring out how to mono-task in a job that necessitates constant interruption is a thing I think about a lot.", "description": "Every week, we share the shortcuts, workspaces and productivity tips of our favourite experts. Now, we’re going behind the scenes at Lifehacker. I’m Virginia K. Smith, and this is how I work....", "authors": ["Whitson Gordon", "Chris Jager"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/y0twq9ztgyl7djfphpop.jpg", "published_at": "2019-10-11"}