{"pub": "businessinsider", "url": "https://businessinsider.com/amex-adding-trip-cancellation-delay-insurance-2019-9", "downloaded_at": "2019-09-25 23:38:06.059336+00:00", "title": "The Amex Platinum is already a great card to book flights, but in 2020 it will be even stronger thanks to new travel protection benefits", "language": "en", "text": "The Platinum Card® from American Express is one of the best credit cards for earning points on airfare. If you book a flight directly with the airline, you'll earn 5 points per dollar.\n\nHowever, it hasn't been the best option in terms of protecting yourself in the event that your trip is delayed or canceled and you want to be reimbursed for non-refundable expenses.\n\nStarting in 2020, Amex is adding trip cancellation and interruption insurance and trip delay insurance to the Amex Platinum and a handful of other premium Amex cards, including the Business Platinum® Card from American Express, the Hilton Honors Aspire Card from American Express, and the Marriott Bonvoy Brilliant™ American Express® Card.\n\nIf you book a round-trip flight entirely with an eligible Amex card and your flight is canceled for a covered reason, you'll be eligible for up to $10,000 in reimbursement for non-refundable travel expenses. And if your flight is delayed by more than six hours for a covered reason, you'll be eligible for up to $500 in reimbursement for unexpected expenses like meals and a hotel room.\n\nWe're used to seeing credit cards add benefits like new bonus categories and statement credits in an attempt to keep up with the competition, but we're also no stranger to issuers chipping away at other perks, especially some of the less eye-catching ones like travel insurance and purchase protection.\n\nThat's why this news is especially welcome. As The Points Guy reports, starting in January 2020, if you have a premium Amex card like the Amex Platinum, you'll be eligible for coverage that can reimburse you in the event that your trip is delayed or canceled.\n\nKeep in mind that we're focusing on the rewards and perks that make these credit cards great options, not things like interest rates and late fees, which can far outweigh the value of any rewards.\n\nWhen you're working to earn credit card rewards, it's important to practice financial discipline, like paying your balances off in full each month, making payments on time, and not spending more than you can afford to pay back. Basically, treat your credit card like a debit card.\n\nTrip cancellation and interruption insurance coming to premium Amex cards\n\nStarting in 2020, when you book a round-trip flight with an eligible Amex card, you'll be eligible for coverage if your flight is canceled for a covered reason. Covered reasons include weather, sudden illness, a call to jury, and terrorist action.\n\nIn the event that your flight is canceled for a covered reason, you'd be eligible for up to $10,000 per trip to reimburse nonrefundable travel expenses (like a prepaid hotel), up to $20,000 per account for each 12-month period.\n\nThis new benefit will be available on the following cards:\n\nYou'll also be eligible for reimbursement if you book a flight with miles but pay the taxes and fees with one of these eligible Amex cards, or if you use Amex Pay With Points to book a flight.\n\nRead more: The best Amex credit cards\n\nTrip delay insurance\n\nAmex is adding another great benefit to these premium credit cards in 2020. When you purchase a round-trip flight with an eligible card and your flight is delayed by more than six hours due to a covered reason, you can be reimbursed for unexpected expenses like a hotel room and meals, up to $500 per trip.\n\nThis can save you from the dreaded experience of having to spend the night in an airport if your flight is delayed overnight.\n\nRead more: Passengers slept on the floor of JFK when the airline didn't put them up during an 18-hour delay — but your credit card can keep that from happening to you\n\nAmex is also adding trip delay insurance to cover up to $300 for unexpected expenses when your covered flight is delayed by more than 12 hours with the following credit cards, which have lower annual fees than the premium options above:\n\nOther changes to Amex card benefits\n\nThe addition of trip cancellation and interruption insurance and trip delay insurance is great news for Amex cardholders — especially those with the Amex Platinum.\n\nThe Platinum card is my go-to for booking flights, since it earns 5x points when you book directly with the airline. Starting in 2020 cardholders can earn those bonus points and enjoy some extra peace of mind. These updates bring Amex in line with the protections offered on other credit cards like the Chase Sapphire Preferred Card, Chase Sapphire Reserve, and the Citi Prestige® Card.\n\nRead more: Amex Platinum card review\n\nThere are a few deductions to Amex card benefits in store, too, but luckily none of these should make too big of a difference for most cardholders.\n\nFirst, starting in 2020 the extended warranty benefit on most Amex cards will be reduced from two additional years to one additional year of protection. Second, all Amex cards that offer purchase protection will offer this for up to 90 days from the item purchase date, down from 120 days.\n\nFinally, Amex will be eliminating travel accident insurance, which covered expenses related to death or dismemberment during a covered trip, and its Roadside Assistance Hotline. Reportedly fewer than 1% of Amex cardholders used these two benefits, so this shouldn't move the needle for most cardmembers.", "description": "Starting in 2020, premium Amex credit cards will offer trip cancellation and interruption insurance, as well as trip delay insurance.", "authors": ["Sarah Silbert"], "top_image": "https://image.businessinsider.com/5d8b76992e22af2f344ca7a6?width=1200&format=jpeg", "published_at": "2019-09-25"}