{"pub": "huffpost", "url": "https://huffpost.com/entry/nicki-minaj-is-coming-out-of-retirement-for-epic-new-song-with-adele_n_5da724f2e4b062bdcb1c16bc", "downloaded_at": "2019-10-16 20:32:37.441366+00:00", "title": "Nicki Minaj Says She Was 'Being Sarcastic' About Adele Collaboration (UPDATE)", "language": "en", "text": "Looks like fans will have to keep waiting for a Nicki Minaj and Adele team-up.\n\nA day after the “Queen” rapper seemingly confirmed that the two hitmakers were working together on an “epic” new song, she said on Twitter Wednesday that she was joking.\n\n“Omg guys. I thought everyone could clearly see I was being sarcastic. Shit!,” Minaj wrote alongside screenshots of various news articles reporting the collaboration.\n\n“Now I have to go to Adele’s studio & steal some files,” she continued. “Who’s in the UK? I got a job for you.”\n\nOmg guys. 😅🤣 I thought everyone could clearly see I was being sarcastic. Shit! Now I have to go to Adele’s studio & steal some files. Who’s in the UK? I got a job for you 🥴 https://t.co/oyh4hECNCC — Mrs. Petty (@NICKIMINAJ) October 16, 2019\n\nAfter announcing her plans to retire from music last month, Minaj shocked fans at an event on Tuesday, when she appeared to reveal that she was featured on the British songstress’ highly anticipated new album.\n\nAsked by “Entertainment Tonight” if she planned to collaborate with Adele any time soon, the “Queen” rapper answered: “Yes and yes, yes and yes, wooo hoo.”\n\n“But Adele made me swear to secrecy that I’m not allowed to tell anyone that I’m working with her,” Minaj continued. “And that we already shot a video. And it’s an epic song! Ahh!”\n\nIn September, Minaj essentially short-circuited the internet with a surprise announcement that she planned to pause her music career and start a family with fiancé Kenneth Petty.\n\n“I’ve decided to retire & have my family. I know you guys are happy now,” she wrote in a since-deleted tweet. “To my fans, keep reppin me, do it til da death of me … Love you for LIFE.”\n\nShe later apologized for the “abrupt and insensitive” tweet, and promised to elaborate on her post-music plans on a future episode of her Apple Beats 1 “Queen Radio” show. Fans, however, are still waiting for an explanation of the retirement announcement.\n\nBut it wasn’t long before Minaj returned to help with the PnB Rock song “Fendi,” which also features Murda Beatz.\n\nAnd she’s set to make an appearance on the star-studded soundtrack for the new “Charlie’s Angels” movie with a track called “Bad To You,” along with frequent collaborator Normani.\n\nRumors that Minaj was partnering with Adele on a new song started buzzing this week when the rapper shared a video of herself lip-syncing to Adele’s hit single “Hello.”\n\nThe feeling is, of course, mutual between the hitmakers. Adele, a longtime Minaj fan, has rapped her iconic verse off Kanye West’s track “Monster” on multiple occasions.\n\nAdele, a 15-time Grammy winner, is working on the release of her fourth studio album four years. Her previous album “25” soared to the top of the charts in November 2015.\n\nThis article has been updated with Minaj’s Twitter claim that she was being sarcastic.", "description": "The rapper seemingly confirmed that the two hitmakers were working on an \"epic\" new song.", "authors": ["Entertainment Writer"], "top_image": "https://img.huffingtonpost.com/asset/5da731ed210000570fad2f77.png?cache=dkpfnxmzc5&ops=1778_1000", "published_at": "2019-10-16"}