{"pub": "telegraph", "url": "https://telegraph.co.uk/technology/2019/10/10/can-learn-sweden-ultimate-cashless-society", "downloaded_at": "2019-10-10 06:18:42.095185+00:00", "title": "What can we learn from Sweden, the ultimate cashless society?", "language": "en", "text": "The collapse of cash in Britain has been dramatic. There were 11.5bn fewer cash transactions in 2018 than in 2008 – a decline of 51pc. It’s a pace of change that has surprised everyone, even industry insiders. “The rise of the debit card and the decline of cash is the phenomenon of the last decade,” says Adrian Buckle, head of research for UK Finance, the banking sector trade body.\n\nBut Britain, while on the podium, is not the world champion in cashless. That title goes to Sweden, where demand for notes and coins is so limp that cash is literally disappearing: the amount in circulation has fallen from 80bn kronor (£6.6bn) to Skr58bn (£4.8bn) in the last four years, a reduction of 27.5pc. The same period has seen ATM withdrawals fall by more than half.\n\nIn Japan, among the most dedicated cash-loving rich countries in the world, 79pc of people use cash every day. In America, 70pc of people use cash every week. In Sweden only 60pc can remember using it - at all - in the last month.\n\nIt has become a self-fulfilling prophecy. As everything from Ikea stores to public transport to the Abba museum have gone cashless, so Swedes have ditched notes and coins. In a country where public trust in government and internet coverage is high, there is no significant kick-back. Polls show that only a quarter of people miss cash, while almost half actively welcome its parting.", "description": "The collapse of cash in Britain has been dramatic.", "authors": ["Harry De Quetteville", "Tom Hoggins"], "top_image": "https://www.telegraph.co.uk/content/dam/technology/2019/10/09/Swedish-xlarge_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwfSVWeZ_vEN7c6bHu2jJnT8.jpg?imwidth=1200", "published_at": "2019-10-10"}