{"pub": "businessinsider", "url": "https://businessinsider.com/who-is-julian-castro-bio-age-family-key-positions-2019-3", "downloaded_at": "2019-09-13 07:05:12.272816+00:00", "title": "Julián Castro is running for president in 2020. Here's everything we know about the candidate and how he stacks up against the competition.", "language": "en", "text": "Current job: Running for president of the United States as a Democratic candidate.\n\nAge: 44\n\nFamily: Castro is married to Erica Lira, a former school teacher. Together they have a son and a daughter.\n\nHometown: San Antonio, Texas.\n\nPolitical party: Democratic\n\nPrevious jobs: Secretary of Housing and Urban Development from 2014 to 2017; Mayor of San Antonio from 2009 to 2014.\n\nBased on a recurring series of national surveys we conduct, we can figure out who the other candidates competing in Julian Castro's lane are, and who the broader opponents are within the party.\n\nBusiness Insider\n\nFormer Vice President Joe Biden, a frontrunner in general, also does well among those who'd be satisfied with Castro, but not to a particularly unexpected extent.\n\na frontrunner in general, also does well among those who'd be satisfied with Castro, but not to a particularly unexpected extent. Sen. Cory Booker and former Rep. Beto O'Rourke seriously outperform their general satisfaction rate among Castro fans. All told, two thirds of those who'd be satisfied with Castro would also be satisfied with Booker, and just north of 60 percent would be satisfied with fellow Texan O'Rourke. For Booker, that's almost 30 points higher than he typically does amongst Democrats.\n\nINSIDER has been conducting a recurring poll through SurveyMonkey Audience on a national sample to find out how different candidate's constituencies overlap. We ask people whether they are familiar with a candidate, whether they would be satisfied or unsatisfied with that candidate as nominee, and sometimes we also ask whether they think that person would win or lose in a general election against President Donald Trump.\n\nRead more about how we're polling this here.\n\nWhat are Julián Castro's policy positions?\n\nOn healthcare : Castro is an ardent supporter of the \"Medicare for all\" proposal. \"I believe that we need Medicare for all,\" Castro told MSNBC in December. \"I believe that we need to recoup the millions of people that have already losts.\" Castro has also described overhauling the US healthcare system as his number one priority if he were to become president.\n\n: On immigration : Castro's campaign website touts his immigrant roots and values passed down from his grandmother, who came to the US from Mexico. He has proposed attaching ankle monitors to undocumented immigrants as opposed to detaining them en masse, as well as emboldening immigrants seeking asylum in the United States. Castro opposes expansions of border walls by President Trump and supports a pathway to citizenship. During the first Democratic primary debate in June, Castro challenged his fellow candidates to support the repeal of a law that criminalizes border crossings. His plan would also reassign border patrol agencies and repurpose employees for new initiatives. At July's Democratic primary debate, Castro criticized his onstage rivals for using the term \"open borders\" to refer to his plan to repeal the criminalization border crossings, calling it a \"right-wing talking point.\"\n\n: On climate change : Castro wants the US to rejoin the agreement to lower global carbon emissions as part of the Paris Climate Accords. As mayor of San Antonio, Castro directed the city's energy utility to have 20% renewable energy 2020, which also coincides with the shut down of a coal plant.\n\n:\n\nOn campaign finance : Castro has vowed not to take donations from corporate PACs, saying \"The people are more powerful than the PAC.\"\n\n:\n\nOn abortion : Castro has said abortion should be legal, including in cases after 20 weeks of pregnancy. Castro said in the first primary debate that abortion should be protected, including for transgender people and low income Americans.\n\n: On LGBTQ rights: Castro supports marriage equality. He believes transgender Americans should be allowed to serve in the US armed forces. While heading the Department of House and Urban Development, Castro expanded fair housing rights to transgender Americans.\n\nOn education : Castro's campaign released an education plan that includes universal pre-K. The proposal would also train and educate pre-K teachers. A $150 billion investment in modernization for high schools. Ensure high school graduates finish with a minimum of one college credit. Establish more trade school programs. Eliminate tuition at public universities, colleges, and vocational schools. Reimagining how students loans are financed for existing debts. Expanding Pell Grants. Federal tax credit for teachers.\n\n: On guns: Castro wants to renew the federal \"assault weapons\" ban from 1994 that expired in 2004. He has also pushed for universal background checks on secondhand transfers, commonly known as the \"gun show loophole.\"\n\nOn criminal justice reform : While HUD secretary, Castro issued guidance to boost fair housing rights, which applied to individuals with arrest records and freed prison inmates. Castro's campaign unveiled a policing plan that would restrict use of force for police officers, increase use of body cameras, and combat the school-to-prison pipeline through disciplinary reforms in schools, including unconscious bias training. The plan would also require police to obtain written consent for vehicle searches and ban stop and frisk policies. Police would be required to undergo pre-employment screening to identify potential prejudices. Castro's plan would implement a national database of decertified police officers and create \"civilian oversight boards\" in cities and communities. At July's Democratic primary debate, Castro criticized former Vice President Joe Biden for his authorship of the 1994 crime bill and called for a national standard on the use of force.\n\n: On trade: Castro has long been a supporter of NAFTA, touting it as a force that made San Antonio \"into a major center of trade in the 21st century global economy.\" In 2018, Castro went further on NAFTA, wanting to expand the agreement to combat climate change.\n\nOn foreign policy : Castro agreed with the Trump administration's decision to withdraw US military personnel from Syria, but added that it should be done in a more methodical way than the administration proposed. \"I'm not a big fan of the commitments America has made, over these last 15 years, whether it was the Iraq War or this commitment,\" Castro said in an interview NBC News. \"However, I do believe, and I agree with folks that say, that both for our own sake, for the sake of our troops, for the sake of our allies, once you're there, you have to actually have a solid plan for how you're going to withdraw.\"\n\n: On taxes: Castro supports increases taxes on the ultra-wealthy, like proposals to place a marginal tax rate of 70% on income over $10 million. He has also said he wants to find ways of \"making sure that the corporations pay their fair share,\" but not elaborated further on a concrete plan.\n\n\n\nWhat are Julián Castro's political successes?\n\nAs mayor of San Antonio, Castro directed the city's public utility to commit to 20% renewable energy by 2020.\n\nDuring his tenure at the HUD Department, Castro launched ConnectHome, which boosted broadband and electronics to children homes across the United States.\n\nHe expanded fair housing rights to minority groups while at HUD.\n\nHow much money has Julián Castro raised?\n\nIn the first quarter of 2019, Castro raised $1.1 million from more than 50,000 contributions, bringing the total he has raised since announcing his bid last year to $2.2 million. Castro's campaign said the average donation was $32.\n\nIn the second quarter, Castro received a big boost from a breakout debate performance. His campaign reported raising $2.8 million in Q2 with $1.1 million cash on hand.\n\nHow is Julián Castro viewed by voters compared to the competition?\n\nINSIDER has conducted a number of other polls to check in on how these candidates are perceived in comparison to one another. When we asked respondents to one poll to rank how far to the left or to the right they considered the candidates, Castro was generally considered to be one of the most left-leaning candidates in the field. Castro was in the middle of the pack of candidates when we asked respondents to rank the candidates based on how prepared they are for the rigors of the presidency given what they knew about their history of public service and experience with government. And when asked how likable or personable respondents perceived the candidates to be, Castro was again around the middle.\n\nCould Julián Castro beat President Trump?\n\nReferring back to INSIDER's recurring poll, Julian Castro overall is believed to be a fairly weak candidate in a general election against Donald Trump compared to the whole field. Among Democrats, Castro's profile is lower and more obscure than he'd likely want to be at this early stage: less than 15% think he'd win, while over a third think he'd lose.\n\nHow do Democratic voters feel about Julián Castro's qualifications?\n\nINSIDER has conducted polling about how voters feel about candidate attributes or qualifications. We asked respondents about a list of possible qualifications and if they made them more likely or less likely to vote for a candidate for president.\n\nFor example, among respondents who said they'd vote in the Democratic primary, 19% said a candidate being a college professor made them likelier to support them, while 4% said it made them less likely to, for a +15% net favorability. We can then see how different candidates' resumes stack up compared to those preferences.\n\nAttributes perceived as most valuable include that he grew up middle class (+36%), is multi-lingual (+25%), age 50 or younger (+23%), held a position as a Cabinet-level official (+16%), has an Ivy league education (+7%) and was a lawyer (+3%).\n\nRead more of our best stories on Julián Castro:", "description": "Castro was secretary of Housing and Urban Development under President Barack Obama from 2014 to 2017, and before that he was mayor of San Antonio.", "authors": ["Joe Perticone"], "top_image": "https://amp.businessinsider.com/images/5c9b79dc2cc74007436977a1-2732-1366.jpg", "published_at": "2019-09-12"}