{"pub": "nyt", "url": "https://nytimes.com/2019/09/16/opinion/iran-attack-saudi.html#commentsContainer", "downloaded_at": "2019-09-17 10:38:33.868033+00:00", "title": "Opinion | ‘Locked and Loaded,’ but for What?", "language": "en", "text": "Whether conducted by Houthi rebels in Yemen, Shiite rebels in Iraq or by Iran itself, the drone attacks on Saudi oil facilities early Saturday amount to a sharp provocation against the United States. And at this dangerous moment, President Trump has few options, few allies, a depleted national security team and little credibility.\n\nIt remained unclear for the moment why Iran or one of its proxies had apparently sought so great an escalation of regional tensions at this time. There was some speculation that hard-liners in Iran may be trying to torpedo any possibility of a meeting between Mr. Trump and President Hassan Rouhani. Whatever the immediate trigger, the attack on a major source of global energy was the most dangerous development since Mr. Trump repudiated the 2015 nuclear agreement with Iran last year and began reimposing economic sanctions against Iran.\n\nThough Saudi Arabia was the target, the gauntlet was at Mr. Trump’s feet, and the immediate question was how he would respond. Until the attack, the president had seemed intrigued by the possibility of meeting with Mr. Rouhani at the United Nations General Assembly — that kind of head-to-head meeting with an adversary like Kim Jong-un of North Korea generates the lavish media attention Mr. Trump relishes.\n\nMr. Trump was silent for most of the weekend after the attack, and his response on Sunday evening was a remarkable tweet that the United States was “locked and loaded,” but that he was waiting to hear from Saudi Arabia on how to proceed. In the meantime, Secretary of State Mike Pompeo was pointing the finger of blame directly at Iran for “an unprecedented attack on the world’s energy supply,” while Tehran was denying his “incomprehensible and meaningless” accusations.", "description": "President Trump considers retaliation after the attack on Saudi oil facilities. But he has few options and fewer allies.", "authors": ["The Editorial Board"], "top_image": "https://static01.nyt.com/images/2019/09/16/opinion/16saudiarabia/16saudiarabia-facebookJumbo.jpg", "published_at": "2019-09-16"}