{"pub": "financialpost", "url": "https://thelogic.co/news/exclusive/meet-the-people-with-power-at-shopify", "downloaded_at": "2019-10-05 05:48:46.659929+00:00", "title": "Meet the people with power at Shopify", "language": "en", "text": "The top leadership team at Ottawa e-commerce giant Shopify hasn’t changed much since going public in May 2015. But almost everything else about the company has.\n\nShopify now has over a billion dollars in annual revenue, and more than 4,000 employees—up from 632 just three and a half years ago. The company has brought in at least 23 senior executives in the last 18 months alone, and elevated another 18 internally.\n\nThe Logic spent eight months speaking with people close to the company and analyzing its corporate filings, lawsuits and public documents to build an organizational chart that includes Shopify’s top 73 executives.\n\nThe chart reveals that two of those new recruits have been entrusted with influential roles in the organization’s top tier. That despite the engineering roots of its founder, only half of the eight key product groups at Shopify are run by engineers. And, that three senior executives have quietly departed the company in the last eight months.\n\nThe top tier\n\nTobi Lütke remains Shopify’s most important figure. Chief executive officer since 2008, he controls more than a third of the company’s voting power.\n\nLütke largely avoided the spotlight for the company’s first decade. He has taken on a more public role in the last two years, chairing the federal government’s Digital Industries Economic Strategy Table, speaking at Shopify events alongside Prime Minister Justin Trudeau and publicly challenging U.S. tech giants that he says are poaching top talent and inflating salaries. The public presence has come at the urging of Lütke’s chief of staff Alexandra Clark, a former federal Liberal Party staffer and lobbyist, according to people familiar with the company.\n\nBut Lütke has also faced internal scrutiny of his leadership. In February 2017, he defended the presence of the far-right publication Breitbart News Network on Shopify as a free-speech issue. Shopify employees had reportedly been pushing the company to remove Breitbart for several months, including sending a letter to Lütke about the issue; BuzzFeed News reported that the CEO was “dismissive” of employee concerns. In October 2018, The Logic reported that employees were concerned Shopify was processing payments for extremist groups. Two weeks later, some of the groups were banned from the platform.\n\nAs the stock has skyrocketed, so has Lütke’s salary. His total compensation was US$310,675 in 2015. In 2018, he hit US$8,586,982.\n\nLütke has maintained much the same leadership team, with six of nine executives who took the company public in 2015 still at the top of the organization.\n\nTalking Point Most of the top leadership team at Shopify has remained in place since its 2015 IPO, but two newcomers have been entrusted with influential roles. The company’s workforce has grown more than six-fold in just three and a half years, and its executive ranks are also expanding—it’s brought in more than 20 external hires in the last 18 months. Our exclusive organizational chart shows the people running Shopify’s key divisions as the company prepares for an increasingly competitive e-commerce space.\n\nHarley Finkelstein—long Shopify’s public face who handles most TV appearances—remains an influential figure at the company. The company’s chief operating officer (COO), he oversees three of its most important divisions: Financial Solutions, International, and Shopify Plus.\n\nFollowing the departure of co-founder Daniel Weinand in July 2017, Finkelstein is one of the longest-serving employees at the firm. He’s also among those considered closest to Lütke, according to a source with knowledge of the company.\n\nFinkelstein was named COO in January 2016, the same month then-chief technology officer (CTO) Cody Fauser left the company. In an interview with Canadian Business soon after, Finkelstein described the move as a way of “freeing up Tobi to focus on product and technology.” But with Lütke’s increased visibility, the company has appointed C-suite leaders for both of those areas.\n\nThis February, Shopify named a new CTO, Jean-Michel Lemieux. He had been the main engineering executive on the leadership team, apart from Lütke, since Fauser’s departure three years before. The company also elevated its three other senior vice-presidents to C-suite titles: Brittany Forsyth, chief talent officer; Joseph Frasca, chief legal officer; and Toby Shannan, chief support officer. Lemieux joined Shopify in March 2015, returning to Ottawa after four years at Sydney-based Atlassian, which makes project management and collaboration software.\n\nCraig Miller took on the role of chief product officer in February 2017. Previously chief marketing officer (CMO), the company veteran is also considered close to Lütke, the source said. Four of Shopify’s general managers of product groups report to Miller, more than any other member of the top leadership.\n\nThe C-suite has two newcomers, both experienced tech executives recruited from mid-sized U.S. firms to spearhead key parts of Shopify’s growth plans.\n\nAmy Shapero was appointed chief financial officer in March 2018, replacing Russell Jones, who took Shopify public. Shapero joined after a two-year stint with robo-adviser Betterment, which included a US$70-million funding round in July 2017 that valued the firm at US$800 million.\n\nShapero has made ample use of her experience with raising capital and buying businesses—US$22 billion in transactions and 10 acquisitions, according to her LinkedIn profile—in a busy first year at Shopify. In June 2018, the company acquired Montreal-based Return Magic, creators of the popular Shopify app of the same name that automates refunds and send-back labels. The two co-founders now work for Shopify’s Shipping division, led by general manager Louis Kearns.\n\nIn November 2018, the company bought Tictail, a Swedish e-commerce company, with the four co-founders joining Shopify. The group under Tictail CEO-turned-general manager Carl Rivera reports directly to Lütke, a break from the company’s normal structure. While Tictail shut down in April, the 30-person team in Stockholm is working on a new mobile video product for Shopify.\n\nThe month after acquiring Tictail, the company raised US$440 million in a secondary offering. The move caused a two-day drop in its share price, as investors puzzled over the lack of specific plans on how it would spend the money and the timing, less than a year after a February 2018, offering brought in US$657 million.\n\nFollowing the raise, the company has made a number of moves to signal an interest in further acquisitions. The company brought in serial entrepreneur Daniel Debow in January as vice-president of corporate development, focusing on mergers and acquisitions. And, Shapero signalled an openness to spend on the company’s fourth-quarter earnings conference call in February. “If we see an attractive opportunity to accelerate our product road map, we will certainly pursue it,” she said.\n\nDespite her experience, Shapero has never been the CFO of a public firm. But in her new job she’s managing Shopify investors’ heightened expectations, and she’s doing so amidst the departure of at least one high-level executive: Blaine Fitzgerald, a longtime vice-president of finance, who left in April.\n\nThe company’s stock was up 83.95 per cent on the Toronto Stock Exchange for 2019 as of May 10, but some analysts are concerned about the valuation—about 13 times its estimated 2020 revenue. Sales growth has also slowed over the last year, although the company topped US$1 billion in annual revenue for the first time in 2018.\n\nShopify is investing in traditional advertising for the first time, so it’s brought in an experienced marketer with his own team based in New York to manage a proper campaign.\n\nJeff Weiser took on the role of chief marketing officer (CMO) in February 2018, having previously held the same job at publicly traded Shutterstock. Weiser is based in New York, the only member of Shopify’s leadership team outside Canada. He’s filled out his team in the city with hires from Shutterstock and Beachbody, another former employer of his.\n\nShopify has budgeted $30 million to increase brand awareness in 2019 and, in April, launched its first integrated ad campaign, including television, digital video, radio, storefronts and social media spots.\n\nIt’s a measure of their importance to Shopify’s future—and of the cost of experienced tech talent—that both Shapero and Weiser vaulted straight into the ranks of the company’s most highly-compensated executives last year, with base salaries behind only Lütke’s. Shapero is the second highest-paid executive, at US$513,100. Third-place Weiser makes US$500,000.\n\nShopify is male at the top. There are two women on the nine-member leadership team, and two among the 11 product group leaders on the org chart. On the board, women occupy two of seven seats.\n\nShopify did not answer any questions for this story. “We’re not commenting further on our organizational structure,” said Julie Nicholson, director of communications, directing The Logic to the leadership section of the company’s website.\n\nThe divisions of the future\n\nShopify has two types of divisions: service lines and product groups.\n\nService lines operate across the company, with team members in all the major product groups. They include data, marketing and human resources, the last of which is led by Brittany Forsyth, chief talent officer. Forsyth is a Shopify lifer, who joined the company in 2010 after getting her undergraduate degree at Carleton University and has overseen its rapid workforce growth in recent years.\n\nProduct groups handle important parts of the platform, as well as the technology that connects to it or the growing number of services it offers its merchants. Eight product groups are particularly crucial to Shopify’s operations and future plans: Shipping, Channels, International, Plus, Platform, Start, Core and Financial Solutions.\n\nChannels, which forms partnerships with other tech platforms through which merchants can sell, reports to Miller, Shopify’s Toronto-based CPO. It’s a key division for Shopify’s future as the company tries to grow merchants’ revenue by adding more partners and expanding into traditional retail. The group manages important relationships with tech giants like Facebook and Google, which the company is increasingly competing with.\n\nSatish Kanwar, a longtime executive, added the Channels general manager title to his existing vice-president of product role in January 2018. Kanwar is perhaps the most successful example of the company’s preference for acqui-hiring—buying startups as a way to recruit their employees. Five of Shopify’s eight disclosed acquisitions to date fit that pattern with about 130 employees joining the company ranks as a result. Shopify also uses acquisitions as a way of bringing in new functionality; the company still uses tech from Kit, Oberlo and Return Magic.\n\nShopify bought Jet Cooper, Kanwar’s 25-person user experience (UX) and design studio, in 2013. Over the last year, Kanwar has spearheaded the company’s expanded focus on brick-and-mortar retail and struck partnerships with eBay and Snapchat that give Shopify’s merchants more places to list and advertise their products.\n\nShopify has been staffing up on the retail side. In January, the company hired Ian Black, former head of UberEats for the U.S. and Canada, as its director of retail. It’s also brought in new executives to manage marketing and product for the subdivision over the last 16 months. The firm released new versions of its point-of-sale system and card reader in April.\n\nKanwar faces the daunting challenge of maintaining relationships with the same tech giants he formed partnerships with as some of them launch competing offerings that could eat into Shopify’s market share and revenues. Facebook launched a “Buy Button” for Shopify merchants’ Facebook pages in 2015; the year after, Shopify turned on sales via Facebook Messenger. This year, Shopify’s stock dropped in March when Facebook-owned Instagram launched a checkout feature. Shopify also struck a partnership with Google in 2018; the search giant rolled out shopping links under videos on its subsidiary YouTube this month.\n\nThe company has added more than one million square feet of new office space across Canada over the last three and a half years. Ottawa is still Shopify central; nearly half of the executives in the org chart are based in the city. But Waterloo is fast becoming a regional power centre for the company; two of its most important growth divisions are based in the area: International and Plus.\n\nThe company’s merchant base remains concentrated in a relatively small number of markets, with 55 per cent in the U.S. and another 22 per cent between Canada, the U.K., and Australia at the end of 2018, according to its annual report. But the company is now prioritizing growth in new markets.\n\nThe International division is led by vice-president Aaron Brown. He joined Shopify in August 2017 after a stint at Amazon in Seattle—the rare executive brought in directly from one of the stock market-leading FAANGs (Facebook, Amazon, Apple, Netflix and Google). Shopify typically recruits from mid-sized and smaller tech companies like Betterment, Shutterstock, Atlassian, and Etsy.\n\nBrown also spent over a decade at Research in Motion (now BlackBerry) in product management roles. That’s a skillset that’s proving useful at Shopify, whose international expansion strategy is based on product, not marketing. Instead of making big ad buys in new markets, the company is translating its platform, and adding regionally-specific payment options. In 2018, it launched six languages—French, German, Japanese, Italian, Brazilian Portuguese and Spanish—and regionally-popular payment methods, like bank transfers in Germany.\n\nThis year, Shopify is adding simplified Chinese. Two employees previously based in Toronto have relocated to Shenzhen, China, and the company is currently advertising for a business development manager in the city.\n\nExpanding to new markets is “an untapped opportunity for the company,” Suthan Sukumar, principal for technology and gaming research at Eight Capital, a Toronto investment brokerage, told The Logic earlier this year. “I see a long runway for growth, just from the international segment alone.”\n\nShare the full article! Send to a friend\n\nLoading... Thanks for sharing! You have shared 5 articles this month and reached the maximum amount of shares available. Close This account has reached its share limit. If you would like to purchase a sharing license please contact The Logic support at [email protected]. Close Share the full article! Share the full article with your friends. Recipients will be able to read the full text of the article after submitting their email address. They will not have access to other articles or subscriber benefits. You have shared 0 article(s) this month and have 5 remaining. Copy Link And Share Copy Link Email to a Friend Send Email Share on Social Media x\n\nShopify Plus, meanwhile, gives larger merchants access to dedicated engineering and support resources. That includes both direct-to-consumer brands that have grown primarily on Shopify—like Kylie Cosmetics or the popular Silicon Valley shoemaker Allbirds—as well as more established firms like Hasbro and HarperCollins, which have also migrated to the platform.\n\nGeneral manager and vice-president Loren Padelford leads the Plus team of more than 500 people. He has led the division since October 2014, a few months after Plus launched. Like Padelford, the division’s top ranks are largely drawn from outside the company—16 of the 24 vice-presidents, directors and heads The Logic identified were external hires into their current roles, and just five previously worked at Shopify outside the Plus organization. About half the executives across the company in The Logic’s org chart are in their first Shopify jobs.\n\nPlus could soon be competing with one of the world’s biggest technology companies. Microsoft is considering launching e-commerce sales management software for larger firms.\n\nPadelford also heads the regulated products group, which provides the technology for the online stores of provincial cannabis authorities in Ontario, British Columbia, Newfoundland and Labrador and Prince Edward Island.\n\nBrandon Chu runs the division that is Shopify’s defence against the increasing number of Big Tech firms entering e-commerce. As general manager of the Platform product group, he leads a team of more than 200, which build the developer tools and application programming interfaces that allow third-party appmakers to produce plugins for setting up loyalty programs and subscription services and finding products to sell.\n\nShopify has 2,750 apps on its platform, more than competitor BigCommerce’s 647. The apps are a competitive advantage for Shopify, according to Jan Myers, co-founder and vice-president of growth at Winnipeg-based Bold Commerce, one of the biggest Shopify app developers. “It’s their moat,” he told Digiday in December 2018.\n\nBut as with Chu’s former Channels shop, appmakers can become challengers. In March, Mailchimp shut down its popular email-marketing integration with Shopify, citing concerns over the latter’s updated terms of service. Shopify, in turn, said Mailchimp had refused to respect the agreement and provided a poor merchant experience. But some store owners see a different reason for the breakup. During an earlier outage, in November 2018, some merchants speculated that the source of the two companies’ dispute was Mailchimp’s partnership with Square, which allowed users of the former to add e-commerce features to their landing pages.\n\nStart, which is for merchants just starting out in e-commerce, is led by Sylvia Ng, a Channels alumnus. Prior to joining Shopify, Ng was a growth executive at Toronto startups 500px and ScribbleLive.\n\nThe Core product group maintains the Shopify platform’s back end interface, which merchants use to manage their stores. Lynsey Thornton is its general manager. Thornton rose through the ranks of the UX team, which she now leads as vice-president. The UX group now numbers more than 450, making it one of the company’s bigger service lines.\n\nRecent executive exits\n\nThree senior executives have left the company in the last eight months.\n\nMohammad Hashemi, Financial Solutions general manager, departed in September 2018, according to his LinkedIn profile. That was just 11 months after he took the role.\n\nThe company has sought out executives like Hashemi with domain expertise to lead the product group. Transaction-processing fees through the division’s Shopify Payments service make up the majority of the company’s “merchant solutions” business, which brought in 56.7 per cent of revenue in 2018. Hashemi’s interim replacement Andre Lyver, a Montreal-based engineer, also has a background in fintech. He joined Shopify in January 2016 after almost two decades at online payments companies. Lyver’s division also includes Shopify Capital, which gave out US$87.8 million in loans and cash advances to merchants in the first quarter of 2019.\n\nDavid Lennie, senior vice-president of data science and engineering, left the same month as Hashemi after three years at the company. While Lennie was listed as an executive officer of the company in annual reports during his tenure, the division’s new leader, vice-president Solmaz Shahalizadeh, is not. She reports to CFO Shapero.\n\nIt’s an unusual structure for a company in a data-heavy industry like e-commerce.\n\nFor example Stitch Fix, a San Francisco-based online personalized styling service, has a chief algorithms officer, Eric Colson, who reports directly to CEO Katrina Lake and heads his own department.\n\nBut at Shopify, data plays a supporting role. Shopify uses data, analytics and algorithms to help merchants increase sales and reduce fraudulent transactions and to inform Shopify Capital’s lending decisions.\n\nA third executive exited at the beginning of this year. In January, the company announced Shopify Studios. Not mentioned in the announcement was Lubor Keliar, who left his role as general manager and vice-president of Shopify Studios the same month. Prior to that, Keliar was a marketing executive at the Los Angeles Clippers basketball team and the energy drink manufacturer Red Bull.\n\nKeliar’s LinkedIn profile indicates he took the top job at Shopify Studios in November 2017. He said he has “built and led a team of 50 media strategists, operations specialists and content producers delivering on a [sic] integrated channel strategy and multi-format portfolio, including feature documentaries, premium episodic series, editorial and podcasts.”\n\nShopify, which is new to the media production business, has recruited widely from established media organizations to build the Shopify Studios team. Senior members come from Bell Media, Vice Media, the Toronto International Film Festival and the CBC. The division’s new general manager is Jason Badal, a former executive at Rogers Media. Badal’s experience in content acquisition for sports and entertainment channels like Sportsnet and City could prove valuable as Shopify seeks to get its TV shows and films picked up by streaming platforms and traditional broadcasters.\n\nHashemi, Lennie and Keliar have not taken new jobs since their departures from Shopify, according to their LinkedIn profiles. They did not respond to requests for comment and Shopify did not answer questions about their departures.\n\nEmma Voulgaris provided research for this article.", "description": "Two new C-suite recruits are making key decisions, while three senior executives have quietly departed", "authors": ["Murad Hemmadi", "Jessica Galang"], "top_image": "https://thelogic.co/wp-content/uploads/2019/05/Leadership_Team-Shopify_Org_Chart-Social_May_13_2019.png", "published_at": "2019-05-13"}