{"pub": "metro", "url": "https://metro.co.uk/2019/10/21/matthew-mcconaughey-is-peak-matthew-mcconaughey-in-the-beach-bum-10955360", "downloaded_at": "2019-10-21 14:54:34.400843+00:00", "title": "The Beach Bum review: Matthew McConaughey plays up to stoner persona", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nA few years ago, Matthew McConaughey enjoyed one of the most remarkable career u-turns in Hollywood history, going from laid back rom-com fodder to Oscar Winner and a new lease of life as a dramatic actor.\n\nHowever, he’s never shied away from the public perception of himself (he even quipped his famous line ‘alright, alright, alright…’ in his Oscar acceptance speech).\n\nHe takes that association one step further in debauched comedy The Beach Bum, from Spring Breakers director Harmony Korine.\n\nAdvertisement\n\nAdvertisement\n\nHe plays Moon Dog, a talented poet considered one of the great minds of his generation. However, he is devoted to a life without responsibility, getting drunk and blazed on his boat in Florida, living off of the fortune of his wealthy wife (Isla Fisher).\n\nThis philosophy is tested when a series of unusual events throw his life off course.\n\nMatthew McConaughey plays an hard-partying poet in The Beach Bum (Image: NEON)\n\nNarratively speaking, this is a film that shouldn’t work.\n\nIt is essentially McConaughey wandering round in a haze looking for the next ‘good time’, which usually involves beer, marijuana, and beautiful women. No matter who dies, who ends up in court, whether he’s penniless or literally sitting on a fortune, Moon Dog seems unaffected and devoted to the idea of greeting success and failure as the same.\n\nThere’s no character arc, no-one learns anything, it breaks every storytelling rule… and still it’s hilarious.\n\nThere are a thousand films out there that teach valuable lessons, that either inform us or motivate us to do better. But once in a while, it’s fun to follow a film with no message or destination, that just leans on the charisma of its cast and premise.\n\nMuch like The Big Lebowski, the appeal lies in meeting and spending time with these larger than life characters, with McConaughey our slurring tour guide.\n\nZac Efron has a small but memorable role as a rehab patient that Moon Dog spends a wild night with, before throwing his lot in with a sleazy boat captain (Martin Lawrence). Like us, they’re just passengers passing through the Moon Dog experience, giving some kind of strange credence to his meandering.\n\nMatthew McConaughey and Snoop Dogg are the duo you didn’t know you needed (Image: NEON/Vice films)\n\nAs for the star of the show, McConaughey has never seemed more at home.\n\nAdvertisement\n\nAdvertisement\n\nThis is clearly a very cartoonish take on what people perceive him to be, but the actor makes the most of it and slides into every scene like it’s a documentary.\n\nHe enjoys a fun chemistry with Fisher, although his easy connection with Snoop Dogg (playing drug/plane connection ‘Lingerie’) is so entertaining it’s worthy of a sequel.\n\nIf you’re looking for meaning in your cinema, go and see something else.\n\nLike its protagonist, The Beach Bum is a good time that breezes through its obvious flaws thanks to a witty script and the pleasant atmosphere it creates.\n\nBeach Bum is in UK cinemas 25 October.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Godfather director Francis Ford Coppola calls Marvel films ‘despicable’ after Martin Scorsese comment ignites debate\n\nMORE: Just because Breaking Bad got El Camino doesn’t mean Friends needs film reboot", "description": "Comedy The Beach Bum gives us a (fictionalised) idea in stoner romp The Beach Bum.", "authors": ["James Luxford"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/The-Beach-Bum-1-fb88_1571666090.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-21"}