{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7590183/Dame-Joan-Collins-says-happy-son-Alexander-Newley-proposes-Sheela-Raman.html", "downloaded_at": "2019-10-19 11:53:17.187213+00:00", "title": "Dame Joan Collins says she is 'very happy' after her son Alexander Newley proposes to Sheela Raman", "language": "en", "text": "Dame Joan Collins has never given up believing in marriage, even though it took until husband No 5, Percy Gibson, to find lasting happiness.\n\nAnd now the Dynasty star's son, Alexander Newley, has decided to take the plunge again.\n\nThe distinguished painter – whose father is Joanie's second husband, the late actor and singer Anthony Newley – has proposed to American-born writer and musician Sheela Raman.\n\nThe distinguished painter – whose father is Joanie's second husband, the late actor and singer Anthony Newley (left) – has proposed to American-born writer and musician Sheela Raman (right)\n\nAlexander Newley and Dame Joan Collins pictured together. Known as Sacha to his pals, Alexander has a daughter, Ava, with his first wife\n\n'Sheela and I are engaged and getting married next autumn,' he confirms.\n\nKnown as Sacha to his pals, Alexander has a daughter, Ava, with his first wife, the U.S. jewellery designer Angela Tassoni, whom he divorced in 2012.\n\nDame Joan tells me: 'I am very happy for both of them.'\n\nAlexander has previously said of Sheela: 'She's an extraordinary woman.'\n\nDame Joan (pictured in 2019) tells me: 'I am very happy for both of them'\n\nWhen I revealed last year that Tamara Beckwith was to become a granny at just 48, the former It girl insisted she was 'thrilled'.\n\nBut raising her own four-year-old son, Vero, at the same time as her daughter, Anouska, looks after her first, Luna, does have its challenges when 'Glam-ma' Tamara seeks to offer the wisdom of her years.\n\n'There's nothing worse than being told how to parent your child so I try not to, unless she asks,' Tamara tells me at Vicky Cowie's book launch at the Simon Lee Gallery, Mayfair.\n\n'So I tell her, 'You're not going to like what I have to say.' And if she goes, 'Well don't say it then' — I don't.' Now that is wise . . .\n\nDaisy promises a playmate for Archie\n\nFor I hear that Daisy Jenks, (pictured) who is married to Prince Harry’s close friend Charlie van Straubenzee, is expecting her first child\n\nThe Duchess of Sussex, who has spoken about feeling ‘vulnerable’ as a new mother, will soon have a playmate for baby Archie.\n\nFor I hear that Daisy Jenks, who is married to Prince Harry’s close friend Charlie van Straubenzee, is expecting her first child.\n\n‘It’s so exciting,’ Daisy tells me.\n\nDaisy, 28, who works as an events videographer, shared this picture with pals of herself on holiday in Ibiza wearing a peach swimming costume that shows off the blossoming bump.\n\nHarry was best man at the couple’s wedding in Surrey last year and must be a shoo-in for godfather.\n\nThe Queen broke royal tradition yesterday to attend a memorial service for one of her closest aides, I hear.\n\nHer Majesty usually sends a representative to such events, but she was among the mourners at the Royal Chapel of All Saints in Windsor Great Park for Annette Wilkin, 72, who served her for more than four decades.\n\nThe Queen held Miss Wilkin in such high esteem that she once gave her one of her beloved corgis, Larch, as a gift.", "description": "EDEN CONFIDENTIAL: Alexander Newley - whose father is Joanie's second husband, the late actor and singer Anthony Newley - has proposed to American-born writer and musician Sheela Raman.", "authors": ["Richard Eden For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/01/19907362-0-image-a-41_1571443217987.jpg", "published_at": "2019-10-19"}