{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7554425/The-Bachelorettes-Angie-Kent-confronts-Jess-Glasgow-new-trailer.html", "downloaded_at": "2019-10-09 19:26:50.272605+00:00", "title": "The Bachelorette's Angie Kent confronts Jess Glasgow in new trailer", "language": "en", "text": "The Bachelorette contestants usually put on their best behaviour and do everything in their power to receive a rose over their rivals.\n\nBut it seems Jess Glasgow, 37, misses the mask in Thursday's episode as he makes a controversial comment towards Angie Kent.\n\nIn a preview trailer, the aspiring politician sends Angie into a rage after he tells her: 'don't mind me if I get some wandering fingers, alright.'\n\n'I'd rather be single than disrespected': The Bachelorette's Angie Kent (pictured) confronts Jess Glasgow after he makes a controversial comment in new trailer\n\nA fuming Angie says to producers: 'What the hell does this guy think this is. What the hell like what are you even doing here. What a waste of a tank of gas.'\n\nThe blonde beauty can than be seen approaching Jess at the rose ceremony, where she confronts him.\n\n'I would never allow a man to f**k with my sisterhood,' she fumes.\n\nControversial: During a group date, Jess (pictured) sends Angie Kent into a rage after he tells her: 'You don't mind me if I get some wandering fingers alright'\n\n'When a man can't accept and respect what I am putting down, I'd rather be single for the rest of my life,' she says.\n\nThis comes after Angie's undercover brother Brad informed his sister that Jess might not be on the show for the right reasons.\n\nOn Wednesday, Brad told the suitress that Jess would refuse her 'special 24HR rose' if offered, which urged her to furiously confront the aspiring politician.\n\nDrama: Angie can than be seen approaching Jess at the rose ceremony, where she confronts him during an heated conversation\n\n'I've actually heard from some of the other guys that if I gave you a rose tonight, you weren't actually going to accept it,' she informed Jess.\n\nJess denied saying that he wouldn't accept the rose but previous footage from the cocktail party contradicted his story.\n\n'No. I said, \"If Angie didn't give me a rose, I would accept that.\" OK? 'I would accept that,' he lied.", "description": "He's the Bachelorette contestant who caused a stir on Wednesday after he lied about saying that he wouldn't accept a rose.", "authors": ["Mary Mrad For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/14/19492096-0-image-a-40_1570626563256.jpg", "published_at": "2019-10-09"}