{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7556171/Russia-deployed-secret-GRU-unit-known-29155-spread-turmoil-Europe.html", "downloaded_at": "2019-10-09 22:08:24.715683+00:00", "title": "Russia 'has deployed secret GRU unit known as 29155 to spread turmoil in Europe'", "language": "en", "text": "Russia has reportedly deployed a secret GRU unit known as 29155 to carry out assassinations and spread turmoil in Europe - despite the group's notorious sloppiness.\n\nThe recently discovered outfit has been operating for at least 10 years and Western security officials believe it was behind the attempted murder of Sergei Skripal.\n\nThe former Russian spy and his daughter, Yulia, were poisoned with novichok in Salisbury in March last year, only for the prime suspects to claim on Kremlin-funded RT that they had only been in the city to visit its cathedral.\n\nPresident Vladimir Putin also sent 29155 to stage a coup in Montenegro, which also failed, according to intelligence sources.\n\nThey also blame the unit for a campaign to destabilise Moldova and the poisoning of Bulgarian arms dealer Emilian Gebrev in 2015.\n\nPictured: Military personnel wear protective clothing as they investigate the Salisbury novichok attack, thought to be the work of 29155\n\nAlthough intelligence sources in four Western countries say it is unknown where and when the units will strike, a New York Times report says Moscow's sloppy methods exposed the force behind what were previously thought to be unconnected attacks.\n\nA retired GRU officer claiming to have knowledge of Unit 29155 told the paper that its operatives work either individually or in groups to inflict bombings, murders and 'diversionary' missions.\n\nTwo intelligence officials in Europe said that yesterday's article detailing how the group seeks to sow chaos across the continent was 'credible'.\n\nNATO and EU intelligence services have long suspected that central organisation lay behind the Salisbury attack as well as other destabilising events across the continent.\n\nSergei Skripal and his daughter Yulia (both pictured) were targeted in Wiltshire in March last year\n\nOne source, based in Brussels, said that Russia has been reconstituting versions of Cold War methods since 2008, if not before.\n\n'Some people will point to the sloppiness of some of their operations but in each case they were able to hit the target and in some cases even eliminate it,' the source said.\n\n'The real issues seem to come in trying to make an escape without being detected,' said the official.\n\n'They have proven they can get to anyone but they've also proven that at least so far — and everyone is going back and reopening cold cases to determine if there were other hits — that it's obvious when the Russians are involved.'\n\nPictured: Police in chemical hazard suits investigate in Salisbury following the poisoning of former spy Sergei Skripal last year\n\nA second intelligence official from a Central European country said the unit is expected to be linked to more incidents that have hit the continent.\n\nNational security expert Dr Victor Maderia says that the Kremlin under Putin regards itself as locked in a political-psychological war with the West.\n\nHe says that weak responses from the West after Russia's 'aggressive' actions in Estonia, Georgia and Crimea/Ukraine over the past 12 years are to partly to blame.\n\nUnit 29155's methods - including spraying nerve agent on Skripal's door handle - easily link its actions to Russian intelligence.\n\nIt is comprised of veterans from wars with Afghanistan, Chechnya and Ukraine. The outfit appears to function as a tight-knit community.\n\nA 2017 picture of its commander, Maj Gen Andrei V Averyanov shows him at his daughter's wedding, posing with Col Anatoly V Chepiga, one of the two men behind the Skripal poisoning.", "description": "The unit is comprised of veterans from Russia's bloodiest wars, including hardened service personnel who fought in Afghanistan, Chechnya and Ukraine.", "authors": ["Sebastian Murphy-Bates For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/21/19511082-0-image-a-29_1570654481823.jpg", "published_at": "2019-10-09"}