{"pub": "abcnews", "url": "https://abcnews.go.com/US/joker-movie-prompts-mass-shooting-threat-us-movie/story?id=65875724", "downloaded_at": "2019-09-26 16:43:41.913991+00:00", "title": "'Joker' movie prompts mass shooting threat at US movie theaters", "language": "en", "text": "The soon-to-released psychological thriller \"Joker\" starring Oscar-nominated actor Joaquin Phoenix has prompted a \"credible potential mass shooting\" threat on a movie theater somewhere in the United States, military officials warned in a memorandum issued this week.\n\nThe alarming notice was sent out on Monday by military officials at Fort Sills Army base in Oklahoma, and was based on intelligence gathered by the FBI from the \"disturbing and very specific\" chatter of alleged extremists on the dark web, officials said.\n\nThe movie, which won the Golden Lion for Best Film at the Venice International Film Festival in Italy earlier this month, is scheduled to be released nationwide on Oct. 4.\n\nSTOCK PHOTO/Getty Images\n\n\"Commanders need to be aware of this threat for Soldier and family safety and to increase situational awareness should they choose to attend the release of this movie at a local theater,\" reads the memorandum obtained by ABC affiliate state KSWO-TV in Lawton, Oklahoma.\n\nThe threat warranted the \"widest dissemination\" to the Fort Sills community although it was not directed at a specific theater.\n\nThe threat stirred fears of a repeat of the Sept. 20, 2012, mass shooting that left 12 people dead and 70 injured during a screening in Aurora, Colorado, of \"The Dark Knight Rises,\" another film about the same fictional Batman villain that won Heath Ledger a posthumous Academy Award.\n\nDisturbed by the violence depicted in a trailer for the \"Joker,\" loved ones of those killed in the massacre at the Aurora movie theater sent the film's distributor, Warner Brothers, a letter on Tuesday asking the studio to commit to gun control causes.\n\n\"Keeping everyone safe should be a top corporate priority for Warner Brothers,\" the letter reads.\n\nThe movie theater in Aurora, where the 2012 mass shooting occurred, has chosen not to screen the \"Joker,\" according to The Hollywood Reporter.\n\nIn a statement to ABC News, Warner Brothers said the film is fictional and not a glorification of \"real-world violence.\"\n\n\"Gun violence in our society is a critical issue, and we extend our deepest sympathy to all victims and families impacted by these tragedies,\" Warner Brothers' statement reads. \"Make no mistake: Neither the fictional character Joker, nor the film, is an endorsement of real world violence of any kind.\"\n\nThe Aurora movie theater where the 2012 mass shooting occurred has apparently chosen not to screen the \"Joker,\" according to The Hollywood Reporter.\n\nChristopher Grey, a spokesman for the U.S. Army Criminal Investigation Command, said the memorandum sent out by Fort Sill was done \"out of an abundance of caution.\"\n\nBrad Garrett, a former FBI special agent and ABC News contributor, said on \"Good Morning America\" on Thursday that such warnings are becoming more frequent.\n\n\"As law enforcement has moved through so many mass shootings and so many other types of violence, that when they get intelligence, even if it's not specific, they will pass it on to local or state authority just so they are aware,\" Garrett said.", "description": "The psychological thriller 'Joker' is set to be released on Oct. 4.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/movie-theater-rf-gty-ml-190926_hpMain_16x9_992.jpg", "published_at": "2019-09-26"}