{"pub": "yahoo", "url": "https://news.yahoo.com/homeless-man-sentenced-15-years-151857072.html", "downloaded_at": "2019-10-16 21:19:35.838337+00:00", "title": "A homeless man was sentenced to 15 years after pleading guilty to cocaine possession — but it turned out to just be powdered milk", "language": "en", "text": "Powdered cocaine is pictured in this undated handout photo courtesy of the United States Drug Enforcement Administration.\n\nREUTERS/US DEA/Handout\n\n\n\n\n\nCody Gregg, 29, was arrested on August 12, 2019, and, according to a probable cause affidavit seen by The Oklahoman, when Gregg's backpack was searched, an officer found a baggie that contained \"a large amount of white powder substance that I believed to be cocaine.\"\n\nThe affidavit said the powder \"later tested positive for cocaine and was a total package weight of 45.91 grams of cocaine.\"\n\nOklahoma Police charged Gregg with trafficking illegal drugs and he was jailed on a $50,000 bond. He initially pleaded not guilty, but in October he changed his plea.\n\nDays later Gregg withdrew his guilty plea after lab tests showed the powder was actually powdered milk. He told the judge that he got the powdered milk from a food pantry.\n\nGregg told a judge that he had pleaded guilty because he wanted to get away from poor conditions in the Oklahoma County Jail, according to the Washington Post.\n\nVisit Insider's homepage for more stories.\n\nA homeless man in Oklahoma was sentenced to 15 years in prison after pleading guilty to trafficking cocaine, but his case was dismissed after the substance turned out to be powdered milk.\n\nCody Gregg, 29, had his case in Oklahoma City dismissed on Friday, days after pleading guilty to possession of cocaine with intent to distribute, The Oklahoman reported.\n\nGregg told a judge that he initially pleaded guilty because he wanted to get away from poor conditions in the Oklahoma County Jail, which is plagued with overcrowding, chronic mold, and a high suicide rate, according to the Washington Post.\n\nThirty-five inmates have died while in custody at the jail since 2016, according to The Enid. The design of the building, say experts, has contributed to a culture of violence. Guards have poor visibility into holding areas, and inmates have been able to rip up pieces of the drop ceiling to create weapons.\n\nGregg was arrested on August 12, 2019, and, according to a probable cause affidavit seen by The Oklahoman, when Gregg's backpack was searched, an officer found a baggie that contained \"a large amount of white powder substance that I believed to be cocaine based on my training and experience.\"\n\nRead more: A 14-year-old boy shot his way in to a school before turning the gun on himself. Now his mother is facing 6 felony charges.\n\nAt the time of his arrest, Gregg was on probation and had been arrested three times on drug-related charges since 2014, The Washington Post reported.\n\nThe affidavit said the powder \"later tested positive for cocaine and was a total package weight of 45.91 grams of cocaine.\"\n\nAccording to a ProPublica investigation from 2016, thousands of people are jailed every year because roadside drug tests produce false positives. In Gregg's case, the powder later was proved to be powdered milk.\n\nBut still, police charged Gregg with trafficking illegal drugs and he was jailed on a $50,000 bond.\n\nHe initially pleaded not guilty, but in October he pleaded guilty to possession of a controlled dangerous substance with intent to distribute in an attempt to be moved out of the jail. Days later, his plea was reversed after his public defender pointed out the new evidence showing the powder tested negative for cocaine. He was freed on Friday.\n\nInsider has contacted the Oklahoma City Police Department for comment.\n\nNOW WATCH: This dog goalie holds 3 Guinness World Records", "description": "Cody Gregg, 29, had his case in Oklahoma City dismissed on Friday, days after pleading guilty to possession of cocaine with intent to distribute.", "authors": ["Kelly Mclaughlin"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Go1i8NS7rz9JSqzAwytIUg--~B/aD0xMjAwO3c9MjQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/insider_articles_922/6d7eeee0098786953e63c563bc0795db", "published_at": "2019-10-16"}