{"pub": "usatoday", "url": "https://usatoday.com/story/travel/airline-news/2019/10/04/thomas-cook-shutdown-rod-stewart-surprise-couple-las-vegas-wedding/3863179002", "downloaded_at": "2019-10-05 13:15:00.048246+00:00", "title": "Rod Stewart surprises couple after Thomas Cook collapse almost ruined their wedding plans", "language": "en", "text": "CLOSE British tour company Thomas Cook collapsed after failing to secure emergency funding, leaving tens of thousands of vacationers stranded abroad. USA TODAY\n\nThe Thomas Cook shutdown disrupted many a travel plan, but for one couple, it made a dream wedding come true – including a surprise performance from Rock Hall of Famer Rod Stewart at the ceremony.\n\nAndy Aitchison, of Liverpool, England, and his now-wife Sharon Cook were set to get married in Las Vegas until British tour company Thomas Cook shuttered in late September, leaving 150,000 people stranded. The bride and groom were set to fly to Las Vegas with their wedding guests and now needed to change their travel plans.\n\nDelta Air Lines flew the couple and 14 guests to Las Vegas for free and Caesars Palace put up the wedding party, Aitchison told USA TODAY.\n\nThe surprises didn't end there.\n\n\"Gets even more incredible as @CaesarsPalace tell us there will be some surprises at our wedding and all our guests are staying,\" Aitchison wrote on Twitter. \"Treated like royalty, do we deserve any of this? we reflect and can not believe what has happened.\"\n\nThey, along with their guests, received a warm welcome from Caesar's Palace upon their arrival.\n\nSir Rod Stewart sings during the wedding of Sharon Cook and Andrew Aitchison from Liverpool, England on October 2, 2019, in Las Vegas. (Photo: Denise Truscello, WireImage)\n\nWhen it came time for the ceremony, one guest they didn't expect showed up: Stewart! The singer serenaded the newlyweds with his 1991 hit cover of Van Morrrison's \"Have I Told You Lately.\"\n\n\"I'm sort of looking at our friends and family, going, 'What's going on?' \" Sharon told the BBC.\n\n\"So @rodstewart just turned up at our wedding and sang to my wife!\" Aitchison wrote.\n\n\"I can’t believe what has happened in the last week and this has just topped it off. Thank you Rod you’ve absolutely made our dream wedding you absolute legend.\"\n\nSo @rodstewart just turned up at our wedding and sang to my wife! I can’t believe what has happened in the last week and this has just topped it off. Thank you Rod you’ve absolutely made our dream wedding you absolute legend. We Can’t wait to see you Friday #LikeACaesar#SirRodpic.twitter.com/xIv9QmJhnD — Andy Aitchison (@AndyAitcho) October 3, 2019\n\n\"Congratulations to the happy couple!\" Stewart tweeted.\n\nInspiring: Bride-to-be turned Bahamas bachelorette party into a mission trip after Hurricane Dorian\n\nWeddings and travel can be disastrous: Hurricane Dorian: Norwegian cruise passenger's wedding weekend 'completely destroyed'\n\nRead or Share this story: https://www.usatoday.com/story/travel/airline-news/2019/10/04/thomas-cook-shutdown-rod-stewart-surprise-couple-las-vegas-wedding/3863179002/", "description": "The Thomas Cook shutdown disrupted many a travel plan, but for one couple, it made a dream wedding come true.", "authors": ["David Oliver", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/03/USAT/e97ac65c-0f72-46be-ada7-c2993ce8f410-14_GTY_1178675221.JPG?crop=3599,2024,x0,y248&width=3200&height=1680&fit=bounds", "published_at": "2019-10-04"}