{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7595115/Louis-Vuittons-artistic-director-calls-Donald-Trump-joke-days-designer-factory-visit.html", "downloaded_at": "2019-10-21 05:38:03.291841+00:00", "title": "Louis Vuitton's artistic director calls Donald Trump a joke, days after designer factory visit", "language": "en", "text": "Louis Vuitton’s artistic director has thrown a pointed jab at Donald Trump after the president appeared at the opening of the fashion house’s new workshop in rural Texas.\n\nNicolas Ghesquière, who is the artistic director of women’s collections, lambasted the president with an Instagram post on Sunday where he shared the album art for the song High Energy by Evelyn Thomas with the caption: 'Standing against any political action. I am a fashion designer refusing this association #trumpisajoke #homophobia.'\n\nThe song Ghesquière posted, High Energy, is a dance song that was prominent in gay clubs in the mid 80s.\n\nHis attack comes just three days after Donald Trump toured the Louis Vuitton workshop in Alvarado, Texas, located about 40 miles south of Fort Worth, along with LVMH CEO Bernard Arnault and Louis Vuitton CEO Michael Burke.\n\nLouis Vuitton's artistic director for the women's collection Nicolas Ghesquière blasted Donald Trump on Sunday on Instagram writing: '#trumpisajoke #homophobia'\n\nHe lambasted the president with an Instagram post on Sunday where he shared the album art for the song High Energy by Evelyn Thomas - a popular song in gay dance clubs in the 80s - with the caption: 'Standing against any political action. I am a fashion designer refusing this association'\n\nIn the October 17 Louis Vuitton factory visit the president stumbled on the pronunciation of the label's name and cut the ribbon to officially open the warehouse.\n\nHowever, Ghesquière, who has been with the historic fashion house since 2013, took a big step in distancing himself from Trump with the post.\n\nHe's just the latest fashion designer to denounce the president alongside Marc Jacobs, Tom Ford, and Philip Lim. A string of designers have gone so far as to vow to never dress First Lady Melania.\n\nHis poignant post was met with support and praise by industry fingers including Louis Vuitton’s accessories creative director Camille Miceli, Out Magazine editor-in-chief Phillip Picardi, makeup artist James Kaliardos, Veronika Heilbrunner, former Elle UK editor-in-chief Anne-Marie Curtis.\n\nHis post was directed against the Trump administration's treatment of the gay community.\n\nHis attack comes just three days after Donald Trump toured the Louis Vuitton workshop in Alvarado, Texas, located about 40 miles south of Fort Worth, along with LVMH CEO Bernard Arnault and Louis Vuitton CEO Michael Burke\n\nIn the October 17 Louis Vuitton factory visit the president bumbled on the pronunciation of the label's name and cut the ribbon to officially open the warehouse\n\nGhesquière has made a name for himself in championing a diverse and inclusive environment at Louis Vuitton where he cast trans and queer models\n\nTrump pictured at the factory with Alexandre Arnault, Chief Executive of LVMH (Louis Vuitton Moet Hennessy), and Bernard Arnault, CEO of Louis Vuitton Michael Burke\n\nLouis Vuitton did not comment on his post.\n\nGrab Your Wallet, a group that calls on shoppers to boycott businesses, told their followers to boycott the designer label.\n\n'Creating jobs is not an excuse to ignore morally repugnant behaviour,' Shannon Coulter, one of the movement’s founders said to Business of Fashion earlier this week. 'Businesses are willing to look the other way in order to work with the Trump administration, but it’s a worrisome trend.'\n\nGhesquière has made a name for himself in championing a diverse and inclusive environment at Louis Vuitton where he cast trans and queer models.\n\n'Seeing so many gender fluid and queer models being represented and being able to just be themselves is really inspiring,' he said on his work.\n\nHe also often works with Teddy Quinlivan, one of the most prominent fashion models in the industry at the moment. Quinlivan commented her support on Ghesquière's post writing: 'Thank you for standing on the right side of history.'\n\nBefore working at Louis Vuitton, Ghesquière spent 15 years at Balenciaga, from 1997 to 2013, as artistic director.", "description": "Louis Vuitton's artistic director Nicolas Ghesquière blasted Donald Trump on Sunday on Instagram writing: 'I am a fashion designer refusing this association.'", "authors": ["Marlene Lenthang For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/05/19976444-0-image-a-76_1571633322739.jpg", "published_at": "2019-10-21"}