{"pub": "cbs", "url": "https://cbsnews.com/news/alleged-bullying-attack-moreno-valley-california-middle-school-diego-boy-13-dies-from-injuries", "downloaded_at": "2019-09-26 15:05:27.906975+00:00", "title": "Boy, 13, dies from injuries from alleged bullying attack in Southern California middle school", "language": "en", "text": "Moreno Valley, California — A 13-year-old boy whose head struck a concrete pillar after he was punched by another boy at a middle school here has died from his injuries, CBS Los Angeles reports. The attack was caught on video.\n\nA vigil in his memory turned tense and drove a school official to stay inside the locked school, guarded by deputies. The boy, identified only as Diego, was pronounced clinically dead Tuesday night as a result of the injuries he sustained in a Sept. 16 attack, according to a Facebook post from the Moreno Valley Sheriff's Station.\n\nDiego, 13, in undated family photo CBS Los Angeles\n\nHis family plans to donate Diego's organs \"to transform this tragedy into the gift of life for other children.\"\n\nA vigil was held Wednesday night at Landmark Middle School in Moreno Valley, where Diego was a student. But grief turned to anger when Moreno Valley Unified Superintendent Dr. Martinrex Kedziora arrived.\n\n\"We are here for Diego,\" one girl said through tears. \"Diego lost his life today. Diego's not here no more.\"\n\nHundreds of parents and students were at the vigil in the city some 63 miles west of Los Angeles. It was marked by a small candlelit memorial at the gates of the school.\n\n\"What did the school district do? Nothing,\" one woman remarked. \"What did the school district do a week before, when the mother came pleading for her son's life? They did nothing. Where is the superintendent?\"\n\nKedziora addressed the mourners briefly, saying his goal is to work with community members and support them, but some in the crowd questioned his sincerity.\n\n\"We are the community, and you're not working with us,\" one woman said. \"We are the community.\"\n\nOthers said Kedziora should resign for what they said was a lack of action to curb an ongoing problem with bullying.\n\nWhat started as an emotional tribute to Diego ended with Kedziora seeking shelter inside the school behind locked doors as Riverside County sheriff's deputies stood outside.\n\n\"I just hope that all this teaches a lesson to the school district, because it's the one who needs to do something about it,\" one woman said.\n\nThe Riverside County District Attorney's Office said it filed complaints against two juveniles charging them with assault by means of force likely to produce great bodily injury in connection with the attack.\n\nParents at the vigil said they filed a petition with the school district and planned to state their case Thursday evening in front of Diego's memorial.", "description": "Moreno Valley, California parents angry over district's alleged lack of attention to bullying problem force superintendent to seek shelter behind locked school doors during vigil", "authors": [], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/09/26/b1cdee86-75e1-4511-b81a-47fd38828ba1/thumbnail/1200x630/ad064577cf6ecf619a0bfcf0ac2d3eab/bullying-victim-diego-moreno-valley-california0919.jpg", "published_at": "2019-09-26"}