{"pub": "fox", "url": "https://foxnews.com/politics/house-intel-republican-addresses-breaking-news-of-second-whistleblower-it-does-not-matter", "downloaded_at": "2019-10-07 00:11:51.832737+00:00", "title": "GOP Rep. Chris Stewart dismisses second whistleblower: 'Why should I care?'", "language": "en", "text": "Members of the House Intelligence Committee from both parties reacted to the news that there is a second whistleblower with knowledge pertaining to President Trump's July 25 phone call with Ukrainian President Volodymyr Zelensky.\n\nReps. Val Demings, D-Fla. and Chris Stewart, R-Utah, both appeared on \"Fox News Sunday.\" Demings' initial reaction to the news was to give it credence as she has with the first complaint filed Aug. 12, while Stewart was quick to dismiss the new individual, even with the understanding that they have firsthand knowledge of alleged wrongdoing, unlike the first whistleblower.\n\nATTORNEYS FOR WHISTLEBLOWER CONFIRM NEW INDIVIDUAL WITH FIRSTHAND KNOWLEDGE OF TRUMP UKRAINE CALL HAS COME FORWARD\n\n\"It does not matter,\" Stewart said, acknowledging that he was aware of the second whistleblower before news broke Sunday morning. \"This person is gonna come forward and say, 'Yep, the president had this phone call and, yep, that’s the transcript.' Uh, I mean, why should I care at all what his perspective, or his opinion, uh, judgment of this transcript is? You and I can read it.\"\n\nHe stated that, according to the memo from the White House containing the contents of the call, Trump did not mention the 2020 election or any quid pro quo. Democrats maintain that Trump used an implied threat of withholding military aid to Ukraine as leverage to have them assist in investigations of Joe Biden and his son Hunter, as well as possible collusion between Ukraine and the Democratic National Committee in the 2016 election.\n\nStewart said that all Trump was doing was looking to uncover possible corruption, and that he was not using his office for political gain.\n\nDemings, meanwhile, said that the White House document \"corroborates everything, all of the information that is in the whistleblower's report,\" and that it could support impeachment.\n\n\"I believe if you look at the evidence over the past about ten days or so, right now I think it’s pretty clear that the president tried to coerce a foreign country into investigating a political rival and use much-needed military aid as a condition of a deal,\" she said, later stating, \"I think the elements are there, I think the evidence that we need are there, and I do believe based on that that we will have to take a serious look at articles of impeachment.\"\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nStewart said that Democrats are \"giddy\" over the whistleblower complaint because they have been trying to impeach Trump throughout his presidency.\n\n\"These guys are giddy over this. They’re not in pain over this. And it’s not been the last ten days. It’s been three years. Three years they’ve been trying to impeach this president! Three years they’ve been looking for reasons to remove him from office. They're not pained by this, they're excited about this.\"", "description": "Members of the House Intelligence Committee from both parties reacted to the news that there a second whistleblower with knowledge pertaining to President Trump's July 25 phone call with Ukrainian President Volodymyr Zelensky.", "authors": ["Ronn Blitzer"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/AP-Chris-Stewart.jpg", "published_at": "2019-10-06"}