{"pub": "marketwatch", "url": "https://marketwatch.com/story/how-i-bought-a-home-in-one-of-the-most-expensive-real-estate-markets-in-the-us-2019-09-06", "downloaded_at": "2019-09-06 12:11:09.706385+00:00", "title": "How I bought a home in one of the most expensive real-estate markets in the U.S.", "language": "en", "text": "As San Francisco’s cool, hip neighbor, Oakland may offer slightly more affordable home prices, but they’re still jaw-droppingly expensive by most standards. According to Zillow, Z, -0.74% the median home value is $732,800.\n\nJames Edmondson, 31, who runs a type design company, and Sadie Fenton, 35, a restaurant server, experienced the competitive — and often disheartening — housing market while scrambling to buy a home in Oakland last year before their daughter was born.\n\nEdmondson shared the intense ups and downs of their homebuying journey, from exceeding their initial budget by more than $300,000 to finally landing their two-bedroom home in the Glenview area of Oakland. (This transcript has been lightly edited for clarity and length.)\n\nWhat brought you to Oakland?\n\nSadie was born in San Francisco, and I was born near San Luis Obispo, California. I moved to San Francisco when I was 19 and eventually transferred to an art school in Oakland.\n\nWhy did you decide to buy a home in Oakland?\n\nWe had been renting in San Francisco and generally felt that landlords could throw us out at a certain point. That uncertainty and dependence on landlords became less and less attractive. Some people say that renting is like throwing away money, which I don’t believe — you’re paying for a valuable service — but we were thinking about starting a family and wanted to give homebuying a shot.\n\nWe checked out other areas in the East Bay, like San Leandro, El Cerrito and Berkeley, but I really wanted to live in Oakland again.\n\nWhat were you looking for in a home?\n\nI wanted a garage space, and Sadie wanted a formal dining area. We wanted a good neighborhood and to be close to shops and restaurants. I didn’t want to leave the city vibe altogether. We were flexible on the rest because we knew we had incredible competition in this market, especially at the time we were looking.\n\nWhat was your homebuying journey like?\n\nWe called our real-estate agent at the beginning of 2018. We didn’t search very seriously the first month, but Sadie was pregnant and our due date was May 23, so that was our deadline. It ended up taking us around three months to find a home.\n\nWe knew we weren’t going to get a great deal; the competition was so thick. It didn’t seem like we were going to stumble on some bargain. We looked at close to 20 houses in person and spent so much time browsing on Redfin — it took up our whole lives. We put in an offer on one house in San Leandro, but we weren’t even close to getting it. The same thing happened for another house in San Leandro. We were off by $100K. Losing those two offers was a reality check. We needed to be real with ourselves and understand that this was a ludicrous market.\n\nWe ended up finding a two-bedroom in a neighborhood with a school we liked and at a price point we thought we could work with, and moved in March 2018. I think we were successful with this house and beat out five other offers because we bid almost 40% over the asking price.\n\nHow did you know that the home was the one for you?\n\nIt wasn’t that romantic or obvious. We loved the house, but we loved a lot of the houses we checked out. Our house is busted and disgusting from the outside, but the inside is great. It’s a classic, 100-year-old Craftsman with cool details and built-ins. The kitchen is super dated and has an old-school oven range. It feels very cozy and warm; that was important to us.\n\nWhat’s your approach to finance, and how did you save for the home?\n\nI’m a saver. Coming into this, I had a healthy retirement account and started saving when I was 19, but I’ve since learned about the FIRE movement, and now my goal is to be mortgage-free in 10 years. I don’t care about clothes, cars, eating out or going to bars, so that helped.\n\nSee: Want to retire, but can’t quite yet? Welcome to ‘barista FIRE’\n\nOur budget was initially in the mid-$600,000 range, but everything was 10-20% over asking price. We were faced with the reality that we’d have to stretch to make it work. It eventually went all the way up to $982,000, which is what we ended up paying. Sadie and I both had savings, but we also had to borrow $55,000 from my older brothers, which ended up being around 18% of the down payment. We put down around $300K, which we had saved up.\n\nWere there any surprises or challenges? Would you have done anything differently?\n\nThe hardest part was realizing what a full-time job it is to go through the escrow process, secure the mortgage and fill out all the paperwork. It was insanely stressful. If it was just me, there’s a strong possibility I would have done a tiny home or moved to a less expensive area. It’s not necessary for everyone to go the traditional route of buying a home. But when I consider Sadie and our child, it was the best-case scenario.\n\nWhat advice would you give to someone considering moving to Oakland?\n\nKeep expenses low by thinking about what truly matters to you. Also have a lot of compassion for yourself. It was easy to feel stupid and stressed out during the process. I thought we were in over our heads. It’s healthy to remind yourself that buying a home is something that you will do very few times in your life.\n\nRead: America’s zip codes are becoming more economically segregated — how this impacts you and your kids\n\nOakland really varies. There are $4 million houses just a couple streets over from neighborhoods that are really gnarly — where you wouldn’t want to walk alone at night.\n\nAdvice for first-time home buyers\n\nDeidre Joyner, the real-estate agent who helped Edmondson and Fenton purchase their home, shared a few tips for first-time home buyers in Oakland:\n\nFind a local mortgage lender. Joyner says a local mortgage lender can offer more flexibility and help you stand out from other offers. “If all things are equal, a locally known real-estate agent and mortgage lender can make a difference. They often can work nonbanking hours and are easier to reach on a weekend.”\n\nExpect to spend a lot… “Unfortunately, prices have skyrocketed in the last six years. This is a very sought-out community, with its close proximity to San Francisco and good weather,” Joyner says. “I see people spending between $750,000 and $950,000, and that’s not including notoriously expensive Oakland neighborhoods like Rockridge or Crocker Highlands.”\n\n…but the market may be shifting. Joyner says buyers are gradually being more selective. “There was a frenzy of people getting in and buying homes that weren’t that great, but now my clients are thinking more critically and have a more discriminating mind-set. They won’t just buy anything,” she says.\n\nMore from NerdWallet:", "description": "Going over budget by $300,000 and bidding 40% over asking, plus lots and lots of savings.", "authors": ["Valerie Lai"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ424_nerd_o_ZG_20190829145353.jpg", "published_at": "2019-09-06"}