{"pub": "cbs", "url": "https://secure-fly.cbsnews.com/news/top-budget-office-officials-state-department-official-subpoenaed-in-impeachment-inquiry-today-2019-10-25", "downloaded_at": "2019-10-25 21:58:26.120904+00:00", "title": "3 more Trump officials subpoenaed in impeachment inquiry", "language": "en", "text": "Three more Trump administration officials have been subpoenaed in Democrats' impeachment inquiry, adding to the growing list of insiders caught between a subpoena and the White House's insistence that they not testify.\n\nThe three officials — Russell Vought, acting director of the Office of Management and Budget (OMB); Michael Duffey, OMB's associate director for National Security Programs and T. Ulrich Brechbuhl, a State Department counselor — all declined to voluntarily comply with earlier requests. Earlier this month, the White House told top Democrats that it would not comply with the ongoing impeachment inquiry by providing witnesses or documents.\n\nBut this week, House Intelligence Committee Chairman Adam Schiff, House Foreign Affairs Committee Chairman Eliot Engel and acting House Oversight and Reform Committee Chairwoman Carolyn Maloney demanded that the officials testify on November 5 and November 6.\n\n\"Your failure or refusal to appear at the deposition, including at the direction or behest of the president or the White House, shall constitute evidence of obstruction of the House's impeachment inquiry and may be used as an adverse inference against the president,\" letters from the Democrats read.\n\nAlso this week, Tim Morrison, a top national security adviser for Russia and Europe, became the first current White House official to agree to testify if subpoenaed.\n\nOMB, the agency where Vought and Duffey work, was involved in the delayed release of aid to Ukraine as President Trump tried to withhold it to entice the foreign country to investigate his political opponent, Democratic presidential candidate Joe Biden. This is what sparked House Democrats to launch the impeachment inquiry.\n\nTheir testimonies will be shared among the three committees involved in the impeachment inquiry but not the full Congress or the public — yet. Schiff has said that all the transcripts will eventually be released to the public, but he insists that the hearings must remain closed for now to keep witnesses from coordinating their testimonies.\n\nStill, Senate Republicans introduced a measure on Thursday that would officially condemn Democrats for the secrecy of the impeachment process. Their resolution calls on House Democrats to hold a formal vote to initiate an impeachment inquiry, to allow the president to call witnesses in his defense and to give House Republicans the ability to issue subpoenas.", "description": "This adds to the growing list of insiders caught between a subpoena and the White House's insistence that they not testify", "authors": ["Kathryn Watson", "Kathryn Watson Is A Politics Reporter For Cbs News Digital."], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/05/01/d5f95b1d-f0b2-4d55-816f-7eae922473b4/thumbnail/1200x630/f7ced32189f2fcf146842d7ba7777522/ap-19071547994285.jpg", "published_at": "2019-10-25"}