{"pub": "abcnews", "url": "https://abcnews.go.com/US/1300-registered-unaccounted-bahamas-aftermath-hurricane-dorian/story?id=65562278", "downloaded_at": "2019-09-12 23:37:18.010160+00:00", "title": "1,300 registered as unaccounted for in the Bahamas in aftermath of Hurricane Dorian", "language": "en", "text": "As search-and-recovery crews comb through the hundreds of homes in the Bahamas wrecked by Hurricane Dorian, officials on the island nation released an alarming figure: 1,300 people have been registered by loved ones as unaccounted for.\n\nInterested in Hurricane Dorian? Add Hurricane Dorian as an interest to stay up to date on the latest Hurricane Dorian news, video, and analysis from ABC News. Add Interest\n\nThe official death toll from the hurricane that ripped across the Bahamas on Sept. 2 remains at 50, but authorities say they expect it to climb dramatically and warned many victims may have been washed out to sea and may never be recovered.\n\nThe individuals that haven't been accounted for in the deadly storm have been registered on the Bahamian government's missing persons registry, Carl Smith, a spokesman for the Bahamian National Emergency Management Agency, said at a news conference on Wednesday.\n\nSjoerd Hilckmann/Dutch Defense Ministry via AP\n\nOfficials are hopeful that many of those registered as unaccounted for will eventually surface as survivors, Smith added.\n\nOn Wednesday, Bahamian officials said 2,500 people were listed on the registry. But as officials began to check the list against government records of people staying in shelters or who have been evacuated, they dramatically reduced the list by 1,200 names.\n\nHe said the whereabouts of some survivors remains unknown because the power and communication infrastructure in the hard-hit Abaco Islands -- including a power station at Marsh Harbour that was \"completely destroyed\" -- has been obliterated.\n\nDorian slammed the Bahamas as a monster Category 5 hurricane, tying the record for the strongest Atlantic hurricane ever to make landfall.\n\nThe hurricane left about 76,000 people homeless and in need of assistance in the Abaco Islands and Grand Bahama Island, where entire neighborhoods were leveled by the storm's 183 mph winds, according to the United Nations.\n\nAndrew Caballero-Reynolds/AFP/Getty Images\n\nFood, clean water, shelter, health and sanitation services are in critical need in the aftermath of the hurricane, officials said. Businesses and celebrities are making commitments to assist the Bahamas, and organizations are asking the public to help with the relief efforts.\n\nReigning Masters golf champion Tiger Woods and singer Justin Timberlake are the latest celebrities to join the relief effort.\n\nWoods tweeted on Thursday that he and Timberlake are partnering with pro golfer Ernie Eles, the international hospitality real estate development company Nexus Luxury Collection, and the luxury resort community The Albany, Bahamas, to establish the ONE Bahamas Fund with $6 million and challenged others to donate and help reach a goal of $12 million.\n\n2) We've established the #onebahamasfund with a challenge gift of $6 million, matching dollar for dollar the next $6 million raised. Help us turn this first $6 million into $12 million, and join our efforts to restore and rebuild The Bahamas. — Tiger Woods (@TigerWoods) September 12, 2019\n\nNBA legend Michael Jordan pledged $1 million to help islanders recover from the hurricane.\n\n\"I am devastated to see the destruction that Hurricane Dorian has brought to the Bahamas, where I own property and visit frequently,\" Jordan said in a statement posted on Twitter on Wednesday by his manager, Estee Portnoy. \"My heart goes out to everyone who is suffering and to those who have lost loved ones.\"\n\nStatement From Michael Jordan pic.twitter.com/JIcPGE8y2C — Estee Portnoy (@esteep) September 10, 2019\n\nOther celebrities and entrepreneurs such as Rihanna, who hails from the Caribbean island nation of Barbados, and Richard Branson, who owns a home in the Bahamas, have also pledged to help in the recovery.\n\nRelief organizations, including the Red Cross and Mercy Crops, have sent teams and supplies to the Bahamas.\n\nYou are in our prayers and @ClaraLionelFdn is already figuring out how best we can help! #HurricaneDorain #Bahamas — Rihanna (@rihanna) September 2, 2019\n\n\"Over the past several days, I’ve seen firsthand the devastation Dorian has caused on Abaco Islands and Grand Bahama, the two most affected areas. Roads, airports and houses are destroyed and thousands of people have been left without power and with few possessions,\" Christy Delafield, spokesperson for Mercy Corps, told ABC News.\n\nDelafield said Mercy Corps has been distributing solar lanterns equipped with USB chargers, mosquito nets, tarps and other emergency supplies to survivors, many who lost their homes and all their belongings in the hurricane.\n\nAlso helping is 19-year-old pilot Andi Million of Naples, Florida, who along with her flight instructor at the Career Flight Training and Aircraft Rental, flew a plane full of pet supplies and other emergency items to the Abaco Islands on Tuesday.\n\n\"It’s hard not to be overwhelmed by the desire to help more and give absolutely everything you have on you at that time,\" Million wrote in a Facebook post on Wednesday.\n\nSmith said that more than 5,500 people have been evacuated from the Abaco Island and Grand Bahama to New Providence, the most populated Bahamian island, which includes the capital Nassau. He said several thousand people have also been evacuated to the United States.\n\nABC News' Samara Lynn contributed to this report.", "description": "Dorian struck the Bahamas on Sept. 2 at as Category 5 hurricane", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/Bahamas-1-ap-er-190912_hpMain_16x9_992.jpg", "published_at": "2019-09-12"}