{"pub": "bbc", "url": "https://bbc.com/news/science-environment-49855058", "downloaded_at": "2019-09-27 14:59:09.230389+00:00", "title": "Giant planet around tiny star 'should not exist'", "language": "en", "text": "Image copyright University of Bern Image caption Artwork: The gaseous world and its star are about 30 light-years from us\n\nAstronomers have discovered a giant planet that, they say, should not exist, according to current theories.\n\nThe Jupiter-like world is unusually large compared with its host star, contradicting a widely held idea about the way planets form.\n\nThe star, which lies 284 trillion km away, is an M-type red dwarf - the most common type in our galaxy.\n\nAn international team of astronomers has reported its findings in the journal Science.\n\n\"It's exciting because we've wondered for long a time whether giant planets like Jupiter and Saturn can form around such small stars,\" said Prof Peter Wheatley, from the University of Warwick, UK, who was not involved with the latest study.\n\n\"I think the general impression had been that these planets just didn't exist, but we couldn't be sure because small stars are very faint, which makes them difficult to study, even though they are much more common than stars like the Sun,\" he told BBC News.\n\nResearchers used telescopes in Spain and the US to track gravitational accelerations of the star that might be caused by planets orbiting it.\n\nThe red dwarf has a larger mass than its orbiting planet - named GJ 3512b. But the difference in their size is much smaller than it is between, say, the Sun and Jupiter.\n\nThe distant star has a mass that's, at most, 270 times larger than the planet. For comparison, the Sun is about 1,050 times more massive than Jupiter.\n\nImage copyright Calar Alto Observatory Image caption The star was discovered using the Calar Alto observatory in Spain\n\nAstronomers use computer simulations to inform their theories of how planets form out of the clouds, or \"discs\", of gas and dust orbiting young stars. These simulations predict that many small planets should gather around tiny M-type dwarf stars.\n\n\"Around such stars there should only be planets the size of the Earth or somewhat more massive Super-Earths,\" said co-author Christoph Mordasini, a professor at the University of Bern, Switzerland.\n\nOne real-life example of a planetary system that conforms to the theory is the one around a star known as Trappist-1.\n\nThis star, which lies 369 trillion km (39 light-years) from the Sun, hosts a system of seven planets, all with masses roughly equal to - or slightly less than - that of Earth.\n\n\"GJ 3512b, however, is a giant planet with a mass about half as big as the one of Jupiter, and thus at least one order of magnitude more massive than the planets predicted by theoretical models for such small star,\" said Prof Mordasini.\n\nThe finding challenges the widely held idea of planet formation known as core accretion.\n\n\"Usually we think of giant planets starting life as an icy-core, orbiting far out in a disc of gas surrounding the young star, and then growing rapidly by attracting gas on to itself,\" said Prof Wheatley.\n\n\"But the authors argue that the discs around small stars don't provide enough material for this to work. Instead, they consider it more likely that the planet formed suddenly when part of the disc collapsed due to its own gravity.\"\n\nThe authors of the Science paper propose that such a collapse can occur when the disc of gas and dust has more than about one-tenth the mass of the parent star. Under these conditions, the gravitational effect of the star becomes insufficient to keep the disc stable.\n\nMatter from the disc is drawn inwards to form a gravitationally bound clump, which develops over time into a planet. The idea predicts that this collapse occurs further out from the star, while planets can occur by core accretion much closer in.\n\nImage copyright ESO / M Kornmesser/Nick Risinger\n\nProf Wheatley co-authored a study in 2017 that described a gas giant called NGTS-1b, which was found with UK-led telescopes in Chile. NGTS-1b is also very large compared with the size of its parent star - another M-type red dwarf that lies 600 light-years (five quadrillion km) away.\n\n\"The parent star, NGTS-1, is small, but not as small as this new example (GJ 3512). It could be that NGTS-1 represents the smallest star that can form close-in planets via core-accretion, and that smaller stars only form giant planets farther out by the gravitational collapse model favoured by the authors,\" said Prof Wheatley.\n\n\"These kinds of predictions are invaluable in directing future searches, allowing us to test these models.\"\n\nIndeed, the authors of the study in Science suggest that GJ 3512b must have migrated over a long distance to its current position of under 1 astronomical unit (150 million km; 93 million miles).\n\nWith its oval-shaped 204-day orbit around the star, GJ 3512b spends most of its time closer to its parent red dwarf than Mercury's distance to the Sun. The gas giant's eccentric orbit points to the presence of other giant planets orbiting further out that could have distorted its orbit.\n\nCo-author Hubert Klahr from the Max Planck Institute for Astronomy in Heidelberg, Germany, said: \"Until now, the only planets whose formation was compatible with disc instabilities were a handful of young, hot and very massive planets far away from their host stars.\n\n\"With GJ 3512b, we now have an extraordinary candidate for a planet that could have emerged from the instability of a disc around a star with very little mass. This find prompts us to review our models.\"\n\nFollow Paul on Twitter", "description": "The Jupiter-like world is unusually large compared with its host star, challenging existing theories.", "authors": ["Paul Rincon", "Science Editor", "Bbc News Website"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/940B/production/_108999873_planet.jpg", "published_at": "2019-09-27"}