{"pub": "independent", "url": "https://independent.co.uk/sport/football/emiliano-sala-cardiff-city-nantes-pay-fee-transfer-instalment-a9127161.html", "downloaded_at": "2019-10-01 00:15:22.423575+00:00", "title": "Emiliano Sala: Fifa orders Cardiff to pay £5.3m first instalment of transfer fee to Nantes", "language": "en", "text": "Cardiff have been ordered to pay the first instalment of the transfer fee for Emiliano Sala, who died before he could play a single game for the Welsh club.\n\nThe Argentinian, 28, died when the light aircraft he was travelling in from France to the UK crashed into the English Channel on January 21 of this year, two days after the Bluebirds, then in the Premier League, had announced his signing from French club Nantes.\n\nHis body was found and recovered from the wreckage of the aircraft in February. The pilot, David Ibbotson, is still missing.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nNantes demanded that Cardiff should pay the first instalment of the overall £15million transfer fee, equating to six million euros or £5.3million, something the Welsh club contest on the grounds that Sala's revised contract was not signed and that his playing registration was not complete.\n\nThe case ended up at FIFA's players' status committee, which announced on Monday that Cardiff must pay the first instalment.\n\nShape Created with Sketch. Emiliano Sala: Career in pictures Show all 12 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Emiliano Sala: Career in pictures 1/12 Emiliano Sala Cardiff City striker Emiliano Sala is missing and feared dead after an aeroplane carrying him and one other person went missing over the English Channel AFP/Getty 2/12 Emiliano Sala He first moved to France in 2011 before joining Bordeaux and making his debut in 2012 Getty 3/12 Emiliano Sala Sala arrived at Bordeaux after playing for Club Proyecto Crecer in Argentina Getty 4/12 Emiliano Sala In Ligue 1, Sala found himself going up against some of the best-known defenders such as PSG’s David Luiz Getty 5/12 Emiliano Sala He would join Caen on loan in 2015 Getty 6/12 Emiliano Sala While with Bordeaux, Sala also spent time on loan with US Orleans and Chamois Niort Getty 7/12 Emiliano Sala In 2015, Sala secured a move to Ligue 1 side Nantes EPA 8/12 Emiliano Sala Sala played 130 times for Nantes, scoring 48 goals in all competitions AFP/Getty 9/12 Emiliano Sala His form in France saw him catch the eye of a number of clubs around Europe AFP 10/12 Emiliano Sala Sala was the fifth-highest goalscorer in Ligue 1 this season with 12 goals in 19 games Getty 11/12 Emiliano Sala Sala agreed to join Cardiff in a club-record £15m deal on Saturday 19 January Cardiff City 12/12 Emiliano Sala Sala’s flight to Cardiff went missing on Monday 21 January and is believed to have crashed into the English Channel Getty 1/12 Emiliano Sala Cardiff City striker Emiliano Sala is missing and feared dead after an aeroplane carrying him and one other person went missing over the English Channel AFP/Getty 2/12 Emiliano Sala He first moved to France in 2011 before joining Bordeaux and making his debut in 2012 Getty 3/12 Emiliano Sala Sala arrived at Bordeaux after playing for Club Proyecto Crecer in Argentina Getty 4/12 Emiliano Sala In Ligue 1, Sala found himself going up against some of the best-known defenders such as PSG’s David Luiz Getty 5/12 Emiliano Sala He would join Caen on loan in 2015 Getty 6/12 Emiliano Sala While with Bordeaux, Sala also spent time on loan with US Orleans and Chamois Niort Getty 7/12 Emiliano Sala In 2015, Sala secured a move to Ligue 1 side Nantes EPA 8/12 Emiliano Sala Sala played 130 times for Nantes, scoring 48 goals in all competitions AFP/Getty 9/12 Emiliano Sala His form in France saw him catch the eye of a number of clubs around Europe AFP 10/12 Emiliano Sala Sala was the fifth-highest goalscorer in Ligue 1 this season with 12 goals in 19 games Getty 11/12 Emiliano Sala Sala agreed to join Cardiff in a club-record £15m deal on Saturday 19 January Cardiff City 12/12 Emiliano Sala Sala’s flight to Cardiff went missing on Monday 21 January and is believed to have crashed into the English Channel Getty\n\nThe committee's statement read: \"In a meeting held on September 25, 2019, the FIFA players' status committee established that Cardiff must pay Nantes the sum of 6,000,000 euros, corresponding to the first instalment due in accordance with the transfer agreement concluded between the parties on January 19, 2019 for the transfer of the late Emiliano Sala from Nantes to Cardiff.\n\n\"The FIFA players' status committee, which never lost sight of the specific and unique circumstances of this tragic situation during its deliberations on the dispute at stake, refrained from imposing procedural costs on the parties.\n\n\"The findings of the decision were notified to the parties concerned today. Within a deadline of 10 days, Cardiff and Nantes can request a copy of the grounds of the decision, which can be appealed to the Court of Arbitration for Sport in Lausanne.\"\n\nCardiff released a statement in response to the judgement, seeking clarification before deciding whether to appeal.\n\nThe statement released to the PA news agency read: \"Cardiff City FC acknowledges the decision announced today by FIFA's players' status committee regarding the transfer of Emiliano Sala.\n\n\"We will be seeking further clarification from FIFA on the exact meaning of their statement in order to make an informed decision on our next steps.\"\n\nIt has been reported that the judgement also compels Cardiff to pay the other instalments in the deal when they fall due, but FIFA could not confirm this when contacted by PA owing to \"confidentiality reasons\".\n\nA report from the Air Accidents Investigation Branch (AAIB) which was published in August found that Sala had a high concentration of carbon monoxide in his bloodstream prior to the plane crash.\n\nRepresentatives of Cardiff, including manager Neil Warnock, attended Sala's funeral in Argentina in February.\n\nWarnock said at the time: \"Things like this don't happen in football. I have been a manager nearly 40 years and I've never known anything like this.\n\n\"It has been so emotional. People say 'he never played for you' but he was my player. I chased him, I wanted him.\n\n\"He was my type of player - a scruffy player with a big heart. As a person I don't know anyone who has a bad word to say about him.\"\n\nPA", "description": "Cardiff have been ordered to pay the first instalment of the transfer fee for Emiliano Sala, who died before he could play a single game for the Welsh club. The Argentinian, 28, died when the light aircraft he was travelling in from France to the UK crashed into the English Channel on January 21 of this year, two days after the Bluebirds, then in the Premier League, had", "authors": ["Jamie Gardner"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/02/25/19/AFP-1CH4SK.jpg", "published_at": "2019-09-30"}