{"pub": "businessinsider", "title": "Finale col botto a Biarritz:Trump privatizza il G7, invita Putin e lo vuole tenere nel suo Resort a Miami – Business Insider Italia", "url": "https://it.businessinsider.com/trump-vuole-putin-al-prossimo-g7-che-vuole-tenere-nel-suo-resort-a-miami-in-florida-e-scoppia-la-polemica-sui-conflitti-di-interesse", "language": "", "published_at": "2019-08-26", "downloaded_at": "2019-09-02 07:10:53.776099+00:00", "text": "A suo avviso si tratta semplicemente della migliore location tra i 12 siti esaminati, perché è “un luogo fantastico”, vicino a un aeroporto internazionale, con hotel e grandi ristoranti. Il presidente ha quindi sostenuto che “essere presidente mi costerà, tra perdite e opportunità mancate, probabilmente tra i 3 e i 5 miliardi di dollari”. “Ma la sola cosa che mi interessa è questo Paese, altrimenti non l’avrei fatto”, ha aggiunto. I suoi detrattori continuano invece a contestargli vari conflitti di interesse.\n\n\n\nGli europei sono invece contrari all’invito esteso a Putin escluso dal summit dei grandi per ritorsione alla sua annessione della Crimea. Anzi nel comunicato finale si dice che che la “Francia e Germania organizzeranno nelle prossime settimane un vertice in formato Normandia per ottenere dei risultati concreti”, cioè ci sarà un vertice per trovare la pace tra Russia e Ucraina nella versione che include Germania e Francia ma escude fra l’altro l’Italia che però paga caro per la partecipazione alle sanzioni economiche Ue alla Russia.\n\nCommercio mondiale e Iran\n\n\n\nIl G7 che raggruppa economie che rappresentano il 60% della ricchezza globale, il 40% della sua produzione e il 10% della sua popolazione, ha perso importanza rispetto al G20 ma dovrebbe essere più incisivo perché più coeso in quanto formato da liberaldemocrazie di tipo occidentale. Il rientro di Putin in questo senso sarebbe un elemento di destabilizzazione visto che il presidente russo ha definito in declino il sistema liberal-democratico in una recente intervista al Financial Times che ha fatto parecchio discutere.\n\n“Il G7 è impegnato per un commercio mondiale aperto e giusto” e punta “alla stabilità dell’economia mondiale”. Per questo intende cambiare “profondamente” il Wto e si impegna a trovare un accordo entro il 2020 per riformare la fiscalità internazionale nel quadro dell’Ocse. Lo si legge nella dichiarazione finale del G7 . Il comunicato non ha affrontato nessun tema particolare in materia commerciale per evitare che gli Usa si rifiutassero di firmare le conclusioni così come avvene la scorsa volta in Canada quando Trump lasciò il summit prima che questo terminasse.", "description": "", "authors": [], "top_image": "https://cdn.gelestatic.it/businessinsider/it/2019/08/GettyImages-1164163266-1024x681.jpg"}