{"pub": "yahoo", "url": "https://news.yahoo.com/bmw-recalling-more-250-000-172149627.html", "downloaded_at": "2019-10-10 08:35:06.793856+00:00", "title": "BMW Is Recalling More Than 250,000 Vehicles Due to Back-Over Concerns", "language": "en", "text": "Consumer Reports has no financial relationship with advertisers on this site.\n\nBMW is issuing a wide recall on recent models because the display settings can be changed so that the rear camera view is turned off when the car is in Reverse. Additionally, the system will retain those settings the next time the vehicle is driven.\n\nThe National Highway Traffic Safety Administration says the issue could increase the risk of a crash and also does not adhere to federal safety standards. (See our guide to backup cameras.)\n\nThe recall affects many 2018-2020 BMW vehicles, as well as some Rolls-Royce models and the Toyota Supra, which was co-developed with BMW. (Rolls-Royce is owned by BMW.)\n\nThe recall is expected to begin November 19, 2019.\n\nThe Details\n\nVehicles recalled:\n\nThe problem: The backup camera display settings may be changed so that it does not show behind the vehicle when the transmission is placed in Reverse.\n\nThe fix: Dealerships will update the backup camera software, free of charge.\n\nHow to contact the manufacturer: Owners may contact BMW customer service at 1-800-525-7417 or Rolls-Royce at 1-877-877-3735. Toyota Supra owners may contact Toyota customer service at 1-888-270-9371.\n\nNHTSA campaign number: 19V684000\n\nCheck to see whether your vehicle has an open recall: NHTSA’s website will tell you whether your vehicle has recalls that need to be addressed.\n\nIf you plug your car’s 17-digit vehicle identification number (VIN) into NHTSA’s website and a recall doesn’t appear, it means your vehicle doesn’t currently have any. Because automakers issue recalls often, and for many older vehicles, we recommend checking back regularly.\n\n2018 BMW 540d\n\n2018-2019 640i xDrive Gran Turismo and Rolls-Royce Phantom\n\n2018-2020 530i, 530i xDrive, 540i, 540i xDrive, M550i xDrive, M5, 530e, 530e xDrive, X3 sDrive, X3 xDrive, X3 M40i, X3 M\n\n2018-2020 530i, 530i xDrive, 540i, 540i xDrive, M550i xDrive, M5, 530e, 530e xDrive, X3 sDrive, X3 xDrive, X3 M40i, X3 M 2019-2020 X4 xDrive, X4 M40i, X4 M, X7 xDrive, X7 M50i, 740Li, 740Li xDrive, 750Li, 750Li xDrive, 8 Series Convertible and Coupe 840i, 840i xDrive, M850i xDrive, X5 sDrive, X5 xDrive, X5 M50i, X6 xDrive, X6 M50i, 330i, 330i xDrive, M340i, M340i xDrive, Z4 sDrive, Z4 M40i, 740Le xDrive and 745Le xDrive\n\n2019 M850i xDrive Gran Coupe and Rolls-Royce Cullinan\n\n2020 Toyota Supra vehicles\n\nMore from Consumer Reports:\n\nConsumer Reports is an independent, nonprofit organization that works side by side with consumers to create a fairer, safer, and healthier world. CR does not endorse products or services, and does not accept advertising. Copyright © 2019, Consumer Reports, Inc.", "description": "BMW is issuing a wide recall on recent models because the display settings can be changed so that the rear camera view is turned off when the car is in Reverse. Additionally, the system will reta...", "authors": ["Jeff S. Bartlett"], "top_image": "https://s.yimg.com/uu/api/res/1.2/_J9CEhIudRU7kGxevOKNYg--~B/aD02NzQ7dz0xMTk5O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/autos.consumerreports.org/0e1343e5560fee8a841ed036801cc535", "published_at": "2019-10-09"}