{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/ghostbusters-video-game-remastered-review-bustin-makes-feel-nostalgic-10876532", "downloaded_at": "2019-10-07 20:11:25.352233+00:00", "title": "Ghostbusters: Video Game Remastered review – bustin’ makes you feel OK", "language": "en", "text": "Ghostbusters: The Video Game Remastered (PS4) – you know what not to cross\n\nThe closest thing to Ghostbusters 3 there’ll ever be is remastered for modern consoles, but does it deserve to rise from the grave?\n\nNo doubt some malcontent will suggest otherwise in the comments section, but we’ve never met anyone who will admit in public that they don’t like Ghostbusters. At the mere mention of the film, anyone that saw it as a child is likely to suffer a spontaneous outbreak of mangled quotes, theme tune singing and/or impressions of the Ecto-1 siren. Or they could just play this game and have it do all that for them.\n\nGhostbusters: The Video Game was originally released in 2009 by Activision, although the Call Of Duty publisher had no interest in the game and had only picked it up by accident during the merger with Vivendi Games, who at the time owned Blizzard Entertainment. So despite it clearly being a labour of love by (now defunct) developer Terminal Reality, and involving almost the entire principle cast of the first two movies, it got largely ignored by the general public.\n\nAdvertisement\n\nAdvertisement\n\nThose that were aware of it at the time will know that it’s widely considered to be the ‘real’ Ghostbusters 3 and is treated by many, including Dan Aykroyd, as the sequel that never was. This was all long before the 2016 reboot and Ghostbusters 2020, which as we understand it is a direct sequel to the original movies. The surviving cast will be in that, as their original characters, but the benefit of the video game is that in this they still look like they did in 1984…\n\nWhatever its other faults, and there are plenty of them, Ghostbusters: The Video Game is a masterclass in recreating the look, feel, and sound of a movie. It’s perhaps second only to Alien Isolation in terms of successfully recreating the atmosphere of the original film it’s based on. It also follows a similar principle of having a story and setting that’s only slightly different and which finds excuses to replicate all the original beats and action sequences.\n\nApart from Sigourney Weaver and Rick Moranis, every major actor from the original films are back, even including William Atherton as Walter Peck and Max von Sydow in a cameo as Vigo the Carpathian. This was before the death of Harold Ramis, so he’s in it too, although the most surprising thing is that famed curmudgeon Bill Murray is also in the game as a full cast member. And while he clearly isn’t giving it 100% he still manages to make the most of some of the better lines.\n\nAdvertisement\n\nAdvertisement\n\nDespite the celebrity cast you play the game as a new, nameless and mute employee. That’s one of the game’s first mistakes as not only does it create an awkward vacuum when everyone’s trying to crack jokes but it makes navigating the game’s cramped locations even more difficult when there’s five of you all running around with unlicensed nuclear accelerators on your back.\n\nIn gameplay terms Ghostbusters is essentially a third person shooter (Gears Of War was very big when the original game first came out and is an obvious influence). Smaller ghosts can simply be blasted, while others have a health bar to wear down. When low they can then be caught in your proton stream, knocked about the room, and finally caught in a trap.\n\nExtra equipment is gradually introduced as the game goes on, starting with a sort of proton stream rocket launcher, a shotgun equivalent, and what amounts to a freeze beam and an automatically tracking tag weapon – all with their own secondary fire modes. You even use the slime blowers from Ghostbusters II, which can also attach ghosts to one end of a spectral leash. All of which sounds like it would add plenty of variety, but it doesn’t really because it just makes the game seem more like a generic shooter, just with the details changed to fit with the Ghostbusters theme.\n\nGhostbusters: The Video Game Remastered (PS4) – now there’s something you don’t see every day\n\nOther diversions are fairly minor, with the ability to throw around physical objects being underused, and no real puzzles to speak of. The scanning of spooks and hidden objects also never really goes anywhere and isn’t really needed to catch most of the boss characters, despite that seeming to be the purpose of it.\n\nAdvertisement\n\nA bigger issue is that the game is so ruthlessly linear, with all the levels basically just funnelling you down a maze towards your target – and only as and when the game decides. The original Commodore 64 game, released at the time of the first movie, was sensible enough to try and focus on you running a business, and yet all these years later its big budget successor doesn’t have the ambition to be anything other than Gears Of War with proton packs.\n\nThat was more acceptable 10 years ago, but now the clunky movement, repetitive combat, and terrible artificial intelligence for your celebrity co-workers feels very dated. It’s also extremely short, but any longer and the thin premise would’ve been stretched well beyond breaking point.\n\nAnd yet the biggest problem with Ghostbusters: The Video Game is the same one as plagued the 2016 reboot and, arguably, Ghostbusters II: it’s not very funny. We chuckled at precisely two different jokes in the game but other than that it just feels like mildly competent fan fiction. Allegedly, Dan Aykroyd and Harold Ramis did work on the script, but you’d never have guessed that in terms of either the dialogue or the lazy plot.\n\nGhostbusters is first and foremost a comedy and if it’s not funny that means it’s lost its primary appeal, whether it’s a movie or a video game. Ghostbusters: The Video Game looks and sounds the part (the remaster is generally of a good standard, although the cut scenes suffer from some strange performance issues) but it feels more like a fan-made mod than a real game.\n\nAdvertisement\n\nWhich is fine if you just want a bit of nostalgia and the final chance to hear the original foursome together again, but this is neither a particularly good video game or the next best thing to Ghostbusters 3.\n\nGhostbusters: The Video Game Remastered review summary In Short: It always put nostalgia first and gameplay second, but 10 years on and Ghostbusters: The Video Game just feels like mediocre fan fiction. Pros: A dream come true in terms of fan service, with a loving recreation of the original movies, including the original voice cast and many familiar locations and ghosts. Cons: Short, linear story that fails to make proper use of its access to the original cast and crew. Clunky combat has not aged well and lacks any real depth or variety. Not particularly funny. Score: 6/10\n\nFormats: PlayStation 4 (reviewed), Xbox One, Nintendo Switch, and PC\n\nPrice: £24.99\n\nPublisher: Mad Dog\n\nDeveloper: Saber Interactive and Terminal Reality\n\nRelease Date: 4th October 2019\n\nAge Rating: 12\n\nEmail gamecentral@ukmetro.co.uk, leave a comment below, and follow us on Twitter\n\nMORE: Dan Aykroyd confirms he is on board for the Ghostbusters 3 sequel 35 years after the original\n\nMORE: Paul Rudd jokes he is ‘sliming himself’ as he joins Jason Reitman’s new version of Ghostbusters\n\nMORE: Sigourney Weaver hints ‘all the guys’ will be back for Ghostbusters 3 as she confirms return", "description": "The closest thing to Ghostbusters 3 there’ll ever be is remastered for modern consoles, but does it deserve to rise from the grave?", "authors": [], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/ghostbusters-feature-dc5f_1570453645.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}