{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7557517/Benedict-Cumberbatch-latest-star-join-Extinction-Rebellion-demo.html", "downloaded_at": "2019-10-10 08:35:03.747699+00:00", "title": "Benedict Cumberbatch is latest star to join Extinction Rebellion demo", "language": "en", "text": "Advertisement\n\nBenedict Cumberbatch has become the latest celebrity to join Extinction Rebellion climate activists in London.\n\nThe 43-year-old Imitation Game star was spotted speaking to demonstrators and posing for photographs as they prepared to spend the night outside Trafalgar Square while police officers watched on yesterday evening.\n\nCumberbatch is one of several stars to have visited the protest sites in the first three days of the demonstration, with others including model Daisy Lowe, comedian Ruby Wax and actors Juliet Stevenson and Mark Rylance.\n\nActivists said the Harrow-educated actor, who is known for Doctor Strange and Star Trek, spent a 'good couple of hours' with the protesters who were sat in front of a hearse with a coffin that had the words 'our future' on it.\n\nBenedict Cumberbatch joins the Extinction Rebellion activists in Trafalgar Square last night as he poses for a photograph\n\nCumberbatch, 43, was seen speaking to demonstrators and posing for photographs outside Trafalgar Square last night\n\nCumberbatch is one of several stars to have visited the protest sites in London in the first three days of the demonstration\n\nEarlier in the day, Cumberbatch was spotted elsewhere in London filming for a forthcoming 19th century biopic about the acclaimed cat-loving painter Louis Wain, in which he is starring with The Crown star Claire Foy.\n\nSporting a whisker-inspired moustache, grey trousers and a slate grey tweed jacket, Cumberbatch was photographed shooting dramatic scenes that saw him fall off a double-decker bus and knock himself out.\n\nCumberbatch and Foy have reunited after working together on Wreckers in 2011. He previously said it would be a 'sincerely uplifting, playful, thought provoking tale of resilience, creativity and the enduring power of love'.\n\nIt comes as activists are to begin their three-day 'Hong Kong-style' occupation of London City Airport. The protest group says its members intend to 'peacefully occupy and shut down' the airport's terminal building from 9am.\n\nCumberbatch spent time speaking to the demonstrators last night who are part of the Extinction Rebellion protests in London\n\nActivists said the film star spent a 'good couple of hours' with the protesters who were sat in front of a hearse last night\n\nCumberbatch has become the latest celebrity to join Extinction Rebellion climate change activists on the streets of London\n\nActivists say they will achieve this by lying, sitting or gluing themselves in front of the departure and arrival gates. If they do not make it into the building, they plan to occupy the airport's access road and DLR station.\n\nThe latest protest is against the climate impact of flying and the Government's ongoing support of airport expansion. The group said hundreds of people have already signed up to take part in the demonstration.\n\nIt said those taking part are willing to risk being arrested to achieve their aim. Hundreds of police officers are being drafted in from across England and Wales to help the Metropolitan Police with the protests.\n\nActivists have been camped around Parliament Square and Whitehall, calling for urgent action on climate change and wildlife. Police said 800 people had been arrested since Monday, with another 220 detained yesterday.", "description": "The 43-year-old Imitation Game star was spotted speaking to demonstrators last night and posing for photographs as they prepared to spend the night outside Trafalgar Square in London.", "authors": ["Mark Duell For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/08/19527438-0-image-a-40_1570691767330.jpg", "published_at": "2019-10-10"}