{"pub": "indiatimes", "url": "https://indiatimes.com/sports/26-wins-5-draws-and-1-loss-the-most-memorable-moments-of-india-s-record-11-straight-home-test-series-victories-378302.html", "downloaded_at": "2019-10-22 13:26:45.156403+00:00", "title": "The Most Memorable Moments Of India's Record 11 Straight Home Test Series Victories", "language": "en", "text": "It took just two overs on Day 4 for India to wrap up the Test series 3-0 vs South Africa. While the series was already clinched, a whitewash only made it better. What this means now is that of the 32 Tests we have played in the course of our 11 straight home series wins, we have won 26, lost 1 and drawn 5. The only defeat came against Australia in 2017.\n\nCricinfo\n\nThe last time India lost a Test series on home soil was in 2012 against England. On that occasion we squandered a 1-0 advantage to give it all away. But since then no team has breached the fortress. The 11 consecutive series win is a world record and India are in a class of their own.\n\nWhile they were all memorable victories, some do stand out. Let's take a look:\n\n1. 4-0 vs Australia (2013)\n\nThis was where it all began. India were ruthless as they systematically dismantled the Aussies piece by piece. At no point in the series did the visitors look like making an impact.\n\nDon't Miss 180 SHARES 825 SHARES\n\n2. 2-0 vs West Indies (2013)\n\nThis series was Sachin Tendulkar's farewell and also Rohit Sharma's arrival on the Test scene. Neither disappointed with Sachin hitting a fifty in his last innings and Rohit scoring 2 hundreds in 2 games. Both matches ended in 3 days.\n\n3. 3-0 vs South Africa (2015)\n\nVirat Kohli's first home Test series in charge and he did not let us down. The likes of Ravichandran Ashwin and Ravindra Jadeja had them in a tangle and it propelled us to the No. 1 spot.\n\n4. 4-0 vs England (2016)\n\nRevenge is a dish which tastes best when it is served cold and that happened for India after a long time. They had lost their last 3 Test series to England, including one at home and eager to avenge it. Well, as the scoreline suggests, England were barely given space to breathe.\n\n5. 2-1 vs Australia (2017)\n\nIn this case the Aussies drew first blood hammering us by 333 runs. But the hosts came fighting back to clinch the series and bring home the rubber.\n\n6. 3-0 vs South Africa (2019)\n\nWhile this series was expected to be one-sided, it proved to be the world record clincher for most consecutive home soil Test series wins. Rohit Sharma celebrated his promotion to the top of the order with twin tons in the first Test before a double century in the third. Along with Mayank Agarwal, it proved to be a fruitful partnership.", "description": "It took just two overs on Day 4 for India to wrap up the Test series 3-0 vs South Africa. While the series was already clinched, a whitewash only made it better. What this means now is that of the 32 Tests we have played in the course of our 11 straight home series wins, we have won 26, lost 1 and drawn 5. The only defeat came against Australia in 2017. The last time India lost a Test series on ho", "authors": ["Somak Adhikari"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/india_are_in_great_form_1571722107_800x420.jpg", "published_at": "2019-10-22"}