{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/the-houston-debate-didnt-disturb-the-big-threes-dominance.html", "downloaded_at": "2019-09-13 07:10:09.627171+00:00", "title": "The Big Three Are Still Dominant in the Democratic Race After the Third Debate", "language": "en", "text": "The center of attention, once again. Photo: Win McNamee/Getty Images\n\nTo understand the likely impact of the Democratic candidate debate in Houston, it’s important to understand the broader dynamics of the contest at this moment. The race has been dominated for more than a month now by three candidates—Joe Biden, Bernie Sanders and Elizabeth Warren. They have all had some ups and downs, but since Kamala Harris’ fade began before (and definitely after) the July debates, no other candidate has really laid a glove on them. They more or less cover the ideological spectrum of the party, and while they have sometimes won supporters at each others’ expense, you could see them heading into the voting stage of the contest early next year continuing to keep their lower-polling rivals at bay.\n\nIn the single September debate in Houston, nothing happened to change the overall complexion of the race, or the hegemony of the Big Three.\n\nTo be sure, quite a few candidates had good moments. Pete Buttigieg was his usual fluid and articulate self, and Cory Booker was once again passionate and empathetic. Amy Klobuchar got much more time to speak, and was more energetic than before. Andrew Yang got to spring his “democracy dollars” pitch for letting everyone contribute to political campaigns, and perhaps more importantly, had the chance to address a broader range of issues than usual. Beto O’Rourke debuted his new reborn persona as a candidate radicalized by gun violence in his how town, with some success. The whole field came across (until the late stages of the debate when candidates, moderators and viewers alike were clearly tiring) as sharper, wittier, and more responsive than in the earlier debates.\n\nTwo candidates, in my judgment, hurt themselves: Kamala Harris, whose strange mannerisms and too-casual tone in this debate had some people I was talking to wondering if what she had consumed in the green room. If that impression was widely shared, it will represent unfortunate timing for the Californian, who needed badly to recapitulate her skillful performance in the first debate in Miami, which momentarily made her a top-tier candidate with a clear (if narrow) path to the nomination. And then there was Julian Castro, who had been very slowly rising in polls after two good debate performances, and then, deliberately or not, seemed to insinuate that Joe Biden is a wee bit senile (“Are you forgetting what you said two minutes ago.”). Media who have been waiting for a long time (at least since the since-departed Eric Swalwell challenged Biden to “pass the torch” in Miami) for someone to figure out how to raise the question of the former veep’s age and competence were probably shocked at how frontally Castro did the deed — especially given that Castro seems to have been wrong on the facts. The exchange could in some precincts overshadow much of the debate as Team Biden stokes outrage about it (perhaps hoping to preclude future questioning of Biden’s fitness for the presidency).\n\nStrategically, going into this debate, Harris posed the closest thing to a real threat to the Big Three; if she overperforms in Iowa (where she’s been making a major push), she has the potential to replicate Barack Obama’s 2008 strategy by catching fire with African-American voters and seriously threatening Biden in the South. That long-shot breakthrough now seems less likely. With the possible exception of Buttigieg, none of the other candidates outside the Big Three is even close to having a plausible path to the nomination.\n\nThat could change in the final scheduled pre-Iowa debate(s) next month, but it gets harder as voting grows nearer and money gets scarce for candidates who are not yet viable.\n\nThat long triple colloquoy involving health care policy that consumed about a half-hour of the debate showed how easy it became for moderators to virtually forget anyone other than Biden (who clearly relished a dustup as much as the questioners did, probably as a sign of vigor), Warren, and Sanders. It’s not clear their relative strength vis-a-vis each other changed much, either; Warren did well generally, for the third straight debate. And Biden succeeded in projecting confidence on a broad range of issues (though exhibiting the occasional Bidenesque glossolalia, as with his bizarre comments about children and “record players”). And just as Booker was Booker, Sanders was Sanders, which is enough for many voters.\n\nWe’ll soon see if I misjudged and one of the lower-polling candidates gets a serious bounce. More likely, the competition will intensify at the October debate, when Tom Steyer (and possibly Tulsi Gabbard) will join the scrum and probably push the events back to two nights, in which chance will determine who is on the stage together. Then we will again be at the point where survival is on the line for much of the field, and the Big Three will be fighting to make Iowa and New Hampshire an abattoir for everyone else.", "description": "The third round of Democratic debates in Houston showed Biden, Warren and Sanders continuing to dominate the field, as multiple low-polling candidates had moments, and perhaps two (Harris and Castro) may have hurt themselves.", "authors": ["Ed Kilgore"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/09/12/12-sanders-biden-warren.w1200.h630.jpg", "published_at": "2019-09-13"}