{"pub": "news24", "url": "https://fin24.com/Companies/giant-global-law-firm-eyes-opportunities-in-sa-africa-20191025-2", "downloaded_at": "2019-10-25 16:43:25.990548+00:00", "title": "Giant global law firm eyes opportunities in SA, Africa", "language": "en", "text": "The giant London-based global law firm CMS has joined up with a local South African firm to form CMS RM Partners.\n\nCMS has more than 70 offices in 30 countries, and the CMS RM Partners office will be based in Sandton.\n\nIn addition to its expansion to SA, the firm also recently opened up a new office in Iran.\n\nMajor growth\n\nDuring his visit to South Africa this week, Duncan Weston, managing partner of CMS, told Fin24 that CMS is seeing major opportunities for growth in Africa. That is why it has joined forces with local law firm, RM Partners, to represent them in South Africa.\n\n\"There is a globalisation of law firms taking place. A new breed of global elite law firm has started popping up over the last 10 years. That does not, however, mean that smaller local niche firms cannot remain strong too,\" says Weston.\n\n\"We are very enthusiastic about the African region. There is a huge lobby from the UK now for investment in Africa.\"\n\nHe believes it is best to have a global approach, but along with deep local knowledge as well.\n\n\"As we look to grow more in Africa, we realise there are huge differences across African countries. That is why I am excited about our young and diverse team in South Africa,\" he says.\n\n\"I think strength lies in a number of countries in a region being aligned. That in turn creates a lot of (legal) work between countries.\"\n\nCMS is in the process of aligning with about six law firms across Africa, including Kenya and SA.\n\nAnother important aspect for Weston is the use of technology in the corporate law field.\n\n\"There is a dilemma globally about how to globalise corporate law. Clients are demanding expertise as their worlds become increasingly global,\" he says.\n\nMore than geography\n\n\"For me it is about using technology to enable very high quality law firms to transact together on a cloud-based platform. I call it a 'global-local approach' where a top-quality law firm can be cloud-based rather than geographically based.\n\n\"Then top lawyers in various destinations can work together. We are building this.\"\n\nIn this way clients and law firms can transact together in one \"place\" no matter where they are in the world. They will just be using top lawyers all over the world and the \"geographic aspect\" will disappear.\n\n'Deals will be made, lawyers will sort them'\n\nIn his view, the real danger is, however, for a country to ignore its positioning in the world. SA must, therefore, guard against being too internally focused.\n\n\"It is a transformational time in global politics. The question is, how do corporate lawyers fit into it?\"\n\n\"I say that whatever happens, the world will be a more complex place, deals will be made, and lawyers would have to sort them out.\n\n\"It is an exciting time for law firms.\"\n\nIn his view the law firms that will suffer are those that expanded too aggressively, ending up not being able to manage their practices.\n\nAt the same time, he thinks bigger locally focused firms will \"get hammered\" because they fall in the middle between the real niche firms and the big international ones.\n\nIn his view, those firms in the \"middle\" and those who are not able to globalise properly will totally disappear.\n\n\"This process might take time, but we have already seen a number of top-quality law firms disappear,\" he says.\n\n\"It is not just about going bigger. We are here because we have clients asking us how to do business here in South Africa and Africa.\"", "description": "The giant London-based global law firm CMS has joined up with a local South African firm to form CMS RM Partners.", "authors": ["Carin Smith"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/4887/f70b7e8c4f3747d3972d73d30d85320e.jpg", "published_at": "2019-10-25"}