{"pub": "yahoo", "url": "https://news.yahoo.com/1-agreeing-brexit-deal-self-141850862.html", "downloaded_at": "2019-10-21 15:12:06.259174+00:00", "title": "UPDATE 1-Agreeing Brexit deal 'self-evidently' in UK's economic interest - finance minister", "language": "en", "text": "(Adds context, quotes)\n\nLONDON, Oct 21 (Reuters) - Agreeing the Brexit deal negotiated by Prime Minister Boris Johnson is \"self-evidently\" in the interest of Britain's economy, finance minister Sajid Javid said in a letter published on Monday.\n\nJohnson agreed a deal in talks with EU officials last week, but with just 10 days left until the United Kingdom is due to leave the bloc, the divorce is again in disarray as Britain's politicians argue over whether to leave with a deal, exit without a deal or hold another referendum.\n\n\"My starting point is that agreeing the Withdrawal Agreement is self-evidently in our economic interest,\" Javid said in the letter responding to a parliamentary committee's request for an economic analysis of Johnson's deal.\n\n\"It would bring an end to the damaging uncertainty and delay of the past years, and allow businesses to get on with taking decisions, including around recruitment and investment.\"\n\nJavid said the Brexit department would publish more information on the deal in coming days to inform discussion in parliament, but did not commit to publishing an economic impact assessment because many of the long-term details were not known.\n\nHe said the overall impact was hard to measure.\n\n\"My last point is to say that trust in democracy and bringing an end to the division that has characterised this debate over the past three years, is something that cannot be measured solely through spreadsheets or impact assessments, important though they are,\" Javid said.\n\n\"Respecting the referendum and closing this chapter so we can focus on delivering growth and the public services people deserve, is the right thing to do for our country.\" (Reporting by William James, editing by Elizabeth Piper)", "description": "Agreeing the Brexit deal negotiated by Prime Minister Boris Johnson is \"self-evidently\" in the interest of Britain's economy, finance minister Sajid Javid said in a letter published on Monday.  Johnson agreed a deal in talks with EU officials last week, but with just 10 days left until", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-21"}