{"pub": "independent", "title": "Madeleine Westerhout: Trump says ousted top aide made ‘hurtful’ comments about his family to reporters", "url": "https://independent.co.uk/news/world/americas/us-politics/donald-trump-madeleine-westerhout-assistant-tiffany-fired-white-house-a9086836.html", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:37:27.642531+00:00", "text": "Donald Trump said he dismissed his personal assistant, Madeleine Westerhout, after she divulged personal information about the Trump family during an off-the-record dinner with reporters.\n\n\"I think it was automatic,\" Mr Trump told reporters Friday of Ms Westerhout's departure. \"I don't say 'fire' or 'not fire.' I really think she had a bad night. I think it was unfortunate. She said she was drinking.\"\n\nMr Trump said he spoke by phone Friday to Ms Westerhout, who was \"very upset\" and explained that she said \"things about my children\" to reporters off the record.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n\"I think the press is very dishonest because it was supposed to be off the record,\" he said. \"But, still, you don't say things like she said which were just a little bit hurtful to some people.\"\n\nMs Westerhout, one of the few aides remaining from the earliest days of the Trump administration, abruptly departed her White House post this week.\n\nShape Created with Sketch. Trump attacks CNN's Jim Acosta in angry White House press conference Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Trump attacks CNN's Jim Acosta in angry White House press conference 1/10 Donald Trump launched an extraordinary tirade against CNN reporter Jim Acosta during a press conference following the midterm elections Reuters 2/10 The US president ordered the journalist to put down his microphone and “just sit down” AFP 3/10 The row began following a question about the migrant caravan approaching the US, when Mr Trump was asked by CNN’s Jim Acosta if he thought he had “demonised” migrants by calling the group an “invasion” EPA 4/10 “I think you should let me run the country, you run CNN, and if you did it well, your ratings would be much better,” said the President AFP/Getty 5/10 After Mr Acosta attempted to follow up his question with a second on Robert Mueller’s Russia probe, Mr Trump added, pointing angrily: “That’s enough. That’s enough. That’s enough. Excuse me, that’s enough.” Mr Trump said he was “not concerned about anything” because the investigation was “a hoax”. Continuing to berate Mr Acosta, he added: “That’s enough. Put down the mic.” As the reporter continued to quiz him, Mr Trump became more agitated and stepped away from the podium. EPA 6/10 Returning to the podium, Mr Trump said: “I’ll tell you what, CNN should be ashamed of itself having you working for them. You are a rude, terrible person. You shouldn’t be working for CNN REUTERS 7/10 Trump continued: 'The way you treat Sarah Huckabee is horrible and the way you treat other people are horrible. You shouldn’t treat people that way.” She was sitting in the room listening on REUTERS 8/10 A second reporter, Peter Alexander, was called on by the president and said: “In Jim’s defence I’ve travelled with him a lot, he’s a diligent reporter.” EPA 9/10 Mr Trump cut him off, telling the NBC News journalist that “I’m not a big fan of yours either”, prompting laughter in the room AP 10/10 Mr Acosta continued to try to ask questions without his microphone, causing Mr Trump to tell him: “Just sit down, please. When you report fake news – no – when you report fake news, which CNN does, a lot, you are the enemy of the people.” REUTERS 1/10 Donald Trump launched an extraordinary tirade against CNN reporter Jim Acosta during a press conference following the midterm elections Reuters 2/10 The US president ordered the journalist to put down his microphone and “just sit down” AFP 3/10 The row began following a question about the migrant caravan approaching the US, when Mr Trump was asked by CNN’s Jim Acosta if he thought he had “demonised” migrants by calling the group an “invasion” EPA 4/10 “I think you should let me run the country, you run CNN, and if you did it well, your ratings would be much better,” said the President AFP/Getty 5/10 After Mr Acosta attempted to follow up his question with a second on Robert Mueller’s Russia probe, Mr Trump added, pointing angrily: “That’s enough. That’s enough. That’s enough. Excuse me, that’s enough.” Mr Trump said he was “not concerned about anything” because the investigation was “a hoax”. Continuing to berate Mr Acosta, he added: “That’s enough. Put down the mic.” As the reporter continued to quiz him, Mr Trump became more agitated and stepped away from the podium. EPA 6/10 Returning to the podium, Mr Trump said: “I’ll tell you what, CNN should be ashamed of itself having you working for them. You are a rude, terrible person. You shouldn’t be working for CNN REUTERS 7/10 Trump continued: 'The way you treat Sarah Huckabee is horrible and the way you treat other people are horrible. You shouldn’t treat people that way.” She was sitting in the room listening on REUTERS 8/10 A second reporter, Peter Alexander, was called on by the president and said: “In Jim’s defence I’ve travelled with him a lot, he’s a diligent reporter.” EPA 9/10 Mr Trump cut him off, telling the NBC News journalist that “I’m not a big fan of yours either”, prompting laughter in the room AP 10/10 Mr Acosta continued to try to ask questions without his microphone, causing Mr Trump to tell him: “Just sit down, please. When you report fake news – no – when you report fake news, which CNN does, a lot, you are the enemy of the people.” REUTERS\n\nMs Westerhout kept a low public profile even though she was one of the more influential members of Mr Trump's team of aides, with a desk just outside the Oval Office. Her phone regularly buzzed with calls from lawmakers and other top officials seeking to get through to the president.\n\nThe White House did not initially respond to requests for comment about Ms Westerhout's ouster, leaving her abrupt departure shrouded in mystery for hours. Mr Trump, who praised Ms Westerhout as \"a good person,\" did not specify what information Ms Westerhout divulged about his family.\n\nThe New York Times reported Thursday that Ms Westerhout had been forced out after Mr Trump learned of her comments in the off-the-record dinner with reporters, which took place earlier this month in New Jersey.\n\nPolitico reported Friday that Ms Westerhout had made comments bragging about having a better relationship with Mr Trump than the president's own daughters, Ivanka and Tiffany.\n\nPolitico also reported that Ms Westerhout said Mr Trump did not want to be seen in pictures with Tiffany because of her weight.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nMr Trump called the allegations \"absolutely false.\"\n\n\"I love Tiffany,\" Mr Trump told reporters Friday.\n\nMs Westerhout's official position was \"director of Oval Office operations.\" An aide for Senator Joe Manchin said Mr Manchin usually called Ms Westerhout to get through to Mr Trump.\n\nIn February, after Axios published leaked copies of Mr Trump's private schedule with copious amounts of free time, Ms Westerhout criticised the leak and defended the president.\n\n\"What a disgraceful breach of trust to leak schedules,\" she wrote on Twitter. \"What these don't show are the hundreds of calls and meetings @realDonaldTrump takes everyday.\"\n\nMs Westerhout was one of six White House officials reprimanded last year for violating the Hatch Act, according to the Office of Special Counsel. That law bars federal employees from engaging in politics during work.\n\nA former aide for the Republican National Committee, Ms Westerhout also worked on presidential candidate Mitt Romney's 2012 campaign.\n\nShe quickly became a fixture in Mr Trump's inner circle, serving as personal assistant and gatekeeper for the president.\n\nMr Trump told The Washington Post's Bob Woodward last year that Ms Westerhout was the person to contact in order to directly reach him at the White House.\n\n\"Madeleine is the key,\" Mr Trump said. \"She's the secret.\"\n\nThe Washington Post", "description": "Donald Trump said he dismissed his personal assistant, Madeleine Westerhout, after she divulged personal information about the Trump family during an off-the-record dinner with reporters. \"I think it was automatic,\" Mr Trump told reporters Friday of Ms Westerhout's departure. \"I don't say 'fire' or 'not fire.' I really think she had a bad night. I think it was unfortunate. She", "authors": ["Toluse Olorunnipa"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/31/17/donald-trump.jpg"}