{"pub": "fox", "url": "https://foxnews.com/us/university-of-florida-advisor-sex-assault-high-achieving", "downloaded_at": "2019-09-13 00:57:32.432271+00:00", "published_at": "2019-09-12", "title": "University of Florida RA accused of sex assault released after judge agrees he's 'high-achieving'", "language": "en", "text": "A University of Florida residence hall assistant accused of trying to sexually assault a female student was released on his own recognizance last week after a judge agreed with the man's attorney that the 21-year-old's record as a \"high-achieving student\" and the approach of Hurricane Dorian were factors in his favor.\n\nIan Milaski was arrested Aug. 29 and charged with simple battery and false imprisonment after a woman claimed Milaski tried to assault her in his dorm room at the school's Gainesville campus four days prior.\n\nThe female student told the university's police department Milaski called her and asked her for water because he was intoxicated. But when she helped him back to his room, he allegedly tried to \"make out\" with her, WCJB reported.\n\nCALIFORNIA JUDGE RECALLED AFTER BROCK TURNER CASE LOSES NEW JOB AS HIGH SCHOOL TENNIS COACH\n\nWhen the female student refused, she says Milaski pulled her wrist and said, \"I want to sleep with you.\" The woman — identified only as a sophomore by student newspaper the Alligator — told authorities that when she told Milaski to stop and asked to leave the room, he wouldn't let her go.\n\nWhen she tried to leave, Milaski allegedly picked her up, put her on the bed and tried to assault her.\n\nThe woman told authorities she was eventually able to leave Milaski's room and ran back to her own, where she asked a friend and her roommate to stay with her.\n\nOHIO COP ATTEMPTED KIDNAPPING GIRL, 12, WAITING FOR BUS AND FILMED HIMSELF URINATING ON HER: POLICE\n\nThe student said that, while back at her room, she noticed an outline of someone standing in her doorway — and claimed it was Milaski. She alleged he tried to lay down next to her and she yelled at him to leave. At that point, she said her friend woke up, and also shouted at Milaski to leave.\n\nWhen Milaski was arrested, he allegedly told police he did grab the woman by her wrist and did want to sleep with her, The Washington Post reported, citing an arrest report.\n\nMilaski pleaded not guilty during his first court appearance last week and was held on $125,000 bond. His attorney argued for a reduction in bond, citing Milaski's previous lack of a criminal history, his status as a double-major senior who was a member of two honor societies at school, Milaski not being a flight risk and the 21-year-old having “personally performed more than 210 hours of community service in the last two years.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe attorney, Ronald Kozlowski, also argued Misalki's hometown was expected to be hit by Hurricane Dorian — and said if the judge reduced the bond or waived it, he'd be able to help his parents prepare for the storm.\n\nA judge ruled he should be released on his own recognizance. Milaski was ordered to wear a GPS monitoring device and not to have contact with the female student. He's also barred from entering Alachua County or Sarasota counties, where the university is located, except for court appearances or \"necessary events\" at school.", "description": "A University of Florida residence hall assistant accused of trying to sexually assault a female student was reportedly released on his own recognizance last week after a judge agreed with the man's attorney that the 21-year-old's record as a \"high-achieving student\" — and the approach of Hurricane Dorian — were factors in his favor.", "authors": ["Nicole Darrah", "Nicole Darrah Covers Breaking", "Trending News For Foxnews.Com. Follow Her On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Ian-Milaski-mug.jpg"}