{"pub": "independent", "url": "https://independent.co.uk/independentpremium/boris-johnson-no-deal-brexit-final-say-march-london-a9162151.html", "downloaded_at": "2019-10-19 11:11:54.867475+00:00", "title": "Let’s stop the knavery and tricks of Boris Johnson’s Brexit deal and march on the streets", "language": "en", "text": "Not for the first time (and hopefully there will be many more such occasions) the clever if sometimes eccentric Sir Oliver Letwin has rendered invaluable service to his country, if not his (former) party, the Conservatives.\n\nNot for the first time, either, it comes in the form of a Commons amendment. Like the others, it has the great virtues of focus and simplicity. For all the drama about the Saturday sitting of the Commons, it need not be the last word on the Johnson deal, or Brexit.\n\nFor the Letwin amendment wisely withholds parliamentary assent from the so-called deal that Boris Johnson negotiated until the appropriate legislation has been properly scrutinised. Usually, the Commons works on a good deal of trust, in which such great decisions can be reached in principle and the detail dealt with later. In this case, within the bounds of an international treaty being transcribed into domestic law.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nWith Mr Johnson, however, there can be no trust, and the parliamentarians are entirely right to resist being bounced in the euphoric (in some quarters) relief that some sort of UK-EU withdrawal agreement has been concluded. They cannot know what tricks and knavery are at this moment being hatched in the minds of Mr Johnson, Dominic Cummings and Jacob Rees-Mogg and the rest of the gang, but they can be sure that the manipulations and the games have not ended. Another Benn Act will be needed to prevent another attempt to crash the country out of the EU in a year or two.\n\nThere is, for example, disturbing news that Dominic Raab and Michael Gove are going around telling Eurosceptic MPs that the Johnson deal is the pathway to no-deal Brexit after all. Future talks on a free trade agreement with the EU – which presently exist only as an aspiration in the political declaration – will be deliberately collapsed at the end of 2020 or 2021, and the UK will then have to fall back on World Trade Organisation terms. It is not what the Labour rebels and others have in mind as they ponder supporting the Johnson deal. It is not any part of their agenda to open the possibility of tariffs and quotas being imposed on trade across the Channel, let alone whatever the future may hold for the Irish peace process.\n\nShape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty\n\nWith a Johnson government there are no guarantees of anything, no promises that cannot be broken, and pledges that cannot be reneged upon (just ask the DUP). The Labour Party, and others, should recognise that the cause of no-deal Brexit will never be given up by the true believers, and the true believers are now running the country. What, they should ask themselves, awaits the nation under a majority Johnson government? We already know that they intend to suppress the franchise and refuse to release their fiscal plans more than a year ahead. The NHS, the social security system, the most vulnerable in society – none will be safe in the hands of this government when it can do as it wishes and can build “Singapore-on-Thames”.\n\nCrucially, the Letwin amendment leaves open the timing of the vote on a Final Say referendum. Today’s Final Say march in London loudly demonstrates, once again, the public’s demand for a say on the terms of Brexit, when they are known – and they are not yet known in full.\n\nThe case for a second referendum, a confirmatory one on the Johnson deal if needs be, is unanswerable. In June 2016 no one had the opportunity to vote on the Johnson deal because it did not exist. No one was much talking about the Irish border, and the notion of plonking Northern Ireland in a sort of limbo betwixt the EU and the UK was undreamt of. If anything, the Johnson deal – outside the customs union and single market for the most part – was a “hard deal” option, and not especially well supported, even by Mr Johnson himself. It was a long time ago, but the main point about the loss of legitimacy of the 2016 mandate is simply that there was no particular Brexit terms attached to it. Now there are (though the terms of the free trade treaty remain mysterious).\n\nMany Leave voters will of course be very happy with what has emerged. Others will be disappointed, for various reasons. Some Remainers may be converted to the Johnson deal, or just succumb to exhaustion. Others who did not vote in 2016 will have a view and a right to express it. All have a right to a Final Say, and that is why so many people support the cause and will be joining the march and making their voices heard via the latest petition.\n\nOne thing that Leavers and Remainers and everyone else can, though, agree upon is that it is now – for sheer practical reasons – impossible for Brexit to be “done” by 31 October. Mr Johnson will have to “die in a ditch” and obey the Benn Act, and write to the EU. Another broken promise by the prime minister, yes, but by no means the most grievous.", "description": "Not for the first time (and hopefully there will be many more such occasions) the clever if sometimes eccentric Sir Oliver Letwin has rendered invaluable service to his country, if not his (former) party, the Conservatives. Not for the first time, either, it comes in the form of a Commons amendment. Like the others, it has the great virtues of focus and simplicity. For all the", "authors": [], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/17/22/boris-johnson-deal.jpg", "published_at": "2019-10-18"}