{"pub": "telegraph", "url": "https://telegraph.co.uk/boxing/2019/10/26/dereck-chisora-calls-oleksandr-usyk-joseph-parker-fight-halting", "downloaded_at": "2019-10-27 00:21:55.599924+00:00", "title": "Dereck Chisora calls for Oleksandr Usyk or Joseph Parker fight after halting David Price at O2 Arena", "language": "en", "text": "Popular London heavyweight boxer Dereck Chisora called for a fight with either Oleksandr Usyk or a rescheduled fight with former heavyweight world champion Joseph Parker, after halting David Price in a dominant display at the O2 Arena.\n\nChisora and Price thrilled the crowd in a ding-dong, all-British heavyweight battle over four rounds, pulsating as long as it lasted.\n\nChisora bustled into Price with winging hooks at every opportunity from the off, Price looking to counter with his heavy shots, but it was the London fighter always in the ascendancy.\n\nAt the end of the third round, Price was hurt and under pressure in his own corner, but managed to buckle his foe with the last punch of the round. A cuffing right hand in the fourth round to Price's temple, however, as Chisora carried on relentlessly, put his 6ft 8ins tall foe sideways and down in the neutral corner. Although Price regained his feet, as referee Howard Foster studied the Liverpudlian's physical state, the towel came in from the felled boxer's corner, at two minutes four seconds of the fourth round.\n\nEarlier, on a raucous night at the O2 Arena, Lee Selby defeated Ricky Burns in a battle of former world champions. In an entertaining, at times roughhouse brawl, the Welshman held the upper hand throughout the 12 rounds, winning by majority verdict 116-112, 116-113, 115-115 in a hard-fought encounter.", "description": "Popular London heavyweight boxer Dereck Chisora called for a fight with either Oleksandr Usyk or a rescheduled fight with former heavyweight world champion Joseph Parker, after halting David Price in a dominant display at the O2 Arena.", "authors": ["Gareth A Davies", "Boxing Correspondent"], "top_image": "https://www.telegraph.co.uk/content/dam/boxing/2019/10/26/TELEMMGLPICT000214249003-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?imwidth=1200", "published_at": "2019-10-26"}