{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7557027/Brisbane-father-Ronald-Gary-Smith-jailed-not-feeding-severely-disabled-daughter.html", "downloaded_at": "2019-10-10 03:14:43.038628+00:00", "title": "Brisbane father Ronald Gary Smith jailed after not feeding his severely disabled daughter", "language": "en", "text": "A single father who failed to properly feed and care for his severely disabled daughter in months before she died isn't criminally responsible for her death, a Brisbane judge says.\n\nRonald Gary Smith, 42, hoped moving his family from Sydney to Queensland's warmth would improve four-year-old Jade's health.\n\nBut days after arriving in Brisbane in mid-2014, her mother fled the family, leaving Smith - a former furniture removalist who didn't attend high school - to care for their daughter alone.\n\nIt was the first in a series of events that ended when Jade died of acute aspiration pneumonia and other complications in June 2015, Brisbane District Court heard on Thursday.\n\nA post-mortem examination found Jade was severely malnourished and this had made her vulnerable to lung infection\n\nShe weighed just 8.75kg - almost half her body weight before she left NSW.\n\nA post-mortem examination found Jade was severely malnourished and this had made her vulnerable to lung infection.\n\nBut doctors fell short of attributing her death to the neglect she had suffered.\n\nChief Judge Kerry J. O'Brien says Smith's limited education and a slight mental impairment contributed to his failure to adequately care for his daughter.\n\n'Given those matters, you simply struggled to provide Jade with proper care after your partner left you and returned to Sydney,' he said.\n\n'The essence of your offending is that you failed to provide your daughter with adequate food or medical treatment when you knew or reasonably should have known that such a failure was likely to cause harm to her.'\n\nJudge O'Brien said Smith's actions played a significant role in the deterioration of Jade's health but he could not sentence him for her death because he was charged with child cruelty.\n\n'It is not suggested, nor is it alleged, that you deliberately or intentionally set out to cause harm to Jade,' he said.\n\n'If that was so, then the charge would have been a more serious one.'\n\nThe court heard Jade suffered a number of serious conditions from birth, including brain abnormalities, cerebral palsy and epilepsy, and was unable to move or communicate\n\nThe court heard Jade suffered a number of serious conditions from birth, including brain abnormalities, cerebral palsy and epilepsy, and was unable to move or communicate.\n\nShe needed to be tube-fed a specially prepared diet previously co-ordinated by NSW Health.\n\nBut Smith failed to transition her healthcare to Queensland specialists despite authorities in both states attempting to arrange it, the court heard.\n\nInstead, he fed her nutritionally incomplete toddler formula he bought from a chemist causing her to lose 7.23 kilograms of body weight.\n\nJudge O'Brien sentenced him to three-and-a-half years' jail, eligible for parole after 14 months.", "description": "A single father who failed to properly feed and care for his severely disabled daughter in months before she died isn't criminally responsible for her death, a Brisbane judge says.", "authors": ["Australian Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/03/19521314-0-image-a-6_1570674543709.jpg", "published_at": "2019-10-10"}