{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7532233/The-Kings-Joel-Edgerton-star-Lily-Rose-Depp-hang-London.html", "downloaded_at": "2019-10-05 08:36:32.921315+00:00", "title": "The King's Joel Edgerton and co-star Lily-Rose Depp hang out together in London", "language": "en", "text": "They recently starred together in historical drama The King.\n\nAnd on Wednesday night, Lily-Rose Depp, 20, and her co-star Joel Edgerton, 45, enjoyed a social drink at the trendy Chiltern Firehouse in London.\n\nThe pair appeared to be celebrating a job well done, as they made their way out of the Marylebone venue in the early hours of the morning.\n\nCo-stars and friends! The King's Lily-Rose Depp, 20, and her co-star Joel Edgerton, 45, were seen leaving the trendy Chiltern Firehouse in London together on Wednesday night\n\nChanel model Lily-Rose looked every inch the fashion star in a fitted leather jacket along with a pair of loose-fitting denim jeans.\n\nMeanwhile, Australian-born Joel looked stylish in a faded blue blazer, which he paired with a white and black striped shirt and a pair of navy chinos.\n\nThe stunning French-American star added a pop of European elegance to the outfit, with a black and beige Chanel handbag slung over her shoulder.\n\nLow profile: Lily-Rose, who plays Queen Catherine in The King, cut a casual figure on her night out\n\nStylish: Australian-born Joel looked stylish in a faded blue blazer, which he paired with a white and black striped short and a pair of navy chinos\n\nThe Vogue cover girl had her brunette tresses down and allowed her natural beauty to shine through by opting for minimal makeup for the outing.\n\nLily-Rose plays Queen Catherine in the new historical epic.\n\nMeanwhile, Joel co-wrote the film as well as stars as ageing alcoholic knight, John Falstaff. The movie has already garnered him rave reviews.\n\nSo chic: Chanel model Lily Rose looked every inch the fashion star in a fitted leather jacket along with a pair of loose-fitting denim jeans\n\nThe King is an adaptation of a number of plays from Shakespeare's Henriad, including Henry IV and Henry V.\n\nThe film follows a wayward prince who turned his back on the throne, only to be forced to assume his birthright title after his father's death.\n\nJoel, who is currently dating Vogue Editor Christine Centenera, has been busy doing the rounds of the film circuit, attending the Venice Film Festival last month, where the film premiered.\n\n'It was really, really incredible. I loved the research process and just delving into who Catherine is as a person,' she said of the role at the New York premiere\n\nEarlier this week at the New York premiere, Lily-Rose said it can be hard to 'do justice' to playing a real-life person.\n\nShe said: 'It was really, really incredible. I loved the research process and just delving into who Catherine is as a person.\n\n'It can be intimidating to play a real-life person, but I think it just adds to the desire I had to do her justice and do as best a job I could.'", "description": "On Wednesday night, Lily-Rose Depp, 20, and her co-star Joel Edgerton, 45, enjoyed a social drink at the trendy Chiltern Firehouse in London .", "authors": ["Caleb Taylor For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/03/10/19246180-0-image-a-24_1570095407486.jpg", "published_at": "2019-10-03"}