{"pub": "dailybeast", "url": "https://thedailybeast.com/trump-ukraine-white-house-releases-text-of-zelensky-call-that-sparked-impeachment-inquiry", "downloaded_at": "2019-09-25 23:28:41.546393+00:00", "title": "Inside the Call: How Trump Pushed Ukraine to Probe Biden", "language": "en", "text": "President Donald Trump asked the leader of Ukraine to investigate his likely 2020 re-election opponent, and offered the assistance of his personal attorney and the attorney general of the United States in doing so.\n\nThat’s according to a partial transcript of a July call between Trump and Ukraine President Volodymyr Zelensky, which is now at the center of imminent impeachment proceedings that House Democrats are prepared to launch, and which seem destined to roil the Trump presidency.\n\nIn a roughly 30-minute conversation, Trump devoted significant time to a controversy involving Democratic presidential candidate and former Vice President Joe Biden. The president and his attorney Rudy Giuliani have accused Biden of pushing for the ouster of a former Ukrainian prosecutor who was investigating an energy company whose board included Biden’s youngest son, Hunter.\n\nThe transcript shows Trump pressing Zelensky to resume that investigation and to touch base with William Barr, his attorney general, about it. “A lot of people want to find out about that so whatever you can do with the attorney general would be great,” he said. “Biden went around bragging that he stopped the prosecution, so if you can look into it... It sounds horrible to me.”\n\n“I will have Mr. Giuliani give you a call, and I am also going to have Attorney General Barr call and we will get to the bottom of it,” Trump added.\n\nZelensky pledged that a new prosecutor, who “will be 100 percent my person,” would “look into the situation.”\n\nThe Justice Department said in a statement Wednesday morning that Trump’s pledge to enlist Barr in the effort was not carried out. “The president has not spoken with the attorney general about having Ukraine investigate anything relating to former Vice President Biden or his son,” DOJ spokesperson Kerri Kupec said. “The president has not asked the attorney general to contact Ukraine–on this or any other matter.\"\n\nThe intelligence community’s inspector general scrutinized Trump’s call with Zelensky out of a concern that Trump’s request for an investigation into Biden might constitute an illegal solicitation of a foreign in-kind contribution to his re-election campaign. The allegation was referred to the Justice Department, which declined to bring any charges.\n\nThe IG’s probe into the matter reportedly examined other people and contacts beyond the call between Trump and Zelensky. Additional documents related to that investigation are expected to be released to Congress this week.\n\nThe exchange nonetheless confirms allegations at the center of impeachment proceedings against the president. Key to those allegations are whether the president offered a quid pro quo whereby the U.S. would release $250 million in aid to Ukraine, which the administration was holding up at the time, in exchange for Zelensky’s political assistance. But one portion of the transcript suggests that such an offer was implied, though not necessarily involving Biden.\n\nAt one point during the call, Zelensky thanked Trump for his “great support in the area of defense. We are ready to continue to cooperate for the next steps, specifically we are almost ready to buy more [Javelin missiles] from the United States for defense purposes.”\n\nTrump’s immediate response was that he would like Zelensky to investigate matters related to the Russian government’s cyberattacks against Democrats during the 2016 presidential campaign.\n\n“I would like you to do us a favor though,” Trump replied to Zelensky’s request for additional military assistance, “because our country has been through a lot and Ukraine knows a lot about it. I would like you to find out what happened with this whole situation with Ukraine, they say CrowdStrike... I guess you have one of your wealthy people... The server, they say Ukraine has it.”\n\nCrowdStrike is the cybersecurity firm that investigated the hacking of the Democratic National Committee’s email servers in 2016. Trump allies have long viewed the company’s role in investigating the hack with suspicion. It was not immediately clear which “server” Trump was referring to, or why he believed it was in Ukraine’s possession. But the transcript does show that he felt a Ukrainian probe into the matter would assist his standing with respect to the just-concluded investigation by Special Counsel Robert Mueller into that hack and the larger Russian 2016 election-meddling effort. Once again, in this matter, Trump offered Barr’s assistance.\n\n“I would like to have the attorney general call you or your people and I would like you to get to the bottom of it,” he told Zelensky. “As you saw yesterday, that whole nonsense ended with a very poor performance by a man named Robert Mueller, an incompetent performance, but they say a lot of it started with Ukraine. Whatever you can do, it’s very important that you do it if that’s possible.”\n\nThe transcript is likely to further fuel Democrats’ determination to move forward with impeachment proceedings. On Tuesday, House Speaker Nancy Pelosi was careful to leave open the range of potential violations at the heart of the proceedings, but allegations that Trump improperly wielded the influence of his office to damage a political opponent are central to the surge in Democratic support for impeachment.\n\n“This was their attempt to spin us? It confirms everything,” said a House Democratic aide. “It’s actually even worse than we thought.”\n\nOn Wednesday morning, those members expressed shock at the new revelations, with some, including House Judiciary Committee Chairman Jerry Nadler (D-NY), calling on Barr to recuse himself.\n\nRep. Sheila Jackson Lee (D-TX), a Judiciary Committee member, said Barr needs to answer questions before her panel as soon as possible about whether he acted to carry out Trump’s requests to engage with Ukrainian officials on the Biden matter.\n\n“General Barr is in the mix now,” she said. “He is engaged.”\n\nThe transcript suggests Zelensky was eager to build a rapport with Trump. In addition to pledging a new investigation into Biden, the Ukrainian appears to flatter Trump on multiple occasions. Zelensky told Trump that his “drain the swamp,” anti-establishment mantra was an inspiration for his own presidential campaign. He also mentioned that he stayed at a Trump hotel when he was last in New York.\n\nThough the transcript appears to be fairly incriminating, the White House was careful to note that it is also incomplete. A footnote in the document released Wednesday says it “is not a verbatim transcript of a discussion.”\n\nTo that end, the document contains three ellipses, presumably denoting portions of the conversation that were not included in the transcript. All three occur in the midst of Trump’s requests for Zelensky to take some official action.\n\n-- with reporting by Sam Brodey", "description": "The memo outlines a July 25 call with Ukraine’s Volodymyr Zelensky that has fueled calls for impeachment.", "authors": ["Lachlan Markay", "Jamie Ross"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1569423602/190925-trump-transcripts-tease_xhduf4", "published_at": "2019-09-25"}