{"pub": "independent", "url": "https://independent.co.uk/news/world/europe/syria-war-turkey-kurds-latest-isis-trump-france-philippe-iraq-a9156881.html", "downloaded_at": "2019-10-15 15:00:31.823509+00:00", "title": "France says Isis resurgence 'inevitable' after Trump decision to allow Turkish offensive", "language": "en", "text": "A re-emergence of Isis is “inevitable” after Donald Trump effectively greenlit Turkey’s invasion of northern Syria, the French prime minister has said.\n\n\"This is devastating for our security with the inevitable resurgence of Islamic State in northeastern Syria and probably also northwest Iraq and so the destabilisation of a government that doesn't need that,\" Edouard Phillipe told deputies in the French national assembly.\n\nHe accused Washington of allowing and strengthening the Turkish offensive because of its decision to unilaterally withdraw 1,000 troops from Syria.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHundreds of relatives of Isis members have escaped from Kurdish-held camps in recent days, as guards have been diverted to the front line.\n\nFrance has been among the most proactive EU member states in opposing the Turkish military operation, cutting off arms to its Nato ally and putting sanctions on the table.\n\nItaly on Tuesday joined France, Germany, Finland and Sweden in halting arms sales to Turkey. The British government has taken a more equivocal position and has said it will be reviewing arms sales and temporarily suspending the issue of new export licenses for arms that could specifically be used in Syria during the process.\n\nMore follows…", "description": "A re-emergence of Isis is “inevitable” after Donald Trump effectively greenlit Turkey’s invasion of northern Syria, the French prime minister has said. \"This is devastating for our security with the inevitable resurgence of Islamic State in northeastern Syria and probably also northwest Iraq and so the destabilisation of a government that doesn't need that,\" Edouard Phillipe", "authors": ["Jon Stone"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/09/26/17/breaking-4.png", "published_at": "2019-10-15"}