{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/25/WS5db312b3a310cf3e35573b67.html", "downloaded_at": "2019-10-25 22:00:53.230857+00:00", "title": "Mike Pence stresses that US not seeking 'decoupling'", "language": "en", "text": "By ZHAO HUANXIN in Washington | China Daily Global | Updated: 2019-10-25 23:20\n\nFile photo: US Vice-President Mike Pence. [Photo/IC]\n\nUS Vice-President Mike Pence mostly bashed China in a speech Thursday, walking at times a careful line between hard-line statements and accommodative language, saying that Washington sought neither to \"decouple\" with nor contain the country's development.\n\nAnalysts said that Pence's address at the Woodrow Wilson International Center was laden with as much criticism on China on trade, human rights and other issues as his Hudson Institute speech a year ago.\n\n\"The speech was a bit less 'in your face' than last year's rather belligerent speech,\" said Jon R. Taylor, professor and the chair of the Department of Political Science and Geography at the University of Texas at San Antonio.\n\n\"Pence slightly — and I emphasize slightly — toned down the anti-China rhetoric, which might be seen as a mild yet positive development,\" he said.\n\nIn his speech, Pence noted people sometimes ask whether the Trump administration seeks to decouple from China.\n\n\"The answer is a resounding no,\" the vice-president said. \"The United States seeks engagement with China and China's engagement with the wider world.\"\n\nBut Taylor cautioned that one needs to watch what the administration does and not what it says.\n\n\"Pence's claim that there is no intention to 'decouple' rings pretty hollow right now,\" he said.\n\nGary Hufbauer, a senior fellow and trade expert at the Peterson Institute for International Economics in Washington, said he believed the US is clearly decoupling, both trade and investment relations, and also academic exchanges.\n\n\"The US is taking the initiative, not China,\" Hufbauer said.\n\nOther experts seemed to see Pence's remarks in a rosier way.\n\nCheng Li, director of the John L. Thornton China Center of the Brookings Institution, told China Daily, \"The main message is that US will continue to engage China on economic, diplomatic and security fronts, instead of decoupling with China, which is a profound change from the speech a year ago.\"\n\n\"In contrast to the Hudson Institute speech of October 2018, the vice-president's equally hard-hitting Wilson speech offered the beginnings of a positive vision for US-China relations,\" Robert Daly of the Kissinger Institute on China was quoted by Reuters as saying.\n\nOne of Pence's claims was that much of China's success over the decades \"was driven by American investment in China\".\n\nHufbauer said US investment in China is not large enough to justify that claim.\n\n\"Most of China's success is homegrown,\" he said.\n\nTaylor also said Pence's claim was unreasonable. \"Pence managed to diminish how the US has benefited and continues to benefit from Chinese goods and investments by Chinese businesses for the past three decades,\" he said.\n\nYukon Huang, a senior fellow at the Carnegie Endowment in Washington, has long pointed out that the percentage of US overseas investment that actually goes to China is only about 1.5 percent, which is way \"too little\".\n\nIt was an \"incorrect conventional wisdom\" to believe that US foreign investment into China harms US competitiveness and was creating job loss, the former China director of the World Bank told the Asia Experts Forum at Claremont McKenna College in April.\n\nPence also praised President Donald Trump's policies and economic feats, saying that \"no president before has so vigorously advanced America's interests in our relationship with China\".\n\n\"Past presidents have not used the aggressive rhetoric that Trump often speaks, nor have they imposed massive tariffs on China. But they have sought meaningful reforms in Chinese practices, working bilaterally and in the WTO,\" Hufbauer said.", "description": "US Vice-President Mike Pence mostly bashed China in a speech Thursday, walking at times a careful line between hard-line statements and accommodative language, saying that Washington sought neither to \"decouple\" with nor contain the country's development.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/25/5db312b3a310cf3e97a3062f.jpeg", "published_at": "2019-10-25"}