{"pub": "realclearpolitics", "url": "https://washingtonexaminer.com/news/congress/house-republicans-request-first-impeachment-witness-the-whistleblower", "downloaded_at": "2019-10-24 13:57:56.280831+00:00", "title": "House Republicans request first impeachment witness: The whistleblower", "language": "en", "text": "House Republicans, who have been denied the authority to request witnesses in the ongoing impeachment inquiry of President Trump, asked Democrats to summon the anonymous whistleblower to testify publicly.\n\nRepublicans leading the House Intelligence, Foreign Affairs, and Oversight committees on Wednesday sent a letter to Intelligence Committee Chairman Adam Schiff requesting the whistleblower testify in an open session as well as “all individuals he or she relied upon in formulating the complaint.”\n\nRepublicans wrote to the California Democrat that the whistleblower’s accusations have been contradicted by information the three panels have since gathered in closed-door impeachment testimony from several witnesses this month.\n\n“In light of these inconsistencies between facts as alleged by the employee and information obtained during the so-called impeachment inquiry, the Committee ought to fully access the sources and credibility of the employee,” Republican Reps. Jim Jordan, Devin Nunes, and Michael McCaul wrote to Schiff.\n\nThe three lawmakers are the top Republicans on the Oversight, Intelligence and Foreign Affairs committees, respectively.\n\nSchiff once touted the whistleblower as a key witness in the impeachment proceeding, but he now argues the whistleblower’s testimony is not needed and in fact could endanger the whistleblower's anonymity and safety.\n\nRepublicans want to question the whistleblower about the extent of his contact with Schiff and his staff prior to filing a complaint against Trump in August with the inspector general of the Intelligence Community.\n\nRepublicans, in the letter to Schiff, outline inconsistencies in what the whistleblower claimed Trump said on a July 25 call with the president of Ukraine, Volodymyr Zelensky, and what was discovered through other witness testimony.\n\nAmong the discredited claims, Republicans said, is one that Trump “instructed Vice President Pence to cancel his planned travel to Ukraine to attend President Zelensky’s inauguration.”\n\nThe whistleblower also claimed then-Special Envoy for Ukraine Kurt Volker and Ambassador to the European Union Gordon Sondland had “spoken with” Trump’s lawyer, Rudy Giuliani, “in an attempt to contain damage to U.S. national security.”\n\nRepublicans said they “expect” Schiff to arrange for the testimony because the impeachment inquiry was never formalized with bipartisan rules that would have at least allowed the GOP to request subpoenas for witnesses.\n\n“We may request additional witnesses at the appropriate time as the inquiry continues,” the GOP lawmakers wrote. “Your failure to arrange for the committee to receive this testimony shall constitute evidence of your denial of fundamental fairness and due process.”", "description": "House Republicans, who have been denied the authority to request witnesses in the ongoing impeachment inquiry of President Trump, asked Democrats to summon the anonymous whistleblower to testify publicly.", "authors": [], "top_image": "https://mediadc.brightspotcdn.com/dims4/default/4366cf0/2147483647/strip/true/crop/5153x2705+2+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F33%2F24%2F772b283df935b0bae80d7755830e%2F3ffcb3ebcd8ebeb2cdc0f98a04dbe9ae.jpg", "published_at": "2019-10-23"}