{"pub": "yahoo", "url": "https://finance.yahoo.com/news/police-foil-3-000-person-150055763.html", "downloaded_at": "2019-09-04 03:51:15.782953+00:00", "title": "Police Foil a 3,000-Person Hide-and-Seek Game at an IKEA", "language": "en", "published_at": "2019-09-03", "text": "It’s easy to get lost in IKEA. The typical store is about 300,000 square feet spread out over multiple floors, and the world’s largest IKEA is a whopping 700,000 square feet.\n\nAnd massive IKEA warehouse stores, overflowing with nooks and crannies in acres of faux bedrooms, closets, kitchens, and storage areas have proven all too tempting over the years for people eager to play absolutely epic games of hide-and-seek.\n\nThe plague of IKEA hide-and-seek surfaced over the weekend at its huge store in Glasgow, Scotland. Police were called after being alerted that some 3,000 people on Facebook said they planned to mob the store for hide-and-seek. Five police officers remained at the IKEA store in Glasgow for most of the day on Saturday, trying to gauge whether suspicious-looking customers were browsing for the perfect spot to hide or genuinely pondering if a rug matched their living room.\n\n“People are stopping everyone who looks like they are here for a game of hide and seek,” someone who said they’d visited the Glasgow IKEA store posted online, The Scotsman reported.\n\nIKEA says its stores cannot host hide-and-seek games because of health and safety issues. “We need to make sure people are safe, and that’s hard if we don’t know where they are,” an IKEA spokesperson has said.\n\nIKEA officially banned hide-and-seek in 2015. During the months before the ban was instituted, tens of thousands of people had signed up online to play hide-and-seek at IKEA stores in Europe, including retail warehouses in Amsterdam, Utrecht, and Prague. IKEA had to officially ban hide-and-seek at stores in Australia too.\n\nIt seems like the IKEA hide-and-seek phenomenon hasn’t hit the U.S., or at least people haven’t been busted for playing in stores. Maybe that’s just because the hiders are so good and the seekers are so subtle that their games haven’t been detected.\n\nHonestly, we can’t blame people for wanting to play hide and seek at IKEA. The place seems made for it. Heck, IKEA has even designed a “hide and seek playground”-theme bedroom for girls. “This little girl loves hide and seek, and her bedroom is filled with flexible furniture that also conceals and reveals,” IKEA’s ad copy for the bedroom says. “Can you guess her favorite hiding spot?”", "description": "Dang.", "authors": ["Brad Tuttle"], "top_image": "https://s.yimg.com/uu/api/res/1.2/RDLXqZ30HLY42HbjYJo4gA--~B/aD0yNTMzO3c9MzgwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/money_403/b43d77a2f93e1de2ae2e5757c6fa5d02"}