{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7561079/Anne-Hathaway-flaunts-growing-baby-bump-tiered-cream-colored-top.html", "downloaded_at": "2019-10-11 02:29:15.351895+00:00", "title": "Anne Hathaway flaunts her growing baby bump in a tiered cream-colored top", "language": "en", "text": "She announced she is pregnant via Instagram in July.\n\nAnd Anne Hathaway showed the proof on the red carpet for the NYC premiere of Modern Love on Thursday in a cream-colored top with tiers that framed her growing baby bump.\n\nThe 36-year-old Princess Diaries star coupled the statement top with a pair of stark white pants with a boot-cut hem and strappy gold heels.\n\nBun in the oven: Anne Hathaway showed the proof of her pregnancy on the red carpet for the NYC premiere of Modern Love on Thursday in a cream-colored top with tiers that framed her growing baby bump\n\nShe accessorized with an ornate bronze necklace and a set of matching drop earrings.\n\nHathaway finished off her eyes with a touch of brown shadow and coated her lips in a berry color.\n\nModern Love is a web TV series based on the New York Times' weekly column of the same title.\n\nRegal: The 36-year-old Princess Diaries star coupled the statement top with a pair of stark white pants with a boot-cut hem and strappy gold heels\n\nGorgeous: She accessorized with an ornate bronze necklace and a set of matching drop earrings\n\nHappy: Hathaway finished off her eyes with a touch of brown shadow and coated her lips in a berry color\n\nAccording to a statement, Modern Love will touch on 'love in its multitude of forms - including sexual, romantic, familial, platonic, and self love.'\n\nTina Fey, Dev Patel, John Slattery, Brandon Victor Dixon, Catherine Keener, Julia Garner, Andy García, Cristin Milioti, Olivia Cooke, Andrew Scott, Shea Whigham, Gary Carr, Sofia Boutella, and John Gallagher Jr. are also part of the show's ensemble cast.\n\nHathaway plays Lexi, a lawyer with bipolar disorder who calls herself 'the one human being who accepts the two people' that live within her.\n\nOn-screen: Hathaway plays Lexi, a lawyer with bipolar disorder who calls herself 'the one human being who accepts the two people' that live within her. Here she is alongside Gary Carr on the show, who plays Jeff\n\nHer love interest by the end of the series ends up being someone the audience could have never expected.\n\nAccording to Hathaway via TV Insider, finding love 'changes everything for her. It gives her hope and gives her a future.'\n\nEmmy Rossum, who co-directed the show, also arrived to the premiere in a cerulean blue gown with a high slit, billowy sleeves and a mock neck.\n\nCast member Cristin Milioti posed on the red carpet in a puff-sleeved shift dress in a dotted print.\n\nModern Love premieres Friday, Oct. 18 on Amazon Prime Video.\n\nLOL: Hathaway was caught in the middle of a laugh on the red carpet\n\nBeaming: She cracked a huge smile on the red carpet while holding her bump with pride\n\nGetting practice: Hathaway interfaced with another attendee's baby while on the red carpet\n\nGroup shot! Brandon Kyle Goodman, Cristin Milioti, Emmy Rossum and Anne Hathaway posed together on the red carpet at one point\n\nBlue fever: Emmy Rossum, who co-directed the show, also arrived to the premiere in a cerulean blue gown with a high slit, billowy sleeves and a mock neck\n\nPosh: Rossum paired her dress with a set of black pumps\n\nChic: She also accessorized with a marigold velvet clutch and bold hoop earrings\n\nPretty: Cast member Cristin Milioti posed on the red carpet in a puff-sleeved shift dress in a dotted print", "description": "She announced she is pregnant via Instagram in July. And Anne Hathaway showed the proof on the red carpet for the NYC premiere of Modern Love on Thursday in a cream-colored top with tiers", "authors": ["Marisa Okano For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/01/19566088-0-image-a-38_1570754546935.jpg", "published_at": "2019-10-11"}