{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-oil-conference-shell/shell-urges-collaboration-with-other-industries-to-tackle-emissions-idUKKBN1WO18T", "downloaded_at": "2019-10-09 12:12:27.588020+00:00", "title": "Shell urges collaboration with other industries to tackle emissions", "language": "en", "text": "LONDON (Reuters) - Royal Dutch Shell’s (RDSa.L) chief executive took aim beyond the energy sector to call on leaders of other industries including aviation, shipping and steel to jointly draw up plans to tackle greenhouse gas emissions.\n\nFILE PHOTO: The logo of Royal Dutch Shell is seen at a petrol station in Sint-Pieters-Leeuw, Belgium January 30, 2019. REUTERS/Yves Herman\n\nBen van Beurden also warned on Wednesday that energy companies that do not collaborate in the fight against climate under the 2015 Paris agreement risk going out of business.\n\n“Climate change is the biggest challenge facing the energy industry, but the energy industry isn’t the biggest challenge for the world trying to tackle climate change,” van Beurden told the Oil & Money conference.\n\n“All sectors need to figure out pathways to net zero emissions.”\n\nOil and gas companies have come under huge public and investor pressure in recent years to reduce carbon emissions from their operations and the products they sell.\n\nBut van Beurden said that to reach the Paris climate goals for “net zero” emissions by the end of the century, governments and industries need to transform demand.\n\nGovernment-set taxes on carbon emissions will not be enough to turn the tide and coordinated action from industries to improve efficiency and reduce emissions is essential, he said.\n\n“If this type of sector-by-sector action does not happen, the world will fail to meet the goals of the Paris agreement.”\n\nShell, the world’s second-largest listed energy company, has recently taken part in a joint effort with the Danish government, AP Moeller Maersk (MAERSKb.CO), the world’s largest shipper, and Citigroup (C.N) bank, to come up with ways to develop a system to offset emissions from commercial ships, van Beurden said.\n\n“Energy companies which do not play a full role in such in such collaborations and that do not evolve will fall behind society. They will fall by the wayside,” van Beurden said.", "description": "Royal Dutch Shell's chief executive took aim beyond the energy sector to call on leaders of other industries including aviation, shipping and steel to jointly draw up plans to tackle greenhouse gas emissions.", "authors": ["Ron Bousso", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191009&t=2&i=1438802858&w=1200&r=LYNXMPEF980XO", "published_at": "2019-10-09"}