{"pub": "cbs", "title": "Looser gun laws in Texas go into effect one day after latest mass shooting", "url": "https://cbsnews.com/news/texas-gun-laws-one-day-after-odessa-mass-shooting-looser-gun-laws-go-into-effect-2019-09-01", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:00:49.346531+00:00", "text": "A series of loosened gun laws went into effect in Texas on Sunday — just one day after the state's latest mass shooting, which left at least seven people dead. The new laws make it easier to carry guns in public places, including schools, apartment buildings and places of worship.\n\nThese measures were passed by the state's Republican-controlled legislature and signed by Republican Governor Greg Abbott in June. An additional bill restricting guns in airports passed by lawmakers was vetoed by Abbott.\n\nThe bill would've allowed local authorities to be able to charge travelers who carry guns into secure areas of Texas airports instead of only allowing federal agents to do so. Per federal law, guns are banned in secure airport areas.\n\nThe laws that took effect Sunday will:\n\nAllow licensed handgun owners to carry weapons in places of worship, including churches and synagogues.\n\nBan landlords and homeowners from prohibiting tenants to own, carry and transport guns on their property.\n\nPrevent school districts from prohibiting licensed gun owners — including school employees — from storing guns and ammunition in school parking lots as long as it is not in plain view.\n\nAllow foster homes to store firearms.\n\nPrevent citizens for being charged for carrying a handgun without a license while evacuating or returning to a declared disaster zone.\n\nAllow disaster shelters to take in evacuees who have guns.\n\nAllow schools to have more armed marshals on campus.\n\nDefend licensed gun owners who unknowingly enter designated gun-free zones as long as they leave after being told about the policy.\n\nTexas also approved a $1 million statewide campaign for safe gun storage, which will begin within the next year.\n\nThe National Rifle Association supported the bills and a regional lobbyist for the group said Texas lawmakers gave the NRA \"one of the most successful sessions we've had.\"\n\nNews of the laws going into effect follows two mass casualty shootings in the past month in the state. On Saturday, a gunman in Odessa killed at least seven people and wounded 24 in a drive-by rampage before he was killed by police. Weeks before that, a suspected gunman who is believed to have posted a racist screed online killed 22 people and injured 24 at a Walmart in El Paso.\n\nTexas was home to two other high-profile mass shootings in the past two years. In May 2018, a gunman believed to be have been a student at Santa Fe High School killed 10 people and wounded 13 in the school. In November 2017, a gunman killed 26 people and wounded 20 during a Sunday church service in Sutherland Springs. The Sutherland Springs rampage is the deadliest mass shooting in Texas history and the deadliest shooting in a place of worship in modern U.S. history.\n\nSpeaking in Odessa on Sunday, Abbott said he had \"been to too many of these events.\"\n\n\"I am tired of the dying of the people of the state of Texas,\" the governor said. \"Too many Texans are in mourning. Too many Texans have lost their lives. The status quo in Texas is unacceptable and action is needed.\"\n\nAbbott said the state needs \"solutions that will keep guns out of the hands of criminals\" while still protecting Second Amendment rights, though he did not call for any specific gun control measures.\n\n2020 Democratic presidential candidate Beto O'Rourke, who is from El Paso and served as a Texas congressman, called for universal background checks, red flag laws and a national gun registry during an interview with CBS' \"Face The Nation\" on Sunday.\n\n\"People are living with fear, feel like they have targets on their backs right now,\" O'Rourke said. \"Kids afraid to go to school tomorrow morning. This is not right. Unacceptable. And I won't accept it.\"", "description": "The new laws make it easier to have guns in public places including schools, apartment buildings and places of worship", "authors": ["Jason Silverstein"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/09/01/518f022a-f17e-4ad6-8727-1082f0de2bb7/thumbnail/1200x630/95988756ab01e8b846402b7e75bcc3f5/gettyimages-1165455389.jpg"}