{"pub": "dailymail", "url": "https://dailymail.co.uk/money/cars/article-7456331/Councils-increasingly-turn-bailiffs-pursue-unpaid-parking-fines.html", "downloaded_at": "2019-10-05 07:06:42.442250+00:00", "title": "Councils increasingly turn to bailiffs to pursue unpaid parking fines", "language": "en", "text": "Councils are increasingly turning to bailiffs to pursue motorists who have failed to pay fines for parking infringements, it's been confirmed by a debt charity.\n\nOver a million cases were passed on from local authorities in England and Wales to collect unpaid parking fines in the past year, which is a 21 per cent hike in the use of bailiffs to chase drivers compared to the two years previous.\n\nCouncils said it was 'their duty to residents' to collect this money, though Money Advice Trust said bailiff action is 'harmful to people in debt' and called on the government to independently regulate bailiffs and introduce a simple complaints system.\n\nCalling in the debt collectors: Local councils passed almost 1.1million unpaid parking fine debts to bailiffs to resolve in 2018-19, a new study has revealed\n\nResearch conducted by the debt charity found that local councils had forwarded almost 1.1million unpaid parking fine cases to bailiffs in 2018-19.\n\nIn total, local councils admitted via a freedom of information request that they had sent a total 2.6million debts to bailiffs over that period - 1.4million of them being related to unpaid council tax.\n\nIt means that two in five instances of authorities calling in bailiffs last year were to chase down unpaid parking fines, based on the feedback from 367 councils.\n\nThis represented a 21 per cent rise compared to 2016-17, the report by Money Advice Trust - which also runs the National Debtline.\n\nHowever, it suggested that instances of smaller councils using bailiffs to collect unpaid fines from drivers had risen by 55 per cent over a four-year period.\n\nThis is due to a recent jump in Penalty Charge Notices issued to drivers by councils for breaching parking rules, which is the most common PCN offence type.\n\nParking PCNs are not considered criminal offences and drivers cannot be sent to prison for not paying. Instead, they are enforced through the county courts.\n\nTwenty-one days after a court order is issued, a local authority can provide a warrant to bailiffs.\n\nIt is not possible to ask the court to suspend the warrant or to request for the charge to be paid in instalments.\n\nThis is not the case for council tax arrears, housing benefit overpayments and unpaid business rates, which can all be spread across multiple payments.\n\nParking offences are the most common reason for penalty charge notices to be issued by councils\n\nBailiffs can take money on the doorstep but are not authorised to force entry into properties. Debt charity Money Advice Trust said more needs to be done to protect vulnerable people\n\nWhen bailiffs do turn up at people's homes to collect the full outstanding debt, they can take money on the doorstep but are not authorised to force entry into the property.\n\nCouncils have a duty to their residents to collect taxes, which play a vital role in funding important services that people rely on Richard Watts, Local Government Association\n\nThat said, they can remove possessions from inside or outside a home to cover any unpaid debts, though the valuation of these items tend to be lower estimations.\n\nThe Money Advice Trust is calling on the government to change the rules to allow drivers who are struggling to pay a fine to offer it in instalments.\n\nJoanna Elson OBE, chief executive of the trust, said: 'Reforming the law around bailiff action itself is vital if we are to protect people from harm - and we are today renewing our call for the government to introduce independent bailiff regulation and a single complaints mechanism.\n\n'Of equal importance, however, is reducing the number of debts that are being passed to bailiffs in the first place.\n\n'While we have seen a modest improvement in debt collection practices - and more councils reducing their use of bailiffs to collect council tax arrears - the pace of change is too slow.\n\n'Bailiff action should only ever be used as a last resort, and can be avoided by early intervention, making sure residents get the free debt advice they need, and agreeing repayment arrangements that are affordable and sustainable.'\n\nParking fines account for 41% of council bailiff use. Only council tax arrears forwarded to bailiffs by local authorities, the investigation found\n\nIn a statement issued in response to the report, Richard Watts from the Local Government Association said that councils 'have a duty to their residents' to collect unpaid fines because they 'play a vital role in funding important services that people rely on'.\n\nThough he went on to say: 'However, we realise that times are tough and councils do their best to protect those affected the most, whether through introducing hardships funds or taking a sympathetic and constructive approach to the way we collect unpaid tax.\n\n'We have worked with Citizens Advice on a protocol for recovering debts, which as this report demonstrates is having a positive effect.\n\n'It includes the need for fair collection and enforcement policies and the ability for councils to take back cases involving vulnerable families.\n\n'Anyone having trouble paying their council bills should get in touch with their local authority for financial help and advice.'\n\nThe Ministry of Justice is currently conducting a review to decide if bailiffs should be independently regulated.\n\nMotoring correspondent and campaigner Quentin Willson, formerly of BBC Top Gear, took to social media to voice his opinion on the matter, tweeting: 'Bailiffs pursuing parking tickets is now 41 per cent of local authority bailiff use. Up 21 per cent in two years.\n\n'Parking fines are a major revenue stream for councils and nothing to do with traffic flow or road safety.\n\n'How have our MPs allowed this billion pound scandal to go unchecked?'", "description": "Almost 1.1m unpaid parking fine cases were passed to bailiffs by councils in England and Wales  in 2018-19 - a 21% increase compared to two years previous.", "authors": ["Rob Hull For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/09/12/17/18404090-0-image-a-26_1568306249892.jpg", "published_at": "2019-09-12"}