{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7541789/Great-British-Bake-Offs-Nadiya-Hussain-reveals-sexually-abused-relative-aged-five.html", "downloaded_at": "2019-10-05 22:57:02.254158+00:00", "title": "Great British Bake Off's Nadiya Hussain reveals she was sexually abused by a relative aged five", "language": "en", "text": "She won legions of fans on The Great British Bake Off with her bubbly personality and has gone on to become one of Britain's best-loved celebrity chefs.\n\nBut today Nadiya Hussain reveals that behind her cheerful public persona, lies a harrowing childhood incident that left lasting mental scars.\n\nIn a powerful and poignant interview with The Mail on Sunday's You magazine, the baker tells how she was sexually assaulted by a relative at the age of five.\n\nNow 34, she says the traumatic crime contributed to a suicide attempt at the age of ten, and left her suffering panic attacks and post-traumatic stress disorder (PTSD) for decades.\n\nIn a powerful and poignant interview with The Mail on Sunday's You magazine, the baker (pictured) tells how she was sexually assaulted by a relative at the age of five\n\nNadiya said: 'No doubt that would have played a role in my PTSD, my panic disorder. It must have done, because it's a memory that has stayed with me for ever.'\n\nThe chef – who writes about the attack in Bangladesh in her forthcoming memoir Finding My Voice – said she only fully understood what had happened when she learned about sex in a biology class.\n\nThe realisation made her throw up in a sink on the laboratory bench.\n\n'I've only told my sisters recently and, growing up, I had a close friend at school who I told. It turned out a very similar thing had happened to her,' Nadiya said.\n\n'It's important to talk about it because it probably happens much more than we care to talk about.\n\nShe says the traumatic crime contributed to a suicide attempt at the age of ten, and left her suffering panic attacks and post-traumatic stress disorder (PTSD) for decades\n\n'If that happened to my children, I don't even want to say what I would do. I have no words.'\n\nNadiya also reveals how deeply she had been scarred by bullying at primary school by boys who dunked her head in the toilet and harassed her for being 'too dark'.\n\nShe says that she still cannot go to the toilet without flashbacks. 'It was the most hideous thing ever. You feel like you're drowning.'\n\nShe said the first time she heard the word 'suicide', aged ten, she considered it could be a 'bus ticket' out of her torment.\n\nOne evening she tried to overdose on tablets but was interrupted by the news that her mother was pregnant with her brother, Shak.\n\nRising up... Childhood abuse, bullying, panic attacks – Bake Off star Nadiya Hussain has survived them all, and now she's determined to speak out. She tells Elizabeth Day why she lives by her mantra of 'elbows out, create your own space'\n\nNadiya Hussain has become, whether she likes it or not, a Great British role model. Blazer, Iris & Ink. Top, bershka.com. Headscarf, mypashmina.co.uk\n\nNadiya Hussain's husband has an unusual system for monitoring his wife's state of mind. If he's unsure of how she might be feeling, he looks at the colour of the headscarf she's wearing.\n\n'Abdal calls them the mood scarves,' Nadiya says. 'So if I wear black he knows I'm probably not having a very good day, but if I'm wearing something a little bit colourful he's like, 'Oh, are you all right today?' She laughs. 'I feel bad for him because he has to second-guess my every emotion… but he's just like, 'This is our life.'\n\nFour years ago, when she was a contestant on the sixth series of The Great British Bake Off, she wore a black headscarf. Despite her obvious skill with cakes and loaves in front of the cameras, behind the scenes Nadiya was having panic attacks in her hotel room at the end of the day's filming.\n\nAs a child, she had felt extremely anxious without knowing why. When she was a teenager, she was finally diagnosed with a panic disorder and underwent cognitive behaviour therapy at the suggestion of her GP. But she gave up after one session, unable to afford the course. After the birth of her third child – a daughter, Maryam, who is now nine – the panic attacks grew worse. Another doctor prescribed antidepressants, which made her feel emotionally numb. By the time she entered Bake Off, aged 30 (at her husband's suggestion), Nadiya was used to coping with private anxiety masked by an outward persona.\n\nOn screen, we watched as her confidence grew in shaky increments. She went from doubting her baking abilities to knowing how good she was. Then, in week six: 'I braved a green headscarf,' she says. In hindsight, it was a watershed moment. Nadiya went on to win the competition, in a final that was watched by 14.5 million people and in which she gave a rousing speech claiming, 'I am never going to put boundaries on myself ever again. I'm never going to say I can't do it. I can. And I will.'\n\nOvernight, she was heralded as a new kind of role model: she was young, modern, British and also a hijab-wearing Muslim woman of colour who grew up one of six children in a working-class Bangladeshi community in Luton and had an arranged marriage at the age of 20. Her infectiously warm presence made a move into TV presenting a natural progression. Since then, she's fronted several food programmes, including a BBC Two series called Nadiya's British Food Adventure, and was chosen to bake the Queen's 90th birthday cake.\n\nNadiya wears blouse, Roksanda, from theoutnet.com. Headscarf, mypashmina.co.uk\n\nPlus, as well as cookbooks, a novel and children's books to her name, at the grand old age of 34 Nadiya has written her autobiography aptly called Finding My Voice. The chapters are divided up according to ten roles she inhabits in her life, including Daughter, Wife, Ma, Earner and Woman. But Nadiya says, 'It's not really a memoir. It's just snippets of my life.'\n\nShe has become, whether she likes it or not, a Great British role model. In 2016, Nadiya was named by Debrett's as one of the 500 most influential people in the UK and one expert on community cohesion said she had done 'more for British-Muslim relations than ten years of government policy'.\n\n'If you'd said four years ago, 'What does it feel like to carry the responsibility of being this Muslim woman in the public eye?' I would have shut you off,' Nadiya says. 'I would have said, 'No, no, can we just talk about my cookbooks?' But four years on, I understand the importance of doing what I do. And that's partly the reason why I wrote this book. Growing up, I didn't see a Muslim woman on television… it's important to create that space in publishing, in television, in cookery. If I just hide in the background, that space will go away. I always say to my kids, 'Elbows out, create your own space.' She talks matter-of-factly about being on TV shoots with 'cameramen, producers, directors and I'm the only coloured person out of 60 people,' and still feels socially anxious at public events where 'I'm the only brown face, or the only Muslim woman. I avoid any red-carpet events because I just think, 'I'm not going to fit in, so why would I go?'\n\nOn Twitter, where Nadiya has more than 216,000 followers, she gets racist abuse on a daily basis. 'Very recently I got a tweet and somebody said Muslims should not have pets because they don't look after them.' She shakes her head at the absurdity. 'What gives anyone the right to say that?' For the record, Nadiya's Milton Keynes home contains four chickens, a budgie, a rabbit and a cat – all well cared for. She also wants to get some pygmy goats. It's like a petting zoo, I say. She whoops with laughter, 'I want to charge everybody £2.50 to get into my house.'\n\nHer face is beautiful and remarkably unlined. She smiles readily, speaking quickly as though there is too much to say and never enough time to say it. Her headscarf is black but printed with colourful flowers. I suppose, according Abdal's theory, this means she is feeling a mixture of both anxious and cheerful.\n\nDress, uterque.com. Headscarf, johnlewis.com. 'We have this rule in our marriage, there's no such thing as 50/50,' Nadiya says. 'Somebody is always putting in more'\n\n'You know, I'll always be a mixture of everything,' she agrees, before rushing on to tell a seemingly unrelated story about how the night before she had put her kids to bed then went to Costco with her brother. Her face lights up as she talks about the low-cost store. 'You can buy a 60-pack box of crisps and that just makes me so excited. Like, eight kilos of pretzels, cookbooks – and furniture, you know? And a bike! The things you can find there…' But after the shopping trip, she 'felt guilty for leaving my kids. And the guilt stayed with me until this morning.' She thinks it was because the summer break was ending and her three children – boys 13-year-old Musa and 12-year-old Dawud, along with Maryam – were going back to school so she wanted to spend as much time with them as possible as well as have dinner with her husband. She felt pulled between the three competing demands of sister, wife and mother. 'I'm never any one role,' she says. It is an admission that will strike a familiar chord with many women and this relatability has always been a considerable part of Nadiya's charm.\n\n'We have this rule in our marriage, there's no such thing as 50/50,' she continues. 'Somebody is always putting in more. Today I'm not going to be at home so Abdal has to make sure the kids have everything they need and get off to school OK… He's also got a full-time job. So in terms of percentages, I'm certainly not putting in 50 today.'\n\nTheirs was an arranged marriage which blossomed into true love. 'We did things backwards. There are lots of people who know they want to be with each other for ever and then they get married, but we did it the other way around. We got lucky.' Would she arrange marriages for her children? 'Never! Not in a million years. I have better things to do.'\n\nThis is the first interview Nadiya has done to promote Finding My Voice, and 'it's kind of nerve-racking… because I'm putting myself out there'. The memoir is a revelatory, honest read. It barely mentions Bake Off (she still watches, but on record so she can fast forward the adverts), and she writes with clear-eyed insight into some of the most traumatic episodes of her life, such as when she was bullied at primary school by a group of boys who stuck her head down the toilet and harassed her for being 'too dark'. To this day, she can't go to the loo without flashbacks. 'It was the most hideous thing ever,' she says. 'You feel like you're drowning.'\n\nAt the age of ten, she remembers hearing the word 'suicide' for the first time on television and thinking it could be her way out of unhappiness. 'I can only equate it to a feeling similar to being able to buy a bus ticket,' she explains. 'It was, like, 'What? I can buy this ticket and I can just go and I'd never get bullied again?'\n\nOne evening after school, she sat on her bed and tried to overdose on some tablets but was interrupted by the news that her mother was pregnant with her brother, Shak. It was a chance occurrence that saved her life. She decided to live on for her brother's sake.\n\nYears later, a doctor would suggest that Nadiya suffered from post-traumatic stress disorder (PTSD) – not only because of the bullying, but because two of her younger siblings were seriously ill. Her eldest brother, 18 months younger than her, was born with a cleft lip and palate and underwent more than 20 operations. Her younger sister suffered from a congenital heart condition that necessitated frequent hospital stays. As a child, Nadiya was constantly listening to her siblings' breathing, terrified that they would die. She says she didn't want to bother her parents (her father was a chef in an Indian restaurant, working long hours) by telling them about the school bullies and that when she confided in a teacher, she was told to 'ignore them'. The bullying eventually stopped when she went to an all-girls' secondary school.\n\nBeing named star baker on The great British Bake Off, 2015. In 2016, Nadiya was named by Debrett's as one of the 500 most influential people in the UK\n\nBut, reading the book, it becomes clear that the roots of Nadiya's anxiety disorder go back even earlier than that. At the age of five, she was sexually assaulted by a relative in Bangladesh. 'I mean, no doubt that would have played a role in my PTSD, my panic disorder,' she says now. 'It must have done, because it's a memory that has stayed with me for ever.'\n\nShe was confused rather than scared at the time, she says. It was only some years later, when sex was explained in a biology class at school, that Nadiya understood what had happened to her and threw up in the laboratory bench sink.\n\nIs this the first time that she has spoken about the assault?\n\n'Um…' She looks uncomfortable.\n\nOr written about it? 'Yes. Yeah. Definitely.'\n\nHow did it feel to revisit that? 'The question I asked myself was, 'Why am I putting this out there?' I've only told my sisters recently and, growing up, I had a close friend at school who I told. It turned out a very similar thing had happened to her… [and] I think it's important to talk about it because it probably happens much more than we care to talk about.\n\n'I DIDN'T KNOW WHAT DEATH WAS, BUT I DIDN'T LIKE MY LIFE' 'Congratulations, Mr Ali, you've had a bouncy baby girl!' 'Bastard!' I never tire of my birth story. I am relentless in my pursuit to understand it. I am not averse to a little profanity occasionally – but during the birth of a child? A new baby, a time to rejoice, to celebrate? As a child I remember being saddened by this part of the story. Even as a grown-up, I feel a pang of sadness for that word along with an equal measure of hysterics. 'My brother Shak was born on 6 August 1995. I held him in my arms: tiny hands, tiny feet. He looked up at me and I had never seen anything so small or needy' As I got older, it wasn't that first part of the story that interested me. It was the subsequent part. A husband, a father shuddered at the thought of calling his relatives to announce the birth of his third daughter. He always maintained that he was happy that he had a healthy little girl, but I know that secretly he wished, longed for that little boy, an heir to his throne, the carrier of his surname. He knew that life would have been a lot easier if he had just had that baby boy. The madness of those anxieties still makes my head spin. I repeatedly find myself wondering about the fact that these days you can find out the sex of your child. Would my parents have gone down this path if they could? And if they did find out they were having a third girl, would I be here today? I don't think I would. In a community so hellbent on creating alpha males, I might not have stood a chance. The pressure was on for my old man. He had to make that call. What I think made it even more painful was that my dad's brother lived just a few streets away with four strapping boys, his wife, revered and loved, practically worshipped. Whenever she was asked how many children she had she would puff out her chest and say, 'I have four sons'. She was everything every woman in our community wanted to be. My mum never answered that question in the same satisfied way. ★ It had been just after the last lesson that it happened. I was ten years old. As I walked out of the classroom to go to lunch, they waited in the gap between the Portakabins. I had become used to looking over my shoulder. Because no matter how much I tried to hide, they were there. 'Miss, I'm being bullied.' 'Ignore them and they will go away.' I ignored them and they never went away. As I walked out that lunchtime one of them gave me a greeting with his willy peering out of his grey trousers, waiting for my imminent arrival to get it into an aroused state. As a mother of two sons who have surpassed that age, I often wonder what led those boys to become so damaged and vicious. Were they not told that they were loved? I wasn't told 'I love you' when I grew up, but I wasn't flashing my vagina to people I disliked. I wanted to tell my parents but they were preoccupied with two sick kids. I get that now, but such perspective is hard to learn when you are still at primary school. 'Look at it,' he said as he pulled out his manhood. Ashamed and embarrassed, I turned away. 'You're disgusting.' 'You're disgusting, you black bitch.' He grabbed my hair. It was the only time I have ever been pleased to have hair so short you couldn't grab it from the back. But it was enough hair to draw some blood. Then they held my hands down into the hinge of the Portakabin door. I couldn't fight them off. I had tried weeks before when they had flushed my head down the boys' gammy toilets. They were strong and I accepted that this was going to happen whether I liked it or not. They slammed the door on to my fingers three times. When they stopped I got off my knees and ran with the faint sound of 'ugly black bitch' mixing in with the pounding of my heart. I cried because it hurt so much. My fingers, everything just hurt so much. ★ Back at home sitting on the side of my bed. My feet didn't touch the ground yet so they dangled. Everyone was downstairs. I could hear the faint sound of the television and my mum's sewing machine rattling occasionally. I sat and patted the packet of tablets in my pocket. I didn't know what death was. All I knew was that it meant not living the life I had now – and I didn't like my life. I tried to swallow my first. It was harder than it looked. By the time I managed it most had dissolved in my mouth, leaving the most bitter taste. I was excited that I was going to do this. I was not going to get bullied tomorrow, but first I had to go downstairs to get some water. As I walked across the living room, everyone was huddled around my mum. 'Tell them!' Dad said. 'Mum's having another baby!' A roar of excitement and I joined in at the thought of another sibling. Then, reminded that I had a job to do, I filled a glass with water and went upstairs. Every step leading to that room felt heavy. I jumped on to the bed, feet still dangling. Then I paused to think. 'I will do this but after the baby is born.' I had to meet this new baby who was either my brother or sister. My brother Shak was born on 6 August 1995. I held him in my arms: tiny hands, tiny feet. He looked up at me and I had never seen anything so small or needy. 'I can't go anywhere, I have to stay for him. He will need me.' So I stayed. The epitome of a new life in more ways than one. Finding My Voice will be published by Headline on 17 October, price £20. To order a copy for £16 with free p&p until 20 October call 01603 648155 or go to mailshop.co.uk. For details of where you can meet Nadiya on her book tour, go to faneproductions.com/nadiya\n\n'If that happened to my children, I don't even want to say what I would do. I can't even… just as a mother… I can't. I have no words. I very rarely have no words.'\n\nHas her family read the book?\n\nThere is another hesitation. The pauses are striking because she normally speaks with such buoyant fluency. 'Mm-hmm,' she nods. 'Yeah, they've read parts of it. My parents don't read very much… I think they'll enjoy reading it. And I think parts of it will be difficult for them. But I think… yeah, I think that… I don't know. We'll see.'\n\nThis is the first interview Nadiya has done to promote Finding My Voice, and 'it's kind of nerve-racking… because I'm putting myself out there'. Blouse, lkbennett.com. Headscarf, mypashmina.co.uk\n\nIt's courageous of her to write in the way that she does about trauma and vulnerability. There's no doubt that the book will make an impact and that hopefully it will do exactly what she wants it to: enable young girls, like her nine-year-old daughter, to question the boxes society places them in and to dream bigger than the previous generation thought possible.\n\n'Even just little old five-foot me can make that difference, however small that is,' Nadiya says. 'So that's why when anyone asks me, 'What do you want to be doing in 20 years?' I say, I want to be doing this in 20 years! I don't want to fade away. I don't want them to think, 'Oh well, that's her 15 minutes of fame.' It's not about that. I want to be doing this because it just shows that we can be united and live as one – whatever religion, colour, race. It is possible.'\n\nDelivering this impassioned mini-speech, she sounds a lot more impressive than most of our elected representatives. Would she ever go into politics? 'The state it's in right now? Oh my God. My goodness… Um… Um… No.'\n\nI can't help but notice there was a hesitation before the no. I wouldn't bet against it. Besides, we could do a lot worse than Prime Minister Nadiya Hussain.", "description": "In a powerful and poignant interview with The Mail on Sunday's You magazine, the baker, 34, tells how the traumatic crime contributed to a suicide attempt at the age of ten.", "authors": ["Padraic Flanagan For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/21/19341658-0-image-a-32_1570305654737.jpg", "published_at": "2019-10-05"}