{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7574225/Bella-Hadid-declared-beautiful-woman-world.html", "downloaded_at": "2019-10-15 11:25:46.016165+00:00", "title": "Bella Hadid declared most beautiful woman in the world", "language": "en", "text": "Supermodel Bella Hadid has been declared the most beautiful woman in the world following science research into what constitutes the 'perfect face'.\n\nThe 23-year-old was found to be 94.35% 'accurate' to the Golden Ratio of Beauty Phi - which measure physical perfection.\n\nHer eyes, eyebrows, nose, lips, chin, jaw and facial shape were measured and came closest to the ancient Greeks' idea of perfection.\n\nAccording to science, supermodel Bella Hadid is the most beautiful woman in the world\n\nThe 23 year old topped the list compiled by Harley Street facial cosmetic surgeon Dr Julian De Silva\n\nSinger Beyoncé, 38, was second with 92.44%, actress Amber Heard, 33, was third with 91.85% and pop star Ariana Grande, 26, was fourth with 91.81%.\n\nKate Moss, 45, the highest rated Briton and in sixth place overall, had a reading of 91.05% - well ahead of her rival and the UK's other most successful supermodel, Cara Delevingne, 27, who was in tenth place with 89.99%.\n\nThe list was compiled using the latest computerised mapping techniques by Harley Street facial cosmetic surgeon Dr Julian De Silva, who utilises the technology in his work.\n\nThe ten most beautiful women in the world - and their Golden Ratio scores 1: Bella Hadid - 94.35 per cent 2: Beyoncé - 92.44 per cent 3: Amber Heard - 91.85 per cent 4: Ariana Grande - 91.81 per cent 5: Taylor Swift - 91.64 per cent 6: Kate Moss - 91.05 per cent 7: Scarlett Johansson - 90.91 per cent 8: Natalie Portman - 90.51 per cent 9: Katy Perry - 90.08 per cent 10: Cara Delevingne - 89.99 per cent\n\nDr De Silva, who runs the Centre For Advanced Facial Cosmetic And Plastic Surgery, in London, said: 'Bella Hadid was the clear winner when all elements of the face were measured for physical perfection.\n\n'She had the highest overall reading for her chin which, with a score of 99.7%, is only 0.3% away from being the perfect shape. Bella also came second behind Scarlett Johansson for the positioning of her eyes.\n\n'Beyoncé ran her a close second, scoring the highest marks for the shape of her face (99.6%) and getting very high scores for her eyes, brow area and lips.\n\n'These brand new computer mapping techniques allow us to solve some of the mysteries of what it is that makes someone physically beautiful and the technology is useful when planning patients' surgery.'\n\nThe Golden Ratio was a mathematical equation devised by the Greeks in an attempt to measure beauty.\n\nWomen with the most beautiful features Dr Julian De Silva pinpointed which stars had the most beautiful nose, eyes, eyebrows, chin, lips, forehead and face shape Nose - Amber Heard 99.7 per cent Eyes - Scarlett Johansson 99.9 per cent Lips - Cara Delevingne 98.5 per cent Eyebrows - Cara Delevingne 94 per cent Chin - Bella Hadid 99.7 per cent Forehead - Kate Moss 98.8 per cent Face shape - Beyoncé 99.6 per cent\n\nThe ratio can be applied to anything and was used by Leonardo Da Vinci for the perfect human male body in his famous work, the Vitruvian Man. The premise behind this is that the closer the ratios of a face or body are to the number 1.618 (Phi), the more beautiful they become.\n\nBella Hadid, who began modelling when she was 16, has twice been voted Model of the Year.\n\nResearch by Dr Julian De Silva from The Centre For Advanced Facial Cosmetic & Plastic Surgery at 23 Harley Street.\n\nTop ten and Dr Julian De Silva explaining why stars are so beautiful and where they were marked down\n\n1. Bella Hadid - 94.35%\n\nDr De Silva said: 'Bella Hadid is a worthy winner with stunning facial symmetry and a chin only 0.3% away from perfection.\n\n'She also came second for her eye positioning. She is one of the new generation of supermodels and could dominate the profession for the next decade with her stunning looks. Her biggest weakness is in the brow area.'\n\n2. Beyoncé - 92.44%\n\nBeyonce came in second place as she scored highly on her forehead and brow area\n\n'Beyoncé looks incredible as she approaches her 40s. She had a new perfect score for her face shape, but was marked down for her eyebrows and chin,' the surgeon commented.\n\n3. Amber Heard - 91.85%\n\nThe shape of Amber's nose and chin secured her third place position in the list\n\n'Amber ranks so highly because of the wonderful shape of her nose and chin. She has an ageless beauty.\n\n'She would have been higher with a stronger face shape,' Dr De Silva shared.\n\n4. Ariana Grande - 91.81%\n\nPop star Ariana Grande has also been added in the list that was compiled by using the latest computerised mapping techniques\n\nDr De Silva said: 'It is great to see one of the new generation of pop stars make the list. Ariana scored highly for her forehead and chin. Marked down for her eyebrows and the larger than average gap between the top of her lips and her nose.'\n\n5. Taylor Swift - 91.64%\n\nTaylor's chin and lips scored highly. However, her eyebrows did not\n\n'Another star who has emerged in the last five years. She rates very highly for her chin and lips but was kept back by a low score for her eyebrows,' The Harley Street specialist said.\n\n6. Kate Moss - 91.05%\n\nAt number six is 45 year old British model Kate Moss who scored highly on her forehead and eyebrows\n\nOn the subject of Kate Moss, he commented: 'Kate is the highest rated Briton on the list and will be delighted that she is four places higher than our other supermodel, Cara Delevingne. Second highest marks for her eyebrows and one of the highest scores for her eye spacing, but let down by her chin.'\n\n7. Scarlett Johansson - 90.91%\n\nThe American actress scored a Golden Ratio rating of 90.91%\n\nDr De Silva said: 'She had the highest marks of all for the position of her eyes but was let down by her face shape and thin lips.'\n\n8. Natalie Portman - 90.51%\n\nAccording to Dr Julian De Silva, Natalie's brow area let her down and left her in eighth place as a result\n\n'Natalie has perfectly positioned eyes but was let down by a low score for her brow area,' the surgeon stated.\n\n9. Katy Perry - 90.08%\n\nTeenage Dream singer Katy Perry scored highly for the position of her nose\n\n'Katy scored very highly for nose but was let down by her chin,' Dr De Silva added of Perry.\n\n10. Cara Delevingne - 89.99%\n\nCara ended the top ten with a high rating for her lips and eyebrows\n\nDr De Silva said: 'Cara's unusually large forehead scored against her. She is famous for her very full eyebrows which are stunning and achieved top marks. Her lips are beautifully shaped and also came top.'", "description": "Model Bella Hadid, 23 was found to be 94.35% 'accurate' to the Golden Ratio of Beauty Phi - which measures physical perfection - in research by London plastic surgeon Dr Julian De Silva.", "authors": ["Deepika Rajani For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/10/19733128-0-image-a-7_1571131963617.jpg", "published_at": "2019-10-15"}