{"pub": "townhall", "url": "https://townhall.com/tipsheet/leahbarkoukis/2019/09/05/here-are-some-of-the-worst-things-dems-candidates-said-during-cnn-town-hall-n2552642", "downloaded_at": "2019-09-06 12:11:06.191586+00:00", "title": "Bernie Sanders Makes One of the Most 'Horrifying' Arguments During CNN Climate Town Hall", "language": "en", "text": "CNN hosted 10 town hall events with Democratic presidential candidates on the climate “crisis” Wednesday evening—a program that took place over seven hours, giving Republicans a treasure trove of material to use ahead of the 2020 election.\n\nPresident Trump’s re-election campaign already took advantage of the content and made some great videos of all the crazy things Democrats said during the program—from vowing to get rid of plastic straws, banning offshore drilling, and ending all fracking, to disincentivizing meat eating. But some Democrats, including Sen. Bernie Sanders, took the issue of population control to new levels.\n\nA member of the audience, Martha Readyoff, who was identified as a teacher, told Sanders the planet has experienced a doubling of human population growth in the last 50 years and this is unsustainable.\n\n“I realize this is a poisonous topic for politicians but it’s crucial to face,” she said. “Empowering women and educating everyone on the need to curb population growth seems a reasonable campaign to enact. Would you be courageous enough to discuss this issue and make it a key feature of a plan to address climate catastrophe?”\n\n\"The answer's yes,'\" Bernie answered. \"Women in the United States of Americas, by the way, have a right to control their own bodies and make reproductive decisions.\"\n\n\"And the Mexico City agreement — which denies American aid to those organizations around the world that allow women to have abortions or even get involved in birth control — to me is totally absurd,\" he continued. \"So, I think, especially in poor countries around the world where women do not necessarily want to have large numbers of babies and where they can have the opportunity through birth control to control the number of kids they have, it's something I very strongly support.\"\n\nThe response shook Twitter users.\n\nDemocrat Voter: There are too many humans on earth.\n\n\n\nBernie: I agree. We need to fund abortions to poor, third world countries.\n\n\n\nThis is absolutely horrifying. pic.twitter.com/B2SBT053mz — Benny (@bennyjohnson) September 5, 2019\n\nOh my goodness! Oh my goodness!!!\n\n\n\nAn American presidential candidate speaks about how important it is for America to fund the abortion in poor third world countries.\n\n\n\nI repeat, @BernieSanders wants America to fund the killing of Africa’s unborn babies!pic.twitter.com/7CBHS2nG09 — Obianuju Ekeocha (@obianuju) September 5, 2019\n\nLet’s just state for the record: talking about needing “population control” through ABORTION for the sake of CLIMATE is talking about EUGENICS. The fact that @BernieSanders is willing to entertain this vile idea is not only disgusting, it should be disqualifying. — S.E. Cupp (@secupp) September 5, 2019", "description": ".09/06/2019 8:11:08AM EST.", "authors": ["Leah Barkoukis", "Matt Vespa", "Timothy Meads"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/211/2bdddfc1-7b6f-4db5-915f-0a027ec5c8e3.png", "published_at": "2019-09-05"}