{"pub": "metro", "url": "https://metro.co.uk/2019/10/08/eastenders-spoilers-will-domestic-abuser-gray-atkins-hurt-his-and-chantelles-baby-10881421", "downloaded_at": "2019-10-09 00:26:22.151657+00:00", "title": "EastEnders spoilers: Will domestic abuser Gray hurt Chantelle's baby?", "language": "en", "text": "Gray Atkins (Toby Alexander-Smith) has been physically abusing wife Chantelle (Jessica Plummer) in EastEnders, and tonight his aggression got the better of him once more, as he threatened to hit her again — thus putting their unborn baby at risk.\n\nWith Bailey (Kara-Leah Fernandes) having overheard Karen’s (Lorraine Stanley) conversation with Mitch (Roger Griffiths) — a conversation in which Karen revealed that she knew Dinah was going to take her own life — the young girl went missing during tonight’s episode. After the Taylors searched high and low, Tiffany (Maisie Smith) located Bailey, and brought her round to Chantelle and Gray’s house.\n\nKeegan (Zack Morris) knew something was up due to the way Bailey was acting round Karen, so he demanded answers — but Karen felt unable to provide them. Spying an opportunity to cause some trouble, Gray decided to spill the beans, thus revealing that Karen knew of Dinah’s plans.\n\nAdvertisement\n\nAdvertisement\n\nChantelle was understandably upset with her husband, and told him that it wasn’t his place to reveal such information. Fuming, Gray made a beeline for his wife, but she pleaded with him to stop — reminding him about her pregnancy.\n\nAn angry Gray punched the nearby worktop, before revealing his devastation at the fact that Chantelle thought him capable of hurting their unborn child. He stormed out, leaving Chantelle to ponder over what had just happened.\n\nGray might be attempting to get his anger under control, but that doesn’t change the fact that he almost hurt Chantelle again. His actions in this episode also beg the question of what would’ve happened had Chantelle not reminded him about the child?\n\nIf his anger gets the better off him again, could he end up hurting their unborn baby?\n\nEastEnders continues on Thursday 10th October at 7:30pm on BBC One.\n\nAdvertisement Advertisement", "description": "Gray's anger is out of control.", "authors": ["Stephen Patterson"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/Gray-Chantelle-EastEnders-1567_1570550243.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-08"}