{"pub": "dailymail", "url": "https://dailymail.co.uk/debate/article-2195168/Patients-missing-appointments--maybe-needed-them.html", "downloaded_at": "2019-10-05 06:28:22.385537+00:00", "title": "Patients missing appointments - maybe they never needed them?", "language": "en", "text": "Patients missing appointments - maybe they never needed them?\n\nIf someone doesn’t turn up for an appointment there are only a few possible reasons: they died; they forgot; transport failure or they didn’t need the appointment in the first place.\n\n\n\nThe figures for the number of people not turning up for NHS appointments were revealed over the bank holiday weekend – one in ten people don’t attend an appointment totaling 5.5m missed appointments in the last year. This includes appointments people have made for themselves.\n\n\n\nBBC local radio also covered yesterday the forthcoming 2020health report on how few people are being given electronic access to their health records (one in 100), despite the evidence showing that patients who take up the service usually have better health.\n\n1 in 10 fail to turn up for doctor appointments, but did they need them in the first place?\n\nThe common theme here is that NHS remains far too paternalistic, with doctors making many decisions without involving the patient and still regarding intimate details about an individual’s life history (i.e. the patient’s notes) as belonging to the state.\n\n\n\nLegally notes do still belong to the NHS, but despite the fact we have had the right to see our records for a couple of decades, many professionals still view us as passive recipients of care instead of active participants who should be involved in planning and management.\n\n\n\nThis includes whether we really want an appointment, or just a quick call for reassurance or leaving it to us to decide. I recently sat by a doctor’s desk in a large London teaching hospital as he viewed his PC. He hadn’t looked up when I walked into the room; he’d spoken to either the notes or the screen, and it was only when I said “and I’d like a copy of my test results” that he looked at me. “Why would you want those?” he asked abruptly as if talking to an unreasonable child.\n\n\n\nPersonal electronic health records will go a long way to enabling us to take more responsibility for our healthcare. More information leads to greater understanding and awareness and can lead to improved health. The proliferation of health apps show that there is a real appetite for information and self-care.\n\n\n\nThe government should be falling over itself to encourage electronic access and approving apps as this will reduce the burden on the NHS and go some way to reducing the 40% (according to GPs) of unnecessary appointments, easing the difficulties experienced by some patients who have found it harder to get an appointment because of their local surgery reducing their opening hours.", "description": "JULIA MANNING: The figures for the number of people not turning up for NHS appointments were revealed over the bank holiday weekend – one in ten people don’t attend an appointment.", "authors": ["Julia Manning For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/i/pix/2012/08/29/article-2195168-14B8C03F000005DC-202_1024x618_large.jpg", "published_at": "2012-08-29"}