{"pub": "afr", "url": "https://afr.com/policy/energy-and-climate/more-power-and-less-carbon-is-the-future-20191011-p52zy9", "downloaded_at": "2019-10-11 08:14:25.916585+00:00", "title": "More power and less carbon is the future", "language": "en", "text": "Renewable energy is growing faster than any fuel source in world history, climbing at a pace literally off the graph scale compared with the penetration of coal and oil that powered the wonders of the first industrial revolution. But for the world to reach its Paris targets, explained BP’s group chief economist Spencer Dale at The Australian Financial Review National Energy Summit this week, it will have to get generating like Australians have been doing, where our rooftop solar panel fleet has increased by nearly a third in just the last 16 months. But even with the fastest forecast transition, renewables will still be only 30 per cent of the global energy mix in 2040. Oil and gas will still make up around half of the supply if energy use is to grow fast enough to keep shifting hundreds of millions more people into a better life.\n\nThe world needs to follow Australia's rooftop revolution. Glenn Hunt\n\nFossil fuels are not going out of business soon. That’s an important perspective when British activists want to get Mr Dale’s employer shunned, dumping it from sponsoring the Royal Shakespeare Company as if it peddled illegal guns. The Extinction Rebellion campaigners who lay down on the pavement outside the Summit venue enjoy the bounty of industrial capitalism, organising their protests by iPhone even while they propose transition to the Stone Age with zero net emissions by 2025. Their own anti-capitalism has never advanced human progress an iota outside of fanciful theories: capitalism getting its comeuppance through nature’s revenge would suit them nicely. Yet history says we will adapt rather than make ourselves extinct, and it will be driven by dollars-and-cents enterprise when we do.\n\nThe government’s political bottom line is no blackouts and lower prices.\n\nBut even grown-up politics in Australia is making a mess of the transition. EnergyAustralia boss Catherine Tanna told the Summit, without exaggeration, that the energy world is tribal and emotive. Alongside our 21 per cent penetration of unreliable renewables, a high 60 per cent of our electricity comes from coal, in part because we irrationally ban the nuclear power that many industrialised nations have embraced. For practical and ideological reasons, subsidies protect the fuel that each tribe favours. The Renewable Energy Target and big subsidies drove the fast uptake of renewables, but it has raced ahead of the firming power investment needed as back-up. That has caused big bills, and blackout risk. The government’s political bottom line is no blackouts and lower prices, and it has intervened with its own subsidies, direct investments, and \"big stick\" threats against power companies. That could include keeping coal power going when others think that ageing capacity is best removed. Labor just wants a RET that is bigger still, though even its tribal leaders are no longer sure about that.\n\nHowever, piling on subsidies to fix the damage of subsidies has caused not just political gridlock on energy, but investment gridlock too. Private capital can’t work when there is no non-tribal policy that goes beyond the next election. As Ms Tanna noted, the estimated $400 billion of investment needed to transform Australia’s energy industry is a lot of money to be attracted from a lot of investors if the burden is not to fall on taxpayers. They won’t come unless a decade of bunfights becomes an orderly transition.\n\nThe best circuit breaker is still an economy-wide carbon price, rather than competing subsidies which in the confusion they cause have the opposite effect of clear price signals. And there is everything to invest in. Gas is set to take coal’s place in the global fuel mix, even though Australians instead fight over whether our world-beating gas export industries should be curbed to prop up rent-seeking domestic industry. Yet natural gas could become the feedstock for a new \"blue\" hydrogen fuel industry. And gas is a far more promising candidate for carbon capture, storage, and use than coal. It could become part of the solution, not just part of the transition, BP’s Mr Dale suggests.\n\nAustralians who bought solar panels to rid themselves of electricity companies will be more electrified than ever in future as solar panels, batteries and smart meters turn their homes into power hubs. Already there are plans to re-regulate the grid to be more like a two-way platform for such a dispersed energy industry. Less carbon is going to mean more power. If only we could get the politics right.", "description": "There is everything to invest in with a big carbon challenge. If only we could drop the tribal politics.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_1.0347%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_95/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/8a29c2a764e9b7dfc0b0771a89161d054924a457", "published_at": "2019-10-11"}