{"pub": "yahoo", "url": "https://news.yahoo.com/julian-castro-questions-biden-memory-011413314.html", "downloaded_at": "2019-09-13 11:16:43.878720+00:00", "title": "Julián Castro Questions Biden’s Memory at Democratic Debate", "language": "en", "text": "Former Housing and Urban Development Secretary Julián Castro questioned former Vice President Joe Biden’s memory during a testy exchange at Thursday evening’s Democratic presidential debate.\n\nCastro and Biden were sparring over their respective health-care plans when the former said his would automatically enroll uninsured people in a Medicare-type program while Biden’s would require people to opt in.\n\n“They do not have to buy in,” Biden insisted.\n\n“You just said that two minutes ago. You just two minutes ago said they would have to buy in,” Castro shot back. “Are you forgetting what you said just two minutes ago?”\n\nBiden did not actually say people would have to opt in to his plan, as Castro claimed. In fact, he said the opposite.\n\n“Anyone who can’t afford it gets automatically enrolled in the Medicare-type option we have,” Biden said minutes before their exchange.\n\nWhat Castro may have been referring to is a separate comment Biden made, in which he said that anyone who loses his or her job can “automatically… buy into this.”\n\nThat line suggested that individuals would have to opt into a Medicare system. But what Biden was referencing was a situation in which someone’s private insurance coverage had come to an end, not that a universe of previously uninsured people would have to take a proactive step in order to enroll in Medicare-like coverage.\n\nCastro’s comments are nevertheless likely to feed lines of attack from Biden’s critics, chiefly those in President Trump’s re-election campaign, that Biden’s age is showing in his occasional gaffes, factual misstatements, and apparent memory lapses.\n\nWithin minutes of the initial comments, Trump allies had already pounced on the exchange late Thursday.\n\nWhile Castro later told reporters he “wasn’t taking a shot at his [Biden’s] age” and that his comments were “about the health-care policy” and not meant as an “attack” on Biden, fellow 2020 hopeful Cory Booker suggested Castro had good reason to question Biden’s memory.\n\n“There are moments where you listen to Joe Biden and you just wonder... I don't know,” he told reporters after the debate. “I think there were a lot of moments where a number of us were looking at the stage when he tends to go on sometimes. At one point he’s talking about people in communities like mine listening to record players…”\n\n“There’s a lot of people concerned about Joe Biden’s ability to carry the ball across the end line without fumbling. And Castro had really legitimate concerns about can he be someone in a long grueling campaign that he can get the ball over the line and has every right to call it out,” Booker said.\n\n\n\n\n\nRead more at The Daily Beast.\n\nGot a tip? Send it to The Daily Beast here\n\nGet our top stories in your inbox every day. Sign up now!\n\nDaily Beast Membership: Beast Inside goes deeper on the stories that matter to you. Learn more.", "description": "Photo Illustration by The Daily Beast/GettyFormer Housing and Urban Development Secretary Julián Castro questioned former Vice President Joe Biden’s memory during a testy exchange at Thursday evening’s Democratic presidential debate.Castro and Biden were sparring over their respective health-care plans", "authors": ["Lachlan.Markay Thedailybeast.Com", "Lachlan Markay"], "top_image": "https://s.yimg.com/uu/api/res/1.2/9YJEbt.qZpdULFL8qh76zw--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/ea527fe22785a79366548171fcc873e8", "published_at": "2019-09-13"}