{"pub": "cbc", "url": "https://cbc.ca/news/canada/british-columbia/td-bank-refuses-to-refund-art-student-600-in-fraudulent-cheques-1.5278144", "downloaded_at": "2019-09-13 00:57:25.649153+00:00", "published_at": "2019-09-12", "title": "TD Bank refuses to refund art student $600 in fraudulent cheques | CBC News", "language": "en", "text": "A Vancouver man is frustrated TD Canada Trust will not reimburse him for $600 in fraudulent cheques that were cashed on his bank account this summer.\n\nPreston Buffalo, a student at Emily Carr University of Art and Design, says he misplaced his chequebook but isn't sure exactly when or how.\n\nThe bank says Buffalo didn't exercise due diligence in protecting his chequebook and said it won't refund the money.\n\nBuffalo discovered the theft in late July when he returned from a visit with family in Edmonton.\n\nHe said six cheques, each for $100, and none of them written by Buffalo, were cashed between July 15 and July 27.\n\nThe transactions wiped out his savings account.\n\n\"In Vancouver, $600 is the difference between being homeless, or not, in a month. It's that tight,\" said Buffalo, 39.\n\nBuffalo lives on disability payments and is a mature student at Emily Carr. His First Nation in Alberta pays his tuition.\n\nTwo of six fraudulent cheques different signatures. (Submitted by Preston Buffalo)\n\nBuffalo immediately reported the discrepancy in his account to the downtown Vancouver branch of TD Canada Trust.\n\nHe says he and bank staff compared his signature cards on-file to signatures on the half dozen cheques.\n\n\"It was nothing like how I sign my name,\" said Buffalo.\n\nHe says bank staff told him \"clearly, this is not your signature.\"\n\nThe bank indicated the cheques had been deposited through an ATM. Buffalo understood that after the bank reviewed surveillance video, the footage would confirm that he was not the culprit depositing the cheques and he would get his money back.\n\n'No due diligence' says TD\n\nTD's fraud division, however, had a different opinion.\n\nAfter interviewing Buffalo and reviewing his case, it determined he didn't exercise \"due diligence\" in protecting his cheque book.\n\nHe was told his money would not be returned.\n\nIn June, Buffalo had moved from one Vancouver apartment to another.\n\nTD Canada Trust has Preston Buffalo's appeal under review but has given no timeline as to when there may be a resolution. (Maggie MacPherson/CBC)\n\nHe was about to pay his July rent at the new place when he realized he couldn't find his cheque book.\n\nBuffalo simply assumed it was in one of his unpacked boxes and he would look for it when he got back from his Alberta visit.\n\nIn the meantime, he paid his rent with a bank draft and went on vacation.\n\nBuffalo doesn't know what happened to his cheque book. He isn't sure if he left it at his old apartment or if he mistakenly threw it out, but somehow it fell into the wrong hands.\n\nBuffalo is appealing TD's ruling.\n\nTD: 'matter still active'\n\nIn an email, Ryan-Sang Lee, TD Canada Trust's manager of corporate and public affairs, said the matter is still active and the bank won't provide an official statement until \"the process plays out.\"\n\nIn a subsequent email, Lee said the bank is working with the customer to resolve the issue.\n\nLawyer Priyan Samarakoone, says there's no excuse for financial institutions to not verify all cheques no matter their amount. (Maggie MacPherson/CBC)\n\n'No excuse'\n\nMeanwhile, a civil litigation lawyer says the bank could have prevented the fraud.\n\nPriyan Samarakoone said most financial institutions only verify signatures on cheques deposited at automated teller machines over a certain value, and ones with lower amounts just pass through.\n\n\"The pressure needs to be on the big institutions to verify every single cheque that comes through,\" said Samarakoone.\n\n\"There's no excuse for banks to not verify all cheques.\"\n\nVerifying every cheque, he says, would protect consumers and banks.\n\nOne of the biggest issues for banks, he says, are people who wrongly claim they've been defrauded in an attempt to scam the bank.\n\nPolice investigation\n\nBuffalo has reported the incident to Vancouver police. He wants whoever took his money to be stopped — and feels the bank is not interested in doing the same.\n\n\"It seems easy for them to be — 'Nope, it was your fault. Stamp. Done. You're not getting your money,'\" said Buffalo.\n\nBuffalo said before his money disappeared it was the first time in years that he felt he had his head above water.\n\nNow, he's struggling again.\n\nUPDATE:\n\nOn Thursday, TD agreed to refund Buffalo for the loss. Buffalo says a TD representative called him after the story appeared to let him know he would be refunded in the next few days. He was reminded to be careful protecting his cheques in the future.\n\n\"I feel like I can breathe again\" said Buffalo. \"There are some expenses coming from school that now I have the money for.\"", "description": "A Vancouver man is frustrated TD Canada Trust will not reimburse him for $600 in cheques that were cashed on his bank account this summer.", "authors": ["Belle Puri Is A Veteran Journalist Who Has Won Awards For Her Reporting In A Variety Of Fields."], "top_image": "https://i.cbc.ca/1.5278590.1568158601!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/td-bank-refusal-to-reimburse-cheque-fraud.jpg"}