{"pub": "abcnews", "url": "https://abcnews.go.com/Health/connection-violent-video-games-racial-bias-school-shootings/story?id=65640371", "downloaded_at": "2019-09-17 23:24:03.757987+00:00", "title": "The connection between violent video games, racial bias and school shootings", "language": "en", "text": "When a school shooting hits the news, are we more likely to blame violent video games if the shooter is white?\n\nPoliticians, the media and even scholars often do.\n\nPresident Donald Trump previously stated, \"I'm hearing more and more people say the level of violence on video games is really shaping young people's thoughts,\" after the school shooting in Parkland, Florida.\n\nThere's little evidence showing a relationship between violent video games and school shootings, but video games are often blamed for overall violence in our communities. A recent study published in the Psychology of Popular Media Culture set out to find if we look for an external explanation for violence by whites more often than we do for African Americans.\n\n\"We try harder to make excuses for white perpetrators,\" said investigator Dr. James Ivory, a professor in the Department of Communications at Virginia Tech, in an interview with ABC News.\n\nThe investigators conducted a two-part study. The first study gave people a mock news story about a school shooting. When asked what caused the shooting, people were more likely to blame video games if the shooter was white than if the shooter was black. The second study looked at thousands of news articles -- video games were mentioned more often in stories of white shooters. Video games were discussed more often when the shooting happened in schools than in other settings.\n\nEthan Miller/Getty Images, FILE\n\n\"It’s a depressing finding,\" said Dr. Ivory. This study undoubtedly brings up a larger conversation on race.\n\n\"When you see people on television talking about video games and crime, it may say a lot more about other things and how we think about crime, than about video games.\" He added, \"We might be interested to look for reasons for white people because of racial stereotyping.\"\n\nThe study’s theory: Racial bias likely exists because of an assumed association between minorities and violent crimes, an assumption that isn’t there with whites. The study says, \"when such an act of violence is carried out by a racial minority, individuals may not feel compelled to seek an external explanation because the race of the perpetrator fits their stereotype of what a violent criminal looks like.\" The bias, they believe, is likely to have significant consequences, especially when assigning blame and responsibility to criminals of different races.\n\nFurther research is needed to determine specifically why this relationship exists and persists.\n\nTulsie N. Patel, MD is a Chief Resident in Psychiatry from the University of Texas Southwestern in Dallas, TX, working with the ABC News Medical Unit.", "description": "Further research is needed to determine specifically why this relationship exists and persists.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/video-game-gun-gty-jt-190917_hpMain_16x9_992.jpg", "published_at": "2019-09-17"}