{"pub": "reuters", "url": "https://ca.reuters.com/article/technologyNews/idCAKBN1WI2IQ-OCATC", "downloaded_at": "2019-10-03 23:31:59.807322+00:00", "published_at": "2019-10-03", "title": "Recovery beckons for Samsung as chip prices stabilize", "language": "en", "text": "SEOUL (Reuters) - Samsung Electronics Co Ltd (005930.KS) is likely to post a fourth consecutive quarter of declining profit when it reports preliminary earnings next week, though investors will be hoping the worst has passed with chip prices showing signs of recovery.\n\nFILE PHOTO: A visitor uses a mobile phone at the Samsung booth at the Mobile World Congress in Barcelona, Spain, February 26, 2019. REUTERS/Rafael Marchante/File Photo\n\nFalling semiconductor prices and the drawn-out U.S.-China trade war have bitten into profits at the world’s top memory chip and smartphone maker but analysts expect to see earnings growth next year as chip prices turn around.\n\n“The chip market is in the process of recovery as the inventory level is falling on the supply side,” said Avril Wu, an analyst at tech researcher TrendForce.\n\nPrices for DRAM chips, which help devices perform multiple tasks, are forecast to fall by a low-single digit percentage in the first quarter of 2020, compared to the 20%-25% drop during the same period this year, TrendForce says.\n\nSamsung is likely to flag a 60% decline in July-September operating profit to 7 trillion won ($5.8 billion) on Tuesday, according to Refinitiv SmartEstimate, based on estimates from 28 analysts.\n\nChips bring in over half of Samsung’s profit.\n\n“There’s growing anticipation about Samsung and the semiconductor market. It’s not so bad when you look at chip prices and demand,” said a Seoul-based fund manager who owns Samsung shares. He declined to be named as he was not authorized to speak to the media.\n\nWhile things are looking up for Samsung in terms of chip prices, analysts remain concerned about the impact of the U.S.-China trade war on major exporters like South Korea’s tech giants.\n\n“It is difficult to quantify the damage caused by the trade war, but certainly there has been conservative investment and spending by Samsung’s server and mobile chip clients due to the trade war,” Lee Su-bin, an analyst at Daishin Securities, said.\n\nU.S. chipmaker Micron Technology Inc (MU.O) gave a bleak profit outlook last week, citing economic and trade uncertainty.\n\nMOMENTUM BUILDING\n\nIn the mobile business, which accounted for about 24% of total operating profit in the second quarter, Samsung is benefiting from U.S. sanctions against Chinese smartphone and network equipment rival Huawei Technologies [HWT.UL].\n\nSamsung’s share of the European mobile market leapt to a five-year high of more than 40% in the second quarter, while Huawei’s slipped below 20%, according to data from research firm Canalys.\n\nShoppers will be leery of buying Huawei’s new flagship handset if the U.S. restrictions prevent it from carrying Google Mobile Services, analysts said.\n\nMeanwhile, Samsung’s newly launched Note series with fast 5G connection is out-selling its predecessors, market tracker Counterpoint Research said.\n\nSamsung has also released its first foldable smartphone in South Korea and United States, giving “good momentum” despite its small contribution to income, said Eo Kyu-jin, an analyst at DB Financial Investment.\n\nIn search of growth, Samsung is pouring resources into its telecom network equipment business just as Huawei is getting locked out of such contracts due to security concerns.\n\nSamsung said on Monday it had inked a deal to supply fifth-generation network equipment to Japan’s No.2 telco firm KDDI Corp (9433.T).", "description": "Samsung Electronics Co Ltd <005930.KS> is likely to post a fourth consecutive quarter of declining profit when it reports preliminary earnings next week, though investors will be hoping the worst has passed with chip prices showing signs of recovery.", "authors": ["Ju-Min Park", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191003&t=2&i=1436820235&w=1200&r=LYNXMPEF921WY-OCATC"}