{"pub": "yahoo", "url": "https://sports.yahoo.com/bears-going-trade-49ers-qb-014247768.html", "downloaded_at": "2019-10-29 14:03:51.898064+00:00", "title": "Are the Bears going to trade for 49ers QB C.J. Beathard?", "language": "en", "text": "The Chicago Bears have a quarterback problem. Whether the front office, coaching staff or fanbase wants to admit it, after 32 starts with Mitch Trubisky under center, there's less certainty about this team having a franchise passer than at anytime since before Jay Cutler arrived in 2009.\n\nAs a result, and with the NFL trade deadline looming this week, rumors about the Bears pursuing a Plan B at the position are swirling. And while most of those rumors will come from untrustworthy sources, one NFL insider can make the football world stop in a single tweet.\n\nESPN's Adam Schefter is the most tuned-in guy in the business, so when he suggests the Bears might be kicking the tires on a potential quarterback trade, it's time to really pay attention. In this case, while appearing on Kap and Company on ESPN 1000, Schefter suggested the Bears may tap into the 2017 talent pool to find at least competition for Trubisky down the stretch: 49ers backup, C.J. Beathard.\n\nScroll to continue with content Ad\n\n\"[If] somebody made them an offer for a late-round pick, they'd take it. Give them -- I'm making this up -- a sixth or a seventh ... yeah, they'd take that, I think. ... [For Chicago], that might be a guy that's worth bringing in for a seventh. Maybe you go trade Taylor Gabriel -- you know what, now that I think about it, how about Taylor Gabriel for C.J. Beathard?\n\n\"Quarterbacks are currency, so you can never go wrong with a quarterback. Kyle Shanahan knows how to use Taylor Gabriel as well as anything. They're winning, and Taylor Gabriel would be dangerous in that offense. Again, we're just spit-balling here. Who knows what the deal is. I'm sure that's probably not a trade that could happen.\"\n\nStory continues\n\nThis sounds like nothing more than speculation by Schefter at this point, but there's smoke beginning to rise from Halas Hall when it comes to Trubisky's future. If they're entertaining the possibility of a trade, it's because they've seen enough to know that they really don't know if he can play. And after 2.5 seasons and plenty of NFL reps, if Ryan Pace and Matt Nagy don't know by now, then there's a good chance Trubisky won't be in Chicago much longer.\n\nBeathard wouldn't exactly be the pedigree of player fans would like to see replace Trubisky, but he was a highly-regarded draft prospect in 2017 in a class that included Patrick Mahomes and DeShaun Watson at the top. Beathard was selected by the 49ers in the third round, and Oakland Raiders GM Mike Mayock, who was an NFL Network analyst at the time, had this to say about the former Iowa star:\n\n\"C.J. Beathard had mostly fifth-, sixth-round grades from the teams I spoke with. Obviously has great NFL lineage, the Beathard name famous for talent evaluation, and I thought his tape was down a little bit this year. I thought he was better as a junior. Very smart, understands where to go with the football, better arm than expected when you really sit down and study him. I haven't seen him live, and the people who went to his Pro Day told me he had an excellent day.\"\n\nBeathard has 10 career starts over the last 2.5 seasons. He's completed 57.3% of his passes for 2,682 yards, 12 touchdowns and 13 interceptions.\n\nNot exactly jaw-dropping numbers. Maybe a Beathard acquisition would be for no other reason than to create a competitive environment in training camp. Competition brings out the best in players, and right now Trubisky has none. A player like Beathard, who isn't a threat to his gig on paper, would at least represent a young arm with Day-2 draft pedigree who could give Nagy a reason to yank Trubisky if the former second overall pick continues to struggle.\n\nAt this point, something has to change. And if Trubisky doesn't have what it takes to give the Bears offense the kind of quarterbacking it so desperately needs, then even an underwhelming addition like Beathard would be a welcome sight for Bears fans.\n\nAre the Bears going to trade for 49ers QB C.J. Beathard? originally appeared on NBC Sports Chicago", "description": "Rumors are beginning to swirl around the Bears and their potential interest in trading for 49ers QB C.J. Beathard", "authors": ["Bryan Perez"], "top_image": "https://s.yimg.com/ny/api/res/1.2/2.4nj.1hhJ0.kT2OX98T8w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/D4hhRsCVXVkZgh_ORu5Q6w--~B/aD0yMzI1O3c9MzQ4NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/csnchicago.com/4947bb952d8735fa646f246f1fc504c8", "published_at": "2019-10-29"}