{"pub": "dailybeast", "url": "https://thedailybeast.com/the-surprising-ally-in-fighting-global-warming-the-pentagon", "downloaded_at": "2019-09-21 10:09:54.433861+00:00", "title": "The Surprising Ally in Fighting Global Warming", "language": "en", "text": "Shortly after assuming the presidency in 2017, Donald Trump rescinded Executive Order 13653, “Preparing the United States for the Impacts of Climate Change,” a measure that had been signed by President Barack Obama in late 2013. The Obama order, steeped in the science of climate change, instructed all federal agencies to identify global warming’s likely impacts on their future operations and to take such action as deemed necessary to “enhance climate preparedness and resilience.” In rescinding that order, Trump asserted that economic competitiveness—involving, among other things, the unbridled exploitation of America’s oil, coal, and natural gas reserves—outweighed environmental protection as a national priority. All federal agencies were instructed to abandon their efforts to enhance climate preparedness and to abolish any rules or regulations adopted in accordance with Executive Order 13653. Most government agencies, now headed by Trump appointees, heeded the president’s ruling. One major organization, however, carried on largely as before: the U.S. Department of Defense.\n\nIn accordance with the 2013 Obama directive, the Department of Defense (DoD) had taken significant steps to mitigate its contributions to global warming, such as installing solar panels on military installations and acquiring electric vehicles for its noncombat transport fleet. More important, the Pentagon leadership, in a January 2016 directive, had called on the military services to assess “the effects of climate change on the DoD mission” and act where necessary to overcome “any risks that develop as a result of climate change.” All those endeavors, presumably, were to be suspended following President Trump’s 2017 decree. But while discussion of climate change has indeed largely disappeared from the Pentagon’s public statements, its internal efforts to address the effects of global warming have not stopped. Instead, a close look at Pentagon reports and initiatives reveals that many senior officers are convinced that climate change is real, is accelerating, and has direct and deleterious implications for American national security.\n\nIn responding to this peril, the military leadership has not sought to position itself as a significant actor in the national debate over climate change. Well aware of the partisan nature of that debate and reluctant to become embroiled in domestic politics, senior officials have said relatively little about the causes of warming or other controversial issues. But for many officers, neither the dangers posed by global warming nor the imperative of addressing those threats have disappeared because a climate change skeptic had entered the White House. From their own experience, they know that many U.S. allies are experiencing severe drought and other harsh consequences of warming, exacerbating internal divisions and triggering violent conflict. They have watched as the military services have been called upon again and again to assist local U.S. authorities in coping with the aftereffects of exceptionally ferocious hurricanes, often mounting mammoth relief operations that lasted for many weeks or months. And they are keenly mindful of the fact that the military’s own bases are coming under mounting assault from rising seas, extreme storms, and raging wildfires.\n\nSenior U.S. military officials have, therefore, continued to identify warming as a significant threat to American national security, despite the official guidance from the White House. “When I look at climate change, it’s in the category of sources of conflict around the world and things we have to respond to,” said General Joseph F. Dunford Jr., Chairman of the Joint Chiefs of Staff, in November 2018. “Shortages of water, and those kinds of things . . . are all sources of conflict. So, it is very much something that we take into account in our planning as we anticipate when, where and how we may be engaged in the future and what capabilities we should have.”\n\nInstitutional Endangerment\n\nTo note that global warming poses a formidable threat to American national security is not to say that warming has necessarily been elevated above other perceived threats. In fact, the Department of Defense has made it clear that China and Russia constitute America’s principal security threats and will remain so for some time to come. Rather, top military officials perceive climate change as a secondary but insidious threat, capable of aggravating foreign conflicts, provoking regional instability, endangering American communities, and impairing the military’s own response capabilities. Worse yet, warming’s impacts are expected to grow increasingly severe, complicating the ability to address what it views as its more critical tasks. Ultimately, some officers fear, it could make fulfillment of those tasks nearly impossible.\n\nTo appreciate the military’s perspective on the climate change threat, it’s necessary to grasp something essential about the military leadership itself. Whatever else they may say, career officers will tell you that they’ve chosen a career in the military out of a deep belief in its overarching mission: to protect the homeland and defeat the nation’s enemies. To succeed at this mission, they will explain, the military must be constantly vigilant and prepared, fully capable at every moment of undertaking any task or operation assigned by the president. Fighting and winning wars is, of course, their ultimate duty; but short of actual combat, their principal responsibility is to ensure that America’s forces possess the capacity to win those wars. Accordingly, anything that detracts from that capacity represents, by definition, a threat to national security. And climate change, by undermining the military’s ability to fulfill its primary strategic responsibilities, is widely feared to constitute exactly that sort of peril.\n\n“ There is a direct clash between current White House doctrine on climate change and the Pentagon’s determination to overcome climate-related threats to military preparedness. ”\n\nSenior commanders are well aware that there is an intense national debate over climate change and that some politicians—including the president and most of his cabinet—doubt the reality or imminence of planetary warming. But they have also seen evidence of warming for themselves (especially if they’ve served in drought-stricken areas of the Middle East and Asia, as a significant majority of them have done), and know that scientific evidence overwhelmingly confirms the climate change prognosis. Even more important, military officers are practical people and careful managers of risk. While they can never know for sure when and where the next security threat will arise, they must prepare themselves for any plausible contingency, and devastating climate change forecasts fall in this category. Even if the science of global warming still has a margin of uncertainty, they will say, it is close enough to being certain that the armed services must account for it in their future planning and take whatever steps they can to mitigate its harmful consequences.\n\nThere is, therefore, a direct clash between current White House doctrine on climate change and the Pentagon’s determination to overcome climate-related threats to military preparedness. A vivid illustration of this ongoing confrontation comes from the DoD’s efforts to assess the danger that climate change poses to its domestic installations. Although many of America’s combat-ready forces are deployed in or near potential hotspots abroad, the Pentagon relies on stateside bases to train and supply those forward-deployed units—so any threat to the operational utility of domestic facilities would endanger critical military operations. Military bases are launch platforms, and you “can’t fight a war unless you’ve got a place to leave from,” said General Gerald Galloway, formerly a senior officer at the Army Corps of Engineers.\n\nIn 2015, after it became clear that rising seas would make many key coastal installations vulnerable to flooding and storm damage, Congress directed the Department of Defense to conduct a full-scale assessment of climate-related threats to all U.S. military bases. In response to that congressional directive, the DoD commenced a detailed survey of such risks to every one of its major facilities—a total of over thirty-five hundred installations. An interim report on that endeavor, “Climate-Related Risk to DoD Infrastructure: Initial Vulnerability Assessment Survey,” was released in January 2018. It indicated that of the thousands of bases and installations queried, over half reported exposure to at least one climate-related impact, and many tallied multiple effects. The greatest reported impact was from drought, with 782 facilities (22 percent of all U.S. bases) experiencing some drought conditions; in addition, 763 bases reported impacts from strong winds, 706 from severe flooding, and 210 from wildfires. These remarkable numbers seemed to astonish even the DoD personnel who drafted the report. “If extreme weather makes our critical facilities unusable or necessitates costly or manpower-intensive work-arounds,” they wrote, “that is an unacceptable impact.”\n\nThese findings attracted considerable press attention, both because of the magnitude of the dangers revealed and because of what seemed like a surprising willingness by the DoD to issue a report contrary to Trump administration views on global warming. But it soon became apparent that the survey was only released after Pentagon officials—presumably acting under pressure from the White House—scrubbed the report of numerous references to climate change and the melting of the Arctic ice cap. Following its release, the Washington Post obtained an earlier draft of the report, dating from 2016, and revealed that the draft version had referred to climate change twenty-three times, while the text released to the public in 2018 mentioned it only once; instead, it had substituted terms like extreme weather or simply change. Discussions of rising sea levels and the melting of Arctic sea ice were also removed from the public version of the interim report, further diminishing the overall impression of warming’s threat to U.S. military installations.\n\nThe Post’s disclosure of this crude attempt to alter the tone of the assessment survey sparked widespread outrage in Washington. In July 2018, forty-four members of Congress—including ten Republicans—wrote to Secretary of Defense Jim Mattis and insisted that the final survey report provide an accurate account of warming’s potential impacts, with “candid assessments” of base vulnerabilities. If White House officials had hoped to erase climate change from the discourse on military preparedness, they failed utterly. Instead, their efforts at censorship and the subsequent congressional outrage only increased public awareness, generating fresh coverage of the topic.\n\n“ 'We often don’t associate climate change with threats to America’s military, yet Hurricane Michael showed us how very real that threat is.' ” — Lieutenant General Norman Seip\n\nIndeed, when Hurricane Michael swept through the Florida Panhandle a few months later and inflicted catastrophic damage on Tyndall Air Force Base, observers were quick to make the link between climate change and the vulnerability of U.S. bases. Tyndall, home to some thirty-six hundred Air Force personnel and a large share of the nation’s super-sophisticated F-22 Raptor fighter planes—each costing some $339 million—sits on a narrow peninsula jutting out into the Gulf of Mexico, affording it little protection from high winds and surging seas.\n\n“We often don’t associate climate change with threats to America’s military, yet Hurricane Michael showed us how very real that threat is,” wrote Lieutenant General Norman Seip, former commander of the 12th Air Force, in an op-ed. The hurricane “caused hundreds of millions of dollars’ worth of damage to vital national security assets,” he pointed out. (The damage to Tyndall has since been estimated in the many billions of dollars, as discussed in chapter 7.) General Seip concluded his commentary with an observation that reflects the deep anxiety of many senior officers: “The damage to bases such as Tyndall may be catastrophic for the base itself, but it’s only the beginning. Storms will continue to become more extreme and impact the ability of our armed forces to fight and win our nation’s wars.” The implications of this, he said, are inescapable: “Assessing and addressing the threat of climate change is critical for the future viability of our force.”\n\nAs a result of continuing congressional pressure and the impact of disasters like that experienced at Tyndall, the issue of military base vulnerability has refused to go away. At the behest of Congress, the DoD was required to produce yet another assessment of the problem in 2019. Although still displaying the muted tone of the department’s 2018 report, the new version nevertheless revealed deep anxiety about the safety of key U.S. military installations. Regading the risk to coastal bases, for example, it warned that “sea level changes magnify the impacts of storm surge, and may eventually result in permanent inundation of property.” Drought, wildfires, and desertification were also identified as significantly threatening the future viability of critical facilities.\n\nA Unique And Essential Voice\n\nThe uproar over the base vulnerability survey is revealing in many ways. To begin with, the 2018 assessment itself—even when scrubbed of most references to climate change—provides a grim picture of warming’s mounting threats. Hundreds of key military installations, it shows, are imperiled by rising seas, high winds, and heavy flooding from extreme storm events, while hundreds more are at risk from drought and other climate effects. Even in its censored, toned-down version, the report still underscores the vulnerability of America’s military infrastructure to the severe effects of a warming planet.\n\nJust as significant, the episode demonstrates that despite the president’s attempts to purge all climate change considerations from the federal government, senior military officials remain profoundly concerned about the impacts of global warming. As the 2018 report itself suggests, the immobilization of American bases by severe climate effects would be an “unacceptable impact.” In accordance with this outlook, the military services are persevering with many of the initiatives undertaken in previous years to better prepare their forces and facilities for warming’s harsh effects. These endeavors may now be described as responses to “extreme weather” or some other such euphemism, but there is no disguising the fact that they’re intended to guard against the ravages of climate change.\n\nFor the rest of us, however, the most important takeaway from this episode may be that the senior military leadership has fashioned an independent assessment of climate change, one that diverges in significant respects from how climate change often gets discussed elsewhere. While climate skeptics still claim that warming is not occurring at all or will have only minimal effects, the base survey report unequivocally demonstrates that military senior officials agree that climate change is under way and is having significant impacts now. Many U.S. bases, they contend, are already at risk of recurring inundation from rising seas and extreme storm events. At the same time, in contrast to climate activists’ frequent focus on warming’s threat to the natural environment and endangered species, Pentagon analysts instead highlight its deleterious effects on vulnerable populations, fragile states, and brittle institutions around the world. They see climate change as ratcheting up global chaos, which in turn means a greater likelihood of U.S. involvement in ugly foreign wars. “Stresses such as water shortages and crop failures,” notes Rear Admiral David Titley, former chief oceanographer of the U.S. Navy, “can exacerbate or inflame existing tensions within or between states. These problems can lead to state failure, uncontrolled migration, and ungoverned spaces.”\n\nSuch comments by senior military leaders, both active-duty and retired, should be afforded close scrutiny by all of us. At stake is not just the “future viability” of America’s armed forces—though that is obviously a matter of serious national concern. Rather, what these officers have to say about warming’s effects on the military also tells us a lot about what we can expect for our own country and the world at large.\n\nConsider, for example, the climate-related threats to military installations—the material infrastructure of bases, ports, radars, power plants, communications towers, and supply systems that enable American troops to assemble, train, deploy, and fight as needed. Those military systems are identical in many ways to the fundamental elements of civilian infrastructure needed by any modern industrial society—and, in many cases, are interspersed with their civilian equivalents in numerous communities across the country. It follows that if the armed services are worried about the safety and survival of their vital systems, we should be equally worried about the dangers to ours.\n\nThe Pentagon’s ill-fated base survey released in January 2018 provides useful instruction in this regard. Attached to the report are several maps of the United States identifying the bases that have reported problems from heavy flooding, extreme temperatures, prolonged drought, and other climate impacts. These maps are covered with hundreds of dots—each representing an affected base—scattered from one end of the country to the other, with heavy concentrations along the Atlantic, Pacific, and Gulf coasts (reflecting, in part, the siting of numerous naval facilities there). Although the distribution of those endangered facilities does not coincide exactly with the largest concentrations of the nation’s civilian population, it is close enough to indicate that a large percentage of Americans—including the residents of Los Angeles, San Francisco, San Diego, New York City, Boston, Philadelphia, Miami, and Washington, D.C.—live in close proximity to a military facility that can expect to suffer from the severe effects of climate change. If the armed services worry about the future survival of those installations, should we not be worrying about the fate of all the cities, towns, and suburbs located in the same general area?\n\n“ The picture that emerges from absorbing the military’s analysis of climate change is of a future in which global warming wreaks havoc across the planet. ”\n\nAnd while our concerns, understandably, are often focused on the severe effects that climate change will have at home, we dare not ignore what the military has to say about warming’s impacts on foreign nations that already suffer from resource scarcities and so are especially vulnerable to its harsh effects. As global temperatures rise, Pentagon analysts believe, those nations are likely to come under increasing pressure, with the weakest among them falling prey to civil unrest, ethnic strife, and state collapse. The most immediate consequence of such failures, those analysts contend, will be an increased call on U.S. forces to provide humanitarian aid and security services, often in the form of what are termed “stability operations.” But other repercussions, as Admiral Titley suggests, could include widespread chaos, mass migrations, and increased terrorist activity— all of which would inevitably affect the United States itself.\n\nIndeed, the picture that emerges from absorbing the military’s analysis of climate change is of a future in which global warming wreaks havoc across the planet, producing multiple disasters simultaneously and jeopardizing the survival of weak and resource-deprived states everywhere. If the Pentagon itself dreads a troubled, chaotic world like this—even if solely out of its own institutional concern about military “overstretch”—all the rest of us should be at least as alarmed. A world of multiple failed states, vast “ungoverned spaces,” and recurring mass migrations would pose mammoth challenges for the United States, no matter how hard we try to avert our eyes from the chaos. The collapse of economic and governmental institutions in numerous areas of the globe would disrupt vital trading networks and help foster deadly pandemics. In the worst-case scenarios, the major powers will fight over water and other vital resources, producing new global rifts and potentially involving the United States in full-scale wars with nuclear-armed belligerents.\n\nSenior officials at the Department of Defense and the American intelligence community have peered into the future and seen this world. They have mapped out its basic parameters and calculated its likely effects. And their prognosis is grim: Unless we act now to halt planetary warming and fortify our society against those climate effects that are already unavoidable, the American military will lose its capacity to defend the nation from multiple foreign perils while the homeland itself will be ravaged by storms, floods, droughts, fires, and epidemics.\n\nFrom the forthcoming book All Hell Breaking Loose: The Pentagon's Perspective on Climate Change by Michael Klare. Copyright © 2019 by Michael Klare. Reprinted by permission of Henry Holt and Company.", "description": "To plan for future conflicts, the Pentagon says climate change must be considered as a factor. Anything less is irresponsible.", "authors": ["Michael T. Klare"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1569039453/190920-climate-pentagon-tease_fmfe13", "published_at": "2019-09-21"}