{"pub": "usatoday", "url": "https://usatoday.com/story/tech/2019/09/30/apples-upcoming-macos-software-update-shines-light-catalina-island/2423423001", "downloaded_at": "2019-10-05 13:58:03.495390+00:00", "title": "California island Catalina gets its closeup with new macOS", "language": "en", "text": "CLOSE\n\nAVALON, Calif. – They don't sell computers on Catalina island, Windows or Macintosh.\n\nSame for new smartphones. Speaking of phones, connectivity can be really spotty in this small city of 4,400. When it comes to exploring the other sides of the island, you can forget it. You're off the grid whether you like it or not.\n\nBut the island is about to get its place in the tech sun, as the poster child for one year in the new Apple computer operating system update, called macOS Catalina, and residents are thrilled.\n\nApple historically updates its software each year with the name of a different California landmark. Past releases included Yosemite and the park's El Capitan; the current release is called Mojave, after the Mojave desert. Apple plans to release new edition in October.\n\nHalli Hermansen, a clerk at the Hotel Atwater in Avalon, Calif., displays her Apple Watch. (Photo: Jefferson Graham)\n\nWith Mojave, \"I see that photo every day on my desktop,\" says Randy Herrel, the CEO of the Catalina Island Co., which owns many of the hotels and restaurants in Avalon For the Catalina software update, scheduled for early October, \"we're going to have a lot more visibility.\"\n\nIt's already begun to happen.\n\nAfter the initial announcement by Apple of the name selection in June, \"website traffic doubled overnight,\" says Tony Budrovich, CEO of the Catalina Island Conservancy, which manages the majority of the island.\n\nSome 1 million passengers sail over on the Catalina Express boat each year to visit the island, but with yearly sales of nearly 20 million new Macintosh computers, \"we'd all love to see a 5 percent or 10 percent bump,\" in business, says Greg Bombard, the president of the Express. \"But it's hard to say. We're just happy for the exposure.\"\n\nThe historic Avalon Casino in Catalina Island (Photo: Jefferson Graham)\n\nFor most visitors, Avalon is known as this little city on an island, with bars and restaurants that dot coastal Crescent Avenue. The town's most dominant image is the historic round casino, built in 1929 by William Wrigley, who bought the island 100 years ago.\n\nThat Apple chose as its image for the software the mostly uninhabited west side of the island, and not Avalon, pleases Budrovich to no end.\n\n\"We've been encouraging people not to just think of Catalina as bars and beaches, but to enjoy some great hiking, biking and bird watching,\" he says.\n\nThe uninhabited western side of Catalina island (Photo: Jefferson Graham)\n\nLike many on the island we spoke to, he's a huge fan of Apple products.\n\nConrado Vega, who runs an ice cream shop and golf cart rental firm, says he uses a Macintosh computer – but only at home. \"We got used to Windows at work,\" he says.\n\nApple's screensaver of Catalina Island on the new Mac OS Catalina operating system for Macs (Photo: Apple)\n\nOn our visit, anecdotally, we saw way more folks in town sporting iPhones than any other phone.\n\nMany Mac fans covet the new wallpapers every year when they come out. There's even an archive online, compiled by a Moscow-based Apple fan.\n\nThe macOS Catalina software update, which is free, is set to be a big release. The venerable iTunes software will be split into three different programs for movies, music and podcasts, and Apple will use the iPad as a second display for your desktop or laptop with the release.\n\nFollow USA TODAY's Jefferson Graham (@jeffersongraham) on Twitter, Instagram and YouTube.\n\nRead or Share this story: https://www.usatoday.com/story/tech/2019/09/30/apples-upcoming-macos-software-update-shines-light-catalina-island/2423423001/", "description": "The island historically had poor connectivity, and residents who needed repairs had to go to the mainland for service. Now it's rare to see residents without a phone.", "authors": ["Jefferson Graham", "Published A.M. Et Sept."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/23/USAT/ffb55f85-0435-45bf-a7d0-6676cb7bd987-Google_ChromeScreenSnapz569.jpg?crop=2401,1351,x132,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-09-30"}