{"pub": "townhall", "url": "https://townhall.com/columnists/kenblackwell/2019/10/03/trumps-ecigarette-flavor-ban-a-big-step-in-the-right-direction-n2554057", "downloaded_at": "2019-10-03 07:18:34.066425+00:00", "published_at": "2019-10-03", "title": "Trump’s E-Cigarette Flavor Ban: A Big Step in The Right Direction", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nWhile I am generally suspicious of the heavy hand of government, my take on the vaping crisis is evolving and I will attempt to explain.\n\nThe No. 1 cause of preventable deaths in America continues to be smoking. Every year, more than half a million Americans tragically die due to smoking-related causes, which results in hundreds of billions in healthcare costs and productivity losses. Sadly, these deaths are involving too many young adults and minority groups who have been falling victim to nicotine addiction.\n\nThis month, President Donald Trump commendably made a step in the right direction, when he announced his administration will move to ban flavored e-cigarettes, a move made in response to their deceptive marketing and the public health risk they have created.\n\nWhile e-cigarettes do share a great deal of the blame for the recent public health crisis, they should not shoulder all of it. President Trump did the right thing by banning flavored e-cigarettes; however, the ban does not address the whole problem. The administration should also consider a ban on menthol cigarettes, as they are equally as dangerous and destructive, especially for both African Americans and teenagers.\n\nThough not a new conversation, the topic of menthol cigarettes is one that is past due to be revisited. Last year, in November 2018, the FDA announced a proposal to ban to sale of menthol cigarettes. However, in the flurry of the flavored e-cigarette conversation, this proposal has sadly fallen to the wayside.\n\nAs we study the effects these toxic devices have on our kids, it’s time we pick back up the menthol cigarette ban conversation, in order to safeguard minority populations who continue to unjustly suffer from the deadly effects of menthol cigarettes.\n\nUnfortunately, throughout history, menthol has proven to be the most popular choice among youth and African Americans. Almost 9 in 10 African-American smokers use menthol cigarettes, and according to the Centers for Disease Control, African American smokers are significantly less likely to be successful in quitting smoking.\n\nSadly, the epidemic among these populations is not surprising. In fact, it was intentionally created by tobacco companies, who have notoriously spent decades marketing these cigarettes to both racial minorities and youth.\n\nAlso, it is not just African Americans who struggle with quitting menthol cigarettes; according to studies done by the Tobacco Products Scientific Advisory Committee, menthol increases smoking initiation and makes it more difficult to quit.\n\nThese studies and their history beg the question - if menthol cigarettes are equally, if not more, addictive and dangerous for people as other cigarette products, then why are we treating them any differently in our laws?\n\nThank you, President Trump, for taking action that will keep flavored e-cigarettes out of the hands of children and our most vulnerable communities. This is a strong step in combatting the nicotine epidemic that continues to plague our country.\n\nHowever, as you move forward with this ban, please consider taking another look at menthol cigarettes, another powerful and silent killer of youth and minority communities.", "description": "While I am generally suspicious of the heavy hand of .10/03/2019 3:18:37AM EST.", "authors": ["Ken Blackwell", "Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2016/125/72e804fa-867e-45ec-bfdc-2632cb14f93b.jpg"}