{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/unai-emery-should-recite-jose-20490275", "downloaded_at": "2019-10-06 05:34:05.535995+00:00", "title": "Unai Emery should recite Jose Mourinho criticism to revitalise Mesut Ozil and Arsenal", "language": "en", "text": "Get the biggest Arsenal FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAnyone else looking forward to the next high-pressing, high-mileage, all-action, distance-covering, box-to-box, tactical-fouling, football player?\n\nPuts his foot in, does a shift, registers a half marathon or something on his stats.\n\nIf you are, don’t worry. Below the duopoly at the top, the Premier League is absolutely rammed with them. There will be plenty more to come.\n\n“The world needs ditch diggers,” was a line from the movie Caddyshack. The Premier League has more ditch diggers than it could throw a shovel at.\n\nAnd, it seems, it is why we all love it. You’ve got to earn the right to play, and so on.\n\nWhich is why a player such as Mesut Ozil is easily ridiculed.\n\n(Image: CameraSport via Getty Images)\n\nA World Cup winner, a five-times German Player of the Year, he has long been an identikit scapegoat.\n\nForeign, for a start, with that forlorn look when some rough sort has just dispossessed him.\n\nAnd then there are the sloping shoulders, the body language that seems to offend so many. Including Unai Emery, it seems, who sees so little from Ozil on the training ground that he declared the German undeserving of a place in the 18-man squad for the Europa League game against Standard Liege.\n\nOzil turns 31 in just over a week’s time and should be in his prime. He is also on £350,000 a week until the summer of 2021.\n\n(Image: REUTERS)\n\nAnd if he is not trying on the training ground, it is unforgivable. Yet he remains one of the most talented footballers, not just at Arsenal, but in the Premier League.\n\nBut for once, Emery was clear, concise and comprehensible when explaining Ozil’s absence from the Europa League win.\n\n“It’s because other players deserve it more,” he said. That is as damning as Emery gets.\n\nWhen he took over, Emery did appear to make a serious effort to have Ozil as some sort of fulcrum to his team but that idea has long disappeared.\n\n(Image: Getty)\n\nEven though this is an Arsenal side crying out for extra creativity in midfield, Ozil is ostracised. If Ozil ever wants testimonies, he can ask Arsene Wenger and Jose Mourinho, two different coaches but twinned in their admiration for the player.\n\nMourinho wrote the foreword to Ozil’s autobiography and one of the Portuguese’s half-time talks while the pair were at Real Madrid together is a highlight of the book.\n\nThis is what Mourinho said to Ozil.\n\n“You think two beautiful passes are enough? You think you’re so good that 50 percent is enough? What do you want? To creep under the beautiful, warm shower? Shampoo your hair? To be alone?\n\n“Or do you want to prove to your fellow players, the fans out there, and me, what you can do?”\n\nPerhaps, as a last throw of the dice, Emery should recite that final, stinging question.\n\nBecause for all his sloping shoulders, forlorn looks and insulting body language, Arsenal are a poorer team and the Premier League a poorer place without an Ozil at his finest.", "description": "Arsenal are a poorer team and the Premier League a poorer place without Mesut Ozil at his finest", "authors": ["Andy Dunn", "Image", "Camerasport Via Getty Images", "Reuters", "Getty"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20467128.ece/ALTERNATES/s1200/0_Premier-League-Watford-v-Arsenal.jpg", "published_at": "2019-10-06"}