{"pub": "dailymail", "url": "https://dailymail.co.uk/travel/travel_news/article-7472409/British-YouTube-star-Simon-Wilson-visits-Seven-Wonders-World-seven-days.html", "downloaded_at": "2019-10-05 08:30:31.729472+00:00", "title": "British YouTube star Simon Wilson visits Seven Wonders of the World - in seven days", "language": "en", "text": "Advertisement\n\nA British traveller has sated his wonder-lust – by seeing Seven Wonders of the World in seven days.\n\nAt a total cost of around £6,000, YouTube star Simon Wilson jetted to the Colosseum in Rome, the Great Pyramid of Giza, Petra in Jordan, the Christ the Redeemer statue in Rio de Janeiro, Chichén Itzá in Mexico, the Great Wall of China and the Taj Mahal in India in six days, nine hours and three minutes.\n\nThat’s five continents in the space of a week. Simon told MailOnline Travel that it was 'just something I wanted to do' and that at the end he felt 'absolutely exhausted'. He said: 'I didn’t have any proper sleep for a week and ate only airplane in-flight meals.'\n\nYouTube star Simon Wilson jetted to the Colosseum in Rome, the Great Pyramid of Giza, Petra in Jordan, the Christ the Redeemer statue in Rio de Janeiro, Chichén Itzá in Mexico, the Great Wall of China and the Taj Mahal in India in six days, nine hours and three minutes\n\nSimon told MailOnline Travel that at the end he felt 'absolutely exhausted'. He said: 'I didn’t have any proper sleep for a week and ate only airplane in-flight meals.' Here he is at the Colosseum\n\nHere's Simon at the pyramids in Egypt. He spent just five hours in a hotel before visiting the site\n\nSimon, from Wrexham, who has a huge online following, took one backpack containing his camera equipment and 'a few boxers and a couple of T-shirts'.\n\nHe began his epic journey on Sunday, July 28, with a 4.45am flight from Manchester Airport to Rome to see the Colosseum, which dates to 70AD.\n\nBut he didn’t have much time to admire it – just two hours.\n\nThen he zipped off to Egypt to take in the pyramids.\n\nAgain, no time to linger – he spent just five hours in a hotel before gawping at the epic structures.\n\nSimon said that Petra was his favourite, partly because he had a great night's sleep in a cave\n\nThe heat at the Taj Mahal was stifling. Simon said: 'I've been to many hot countries in summer but I’ve never felt heat like that. I was drenched in an hour. It made me feel ill'\n\nSimon reached the Great Wall on day five. Needless to say, he wasn't able to linger at any of the sights he visited\n\nThe Mayan city of Chichén Itzá in Mexico was Simon's penultimate seventh wonder\n\nMission possible: Simon at the Christ the Redeemer statue in Rio de Janeiro on day seven\n\nSIMON'S WONDER-FUL ITINERARY Day 1 Manchester to Rome - 1,300 miles. Day 2 Rome to Egypt - 1,468 miles. Day 3 Egypt to Jordan - 470 miles. Day 4 Jordan to the Taj Mahal - 2,500 miles. Day 5 Delhi to the Great Wall - 2,270 miles. Day 6 Beijing to Chichén Itzá - 9,340 miles. Day 7 To the Christ the Redeemer statue - 3,900 miles. Then home to Manchester - 9,300 miles. Total cost: £6,000.\n\nNext up? Jordan and the jaw-dropping archaeological site of Petra, which was built around 300 BC.\n\nYou may know it from Indiana Jones and the Last Crusade.\n\nHis accommodation in Jordan was extremely basic – a £41-a-night cave.\n\nSimon said: 'Petra was my favourite. It was a special place plus I had the best night's sleep ever in that cave.'\n\nThe Taj Mahal in India, the world’s most famous mausoleum, was next on his itinerary. To reach it, on day four of his odyssey, he needed to take two flights – then endure a four-hour cab ride.\n\nThe heat at the site was intense – a stifling 42 centigrade, according to The Sun.\n\nSimon said: 'I’ve been to many hot countries in summer but I’ve never felt heat like that. I was drenched in an hour. It made me feel ill.'\n\nIt took workers around 20 years to complete the incredible building.\n\nSimon spent just 60 minutes there.\n\nThree more wonders to go and the clock was ticking.\n\nThe hardy adventurer ticked off the Great Wall of China next, after a flight to Beijing and a £125 return cab ride, then the Mayan city of Chichén Itzá in Mexico, and finally, at 1.48pm on the Saturday after he left Manchester, the statue of Christ the Redeemer in Rio de Janeiro.\n\nPhew!\n\nHis final leg was a flight back to Manchester on Sunday, August 4.", "description": "Simon Wilson jetted to the Colosseum, the Pyramids, Petra, the Christ the Redeemer statue, Chichén Itzá, the Great Wall of China and the Taj Mahal in India in six days, nine hours and three minutes.", "authors": ["Ted Thornhill", "Mailonline Travel Editor"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/17/14/18578834-0-image-a-78_1568725235682.jpg", "published_at": "2019-09-17"}