{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/4/hello-again-now-with-miami-hill-set-to-face-hokies", "downloaded_at": "2019-10-04 16:59:08.341139+00:00", "title": "Hello, again: Now with Miami, Hill set to face Hokies", "language": "en", "text": "MIAMI GARDENS, Fla. (AP) - Miami defensive lineman Trevon Hill remembers the day he started seeing the Hurricanes in a different light.\n\nNov. 4, 2017. It was Virginia Tech at Miami, a prime-time showdown between a pair of ranked teams from the Atlantic Coast Conference. Hill played for the Hokies then, and the lasting memory he has from the Hurricanes’ 28-10 win was how the stadium reacted after each of Virginia Tech’s four turnovers.\n\n“The hype of the Turnover Chain,” Hill said. “I came here and played at Hard Rock Stadium and noticed how loud it got when that chain came out. I’ve never been in a stadium besides (Virginia Tech’s) Lane Stadium that gets that loud. And that’s when I knew this place was someplace special.”\n\nHis career comes full circle on Saturday, when the Hurricanes (2-2, 0-1) take on the Hokies (2-2, 0-2) in what almost certainly amounts as a must-win game for either side’s hopes in the ACC Coastal race. Hill was dismissed from Virginia Tech’s team in September 2018, and now gets his chance to face the Hokies.\n\n“I’m a passionate player,” said Hill, who is playing his graduate senior season at Miami. “I love the game. The U in general is a passionate program with many great traditions and great players like Ray Lewis, Sean Taylor … this was the right decision for me.”\n\nHis new team could add to his old team’s woes.\n\nThe Hokies are desperate for a win and are coming off their worst loss in 12 years - a 35-point home loss to Duke, the biggest home defeat for Virginia Tech since 1974. And Hokies wide receiver Tre Turner had an Instagram post Thursday saying that Hendon Hooker will be taking over as the starting quarterback for Virginia Tech this week.\n\nHooker is in his third season at Virginia Tech. He’s thrown two passes, completing one. Almost all of his work, obviously, has come in practice.\n\n“He’s taken a whole bunch of reps in the last several years,” Virginia Tech coach Justin Fuente said.\n\nSaturday will mark the debut of Miami safety Bubba Bolden, a USC transfer who had to sit four games while waiting for the NCAA to declare him eligible.\n\nHere’s some of what to know going into Hokies-Hurricanes:\n\nBOWL STREAK\n\nThe first weekend of October is typically not the time to be talking bowl scenarios, but a loss here would be a massive problem for Virginia Tech - holders of the nation’s longest current bowl-appearance streak at 26 years and counting. The Hokies already have a win against FCS opponent Furman, so next week’s game with Rhode Island won’t help their bowl quest since only one win against the lower tier can count. That means the Hokies, who still face Notre Dame, North Carolina, Wake Forest, Georgia Tech, Pitt and Virginia after Miami have to win four of those games to be bowl-eligible. And they probably won’t be favored in most of those matchups.\n\nWINNING STREAK\n\nMiami has won the last two meetings with Virginia Tech. The last time the Hurricanes won three straight in the series was 2000 through 2002. And prior to that, the only other time Miami won three or more in a row against the Hokies was when it prevailed in the first 12 games of the series between 1953 and 1994.\n\nACCURACY STREAK\n\nMiami quarterback Jarren Williams has thrown 116 passes without an interception this season. Only five quarterbacks entering this weekend have attempted more throws without a pick, led by Alabama’s Tua Tagovailoa - 148 attempts, zero interceptions. Williams’ run of 119 passes (including three last season) is the longest without an interception by a Miami quarterback since Brad Kaaya wasn’t picked off on any of the final 135 throws of his Hurricanes’ career in 2016.\n\nVOTING STREAK\n\nVirginia Tech got some preseason votes this season in the AP Top 25, but has yet to be listed on any ballots during the regular season. If that doesn’t change, this will be the first time since 1992 that the Hokies have not gotten a single regular-season vote in the Top 25. They were unranked for the entirety of the 2015 season, but appeared on some ballots along the way that year.\n\nDEFENSE STREAK\n\nGoing back to last season, Miami has not allowed more than 12 points in any of its last three home games. That’s the longest such streak by the Hurricanes since an eight-game run spanning the 2000 and 2001 seasons.\n\n___\n\nMore AP college football: https://apnews.com/Collegefootball and https://twitter.com/AP_Top25\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Miami defensive lineman Trevon Hill remembers the day he started seeing the Hurricanes in a different light.", "authors": ["The Washington Times Http", "Tim Reynolds"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/04/cent_michigan_miami_football_06226_c0-229-5472-3419_s1770x1032.jpg?6f9ce78ee1a3a25672569ab4bf84dc3559d8855e", "published_at": "2019-10-04"}