{"pub": "breitbart", "url": "https://breitbart.com/news/nets-beat-lakers-to-bring-merciful-end-to-tense-china-tour", "downloaded_at": "2019-10-12 15:17:20.718275+00:00", "title": "Nets beat Lakers to bring merciful end to tense China tour", "language": "en", "text": "Shanghai (AFP) – The Brooklyn Nets defeated the Los Angeles Lakers 91-77 on Saturday to conclude a pre-season China tour that leaves behind big questions over the future of a key market worth billions of dollars to the NBA.\n\nThe two-game tour was thrown into disarray, with all public appearances cancelled other than the matches, after the league found itself at the centre of a raging US-China dispute over democracy and free speech.\n\nDespite the controversy, the teams have been embraced by Chinese fans at the first game on Thursday in Shanghai, also won by Brooklyn, and game two Saturday in the southern city of Shenzhen near Hong Kong.\n\nSpectators have shown up by the thousands in Lakers and Nets jerseys, but many also put Chinese flag stickers over their shirts’ NBA logo, or held small Chinese flags.\n\nThe controversy erupted when Houston Rockets general manager Daryl Morey posted a since-deleted tweet on October 4 in support of pro-democracy demonstrators in Hong Kong who say China is eroding its freedoms.\n\nChina portrays the protesters as violent separatists, and its state press and social media went ballistic over Morey’s comment, though a government effort to curb the vitriol now appears under way.\n\nBut the exhibition games were pulled from Chinese screens by official broadcast partners in protest, and the NBA’s Chinese sponsors have severed ties en masse.\n\nThe affair exposed the fine line toed by the NBA in China, where it has built a vast, lucrative fanbase in a country where free speech does not exist, while touting itself back home as a champion of progressive values like free expression.\n\nSecretary of State Mike Pompeo became the latest high-profile US politician to urge the NBA to place principle over profit and stand up to China, citing its mass detentions of Muslim ethnic Uighurs in its Xinjiang region.\n\n– Lose-lose? –\n\n“The pages of George Orwell’s ‘1984’ are coming to life there. I wish the NBA would acknowledge that,” Pompeo said during a speech in Nashville.\n\nNBA Commissioner Adam Silver further angered China by defending Morey’s right to speak out, but the NBA still pressed ahead with its tour, though in a stripped-down form with every scheduled media or public event cancelled.\n\nThe league said Friday it would be unfair to force the teams to field media questions in China on the “complicated and unprecedented situation.”\n\nThe NBA has run into what many other foreign businesses also have learned the hard way — Beijing demands they respect Chinese political sensibilities if they want access to its huge market.\n\n“But if you give in (to China) too much, you start to anger your core (US) demographic,” said Mark Dreyer, who runs the China Sports Insider website.\n\n“It’s almost a lose-lose for the NBA.”\n\nOn the court, the mood has been more positive, with fans wildly cheering the players, especially Lakers superstar LeBron James.\n\nShenzhen authorities issued a public notice banning provocative banners or gestures at the game.\n\nBut, as in Shanghai, some individuals in Shenzhen expressed their anger at the league.\n\nSome users posted pictures on Chinese social media burning their game tickets outside the venue Saturday, while others arrived in t-shirts bearing messages like “Hong Kong, Taiwan, and my soul belong to China.”\n\nThe NBA is expected to largely survive the crisis due to its dominant position as perhaps the most popular sports league in China, where giants billboards showing players like James and Golden State Warriors star Stephen Curry are common.\n\n“There are too many smart people on both sides who will find a way to move past this,” Dreyer said.", "description": "Shanghai (AFP) – The Brooklyn Nets defeated the Los Angeles Lakers 91-77 on Saturday to conclude a pre-season China tour that leaves behind big", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/12/b111e4_spectators-pre-season-game-los-angeles-lakers-brooklyn-nets-in-shenzhen-640x335.jpg", "published_at": "2019-10-12"}