{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/comedy-legend-les-dawson-making-20468979", "downloaded_at": "2019-10-05 22:58:26.646913+00:00", "title": "Comedy legend Les Dawson is making a comeback - 26 years after death", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLes Dawson is to make a ­comeback 26 years after his death.\n\nTwo plays written by the legendary comic are set to be staged for the first time.\n\nMillions of worldwide fans of Les’s deadpan humour will be delighted at the prospect of more.\n\nThe project is being engineered by his widow Tracy, 69.\n\nShe said: “Les wrote a lot of scripts before he died and there are two plays that still haven’t been used. One of them is a comedy.\n\n\"It’s set in a joke shop where they make silly wigs and stuff like that. I’ve read it and it’s very funny.\n\n(Image: Mirrorpix)\n\n\"The scripts are all about family.\n\n“We need to bring both plays up to date but the one-liners are all there. We’ve got some good ideas.”\n\n(Image: Manchester Evening News)\n\n(Image: Rex)\n\nTracy, who married the Blankety Blank game show host in 1989 after his first wife died, added: “I’ve been speaking to an agent about making it happen.\n\n“I want to do it while I’m alive. There’s loads to do. We need to get a producer and a director who will take it on.”\n\nTracy hopes their daughter Charlotte, 27, will star in one of the productions.\n\nThe mum said: “That would be wonderful. I would just love that so much.”\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nCharlotte, who was only eight months when Les died from a heart attack aged 62 in 1993, has followed in his footsteps by becoming a TV star.\n\nShe is now a presenter on MTV dating show Love Squad, which airs on Mondays at 8.30pm.", "description": "EXCLUSIVE: And daughter Charlotte could be set to play a starring role", "authors": ["Ed Gleave", "Image", "Mirrorpix", "Manchester Evening News", "Rex"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article6029026.ece/ALTERNATES/s1200/1_Les-Dawson.jpg", "published_at": "2019-10-05"}