{"pub": "nytimes", "url": "https://nytimes.com/2019/10/28/opinion/impeachment-trump.html", "downloaded_at": "2019-10-29 00:19:28.545701+00:00", "title": "Opinion | Impeachment Does Not ‘Overturn’ an Election", "language": "en", "text": "This arrangement meant, as was true after the election of 1796, that the vice president, and thus the president of the Senate, could easily be the president’s principal political rival. (Imagine if Hillary Clinton’s reward for losing the 2016 election was to serve as Mr. Trump’s vice president.) It also meant that, if every elector representing the party ultimately in the majority voted for both of the party’s candidates, there would be a tie no matter how large their relative majority was.\n\nThat’s what happened in 1800, when every Democratic-Republican elector cast their two electoral votes for the same two people — Vice President Jefferson and his putative running mate, Aaron Burr. Worse still, the Constitution provided that ties were to be broken by the previous (“lame duck”) House of Representatives — which, in February 1801, meant that the Federalists, who had just lost control of both the White House and both chambers of Congress in the 1800 elections, would nevertheless decide the nation’s fate. It took 36 contentious ballots in the House — and the growing threat of civil war — before the Federalists chose Jefferson, and a constitutional crisis was averted.\n\nCongress responded with the 12th Amendment, proposed in December 1803 and ratified by the states, by the standards of constitutional amendments, practically overnight . That provision gave us the presidential elections we have today, in which electors cast one vote apiece for president and vice president. And so long as the current two-party system prevails, the 12th Amendment thereby all but guarantees that an elected vice president will be, if not from the same party as the elected president, at least the nominee of the same party.\n\nEven after the 12th Amendment, there was still one scenario in which the impeachment and removal of the president would overturn the previous election — if the office of vice president was vacant. But that gap was closed with the 1967 ratification of the 25th Amendment, Section 2, which gives the president (with the consent of both chambers of Congress) the power to fill vice-presidential vacancies. That’s why, even if the House ultimately impeaches Mr. Trump and the Senate removes him, the result would simply be to elevate to the presidency Mr. Trump’s own handpicked running mate, Vice President Mike Pence — who could then nominate his own vice president under the 25th Amendment.\n\nAgainst that backdrop, it’s difficult to see how removing Mr. Trump would “overturn” the results of the election, since the same party that won would remain in control of the White House. But there’s a deeper and more important point here: The founders wrote the impeachment and removal power into the Constitution at a time when that wasn’t true — when there was no 12th Amendment, and so it was entirely possible that removing the president from office would hand power over to one of his rivals.", "description": "The founders were extremely clear about the importance of dealing with the abuse of executive power.", "authors": ["Stephen I. Vladeck"], "top_image": "https://static01.nyt.com/images/2019/10/28/opinion/28vladeck-2/28vladeck-2-facebookJumbo.jpg", "published_at": "2019-10-28"}