{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7499489/Jackdaws-learn-presence-nearby-dangerous-humans-birds.html", "downloaded_at": "2019-10-05 07:40:16.870990+00:00", "title": "Jackdaws learn about the presence of any nearby 'dangerous humans' from other birds", "language": "en", "text": "Jackdaws listen to one another to avoid any humans that may pose a risk to them, scientists have found,\n\nThey can recognise a potential human threat from the alarm calls of their fellow birds.\n\nA small study involving 34 jackdaw pairs suggests the birds use social learning to identify potentially dangerous humans.\n\nPrevious experiments have shown jackdaws can also recognise human faces.\n\nScroll down for video\n\nJackdaws listen to one another to avoid any humans that pose a risk to them, scientists have found, They can recognise a potential human threat from the alarm calls of their fellow birds (file)\n\nScientists from the University of Exeter played recordings of two types of jackdaw calls when an unknown person approached their nest.\n\nThese were either alarm or 'scold' calls, which the birds use to alert others to a potential threat, and contact calls, which are used in a range of different contexts.\n\nWHAT ARE JACKDAWS? They are a small, black crow with a distinctive silvery sheen to the back of their heads. They have striking pale eyes. The jackdaw call is a familiar hard 'tchack' from which it gets its name. It will commonly nest in chimneys, buildings, rock crevices and tree holes. Previous experiments have shown jackdaws can also recognise human faces. They are also coming to the rescue of British gardeners as they are an unexpected predator of box tree moths which strip hedges of their leaves and eat the wood.\n\nVictoria Lee, a PhD researcher at the University of Exeter's Centre for Ecology and Conservation - and lead study author, said: 'Jackdaw contact calls and alarm calls sound very different from each other, and previous research and our own observations demonstrate that these calls are used in different contexts and serve different functions.'\n\nWhen jackdaws saw the same person for the second time, the birds that had heard the alarm call the first time reacted defensively by returning more quickly to their nests.\n\nResults from the 102 trials carried out across three sites in Cornwall showed the birds from the scold call group returned to their nests more than twice as quickly (53 per cent on average) when seeing that human again.\n\nOn the other hand, the birds that heard contact calls took longer to return to their nest (63 per cent on average).\n\nA small study involving 34 jackdaw pairs suggests the birds use social learning to identify individual humans that pose a risk to them. Previous experiments have shown jackdaws can also recognise human faces (stock)\n\nThough jackdaws returned to their nests more quickly after seeing a human associated with scold calls, the researchers said the calls did not appear to influence how long birds took to enter their nest box or how long they spent inside.\n\n'One of the big challenges for a lot of animals is how to live alongside humans,' said lead author Victoria Lee, a PhD researcher at the Centre for Ecology and Conservation on Exeter's Penryn Campus in Cornwall.\n\n'People can provide some benefits, such as the food at bird feeders, but in some cases humans are also a threat.\n\n'Being able to discriminate between dangerous and harmless people is likely to be beneficial, and in this case we see jackdaws can learn to identify dangerous people without having had a bad experience themselves.'\n\nThe research is published in the journal the Royal Society Open Science.", "description": "Scientists from the University of Exeter played recordings of two types of jackdaw calls when an unknown person approached their nest.", "authors": ["Joe Pinkstone For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/24/16/18877560-0-image-a-51_1569339719457.jpg", "published_at": "2019-09-24"}