{"pub": "cnbc", "url": "https://cnbc.com/2019/10/28/european-markets-traders-await-key-brexit-and-fed-decisions.html", "downloaded_at": "2019-10-28 07:35:29.623169+00:00", "title": "European stocks seen mixed ahead of key Brexit decision", "language": "en", "text": "European stocks were set for a mixed open Monday as traders await a key decision from the European Union over the U.K.'s Brexit delay and look ahead to a meeting of the U.S. Federal Reserve later this week.\n\nThe FTSE 100 was seen around 10 points lower at 7,314, the DAX was set to climb around 9 points to 12,904 and the CAC 40 was expected to edge around 3 points higher to 5,725, according to IG data.\n\nEU leaders are widely expected to approve a three-month extension to the U.K.'s October 31 deadline for leaving the bloc, while British Prime Minister Boris Johnson on Sunday increased pressure on opposition leaders to hold an early general election in order to break the long-standing impasse in the U.K.'s Parliament over Brexit.\n\nGlobal markets received a boost on Friday after the Office of the U.S. Trade Representative said the U.S. and China were close to finalizing parts of phase one of a trade deal. Asian markets were buoyed by the news on Monday, led by a 1.46% jump for China's Shenzhen composite.\n\nTraders will also be anticipating Wednesday's meeting of the Federal Open Market Committee (FOMC), with an interest rate decision expected on Thursday following two successive rate cuts from the U.S. central bank.\n\nEarnings season remains in focus after Europe's largest lender HSBC reported an 18% drop in third-quarter pre-tax profits compared to the same period last year, while Dutch conglomerate Philips grew its third-quarter EBITDA (earnings before interest, tax, depreciation and amortization) to 583 million ($646.46 million) euros from 568 million euros a year ago.", "description": "European stocks were set for a mixed open Monday as traders await a key decision from the European Union over the U.K.'s Brexit delay and look ahead to a meeting of the U.S. Federal Reserve later this week.", "authors": ["Elliot Smith"], "top_image": "https://image.cnbcfm.com/api/v1/image/104536713-GettyImages-629299428.jpg?v=1532563819", "published_at": "2019-10-28"}