{"pub": "time", "url": "https://time.com/5694420/daniel-carney-sexual-assault-bridesmaid-wedding", "downloaded_at": "2019-10-07 19:44:47.040576+00:00", "title": "Police: Groom Sexually Assaulted Bridesmaid Before Wedding", "language": "en", "text": "A Pennsylvania man sexually assaulted a woman who was in his wife’s bridal party two days before his wedding, police say.\n\nDaniel J. Carney, 28, spent the afternoon of Aug. 30 with his wedding party rafting and paddling down the Delaware River near Stroudsburg, Pa., according to court documents. The woman who has accused Carney of assault told police the group had been drinking; she said she remembered being heavily intoxicated and unable to stand when the group arrived at Shawnee Inn and Golf Resort in Monroe County, Pa. She was told that Carney was asked to help her into the hotel.\n\nThe woman, who TIME is not identifying as the victim of an alleged crime, told police that she remembered being led away from the water but could not recall anything until she woke up in the Inn’s downstairs men’s locker room in extreme pain. She told police Carney was biting her breast and grabbing her head and body, according to court documents. The woman said she then blacked out and later woke up to find her Carney on top of her, with her legs pushed back and bathing suit bottoms removed.\n\nA representative for the Shawnee Inn tells TIME the hotel is aware of the incident but declined to comment further.\n\nThe Brief Newsletter Sign up to receive the top stories you need to know right now. View Sample Sign Up Now\n\nCarney’s then-fiancee came into the locker room and started screaming at him, the woman told police. Court records say Carney and his wife went to the parking lot and had a physical altercation. Another bridesmaid helped the woman out of the locker room, according to police.\n\nThe next day, Carney called the woman and claimed he didn’t know what happened. He also apologized, the woman said. By that point multiple different narratives had emerged about the incident — Carney had begun telling others that she had “followed him” into the locker room, court documents say. The woman told police the assault and the stories surrounding what happened had caused “chaos amongst the entire wedding party,” police say. She said she felt “extremely violated and upset” and wanted to see if there was surveillance footage from outside the locker room.\n\nThe Pennsylvania state police officer investigating the case reviewed that footage and said it showed Carney pulling the woman into the locker room, according to court documents. The footage shows that twenty minutes later, Carney’s wife walked into the locker room.\n\nWNEP, a local ABC affiliate, reports that Carney and his now-wife got married, despite the incident. It is unclear whether the woman who accused Carney of assault was a part of the wedding.\n\nOn Sunday Sept. 1, the day of the wedding, Carney allegedly texted the woman to ask her to put the incident behind her for his wife’s sake — and asked her to take a morning after pill to prevent a pregnancy.\n\n“I just need total closure before I do this,” he wrote, according to the affidavit of probable cause. “I know this is terrible as well but my dick was out in the shower. We never did do it but would you consider taking Plan B to make damn certain just in case. There is almost no chance but still. Please tell me yes I’m begging you.”\n\nPolice, with permission from the Monroe County District Attorney’s office, intercepted a subsequent phone call between Carney and the woman on Sept. 2 in which he said they did not have sex and repeatedly apologized. During the phone call, Carney said he had led the woman into the room.\n\nCarney told police on Sept. 2, however, that he felt the woman had taken advantage of him. But after saying at first that she had led him into the locker room, he later said he had pulled her inside, according to court documents.\n\nCarney is charged with involuntary deviate sexual intercourse of an unconscious person, indecent assault and simple assault, according to court records. An attorney for Carney did not respond to a request for comment.\n\nWrite to Mahita Gajanan at mahita.gajanan@time.com.", "description": "A Pennsylvania man sexually assaulted a woman who was in his wife's bridal party two days before his wedding, police say.", "authors": ["Mahita Gajanan"], "top_image": "https://timedotcom.files.wordpress.com/2019/10/pennsylvania-groom-assault-wedding-2.jpg?quality=85&crop=0px%2C0px%2C2400px%2C1256px&resize=1200%2C628&strip", "published_at": "2019-10-07"}