{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/strictlys-craig-revel-horwood-says-20658113", "downloaded_at": "2019-10-20 00:43:53.672734+00:00", "title": "Strictly's Craig Revel Horwood says 'talentless' Love Island 'fame-seekers' will never join show", "language": "en", "text": "Get the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nStrictly Come Dancing 's famously fiery judge Craig Revel Horwood has blasted the stars of Love Island and insisted they will never land a place on the show.\n\nThe panelist let rip at contestants of the ITV show, branding them \"talentless fame-seekers\" who will never make it onto Strictly.\n\nAccording to the Daily Star Sunday , he said: \"Strictly is nothing like Love Island… absolutely not.\n\n\"Love Island is for people who aren’t celebrities, who’ve done nothing in their life and are trying to be someone and get something to be famous.\n\n\"But Strictly is meant to showcase people with talents in acting, singing, sports, journalism...not fame-seekers with no discernible talent.\"\n\n(Image: WireImage)\n\n(Image: Instagram)\n\nStrictly has long banned reality stars from joining the line-up, but this series was the first exception.\n\nMade In Chelsea's Jamie Laing became the first reality regular to land a place in the show.\n\nHowever, his run ended in disaster as he hurt his foot during the first group dance and had to pull out.\n\n(Image: Supplied by WENN)\n\n(Image: BBC)\n\nHe was replaced by Emmerdale star Kelvin Fletcher, who's now become favourite to win.\n\nStrictly bosses are said to have relaxed the rules for Jamie after struggling to fill the line-up for the 2019 series.\n\nA source told The Sun : \"It is a surprising U-turn from the BBC and Strictly.\n\n\"They said previously that low-rent reality stars like Jamie would not be allowed on the show but things now seem to have changed.\"\n\nDo you have a story to sell? Get in touch with us at webcelebs@trinitymirror.com or call us direct 0207 29 33033", "description": "Strictly Come Dancing's famously fiery judge has blasted stars of Love Island and insisted they have no place on the dance floor", "authors": ["Louise Randell", "Image", "Wireimage", "Instagram", "Supplied Wenn", "Bbc"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20651968.ece/ALTERNATES/s1200/1_Strictly-Come-Dancing-Launch-Show-Red-Carpet-Arrivals.jpg", "published_at": "2019-10-20"}