{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7616707/FIFTH-arrest-death-truck-tragedy-Driver-23-held-Dublin-port-getting-ferry.html", "downloaded_at": "2019-10-27 00:51:44.889777+00:00", "title": "FIFTH arrest in death truck tragedy: Driver, 23, is held at Dublin port after getting off ferry", "language": "en", "text": "A man who is understood to be sought by Essex Police as part of the investigation into the 39 lorry trailer deaths has been arrested at Dublin port this afternoon.\n\nThe man, in his twenties and from Northern Ireland, was arrested after getting off a ferry on Saturday afternoon.\n\nA blue Scania truck that he was driving has been impounded by the police.\n\nIt comes as police sniffer dogs are today scouring the £400,000 detached Cheshire home of a haulage boss and his wife - the last known owners of the lorry carrying 39 migrants who froze to death.\n\nJoanna Maher, 38, and her husband Thomas, also 38, from Warrington, were arrested yesterday in a dawn raid and have been held on suspicion of conspiracy to traffic people and on suspicion of 39 counts of manslaughter.\n\nIt followed the arrest of Mo Robinson, 25, from Northern Ireland, the driver of the Scania truck. He was held on suspicion of murder on Wednesday and remains in custody.\n\nAnd yesterday, a 48-year-old man from Northern Ireland was detained at Stansted Airport on suspicion of conspiracy to traffic people and manslaughter, Essex Police said.\n\nThomas Maher and his wife Joanne were arrested at 4am yesterday from their Cheshire home over the deaths of 39 migrants. They had just returned from being abroad\n\nPolice were today still searching their home and neighbours saw sniffer dogs going in. Three police cars were also stationed outside the family home in Warrington, Cheshire as well as a dog car\n\nGardai Police said this afternoon: 'Earlier today at Dublin Port An Garda Siochana arrested a male in his early 20s from Northern Ireland on foot of an outstanding court order for an offence in this jurisdiction.'\n\nThe man is due to appear before the Criminal Courts of Justice this afternoon.\n\nIt comes as police were today still searching the home of Mr and Mrs Maher, with neighbours reporting sniffer dogs going in and out.\n\nThree police cars were also stationed outside the family home in Warrington, Cheshire as well as a dog car.\n\nMailOnline can today reveal that the couple were arrested after they flew back into the UK. The couple have a family home in Spain but often travel to Ireland and Bulgaria.\n\nThe businessman made a visit to Bulgaria earlier this month to meet the man who registered the truck there despite it being sold a year ago.\n\nThomas Maher met with Ivan Jeliazkov and stayed at his home.\n\nThe couple's three cars worth more than £150,000 including a white Chevrolet Corvette, a Range rover Discovery and a Range Rover Sport were today still on the driveway (pictured, police remain at the property)\n\nMr Jeliazkov registered the Scania lorry in April 2017 for Maher and his wife Joanna and the lorry was said to have been sold last year.\n\nBut the two men were not just business associates but good friends who have also met in Britain.\n\nMr Jeliazkov, who operates as a haulage registration facilitator from a ground floor office in a run down apartment block, said he sent the Maher's gifts for their home and they sent him photographs of their children.\n\nMr Jeliazkov handled the registration of the lorry and said the fee was around £400.\n\nPolice said the lorry left Varna the next day and never returned.\n\nHe said: 'I first met them in the early 2000s when I was based in Rochester, Kent. I was a student.\n\n'Thomas's health hasn't been good and he went to Turkey for medical care and then came to Varna and stayed with me a couple of weeks ago for a few days. '\n\nHe said the reason the lorry had been registered in Varna in Maher's wife's name was because the taxes and associated costs were cheaper than in the UK.\n\nHe said: 'Thomas has been unwell for a few years with a heart illness and he had to put his company into his wife's name and that is how her name is on the register.'\n\nHe said he had handed the registration certificate to local police and could not remember the number plate details.\n\nMr Jeliazkov said he had been asked by Bulgarian police if he knew anything about the organisation behind the trafficking and the lorry's fateful trip and declared he had no knowledge.\n\nPham Thi Tra My (left) had texted her mother whilst taking the journey to the UK. The family of Nguyen Dinh Luong (right) are also concerned for his safety\n\nWho has been arrested so far? As police in the UK continue their investigations into the 39 migrants who lost their lives trying to enter the country, we keep track of who has been arrested so far. Lorry driver Maurice Mo Robinson: Arrested on suspicion of murder, police also given extra time to quiz the 25-year-old. Mo Robinson is the truck driver arrested after 39 people were found dead in the back of a lorry he was driving Joanna Maher, 38, and her husband Thomas, also 38: The Warrington couple who previously told MailOnline they had sold the container are understood to have been held on suspicion of conspiracy to traffic people and on suspicion of 39 counts of manslaughter. Mrs Maher, a mother-of-three, pictured with her trucker boss husband Thomas, told MailOnline that she sold the lorry involved in the deaths of 39 migrants to an Irish haulage firm 13 months ago 48-year-old man from Northern Ireland: The latest arrest took place at Stansted Airport. The identity of the man has not yet been revealed, but police said he has been arrested on suspicion of conspiracy to traffic people and suspicion of manslaughter. 20-year-old man from Northern Ireland: The man was arrested after getting off a ferry on Saturday afternoon.A blue Scania truck that he was driving has been impounded by the police.\n\nHe added: 'I have cleared my name and Thomas and Joanna are 100 per cent innocent too.'\n\nMr Jeliazkov spoke by telephone with the Mahers hours before police swooped and he said they reiterated in the conversation that they had sold the lorry in December 2018 to an Irish company.\n\nHe said: 'They are 100 per cent not criminals. I have known them for several years and know they have three children who they love very much. They are good people.'\n\nHe said the business was registered on the ground floor of a at a 10-storey residential block in Varna.\n\nHe added: 'My company is registered there so the fact I'm not present at the address does not mean the address is a shell company or fake address.\n\n'I knew the couple well they are my friends. Everything is legitimate. There is nothing illegal about registering a company in Bulgaria.\n\n'I am an official representative of their company and the taxes are lower here to register a truck but that's no crime and there is nothing wrong in having foreign investment in Bulgaria.\n\n'This is a smear campaign against them. The authorities abroad are investigating a serious crime.\n\n'When I spoke with them they were surprised that the media were showing an interest in them as they have had nothing to do with this lorry since they sold it.\n\n'I am going to help them by talking to the police here. I have given the registration certificate to the Ministry of Transport in Bulgaria.'\n\nThe Mahers told MailOnline they sold the lorry cab a year ago to a company in Ireland.\n\nThe refrigerated trailer in which the 39 trafficking victims died is believed to be owned by a rental firm in Dublin.\n\nMr Jelyazkov added: 'It is true that the Bulgarian lead ends with the registration plates of the truck.\n\n'After that we don't have anything to do with it and the truck has not been back to Bulgaria.\n\n'It was not loaded with those people in Bulgaria. It is a massive tragedy. Human trafficking is a very serious topic in society.\n\n'When I saw the picture of the Vietnamese girl who died, I was very upset.'\n\nHe said he did not believe Bulgarian police would be interested in him.\n\n'I have not been arrested. There is no reason for me to be arrested or charged with anything.\n\n'There has been no crime committed on the territory of Bulgaria. There are no Bulgarian citizens harmed.'\n\nThe night before his arrest, father-of-three Mr Maher, 38, said: 'We've just flown back from abroad. I have told the police we are back. I'm just about to take the kids out for a meal.'\n\nHours later they were arrested. One neighbour said: 'I looked out and saw Tom in the door way watch as a police van left. I think Joanna was arrested first.'\n\nThe couple's three cars worth more than £150,000 including a white Chevrolet Corvette, a Range rover Discovery and a Range Rover Sport were today still on the driveway.\n\nThe couple have three children including two boys, aged 18 and 11, and a 15-year-old girl. Mr Maher has insisted he sold the lorry on October 3 last year after owning it for a year.\n\nHer parents, Nguyen Thi Phong and Pham Van Thin (right), have said it was 'very painful' to receive the text - saying she must have known she was going to die when she sent it\n\nHe told MailOnline before his arrest: 'It's disgusting what's happened - it's horrible. I went to the British police as we were registered owners in Bulgaria.\n\n'I phoned them myself. They were happy we had come forward. They are well aware of who they are dealing with in southern Ireland.\n\n'It's not nice to be associated with this. We're shocked.'\n\nHe added: The police said thanks for ringing and I told them I was at home. I told the police who the previous owner was.\n\n'The police took my phone number and email address. Seeing all this wasn't nice.\n\n'I would just like the police to get on with their investigation.'\n\nHairdresser Mrs Maher said: 'My name was down as owning the lorry cab. But we sold it a year ago. It's nothing to do with us now.'\n\nIt comes as detectives are continuing to question four people over the deaths of the 39 migrants - including Mr and Mrs Maher.\n\nA 48-year-old man from Northern Ireland was detained at Stansted Airport on Friday on suspicion of conspiracy to traffic people and manslaughter, Essex Police said.\n\nThe Vietnamese migrants are all thought to have travelled from the same district, the Can Loc district, which is pictured right. In text messages sent at 10.28pm GMT on Tuesday, Pham Thi Tra told her mother, 'I love you so much...I'm sorry.' Pictured left, the screenshot of Tra My's last text\n\nIt followed the arrest of the driver of the Scania truck on suspicion of murder on Wednesday, who remains in custody.\n\nOn Thursday, detectives were granted more time to question Mo Robinson, 25, from Northern Ireland, after the bodies of eight women and 31 men were found in the refrigerated trailer in an industrial park in Grays in the early hours of Wednesday.\n\nIn Belgium, police are hunting the driver who delivered the trailer to Zeebrugge, the port it left before arriving in the UK.\n\nA spokesman from the Belgian prosecutor's office said: 'We're trying to identify the driver.'\n\nHe said Belgian authorities were also working to 'track the route of the container' and find anyone responsible for 'collaborating with the transport'.\n\n'We would like people to be arrested as soon as possible,' he added.\n\nEssex Police initially believed all of the dead were Chinese nationals, but the force said at a press conference 'this is now a developing picture' amid reports several may be Vietnamese.\n\nDeputy Chief Constable Pippa Mills said she would give no more details about the nationalities of the victims until formal identification had taken place.\n\nThe BBC said it has been in contact with six Vietnamese families who fear their relatives are among the dead, with some having the smuggling fees repaid.\n\nRelatives of 26-year-old Pham Tra My told the broadcaster they have not been able to contact her since she sent a text on Tuesday night saying she was suffocating.\n\n'I am really, really sorry, Mum and Dad, my trip to a foreign land has failed,' she wrote.\n\n'I am dying, I can't breathe. I love you very much Mum and Dad. I am sorry, Mother.'\n\nHer family said they had paid £30,000 for her to be smuggled into Britain, which has now been repaid.\n\nParents Nguyen Thi Phong and Pham Van Thin, told CNN it was 'very painful' to receive the text - saying she must have known she was going to die when she sent it.\n\n'I've lost both my loved one and my money,' her father Pham said, claiming he and his partner scraped together the money to pay for their daughter to travel to the UK.\n\nIn Vietnam, Nguyen Dinh Gia, the father of 20-year-old Nguyen Dinh Luong, feared his son was among the container victims.\n\nThis harrowing image shows a fleet of private ambulances arriving at Tilbury Docks to take away the victims on Friday\n\nFinal journey: How the 39 tragic migrants ended up in Purfleet, Essex, dead in the back of a refrigerated biscuit lorry\n\nHe had not spoken to his son since last week when he told his father he was trying to reach the UK by joining a group in Paris.\n\n'He often called home but I haven't been able to reach him since the last time we talked last week,' Nguyen Dinh Gia told the Associated Press.\n\n'I told him that he could go to anywhere he wants as long as it's safe. He shouldn't worry about money, I'll take care of it.'\n\nHe explained his son left Vietnam to work in Russia in 2017 and had since passed through Ukraine, Germany and France.\n\nIf the fridge on the hermetically sealed trailer was not running there would be no air coming in, suffocating people inside, according to Richard Burnett, chief executive of the Road Haulage Association.\n\nIt is not yet known when the victims entered the trailer, where temperatures can be as low as minus 25C if the fridge is activated, or the exact route it travelled.\n\nBelgian officials said the trailer arrived at Zeebrugge at 2.49pm on Tuesday and left the port the same day en route to Purfleet.\n\nThe trailer arrived at Purfleet at around 12.30am on Wednesday, and was picked up by the cab, known as the tractor, which arrived from Northern Ireland via Holyhead in North Wales on Sunday.\n\nThe lorry left the port at Purfleet shortly after 1.05am before police were called to the Waterglade Industrial Park on Eastern Avenue in Grays at 1.40am.\n\nChina has called for joint efforts to counter human smuggling, while vigils have been held in London and Belfast to pay tribute to the victims.\n\nThe Vietnamese embassy in London has said some families have contacted them asking about relatives but it is yet to receive any information from police.", "description": "The man, in his twenties and from Northern Ireland, was arrested after getting off a ferry this afternoon.", "authors": ["James Wood", "Shekhar Batia For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/12/20214802-0-image-a-4_1572090890467.jpg", "published_at": "2019-10-26"}