{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7580275/Settlement-expected-womans-federal-suit-against-San-Antonio-police-conducting-vaginal-search.html", "downloaded_at": "2019-10-16 21:29:01.700883+00:00", "title": "Settlement expected on woman's federal suit against San Antonio police for conducting vaginal search", "language": "en", "text": "A woman whose tampon was pulled out by a police officer to conduct a vaginal search in public could receive a $205,000 settlement.\n\nThe city of San Antonio is scheduled to vote Thursday on whether to approve the payout.\n\nNatalie D. Simms was approached by police while sitting on the side of a public street, talking on the phone and waiting for her boyfriend in August 2016.\n\nPart of the dash cam showing the search of Natalie Simms that a female officer conducted, allegedly ordering er to lower her pants and underwear on the street\n\nA lawsuit alleges dialogue between the female officer and Natalie Simms regarding a vaginal cavity search in public\n\nAccording to the lawsuit, Simms agreed to a vehicle search.\n\nTranscript of tampon conversation The lawsuit alleges Simms did not consent to a vaginal cavity search. WILSON: Uh-huh. Are you wearing a tampon, too? SIMMS: Yes. WILSON: Okay. I just want to make sure that's what it is. Is that a tampon? SIMMS: Come on. Yes. WILSON: Huh? Is that a tampon? SIMMS: It's full of blood, right? Why would you do that? WILSON: I don't know. It looked like it had stuff in there. SIMMS: There ain't nothing in there.\n\nBut when the officers did not find any illegal items, a female officer was brought in, and the suit claims her constitutional rights were violated.\n\nDetective Mara Wilson, who is now retired, conducted the search of Simms in front of several male officers. The search was also partially recorded by a dash camera on Wilson's police vehicle.\n\nWilson pulled Simms' pants and underwear down in public and used her flashlight to search her vaginal cavity, the lawsuit claims.\n\nAccording to the lawsuit, Detective Wilson held the tampon in the air for approximately 23 seconds.\n\nAs the officer continues her search from behind, Simms asked to 'go to the station for that.'\n\nWilson promptly replied, 'I ain't going nowhere. I'm gonna search you right here.'\n\nThe lawsuit also states that Wilson referenced the woman's pubic's hair.\n\nUltimately, Simms was permitted to drive away when the officers didn't find anything illegal. She filed the lawsuit in March 2018.\n\nIf approved by the city council Thursday, the settlement would be paid from the city's self-insurance liability fund.", "description": "Natalie Simms claims a female police officer was brought in for a vaginal search. She seeks $205,000 from the city of San Antonio, which will get voted on Thursday by the city council.", "authors": ["Jerry Barmash For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/17/19795354-0-image-a-45_1571244374165.jpg", "published_at": "2019-10-16"}