{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/15/walmart-launches-in-home-grocery-delivery-in-three-cities-kansas-city-pittsburgh-vero-beach", "downloaded_at": "2019-10-15 23:04:39.558135+00:00", "title": "Walmart launches in-home grocery delivery in three cities: Kansas City, Pittsburgh & Vero Beach – TechCrunch", "language": "en", "text": "Walmart will bring your groceries to you and put them away in the fridge, with the launch of its new service, InHome. The retailer is today debuting its new in-home grocery delivery service in three cities: Kansas City, (Missouri and Kansas); Pittsburgh, Pennsylvania; and Vero Beach, Florida. Customers in these markets can subscribe to InHome for $19.95 per month, then receive free, unlimited deliveries where Walmart associates enter their home and put the groceries away while live-streaming the delivery in real time.\n\nThe retailer had previously detailed its plans to offer in-home grocery delivery earlier this year, saying that it would make it easier for customers to shop for groceries online.\n\nUnlike with traditional e-commerce orders, groceries can’t sit outside on the doorstep for hours. Using insulated coolers to work around this problem can be costly, and it only buys a little more time. Instead, InHome delivery solves the problem of dealing with fresh and frozen groceries by simply putting them away at the time of delivery.\n\nAt launch, Walmart is partnering with Level Home for its front door smart entry technology and Nortek Security & Control for its garage door smart entry technology. Level Home also today announced $71 million in funding, which included a strategic investment from Walmart.\n\nFrom the InHome website, customers can select either device for $49.95 and receive free, professional installation. This is cheaper than if bought directly. When the lock goes on sale, it will retail for $250 next year when made available to the public.\n\nOnce customers begin their InHome subscription, they are able to try it for free to see if the service works for them. (The trial converts to a subscription if not canceled).\n\nWhile deliveries won’t have other fees beyond the $19.95 per month InHome subscription, there is a $30 minimum order to use the service. In other words, it’s meant to be used in place of a real grocery shopping trip, not just for a few items for dinner.\n\nWhen it’s time for delivery, the Walmart associate uses a one-time code to unlock the door or garage using the InHome app, which pairs with the supported smart entry device.\n\nAnd to assuage customers’ concerns about strangers entering their home when they’re not there to supervise, Walmart came up with the pretty wild idea to record the delivery in real time so customers can watch it take place from afar.\n\nOn the associates’ vest, they’ll wear a proprietary, live-streaming camera that sends video of the delivery right to the customer’s device. And if the camera doesn’t turn on, the door or garage door won’t unlock, Walmart says.\n\nWalmart first rolled out InHome in a pilot in New Jersey for six months and has been running pilots in Kansas City and Pittsburgh for the last two months. It won’t say how many people have been using it during these tests.\n\nIn the three markets live today, Walmart says InHome will be available across more than 20 total stores.\n\nInHome is Walmart’s answer to Amazon’s Key by Amazon service, which involves both in-home and in-car delivery of Amazon purchases. But unlike Key, which focuses on Amazon packages, InHome is for Walmart Grocery orders only, not Walmart.com merchandise.\n\nThe service is one of several ways Walmart has been expanding its online grocery business in recent months.\n\nIt also last month expanded its Delivery Unlimited service, an Instacart rival, across the U.S. At $12.95 per month, it’s the better choice for anyone who was already getting delivery from Walmart Grocery at least twice per month, given the $9.99 per delivery fee.\n\nAnd now, for a few dollars more, InHome makes sense for those who want even less hassle when it comes to online grocery shopping.\n\nThere’s an un-touted environmentally friendly aspect to this service, as well. First, grocery delivery can end up being more efficient than everyone shopping for themselves, as drivers can often deliver a couple of orders on the same trip, when the customers are near each other. And the drivers could use larger cooler bags and other reusable containers, like crates, instead of plastic bags, for example, because they’re putting items away instead of handing them over. (Typically, grocery delivery services today bring your order in tons of plastic bags.)\n\nOf course, individual stores may not enforce the use of reusable bags — that remains to be seen.\n\nWalmart says the public launch of InHome will help it gain insights before it rolls out the service more broadly.", "description": "Walmart will bring your groceries to you and put them away in the fridge, with the launch of its new service, InHome. The retailer is today debuting its new in-home grocery delivery service in three cities: Kansas City, (Missouri and Kansas); Pittsburgh, Pennsylvania; and Vero Beach, Florida. Customers in these markets can subscribe to InHome […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/walmart-inhome.jpeg?w=613", "published_at": "2019-10-15"}