{"pub": "indiatimes", "url": "https://indiatimes.com/lifestyle/people-shared-what-happened-when-they-told-their-crush-they-like-them-and-we-are-happy-378807.html", "downloaded_at": "2019-10-30 11:37:50.824466+00:00", "title": "People Shared What Happened When They Told Their Crush They Like Them And We Are Happy", "language": "en", "text": "People Shared What Happened When They Told Their Crush They Like Them And We Are Happy\n\nPeople Shared What Happened When They Told Their Crush They Like Them And We Are Happy\n\nThe rush is a totally different kind when you are crushing on someone. The unsaid relationship with your crush is something not everyone can comprehend or relate to. Crushing on someone fills you with so many emotions. Nervousness, excitement and uncertainty. You want to spend your time with them but you also don't want to. You want them to see you but also desperately want to be seen.\n\nIt is an odd place to be in and frankly, it does hurt you mentally when the emotions are hidden inside.\n\nSo the best way is to tell them you like them because seriously, people love to hear that. What is the worst that can happen, they will not reciprocate right?\n\nBut what if they do? It can change your life forever.\n\nSo I asked some people who did tell their crush they like them and the responses will make you want to do the same.\n\n1. \"I approached her so weirdly that she stopped talking to me for good one week. She came around when she saw me walking upset in the college canteen.\"\n\nUnsplash\n\nDon't Miss 715 SHARES 392 SHARES 310 SHARES\n\n2. \"I am openly gay and I liked a guy in my class in college. Soon the liking towards him only kept increasing and I couldn't resist. As introvert and as he was, it was my confession that made him come out of the closet. He started to believe that love is of the utmost importance.\"\n\nUnsplash\n\n3. \"She didn't say a word when I told her. However, she got all dressed up and made sure she was in my line of sight. It was cute of her dress up for me.\"\n\nUnsplash\n\n4. \"I had a crush on a married man who was not quite happy. After reconsidering, I went ahead and told him anyway. We haven't talked since. Our country needs to know how important it is to be happy.\"\n\nUnsplash\n\n5. \"Well, I kinda flunked a test after she agreed to go on a coffee date with me.\"\n\nUnsplash\n\n6. \"The guy I liked knew from the start that I like him. It was on my face. So he, eventually, came and asked me out on a date. It was the best day of my life. \"\n\nUnsplash\n\n7. \"I never had the courage telling a woman in my office how much I liked her because she got divorced a few years back. Seeing her crying one day at work I went up to her and confessed. I saw her smiling after a long time.\"\n\nUnsplash\n\n8. \"I was in class 8th when I told my husband that I like him. From my crush to being my husband, I've had quite and amazing journey with him.\"\n\nUnsplash\n\n9. \"I hid a gift and a card in the bag of the girl I really liked back in school. Like a moron I forgot to write my name on it. So I did tell the girl but she never got to know it was me.\"\n\nUnsplash\n\n10. \"My timing went wrong. I told the woman I was in love with her and she told me she was leaving the country in one week. It was very disheartening to just see her go.\"\n\nUnsplash\n\n11. \"I became best of friends with the girl who was my crush. I am not sure what I feel for her but the bond we share now is something I wouldn't trade for anything. \"\n\nUnsplash\n\n12. \"I was told by him that I am too good for him and he is not someone I should be looking for. \"\n\nUnsplash", "description": "The adrenaline rush is totally a different kind when you are crushing on someone. The unsaid relationship with your crush is something not everyone can comprehend or relate with. Crushing on someone fills you with so many emotions. Nervousness, excitement, and uncertainty. You want to spend your time with them but you also don't want to. You want them to see you but also desperately want to be s", "authors": ["Arushi Lohia"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/crush_1572347009_800x420.jpg", "published_at": "2019-10-30"}