{"pub": "marketwatch", "url": "https://marketwatch.com/story/us-china-trade-talks-are-going-very-well-trump-says-2019-10-10", "downloaded_at": "2019-10-11 00:18:19.150784+00:00", "title": "U.S.-China trade talks are ‘going very well,’ Trump says", "language": "en", "text": "WASHINGTON — President Donald Trump offered an upbeat assessment of U.S.-China trade talks and said he would meet at the White House on Friday with the leader of the Chinese negotiating team.\n\nExpectations were low that the negotiations would do much to resolve a 15-month trade battle that is weighing on the global economy.\n\nBut as the first of an expected two days of talks wrapped up Thursday, Trump told reporters at the White House, “We’re doing very well ... We’re going to see them tomorrow, right here, and it’s going very well.”\n\nChinese Vice Premier Liu He is leading the delegation in the 13th round of negotiations with U.S. Trade Representative Robert Lighthizer and Treasury Secretary Steven Mnuchin.\n\nThe world’s two biggest economies are deadlocked over U.S. allegations that China steals technology and pressures foreign companies to hand over trade secrets as part of a sharp-elbowed drive to become a world leader in advanced industries such as robotics and self-driving cars.\n\nUnder Trump, the United States has slapped tariffs on more than $360 billion worth of Chinese imports and is planning to hit another $160 billion Dec. 15. That would extend import taxes to virtually everything China ships to the United States. China has hit back by targeting about $120 billion in U.S. goods, focusing on farm products.\n\nThe high cost of the tariffs and uncertainty over when and how the trade war will end have taken an economic toll, especially on manufacturing companies. A private survey last week found that U.S. factory output had dropped to its lowest level since 2009, when the economy was in the grips of a deep recession.\n\n“Both sides have been losing, and so has the global economy,” said Myron Brilliant, head of international affairs at the U.S. Chamber of Commerce.\n\nBrilliant, who spoke with both delegations before the meetings, sounded optimistic about the chances of progress, noting that Beijing has stepped up purchases of U.S. soybeans in a goodwill gesture. He said he hoped a productive meeting would persuade the Trump administration to call off or postpone plans next Tuesday to raise tariffs on $250 billion of Chinese imports from 25% to 30%.\n\n“We all know we can’t afford a further escalation of the trade war,” Brilliant said.\n\nStill, Beijing has been reluctant to make the kind of substantive policy reforms that would satisfy Washington. Doing so likely would require scaling back the Chinese leaders’ aspirations to technological dominance they see as crucial to their country’s future prosperity.", "description": "President Donald Trump offered an upbeat assessment of U.S.-China trade talks and said he would meet at the White House on Friday with the leader of the...", "authors": ["Associated Press"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT106_tradet_ZG_20191010185345.jpg", "published_at": "2019-10-10"}