{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/24/WS5db14d24a310cf3e3557254e.html", "downloaded_at": "2019-10-24 07:52:42.225644+00:00", "title": "Does a person have the right to die? The answer depends...", "language": "en", "text": "By Zhang Zhouxiang | chinadaily.com.cn | Updated: 2019-10-24 15:05\n\nMarieke Vervoort, a paraolympic gold medalist from Belgium, died by euthanasia on Tuesday at the age of 40, which aroused fierce discussion on both domestic and overseas social networks.\n\nDiscussing euthanasia is a tricky subject because suicide itself is a very polarizing topic. There are people that believe it is \"wrong\" to commit suicide under any circumstances, and there are people who believe that everyone should have the freedom to commit suicide and take their own life, especially if a person is living in constant pain and suffering. A self-willed death for those suffering from constant torment is often regarded as different from suicide.\n\nIn most cases, people commit suicide because of untreated depression. In the majority of assisted-suicides, people are simply trying to help a person who they are close to end chronic suffering caused by a terminal illnesses.\n\nHowever, when the question is \"Should the law allow one person to take the life of another?\", the question is even more sensitive. Because it requires the law to set out the conditions in which a person can be helped to end their life by another.\n\nWhen it becomes a legal issue, there are many more things to consider. Is there ample consensus to make that into a law? How will the law be implemented? How to judge whether the applicant has incurable and painful diseases? What kinds of diseases at what phases can be called \"incurable\" and \"painful\"? How to make sure the person seeking to end their life is doing so a rational frame of mind and of his/her own volition? What to do if the applicant changes his/her mind during the process?\n\nWhen it comes to legislation about euthanasia, all the above questions, and more, need to be answered.\n\nThat's partly why legalizing euthanasia has been discussed in China for at least a decade, but there is still not enough social consensus to make it permissible by law. Some people advocate passing such a law, but at least within the foreseeable future that seems unlikely.", "description": "Marieke Vervoort, a paraolympic gold medalist from Belgium, died by euthanasia on Tuesday at the age of 40, which aroused fierce discussion on both domestic and overseas social networks.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/24/5db15020a310cf3e97a2c7e6.jpeg", "published_at": "2019-10-24"}