{"pub": "washingtontimes", "title": "Louisana's 'Woodstock' celebrates 50th anniversary of hippie fest", "url": "https://washingtontimes.com/news/2019/sep/2/new-orleans-pop-festival-louisiana-woodstock-celeb", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:05:08.004657+00:00", "text": "NEW ORLEANS — August, 1969. Thousands of long-haired young people, some nude or nearly so, populate the rural landscape. Janis Joplin, Santana, and the Grateful Dead are among the featured acts and the air is thick with the sound of rock and the smell of marijuana.\n\nWoodstock?\n\nNope. Prairieville. Prairieville, Louisiana.\n\nFifty years ago, in Woodstock’s wake, an estimated 30,000 people jammed into, or camped outside of, a speedway in Prairieville, 65 mile west-northwest of New Orleans, for what was dubbed the New Orleans Pop Festival. It was a bayou-country re-enactment of sorts.\n\nIt was smaller than Woodstock, which had drawn an estimated 400,000 to farmland in New York two weeks earlier. But there was a similar hippie vibe at the Louisiana festival, says John Moore, aka Deacon John, the New Orleans guitar virtuoso and vocalist who is still performing 50 years later.\n\n“We wanted to emulate Woodstock by showing that New Orleans, despite its location in the Deep South, which was, you know, the harbinger of hatred and evil and racism – and all the anti-war stuff was going on – we wanted to show them that New Orleans could have a festival, too, without any violence,” Moore said in an interview. He was in his New Orleans home, crowded with guitars and other instruments, folders crammed with sheet music and memorabilia including a poster and program from the festival.\n\nSome of the widely famous acts that played Woodstock also played at Prairieville, including Creedence Clearwater Revival, Canned Heat, and Country Joe & the Fish, whose “I-Feel-Like-I’m-Fixin’-to-Die-Rag” became an anti-Vietnam war anthem.\n\nJimi Hendrix was not there to repeat his Woodstock performance. But Deacon John, then 28, was.\n\nHe recalls giving the crowd a taste of Hendrix with song selection – “We played ‘Foxy Lady”’ – and attire.\n\n“I had my tie-dyed headband on, with my bell-bottom blue jeans and my tie-dyed shirt,” Moore said. Clad in what is now his customary performance garb – jacket, tie, short-brimmed hat – he beamed at the memory of the festival, showing off a poster and program and pictures of himself in the ‘60s, sporting an Afro and mutton-chop sideburns.\n\nOne archived news account says a dozen people were arrested for sale and possession of marijuana and that doctors reported treating about 30 for bad LSD trips.\n\nNobody could say that anyone who wound up in jail or ill hadn’t been warned. The program urged abstention from drugs from uncertain sources that might be “improperly manufactured.” And a poster prominently warned of plainclothes detectives in the crowd.\n\nFestival promoters explained in the program that they went to great lengths to persuade speedway owners and local authorities to let the festival happen. “Festival staff would like to remind you that there are people outside of this stadium who don’t dig the sounds you’ll hear this weekend, who don’t like our hair, or our clothes, or our ideas, and they are waiting for us to blow our cool,” the program said.\n\nThere were similar festivals that weekend in Lewiston, Texas, and Tenino, Washington, and all three went off with no reports of major incidents. Traffic backups were reported near the Prairieville site, but, an Associated Press story following the festival’s close was largely positive. Among those pleased: “The area merchants … who reaped a harvest from the flower children and were astonished at their unexpected good behavior.”\n\nSubsequent festivals have had their ups and downs. Months later, a festival at Altamont Speedway in California would be marked by violence, including a stabbing death. In 1971, another attempt to produce a Woodstock-inspired fest in the community of McCrea, Louisiana, was deemed a chaotic, drug-infused failure, linked to at least two drowning deaths in the Atchafalaya River. The travails were chronicled in news accounts and a documentary, McCrae 1971, made by two Southeastern Louisiana University Students.\n\nBut, 50 years later, the New Orleans Pop Festival appears to have been a peaceful, hippie-era success.\n\n“We wanted to show that a sizeable portion of the Southern population, in the Deep South, could get together with peace and love and brotherhood,” Moore said, later adding, “It did go off pretty well.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Fifty years ago, in Woodstock's wake, an estimated 30,000 people jammed into, or camped outside of, a speedway in Prairieville, 65 miles west-northwest of New Orleans, for what was dubbed the New Orleans Pop Festival. It was a bayou-country re-enactment of sorts.", "authors": ["The Washington Times Http", "Kevin Mcgill"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/02/Louisianas_Woodstock_98007.jpg-0825d_c0-229-5472-3419_s1770x1032.jpg?6f9ce78ee1a3a25672569ab4bf84dc3559d8855e"}