{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/miley-cyrus-locks-lips-pal-20400393", "downloaded_at": "2019-10-05 10:19:15.939451+00:00", "title": "Miley Cyrus spotted kissing Cody Simpson on sushi date after split from Kaitlynn Carter", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nMiley Cyrus was reported to have shared a \"quick kiss\" with Cody Simpson after two recent splits.\n\nThe Wrecking Ball hitmaker, 26, and the Australian actor, 22, go way back as they have been BFFs for a long time.\n\nIn an Instagram clip, the close friends were spotted enjoying a casual catch up over sushi while at a grocery store, in Los Angeles on Thursday afternoon.\n\nMiley wore her golden locks in an up-do style while she was clad in a scanty crop top.\n\nCody was dressed casually in black jeans and trainers for his sushi date with Miley.\n\nThe source wrote: \"Miley on a date with the one and only Cody Simpson yeahh.\" (sic)\n\nYet another source shared with E! news that Miley and Cody were spotted locking lips as she reportedly moves on from her recent exes.\n\n(Image: Instagram)\n\nThe eyewitness, who didn't film the clip, added the singer was \"dressed casually in a tank top\" while her friend \"noticed people seeing them so they tried to rush out of there\", according to E! news.\n\nThe Mirror has approached Miley Cyrus and Cody Simpson's representatives for comment.\n\nMiley and Cody's first crossed paths on a group trip to Miami when she was in a relationship with Patrick Schwarzenegger in 2014.\n\n(Image: GETTY IMAGES)\n\nThe Nothing Breaks Like A Heart singer joined the likes of Selena Gomez at Cody's star-studded 18th birthday bash.\n\nOver the years, they have enjoyed a string of dinners and parties in each other's charming company.\n\nCody has even thrown his support behind Miley as he attended her concert in 2015.\n\n(Image: GETTY IMAGES)\n\n(Image: AFP/Getty Images)\n\nIn December of that year, the musician\n\nHe told GQ Australia : \"Miley is one of my best friends and she helps with some of that transitional stuff – trying to escape your childhood.\n\n\"She’s super open-minded and I’m working on becoming more like that.\"\n\nRecently, Miley cooled things off with Kaitlynn Carter after their brief romantic dalliance.\n\nThe couple were seen packing on PDA on a boat in Lake Como during their girls' break as Miley announced she was separating from her husband Liam Hemsworth.\n\nMiley and Liam were married for eight months before they went their separate ways for good.\n\nThe lovebirds were on and off for a decade as they tried to make their love work after falling for one another on the set of The Last Song in 2009.\n\nPreviously, Cody used to enjoy a high-profile romance with stunning model Gigi Hadid.", "description": "Miley and Cody go way back as the BFFs have been firm friends since their group trip to Miami in 2014", "authors": ["Lily Waddell", "Image", "Instagram", "Getty Images", "Afp Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20400395.ece/ALTERNATES/s1200/0_miley-cyrus.jpg", "published_at": "2019-10-04"}