{"pub": "cnn", "title": "From Ferris Bueller to opioid trial: A judge's wild ride into history", "url": "https://cnn.com/2019/08/26/health/oklahoma-opioid-judge-thad-balkman-profile/index.html", "language": "", "published_at": "2019-08-26", "downloaded_at": "2019-09-02 07:40:38.155444+00:00", "text": "Norman, Oklahoma (CNN) It's the morning of the biggest ruling of his life, and Judge Thad Balkman is driving his 14-year old son Harrison to middle school.\n\nBalkman, 47, already knows what his decision will be in the historic opioid trial that played out in his courtroom over 33 days -- and that in just a few hours, the world will know it, too.\n\nHe talks with his boy about schoolwork and the new eighth grade year. Then the subject shifts to the matter at hand: Getting Harrison out of science class so he can witness the verdict.\n\n\"Tell (your teacher), 'My dad's got the big judgment today,'\" Balkman says.\n\nThe black Honda Accord eases into the parking lot at the middle school in Norman. Father and son fist-bump. \"I love you,\" Balkman says.\n\nHis phone keeps pinging. \"May God give you wisdom and discernment and favor as you prepare for your decision. Thank you for your service,\" says Mary Fallin, the former Oklahoma governor who appointed him to the bench.\n\nA man known as \"Bus Driver 40\" texts: \"My prayers are with you when you hand down your decision. May God be with you on your decision today. I trust your judgment.\"\n\nBalkman pauses. \"It's kind of cool to get these texts of support,\" he says. \"I'm just obviously a little bit excited.\"\n\nJudge Thad Balkman has continued a regular case load. His next trial begins on Tuesday, but with a lot less publicity.\n\nNever has one of his cases brought this much attention.\n\nLess than six years into his tenure as the Cleveland County district judge, he's seen it all. Dog bite cases. Divorce. Rape. Murder. Incest. The crimes against children are the ones that shake him the most, says Balkman, a father of five. He sentenced one man to 3,000 years in prison for doing \"unspeakable things\" to kids.\n\nBut Balkman doesn't hesitate when asked about the weight of everything on his shoulders in this case -- the media glare, the high-powered attorneys, the legal precedent.\n\n\"I recognize that I'll probably be known as the opioid judge,\" he tells CNN. \"I'm going to live with this case and my judgment for the rest of my career.\"\n\nOn one side is the state of Oklahoma, which has accused Johnson & Johnson of creating a public nuisance by flooding the state with opioids and destroying countless lives. On the other is Johnson & Johnson, one of the nation's most recognized brands best known for its baby powder, which has said it did nothing wrong.\n\n\"The question that's before me and the question that we spent 33 days at trial is: Do the alleged acts of the defendants add up to creating a nuisance -- and, if so, how to abate the nuisance?\" Balkman asks. \"That's what this is all about.\"\n\nBalkman filled seven legal pads with notes as he listened to the testimony of 109 witnesses. \"I tried to take down observations that I made when I felt a particular witness was credible or not as credible,\" he says. \"Because, at the end of the day, that's the job of fact-finder. You're making firsthand observations about who's speaking the truth.\"\n\nDecision day\n\nAfter dropping off his son at school, he hits the treadmill at the gym across from the courthouse. Then, he conducts pretrial preparation for his next case beginning Tuesday. When you're a district judge, the work doesn't slow, even as your biggest case presses down.\n\nLast Friday, Balkman handled two divorce cases. Two days before, 85 defendants filled his courtroom and were either sentenced or arraigned.\n\nIt's all been a wild ride for the \"opioid judge\" -- who before claiming that monicker had another pretty cool claim to fame: the guy whose boyhood home was immortalized in the iconic 1986 movie \"Ferris Bueller's Day Off.\" The house was in Long Beach, California, not Chicago, as the movie would have you believe.\n\nAs the announcement of his decision nears, Balkman keeps his ruling close to his vest. \"I am completely at peace with my decision,\" says Balkman, a Mormon and former conservative stalwart in the Oklahoma Statehouse. \"I've got my faith, I've got my family and that's what's going to sustain me from any criticism I get.\"\n\nAt 3 p.m., Balkman taps a sign hanging on the back of his office door. \"Judge like a champion today,\" it reads. Then he enters the courtroom.\n\nThe nearby University of Oklahoma football team has a sign like this in their locker room. Balkman touches it every time he enters court.\n\nThe historic decision\n\nBalkman takes up a seat behind the dark-stained cherry bench, the state seal looming over his head. He thanks everyone involved in the case, from his secretary to court reporters to the attorneys on both sides.\n\nThen, he delivers his verdict. Yes, he says, Johnson & Johnson and its subsidiary Janssen Pharmaceuticals created a public nuisance and should pay more than $572 million to fix the problem it created.\n\n\"The opioid crisis is an imminent danger and menace to Oklahomans,\" Balkman says. \"My judgment includes findings of fact and conclusions of law that the state met its burden -- that the defendants Janssen and Johnson & Johnson's misleading marketing and promotion of opioids created a nuisance.\"\n\nHe adds that the actions of Johnson & Johnson \"compromised the health and safety of thousands of Oklahomans, specifically the defendants caused an opioid crisis that is evidenced by increased rates of addiction, overdose deaths and neonatal abstinence syndrome in Oklahoma.\"\n\n\"The opioid crisis has ravaged the state of Oklahoma. It must be abated immediately.\"\n\nHe says the state has within 10 days to prepare final judgment and present it to the defendants. Johnson & Johnson was given five days to raise any objections.\n\n\"I thank you for the honor of presiding over this trial, and until we meet again, this court will be adjourned.\"\n\nAnd just like that, the packed courthouse rises, and Balkman goes back into his office.\n\nThe conservative and the liberal\n\nBefore Balkman became a judge, he was known as a conservative Republican in Oklahoma's House, serving six years in the early 2000s. He was voted out in 2006.\n\nDuring that span, he struck up an odd friendship with one of the state's leading Democrats, Cal Hobson, who served 12 years in the Oklahoma House and 16 in the state Senate, rising to become president pro tem.\n\nThe two despised almost everything about the other's political views, but found common ground in their humanity.\n\n\"It's true I tried to demonize Thad Balkman as an anti-tax, anti-education, anti-healthcare, anti-this, anti-that kind of guy,\" Hobson says. \"Some of it was fair, but a lot of it wasn't.\"\n\n\"For me it's politics,\" Hobson says. \"Others think we don't like each other. I just didn't like his policies. But I like him very much for the way he raised his family and conducted himself.\"\n\nThad Balkman's office is cluttered with artifacts and photographs. The bust of Abraham Lincoln with a photograph beneath it of President Donald Trump provide an interesting juxtaposition of presidential styles.\n\nHe praised Balkman for working with Democrats to build the National Weather Center in Norman and for being one of the few Republicans to vote to ban smoking in public places. Balkman says the two had spirited letter-writing back and forth during their days as legislators.\n\nHobson says he was glad when the opioid case fell to Balkman. The reason: \"Because we have judges that are not remotely as qualified as he is. We have judges that are just pure political appointees with relatively limited skills. He's not one of them.\"\n\nThe Democrat then says of his former adversary: \"He's been so reasonable all his life.\"\n\nBalkman says when he puts on his robe, he seeks to be fair to everyone in his court.\n\n\"I've tried very hard since I took this position to abide by my judicial oath, which is I swore an oath to uphold the Constitution regardless of the parties before me,\" he says.\n\nFerris Bueller and Snoop Dogg\n\nBalkman never foresaw living a life in land-locked Oklahoma. He grew up in Long Beach. Summers were meant for the sand, sun and surf. He served in a junior lifeguard program where the coveted prize at summer's end was a \"Stud Ironman\" shirt for completing a 4-mile run and 2-mile swim in under two hours.\n\nA young Thad Balkman kicks back in his room. The hit movie \"Ferris Bueller's Day Off\" was filmed in his home. Balkman's father was so embarrassed by his son's messy room he wouldn't let the crews film it.\n\nWhen the film crew for \"Ferris Bueller's Day Off\" came knocking, Balkman's father, James, had one caveat: They couldn't film his son's wreck of a room. Dad was too embarrassed. A movie set was built, instead, for Bueller's room based \"loosely\" on Balkman's messy room, he says.\n\nThe then-14-year-old Balkman was able to hang around the house to watch scenes be filmed, including the famous one in which Bueller's sister karate-kicks the school principal in the face\n\n\"I was right behind the camera,\" he says with a laugh.\n\nHe would go on to shine in school, serving as captain of the water polo team at Long Beach Polytechnic High School and being named class president his senior year. He was voted \"Most Outgoing.\"\n\nOne of his classmates was none other than Snoop Dogg.\n\nThad Balkman was class president of Long Beach Poly High in 1989. One of his classmates was Snoop Dogg. The judge keeps a newspaper clip about the two of them meeting up at their 30th class reunion.\n\nBalkman set off on his two-year Mormon mission to Argentina in November 1990. A little over a year later, his world was shattered. His mother, Sonya, was left comatose after a botched knee surgery. She remained in a coma for months.\n\nBalkman came home on July 21, 1992. \"My mom passed away the next morning,\" he says. She was 52.\n\n\"It was a time of life where I was transitioning from a kid to a man. That made me grow up pretty quickly, not having a mom around to guide me.\"\n\nTo this day, he often wonders \"if I'm pleasing her or if she would be proud of what I do.\"\n\nA lesson for the youth\n\nThe night before he announced his decision, Balkman took to another podium. He attended a youth program at the Church of Jesus Christ of Latter-day Saints, where he is a bishop.\n\nOne high school freshman spoke of the importance of choosing the right friends. Another talked about how one must be diligent in the face of adversity at school and in life.\n\nCleveland County District Court Judge Thad Balkman has presided over the historic Oklahoma opioid case this summer.\n\nWhen it was Balkman's turn, he emphasized the need to follow the Commandments and to remain firm in one's beliefs. To follow the guidance of the scriptures. His wife, Amy, sat in the pews with two of their children. The couple met in church in Washington state after his mission trip all those years ago. They've been married for 25 years and have five children ranging in age from 11 to 21.\n\n\"What happens, then, when we don't obey the Commandments?\" Balkman asked the members of the youth group. \"Well, let me tell you what happens to me in my job as a judge when I don't follow the law. You ever wonder what happens to a judge when they don't follow the law?\"\n\nThe dozens of young people sat quietly, their attention focused on the judge.\n\n\"I get reversed -- and most of the time when I get reversed, I also get remanded,\" he said. \"That means the higher court judges show me where I went wrong and they give me instructions on how to properly follow the law -- and they give me a redo.\n\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\n\n\"But there's always a record that shows I was reversed. It's published online for the whole world to see.\"\n\nThe nation has now seen his latest decision, and while it undoubtedly will be appealed, the judge is at peace.", "description": "It's the morning of the biggest ruling of his life, and Judge Thad Balkman is driving his 14-year old son Harrison to middle school.", "authors": ["Wayne Drash"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190825230913-thad-balkman-drash-01-super-tease.jpeg"}