{"pub": "cbc", "url": "https://cbc.ca/news/canada/nova-scotia/thousands-without-electricity-ahead-of-hurricane-dorian-1.5274741", "downloaded_at": "2019-09-08 11:45:14.831908+00:00", "title": "About 80% of Nova Scotia without power after Dorian slams Atlantic Canada | CBC News", "language": "en", "text": "More than 400,000 Nova Scotia Power customers were left without electricity as Dorian swept through the region.\n\nAs of 12:39 a.m., the power utility reported there were 402,103 customers without electricity — roughly 80 per cent of the province. Most of the outages were caused by high winds that downed trees and heavy rain, something that was expected to continue through the night after the storm made landfall shortly after 7 p.m.\n\nPower for most customers is expected to be restored by late Sunday night, but Nova Scotia Power announced at 9:15 p.m. that as winds lowered in Yarmouth, N.S., they were able to put crews back on the road there.\n\nAs winds have lowered in Yarmouth, crews have begun patrolling the lines to assess damage. First up for restoration will be the Yarmouth Regional Hospital. <a href=\"https://twitter.com/hashtag/DorianNS?src=hash&ref_src=twsrc%5Etfw\">#DorianNS</a> <a href=\"https://twitter.com/hashtag/NSstorm?src=hash&ref_src=twsrc%5Etfw\">#NSstorm</a> <a href=\"https://t.co/uzvpLNBTXX\">pic.twitter.com/uzvpLNBTXX</a> —@nspowerinc\n\nRalph Goodale, Minister of Public Safety and Emergency Preparedness, tweeted on Saturday afternoon the Canadian Armed Forces are mobilizing to deploy to assist with recovery after the storm moves through.\n\nAbout 700 military personnel could deploy to Nova Scotia starting Sunday morning to help clear major arteries in order to restore power, the Department of Defence said in a press release.\n\nNova Scotia has requested help with Hurricane Dorian—the Government of Canada’s response is of course YES! The Canadian Armed Forces are mobilizing to deploy to assist with the recovery. —@RalphGoodale\n\nDorian approached Nova Scotia as a Category 2 hurricane, but it is now a post-tropical storm.\n\nWhat's happening out there\n\nAcross the province, strong winds uprooted trees and pulled down power lines.\n\nA crane on South Park Street — a busy roadway in downtown Halifax — snapped in several places from the power of the wind.\n\nA roof on a building on nearby Queen Street blew off and landed on several cars.\n\nIn the water, some boats have been damaged as large waves push them against the rocky shore.\n\nA roof was torn off of a building on Queen Street in Halifax landed on several cars on Saturday. (Craig Paisley/CBC)\n\nFlooding in other areas has damaged cars.\n\nSafety officials were warning storm watchers they are taking a chance getting close to the shoreline to capture images of Dorian.\n\nNova Scotia Power said crews had been out patrolling the lines, but were called down in most of the province as wind gusts started climbing above 90 km/h.\n\n\"If it's unsafe for them to be out there, absolutely,\" said Andrea Anderson, a spokeswoman for the power utility.\n\nAnderson said extra crews have been called in from New Brunswick, Ontario and Quebec to help with more anticipated outages from the storm.\n\n\"We've been watching the storm for a number of days and for a number of days we've been getting ready,\" Anderson said.\n\nCar about to be submerged in Bedford parking lot. <a href=\"https://twitter.com/CBCNS?ref_src=twsrc%5Etfw\">@cbcns</a> <a href=\"https://twitter.com/hashtag/HurricaneDorain?src=hash&ref_src=twsrc%5Etfw\">#HurricaneDorain</a> <a href=\"https://twitter.com/hashtag/Dorian2019?src=hash&ref_src=twsrc%5Etfw\">#Dorian2019</a> <a href=\"https://t.co/EPMtQXRTw2\">pic.twitter.com/EPMtQXRTw2</a> —@CBCcameraman\n\nWaves smashing the shore of Bedford Basin near DeWolf Park. Many boats here taking refuge <a href=\"https://twitter.com/CBCNS?ref_src=twsrc%5Etfw\">@CBCNS</a> <a href=\"https://twitter.com/hashtag/HurricaneDorain?src=hash&ref_src=twsrc%5Etfw\">#HurricaneDorain</a> <a href=\"https://twitter.com/hashtag/Dorian2019?src=hash&ref_src=twsrc%5Etfw\">#Dorian2019</a> <a href=\"https://t.co/i2rmFvillc\">pic.twitter.com/i2rmFvillc</a> —@CBCcameraman\n\nAnderson said there are more than 1,000 personnel staged across Nova Scotia, including linesmen, forestry crew, damage assessors, engineers, supervisors, communications staff and customer care representatives.\n\nThe utility said later Saturday that they have also called in extra staff from other provinces to get power back more quickly.\n\nIf the power goes out during the storm, power customers can expect a wait if conditions are considered unsafe for service crews.\n\n\"As soon as the winds end up in the 90 km/h zone we don't want them out there,\" she said. \"It's not safe.\"\n\nMy family lives a stone's throw from the Mersey River in Liverpool. View from the deck. <a href=\"https://twitter.com/hashtag/nsstorm?src=hash&ref_src=twsrc%5Etfw\">#nsstorm</a> <a href=\"https://t.co/KUTsXHXc8L\">https://t.co/KUTsXHXc8L</a> —@BrittWentzell\n\nThe waves are wild at the breakwater in herring cove. <a href=\"https://t.co/WGQi88lA5v\">pic.twitter.com/WGQi88lA5v</a> —@cbccolleenjones\n\nNova Scotia emergency officials advised people not to drive in the storm.\n\n\"Safety is the primary concern here, stay off the roads, listen to the public officials and their instructions,\" said Insp. Dustine Rodier, operational support and communications for RCMP.\n\nEmergency officials in Halifax said flying debris — flower pots, umbrellas, patio furniture, kids toys — was a big concern with the high winds.\n\n\"In Category 1 force winds, those items can become very dangerous ... things are going to go flying pretty quickly in 140-150 kilometre per hour winds,\" Erica Fleck of Halifax Regional Fire and Emergency said Saturday at noon.\n\nWhere to go if you need to leave home\n\nThe Halifax municipality issued a voluntary evacuation notice to residents who live in some communities along the shore.\n\nA generic water boil advisory is in effect for people drawing drinking water from surface water sources, like lakes. If residents have questions about this advisory, call 1-800-565-1633.\n\nThe Canadian Red Cross opened shelters at noon on Saturday at the Canadian Games Centre, the Dartmouth East Community Centre, and the St. Margaret's Centre. About 150 people were staying at those centres as the day wore on.\n\nThe MacKay and Macdonald bridges closed at 4 p.m.\n\nA storm watcher at breakwater in Herring Cove, N.S. (Craig Paisley/CBC)\n\nCancellations and closures\n\nAll flights in and out of the Halifax Stanfield International Airport on Saturday afternoon and evening were cancelled, and some flights in and out of the J.A. Douglas McCurdy Sydney Airport are cancelled.\n\nMarine Atlantic has postponed many crossings between Nova Scotia and Newfoundland that were originally scheduled for Saturday or Sunday morning and anticipates further cancellations on Sunday and Monday.\n\nBay Ferries has cancelled all crossings between Nova Scotia and P.E.I. on Sunday and expects further disruptions until at least Sunday afternoon, possibly longer.\n\nMany businesses are closed on Saturday. For the latest cancellations, check CBC's Storm Centre Nova Scotia page.\n\nMeteorologists will be live\n\nKeep up-to-date on Hurricane Dorian with the CBC Maritimes live weather blog, updated every day.\n\nMORE TOP STORIES", "description": "More than 400,000 Nova Scotia Power customers were left without electricity as Dorian swept through the region. Canadian Forces members are expected to arrive Sunday morning to help crews restore electricity across the province.", "authors": [], "top_image": "https://i.cbc.ca/1.5274932.1567887414!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/cars-crushed-roof-queen-street-halifax-dorian.JPG", "published_at": "2019-09-07"}