{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/5/nypd-four-homeless-men-killed-overnight-random-ram", "downloaded_at": "2019-10-05 22:58:19.812820+00:00", "title": "Four homeless men killed overnight in Chinatown rampage, suspect in custody: NYPD", "language": "en", "text": "The New York Police Department said Saturday that four homeless men were killed overnight during a series of seemingly random attacks in the heart of the city’s Chinatown district.\n\nA person of interest is in custody in connection with the attacks, which caused a fifth victim to be hospitalized in critical condition, police said at a morning press conference.\n\nThe victims appear to have been attacked while sleeping, and police recovered a metal pipe suspected of being used by the assailants, authorities told reporters.\n\n“The motive appears to be, right now, just random attacks,” said NYPD Deputy Chief Inspector Michael J. Baldassano, who stressed repeatedly that the investigation is still in its early stages.\n\nPolice were notified of the attacks through a 911 call received at 1:49 a.m., said NYPD Stephen J. Hughes, assistant chief of NYPD Manhattan South.\n\nResponding officers found a male victim in laying on the pavement near 2 Bowery Street with severe head trauma who was subsequently declared dead at the scene, as well as a second victim with head trauma who was transported to a local hospital.\n\nTwo witnesses told police that the victims had been attacked by a man wielding a metal object. Officers began canvassing the area for an individual matching the suspect’s description and ultimately found both the person of interest and a metal pipe apparently used in the assaults, said the assistant chief.\n\nPolice searching the area found three additional victims on East Broadway suffering from severe head trauma who were later declared dead, he said.\n\n“At this point, it appears that the victims were sleeping,” added the deputy inspector.\n\nPolice described the person in custody as a 24-year-old homeless male. He was caught a few blocks away from where the victims were found near the intersection of Canal Street and Mulberry in lower Manhattan.\n\nThe NYPD asked anyone with relevant information to contact police.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The New York Police Department said Saturday that four homeless men were killed overnight during a series of seemingly random attacks in the heart of the city's Chinatown district.", "authors": ["The Washington Times Http", "Andrew Blake"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/05/Homeless_Men_Killed_74526.jpg-eda54_c0-75-1800-1124_s1770x1032.jpg?4210582de6d3573c9f07dfdcee9863a820b99366", "published_at": "2019-10-05"}