{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7603853/Mother-smothers-daughter-three-Minnie-Mouse-pillow-took-afternoon-nap.html", "downloaded_at": "2019-10-23 09:52:13.444609+00:00", "title": "Mother smothers daughter, three, with 'Minnie Mouse' pillow while she took an afternoon nap", "language": "en", "text": "A mother smothered her three-year-old daughter to death with a 'Minnie Mouse' pillow while she was taking a nap after becoming 'obsessed' with her autism diagnosis, a court has heard.\n\nThe woman, from Ireland, had googled 'mothers killing autistic children', 'drowning' and 'sentence for murder' on her phone in the days leading up to the incident in February 2018, the Central Criminal Court heard.\n\nA jury was told how the mother, who cannot be named, described to the gardaí how she held the pillow over her daughter's face who struggled, screamed and called out for her father before letting out a sigh, a jury heard.\n\nShe has pleaded not guilty by reason of insanity to the murder of the three-year-old girl - after a psychiatrist ruled she was suffering with 'recurrent depressive disorder'.\n\nThe Central Criminal Court heard how the woman, who cannot be named, had googled 'drowning', 'mothers killing autistic children' and 'sentence for murder' on her phone\n\nThe woman had described the weeks before the murder as a 'living nightmare' where she felt 'desperate', 'overwhelmed', 'in a panic' and 'totally alone' after her daughter was diagnosed with autism, the court heard.\n\nShe had convinced herself her child had a more severe form of autism despite a diagnosis in January 2018 which found she was at the milder end of the spectrum.\n\nProsecuting counsel Paul Murray SC read a statement from the woman's husband to the court which said he had left his daughter happily at home watching cartoons the day of the killing.\n\nHe said his wife had found a form of autism called Pathological Demand Avoidance (PDA) on the internet and 'immediately convinced herself that was what the child had'.\n\n'She had not completed her assessment but at the very worse she had mild autism', said the husband.\n\nThe husband said he never blamed his wife for what happened to their child, as he knew it had to be a psychiatric event that she was having and depression had caused it.\n\nThe mother's sister said in a statement read to court that she was 'always' on the internet researching autism, and was unable to sleep and became angry and stressed in the weeks leading up to the incident.\n\nAnother sibling said they received a WhatsApp message in February 2018 saying she was 'cracking up' and was unable to handle the diagnosis.\n\nThe mother smothered he daughter on February 13 2018 half an hour into her afternoon nap and said she intended for her to die.\n\nShe then rang 999 and told them she had tried to suffocate her child before trying to revive her - but said her child had looked grey.\n\nIn interviews with the gardaí, she said: 'I was thinking why am I doing chest compressions when I put a pillow over her head'.\n\nThe mother said she had previously thought of ways to kill her, including taking her to a beach and drowning her and had searched 'mothers killing autistic children' on her phone in the days leading up to the killing.\n\n'I wasn't in the best place, I did love her very much. I just wanted the best for her and to be as happy as possible. It was all go go go, I had to do it,' she said in an interview.\n\nAsked if she had something to say to her child, she replied: 'I would say I'm so, so sorry.'\n\nIn cross-examination, Garda Declan Hartley agreed with defence counsel Patrick Gageby SC that the woman was a very good mother to her children and put them first.\n\nDr Sally Linehan, a consultant psychiatrist from the Central Mental Hospital, gave evidence that the woman first experienced mental health frailties in college.\n\nWhen her daughter was diagnosed with autism, she said she felt like it was the end of the world and could not accept she had a mild diagnosis, the court was told.\n\nThe woman's husband said that in the weeks prior to the event, she started texting everybody and saying the situation was catastrophic, explained the witness.\n\nShe had been experiencing depressive symptoms in the months leading up to the killing and experienced a 'morbid preoccupation' with the issue of her child's diagnosis, as well as irrational thoughts.\n\nThe woman's mental health deteriorated when her child's autism was diagnosed and she developed a conviction that she must kill her, said the witness.\n\nShe was experiencing a relapse of her depressive illness and was suffering from a mental disorder at time of the offence, she said.\n\nThe woman did not know what she was doing was wrong and was unable to refrain from committing the act, Dr Linehan continued, adding that she was satisfied the accused fulfils the criteria of not guilty by reason of insanity.\n\nThe trial continues today.", "description": "The woman, from Ireland, had googled 'mothers killing autistic children' and 'sentence for murder' on her phone before the incident in February 2018, the Central Criminal Court heard.", "authors": ["Sophie Law For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/09/20072914-0-image-a-6_1571819199912.jpg", "published_at": "2019-10-23"}