{"pub": "yahoo", "url": "https://news.yahoo.com/russian-north-korean-state-media-162017024.html", "downloaded_at": "2019-10-09 19:06:09.476394+00:00", "title": "Russian and North Korean state media join forces to fight 'fake news'", "language": "en", "text": "Kim Jong-un inspects an army farm in a photo released by North Korea's state news agency on Wednesday - AFP\n\nNorth Korea and Russian state media have joined forces to fight “fake news” about topics including Pyongyang's contentious relationship with Washington.\n\nWearing loyalty badges of Kim Il-sung and Kim Jong-il, the directors of the Korean Central News Agency and the TASS news agency signed a cooperation agreement on Tuesday during a visit to Pyongyang by a Russian delegation that also included the head of Channel One state television.\n\n“We increasingly often see misrepresentation of information in the news environment, and we must counter the dissemination of such fake news,” said central news agency director Kim Chan Gwang. “I believe that KCNA and TASS news agencies must join efforts towards this goal.”\n\nWhile he didn't specify what “fake news” he meant, the head of the North Korean foreign ministry's information department on Monday praised TASS and Channel One for “fairly and objectively” reporting the “principal positions of the leadership of the people's republic in Korean-American relations”.\n\nAn attempt to resume stalled denuclearisation talks between the United States and North Korea collapsed in Stockholm on Saturday. Kim Jong-un's regime launched a ballistic missile off of its coast last week.\n\nThe KCNA's propaganda-heavy coverage suggests that almost any statement that differs from the Pyongyang line would be considered fake news. An article on Wednesday about Korean War commemorations south of the border thundered that “the South Korean authorities' rhetoric about reconciliation and peace only prove that they are false trumpeting to cover up their dark intention of escalating confrontation”.\n\nStudents dance on Tuesday to mark the anniversary of Kim Jong-il's election as general secretary of the Workers' Party of Korea Credit: Kim Won Jin/AFP via Getty More\n\nFour of the 10 “top news” items on the KCNA website were stories about Kim receiving gifts, greetings and floral baskets on the 74th anniversary of the Workers' Party of Korea.\n\nRussian state media similarly accuses the West often of hypocrisy and hostile plots. After the downing of Malaysia Airlines flight 17 by a Russian missile in eastern Ukraine, state media deflected blame with a raft of wild conspiracy theories, and they portrayed the Salisbury poisoning accusations as a groundless “provocation” against Moscow.\n\nOnly Turkmenistan ranked lower than North Korea in the Reporters Without Borders 2019 press freedom index, while Russia came in at 149.\n\nWhile AP and AFP have Pyongyang bureaus, government minders severely limit their reporters' movements and contacts. An Australian student who had posted photographs and written articles about the North Korean food and culture was expelled from the country in June on spying accusations.\n\nTASS, which has been granted two written interviews with Kim Jong-un, said on Wednesday it hopes to expand its bureau in the country to include a photography desk.\n\nThe Russian delegation also attended a “Country of the People” patriotic gymnastics show performed by 30,000 North Koreans and were informed by top officials that Pyongyang fully supported Vladimir Putin's “policies for defending the sovereignty of Russia”.\n\nVladimir Putin and Kim Jong-un toast during the first meeting in Vladivostok in April Credit: Alexei Nikolsky/Sputnik, Kremlin Pool Photo via AP More", "description": "North Korea and Russian state media have joined forces to fight “fake news” about topics including Pyongyang's contentious relationship with Washington. Wearing loyalty badges of Kim Il-sung and Kim Jong-il, the directors of the Korean Central News Agency and the TASS news agency signed a cooperation", "authors": ["Alec Luhn"], "top_image": "https://s.yimg.com/uu/api/res/1.2/G63DOBjT1WDe_KJDyiBlSQ--~B/aD0xNTYzO3c9MjUwMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_258/23569a0b6164e1fd9d596e2e0b4acb13", "published_at": "2019-10-09"}