{"pub": "abcnews", "title": "Mattel adds Rosa Parks and Sally Ride Barbie dolls for Inspiring Women series", "url": "https://abcnews.go.com/US/mattel-adds-rosa-parks-sally-ride-barbie-dolls/story?id=65197815", "language": "en", "published_at": "2019-08-26", "downloaded_at": "2019-09-02 07:07:07.865660+00:00", "text": "Rosa Parks and Sally Ride are joining an impressive list of famous females who have been made into Barbies.\n\nThe two women, who both played profound roles in history, are being added to the brand's Inspiring Women series. The two new dolls were introduced online Monday.\n\nMattel via Twitter\n\nThe collectible Rosa Parks doll features the courageous risk-taker in a floral print dress with a gray coat, white gloves and small black clutch handbag.\n\n\"Hailed as 'the Mother of the Modern Civil Rights Movement,' Rosa Parks earned worldwide recognition and numerous awards including the prestigious Presidential Medal of Freedom and Congressional Gold Medal of Honor. Celebrate Rosa Parks and her impact on the civil rights movement with this Inspiring Women Series Rosa Parks Barbie doll,\" the product description reads.\n\nPre-orders for the Rosa Parks doll are available on Barbie.com and will ship Sept. 6, according to the Barbie website.\n\nMattel via Twitter\n\nThe Sally Ride doll, a tribute to the first American woman in space, is featured in a NASA flight suit with headset, helmet and boots.\n\nRide is celebrated for her \"pioneering accomplishments\" that \"inspire girls everywhere to boldly reach for the stars,\" the product description says.\n\nThe Inspiring Women series \"pays tribute to incredible heroines of their time; courageous women who took risks, changed rules and paved the way for generations of girls to dream bigger than ever before,\" according to Barbie-maker Mattel.\n\nEach collectible costs $30.99 and includes the doll and accessories, a doll stand, and a certificate of authenticity.", "description": "Rosa Parks and Sally Ride are joining an impressive list of famous females who have been made into Barbies.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/rosa-parks-barbie-ht-jef-190826_hpMain_16x9_992.jpg"}