{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/04/ex-tory-leadership-candidate-rory-stewart-standing-down-to-run-for-london-mayor", "downloaded_at": "2019-10-05 05:46:14.829726+00:00", "title": "Ex-Tory Leadership Candidate Rory Stewart Standing Down", "language": "en", "text": "Defeated Conservative Party leadership candidate Rory Stewart is standing down at the next general election so he can run as an Independent in the London mayoral elections.\n\nThe 46-year-old MP also announced Friday he has walked away from the Conservative Party.\n\nStewart told the world of his plans when he Tweeted: “It’s been a great privilege to serve Penrith and The Border for the last ten years.”\n\nHe was expelled from the Conservatives in the Commons along with 20 other Brexit rebels, but remained a member of the party.\n\nWriting for his local newspaper, the Cumberland and Westmorland Herald, he went on: “As you will be aware, I am no longer allowed to run as Conservative MP in Penrith and The Border.\n\n“Because I have loved the constituency so much, I had considered standing as an Independent; but I have decided that I wouldn’t want to run against those Conservative members who have been such wonderful colleagues over the last 10 years.”\n\nStewart is not leaving the political fray however. He has other plans:\n\nI am running as an Independent candidate for Mayor of London, and here’s why. Please join me in my campaign: https://t.co/8y3xWpl9hY#Rory4London pic.twitter.com/jnaNy8IF0s — Rory Stewart (@RoryStewartUK) October 4, 2019\n\nHis decision to run for mayor of London will surely come as a surprise to his supporters and maybe even himself after he made this recent declaration:\n\nLots of speculation out there – so to be completely clear my one hundred per cent focus is on ensuring that we avoid crashing out with a damaging unnecessary No-Deal Brexit on 31st Oct. The only thing I am launching next week is my 4 year old’s model boat. — Rory Stewart (@RoryStewartUK) September 29, 2019\n\nThe former cabinet minister made an outsider run for the party leadership against Johnson earlier this year that ultimately fell well short of success, as Breitbart News reported.\n\nThe Eton graduate and former Labour member is on the record saying the only Brexit deal he would attempt to deliver would be the one laid out in Mrs May’s thrice-rejected withdrawal treaty with the bloc, and that he would not back a clean break if this could not be delivered.\n\nBefore embracing politics, Stewart combined military service with diplomacy.\n\nHe told the New Yorker magazine in 2010 how Prince Charles once asked him to tutor his sons William and Harry.\n\nHe developed “The Lawrence of Arabia” moniker from a book he wrote about his walk across Afghanistan “with only a toothless mastiff for company” in 2002.\n\nThe experience was recounted in a 2004 book The Places In Between.\n\nHe was appointed a deputy governor in southern Iraq after the US-led 2003 invasion and had previously served as Britain’s representative in Montenegro after the 1999 Kosovo war.\n\nAll this has led to speculation that Stewart — like his father — was a member of the MI6 foreign intelligence service. He denies it.\n\nIn government, he was a minister for international development and Africa, and also prisons.", "description": "Defeated Conservative Party leadership candidate Rory Stewart has said he will be standing down at the next general election.", "authors": ["Simon Kent"], "top_image": "https://media.breitbart.com/media/2019/06/rory-640x335.png", "published_at": "2019-10-04"}