{"pub": "washingtonpost", "url": "https://washingtonpost.com/technology/2019/10/24/tiktok-raises-national-security-concerns-congress-schumer-cotton-ask-federal-review", "downloaded_at": "2019-10-24 15:02:08.442709+00:00", "title": "TikTok raises national security concerns in Congress as Schumer, Cotton ask for federal review", "language": "en", "text": "“With over 110 million downloads in the U.S. alone, TikTok is a potential counterintelligence threat we cannot ignore,” wrote Schumer and Cotton, who sits on the Senate Intelligence Committee. “Given these concerns, we ask that the Intelligence Community conduct an assessment of the national security risks posed by TikTok and other China-based content platforms operating in the U.S. and brief Congress on these findings.”\n\nAD\n\nAD\n\nA spokesperson for ByteDance, the Chinese conglomerate that owns TikTok, did not respond to a request for comment.\n\nThe request adds to growing regulatory headaches in the United States for TikTok, whose meteoric rise has coincided with heightened political tensions between Washington and Beijing, driven largely by a long trade war that has hurt both nations’ economies.\n\nThe dispute also has ensnarled U.S. corporate giants, including the National Basketball Association, whose attempts to appease China have angered American lawmakers and others who question whether the sports league is capitulating on political expression and freedom of speech.\n\nChina’s growing tech industry and global ambitions long have been characterized as a threat by the U.S. government and Silicon Valley, which argue that a shift in technological dominance to the world’s second-largest economy could imperil American business, research and national security. Facebook chief executive Mark Zuckerberg raised similar concerns in a speech in Washington last week, fearing the Chinese government’s “Great Firewall” might affect even what U.S. users of Chinese-based apps might consume.\n\nAD\n\nAD\n\nIn their letter, Schumer and Cotton questioned TikTok’s terms of service, saying the app collects a wide array of data, including information about a user’s location. TikTok officials say U.S. users’ data is stored in the United States, but the lawmakers said they feared that TikTok “is still required to adhere to the laws of China.”\n\nThat could “compel Chinese companies to support and cooperate with intelligence work controlled by the Chinese Communist Party,” they wrote.\n\nSchumer and Cotton further raised the possibility that TikTok follows Chinese censorship regulations and limits videos on sensitive political topics, including recent protests in Hong Kong. A review of TikTok conducted by The Washington Post earlier this year found that the service carried far fewer videos related to those demonstrations than other popular social media sites such as Twitter.\n\nAD\n\nAD\n\nAnd the lawmakers said that TikTok could be a “potential target of foreign influence campaigns like those carried out during the 2016 election on U.S.-based social media platforms.” Russian-backed agents spread disinformation on Facebook, Twitter and other social media sites in the last presidential election, and Facebook recently revealed a new Russia-based effort targeting the 2020 race.\n\nTikTok has declined repeatedly to discuss its content-moderation policies, including those involving disinformation.\n\nThe letter to Maguire marks the second congressional request for the government to delve into TikTok. Earlier this month, Sen. Marco Rubio (R-Fla.) called on the Committee on Foreign Investment in the United States, which reviews the national-security implications of foreign acquisitions, to investigate the 2017 purchase by ByteDance of Musical.ly, an app that ByteDance merged with its own offering to create TikTok.\n\nAt the time, Rubio said the “Chinese government’s nefarious efforts to censor information inside free societies around the world cannot be accepted and pose serious long-term challenges to the U.S. and our allies.”\n\nAD", "description": "Senate Minority Leader Chuck Schumer and Republican Sen. Tom Cotton asked U.S. intelligence officials on Wednesday to probe TikTok, expressing fears that the Chinese-owned social-networking app poses \"national security risks.\"", "authors": ["Tony Romm", "Senior Tech Policy Reporter", "Drew Harwell", "Reporter Covering Artificial Intelligence"], "top_image": "https://www.washingtonpost.com/resizer/0UII8tla04tFV-54paSAGLj7QGE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/N2WSXLHGZMI6TMFGHUBXEG4F54.jpg", "published_at": "2019-10-24"}