{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7623741/Texas-man-TWICE-convicted-murdering-high-school-sweetheart-walk-free.html", "downloaded_at": "2019-10-29 14:31:33.214046+00:00", "title": "Texas man who has TWICE been convicted of murdering his high school sweetheart could walk free", "language": "en", "text": "A Texas man who has twice been convicted of murdering his pregnant wife could still walk free after his upcoming third trial in a bizarre case that will be featured on this week's episode of 20/20.\n\nDavid Temple was a local high school football star who married his cheerleader girlfriend Belinda after they graduated from Katy High School, where actress Renee Zellweger was also a student.\n\nThe two seemed to have the perfect relationship until Temple came home and reported his wife had been shot dead on January 11, 1999.\n\nShe was eight months pregnant at the time.\n\nScroll down for video\n\nSweethearts: David Temple was found guilty in 2007 and later in 2019 of the murder of his wife Belinda, who was shot dead execution style in 1999 while at her home (couple above at their wedding)\n\nNew love: He was found guilty in 2007 and 2019 of murder, but the first conviction was overturned when the prosecutor withheld evidence (Temple and his now-estranged mistress Heather)\n\nBelinda and David were high school sweethearts at Katy High School, with is also Rene Zellweger's alma mater (Zellweger above)\n\nNo arrests were made in the aftermath of the execution-style killing, but Temple did marry his mistress and start a new life until advancements in DNA testing allowed investigators to take another look at the case.\n\nDefense attorneys alleged at trial he shot Belinda with a shotgun he secretly took from his father but Sanders denies any involvement in her murder and was cleared as a suspect during the investigation into her death.\n\nThose attorneys then claimed that Temple tossed the gun and staged the crime scene before calling police.\n\nThe jury that convicted Temple, a former high school football coach, for a second time in his pregnant wife’s killing could not decide on a sentence.\n\nAs a result, a mistrial was declared in August.\n\nThe conviction still stands, but a new jury will have to be seated to determine the sentence.\n\nProsecutors are seeking a life prison term.\n\nTragedy: Prosecutors believe he shot his wife and staged the scene, and will discuss the case in detail on Friday's episode of 20/20 on ABC (Belinda's body above)\n\nMore claims: David is now pointing the blame at a neighbor for allegedly sneaking in and trying to rob the home\n\nGone girl: At the start of David’s second trial earlier this year, Heather filed for divorce\n\nHe was sitting in prison after his 2007 trial when his conviction was suddenly overturned five years later.\n\nThat was a result of Temple's attorney receiving a tip from a man who claimed that a 16-year-old neighbor may have been involved in Belinda’s murder.\n\nAfter evidence came to the attention of David’s defense team that had been withheld by the prosecution, the Texas Court of Criminal Appeals threw out David’s first conviction in 2016, entitling him to a new trial.\n\nAt the start of David’s second trial earlier this year, Heather filed for divorce.\n\nDuring that second trial Sanders maintained that he did not kill Belinda, and David was found guilty for the second time in August.\n\nConsidering a range from probation to life in prison, the jury was hung on the sentence after more than 20 hours of deliberations.\n\nThe judge declared a mistrial, and the retrial on the punishment phase is currently scheduled for March 2020.\n\n20/20 airs Friday at 9pm on ABC.", "description": "David Temple was a local high school football star who married his cheerleader girlfriend after they graduated from Katy High School, where actress Renee Zellweger was also a student.", "authors": ["Chris Spargo For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/13/20324458-0-image-a-2_1572354049094.jpg", "published_at": "2019-10-29"}