{"pub": "politico", "url": "https://politico.com/magazine/story/2019/09/03/climate-change-democratic-candidates-2020-227910", "downloaded_at": "2019-09-03 23:41:21.432989+00:00", "title": "Climate Change Could Be a Problem in 2020 ... for Democrats", "language": "en", "published_at": "2019-09-03", "text": "Michael Grunwald is a senior staff writer for Politico Magazine.\n\nElissa Slotkin has learned that climate change is both a national emergency and a political opportunity. As an assistant secretary of defense under President Barack Obama, she helped lead the Pentagon’s first study of how climate change threatens U.S. military bases. Then as a Democratic candidate for Congress in 2018, she attacked her Republican opponent for questioning the scientific consensus on climate change—and that’s one reason she’s now a Democratic member of Congress.\n\n“We talk about the weather all the time in Michigan, and we all know it’s getting weird,” she says. “To most people, straight-out denial feels extreme.”\n\nStory Continued Below\n\nBut even though Slotkin has shown how the climate crisis can be a winning issue, she’s not on board with the most prominent progressive effort to make it a national issue, the Green New Deal, backed by her more famous House classmate Rep. Alexandria Ocasio-Cortez. She thinks it’s too radical, too polarizing, a gift to President Donald Trump and other Republicans who want to portray Democrats as socialists. “My district is very worried that Democrats are lurching to the left,” she says. “I know AOC’s face will be on every ad against me in 2020.”\n\nSlotkin doesn’t see why a plan to fix the climate needs to promise universal health care and a federal job guarantee, and she doubts a lefty wish list disguised as an emergency response will play well in her suburban Michigan swing district, which Trump won by seven points.\n\n“I’m a pragmatist, and I represent a lot of pragmatic people,” says Slotkin. “Why say we need massive social change to reduce emissions? How does that build consensus?”\n\nThe politics of climate change are changing fast, partly because global heat waves, fires in California and the Amazon, Midwestern floods and increasingly brutal storms keep focusing attention on its nasty consequences, and partly because the Green New Deal has thrust it to the center of the national conversation. Polls suggest climate change has emerged as one of the top two policy priorities for Democratic voters, rivaled only by health care. The party’s presidential candidates are releasing remarkably aggressive plans to wean America off fossil fuels, which they discussed briefly during each Democratic primary debate in Miami and Detroit this summer, and will debate in more detail at forums devoted exclusively to climate on CNN and MSNBC in September.\n\nMeanwhile, even though Trump is an unapologetic climate-science denier and fossil-fuel promoter who has claimed that wind turbines cause cancer, other Republicans are retreating to more nuanced and factually defensible positions, acknowledging that greenhouse-gas emissions are a problem while calling for “innovation” and “adaptation” (as opposed to Green New Deal-style economic transformation) to deal with them. Corporate America is evolving, too. Dozens of big companies—including oil majors like BP and Shell—descended on Capitol Hill this spring to lobby for modest carbon taxes, responding to pressure from their shareholders and the public to support some kind of climate action.\n\nAs a rift builds between Republicans who do or don’t want to acknowledge climate change as a problem, another wedge is growing between Democrats who support radical solutions and those, like Slotkin, who want somewhat less radical solutions. It is mainly playing out through the internal battle over the Green New Deal, which so far is more of a call for dramatic action to reduce greenhouse-gas emissions than a specific legislative agenda, but has been effectively branded by conservative outlets like Fox News as a leftist crusade to ban meat and air travel.\n\nIt’s not a coincidence that Trump has vowed to run for re-election against the Green New Deal, or that Senate Republicans gleefully forced a vote on it, or that no Senate Democrats dared to vote yes. Even liberal House speaker Nancy Pelosi, while supporting deep emissions cuts and denouncing Trump’s efforts to pull the United States out of the Paris climate accord, has declined to endorse “the green dream or whatever.”\n\nActivists often say climate change shouldn’t be a partisan issue, but in the U.S. it still is. Democratic-controlled states like New York, California, Washington, New Jersey, New Mexico, Nevada and Maine have all passed sweeping bills requiring economy-wide climate neutrality by 2050 or earlier. States where Republicans hold power haven’t passed legislation like that, and the Republican Senate minority in blue Oregon managed to block a similar bill by fleeing the state to avoid a quorum. Sen. Brian Schatz of Hawaii, who chairs a new Democratic committee on the climate crisis, devoted an entire hearing in July to conservatives who support climate action, and he’s hopeful about some modest bipartisan efforts to promote clean energy infrastructure and research. But Schatz says it’s far more important for the health of the planet for Democrats to defeat Trump in 2020 and take full control of Congress.\n\n“As a practical matter, 2020 will decide whether we re-enter the realm of responsible nations, or not,” Schatz says. “It’s not a super-complex policy question. Climate is going to be on the ballot, and Democrats just have to win.”\n\nThe question is whether the current politics of climate is making that more or less likely. The Intergovernmental Panel on Climate Change, widely considered the scientific gold standard on the issue, has called for “rapid, far-reaching and unprecedented changes in all aspects of society” to slash emissions. But it can be politically risky to support rapid, far-reaching and unprecedented changes in all aspects of society. The Washington establishment seems convinced that as a generic long-term issue requiring politicians to do something, climate change makes Republicans look out of the mainstream, but as a demand for massive upheaval on a tight planetary timeline, the Green New Deal makes Democrats look just as far out of the mainstream.\n\nWhere the 2020 Dems stand on the issues: Climate Change\n\nAnd it’s exposing real tensions inside the Democratic Party—between center and left, congressional leaders and insurgents, labor groups and green groups, and even among various factions inside the Green New Deal movement.\n\n\n\n***\n\nIn the past, climate was rarely more than a check-the-box afterthought on the campaign trail, so it’s notable that it has finally broken through as a top-tier issue for Democratic voters. In one CNN poll, 96 percent of registered Democrats and Democratic-leaning independents said it was important that a presidential candidate support aggressive action against climate change, higher than any other issue; in several other polls, climate change has been cited as the number-two Democratic priority, ahead of guns, jobs and education, just behind health care.\n\n“That’s worth underlining and bolding and italicizing,” says Anthony Leiserowitz, the director of the Yale University Program on Climate Communication.\n\nThe Democratic presidential field has absorbed the message; one potential problem with the CNN and MSNBC climate-only quasi-debates might be the lack of substantive disagreements for the candidates to debate. Until he dropped out of the race last week, Washington governor Jay Inslee had built his entire campaign around climate, billionaire Tom Steyer is a top funder of climate activism, and populist senators Elizabeth Warren and Bernie Sanders have called for a war on fossil fuels. Even former vice president Joe Biden, who was attacked from the left over early reports that he’d carve out a “middle ground” on climate, has unveiled a plan to decarbonize the entire country by 2050.\n\nThere are subtle differences among the candidates, mostly involving the specificity of their plans and their willingness to embrace “keep-it-in-the-ground” fossil-fuel policies that pro-pipeline construction unions oppose. But all the Democrats represent a stark contrast with Trump, who has appointed like-minded fossil-fuel advocates throughout his administration and the judiciary, made the U.S. the only nation to reject the Paris accord, routinely attacked climate-friendly pollution and efficiency regulations, and publicly dismissed the National Climate Assessment released by his own administration as left-wing “deep state” alarmism.\n\nStill, even though Trump has made headlines with his attacks on Obama’s climate policies and his mockery of climate science, and even though the floods ravaging Midwestern farms and the heat wave broiling Europe have highlighted the urgency of the climate issue, it probably wouldn’t have risen this high on the political agenda if Ocasio-Cortez hadn’t become Capitol Hill’s top celebrity. Democratic leaders may be annoyed that she gets so much press, and the president may enjoy using her outspoken “Squad” of left-wing women of color as foils, but her Green New Deal has called more attention to climate than any phenomenon since the 2006 Al Gore documentary An Inconvenient Truth. It’s also mobilizing the green young voters Democrats will need to beat Trump in 2020—even if it’s mobilizing them with rhetoric and tactics that make establishment Democrats uncomfortable.\n\nThe youth-oriented Sunrise Movement was an obscure year-old organization with just 20 chapters when Ocasio-Cortez stopped by its climate sit-in at Pelosi’s office last November. It now has more than 200 active chapters that have held town halls all over the country, building pressure for the Green New Deal, accusing their elders in both parties of consigning their generation to a fossil-fueled dystopia. The IPCC has called for drastic emissions reductions by 2030 to avoid the worst climate scenarios, and with U.S. emissions rising under Trump, groups like Sunrise argue that gradual and incremental political changes are not going to cut it.\n\n“We’re at the start of a paradigm shift, and it’s wild,” says 29-year-old Rhianna Gunn-Wright, who helped craft the Green New Deal resolution as policy director for the progressive think tank New Consensus. Gunn-Wright says younger voters have just as little patience for half-measures, delay, and “hand-wringing from moderates” as they have for Trump’s snide how-about-that-global-warming tweets on cold days. “People want action now,” Gunn-Wright says. “Calling the people trying to solve the problem socialists might work for a while, but it’s going to get tougher and tougher to say we can’t afford to address this crisis.”\n\nShe may be right that the long-term politics of climate favor action, but in the short term it matters a lot whether calling climate-friendly Democrats socialists will work for Republican candidates in 2020. Some politicians in both parties believe the issue could play out the way gay marriage did in 2004, rallying the conservative Republican base and helping to re-elect a conservative Republican president even though large majorities later came to agree with the Democrats. Democrats may be magnifying their problems with a circular firing squad, as the establishment echoes Republican talking points about left-wing extremism while the left attacks even minor deviations from Green New Deal purism as shameful inaction.\n\n“Denying the science is not a sustainable position, and more Republicans need to face reality on this issue,” says Rep. Garrett Graves of Louisiana, the ranking Republican on the new House committee investigating climate change. “But there’s a civil war happening on the Democratic side, too. If the Green New Deal can’t get a single vote in the U.S. Senate, they obviously haven’t figured this out, either.”\n\nIn fact, six months after the Green New Deal resolution was unveiled, with far-reaching climate goals but few specific climate policies, its supporters have yet to introduce substantive legislation for achieving those goals. Meanwhile, House Democrats skeptical of the Green New Deal have introduced two alternative green blueprints, both calling for net-zero emissions by 2050, but those are also primarily plans to have a plan, not actual plans. So far, the political sweet spot seems to be to announce a climate-friendly destination without detailing exactly how to get there.\n\n\n\n***\n\nIn the past, climate change has been such an unsexy campaign issue that there has never even been a question about it in a general-election debate. In 2012, CNN moderator Candy Crowley said she considered including one for “you climate change people,” as if the broiling of the planet were a niche concern for tree-huggers, but decided it would have distracted from her focus on the economy. In 2016, one town-hall debate did include one thoughtful question about energy and the environment, but the question was overshadowed by an Internet furor over the questioner, a cardigan-clad insta-celebrity named Ken Bone.\n\nIn 2018, though, climate was a key theme for Democratic congressional candidates such as Slotkin and Harley Rouda of California, a moderate who successfully challenged the eccentric conservative Republican Rep. Dana Rohrbacher. Rouda considers climate “the number one issue facing humankind,” and he knew it mattered to voters in his coastal Orange County district, where rising seas have forced local officials to raise a seawall on Balboa Island. “Climate is a bigger infrastructure issue here than widening the 405,” he says. Rouda also saw climate as an ideal way to paint Rohrbacher as an extremist who, when he wasn’t floating conspiracy theories that Democrats organized the neo-Nazi rally in Charlottesville or suggesting that homeowners should be able to discriminate against gays, was dismissing climate change as “liberal claptrap” and suggesting that carbon emissions actually help the planet.\n\n“It fit in with the outlandish stuff he said every day,” says Rouda, who now chairs the House’s key subcommittee on environmental oversight. “And it really resonated with everyone who wasn’t a hard-core Trump supporter.”\n\nClimate denial was not always a Republican value. As recently as 2008, the Republican presidential nominee against Obama, John McCain, campaigned on a cap-and-trade plan to rein in carbon emissions, while former GOP Speaker Newt Gingrich and Democratic Speaker Nancy Pelosi filmed an ad for Gore’s non-profit in which they sat on a sofa and agreed that climate action shouldn’t be partisan. Things changed after Obama’s election and the rise of the Tea Party, as Washington Republicans came together to shoot down Obama’s cap-and-trade plan and climate became a new battleground in America’s political culture wars. Conservative media routinely portrayed global warming as a loony-lefty scam for the Birkenstock crowd, and the few Republican politicians who embraced the science tended to become ex-politicians.\n\nTrump amped up that skepticism as a candidate, dismissing climate change as a hoax manufactured in China while pledging to restore the coal industry to its former glory. That hasn’t happened during his presidency, but not for lack of trying. His administration has pushed hard to ease rules limiting pollution by coal plants and other fossil-fuel interests, heavy industry, agriculture and other major emitters of greenhouse gases. The president often portrays the climate movement as an elitist plot against the American economy; his top climate adviser compared the campaign against carbon to Nazi Germany’s “demonization of the poor Jews.”\n\nStill, Trump’s advisers can read the polls suggesting voters outside his base are concerned about his anti-environmental record, which helps explain an unusually defensive speech he recently delivered highlighting America’s relatively clean air and water. He’s particularly out of step with young Republicans; more than one third of his own supporters under 40 disapprove of his brazen denial of climate science, which helps explain why some Republicans who can usually be relied on to defend his policies are distancing themselves from his stance on global warming.\n\nClearPath director Rich Powell, whose group advocates conservative approaches to climate action, says there’s been a “sea change” among congressional Republicans, with consensus-builders replacing bomb-throwers atop several key committees, and back-benchers who represent coastal states and suburban districts starting to endorse climate policies beyond “no.” In recent months, Republican stalwarts have proposed tax credits for clean-energy innovation, investments in clean-energy research, and modest carbon taxes to encourage a shift away from emissions. Even Rep. Matt Gaetz (R-Fla.), a staunch Trump ally from a district along the Gulf of Mexico, unveiled a “Green Real Deal” that would accelerate renewable energy projects on public lands and upgrade the electric grid, while urging his Republican colleagues to “support a solution, not just stick their heads in the sand.”\n\n“That’s a sign of the times,” Powell says. “Swing voters really care about this. Even for the base, dismissing climate change isn’t necessarily a slam dunk.”\n\nIn fact, some Democrats are worried that the new GOP rhetoric on climate could help blur partisan distinctions on the issue in 2020, shifting the debate from basic science to complex policy. In an interview before he launched his White House run, Steyer argued that Republicans who acknowledge climate science but call for more study or warn against economically disruptive responses are as committed to inaction as outright deniers. But he acknowledged that the yes-but crowd might sound more compelling to low-information voters than the hell-no crowd.\n\n“It’s like the civil rights movement. It’s almost better to have Bull Connor on the other side, so everyone understands the enemy,” Steyer said. “It’s one thing when they say: ‘The earth is flat.’ But when they say, ‘Oh, we’re reasonable, but you crazy socialist eggheads are going to kill millions of jobs,’ the politics are tougher.”\n\nThe politics are especially tough when Fox News is hammering away at the crazy-socialist-egghead message. Polls show that frequent Fox watchers hear much more about the Green New Deal than other Americans do, and dislike it much more than other Americans do. Data for Progress, another liberal group pushing the Green New Deal, has found in its focus groups that Fox messaging is having a powerful effect, with many voters associating the plan with “cow farts” and a tendentious “$93 trillion price tag” that Fox personalities keep flogging. Fossil fuel interests have also poured money into PR campaigns and think tanks pushing against climate action; Steyer says he started intervening in energy-related state ballot initiatives because environmental groups were getting outspent by 25-to-1.\n\n“We’re up against a very effective and centralized propaganda machine, and we need to fight back,” says Julian Brave NoiseCat, a 26-year-old indigenous rights activist who is now the strategic director at Data for Progress. “We can’t just remain in a defensive crouch, and that’s what Democratic leaders in Congress have done.”\n\nNoiseCat’s dissatisfaction reflects another challenge for climate politics, the divisions within the Democratic Party. And those divisions have less to do with the substantive details of climate policy than contrasting visions of what the party is about, how the party should behave, and who is going to decide.\n\n\n\n***\n\nWhether or not they support the Green New Deal, most Democrats support aggressive investments in wind and solar power, energy efficiency, electric vehicles, public transit, and just about any other proven approach to reducing emissions. Similarly, most Democrats want to reduce government subsidies and other support for fossil fuels, tighten regulations on carbon and other pollutants, and undo just about everything Trump has done in the climate arena.\n\nThere are some internal disputes about whether to encourage carbon-free nuclear power or technology to capture carbon from fossil-fuel plants, how much climate policy should rely on market-oriented solutions like carbon taxes or cap-and-trade, and how aggressively to pursue keep-it-in-the-ground policies on federal and private land. But the Green New Deal was careful to sidestep those disputes, proclaiming the need for spectacularly ambitious changes without spelling them out.\n\n“The truth is, the situation is so dire that we don’t need to argue which of these policies is best,” Schatz says. “We literally need to do all of them.”\n\nStill, the arguments persist, and they help explain why congressional Democrats have been so vague about their climate policies. They also could cause problems for the party’s presidential nominee, who will irritate some Democrats whether he or she comes out as pro-nuclear, anti-nuclear or somewhere in between. The troubling reality of climate math has created an internal dynamic where just about any candidate’s plan can be criticized as inadequate by activists who don’t like the candidate. When Beto O’Rourke unveiled a far-reaching $5 trillion plan to zero out emissions by 2050, exactly what the scientists on the Intergovernmental Panel on Climate Change have recommended, the Sunrise Movement trashed it as weak sauce that would fail to “give our generation a livable future.”\n\nClimate wonks complained publicly that O’Rourke was being punished for echoing the science, and several climate activists grumbled privately that their movement was being hijacked by Sanders fans who cared more about a socialist takeover of the Democratic Party than serious emissions reductions. “Are we in this to do climate, or are we in this to nationalize industry?” one Green New Deal activist asked me. Sunrise later backed off a bit, acknowledging that its initial statement was too negative, but not before O’Rourke signed a pledge that he wouldn’t accept donations from fossil-fuel interests, a demand Sunrise had been making for months.\n\n“We need a president who will stand up for our generation, and it can’t just be any Democrat,” says Stephen O’Hanlon, Sunrise’s 23-year-old spokesman. “We’re putting a lot of pressure on the candidates, and we’re gaining a lot of traction.”\n\nThe most prominent Democratic dispute about climate policy is whether it should focus exclusively on climate, or whether it should take on broader issues of economic injustice. The Green New Deal resolution was widely criticized for tacking on utopian progressive ideas like job guarantees (“to assure a living wage job for everyone”) as well as universal health care and the even broader mandate for \"any other measure the committee deems appropriate for economic security.” Some centrists in Congress and even some mainstream environmental groups believe those contentious add-ons will send a politically damaging message that Democrats don’t welcome bipartisan cooperation, that their most strident radicals will be running the show. “I’m worried about the focus on the loudest voices,” says the moderate Rep. Slotkin, who served as a CIA analyst before working for Obama in the Pentagon.\n\nBut Green New Dealers argue that a single-minded focus on emissions targets and warming scenarios would be bad politics and bad policy, narrowing and demoralizing the potential coalition for climate action, increasing the danger of a backlash like the “yellow vest” protests against France’s carbon taxes. They argue that climate hawks should focus on economic fairness and justice, on helping inner-city residents who breathe dirty air from coal plants, on dismantling power hierarchies that favor oil billionaires and agribusiness conglomerates over low-income minority consumers. They say the only way to fix the climate will be to inspire a new progressive coalition to take back Washington, and they’re skeptical that a technical goal like keeping average global temperature increases below 2 degrees Celsius will offer enough inspiration to mobilize the poor, the young, and other less reliable voting groups to the polls.\n\nIt’s no coincidence that the Democrats arguing for the political benefits of full-menu progressivism happen to be full-menu progressives. But there is a real strategic argument behind the ideological opportunism, a climate version of the debate among Democrats about whether to target base voters or swing voters, whether persuasion or mobilization is the key to victory in 2020. Steyer points out that in 2018, he financed mobilization campaigns that helped carry clean-energy ballot questions to victory in the swing states of Michigan and Nevada, although a similar campaign failed in Arizona after Republican politicians changed the wording.\n\n“Intensity is what drives turnout,” Steyer told me. “And climate lends itself to intensity. People are trying to kill your kids! Those are the facts. Why be polite?\n\nIt’s also no coincidence that Steyer, before launching his own presidential campaign, was the leading advocate for Trump’s impeachment. There are real divisions among Democrats over pipelines, carbon taxes and the Green New Deal, and the rise of climate-curious Republicans is a real phenomenon. But the president has a knack for dominating the national conversation, and it’s hard to imagine that the climate conversation will be any different in 2020. As the Trump administration whacks away at fossil-fuel regulations, while the Trump campaign sells plastic straws designed to mock concern for the environment, Democrats hope and Republicans fear that the complex nuances of climate politics will be boiled down to whether voters care or don’t, believe experts or don’t, trust Trump or don’t. In that scenario, every climate-driven heat wave, fire and flood can help persuade swing voters that the president is ignoring a problem—and help turn out the base, too.\n\nThen again, Trump has already signaled his plan to switch the spotlight to the radicalism of the Green New Deal and Democratic climate action in general. The problem for Democrats is that their plans, assuming they’re serious, really are quite radical, because they’re all in line with the international scientific recommendations, which are also quite radical. A dramatic shift away from fossil fuels could impose dramatic costs on fossil-fueled states, which helps explain why the Brookings Institution found that the 13 states with the highest per-capita emissions all voted for Trump in 2016, while the eight states with the lowest per-capita emissions voted for Hillary Clinton. The solar and wind boom is quickly changing the energy mix in red states like Texas and Georgia, but it’s not clear the changes will be quick enough to matter in 2020.\n\nMark Muro, a Brookings senior fellow, says those fossil-fueled red states could form a \"brown wall\" protecting Trump and other Republicans before they transition to clean energy. \"Some of these red states are decarbonizing fast, and that's incredible, but political realignment doesn't usually happen that fast,\" Muro says. \"Tribalism is pretty durable.\"\n\nTrump has framed climate as a classic tribal issue, another us-against-them battle in America’s political culture war, pitting coal miners in hard hats and dirt farmers in overalls against pointy-headed scientists and kale-eating environmentalists. So far, he doesn’t seem to be persuading many Americans outside his base. But he gets to make a case against wrenching change, while Democrats have to argue for upending the status quo and imposing some short-term costs in order to avoid hard-to-quantify disasters in the future. And they can’t even promise that their actions will make things better; in fact, scientists believe that things will almost certainly get worse even actions are taken to avoid catastrophe.\n\n“It’s the policy problem from hell,” says Yale’s Leiserowitz. “Politicians need to take hard decisions now to help the world in 2050, when all the political incentives favor short-term thinking. The danger is that by the time we feel serious pain and it’s really obvious we need to act, the situation will be beyond repair.”\n\nIn other words, the new inconvenient truth is that it might be good politics for Trump to campaign against uncomfortable change. But the climate doesn’t care about politics. It’s already changing, and the results will be uncomfortable no matter who wins in 2020.", "description": "Climate change could be a winning long-term political issue for the Democrats—but in 2020, it could also threaten the party from inside and out.", "authors": ["Michael Grunwald", "Shawna Chen"], "top_image": "https://static.politico.com/11/a9/0afe7fa4416c8bfedf9026c6dedc/190903-bernie-sanders.jpg"}