{"pub": "businessinsider", "url": "https://businessinsider.com.au/applebees-success-failure-story-rise-fall-comeback-2019-10", "downloaded_at": "2019-10-18 01:13:56.593627+00:00", "title": "Applebee's made the best comeback of 2018. Here's how the restaurant chain turned around.", "language": "en", "text": "Applebee’s rose to popularity in the 1990s thanks to its affordable menu and popular items like buffalo chicken wings.\n\nBut after the 2008 recession, it had a hard time drawing diners back. Applebee’s tried to reinvent itself to appeal to millennial diners, but ended up alienating its core customers.\n\nThanks to the Dollarita and going back to basics, 2018 sparked a comeback for the beleaguered chain. Applebee’s sales climbed 5.5% in the first nine months of 2018.\n\nVisit Business Insider’s homepage for more stories.\n\nFollowing is a transcript of the video.\n\nIrene Kim: By the end of 2017, it seemed like the end for Applebee’s. The company had just closed 99 locations, with plans to close up to 80 more. And this was just the end of a struggle that Applebee’s had been fighting for years. But then something unexpected happened: Applebee’s made a comeback. Sales went up 5.5% in the first nine months of 2018. After falling nearly 8% just a year before. It looks like people are once again\n\nCommercial: Eatin’ good in the neighbourhood.\n\nKim: So, what happened?\n\nBill and TJ Palmer opened the first Applebee’s in 1980. Three years later, they sold the restaurant concept to WR Grace and Company, and it quickly blew up.\n\nBy 1994, there were more than 500 Applebee’s locations across the US. And just four years later, in 1998, the company opened its 1,000th restaurant, rivaling competitors’ store locations, like IHOP, with 800, and Denny’s, with more than 1,000 stores nationwide.\n\nKate Taylor: Applebee’s was really doing well because they were reliable. They weren’t too fancy, they weren’t too cheap, but they hit a nice sweet spot in the middle for people.\n\nKim: Dishes like Applebee’s boneless buffalo wings became a fan favourite, and promotions like half-priced appetizers made Applebee’s a popular spot for customers looking for a good deal. But then, at the end of 2007, the recession happened, and people stopped eating out as much.\n\nKatie Couric: We are in a recession.\n\nNews anchor: The longest recession since World War II.\n\nCouric: But the question now: When will it end?\n\nKim: As Applebee’s sales struggled in the post-recession economy, it attempted to reinvent itself as a modern bar and grill to draw in up-and-coming millennials.\n\nBut it didn’t work.\n\nTaylor: Applebee’s tried to be a little bit trendy, a little bit cool. And it just came off as kind of corny for most people, where it felt like they were trying too hard to win over millennials.\n\nKim: New menu items like hand-cut $US20 steaks and brisket nachos not only failed to bring in new millennial diners; they alienated the very customers who had made Applebee’s successful in the first place: People looking for a reliable, affordable meal out.\n\nBy 2015, Applebee’s sales were falling. And only continued to fall, year after year. In 2017, the company closed 99 locations and announced plans to close 60 to 80 more the following year.\n\nJulia Stewart, the CEO of Applebee’s parent company, Dine Brands Global, reportedly stepped down because of Applebee’s poor performance. The former waitress was one of the industry’s most celebrated and longest-serving executives.\n\nFor a brief time, it looked like Applebee’s was done for.\n\nBut instead of folding, it turned things around.\n\nTaylor: Starting in late 2017, 2018, Applebee’s parent company, Dine Brands, had new leadership come in, and this new leadership was very, very focused on being inexpensive and not trying to be too trendy.\n\nBasically, they took Applebee’s back to the basics.\n\nThey’re not gonna try and win over millennials with these fancy new menu items. They’re gonna find something that’s inexpensive that people are proven to like. The biggest thing that kind of kicked off the turnaround for Applebee’s was the Dollarita, the $US1 margarita.\n\nKim: After the success of the Dollarita, Applebee’s quickly launched its Neighbourhood Drink program, releasing a new $US1 to $US3 drink every month. And that move has paid off. Alcohol now accounts for 15% of Applebee’s business.\n\nJohn Cywinski: We’ve sold more than 55 million Neighbourhood Drinks at Applebee’s since we launched this program in October of 2017.\n\nKim: And although overall revenue hasn’t quite caught up, the company is going pretty strong.\n\nCywinski: 2018 was the best year that Applebee’s had in the past 25 years. We’re very proud of that.\n\nWhen I think about Applebee’s, we are, in many respects, America’s kitchen table. We’ve got 1,700 locations, and we very much believe “eatin’ good in neighbourhood” embodies who we are and America resonates or connects with our brand.\n\nKim: But will Applebee’s be able to keep up the momentum?\n\nTaylor: Applebee’s has lost momentum a little bit so far in 2019. It’s hard because they had such a good year last year. It’s hard to keep that going.\n\nMillennials, they figured it out. They want, honestly, the same thing every generation wants: good prices, cheap drinks.\n\nThey need to kind of figure out if there’s anything different that they need to do for Gen Z.\n\nKim: What do you think of the new Applebee’s? Let us know in the comments below.\n\nBusiness Insider Emails & Alerts Site highlights each day to your inbox. Email Address Join\n\nFollow Business Insider Australia on Facebook, Twitter, LinkedIn, and Instagram.", "description": "", "authors": ["Irene Kim", "Kaitlyn Wang"], "top_image": "https://static.businessinsider.com/image/5da78bbacc4a0a5c9250ed05", "published_at": "2019-10-17"}