{"pub": "breitbart", "url": "https://breitbart.com/news/nirmal-purja-nepali-climber-carving-mountaineering-history", "downloaded_at": "2019-10-29 14:09:10.056317+00:00", "title": "Nirmal Purja: Nepali climber carving mountaineering history", "language": "en", "text": "Kathmandu (AFP) – Such was the determination of Nepali climber Nirmal Purja to climb the world’s 14 highest mountains, that he had them tattooed across his back, complete with swirling clouds and Tibetan prayer flags.\n\nNow the ex-British Gurkha can make the dizzying claim of being the fastest person to conquer every mountain on Earth over 8000 metres — from Everest in the eastern Himalayas to K2 in Pakistan’s Karakorum mountains — taking just six months and six days.\n\nClimbing all fourteen “8000ers” is considered the epitome of mountaineering aspirations since legendary Italian climber Reinhold Messner first completed the feat in 1986, taking 16 years to do so.\n\nFewer than 40 climbers have followed in his footsteps, with South Korean Kim Chang-ho holding the previous record for speed, taking seven years, 10 months and six days — although unlike Purja, he did not use supplementary oxygen.\n\n“It has been a gruelling but humbling six months, and I hope to have proven that anything is possible with some determination, self-belief and positivity,” Purja said in a statement after his summit of the last “8000er” on his list — Shishapangma in China.\n\nWhen he first told others about his quest to break the record “everyone was laughing at me,” Purja told AFP in a recent interview in Kathmandu.\n\nThe 36-year-old kicked off his “Project Possible” in April with an ascent of Nepal’s Annapurna, moving along the Himalayas to climb five others in the Himalayas, including Everest, before targeting the five “8000ers” in Pakistan’s rugged Karakorums.\n\nHe was not alone on Everest, reaching the summit on May 22 with 320 others and snapping a photo of a traffic jam of climbers on the world’s highest mountain that went viral.\n\nPurja began his final push for the remaining three peaks in September, with 8,031 metre Shisapangma — the smallest and final mountain on his list — proving unexpectedly tricky.\n\nChina had closed off the mountain for the season and only granted Purja a permit after intensive lobbying.\n\nOnce on the mountain, Purja had to battle high winds, an avalanche and even a toothache.\n\n-‘Breaks for mountaineering’-\n\nBut the adventurer said he was never fascinated with mountains as a child when even a pair of flip-flops were a luxury.\n\nBorn in a village in western Nepal, Purja joined the Gurkhas — a brigade of Nepalis in British army famous for their fearlessness — in his teens, later serving in the elite special forces as an extreme cold weather warfare specialist.\n\nHis tryst with mountaineering began on a trek to Everest base camp in 2012 when he summited the 6,119-metre (20,075 feet) Lobuche.\n\n“If you are from Nepal, everyone asks you about Everest. So I then used my breaks for mountaineering,” he said.\n\nIn 2014 he climbed his first “8000er” — Dhaulagiri in western Nepal.\n\nA period of leave following a deployment to war-torn Afghanistan in 2016 coincided with the climbing season, and he used his R&R period to make his first ascent of Everest.\n\nNext year he was back on the mountain, leading a successful Gurkha climbing expedition and was appointed a member of the Order of the British Empire (MBE) by the Queen for his work in high altitude mountaineering.\n\nLater, he swapped his army boots for crampons, quit the military after 16 years of service and re-mortgaged his house to raise funds for his high-altitude, high-speed quest.\n\n-‘More than trophy-hunting’-\n\nPurja said he hoped his feat would inspire the next generation of Nepali climbers to break his records.\n\nSherpas — Nepalis who often work as guides for foreign mountaineers — are the backbone of the country’s lucrative climbing industry, but don’t attract as much attention or accolades as international climbers.\n\n“As a Nepali, I hope my climbs put a spotlight on the talented climbers here,” he said.\n\nMountaineers around the world have encouraged Purja, including Messner — who made his 14 ascents without the aid of supplementary oxygen — whom he met at Nanga Parbat base camp in Pakistan.\n\nBut purist climbers frown upon Sherpa support, bottled oxygen and helicopters — all of which Purja has called on in his quest.\n\nHowever, Purja has earned respect for deviating from summits to rescue others even as the clocks ticked, including a Malaysian climber on Mount Annapurna.\n\nMountaineering blogger Alan Arnette said that what was impressive about Purja was his recovery time between his forays to the roof of the world.\n\n“Even with the nits around style, overall he is setting a marker that may take decades, if ever, to surpass,” he said.", "description": "Kathmandu (AFP) – Such was the determination of Nepali climber Nirmal Purja to climb the world’s 14 highest mountains, that he had them", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/29/fc9515_picture-released-by-nirmal-nims-purja-bremont-project-shows-climber-on-640x335.jpg", "published_at": "2019-10-29"}