{"pub": "investing.com", "url": "https://investing.com/news/forex-news/dollar-on-defensive-as-trumps-impeachment-inquiry-weak-data-weigh-1985427", "downloaded_at": "2019-09-25 07:03:26.528093+00:00", "title": "Dollar on defensive as Trump's impeachment inquiry, weak data weigh", "language": "en", "text": "By Hideyuki Sano\n\nTOKYO (Reuters) - The dollar steadied in Asian trade on Wednesday but remained on the defensive after the launch of a formal impeachment inquiry against President Donald Trump, while the political uncertainty added to worries about economies strained by the Sino-U.S. trade row.\n\nFollowing reports Trump sought foreign help to smear Democratic presidential front-runner Joe Biden, House Speaker Nancy Pelosi announced the House would initiate a formal inquiry, saying Trump appeared to have undermined national security and violated the U.S. Constitution.\n\nThe dollar bounced slightly in Asia after falling in U.S. trade overnight following Pelosi's move, which was announced late on Tuesday.\n\n\"There was a bit of position unwinding in Asia. After all, the impeachment process could take months. Still, it's not good news (for the dollar),\" said Koichi Kobayashi, manager of currency trade at Mitsubishi UFJ Trust Bank.\n\nThe dollar ticked up 0.2% to 107.28 yen , having slipped to a two-week low of 106.96 the previous day.\n\nThe safe-haven Swiss franc edged back to 0.9866 franc per dollar from near three-week high of 0.9845 to the dollar on Tuesday.\n\nThe euro, which was battered by weak euro zone economic data earlier this week, inched down 0.2% to $1.1001 ( ), a hair's breath off Monday's low of $1.0966.\n\nTrump promised on Tuesday to release a transcript of his phone call with Ukrainian President Volodymyr Zelenskiy amid reports he withheld nearly $400 million in U.S. aid to Ukraine as leverage to get Zelenskiy to launch a probe that would damage Biden.\n\nAlthough it is far from certain whether the inquiry will eventually lead to an impeachment, which needs a two-thirds majority in the Republican-controled Senate, increased political uncertainty is seen as negative for the dollar.\n\nSome market players also suspect domestic political fights will consume Trump's political capital, making it harder for him to strike any compromise with China on trade and other issues.\n\nOn Tuesday, Trump's rhetoric on China turned harsh once again as he delivered a stinging rebuke to Beijing's trade practices at the United Nations General Assembly, saying he would not accept a \"bad deal\" in U.S.-China trade negotiations.\n\nChina's top diplomat Wang Yi quickly hit back, saying Beijing would not be threatened on trade or allow interference in its affairs, including Hong Kong, while having no intention to \"play the Game of Thrones on the world stage\".\n\n\"Trump's speech was full of sensitive words for China - trade practices, currencies, freedom of religion and so on. It is not hard to imagine it will irritate China,\" said Daisuke Uno, chief strategist at Sumitomo Mitsui Bank.\n\n\"In the past China has reacted to U.S. pressure on trade by bringing down the yuan. It appears we are having that settings again,\" he said.\n\nThe was steady at 7.1088 per dollar in onshore trade , keeping some distance from 11-1/2-year lows of 7.1854 touched earlier this month.\n\nThe dollar was also undermined by data showing U.S. consumer confidence fell by the most in nine months in September, far more than expected.\n\n\"Net-net, consumer confidence plunged in September which counts as a big surprise that may sidetrack the economic expansion that is relying on consumer spending to fuel growth,\" said Chris Rupkey, chief financial economist at MUFG Bank in New York.\n\n\"This unwelcome news on souring consumer spirits is a startling new development that could even bring more rate cuts later this year from the Federal Reserve,\" he said.\n\nElsewhere, the British pound found some support after the UK Supreme Court ruled that Prime Minister Boris Johnson's decision to suspend parliament for five weeks was unlawful in a further blow to his ambition to pull Britain out of European Union next month with or without a deal.\n\nStill, market players saw no signs of a sustainable rebound as the events further deepened the uncertainty investors now attach to the currency.\n\nSterling changed hands at $1.2467 , down 0.2% on the back of a broad pullback in the dollar in Asia but still not far from two-month high of $1.2582 set last week.\n\nThe New Zealand dollar edged up 0.16% to $0.6333 after the Reserve Bank of New Zealand kept interest rates on hold, as widely expected.", "description": "Dollar on defensive as Trump's impeachment inquiry, weak data weigh", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8O060_L.jpg", "published_at": "2019-09-25"}