{"pub": "reuters", "url": "https://reuters.com/article/us-brit-am-tobacco-layoffs/bat-stubs-out-2300-jobs-as-new-ceo-tackles-tobacco-sector-changes-idUSKCN1VX0GF", "downloaded_at": "2019-09-12 11:46:04.593596+00:00", "title": "BAT stubs out 2,300 jobs as new CEO tackles tobacco sector changes", "language": "en", "text": "(Reuters) - British American Tobacco (BATS.L) plans to lay off 4% of its workforce, including a fifth of senior managers, as recently-promoted chief executive Jack Bowles grapples with challenges to the group’s legacy products and health fears over vaping.\n\nFILE PHOTO: A general view shows the British American Tobacco offices in London, Britain October 21, 2016. REUTERS/Stefan Wermuth\n\nShares of the second-largest tobacco company by sales were up 1.6 %, the biggest boost to the broader FTSE index .FTSE on Thursday, after the maker of Lucky Strike and Dunhill cigarettes said it will cut 2,300 roles as it eliminates duplication and consolidates business units.\n\nThe move by BAT, which employed more than 56,000 people at the end of last year, 629 of them senior managers, comes a day after President Donald Trump said that the U.S. would remove all flavored e-cigarettes from shelves, as officials warned millions of children had been drawn into nicotine addiction.\n\n“Today’s announcement represents a bold first step for new chief executive Jack Bowles, but he must hope the crackdown on vaping doesn’t see his growth ambitions run out of puff,” said Russ Mould, investment director at AJ Bell.\n\nBAT sells the Vuse e-cigarette in the United States, a product it acquired after buying U.S. rival Reynolds American for $49 billion in 2017. It also sells the Vype e-cigarette devices in many European markets, including the United Kingdom. Both are available with e-liquid flavorings.\n\nThere has been growing concern on the safety of vaping after health officials reported 450 cases of vaping-related lung illness and six deaths linked to its use in the United States.\n\nSince taking charge in April, insider Bowles has promised to slim down BAT, which was slow to react to the vaping craze in the United States, the market which generates nearly 45% of its annual profits, partly allowing rival Altria-backed (MO.N) Juul to capture nearly three-quarters of the new market.\n\nBowles said in June that BAT would pour more money into its “new category” business - which makes tobacco heating products, e-cigarettes and nicotine pouches - and consolidate them into three main brands as sales of traditional cigarettes decline.\n\nBAT said the planned job cuts would help save money that can be reinvested in the growth of its portfolio and deliver on its target of generating 5 billion pounds ($6.2 billion) of revenue in “new categories” by 2023-24.\n\nIt expects the business to generate constant currency revenue of 1.19 billion-1.375 billion pounds this fiscal year.\n\nHowever, Liberum analyst Nico von Stackelberg was puzzled by the laying off of senior managers when BAT was seeking growth.\n\n“You are going to lose people that know the business, a market or a certain category or why something was done one way,” von Stackelberg said.\n\n“It’s not great for the business in that regard.”", "description": "British American Tobacco plans to lay off 4% of its workforce, including a fifth of senior managers, as recently-promoted chief executive Jack Bowles grapples with challenges to the group's legacy products and health fears over vaping.", "authors": ["Pushkala Aripaka", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190912&t=2&i=1428953830&w=1200&r=LYNXNPEF8B0B5", "published_at": "2019-09-12"}