{"pub": "news24", "url": "https://sport24.co.za/Cricket/sharma-eyes-more-after-first-test-twin-ton-by-debut-opener-20191006", "downloaded_at": "2019-10-06 13:12:42.309619+00:00", "title": "Sharma eyes more after first Test twin ton by debut opener", "language": "en", "text": "Visakhapatnam - Rohit Sharma said his twin centuries as a Test opener was a \"great start\" Sunday, and promised more was to follow after India thrashed South Africa by 203 runs in the opening match.\n\nThe 32-year-old Sharma hit a century in each innings -- the first-ever by a debut opener in Test cricket -- as India took a 1-0 lead in the three-match series in Visakhapatnam.\n\nIndia's limited-overs star also hit a record 13 sixes, the most in a five-day game by any batsman, breaking Wasim Akram's record of 12 for Pakistan.\n\nThe senior batsman, who is the vice-captain of the one-day side, said he had been ready for the opportunity to open the Test innings, which came in his 28th game since making his debut in 2013.\n\n\"Whenever I was not playing a Test match, in the nets I was batting with the new ball trying to be ready if the opportunity comes,\" Sharma told reporters.\n\n\"It's a great start and I have a long way to go. It's not the end, it's the start. Good things are about to follow.\"\n\nSharma added that records meant little to him and that his first match -- against the West Indies in Kolkata where he made 177 -- was the most \"special\" so far.\n\n\"All those things are nice to happen along the way but I have said many times I am not here for records.\n\n\"I just want to enjoy the game. I know it might be boring but that is what it is.\"\n\nSharma's selection as opener was a topic of constant discussion heading in to the match, and he let his bat do the talking.\n\nHis record 317-run opening stand with Mayank Agarwal, who made 215, set the tone for India who declared their first innings on 502 for seven.\n\nIn the second innings when the team required quick runs, Sharma played an attacking knock while sharing a 169-run stand with Cheteshwar Pujara (81).\n\nSharma however played down talk that he was trying to prove a point to his critics.\n\n\"I have protected myself with a shield around me for a long time now and all those things, what happens outside does not come inside that shield,\" Sharma said with a smile.\n\n\"So what people talk and what people think of me it doesn't really bother me, because eventually I have to play my game and I have to enjoy my game because it was my dream to play cricket.\n\n\"And I am living that dream.\"", "description": "Rohit Sharma said his twin centuries as a Test opener was a \"great start\"  and promised more was to follow after India thrashed South Africa.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7738/94e024a82d1448ad9c09a2c4406c5281.jpg", "published_at": "2019-10-06"}