{"pub": "cnn", "url": "https://cnn.com/2013/09/09/world/guantanamo-bay-naval-station-fast-facts/index.html", "downloaded_at": "2019-09-16 23:16:14.541296+00:00", "title": "Guantanamo Bay Naval Station Fast Facts", "language": "en", "text": "(CNN) Here's a look at Guantánamo Bay Naval Station and its detention facilities.\n\nThe base, sometimes referred to as \"Gitmo,\" is located in southeastern Cuba , on the coast of Guantánamo Bay.\n\nThe United States has been leasing the 45 square miles that the base sits on since 1903. The base shares a 17-mile fenced border with Cuba.\n\nThe lease can only be terminated by mutual agreement.\n\nDuring the administration of President George W. Bush (2001-2009), the United States claimed that Guantánamo Bay detainees were not on US soil and therefore not covered by the US Constitution , and that \" enemy combatant \" status meant they could be denied some legal protections.\n\nMore than 700 detainees have been held at Guantánamo since it opened. Peak population was 684 detainees in June 2003.\n\nThe US Defense Department spent about $445 million to run Guantánamo Bay in 2015, down from $522.2 million in 2010.\n\nTimeline:\n\n1903 - The new Republic of Cuba leases 45 square miles of land in Guantánamo Bay to the United States for construction of a naval station. Building on the naval station begins that same year.\n\n1934 - Cuba and the United States sign a perpetual lease that rents the 45 square miles of Cuba to the United States for $4,085.00 a year.\n\n1991 - Approximately 34,000 Haitian refugees are detained on the base after they flee a coup in Approximately 34,000 Haitian refugees are detained on the base after they flee a coup in Haiti\n\n1994-1995 - More than 55,000 Cubans and Haitians captured at sea are kept at Guantánamo.\n\nJanuary 11, 2002 - The first detainees from Afghanistan and Pakistan arrive at the temporary facility of Camp X-Ray.\n\nJanuary 18, 2005 - The Supreme Court refuses to consider whether the government's plan for military trials unfairly denies the detainees basic legal rights.\n\nJuly 13, 2005 - A report presented to the Senate Armed Services details the interrogation of the suspected \"20th hijacker\" in the 9/11 attacks, Mohamed al-Khatani. He was forced to wear a bra, dance with a man and do dog tricks while tied to a leash. But military investigators said that was not considered prohibited, inhumane treatment.\n\nApril 19, 2006 - Following a Freedom of Information Act lawsuit by the Associated Press, the Pentagon releases the most detailed and extensive list of detainees ever provided. It provides the names and nationalities of 558 detainees who've gone through a hearing at Guantánamo Bay.\n\nMay 15, 2006 - The Defense Department releases another The Defense Department releases another list of current and former detainees to the AP. It says this list of 759 names includes everyone who has ever been held at Gitmo, since 2001. The list does not include the names of Khalid Sheikh Mohammed or Ramzi Bin al-Shibh.\n\nJune 10, 2006 - Three detainees, Ali Abdullah Ahmed, Mani al-Habardi al- Utaybi, and Yassar Talal al-Zahrani are found dead in their cells by guards after apparently committing suicide.\n\nJune 29, 2006 - The Supreme Court strongly limits the power of the US government to conduct military tribunals for suspected terrorists imprisoned at Guantánamo Bay. The 5-3 ruling effectively means officials will either have to come up with new procedures to prosecute at least 10 \"enemy combatants\" awaiting trial, or release them from military custody.\n\nSeptember 6, 2006 - President Bush acknowledges that the CIA has held suspected terrorists in secret prisons overseas. He announces the transfer of 14 captured al Qaeda operatives, including Mohammed, Bin al-Shibh and Abu Zubaydah, to Gitmo.\n\nJanuary 9, 2007 - Australian Foreign Affairs Minister Alexander Downer says that he expects Australian citizen David Hicks to be charged \"within a matter of weeks.\" Hicks has been detained without charges at Guantánamo Bay since January 12, 2002.\n\nMarch 12, 2007 - Walid bin Attash, a detainee at Guantánamo Bay, admits to helping orchestrate the Walid bin Attash, a detainee at Guantánamo Bay, admits to helping orchestrate the bombings of the US embassy in Nairobi, Kenya, in 1998 and the USS Cole in Yemen in 2000.\n\nMarch 15, 2007 - During a military hearing, a transcript of Mohammed confessing to being the mastermind of the 9/11 attacks is released.\n\nMay 30, 2007 - A Saudi detainee is found dead from an apparent suicide.\n\nJune 5, 2008 - Alleged 9/11 conspirators Mohammed, Bin al-Shibh, Ali Abdul Aziz Ali, bin Attash and Mustafa Ahmed al-Hawsawi are arraigned.\n\nJuly 21, 2008 - Salim Hamdan pleads not guilty at the opening of the first war crimes trial at Guantánamo Bay. He's charged with transporting Salim Hamdan pleads not guilty at the opening of the first war crimes trial at Guantánamo Bay. He's charged with transporting Osama Bin Laden and some missiles in connection with terrorist activity.\n\nAugust 6, 2008 - Hamdan is found guilty of five counts of material support to a terror organization. He is later sentenced to five years and six months in prison.\n\nDecember 7, 2008 - Mohammed, Bin al-Shibh, Ali, Walid bin Attash and Hawsawi tell a judge that they want to make a full confession.\n\nJanuary 20, 2009 - On his inauguration day, On his inauguration day, US President Barack Obama directs US Defense Secretary Robert Gates to ask prosecutors to seek stays for 120 days so terrorism cases at Guantánamo can be reviewed.\n\nJanuary 22, 2009 - Obama signs an executive order to close Guantánamo Bay within a year.\n\nNovember 13, 2009 - announces that five detainees, accused of complicity in the September 11th attacks, will be transferred to New York City to stand trial in a civilian court. They are: Mohammed, Bin al-Shibh, bin Attash, Ali and Hawsawi. Five other detainees will be transferred to the United States and have their cases heard before military commissions. They are: Omar Khadr, Mohammed Kamin, Ibrahim al Qosi, Noor Uthman Muhammed and Abd al-Rahim al-Nashiri. US Attorney General Eric Holder announces that five detainees, accused of complicity in the September 11th attacks, will be transferred to New York City to stand trial in a civilian court. They are: Mohammed, Bin al-Shibh, bin Attash, Ali and Hawsawi. Five other detainees will be transferred to the United States and have their cases heard before military commissions. They are: Omar Khadr, Mohammed Kamin, Ibrahim al Qosi, Noor Uthman Muhammed and Abd al-Rahim al-Nashiri.\n\nNovember 18, 2009 - Obama announces that the Guantánamo Bay detention center will not be closed by January 22, 2010, due to difficulties in relocating the prisoners.\n\nDecember 15, 2009 - The Obama administration announces that between 70-100 detainees will be moved to an The Obama administration announces that between 70-100 detainees will be moved to an empty prison in Thomson, Illinois\n\nOctober 25, 2010 - Guantánamo Bay detainee Guantánamo Bay detainee Khadr pleads guilty to all charges against him. Khadr is sentenced to 40 years in prison but will serve eight years as part of his plea agreement.\n\nFebruary 2011 - Detainee Awal Gul collapses and dies of an apparent heart attack after exercising.\n\nApril 4, 2011 - Holder announces that five detainees will face a military trial at Guantánamo Bay.\n\nApril 24, 2011 - Nearly Nearly 800 classified US military documents obtained by WikiLeaks reveal details about the alleged terrorist activities of al Qaeda operatives captured and housed at the US Navy's detention facility in Guantánamo Bay. Included are intelligence assessments of nearly every one of the 779 individuals who have been held at Guantánamo since 2002, according to the Washington Post.\n\nMay 18, 2011 - A detainee identified as Inayatullah (aka Hajji Nassim) commits suicide in his cell.\n\nSeptember 8, 2012 - A detainee is found dead in his cell. US Southern Command later identifies him as Adnan Farhan Abdul Latif, 32, of Yemen.\n\nMarch 25, 2013 - US military spokesman Robert Durand announces that 28 of the 166 prisoners detained at Guantánamo Bay are on hunger strikes. Ten of the detainees are being force-fed, according to Durand.\n\nApril 13, 2013 - Detainees wielding \"improvised weapons\" clash with guards. Guards respond by firing \"four less-than-lethal rounds,\" according to Joint Task Force Guantánamo.\n\nApril 22, 2013 - US spokesman Lt. Col. Todd Breasseale says that 84 detainees are currently on hunger strikes, more than half of the 166 people being held.\n\nMay 23, 2013 - In a speech at the National Defense University, Obama calls on Congress to close the detention center at Guantánamo Bay by saying, \"Given my administration's relentless pursuit of al Qaeda's leadership, there is no justification beyond politics for Congress to prevent us from closing a facility that should never have been opened.\"\n\nJune 6, 2013 - US spokesman Capt. Durand says that 103 detainees remain on hunger strikes, with 41 being force fed.\n\nSeptember 2013 - The Office of the Director of National Intelligence releases a report, saying that some former detainees are returning to terrorist activity after being released. The study says that of the 603 detainees who've been released, 100 of them have resumed fighting against the United States.\n\nDecember 31, 2013 - The final three ethnic The final three ethnic Chinese Uyghur detainess are transferred to Slovakia\n\nFebruary 2014 - Detainee Fawzi Odah files a lawsuit relating to the upcoming completion of US combat operations in Afghanistan. His lawyers argue that to hold detainees after the end of active hostilities is a violation of the Geneva Conventions.\n\nMay 22, 2014 - US District Judge Gladys Kessler lifts a temporary restraining order that had stopped the force feeding of detainee Abu Wa'el Dhiab. Kessler rules that he must be forcibly fed because of the \"very real probability that Mr. Dhiab will die.\"\n\nMay 29, 2014 - Detainee Ghaleb Nassar al Bihani, held since December 2001, is cleared for release.\n\nAugust 21, 2014 - The US Government Accountability Office declares that the Defense Department broke federal law by exchanging five Taliban detainees for Army Sgt. Bergdahl without giving Congress the appropriate notice.\n\nNovember 5, 2014 - Detainee Odah is released. He will be repatriated to Kuwait where he will remain in custody for a year, in a rehabilitation program.\n\nDecember 7, 2014 - Six detainees are transferred to Uruguay, including Dhiab, who has been on a hunger strike. Dhiab took his fight against forcible feeding to federal court in the District of Columbia.\n\nFebruary 18, 2015 - A US military appeals court vacates the conviction of David Hicks , an Australian who pleaded guilty to providing material support to terrorism. Hicks was the first detainee at Guantánamo to be convicted in a military commission.\n\nSeptember 17, 2015 - Prisoner Younis Abdurrahman Chekkouri is sent back to Morocco.\n\nSeptember 22, 2015 - Detainee Abdul Shalabi is transferred to Saudi Arabia.\n\nOctober 29, 2015 - Prisoner Prisoner Ahmed Ould Abdel Aziz is released to the government of Mauritania.\n\nOctober 30, 2015 - Shaker Aamer, the last British resident held at the prison camp, Shaker Aamer, the last British resident held at the prison camp, arrives home in the UK after his release.\n\nDecember 1, 2015 - The Department of Defense reveals that The Department of Defense reveals that a case of mistaken identity has kept Mustafa Abd-al-Qawi Abd-al-Aziz al-Shamiri at Guantánamo Bay for more than 13 years . Shamiri is an admitted fighter associated with US-designated terror groups, but it was believed that he was also an al Qaeda facilitator and trainer. US officials now say that these activities were carried out by other extremists with a similar name.\n\nJanuary 8, 2016 - The Department of Defense announces the repatriation of Faez Mohammed Ahmed Al-Kandari to Kuwait.\n\nJanuary 11, 2016 - The Department of Defense announces the repatriation of Muhammed Abd Al Rahman Awn Al-Shamrani to Saudi Arabia.\n\nJanuary 14, 2016 - The Department of Defense announces the transfer of Fahed Abdullah Ahmad Ghazi, Samir Naji al-Hasan Muqbil, Adham Mohamed Ali Awad, Mukhtar Yahya Naji al-Warafi, Abu Bakr Ibn Muhammad al-Ahdal, Muhammad Salih Husayn al-Shaykh, Muhammad Said Salim Bin Salman, Said Muhammad Salih Hatim, Umar Said Salim al-Dini and Fahmi Abdallah Ahmad Ubadi al-Tulaqi to Oman.\n\nApril 4, 2016 - The Department of Defense announces the transfer of Salem Abdu Salam Ghereby and Omar Khalif Mohammed Abu Baker Mahjour Umar to Senegal.\n\nApril 16, 2016 - The Department of Defense announces the The Department of Defense announces the transfer of nine detainees to Saudi Arabia.\n\nJuly 11, 2016 - The US Department of Defense announces the transfer of two detainees, The US Department of Defense announces the transfer of two detainees, Muhammadi Davlatov and Mansur Ahmad Saad al-Dayfi, to Serbia.\n\nApril 15, 2016 - The Department of Defense The Department of Defense announces the transfer of 15 detainees to the United Arab Emirates. It's the single-largest transfer since Obama took office.\n\nJanuary 5, 2017 - The The Department of Defense announces the transfer of four detainees , Salem Ahmad Hadi Bin Kanad, Muhammed Rajab Sadiq Abu Ghanim, Abdallah Yahya Yusif Al-Shibli, and Muhammad Ali Abdallah Muhammad Bwazir to Saudi Arabia.\n\nJanuary 17, 2017 - The Department of Defense announces the The Department of Defense announces the transfer of ten detainees to Oman.\n\nJanuary 19, 2017 - The Defense Dept. announces the The Defense Dept. announces the transfer of four detainees.\n\nJuly 5, 2017 - The Toronto Star and other The Toronto Star and other media outlets report that former detainee Khadr, a Canadian who spent 10 years at Guantanamo Bay after fighting US troops in Afghanistan, is getting more than $10 million Canadian dollars and an apology from the Canadian government. Khadr had sued the Canadian government for violating international law by allegedly not protecting its citizens and conspiring with his US captors, who he says abused him.\n\nMay 2, 2018 - regarding detainees captured on the battlefield and the transfer of those individuals to Guantánamo Bay, a day after the deadline set by a January 30 executive order signed by Trump. The Pentagon delivers its recommendations for new policies regarding detainees captured on the battlefield and the transfer of those individuals to Guantánamo Bay, a day after the deadline set by a January 30 executive order signed by Trump.\n\nMay 2, 2018 - of Ahmed Mohammed Ahmed Haza al Darbi to Saudi Arabia. This marks the first transfer of a detainee from Guantánamo Bay under the Trump administration. The DoD announces the transfer of Ahmed Mohammed Ahmed Haza al Darbi to Saudi Arabia. This marks the first transfer of a detainee from Guantánamo Bay under the Trump administration.\n\nJanuary 9, 2019 - Navy Captain Navy Captain John Nettleton is arrested and charged with obstruction of justice, concealment, falsifying records and making false statements during an investigation into the death of Christopher Tur, a civilian worker who drowned near Guantánamo Bay in 2015.\n\nApril 29, 2019 - US Navy Rear Admiral US Navy Rear Admiral John Ring , commander at Joint Task Force -- Guantánamo, is relieved of duty.\n\nJune 10, 2019 - The Supreme Court The Supreme Court rejects a challenge to the indefinite detention of detainees suspected of terror activities who have yet to be charged after being held for nearly two decades at the Guantánamo Bay detention center.", "description": "Read CNN's Guantánamo Bay Naval Station Fast Facts and learn more about its detention facility, sometimes called \"Gitmo.\"", "authors": ["Cnn Library"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/150122080923-guantanamo-bay-detainees-file-super-169.jpg", "published_at": "2013-09-09"}