{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/8/desean-jackson-scorches-redskins-washington-drops-", "downloaded_at": "2019-09-08 23:28:03.943821+00:00", "title": "Redskins torched by Jackson in season-opening loss to Eagles", "language": "en", "text": "PHILADELPHIA — Quinton Dunbar slammed his helmet onto the ground out of frustration. Though the Redskins cornerback wasn’t involved in the play, he knew his team had made a devastating mistake, one they should have easily been aware of heading into a new season.\n\nMoments earlier, DeSean Jackson broke free, and as the Redskins understand, when the wide receiver breaks free on a play, that’s it.\n\nJackson, with his blazing speed, scored two touchdowns Sunday — including the game’s go-ahead score — and the Redskins gave up a double-digit lead in Sunday’s 32-27 loss.\n\nFor years, Jackson had tortured the Redskins before joining them for two seasons and ultimately leaving in 2018 as a free agent. This offseason, Jackson reunited with the Eagles, giving Philadelphia an aspect that had been missing in recent years— speed.\n\nEven at 32 years old, Jackson routinely torched the Redskins throughout the second half — finishing the game with eight catches and 154 yards. Jackson’s playmaking ultimately made the difference as Washington couldn’t hold on to a 17-point lead.\n\nBefore Jackson swung the game, the Redskins looked well on their way to an upset.\n\nWashington entered the 2019 season with an unproven group of playmakers, but the coaching staff was optimistic their overall talent was better than last year. Washington, in particular, was high on second-year running back Derrius Guice, who coach Jay Gruden said was ready to earn the “mother load” of carries. Washington went as far as to keep Adrian Peterson, last year’s rushing leader, because of its confidence in Guice.\n\nIt was the Redskins’ success in the passing game, however, that jolted them to a 20-7 halftime lead. After having a 29th-ranked passing attack last year, Washington looked revitalized behind quarterback Case Keenum and a duo of speedy receivers. Keenum got into a rhythm with a series of quick throws and also took shots deep — the latter of which the Redskins rarely did in 2018.\n\nWashington first got on the board with a 48-yard touchdown from tight end Vernon Davis, who hurdled over Eagles cornerback Ronald Darby in a remarkable feat of athleticism.\n\nBy the end of the half, Keenum had 257 yards — more than what Alex Smith had in all but three of his 10 games last season.\n\nKeenum benefitted from a reworked receiving core. Third-rounder Terry McLaurin hauled in a 70-yard bomb in the second quarter to help the Redskins jump out to a 17-0 lead. In training camp, the Ohio State product emerged as a not-so-secret weapon for the Redskins, beating out former first-rounder Josh Doctson for a starting spot.\n\nMcLaurin finished with 125 yards in his debut. Doctson, by comparison, went three years without posting a 100-yard game with the Redskins.\n\nThe offense, though, stalled in the second half. A mixture of penalties, drops and incompletions prevented the Redskins from even getting a first down until late in the fourth. Washington added a garbage-time touchdown with six seconds left to cut Philadelphia’s 12-point lead to five.\n\nDefensively, Washington was mostly solid to begin the game but wore down as the game went on. In the second quarter, Eagles quarterback Carson Wentz found a streaking Jackson up the seam for a 51-yard touchdown. Jackson blew by cornerback Josh Norman, who didn’t have any safety help over the top.\n\nThe Redskins’ defensive line wasn’t as effective as they’d hoped to be. Washington sacked Wentz just once and the team also lost Jonathan Allen to a leg injury late in the first quarter. Allen did not return.\n\nThe game finally swung in the third quarter when Jackson torched rookie cornerback Jimmy Moreland and caught a 53-yard pass from Wentz. The Eagles took a 21-20 lead and Washington couldn’t come back.\n\nWashington will now have to regroup before next week’s home opener against the Dallas Cowboys.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Jackson, with his blazing speed, scored two touchdowns Sunday -- including the game's go-ahead -- and the Redskins gave up a double-digit lead in Sunday's 32-27 loss.", "authors": ["The Washington Times Http", "Matthew Paras"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/08/Redskins_Eagles_Football_73308.jpg-0267c_c0-104-2487-1554_s1770x1032.jpg?0a83afc075391912c3a1f83e00e9da2bca66b7c3", "published_at": "2019-09-08"}