{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/breaking-man-hanging-upside-down-20744197", "downloaded_at": "2019-10-28 23:36:09.342710+00:00", "title": "Man hanging upside down from Carlisle's Dixons Chimney confirmed dead", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA man who was found hanging upside down and trapped by one leg at the top of a 270ft chimney this morning has been confirmed dead, Cumbria Police have said.\n\nPolice were called to Dixons Chimney in Carlisle at 2am today and a huge emergency rescue operation lasted throughout the morning and into late afternoon.\n\nAnd at around 5pm today, police revealed the tragic news that a man in his 50s and from Carlisle died at the scene at 4.45pm.\n\nA statement from Cumbria Police said: \"Police can confirm that a man who was trapped at height on Dixon's Chimney in Carlisle and later recovered during a multi-agency operation has been confirmed as deceased.\n\n\"Paramedics pronounced the man, in his 50s and from Carlisle, deceased at the scene at around 4.45pm.\n\n(Image: PA)\n\n\"The thoughts of all the emergency services and partners are with the family and friends of the man. Specialist welfare police officers are supporting his family at this difficult time.\n\n\"An investigation will commence into the circumstances into how and why the man was on the chimney and the constabulary will be informing Her Majesty's Coroner.\"\n\nThe body was winched down at 4.30pm today where firefighters received him in a cherry picker.\n\nAmbulance crews then confirmed he had died and he was transferred to a private ambulance.\n\n(Image: @Cumbriapolice/Twitter)\n\nPolice said agencies \"worked as quickly as possible\" to get to him, but a helicopter could not get close enough while he was still alive.\n\nSupt Matt Kennerley said at the scene: \"The highly complex rescue operation has involved agencies including police, Cumbria and Lancashire Fire and Rescue Services, North West Ambulance Service, the Coastguard, mountain rescuers and specialist contractors.\n\n\"All agencies worked as quickly as possible to try to rescue the man.\n\n\"The operation involved road closures, the use of drones to assess the scene and a helicopter and a cherry picker brought in from Glasgow.\n\n\"All this was done with the aim of bringing the man down safely whilst maintaining the safety of emergency services staff.\n\n\"The man was recovered after a cherry picker was used to transport specialist technicians and specialist firefighters trained to work at height to the top of the chim to lower him down. \"\n\n(Image: @emurrie91 / Twitter)\n\nPictures from the scene showed a helicopter flying close to the man, as rescuers tried to drop a technical rescue team onto the chimney in the centre of Carlisle.\n\nThe BBC reports footage from the scene appeared to show a figure with his legs in the air.\n\nThe operation was still being classed as a rescue several hours after the man stopped responding to rescuers.\n\nInitial efforts with the helicopter were unsuccessful due to “concerns over how securely the man is attached to the ladder at the top of the chimney”, said Superintendent Matt Kennerley of Cumbria Constabulary.\n\nThe man was trapped at the top of the chimney, and police were faced with a “very, very difficult complex and challenging rescue effort”, said the Superintendent.\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nEarlier Superintendent Kennerley said: \"Earlier today we looked at the possibility of a helicopter rescue, we had a very good plan in place but unfortunately the precarious position of the male, the damage to the ladder at the top and the backdraft from the helicopter meant it wasn't possible to rescue him that way.\n\n\"We've had to scour the country for the specialist resources that we are currently bringing in. They are a short distance away now and are coming from Scotland where we are looking at getting a special cherry picker.\n\n\"We are going to have to bring that right up and then bolt some ladders on to the top of the tower near the top, and then we'll have to get rope resources to go over the top and try and rescue this male there.\n\n\"The male has stopped responding. He hasn't responded to us for a number of hours.\n\n\"We are exceptionally concerned.\"\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nLocal reports said shouts and wailing could be heard coming from the chimney in the early hours of this morning before police arrived on the scene.\n\nScott Mattinson, 24, and his fiance Nadene, 25, live nearby.\n\nScott told the News&Star: \"We heard a noise at about 10.30pm last night - some sort of wailing; like something in distress. We thought nothing of it at the time.\n\n\"But then at 1am Nadene woke up; we could hear shouting and a carry-on. We thought it was somebody who was drunk - you get used that, living near to Dalston Road.\n\n“Then at 3am, there was more shouting, and it turns out that that was the police.”\n\n\"We looked out of the window and saw blue lights flashing.\"\n\nDixon's Chimney is part of an old cotton factory built by Peter Dixon in 1836 and is famous for its height.\n\nIt was part of an adjoining cotton factory called Shaddon Mill.\n\nIt was built to be tall enough to stop the large amounts of smoke generated by the factory polluting the rest of the city.\n\nAt the time the factory was the largest cotton mill factory in the country.\n\nThe chimney became a Grade II listed building in 1972 and was restored by Carlisle City Council in 1999.", "description": "Cumbria Police confirmed the sad news after a major emergency operation lasted all day", "authors": ["Joseph Wilkes", "Image", "Pa", "Cumbriapolice Twitter", "Twitter"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20743121.ece/ALTERNATES/s1200/0_Chimney-rescue.jpg", "published_at": "2019-10-28"}