{"pub": "usatoday", "url": "https://usatoday.com/story/opinion/2019/10/10/nba-china-fallout-daryl-morey-should-resign-editorials-debates/3936879002", "downloaded_at": "2019-10-11 00:16:57.967680+00:00", "title": "Rockets' Daryl Morey should resign to preserve the NBA’s revenue, investments and goodwill", "language": "en", "text": "Stanley Chao\n\nOpinion contributor\n\nI tell my business clients to never give their opinions on the “3 T’s” when in China: Trump, Taiwan and Tiananmen. Now I’ll add a couple more “no no” topics: Hong Kong, the trade war and President Xi Jinping. In fact, just keep it simple and stick to the “4 P’s”: price, product, promotion and place.\n\nI really don’t know what Houston Rockets General Manager Daryl Morey was thinking. He manages an NBA team, and his sole purpose is to win championships, not ponder geopolitics or promote Hong Kong’s independence.\n\nHis comments would be akin to making his opinions about President Donald Trump public. Whether he’s pro- or anti-Trump, he’s bound to alienate half of the Rockets’ fan base. He would never do that, so why make a comment about another divisive topic?\n\nWhat should the NBA and the Rockets do? Morey should resign to preserve the NBA’s billions of dollars of revenue, investments and goodwill. I know. It’s unfair and it’s un-American. In America, we all have the right to express our opinions without retribution.\n\nBut we aren’t in America when we’re part of the global economy. This is China. Things work differently in the Middle Kingdom, and any China-experienced business person knows that. Disney doesn’t share its brand name in other countries but does a joint venture in Shanghai. Google willingly submits to Chinese censorship, and other behemoths like General Electric, Apple and McDonald’s all accede to the Communist Party’s wishes.\n\nOUR VIEW:China's business bullying jumps to new heights over tweet by NBA Rockets GM\n\nIf the NBA knows anything about doing business in China — and it does — Morey should slowly fade away. Then, this anti-NBA sentiment will likewise disappear.\n\nI know this leaves a bad taste for Westerners, as we are so rooted in our inalienable rights to speak freely. And this is partly why Trump is fighting a trade war with China. He wants to make a fairer playing field where Western companies can do, say and act as they wish in China. But dare I give my opinions about Trump?\n\nStanley Chao is the author of “Selling to China” and managing director for All In Consulting, assisting Western companies in China.\n\nIf you can't see this reader poll, please refresh your page.", "description": "Doing business in China is different. We aren’t in America, and the NBA knows this, writes Stanley Chao, managing director for All In Consulting.", "authors": [], "top_image": "https://www.gannett-cdn.com/presto/2019/10/10/USAT/94b5b481-a4c8-4c76-bcce-aa0540b00dfd-China.oppose.jpg?crop=2774,1560,x1,y114&width=2340&height=1560&format=pjpg&auto=webp", "published_at": "2019-10-10"}