{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/1/nasa-insight-lander-mars-captures-otherworldly-sou", "downloaded_at": "2019-10-02 00:38:40.783472+00:00", "title": "NASA lander captures otherworldly sounds on Mars", "language": "en", "text": "CAPE CANAVERAL, Fla. — NASA’s InSight lander on Mars has captured the low rumble of marsquakes and a symphony of other otherworldly sounds.\n\nScientists released an audio sampling Tuesday. The sounds had to be enhanced for humans to hear.\n\nInSight’s seismometer has detected more than 100 events, but only 21 are considered strong marsquake candidates. The rest could be marsquakes - or something else. The French seismometer is so sensitive it can hear the Martian wind as well as movements by the lander’s robot arm and other mechanical “dinks and donks ” as the team calls them.\n\n“It’s been exciting, especially in the beginning, hearing the first vibrations from the lander,” said Imperial College London’s Constantinos Charalambous, who helped provide the audio recordings. “You’re imagining what’s really happening on Mars as InSight sits on the open landscape,” he added in a statement.\n\nInSight arrived at Mars last November and recorded its first seismic rumbling in April.\n\nA German drilling instrument, meanwhile, has been inactive for months. Scientists are trying to salvage the experiment to measure the planet’s internal temperature.\n\nThe so-called mole is meant to penetrate 16 feet (5 meters) beneath the Martian surface, but has managed barely 1 foot (30 centimeters). Researchers suspect the Martian sand isn’t providing the necessary friction for digging, causing the mole to helplessly bounce around rather than burrow deeper, and to form a wide pit around itself.\n\n• The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "NASA's InSight lander on Mars has captured the low rumble of marsquakes and a symphony of other otherworldly sounds.", "authors": ["The Washington Times Http", "Marcia Dunn"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/01/Space_Marsquakes_Sounds_13007.jpg-cbb1c_c0-34-1010-622_s1770x1032.jpg?c105fa70905ce3b9540aee1af0475eaf4fb72710", "published_at": "2019-10-01"}