{"pub": "yahoo", "url": "https://finance.yahoo.com/news/saudi-aramco-delay-petrochinas-october-103128892.html", "downloaded_at": "2019-09-19 09:40:23.424055+00:00", "title": "Saudi Aramco to delay some of PetroChina's October oil loadings - source", "language": "en", "text": "FILE PHOTO: PetroChina's logo is seen at its petrol station in Nantong, Jiangsu province, China\n\nSINGAPORE (Reuters) - Saudi Aramco informed PetroChina on Tuesday that some of its loadings of light crude oil for October will be delayed by up to about 10 days after Saturday's attacks on the kingdom's oil facilities, according to a senior Chinese state oil source with knowledge of the matter.\n\nHowever, Aramco, the state oil company of Saudi Arabia, will still supply the same grades and volumes requested for October nominations, the source said.\n\nThe weekend attack on oil processing facilities at Abqaiq and Khurais knocked out half of the oil output from the world's top exporter, sending consumers in Asia scrambling for alternatives. A return to normal production could take months.\n\nThe Chinese state refiner was also told that some of its September-loading light crude cargoes will be swapped to heavier grades with no delays or change in volumes, the source said.\n\n\"The (loading dates and volumes of) September cargoes are too prompt to be changed, as Aramco may still be assessing the damages to its facilities,\" the source said on condition of anonymity because he is authorised to speak to the media.\n\nThe Abqaiq processing plant processes crude from the Ghawar, Shaybah and Khurais fields that produce the Arab Light or Arab Extra Light crude oil grades.\n\nPetroChina is one of the state-run Chinese refiners that buy Saudi oil under long-term agreements.\n\nChina is Saudi's largest oil customer, taking up a quarter of the kingdom's exports, with China Petroleum and Chemical Corp, or Sinopec Corp, the dominant buyer.\n\n\n\n\n\n\n\n(Reporting by Chen Aizhu; Editing by Christian Schmollinger and David Goodman)", "description": "Saudi Aramco informed PetroChina on Tuesday that some of its loadings of light crude oil for October will be delayed by up to about 10 days after Saturday's attacks on the kingdom's oil facilities, according to a senior Chinese state oil source with knowledge of the matter.  The weekend attack", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/3OzHd6f8YUHCgc2H.AErpw--~B/aD0zMjQ7dz00NDk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/8505c7af26e3454a7011bb319879051b", "published_at": "2019-09-17"}