{"pub": "afr", "url": "https://afr.com/technology/zuckerberg-takes-congress-bashing-on-libra-politics-and-civil-rights-20191024-p533t5", "downloaded_at": "2019-10-24 04:32:43.391293+00:00", "title": "Zuckerberg takes Congress bashing on Libra, politics and civil rights", "language": "en", "text": "She said it showed foreign malefactors are \"at it again,\" four years after Russians took aim at the 2016 race.\n\nShe also criticised Facebook's decision not to fact-check political ads. The matter has riled Democratic presidential candidates, who have asked - unsuccessfully - for Facebook to remove an ad purchased by President Donald Trump's presidential campaign that they have said is filled with falsehoods.\n\nDemocrat Rashida Tlaib later echoed those concerns that Facebook permits a \"lower standard for truthfulness and decency\" for politicians, adding: \"It is hate speech, it's hate, and and it's leading to violence and death threats in my office.\"\n\nDuring the congressional grilling, Republican Ann Wagner of Missouri challenged Facebook for failing to stop child exploitation online.\n\nWilliam Lacy Clay of Missouri lit into Zuckerberg for advertising policies that he claimed had resulted in discrimination against diverse communities on social media. And in one tense exchange, Democrat Gregory Meeks upbraided Zuckerberg for his company's role in serving as an \"accelerant in many of the destructive\" political fights around the world.\n\n\"Facebook has been systemically found at the scene of the crime,\" he began. \"Do you think that's just a coincidence?\"\n\nHesitantly, Zuckerberg replied: \"Well, congressman, we operate in almost every country in the world. . . So I think we would be in almost every country where different activities are happening.\"\n\nAdvertisement\n\nZuckerberg's testimony comes amid a brutal month for Facebook. The company learned this week that it faces an antitrust investigation by Democratic and Republican attorneys general in 47 states, territories and the District of Columbia, far more than the lead state behind the probe, New York, had previously announced.\n\nFederal authorities also are scrutinising Facebook for potential violations of competition law.\n\nTrump ads\n\nBut the company's most significant political headaches are connected with the 2020 presidential election. Facebook first stirred controversy this month when it declined to remove an ad from Trump's campaign that contained falsehoods about former Vice President Joe Biden, who is vying for the Democratic presidential nomination.\n\nBiden and others, including Elizabeth Warren, lambasted the tech giant for essentially profiting off a form of disinformation. But Facebook argued that it struck the right policy position, allowing users to see and interpret political speech on their own. Zuckerberg told The Washington Post in an interview that he feared an \"erosion of truth\" online but still felt that Facebook achieved the proper balance.\n\nDays later, Facebook announced that a number of Russian and Iranian accounts had sought to spread disinformation on its services, including Instagram, though Zuckerberg insisted that the company had made great strides in purging such content more swiftly since the 2016 election. \"Elections have changed significantly since 2016,\" he said, \"and Facebook has changed, too.\"\n\nAddressing the 2020 election on Wednesday, the Facebook chief defended the company's ad policies: \"The very small percent of our business that's made up of political ads does not come anywhere close to justifying the kind of controversy\" the company has experienced, Zuckerberg said.\n\nAnd Zuckerberg acknowledged that the company in 2016 had been on its \"back foot in terms of preventing Russia from interfering in our elections.\" But he stressed Facebook's defenses against disinformation are more \"sophisticated than any other company has at this point, and frankly, governments too.\"\n\nAdvertisement\n\nMultiple committee Democrats also pilloried Zuckerberg for his company's handling of issues related to diversity, including its hiring and contracting practices and recent, widely reported allegations that its ad systems allowed housing companies to discriminate against minorities.\n\nAt one point, an incensed Joyce Beatty described Facebook's approach to civil rights as \"appalling and disgusting.\"\n\n\"You should have known better,\" she said, telling Zuckerberg the company might have if \"you had real diversity and inclusion on your team.\"\n\nTlaib later took issue with Facebook's policies around hate speech. Citing the company's ban on content that attacks people on the basis of race, religion or other protected traits, the Democratic lawmaker displayed a photo of a man holding a rifle outside of a mosque tied to an event listing on the social-networking site and asked why it's allowed on Facebook.\n\n\"I'm not sure I'm in a position right now to evaluate any given post against all the different standards right now,\" Zuckerberg replied.\n\nCrypto concerns\n\nWith Libra, Democratic lawmakers entered the hearing having decried Facebook's cryptocurrency plans. This summer, Waters and her panel grilled Dave Marcus, the Facebook executive overseeing Libra, and she led a delegation to Switzerland, where the Libra Association - a nonprofit grouping of companies that will ultimately pilot the digital currency - is to be based.\n\nAdvertisement\n\nShe returned from the trip saying her \"concerns remain with allowing a large tech company to create a privately controlled, alternative global currency.\"\n\nIn his testimony, Zuckerberg stressed that Facebook is \"committed to taking the time to get this right,\" echoing comments he made privately to lawmakers during a trip to Washington earlier this year. He plans to say that Libra is most beneficial to millions of people around the world who lack access to bank accounts and other financial services.\n\nBut Zuckerberg highlighted Facebook's efforts to shift some of the responsibility away from the company, telling lawmakers Facebook does not \"expect to be leading those efforts going forward,\" according to his prepared testimony. He said the Libra Association \"will be driving the project from now on.\"\n\n\"I believe this is something that needs to get built, but I get that I'm not the ideal messenger right now,\" he added.\n\n\"We've faced a lot of issues over the past few years, and I'm sure people wish it were anyone but Facebook that were helping to propose this. But there's a reason we care about this. And that's because Facebook is about putting power in people's hands.\"\n\nRepublicans largely came to the defence of Facebook's aspirations for Libra.\n\n\"There's a lot of anger out there, and now, it's being directed at the architects of the system,\" said Patrick McHenry of North Carolina, the panel's top GOP member. \"And maybe it's not about Libra. It's not just about some housing ads. And maybe it's not even really about Facebook at all.\"\n\n\"Fair or not fair,\" he continued, \"you're here today to answer for the digital age.\"\n\nWashington Post", "description": "Facebook's boss tried to convince senators about its crypto-currency, but instead received a dressing down over fake ads, and its failure to fix its wrongdoing.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.1904%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_48/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/cae705bbe4ec477aa612a8565b16b57889e29b2d", "published_at": "2019-10-24"}