{"pub": "washingtonpost", "title": "As Serena Williams eyes history at the U.S. Open, a topsy-turvy field just tries to keep up", "url": "https://washingtonpost.com/sports/tennis/as-serena-williams-eyes-history-at-the-us-open-a-topsy-turvy-field-tries-to-keep-up/2019/09/01/75c264cc-cced-11e9-8c1c-7c8ee785b855_story.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:09:35.593192+00:00", "text": "Two years on the dot since giving birth, Serena Williams won her 347th Grand Slam match Sunday and stood three matches from the summit of the U.S. Open, with 11 women in her way as she tries to navigate the six days to Saturday with one bandaged right ankle and one big hope to reach the gilded number 24.\n\nWhile seeking to match the 24 Grand Slam singles titles of all-time leader Margaret Court, the Australian whose major titles came between 1960 and 1973, Williams still breathes in a field that has lost its Nos. 2, 3, 4, 6, 7, 9 and 10 players. A player with a compelling game, No. 2 seed Ashleigh Barty, departed Sunday. The player who beat Williams in the 2016 U.S. Open semifinals, No. 3 Karolina Pliskova, did likewise.\n\nThere remains No. 1 Naomi Osaka, the defending champion who romped through Williams here last year in a noisy final, but the rest of the field lacks for slews of Grand Slam moments. Osaka is the only other member of the final dozen to have won a Grand Slam — two, in fact — and other than that, none have reached a final. Only two have reached semifinals: No. 5 Elina Svitolina (who beat Madison Keys, 7-5, 6-4, on Sunday night) defeated Williams in the 2016 Rio de Janeiro Olympics and reached the Wimbledon semifinals in July; and No. 16 Johanna Konta, who Sunday chased away Pliskova, 6-7 (7-1), 6-3, 7-5, and has accessed three semifinals.\n\n[Djokovic retires with injury down two sets to Wawrinka]\n\nThere are two other Americans having breakthroughs, 116th-ranked Taylor Townsend and 141st-ranked Kristie Ahn. There’s a hip pick to win the whole thing, Canadian Bianca Andreescu, with her seven wins over top-10 players this year, her significant title at Indian Wells and her bolt from No. 178 at the beginning of the year to No. 15 today. Townsend and Andreescu share Williams’s half of the draw.\n\nBut in further evidence of the flow of the women’s game, the 11 remaining have seen surprisingly little of No. 8 Williams across the net, even given her voluminous experience at 37.\n\n\n\nWilliams rolled her right ankle during the second set of Sunday’s victory but finished the match. She said she would evaluate the injury again Monday; her quarterfinal match is Tuesday. (Sarah Stier/AP)\n\n“If you try to beat history and what Serena has achieved before on Arthur Ashe, she has no chance,” a French coach named Thomas Drouet said of his competitor. “The only solution is to beat the girl of now,” to try to offset “the Serena Williams of 2019.”\n\nDrouet will burrow into pain­staking video study with that task from here to Tuesday. He coaches Qiang Wang, a 27-year-old from the metropolis of Tianjin in the northern part of China, not so far from Beijing. Some heady results in the past year, especially in Asia, have brought Wang to No. 18 in the world, and her 6-2, 6-4 win over Barty on Sunday brought her to Tuesday and to Ashe Stadium for sure and to Williams — the latter two for the first time.\n\n“I don’t know,” the soft-spoken Wang said. “Let’s see.”\n\n[Naomi Osaka ousts Coco Gauff at U.S. Open with a win that showcased more than just her skill]\n\nIn the impressive rise of ­Chinese players behind the breakthrough feats of Li Na, the 2011 French Open and 2014 Australian Open winner, Wang is the highest-ranked of the four countrywomen in the top 50. She has played 20 Grand Slams and found her way to five third rounds, all in the past year and change.\n\nShe worked for almost five years with Peter McNamara, a former Wimbledon and Australian Open doubles champion, until January. McNamara died in July from cancer at 64.\n\n“He helped me a lot,” Wang said. “It’s really tough to hear he’s passed. I think he’s always been there with me, yes. . . . He told me how to play the match. He took me to the professional tennis. So, yes, that’s how he did teach me.”\n\nSaid Drouet: “I remember when she started with Peter — God bless him — I was always impressed with the work that she had, discipline that she had, the way she respected the sport.” He called Wang “the kind of player who has this capacity of analyzing what’s happening” during a match. He likened her to Rafael Nadal in the sense of a capacity to avoid rushing so as to tire the opponent slowly.\n\n“Yeah, Q was very good, very solid,” Barty said.\n\n[Novak Djokovic isn’t Federer or Nadal. Don’t heckle him. He’s still one of the greats.]\n\nWilliams played well in a fourth-round match of high quality with No. 22 Petra Martic of Croatia. It’s just that during Williams’s 6-3, 6-4 win, she rolled her right ankle while hitting a volley in the fifth game of the second set. That seemed ominous in a year in which she has suffered a left ankle injury that contributed to her quarterfinal loss to Pliskova in Australia, a virus that forced her to withdraw in Miami, a knee that forced her to withdraw in Rome and a back that forced her to withdraw mid-match in Toronto.\n\n“I probably should have seen a trainer in Australia,” Williams said. “But I just thought [Sunday], I definitely thought about that, because . . . the first thing was, like, ‘I’m finally healthy.’ The last thing I want is to have another bad ankle sprain. So I just wanted to get some compression on it [from a trainer, whom she called] and tape it even stronger, and that way I can at least try to finish the match.”\n\n[Taylor Townsend is part of serve-and-volley game’s revival at U.S. Open]\n\nShe said she would assess it again Monday. Her coach, Patrick Mouratoglou, said: “I was very happy with today’s match and also with the previous one, actually. I have no concerns at all.” He said Williams is “moving better now than she was a few months ago.”\n\n“I feel like in this tournament, I guess, I have definitely turned a different zone,” Williams said. “I’m not sure if I can articulate what zone that is.”\n\nShe is 36-3 in service games this tournament. Martic said: “The variety of her serve is very amazing, I think. Sometimes she goes for those precise serves. They’re like two centimeters from the line, and sometimes she hits 200 kilometers an hour.”\n\nOff she goes aiming for Saturday amid ample cheering from the New York crowds, whom she thanked profusely. “I don’t know if you guys know how much it means to me,” she said Sunday as they all hoped for something ­momentous coming Saturday.", "description": "A rolled ankle couldn’t keep Williams from a straight-sets victory over Croatia’s Petra Martic in the fourth round. Up next is Qiang Wang of China.", "authors": ["Chuck Culpepper", "Reporter Who Covers National College Football", "College Basketball", "Tennis", "Golf", "International Sports.", "September At Pm", "Chuck Culpepper Covers National College Sports", "As Well As Some Tennis", "Some Golf"], "top_image": "https://www.washingtonpost.com/resizer/NxnsHqDZMilRbPeqv5pcuEM8nKw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KUQBRFGNDMI6TDA4PSHOPBNYKU.jpg"}