{"pub": "bbc", "url": "https://bbc.com/future/article/20191028-old-gold-an-enduring-love-of-a-humble-fish-in-japanese-art", "downloaded_at": "2019-10-29 02:21:55.926169+00:00", "title": "Old gold: An enduring love of a humble fish in Japanese art", "language": "en", "text": "Today Fukahori’s name is synonymous with goldfish because of his distinct style of three-dimensional goldfish art. He’s famous both in Japan and overseas, even though after he first left art school, he had no interest in goldfish at all.\n\nHis creations can take upwards of two months to complete. Layer upon layer of clear resin cover three-dimensional figures of goldfish painted in piecemeal on to the acrylics. The result is a natural shadow as if cast by the painting of the goldfish, which shimmers under the surface, almost like they are alive and swimming.\n\n\n\nA prestigious pet\n\nChinese traders first brought goldfish to Japan in 1502, and sold them to the samurai and nobility as highly prized pets. Like China, the goldfish serves as a symbol of wealth, fortune, and good luck.\n\n“The ideal colour was a vermillion with a goldish glint, and in Japan this colour combination was doubly lucky: the gold represented wealth, and the colour red was used to dispel illness or misfortune,” says Kathryn Tanaka, an associate professor in the department of Cultural and Historical Studies at Otemae University in Japan.\n\nBy the mid-Edo Period, between 1603-1868, goldfish had become popular pets, but their allure was reserved only for aristocrats. By the 19th Century, the Edo military government was brought to an end, ushering in the Meiji period, an overture to modern Japan.\n\nBy this time, the country had started to industrialise and open up to western cultures; paintings became a blend of traditional styles and modern influences; pottery, textiles and other crafts gradually made way for mass produced items. It was also around this time that goldfish became popular among everyday people.\n\n“I think part of the fascination is the initial association with the elites and aristocrats, but it became popular for its aesthetics, for its colouring and perceived grace of its movement,” Tanaka says.", "description": "From prestigious pet to revered object of art, the humble goldfish has been considered a symbol of beauty in Japanese art for hundreds of years", "authors": ["Derek Cai"], "top_image": "https://ichef.bbci.co.uk/wwfeatures/live/624_351/images/live/p0/7s/7v/p07s7v8n.jpg", "published_at": "2019-10-28"}