{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/26/WS5db43457a310cf3e35573c6c.html", "downloaded_at": "2019-10-28 02:46:41.551635+00:00", "title": "China mulls major reform of 'new third board'", "language": "en", "text": "Xinhua | Updated: 2019-10-26 19:56\n\n[Photo/IC]\n\nBEIJING - China will reform its National Equities Exchange and Quotations (NEEQ), or the \"new third board,\" to further promote the growth of small and medium-sized enterprises (SME).\n\nThe country has outlined a series of reform measures to better orient the NEEQ to the needs and features of SMEs and support high-quality growth of the real economy, according to the China Securities Regulatory Commission.\n\nNEEQ-listed companies will be stratified to sift out a group of best-performing ones that are treated with a differentiated system regarding trading, investors' eligibility, information disclosure and oversight.\n\nThe reform will enable companies that have stayed in the best-performing group for a set period of time to be listed on the stock exchanges, as long as they meet public offering requirements, said the commission.\n\nA diversified shares issuance system will also be introduced to help improve financing efficiency and lower cost for companies.\n\nThe government will tighten oversight and management to ensure the quality of listed companies and upgrade the market exit system to protect investors.\n\nLaunched in 2013, the NEEQ supplements the Shanghai and Shenzhen stock exchanges and offers SMEs a financing channel with low costs and simple listing procedures.\n\nBy the end of September, a total of 13,219 firms have been listed on the board, among which 94 percent are SMEs.", "description": "China will reform its National Equities Exchange and Quotations (NEEQ), or the \"new third board,\" to further promote the growth of small and medium-sized enterprises (SME).", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/26/5db43457a310cf3e97a313d4.jpeg", "published_at": "2019-10-26"}