{"pub": "yahoo", "url": "https://finance.yahoo.com/news/china-now-has-more-unicorns-than-the-us-073951137.html", "downloaded_at": "2019-10-23 08:59:53.567079+00:00", "title": "China now has more 'unicorns' than the US", "language": "en", "text": "China has overtaken the US for having the largest number of privately-held startup businesses valued at $1bn (£771m) or more — dubbed ‘unicorns.’\n\nAccording to an annual benchmark report by China-based Hurun Institute, the US has 203 unicorns versus China’s 206. Those two countries hold 83% of the world’s unicorns. When combining India, which came in at third place with 21 and the UK in fourth with 13, those four countries hold 90% of the globe’s unicorns.\n\n“We have found just under 500 unicorns in the world. China and the USA dominate with over 80% of the world’s known unicorns, despite representing only half of the world’s GDP and a quarter of the world’s population. The rest of the world needs to wake up to creating an environment that allows unicorns to flourish in,” said Hurun Report Chairman and Chief Researcher Rupert Hoogewerf.\n\nIn total, the 494 unicorns around the world were spread across 24 countries, 118 cities, and are collectively worth $1.7 trillion in total. Each unicorn is worth around $3.4bn on average.\n\nHere is the full list:\n\nTable: Hurun Institute/Yahoo Finance More\n\nThe unicorns are also spread out across a number of industries. E-commerce came out as number one while fintech followed closely behind in terms of the number of unicorns in that industry. Hurun pointed out that while Amazon (AMZN) is known for dominating the e-commerce industry, there are number of startups that are competing for this space — most coming from Asia.\n\nIn South Korea, Coupang is the largest online retailer while CARS from China have $9bn valuations. Meicai from China and Indonesia’s Tokopedia are also worth $7bn.\n\nREAD MORE: Why Google has set up a global accelerator for startups\n\nHowever, fintech unicorns account for the largest slice of the total value of these firms. The top five industries make up half of the total and Hoogewerf says, “these are the industries that are disrupting the world economy, initiating the Fourth Industrial Revolution, and widely considered to hold the key to the future. Not surprising that many of the world’s top young talent want to work in these sectors.”\n\nTable: Hurun Institute/Yahoo Finance More\n\nREAD MORE: Revolut to launch in US with Mastercard", "description": "Unicorns are privately-held startup businesses valued at  $1bn (£771m) or more.", "authors": ["Lianna Brinded", "Head Of Yahoo Finance Uk"], "top_image": "https://s.yimg.com/uu/api/res/1.2/TG0CA9XzBglU9pp.wxhIWw--~B/aD0zMjY0O3c9NDkyODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/468ceda0-f49b-11e9-bfef-696e901fd02c", "published_at": "2019-10-22"}