{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7553651/Sienna-Miller-shows-edgy-sense-style-relaxed-beige-suit.html", "downloaded_at": "2019-10-09 10:54:36.521974+00:00", "title": "Sienna Miller shows off her edgy sense of style in relaxed beige suit", "language": "en", "text": "She is famed for her sensational sense of style.\n\nAnd Sienna Miller was once again flaunting her wares on Wednesday morning as she emerged for an appearance at BBC Radio 2, while looking incredibly chic.\n\nThe Alfie actress, 37, who is blazing the promo trail with her new movie American Woman, wowed in a relaxed trouser suit with a black top and matching sunglasses.\n\nChic: Sienna Miller was once again flaunting her wares on Wednesday morning as she emerged for an appearance at BBC Radio 2, while looking incredibly chic\n\nSienna looked sensational as she donned the elegant suit which drowned her svelte frame but oozed androgynous glam in the two piece.\n\nShe boosted her height with a pair of delicate beige kitten heels which flashed a glimpse of her berry coloured pedicure.\n\nShe wore her blonde tresses in loose lengths falling from a centre parting while she wore her make-up dewy and natural.\n\nShe paired the look with cat-eye sunglasses which added a touch of pizzazz to the elegant ensemble and established her style icon status.\n\nHappy days: The Alfie actress, 37, who is blazing the promo trail with her new movie American Woman, wowed in a relaxed trouser suit with a black top and matching sunglasses\n\nHappy days: She boosted her height with a pair of delicate beige kitten heels which flashed a glimpse of her berry coloured pedicure\n\nElsewhere, in a new interview with ELLE UK, the actress got candid about her 'unconventional' relationship with ex Tom Sturridge, 33, and also opened up about the 'bad timing' of her romance with Jude Law, 46.\n\n'I had an amazing time, but it would have been nice if that hadn’t happened before I was known for something else. It was a battle to be seen as something else.’\n\nTheir romance began in 2003 and, following a long break, came to its ultimate end at the start of 2011.\n\nA vision: Sienna looked sensational as she donned the elegant suit which drowned her svelte frame but oozed androgynous glam in the two piece\n\nBlonde beauty: She wore her blonde tresses in loose lengths falling from a centre parting while she wore her make-up dewy and natural\n\nOpen and honest: Elsewhere, in a new interview with ELLE UK, the actress got candid about her 'unconventional' relationship with ex Tom Sturridge, 33, and also opened up about the 'bad timing' of her romance with Jude Law, 46\n\nShe also revealed her ex Tom sleeps over at her house, as part of their efforts to raise their seven-year-old daughter Marlowe together.\n\nSienna told the magazine: 'He’s at the house and he’s going to stay there tonight. It’s not like there’s a structure for custody. We make it work. It’s not conventional.’\n\nThe former couple first started dating in 2011, but their romance came to an end in 2015. Sienna has since referred to the actor as her 'best friend'.\n\nLost love: She also revealed her ex Tom sleeps over at her house, as part of their efforts to raise their seven-year-old daughter Marlowe together (pictured in 2015)", "description": "The Alfie actress, 37, who is blazing the promo trail with her new movie American Woman, wowed in a relaxed trouser suit with a black top and matching sunglasses", "authors": ["Ciara Farmer For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/10/19482298-0-image-a-112_1570612013868.jpg", "published_at": "2019-10-09"}