{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7546639/Dairy-bull-genetically-edited-prevent-growing-horns-fathers-six-hornless-calves.html", "downloaded_at": "2019-10-07 20:40:33.213525+00:00", "title": "Dairy bull genetically edited to prevent it growing horns fathers six hornless calves", "language": "en", "text": "Most bulls are subject to the removal to avoid risk to cattle or human handlers\n\nScientists have created a hornless bull using genetic editing to sop farmers being gored.\n\nA genetically modified bull has fathered six hornless calves in California after researchers from the University of California, Davis, edited its genome.\n\nIt means bulls of the breed will now be spared the trauma of having their horns removed either as they start to form or later on in life, .\n\nMost bulls are subject to the removal to avoid them goring farmers or walkers.\n\nPictured: A horned bull from a control group is flanked by two hornless offspring of a genome-edited bull\n\nMany dairy breeds naturally grow horns. But on dairy farms, the horns are typically removed, or the calves 'disbudded' at a young age as animals that don't have horns are less likely to harm other cattle or dairy workers and have fewer aggressive behaviours.\n\nA naturally occurring genetic variant, or allele, that is present in some breeds of beef cattle such as Angus was introduced into the genome of the cow with horns.\n\nThanks to the altered genome none of the bull's offspring developed horns, as expected, and blood work and physical exams of the calves found they were all healthy.\n\nThe researchers also sequenced the genomes of the calves and their parents and analyzed these genomic sequences, looking for any unexpected changes.\n\nThe findings were published by UC Davis scientists in the journal Nature Biotechnology.\n\nUC Davis researchers said: 'Our study found that two calves inherited the naturally-occurring hornless allele and four calves additionally inherited a fragment of bacterial DNA, known as a plasmid.'\n\nThe findings were confirmed by the U.S. Food and Drug Administration who revealed a fragment of bacterial DNA, used to deliver the hornless trait to the bull, had integrated alongside one of the two hornless genetic variants, or alleles, that were generated by genome-editing in the bull.\n\nResearchers at the University of California, Davis, have found an alternative to the routine farming practice of de-horning young bulls\n\nUnwanted plasmid integration can be addressed by screening and selection in future breeding - in this case, only selecting the two offspring of the genome-edited hornless bull that inherited only the naturally occurring allele for breeding.\n\nVan Eenennaam said: 'This type of screening is routinely done in plant breeding where genome editing frequently involves a step that includes a plasmid integration.'\n\nAdding: 'We've demonstrated that healthy hornless calves with only the intended edit can be produced, and we provided data to help inform the process for evaluating genome-edited animals.\n\n'Our data indicates the need to screen for plasmid integration when they're used in the editing process.'\n\nResearchers say that while the plasmid does not harm the animals it does technically mean the genome-edited bull is classified as a GMO, because it contained foreign DNA from another species, in this case a bacterial plasmid.\n\nSince the original work for this study was carried out in 2013, initiated by the Minnesota-based company Recombinetics, new methods have been developed so donor template plasmid or other extraneous DNA sequences are not used to transfer the hornless allele.\n\n\n\nNo other unintended genomic alterations were seen in the calves five of whom were female and one male, and all animals remained healthy during the study period.\n\nNeither the bull, nor the calves, entered the food supply as per the U.S Food and Drug Agency guidance for genome-edited livestock.", "description": "Researchers at the University of California, Davis, find alternative to routine farming practice of de-horning young bulls - pain-free genetic modification. Six hornless calves have been born.", "authors": ["Milly Vincent For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/15/19398662-0-image-a-49_1570460137355.jpg", "published_at": "2019-10-07"}