{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/new-frontier-data-to-acquire-leading-cannabis-lifesyle-media-company-civilized", "downloaded_at": "2019-10-10 18:23:41.288318+00:00", "title": "New Frontier Data to Acquire Leading Cannabis Lifesyle Media Company, Civilized", "language": "en", "text": "SAN FRANCISCO — One day after the announcement of the over USD $10M acquisition of Zefyr, the advanced consumer data discovery and profiling platform in cannabis, New Frontier Data, the global authority in data, analytics and business intelligence and the only Big Data tech solution solely focused on the cannabis space, announces at New West Summit 2019 plans to acquire leading cannabis lifestyle and engagement digital platform – Civilized Worldwide Inc. (“Civilized”).\n\nThis second acquisition completes the most comprehensive and streamlined cannabis market entry solution to date. Civilized is the leader in engaging cannabis consumers, influencers and multinational brands with niche and mainstream content, access to exclusive events, and an overall elevated and informed cannabis lifestyle experience.\n\n“Our plan is to merge sophisticated information platforms to offer detailed, accurate and timely predictive analytics and actionable intelligence to companies looking to connect with today’s cannabis consumer,” said New Frontier Data Founder and CEO Giadha Aguirre de Carcer. “Civilized’s intelligent and thoughtful relationship with millions of cannabis consumers provides brands with a responsible and compliant way to engage, inform and influence buying behavior in this unique global marketplace.”\n\n“This is a smart and unique opportunity that will not only strengthen our offering but bring real value to our investors through increased revenue streams and partnerships,” said Terri Riedle, President of Civilized. “This merger allows for even richer digital, broadcast and podcast content and will help us better understand and deepen our relationship with consumers.”\n\nWashington, D.C.-based New Frontier Data was founded in 2014 and has grown to over a 50-person team, with three offices in the United States and Europe. Their vetted, comprehensive, and rigorously unbiased reporting has earned them the reputation as the go-to provider for a variety of North American and international operators, investors and government entities, as well as recognition as the first cannabis data company to provide testimony to the 116th Congress on Safe Banking practices.\n\nCivilized began publishing in 2015 and has emerged as a leading voice for modern cannabis consumers. The company’s mix of original and curated video and digital content, including stories on business, travel, technology, fashion and culture is available to millions on platforms across North America. Some of their key partnerships and acquisitions with companies like CORUS entertainment, Zoomer Media, Cannabis Club TV and the 420 Games has expanded their reach into consumer groups beyond that of any other company.\n\nAbout New Frontier Data: New Frontier Data is an independent, technology-driven analytics company specializing in the cannabis industry. It offers vetted data, actionable business intelligence and risk management solutions for investors, operators, researchers and policymakers. New Frontier Data’s reports and data have been cited in over 80 countries around the world to inform industry leaders. Founded in 2014, New Frontier Data is headquartered in Washington, D.C. with additional offices in Denver, CO, and London, U.K.\n\nNew Frontier Data does not take a position on the merits of cannabis legalization. Rather, its mission and mandate are to inform cannabis-related policy and business decisions through rigorous, issue-neutral and comprehensive analysis of the legal cannabis industry worldwide. For more information about New Frontier Data, please visit: http://www.NewFrontierData.com.\n\nAbout Civilized Worldwide Inc.:\n\nCivilized is the leading lifestyle media brand that connects millions of cannabis consumers, influencers and the canna-curious with both niche and mainstream content, events and experiences, and fashion. With operations in both Canada and the United States, Civilized creates original, premium digital content, television and podcasts; builds brands; and creates and produces world-class events and experiences for B2B and B2C audiences. Civilized is fast becoming the partner of choice for mainstream brands, and the cultural authority on the exploding global cannabis space. For more information, visit civilized.life.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191010005613/en/\n\nContacts\n\nMedia Contact:\n\nNick Olsen\n\nmedia@NewFrontierData.com\n\n1-844-420-3882 ext. 3", "description": "SAN FRANCISCO — One day after the announcement of the over USD $10M acquisition of Zefyr, the advanced consumer data discovery and profiling platform in cannabis, New Frontier Data, the global authority in data, analytics and business intelligence and the only Big Data tech solution solely fo...", "authors": [], "top_image": "https://mms.businesswire.com/media/20191010005613/en/741702/3/New_Frontier_Data_-_logo.jpg", "published_at": "2019-10-10"}