{"pub": "metro", "url": "https://metro.co.uk/2019/10/11/aaron-paul-reveals-vicious-hate-mail-breaking-bad-award-10902863", "downloaded_at": "2019-10-11 20:12:05.941752+00:00", "title": "Aaron Paul reveals vicious hate mail after Breaking Bad award", "language": "en", "text": "Aaron Paul is one of the most likable actors around – but it seems even he falls victim to trolling. Or rather, the old-fashioned version of trolling: hate mail.\n\nSpeaking on the Late Late show With James Corden this week, Aaron was asked by James if he’s ever received hate mail\n\n‘I did receive a letter that was disguised as a really sweet letter during the shooting of Breaking Bad,’ he admitted.\n\n‘[The envelope] had all these hearts and smiley faces on it. I try to respond to as many of these fans as possible.\n\n‘I opened it up and it’s just this guy screaming at me, so angry that I won the Emmy over a couple of his favourite Lost actors: Terry Quinn and Michael Emerson.\n\n‘He was so furious. “How dare you take away an award from these brilliant actors?!”’\n\nAaron Paul in El Camino: A Breaking Bad Movie (Picture: AP)\n\nReplied James, not missing a beat: ‘In my defense, I didn’t know you then, and I do love Lost!’\n\nAdvertisement\n\nAdvertisement\n\nAaron won the Supporting Actor Emmy for Breaking Bad in 2010, 2012 and 2014.\n\nHe is, of course, taking his iconic Breaking Bad character Jesse Pinkman into the world of film this month with El Camino: A Breaking Bad Movie.\n\nAaron is a triple Emmy winner (Picture: FilmMagic)\n\nPremiering on Netflix today, it has so far scored very positive reviews.\n\nAs well as Breaking Bad, Aaron’s other screen credits include Mission: Impossible III and Exodus: Gods and Kings.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Aaron Paul recaps all of Breaking Bad in less than three minutes ahead of El Camino\n\nMORE: Breaking Bad’s Aaron Paul reunites with Bryan Cranston as they celebrate El Camino premiere", "description": "Aaron Paul, now starring El Camino: A Breaking Bad Movie, won three Emmys for his portrayal of Jesse Pinkman in the Breaking Bad TV show.", "authors": ["Jamie Tabberer"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_83908085-e1570801584879_1570806323.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-11"}