{"pub": "afr", "url": "https://afr.com/companies/healthcare-and-fitness/csl-says-no-patient-data-was-stolen-by-ex-staffer-20191018-p531yd", "downloaded_at": "2019-10-18 03:21:30.567045+00:00", "title": "CSL says no patient data was stolen by ex-staffer", "language": "en", "text": "Global biotechnology company CSL says based on its investigation to date, no identifiable patient data was obtained by its former employee whom it accuses of stealing trade secrets.\n\nIn a statement provided to The Australian Financial Review CSL looked to ease any concerns about stolen patient data.\n\n\"Any data involved was de-identified, aggregated information regarding the way that patients use CSL Behring’s and other products. We have no reason to believe these files contain any patient-specific or identifiable information.\"\n\nAs reported by the Financial Review on Wednesday, CSL has filed a lawsuit in the US against Dr Joeseph Chiao on October 1 accusing him of deliberately downloading highly sensitive, proprietary commercial information and trade secrets that the company believes he intended to pass to his new employer, Dutch group Pharming Healthcare Inc.\n\n\"We are confident that our swift actions, including retrieval of the data and the\n\ninitiation of court proceedings, has protected our data and intellectual property from\n\nuse or disclosure by Chiao or Pharming,\" a CSL spokesperson said.\n\n\"We take the protection of our propriety business information extremely seriously and will vigorously pursue our pending legal action. As a company that upholds our core values, including integrity, we are deeply disappointed by Chiao’s actions.\"", "description": "The $114.6 billion blood plasma group looked to ease patient concerns after CSL filed a lawsuit in the US against Dr Joeseph Chiao accusing him of downloaded highly sensitive information.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.5973%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/aa0809f37e5ad0c898a7798bbaeb9817dbb15327", "published_at": "2019-10-18"}