{"pub": "guardian", "url": "https://theguardian.com/environment/2019/sep/26/greta-thunbergs-495-word-un-speech-points-us-to-a-future-of-hope-or-despair", "downloaded_at": "2019-09-25 23:30:24.213822+00:00", "title": "Greta Thunberg's 495-word UN speech points us to a future of hope – or despair | Richard Flanagan", "language": "en", "text": "Greta Thunberg’s address to the UN’s Climate Action Summit on Monday may well prove to be the climate change movement’s Gettysburg Address. Like Abraham Lincoln’s revered speech, which ran to 273 words, Thunberg’s was also very short, only 495 words long.\n\nLincoln famously spoke at the dedication of the Gettysburg Cemetery, following the leading orator of the day, Edward Everett, who took two hours to deliver the official address, a 13,000 word oration. Lincoln’s speech, simply described in the day’s official program as Dedicatory Remarks, lasted less than three minutes.\n\nGreta Thunberg showed the world what it means to lead | Michael H Fuchs Read more\n\nThunberg would similarly have had some good acts to follow at a UN talk-fest, but her presence would not, at first glance, seem to be of the same significance as those of the various world leaders who had gathered for the event.\n\nAnd yet it is Thunberg’s speech, which took just four-and-a-half minutes to deliver, which, one suspects, will resonate long into the future.\n\nIn the manner that was then traditional, Everett’s marathon speech, deemed very good by the standards of the day, was rich with classical allusion. But Lincoln used no classical reference. Instead, in a way that it is hard to appreciate from this distance of time, he was profoundly modern, using Biblical phrasing and rhythms that appealed to a population for whom the Book was the word, not Sophocles.\n\nThunberg’s speech was similarly phrased in the contemporary argot pitched to the polarising force of social media’s algorithms, suffused with a contained rage. For she came not with a dream, but a nightmare, the scientific truth of climate change succinctly put in five paragraphs. Her dreams, she said, had been stolen from her along with her childhood.\n\nWill you recognise the necessity of the enormous task which must start now, or will you say nothing, do nothing?\n\nThunberg’s speech was damned by many, a Fox News commentator responding to the speech by calling Thunberg “a mentally ill Swedish child who is being exploited by her parents and by the international left”. So too Lincoln, the London Times in 1863 not so very distant from Fox News in 2019, when, echoing some US newspapers, opined : “The ceremony [at Gettysburg] was rendered ludicrous by some of the luckless sallies of that poor President Lincoln.”\n\nThunberg’s speech used phrases and ideas she has deployed before and to better effect. So too Lincoln. But what gives both speeches their enormous power is timing, each coming after historic events the significance of which had not yet been fully understood and was still in the process of creation.\n\nIn Lincoln’s case it was the Battle of Gettysburg that had taken place a few months earlier, now regarded as a turning point in the civil war. In Thunberg’s case it was the massive global strike of schoolchildren a few days earlier inspired by her original, solitary strike on the steps of the Swedish parliament.\n\nFacebook Twitter Pinterest ‘Greta Thunberg came not with a dream, but a nightmare, the scientific truth of climate change succinctly put in five paragraphs.’ Photograph: Shannon Stapleton/Reuters\n\nLincoln’s speech sought to give meaning to the enormous blood sacrifice of the Battle of Gettysburg, and the war more generally; in doing so he was shaping the future of the war and his nation.\n\nThunberg’s singular achievement was to present the climate change issue as a battle for power. In doing so she spoke with the authority of the millions who marched only a few days before. For this Donald Trump trolled her. He intuited her power and tried to destroy it through mockery.\n\nIn her speech Thunberg sets up an opposition between the plural we – those who want action on climate change – and a strangely singular use of the word you – those who don’t.\n\nAnd though she was speaking to an audience largely composed of those with power, her you was not only the assembled global leaders but everyone, and her we, while directly referring to the young and Friday’s three million marchers, was a we open to all, infinitely expandable.\n\nFor the you is not just Trump or Scott Morrison or a fossil fuel company executive. Her you is personal. It is each of us who hears but as if in a nightmare cannot act. Will you recognise the necessity of the enormous task which must start now, or will you say nothing, do nothing, condemning yourself to the ranks of those who the future “will never forgive”?\n\nMorrison responds to Greta Thunberg by warning children against 'needless' climate anxiety Read more\n\nOn Wednesday the Australian prime minister Scott Morrison, the nation’s creepy gaslighter-in-chief, criticised Thunberg for similar reasons to Trump, saying, “I think we’ve got to caution against raising the anxieties of children in our country.”\n\nSince 1996 – seven years before Greta Thunberg was born – the Liberal party has been working assiduously to advance the cause of fossil fuel companies at the expense of our future. Morrison’s paternalistic piffle is just one more piece of grotesque bad faith on an issue about which the Liberal record is one of lying, scheming and wrecking at every step for over two decades. With his bluster of quiet Australians, Morrison is trying to pull a spit hood over the nation to silence us all.\n\nFacebook Twitter Pinterest Crowds in Melbourne hold up signs as they march on 20 September as part of the global climate strike. Photograph: James Ross/AAP\n\nRecently released Australian cabinet papers reveal the Howard Liberal government was conspicuously campaigning in 1996 against legally binding, uniform emission reduction targets in the Kyoto protocol, with the prime minister’s advocacy to key world leaders proving “influential”. When uniform targets were eventually dropped, the Liberal cabinet praised John Howard’s negotiating strategy.\n\nIf the world continues on its trajectory, much of mainland Australia is predicted to be uninhabitable within 80 years\n\n“Australia is in a special position,” the cabinet papers record Howard saying. “We are a developed country that is a major exporter of energy.”\n\nAnd so it went for the next two decades. With the Liberals and the Murdoch press running political cover, the fossil fuel industries ramped up and up. By 2019 the Liberal party had defined itself as the party of coal, and a craven Labor party, after its defeat in the most recent election, is now following its lead. Today Australia is the world’s largest exporter of coal and LNG, and over the next decade Australia hopes to double its coal production. In consequence Australia is well on the way to becoming a pariah state along with the likes of Russia and Saudi Arabia, its people hostage to the profits of its fossil fuel industry.\n\nThe gross corruption of Australian public life so recently on display with examples of large sums of money from the Chinese Communist party seeming to flow into both Liberal and Labor coffers show exactly how easily purchased an enfeebled and unresponsive Australian democracy has become. And the corollary, the shameful, shared refusal of both Labor and Liberal parties to back a much-needed national corruption commission suggests only the obvious: the depth and breadth of corruption of our national polity.\n\nAnd yet while avoiding the criminality among their own, our leaders have been keen to criminalise those who actively campaign for our future. Queensland – the epicentre for major new coalmines – has significantly strengthened its laws against environmental protesters while lawyers for the Adani mine have publicly stated that they will seek to bankrupt any opponents of their new coalmine, the most controversial in the world, commercially viable only with the subsidies and tax breaks given for its consumption by the Indian government and for its production by Australian governments.\n\nWe are talking about 'drought-proofing' again – they are simplistic solutions that will destroy Australia | John Williams Read more\n\nWhen Morrison infamously brandished a lump of coal in parliament he told Australians not to be scared.\n\nBut we should be.\n\nAustralia is already living the grim consequences of climate change. If the world continues on its present trajectory, much of mainland Australia is predicted to be uninhabitable within 80 years. The climate collapse is here.\n\nFor over 30 years those who wished for action on climate change have believed that reason and truth would persuade those with power to act. But it is not so, and it did not prove to be so, and therein lies much of the reason carbon levels continue to rise and the planet’s very future is today hanging by the thinnest of threads.\n\nFor power never gives to reason. Power bends only to power. And on Monday a schoolgirl raised the spectre of an opposing power that is now rising around the world and which will not be satisfied by those “who can only talk about money and fairytales of eternal economic growth”.\n\n“The young people are starting to understand your betrayal. The eyes of all future generations are upon you … We will not let you get away with this. Right here, right now is where we draw the line. The world is waking up. And change is coming, whether you like it or not.”\n\nWatching Greta Thunberg’s speech I understood what last Friday was about: a historic turning point where for the first time the power of we met the power of you without artifice, without compromise and with a ferocious courage.\n\nMillions marched last Friday. The next march will be bigger. The battle lines are finally clear. And each of us must now decide: am I you or am I we?", "description": "The speech draws the battle lines between those of us who want action on climate change and those, like Trump, who only mock it", "authors": ["Richard Flanagan"], "top_image": "https://i.guim.co.uk/img/media/d841323a5a3992736f3b0e7447ab1bcb8e370700/80_76_3271_1963/master/3271.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=2fabb4f021c84366f8ea63343f497e8f", "published_at": "2019-09-25"}