{"pub": "investing.com", "url": "https://investing.com/news/economy/australia-central-bank-cuts-rates-to-record-low-even-as-home-prices-stage-a-comeback-1989561", "downloaded_at": "2019-10-01 09:34:51.311100+00:00", "title": "Australia central bank cuts rates to all-time low, signals may need more", "language": "en", "text": "By Swati Pandey\n\nSYDNEY (Reuters) - Australia's central bank cut interest rates for the third time this year on Tuesday in a bid to stimulate a sluggish economy and signaled it was prepared to do more if needed, knocking the local dollar to a one-month low.\n\nThe country's economy has expanded for 28 years without a recession, but risks have intensified over the past year, with growth slowing, inflation lukewarm, the property market subdued and unemployment ticking higher.\n\nThe Reserve Bank of Australia's (RBA) quarter-point cut took the cash rate to an all-time low of just 0.75%, leaving little room for more reductions and raising the possibility of unconventional policy easing.\n\nRBA Governor Philip Lowe said moves by global central banks to ease monetary policy played a part in the decision as he signaled the need for an extended period of low interest rates.\n\n\"The Board will continue to monitor developments, including in the labor market, and is prepared to ease monetary policy further if needed...,\" Lowe said.\n\nFinancial futures are now pricing in a 60% chance of a fourth cut to 0.5% in November, compared with under 30% before the latest decision.\n\nExpectations that rates will be lower for longer sent the Australian dollar slipping to $0.6706, its weakest since early September.\n\n\"In cutting rates so aggressively this year, the RBA is hoping to generate a stronger labor market, higher wage growth and to stimulate domestic consumption,\" said Anthony Doyle, a Sydney-based, cross-asset strategist at Fidelity.\n\n\"Fortunately for the RBA, the transmission mechanism of monetary policy is fairly quick in the Australian economy,\" he said, noting around 80% of mortgages were on variable rates.\n\nThe RBA's back-to-back easings in June and July have so far done little to boost activity outside of the housing market.\n\nIndeed, figures earlier in the day showed home prices across Australia's capital cities jumped 1.1% in September, led by Sydney and Melbourne, but approvals to build new homes collapsed to the lowest since 2013.\n\nEconomists expect construction-related job losses in coming months which could take the unemployment rate to as high as 5.5% from 5.3% now and the RBA's goal of around 4.5%.\n\n\"The RBA now has only three, or possibly even fewer, more conventional cuts available to them before they will have to venture into unconventional monetary easing territory - negative rates, QE (quantitative easing), or bond yield targeting,\" Rob Carnell, chief Asia-Pacific economist for ING wrote in a note.\n\nSLACK IN LABOR MARKET\n\nGovernor Lowe acknowledged the RBA's decision to lower rates was partly in response to slack in the labor market. The jobless rate in August worsened to a one-year high of 5.3%.\n\n\"The Board took the decision to lower interest rates further today to support employment and income growth and to provide greater confidence that inflation will be consistent with the medium-term target,\" Lowe said in a short statement accompanying the rate decision.\n\n\"The economy still has spare capacity and lower interest rates will help make inroads into that.\"\n\nLowe sees a \"gentle turning point\" for the economy after annual growth hit a decade low of 1.4% in the quarter-ended June.\n\nThe governor is due to speak at a business event in Melbourne later in the day where he is expected to throw more light on future policy course.\n\nRecord low interest rates have boosted home prices, helping end two years of continuous declines which ate into household wealth and confidence in a blow to consumption and the broader economy.\n\nSome economists believe the price revival could prove a blessing for the construction sector, which has seen a severe downturn in new home approvals, particularly for the once red-hot apartment sector.\n\nBuilding approvals fell 1.1% in August, less than a sharp 10% slide in July but confounding market expectations for a bounce of 2.5%, data from the Australian Bureau of Statistics (ABS) showed.\n\nOne positive sign in the data was a small bounce in approvals to build new apartments while non-residential construction surged 54%.", "description": "Australia central bank cuts rates to all-time low, signals may need more", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF901Y6_L.jpg", "published_at": "2019-10-01"}