{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/09/04/death-think-tanks-latest-irans-pointless-crusades", "downloaded_at": "2019-09-04 23:48:12.837145+00:00", "published_at": "2019-09-04", "title": "Death to think tanks? The latest in Iran’s pointless campaign.", "language": "en", "text": "\n\nPresident Hassan Rouhani speaking to Iran's parliament in Tehran on Tuesday. (Abedin Taherkenareh/EPA-EFE/Shutterstock)\n\nGlobal Opinions writer\n\nWhenever the regime in Iran announces a plan intended to inflict pain on prominent Americans, we tend to laugh it off — assuming we even notice in the first place. I’m not sure how many of us picked up on Tehran’s recent announcement that it was implementing sanctions against several prominent Americans (including national security adviser John Bolton and Treasury Secretary Steven Mnuchin).\n\nFor one thing, no real authority or power beyond Iran’s borders will assist Tehran in enforcing its edicts. Even more obviously, those being sanctioned — in this case, with bans against travel to Iran — have no intention of going there in the first place.\n\nSen. Ted Cruz (R-Tex.), one of the officials targeted, joked on Twitter that he would now have to change his holiday travel plans.\n\nDammit. Now Heidi & I are going to have tho change our Christmas plans.... https://t.co/KuiVajCDoM — Ted Cruz (@tedcruz) August 28, 2019\n\nA spokesman for the senator astutely remarked: “Senator Cruz already avoids travel to terrorist regimes that take American citizens hostage and want to use nuclear weapons to attack American cities.”\n\nCuriously, Secretary of State Mike Pompeo, the only current U.S. official who has claimed a willingness to travel to Iran to take part in negotiations with the regime, was not on the banned list.\n\nPompeo is arguably just as antagonistic toward Iran as the other officials mentioned, and his exclusion from this meaningless travel ban is an indication of the Iranian leadership’s desire to keep the door to negotiations open at least a crack.\n\nMore ominous, though, was a separate Iranian move to sanction the Foundation for Defense of Democracies (FDD), a Washington-based research institute, along with its chief executive, Mark Dubowitz.\n\nAn official statement addressed what it described as FDD’s role in “U.S. economic terrorism against ordinary Iranians, including endangering the lives of many innocent people, Iran’s legitimate trade with the world and the impact of the U.S. illegal sanctions on Iran’s environment.” The statement reserved the right to take action — legal and otherwise — against FDD if given the opportunity.\n\nOther U.S. organizations and researchers of all political persuasions — including several who were involved in President Barack Obama’s engagement with the Islamic republic — were quick to condemn the Iranian move. Seventy of them signed an open letter condemning “the suggestion that Iran’s security institutions might ‘punish’ FDD personnel.”\n\nThe signers pointed out that the move was an example of a “troubling trend whereby governments attempt to stifle and intimidate independent researchers; colleagues of ours have been targeted by several countries in a variety of ways, from harassment to denial of access to expulsion to imprisonment.”\n\nThough I rarely agree with FDD’s policy recommendations, it is easy to condemn such an attack against an independent organization’s right to engage in free debate. It will be much harder, though, to figure out how to support those who are the most likely to become targets of this policy.\n\nIn addition to FDD and Dubowitz, the regime’s statement took aim at “their other Iranian and non-Iranian collaborators and accomplices.”\n\nYou probably haven’t heard about any of this because such moves are designed for domestic Iranian consumption. The designations are a clear response to the U.S. sanctioning of Iran’s foreign minister, Mohammad Javad Zarif, in July and the other sanctions that the Trump administration is slapping on Iranian entities on a seemingly daily basis.\n\nThe greatest threat isn’t against Dubowitz or his staff, though his Iran-born employees should be on highest alert. Invariably, it’s much lesser-known people who end up the victims of these ideologically motivated proclamations.\n\nAs it has so many times before, the Iranian government will use this sanction as a tool of repression against perceived domestic opponents. At a moment when Iran faces a series of clear threats from every direction, including the skies, the fixation on research that attempts to expose the regime’s internal weaknesses is a clear indication of insecurity.\n\nThose perceived to be influencing the United States’ policy toward Iran are always a target. Under Obama, it was organizations and individuals who favored engagement; under Trump, it’s supporters of his so-called maximum-pressure campaign. It doesn’t matter what positions private organizations may advocate — certain forces within the Iranian regime will see them as enemies.\n\nThink tanks and independent researchers serve as convenient boogeymen — especially since Iranian ideologues find it impossible to comprehend how think tanks actually effect policy (or not).\n\nIt will come as little surprise when the Iranian authorities start parading political prisoners on state television as agents of FDD, regardless of how far they are from espousing that organization’s views. The Iranian regime has little concerns about the “collateral damage” it inflicts on innocents. One need only recall the killing of one of the translators of Salman Rushdie’s book “The Satanic Verses,” after Ayatollah Ruhollah Khomeini declared his notorious fatwa against the author in 1989.\n\nYet this is one area where the reality doesn’t matter. It’s what’s in the heads of the people who run Iran that counts. Unfortunately, the consequences will be anything but imaginary for those who have the misfortune to run afoul of the regime’s boundless and voracious paranoia.\n\nRead more:\n\nJosh Rogin: Iran’s attacks on one U.S. think tank are a threat to all\n\nDavid Ignatius: Macron’s gamble to get Iran and the U.S. to talk didn’t pay off. Here’s why.\n\nDennis Ross and Dana Stroul: The flaw in Trump’s maximum pressure campaign toward Iran\n\nJason Rezaian: Pompeo vs. Zarif: Now there’s a debate I’d actually watch", "description": "No real authority or power beyond Iran’s borders will assist Tehran in enforcing its edicts.", "authors": ["Jason Rezaian", "Global Opinions Writer", "Jason Rezaian Is A Writer For Global Opinions. He Served As The Post'S Correspondent In Tehran To He Spent Days Unjustly Imprisoned Iranian Authorities Until His Release In January"], "top_image": "https://www.washingtonpost.com/resizer/_60I1S6YF5YmC05zRQDYFfT_i8c=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YQEDQFWOEYI6TJRABKIWK3L5WY.jpg"}