{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7548339/James-Davies-joked-Warren-Gatland-time-picked-Wales.html", "downloaded_at": "2019-10-07 23:39:39.993959+00:00", "title": "James Davies joked with Warren Gatland that it was about time he was picked for Wales", "language": "en", "text": "Joker in the pack James Davies told Warren Gatland it was high time he was handed a start at seven after he was picked for Wales’ World Cup team to face Fiji.\n\nThe 28-year-old will play in his first tournament match in place of rested Justin Tipuric.\n\nAnd he will line up alongside older brother Jonathan, 31, for just the second time in Welsh red.\n\nJames Davies has not featured since August 31 against Ireland where he only lasted 51 minutes\n\nRoss Moriarty (pictured) and James Davies will start against Fiji on Wednesday for Wales\n\nWALES VS FIJI FULL TEAMS WALES TEAM FOR FIJI 1. Wyn Jones (Scarlets) (17 Caps), 2. Ken Owens (Scarlets) (69 Caps), 3. Tomas Francis (Exeter Chiefs) (45 Caps), 4. Jake Ball (Scarlets) (38 Caps), 5. Alun Wyn Jones (Ospreys) (130 Caps) (CAPT), 6. Josh Navidi (Cardiff Blues) (21 Caps), 7. James Davies (Scarlets) (5 Caps), 8. Ross Moriarty (Dragons) (36 Caps), 9. Gareth Davies (Scarlets) (46 Caps), 10. Dan Biggar (Northampton Saints) (75 Caps), 11. Josh Adams (Cardiff Blues) (16 Caps), 12. Hadleigh Parkes (Scarlets) (20 Caps), 13. Jonathan Davies (Scarlets) (78 Caps), 14. George North (Ospreys) (88 Caps), 15. Liam Williams (Saracens) (60 Caps) Replacements: 16. Elliot Dee (Dragons) (24 Caps), 17. Rhys Carre (Saracens) (1 Cap), 18. Dillon Lewis (Cardiff Blues) (17 Caps), 19. Aaron Shingler (Scarlets) (22 Caps), 20. Aaron Wainwright (Dragons) (14 Caps), 21. Tomos Williams (Cardiff Blues) (11 Caps), 22. Rhys Patchell (Scarlets) (15 Caps), 23. Owen Watkin (Ospreys) (17 Caps) FIJI TEAM FOR WALES 1. Campese Ma'afu, 2. Samuel Matavesi, 3. Manasa Saulo, 4. Tevita Cavubati, 5. Leone Nakarawa, 6. Dominiko Waqaniburotu (capt.), 7. Semi Kunatani, 8. Viliame Mata, 9. Frank Lomani, 10. Ben Volavola, 11. Semi Radradra, 12. Lepani Botia, 13. Waisea Nayacalevu, 14. Josua Tuisova, 15. Kini Murimurivalu Replacements: 16. Mesulame Dolokoto, 17. Eroni Mawi, 18. Peni Ravai, 19. Apisalome Ratuniyarawa, 20. Peceli Yato, 21. Nikola Matawalu, 22. Jale Vatubua, 23. Josh Matavesi\n\nGatland told how Davies Jnr reacted when he knew he would play.\n\n‘I said to James ‘Well done’ and he replied ‘You’ve finally seen the light have you!?’ said Gatland. ‘But then he said ‘I’m only joking’.\n\n‘I loved that. I thought it was brilliant. It’s a great response. I love a bit of banter like that and I have no problem with comments like that.\n\n‘It just says to me that players believe in their own ability. They want to be in the squad and they think they’re good enough to be in the starting side.\n\n‘I thought that was a really good response.’\n\nDavies is one of two changes to the starting XV between the Australia win and this next Fiji game on Wednesday - with Ross Moriarty rotated in for Aaron Wainwright. Prop Rhys Carre comes onto the bench instead of Nicky Smith too.\n\n‘We’ve been really happy with Justin Tipuric’s form but it’s an opportunity to look at someone else, just in case, for any reason, he (Tipuric) does pick up an injury,’ added Gatland.\n\n‘It will show us whether James can fit into that spot or someone like Josh Navidi, we know he can play seven.\n\nVictory against Fiji would send Warren Gatland's side through to the quarter-finals\n\n‘They’re two guys that are very hungry for an opportunity.’\n\nDavies is no stranger to the Fijians, having played against Leone Nakarawa, Semi Kunatani, Viliame Mata and Jos Tuisova for the Great Britain Sevens team that were hammered by the Pacific Islanders in the Olympic final of 2016.\n\n‘They gave us a tuning in the sevens in that final,’ said Davies. ‘Just look at the players they’ve got, so talented.\n\n‘You give them time and space and everyone from 1-15 is a massive threat. We’ve got thing in place to try and stop that and it’s just about implementing the game plan now.’\n\nCaptain Alun Wyn Jones plays again for Wales - and having lost to Fiji back in 2007, which knocked Wales out of the pool stage before Gatland was in charge, he is wary of the Islanders.\n\n‘If you look at the leagues they play in across the world, their players usually focus around the most exciting aspects in those leagues,’ he said ‘We know their offload ability and how dangerous they can be and you couple that with some interesting set-piece plays. We have to be on our guard.\n\n‘With regards to where we are we’re very aware we’ve only done half a job. We’re halfway through the pool stages with two games down and two to go. We’ve had two great starts but potentially taken our foot off the gas in the latter parts of those two games. We want an 80-minute performance in defence.\n\n‘Time is increasingly finite at this stage of the campaign, but hopefully we can put the product on the park.’", "description": "Joker in the pack James Davies told Warren Gatland it was high time he was handed a start at seven after he was picked for Wales' World Cup team to face Fiji. The 28-year-old will play his first match.", "authors": ["Will Kelleher For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/00/19418474-0-image-a-5_1570490461694.jpg", "published_at": "2019-10-07"}