{"pub": "mirror", "url": "https://mirror.co.uk/3am/style/shopping/lookfantastic-unveil-christmas-beauty-gift-20750402", "downloaded_at": "2019-10-29 23:56:57.616514+00:00", "title": "LookFantastic unveil Christmas beauty gift range for 2019", "language": "en", "text": "Get the biggest Weekly Fashion stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAs beauty holiday collections start to roll out, LookFantastic have launched the ultimate Christmas beauty gifts that everyone can enjoy.\n\nThe luxury online beauty retailer recently revealed the three new products in its Christmas look book that are on sale now at lookfantastic.com - and we want them all.\n\nWith stunning options for both men and women, this is one festive range you don't want to miss out on.\n\nFirst up is a box of luxurious Christmas crackers with a beauty twist, which each contain must-have products from brands like Emma Hardie, Illamasqua and Elemis. You also get a traditional party hat and cheesy joke.\n\nThe crackers are beautifully packaged and it costs £30 for a box of six - but all have a combined worth of over £60.\n\nAlso included in the festive range are two gorgeous Christmas stockings for him and for her.\n\nInside the stocking for her is a mix of premium makeup, hair and body treats worth over £155.\n\nMeanwhile men are treated to range of grooming goodies from brands including Aveda, Hawkins & Brimble and ESPA. The stocking for him has a worth of £100.\n\nLast, but by no means least, LookFantastic have treated shoppers to a dreamy beauty chest containing 10 full size products.\n\nThe £100 Beauty Chest is worth a whopping £360 and includes products by Eve Lom, Bareminerals, REN and, quite impressively, Burberry.\n\nIf you want to buy any of the new items as Christmas gifts for loved ones (or for yourself), we'd advise heading over to the website soon - as these must-have gifts won't be around for long.\n\nWe've listed each of the products and its contents below.\n\nBeauty Chest, £100\n\nIncludes the following products:\n\nEve Lom Moisture Cream (Full Size), worth £105\n\nBurberry Liquid Lip Velvet (Shades vary between Fawn, Dark Rosewood, Oxblood) (Full Size), worth £26\n\nESPA Optimal Skin Pro Serum Oil (Full Size), worth £51\n\nIllamasqua Nude Collection Unveiled Artistry Palette (Full Size), worth £38\n\nJurlique Rosewater Balancing Mist (Full Size), worth £32\n\nBareminerals Illuminating Mineral Veil (Full Size), worth £23\n\nNeal’s Yard Rejuvenating Frankincense Toner (Full Size), worth £37\n\nChristophe Robin Cleansing Mask with Lemon (Full Size), worth £35\n\nSIGMA F09 Brush, worth £17\n\nREN Evercalm Gentle Cleansing Milk (Full Size), worth £20\n\nBuy it now at lookfantasic.com\n\nChristmas Crackers, £30 each\n\nInclude the following products:\n\nIllamasqua Mini Hydra Veil, worth £12\n\nAromatherapy Associated NPD Forest Bath Oil, worth £11\n\nElemis Pro Collagen Oxygenating Night Cream, worth £12\n\nLe Couvent des Minimes Aqua Minimes Botanical Hand Cream, worth £8\n\nEmma Hardie Moringa Balm, worth £10\n\nSleek MakeUP Face Form in Light or Blush By3 Palette, worth £9.99\n\nBuy it now at lookfantasic.com\n\nBeauty Stocking for Her, £48\n\nIncludes the following products:\n\nEyeko Black Magic Mascara (Full Size), worth £19\n\nESPA 24 Hour Balancing Moisturiser (Full Size), worth £42\n\nPhilip Kingsley Pomegranate & Cassis Elasticizer (Full Size), worth £35\n\nIllamasqua OMG Highlighter (Full Size), worth £34\n\nDoucce Freematic Eyeshadow Quad in Subtle Elegance (Full Size), worth £26\n\nBuy it now at lookfantasic.com\n\nBeauty Stocking for Him, £48\n\nIncludes the following products:\n\nESPA The Hydrator Moisturiser (Full Size), worth £32\n\nHawkins & Brimble Facial Scrub (Full Size), worth £8.95\n\nEcooking Cleansing Gel (Full Size), worth £23\n\nLe Couvent des Minimes Aqua Soap Bar (Full Size), worth £12\n\nAveda Pure-Formance Grooming Clay (Full Size), worth £23\n\nBuy it now at lookfantasic.com\n\nIf you're looking for beauty advent calendars, browse our roundup of the top beauty countdowns for Christmas 2019.", "description": "The online beauty retailer has launched crackers, stockings (for him and for her) and a beauty chest worth £360", "authors": ["Melisha Kaur"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20750421.ece/ALTERNATES/s1200/0_LF-Crakers-2.jpg", "published_at": "2019-10-29"}