{"pub": "cnbc", "url": "https://cnbc.com/2019/09/21/facebook-ceo-mark-zuckerberg-is-taking-washington-dc-seriously.html", "downloaded_at": "2019-09-21 14:49:00.891754+00:00", "title": "Zuckerberg's visit to DC tells lawmakers that Facebook is finally taking them seriously", "language": "en", "text": "Facebook CEO Mark Zuckerberg makes rounds of meeting in Russell Building where he discussed technology regulations and social media issues with senators on Thursday, September 19, 2019. He was making his way from a meeting with Sen. Mike Lee, R-Utah, to one with Sen. Josh Hawley, R-Mo. (Photo By Tom Williams/CQ-Roll Call, Inc via Getty Images)\n\nIn the past year, since Facebook CEO Mark Zuckerberg's last official visit to Washington, D.C., lawmakers around the world have scolded the executive for failing to give them face time.\n\nBut this week, Zuckerberg suddenly made himself extremely accessible to U.S. lawmakers and even President Donald Trump. During a surprise visit to D.C., Facebook was the one requesting meetings, including a Wednesday night dinner between Zuckerberg and a group of senators, some of whom have threatened regulations that could fundamentally change his business. Over the next two days, he met with several more lawmakers, including one who suggested he sell two of Facebook's most successful acquisitions before regulators potentially try to force a breakup.\n\nIt's quite a change from 2017, when Zuckerberg didn't even show up to the first congressional hearings about foreign powers using Facebook to try and influence the 2016 presidential election. Now, as the investigations and multi-billion dollar fines pile up, Zuckerberg seems to realize that things are getting serious. Following his meeting with Zuckerberg, Sen. Mark Warner, D-Va., said the CEO seems to understand that self-regulation is no longer on the table.\n\nIf Zuckerberg knows regulation is coming, it makes sense for him to get in front of the people making those laws and try and influence their thinking. Unlike when he testified before Congress, Zuckerberg was not under oath in his meetings with lawmakers. That means any commitments he made to champion a national privacy law or work on election security rely on his word alone.\n\n\"They're going to say it's a successful trip as long as they improved relationships and they made senators more likely to call Facebook if they have a problem or they're thinking of legislating in the area,\" said Matt Grossmann, an associate professor at Michigan State University who has written extensively about lobbying. \"Some of this is part of a long-term strategy and we shouldn't read into it an immediate policy goal.\"\n\nIndeed, Sen. Richard Blumenthal, D-Conn., who sits on the Senate Judiciary and Commerce Committees, said he was \"impressed\" by Facebook's interests in internet privacy, though he said he hopes to \"continue the conversation.\"\n\nFacebook's play is to \"avoid the worst case, rather than achieve their best,\" said Grossmann.\n\n\"Worst-case scenario is that there's policy being made that would impact their bottom line and they're not in the room,\" he said. \"So they want to ensure that that doesn't happen by acting open to the policy and posing their own ideas.\"", "description": "Lobbying experts said the visit is likely an attempt to be in lawmakers' ears as they consider legislation that would impact Facebook.", "authors": ["Lauren Feiner"], "top_image": "https://image.cnbcfm.com/api/v1/image/106139715-1568935821991gettyimages-1169577298.jpeg?v=1568998919", "published_at": "2019-09-21"}