{"pub": "aljazeera", "url": "https://aljazeera.com/ajimpact/row-india-central-bank-cuts-rates-191004062628768.html", "downloaded_at": "2019-10-04 09:17:20.936405+00:00", "title": "Five in a row: India's central bank cuts rates again", "language": "en", "text": "The Reserve Bank of India on Friday cut interest rates for a fifth straight time on Friday, stepping up efforts to kickstart economic growth languishing at a six-year low.\n\nThe RBI maintained its \"accommodative\" stance and said it would maintain this position \"as long as it is necessary\" to revive growth while ensuring inflation remains within target.\n\nAll six members of the monetary policy committee (MPC) voted to lower the repo rate, which is the rate at which the central bank lends to commercial banks, by 25 basis points (bps) to 5.15 percent.\n\nThe reverse repo rate - the interest rate the central bank pays commercial lenders for taking short-term deposits - was reduced to 4.9 percent.\n\nThe cuts were in line with analyst expectations, according to a Reuters poll.\n\nAll MPC members also voted in favour of continuing an accommodative stance towards monetary policy, the statement said, implying that more cuts could be on the way.\n\n\"The latest rate cut is not enough to revive growth on its own, but given the agressive policies so far, it will have an impact,\" Shilan Shah, Senior India Economist at Capital Economics told Al Jazeera.\n\n\"We still think there's another 25 bps rate cut in the pipeline,\" Singapore-based Shah said, adding that this could be announced when the MPC meets again in December.\n\nShares were little changed as the RBI decision was largely in-line with expectations.\n\nThe broader NSE Index, which was up 0.60 percent before the policy decision, pared those gains after the rate cut was announced and was last up 0.06 percent. The 10-year benchmark bond yield rose to 6.64 percent from 6.59 percent before the announcement, while the rupee was largely flat at 70.83 per dollar.\n\nWeak conditions to persist\n\n\"While the recent measures announced by the government are likely to help strengthen private consumption and spur private investment activity, the continuing slowdown warrants intensified efforts to restore the growth momentum,\" the MPC said in its statement.\n\nTo revive the faltering economy, the government in September announced a steep cut in the corporate tax rate - to 22 percent from 30 percent - triggering the biggest intraday gain in Indian stocks in more than a decade.\n\nAsia's third-largest economy expanded by just 5 percent in the June quarter, its slowest pace since 2013, on the back of low consumer demand and a slowdown in government spending amid global trade frictions.\n\nThe weak GDP numbers prompted several economists to lower their growth projections.\n\nThe RBI also cut its real gross domestic product (GDP) growth forecast for 2019/20 to 6.1 percent from a prior projection of 6.9 percent, citing forward-looking surveys that indicate persistently weak demand conditions will persist.\n\nIndia's central bank has now cumulatively lowered interest rates by 135 bps this year but the RBI said that \"transmission has remained staggered and incomplete\".", "description": "The quarter-percentage-point cut is the Reserve Bank of India's latest attempt to revive sluggish economic growth.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2018/11/2/0533e216fa9a47d9b464cafb4f8d0397_18.jpg", "published_at": "2019-10-04"}