{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7561101/Snakes-alive-Deadly-red-bellied-serpent-interrupts-funeral-slithering-GRAVE.html", "downloaded_at": "2019-10-11 04:00:40.490659+00:00", "title": "Snakes alive! Deadly red-bellied serpent interrupts a funeral by slithering into a GRAVE", "language": "en", "text": "A deadly snake has interrupted a funeral by slithering into a grave.\n\nMourners attending the service at Leppington Cemetery, south-west of Sydney, were left mortified after finding the red-bellied black snake in the grave.\n\nCory Kerewaro from Reptile Relocation Sydney was called at around 11am on Thursday to help remove the snake.\n\nCory Kerewaro from Reptile Relocation Sydney received a phone call that a snake (pictured) had disturbed a funeral service\n\nMr Kerewaro was called around 11am on Thursday to help remove the snake at the cemetery\n\n'I received a phone call from the funeral saying there was a snake,' he told Daily Mail Australia.\n\n'They were in a service and they had already began lowering the casket but had to pull it back up.'\n\nFootage shows Mr Kerewaro inspecting the grave and attempting to remove the reptile.\n\nHowever, he was not able to reach the sneaky serpent and bravely climbed down the ladder to capture it.\n\nMr Kerewaro was not able to reach the sneaky serpent and bravely climbed down the ladder, into the hole to find it\n\nRed-bellied Black Snakes are frequently found on the east coast of Australia (pictured: the snake found at the funeral)\n\nMr Kerewaro was seen digging around the grave searching for the snake, until finally noticing it near the bottom of the ladder.\n\nHe grabbed the serpent by the tail and held it away from him before placing it in a bag.\n\n'It certainly held the service up for a little bit,' he said.\n\nRed-bellied black snakes are found on the east coast of Australia.", "description": "Mourners attending the service at Leppington Cemetery, south-west of Sydney, were left mortified after finding the red-bellied black snake in the grave.", "authors": ["Sahar Mourad For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/02/19567506-0-image-a-27_1570758513594.jpg", "published_at": "2019-10-11"}