{"pub": "euronews", "url": "https://euronews.com/2019/10/25/vatican-erosary-app-hacked-multiple-times-just-days-after-launch", "downloaded_at": "2019-10-25 22:46:55.330026+00:00", "title": "Vatican eRosary app hacked multiple times just days after launch", "language": "en", "text": "A new gadget aimed at getting more young people to pray has been hacked at least three times in the days since its launch.\n\nThe Vatican unveiled its \"smart\" Rosary bracelet in mid-October.\n\nIt is activated by making the sign of the cross and connects to the \"Click to Pray\" eRosary app, which is designed to \"engage young people\" in prayer.\n\nBut just days after its launch, security concerns emerged.\n\nOne security researcher — who reportedly hacked the app in just 15 minutes — claimed on Twitter that he had contacted the Vatican afterwards so they could fix the issue together.\n\nAccording to the report, a security flaw in the mobile application could allow an attacker to take over the account of the victim and get the victim's personal information just by knowing the person's email address.\n\nThe gadget's Achilles' heel was nestled in the authentification system, which sent a pin code for the user to log in. A hacker could access the pin code to log in as the victim.\n\nA Holy See representative told Euronews that the \"Click to Pray\" application has been subject to at least three breaches since the launch, adding that the app developers had resolved each vulnerability \"in less than 24 hours\".\n\nFrédéric Fornos, director of the Pope's Worldwide Prayer Network, explained that the eRosary \"combines the best of Church tradition with the best of technology\".\n\nFornos also said the device was \"good for young people who seek to learn how to pray and who don't really know how to\" because it \"reminds them three times a day\".\n\nOnce connected to its application, the Rosary has specific content, such as thematic prayers, allowing fervent users to record and share their spiritual activity.\n\nBut the price is nothing to laugh at: developed in partnership with Korean GadgeTek, the eRosary is listed on the Italian website Acer for €99.\n\nMany have criticised the price, including Abbot Pierre Amar who is one of the authors of a French online blog run by priests. He denounced it as a scandal.", "description": "A new gadget aimed at getting more young people to pray has been hacked at least three times in the days since its launch.", "authors": [], "top_image": "https://static.euronews.com/articles/stories/04/25/93/88/1000x563_cmsv2_f693b3f0-9f9f-5688-9e14-0f44de2d98fa-4259388.jpg", "published_at": "2019-10-25"}