{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/every-new-pokemon-sword-shield-galar-region-2019-7", "downloaded_at": "2019-10-10 15:35:22.337291+00:00", "title": "Every new Pokémon coming to 'Pokémon Sword and Shield' this November that we know about, from Alcremie to Zigzagoon", "language": "en", "text": "\"Pokémon Sword\" and \"Pokémon Shield\" will be released on the Nintendo Switch on November 15.\n\nThe games will introduce dozens of new Pokémon from the Galar region, a new area in the Pokémon world.\n\n\"Sword\" and \"Shield\" will bring the total number of Pokémon in the series to more than 1,000, but the games won't include every Pokémon from franchise history.\n\nVisit Business Insider's homepage for more stories.\n\nA pair of brand-new Pokémon games are headed to the Nintendo Switch on November 15, and they'll introduce a whole new generation of Pokémon to fans.\n\n\"Pokémon Sword\" and \"Pokémon Shield\" mark the eighth generation of Pokémon games, and will bring the total number of Pokémon to more than 1,000.\n\nLike the original Pokémon titles, \"Sword\" and \"Shield\" are role-playing games. Players will adventure through the brand-new Galar region, capturing Pokémon and battling other trainers on their way to becoming the Pokémon champion.\n\nHowever, \"Sword and Shield\" will be the first main Pokémon games not to include every species of Pokémon in the prior games. While many fan-favorites like Pikachu and Charizard are confirmed to return, players will spend more time getting familiar with the new species of Pokémon introduced in the Galar region. Some of the older Pokémon, like Ponyta and Weezing, have unique Galarian forms with new abilities while other classic Pokémon like Farfetch'd and Zigzagoon have new evolutions.\n\nRead more: Pokémon fans are accusing the developers of being 'lazy' for not including all 1,000-plus Pokémon in the new Nintendo Switch games\n\nPlayers will choose from one of three new starter Pokémon — Grookey, Scorbunny, and Sobble — at the start of their adventure and encounter hundreds more Pokémon as they explore Galar. Nintendo has revealed about 20 new Pokémon so far, and there are sure to be dozens more by time the games arrive in November.\n\nHere are all of the new Pokémon we've seen in \"Pokémon Sword and Shield\" so far, with their official descriptions:", "description": "Dozens of new Pokémon are coming to \"Pokémon Sword and Shield\" on the Nintendo Switch this November, including new evolutions for fan favorites.", "authors": ["Kevin Webb"], "top_image": "https://image.businessinsider.com/5d9f42363b33a71a7a1fccb2?width=1200&format=jpeg", "published_at": "2019-10-10"}