{"pub": "cnn", "url": "https://edition.cnn.com/2019/09/20/americas/justin-trudeau-brownface-photo-toronto/index.html", "downloaded_at": "2019-09-22 06:04:09.287716+00:00", "title": "Justin Trudeau poses for selfies, hugs supporters in Canada's most ethnically diverse city amid blackface scandal", "language": "en", "text": "(CNN) Prime Minister Justin Trudeau took his campaign to Canada's most ethnically diverse city on Friday, issuing yet another mea culpa for old blackface images, and posing for selfies and hugging supporters on the streets of Toronto.\n\nTrudeau's pledge to ban military style rifles in Canada was overshadowed by renewed questions about him appearing in blackface in three separate incidents and the possible disclosure of more embarrassing images.\n\nAsked about reports that more offensive photos would surface, Trudeau told reporters Friday, \"I have nothing to confirm on that.\"\n\nThe prime minister said he was \"wary about being definitive\" on the existence of additional images because he had failed to remember the ones that had already come out. As he has done for days, Trudeau called himself an ally in the fight for social justice and highlighted his administration's efforts to fight racism and intolerance.\n\nBefore appearing with an ethically mix group of supporters for the gun control announcement, Trudeau stumped along a commercial stretch of Toronto. He displayed his rock star popularity as he tried to appear contrite about the scandal. He exchanged hugs and handshakes and posed for numerous pictures less than five weeks before the October 21 election.\n\nRead More", "description": "Prime Minister Justin Trudeau took his campaign to Canada's most ethnically diverse city on Friday, issuing yet another mea culpa for old blackface images, and posing for selfies and hugging supporters on the streets of Toronto.", "authors": ["Ray Sanchez"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190919144537-01-trudeau-blackface-speech-0919-super-tease.jpg", "published_at": "2019-09-20"}