{"pub": "cbc", "url": "https://cbc.ca/sports/basketball/nba/the-buzzer-nba-season-preview-1.5329253", "downloaded_at": "2019-10-22 13:31:40.858737+00:00", "title": "CBC Sports", "language": "en", "text": "A new NBA season tips off Tuesday night, and the title hasn't looked this up-for-grabs in years. After a monumental Finals upset and an equally monumental off-season that completely shifted the balance of power in the league, this feels like the start of a new era. So here's a look at where things stand and what to watch for in 2019-20:\n\nDon't expect the Raptors to win the title again — but don't expect them to fall apart either\n\nToronto isn't your typical defending champion. The Raptors' chances of repeating the first title in franchise history are unusually slim after they lost Kawhi Leonard — the Finals MVP and arguably the best player in the world — to the Clippers in free agency. It's extremely rare for a title team to lose its top guy. And the Raptors didn't add anyone of significance to offset that massive loss. That's the bad news.\n\nThe good news is that, apart from Danny Green, everyone else from the championship-winning supporting cast is back. And the Eastern Conference is (as usual) pretty soft. So unless president Masai Ujiri decides to trigger a rebuild by trading veterans like Marc Gasol and Serge Ibaka (maybe even Kyle Lowry) to contenders, there's a decent chance the Raptors finish in the top four in the East and have home-court advantage in the first round of the playoffs.\n\nA lot of that will depend on Pascal Siakam, who's in position to become the next face of the franchise after agreeing to a four-year, $130-million US max contract extension over the weekend. Siakam was the NBA's Most Improved Player last season and a key part of the title run. Now he's expected to become the go-to guy. Read more about how Siakam might complete his transformation into one of the league's best players here.\n\nThe Toronto Raptors open up their season as defending champs on Tuesday night, hosting the New Orleans Pelicans. Canada's team is motivated to defend their title. 1:35\n\nThe dominant team of the last half-decade is gone — at least as we knew it\n\nAfter the Golden State Warriors blossomed into one of the greatest teams of all time in 2014-15 and won the title, we went into the next few years assuming they'd do it again. They didn't always — the Warriors ended up \"only\" winning three of the past five championships — but they made the Finals every year and were always the team to beat.\n\nNot anymore. A combination of injury, age and free agency have eroded the Golden State dynasty. Superstar Kevin Durant tore his Achilles in the Finals and then left for Brooklyn in free agency; another future hall of famer, Klay Thompson, won't be available until very late in the season (if at all) after tearing his ACL in the final game against Toronto; essential veteran Andre Iguodala was traded to Memphis to save salary-cap room; important role player Shaun Livingston retired.\n\nThe Warriors are far from dead. They still have one of the world's best players in Steph Curry and one of the best two-way guys in Draymond Green, and they added a good scorer in D'Angelo Russell. So there will be nights when they look just fine. But the supporting cast is paper thin and the Western Conference is a viper pit, so it's not a given this team even makes the playoffs.\n\nLos Angeles is now the centre of the basketball universe\n\nTwo teams that share an arena in L.A. are co-favourites to win the title. The Clippers pulled off one of the most stunning set of moves in NBA history by signing Kawhi away from the NBA-champion Raptors and pairing him with another MVP-calibre star by trading for Paul George. The Lakers already had LeBron James, and they created their own superstar duo by sending a king's ransom to New Orleans for big man Anthony Davis.\n\nThe new L.A. rivalry should be a lot of fun, but we might not get full satisfaction from it until playoff time. George is out for at least a few weeks as he continues to recover from surgery on both shoulders, and Kawhi is famous for his dedication to \"load management\" — taking games off in the regular season to stay fresh for the playoffs. It obviously paid off for him, so Davis and LeBron (and a lot of other stars around the league) might try it more aggressively this season.\n\nThere won't be a dull moment in Houston\n\nThe Rockets have been in the news for all the wrong reasons after GM Daryl Morey created an international incident by tweeting his support for the people in Hong Kong protesting against the ruling Chinese government. That's taken up so much oxygen that you might forget Houston made a blockbuster trade after another disappointing playoff exit. Morey sent still-solid but aging vet Chris Paul to Oklahoma City for Russell Westbrook — one of basketball's most polarizing players. No one questions Westbrook's athleticism, work ethic or heart. But he's also one of the most frustrating players in the game because he thinks he's better than he is, leading to a lot of questionable shots and poor decision-making in general.\n\nWestbrook was allowed to run the show in OKC, but now he has to work with another headstrong star. James Harden averaged an incredible 36 points last season (only Michael Jordan and Wilt Chamberlain have ever hit that number) but he's never led his team to the Finals and he clashed with Paul last year. Can he get along with Westbrook? Either way, it'll be fascinating.\n\nThere's no telling how this ends. (Michael Wyke/Associated Press)\n\nNew Orleans is rising\n\nThe Pelicans are coming off a nightmare season. Anthony Davis' demand to be traded more than a year before the end of his contract, and the team's refusal to send him to the Lakers until they got a better offer in the summer, made for an embarrassing situation and an embarrassing record — New Orleans finished with the third-worst record in its conference. But then it lucked out and won the lottery for the right to draft phenom Zion Williamson — the best prospect in years.\n\nJust when things were looking up, though, Zion injured his knee during the pre-season and will reportedly be out for at least a few weeks. Still, at least there's hope for this team now.\n\nThe top team in the East is anyone's guess\n\nMilwaukee had the best record in the league last year thanks to the incomparable Giannis Antetokounmpo, who has a good chance to repeat as MVP. But his supporting cast couldn't match Toronto's in their playoff series. Philadelphia was a bounce (make that four bounces) away from beating the eventual-champion Raptors in the second round. The Sixers have a giant lineup (they signed big man Al Horford when guard Jimmy Butler decided to leave for Miami) but they lack a go-to perimeter scorer in crunch time unless young point guard Ben Simmons figures out how to shoot.\n\nBoston was one of the league's biggest disappointments last year, but the Celtics hope better chemistry will produce better results after swapping out the talented but toxic Kyrie Irving for Kemba Walker, who can score and also get along with people. And we already mentioned the Raptors, who seem like they'll put up a fight in defence of their title, even if they're ultimately outgunned without Kawhi.\n\nCanadians could have a say in how this season plays out\n\nThe three most interesting Canadian players in the NBA this season are Jamal Murray, Shai Gilgeous-Alexander and RJ Barrett. Murray is the best perimeter player on a Denver Nuggets team that had the fourth-best record in the league last season. He averaged a career-high 18.2 points.\n\nGilgeous-Alexander is a favourite of NBA aficionados. He had a solid rookie year with the Clippers and might get a bigger role with Oklahoma City after it acquired him in the Paul George trade. OKC might surprise some people after trading away George and Westbrook, and Gilgeous-Alexander is a big reason why. Barrett could be in the mix for rookie of the year (if Zion misses a lot of time) after the Knicks picked him third overall. New York is a bad team, so he should be able to get the playing time and shots to put up good numbers.\n\nThis is an excerpt from The Buzzer, the CBC Sports daily newsletter. Stay up to speed on what's happening in sports by subscribing below.", "description": "After a monumental Finals upset and a wild summer that completely shifted the league's balance of power, this feels like the start of a new era in the NBA. Here's what you need to know for the 2019-20 season.", "authors": [], "top_image": "https://i.cbc.ca/1.5329277.1571688545!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/leonard-kawhi-20191010.jpg", "published_at": "2019-10-21"}