{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3068769&cloc=joongangdaily|home|online", "downloaded_at": "2019-10-07 12:11:48.293134+00:00", "title": "‘Joker’ laughs its way to the top of the box office: The buzzworthy film exceeded sales estimates worldwide in first week", "language": "en", "text": "“Joker” clutched the top spot at both the local and North American box office for the weekend as moviegoers were eager to find out how director Todd Phillips and actor Joaquin Phoenix put together the film that took home the Golden Lion award at this year’s Venice International Film Festival. [WARNER BROS. PICTURES]\n\nAs expected, “Joker” had a big debut at the local box office thanks to enthusiastic fans who waited a long time to see the acclaimed film that won the Golden Lion at the 2019 Venice International Film Festival.The psychological thriller drew 1.3 million people to 1,418 screens over its first weekend and shot straight to the top spot. Overall, the film has sold a total of 2.2 million tickets since its release on Oct. 2. Played by award-winning actor Joaquin Phoenix, many local moviegoers have applauded the actor’s convincing portrayal of his transition from the social outcast Arthur Fleck to the Joker, with critics commenting that they “got goose bumps” seeing his performance. Director Todd Phillips described Phoenix’s performance as “transcendent” during a live conference held with local press that took place last month.Local romantic comedy “Crazy Romance” took the second spot in its first weekend, gathering 625,000 moviegoers to 1,069 screens. The story revolves around Sun-young (played by Gong Hyo-jin) and Jae-hoon (played by Kim Rae-won) who meet while they are suffering from the aftermath of each own’s breakup. Although the film was overshadowed by the local premiere of “Joker,” reviews are overwhelmingly positive. Moviegoers who’d seen the film unanimously agreed that the film depicts a brutal, yet overwhelmingly realistic side of romance between two people.Local comedy “Man of Men” debuted in third, selling 325,000 tickets through 803 screens.Featuring well-known actors Seol Kyung-gu and Cho Jin-woong, the film is about Young-gi (played by Cho), a gangster who wants “to have it all” in one go, which is why he foolishly steals 700 million won ($585,000) from his boss to invest it all, hoping that he can reap a fortune. Instead, however, he loses it all and is at risk of losing his life when a coldhearted, but terminally ill law firm CEO named Jang-soo appears in front of him. Jang-soo proposes a deal which would allow Young-gi to acquire his death benefit worth 12 million won if Young-gi helps him strike things off of his bucket list for two months. Young-gi believes that this is the once-in-a-lifetime opportunity to have everything he has ever dreamed of.The war film “Battle of Jangsari” fell to fourth place against the slew of new releases. The film sold 102,000 tickets at 650 screens.Russian animated film “The Princess and the Dragon” landed at fifth, attracting 36,000 people to 469 screens. The protagonist, Sophie, embarks on a magical adventure when she comes across an enchanted book and finds herself plunged into the middle of the book’s world.In North America, the filmmakers and studio behind “Joker” have reason to put on a happy face. Despite concerns over its violent themes and ramped up theater security, audiences flocked to the multiplex to check out the film, resulting in a record October opening.Warner Bros. said Sunday that “Joker” grossed an estimated $93.5 million in ticket sales from 4,374 screens in North America. The previous October record holder was the Spider-Man spinoff “Venom” which opened to $80 million last year. Internationally, “Joker” earned $140.5 million from 73 markets, resulting in a stunning $234 million global debut.“This was a much larger result at the box office than we had ever anticipated globally,” said Jeff Goldstein, Warner Bros. president of domestic distribution. “Putting records aside, we’re just thrilled that audiences are embracing the movie as strong as they are.”The film from director and co-writer Todd Phillips was always seen as a bit of a gamble with one of the studios’ most valuable pieces of intellectual property, hence its modest-for-a-comic-book-film $55 million budget.But in the weeks leading up to its release, hype and uneasiness intensified beyond how audiences would react to placing this character in a realistic and unambiguously adult setting with “Taxi Driver” undertones. Responding to anxiety that the film might have the potential to inspire violence, multiple theater chains banned costumes or reaffirmed earlier policies regarding masks, and authorities in numerous cities said they were placing police patrols around theaters. Some relatives of the victims of the 2012 Aurora movie theater shooting even asked Warner Bros. to commit to gun control causes - the studio said it always has.While some worried this would impact the box office, it did not ultimately detract audiences from turning out opening weekend; the box office surpassed industry expectations and may rise even higher when weekend actuals are fully reported. Although the film got a B+ CinemaScore from opening night audiences, the studio is optimistic about its long-term playability.“Sixty-six percent of the audience was under the age of 35,” Goldstein said. “That tells you that the audience will expand out with that younger group as time goes on.” The younger audience also gave the film a more favorable A- CinemaScore.Paul Dergarabedian, the senior media analyst for box office tracker Comscore, said that the convergence of critical acclaim and controversy actually helped the film become bigger than expected at the box office.“It’s the ultimate water cooler movie right now,” Dergarabedian said.He added that it was important that “Joker” was always marketed as a “very dark, R-rated film.”“It always had an element of mystery and danger surrounding it,” Dergarabedian said. “If it was a G-rated film, controversy like this would not be a good thing.”In the landscape of R-rated comic book films, “Joker” is nestled between “Deadpool” and its sequel, both of which opened over $125 million, and “Logan,” which launched with $88.4 million.“Joker” was the only new wide release this weekend, which is down from last year when both “Venom” and “A Star is Born” opened. Holdovers populated the top 10: The more family-friendly “Abominable” landed in second place with $12 million in its second weekend, and “Downton Abbey” took third in its third weekend with $8 million.With awards buzz behind it, the Judy Garland biopic “Judy,” starring Renee Zellweger, added nearly 1,000 screens this weekend and placed seventh with $4.5 million from 1,458 locations.And in limited release, Pedro Almodovar’s critically acclaimed “Pain and Glory” launched on four screens to a solid $160,087. Less fortunate was the Natalie Portman-led astronaut drama “Lucy in the Sky” which earned only $55,000 from 37 theaters resulting in a dismal $1,500 per screen average.BY LEE JAE-LIM, AP [lee.jaelim@joongang.co.kr]", "description": "", "authors": [], "top_image": "https://pds.joins.com/jmnet/koreajoongangdaily/_data/photo/2019/10/07194437.jpg", "published_at": "2019-10-07"}