{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/15/WS5da51f17a310cf3e355707c9.html", "downloaded_at": "2019-10-15 02:17:55.081631+00:00", "title": "Metro sells majority stake to Wumei", "language": "en", "text": "By Wang Zhuoqiong | China Daily | Updated: 2019-10-15 09:21\n\nA promotion attracts consumers at a Metro supermarket in Jinan, capital of Shandong province. [Photo provided to China Daily]\n\nGerman wholesaler Metro AG's decision to sell a majority stake in its Chinese operations to Beijing-based Wumei Technology Group has highlighted the growing challenges faced by international retailers and the rise of domestic retailing companies.\n\nMetro said it would sell close to 80 percent of its stake in the Chinese operations and retain a 20 percent stake. The transaction values Metro China at an implied total enterprise value of 1.9 billion euros ($2.09 billion).\n\nJason Yu, general manager of Kantar Worldpanel, said the price indicates the investors' optimistic views on Metro's profit capabilities.\n\n\"Metro's years of penetration into the country's business-to-business clients, middle-income consumers, and its strengths in product quality and global supply chains, strong property assets, have given it an advantage in the deal,\" said Yu.\n\nThe German company has developed sales channels including O2O as well as fast-growing food service distribution and welfare and gifting business lines.\n\nUnlike other foreign retailing giants that have left the market as a result of financial losses, Metro has actually managed to gain sound revenue and profit in recent years.\n\nIt earned a revenue of 2.7 billion euros and has 97 stores in 59 cities, with robust sales growth over 23 years, and an EBITDA margin of more than 5 percent for the financial year 2017 to 2018.\n\nWith 17 million members, Metro also has strong core ownership, solid food safety record and its own brand offerings. But its business-to-business model has been found challenging in the local market where caterers and shop owners prefer to shop in wholesale markets or directly source products from distributors, said Yu. Most of all, Metro's global focus on becoming a fully-fledged wholesaler has pushed the retailer to look for a buyer in China.\n\nIt is not exaggerating to say that the dynamic and fast-paced Chinese retail market has been a graveyard for multinational retailers.\n\nIn recent years, several international retailers have exited the market, with Walmart the sole exception, thanks to its high-end membership format Sam's Club.\n\nIn June this year, Nanjing-based home appliances retailer Suning said it was buying an 80 percent stake in French supermarket giant Carrefour China in a deal worth 4.8 billion yuan ($670 million). British retailer Tesco in 2014 sold its 131 stores to China Resources, after incurring losses of more than 11.3 billion yuan. In the same year, Kingfisher, the United Kingdom-based home improvement retailer, sold its B&Q China business to Wumei Holdings Inc for 140 million pounds ($219 million).\n\nWumei attracted Metro's attention thanks to its local sourcing strengths for fresh food and its digital capacities from technology partner Dmall, a mix to accelerate Metro China's growth and digital transformation.\n\nWenzhong Zhang, founder and chairman of Wumei, said: \"We are convinced that Wumei and Dmall are the ideal partners for Metro AG to fully realize the potential of Metro China given our unique combination of retail DNA and digital excellence, our local knowledge and our strong and proven expertise in consolidating and growing multinational brands in China to deliver an enhanced customer proposition.\n\nMetro China will remain a stand-alone business led by Claude Sarrailh, Metro China's chief executive officer. The joint venture will maintain the current store footprint and all commercial operations while planned store openings will continue, according to Wumei.\n\nWumei Technology Group is one of the largest leading Chinese retailers, operating more than 1,000 hypermarkets, convenience stores, department stores and home improvement formats, generating annual sales in excess of 50 billion yuan.\n\n\"The joint venture will lift Wumei as a national retailer from its current position as mostly a regional player if excluding the group's home improvement formats,\" said Yu.", "description": "German wholesaler Metro AG's decision to sell a majority stake in its Chinese operations to Beijing-based Wumei Technology Group has highlighted the growing challenges faced by international retailers and the rise of domestic retailing companies.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/15/5da51f17a310cf3e97a13d23.jpeg", "published_at": "2019-10-15"}