{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/sam-alvey-broken-hand-out-shogun-rua-fight-ufc-on-espn-plus-22", "downloaded_at": "2019-10-28 00:31:52.669733+00:00", "title": "Sam Alvey: Broken hand behind 'heartbreaking' withdrawal vs. 'Shogun' Rua at UFC on ESPN+ 22", "language": "en", "text": "Sam Alvey has confirmed a broken hand was the culprit behind his withdrawal from the UFC on ESPN+ 22 co-main event against Mauricio Rua.\n\nAs was first reported by Combate, Alvey (33-13 MMA, 10-8 UFC) was recently forced to pull out of his scheduled light heavyweight matchup with former UFC champ Rua (26-11 MMA, 10-9 UFC) on the Nov. 16 card, which takes place at Ginásio do Ibirapuera in Sao Paulo and streams on ESPN+.\n\nOn Sunday, Alvey confirmed the report and shared an X-ray as well as a statement with details about what happened to his left hand (via Instagram):\n\nI’m here to tell you some unfortunate news, I broke my hand the other day in practice punching a guy int he head. It wasn’t a good punch. Maybe it was a great punch? He’s fine. So it wasn’t that good of a punch. Unfortunately I have to pull out of my fight with “Shogun.” It’s heartbreaking. Hand breaking and heart breaking. It’s a fight I’ve wanted my whole career. He’s just such an incredible athlete, such an incredible fighter. I was excited to share the octagon with him and I’m so sorry “Shogun” for you and your team. I don’t mean to do this to you. Whoever they get to replace me I hope you win that fight then you and I can run it back. We’ll make it a great one someday. Good luck on the rest of your camp. I’m going to heal as fast as I can and I’ll be back in that octagon as fast as I can be. Thank you for all your support.\n\nAlvey’s withdrawal from UFC on ESPN+ 22 marks just the second time in his 18-fight UFC tenure that he’s pulled out of a scheduled bout. The other time came in February 2016.\n\n“Shogun” is now left without an opponent, and with 20 days until the event, no replacement has been announced.\n\nThe UFC on ESPN+ 22 lineup currently includes:\n\nMAIN CARD (ESPN+, 8 p.m. ET)\n\nJan Blachowicz vs. Ronaldo Souza\n\nMauricio Rua vs. opponent TBA\n\nJared Gordon vs. Charles Oliveira\n\nJames Krause vs. Sergio Moraes\n\nMarkus Perez vs. Wellington Turman\n\nAntonio Arroyo vs. Andre Muniz\n\nPRELIMINARY CARD (ESPN+, 5 p.m. ET)\n\nEduardo Garagorri vs. Ricardo Ramos\n\nBobby Green vs. Francisco Trinaldo\n\nWarlley Alves vs. Randy Brown\n\nRenan Barao vs. Douglas de Andrade\n\nPriscila Cachoeira vs. Ariane Lipski\n\nTracy Cortez vs. Duda Santana", "description": "Sam Alvey has confirmed a broken hand was the culprit behind his withdrawal from the UFC on ESPN+ 22 co-main event against Mauricio Rua.", "authors": ["Mma Junkie Staff", "Blue Corner", "Farah Hannoun", "Simon Head", "Matt Erickson", "Mike Bohn", "Abbey Subhan", "John Morgan", "The Blue Corner"], "top_image": "https://usatmmajunkie.files.wordpress.com/2019/07/klidson-abreu-sam-alvey-ufc-on-espn-4-8.jpg?w=1000&h=576&crop=1", "published_at": "2019-10-27"}