{"pub": "rt", "url": "https://rt.com/news/471603-hong-kong-bill-withdrawn", "downloaded_at": "2019-10-23 09:47:03.640087+00:00", "title": "Controversial Hong Kong extradition bill officially WITHDRAWN after 20 weeks of protests & rioting", "language": "en", "text": "Hong Kong authorities officially withdrew the extradition bill that has sparked months-long massive protests and violent riots across the city.\n\nThe city’s security chief John Lee announced that the bill was effectively withdrawn on Wednesday. In response, several opposition lawmakers tried to heckle Lee’s speech, demanding his resignation.\n\nThe bill, which would have allowed the extradition of criminal suspects from Hong Kong, China’s self-governing territory, to mainland China triggered massive protests in summer. Protesters and human rights campaigners feared that Beijing may use the legislation to target dissidents.\n\nWhile some rallies remained peaceful, others spiraled into widespread rioting and fierce clashes with police.\n\nAlso on rt.com Foreign-instigated color revolutions fuel global unrest, Beijing says in veiled attack on US\n\nReacting to the unrest, Hong Kong Chief Executive Carrie Lam suspended work on the bill and later said that the draft legislation was de facto “dead.” She also offered dialogue with the residents to defuse the situation.\n\nThe protesters, however, refused to back down, saying that the authorities have reacted too late, and axing the bill alone is no longer enough. Protest leaders have been warning that anti-government rallies will continue until a number of their other demands are met; these include granting amnesty in relation to the riots and carrying out election reform.\n\nProminent anti-government campaigner Agnes Chow reiterated on Wednesday that the withdrawal of the extradition bill came “too late” and called on Hongkongers not to “give up” and to continue protesting.\n\nThink your friends would be interested? Share this story!", "description": "Hong Kong authorities officially withdrew the extradition bill that has sparked months-long massive protests and violent riots across the city.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5db00ad985f54026b96dd8c1.jpg", "published_at": "2019-10-23"}