{"pub": "guardian", "url": "https://theguardian.com/football/2019/oct/09/robin-fraser-colorado-rapids-african-american-coaches", "downloaded_at": "2019-10-09 12:03:58.006895+00:00", "title": "How Colorado’s Robin Fraser is breaking ground for black coaches in MLS", "language": "en", "text": "Robin Fraser stood stoic on the sideline at Red Bull Arena as the Colorado Rapids stymied the New York Red Bulls. To his right his former teammate, Chris Armas, was trying to rally the Red Bulls to come from behind, but a second Rapids goal has put the game to bed. It was the beginning of a stretch for the Colorado that would see the team win five out of six games, before falling just short of this season’s MLS playoffs.\n\n“Really fucking good, that felt really good,” Fraser said when a Rapids staffer asked him how he felt after the whistle. He had not held a head coaching job for nearly seven years when the Rapids offered him the opportunity to return to his native Denver. In that span, Fraser served as the tactician behind the Red Bulls’ Supporters’ Shield win in 2013, and was the assistant to long-time friend Greg Vanney when Toronto FC became the first MLS team to win a domestic treble in 2017 and came within a penalty shootout of winning the Concacaf Champions League the following spring.\n\nBastian Schweinsteiger announces retirement from football at age of 35 Read more\n\nWhen Fraser took the sidelines again, it ended a span of over year in which MLS did not have a black coach. He is the fifth black coach ever in MLS and just the second African American. Before the Rapids’ offer came along, Fraser had been linked with several opportunities when he was an assistant. In interviews with the Guardian and others, Fraser said he didn’t think race played a role in whether he was passed over for previous opportunities.\n\nAlthough MLS has its own version of the ‘Rooney Rule’ – mandating teams to interview minority candidates for any coaching or technical staff position – there are few African Americans on backroom staffs. One reason is the relatively high cost of coaching courses with A license courses costing $4,000. These costs weigh heavier on members of disadvantaged communities. The FA acknowledged this and implemented grants for coaches from black, asian and minority ethnicities to cover Uefa coaching costs, but USSF has not implemented a similar program. Still, Fraser said he saw the makeup of his coaching classes diversify.\n\n“Once upon a time, it was easier to go get licensed, but the courses now are far more detailed and as a result we are on the cusp of coaches becoming better and it’s something that I’ve seen over the last five or six years,” Fraser said. “I feel like over the last five or six years, the coaching has gotten better because of the education and coaches are learning in a number of these advanced courses that are being offered.”\n\nFraser said he was able to move more quickly through the process because he was a former player. US Soccer’s Pro License is only available to professional coaches. He said he has noticed that there are more minorities in the coaching classes that he recently took than when he began his education more than a decade ago.\n\n“When I did the Pro Course, it was only 12 to 15 people so it’s hard for me to say what the courses look like, but I do think there is a greater diversity of coaches coming through the courses,” Fraser said. “It’s a function of the net being wider and more people playing. There’s a greater diversity of players and that means there’s a greater of ex-players who are trying to be coaches.”\n\nColorado Rapids (@ColoradoRapids) 🗣 \"He is what the next great American manager looks like.\"\n\n\n\nHIGH praise for Robin Fraser from @TimHowardGK.#Rapids96 | #Elevate pic.twitter.com/WtQdY5QJtz\n\nThe Rapids are in a metro area with nearly three million people – almost a quarter of whom are Hispanic. There are around 20 minority players on the Rapids’ two oldest academy teams and the team scouted the recent Sueño Alianza showcase, one of the largest tournaments for undiscovered Latino youth soccer players in the United States. The Rapids were only one of six MLS teams to scout the national showcase though they also scout local events for Latino players as well. Their participation in such efforts leads Fraser to say that the net for potential players – and eventually, managers – is widening.\n\n“I think it’s different now and the net has been widened now and opportunities are being afforded to more kids than perhaps were offered before and we’re finding talent in places where we haven’t found talent before,” Fraser said. “It’s directly reflected when you look at youth games and academy games now. There’s matter to be found from all ethnic groups and most clubs are trying to find the best possible players and if you widen the net, you’re going to find a greater diversity of players.”\n\nJonathan Lewis, who scored both goals in that late August win against the Red Bulls, compared Fraser to both Patrick Vieira – the OGC Nice manager who coached him at New York City FC – and US men’s national team head coach Gregg Berhalter, who included him on the roster for last summer’s Gold Cup. Lewis told the Guardian that Fraser used his first training session to preach the same principles of possession play and positioning that Vieira and Berhalter emphasize. Beyond the shared philosophies, the two of them have also been able to connect over both being Jamaican-American as well.\n\n“He’s given me some really good advice and I’ve known him for a month,” Lewis said. “Until I got hurt, I had been playing some of the best football in my career and we have a connection. Him and I being half-Jamaican, we’re able to connect beyond player-to-coach but at a personal level as well. He’s someone that I’ve taken a liken to and he’s teaching me. … He trusts me and is giving me the ability to learn from my mistakes.”\n\nFraser’s philosophies got their origin in the car ride conversations to practice he and Vanney had when they were teammates with the LA Galaxy and coaching a U12 girls team on the side during the late 1990s. Last month, Fraser’s Rapids rallied from two goals down during his return to BMO Field, but Vanney’s Reds found a third to give his former assistant his only defeat up to that point. Vanney said it was clear Fraser had taken what he learned from when the two worked together and applied it to the Rapids.\n\nTim Howard and Robin Fraser were once contemporaries playing in MLS during the late 90s and 2000s. This season, Howard has battled injuries while serving as the mentor to a young, hungry Rapids team. No matter what happens, he told reporters after last weekend’s win against FC Dallas, the Rapids have a better mentor in Fraser than him. And American soccer may have its next great coach.\n\n“He is what the next great American manager looks like,” Howard said. “That’s what success will look like in MLS. I’ve seen it up and down Europe and the best coaches aren’t the ones with the best ideas. They’re the ones who can articulate those ideas and get the light bulb go off for players. And the light bulb’s going off everywhere.”", "description": "The longtime MLS assistant and former USA defender is only the second African American head coach in league history", "authors": ["Christian Araos"], "top_image": "https://i.guim.co.uk/img/media/d8919dfe1b8d281ddbf21582d4dce2d941f89f4b/0_13_3851_2310/master/3851.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c80a68dbfb014836b3c840f4f23c2971", "published_at": "2019-10-09"}