{"pub": "usatoday", "url": "https://usatoday.com/story/news/nation/2019/10/22/design-error-blamed-florida-international-university-pedestrian-bridge-collapse/2449316001", "downloaded_at": "2019-10-22 15:35:03.867856+00:00", "title": "Design errors draw blame in collapse of FIU pedestrian bridge that killed 6", "language": "en", "text": "USA TODAY\n\nDesign errors for a pedestrian bridge that collapsed in Miami last year, killing six people and injuring 10 others, drew sharp scrutiny at a federal hearing on the tragedy Tuesday in Washington, D.C.\n\nThe National Transportation Safety Board was outlining the \"probable cause\" for the collapse before issuing its final report. The 174-foot-bridge section, designed to connect Florida International University with the city of Sweetwater, was still under construction on March 15, 2018, when it crashed to the road below.\n\nEight vehicles were crushed, seven of which were occupied.\n\nAn investigative update issued by the NTSB a year ago said design errors by FIGG Bridge Engineers, which designed the structure, overestimated how much stress the structure could take. Cracking observed in the bridge before the collapse was consistent with those design errors, the NTSB said at the time.\n\n\"The FIGG design made significant errors in the determination of loads,\" NTSB staffer Dan Walsh said Tuesday.\n\nWalsh said the construction was \"high risk\" due to the complex design of the bridge. But he added that the school was overseeing the project, and the state Transportation Department was not required to have an inspector on site.\n\n\"Our recommendations address this issue, that FDOT should have more authority on this type of project,\" Walsh said.\n\nA blistering report released in June by the U.S. Occupational Safety and Health Administration said at least one worker had alerted engineers of extensive cracking before the bridge fell. That should have prompted an order to close the street below and reinforcement of the structure, OSHA said.\n\nFIGG said the cracks had shown no signs of expanding and had not appeared to present a safety concern, according to the OSHA report.\n\nTwo days before the collapse, a FIGG engineer left a voicemail with state transportation officials warning of cracks in the structure. A transcript of a voice mail from W. Denney Pate included Pate saying “some cracking” had been observed on the north end of the span.\n\n“We’ve taken a look at it and, uh, obviously some repairs or whatever will have to be done, but from a safety perspective we don’t see that there’s any issue there so we’re not concerned about it from that perspective,\" Pate said. \"Although obviously the cracking is not good and something's going to have to be, ya know, done to repair that.\"\n\nThe $14.2 million bridge, when completed would have been 289 feet long and 109 feet tall. The bridge was being built under “accelerated bridge construction” methods championed at FIU. The methods allow larger pieces to be fabricated away from traffic, rather than assembling lots of smaller pieces above a busy road.\n\nFIU President Mark Rosenberg lauded the project when the section was dropped into place days before tragedy.\n\n“FIU is about building bridges and student safety,\" Rosenberg said. \"This project accomplishes our mission beautifully.\"\n\nContributing: Bart Jansen and Alan Gomez", "description": "The NTSB could make a final ruling Tuesday on the cause of a pedestrian bridge collapse at FIU in Miami that killed six people and injured 10.", "authors": [], "top_image": "https://www.gannett-cdn.com/presto/2019/10/22/USAT/d3765638-db5c-4a53-8110-1db009aae646-University_Bridge_Collapser.JPG?crop=2735,1539,x0,y37&width=2599&height=1539&format=pjpg&auto=webp", "published_at": "2019-10-22"}