{"pub": "abcnews", "url": "https://abcnews.go.com/US/start-here-whistleblower-complaint-trump-call-involves-ukraine-sources/story?id=65728478", "downloaded_at": "2019-09-20 13:03:04.077934+00:00", "title": "'Start Here': Whistleblower complaint about Trump call involves Ukraine, sources say", "language": "en", "text": "It's Friday, Sept. 20, 2019. Let's start here.\n\nInterested in Start Here Morning Briefing ? Add Start Here Morning Briefing as an interest to stay up to date on the latest Start Here Morning Briefing news, video, and analysis from ABC News. Add Interest\n\n1. Whistleblower complaint\n\nA whistleblower complaint concerning President Donald Trump's communications with a foreign leader over the summer involves Ukraine, multiple sources familiar with the matter tell ABC News.\n\nIt's unknown what exactly was discussed, but the White House has previously said that Trump spoke with Ukrainian President Volodymyr Zelenskyy on July 25 over the phone \"to congratulate him on his recent election.\" A more detailed readout from Zelenskyy's office said both talked about \"investigations into corruption cases that have hampered interaction between Ukraine and the U.S.A.\"\n\nRudy Giuliani, the president's personal lawyer, has spoken publicly and privately urging Ukrainian officials to investigate former Vice President Joe Biden and any ties that his work in Ukraine might have had with his son Hunter Biden's business ventures, ABC News' Alex Mallin notes on \"Start Here\" today.\n\n\"It's still unclear what this call was about, but if the president had privately encouraged the leader of a foreign country to investigate somebody who might go on to be his 2020 opponent, that would certainly raise alarm among the intelligence officials,\" Mallin says.\n\n2. Congress vs. intel community\n\nThe complaint has sparked a standoff between Congress and the intelligence community after Acting Director of National Intelligence Joseph Maguire blocked lawmakers from receiving the report.\n\nIt allegedly involves a \"promise\" that Trump made to a foreign leader over a phone call this summer, according to the Washington Post, while the New York Times reports of a \"series of actions\" that went beyond a single conversation in the complaint. ABC News has not independently confirmed the reports.\n\nRep. Adam Schiff says he will release IG's letters on intelligence community whistleblower.\n\n\n\n\"This is what's being withheld from Congress right now. We know that the Department of Justice was involved in the decision to withhold that information.\" https://t.co/kLelnRx96P pic.twitter.com/Nprw38L0no — ABC News Politics (@ABCPolitics) September 19, 2019\n\nBy withholding the report and stopping the inspector general from sharing its contents with Congress, Maguire appears to be defying a law that requires him to tell lawmakers about the complaint, according to ABC News Chief National Correspondent Terry Moran.\n\n\"The problem is, if it involves the president of the United States because the president has complete authority under our laws to classify or declassify anything and isn't under the inspector general,\" he says. \"It's a murky situation legally highly fraught that as we saw yesterday, the Congress is very, very anxious and upset about.\"\n\nWhen reporting about the call surfaced earlier on Thursday, Trump tweeted that the reporting was \"fake news\" and questioned why anybody would think he'd disclose something inappropriate in a conversation with a foreign leader: \"I would only do what is right anyway, and only do good for the USA!\"\n\n....Knowing all of this, is anybody dumb enough to believe that I would say something inappropriate with a foreign leader while on such a potentially “heavily populated” call. I would only do what is right anyway, and only do good for the USA! — Donald J. Trump (@realDonaldTrump) September 19, 2019\n\n3. Global climate strike\n\nA week-long global climate strike begins today with some people skipping their jobs and students planning to walk out of class in hopes of ending the world's reliance of fossil fuels.\n\nGreta Thunberg, a 16-year-old climate activist from Sweden, is leading the charge after she made headlines with her two-week trip across the Atlantic Ocean on a zero-emissions yacht.\n\n\"Since she's come to the United States ahead of the UN summit in New York next week, there's been quite a bit more momentum towards getting big national groups together in various locations to strike for more attention to the issue of climate change,\" ABC News' Stephanie Ebbs tells \"Start Here.\"\n\nMike Blake/Reuters, FILE\n\n4. Vaping crisis\n\nU.S. health officials are now reporting 530 cases of lung illnesses linked to e-cigarettes, including at least eight deaths.\n\nWhile many of the cases involve off-market or THC-related products, officials are still trying to determine whether a particular brand or product caused the multi-state outbreak, but some states are taking matters into their own hands.\n\n\"Just this week, we've seen in New York and Michigan, both take action to try to ban some vaping products,\" ABC News' Linsey Davis says. \"In New York the governor said, look we are not going to wait for the federal government to act on this.\"\n\nMario Anzuoni/Reuters, FILE\n\n\"Start Here,\" ABC News' flagship podcast, offers a straightforward look at the day's top stories in 20 minutes. Listen for free every weekday on Apple Podcasts, Google Podcasts, iHeartRadio, Spotify, Stitcher, TuneIn or the ABC News app. Follow @StartHereABC on Twitter, Facebook and Instagram for exclusive content and show updates.\n\nElsewhere:\n\n'Please help me deal with those thugs': A United States-based activist who was behind a Facebook page that helped ignite a popular uprising in Egypt in 2011 said his brother was arrested at his family's home in Cairo on Thursday.\n\n'I want to live': U.S. Citizenship and Immigration Services will resume accepting applications to delay deportations for non-citizens and their families legally seeking medical treatment in the country, USCIS confirmed to ABC News.\n\n'In order to cause the most destruction': A New Jersey man was indicted Thursday on charges he supported Hezbollah by scouting possible targets for an attack.\n\nFrom our friends at FiveThirtyEight:\n\nNate Silver looks at why there may be a better case for a top 2 than a top 3 at the front of the Democratic presidential field.\n\nDoff your cap:\n\nMelissa Blake, an accomplished journalist who was born with the neuromusculoskeletal disorder Freeman-Sheldon syndrome, is no stranger to online trolls. But after she penned an opinion piece for a national news site, some commenters said she was too \"ugly\" to post selfies to social media.\n\nAs \"Good Morning America\" reports, Blake came up with the best possible response to the trolls who said she shouldn't post selfies.\n\nDuring the last round of trollgate, people said that I should be banned from posting photos of myself because I’m too ugly. So I’d just like to commemorate the occasion with these 3 selfies... 📸😉👋🏻 pic.twitter.com/9ZuSYFOtwv — Melissa Blake (@melissablake) September 7, 2019\n\nIn days since she tweeted her three selfies on Sept. 7, the post has been liked almost 300,000 times.", "description": "It's Friday, Sept. 20, 2019. Here's what you need to know to start your day.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/trump-phone-oval-file-gty-jef-190919_hpMain_16x9_992.jpg", "published_at": "2019-09-20"}