{"pub": "cnbc", "url": "https://cnbc.com/2019/09/06/ai-tech-could-identify-those-at-risk-of-fatal-heart-attacks.html", "downloaded_at": "2019-09-06 12:06:59.887687+00:00", "title": "A.I. technology could identify those at risk of fatal heart attacks, research claims", "language": "en", "text": "Researchers at the University of Oxford have developed artificial intelligence (AI) technology that could identify whether someone is at high risk of a fatal heart attack years before it occurs.\n\nMachine learning has been used to create a fingerprint called a \"fat radiomic profile.\" It's able to identify \"red flags\" such as inflammation, scarring and changes in blood vessels that supply blood to the heart. Factors such as these point to future heart attacks.\n\n\n\nIn an announcement Wednesday the university said that when a patient arrived at hospital experiencing chest pain, a \"standard component of care\" was for a scan of the coronary arteries to take place, something called a coronary CT angiogram. If no significant narrowing is found, then patients are sent home. The university added that the problem was that some patients would still go on to have a heart attack in the future.\n\n\"Just because someone's scan of their coronary artery shows there's no narrowing, that does not mean they are safe from a heart attack,\" Charalambos Antoniades, who is professor of Cardiovascular Medicine at the University of Oxford, said in a statement.\n\n\"By harnessing the power of A.I., we've developed a fingerprint to find 'bad' characteristics around people's arteries,\" Antoniades, who is also British Heart Foundation senior clinical fellow at the university, added.\n\n\"This has huge potential to detect the early signs of disease, and to be able to take all preventative steps before a heart attack strikes, ultimately saving lives.\"\n\nMore people die annually from cardiovascular diseases than any other cause, according to the World Health Organization. It's estimated that in 2016, 17.9 million people died from cardiovascular diseases. Heart attack and stroke accounted for 85% of these deaths.\n\n\"The Oxford research should have a real-world impact as the techniques are refined further,\" Simon Ray, the president of the British Cardiovascular Society, told CNBC.com via email Thursday.\n\n\"It will enable individuals at risk of a future heart attack to be identified at a stage when conventional scans do not show any abnormality and so allow early initiation of preventive treatment,\" Ray added.\n\nRay went on to state that artificial intelligence and machine learning were \"of great potential in the diagnosis and management of cardiovascular disease.\"\n\nTheir use with scans of the heart, he explained, could refine accuracy of diagnosis. It could also \"provide important information about prognosis at an early stage of disease… allowing cardiologists to better predict the likely course of a patient's condition and improve planning of treatment strategies on an individual basis.\"\n\n\n\nThe research at Oxford, which was funded by the British Heart Foundation and National Institute for Health Research, was published in the European Heart Journal. Its findings were also presented at the European Society of Cardiology Congress in Paris this week.", "description": "The system could have a significant impact in the near future.", "authors": ["Anmar Frangoul"], "top_image": "https://image.cnbcfm.com/api/v1/image/106113779-1567693131195gettyimages-909214646.jpeg?v=1567693198", "published_at": "2019-09-06"}