{"pub": "fox", "url": "https://foxnews.com/sports/suns-deandre-ayton-suspended-anti-drug-violation", "downloaded_at": "2019-10-25 16:32:35.222264+00:00", "title": "Phoenix Suns' Deandre Ayton suspended 25 games for violating league's anti-drug policy", "language": "en", "text": "The 2018 No. 1 NBA draft pick was suspended 25 games for violating the league’s anti-drug policy for testing positive for a banned diuretic.\n\nThe Phoenix Suns will be without center Deandre Ayton for the start of the regular season. The NBA announced the former Arizona big man’s suspension Thursday.\n\nSHAQUILLE O'NEAL'S SISTER, AYESHA HARRISON-JEX, DIES OF CANCER\n\n“On behalf of the Phoenix Suns organization, Monty Williams and I are disappointed in the actions by Deandre Ayton that led to his testing positive for a banned diuretic and subsequent suspension by the NBA,\" Suns general manager James Jones said in a statement. “This does not uphold the standards and principles we have set for the team.”\n\nAyton apologized in a statement.\n\n“I want to apologize to my family, the entire Suns organization, my teammates, partners, our fans and the Phoenix community,” he said. “This was an unintentional mistake and unfortunately I put something in my body that I was completely unaware of.\"\n\nNBA'S TALLEST PLAYER SUFFERS CONCUSSION IN FREAK ACCIDENT\n\nHe added: “I do understand the unfortunate impact that this has on so many others, and for that, I am deeply sorry. I'm extremely disappointed that I've let my team down. I will continue to work with the Players' Union (NBPA) to go through the arbitration process and am hopeful for a positive resolution.”\n\nAyton played in the Suns’ first game of the season and had 18 points and 11 rebounds in the win.\n\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\n\nHe will not be able to return until Dec. 17 when the team takes on the Los Angeles Clippers.\n\nThe Associated Press contributed to this report.", "description": "The 2018 No. 1 NBA draft pick was suspended 25 games for violating the league’s anti-drug policy for testing positive for a banned diuretic.", "authors": ["Ryan Gaydos", "Ryan Gaydos Is A Sports Reporter For Foxnews.Com", "Foxbusiness.Com. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/NBA-Deandre-Ayton.jpg", "published_at": "2019-10-25"}