{"pub": "rt", "url": "https://rt.com/sport/471661-could-roman-abramovich-sell-chelsea", "downloaded_at": "2019-10-24 00:30:15.901231+00:00", "title": "The price is right? Could Roman Abramovich soon be ready to sell up and leave Chelsea?", "language": "en", "text": "Earlier this week Chelsea owner Roman Abramovich reportedly turned down a bid to buy the club by a mystery Middle East consortium, but rumors of the Russian oligarch's openness to sell the club continue to circulate.\n\nThe billionaire owner has been rumored to be keeping his options open with regard to a potential sale, and his lack of appearances in the stands or corporate boxes at Stamford Bridge in recent weeks has sparked talk of the owner's passion for the club potentially waning.\n\nThe UK government's more stringent visa requirements for wealthy foreign nationals is thought to be putting the squeeze on the Chelsea owner. But despite his relative lack of visibility at the club recently, UK outlet the Daily Mirror reported that it is believed that Abramovich has no intention to sell the club.\n\nAlso on rt.com 'Chelsea need Roman Abramovich back': Blues legend Ivanovic calls for owner's return to Stamford Bridge\n\nThe report then said he would demand \"at least £3 billion ($3.9 million) before he even holds discussions.\"\n\nThat suggests that the door most certainly is open to a megabucks bid from a well-funded party looking to take over one of the English Premier League's most prominent clubs.\n\nDuring Abramovich's time at Stamford Bridge, he has transformed a mid-table side into one of the most powerful clubs in the Premier League. Under his ownership, the Blues have captured five Premier League titles, one UEFA Champions League title, two UEFA Europa League titles, five FA Cups, three League Cups and two Community Shields.\n\nSince Abramovich presided over the most successful period in the club's history, more money has piled into the English game, with Manchester City now bankrolled by a similarly lucrative source, Sheikh Mansour, the financial barrier to success for the Blues as they consider the next move in the club's regeneration may be too high for Abramovich to commit to, given the increased pressures outside of the game itself.\n\nAnd with potential suitors thought to be circling Stamford Bridge, could now be the right time for Abramovich, the man who brought so much modern-day success to the London club, to call it a day and move on?\n\nWatch this space...", "description": "Earlier this week Chelsea owner Roman Abramovich reportedly turned down a bid to buy the club by a mystery Middle East consortium, but rumors of the Russian oligarch's openness to sell the club continue to circulate.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5db08c842030277ca858d7a6.jpg", "published_at": "2019-10-24"}