{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/22/embattled-texas-house-speaker-wont-seek-re-election", "downloaded_at": "2019-10-22 15:14:35.378234+00:00", "title": "Embattled Texas House Speaker Won’t Seek Re-Election", "language": "en", "text": "The Speaker of the Texas House of Representatives announced Tuesday that he will not seek re-election for the next session. The statement follows crumbling support among top Republican leaders and the release of a recording from a meeting that seems to confirm allegations of wrongdoing in June.\n\nTexas Speaker of the House Dennis Bonnen (R-Angleton) announced Tuesday morning that he will not seek re-election to the office of State Representative for District 25.\n\nIn a statement Tuesday morning, Bonnen said:\n\nSince Friday, I have had numerous conversations with Members who care deeply about the Texas House, and I respect the manner in which they have handled this entire situation. After much prayer, consultation, and thoughtful consideration with my family, it is clear that I can no longer seek re-election as State Representative of District 25, and subsequently, as Speaker of the House. I care deeply about this body and the work we have accomplished over the years, namely, the outstanding success we achieved in the 86th Legislature. My below colleagues have made clear that it is in the best interest of both myself and the House to move on, and I thank them for the respectful and thoughtful way in which they have convinced me to do so.\n\nHis announcement followed statements from four key House committee chairmen, which eroded the foundation of his support. The chairmen of the House Calendars, Public Education, Natural Resources and Energy Resources Committees, and the vice-chairman of the House International Relations and Economic Development Committee called for the speaker’s “expedient, deliberate, and well-planned transition,” Ross Ramsey of the Texas Tribune tweeted. Those chairmen are Dan Huberty (R-Humble), Four Price (R-Amarillo), Lyle Larson (R-San Antonio), and John Frullo ( R-Lubbock).\n\nThe scandal involving Speaker Bonnen emerged after Empower Texans’ Michael Quinn Sullivan accused the speaker of offering an official action from the Office of the Speaker in exchange for political action from Sullivan’s political action committee. The meeting occurred on June 12 in Speaker Bonnen’s office at the capitol, Breitbart Texas reported.\n\nIn an article written for Texas Scorecard, Sullivan accused Bonnen and then-Texas House Republican Caucus Chairman Dustin Burrows (R-Lubbock) of offering to extend press credentials for the next session of the Texas Legislature to his political/news organization in exchange for political action against a list of House Republicans in the upcoming primary election. Burrows later resigned his leadership of the Texas Republican Caucus.\n\nThe speaker denied the allegations before Sullivan announced he had a secret recording of the meeting. Following that announcement, Bonnen continued to deny the allegations of bribery and other possible illegal actions and demanded the release of the recording in its entirety.\n\nSome members of the Texas House listened to the recordings and began to call for Bonnen to step down. The confirmation of the recording’s existence led to calls for an investigation by the Texas Rangers into possible wrongdoings.\n\nSullivan released the full recording last week, shortly before a previously scheduled meeting of the House Republican Caucus. Following the meeting, the caucus released the following:\n\nWe, the members of the Texas House Republican Caucus, condemn in the strongest possible terms the offensive language used and the statements made by Speaker Bonnen and Representative Burrows during the secretly recorded meeting which occurred on June 12th. Both members violated the high standards of conduct we expect of our members. Their conduct does not reflect the views of our Caucus membership. We completely and fully support the members mentioned in the recording. Further, the views expressed in the taped recording in no way reflect the high regard we have for our locally elected officials. Constitutionally, the Speaker can only be elected or removed when the House is in session. A process in our Caucus bylaws presently exists to nominate a Caucus-endorsed Speaker candidate, and we intend to abide by those provisions accordingly.\n\nBonnen’s announcement on Tuesday falls short of resignation but sets the stage for a new race for who will be the Speaker of the House in the 2021 Legislature.", "description": "The Speaker of the Texas House of Representatives announced Tuesday that he will not seek re-election for the next session.", "authors": ["Bob Price"], "top_image": "https://media.breitbart.com/media/2019/10/AP_19220521411315-640x335.jpg", "published_at": "2019-10-22"}