{"pub": "townhall", "url": "https://redstate.com/bonchie/2019/10/29/house-democrats-released-impeachment-resolution-absolute-garbage", "downloaded_at": "2019-10-30 11:37:40.927345+00:00", "title": "House Democrats Released Their ‘Impeachment Resolution’ and It’s Absolute Garbage", "language": "en", "text": "House Democrats released their “impeachment resolution” today, which purports to lay out fair rules involving the ongoing “impeachment inquiry.” The weird thing is seeing some “conservatives” run to Twitter to frame this move by Democrats as calling a Republican bluff. As you’ll see, it does nothing of the sort.\n\nI’m not going to go through the entire thing, as it’s eight pages long, but you can reference it in its full length here. You only need to see a few parts of it to realize that nothing has really changed and that all the same complaints being made by Republicans still exist.\n\nSean Davis breaks down some of the most important parts, not the least of which is that this isn’t even an actual impeachment resolution. Instead, it references the previous investigation, which doesn’t even legally exist.\n\nPelosi's resolution references \"the existing House of Representatives inquiry,\" but no such House of Representatives investigation exists, because the House of Representatives never authorized one. And this resolution doesn't either. pic.twitter.com/blss6WWPBh — Sean Davis (@seanmdav) October 29, 2019\n\nDemocrats can't up and authorize a real investigation now, because that would be an admission that previous demands were unauthorized, nuking their current case. So they're left to play cutesy games where they reference a non-existent investigation and hope nobody will notice. — Sean Davis (@seanmdav) October 29, 2019\n\nThat aside, the details within the resolution paint the same picture that existed prior to its existence.\n\nTake the section on transcripts for example.\n\nSomeone point out to me how this changes anything. The chair is Adam Schiff. The resolution gives him sole authority to release transcripts. All this does is legitimize his selective leaking. Now he can release excerpts as he sees fit without having to shovel them through CNN. If a testimony helps Donald Trump, he can simply hold it back and no doubt he will (I have a story tomorrow coming about Schiff instructing witnesses not to answer the questions of Republican members).\n\nBut maybe he’s giving subpoena power to the minority party like Republicans did during the Clinton impeachment investigation? Nope. Adam Schiff once again garners full authority to veto any requested witnesses or subpoenas and the only appeal is to the entire committee, which is majority Democrat and will always vote to back up Schiff. Again, nothing has changed.\n\nNearly every single anti-transparency dynamic Republicans have pointed out still exists, just with prettier language around it. This resolution is window dressing. It’s an attempt to shovel fodder to the media, knowing they will now proclaim all Republican concerns moot. The fact that some conservatives are going along with the gambit is disappointing.\n\nRepublicans aren’t asking for a lot. We simply want to see the transcripts. We want to be able to judge the contradictions, context, and any possible evidence for ourselves. Adam Schiff being the arbiter of that is not acceptable and as long as that dynamic exists, this inquiry will continue to be a sham.\n\n————————————————\n\nEnjoying the read? Please visit my archive and check out some of my latest articles.\n\nI’ve got a new twitter! Please help by following @bonchieredstate.", "description": "House Democrats Released Their ‘Impeachment Resolution’ and It’s Absolute Garbage", "authors": ["Kira Davis", "Alex Parker", "Brandon Morse", "Sister Toldjah", "Posted At Pm On October"], "top_image": "https://www.redstate.com/wp-content/uploads/2018/07/adam-schiff-pelosi-AP.jpg", "published_at": "2019-10-29"}