{"pub": "yahoo", "title": "Pope freed by firemen after getting stuck in Vatican lift", "url": "https://news.yahoo.com/pope-freed-firemen-getting-stuck-vatican-lift-004415689.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:17:03.876862+00:00", "text": "Francis was believed to be the first Vatican head of state has got stuck in a lift. (AFP Photo/Tiziana FABI )\n\nVatican City (AFP) - Pope Francis said Sunday he was late to his weekly Angelus prayer because he had been stuck in a Vatican elevator and had to be freed by firemen.\n\nHe followed the tale of his rescue with a surprise announcement about the creation of 13 new, red-hatted cardinals of the Catholic Church -- including 10 possible future popes.\n\n\"I have to apologise for being late,\" the smiling 82-year old pontiff told crowds of faithful patiently waiting for him to appear at his study window overlooking Saint Peter's Square.\n\n\"I was trapped in a lift for 25 minutes, there was a power outage and the lift stopped, but then the firemen came,\" he said.\n\n\"Let's give a round of applause to the fire service,\" he then said, prompting cheers and applause from the crowd.\n\nItalian television networks that live-stream the Angelus had been concerned that the unprecedented seven-minute delay might have been due to health reasons.\n\nFrancis seems to have unlimited energy despite his age. But he lost part of a lung in his youth, and the occasional grimace bears witness to the sciatic pain that is a near-constant companion.\n\n\"There was a moment of great worry over what could have happened to him,\" said Vania De Luca, Vatican expert for Rai News.\n\n- 13 new 'princes' -\n\nIt was believed to be the first time the Vatican's head of state, who leads the world's 1.2 billion Catholics, has got stuck in a lift.\n\nIn 2015 two nuns were reported to have survived three days trapped in a lift in Rome without food and water.\n\nThey were reported to have said they \"prayed so much\" during their ordeal -- something Francis also may have done.\n\nA satirical feed on the pope's computer search history, Vatican just Googled, tweeted \"how to get out of stuck elevator\".\n\nThe Argentine pontiff did not appear shaken by the episode, giving a little chuckle as he recounted what had happened.\n\nHe then unveiled the second surprise of the day: his decision to create 13 new \"princes\" of the Church next month.\n\nTen of them are under 80 years old and will therefore be eligible to vote for his successor as members of the college of cardinals, from whose ranks a new pope is chosen.\n\nThe newcomers hail from North America, Central America, Africa, Europe, and Asia as the Argentine pontiff gradually shapes a less European college of cardinals.\n\nVatican experts said the picks showed Francis's particular concern to build bridges with other religions and support migrants -- issues close to the pontiff's heart.\n\n- 'Before it's too late' -\n\nFrancis also made a plea Sunday for another hot-button topic that has become a cornerstone of his papacy: the environment.\n\nIn a message to mark this year's World Day of Prayer for the Care of Creation, the pope called on individuals across the world to make changes to their daily habits to stop climate change in its tracks.\n\n\"This is the time to reflect on our lifestyles and how our daily choices in terms of food, consumption, travel, use of water, energy and many other material goods are often reckless and harmful,\" he said.\n\nHe also praised young climate activists who have been upping pressure on institutions, saying all eyes would be on the upcoming UN Climate Action Summit on September 23 in New York.\n\n\"May God... give us the courage to do good without waiting for others to begin, without waiting for it to be too late,\" Francis said.", "description": "Pope Francis said Sunday he was late to his weekly Angelus prayer because he had been stuck in a Vatican elevator and had to be freed by firemen.  \"I have to apologise for being late,\" the smiling 82-year old pontiff told crowds of faithful patiently waiting for him to appear at his study window", "authors": ["Ella Ide"], "top_image": "https://s.yimg.com/uu/api/res/1.2/WTLCpk8xA4tAbIakx6P.qQ--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/db9a74b732f42f71cb122a9d2d9a0a2e726b6e87.jpg"}