{"pub": "abcnews", "url": "https://abcnews.go.com/US/texas-chemist-sues-chemical-plant-racial-harassment/story?id=65852291", "downloaded_at": "2019-09-26 15:04:49.952681+00:00", "title": "Texas chemist sues chemical plant over racial harassment", "language": "en", "text": "A Texas man sued his employer this week, claiming the company failed to take action when he complained about rampant racial harassment from white co-workers, who allegedly taunted him because he is black.\n\nTaye Falobi, a chemist at the multi-billion dollar chemical manufacturer Lubrizol, said co-workers at the company's Bayport, Texas, plant, harassed him with racial insults on several occasions, including one where they defaced his uniform with the words \"Mak [Lubrizol] Gr8t Again.\"\n\nFalobi, who is from Nigeria, said he received sporadic phone calls at his work station from different areas of the plant between October 2018 and July 2019, with the caller mocking his accent and/or making derogatory statements like \"go back to the jungle\" or \"how are we doing there in the jungle,\" according to the lawsuit, which was filed Monday.\n\nKTRK\n\nHe said he notified the company's human resources department about a \"pattern and culture of the plant in regards to discrimination\" in 2018, when a white co-worker told him that a manager there that he was only in his \"position because he was black and that his white secretary really ran the plant,\" according to the lawsuit.\n\nHe also said he told HR that someone had left images of monkeys eating bananas at his work station along with a list of all the employees there, minus the black ones. He said the harassment goes as far back as 2015.\n\nFalobi also detailed a disturbing incident from August when went to the company's locker room and allegedly found his work uniform vandalized with white paint. It had the phrases \"Mak LZ Gr8t Again\" and \"Go S*** hole\" written on the back and front, the suit said.\n\nHe said his name had been ripped off the front and replaced with \"S-hole.\" His lawyers said they believe the messages were inspired by President Donald Trump, who once referred to Haiti, El Salvador and African countries as \"s***hole countries.\"\n\nKTRK\n\n\"These statements have their origin from President Trump’s statement against immigrants, specifically, Trump’s reference to Haiti, El Salvador and African countries, where he is reported as saying, “Why are we having all these people from shithole countries come here?,\" the Chukwurah Law Group said in a statement. \"Lubrizol’s awareness of these despicable and discriminatory acts includes allowing Caucasian males to openly display Confederate flags and Swastikas inside the plant.\"\n\nA Lubrizol spokesperson declined to comment on pending litigation, but they said the company is\"committed to diversity and inclusion.\"\n\n\"Lubrizol is deeply committed to diversity and inclusion as critical pillars of our culture and company values,\" the company told ABC affiliate KTRK in a statement. \"We expect all of our employees to treat each other with dignity and respect, and we take all employee concerns relative to diversity and inclusion very seriously. At this time we cannot comment further on pending litigation.\"\n\nFalobi is suing for an unspecified amount of damages.", "description": "His lawyers said they believe the messages were inspired by President Donald Trump.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/chemist-racial-lawsuit-ktrk-mo-20190925_hpMain_16x9_992.jpg", "published_at": "2019-09-26"}