{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/stocks-are-rallying-on-a-report-that-china-is-offering-to-buy-more-american-agricultural-goods-to-ease-the-trade-war-1028586559", "downloaded_at": "2019-10-09 12:02:10.111486+00:00", "title": "Stocks are rallying on a report that China is offering to buy more American agricultural goods to ease the trade war", "language": "en", "text": "AP Photo/Pablo Martinez Monsivais\n\nUS stocks are set to rally after people briefed on the matter told the Financial Times that China is offering to import more agricultural goods from the US.\n\nThe paper said that officials were offering to import an extra 10 million tonnes of soybeans as well as other goods.\n\nChinese officials are set to meet their US counterparts on Thursday, in the hope of a partial trade deal being reached.\n\nTensions have flared this week, after Mike Pompeo criticized China over its treatment of Uighur Muslims on Twitter, while the NBA has also been in hot water after the Houston Rockets boss tweeted his support for protesters in Hong Kong.\n\nView Markets Insider's homepage for more stories.\n\nUS stocks are set to bounce after Chinese officials said the country would offer to up its purchases of US agricultural goods, according to The Financial Times, citing unnamed sources who were briefed on the matter.\n\nChinese officials travel to Washington, to meet their US counterparts on Thursday in the hope of signing a partial trade deal with the United States after months of tariff hikes between the two superpowers.\n\nUS futures underlying the S&P 500 and the Nasdaq are both rallying, 0.9% and 1.0% respectively, as did the Dow which was up 0.8% at 12:30 pm in London (7:30 am EST).\n\nMeanwhile, equities in Europe also bounced, with the DAX up 0.9% and the Euro Stoxx 50 up 0.7%.\n\nStocks originally bounced on reports from The Financial Times that Chinese officials were offering to buy 10 billion dollars worth of agricultural goods. This was later corrected by the paper to only specify an increase of 10 million tonnes of soybean purchases, and upping other agricultural goods like livestock, which roughly came to just over $3.25 billion.\n\nChina's Vice Premier Liu He is set for two days of talks on Thursday and Friday with US Trade Representative Robert Lighthizer and Treasury Secretary Steven Mnuchin, where both parties will look to de-escalate tensions that have been brewing since late 2018.\n\nAccording to people briefed on the matter, China is looking to stave off extra tariffs that are due to go into place this month.\n\nLiu He is coming with real offers, it's not an empty visit,\" said one of the people briefed on the talks to the Financial Times. \"The Chinese are ready to de-escalate.\"\n\nThis comes after a fiery week of tensions between the two parties, where both have criticized the other. On Tuesday, US Secretary of State Mike Pompeo hit out at China on Twitter over China's treatment of Uighur Muslims in western China.\n\n\"China has forcibly detained over one million Muslims in a brutal, systematic campaign to erase religion and culture in Xinjiang. China must end its draconian surveillance and repression, release all those arbitrarily detained, and cease its coercion of Chinese Muslims abroad,\" the secretary of state tweeted.\n\nAs a result, Pompeo said he would announce visa restrictions \"on Chinese government and Communist Party officials believed to be responsible for, or complicit in, the detention or abuse of Uighurs, Kazakhs, or other Muslim minority groups in Xinjiang.\"\n\nMeanwhile, China, which is a huge market for basketball, has hit back at the NBA, after Houston Rockets GM, Daryl Morey tweeted his support for protesters in Hong Kong.\n\nMany Chinese companies have pulled investment out of the basketball league and China announced it would stop showing pre-season games.", "description": "US stocks are set to rally after people briefed on the matter told the Financial Times that China is offering to import more agricultural goods from the U...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d9dad013b33a765f52588e4-2400/ap18339272058797.jpg", "published_at": "2019-10-09"}