{"pub": "yahoo", "url": "https://finance.yahoo.com/news/snapchat-grows-210-million-daily-202450142.html", "downloaded_at": "2019-10-23 14:58:38.526210+00:00", "title": "Snapchat Grows to 210 Million Daily Users, Surpasses Q3 Revenue Expectations", "language": "en", "text": "Click here to read the full article.\n\nSnapchat is growing again, and getting better at monetizing all those eyeballs: The service ended its fiscal third quarter with 210 million daily active users, compared to 203 million at the end of Q2, its corporate parent Snap Inc. revealed as part of its earnings release Tuesday afternoon.\n\nSnap Inc. generated some $446 million revenue in Q3, compared to $297.7 million in Q3 of 2018. Analysts had expected $435 million in revenue for the quarter.\n\nMore from Variety\n\n“We delivered strong results this quarter, and we are pleased that the investments we have made are continuing to drive the growth of our community and our business,” said Snap CEO Evan Spiegel in a statement. “We are a high growth business, with strong operating leverage, a clear path to profitability, a distinct vision for the future, and the ability to invest over the long term. We are excited about executing on the many opportunities in front of us.”\n\nHowever, while Spiegel may be talking up a path to profitability, Snap is still losing a lot of money to sustain its growth: The company’s losses for the quarter came in at $227 million, compared to $325 million a year ago. Q3 2019 results translated to losses of $0.16 per share.\n\nContinued losses also seemed to be on the minds of investors Tuesday afternoon, with Snap Inc.’s share price declining by as much as 5% in after-hours trading, only to stabilize around 2% down following the earnings call.\n\nSnapchat specifically called out its Discover content distribution platform as a growth engine, declaring that time spent by Snapchat users watching Discover content had grown 40% year-over-year. In the third quarter, over 100 Discover channels reached a monthly audience of 10 million or more viewers, according to the company.\n\nIn prepared remarks for Tuesday’s earnings call, Spiegel painted the traction professional content is seeing on Snapchat as part of a broader movement of audiences away from traditional TV and towards mobile screens. “We believe that this shift in behavior towards mobile content has created a large opportunity for our business, and we are excited about investing more to scale our content platform,” he said.\n\nInterestingly, Snap didn’t provide any success metrics for its nascent gaming business that launched in April of this year. Instead, Spiegel seemed to taper expectations, telling investors that gaming would be a medium-term opportunity that may come more into focus over the next 3-5 years.\n\nSpiegel also reiterated the company’s interest in augmented reality (AR) beyond the phone, but cautioned that AR headsets may take some time to arrive. “Over the long term, the next 7-10 years, we will work towards realizing our vision of computing overlaid on the world through wearable augmented reality,” he said.\n\nSnap continues to iterate on Spectacles as a precursor to full-blown AR glasses, but Spiegel made it clear on Tuesday that the product is little more than an experiment for the company. “We are building low volumes of Spectacles 3 and using this iteration to test and learn more about wearable computing,” he said.\n\nBest of Variety\n\nSign up for Variety’s Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.", "description": "Snapchat is growing again, and getting better at monetizing all those eyeballs: The service ended its fiscal third quarter with 210 million daily active users, compared to 203 million at the end of Q2, its corporate parent Snap Inc. revealed as part of its earnings release Tuesday afternoon. Snap Inc", "authors": ["Janko Roettgers"], "top_image": "https://s.yimg.com/uu/api/res/1.2/KZyfYCDyX4.5t7UxRqMBGw--~B/aD05MDA7dz0xNjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/variety.com/8c15b87f728865a281272db640dce5b8", "published_at": "2019-10-22"}