{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7630223/Queen-Maxima-Netherlands-oozes-elegance-smart-trousers-jumper-combo.html", "downloaded_at": "2019-10-30 14:43:08.860286+00:00", "title": "Queen Maxima of The Netherlands oozes elegance in a smart trousers and jumper combo", "language": "en", "text": "She's known for her flamboyant sense of style, but Queen Maxima of The Netherlands donned a decidedly more toned-down vibe today.\n\nThe Dutch royal, 48, cut an elegant figure in a high-neck royal blue jumper and a pair of matching smart trousers when in Den Bosch in 's-Hertogenbosch.\n\nMaxima was in the North Brabant city to attend the launch of a public-private business scheme aiming to help the nation's 1.4million households with high-risk or problematic debts.\n\nQueen Maxima of The Netherlands arrives for the launch of a public-private business scheme aiming to help the nation's 1.4million households with high-risk or problematic debts\n\nLooking a picture of royalty, the mother-of-three kept to her colour scheme and teamed her sophisticated ensemble with some royal blue heels and a clutch.\n\nAdding a little glitz to her outfit, King Willem-Alexander's wife opted for bright yellow, statement earrings.\n\nShe completed her ensemble with a shimmering diamond bracelet and eye-catching red nails.\n\nThe Dutch royal (pictured left, being welcomed by organisers), 48, cut an elegant figure in a high-neck royal blue jumper and a pair of matching smart trousers when in Den Bosch\n\nHer makeup was kept light and youthful, with her skin glowing and a subtle smoky eye and rose lipstick completing the look.\n\nMaxima was attending the launch of the Dutch Debt Help Route, a public-private partnership between charities SchuldenlabNL, Geldfit.nl, fiKks, Brave Dialogue and the Dutch Banking Association.\n\nIt aims to prevent households falling into debt by getting the government, businesses and debt relief organisations working together to help people get a grip on their financial situations.\n\nMaxima was attending the launch (pictured) of the Dutch Debt Help Route in the Verkadefabriek in 's-Hertogenbosch\n\nThe Debt Help Route is a public-private partnership between charities SchuldenlabNL, Geldfit.nl, fiKks, Brave Dialogue and the Dutch Banking Association. The royal pictured with organisers\n\nAn international financier by training, Máxima was born in Argentina and married into the Dutch royal family in 2002, three years after meeting her husband-to-be in Seville, Spain.\n\nThe King and Queen are parents to three daughters; Catharina-Amalia, 14, Alexia, 12, and Ariane, 10.\n\nDespite reportedly having no inkling that Willem-Alexander was heir to the throne when the pair first met, she eventually became Queen consort when her husband ascended to the throne.\n\nWillem-Alexander became king after his mother, Beatrix, abdicated in April 2013 after 33 years as reigning monarch.", "description": "Maxima was in the North Brabant city to attend the launch of a public-private business scheme aiming to help the nation's 1.4million households with high-risk or problematic debts.", "authors": ["Jessica Green For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/12/20372712-0-image-a-39_1572436945003.jpg", "published_at": "2019-10-30"}