{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7567405/Fake-tan-lovers-going-wild-bronzing-MIST-smooths-patchy-spots.html", "downloaded_at": "2019-10-13 08:55:46.609014+00:00", "title": "Fake tan lovers are going wild for bronzing MIST that smooths over patchy spots", "language": "en", "text": "A newly launched collection of tanning products are driving fake tan lovers wild with promises of the ultimate streak-free summer glow - and one bottle is selling every 46 minutes.\n\nEntrepreneur and creator of UNE PIECE swimwear Carly Brown only launched her new label La Beach last week but already it has seen a rapid spike in sales, particularly given the product is so unique.\n\nThe label's Australian-made, cruelty-free and vegan tanning foam and 'water mist' has millennials rushing to get their hands on it first, particularly given the artistic design of the bottle is trendy enough to display on your bathroom vanity.\n\nA newly launched collection of tanning products are driving fake tan lovers wild with promises of the ultimate streak-free summer glow - and one bottle is selling every 46 minutes\n\nThe $39 mist in particular has beauty aficionados excited because it aims to give colour to any areas you might have missed with the $39 foam.\n\nAnywhere from in between the fingers and toes, behind the knees or the elbows can quickly match the rest of your body with a spray of mist.\n\nIt's a game-changer for those who regularly 'miss a spot' or for those worried about tanning for the first time.\n\n'We've been thrilled to see the response that La Beach has had,' Carly told FEMAIL.\n\nAnywhere from in between the fingers and toes, behind the knees or the elbows can quickly match the rest of your body with a spray of mist\n\nWhen they launched their website last week most of the transactions being made were for both products - the foam and mist - which are being marketed as a 'power couple'\n\n'We feel like there is definitely a gap in the market for an Australian-made, cruelty-free tanning brand that really delivers on a flawless finish from \"tips to toes.\"'\n\nWhen they launched their website last week most of the transactions being made were for both products - the foam and mist - which are being marketed as a 'power couple'.\n\n'Both products work beautifully on their own, however, when used together this is when the real magic happens,' she said.\n\nAnother agreed, writing: 'I've never been able to get the colour just right on my hands and feet but the tanning water mist easily fixes that problem'\n\nClients are already starting to rave about the colour by sharing before and after pictures of their bronzed bodies to social media.\n\n'I'm so in love with the amazing bronze colour and best of all, there is no smell whatsoever,' one woman said.\n\nAnother agreed, writing: 'I've never been able to get the colour just right on my hands and feet but the tanning water mist easily fixes that problem'.", "description": "A newly launched collection of tanning products are driving fake tan lovers wild with promises of the ultimate summer glow - and one bottle is selling every 46 minutes in Australia.", "authors": ["Matilda Rudd For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/06/19646208-0-image-a-60_1570945461581.jpg", "published_at": "2019-10-13"}