{"pub": "yahoo", "url": "https://news.yahoo.com/trump-tax-law-state-salt-205820313.html", "downloaded_at": "2019-10-01 15:37:21.028708+00:00", "title": "Judge rules that Trump's tax overhaul can disproportionately impact blue states", "language": "en", "text": "A Manhattan federal district judge on Monday issued bad news for taxpayers hoping to sidestep the Trump administration’s cap on state and local tax deductions.\n\nFor now, the decision means that all federal taxpayers who itemize deductions remain subject to the rule first effective for the 2018 tax year, which limits such “SALT” deductions to $10,000.\n\nIn December 2017, President Donald Trump signed into law the Tax Cuts and Jobs Act Trump, which reformed the tax code to limit total state and local taxes to a $10,000 maximum for single filers and married couples filing jointly, and $5,000 for married couples filing separately.\n\nFour U.S. states that collectively challenged the administration’s SALT cap — New York, New Jersey, Connecticut, and Maryland — had their case dismissed, the judge reasoning the states failed to show the cap was unconstitutional, or beyond Congress’ authority. The states said they were home to “the highest percentages of taxpayers whose federal tax burden increased” under the new rule. All four are Democratic-leaning states.\n\nImage: Getty More\n\n‘An invasive and unprecedented attempt’\n\nNew York Attorney General Letitia James called the administration’s limitation “an invasive and unprecedented attempt by the federal government to curtail” state constitutional rights. James said her office was reviewing the decision as it considered its available options. That could include an appeal. “We remain committed to defending our taxpayers and our state,” she said.\n\nNEW YORK, NY - JUNE 11: New York Attorney General Letitia James speaks during a press conference, June 11, 2019 in New York City. James announced that New York, California, and seven other states have filed a lawsuit seeking to block the proposed merger between Sprint and T-Mobile. James said that the merger would deprive customers of the benefits of competition and potentially drive up prices for cellphone service. (Photo by Drew Angerer/Getty Images) More\n\nThe law unfairly targets blue states, the states’ attorneys general argued, in advocating to maintain the old rule on SALT deductions that would largely benefit homeowners.\n\nJudge Paul Oetken, who was appointed by Obama, concluded that the states failed to “plausibly” claim that the cap constrains states’ sovereign tax power decision-making any differently than under other major federal initiatives.\n\n“In the end, Congress enacted the SALT cap pursuant to its broad tax powers under Article I, section 8 and the Sixteenth Amendment,” Judge Oetken wrote in his decision. “The cap, like any federal tax provision, will affect some taxpayers more than others and, by extension, will affect some states more than others.”\n\nNew York’s lawyers argued that its taxpayers would collectively pay $121 billion more in federal taxes between 2018 and 2025 than without the $10,000 cap. The state’s filers who itemized deductions under the old rule claimed $21,943, on average.\n\nNew Jersey, Connecticut, and Maryland argued that in 2018, alone, taxpayers from their states paid $7.5 billion more to the federal government than they would have paid without the cap.\n\nAlexis Keenan is a reporter for Yahoo Finance. She previously worked for CNN and is a former litigation attorney. Follow on Twitter @alexiskweed.\n\nRead the latest financial and business news from Yahoo Finance\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.", "description": "A Manhattan federal district judge on Monday issued bad news for taxpayers hoping to sidestep the Trump administration’s cap on state and local tax deductions.", "authors": ["Alexis Keenan"], "top_image": "https://s.yimg.com/uu/api/res/1.2/TN3jUdddeb.MNAIvORsV.g--~B/aD00MDAwO3c9NjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-03/4700ad40-3e60-11e9-9ffb-78200bb64f01", "published_at": "2019-09-30"}