{"pub": "yahoo", "url": "https://uk.style.yahoo.com/myth-busting-organic-skincare-why-160100077.html", "downloaded_at": "2019-09-27 16:38:09.405448+00:00", "published_at": "2019-09-27", "title": "Myth-Busting Organic Skincare - And Why It Could Be Your Skin's Saviour", "language": "en", "text": "From ELLE\n\nThe Ingredients List - Breaking down the what, where and why of natural and eco-friendly beauty.\n\nPhoto credit: . More\n\nOrganic skincare - it's always been on our 'if we were being better people' to do list we've never quite got around to. But, if we're going by the theory that organic produce is better for our diets, surely organic skincare is just as beneficial for our complexions? Or is it?\n\nClearing up the confusion is natural beauty expert, brand founder and proud owner of the best skin we've ever encountered in real life, May Lindstrom.\n\nFrom what actually qualifies a skincare product as being organic, to the benefits it can have for our faces and the myths that just aren't accurate, here's your personal guide to everything you need to know about organic skincare.\n\nWhat qualifies a skincare product as organic?\n\n'Very little, unfortunately. Lax labelling laws allow the word “organic” to be predominantly displayed even when only one ingredient at a fractional percentage within a formula is, in fact, organic.\n\n'I always encourage consumers to ignore the front of packaging and any marketing jargon and instead to go straight to the complete ingredients listing. This is where the fun starts! Much of conventional skincare is filler and fluff and perfume and colourants.\n\n'When you enter the natural beauty world, it’s like discovering a new universe - in my ideal, ingredients decks read like a yummy food label and each plant and mineral has a sourcing story from soil to seed to bottle that is worth celebrating.'\n\nWhat makes a skincare product NOT organic?\n\n'The simple answer: when it contains ingredients that are not actually grown organically.\n\n'Again, this is not a regulated term and a product marketed as “organic” may contain essentially none or only a fractional percentage of plant materials that were organically grown. It is vital to read the complete ingredients listing, and then study the sourcing of each unique ingredient.'\n\nWhat are the benefits of organic skincare?\n\n'Just like with food, organically grown ingredients often have higher nutrient levels, and are missing chemical residues that can irritate skin or potentially cause long term harm in the body.\n\nPhoto credit: Anna-Ok More\n\n'I believe strongly in utilising the very best possible ingredients in my formulations. By choosing raw materials that are grown in the wild, or by organic farming methods, I feel I am doing just that.\n\nStory continues", "description": "Get your organic on", "authors": ["George Driver"], "top_image": "https://s.yimg.com/uu/api/res/1.2/5ZjBdd4iMtx4uc8ugHRxAA--~B/aD03MjA7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/elle_865/fe8f3827c7b8d2da165af5892ff347f3"}