{"pub": "metro", "url": "https://metro.co.uk/2019/10/12/going-somewhere-tropical-christmas-need-festive-hawaiian-shirts-10907491", "downloaded_at": "2019-10-12 17:04:55.678668+00:00", "title": "Going somewhere tropical for Christmas? You need these festive Hawaiian shirts", "language": "en", "text": "Adorable (Picture: Maguire Steele)\n\nNot long until you hear the sound of sleigh bells and Dean Martin singing that ‘the weather outside is frightful’.\n\nFor some of you, though, it’s not going to be a White Christmas at all, despite that being what we associate with the festive season here in the UK.\n\nOf course, not everybody lives in places that have cold weather at Christmas, and plenty of people head off to visit family and friends in warmer climes too.\n\nWhether people still have turkey (or nut roast) is totally up to them, but it’s simply impractical to wear the standard Christmas jumper when the mercury rises.\n\nThat’s where the Reyn Spooner brand comes in. The Californian and Hawaiian brand make all sorts of Hawaiian shirts and surf-friendly clothes, and bring out the big guns come the festive season.\n\nThe patterns also come as dresses (Picture: Maguire Steele)\n\nEach year they release a limited edition Christmas collection, and the 2019 drop is certainly Christmassy.\n\nAdvertisement\n\nAdvertisement\n\nThe veritable treetop stars are their shirts, which on first inspection look like your standard Hawaiian number. However, when you look closer you’ll see that it’s actually Santa chilling on the beach, and those palms are actually spruces.\n\nThese patterns come as dresses and children’s outfits, which is great news for any family who wants plenty of cheesy matching outfit pictures.\n\nIf these are a bit loud for you, you can opt for a hibiscus print in more wintry colours, or a t-shirt with a tiny surfing Father Christmas on the breast pocket.\n\nNow that’s a team photo (Picture: Maguire Steele)\n\nFor t-shirts, prices start from $44 (£35), and for shirts you’re looking at £106 (£84) for adult sizes.\n\nEverything’s made with Spooner Kloth™, a blend of cotton and spun poly that the brand call ‘amazingly durable, wrinkle free and breathable’.\n\nOf course, they’re not just for warm weather, and I’m sure your family would love to see you rocking around the Christmas tree in one anywhere.\n\nThe idea for the festive Aloha shirts came from Reynolds ‘Reyn’ McCullough back in 1983, when he realised at a party that there weren’t a number of options available for men.\n\nFrom there their Christmas shirts took off, and they regularly sell out, with some people even collecting the garments.\n\nAdvertisement\n\nAdvertisement\n\nIf you want to get your hands on one, you can do so here.\n\nMORE: Quiz: What should you dress up as for Halloween?\n\nMORE: Bleeding during pregnancy: How much is normal?\n\nAdvertisement Advertisement", "description": "These Hawaiian shirts were made for those of you celebrating Christmas in warmer climes.", "authors": ["Jessica Lindsay"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89557942_1570898860.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-12"}