{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7541013/Vegan-diet-lead-tooth-decay-warns-leading-dentist.html", "downloaded_at": "2019-10-05 22:46:30.593263+00:00", "title": "Vegan diet can lead to tooth decay, warns leading dentist", "language": "en", "text": "Turning vegan could be bad for your smile, a leading dentist has warned.\n\nDr Mervyn Druian, from the London Centre for Cosmetic Dentistry, says he has seen a rise in patients showing signs of tooth decay after cutting out certain foods.\n\nMany are following a vegan diet, which can lack protein and calcium – vital for keeping teeth healthy.\n\nTurning vegan could be bad for your smile, a leading dentist has warned. Dr Mervyn Druian, from the London Centre for Cosmetic Dentistry, says he has seen a rise in patients showing signs of tooth decay after cutting out certain foods. (File photo)\n\nAnd he warns that some vegans may also eat more sweet and starchy foods such as fruits and grains.\n\nThese cause bacteria in plaque to produce acids, which can harm enamel.\n\n‘Because veganism has sky-rocketed, we are seeing more patients with erosion and cavities,’ Dr Druian says. ‘It’s not just down to the lack of vitamins, but also because of the food swaps they make.’\n\nPreventing deadly infections... with a magic glass disc\n\nAntibacterial glass could prevent a third of all hospital infections.\n\nUrinary tract infections, caused by unsanitary catheters, are responsible for about 35 per cent of complications following operations, according to studies.\n\nA catheter is a tube attached to a bag and is used to drain urine when it is difficult for patients to urinate unaided.\n\nBut the devices are a breeding ground for bacteria, which can cause potentially lethal infections.\n\nNow scientists at Birmingham’s Aston University have developed glass discs which, when inserted into the catheter, immediately destroy bugs, thanks to being coated with the antibiotic compound zinc oxide. Crucially, researchers found this has no toxic effect on the bladder lining.\n\nThe discs are still prototypes but it is hoped they may be in NHS hospitals soon.\n\nThe UK’s leading stroke charity says thousands of people are failing to recover – because they are lonely.\n\nSocial interaction is integral to long-term rehabilitation, says Juliet Bouverie, chief executive of The Stroke Association. Yet, according to a new poll of 1,000 survivors, eight in ten victims are too afraid to leave the house, fearing a second attack.\n\nThe UK’s leading stroke charity says thousands of people are failing to recover – because they are lonely. (File photo)\n\nAnd one in five keeps these fears secret, not wanting to burden family or friends, even though studies show loneliness can raise the risk of death by a third.\n\n‘One of the best things we can do for someone who has had a stroke is to get them out to meet other survivors,’ says Ms Bouverie. ‘There are more than 600 stroke clubs and groups in the UK offering activities, advice and support.’\n\nVisit stroke.org.uk for details.\n\nMS link to child obesity\n\nBeing obese in childhood can increase the risk of developing multiple sclerosis in later life.\n\nScientists studying 40,000 people over several decades found that obese children were almost a third more likely to develop the condition in adulthood.\n\nBut the weight itself may not be the cause. Researchers at Montreal’s McGill University discovered that carriers of 23 specific genetic variants were more likely to be both obese and develop MS.\n\nCorns are small lumps of hard, rough skin, usually on the knuckles of the toes and hands\n\nWHAT'S THE DIFFERENCE... between corns and calluses?\n\nCorns are small lumps of hard, rough skin, usually on the knuckles of the toes and hands.\n\nThey may also appear on the sides or sole of the foot.\n\nCorns are caused by excess pressure from poorly fitting shoes.\n\nCalluses are larger patches of rough, hard, yellowish skin on the heel or under the ball of the foot.\n\nThey are normally associated with pressure on the ball of the foot.\n\nCorns and calluses can be treated by soaking in warm water and removing the hard skin with a pumice stone.", "description": "Dr Mervyn Druian, from the London Centre for Cosmetic Dentistry, says he has seen a rise in patients showing signs of tooth decay after cutting out certain foods.", "authors": ["Mail On Sunday Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/15/19334486-0-image-a-24_1570285987527.jpg", "published_at": "2019-10-05"}