{"pub": "thehill", "url": "https://thehill.com/homenews/administration/467812-the-memo-isis-leaders-death-is-no-game-changer-for-trump", "downloaded_at": "2019-10-29 00:17:46.014697+00:00", "title": "The Memo: ISIS leader's death is no game-changer for Trump", "language": "en", "text": "President Trump Donald John Trump'Veterans for impeachment' signs seen at World Series game during Trump visit Trump met with boos, 'lock him up' chant at Game 5 of World Series Kayla Mueller's mother: Daughter might still be alive 'If Obama had been as decisive' as Trump MORE scored a significant success with the death of ISIS leader Abu Bakr al-Baghdadi on Saturday. But political experts on both sides of the partisan divide say it is unlikely to reshape his domestic fortunes.\n\nEven Republicans accept that the death of al-Baghdadi, who reportedly blew himself up while being pursued by American forces, is of lesser importance than the 2011 killing of al Qaeda founder Osama bin Laden during former President Obama’s tenure.\n\nADVERTISEMENT\n\n“This is much different from Osama bin Laden because everyone knew who the terrorist was,” said one GOP strategist with ties to the White House. “Not a lot of people know who the leader of ISIS is.”\n\nAnother Republican strategist, Dan Judy, said that it was important to acknowledge the importance of al-Baghdadi’s demise — but also to keep its likely impact at home in perspective.\n\n“Strategically, it is a huge deal, it is a huge win, and I think people recognize that,” he said. “But most people would not have recognized al-Baghdadi, whereas Osama bin Laden held a singular place in the American psyche.”\n\nIf those experts prove right, it will likely prove a disappointment to the president.\n\nTrump teased the demise of al-Baghdadi on Twitter on Saturday night before making the official announcement Sunday morning amid the pomp of the White House Diplomatic Reception Room. The New York Times reported that he hoped for it to become “a legacy-defining moment.”\n\nThe president also reached for his most colorful language to describe al-Baghdadi’s fate. He referred to the ISIS leader as having “died like a dog” and said that he was “whimpering and crying and screaming.”\n\nOn Monday, speaking at a police conference in Chicago, Trump said that al-Baghdadi “should have been killed years ago. Another president should have gotten him.”\n\nObama did receive a clear uptick in public approval following bin Laden’s killing, which took place on May 2, 2011.\n\nIn Gallup polling for the week leading up to that day, a plurality of Americans disapproved of Obama’s job performance: 44 percent approved, and 47 percent disapproved.\n\nBy the following week, those figures had flipped to 51 percent approval and 40 percent disapproval. Obama’s job approval ratings stayed elevated for several weeks afterward.\n\nWhen Obama was running for reelection the following year, then-Vice President Joe Biden Joe BidenBiden: Trump 'an idiot' for saying Russian interference a 'hoax' Biden: 'I know I'm the frontrunner' in 2020 race 2020 Democrats set sights on corporate tax hike MORE boiled down the case for a second term to the success against bin Laden and the earlier bailout of the auto industry. “Bin Laden is dead, and General Motors is alive,” Biden famously said.\n\nIt seems unlikely that the al-Baghdadi killing will have such a talismanic effect for Trump — not only because the ISIS leader is less well known than bin Laden but also because Trump himself is so polarizing.\n\nTrump’s standing is also tied firmly to domestic issues, including the ongoing impeachment inquiry and the state of the economy.\n\nStill, the success of the raid has won praise even from Trump foes, including House Intelligence Committee Chairman Adam Schiff Adam Bennett SchiffSchiff: Barr 'weaponizing' DOJ 'to go after the president's enemies' Top Trump administration officials hail al-Baghdadi raid but stress need for resolve in fighting ISIS Schiff: 'Bolton is a very important witness' MORE (D-Calif.).\n\n“Good riddance,” Schiff told Martha Raddatz on ABC’s “This Week” on Sunday, describing al-Baghdadi’s death as “an important victory” and “a great day.” Schiff did not laud Trump, however.\n\nHe instead criticized the president’s decision to pull U.S. troops out of northern Syria, which has been widely cast as a desertion of the Kurds who fought alongside U.S. forces.\n\nTo be sure, some Republicans argue that even if the al-Baghdadi operation does not change Trump’s overall approval ratings, it could at least give him some breathing room from GOP elected officials who have been openly critical of the Syria pull-out.\n\n“Many Republicans, especially on Capitol Hill, were very unhappy about that,” said Judy. “This could take a bit of heat off [Trump] for that decision.”\n\nThe other GOP strategist, who asked to remain anonymous to talk candidly, also argued that the operation could have the second-level effect of “bolstering the fact that Trump is a strong leader to his base.”\n\nBy contrast, Democrats on Capitol Hill were dismayed that they did not receive a briefing about the al-Baghdadi raid in advance.\n\nSen. Christopher Coons Christopher (Chris) Andrew CoonsNew bipartisan Senate climate caucus aims to take 'politics' out of the topic Senate Democrats want Warren to talk costs on 'Medicare for All' Meet the dog and 'sea turtle' who launched campaigns for office MORE (D-Del.) said on CNN on Monday that the failure to tell top-level Democrats before the raid happened amounted to “disrespect.”\n\nOther Democrats argue that the president’s characteristic bravado dulls any positive political impact from the raid.\n\nDuring his White House remarks on Sunday, Trump segued into claims that he had been ahead of the curve in highlighting the danger posed by bin Laden and plugged one of his own books.\n\nJoel Rubin, who served as a deputy assistant secretary of State in the Obama administration, said that Trump had sought to take “a personal victory lap” for the killing of al-Baghdadi.\n\nRubin argued that Obama and former President George W. Bush had been far more modest following the killings of bin Laden and former Iraqi President Saddam Hussein, respectively.\n\n“For some reason Trump thinks it necessary to do that. ‘I did it better,’” Rubin said.\n\nThere’s one point of agreement across the political spectrum, however.\n\nFor all the attention the al-Baghdadi operation has received in recent days, the focal point of the political world will soon return closer to home — and to the impeachment inquiry that threatens Trump’s presidency.\n\nOn Monday afternoon, it emerged that the House will vote for the first time on impeachment procedures on Thursday.\n\nIn Washington, it will soon be back to business as usual.\n\nThe Memo is a reported column by Niall Stanage, primarily focused on Donald Trump’s presidency.", "description": "President Trump scored a significant success with the death of ISIS leader Abu Bakr al-Baghdadi on Saturday. But political experts on both sides of the partisan divide say it is unlikely to reshape his domestic fortunes.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trump3_102719getty.jpg", "published_at": "2019-10-28"}