{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-ftse-stocks-m-s-graphic/ftse-100s-changing-face-trip-down-memory-lane-idUKKCN1VV1MJ", "downloaded_at": "2019-09-10 23:34:12.321106+00:00", "title": "Graphic: FTSE 100's changing face - A trip down memory lane", "language": "en", "text": "LONDON (Reuters) - Marks & Spencer's exit from the FTSE 100 .FTSE underlines how times have changed since the blue-chip index was launched in 1984, when it was dominated by British companies including household names like M&S, Cadbury and House of Fraser.\n\nFILE PHOTO: A man walks through the lobby of the London Stock Exchange in London, Britain August 25, 2015. REUTERS/Suzanne Plunkett\n\nHome-grown talent is increasingly absent from the FTSE, now valued at $2.4 trillion, as failure to grow domestically or make the cut internationally has seen companies disappear via mergers, demotions, de-listing or privatization.\n\nMFI Furniture was among founding members of the index that failed to survive after privately-owned IKEA entered the UK market in the 1980s.\n\nBritish Home Stores and Magnet & Southerns were other big retail names that have either failed or been bought by other companies.\n\nThese household brands have been giving way to big corporations that make the bulk of their revenues outside Britain. The most recent FTSE constituents pocket just 29% of their revenue from the UK.\n\nMarks & Spencer (MKS.L), which was the fifth-most-valuable company at the FTSE’s inception, now ranks just 111th by market capitalization — too small to qualify.\n\nM&S shares have lost about 40% of their value since January 2018 as the British high street stalwart has struggled with competition in clothing and food, particularly online.\n\nOther famous names at the risk of falling through the trap doors soon are Morrison Supermarkets (MRW.L), Sainsbury’s (SBRY.L) and B&Q-owner Kingfisher (KGF.L), now sitting at the bottom-end of the index.\n\nUntil recently, M&S, Sainsbury’s and Tesco (TSCO.L) were some of the 28 original members still in the FTSE.\n\nNew joiners in the most recent reshuffle included precious metals mining firm Polymetal (POLYP.L), Hikma (HIK.L), a generic drugmaker earning the bulk of its revenue from the United States, and aerospace and defense group Meggitt (MGGT.L).\n\nBy sector weightings, banks & financial services, mining and energy stocks now make up nearly 40% of the index, while retail has shrunk to less than 3% from 8% in 1996.\n\nOther major sectors to take a hit in the last two decades were technology, media & telecoms, which together have shrunk to just 7.5% from nearly a quarter in early 2000s.\n\nHere’s the sectoral break-down of the index since 1996:\n\n(Graphic: FTSE 100 constituents by sector, here)\n\nHow British retailers M&S, Sainsbury’s have underperformed the FTSE 100 index\n\n(Graphic: FTSE vs. Marks & Spencer, Sainsbury's since 1984, here)", "description": "Marks & Spencer's exit from the FTSE 100 <.FTSE> underlines how times have changed since the blue-chip index was launched in 1984, when it was dominated by British companies including household names like M&S, Cadbury and House of Fraser.", "authors": ["Thyagaraju Adinarayan", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190910&t=2&i=1428327137&w=1200&r=LYNXNPEF8917G", "published_at": "2019-09-10"}