{"pub": "guardian", "url": "https://theguardian.com/technology/2019/sep/18/facebook-portal-smart-display-mini-tv-launch-uk", "downloaded_at": "2019-09-18 12:49:30.860606+00:00", "title": "Facebook to launch new Portal smart displays in Europe", "language": "en", "text": "Just 10 months after launching its first voice-controlled, video-calling smart displays in the US, Facebook is trying again with new Portal, Portal Mini and Portal TV – and now they are heading for the UK and Europe.\n\nThe basic premise is very similar to the smart displays sold by Amazon, Google and others. Portal and Portal Mini look like digital photo frames complete with an actual black or white frame around the outside. They display your photos and calendar events, play videos and generally entertain, including streaming Spotify and Amazon Prime Video. They listen out for two hotwords depending on your settings.\n\n“Hey Portal” triggers Facebook’s voice assistant in US English only, which handles device settings such as turning up or down the volume, calling someone or similar. “Alexa” triggers Amazon’s voice assistant, which connects you directly to Amazon’s servers and offers much of what an Echo Show or similar device would. Facebook stresses that interactions with Alexa do not pass through the social network’s servers.\n\nThe differentiator for Facebook is its focus on video calling across the social network’s messaging platforms. Each Portal has a wide-angle smart camera and smart audio system that frames you during a video chat as you move around the room, smoothly panning and zooming to fit you and any other participants in shot.\n\nVideo calls over Facebook Messenger are encrypted to the server, but new for this year is WhatsApp, which is encrypted end-to-end, so even Facebook cannot see what you’re doing. It’s intended to try to attract an audience out of the US, where WhatsApp is much more widely used than Facebook Messenger.\n\nCalls made through Portal can be to other Portal devices, or to Messenger running on a smartphone, tablet or the web, or to WhatsApp on a smartphone. Calls on Messenger can also take advantage of various augmented reality effects, adding things to your face similar to Snapchat, interactive children’s stories where one end acts as the narrator and AR games.\n\nFacebook Twitter Pinterest The new Facebook Portal, Portal Mini and Portal TV join the existing Portal+. Photograph: Facebook\n\nThe two traditional smart displays cost £129 for the Portal Mini with an 8in 720p display while the £169 Portal has a 10in 720p display. Both smart displays have a physical shutter that covers the camera and the ability to disable both the camera and the microphones electrically, stopping the software from accessing them at all. They also feature 2.1 sound, with stereo speakers ported into the sides of the frame so the audio fires straight out from the screen and a bass speaker in the back.\n\nThe £269 Portal+ is coming to the UK for the first time too, with its large, rotating 15.6in full HD display looking like a video conferencing suite.\n\nThe £149 Portal TV is a box of tricks that sits on top of your TV with a camera, microphones and a speaker, connecting to the screen via HDMI and turning it into a giant smart display with all the same video chat functions. Portal TV can also be used to play videos from Facebook Watch while on a video call, so people can watch the same thing simultaneously. Other more popular video services are not yet supported on calls.\n\nFacebook launches 'clear history' tool – but it won't delete anything Read more\n\nFacebook is attempting to assuage privacy fears. Alongside the physical camera cover, the smart camera and smart audio features are powered by AI running locally on the device, not on Facebook’s servers.\n\nThe social network keeps audio clips when you talk to the Portal voice assistant, not Alexa, and humans may review samples of both the voice recording and transcription. Users will be able to view, hear and delete any voice interaction from Facebook’s activity log, and they can opt out of voice storage entirely.\n\nWhether that gives users confidence enough to actually invite Facebook into their homes on microphone and camera-equipped smart displays remains to be seen after repeated privacy scandals and data leaks.\n\nThe various Portal smart displays will be available from Facebook, Amazon, Argos, Dixons, Harrods and Selfridges from 15 October, with Portal TV joining later on 5 November.", "description": "WhatsApp joins Messenger on camera-equipped photo frame-like device tied in with Alexa", "authors": ["Samuel Gibbs"], "top_image": "https://i.guim.co.uk/img/media/6f6334a232e10d6ec50249761c4704f275472590/0_82_2000_1200/master/2000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6ee6f8b90b2b8935b19a675e9be22e5a", "published_at": "2019-09-18"}