{"pub": "scmp", "url": "https://yp.scmp.com/over-to-you/columns/article/114460/letters-dorm-making-house-home", "downloaded_at": "2019-10-15 08:02:00.455367+00:00", "title": "Letters from the dorm: Making a house a home", "language": "en", "text": "Every new academic year at university brings new challenges. As I am no longer a first year, I have now moved out of the halls of residence and into an old, 19th-century, British-style house further from the city centre. Given that this style of house would never be found in Hong Kong, it is a fantastic new way to experience living and studying abroad.\n\nI am very excited to be living with friends, but there are also a lot of practical things to consider when sharing a house with other students.\n\nLetters from the Dorm: my realisations as I turn 20\n\nFor one, shared kitchens, toilets, and bathrooms mean that everyone needs to be mindful that others will use these facilities after you. I have heard stories of how relationships between people in the house have been affected as a result of people not picking up after themselves after using the shared facilities. So my housemates and I decided to hold a house meeting early in the term to agree on some general rules that would work with the routines of different people. We also decided on communal items for the house that we can buy. Unlike in the United States, a lot of students in Britain will share houses rather than dorm rooms. This is a great learning experience.\n\nSafety is another key consideration, as we are now living outside the student accommodation that is monitored 24/7, so that means being extra careful when leaving and entering the house. Living in a house really makes you become more mature, because you need to resolve a lot of issues as and when they happen. Speaking from experience, this includes attempting to fix the fridge and washing machine!\n\nLetters from the Dorm: don't let society define what success means to you\n\nThere are also a lot of exciting things that come with living with friends. My housemates and I plan to decorate the house to really make it feel like a cosy home. Also, living in the same house makes it so much easier to socialise and go out together. In my case, our back garden is connected to the neighbouring houses where fellow students from my university are living, which makes it very easy to head to our neighbours’ homes to hang out. We plan to cook together in the evenings, and plan other social events for occasions like birthdays.\n\nThis way of living differs hugely from living in a large student dormitory, as it feels more intimate but also much more like a permanent home. Despite only moving in a week ago, I am already calling my house a “home”, and I cannot wait for all the memories that I will make here.", "description": "It can be challenging to learn to live with friends, but as long as you're considerate and open, it's a great away to make memories.", "authors": [], "top_image": "https://yp.scmp.com/sites/default/files/styles/900x506/public/images/shutterstock_1205335219.jpg", "published_at": "2019-10-15"}