{"pub": "yahoo", "url": "https://finance.yahoo.com/news/chicago-teachers-decide-strike-date-190128182.html", "downloaded_at": "2019-10-04 12:37:20.139097+00:00", "title": "Chicago Teachers Set Strike Date as Investors Eye Costs", "language": "en", "text": "(Bloomberg) -- Chicago teachers have decided to strike in about two weeks, leaving investors in the city’s junk-rated school district closely watching the costs of the Chicago Board of Education’s efforts to avoid a walkout.\n\nThe Chicago Teachers Union said Wednesday it had set a strike date of Oct. 17. The announcement comes after about 800 union delegates representing every school in the district met behind closed doors.\n\n“Strike will be a last resort,” Jesse Sharkey, president of the union, said during a Wednesday evening press conference, adding that the group is trying to reach a negotiated settlement. “The city can afford our demands.”\n\nAbout 94% of Chicago Teachers Union members voted last week to authorize a strike to demand higher pay, more support staff like nurses and social workers and better working conditions. Union and district representatives are still negotiating, with school officials enhancing their offer, according to the district.\n\n“We are looking for a settlement that’s in the district budget, and the district is able to sustainably fund the contract,” said John Ceffalio, a credit analyst for AllianceBernstein Holding LP, which holds $45 billion in municipal assets including Chicago and the city’s school bonds. “If it is more expensive, how are they going to fund it?”\n\nThe teachers union has rejected the district’s offer for a 16% pay increase over five years and has said its plan for adding support staff falls short. The standoff comes at the same time that city park district workers and other school staff like security guards are also planning to strike at the same time, leaving Mayor Lori Lightfoot facing multiple walkouts this month. The parks have come to agreement with 24 of its 25 union but no deal has been made with SEIU Local 73, which represents two-thirds or 2,400 workers, the district said Wednesday.\n\n“We are going to stick together,” Sharkey said.\n\nContingency Plans\n\nSchool buildings will be open on normal schedules to give students “a safe place to go should a work stoppage occur,” on Oct. 17, according to the Chicago Public School’s contingency plan.\n\n“While we are doing everything in our power to reach a fair deal that prevents a strike, we are fully prepared for a work stoppage should one occur,” according to a joint statement from Lightfoot and CPS Chief Executive Officer Janice K. Jackson.\n\nSchool bondholders and credit rating companies are monitoring the teachers’ plans, and watching how much the nation’s third-largest school district gives in to avoid or end a strike.\n\nBoth sides reaching an agreement before a walkout is within expectations, according to AllianceBernstein’s Ceffalio. Chicago teachers last had a one-day walkout in April 2016, and in 2012, the union staged the city’s first public school strike in 25 years.\n\n“We are paying close attention as bondholders,” Ceffalio said.\n\nSince the district introduced its $7.7 billion budget in early August, its subsequent offers to the union would raise labor costs by tens of millions of dollars in fiscal 2020 and over the next five years, according to a person at the district close to the negotiations. The board still expects to stay in its budget parameters, according to the person who asked not to be named as the discussions are ongoing. Given additional state funding, the district “can more than afford to do better by our students,” according to Chris Geovanis, a union spokeswoman.\n\n“We are looking for structural balance,” Blake Yocom, an analyst for S&P Global Ratings, said in a phone interview. “CPS has built in certain assumptions. Anything beyond that that reverses their positive trend or recent improvement in financial position would hold back any future upgrades.”\n\nIt wasn’t that long ago that the school district was in danger of running out of money. For example, in 2016, the district was facing a $1 billion deficit and needed to borrow money to stay solvent, the school system’s management said at the time. Its finances have improved since the state of Illinois increased its funding to Chicago’s schools last year. S&P in August raised its rating on the Chicago Board of Education to BB- from B+ with a positive outlook. Fitch also boosted its rating by one level to BB, two levels into junk.\n\n“They just returned to a positive fund balance,” Yocom said. “Any erosion of that could lead to a revision of the outlook back to stable. If this settlement is successful and achieves a structural balance, they were looking at a likelihood of an upgrade.”\n\nStory continues", "description": "(Bloomberg) -- Chicago teachers have decided to strike in about two weeks, leaving investors in the city’s junk-rated school district closely watching the costs of the Chicago Board of Education’s efforts to avoid a walkout.The Chicago Teachers Union said Wednesday it had set a strike date of Oct. 17", "authors": ["Shruti Date Singh"], "top_image": "https://s.yimg.com/uu/api/res/1.2/OQy6bV6kEm97gwAfP01bSA--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/92574e76f5f64d2cf17a0a0016e9140d", "published_at": "2019-10-03"}