{"pub": "businessinsider", "url": "https://businessinsider.com/south-carolina-republican-mark-sanford-will-challenge-trump-in-primary-2019-9", "downloaded_at": "2019-09-08 23:32:25.189873+00:00", "title": "South Carolina Republican Mark Sanford announced he will challenge Trump in the GOP primary", "language": "en", "text": "Former South Carolina governor and Republican Rep. Mark Sanford announced Sunday that he is launching a primary challenge to President Donald Trump.\n\n\"I am going to get in,\" Sanford said in a \"Fox News Sunday\" interview. \"I think we need to have a conversation on what it means to be a Republican.\"\n\n\"I think that as a Republican Party we have lost our way,\" he added.\n\nSanford lost his congressional primary in 2018 after emerging as a vocal critic of Trump, who in turn encouraged voters to vote against him.\n\nAfter his loss and an ultimate Democratic victory in the district, Sanford penned an Op-Ed in The New York Times that closely echoed his comments Sunday reflecting on the Republican party.\n\n\"Republicans got a wake-up call last week. But will we wake up?\" Sanford wrote. \"My party would be wise to take a step back from President Trump's approach to politics.\"\n\nThe former governor joins former Massachusetts governor Bill Weld and former GOP congressman and conservative radio host Joe Walsh are both challenging Trump in the Republican primary.\n\nRead more: Here's everyone who's running for president in 2020, and who has quit the race\n\nAhead of the announcement on Twitter last month, Trump mocked attacked Sanford, Walsh, and Weld, and in part referenced Sanford's admitted extramarital affair that was revealed in 2009.\n\nThough Trump has seen rising popularity among his Democratic challengers, he has a near-90% approval rating among Republicans.", "description": "Sanford lost his congressional primary in 2018 after emerging as a vocal critic of Trump, who in turn encouraged voters to vote against him.", "authors": ["Ellen Cranley"], "top_image": "https://amp.businessinsider.com/images/5d7508ed2e22af5b093f14e5-1920-960.jpg", "published_at": "2019-09-08"}