{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7592423/Rachel-McCord-30-joyfully-waves-ultrasound-photo-baby-leaves-doctors-office.html", "downloaded_at": "2019-10-20 00:29:48.323115+00:00", "title": "Rachel McCord, 30, joyfully waves an ultrasound photo of her baby as she leaves doctor's office", "language": "en", "text": "She recently announced she's pregnant with her first child in an exclusive DailyMailTV interview.\n\nAnd Rachel McCord was seen jubilantly waving an ultrasound picture of her bundle of joy as she left a doctor's office in Los Angeles on Friday.\n\nThe 30-year-old model was joined by her husband Rick Schirmer, mother Sheri Garday, and sister AnnaLynne McCord for the happy moment.\n\nJumping for joy: Rachel McCord was seen jubilantly waving an ultrasound picture of her bundle of joy as she left a doctor's office in Los Angeles on Friday\n\nAuthor and social media influencer Rachel was ravishing in red for the appointment, pairing a bright wraparound mini skirt with a matching red bikini top.\n\nOver this she slipped a floral print beach kimono, also in red.\n\nOn her feet, McCord wore a pair of clear heels which added inches to her 5ft5in frame.\n\nHe wavy blonde tresses were worn loose and she shielded her eyes with a pair of mirrored aviator shades.\n\nAt one point the blonde bombshell planted a smooch on the lips of her entrepreneur husband, whom she married in 2013.\n\nA family affair: The 30-year-old model was joined by her husband Rick Schirmer [R], mother Sheri Garday [2L], and sister AnnaLynne McCord [far left] for the happy moment\n\nLoved-up: At one point the blonde bombshell planted a smooch on the lips of her entrepreneur husband, whom she married in 2013\n\nMcCord revealed in an exclusive interview with DailyMailTV she is pregnant with her first child after a health scare almost shattered her dream of having a baby.\n\nThe news comes as a huge relief for the star after she underwent emergency surgery following the discovery of a painful ovarian cyst earlier this year.\n\nAnd while her and husband Rick are filled with joy over the pending arrival, the couple still face a nerve-wracking few months after doctors told them that a congenital heart condition that Rachel has had since childhood means the pregnancy is considered 'high risk'.\n\nSpeaking of her heartache turned joy, Rachel told DailyMailTV: 'It's been tough but I feel so blessed. My husband and I are just literally over the moon. We feel like we've hit the complete jackpot.\n\n'What a blessing to literally have my dream growing right now in my body. It's crazy.'\n\nRachel exclusively revealed to DailyMailTV that she and her husband Rick Schirmer are two months pregnant with their first child\n\nSpeaking of her heartache turned joy, Rachel told DailyMailTV: 'It's been tough but I feel so blessed. My husband and I are just literally over the moon. We feel like we've hit the complete jackpot. What a blessing to literally have my dream growing right now in my body. It's crazy'\n\nRachel, who has forged a successful career as a model, author and social media influencer, says she decided to have a baby after realizing that her life lacked 'significance'.\n\nShe already knew her heart condition would be a factor but says she's always been 'optimistic' and decided to give it a go.\n\n'This is what your body naturally wants to do and I'm gonna do it,' she said.\n\nRachel went to see her doctor in January this year for a pre-natal check up.\n\n'I went in all excited and I left sobbing,' she recalls. 'My doctor said \"no, you cannot try to get pregnant right now\", because I had an ovarian cyst that was larger than my ovary.\n\n'And the problem with an ovarian cyst that is over six centimeters, which mine was, is that you have a concern of torsion.'\n\nOvarian torsion can result in the cyst and ovary twisting which can cut off blood flow to the ovary and fallopian tube.\n\nThe medical emergency can cause serious complications and in rare cases can be fatal.\n\n'It's a really serious condition,' said Rachel. 'My doctor told me, \"we need to rush you into surgery\", that's not what you want to hear.\n\n'I suddenly felt my whole future flash before my eyes. Here I am feeling like my life is lacking significance because I don't have a child and now I don't know if I can have kids... that's a really scary thing to feel.'\n\nRachel is grateful to have such a great support network around her, saying: 'I'm so grateful that I have a husband who's so insanely supportive and who has held my head above the toilet more times than I'd like to remember. He's just been there and shown up in so many ways. And I have my sister who lives next door to me, which is so much fun'. Pictured: Rachel with her actress sister AnnaLynne McCord\n\nWHAT IS AN OVARIAN CYST An ovarian cyst is a fluid-filled sac that develops on a woman's ovary. They're very common and don't usually cause any symptoms. Most ovarian cysts occur naturally and disappear in a few months without needing any treatment. Symptoms An ovarian cyst usually only causes symptoms if it splits, is very large, or blocks the blood supply to the ovaries. In might cause: pelvic pain – this can range from a dull, heavy sensation to a sudden, severe and sharp pain\n\npain during sex\n\ndifficulty emptying bowels a frequent need to urinate\n\nheavy periods, irregular periods or lighter periods than normal\n\nbloating and a swollen tummy\n\nfeeling very full after only eating a little\n\ndifficulty getting pregnant – although fertility is unaffected in most women with ovarian cysts Ovarian cysts can sometimes also be caused by an underlying condition, such as endometriosis. The vast majority of ovarian cysts are non-cancerous (benign), although a small number are cancerous (malignant). Cancerous cysts are more common in women who have been through the menopause. Surgical treatment to remove the cysts may be needed if they're large, causing symptoms, or potentially cancerous. In some cases, surgery to remove both your ovaries may be necessary, in which case you'll no longer produce any eggs. Source: NHS and Mayo Clinic\n\nRachel faced the prospect of losing an ovary and her chances of ever having a baby looking increasingly slim.\n\nEven worse, the doctor was also concerned the cyst might be cancerous.\n\n'I'm about to redesign my life for a baby, but my doctor is saying, \"you need to get into pre-op, you need to get into surgery\".\n\n'I burst into tears, it was just shocking and I think there was kind of this weight and this heaviness to my emotions because it was scary.'\n\nRachel's husband of six years Rick was equally as concerned.\n\nHe told DailyMailTV: 'All of a sudden the whole pregnancy was in question, we had to hit the breaks on everything, it was pretty scary. We don't know if it's cancerous.\n\n'I was really scared for Rachel's emotional well being as well.'\n\nFortunately tests showed the cyst wasn't cancerous and surgeons were able to successfully remove the large growth from her left ovary without damaging it.\n\nRachel wasn't out of the woods yet, however.\n\nA few weeks after the surgery she was rushed to hospital by EMT because of complications and severe pain.\n\nThree months later, however, her ovary was on its way to healing, and Rachel and Rick decided to start trying for a baby.\n\n'We were a little bit over zealous and excited,' said Rachel.\n\n'We decided we would just do our best and maybe it would take a year. We knew that we were dealing with this recovering ovary, but we were going to start.'\n\nA matter of weeks later in August, Rachel missed her period and decided to take a pregnancy test at her apartment in Marina del Rey, California.\n\nShe was sat with her sister, 90210 beauty AnnaLynne McCord, when she learned the bombshell news.\n\n'Suddenly I was blown away. I literally looked at it, my sister AnnaLynne was here and Ricky was in the other room and I was like, \"that's so weird. It says pregnant\". That's how shocked I was.\n\n'And then I just started freaking out... \"Oh my God. Oh my God\", I literally started screaming. We'd only tried four or five times and we had gotten pregnant. I mean, some miracle.'\n\nRachel says businessman Rick, 45, has been on cloud nine ever since.\n\n'Rick is so proud of himself. He is like, \"that's right. That's how we do it\". He is so proud of his very quick one and done situation. He definitely got the goal.'\n\nRick was definitely blown away by the news.\n\nRachel says businessman Rick, 45, has been on cloud nine ever since. 'Rick is so proud of himself. He is like, \"that's right. That's how we do it\". He is so proud of his very quick one and done situation. He definitely got the goal'\n\nRachel, who has forged a successful career as a model, author and social media influencer, says she decided to have a baby after realizing that her life lacked 'significance'\n\n'It was all hugs and tears,' he said. 'I picked up AnnaLynne and threw her over my shoulder and ran around the house. Rachel's going to be the best mom ever.'\n\nAnnaLynne also lights up when recalling the joyous moment and says she's 'so happy' to be a 'co-parent' to Rachel and Rick's child.\n\n'It was literally pandemonium, she's screaming, I'm screaming, \"no way, you're kidding, your joking\". Then we're FaceTiming everyone, it was very surreal,' she said.\n\nRachel's mom Shari, who is in LA visiting with her daughter, says she's thrilled to have her first grandchild on the way.\n\n'I am just so excited,' she told DailyMailTV. 'I've been been boldly proclaiming that this needs to happen for a while, in Christmas cards and birthday cards, in memes.\n\n'At first I thought it was a joke until Rachel holds up this little stick. Then we're just ballistic.'\n\nWhile confident that their baby will be born without any complications, Rachel says she's obviously worried.\n\nTwo visits to the ER since getting the news hasn't helped.\n\nRachel said: 'I'm so afraid, it's such a blessing and it's a complete dream come true, but there are also those fears - am I going to be okay? Is my body up for this? You really want to give your baby everything.\n\n'I feel so sick and have dealt with so much morning sickness, but then at the same time, that's such a good sign for my pregnancy.'\n\nThrough the tears and severe cramps Rachel says it will all be worth it in the end.\n\nRachel's sister actress AnnaLynne McCord also lights up when recalling the joyous moment and says she's 'so happy' to be a 'co-parent' to Rachel and Rick's child. Rachel's mom Shari says she's thrilled to have her first grandchild on the way, adding: 'I've been been boldly proclaiming that this needs to happen for a while'. Pictured: Rachel with her mom Shari and sister AnnaLynne\n\nShe said: 'I've always wanted a baby, ever since I was a little girl I collected baby dolls, I had strollers for them and high chairs.\n\n'I would wake myself up in the middle of the night to change my baby's diaper to prepare for motherhood. I've always dreamed of being a mom. And then I launched my career and it was such a fun experience, but I got to a point where I just felt like my life was just lacking. I felt like it was missing significance.\n\n'I had a lot of success, but what was the point of all of it? So that's why my husband and I decided to try for a baby.'\n\nRachel describes being pregnant as a 'remarkable and insane' experience.\n\nShe says because of her heart condition - which causes her to have reduced blood flow - a cesarean section isn't an option.\n\n'I think that a natural birth is the best, but I'm really nervous about the delivery, but my first priority is the baby,' she says.\n\nRachel - who is hoping to mirror the success of Gwyneth Paltrow's Goop blog with her own The McCord List - says she's grateful to have such a great support network around her.\n\n'I'm so grateful that I have a husband who's so insanely supportive and who has held my head above the toilet more times than I'd like to remember. He's just been there and shown up in so many ways,' she said.\n\n'And I have my sister who lives next door to me, which is so much fun, and my mom, she's come into town to help me. The greatest gift of all is family.'\n\nAnnaLynne says she's also got big plans for Rachel's baby shower and admits she wants to cut the child's cord once it's born. 'I'm slightly weird, but that's something I really want to be part of,' she says\n\nThe model says she's also enjoying certain beneficial changes to her body.\n\n'Everything swells when you're pregnant. I've always been such a little petite human, so to suddenly actually need a bra, I'm like, \"Oh, this is why you get supportive bras\".\n\n'It's so funny. My husband's definitely enjoying the perks of the pregnancy.'\n\nRachel and Rick's baby is due in May 2020 and the couple don't want to know their child's gender until he or she is born.\n\nGrandmother-to-be Shari says she plans to drop plenty of hints over solid names for the child.\n\nBlogger Rachel has established herself as a preeminent influencer in Hollywood and plans to share her pregnancy journey with her 501k Instagram followers\n\n'Maybe some subtle, not so subtle hints,' she laughs.\n\nWhile sister AnnaLynne, 32, star of TV series American Heiress and Nip/Tuck, says the new baby will transform Rachel's world.\n\n'I think it's just gonna be a beautiful overall process for her, to love something inside yourself and also love yourself. I just can't wait to see her pour that on and I can't wait to see how it materializes after the child is here.'\n\nAnnaLynne says she's also got big plans for Rachel's baby shower and admits she wants to cut the child's cord once it's born.\n\n'I'm slightly weird, but that's something I really want to be part of,' she said.\n\nBlogger Rachel has established herself as a preeminent influencer in Hollywood and plans to share her pregnancy journey with her 501k Instagram followers.\n\n'I've already got some ideas about my maternity wear and I'm going to design my own pieces,' she said.\n\n'I hope to continue to share my heart in an authentic way. I feel so blessed.'\n\nAmong the star's high-profile projects include her book, Slay The Fame Game, and her popular blog, The McCord List, in which she details the nitty gritty of her career, which sits at the intersection of social media and show business.\n\nIn addition to her online accomplishments and modeling portfolio, Rachel has also got her feet wet as an actress, as she's appeared in 2011's Getting That Girl and 2007's Bad Girl Island, in addition to TV shows American Heiress and Victorious.", "description": "Rachel McCord was seen jubilantly waving an ultrasound picture of her bundle of joy as she left a doctor's office in Los Angeles on Friday.", "authors": ["David Lawrance For Dailymail.Com", "Ryan Parry", "West Coast Editor For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/00/19940644-0-image-a-9_1571527026956.jpg", "published_at": "2019-10-19"}