{"pub": "marketwatch", "url": "https://marketwatch.com/story/jobless-claims-inch-up-in-mid-september-2019-09-19", "downloaded_at": "2019-09-19 23:05:01.888063+00:00", "title": "U.S. jobless claims inch up in mid-September", "language": "en", "text": "Bloomberg Commuters exit the Wall Street subway station near the New York Stock Exchange (NYSE) in New York.\n\nThe numbers: One week after falling sharply, the number of people who applied for U.S. unemployment benefits in mid-September inched higher, the government said Thursday.\n\nInitial jobless claims, a rough way to measure layoffs, rose 2,000 to 208,000 in the seven days ended Sept. 14, the government said Thursday. Claims fell a revised 13,000 to 206,000, a nearly five-month low, in the prior week.\n\nEconomists polled by MarketWatch estimated new claims would total a seasonally adjusted 215,000.\n\nThe more stable monthly average of new claims fell by a smaller 750 to 212,250. The four-week average gives a more accurate read into labor-market conditions than the more volatile weekly number.\n\nInitial claims for unemployment insurance increase by 2,000 in the latest reporting week to 208,000https://t.co/4uYcoO8fMP pic.twitter.com/twhJ2wjnLw — St. Louis Fed (@stlouisfed) September 19, 2019\n\nWhat happened: Actual or unadjusted jobless claims rose in only a few states like Texas, California, and North Carolina. If the strike by workers at General Motors Co. GM, -1.05% lasts long enough, there could be more layoffs at companies that make tires and seats and other products for the GM system, economists said.\n\nBig picture: Federal Reserve Chairman Jerome Powell on Wednesday pointed to the strong labor market as a reason for optimism about the U.S. economy even as manufacturing is weak and businesses are increasingly uncertain because of the U.S.-China trade war. A majority of Fed officials think a modest adjustment to interest rates should keep the expansion going.\n\nWhat are they saying: “Claims remain low, consistent with a still-solid trend in employment growth. While net employment growth depends on gross hiring as well as the pace of layoffs, and the trend in payrolls gains appears to have moderated a bit -- due to reduced hiring rather than increased firing -- major weakening in employment growth is invariably associated with an uptrend in claims,” said Jim O’Sullivan, chief U.S. economist at High Frequency Economics.\n\nMarket reaction: The Dow Jones Industrial Average DJIA, -0.19% and the S&P 500 index SPX, +0.00% ended lower on Thursday as investors wrestled with the message from the Fed’s rate cut and Powell’s press conference.", "description": "U.S. initial jobless claims, a rough way to measure layoffs, rose 2,000 to 208,000 in the seven days ended Sept. 14, the government said Thursday.", "authors": ["Greg Robb", "Senior Economics Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR592_wall_s_ZG_20190918184513.jpg", "published_at": "2019-09-19"}