{"pub": "businessinsider", "url": "https://businessinsider.com/facebook-removes-anti-abortion-factcheck-after-senators-complain-2019-9", "downloaded_at": "2019-09-13 11:21:08.404412+00:00", "title": "Facebook removed a fact-check on an anti-abortion video after Republican senators including Ted Cruz complained", "language": "en", "text": "Facebook removed a fact-check on an anti-abortion video after it received a letter of complaint from four Republican Senators, including Ted Cruz.\n\nThe video, posted by campaigner Lila Rose for the anti-abortion organisation Live Action, claimed that abortion is never medically necessary. Here is the video:\n\nThree doctors working for Health Feedback said that Rose's claim is inaccurate. They said conditions such as placenta previa and HELLP syndrome can make an abortion necessary to prevent the mother's death.\n\nThis is how the fact-check appears on their website:\n\nHealth Feedback's fact-check. Health Feedback\n\nRose's argument for such situations was early delivery of the baby. The doctors said this is only possible after the foetus is 24 weeks old, and so may be the only option in earlier-stage pregnancies.\n\nFacebook, which has been trying to introduce more fact-checking to its platform in an attempt to counter misinformation and fake news, displayed the fact-check next to Rose's Facebook video.\n\nLive Action also claimed that Facebook had informed it that its content would be restricted due to \"repeated sharing of false news.\"\n\nRead more: \"They threw us under the bus at every opportunity\": Facebook fact-checkers say its mission to weed out fake news was a PR stunt\n\nRose retaliated on Twitter, claiming the doctors were \"abortionists\" and therefore not impartial.\n\nShe also accused Facebook of \"aggressively [and] publicly siding w[ith] the abortion lobby [and] actively shutting down pro-life educational content.\"\n\nOn Thursday morning Republican Senators Ted Cruz, Josh Hawley, Kevin Cramer, and Mike Braun sent a letter to Facebook accusing it of censorship, echoing Rose's stance that the doctors were not impartial.\n\nThey said that the code of conduct established by the International Fact-Checking Network (ICFN) stipulates that fact-checkers not advocate or take policy decisions on issues which they fact-check.\n\nSubsequently Facebook said it had been in touch with the ICFN to open an independent investigation. \"While the IFCN investigates, we are removing the relevant fact checks and have communicated this to the members of the US Senate who brought this specific concern to our attention,\" a Facebook spokesperson told BuzzFeed.\n\nWhen contacted by Business Insider, Facebook was not immediately available for comment.\n\nFacebook is one of the big tech companies which multiple Republicans — including President Donald Trump— have accused of censoring conservative speech on their platforms.", "description": "Doctors working for fact-checking site Health Feedback labelled a Facebook video from anti-abortion campaigner Lila Rose as inaccurate.", "authors": ["Isobel Asher Hamilton"], "top_image": "https://amp.businessinsider.com/images/5d7b67d32e22af168325bc04-2732-1366.jpg", "published_at": "2019-09-13"}