{"pub": "abcnews", "url": "https://abcnews.go.com/International/russia-launches-wave-raids-opposition-activists/story?id=65558850", "downloaded_at": "2019-09-13 00:57:26.289783+00:00", "published_at": "2019-09-13", "title": "Russia launches wave of raids against opposition activists", "language": "en", "text": "Russia’s security services on Thursday launched a sweeping wave of raids targeting the anti-Kremlin opposition leader Alexey Navalny and his supporters, searching dozens of homes and offices in cities across Russia and detaining several people.\n\nInterested in Russia? Add Russia as an interest to stay up to date on the latest Russia news, video, and analysis from ABC News. Add Interest\n\nThe scale of the raids was exceptionally large. By midday local time, police had raided around 150 addresses in 41 cities, according to Navalny’s group, the Anti-Corruption Fund (FBK). The group’s 45 regional offices were hit and police also searched the homes of dozens of the group's activists, FBK said.\n\nVideos posted online by some activists showed masked officers in body armor carrying out the raids in some cities. In other places, activists posted videos and photos of plain-clothed officers carrying out the searches. Navalny's group posted videos showing police going through their offices and said police had seized phones and computers.\n\nAt least several Navalny volunteers in various cities were detained, some taken away by masked police. They later posted they had been taken in for questioning.\n\nYuri Kochetkov/EPA via Shutterstock\n\nThe wave of searches comes days after local elections in which President Vladimir Putin’s ruling political party, United Russia, suffered significant losses in Moscow and struggled in some regions, an unusual blow to the Kremlin and which followed weeks of protests in the Russian capital.\n\nNavalny and his allies have taken credit for those losses, attributing them to their campaign of tactical voting which saw them call on people to vote for any candidate with the best chance of beating the Kremlin. On Thursday, Navalny said the raids were clearly a response to the elections and were designed to intimidate his group and those opposed to Putin.\n\n“Vladimir Putin is very upset and stamping his feet,” Navalny said in a video posted to his followers. “Tell me, do you remember an operation of this scale happening in our country against corruption? Or against terrorists? Or against drug traffickers? But against our offices, against FBK, it’s just happening,” Navalny said using the acronym for his organization.\n\nThe city council itself has little power, but the opposition targeted it in an attempt to underline the unpopularity of Putin's party, which has sunk in the polls, particularly in Moscow.\n\nBecause Navalny and other anti-Kremlin opposition leaders were barred from running, in practice the tactical voting meant backing the Communist Party.\n\nAlthough hard to measure, in Moscow the tactical voting campaign appeared to have an impact: in the elections Sunday, United Russia’s majority in the 45-seat city parliament collapsed from 40 to 24. All but one of the candidates backed by Navalny's tactical voting campaign won, with the Communists taking 13 seats. The liberal party, Yabloko, that is allied with Navalny, won all four districts where it ran.\n\nThat result and weak performances in some other regions were seen as signaling bigger problems for the Kremlin. Although Putin himself remains generally popular, the weakening support for his party undermines his legitimacy. It is particularly worrying for the Kremlin with parliamentary elections due in 2021. United Russia polled so badly in Moscow ahead of these elections that it ran all of its candidates as nominal \"independents.\"\n\n“We completely understand why Putin is having these hysterics,\" Navalny said Thursday. \"How will he now prove that he has a majority behind him?”\n\n59.RU via Reuters\n\nThe raids are the latest fallout in what has been a summer of protest and a resulting police crackdown, that was sparked by the local elections. Thousands of people protested most weekends in Moscow since mid-July to demand fair elections, after elections officials barred most anti-Kremlin opposition candidates from taking part.\n\nAuthorities responded with the harshest crackdown in decades. Hundreds were arrested at the protests, where riot police dispersed the peaceful crowds and courts have now handed several demonstrators tough prison sentences. Virtually all of Russia’s opposition leaders, including Navalny, spent weeks in jail, convicted of illegal protest organizing.\n\nAt the height of the protests, police opened a criminal fraud investigation into the financing of Navalny’s group. Activists on Thursday said police had told them they were carrying out the searches in connection with this case.\n\nNavalny has called the fraud investigation politically motivated, saying police have simply labeled legitimate donations to his group as criminally obtained.\n\nThe 43-year-old former lawyer has become the Kremlin’s most troublesome opponent, building a national following with his investigations into alleged official corruption, which he presents in viral videos on his YouTube channel. Over recent years, Navalny has constructed a national network of so-called \"campaign offices,\" using them to organize protest rallies and conduct election monitoring.\n\nA key lieutenant of Navalny, Leonid Volkov on Thursday wrote that protesters had prepared for such raids and promised the group would keep functioning.\n\n“We of course were ready for this, we have all the necessary reserve infrastructure for continuing activity and the quickest restoration of the normal work,” Volkov wrote on the social media messenger Telegram.", "description": "Russian authorities launched a sweeping wave of raids against the opposition leader Alexey Navalny and his supporters Thursday.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/navalny-elections-sh-ps-190912_hpMain_16x9_992.jpg"}