{"pub": "politico", "url": "https://politico.com/news/2019/10/15/trump-tax-returns-047655", "downloaded_at": "2019-10-15 23:52:44.184487+00:00", "title": "Prosecutors flag that DOJ is not in sync with Trump on tax returns claim", "language": "en", "text": "The Justice Department brief filed last week in the case said that the effort to use a criminal subpoena to obtain Trump’s tax returns raised “significant constitutional questions” and should be put on hold so its impact could be reconsidered by a federal district judge.\n\nBut Justice officials did not go as far as Trump lawyers, who argued that a sitting president is entirely off-limits to state prosecutors.\n\nVance’s team also scoffed at arguments from Trump and the Justice Department that impeachment is the mechanism the Constitution prescribes for misconduct by a president. The local prosecutors noted that Trump White House counsel Pat Cipollone sent a letter to Congress last week defying its demands for information in an impeachment inquiry.\n\n“The reality is that Appellant has refused to participate in the very impeachment process that he presents here as the bulwark against placing a president above the law… His core position on every one of these matters is that the United States Presidency places him beyond the reach of the law,” Vance’s office wrote.\n\nProsecutors also emphasized their argument that allowing Trump to fend off the subpoena would threaten investigations of other individuals who could potentially be charged, regardless of whatever legal protections a president may claim.\n\nVance’s office says it is investigating various matters relating to the Trump Organization, including how the business recorded so-called “hush money” payments to two women who claimed sexual encounters with Trump, Stephanie Clifford and Karen McDougal.\n\nCohen, Trump’s former attorney, has pleaded guilty in federal court to arranging those payments as part of an effort to elect Trump to the presidency in 2016. Court documents filed by federal prosecutors in Manhattan alluded to Trump as a co-conspirator in that case, but he has not been charged. Justice Department policy bars charging a sitting president with a crime.\n\nA three-judge panel of 2nd Circuit judges is scheduled to hear arguments on Trump’s appeal next week.\n\nThe dispute involving the Manhattan D.A. is one of at least four ongoing court cases involving efforts to obtain Trump’s financial records.\n\nLast week, Trump lost the first of those cases to reach a federal appeals court as a D.C. Circuit panel ruled, 2-1, against his attempt to block a subpoena from the House Oversight and Government Reform Committee.\n\nTrump’s attorneys have indicated they plan to go to the Supreme Court if lower courts don’t back his demands to quash the subpoenas.\n\n", "description": "", "authors": [], "top_image": "https://static.politico.com/27/33/490af737478eac8a13eb3537fb39/191015-donald-trump-gty-773.jpg", "published_at": "2019-10-15"}