{"pub": "marketwatch", "url": "https://marketwatch.com/story/4-missing-as-cargo-ship-capsizes-catches-fire-off-georgia-coast-2019-09-08", "downloaded_at": "2019-09-08 23:27:18.884813+00:00", "title": "4 missing as cargo ship capsizes, catches fire off Georgia coast", "language": "en", "text": "ST. SIMONS ISLAND, Ga. — Rescuers were searching Sunday for four crew members of a cargo ship that overturned and caught fire near a port on the Georgia coast, but the efforts ran into trouble amid the flames and instability of the ship, the U.S. Coast Guard said.\n\nThe Golden Ray cargo ship’s problems began in the early morning when it listed heavily and rolled on its side in St. Simons Sound near the Port of Brunswick with 23 crew members and one pilot on board.\n\nCoast Guard Capt. John Reed said 20 were safely evacuated from the ship before rescuers determined the situation, as smoke and flames appeared, was too risky to go further inside the vessel.\n\nReed said rescue teams Sunday were trying to stabilize the 656-foot vehicle carrier to continue their search for the missing crew, but they have been unable to determine if the fire has been extinguished.\n\n“Once salvage professionals have determined the vessel to be stable, we will identify the best option to continue our rescue efforts for the four crew remembers who remain on board,” Reed said at a Sunday afternoon news conference.\n\nSearch and rescue operations involve federal, state and local agencies. Coast Guard Lt. Lloyd Heflin said rescuers remained on the scene.\n\n“They continue to do what they can. It is a complex situation. We’re looking not just for the safety to be able to rescue the people that are on board, but also to be able to provide safety for our crew. It’s ongoing,” he said.\n\nThe Coast Guard said it was notified by a 911 call at about 2 a.m. Sunday of a capsized vessel in the sound.\n\nThe cause of the incident remains under investigation. Petty Officer 3rd Class Ryan Dickinson said it isn’t clear if weather conditions caused the ship to lurch. Hurricane Dorian brushed past the Georgia coast last week before being downgraded to a post-tropical cyclone.\n\nThe Coast Guard said the overturned ship hasn’t released any pollutants so far, but mitigation responses are ready in case they’re needed.\n\nThe Golden Ray, which the Coast Guard said was transporting cars, is flagged out of the Marshall Islands and was headed to Baltimore, according to the website vesselfinder.com. The ship’s registered owner is a South Korean company.\n\nThe Port of Brunswick is currently closed to vessel traffic, with an established emergency safety zone in St. Simons Sound. Vessels are not authorized within a half mile of the Golden Ray.\n\nThe port is one of the busiest U.S. seaports for shipping automobiles. Nearly 614,000 vehicles and heavy machinery units moved across its docks in the 2019 fiscal year that ended June 30, according to the Georgia Ports Authority.", "description": "Rescuers were searching Sunday for four crew members of a cargo ship that overturned and caught fire near a port on the Georgia coast, but the efforts ran...", "authors": ["Associated Press"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ885_capsiz_ZG_20190908164440.jpg", "published_at": "2019-09-08"}