{"pub": "bbc", "url": "https://bbc.com/news/world-latin-america-49788618", "downloaded_at": "2019-09-22 16:34:04.231436+00:00", "title": "Rio violence: Protests as girl, eight, 'killed by police'", "language": "en", "text": "Image copyright Family picture/Voz das Comunidades Image caption The eight-year-old girl was with her grandmother in a van when she was killed\n\nProtests have erupted in Brazil's Rio de Janeiro after an eight-year-old girl was allegedly killed by police, as the number of victims killed in operations by security forces continues to rise.\n\nÁgatha Vitória Sales Félix was with her grandmother in a van when she was shot in the back in a poor area on Friday.\n\nResidents said officers had targeted a motorcyclist when she was hit. Police said they had responded to an attack.\n\nA record 1,249 people have died in such raids in Rio from January to August.\n\nÁgatha is the fifth child to die as a result of violence blamed on the police.\n\nCritics say the hard-line approach of conservative Governor Wilson Witzel, who came to office in January, is behind the growing number of victims in the city's poorest areas, called favelas.\n\nOn Saturday, dozens of people protested in Alemão, one of Rio's largest favelas, where Ágatha was hit on Friday night. She was sent to a hospital but died.\n\nSome of the demonstrators carried placards saying \"Lives in the favelas matter\" and \"Stop killing us\". Other protests were planned for Sunday.\n\nSkip Twitter post by @vozdacomunidade Moradores do Complexo do Alemão estão neste momento realizando uma manifestação na entrada da Grota pela violência na favela e pela morte da Ágatha Félix, de 8 anos. pic.twitter.com/tCzzDNoLxb — Voz das Comunidades (@vozdacomunidade) September 21, 2019 Report\n\nIn a statement, police said officers had responded to attacks, leading to a confrontation with criminals. An investigation has been launched.\n\nBut Ágatha's family disputed this, saying officers had targeted a motorcyclist when she was hit, and there was no gunfight happening at the time.\n\n\"A guy came on a motorbike and the police asked him to stop. He didn't stop and left, he was unarmed, and the police shot. There was no confrontation, the only shot was [from the police],\" the girl's uncle, Elias, told local media.\n\nAnother death for the statistics\n\nBy Hugo Bachega, BBC News\n\nAnother poor, black family in mourning in Rio; another young, innocent life lost to a tragedy that spares almost no-one in the city's favelas. And, sadly, no sign that it will make any difference.\n\nGovernor Witzel has promised to fight violence with violence, a policy that has been tried in the past and has largely failed in achieving any lasting result. As more and more people die he has insisted he is on the right track and, outside the poorest districts, many see it as the price to be paid in an effort to reduce crime.\n\nIn the favelas, obviously, it is a different story. When I visited Alemão to cover yet another death blamed on the police, residents were almost unanimous in telling me how they see trigger-happy agents as the source of most of the violence.\n\nÁgatha's smiley face was on the front page of many newspapers in Rio. But as Ailton, her grandfather, said, she is likely to become just another statistic. Perhaps even worse, the chance that the family will ever see any justice is close to zero.\n\nRead Hugo's full report\n\nGovernor Witzel has not commented on Ágatha's death. He has adopted what many describe as a policy of confrontation, employing heavily armed officers and even helicopters with snipers to fight powerful drug gangs in densely populated favelas.\n\nNumber of people killed in police operations in Rio\n\nMr Witzel has often cited a drop in homicides and other crimes as proof that his policies are working. But experts say it is not clear if this is a direct result of his approach.\n\nFar-right President Jair Bolsonaro, who also defends the use of force against suspects, has repeatedly said that \"a good criminal is a dead criminal\".\n\nMore about life in Rio's favelas", "description": "The eight-year-old Brazilian girl was with her grandmother in a van when she was hit in the back.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/D444/production/_108904345_c24b0ba1-b293-4c79-81a9-dd0c70973d1b.jpg", "published_at": "2019-09-22"}