{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/2019/10/17/who-was-white-house-photo-meltdown-meeting-annotated", "downloaded_at": "2019-10-18 01:12:14.883164+00:00", "title": "Who is in Nancy Pelosi's Twitter picture?", "language": "en", "text": "Let’s review:\n\n1) Trump\n\nShortly after the meeting ended, Trump tweeted that Pelosi had a “meltdown” and later told his Twitter followers to “pray for her, she is a very sick person!”\n\nAD\n\nNancy Pelosi needs help fast! There is either something wrong with her “upstairs,” or she just plain doesn’t like our great Country. She had a total meltdown in the White House today. It was very sad to watch. Pray for her, she is a very sick person! — Donald J. Trump (@realDonaldTrump) October 17, 2019\n\n2) Pelosi\n\nPelosi told reporters after the meeting that Trump called her a “third-grade politician” before adding, “I think now we have to pray for his health.”\n\nAD\n\n3) Defense Secretary Mark T. Esper\n\nEsper has not commented publicly on the meeting. After the meeting, Senate Minority Leader Charles E. Schumer (D-N.Y.) said Esper undercut Trump’s plan for containing the Islamic State by saying there was no intelligence to back up Trump’s claim that Turkey and Syria would have the same interest in guarding Islamic State prisoners as the Kurds.\n\n4) Gen. Mark A. Milley, chairman of the Joint Chiefs\n\nMilley’s facial expression was the focus of much speculation following the meeting. An aide told The Washington Post’s Josh Dawsey that Milley also undercut Trump’s assertions on the Islamic State.\n\nAD\n\nTrump told legislative leaders today that he was tougher than Mattis, who was \"world's most overrated general,\" per Dem familiar with meeting. \"He wasn't tough enough. I captured ISIS.\" But Mark Milley, chairman of joint chiefs, said ISIS could \"reconstitute,\" per aide familiar. — Josh Dawsey (@jdawsey1) October 16, 2019\n\nIt’s also the subject of a lot of Twitter jokes.\n\n5) Senate Majority Leader Mitch McConnell (R-Ky.), Deputy Secretary of State John Sullivan, House Minority Whip Steve Scalise (R-La.)\n\nAD\n\nMcConnell did not speak at the meeting and declined to discuss it afterward. Sullivan and Scalise appeared to be in the same mind-set as Milley at the moment this photo was taken.\n\nMcConnell tells reporters, “I didn't make any observations in the meeting. I don't have any to make now.” — Emily Cochrane (@ESCochrane) October 16, 2019\n\n6) White House counsel Pat Cipollone\n\nMuch of Cipollone’s face is hidden behind Scalise. Cipollone recently wrote to House Democrats that the White House would not participate in what he called an illegitimate impeachment inquiry. Pelosi and House Minority Leader Kevin McCarthy (R-Calif.) said impeachment did not come up at the meeting.\n\nAD\n\n7) White House legislative affairs director Eric Ueland\n\nUeland’s facial expression at the end of the table seems to mimic that of Scalise, Sullivan and Milley.\n\n8) Reps. Eliot L. Engel (D-N.Y.) and Liz Cheney (R-Wyo.) and Sen. Robert Menendez (D-N.J.)\n\nAfter Trump played down the threat posed by the Islamic State, saying the United States doesn’t need to worry about “terrorists 7,000 miles away,” Cheney said the 9/11 terrorists also came from thousands of miles away. Engel is one of three House Democratic chairmen leading the impeachment inquiry.\n\nAD\n\nMenendez told CNN after the meeting that Trump was “belligerent” from the start of the meeting.\n\n“He smacked down a whole bunch of papers on the table and said: ‘You all asked for this meeting. I reluctantly agreed to it,’” Menendez said, referring to Trump. “No one had asked for the meeting.”\n\nAD\n\n9) House Majority Leader Steny H. Hoyer (D-Md.)\n\nAfter the meeting, Hoyer said, “Never have I seen a president treat so disrespectfully a co-equal branch of the government of the United States.”\n\n10) Sens. Charles E. Schumer (D-N.Y.) and Jack Reed (D-R.I.)\n\nSchumer told reporters after the meeting that Trump engaged in a “nasty diatribe not focused on the facts.”\n\n11) Reps. Mac Thornberry (R-Tex.) and Michael McCaul (R-Tex.)\n\nBoth voted to broadly condemn Trump’s withdrawal of U.S. troops from northern Syria before meeting with Trump. Pelosi raised the 354-60 vote with Trump at the meeting.\n\nAD\n\n12) White House and congressional aides, including Schumer’s chief of staff, Mike Lynch, and Pelosi’s chief of staff, Terri McCullough\n\nAD\n\nTop aides for Pelosi, Schumer, McConnell and McCarthy attended the meeting.\n\n13) Treasury Secretary Steven Mnuchin and McCarthy\n\nAfter the meeting, McCarthy slammed Pelosi for “storming out” of the meeting and said it was “productive” after she left.\n\n14) Other reported attendees\n\nTrump tweeted out two additional angles of the meeting.\n\nDo you think they like me? pic.twitter.com/TDmUnJ8HtF — Donald J. Trump (@realDonaldTrump) October 16, 2019\n\nThe Do Nothing Democrats, Pelosi and Schumer stormed out of the Cabinet Room! pic.twitter.com/hmP4FNhemv — Donald J. Trump (@realDonaldTrump) October 16, 2019\n\nAdam Smith (D-Wash.), the chairman of the House Armed Services Committee, was seated next to three empty chairs after Pelosi left. After the meeting, Smith said Trump insulted former defense secretary Jim Mattis “at great length.”\n\nHouse Armed Services Committee Chairman Adam Smith on Trump’s comments about Mattis at White House meeting:\n\n\n\n\"He insulted the former defense secretary at great length. … He basically said, ‘Consider the source, he doesn't know what he's talking about, he's a terrible general.’\" pic.twitter.com/pUeeV1dzKn — JM Rieger (@RiegerReport) October 16, 2019\n\nMcConnell’s chief of staff, Sharon Soderstrom, and McCarthy’s chief of staff, Dan Meyer, are among those seated against the back wall.\n\nDid we miss anyone or anything? Tweet me: @RiegerReport\n\nAD", "description": "The Fix analyzes the reactions of everyone in the photo President Trump tweeted out of the White House “meltdown” meeting.", "authors": ["Jm Rieger", "Video Editor For The Fix"], "top_image": "https://www.washingtonpost.com/resizer/sCu0CwPiaCSdm0WA1IdlnDog1U0=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QAFLYQA2FNFDJK72GG5IR3LYJI.png", "published_at": "2019-10-17"}