{"pub": "thehill", "url": "https://thehill.com/homenews/administration/465093-trump-says-hed-cooperate-with-impeachment-inquiry-if-the-rules-are", "downloaded_at": "2019-10-09 22:11:57.744991+00:00", "title": "Trump says he'd cooperate with impeachment inquiry 'if the rules are fair'", "language": "en", "text": "President Trump Donald John TrumpPelosi hits back at Trump over letter: 'Only the latest attempt to cover up his betrayal of our democracy' Trump directed Perry, State Dept. officials to talk to Giuliani on Ukraine: report Murkowski warns against rushing to conclusions on Trump impeachment MORE on Wednesday said he might be willing to cooperate with House Democrats' impeachment inquiry, but only if they hold a formal vote to outlines rules for the investigation and if those rules \"are fair.\"\n\nTrump was asked twice during an event in the Roosevelt Room of the White House if he would cooperate with Democrats leading the impeachment inquiry.\n\nADVERTISEMENT\n\n“We would if they give us our rights. It depends,\" Trump said initially, indicating that he would not be inclined to cooperate with the probe if Democrats \"say you can’t have lawyers, you can’t ask questions, you can’t have anybody present, all of these crazy things.\"\n\nAsked again to clarify his position, Trump reiterated that he would collaborate with Democrats \"if the rules are fair.\"\n\nWhite House counsel Pat Cipollone on Tuesday night sent a letter to Speaker Nancy Pelosi Nancy PelosiPelosi hits back at Trump over letter: 'Only the latest attempt to cover up his betrayal of our democracy' Murkowski warns against rushing to conclusions on Trump impeachment Turkey says it will cross into Syria 'shortly,' issues warning to Kurdish fighters MORE (D-Calif.) and three committee leaders stating that the administration would not cooperate with any of their requests related to the impeachment inquiry.\n\nThe White House decried the impeachment inquiry as an \"invalid\" effort to \"overturn the results of the 2016 election\" and asserted that the lack of a formal vote to start the investigation broke with past precedent and violated the executive branch's rights.\n\nPelosi announced late last month that the House would formally launch the inquiry into Trump, alleging he abused his office by urging Ukraine's president to “look into” Democratic presidential candidate Joe Biden Joe BidenPelosi hits back at Trump over letter: 'Only the latest attempt to cover up his betrayal of our democracy' Clinton jokes she could 'obviously' beat Trump in 2020 'rematch' Gowdy in talks to join Trump's impeachment defense team MORE.\n\nPelosi has noted that there is no legal obligation for the House to formally vote to authorize the impeachment inquiry. Some Democrats and Republicans have said they believe there should be a vote, however.\n\nDemocratic committee leaders have in recent days issued subpoenas demanding records from the White House, Vice President Pence, the Office of Management and Budget, the Pentagon and Trump’s personal lawyer Rudy Giuliani Rudy GiulianiPelosi hits back at Trump over letter: 'Only the latest attempt to cover up his betrayal of our democracy' Trump directed Perry, State Dept. officials to talk to Giuliani on Ukraine: report Murkowski warns against rushing to conclusions on Trump impeachment MORE as part of the investigation.\n\nTop Democrats have warned that the White House's refusal to comply with their requests could be cited as obstruction in a potential article of impeachment.", "description": "President Trump on Wednesday said he might be willing to cooperate with House Democrats' impeachment inquiry, but only if they hold a formal vote to outlines rules for the investigation and if those", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_100919getty.jpg", "published_at": "2019-10-09"}