{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/movies/2019/10/27/joker-vs-maleficent-joaquin-phoenix-wins-box-office-supervillain-rematch/2479448001", "downloaded_at": "2019-10-28 00:34:19.463354+00:00", "title": "Joaquin Phoenix's 'Joker' outwits Angelina Jolie's 'Maleficent 2' in box-office rematch", "language": "en", "text": "CLOSE 2019's holiday moviegoers get the chance to travel from a friendly neighborhood (hello, Mister Rogers!) to a galaxy far, far away. USA TODAY\n\nNEW YORK – Put on a happy face: \"Joker\" is No. 1 again.\n\nTodd Phillip's R-rated comic-book hit regained the top spot at the weekend box office in its fourth week of release, narrowly besting \"Maleficent: Mistress of Evil.\" The sensation starring Joaquin Phoenix took in $18.9 million in ticket sales over the weekend, according to studio estimates Sunday.\n\nThat came in just above the $18.5 million haul for Disney's \"Maleficent\" sequel, which slid to second after a disappointing No. 1 debut last weekend of $36 million. \"Mistress of Evil,\" starring Angelina Jolie, is performing better overseas, where it grossed $64.3 million for the weekend.\n\nWith such a close race at the top between \"Joker\" and \"Mistress of Evil,\" the order could switch when final figures are released Monday.\n\nBut ticket sales have continued to surge well past expectations for \"Joker.\" With a modest budget of $60 million, it's been extraordinarily profitable.\n\nHow accurate is 'Joker's portral of mental illness? The answer is complicated\n\nSpoilers! Why Michelle Pfeiffer is a GOAT villain in her 'Maleficent' showdown with Angelina Jolie\n\nThis week, \"Joker\" became the most successful R-rated movie ever, not accounting for inflation, in worldwide release. It's made $849 million globally, including $47.8 million internationally over the weekend. (Mel Gibson's \"The Passion of the Christ\" remains the R-rated domestic leader, with $370.8 million.)\n\nDespite mixed reviews, \"Joker,\" a \"Taxi Driver\"-styled spin on a comic-book origin story, has already amassed a box-office total exceeding that of more mainstream superhero movies such as \"Thor: Ragnarok\" and \"Wonder Woman.\"\n\nNo new releases mustered any competition with the holdovers. The best-performing newcomer was the horror thriller \"Countdown,\" which finished fifth and grossed $9 million. \"Black and Blue,\" a police thriller starring Naomie Harris, opened with $8.3 million.\n\nHolding especially well was \"The Addams Family,\" the Halloween-timed animated reboot of the macabre family. It slid just 28% in its second weekend with $11.7 million, good for third place.\n\nRounding out the top five: \"Zombieland: Double Tap,\" the Emma Stone and Woody Harrelson sequel, which finished fourth with $11.6 million.\n\n'The Addams Family' dream team: Who's the best Gomez or Morticia? We pick our all-time faves\n\nNo, Robert Pattinson didn't get drunk filiming 'Lighthouse': But 'I ate quite a lot of mud'\n\nMuch of the weekend's action was in limited or expanding releases for acclaimed Oscar contenders.\n\nRobert Eggers' \"The Lighthouse,\" a black-and-white psychological drama starring Willem Dafoe and Robert Pattinson as 19th century lighthouse keepers, made $3 million on just 586 screens.\n\nTaika Waititi's \"Jojo Rabbit,\" about a 10-year-old boy growing up in Nazi Germany, expanded into 55 theaters, earning a strong $1 million. In September, the movie won Toronto Film Festival's highly predictive audience award, setting it up as a potential Academy Awards favorite. Its initial expansion suggests it will be a hit with audiences, too.\n\nLess successful was the Bruce Springsteen concert film \"Western Stars\" ($560,000 in 537 theaters).\n\nAlfonso Gomez-Rejon's \"The Current War\" also finally landed in theaters more than two years after it first premiered. Gomez-Rejon recut his film after Harvey Weinstein pushed out a critically panned version of the Thomas Edison (Benedict Cumberbatch) and George Westinghouse (Michael Shannon) tale shortly before his downfall. Gomez-Rejon's director's cut opened with $2.7 million from about 1,000 theaters.\n\n\"Terminator: Dark Fate,\" which is expected to lead the box office next weekend, got off to a $12.8 million start in a handful of international markets before its stateside debut.\n\nFinal numbers are expected Monday.\n\nContributing: Kim Willis, USA TODAY\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/movies/2019/10/27/joker-vs-maleficent-joaquin-phoenix-wins-box-office-supervillain-rematch/2479448001/", "description": "'Maleficent: Mistress of Evil' could ultimately prevail at the pre-Halloween box office. But right now, it looks like 'Joker' is back at No. 1.", "authors": ["Jake Coyle", "The Associated Press", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/01/USAT/eb318f4d-6d6d-43d3-aee6-874f8bb96587-rev-1-JOK-04625r_High_Res_JPEG.jpeg?crop=5999,3375,x0,y305&width=3200&height=1680&fit=bounds", "published_at": "2019-10-27"}