{"pub": "indiatimes", "url": "https://indiatimes.com/news/world/us-president-donald-trump-hid-behind-a-tapestry-to-grope-a-woman-says-explosive-new-book-377526.html", "downloaded_at": "2019-10-10 15:18:58.811126+00:00", "title": "US President Donald Trump Hid Behind A Tapestry To Grope A Woman, Says Explosive New Book", "language": "en", "text": "As per a book excerpt, a new accusation of sexual assault against United States President Donald Trump has surfaced.\n\nThe excerpt is part of Barry Levine and Monique El-Faizy’s forthcoming book “All the President’s Women: Donald Trump and the Making of a Predator,” and contains an account from a woman named Karen Johnson.\n\nShe says in the book that Trump groped her and forcibly kissed her at a Mar-a-Lago New Year’s Eve party in the early 2000s.\n\nMar-a-Lago is a resort and national historic landmark in Palm Beach, Florida.\n\nJohnson alleges that she was at Mar-a-Lago with her husband and another relative when Trump grabbed her, pulled her behind a tapestry, and assaulted her.\n\nDon't Miss 14.9 K SHARES 3.1 K SHARES 8.3 K SHARES 2.3 K SHARES\n\nHere are portions of the book that are grabbing eyeballs:\n\nShortly after glittering balloons fell from the ceiling at the stroke of midnight, her husband said he wasn’t feeling well and the relative was ready to go. Johnson decided to make a quick trip to the restroom before they headed home. “I hadn’t seen [Trump] that whole entire night,” said Johnson, who was in her late thirties at the time. “I was just walking to the bathroom. I was grabbed and pulled behind a tapestry, and it was him. And I’m a tall girl and I had six-inch heels on, and I still remember looking up at him. And he’s strong, and he just kissed me,” she recounted to us. “I was so scared because of who he was. ... I don’t even know where it came from. I didn’t have a say in the matter.”\n\nJohnson said Trump then grabbed her and said: “You have to help me greet these guests out”.\n\nHe reportedly explained that Melania was upstairs.\n\n“So I stood next to him while he greeted some guests out the door,” Johnson said. She says she did not show her uncomfort as she didn’t want to create an awkward situation.\n\n“I was afraid to say what had happened,” she said. “I didn’t even know how it happened.”\n\nJohnson is at least the 23rd woman to come forward with an on-record account of sexual misconduct allegedly committed by Trump. Many of those women came forward following the October 2016 release of the Access Hollywood hot mic tape in which Trump was recorded bragging about groping women and kissing them without their consent.\n\n“When he says that thing, ‘Grab them in the pussy,’ that hits me hard because when he grabbed me and pulled me into the tapestry, that’s where he grabbed me.\"\n\nThe excerpt notes that Johnson’s account of the evening is corroborated by “documentation and photographs,” as well as by a friend who Johnson told about the assault years before Trump ran for president. Johnson is at least the fourth woman to accuse Trump of sexual assault at Mar-a-Lago, following Jill Hearth, Cathy Heller, and Natasha Stoynoff.\n\nTrump has repeatedly denied all of the accusations against him that have previously surfaced.", "description": "The excerpt notes that Johnson’s account of the evening is corroborated by “documentation and photographs,” as well as by a friend who Johnson told about the assault years before Trump ran for president. Johnson is at least the fourth woman to accuse Trump of sexual assault at Mar-a-Lago, following Jill Hearth, Cathy Heller, and Natasha Stoynoff.", "authors": ["Saket Suman"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/donald_trump_1570700250_800x420.jpg", "published_at": "2019-10-10"}