{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7560523/JACK-DOYLE-assesses-really-happened-Boris-Johnsons-meeting-Leo-Varadkar.html", "downloaded_at": "2019-10-11 00:25:37.942742+00:00", "title": "JACK DOYLE assesses what really happened at Boris Johnson's meeting with Leo Varadkar", "language": "en", "text": "brexit countdown_bg Created with Sketch.\n\nThornton Manor is an unlikely venue for a major diplomatic breakthrough on Brexit.\n\nOnce home to soap magnate William Lever of Lever Brothers fame, the Grade II listed 19th Century manor house on the Wirral in Merseyside is now a favourite spot for corporate events and the celebrations of the north-west glitterati.\n\nCoronation Street stars hold their weddings there, and England footballer Mark Wright married his wife Sue in a marquee by the lake in the grounds.\n\nIn 2007, the girl who would become Queen of the Wags Coleen McLoughlin – she was engaged to Wayne Rooney at the time – ordered a mini funfair to celebrate her 21st there.\n\nFootballers and celebrities were greeted by stilt walkers dressed as swans, jugglers in sailor suits and other circus-style entertainments.\n\nAnd yesterday it was the turn of Boris Johnson and Irish Taoiseach Leo Varadkar to continue the theme with a daring tightrope walk – political and diplomatic – at Thornton Manor.\n\nWhen, on Wednesday night, No.10 announced talks between the two were taking place, few in Westminster had much hope of any significant movement from either side – certainly I had mentally all but written off the chances of any agreement. Downing Street insiders say the venue was chosen for privacy reasons. Out of the way and easy to secure – and to keep out pesky journalists – it was also seen as neutral territory.\n\nIf the talks had been in either Dublin or London, whichever leader made the journey across the Irish Sea would have looked like they were the ones giving ground.\n\nBoris Johnson and Leo Varadkar met for talks at Thornton Manor near Liverpool on Thursday as they tried to put the UK and EU on a path towards a Brexit deal\n\nWhen Mr Varadkar (pictured with Mr Johnson at Thornton Manor Hotel on Thursday) spoke to reporters at Liverpool’s John Lennon Airport before his flight home he was unquestionably upbeat: the meeting was ‘very positive and very promising,’ he said\n\nOnce home to soap magnate William Lever of Lever Brothers fame, the Grade II listed 19th Century manor house (pictured, Thornton Manor) on the Wirral in Merseyside is now a favourite spot for corporate events and the celebrations of the north-west glitterati\n\nThe day began with the team from No.10 in place at 11.15am in good time to meet the Irish leader, who arrived around 45 minutes later. At the Prime Minister’s side were Dominic Cummings, his chief advisor and strategist, and Sir Mark Sedwill, the Cabinet Secretary, as well as his Brexit ‘Sherpa’ David Frost, the man who has been heading up negotiations in Brussels these past weeks.\n\nBut despite the illustrious cast, the main event was conducted one-on-one between the two premiers. All civil servants and political advisors were banished.\n\nThere was not even a note-taker in the room. With their teams waiting anxiously outside, the two men sat in lounge chairs in a wood-panelled room and talked. An hour passed. Their private discussion went on so long that eventually their retinues gave up waiting for their bosses and tucked in to a ‘wedding-style’ buffet lunch of pasta, salad and sandwiches.\n\nTory rebels 'planning a new political group' Three former Conservative Cabinet members are planning to start a new political group ahead of the next election, it was reported yesterday. Amber Rudd, Philip Hammond and David Gauke are said to be forming a party in all but name with a united Brexit position. If Boris Johnson pursues a No Deal Brexit manifesto at the next election, more Tory MPs would be expected to join, according to website Buzzfeed. The three are said to be holding talks with about ten rebel MPs who lost the Tory whip last month. Several members of the grouping, including Miss Rudd, are inclined to endorse a second referendum. An MP involved in the talks told Buzzfeed the group would prefer to have the Tory whip reinstated and to run as Conservatives in the next election. Former chancellor Mr Hammond added: ‘My preference is to run as a Tory candidate, but if I am not able to, I plan to stand as an independent... I would look to co-operate with any other ex-Tories standing in similar circumstances.’ The group does not plan to have a leader or manifesto, it was reported.\n\nEventually, some 90 minutes later, the two men emerged and invited aides into the room. It took another 90 minutes before a detailed record of what they had agreed was completed.\n\nOnly then did Boris and Leo have their lunch, before taking a gentle walk around the grounds, while officials hammered out a joint statement which was released simultaneously by both sides.\n\nAnd it could hardly have been more positive. ‘We see a pathway to a deal’, they said.\n\nAnd when Mr Varadkar spoke to reporters at Liverpool’s John Lennon Airport before his flight home he was unquestionably upbeat: the meeting was ‘very positive and very promising,’ he said.\n\nFor keen observers of the Brexit dance, the Irish premier’s body language with Mr Johnson – in pictures released later – was notably relaxed, friendly even. Much more so than when our Prime Minister travelled to Dublin just four weeks ago, and the two men held an awkward press conference.\n\nCrucially, Mr Varadkar said yesterday that it was possible not just for a deal to be done, but to be done in time for the end of October – although he added ‘there’s many a slip between cup and lip and lots of things that are not in my control’.\n\nYet it was only 48 hours earlier, on Monday night, that any hopes of a deal appeared dead in the water when a Downing Street official (presumed to be Cummings) told the Spectator magazine that Leo Varadkar ‘doesn’t want to negotiate’.\n\nThe source accused him of going back on a commitment to offer a compromise if the UK moved – which Mr Johnson duly did, when he agreed to Northern Irish membership of the single market. It also accused Mr Varadkar of failing to understand that if the deal was rejected now it would not be revived, and if Mr Johnson won an election he would get the UK out ‘immediately’.\n\nAfter Mr Johnson’s testy telephone exchange with German Chancellor Angela Merkel on Tuesday morning which seemed to rule out any prospect of a deal, there was even more fury from Downing Street.\n\nDowning Street and Mr Johnson were tight-lipped after the meeting but he and Mr Varadkar said in a joint statement that they believed there was now a 'pathway' to a deal\n\nWas it this turn of events that created what one No.10 source last night called the ‘sense of jeopardy’ in Dublin that might force the Taoiseach and his government to make their own concession? No Deal, after all, would be catastrophic for the Irish economy, and could mean the end of Mr Varadkar’s political career.\n\nPerhaps. But one senior government source has a different theory: this week was the ‘pantomime’ that proved to the home audiences of both sides that they had fought to the last to eke out a deal.\n\nThis may be a conspiracy too far. What is true is that the dynamic has changed dramatically in a short space of time, and there is now momentum towards a deal.\n\nPound soars over hope of Brexit breakthrough The pound soared against the dollar and the euro last night amid hopes Boris Johnson can strike a Brexit deal. On a dramatic day on the currency markets, sterling rose more than 2 per cent against the dollar towards $1.25 and nearly 2 per cent against the single currency to highs above €1.13. The rally came after Mr Johnson and his Irish counterpart Leo Varadkar indicated they could ‘see a pathway to a possible deal’ following crunch talks in the Wirral yesterday. The pound has swung wildly since Britain voted to leave the EU in June 2016, rising when it appeared a deal was possible and falling if it looked like a disorderly exit was on the cards. Analysts warned sterling could give up its gains if hopes of a deal fade in the coming days. Despite last night’s jump, the pound is still down more than 16 per cent against the dollar and around 14 per cent against the euro since the referendum. Sterling was also boosted by Office for National Statistics figures which suggested the UK has avoided a recession. Yael Selfin, chief economist at KPMG, called recession fears ‘premature’.\n\nLast night both Mr Frost and Brexit Secretary Stephen Barclay hot-footed it to Brussels to talk tactics with the UK’s EU ambassador Sir Tim Barrow ahead of a 9am breakfast today with EU chief negotiator Michel Barnier. Officials on both sides are expected to enter the secretive ‘tunnel’ of private talks by the end of the week. The outstanding question is what was written in that note of the lengthy private talks between Johnson and Varadkar?\n\nWhat does the outline of a compromise look like on the two major outstanding issues: consent and customs?\n\nThe first is some form of democratic oversight for Northern Ireland, and the latter the thorny issue of the customs arrangements that keep the Irish border open while the UK leaves the EU’s customs union intact.\n\nIf Mr Johnson cannot satisfy the DUP on both, the chances of an agreement passing the Commons are practically zero.\n\nBut if he has them on side, he will win over the vast majority of the Brexit hardliners in the European Research Group who killed off Mrs May’s Withdrawal Deal. Assuming that most of the 21 Tory MPs stripped of the whip also fall in line, Mr Johnson will need only a handful of Labour MPs to get a deal through the Commons.\n\nThis week, 19 Labour backbenchers signed a letter saying they would back an agreement. Earlier this week, most observers in Brussels and Westminster put the percentage chances of a deal in the single digits.\n\nBut even the most pessimistic pundit would have to say that an agreement now feels like an evens shot. And we’ll know soon enough. The EU Council Summit is next Thursday – the real deadline for a deal.\n\nMr Johnson once described himself as the Incredible Hulk, breaking out of the chains wrapped around him by the law passed by MPs which would force him to delay, something he has said he will not do ‘come what may, do or die’. If he manages to get a deal and pass it by the end of the month, it would be an escape act more worthy of Houdini himself.", "description": "Thornton Manor on the Wirral in Merseyside is an unlikely venue for a major diplomatic breakthrough on Brexit. Coronation Street stars hold their weddings there.", "authors": ["Jack Doyle For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/21/19557138-0-image-a-70_1570739043855.jpg", "published_at": "2019-10-10"}