{"pub": "guardian", "url": "https://theguardian.com/tv-and-radio/2019/oct/02/no-need-to-watch-the-apprentice-we-are-living-it-now", "downloaded_at": "2019-10-02 12:48:01.428339+00:00", "published_at": "2019-10-02", "title": "There’s no need to watch The Apprentice. We are living it now", "language": "en", "text": "Here’s a fun quiz: who is your favourite Apprentice candidate this year? Is it Dean, the sports agent who brags about having “the gift of the gab”? Is it Bryonn, the recruitment consultant who calls himself the Tank because he “destroys problems on any terrain”? Or what about Sophie, the account manager who said: “If B is for business, then I’m queen of the hive”?\n\nSpoiler: it’s none of them. That’s partly because I made the last two up, and partly because nobody in their right mind is excited about The Apprentice any more.\n\nSure, I’ve tutted at The Apprentice for having the temerity to still exist before. But this time I can feel it. There’s something in the air. The Apprentice is now fully out of puff.\n\nThe new series – the 15th – starts tonight, farted out unheralded on to a schedule that deserves better. And unless things take a record-breakingly enormous turn, it’s going to be the least auspicious series yet.\n\nThe reasons are easy to pinpoint. The show is long in the tooth, and has been for at least half a decade. This has had a clear knock-on effect on the quality of the contestants. Take the youngest member of this year’s intake. He is Ryan-Mark, a “luxury womenswear consultant” who cites the Queen as his role model and calls himself “the epitome of luxury”. Ryan-Mark is 19 years old. The Apprentice has been on since he was four. He has grown up with it. It has been part of the fabric of his life from the moment he gained the ability to make memories. He has seen how it is less a showcase for genuine business aptitude, and more a glorified fishbowl where the public gets to jeer at pillocks for an hour a week. He knows this, and he still signed up. I’ve never met Ryan-Mark, so this isn’t rooted in fact, but I suspect that – since he knowingly signed up for this, despite everything – he might be a nitwit.\n\nBut the problems go so much deeper this year. There is Alan Sugar, who is starting to look like a honking great liability for the BBC. His Twitter feed is an absolute minefield that, when it isn’t just a random jumble of spaces, misspellings and errant punctuation, takes a hammer to the notion of impartiality. Just last week he reacted to Paula Sherriff’s emotional address in the House of Commons by calling her a “ranting woman” who reminded him of “an insane person”. In a week when Naga Munchetty has been hauled across the coals for correctly being able to identify racism, his lazy boorishness looks even more abject than usual. It is starting to look as if double standards might be at play, which is the last thing the corporation needs right now.\n\nMainly, though, there is the gaping hole where public enthusiasm used to be. Usually, when the BBC tweets out the candidate profiles each year, it dominates the news for a day or two as fans play Top Trumps with their silly hair and awful personalities. This year, it didn’t muster even a peep. This might be down to timing, because it happened at the exact moment when Lady Hale was gracefully dismantling Boris Johnson’s plans, but there is a bigger reason for it too.\n\nWhat, really, is the point of The Apprentice in 2019? Is it for the bearbaiting spectacle of watching a load of big-tied dumbos trying to force through their terrible ideas with a truckload of unearned confidence? Because we’ve got BBC Parliament for that now. Is it to give airtime to some of the most aggressively awful people in the country? Because that is the role Question Time now serves. Is it so we can watch business after business crater in the face of incompetence? Because surely that’s why people voted for Brexit.\n\nThe ugly, swaggering, craven ineptitude of The Apprentice feels totally redundant in 2019, because it has been absorbed into society. It is all around us, and there is no hiding place. We don’t need to watch The Apprentice any more. We’re living it.", "description": "Aggressively awful people trying to force through their terrible ideas? There’s no hiding from it: our society has been hellishly Alan Sugared", "authors": ["Stuart Heritage"], "top_image": "https://i.guim.co.uk/img/media/729f8d0f71d8326c70178c345b1cbbdf825aa0da/0_121_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f382d290155f47625b6ed998bc32f92d"}