{"pub": "nymag", "url": "https://nymag.com/strategist/article/best-wooden-toys-for-kids-and-babies.html", "downloaded_at": "2019-09-12 07:11:10.081265+00:00", "title": "24 Wooden Toys for Babies, Toddlers, and Kids", "language": "en", "text": "24 items in this article 3 items on sale! Photo: Courtesy of the retailers\n\nWooden toys, in contrast to their plastic counterparts, last longer and biodegrade faster. They’re also generally less flashy, making them popular among parents with more minimalist taste who’d rather not have their home overrun with stuff that looks like this. In fact, a lot of wooden toys can pass for Danish design objects (and wouldn’t look out of place next to a succulent atop a mantle) when not in the hands of a toddler. And because of their long history in the world (the first written reference to a wooden toy dates back to 500 BC) and their popularity in Montessori and Waldorf classrooms, they exude a comforting folksiness and proximity to the natural world. Take it from me, a former Waldorf-school teacher and current Strat reporter who’s spent hours in conversation with child-development experts, toy-trend forecasters, and stylish parents: Wooden toys will not only make your home more stylish, they’ll foster curiosity, creativity, hand-eye coordination, and so much more in your child.\n\nTo further guide you, we scoured the internet for the cream of the crop and curated a list of the best wooden toys we could find, including wooden toys for teething babies, ones for toddlers working on their fine motor skills, toys that encourage pretend play, and even some STEM toys made out of wood.\n\nWooden toys for babies\n\nHomi Baby Organic Wood Montessori Styled Baby Rattle The Homi organic wooden rattle is made in the U.S. and painted with environmentally friendly, nontoxic milk paint before being sealed with organic virgin coconut oil. So it’s safe for teething babies and even your pets. $14 at Amazon Buy $14 at Amazon Buy\n\nManhattan Toy Artful Skwish Rattle and Teether Grasping Toy $15 (was $17, now 12% off) Squishy rattles, like this one from Manhattan Toy, are great for developing a baby’s gross motor skills. This rattle is made using sustainable wood and nontoxic finish. $15 at Amazon Buy $15 at Amazon Buy\n\nWooden toys for toddlers\n\nCoogam Wooden Lacing Apple Threading Toy Lacing toys like this wooden apple and worm challenge a toddler’s fine motor skills and can keep children busy for long periods of time — a godsend on car rides, airplanes, or grocery-store lines. $9 at Amazon Buy $9 at Amazon Buy\n\nQTHINGS Masterkidz Tactile Beeping BEE Toys that make noise or play music are typically bigger hits with toddlers. This chubby wooden bee on wheels makes beeping sounds when kids press down on its back. It’s made with wood from responsibly managed forests and nontoxic paint. It’s also great for fine motor skills and encouraging memory through cause and effect. $19 at Amazon Buy $19 at Amazon Buy\n\nPlanToys Plan Preschool Bee Hive Preschool $23 (was $25, now 8% off) Speaking of bees, toddlers will enjoy the challenge of using these wooden tongs to remove wooden bees and put them back in their hive. Matching the bees to their hives also helps toddlers work on color recognition. $23 at Amazon Buy $23 at Amazon Buy\n\nBabe Rock Toys Wooden Ducks Pull Toy Pull toys are extra fun for toddlers who can walk. And this baby and mama duck encourage talking about family and putting things inside other things — two favorite toddler pastimes. $20 at Amazon Buy $20 at Amazon Buy\n\nPlan Toy Solid Wood Drum Toddlers love musical toys and this wooden drum has a pleasant sound and allows toddlers to experiment and find different notes. $23 at Amazon Buy $23 at Amazon Buy\n\nWooden toys for pretend play\n\nMiO Food Truck Vehicle + 1 Bean Bag Person Peg Doll This little wooden food truck and doll encourages imaginative play and comes with a wooden refrigerator, stove, and four wooden pizza discs. $24 at Amazon Buy $24 at Amazon Buy\n\nCARLORBO Wooden Toys for 2 Year Old - Pretend Play Food Each wooden apple, pomegranate, lime, banana, and avocado in this set is realistically painted with eco-friendly paint and can be cut in half for serving using a wooden knife and then put back together with magnets. $20 at Amazon Buy $20 at Amazon Buy\n\nMelissa & Doug Service Station Parking Garage $26 (was $30, now 13% off) Melissa & Doug are known for making high quality toys that encourage child development. This garage and service station is no different and offers tons of scenarios to stretch children’s imaginations. $26 at Amazon Buy $26 at Amazon Buy\n\nNaKita Kids Wooden Assorted Construction Vehicles and Traffic Trucks If you’re looking for more cars to park in the garage, here’s a sweet set of utility vehicles to add to the party. $26 at Amazon Buy $26 at Amazon Buy\n\nHuzi - Cosmos - Timeless Design Spaceship Building Blocks For the true minimalist, this black and white wooden spaceship would look nice on any bookshelf and can be assembled in several different configurations before being “shot” into space. $25 at Amazon Buy $25 at Amazon Buy\n\nLeo and Friends Wooden Puzzles - Face Emotion Toys for Kids Like a flat, wooden Mr. Potato Head, this facial expression and mood puzzle helps children with social-emotional development and encourages healthy communication around moods and feelings. $11 at Amazon Buy $11 at Amazon Buy\n\nMelissa & Doug Fold & Go Dollhouse $53 (was $60, now 12% off) Melissa & Doug’s two-story wooden dollhouse has a handle and folds up for easy carrying. It was included in our article about the best dollhouses on Amazon. $53 at Amazon Buy $53 at Amazon Buy\n\nWooden toys for stacking and balancing\n\naGreatLife Wooden Balancing Cactus Toy for Kids and Toddlers The aGreatLife cactus game is a fun way for kids and adults to play together. Even the packaging, which is made of cardboard and a muslin bag, is eco-friendly. $15 at Amazon Buy $15 at Amazon Buy\n\nGrimm's Small Stone Caves Nesting Wooden Blocks Stacker We featured this a similar colorful Waldorf stacking toy in our gift guide for one-year-olds. These beautifully crafted toys are interactive and encourage babies and toddlers to experiment with building and gravity. $26 at Amazon Buy $26 at Amazon Buy\n\nHAN-MM Wooden Wobble Balance - Rocker Board 35 Inch Kid Size For older children, this simple curved wooden balance board can be used in myriad ways: as a car track, a balance beam, a bridge, a table, or a step stool. It pushes children’s creativity and increases muscle strength. $70 at Amazon Buy $70 at Amazon Buy\n\nWooden STEM toys\n\n43 PCs Kids Tool Box Wooden Construction Set A comprehensive set of wooden tools, screws, and nails for kids who love to build things and take things apart. $24 at Amazon Buy $24 at Amazon Buy\n\n26 Piece Tegu Discovery Magnetic Wooden Block Set, Natural $55 (was $75, now 27% off) Tegu’s set of magnetic wooden blocks comes recommended by the child-development experts we spoke to for our gift guide for one-year-olds, but would make a great gift for kids of all ages. $55 at Amazon Buy $55 at Amazon Buy\n\nROBOTIME Walking Trex Dinosaur 3D Wooden Craft Kit Puzzle For older kids who like building 3-D models, this wooden T. rex will provide hours of entertainment. $26 at Amazon Buy $26 at Amazon Buy\n\nGrimm's Handcrafted Wooden Rainbow Bell Tower $146 (was $160, now 9% off) You’ll catch toddlers attention with this rainbow bell tower while older children can make a project of assembling it. $146 at Amazon Buy $146 at Amazon Buy\n\nAnd a mostly wooden toy piano\n\nBaby Einstein Magic Touch Wooden Piano Though it’s not only made of wood, Baby Einstein’s Magic Touch Piano has made it on the Strategist best sellers top ten list seven times — that’s a lot. It comes recommended by child-development expert Dr. Sarah Roseberry Lytle who says it’s a good pick because “young kids love making music and exploring things, like, Can I make it softer? Can I make it louder? What happens when I hit it harder? That’s a really interesting learning process.” If it’s between this and a junkier-looking toy that makes louder, more aggressive sounds, we’d go with this wood-plastic hybrid toy piano. $25 at Amazon Buy $25 at Buy Buy Baby Buy\n\nget the strategist newsletter Actually good deals, smart shopping advice, and exclusive discounts. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\n\nThe Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.", "description": "We scoured the internet to bring you a curated list of the 24 best wooden toys for babies, toddlers, and kids including Homi Baby Organic Wood Montessori Styled Baby Rattle and Manhattan Toy Artful Skwish Rattle and Teether Grasping Toy.", "authors": ["Liza Corsillo"], "top_image": "https://pixel.nymag.com/imgs/daily/strategist/2019/09/10/wooden-toys/10-painless-shopping.w1200.h630.jpg", "published_at": "2019-09-11"}