{"pub": "huffpost", "url": "https://huffpost.com/entry/andrew-yang-democracy-dollars-twitter-reaction_n_5d7b3ee1e4b00d6905962d94", "downloaded_at": "2019-09-13 09:14:18.812687+00:00", "title": "Tweeters' Reaction To Andrew Yang's 'Democracy Dollars' Idea Is So On The Money", "language": "en", "text": "Democratic presidential candidate Andrew Yang re-floated his idea of “democracy dollars” during Thursday’s debate, and Twitter users’ responses were so money.\n\nThe entrepreneur suggested the way to reform campaign finance laws was to wash lobbyist cash out of the process “with people-powered money.”\n\n“My proposal is that we give every American 100 democracy dollars that you can only give to candidates and causes that you like,” he explained.\n\nYang’s plan (similar to one proposed by Sen. Kirsten Gillibrand (D-N.Y.), who dropped out of the 2020 race in August) provided plenty of comic fodder for people online:\n\nHow many Democracy Dollars equal a Shrute buck? — Chris Cillizza (@CillizzaCNN) September 13, 2019\n\nThis is what I hear when Andrew Yang talks about \"Democracy Dollars\" pic.twitter.com/FgRIgmnI5a — Kyle Ayers (@kyleayers) September 13, 2019\n\nGonna go to the strip club and throw some Democracy Dollars around.#DemDebate — Charlotte Clymer🏳️‍🌈 (@cmclymer) September 13, 2019\n\nGive me Democracy Dollars. I will spend them at Olive Garden. — Emily Jashinsky (@emilyjashinsky) September 13, 2019\n\nGimme all the democracy dollars!! pic.twitter.com/ZS1Z74lUXQ — Emily Colucci (@emilycolucci) September 13, 2019\n\nGood night. Everyone remember to stuff their mattress with Democracy Dollars. — Daniel W. Drezner (@dandrezner) September 13, 2019\n\nWhat is the conversion rate of Democracy Dollars to Shrute Bucks?#DemDebate — Charlotte Clymer🏳️‍🌈 (@cmclymer) September 13, 2019\n\nthis but democracy dollars pic.twitter.com/r9TyopFXfD — Samit Sarkar (@SamitSarkar) September 13, 2019\n\nWhoa, I already got my Democracy Dollars! pic.twitter.com/YXcKU5UJ0X — Frank Luntz (@FrankLuntz) September 13, 2019\n\nDispatch from future me in the year 2024: \"Well, once again, I'm very sad to say, I spent all of my Democracy Dollars on shots of Jägermeister at the battle of the bands.\" https://t.co/EQ1fzQFlfB — Ryan H. Walsh (@JahHills) September 13, 2019\n\nWhat’s the ratio of Democracy Dollars to Schrute Bucks? pic.twitter.com/x9HSWjQQDZ — James C. Morrison (@JCMorrisn) September 13, 2019\n\nMarianne Williamson holds her cup of warm oat milk up and toasts her 1999 Mitsubishi rear-projection TV. “Democracy Dollars? I like the sound of that.” — bobby finger (@bobbyfinger) September 13, 2019\n\noh now yang speaks out in favor of democracy dollars. i dropped them in level two so i could make room for medkits. this inventory system is broken — Jon Bois (@jon_bois) September 13, 2019\n\nYang unveiling his Democracy Dollars pic.twitter.com/dHRNx5lFzp — Joe Colangelo (@Itsjoeco) September 13, 2019\n\nYang's \"Democracy Dollars\" have the same monetary value as Chuck E. Cheese's tokens. #DemDebate — Ford O'Connell (@FordOConnell) September 13, 2019", "description": "\"What’s the ratio of Democracy Dollars to Schrute Bucks?\"", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d7b481924000012277931eb.jpeg?cache=cqsw6ukfh9&ops=1778_1000", "published_at": "2019-09-13"}