{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7582001/Thomas-Rhett-tenderly-places-hand-wife-Laurens-bump-CMT-Artist-Year-Awards.html", "downloaded_at": "2019-10-17 01:52:46.988475+00:00", "title": "Thomas Rhett tenderly places his hand on wife Lauren's bump at CMT Artist Of The Year Awards", "language": "en", "text": "Thomas Rhett enjoyed a glamorous date night with his wife in Nashville on Wednesday.\n\nWhile the country crooner, 29, put on a dapper display, Lauren Akins, 29, wore a chic black lace dress.\n\nOn display at the CMT Artist of the Year awards was his wife's growing baby bump.\n\nDate night: Thomas Rhett and his wife Lauren Atkins hit the red carpet Wednesday night at the CMT awards, as Lauren showed off her baby bump\n\nThe Marry Me singer wore a brown suit with a dark shirt, partly unbuttoned at the top, underneath.\n\nHe paired it with a pair of brown shoes, slightly worn at the toe.\n\nKnown for his scruffy look, he stayed true to it, with a full beard and a curly hairdo.\n\nThomas and Lauren placed their hands on her stomach in photos, showing off her bump.\n\nHer look: Thomas and Lauren placed their hands on her stomach in photos, showing off her bump. She looked chic in the black lace mini dress that she teamed with strappy black stilettos\n\nHis look: The Marry Me singer wore a maroon suit with a dark shirt, partly unbuttoned at the top, underneath\n\nShe looked chic in the black lace mini dress that she teamed with strappy black stilettos\n\nHer dress had sheer sleeves and chest, with black polka dot designs and lace details.\n\nThey announced they are expecting their third child, a girl, back in July.\n\nThe new baby will join Willa Grey, three, who they adopted from Uganda in 2017, and Ada James, two, who they welcomed later that year.\n\nMore family: The new baby will join Willa Grey, three, who they adopted from Uganda in 2017, and Ada James, two, who they welcomed later that year\n\nHappy Anniversary: Country music star Thomas Rhett celebrated his seven year wedding anniversary with wife Lauren Akins on Saturday\n\nThe couple recently celebrated their seventh wedding anniversary earlier this month. They married in 2012 after being friends since second grade.\n\n'I can’t believe the Lord has blessed me with 7 amazing years of marriage with @lauren_akins,' Rhett began, in the caption of an Instagram photo where they're both fly fishing.\n\nAkins added her own sentiments in an Instagram post of her own, along with a photo from their joyous wedding.\n\n'Happy wedding anniversary 7 years ago tonight honey,' Akins began, adding a gold heart emoji.\n\n'You are better than my best dream and so is our life with our precious babies,' she added, referring to their daughters Willa Grey and Ada James.\n\n'I’m so thankful God gave me you:) can’t wait for the next 70 babe y+m I love you Thomas Rhett,' she concluded.", "description": "Thomas Rhett got a date night with his wife  on Wednesday night. While the country crooner put on a dapper display, Lauren Akins wore a chic black lace dress.", "authors": ["Kellie Chudzinski For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/01/19815136-0-image-a-54_1571271924052.jpg", "published_at": "2019-10-17"}