{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/beware-alphabeticity-bias-when-picking-investments", "downloaded_at": "2019-10-24 09:49:50.740602+00:00", "title": "Beware 'Alphabeticity Bias' When Picking Investments", "language": "en", "text": "You already know that many of your financial decisions aren’t made rationally: Recency bias, sunk-cost fallacy and mental accounting all play major roles in how we spend, save and think about our money. But you also need to be aware of bias when you’re picking investments.\n\nThe report finds that the order in which investment funds are listed (typically in alphabetical order) “significantly biases participants’ investment allocation decisions.” The bias is more pronounced when there are a larger number of fund options, but it’s also present when there are “relatively few” funds available.\n\nAccording to the report, the options listed first are chosen more often because of two psychological processes working in tandem: status quo bias and satisficing.\n\nStatus quo bias comes into play because, though investors might be able to reorder their investment options, they typically don’t, and “rely on the default list, which is in alphabetical order. Then, they stop looking through funds when they find the first “acceptable” option, regardless of how many options are left to go through, otherwise known as satisficing.\n\n“Thus, when a participant searches through her plan’s menu of investment options, she may be more likely to choose the funds appearing towards the beginning of the list,” reads the report. “Since... fund choices with early alphabet names appear at the beginning of the list, they will be chosen more often than later alphabet named funds.”\n\nThis bias is common in any number of decisions, notes Humble Dollar’s Adam Grossman, financial and otherwise. But when it comes to your retirement savings, you could be forfeiting thousands of dollars. Writes Grossman:\n\nTwo companies with expensive funds — American Funds and American Century — land at the top of most lists [in the U.S.], while low-cost leader Vanguard Group usually falls near the bottom.﻿\n\nWhen selecting funds for your portfolio, keep in mind cost, fees, diversification and performance, among other factors. Most importantly, order the options given to you by expense ratio. That could help you make a better investment decision.", "description": "You already know that many of your financial decisions aren’t made rationally: Recency bias, sunk-cost fallacy and mental accounting all play major roles in how we spend, save and think about our money. But you also need to be aware of bias when you’re picking investments....", "authors": ["Lifehacker Staff", "John Long"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/vxy8bl1hkdadcmifcetd.jpg", "published_at": "2019-10-24"}