{"pub": "fox", "url": "https://foxbusiness.com/business-leaders/study-predicts-streaming-will-outpace-pay-tv-in-five-years", "downloaded_at": "2019-09-19 23:49:38.600941+00:00", "title": "60M TV viewers will cut the cord within five years, study predicts", "language": "en", "text": "Television viewing has gradually expanded into streaming, and a new study from Roku makes a dramatic prediction about how people will consume video in the years to come.\n\nApproximately 60 million television households are expected to access video on their TV exclusively through streaming within the next five years. If this study holds, it would mean that, for the first time, streamers will surpass traditional Pay TV viewers.\n\nContinue Reading Below\n\n“I think it’s accurate, certainly for younger age groups, which advertisers are more interested in,” said media consultant Brad Adgate. “I think it really comes down to how older demographics are going to adapt to streaming video.”\n\nOverall U.S. market data suggests 2 million Americans have ‘cut the cord’ so far in 2019, moving from traditional Pay TV, which includes cable or satellite television subscriptions. This comes after 3.5 million people gave up their traditional Pay TV video subscriptions in 2018.\n\nConsumers who are already streaming include cord-cutters, television households that previously had Pay TV; cord-shavers who may pay for traditional cable but have reduced their package in the past few years; and cord-nevers, those who have never had Pay TV.\n\n“This report shows there is a huge, new generation of streamers who enjoy live and free TV and are extremely satisfied with the decision to watch TV without cable or satellite,” Matthew Anderson, Roku chief marketing officer, said in a statement. “Half of Roku’s U.S. customers don’t have traditional cable and satellite subscriptions and they enjoy the value, ease and breadth of content we offer them. The Roku study shows that the shift to streaming is more popular and growing faster than ever.”\n\nAdvertisement\n\nOne of the biggest drivers is that virtual multichannel video programming distributors, known as vMVPDs, offer a bridge for consumers who want to cut the cord but don’t want to miss out on network and live TV programming that traditional Pay TV services offer.\n\nWhen consumers are aware that they can stream the same live local channels -- including sports, news, reality, and top network offerings -- with an electronic programming guide (EPG) and video on demand (VOD) at a reduced price, some of the barriers to cord-cutting are removed.\n\nAnother factor is the abundance of high-quality content available through streaming. Companies that offer subscription video on demand services are spending billions on creating and promoting award-winning original content.\n\n“In the next year, we are going to have several prominent studios launch their own streaming video provider,” says Adgate. “The question is, 'Are consumers willing to pay for all of that?' When you’re talking Disney and you’re talking Warner Brothers and you’re talking Universal Studios and Fox, well Disney and Fox -- that’s a lot of content that I think is going to promote or accelerate the adoption to streaming video, so I wouldn’t rule it out.”\n\nViewers are finding value in the ability to watch ad-supported video on demand. Some 73 percent of all video streamers in the Roku study do so, and 45 percent watch more “free” TV than any other streaming video option.\n\nMany cord-cutters have accepted viewing video ads in exchange for free entertainment. In contrast, many traditional linear TV viewers reported in the study that there are too many ads within the content they watch.\n\n74 percent of those surveyed by Roku say that streaming is more convenient than Pay TV services, and 89 percent report that using a streaming device is very easy. Increasingly, cable and satellite companies are putting less effort into trying to retain low-margin video subscribers.\n\nRoku’s analysis shows that 82 percent of all cord-cutters who participated in the study are extremely satisfied with their decision.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "A study from Roku that shows how quickly the shift from Pay TV to streaming is accelerating.", "authors": [], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/Streaming-TV.jpg?ve=1&tl=1", "published_at": "2019-09-19"}