{"pub": "vice", "url": "https://news.vice.com/en_us/article/vb5yw9/brexit-delays-are-fueling-a-dangerous-rage-among-britains-far-right", "downloaded_at": "2019-10-15 23:04:28.363730+00:00", "title": "Brexit Delays Are Fueling a Dangerous Rage Among Britain's Far Right", "language": "en", "text": "LONDON — When Britain’s Supreme Court ruled Prime Minister Boris Johnson’s suspension of Parliament illegal last month, many hailed it as a victory for democracy.\n\nBut for the country's far-right fringe, it was further evidence of a plot by corrupt elites to stop Brexit from ever happening.\n\n“The definition of treason is where someone is trying to overthrow your government and sovereignty, and that’s what’s going on here,” Brexit activist Mike Ranson told VICE News outside the Supreme Court, as the judges inside heard the legal challenges. Ranson denied being far right — he's just an \"ordinary, working-class Brexiteer,\" he said — but he hurled angry abuse at Remain campaigners as they left the court.\n\nIt's been 1,210 days since Britain voted to leave the EU, and with each passing day of political gridlock, the rage of hard-line Brexiteers grows more intense. Their anger has boiled over into violent demonstrations, talk of civil war, and outright threats to pro-Remain campaigners. Increasingly, politicians and analysts are worried about the lengths to which these hard-liners will go, with some senior government ministers warning the country faces a “violent, popular uprising” if Brexit never materializes.\n\n“The whole thing has become so toxic, it sometimes feels like we’re on the verge of the Spanish Civil War,” says Matthew Collins, head of research for the British anti-racist group Hope not Hate.\n\nSuch fears come at an already volatile time for the UK. Since the Brexit vote in 2016, hate crimes have spiked, and far-right extremists now pose the country’s fastest growing terror threat, according to police. Critics say that Johnson, meanwhile, has only inflamed these fears by framing Brexit as a battle between the people and an obstructive Parliament.\n\n“To the gallows!”\n\nThese dynamics were on full display outside the Supreme Court, where Ranson and his fellow activists gathered in one of their regular demonstrations to publicly demand Brexit and confront Remainers. Their main target that day was Gina Miller, a businesswoman turned Remain campaigner who had played a key role in bringing the legal challenge against the government.\n\nAs Miller left court for the day, the 53-year-old railway worker and his fellow activists rushed toward her, hurling insults across a line of police officers.\n\n“You’re a bitch!” Ranson roared. “To the gallows!”\n\nFor Miller, whose campaigning against Brexit has made her one of the biggest hate figures for the British far-right, the abuse was nothing new.\n\n“I’m repeatedly told I’m going to be the next Jo Cox,” she told VICE News during a subsequent phone interview, referring to the Remain-supporting MP who was murdered by a far-right extremist one week before the 2016 referendum.\n\n“Or I get things like ‘a good gang rape’ would sort me out. It’s almost every day. It doesn’t stop.”\n\n\n\nIn this volatile climate, the Brexit betrayal narrative has become the central rallying cause for a broad, leaderless and loosely-affiliated movement — comprised of a far-right hooligans, Islamophobes, and conspiracy theorists. Over the past year, activists have maintained a near-constant presence outside Parliament to harass pro-Remain MPs, and regularly hold rowdy demonstrations demanding Brexit, with many displaying a flair for what Collins describes as an “almost recreational form of violence.”\n\n“I’m repeatedly told I’m going to be the next Jo Cox”\n\nWhat was especially concerning, he said, was the extent to which conspiracist thinking had taken hold within the movement, increasing their propensity for irrational violence against perceived enemies.\n\n“The potential for violence is there in that these people are desperate, they’re driven by a conspiracy theory, and they think you can say anything you like and it’s equal to the truth,” said Collins.\n\nBrexit activists regularly voice a familiar grab-bag of far-right conspiracist grievances about globalists, immigration, Islam, and the media, alongside even more fringe theories. One popular Brexit activist account with nearly 30,000 followers, for example, has retweeted posts attempting to connect climate activist Greta Thunberg with the QAnon conspiracy theory.\n\nSpeaking outside the Supreme Court, Ranson acknowledged some fellow Brexiteers “cross the line.” But not long after, he appeared to endorse the sort of extreme actions politicians are worried about.\n\n“If Brexit fails to deliver, I think there’s going to be civil disorder, seriously. And I would hold my hand up and say yeah, I will be part of that, because I’ve been betrayed, democracy’s dead,” he said. “People are going to riot.”\n\nAsked what role he would play in any unrest, he vacillated, saying he wasn’t “planning on planting bombs” anywhere, but he couldn't say how he would respond.\n\n“I’ve got a short fuse. I can control it, but you don’t know until the time comes.”\n\nHe added: “The politicians have to do what the people tell them to do, and they’re not. Personally, I would bloody bring back the gallows and hang every single one of them.”\n\n“You want a war, I’ll give you a war”\n\nObservers say the far-right Brexiteer street movement is informal, disorganized and leaderless. But the face of the movement, if it can be said to have one, is James Goddard. A 30-year-old former forklift driver originally from Leicester, he’s gained a degree of notoriety over the past year by aggressively confronting Remainer MPs, flanked by his supporters, and posting the footage online.\n\nIn the most high-profile incident, he and his supporters surrounded prominent Remainer MP Anna Soubry and pursued her outside Parliament, shouting insults such as “traitor,” “scum,” and “Nazi” while she sought protection from police. Goddard, who at the time styled himself a “yellow vest” after anti-government protesters in France, also hurled threats at police officers, telling them, “Every fucking one of you are fair game — you want a war, I’ll give you a war.”\n\nJames Goddard was given a two-year suspended sentence and banned from the area surrounding Parliament after he admitted calling MP Anna Soubry a Nazi and a traitor outside the Houses of Parliament in January. (Press Association via AP Images)\n\nGoddard is aware his approach isn’t for everyone. “I know some people find it unpalatable, but I believe my style of protesting delivers a message,” he told VICE News.\n\nPlus, the aggressive style got clicks.\n\n“Every time we do something like that, it goes viral,” he said.\n\nGoddard’s been kicked off Twitter, Facebook and PayPal, and demonetized on YouTube as a result of his vitriol. But donations from supporters still allow him to work full-time as a pro-Brexit agitator.\n\n\n\nIt’s also led to criminal convictions. Earlier this year he was given a two-year suspended sentence and banned from the area surrounding Parliament for harassing Soubry.\n\nSoubry didn’t respond to requests for comment, but the abuse clearly left her rattled. Last month she cancelled a speaking appearance at Remain rally in London due to intimidation by a hooligan-based far-right group. “I’m a parliamentarian and I have a right to speak, and I shouldn’t be frightened but ... I’m very frightened actually,” she said at the time.\n\n“Every time we do something like that, it goes viral”\n\nDespite the conviction, Goddard says he sees nothing wrong with his tactics, and has no plans to change his ways until Brexit is secured. He was arrested again last month for confronting Labour leader Jeremy Corbyn outside a rally in Salford, and sees the charges against him as a case of “the establishment” working to silence dissent.\n\n“If you challenge a politician in this country, then you have the full force of the establishment against you,” he said.\n\n“We know where your children go to school”\n\nThose on the receiving end of such abuse see things differently. Since the 2016 assassination of Cox just a week before the referendum — by a white supremacist who cried out “Death to traitors, freedom for Britain” in court — political violence is no longer an abstraction in Britain.\n\nFor Miller, the businesswoman turned high-profile Remain campaigner, the relentless stream of threats from Brexiteers has driven her to hire personal security, go out in public less, and constantly worry for her family’s safety.\n\nAnti-Brexit campaigner Gina Miller speaks outside the Supreme Court in London, Tuesday, Sept. 24, 2019 after it made it's decision on the legality of Prime Minister Boris Johnson's five-week suspension of Parliament. (AP Photo/Matt Dunham)\n\n“It restricts our freedom a lot,” Miller told VICE News. ”It’s like being on high alert all the time. I’m always thinking about what could go wrong, who knows where we are.”\n\nThe 54-year-old became, in the words of many of her abusers, “the most hated woman in Britain” when she successfully launched a legal case against the government in 2016, forcing it to gain approval from Parliament before it could begin the formal process of leaving the EU. She followed that up with a second legal victory against the government last month, when she and others successfully challenged Johnson’s move to suspend Parliament for a critical period ahead of the scheduled Oct. 31 EU departure date.\n\n”It’s like being on high alert all the time. I’m always thinking about what could go wrong, who knows where we are”\n\nAs a wealthy woman of color who has successfully challenged the government’s Brexit plans, Miller says she’s the perfect hate figure for the far right. She can handle the abuse, she says, but the incessant threats — online, over the phone, in person — have taken a huge toll.\n\nShe’s had toxic chemicals sent to her office, and she once received a letter saying, “We know where your children go to school; they’ll be taken today.”\n\nThe hate streaming toward politicians was the topic of an emotional debate in Parliament last month, when MPs spoke out about the deluge of threats they are facing amid the tensions over Brexit. Criminal abuse and harassment of MPs has hit an unprecedented level, according to Metropolitan police chief Cressida Dick.\n\nBritain's Conservative Party lawmaker Boris Johnson gestures as he speaks during the official launch of his leadership campaign, in London, Wednesday June 12, 2019. Boris Johnson solidified his front-runner status in the race to become Britain's next prime minister on Tuesday, gaining backing from leading pro-Brexit lawmakers.(AP Photo/Frank Augstein)\n\n“We talk about it in the tea rooms,” Paula Sheriff, a pro-Remain Labour MP who has been threatened with murder, rape, and mutilation, told a British television network after her speech to Parliament. Seven other MPs said they’d received similar threats. “People are really frightened.”\n\nSheriff and others put some of the blame on Johnson and his coterie of hardline Brexiteers, who they accuse of fueling the far-right’s aggression.\n\nJohnson’s critics — including MP Amber Rudd, who only weeks ago was a Cabinet minister — say the prime minister’s incendiary rhetoric, such as vowing he’d rather be “dead in a ditch” than fail to deliver Brexit, is inciting violence. Labour MP Jess Phillips revealed that Johnson’s exact words were used in an anonymous threat against her, warning that opponents of Brexit would find themselves “dead in a ditch.”\n\n\n\nPeter Tatchell, a veteran progressive campaigner who faced intimidation from a hooligan-based group of pro-Brexit counter-demonstrators at a Remain event last month, told VICE News it was “outrageous” that the prime minister was mirroring the far right’s agenda and rhetoric.\n\n“Johnson must surely be aware that he’s playing into the hands of the far right, fueling their sense of grievance and betrayal mentality and giving them de facto encouragement,” he told VICE News.\n\nMiller agreed. “He didn’t start it. It’s been brewing. But what he’s done is light a match to it.”\n\n“Johnson must surely be aware that he’s playing into the hands of the far right”\n\nWhen challenged on his approach in Parliament, Johnson dismissed the criticism as “humbug,” then sparked further outrage by saying the best way to honor the memory of Cox, a pro-Remain MP, was to “get Brexit done.” He later backtracked slightly, claiming there had been a \"misunderstanding\" over his remarks for which he apologized, but said he wouldn’t stop using military metaphors like surrender, which were “old, standard, parliamentary terms.”\n\nJohnson’s response left many, including Miller, even more deeply despairing over where things are heading next, as a divided Britain lurches toward a Brexit deadline at the end of the month with virtually nothing certain but further rancor.\n\n“Three years ago, it was a febrile environment, but I thought people would come to their senses,” said Miller. “Yet what has happened that over that period is that the tide has turned back on decency and tolerance in our society more than I ever thought possible.”\n\nShe continued. “You scorch the earth, and what is left after? Whatever happens when Brexit is over, we’re going to have to live as one society.”\n\nCover: Pro-Brexit demonstrators protest outside The Supreme Court in London, Tuesday, Sept. 17, 2019. (AP Photo/Alastair Grant)", "description": "“The whole thing has become so toxic, it sometimes feels like we’re on the verge of the Spanish Civil War”", "authors": [], "top_image": "https://video-images.vice.com/articles/5d967da216b5ad00099f6b63/lede/1571170233487-AP_19260370171030.jpeg?crop=1xw:0.8428732855361596xh;center,center&resize=1200:*", "published_at": "2019-10-15"}