{"pub": "yahoo", "url": "https://sports.yahoo.com/game-day-swag-browns-odell-beckham-jr-plays-in-200000-watch-201442908.html", "downloaded_at": "2019-09-08 23:27:57.807704+00:00", "title": "Game day swag: Browns' Odell Beckham Jr. plays in watch that costs nearly $200K", "language": "en", "text": "After all the offseason hype, the Cleveland Browns suffered a Week 1 wipeout against the Tennessee Titans.\n\nOdell Beckham Jr., the Browns’ biggest offseason acquisition, had seven catches for 71 yards. He played with one very expensive timepiece on his left wrist.\n\nScroll to continue with content Ad\n\nAs noted by Bleacher Report’s Master Tesfatsion, Beckham is wearing a Richard Mille watch, specifically, it’s an RM 11-03 McLaren, a limited-edition piece in which only 500 were made.\n\nBeckham wore the same watch during offseason workouts.\n\nPrice: $191,500.\n\nAnd get this: it looks like Beckham decided to wear the watch specifically for the game.\n\nHere’s a photo from Getty Images from pregame warmups. Look closely at Beckham’s left wrist: it looks bare between his glove and his black arm sleeve.\n\nOdell Beckham Jr., sans watch, in pregame warmups. (Getty Images)\n\nBut in this photo, taken during the game as Beckham runs a route, you can see the watch.\n\nOdell Beckham and his pricey watch. (Getty Images)\n\nBeckham has never been one to shy away from bold fashion choices – remember his ensemble from this year’s Met Gala? – but he seems to have taken a liking to Browns’ orange.\n\nThe band on his Richard Mille is orange, as are accents on the face of the piece. And in May, we learned that Beckham had Dreamworks Motorsports in North Carolina customize his Rolls-Royce Cullinan SUV – it is orange outside and inside, and the “Spirit of Ecstasy” hood sculpture that are part of all Rolls-Royces has been replaced by a small sculpture of him making his infamous 2014 catch.\n\nMore from Yahoo Sports:", "description": "The band of Beckham's Richard Mille is Browns orange, of course.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/zBKN4Sz4wWwiUOEapZh9PA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/IXuEGMK_9cRqeaGxCp_PkA--~B/aD0zMDY1O3c9NDU5NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/a5bd4f30-d273-11e9-bb7d-58a3cfd3bf60", "published_at": "2019-09-08"}