{"pub": "businessinsider", "url": "https://pedestrian.tv/travel/air-asia-free-flights-kuala-lumpur", "downloaded_at": "2019-10-17 01:50:54.653726+00:00", "title": "GRAB YA PASSPORT: You And A Mate Could Win These Free Flights & Accom To Kuala Lumpur", "language": "en", "text": "PEDESTRIAN.TV have partnered with AirAsia to get your butt over to Kuala Lumpur.\n\nIt’s no secret that I love to travel more than just about anything. The one exception to that is how much I love free stuff. So if you put those things together I’m pretty much in heaven.\n\nWell, hold onto your passports, because AirAsia is giving you the chance to win FREE return flights for two people out of the Gold Coast, Sydney, Melbourne Avalon or Perth PLUS three nights accommodation in the bustling Malaysian capital, Kuala Lumpur.\n\nHow the heck do you win this killer prize? You aggressively hit the link below and tell us in 25 words or less what you would like to hit up on a holiday in Kuala Lumpur.\n\nWin Return Flights And 3 Nights Accommodation To Malaysia For You And A Mate\n\n\n\nPerhaps after flying over with AirAsia you would want nothing more than to stuff your face with roti and mee goreng the whole time – which is basically how my sister spent her honeymoon and she would tell you it’s the best thing she ever did.\n\nOr maybe you’d prefer to soak up some local culture with a trip through the many beautiful temples, or work up a sweat with a walk over the hanging bridges of KL Forest Eco Park. Of course, you could always just hang with the monkeys.\n\nWhatever it is that floats your boat, hurry up and tell us about it for your chance to get there for free and actually do all the things, thanks to AirAsia.", "description": "Air Asia is throwing a competition and the winner gets free flights to and accommodation in Kuala Lumpur for two people. Details here.", "authors": ["Kassia Byrnes"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/10/GettyImages-728921985-1024x565.jpg", "published_at": "2019-10-17"}