{"pub": "independent", "url": "https://independent.co.uk/life-style/top-digital-influencers-instagram-youtube-pewdiepie-kdi-saffron-barker-a9096486.html", "downloaded_at": "2019-09-08 23:26:48.210484+00:00", "title": "Top 100 digital influencers ranked, from YouTube's PewDiePie to Strictly Come Dancing's Saffron Barker", "language": "en", "text": "The top 100 digital influencers have been revealed, with YouTube star PewDiePie taking the number one spot.\n\nThe list, published by The Sunday Times, is based on influencers with the best social media engagement and most committed fans.\n\nThe ranking was determined using an algorithm created by digital trends platform CORQ which scores influencers out of 100.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIt takes into account audience size, growth and engagement rate and influencers were given a live score based on their social activity over time.\n\nPewDiePie, a YouTuber and author whose real name is Felix Kjellberg, has been named the most influential digital star.\n\nShape Created with Sketch. Forbes' Highest-Paid YouTubers of 2016 Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Forbes' Highest-Paid YouTubers of 2016 1/10 1. PewDiePie ($15 million) (Real name Felix Kjellberg) Getty 2/10 2. Roman Atwood ($8 million) Getty 3/10 3. Lilly Singh ($7.5 million) Lilly Singh Getty 4/10 4. Smosh ($7 million) (Real names Ian Hecox and Anthony Padilla aka Smosh) Getty 5/10 5. Rosanna Pansino ($6 million) Getty 6/10 6. Tyler Oakley ($6 million) Getty 7/10 7. Markiplier ($5.5 million) (Real name Mark Fischbach) Getty 8/10 8. German Garmendia ($5.5 million) Getty 9/10 9. Rhett and Link ($5 million) (Real names Rhett McLaughlin and Charles Lincoln 'Link' Neal) Getty 10/10 10. Miranda Sings ($5 million) (Real name Colleen Ballinger) Getty 1/10 1. PewDiePie ($15 million) (Real name Felix Kjellberg) Getty 2/10 2. Roman Atwood ($8 million) Getty 3/10 3. Lilly Singh ($7.5 million) Lilly Singh Getty 4/10 4. Smosh ($7 million) (Real names Ian Hecox and Anthony Padilla aka Smosh) Getty 5/10 5. Rosanna Pansino ($6 million) Getty 6/10 6. Tyler Oakley ($6 million) Getty 7/10 7. Markiplier ($5.5 million) (Real name Mark Fischbach) Getty 8/10 8. German Garmendia ($5.5 million) Getty 9/10 9. Rhett and Link ($5 million) (Real names Rhett McLaughlin and Charles Lincoln 'Link' Neal) Getty 10/10 10. Miranda Sings ($5 million) (Real name Colleen Ballinger) Getty\n\nThe vlogger and entrepreneur covers gaming and digital culture on his namesake YouTube channel.\n\nDespite his popularity, PewDiePie faced criticism in early 2017 when he posted a video that featured two men, whom he’d hired for a stunt, holding up a sign that read “Death To All Jews”.\n\nIn 2018, he caused controversy again when he called fellow YouTuber Lilly Singh an “idiot” and a “crybaby” after she spoke out about gender and wage equality within digital media.\n\nThe 29-year-old married his long-term girlfriend and fellow vlogger Marzia Bisognin in a lavish ceremony in Kew Gardens, southwest London, last month. He has recently used his platform to raise money for charity.\n\nSecond on the list is Olajide William Olatunji, a rapper and amateur boxer, otherwise known as KSI.\n\nThe most influential woman on the list is lifestyle blogger Saffron Barker, coming in at number five.\n\nAs well as having more than 2 million subscribers on YouTube, Saffron is also a contestant in the current series of Strictly Come Dancing.\n\nThe 19-year-old beats previous Strictly contestant, and brother of influential blogger Zoella, Joe Sugg, who sits in sixth place.\n\nThe largest section dominating the list is beauty influencers, of which there are 20 in total.\n\nThe top ten most influential stars are:\n\nFelix Kjellberg – PewDiePie Olajide William Olatunji – KSI Craig Thompson – Mini Ladd Billy Wingrove and Jeremy Lynch – F2Freestylers Saffron Barker Joe Sugg – ThatcherJoeVlogs Chelsea Clarke – CC Clarke Beauty Callum Leighton Airey – Calfreezy Joshua Bradley – Zerkaa Colin Furze – colinfurze\n\nThe full list is available here.", "description": "The top 100 digital influencers have been revealed, with YouTube star PewDiePie taking the number one spot.", "authors": ["Sarah Young"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/20/16/gettyimages-501662958.jpg", "published_at": "2019-09-08"}