{"pub": "businessinsider", "url": "https://pedestrian.tv/news/adelaide-carpark-bees", "downloaded_at": "2019-09-25 13:56:46.992545+00:00", "title": "A Few Thousand Bees Decided To Apply Themselves As A Glaze To An Adelaide Woman’s Car", "language": "en", "text": "One of the best things you can do if you’re a bee is to swarm. For a bee, swarming is just about as good as it gets. For bees, getting in a big swarm is like cracking open a cold one with the boys. It’s simultaneously a heady rush and a great comfort. They (the bees) will not miss out on any opportunity to swarm. They’ll swarm inside the walls of houses. They’ll swarm at Mary’s in Sydney CBD. They will swarm a truck in East Texas. Any kind of place you can name, they will swarm.\n\nIf the first place that sprung to mind when you conducted that thought experiment just now happened to be ‘on the back of a Jeep Patriot in the carpark of Westfield Marion Shopping Centre in Adelaide’, I have absolutely tremendous news for you: That is very much a location that bees will swarm, as they proved today, by doing exactly that.\n\n\n\nPictured: Bees! (Source: 9News.)\n\nAs 9News is reporting, the owner of the pictured Jeep Patriot called beekeepers at around 11am today after noticing that, well, their fucking car was entirely covered in bees. Beekeeper Andrew Thompson arrived on the scene and removed the queen from the car, causing the remaining bees to swarm the carpark (they just love to swarm!).\n\nThompson, just as an aside, looks exactly like what you might expect a beekeeper to look like:\n\n\n\nPictured: A beekeeper, maybe one who did a murder on Midsomer Murders. (Source: 9News)\n\nAfter the bees fucked off (technical term), the car was washed, to get rid of the tantalising scent of queen bee that would only make the bees come right back.\n\nThe ABC is reporting that this exact thing happened yesterday as well, this time to a yellow Hyundai Getz in Christies Beach.\n\nIt truly is the time of the bee.", "description": "An Adelaide woman was delighted to discover that her car had become covered in a thick glazing of bees while she was working today.", "authors": ["Ben Mcleay"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/09/Screen-Shot-2019-09-25-at-10.28.18-pm.png", "published_at": "2019-09-25"}