{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7537221/Karl-Stefanovic-slams-bullies-attacking-Erin-Molan-Andrew-Johns-feud.html", "downloaded_at": "2019-10-05 08:57:01.280936+00:00", "title": "Karl Stefanovic slams bullies for attacking Erin Molan over Andrew Johns feud", "language": "en", "text": "Karl Stefanovic has called out the 'gutless keyboard warriors' for their 'bullsh*t' comments attacking Erin Molan over the Andrew Johns feud.\n\nRumours are swirling that NRL immortal Johns dislikes working with Molan, 37, and quit The Footy Show because he didn't want her being the main presenter.\n\nWhile filling in for Ben Fordham on 2gb, Stefanovic spent several minutes slamming the 'nasty and unwarranted criticism' which his 'good friend' was subject to.\n\n'I first met Erin when she was working on the Footy Show years ago. It was a different time in the media and the blokes ruled the roost,' he started.\n\n'Erin never, ever complained when at times she could have, I know that for a fact but she got on with it.'\n\nFilling in for Ben Fordham on 2gb, Stefanovic spent several minutes slamming the 'nasty and unwarranted criticism' which his 'good friend' was subject to\n\nMolan was described by Stefanovic as one of the 'nicest, most hard working, most professional people you are ever going to meet'\n\nHe described Molan as one of the 'nicest, most hard working, most professional people you are ever going to meet'.\n\n'She's a hardworking mum, she prepares, she researches, she knows her stuff and she has a crack at every opportunity that comes her way.'\n\nStefanovic said it was 'beyond me' as to why Molan and Johns were in the headlines over the 'BS nonsense' of the pair not getting along.\n\n'It's BS. That BS led to anonymous cowards abusing and harassing and trolling Erin Molan on social media,' he stated.\n\n'They are gutless keyboard warriors. And don't think for a moment the online hate is easy to ignore. It's just not easy to ignore. It takes a toll, you can see that.'\n\nRumours are swirling that Johns dislikes working with Molan, 37, and quit The Footy Show because he didn't want her being the main presenter\n\nMore rumours arised on Friday that Molan is also difficult to work with (pictured presenting The Footy Show)\n\nMore rumours arose on Friday that Molan is also difficult to work with and Stefanovic spoke to producers and presenters at 2gb - where Molan occasionally works - who all said she was not difficult to work with.\n\n'They all say she's the most relaxed, most friendliest person you could ever work alongside,' he said.\n\n'Sometimes in this job when you're in the public eye, you get people who try to bring you down - it goes with the territory.\n\n'That's not going to work on Erin Molan, she's far too good for it.\n\n'And for those who feel it's appropriate to harass and troll someone for no good reason. Do me a favour, look in the mirror and find something decent to do with your life. And make sure you watch this Sunday on Channel 9, watch a woman who stands up and delivers despite all the pressures. A woman, who we are all proud to call a friend, a woman who gets on with the job, and gets the job done.'", "description": "Rumours are swirling that Johns dislikes working with Molan, 37, and quit The Footy Show because he didn't want her being the main presenter.", "authors": ["Sahar Mourad For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/11/19293460-0-image-a-13_1570186263668.jpg", "published_at": "2019-10-04"}