{"pub": "realclearpolitics", "url": "https://theatlantic.com/ideas/archive/2019/09/fbi-trump-comey/597523", "downloaded_at": "2019-09-06 12:08:20.736625+00:00", "title": "Trump Is Winning His War on the FBI", "language": "en", "text": "The ongoing reality-show-style fight between Comey and Trump seems petty, but the great significance of the IG report is that it establishes that bureau officials’ highest loyalty should not be to the Constitution or to the public but to the boss. The president has successfully purged bureau officials he perceives as hostile to the agency, at least one of whom is facing prosecution. The FBI’s internal investigations have focused on the president’s critics, not those officials who abused their authority to aid Trump in the latter days of the 2016 campaign. The Democratic Party has shown no appetite for scrutinizing rogue bureau officials’ behavior, which makes it clear to its leadership that it is only right-wing criticism they have to fear. For all the president’s public feuding with the nation’s chief law-enforcement agency, he appears to have won the battle to redefine its nature.\n\nComey’s initial decision to tell Congress, in late October 2016, that he had reopened the investigation into Democratic presidential candidate Hillary Clinton’s emails was itself rooted in fear about how the right would react, and that FBI officials sympathetic to Trump would leak word of the move to the press.\n\nThis is documented in great detail in Horowitz’s 2018 report into the bureau’s actions prior to the 2016 election. Comey himself told investigators, “My worry was, I have to be careful that people in New York aren’t by virtue of political enthusiasm, trying to take action that will generate noise that will have an impact on the election.”\n\nThat fear was echoed by other Justice Department and bureau officials. Former FBI counsel James A. Baker told investigators, “We were quite confident that … somebody is going to leak this fact. That we have all these emails. That, if we don’t put out a letter, somebody is going to leak it.” Former Acting Attorney General Sally Yates told the IG that it was her understanding that Comey did not believe it was “survivable” for Comey not to notify Congress the email probe was being reopened, and that “they felt confident that the New York Field Office would leak it and that it would come out regardless of whether he advised Congress or not.”\n\nExplaining the antipathy in the New York Field Office toward Clinton, former Attorney General Loretta Lynch told investigators that Comey had informed her that “it had become clear to him, he didn’t say over the course of what investigation or whatever, he said it’s clear to me that there is a cadre of senior people in New York who have a deep and visceral hatred of Secretary Clinton. And he said it is, it is deep. It’s, and he said, he said it was surprising to him or stunning to him.” Lynch further elaborated that “it was hard to manage because these were agents that were very, very senior, or had even had timed out and were staying on, and therefore did not really feel under pressure from headquarters or anything to that effect.”", "description": "Within the bureau, there’s an asymmetry that even those who seek to play by the rules cannot ignore.", "authors": ["Adam Serwer", "Staff Writer At"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/RTS2ODT6/facebook.jpg?1567739854", "published_at": "2019-09-06"}