{"pub": "fox", "url": "https://foxnews.com/politics/ukraine-prosecutor-biden-burisma-back-off-state-department-files", "downloaded_at": "2019-10-03 07:27:58.148946+00:00", "published_at": "2019-10-02", "title": "Ex-Ukraine prosecutor said he was told to back off probe of Biden-linked firm, files show", "language": "en", "text": "The fired prosecutor at the center of the Ukraine controversy said during a private interview with President Trump's personal attorney Rudy Giuliani earlier this year that he was told to back off an investigation involving a natural gas firm that was linked to Joe Biden’s son, according to details of that interview that were handed over to Congress by the State Department’s inspector general Wednesday.\n\nFox News obtained a copy of Giuliani’s notes from his January 2019 interview with fired Ukrainian prosecutor Viktor Shokin in which he claimed that his “investigations stopped out of fear of the United States.”\n\n“Mr. Shokin attempted to continue the investigations but on or around June or July of 2015, the U.S. Ambassador Geoffrey R. Pyatt told him that the investigation has to be handled with white gloves, which according to Mr. Shokin, that implied do nothing,” the notes from the interview stated. The notes also claimed Shokin was told Biden had held up U.S. aid to Ukraine over the investigation.\n\nRENEWED INTEREST IN JOE BIDEN’S OFFICIAL TRIP TO CHINA IN 2013 WITH SON HUNTER\n\nShokin was fired in April 2016, and his case was “closed by the current Prosecutor General Yuriy Lutsenko,” according to the notes. Despite his claims, Shokin, on both sides of the Atlantic, had been widely accused of corruption.\n\nBut Biden's role is back in the spotlight after Democrats launched an impeachment inquiry over Trump's efforts to convince Ukraine to look into Biden's actions.\n\nBiden, who has been seeking to unseat President Trump in 2020, once famously boasted on camera that when he was vice president and spearheading the Obama administration’s Ukraine policy, he successfully pressured Ukraine to fire Shokin who was the top prosecutor at the time. He had been investigating the founder of Burisma Holdings, where Hunter Biden had a lucrative role on the board.\n\nAllies of the Democrat, though, maintained that his intervention prompting the firing of Shokin had nothing to do with his son, but rather was tied to the corruption concerns. The Biden campaign has also slammed Giuliani and blasted media outlets for giving him air time. The campaign wrote to NBC News, CBS News, Fox News and CNN to voice “grave concern that you continue to book Rudy Giuliani on your air to spread false, debunked conspiracy theories on behalf of Donald Trump.”\n\n“The substance of President Trump and Rudy Giuliani’s claims has been roundly discredited,” Biden Deputy Campaign Manager Kate Bedingfield said last week. “This is not a claim from the campaign or Joe Biden. This is an irrefutable fact.”\n\nThe Wall Street Journal reported last week that by the time of Biden's intervention, the Burisma probe had been dormant.\n\nHowever, Shokin, at the time, according to the interview, was investigating Mykola Zlochevsky, the former minister of ecology and natural resources of Ukraine — also the founder of Burisma. Hunter Biden was appointed to the board of the firm, which Shokin claimed was an appointment made by Zlochevsky “in order to protect himself.”\n\nThe interview purportedly conducted by Giuliani took place on Jan. 23, 2019 at an office on Park Avenue in New York City. Shokin was interviewed over the phone, and interpreters were used — one in Ukraine and one in New York, according to the notes obtained by Fox News.\n\nIn a statement to Fox News after this report was first published, Giuliani said the details were gathered before Biden announced his presidential run and the allegations were brought to him.\n\n\"I explored them as part of my duty as an attorney to show that the crimes committed, were not by my client, but by Democrats. I was not seeking to investigate Joe Biden. I was not investigating Joe Biden,\" Giuliani said.\n\nHe also confirmed that he brought the documents to the State Department, saying that he was disappointed they had not been investigated.\n\n\"Maybe they will now,\" he said.\n\nThe new documents were shared with Fox News by sources familiar with the “urgent” briefing held by State Department Inspector General Steve Linick on Wednesday.\n\nLinick gave a closed-door briefing on Ukraine to aides from the Senate committees on Intelligence, Foreign Relations, Appropriations and Homeland Security, as well as aides from the House committees on Foreign Affairs, Intelligence, Appropriations and Oversight. The briefing lasted over an hour and took place in a sensitive compartmented information facility (SCIF) on Capitol Hill Wednesday afternoon.\n\nLinick shared a file with those who attended the briefing, containing multiple folders with the Trump Hotel logo on them. Inside the folders were notes from an interview conducted by Giuliani in January 2019 with Shokin, as well as Lutsenko. Another folder contained news clips, as well as several timelines about investigations related to Burisma.\n\nA State Department spokesman on Wednesday confirmed to Fox News that the “relevant” materials Linick shared with Congress “were provided by the Department to the Inspector General on May 3, 2019 for his review and for such action as the Inspector General deemed appropriate.”\n\nHOUSE DEMOCRATS PREP WHITE HOUSE SUBPOENA, AS TRUMP CALLS BS ON IMPEACHMENT PUSH\n\nLinick told aides in the meeting that he received the package of information in the spring but did not know the sender. Linick sent it to the FBI because it included allegations of improper activities in Ukraine that were outside of his jurisdiction, according to sources familiar with the meeting. Last week, though, Linick was given permission by the FBI to share the files with Congress and said they were relevant to the congressional interviews being conducted, according to sources.\n\nThe documents came amid the uproar surrounding Trump’s July 25 phone call with Ukrainian President Volodymyr Zelensky, in which he sought an investigation into Biden’s Ukraine dealings, as well as his son’s. That phone call sparked a formal impeachment inquiry in the House of Representatives and had the Trump administration facing a new round of subpoenas.\n\nAmid the rapidly moving impeachment inquiry being led by House Democrats, the details included in the folder turned over by the State Department inspector general could be used by the Trump administration to fuel its claim that the real scandal surrounded the Bidens. However, Democrats already have cast the files as “debunked conspiracy theories” and “propaganda.”\n\n\"The briefing and documents raise troubling questions about apparent efforts inside and outside the Trump Administration to target specific officials, including former Vice President Joe Biden’s son and then-U.S. Ambassador to Ukraine Masha Yovanovitch, who was abruptly removed as Ambassador in May after a sustained campaign against her by the President’s agent, Rudy Giuliani,” House Intelligence Committee Chairman Adam Schiff, D-Calif., Foreign Affairs Committee Chairman Eliot Engel, D-N.Y., and Oversight Committee Chairman Elijah Cummings, D-Md., said in a statement late Wednesday.\n\n“The documents provided by the inspector general included a package of disinformation, debunked conspiracy theories, and baseless allegations in an envelope marked ‘White House’ and containing folders labeled ‘Trump Hotel.’ These documents also reinforce concern that the president and his allies sought to use the machinery of the State Department to further the president’s personal political interests.”\n\nMeanwhile, the sources also shared pages of the Shokin interview with Fox News which revealed that in February 2016, prior to his firing, there were warrants placed on the accounts of “multiple people in Ukraine.”\n\nPOMPEO HITS BACK AT HOUSE DEMS IN DEPOSITION STANDOFF, CONFIRMS HE WAS ON UKRAINE CALL\n\n“There were requests for information on Hunter Biden to which nothing was received,” Shokin said, according to the notes. “It is believed that Hunter Biden receives a salary, commission plus one million dollars. There were no documents or information on Hunter Biden, and Mr. Shokin stated he was warned to stop by Ambassador Geoffrey R. Pyatt.”\n\nThe notes add that “President of Ukraine Petro Poroshenko told Mr. Shokin not to investigate Burisma as it was not in the interest of Joe and/or Hunter Biden. Mr. Shokin was called into Mr. Poroshenko’s office and told that the investigation into Burisma and the Managing Director where Hunter Biden is on the board, has caused Joe Biden to hold up one billion dollars in U.S. aid to Ukraine.”\n\nShokin then told Giuliani, according to the notes, that “in or around April of 2016” Poroshenko “told him he had to be fired as the aid to the Ukraine was being withheld by Joe Biden.”\n\nBiden reportedly threatened to withhold $1 billion in critical U.S. aid if Shokin was not fired.\n\nShokin also claimed, according to the notes, that Ambassador Marie L. Yovanovitch denied him visa travel to the U.S., and claimed it was because “she is close to Mr. Biden.”\n\nMeanwhile, Trump is facing a rapidly escalating House investigation after an intelligence community whistleblower filed a complaint regarding his call with Zelensky, claiming he had solicited a foreign power to help influence the 2020 presidential election.\n\nDemocrats have claimed that the Trump-Zelensky call revealed a quid pro quo, saying Trump tied his request to investigate the Bidens to military aid. Trump reportedly even ordered his staff to freeze nearly $400 million in aid to Ukraine a few days before the phone call with Zelensky, a detail that fueled impeachment calls. However, the call transcript did not show Trump explicitly mentioning the aid as a bargaining chip.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nAs part of the impeachment inquiry, House Democrats have subpoenaed Giuliani for key documents related to the Ukraine controversy. They also have subpoenaed Secretary of State Mike Pompeo and are expected to receive depositions from nearly half a dozen State Department officials named in the whistleblower complaint.\n\nOne source told Fox News that prior to the “urgent” briefing Wednesday, it was reported that Linick would discuss alleged retaliation against those State Department officials ahead of their depositions, but the source told Fox News that Linick said that there had been no complaints of retaliation filed with his office.", "description": "The fired prosecutor at the center of the Ukraine controversy said during a private interview with President Trump's personal attorney Rudy Giuliani earlier this year that he was told to back off an investigation into a natural gas firm that was linked to Joe Biden’s son, according to details of that interview that were handed over to Congress by the State Department’s inspector general Wednesday.", "authors": ["Brooke Singman", "Brooke Singman Is A Politics Reporter For Fox News. Follow Her On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/RT-viktor-shokin.jpg"}