{"pub": "yahoo", "url": "https://sports.yahoo.com/liverpool-news-jurgen-klopp-reds-095400927.html", "downloaded_at": "2019-10-08 13:01:49.818786+00:00", "title": "Liverpool news: Jurgen Klopp’s Reds in numbers after four years in charge at Anfield", "language": "en", "text": "Getty Images\n\nJurgen Klopp is celebrating four years at Liverpool with the Reds sitting top of the Premier League.\n\nThe German has overseen a remarkable transformation at Anfield.\n\nScroll to continue with content Ad\n\nAfter inspiring the Reds to Champions League glory last season in Madrid, the league has become the priority.\n\nWith an eight-point gap to champions Manchester City, Klopp is on the verge of joining the all-time greats at Anfield.\n\nHere are the numbers behind an incredible four years.\n\n221 - number of games played in all competitions.\n\n320 - points won in the Premier League from 152 matches at an average of 2.11 per game.\n\n146 - the number of games it took Klopp to record 300 league points - the fewest required by any of the club's managers.\n\n458 - goals scored in all competitions - averaging 2.07 goals per game, the highest ratio by any Reds manager in the last 123 years.\n\nKlopp celebrates four years with Liverpool (Getty)\n\n58.82 - win percentage (130 in 221 games), bettered only by one previous Liverpool manager John McKenna (69.44).\n\n92 - wins in Klopp's first 150 Premier League games, more than any other Liverpool manager.\n\n67 - players used by the club during Klopp's four-year, 221-match reign.\n\n44 - average number of minutes between Liverpool goals (458 goals in 20,010 minutes).\n\n43 - number of occasions Klopp's side have scored four goals or more in a game.\n\nKlopp lifts the Champions League with the Reds (Getty)\n\n14 - number of Premier League teams Klopp is unbeaten against.\n\n17 - successive league victories recorded (currently), a club best and one short of Manchester City's record which they can equal at Manchester United on October 20.\n\n1 - the first manager to take an English team to three European finals in his first three seasons of European competition.\n\nPA Sport contributed to this report", "description": "Jurgen Klopp is celebrating four years at Liverpool with the Reds sitting top of the Premier League.The German has overseen a remarkable transformation at Anfield.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/j76ddRmH8grD79Jy8l4sHw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTI7aD02OTg-/https://s.yimg.com/uu/api/res/1.2/7kf.2S8jfnLavYbcHSVDBA--~B/aD0zNDk7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/0ed79713e5bfc197b2b14ffd20e408a0", "published_at": "2019-10-08"}