{"pub": "guardian", "url": "https://theguardian.com/science/2019/oct/14/common-drug-could-prevent-thousands-of-head-injury-deaths", "downloaded_at": "2019-10-14 23:25:46.028482+00:00", "title": "Common drug could prevent thousands of head injury deaths", "language": "en", "text": "A cheap and widely available drug could reduce the risk of death from common head injuries and save tens of thousands of lives each year, researchers say.\n\nTranexamic acid slows down the breakdown of blood clots, and is already used to control heavy bleeding in people who have experienced trauma elsewhere in the body – for example from being shot or stabbed.\n\nWhile some of these patients might also have head injuries, it has remained unclear whether tranexamic acid would help people with head injuries alone.\n\nNow scientists say it can – at least in those with mild to moderate traumatic brain injuries – suggesting the drug should be rapidly administered to such patients.\n\n“Previous to this research, patients with isolated head injuries were an exception in the policy of giving tranexamic acid to trauma patients as soon as possible,” said Prof Ian Roberts of the London School of Hygiene and Tropical Medicine, who co-led the study. “Now that exception can be removed.”\n\nRoberts says the study could have a dramatic impact. “Worldwide it has got the potential to save tens of thousands of lives – this is such a mass problem,” he said.\n\nIt is estimated that there are about 70m new traumatic brain injuries worldwide every year – a situation commonly caused by motor vehicle crashes, assault or falls. The vast majority are mild or moderate injuries – but these can still prove deadly.\n\nThe study, which was published in the Lancet medical journal, spanned 29 countries, with the analysis focusing on more than 9,000 patients who were treated within three hours of injury and were randomly allocated to receiving the drug, or a placebo, intravenously. The cost of the total dose of tranexamic acid used in the trial was about £6.20 per person.\n\nAt first glance, there appeared to be no significant difference in the risk of death within 28 days of injury between those given the drug and those given the placebo. However, further analysis showed the effect depended upon the severity of the injury.\n\nThe drug had no apparent effect on patients with severe traumatic brain injury – which Roberts said was likely to be down to patients either having already had heavy bleeding in the brain, or because they had other severe damage. “You can only prevent something that hasn’t already happened,” he said.\n\nFor those with mild or moderate traumatic brain injury, however, the drug lowered the risk of death. Patients given tranexamic acid within three hours of injury had a 22% lower risk of death than those given a placebo: of 2,846 such patients given tranexamic acid, 5.8% died, compared with 7.5% of the 2,769 patients given placebo.\n\n“If you reduce the bleeding you could save their life because they are bleeding more slowly,” said Roberts. “If you stop them bleeding it stops them developing a big bruise inside the head which can squash the brain and kill you.”\n\nBut time is of the essence, with the team finding early treatment more effective in these patients.\n\nThe study backs previous, smaller-scale research into the use of tranexamic acid for traumatic brain injury, and additionally shows that the drug does not increase disability, or raise the risk of events such as stroke.\n\n“Bearing in mind that 90% of head injuries are mild and moderate, this is very good news because you have got something that can prevent the bleeding into the brain that could kill them, and if they don’t die they are in good shape,” said Roberts.", "description": "Researchers say tranexamic acid treatment has potential to save tens of thousands of lives", "authors": ["Nicola Davis"], "top_image": "https://i.guim.co.uk/img/media/3f0c679d6b761214a90634812d05c1bd372d662b/0_30_5906_3543/master/5906.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3c537d97e22351709aaca28f57aad1f7", "published_at": "2019-10-14"}