{"pub": "yahoo", "url": "https://news.yahoo.com/mom-helped-daughter-beat-classmate-192526091.html", "downloaded_at": "2019-09-26 01:38:18.508383+00:00", "title": "Mom helped daughter beat up classmate at school bus stop, police say", "language": "en", "text": "NASHVILLE - A Nashville mother is facing criminal charges after Metro police say she helped her daughter beat up a classmate at a school bus stop.\n\nKalina Gaines, 30, was arrested after the 8:30 a.m. Monday incident at Murfreesboro Pike and Borowood Drive.\n\nAccording to an arrest affidavit, the victim was approached by Gaines and her daughter.\n\nGaines then ordered her daughter to begin assaulting the victim because of a reported incident between the two juveniles on Friday, the affidavit stated. It was not immediately known what the incident entailed.\n\nStudents on the bus filmed the assault, which police said showed Gaines and her daughter holding the victim on the ground while they both assault the victim.\n\nThe affidavit goes on to say that the victim told officers that Gaines kicked her in the face and struck her with her hands.\n\n'They videoed his death instead of helping': Suspect charged after teen stabbed to death as some in crowd filmed\n\nPolice said the video also shows Gaines holding the victim down while her daughter assaults the victim dozens of times.\n\nGaines was charged with assault and was released from the Metro jail on $7,500 bond. She's due in court next month for a hearing.\n\nFollow Natalie Neysa Alund on Twitter: @nataliealund.\n\nThis article originally appeared on Nashville Tennessean: Tennessee mom helped daughter beat up classmate at bus stop: Police", "description": "Kalina Gaines, 30, was arrested after the Monday 8:30 a.m. incident at a school bus stop.", "authors": ["Natalie Neysa Alund", "Nashville Tennessean"], "top_image": "https://s.yimg.com/uu/api/res/1.2/dBQYzq1Qt2TSkZKvMHnnFw--~B/aD03NzI7dz02MTc7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/usa_today_news_641/d59339dea00fc32e1d004abb3008c52c", "published_at": "2019-09-25"}