{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7548041/Killer-God-judge-tattooed-chest-escapes-Queensland-jail.html", "downloaded_at": "2019-10-07 23:37:03.731144+00:00", "title": "Killer with 'only God can judge me' tattooed on his chest escapes from a Queensland jail", "language": "en", "text": "A killer prisoner with multiple scars and tattoos including 'only God can judge me' has escaped from a Queensland jail.\n\nBodhi Johnson, 23, is on the run after breaking out from the Townsville Correctional Centre in Queensland at 8.50pm Monday.\n\nJohnson's tattoos also include a Kiwi fern with 'family' written on his inner right arm and 'RIP Mum 30/03/59 – 05/09/2013' on his left inner forearm.\n\nHe has a tattoo on his left ribs of hands holding a pistol and the word 'love' across his left hand.\n\nJohnson has a circular scar on his left ankle and a 20-centimetre scar below his right knee.\n\nBodhi Johnson (pictured), 23, absconded from Townsville Correctional Centre in Queensland on Monday night at about 8.50pm.\n\nThe 23-year-old was serving a six-year sentence for driving causing death, and was last seen wearing prison greens.\n\nHe was behind the wheel of a car that smashed into a power pole in Bowen, north Queensland killing his 22-year-old passenger Joseph Inch.\n\nThe prisoner fled the crash but went to the local hospital for treatment after suffering internal injuries and was charged by police.\n\nThe Townsville man has a number of tattoos, including the words 'only god can judge me' in cursive writing across his chest (pictured)\n\nJohnson is Caucasian, 173 centimetres tall, 53 kilograms, and was described by Queensland Police as slim with brown hair, blue eyes, and a fair complexion.\n\nPolice are conducting searches and carrying out enquiries.\n\nThey have warned anyone who sees him not to approach but to call triple-0 immediately.", "description": "Bodhi Johnson (pictured) escaped a Queensland prison on Monday night while serving a six-year sentence for driving causing death.", "authors": ["Charlotte Karp For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/23/19416970-0-image-a-5_1570487639473.jpg", "published_at": "2019-10-07"}