{"pub": "businessinsider", "url": "https://businessinsider.com/china-presence-in-pacific-means-for-taiwan-expert-explains-what-2019-10", "downloaded_at": "2019-10-05 22:56:12.377673+00:00", "title": "China is filling a 'strategic vacuum' in the Pacific left by the US and its allies, and that's bad news for Taiwan", "language": "en", "text": "Taiwan, which China considers to be a renegade territory, lost two of its few remaining allies in late September.\n\nChina has sought to win over Taiwan's allies, but those countries have their own reasons to embrace Beijing.\n\nVisit Business Insider's homepage for more stories.\n\nOn December 1, 2016, 22 countries had full diplomatic relations with Taiwan, an island nation seen as a breakaway province by its larger neighbor, China.\n\nOn December 2 that year, President-elect Donald Trump and Taiwanese President Tsai Ing-wen had what was thought to be the first phone call between a Taiwanese leader and a US president or president-elect since the US severed ties with Taiwan and recognized China in 1979.\n\nFor China, after that the gloves came off.\n\nRead more: Taiwan just lost its biggest ally in the Pacific to China, and the US may retaliate\n\nOn December 21, 2016, São Tome and Principe, an island country in West Africa, recognized China, as did Panama in 2017. El Salvador and the Dominican Republic followed in 2018. And in a four-day period in September this year, the Solomon Islands and Kiribati, both Pacific Island countries, left Taiwan behind.\n\nNow just 15 countries, five of them small Pacific islands, have full diplomatic relations with Taipei, compared to 180 that recognize Beijing.\n\nIn an email interview, Dr. Anna Powles, a senior lecturer at the Centre for Defence and Security Studies at New Zealand's Massey University and an expert on security issues in the Pacific, explained why countries are embracing Beijing, how the US and others have responded, and why some in the region aren't won over by those responses.", "description": "The benign neglect of the US and its partners in the Pacific created an opening for China, according to Dr. Anna Powles.", "authors": ["Christopher Woody"], "top_image": "https://image.businessinsider.com/5d97ec0c754caa1ae75e7e9d?width=1200&format=jpeg", "published_at": "2019-10-05"}