{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/liverpool-vs-arsenal-live-team-20758174", "downloaded_at": "2019-10-30 23:24:19.220439+00:00", "title": "Liverpool 5-5 Arsenal (5-4 on pens) RESULT: Curtis Jones fires winning penalty in 10-goal thriller", "language": "en", "text": "Fans in Anfield were treated to a 10-goal thriller as Liverpool and Arsenal could not be split after 90 minutes of Carabao Cup action.\n\nBut Curtis Jones scored the winning spot kick in the penalty shootout to ensure Liverpool progressed to the fifth round of the Carabao Cup.\n\nDivock Origi's goal deep into injury time had sent the game to penalties after the Gunners looked to have the game won.\n\nThe visitors had struck three goals to overcome a one-goal deficit at Anfield after Shkodran Mustafi had put the ball in his own net in the opening minutes.\n\nMustafi attempted to clear an Alex Oxlade-Chamberlain cross, but inadvertently turned it into his own net.\n\n(Image: Getty Images)\n\nLucas Torreira levelled for the Gunners when he was on hand to tap home after Caoimhin Kelleher had saved well from Bukary Saka.\n\nArsenal then put themselves firmly in the driving seat, thanks to a strikers brace from Gabriel Martinelli.\n\nThe Brazilian struck a rebound into the roof of the net from close range to complete the turnaround, before side-footing home a squared cross from Saka as Liverpool struggled to cope.\n\nThey were all over the place at the back, but were handed a lifeline before half-time when Harvey Elliott was fouled in the box.\n\n(Image: Getty Images)\n\nMartinelli steamed in to close Elliott down, but the Liverpool man flicked the ball past him and was clipped on the way.\n\nJames Milner duly stepping up to convert the spot kick as his side trailed 3-2 at the break.\n\nArsenal's two-goal advantage was restored at the beginning of the second half when Milner then dropped a clanger with a short back-pass which was punished by Ainsley Maitland-Niles, with help from Mesut Ozil.\n\nMaitland-Niles knocked the ball past Kelleher, before Ozil rescued it on the byline with a clever flick to allow his teammate to finish.\n\n(Image: Action Images via Reuters)\n\nLiverpool were not done yet though, as two screamers from Oxlade-Chamberlain and Divock Origi pulled them back level at 4-4.\n\nOxlade Chamberlain nipped in ahead of Maitland-Niles, before catching the ball on the half-volley to slam it over Emiliano Martinez and into the top corner.\n\nSoon after substitute Jones found Origi with a pass into feet, before the Belgian spun on a sixpence and hammered a shot that proved too powerful for the hand of Martinez.\n\n(Image: AFP via Getty Images)\n\nBut no sooner had Liverpool equalised, than Arsenal's Joe Willock produced some magic of his own, curling a 25-yard effort over Kelleher into the top corner, which looked to have the game won.\n\nAnd as the clock ticked down it was left to Origi to salvage the game for his side, slamming home a volley inside the box in front of the Kop end.\n\nBoth teams were deadly from the spot, until substitute Dani Ceballos saw his effort saved by Kelleher, allowing Jones to step up and be the hero.", "description": "A thrilling match saw Liverpool come from behind twice to equalise in injury time and win on penalties in the Carabao Cup", "authors": ["Darren Wells", "Image", "Getty Images", "Action Images Via Reuters", "Afp Via Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20761218.ece/ALTERNATES/s1200/0_Liverpool-FC-v-Arsenal-FC-Carabao-Cup-Round-of-16.jpg", "published_at": "2019-10-30"}