{"pub": "morningstar", "url": "https://morningstar.com/articles/946886/short-term-treasury-etfs-offer-safety-but-not-much-else", "downloaded_at": "2019-09-25 13:38:25.824517+00:00", "title": "Short-Term Treasury ETFs Offer Safety, but Not Much Else", "language": "en", "text": "Short-term Treasuries are among the safest assets available to investors. They carry virtually no credit risk and little interest-rate risk. They’ve also tended to do well when stocks haven’t. Additionally, the opportunity cost of investing in an ultra-safe asset like short-term Treasuries is not as steep now as it has been historically. This is because the yield curve has been fairly flat, meaning that investors have not been compensated for taking additional risk.\n\nThe Case for Short-Term Treasury ETFs\n\nExhibit 1 below illustrates the safety of an investment in a short-term Treasury fund compared with the Bloomberg Barclays Aggregate Bond Index and the S&P 500. Over the 15 years through August 2019, the Bloomberg Barclays U.S. Treasury 1-3 Year Index, which includes original term U.S. Treasury bonds with between one and three years until maturity, generated the fewest number of negative monthly returns and had the shallowest drawdowns. Over this same stretch, the index’s standard deviation was nearly 2 percentage points lower than the aggregate bond index and over 10 percentage points less than S&P 500.\n\nExhibit 2\n\n\n\n\n\nFurther analysis revealed that there were only three months in which the Bloomberg Barclays U.S. Treasury 1-3 Year Index lost more than half a percent. There were 32 such months for the Bloomberg Barclays Aggregate Bond Index and 52 for the S&P 500.\n\nAccording to data provided by the Federal Reserve Bank of Minneapolis[1], the average annual rate of inflation during the 15 years through 2018 was approximately 2.10% (as measured by percentage changes in the Consumer Price Index). Although the Bloomberg Barclays U.S. Treasury 1-3 Year Index’s annualized 15-year return through August 2019 of 2.13% does not inspire caviar dreams, investors seeking capital protection would have been satisfied. Investors should bear in mind that while the principal protection is a near-given, the return on short-dated Treasuries will fluctuate with movements in interest rates. For example, the Bloomberg Barclays U.S. Treasury 1-3 Year Index fell by 0.12% in September 2018 after the Fed raised interest rates by 25 basis points.\n\nLike most of Morningstar’s top-ranked fixed-income exchange-traded funds, the highest-rated short-term Treasury ETFs are market-value-weighted. Market-value weighting a short-term Treasury portfolio reflects the market’s intuition about the value of each issue and tilts it toward the largest issues in the market, which tend to be easy to obtain and cheap to trade.\n\nThe Treasury market is efficient and liquid, reflecting the market’s inflation and interest-rate expectations, and Uncle Sam is the only issuer here. It is not reasonable to expect an active manager to generate higher returns without also introducing more risk to the portfolio. Indexing makes sense as a means of capturing this opportunity set because the return potential is limited, thus raising the relative importance of fees--which are lower for index trackers.\n\nShort-Term Treasury ETFs for Consideration\n\nThere are three Morningstar Medalists on the menu of short-term Treasury ETFs. Vanguard Short-Term Treasury ETF (VGSH), Schwab Short-Term Treasury ETF (SCHO), and iShares 1-3 Year Treasury Bond ETF (SHY) all track market-value-weighted indexes of U.S. Treasury bonds with one to three years until maturity and sport low fees.\n\nVanguard Short-Term Treasury and Schwab Short-Term Treasury each receive Morningstar Analyst Ratings of Silver. Both funds track Bloomberg Barclays-sponsored indexes of U.S. Treasury bonds, which include issues with one to three years remaining to maturity and at least $300 million in outstanding face value. Both indexes are rebalanced on the last calendar day of each month.\n\niShares 1-3 Year Treasury Bond has a Bronze rating and tracks the ICE U.S. Treasury 1-3 Year Bond Index. As with the others, qualifying bonds must have at least $300 million in outstanding face value. Each fund’s index is rebalanced monthly.\n\nAs expected, these three funds have very similar portfolios, as illustrated in Exhibit 3.\n\nExpense ratios are extremely important in comparing short-term Treasury ETFs because return potential is limited in this narrow opportunity set. Exhibit 4 illustrates that the main distinguishing point between the Silver-rated funds and the Bronze-rated fund is the annual expense ratio.\n\nOther Cash-Safe Alternatives\n\nExchange-traded funds tracking short-term Treasury indexes are hardly the only option available to investors seeking safety. Other vehicles can act as a defensive component to a portfolio and protect against the eroding power of inflation. Some of these are deposit products, which have the added benefit of being FDIC-insured, thus carrying no potential for loss on amounts up to $250,000.\n\nHigh-yield savings accounts are available through FDIC-insured banks. The rates offered on these accounts vary widely, as can the required minimum deposit, and they can change at the discretion of the bank. Although they are also variable by bank, an investor can easily find a high-yield savings account that does not charge a monthly fee. While the yields offered by some banks are quite paltry, a diligent investor can easily find an institution that offers a higher yield on a savings account. For example, the annual percentage yields currently (as of Sept. 16, 2019) offered by both Marcus by Goldman Sachs and Barclays are both 2% and neither requires a minimum deposit. Funds held in high-yield savings accounts are very liquid and can be easily withdrawn, although some institutions do carry a nominal penalty for accounts closed within 180 days.\n\nA money market deposit account is very similar to a savings account (much more so than a money market mutual fund). It is a type of deposit account available through a bank and is insured by the FDIC. Much like high-yield savings accounts, the rates available to investors and the required minimal deposit to open an account vary widely by bank. According to the Federal Deposit Insurance Corporation[2], the national average rate earned on a savings account in the U.S. as of September 2019 was 0.30%. As is the case with high-yield savings accounts, investors who conduct their own due diligence will be rewarded, as there are many options offering higher yields. For example, the APY (as of Sept. 16, 2019) offered by BBVA was 2.40% with a minimum initial deposit of $10,000; CIBC Bank USA offered 2.20% APY without a minimum initial deposit amount. Although variable by bank, the typical money market deposit account offers check-writing ability while the typical high-yield savings account does not, an advantage for those investors who might need emergency access to their funds. For that reason, investors acutely worried about liquidity might prefer this option.\n\nA money market mutual fund is a type of mutual fund that invests in short-term and highly liquid securities. As it is a security and not a deposit account, this instrument is available through registered securities dealers and is not FDIC-insured. While the risk is small, these funds carry the potential for loss of principal. There are thousands of different money market mutual funds issued by many investment companies; fund size, return potential, and expenses vary across products. According to data from Morningstar Direct, the average 12-month yield and annual expense ratio for money market mutual funds were 1.67% and 0.47%, respectively, as of this writing. The key advantage of a money market mutual fund over a short-term Treasury ETF is its volatility. Over the trailing 15 years ended August 2019, the standard deviation of the Bloomberg Barclays Aggregate Bond Index was 1.25, while the category average for money market mutual funds was only 0.46. Money market mutual funds seek to maintain a stable net asset value of $1.00, so this low level of volatility is to be expected. Additionally, their returns are less correlated to the S&P 500, a boon for investors seeking additional diversification.\n\nLong-term investors understand business cycles and the need for a defensive component to their portfolio to protect against inflation and the potential for loss of principal. An investment in a market-value-weighted short-term Treasury ETF is a solid choice, and any of the three previously discussed would cheaply and efficiently capture this opportunity set, while seldom experiencing significant losses. But there are other options for investors. Those who want to guarantee principal for investments up to $250,000 could consider higher-yielding deposit accounts, like a savings account or a money market deposit account. The yields offered on these products are dependent upon the institutions offering them and always subject to change. Additionally, investors could opt for a money market mutual fund.\n\n[1] https://www.fdic.gov/regulations/resources/rates/\n\n[2] https://www.minneapolisfed.org/community/financial-and-economic-education/cpi-calculator-information/consumer-price-index-and-inflation-rates-1913\n\nDisclosure: Morningstar, Inc. licenses indexes to financial institutions as the tracking indexes for investable products, such as exchange-traded funds, sponsored by the financial institution. The license fee for such use is paid by the sponsoring financial institution based mainly on the total assets of the investable product. Please click here for a list of investable products that track or have tracked a Morningstar index. Neither Morningstar, Inc. nor its investment management division markets, sells, or makes any representations regarding the advisability of investing in any investable product that tracks a Morningstar index.", "description": "These ETFs protect against inflation and the potential for loss of principal.", "authors": [], "top_image": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blt7048ded048fcc8e5/5cb4f4f6fe8386be234ac90f/ContentPackage_Portfolio_StyleBoxMedalStripsCloudsCharts_1x1.jpg", "published_at": "2019-09-25"}