{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7623993/Jennifer-Aniston-Reese-Witherspoon-look-classic-black-dresses-Morning-premiere.html", "downloaded_at": "2019-10-29 06:15:28.419395+00:00", "title": "Jennifer Aniston and Reese Witherspoon look classic in black dresses at The Morning Show premiere", "language": "en", "text": "Advertisement\n\nTogether they star in Apple's flagship drama, The Morning Show, on the new streaming platform AppleTV+.\n\nAnd on Monday night Jennifer Aniston and Reese Witherspoon were stunning at the premiere of their show, that premieres on November 1.\n\nBoth ladies looked classic in black dresses as they led stars on the carpet in New York City.\n\nLeading ladies: Jennifer Aniston and Reese Witherspoon were stunning at the premiere of their show, The Morning Show, in NYC on Monday night\n\nMatching: Both ladies looked classic in black dresses as they led stars on the carpet\n\nAfter a full day of press in NYC, the star's posed together on the black carpet at David Geffen Hall.\n\nThe former Friends star, Jen, wore a long black sheath gown that featured a high-neck and was sleeveless.\n\nShe kept her shoulder length hair down in a middle part and loose beachy waves.\n\nThe 50-year-old actress seemed to keep accessories to a minimum as she only included gold leaf, dangle earrings and black open toe heels.\n\nTogether: They posed on the carpet together before heading inside David Geffen Hall\n\nSky high: The former Friends star, Jen, wore a long black sheath gown that featured a high-neck and was sleeveless\n\nAccessories: The 50-year-old actress seemed to keep accessories to a minimum as she only included gold leaf, dangle earrings and black open toe heels\n\nJen, who is making her first return in a main TV role since Friends ended in 2004, also kept her glam simple.\n\nHer bright blue eyes still caught attention, with her lined eyelook, with rosy cheeks and a glossy natural lip.\n\nMeanwhile her co-star Reese donned a sequined knee-length dress and a pair of Louboutin heels.\n\nHer strapless black Celine dress featured a thick gold strip at the top and the tight silhouette showed off her figure.\n\nGlam: Her bright blue eyes still caught attention, with her lined eyelook, with rosy cheeks and a glossy natural lip\n\nClassic: Meanwhile her co-star Reese donned a sequined knee-length dress and a pair of Louboutin heels\n\nDesigner: Her strapless black Celine dress featured a thick gold strip at the top and the tight silhouette showed off her figure\n\nThe 43-year-old star showed of her decolletage with her blunt blonde bob haircut that she kept pushed behind her ears.\n\nReese also opted for simple accessories as she donned Taffin Jewelry, black and silver dangle earrings and a black jewel ring.\n\nShe also opted for a darker makeup look, done by her makeup artist Kelsey Deenihan, with a dark smokey eye, and a perfect blush complexion.\n\nAccessories: Reese also opted for simple accessories as she donned Taffin Jewelry, black and silver dangle earrings and a black jewel ring\n\nBumpin: Ashley Graham showed off her baby bump on the carpet in a black high neck and black strappy heels\n\nPretty in pink: Emmy Rossum stunned in an all pink hued outfit of a pink suit and heels\n\nIn The Morning Show Jennifer stars as Alex Levy who is the anchor of the namesake morning news program.\n\nThe program centers on the anchor after her longtime co-host Mitch Kessler (Steve Carell) is fired after allegations of sexual misconduct and she begins to fight back at network execs to keep her job and set a new path for her career.\n\nReese plays Bradley Jackson, a young journalist who is a harsh critic of Alex's show and is seen as her successor.\n\nBilly Crudup and Mark Duplass also star in the show as a network exec and the executive producer, respectively.\n\nMatching liner: The former Shameless star matching her eyeliner to her pink outfit\n\nMatching Emmy: Wendy Williams also wore a pink suit-style outfit but her's was oversized\n\nBright: Lena Waithe looked casual and cool in a bright yellow jacket, acid washed jeans, green sneakers and a grey hoodie\n\nWhile Crudup, Carell, and other big name stars were absent from the premiere, some of the show's more minor characters were sure to come out.\n\nBel Powely looked classic in a white and blue tulle gown, with a high neck and puffed sleeves. She plays production assistant Claire Canway.\n\nJanina Gavankar, who plays Alison Namazi, stunned in a black lace gown with a high neckline. There were cutouts on both sides of her abdomen and most of the dress was sheer around the lace, peaking at her under garments.\n\nOther stars including Emmy Rossum, Mindy Kaling, Naomi Watts and Wendy Williams came out to support the premiere.\n\nThe show seems to be a big hit among news media as well as George Stephanopoulos, Gayle King and Elaine Welteroth in attendance, among others.\n\nPink theme: Katie Aselton wore a plunging pink tea length dress and silver stilettos\n\nKeeping warm: Amy Sedaris wore a red plaid dress and a grey hoodie over it\n\nDaring to go sheer: Janina Gavankar, who plays Alison Namazi, stunned in a black lace gown with a high neckline, the skirt was sheer and peeked at her under garments\n\nEach episode of the show cost $15 million to make, according to The Hollywood Reporter, and has already been green lit for a second season, for a two season total of $300 million.\n\nViewers will get the first three episodes on Friday before releasing episodes weekly, exclusively on AppleTV+, also launching on Friday for $4.99 a month.\n\nCritics were given a sneak peak of the show's first three episodes, and by Monday morning it had a Metacritic score of 60 and a 71 on Rotten Tomatoes.\n\nThe reviews were consistent in critiquing the show, finding the first and second episodes bland and the third being when it begins to pick up pace and change what was established in the first two.\n\nGuest star: Mindy Kaling, who guest stars in the show, matched the leading ladies in a black dress, that had a strapping asymmetrical top\n\nFloral: Naomi Watts cut an elegant look in a cream colored, floral dress and pink stilettos with a diamond encrusted strap\n\nDotty: Jodi Balfour in a black lace top and pink polka dot skirt\n\nThe stars were praised for their performances, with Entertainment Weekly's Kristen Baldwin saying Aniston '\"gives a forceful performance,' and IGN's Rosie Knight said that Witherspoon 'is easily the highlight of the show, adding righteous anger to a morally compromised reporter.'\n\nMuch of the criticism was aimed at the writing and creative direction of the show, which Aniston and Witherspoon executive produce.\n\nFrom THR critic Daniel Feinberg said the show seemed to be 'struggling and floundering to find its focus, tone and attitude toward its main characters,' but that by the end of the third episode it becomes 'more satisfying and confident.'\n\nFeinberg wrote 'the third episode points to a series in which Aniston, Witherspoon and Crudup could make this backdrop fun to watch. But for what is allegedly one of the most expensive shows in TV history, and for what is certainly a pivotal show in the burgeoning Streaming Wars, one out of three isn't good enough for a recommendation yet.'\n\nThe gig: UK actress Bel Powley, who plays a PA on the show, cut a unique style in tulle white and blue dress with puffed sleeves\n\nRecurring: Michelle Meredith recurs as Lindsey Sherman, she wore a black and silver leopard print pantsuit and a black bustier top\n\nMain: Victoria Tate wore a silver mini dress and black booties, she stars as Rena Robinson\n\nPop of color: Amber Friendly, who stars as Layla Bell, wore a long sleeved silver dress and paired it with bright red heels and clutch\n\nBen Travers from IndieWire said it trusts its story without knowing what it’s trying to say. All the pretty people in the world can’t keep you hooked when the purpose is this muddled.'\n\nWhile Paste's Amy Amatangelo was more mild in saying 'is perfectly fine, but not exactly what one would hope for when discussing the crown jewel of the streaming launch...You need more than fine. You need to break the mold.'\n\nThe show tackles the topical #MeToo movement in the world of morning news casts that as of last week are still grappling with accusations against anchors from Matt Lauer to Charlie Rose.\n\nMatching liner: Krys Marshall also matched her purple tulle dress to her eyeliner\n\nFormer EIC: Elaine Welteroth, former editor in chief of Teen Vogue, looked powerful in a blue plaid pantsuit\n\nAnchor: Gayle King came out in a nude dress and heels and a colorful clutch", "description": "On Monday night Jennifer Aniston and Reese Witherspoon were stunning on the red carpet for the premiere of their show that premieres on November 1.", "authors": ["Kellie Chudzinski For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/06/20313234-0-image-a-139_1572329470394.jpg", "published_at": "2019-10-29"}