{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/3/fiji-boosts-rwc-with-7-try-romp-in-45-10-win-vs-ge", "downloaded_at": "2019-10-03 08:31:15.832329+00:00", "published_at": "2019-10-03", "title": "Fiji boosts RWC chances with 7-try, 45-10 win over Georgia", "language": "en", "text": "OSAKA, Japan (AP) - Fiji boosted its flagging Rugby World Cup campaign with seven tries and scintillating attacking rugby in a 45-10 win against Georgia on Thursday.\n\nThe heavy rain did not affect Fiji’s running game, which proved far too strong for a Georgia lineup hoping to seal third place in Pool D with a win, which would have ensured automatic qualification for the 2023 World Cup.\n\nInstead, Fiji has moved ahead of Georgia and provisionally over Australia into second place.\n\nFiji is still to face group leader Wales and Georgia is up against two-time champion Australia, which has played one less game than Fiji.\n\nAs the rain poured down at Hanazono Rugby Stadium on the outskirts of Osaka, Fiji failed initially to capitalize on a bright start.\n\nBut it was a sign of things to come when Waisea Nayacalevu’s spectacular first try put Fiji ahead midway through a rain-soaked first half where Georgia Soso Matiashvili missed one penalty goal and slotted over another to make it 7-3 at the break.\n\nThen the tries came thick and fast _ one from Georgia’s veteran flanker Mamuka Gorgodze, and then six from the flying Fijians who thrilled the crowd with one-handed passes and some spectacular running.\n\nLeft wing Semi Radradra scored two tries, with the other four coming from scrumhalf Frank Lomani, right winger Josua Tuisova, flanker Semi Kunatani and replacement lock Api Ratuniyarawa.\n\nWith Fiji’s forwards as slick as the backs, Georgia was simply overwhelmed.\n\nIn the first half the scrums were evenly contested, with Georgia getting the upper hand at times.\n\nFollowing a high Fiji tackle in the 15th minute, Matiashvili took the penalty goal from about 30 meters out wide on the right. The flag went up, then down, and three Georgia points were rubbed off the scoreboard.\n\nMinutes later, a moment of typical Fiji improvisation caught Georgia cold as Radradra did well to stop flyhalf Ben Volavola’s grubber kick going out. He showed good hands to feed the ball quickly and accurately inside to the surging Nayacalevu, who sprinted clear.\n\nVolavola clipped over the first of his five conversions and was not needed for penalty goals, given the rampant mood Fiji was in after the sheer disappointment of losing its second group game to Uruguay in one of the tournament’s big upsets.\n\nThis was far more like the Fiji which led Australia at halftime, before losing that one, too.\n\nNayacalevu should have had a second try in the first half after a superb passing move cut Georgia open, but he fumbled midfield partner Levani Botia’s pass inside and admonished himself after tumbling face-first into the wet turf.\n\nGeorgia then launched a brilliant attack from deep in its own half, carving Fiji open at speed with some great handling.\n\nAfter left wing Alexander Todua and scrumhalf Vasil Lobzhanidze were held up, lock Konstantine Mikautadze emerged through a scrum but knocked on with the try-line in sight.\n\nTodua had been high tackled near the neck area, however, and Matiashvil kicked the penalty goal to make it 7-3.\n\nThe sides traded tries early in the second half, and then it was time for the crowd to sit back and enjoy 30 minutes of the Fiji show.\n\n___\n\nMore AP Rugby World Cup: https://www.apnews.com/RugbyWorldCup and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Fiji boosted its flagging Rugby World Cup campaign with seven tries and scintillating attacking rugby in a 45-10 win against Georgia on Thursday.", "authors": ["The Washington Times Http", "Jerome Pugmire"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/03/japan_rugby_wcup_georgia_fiji_35637_c0-110-2631-1644_s1770x1032.jpg?b6c946683a07ca15f9475f4e38d4490281a2ed7a"}