{"pub": "businessinsider", "url": "https://businessinsider.sg/la-eatery-lobsterdamus-has-a-pop-up-at-rws-the-great-wine-dine-festival-where-the-food-absolutely-blew-me-away", "downloaded_at": "2019-10-11 13:06:20.980184+00:00", "title": "LA eatery Lobsterdamus has a pop-up at RWS’ The Great Wine & Dine Festival, where the food absolutely blew me away", "language": "en", "text": "Lobsterdamus, a cult-favourite eatery from Los Angeles, is in Singapore for the very first time at The Great Wine & Dine Festival held at Resorts World Sentosa Singapore. Business Insider/Jessica Lin\n\nThere’s probably nothing Singaporeans love more than food, and many of us probably wouldn’t mind travelling across the seas just to taste some of the world’s most celebrated cuisines and dishes.\n\nThanks to a vibrant events scene, good food always seems to find its way to our sunny shores. And while you still have to cross the sea to get to Lobsterdamus’ first-ever pop-up in Singapore, I’m grateful it’s just a two-minute drive away from the mainland.\n\nThe cult-favourite lobster joint from Los Angeles is being hosted at Resorts World Sentosa’s wine and food festival for two days only – Friday (Oct 11) to Saturday (Oct 12).\n\nI visited the event in hopes of finding something to rave about and guess what? They don’t call it The Great Wine & Dine Festival for nothing.\n\nHere’s everything foodies will love at the festival, but hurry, because doors close at 10pm on Saturday night.\n\nThe Great Wine & Dine Festival is held at the West Ballroom in Resorts World’s Convention Centre.\n\ncaption There’s an entrance right next to McDonald’s. source Business Insider/Jessica Lin\n\nThe set-up was pretty welcoming. A lot of effort went into creating a charming and relaxed atmosphere.\n\nEntrance to the festival is free for RWS Invites members, but visitors will need to buy tickets to be able to taste the wines being exhibited.\n\ncaption Fairy lights all around. source Business Insider/Jessica Lin\n\nWines take up most of the focus at the festival this year, especially since RWS just held its first-ever Wine Pinnacle awards on Thursday (Oct 10).\n\ncaption Bottles and bottles of wine line the entrance. source Business Insider/Jessica Lin\n\nEach pass entitles the visitor to wine and sake tasting samples, which you will be given a wine cup (standard pass) or glass (premium pass) for.\n\nTickets cost from S$60 for a standard pass (S$42 for members) to S$100 for a premium pass (S$78 for members).\n\nOf course, you’ll also be given food credits – S$15 on a standard pass and S$40 on a premium pass – which you can top-up if you wish to buy more.\n\ncaption The plastic wine cup (left) and the wine glass for ticket holders. source Business Insider/Jessica Lin\n\nUpon entering, you’ll be greeted with what seems like an endless row of wine retailers.\n\ncaption Wine lovers, go crazy. source Business Insider/Jessica Lin\n\nUnlike most other food festivals, there is plenty of seating and spacious walkways at RWS’ event.\n\ncaption You don’t have to squeeze, and probably won’t have to wait long for a seat. source Business Insider/Jessica Lin\n\nSeating is definitely not an issue if you have a premium pass. The cordoned-off area next to Euraco Finefood is reserved for these ticket-holders.\n\ncaption source Business Insider/Jessica Lin\n\nMy first dish was the Porchetta, Marsala e soffice di Patate al Tartufo from Fratelli Trattoria, a restaurant located in Hotel Michael, RWS.\n\nUnlike its very cumbersome and difficult-to-remember name, this slow roasted Spanish pork belly is probably etched in my memory for a lifetime now.\n\nI wasn’t expecting it to be as crisp, or as tasty, or as light on the mouth as it turned out to be. In fact, this was my absolute favourite item at the entire festival, and I don’t even usually enjoy eating pork belly or pork crackling.\n\ncaption I was completely blown away by Fratelli’s pork crackling, even though it’s not a food I usually enjoy. source Business Insider/Jessica Lin\n\nJust listen to that crunch.\n\nIf you’re a pasta-lover, Fratelli’s Gnocchetti alla Pescatora is a dream. The homemade potato dumplings are cooked to perfection, and biting into them reminded me of some home-style Italian restaurants in Europe.\n\ncaption It also goes perfectly with Italian wine. Ask for a recommendation! source Business Insider/Jessica Lin\n\nYou can expect the longest queues at Lobsterdamus’ stall, since it’s the most exclusive food offering you’ll find at the festival.\n\nThe Maine attraction (pun intended) is of course the Lobster Nest, which is a grilled half-lobster paired with garlic noodles.\n\nIts generous serving of yellow noodles reminded me of mee goreng, while the lobster was incredibly juicy. The flesh was sweet, bouncy and had a smoky char-grilled flavour that took my mind straight to the ocean.\n\ncaption Happy to report that you will not regret the wait. source Business Insider/Jessica Lin\n\nNot to be missed is the lobster truffle fries, which tastes as amazing as its name sounds. These chips had a satisfying crunch and delightful garlic umami.\n\nIt’s absolute heaven when eaten together with the lobster shreds and truffle mayo that’s heaped on top.\n\ncaption I brought this back to the office, and it was delicious even when soggy. source Business Insider/Jessica Lin\n\nWith one Michelin star in this year’s Singapore guide, table65 cooks and plates its food to impress.\n\nIf you’re not sure what to try, the tender roast duck breast with berries, sauce royale and oxtails is highly recommended.\n\ncaption 100 marks for presentation too. source Business Insider/Jessica Lin\n\nAnd of course, there’s foie gras. This version sits in a special seaweed and ginger broth with umeboshi (pickled plum) sauce.\n\ncaption source Business Insider/Jessica Lin\n\nFor beef lovers, Teppan’s grilled beef steak sandwich with Japanese barbecue sauce is slam dunk.\n\ncaption Looks simple, but it’s actually a beef masterpiece. source Business Insider/Jessica Lin\n\nCraving a little sugar? Teppan is also serving this decadent yuzu soya milk soft serve topped with choux puffs.\n\ncaption Try not to drool. source Business Insider/Jessica Lin\n\nAnd of course there’s also Ben & Jerry’s, because why not?\n\ncaption Shoutout to the friendly scooper who gamely smiled for this photo! source Business Insider/Jessica Lin\n\nI couldn’t drink because I had driven to the event, but the nice folks at 1855 The Bottle Shop gave me a tasting of one of their products – the highly-rated 2015 Castello di Monsanto Chianti Classico Riserva.\n\nIt tasted sophisticated and tart.\n\ncaption source Business Insider/Jessica Lin\n\nAlong with 26 other wine booths, the store is selling some of its best wines at special prices for festival-goers.\n\ncaption source Business Insider/Jessica Lin\n\nSome of the shop’s most interesting latest releases include Kungfu Girl from Washington. It’s touted as being a great accompaniment to Asian food.\n\ncaption source Business Insider/Jessica Lin\n\nAnother highly-recommended bottle is The Prisoner from California, which has received wonderful reviews from connoisseurs.\n\ncaption These bottles are perfect for gifts too. source Business Insider/Jessica Lin\n\nThere’s also a showcase of Japanese sake from eight different breweries.\n\nOnly limited quantities are available for sale, so good luck!\n\ncaption source Business Insider/Jessica Lin\n\nIf you love wine, you’ll be spoilt for choice. There’s so much to choose from!\n\ncaption source Business Insider/Jessica Lin\n\nAnd if you need help deciding what to get, some of the nominees from the event’s Wine Pinnacle Awards are also available for sampling and sale at the event.\n\ncaption You can find the list of nominees and winners at the entrance. source Business Insider/Jessica Lin\n\nRead also:", "description": "Business Insider - Hours later, I'm still thinking of Fratelli's crispy pork belly and incredibly juicy lobster from Lobsterdamus.. Read more at businessinsider.sg", "authors": ["Jessica Lin"], "top_image": "https://static.businessinsider.sg/sites/2/2019/10/20191011-GWDF-lobsterdamus-fries02.jpg", "published_at": "2019-10-11"}