{"pub": "cnbc", "url": "https://cnbc.com/2019/10/11/profits-expected-to-fall-as-earnings-season-kicks-off-in-the-week-ahead.html", "downloaded_at": "2019-10-11 19:44:18.367340+00:00", "title": "Profits expected to fall as earnings season kicks off in the week ahead", "language": "en", "text": "The third-quarter earnings season kicks off in the coming week, and it is likely to expose how much the trade war has cost companies' bottom lines.\n\nFirst out of the gate are major banks and financial companies, with J.P. Morgan, Citigroup, Wells Fargo, BlackRock and Goldman Sachs reporting Tuesday. But by the end of the week, a smattering of industrial, tech, transportation and consumer names will have reported, including Alcoa and Honeywell. Netflix and IBM report Wednesday, and consumer giant Coca-Cola reports Friday. United Airlines reports Tuesday, and CSX reports Wednesday.\n\nBesides earnings, some important economic reports are being released, including retail sales on Wednesday and industrial production Thursday.\n\nEarnings for the S&P 500 are expected to decline by 3.1% for the third quarter, after growing by more than 3% in the second quarter, according to data from Refinitiv. For the second quarter, earnings were also expected to be negative to flat, but results beat lowered expectations.\n\n\"The story of are we going to be negative, or are we not going to be negative, is going to be in focus,\" said Patrick Palfrey, senior equity strategist at Credit Suisse.\n\nPalfrey said margins are being pinched in several areas, including energy, with the decline in oil prices. Oil has been responding more to worries about global growth and trade wars than to geopolitical developments that normally could drive it higher. West Texas Intermediate crude was down 7.5% in the third quarter.\n\n\"We are of the view that companies will likely devote a significant portion of their time talking about the impact of trade tariffs,\" Palfrey said. \"The goal is to ascertain just how much the decline in earnings is coming from those pressures.\"\n\nThe decline in oil prices, in fact, are expected to drag down profits in the energy sector. Earnings for the energy sector are expected to be down 32%, while revenues are expected to fall by 9.5%, according to Credit Suisse. Margins for the sector are expected to contract by 22.7%. Without energy estimates included, S&P profits would be down just 1%, according to Refinitiv.\n\n\"We think margins are going to subtract 5.9% from EPS growth of the S&P 500,\" said Palfrey. He projects earnings overall to decline by 4.2%, and he does not expect the stock market to make much headway during the earnings season.\n\n\"I think we're moving sideways. The real backstop is the environment, while under pressure, it is nonrecessionary, and that will ultimately prevent the market from materially selling off,\" said Palfrey.\n\nPalflrey said a group he calls \"tech plus,\" which include tech and communications companies, have taken some of the biggest margin hits this quarter even though revenue growth remains solid. Six of the top 10 companies whose margins impacted S&P earnings growth the most are from that group, including Alphabet , Amazon, Apple, Facebook, IBM and Micron.\n\nAs a group, their margins are expected to contract by 14.8%, compared with 3.6% for all other S&P 500 companies combined.\n\nExxonMobil and Occidental Petroleum are on the list of companies with the biggest margin hits. Exxon for example saw a decline in margins of 34%, and Credit Suisse estimates that pared 0.6% off overall S&P 500 earnings growth. Credit Suisse says the consensus decline in Amazon margins is expected to be 42.5%, denting S&P earnings growth by 0.3%.\n\n\"At least for earnings, it's a relatively positive backdrop. We should see a little bit of clarity on the whole China trade,\" said Paul Hickey, co-founder of Bespoke. Hickey said in the past two quarters, stocks did well at the start of the reporting season, but they were then derailed by trade developments in the latter part of the earnings period.\n\nPalfrey said the market is being held back by several factors, including the slowdown in the manufacturing sector. \"I think it's going to be difficult for the market to move meaningfully higher without an improvement in industrial data and without the yield curve becoming uninverted,\" he said.\n\nISM manufacturing data has been weakening and has shown a contraction in activity for the past two months.\n\nThe inverted yield curve is a bond market recession warning. When the curve is inverted, shorter duration securities yield more than longer duration securities, meaning investors are demanding a higher yield to hold investments for a much briefer time. In this case, the 3-month Treasury bill was yielding about 11 more basis points than the 10-year note.\n\nHickey said there could be some positives in the earnings season, like last quarter. Negative revisions of earnings estimates by analysts are outnumbering positive revisions by about 2 to 1. He noted in the last two quarters, stocks responded well to earnings news in the beginning of the reporting period but then faded when negative headlines on trade in the latter part of each earnings season.\n\n\"Expectations seem pretty low. We've had analysts' downward revisions remain elevated, as they've been heading into prior warning seasons. But we haven't necessarily seen the number of warnings from companies rising,\" he said. \"It could be a positive divergence that analysts are lowering earnings estimates at a higher-than-average rate, but companies aren't warning at a higher-than-average rate.\"\n\nFinancial companies profits are expected to be up by 1.4%, and real estate is expected to see the best profit growth with a gain of 2.7%, according to Refinitiv. The information technology sector is expected to see a profit decline of 7.6%, and communications is expected to be 1% lower, according to Refinitiv. Materials is expected to see the biggest decline after energy. Sensitive to global growth and manufacturing, the sector's earnings are expected to fall 11.1%.\n\nDespite the downbeat expectations for third-quarter earnings, companies may issue more positive outlooks depending on how the U.S.-China trade talks end. Investor confidence around a limited trade deal grew on Friday after President Donald Trump said the talks were going well. Trump was scheduled to meet with Chinese Vice Premier Liu He at the White House at 2:45 p.m. ET.\n\nStocks rallied Friday on the upbeat trade expectations. The Dow Jones Industrial Average, S&P 500 and Nasdaq Composite were all up more than 1%. The Dow and S&P 500 were also up around 1% for the week and were set to snap a three-week losing streak.", "description": "When the third-quarter earnings season kicks off in the coming week, it is likely to expose the trade war's impact on corporate bottom lines.", "authors": ["Patti Domm", "In"], "top_image": "https://image.cnbcfm.com/api/v1/image/106119748-1568047616108dsc00358.jpg?v=1568047620", "published_at": "2019-10-11"}