{"pub": "fox", "url": "https://foxnews.com/media/john-solomon-says-new-hunter-biden-related-doc-shows-significant-shift-in-factual-timeline", "downloaded_at": "2019-10-09 10:50:13.116331+00:00", "title": "Document reveals Ukraine had already reopened probe of Hunter Biden-linked firm months before Trump phone call", "language": "en", "text": "A newly unearthed document shows that Ukrainian officials had opened a new probe into the firm linked to Hunter Biden months before President Trump's phone call with that country's leader, Fox News contributor John Solomon reported late Tuesday.\n\nSolomon said Tuesday on \"Hannity\" that the U.S. government knew Ukraine was planning to look again into activities at Burisma Holdings, an energy company that employed then-Vice President Joe Biden's son as a member of its board of directors, early this year. The report is noteworthy because President Trump has been accused by Democrats of threatening in July to withhold foreign aid to Ukraine unless its new president pursued an investigation into the company and the younger Biden's role there.\n\n\"The U.S. government had open-source intelligence and was aware as early as February of 2019 that the Ukrainian government was planning to reopen the Burisma investigation,\" he claimed. \"This is long before the president ever imagined having a call with President Zelensky,\" he added, noting Petro Poroshenko was still Ukraine's president at that time.\n\nBIDEN'S CAMPAIGN LIKELY COMING TO AN END -- THANKS TO CLINTON-LINKED UKRAINE BOMBSHELL, NUNES SAYS\n\n\"This is a significant shift in the factual timeline.\"\n\nSolomon said the information he obtained, including documents shown on \"Hannity\" Tuesday, was omitted from a U.S. intelligence community whistleblower's complaint lodged against Trump last month.\n\nSolomon said that NABU -- an FBI-like anti-corruption agency in Ukraine -- requested the probe into Burisma and owner Mykola Zlochevsky be reopened earlier this year. The investigation then went forward, Solomon said. The new probe later resulted in a \"Notice of Suspicion\" being filed, alleging the existence of \"illicit funds\" running through the firm, Solomon also claimed.\n\nSince the initial story broke, presidential candidate Joe Biden has sought to play down allegations made by Trump against his 49-year-old son's role with Burisma.\n\nThe Democrat also faced criticism from Trump and his allies after a video resurfaced showing the ex-vice president appearing to brag about pressuring to get a Ukrainian prosecutor fired. That prosecutor, Viktor Shokin, also had been looking into Burisma.\n\nWHITE HOUSE ANNOUNCES IT WILL NOT COMPLY WITH 'ILLEGITIMATE AND UNCONSTITUTIONAL' IMPEACHMENT INQUIRY\n\nOn \"Hannity,\" Solomon said his reporting revealed the requested reopening of the probe into Burisma involved, in part, \"unusual transactions\" in the natural gas giant's accounts.\n\nSolomon said the timeline of the alleged \"illicit funds\" coincided in part with the time Hunter Biden held a place on the firm's board. The younger Biden was reportedly paid as much as $1 million per year for his time on the board, but Solomon said investigators in Ukraine filed a 15-page \"notice of suspicion\" indicating they were \"looking at the possibility that the $3.4 million paid to Hunter Biden's firm may have been part of the illicit funds that were moving through the company.\"\n\n\"A month later, in April, the prosecutor's office -- open-source intelligence, again -- the U.S. government officials confirming they were aware of this -- made a request of another investigative agency in Ukraine for assistance in going through these bank records,\" Solomon claimed.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"That is a significant change in the timeline -- it was omitted from the whistleblower's complaint, and the question is did he not know it or did he exclude it because it didn't fit the narrative he was trying to write,\" he continued.\n\n\"That's a question for Congress to answer.\"", "description": "Fox News contributor John Solomon claimed a new document he obtained showed Ukrainian officials opened a new probe into the firm linked to Hunter Biden months before President Trump's phone call with that country's leader.", "authors": ["Charles Creitz"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Solomon-Hannity.jpg", "published_at": "2019-10-09"}