{"pub": "telegraph", "url": "https://telegraph.co.uk/athletics/2019/10/09/team-gb-stars-set-windfalls-british-olympic-association-says", "downloaded_at": "2019-10-10 00:06:39.019068+00:00", "title": "Team GB stars set for windfalls after British Olympic Association says it will revise restrictions on personal sponsors", "language": "en", "text": "Dina Asher-Smith and the rest of Great Britain’s Olympic team are to be given greater licence to cash in on competing at the Games after the British Olympic Association confirmed it was revising restrictions on the promoting of personal sponsors.\n\nThe BOA revealed it was close to issuing new guidance on the International Olympic Committee’s controversial Rule 40, which limits their ability to work with their own commercial partners for the two weeks of the Summer and Winter Games.\n\nThe rule is designed to protect the interests of the IOC’s own sponsors but athletes have complained it prevents them capitalising financially on the biggest moments of their careers.\n\nIts wording was changed in June after the German Cartel Office ruled in February that the application of it by that country’s Olympic committee was too strict. The IOC subsequently sent guidelines to national Olympic committees to determine its future implementation.\n\nThe United States Olympic and Paralympic Committee released its revised guidance on Wednesday, which includes granting athletes the right to thank, and receive congratulatory messages from, personal sponsors during the Games.", "description": "Dina Asher-Smith and the rest of Great Britain’s Olympic team are to be given greater licence to cash in on competing at the Games after the British Olympic Association confirmed it was revising restrictions on the promoting of personal sponsors.", "authors": ["Ben Rumsby", "Oliver Brown"], "top_image": "https://www.telegraph.co.uk/content/dam/athletics/2019/10/09/TELEMMGLPICT000212224740-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfy2dmClwgbjjulYfPTELibA.jpeg?imwidth=1200", "published_at": "2019-10-09"}