{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/the-ps4-no-longer-connects-to-facebook", "downloaded_at": "2019-10-07 23:34:52.225166+00:00", "title": "The PS4 No Longer Connects To Facebook", "language": "en", "text": "Photo: Sony,Image: Mike Fahey\n\nStarting today, the PlayStation 4 will no longer support Facebook integration. This means you can’t share your screenshots and trophies with your Facebook friends from your console, as well as a few other limitations that, though minor, are annoying.\n\nAs Sony points out in their article on the issue, “Facebook will no longer be offered as a destination to share screenshots, videos, music, trophy details, or links to gameplay broadcasts.” You also won’t be able to link your Facebook friends to your PS4 account. If you’re using a picture from Facebook as your profile, you’ll have to change that too.\n\nWebsite VG247 points out that this could be related to changes Facebook made to data sharing following the Cambridge Analytica scandal.\n\nIn a news post from July, Facebook wrote that it would “immediately” be ending PlayStation’s “access to friend data.” Perhaps “immediately” is... now?\n\nA spokesperson for Facebook provided the following statement: “We’re working with Sony to finalise an updated contract designed to improve the Facebook integration on PlayStation. While these discussions are in progress, Facebook features will not be available on PlayStation 4. We hope to bring these features back as soon as our teams reach agreement.”)\n\nI mainly use Facebook on my PlayStation to send screenshots to myself for work. It was a nice feature to have. At least no one can spam their trophies at you anymore.\n\nKotaku has also reached out to Sony for further comment.", "description": "Starting today, the PlayStation 4 will no longer support Facebook integration. This means you can’t share your screenshots and trophies with your Facebook friends from your console, as well as a few other limitations that, though minor, are annoying....", "authors": ["Tim Rogers", "Joshua Rivera"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/s0jharjz6djbocxhduai.jpg", "published_at": "2019-10-07"}