{"pub": "cbs", "url": "https://cbsnews.com/news/supreme-court-begins-new-term-with-controversial-cases-on-docket", "downloaded_at": "2019-10-07 19:50:41.571213+00:00", "title": "Supreme Court begins new term with controversial cases on docket", "language": "en", "text": "The justices are returning to the Supreme Court bench for the start of an election year term that includes high-profile cases about abortion, protections for young immigrants and LGBT rights, any of which could affect groups of Americans this term.\n\nThe court met Monday morning for its first public session since late June. The first case heard was a Kansas death penalty case regarding whether states can abolish an insanity defense for criminal defendants.\n\nThe justices also heard arguments Monday on whether the Sixth Amendment applies to state courts, that is, whether juries can convict criminals without a unanimous verdict. Louisiana is one of two U.S. states allowing non-unanimous criminal convictions.\n\nThe term could reveal how far to the right and how fast the court's conservative majority will move, even as Chief Justice John Roberts has made clear he wants to keep the court clear of Washington partisan politics. The court is beginning its second term with both of President Trump's Supreme Court appointees, Justices Neil Gorsuch and Brett Kavanaugh, on board.\n\nKavanaugh will be watched this term to see where he'll stand on some of the hot-button issues confronting the Supreme Court, CBS News Supreme Justice correspondent Jan Crawford points out.\n\nThe justices could be asked to intervene in disputes between congressional Democrats and the White House that might also involve the possible impeachment of the Republican president.\n\nRoberts would preside over a Senate trial of Trump if the House were to impeach him.\n\nIts biggest decisions are likely to be handed down in late June, four months before the election.\n\nThe court is also likely to be monitored as the presidential campaign continues, especially because of health concerns surrounding 86-year-old Justice Ruth Bader Ginsburg.\n\nFor now, though, the court has plenty of significant cases to deal with, including whether federal civil rights law that bars workplace discrimination on the basis of sex covers LGBT people. The justices will hear arguments Tuesday in two cases on that topic, their first foray into LGBT rights since the retirement of Justice Anthony Kennedy, who wrote all the court's major gay rights rulings.\n\nNext month, the fate of the Deferred Action for Childhood Arrivals program is in front of the justices. Lower courts have blocked Trump from ending the Obama-era program, which has shielded roughly 700,000 people from deportation and provided them with permits to work.\n\nAmid the ongoing gun debate in the wake of a series of mass shootings this past summer, the court will also be looking at a gun rights case, debating a law out of New York which makes it harder for law-abiding citizens who own guns to take their guns outside of their homes.\n\nDuring the winter, the justices will take up a challenge to a Louisiana law that would force abortion providers to have admitting privileges at local hospitals. It's another test of whether the change in the court's composition will result in a different outcome. With Kennedy in the majority, the court in 2016 struck down a virtually identical Texas law.", "description": "Justices are set to review cases that include gay rights, DACA, abortion and health care amid 2020 election", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2018/06/26/b55753a6-6086-493e-b97c-64b5752a1c33/thumbnail/1200x630/d3ddf60f0766da9d9f67b2c494542bbc/gettyimages-633200724.jpg", "published_at": "2019-10-07"}