{"pub": "axios", "url": "https://pewresearch.org/fact-tank/2019/08/16/what-the-data-says-about-gun-deaths-in-the-u-s", "downloaded_at": "2019-10-28 09:49:39.725473+00:00", "title": "What the data says about gun deaths in the U.S.", "language": "en", "text": "The recent mass shootings in El Paso, Texas, and Dayton, Ohio – along with a spate of shootings in Chicago – have brought renewed attention to deadly gun violence in the United States. As President Donald Trump and lawmakers on Capitol Hill contemplate policy responses, here are 10 common questions about gun deaths in the U.S., with answers based on data from the Centers for Disease Control and Prevention (CDC), the FBI and other sources. You can also explore key public opinion findings about gun violence and gun policy in the U.S. by reading our recent roundup.\n\nHow many people die from gun-related injuries in the U.S. each year?\n\nIn 2017, the most recent year for which complete data is available, 39,773 people died from gun-related injuries in the U.S., according to the CDC. This figure includes gun murders and gun suicides, along with three other, less common types of gun-related deaths tracked by the CDC: those that were unintentional, involved law enforcement or whose circumstances could not be determined. It excludes deaths in which gunshot injuries played a contributing, but not principal, role. (CDC fatality statistics are based on information contained in death certificates.)\n\nWhat share of U.S. gun deaths are murders and what share are suicides?\n\nThough they tend to get less attention than gun-related murders, suicides have long accounted for the majority of U.S. gun deaths. In 2017, six-in-ten gun-related deaths in the U.S. were suicides (23,854), while 37% were murders (14,542), according to the CDC. The remainder were unintentional (486), involved law enforcement (553) or had undetermined circumstances (338).\n\nWhat share of all murders and suicides in the U.S. involve a gun?\n\nThree-quarters of all U.S. murders in 2017 – 14,542 out of 19,510 – involved a firearm. About half (51%) of all suicides that year – 23,854 out of 47,173 – involved a gun.\n\nHow has the number of U.S. gun deaths changed over time?\n\nThe 39,773 total gun deaths in 2017 were the most since at least 1968, the earliest year for which the CDC has online data. This was slightly more than the 39,595 gun deaths recorded in the prior peak year of 1993. Both gun murders and gun suicides have gone up in recent years: The number of gun murders rose 32% between 2014 and 2017, while the number of gun suicides rose each year between 2006 and 2017 (a 41% increase overall).\n\nGun suicides reached their highest recorded level in 2017. But the number of gun murders remained far below the peak in 1993, when there were 18,253 gun homicides – and when overall violent crime levels in the U.S. were much higher than they are today.\n\nHow has the rate of U.S. gun deaths changed over time?\n\nWhile 2017 saw the highest total number of gun deaths in the U.S., this statistic does not take into account the nation’s growing population. On a per capita basis, there were 12 gun deaths per 100,000 people in 2017 – the highest rate in more than two decades, but still well below the 16.3 gun deaths per 100,000 people in 1974, the highest rate in the CDC’s online database.\n\nThe gun murder and gun suicide rates in the U.S. are both lower today than in the mid-1970s. There were 4.6 gun murders per 100,000 people in 2017, far below the 7.2 per 100,000 people recorded in 1974. And the rate of gun suicides – 6.9 per 100,000 people in 2017 – remained below the 7.7 per 100,000 measured in 1977. (One caveat when considering the 1970s figures: In the CDC’s database, gun murders and gun suicides between 1968 and 1978 are classified as those caused by “firearms and explosives.” In subsequent years, they are classified as deaths involving “firearms.”)\n\nWhich states have the highest and lowest gun death rates in the U.S.?\n\nThe rate of gun fatalities varies widely from state to state. In 2017, the states with the highest rates of gun-related deaths – counting murders, suicides and all other categories tracked by the CDC – were Alaska (24.5 per 100,000 people), Alabama (22.9), Montana (22.5), Louisiana (21.7), Missouri and Mississippi (both 21.5), and Arkansas (20.3). The states with the lowest rates were New Jersey (5.3 per 100,000 people), Connecticut (5.1), Rhode Island (3.9), New York and Massachusetts (both 3.7), and Hawaii (2.5).\n\nHow does the gun death rate in the U.S. compare with other countries?\n\nThe gun death rate in the U.S. is much higher than in most other nations, particularly developed nations. But it is still far below the rates in several Latin American nations, according to a study of 195 countries and territories by researchers at the Institute for Health Metrics and Evaluation at the University of Washington.\n\nThe U.S. gun death rate was 10.6 per 100,000 people in 2016, the most recent year in the study, which uses a somewhat different methodology from the CDC. That was far higher than in countries such as Canada (2.1 per 100,000) and Australia (1.0), as well as European nations such as France (2.7), Germany (0.9) and Spain (0.6). But the rate in the U.S. was much lower than in El Salvador (39.2 per 100,000 people), Venezuela (38.7), Guatemala (32.3), Colombia (25.9) and Honduras (22.5), the study found. Overall, the U.S. ranked 20th in its gun fatality rate.\n\nArtboard 1 Sign up for our weekly newsletter Our latest data, delivered Saturdays Sign Up We need to confirm your email address. To complete the subscription process, please click the link in the email we just sent you. This email address is already subscribed.\n\nHow many people are killed in mass shootings in the U.S. every year?\n\nThis is a difficult question to answer because there is no single, agreed-upon definition of the term “mass shooting.” Definitions can vary depending on factors including the number of victims and the circumstances of the shooting.\n\nThe FBI collects data on “active shooter incidents,” which it defines as “as one or more individuals actively engaged in killing or attempting to kill people in a populated area.” Using the FBI’s definition, 85 people – excluding the shooters – died in such incidents in 2018.\n\nThe Gun Violence Archive, an online database of gun violence incidents in the U.S., defines mass shootings as incidents in which four or more people – excluding the shooter – are shot or killed. Using this definition, 373 people died in these incidents in 2018.\n\nRegardless of the definition being used, fatalities in mass shooting incidents in the U.S. account for a small fraction of all gun murders that occur nationwide each year.\n\nHow has the number of mass shootings in the U.S. changed over time?\n\nThe same definitional issue that makes it challenging to arrive at an exact number of mass shooting fatalities comes into play when trying to determine the frequency of U.S. mass shootings over time. The unpredictability of these incidents also complicates matters: As Rand Corp. noted in a 2018 research brief, “Chance variability in the annual number of mass shooting incidents makes it challenging to discern a clear trend, and trend estimates will be sensitive to outliers and to the time frame chosen for analysis.”\n\nThe FBI found an increase in active shooter incidents between 2000 and 2013. The average number of incidents rose from 6.4 a year in the first seven years of the study to an average of 16.4 a year in the second seven-year period. In subsequent studies, the FBI recorded 20 active shooter incidents per year in 2014 and 2015, followed by 20 incidents in 2016, 30 in 2017 and 27 in 2018.\n\nWhich types of firearms are most commonly used in gun murders in the U.S.?\n\nIn 2017, handguns were involved in the majority (64%) of the 10,982 U.S. gun murders and non-negligent manslaughters for which data is available, according to the FBI. Rifles – the category that includes many guns that are sometimes referred to as “assault weapons”– were involved in 4%. Shotguns were involved in 2%. The remainder of gun homicides and non-negligent manslaughters (30%) involved firearms that were classified as “other guns or type not stated.”\n\nIt’s important to note that the FBI’s statistics do not capture the details on all gun murders in the U.S. each year. The FBI’s data is based on information submitted by state and local police departments, and not all agencies participate or provide complete information each year. In 2017, nine-in-ten law enforcement agencies submitted data to the FBI.", "description": "A look at the data on murders, suicides and other gun deaths in the U.S. and how they have changed over time.", "authors": ["John Gramlich"], "top_image": "https://www.pewresearch.org/wp-content/uploads/2019/08/FT_19.08.14_GunDeaths_feature.png", "published_at": "2019-08-16"}