{"pub": "cnbc", "url": "https://cnbc.com/2019/10/14/gold-markets-us-china-trade-in-focus.html", "downloaded_at": "2019-10-14 02:09:58.608112+00:00", "title": "Gold slips as a partial US-China trade deal lifts risk appetite", "language": "en", "text": "An employee arranges gold bars for a photograph at the YLG Bullion International headquarters in Bangkok, Thailand on January 13, 2016.\n\nGold prices eased on Monday, extending falls into a third session, as news that the United States and China had made progress in their recent high-level trade talks lifted risk appetite.\n\nSpot gold dropped by 0.3% to $1,485.56 per ounce, as of 0036 GMT. U.S. gold futures edged 0.1% higher to $1,489.90.\n\nSpot gold prices fell more than 1% in intra-day trade on Friday on news that the United States and China were likely to reach a partial agreement on trade.\n\nU.S. President Donald Trump on Friday outlined the first phase of a deal and suspended a threatened tariff hike, but officials on both sides said much more work needed to be done before an accord could be agreed.\n\nThe possible deal, covering agriculture, currency and some aspects of intellectual property protections, would represent the biggest step by the two countries in 15 months.\n\nThis renewed appetite for riskier assets, with MSCI's broadest index of Asia-Pacific shares ex-Japan up 0.5%.\n\nThe dollar climbed higher from a three-week low hit in the previous session and traded near multi-month highs versus the yen, also considered a safe-haven asset.\n\nThe coming days will be crucial for Britain, as it prepares for its departure from the European Union on Oct. 31, with both parties claiming a lot more work would be needed to secure an agreement.\n\nBritain said there would be more talks later on Monday, with Prime Minister Boris Johnson hoping a deal will be agreed in time for EU leaders to approve it at a summit in Brussels on Thursday and Friday.\n\nMarkets also look for signs the U.S. Federal Reserve will cut interest rates at its next meeting later in the month.", "description": "Gold prices eased on Monday, extending falls into a third session, as news that the United States and China had made progress in their recent high-level trade talks lifted risk appetite.", "authors": [], "top_image": "https://image.cnbcfm.com/api/v1/image/104876374-GettyImages-505927310.jpg?v=1571016260", "published_at": "2019-10-14"}