{"pub": "yahoo", "url": "https://news.yahoo.com/sperm-donor-sues-clinic-discovering-153057985.html", "downloaded_at": "2019-10-05 00:07:08.450706+00:00", "title": "Sperm donor sues clinic after discovering he has fathered 17 children", "language": "en", "text": "Dr Bryce Cleary (left) with Allysen Allee (right), one of at least 17 children he fathered through sperm donations. Dr Cleary is suing Oregon Health & Science University for allegedly breaking an agreement that he would only father five children: The Oregonian/OregonLive\n\nA doctor is suing his medical school after discovering sperm he donated 30 years ago was used to father at least 17 children.\n\nDr Bryce Cleary has filed a $5.25million (4.23m) lawsuit against Oregon Health & Science University for allegedly breaking an agreement that his sperm would be used to father no more than five children.\n\nThe 53 year old, from Portland, Oregon, branded the university's fertility clinic incredibly irresponsible after claiming it also broke another promise that the children would be born to mothers living outside of the state.\n\nRelated Video: Couple Sues After Alleged Fertility Clinic Mix-Up\n\nDr Cleary, who went on to marry and have three biological sons and an adopted daughter with his wife, says at least two of his offspring conceived through the clinic have gone to the same school, church or social group as his children, The Oregonian reports.\n\nAnd he fears there could be even more children he does not know about.\n\nSpeaking during a press conference while sitting beside 25-year-old Allysen Allee, one of the 17 children he helped father, Dr Cleary said: Without these promises I would never have participated.\n\nRecently, Ive become painfully aware that these promises were a lie.\n\nThe doctor is now trying to deal with the moral, legal, ethical, and personal obligation he feels towards the 17 children, his lawsuit said.\n\nRead more\n\nMs Allee, who was brought up in nearby Vancouver, Washington and is expecting her third child, told reporters she found the idea of dozens of cousins growing up in the same area and at the same age as her children concerning.\n\nThe lawsuit claims Dr Cleary donated his sperm when he was a first-year medical student at Oregon Health & Science University in 1989 after the hospitals fertility clinic solicited him and other classmates.\n\nIn March 2018, he began to learn about the children his sperm donations had helped father after two young women contacted him.\n\nThe lawsuit claims the women used Ancestry.com data and information given to them by the clinic to track down more siblings, as well as Dr Cleary who then used his own DNA to discover he had at least 17 children born through sperm donations.\n\nMr Cleary said: I want this not to happen to people. There needs to be some sort of regulation.\n\nI cant control the industry, but I can stand up and say this isnt cool.\n\nTamara Hargens-Bradley, spokeswoman for OHSU, said: OHSU treats any allegation of misconduct with the gravity it deserves.\n\nIn light of our patient privacy obligations and the confidentiality of protected health information, we cannot comment on this case.\n\nRead more\n\nRead more US fertility doctors got woman pregnant with someone elses babies", "description": "A doctor is suing his medical school after discovering sperm he donated 30 years ago was used to father at least 17 children.Dr Bryce Cleary has filed a $5.25million (£4.23m) lawsuit against Oregon Health & Science University for allegedly breaking an agreement that his sperm would be used to father", "authors": ["Chiara Giordano"], "top_image": "https://s.yimg.com/uu/api/res/1.2/fRc6ve.he3f8XLHK_N6vUA--~B/dz0wO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_independent_635/3f92138b7dca3cdcd6366a724db0dcf5", "published_at": "2019-10-03"}