{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nfl/2019/10/30/bills-coach-criticizes-past-regime-for-irresponsible-moves/40501493", "downloaded_at": "2019-10-30 23:23:14.975449+00:00", "title": "Bills coach criticizes past regime for 'irresponsible' moves", "language": "en", "text": "ORCHARD PARK, N.Y. (AP) — Bills coach Sean McDermott took a swipe at Buffalo's former front office in defending the team's decision to stand pat at the trade deadline despite having several needs to address.\n\n\"If there's not a responsible move for us to make, we're not going to make it,\" McDermott said Wednesday, a day after the deadline passed. \"There's been way too many years of irresponsible decision-making, let's just put it that way.\"\n\nThough McDermott didn't mention names, it's clear he was referring to former general manager Doug Whaley, who was fired a day after completing the 2017 draft.\n\nWhaley was best remembered for trading Buffalo's 2015 first-round pick to move up five spots in the 2014 draft to select receiver Sammy Watkins fourth overall. Watkins had three inconsistent and injury-shortened seasons in Buffalo before being traded in August 2017.\n\nWhaley was also knocked for handcuffing the team's payroll structure by signing underperforming players to hefty contracts.\n\nMcDermott's comments were out of character for a coach who isn't known for publicly voicing criticism.\n\nThey also revealed how McDermott felt a need address a fanbase clamoring for the Bills to upgrade a team already off to a 5-2 start and preparing to host Washington (1-7) on Sunday.\n\nMcDermott didn't deny the Bills were open to making trades. The challenge was striking the right deal that fit the team's short- and long-term needs.\n\n\"I know a lot of teams go out there and just do things. And we're trying to do this the right way,\" he said. \"At the end of the day, we didn't find something that would be responsible for us to do.\"\n\nMcDermott and GM Brandon Beane have spent much of the past two years undoing Whaley's mistakes by purging a roster with just four players remaining from the team that closed the 2016 season.\n\nThe two have stuck to a philosophy of rebuilding through the draft, while not overpaying in free agency. The Bills are projected to still have about $24 million in salary cap space available despite 17 offseason free-agent additions on the roster.\n\nThe Bills aren't near complete and continue to have several holes to fill, many of which were exposed in a 31-13 loss to Philadelphia last weekend.\n\nBuffalo's run defense is coming off a game in which it allowed a season-worst 218 yards and three touchdowns rushing. It continues a three-game slide that coincides with second-year tackle Harrison Phillips sustaining a season-ending knee injury.\n\nVeteran linebacker Lorenzo Alexander referred to the run-stopping issues as being correctible.\n\n\"We never want to be dominated the way we were last week,\" Alexander said. \"We'll bounce back. I don't have any worry in my body about the guys in this locker room.\"\n\nOn offense, a Josh Allen-led unit featuring nine new starters continues showing signs of growing pains. Though Buffalo has topped 300 yards six times, it has also scored three or more touchdowns just once.\n\nThe Bills have especially had difficulty finding consistency at their No. 3 receiver spot behind offseason free agent additions John Brown and Cole Beasley.\n\nBeasley said the offense is still finding its identity and noted it might have been counterproductive to add yet another player.\n\n\"Adding another new guy would slow things down a little bit,\" he said. \"We still have tons of room to grow, and I think (McDermott and Beane) understand that as well.\"\n\nWhaley's tenure briefly overlapped with McDermott being hired in January 2017, with Beane hired in May.\n\nIf Whaley considered himself a risk-taker, something he acknowledged after trading up to select Watkins, McDermott and Beane haven't taken many shortcuts.\n\n\"You've got to keep a strong eye on where you're trying to go and how you're trying to get there, and again responsible decision-making,\" McDermott said. \"We're going to do what we feel is right for us. And in this case, we felt like standing pat is the right move.\"\n\nNOTES: RT Cody Ford (elbow), CB Levi Wallace (shoulder) and S Kurt Coleman (hamstring) were listed as limited in practice. ... OL Victor Salako was signed to the practice squad.\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nCopyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "Bills coach Sean McDermott has defended Buffalo's decision to stand pat at the trade deadline by raising memories of what he called \"irresponsible decisions\" made by past regimes", "authors": ["Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/379581ad328b51bce2c33882d92fed92316eac3f/c=0-268-4964-3060/local/-/media/2019/10/30/USATODAY/usatsports/38a65c475ab543eb8368c02da1708657.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-30"}