{"pub": "yahoo", "url": "https://news.yahoo.com/astronomers-spot-20-more-moons-225649395.html", "downloaded_at": "2019-10-18 01:17:47.889819+00:00", "title": "Astronomers spot 20 more moons of Saturn — and want you to help name them", "language": "en", "text": "This artist’s conception shows the 20 newly discovered moons orbiting Saturn. (Illustration courtesy of Carnegie Institute for Science. Saturn image courtesy of NASA / JPL-Caltech / Space Science Institute. Starry background courtesy of Paolo Sartorio / Shutterstock.)\n\nSaturn has pulled ahead of Jupiter again in the moon discovery race, thanks to a batch of 20 outer moons that bring the ringed planet’s total tally to 82.\n\nThe newly reported satellites, confirmed by the International Astronomical Union’s Minor Planet Center, were found by the same team that reported spotting 12 new moons of Jupiter last year.\n\nAs was the case with those moons of Jupiter, the discovery team at the Carnegie Institution for Science is soliciting suggestions for naming the newly reported moons of Jupiter. Right now, they’re known only by their numerical designations, such as S/2004 S29 or S5593a2.\n\nIt took more than a decade to nail down the discovery: Starting in 2004, Carnegie’s Scott Sheppard and his teammates captured imagery of Saturn and its surroundings using the Subaru Telescope in Hawaii. Recently, the imagery was run through a computer analysis that tracked the newfound moon’s motion.\n\nAll of the moons are thought to be in the range of 3 miles across. Three of them orbit Saturn in the same direction as the planet’s rotation, while the other 17 go in the opposite direction. Their orbital periods range from about two years to more than three years.\n\n“Studying the orbits of these moons can reveal their origins, as well as information about the conditions surrounding Saturn at the time of its formation,” Sheppard said in a news release.\n\nTwo of the moons appear to be part of a known collection of Saturnian moons called the Inuit group. They all may have been part of a larger moon that was broken apart in the distant past. The same goes for the 17 retrograde moons, which are in the Norse group.\n\nThe other newfound moon traces an inclination that’s similar to Saturn’s Gallic-group moons, but it’s much farther out. That suggests that it might have been pulled outward over time due to gravitational influences, or that it’s just an odd duck.\n\nThe moons’ arrangement hints at how the Saturnian system evolved.\n\n“In the solar system’s youth, the sun was surrounded by a rotating disk of gas and dust from which the planets were born. It is believed that a similar gas-and-dust disk surrounded Saturn during its formation,” Sheppard explained. “The fact that these newly discovered moons were able to continue orbiting Saturn after their parent moons broke apart indicates that these collisions occurred after the planet formation process was mostly complete and the disks were no longer a factor.”\n\nThe newly reported discoveries mean Jupiter is back in the No. 2 position when it comes to tallies of known moons. The IAU lists 79 Jovian moons, including the dozen newbies that Sheppard and his colleagues reported last year.\n\nFive of those moons (Pandia, Ersa, Eirene, Philophrosyne and Eupheme) won their names by virtue of an online contest that met with the IAU’s approval. Sheppard and the Carnegie Institution have set up a similar contest for the Saturnian moons, with a deadline of Dec. 6 for submissions.\n\nSubmissions should be tweeted to @SaturnLunacy, with an explanation for the choice and the hashtag #NameSaturnsMoons. Photos, artwork and videos are strongly encouraged.\n\nThe names have to be appropriate to the category of the moon: For the two moons of the Inuit group, names should refer to giants from Inuit mythology. For the Norse group, go with giants from Norse mythology. And for the Gallic-group moon … you guessed it: a mythological Gallic giant.\n\nCheck out the Carnegie Institution’s contest rules and the IAU’s naming rules for the details. You’ll also want to make sure your suggested name hasn’t already been used for a moon or some other celestial object.\n\nIn addition to Sheppard, the observing team included UCLA’s David Jewitt and the University of Hawaii’s Jan Kleyna.\n\nMore from GeekWire:", "description": "Saturn has pulled ahead of Jupiter again in the moon discovery race, thanks to a batch of 20 outer moons that bring the ringed planet's total tally to 82. The newly reported satellites, confirmed by the International Astronomical Union's Minor Planet Center, were found by the same team that reported", "authors": ["Alan Boyle"], "top_image": "https://s.yimg.com/uu/api/res/1.2/9H2f1Ii5xz8NqlV3Fe1m5w--~B/aD00MjA7dz02MzA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/geekwire_312/5970cec6d77f4d051cb0869771159baf", "published_at": "2019-10-07"}