{"pub": "yahoo", "url": "https://news.yahoo.com/johnson-battles-surmount-eu-opposition-093156513.html", "downloaded_at": "2019-10-09 12:09:41.575781+00:00", "title": "EU demands UK face Brexit 'realism;' Johnson scrambles", "language": "en", "text": "Britain's Prime Minister Boris Johnson speaks to health professionals as he visits Watford General hospital, England, Monday Oct. 7, 2019. The UK government has pledged billions for new hospital projects across England under plans devised up by Health Secretary Matt Hancock. (Peter Summers/Pool via AP)\n\nLONDON (AP) — Britain and the European Union appeared to be poles apart Monday on a potential Brexit deal, with the Dutch government urging the British government to offer \"more realism and clarity,\" and U.K. Prime Minister Boris Johnson insisting that the bloc must soften its stance.\n\nLast week the British government sent the EU what it called a \"reasonable compromise\" that will allow Britain to leave the bloc with a divorce deal at the end of this month.\n\nBut Dutch Foreign Minister Stef Blok said after meeting with Britain's Brexit Secretary Stephen Barclay on Monday that \"important questions still remain.\"\n\nThe British government says the country will leave the EU on Oct. 31 with or without a deal. Many in the EU — and in Britain — are skeptical of that claim, because the U.K. Parliament has passed a law compelling the government to ask the EU for a delay to Brexit if no deal is agreed upon by Oct. 19.\n\nBritish Prime Minister Boris Johnson says he will obey the law, but will not ask for a delay. It's unclear how the two statements can be reconciled.\n\nJohnson was working the phones on Monday, speaking to a series of EU leaders, as he tried to overcome opposition to his proposal.\n\nThe EU has responded coolly to the U.K.'s plan for maintaining an open Irish border after Brexit — the main stumbling block to a deal. Currently, goods and people flow freely between EU member Ireland and the U.K.'s Northern Ireland, and an open border underpins both the local economy and Northern Ireland's peace process.\n\nThe EU and the U.K. have agreed there must be no checks or infrastructure along that border. But Britain wants to leave the EU's customs union so it can strike new trade deals around the world, making some sort of checks on goods crossing that border all but inevitable.\n\nUnder the U.K. plan there would be customs checks, but Britain says they could be conducted away from the border.\n\nEU officials oppose any customs checks, and are skeptical of U.K. claims they could be achieved through largely untested technology. EU leaders also have been sharply critical of a proposal that would give Northern Ireland's legislature an effective veto on key elements of the Irish border arrangements in the future.\n\nFinnish Prime Minister Antti Rinne, who met Monday with EU Brexit negotiator Michel Barnier, said \"the U.K.'s proposals do not offer solutions to all questions that remain open.\"\n\n\"With respect to Ireland's situation in future, there are two main problems: the role proposed for the Northern Ireland institutions and the customs border arrangements,\" said Rinne, whose country currently holds the rotating EU presidency.\n\nThere is little time to secure a deal, with a key EU summit scheduled for Oct. 17-18. French President Emmanuel Macron has said the EU will decide by the end of this week whether an amicable divorce deal is possible, and British officials privately agree that this is a make-or-break week.\n\nBritain is keen to hold high-level face-to-face talks, but none have been scheduled so far, and it's unclear whether Johnson will meet any EU leaders in person before next week's summit.\n\n\"We are ready to talk with the EU at pace to secure a deal,\" said Johnson's spokesman, James Slack. \"We have set out a fair and sensible compromise and we're now looking at the EU to match the compromises the U.K. has made.\"\n\nMany members of Britain's Parliament are determined to prevent a no-deal Brexit, which economists say would severely disrupt trade with the EU and plunge the U.K. economy into recession. Last month they passed a law requiring the government to ask the EU for a delay rather than leave without a deal.\n\nSome fear Johnson will try to wriggle out of that requirement and have asked Scotland's highest court to order the government to comply. But Judge Paul Cullen said that was not necessary because Johnson had confirmed in writing that \"he accepts that he must comply with the requirements of the 2019 Act.\"\n\nScottish National Party lawmaker Joanna Cherry said she would still appeal the case. She said she and others did not trust Johnson or \"believe he can be taken at his word to obey the letter and spirit of the law.\"\n\n___\n\nCasert reported from Brussels. Jan M. Olsen in Copenhagen contributed to this story.\n\n___\n\nFollow AP's full coverage of Brexit and British politics at https://www.apnews.com/Brexit", "description": "Britain and the European Union appeared to be poles apart Monday on a potential Brexit deal, with the Dutch government urging the British government to offer \"more realism and clarity,\" and U.K. Prime Minister Boris Johnson insisting that the bloc must soften its stance.  Last week the British", "authors": ["Jill Lawless", "Raf Casert"], "top_image": "https://s.yimg.com/uu/api/res/1.2/D4K7BUJfN76N_9LBPBJ98g--~B/aD0yNzkxO3c9Mzg5MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/61c275cdfe6a20aac4ad94b6f9f67fab", "published_at": "2019-10-07"}