{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7580615/Woman-suffocated-boyfriend-demanded-oral-sex-charged-domestic-abuse.html", "downloaded_at": "2019-10-16 21:31:48.792081+00:00", "title": "Woman who almost suffocated boyfriend when she demanded oral sex is charged with domestic abuse", "language": "en", "text": "A woman has pleaded guilty to domestic violence against her boyfriend who complained he almost suffocated when she sat on his face and demanded he perform oral sex on her.\n\nThe man told police he was 'scared to death' when Amy Nicole Parrino, 44, ran around their Boone County, Missouri home naked on December 2, 2018 and allegedly struck him with a belt, brass plate, cell phone, and hit him with open and closed fists up to 25 times.\n\nThe victim claimed that at one point during the incident around 9.45pm, Parrino pushed him to the ground, sat on his face and yelled 'eat my p***y' but he was unable to breathe.\n\nAccording to an affidavit obtained by The Smoking Gun, the boyfriend felt 'sick to my stomach' and told his girlfriend – who is an assistant to an embalmer at a mortuary - to 'leave him alone.'\n\nAmy Parrino, 44, was sentenced last month (right) to three years in custody for the felony assault charge from last December (left). A sexual assault charge was dropped as part of a plea deal and she's now released from jail after 10 months\n\nParrino was accused of sitting on her boyfriend's face and injuring him in various ways last December in a domestic violence incident\n\nThe responding police officer reported seeing one cut on his right arm and another on his left arm, both 3-4 inches long.\n\nThe cop stated that the victim told him a cut on his nose came from the woman sitting on his face and that red marks on his chest were from being hit with the belt.\n\nThe probable cause statement also stated that the boyfriend told the law enforcement officer violence has been getting worse and more frequent between him and Parrino and that he 'fears for his safety all the time' because he didn't 'know what she's going to do next'.\n\nParrino 'gets very violent very quickly,' her boyfriend also claimed.\n\nShe is seen in a mug shot from the time sporting a mohawk-style haircut with shaved sides.\n\nAccording to an affidavit, the boyfriend felt 'sick to my stomach' and told his girlfriend – who is an assistant to an embalmer at a mortuary - to 'leave him alone'\n\nParrino was charged with one count of first degree sexual abuse and one count of third degree domestic assault.\n\nLast month she was sentenced to three years in prison for an assault charge but a judge in the Circuit Court halted the term and put her on five years' probation.\n\nIn a plea deal the sexual abuse charge was dropped.\n\nA September 2019 mugshot showed her hair grown out and she wears a T-shirt with a 'sunshine' slogan.\n\nParrino had been locked up on Boone County Jail since last December but was released after her sentencing.\n\nThe victim claimed that at one point during the incident, Parrino (left and right) pushed him to the ground, sat on his face and yelled 'eat my p***y' but he was unable to breathe", "description": "Amy Parrino was sentenced last month to three years for the assault charge but the sentence was halted and she was given five years' probation for the December incident in Missouri.", "authors": ["Dailymail.Com Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/18/19798824-0-image-a-41_1571247027852.jpg", "published_at": "2019-10-16"}