{"pub": "businessinsider", "url": "https://businessinsider.com/lgbtq-workers-discrimination-things-not-to-say-2019-9", "downloaded_at": "2019-09-24 14:02:39.173468+00:00", "title": "12 things you should never say to your LGBTQ coworkers", "language": "en", "text": "Misgendering refers to the use of incorrect gender pronouns to refer to someone — typically transgender and gender-nonconforming people. An example of this is referring to a transgender coworker as \"he\" when the person might actually use \"she\" or \"they.\"\n\n\"It can be triggering too, because TGNC people often have to work very hard to be perceived and treated as we wish. When we are misgendered, it feels like evidence that our work has not paid off,\" Melchert said.\n\nAccording to Branstetter, while some cisgender people may see having to use correct pronouns for their coworkers as a burden, people make these types of corrections all the time in other aspects of their lives.\n\n\"Really they make these changes for people all the time,\" Branstetter said. \"When they get married, for example, and change their name, or when they get divorced and change their name. These are really simple steps in respecting somebody's autonomy over their own identity. And when you purposefully misgender somebody, you're stripping that autonomy away from them and nudging them into the closet more and more.\"\n\nWhile misgendering can sometimes occur out of blatant transphobia and disrespect, Branstetter said it's also one of the most common unintentional blunders made by cisgender people. She said the key is to quickly correct yourself, make a mental note for the future, and move forward, rather than displacing your guilt onto the person you just misgendered.\n\n\"The example that I often give is somebody walking into a home of a new friend and their friend has a dog that they haven't met yet,\" Branstetter said. \"They're saying hi to the dog and petting the dog and they'll say 'Oh, what's her name?' and the owner of the dog might say 'oh, well, he. His name is actually Spot.' You then make a silent note in your mind, 'I am wrong and I have been corrected.'\"\n\nBranstetter continued, \"So I think I'm merely asking cisgender people to extend as least the same level of respect and a modicum of humanity to their transgender coworkers as they might to a dog.\"\n\nSome companies implement trans-inclusive policies that can help avoid pronoun confusion, like allowing employees to include their pronouns in their email signatures or in introductory emails for new employees. And of course, you can always just ask for a coworker's pronouns when you're unsure.", "description": "Certain comments and invasive questions can be dehumanizing to LGBTQ workers and make them feel uncomfortable in their work environment.", "authors": ["Canela López"], "top_image": "https://amp.businessinsider.com/images/5661f72ac2814469008b793d-1536-768.jpg", "published_at": "2019-09-24"}