{"pub": "metro", "url": "https://metro.co.uk/2017/06/16/government-ministers-congratulated-themselves-for-cutting-fire-regulations-6713967", "downloaded_at": "2019-10-30 09:14:34.328704+00:00", "title": "Government ministers ‘congratulated themselves’ for cutting fire regulations", "language": "en", "text": "Sajid Javid is responsible for the anti-Red Tape initiative (Picture: REUTERS/Hannah McKay)\n\nConservative ministers were proud of slashing fire regulations, just months ahead of the Grenfell Tower block blaze.\n\nScores are feared dead in the social housing complex in West London.\n\n'Fighting fit' mum dies of sudden aneurysm as husband fights incurable cancer\n\nIn February this year, ministers posted on a government website details of their ‘anti-red tape’ agenda on new-build properties.\n\nIn a separate report fire safety inspections, the Conservatives said, had been reduced for some companies from six hours to just 45 minutes.\n\nThe move, titled Cutting Red Tape, was part of the Tory plans to abolish a ‘health and safety’ culture that they claimed was hurting money-making businesses.\n\nMore than 70 are still missing (Picture: Carl Court/Getty Images)\n\nResidents in Grenfell Tower block have complained that their homes were not properly fire-safe including lack of sprinklers and alarms.\n\nAdvertisement\n\nAdvertisement\n\nFormer Prime Minister David Cameron promised to abolish the ‘albatross’ of ‘over regulation’.\n\nPensioner survives despite getting crushed under lorry on mobility scooter\n\nHe said in 2012 that a Conservative government would: ‘Kill off the health and safety culture for good’.\n\nThe death toll from the fire in Kensington is expected to rise to almost 100.\n\nMore than 2,400 pieces of regulation have been scrapped since Cut Red Tape began.\n\nThe fire was allegedly spread because of the cladding (Picture: Natalie Oxford/PA Wire)\n\nSajid Javid, the business secretary, launched the Cutting Red Tape initiative in 2015 following the Conservative election victory.\n\nOn the official government website it said that it ‘aims to get rid of unnecessary bureaucracy.\n\n‘It intends to shine a light on out of date legislation and confusing implementation of it, such as unhelpful government guidance or needlessly complex inspection regimes, to ensure they make sense.\n\n‘Businesses with good records have had fire safety inspections reduced from six hours to 45 minutes, allowing managers to quickly get back to their day job.’\n\nThe Kensington flames started burning late on Thursday night (Picture: Natalie Oxford/PA Wire)\n\nThe group describe their purpose as working ‘with business, for business’.\n\nThe reference to the 2013 slashing of fire regulation for new-builds had previously been ‘welcomed’ by the Chief Fire Officers Association.\n\nHowever, a cabinet committee was still in operation before the General Election, called the Economy And Industry Strategy (Reducing Regulation).\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nThe chairman, Greg Clark, has not been to the Grenfell Tower block site.\n\nAdvertisement\n\nAdvertisement\n\nLeader of the House of Commons Andrea Leadsom was on the committee and has been meeting with residents.\n\nThere she faced heavy criticism from former residents and locals because Theresa May had not spoken to them.\n\nMORE: Local pastor blasts wealth inequality for Grenfell Tower fire\n\nMORE: Cladding added to Grenfell Tower to ‘improve view for nearby luxury flats’", "description": "Conservative ministers were proud of slashing fire regulations, just months ahead of the Grenfell Tower block blaze. Scores are feared dead in the social housing complex in West London. In...", "authors": ["Charles White"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2017/06/image-812.jpg?quality=90&strip=all&crop=0px%2C13px%2C640px%2C336px&resize=1200%2C630&zoom=1&ssl=1", "published_at": "2017-06-16"}