{"pub": "zdnet", "url": "https://www.zdnet.com/article/mobile-devices-prevail-in-banking-transactions-in-brazil", "downloaded_at": "2019-09-04 23:48:15.008478+00:00", "published_at": "2019-09-04", "title": "Mobile devices prevail in banking transactions in Brazil", "language": "en", "text": "Mobile devices were the main channel used by Brazilians to transact with their banking institutions in 2018, according to data from the Brazilian Central Bank (BC).\n\nSome 29 billion transactions were completed through smartphones and tablets last year, up 18.4 percent on 2017. This builds on a trend that emerged in Brazil last year, when mobile devices surpassed other remote channels such as Internet banking.\n\nRemote access to banking services has also increased in 2018, the BC report noted. However, this was only a small boost from 20.6 million in 2017 to 21.8 million last year.\n\nThere were 74,3 billion banking transactions in Brazil in total in 2018, up 7.1 percent in relation to the prior year.\n\nAccording to the annual study released by the Brazilian Banking Federation (FEBRABAN) in June, there is an increasing sophistication of mobile banking use underway in Brazil.\n\nMobile apps became the preferred channel for Brazilians to handle their banking affairs beyond simply checking statements, with the number of transactions performed through that channel including a financial element - such as money transfers - up by almost 80 percent in 2018.\n\nAppetite for digital banking services in Brazil is way superior to the rest of the world, according to a separate study by Deloitte: the percentage of Brazilian banking users that are actively looking for new digital offerings, is 51 percent, compared to a global average of 28 percent.", "description": "Smartphones and tablets remain the most popular channels for consumers to interact with their banks, according to the Brazilian Central Bank.", "authors": ["Angelica Mari"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2019/07/25/7a37a2f5-fac8-4bd4-859f-c4eee145adc9/thumbnail/770x578/49f37a35e7b4779eb2b1c0c0b5c1d49b/mobile-malware-is-on-the-rise-thanks-to-5d39c3c10341a7000171c4a2-1-jul-25-2019-15-28-53-poster.jpg"}