{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/12/marianne-williamson-caught-on-hot-mic-criticizing-", "downloaded_at": "2019-09-13 00:57:28.614453+00:00", "published_at": "2019-09-12", "title": "Marianne Williamson caught on hot mic criticizing Dems: 'Conservatives are nicer to me'", "language": "en", "text": "Presidential candidate Marianne Williamson was caught on a hot mic last week blasting Democrats and questioning why Republican media is nicer to her “than the lefties are.”\n\nIn Wednesday’s edition of Sinclair’s “America This Week,” host Eric Bolling played a clip following a previous interview with Ms. Williamson last week.\n\nAfter the interview, where she knocked Democrats’ “condescending attitudes” toward people of faith, Ms. Williamson continued her tear against “lefties” while the cameras were still rolling.\n\n“What does it say that Fox News is nicer to me than the lefties are? What does it say that the conservatives are nicer to me? It’s such a bizarre world,” she said. “I’m such a leftie, I’m a serious leftie, but there’s … I understand why people on the right — I didn’t think the left was as mean as the right. They are.”\n\nMs. Williamson has made similar comments in a New Yorker interview about hostility on the left.\n\nMr. Bolling then brought Ms. Williamson on the Wednesday show to explain the hot mic comments, but he seemed to catch the author off guard by playing the clip on the air.\n\n“Well, what I was told was that if I came on your show, you wouldn’t blast it out, and you just blasted it out. So … I don’t even know where to go with that,” she said.\n\nMr. Bolling defended playing the clip, saying it was a matter of journalistic integrity and added he told her campaign they would play it either way.\n\nMs. Williamson said she “was told differently” but explained her comments.\n\n“When it comes to the rough and tumble of politics and how people behave, I think that there are things that happen just in people, it’s not a left-right issue, and I have found it’s tough out there,” she said.\n\n“I was just talking about the fact that that day you were certainly very kind to me. And listen, many people on the left are kind to me. I’m running for president. It’s not a walk in the park. I was making a comment that I found my life that day,” Ms. Williamson continued.\n\n“The Republicans don’t have to be attacking me right now, I’m in a Democratic primary, so Republicans are, ‘Hi, Marianne,’ whereas some people on the left, because they’re working for other candidates — I understand how it goes, that’s all I meant,” she finished.\n\nMs. Williamson is one of 21 candidates attempting to face President Trump in the 2020 election. She did not meet the polling threshold to qualify for Thursday’s debate.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Presidential candidate Marianne Williamson was caught on a hot mic last week blasting Democrats and questioning why Republican media is nicer to her \"than the lefties are.\"", "authors": ["The Washington Times Http", "Bailey Vogt"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/08/03/Election_2020_Nevada_41541.jpg-a10a8_c0-0-4945-2883_s1770x1032.jpg?57a0cbb33de52afa69c2a93b988dc1c815334011"}