{"pub": "japantoday", "url": "https://japantoday.com/category/politics/eu-to-lift-some-restrictions-on-japan-food-imports-in-nov", "downloaded_at": "2019-10-30 00:02:13.016483+00:00", "title": "EU to lift some restrictions on Japan food imports in mid-Nov", "language": "en", "text": "The European Union will remove some of its restrictions on Japanese food imports, introduced following the 2011 Fukushima nuclear disaster, on Nov 14, the farm ministry said Tuesday.\n\nThe European Union's current regulations on all farm and fishery imports from Iwate, Tochigi and Chiba prefectures, as well as fishery products from Miyagi, Ibaraki and Gunma prefectures, will be removed, no longer requiring radiation inspection certificates for them, according to the Japanese ministry.\n\nThe decision by the European Union, which has relaxed the regulations in stages, also allows it to import soybeans from Fukushima, as well as mushrooms from Ibaraki, Niigata and Nagano prefectures, without the certificates.\n\nJapan has been trying to persuade the 28-member bloc and countries including China, South Korea and the United States to lift restrictions they imposed on imports of food products from Fukushima and adjacent prefectures, given they have been scientifically shown to be safe.\n\nAs of Tuesday, 22 countries and regions had not completely removed import restrictions on Japanese agricultural and fishery products imposed in the wake of the disaster at the Fukushima Daiichi plant, triggered by a massive earthquake and tsunami on March 11, 2011, according to the ministry.\n\nThe number has decreased from 54 countries and regions after the disaster. Brunei said earlier this month it intends to abolish its restrictions.\n\n© KYODO", "description": "The European Union will remove some of its restrictions on Japanese food imports, introduced following the 2011 Fukushima nuclear disaster, on Nov 14, the farm ministry said Tuesday. The European Union's current regulations on all farm and fishery imports from Iwate, Tochigi and Chiba prefectures, as well as fishery products…", "authors": [], "top_image": "https://japantoday.com/images/japan-today-social.jpg", "published_at": "2019-10-29"}