{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7597899/Wildfire-burns-near-hilltop-homes-coastal-Los-Angeles.html", "downloaded_at": "2019-10-22 13:54:37.326804+00:00", "title": "PG&E prepares to cut power to half a million homes in Northern California amid winds and dry weather", "language": "en", "text": "With windy, dry weather in the forecast again, California's largest utility said Monday it's considering shutting off power this week to about a half million people to try and prevent wildfires ignited by electrical equipment.\n\nPacific Gas & Electric said shutoffs in the northern part of the state could potentially begin Wednesday and affect some 200,000 customers in 16 counties mostly in Sierra foothills and to the north of the San Francisco Bay Area.\n\nWinds in some areas could top 60 mph (97 kph), according to forecasters. Any blackouts would last at least 48 hours, the utility said.\n\nA huge portion of California is under high fire risk amid unpredictable gusts and soaring temperatures.\n\nAt least six homes were damaged or destroyed Monday evening in a mountain community near San Bernardino in inland Southern California.\n\nEarlier in the day Los Angeles firefighters beat back a blaze as it raced up canyon walls toward multimillion-dollar ocean-view homes on a coastal ridge.\n\nPG&E's announcement came about 10 days after more than two million people had their lights turned off by the utility when powerful winds whipped up.\n\nThousands of homes in Northern California could soon face blackouts after Pacific Gas & Electric announced Monday that it was considering shutting off power ahead of forecasted windy, dry weather to prevent wildfires ignited by electrical equipment. PG&E's announcement came just over a week after more than two million customers had their lights turned off by the utility amid powerful winds (file photo)\n\nPG&E announced the possible power cut in 16 counties mostly in Sierra foothills and to the north of the San Francisco Bay Area as the affluent Los Angeles community of Pacific Palisades came under threat from a 30-acre blaze. A Los Angeles Fire Department official is seen surveying the fire in Southern California\n\n'The sole intent is to prevent a catastrophic wildfire caused by a spark from electrical equipment,' PG&E CEO Bill Johnson said at a Monday press conference.\n\n'In high winds, electrical equipment is more susceptible to damage ... and with high winds and dry conditions and plenty of dead and dying grass and trees, our communities are at much higher risk from rapid fire spread. So that's what we want to avoid, and we're serious about that.'\n\nJohnson promised that if shutoffs are necessary, the utility will do better at communicating with customers.\n\nLast time, its website crashed, maps were inconsistent and call centers were overloaded.\n\nPG&E began contacting potentially impacted customers Monday afternoon by phone, text and email, he said.\n\nCalifornia's top regulator last week excoriated top PG&E executives over problems during the previous shutoffs.\n\nMarybel Batjer, president of the California Public Utilities Commission, said PG&E failed to perform what she thought were simple preparedness steps before calling the unprecedented blackouts.\n\nThe company's website had 1.7 million user requests an hour when it normally logs 7,000, officials said.\n\nAndy Vesey, a PG&E executive, added that they did not think broadly enough and underestimated the needs of their customers and local governments.\n\n'We have to develop a mindset, or culture, of anticipation,' he said.\n\nA car drives through a darkened Montclair Village during a Pacific Gas & Electric power shutdown on October 10\n\nPG&E announced around 2pm on October 8 that it would be shutting off power at midnight to parts of northern and central California, saying that high wind forecasts could damage equipment and spark wildfires.\n\nPanicked residents stood in long lines at supermarkets, hardware stores and gas stations, rushing to buy ice, coolers, flashlights and batteries and to make sure their cars had gas.\n\nThe outages paralyzed parts of a state that has the fifth-largest economy in the world. Schools and universities canceled classes, and some businesses closed.\n\nSouthern California Edison, which had warned of possible safety outages at any time, announced Monday evening that none would take place in the next 48 hours.\n\n'Weather conditions might be different for Thursday,' and in that case, notification would be given Tuesday, said Edison spokeswoman Sally Jeun.\n\nTelevision news footage Monday showed at least two homes damaged by flames before crews got a handle on a wind-driven fire in the Little Mountain community near San Bernardino. No injuries were reported and the cause is under investigation.\n\nTo the west, the Los Angeles fire burned fences and lawn furniture behind large houses at the top of a bluff in the affluent Pacific Palisades neighborhood.\n\nMany residents evacuated from the hillside community west of downtown Los Angeles, while others stayed behind and used backyard garden hoses to try and protect their properties.\n\nCrews saved at least a half dozen houses, said Fire Department spokesman Brian Humphrey. The cause is under investigation.\n\nDry, warm winds were expected to pick up again starting Tuesday in greater Los Angeles.\n\n'This could be one of our most critical weeks of the fall season for fire weather due to very warm temperatures and bouts of Santa Ana winds,' the National Weather Service said in a statement.", "description": "Pacific Gas & Electric said shutoffs in the northern part of the state could begin Wednesday and affect some 200,000 customers in 16 counties mostly in Sierra foothills and north of the Bay Area.", "authors": ["Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/06/20020252-0-image-a-4_1571721467567.jpg", "published_at": "2019-10-21"}