{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7564735/Ariel-Winter-live-beau-Levi-Meaden-confirm-split-nearly-three-years-together.html", "downloaded_at": "2019-10-12 00:49:17.438075+00:00", "title": "Ariel Winter and live-in beau Levi Meaden confirm split after nearly three years together", "language": "en", "text": "Ariel Winter stoked speculation she was single after spotted out on a dinner date with a mystery man on Tuesday.\n\nNow the Modern Family star has confirmed her split with live-in boyfriend Levi Meaden after nearly three years together, as confirmed by Us Weekly Friday.\n\nWinter, who was typically inseparable from the Pacific Rim: Uprising actor, had not been pictured with Meaden since August.\n\nGoing their own way Ariel Winter, 21, and live-in beau Levi Meaden, 32, have split after nearly three years together, Us Weekly has confirmed\n\nThe former couple first started dating in November 2016, and eventually moved in together the following year when she was 19 and he was nearly 30.\n\nAfter revealing her new living situation with Meaden to Jimmy Kimmel, the actress found herself having to publicly defend their age difference.\n\n'I'm happy, and whatever people want to say, they can say,' she said during an interview with Refinery 29 in May 2017.\n\n'I don't understand why someone would even comment on our situation at all.'\n\nThe way they were: The former couple began dating in November 2016 and moved in together the following year; they are pictured during happier times in Las Vegas in April 2019\n\nHer own person: The Modern Family star found herself defending the age difference of her and Meaden after revealing they had moved in together in 2017; (pictured) the actress went solo to the Wags & Walks Benefit Gala in Los Angeles on October 5, 2019\n\nWinter went on to argue that there are all kinds of people with all kinds of arrangements in their relationships who live with their spouse or without.\n\n'I'm super happy with the arrangement we that we have. We love living together. It's just great.'\n\nWinter went on to credit Meaden as being one of the reasons that she had gotten much more comfortable in her own skin; at one point she called him 'the most incredible person I've ever met.'\n\nMoved on? Winter was spotted enjoying a cozy one-on-one dinner with a mystery man in Los Angeles earlier this week, two months after she was last seen with Meaden\n\nAll the break-up chatter started when Winter, now 21, was spotted enjoying a cozy one-on-one dinner earlier this week with a brown-haired, bearded man at an upscale Japanese restaurant in the Studio City neighborhood of Los Angeles.\n\nThe pair sat face-to-face talking intently at a table as they ate a sushi dinner.\n\nAfter they finished their meal, they ended up taking their conversation outside in front of the restaurant.\n\nThe raven-haired beauty showed off her newly toned curves dressed in a black crop-top and form-fitting dark jeans, while the mystery man looked casual-cool in a floral Hawaiian shirt, black pants and a baseball cap.\n\nChange: Winter is also preparing for the end of her hit sitcom Moden Family after 11 seasons; she shared a quick clip of herself with US dollar signs on her face on Insta-Story on Thursday\n\nChange is definitely in the air for Winter right now.\n\nHer longtime role as Alex Dunphy on Modern Family is coming to an end next year, when they show wraps after season 11.\n\nShe was just 11-years old when she began her run on the hugely successful sitcom that stars Sofia Vergara and Ed O'Neil in the lead roles.\n\n'It's strange to think that it's coming to an end. It will be hard to say goodbye,' she said of the final farewell.\n\n'It will be hard to leave that, but I am excited to do new things. I'm excited to play new roles and to do things that challenge me a little more.'", "description": "Ariel Winter and live-in beau Levi Meaden have split up after nearly three years together, according to a report by Us Weekly.", "authors": ["Kevin Kayhart For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/00/19610946-0-image-a-22_1570837149389.jpg", "published_at": "2019-10-11"}