{"pub": "yahoo", "url": "https://news.yahoo.com/diplomat-says-politicization-foreign-policy-040720493.html", "downloaded_at": "2019-10-17 09:22:57.488100+00:00", "title": "Diplomat says politicization of foreign policy disturbed him", "language": "en", "text": "Michael McKinley, a former top aide to Secretary of State Mike Pompeo, right, arrives on Capitol Hill in Washington, Wednesday, Oct. 16, 2019, to testify before congressional lawmakers as part of the House impeachment inquiry into President Donald Trump. (AP Photo/Andrew Harnik)\n\nWASHINGTON (AP) — A former top State Department aide testified in the impeachment inquiry that the Trump administration's politicization of foreign policy contributed to his resignation, while the Senate GOP leader briefed colleagues on a possible Christmas impeachment trial.\n\nThe day's events, interrupted by an explosive meeting at the White House, churned as longtime State Department officials continued speaking out under subpoena — some revealing striking new details — about the actions President Donald Trump and his personal lawyer, Rudy Giuliani, took toward Ukraine that have sparked the House investigation.\n\nOn Wednesday, Michael McKinley, a career foreign service officer and Secretary of State Mike Pompeo's de facto chief of staff, told investigators behind closed doors that he could no longer look the other way amid the Trump administration's dealings with Ukraine, which were among the reasons he ended his 37-year career last week, according to multiple people familiar with the testimony, who, like others who spoke to The Associated Press on condition of anonymity, were not authorized to discuss it.\n\n\"I was disturbed by the implication that foreign governments were being approached to procure negative information on political opponents,\" McKinley testified, according to a former colleague familiar with his remarks.\n\nThe impeachment inquiry revolves around a whistleblower's complaint that Trump was pushing Ukraine's leader into opening an investigation of a company connected to the son of Trump's potential 2020 Democratic rival Joe Biden. It is illegal to solicit or receive foreign help in a U.S. election.\n\nAmong McKinley's concerns was the administration's failure to support Ukrainian Ambassador Marie Yovanovitch, who was ousted in March on orders from Trump.\n\nMcKinley, who as a Latin America expert was not specifically involved in Ukraine, was also frustrated that there had been no response to an August inspector general's report that found significant evidence of leadership and management problems, including allegations from career employees that Assistant Secretary of State Kevin Moley and his former senior adviser Marie Stull retaliated or tried to retaliate against them as holdovers from the Obama administration.\n\nRep. Mark Meadows, R-N.C., told reporters outside the closed-door hearing that McKinley was complimentary about Pompeo's role but did raise other issues.\n\n\"I think most of this is a concern by a colleague for an ambassador that he held in high regard,\" Meadows said, declining to provide more details of the closed session.\n\nRepublicans are crying foul over the process of the impeachment inquiry, but as House Democrats press on with the investigation, Senate Majority Leader Mitch McConnell briefed Republicans about the possible trial ahead.\n\nMcConnell warned of a possible House impeachment vote by Thanksgiving that would force a trial in the Senate, likely by Christmas. He used slides and history lessons during a private Senate GOP lunch in the Capitol to talk about the process, according to a person familiar with the meeting.\n\nAt the White House, congressional leaders abruptly ended an explosive meeting with the president on the situation in Syria, when Trump called House Speaker Nancy Pelosi a \"third-grade politician,\" according to Democrats. Pelosi said later the president was having a \"meltdown.\"\n\nSenate Democratic leader Chuck Schumer said he knows his House colleagues didn't run for office to conduct an impeachment investigation, but he said, \"The facts that are already in the public domain are so deeply troubling and must be taken very seriously.\"\n\nAnother key figure in the impeachment investigation, special envoy Kurt Volker, returned to Capitol Hill on Wednesday to review the transcript of his Oct. 3 testimony to investigators, according to a person familiar with his appearance.\n\nVolker provided text messages to lawmakers that revealed an effort at the State Department to push Ukraine's leader into opening an investigation of the gas company Burisma connected to Biden's son, Hunter, in return for a visit with Trump.\n\nThat effort soon escalated into what one diplomat feared was a quid pro quo for U.S. military aid. Trump has denied that, saying assistance to Ukraine was delayed to pressure the country into addressing corruption.", "description": "A former top State Department aide testified in the impeachment inquiry that the Trump administration's politicization of foreign policy contributed to his resignation, while the Senate GOP leader briefed colleagues on a possible Christmas impeachment trial.  The day's events, interrupted by", "authors": ["Lisa Mascaro", "Mary Clare Jalonick", "Matt Lee"], "top_image": "https://s.yimg.com/uu/api/res/1.2/x5YHbSYf7RUkCclZskLzQw--~B/aD0zMjA3O3c9NDgxMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/0b2880bd873de119b90d792c7c2b1c0c", "published_at": "2019-10-17"}