{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-royals-malawi/uks-prince-harry-makes-conservation-appeal-joins-anti-poaching-patrol-in-malawi-idUKKBN1WF0MZ", "downloaded_at": "2019-09-30 10:48:41.279288+00:00", "title": "UK's Prince Harry makes conservation appeal, joins anti-poaching patrol in Malawi", "language": "en", "text": "LIWONDE, Malawi (Reuters) - Britain’s Prince Harry appealed on Monday for increased global efforts to protect the environment against human “greed, apathy and selfishness” during a visit to a national park in Malawi.\n\nHarry, the grandson of Queen Elizabeth, was due to join an anti-poaching patrol with rangers in Liwonde National Park to highlight their fight against poachers whose activities endanger the survival of elephants, rhinos and other species.\n\nThe Duke of Sussex will also on Monday guest-edit the National Geographic magazine’s Instagram account to encourage people worldwide to appreciate the ecological importance of trees, Buckingham Palace said.\n\n“Conservation used to be a specialist area, driven by science. But now it is fundamental to our survival and we must overcome greed, apathy and selfishness if we are to make real progress,” Harry told Britain’s Daily Telegraph newspaper.\n\n“This may well sound hippy to some, but we cannot afford to have a ‘them or us’ mentality. Humans and animals and their habitats fundamentally need to co-exist or within the next 10 years our problems across the globe will become even more unmanageable.”\n\n“Essentially, I am personally driven by the desire to help restore the balance between humans and nature. It is being in Africa that makes me fully understand and appreciate this.”\n\nIn Monday’s ‘Looking Up’ campaign, Harry will post pictures taken by National Geographic’s photographers - including from the Malawi park he is now visiting - to help raise awareness of the vital role trees play in the Earth’s eco-system.\n\nHe will share a selection of the most beautiful images of trees at the end of the day on @SussexRoyal.\n\nThe Duke of Sussex has launched a number of projects under the “Queen’s Commonwealth Canopy” initiative which has, among other things, involved the planting of millions of new trees in dozens of Commonwealth countries to help combat climate change.\n\nHarry, sixth in line to the throne, has been visiting southern Africa for two decades for holidays and conservation work.\n\nAfter visiting South Africa last week with his wife Meghan and their four-month-old son Archie, he left them there and travelled alone to Botswana, Angola and Malawi.\n\nHarry arrived in Malawi on Sunday, met President Peter Mutharika and visited a college to meet young women whose education is partially supported by The Queen’s Commonwealth Trust. [nL5N26K02G]\n\nBritain's Prince Harry, Duke of Sussex speaks during reception at the British High Commissioner's Residence in Lilongwe, Malawi, September 29, 2019. Dominic Lipinski/Pool via REUTERS\n\nHarry will also pay tribute in Malawi at a memorial site for British soldier Guardsman Mathew Talbot who was killed in May while taking part in counter-poaching operations. [nL5N22J68A]\n\nOn Tuesday, Harry will visit a health centre, pharmacy and youth reproductive health outreach programme in Malawi. He will then rejoin Meghan and Archie in South Africa for a township visit on Wednesday near Johannesburg.\n\nThey will also meet Graca Machel, widow of South African anti-apartheid icon Nelson Mandela, and President Cyril Ramaphosa before departing for London.", "description": "Britain's Prince Harry appealed on Monday for increased global efforts to protect the environment against human \"greed, apathy and selfishness\" during a visit to a national park in Malawi.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190930&t=2&i=1435447312&w=1200&r=LYNXMPEF8T0DR", "published_at": "2019-09-30"}