{"pub": "nymag", "url": "https://vulture.com/2019/10/jeremy-renners-ex-wife-claims-he-threatened-to-kill-her.html", "downloaded_at": "2019-10-15 00:03:26.956565+00:00", "title": "Jeremy Renner’s Ex-Wife Claims He Threatened to Kill Her", "language": "en", "text": "Photo: Jesse Grant/Getty Images for Disney\n\nIn November 2014, Jeremy Renner divorced his wife Sonni Pacheco after just ten months of marriage. At the time, Pacheco cited irreconcilable differences as the reason for the separation. Now, Pancheco is accusing Renner of threatening to kill her.\n\nIn court documents obtained by TMZ, Pacheco said that last November, Renner was at a nightclub, high on coke and booze, when he allegedly told someone that he “could not deal with her anymore, and he just wanted her gone.” She also claims that a nanny overheard Renner say he was going to her residence to kill her and then himself because “it was better that Ava had no parents than to have [Sonni] as a mother.” Pacheco is petitioning for sole custody of their 6-year-old daughter, Ava.\n\nThe court filings also describe an incident in which Renner put a gun in his mouth, threatened to kill himself, and fired the gun into the ceiling while Ava was asleep in her bedroom. Furthermore, Pacheco is accusing Jenner of verbal and emotional abuse and said he had been under the influence during physical custody of their daughter. One alleged incident describes Renner leaving cocaine on a bathroom counter that was in Ava’s reach.\n\nAt the time of their divorce, E! News reported that Pacheco asked Renner to return her allegedly stolen passport, birth certificate, and Social Security card. Screenshots of a text conversation that show the two discussing the alleged theft were also published by TMZ.\n\nOver the years, there have been various other incidents and accusations that shed light on the former couple’s messy relationship. According to the Wrap, a close friend of Renner’s lived with the former couple and said that Pacheco, who is Canadian, admitted that she was only marrying him to secure a green card.\n\nAs for Pacheco’s recent allegations against him, Renner’s rep issued a statement to E! News. “The well-being of his daughter Ava has always been and continues to be the primary focus for Jeremy,” the rep said. “This is a matter for the court to decide. It’s important to note the dramatizations made in Sonni’s declaration are a one-sided account made with a specific goal in mind.”\n\nAs People reports, a court hearing is scheduled for November 7, and Renner and Pacheco were also ordered to attend child-custody mediation.", "description": "Jeremy Renner’s ex-wife claims he threatened to kill her in a new lawsuit, in addition to being under the influence when he had custody of their daughter.", "authors": ["Marie Lodi"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/10/14/14-jeremyrenner.w1200.h630.jpg", "published_at": "2019-10-14"}