{"pub": "investing.com", "title": "Here's Why WeWork Won't be in the S&P 500 Following its IPO", "url": "https://fortune.com/2019/08/20/wework-ipo-s-and-p-500", "language": "en", "published_at": "2019-08-20", "downloaded_at": "2019-09-02 08:22:40.899595+00:00", "text": "The co-working company put its “culture of inclusivity” front and center last week in its IPO filing.\n\nBut when it comes to “inclusion” of its common stock in important indices, the company issued a warning: “S&P Dow Jones and FTSE Russell have announced changes to their eligibility criteria for inclusion of shares of public companies on certain indices, including the S&P 500. These changes exclude companies with multiple classes of shares of common stock from being added to these indices,” the filing states in its risk factors.\n\nTranslation: WeWork won’t be included—meaning it also won't enjoy the advantage of popular index funds being required to buy shares.\n\nWeWork is going public with three classes of stock. Class A shares will carry one vote each. Class B and Class C shares are “high-vote stock,” which carry 20 votes per share. As such, co-founder and CEO Adam Neumann will control the company. “As a founder-led company, we believe that this voting structure aligns our interests in creating shareholder value.”\n\nSome index fund providers and shareholder rights groups believe otherwise. “On principle, you should have a vote consistent with your equity stake, says Amy Borrus, Deputy Director of the Council of Institutional Investors, a shareholder rights non-profit comprised of pension funds, foundations, and endowments. “One-share, one-vote is a bedrock tenet of good corporate governance as far as most long-term shareholders are concerned.” Twenty votes per share, she says, is out of the ordinary. Supervoting classes generally carry 10 votes per share. In the first half of 2019, according to CII statistics, 26 percent of IPOs had unequal class share structure. Only 20 percent of those companies will phase it out.\n\nA 'ticking time bomb'\n\nFounders maintain that keeping control of the company liberates them to manage for the long term outside of quarterly investor expectations. The problem is that supervoting shares can effectively lock in control. “This structure is a ticking time bomb for the long term,” says Borrus. “At some point, even the best CEOs are going to stumble, and when that happens, public shareholders are powerless to have any influence.” She points to Facebook’s Mark Zuckerberg, who despite recent blunders, is immune to challenges. CII favors a sunset period for supervoting shares of seven years. In WeWork’s case, there is a sunset clause, but it's a highly unusual one: Such shares decrease from 20 votes per share to 10 votes per share if Adam Neumann and his wife Rebekah fail to give away $1 billion in 10 years.\n\nTechnology companies have been particularly keen on multi-class stock structures (although it should be noted that non-technology company Levi’s went public this year with a dual class structure as well). But long-term investors don’t like it and have complained as more and more hot IPOs employed the tactic. The tipping point came when Snap filed for a public offering in 2017, giving zero voting power to the public. That’s when investors, well, snapped. Unable to get the SEC or the stock exchanges to do anything about it, they pressured the index benchmarking companies—DowJones S&P, FTSE Russell, and MSCI—to take action.\n\nIn July of 2017, S&P Dow Jones Indices, announced that the S&P Composite 1500 and its component indices—S&P 500, S&P MidCap 400 and S&P SmallCap 600—would no longer add companies with multiple share class structures. Existing companies in the index were grandfathered and not affected. Considering WeWork’s stock structure, the company cannot be included in the S&P 500.\n\nAlso in 2017, FTSE Russell required that 5% of shareholder voting rights of a company must be in public hands for index inclusion, with a five-year grandfather period for constituents to comply. As of June 2019, 20 stocks in FTSE Russell Global Equity Index Series have not yet complied with the 5% voting rights threshold. Their grandfather period is set to expire in September 2022; 36 stocks have not been admitted because they did not meet the 5% voting rights hurdle since the rule was introduced. It is still unclear whether WeWork will meet the threshold. The company has not yet released its voting percentages.\n\nAfter an 18-month long consultation with investors, MSCI announced in October 2018 that the MSCI Global Investable Market Indexes “will continue to reflect the complete investable equity universe for international institutional investors.” The company also said it would create a new index for investors who want options that account for unequal voting.\n\nBut is index composition the right forum to push governance reform? In short, according to money management firm BlackRock, no. In the wake of S&P’s and FTSE Russell’s decisions to exclude, the asset manager voiced strong support for equal voting rights for all shareholders, but opposed excluding companies from index funds as an approach to improve governance which “could limit our index-based clients’ access to the investable universe of public companies and deprive them of opportunities for returns,” they stated at the time.\n\nIf recent IPO history is any indicator, according to Andrew Winden, at the University of Florida’s Levin College of Law, who has studied multi-class index exclusion, the reforms aren’t exactly holding unicorns like Pinterest and Lyft back from issuing such stock. “They’re basically thumbing their nose at S&P and FTSE Russell,” he says. “Founders and CEOs are willing to accept lower stock prices in exchange for being able to control the destiny of the company for a longer period of time.”\n\nLess liquidity\n\nBut as index investing continues to grow, exclusion from important funds means fewer people invest in your shares. Less demand translates into less market liquidity, and becomes a drag on valuation in the long term. For companies that need to raise money by selling shares, that’s a problem. “If you want to raise capital from the maximum number of investors, then having a clean profile in terms of voting rights is a plus,” says Remy Briand, head of ESG at MSCI. He notes, though, that there are still plenty of active investors, so companies with compelling growth and profitability profiles will still attract capital.\n\nAnd as long as that’s the case, hot tech companies are able to continue to use multiclass voting structures.\n\nNotably, one company has recently switched course though. At the end of July, Carlyle Group said it would become a one-share, one-vote corporation with the goal of delivering “governance rights to all shareholders” and improving “trading liquidity by increasing Carlyle’s appeal to a broader group of passive and active investors through potential inclusion into indices and benchmarks.”\n\nBut even if WeWork were to change its stock structure to one-share, one-vote, passive investors still wouldn’t get in on the action through the S&P 500 because of another pesky rule: for inclusion on the index companies are required to have positive GAAP earnings. WeWork’s S-1 filing revealed a loss of $1.6 billion on $1.8 billion of revenue in 2018.\n\nMore must-read stories from Fortune:\n\n—This recession indicator is going off—but don’t use it to time the market\n\n—The death of trading: Why more big banks think the business is a losing bet\n\n—Business confidence is plummeting because of a “chaotic” environment\n\n—How are big banks doing when it comes to diversity? Congress isn’t impressed\n\n—“Negative” interest rates used to be unthinkable in the U.S.—not anymore\n\nDon't miss the daily Term Sheet, Fortune's newsletter on deals and dealmakers.\n\n", "description": "A voting structure that favors CEO Adam Neumann will make the coworking company ineligible for several indices.", "authors": ["Anne Fisher", "Lucinda Shen", "Shannon Fitzgerald", "Eamon Barrett"], "top_image": "https://content.fortune.com/wp-content/uploads/2019/08/GettyImages-479699835.jpg?resize=1200,600"}