{"pub": "thehill", "url": "https://thehill.com/policy/international/466127-obama-calls-on-canada-to-reelect-trudeau", "downloaded_at": "2019-10-16 20:58:44.287960+00:00", "title": "Obama calls on Canada to reelect Trudeau", "language": "en", "text": "Former President Obama called on Canadian voters to reelect Prime Minister Justin Trudeau Justin Pierre James TrudeauThe Hill's Morning Report - Dems to hit gas on impeachment Greta Thunberg: I don't understand why 'grown-ups' mock 'acting on the science' Thunberg leads climate change strike in Montreal MORE on Wednesday as Trudeau faces a tough battle marred by racial controversies.\n\nIn a tweet, the former president harkened back to his time in the White House, commenting that Trudeau was a \"hard-working, effective leader\" who \"takes on big issues\" such as climate change.\n\n\"The world needs his progressive leadership now, and I hope our neighbors to the north support him for another term,\" Obama tweeted.\n\nThe tweet from America's first black president came after Trudeau faced a storm of criticism at home for wearing blackface on multiple occasions, a scandal that threatened to consume his reelection bid even as he faced a separate controversy involving his efforts to pressure officials to drop charges against a company based in Quebec.\n\nADVERTISEMENT\n\nCanadians head to the polls in five days, at which point Trudeau will need to hold on to 170 of the 338 seats in the Canadian Parliament’s House of Commons to win control of a majority government. A minority government coalition with other left-leaning parties is also a possibility.\n\nPolls indicate that Trudeau is in a tight race against the Conservative Party's Andrew Scheer.", "description": "Former President Obama called on Canadian voters to reelect Prime Minister Justin Trudeau on Wednesday as Trudeau faces a tough battle marred by racial controversies.", "authors": [], "top_image": "https://thehill.com/sites/default/files/obamabarack_040619getty.jpg", "published_at": "2019-10-16"}