{"pub": "euronews", "url": "https://euronews.com/2019/10/30/hundreds-koalas-feared-dead-australian-wildfires-n1073771", "downloaded_at": "2019-10-30 10:49:48.258927+00:00", "title": "Around 350 koalas feared dead in Australian forest fires", "language": "en", "text": "CANBERRA, Australia — Conservationists fear hundreds of koalas have perished in wildfires that have razed prime habitat on Australia's east coast.\n\nPort Macquarie Koala Hospital President Sue Ashton said she hoped wildlife carers would be allowed to begin their search of the fire zone for survivors on Thursday. The fire was started by a lightning strike on Friday in a forest in New South Wales state, 190 miles north of Sydney, and has since burnt 4,900 acres.\n\nTwo-thirds of that area was koala habitat, Ashton said.\n\n\"If we look at a 50% survival rate, that's around about 350 koalas and that's absolutely devastating,\" Ashton said of the death toll.\n\n\"We're hoping it's not as bad as that, but because of the intensity of the fire and the way koalas behave during fire, we're not holding out too much hope,\" she added.\n\nKoalasclimb high into trees during wildfires and survive if the fire front passes quickly below them.\n\nThe koala colony was particularly healthy and genetically diverse, Ashton said. Koalas prefer coastal forests, which are being cleared for suburban expansion. Increasingly isolated koala colonies have become inbred and diseased.\n\nAustralia's wildfire season has made a particularly early and devastating start in the southern hemisphere spring due to above-average temperatures and below-average rainfall that has left much of the east coast in drought.", "description": "Blazes have destroyed 4,900 acres of prime koala habitat on Australia's east coast following above-average temperatures and drought conditions.", "authors": [], "top_image": "https://static.euronews.com/articles/4269490/1000x563_nbc-191030-koala-fire-mc-950_188d536226d6e5b79cf1aeaf031d1834.jpg", "published_at": "2019-10-30"}