{"pub": "usatoday", "url": "https://usatoday.com/story/tech/reviewedcom/2019/10/07/15-products-advertised-podcasts-actually-worth-buying/3891429002", "downloaded_at": "2019-10-07 20:18:27.588246+00:00", "title": "15 products advertised on podcasts that are actually worth buying", "language": "en", "text": "15 products advertised on podcasts that are actually worth buying\n\n15 products advertised on podcasts that are actually worth buying (Photo: MVMT/FabFitFun)\n\n– Our editors review and recommend products to help you buy the stuff you need. If you make a purchase by clicking one of our links, we may earn a small share of the revenue. Our picks and opinions are independent from USA TODAY’s newsroom and any business incentives.\n\nConfession: I'm a podcast junkie. Serial, Stuff You Should Know, The Dropout—you name it, I've listened to it. I even listen to a podcast specifically designed to put you to sleep (it's called Sleep With Me and it 100 percent works if you're a fellow insomniac).\n\nOne thing every podcast has in common is advertisements. There are some products that you'll hear about over and over again—to the point where you're tempted to buy them for yourself. But which of those popular products are actually worth it?\n\nWe've rounded up the 15 things most commonly advertised on podcasts that are worth spending your money on from a top-rated meal delivery service to a wildly popular underwear brand.\n\n1. This mattress with a cult following\n\nCasper has a 100-day return policy so you can try it out. (Photo: Casper)\n\nTake it from our editor-in-chief: You (literally) won't lose any sleep over buying a Casper mattress. While it isn't our top tested mattress in a box, it's still one of our favorites. Our EIC says that his Casper mattress is not too firm and not too soft (a.k.a it's just right) and has served him well over the years.\n\nGet the Casper Queen Mattress from Casper for $995\n\n2. This popular meal delivery service\n\nDinner delivered right to your doorstep. (Photo: HelloFresh)\n\nMeal delivery services are having a moment right now—and for good reason. Of the two most commonly advertised on podcasts, HelloFresh and Blue Apron, we prefer HelloFresh because it has the most delicious meals and the easiest-to-follow recipes. It also offers more variety, with 17 meals to choose from compared to the 11 you get with Blue Apron.\n\nGet HelloFresh starting at $8.99/serving\n\n3. This completely natural deodorant\n\nBody odor begone! (Photo: Reviewed.com/Jackson Ruckar)\n\nSwitching to natural deodorant can be scary (will it work? will I smell? will I become a sweaty mess?). However, one of our editors bravely tried Native natural deodorant for herself—and now says she'll never go back. Free of harmful chemicals and aluminum, Native works just as well as regular deodorant and comes in plenty of pleasant scents.\n\nGet Native Deodorant from Native for $12\n\n4. This beauty subscription box for women\n\nTip: Read the fine print so you don't end up auto-paying for an extra month. (Photo: FabFitFun)\n\nChances are high you've heard of FabFitFun. The subscription box service is all over the Internet, podcasts, and social media. Our audience development manager recently tried it for herself and said that the eight full-sized beauty products she received (like a Ouai leave-in conditioner to a Korres sleeping face mask) were great quality for the price of the box.\n\nGet your first FabFitFun box at FabFitFun for $49\n\n5. This music streaming service\n\nChoose from hundreds of pre-made playlists on Spotify or create your own. (Photo: Spotify)\n\nA life without Spotify is hardly a life at all. That might sound dramatic, but it's also kind of true. I use my Spotify app every single day, whether it's for background music during work or an upbeat playlist at the gym. Here at Reviewed, we love Spotify for its vast library of music (there are over 40 million songs!) and its high streaming quality, all for less than $10 a month.\n\nSign up for Spotify for $9.99/month\n\n6. These Internet-famous shoes\n\nRothy's recommends sizing up a half or whole size for the comfiest fit. (Photo: Reviewed.com/Jackson Ruckar)\n\nRothy's flats claim to be \"wildly\" comfortable—but are they really? One of our writers put them to the test to find out. Her verdict? They're incredibly durable (you can even toss them in the washing machine) and have a polished look that makes them perfect for the office. And yes, they are comfortable. P.S. Even Meghan Markle has been spotted wearing them.\n\nGet Rothy’s Black Solid Point Flat for $145\n\n7. This audiobook subscription to listen to your favorite books\n\nChoose from the latest bestsellers to the most popular classics. (Photo: Audible)\n\nWe love Kindles, especially the Paperwhite, for a lot of reasons. One of which is that you can use Audible with them. The service, which is powered through Amazon, has tons of audiobooks and podcasts that you can listen to on demand from any device for just $15 a month. Each month you'll get two Audible Originals and one audiobook, and you can try it for free for your first time. It'll make even the longest commute or the most boring treadmill run more entertaining and educational.\n\nGet Audible for $14.95/month\n\n8. The most comfortable underwear you can buy\n\nYou can even get a matching set for you and your S.O. (Photo: Me Undies)\n\nPaying more than $10 for a pair of boxer briefs? That's something one of our senior writers never thought he'd do—until he tried Me Undies for the first time. Not only are they the softest underwear he says he's ever worn, they've also stood up to hundreds of washes (in a crappy apartment washing machine, no less) without a single strand unravelling.\n\nGet the Men's Boxer Brief from Me Undies for $24\n\nGet the Women's Cheeky Brief from Me Undies for $18\n\n9. This top-rated subscription box for men\n\nPut your best face forward with an even better razor. (Photo: Dollar Shave Club)\n\nNo one likes those annoying emergency trips to the store just to grab a razor. That's why so many men have become fans of Dollar Shave Club, which our experts named as one of the best subscription boxes. Whether you opt for the $1 razor membership or customize a box with other shave and skincare products, you'll get quarterly restock boxes, so you never run out of razors again.\n\nTry Dollar Shave Club starting at $1/month plus shipping\n\n10. These organic period products\n\nThe applicator, tampon, and wrapper are all biodegradable. (Photo: Lola)\n\nI never thought I'd be the kind of person to buy organic tampons (regular tampons are expensive enough as it is!). But after one month of Lola, I was hooked. Made from 100 percent organic cotton, you can customize your own box of tampons and/or pads and it's shipped right to your door every four or eight weeks. It's convenient for you and better for you and the environment. Win-win.\n\nGet your first box of Lola tampons from Lola for $10\n\n11. These glasses that you can try before you buy\n\nI've had my Warby Parker glasses for four years and still wear them every day. (Photo: Warby Parker)\n\nSquare, cat-eye, aviator, round—there are tons of eyeglass styles out there. But ordering them online without trying them on is risky at best. That's why so many people (myself included!) shop at Warby Parker. You can try on five styles of glasses at a time for free, so you know which pair looks best before you order them. Bonus: For every pair purchased, another pair is donated to someone in need.\n\nTry five frames at Warby Parker for free\n\n12. These stylish watches everyone is obsessed with\n\nMVMT makes men's and women's watches in all different styles. (Photo: MVMT)\n\nGood watches that are also affordable are hard to find. But that's exactly what you'll get with a MVMT timepiece. The popular brand is beloved for its sleek, stylish watches that don't break the bank. Even though reviewers rave that the watches are very durable (the faces are all water resistant), you still get a 24-month warranty and free returns if you don't.\n\nGet the MVMT Leather Strap Watch from Nordstrom for $95\n\n13. This high-quality furniture you can order online\n\nArticle has everything you need to furnish your entire home. (Photo: Article)\n\nYou've heard of IKEA, Wayfair, and West Elm—but what about Article? Chosen as one of our favorite places to buy furniture online, the online-only brand is known for stylish, contemporary pieces at fairly reasonable prices. And along with free shipping on orders over $999, you can also expect great quality, with customers claiming that their purchases have lasted for years.\n\nShop Article\n\n14. These Shark Tank-approved socks\n\nStop settling for cheap socks. (Photo: Bombas)\n\nShark Tank has produced a lot of amazing inventions, from the Scrub Daddy to the Monkey Mat. Our experts reviewed some of the most popular products and fell in love with Bombas socks. They're soft and warm yet still breathable and aren't too bulky. Plus, for every pair purchased, a pair of Bombas socks is donated to someone in need.\n\nTry Bombas Socks starting at $15\n\n15. This must-try home DNA kit\n\nBlack Friday and Prime Day are the best times to scoop up DNA kits for cheap. (Photo: Reviewed.com/Jackson Ruckar)\n\nDNA kits continue to be one of the most popular things our readers are buying. In particular, people love 23AndMe because all you need is a saliva sample to discover fun facts about your history from potential relatives to your Neanderthal ancestry to your genetic health risks. Tip: Our experts recommend waiting until the kit is on sale before buying rather than pay full price.\n\nGet the 23AndMe DNA Test from Amazon for $79\n\nGet the 23AndMe Health + Ancestry DNA Test from Amazon for $149\n\nThe product experts at Reviewed have all your shopping needs covered. Follow Reviewed on Facebook, Twitter, and Instagram for the latest deals, reviews, and more.\n\nPrices are accurate at the time this article was published, but may change over time.\n\nRead or Share this story: https://www.usatoday.com/story/tech/reviewedcom/2019/10/07/15-products-advertised-podcasts-actually-worth-buying/3891429002/", "description": "From HelloFresh to Casper to Audible, these are the most popular products advertised on podcasts that are worth spending your money on.", "authors": ["Amanda Tarlton", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/07/USAT/ae6c610a-18c2-4ab2-a557-091f58469ffb-Podcast.png?crop=1593,897,x6,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-07"}