{"pub": "dailybeast", "url": "https://thedailybeast.com/how-fox-news-host-judge-jeanine-pirro-became-trumps-wartime-ally", "downloaded_at": "2019-10-25 16:10:45.248580+00:00", "title": "How Fox News Host ‘Judge Jeanine’ Pirro Became Trump’s ‘Wartime Ally’", "language": "en", "text": "The judge who President Donald Trump listens to and respects the most doesn’t sit on the Supreme Court. She has a show on Fox News that airs on the weekends.\n\nJeanine Pirro, a former district attorney who hosts Justice with Judge Jeanine on the conservative cable-news giant, is among an exclusive club of right-leaning, Fox-affiliated hosts whom President Trump not only tunes in to regularly but also consults privately for advice on political and policy matters. And it’s not just Trump. Pirro also has become a confidant to the president’s family and those in his inner circle, as well.\n\nThe Daily Beast spoke with six sources who have come in and out of Trump-world during his political rise. All regard Pirro as a Trump whisperer—someone who the president sees as a “good friend and wartime ally,” as one White House official described.\n\nLast week, The New York Times reported that Pirro—who had been interviewed during Trump’s presidential transition for the role of deputy attorney general—met with the president in the Oval Office on Nov. 1. During that meeting, she blasted Attorney General Jeff Sessions for, among other alleged missteps, not investigating the widely disproven Uranium One “scandal.”\n\nAccording to the Times, Pirro told Trump that a new special counsel should be appointed to investigate the issue, which is based on the faulty premise that former Secretary of State Hillary Clinton unilaterally approved a uranium deal in exchange for donations to her family’s foundation (in reality, the State Department was one of nine votes). The non-scandal has had tremendous reach in conservative-media circles, including Pirro’s own program. Via a Fox News spokeswoman, Pirro told the Times that “everything I said to President Trump is exactly what I’ve vocalized on my show.”\n\nA source briefed on the meeting confirmed the detail in the Times story to The Daily Beast and added that the two also talked about the president’s own Russia-related troubles and the related investigations, Clinton in general, President Barack Obama, former FBI Director James Comey, and alleged media bias against Trump and his team and supporters.\n\nThe White House press office and Pirro did not respond to requests for comment on this story.\n\nBeyond that meeting, Pirro has visited the Trump White House on multiple occasions and conducted a friendly interview with the president in the West Wing for her show in mid-May—just a few days after Trump fired Comey.\n\nTrump is a fan and an avid viewer of Justice, which airs on Saturday nights, and has tweeted support for Pirro and her show. The feelings are clearly mutual.\n\nDuring the 2016 presidential race, Pirro was often spotted swinging through Trump Tower by campaign staff, to show support and bounce around ideas with aides and Trump family members.\n\nFollowing the publication in October 2016 of the infamous “grab ’em by the pussy” tape—which kicked off a flood of sexual-assault and harassment allegations against Trump—scores of Republicans and conservatives distanced themselves from the future president. But not Pirro.\n\n“[Trump’s] words are disgusting, devastating, and embarrassing,” she said in an “Opening Statement,” shortly after the Access Hollywood footage came out. “It’s the kind of locker-room and frat-house talk that personally infuriates me. But guess what? I still, without a doubt, support Donald Trump.”\n\nTrump ended up surviving the infamous video and the sexual-misconduct allegations. And the month before he was inaugurated, Pirro celebrated on-air by declaring: “The man is going to deliver, it’s a new era.”\n\nSince the start of that new era, Pirro has been seen by the administration as a top ally and advocate. Clips from her show are known to circulate within the White House and among senior staff, as well, including a monologue that aired in late March—after the initial House version of Trumpcare tanked spectacularly—in which Pirro called on House speaker Paul Ryan to quit his job.\n\n“I want to be clear,” Pirro underscored, “this [failure] is not on President Trump.”\n\nOver time, “Judge Jeanine” has ingratiated herself with the Trump clan as well, including Eric Trump, Lara Trump, and Donald Trump Jr. Pirro hosted Trump Jr. in-studio in June to aggressively trash Comey’s conduct and character, and to give cover to the president as he was facing the beginning of the chaos and blowback resulting from the FBI director’s firing.\n\n“The family loves her, absolutely,” a Republican close to the White House and Trump family said. “When Eric and Lara had their new baby, she was messaging with them about how blessed they were.”\n\nPirro is no stranger to politics. In 2005, she launched a campaign to unseat Clinton from the U.S. Senate, only to drop her bid amid poor fundraising and a similarly bad public response. Later, she ran to be the attorney general for the state of New York, only to lose to Andrew Cuomo.\n\nWhether or not a return to politics is in her future, Pirro remains close to the people best positioned to help make such a run happen. Earlier this month, she had a sit-down with Steve Bannon, the Breitbart chairman and Trump’s former chief strategist, at his Washington, D.C., house on Capitol Hill, according to a source familiar with the meeting.\n\n“I think she’s fantastic,” Darrell Scott, a Cleveland-area pastor and alumnus of Trump’s presidential transition team who still works with the administration, texted The Daily Beast. “Brilliant, articulate, friendly and a fast driver.”\n\nThe pastor was referencing the news that Pirro was ticketed after being clocked driving an astonishing 119 mph in a 65-mph zone in upstate New York early Sunday afternoon.\n\n“I had been driving for hours to visit my ailing 89-year-old mom and didn’t realize how fast I was driving. I believe in the rule of law and I will pay the consequences,” Trump’s favorite judge said in a statement.", "description": "The president and his family ‘absolutely’ adore her. Trump’s allies think she’s a superstar. And she privately encourages some of Trump’s worst instincts.", "authors": ["Asawin Suebsaeng", "White House Reporter"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2559,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1511397537/171115-swin-Judge-Jeanine-tease_rudlyf", "published_at": "2017-11-23"}