{"pub": "cnn", "url": "https://bleacherreport.com/articles/2856298-br-untold-stories-antonio-cromartie-believes-colts-cut-him-for-kneeling?utm_source=cnn.com&utm_campaign=editorial&utm_medium=referral", "downloaded_at": "2019-10-30 14:24:50.542663+00:00", "title": "B/R Untold Stories: Antonio Cromartie Believes Colts Cut Him for Kneeling", "language": "en", "text": "Stacy Revere/Getty Images\n\nFormer NFL cornerback Antonio Cromartie told Bleacher Report's Master Tesfatsion that he believes the Indianapolis Colts cut him during his final season in the league because he chose to protest social injustice and police brutality by kneeling during the national anthem.\n\n\"It ain't have nothing to do with my age, it ain't have nothing to do with my style of play,\" he said. \"It was because I took a knee.\"\n\nCromartie revealed former Colts head coach Chuck Pagano asked the team not to take a knee during the 2016 campaign and said \"when we go out on the football field, it's about football.\"\n\nThe cornerback took offense to that because the Colts made such a point of stressing how there were things more important than football when the head coach was diagnosed with leukemia during the 2012 season.\n\nCromartie said his best friend and former New York Jets teammate Joe McKnight was killed by a white man who had been angered by McKnight's driving in what was deemed a manslaughter. The 35-year-old Cromartie added that he was worried about his sons being in a similar situation.\n\nThe trend of NFL players kneeling during the national anthem started with Colin Kaepernick in the 2016 preseason. He told NFL Media after the game, \"I am not going to stand up to show pride in a flag for a country that oppresses black people and people of color.\"\n\nCromartie first knelt during the anthem in Week 3 against the then-San Diego Chargers, and he told Tesfatsion that team executives told him to get up. They also asked him not to kneel during a Week 4 game in London, and he was benched at halftime after he did.\n\nDespite being released after those four games, the cornerback said he doesn't regret his decision to kneel and that he was happy to provide a voice for those who did not have the same type of platform.\n\nCromartie played for the Chargers, New York Jets, Arizona Cardinals and Colts from 2006 through 2016 and was a four-time Pro Bowler.", "description": "Former  NFL  cornerback  Antonio Cromartie  told Bleacher Report's Master Tesfatsion that he believes the Indianapolis Colts cut him during his final season in the league because ...", "authors": ["Scott Polacek"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/831/043/hi-res-0cd571452c87eaa99f1ad0d061e0da04_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-10-30"}