{"pub": "metro", "url": "https://metro.co.uk/2019/10/20/frank-ocean-defends-naming-club-night-hiv-prevention-pill-prep-10950399", "downloaded_at": "2019-10-20 12:36:07.500774+00:00", "title": "Frank Ocean defends naming club night after HIV-prevention pill PrEP", "language": "en", "text": "Frank has broken his silence on recent backlash (Picture: Getty Images for Spotify)\n\nAfter returning with fresh tunes, Frank Ocean has been forced to defend his decision to name his club night after HIV-prevention drug PrEP+.\n\nPrEP stands for pre-exposure prophylaxis and is taken by HIV-negative people before sex. By taking it before being exposed to HIV, the drug acts as a barrier and blocks infection. In England, it is available as part of a trial.\n\nThe singer, 31, recently faced criticism from members of the LGBTQ+ community, with some going so far as to accuse the hitmaker of attempting to ‘rewrite history’.\n\nThey claim he was re-imagining New York’s night club scene as if the drug had existed in the 1970s and 1980s.\n\nNow in another lengthy message posted on Tumblr, he explained his thought behind the theme and slammed claims it was a PR stunt.\n\nHe denied it was a PR stunt (Picture: Getty Images)\n\nHe also denied the event was funded by Gilead Sciences, the manufacturers of PrEP.\n\nAdvertisement\n\nAdvertisement\n\n‘Funded by Blonded, independently,’ he wrote on the note. ‘Let’s just get that out of the way.’\n\nHe explained: ‘Club culture around late 70s and 80s nightlife in NYC was a special, much talked about and written about thing. From the star studded midtown clubs like studio 54 and the first danceteria to the downtown clubs like Mudd + paradise garage.\n\n‘The figures, the music, the looks, the lack of regulation haha. I recognize NY wasn’t all lasers and disco lighting and that simultaneously, there was a lot of crime and poverty and that a huge part of club culture, the gay community, at that time were being wiped out by HIV + AIDS.\n\nThe star recently released new music (Picture: Getty Images North America)\n\n‘Now in 2019, there’s a pill you can take every day that will at a better than 90% chance prevent you from contracting HIV. This pill was approved by the FDA in 2012. The pricing strategy behind it is malicious in my opinion and so it’s public perception is marred and rightfully so. But the fact remains that despite price being a very real barrier to this potentially life saving drug for some, the other very real barrier is awareness.’\n\nSpeaking further, Frank continued in his statement: ‘I decided to name, what was otherwise going to be a night of lights and music inspired by an era of clubbing that I loved PrEP+ because while designing the club which is inside of an old glass factory basement in Queens…I started to imagine in an era where so many lives were lost and so much promise was lost forever along with them, what would it have been like if something, anything had existed that in all probability would’ve saved thousands and thousands of lives.\n\nAdvertisement\n\nAdvertisement\n\n‘I’m an artist, it’s core to my job to imagine realities that don’t necessarily exist and it’s a joy to.\n\n‘A couple days before we threw the party, I was discussing this subject with my team and one of the architects I work with thought that PrEP as a drug had reached ‘100% saturation’ so far as awareness.\n\n‘I thought he was dead wrong so I asked a friend (who I won’t name haha) if he knew what PrEP was and his response was ‘isn’t that some type of viagra or something’. My ex who I was with for several years didn’t know about it when we first met at a gay club in LA. Awareness isn’t always what we’d hope it would be.’\n\nFrank said he was ‘happy’ people were talking about the subject, as he thanked those who came out to dance as part of the event and slammed the rumours it was a PR stunt.\n\n‘Oh one more thing, I saw someone say that this was a PR stunt etc etc, pshhh bitch pls come get a drink next time and I’ll put several barstools out so you can have as many seats as you need. All my love everybody really. Stay safe.’\n\nAdvertisement\n\nThe Odd Future star has never labelled his own sexuality, but in an open letter shared to Tumblr in 2012, Frank told fans that his first love was a man.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Frank Ocean returns with new single DHL and fans are convinced the artwork features album clues\n\nMORE: #ArianaGrandeIsOverParty trends after star defends herself against Frank Ocean lawsuit rumours", "description": "Frank Ocean defends naming club night after HIV-prevention pill PrEP as he releases new song.", "authors": ["Mel Evans"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-869221252_1571566718.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-20"}