{"pub": "washingtonpost", "url": "https://washingtonpost.com/nation/2019/10/21/year-old-is-facing-five-counts-murder-he-didnt-even-know-what-alleged-meant", "downloaded_at": "2019-10-22 13:29:06.951673+00:00", "title": "A 9-year-old is facing five counts of murder. He didn’t even know what ‘alleged’ meant.", "language": "en", "text": "Officials have revealed little publicly about what caused the fire, which broke out just before midnight April 6. But they have identified the person they believe is responsible: Alwood’s 9-year-old son, who, along with his mother, made it out of the structure just in time.\n\nAD\n\nThis month, prosecutors in Woodford County, Ill., charged the boy with five counts of first-degree murder and three counts of arson in connection with the fire, saying he set it intentionally. The Washington Post is not naming the child because he is being charged as a juvenile.\n\nAD\n\nOn Monday, the boy was arraigned in Woodford County juvenile court, where, according to local media outlets, a surreal scene unfolded as a judge tried to explain the charges in terms that would make sense to an elementary schooler.\n\n“What don’t you understand?” Judge Charles Feeney asked the boy at the beginning of the arraignment, according to the Chicago Tribune.\n\n“What I did,” the boy replied.\n\nAD\n\nThe proceeding stumbled along over the course of about half an hour, with Feeney pausing repeatedly to explain different words in the charging documents.\n\n“Your honor — I apologize — he told me he doesn’t know what ‘alleged’ means,” the boy’s attorney said at one point, according to the Tribune.\n\n“It means someone accuses you,” the judge said.\n\nShortly after, the defense attorney interrupted again, telling the judge that the boy wanted to know what arson was, the Journal Star reported. “You knowingly set a fire,” the judge told him.\n\nAD\n\nWhen the hearing adjourned, according to the Journal Star, the boy broke down in tears. His grandfather escorted him out.\n\nAD\n\nIt was not immediately clear if the boy entered a plea Monday. If he is found guilty, he could face a maximum sentence of probation, along with counseling or treatment. Under Illinois law, 10 is the minimum age children can be sent to detention, and 13 is the minimum age at which they can be imprisoned.\n\nThe case is an extraordinary example of prosecutors bringing charges against a pre-adolescent that could land an adult on death row or in prison for life.\n\n“It’s very unusual,” said Elizabeth Clarke, president of the Juvenile Justice Initiative in Illinois. “It’s a shocking approach that the prosecutor chose to take.”\n\nThe charges come at a time when murder and non-negligent manslaughter arrest rates for juveniles have fallen to some of their lowest levels. In the early 1990s, juvenile murder and non-negligent manslaughter arrest rates nationwide hit a high of nearly 13 per 100,000 youths, according to the Justice Department’s Office of Justice Programs. In 2017, the most recent year for which data is available, the arrest rate was 2.7 per 100,000.\n\nAD\n\nAD\n\nAlwood, the boy’s mother, told CBS News this month that her son had recently been diagnosed with a form of schizophrenia, ADHD and bipolar disorder. The Illinois Department of Children and Family Services reportedly took him into custody shortly after the fire, and he is now a ward of the state.\n\nAccording to Clarke, charging the boy with murder, arson or other crimes would not make available any additional public services than if prosecutors had not charged him.\n\n“There are no treatment options that open up. What opens up by charging is the possibility of punishment,” Clarke said. “It’s only about punishment.”\n\nWoodford County State’s Attorney Greg Minger did not immediately respond to a request for comment about the case. Neither did the public defender representing the boy. The judge has issued a gag order at the request of the Illinois Department of Children and Family Services barring anyone involved in the proceedings, including the boy’s relatives, from publicly discussing the case.\n\nAD\n\nAD\n\nMinger previously told the Tribune that bringing the charges was a difficult decision “because it was a 9-year-old … and all the way around, it was a tragedy.”\n\nOfficials did not publicly release details about what caused the fire or where in the trailer it originated. Alwood told the Journal Star that her younger children were asleep when the furnace exploded, causing flames to engulf the inside of the home. Her son ran next door, where his grandparents lived, screaming for help, she said. The five family members died of smoke inhalation.\n\nA photo taken by a bystander the night of the blaze shows bright orange flames billowing several feet out of the door and windows of the trailer, and plumes of gray smoke rising into the air. Later pictures show the structure boarded up with plywood and surrounded by orange safety fencing. Vinyl siding dangled from the outside walls, and the roof was blackened by smoke.\n\nAD\n\nAD\n\nAlwood said her son deserves forgiveness.\n\n“Everyone is looking at him like he’s some kind of monster, but that’s not who he is,” she told CBS News. “People make mistakes, and that’s what this is. Yes, it was a horrible tragedy, but it’s still not something to throw his life away over.”\n\nBut the fire has apparently opened a rift in the family. Alwood’s sister, Samantha Alwood, whose 2-year-old daughter died in the blaze, said probation would not be enough of a punishment. She wants to see her nephew incarcerated, she told CBS News.\n\n“I think he should go somewhere until he’s legal age to go to juvie. Then I think he should go to juvie. And then from juvie to prison,” she said. “Because at the end of the day, whether he meant to or not, he knew what fire did.”\n\nRead more:\n\nAD", "description": "Criminal justice experts said it was extremely rare for prosecutors to bring such severe charges against a child.", "authors": ["Derek Hawkins", "National", "Breaking News Reporter"], "top_image": "https://www.washingtonpost.com/resizer/748BVdegkBn-HqX8tjYl-Pvej0o=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TNCITRXLUMI6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-21"}