{"pub": "cbs", "url": "https://cbsnews.com/news/juul-lawsuit-former-executive-claims-he-was-fired-for-raising-concerns-about-one-million-contaminated-pods", "downloaded_at": "2019-10-30 11:18:53.472554+00:00", "title": "Juul accused of selling tainted vaping pods to customers and retailers", "language": "en", "text": "A new lawsuit claims Juul shipped and sold contaminated vaping pods to customers and retailers. A former executive for the e-cigarette maker alleges that at least one million tainted pods were put on the market earlier this year. Juul is already under fire following an outbreak of vaping-related illnesses and deaths nationwide.\n\nFormer Juul senior vice president Siddharth Breja claims he was fired in March for raising concerns about the contaminated pods the company allegedly shipped to customers and retailers. Breja says in a lawsuit that he raised concerns about the contamination of Juul's \"mint refill kits.\" He also said he voiced concern about the company selling expired products in meetings with senior management.\n\nThe lawsuit cites several instances where Breja expressed concerns about the quality of the products being sold, reports CBS News correspondent Anna Werner.\n\nAccording to the lawsuit, then-CEO Kevin Burns responded to those concerns saying: \"Half our customers are drunk and vaping like mo-fo's, who the f*** is going to notice the quality of our pods?\"\n\nBurns, who stepped down from Juul last month, told \"CBS This Morning\" co-host Tony Dokoupil in August the company's products are safe.\n\n\n\n\"People say Juul is toxic. Is it?\" Dokoupil asked.\n\n\"The product or the company?\" Burns said.\n\n\"Interesting that you would ask. The product?\" Dokoupil responded.\n\n\"We toxicology test all of our products,\" Burns said.\n\nBut last month the FDA warned Juul about misleading claims that vaping is less harmful than smoking.\n\n\n\n\"We think we have a product that is legal today, is tested for toxicity, and does not present a risk based on the guidelines of the category today to the American public,\" Burns said.\n\n\"But fair to say, if you knew this to be a toxic or dangerous substance, you wouldn't be selling it?\" Dokoupil asked.\n\n\"I can't imagine we had the data to support that we're selling a product that is damaging to the American public and we had that data that we'd continue to sell that product,\" Burns said.\n\nIt's worth noting there is no evidence that links claims in the lawsuit to the more than 1,600 vaping-related illnesses and 34 deaths reported nationwide. Most of those instances involve vaping with THC, the psychoactive ingredient in marijuana, or both THC and nicotine. We have not been able to contact Burns, but Juul has not responded to our request for comment.", "description": "Former Juul senior vice president Siddharth Breja claims he was fired in March for raising concerns about contaminated pods", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/09/27/fdec727b-c465-420d-9cce-48722531408c/thumbnail/1200x630/4579dd1ccdba16de19d47cb887f14f66/gettyimages-1044550250.jpg", "published_at": "2019-10-30"}