{"pub": "foxnews", "url": "https://foxnews.com/us/california-los-angeles-county-fair-fake-mass-shooting-tip", "downloaded_at": "2019-09-16 13:03:36.228803+00:00", "title": "California man warns of fake mass shooting at county fair so he wouldn't have to go with parents, police say", "language": "en", "text": "A California man was arrested Friday after he falsely reported a mass shooting was going to happen at the Los Angeles County Fair — simply because he didn't want to attend with his parents, police said.\n\nErik Villasenor, 22, allegedly sent an email to fair staff around 2:45 p.m. Friday, which police said contained a warning: \"Hello, I was told that someone was planning on doing a mass shooting on Sunday at the fairgrounds. I just wanted to inform you guys already.\"\n\n\"That was all that was said,\" Pomona Police Chief Michael Olivieri Jr. told reporters at a news conference Saturday. \"Obviously in today's world, a message like that is very concerning.\"\n\nMASS SHOOTINGS AND MENTAL ILLNESS IN AMERICA: INSIDE THE DEBATE\n\nFair staff immediately reported the threat to the police department, which worked quickly with the FBI and anti-terror liaisons to investigate what they presumed was a mass shooting tip.\n\nWithin hours, authorities identified two to three suspects connected to the email address that sent in the threat, and, eventually, investigators narrowed that list down to Villasenor through his digital footprint, Olivieri said.\n\nFLORIDA MOM INSISTS HER SON WHO ALLEGEDLY THREATENED MASS SHOOTING IS 'JUST A LITTLE KID' MAKING JOKES\n\nAuthorities interviewed Villasenor and said he \"ultimately admitted it was a hoax.\" Police said Villasenor made the false threat because he didn't want to attend the fair with his parents, which he was scheduled to do Sunday.\n\n\"Though he's 22, he felt that it was appropriate to send this threat and we believe it was with the intent that it would spark some chaos and commotion, it would be captured on the media, and that then he could use that as an excuse to his parents to not go to the fair,\" Olivieri said. \"Kind of a crazy thing.\"\n\nVillasenor was arrested around midnight and booked at the Pomona City Jail, police said.\n\nThe CEO of the Los Angeles County Fair, Miguel Santana, said the swift resolution \"speaks to the safety plan put in place\" for the fair, which is being held at the Fairplex in Pomona until Sept. 22.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSantana previously told the Los Angeles Times that Fairplex spent $200,000 to build a command center to coordinate a quick response during emergency situations \"in light of the environment\" — most likely a reference to recent mass shootings across the U.S., particularly the attack at the Gilroy Garlic Festival in California in July, which left three people dead.\n\n“We always take security seriously, but we’ve made a deliberate effort to strengthen our security system,\" Santana said.", "description": "A California man was arrested Friday after he falsely reported a mass shooting was going to happen at the Los Angeles County Fair — simply because he didn't want to attend with his parents, police said.", "authors": ["Nicole Darrah", "Nicole Darrah Covers Breaking", "Trending News For Foxnews.Com. Follow Her On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/LA-County-Fair-.png", "published_at": "2019-09-16"}