{"pub": "foxnews", "url": "https://foxnews.com/sports/minnesota-5k-wrong-turn-10k-winner-boy", "downloaded_at": "2019-10-01 12:43:06.494335+00:00", "title": "Minnesota boy, 9, takes wrong turn on 5K race, ends up winner of 10K instead", "language": "en", "text": "He took a wrong turn, but he still ended up a winner.\n\nA 9-year-old boy wound up winning a 10K race in Minnesota last month after he missed a turn on a separate 5K race and ended up on the much longer course.\n\n\"I was thinking, ‘This is a really long 5K. This is not as usual,’\" Kade Lovell of St. Cloud told FOX9.\n\nMASSACHUSETTS WOMAN MISTAKENLY SIGNS UP FOR HALF-MARATHON IN BRITISH CITY WITH SAME NAME AS US CITY\n\nKade started off running the St. Francis Franny Flyer 5K, in Sartell, Minn., on Sept. 21.\n\nAt one point during the run, a woman told him to keep going when he approached the 5K turn, he told the St. Cloud Times — so he did, despite his confusion.\n\n\"A lady told me to keep going straight. So I kept going straight,\" he told the newspaper.\n\nWhen he didn't cross the finish line of the 5K, his mother, Heather Lovell, said she thought her son was having an off day. But when he didn't show up, her concerns grew and she started driving along the 3.11-mile route looking for him.\n\nIAAF DOING AWAY WITH THE TERM 'FASTEST LOSER': REPORT\n\n\"I thought maybe he is having a bad race. It happens. No big deal. Then these other kids coming running by... I was like, ‘He should be in front of them.’ Then I thought maybe he's hurt, maybe he got lost, maybe worse could happen...who knows,\" she told FOX9.\n\nHeather Lovell said she was \"bawling\" when no one else saw her son, as she asked anyone she could find if they had seen her son. She was eventually able to track him down after a spectator called her brother-in-law, who was in the 10K race, to let him know there was a \"little kid who was running really well\" in the 10K.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nWhen Kade's mother found him, he was all alone and she told FOX9 she thought he had come in last place in the 10K.\n\nBut race organizers told Kade's mother he finished in first place. She thought they meant in his age group, but he was actually first place overall. He finished in just over 48 minutes — a minute faster than the 40-year-old woman who ended up in second place.\n\n\"I accidentally won it, and they've been practicing for a long time. I just was really surprised I did that,\" Kade told FOX9.\n\nKade's mother said the 9-year-old has been running since he was 18-months-old. \"He pretty much popped out running,\" she said. Then, at the age of 6, he started running with a cross country club. He currently practices at least three times a week, running two to six miles at a time.\n\n“I like wasting my energy and stuff, and sprinting and just running,\" Kade told FOX9.\n\nCLICK HERE FOR THE FOX NEWS APP\n\nAfter his accidental win, Kade ran another 5K race sponsored by the Jacob Wetterling Resource Center — which he also won. He is now practicing with a special running coach and has already competed in the Junior Olympics with plans to compete again in Wisconsin this year.\n\n\"I'm glad the way it turned out. I couldn't have asked for a better way for it to turn out, from me being scared to being excited and he did well,\" his mother told FOX9.\n\nThe Associated Press contributed to this report.", "description": "He took a wrong turn, but he still ended up a winner.", "authors": ["Travis Fedschun", "Travis Fedschun Is A Reporter For Foxnews.Com. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/RUN-Minnesota-Boy.jpg", "published_at": "2019-10-01"}