{"pub": "aljazeera", "url": "https://aljazeera.com/indepth/features/chapter-left-wing-victory-means-kosovo-191007084722337.html", "downloaded_at": "2019-10-08 06:32:07.103296+00:00", "title": "'New chapter': What a left-wing victory means for Kosovo", "language": "en", "text": "Pristina, Kosovo - The left-wing Vetevendosje, or Self Determination Movement party, won snap elections held on Sunday in Kosovo, with 25 percent of the vote.\n\nIt was the fourth election in Europe's youngest nation since it declared independence from Serbia in 2008.\n\nWhile Kosovo's population is just 1.7 million, about a million diaspora Kosovo Albanians formed a large chunk of the country's nearly 2 million registered voters.\n\n191003135704014\n\nThe Kosovo Albanians were firm supporters of the leftist-nationalist party.\n\nVetevendosje's prime ministerial candidate, 44-year-old Albin Kurti, founded the party first as a political movement in 2005, which in 2010 transitioned to electoral politics.\n\nThe most vocal opponent of the Democratic Party of Kosovo (PDK), which had ruled over Kosovo by forming various coalitions since 2007, Vetevendosje's win is considered a significant development symbolising a break from the past.\n\nIn Sunday's polls, the ruling PDK dropped to a 21 percent vote share, while the centre-right Democratic League of Kosovo (LDK) was one point behind Vetevendosje at 24 percent.\n\nKurti, who plans to form his government with the conservative LDK party in order to push the ruling PDK into opposition, has pledged economic reforms and improving the law and order situation in the nascent Western Balkans democracy.\n\n\"It is a new wave that will strengthen our republic and incite development and bring equality for all of you,\" Kurti told cheering supporters at about midnight in Pristina's main square.\n\n\"We are opening a new chapter and in our government, there will be no thieves. All thieves will be caught, investigated, judged and sentenced wherever they are.\"\n\nAlbin Kurti, l eader of the Vetevendosje Party and prime ministerial candidate, suggested he would tackle corruption in a victory speech [Atdhe Mulla/Al Jazeera]\n\nAidan Hehir, a reader of international relations at Westminster University who has authored books on Kosovo, called Vetevendosje's victory a \"dramatic and welcome change\".\n\n190721083257785\n\n\"The electorate have shown they are hungry for a new direction and given how Kosovo has been mismanaged by successive governments, this is understandable,\" said Hehir.\n\n\"Kosovo has stagnated politically and economically in recent years, and its international status has become increasingly tenuous.\"\n\nCorruption main issue at home\n\nKosovo's economy is struggling, with more than 30 percent unemployed. Youth unemployment is even worse, at 50 percent.\n\nJoblessness is blamed on \"endemic corruption\" that marked the previous government, with an European Union Commission report saying \"cronyism\" had forced 170,000 people to migrate to Western Europe in the last five years.\n\nKosovo ranked 93 out of 180 countries for corruption in 2018, according to Transparency International.\n\nKurti's job ahead, as promised during the electoral campaign, will centre around improving social justice and the economy and stamping out corruption.\n\n\"Corruption remains a perennial problem in Kosovo which impacts the country in all aspects. Progress and change are impossible unless it is addressed,\" said Hehir.\n\nDonika Emini, who runs Pristina-based NGO Civikos, a group advocating for cooperation between civil society and the government, said Kurti set high expectations during the campaign.\n\n\"It will be very hard to [Vetevendosje] to promptly to meet the expectations,\" she said, expecting the party to \"face major resistance in the fight against corruption\".\n\n\"This complexity is further deepened by the fact that PDK will be in the opposition and might not be willing to cooperate in this process,\" she added.\n\nBut corruption and the economy are not the new government's only challenges.\n\nDealing with Serbia\n\nApart from issues at home, the new leadership also needs to deal with the question of rebooting dialogue with its hostile northern neighbour, Serbia.\n\n190427204959096\n\nSerbia has refused to recognise Kosovo's independence and obstructs its international recognition.\n\nStill, more than 100 countries recognise Kosovo, including the United States, the United Kingdom, Germany and France.\n\nRussia and China are close allies of Serbia and have blocked Kosovo's membership at the United Nations.\n\nBoth Kosovo and Serbia aspire to join the EU, but relations between the neighbours remain strained as Serbia continues to consider Kosovo as its own territory.\n\n\"With the new appointees from the US - which are traditionally known as very close to [Kosovo President Hashim Thaci], and the uncertainty at the EU level, it will be challenging for Kurti to find his way in this process,\" said Emini.\n\nKurti has criticised earlier governments for their approach towards Serbia in the EU-mediated dialogue that began in 2011.\n\nA number of agreements were signed in Brussels between Kosovo and Serbia in those peace talks - from energy and the mutual recognition of higher education degrees to allowing free movement.\n\nFor Hehir, the new government needs to be firm in dealing with Serbia in order to check Belgrade's aggressive campaign against Kosovo's sovereignty.\n\n\"The EU clearly wants Serbia to join and appears to be willing to overlook Serbia's ongoing interference in Kosovo's internal affairs,\" he said.\n\n190829112758558\n\n\"It is a sustained campaign [by Serbia] to convince other states to derecognise Kosovo.\"\n\nSerbia's forces killed more than 10,000 people in the Kosovo War, prompting a NATO intervention in March 1999 which drove Serbian forces out of the region months later in June.\n\nSerbia has never apologised for the war crimes committed under Slobodan Milosevic's rule.\n\nNearly five years later in 2005, Kurti founded Vetevendosje that sought self-determination for Kosovo and slammed the international presence, chiefly the UN administration, UNMIK.\n\nHis criticism mainly centred around the UN mission privatising Kosovo's state-owned enterprises, which Kurti has pledged to investigate when he forms his government.\n\nKurti's movement opposed the UN mission until 2008 when Kosovo declared itself a sovereign state.\n\nFor two years between 2008 and 2010, Kurti rejected Kosovo's statehood, which he saw as a compromise in order to form a multiethnic state, when 90 percent of Kosovo Albanians resided in the country.\n\nHis Vetevendosje movement continued to call for unification with Albania.\n\nEven on Sunday night in Pristina, red-and-black eagle Albanian flags dominated the celebrations by Kurti's supporters.", "description": "Self Determination Movement won snap polls against backdrop of Kosovo's sour relations with Serbia and corruption.", "authors": ["Eraldin Fazliu", "About The Author"], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/7/200578797cca4bc5b4b518cb479d7080_18.jpg", "published_at": "2019-10-08"}