{"pub": "abcnews", "url": "https://abcnews.go.com/International/wireStory/zimbabwe-doctor-found-alive-alleged-abduction-65739326", "downloaded_at": "2019-09-20 13:01:56.092825+00:00", "published_at": "2019-09-20", "title": "Zimbabwe doctor is found alive after alleged abduction", "language": "en", "text": "A Zimbabwean doctor whose alleged abduction led to days of protests has been freed, activists announced on Friday, as the government asserted he had simply been missing. The disappearance had raised fresh concerns about dozens of abductions of government critics this year alone.\n\nThe president of the Zimbabwe Hospital Doctors Association, Peter Magombeyi, was released overnight into the custody of his lawyers, the Zimbabwe Human Rights NGO Forum said. A police statement said he had \"been found by police.\"\n\nThere were no immediate details of his condition, and Magombeyi was being treated at a hospital in the capital, Harare. The government's information ministry said police efforts to debrief him were not working \"as he prefers not to speak to the authorities.\"\n\nMore than 50 government critics and activists have been abducted in Zimbabwe this year, at times tortured and warned by suspected state security agents to back off from anti-government actions. One woman was forced to drink raw sewage, Human Rights Watch has said.\n\nMagombeyi's case led to expressions of concern from diplomats and others as some in Zimbabwe openly worried that the government of President Emmerson Mnangagwa is becoming more repressive than that of longtime leader Robert Mugabe, who died earlier this month. Mugabe was accused of using abductions to silence critics, and some have never been found.\n\n\"We are relieved Dr. Peter Magombeyi was released and wish him a speedy recovery from this ordeal,\" the U.S. Embassy said on Twitter. \"All abductions must stop.\"\n\nHe was seized Saturday after calling for a pay strike as Zimbabwe's health care system collapses along with the southern African nation's economy. This week a growing number of health workers said they would not return to work until he was found, bringing many health care efforts to a halt.\n\nMany health workers say they can no longer afford even the commute to work as their salaries are some $100 or less a month.\n\nSome Zimbabwean officials have blamed a \"third force\" linked to Mugabe for the recent abductions, asserting that they are bid to tarnish the president's image abroad and hurt efforts to have sanctions imposed by the West removed.\n\nBut the country's biggest representative organization for churches, the Zimbabwe Council of Churches, has questioned the \"third force\" explanation, asking why only perceived government critics are being targeted.\n\n———\n\nAssociated Press writer Cara Anna in Johannesburg contributed.\n\n———\n\nFollow Africa news at https://twitter.com/AP—Africa", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/WireAP_d89991896ce4413195c337d40a20d1aa_16x9_992.jpg"}