{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/29/polls-impeachment-removal-of-president-unpopular-in-battleground-states", "downloaded_at": "2019-10-29 23:58:00.461131+00:00", "title": "Battleground States Oppose Impeachment and Removal", "language": "en", "text": "Two recent polls show that the effort by Democrats to impeach and remove President Trump from office is unpopular with a majority of voters in several key battleground states.\n\nThose results may loom large in the minds of Democrat members of the House of Representatives from those states as they consider how they will cast their ballots when a vote on impeachment proceedings comes to the floor of the House on Thursday.\n\nOne poll, conducted by Marquette Law, measured voter sentiment on impeachment in Wisconsin, while a second poll, conducted by The New York Times Upshot/Siena College, aggregated voter responses in six key battleground states–Pennsylvania, Wisconsin, Michigan, North Carolina, Arizona, and Florida.\n\n“When asked if Trump should be impeached and removed from office, 44 percent say that Trump should be removed, 51 percent say he should not be impeached and removed and four percent say they don’t know,” a poll of 799 registered voters in Wisconsin released last week by the Marquette Law Poll found.\n\nThe numbers were slightly higher when it came to whether or not the House should hold hearings on the issue of impeachment:\n\n46 percent think that there is enough cause now for Congress to hold hearings on impeachment of President Donald Trump, while 49 percent say there is not enough cause and 5 percent say they do not know.\n\nPresident Trump was not expected to win Wisconsin’s ten electoral college votes in the 2016 election, but on election night he won the state by a mere 44,000 votes. Along with Michigan and Pennsylvania, it is considered one of the three states Trump narrowly won in 2016 that he must win in 2020 to be re-elected.\n\nThe poll was conducted between October 13 and October 17, and has a margin of error of 4.2 percent.\n\nA mere majority vote in the House is required to impeach the president. Impeachment in the House then moves the matter to the Senate, which, under the Constitution, is required to hold a trial on the articles of impeachment approved by the House. A two-thirds vote in the Senate is required to convict and remove the president from office.\n\nThe New York Times Upshot/Siena College Poll of voters in six key battleground states–all won by Trump in 2016–shows impeachment and removal from office is unpopular in Pennsylvania, Michigan, Florida, North Carolina, and Arizona, as well as Wisconsin. By a ten point margin, 53 percent to 43 percent, voters in these six states oppose the impeachment and removal from office of the president.\n\nThe poll also found a bare majority of respondents in those six states favor the initiation of House proceedings by a 50 percent to 45 percent margin.\n\nVoters in the states likeliest to decide the presidency support the House impeachment inquiry but still oppose impeaching the president and removing him from office https://t.co/vSiOJNLIwX pic.twitter.com/UdEj6gcNJ2 — Nate Cohn (@Nate_Cohn) October 21, 2019\n\nThe poll of 1,934 registered voters in these six states was conducted between October 13 and October 20. Thirty two percent of respondents were Democrats, 29 percent were Republicans, and 37 percent were Independent/Other, according to the poll’s cross tabs. The cross tabs did not provide a state-by-state breakdown of the respondents, and as an aggregation of sentiment across six states, it is uncertain how the results might vary in each specific state.\n\nThe current party breakdown in the House of Representatives is 197 Republicans, one Independent, 234 Democrats – one of whom, Rep. Katie Hill (D-CA), announced her resignation on Sunday but has not yet named the effective date of that resignation – and three vacancies.\n\nThis means Speaker Pelosi needs 217 votes to ensure her resolution to initiate impeachment proceedings passes, if all 432 members eligible to vote cast their ballots and if Rep. Hill’s effective resignation date is not until after Thursday’s vote. In the event Hill’s resignation becomes effective prior to Thursday’s vote, the resolution will require 216 votes to pass, if all 431 members eligible to vote cast their ballots.\n\nWith or without Rep. Hill’s vote, Democrats can afford as many as 18 defectors to secure the votes needed to pass the resolution in the event all 197 Republicans vote to oppose the resolution and the sole Independent, Rep. Justin Amash (I-MI), votes in favor of it.\n\nOver the next 48 hours, the 31 Democrat members of the House of Representatives who represent districts President Trump won in 2016 are likely to come under intense pressure from Trump supporters in their districts to vote against the Pelosi impeachment resolution on Thursday.\n\nSix of these 31 Democrat members represent districts in these six key battleground states–Rep. Tom O’Halleran (D-AZ), Rep. Elissa Slotkin (D-MI), Rep. Haley Stevens (D-MI), Rep. Conor Lamb (D-PA), Rep. Matt Cartwright (D-PA), and Rep. Ron Kind (D-WI). Two of those six–Lamb and Kind–scored double digit victories in 2018.\n\nAccording to a head count of public statements about impeachment by House members, updated to October 22 by NPR, all but seven Democrats have publicly indicated their support for impeachment proceedings. Those seven Democrats yet to weigh in publicly are Rep. Jared Golden (D-ME), Rep. Ron Kind (D-WI), Rep. Joe Cunningham (D-SC) , Rep. Jeff Van Drew (D-NJ), Rep. Anthony Brindisi (D-NY) , Rep. Kendra Horn (D-OK), and Rep. Collin Peterson (D-MN).\n\nAll seven are among the 31 Democrats who represent districts won by President Trump in 2016.\n\nLate Tuesday, the first break in the wall of Democratic unity came when one of these seven Democrats, Rep. Van Drew (D-NJ) , announced that he would not support Thursday’s impeachment resolution, as Alex Moe of NBC News tweeted:\n\n“I would imagine that I’m not voting for it,” Dem @CongressmanJVD says about the impeachment process resolution the House will take up Thursday saying he hasn’t been supportive of impeachment all along.\n\n— Alex Moe (@AlexNBCNews) October 29, 2019", "description": "Polls show the effort of Democrats to impeach and remove Trump from office is unpopular with voters in several key battleground states.", "authors": ["Michael Patrick Leahy"], "top_image": "https://media.breitbart.com/media/2019/10/donald-trump-Carolyn-KasterAP-640x335.jpg", "published_at": "2019-10-29"}