{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7541757/Rugby-news-Eddie-Jones-dampens-fears-Billy-Vunipolas-twisted-ankle.html", "downloaded_at": "2019-10-05 23:07:25.553869+00:00", "title": "Rugby news: Eddie Jones dampens down fears over Billy Vunipola's twisted ankle", "language": "en", "text": "England booked their place in the quarter-finals but suffered a major injury scare over star No 8 Billy Vunipola.\n\nThe forward twisted his ankle in the first half of Saturday's 39-10 victory over Argentina and did not come out for the second half or the post-match celebrations.\n\nHe will be assessed by team medics on Sunday and Eddie Jones has no other specialist No 8 in his 31-man squad.\n\nEngland suffered a major injury scare over star No 8 Billy Vunipola in the Argentina win\n\nEddie Jones said he did not believe Vunipola's injury to be too serious after the game\n\nEngland now face France on Saturday in a battle for top spot, but they may be forced to reshuffle their back row.\n\n'We'll have a look at Billy and see what it's like,' said Jones. 'He's twisted his ankle but we don't think it's too serious.'\n\nPumas lock Tomas Lavanini was shown a red card for a high tackle on Owen Farrell.\n\nIt was the second red-card hit on England's captain in nine days, yet he was not taken off for a Head Injury Assessment.\n\n'It's obviously concussion that's the worry but I didn't get hit anywhere near the top of the head,' said Farrell. 'Maybe your jaw gets a bit sore but I was fine and there was no need for a HIA.'\n\nEngland may be forced to reshuffle their back row for their match with France next Saturday\n\nTougher challenges lie ahead for England, who have now won their opening three Pool C fixtures with a bonus point in each.\n\n'That was a banana skin game for us,' said Jones. 'We can only play who they put in front of us. They put two tier two teams and one tier one team and the referee decided they should have 14 men. All we can do is beat them. Obviously it will get tougher but that's what the competition is about.'\n\nEngland dominated all areas of the game but Jones was most pleased by his team's ability to adapt after the red card.\n\n'When they went down to 14 men, they possibly had a psychological lift and it's human nature that we dropped off a little bit because you think you're going to win the game,' said Jones. 'I was really pleased with how the players came back in the second half and dominated.\n\n'When you have 15 against 14, the seduction is to want to play phase rugby. We probably did that in the first half but in the second half we got back to playing good solid rugby.\n\nJones was pleased with the way that his team adapted after Argentina's red card\n\n'If you'd have said we'd have 15 points after three games, we'd be pretty happy.'\n\nMeanwhile, Jones has revealed he may not be able to attend the funeral of his old Randwick coach Jeff Sayle, who died last Monday, aged 77, this Friday.\n\nEngland play France in Yokohama on Saturday, leaving Jones with a logistical problem to get to Sydney and back in time without disrupting his side's preparation.\n\nJones paid an emotional tribute to his old mentor at England's press conference in Tokyo on Thursday when he described him as the sort of person rugby could not afford to lose.\n\nJones said: 'It'll be quite difficult to go [to the funeral]. Obviously, I'd like to go but I've got a lot of responsibility here and I'm conscious of that. The travel makes it difficult, so I doubt very much that I'll be going.'\n\nJones had received permission from the RFU to attend and would have missed Friday's captain's run ahead of the French game.\n\nSayle was a former Wallaby flanker who coached Randwick in the 1980s, when Jones, Australia head coach Michael Cheika, David Campese and the Ella brothers were all on their books.", "description": "Billy Vunipola twisted his ankle in the first half of Saturday morning's 39-10 victory over Argentina and did not come out for the second half of the clash or the post-match celebrations.", "authors": ["Nik Simon For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/21/19341614-0-image-a-8_1570305988338.jpg", "published_at": "2019-10-05"}