{"pub": "thehill", "url": "https://thehill.com/homenews/administration/468056-mulvaney-excluded-from-planning-for-raid-on-isis-leader-report", "downloaded_at": "2019-10-30 12:31:25.504773+00:00", "title": "Mulvaney excluded from planning for raid on ISIS leader: report", "language": "en", "text": "Acting White House chief of staff Mick Mulvaney John (Mick) Michael MulvaneyEx-Trump officials back Russia ambassador pick ahead of hearing The Hill's 12:30 Report: White House official testifies he warned about Trump pressure on Ukraine House committees ask key Mulvaney aide for testimony in impeachment inquiry MORE was reportedly left out of the meeting to plan for the raid in which ISIS leader Abu Bakr al-Baghdadi died.\n\nNBC News, citing multiple unidentified current and former Trump administration officials, reports that Mulvaney did not find out about the U.S. Special Forces operation in Syria until after it was underway.\n\nMulvaney was informed of the raid Saturday night, after President Trump Donald John TrumpNumber of uninsured children rises for second year, tops 4 million Trump moment from White House Halloween trick-or-treat event goes viral White House official says transcript of Ukraine call omitted key phrases: report MORE had already tweeted that “Something very big has just happened!,” according to the network.\n\nADVERTISEMENT\n\nThe chief of staff would normally be central to such a massive undertaking to help coordinate public statements and the informing of congressional leaders and allies, NBC News noted, adding that Bill Daley, White House chief of staff under former President Obama, who was in the Situation Room during the raid that took out Osama bin Laden.\n\nA White House official told NBC News that Mulvaney was absent because the “operation began very quickly, and while he was not able to get to a secure location in time to participate, he was briefed on its success upon conclusion.”\n\nMulvaney was reportedly home in South Carolina when he learned of the raid.\n\nThe development comes amid reports that Trump is considering replacing his acting chief of staff. Trump has refuted those reports.\n\nTrump also did not tell congressional leaders about the raid in advance, citing “Washington leaks.”\n\nDemocrats fumed at Trump’s decision to not inform them, as Speaker Nancy Pelosi Nancy PelosiOvernight Defense: House approves Turkey sanctions in rebuke of Trump | Trump attacks on Army officer testifying spark backlash | Dems want answers from Esper over Ukraine aid Mark Mellman: Three questions for Republicans White House: Democrats' resolution shows impeachment is 'illegitimate sham' MORE (D-Calif.) and Senate Minority Leader Charles Schumer Charles (Chuck) Ellis SchumerSenate Democrat: Colleague was working on fantasy football trade instead of listening to Schumer Senate Democrats to vote this week to overturn Trump ObamaCare moves Man explains refusing to shake McConnell's hand at Cummings memorial: 'I couldn't do it' MORE (D-N.Y.) did not learn about the raid until after it occurred.\n\nSenate Majority Leader Mitch McConnell Addison (Mitch) Mitchell McConnellOvernight Defense: House approves Turkey sanctions in rebuke of Trump | Trump attacks on Army officer testifying spark backlash | Dems want answers from Esper over Ukraine aid Mark Mellman: Three questions for Republicans Menendez seeks probe into if Pompeo violated Hatch Act MORE (R-Ky.) and House Minority Leader Kevin McCarthy Kevin Owen McCarthyTrump attacks on Vindman trigger backlash DC's liaison to rock 'n' roll House GOP to shift from focus on fighting impeachment process: report MORE (R-Calif.) were also not informed of the raid in advance.", "description": "Acting White House chief of staff Mick Mulvaney was reportedly left out of the meeting to plan for the raid in which ISIS leader Abu Bakr al-Baghdadi died.", "authors": [], "top_image": "https://thehill.com/sites/default/files/mulvaneymick_090919getty.jpg", "published_at": "2019-10-30"}