{"pub": "npr", "title": "How Teenage Sisters Pushed Bali To Say 'Bye-Bye' To Plastic Bags", "url": "https://npr.org/sections/goatsandsoda/2019/01/26/688168838/how-teenage-sisters-pushed-bali-to-say-bye-bye-to-plastic-bags", "language": "en", "published_at": "2019-01-26", "downloaded_at": "2019-09-02 07:26:42.496765+00:00", "text": "How Teenage Sisters Pushed Bali To Say 'Bye-Bye' To Plastic Bags\n\nEnlarge this image toggle caption Alexander Koerner/Getty Images Alexander Koerner/Getty Images\n\nFive years ago, two young women decided they were going to do something about the plastic problem on their island of Bali.\n\nAnd Bye Bye Plastic Bags was born.\n\nHow young? So young one of them couldn't make it to our midweek interview. \"She's at school,\" explained 18-year-old Melati Wijsen, talking about her 16- year- old sister Isabel.\n\n\"She's just halfway through grade 11 and she's putting her focus more into graduating high school.\"\n\nAbout 'The Plastic Tide' NPR is exploring one of the most important environmental issues of our time: plastic waste. Click here to read more about the topic.\n\nBali is part of the island nation of Indonesia, which is the world's second biggest polluter when it comes to marine plastic, trailing only China. And when ocean currents carry that plastic to the tourist island of Bali, it's a public relations nightmare. This video taken by British diver Rich Horner last year pretty much sums up the scale of the problem as he tries to navigate through a sea of plastic just below the water's surface.\n\nThe two sisters got the idea for Bye Bye Plastic Bags in 2013 after a lesson at school about influential world leaders — change-makers — including Nelson Mandela, Martin Luther King Jr. and Mahatma Gandhi.\n\n\"My sister and I went home that day thinking, 'Well, what can we do as kids living on the island of Bali?' \" Melati Wijsen says.\n\n\"You see, we didn't want to wait until we were older to start making a difference. It wasn't even a question, really. It was more like, what can we do, as kids, right now.\"\n\nThe answer was right in front of them. Literally. On the beach in front of their home.\n\n\"It got to the point where on weekends when we would go to our childhood beach, if we went swimming there, a plastic bag would wrap around your arm, Wijsen says. \"And you say just, enough is enough.\"\n\nThey went online and discovered that over 40 countries had already banned or taxed plastic bags.\n\n\"We thought, 'Well, if they can do it, c'mon, Bali! C'mon, Indonesia! We can do it, too!' \" Wijsen says. \"So, without a business plan or a strategy or a budget, like my mom will tell you, we went forward with a pure passion and intention to make our island home plastic bag free.\"\n\nThey got some friends together, went online to start a petition and got 6,000 signatures in less than a day, Wijsen says. They spread awareness through school and community workshops. The organized massive beach cleanup campaigns, all the while drawing international attention and that of local politicians too. Especially when they decided to up the ante optics-wise.\n\n\"I think one of the biggest tools that pushed us forward was our decision to go on a food strike,\" Wijsen says, inspired, she says, by one of the tools used by Gandhi. \"He also had peaceful ways of reaching his goals, of getting attention, So that was a huge inspiration for us.\"\n\nThe sisters put the word out about their plan on social media. Local media picked it up, and that's prompted the governor at the time, I Made Pastika, to do what any savvy politician would do when faced with two teenage girls threatening a hunger strike. He invited them to come see him. \"Within 24 hours, we had a phone call and then the next day we were picked up from school and escorted to the office of the governor,\" Wijsen says.\n\nPastika signed a Memorandum of Understanding with the sisters to work toward eliminating plastic on the island — and later pledged to rid Bali of plastic bags by 2018. That didn't happen, but the sisters kept engaging government at every level — local, municipal and national — to keep up the pressure. Melati Wijsen says she learned a lot about dealing with politicians in the process.\n\n\"Yeah, well, being 14 and skipping school on a Tuesday because I had to learn about draft regulations and suggestions really was an interesting learning curve for me,\" she says. Dancing with politicians, she says, is like three steps forward, two steps back and again, and again. It's almost like the cha-cha. I learned a lot of different things.\"\n\nWijsen says that in the past year she's spent about 100 nights on the road with speaking engagements to get out the anti-plastic message and to talk about youth empowerment as well. The sisters have given a TED talk, spoke at the U.N. in New York and again last year at the IMF World Bank Forum in Bali. World Bank CEO Kristalina Georgieva called Melati \"a girl that is changing the world around her.\"\n\nThey've also been named among the world's most influential teenagers by Forbes, Time magazine and CNN.\n\nAnd just last month, the new governor of Bali announced a law banning single-use plastic in 2019, thanks in part to the sisters' efforts and those of like-minded NGOs.\n\nBusinesses have six months to comply or face having their business permits revoked.\n\nMelati Wijsen was thrilled with the news. But she says there's still lots of work to be done spreading the no-plastic gospel not just in Bali and Indonesia but around the globe.\n\nSo Bye Bye Plastic Bags is multiplying. \"We're actually now in 28 locations around the world, and it's all led by young people,\" Wijsen says. \"We've created a starter kit and a handbook that guides them through this process of how to start a movement.\"\n\nShe says this global expansion is one of the most inspiring parts of being part of Bye Bye Plastic Bags \"because ... we literally prove that kids can do things, and Bye Bye Plastic Bags has become this platform where kids can feel like their voices are being heard.\"\n\nShe wants to continue being heard — and demanding change. And she wants other young people to do the same: \"For us, everything is happening in our lifetime, right? So we have to be the ones to start working toward the future and the world that we want to be a part of.\"\n\nIn addition to efforts in Bali, the Indonesian government has pledged to do its part in eliminating the scourge of plastic pollution. It's committed to reducing plastic pollution by 70 percent by 2025. Melati Wijsen will be closely monitoring their efforts.\n\nShe's graduated from high school but is committed to her campaign: \"This is my No. 1 focus right now,\" she says. \"It consumes almost every thought in my body. I mean, it's like a full-time job.\"\n\nIs she obsessed or just focused? \"A healthy chunk of both,\" she says, laughing, adding that her mother helps keep her balanced. \"Some days, she'll just be like, 'Melati, take a day off, like go to the beach with your friends and just don't pick up the plastic, just sit there.' \" She is going to the beach — on Feb. 16, when Bye Bye Plastic Bags is planning its biggest beach cleanup ever.", "description": "Plastic is choking our oceans. Inspired by Gandhi's activism, two young women on the island of Bali are on a mission to do something about it.", "authors": ["Michael Sullivan"], "top_image": "https://media.npr.org/assets/img/2019/01/25/wijsen-05034604_wide-7f90d89331ccc9eda939bd2150861fc89aaf2b86.jpg?s=1400"}