{"pub": "businessinsider", "url": "https://businessinsider.com/disney-ceo-bob-iger-apple-board-resigns-2019-9", "downloaded_at": "2019-09-14 01:48:27.828330+00:00", "title": "Disney CEO Bob Iger steps down from Apple's board ahead of the launch of the tech company's new streaming service", "language": "en", "text": "Disney chief executive Bob Iger has stepped down from his position on Apple's board of directors, as the tech giant confirmed the launch plans for its video-streaming platform this week.\n\nIger's resignation was noted in an SEC filing that was released to the public on Friday. The filing was originally made this Tuesday, the same day as Apple's product event, where the company revealed more information about its subscription streaming service, Apple TV Plus.\n\nThe Disney chief exec had served on Apple's board since 2011. His presence on the board, however, had become increasingly complicated as of late as Apple's sluggish hardware business forced it to consider alternative revenue streams, like a subscription news service and Netflix-competitor.\n\nDisney itself recently announced a streaming service of its own in April — Disney Plus — further entangling Iger's commitments.\n\nAs the New York Times noted, Iger told reporters earlier this year that he would step out of the room when the board started discussing Apple's plans for a streaming service. Iger said, however, that because Apple's business was mostly focused on hardware, he wouldn't have to step out for very long.\n\nAmid Tuesday's news that Apple TV Plus will launch on November 1st and cost $5 per month, apparently Iger decided it was time to step down.\n\n\"I have the utmost respect for Tim Cook, his team at Apple and for my fellow board members,\" Iger said in the statement, first published by the Times. \"Apple is one of the world's most admired companies, known for the quality and integrity of its products and its people, and I am forever grateful to have served as a member of the company's board.\"\n\nRead more: Apple TV Plus is a 'major shot across the bow' to Netflix and Disney. Here's what Wall Street is saying about Apple's streaming ambitions.\n\nApple responded to Iger's departure in a statement obtained by the Times: \"More than anything, Bob is our friend. He leads with his heart, and he has always been generous with his time and advice. While we will greatly miss his contributions as a board member, we respect his decision, and we have every expectation that our relationship with both Bob and Disney will continue far into the future.\"\n\nIger's decision to leave isn't the first time a high-powered executive stepped down from Apple's board over potential conflicts of interest.\n\nEric Schmidt, Google's former CEO, used to sit down at the table with Steve Jobs as a member of Apple's board. But as the two company's businesses increasingly converged — namely, as competition between iOS and Android heated up — Schmidt said the situation became too awkward and ultimately, he decided to resign.", "description": "\"I am forever grateful to have served as a member of the company's board,\" Disney chief executive Robert Iger said in a statement.", "authors": ["Nick Bastone"], "top_image": "https://amp.businessinsider.com/images/59d392ee351ccf83028b73f3-2732-1366.jpg", "published_at": "2019-09-13"}