{"pub": "fox", "url": "https://foxnews.com/entertainment/hustlers-jennifer-lopez-fur-protest-toronto-film-festival", "downloaded_at": "2019-09-08 23:28:23.089556+00:00", "title": "'Hustlers' star Jennifer Lopez heckled for wearing fur at Toronto Film Festival premiere", "language": "en", "text": "Jennifer Lopez maintained her cool at the Toronto International Film Festival on Saturday night, where anti-fur protesters called her out at the \"Hustlers\" premiere.\n\nIn a video obtained by TMZ, protesters holding signs can be heard screaming, \"Shame on you, JLo, for wearing fur! Shame on you for wearing fur Jennifer Lopez! Stop wearing fur Jennifer Lopez! Stop wearing fur JLo! Stop wearing fox fur!\"\n\nOne yells that Lopez, 50, has killed \"thousands of animals\" by wearing fur through the years, while another shrieked that the Bronx native has \"blood on her hands.\"\n\nJENNIFER LOPEZ FLAUNTS ABS IN PINK BIKINI: 'I'M A HUSTLER, BABY'\n\nJENNIFER LOPEZ TEACHES CONSTANCE WU TO POLE DANCE IN NEW 'HUSTLERS' TRAILER\n\nLopez sports fur in \"Hustlers\" and has posted photos of herself in a fur coat from the film, but it's unclear whether it's real or faux.\n\nShe did not appear to respond to the demonstrators. She was not wearing any fur at the premiere.\n\nIt wasn't the \"Dance Again\" singer's only hiccup from the evening.\n\nJENNIFER LOPEZ, CARDI B AND MORE FEATURED IN 'HUSTLERS' MOVIE TEASERS\n\n'HUSTLERS' STAR JENNIFER LOPEZ WAS TERRIFIED TO DANCE IN G-STRING\n\nWhile waving to fans in a balcony at the premiere of the stripper-Robin Hood flick, Lopez tripped and almost fell to the level below, eliciting gasps from onlookers.\n\nLopez previously had a terrifying experience filming the movie, though it was a much different kind of horror.\n\nWHY JENNIFER LOPEZ 'FELT SICK' WATCHING STRIPPER FLICK 'HUSTLERS' FOR THE FIRST TIME\n\n\"It's not like me being on stage with a bunch of tights and fishnets on and bodysuits,\" she said. \"Those are sexy costumes. This is another level. You're out there naked!\"\n\nIn one scene, Lopez dances in a G-string to establish her character's reputation as the Big Apple's most cunning stripper. That doesn't mean she actually felt that way at first, though.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“I was terrified,” the \"Dance Again\" singer confessed to Variety. “I felt exposed. I was like, ‘I’ve never done anything like this. I’m going to be up there in f---ing dental floss. What is this? Who is this person?’ \"", "description": "Jennifer Lopez maintained her cool at the Toronto International Film Festival on Saturday night, where anti-fur protesters called her out at the \"Hustlers\" premiere.", "authors": ["Jessica Sager"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/jennifer-lopez-hustlers-tiff-getty.jpg", "published_at": "2019-09-08"}