{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/arsenal-chief-tells-unai-emery-20559184", "downloaded_at": "2019-10-11 12:57:01.070029+00:00", "title": "Arsenal chief tells Unai Emery he must qualify for the Champions League", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Arsenal FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nArsenal boss Unai Emery has been told it’s Champions League or bust this season.\n\nThe Gunners finished fifth in the Spaniard’s debut campaign at the Emirates last term after a run of just eight points in their final seven matches in the Premier League.\n\nThey also reached the Europa League Final, only to be thrashed in Baku by an Eden Hazard-inspired Chelsea .\n\nThis summer saw Emery freshen up his squad with the £72million arrival of Nicolas Pepe, defensive duo Kieran Tierney and David Luiz, young striker Gabriel Martinelli and Spain international Dani Ceballos - who arrived on loan from Real Madrid .\n\nCurrently, despite question marks over the side’s defence and an embarrassing second half at Watford - in which they threw away a two-goal lead - Arsenal sit third in the table, one point behind champions Manchester City .\n\n(Image: Robin Jones - AFC Bournemouth)\n\nAnd speaking at a fan’s forum on Thursday night,head of football Raul Sanllehi has made it clear that Emery is expected to deliver Champions League football for 2020-21.\n\n“We said to Unai that we just missed out on qualifying for the Champions League last year,\" said Sanllehi.\n\n“But this year, with a stronger squad, we expect you to do that.\"\n\n(Image: David Price)\n\nEmery signed a two-year contract in north London - with the option for a further year - when replacing Arsene Wenger in 2018.\n\nFailure to reach Europe's premier club competition next term doesn't necessarily mean Arsenal won't take up the option in the ex-Sevilla coaches' deal - but it certainly won't help his cause.\n\nOn the subject of out-of-favour Mesut Ozil, who has been missing from matchday squads of late and has made just two appearances so far this term, Sanllehi laid the blame for his recent absences squarely at the £350,000-a-week midfielder’s feet.\n\n\"Unai's policy has always been to play the ones that work hard in training.\"", "description": "The Spaniard signed a two-year deal with a year's option when replacing Arsene Wenger in 2018", "authors": ["Alex Richards", "Image", "Robin Jones - Afc Bournemouth", "David Price"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20524617.ece/ALTERNATES/s1200/0_Arsenal-FC-v-AFC-Bournemouth-Premier-League.jpg", "published_at": "2019-10-11"}