{"pub": "thehill", "url": "https://thehill.com/blogs/congress-blog/politics/467335-west-virginia-shines-a-spotlight-on-absurdities-of-tariff", "downloaded_at": "2019-10-25 00:03:40.991874+00:00", "title": "West Virginia shines a spotlight on absurdities of tariff bailout program", "language": "en", "text": "Recent reports that an agricultural company owned by our governor’s family received the maximum $125,000 in trade-war bailout money from the federal government have raised some eyebrows.\n\nBut the real issue is not about farmers, it’s about a government $22 trillion in debt handing out six-figure checks as part of a carrot-and-stick game in which $28 billion in bailouts serve as a political Band-Aid for the injury caused by flawed trade policies.\n\nThe Market Facilitation Program was created to offset losses caused by U.S. tariffs and the retaliatory tariffs imposed by countries that import American agricultural products. In other words, the government caused a problem, then created a new government program to “fix” the problem it created.\n\nHere’s an idea. Get rid of the first problem and you won’t need to spend money in a convoluted attempt to fix some of the damage it is doing.\n\nInstead of imposing tariffs on our trading partners that disrupt supply chains, cost our farmers markets and kill American jobs, let’s embrace trade by getting rid of barriers instead of erecting new ones.\n\nMany farmers want access to foreign markets, not handouts from Washington.\n\nTaxpayers want to be protected from pointless government spending, especially when it subsidizes those who need it least.\n\nAnd make no mistake: This is not about family farmers struggling to survive as they’re left twisting in the wind by tariff policy.\n\nMost of the tariff bailouts are being paid to the biggest farms that don’t need the help, according to the Environmental Working Group, which opposes farm subsidies. About 10 percent of bailout recipients last year received more than half the payments. The top 1 percent of recipients of trade relief received an average payment of $183,331. That’s nearly three times the U.S. median household income of $61,937.\n\nSo far, the farm bailout has cost taxpayers more than twice what the $12 billion auto bailout cost in 2009. And there’s no end in sight.\n\nMarkets have been lost, commodity prices have been hurt, and production costs have risen thanks to tariffs on metals that drove up the cost of equipment.\n\nSoybean exports to China for this year will most likely be about one-third what they were before the start of the trade war. Exports of dairy products to China have dropped more than 50 percent. Rather than punishing China, $28 billion in bailouts is proof that Americans are being harmed by these misguided tariffs and protectionist trade policies.\n\nPaying off farmers with borrowed money isn’t the answer. Neither is doubling down on the trade war. As we’ve already seen, tariffs beget more tariffs by inviting trade partners to retaliate with their own barriers that limit the ability of U.S. companies to sell their products abroad. We respond in kind. And on and on. And, of course, affected industries then feel obligated to ask the government for taxpayer-funded assistance.\n\nInstead of perpetuating this cycle, we should end it. Maybe outrage over payments to our governor will be enough to inspire people to demand change.\n\nBut demands for change to this ridiculous system should be aimed at Congress and the White House.\n\nJason Huffman is state director of Americans for Prosperity-West Virginia.", "description": "Paying off farmers with borrowed money isn’t the answer. Neither is doubling down on the trade war. As we’ve already seen, tariffs beget more tariffs. Instead of perpetuating this cycle, we should end it. Maybe outrage over payments to our governor will be enough to inspire people to demand change.", "authors": [], "top_image": "https://thehill.com/sites/default/files/justicejim08032017getty.jpg", "published_at": "2019-10-24"}