{"pub": "cbc", "url": "https://cbc.ca/sports/hockey/nhl/tyson-barrie-maple-leafs-under-radar-1.5308228", "downloaded_at": "2019-10-03 23:28:51.612566+00:00", "published_at": "2019-10-03", "title": "CBC Sports", "language": "en", "text": "In most cities and on most teams, acquiring a dynamic offensive defenceman in a blockbuster trade would dominate training camp chatter and make waves on opening night.\n\nTyson Barrie has been on the cusp of hitting 60 points the last two seasons and figures to play an important role in driving the offence for a franchise with Stanley Cup aspirations.\n\nHe's also now a member of the Toronto Maple Leafs, and for anyone not paying attention, the team has produced its fair share of news over the last month.\n\nMitch Marner's contract impasse and resolution, the fallout from the charge against Auston Matthews in Arizona, and the captaincy soap opera have, quite frankly, sucked up most of the oxygen.\n\nIt's pushed Barrie to the periphery of the conversation — at least for now — and that suits him just fine.\n\n\"You hear so much about the fan base and the media in Toronto,\" said the 29-year-old. \"It's obviously there, but I think it is a little nice to fly under the radar with everything that was going on.\n\n\"It's made it easier, but now it's time for me to deliver and play well.\"\n\nBarrie did that with two assists in Wednesday's 5-3 victory over the Ottawa Senators in the season opener, including a spin-o-rama at the blue line before feeding Ilya Mikheyev for the rookie's first NHL goal.\n\n\"He's very calm with the puck at the point,\" Toronto's Jake Muzzin said of his defence partner. \"You saw some moves ... which not a lot of guys do.\"\n\nA third-round pick in the 2009 NHL draft by the Colorado Avalanche, Barrie put up a career-high 59 points last season (14 goals, 45 assists) in 78 games after registering 57 points (14 goals, 43 assists) in 10 fewer outings during the 2017-18 campaign.\n\n'One of the best in the league'\n\nThe Victoria native was a key contributor for the Avalanche, but found himself on the move this summer along with forward Alexander Kerfoot in a trade with the Leafs that saw centre Nazem Kadri head the other way.\n\n\"One of the best in the league,\" Kerfoot said of Barrie. \"He just makes things happen.\"\n\nPart of the reason for the swap from a Colorado perspective was a deep prospect pool and the fact Barrie has only the 2019-20 campaign remaining on his current contract, which carries a $5.5-million US salary cap hit before the possibility of testing unrestricted free agency next summer.\n\nThe way high-end defenceman are getting paid these days, Barrie could be in for a big windfall July 1 if he doesn't re-sign with Toronto, but that's not something the Leafs are worried about right now.\n\n\"He's got a real good skill set with the puck, a real good understanding of the game,\" head coach Mike Babcock said. \"He's just scratching the surface. We think he can take a huge step this year.\"\n\nBut while there was plenty of attention following the trade, that died down quickly in a Toronto summer that was dominated by the negotiations between the Leafs and Marner — a restricted free agent at the time — on a new deal.\n\nThen after the star winger signed his big-money extension at the start of camp, news broke that Matthews is facing a charge of disorderly conduct and disruptive behaviour stemming from an alleged incident, which he failed to disclose to the team, in his hometown of Scottsdale, Ariz., back in May. None of the allegations have been proven in court.\n\nTo top it all off, there was the near-constant talk swirling around who the Leafs would name as their captain before John Tavares was finally unveiled before Wednesday's game.\n\nThen on the ice, Matthews scored two goals to steal the post-game headlines along with Tavares, and overshadow Barrie's two-point night in his blue-and-white debut.\n\n'He's a guy you'll notice more and more'\n\n\"He flies under the radar a little bit, just because of everything that's going on,\" Leafs defenceman Morgan Rielly said. \"He's going to be a big part of what we're doing.\"\n\nBarrie had a boatload of talent up front in Colorado with Nathan MacKinnon, Mikko Rantanen and Gabriel Landeskog. He means no disrespect, but a stable of forwards that includes Matthews, Marner and Tavares — just to name a few — presents even more avenues for him to contribute.\n\n\"It's a lot of fun to be able to jump in the play and having these guys looking for you,\" Barrie said. \"It's been a lot of fun so far and it's one game in.\"\n\nMuzzin, who battled Barrie in the Western Conference with the Los Angeles Kings, was partnered with his now-NHL teammate for Canada at the 2015 world championship and is eager to see what this season brings the complementary pair.\n\n\"I was excited,\" Muzzin, who is more likely to hang back and let Barrie push the pace offensively, said of his initial reaction to the trade. \"It was a nice addition for me and the team.\"\n\nBut Leafs goalie Frederik Andersen might have put it best in terms of where Barrie currently stands and where he could soon find himself — in the spotlight.\n\n\"He's a guy you'll notice more and more.\"", "description": "In most cities and on most teams, acquiring a dynamic offensive defenceman in a blockbuster trade would dominate training camp chatter and make waves on opening night.", "authors": [], "top_image": "https://i.cbc.ca/1.5308243.1570140202!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/tyson-barrie.jpg"}