{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/stocks/useless-indices-are-not-telling-the-real-story-of-this-market-15085930", "downloaded_at": "2019-09-11 13:51:27.070292+00:00", "title": "Useless Indices Are Not Telling the Real Story of This Market", "language": "en", "text": "The major market indices -- the DJIA, the S&P 500 and the Nasdaq -- are widely followed because they are supposed to be easy and convenient ways to measure the overall health of the stock market. Most of the time stocks do move in a loosely correlated fashion so when the DJIA is trading strongly then most stocks are also doing OK.\n\nHowever, there are times when the indices are not very good indicators and do a poor job of illustrating overall market health. We currently are in one of those periods. What is really happening in the stock market right now is not at all evident in the indices.\n\nOver the last four days, the DJIA is up over 2%, which looks like a very healthy breakout move triggered by optimism on China trade, but there has been carnage in high-momentum stocks that have been recently favored by hedge funds. Leading sectors such as cloud computing, software, and precious metals have fallen sharply. The Innovator IBD 50 ETF (FFTY) , which is comprised of key momentum stocks, has fallen nearly 6% in two days.\n\nFor some reason, there has been a sudden rotation out of expensive growth and momentum stocks and into cheaper value names. There is no obvious catalyst for this move but it has created extremely chaotic action under the surface and has rendered the major indices useless as indicators of overall market action.\n\nIn recent months the debate between big-picture bulls and bears has been intensifying. The bears have been increasingly confident that a major correction is about to take place while the bulls have stayed optimistic that friendly central bankers will keep the indices running higher on a steady supply of cheap capital.\n\nThe stock market is often a perverse beast and will act in a manner that frustrates as many people as possible. This dramatic rotational action is doing just that. The bears that were counting on the indices to trend down are not benefiting at all from the breakdown in momentum names. The bulls that were looking to profit from leading stocks breaking to new highs are being pounded as their favorites fall apart.\n\nMost interestingly, no one really saw this under-the-surface corrective action coming. There were plenty of bull and bear narratives but the possibility of a rolling correction caused by sector rotation was little discussed. Growth stocks have been leading for so long that it was anticipated that when they weakened they would take the entire market down with them.\n\nIn the early going on Wednesday, indications are mixed again. The indices are mixed and there isn't any major news flow driving the action. The big question is whether the momentum and growth names can find their footing and turn back up or will this rotational action continue to wreak havoc on various market sectors.\n\nThis action is hurting sentiment as investors see good action in the indices but then find their portfolios impacted as their favorite growth names are hit hard. It is not very logical action and produces a defensive mindset.\n\nMy game plan is to try to avoid the downside momentum as much as possible to try to find some stocks that have unfairly sold off and may produce a quick bounce.\n\nOverall this sort of rotation bodes poorly but the lesson of the recent action is that it is foolish to believe that you can predict what is going to happen next.", "description": "What is really happening in the stock market right now is not at all evident in the indices....FFTY", "authors": ["James", "Rev Shark", "Useless Indices Are Not Telling The Real Story Of This Market", "No One Really Saw This Under-The-Surface Corrective Action Coming.", "Stocks Quotes In This Article", "Bruce Kamich", "Stephen Guilfoyle", "Maleeha Bengali", "Chris Versace", "Paul Price"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/7e9c784e-ccd3-11e9-848d-2b058edb8c1a.jpg", "published_at": "2019-09-11"}