{"pub": "cbc", "url": "https://cbc.ca/sports/football/cfl/cfl-week-15-calgary-stamperders-toronto-argonauts-1.5292445", "downloaded_at": "2019-09-21 03:37:36.983150+00:00", "title": "Sports-no-CBC", "language": "en", "text": "Bo Levi Mitchell threw for 346 yards and a TD as the Calgary Stampeders beat Toronto 23-16 on Friday night to continue their mastery of the Argonauts.\n\nMitchell finished 33-of-48 passing with two interceptions to improve to 11-0 all-time versus Toronto (2-10). And Calgary (9-4) earned its 12th straight regular-season win over the Argos and seventh consecutive road victory here.\n\nHowever, Toronto did upset Calgary 27-24 in the 2017 Grey Cup game in Ottawa.\n\nCalgary improved to 4-0 with Mitchell back under centre despite being without the CFL's leading receiver (Reggie Begelton) and tackles leader (middle linebacker Corey Greenwood). It wasn't a clean performance as the Stampeders committed three turnovers and could only muster a second-half field goal.\n\nAnd that allowed Toronto to score 10 fourth-quarter points to pull to within 23-16 with 1:56 to play. James Franklin found Derel Walker on a 35-yard TD strike at 13:04 after Tyler Crapigna booted a 35-yard field goal at 10:40 before a season-low BMO Field gathering of 9,819.\n\nThat's as close as Toronto would get. Calgary took over at its 25-yard line with 1:51 and ran out the clock to drop the Argos to 2-4 in their last six games after starting the season 0-6.\n\nToronto did sack Mitchell once, something that hadn't happened in his previous three contests. But the Stampeders' defence registered six, including two each for Toronto native Derek Wiggan and Mike Rose.\n\nCalgary converted two Toronto turnovers (interception, downs) into 10 points (TD, field goal). The Stampeders came into the game leading the CFL in interceptions (19) and points off turnovers (93) and tied with Winnipeg for most turnovers forced (35).\n\nFranklin replaced starter McLeod Bethel-Thompson in the third and marched the Argos 64 yards on six plays, setting up Crapigna's 36-yard field goal at 11:04 to cut Calgary's lead to 20-6.\n\nFranklin finished 12-of-16 passing for 147 yards and a TD. Bethel-Thompson was 12-of-18 passing for just 86 yards with an interception after throwing 12 TD passes and just two interceptions in his previous five starts.\n\nHowever, Toronto's offence — which had averaged 418 net yards in the previous five games — struggled with consistency on a night when the Toronto Maple Leafs hosted the Buffalo Sabres in NHL exhibition action. Also, it was the Argos' first game here since 41-26 loss to Edmonton on Aug. 16.\n\nTerry Williams and Ka'Deem Carey scored Calgary's touchdowns. Rene Paredes added two converts and three field goals.\n\nCrapigna accounted for Toronto's scoring with three field goals.\n\nParedes gave Calgary a 20-3 half-time lead with a 17-yard boot at 14:31 of the second. It came after Toronto mysteriously gambled (unsuccessfully) on third-and-five, giving the Stampeders the ball at the Argos' 53-yard line.\n\nMitchell methodically marched the Stampeders to the Toronto 10-yard line before two incompletions set up Paredes' boot.\n\nAnd yet, Toronto played it safe on third-and-goal from the Calgary two-yard line, settling for Crapigna's nine-yard field goal at 8:13. Kennan Gilchrist's interception put the Argos at the Stampeders' nine-yard line.\n\nParedes put Calgary up 17-0 with a 42-yard field goal at 4:18.\n\nMitchell's 11-yard TD strike to Carey to end the first staked Calgary to a 14-0 advantage. It capped a three-play, 58-yard march that was set up by Royce Metchie's interception.\n\nWilliams opened the scoring by converting a second-and-two toss into a 23-yard TD run at 7:45.", "description": "Bo Levi Mitchell threw for 346 yards and a TD as the Calgary Stampeders beat Toronto 23-16 on Friday night to continue their mastery of the Argonauts.", "authors": ["The Canadian Press"], "top_image": "https://i.cbc.ca/1.5292572.1569029452!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/stampeders-argonauts.jpg", "published_at": "2019-09-21"}