{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/18/the-wonderwall-minnesota-united-has-steep-backing-", "downloaded_at": "2019-10-18 08:03:17.568350+00:00", "title": "The Wonderwall: Minnesota United has steep backing behind it", "language": "en", "text": "ST. PAUL, Minn. (AP) - When Minnesota United takes the pitch for the franchise’s first match in the MLS playoffs, the Loons will have a stadium full of fired-up fans behind them.\n\nIf the home team wins, the scene at Allianz Field will become, for a few minutes, a 19,400-person karaoke bar with the patrons passionately belting out one of the biggest hits by the 1990s British pop band Oasis.\n\n“Wonderwall” is the song. It’s also the aptly named section of seats for the most ardent followers of this fledgling soccer club. They hover ever so steeply behind the south goal at the open-air European-style venue that has brightened a worn-down neighborhood with LED lighting, translucent skin, and a curvy, 360-degree canopy.\n\n“There’s a massive connection between the club and the fans. They expect it a long, long time in a city like this,” goalie Vito Mannone said. “When you work so much, and you wait so many years to be that team that opens a new stadium, that’s what happens. It’s a great atmosphere every game. We made it a fortress for teams to come here and get points.”\n\nMinnesota United, which plays the Los Angeles Galaxy in a first-round game on Sunday night, finished in fourth place in the Western Conference this season on the strength of a 10-1-6 record at its new home. The Loons played their first two years as an MLS team a few miles to the west at TCF Bank Stadium, a college football facility well more than double the size of Allianz Field.\n\nThe first season in the new place was a smash, with an average attendance of 19,723 that was over official capacity. That ranked 10th in the league, with Atlanta United (52,510) and the Seattle Sounders (40,247) again the front-runners for crowds in their NFL stadiums. According to figures compiled by Soccer Stadium Digest, league-wide attendance in 2019 took a slight dip from the previous year, though the downsized home of the Loons was one factor. They averaged 23,902 fans in 2018.\n\n“You can see the relationship that’s developing between the players and the crowd, which is always a great sign,” Minnesota United coach Adrian Heath said. “They’ve been incredible. The supporters have been everything we expected for this stadium, and I think the players have been that as well. They’ve given performances here that they’ve been excited about.”\n\nMinnesota United owner Bill McGuire, a former health care executive who bought the team in 2012 to save the financially strapped club from folding while it was in the lower-tier North American Soccer League, worked closely with the architectural firm Populous to design a robust supporters’ section in attempted replication of the most vibrant stadiums around the MSL and the world. They listened to feedback from the fans, too.\n\nWhat developed from those discussions was the Wonderwall, a 2,920-seat, pyramid-shaped area that allows for safe standing and rises at a sharp 35-degree incline to keep the highest rows as close to the field as possible. As with other venues around the game, the energy derived from the chanting, clapping, jumping, drum beating, flag waving and scarf raising originates there.\n\n“The attitude and enthusiasm and involvement with the game that the supporters traditionally play now exists throughout the stadium,” McGuire said. “Everybody is engaged. It is not just a group of the super fans sitting down at one end, conducting their own business.”\n\nMany of the fans that fill the Wonderwall have backed the team since it played for much smaller crowds in Blaine, a suburb about 20 miles north of the current stadium where the Loons continue to keep a practice facility.\n\n“I think it helps that we’ve come from a lower division together,” said Sam Solberg, the president of the Dark Clouds, one of the two major fan groups along with True North Elite. “There are a lot of established relationships there, which is huge in our ability to support the stadium and support the team and in the team’s ability to form a strong fan base. I think the supporters’ group can be the heart and soul of a stadium, and I think this year has demonstrated that.”\n\nSafe standing areas like the Wonderwall are becoming a popular fixture of MLS venues, with Los Angeles FC, Orlando and San Jose also among them. The 1989 disaster at Hillsborough Stadium in England, when a crush of fans entering a stadium trampled 96 people to death and injured more than 700 others, prompted a ban on standing at soccer games for the top two tiers in England.\n\nThere has been a recent push for some English teams to restore standing, and Tottenham’s new stadium has rails just in case it’s allowed again. Because of the ban in England, clubs in Germany have to replace standing areas with fixed seats for Champions League and Europa League matches. For instance, Borussia Dortmund’s capacity drops from 81,365 to 65,829 when its famous yellow wall is eliminated.\n\nIn this crowded Twin Cities market for sporting events, moving up to MLS required for the league, the team and the city some faith that Minnesota United’s small-but-loyal fan base would reproduce with greater exposure.\n\n“The whole place is loud and involved, and everybody stays to the end,” McGuire said. “It’s an extraordinary experience, and I think a lot of that is the spillover from this great supporters’ group.”\n\n___\n\nMore AP soccer: https://apnews.com/apf-Soccer and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "When Minnesota United takes the pitch for the franchise's first match in the MLS playoffs, the Loons will have a stadium full of fired-up fans behind them.", "authors": ["The Washington Times Http", "Dave Campbell"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/17/mls_united_sounders_soccer_84122_c0-180-4314-2696_s1200x700.jpg?c3627d177918e2894717595fa5be2e2bf4be7028", "published_at": "2019-10-18"}