{"pub": "dailymail", "url": "https://dailymail.co.uk/money/mortgageshome/article-7444129/The-retirement-mortgage-thats-fixed-life.html", "downloaded_at": "2019-10-22 13:55:30.850909+00:00", "title": "The retirement interest-only mortgage that's fixed for life", "language": "en", "text": "A specialist lender has launched the first ever 'fixed for life' retirement interest-only mortgage, allowing borrowers to lock in their monthly repayments indefinitely.\n\nThe over-50s deal from Hodge features a fixed rate of 4.35 per cent with no term limit, meaning the borrower will never need to remortgage, or risk falling onto a standard variable rate.\n\nThe unique deal is a type of retirement interest-only mortgage, a relatively new type of home loan that lets a borrower take out a mortgage and then only pay back the interest each month.\n\nWhat makes them special however is that the borrower doesn't have to worry about having a repayment plan in place - the loan can be paid back when the house is sold, or when the homeowner dies or goes into full-time care.\n\nHodge has released the first deal to let you fix your mortgage rate for the rest of your life\n\nThis means there is no repayment term - the loan just keeps going with the homeowner.\n\nThey are currently a niche product, although building society Nationwide has recently stepped up its offering, and strict affordability rules mean that not everyone will be eligible.\n\nFor those that are, there is a slowly increasing number of deals available, with Hodge's latest offering available to those between the ages of 50 and 88 who live in England, Wales and Scotland and own at least 30 per cent of their home already.\n\nHodge will lend to borrowers looking to use the money for a variety of reasons such as gifting to family members, home improvements, debt consolidation or holidays.\n\nLike all Hodge products this deal is only available through brokers and advisors.\n\nHow does it stack up?\n\nThere are currently 64 different retirement interest-only deals on the market, according to financial experts Moneyfacts.\n\nHodge's deal, which is available up to 70 per cent loan-to-value, has a rate of 4.35 per cent with a £995 arrangement fee, or 4.55 per cent with no fee.\n\nThis might seem high, but remember the borrower only pays the interest on the loan each month, making it substantially cheaper.\n\nWhat is a retirement interest-only mortgage? Last year the financial watchdog changed its rules to allow thousands of retired borrowers to remortgage onto interest-only deals without needing a repayment plan in place. Instead, they are allowed to use the sale of their home on death or moving out into full-time care to repay the balance. Known as retirement interest-only mortgages, these deals are aimed at homeowners who have failed to clear their debt before retirement and those who would like to cash in on their home's value to help fund their pension years. While currently a niche product, their popularity is expected to grow substantially in years to come. They may be out of reach for many, however. Affordability rules mean that if a couple take out a mortgage, whoever is on the lowest income must be able to afford the monthly repayments themselves if the other were to die. This means that not everybody applying will qualify for this type of deal.\n\nFor example, on a £200,000 mortgage taken over 20 years at 4.35 per cent an interest-only borrower would see monthly repayments of £725 while a capital repayment borrower would have monthly repayments of £1,249.\n\nThe deal isn't really comparable to existing retirement interest-only deals, as all others currently only offer fixed introductory rates.\n\nBecause of this there are cheaper deals out there, but bear in mind that the tempting rates won't last forever.\n\nFor example Nationwide offers a two-year fix at 2.99 per cent, a five-year fixed rate at 3.19 per cent, and a 10-year fixed rate at 3.79 per cent.\n\nAll products are at 50 per cent loan-to-value and come fee-free.\n\nWhile these deals are cheaper, you'd need to own a significantly higher stake of equity in your home to qualify.\n\nHodge itself offers a wide selection of fixed-rate retirement interest-only deals at 70 per cent loan-to-value, all with much more competitive rates than the fixed for life option.\n\nCurrently, it offers a two year fixed-rate of 3.20 per cent with a £995 product fee or 3.45 per cent with no fee; a five year fix at 3.50 per cent with a £995 fee or 3.65 per cent with no fee; a 10-year fix at 3.95 per cent with a £995 fee or 4.15 per cent without a fee, and a two year variable discount of 1.60 per cent off the lender's standard variable rate, currently to 3.10 per cent with a £995 fee.\n\nIn fact, the lender's standard variable rate of 4.70 per cent is not that much higher than what is being offered.\n\nSo why would you take this deal?\n\nAs the rate is fixed for life, that means you'll have certainty over your outgoings for the rest of your days - but there's another reason why it might be attractive.\n\nA deal like this can insulate the borrower from the wider economy - whatever happens to interest rates will never again make a difference to your mortgage repayments.\n\nMortgage rates are at near-historic lows - Pictured is the average two-year fixed rate since 2011\n\nIs it a good idea to fix forever?\n\nMortgage rates are currently at near-historic lows so fixing for a lifetime, or at least a long time, seems to make sense.\n\nAs a result of the current low rate environment, longer deals are becoming increasingly attractive to borrowers - 10-year fixes have been rising in popularity in the face of an uncertain economic future.\n\nWith Hodge's deal, if a borrower were to take the deal at 50 and live to 100, they would effectively be taking out a 50-year fixed-rate mortgage.\n\nIf interest rates rise in that time, the borrower will be saving money by continuing to pay their lower rate.\n\nOf course this can go the other way, and rates could drop.\n\nToday the average 70 per cent loan-to-value interest-only deal stands at 3.41 per cent, while five years ago it was 3.04 per cent and eight years ago it was 4.18 per cent, according to Moneyfacts.\n\nThis shows how much mortgage rates can fluctuate in the space of a few years, so if you’re going to lock in for a long time, picking the right time is essential.\n\nThe Bank of England's Base Rate has flatlined since 1990 and is likely to rise again in the future\n\nAs an example of how this can go wrong, nine years ago Co-op bank had a 10-year fix at 75 per cent LTV at 5.29 per cent.\n\nAt the time this was a competitive product, but the average 10-year fix today stands at around 3.01 per cent - which makes a lot of difference over 10 years, around £253 a month on a £200,000 mortgage taken over 25 years.\n\nThose borrowers that locked into this deal in 2010 could well still be on it, and will have missed out on years of cheaper deals.\n\nHowever, with rates currently so low, borrowers taking a long-term fix now could be locking into a cheap rate compared to what the future may hold.\n\nYou can read This is Money's regularly updated guide to interest rates by clicking here to decide for yourself if now is a good time to lock in.\n\nLocking into a long-term fixed rate deal can cost you dearly in the long run if rates then drop\n\nIn any case, this deal does come with certain get out clauses for those worried about committing.\n\nFor those worried that a deal like this might lock them in, the mortgage comes with ‘downsizing protection’ as standard, meaning if the borrower repays the loan as a result of selling their home to move to a smaller property, no early repayment charges will apply.\n\nFor any other repayment reason however the deal has early repayment charges of 5 per cent for the first four years, then 4 per cent in year five declining by 1 per cent each year to year eight.\n\nThese charges also don't apply if the borrower makes an over-payment to the value of 10 per cent of the loan per calendar year.\n\nAfter the eight year no early repayment charges apply.\n\nMortgage broker L&C's David Hollingworth said: 'We’ve had very long term fixed rates in the past with some deals locking down the interest rate for up to 25 years.\n\n'In the current mortgage market the longest fixed rate is currently for 15 years, whether you are looking at the mainstream or retirement interest-only market.\n\n'As with any long term fixed rate the rates will not be the lowest available so there is a cost for the certainty compared with shorter term products, although if rates do climb in the future locking in now could ultimately pay dividends.'", "description": "A specialist lender has launched the first ever 'fixed for life' retirement interest-only mortgage, allowing borrowers to lock in their monthly repayments indefinitely.", "authors": ["Will Kirkman For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/09/10/10/18293052-0-image-a-6_1568108083098.jpg", "published_at": "2019-09-13"}