{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7534833/Moment-woman-weeps-police-officer-no-one-believe-shes-raped.html", "downloaded_at": "2019-10-05 08:05:27.494423+00:00", "title": "Moment woman weeps to police officer that 'no one will believe she's been raped'", "language": "en", "text": "Emotional footage has revealed the moment a woman who was raped told the police she was afraid no one would believe her as she was 'drunk.'\n\nThe Met Police's search to find the suspect was detailed on the season three opening of BBC One's The Met: Policing London, which returned tonight.\n\nIn the distressing clip, the anonymous woman, in her thirties, broke down in tears while sitting on a bus as she told Met Police Officers she was raped in a park in Selhurst, south London.\n\n'He said he was going to rape me,' she told a female officer. 'He pulled me down the lane and he had a knife in his pocket. No one is going to believe me because I'm drunk.'\n\nThis is the heartbreaking moment an anonymous woman who was raped after being picked up on south London night bus told the police she was afraid no one would believe her because 'she was drunk'\n\nThe woman, in her 30s, broke down in tears while sitting on a bus as she told Met Police Officers she was raped in the park in Selhurst, south London\n\nTwo 999 calls are played in the show, one from a witness and a second from a N68 bus passenger, after the victim stopped the driver to tell him of the attack.\n\nThe woman explained how she was on the bus on her way home from a night out, when a passenger told her she was on the wrong one and he would help her get home.\n\nShe added that he then took her off the vehicle, pulled out a knife and threatened to kill her.\n\nDetectives from the now-disbanded Sapphire Unit then faced a race against the clock to find the rapist and to uncover vital CCTV evidence near the crime scene.\n\nPolice later uncovered the scarf the suspect was wearing during the attack at his house\n\nThe man was picked up at his house after CCTV footage showed him walking there after the attack\n\nBut police were shocked when they discovered the suspect returning to his own home.\n\n'He's committed these serious sexual offences on his doorstep,' one of the detectives said. 'I've never seen anything like that before - it's quite incredible.'\n\nThey then brought the suspect in for questioning and had 24 hours to prove he was lying.\n\nSpeaking about the investigation, a Detective explained: 'Often sexual assault and rape cases are very hard to prove as it's one person's words against the other.'\n\nHe also told how, after working in the unit for five years, it was the third 'stranger rape' - meaning the victims didn't know each other - he'd worked on.\n\nPolice later uncovered the scarf the suspect was wearing during the attack at his house. They closely inspected CCTV footage and saw it was a match, supporting the victim's testimony.\n\nAfter initially denying all claims, with only a few hours left on the clock, detectives put the new evidence to the suspect. They then had enough evidence to charge him and he remained in custody.\n\nCelebrating the charge, one officer added: 'He performed a very serious sexual assault on a lone female, and he deserves to go to prison for many years.'\n\nThe man was then sentenced to 10 years and nine months in prison.\n\nAfter bringing the suspect (pictured) in for questioning, the officers had 24 hours to prove he was lying", "description": "The Met Police's search to find the suspect was detailed on the season three opening of BBC One's The Met: Policing London, which returned tonight.", "authors": ["Bridie Pearson-Jones For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/13/19297276-0-image-a-42_1570193987690.jpg", "published_at": "2019-10-03"}