{"pub": "huffpost", "url": "https://huffpost.com/entry/prince-george-princess-charlotte-official-school-portraits_n_5d7126f1e4b0cdfe057bde9d", "downloaded_at": "2019-09-06 12:07:54.122963+00:00", "title": "Prince George And Princess Charlotte's School Portrait Is Just Too Cute", "language": "en", "text": "Prince George and Princess Charlotte smiled big for the camera for their first-day-of-school portrait on Thursday.\n\nThe prince, 6, showed off his toothless smile and grinned from ear to ear. Little Charlotte, who turned 4 in May, wrapped her arm around her brother and posed in her new school uniform.\n\n“The Duke and Duchess of Cambridge are very pleased to share a photograph of Prince George and Princess Charlotte at Kensington Palace this morning,” read a tweet from the Kensington Palace account. “The photo was taken shortly before Their Royal Highnesses left for Thomas’s Battersea.”\n\nThe Duke and Duchess of Cambridge are very pleased to share a photograph of Prince George and Princess Charlotte at Kensington Palace this morning.\n\n\n\nThe photo was taken shortly before Their Royal Highnesses left for Thomas's Battersea ✏️📚🏫 pic.twitter.com/oiMKArFQnd — Kensington Palace (@KensingtonRoyal) September 5, 2019\n\nFor Charlotte’s first day of school, she was accompanied by her parents, the Duke and Duchess of Cambridge.\n\nPrince William told the lower school’s head teacher, Helen Haslem, that his daughter was “very excited” for her first day. Kate Middleton was unable to make it for George’s first day of school back in 2017, as she was suffering from hyperemesis gravidarum while pregnant.\n\nCharlotte, whose full name is Her Royal Highness Princess Charlotte Elizabeth Diana of Cambridge, will go by the name Charlotte Cambridge with her classmates. Prince George goes by George Cambridge.\n\nThe school features a varied curriculum of exciting subjects, as its website states that it offers “ballet, drama, ICT, French, music and PE all taught by specialist teachers from a child’s first day in school.” Children begin school at 4 and typically graduate when they are either 11 or 13.\n\nPOOL/Reuters Princess Charlotte arrives for her first day of school accompanied by the Duke and Duchess of Cambridge and brother Prince George, at Thomas's Battersea in London on Sept. 5.\n\nWPA Pool via Getty Images Charlotte looked a bit nervous heading in!\n\nAARON CHOWN via Getty Images Charlotte is greeted by Helen Haslem, head of the lower school, on her arrival.\n\nPrior to heading back to class, the royals made their annual trip to Scotland, where they stayed at Balmoral Castle with Queen Elizabeth and Prince Philip.\n\nEarlier this summer, the family also vacationed in one of their favorite spots, Mustique, with Kate’s parents, Carole and Michael Middleton.\n\nThis article has been updated with additional photos and with information about the school and the royal family’s summer trips.", "description": "The children of the Duke and Duchess of Cambridge are attending Thomas's Battersea together.", "authors": ["Lifestyle Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d712ab92500001c130511d0.png?cache=j1pm2j0fbf&ops=1778_1000", "published_at": "2019-09-05"}