{"pub": "rt", "url": "https://rt.com/news/471616-pakistan-singer-suicide-vest", "downloaded_at": "2019-10-23 09:48:52.396767+00:00", "title": "‘Traditional dress?’ Pakistani singer blows up Indian social media with SUICIDE VEST photo", "language": "en", "text": "A provocative photo of Pakistani singer Rabi Peerzada, which shows her wearing a mock suicide vest, sparked outrage in India, where users accused her of encouraging terrorism. She, however, sees it in a different way.\n\nThe tweet posted by the Lahore-based singer on Tuesday drew quite some attention on the social media, with commenters rushing to state that she gave a vivid example of how Pakistan is a hotbed of terrorism, unlike its eastern neighbor.\n\n“Wow!! You looking awesome in traditional Pakistani dress,” one commenter said, while another one ranted: “Threatening suicide bombing to Modi on Twitter, Pakistanis are literally a gone case.”\n\nThe photo propagated further, with angry and sarcastic remarks along the ‘traditional vest’ lines.\n\nHours later Peerzada responded to her critics, saying the image came from a video, where she condemns suicide attacks.\n\n“I wish peace and humanity and all those Indians giving me lectures on Modi safety. Can you justify 3 months of curfew without food and medicines? I posted it to remind u stop this cruelty against IOK,” she said, referring to the Indian-controlled part of the disputed region of Kashmir. She later deleted the original provocative post.\n\nThe Indian government stripped the predominantly Muslim region under its control of its decades-old autonomy in August and imposed strict security measures in expectation of public outrage by the local population. Peerzada is one of many Pakistanis, who have been vocally protesting the development.\n\nInterestingly, the suicide vest photo was shared on her twitter account earlier on Monday with a caption in Urdu, which warned that a failure of the UN to mediate the Kashmir conflict would lead to a spike of terrorism. That post, however, didn’t go viral.\n\nاخر کار کشمیری بہن بھائی کیساتھ ایک یہی راستہ ہوگا ۔جب اقوامی متحدہ ثالثی میں فیل ہوگا۔ pic.twitter.com/ZnHQj35HE3 — Rabi Pirzada Bodyguard (@FunRabi) October 21, 2019\n\nEarlier this month Indian social media users accused Pakistan of brainwashing children into joining the ranks of terrorists after an Islamist student’s body released a controversial video, in which children shared their dreams, including to “avenge the death of every single Muslim” by pro-Indian forces.\n\nAlso on rt.com Islamabad accused of brainwashing kids over student body’s VIDEO on how ‘Hind will become Pakistan’\n\nThink your friends would be interested? Share this story!", "description": "A provocative photo of Pakistani singer Rabi Peerzada, which shows her wearing a mock suicide vest, sparked outrage in India, where users accused her of encouraging terrorism. She, however, sees it in a different way.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5db01bd785f54028224529ab.JPG", "published_at": "2019-10-23"}