{"pub": "independent", "url": "https://independent.co.uk/sport/football/premier-league/leicester-news-brendan-rodgers-vichai-srivaddhanaprabha-a9161471.html", "downloaded_at": "2019-10-19 11:20:52.151638+00:00", "title": "Brendan Rodgers believes his Leicester players are doing late Vichai proud", "language": "en", "text": "Brendan Rodgers believes his Leicester players are showing the fight their former chairman Vichai Srivaddhanaprabha wanted to see.\n\nThai businessman Vichai was killed in a helicopter crash outside Leicester’s King Power Stadium on October 27 last year.\n\nTributes will be paid on Saturday as Burnley visit in the Foxes’ final home game before the first anniversary of the tragedy.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nRodgers was not manager at the time of the accident but has led a resurgence in the team’s fortunes this season and Leicester are fourth in the Premier League heading into the match.\n\nThe Northern Irishman, who took charge of the side in February, said: “It’s certainly something that, having come in here, I really got to understand and recognise what an important figure he was.\n\nShape Created with Sketch. Fantasy Premier League tips: Gameweek 9 Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Fantasy Premier League tips: Gameweek 9 1/10 Callum Wilson Opponent: Norwich (H)\n\nPrice: £7.9m\n\nOwnership: 13.2% Getty Images 2/10 Son Heung-Min Opponent: Watford (H)\n\nPrice: £9.8m\n\nOwnership: 12.2% Getty Images 3/10 Callum Hudson-Odoi Opponent: Newcastle (H)\n\nPrice: £5.9m\n\nOwnership: 1.4% Getty Images 4/10 Jack Grealish Opponent: Brighton (H)\n\nPrice: £5.9m\n\nOwnership: 3.8% Getty Images 5/10 Fikayo Tomori Opponent: Newcastle (H)\n\nPrice: £4.7m\n\nOwnership: 5.6% Getty Images 6/10 Paulo Gazzaniga Opponent: Watford (H)\n\nPrice: £4.4m\n\nOwnership: 0.7% Getty Images 7/10 Frederic Guilbert Opponent: Brighton (H)\n\nPrice: £4.4m\n\nOwnership: 0.8% Getty Images 8/10 Todd Cantwell Opponent: Bournemouth (A)\n\nPrice: £4.9m\n\nOwnership: 23.8% Getty Images 9/10 Anwar El Ghazi Opponent: Brighton (H)\n\nPrice: £5.5m\n\nOwnership: 1.5% Getty Images 10/10 Tammy Abraham Opponent: Newcastle (H)\n\nPrice: £7.7m\n\nOwnership: 42.6% Getty Images 1/10 Callum Wilson Opponent: Norwich (H)\n\nPrice: £7.9m\n\nOwnership: 13.2% Getty Images 2/10 Son Heung-Min Opponent: Watford (H)\n\nPrice: £9.8m\n\nOwnership: 12.2% Getty Images 3/10 Callum Hudson-Odoi Opponent: Newcastle (H)\n\nPrice: £5.9m\n\nOwnership: 1.4% Getty Images 4/10 Jack Grealish Opponent: Brighton (H)\n\nPrice: £5.9m\n\nOwnership: 3.8% Getty Images 5/10 Fikayo Tomori Opponent: Newcastle (H)\n\nPrice: £4.7m\n\nOwnership: 5.6% Getty Images 6/10 Paulo Gazzaniga Opponent: Watford (H)\n\nPrice: £4.4m\n\nOwnership: 0.7% Getty Images 7/10 Frederic Guilbert Opponent: Brighton (H)\n\nPrice: £4.4m\n\nOwnership: 0.8% Getty Images 8/10 Todd Cantwell Opponent: Bournemouth (A)\n\nPrice: £4.9m\n\nOwnership: 23.8% Getty Images 9/10 Anwar El Ghazi Opponent: Brighton (H)\n\nPrice: £5.5m\n\nOwnership: 1.5% Getty Images 10/10 Tammy Abraham Opponent: Newcastle (H)\n\nPrice: £7.7m\n\nOwnership: 42.6% Getty Images\n\n“I think the feeling that he gave people and players and staff, you cannot buy that. He was close to many people at the club and the players had that real affinity with him, and still do.\n\n“He was a fighter, he wanted his teams to fight, and he wanted his people to fight for the very best.\n\n“And I think that’s what we see in the performances of the players in what we’ve tried to do since I came in.”\n\nBurnley travel to Leicester in decent form. After a tricky start to the campaign, Sean Dyche’s men are unbeaten in four games and are just two points behind the Foxes.\n\nRodgers, speaking at a press conference shown on the club’s website, said: “I think that Sean’s teams are super organised. They all know their job.\n\n“Ashley Barnes and Chris Wood up front – they are a threat, they work tirelessly. They’ve got very good players.\n\n“You know they play a system that isn’t complicated but they work it very well. They fight for every ball.\n\n“This is a type of game that’s another test for us, another challenge. Everyone tells me these are the types of games that the team may have suffered with for the last 18 months.\n\n“We anticipate a really tough game but we are at home, and we love being at home, and we want to play as well as we can.”", "description": "Brendan Rodgers believes his Leicester players are showing the fight their former chairman Vichai Srivaddhanaprabha wanted to see. Thai businessman Vichai was killed in a helicopter crash outside Leicester’s King Power Stadium on October 27 last year. Tributes will be paid on Saturday as Burnley visit in the Foxes’ final home game before the first anniversary of the tragedy.", "authors": ["Andy Hampson"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/18/12/vichai-srivaddhanaprabha.jpg", "published_at": "2019-10-18"}