{"pub": "cnn", "url": "https://cnn.com/2019/09/24/tech/virtual-reality-active-shooter-training/index.html", "downloaded_at": "2019-09-24 13:54:21.762677+00:00", "title": "Companies can use VR to train employees for mass shootings. But should they?", "language": "en", "text": "San Francisco (CNN Business) The shooter was a man: bald, wearing pants and a button-down shirt, standing in front of me in an office break room, firing a gun.\n\nShots rang in my ears. A heartbeat thump-thumped around me. A high-pitched noise made it hard for me to think. Seconds later, I heard rapid breathing sounds.\n\nI had to find a way out. I made my way to a tall glass window and decided to smash it. Then I yanked off my virtual-reality headset and took a deep breath.\n\nIt was a virtual experience — not even that high-tech, as far as VR goes, and only about 15 minutes long — but it felt distressingly real.\n\nCreated by two Seattle-based companies — VR video platform and training startup Pixvana along with tactical training company Alexo — the experience was announced this month with the goal of helping companies prepare their employees for an active-shooter scenario.\n\nA screengrab from Pixvana's virtual-reality active shooter training video. The figure is meant to be the \"active shooter\" during the virtual-reality training as seen through a VR headset.\n\nMicrosoft MSFT According to Pixvana, the first company to try it out was Vulcan, the investment firm of deceasedco-founder Paul Allen. Vulcan, which is based in Seattle, declined to comment about the training. Pixvana is currently talking to a hospital system that wants it to build specific hospital scenes for its active-shooter training.\n\nIf this VR experience sounds jarring enough that it could leave a lasting dent in your memory, that's kind of the point.\n\n\"What we're trying to do is a long-term memory effect they can call upon should they find themselves in a violent situation,\" Alexo founder Drew Hancock, who's also a Seattle police officer and SWAT leader, told CNN Business. But he believes the experience stops short of being traumatic. Instead, Hancock said it is trying to create \"somewhat of a stimulus\" among viewers, without featuring anything graphic.\n\nWalmart WMT The active shooter response training experience is the latest example of companies using VR to train workers for all kinds of on-the-job situations — a hot application for technology that has otherwise seen slow adoption.is using it to prep its employees for Black Friday. Numerous sports teams, especially in the NFL, use VR for realistic off-the-field training. And Seabourn, a cruise line, uses Pixvana to train new waiters on table locations in their restaurant.\n\nYet while using VR could help people feel more prepared for a violent encounter, some experts who study shootings cautioned that increasingly realistic scenarios may trigger certain people.\n\n\"You've got to realize when you reach out to the public that they're all across the board in what they're prepared to deal with,\" said Pete Blair, a criminal justice professor at Texas State University and executive director of the school's Advanced Law Enforcement Rapid Response Training Center.\n\nPixvana employees undergoing active shooter training in virtual reality.\n\nFinding the right amount of fear\n\nMany experts in tactical training, including the FBI, believe training for shootings in particular can be helpful. An FBI study of active shooters from 2000 to 2013 noted that even when police were able to get to the scene of the crime in minutes, \"civilians often had to make life and death decisions, and, therefore, should be engaged in training and discussions on decisions they may face.\"\n\nTraining for such situations in VR does force people to pay more attention than they would to, say, a lecture and a PowerPoint presentation, if only because you can't check your phone while you've got a headset on your face. And Pixvana isn't the only one suggesting VR training for dealing with gun violence. The US Department of Homeland Security offers a free, video-game-like program called the Enhanced Dynamic Geo-Social Environment (also known as EDGE) for training first responders and school staffers.\n\nAlexo founder Drew Hancock instructs viewers during an active-shooter VR training session. The imagery appears as it's seen through a VR headset.\n\nBy using 360-degree video, Pixvana's approach is more realistic looking. It starts with Hancock instructing you, in VR, on how to deal with a shooter and then drops you into violent scenarios. To make you feel somewhat like you're in the midst of a real active-shooter scenario, the training uses sounds and scenes such as the office and an outdoor plaza.\n\nTo tone it down a bit, the lone male shooter is a static figure, rendered in red with a white outline. Brightly colored indicators peppered around the office help give you ideas about what items might work as weapons (a toaster or a bottle, for instance), and what may be your best paths for escape.\n\n\"You don't want people so scared that they're not remembering what they're learning,\" said Rachel Lanham, Pixvana's chief operating officer. \"That's not the point.\"\n\nA $3 billion industry\n\nPixvana is tapping into what Jillian Peterson, a psychologist and an assistant professor at Hamline University who studies the psychology of criminology, estimates is about a $3 billion industry at the moment. Companies are now coming up with all kinds of technologies and techniques to train people to respond to shootings.\n\nBut while there may be a large market for such services, Peterson is concerned that they're not just helping innocent bystanders learn how to cope with a shooting at work or at school: they're also training the very people who could be perpetrators. She said research indicates that about 90% of school or workplace shootings are committed by former students or employees.\n\nIt also makes Peterson nervous to put people through simulations in virtual reality in case it triggers a fascination or interest in shootings that wasn't there previously. \"If you're suicidal, and you're in crisis, and you have a trauma background, and you have access to weapons, this sort of rehearsal could be problematic,\" she said.\n\nPixvana didn't consult with mental health professionals such as psychologists before creating the training, Lanham said.\n\nHancock does think that if someone previously had a traumatic life experience it could trigger them. He also feels the training should be voluntary and limited to adults, though he can envision it being used by high schoolers.", "description": "The shooter was a man: bald, wearing pants and a button-down shirt, standing in front of me in an office break room, firing a gun.", "authors": ["Rachel Metz", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190923153415-03-pixvana---active-shooter-training-super-tease.jpg", "published_at": "2019-09-24"}