{"pub": "politico", "title": "Trump praises Danish PM after calling her ‘nasty’ in Greenland row", "url": "https://politico.eu/article/mette-frederiksen-donald-trump-praises-danish-pm-after-calling-her-nasty-in-greenland-row", "language": "", "published_at": "2019-08-24", "downloaded_at": "2019-09-02 07:10:53.463672+00:00", "text": "Denmark's Prime Minister Mette Frederiksen | Mads Claus Rasmussen/AFP via Getty Images Trump praises Danish PM after calling her ‘nasty’ in Greenland row Mette Frederiksen is a ‘wonderful woman,’ US president says.\n\nU.S. President Donald Trump called Danish Prime Minister Mette Frederiksen a \"wonderful woman,\" two days after he canceled a visit to the country and slammed her for dismissing his idea of buying Greenland as \"absurd.\"\n\nThe U.S. leader said he got a call from Frederiksen, whose response to his Greenland idea he had branded \"nasty.\"\n\n\"We had a great conversation,\" Trump told reporters late Friday as he prepared to leave for the G7 summit in Biarritz, France. \"We have a very good relationship with Denmark, and we agreed to speak later. But she was very nice. She put a call in, and I appreciated it very much,\" Trump said.\n\nGreenland is an autonomous region of Denmark that is attracting increasing interest from major powers due to its strategic location and natural resources.\n\nFrederiksen's predecessor Lars Løkke Rasmussen praised her phone call, calling it \"very nice diplomatic work.\" Rasmussen also said the U.S. is Denmark's \"most important ally, regardless of who is in the White House.\"\n\nIn another sign of increased U.S. interest in Greenland, the Trump administration is planning to establish a consulate in the capital Nuuk in part of a broader plan to increase the U.S. presence in the Arctic, according to a letter obtained Friday by the Associated Press.\n\nA permanent diplomatic presence would allow the U.S. to \"protect essential equities in Greenland while developing deeper relationships with Greenlandic officials and society,\" said the letter addressed to Congress.", "description": "Mette Frederiksen is a ‘wonderful woman,’ US president says.", "authors": ["Eline Schaart", "Joshua Keating", "Joseph Blocher", "Mitu Gulati"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/08/GettyImages-1163046873-1200x628.jpg"}