{"pub": "reuters", "url": "https://reuters.com/article/us-asahi-group-ceo/asahi-ceo-bets-on-better-tasting-alcohol-free-beers-pauses-acquisition-spree-idUSKBN1X31PD", "downloaded_at": "2019-10-24 14:18:34.856180+00:00", "title": "Asahi CEO bets on better tasting alcohol-free beers; pauses acquisition spree", "language": "en", "text": "TOKYO (Reuters) - Asahi Group Holdings’ (2502.T) Chief Executive Akiyoshi Koji is betting on alcohol-free beer to drive global profits in coming years, leveraging Japanese technology to improve the taste of the European brands it now owns.\n\nFILE PHOTO: Asahi Group Holdings President and COO Akiyoshi Koji speaks during an interview with Reuters at the company's headquarters in Tokyo, Japan, May 17, 2016. REUTERS/Toru Hanai\n\nThe Japanese brewer has bought Italy’s Peroni and Czech market leader Pilsner Urquell, among others, in recent years, as a shrinking population and a growing preference for wine or cocktails weigh on domestic beer sales.\n\nKoji said the company would sit tight on further major acquisitions for the time being, having agreed in July to buy AB InBev’s (ABI.BR) Australian business Carlton & United Breweries for $11 billion, a move that would make it the world’s third-biggest brewer.\n\nPeroni, Poland’s Lech and Hungary’s Dreher are Asahi brands that have launched zero-alcohol beers, competing with European leaders such as Heineken (HEIO.AS) and Carlsberg (CARLb.CO) which are also tapping growing demand for healthier drinks.\n\nKoji said sales of some of the group’s European alcohol-free brands had grown more than 30 percent, albeit from a low base.\n\n“We want to make non-alcohol beers a revenue pillar,” he told Reuters in an interview. “Japanese technology is being used quite a bit among these non-alcohol beers, to make good products,” he said.\n\nAsahi has been developing ways to improve the taste of its alcohol-free beers and sharing know-how was one of the benefits of its global M&A, in addition to slashing procurement and production costs, he said.\n\nKoji declined to share detailed numbers or targets for the group’s non-alcoholic range. Market leader Anheuser-Busch InBev (AB InBev) (ABI.BR) has said low or alcohol-free beer will likely make up around 20 percent of its volume by end-2025.\n\nThe planned purchase of Carlton & United Breweries is expected to close in the first quarter of 2020 and push Asahi’s net debt to above four times EBITDA.\n\nKoji said Asahi would now focus on improving its finances for the next few years, including bringing the multiple down to around three times, before embarking on further deals.\n\n“Until our balance sheet normalizes I don’t think we can make major investments,” he said. “Considering our current calculations... that would take until around 2022 to 2023.”", "description": "Asahi Group Holdings' <2502.T> Chief Executive Akiyoshi Koji is betting on alcohol-free beer to drive global profits in coming years, leveraging Japanese technology to improve the taste of the European brands it now owns.", "authors": ["Ritsuko Ando", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191024&t=2&i=1444499564&w=1200&r=LYNXMPEF9N14V", "published_at": "2019-10-24"}