{"pub": "afr", "url": "https://afr.com/young-rich/light-touch-helps-aviator-s-ambitions-take-off-20191001-p52wh2", "downloaded_at": "2019-10-23 08:49:17.939266+00:00", "title": "Light touch helps aviator's ambitions take off", "language": "en", "text": "Michael Bailey Rich List Editor Oct 21, 2019 — 12.00am Share\n\nNeel Khokhani was so busy building up Soar Aviation, his flying school that is nearing turnover of $20 million, that the trained pilot didn’t get into the cockpit for four-and-a-half years.\n\nThe 30-year-old Financial Review Young Rich List debutant had finally broken the drought on the morning he spoke to AFR Magazine, taking off from Soar’s Moorabbin base in one of the 67 light sports aircraft it owns.\n\n“Just did a quick lap round the Mornington Peninsula and back, 45 minutes. It was a bit windy and bumpy, but it’s like riding a bike – it all comes back to you when you’re up there,” Khokhani says.\n\nMoving to Australia at 16 from Mumbai to study for a diploma of airway operations at a college attached to Sydney’s Bankstown Airport, Khokhani learnt to fly before he could drive.\n\nNeel Khokhani: \"The idea is to keep costs low rather than give a clip to someone else.\"\n\nHowever, in his nascent entrepreneurial mind he wondered why he was flying Cessnas and Pipers to get the 150 hours of flight time required for his commercial pilot’s licence.\n\n“There would be me and the instructor, and as many as six empty seats,” Khokhani recalls.\n\n“I knew there were these great, smaller aircraft beginning to come out of Europe that were much cheaper and much more efficient.”\n\nWhen Khokhani offered free advice on fleet management to the owner of the flying school where he worked as an instructor, it wasn’t well received.", "description": "Soar Aviation founder Neel Khokhani doesn't get much time in the pilot's seat these days. Lucky for him, flying a plane is like riding a bike.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2241%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_69%2C$y_177/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/ea208ab8ead408f829733ecef8107d548174dec5", "published_at": "2019-10-01"}