{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7547151/Russian-Embassy-claims-Trump-doubts-best-evidence-Putin-spies-did-not-poison-Skripals.html", "downloaded_at": "2019-10-07 20:41:19.161302+00:00", "title": "Russian Embassy claims Trump doubts are 'best evidence' Putin spies did not poison the Skripals", "language": "en", "text": "Ruslan Boshirov, left, and Alexander Petrov, right, claim they are the victims of a smear and suggested Britain was plotting to kill them\n\nThe men accused over the Salisbury attack spoke out for the first time in an interview with RT, the transcript of which is below:\n\nRT's editor-in-chief Margarita Simonyan: You called my cell phone, saying that you were Ruslan Boshirov and Alexander Petrov. You're Alexander Petrov, and you're Ruslan Boshirov. You do look like the people we saw in those pictures and videos from the UK. So who are you in reality?\n\nAlexander Petrov: We are the people you saw.\n\nRuslan Boshirov: I'm Ruslan Boshirov.\n\nAP: And I'm Alexander Petrov.\n\nMS: These are your real names?\n\nRB: Yes, these are our real names.\n\nMS: But even now, frankly, you look very tense.\n\nAP: What would you look like if you were in our shoes?\n\nRB: When your whole life is turned upside down all of a sudden, overnight, and torn down.\n\nMS: The guys we all saw in those videos from London and Salisbury, wearing those jackets and sneakers, these are you?\n\nAP: Yes, it's us.\n\nMS: What were you doing there?\n\nAP: Our friends have been suggesting for quite a long time that we visit this wonderful city.\n\nMS: Salisbury? A wonderful city?\n\nAP: Yes.\n\nMS: What makes it so wonderful?\n\nRB: It's a tourist city. They have a famous cathedral there, Salisbury Cathedral. It's famous throughout Europe and, in fact, throughout the world, I think. It's famous for its 123-meter spire. It's famous for its clock. It's the oldest working clock in the world.\n\nMS: So, you traveled to Salisbury to see the clock?\n\nAP: No, initially we planned to go to London and have some fun there. This time, it wasn't a business trip. Our plan was to spend some time in London and then to visit Salisbury. Of course, we wanted to do it all in one day. But when we got there, even our plane could not land on the first approach. That's because of all the havoc they had with transport in the UK on March 2 and 3. Because of heavy snowfall, nearly all the cities were paralyzed. We were unable to go anywhere.\n\nRB: It was in all the news. Railroads did not work on March 2 and 3. Highways were closed. Police cars and ambulances blocked off highways. There was no traffic at all – no trains, nothing. Why is it that nobody talks about any of this?\n\nMS: Can you give the timeline? Minute by minute, or at least hour by hour, or as much as you can remember. You arrived in the UK – like you said, to have some fun and to see the cathedral, to see a clock in Salisbury. Can you tell us what you did in the UK? You spent two days there, right?\n\nAP: Actually, three.\n\nMS: OK, three. What did you do those three days?\n\nAP: We arrived on March 2. We went to the train station to check the schedule, to see where we could go.\n\nRB: The initial plan was to go there and return that day. Just take a look and return the same day.\n\nAP: To Salisbury, that is. One day in Salisbury is enough. There's not much you can do there.\n\nRB: It's a regular city. A regular tourist city.\n\nMS: OK, I get that. That was your plan. But what did you actually do? You arrived. There was heavy snowfall. No trains, nothing. So, what did you do?\n\nAP: No, we arrived in Salisbury on March 3. We wanted to walk around the city but since the whole city was covered with snow, we spent only 30 minutes there. We were all wet.\n\nRB: There are no pictures. The media, television – nobody talks about the fact that the transport system was paralyzed that day. It was impossible to get anywhere because of the snow. We were drenched up to our knees.\n\nMS: Alright. You went for a walk for 30 minutes, you got wet. What next?\n\nAP: We traveled there to see Stonehenge, Old Sarum, and the Cathedral of the Blessed Virgin Mary. But it didn't work out because of the slush. The whole city was covered with slush. We got wet, so we went back to the train station and took the first train to go back. We spent about 40 minutes in a coffee shop at the train station.\n\nRB: Drinking coffee. Drinking hot coffee because we were drenched.\n\nAP: Maybe a little over an hour. That's because of the large intervals between trains. I think this was because of the snowfall. We went back to London and continued with our journey.\n\nRB: We walked around London…\n\nMS: So, you only spent an hour in Salisbury?\n\nAP: On March 3? Yes. That's because it was impossible to get anywhere.\n\nMS: What about the next day?\n\nAP: On March 4, we went back there, because the snow melted in London, it was warm.\n\nRB: It was sunny.\n\nAP: And we thought, we really wanted to see Old Sarum and the cathedral. So we decided to give it another try on March 4.\n\nMS: Another try to do what?\n\nAP: To go sightseeing.\n\nRB: To see this famous cathedral. To visit Old Sarum.\n\nMS: So, did you see it?\n\nRT editor Margarita Simonyan tweeted today that she spent the evening with the suspects and suggested that they will deny any part in the plot\n\nRB: Yes, we did.\n\nAP: On March 4, we did. But again, by lunchtime, there was heavy rain with snow.\n\nRB: For some reason, nobody talks about this fact.\n\nAP: So we left early.\n\nMS: Is it beautiful?\n\nRB: The cathedral is very beautiful. They have lots of tourists, lots of Russian tourists, lots of Russian-speaking tourists.\n\nAP: By the way, they should have a lot of pictures from the cathedral.\n\nMS: Your pictures, you mean?\n\nAP: They should show them.\n\nMS: I assume you took some pictures while at the cathedral?\n\nRB: Of course.\n\nAP: Sure, we did.\n\nRB: We went to a park, we had some coffee. We went to a coffee shop and drank coffee. We walked around, enjoying those beautiful English Gothic buildings.\n\nAP: For some reason, they don't show this. They only show how we went to the train station.\n\nMS: If you give us your pictures, we can show them. So, while you were in Salisbury, did you go anywhere near the house of the Skripals?\n\nAP: Maybe. We don't know.\n\nRB: What about you? Do you know where their house is?\n\nMS: I don't. Do you?\n\nRB: We don't either.\n\nAP: I wish somebody would tell us where it is.\n\nRB: Maybe we passed it, or maybe we didn't. I'd never heard about them before this nightmare started. I'd never heard this name before. I didn't know anything about them.\n\nMS: When you arrived in the UK, when you were in London or in Salisbury, throughout your whole trip, did you have any Novichok or some other poisonous agent or dangerous substance?\n\nRB: No.\n\nAP: It's absurd.\n\nMS: Did you have the bottle of Nina Ricci perfume which the UK presents as evidence of your alleged crime?\n\nRB: Don't you think that it's kind of stupid for two straight men to carry perfume for ladies? When you go through customs, they check all your belongings. So, if we had anything suspicious, they would definitely have questions. Why would a man have perfume for women in his luggage?\n\nAP: Even an ordinary person would have questions. Why would a man need perfume for women?\n\nMS: Where would an ordinary person see that you have a perfume bottle?\n\nRB: I mean, when you go through customs…\n\nMS: Long story short, did you have that Nina Ricci bottle or not?\n\nRB: No.\n\nAP: No, of course not.\n\nMS: Speaking of straight men, all footage features you two together. You spent time together, you lived together, you went for a walk together. What do you have in common that you spend so much time together?\n\nRB: You know, let's not breach anyone's privacy. We came to you for protection, but this is turning into some kind of interrogation. We are going too far. We came to you for protection. You're not interrogating us.\n\nMS: We are journalists, we don't protect. We aren't lawyers. In fact, this was my next question. Why did you decide to go to the media? Your photos were published some time ago together with your names, but you were keeping silent. Today, you called me because you wanted to talk to the media. Why?\n\nRB: To ask for protection.\n\nAP: You say we kept silent. After our lives turned into a nightmare, we didn't know what to do, where to go. Police? Investigative Committee? UK Embassy?\n\nRB: Or FSB. We didn't know.\n\nMS: Why would you go to the UK Embassy?\n\nAP: We really didn't know what to do. Where to go? Hello?\n\nRB: You know, when your life is turned upside down, you don't really understand what to do and where to go. And many say, why don't you go to the UK Embassy and explain everything?\n\nMS: And you know what they are saying about you, right?\n\nAP: Of course we do.\n\nRB: Yes, of course. We can't go out on the street because we are scared. We're afraid.\n\nMS: What are you afraid of?\n\nRB: We fear for our lives. And for the lives of our families and friends.\n\nMS: So, you fear that the UK secret service will kill you or what?\n\nRB: We just don't know.\n\nAP: Simply read what they write there. They even offer a reward.\n\nMS: What do you mean? There's a bounty on your head?\n\nRB: Dmitry Gudkov, if I am not mistaken, promised a trip to the UK to anybody who brings us to him. Do you think it's OK? And you think we can feel just fine, walking around all smiling, talking to people? Any sensible person would be afraid'.", "description": "The US President is said to have 'harangued' the Prime Minister as he expressed doubts that Russia was behind the Salisbury attack during a phone call with Theresa May.", "authors": ["Sebastian Murphy-Bates For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/18/19406690-0-image-a-9_1570468669331.jpg", "published_at": "2019-10-07"}