{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7569479/Committee-Climate-Change-suggest-ban-air-miles-rewards-encourage-frequent-flying.html", "downloaded_at": "2019-10-14 00:19:14.779227+00:00", "title": "Committee on Climate Change suggest ban on air miles rewards because they encourage frequent flying", "language": "en", "text": "Air miles reward schemes should be banned because they 'stimulate demand' for excessive flying, according to a report commissioned by the Government's climate change advisers.\n\nThe Committee on Climate Change (CCC) commissioned report says that frequent flyers should also be hit by an 'escalating air miles levy' to put them off flying too much, but measures should not raise prices for people taking an annual holiday.\n\nThere is approximately 220 frequent flyer clubs with an estimated total membership of 200 million across the world, many of whom take additional flights to 'maintain their privileged traveller status'.\n\nThe new suggestions are aimed at reducing air travel for the 15 per cent of the UK population estimated to be responsible for 70 per cent of all flights.\n\nThe Committee on Climate Change (CCC) commissioned report says that frequent flyers should also be hit by an 'escalating air miles levy' to put them off flying too much\n\nAmong other aviation suggestions, all flights should advertise their emissions in a plain manner easily understood by customers, for example as a proportion of an average annual household's output, it adds.\n\nThe report: Behaviour Change, Public Engagement And Net Zero, was authored by Dr Richard Carmichael of Imperial College London.\n\nIt said that 'high impact shifts in consumer behaviours' were needed for the UK to reach its goal of net-zero emissions by 2050, rather than the 'small and easy changes' suggested to UK households in the past.\n\nIt added policy changes were required which were 'consistent with the scale of the climate challenge, build optimism and commitment, and give weight to new ambitious narratives that inspire wide public participation.'\n\nThe Government's climate change advisers also suggested that air miles reward schemes should be banned because they 'stimulate demand' for excessive flying\n\nThe report also included wider recommendations on sustainable living, including weekly collections of food waste and changes to diet, particularly eating less meat and switching to largely plant-based diets.\n\nIt also suggested mandatory labels on food products to show the environmental impact of producing the item.\n\nOther domestic travel recommendations include slashing prices on intercity rail services to reduce demand for cars and planes, and re-opening disused rail lines.\n\nThe UK is the world's first major economy to legally commit to becoming carbon neutral by 2050 in one of Theresa May's last acts as Prime Minister.", "description": "The report from the Committee on Climate Change suggested placing an 'escalating levy' on frequent flyers, who make up 15 per cent of the UK's population but take 70 per cent of all flights.", "authors": ["William Cole For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/00/19671184-0-image-a-32_1571010661696.jpg", "published_at": "2019-10-14"}