{"pub": "wsj", "url": "https://marketwatch.com/story/ken-fishers-fund-reportedly-loses-600-million-client-after-offensive-comments-2019-10-13?mod=rsswn", "downloaded_at": "2019-10-14 03:47:55.804727+00:00", "title": "Ken Fisher’s fund reportedly loses $600-million client after offensive comments", "language": "en", "text": "Ken Fisher’s eponymous wealth-management fund is $600 million poorer after the state of Michigan reportedly pulled its pension fund amid a furor over his sexually offensive comments.\n\nAccording to reports by Bloomberg News and CNBC, the $70 billion pension fund’s chief investment officer notified its board in a letter dated Oct. 10 that it was withdrawing its $600 million investment from Fisher Investments after 15 years as a client.\n\n“Ken Fisher made completely unacceptable comments,” Michigan pension fund CIO Jon Braeutigam said in the letter, which CNBC published.\n\n“There is no excuse not to treat everyone with dignity and respect,” Braeutigam said in the letter. “We have high expectations of our managers (and staff) not just with regards to returns but also in how they exhibit integrity and respect to all individuals.”\n\nOn Tuesday, Fisher told attendees at the Tiburon CEO Summit in San Francisco that winning clients was like “trying to get into a girl’s pants,” and talked about genitalia, according to multiple reports and leaked audio.\n\nA number of attendees spoke out after his remarks, calling them disgusting and offensive.\n\nAfter initially saying he did not understand the response, Fisher issued an apology Thursday.\n\n“Some of the words and phrases I used during a recent conference to make certain points were clearly wrong and I shouldn’t have made them,” Fisher said. “I realize this kind of language has no place in our company or industry. I sincerely apologize.”\n\nFisher Investments manages about $112 billion, including state pension plans and companies’ 401(k) funds.", "description": "Ken Fisher’s eponymous wealth-management fund is $600 million poorer after the state of Michigan reportedly pulled its pension fund amid a furor over his...", "authors": ["Mike Murphy"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT028_fisher_ZG_20191010091319.jpg", "published_at": "2019-10-13"}