{"pub": "theverge", "url": "https://theverge.com/2019/10/1/20892589/twitchcon-2019-ninja-nick-eh-30-mixer-san-diego", "downloaded_at": "2019-10-05 15:09:16.716472+00:00", "title": "TwitchCon was a reminder that streamers are big business", "language": "en", "text": "The internet is real life, but the place where the internet meets real life is still messy as hell. TwitchCon, which was held at San Diego’s convention center this year — the same place where the biggest comic con in America happens every year — is the site of one of those collisions, where IRL meets URL. I just got back from the convention floor, which was a riot of people of different ages, abilities, and ethnicities. (The brands were there, too.) It looked, in other words, like Twitch: live, a little dorky, and totally enthusiastic.\n\nHistorically, TwitchCon has functioned mainly as an excuse for people to see each other and for fans to meet their favorite personalities in person. The vibe is very family reunion: convivial, but also a little awkward. There’s a tension between the parasocial relationships that streaming is built on and who those streamers are in person, off-camera. Twitch’s partnered streamers have to navigate those choppy waters because connecting with their audience is how they make money. (Although it should be said that most partners have day jobs.) Perhaps fearing the worst, Twitch offered partners the opportunity to take a class on personal safety during the convention.\n\nTwitch’s partners are the most popular people on the site; they draw in most of the traffic and drive most of the engagement, which translates to real money for the platform. There was a lounge specifically set up for them, with snacks and a secluded place to check out the convention floor. For the biggest stars, there was a secret lounge — which had a nondescript “No Entrance” sign in front of the equally nondescript door — that boasted a masseuse, an aura reader, a barista, an open bar, and a place to get a cupcake with your face on the frosting. The ground was carpeted in astroturf, which lent the otherwise normal ballroom a weirdly lush vibe.\n\nIt looked, in other words, like Twitch: live, a little dorky, and totally enthusiastic\n\nThis year’s convention felt geared toward partners and the people who have been on Twitch the longest; the product news from the ceremony mostly fell into quality-of-life improvements, with minor changes to advertising and the creator dashboard, which were announced alongside mock-ups of changes to individual channel pages. The company also announced an open beta for Twitch Studio, the streaming software aimed at getting new channels on the site.\n\nThe problem, however, is that not all of Twitch’s partners are happy. While most of the announcements came as welcome news for the site’s more prominent creators, I got the distinct sense that some of Twitch’s superstars feel it’s too little, too late. Tyler “Ninja” Blevins is the most obvious example; his criticisms of Twitch since he departed the platform for a rival have been fairly harsh. After Twitch promoted porn on his dormant channel, Blevins said he was “disgusted” and noted that it “wouldn’t even have been an issue if they didnt use my channel to promote others in the first place.”\n\nA couple of years ago, Blevins’ move off of Twitch would have been unthinkable; there simply hasn’t been credible platform-level competition. But that’s changing. While Twitch did manage to get Nicholas “Nick Eh 30” Amyoony, a family-friendly Fortnite streamer who had been on YouTube, the site has new, ambitious rivals who have the funding and wherewithal to get the streamers they want.\n\nMicrosoft, for example, has thrown its hat into the ring with Mixer. Its first move was to poach Blevins, the most famous gamer in the world. Sony has teamed up with Microsoft to use the company’s Azure cloud services for cloud gaming and content streaming, which likely means that we’ll see a three-front battle between Microsoft, Amazon, and Google. The social video and live-streaming service Caffeine, meanwhile, received a cool $100 million investment from 21st Century Fox last year. (That’s enough for a significant war chest with which to entice unhappy streamers away from Twitch. It also meant the creation of Caffeine Studios, which is set to create its own exclusive esports and streaming content.) This, of course, leaves aside YouTube and Facebook Gaming, which I’m sure are laying their own plans.\n\nTwo isn’t a trend, but it is a signal: the ecosystem is professionalizing\n\nAll of this points to a seismic shift underway. While the details of Blevins’ deal aren’t public, it’s safe to assume that the terms were lucrative. Similarly, Amyoony’s partnership with Twitch must have been quite remunerative; at TwitchCon, Amyoony seemed to be at every official event the company hosted. Two isn’t a trend, but it is a signal: the ecosystem is professionalizing. The next era of the content wars has arrived. I think we’ll soon start to see streamers traded between platforms like basketball players, and paid nearly as well. Like physical sports, the audience for streaming is already huge even as it’s growing, which makes streamers more culturally important than they’ve been before.\n\nAt the main TwitchCon party — which was held in Petco Stadium where the San Diego Padres play — hundreds of people danced on the field to the music of Logic and Blink-182. Above the field in the VIP area, Twitch staff, Twitch partners, and their assorted handlers crowded the slightly understaffed bar. It felt relaxed, like everyone understood that the hard part was over, at least for this year. Amyoony popped in after he’d worked a charity live stream to say hello to his publicist and to get his schedule for the next day, the last bit of the convention. The publicist was leaving in the morning, but Amyoony still had more to do.", "description": "Twitch’s partners draw in most of the traffic and drive most of the engagement, which translates to real money for the platform. There was a lounge specifically set up for them, with snacks and a secluded place to check out the convention floor. For the biggest stars, there was a secret lounge — which had a nondescript \"No Entrance\" sign in front of the equally nondescript door.", "authors": ["Bijan Stephen", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/179Lyi379gbaRkKIYxSPqt0mJqU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18963836/acastro_190812_1777_twitch_0001.0.jpg", "published_at": "2019-10-01"}