{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/hong-kong-stock-exchange-dropped-its-36-billion-bid-for-its-london-rival-after-the-lse-snubbed-it-1028582397", "downloaded_at": "2019-10-08 10:03:00.515122+00:00", "title": "Hong Kong Stock Exchange dropped its $36 billion bid for its London rival after the LSE snubbed it", "language": "en", "text": "REUTERS/Toby Melville\n\nThe Hong Kong Stock Exchange has dropped its $36 billion bid for the London Stock Exchange after it was rejected by the group's board last month.\n\nIn a statement on its website, HKEX said it \"confirms that it does not intend to make an offer for LSEG,\" adding that the board felt it would be \"strategically compelling and would create a world-leading market infrastructure group.\"\n\nThe original unsolicited bid took markets by surprise, given the LSEG had already secured a $27 billion deal with Refinitiv.\n\nLSE shares sunk on the news.\n\nView Markets Insider's homepage for more stories.\n\nThe Hong Kong Stock Exchange says it's dropping its bid for the London Stock Exchange, on Tuesday morning via the group's website.\n\nHKEX originally made an unsolicited bid for the LSE on September 11, worth £32 billion ($36.6 billion), which would have created a combined company worth over $70 billion.\n\nHowever, that bid was rejected by the LSE two days later, after the board said it had \"fundamental concerns\" about the proposed deal.\n\nLSE had already agreed to a $27 billion deal with the data group Refinitiv, so the HKEX deal came as a surprise to markets.\n\nHKEX said that the board still believed that the deal would have been \"strategically compelling\" and that it would be creating a \"world-leading market infrastructure group.\"\n\nHowever, HKEX added that it has been \"unable to engage with the management of LSEG in realising this vision,\" and dropped its offer.\n\nShares in LSEG were down 5.8% on Tuesday morning.\n\nLSE's board at the time unanimously rejected the offer, saying that it had a number of problems, notably issues with \"strategy, deliverability, form of consideration and value,\" and as a result saw \"no merit in further engagement.\"\n\nMarkets Insider", "description": "The Hong Kong Stock Exchange has dropped its $36 billion bid for the London Stock Exchange  after it was rejected by the group's board last month.&nb...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d9c3db9e6a38142f156975d-2400/rtx93tl.jpg", "published_at": "2019-10-08"}