{"pub": "breitbart", "url": "https://breitbart.com/news/collateral-damage-from-haiti-political-crisis-ruined-businesses", "downloaded_at": "2019-10-05 05:57:57.048032+00:00", "title": "Collateral damage from Haiti political crisis: ruined businesses", "language": "en", "text": "Port-au-Prince (AFP) – Tens of thousands of dollars of work reduced to ash: a devastating fire at a handicrafts company in Port-au-Prince illustrates the struggles faced by Haiti’s private sector as the country’s political crisis has spiralled into social unrest.\n\nCaribbean Craft produces home decor items, many of them in papier mache: brightly colored animals, vases, end tables. It has supplied items to large US chains such as West Elm, HomeGoods and Restoration Hardware.\n\nThe origin of last week’s blaze is still unknown but is certainly suspicious. It started on the property next door, a parking lot for the car rental company Avis. Several cars went up in flames before Caribbean Craft’s factory was hit. Much of its stock was ruined.\n\n“We couldn’t save anything: orders, materials, even the building,” said Mario Denestant, the 35-year-old production manager who has worked at the company since 2010.\n\n“It’s like my life went up in flames,” he added, dissolving into tears.\n\n“We had orders that should have been shipped out more than three weeks ago, but because of the country’s problems, the containers were not here.”\n\nThose “problems” include a fuel shortage that led to the total paralysis of the country’s economic activities from mid-August to mid-September.\n\nHaiti, which subsidizes the cost of fuel, was unable to pay several million dollars in debt to oil companies, which then did not have the cash to supply the nation’s gas stations.\n\nThe shortage angered the public, already up in arms for more than a year about alleged government corruption, as numerous scandals have rocked Haitian political life.\n\nHaiti’s roads, deserted because of the fuel shortage, were overrun by sometimes violent protests. Opposition activists demanding the resignation of President Jovenel Moise set up barricades at will.\n\n– ‘Harder than the earthquake’ –\n\nAlong with the protests, looting and fires mounted. Business owners were left without recourse — and sometimes, without their livelihood.\n\nVery few are insured: losses due to political unrest are generally not covered, and many couldn’t afford policies even if it were.\n\nCaribbean Craft, founded in 2006, employs 150 people year-round, plus another 50 seasonal workers, and maintains a network of 250 artisans.\n\nThe facility has even welcomed famous visitors over the years, including American TV stars Oprah Winfrey and Conan O’Brien.\n\nAfter the fire, dozens of employees gathered in the courtyard in front of the blackened shell of their company’s headquarters, dark circles under their eyes and full of concern about the future.\n\n“We’re in a country where there really aren’t jobs,” said Mona Surpris, calling her work her “stability in an unstable country.”\n\nSurpris recalls the year when Haiti was struck by a massive earthquake that left more than 200,000 people dead and damaged the business.\n\n“In 2010, we weren’t even hit so badly,” she said. “We had to change buildings, yes, but this is harder than the earthquake because we have truly lost everything.”\n\n– Adverse business climate –\n\nMagalie Dresse, who owns Caribbean Craft, feels close to her employees and wants them to know that they won’t be abandoned — but she doesn’t want to sugarcoat the reality of the situation.\n\n“It’s a failed Christmas season, our biggest season for orders, especially since we just renewed the contract with HomeGoods,” Dresse lamented.\n\n“We had worked on our first order for them in six years, for 561 stores, and it’s all up in smoke,” the 44-year-old said.\n\n“A $89,000 order… the numbers hurt.”\n\nDresse refuses to give in, though — she has already called suppliers and is trying to figure out how to salvage what she can from the ashes.\n\nShe says she hopes the plight that she and othe business owners are facing will draw authorities’ attention to the need to improve the economic climate.\n\n“For years, we’ve talked about the country being ‘open for business,’ we’ve talked about foreign investments, but as long as we don’t have our own house in order, nobody is going to sell here,” she chided.\n\n“I’m going to stay hopeful: I know how to sell my country, I know how to sell the work of talented people, Haitian artisans… It’s unfortunate that my government does not know what that represents,” Dresse said.\n\nIt is unclear how much the disaster will cost Caribbean Craft in the long run, or if the company can recoup any money over the damage.\n\n“It is normal to complain,” Bocchit Edmond, Haiti’s foreign minister and also the tourism minister, said this week, referring to protesters.\n\n“It is not normal to destroy businesses that promote the image of the country.”", "description": "Port-au-Prince (AFP) – Tens of thousands of dollars of work reduced to ash: a devastating fire at a handicrafts company in Port-au-Prince", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/04/fb24f3_magalie-noel-dresse-owner-caribbean-craft-factory-walks-remains-factory-640x335.jpg", "published_at": "2019-10-04"}