{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7544983/Gold-Coast-teenager-Joc-Thompson-died-thrown-ute-joy-ride.html", "downloaded_at": "2019-10-07 06:02:35.721269+00:00", "title": "Gold Coast teenager Joc Thompson died after being thrown from a ute during a 'joy ride'", "language": "en", "text": "Joc Thompson died after falling from the back of a ute\n\nA 15-year-old boy is dead after he fell from the back tray of a ute during a 'joy ride'.\n\nJoc Thompson was in the back of a car, which was being driven by his unlicensed 16-year-old friend at the time, when he fell out of the back tray in Bundall on the Gold Coast about 1am.\n\nThe teenager behind the wheel was charged with dangerous operation of a vehicle causing grievous bodily harm and unlicensed driving, The Courier Mail reported.\n\nJoc was taken to hospital but died of his injuries.\n\nHis friends and family have remembered him as a loving son and 'great little athlete.'\n\nFamily friend Stacey-Lee Morgan said the entire ordeal was a 'tragedy.'\n\nJoc Thompson was in the back of a car, which was being driven by his unlicensed 16-year-old friend at the time, when he fell out of the back tray in Bundall on the Gold Coast about 1am\n\n'He was a great little athlete, was awesome when he raced BMX, and a good footy player,' Mrs Morgan said.\n\n'He was outgoing but had such a soft caring side, he was funny and takes after his loving father.\n\nThe Mudgeeraba Redbacks, the team Joc played football with in U15s, paid tribute to him in a Facebook post after his death.\n\nThe Mudgeeraba Redbacks, the team Joc played football with in U15s, paid tribute to him in a Facebook post after his death\n\n'Hearts are heavy today hearing the news about you Joc,' the post read.\n\n'We are sending so much love to your family and close friends during this tough time.'\n\nEmergency workers were called to Larne Avenue where they found Thompson.\n\nHe had struck his head when he fell from the back of the ute and was taken to Gold Coast University Hospital where he later died.", "description": "Joc Thompson was in the back of a car, which was being driven by his unlicensed 16-year-old friend at the time, when he fell out of the back tray in Bundall on the Gold Coast about 1am.", "authors": ["Brittany Chain For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/05/19380150-0-image-a-36_1570422293003.jpg", "published_at": "2019-10-07"}