{"pub": "thenextweb", "url": "https://thenextweb.com/podium/2019/10/09/why-amazon-is-your-competition-no-matter-what-business-youre-in", "downloaded_at": "2019-10-09 12:45:59.116819+00:00", "title": "Why Amazon is your competition — no matter what business you’re in", "language": "en", "text": "Whether you know it or not, you are competing against Amazon. And Netflix. As well as every other company in the world that engages customers digitally – which is just about all of them.\n\nI say that as someone who’s been hired by dozens of Fortune 500 companies and many other household brands to help them find, engage and keep online customers. It’s work we’ve been doing for more than a decade now, work that has put us in a position to know as much about contemporary customer engagement as anyone.\n\nSo, when I say you are competing against Amazon and others, it’s important to know that I don’t mean it figuratively. Even if you’re not in the retail space, Amazon and other digitally-forward companies are your competition for two reasons.\n\nIt’s all about digital experiences\n\nThe first is that most customers are digital customers now, regardless of their age. We call them “connected customers.” Their use of technology to engage with brands is so pervasive that it is no longer a trend, but instead the new normal.\n\nConnected customers use apps on their phone or other digital interaction points to do just about everything. They purchase more things online than in person. They almost always start their shopping search online even if they buy it offline. They stream most of their entertainment and essentially do most of their brand interactions via a digital brand experience, whether that be an app, a website, an Alexa skill or any number of other digital channels.\n\nFor the most part, this is pretty much everyone. This is such a way of life, it’s likely that large percentages of your customers, no matter what type or how large or small your business is, have grown to be accustomed to engaging, superior digital experiences across the board.\n\nThat’s important because the second reason Amazon is your competition is that all digital customers judge all digital experiences against the best, and worst, digital experiences they have ever had with any company. It’s a consequence of the global, on-demand, digital marketplace that puts any convenience, every store in your hand.\n\nToday’s customers no longer judge your performance against others in your marketplace, they judge it against everyone in every marketplace.\n\nWhy do they do this? Because connected customers look at everything as an experience. And they compare good and bad experiences, not directly competing products and services. When they shop at Zappos it’s about their customer experience, not the shoes.\n\nThey don’t compare their banking app to another bank’s app. They compare it to Uber, Hotel Tonight and, of course, Amazon. And once they have a delightful digital experience, that becomes their expectation for all experiences.\n\nIn other words, it doesn’t matter whether you sell land or landscaping or lanyards, your customers expect your digital experience to be at least as good as whatever their best digital experiences have been elsewhere – Amazon or Nextflix or whatever.\n\nIncreasingly, across all sectors from airlines to fashion magazines, from alcohol to finance, customers respond well to simple, well designed experiences that are personalized, contextual, and frictionless. And the key is, connected customers not only like great experiences, they have come to expect them, from everyone, including you.\n\nAnd if you cannot or do not engage your customers in ways that are unique to them, responsive, and simple, you risk losing them to someone who does.\n\nUnderstand what the real product is\n\nGo ahead, blame Amazon if you want. But you’d also better understand that it’s no longer good enough to build a better mousetrap (aka product or service). According to Salesforce, 80 percent of customers say the experience is as, if not more important, than the product or service they receive in said experience.\n\nNot to be too blunt, but those who don’t understand that customer experience is the product will perish. It’s simply that simple.\n\nCompanies used to think that their customers were more likely to die or divorce than change banks or grocery stores. Digital disruption has changed our lives forever, and digital Darwinism is a relentless force pushing its way through every industry.\n\nAnd yes, it’s tough to know whether to run and hide from this or take it head on, especially if you’re a legacy company with a lot to lose if you get the next move wrong. If you built your brand and your customer base serving customers a certain way, it’s tough to adapt and continue to succeed when the rules of the game keep changing.\n\nIt’s confusing and frustrating to have to change your mindset or culture, to go from competing against those in your market to competing against everyone everywhere. And sadly, many haven’t been able to do it.\n\nBut these new rules also offer an amazing opportunity for those who understand them and are willing to invent and iterate. Those companies and company leaders can win new customers at an unprecedented scale. A great brand experience has impressive ROI for your business.\n\nIn fact, 67 percent of customers say they are willing to pay more for a great experience (also according to Salesforce). The nice part of being in a global competition is that it’s basically anyone’s game to win.\n\nThe first step, the most important step, is admitting to yourself that you are now in the experience business, competing against every other company who knows they are also in the experience business. Once you change your perspective, everything looks different.", "description": "Even if you’re not in the retail space, Amazon and other digitally-forward companies are your competition for two main reasons.", "authors": ["Calvin Carter", "October"], "top_image": "https://img-cdn.tnwcdn.com/image/podium?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2FUntitled-design117.png&signature=f5637b5e84e159b5617f6295b5c71b9f", "published_at": "2019-10-09"}