{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/27/military-suicide-survey-finds-numbers-not-moving-r", "downloaded_at": "2019-09-27 05:39:43.142890+00:00", "title": "Military suicide survey finds numbers 'not moving in the right direction'", "language": "en", "text": "The Pentagon is facing a worsening suicide problem among active duty and National Guard service members, and officials say finding answers will not be easy.\n\nIn its first-ever “Annual Suicide Report” released Thursday, the Defense Department detailed rising suicide rates for active troops — 24.8 deaths per 100,000 — and members of the National Guard — 30.6 per 100,000 in 2018, a clear increase from the 2016 and 2017 rates.\n\n“Although the suicide rate among most of our military populations is comparable to broader civilian rates, this is hardly comforting, and our numbers are not moving in the right direction,” said Elizabeth Van Winkle, the department’s executive director for force resiliency.\n\nThe survey found that some 541 service members took their lives in 2018.\n\nThe report’s findings, described by Pentagon leaders as “disheartening and disappointing,” come on the heels of a trio of suicides within the space of a week by crewmembers assigned to the USS George H.W. Bush this month.\n\n“These deaths mark the third, fourth, and fifth crew member suicides in the last two years,” said Captain Sean Bailey, the ship’s commanding officer, in a Facebook post following the deaths. “Now is the time to come together as a crew and as a family to grieve, to support each other, and to care for those in need.”\n\nEarlier this year, the veteran community was rocked by a wave of three suicides within one week that were conducted on Veterans Affairs properties.\n\nWhile suicide rates among veterans decreased from 2015 to 2016, on average about 20 current or former service members take their lives each day, according to the most recent Department of Veterans Affairs data. Of those 20, six — nearly a third — have been in VA health care.\n\nThe latest reports, paired with the new statistics, are part of a troubling trend among service members that does not appear to have a solution.\n\nSpeaking to reporters on a visit to Norfolk Wednesday, Defense Secretary Mark Esper said “I wish I could tell you we have an answer to prevent further, future suicides in the armed services: We don’t.”\n\nMr. Esper, who was confirmed by the Senate to lead the Pentagon in July, has repeatedly said that his department needs to take a more active approach to suicide prevention among the branches.\n\n“The suicides are tragic,” he added. “Every single one is a tragedy. You mourn for the families and you mourn for their shipmates, everyone else.”\n\nWhile the Navy did not release additional information about the cause of death of the three shipmen who took their lives last week, the Pentagon’s report found that between 60% to 70% of those who die by suicide use a firearm.\n\nHowever, the report notes that historically 90% of active-duty firearm suicide deaths were by personally-owned firearms — not military-issue guns.\n\nThe majority of service members who take their lives are enlisted males under the age of 30 years old, according to the report.\n\nPentagon officials said they will implement a number of efforts to curb the rising suicide rates, including mental health initiatives, teaching service members how to respond to suicide warnings on social media, and increasing awareness of risk factors.\n\nMost notably, the officials said it is important to “destigmatize” for service members who reveal mental health issues or concerning behavior to a commanding officer. Similar to the ongoing sexual assault problem within the armed forces, service members of all ranks say they are hesitant to report mental health concerns due to fear of being demoted or belittled.\n\n“Seeking help is not a sign of weakness, it’s a sign of strength,” said newly-confirmed Army Secretary Ryan D. McCarthy and Army Chief of Staff James C. McConville in a joint statement. “The more we know about each other, the better equipped we are to recognize a call for help.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The Pentagon is facing a worsening suicide problem among active duty and National Guard service members, and officials say finding answers will not be easy.", "authors": ["The Washington Times Http", "Lauren Meier"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/26/military_suicides_47080_c0-0-5472-3190_s1770x1032.jpg?84283544d3cc688d49296344fdb2455c1a0f271f", "published_at": "2019-09-27"}