{"pub": "washingtonpost", "url": "https://washingtonpost.com/business/economy/taxing-us-billionaires-more-will-just-hurt-the-rest-of-us/2019/10/16/2f9ee828-ef82-11e9-8693-f487e46784aa_story.html", "downloaded_at": "2019-10-17 11:59:13.909092+00:00", "title": "Making America's richest families pay punitive new taxes will hurt all of us", "language": "en", "text": "Now, progressive Democrats seem determined to make the same kind of mistake, with sweeping soak-the-rich tax plans designed to punish greed, break up the concentration of economic and political power and raise vast sums to guarantee day care, health care, college educations and jobs for all Americans.\n\nThe latest progressive tax manifesto comes from two Berkeley economists, Emmanuel Saez and Gabriel Zucman, who are also advisers to Democratic presidential candidate Elizabeth Warren. In “The Triumph of Injustice: How the Rich Dodge Taxes and How to Make Them Pay,” Saez and Zucman build on years of groundbreaking work assembling decades of tax data to document the dramatic rise in income inequality.\n\nAD\n\nAD\n\nThis latest work focuses on the decline in taxes paid by wealthy Americans, including the startling finding that the richest 400 taxpayers now pay less in taxes as a percentage of their income — 23 percent — than the middle and working classes.\n\nTo roll back this loss of progressivity, the economists propose steep increases in the corporate tax and the individual income tax for the wealthiest households, along with a new annual wealth tax for those with a net worth of more than $50 million. Those changes would bring the overall tax burden for the richest Americans back up to 60 percent, where it was in 1960 — a level, they argue, demanded both by economic justice and economic efficiency.\n\nSaez and Zucman are respected economists who have produced a well-written, well-reasoned and thought-provoking book. The majority of tax experts and economists would endorse many of their proposals: an international treaty to shut down the use of tax havens by multinational corporations; stepped up auditing and enforcement by the Internal Revenue Service; equalizing tax rates for corporations and other businesses; equalizing tax rates for labor income (wages and salaries) and investment income (capital gains and dividends); “integrating” the corporate and individual income taxes by giving shareholders a tax credit for their share of corporate taxes paid. Given the Bush and Trump tax cuts, most would also agree that the rich need to pay more in taxes.\n\nAD\n\nAD\n\nBut some of their proposals push things too far, based on questionable assumptions and faulty logic.\n\nThe most obvious flaw — one that significantly affects all of their calculations and conclusions — is the assumption that any increase in the paper value of stocks or real estate that wealthy households own should be considered income in calculating their tax burden.\n\nThat may be the way the nation’s GDP accounts are calculated, but when thinking about the percentage of income individuals pay in taxes, it is simply misleading. The market price of Mark Zuckerberg’s Facebook stock might go up by a billion dollars in a year, but until he sells that stock for cash, that wealth shouldn’t be confused with income that can be used to buy a yacht or give to charity or pay his taxes. Yet it is on the basis of such unrealized paper profits that Saez and Zucman assert that the American tax system is no longer progressive. Not making that assumption, the Congressional Budget Office and the Tax Policy Center, among others, find that the tax system is still progressive, albeit less than it was and less than it should be.\n\nAD\n\nAD\n\nMore troubling is the moral calculus Saez and Zucman use to justify what they proudly acknowledge as confiscatory tax rates for the wealthy.\n\nThey start with the definition of economic justice proposed by the renowned Harvard philosopher John Rawls, who argued that the only reason to tolerate an economic system with any income inequality is that it makes even the poorest among us better off. From that standpoint, they reason, fairness requires that we keep raising taxes on the rich (and redistributing the revenue to the poor) until the rich stop working and head to the beach, or stop saving and investing, or take extraordinary steps to avoid paying taxes at all. Saez and Zucman calculate that for the ultrarich, that point won’t be reached until their annual cash income is taxed at 75 percent and their overall wealth at 3 percent.\n\nThere are two problems with this line of argument.\n\nAD\n\nAD\n\nThe first is the assumption that there is a fixed tipping point at which rich people begin to withhold their money or their excellence, shrinking the pie for everyone. It is in the nature of social scientists these days to believe that, on the basis of hard data, they can calculate exactly where that tipping point is. And it is in the nature of journalists to be skeptical of such calculations, knowing that economic decisions are shaped by norms and expectations that vary by country and culture and are constantly evolving.\n\nAs a political matter, these other strategies go down easier with Americans than confiscatory taxes and muscular redistribution. And they have the distinct advantage that they can be justified without demonizing those who acquired their wealth fair and square, providing products and services people wanted to buy at prices they were willing to pay.\n\n“Soaking the rich,” “making them pay” — this is the rhetoric of a class war that most Americans don’t want and that neither side can win. It’s bad politics and bad economics. In using the tax code as the go-to instrument for managing the economy or assuring economic and social justice, progressive Democrats risk making the same mistake as free-market Republicans. Doing so inevitably undermines what ought to be the primary goal of any tax system, which is to finance vital government services in a way that is efficient, economically neutral and broadly based on the ability to pay.\n\nAD", "description": "Democratic proposals for a wealth tax risk opening up a class war — which is not what most Americans want.", "authors": ["Steven Pearlstein"], "top_image": "https://www.washingtonpost.com/resizer/QNigmPU1jBG4_PfSP028ONmkbnM=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GU7424XQIII6TBUT6SD6IZ4EVI.jpg", "published_at": "2019-10-16"}