{"pub": "cnn", "url": "https://cnn.com/2019/10/15/politics/private-health-insurance-medicare-for-all-international-comparison/index.html", "downloaded_at": "2019-10-16 00:29:03.221915+00:00", "title": "Other countries show Medicare for All doesn't have to mean getting rid of private insurance", "language": "en", "text": "But theVermont independent senator's \"Medicare for All\" plan differs substantially from the insurance systems that exist up north and across the pond. Canadians and most European countries have private insurance industries alongside their government programs.\n\nOne of the most controversial provisions of Sanders' Medicare for All proposal is that it essentially eliminates private insurance -- allowing the industry to only offer benefits for services that are not covered by the federal program, such as cosmetic surgery. More than 150 million Americans buy private policies through their employers, and tens of millions more purchase private insurance through Medicare Advantage or on the individual market exchanges.\n\nSanders has made Medicare for All a centerpiece of his 2020 presidential campaign. Rivals ranging from President Donald Trump to former Vice President Joe Biden, who is also seeking the Democratic nomination, have gone the other way and argue that Americans should not be forced to give up policies they like. Sanders has defended his stance, slamming the private insurance industry for putting profits over patients.\n\nBut public and private insurance co-exist in Canada and many European countries. These developed nations require that everyone have coverage -- with private insurance typically providing additional benefits, helping to pay out-of-pocket costs or allowing faster and broader access to medical providers. In some nations, such as the Netherlands and Switzerland, residents satisfy their coverage mandate with policies from private carriers.\n\nIn many developed nations outside of the US, residents expect a lot from their health systems but they are conscious of the cost, said Chris James, an economist specializing in health care for the Organisation for Economic Co-operation and Development, a consortium of 36 developed countries.\n\n\"It becomes a tricky political balance between those competing sets of demands,\" James said. \"They want more generous public provisions but they don't want to pay too much more tax.\"\n\nHow health care coverage works in other countries varies widely.\n\nCanada, for instance, has a regionally administered public health insurance program, which is paid for by provincial and federal tax revenue, according to a 2017 report from The Commonwealth Fund. Patients don't pay for hospital care and doctors' visits. However, the universal program, known as Canadian Medicare, doesn't cover outpatient prescription drugs, rehabilitation, home care, dental benefits, vision care and some other services. Some two-thirds of Canadians are covered by private plans, often through their employers, to cover these treatments. The insurers are mostly for profit.\n\nEngland, meanwhile, has the very comprehensive National Health Service, paid for by taxes. Services are generally free, though there are some copayments for prescription drugs and some services, including dental care for most adults. Still, about 11% of residents sign up for private health insurance plans, which provide faster access to care, particularly elective hospital procedures, according to The Commonwealth Fund.\n\n\"They use it to jump the queue,\" said Robin Osborn, senior adviser with The Commonwealth Fund.\n\nThe system is very different in other countries, however.\n\nIn the Netherlands, residents are required to buy private insurance, which is heavily regulated and paid for by payroll taxes paid by employers, premiums paid by enrollees, annual deductibles, copayments and general taxes. Lower-income folks receive government subsidies to help them afford the cost, James said. Some 84% of the Dutch also buy additional private coverage to pay for dental care, eyeglasses, physical therapy and other services, mostly from non-profit insurers, according to The Commonwealth Fund.\n\nGermans are also mandated to have coverage. They can choose from more than 100 non-profit \"sickness funds,\" which covers a wide array of services, including drugs, physical therapy and dental work. Most are funded through payroll contributions that are split between workers and companies. About 11% of residents, mainly younger workers with higher incomes, opt out of this program and buy private coverage, which may offer a wider range of services with lower premiums, according to The Commonwealth Fund. Some of the private insurers are non-profit, while most are for profit.\n\nDenmark, meanwhile, has a national health care system paid for mainly by income taxes, but 42% of residents buy additional coverage to help pay for prescription drugs, dental care and physical therapy, mainly from the non-profit Danmark, according to The Commonwealth Fund. Additionally, 30% have supplemental policies from for-profit insurers to give them expanded access to private providers.\n\n\"These systems each have carved out a role for private insurance,\" Osborn said. \"The universal coverage provides a comprehensive package of benefits that is generous. The private insurance, depending on the system, often enables people to get care that is either faster, has a slightly higher level of amenities or additional benefits.\"\n\nThe Sanders campaign says that private insurers in other countries are very different from the American companies Sanders is fighting against.\n\n\"For the most part, for-profit, private insurance companies do not play a large role in other countries' health care systems and, to the extent that they do play a role, they are tightly managed and kept in line by the government,\" said Warren Gunnels, senior adviser to the campaign.", "description": "Bernie Sanders often points to Canada and Europe as models for universal health care coverage.", "authors": ["Tami Luhby"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191010163705-20191010-healthcare-country-comparison-super-tease.jpg", "published_at": "2019-10-15"}