{"pub": "yahoo", "url": "https://sports.yahoo.com/shocker-us-beaten-france-89-79-world-cup-130644672--nba.html", "downloaded_at": "2019-09-12 07:31:39.296400+00:00", "title": "A shocker: US beaten by France 89-79 in World Cup quarters", "language": "en", "text": "DONGGUAN, China (AP) -- No gold. No medal. No more winning streak.\n\nThe U.S. reign atop international basketball has ended - this time, thwarted by France at the World Cup.\n\nFor the first time since 2006, the U.S. sent NBA players to a major international tournament and won't win gold. Evan Fournier scored 22 points, Rudy Gobert had 21 points and 16 rebounds and France beat the U.S. 89-79 in the World Cup quarterfinals on Wednesday, rallying from a seven-point fourth-quarter deficit to pull off the upset.\n\nScroll to continue with content Ad\n\n''Any loss hurts,'' U.S. coach Gregg Popovich said. ''And in this situation, it hurts more. But life goes on. This is very important and we would have loved to have won ... but we're all grown, we all have families and lives and life goes on.''\n\nThe U.S. had won 58 consecutive tournament games in FIBA and Olympic competition, starting with the bronze-medal game at the 2006 world championships and continuing through every FIBA Americas, World Cup and Olympics event since. It was bidding to become the first nation to win three consecutive World Cups, after winning three straight Olympic golds in that span.\n\nThe best the Americans can do now in China is finish fifth, and they're assured of their worst finish in a big tournament with NBA players since placing sixth at the 2002 world championships. They're going home with a berth in the 2020 Olympics secured but no medal.\n\nDonovan Mitchell scored 29 points for the U.S., all of them coming in the first three quarters. The Americans came up scoreless on six consecutive possessions down the stretch, the drought that allowed the French to take control of a back-and-forth game for the final time.\n\nStory continues\n\n''Just got to take it like a man at this point,'' U.S guard Kemba Walker said. ''We lost. There's nothing we can do. We competed. We've been competing since day one that we got to training camp. But we gave it everything we've got. I know we're Team USA and things of that nature and they've been winning for a lot of years, but you know, we didn't get a chance to pull it off.''\n\nNando De Colo scored 18 for France. The French held the U.S. to 4 for 15 shooting in the fourth quarter - and benefited from the Americans going 4 for 11 from the foul line in the final 10 minutes.\n\n''We came here to win gold,'' Gobert said. ''We knew it wasn't going to be easy. A lot of people counted us out, but we got the win.''\n\nGobert said beating the Americans wasn't the goal - winning gold is.\n\n''It doesn't mean anything if you don't win in the end,'' Gobert said.\n\nFrance was up 10 early in the second half. The U.S. went on a 31-14 run over the next 10 minutes to go up by seven. And then the French responded with a 15-2 run over the next five minutes, going up 82-76 on a long jumper by Frank Ntilikina with 2:05 left.\n\nMitchell had a chance to get the U.S. within two with about a minute left, driving against Gobert - but the Utah center read what the Utah guard was going to do perfectly, swatting the try away.\n\n''We beat the U.S., and that's huge, but we haven't won anything yet,'' France's Nicolas Batum said.\n\nFrance had been 0-9 against the U.S. in major international play, most of those outcomes one-sided affairs. But the last meeting between the nations was only a 100-97 U.S. win at the Rio de Janeiro Olympics three years ago, and France returned three players - Gobert, De Colo and Batum - who got minutes in that game.\n\nNone of the U.S. players who played that afternoon in Rio is on this year's World Cup team.\n\nFrance outrebounded the U.S. 21-12 in the first half, Gobert found his way to the line 10 times in the game's first 20 minutes and the Americans went into the break trailing 45-39. The U.S. had trailed for 8:25 in their first five games combined - and trailed for 11:24 in the first half alone on Wednesday.\n\nFournier's layup with 7:33 left in the third gave France a 53-43 lead, and that's when Mitchell got going.\n\nHe had 14 points in the third quarter, and his dunk with 2:40 left pulled the U.S. into a 60-60 tie. Marcus Smart made three free throws after getting fouled by Gobert to put the U.S. back on top, and the Americans took a 66-63 lead into the fourth.\n\nBut they couldn't finish it off.\n\n''At the end of the day, you've got to tip your cap to them,'' U.S. guard Joe Harris said. ''They outplayed us. They deserved to win. We certainly didn't deserve to win that game.''\n\nTIP-INS\n\nFrance: Gobert played the first 12:26. The longest he went before getting his first break in a Jazz game last season was 11:30. ... Ntilikina scored 11 for France. ... The U.S. didn't turn the ball over at a very high rate - 11 times - but France converted those giveaways into 22 points.\n\nU.S.: Smart scored 11 and Walker had 10 for the U.S. ... Before Mitchell's offensive outburst Wednesday, the previous single-game scoring high for any U.S. player at this World Cup was Jaylen Brown's 20-point game against Japan in the opening group round. ... Jayson Tatum (sprained left ankle) missed his fourth consecutive game.\n\nLAUDING FRANCE\n\nPopovich had the highest praise for France and coach Vincent Collet. ''It's the best French team I've seen, because they play on both ends of the court,'' Popovich said.\n\nOLYMPIC BERTHS\n\nAustralia's win over the Czech Republic in the other quarterfinal on Wednesday gave France something else to celebrate - an Olympic berth. Spain and France are assured of being the top two World Cup finishers from Europe, earning them automatic spots into the field for the 2020 Tokyo Games.\n\nOthers qualified so far: the U.S., Nigeria, Iran, Australia, Argentina and Japan. The last four spots in the 12-team field will be decided next year.\n\nUP NEXT\n\nFrance: Faces Argentina in semifinals at Beijing on Friday.\n\nU.S.: Faces Serbia in consolation round at Dongguan on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports", "description": "The U.S. reign atop international basketball has ended - this time, thwarted by France at the World Cup.  For the first time since 2006, the U.S. sent NBA players to a major international tournament and won't win gold.  Evan Fournier scored 22 points, Rudy Gobert had 21 points and 16 rebounds and", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/Fv196UFKvJvXl91FQe0a3Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMjQ7aD02ODI-/https://s.yimg.com/uu/api/res/1.2/ZuS8Gx8DKICjRNFdhKUmCw--~B/aD0zNDE7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201909110813296019158", "published_at": "2019-09-11"}