{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7558951/Man-21-spent-three-years-jail-awaiting-triple-murder-trial-wrong-place-wrong-time.html", "downloaded_at": "2019-10-10 19:00:43.430935+00:00", "title": "Man, 21, who spent three years in jail awaiting triple murder trial was in 'wrong place, wrong time'", "language": "en", "text": "A man who spent three years in jail waiting for his triple murder trial was acquitted on Wednesday after a court heard he was in simply the wrong place at the wrong time.\n\nDemarrius Adams, 21, had been looking to buy $10 worth of marijuana in 2016 when he was caught in a deadly crossfire at the Embarcadero Club Apartments in Atlanta – a decision that nearly cost him his freedom and his life, Adams’ attorney Kenneth Sheppard said Wednesday.\n\nAdams, just 18 at the time, was arrested alongside two other 18-year-olds, Shannon Jabril White and Albert Roberto Mayes, after a drug deal went south and a hail of gunfire followed.\n\nSheppard told the Atlanta Journal Constitution that none of the three men would testify in court, but each made statements about the other suspects.\n\n‘There was so much evidence that he went there to purchase $10 worth of marijuana,’ Sheppard said. ‘After the purchase [of the marijuana], an event starts that he wasn’t a part of.’\n\nDemarrius Adams, 21, had been looking to buy $10 worth of marijuana in 2016 when he was caught in the deadly crossfire at the Embarcadero Club Apartments in Atlanta – a decision that nearly cost him his freedom and his life, Adams’ attorney Kenneth Sheppard said Wednesday\n\nAdams, just 18 at the time, was arrested alongside two other 18-year-olds, (left to right) Shannon Jabril White and Albert Roberto Mayes, after a drug deal went south and led to an exchange of gunfire.\n\nThe shooting at the apartment on the 2200 block of Sullivan Road killed Dtris Owens, who lived at the residence, Brandon Chevis and Bobby Humphrey, while Adams was shot but survived.\n\nResponding officers found Chevis dead in the living room, while Humphrey was found dead in the kitchen and Owens was found dead inside a bedroom. A black AK-47 was found in a bedroom near Owens' body, police said at the time.\n\nAdams was rushed to the Grady Memorial Hospital to undergo multiple surgeries before he was booked into jail, where he would remain for another 1,181 days.\n\nAfter an initial investigation, police accused Adams and Owen – who both lived at the complex – of shooting each other, while Humphrey and White were believed to have shot Chevis.\n\nMeanwhile Meyes was accused of waiting in a vehicle after the shooting.\n\nAuthorities also recovered a .38 caliber round, two 9mm pistols and a 7.62 assault rifle at the scene.\n\nAdams was accused of possessing one of the pistols, but Sheppard argued his client had nothing to do with the shoot-out, citing ballistic evidence that proved Adams couldn’t have pulled the trigger.\n\n‘He went there to buy marijuana, and then another person in the room, who is now deceased, and the drug dealer, who is now deceased, got into a gun battle,’ Sheppard told AJC.\n\n‘A security guy at the door also got into it ... it was just a horrible thing that we lose young people to this type of violence.’\n\nThe shooting at the Embarcadero Club Apartments (right) in the 2200 block of Sullivan Road killed Dtris Owens, Brandon Chevis and Bobby Humphrey, while Adams was shot but survived\n\nResponding officers found Brandon Chevis (above) dead in the living room, while Humphrey was found dead in the kitchen and Owens was found dead inside a bedroom. A black AK-47 was found in a bedroom near Owens' body, police said at the time.\n\nAdams was the first of the three men to go to trial, and on Tuesday a jury found him not guilty of 21 out of 22 felony counts, which included three counts of murder.\n\nBefore his acquittal, Adams faced up to four consecutive life sentences plus 30 years in prison.\n\nIn the end, however, he was only found guilty of purchasing marijuana, for which Sheppard openly admitted to the jury and he was given time served in jail plus a year on probation.\n\nSheppard commended the jury’s ruling, insisting he believes they got it right.\n\nMeanwhile, White and Mayes are still awaiting trial. They each face the same 22 felony charges, including three counts of murder, three counts of aggravated assault and one count of armed robbery.\n\nIt’s unclear when either of the men will go to trial. They have both been behind bars 1,211 days without bond.", "description": "Demarrius Adams, 21, had been looking to buy $10 worth of marijuana in 2016 when he was caught in a deadly crossfire at the Embarcadero Club Apartments on Sullivan Road, Atlanta.", "authors": ["Luke Kenton For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/16/19545162-0-image-a-71_1570720183189.jpg", "published_at": "2019-10-10"}