{"pub": "indiatimes", "url": "https://timesofindia.indiatimes.com/blogs/toi-editorials/hasinas-visit-forget-nrc-bogey-bangladesh-has-economic-lessons-for-india", "downloaded_at": "2019-10-07 00:08:09.534858+00:00", "title": "Hasina’s visit: Forget NRC bogey, Bangladesh has economic lessons for India", "language": "en", "text": "On the occasion of the visit of Bangladeshi Prime Minister Sheikh Hasina to India, the two sides have inaugurated three bilateral projects and inked seven agreements. The projects are the import of LPG from Bangladesh, a Vivekananda Bhavan at Ramakrishna Mission in Dhaka, and the Bangladesh-India Professional Skill Development Institute at the Institute of Engineers in Khulna. Meanwhile, the agreements include SOPs on the use of Bangladesh’s Chattogram and Mongla ports for movement of goods to and from India, renewal of cultural exchange programmes, and an MoU on providing coastal surveillance systems to Bangladesh.\n\nClearly, India-Bangladesh relations today are wide-ranging. This has been possible due to the synergy between the leaderships of the two countries. Plus, Bangladesh today is fast emerging as a South Asian dynamo. Its economy is projected to grow at more than 8% both this year and the next, and its per capita income now hovers around the $2,000 mark. Additionally, there are indications that Bangladesh has benefited from the US-China trade war with the country’s exports growing from 6.7% in 2018 to 10.1% this year.\n\nFor historical reasons, most of India’s foreign policy focus has remained on Pakistan. But Bangladesh has quietly overtaken Pakistan on most economic parameters. Thus it’s time to change the Indian narrative about Bangladesh. The latter is no longer a poor, famine-hit nation but a veritable South Asian growth engine. To keep India-Bangladesh ties on the ascendant, the Indian leadership must refrain from pushing projects like the National Register of Citizens. Despite PM Narendra Modi’s assurances to Hasina on NRC, the exercise puts a strain on bilateral ties. Bangladesh economy is doing very well and therefore the key push factor for illegal migration no longer exists. In fact, New Delhi should learn from Dhaka’s success and focus on reforms to boost its own economy.", "description": "On the occasion of the visit of Bangladeshi Prime Minister Sheikh Hasina to India, the two sides have inaugurated three bilateral projects and inked seven agreements. The projects are the import of LPG from Bangladesh,...", "authors": ["Toi Edit"], "top_image": "https://timesofindia.indiatimes.com/blogs/wp-content/uploads/2019/01/toiedit-logo.jpg", "published_at": "2019-10-07"}