{"pub": "time", "url": "https://labs.time.com/story/gun-loophole", "downloaded_at": "2019-09-04 04:08:11.481760+00:00", "published_at": "2019-09-04", "title": "How America Let Criminals and the Mentally Ill Buy 55,887 Guns", "language": "en", "text": "How America Let Criminals and the Mentally Ill Buy 55,887 Guns\n\nThe recent shooting at Oregon’s Umpqua Community College, which claimed 10 lives in one of the nation’s deadliest mass shootings in recent years, has brought new scrutiny to the ease with which anyone can purchase a gun in America.\n\nAuthorities say that the 26-year-old gunman Christopher Harper-Mercer purchased the 14 weapons he owned legally. This has contributed to calls from politicians such as Hillary Clinton for expanded background checks, along with an end to the “Charleston loophole,” which allows for thousands of guns – 55,887 between 1998 and 2014 – to be sold to people with criminal records and mental illness, such as Dylan Roof.\n\nHow does that happen? Individuals attempting to purchase a gun through a licensed dealer – rather than at a private show or unlicensed online – are subject to a criminal background check conducted by the FBI’s National Instant Criminal Background Check System (NICS). In spite of its name, however, the system does not always return an instant verdict on whether the purchaser can buy the firearm. Since 1998, according to data from the FBI, federal and state governments have run 202 million background checks on prospective gun owners. Nine percent of these checks delay the sale. If three business days pass without a verdict from the FBI, licensed dealers can sell the gun anyway – a provision known as a “default proceed.”\n\nScroll through the interactive below to see how the background check loophole has put an average of 3,490 guns in the wrong hands every year since 1998.\n\nThe ATF said it could not provide information on how many of these weapons were recovered.\n\nATF spokeswoman Dannette Seward said that “so far, there’s been no uniform method by which agents are entering firearm retrievals into a database, so we have no meaningful way to pull that data.”\n\nIt was this three-day NICS loophole that allowed Dylan Roof to legally purchase the gun he used to kill nine churchgoers during a Bible study in Charleston, S.C. on June 17, 2015. Roof’s background check returned a recent arrest in Columbia, S.C., delaying the transaction. An FBI examiner contacted the Lexington County Sheriff’s Office, who told her to check with Columbia Police. The examiner couldn’t find a Columbia police department in Lexington County, not knowing a small part of the city of Columbia – where Roof was arrested – lies in neighboring Columbia County. Meanwhile, three days passed, allowing Roof to return and purchase the gun as a default proceed. “We are all sick this happened,” FBI Director James Comey said, “we wish we could turn back time. From this vantage point, everything seems obvious.”\n\nThe “default proceed” loophole was made possible by a last minute amendment added to the 1993 Brady Act by Congressman George Gekas, a Republican from Pennsylvania. The FBI has since suggested that more time be allotted to investigate delayed transactions, but the law remains unchanged. In response to questions about how NICS accommodates the three-day delay, FBI spokesman Stephen Fischer wrote in an email that “the FBI continues the ongoing hiring initiative to increase the staff for the NICS section.”\n\nFollowing the shooting in South Carolina, Democratic Congressmen James Clyburn introduced the Background Check Completion Act, proposing the elimination of the three-day loophole. And Hillary Clinton went a step further Monday, discussing the possibility of exercising executive action to close the loophole if elected president.\n\nWhile there has been no change at the federal level, several states and the District of Columbia have extended the three-day rule. In Tennessee, for instance, examiners are given 15 calendar days to examine the buyer’s background before a “default proceed.”\n\nSome vendors have gone even further to close this loophole. Two years after a 2000 FBI report found that delayed background checks are 20 times more likely to be denied, Walmart refused to sell any firearm without a completed background check. But few other chains have adopted a “don’t know, don’t sell” policy.\n\nImage: Getty Images (3)", "description": "", "authors": [], "top_image": "https://timeinclabs.files.wordpress.com/2015/10/guns.jpg?quality=75&strip=color"}