{"pub": "yahoo", "url": "https://news.yahoo.com/russians-enter-syrian-border-towns-141701637.html", "downloaded_at": "2019-10-23 17:18:58.566806+00:00", "title": "Russian forces enter Syrian border towns after deal struck with Turkey", "language": "en", "text": "President Donald Trump has claimed the US had saved the lives of “thousands” in Syria and took credit for the ceasefire, in a barnstorming speech declaring the end of American involvement in the war.\n\n“This is an outcome created by us, the US, and nobody else,” he said, addressing reporters at the White House a day after Turkey and Russia brokered a deal for Kurdish-held north-east Syria without the US president.\n\nMr Trump green-lit a Turkish-led offensive along the Syrian border two weeks ago, effectively abandoning Kurdish partners who had helped to defeat Islamic State.\n\nInternational condemnation followed as hundreds of thousands of civilians fled the fighting and more than 80 Syrian civilians were killed.\n\nMr Trump imposed sanctions on Ankara in response to its offensive moves, but announced in his speech yesterday that these would be lifted if the ceasefire held.\n\n\"We’ve avoided another costly military intervention, many thousands of people could have been killed,” he said, flanked by Mike Pence, Vice President, and Mike Pompeo, Secretary of State.\n\n“Turkey, Syria and all forms of the Kurds have been fighting for centuries. We have done them a great service, a great job for all of them,” he said, declaring the US was done fighting others’ wars. “We’re getting out. Let’s someone else fight over this long bloodstained sand.”\n\nHe promised in future to only deploy American troops into battle when the US’s national interests are at stake, and only when there was a plan to win. “We will only win,” he said.\n\nHis claims of success bore little resemblance to the reality on the ground, however, and were likely intended for his base at home to whom he had promised an end to \"endless wars\".\n\nThe US president’s announcement came a day after a deal was struck between Turkish President Recep Tayyip Erdogan and Russian President Vladimir Putin to \"facilitate the removal\" from the border region of Kurdish People's Protection Units (YPG) fighters.\n\nRussian President Vladimir Putin receives Turkish President Recep Tayyip Erdogan in Sochi Credit: Getty More\n\nThe agreement will also see Turkey preserve a so-called \"safe zone\" inside Syria about 75 miles long and 20 miles deep.\n\nTurkey’s defense ministry said that the withdrawal from the buffer zone would mean that there was “no further need to conduct a new operation,” preventing a feared humanitarian catastrophe.\n\nThe deal effectively redraws the map of northern Syria and ends nearly six years of autonomy carved out by the local Kurdish administration.\n\nRussian and allied Syrian government forces began patrolling for the first time yesterday in towns US forces were once stationed.\n\nHumvees bearing Russian flags were filmed driving into Kobane, marking the first pro-regime presence in the area in more than seven years.\n\nThe talks, which took place in Mr Putin’s dacha in the Black Sea resort of Sochi, confirmed Moscow’s position as powerbroker in Syria.\n\n\"The United States has been the Kurds' closest ally in recent years. (But) in the end, it abandoned the Kurds and, in essence, betrayed them,\" Dmitri Peskov, a Kremlin spokesman, said pointedly on Wednesday. \"Now they (the Americans) prefer to leave the Kurds at the border (with Turkey) and almost force them to fight the Turks.\"", "description": "Russian forces and Syrian troops began deploying along the Turkish border on Wednesday, after striking a deal with Turkey to stave off a large offensive on Kurdish-held Syria. Humvees bearing Russian flags were filmed driving into Kobane - a town considered by the Kurds to be the heart of their territory", "authors": ["Josie Ensor"], "top_image": "https://s.yimg.com/uu/api/res/1.2/5tSizN8bm4AgtZVy2IerLA--~B/aD0xNTYzO3c9MjUwMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_258/a0e705bbd30b062a6ff8ff32a0f9540d", "published_at": "2019-10-23"}