{"pub": "nymag", "url": "https://vulture.com/2019/10/daybreak-netflix-review.html", "downloaded_at": "2019-10-24 02:32:39.958038+00:00", "title": "In Daybreak, the Apocalypse Is Just Like High School", "language": "en", "text": "The young survivors in Netflix’s Daybreak. Photo: Ursula Coyote/Netflix\n\nDaybreak is a postapocalyptic Netflix series about factions of California teens who survived a nuclear blast that killed untold others and turned many adults into “ghoulies,” the Daybreak equivalent of zombies. Daybreak is also an extended homage to Ferris Bueller’s Day Off, one that puts its reverence for that 1986 John Hughes film on blatant display.\n\nThe first episode, especially, lays on the Ferris extra-thick. Josh Wheeler (Colin Ford of Under the Dome), an average student and our primary protagonist, is introduced to us as a teacher calls attendance — “Wheeler? Wheeler?” — and he immediately breaks the fourth wall to address the audience. He explains that things have been pretty good since the nuclear disaster happened because, effectively, every day is a day off. At one point, he revs up a sports car he inherited. At another, he addresses the camera while sitting in a lawn chair and drinking a daiquiri at Dodger Stadium. “Things move pretty fast in here,” Josh says in a later episode after taking shelter in a new location that’s not entirely ghoulie-free. “If you stop and look around, you might get eaten.” On top of all that, the principal at Josh’s high school, a character who also plays a significant role in Daybreak, is portrayed by Ferris himself: Matthew Broderick. At times, this show feels like it’s one “Danke schön” and a “chicka chick-aaa” away from being a full-on dystopian reboot of Ferris.\n\nWhile that teen classic isn’t the only piece of pop culture referenced in this irreverent, sometimes overly audacious series, which starts streaming October 24, that movie’s central idea — “What would it be like to be a teenager who does whatever he wants without consequences?” — also very much informs Daybreak, based on Brian Ralph’s comic and co-created by Aron Eli Coleite (Heroes, Star Trek: Discovery) and Brad Peyton, who directed The Rock’s movies San Andreas and Rampage. With the majority of grown-ups either wiped out or literally brain dead, the kids are truly in charge of their own lives. Consequently, society, at least in Glendale, California, where the show is set, operates almost like a high-school cafeteria. There are tribes born out of the cliques that existed pre-wasteland — the Disciples of Kardashia, the STEM Punks, the Jocks, who, in their post-nukes apparel, appear to have been yanked out of Mad Max: Fury Road — and each one stakes out their own territory.\n\nJosh, initially on his own and focused on tracking down his crush, Sam (Sophie Simnett), teams up with Wesley (Austin Crute), a football player who considers himself a samurai warrior, and Angelica (Alyvia Alyn Land), a 10-year-old homeschooled wild child. (“As far back as I can remember,” she announces in episode three, quoting directly from GoodFellas, “I always wanted to be a gangster.”) The three of them start to band together and, in a nearby shopping mall, potentially build their own community. The series, like The Walking Dead, is about the attempt to survive and adapt to a new reality after a major disaster. But it’s also, like every high-school story, an exploration of the dynamics between kids who are coming of age, only in more desperate circumstances.\n\nThe thing about Daybreak, though, is that it never feels as though anyone is experiencing real desperation. The series adopts an irreverent tone and distances itself completely from the tragedy of a bomb having been dropped on the United States. “Little dictators with big egos, well, they can launch a nuke with a tweet,” Josh says in the first episode. “And then one day, they did.” At least in the first five episodes provided in advance to critics, that’s all we know about the blast itself. We don’t know which little dictator Josh is referring to, we don’t know exactly how the rest of America was affected, and within the context of the series, it doesn’t really matter. Daybreak glosses over the realities of such a catastrophic event with a thick coat of knowing humor, breakneck shifts from flashbacks to the present, and POV shifts. Often, that approach works pretty well.\n\nBut at times, the series cops an attitude so aggressively that it becomes exhausting. Daybreak is never subtle. As much as the show references pop culture, it also tries to deconstruct it, usually using a jackhammer rather than a more delicate instrument. In an episode that switches the narrator from Josh to Angelica, Angelica establishes the change with these words: “I bet all of you thought this was Josh’s story, the cis white male guiding you through the end of the world. TV testing says people like a warm blanket of familiarity so they can second-screen their Insta feed. But I say, let’s fuck some shit up! This is my story now.” It’s cool that Daybreak is inclusive and doesn’t just tip its hat to movies like Ferris Bueller’s Day Off but flips the script on them in key ways. But it also knows it’s cool and wants you to acknowledge that it’s cool, which is … a little less cool?\n\nThe show’s shout-outs to movies and music also feel less of this generation and more of Gen X. There are nods to The Karate Kid, Mannequin, The Breakfast Club, the Smashing Pumpkins, and Wu-Tang Clan. At one point, Angelica makes a joke about Tom Sizemore’s dick, presuming that Tom Sizemore and his genitals are subjects that come up a lot among today’s preteens. On the other hand, the fact that Angelica becomes a pint-sized Walter White by distributing edible Slime laced with prescription pills feels very much of the present. Just when Daybreak stretches your patience, it has a way of rebounding with a clever touch or a strong performance that makes you give it more chances.\n\nAs Josh, Ford is affable, laid-back, and completely in touch with the vibe the series is going for, as is Crute’s Wesley, who gets an episode devoted to his POV that includes a particularly brilliant stroke in its choice of narrator. As for Broderick, he seems to relish the opportunity to inhabit a lower-key version of Ed Rooney, the principal obsessed with bringing down Ferris Bueller.\n\nDaybreak can be a little gross — there are killings and amputations and some business involving the consumption of maggots — and it can be a bit much. But it’s also as confident in itself as a 17-year-old who thinks he knows how the world works even if he’s barely lived in it yet. In that way, this series about teenagers understands teenagers perfectly.", "description": "A review of the Netflix series Daybreak, based on the comic by Brian Ralph, and starring Matthew Broderick and Colin Ford.", "authors": ["Jen Chaney"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/10/10-daybreak.w1200.h630.jpg", "published_at": "2019-10-23"}