{"pub": "bbc", "url": "https://bbc.com/news/uk-politics-50035156", "downloaded_at": "2019-10-14 00:02:37.035103+00:00", "title": "'Brexit: 'Big gap' remains in UK-EU deal discussions", "language": "en", "text": "Image copyright PA Media Image caption Arrangements for the Northern Ireland border are a key sticking point in the UK-EU deal talks\n\nThe UK is willing to make concessions to its plans for the Northern Ireland border after Brexit but \"a big gap\" remains over customs arrangements, EU ambassadors have been told.\n\nIn a briefing on UK-EU weekend talks on a Brexit deal, EU chief negotiator Michel Barnier said UK plans on the tracking of goods were unacceptable.\n\nEarlier, Boris Johnson told his cabinet \"significant work\" was still needed.\n\nIt comes as his government's agenda is to be set out in the Queen's Speech.\n\nPlans for life after Brexit, crime prevention and ending rail franchises are all expected to be outlined by in the Queen's address on Monday, which opens the new session of Parliament.\n\nMeanwhile, the UK and EU negotiating teams are due to meet again in Brussels today, as efforts continue to reach a deal before a summit on Thursday and Friday.\n\nThe government says that, if it can strike an agreement at the summit, it will introduce a withdrawal agreement bill to be voted on next Saturday in a special Parliamentary session.\n\nIt is seen as the last chance to do this before Brexit is due to happen at 23:00 GMT on 31 October.\n\nOn Sunday, Mr Johnson told cabinet ministers he could see a \"way forward\" to a deal \"in all our interests\".\n\nThe European Commission echoed the prime minister, saying: \"A lot of work remains to be done.\"\n\nIn a statement it added that the \"intense technical discussions\" between the UK and EU officials in Brussels would continue on Monday before member states were updated on the progress at a meeting in Luxembourg on Tuesday.\n\nImage copyright Reuters Image caption Talks between the UK and EU will continue in Brussels on Monday\n\nThe issue of the Northern Ireland border in post-Brexit arrangements is seen as the key factor in the EU-UK talks and Mr Johnson came up with revised proposals this month.\n\nBBC Brussels correspondent Adam Fleming said Mr Barnier, in his briefing to EU diplomats, said the UK had dropped its proposals to include an up-front veto for Northern Ireland politicians in the Stormont Assembly before any arrangements for Northern Ireland came into force.\n\nBut he said the UK is still seeking the power for Northern Ireland to leave the arrangements at some point in the future.\n\nAccording to a note of his meeting with EU ambassadors on Sunday evening, Mr Barnier also said he would be willing to accept Mr Johnson's plan for Northern Ireland to remain part of the UK's customs territory but apply EU customs procedures.\n\nHowever, he said he could not accept a British proposal to track goods entering Northern Ireland to determine whether they ended up in Ireland.\n\nOur correspondent said it appeared EU negotiators seemed to have \"softened\" their position, indicating they are prepared to keep talking until Wednesday, the eve of the summit, despite saying previously that a revised deal had to be ready a week in advance.\n\nAnalysis\n\nImage copyright PA Media Image caption Rehearsal for the State Opening of Parliament and Queen's Speech have been taking place\n\nBy BBC political correspondent Nick Eardley\n\nThis Queen's Speech will feel rather different to normal.\n\nBoris Johnson does not have a majority in Parliament and cannot guarantee that he will be able to pass all the bills announced this morning. There is no guarantee the Queen's Speech itself will pass.\n\nAdd into the mix the fact he wants a general election and some of what you will hear will feel more like a pitch to the country than a concrete plan for the next year in Whitehall.\n\nThere is also the fact that whatever is announced in the House of Lords could quickly be overshadowed by what happens in Brussels.\n\nA lot has been spoken about crucial weeks at Westminster.\n\nThis really feels like it could be one - where key questions are answered.\n\nCan the PM get a new Brexit deal? If so, can he persuade Parliament to back it? If not, can MPs force him to delay Brexit again?\n\nStrap yourself in - it could be a bumpy few days.\n\nThe State Opening of Parliament - an event steeped in pomp and ceremony - is the first since Boris Johnson became prime minister.\n\nMinisters say the speech, the 65th of Elizabeth II's reign, will focus on \"people's priorities\".\n\nImage copyright Reuters Image caption It will be the first Queen's Speech since Boris Johnson became PM\n\nImage copyright Getty Images Image caption The State Opening of Parliament is Westminster's biggest ceremonial event\n\nIn the Queen's Speech, the government will unveil its plans to get the withdrawal agreement bill through Parliament if the PM gets a deal with the EU, and to end the free movement of EU citizens into the UK after Brexit.\n\nIt will promise to create more powers to \"get weapons off our streets\" and ensure \"the worst offenders serve the time they deserve\".\n\nAnd it will pledge to \"significantly increase\" sentences for foreign offenders who return to the UK having breached deportation orders.\n\nOther proposals in the Queen's Speech include:\n\nMeasures to bring in a points-based immigration system from 2021\n\nScrapping the rail franchise system - the contracting out of services introduced when the rail system was privatised in the 1990s\n\nSetting up an independent NHS investigations body with legal powers to improve patient safety\n\nUpdating the Mental Health Act to reduce the number of detentions made under it\n\nCreating legally binding targets to reduce plastics, cut air pollution, restore biodiversity and improve water quality\n\nThere are also plans to improve building standards, and increase investment in infrastructure and science.\n\nMr Johnson promised to \"get this country moving again\", adding: \"This is a Queen's Speech that will deliver for every corner of the UK and make this, once again, the greatest place on Earth.\"\n\nBut, with a general election expected soon, Labour is calling it a \"stunt\" and a \"party political broadcast\".\n\nLabour leader Jeremy Corbyn told Sky News on Sunday that holding the event ahead of an expected general election in the autumn was \"ludicrous\".\n\nHe said: \"What we have got in effect is a party political broadcast from the steps of the throne.\"\n\nTimeline: What's happening ahead of Brexit deadline?\n\nMonday 14 October - The Commons is due to return, and the government will use the Queen's Speech to set out its legislative agenda. The speech will then be debated by MPs throughout the week.\n\nThursday 17 October - Crucial two-day summit of EU leaders begins in Brussels. This is the last such meeting currently scheduled before the Brexit deadline.\n\nSaturday 19 October - Special sitting of Parliament and the date by which the PM must ask the EU for another delay to Brexit under the Benn Act, if no Brexit deal has been approved by Parliament and it has not agreed to the UK leaving with no-deal.\n\nThursday 31 October - Date by which the UK is due to leave the EU, with or without a withdrawal agreement.", "description": "The future of Northern Ireland's border dominates, while Parliament reconvenes for the Queen's Speech.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/B98E/production/_109220574_mediaitem109220573.jpg", "published_at": "2019-10-13"}