{"pub": "thenextweb", "url": "https://thenextweb.com/hardfork/2019/10/10/singapore-cryptocurrency-fraud-amazon-web-services-bitcoin-ethereum-mining-google-cloud-services", "downloaded_at": "2019-10-10 08:34:09.729178+00:00", "title": "Alleged $5M cryptocurrency fraud made this guy one of AWS’ biggest clients", "language": "en", "text": "A Singaporean man faces over 30 years in prison for masquerading as a Californian games developer to illicitly obtain cloud computing power to mine cryptocurrency, an FBI investigation has revealed.\n\nUS authorities indicted Matthew Ho, 29, with 14 counts related to his long-running scam, which allegedly involved stealing identities and credit cards to purchase services from major US-based providers Amazon Web Services (AWS) and Google Cloud Services.\n\nAccording to a Department of Justice (DoJ) release, Ho consumed more than $5 million in unpaid cloud computing services between October 2017 and February 2018 — a time span of just a few months.\n\nThe extent of the operation allegedly made Ho one of AWS‘ largest consumers of data by volume for a short time.\n\nThis was reportedly possible due to Ho’s creation of a “web of phony email accounts,” combined with social engineering techniques, to convince cloud computing providers to defer billing and approve heightened account privileges, which granted access to more processing power and storage.\n\nIn particular, indictment docs show Ho used the monikers “Prefinity” and “Ethereum Vendor” to sell the illicitly-generated cryptocurrency via peer-to-peer marketplaces LocalBitcoins and LocalEthereum. He’s also said to have used Facebook to solicit further business.\n\n“Whats your move?”\n\n“Some of the bills were paid by the California game developer’s financial staff before the fraud was detected,” said the DoJ. “Ho also used the identities of a Texas resident and the founder of a tech company in India […] which he similarly used as part of his cryptocurrency mining operation.”\n\nHo is also alleged to have charged hundreds of thousands of dollars to his victim’s credit cards, which they paid before realizing the fraud.\n\nIf found guilty on all counts, Ho faces more than 30 years in prison. He’s now reportedly in the custody of Singaporean police, under investigation for various alleged offences committed under Singaporean law.\n\nWant more Hard Fork? Join us in Amsterdam on October 15-17 to discuss blockchain and cryptocurrency with leading experts.", "description": "According to the US Department of Justice, Ho consumed more than $5M in unpaid cloud computing services to mine cryptocurrency such as Bitcoin and Ethereum.", "authors": ["David Canellis", "October"], "top_image": "https://img-cdn.tnwcdn.com/image/hardfork?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F05%2Famazon-blockchain-cryptocurrency-bitcoin-amazon-web-services-aws-1.jpg&signature=e6ca7b23f344767ddd1ecc2f74d569e6", "published_at": "2019-10-10"}