{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7557739/Bride-asks-cousins-bodycon-dress-edited-wedding-photos.html", "downloaded_at": "2019-10-10 15:31:57.553273+00:00", "title": "Bride asks for her cousin's bodycon dress to be edited in wedding photos", "language": "en", "text": "A bride has asked for her own cousin to be edited in her wedding photographs, after the guest turned up in a tight green bodycon dress.\n\nThe anonymous newlywed even offered to pay whoever successfully 'covered' her relative's chest and 'made her stomach smoother'.\n\nShared to Facebook group That's It, I'm Wedding Shaming by a Canadian member, the photograph showed the cousin sporting a figure-hugging frock as she stood at the edge of a group with the bride.\n\nIt was later revealed that even the woman herself agreed with the bride's sentiments, and now regretted her choice of dress.\n\nA bride has asked for her own cousin pictured far left) to be edited in her wedding photographs after the guest turned up in a tight green bodycon dress\n\nThe anonymous newlywed even offered to pay whoever successfully 'covered' her relative's chest and 'made her stomach smoother'\n\nSocial media users were quick to blast the cousin's decision to sport the tight-fitting frock at her relative's wedding, with many suggesting it showed a lack of respect.\n\nThe wedding snap was originally posted to a photo-editing Facebook group with the caption: 'Can anyone edit my cousin's dress on the far left to cover up her boobs, make her dress longer and make her stomach smoother.\n\n'I will donate $3 to my favourite edit. I have permission to edit. Thanks,' the original poster added.\n\nThe request and the photo was shared to Facebook group That's It, I'm Wedding Shaming by a Canadian member, with several outraged social media users calling for the cousin to be cut out of the images completely\n\n'Lawd I'm old... I thought it was a bathing suit,' one person wrote, as another said: 'To be fair, she looks like she's wearing a swimsuit. It's awful.'\n\nOther people called for the cousin to be cut out of the images completely.\n\n'Disgusting! And to a wedding! No self respect. No respect for the bride and groom. No words or excuse could justify this monstrosity! Cut her out completely! How rude!,' one person said.\n\nA second added: 'I'm all for dressing how you like but seriously it's a wedding, dress for your size and have some class.'\n\nMembers of the wedding shaming group mocked the woman's green garment for looking like an old-fashioned swimsuit\n\nSeveral social media users tried their hand at photo-shopping the image for the bride - with hilarious results\n\nOne showed the cousin in a wedding dress, while another captured the woman in a green armoured suit\n\nSome members tried their hand at photo-shopping the image for the bride - with hilarious results.\n\nOne showed the cousin in a wedding dress, while another captured the woman in a green armoured suit.\n\nAnd ignoring the cousin's look completely, several people pulled the bride up for offering so little money for the images to be edited.\n\n'I'm actually more offended by the $3 donation than what she is asking for,' said a member.\n\n'The most offensive thing about this whole post is that she offered to pay the editor $3,' another said.\n\nIgnoring the cousin's look completely, several people pulled the bride up for offering so little money for the images to be edited", "description": "Shared to Facebook group That's It, I'm Wedding Shaming by a Canadian member, the photograph showed the cousin sporting a curve-hugging frock as she stood with the bride.", "authors": ["Jessica Green For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/10/19530538-0-image-a-77_1570701411502.jpg", "published_at": "2019-10-10"}