{"pub": "heritage", "url": "https://heritage.org/asia/commentary/the-first-hopefully-many-steps-respond-human-rights-violations-xinjiang", "downloaded_at": "2019-10-10 15:02:11.413597+00:00", "title": "The First of (Hopefully) Many Steps to Respond to Human Rights Violations in Xinjiang", "language": "en", "text": "The U.S. government’s response to the atrocities taking place in Xinjiang is finally turning from rhetoric into action.\n\nOn Monday, the Commerce Department placed 28 Chinese companies, including eight tech companies, on the Entity List, limiting their ability to do business with American companies. Just today, the U.S. government also announced travel restrictions on members of the Chinese government, members of the Chinese Communist Party, and their families for the role they play in violating human rights in Xinjiang.\n\nNury Turkel, a Uighur by birth and head of the Attorney and Board Chair for the Uyghur Human Rights Project reacted to the move saying:\n\nThe Trump administration should be commended for sanctioning businesses and entities that have aided and abetted the Chinese government in furtherance of policies that amount to cultural genocide. These entities and others implicated should be held to account for facilitating the Chinese government's ghastly human rights abuses against the Uyghurs and other Turkic Muslims.\n\nTwo of the designated companies are Hikvision and Dahua, producers of the artificial intelligence surveillance technology that has been crucial to Beijing’s rapid, mass round-up of Uighurs. At the bidding of Xinjiang Chief Administrator Chen Quanguo, the government has deployed their technology throughout the region to monitor its minority Muslim Uighur population.\n\nIn addition to deploying the surveillance technology, Chen created and implemented a grid-style social management system, placing so-called “convenience” police stations on every corner.\n\nAn intrusive police presence, combined with the surveillance technology, has enabled China to arbitrarily detain more than 1 million Uighurs and place them in political re-education facilities.\n\nThe scale of these human rights violations have no parallel in the 21st century. Uighur Muslims inside these political reeducation facilities are subject to forced indoctrination, self-criticism sessions, and mandatory Mandarin lessons. Reports of torture, forced labor, and even death, abound. Many Uighurs living abroad have lost contact with family members who have disappeared into the vast web of these camps.\n\nUntil now, the U.S. has done little to respond these human rights abuses. Strong statements from Vice President Mike Pence and Ambassador for International Religious Freedom Sam Brownback intimated that some action might be on the horizon. Toward the tail end of 2018, there were whispers of potential sanctions against individuals like Chen Quanguo. Yet now, almost a year later, not a single individual in China has been financially sanctioned for human rights violations in Xinjiang. Newly announced visa restrictions represent a positive step toward personal accountability for the violations members of the Chinese government have perpetrated.\n\nWhile these designations are a welcome move, the timing of both decisions is dubious. Issued on the eve of meetings related to ongoing U.S.-China trade negotiations, these actions may have been taken to either increase pressure on the talks or to scuttle them. It may have simply been a lack of coordination among the various agencies involved in China policy. Whatever the case may be, the designations were long overdue.\n\nResponding to human rights challenges is strategic in its own right. It is the American way to defend freedom all across the globe. In this case, it is in U.S. interests to respond with strength to atrocities in Xinjiang because there is an ongoing competition between systems of governance – authoritarianism and democracy. Standing for liberty ensures the vitality of universal values in Asia and strengthens the hand of those who stand for them.\n\nThe decision to designate these 28 Chinese entities and institute travel restrictions are welcome first steps – but they are just that – first steps. In a Heritage Foundation report released earlier this year, I outlined a series of next steps the U.S. government should consider to respond to the crisis in Xinjiang.\n\nFor one, there is a strong need to institute targeted financial sanctions against individuals like Chen Quanguo and others responsible for violating human rights. The U.S. should also consider creating a Special Coordinator for Xinjiang, modeled after the Special Coordinator for Tibet position – a post that has regrettably remained vacant under the Trump administration. Finally, the U.S. government should do more to investigate and target the use of forced labor in Xinjiang.\n\nThe U.S. should move beyond first steps and prioritize the defense of human rights and freedom in China, regardless of any motivations related to ongoing trade negotiations.", "description": "The U.S. government’s response to the atrocities taking place in Xinjiang is finally turning from rhetoric into action.", "authors": ["Olivia Enos", "Senior Policy Analyst", "Asian Studies Center", "Olivia Specializes In Human Rights", "National Security Challenges In Asia."], "top_image": "https://www.heritage.org/sites/default/files/styles/facebook_optimized/public/images/2019-10/GettyImages-1153801501.jpg?itok=dCgj0Iwo", "published_at": "2019-10-10"}