{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7609423/More-HALF-GPs-think-ten-minute-appointments-short.html", "downloaded_at": "2019-10-26 00:29:58.965656+00:00", "title": "More than HALF of GPs think ten-minute appointments are too short", "language": "en", "text": "More than half of GPs say patients are put in danger because ten-minute appointments are too short.\n\nA survey of 1,500 family doctors revealed that the majority do not think they have enough time to properly assess patients.\n\nIt prompted the head of the Royal College of GPs (RCGP) to warn that the entire profession could 'crumble'.\n\nSome 53 per cent said patient safety is compromised because consultations are too short, and 60 per cent said ten minutes is not long enough to diagnoses patients.\n\nFamily doctors are campaigning for standard appointments to be 15 minutes long.\n\nA survey of 1,500 family doctors revealed that the majority do not think they have enough time to properly assess patients\n\nThe survey also found that almost one third of doctors plan to quit the profession within five years amid an 'unmanageable' workload caused by staff shortages and a growing and aging population.\n\nProfessor Helen Stokes-Lampard, chairman of the RCGP, said that many doctors were working 'unsafe hours' and that it was taking a toll on their health.\n\nIn a speech at the RCGP's annual conference at Liverpool yesterday, she said: 'Do not take us for granted.\n\n'Do not make any rash decisions about our service or introduce gimmicks that might be vote winners but would ultimately set back general practice 20 years.\n\nPeople in the UK get 9.2 minutes with their doctor on average, less than half as long as those in Sweden, the US and Bulgaria, according to research published in 2017\n\nHOW IS THE NHS TRYING TO HIRE MORE DOCTORS? Health service last year revealed it would offer doctors working in Australia an £18,500 bonus if they moved to the UK to work for the NHS. A recruitment campaign reportedly tried to persuade doctors to move to the land of Harry Potter, Manchester United and William Shakespeare.\n\nNHS set up a scheme to recruit 2,000 GPs from abroad by encouraging doctors in other countries to apply to work in the NHS. But only 34 were recruited between 2015 and February this year.\n\nTrainee GPs offered a £20,000 'golden hello' bonus if they take a job in hard-to-fill jobs. The young doctors must commit to work for at least three years in areas with notable shortages, including Hull, Plymouth, Lancaster and rural parts of County Durham and North Yorkshire.\n\nMatt Hancock suggested the tax-free pension ceiling could be lifted to try and persuade more existing GPs to work into their 60s. Currently doctors have to pay tax on any pension savings over £1m, but this amount could be increased.\n\n'History has taught us that access targets in general practice do not work. We must learn from those lessons, not repeat them.\n\n'We must first be offering what our patients need, not what politicians want. If unrealistic targets are imposed on our profession, it will crumble, and if general practice crumbles, patients won't be able to see a GP, at all.'\n\nProfessor Stokes-Lampard said Prime Minister Boris Johnson's pledge to tackle three-week waits 'must be done in the right way'.\n\nShe will say: 'We're making progress but we're not there yet. Our members are telling us they are more optimistic, but that the workload is still unmanageable.\n\n'That many GPs are working unsafe hours and it is taking its toll on their own health and wellbeing. That many are scared about the impact this is having on their patients.\n\n'Many GPs are still telling us that running a practice is unsustainable. That they are planning to hand back the keys, and that they plan to leave the profession sooner than they would have done.\n\n'Yes, more GPs are entering the profession, but still more are leaving it. Progress has simply not been made in building the GP workforce.\n\n'We have fewer full-time equivalent GPs than we did when the 5,000 pledge was initially made, and many of our patients are waiting longer for a GP appointment as a result.\n\nIn the three years since the Government pledged to hire 5,000 more GPs, the number of fully qualified doctors has dropped by around 1,000 (pictured) and the overall number of doctors is down by 148, according to figures in August\n\n'The Prime Minister Boris Johnson stood on the steps of Number 10 on his first day in office and pledged to tackle three-week waits to see a GP. We welcome that, but it must be done in the right way.'\n\nFamily doctors have been calling for standard GP consultations to be at least 15 minutes long within the next decade.\n\nThey also wants significant increases in GP numbers and greater investment in training, infrastructure and IT systems.\n\nProfessor Stokes-Lampard added: 'This is my call to politicians. Do not rest on your laurels. The nation worships the NHS and we have seen from the recent party conferences that all major political parties recognise this - and both our Health Secretary, and head of the NHS have repeatedly talked of general practice as its bedrock.\n\n'Trust us to be expert medical generalists and do what is best for our patients.'", "description": "The survey of 1,500 family doctors prompted the head of the Royal College of GPs (RCGP) to warn that the entire profession could 'crumble' at a conference in Liverpool.", "authors": ["Eleanor Hayward Health Reporter For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/13/13718120-0-image-a-30_1571920897965.jpg", "published_at": "2019-10-24"}