{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/of-course-the-mandalorian-is-interested-in-what-the-expanded-universe-could-add-back-to-star-wars-canon", "downloaded_at": "2019-09-13 11:22:58.425448+00:00", "title": "Of Course The Mandalorian Is Interested In What The Expanded Universe Could Add Back To Star Wars Canon", "language": "en", "text": "The Mandalorian could find himself facing some familiar concepts to fans of the old EU. (Image: Lucasfilm)\n\nEver since Disney and Lucasfilm rehauled the Star Wars canon in the wake of the former’s acquisition of the latter, the Expanded Universe, a vault of Star Wars storytelling for decades, was reclassified as mythological “legend,” non-canonical tales of a bygone age. But that doesn’t mean it’s gone for good, and the people behind The Mandalorian are more than aware of that.\n\nMuch hubbub has been made this week after Mandalorian showrunner and producer Jon Favreau told Entertainment Weekly that the team behind the show has “had conversations” about drawing upon elements from the old Expanded Universe to flesh out the world of the new series:\n\nI don’t want to talk about anything that might be fun for people to discover. We do have conversations. Part of what’s fun to see if we could merge the worlds of the original trilogy, the prequels, the sequels, The Clones Wars, and what’s been considered canon up to this point and what’s been considered part of Legends. I think this show offers an opportunity to bring in all those elements so no matter what your flavour of Star Wars ice cream you like there will be something to enjoy. But you’re asking the right questions.\n\nBut because Favreau said this in response to a question over whether or not Grand Admiral Thrawn — a character re-introduced into Star Wars canon through Star Wars Rebels, with an excellent series of novels from his original creator, Timothy Zahn, further fleshing him out — or Mara Jade — the former dark side agent of the Emperor who became Luke Skywalker’s wife in the old Expanded Universe — could appear on the show, there’s naturally been a lot of talk over whether or not these two characters could appear in The Mandalorian.\n\nWhich is silly because, thanks to how we know Star Wars Rebels ended, we already know Thrawn’s not actually around at the time The Mandalorian is set.\n\nUnless Pedro Pascal’s about to come toe-to-toe with some cosmic space whales. And Mara Jade? Well, maybe there could be a character in that vein — a former agent of the Empire that dabbled in dark force powers, now charting their own path in the wake of its demise — but it’s not going to be the Mara Jade, Jedi Master of the New Jedi Order, wife of Luke and mother of Ben that fans of the old EU know.\n\nIt’ll be something new, a twist on what came before. Because... that’s what the new Star Wars canon has been doing for years at this point.\n\nAnd we shouldn’t be surprised The Mandalorian is no exception, given that it’s also being produced by a man whose prior work is largely responsible for many of the old Expanded Universe elements that have made their way back into the current canon: Dave Filoni.\n\nFiloni was the showrunner on Clone Wars (which brought back so much, and even attempted to resurrect deep-cut concepts like the Yuuzahn Vong or Darth Revan) and Rebels (which, beyond the aforementioned revival of Thrawn, dabbled in elements from the beloved Knights of the Old Republic and the old legacies of Mandalorian culture, itself having been radically overhauled by Clone Wars), two sources that have been largely responsible for re-canonising elements of the Expanded Universe back into the current fold.\n\nPlaying with reworking these elements back into the Star Wars galaxy as we now understand it is a running theme throughout his work. So while it’s unlikely that Thrawn or Mara Jade specifically could show up on The Mandalorian, the fact that it’ll want to bring in elements of it isn’t surprising in the slightest.\n\nThe post-Return of the Jedi era of Star Wars is still a relatively blank canvas that The Mandalorian can and should play about in, and if part of that involves a few throwbacks from Star Wars’ prior legends, then that’s more than fine by us.\n\nThe Mandalorian begins on Disney+ when it launches in the U.S. on November 13, and will launch in Australia with Disney+ on November 19.", "description": "Ever since Disney and Lucasfilm rehauled the Star Wars canon in the wake of the former’s acquisition of the latter, the Expanded Universe, a vault of Star Wars storytelling for decades, was reclassified as mythological “legend,” non-canonical tales of a bygone age. But that doesn’t mean it’s gone for good,...", "authors": ["Andrew Liszewski", "Sarah Basford"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/jmuhzn1zpzpqlksm6jfb.jpg", "published_at": "2019-09-13"}