{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/wellness/why-are-to-do-lists-popping-up-on-instagram-and-making-us-feel-like-underachievers/2019/10/28/02871e5e-f43d-11e9-a285-882a8e386a96_story.html", "downloaded_at": "2019-10-30 11:07:13.206574+00:00", "title": "Why are to-do lists popping up on Instagram and making us feel like underachievers?", "language": "en", "text": "Perhaps this is just an inevitable stage for Instagram, where hundreds of thousands of followers can watch someone conduct their skin-care routine in the morning, pack for a trip in the afternoon and jet off on an all-expenses-paid vacation in the evening. Still, a to-do list that includes such prosaic entries as “check emails” and “drop packages at the post office” provides followers with a weirdly detailed sense of familiarity. Why are influencers doing it, and what does our reaction to the lists say about us?\n\n“I compare it to the ‘What’s in someone’s bag’ celebrity magazine features,” says Olivia Muenter, a 26-year-old Philadelphia-based influencer and writer who recently wrote about the public to-do list trend for Apartment Therapy. “They’re mundane things like ChapStick and tissues, but there’s something intimate about knowing these small details.”\n\nAD\n\nAD\n\nThere also can be something disturbing about the lists. The first time I landed on one, I felt a jolt of voyeuristic delight. After two lists, I began to wonder if I, too, had time to organize my desk or record a podcast that day. By the third list, the mythical American work ethic had tied a knot of capitalist dread in my stomach, and I was thinking, I should be working harder.\n\nI’m not alone. “My typical reaction to seeing these lists on Instagram is a feeling of failure,” says Daley Quinn, a 25-year-old writer in Boston. “Seeing other writers list the millions of deadlines they have that day makes me feel as though I’m not doing enough during my own workday.”\n\nThere are both cultural and psychological reasons behind such a reaction. “The deeper into voyeurism you go, the harder it becomes not to compare yourself, and comparison is the heart of unhappiness,” says Megan Costello, a licensed marriage and family therapist in Los Angeles who sees both pros and cons — but mostly cons — in reading other people’s to-do lists. “The fantasy is that if you work hard enough, you will find fulfillment. Even with good intentions, it’s a fetishization of work and consumerism.”\n\nAD\n\nAD\n\nTo find out the intentions behind the lists, I spoke to three influencers, each of whom offered practical reasons for making her daily to-do list public via Instagram Stories (I’ve only encountered women posting them). “I create lists every single day. It was just a matter of time before they made it to my Instagram,” says Rebecca Norris, a 27-year-old writer in New York City. When she became a full-time freelancer in March, friends and family had trouble understanding her new employment status. “I wanted to share what my job entails, how every day is different, and how it’s never boring.”\n\nThe lists also serve as a bulwark against the popular cultural assumption that millennials and Generation Xers — who dominate the influencer game — are slackers. “I have a job that’s treated as a joke,” says Grace Atwood, a 38-year-old influencer, blogger and podcast host with 125,000 followers. “In some circles, people think all I’m doing is drinking iced coffee and photographing my outfit. It couldn’t be farther from the truth. I’m on calls, I’m doing invoicing, I’m talking to lawyers, I’m signing contracts.”\n\nListing those chores, Atwood believes, brings her closer to her followers. “I get a lot of cool perks and free things, but mostly I’m just like my readers,” she says. “I’m at my desk most of the day, slogging away trying to get through my inbox. I want my to-dos to make me less aspirational and more relatable.”\n\nAD\n\nAD\n\nShe and the other influencers also credit the public to-do lists with helping them get things done. When you’ve told thousands of people that you plan to write a week’s worth of blog posts, you create the expectation for a week’s worth of blog posts. These influencers welcome that extra layer of accountability, though they want to make it clear that productivity isn’t the organizing principle of their lives.\n\n“I don’t want to glorify productivity as my life’s goal, because it’s not — at least not anymore,” Muenter says. Self-care even has a home on some lists: One influencer I’ve come across checks off her daily water intake in her chore notebook, while another writes a gratitude list every morning. (Yes, her to-do list includes writing another list.)\n\nOf course, while the posters don’t intend to make anyone anxious or unproductive, followers still might wind up feeling anxious and unproductive. But how followers react to these lists may have less to do with the lists themselves, Costello says, and more to do with the mental state they’re in when they tap their way onto Instagram.\n\nAD\n\nAD\n\n“Somebody might think ‘I struggle with looking at my bank balance.’ And seeing that an influencer had that same problem and decided to make it the first thing they do every morning, and that works for them, could be very inspiring,” she says. “Seeing how someone else is spending their day brings up a lot of feelings. It’s really meaty. In therapy, we’d say, ‘There’s a lot to take apart here.’ ”\n\nSo, what should you do if a list makes you feel unaccomplished rather than inspired? When Costello’s clients compare themselves with social media personalities, she reminds them to consider the context of the posts. “It’s helpful to think of all the content influencers are putting out as being specifically designed to sell you something,” she says. “It’s your job to figure out what they’re trying to sell you, and whether or not you’re interested in buying.”\n\nMore from Lifestyle:\n\nAD", "description": "For their writers, the lists are a way to keep themselves accountable and connect with followers.", "authors": ["Leah Prinzivalli"], "top_image": "https://www.washingtonpost.com/resizer/UGK89BLu1Ui57wODBRZiQZpYZv0=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QIBYCTHXN4I6TMWSD434TWBNXM.jpg", "published_at": "2019-10-28"}