{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7626809/Whoopi-Goldberg-scolds-Meghan-McCain-View.html", "downloaded_at": "2019-10-30 00:15:35.827708+00:00", "title": "Whoopi Goldberg and Meghan McCain clash on The View", "language": "en", "text": "Whoopi Goldberg has scolded The View co-host Meghan McCain for 'talking over everyone' during a fiery rant about criticizing military veterans that quickly descended into chaos.\n\nThe View co-hosts started the show on Tuesday discussing how U.S. Army officer Lt. Col. Alexander Vindman agreed to testify during the impeachment inquiry about Trump's call with the Ukrainian president.\n\nThe heated discussion quickly erupted into a screaming match, mostly between McCain and Joy Behar, less than 15 minutes into the show.\n\nIt prompted Goldberg to abruptly end the segment and lecture her fellow co-hosts about having 'respect' for each other by not talking over people on the panel.\n\nWhoopi Goldberg has scolded The View co-host Meghan McCain for 'talking over everyone' during a fiery rant about criticizing military veterans that quickly descended into chaos\n\nGoldberg zeroed in on McCain who was trying to interject at that very moment.\n\n'When we talk to each other we exhibit respect,' Goldberg had said as she tried to diffuse the tension.\n\nMcCain had argued just moments earlier that their show was called The View, suggesting they should all be allowed to express their viewpoints and the debate should continue.\n\nThe issue that sparked the descent into chaos was Lt. Col. Vindman and his upcoming testimony.\n\nMcCain, the daughter of the late Senator John McCain, lashed out at those questioning Lt. Col. Vindman's loyalty to the U.S.\n\nShe specifically mentioned Fox News' Laura Ingraham who has claimed the Purple Heart recipient doesn't have any loyalty to America because he is testifying.\n\n'There is this trend in American politics where we are criticizing veterans,' she said.\n\nMcCain then brought Hillary Clinton into the argument and said the Democrat was spreading 'McCarthyism' when she said presidential candidate Tulsi Gabbard was a Russian asset.\n\nThe View co-hosts started the show on Tuesday discussing how U.S. Army officer Lt. Col. Alexander Vindman agreed to testify during the impeachment inquiry about Trump's call with the Ukrainian president\n\nThis prompted Behar to try and interject to clarify and fact check Clinton's comment.\n\n'Excuse me, I'm not finished,' McCain said.\n\nBehar hit back: 'I know you're not, but I had to correct you.'\n\nClinton had been quoted saying that Russia was grooming Gabbard for a presidential run.\n\nUsing Gabbard and Vindman as examples, McCain said: 'I don't understand how we can question people who have sacrificed and served in war in the American dialogue.\n\n'I didn't like when Laura Ingraham did it last night or when Hillary Clinton did it to Tulsi Gabbard.'\n\nMcCain then went on to say that veterans shouldn't have their loyalty questioned.\n\nBehar again interjected saying: 'Hold on a second, just because somebody served does not ipso facto make them above reproach'.\n\nThe issue that sparked the descent into chaos was Lt. Col. Vindman and his upcoming testimony. He is pictured above on Tuesday at the U.S. Capitol\n\nMcCain fired back: 'If you're putting your life on the line for freedom, the soldiers in this country and veterans get a pass from me'.\n\nWhen Abby Huntsman chimed in agreeing with McCain, Sunny Hostin interrupted by pointing out the existence of war criminals.\n\nGoldberg stepped in trying to restore order to the panel, saying: 'Everybody just take a breath because now it's becoming hard'.\n\nWhen McCain tried to keep speaking, Goldberg said: 'Hold on, let me finish what I'm saying so I can just say everybody has something to say at the table. We really do want to hear from everybody, but we're starting to do that thing'.\n\nMcCain shot back: 'I don't know what that means, 'that thing'... it's The View'.\n\n'It is The View. You know what, let me tell you something about The View. This show has always had the ability to have different points of view which we respect around the table, and when we talk to each other we also exhibit respect.\n\n'So when I'm saying to you, 'hold up,' because we're not hearing each other, I'm not trying to cut you off. I'm trying to get you heard,' Goldberg responded.", "description": "The View co-hosts started the show Tuesday discussing how U.S. Army officer Lt. Col. Alexander Vindman agreed to testify about Trump's call with the Ukrainian president.", "authors": ["Emily Crane For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/17/20339858-0-image-a-71_1572371096708.jpg", "published_at": "2019-10-29"}