{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/3/ravens-steelers-preview-capsule", "downloaded_at": "2019-10-03 23:28:32.445804+00:00", "published_at": "2019-10-03", "title": "Ravens-Steelers Preview Capsule", "language": "en", "text": "BALTIMORE (2-2) at PITTSBURGH (1-3)\n\nSunday, 1 p.m. ET, CBS\n\nOPENING LINE - Ravens by 3½\n\nRECORD VS. SPREAD - Ravens 2-2; Steelers 2-2\n\nSERIES RECORD - Steelers lead 28-22.\n\nLAST MEETING - Steelers beat Ravens 23-16 on Nov. 4, 2018.\n\nLAST WEEK - Ravens lost to Browns 40-25; Steelers beat Bengals 27-3\n\nAP PRO32 RANKING - Ravens No. 13, Steelers No. 25\n\nRAVENS OFFENSE - OVERALL (1), RUSH (1), PASS (6).\n\nRAVENS DEFENSE - OVERALL (27), RUSH (10), PASS (30).\n\nSTEELERS OFFENSE - OVERALL (29), RUSH (29), PASS (23).\n\nSTEELERS DEFENSE - OVERALL (19), RUSH (22), PASS (19).\n\nSTREAKS, STATS AND NOTES - Ravens have dropped 2 straight after 0-2 start. … Steelers avoided second 0-4 start in 51 years by drilling Bengals. … Pittsburgh 4-1 in last 5 against Ravens. … First time since Dec. 30, 2007, rivalry does not feature Joe Flacco or Ben Roethlisberger. … Ravens QB Lamar Jackson’s 993 yards rushing since start of 2018 tops among QBs. … Baltimore RB Mark Ingram over 100 yards rushing in last 2 road games. … Ravens rookie WR Marquise Brown is cousin of former Steelers WR Antonio Brown. … Baltimore CB Marlon Humphrey with pick in 2 of last 3 road games. … Ravens LB Matt Judon sack in 3 of last 4 games. … Baltimore TE Mark Andrews’ 3 TD receptions second among tight ends. … Steelers 36-28 all-time week after appearing on Monday Night Football. … Pittsburgh second in NFL in takeaways (9), tied for fourth in sacks (14). … Steelers QB Mason Rudolph first win as starter vs. Bengals. Rudolph completed 24 of 28 for 229 yards, 2 TDs. … Pittsburgh RB James Conner with 125 total yards vs. Bengals. … RB Jaylen Samuels with 114 all-purpose yards, TD against Cincinnati. … Samuels 3 for 3 passing, first non-QB Steelers player with multiple pass completions in game since WR Antwaan Randle El in 2005. … Pittsburgh DT Cam Heyward with 2.5 sacks vs. Cincinnati. Heyward now with 47.5 sacks all-time, ninth in franchise history. … Steelers K Chris Boswell 7 for 7 on FGs. Boswell made just 13 of 20 FGs in 2018. … Pittsburgh TE Nick Vannett with 2 receptions for 28 yards against Bengals less than week after trade from Seattle. … Steelers DB Joe Haden’s 122 career passes defensed most in NFL since 2010. … Fantasy Tip: Jackson. The Steelers have had issues with dual-threat QBs in the past. Seattle’s Russell Wilson used legs late in Week 2 to secure Seahawks’ victory. Jackson will be problem for Pittsburgh’s pass rush.\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "BALTIMORE (2-2) at PITTSBURGH (1-3)", "authors": ["The Washington Times Http", "The Associated Press"], "top_image": ""}