{"pub": "cnbc", "url": "https://cnbc.com/2019/10/30/stocks-making-the-biggest-moves-midday-ge-mattel-yum-brands-more.html", "downloaded_at": "2019-10-30 23:16:33.621387+00:00", "title": "Stocks making the biggest moves midday: General Electric, Mattel, Yum Brands & more", "language": "en", "text": "Check out the companies making headlines in midday trading.\n\nGeneral Electric — Shares of GE rose more than 11% after the embattled industrial conglomerate reported third-quarter results that beat Wall Street's top and bottom line expectations. GE raised its 2019 cash flow forecast, as CEO Larry Culp said the company's \"results reflect another quarter of progress in the transformation of GE.\"\n\nMattel — Shares of the toy maker surged 13.8% following third-quarter earnings. The company beat top and bottom line estimates, driven by growth in Barbie and BTS K-pop toy sales. The company also announced that the CFO would resign following an investigation into accounting error claims.\n\nYum Brands — Shares of the Taco Bell and Pizza Hut parent plunged 5.8% on the back of disappointing quarterly results. Yum Brands posted adjusted earnings per share of 80 cents on revenue of $1.339 billion. Analysts polled by Refinitiv expected an adjusted profit of 94 cents a shares on sales of $1.344 billion. The company pointed to its investment in food-delivery service GrubHub as a source of pressure on profits.\n\nJohnson & Johnson — Shares of Johnson & Johnson rose 2.9% after the multinational pharmaceutical manufacturer said its testing found no asbestos in its Johnson's Baby Powder. The company pulled the powder off of shelves after federal regulators said they found trace amounts of asbestos, a known carcinogen, in a bottle purchased online.\n\nCentene, WellCare Health Plans — Shares of Centene soared 8.3% after a company it is buying, managed care company WellCare Health Plans, posted better-than-expected quarterly earnings. WellCare earned $5.5 per share in the the third quarter, far better than the $3.86 per share analysts were expecting, according to FactSet. Shares of WellCare climbed 5%.\n\nEdison International — Shares of Edison International dropped nearly 5% about the public utility company reported worse-than-expected third-quarter earnings. Edison earned $1.50 per share, while Wall Street analysts were expecting earnings of $1.58 per share, according to Refinitiv. The company modestly raises its full-year earnings outlook, despite the weak results.\n\nTupperware — Shares of Tupperware tanked more than 34% after the housewares maker posted disappointing quarterly earnings. Tupperware earned an adjusted 43 cents per share, well short of the 62 cent consensus estimate. The company said it was experiencing challenging trends in markets like the U.S., China, Canada, and Brazil. The company also cut its full-year earnings outlook.\n\nCrocs — Shares of Crocs jumped 15.6% after the footwear company reported stronger-than-expected earnings. Crocs earned 57 cents in the third quarter, beating the consensus estimate of 39 cents. Its revenue also topped analysts' expectations, according to FactSet.\n\nNetflix — Shares of Netflix gained 3.6% as investors digest the latest streaming service launch from WarnerMedia. HBO Max streaming service will launch in the U.S. in May of 2020, and cost $14.99 a month, WarnerMedia announced Tuesday. It's pricier than Netflix's most popular tier of service which comes at $12.99 a month.\n\n— CNBC's Michael Sheetz, Maggie Fitzgerald, Pippa Stevens and Fred Imbert contributed reporting.", "description": "Check out the companies making headlines in midday trading.", "authors": ["Yun Li"], "top_image": "https://image.cnbcfm.com/api/v1/image/105796032-1552649502156img_7688r.jpg?v=1566228123", "published_at": "2019-10-30"}