{"pub": "fox", "url": "https://foxnews.com/politics/john-durham-investigation-possible-fbi-misconduct-expanded-new-evidence-sources", "downloaded_at": "2019-10-23 08:46:19.568469+00:00", "title": "Durham's probe into possible FBI misconduct expanded based on new evidence, sources say", "language": "en", "text": "U.S. Attorney John Durham's investigation into the origins of the FBI's 2016 Russia probe has expanded based on new evidence uncovered during a recent trip to Rome with Attorney General Bill Barr, sources told Fox News on Tuesday.\n\nThe sources said Durham was \"very interested\" to question former Director of National Intelligence James Clapper and former CIA Director John Brennan, an anti-Trump critic who recently dismissed the idea.\n\nThe two Obama administration officials were at the helm when the unverified and largely discredited Steele dossier, written by British ex-spy Christopher Steele and funded by the Hillary Clinton campaign and Democratic National Committee, was used to justify a secret surveillance warrant against former Trump adviser Carter Page.\n\nIn Italy, Barr reportedly told embassy officials he \"needed a conference room to meet high-level Italian security agents where he could be sure no one was listening in.\"\n\nA source in the Italian Ministry of Justice told The Daily Beast earlier this month that Barr and Durham were played a taped deposition made by Joseph Mifsud, the professor who allegedly told ex-Trump aide George Papadopoulos that the Russians had \"dirt\" on Hillary Clinton. Mifsud reportedly was explaining to authorities in the deposition why people would want to harm him, and why he needed police protection.\n\nPapadopoulos has suggested he was connected with Mifsud as part of a setup orchestrated by intelligence agencies.\n\nPresident Trump last month informed several countries that Barr would be contacting the appropriate law enforcement entities in each country, according to a DOJ official. When Barr was in Italy that month, he spoke to law enforcement officials there about Durham's review, the source told Fox News.\n\nAdditionally, documents obtained by Fox News confirmed that Australia proactively offered support for Barr's review, and seemingly contradicted reporting that Trump was pressuring other countries to assist.\n\nDISPUTE ERUPTS AS BRENNAN, COMEY APPEAR TO DISPUTE WHO PUSHED THE STEELE DOSSIER\n\nSeparately, Fox News on Tuesday reviewed email correspondence showing that one of then-candidate Trump's advisers recently was notified by an email service provider that the provider had received a legal demand for data associated with the user's email account -- and that the request was \"served by the Federal Bureau of Investigation.\"\n\nThe email service provider complied with the FBI request in mid-2017 for a period of time, and eventually notified the email user that the FBI’s \"non-disclosure prohibition has expired.\"\n\nThe non-disclosure prohibition meant the email provider could not tell the account holder about the FBI data request until a set period of time has passed.\n\nThe account holder told Fox News the notice confirmed earlier suspicions that the bureau sought and obtained email communications, and given the mid-2017 timing, suggested the move was part of the Mueller investigation. The account holder said the communications contained campaign-related activities.\n\nFORMER TRUMP AIDE HEADS TO GREECE TO RETRIEVE $10G PAYMENT IN A SAFE, SAYS IT WAS INTENDED BY FEDS TO 'ENTRAP' HIM\n\nThe developments come as DOJ Inspector General Michael Horowitz's report into possible federal misconduct is expected to be released shortly.\n\nAlthough Durham, the U.S. attorney from Connecticut, initially was appointed to review the events leading up to the 2016 presidential election and through Trump’s January 2017 inauguration, Fox News has reported that he later broadened his investigation to cover a post-election timeline extending through the spring of 2017—when Robert Mueller was appointed as special counsel.\n\n\"If the rumors are true that IG Horowitz’s report and findings in Durham’s review will blast the conduct of the FBI’s Russia investigation, it will give Trump a lot of ammo to support his argument that he was unjustly targeted then and is being unjustly targeted now,\" a House GOP source told Fox News on Tuesday. \"It will justify Trump’s warnings about the Deep State acting to hobble his presidency.\"", "description": "Fox News has confirmed that U.S. Attorney John Durham's investigations into the origins of the FBI's 2016 Russia investigation expanded based on new evidence uncovered during a recent trip to Rome with Attorney General Bill Barr.", "authors": ["Gregg Re", "Gregg Re Is A Lawyer", "Editor Based In Los Angeles. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Brennan-Trump_Reuters_AP.jpg", "published_at": "2019-10-23"}