{"pub": "businessinsider", "url": "https://businessinsider.com/odessa-shooting-gunman-seth-ator-purchased-rifle-at-private-sale-2019-9", "downloaded_at": "2019-09-04 00:40:18.701626+00:00", "title": "The gunman in the west Texas rampage that left 7 dead evaded a background check by buying his AR-style rifle at a private sale", "language": "en", "published_at": "2019-09-03", "text": "ODESSA, Texas (AP) — The gunman in a West Texas rampage that left seven dead obtained his AR-style rifle through a private sale, allowing him to evade a federal background check that previously blocked him from getting a gun, a law enforcement official told The Associated Press.\n\nThe official spoke to The Associated Press Tuesday on condition of anonymity because the person was not authorized to discuss an ongoing investigation.\n\nOfficers killed 36-year-old Seth Aaron Ator on Saturday outside a busy Odessa movie theater after a spate of violence that spanned 10 miles, injuring around two dozen people in addition to the dead.\n\nSeth Ator. City of Odessa/FBI via AP\n\nAuthorities said Ator \"was on a long spiral of going down\" and had been fired from his oil services job the morning of the shooting, and that he called 911 both before and after the rampage began.\n\nSeth Astor had previously failed a federal background check for a firearm\n\nAtor had previously failed a federal background check for a firearm, said John Wester, an agent with the federal Bureau of Alcohol, Tobacco and Firearms. Wester did not say when Ator failed the background check or why.\n\nOnline court records show Ator was arrested in 2001 for a misdemeanor offense that would not have prevented him from legally purchasing firearms in Texas.\n\nFederal law defines nine categories that would legally prevent a person from owning a gun, which include being convicted of a felony, a misdemeanor domestic violence charge, being adjudicated as a \"mental defect\" or committed to a mental institution, the subject of a restraining order or having an active warrant. Authorities have said Ator had no active warrants at the time of the shooting.\n\nAtor called the FBI and local police before the shooting rampage\n\nFBI special agent Christopher Combs said Monday that Ator called the agency's tip line as well as local police dispatch on Saturday after being fired from Journey Oilfield Services, making \"rambling statements about some of the atrocities that he felt that he had gone through.\"\n\n\"He was on a long spiral of going down,\" Combs said. \"He didn't wake up Saturday morning and walk into his company and then it happened. He went to that company in trouble.\"\n\nFifteen minutes after the call to the FBI, Combs said, a Texas state trooper unaware of the calls to authorities tried pulling over Ator for failing to signal a lane change. That was when Ator pointed an AR-style rifle toward the rear window of his car and fired on the trooper, starting a terrifying police chase as Ator sprayed bullets into passing cars, shopping plazas and killed a U.S. Postal Service employee while hijacking her mail truck.\n\nCombs said Ator \"showed up to work enraged\" but did not point to any specific source of his anger. Ator's home on the outskirts of Odessa was a corrugated metal shack along a dirt road surrounded by trailers, mobile homes and oil pump jacks. On Monday, a green car without a rear windshield was parked out front, the entire residence cordoned off by police tape.\n\nCombs described it as a \"strange residence\" that reflected \"what his mental state was going into this.\" Combs said he did not know whether Ator had been diagnosed with any prior mental health problems.\n\nRead more: The Odessa shooter called 911 and the FBI minutes before going on a killing spree that left 7 people dead\n\nA neighbor called Ator a 'violent, aggressive person' that his family was afraid of\n\nA neighbor, Rocio Gutierrez, told The Associated Press that Ator was \"a violent, aggressive person\" that would shoot at animals, mostly rabbits, at all hours of the night\n\n\"We were afraid of him because you could tell what kind of person he was just by looking at him,\" Gutierrez said. \"He was not nice, he was not friendly, he was not polite.\"\n\nThe daylight attack over the Labor Day holiday weekend came just weeks after another mass shooting killed 22 people in the Texas border city of El Paso.\n\nTexas Gov. Greg Abbott tweeted Monday that \"we must keep guns out of criminals' hands\" — words similar to his remarks that followed the El Paso shooting on Aug. 3, when he said firearms must be kept from \"deranged killers.\" But Abbott, a Republican and avid gun rights supporter, has been noncommittal about tightening Texas gun laws.\n\nCrime scene tape surrounds the home of Seth Aaron Ator. AP Photo/Sue Ogrocki\n\nOdessa Police Chief Michael Gerke said Ator's company also called 911 on Saturday after Ator was fired but that Ator had already taken off by the time police showed up.\n\n\"Basically, they were complaining on each other because they had a disagreement over the firing,\" Gerke said.\n\nGerke said he believes Ator had also been recently fired from a different job but did not have any details.\n\nAuthorities said they remain unable to provide an exact timeline of the shooting, including how much time passed between the traffic stop at 3:13 p.m. and police killing Ator at the movie theater.\n\nPeople killed in the shooting ranged from 15 to 57\n\nOdessa officials Monday released the names of those killed, who were between 15 and 57 years old. Among the dead were Edwin Peregrino, 25, who ran out of his parents' home to see what the commotion was; mail carrier Mary Granados, 29, slain in her US Postal Service truck; and 15-year-old high school student Leilah Hernandez, who was walking out of an auto dealership.\n\nAtor fired at random as he drove in the area of Odessa and Midland, cities more than 300 miles (482 kilometers) west of Dallas. Police used a marked SUV to ram the mail truck outside the Cinergy Movie Theater in Odessa, disabling the vehicle. The gunman then fired at police, wounding two officers before he was killed.\n\nPolice said Ator's arrest in 2001 was in the county where Waco is located, hundreds of miles east of Odessa. Online court records show he was charged then with misdemeanor criminal trespass and evading arrest. He entered guilty pleas in a deferred prosecution agreement where the charge was waived after he served 24 months of probation, according to records.\n\nThe number of mass killings so far this year has already eclipsed the total for all of last year. A teenager suspected of killing five family members in Alabama brought the total to 26 mass killings in 2019, claiming the lives of 147 people, compared with 25 mass killings and 142 deaths in 2018, according to a database by The Associated Press, USA Today and Northeastern University. The database tracks homicides where four or more people are killed, not including the offender.", "description": "Seth Ator had previously failed a federal background check for a firearm, an agent with the federal Bureau of Alcohol, Tobacco and Firearms said.", "authors": ["Paul J. Weber", "Jake Bleiberg", "Michael Balsamo", "Associated Press"], "top_image": "https://amp.businessinsider.com/images/5d6edbc321214c4cbd44bf6d-2732-1366.jpg"}