{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/rally-guinea-capital-conde-3rd-term-bid-191024180335500.html", "downloaded_at": "2019-10-24 23:50:19.463118+00:00", "title": "New rally in Guinea capital against Conde's possible 3rd term bid", "language": "en", "text": "Large crowds of demonstrators have taken to the streets of Guinea's capital, Conakry, to protest against a potential constitutional change that could let President Alpha Conde seek a third term.\n\nOrganisers said a million people took part in Thursday's march, while police put the number at 30,000, according to the AFP news agency. Local media said there were hundreds of thousands of people.\n\nMore:\n\nPolice mobilised in large numbers but the rally remained calm, unlike smaller protests last week in which several protesters were killed and hospitals were overwhelmed with scores of people wounded by gunshots. The opposition said 10 people died, while the authorities put the toll at eight, plus a gendarme.\n\nReacting to the jailing of a dozen opposition campaigners and politicians amid the unrest, protesters chanted \"Amoulanfe\" - \"It will not happen\" in the local Susu language - and \"Free the prisoners\" on their way to Conakry's largest stadium.\n\nL'hymne du @FNDC_Gn chanté par des milliers de Guinéens 🇬🇳 pour dire #AMOULANFÉ au 3ème mandat et au changement de Constitution ! Le peuple est descendu dans la rue par milliers pour s'opposer à l'imposture d'Alpha Condé et son clan ! #Kibaro #Guinée pic.twitter.com/WiU6Or0l6a — #Amoulanfé 🇬🇳 (@Amoulanfe2020) October 24, 2019\n\nTRANSLATION: \"The hymn of @FNDC_Gn sung by thousands of Guineans to say #AMOULANFE [It will not happen] the third term and the change of Constitution! The people descended on the streets in the thousands to oppose the imposter Alpha Conde and his clan! #Kibaro #Guinea.\"\n\n\"We are tired of the lies, the false promises, and above all the fact that he (Conde) is no longer capable of meeting the expectations of the people. Ten years in power is long enough,\" Souleymane Kamagathe, a baker, told AFP.\n\nConde's mandate expires in December 2020, at which point he will have completed two successive five-year terms - the maximum allowed by Guinea's laws.\n\nBut the 81-year-old has refused to rule out running again and asked his government last month to look into drafting a new constitution.\n\nConde came to power in 2010 after two years of military rule in Guinea [File: Benoit Tessier/Reuters]\n\nHis opponents fear that could be used as a reset button on his presidency, which at its outset coincided with the country's first democratic transition of power since independence from France in 1958.\n\n\"Alpha Conde also wants to change the constitution to stay in power until his death. It will not work,\" artist Kefine Konate told The Associated Press news agency.\n\nProtests were also held on Thursday in the towns of Labe, Mamou and Pita, in central Guinea, where government authorities accused demonstrators of throwing stones at a police station.\n\nThe National Front for the Defence of the Constitution (FNDC), the protests' organisers, called for a fresh demonstration next Wednesday.\n\n'Give way to a new president'\n\nConde's first election victory in 2010 raised hopes for democratic progress in Guinea after two years of military rule and nearly a quarter of a century under authoritarian President Lansana Conte, who died in 2008.\n\nBut his critics accuse him of cracking down on dissent and violently repressing protests - charges he denies.\n\n190901192449519\n\n\"We want him [Conde] to free the jailed leaders before any negotiation happens. Then Alpha needs to say he will not be a candidate,\" Algassimou Diallo, who marched in Conakry wearing the rally's official red colour, told Reuters News Agency.\n\nOn Tuesday, 12 FNDC leaders were sentenced to up to a year in prison for organising previous rallies, prompting condemnation by human rights groups.\n\n\"Guinea's government simply should not be denying people their right to express opposition to a new constitution,\" Corinne Dufka, West Africa director for Human Rights Watch, said in a statement last week.\n\n\"A blanket protest ban, the arbitrary arrest of civil society leaders, and the violent dispersal of demonstrators shows that the government is prepared to trample on human rights to suppress dissent.\"", "description": "Mass protest in Conakry remains calm, unlike smaller demonstrations last week in which at least nine people were killed.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/24/9e5e5e7b0110460daee5e94f814dbac2_18.jpg", "published_at": "2019-10-24"}