{"pub": "cbs", "url": "https://cbsnews.com/news/amazon-rainforest-fire-tribe-warns-future-of-rainforest-could-be-in-jeopardy-2019-08-27", "downloaded_at": "2019-09-16 23:14:41.644965+00:00", "title": "Amazon tribe warns future of the rainforest could be in jeopardy as fires burn", "language": "en", "text": "Rio Branco, Brazil — In a major reversal, Brazil's president said his country is open to accepting millions of dollars in international wildfire aid. He initially demanded an apology for criticism of his handling of the fires in the Amazon.\n\nWhile humans are largely to blame for the destruction of the rainforest, it's humans who have managed to maintain the healthiest parts, too. People like the Yawanawa, whose Chief Tashka Yawanawa spoke with CBS News. He said the dry season has been particularly bad, a result of the kind of deforestation that has threatened the centuries-old Yawanawa way of life.\n\n\n\n\"Each one of us needs to be responsible economically, environmentally, culturally because otherwise the humanity is just gonna disappear like dinosaurs,\" he said.\n\nIndigenous leader in Brazil says they're facing \"genocide\" in Amazon rainforest\n\nBut Brazil is at a crossroads. After working to curb deforestation, it is again on the rise. Not a coincidence, say critics of President Jair Bolsonaro, who promotes open development.\n\nScientists Foster Brown, who has worked in northwest Brazil for 30 years, said regeneration of parts of the Amazon that have been eaten away over the decades is possible. But so is losing the Amazon altogether.\n\n\"If we continue in a certain trend we're doing, it wouldn't take very long,\" he said, adding that it could be within \"decades.\"", "description": "While humans are largely to blame for the destruction of the rainforest, some have managed to maintain it", "authors": ["Manuel Bojorquez"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/08/27/486eddef-bebe-4b97-96c5-495ccd9ab4e8/thumbnail/1200x630/be4e8c5abf88e07a8726dd7d1517060c/amazon-gettyimages-1163390696.jpg", "published_at": "2019-08-27"}