{"pub": "yahoo", "url": "https://news.yahoo.com/things-have-just-gotten-so-bad-why-teachers-in-america-are-leaving-the-classroom-for-good-133358169.html", "downloaded_at": "2019-09-24 15:21:45.304921+00:00", "title": "'Things have just gotten so bad': Why teachers in America are leaving the classroom for good", "language": "en", "text": "A Yahoo Lifestyle survey of more than 50 teachers has shed light on systemic problems in the public school system. \"Things have just gotten so bad,\" says Rachel Bardes, a former Spanish teacher in Texas. (Photo Illustration: Quinn Lemmers, Yahoo Lifestyle)\n\nThe word “teacher,” for many, has long been synonymous with “hero.”\n\nOn social media, political stages and news sites, teachers are hailed as indefatigable public servants, selflessly working to shape the next generation of Americans. It’s a reputation they’ve undoubtedly earned, aided in part by how many roles (therapist, parent, first responder) they’re often forced to take on.\n\nOf course, there are bad teachers; but the good ones are ubiquitous. Educators who give everything they have and then give more: donating kidneys, fostering their own students and literally taking bullets to tackle school shooters. Still, accurate as this heroic depiction may be, many feel it’s been misused in recent years to excuse undervaluing and mistreating educators across the country.\n\nBecause teachers, perhaps more than ever, know what they’re worth. And they’re fed up with others not acknowledging it too. “A lot of my colleagues are feeling overwhelmed by the burden that teaching has become,” Rachel Bardes, a former Spanish teacher in Florida, tells Yahoo Lifestyle. “Things have just gotten so bad.”\n\nTeachers — as Bardes and more than 50 others shared in an exclusive Yahoo Lifestyle survey — are sick of budget cuts, classroom violence and salaries so low they need two extra jobs. They’re tired of standardized tests that stifle their creativity and a job that demands their every waking moment — even when they’re ill. As Sariah McCall, a teacher whose resignation letter went viral in April, wrote, “It is unrealistic to expect this much of people. We’re teachers, but we’re still people.”\n\nOf the dozens of teachers who spoke with Yahoo Lifestyle, many said that the conditions they’ve endured are fuel to fight for better ones — a trend reflected in the historic statewide walkouts beginning in West Virginia this past February (and rippling to five other states since). But for an increasing number of educators— whether due to family, personal well-being or other factors — it’s all simply too much to bear.\n\nAccording to a Labor Department report (obtained by the Wall Street Journal), teachers quit the profession in 2018 at the highest rate of any year on record. Roughly 1 million public education workers walked away that year, and experts predict those numbers will only get worse. The result is shortages of teachers in multiple states and a dropping number of education majors nationwide.\n\nTo explore this national crisis, Yahoo Lifestyle conducted a survey aimed at teachers who made the decision — most, in 2019 — to leave the classroom for good. More than 50 former K-12 public school teachers from over 20 states participated, sharing intimate details of ending a career that many imagined would last a lifetime.\n\nAccording to a report from the U.S. Department of Labor, teachers left the profession in 2018 in numbers never seen before. (Photo Illustration: Quinn Lemmers, Yahoo Lifestyle) More\n\n“I’m very surprised that I am out of teaching,” says Charlie Cuddy, a former math teacher in Omaha, Neb., who now works as a software developer. “My mom always jokes with me that once I realized [being] in the NFL wasn’t a realistic opportunity, teaching was what I wanted to do — just, from as long as I can remember.”\n\nCuddy, whose dad has been a teacher for 40 years (and describes teaching now versus when he started as “night and day”), spent nine years as an educator. He, like many, was motivated to leave in order to have time to be with his kids. Others shared reasons like financial instability or budget cuts, but none seemed immune to the physical and mental toll taken by one of the most stressful jobs in America.", "description": "More teachers left the profession in 2018 than any other year on record. Yahoo Lifestyle spoke with over 50 teachers about what led them to abandon a job that many believed would last a lifetime.", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/Lym8Ni9JK5oY.HnuzK28dg--~B/aD03NTY7dz0xNDA0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/8a608fd0-dae9-11e9-bf3d-05f5d16b44f0", "published_at": "2019-09-24"}