{"pub": "fox", "url": "https://foxnews.com/entertainment/carols-second-act-ashley-tisdale-meditation-emotional-scenes", "downloaded_at": "2019-10-10 02:46:24.711190+00:00", "title": "‘Carol’s Second Act’ star Ashley Tisdale says meditation helps her prepare for emotional scenes", "language": "en", "text": "'Tis the season of Tisdale.\n\nFormer Disney standout Ashley Tisdale has long been outspoken about suffering from anxiety and depression.\n\nNow the 34-year-old actress, singer and producer says she’s in a “good headspace” since releasing “Symptoms” in May, her first studio music album in 10 years. She is also wrapping up filming on a forthcoming Netflix series and stars in the CBS comedy sitcom “Carol’s Second Act,” alongside Patricia Heaton\n\nTisdale spoke with reporters at the Television Critics Association’s summer press day at the famed Beverly Hilton Hotel about bonding with her mother figure Heaton on the show and how she’s been able to keep her emotions in the fairway through acting and music.\n\n'THE MIDDLE' STAR PATRICIA HEATON SAYS 'CAROL'S SECOND' ACT' CAME AT PERFECT TIME: 'I WAS FEELING A BIT AT SEA'\n\n“I mean, I think for me it's just always about the show and the characters. I just did a Netflix series with Dennis Quaid 'Merry Happy Whatever,' which has been so much fun and I'm just acting in that as well and I just really love the character,” Tisdale told reporters about being excited to simply be an actor as opposed to producing and directing as she has on projects in the past.\n\n“And then when I heard about this opportunity like I said I've been such a huge fan of Patti [Heaton] – she's such a legend and I'm so excited to work with her. Also, it’s a sitcom and it's just gonna be so fun to be in front of a live audience again.”\n\nTisdale, a rising Hollywood staple since her days as Maddie Fitzpatrick on “The Suite Life of Zac & Cody” and Sharpay on “High School Musical,” said she was especially excited for her new roles because it’s the first and second time she has had the chance to play a character who is her own age — a rarity for young performers in show business.\n\nASHLEY TISDALE ACCUSES KEVIN SMITH OF HITTING HER CAR\n\n“That's very different too,” the “Guilty Pleasure” songstress said about her role in the Dennis Quaid-produced holiday series – which is slated to begin streaming on Netflix in November – when asked how similar it was to her past performances.\n\n\"It's really nice to be able to be in a ... kind of a mature role, where I get to be my age and that character is very different from this character,” she said.\n\n“That's what acting is all about,” she added. “It's just like playing all these kind of characters and bringing them to life.”\n\nTisdale was happy to discuss her newfound relationship with acting legend Patricia Heaton, who plays Tisdale’s mother on the series, telling reporters the two wasted no time establishing their mother-daughter dynamic and bonded over their love of sweat equity.\n\nACTRESS ASHLEY TISDALE SELLING CAPE COD IN STUDIO CITY FOR $2.66M\n\nThe Emmy-nominated actress said she had never met Heaton before landing the gig and reckons her and connection to Heaton might have aided in helping her solidify the job.\n\n“When we met it was so funny because we just clicked and we had all these stories,” Tisdale explained. “We're talking about, you know – I love to renovate my homes and she renovates her homes and so we just bonded and I think obviously that's what got me the job,” she said in amusement.\n\n“But yeah, even listening to her now — we have so much in common and it's such a dream to play her daughter.”\n\nListening to the lively Tisdale, one would get the sense she is one of the hardest working performers in the business. When asked how she manages to balance the copious commitments she has on her plate, the Broadway actress credits taking care of thy self.\n\nASHLEY TISDALE'S NSFW ROLE AS A SEX WORKER IN 'AMATEUR NIGHT'\n\n“I mean, I love to read anything from just stuff that helps with anxiety and stuff that you would get to learn about yourself and grow,\" she said. \"I think we need to challenge ourselves as people.”\n\nTisdale said she is also a \"big fan\" of meditation.\n\n“There are great meditation apps that are super easy even when I'm at work. If I have an emotional scene like I just did in the Netflix show — you know, it's like doing meditation helps you become super present in the moment and then you're able to be so connected in the scene.”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“And I think it's such a great tool just in life. So yeah, I feel like headspace is great. But yeah, I just try to do like you know – self-care is so important even if you love to work nonstop, it's important to take that time. I went from the Netflix show to Montreal to shoot something and back here, so I'm going to take a good four days off before we start the show.”\n\n“Carol’s Second Act” airs Thursdays at 10:30 p.m. EST on CBS.", "description": "'Tis the season of Tisdale.", "authors": ["Julius Young", "Julius Is An La Entertainment Reporter For Fox News."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/12/1d23f4ed-ashley-tisdale-with-makeup.jpg", "published_at": "2019-10-09"}