{"pub": "metro", "url": "https://metro.co.uk/2019/10/29/miley-cyrus-boyfriend-cody-simpson-perfectly-sync-tiktok-dance-routine-11002361", "downloaded_at": "2019-10-29 14:10:32.386287+00:00", "title": "Miley Cyrus and boyfriend Cody Simpson perfectly in sync for TikTok dance routine", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nMiley Cyrus and Cody Simpson proved they are just like us as they spent their evening perfecting a synchronised dance routine.\n\nAnd we’re slightly obsessed.\n\nTaking to TikTok, the We Can’t Stop singer shared a very brief clip of herself and her new 22-year-old boyfriend as they messed around in front of the camera in the bathroom, dancing to STUPID by Ashnikko featuring Yung Baby Tate.\n\nSide note: A total banger.\n\nThe 26-year-old rocked a black bra and shorts as she jumped up and down while waving her arms, still managing to look pretty damn cool.\n\nAdvertisement\n\nAdvertisement\n\nWhile the La Da Dee singer opted for a black Harley Davidson t-shirt and shorts for the video.\n\nMiley Cyrus and Cody Simpson showed off their dancing talent on TikTok (Picture: TikTok)\n\nThey were perfectly in sync in the clip (Picture: TikTok)\n\nThey were perfectly in sync for the routine, putting our playground dances to absolute shame.\n\nMody (or Ciley?) have barely been apart since they went public with their relationship at the beginning of the month.\n\nIn fact, just hours before they blessed us all with the clip, the lovebirds were spotted out in LA, enjoying a casual lunch.\n\nThe pair started dating earlier this month (Picture: Backgrid)\n\nMiley recently split with Liam Hemsworth (Picture: Backgrid)\n\nMiley recently confirmed her split from husband Liam Hemsworth after a 10-year on-off relationship.\n\nVery shortly after their brief marriage came to an end, the Don’t Call Me Angel singer made headlines after she was spotted kissing Kaitlynn Carter, on a trip to Italy.\n\nAnd an insider has now claimed the Hunger Games actor’s mum is ‘relieved’ their romance has come to an end.\n\nMiley and Liam got married back in December (Picture: Rex)\n\n‘Liam really felt he needed his family after the break-up,’ a source told HollywoodLife. ‘They are very, very close.\n\n‘His mum is feeling so relieved that Liam made the decision to end the relationship as his entire family, but her especially, always struggled approving Miley.\n\nAdvertisement\n\nAdvertisement\n\n‘[Liam] really struggled with the break-up and is going to be cautious and slow heading into the next relationship.’\n\nMaybe not that ‘cautious and slow’ as he was recently seen passionately kissing rumoured new girlfriend Maddison Brown on a night out in New York…\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Zoe Sugg crowned UK’s wealthiest female social media star under 30\n\nMORE: The Great British Bake Off finale: Viewers’ fave revealed as Steph, David and Alice battle it out to win", "description": "Miley Cyrus and Cody Simpson proved they are just like us as they spent their evening perfecting a synchronised dance routine on TikTok", "authors": ["Rishma Dosani"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/comp-1572340525_1572344329.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-29"}