{"pub": "cnbc", "url": "https://cnbc.com/2019/10/29/why-novartis-ceo-wants-to-unboss-companies.html", "downloaded_at": "2019-10-29 14:00:54.219561+00:00", "title": "Why the CEO of this multi-billion dollar firm wants to 'unboss' companies", "language": "en", "text": "Dr. Vasant Narasimhan, CEO of Novartis, speaking at the Healthy Returns conference in New York City on May 21, 2019.\n\n\"Unbossing\" companies by reinventing outdated management hierarchies is the key to leadership success, according to one chief executive.\n\nSpeaking at the One Young World conference in London on Friday, Vasant Narasimhan, CEO of pharmaceutical giant Novartis, described himself as an \"accidental CEO,\" and emphasized that leadership still carried huge importance.\n\n\"The most powerful thing we have that can improve the world is leadership,\" he said. \"The most precious resource we have is leadership. The reason society has been able to make so many extraordinary gains over the last century is leadership.\"\n\nNarasimhan also urged future leaders to stay grounded as they were given more responsibility and authority.\n\n\"Leadership is not a right, it's not a rank — it's something that you earn every single day,\" he said.\n\nHowever, Narasimhan said traditional attitudes toward management were from a bygone era and needed an overhaul.\n\nHe said the corporate world was slowly learning the \"wisdom of ancient (societies),\" noting that many big firms were built during a different time and had been slow to adapt to a changing workforce.\n\n\"Along the way we lost that,\" he said. \"Somewhere in the last 100 years we've moved to a world of knowledge workers. We can't manage those workers like cogs in a factory.\"\n\nHe told the conference that Novartis was on a journey to \"unboss\" itself and become less hierarchical.\n\n\"The source of power for a leader is your ability to create opportunities for the people around you,\" he explained. \"People have to follow you because they believe in your ideas and your values. If the reason you want to do something is to please the hierarchy (you risk losing that).\"\n\nThe company's \"unbossing\" movement aims to develop \"servant leaders who put their teams' success above their own,\" a spokesperson for Novartis told CNBC via email on Tuesday.\n\nThis has involved investing in several projects, including a leadership program for Novartis' top 300 leaders, which has been dubbed the \"Unbossed Leadership Experience.\"\n\nNarasimhan himself, as well as the company's executive committee, are among the participants in the year-long leadership development program, which involves webinars, simulations, social learning and personalized coaching designed to train leaders in delivering the \"unbossed\" culture.\n\nNovartis is also using specially-developed online surveys to give employee feedback to managers. The platform was initially used for the firm's top 350 leaders, but is now in the process of being rolled out to all 12,000 managers across the company.", "description": "\"Unbossing\" companies by reinventing outdated management hierarchies is the key to leadership success, according to the chief executive of Novartis.", "authors": ["Chloe Taylor"], "top_image": "https://image.cnbcfm.com/api/v1/image/105925074-1558448987849nup_187141_0614cr.jpg?v=1558449999", "published_at": "2019-10-29"}