{"pub": "nymag", "url": "https://vulture.com/2019/10/living-with-yourself-season-1-episode-7-pia-colada.html", "downloaded_at": "2019-10-20 05:11:53.428223+00:00", "title": "Living With Yourself Recap: Me and My Old Lady", "language": "en", "text": "Living With Yourself Piña Colada Season 1 Episode 7 Editor’s Rating 4 stars * * * * * « Previous Next Photo: Eric Liebowitz/Netflix\n\nEveryone knows the chorus to the soft-rock standard “Escape (The Piña Colada Song)” — “if you like piña coladas, and getting caught in the rain” — but Rupert Holmes’s 1979 single tells a three-verse story with a twist, which suggests his future work as the author of Broadway musicals like Drood and Curtains. The gist of the story is that a man bored in his relationship responds to a classified ad that mentions, among other things, the requirement that he must like piña coladas, and he arranges a meeting with the ad’s author at a bar called O’Malley’s. The surprise ending is that the woman he meets is his current partner, which in Holmes’s telling affirms that neither of them had to look outside their relationship at all.\n\nPeople have noted that the song is a little creepy. (The narrator responds to the ad while lying in bed next to its author, for example.) But this episode of Living With Yourself reflects that song to such an uncanny effect that it feels like a straight adaptation — one that, surprisingly, dignifies Holmes’s lyrics. Kate and Miles 2.0 have placed the modern equivalent to a classified ad in the form of Da8er profiles, and Kate is on the lookout for someone new, who turns out to come in the extremely familiar form of her husband. She also comes to the realization, in the end, that maybe she already has what she’s seeking. (“I’m the love that you’ve looked for, come with me and escape.”)\n\nThe couplet from the song that “Piña Colada” most strongly evokes, however, is this one: “I didn’t think about my lady, I know that sounds kind of mean / But me and my old lady, had fallen into the same old dull routine.” Now set aside the creep factor of calling a romantic partner your “old lady” — though Styx did an entire song around this, which made for maybe the most awkward (yet sweet) scene in all of Freaks and Geeks — and you’ve got Kate’s marital dilemma in a nutshell. Only the complicated irony of this episode is that hooking up with a more vibrant, energized, “perfect” version of Miles isn’t what she wants, after all. She’s grown past that phase in the relationship.\n\nAfter the last episode peeled off into Miles’s morally dubious salvaging of the Hillston campaign, it’s great to have the show get back to what it does best, which is using its unusual premise to make observations about love, marriage, and the midlife crisis. “Piña Colada” starts with Miles 2.0 gathering essential abduction (and killing) materials from a department store before flashing back to a week earlier, when he went on a date with Kate. This picks up right where the Kate-centric fifth episode left off, with the two of them meeting in the city over mimosas and going through the slightly awkward ritual of having a date. With Kate staying at a swanky hotel for a week-long conference — hence Miles 2.0’s disappearance from work — they have a chance to get to know each other again. Sort of. It’s obviously complicated.\n\nThe keen insight of this episode is that we never actually want to go back to the early days of a relationship, even if the fantasy of it sounds appealing. We may pine for a time when everything was new and intense and full of spontaneity and possibility, but long-term partnerships change shape over time and certain routines start to take over. That doesn’t sound appealing — and when your mate is acting like a moody shit, as Miles does most of the time, it isn’t — but “rekindling” the romance can come with its own set of pitfalls. Miles 2.0 may have Miles’s memories, but he doesn’t have Miles’s experience; he’s a shiny new thing who sticks his head out of car windows like a dog. He hasn’t grown together with Kate as comfortable-old-shoe Miles has, and so the two of them are approaching life with a different metabolism.\n\nMiles gets Kate breakfast in bed. He takes her out on a run. He buys tickets for that Paris vacation they’d always wanted — and even floats the possibility of moving there. But Kate just wants a cup of coffee before work. And she hasn’t been out jogging in a long time. And Miles should certainly have the good sense to realize she’s not up for dropping everything for a trip to Paris, much less a permanent move. He’s coming on way too strong, yes, but mostly he’s “exhausting,” which is a word she uses more than once. “You’re too great and you’re too loving and you’re too kind and it’s weird,” she says. “And a little exhausting, if I’m being honest with you.” Their relationship is just getting started and they’ve already grown apart.\n\nWhat Kate really wants is the slower, more comfortable domestication she already has, but with Miles recommitted to their partnership (and planned parenthood) in a way that he wasn’t pre-cloning. And in his diabolical way, Miles 2.0 comes to understand that, which leads to him planning a kidnapping (and worse) to usurp the old Miles. Who knows better how Miles thinks than another version of Miles, after all? He can muss his hair and mope around, too, if that’s what it takes to be part of Kate’s life. He’ll just have to perform forever without breaking character.\n\nDouble Yous\n\n• Kidnapper/murderer pro tips: (1) Never buy all your supplies all at once in the same store. If you must, at least throw in a pack of gum or something, and (2) Never test the opacity of a black pillowcase in public.\n\n• The sex scene between Miles 2.0 and Kate is confusing. It has an awkward beginning and then ends in an abrupt, not-so-satisfactory way. It seems like the show is trying to suggest that Miles 2.0 has the sexual ability and stamina of an inexperienced teenager, but I’m not sure that makes sense. His body may resemble his younger self — and require him to masturbate multiple times a day accordingly — but he still has Miles’s memories of how things go.\n\n• Incidentally, the Miles 2.0/Kate stuff is basically the episode of The Simpsons where Homer tries to save his marriage by getting involved in Marge’s daily routine. (Homer, cutting her hair at the salon: “I wanted to surprise you with a kicky summer ’do.”)\n\n• Hard to believe that any version of Kate and Miles would have done a choreographed number at their wedding.\n\n• Dan is in on the cloning secret now, but he has an amusingly mixed reaction. He throws up at the sight of his old self buried in a shallow grave, and rages against the spa treatment, given that he “paid for the silver package.” But he nonetheless wants to be “clone buds” with Miles 2.0 and “beer it up” with the ladies some time.", "description": "Living With Yourself get back to what it does best: using its unusual premise to make observations about love, marriage, and the midlife crisis. A recap of ‘Piña Colada,’ episode 7 of season 1 of Netflix’s Living With Yourself, starring Paul Rudd.", "authors": ["Scott Tobias"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/11/living-with-yourself-recaps/living-with-yourself-ep-7.w1200.h630.jpg", "published_at": "2019-10-20"}