{"pub": "yahoo", "url": "https://sports.yahoo.com/alds-game-1-yankees-win-errorfilled-game-104-against-twins-032541968.html", "downloaded_at": "2019-10-05 03:48:20.958789+00:00", "title": "ALDS Game 1: Yankees win error-filled game 10-4 against Twins", "language": "en", "text": "Errors were the item du jour on the ALDS Game 1 menu. (Photo by Emilee Chinn/Getty Images)\n\nIf you like watching professional ballplayers commit defensive miscues in important postseason games, this was the game for you.\n\nThe New York Yankees won Game 1 of the American League Division Series against the Minnesota Twins by a score of 10-4, and misplays reigned supreme. The boxscore only counted two (one for each team), but the uncounted mental errors are what this game will be remembered for — if it’s remembered at all.\n\nScroll to continue with content Ad\n\nBecause really, this was a game to forget for everyone involved, beginning with the starters. Neither the Twins’ Jose Berríos or the Yankees’ James Paxton were particularly sharp, and it only got worse from there. Yankees first baseman DJ LeMahieu dropped a ball in the second. Twins second baseman Luis Arraez missed a pop-up in the third. Twins first baseman CJ Cron couldn’t dig out a throw from second and the ball skipped by him. Giancarlo Stanton misplayed two straight balls hit to him in left field. Twins third baseman Miguel Sanó couldn’t quite get his glove around a screaming liner in the 5th — it nicked the leather and spilled into left field, putting the Yankees up by two runs.\n\nIt was a cavalcade of errors, misplays and non-plays, broken up by occasional hits and strikeouts and many, many pitching changes. After the Yankees went up 5-3 in the 5th, a monster solo home run from Sanó got the Twins within 1. It looked like they were about to make a comeback, but then the Yankees struck in the bottom of the 6th with two solo homers and never looked back. They added three more in the 7th as the game approached the four-hour mark.\n\nBy the end, the game lasted four hours and 15 minutes, and 13 different pitchers took the mound for both teams combined. It was the 11th straight time the Twins lost to the Yankees in the playoffs.\n\nWHO MADE THE DIFFERENCE\n\nStory continues\n\nAaron Judge: It was a good night for Judge at the plate and in the field. He had two walks, a hit, scored two runs, and went against the theme of the game by making two fantastic catches.\n\nCJ Cron: It was a bad night all around for the Twins first baseman. The third inning throw he failed to pick cleanly resulted in the tying and go-ahead runs scoring, and then failed to trail Edwin Encarnacion after his hit, which turned a single into a double.\n\nGleyber Torres: It felt like the Yanks and Twins were tied for approximately 500 years (it was actually barely an inning) before Torres worked a 7-pitch at-bat in the 5th and ripped the game open on a double that skipped past Sanó’s glove.\n\nMUST-SEE MOMENT\n\nIn a game with so many defensive miscues, Aaron Judge’s spectacular catch in the 7th inning stands out. Is it emblematic of the game? Definitely not. But it’s much prettier and more satisfying than watching LeMahieu drop a ball that was falling from the sky directly above him.\n\nAaron Judge never rests on defense.\n\n\n\n(Via @MLB)pic.twitter.com/DsZLgkxsL6 — Yahoo Sports MLB (@MLByahoosports) October 5, 2019\n\nWHAT THEY’LL BE TALKING ABOUT\n\nIf someone is talking about anything but the sloppy play, the 13 total pitchers, or the length of the game, you can know for sure that they didn’t watch it.\n\nWHAT’S NEXT\n\nHopefully a shorter game with fewer errors. The Twins face the Yankees in New York on Saturday for Game 2, which starts at 5:07pm ET.\n\nMore from Yahoo Sports:", "description": "Do you like defensive misplays? It sure seems like the Yankees and Twins do!", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/WAyii5U96D_10rrxsyooyA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/5fM0R9DdifGIvNua3vDAWg--~B/aD0yMDAwO3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/881be940-e719-11e9-8376-5602f101d492", "published_at": "2019-10-05"}