{"pub": "yahoo", "url": "https://news.yahoo.com/does-russias-anti-drone-pantsir-010000499.html", "downloaded_at": "2019-10-27 12:17:03.265093+00:00", "title": "Does Russia's Anti-Drone Pantsir S1 System Even Work?", "language": "en", "text": "Key point: It is still unclear just how reliable the Pantsir S-1 is.\n\nIn November 2018, Viktor Murakhovsky, a writer for the Russian publication Arsenal of the Fatherland, posted a comment regarding the performance of Russia’s Pantsir S-1 air-defense system.\n\n“In Syria, it turned out that the Pantsir was practically incapable of detecting low-speed and small-sized targets, which include military UAVs. At the same time, the complex regularly recorded false targets—large birds flying around the base—rather confusing the operators.”\n\nShortly afterward, Murakhovsky’s post disappeared. Some observers speculated there may have been pressure to silence negative press for a system Russia has already exported to Algeria, Iraq, Oman, Syria and the UAE. Others dismissed Murakhovsky’s claim for relying on an anonymous source\n\nThe Pantsir-S1 is a truck-mounted short-range air defense system, or SHORADS, combining both surface-to-air missiles and rapid-firing 30-millimeter anti-aircraft cannons. SHORADS protect front-line troops and key military bases from low-flying jets, helicopters and incoming missiles.\n\nAs inexpensive drones have entered widespread use with both military and insurgent actors across the globe, SHORADS have grown in importance.\n\nBut the anonymous source Murakhovsky cited claimed the Pantsir performed poorly against drones compared to the older and more expensive Tor-M2U missile system.\n\n“In a real combat situation, the Pantsir does not justify the hopes placed on it,” the source explained. “On July 1, [2018], the first drone attack occurred, and three drones from the group were able to fly up to the Russian base and drop nine makeshift explosive devices. Immediately after the start of the attack, the Tor-M2U crew detected the targets and destroyed four drones with five ground-guided missiles at altitudes between 2.5 and three kilometers. Another three drones were shot down by the Pantsir-S1, but it used 13 missiles to do so.”\n\n“During the second half of July 2018, the Tors in Syria destroyed seven UAVs with nine missiles,” the source continued. “In August 2018, the Tors detected and shot down another eight UAVs, expending a total of nine rockets. In the period from April to October 2018, the Tor-M2U complexes in Syria shot down 80 air targets, with an efficiency of 80 percent.”\n\n“Meanwhile, the efficiency of the Pantsir-S1 during the same period was only 19 percent.”\n\nRead the original article.", "description": "Let's take a look.", "authors": ["Sebastien Roblin"], "top_image": "https://s.yimg.com/uu/api/res/1.2/edZwRXO47WBYyxvTBVDvqA--~B/aD0xMTA0O3c9MTQ0MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_national_interest_705/a9e2255eb755dfd3f43147cbd3ef510d", "published_at": "2019-10-27"}