{"pub": "aljazeera", "url": "https://stream.aljazeera.com/story/201910161503-0025933", "downloaded_at": "2019-10-16 21:11:54.887641+00:00", "title": "'My word is free': Emel Mathlouthi's journey through music and revolution", "language": "en", "text": "On Thursday, 17 October at 19:30 GMT:\n\n\"I am the secrets that will never die / I am the voice of those who would not give in\" – the words of Emel Mathlouthi’s 'Kelmti Horra' ('My Word Is Free') retain their singular power more than eight years after it expressed the hopes of millions of people looking for major political change in Tunisia and the wider Arab world.\n\n\n\nMathlouthi grew up in Tunis during the rule of Zine El-Abidine Ben Ali. Her early performances in schools and colleges voiced the frustrations of young people unhappy at the lack of opportunity across Tunisia under the Ben Ali government, which promptly banned her songs from the airwaves as they became popular. After a three-year spell in France, she returned to Tunis in late 2010 – and was on the ground when millions of Tunisians held a series of protests that mushroomed into wider ‘awakening’ demonstrations across the Middle East and North Africa. Mathlouthi sang on the streets – and ‘Kelmti Horra’ became an anthem.\n\n\n\nBut Mathlouthi doesn’t just want to look back. Now living in New York, she is now touring her new album 'Everywhere We Looked Was Burning'. For the first time in her career the majority of her singing is in English, with North African folk music and electronica forming the backdrop to a voice influenced by a diverse range of singers including Fairuz, Joan Baez, Bjork and Sinead O’Connor.\n\n\n\nEmel will join The Stream to talk about the persuasive power of music and perform tracks from her new album. Join the conversation.\n\n\n\nRead more:\n\nEmel Mathlouthi Is The 21st Century's Catalyst For Change - NPR\n\nWhy the World Needs Emel Mathlouthi’s Anthems Against the Dictatorship Machine - Pitchfork\n\n\n\nWhat do you think? Record a video comment or leave your thoughts in the comments below.", "description": "Tunisian singer-songwriter whose songs soundtracked the 2011 Arab awakening joins The Stream to showcase her new album.", "authors": [], "top_image": "http://stream.aljazeera.com/sites/default/files/styles/fb_og_image/public/1570713647-emel1.jpg?itok=Vj4dzf2e", "published_at": "2019-10-16"}