{"pub": "realclearpolitics", "url": "https://spectator.us/nba-tosses-alley-oop-china-censors", "downloaded_at": "2019-10-09 00:18:06.837393+00:00", "title": "The NBA tosses an alley-oop for China’s censors", "language": "en", "text": "The co-creators of South Park have once again demonstrated why the cartoon remains, after 23 seasons, remarkably astute at delivering shrewd political commentary in a comedic package of trenchant satire and irreverent mockery. Its 299th episode, ‘Band in China’, parodies China’s extreme censorship, restricted internet, and the capitulation of the American entertainment industry to cater to the political interests of the Chinese Communist party (CCP), which in an ironic case of life imitating art, got the show banned in China and virtually scrubbed from its firewalled internet.\n\nIn just one episode, Trey Parker and Matt Stone raised awareness of China’s growing appetite to assert its political demands in the international sphere, its alleged organ harvesting program, and the cultural genocide of the Uighur Muslims, while simultaneously lampooning Xi’s joyless regime for banning Winnie the Pooh for his supposed resemblance to the totalitarian CCP chairman.\n\nIn truth, the likeness between Xi and Pooh is less than striking, but Beijing’s overreaction to suppress all references to the honey-loving, pantless Disney character stems from a hallmark paranoia of authoritarians: that of subversiveness as an effective means to undermine their legitimacy. Years ago, South Park took on the ultimate Voldemortian ‘He Who Mustn’t Be Depicted’ character of our time, the Prophet Muhammad, who was portrayed in a bear suit being dragged out of a U-Haul van, with the entire scene branded by a ‘CENSORED’ bar. The resulting backlash shows why comedy can be one of the most precise and effective tools to strike at the heart of these authoritarian sensitivities, a notion that South Park has repeatedly and relentlessly tapped into by showing that it sometimes takes absurdist comedy to fully capture and address an age of absurdity.\n\nWhich brings us to Parker and Stone’s crystal ball-gazing ability to presage the absurdity of events surrounding the Houston Rockets GM Daryl Morey’s recent tweet and the pathetic response of the NBA that followed. In a now-deleted tweet, Morey voiced his support for the pro-democracy protests in Hong Kong, writing ‘Fight for Freedom. Stand with Hong Kong.’\n\nThe backlash was swift and decisive. It didn’t take long before Morey’s own boss, Rockets owner Tilman Fertitta, distanced himself and the organization from Morey’s views, and the NBA itself issued a contrived statement that differed in tone depending on whether you read the official English version or its Chinese Weibo statement. For the most part, both statements acknowledged the deep offense that their fans in China felt as a result of the views expressed by Daryl Morey, but the latter took on a more hostile stance with several superlatives added, saying that the league was ‘extremely disappointed’ by the GM’s ‘inappropriate tweet’ which ‘severely hurt the feelings of Chinese fans’. Meanwhile, the Chinese Basketball Association, headed by former Houston Rockets icon and Chinese national Yao Ming, announced that they would be severing ties with the Rockets and both the Chinese state-run network CCTV and Tencent (which owns the digital streaming rights for NBA in China), said they were suspending the pre-season broadcast arrangements, pending an immediate ‘investigation into all co-operation and exchanges involving the NBA’. This was all topped off with some special pleading from Rockets star James Harden, who said, ‘We apologize. We love China. We love playing there. They show us the most important love, so we appreciate them as a fan base.’\n\nThis spineless kowtowing to the CCP is completely discrepant to the NBA’s reputation — both historical and current — of not just tolerating but also encouraging political activism. Kareem Abdul-Jabbar stands out as a record six-time Most Valuable Player (MVP) for the Los Angeles Lakers who was equally known for his stellar game and his off-the-court advocacy to raise awareness of racial inequality and marginalized identities. Even today, Steve Kerr and Gregg Popovich, coaches for the Golden State Warriors and the San Antonio Spurs respectively, regularly pepper their commentaries with political stances that would make the NFL — which instituted new rules as a consequence of Kaepernick’s protests — bristle. They’ve weighed in publicly on many domestic wedge issues, from President Trump’s suitability for office, to immigration and even the issue of gun control. Back when Turkish President Recep Tayyip Erdogan canceled Enes Kanter’s passport in retaliation for speaking out against his authoritarian tactics and later on when as a New York Knicks center, Mr Kanter had to stay behind on an away game in London for fears of his safety, the NBA stood with him, as he recently tweeted. So why the flagrant double standard in approach to Morey’s tweet when previously, it had the integrity to defend Enes Kanter? Could it have something to do with China’s economic clout as opposed to Turkey’s?\n\nOne of the greatest miscalculations of our generation was that free trade, economic growth and the widespread adoption of the internet in China would produce a desire for more political freedoms. Instead, the PRC’s rising affluence has served to promote confidence in its own authoritarian political system and state-directed capitalism, and bolstered its will to ever more aggressively assert its values and interests abroad. Rather than exporting political freedoms such as democracy and free expression into China and importing a panoply of cheap goods to feed our empty consumerist souls, we ended up importing Chinese censorship and exporting Hollywood films made pliable to the whims of Chinese censors.\n\nThis NBA imbroglio is just the latest example in an exhaustive list of foreign victims of China’s bully pulpit and economic hostage-taking. Last year, hotel chain Marriott fired its social media manager after the Omaha, Nebraska-based employee was found to have ‘liked’ a pro-Tibet tweet. Recently, the American jeweler Tiffany & Co. took down an ad showing model Sun Feifei covering one eye with her Tiffany-ring-sporting right hand because Chinese consumers read the pose as being symbolically supportive of the Hong Kong pro-democracy demonstrations. When Chinese consumers account for 32 percent of all luxury goods sold worldwide in 2018 and poised to grow to 40 percent by 2024, are any of these craven genuflections taken by retailers surprising? Some international airline companies such as Australia’s national carrier, Qantas, have already rectified perceived affronts to China’s sovereignty by changing its website to refer to Taiwan as a Chinese territory and not a separate country. When Beijing tried to apply the same pressure on US air carriers, the Trump White House rightly dismissed it as ‘Orwellian nonsense’.\n\nSouth Park, in brilliantly skewering the never-ending appetite for Chinese money in Hollywood, showed just how much we have given the communist regime an unacceptable level of access to infiltrate our pop culture and political discourse with CCP propaganda. Just as Randy Marsh had sold ‘Tegridy’ (say it quickly and with a Southern drawl) Farms to the Chinese in the episode, the NBA has sold its integrity to the exact same buyer.\n\nTo NBA Commissioner Adam Silver’s credit, he most recently insisted that league is not going to regulate what the players and employees can say. The NBA is well-positioned to stand up to the bullying tactics of the CCP as it is a monopoly of basketball excellence and its star power simply has no substitutes worldwide. Are we really to believe that the average Chinese high school kid is happy with the decision that leaves him unable to watch his basketball heroes? This has always been the strategy of authoritarian, communist governments — to breed conformity in a paternalistic, top-down way, ensuring no one else can think, say or act differently, just as I referenced in my last piece here. Allowing people to think for themselves is also what makes us different and the NBA’s historical record of dealing with dissent and activism so exemplary.\n\nThe most undemocratic aspect of today’s shifting world order is that the leadership of an autocratic regime that governs 20 percent of the world’s population has, through outsized economic influence, too much power to influence and interfere in free societies, successfully wielding its power to bully foreigners into submission about what opinions they can and cannot hold far outside its own borders, and to beat into submission corporations and institutions that don’t toe the CCP line via punitive market consequences.\n\nIn the world of China-US geopolitics and growing Sino-supremacy, I’m calling a technical foul. The NBA should too.", "description": "Just as Randy Marsh had sold ‘Tegridy Farms’ to the Chinese in South Park, the NBA has sold its integrity to the exact same buyer", "authors": ["Melissa Chen", "Ross Clark", "Dominic Green", "Peter Wood", "Madeleine Kearns"], "top_image": "https://spectator.us/wp-content/uploads/2019/10/southparkharden.jpg", "published_at": "2019-10-08"}