{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7343043/Prince-Alberts-cruel-notes-Queen-Victoria-shatter-mythic-love-story.html", "downloaded_at": "2019-10-05 07:29:30.776328+00:00", "title": "Prince Albert's cruel notes to Queen Victoria shatter their mythic love story", "language": "en", "text": "At the height of World War II, the librarian in charge of the Royal Archive found an innocent-looking box labelled ‘Diary &c. Prince Consort’s notes on the birth of the Royal Children’. He duly packed it off in 1943 to Princess Beatrice, then aged 86, so she could decide what to do with it.\n\nThe last surviving child of Prince Albert and Queen Victoria, she had spent years since their deaths poring through all their journals and letters — and censoring any passages that threatened their image as a couple of utter moral rectitude and harmony.\n\nThank heaven, Beatrice must have thought, the librarian had sent her this final box.\n\n'I try my best to be patient,' he told her testily, 'but I feel the dreadful waste of most precious time, and of energies': Writes Prince Albert in newly discovered letters at the Royal Archive. The relationship between them has gripped the public's imagination and seen ITV produce a tv series Victoria (pictured Jenna Coleman as Victoria and Tom Hughes as Prince Albert)\n\nWithin it was a cache of letters from Albert to Victoria that were nothing less than passionately angry, buttoned-up expressions of marital hatred. In many, his usually neat handwriting had degenerated into a scrawl — evidence that his hand had been shaking as he filled the page.\n\nAppalled, Beatrice immediately asked King George VI for permission to burn her father’s inflammatory letters, which was duly granted.\n\nThe story, however, does not end there. Clearly, someone realised that to tamper with historical evidence in this way was a violation. So before the letters were burned, he or she photographed them all, then slipped the copies back into the Royal Archive, with no one the wiser.\n\nFrom that box, the coldness of Prince Albert’s letters still blows like a winter breeze.\n\nControlling and resentful, they constantly upbraid Victoria for her displays of irrational ill-temper.\n\nIndeed, by the time the couple’s eighth child was born, it is clear that their marriage had become an everlasting battle, punctuated by moments of relative calm.\n\nVictoria invariably fuelled the rows, which could result in her screaming at her German husband for an entire day.\n\nIn effect, she was screaming that she wanted love and understanding, but Albert’s habitual response was to run from the room — then write her a letter about why he found her behaviour intolerable.\n\nAfterwards, there would be an uneasy period of sulky silence between the pair. Eventually, Victoria would agree that she had been at fault, and openly repent of all the reproaches she had cried out in her rage.\n\nEven then, she was still so blindly in love with the man she called her ‘Angel’ that it never crossed her mind, except in the heat of passion, to reproach him for his coldness and lack of sympathy.\n\nTake, for instance, the row they had just a month after she gave birth to their eighth child.\n\nAs nearly always, the storm arose out of nothing: Albert and Victoria were sitting together, turning over the leaves of a collection of prints.\n\n‘I complained of your turning several times from inattention the wrong leave [sic],’ Albert punctiliously recalled in his post-row letter to his wife. ‘This miserable trifle produced the distressing scene.’\n\nVictoria, feeling herself at fault, had accused him of being unfeeling.\n\nAs he tried to point out the ‘groundlessness and injustice’ of her accusation, he may have let slip a little laugh, as she then hotly accused him of ridiculing her.\n\nAlbert retreated into obstinate silence. Goaded by this tactic, Victoria started shouting at him.\n\nIn his letter, Albert explained why he had refused to engage with her. Trying to ‘reason with a person in a state of excitement’ would make things worse, he said, thus he preferred to turn ‘a deaf ear to your attacks’.\n\nHe added: ‘I have no choice but to leave you when I see the conversation taking this turn. I leave the room and retire to my own in order to give you time to recover yourself, then you follow me to renew the dispute and to have it all out’.\n\nBy this stage of their rows, he confessed: ‘It is I believe out of human power, certainly out of mine’, to make things better.\n\n‘I try to forget such scenes as quick [sic] as possible and to return to our ordinary state of cordiality and unity, but this even is a special grievance and construed as a want of love for you.’\n\nDearest Victoria..'I try my best to be patient': A painting depicts the prince deep in thought as he tries to muster up the words for his 'love letters' to his bride\n\nOf course, by writing down the different stages of the dispute, Albert was demonstrating that he could not ‘forget such scenes’, even though he claimed he did ‘deeply pitty [sic] you for the suffering you undergo’.\n\nDid he nevertheless love his tempestuous little wife?\n\nThe truth is that he conceived it his ‘duty’ to be a loving husband, but showed very few signs of being in love.\n\nOn the surface, when things went well, there existed between them what Albert called ‘our ordinary state of cordiality’.\n\nBut Victoria did not want cordiality. She wanted ecstasy. She wanted an opera.\n\nHer short fuse at least allowed her to let off steam; whereas Albert, who tried to use cold reasonableness as a weapon, could really only find consolation in work.\n\nBy the age of 16, Princess Victoria was well aware of a family plan to marry her off to her cousin, Prince Albert of Saxe-Coburg and Gotha, and was curious to meet him.\n\nHe arrived in London, with his brother Ernst, in June 1836, in time for Victoria’s 17th birthday celebrations. Just 17 himself, he promptly succumbed to a bilious attack and had to stay in bed, emerging ‘pale and delicate’, as Victoria wrote to her uncle Leopold.\n\nThere was a bouncing exuberance about Victoria. Her energy, her appetites, her passion for dancing, appeared boundless. At her 17th birthday party, she danced five times — with the Duke of Brunswick, with Dutch Princes William and Alexander, with Ernst and with Albert.\n\nIn the country dancing after supper, she danced with Albert again but then, exhausted, he went to bed. She stayed up until half past three and felt ‘all the better for it next day’.\n\nShe was not attracted to Albert. He was less tall than Ernst and at this stage he was rather plump — she went so far as to say ‘very stout’. But while she felt no sexual attraction to him, she did like him.\n\nOn their last day, she told her journal: ‘At 9, we all breakfasted for the last time together! It was our last happy, happy breakfast with these dearest beloved Cousins, whom I do love so very, very dearly, much more dearly than any other Cousins in the world.’\n\nAlbert returned to university in Bonn, still set on fulfilling what he had been groomed to consider his English destiny. Not that he was entirely thrilled at the prospect, or pretending to feel any affection for his cousin. ‘She delights in court ceremonies, etiquette and trivial formalities,’ he moaned. ‘She is said to take not the slightest pleasure in nature, to enjoy sitting up at night and sleeping late into the day.’ Clearly, he viewed his coming marriage as a task — the Taming of the Shrew — rather than as a pleasure or privilege.\n\nAt this stage, Albert was an intensely serious youth, dedicated to his studies and all but devoid of humour. His wildest dissipation was to play dominoes in the evenings.\n\nWith women, he was socially clumsy and tongue-tied. ‘On the whole,’ commented family friend Christian Friedrich von Stockmar, ‘he will always have more success with men than with women, in whose society he shows too little empressement [enthusiasm].’\n\nWhen Albert was just five, his mother Luise had tired of her husband’s adulteries and left home, never to return. This left her son with an abiding dread of family discord, sexual scandal and emotional chaos.\n\nOn top of that, after his mother’s departure he had been brought up in an all-male world. This meant that when he encountered the feminine in the full-blast personality of Victoria, it would be a powerful experience with which he never entirely came to terms.\n\nWhile Albert was still at university, Victoria became Queen. Unwilling to contemplate marriage with her plump cousin, she told his family in 1839 that she considered the ‘affair’ to be at an end.\n\nThis was sufficiently alarming news for a newly slimmed-down Albert and his brother to plan another visit to London.\n\nVictoria’s magnificent journals, which she kept throughout her adult life, form, for the next week, what is in effect a short romantic novella about the Coburg princes’ stay at Windsor castle.\n\n‘At half past seven, I went to the top of the staircase and received my two dear cousins Ernst and Albert, whom I found grown and changed and embellished. It was with some emotion that I beheld Albert, who is beautiful,’ she wrote.\n\nThe next day, they danced two quadrilles together and she told herself: ‘Albert really is quite charming, and so excessively handsome.’\n\nBy the following day, a Saturday, she was recording in her journal: ‘I love and admire him more and more; those eyes of his are bewitching and so is the whole face.’\n\nOn Tuesday, she made up her mind and sent for Albert. ‘I said to him, that I thought he must be aware why I wished him to come here — and that it would make me too happy if he would agree to what I wished (to marry me); we embraced each other over and over again, and he was so kind, so affectionate; oh! to feel I was, and am, loved by such an Angel as Albert, was too great delight to describe! He is perfection in every way, in beauty — in everything!’\n\nAfter dinner, Albert went to bed early with a nosebleed. He was more than a little troubled by the intensity of Victoria’s sudden passion for him.\n\nAs he wrote to his grandmother, he considered that he was sacrificing himself ‘for the benefit of my new country’.\n\nNor was this the only thing that was to trouble him.\n\nIndeed, the few weeks before their wedding (on February 10, 1840) were in some ways a playing-out, or a foreshadowing, of the following 21 years, with Victoria in a state of passionate fury — against her politicians, and against those who checked her will — and old family friend Stockmar rather ominously ‘vexed at Albert’s misapprehensions about the various things’.\n\nOne of Albert’s misapprehensions was that he would be allowed to bring with him his own German entourage — whereas, naturally enough, the prime minister, Lord Melbourne, and other elder statesmen saw it as essential that Albert should learn the ropes and have an English Private Secretary to help initiate him into the mysteries of English life, social, political and courtly.\n\nHe was allowed a German secretary, but otherwise his Private Secretary was to be George Anson, hitherto Melbourne’s own assistant.\n\nAfter the exchange of love letters that had become their habit over the previous month, it was a shock for Albert to receive a very firm negative, not from officialdom but from his own beloved: ‘As to your wish about your Gentlemen, my dear Albert, I must tell you quite honestly that it will not do.’\n\nHe replied: ‘I am very sorry that you have not been able to grant my first request… Think of my position, dear Victoria; I am leaving my home, with all its associations, all my bosom friends, and going to a country in which everything is new and strange to me — men, language, customs, modes of life, position. Except yourself I have no one to confide in.’\n\nShe refused. As Lady Lyttelton, who became governess to the Queen’s children, would remark, ‘a vein of iron runs through her most extraordinary character’.\n\nAt least there was one thing that Albert could do right: their wedding night was, in Victoria’s view at least, a wild success.\n\n‘He took me on his knee, and kissed me and was so dear and kind,’ she wrote in her journal. ‘I never, never spent such an evening!!… feelings of heavenly love and happiness, I never could have hoped to have felt before!\n\n‘He clasped me in his arms, and we kissed each other again and again!… At 20 m. p. 10 [10.20pm] we both went to bed; (of course in one bed), to lie by his side, and in his arms, and on his dear bosom, and be called by names of tenderness, I have never yet heard used to me before — was bliss beyond belief! Oh! This was the happiest day of my life!’\n\n‘When day dawned (for we did not sleep much) and I beheld that beautiful angelic face by my side, it was more than I can express! He does look so beautiful in his shirt only, with his beautiful throat seen.’\n\nAs for Albert, he complained to Stockmar, very early in the marriage, that his wife was too passionate for him. Still, it seems likely that their union, for their first few years together, was a success between the sheets.\n\nBut that also meant babies.\n\nAs more and more children came to be born, Victoria would vacillate between exhaustion, nervous collapses and postnatal depressions, and a steely determination to continue exercising her political powers.\n\nWhen she neared her confinements, Albert would take over going through her boxes of state papers — but this still didn’t leave him with anything like the power he had expected to have.\n\nUnable to accept this, he fired off so many letters about politics to the prime ministers of the day that at least one complained of his workload doubling — because he also had to answer the Queen’s correspondence.\n\nEven when he was alone with Victoria, Albert could spend the whole of breakfast reading her the new German constitution. Then he would take two days to redraft it, though no one was seriously going to follow his counsel.\n\nMeanwhile, since he had no intention of merely being the man who blotted his wife’s signatures and fertilised her womb, he welcomed nearly every appointment offered to him, whether as the chairman of a committee, or as the administrator of royal estates and farms, or as a consultant to charities.\n\nIn many of his projects, he showed exceptional talent and judgment. These ranged from creating hundreds of university scholarships for poor students, building well-designed, affordable houses for the poor and becoming the driving force behind the hugely successful Great Exhibition of 1851 — visited by nearly a quarter of the population.\n\nLeaving nothing to chance, he also drafted endless notes on the upbringing of the royal children. His memos after the birth of their first child, Vicky, for instance, meticulously outlined the duties of each member of a huge nursery staff.\n\nLater, he would take a schoolma’amish interest in every detail of the children’s upbringing, from the timetables of their lessons to their physical exercise, their painting and what they got up to in the garden.\n\nIn January 1844, Albert’s father died. Barely able to register his loss, he travelled to Germany to see his brother and visit his father’s grave.\n\nHe and Victoria had by then been married almost four years. No sooner had he departed than he was followed by a hurricane of letters from his besotted wife, pouring out her love in slightly ungrammatical German, peppered with English words.\n\n‘Every time I hear a man’s footstep or a door go, every time… it gives me a stab in the heart, I believe, I hope, that you are coming — and oh! The truth, the terrible truth opens upon me,’ she wrote.\n\nAbove all, she yearned for him, she continued, in their ‘virginal’ bed. ‘Your little wife, your slave-girl loves you so indescribably much!’ His own letters back, both to the Queen and to a family friend, are in a wholly different vein.\n\nHe talks of never having felt more German, and refers to himself as a machine: ‘I will, therefore, at once close accounts [in Germany] and set about putting the machine into a state in which it may go on working for the future.’\n\nRevealingly, Victoria, who had never been apart from him for a single day or night since their wedding, was desolate at his absence — yet in Albert’s mind, his dedication to her, and to Britain, were acts of a determined will.\n\nWithin the marriage, Albert did his utmost to exercise control. It wasn’t easy: Victoria was a very strong personality, and a past mistress at emotional manipulation.\n\nShe became jealous and petulant if he spent too much time away from her, and was frequently cross with him. But she knew that by the standards of most royal marriages, she was lucky.\n\nUnlike his brother or father, the puritanical Albert had no mistresses. True, her feelings for him were passionate and uncontrolled, and his for her more dutiful, but she didn’t allow herself to notice this.\n\nNor was her husband spontaneously affectionate.\n\nIn any event, affection, with Albert, always — whether directed to his wife or his children — went hand in hand with control.\n\nOn top of that, he resented his wife’s royal superiority and cut her down to size when he could.\n\n‘You have again lost your self-control quite unnecessarily,’ he said in one. ‘I did not say a word which could wound you and I did not begin the conversation, but you have followed me about and continued it from room to room.’\n\nBy then, Victoria was calling him ‘my Master’ while he addressed her as ‘my Child’ and graded her behaviour at times like a fierce schoolmaster.\n\n‘I can give you a very good certificate this time, and am pleased to witness your own improvement,’ he told her in one letter.\n\nThe death in 1848 of the former prime minister Lord Melbourne, Victoria’s great friend and confidant, left Albert totally in the ascendant. It also marked the start of a period in which the Queen, while doting on her Angel, also deeply resented him.\n\nEach new pregnancy and birth now occasioned deeper depressions and resentments. The marriage was entering choppier waters, and by 1853 Albert was running out of patience.\n\n‘I try my best to be patient,’ he told her testily, ‘but I feel the dreadful waste of most precious time, and of energies which should be turned to the use of others.’\n\nThree years later, when Victoria was pregnant with their ninth and last child, she was advised not to have any more children.\n\nThe only sure method of birth control, of course, was abstinence, and this could only have added to the misery of the highly sexed Queen.\n\nShe had never made any secret of her desire for what she called ‘fun in bed’. Now, after 16 years of marriage, she felt increasingly that Albert was a cold fish who was withholding love.\n\nNor did it help that he was often criticising her behaviour as a mother.\n\nIn a letter written in October 1856, he said: ‘It is indeed a pity that you find no consolation in the company of your children. The root of the difficulty lies in the mistaken notion that the function of a mother is to be always correcting, scolding, ordering them about and organising their activities.\n\n‘It is not possible to be on happy, friendly terms with people you have just been scolding, for it upsets scolder and scolded alike.’\n\nIn his final years, Albert’s busyness intensified, becoming a catalogue of memoranda drafted, foundation stones laid, civic banquets in provincial towns pushed dyspeptically around dinner plates, and meetings chaired. This addiction to overwork exacerbated ‘rheumatic’ pains in his joints and intestinal troubles.\n\nBy 1859 he was also suffering from shivering fits and violent attacks of vomiting.\n\nThe beautiful youth Victoria had fallen in love with had become a bald, exhausted, sick, paunchy man who looked far older than his 40 years.\n\nMoments of intimacy were becoming fewer, and he kept apart from her as much as possible. Indeed, Victoria herself later admitted that in the last year of Albert’s life she ‘had scarcely anything of his company’.\n\nAnother source of distress was their heir, Bertie, a genial though markedly non-academic boy who appeared to charm most people except his parents. Rigidly committed to making him into a carbon copy of Albert, they doomed themselves to disappointment.\n\nBertie, for his part, had become involved in a minor scandal, escaping from an Army camp to tryst with a tart, then making her his mistress.\n\nEventually this news reached Albert’s ears — and, as Victoria wrote dramatically of his reaction: ‘Oh! that face, that heavenly face of woe and sorrow which was so dreadful to witness!’\n\nConsumed with rage and disappointment, he wrote their son an 11-page letter, accusing him of being both weak and depraved. Father and son reconciled a few months later, but in the process went for a long walk in the rain from which Albert never seemed to recover.\n\nAt 42, he was probably in the advanced stages of stomach cancer.\n\nOn December 1, 1861, he was unable to eat and shivering uncontrollably, but it took more than a week to convince Victoria that he was seriously ill.\n\nBy the 13th, the doctors were predicting that death was imminent.\n\nVictoria became almost incoherent, muttering: ‘The country… oh the country… I could perhaps bear my own misery, but the poor country.’\n\nThe following morning, after the children were led into the room, Albert’s breathing changed. The Queen leaned over him and whispered, ‘Es ist dein kleines Frauchen [It’s your little woman]’.\n\nHe whispered that he wanted her to give him ‘ein Kuss’.\n\nOnly then did the full horror of what was happening sink in fully, and Victoria began to scream. For once, her husband could not castigate her for yet again losing control.\n\nOver the 40 years that she survived him, the Queen’s love for Albert did not diminish: to her, he would for ever be the Angel who could do no wrong.\n\nShe had every opportunity to destroy his cold and reproachful letters, yet — for whatever reason —she did not. What she left for posterity was a record of an extremely difficult marriage.\n\nAdapted from Prince Albert: The Man Who Saved The Monarchy, by A.N. Wilson, to be published by Atlantic Books on September 5 at £25. © 2019 A.N. Wilson. To order a copy for £20 (20 per cent discount) call 0844 571 0640. Offer valid until 24.8.19, P&P free on orders over £15.", "description": "Prince Albert's cruel notes to Queen Victoria shatter their mythic love story - he called her 'my child' and cut her down - saying 'I feel the dreadful waste of most precious time, and of energies' with her.", "authors": ["A.N. Wilson For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/08/10/01/17114684-0-image-a-21_1565396360278.jpg", "published_at": "2019-08-10"}