{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/canada-election-leaves-uninspired-191009234338488.html", "downloaded_at": "2019-10-10 15:16:38.584231+00:00", "title": "Canada: 'An election about nothing' leaves many uninspired", "language": "en", "text": "Montreal, Canada - In just under two weeks, millions of people in Canada will cast their votes for the country's next parliament.\n\nAnd while election posters adorn street lamps, leaders trade barbs in televised debates, and campaign stops are organised from coast-to-coast, in many ways the election has failed to capture the attention of would-be voters.\n\n\"A lot of people really do feel that at some level, this is an election about nothing,\" said Lisa Young, a professor in the School of Public Policy at the University of Calgary.\n\n\"There hasn't been a unifying debate\" in the campaign so far, Young said, and instead, \"it has been focused on these questions about the leaders and how they present themselves, as opposed to questions of vision or direction or policy\".\n\nOn Monday, six party leaders participated in an English-language televised debate, making their pitch to Canadians on issues that included minority rights, good governance, climate change, and indigenous relations. They'll do the same in French on Thursday.\n\nAn Ipsos poll published this week showed Prime Minister Justin Trudeau's Liberals with 35 percent support in the run-up to the October 21 vote, while the opposition Conservatives, headed by Andrew Scheer, were following closely at 34 percent.\n\nBut while the debate may have helped showcase the leaders' personalities, Jim Bickerton, a political science professor at St Francis Xavier University in Nova Scotia, said the mood among voters remains one of frustration.\n\n\"People want to be able to sort of make up their mind now at this point, but they're a bit frustrated … things are not clear, still, to a lot of people. I think it may stay that way,\" Bickerton told Al Jazeera.\n\nOne party breaking away 'unlikely'\n\nThe Liberals' campaign platform centres around the middle-class, with the party promising to invest in healthcare and middle-class jobs, making childcare more affordable and accessible, and providing incentives to first-time home buyers.\n\nThe Conservatives, whose campaign slogan is, \"It's time for you to get ahead\", are promising a bevvy of tax credits and have pledged to slash Canada's foreign aid spending by 25 percent, money which they say will be reinvested to help Canadian families.\n\nConservative leader Andrew Scheer and Liberal leader and Canadian Prime Minister Justin Trudeau gesture to each other during the Federal leaders debate in Gatineau, Quebe [Justin Tang/Reuters]\n\nThe left-leaning New Democrats (NDP), who are polling at about 15 percent, have promised universal pharmacare (a medications insurance policy) access to clean drinking water for First Nations communities and the cancellation of the contentious Trans Mountain pipeline project.\n\nThe Greens, for their part, are positioning themselves as the only party with a real plan to tackle climate change and avoid a \"climate catastrophe\".\n\nBut Bickerton said that \"there's nothing really that suggests that we're going to get all of a sudden one of the parties breaking away\".\n\n\"Both Trudeau and Scheer have not covered themselves in glory and as a result, they can both sling mud at one another that sticks. The general attitude of the public is, a pox on both their houses ... That has limited, I think, the growth potential for both leaders.\"\n\nFrom 'desire for change to resignation'\n\nThe Liberal Party won a majority in the last federal election, securing 184 parliamentary seats in 2015 to end nearly a decade of Conservative-led governments under former Tory leader and Prime Minister Stephen Harper.\n\nAt the time, many Canadians' weariness at the prospect of another Conservative government in Ottawa pushed them to vote for an alternative.\n\nThis year, as Trudeau's first four-year term comes to an end, the sense of excitement felt ahead of the 2015 vote has waned, said Tammy Findlay, an associate professor in the department of political and Canadian studies at Mount Saint Vincent University in Halifax.\n\n\"There's a marked difference about how people thought about the last election, where there was a real desire for change, to here, where there's a bit of resignation,\" she told Al Jazeera.\n\nLiberal leader and Canadian Prime Minister Justin Trudeau speaks at a news conference after an English-language federal election debate [Carlos Osorio/Reuters]\n\nPart of the reason for the lack of optimism, Findlay said, is the fact that the Liberals reneged on a 2015 campaign promise of electoral reform; Trudeau said that vote would be the last in the first-past-the-post system.\n\nAs a result, she said the parties are once again \"encouraging people to vote against something rather than for something\".\n\nYoung also said that an argument can be made that at least three distinct elections are taking place simultaneously. \"In some ways we're seeing regionalism layered with micro-targeting … and so it means that we're not having a big national conversation,\" she said.\n\nRegional priorities\n\nIn Western Canada, Young said the election \"absolutely is a referendum on Justin Trudeau, and in Saskatchewan and Alberta in particular, it's a referendum that he is losing spectacularly\".\n\nA Leger Marketing poll dated October 2 found that 58 percent of eligible voters in Alberta and 49 percent of voters in Manitoba and Saskatchewan said they would vote for the Conservatives - the party's strongest support countrywide.\n\nIn French-speaking Quebec, which counts 78 parliamentary seats, a competitive race is under way between five parties, including the Greens and the separatist Bloc Quebecois.\n\nBloc Quebecois leader Yves-Francois Blanchet (centre) listens to NDP leader Jagmeet Singh (right) and People's Party of Canada leader Maxime Bernier speak during the Federal Leaders Debate [Sean Kilpatrick/AFP]\n\nThe Bloc has had a strong showing so far, riding on the momentum of the Coalition Avenir Quebec, a right-wing provincial party that won a majority government last year, said Chedly Belkhodja, a professor in the School of Community and Public Affairs at Concordia University in Montreal.\n\nParty leader Yves-Francois Blanchet \"has been able to put the Bloc [back] on the map, which was something that people were not expecting a year ago\", Belkhodja told Al Jazeera. \"In Quebec, the five parties could win seats,\" he said.\n\nMeanwhile, the fight to win in Ontario, the country's most populous province where 121 parliamentary seats are up for grabs, is also competitive.\n\nThe federal Conservatives are hoping to win back some key ridings around Toronto, as well as distance themselves from their provincial counterparts, who under Premier Doug Ford have drawn the ire of many Ontarians.\n\nBut overall, Belkhodja said few Canadians see the campaign as very exciting. \"It's lukewarm - there's no emotion,\" he said. \"I think people will vote 'in spite of'.\"\n\nControversies\n\nThe campaign has also largely failed to showcase the policy differences between the parties, said Findlay, and serious issues - from systemic racism to indigenous rights to foreign policy - have been largely left off the table.\n\n190922173019750\n\n\"Because of the controversies that have happened during this election campaign, it's really difficult for some to feel that this is an election where they're going to feel optimistic about the results,\" she said.\n\nThose controversies include a recent brouhaha over Scheer's failure to disclose his US citizenship, as well as questions over whether the Conservative Party leader really held an insurance broker license in Saskatchewan.\n\nTrudeau has also been in hot water after pictures emerged showing the Liberal Party leader in brownface during an Arabian Nights-themed party at a prestigious private school where he was a teacher in 2001.\n\nCanada’s Prime Minister Justin Trudeau, with his face and hands painted brown, poses with others during an 'Arabian Nights' party when he was a 29-year-old teacher at the West Point Grey Academy in Vancouver, Canada [Time/Reuters]\n\nAnother picture emerged of Trudeau in blackface as he performed at a high school talent show.\n\nWhile the Liberal leader apologised, his opponents used the incident to question his character.\n\n\"There are two different Mr Trudeaus,\" said NDP leader Jagmeet Singh, the first person of colour to ever lead a federal political party in Canada, after the photos were made public.\n\n\"There's one Mr Trudeau in public life who talks about how the indigenous community, and relations with the indigenous community, is most important. In public, he talks about diversity. But in his private life, he mocks people because of their skin colour,\" Singh said.\n\nThree likely scenarios\n\nWhile it's hard to say how the election will play out, Findlay said recent polls hint at three most likely scenarios: a Liberal majority, a Liberal minority, or a Conservative minority.\n\n\"It's so close now, it's really hard between those three options to say for sure,\" she said.\n\nAnd in such a close race, anything is possible.\n\n191007180210255\n\n\"I think turnout is going to matter, and that will be a reflection not of apathy, but of dissatisfaction with the choices available to them,\" said Young at the University of Calgary, about what low turnout would mean.\n\nThe official voter turnout was 68.3 percent in 2015, up from 61.1 percent four years earlier, according to Elections Canada data. In the last election, 57.1 percent of voters between the ages of 18 and 24 cast a ballot, an 18.3 percent increase from 2011 for that demographic.\n\nBut as opposed to what happened in 2015, Bickerton said \"there's not that groundswell of, 'we gotta get rid of this government', nor has the performance of the Liberals or the Conservatives been sufficient to rise above the fray\" this year.\n\n\"This campaign has again made it fairly clear that there are more or less two ideological camps in Canada. It's certainly not as polarised as you find in the United States… but there's still polarisation,\" he said.\n\nThat makes it all the more likely that the vote will end up in more or less a tie between the two frontrunners, he concluded, \"and a minority [government] as a result\".", "description": "Analysts say the lead-up to October 21 election has failed to capture the attention of voters.", "authors": ["Jillian Kestler-D'Amours"], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/9/b1b8911dd1a847839b199347065dde2f_18.jpg", "published_at": "2019-10-10"}