{"pub": "cbc", "url": "https://cbc.ca/arts/remembering-little-jamaica-this-new-film-pays-tribute-to-a-disappearing-toronto-neighbourhood-1.5300174", "downloaded_at": "2019-09-28 01:12:47.134908+00:00", "title": "CBC Arts", "language": "en", "text": "I remember the first time I experienced Eglinton Avenue West in Toronto. My mum and I were on the 32C bus and as it turned out of Eglinton West station, the sound of reggae music caught my attention. When I looked out the window, my eyes widened. Flags seemed to hang from every window, barrels piled in front of doorways, BBQ grills spewed smoke into the air. Voices with accents from Jamaica, Barbados, Trinidad, Grenada and St. Lucia could be heard and people —Black people — lined the streets. My mum and I wondered aloud what was going on. Was it a festival? A street party? An old woman next to us chuckled. Apparently what we were witnessing was just an average day in the neighbourhood I later learned was called Little Jamaica.\n\nThat memory of a vibrant, pulsating and dynamic community is what inspired writer and director Sharine Taylor to create her new documentary short Tallawah Abroad: Remembering Little Jamaica which premiered earlier this week at the Montreal Black Film Festival. Taylor moved out of the neighbourhood and into the suburbs as a child, so when she returned almost two decades later in 2017, she was stunned to see the transformation. Shuttered storefronts, clouds of dust and cranes reaching to the sky were now the features that characterized Eglinton West.\n\n\"I was really taken aback by everything,\" she told me during a phone interview earlier this week. \"There's nobody there.\" Taylor is following the footsteps of other Toronto based artists like photographer Jon Black and writer Zalika Reid-Benta who are doing the urgent work of documenting the Caribbean-Canadian community before it disappears.\n\nLittle Jamaica's devolution into a virtual ghost town is a direct result of the ambitious, costly and several-times delayed transit project: the Eglinton Crosstown Light Rail Transit. Years of noisy construction, constant road closures and hijacked sidewalks have led to a plunge in revenue for the local businesses that once populated the area. Hair salons, barbershops, Caribbean grocery stores, clothing stores, music stories and restaurants have experienced plummeting revenues, forcing some to close their doors forever.\n\nTallawah Abroad follows Vernal Small, a tailor whose shop has been open on the corner of Oakwood Avenue and Eglinton West for over four decades. His frank and sorrowful tone when discussing the disruption that the construction has caused to his business is a quietly devastating reminder of the very real and human consequences that are a result of this construction. \"There were people that I spoke to who were just like, 'I've given up. I'm not even trying to fight anymore. They've taken so much from me,'\" Taylor said. \"That's a really hard thing to negotiate.\"\n\nIn the mid-twentieth century, when Black immigrants from the Caribbean began arriving in large numbers to the city, they settled in areas such as Bathurst Avenue, the community around Jane and Finch and Eglinton West. At a time when wide-spread housing discrimination was the norm, these geographic enclaves became spaces of refuge and belonging where communities, institutions and culture was built.\n\n\"When my grandma first came to Toronto in the '70s, [Eglinton West] was a place that she frequented to get specific brands or food items that weren't as widely available as they are now.\" Taylor told me over the phone. \"My aunt used to drag me there every weekend when she was getting her hair and nails done. My mom used to go there to get certain groceries. For it to not have the same feel as it did in the past is really disheartening.\"\n\nMr. Vernal Small. (Sharine Taylor)\n\nMy mum and I moved to the area a few years after visiting, yearning for that sense of community we couldn't find in the suburbs. When I purchased my first home, I chose one in the neighbourhood, still wanting to remain within walking distance of roti shops and stores where I could find raw shea butter. Growing up I recall the crowds that would flood the streets of Eglinton West for Kiddies Carnival. I remember standing in front of Randy's Patties with friends after school or meeting up with a crush at Trea-Jah-Isle record shop. I wonder about the future of many of these businesses, especially those that don't own their buildings. The transit line brings with it an increase in property value and that can often lead to a spike in rental prices.\n\nI want people to know that we have a storied history and ties to that space. I guess I'm asking folks to ponder a little bit more about what kinds of spaces go through this process and what's at stake when things like this happen. - Sharine Taylor\n\nA recent graduate paper by Debbie Gordon on the transformation of Little Jamaica considers the stated goals of the transit project and argues that \"their primary focus is on developing infrastructure to maximize profit opportunities along the Eglinton Crosstown's route for commercial and real estate investors.\" There is a language that is used in many of these transit proposals. It's a language that may not utilize the term 'revitalization' but exploits its meaning constantly. Gordon challenges that language and the ethos of progress that it asserts (because of course in Toronto condos = progress) writing, \"Considering historical precedents around transit development, these developments most likely foreshadow Little Jamaica's displacement and erasure rather than its improvement.\"\n\nThere's a saying in Toronto that there are only two seasons in the city: winter and construction season. It's a wry observation of the ongoing construction and development happening everywhere. In a city dominated by condos and glass skyscrapers that seems to have little regard for history or cultural memory, it can be easy to categorize the destruction of Little Jamaica as yet another victim of this widespread rush to development. However Gordon argues that Eglinton West needs to be examined through another, more historical lens.\n\nAs the home to such a large and concentrated population of Black people who built communities, businesses and institutions in the area, its dismantling points to a more insidious pattern. She lists the destruction of Africville in Nova Scotia and Hogan's Alley in Vancouver, the renaming of Negro Creek Road to Moggie Road in Holland Township, Ontario and the ploughing over of the Black Durhan Road Cemetery in Southwestern Ontario as incidents that point to Canada's pattern of consistent erasing and displacing of Black communities.\n\nTallawah Abroad: Remembering Little Jamaica. (Sharine Taylor)\n\n\"One of the larger questions that I wanted to prompt in this is whose spaces get marked as spaces that are in need of preservation,\" Taylor says of her film. In 2014, the City of Toronto named the historic alleyway at Eglinton and Oakwood \"Reggae Lane\" and a 1,200 square foot mural by artist Adrian Hayles was created in recognition of its storied history as a hub for Jamaican migrants and reggae music in the 70s and 80s. However in Tallawah Abroad, Zalika Reid-Benta questions the intention behind naming this space, wondering if it was done to commemorate a community that would no longer be there. \"I wanted for people to think about gentrification without explicitly saying it,\" Taylor tells me. \"It's so obvious that this is what it is. It works in such secret and silent ways too. When areas get 'revitalized' there's a whole other set of politics that come with it. All these things become available but it's definitely at the expense of pushing the original inhabitants of the space out.\"\n\nI rode the 32C bus for the first time in many years last month. This time the sounds of reggae music were replaced by jackhammering and rumbling drills. Entire buildings were knocked down, countless store fronts were covered up and although the streets weren't empty, they were a shell of the vibrant, colourful and dynamic neighbourhood that my mother and I fell in love with. I wondered about future generations who may not have a Little Jamaica and where they would find their spaces of physical and geographic Caribbean community.\n\n\"I want people to know that we have a storied history and ties to that space,\" Taylor told me. \"I guess I'm asking folks to ponder a little bit more about what kinds of spaces go through this process and what's at stake when things like this happen.\"\n\nTallawah Abroad: Remembering Little Jamaica premiered earlier this week at the Montreal Black Film Festival. It will also screen at the Toronto Black Film Festival and the Halifax Black Film Festival in February 2020", "description": "Amanda Parris talks to Sharine Taylor about documenting a history that means a lot to both of them.", "authors": ["Amanda Parris Writes A Weekly Column For Cbc Arts", "Is The Host Of Exhibitionists On Cbc Television", "Marvin'S Room On Cbc Radio. In Her Spare Time", "She Writes Plays", "Watches Too Many Movies", "Defends Beyonce Against All Haters. In Her Past Lives She Wrote Arts Based Curriculum", "Attended Numerous Acting Auditions", "Dreamed Of Being Interviewed Oprah."], "top_image": "https://i.cbc.ca/1.5300180.1569604399!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/sharine-taylor.jpg", "published_at": "2019-09-27"}