{"pub": "nymag", "title": "Chernobyl Was the Easiest Thing Craig Mazin Has Ever Written", "url": "https://vulture.com/2019/08/craig-mazin-chernobyl-interview.html", "language": "en", "published_at": "2019-08-29", "downloaded_at": "2019-09-02 07:12:50.556509+00:00", "text": "Emmy Insider The Emmy race is here! Vulture is taking a close look at the nominees until voting closes on August 29. Photo: HBO\n\nIt sounds odd to call a show about the aftermath of a nuclear disaster a “surprise hit.” But that’s an apt description of Chernobyl, the HBO limited series that explores the many mistakes made during and after the famous 1986 explosion at the Soviet nuclear power plant. The series received critical acclaim, became unexpectedly buzzy, and did very well in terms of ratings. It’s also in the running for 19 Emmy Awards.\n\nAhead of next month’s ceremony, we caught up with the creator and writer of the series, Craig Mazin, whose credits prior to making Chernobyl included The Hangover Part II and Part III and Identity Thief. Mazin talked about the political relevance of the show, why writing this complex limited series was actually much easier than writing comedy, and why the scientist played by Emily Watson needed to be a female character.\n\nGiven the show’s sobering subject matter, I’m guessing you were surprised by how many people watched Chernobyl.\n\nI mean, I thought some people would watch it. The estimate of the audience would be “some amount of people.” We were proud of the show we made and we thought that the “some amount of people” that watched it would appreciate it. What we did not anticipate — and I think this covers everyone involved — was the way it seemed to just grow and grow and turn into this moment, this fascinating thing.\n\nIt speaks to the value of the traditional way of releasing television episodes, rather than just sort of dumping things all at once. The week-by-week release of Chernobyl helped create a kind of snowball effect. By the time we reached the end, it felt like we had occupied some sort of interesting place in culture. What I noticed, and maybe this is the most gratifying thing, is that the show has become allegorical for a number of things. It’s not like anyone just sat there and said, “Well, we watched the show, and we all took away that you don’t want to be near the Soviet Union when they’re testing nuclear reactors.” They see all sorts of allegories in it. Political allegories, scientific allegories, and problems are starting to be examined through the lens of what happened in Chernobyl, and that’s the most I could’ve ever hoped for.\n\nDo you think that one of the reasons so many people were interested in the series is because of what you just said? That they were seeing connections between then and now in terms of the political climate and the damage that lies can do?\n\nI think — and this is a guess — that people engage with the show for the same reason I became obsessed with Chernobyl. The circumstances of Chernobyl, and the fact that it takes place behind the Iron Curtain in the ’80s, [means] you’re getting a glimpse at something remarkable, that you didn’t even know happened. It draws you in because it is a terrifying succession of events. But when it’s over, I think that is when people start to think, okay, actually, yeah, I see the parallels now. Then the more you look, the more you see them. Now, also, oddly, we’re seeing non-allegorical parallels because nuclear reactors are blowing up in Russia again.\n\nYeah, I was going to ask you about that.\n\nI mean, it’s remarkable. I think when you finish watching the show, you do start to realize that the point here isn’t that the Soviet Union existed and it couldn’t exist anywhere else. The Soviet Union was nothing more than human beings, and human beings are capable of repeating any other human mistake, anywhere at any time.\n\nI’ve read about [the explosion] in the newspaper and it just reminded me, more than anything, of the aspects of my research that centered around the days following Chernobyl and the kind of news stories that were being published around the world. There’s a moment in our show where Gorbachev is looking through a collection of Western newspapers and the headlines. There was just confusion and fear, and it’s remarkable to me that any government hasn’t learned from that, that when something like this happens, you can’t hide it. You just can’t. I mean, forget about the fact that you shouldn’t. You can’t. And yet they try. Amazing.\n\nPrior to Chernobyl, you wrote primarily comedies. Did it feel like a big shift when you were writing it?\n\nYou know, I love comedy. I love working in comedy, I love features. But I’ve been doing it for, you know, 25 years. At the point I started working on Chernobyl, it had been about 20 years. 20 years is a long time to do anything, and I’d done a lot of movies. I’ve written not only movies you can see my name on, but movies you don’t see my name on. It was a lot, and it would never stop, either. There were no breaks. And comedy’s the hardest. I mean, it’s just the hardest. I used to say that out of a sense of suspicion, and now I can just say it empirically. It’s way harder than writing drama. It’s not even close.\n\nWhy do you say that?\n\nI guess I can boil it down to this: When you’re writing comedy, what you’re doing is creating something that has to be so compelling and fascinating in its own specific way that you are going to elicit an involuntary physical response from people. That’s different than anything else. It’s like, if I said to you, “Okay, you need to make a drama,” and you show your drama to an audience, and you come to me and you say, “Oh my god, did you see? They were crying at the end.” And I’m like, “Yeah, at the end. But they didn’t cry any other time. They have to be crying, like, three times a minute.” That’s what comedy is. Comedy is anti-crying, three times a minute.\n\nIt’s brutal. It requires a sense of logic, and it requires a kind of intellectual capacity. Some of the smartest people I know are comedy writers. You have to be transgressive, but you also have to understand character.\n\nWhen I was writing Chernobyl, it seemed very natural to me. Just natural and easy and also freeing, you know, to not feel like I was beholden to a room of people in the dark with their arms crossed over their chests saying, “Do it. Make me laugh.” It was nice to just worry about nothing more than, honestly, me. That’s what I felt like it was: “I need to please me, and I need to challenge me, and then do something that I think is beautiful, and the rest of it is the rest of it, I don’t know.” I’ll probably never write that freely again, to be honest with you, because now I’ve done this, and now every time I write something, I’ve got to think, “Well, it’s no Chernobyl …” [Laughs.] It was a dream. Honestly, the easiest thing I’ve ever done as a professional writer was writing Chernobyl.\n\nReally?\n\nNo question.\n\nYou can’t start figuring out how you’re going to do the production design or the special effects until you’ve written the script, but as you’re writing, are you thinking to yourself, “Man, how are we going to do that?” Or do you just push that aside and tell the story?\n\nI mean, I wrote without any cares, you know? I just wrote towards an ideal. I’ve written a lot of sequels. Sequels are the hardest things to write. You have demands from everybody and everybody has a thought. Nobody was telling me what to write. Nobody was telling me how to write it. And it wasn’t like anyone was saying, “Oh, and here’s a date we need it by,” or, “Here’s an actor we need to make happy,” or, “Here’s the budget.” Nothing. There were no constraints. It was simply, “Write something.” It was wonderful. I hadn’t had that experience in a long time. The movie business can be difficult, because there are artificial things in place that are already beginning to corrode the artistic intention. Before you begin, there is just stuff there, and with this, there was nothing like that. It was just simply purity of intention. And to HBO’s credit, that never changed. They never interfered in that regard. Everyone basically came together and said, “Okay, let’s make this as best as we can.”\n\nChernobyl ended up being five episodes. When you sat down to write it, did you have a sense of how you were going to structure it?\n\nI’m the most fastidious planner there is. I pitched the general notion of what the show would be to HBO and they said “Okay, go off and write a bible and an episode.” A bible is, you know, you lay out your season. So that document that I created was 60 pages long and it covered all of my main characters and why they were important and what their purpose was, and then every episode was broken down by scene. It’s not that I adhered perfectly to that, because as you write you will occasionally deviate, but I knew before I started writing what that show was. I knew how it began, I knew how it ended. It had to be planned. At least for a show like this, I don’t think you can sort of improvise your way to something with this much stuff going on in it.\n\nInterestingly, it was going to be six episodes, and in the writing of episode two it became clear to me that episode two and episode three needed to be one episode, mostly because the events it was portraying and the period of time it was portraying, days following the explosion and the nuclear reactors, seemed to demand a kind of urgency. I’ve noticed that in the new era of the limited series, there’s been a kind of languidization of narrative. Writers are given eight episodes to tell a story that might only need six and they still owe eight episodes and you think, well, suddenly there’s like a long montage of somebody doing something. It’s like, you know, go faster.\n\nAs a critic nothing irritates me more than that.\n\nRight? You see everything and so it’s probably more frustrating for you than for me, but you can feel it, right? You feel when they’re just adding. Now, I found out why. After I pushed it down from six episodes to five, obviously I let HBO know that that was my plan. HBO was like, “Okay, great. Terrific.” And then I found out that I got paid by the episode. So [the industry] should pay them by the show and not the episode, and then you know, they won’t pad out those extra episodes. That’s my theory.\n\nI never thought about that.\n\nLiterally, I didn’t even know.\n\nWhen you made that decision to take it from six to five, were there significant things that you lost in the process of doing that?\n\n\n\nNot really. It was just that things felt crisper. There was less sluggishness. There was a scene in episode two, it wasn’t lost in the script stage, but we couldn’t completely shoot it because we just didn’t have the budget for what I wanted to do. That’s the one thing I wish I had been able to show, which is essentially the May Day celebration, the parade, in Kiev and Minsk that happened on May 1, five days after the explosion, where people are marching in the streets and the citizens simply haven’t been told that a nuclear reactor is open and burning, maybe an hour’s drive away. We couldn’t do it because it turns out, parades are expensive.\n\nOther than that, honestly, we got to do everything. I hope people get that sense when they watch the show that they haven’t been cheated. We were given a tremendous amount of resources. We used every last dime of them and we hopefully showed people not just the scope of a terrible tragedy but also painted a picture, an accurate picture, of what life was like for regular people in the Soviet Union. Because it was not like what we thought it was here in the U.S. It was actually rather familiar to me, as a citizen of the U.S., and what a shock there. They’re just people, right? And they do the things that people do and they want what people want and that was the joy, to kind of celebrate Soviet citizenry. Because in the end, it was Soviet citizenry that saved us all.\n\nRight. I wanted to ask you about Ulana, Emily Watson’s character. I know she’s a composite of numerous scientists who were researching and working on all of this. But how did you arrive at creating that character?\n\nLegasov [Jared Harris’s character] was an interesting guy. He was very political, and it wasn’t accidental that they sent him [to Chernobyl]. It wasn’t simply because he was a good scientist. He was a nuclear chemist, so you know, he’s still a proper scientist, but he was pretty high up at the Kurchatov, which was the big, state-run nuclear institute. So they sent him in part because he was one of their guys, but he needed help. Throughout his work there, he is consulting with scientists, and they are assisting him, they are questioning him, and some of them are aware of the problems that exist in the reactor, and they begin to gently question whether or not maybe this was the reason [for the explosion].\n\nI needed narratively to focus all of those different functions into one person, so that we could follow it. I needed somebody who would be both questioning him and have the stature to question him, someone who felt maybe even a little better at nuclear physics than him. Someone who could represent the investigation into the truth of what happened and then somebody that would challenge him and hold him accountable to that truth, without feeling intimidated by him. Then that combined with the fact that women in the Soviet Union — the Soviet state was not gender-progressive, except in one area where they were, and that is in science and medicine. The percentage of women employed in science and medicine in the Soviet system in the ’80s was quite a bit higher than it was in the United States, possibly in part because tens of millions of men had died in World War II. So they made an allowance there where they wouldn’t have necessarily made it — and didn’t — in the Politburo, which was almost entirely male-dominated. So I wanted to get at that, which is an interesting circumstance — this one place where women actually were elevated and had positions of authority and importance. And I wanted to create a character that could embody all these things to challenge Legasov where he needed to be challenged. She is a character that represents a kind of scientific ideal to me, which is a bravery and a stubbornness. A willingness to be disagreeable when you have to. She’s not interested in popularity. She’s not interested in promotions. She only cares about the truth.\n\nThe scientists who were actually working with Legasov, I assume some of them actually were women?\n\nYes. There were a lot of names that we’ll never know. There were scientists. Generally, the women who were sent there for technical reasons were medical workers. But there were scientists, female scientists, involved in Chernobyl. And I actually spoke with one who was involved in the immediate medical planning in the aftermath of the accident. These scientists, some of them did their jobs and were fine. Some of them, um, challenged things a bit too much. One scientist was reportedly put on trial, which didn’t go anywhere because I guess the Soviet Union collapsed before they could actually get to the verdict. But it was a difficult time.\n\nYou said earlier that you’re not sure if you’ll ever write as freely as you did when you were working on Chernobyl. I’m wondering, how has working on this show affected your approach to your work? Either the kinds of projects that you’re pursuing, or just different approaches that you took as you were writing it? Has it changed anything about your process?\n\nThere’s one thing I think that I have come to understand that I don’t think I had room for before, psychological room. And that is that what I think, what I want, matters. I come from a middle-class background. My parents are public-school teachers. I didn’t grow up out here. I don’t know what the word is, but the antonym of entitlement? That’s what I had. If you were to hire me, my obligation was to make you happy. And I think you begin to question the value of honoring your own sense of what is good and right and worthy, and you start to cast it in with a little bit of a sense of self-indulgence. But this is different. This sense of honoring what it is that you actually want to do, and not doing things simply out of a sense of obligation, is a lesson that I’ve gotten from Chernobyl. When you’re writing something you want to write, it’s wonderful. And it sounds crazy to say that it’s a rare experience in Hollywood, but it’s a rare experience. Most of the time we’re writing what somebody needs us to write, because we have to support ourselves and our partners and our children, and it’s hard. And even when you find something you want to write, other people tell you, yeah, not that way, this way. I’m trying to stick to that lesson as best as I can.", "description": "Craig Mazin, creator of the HBO limited series Chernobyl, discusses his Emmy Award–nominated work on the show.", "authors": ["Jen Chaney"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/08/29/29-chernobyl.w1200.h630.jpg"}