{"pub": "cbc", "url": "https://cbc.ca/news/politics/andrew-scheer-staying-on-leader-1.5330762", "downloaded_at": "2019-10-22 20:43:05.236839+00:00", "title": "Andrew Scheer says he's staying on as leader, will fight Trudeau in the next election | CBC News", "language": "en", "text": "Conservative Leader Andrew Scheer said today he has no plans to resign, and vowed instead to stay at the helm of his party and take another swing at defeating Prime Minister Justin Trudeau in the next election.\n\nSpeaking to reporters in Regina this morning, Scheer said he had hoped for better results but is happy with the \"significant gains\" the Conservatives achieved in this election.\n\n\"We point to the fact that we won the popular vote, a million more votes for our party last night than than ever before, and that we have the strongest opposition in Canadian history,\" Scheer said. \"More people voted for me and the Conservative platform than any other party.\"\n\nThe party won roughly 300,000 more votes last night than its previous best, in 2011 — not the 1 million Scheer cited.\n\n\"This was the first step in a process to replace Justin Trudeau's government ... we'll take the next few days to prepare the ground work for the next campaign. We'll continue to prepare and fight for when the government falls,\" Scheer said.\n\nScheer managed to bolster his party's popular support thanks in part to lopsided victories in Alberta and Saskatchewan, where the party achieved record results.\n\nThe Conservatives faltered in the rest of the country, failing to make significant inroads in Atlantic Canada, Quebec or Ontario.\n\nIn fact, the Conservative Party won more votes in Alberta alone than it received in Quebec, New Brunswick, Prince Edward Island, Nova Scotia and Newfoundland and Labrador combined.\n\nCompared to 2011, when the Conservatives won a convincing majority government, the party achieved lower popular vote support levels in every province except Alberta and Saskatchewan.\n\nIn once solidly blue ridings like Central Nova and South Shore-St. Margaret's in Nova Scotia, and Milton in Ontario, the Liberal candidates easily bested their Tory opponents.\n\nConservative Leader Andrew Scheer says he will stay on as official opposition leader of the Conservative Party after losing to the Liberals in the 2019 federal election. While the Conservatives won the popular vote, they gained 300,000 more votes than they did in the last election — not the 1 million Scheer claimed. 0:32\n\nDespite a promising start to the campaign in Quebec, the Conservatives actually lost seats in that province.\n\nThe party emerged as a starkly more regional entity, with its support largely concentrated in Western Canada. There, the party's base turned out in record numbers, thanks in part to hugely unpopular Liberal policies that are seen as constituting an attack on the country's oil and gas sector.\n\nWhile Scheer promised to stay on as leader, the choice ultimately rests with the Conservative Party membership.\n\nUnder the party's constitution, if it fails to form a government — and if the leader has not yet formally signalled an intention to resign — then delegates can vote at the next party convention to hold a leadership race.\n\nThe party launches a leadership race if more than 50 per cent of members at the party convention vote in favour of one. The next Conservative convention happens in 2020.", "description": "Conservative Leader Andrew Scheer said today he has no plans to resign, and vowed instead to stay at the helm of his party and take another swing at defeating Prime Minister Justin Trudeau in the next election.", "authors": [], "top_image": "https://i.cbc.ca/1.5330848.1571767564!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/fedelxn-conservatives-20191022.jpg", "published_at": "2019-10-22"}