{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7562951/Lock-Eric-Trump-leads-rally-chant-targeting-Hunter-Biden.html", "downloaded_at": "2019-10-11 20:03:11.990771+00:00", "title": "'Lock HIM up!' Eric Trump leads rally chant targeting Hunter Biden", "language": "en", "text": "Eric Trump led cheers and chants of 'Lock him up!' Thursday night during his father's political rally in Minnesota, attacking Hunter Biden for what he said was 'embezzling' and 'crookedness' hanging over the son of the Democratic Party's leading White House contender.\n\nDonald Trump's most vocal supporters adopted 'Lock her up!' in 2016 as a derisive chant aimed at Hillary Clinton for what the FBI later called her 'careless' handling of classified information on an unsecured home-based email server.\n\nIt originated in Cleveland, Ohio, when California delegate Michael Stoker yelled the three-word phrase from the during the Republican National Convention floor.\n\nGen. Mike Flynn, who now faces a possible lockup himself for mishandling classified documents, egged the crowd on as the chant spread.\n\nNow the target is Joe Biden's son.\n\nEric Trump, son of the US president, speaks during a 'Keep America Great' rally at the Target Center in Minneapolis, Minnesota on Thursday night\n\nHunter Biden (L) and former U.S. Vice President Joe Biden (R) are ensnared in President Donald Trump's claims that they rae corrupt grifters who enriched themselves in Ukraine and China by leveraging the office of the vice presidency\n\n'How do you think Joe Biden – how do you think his son is feeling right now with his son embezzling a lot of money?' Eric Trump asked a cheering crowd of 20,000 as he warmed them up for the president.\n\n'Maybe \"Lock her up\" goes to \"Lock him up\"!'\n\nHearing the mantra shake the arena's rafters – with 'Lock them up!' hammering both Hunter and Joe Biden – Eric Trump shifted gears.\n\n'We don't need to lock them up. We just need to beat the hell out of them,' he responded.\n\nThe president praised Eric when he came on stage later, calling him 'my little six-foot-six boy.'\n\nThe second Trump son has become a more vocal defender of his father in the wake of House Democrats' impeachment inquiry, making frequent appearances on Fox News to tow the family line.\n\nPresident Donald Trump spoke at length to 20,000 people in Minneapolis, Minnesota\n\nThe Trumps have railed against the Bidens, aggressively promoting a popular theory among conservatives that the father-son duo plotted to save Hunter Biden's lucrative board position at a Ukrainian gas company, by pressuring the government there to fire a prosecutor who was investigating it.\n\nThere has been no legal conclusion that the Bidens were responsible for any wrongdoing.\n\n'Lock her up!' was deployed on t-shirts, bumper stickes and online ads in 2016.\n\nStoker, the Californian who coined the biting phrase, was later appointed to lead the west-coast region office of the Environmental Protection Agency.", "description": "Gen. Mike Flynn, who now faces a lockup himself for mishandling classified documents, egged on the 2016 Republican National Convention as 'Lock her up!' took hold. Now the target is Joe Biden's son.", "authors": ["David Martosko", "U.S. Political Editor For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/14/19589944-0-image-a-18_1570800792883.jpg", "published_at": "2019-10-11"}