{"pub": "yahoo", "url": "https://yahoo.com/entertainment/joker-laughs-competition-second-winning-190434555.html", "downloaded_at": "2019-10-14 02:10:11.140771+00:00", "title": "Joker laughs at the competition with second winning weekend in a row", "language": "en", "text": "Joaquin Phoenix’s Joker continues to prove that movies rooted in comic books are not a fad, as it takes the top spot at the box office for a second week in a row.\n\nThe psychological thriller earned an estimated $55 million domestically, bringing its two week total to $192.7 million. New releases rounded out the top three with animated The Addams Family nabbing second place with an estimated $30.3 million and Will Smith’s action thriller Gemini Man falling into third with an estimated $20.5 million.\n\nView photos Metro Goldwyn Mayer Pictures More\n\nSince October is a great month for all things creepy, kooky, mysterious, and spooky, it’s no surprise that MGM’s animated The Addams Family took the number two spot with an estimated $30.3 million, though the film outpaced expectations. Unlike Joker and It: Chapter Two (currently in eighth place with an estimated $3.2 million), The Addams Family brings PG-rated fun that’s suitable for the whole family.\n\nThe film, which follows the family as they relocated to New Jersey, stars the star-studded voices of Oscar Isaac, Charlize Theron, Chloe Grace Moretz, Bette Midler, Allison Janney, Aimee Garcia, and Finn Wolfhard. The film drew mediocre reviews, but a more positive B+ CinemaScore. from audiences.\n\nThe animated take on the altogether ookie family performed better than either of the previous two Addams Family big screen adaptations, 1993’s Addams Family Values, which opened to $14.1 million, and 1991’s The Addams Family, which opened to $24.2 milllion. However, this does not account for inflation. It’s likely the film could get a sequel with strong brand recognition and opening weekend numbers that exceeded projections.\n\nView photos Ben Rosenstein/Paramount Pictures More\n\nBox office action star Will Smith takes the third spot with Gemini Man, earning an estimated $20.5 million. The action thriller, directed by Ang Lee, follows an elite assassin named Henry Brogan (Smith) who suddenly becomes the target of a mysterious young operative that somehow knows his every move. The film also stars Mary Elizabeth Winstead, Clive Owen, and Benedict Wong.\n\nGemini Man has been ravaged by critics, excepting praise for the de-aging technology on display, and audiences aren’t much more positive, bestowing it with a decent B+ Cinemascore. Though the film marked the largest ever opening for director Ang Lee, it’s less than stellar for Smith, marking it his sixteenth highest opening behind more somber, dramatic fare like The Pursuit of Happyness.", "description": "'Joker' laughs at the competition with second winning weekend in a row", "authors": ["Rosy Cordero"], "top_image": "https://s.yimg.com/uu/api/res/1.2/a1J.TbWtqn8u79uZJ4yLLw--~B/aD0xODAwO3c9MjcwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/entertainment_weekly_785/3b2d9a1fbe61491d42dc0d4d3e83f174", "published_at": "2019-10-13"}