{"pub": "foxnews", "title": "People in Bahamas taking desperate measures to stay alive as Hurricane Dorian pummels islands", "url": "https://foxnews.com/world/bahamas-hurricane-dorian-rescues-desperate-measures", "language": "en", "published_at": "2019-09-03", "downloaded_at": "2019-09-03 01:12:31.467027+00:00", "text": "Hurricane Dorian is leaving catastrophic tragedy in its wake.\n\nOfficials in the Bahamas said they received a “tremendous” number of calls from people in flooded homes. A radio station received more than 2,000 distress messages, including reports of a 5-month-old baby stranded on a roof and a grandmother with six grandchildren who cut a hole in a roof to escape rising floodwaters. Other reports involved a group of eight children and five adults stranded on a highway and two storm shelters that flooded.\n\nDorian unleashed massive flooding across the Bahamas on Monday, pummeling the islands with so much wind and water that officials urged people to find floatation devices and grab hammers to break out of their attics if necessary.\n\nCONTINUING COVERAGE OF HURRICANE DORIAN ON FOX NEWS CHANNEL\n\nThe water reached roofs and the tops of palm trees. One woman filmed water lapping at the stairs of her home’s second floor.\n\nMost people went to shelters as the storm neared.\n\nTourist hotels shut down, and residents boarded up their homes. Many people were expected to be left homeless.\n\nPolice Chief Samuel Butler urged people to remain calm and share their GPS coordinates, but he said rescue crews had to wait until weather conditions improved.\n\n“We simply cannot get to you,” he told Bahamas radio station ZNS.\n\nAt least five deaths in the Bahamas were blamed on the storm.\n\nAt least 21 people were hurt in the Bahamas and evacuated by helicopters, Prime Minister Hubert Minnis said.\n\n“We are in the midst of a historic tragedy,” Minnis said in announcing the deaths. He called the devastation “unprecedented and extensive.”\n\nParliament member Darren Henfield described the damage as “catastrophic” and said officials did not have information about what happened on nearby cays. “We are in search-and-recovery mode. ... Continue to pray for us.”\n\nA spokesman for Bahamas Power and Light told ZNS that there was a blackout in New Providence, the archipelago’s most populous island. He said the company’s office on Abaco Island was flattened.\n\n“The reports out of Abaco as everyone knows,” spokesman Quincy Parker said, pausing for a deep sigh, “were not good.”\n\nThe fearsome Category 4 storm slowed almost to a standstill as it shredded roofs, hurled cars and forced even rescue crews to take shelter until the onslaught passed.\n\nForecasters warned that Dorian could generate a storm surge as high as 23 feet.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nBy 8 p.m. ET Monday, the storm’s top sustained winds fell slightly to 140 mph. It had beencrawling along Grand Bahama Island at 1 mph and then remained stationary.\n\nThe ferocious storm’s center was about 25 miles northeast of Freeport Grand Bahama Island. It has barely budged from that position all day.\n\nThe Associated Press contributed to this report.", "description": "Hurricane Dorian is grinding down hard and focusing its fury as it continues to maul the Bahamas.", "authors": ["Frank Miles", "Frank Miles Is A Reporter", "Editor Covering Geopolitics", "Military", "Crime", "Technology", "Sports For Foxnews.Com. His Email Is Frank.Miles Foxnews.Com."], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/02/694940094001_6082673243001_6082675314001-vs.jpg"}