{"pub": "cnbc", "url": "https://cnbc.com/2019/10/02/adp-jobs-report-private-payrolls-grow-but-hiring-slows.html", "downloaded_at": "2019-10-02 12:46:19.124138+00:00", "published_at": "2019-10-02", "title": "September private payrolls report shows the pace of hiring is slowing", "language": "en", "text": "The private sector created more jobs than expected in September but the pace slowed amid growing signs that the labor market is getting tighter, according to a report Wednesday from ADP and Moody's Analytics.\n\nCompanies hired 135,000 more workers in the month, ahead of the 125,000 that economists surveyed by Dow Jones had expected. That was a drop from the 157,000 in August, a number that itself saw a sharp downward revision from the initially reported 195,000.\n\nSeptember's gain was the slowest since June and brought the 2019 monthly average down to 145,000, a steep decline from the 214,000 for the same time period last year.\n\n\"We are in a very critical place, kind of a fragile juncture in the economy,\" Mark Zandi, chief economist at Moody's, said during a media conference call. \"What happens over the next few weeks, next few months, will determine whether there's an economic downturn in 2020.\"\n\nIndeed, companies with fewer than 50,000 employees saw the slowest hiring gain for the month at just 30,000. Large firms, with at least 500 workers, created 67,000 new jobs, while medium-sized businesses added 39,000.\n\nIn a separate interview with CNBC, Zandi pointed out that hiring toward the end of September was \"meaningfully weaker\" than at the beginning of the month.\n\n\"Demand for labor is beginning to weaken. Hiring is weakening across the board,\" he said on \"Squawk Box.\"\n\nAt the sector level, education and health services saw the fastest growth with 42,000 positions. Trade, transportation and utilities was next with 28,000, while professional and business services grew by 20,000. Leisure and hospitality added 18,000 as part of a total growth of 127,000 on the services side.\n\nOn the production side, construction rose by 9,000 and manufacturing grew by 2,000, but natural resources and mining saw a loss of 3,000.\n\nThe numbers come amid growing concerns over the strength of the U.S. economy. A reading Tuesday from the Institute for Supply Manufacturing showed the sector is contracting, though not yet at a rate consistent with a recession. Other economic data has been relatively strong, though, particularly on the consumer side.\n\n\"We are seeing more weakness in manufacturing. I do think in the coming months we will see manufacturing turn negative,\" Zandi said. \"Even more importantly, demand is slowing in many sectors and I don't see any stabilization in that and that's going to continue.\"\n\nEconomists sometimes will tweak their estimates for the pivotal nonfarm payrolls report based on the ADP numbers. For September, though, expectations are similar: economists surveyed by Dow Jones are looking for Friday's Labor Department estimate to show payroll growth of 145,000 and the unemployment rate to hold steady at 3.7%.", "description": "Companies hired 135,000 more workers in the month, ahead of the 125,000 that economists surveyed by Dow Jones had expected.", "authors": ["Jeff Cox"], "top_image": "https://image.cnbcfm.com/api/v1/image/105486423-1538596640567gettyimages-850660016.jpeg?v=1569956461"}