{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7629833/Mum-reveals-series-amazing-homemade-costumes-30.html", "downloaded_at": "2019-10-30 11:58:20.785408+00:00", "title": "Mum reveals series of amazing homemade costumes all for under £30", "language": "en", "text": "A five-year-old girl was hailed the 'winner of Halloween' after her mum revealed a series of her amazing homemade fancy dress costumes, all for under £30.\n\nSiobhan Smith, 25, from Govan, Glasgow, first created a homemade costume for her daughter Caoimhe Flynn, aged five, in 2015.\n\nSince then, she's only become more adventurous with her ideas - which are created from upcycled material and have cost at most £25.\n\nHer first costume for daughter Caoimhe was a granny, which she made entirely from items she already owned.\n\nThis was followed by a Starbucks paper-style coffee cup costing £10, the Statue of Liberty also £10 and then a Transformer costing just £5.\n\nCaoimhe Flynn, aged five, from Govan, Glasgow has dressed up as a granny (left) , a Starbucks coffee cup (middle) and Glasgow's iconic Duke of Wellington statue (right)\n\nThis year the childcare student hilariously dressed the youngster up as Glasgow's iconic Duke of Wellington statue.\n\nShe said: 'Every Halloween I try and hand make all her costumes. It was a wee granny first, but she was one and just walking.\n\n'The wee granny one was all stuff I had so it cost nothing.\n\n'Then the second one was Starbucks then the Statue of Liberty, then the Transformer and now the Duke of Wellington.\n\nThe little girl, who was hailed the 'winner of Halloween' has also dressed up as a Transformer (left) and the Statue of Liberty (right)\n\nSiobhan Smith, 25, from Govan, Glasgow,first created a homemade costume for her daughter Caoimhe Flynn, aged five, in 2015\n\n'The Starbucks one was about £10 for the material and £5 for the paint.Then the Statue of Liberty was about £10 for the material.\n\n'I just try and think of the most random stuff, I'm arts and craftsy and enjoy a challenge.\n\n'She [Caoimhe] never really asks to be these, she's quite laid back.'\n\nMum Siobhan was heaped with praise after making a Transformer costume last year, with one fellow mother insisting her child was the 'winner of Halloween'.\n\nTo create this look the mum used cardboard boxes she got while she worked at McDonald's and fairy lights she bought for £5 from eBay\n\nMum Siobhan was heaped with praise after making a Transformer costume last year, with one fellow mother insisting her child was the 'winner of Halloween'\n\nTo create it she used cardboard boxes she got while she worked at McDonald's and fairy lights she bought for £5 from eBay.\n\nShe said: 'The Transformer was tricky and something completely different.\n\n'In Govan everyone couldn't wait to see it. I was doing a wee half an hour every night over five weeks to make it.\n\n'She was quite worried she couldn't get back up properly, and this one she thought a lot of people would laugh. But then she said she loved it.'\n\nCaoimhe looked thrilled to sport her Starbucks outfit which featured a straw-shaped hat and her name written on the back\n\nTo create this look, the mum used a black top and black boots, and bought a secondhand black leather jacket and a sports cone from eBay, and black leggings from Amazon\n\nFor her latest work, Siobhan was inspired to replicate the Duke of Wellington after a light-bulb moment when she was about to throw away Caoimhe's old rocking horse.\n\nThe Duke of Wellington costume is the most expensive one Siobhan has made - costing just £25 to make.\n\nCaoimhe already had a black top and black boots, so Siobhan bought a secondhand black leather jacket and a sports cone from eBay, and black leggings from Amazon.\n\nSiobhan said: 'I was going to throw out the horse then I thought there was something I could do with it.\n\n'I just painted it black and bought the black leather jacket and leggings.She already had a black top and black boots.\n\nMum Siobhan says she's ' craftsy and enjoys a challenge' and often tried to think of the most 'random thing she can' when coming up with a costume\n\nProud of her handiwork, Siobhan often shared pictures of her daughter wearing hre outfits to social media - including this comparison of Caoimhe to the real Statue of Liberty in New York City\n\n'I sawed the rocking bits off it and attached the wheels.It was for her after school care party and she's still got her school disco to go.'\n\nProud of her handiwork, Siobhan posted a picture of Caoimhe dressed up on social media which went viral - attracting more than 6,000 likes and 5,000 shares.\n\nSiobhan, who believes she now has her work cut out to better the Glasgow landmark, said: 'Most people didn't think I could top last year's but now they're saying the Duke of Wellington is better.\n\n'I don't know what I'm going to do next year now.'", "description": "Siobhan Smith, 25, from Govan, Glasgow, makes incredible costumes for her daughter Caoimhe, 5, by upcycling old clothes, cardboard and fabric, and the most she's spent in £25.", "authors": ["Monica Greep For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/10/20369098-0-image-a-91_1572432469754.jpg", "published_at": "2019-10-30"}