{"pub": "npr", "url": "https://npr.org/2019/10/19/771546293/kurdish-general-slams-u-s-syria-policy-gen-petraeus-calls-withdrawal-a-betrayal", "downloaded_at": "2019-10-20 00:08:03.230846+00:00", "title": "Kurdish General Slams U.S.-Syria Policy; Gen. Petraeus Calls Withdrawal 'A Betrayal'", "language": "en", "text": "Kurdish General Slams U.S.-Syria Policy; Gen. Petraeus Calls Withdrawal 'A Betrayal'\n\nEnlarge this image toggle caption Cavit Ozgul/AP Cavit Ozgul/AP\n\nAs the five-day cease-fire along Turkey's border with Syria continues to falter, the commander of the Kurdish-led Syrian Democratic Forces (SDF) tells NPR he thinks the deal is \"really terrible.\"\n\nUnder the deal, announced Thursday by Vice President Pence, Turkey agreed to halt its military offensive into the Syrian border region and the U.S. agreed to help usher the Kurdish-led forces out. Gen. Mazloum Kobani Abdi, top commander of the SDF, said his troops are committed to a temporary pause in fighting — but he is unwilling to fully evacuate his forces from the highly contested 20-mile-wide zone along hundreds of miles of the Syrian border.\n\nAbdi says the SDF only agreed to withdraw its forces from \"a few specific points,\" not the entire region under discussion. In an interview with NPR's Daniel Estrin and Lama Al-Arian, the commander said, \"We've asked for a corridor in order for us to be able to withdraw our forces ... but [Turkish forces] haven't yet opened one.\"\n\nMeanwhile, Turkish-backed forces remain in the area. Turkish President Recep Tayyip Erdogan has said that if the Kurdish-led forces do not retreat by Tuesday, Turkey will resume its offensive.\n\nOn Saturday, The Associated Press reported that the two sides were still trading fire around Ras al-Ayn, a strategic border town.\n\nIntense fighting began after the U.S. rapidly withdrew troops from northeastern Syria earlier this month. U.S. Secretary of Defense Mark Esper told CBS last week that the U.S. would withdraw 1,000 troops in northern Syria. Two U.S. officials close to the conflict told NPR all U.S. forces involved in fighting ISIS in the area would leave.\n\nMembers of Congress largely disagree with the decision to withdraw U.S. troops from the region; the House denounced it in a 354-60 vote on Wednesday. Senate Majority Leader Mitch McConnell called the decision \"a grave strategic mistake\" in an op-ed on Friday.\n\nIn an interview on Saturday, former CIA Director Gen. David Petraeus told NPR's Michel Martin that he agrees with McConnell's strongly-worded assessment. Petraeus, the former commander of Central Command in charge of U.S. forces in the Middle East, said the policy was unfair to Kurdish fighters who had been key U.S. allies in the fight against ISIS.\n\n\"The Kurds always used to say ... that [they] have no friends but the mountains, and I would reassure them,\" Petraeus said. \"I would say, 'Americans are your friends.' ... And sadly, this is arguably a betrayal.\"\n\nPetraeus told NPR the withdrawal of American forces has turned what was a stable area in Syria, where more than 10,000 Kurdish-led forces had been killed in the fight against ISIS, into \"a scramble.\"\n\nAs NPR's Jane Arraf has reported, the short period of conflict this month has led to up to 200 civilian casualties and the displacement of about 200,000 people.\n\nPetraeus said that he understands the desire to reduce the toll on U.S. troops overseas but that in the region being disputed along Syria's border with Turkey, \"we'd essentially done that.\"\n\n\"We had less than 1,500 [troops],\" Petraeus said. He added that those forces included special operations forces who played an important role in the U.S. campaign there — \"but surely that's affordable for the world's only military superpower.\"\n\n\"What we were doing was not fighting on the front lines — we were enabling those who were doing that,\" Petraeus said. It was U.S. allies — Kurdish-backed forces — \"who bore the brunt of the fighting on the front lines.\"\n\nSozda Rakko of the Kurdish Red Crescent, northeastern Syria's equivalent of the Red Cross, told NPR's Arraf that she had gotten reports of a hospital bombing along a border city on Friday, one day after the cease-fire agreement was announced.\n\nIn a statement on Friday, Kurdish forces said that though attacks had slowed, artillery and drone attacks and gunfire by Turkish-backed militia killed five civilians and at least 13 Kurdish fighters in Syria on Thursday.\n\n\"We will not refrain from using our right to legitimate self-defense in case of any attack by Turkish-backed militias,\" the statement said.\n\nOn Friday, President Trump tweeted that he had spoken with Erdogan, who told him that \"there was minor sniper and mortar fire that was quickly eliminated.\"\n\n\"[Erdogan] very much wants the ceasefire, or pause, to work,\" Trump wrote.\n\nErdogan told reporters that he intends to move some of the millions of Syrian refugees in Turkey to the border area where Kurdish-led forces are being asked to evacuate. Syrian Kurds fear hostility from these refugees and worry that their demographic majority would be threatened in certain areas.\n\n\"If we stay on this path, it will have catastrophic consequences that will affect the people of the area and create ethnic cleansing,\" Abdi told NPR. \"We are asking Trump and the U.S. administration to keep its promises.\"\n\nAbdi said he wants Trump to reverse the withdrawal of American troops from northern Syria and reverse the U.S. deal with Turkey — \"so we can find a complete political solution to the Syrian conflict.\"\n\nAbdi also said his army had not made a deal with the Syrian regime about which areas it would control in the future. Turkey has expressed a desire for the contested border region in Syria to become \"buffer zone,\" while many see it as a Turkish occupation.\n\nIn the meantime, Russian troops are making inroads. As NPR's Greg Myre has reported, video shows Russians taking over an abandoned U.S. outpost, with half-eaten meals left by American troops on the dining tables.\n\nEugene Rumer, a senior fellow at the Carnegie Endowment for International Peace, told Myre that Russia's \"mission of getting itself reestablished as a major power broker in the Middle East has been facilitated by the fact that the United States has been trying to disengage.\"\n\nTrump told reporters earlier this week that he does not mind the Russian presence.\n\n\"Russia's tough,\" Trump said. \"They can kill ISIS just as well, and they happen to be in their neighborhood.\"\n\nOn Friday, Trump celebrated the deal with Turkey on Twitter: \"Think of how many lives we saved in Syria and Turkey by getting a ceasefire yesterday. Thousands and thousands, and maybe many more!\"\n\nMoving forward, Petraeus told NPR's Martin, the U.S. needs to determine what can be \"salvaged\" in the fight against ISIS.\n\n\"We have to try to get into a political process, in which now Iran and Russia and [Syrian President] Bashar al-Assad clearly have an upper hand,\" Petraeus said. \"We have to take care of those refugees that are being pushed out of their homes ... and somehow, we have to also try to shore up our international credibility at a time when it has been called into question.\"", "description": "Two days into a cease-fire, clashes continue along Syria's northern border. Petraeus, who once commanded U.S. forces in the region, told NPR that withdrawing U.S. troops is unfair to Kurdish allies.", "authors": ["Jenny Gathright", "Daniel Estrin", "Lama Al-Arian"], "top_image": "https://media.npr.org/assets/img/2019/10/19/ap_19290393459983_wide-ce08b1ad8094adfeae903fca5bf9cc18a77232a8.jpg?s=1400", "published_at": "2019-10-19"}