{"pub": "cbs", "url": "https://cbsnews.com/news/reunion-vietnam-vet-reunited-with-beloved-dog-in-hospice-care", "downloaded_at": "2019-10-22 13:32:13.005911+00:00", "title": "Vietnam vet reunited with beloved dog in hospice care", "language": "en", "text": "When Vietnam War veteran John Vincent was admitted to hospice care with limited time left to live, he only had one request: to see his dog one final time.\n\nVincent does not live near any other family in New Mexico, according to a Facebook post from Albuquerque Animal Welfare. So when he was admitted to the hospice center at Raymond G. Murphy Veterans Affairs Medical Center last week, he had to give up his 6-year-old dog Patch for adoption.\n\nBut before Patch moved on to a new home, Vincent's palliative care social worker Amy Neal contacted Albuquerque Animal Welfare about Patch getting a final moment with his previous owner, the center wrote. She told the animal center, according to a Facebook post, that Vincent \"may not have much time left.\"\n\nThe shelter was able to make the request happen on October 17, when Patch took a trip down to the hospice center to be reunited with Vincent. Since the reunion, the dynamic duo's story has gone viral.\n\n\"It was such a heart warming moment! They were so happy to see each other and to say their good byes,\" Albuquerque Animal Welfare wrote on Facebook. \"It was an honor to make this veterans final wish come true.\"\n\n***Patch has been adopted*** A Special Reunion Yesterday was a special day for a Veteran named John Vincent and his... Posted by Albuquerque Animal Welfare on Friday, October 18, 2019\n\nDespite being hooked up to medical equipment and being confined to the bed, Vincent had a whole lot of of love from Patch. In photos, the two can be seen cuddling between plenty of kisses and back scratches.\n\nThe two have been together Patch's entire life. Vincent adopted Patch from his neighbor, when their dog had a litter of puppies.\n\n\"Vincent wanted a small dog that could ride on his motorcycle with him,\" said Albuquerque Animal Welfare.\n\nAs Vincent continues to stay in hospice care with the lasting memories of his six-year friendship, the center wrote that Patch has been adopted by a new family.", "description": "A Vietnam War veteran was granted his dying wish — to see his dog one last time", "authors": ["Li Cohen"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/10/22/22f7c2d8-1f56-4b9e-9619-717f0996ff78/thumbnail/1200x630/61fd8defbabb0c178a60681f37176c24/72876530-10157138335983962-2656129130147348480-o.jpg", "published_at": "2019-10-22"}