{"pub": "telegraph", "url": "https://telegraph.co.uk/cars/news/tokyo-motor-show-2019-venue-disrupted-olympic-preparations", "downloaded_at": "2019-10-23 15:11:46.111957+00:00", "title": "Tokyo Motor Show 2019: venue disrupted by Olympic preparations", "language": "en", "text": "Car makers were ill served by the Japanese Motor Manufacturer’s Association, the organisers of the Tokyo Motor show, although some were more ill served than others.\n\nWith the Big Site exhibition halls in the Ariake district of Tokyo being readied for next year’s Olympic Games, the motor show was forced to split itself across four halls over a mile apart. It was a bit like the Frankfurt Show in September, where organisers refused to reduce the foot print of their much-diminished show, which just meant you walked more to see less.\n\nSo who won and who lost out in this process? Certainly journalists' shoe leather fell victim, as you either paid a fiver to get a return rail trip between the halls, or took Hobson’s Choice of a half an hour queue for a free bus ride or a half an hour yomp between the halls.\n\nToyota’s position here is moot. As well as being Japan’s, if not the world's, biggest car maker, it is a major sponsor for the Olympics and the Paralympics so Big Site being dug up is in its long-run benefit. Akio Toyoda, Toyota's president, holds a similar position at Jama, so he signed the show contract knowing full well that this year would be far from a vintage example of what has traditionally been one of the most technically interesting shows in the calendar. And it was the motor show which lost the most; in terms of logistics if not content it was one of the worst I have ever attended.", "description": "Car makers were ill served by the Japanese Motor Manufacturer’s Association, the organisers of the Tokyo Motor show, although some were more ill served than others.", "authors": ["Andrew English", "Paul Hudson"], "top_image": "https://www.telegraph.co.uk/cars/images/2019/10/23/TELEMMGLPICT000213886167-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?imwidth=1200", "published_at": "2019-10-23"}