{"pub": "yahoo", "url": "https://news.yahoo.com/pelosi-says-house-vote-week-200741959.html", "downloaded_at": "2019-10-29 06:14:13.710547+00:00", "title": "Pelosi Says House to Vote This Week on Impeachment Inquiry", "language": "en", "text": "(Bloomberg) -- The House of Representatives is set to take its first vote to support the ongoing impeachment inquiry of Donald Trump, a move that aims to nullify Republicans’ main complaint that the process is illegitimate.\n\n“We are taking this step to eliminate any doubt as to whether the Trump administration may withhold documents, prevent witness testimony, disregard duly authorized subpoenas, or continue obstructing the House of Representatives,” Speaker Nancy Pelosi wrote in a letter to colleagues.\n\nThree House committees have held weeks of closed hearings to gather information from witnesses about pressure that Trump and his associates put on Ukrainian leaders to investigate Joe Biden, a leading 2020 candidate. The resolution in support of the inquiry will be the first chance for all House members to be on record supporting or rejecting the impeachment process. All but a handful of Democrats have already endorsed the inquiry.\n\nPelosi has resisted hold such a vote, despite criticism from Trump and Republicans, arguing that it was unnecessary. It’s now scheduled for Thursday, according to a senior Democratic aide.\n\nThe resolution “affirms the ongoing, existing investigation that is currently being conducted by our committees as part of this impeachment inquiry,” Pelosi said in her letter, “including all requests for documents, subpoenas for records and testimony, and any other investigative steps previously taken or to be taken as part of this investigation.”\n\nThe resolution will mark a transition to a more public phase of the investigation, including open hearings and the release of information gathered in private depositions, Pelosi said in her letter. It also “outlines procedures to transfer evidence to the Judiciary Committee as it considers potential articles of impeachment, and sets forth due process rights for the president and his counsel.”\n\n‘Unprecedented Cover-Up’\n\nA House official familiar with the decision said Democrats still regard a resolution authorizing the probe as legally unnecessary. But the official also said that Congress during the Clinton and Nixon impeachments put in place a clear process to guide committees and give the public a sense of how it’s going to work.\n\nHouse Minority Leader Kevin McCarthy in a tweet Monday called the process a “sham” and said the introduction of a resolution represents “an admission that this process has been botched from the start.”\n\nWhite House Press Secretary Stephanie Grisham said Pelosi is “finally admitting what the rest of America already knew – that Democrats were conducting an unauthorized impeachment proceeding, refusing to give the President due process, and their secret, shady, closed door depositions are completely and irreversibly illegitimate.”\n\nIn the same letter Pelosi announced the resolution, she cited a Friday decision from a federal judge backing up the Democrats’ stance that such a vote isn’t required under the law. She said the Trump administration invented the need for a vote “in order to justify its unprecedented cover-up, withhold key documents from multiple federal agencies, prevent critical witnesses from cooperating, and defy duly authorized subpoenas.”\n\nThe White House, State Department and other agencies have refused to turn over documents and have instructed former and current executive branch employees not to cooperate with the inquiry. Many witnesses, including the former ambassador to Ukraine and the current ambassador to the European Union, defied State Department guidance after being issued subpoenas for their depositions.\n\nA former national security aide, Charles Kupperman, asked a federal judge on Friday to decide whether he should comply with a congressional subpoena or White House instructions to not cooperate. He didn’t appear for his scheduled deposition on Monday.\n\nHouse Intelligence Chairman Adam Schiff said Kupperman’s suit is without legal merit and could be part of an obstruction case against Trump.\n\n(Updates with Republican reaction beginning in the eighth paragraph.)\n\nTo contact the reporters on this story: Billy House in Washington at bhouse5@bloomberg.net;Erik Wasson in Washington at ewasson@bloomberg.net\n\nTo contact the editors responsible for this story: Joe Sobczyk at jsobczyk@bloomberg.net, Anna Edgerton\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- The House of Representatives is set to take its first vote to support the ongoing impeachment inquiry of Donald Trump, a move that aims to nullify Republicans’ main complaint that the process is illegitimate.“We are taking this step to eliminate any doubt as to whether the Trump administration", "authors": ["Billy House", "Erik Wasson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/8Tp5IJJT4SC5YPE9GEulCQ--~B/aD0xNTAwO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/8b2e72a8f1b8b5a8b5c8d20f69f7bbc5", "published_at": "2019-10-28"}