{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7558519/NBA-clamps-Free-Hong-Kong-protests-security-guards-confiscate-signs-exhibition.html", "downloaded_at": "2019-10-10 15:23:45.907124+00:00", "title": "NBA clamps down on 'Free Hong Kong' protests AGAIN as security guards confiscate signs at exhibition", "language": "en", "text": "Washington Wizards security confiscated protesters' 'Free Hong Kong' signs on Wednesday, marking the second consecutive day such placards were seized at an NBA arena amid the embattled league's growing tensions with China.\n\nProtester Jon Schweppe posted videos on Twitter showing three associates dressed in 'Free Hong Kong' T-shirts having their signs confiscated by Capitol One Arena security at Wednesday night's game against the visiting Guangzhou Loong-Lions of the Chinese Basketball Association.\n\nSecurity also confiscated a sign from the group reading, 'Google Uyghurs,' which is a reference to an aggrieved minority in western China.\n\nIn a statement, the Wizards insisted that the team was not taking a stance on the issue, but merely executing a long-standing policy.\n\n'The building security staff removed signs tonight in accordance with Capital One Arena's long-standing signs, banners, posters and flag policy,' read the statement. 'No fans were asked to leave the game.'\n\nOn Tuesday night, a couple attending a Philadelphia 76ers preseason game against Guangzhou had its 'Free Hong Kong' signs confiscated.\n\nThe NBA has targeted the prized Chinese market more than any other American professional sports league, but that relationship has become frayed since Houston Rockets general manager Daryl Morey recently tweeted his support for Hong Kong protesters.\n\nThe NBA has not apologized for Morey's social media post, which has since been deleted, but the league has taken criticism for its perceived kowtowing to China.\n\nWashington Wizards security guards confiscated signs reading 'Free Hong Kong' and 'Google Uyghurs' amid the NBA's dispute with China over Daryl Morey's support for anti-China activists\n\nProtester Jon Schweppe posted videos on Twitter showing three associates dressed in 'Free Hong Kong' T-shirts having their signs confiscated by Capitol One Arena security at Wednesday night's Washington Wizards game against the visiting Guangzhou Loong-Lions of the Chinese Basketball Association. Security also confiscated a sign from the group reading, 'Google Uyghurs,' which is a reference to an aggrieved minority in western China\n\nActivists hold signs in support of Hong Kong before the game between the Washington Wizards and the Guangzhou Loong-Lions at Capital One Arena\n\nAlthough neither confrontation was heated, two arena officials confiscated protester signs reading 'Free Hong Kong' and 'Google Uyghurs' during Wednesday's exhibition in Washington\n\nAlthough the tweet has been deleted, the controversy has clouded a pair of Nets-Lakers preseason games, the first of which was played on Thursday. Many Chinese corporations have suspended their business ties to the NBA while various local media outlets announced changes to their immediate and future coverage plans for the league.\n\nFans arriving at the arena to watch - many of them donning NBA jerseys - were handed small Chinese flags to carry with them inside, and at least one person carried a sign critical of NBA commissioner Adam Silver.\n\n'I understand that there are consequences from that exercise of, in essence, his freedom of speech,' Silver said at a news conference in Tokyo earlier this week. 'We will have to live with those consequences.'\n\nSchweppe, who works at a conservative Washington-area think tank, posted a video from Wednesday's exhibition with a caption reading: 'Just had our \"Free Hong Kong\" sign confiscated at Capitol One Arena at the Wizards game against the Guangzhou Long Lions. #FreeHongKong #NBA #Censorship.'\n\nThe video shows a man approaching the group during the national anthem and asking them to remove their 'Free Hong Kong' sign.\n\n'Free Hong Kong' shits have appeared at NBA games in Washington (pictured) and Philadelphia\n\n'We understand; we respect your freedom of speech; we just don't have any stance on that, so we're just asking,' the arena official said before his voice trailed off.\n\n'We're going to have to take it,' he added as he folded the white sign and walked away.\n\nDespite losing their first sign, the group remained seated along the baseline.\n\nHouston Rockets GM Daryl Morey apologized on Monday for the now-deleted tweet in support of the Hong Kong protests\n\n'We are currently standing tall behind the basket with our Free Hong Kong shirts on,' Schweppe wrote on Twitter. 'We were told if we do another sign we will be removed. Standing tall in our tshirts.'\n\nThe group did produce another sign – this time taking aim at the Chinese government's treatment of the Uyghur population.\n\n'So far we are allowed our 'Google Uyghurs' sign,' Schweppe then tweeted. 'They seemed annoyed with it.'\n\nThat did not last long.\n\nAnother arena official approached the group and asked for the sign to be removed.\n\n'We're not allowing any political signs,' he said. 'This is about basketball.'\n\nOne member of the group protested that he was simply encouraging people to educate themselves about the Uyghurs.\n\n'Do you know what a Uyghur is?' the spectator is seen asking the arena official in Schweppe's Twitter video.\n\n'I'm not having this conversation,' the official replied.\n\nPeople hold the Chinese flag (left) and a protest banner (right) in reference to a controversial tweet last week by Rockets general manager Daryl Morey ahead of Thursday's Nets-Lakers preseason game in Shanghai\n\nAlthough Morey has since deleted it, the tweet caused the NBA a torrent of negative within the prized Chinese market, which is reportedly worth over $4 billion to the league\n\nThere were a handful of other disruptions as well.\n\nAfter the playing of the Chinese national anthem, one fan shouted, 'Freedom of expression! Freedom of speech! Free Hong Kong!' Another fan shouted for a free Hong Kong from the second level during the second quarter.\n\nMinutes later, security approached one fan holding up a 'Free Tibet' sign and another holding the Tibet flag. Security tried to take the sign, and the fan refused to give it up. Security then followed them from their seats and out of the lower bowl.\n\nWizards coach Scott Brooks said that he heard one protester at the end of the Chinese national anthem.\n\n'Other than that, I didn't hear it,' Brooks said. 'I was focused on the game.'\n\nBrooks said he didn't hear any of his players talk about the protests and he never mentioned it to his players.\n\nA fan is seen wearing a LeBron James jersey with an NBA logo covered by a Chinese national flag sticker during the game\n\nA man hands out national flags to others arriving for the NBA preseason game to be held at the Mercedes Benz Arena in Shanghai, China. All media events such as news conferences have been canceled inside the arena hosting Thursday's NBA preseason game in China between the Los Angeles Lakers and Brooklyn Nets, though the matchup itself was still played\n\nThursday's preseason game between the Nets and Lakers was played in Shanghai, but all media availability was cancelled amid rising tensions between the NBA and China\n\nIn recent months, criticism has grown over China's internment of the Uyghurs and members of other predominantly Muslim ethnic groups.\n\nChina's government insists the detention sites are 'vocational' centers aimed at training and skills development. It has sharply criticized 22 Western countries that called for an end to mass arbitrary detentions and other abuses of Uyghurs and other Muslims in the Xinjiang region.\n\nIn a report earlier this year to counter criticism of internment camps and other oppressive security in the traditionally Islamic region, China said it had arrested nearly 13,000 people it described as 'terrorists' and had broken up hundreds of 'terrorist gangs' in Xinjiang since 2014.\n\nFor years China has been criticized for its occupation of Tibet and, more recently, for the imposition of new extradition laws in the former British colony of Hong Kong, where millions have lined the street in protest.\n\nLaunched in 2008 to run the league's business in the country, NBA China is now worth more than $4 billion, according to Forbes.", "description": "Washington Wizards security guards confiscated signs reading 'Free Hong Kong' and 'Google Uyghurs' amid the NBA's dispute with China over Daryl Morey's support for anti-China activists.", "authors": ["Alex Raskin Sports News Editor For Dailymail.Com", "Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/14/19538248-0-image-a-2_1570713632714.jpg", "published_at": "2019-10-10"}