{"pub": "washingtonpost", "url": "https://washingtonpost.com/news/magazine/wp/2019/09/16/feature/meet-the-new-wave-of-female-builders", "downloaded_at": "2019-09-28 21:33:23.075298+00:00", "title": "Meet the New Wave of Female Builders", "language": "en", "text": "Angela Cacace’s career began with a magazine contest. The D.C. barber had moved to North Carolina for her husband’s job and so successfully remodeled their kitchen that she won a contest in This Old House. Encouraged by the story’s editor to pursue her contracting dreams, she enrolled in a local building program. “I was so nervous on the first day of class,” she recalls, “but six of the 12 students were women — I was blown away. I remember an instant feeling of confidence that we had a place here.”\n\nShe posted on Facebook about the number of women in the class, adding, as a joke, #MoveOverBob. “Every woman I knew fell in love with it,” says Cacace, 32, explaining that the hashtag was inspired by cartoon character Bob the Builder and isn’t about replacing men but simply asking them to make a little room. (In the interest of gender equality, Bob’s creators have since given his sidekick Wendy a promotion to electrical engineer and business partner.) That hashtag would grow into a Facebook page, a website and an Instagram handle featuring photos of women doing demo, laying tile and wielding sledgehammers.\n\n(Double-exposure photo of builder Angela Cacace by Madeline Gray)\n\n“There’s a demand in the field, and women want to fill the void. Normalizing it seemed like a fun thing to do,” Cacace says. “Young people need resources at their fingertips, and #MoveOverBob has been a great way to find other women. It can get lonely being a woman in construction.”\n\nIn those first years, “I was doing a lot of free work … while keeping my barbering job,” she recalls. “Even though I’d taken the classes, I lacked the confidence in pursuing paid work. That was the attitude of a lot of the women in the class. The guys were there to get into the workforce, and the women were there to learn with no expectation of actually getting a job when we were done.”\n\nIt took two phone calls, Cacace says, one from a male classmate and friend and the other from her teacher, “both telling me that they believed in my abilities and I needed to stop working for free, quit barbering and get to work in construction,” she says, before she made contracting her full-time focus. “I still find myself doing work for free — part of that comes from my customer service background of always wanting to go the extra mile — but, unfortunately, the other part of it is a lack of confidence in my place in the industry. Like, to make up for being a woman I have to give a little more.”\n\nAngela Cacace: Before she launched her company, A. Marie Design Build, in 2017, Cacace balanced free contracting work with her barbering job. (Madeline Gray for The Washington Post)\n\nAnd even though she’s owned her own company, A. Marie Design Build, for a couple of years now (she launched it in 2017), she still faces pro departments at big-box stores trying to direct her to customer service before she can even tell them she has a pro account. “It can be deflating to be excited about starting the workday, pulling up with my truck to pick up lumber for a job and then having to deal with condescension. But I’ve gotten better about shrugging it off.”\n\nInspiring women to connect has helped her, too. About a year after launching her firm, Cacace became a mother. “I’d have to leave the job site to find a random parking lot and sit in my truck, covered in dust, and pump. It was pretty awkward,” she says, laughing at the ridiculousness of it all. “But I remember looking at my phone, seeing women using #MoveOverBob and thinking, Yay!” In that moment, Cacace realized she had created a place where her equally isolated colleagues could connect. “They were telling each other not to be discouraged, and even asking each other for work clothing recommendations. It was awesome.”\n\nWomen still make up only about 9 percent of the construction industry, according to the Bureau of Labor Statistics, so the isolation is real. It’s a vulnerability that has also led to intimidation and harassment, even assault. But a new wave of female contractors is creating a community for themselves to fight the loneliness that comes along with being a small minority in the field. They are also hoping to inspire women coming up behind them, to build a support system they don’t feel they had. “There’s an older generation of kick-ass women,” says Cacace, “but there’s a generation gap in construction because of a lack of encouragement.”\n\nRachel Street: She began fixing up houses to sell and now has two TV shows. (Daniel Seung Lee for The Washington Post)\n\n“Through social media I can connect with other women doing the same things; we can exchange ideas and vent about difficult moments,” says Rachel Street, 35, of the Street Group, who started renovating homes in Philadelphia after sinus surgeries brought her back from Italy and a burgeoning opera career. “I fixed up my first house, and people started asking me to do theirs,” she explains. She got her contracting and real estate licenses and started fixing houses to sell. She also got a reputation for cleaning up other contractors’ shoddy work and became an in-demand choice for female and LGBTQ clients who felt safer in her company. “I lean into communities of people who feel that hiring a contractor is stressful,” she says. “It’s different when I come in the door.”\n\nBut the job wasn’t always easy. “I was really self-conscious about being a contractor at first,” she says, recalling changing out of her work clothes before leaving a job site. “People look at you differently when you’re covered in dirt. And I felt nervous entering supply houses in South Philly. It’s generations of men-run businesses, and some were pretty rough, pretty disrespectful. It was discouraging.” Now though, “I’ve got credibility and those same guys are my best buddies. They even load the truck for me.”\n\nHer work and Instagram presence soon got the attention of a television producer who contacted her about creating a show. The result was DIY Network’s “Philly Revival” (she also has a new HGTV show, “Philly Street Flippin’ ”), and it had unexpected reverberations. “I’ve been contacted by women starting in construction. They really feel empowered by seeing the show. It’s all about authenticity and showing as much as possible in the episodes. I’m really there doing it,” Street says. “It’s important to show women being physical. The more people see female faces, the more normal it becomes.”\n\nThe changes aren’t lost on Sarah Tull, who, as president of the D.C. chapter of the National Association of Women in Construction, has an up-close view of the business. “The industry has become much more open to women, and I’m seeing more on building sites, in meetings and in the trades,” she says. And it’s a trend reflected in the association’s numbers: 4,845 members across the United States, with 119 regional chapters and six new locations in development. The D.C. chapter alone has grown more than 200 percent in the past four years.\n\nThe association provides a community, or “a safe place,” as Tull, 42, puts it, in a more traditional, face-to-face format, but its leaders hope to begin boosting their online presence. (Staffed primarily by volunteers, most of whom are working mothers, the group has a labor shortage of its own.) Its annual event, Women in Construction Week, is now better known by the hashtag #WICWeek. In the past two years, #WICWeek posts on Instagram have gone from 147 to 1,662.\n\nFemale architects, too, are championing the arrival of more women in the field, especially general contractors. “The most difficult issue to overcome is people’s misconceptions that women’s work is of less value,” says New York architect Anik Pearson, 47, who has witnessed female contractors repeatedly offer lower quotes than their male competitors. “I want women to prove the misconceptions wrong. And I want clients to pay them a fair price for their work,” she says.\n\nJean Brownhill: The former architect founded Sweeten, a service that matches clients and contractors, and launched an initiative to help female contractors network and gain greater visibility. (Jonathan Hanson for The Washington Post)\n\nFormer architect Jean Brownhill, 42, founder of New York City client-contractor matchmaking service Sweeten, hopes to see the same. Just this summer, she launched the Sweeten Accelerator for Women initiative to provide her roster of female general contractors with greater visibility via its own website, as well as mentorship and educational opportunities. “There’s a demand for them, and the digital platform we’re building can help distribute work equally,” says Brownhill, adding that the narrative around what a general contractor is needs to change. “A contractor isn’t just a big guy swinging a hammer. The job is more about organization, logistics and the deployment of resources. It’s a great career path for women who want to start families or who have an interest in interior design.”\n\nDenise Hernandez hadn’t considered construction as a career until her father asked her and her siblings whether they would like to take the reins of the family business, Hernandez Cos. in Phoenix, upon his retirement. The company began with her father selling plumbing parts out of his truck in the 1970s, something she helped with during childhood summers. With her now at the helm of its financial side, the firm is 60-employees strong and holds commercial contracts with major clients, including the city of Phoenix, Bank of America, PepsiCo and Sky Harbor International Airport. “In my role, I get to see both sides of the company, financial and operational,” she says. “I’d love to see more women in all the trades, absolutely, but also in the offices and on the project management side, like me.”\n\nLately, she, too, has been seeing more women joining the field. “More and more women are graduating from Arizona State University’s construction program. They’re doing a really good job at presenting construction as an opportunity,” she says. “There’s a lack of knowledge that it’s even possible for a woman to be a contractor.” Hernandez, 51, is convinced that “networking is the number one thing young women should do. Build relationships so you’re not afraid to ask for help.”\n\nDenise Hernandez: She oversees the financial side of her family’s construction business. (Dominic Valente for The Washington Post)\n\n“My entire office is women who have found me on Instagram or my blog, or by hearing me speak,” says Joan Barton, 51, of Dirty Girl Construction in Los Angeles, adding that even more women have been calling in the past year. “Construction is intense, but women are really amazing business people. We’re multitaskers, we’re artistic and we can spin our talents into things. There are a million moving parts to building a home, and everything has to be in rhythm.” A former composer, Barton got into the construction business by going to work for a contractor friend when the music industry went digital. “I wrote music for TV commercials. I worked 10 years to get there. Then it crashed. They didn’t need orchestras anymore and I didn’t want to sell out.”\n\nMany of the women calling her have gone through career shifts, too, coming from backgrounds in interior design and architecture but also film, fashion and sculpture. “Usually something I’ve written resonates with them, whether that be my history, my honesty or my perspective,” says Barton, adding that she wants to use her online presence to “connect and elevate people, and to demystify the process of coming into your own.”\n\nRuth Black of Ruins to Renovation (RTR) Design Build in Los Angeles also found construction as a second career. After a writers’ strike ground film projects to a halt, Black, now 54, fell back on her talent for fixing up houses, something she learned from her parents. “Women contractors have to be willing to make their own way and to change the trajectory of what men have defined. I’m older, remember; I missed the whole tech thing. I literally just learned there were stories on Instagram and how to make one!” she says. “I wish so much there had been this road map out there for me when I started, to even know that a career like this is possible.”\n\nTo combat her feelings of isolation, Black has embraced a wider community by listening to podcasts such as “On Being,” “With Friends Like These” and “The Tim Ferriss Show” as she travels between job sites, often sitting in L.A. traffic. “Role models are everywhere,” she says. “We just need to open our eyes.”\n\nCacace is proud of the work she’s done organizing and connecting women to elevate their ranks in the construction industry. But she and other women in the trades say what’s really needed is for trade-skill classes to be returned to schools. After all, the world needs plumbers just as much as it needs doctors. “We have a culture of college degrees, but it’s just leading to debt. Meanwhile, people in the trades are doing okay. I have to turn work down now,” Cacace says.\n\n“Trades have been pushed to the sides or are seen as lesser options, but right out of school you can start making upwards of $60,000,” echoes Street.\n\n“Get home economics back into schools,” Barton says. “Let’s give kids the skills they need for basic household management: how to fix a drain, how to balance accounts, how to afford their lives. Put tools in their hands and get them outside.”\n\nFor the time being, these women are doing what they can at the grass-roots level.\n\nJoan Barton: “Construction is intense, but women are really amazing business people,” says the founder of Dirty Girl Construction in Los Angeles. (Oriana Koren for The Washington Post)\n\nBarton is starting “Women on Women,” workshops for women in construction and other atypical vocations. (“It’s a chance to tell our secrets, to pass on our knowledge,” she says.)\n\nHernandez is on the board of her local Habitat for Humanity.\n\nCacace, an avid carpenter, hopes to convert her home workshop into a place where she can teach introductory wood shop classes.\n\nBlack is involved with youth-focused organizations P.S. Arts and Covenant House, which respectively provide arts education and shelter services, and gives teenagers job site experience. (“The kids who don’t sit still, who maybe don’t learn the way our education system teaches.”)\n\nStreet recently worked with trade-skill program Generation T to help kids build doghouses for Boston-area shelters. “They learned how to cut wood and use a nail gun. It was really interesting to see girls shying away at first but then gaining confidence.”\n\nAnd after reading an American Institute of Architects survey that reported young female architects abandoned their careers in part because of a lack of role models, Pearson, too, is ringing the bell for mentorship with a new seminar series, “Women Entering the Profession of Architecture,” that connects emerging and experienced practitioners.\n\nIn the face of all the IRL community-building, a hashtag might seem like such a small thing. For Cacace, it was just the start. “I hope young women will find #MoveOverBob and think, ‘Maybe I’ll do that!’ ” she says. “I just want to let people know we’re out here doing it and enjoying it, and that men are supporting us. I’ve been as surprised by men’s willingness to make room for me as they’ve been surprised to see me arrive on a job site. But it’s becoming less of a surprise now. Normalization is power.”\n\nMaile Pingel is a design historian and writer in Los Angeles.", "description": "A minority in their field, women in construction are establishing a support system they don’t feel they had.", "authors": ["Maile Pingel"], "top_image": "https://www.washingtonpost.com/pbox.php?url=http://www.washingtonpost.com/news/magazine/wp-content/uploads/sites/69/2019/09/construction_share.jpg&w=1484&op=resize&opt=1&filter=antialias&t=20170517", "published_at": "2019-09-16"}