{"pub": "metro", "url": "https://metro.co.uk/2019/10/11/dortmund-hope-keep-jadon-sancho-two-seasons-longer-admit-england-star-leave-big-club-10899614", "downloaded_at": "2019-10-11 08:15:15.233115+00:00", "title": "Manchester United transfer news: Jadon Sancho could leave for 'very big club', admit Dortmund", "language": "en", "text": "Jadon Sancho remains a target for Manchester United (Picture: Getty)\n\nDortmund assistant manager Jorg Heinrich insists the club want to keep Jadon Sancho but admits it will be hard to resist interest from ‘very big clubs’.\n\nThe England international has thrived in the Bundesliga since leaving Manchester City for Dortmund in 2017.\n\nMetro.co.uk exclusively revealed in January that Ole Gunnar Solskjaer had identified Sancho as the player to front his overhaul at Old Trafford but United’s failure to qualify for the Champions League scuppered the club’s chances of landing the winger.\n\nUnited remain interested but Sancho’s value has continued to soar and they’re likely to encounter competition from clubs in far more attractive positions should they move for the winger again this summer.\n\nDortmund have shown in the past that they have a price for all of their players and though Heinrich insists the club want to keep Sancho for another 18 months, he admits it will be tough.\n\nSancho’s value has soared in recent months (Picture: Getty)\n\n‘Jadon can become one of the best players in Europe, or even the world,’ Heinrich told Omnisport.\n\nAdvertisement\n\nAdvertisement\n\n‘It won’t be easy to keep him at Dortmund. We hope he plays one or two seasons longer but we all know very, very big clubs with a lot of money want to have him in their team.\n\n‘He should know Dortmund is an excellent place for young players to play consistently and to develop on a very, very high level.’\n\nUnited’s pursuit of Sancho could come down to the future of Solskjaer.\n\nThe club have made a dismal start to the season, winning just two of their eight Premier League matches and scoring just five times since the opening weekend 4-0 win against Chelsea.\n\nThe club’s board accepted last season that turning the club around would be a long-term issue and they want to give Solskjaer time but there’s a fear results could get even worse.\n\nMORE: Sven Mislintat explains how Pierre-Emerick Aubameyang’s attitude cost him a transfer to Real Madrid or Barcelona", "description": "Dortmund assistant manager Jorg Heinrich insists the club want to keep Jadon Sancho but admits it will be hard to resist interest from 'very big clubs'. The England international has...", "authors": ["Metro Sport Reporter"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/09/GettyImages-1171757897_1570780569.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-11"}