{"pub": "rt", "url": "https://rt.com/sport/470646-football-fan-ban-player-breast", "downloaded_at": "2019-10-10 18:54:30.767823+00:00", "title": "‘Violation of human dignity’: Football fan faces lifetime ban for groping female player’s breast", "language": "en", "text": "Mexican women's football club Tigres UANL have threatened to impose a lifetime stadium ban on a fan who “offended” a female player by touching her breast during a post-match selfie with spectators.\n\nClub representatives have also promised to take legal action against the male supporter whose behavior “violated human dignity.”\n\nREAD MORE: ‘Just a joke’: Italian TV presenter DEFENDS fans who chanted ‘get your boobs out’\n\nThe controversial incident took place after a friendly game between Mexican champions Tigres UANL and American side Houston Dash last Saturday.\n\nRight after the game, Houston Dash midfielder Sofia Huerta went into the crowd to greet fans and take pictures with them.\n\nWhile she was taking a selfie with the spectators a man standing behind her appeared to place his left hand on her breast.\n\nAyer después del @TigresFemenil 🆚@HoustonDash, vimos a este “aficionado” siendo nefasto al\n\ncomportarse de esta manera con una jugadora, aprovechando su disposición a sacarse una foto😠\n\nMiren la mano de este tipo sobre @schuerta😡(y no, no fue “sin querer”)\n\n¡ESO NO SE HACE! pic.twitter.com/nCVW4i9ePq — Fut Femenil⚽️ (@futfemenilmx) October 6, 2019\n\nThe embarrassing moment was captured on camera, forcing the Mexican club to open an investigation in an attempt to identify the man who they think intentionally groped Huerta’s breast.\n\nThe Tigers apologized to Huerta and her family for the \"regrettable experience\" she suffered.\n\n\"Once the so-called fan has been identified, he will be prohibited for life from entering any of our facilities and any women's or men's matches,\" the club said in a statement.\n\nAlso on rt.com ‘Get them out!’ Italian football fans beg journalist to flash – and she has the ideal response (VIDEO)\n\n\"At Tigres, we are fully committed to eradicating in our stadium and in our community any form of harassment or situation that violates human dignity or seeks to intimidate, degrade or offend women.\n\n\"As a result of the events that took place on Saturday, in which a so-called fan presumably violated the dignity of the Houston Dash player at the end of the game, we have decided to take action regarding this action. We will be filing a lawsuit against whoever was responsible for this event.\"", "description": "Mexican women's football club Tigres UANL have threatened to impose a lifetime stadium ban on a fan who “offended” a female player by touching her breast during a post-match selfie with spectators.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5d9f6e5985f54009466f44d6.png", "published_at": "2019-10-10"}