{"pub": "yahoo", "title": "5 dead, 21 wounded in mass shooting in Midland-Odessa, Texas; shooter killed", "url": "https://news.yahoo.com/police-searching-two-active-shooters-215743391.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-03 00:58:16.675902+00:00", "text": "At least five people were killed and 21 injured in Midland-Odessa, Texas, after a routine traffic stop triggered a deadly shooting rampage that ended when the gunman was slain by officers, police said.\n\nThe incident began at 3:13 p.m. CDT when an assailant described by authorities only as a white male in his mid-30s driving a gold-colored car was pulled over by a pair of state troopers on Interstate 20 for a traffic violation, the Texas Department of Public Safety said.\n\nBefore coming to a stop, the man grabbed a rifle and shot multiple times at the pair of troopers through the rear window, wounding one. He then sped off, shooting at other motorists and passers-by. At one point, he changed to a U.S. Postal Service truck.\n\nVideo: 5 Tactics to Improve Your Chances Against a Shooter\n\nBesides the initial trooper who was shot, two others were wounded as well, Texas DPS said, The gunman himself was killed after a chase involving officers from both Midland and Odessa, two cities within miles of each other.\n\nThe tragedy shattered an otherwise quiet holiday weekend in West Texas and became the latest mass shooting after others this summer in El Paso, Texas; Dayton, Ohio; and Gilroy, California.\n\nTexas Gov. Greg Abbott said in a statement that he would be traveling to the area on Sunday.\n\n\"I want to remind all Texans that we will not allow the Lone Star State to be overrun by hatred and violence,\" said Abbott.\n\nJust briefed by Attorney General Barr about the shootings in Texas. FBI and Law Enforcement is fully engaged. More to follow. — Donald J. Trump (@realDonaldTrump) August 31, 2019\n\nThere have been 280 mass shootings in 2019, as defined as involving four or more people injured or killed, excluding the perpetrator, according to the Gun Violence Archive, a non-profit that tracks such incidents,\n\nTo date, including this shooting, 602 people have died in mass shootings in 2019 and 2,356 have been injured.\n\nContributing: San Angelo (Texas) Standard-Times\n\nThis article originally appeared on USA TODAY: Odessa, Texas, active shooter: 5 dead, 21 wounded in Midland\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "description": "At least five people have been killed and 21 injured in Midland, Texas. The shooter was shot and killed by police. The incident started with a traffic violation. The driver opened fire on the officer and fled the scene.", "authors": ["Olivia Sanchez", "Marco Della Cava", "Chris Woodyard", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/RiE89jZ.nWlrXr6oQqE9Ug--~B/aD0xNTkxO3c9Mjk1MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/03df2165b531d4efcd36943180a2511a"}