{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/nationals/deal-them-in-nats-sweep-phillies-clinch-nl-wild-card/2019/09/24/3a788a44-df3b-11e9-b199-f638bf2c340f_story.html", "downloaded_at": "2019-09-25 04:36:13.710770+00:00", "title": "Deal them in: Nats sweep Phillies in doubleheader, clinch NL wild-card spot", "language": "en", "text": "The Nationals celebrate their clinching of a playoff spot Tuesday after they completed a doubleheaders sweep of the Phillies and the Pirates beat the Cubs in Pittsburgh. (John McDonnell/The Washington Post)\n\nWhen they won, when it was almost official that a once-lost season would end with at least one postseason game, the Washington Nationals could only look up at the giant videoboard and wait.\n\nThey had done their part. Now they needed the Pittsburgh Pirates to record one more out, beat the Chicago Cubs and, by doing so, give Washington one last nudge into the playoffs. They stood and watched. So did the crowd. The Nationals high-fived and hugged, a bit prematurely, but didn’t celebrate until the end of another game\n\nThen it was over in Pittsburgh. The Nationals were in, following a 6-5 victory over the ­Philadelphia Phillies at Nationals Park, capping a doubleheader sweep Tuesday that clinched their spot in the ­National League wild-card game. They won the first game, 4-1, in the afternoon. Their two wins, combined with the Cubs’ seventh straight loss, were the final results needed to secure the Nationals a fifth playoff berth in eight seasons.\n\n“It was awesome. It was weird,” closer Sean Doolittle said, standing in an uncorked clubhouse after the win, of watching the Cubs lose from the field. “We didn’t know what to do, obviously. Some guys wanted to watch in here, but I know we didn’t want to miss a second of it. That was . . . ”\n\nDoolittle never got to finish that sentence. Javy Guerra, who pitched a scoreless eighth inning in the second victory, poured a bottle of champagne on his head. Then Doolittle pulled on goggles before he was sucked into a celebration.\n\nThere was a point earlier this season, some four months ago, when none of this seemed possible. Not clinching a postseason berth. Not soaking the clubhouse in alcohol. Not playing past the last day of the regular season, or for anything but paychecks and pride.\n\nWhen the Nationals left New York on May 23, after they were swept in four games by the Mets, their record stood at 19-31. If you peeked onto social media then, or read anything within reach, the season was dead in the water. Manager Dave Martinez was getting fired. The team’s best players were on the trading block. This season, a campaign that began with World Series aspirations, had turned into a steppingstone to 2020. ­Maybe, the thinking went, Washington should start planning now. And maybe, at the time, it wasn’t such a bad idea.\n\n[Boswell: The Nats earned their spot in the postseason, but they still have unfinished business]\n\nBut something changed for the Nationals after that series. They got healthy, for one, and finally had Trea Turner, Anthony Rendon and Juan Soto in the same lineup. Their starting pitching continued to dominate. Their bullpen, historically bad through 50 games, became passable and blew fewer leads. That combination, however twisted, was enough to make them the best team in the majors from May 24 to Sept. 1. It was enough for the best 80-game stretch in club history, 54-26, and enough for the front office to acquire three relievers at the trade deadline.\n\nOnce the Nationals looked up in September, even during a trying stretch, their terrible start was only felt in the standings. It kept them from competing with the Atlanta Braves in the National League East. It will ultimately lead them to the wild-card game Oct. 1 — most likely against the Milwaukee Brewers — funneling their aspirations into a proverbial coin flip. But most of their expectations had been met. Martinez is still the manager. Max Scherzer, Rendon and Doolittle, all speculated to be cast off as trade pieces around Memorial Day, are still key to their chances in October. A chance is all Washington ever wanted.\n\n“It’s gratifying to see how these guys really took to the program and really all bought in,” General Manager Mike Rizzo said in the clubhouse Tuesday night. “It’s really a remarkable thing when you can be playing that poorly and still keep your head up and stay together as a unit.”\n\nScherzer started Tuesday and gave up four runs in six innings. When he exited, the Nationals trailed 4-2. But that’s about when the Cubs fell behind in Pittsburgh. The Nationals Park crowd cheered as the out-of-town scoreboard showed the Pirates’ push. It got even louder when the Pirates’ lead grew. The fans could feel a clinch was on the way.\n\n[In Nationals’ clincher, Max Scherzer’s uneven outing offers more questions than answers]\n\nThen Turner made that possibility real. The shortstop came up with the bases loaded in the sixth. He ripped a grand slam into the Phillies’ bullpen, 378 feet, the veins popping from his neck once he rounded first base with a full-throated yell. The fans got louder, and louder still, and their cheers only dissipated after Turner stepped out of the dugout for a curtain call. He whipped his hand through the cooled air to ask for one more roar. He received it — all of the Nationals did — and the bullpen soon recorded the final nine outs to trigger one final ovation.\n\n“You just scream. I don’t even know what to do other than scream,” Turner said of his reaction. “We knew what was on the line.”\n\nThat’s why Scherzer was gripping Kurt Suzuki’s beer-soaked neck in the clubhouse an hour later, telling him he loved him, promising the catcher that the Nationals were going to play deep into October. The players danced in puddles of alcohol, danced along the ­plastic-lined floor, danced past 11 p.m. once their wives and friends were invited to the party.\n\nThere were buckets of Budweiser. There were buckets of Bud Light. There were three types of champagne, all of it used, and bottles of Welch’s grape juice cocktail because Martinez can’t drink alcohol following a recent health scare. Rizzo poured the Welch’s on Martinez’s head — “Is that the juice? It better be the juice!” Martinez joked — and the manager shut his eyes while it poured over his face. Scherzer looked at the room, at the team he has so often put on his back across four seasons, and smiled before sipping champagne and ­offering a prediction to Suzuki.\n\n“We did it. We did it in a [expletive] doubleheader!” Scherzer yelled into Suzuki’s ear. “That means we can do anything!”\n\n“I hear you, brother. I hear you,” Suzuki said, calm amid the madness, cocking his head to the side to avoid flying foam.\n\n“Do you, Zuk?” Scherzer asked, even louder now, before letting out a big laugh. “We clinched, baby!”\n\nThat’s how it went while the alcohol ran out. Adam Eaton and Brian Dozier misplaced their shirts along the way. A conga line was led by 35-year-old starter Aníbal Sánchez. Almost everyone joined. And there was Martinez in the middle of the room, drenched next to a pair of folding tables, saying he knew this team had this in it all along. His voice was hoarse from screaming. It caught a few times, and he couldn’t stop blinking while trying to explain what this moment meant for him and his club.\n\nMaybe he was blinking back tears. Maybe the juice was stinging his eyes. Maybe this won’t be the last time these Nationals soak a clubhouse, he thought, and for one night that was enough.\n\n“They want to keep playing. They don’t quit,” Martinez said. “They keep telling me how much they want to play for me, and I told them it’s not about me. It’s about us. Let’s play for us.”", "description": "Max Scherzer earns the win in the second game of the doubleheader, and the Pirates beat the Cubs to secure Washington’s postseason spot.", "authors": ["Jesse Dougherty", "Reporter Covering The Washington Nationals.", "September At Pm", "Jesse Dougherty Covers The Washington Nationals."], "top_image": "https://www.washingtonpost.com/resizer/k5XFKDCFwEYo_SmYGjheGN9pxfw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GBNVACW7HMI6TPT7JTEFAF6DN4.jpg", "published_at": "2019-09-24"}