{"pub": "investing.com", "url": "https://investing.com/news/economy/uk-finance-minister-pledges-infrastructure-spending-on-roads-buses-and-broadband-1988635", "downloaded_at": "2019-09-29 23:51:34.670595+00:00", "title": "UK finance minister pledges infrastructure spending on roads, buses and broadband", "language": "en", "text": "By William James\n\nMANCHESTER, England (Reuters) - British finance minister Sajid Javid will on Monday pledge to improve Britain's road, broadband coverage and bus services, setting out an investment package designed to win over voters before an expected early election.\n\nSpeaking at a Conservative Party conference dominated by Britain's planned exit from the European Union, Javid will try to shift the focus to issues that the party believes matter more to voters in the long run.\n\nHe will commit 5 billion pounds ($6.14 billion) to improving fast broadband access in harder-to-reach parts of the country, announce a strategy to improve bus services, and set out how billions already set aside for road improvements will be spent.\n\n\"Investment in our infrastructure will be key to making the next decade one of renewal – boosting our economy and making life easier for people all across the country,\" Javid will say, according to advance extracts of his speech.\n\nBritain is not scheduled to hold an election until 2022, but one is expected in the coming months as Prime Minister Boris Johnson's Conservatives have lost their majority in parliament and divisions over Brexit are paralyzing policymaking in other areas.\n\nAfter nearly a decade of deficit-reducing spending cuts under Conservative-led government, the recently-appointed Javid has adopted a less restrained approach to the public finances, promising to rewrite the rules that underpin spending.\n\nThe new mechanism to define spending and borrowing limits has not yet been agreed, but is expected to allow higher levels of state-funded infrastructure investment.\n\nJavid, a 49-year-old advocate of free markets and the son of a bus driver, will devote a section of his speech to improving bus networks.\n\n\"The full benefits of our infrastructure revolution may not be felt for some time. But the work must start here and now,\" he will say.\n\nThe opposition Labour Party has also pledged to improve bus services as both parties look for policies beyond Brexit that will help them pick up votes in what is expected to be a tight and unpredictable election.\n\nPolling firm Opinium said Labour gained 2 percentage points after its conference in Brighton last week, when it committed to a huge expansion of public spending, but the Conservatives still held a 12-point lead. Other polls have a much narrower gap between the two parties.", "description": "UK finance minister pledges infrastructure spending on roads, buses and broadband", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8S0W5_L.jpg", "published_at": "2019-09-29"}