{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/venture-capital-investor-quick-fix-direct-listing-save-ipo-flops-2019-10", "downloaded_at": "2019-10-12 13:00:56.028927+00:00", "title": "Silicon Valley's founder-led startups have lost their shine with IPO investors. But the obsession with direct listings won't fix the bigger problem.", "language": "en", "text": "After poor public performances by some of Silicon Valley's hottest private companies, venture capitalists are decrying the traditional IPO process in favor of direct listings.\n\nThe unconventional strategy for going public removes some of the more expensive and tedious processes associated with going public, and allows investors and employees to bypass a traditional lockup period following a public debut.\n\nMany VCs blamed banks for overinflating share prices ahead of an IPO to profit off the fees they collect, but VCs stand to directly benefit themselves from a direct listing because they are able to sell at the opening price.\n\nDirect listings are marketed to founders as a cheap, fair alternative to founders looking to make a public exit, but that is not always the case.\n\nSome investors told Business Insider that a direct listing would be ideal for founders that want to avoid the scrutiny of an investor roadshow that precludes a traditional IPO.\n\nCheck out Business Insider's special series — Founder Frenemies — for more stories on Silicon Valley's changing landscape for startup funding.\n\nWith his long hair, proclivity for walking around barefoot and reputation for partying, WeWork founder Adam Neumann could have been straight out of central casting for a fictional \"tech CEO\" in a movie.\n\nThat over-the-top persona is also what made Neumann a liability for WeWork in the eyes of straight-laced, conservative IPO investors. Neumann never had the chance to meet, or spook, investors in a pre-IPO roadshow for WeWork— he was ousted from the CEO job the week the roadshow was supposed to kick off, and the IPO was subsequently shelved.\n\nWeWork's cancelled IPO is now at the center of a broader Silicon Valley reckoning, as venture capital investors and others obsess over an IPO alternative called a \"direct listing.\" The direct listing has been framed as a way for tech startups to list their shares without being beholden to an outdated process created by Wall Street bankers and designed to benefit their clients.\n\nBut direct listings are still a new, relatively untested concept that may not provide the all-around salvation some expect. And while venture capital investors bash an IPO system they say is broken, their sudden zeal for direct listings is, in at least one major sense, the result of a problem they created themselves.\n\nThe \"founder friendly\" movement in which VC investors deferred to startup founders, no matter how quirky or extravagant, has produced a crop of richly-valued companies with unconventional executives in the top job. And as many of these companies now look to go public, they're finding that an offbeat founder CEO is not always a selling point during a roadshow.\n\nA direct listing provides a convenient way to skip that conversation.\n\n\"When you do a direct listing, you don't have to put them up there,\" said one VC firm founder about inexperienced or unpolished management teams. \"There's a negative side that the VCs see, but they can hide it behind the direct listings,\" he said.\n\nIn a direct listing, a company simply lists its shares on a public exchange and the stock begins trading. There's no banks underwriting the offering, setting a price and selling it to institutional shareholders, as happens in an IPO. And while insiders, like VC investors and early employees, can sell shares right away in a direct listing, the company itself does not raise any capital.\n\nLise Buyer, the founder of IPO advisory firm Class V Group, describes direct listings as an interesting alternative to IPOs that will work for certain companies but that's currently wrapped in a lot of hype: \"It's the new shiny object that is aggressively and brilliantly marketed.\"\n\n\"Ride the positive narrative\" and avoid the hedge fund questions\n\nFor now, direct listings exist more in the realm of theoretical and wishful thinking than reality. To date, only two companies — Spotify and Slack — have opted to go public this way.\n\nBut according to a recent Bloomberg report, Airbnb, the home-sharing service valued at $31 billion, is leaning towards a direct listing instead of an IPO when it goes public in 2020.\n\nThat could help the company avoid uncomfortable questions about its management team's qualifications. Brian Chesky, the cofounder of Airbnb who serves as CEO, has a background in industrial design and has never held a high-level role at any other company. Although Chesky has grown Airbnb into a juggernaut, his public company experience, and lack of the traditional engineering or business background, would likely get a hard look during an IPO roadshow, the founder of the investing firm speculated.\n\n\"You could make a case for companies to just ride the positive narrative and just go out there with a direct listing because you don't want to answer all these extremely scrutinizing questions from some hedge fund guys,\" said Synovus Trust Company portfolio manager Dan Morgan about startups with novice or quirky CEOs.\n\nAirbnb CEO Brian Chesky Mike Segar/Reuters\n\nIn years past, a seasoned executive might have been brought on to take the reins as the startup neared its IPO. But with founders now revered, and in some cases calling the shots thank to special supervoting shares, many of the most valuable startups are helmed by founders who may or may not have the chops to run a public company.\n\n\"A CEO/Founder with a quirky personality would be fine to do a direct listing and avoid all the scrutiny of a road show,\" Morgan said.\n\nStill, he stressed, everything changes after company's first earnings call as a publicly traded organization. And in the case of WeWork, he believes that even a direct listing wouldn't have saved it from a brutal reception in the public markets: \"The model was not sound as there appeared to be no roadmap to profitability.\"\n\nThe times have changed and IPO \"needs innovation\"\n\nOf course, plenty of unorthodox founders have made it through the roadshow process and gone on to lead successful publicly-traded companies. Facebook CEO Mark Zuckerberg famously caused a stir by wearing a hoodie to the pre-IPO investor roadshow. Seven years later, the stock is up 374% and Facebook is worth $514 billion.\n\nAnd the two companies that have recently gone public through direct listings were not trying to hide unpolished or inexperienced CEOs from criticism. Slack founder and CEO Stewart Butterfield is one of the tech industry's most respected, serial entrepreneurs, with a track record that includes creating photo sharing site Flickr and selling it to Yahoo for $20 million in 2005.\n\nSlack had an optimal business model and enough brand recognition to pull off a direct listing in June, said Jyoti Bansal, a startup founder and tech investor who is a big believer in the potential of direct listings.\n\nSlack CEO Stewart Butterfield poses for photos outside the New York Stock Exchange before his company's IPO, Thursday, June 20, 2019. Richard Drew/Associated Press\n\nBansal attended a special, invite-only summit earlier this month devoted to the merits of direct listings. The event took place in San Francisco and was organized by several VC firms in the wake of the disappointing Uber and Peloton IPOs, and the WeWork implosion.\n\n\"The way the IPO is done today is almost like a 25-year-old concept. It just needs innovation\" said Bansal, who is the cofounder and CEO of enterprise startup Harness and cofounder of venture firm Unusual Ventures.\n\n\"Twenty-five years ago the primary purpose of IPO was that people didn't have access to growth capital, so you had to go to public markets to get growth capital. Now, everyone has it,\" he said.\n\nClass V's Buyer says the notion that direct listings are a cheaper and more democratic process than traditional IPOs is partially true. Since the company isn't raising funds, it doesn't need to work with a traditional underwriter and thus does not need to pay the associated fees. Still, she noted that a company must pay some banker fees, register with regulatory bodies like the SEC, and participate in an audit, all of which are costly undertakings.\n\nSpotify paid $32 million in fees for its 2018 direct listing, according to Inc, compared to the $102 million that Uber paid in its traditional IPO.\n\nNo lock-up is a big benefit — for some\n\nClearing the path to a liquidity event is critical for VCs who have sunk tens or even hundreds of millions of dollars into startups.\n\nBuyer also noted that direct listings — which allow employees to sell all their vested shares right away, without the traditional several month \"lock up\" period of an IPO — could incentivize valuable employees to cash out and jump ship.\n\n\"I don't think it helps with [employee] retention. It actually is perhaps the opposite,\" Buyer said of direct listings.\n\nAnd for recently-hired employees with unvested stock, a direct listing can leave them at a disadvantage if the stock sinks.\n\nIn the case of both Slack and Spotify, the companies achieved peak share prices in the first weeks or months of trading, and have only lost value since. That means early investors were able to cash out at near-peak pricing while employees with unvested stock and retail investors were left holding shares that were only becoming less valuable.\n\n\"Those who sold on Day One at Slack got a better price than those that sell today,\" said Buyer.", "description": "One expert said direct listings have been \"aggressively and brilliantly\" marketed to founders, but venture investors stand to benefit the most.", "authors": ["Megan Hernbroth"], "top_image": "https://image.businessinsider.com/5d0cee93e3ecba7f5e14e1c2?width=1200&format=jpeg", "published_at": "2019-10-12"}