{"pub": "cnbc", "url": "https://cnbc.com/2019/09/13/would-investing-1000-dollars-in-apple-or-netflix-have-made-you-richer.html", "downloaded_at": "2019-09-13 19:21:09.014343+00:00", "title": "Netflix vs Apple: Here's which stock would have made you richer if you invested $1,000 10 years ago", "language": "en", "text": "Of all the big tech companies investors tend to wish they'd jumped on early, Apple and Netflix certainly fall in the mix.\n\nWhen comparing the two side by side, Netflix would have made you more money if you invested a decade ago. A $1,000 investment in Netflix in 2009 would be worth nearly $47,400 as of Sept. 12, 2019, for a total return of about 4,640%, according to CNBC calculations.\n\nIf you put $1,000 in Apple during the same period, your investment would be worth nearly $10,400 for a total return of roughly 940%. By comparison, a $1,000 investment in the S&P 500 would have earned a total return of nearly 255% over the same period. While Netflix and Apple stocks have done well over the years, any individual stock can over- or underperform and past returns do not predict future results.\n\nThe difference between the two investments comes to more than $37,000.\n\nCNBC: Apple stock as of Sept. 13, 2019.\n\nThis week, Apple announced the launch of its Apple TV+ service, which will be available Nov. 1 in more than 100 countries and will cost $4.99 per month. Almost immediately, speculation began to swirl as to whether Apple TV+ will pose a threat to other rival streaming services, such as HBO, Disney and Netflix.\n\nPriced at $4.99, that's nearly half of the $9.99 price predicted by analysts. Given that Netflix increased prices by 18% at the start of 2019, from $10.99 to $12.99 for its standard plan, cost could end up being a deciding factor for users when choosing between the two.\n\nStill, opinions are split as to how Apple TV+ will impact Netflix performance. While both are programmed to provide ad-free entertainment, the actual content offered is very different. In contrast to Netflix, Apple TV+ won't have full-season shows, making it a less desirable choice than Netflix for binge-watching. Instead, Apple TV+ is launching with nine original series, and Apple confirmed that five more shows will be added in the months following launch. Most of the shows will premiere with three episodes, with new episodes dropping weekly, according to the Apple Newsroom.\n\n\"I think they are being very deliberate in the initial selections and the genres they have gone after, said Simon Gallagher, former director of content acquisition at Netflix, during a recent CNBC \"Squawk Alley\" interview. \"They have popular genres with absolute marquee, best-of-breed talent,\"\n\nHe added: \"You've seen with Showtime and HBO, it's only taken a couple of shows each season to encourage people to maintain their subscription, and I think Apple will absolutely be able to do that with the current lineup they have in place.\"\n\nCNBC: Netflix stock as of Sept. 13, 2019.\n\nWhile Apple's announcement did send Netflix stock down 2%, it's still too early to tell whether Apple's brand reach will be enough to win out against Netflix — especially since it's joining the streaming game so late.\n\nHowever, Apple's plan is to rely partly on the popularity of its devices to build a large TV+ user base. With select Apple devices, users will be gifted a full year of Apple TV+ for free.\n\nDespite the new competition, Netflix has seen strong app performance and recently announced a whole slew of original TV shows and movies set to release in late 2019.\n\nGoing forward, the real challenge will be Netflix's ability to maintain subscribers and help its stock bounce back. Since reporting second quarter earnings showing a loss of more than 100,000 U.S. subscribers, Netflix shares have plummeted nearly 20%.\n\nAnd so, while Netflix investment returns for the past 10 years trumped Apple's, its shares must see a rebound in order for Netflix to maintain its lead.\n\nIf you are thinking about getting into investing, experts often advise starting with index funds, which hold every stock in an index, such as the S&P 500. Seasoned investor Warren Buffett agrees that it's a smart idea to start with index funds, in part because they fluctuate with the market, making them less risky than individually selected stocks.\n\nHere's a snapshot of how the markets look now.\n\nDon't miss:\n\nLike this story? Subscribe to CNBC Make It on YouTube!", "description": "Apple and Netflix have both proven to be successful companies over the years, and both have stocks that perform well. Time will tell if Apple's new streaming service will impact Netflix's performance.", "authors": ["Anna Hecht"], "top_image": "https://image.cnbcfm.com/api/v1/image/106128682-156838571089521.png?v=1568385822", "published_at": "2019-09-13"}