{"pub": "fox", "url": "https://foxnews.com/opinion/baghdadi-dead-trump-future-james-carafano", "downloaded_at": "2019-10-29 00:15:54.366357+00:00", "title": "James Carafano: Al-Baghdadi is dead –Trump was proven right on this one. So now what?", "language": "en", "text": "The self-proclaimed Caliph of ISIS is dead. That’s going to make it really tough for him to follow through on the terrorist group’s promise that “history is over”—a promise they made when starting their rampage of slaughter and misery.\n\nWhile history isn’t over, the question remains: What does the future hold? Here is what we know for sure.\n\nISIS has now suffered two devastating psychological blows. The first was the obliteration of their territorial “caliphate.” Baghdadi’s obliteration is the second. In the Middle East, where honor is power, the humiliating death of their dear leader triggers a loss of respect and prestige. This is another big setback to the Islamist terrorist “cause.”\n\nHOW ISIS LEADER AL-BAGHDADI’S HEADLESS BODY WAS ID’D MINUTES AFTER DEATH\n\nAnd more bad news is likely headed the terrorists’ way. The raid on Baghdadi’s hideout was as much an intelligence collection operation as a military assault. No doubt the U.S. special forces teams scarfed up stuff that will tell them even more about ISIS, information that can and will be used to further degrade the terrorist organization.\n\nThe successful operation also suggests that, on this score at least, Trump was right and his critics wrong. The U.S. can continue to conduct effective counterterrorism operations in Syria—and it doesn’t need a massive military presence there to do it.\n\nThe U.S. maintains a substantial counterterrorism footprint in the region. From Somalia and Yemen to Iraq, the U.S. has shown it can find and take out America’s enemies. No ISIS operative can rest easy in their bed at night, thinking that he is out of harm’s way.\n\nCLICK HERE TO GET THE OPINION NEWSLETTER\n\nFinally, we know this is not over. In 2001, we found ourselves in this global war against Islamist terrorists because we took our eye off the ball in the 1990s. We thought Afghanistan was too far away and Al Qaeda too insignificant to really bring the war to us.\n\nThe successful operation also suggests that, on this score at least, Trump was right and his critics wrong. The U.S. can continue to conduct effective counterterrorism operations in Syria—and it doesn’t need a massive military presence there to do it.\n\nThe threat roared back in 2011, when President Obama decided to take the foot off the gas pedal on operations to hunt the Islamists into oblivion. Now that the Caliphate is gone and the enemy is once again down on its luck, this is no time to declare “mission accomplished” and call it a day.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nWhile the U.S. does not need to occupy Syria, there is more work to be done in the region. The U.S. has to safeguard against foreign fighters and thwart terrorist travel. We have to keep a footprint in Afghanistan so we can also conduct effective counterterrorism operations in South Asia. We have to work with allies. And we have to remain vigilant here at home.\n\nIt would also be great if we could put aside the endless political squabbling. The truth is we have had the three most successful years in the fight against global terrorism. We should be building on that record of achievement—not fighting each other.\n\nCLICK HERE TO READ MORE FROM JAMES JAY CARAFANO", "description": "We have had the three most successful years in the fight against global terrorism. We should be building on that record of achievement—not fighting each other.", "authors": ["James Jay Carafano"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/28/694940094001_6098504885001_6098505058001-vs.jpg", "published_at": "2019-10-28"}