{"pub": "cryptonews", "url": "https://cryptonews.com/news/keep-an-eye-on-bitcoin-price-on-asian-exchanges-analysts-4861.htm", "downloaded_at": "2019-10-15 11:20:47.711188+00:00", "title": "Keep an Eye on Bitcoin Price on Asian Exchanges - Analysts", "language": "en", "text": "Source: iStock/Nuthawut Somsuk\n\nAs the OTC (over-the-counter) crypto trading in China has been on the rise, analysts advise people to look more into bitcoin price formation on Asian exchanges. Meanwhile, tether (USDT) , the most popular stablecoin, reportedly dominates bitcoin spot trading in this major market.\n\nThere has been a lot of confusion over the years about the exact status of cryptocurrencies in general, and Bitcoin (BTC) in particular in China, ever since the country banned cryptocurrency exchanges and initial coin offerings (ICOs) in September 2017. Nonetheless, there have been rumors for a long time that the trading/exchange/ICO scene is very much alive. It was also said that some exchanges use P2P (peer-to-peer) disguise for crypto-to-crypto trading and yuan to BTC/USDT exchange which they allegedly offer to their Chinese customers.\n\nAs a matter of fact, despite the restrictions and bans, OTC crypto trading in this country “has exploded,” according to Bloomberg which cited a study by blockchain analysis company Chainalysis. This study found that the rise in OTC trading coincides with the time Chinese spot traders started buying most of their BTC with USDT.\n\n“People should be paying more attention to the price formation on the large Asian exchanges,” chief economist at New York-based Chainalysis, Philip Gradwell, told Bloomberg, explaining that “there’s probably going to be a large amount of liquidity there that, for example, these OTC brokers will be providing. It can move very fast.”\n\nThe study found that the OTC trading has been rising since 2017, and that “just 10 over-the-counter Asian brokers Chainalysis tracked received USD 877 million of bitcoin in the year ended in September, up 52% from the prior 12 months,” which Kim Grauer, senior economist at Chainalysis, finds “astonishing.”\n\nAs a matter of fact, looking at the daily average BTC/CNY flows provided by cryptocurrency analyst website Coinlib, we find that the month of July saw c. USD 181 million traded. In August, the daily average dropped to c. USD 146 million, rising again in the following months to c. USD 186 million in September and c. USD 171 million in the first half of October only.\n\nGoing back to Tether, interestingly, the study found that this stablecoin was used in 99% of Bitcoin spot trades in China in 2019. It became more popular exactly because it became forbidden for people to exchange fiat for crypto via exchanges and online sites directly, using the legal options, peer-to-peer and OTC, instead.\n\nOn the other hand, the study compared China’s traders who use Tether to buy crypto to Bitcoin trading in markets like Japan and South Korea, saying that in these other markets people still mostly use fiat.\n\nThe researches shared a few more findings, saying that:\n\nabout 40% of the top-50 crypto exchanges in terms of Bitcoin on-chain activity are located in the Asia-Pacific region\n\nthese exchanges accounted for 35% of all bitcoin received in the first half of 2019\n\nthe region’s exchanges also dominate the trading in options and futures, with nearly 90% of the 2.36 billion contracts traded globally, says the article.\n\nMeanwhile, as reported just a few days ago, major crypto exchange Binance launched P2P trading functionality with BTC, ETH and USDT available for trading against Chinese yuan, but its CEO Changpeng Zhao (CZ) seems to have confirmed that users can buy crypto through China's giants WeChat and AliPay with cash in China, which both companies firmly denied.\n\nAt the moment of writing (11:08), BTC is trading at c. USD 8,325 and is almost unchanged in the past 24 hours. It's up by more than 1% in the past week.", "description": "As the OTC (over-the-counter) crypto trading in China has been on the rise, analysts advise people to look more into bitcoin price formation on Asian exchanges. Meanwhile, tether (USDT) , the most popular stablecoin, reportedly dominates bitcoin spot trading in this major market.", "authors": ["Sead Fadilpašić"], "top_image": "https://cimg.co/w/articles/0/5da/5a9d0a5af7.jpg", "published_at": "2019-10-15"}