{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/chan-sung-jung-thinks-better-grappler-than-brian-ortega-ufc-on-espn-plus-23-south-korea", "downloaded_at": "2019-10-18 01:07:53.103669+00:00", "title": "Chan Sung Jung thinks he's a better grappler than Brian Ortega heading into UFC on ESPN+ 23", "language": "en", "text": "It’s safe to say that “The Korean Zombie” isn’t afraid to go to the ground with Brian Ortega.\n\nChan Sung Jung (15-5 MMA, 5-4 UFC) headlines UFC on ESPN+ 23 on Dec. 21 against Ortega (14-1 MMA, 6-1 UFC) in his home country of South Korea.\n\nHe came face to face with Ortega for the first time at the UFC Busan pre-fight press conference Thursday and disagreed with Ortega’s claims that jiu-jitsu is his weakness.\n\nIn fact, he thinks his is even better.\n\n“I don’t necessarily agree,” Jung said. “I think my jiu-jitsu is strong. I think I’m actually better at it and I am a better grappler.”\n\nAn amused Ortega had to make sure he heard correctly by asking the translator to ask Jung one more time if he thought his grappling was better than his. Jung simply replied, “Yes.”\n\nSmiling at the statement, Ortega laughed and responded, “Let’s go” and pointed to the ground. But it was all mutual respect between the two as they head into a pivotal featherweight clash at the end of the year.\n\nOrtega saw his undefeated record come to a halt at UFC 231 in a failed attempt to capture the 145-pound title against champion Max Holloway, a fight in which he proved too tough for his own good. The fight was stopped by the cageside doctor at the end of the fourth round, and it will be a little more than a year since that fight when Oretega steps into the cage against Jung.\n\nJung suffered his own kind of heartbreak a couple of fights ago, when he was knocked out by Yair Rodriguez with just one second left in the fight – a fight in which he was ahead on the judges’ scorecards. But he was able to rebound emphatically with a first-round finish of Renato Moicano in June.", "description": "Chan Sung Jung disagrees that jiu-jitsu is his weakness and actually thinks he's a better grappler than Brian Ortega.", "authors": ["Farah Hannoun", "Dave Doyle", "Mma Junkie Staff", "John Morgan", "Nolan King", "Dan Tom"], "top_image": "https://usatmmajunkie.files.wordpress.com/2019/06/chan-sung-jung-renato-moicano-ufc-on-espn-plus-12-11.jpg?w=1000&h=576&crop=1", "published_at": "2019-10-17"}