{"pub": "cbs", "url": "https://cbsnews.com/news/arizona-gop-cancels-2020-presidential-primary", "downloaded_at": "2019-09-10 23:31:56.924580+00:00", "title": "Arizona GOP cancels 2020 presidential primary", "language": "en", "text": "Arizona Republicans told state election officials Monday they're scrapping their 2020 primary, joining GOP leaders in three other states that are forgoing a presidential nominating contest as President Trump seeks re-election.\n\nLongshot candidates challenging Mr. Trump for the Republican nomination have objected to the moves in Nevada, South Carolina and Kansas to skip GOP primaries or caucuses next year.\n\n\"Arizona Republicans are fired up to re-elect President Trump to a second term and will continue to work together to keep America_and Arizona_great,\" State GOP Chairman Kelli Ward said in a statement last week.\n\nChallengers to Mr. Trump have emerged, including former South Carolina Governor and Representative Mark Sanford, former Massachusetts Governor Bill Weld and Joe Walsh, a former Illinois congressman.\n\nPrimary challenges to incumbents are rarely successful, and Trump's poll numbers among Republican voters have proved resilient.\n\nNonetheless, Trump aides are looking to prevent a repeat of the convention discord that highlighted the electoral weaknesses of Presidents George H.W. Bush and Jimmy Carter in their failed reelection campaigns.\n\nStates have until October to submit their delegate selection rules to the Republican National Committee, and several more state Republican parties could vote to cancel their nominating contests before the deadline.\n\nChairwoman Ronna McDaniel told CBS News last week that the Republican National Committee does not dictate whether the state parties should hold nominating contests. That decision is left to the states. However, Mr. Trump's re-election campaign has dispatched its delegate staff to many of the GOP state conventions where they have observed chair elections and advised on delegate selection rules.\n\nEleanor Watson contributed to this report.", "description": "Republicans have canceled nominating contests in three other states as Trump seeks re-election", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2018/10/09/9cd23019-efc2-438e-bd90-b6aeff70bfaa/thumbnail/1200x630/7178ed6a2af3723c00495f871353d843/ap-18240773914869.jpg", "published_at": "2019-09-10"}