{"pub": "reuters", "url": "https://in.reuters.com/article/uk-usa-election-trump/trump-blasts-crazy-nancy-pelosi-and-democrats-defends-syria-pullout-idINKBN1WX09X", "downloaded_at": "2019-10-18 04:51:58.176249+00:00", "title": "Trump blasts 'crazy' Nancy Pelosi and Democrats, defends Syria pullout", "language": "en", "text": "DALLAS (Reuters) - U.S. President Donald Trump defended his Syria pullout at a campaign rally on Thursday and lashed out at “crazy Nancy” Pelosi and other Democrats who are trying to remove him from office through impeachment.\n\n“The more America achieves, the more hateful and enraged these crazy Democrats become. They’re crazy. They’re crazy,” Trump said at a packed American Airlines Center in downtown Dallas.\n\nPelosi, speaker of the U.S. House of Representatives, accused Trump of having a “meltdown” after walking out of a White House meeting on Wednesday during which Trump called her a “third-rate politician.”\n\nShe and other Democratic leaders had complained about his decision to pull U.S. troops from northeastern Syria and allow Turkey to attack America’s Kurdish allies in the area.\n\n“Crazy Nancy. That crazy Nancy, she is crazy,” Trump said of Pelosi.\n\nTrump has faced a backlash from his own Republican allies in Congress for the Syria pullout but he said on Thursday a ceasefire negotiated by Vice President Mike Pence with Turkish President Tayyip Erdogan had helped ease the crisis.\n\nHe told the Dallas crowd his approach was “unconventional” but he believed it worked. The death toll from Turkey’s week-long incursion into northeastern Syria was unclear.\n\n“Without spilling a drop of American blood, not one drop of American blood, we’ve all agreed on a pause, or a ceasefire, in the border region of Syria,” Trump said. “Sometimes you have to let ‘em fight for a while. Then people realise how tough it is.”\n\nPelosi opened an impeachment inquiry in the House on revelations that Trump pressed Ukrainian President Volodymyr Zelenskiy to investigate unsubstantiated allegations against former Vice President Joe Biden, a leading Democratic presidential contender, and his son Hunter Biden, who was on the board of a Ukrainian gas company.\n\nU.S. President Donald Trump mocks U.S. House Speaker Nancy Pelosi (D-CA) as he rallies with supporters in Dallas, Texas, U.S. October 17, 2019. REUTERS/Jonathan Ernst\n\n‘WITCH HUNT’\n\nTrump dismissed the impeachment inquiry as a “witch hunt” and said Democrats are trying to overturn the results of the 2016 election.\n\n“At stake in this fight is the survival of American democracy itself,” he said. “That’s what they want. But we will never let it happen.”\n\nTrump reviewed the Democratic presidential candidates who debated in Ohio on Tuesday night and accused them of seeking to give free benefits to migrants, saying they would “utterly eviscerate Medicare.”\n\n“They want to give more to illegal aliens than they do to American citizens,” he said.\n\nTrump’s appearance in Dallas was aimed at rallying his core base of voter support in a state that he is favored to win in the November 2020 presidential election.\n\nTexas has not voted for a Democratic presidential candidate since Jimmy Carter in 1976 but an increase in Democratic voters in big cities such as Austin and Houston could make it a closer race in 2020 than it has been in the past.\n\nTrump, who would have trouble winning re-election were he to lose Texas’ 38 electoral votes, mocked those pundits who say Texas could turn Democratic and said he believed he will win the state.\n\nTrump was concluding a long day in Texas in which he raised $5.5 million for his re-election campaign and the Republican National Committee at two events.\n\nHe also cut the ribbon on a Louis Vuitton factory in Alvarado, Texas, where workers will produce the high-end fashion products made famous by the French company.\n\nThe company’s billionaire controlling shareholder, Bernard Arnault, joined Trump for the event at the 100,000-square-foot (9,290-square-meter) plant.\n\nSlideshow (7 Images)\n\n“Louis Vuitton, a name I know well - cost me a lot of money over the years,” said Trump.\n\nFormer U.S. Representative Beto O’Rourke, a Democratic presidential candidate from Texas who is lagging in the polls, staged a competing event in Grand Prairie, Texas, featuring performances by Lil’ Keke, Cure for Paranoia and NuFolk Rebel Alliance.", "description": "U.S. President Donald Trump defended his Syria pullout at a campaign rally on Thursday and lashed out at \"crazy Nancy\" Pelosi and other Democrats who are trying to remove him from office through impeachment.", "authors": ["Steve Holland", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191018&t=2&i=1442129549&w=1200&r=LYNXMPEF9H078", "published_at": "2019-10-18"}