{"pub": "independent", "url": "https://independent.co.uk/life-style/gadgets-and-tech/news/google-pixel-4-specs-features-price-release-date-camera-a9151071.html", "downloaded_at": "2019-10-11 19:42:06.864460+00:00", "title": "Pixel 4: Everything we know about Google's new smartphone", "language": "en", "text": "Google made the unusual move earlier this year of publishing images of its upcoming Pixel 4 smartphone – months ahead of its expected release date. By sharing details of the phone, the technology giant was attempting to take back the narrative from the leakers, gossips and rumour merchants that fill the pages of the tech press in the build-up to a major product launch.\n\nBut the limited amount of information imparted only seemed to serve as bait, with publications picking apart each picture to determine what hardware features to expect. Along with dual-rear cameras, the images also revealed an additional sensor that became noticeable when the contrast of one image was adjusted.\n\nMoreover, Google's revelations didn't prevent the usual slew of rumours, with Google and its production partners seemingly more leaky than dear Liza's bucket.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe official unveiling of the Pixel 4 and Pixel 4 XL will take place on 15 October at an event in New York City, but with little left to announce it will likely be almost entirely ceremonial. For those not keen on sitting through a two hour presentation, The Independent has a run down of everything that's expected to be announced.\n\nImproved camera\n\nAs with most smartphone makers this year, the main upgrade for Google's latest device will almost certainly be the camera.\n\nBoth the front- and rear-facing cameras will see considerable improvements, with an additional 16-megapixel telephoto lens at the back being complimented by complex sensors at the front that will enable the same depth-aware facial recognition that is featured on the latest iPhones.\n\nShape Created with Sketch. Gadgets and tech news in pictures Show all 25 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Gadgets and tech news in pictures 1/25 Google turns 21 Google celebrates its 21st birthday on September 27. The The search engine was founded in September 1998 by two PhD students, Larry Page and Sergey Brin, in their dormitories at California’s Stanford University. Page and Brin chose the name google as it recalled the mathematic term 'googol', meaning 10 raised to the power of 100 Google 2/25 Gun-toting humanoid robot sent into space Russia has launched a humanoid robot into space on a rocket bound for the International Space Station (ISS). The robot Fedor will spend 10 days aboard the ISS practising skills such as using tools to fix issues onboard. Russia's deputy prime minister Dmitry Rogozin has previously shared videos of Fedor handling and shooting guns at a firing range with deadly accuracy. Dmitry Rogozin/Twitter 3/25 Hexa drone lifts off Chief engineer of LIFT aircraft Balazs Kerulo demonstrates the company's \"Hexa\" personal drone craft in Lago Vista, Texas on June 3 2019 Reuters 4/25 Project Scarlett to succeed Xbox One Microsoft announced Project Scarlett, the successor to the Xbox One, at E3 2019. The company said that the new console will be 4 times as powerful as the Xbox One and is slated for a release date of Christmas 2020 Getty 5/25 First new iPod in four years Apple has announced the new iPod Touch, the first new iPod in four years. The device will have the option of adding more storage, up to 256GB Apple 6/25 Folding phone may flop Samsung will cancel orders of its Galaxy Fold phone at the end of May if the phone is not then ready for sale. The $2000 folding phone has been found to break easily with review copies being recalled after backlash PA 7/25 Charging mat non-starter Apple has cancelled its AirPower wireless charging mat, which was slated as a way to charge numerous apple products at once AFP/Getty 8/25 \"Super league\" India shoots down satellite India has claimed status as part of a \"super league\" of nations after shooting down a live satellite in a test of new missile technology EPA 9/25 5G incoming 5G wireless internet is expected to launch in 2019, with the potential to reach speeds of 50mb/s Getty 10/25 Uber halts driverless testing after death Uber has halted testing of driverless vehicles after a woman was killed by one of their cars in Tempe, Arizona. March 19 2018 Getty 11/25 A humanoid robot gestures during a demo at a stall in the Indian Machine Tools Expo, IMTEX/Tooltech 2017 held in Bangalore Getty 12/25 A humanoid robot gestures during a demo at a stall in the Indian Machine Tools Expo, IMTEX/Tooltech 2017 held in Bangalore Getty 13/25 Engineers test a four-metre-tall humanoid manned robot dubbed Method-2 in a lab of the Hankook Mirae Technology in Gunpo, south of Seoul, South Korea Jung Yeon-Je/AFP/Getty 14/25 Engineers test a four-metre-tall humanoid manned robot dubbed Method-2 in a lab of the Hankook Mirae Technology in Gunpo, south of Seoul, South Korea Jung Yeon-Je/AFP/Getty 15/25 The giant human-like robot bears a striking resemblance to the military robots starring in the movie 'Avatar' and is claimed as a world first by its creators from a South Korean robotic company Jung Yeon-Je/AFP/Getty 16/25 Engineers test a four-metre-tall humanoid manned robot dubbed Method-2 in a lab of the Hankook Mirae Technology in Gunpo, south of Seoul, South Korea Jung Yeon-Je/AFP/Getty 17/25 Waseda University's saxophonist robot WAS-5, developed by professor Atsuo Takanishi Rex 18/25 Waseda University's saxophonist robot WAS-5, developed by professor Atsuo Takanishi and Kaptain Rock playing one string light saber guitar perform jam session Rex 19/25 A test line of a new energy suspension railway resembling the giant panda is seen in Chengdu, Sichuan Province, China Reuters 20/25 A test line of a new energy suspension railway, resembling a giant panda, is seen in Chengdu, Sichuan Province, China Reuters 21/25 A concept car by Trumpchi from GAC Group is shown at the International Automobile Exhibition in Guangzhou, China Rex 22/25 A Mirai fuel cell vehicle by Toyota is displayed at the International Automobile Exhibition in Guangzhou, China Reuters 23/25 A visitor tries a Nissan VR experience at the International Automobile Exhibition in Guangzhou, China Reuters 24/25 A man looks at an exhibit entitled 'Mimus' a giant industrial robot which has been reprogrammed to interact with humans during a photocall at the new Design Museum in South Kensington, London Getty 25/25 A new Israeli Da-Vinci unmanned aerial vehicle manufactured by Elbit Systems is displayed during the 4th International conference on Home Land Security and Cyber in the Israeli coastal city of Tel Aviv Getty 1/25 Google turns 21 Google celebrates its 21st birthday on September 27. The The search engine was founded in September 1998 by two PhD students, Larry Page and Sergey Brin, in their dormitories at California’s Stanford University. Page and Brin chose the name google as it recalled the mathematic term 'googol', meaning 10 raised to the power of 100 Google 2/25 Gun-toting humanoid robot sent into space Russia has launched a humanoid robot into space on a rocket bound for the International Space Station (ISS). The robot Fedor will spend 10 days aboard the ISS practising skills such as using tools to fix issues onboard. Russia's deputy prime minister Dmitry Rogozin has previously shared videos of Fedor handling and shooting guns at a firing range with deadly accuracy. Dmitry Rogozin/Twitter 3/25 Hexa drone lifts off Chief engineer of LIFT aircraft Balazs Kerulo demonstrates the company's \"Hexa\" personal drone craft in Lago Vista, Texas on June 3 2019 Reuters 4/25 Project Scarlett to succeed Xbox One Microsoft announced Project Scarlett, the successor to the Xbox One, at E3 2019. The company said that the new console will be 4 times as powerful as the Xbox One and is slated for a release date of Christmas 2020 Getty 5/25 First new iPod in four years Apple has announced the new iPod Touch, the first new iPod in four years. The device will have the option of adding more storage, up to 256GB Apple 6/25 Folding phone may flop Samsung will cancel orders of its Galaxy Fold phone at the end of May if the phone is not then ready for sale. The $2000 folding phone has been found to break easily with review copies being recalled after backlash PA 7/25 Charging mat non-starter Apple has cancelled its AirPower wireless charging mat, which was slated as a way to charge numerous apple products at once AFP/Getty 8/25 \"Super league\" India shoots down satellite India has claimed status as part of a \"super league\" of nations after shooting down a live satellite in a test of new missile technology EPA 9/25 5G incoming 5G wireless internet is expected to launch in 2019, with the potential to reach speeds of 50mb/s Getty 10/25 Uber halts driverless testing after death Uber has halted testing of driverless vehicles after a woman was killed by one of their cars in Tempe, Arizona. March 19 2018 Getty 11/25 A humanoid robot gestures during a demo at a stall in the Indian Machine Tools Expo, IMTEX/Tooltech 2017 held in Bangalore Getty 12/25 A humanoid robot gestures during a demo at a stall in the Indian Machine Tools Expo, IMTEX/Tooltech 2017 held in Bangalore Getty 13/25 Engineers test a four-metre-tall humanoid manned robot dubbed Method-2 in a lab of the Hankook Mirae Technology in Gunpo, south of Seoul, South Korea Jung Yeon-Je/AFP/Getty 14/25 Engineers test a four-metre-tall humanoid manned robot dubbed Method-2 in a lab of the Hankook Mirae Technology in Gunpo, south of Seoul, South Korea Jung Yeon-Je/AFP/Getty 15/25 The giant human-like robot bears a striking resemblance to the military robots starring in the movie 'Avatar' and is claimed as a world first by its creators from a South Korean robotic company Jung Yeon-Je/AFP/Getty 16/25 Engineers test a four-metre-tall humanoid manned robot dubbed Method-2 in a lab of the Hankook Mirae Technology in Gunpo, south of Seoul, South Korea Jung Yeon-Je/AFP/Getty 17/25 Waseda University's saxophonist robot WAS-5, developed by professor Atsuo Takanishi Rex 18/25 Waseda University's saxophonist robot WAS-5, developed by professor Atsuo Takanishi and Kaptain Rock playing one string light saber guitar perform jam session Rex 19/25 A test line of a new energy suspension railway resembling the giant panda is seen in Chengdu, Sichuan Province, China Reuters 20/25 A test line of a new energy suspension railway, resembling a giant panda, is seen in Chengdu, Sichuan Province, China Reuters 21/25 A concept car by Trumpchi from GAC Group is shown at the International Automobile Exhibition in Guangzhou, China Rex 22/25 A Mirai fuel cell vehicle by Toyota is displayed at the International Automobile Exhibition in Guangzhou, China Reuters 23/25 A visitor tries a Nissan VR experience at the International Automobile Exhibition in Guangzhou, China Reuters 24/25 A man looks at an exhibit entitled 'Mimus' a giant industrial robot which has been reprogrammed to interact with humans during a photocall at the new Design Museum in South Kensington, London Getty 25/25 A new Israeli Da-Vinci unmanned aerial vehicle manufactured by Elbit Systems is displayed during the 4th International conference on Home Land Security and Cyber in the Israeli coastal city of Tel Aviv Getty\n\nVietnamese YouTube channel AnhEm TV gave a comprehensive tour of all the new camera features in an extensive video, while a leaked promo video picked up by Spanish-language site ProAndroid revealed what a new astrophotography mode on the Pixel 4 and Pixel 4 XL.\n\nThe new feature comes with the tagline \"You even get the stars\", which Google shows off through an impressively detailed image of the Milky Way.\n\nBetter specs and new design\n\nNumerous leaks tell us that the Google Pixel 4 and Pixel 4 XL will come with a 90Hz Smooth Display, Face Unlock, 6GB of RAM and a Qualcomm Snapdragon 855 chipset.\n\nThe 5.7-inch Pixel 4 will come with an improved 2,800mAh battery that should provide enough charge to last at least one day of moderate use, while the 6.3-inch Pixel 4 XL will boast a 3,700mAh battery.\n\nThe previous design from the Pixel 3 range of phones has been ditched in favour of something slightly more industrial. A camera block at the back is reminiscent of the iPhone 11's setup and houses both lenses and sensors.\n\nLeaked photos also seem to show that there is no longer a fingerprint reader on the rear of the device, though this may still be featured beneath the screen itself.\n\nThere will three colours for the Pixel 4: 'just black', 'clearly white' and 'oh so orange'. There may also be a 'mint green' version of the phone, though this is not certain.\n\nAndroid 10 and a 5G version\n\nGoogle's latest mobile operating system was announced in August, revealing a complete overhaul to the world's most popular software. As always, Google's own devices were the first to include Android 10 and so there is no doubt it will appear on the two new Pixel 4 phones.\n\nOne of the most highly-anticipated features of Android 10 is Live Caption, which uses artificial intelligence to automatically transcribe speech from audio or videos playing on the phone.\n\nWhilst fundamentally an accessibility feature, allowing deaf and hard-of-hearing users to better consume content, it will also be a perk to anyone hoping to surreptitiously watch videos without disturbing those around them.\n\nGoogle is also reportedly working on a 5G version of the Pixel 4, according to Nikkei Asian Review, which would see the tech giant beat its old foe Apple to releasing a next-generation device.\n\nRelease date and price\n\nWhile the date of the announcement is already known, it is not clear yet when the phones will actually be released. If past Pixel cycles are anything to go by, pre-orders will open the day of the unveiling, with the release date coming before the end of the month.\n\nLast year, the Pixel 3 was revealed on 9 October and released nine days later on 18 October.\n\nNo amount of leaks have given a certain indication of the exact price of the new phones, though listings discovered by 9to5Google suggest the Pixel 4 will cost 820 euros (£727) and the Pixel 4 XL will be 1,127 euros (£999).", "description": "Google made the unusual move earlier this year of publishing images of its upcoming Pixel 4 smartphone – months ahead of its expected release date. By sharing details of the phone, the technology giant was attempting to take back the narrative from the leakers, gossips and rumour merchants that fill the pages of the tech press in the build-up to a major product launch.", "authors": ["Anthony Cuthbertson"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/10/17/google-pixel-4.jpg", "published_at": "2019-10-11"}