{"pub": "indiatimes", "url": "https://indiatimes.com/news/india/cyclone-kyarr-may-have-just-ruined-your-beach-diwali-holiday-in-goa-378600.html", "downloaded_at": "2019-10-25 22:12:22.034380+00:00", "title": "Cyclone Kyarr May Have Just Ruined Your Beach Diwali Holiday In Goa", "language": "en", "text": "Cyclone Kyarr May Have Just Ruined Your Beach Diwali Holiday In Goa\n\nCyclone Kyarr May Have Just Ruined Your Beach Diwali Holiday In Goa\n\nWith heavy to very heavy rains predicted it is going to be a wet Diwali this time in Goa, due to the Cyclonic Storm Kyarr.\n\nThis is not just bad news for the people of Goa, but the thousands of people who had planned to spent their Diwali weekend on the beaches.\n\nBCCL/ REPRESENTATIONAL IMAGE\n\nIndia meteorological department (IMD) has issued an advisory to tourists visiting Goa to avoid the state up to October 27 due to heavy rainfall.\n\nSince there will be heavy rainfall up to October 27, it is better not to visit Goa for their own safety,” IMD Goa director K V Padgalwar told TOI adding that “Tourists cannot go into the sea due to the weather conditions.\"\n\nDon't Miss 22 K SHARES 12.2 K SHARES 3.4 K SHARES\n\nAccording to the IMD, the ‘depression’ in the Arabian Sea intensified into a ‘deep depression’ on Thursday night and further intensify into a ‘cyclone’ on Friday morning somewhere 250 km away from the Goa coast and its effect will gradually reduce by Friday late evening.\n\nSince the start of October, Goa has received 257.6 mm of rainfall a ‘large excess’ of 87% as compared to the average amount of rain from the past few years.\n\nBCCL/ REPRESENTATIONAL IMAGE\n\nThe heavy rains this year are expected to affect the tourism season in Goa which began on October 1 as the Diwali weekend sees one of the biggest footfall of domestic tourists.\n\nThe cyclone is unlikely to make landfall but will result in widespread heavy rains in Karnataka, Maharashtra, and Goa.", "description": "With heavy to very heavy rains predicted it is going to be a wet Diwali this time in Goa, due to the Cyclonic Storm Kyarr. This is not just bad news for the people of Goa, but the thousands of people who had planned to spent their Diwali weekend on the beaches. India meteorological department (IMD) has issued an advisory to tourists visiting Goa to avoid the state up to October 27 due to heavy r", "authors": ["Bobins Abraham"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/cyclone_kyarr_goa_1571997998_800x420.jpg", "published_at": "2019-10-25"}