{"pub": "yahoo", "url": "https://news.yahoo.com/factbox-giuliani-associates-charged-funneling-230139877.html", "downloaded_at": "2019-10-11 00:28:31.685785+00:00", "title": "FACTBOX-Who are the Giuliani associates charged with trying to influence U.S. elections?", "language": "en", "text": "(Adds Kukushkin's court appearance)\n\nBy Jan Wolfe\n\nOct 10 (Reuters) - Igor Fruman and Lev Parnas, two foreign-born associates of U.S. President Donald Trump's personal lawyer Rudy Giuliani, were charged on Thursday with conspiring to influence U.S. politics with illegal campaign contributions.\n\nProsecutors identified two other men, Andrey Kukushkin and David Correia, as conspirators in an alleged scheme that aimed to funnel $1 million in donations to politicians and political candidates in Nevada, New York and other states to benefit a planned marijuana business funded by an unnamed Russian businessman.\n\nJohn Dowd, the lawyer for Parnas and Fruman, declined to comment on the charges. Parnas and Fruman made their initial court appearance in Alexandria, Virginia, with another court date set for next Thursday.\n\n\n\n\n\nDetails emerged about their backgrounds on Thursday:\n\n\n\n\n\nLEV PARNAS\n\nParnas, 47, who was born in Ukraine, is a businessman who divides his time between Florida and New York City.\n\nHe has garnered attention by becoming a mega-donor to Republican Party politicians. In May 2018, Parnas posted pictures on Facebook of himself and Fruman with Trump in the White House and with the president's son Donald Trump Jr. at a breakfast in Beverly Hills, California.\n\nParnas told NPR last month that he was \"good friends\" with Giuliani and that they played golf together.\n\nParnas helped introduce Giuliani into top Ukrainian political circles as part of Giuliani's effort to push an investigation of Joe Biden, Trump's political rival, and his son Hunter, according to widespread media accounts.\n\nParnas told Reuters in an interview last month any violations of U.S. Federal Election Commission rules were unwitting and a \"clerical thing\" because he was not an experienced political donor.\n\n\n\n\n\nIGOR FRUMAN\n\nFruman, 53, who is originally from Belarus, is a real estate investor who also runs a U.S. import-export business.\n\nLike Parnas, he has donated widely to pro-Trump politicians and has helped Giuliani with his efforts in Ukraine to discredit the Biden family.\n\n\n\n\n\nANDREY KUKUSHKIN\n\nKukushkin, 46, is a Ukraine native now living in San Francisco and a veteran of the cannabis business.\n\nHe was a vice president of a Russian hedge fund, Renaissance Investment Management, before getting into the business of growing and selling marijuana in the United States, according to news reports, legal records and corporate records. One report in Forbes Russia said Kukushkin started with investments in dispensaries in California and Nevada, and quoted him as saying he now made $60 million in revenue annually.\n\nKukushkin made an initial court appearance in San Francisco on Thursday. His bail hearing will continue on Friday.\n\n\n\n\n\nDAVID CORREIA\n\nCorreia, 44, is the only one of the four defendants born in the United States. He is businessman and a longtime associate of Parnas. Fraud Guarantee, a Florida-based fraud protection company, lists the two men as co-founders. Correia and Parnas also worked together on a failed moviemaking venture that ended in litigation, according to U.S. media reports. (Reporting by Jan Wolfe and Joseph Tanfani in Washington; Editing by Scott Malone and Peter Cooney)", "description": "Igor Fruman and Lev Parnas, two foreign-born associates of U.S. President Donald Trump's personal lawyer Rudy Giuliani, were charged on Thursday with conspiring to influence U.S. politics with illegal campaign contributions.  Prosecutors identified two other men, Andrey Kukushkin and David Correia", "authors": ["Jan"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-10"}