{"pub": "independent", "url": "https://independent.co.uk/sport/football/premier-league/man-city-news-joel-latibeaudiere-interview-profile-fc-twente-transfer-epl-a9092631.html", "downloaded_at": "2019-09-05 11:27:19.617220+00:00", "title": "Joel Latibeaudiere: ‘Man City are the best team in the world, but I need to be playing first-team football’", "language": "en", "text": "Joel Latibeaudiere tugs thoughtfully at the tuft of hair on his chin, not quite sure whether to smile with joy or sigh in relief. The captain of England’s U17 World Cup-winning side and winner of the U18s Premier League scholar of the year award, ahead of teammates Phil Foden and Jadon Sancho, it’s no exaggeration to claim that the still teenage centre-back is amongst the most decorated academy footballers on the planet. And yet, Latibeaudiere makes no attempt to mask the frustration and, at times, the agony of having his blossoming career halted in the shade.\n\nFor the past two years, the 19-year-old has been locked in a contract stand-off with Manchester City, concerned by the promise of an “unclear route” to the first-team. He’s still yet to make his debut and, after suffering a posterior cruciate ligament injury that stole almost the entirety of last season, has found himself stuck on a type of star-studded threshold, waiting for the glass ceiling to shatter. But after resisting the safety net of signing a long-term deal this summer, solace arrived just hours before this week’s European transfer deadline when Latibeaudiere’s season-long loan move to FC Twente was confirmed.\n\n“I feel like it’s a time where I just need to be playing,” he says. “It can be very frustrating because I believe I’ve got the ability and I know if I’m given the chance, I won’t let it go. I want to be the best I can be and, to do that, I have to be playing first-team football.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“When you’re injured, your name can sometimes be swept under the rug a little bit and I need to be out there playing men’s football. I want to go into battle. I’ve always wanted the chance to play abroad at some stage. I feel like this is going to be a big season for me and I just needed that opportunity to prove myself. Nothing will stop me. If a pathway is presented at City as a result, I can think about it.”\n\nSince he was six years old, Latibeaudiere’s dad told him about a 10-step ladder that would act as scaffolding to his career. It’s rusty and scaled at the bottom with footholds muddied by thousands. However, as you near the top and lift your head above the parapet, the faraway flicker becomes a spotlight and the rungs turn pristine silver.\n\n“What’s at the 10th step?”\n\n“Being a fully-fledged professional footballer.”\n\n“So what step are you on now?”\n\n“Seven.”\n\n***\n\nThose coaches and teammates who know Latibeaudiere best don’t highlight the myriad of flicks and feints that belie his position as a central defender or the unique athleticism that compensates for his smaller stature and set jumping records at the England training centre. Instead, they marvel at his unguarded determination to be a leader.\n\nTake the World Cup final between England and Spain in India two years ago. Morgan Gibbs-White has just scored the equaliser to pull the game back to 2-2 and nine of England’s outfield players are charging manically towards a flag-draped corner of Kolkata’s Salt Lake Stadium. But the 10th player, still lucid amid the euphoria, veers off towards goal, fastens the ball beneath his arm and immediately heads for the centre-circle. By the time his teammates have returned, Latibeaudiere is lost in a frenzy, shouting and conducting with orchestral abandon.\n\n“Whether I have the armband or not, I’ll always be a leader and that will never change,” he says. “My parents always told me to be strong and state my opinion. I’ve always been a big voice in the changing room and I think players are able to get a drive off me.\n\n“My parents say when they see me on the pitch, they think I can look horrible and nasty,” he laughs. “Away from the field, I’m calm, polite, a nice normal guy, but once I cross that white line, I become a different person. It’s all about winning and when I’m on the pitch it’s tunnel vision. That’s all I can think about.”\n\nAs Latibeaudiere lifted the trophy in India – becoming the first Englishman ever to do so – a hoard of his relatives and neighbours gathered in his dad’s favourite pub in Armthorpe, an old mining village 10 miles from central Doncaster.\n\nIt was the crowning moment of his career thus far and speaking about it spills a dam of memories. He can still feel the goosebumps on his arms and the cold metal of the trophy on his fingertips. He remembers the tearstained embrace with Foden at the full-time whistle and the restless wait to find his mum and sister outside the stadium in India’s suffocating evening humidity. “The final was just so surreal,” he says, reliving the night’s trance. “It was just… emotion.”\n\nThe joy that day wasn’t just in winning, but validation for the sacrifice Latibeaudiere and his parents have made since the day he sat in the back seat of their car in joyful hysterics after being scouted by Leeds. For four years, his father, a local glass factory worker, would wake up at dawn after a 12-hour shift to drive Latibeaudiere to training. Eventually, City, Manchester United, Liverpool and Everton all offered him positions in their academies. “I went to all the clubs and looked around, but I always knew I’d go to City,” he says. “They were planning to build the best team and the best academy in England. That’s what I wanted to be part of so that’s what sold it to me.”\n\nAfter joining City, Latibeaudiere left home to live in Manchester when he was just 13 years old. “I’ve had to separate myself from being a normal teenager,” he says. “I’ve dealt with that but it’s not something people necessarily see or understand. Leaving home, leaving my family, those sacrifices you’ve made; I wouldn’t say I had a hard upbringing but I’ve been less privileged than others, it gives you a certain mentality. That’s why I know I’m going to succeed.”\n\nWithin a matter of games, Latibeaudiere established himself as a standout member of a precocious youth team, featuring Foden, Sancho, Ed Francis (now of Wolves), Tyrese Campbell (now of Stoke) and Luke Bolton (on loan). Armed with a ruthless blend of grace and grit, Latibeaudiere was always regarded by the club’s coaches as having the talents to rival Foden and Sancho. Latibeaudiere counts them as friends, but can’t deny the pain feeling left behind.\n\n“I’m so happy for them,” he says. “They deserve it but of course it is hard when you know you’ve got the talent too. I’ve always believed I can reach that level.”\n\n***\n\nUntil this last injury-stricken year, caused by a collision with the post during an England training session, Latibeaudiere was – even if not recognisable to the wider public – always considered to be at the forefront of City’s glittering academy system. He has worked closely with Pep Guardiola’s defensive coach Rodolfo Borrell, impressed upon assistant manager Mikel Arteta and sapped knowledge from his idol Vincent Kompany.\n\nBut, after seeing Sancho force his way to Borussia Dortmund, the feeling of being nested in a gilded cage became a parasitic force amongst the club’s prized prospects, with the likes of Brahim Diaz, Rabbi Matondo and Jason Denayer all subsequently following suit. Latibeaudiere recognises that he is caught somewhere in a purgatory between patience and ambition, the unrelenting desire to hurtle out of a period shadowed by the feeling of standing still.\n\n“It has been a big thought process for me to delay signing [a new deal],” Latibeaudiere admits. “[Before suffering the injury last season], I felt like I’d done a lot for my age. I’d just won player of the season but I wasn’t given the chances I believed I was going to be. City are the best team in the world and it’s very hard to breakthrough. Seeing what Jadon did; not signing and moving abroad was clearly the right thing for him because of what he’s achieved since and it did make things more clear for other young players coming through. He didn’t have a clear route but he knew he had the talent; we all did.”\n\nWith two years now remaining on his contract at City – after a year option was taken in line with his loan move – Latibeaudiere is also acutely aware that the risk he’s taken in forcing a move to Holland could well come to define the flight or fall of his graduation to achieving that long-anticipated mantle of becoming a “fully-fledged professional footballer”. He is under no illusions that, even if his loan spell is a wild success, he will likely return to City and be faced by the same dilemma. And yet, whether he ultimately chooses to remain in Manchester or make peace with the unknown, there is a very real combination of enthusiasm and erudition which leaves few doubts that those two paths will eventually reconvene.\n\nThat glass ceiling?\n\n“I’m going to smash it.”", "description": "Joel Latibeaudiere tugs thoughtfully at the tuft of hair on his chin, not quite sure whether to smile with joy or sigh in relief. The captain of England’s U17 World Cup-winning side and winner of the U18s Premier League scholar of the year award, ahead of teammates Phil Foden and Jadon Sancho, it’s no exaggeration to claim that the still teenage centre-back is amongst the most", "authors": ["Tom Kershaw"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/05/09/l1030528-1.jpg", "published_at": "2019-09-05"}