{"pub": "thehill", "url": "https://thehill.com/policy/technology/466899-ftc-brings-first-case-against-stalking-app-developer", "downloaded_at": "2019-10-22 16:03:29.781442+00:00", "title": "FTC brings first case against 'stalking' app developer", "language": "en", "text": "The Federal Trade Commission on Tuesday charged the developer of three \"stalking\" apps with violating consumer's privacy and creating security vulnerabilities.\n\nRetina X Studios and its founder James Johns Jr. will have to delete the data collected by the three apps as part of the settlement and will not be able to sell new apps unless steps are taken to ensure they are used for legitimate purposes.\n\nThe stalking apps allowed purchasers to monitor a user's precise GPS location, text messages sent and received and photos without the knowledge of the user.\n\nPurchasers could allegedly then track that data through an online portal.\n\nADVERTISEMENT\n\nThe apps, sold through Retina X's website but not available on the Apple App Store or Google Play Store, instructed purchasers on how to hide them, according to the FTC.\n\nTuesday's charges are the first time the FTC has taken steps against a stalking app developer, a development which commissioner Rebecca Slaughter called an \"important milestone in the FTC's efforts to protect consumers.\"\n\n\"These apps are not just creepy — they can put victims of stalking and domestic violence at profound risk,\" Slaughter told reporters in a phone call.\n\n\"In 2014, a survey by National Public Radio of 72 domestic violence shelters in the United States discovered that 85 percent of assisted victims' abusers had tracked them through GPS.\"\n\nIn order to install the apps, purchasers had to jailbreak the devices, which the FTC alleges exposed the devices to security vulnerabilities and likely invalidated manufacturer warranties.\n\nThe FTC also alleges that Retina X and Johns did not adequately secure the information collected by the devices.\n\nDespite those issues, the legal policies for all three apps claimed that “your private information is safe with us.”\n\nThose alleged vulnerabilities also put the company in violation of the Children's Online Privacy Protection Act (COPPA) which requires information from children under 13 to be secured.\n\nRetina X and Johns specifically marketed one of the apps, MobileSpy, to monitor employees and children.\n\nThe commission voted 5-0 to issue the proposed administrative complaint and to accept the consent agreement with Retina X and Johns.", "description": "The Federal Trade Commission on Tuesday charged the developer of three \"stalking\" apps with violating consumer's privacy and creating security vulnerabilities.", "authors": [], "top_image": "https://thehill.com/sites/default/files/blogs/federal_trade_commission_ftc_-71968930.jpg", "published_at": "2019-10-22"}