{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/trump-congratulates-poland-on-anniversary-of-nazi-invasion.html", "downloaded_at": "2019-09-03 23:49:23.470879+00:00", "title": "Trump Congratulates Poland for the Catastrophe of Its Invasion by Germany", "language": "en", "published_at": "2019-09-03", "text": "Warsaw at the end of World War II. Photo: Hulton Archive/Getty Images\n\nNobody expects Donald Trump, despite his prep school and Ivy League education, to know much about … well, anything, but especially history, which he appears to view as mere context for his own salvific rise to fame and then power. But his comments this weekend congratulating Poland on the 80th anniversary of that long-suffering country’s greatest catastrophe is breathtaking nonetheless. Gaze in awe:\n\nREPORTER: Do you have a message for Poland on the 80th anniversary of World War 2?\n\n\n\nTRUMP: \"I do have a great message for Poland & we have Mike Pence, our vice president, is just about landing right now...I just want to congratulate Poland\"\n\n\n\n[Poland was smashed by Nazis in 1939] pic.twitter.com/PIOrhx3eC7 — Aaron Rupar (@atrupar) September 2, 2019\n\nYou’d have to guess based on his weirdly specific reference to the number of Polish immigrants in this country, and in connection with Pence’s and his own travel plans, that the president received some sort of recent briefing about that country. Perhaps it did not occur to his staff that he needed to be reminded of what happened to Poland in the years following the German invasion that began on September 1, 1939. You know, the dismemberment of the country by the Nazis in conjunction with the USSR; the systematic murder of the Polish educated classes, a sort of warm-up act for the effort to exterminate European Jewry during the Holocaust, much of which took place on Polish soil; the incredible military and civic violence involving the Germans, the Russians, and assorted partisans that led historian Timothy Snyder to describe the area of Europe centered in Poland “the bloodlands”; and the postwar imposition of communism on Poland, along with the violent relocation of millions of the war’s survivors.\n\nTrump was congratulating Poland on the anniversary of an event that led to the deaths of an estimated one-fifth of the nation’s prewar population, and marked the beginning of a World War in which at least 60 million people perished, including over 400,000 Americans.\n\nYes, I know, “congratulating” people he doesn’t know anything about is one of the president’s tics to cover his ignorance, much like his promiscuous use of modifiers like “great” or “greatest” for every phenomenon he dimly understands. But this particular example shows that the man and our nation would be better served if occasionally he just replied to some questions with: “Huh?”", "description": "Asked if he had a message for Poland on the 80th anniversary of the Nazi invasion that began World War II and trigged the Holocaust and the deaths of one-fifth of its population, Trump offered congratulations.", "authors": ["Ed Kilgore"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/09/03/03-warsaw-1939.w1200.h630.jpg"}