{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7565823/Prince-Andrew-rides-horse-Windsor.html", "downloaded_at": "2019-10-12 15:19:21.669182+00:00", "title": "Prince Andrew rides a horse in Windsor", "language": "en", "text": "Prince Andrew took an early morning ride out from Windsor Castle today having returned from his Australian trade mission where only one super fan turned up.\n\nThe 59-year-old royals has been dogged by controversy over his friendship with paedophile financier Jeffrey Epstein.\n\nThe Prince, who was accompanied by Head Groom Terry Pendry, ignored the inclement weather has he rode out.\n\nPrince Andrew, pictured with an aide, went on an early morning ride in the rain near Windsor Castle following his most recent trade mission to Australia\n\nThe pair were wearing capes to keep out the rain during the early morning ride with Head Groom Terry Pendry\n\nPrince Andrew, pictured on horseback, has strongly denied any impropriety with minors\n\nThe prince had flown to Australia for an appearance at Murdoch University in Perth where he was promoting a 'boot camp' for his entrepreneurs' initiative Pitch@Palace.\n\nRoyal experts have speculated it is possible the Duke's antipodean trip has been deliberately kept low-key as the scandal rumbles on.\n\nThe friendship between Andrew, 59, and the the billionaire financier, who was found hanged in his cell in August after being charged with child-trafficking offences, has come under intense scrutiny.\n\nOne of Epstein's alleged victims Virginia Roberts Giuffre has alleged she was recruited as a 'sex slave' and forced to have sex with Prince Andrew in London.\n\nHe has strongly denied any 'sexual contact or relationship' with her or any 'impropriety with underage minors'.\n\nPrince Andrew visited Epstein on Epstein's atoll in the US Virgin Islands several times, dubbed Paedophile Island because of the stream of young women arriving.\n\nHe also visited the financier's £60million Manhattan house in December 2010, shortly after Epstein had been released from an 18-month sentence for child prostitution offences.\n\nPrince Andrew cut a lonely figure during his 'Pitch@Palace' promotional trip to Perth\n\nEpstein stayed at Epstein's Manhattan home after the paedophile's release from jail after cutting a plea deal for child prostitution offences", "description": "Prince Andrew, pictured with an aide, went on an early morning ride in the rain near Windsor Castle following his most recent trade mission to Australia.", "authors": ["Darren Boyle For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/14/19625352-0-image-a-14_1570886648368.jpg", "published_at": "2019-10-12"}