{"pub": "nymag", "url": "https://vulture.com/2019/10/live-little-mermaid-and-spongebob-musicals-to-premiere.html", "downloaded_at": "2019-10-18 02:03:37.411359+00:00", "title": "Nickelodeon and Disney to Release Dueling Underwater-Themed Live Musical Events", "language": "en", "text": "Both Disney and Nickelodeon will be vying for our aquatic affections this winter, releasing their live Little Mermaid and The SpongeBob Musical: Live On Stage! within weeks of each other. It’s Antz vs. A Bug’s Life all over again. Disney announced the live version of The Little Mermaid back in August, but we’re only now getting images of Shaggy as Sebastian and John Stamos looking like the most theatrical pervert as Chef Louis. As a pas de deux between Mr. Boombastic and the one-and-only owner of the Big D, the ABC production stands to be the most sexually charged rendition of “Les Poissons” ever committed to tape.\n\nMeanwhile, Nickelodeon has their own undersea adventure in the works. It was announced today that Tony-nominated SpongeBob SquarePants musical will debut on the channel in December. The original cast and director are reuniting, according to Deadline. “What better way to celebrate the 20th anniversary of SpongeBob SquarePants than to bring this wildly imaginative Broadway musical to Nickelodeon for a wider audience,” said Executive Vice President of Nickelodeon Live Action Unscripted Rob Bagshaw in a statement. “We could not be more excited that fans and families of all ages will now have the opportunity to experience live actors portraying these beloved characters in a whole new way with The SpongeBob Musical: Live on Stage!”", "description": "We’re Getting a live action Little Mermaid musical and the live Spongebob Squarepants musical this winter. Disney’s undersea effort is first, debuting November 5 on ABC. The Spongebob Musical was Tony-nominated and will come to Nick in December.", "authors": ["Bethy Squires"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2017/12/04/04-spongebob-the-musical.w1200.h630.jpg", "published_at": "2019-10-18"}