{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/tv/2019/10/25/lizzie-mcguire-reboot-hilary-duff-joined-tv-mom-dad-and-brother/2454314001", "downloaded_at": "2019-10-25 16:21:14.170314+00:00", "title": "Hilary Duff reunites with TV family for 'Lizzie McGuire' reboot: See the cast now!", "language": "en", "text": "CLOSE At D23, Disney revealed several new projects that are set to be released with its new streaming service, Disney+. Veuer's Lenneia Batiste has more. Buzz60\n\nMcGuires to the max!\n\nThe \"Lizzie McGuire\" reboot will include star Hilary Duff's onscreen parents – Hallie Todd (Jo McGuire) and Robert Carradine (Sam McGuire) – along with her TV brother Jake Thomas (Matt McGuire). The foursome reunited at a script reading of the Disney+ series' first episode. The half-hour comedy originally ran on the Disney Channel from 2001-04.\n\nAn excited Duff, now 32, shared news of the cast coming together on Instagram Thursday.\n\n\"we are standing in what will soon be the McGuire living room,\" the actress wrote. \"What’s up fam. We doin this\"\n\n'Lizzie McGuire,' 'The Mandalorian' trailer: 6 Disney streaming projects that rocked D23\n\nHilary Duff struggles with son's math homework since 'real' school stopped in 3rd grade\n\nAfter the reboot was revealed in August, Duff expressed her relief with her Instagram followers.\n\n\"SURPRISE!!! I’ve been trying to contain this excitement for a loooong time while this has been in the works!\" she captioned the Aug. 23 post. \"I am beyond excited to be home again, back with my girl ♥️...and into her 30’s\"\n\nThe reboot reconnects viewers with Lizzie ahead of her 30th birthday. While she appears to have her New York City life together – working as a decorator's assistant and finding luck in love – it turns out it's still nice to be able to lean on her family, friends and that animated Lizzie.\n\nHilary Duff said it was 'a little isolating' being the first of her friends to have a baby\n\nHilary Duff is engaged to Matthew Koma and excited to show off her ring\n\nHilary Duff with her onscreen family, Hallie Todd, far left, Jake Thomas, and Robert Carradine (Photo: Ali Goldstein/Disney Channel)\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/tv/2019/10/25/lizzie-mcguire-reboot-hilary-duff-joined-tv-mom-dad-and-brother/2454314001/", "description": "McGuires to the max! The \"Lizzie McGuire\" reboot will include star Hilary Duff's onscreen parents and brother.", "authors": ["Erin Jensen", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/25/USAT/93a64e4e-7c53-430e-b4f7-419a53b3b6ae-LIZZIE_McGUIRE_Family_Photo_PhotoCredit_Ali_Goldstein.jpeg?crop=2618,1473,x267,y87&width=3200&height=1680&fit=bounds", "published_at": "2019-10-25"}