{"pub": "npr", "url": "https://npr.org/sections/money/2019/09/17/761312221/does-it-pay-for-companies-to-do-good", "downloaded_at": "2019-09-17 23:25:26.393514+00:00", "title": "Does It Pay For Companies To Do Good?", "language": "en", "text": "Does It Pay For Companies To Do Good?\n\nEnlarge this image Pixabay Pixabay\n\nEditor's note: This is an excerpt of Planet Money's newsletter. You can sign up here.\n\nLast week, many of the nation's most powerful businesspeople released a statement declaring that corporate America isn't just about profits for shareholders anymore. Instead, they wrote, companies will focus on \"delivering value to our customers,\" \"investing in our employees,\" \"dealing fairly and ethically with our suppliers\" and \"supporting the communities in which we work.\" Amazon's Jeff Bezos, Apple's Tim Cook and almost 200 other CEOs, from Chevron to Citigroup, all signed.\n\nEconomists have long debated whether companies should have any social responsibilities. Milton Friedman, infamously, rejected the notion outright. Corporate social responsibility, he argued in 1970, was \"pure and unadulterated socialism\" and he said that the only responsibility of business is to increase profits. The \"business of business is business\" became his mantra, and anything else was just kumbaya nonsense.\n\nBut it's clear that companies do care about being socially responsible, and it's not merely virtue signaling. More than 90% of the largest 250 U.S. companies produce an annual corporate social responsibility report. They spend billions and billions on social initiatives every year. They donate their products. They sell \"fair trade\" coffee and \"conflict free\" jewels. They cut their use of fossil fuels. They have whole arms of their organizations dedicated to charitable work.\n\nWhy do companies do this? And is it necessarily at odds with their bottom line? Economists have been trying to figure this out.\n\nDoes doing good pay?\n\nIn a recent study, Daniel Hedblom, Brent Hickman and John List launched an actual company to determine what happens when a business advertises itself as a do-gooder. They focused specifically on what it meant for worker recruitment and productivity.\n\nThey called their company \"HHL Solutions,\" an acronym for their last names. The company hired people online to analyze pictures from Google Street View, and they paid them to do data-entry work that served actual clients, including Uber and the University of Chicago (both institutions that had affiliations with co-author John List).\n\nThe people behind HHL Solutions recruited workers on Craigslist in 12 cities across the United States. They randomly alternated two things when recruiting. The first was how much the company would pay its workers. Wages ranged from $11 to $15 an hour. The second, and more important one, was how the company portrayed itself. HHL Solutions randomly alternated between portraying itself as a normal business and one that was dedicated to the social good. It advertised with language that said its clients did work \"aimed at improving access to education for underprivileged children\" and that it did not profit from their work in this area.\n\nWhat they found is fascinating. When their company advertised they were doing good, they saw the number of applicants increase by 25%. Using the different wages they offered as a yardstick, they calculate it would have taken them increasing the amount of pay they offered by about a third — from $11 to almost $15 an hour — to get an equivalent increase in the number of applicants. In other words, when a company says it's dedicated to helping disadvantaged children, it can pay much less and get much more.\n\nNot only that, the workers HHL Solutions recruited with a do-gooding message were of a higher caliber, and they were significantly more productive once on the job. They made fewer mistakes and analyzed more pictures from Google Street View. Hedblom, Hickman, and List conclude that corporate social responsibility \"should not be viewed as a necessary distraction from the profit motive, but rather an important part of profit maximization.\"\n\nThis study is just one in a recent slew that show that there are strong self-serving reasons for companies to spend money on initiatives aimed at improving the social good. For instance, Marianne Bertrand and co-authors find that corporations use their charitable giving in politically strategic ways, giving more money to influential congressional districts when it suits their purposes. They call it \"tax-exempt lobbying.\"\n\nSo there are reasons to be cynical about corporate social responsibility. John List — the \"L\" in HHL Solutions — says that yes, his research shows that \"people generally want to do good.\" He adds that this includes those corporate executives who signed that statement saying their companies are about more than just profits. But he also believes that the real reason for their recent statement, like other efforts to paint themselves as a force for social good, comes down to dollars and cents.\n\nDid you enjoy this newsletter? Well, it looks even better in your inbox! You can sign up here.", "description": "As corporate America seeks to redefine its mission as a force for social good, new studies in economics are showing that there are self-serving reasons why they'd want to do that.", "authors": ["Greg Rosalsky"], "top_image": "https://media.npr.org/assets/img/2019/09/16/money-652560_1280_wide-5c085f0fc96f2b23c7a622541dee3cc8a61a2d79.jpg?s=1400", "published_at": "2019-09-17"}