{"pub": "americanconservative", "url": "https://theamericanconservative.com/dreher/learning-from-the-spanish-civil-war", "downloaded_at": "2019-10-29 02:16:45.076626+00:00", "title": "Learning From The Spanish Civil War", "language": "en", "text": "Over the past few days, I watched a 1983 British television documentary about the Spanish Civil War. It’s six hours long, but you can watch it all on YouTube, starting here. I think it was Uncle Chuckie who recommended it — and boy oh boy, was that ever a solid call. Last week I posted here that I knew almost nothing about the Spanish Civil War, but now I can’t say that. The passion, the pain, and the terrible tragedy of that three-year conflict (1936-39) came vividly alive in the series, which was impressively balanced. I expected it to be heavily tilted toward the Republican (leftist) side, but the UK producers allowed both left and right to tell their stories. One advantage the filmmakers had is that they made it in the early 1980s, when many of those who lived through and even fought in the conflict were still alive to offer their testimony.\n\nWhat follows are some scattered impressions.\n\nMaybe it’s an American thing, but it’s hard to look at a conflict like this without imposing a simple moralistic narrative on it, between the Good Guys and the Bad Guys. Certainly the received history of the conflict frames it as an unambiguous fight between democracy and fascism — and the evil fascists won. The truth is far more complicated.\n\nIn fact, the filmmakers make a point of saying that ideologues and others who project certain narratives onto the conflict do so by ignoring aspects of it that were particularly Spanish. That is to say, though the civil war did become a conflict between fascism and communism (and therefore a proxy war between Nazi Germany and the Soviet Union), that’s not the whole story. Its roots have a lot to do with the structure and history of Spain itself.\n\nThe first episode covers the years 1931-35, which covers the background to the war. In 1930, the military dictatorship was overthrown, and municipal elections across the country the next year led to a big win for combined parties of left and right who favored a democratic republic. (N.B., not all leftists and rightists wanted a republic!) After the vote, the king abdicated, and the Republic was declared. Later that spring, leftist mobs burned convents and churches in various cities, while Republican police stood by doing nothing. This sent a deep shock wave through Spanish Catholicism.\n\nThe Republic, in typical European fashion, was strongly anticlerical. It quickly passed laws stripping the Catholic Church of property and the right to educate young people. There were other anticlerical measures taken. Anti-Christian laws, and violent mob action, were present at the beginning of the Republic. Prior to watching this documentary, I assumed they happened as part of the civil war itself. Imagine what it was like to see a new constitutional order (the Republic) come into being, and suddenly you can’t give your children a religious education, and your churches and convents are being torched. How confident would you be in the new order?\n\nAccording to the film, Spain was still in the 19th century, in terms of economics. It was largely agrarian, with a massive peasantry that was underfed, and tended to be religious and traditional. On the other hand, they were dependent on large landowners who favored the semi-feudal conditions. These landowners were extremely conservative. Their interests clashed, obviously, and became violent when the land reform promised by the liberal Republicans did not materialize fast enough for the peasantry. Mind you, the Republic was declared in the middle of the global Great Depression, with all the political and economic turmoil that came with it.\n\nThe urban working class was organized along Marxist lines, though the left was badly fractured, and unstable. There were democratic socialists, but also communists who hewed closely to the Stalinist line. Plus, anarchists were a really significant force in Spain, something unique in Europe at the time. They competed politically, and usually aligned with the left in fighting the right. But they refused to compromise their principles by taking formal power, even when the defense of the Republic required it.\n\nRegional autonomy also played a role in defining sides. When the civil war started, Catholics supported the Nationalist side (the Francoists) … but not in the Basque Country, which was religious, but which wanted more self-rule — something the Nationalists despised. Catalonia also wanted more independence, which meant it was firmly Republican. Barcelona, the Catalan capital, was a Republican stronghold for left-wing reasons, to be sure. I bring up the situation with the Basques and the Catalans simply to illustrate the complexity of the conflict.\n\nAnyway, the 1933 elections resulted in a swing back to the right, with a coalition of center-right and far-right parties winning control, and reversing some of the initiatives of the previous government. Socialists, anarchists, and coal miners in the province of Asturias rebelled against the Republic. They murdered priests and government officials; the military, led by Gen. Franco, brutally suppressed the uprising. All of this radicalized the left even more.\n\nBy 1935, left-right opinion had become so polarized that there was practically no middle ground left. Both sides came to distrust democracy because it was the means by which\n\ntheir enemies might take power. And, as one Nationalist interviewed in the documentary puts it, people on the left and right just flat out hated each other. The whole country was a powder keg.\n\nBy the 1936 campaign, the centrist parties had practically disappeared. A leftist coalition won the vote, but deadly violence between left and right began ramping up. A far-right fascist militia, the Falange, formed. Mutual assassinations on both sides, and street fighting between Falangists and Republican forces, triggered a military coup against the government. The coup failed to overthrow the Republic, but it did divide the country, and spark a civil war between Nationalists and Republicans. Gen. Francisco Franco quickly emerged as the Nationalist leader.\n\nI give you all that history to show what was news to me: that this was by no means a simple case of right-wing military figures trying to overthrow a democratically elected government — though it was that too!\n\nThe series devotes an hour each to the complicated internal politics of both the left and the right. All my life I’ve heard Franco and the Nationalist side described as “fascist,” but it’s not accurate. True, the Nationalist had real fascists in their ranks — that was the Falange — but Franco exploited and controlled them. The Falange’s founder, Jose Antonio Rivera, was killed by the Republicans, and turned into a martyr by the Nationalists. Doing so allowed Franco to embrace the Falange but also to defang them as a political force. In the film, an elderly Falangist complains that Franco was not a real fascist, and he wouldn’t seriously implement the Falange’s program (e.g., Falangism’s opposition to capitalism).\n\nThe documentary says Franco ought to be understood as a hard-right conservative authoritarian, not a fascist. Mussolini was a big supporter, and sent troops and military aid, but was frustrated by Franco’s failure to be affirmatively fascist. Hitler sent lots of military aid, which was critically important to the Nationalist victory, but was angry at Franco for not being willing to be more Nazi-like. The truth is, Franco was trying to lead a reactionary coalition of fascists, monarchists, traditionalist Catholics, and others on the Right. The Spanish Right by and large did not trust the Spanish fascists, who were revolutionary modernists. This is an example of the filmmakers’ point that you can’t get a true grasp on what was happening in Spain at the time by imposing a narrative that overlooks particularly Spanish characteristics of the conflict.\n\nFranco managed to unite the right, but the left remained hopelessly mired in internal rivalry. If you’ve read Orwell’s Homage To Catalonia — which I did in the early 1990s, and forgot all about — you know something about how fissiparous and treacherous left-wing politics were in the Spanish Civil War. Orwell went to Spain to fight with the POUM, the democratic socialists. They were set upon and betrayed by Spanish communists loyal to the Soviet Union. The Soviets were open supporters, military and otherwise, of the Republicans, but also instructed their Spanish followers to undermine the non-communist left.\n\nTwo things struck me about the left. I mentioned earlier the role of the anarchist militias, and how they were both crucial to the Republican war effort — they were fierce fighters — but also an Achilles heel, because they were obstinately principled. There’s a passage in the film in which a Republican veteran talks about how hard it was to get the anarchists to take military orders (naturally!). They would stand around debating about whether or not they should obey an order, while the far more disciplined Nationalists would be making gains. Isn’t that cartoonish, in a herding-cats way? But it happened.\n\nThe other thing — and this, to me, was the more important thing — was how off-the-hook crazy the Spanish left was. In 1936, after the start of the war, the anarchists and left-wing supporters led a revolution within the Republic. Here’s Orwell describing revolutionary Barcelona:\n\nIt was the first time that I had ever been in a town where the working class was in the saddle. Practically every building of any size had been seized by the workers and was draped with red flags and with the red and black flag of the Anarchists; every wall was scrawled with the hammer and sickle and with the initials of the revolutionary parties; almost every church had been gutted and its images burnt. Churches here and there were being systematically demolished by gangs of workmen. Every shop and cafe had an inscription saying that it had been collectivized; even the bootblacks had been collectivized and their boxes painted red and black.\n\nThat’s from Orwell, but this is reported in the Granada documentary too. It’s this kind of thing that made me aware that had I been alive then, I would have 100 percent supported the Nationalists. It was truly a revolution, and violently anti-Christian to the core. It was brought low by the communists, on Moscow’s orders, on the grounds that defeating fascism had to come before the revolution. The communists were right.\n\n[UPDATE: A reader points out that I can’t possibly know how I would have reacted had I been born Spanish, and had been there at the time. This is a fair point, of course. I should have made the more modest and defensible claim that watching the documentary made me certain that I am glad the Nationalists won. Had I been there at the time, though, as a Spaniard, I likely would have fought for whichever side my family and friends supported. Similarly in the US Civil War, it would be silly for me to say that had I been there at the time, I 100 percent would have supported the Union, for anti-slavery reasons. I am against slavery, naturally, and like to think I would have fought for the Union. But the truth is, had I been there, I would almost certainly have fought for the South, like my family and friends, because I would have seen it as fighting for them. This is a good reason for all of us, whatever our political convictions, to be careful about passing harsh judgment on Spaniards of the era. We may well know today how we would like to have acted were we participants in the events of that era, but that is not at all the same thing as knowing with any certainty how we would have acted. — RD]\n\nAt the end of the documentary, there were film clips showing Catholics who lived in Madrid and other Republican-controlled cities, going to public masses. An old Catholic who had lived through those times told the filmmakers that for the first time in years, they could be public about their faith. That’s how I knew for sure that the correct side had won the war.\n\nHowever, the Nationalists were exceptionally merciless in victory. Both sides committed appalling atrocities during the war, but after Franco won, he was cruel to the vanquished. He established a hardline Catholic autocracy that ruled Spain until his death in 1975. It’s not surprising that what Franco stood for did not survive him.\n\nWatching the film made me realize what an Anglo-American right-wing liberal I am, by temperament. I would have been quite out of place in Franco’s Spain. I suspect that many left-wing Americans who watch it will realize the same thing about themselves when faced with the excesses of the Spanish left. The inhumanity of Francoism is undeniable.\n\nAnd yet, there was no conservative-liberal alternative in 1930s Spain — nor were there any liberal-liberal alternatives, in the sense that we Americans recognize. Most members of the Democratic Party today would not be as anti-Christian as mainstream Spanish leftists in 1931. There are very few members of the GOP who are as hardline as Spanish rightists were. But — here’s the thing — the dynamic that radicalized both sides is recognizably emerging here.\n\nHow would you have felt as a Spanish Catholic in 1931, watching the new Republic pass laws closing Catholic schools and taking away many of your religious liberties, and then, when leftist mobs started burning churches and convents, observing the police letting it happen? How might that have affected you politically? Similarly, if you were on the left, and saw the Falangists, bona fide fascists, making alliances with other right-wing parties, and growing in strength and influence, how would that likely affect your political judgment?\n\nI want to say something about religion. The documentary’s attention to the radical, violent, even murderous anticlericalism of the Spanish Republic and its supporters deeply affected my historical judgment about the conflict. Before watching it, I knew that the Spanish left had been anticlerical, but again, I thought it was something the left did in the heat of war. I had not realized how radically anticlerical they were long before the fighting started, and how they used democratically acquired powers not to reform the role of the Church in Spanish life — something that is defensible, in principle — but to amputate it from the body politic. So intense was the Republican hatred of religion that its politicians either could not anticipate the reaction from Spanish Catholics, or did not care.\n\nWatching this in the documentary made me reflect on how we are living through a much less vivid version of the same thing here. As the American left secularizes — and as that secularization expands — the left’s hostility to religion, as well as its inability to comprehend why religion matters so much to others, will likely bring about a more aggressively anti-religious state. Damon Linker wrote about this last year. Excerpt:\n\nMore traditional religious believers already feel under siege from the federal government and an often overtly hostile surrounding culture. Liberals tend to dismiss this as paranoia and whining. But as we saw with Democratic Sen. Dianne Feinstein’s harsh questioning on Wednesday of judicial nominee Amy Barrett, a devout Catholic, the impression isn’t wholly without foundation in reality. (Back in June, Bernie Sanders posed similarly accusatory questions to a conservative evangelical nominee for the Office of Management and Budget.) The message conservative believers hear from liberals and the left is clear: If you hold traditionally religious views, you will be treated as an unwelcome outsider in American public life. This hostility has provoked a shift in the goals and outlook of traditionalist Christians. Where once they thought of themselves as a “moral majority” that might retake political and cultural institutions and transform them in their image, now they merely want to ensure that the government’s power to persecute them is restrained. (Hence the emphasis of the dwindling religious right on religious liberty protections.) Hence also the strategic (some say cynical) alliance many evangelicals forged with Donald Trump during the 2016 presidential campaign. There is abundant anecdotal evidence that the alliance may well backfire, hastening the exit of young (overwhelmingly anti-Trump) evangelicals from the faith. But those evangelical leaders who supported and continue to stand by Trump would likely say that this eventuality makes it even more essential to establish a strong presidential protection racket for religious institutions. The smaller and less powerful the church becomes, the more persecution it is likely to face in an increasingly secular (and sometimes even explicitly anti-religious) common culture. In this respect, the rise of Donald Trump to the presidency was driven in part by a precipitous collapse in the power of the churches in American public life.\n\nWe conservative Christians are very well aware that to our opponents, religious liberty is nothing more than an excuse for hating on LGBTs. This idea would have been strange a generation ago, when standing for religious liberty was a bipartisan cause. When you are not religious yourself, and when you know no one who is religious, and when you have taken up egalitarianism as a secular religious crusade, it’s easy to find yourself with incomprehension of religious believers, and contempt for them as Enemies Of Progress.\n\nThe historical and cultural contexts are not the same for the Spanish left of 1931, and the American left of 2019, but the incomprehension and contempt for religion is similar. And, as Linker (a liberal) points out, there is no reason to believe that when younger Americans detach from religion — as is happening widely — that they will become secular liberals or progressives:\n\nAs Trump’s strong support in the GOP primaries among non-religious Republicans attests, a significant number of the post-religious (especially those who are less well educated) could well end up on the nationalist alt-right.\n\nThe Spanish Civil War documentary doesn’t go into this level of detail, but I find it unlikely that many of Spain’s Catholics were enthusiastic about all members of the Nationalist coalition. In fact, I read elsewhere that middle-class and upper-class Spanish traditionalists and conservatives regarded the Falange with the same kind of disdain that many American rightists see the alt-right, and the more enthusiastic #MAGA backers. Nevertheless, if you are a Christian, and you have to choose between a party whose members you don’t like for whatever reasons, but who will leave you alone, and a party whose members will take away your religious liberties, and, at the extreme, will burn your churches — well, that’s not much of a choice, is it?\n\nI can’t stress this enough: we Americans today are not dealing with the extremes of the early Spanish Second Republic. We have a much deeper and older tradition of democracy than Spain did. We do not (yet) have the intense and grinding class divisions that Spain did. We are not remotely as poor as Spain was back then. But the care we have to take not to overstate the comparison should not cause us to dismiss the parallels in the political dynamic that led to the end of democracy, and civil war — especially if something like the Great Depression struck.\n\nWhether you are for or against Donald Trump, it should be obvious that his election, and takeover of the GOP, has destabilized American politics, and the broad establishment consensus around which it has been based since time immemorial. Whether that’s a good or a bad thing is beside the point here. The point is that something massively important has happened, something that shakes the system. Trump’s radicalism has mostly not manifested in actual policies, but in his flagrant repudiation of ethical and procedural norms.\n\nIf I were on the political left, and I saw that conservative voters were willing to nominate a man like Donald Trump, make him president, and allow him to govern with little opposition, it would unnerve me, and make me more radical. If I observed things like Scott Walker and Republican legislators in Wisconsin passing bills to limit the powers of the incoming Democratic governor, I would be tempted to lose a lot of faith in democracy. The Republicans in Wisconsin did not trust the Democrats with power, and tried to blunt the effects of the last election. It may be legal, but it is clearly undemocratic, and a vote of no confidence in the system. It shouldn’t surprise anybody that Democrats respond with the same cynicism.\n\nMeanwhile, in New Jersey, the Democratic Party, which has its hands firmly on the grips of power, is trying to use redistricting to make the state’s Republicans a permanent minority. It’s so undemocratic that even some prominent Democrats outside the state (e.g., Eric Holder) have spoken out against it. Still, there it is. It’s another example of one party using its power in ways that undermine confidence in democracy. If this kind of thing takes hold, what are the brakes on it? This is how democracy collapsed in Spain: with both left and right coming to fear and loathe each other so intensely that they ceased to respect a system that allowed their enemies to come to power. And when parties did come to power, they so feared and loathed the Other that they did as much as they could to advance their own interests, heedless of the opposition, in order to gain “territory,” so to speak, in advance of the next election, which could flip power back to the other side.\n\nFor many of us conservatives who either do not like Trump, or who at least are very skeptical of him, the utterly disgraceful behavior of the Democratic Party in the matter of the Brett Kavanaugh nomination was a clear sign of how far the left party is willing to go to protect its goals. I felt it myself, and talked to a number of conservatives who came away from the Kavanaugh hearings feeling more radicalized. The idea was, if they will do that to him, they’ll do that to me, if they win power, and have the opportunity.\n\nThis is exactly the kind of thing that unraveled the Spanish Republic. And, to be fair, the refusal of Senate Republicans to give Judge Merrick Garland a hearing may have been hardball politics, but it was also one of those things that delegitimizes the system.\n\nAgain: The historical example of the Second Spanish Republic shows what contempt for the opposition does to the stability of democracy. This is not only true of the Spanish Republic, but for the Roman Republic too. In his new book Mortal Republic, which examines how the Roman Republic fell apart and gave way to tyranny, historian Edward Watts observes:\n\nRome shows that the basic, most important function of a republic is to create a political space that is governed by laws, fosters compromise, shares governing responsibility among a group of representatives, and rewards good stewardship. Politics in such a republic should not be a zero-sum game. The politician who wins a political struggle may be honored, but one who loses should not be punished. The Roman Republic did not encourage its leaders to seek complete and total political victory. It was not designed to force one side to accept everything the other wanted. Instead, it offered tools that, like the American filibuster, served to keep the process of political negotiation going until a mutually agreeable compromise was found. This process worked very well in Rome for centuries, but it worked only because most Roman politicians accepted the laws and norms of the Republic.\n\nWatts says that in the Roman Republic’s final century, politicians began to use the mechanisms of governance in ways that disproportionately favored their own side, and punished the other side. They surrendered a sense of “fair play,” and began to see politics as a zero-sum game. Violence in the streets between political factions followed — just as it had in the Spanish Republic. Watts writes:\n\nRoman history could not more clearly show that, when citizens look away as their leaders engage in these corrosive behaviors [i.e., practicing zero-sum politics, and encouraging street violence between political factions], their republic is in mortal danger. Unpunished political dysfunction prevents consensus and encourages violence. In Rome, it eventually led Romans to trade their Republic for the security of an autocracy. This is how a republic dies.\n\nLast year, David Blankenhorn made a list of 14 causes of political polarization in our time. It’s well worth reading. He calls the final one the most important cause:\n\n14. The growing influence of certain ways of thinking about each other. These polarizing habits of mind and heart include: Favoring binary (either/or) thinking.\n\nAbsolutizing one’s preferred values.\n\nViewing uncertainty as a mark of weakness or sin.\n\nIndulging in motivated reasoning (always and only looking for evidence that supports your side).\n\nRelying on deductive logic (believing that general premises justify specific conclusions).\n\nAssuming that one’s opponents are motivated by bad faith.\n\nPermitting the desire for approval from an in-group (“my side”) to guide one’s thinking.\n\nSuccumbing intellectually and spiritually to the desire to dominate others (what Saint Augustine called libido dominandi).\n\nDeclining for oppositional reasons to agree on basic facts and on the meaning of evidence. These ways of thinking constitute the actual precipitation of polarization—the direct and immediate causes of holding exaggerated and stereotyped views of each other, treating our political opponent as enemies, exhibiting growing rancor and aggression in public life, and acting as if common ground does not exist.\n\nWell, yes, this is true. What I wonder, though, is how much common ground actually exists. I don’t deny that it does, but I seriously doubt whether as much still exists as people like to think. I am reminded of this 2015 post of my interview with “Prof. Kingsfield,” the pseudonym of a professor at one of America’s most elite law schools. He and I spoke right after the Indiana RFRA fight of 2018:\n\n“Alasdair Macintyre is right,” he said. “It’s like a nuclear bomb went off, but in slow motion.” What he meant by this is that our culture has lost the ability to reason together, because too many of us want and believe radically incompatible things. But only one side has the power. When I asked Kingsfield what most people outside elite legal and academic circles don’t understand about the way elites think, he said “there’s this radical incomprehension of religion.” “They think religion is all about being happy-clappy and nice, or should be, so they don’t see any legitimate grounds for the clash,” he said. “They make so many errors, but they don’t want to listen.” To elites in his circles, Kingsfield continued, “at best religion is something consenting adult should do behind closed doors. They don’t really understand that there’s a link between Sister Helen Prejean’s faith and the work she does on the death penalty. There’s a lot of looking down on flyover country, one middle America. “The sad thing,” he said, “is that the old ways of aspiring to truth, seeing all knowledge as part of learning about the nature of reality, they don’t hold. It’s all about power. They’ve got cultural power, and think they should use it for good, but their idea of good is not anchored in anything. They’ve got a lot of power in courts and in politics and in education. Their job is to challenge people to think critically, but thinking critically means thinking like them. They really do think that they know so much more than anybody did before, and there is no point in listening to anybody else, because they have all the answers, and believe that they are good.” On the conservative side, said Kingsfield, Republican politicians are abysmal at making a public case for why religious liberty is fundamental to American life. “The fact that Mike Pence can’t articulate it, and Asa Hutchinson doesn’t care and can’t articulate it, is shocking,” Kingsfield said. “Huckabee gets it and Santorum gets it, but they’re marginal figures. Why can’t Republicans articulate this? We don’t have anybody who gets it and who can unite us. Barring that, the craven business community will drag the Republican Party along wherever the culture is leading, and lawyers, academics, and media will cheer because they can’t imagine that they might be wrong about any of it.”\n\nHere we are three years later, and Republicans have done very little on religious liberty. It’s not nothing that they aren’t hostile to it, as Democrats are — but that’s not the same thing as taking affirmative measures to protect it. A side issue illuminates more starkly how useless the GOP is on socially conservative legislation: despite that fact that Republicans controlled both houses of Congress and the presidency, they still wouldn’t defund Planned Parenthood.\n\nOf course we keep voting for them because even if they don’t want to help us, it’s better to vote for people who don’t want to hurt us than for people who do. But I digress.\n\nDavid Brooks foresees a critical challenge facing conservatives in this new year. He says we are likely to see indictments of Trump insiders this year. And:\n\nIf we lived in a healthy society, the ensuing indictments would be handled in a serious way — somber congressional hearings, dispassionate court proceedings. Everybody would step back and be sobered by the fact that our very system of law is at stake.\n\nBut we don’t live in that world anymore. If indictments are handed down and we move towards trial, we know what Donald Trump will do. The question is, says Brooks: what will the Republican Party do? What if it sides with Trump and describes the proceedings as a political farce? If that happens, then the roughly 40 percent of Americans who support Trump will see serious evidence that he committed felonies, but they won’t care! They’ll conclude that this is not about law or integrity. It’s just a political show trial. They’ll see there is no higher authority that all Americans are accountable to. It’s just power and popularity straight through. If that happens, we’ll have to face the fact that our Constitution and system of law were not strong enough to withstand the partisan furies that now define our politics. We’ll have to face the fact that America has become another fragile state — a kakistocracy, where laws are passed and broken without consequence, where good people lay low and where wolves are left free to prey on the weak. He’s right. Understand that Brooks, though he despises Trump, is not making a merely partisan point here. It really matters if 40 percent of the US public sees evidence of felonious behavior in a president, but don’t care. It is a sign of deep decadence. On the other hand, it must be asked how we got to a point when so many people prefer Trump to rule by a Democrat. This is not to excuse them (a “them” which might well include me), but rather to serve as a spur to serious analytical thinking. Why did so many Spanish Catholics and middle-class Spaniards throw in with right-wing autocracy over a democratically elected Republic? If you say that the Spanish left’s words and deeds had nothing to do with driving people to the right, you’re blinding yourself. But the opposite is also true. It was true in Spain then, and it’s true in America now. We on the right have to own our part in this destructive dynamic. It’s important to add that, as Tucker Carlson explained three years ago, when Trump was still a GOP primary punch line, Trump is in large part a judgment on the failures of the conservative Washington Establishment. There’s no question that Trump is an accelerant in the burning down of the Republic, if that, indeed, is what’s happening. The thing I can’t settle in my mind is this: is this fate inevitable? Was the Spanish Republic’s fate? Watching the documentary, it is hard for me to see what might have happened in Spain to save the Republic. The divisions were too deep, and the passions too strong. However, as I said at the beginning of this post, quoting the filmmakers, we can’t understand what happened in Spain by imposing the politics of other countries onto it. Spain had a militant right wing that was aligned with Nazis and Fascists, but it was not Nazi, and it was not entirely Fascist. Spain had a militant left wing that was aligned with Stalin and the USSR, but it was not entirely Stalinist. The civil war took on aspects of ideological warfare in other European countries, but it was, at its core, a Spanish thing. Similarly, comparisons between America today and Spain in 1931 can only go so far. Still, they can be made, and ought to be made, not least so we can think about how we might avoid the fate of the Spanish Republic. If we can. If you see nothing else of the Granada series, watch the first episode: “Prelude To Tragedy”. Prior to watching the film, I didn’t know enough about the Spanish Civil War to have understood why it was a tragedy, in the precise sense (as distinct from the general sense of the word “tragedy” to mean “a bad thing that happened”). Now I see that it was exactly that: a catastrophe that was unavoidable, and the dénouement of which elicits both pity and terror — pity for the suffering of all Spaniards, left and right, and terror at what the civil war reveals about the fragility of civilization. If nothing else, learning about the modern history of Spain has evoked a certain tenderness in my heart for that country, which I do not know. I’m very much looking forward to my visit this month. To this blog’s Spanish readers, I hope to meet some of you: UPDATE: Reader Luis comments: Thank you for this post, Rod. I’m a Portuguese national who has been living in the States for the last ten years. Though these events are not directly part of my country’s history but rather that of “nuestros hermanos”, as we affectionately call our Iberian neighbors, I have long been fascinated with the Spanish Civil War and I do think there are some parallels with our time (mutatis mutandis). In particular, I think you get to the tragic heart of it all when you say: “The Spanish Civil War documentary doesn’t go into this level of detail, but I find it unlikely that many of Spain’s Catholics were enthusiastic about all members of the Nationalist coalition. In fact, I read elsewhere that middle-class and upper-class Spanish traditionalists and conservatives regarded the Falange with the same kind of disdain that many American rightists see the alt-right, and the more enthusiastic #MAGA backers. Nevertheless, if you are a Christian, and you have to choose between a party whose members you don’t like for whatever reasons, but who will leave you alone, and a party whose members will take away your religious liberties, and, at the extreme, will burn your churches — well, that’s not much of a choice, is it?” The tragedy of the Spanish Civil War was indeed that it drowned out the moderates on both sides, forcing them into Faustian bargains. The problem is, Franco’s integralism (as Salazar’s in my country) was ultimately disastrous for the moral authority of the Church. I think something similar will happen in the US – this alliance of religious/social conservatives with the Falange-viva-la-muerte-alt-right types will be the end of us. And it’ll happen much sooner than it happened to Catholicism in Spain. Miguel de Unamuno saw this coming in Spain by the way. He pleaded at the time that the Church be more open towards political liberalism since only political liberalism, he thought, offered a chance for spiritual rejuvenation of his country. He was a voice crying in the wilderness. But he was right. Franco was ultimately the undertaker of Spanish catholicism. Yes, Franco delivered the Spanish Church from martyrdom – and I am not making light of the suffering of martyrs. But avoiding martyrdom came at a price – the price of a slow spiritual and moral death. From a supernatural perspective (again, not making light of suffering), which one is worse? Frankly this is why all this Deneen nonsense about the errors of political liberalism really gets my blood boiling. Our only hope lies in (classical) liberal values, in reasoned debate in the “marketplace of ideas”. It’s not sexy, I know – intellectuals love being armchair rebels, especially in a country like the U.S. where since liberalism is the historical norm, you can come across as a daring maverick for defending the utter insane idea that integralism in 21st century America makes any kind of sense or has any kind of relevance. So no, I don’t think we need to join the National Front of our day. What we need is more Unamunos. And if it turns out that we’ll be voices crying in the desert and that there won’t be enough of us to make any real political difference, then at least I prefer that kind of tragedy to that of the Faustian bargain. But maybe I’m too much of an idealist… With all of that being said, who knows what any of us would have done in 1930s Spain? I certainly understand those who reluctantly supported the National Front, exactly for the reasons you give. But understanding them doesn’t mean that I hold them as the ideal or the model to be followed in our day (or in theirs). UPDATE.2: Look, folks, don’t mess up the thread with whataboutism of the left or the right. I’m not going to post it. You’re boring me to death with it. Advertisement Culture war, Decline and Fall, Politics, UK/Europe, War, Spain, nationalism, Rome, David Brooks, Republican Party, fascism, documentary, Democratic Party, Donald Trump, Spanish Civil War, republic, Communists, Edward J. Watts, Francisco Franco, anarchists, Granada TV, socialists, Falange. Posted in Culture All Things Trump . Tagged GOP", "description": "", "authors": ["Rod Dreher"], "top_image": "https://www.theamericanconservative.com/wp-content/uploads/2019/01/tcg4vvhy0n8z-e1546360360174.jpg", "published_at": "2019-01-01"}