{"pub": "yahoo", "url": "https://sports.yahoo.com/fantasy-hockey-drafts-key-goaltender-situations-to-monitor-230530290.html", "downloaded_at": "2019-09-25 13:52:02.502304+00:00", "title": "Fantasy Hockey Drafts: Key Goaltender situations to monitor", "language": "en", "text": "By Jason Chen, RotoWire\n\nSpecial to Yahoo Sports\n\nThere are 31 starting jobs in the league, and on average, only 20 goalies will win more than 25 games each season. High-quality goaltending is scarce, and fantasy gamers without a premier starter will have to get lucky on the waiver wire or pay through the nose via trade in order to be successful. Like any real-life team, the backbone of a good fantasy team is a high-end goaltender.\n\nScroll to continue with content Ad\n\nThis article will detail which netminder is on the hot seat, which have sneaky upside, which can be viewed as deep stashes and which will enter the campaign in a full-blown timeshare.\n\nHot Seat\n\nMikko Koskinen, Edmonton Oilers\n\nKoskinen earned an extension in January because he was the only half-decent goalie on a team bereft of a quality puck-stopper. He's allowed six goals on 43 shots through five periods of preseason play, and while no one should take preseason stats too seriously, it's definitely concerning. Mike Smith, who was Dave Tippett's trusted goalie from 2011-17 with the Coyotes, is still capable of the occasional hot streak and is an upgrade — if only marginally so — over Cam Talbot. Koskinen's ADP of 171.9 on Yahoo is indicative of his talent and slightly ahead of Smith's 180.5 ADP, which is the third-smallest difference in ADP between a starter and backup behind only Columbus and New Jersey. The Oilers have the fourth-highest travel distance this season, so look for them to prioritize rest for their goalies.\n\nSneaky Upside\n\nElvis Merzlikins, Columbus Blue Jackets\n\nStory continues\n\nHe's known as one of the most talented goalies outside of the NHL, twice named the best netminder in Switzerland's top league. Last year's backup, Joonas Korpisalo, has the inside track on the starting job mostly due to familiarity, but throughout his NHL tenure, he's yet to show that he can be a reliable starter, owning a .907 save percentage through 81 career starts. Merzlikins will need to be eased into a grueling NHL schedule, but the Jackets were stout defensively last season, which should help with the transition. John Tortorella is notoriously short on patience with goalies, so he's likely to throw Merzlikins into action if Korpisalo struggles.\n\nCory Schneider, New Jersey Devils\n\nAn infusion of new talent — Jack Hughes, Nikita Gusev, and P.K. Subban — along with a healthy Taylor Hall should provide the Devils with the necessary firepower to get back to the postseason in 2019-20. Schneider is 33 years old and his injury history is very concerning — he suffered through a 24-game losing streak while battling groin and hip issues over the past two campaigns. But, when healthy, he showed signs of his former self last year, posting a combined .924 save percentage in February and March. John Hynes has indicated that he'd prefer not to have a timeshare, so Schneider has a chance to cement himself as the No. 1.\n\nDon't count the veteran out this season. Mandatory Credit: James Guillory-USA TODAY Sports\n\nMacKenzie Blackwood, 22, is seen as the franchise's future goalie, but he's still very green with just 23 career games under his belt. Schneider's 175.9 ADP on Yahoo does not reflect his potential upside, and if he stays healthy, he could be a viable No. 2 goalie for fantasy gamers.\n\nDeep Stashes\n\nLinus Ullmark, Buffalo Sabres\n\nWhen the Sabres signed 33-year-old Carter Hutton to a three-year contract last summer, it was with the intention that he'd be a stopgap for future franchise goalies Linus Ullmark and Ukko-Pekka Luukkonen. Luukkonen recently won gold for Finland at the U18's and World Juniors, but don't forget that Ullmark was the top goalie in the Swedish Elite League when he was just 21 years old and also a two-time AHL All-Star before splitting starts with Hutton last season. If Hutton struggles again, as he did last year while posting a save percentage of .910 or lower in four of seven months, the Sabres won't hesitate to give Ullmark more starts as they continue to groom him.\n\nThatcher Demko, Vancouver Canucks\n\nJacob Markstrom was outstanding last season but enters the final year of his contract without any (public) talk of an extension. That's likely because the Canucks see Demko as their goalie of the future, and re-signing Markstrom could deviate from their long-term plans. If the Canucks aren't in the playoff race, Markstrom could be a valuable trade chip. Demko is worth a stash in dynasty or keeper leagues and worth keeping an eye on as the season progresses in redraft formats.\n\nTimeshares\n\nAntti Raanta and Darcy Kuemper, Arizona Coyotes\n\nThe incumbent starter is Raanta, but be wary of Kuemper, who turned in a fantastic performance last season. When healthy, Raanta figures to be a borderline elite goalie, but poor health has robbed him of a chance to really cement himself in the upper echelon. Both goalies are healthy entering the season, and both Rick Tocchet and goalie coach Corey Schwab have expressed a lot of confidence in their duo. However, Kuemper has been slightly better in camp while Raanta has tried to shake off some rust, making Kuemper the more likely opening-night starter. In the load management era, however, look for Tocchet to split the starts while waiting to see who will emerge with the hotter hand. Fantasy gamers who like the Coyotes' outlook this season should opt for the handcuff to be safe.\n\nCorey Crawford and Robin Lehner, Chicago Blackhawks\n\nThe Blackhawks are divisive. Advanced analytics predict them to miss the playoffs and be a bottom-10 team, but on paper, they've beefed up their defense and goaltending, and their young forwards were impressive last season. The acquisition of Lehner is a huge upgrade over Cam Ward, and Lehner also serves as a solid insurance policy for Crawford (and his long history of concussions). It would be smart for fantasy gamers to draft both, as it wouldn't be surprising to see Lehner take over the starting job, but Crawford has the edge right now given his tenure with the team.\n\nSemyon Varlamov and Thomas Greiss, New York Islanders\n\nThe Islanders are due for a big regression in 2019-20. Just half of their Jennings Trophy-winning tandem has returned, and even at his best, Varlamov wasn't as good as Lehner last season. Greiss figures to be the starter, but with $20 million committed to Varlamov over the next four seasons, the Islanders must see him as more than just a backup. Barry Trotz will probably go with the hot hand, just as he did last season, and Varlamov has the edge with a stronger preseason performance so far. He also has the higher pedigree, and if goalie coach Mitch Korn can help him rediscover his top form, Varlamov could get the bulk of the starts.\n\nMore From Yahoo Fantasy Sports", "description": "We highlight some key goaltender situations worth monitoring going into your fantasy hockey drafts, including the upside veteran Cory Schneider could provide for New Jersey — and fantasy gamers who draft him.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/TvCJVtGiKHxnEqNWhSBIOA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/ujtqRNbCtC31SqEOPfPF_Q--~B/aD00MDAwO3c9NjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/97804690-df1e-11e9-975f-da3907056ca9", "published_at": "2019-09-24"}