{"pub": "foxnews", "url": "https://foxnews.com/us/business-executive-parent-sentence-college-admissions-scandal", "downloaded_at": "2019-09-24 16:00:50.950977+00:00", "title": "LA business exec to become 2nd parent to be sentenced in college admissions scandal", "language": "en", "text": "A Los Angeles business executive faces sentencing Tuesday for his role in the college admissions scandal that has snagged actresses Felicity Huffman and Lori Loughlin.\n\nDevin Sloane admitted paying $250,000 to get his son into the University of Southern California as a bogus water polo star.\n\nProsecutors are requesting a year and a day in prison and a $75,000 fine. His lawyers are urging three years of supervised release, a fine and 2,000 hours of community service.\n\nThe case is being handled in Boston Federal Court.\n\nCHINESE PARENT CHARGED IN COLLEGE ADMISSIONS SCANDAL ARRESTED IN SPAIN, TO BE EXTRADITED TO US\n\nThe scandal has led to charges against 51 people, including 35 parents, and exposed a college admissions system seeming to favor the privileged — outraging many parents trying to get their children into good schools without cheating.\n\nHuffman drew a 14-day sentence behind bars last week after pleading guilty to paying $15,000 to have someone correct answers on her oldest daughter’s SAT exam. Prosecutors sought 30 days.\n\nSloane, 53, pleaded guilty in May to conspiracy and mail fraud.\n\nFELICITY HUFFMAN GETS PRISON TIME FOR PAYING OFF SAT FIXER IN COLLEGE ADMISSIONS SCHEME\n\n\"He knew that what he was doing was wrong and he was utterly untroubled by his crime,\" prosecutors handling the Sloane case wrote in a pre-sentencing memo, USA Today reported Tuesday. \"He bragged about misleading a USC development official to cover up the quid pro quo — using his dead mother as a prop for a fake donation — and even expressed outrage when high school counselors dared to question why a student who did not play water polo was being recruited to play college water polo.\"\n\nSloane said he wanted to help his son but \"failed miserably\" by going too far.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nLoughlin, 55, and husband Mossimo Giannulli have pleaded not guilty after being charged with paying accused scam mastermind William \"Rick\" Singer $500,000 to get their daughters Olivia Jade and Isabella into USC as crew team athletes even though they weren’t rowers.\n\nThe Associated Press contributed to this report.", "description": "A Los Angeles business executive faces sentencing Tuesday for his role in the college admissions scandal that has snagged actresses Felicity Huffman and Lori Loughlin.", "authors": ["Robert Gearty"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/AP19260658593333.jpg", "published_at": "2019-09-24"}