{"pub": "wsj", "url": "https://wsj.com/articles/more-than-500-acres-of-public-land-to-be-used-for-border-wall-construction-11568847685?mod=rsswn", "downloaded_at": "2019-09-19 06:02:08.061880+00:00", "title": "More Than 500 Acres of Public Land to Be Used for Border Wall Construction", "language": "en", "text": "The action by Interior Secretary David Bernhardt moves jurisdiction over about 560 acres currently overseen by the Bureau of Land Management to the U.S. Army.\n\nThe Interior Department is transferring public lands to the Pentagon for construction of about 70 miles of border wall, in a move likely to ratchet up controversy over one of the Trump administration’s signature projects.\n\nThe action by Interior Secretary David Bernhardt moves jurisdiction over about 560 acres currently overseen by the Bureau of Land Management to the U.S. Army, which will use it to construct barriers the president has said will help secure the nation’s southern border against illegal migration.\n\nThe lands being transferred include 213 acres in southwestern New Mexico, 301 acres in Arizona’s Yuma County and 44 acres in California’s San Diego County. The Interior Department said the new walls in those areas would replace and expand current pedestrian barriers.\n\nPresident Trump toured a newly constructed wall segment at the San Diego County border community of Otay Mesa on Wednesday afternoon before concluding a visit to California, but didn’t reference the new land transfer in his public remarks. About 654 miles of the 1,954-mile U.S.-Mexico border has some kind of physical barrier and much of the rest of the border has natural barriers. Congress in February allocated about $1.38 billion for 55 miles of wall construction; Mr. Trump said that was insufficient for what he has described as an illegal immigration crisis. Earlier this month, the administration shifted $3.6 billion in military construction money to accelerate building of the wall, a move that drew the ire of Democrats and some Republicans whose congressional districts lost funding for new schools and other projects. The Defense Department said at the time that the diverted money would be used to build or replace 175 miles of border wall on land it already controlled. In a press briefing late Wednesday, Interior officials said the department had previously transferred public lands to another federal agency on an emergency basis under the 1976 Federal Land Policy Management Act, but only six times before this and never for a border-construction project. They also said the transfer would become effective when it is published in the Federal Register, probably sometime next week. Mr. Bernhardt said in a press release that military protection of the border is needed to help protect natural resources, which other Interior officials say have suffered from trash, fires and other impacts by migrants. Environmental groups lambasted the move. The Tucson-based Center for Biological Diversity in 2017 released a report that warned 93 threatened and endangered species—including the Sonoran pronghorn and lesser long-nosed bat—could be affected by construction of the wall and related infrastructure along the border. Interior officials said they worked with Department of Homeland Security officials overseeing the wall project to make sure wildlife and natural and cultural resources in the newly transferred areas would be protected. Still, government officials have said they plan to alter environmental standards to enable wall construction. “We have significant authority from Congress to waive environmental laws to build a border barrier, and we’re doing that,” acting Homeland Security Secretary Kevin McAleenan said in an interview with The Wall Street Journal last month. Write to Jim Carlton at jim.carlton@wsj.com and Michelle Hackman at Michelle.Hackman@wsj.com\n\nCopyright ©2019 Dow Jones & Company, Inc. All Rights Reserved. 87990cbe856818d5eddac44c7b1cdeb8", "description": "The Interior Department is transferring public lands to the Pentagon for construction about 70 miles of border wall, in a move likely to ratchet up controversy over one of the Trump administration’s signature projects.", "authors": ["Jim Carlton", "Michelle Hackman", "Jim.Carlton Wsj.Com", "Michelle.Hackman Wsj.Com"], "top_image": "https://images.wsj.net/im-108513/social", "published_at": "2019-09-18"}