{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/11/waymo-and-renault-to-explore-autonomous-mobility-route-in-paris-region", "downloaded_at": "2019-10-11 19:38:40.348431+00:00", "title": "Waymo and Renault to explore autonomous mobility route in Paris region – TechCrunch", "language": "en", "text": "Waymo and Renault are working with the Paris region to explore the possibility of establishing an autonomous transportation route between Charles de Gaulle airport and La Défense, a neighborhood just outside of Paris city limits that plays host to a large number of businesses and skyscrapers, including a large shopping center. This is part of the deal that Renault and Nissan signed with Waymo earlier this year, to work together on potential autonomous vehicle services in both Japan and France.\n\nThis route in particular is being explored as a lead-up project to potentially be ready in time for the Paris Olympic Games, which are taking in place in Summer 2024. The goal is to offer a convenient way for people living in the Île-de-France area where Paris is located to get around, while also providing additional transportation options for tourists and international visitors. The region is committing €100 million (around $110 million) to developing autonomous vehicle infrastructure in the area to serve this purpose, across a number of different projects.\n\n“France is a recognized global mobility leader, and we look forward to working with the Ile-de-France Region and our partner Groupe Renault to explore deploying the Waymo Driver on the critical business route stretching from Roissy-Charles de Gaulle Airport to La Défense in Paris,” said Waymo’s Adam Frost, Chief Automotive Programs and Partnerships Officer, in an emailed statement.\n\nDefined routes designed to meet a specific need, especially in time for showcase events like the Olympics, seems to be a likely way that Waymo and others focused on the deployment of autonomous services will work in terms of pilot deployments, since it’s a perfect blend of demand, regulatory exemption and motivation and city/partner support.", "description": "Waymo and Renault are working with the Paris region to explore the possibility of establishing an autonomous transportation route between Charles de Gaulle airport and La Défense, a neighborhood just outside of Paris city limits that plays host to a large number of businesses and skyscrapers, including a large shopping center. This is part of […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/Waymo-LOGO-door.jpg?w=666", "published_at": "2019-10-11"}