{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/1/hillary-clinton-to-voters-upset-about-joe-bidens-u", "downloaded_at": "2019-10-02 00:39:54.927255+00:00", "title": "Hillary Clinton to voters upset about Joe Biden's unwanted touching: 'Get over it'", "language": "en", "text": "Former Secretary of State Hillary Clinton in a new interview scoffed at the unwanted touching allegations against Vice President Joseph R. Biden, saying voters need to “get over it” and vote President Trump out of office.\n\nSitting down with People magazine in a joint interview with daughter Chelsea Clinton, Mrs. Clinton dismissed speculation that women might be less than enthusiastic about voting for Mr. Biden after several women came forward this spring and accused him of unwanted touching. The former vice president has since apologized for putting people in uncomfortable situations.\n\n“For goodness’ sake, I’m sorry, I have to jump in because I’ve heard a little bit about that,” Mrs. Clinton told People.\n\n“I mean, I don’t think that the Twitterverse is the American electorate, but there are lots of vocal voices that say all kinds of things,” she continued, adding that Mr. Biden “is a thoroughly decent human being who has served our country honorably and well for decades.”\n\n“You could take any person who sticks their little head above the parapet and says, ‘I’m going to run for president,’ and find something that … a little annoying habit or other kind of behavior that people are going to pick apart and disagree with,” she said.\n\nMrs. Clinton said Democrats need to remain focused on beating Mr. Trump instead of picking each other apart and distracting the public. She stopped short of endorsing Mr. Biden, the Democratic front-runner, and said that “anybody” would be better than Mr. Trump.\n\n“This man must be defeated,” she said. “People who are putting themselves forward, which believe me, is a really difficult process to undergo, should be judged on the totality of their lives and their service.\n\n“We can pick apart anybody. I mean, that’s a great spectator sport. But this man who’s there in the Oval Office right now poses a clear and present danger to the future of the United States. So get over it,” she continued. “Look at the candidates, look at what they’ve accomplished, look at what they have fought for — and vote for anybody to get rid of Donald Trump.\n\n“If the American people don’t understand that [Mr. Trump] is whittling away at our institutions, our rule of law, he is sowing mistrust among the American people toward one another, he is violating every norm of our values and our common humanity, he is making us a laughingstock and endangering our security around the world — if people don’t understand that,” she said, “then we are in for a very, very rocky ride as a country.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Former Secretary of State Hillary Clinton in a new interview scoffed at the unwanted touching allegations against Vice President Joe Biden, saying voters need to \"get over it\" and vote President Trump out of office.", "authors": ["The Washington Times Http", "Jessica Chasmar"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/05/29/APTOPIX_Hillary_Clinton_Hunter_College_88382.jpg-73c89_c0-0-4949-2885_s1770x1032.jpg?f91abbac7b08eb0e437f745a78ac5081a50d56df", "published_at": "2019-10-01"}