{"pub": "yahoo", "url": "https://finance.yahoo.com/news/california-gig-economy-rules-won-140014887.html", "downloaded_at": "2019-09-17 13:10:04.227746+00:00", "title": "California’s Gig-Economy Rules Won’t Help Anyone", "language": "en", "text": "(Bloomberg Opinion) -- The California Legislature has approved a bill to classify gig-economy workers as employees. The measure is a triumph for organized labor — but a costly blow to technology companies, consumers and, potentially, workers themselves. Before he signs the bill, California Governor Gavin Newsom should insist that all sides work to improve it.\n\nUnder Assembly Bill 5, ride-hailing companies like Uber Technologies Inc. and Lyft Inc., which classify their drivers as contractors, would be required to treat them as employees. On-demand workers would be entitled to benefits they currently lack, including overtime pay, sick leave and workers’ compensation insurance. The bill covers as many as 1 million Californians who work in the gig economy; if it goes into effect, other Democratic-controlled states, such as New York, are likely to follow with similar legislation.\n\nThe potential costs are considerable. Reclassifying drivers and giving them full benefits would increase Uber’s labor costs by $500 million annually in California alone. Those costs will inevitably be passed on to consumers, in the form of higher prices. Innovation will suffer. Ride-hailing companies have also said they may impose caps on the number of drivers who use their apps and require them to work on scheduled shifts, which would harm service and limit who earns money from the platforms. (Officially, Uber denies the law applies to its drivers and plans to fight this out in court.)\n\nProponents of California’s new regulations warn that without them, vast numbers of workers are at risk of being exploited, as more employers seek to shed costs by using contractors. Yet those fears are exaggerated. Over the past decade, the share of independent workers has declined slightly, to less than 7 percent. Most Uber and Lyft drivers rely on gigs not for their livelihoods but to supplement income from other jobs. And almost 8 in 10 independent workers say they prefer such arrangements to traditional employment.\n\nA legislative compromise — one that provides independent workers with basic protections and wage guarantees, but not the full suite of benefits that flow to employees — remains the best solution. In negotiations with state officials and union leaders, tech companies offered a guaranteed $21 hourly wage for drivers, as well as access to company-funded benefits and “sectoral” bargaining rights. In return, the industry lobbied against provisions in the bill that allow for prosecution of companies that fail to reclassify their workers. Although Newsom initially expressed support for such a deal, he backed away from it after the unions refused to go along.\n\nThe governor should reconsider, and bring the parties back to the table before the legislation becomes law in January. Clarifying the status of gig-economy workers while providing them with an additional measure of security is in the interests of both companies and workers. The alternative is additional litigation, and possibly an industry-backed 2020 ballot initiative, which if anything will further muddle the issue.\n\nCalifornia’s ambitious governor has already missed one opportunity to forge a grand bargain on the gig economy. He shouldn’t waste this one too.\n\n--Editors: Romesh Ratnesar, Timothy Lavin.\n\nTo contact the senior editor responsible for Bloomberg Opinion’s editorials: David Shipley at davidshipley@bloomberg.net, .\n\nEditorials are written by the Bloomberg Opinion editorial board.\n\nFor more articles like this, please visit us at bloomberg.com/opinion\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg Opinion) -- The California Legislature has approved a bill to classify gig-economy workers as employees. The measure is a triumph for organized labor — but a costly blow to technology companies, consumers and, potentially, workers themselves. Before he signs the bill, California Governor Gavin", "authors": ["The Editors"], "top_image": "https://s.yimg.com/os/mit/media/p/common/images/favicon_new-7483e38.svg", "published_at": "2019-09-16"}