{"pub": "reuters", "url": "https://in.reuters.com/article/saudi-aramco-reliance-int/aramco-to-supply-agreed-volumes-grades-to-reliance-in-october-idINKBN1WF192", "downloaded_at": "2019-10-01 00:10:43.815253+00:00", "title": "Aramco to supply agreed volumes, grades to Reliance in October", "language": "en", "text": "FILE PHOTO: Logo of Saudi Aramco is seen at the 20th Middle East Oil & Gas Show and Conference (MOES 2017) in Manama, Bahrain, March 7, 2017. REUTERS/Hamad I Mohammed\n\nNEW DELHI (Reuters) - Saudi Aramco will supply agreed grades and volumes to India’s Reliance Industries (RELI.NS) in October after the world’s top oil exporter had to provide alternate heavier grader due to drone attacks on its oil installations, a spokesperson at the Indian company said on Monday.\n\nThe Sept. 14 drone and missile attacks on two giant facilities that process mainly light crude knocked down about 5.7 million barrels per day, more than half of the production of the world’s top oil exporter, forcing the Kingdom to supply heavier grade instead of light oil to some refiners.\n\n“Aramco (has) confirmed and reassured that supplies for October will be maintained both in terms of quantity and mix of grades as per our requirement,” said the spokesperson.\n\nAramco has been a major and reliable supplier of crude oil for Reliance for more than twenty years, both in terms of volume of crude supply as well as the mix of various grades of crude oil, the spokesperson added.\n\n“In the immediate aftermath of the incident, Aramco maintained supply with alternate grades of crude oil. The alternate grades being heavier suited Reliance’s refining needs,” the spokesperson said.\n\nReliance, owners of the world’s biggest refining complex at Jamnagar in western Gujarat state, is a major buyer of Saudi oil and recently announced plans to sell a fifth of its petrochemical and refining business to Aramco in a multibillion dollar deal.", "description": "Saudi Aramco will supply agreed grades and volumes to India's Reliance Industries in October after the world's top oil exporter had to provide alternate heavier grader due to drone attacks on its oil installations, a spokesperson at the Indian company said on Monday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190930&t=2&i=1435653406&w=1200&r=LYNXMPEF8T0P5", "published_at": "2019-09-30"}