{"pub": "foxbusiness", "title": "Energy Star: Set thermostats to this temperature to save money", "url": "https://foxbusiness.com/features/energy-star-set-thermostats-temperature-save-money", "language": "en", "published_at": "2019-08-21", "downloaded_at": "2019-09-02 07:10:31.143137+00:00", "text": "article\n\nA government recommendation on how to adjust residential thermostats to save money is sparking a heated debate -- and a sharply worded clarification by the Environmental Protection Agency (EPA), as well as the Department of Energy.\n\nContinue Reading Below\n\nENERGY STAR, a federal joint venture program run by the DOE and the EPA, suggested in a 2009 report that people should set their thermostat to 78 degrees when they are home, 85 degrees when away and 82 degrees when sleeping. The report, which was released during the Obama Administration, resurfaced this week and started a social media frenzy, after a local TV reporter shared the recommendation on Twitter.\n\nThe DOE, through a spokesperson, clarified the report following the reaction. \"In 2009, EPA produced and published an Energy Star report which included suggested thermostat temperature adjustments to achieve greater energy efficiency and cost savings. It is the position of DOE that Americans should set their thermostats to whatever temperature they choose. The 2009 EPA Energy Star report should simply be used as a resource for people seeking to achieve greater energy savings in their homes, should they choose to do so.\"\n\nThe situation unfolded like this on Twitter.....\n\nAdvertisement\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nIn order to save money on your energy bill in spring and summer months, the Energy Department recommends setting your thermostat \"as high as comfortably possible.\"\n\n\"The smaller the difference between the indoor and outdoor temperatures, the lower your overall cooling bill will be,\" the Energy Department said on its website.\n\nThe DOE warns that setting the thermostat to a colder setting than normal when turning on the air conditioner could cost you more money.\n\n\"It will not cool your home any faster and could result in excessive cooling and unnecessary expense,\" the department said.\n\nFollowing the report, the Environmental Protection Agency, in a statement to FOX Business, also sought to clarify what it termed inaccuracies.\n\n“The ENERGY STAR program has not released a report on this topic. The ENERGY STAR program is not recommending that thermostats be set to 78 degrees F or any other temperature during the cooling season,\" said an EPA spokesperson.\n\n\"In order to save energy, the ENERGY STAR website suggests owners of programmable thermostats increase the air conditioning temperature setting by 7 degrees F when homes are unoccupied and by 4 degrees F when occupants are asleep. This is based on the temperature of your comfort level when awake at home. The website illustrates this approach with an example of pre-programmed, energy-saving temperature settings in some programmable thermostats (which includes a 78 degree F setting). All thermostats are designed to allow for adjustment to ensure personal levels of comfort when people are in the home.”", "description": "New guidelines from The Department of Energy's Energy Star sparked a heated debate.", "authors": ["Julia Limitone"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/02/0/0/thermostat-istock-2.jpg?ve=1&tl=1"}