{"pub": "abcnews", "url": "https://abcnews.go.com/International/furious-norwegian-spirit-passengers-demand-refund-bad-weather/story?id=66169067", "downloaded_at": "2019-10-10 00:43:52.968235+00:00", "title": "Furious Norwegian Spirit passengers demand refund after bad weather forces itinerary change", "language": "en", "text": "Norwegian Cruise Line is blaming \"severe weather conditions\" for forcing it to revise the itinerary of its Spirit ship, which has left guests irate and calling this cruise of a lifetime more like a holiday from hell.\n\nThe 14-day cruise on the Norwegian Spirit departed on Sept. 27 from Southampton, U.K., and is expected to return Friday, according to website Cruisemapper.\n\nThe ship's current position was listed as Dublin, Ireland, on Wednesday. It was not immediately known how many people were on board.\n\nAccording to Norwegian, the cruise is advertised as an \"Iceland, Ireland and Norway: Mystical Fjords\" adventure and starts at $1799.\n\nIt was supposed to stop in ports in France, Amsterdam, Scotland, Iceland, and Ireland, according to Cruisemapper. However, high winds forced the ship to cancel the first two stops, passengers said.\n\n\"While nine ports of call were originally planned for the voyage, the revised itinerary allowed the ship to call on eight ports. ... We always do our best to provide our guests with a truly enjoyable and memorable vacation, but our very first priority is to ensure their safety and the safety of our crew,\" Norwegian said in a statement to ABC News on Wednesday.\n\nThe statement continued: \"We understand that it is disheartening when we are unable to call on ports that our guests have been looking forward to visiting. However, we do ask for our guests' patience, cooperation and understanding that severe weather conditions are an act of God and cannot be controlled, influenced or remediated by the cruise line. Our goal is to showcase the beautiful destinations our ships visit and to provide guests with an onboard experience that is second to none.\"\n\nNCLHELL1 via Storyful\n\nIt would not confirm which of the ports its Spirit cruise ship had bypassed.\n\nAfter three days at sea, livid passengers began posting on social media about overflowing toilets and stale food.\n\nIn a 24-second YouTube video posted by an account called NCL Hell2019 on Wednesday , people identified as passengers aboard were taped holding signs that read “We want refund” and \"Shame on you\" and chanting \"We want refund! We want refund!\"\n\nIn other videos posted by the account, passengers were seen yelling at security and at a uniformed ship official.\n\nIn a statement to ABC News, Norwegian apologized \"for any inconvenience and disappointment\" its guests onboard Spirit had experienced.\n\nIn a letter to guests that was posted to Twitter by account NCLHELL, Norwegian Spirit said that \"unsafe docking conditions including gusty winds\" had forced the Oct. 7 call to Greenock, Scotland, to be canceled.\n\n\"While it is always our intention to maintain the ship's original itinerary whenever possible, the safety of our guests and crew takes precedence,\" the letter said.\n\nNorwegian said that any Greenock excursions paid for by guests would be refunded as a credit to their onboard account, according to the posted letter. Guests would also receive a 25% future cruise credit, the cruise line said.\n\n\"This credit is based on the original cruise fare paid and will be valid for 24 months from today’s date,\" Norwegian said in the Oct. 7 letter.\n\nThe Spirit also tried heading to Norway but passengers were not allowed to disembark because the town was closed to tourists.\n\nABC News' Mina Kaji and Michelle Stoddart contributed to the reporting in this story.", "description": "After three days at sea and no stops in ports, passengers reported overflowing toilets and stale food on social media; the cruise line offered a 25% future cruise credit.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/cruise-ship-mutiny-ht-jef-191009_hpMain_16x9_992.jpg", "published_at": "2019-10-09"}