{"pub": "rt", "url": "https://rt.com/sport/470656-russia-beat-scotland-euro-2020", "downloaded_at": "2019-10-11 00:32:19.376808+00:00", "title": "Russia batter sorry Scotland to take giant step to Euro 2020 on return to Luzhniki", "language": "en", "text": "Russia moved towards the verge of UEFA Euro 2020 qualification as they comfortably saw off Scotland in Moscow thanks to a double from skipper Artem Dzyuba and goals from Magomed Ozdoev and Aleksandr Golovin.\n\nAfter being frustrated in a goalless first half, Russia wrapped the game up in the space of three second-half minutes as Dzyuba volleyed home from a corner on 57 minutes before Ozdoev added a second from range shortly after to end Scotland's hopes of going home from Moscow with anything.\n\nDzyuba then poked in a third before Monaco playmaker Golovin struck with five minutes to play to ensure a rampant Russia delighted the crowd on their return to Luzhniki Stadium for the first time since their epic World Cup shootout win over Spain last summer.\n\nThe win for Stanislav Cherchesov's team all-but guarantees their spot in next year’s UEFA European showpiece, putting them eight points clear of third-placed Cyprus in Group I with three games to play.\n\nSteve Clarke’s Scotland team headed into the game already knowing that their best chance of qualification lies through the play-offs – a place in which they secured thanks to winning their UEFA Nations League group – but they suffered a demoralizing fifth defeat in seven qualifiers on a chastening night in Moscow.\n\nWhile Scotland proved resilient in the first half, Russia’s class shone through in the second thanks to goals of the highest quality from Zenit St. Petersburg pair Dzyuba and Ozdoev.\n\nFirst, big Russian skipper Dzyuba freed himself from the attentions of Charlie Mulgrew to volley in a corner from the left for his 23rd international goal, before Ozdoev fired an unstoppable 25-yard drive past David Marshall in the Scotland net.\n\nDzyuba then added a third, poking home from close range, before Golovin slotted in from a tight angle to complete the Russian rout.\n\nIt was an ugly experience for Scotland and the ever-hardy band of Tartan Army supporters who had made the trip to a damp and frigid Moscow.\n\nNext up for Russia is a trip to sunny Cyprus on Sunday, where they can definitively book their place in next summer's pan-European tournament.\n\nScotland, meanwhile, will hope for a confidence-boosting victory as they host whipping boys San Marino - who were hammered 9-0 by group leaders Belgium on Thursday as they became the first team to book a Euro 2020 spot.", "description": "Russia moved towards the verge of UEFA Euro 2020 qualification as they comfortably saw off Scotland in Moscow thanks to a double from skipper Artem Dzyuba and goals from Magomed Ozdoev and Aleksandr Golovin.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5d9f93e420302723c144afb2.jpg", "published_at": "2019-10-11"}