{"pub": "bbc", "url": "https://bbc.com/travel/story/20191022-why-bolivia-is-the-next-food-hotspot", "downloaded_at": "2019-10-22 20:47:09.142091+00:00", "title": "Why Bolivia is the next food hotspot", "language": "en", "text": "When the plate arrived, I wasn’t thrilled about its contents. On it was a deep-fried, puffed-up tortilla with a tiny, bright-red crab resting on top, its pincers jutting off the edge. I’d eaten soft-shell crab numerous times before, so there was no reason to be deterred from eating the entire body of the crustacean, but there was something about its unfamiliar hard shell and sharp red claws that didn’t exactly whet my appetite.\n\n“This is a street food dish from Tarija,” said the waiter at Gustu, a La Paz restaurant founded in 2013 by Claus Meyer, co-founder of Copenhagen’s two-Michelin-star restaurant Noma. “There’s a bisque inside the tortilla, so eat it in one bite.” I popped the crab-topped, swollen tortilla into my mouth and felt it burst, releasing a strong umami broth. It was crunchy and salty, and unlike anything I’d ever tasted before.\n\nI wouldn’t have tasted anything like it before, because it’s a riff on a hyper-local dish from a place in the southern part of the country I’d never been to. The tiny freshwater crab is one of the many native ingredients Gustu head chef Marsia Taha wants to celebrate and share with the rest of the world. “We’re not a traditional restaurant, but we’re definitely inspired by tradition,” she said.\n\nOver the past few years, Gustu has become one of the most significant restaurants in La Paz, heavily responsible for bringing avant-garde Bolivian cuisine to the table. “The restaurant was definitely a catalyst to get more people talking about Bolivian food in a more valued sense,” said Gustu CEO Ella Asbun Ormachea.\n\nYou may also be interested in:\n\n• The last frontier of gastronomy?\n\n• The ‘Rolex’ of chocolate\n\n• The rare ingredient healthier than meat\n\nWhile the food here isn’t strictly traditional, it borrows heavily from traditional techniques and only uses Bolivian produce – much like the New Nordic food movement that focuses on seasonal, sustainable ingredients. “A lot of the products we use can’t be found in markets in La Paz,” said Taha, adding that they must go deeper into the country to source ingredients, like the tiny, red crabs found in southern Bolivia. “They’re the closest thing we have to something that tastes like seafood,” she said, explaining that they work with a community in Tarija to source the crustaceans.\n\nA landlocked country, Bolivia might not have access to an ocean, but it has the Amazon, Altiplano and Andes, which provide a smorgasbord of ingredients unique to the country. They’re ingredients that have been collected and harvested for centuries, but only recently are chefs in La Paz turning to them to create innovative dishes.\n\n“To keep these ingredients alive is like gold,” Taha said. “It’s our identity.”\n\nTo keep these ingredients alive is like gold\n\nChefs cooking with hyper-local produce may no longer be considered a revolutionary idea. Noma’s René Redzepi and Virgilio Martinez of Peruvian restaurant Central have been cooking this way for years, but Bolivian chefs aren’t just using the country’s bounty, they’re also reviving ancient native cooking techniques that might otherwise be forgotten. Most importantly, celebrating local cuisine is instilling a sense of pride.\n\n“I think it’s important to showcase the culture of our country and talk about the produce that is native to Bolivia, like different types of aji (chilli peppers), peanuts, quinoa and potatoes,” said Sebastian Quiroga, chef and founder of Ali Pacha, a vegan fine-dining restaurant tucked in a narrow, cobbled street in La Paz’s busy downtown. “We work with different kinds of roots, grains and tubers that can only be found at high altitude,” said Quiroga, who has been touted as one of the next best South American chefs.\n\nWhile some might argue that many Bolivian ingredients, like quinoa and certain potatoes, bear similarity to Peruvian ingredients, there are some items that you won’t find beyond the borders of Bolivia. “The quinoa that is grown in Salar de Uyuni has a certain flavour profile because of the salt in the soil as well as the altitude,” said Quiroga, who sources native plants and flowers that can only be found in areas like the Bolivian side of Lake Titicaca.\n\nQuiroga also uses a huatia, a traditional way of cooking in the Andes, for one of his standout dishes made from mushrooms and tubers. A huatia is an underground oven formed by digging a hole in the earth, and is a method of cooking that Quiroga learned from his parents, who built one in their backyard when he was a child. To recreate this type of oven in the Ali Pacha kitchen, Quiroga uses a base of volcanic stones and soil from the farmers’ market, and covers it with corn husks. On top, he layers the ingredients – tubers, leeks and chamomile – which he then covers with more corn husks. He cooks it for around two hours before removing it from the oven and finishing it off with oyster mushrooms and a leek sauce. It’s complex, warming and soulful, and will satisfy even the most carnivorous of customers.\n\n“The dishes [we make] are a memory in terms of flavour. But the texture, balance and presentation are the modern parts,” said Quiroga, who explains that they aren’t trying to recreate Bolivian dishes, but use certain elements to innovate their own.\n\nAt Popular Cocina Boliviana, a bright, contemporary restaurant that opened in 2017, chefs Juan Pablo Reyes Aguilar and Diego Rodas are also using native techniques and ingredients, but on a less upscale level. “We want to share Bolivian food with all social classes without the financial aspect being an issue,” said Rodas, who saw a niche for modern, approachable Bolivian food.\n\nThe chefs, who were born in Bolivia and gained experience cooking across Latin America, are inspired by flavours and ingredients from their childhoods. “We use these ingredients to create a new Bolivian cuisine that’s linked to marketplaces, culture and tradition. “We incorporate and refresh original recipes that are part of Bolivian culture,” said Reyes Aguilar, adding that they use different types of aji, corn, grains (amaranth, quinoa, cañahua) and potatoes, all grown at high altitudes.\n\nWhile the chefs' cooking techniques are rooted in French and Spanish cuisine, they incorporate local methods like the use of the batán, an ancient grindstone, as well as a technique called soasar, where ingredients are cooked over the fire. They also produce charque, a type of llama jerky, and chuño, a dehydrated potato product borrowed from the Bolivian Andes. “Dehydration is a process that’s been used for a very long time here,” Rodas said.\n\nTo gain more knowledge about these different ingredients and cooking methods, Gustu (in partnership with Wild Conservation Society) launched the Sabores Silvestres expeditions into rural parts of the country in order to gain access to native products and ancestral techniques that are unique to certain regions. One of the methods that has inspired Taha is a form of cooking ingredients inside bamboo, a skill used in the Amazon. “They harvest bamboo, cut it open and then fill the bamboo with a protein like paiche (a fish native to the Amazon). Then they add coriander, other herbs and a bit of salt, and cook it for around 15 to 20 minutes,” said Taha, who has incorporated this technique into the kitchen at Gustu. Like Quiroga, she is also inspired by the Andean huatia method. “It’s ancestral, but little by little, it’s disappearing,” she said.\n\nBuilding relationships with rural communities across the country has been integral to the growth of Gustu, but it hasn’t come without its challenges. “It’s not easy. You need to gain trust with them and that takes years,” Taha said.\n\nMy job as a cook is to bring back that feeling of pride to those communities\n\nOne of the Sabores Silvestres projects she is working on in collaboration with Wildlife Conservation Society is with a community in the Amazon that exports alligator skin to Europe. “They weren’t taking advantage of the whole animal, so the meat was going to waste,” said Taha, who uses the alligator meat in a crudo dish. Beyond Gustu, the community now sells alligator meat to local supermarkets. “It’s not common to eat alligator here, but people are getting used to it,” she said, adding that many of the producers are unaware of the full potential of what they’re generating.\n\nTaha notes that the influx of big foreign brands has led to a loss of confidence in local products. “We try to replace our culture with Western culture, but it has nothing to do with us,” said Taha, who often invites the producers to Gustu so they can witness their humble products like Andean grains and the amañoque plant brought to life in an array of high-end dishes. “My job as a cook is to bring back that feeling of pride to those communities.”\n\nWhen the alligator course was set in front of me, my stomach churned at the sight of purplish meat dotted around the plate. I’d eaten cooked crocodile before, but never raw alligator. To prepare the dish, the alligator fillet is cured for around three days with an acidic flower from the Amazon. Then, lemon juice is added, along with a type of cucumber from the Andes, some deep-fried malt and dollops of sweet potato. The dish is fresh and acidic and loaded with contrasting textures.\n\nAs I spooned the last mouthful of zingy sauce into my mouth, I felt a deep sense of satisfaction. The meal was so much more than another foreign meal in another foreign country. It was a vehicle to showcase the newfound pride in an ancient cuisine that is finally being celebrated.\n\nJoin more than three million BBC Travel fans by liking us on Facebook, or follow us on Twitter and Instagram.\n\nIf you liked this story, sign up for the weekly bbc.com features newsletter called \"The Essential List\". A handpicked selection of stories from BBC Future, Culture, Worklife and Travel, delivered to your inbox every Friday.", "description": "Consistently overshadowed by Lima, La Paz is finally stepping out into the spotlight as a gastronomic city, using high-altitude ingredients and ancient cooking techniques.", "authors": ["Mary Holland"], "top_image": "https://ichef.bbci.co.uk/wwfeatures/live/624_351/images/live/p0/7r/nr/p07rnr00.jpg", "published_at": "2019-10-22"}