{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/british-backpacker-22-found-dead-hostel-alongside-friend-hours-getting-sick-11008724", "downloaded_at": "2019-10-30 07:54:05.775903+00:00", "title": "British backpacker, 22, found dead in hostel hours after getting sick", "language": "en", "text": "The doctor who carried out Natalie’s post-mortem exam believes the unknown medication she bought caused her death (Picture: SBNA)\n\nA young British backpacker and her Canadian travelling friend died in their hostel after they took over-the-counter medication.\n\nNatalie Seymour, 22, messaged her mother back in the UK in the hours before her death to say she wasn’t feeling well.\n\nShe and Abbey Gail Amisola, 27, both suffered with severe vomiting and diarrhoea after taking the unknown medication shortly after arriving at the Monkey Republic hostel in Kampot, Cambodia.\n\nHer phone was examined by the Cambodian authorities who found that in the hours leading up to her death, Natalie had searched Google about vomiting.\n\nOne search entry she typed in was ‘vomiting so much I have chest pains’.\n\nAnother said: ‘My belly is cramping, but I don’t feel sick. It’s weird – what is going on.’\n\nShe was concerned about the colour of her vomit, which was yellow and dark green, her inquest heard.\n\nNatalie and Abbey met a year earlier while travelling in Bali (Picture: SBNA)\n\nNatalie messaged her mum in the hours before her death to say she was feeling unwell (Picture: SBNA)\n\nAfter messaging her mum to say she had a severe stomach ache, Natalie told Wendy that she and her friend might go out to get something to make them better.\n\nAdvertisement\n\nAdvertisement\n\nBut hours later, staff at the hostel where Natalie and Abbey were staying found them them dead in their beds.\n\nCoroner Geoffrey Sullivan recorded an open verdict after hearing Natalie and Abbey brought an unknown over-the-counter medication before they died in November 2017.\n\nThe hearing in Hatfield, Hertfordshire, was told Natalie and her friend were taken ill with severe sickness and diarrhoea soon after.\n\nNatalie, from Shefford, Bedfordshire, had flown out to Cambodia to meet up with Abbey in November 2017. The pair had met and become friends on a previous trip to Bali a year earlier.\n\nShe had quit her job as an accounts manager and bought a one-way ticket, not knowing yet when she would return home.\n\nIn Cambodia, Natalie posted photos online as she and Abbey travelled through the country, and messaged her family daily to let them know where she was and what she was doing.\n\nPolice investigate the room where the girls died in their hostel in Kampot, Cambodia (Picture: SBNA)\n\nNatalie was a keen adventurer and had booked a one-way ticket to Cambodia (Picture: SBNA)\n\nThe inquest was told that on the day of their deaths other backpackers brought both women food and drink as their conditions deteriorated.\n\nBecause of the remote location of the hostel there was no hospital nearby, but a local villager eventually took Natalie to a local doctor.\n\nBut by the time she arrived she was unconscious and was brought back to the hostel.\n\nShe and Abbey were dead a short time later, just six days after arriving in the country.\n\nAdvertisement\n\nAdvertisement\n\nNatalie’s body was brought back to the UK where Hertfordshire police examined the Cambodian investigation into Natalie’s death.\n\nOfficer Paul Myhill said there was no evidence of ‘foul play’ but the court was told that a sample of Natalie’s blood that had accompanied her body back to the UK couldn’t be tested because there was no proper labelling on the vials.\n\nTissue and fluid sample obtained back here provided no ‘significant toxicological’ findings, the inquest heard.\n\nTributes left to Natalie back home in the UK (Picture: SBNA)\n\nDr Rajiv Swamy, who carried out the post mortem examination, said examination of her liver showed evidence of small droplets of fat being present which indicated the possibility of ‘drug toxicity’.\n\nHe said that was sometimes seen as a result of taking over-the-counter medication like paracetamol or anti-convulsants.\n\nThe condition he found, which he referred to as ‘idiopathic hepatotoxic micro vesicular steatosis’, was the cause of death, Dr Swamy said.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "A young British backpacker and her Canadian travelling friend died in their hostel after they took over-the-counter medication. Natalie Seymour, 22, messaged her mother back in the UK in the...", "authors": ["Zoe Drewett"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_93860101_1572418589.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}