{"pub": "thenextweb", "url": "https://thenextweb.com/plugged/2019/10/11/microsoft-surface-laptop-cheap-i7", "downloaded_at": "2019-10-11 12:30:57.278336+00:00", "title": "CHEAP: Hurry, get $1,650 (!!!) off this 1TB Surface Laptop with an i7 CPU & 16GB RAM", "language": "en", "text": "Welcome to CHEAP, our series about things that are good, but most of all, cheap. CHEAP!\n\nMicrosoft recently unveiled the lineup for its third generation of Surface Laptops. It looks like a svelte, powerful device, but hold your horses before you rush to cop one, there might be a better deal: the first-gen Surface Laptop.\n\nYep, there’s currently a brain-melting 61-percent discount on the inaugural Surface Laptop — it’s available for just $1,049, that’s $1,650 off the original price of $2,699. Woooooah.\n\nDoesn’t sound good to you? Hold up, I wasn’t finished. This baby comes with a seventh-gen Intel Core i7 processor, 16GB of RAM, and 1TB (YES, you heard that right) of storage space.\n\nHere’s what else you’re getting for that money:\n\n13.5-inch PixelSense Touchscreen Display (2256 x 1504) resolution\n\nIntel HD Graphics 620\n\nA copy of Windows 10 (duh)\n\nOne-year Microsoft warranty\n\nA smooth keyboard and trackpad experience\n\n1,25 kilos of absolutely gorgeous design\n\nI haven’t personally used this Surface Laptop, but my colleague Napier Lopez had lots of good things to say about it.\n\nIf you’re a Mac user, I know what you’re thinking. “No way I’m blowing my pocket on a Windows laptop.” In the words of the glorious Samuel L. Jackson, well, allow me to retort.\n\nSince switching to Mac in 2012, I’ve dreaded going back to Windows. I’d wake up at night, bald head covered in sweat, panicked my MacBook had broke. But over the past month, I’ve learned I’ve got nothing to fear. My experience with the Razer Blade (review upcoming) has illuminated me to the amazing progress Windows laptops have made in recent years.\n\nThey’re actually pretty good. You’ll still need to give yourself some time to get accustomed, but trust me — things do get better. And good luck getting a 1TB MacBook at that price.\n\nAnd with with 61 percent off the original price of $2,699 (that’s a full $1,650 discount, if you’re bad at math), there’s no better time than now to make the shift.\n\nTake a leap through the window, get on Windows now. CLICK, CLICK, CLICK.\n\nThis post includes affiliate links to products that you can buy online. If you purchase them through our links, we get a small cut of the revenue.\n\nFor more gear, gadget, and hardware news and reviews, follow Plugged on Twitter and Flipboard.", "description": "Don't rush into buying the new Surface Laptop 3 yet — its first-gen sibling is dirt-cheap now, and it's packing an i7 CPU, 16GB of RAM, and 1TB SSD.", "authors": ["October"], "top_image": "https://img-cdn.tnwcdn.com/image/plugged?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2Fmicroosft-surface-laptop-discount-i7-1tb.jpg&signature=6f31e5967520b6b644dea87e24b575ec", "published_at": "2019-10-11"}