{"pub": "cbc", "url": "https://cbc.ca/news/entertainment/harry-meghan-doc-media-1.5328618", "downloaded_at": "2019-10-22 13:32:53.021336+00:00", "title": "'I will not be bullied into playing a game that killed my mum:' Prince Harry vs. tabloids | CBC News", "language": "en", "text": "The Duchess of Sussex says her first year of marriage to Britain's Prince Harry has been difficult because of the pressure from Britain's tabloid press.\n\nThe former Meghan Markle told ITV in an interview broadcast Sunday that her British friends warned her not to marry the prince because of the intense media scrutiny that would follow in his country.\n\nBut the former U.S. television star said she \"naively\" dismissed the warnings, because as an American she didn't understand how the British press worked.\n\n\"I never thought this would be easy, but I thought it would be fair,\" she said. \"And that's the part that's really hard to reconcile. But I don't know. Just take each day as it comes.\"\n\nThe royal couple revealed their struggles with the media during the ITV documentary Harry & Meghan: An African Journey, which followed them on a recent tour of Southern Africa. Both said they had struggled with the spotlight, particularly because, they say, much of what is printed is untrue.\n\nThe pressure was aggravated by the fact that the duchess was a newlywed, then pregnant and then a new mother.\n\n\"Any woman, especially when they're pregnant, you're really vulnerable. And so that was made really challenging, and then when you have a newborn, you know?\" she said, adding that it was a struggle.\n\nLater she added: \"I would say thank you for asking, because not many people have asked if I'm OK, but it's a very real thing to be going through behind the scenes.\"\n\nThe 35-year-old Harry did acknowledge there have been some differences between him and his older brother, 37-year-old Prince William, although he said most of what has been printed about a rift between the two has been \"created out of nothing.\"\n\n\"Part of this role and part of this job and this family being under the pressure that it's under, inevitably stuff happens,\" he said.\n\n\"But, look, we're brothers. We'll always be brothers. We're certainly on different paths at the moment, but I will always be there for him, as I know he'll always be there for me.\"\n\nReminded of Princess Diana\n\nHarry has lashed out at the British media in the past for its treatment of Meghan, 38, accusing the media of hounding her the way it did his mother, Princess Diana, who died in a 1997 car crash while trying to elude paparazzi. Harry insisted he didn't want such history repeated.\n\nDiana, Princess of Wales, is seen holding Prince Harry during a trip to Spain in 1987. (John Redman/The Associated Press)\n\nDuring the trip to Africa, Harry walked through the same minefield in Angola that his mother visited just before her death as she publicized efforts to clear thousands of mines left behind by the country's 27-year civil war.\n\nHe told ITV that one of the most difficult parts of being constantly in the public eye is that every click of a shutter and flash from a camera is \"the worst reminder\" that his mother's life ended so young, at only 36.\n\nBut he added, \"I will not be bullied into playing a game that killed my mum.\"\n\nBritain's Prince Harry walks through a minefield in Dirico, Angola in September, following in the footsteps of his late mother, whose walk through the same field years ago helped to lead to a global ban on the deadly weapons. (Dominic Lipinski/Associated Press)\n\nAt the close of their African tour, Harry and Meghan each brought separate legal actions against the media.\n\nThe duchess earlier this month sued the Mail on Sunday tabloid, claiming it illegally published a letter she wrote to her father. Harry sued over the alleged illegal interception of voicemail messages by journalists from the Sun, the News of the World and the Daily Mirror newspapers.\n\nHarry, who has joined his brother in promoting a more open discussion of mental health issues throughout society, described his own mental health struggles as being a matter of \"constant management.\"\n\n\"Part of this job, and part of any job, like everybody, is putting on a brave face and turning a cheek to a lot of the stuff,\" he said.\n\n\"But again, for me and again for my wife, of course, there is a lot of stuff that hurts, especially when the majority of it is untrue.\"", "description": "Prince Harry and Meghan, the Duchess of Sussex, reveal their struggles with the media in an ITV documentary that followed them on a recent tour of Southern Africa. The royal couple said they have struggled with the spotlight, particularly because, they say, much of what is printed is untrue.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5328641.1571663542!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/south-africa-royals-visit.jpg", "published_at": "2019-10-21"}