{"pub": "foxnews", "title": "Mike Kerrigan: Late-bloomer survives horrors of second-grade jellybean count – much later learns THIS lesson", "url": "https://foxnews.com/opinion/mike-kerrigan-late-bloomer-jellybean-count-learns-this-lesson", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-03 00:02:14.209256+00:00", "text": "My eldest son, a late bloomer like me, began his college career in August at the University of Virginia. I say he was a late bloomer like me, but that’s not entirely true. Nobody bloomed as late as I did, or did so from such inauspicious academic beginnings.\n\nI recall my first day of second grade. I remember the September 1978 morning not because I was the new kid in school, although I was. I remember it for the school’s strange first-day tradition.\n\nEach classroom sent a representative down to guess the number of jellybeans the principal kept in his jar. The jar varied in size and shape each year so nobody could game the system, not even ringers from the school’s \"gifted and talented\" program.\n\nDR. KENT INGLE: FORGET FREE COLLEGE; WE NEED SCHOOLS THAT MEET STUDENT NEEDS IN A RAPIDLY CHANGING WORLD AND JOB MARKET\n\nWhoever’s guess was closest without going over won all the jellybeans for his classroom. My teacher thought as the new kid, I should have the honor. The class cheered in support, drowning out my protests. I was jostled to the front, through an unsolicited peer-review gauntlet:\n\n\"It's always more than you think,\" offered one classmate. \"But you mustn't go over!\" warned another. \"The odds are against you,\" wheezed a third. \"Remember, you’re up against sixth graders.\"\n\nMy talent is simple, but it's one that makes all the difference in the world: I appreciate the many gifts in my life.\n\nOf all the well-wishes, one stood out. Erin, as I recall, with her blond hair pulled back, and the kindest eyes I’d ever seen. \"Good luck,\" she said. I smiled and thought just maybe things would be okay. My teacher gave me directions, and I was off.\n\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\n\nThe first problem I faced was logistics. Suddenly alone, I realized that I had no earthly idea how to find the principal's office. Things once innocent now bespoke danger. The hum of the radiators. The boiler room’s medicinal smell. I began to panic.\n\nI eventually reached my destination. By the time I arrived, all other class representatives had made their guesses and departed – my only break. The principal directed me to his jellybean jar and, sipping his morning coffee, asked for my guess.\n\nThe moment of truth had arrived, for I was, as we might say in today’s gentler times, spatial reasoning challenged, but as was more broadly diagnosed then, slow on the uptake. \"45,\" I said sheepishly.\n\n\"What!?\" he exclaimed, somehow shouting through his coffee spit take. He tried to walk it back. \"Are you sure you don't want to guess again, perhaps a little higher?\" No, all I wanted was to be at recess, playing two-square with Erin.\n\n\"45,\" I confirmed.\n\n\"OK, 45 it is,\" he repeated, with a heavy “this will involve paperwork” sigh. As I exited, he barked into the telephone \"Get me the therapist ... the real pro, who helped Alex after that barn incident.\"\n\nIt was becoming clear to his office staff that my guess was an order of magnitude off. The “Come and learn, child” gazes I previously basked in now had more of a “Do you play under power lines?” feel.\n\nBy the time I returned to my classroom, the winner had been announced over the intercom. A sixth grader had guessed 1,650 jelly beans. The actual number was 1,700. Gifted and talented, no doubt.\n\nI didn't play two-square with Erin that day. My low-ball guess bought me cognitive therapy sessions during recess. Just me, another kid from France, whom not even the French teacher understood, and Alex, who story had it had been kicked by a horse the prior spring.\n\nI recalled that story over the University of Virginia’s drop-off day, and it reminded me of something important: We’ve all got a masterpiece in us. It took some time for my eldest son to see this, and substantially more time for me. But it does happen, not always in our time, but always in the fullness of time.\n\nThat’s great, but it’s not everything. We never need to, or should, stop painting, for a masterpiece is always just our best work so far. Our lives are the canvas, and we can touch them up -- and when necessary start over -- right until the very end. That’s the staggering and mysterious beauty of it all. Life’s greatest work is ongoing, ever-renewing, and not less glorious for humble beginnings, but more so.\n\nRemember this if your grade-schooler sees only downside as classes begin, and tell that future late-bloomer to keep his or her chin up! I’m glad I did, for it all gets better, so much better. Sure, when the jellybean game was on the line, I got my clock cleaned by a gifted-and-talented ringer. But my gifts, better for waiting, came much later.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nMy gifts include five wonderful children who somehow see only the good in their dad, and a spectacular wife who sees the good and the bad but loves me anyway. My talent is simple, but it's one that makes all the difference in the world: I appreciate the many gifts in my life. It seems I’m gifted and talented after all!\n\nSo take heart, you late bloomers, young and old. For when you become talented at recognizing your gifts, life truly blooms. Now, go paint your masterpiece.\n\nCLICK HERE TO READ MORE FROM MIKE KERRIGAN", "description": "When you become talented at recognizing your gifts, life truly blooms.", "authors": ["Mike Kerrigan", "Mike Kerrigan Is An Attorney In Charlotte"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/b21bf672-school-suspension.jpg"}