{"pub": "businessinsider", "url": "https://businessinsider.com/american-airlines-mechanic-sabotaged-plane-union-contract-dispute-prosecutors-say-2019-9", "downloaded_at": "2019-09-06 12:16:40.869018+00:00", "title": "An American Airlines mechanic is accused of sabotaging a plane in Miami because of stalled contract negotiations", "language": "en", "text": "A mechanic for American Airlines was arrested in Miami on Thursday on a sabotage charge after he was accused of tampering with a plane because he was upset over stalled union contract negotiations.\n\nThe mechanic, named Abdul-Majeed Marouf Ahmed Alani, according to a criminal complaint filed in a Miami federal court and cited by the Miami Herald, is accused with tampering with an aircraft's air-data module.\n\nAccording to the complaint, Alani is suspected of gluing a hard foam substance inside a tube that connected a sensor on the nose of the airplane — called \"pitot tubes\" or static ports — with a computerized system — the air-data module, or \"ADM\" — that reads air pressure from the sensor and computes the aircraft's air speed, along with other information like pitch.\n\nThe July 17 flight, AA2834 to Nassau, Bahamas, never took off, and no one on the plane was injured. As pilots powered up the thrusters on the runway in Miami, they received an error alert from the ADM, leading them to abort the takeoff.\n\nThe flight was canceled and the plane — a Boeing 737-800, according to data from FlightRadar24 — was taken out of service for maintenance, according to the criminal complaint. During an inspection, a different mechanic found the obstructed tube.\n\nAlani is charged with \"willfully damaging, destroying or disabling an aircraft.\" He's expected to appear in Miami federal court on Friday, according to the Miami Herald. The charge carries a penalty of up to 20 years in prison, if convicted.\n\nRead more: These were the most delayed airports in the US this summer\n\nAfter he was arrested, Alani said that he was not trying to hurt anyone on board the plane or cause lasting damage to the aircraft, according to the criminal complaint.\n\nInstead, the alleged act of sabotage was because Alani was \"upset\" over stalled contract negotiations between American Airlines and its mechanics' labor unions. He claimed that \"the dispute had affected him financially,\" and that his objective was to cause \"to cause a delay or have the flight canceled in anticipation of obtaining overtime work.\"\n\nAlani was arrested by federal air marshals working as part of the FBI's Joint Terrorism Task Force.\n\nAmerican Airlines has been locked in a contentious battle this summer over stalled contract negotiations with the union representing its mechanics, the TWU-IAM Association — which is formed of the Transport Workers Union of America (TWU) and the International Association of Machinists and Aerospace Workers (IAM). The union represents a total of 30,000 ground workers at American Airlines.\n\nThe airline accused the union of organizing an illegal work slowdown, and filed a lawsuit in May seeking a permanent injunction against the mechanics — the court ruled for American in August. The unions denied that there was an organized slowdown, but nevertheless urged employees to abide by the ruling.\n\nThe airline has been negotiating with mechanics since December 2015, but talks stalled and there has not been a meeting between the airline and unions since April.\n\nSee also: Apply here to attend IGNITION: Transportation, an event focused on the future of transportation, in San Francisco on October 22.\n\nOn Wednesday, TWU-IAM announced that it was resuming contract negotiations with American later this month at the National Mediation Board in Washington, DC.\n\n\"The delays in this process have been frustrating for our members but they have remained fully supportive of the Association,\" Alex Garcia, vice director of the TWU-IAM Association, in a press release announcing the new round of negotiations. \"We will use this opportunity to finally close these negotiations, if American Airlines is a willing partner.\"\n\nTWU-IAM did not immediately return a request for comment regarding Alani's arrest.\n\nIn a statement, American Airlines said that it was cooperating with the federal investigation:\n\nOn July 17, flight 2834 from Miami to Nassau, Bahamas, returned to the gate due to a maintenance issue. Passengers boarded a new aircraft which then re-departed for Nassau. At American we have an unwavering commitment to the safety and security of our customers and team members and we are taking this matter very seriously. At the time of the incident, the aircraft was taken out of service, maintenance was performed and after an inspection to ensure it was safe the aircraft was returned to service. American immediately notified federal law enforcement who took over the investigation with our full cooperation.\n\nThe FBI declined a request for comment on Thursday night.", "description": "The flight to the Bahamas was canceled after pilots noticed an error message on the runway as they powered up the plane's engines.", "authors": ["David Slotnick"], "top_image": "https://amp.businessinsider.com/images/5d71b9a62e22af07295974b4-960-480.jpg", "published_at": "2019-09-05"}