{"pub": "townhall", "url": "https://townhall.com/columnists/erickerickson/2019/09/27/let-the-games-begin-n2553797", "downloaded_at": "2019-09-27 05:39:18.921351+00:00", "title": "Let the Games Begin", "language": "en", "text": "For most of 2018, Republicans claimed Democrats would impeach the President if the Democrats took back the House. Democrats denied it. But it was always true. Democrats have relentlessly tried to discredit President Donald Trump. They have never viewed him as a legitimate president.\n\nDemocrats claimed James Comey stole the election for Trump. They believed by faith that Comey's announcement of an FBI investigation hurt Hillary Clinton. They then believed by faith that his letter to Congress shortly before the election cost Clinton the election.\n\nWhen it turned out Comey hated Trump and the President fired him, Democrats forgave Comey and turned to Russia. They believed by faith that Russia had stolen the election. They believed by faith that Trump and his campaign had collaborated with the Russians. They believed this by faith right up until the moment Robert Mueller told them it was not true.\n\nNow the Democrats believe by faith the President is trying to steal 2020. They believe by faith that he wants Ukraine to harass Joe Biden and his son in an effort to steal the election. If Democrats really believe this, they can easily just not nominate Biden. But in searching for something to replace Christianity, Democrats have embraced politics as a religion, and they believe some things by faith. Pay no attention to Clinton's failures as a candidate, including her failure to campaign in Wisconsin.\n\nNot content to just beat Trump next year at the ballot box, Democrats have decided to finally do what they've always wanted to do, despite their denials: They are going to impeach the president. The media and Democrats want you to know that even moderate Democrats want this; but actually, many moderate Democrats are quite opposed. It has become too late for them to hit the brakes on this endeavor, and they may lose next year.\n\nJust as Democrats have tried desperately to muddy the water about Hillary Clinton's loss in 2016, Trump's team is now trying to muddy the water over impeachment. They keep pointing their fingers at Biden in Ukraine. This is probably going to cost Biden the Democratic nomination, as he cannot afford muddy waters here.\n\nThe reality is Biden did nothing wrong. Biden had no authority to withhold money from Ukraine on the condition that the government fire a prosecutor. He could only do it because President Obama directed him. At the time, the Ukrainian government did not have an ongoing investigation into a company tied to Hunter Biden. Republicans claim there was one, but there was not. Had Biden not gone to Ukraine to demand the prosecutor be fired, another Obama administration appointee would have done so. There was no way Western powers were going to hand a billion dollars to Ukraine as long as that prosecutor held office.\n\nWestern allies believed that the prosecutor was corrupt. They believed he would turn a blind eye to corrupt oligarchs misappropriating Western aid. The entire Western coalition wanted that prosecutor fired. Obama volunteered to do it and sent Biden as the hatchet man. There is no story here. But the Republicans will muddy the water.\n\nOf course, there is no real story to Trump's actions either. Trump speaks in word salads, as we saw with Ukraine's President. In Trump's mind, he certainly has points he wants to make. But as they come out of his mouth and are transcribed, the angels of heaven are forced to divine his intent.\n\nAs to the whistleblower's report, it is deeply problematic for the President. The whistleblower had no direct knowledge of the President's call with Ukraine's president, nor did he read the transcript. But the whistleblower knew the major substantive points of the call. He says multiple officials shared the information with him. He says the President's team moved the transcript of the call from one computer to another to hide it.\n\nWhile this may not be impeachable, it provides the Democrats a path to impeachment. With the whistleblower, they have a list of potential witnesses, a list of potential documents and a central focus with an easily understandable narrative against the President. The next few months will be crazy.", "description": "For most of 2018, Republicans claimed Democrats would impeach the .09/27/2019 1:38:43AM EST.", "authors": ["Erick Erickson", "Matt Vespa", "Timothy Meads", "Reagan Mccarthy"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/269/b25e3a95-1f29-4a5c-b4c7-e75a4fdca771.png", "published_at": "2019-09-27"}