{"pub": "yahoo", "url": "https://news.yahoo.com/pope-urges-respect-indigenous-amazon-122421079.html", "downloaded_at": "2019-10-08 10:27:43.322596+00:00", "title": "Pope urges respect for indigenous Amazon peoples at start of three-week gathering", "language": "en", "text": "By Philip Pullella\n\nVATICAN CITY (Reuters) - Pope Francis on Monday told an assembly of bishops discussing the Amazon region of South America that modern society should not try to impose its rules on indigenous people but respect their culture and let them chart their own future.\n\nFrancis, who is from Argentina, was addressing the opening of the first working session of a three-week gathering on the future of the Roman Catholic Church in the Amazon, including the possibility of introducing married priests.\n\nThe pope said the people of the Amazon should not be \"approached with a type of entrepreneurial eagerness that seeks to give them pre-concocted programmes aimed at disciplining\" them, their history and their culture.\n\n\"Ideological colonisation is very common today... (Let's say) 'no' to this urge to domesticate original peoples,\" he said.\n\nFrancis, who in the past has asked forgiveness in the name of the Church for the errors of European missionaries who accompanied the first colonisers, said that for a long time many in the Church had a \"disparaging\" attitude toward native peoples and their cultures and that some still do.\n\n\"I was very saddened to hear, right here, a mocking comment about that pious man who brought the offerings with feathers on his head,\" he said, speaking of a man from the Amazon who participated in a papal Mass on Sunday.\n\n\"Tell me: what difference is there in having feathers on your head and the three-cornered hat worn by some officials of our (Vatican departments)?\" he said.\n\n\n\n\n\nLAND, TRADITIONS, PRIESTHOOD\n\nThe three-week gathering, or synod, will discuss spreading the faith in the Amazon, a greater role for women, environmental protection, climate change, deforestation, indigenous people and their right to keep their land and traditions.\n\nIt is taking place at a time when the Amazon is in the world spotlight due to the devastating fires in Brazil. At the ceremonial opening Mass on Sunday, Francis said the fires were intentionally lit by special interest groups.\n\nConservative Catholics have attacked the synod's working document as heretical, including what they say is an implicit recognition of forms of paganism and pantheism practised by indigenous people, such as nature worship.\n\nLast week, Bill Donohue, president of the conservative U.S.-based Catholic League, drew criticism for what was perceived as a condescending attitude toward native cultures when he said that a dilemma in the Amazon was \"how to respect the culture of indigenous peoples while at the same time acknowledging inherent deficiencies in it\".\n\nConservatives are particularly up in arms about the possibility of allowing older married \"proven men\" with families and a strong standing in local communities to be ordained as priests in the Amazon as a solution to a shortage of priests.\n\nIn his keynote address to the gathering of some 260 people, most bishops from Amazon countries, Brazil's Cardinal Claudio Hummes said the Church had to be open to change.\n\n\"The Church cannot remain inactive within her own closed circle, focused on herself, surrounded by protective walls and even less can she look nostalgically to the past,\" Hummes said.\n\n\"The Church needs to throw open her doors, knock down the walls surrounding her and build bridges, going out into the world and setting out on the path of history,\" he said.\n\nThe synod does not make decisions. Participants vote on a final document and the pope will decide which recommendations to integrate into his future rulings.\n\n\n\n\n\n(Reporting By Philip Pullella; Editing by Gareth Jones)", "description": "Pope Francis on Monday told an assembly of bishops discussing the Amazon region of South America that modern society should not try to impose its rules on indigenous people but respect their culture and let them chart their own future.  Francis, who is from Argentina, was addressing the opening of the", "authors": ["Philip Pullella"], "top_image": "https://s.yimg.com/uu/api/res/1.2/wczESOrTY2UU3hYsCmDf3g--~B/aD0yOTM7dz00NDk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/4538b012d6a725b96e2b94a946ee7ea2", "published_at": "2019-10-07"}