{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/man-shares-the-story-of-a-dollar-and-how-it-gave-him-a-whole-family-10875268", "downloaded_at": "2019-10-07 12:22:19.181012+00:00", "title": "Man shares the story of a dollar and how it gave him a family", "language": "en", "text": "So cute (Picture: Jfreak7/Reddit)\n\nWhen a Reddit user asked followers about the single biggest thing a dollar had given them, no one expected a heartfelt story.\n\nAfter all, most of us don’t consider $1, which is roughly 81p, to be all that significant.\n\nYet for American Jason W, the small note gave him everything he is grateful for in life – his wife and kids.\n\nJason shared the story on the subreddit, explaining how his love story started with a pack of chewing gum bought for a dollar.\n\nHe began by offering up some background information and wrote: ‘Back in Junior High School, I liked a girl and flirted with her quite a bit.\n\n‘One time, during a band trip, we stopped at a gas station and she bought me a pack of gum.\n\n‘I tried to pay her back $1 but she refused. So, I slipped the $1 in her pocket. She then slipped the dollar in my backpack and so began the back and forth with the $1 bill.\n\nAdvertisement\n\nAdvertisement\n\n‘We found silly ways to give it back and forth. I mailed it to her house. She stuffed it in a gum wrapper and offered me a piece.\n\n‘I then decided that I would ask her out on this $1.\n\n‘I wrote, “Will you go out with me” on it and put it in a note and gave it to her. She said yes (of course, it would be a terrible story otherwise, I suppose).’\n\nThis adorable love story doesn’t just end with two high school sweethearts.\n\nJason and his partner continued their romance well into adulthood.\n\nOf course, the dollar then became a sentimental piece of their history. So, four years later, when Jason wanted to get down on one knee, he had to bring out the dollar.\n\nHe said: ‘I still had the same dollar kept away. On our anniversary, I wrote “Will you marry me” on the bottom of the dollar.\n\n‘We have been married for 15 years and have three awesome kids. We still have that dollar stored away.’\n\nLet’s hope it’s framed somewhere.\n\nMORE: A mum’s heartwarming message about helping other mothers has gone viral\n\nMORE: Girl’s heartwarming love story is a reminder to always shoot your shot\n\nMORE: Woman shares how she transformed her carpeted staircase with just £50 worth of products\n\nAdvertisement Advertisement", "description": "For American Reddit user Jason W, the small note gave him everything he is grateful for in life - his wife and kids.", "authors": ["Faima Bakar"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_88804954_1570449217.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}