{"pub": "fox", "url": "https://foxnews.com/entertainment/leave-it-to-beaver-tony-dow-wally", "downloaded_at": "2019-09-13 11:13:08.084169+00:00", "title": "‘Leave It to Beaver’ star Tony Dow explains why he wasn’t allowed to watch hit series growing up", "language": "en", "text": "As a child, Tony Dow helped capture the innocence of America as Wally Cleaver in “Leave It to Beaver” — and it still continues to captivate audiences nearly 60 years since the show ended.\n\n“Leave It to Beaver,” which aired from 1957 until 1963, chronicled the misadventures of a suburban boy, along with his family and friends. It starred Jerry Mathers, Barbara Billingsley, Hugh Beaumont and Ken Osmond, among others.\n\n'LEAVE IT TO BEAVER' STAR JERRY MATHERS REMEMBERS WORKING WITH ALFRED HITCHCOCK\n\nBut after starring in the feel-good family sitcom, Dow kept busy in Hollywood making guest appearances on a variety of TV shows. Then in the ‘80s, he launched a career in directing and producing that continued for 20 years. It was the early 2000’s when the now-74-year-old began pursuing his childhood love of art and created designs produced from burlwood.\n\nOne of Dow’s sculptures was later chosen for an exhibition in Paris. Today, the proud husband and grandfather resides in the Santa Monica Mountains of Southern California where he continues to create sculptures.\n\nDow spoke to Fox News about his years as a child star, why he returned to playing Wally decades later, as well as why he wasn’t allowed to watch “Leave It to Beaver\" while filming the series.\n\nFox News: How were you discovered at age 11?\n\nTony Dow: I was a swimmer back then and a pretty good one. I was a junior diving champion and held a national record at nine. I was working out at the Hollywood athletic club and there was a lifeguard there who was an actor. He told my mom, “I’m going to this interview for a show where they’re looking for a father and son. Can Tony go with me because we kind of look alike?” He figured maybe that was the only way to get it.\n\n'LEAVE IT TO BEAVER' STAR JERRY MATHERS SAYS HE WAS READY TO HAVE A NORMAL LIFE AFTER HIT SERIES\n\nI put on my blue suit and went in. I didn’t know what was going on. But everything was new and interesting. And I was with him so I felt at ease. However, I ended up getting the part and he didn’t, so that was unfortunate. The show was called “Johnny Wildlife” and it would’ve been the first color series on television about a wildlife photographer and his son. It was way ahead of its time.\n\nThe pilots we did dealt with Japan going over the quotas of hunted whales and a company dumping toxic waste into the ocean… But it didn’t work out because the stock footage they were using couldn’t be duplicated. But there was another show called “Wally and The Beaver.” That made the cut. It was later renamed to “Leave It to Beaver.”\n\nFox News: What was it like working on television at such a young age?\n\nDow: I don't have any other recollections of doing anything else. It was my life, you know? I got up in the morning, had breakfast and went to work. My mom would drive me to work. I would study my lines while on the way and I had three hours of a school a day. The rest of the time we were shooting or rehearsing. Back then, it took two days of rehearsal and then three actual shooting days.\n\n'MARY TYLER MOORE' STAR ED ASNER TELLS ALL\n\nFox News: What was your relationship like with the cast?\n\nDow: It was great. You always hear stories about all these arguments on set. We never had any of that. They wanted us to be as much of a family as possible, for Jerry and I to very much be like regular kids.\n\nThey actually asked our parents not to let us watch the show on TV so we wouldn’t get a big head. So there are probably some episodes that I haven’t seen yet… And there was no swearing on set at all, not even from the crew. They wanted to keep it as family-friendly as possible at all times.\n\nFox News: Were you ever worried about being typecast?\n\nDow: Oh yeah, who wouldn't. That was a major problem. But every actor has that issue… People formulate an opinion about you and expect you to be a particular way. And when you’re not that way, they’re disappointed. They don’t quite understand it. That was an issue I was faced with.\n\nI wish I could have tried to get rid of that. But that changed, especially in the ‘80s. I did “High School U.S.A” with Michael J. Fox. They were even going to make a series out of it so I was pretty happy about that because it would move me along. But that was also at the time when the new “Leave It to Beaver” came along.\n\n'THE LOVE BOAT' STARS TELL ALL\n\nSo I had to make a choice. I was ready to do the other show. And the studio wanted me to do it. But then they were going to recast Wally. I just thought that wouldn't work. I don’t know. It just didn’t make sense in my mind. So I decided to do it.\n\nFox News: Some people still love “Leave It to Beaver” because it reminds them of a simpler time. Others think it’s not realistic. What’s your take on this?\n\nDow: Everybody’s going to have an opinion. But I think the show is the most natural and most realistic representation of the late ‘50s, early ‘60s that was on the air. And most of the stories came from real life.\n\nI remember the writers would come in with these elaborate pitches. The producers would then say, “I don’t want to know any of that. Stop pitching us. Just tell us the worst thing that’s ever happened to you as a kid. Go write that.” So they really tried to keep the show realistic and believable… I’m a little biased, as all my other friends who are on other shows are. They think their shows are the best. But I really do think ours was special because it was written extremely well. We spent a little more money on it than most, I believe, but it was just more realistic.\n\nFox News: How did you manage escaping the so-called child star curse?\n\nDow: When I wasn’t filming my life was normal. My parents wanted to make sure it was normal. When I wasn’t doing the show, I was at school. We had family vacations during the summers and I had my group of friends. And I appreciated that. It’s difficult to make the transition from being a kid actor to an adult actor because all sorts of things happen.\n\nELVIS PRESLEY'S PAL TELLS ALL\n\nYour voice changes. You’re no longer the cute little kid. You go through an awkward age and don’t get hired, so you quit… I wasn’t neglected by my family… I also started college and kept acting… Then I decided to stop and try other things, like directing, to keep things interesting. But my life was sort of consistently the same. So I didn’t have trouble with that transition. And I'm still keeping busy today.", "description": "As a child, Tony Dow helped capture the innocence of America as Wally Cleaver in “Leave It to Beaver” — and it still continues to captivate audiences nearly 60 years since the show ended.", "authors": ["Stephanie Nolasco"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/GettyImages-3243328.jpg", "published_at": "2019-08-28"}