{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/former-staffer-drops-suit-accusing-trump-of-unwanted-kiss.html", "downloaded_at": "2019-09-06 12:10:31.207891+00:00", "title": "Former Campaign Staffer Drops Suit Accusing Trump of Unwanted Kiss", "language": "en", "text": "Alva Johnson. Photo: Salwan Georges/The Washington Post/Getty Images\n\nAlva Johnson, a former Donald Trump campaign staffer, is dropping a lawsuit accusing the president of forcibly kissing her at an August 2016 rally. Citing a hostile judge, threats to her safety, and Trump’s seemingly unlimited resources, Johnson said in a statement Thursday, “I’ve decided for the sake of my family that I will not continue with the case at this time.”\n\nThe 44-year-old, who maintains her claim, filed suit against Trump in February accusing him of a pattern of “racial and gender discrimination.” She also cited Trump’s behavior at a rally she put together for him in Tampa. In the complaint, Johnson said Trump tried to kiss her in an RV before the rally. She claims to have turned away at the last second, causing Trump to kiss her cheek and the corner of her mouth.\n\nWhen she filed suit in February, Johnson said she’d been considering coming forward for more than two years. “I’ve tried to let it go,” she told the Washington Post. “You want to move on with your life. I don’t sleep. I wake up at 4 in the morning looking at the news. I feel guilty. The only thing I did was show up for work one day.”\n\nAt the time, then–White House Press Secretary Sarah Sanders called Johnson’s allegation “absurd on its face.”\n\nIn July, Trump attorney Charles Harder posted video of the kiss online and claimed that it vindicated Trump, writing in court documents that it proved Johnson’s claims to be “entirely false.” He continued: “In watching the Video, the only conclusion a reasonable person could reach is that the exchange was an innocent moment between a dedicated campaign staffer and the candidate for whom she was working.”\n\nBut a lawyer for Johnson said the video showed just the opposite. “We are gratified and pleased that we finally have proof what Ms. Johnson has been alleging in this lawsuit,” Hassan Zavareei told Politico. “It is basically exactly what Ms. Johnson has been saying.”\n\nIn an interview with the Daily Beast this week, Johnson said that the gravity of the interaction didn’t fully resonate until October of 2016 when she heard Trump’s now-infamous Access Hollywood tape.\n\n“Once the Access Hollywood tape came out, I knew that it wasn’t just something that he did 15 years ago, that it was still his behavior, that he thinks he can violate your personal space, that he can kiss women without permission,” Johnson recalled on Wednesday.\n\nAfter she filed the lawsuit, Johnson said she had to make “a big adjustment” to the onslaught of “nasty comments and having your entire life under a microscope.”\n\n“I think people forget that I was at work. It’s absurd to think that it was mutual,” she continued. “He’s a big guy. You should keep your hands to yourself, you should keep your lips to yourself.”\n\nIn court filings, Trump has said he doesn’t remember meeting Johnson. “I do not know plaintiff Alva Johnson or recall having any interactions with her,” he said.\n\nSign Up for the Intelligencer Newsletter Daily news about the politics, business, and technology shaping our world. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.", "description": "Former Trump campaign staffer Alva Johnson says she can’t compete with his unlimited resources, but stands by her claim.", "authors": ["Adam K. Raymond"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/09/05/alva-johnson.w1200.h630.jpg", "published_at": "2019-09-05"}