{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/12/mint-menthol-vape-industry-has-dug-heels-in-on-fla", "downloaded_at": "2019-09-12 07:30:06.707568+00:00", "title": "Mint, menthol: Vape industry has dug heels in on flavor bans", "language": "en", "text": "AUGUSTA, Maine (AP) - Efforts to ban flavored e-cigarettes and reduce their appeal to youngsters have sputtered under industry pressure in over a half-dozen states this year even as one state, Michigan, moves ahead with its own restrictions and President Donald Trump promises federal ones.\n\nIn many cases, the fight by the industry and its lobbyists has focused on leaving the most popular flavors - mint and its close cousin, menthol - alone. But public health experts say that all flavors should be banned, and that menthol can still hook kids on vaping.\n\nThe proposal Trump outlined on Wednesday, which would supersede any state inaction, includes a ban on mint and menthol, and an industry giant quickly indicated it would capitulate.\n\n“We strongly agree with the need for aggressive category-wide action on flavored products,” read a statement released by Juul Labs Inc. “We will fully comply with the final FDA policy when effective.”\n\nBut the fight in state legislatures has been fierce. Lobbyists for the vaping and tobacco industry fought bans on flavors in Hawaii, California, New Mexico, Massachusetts, New York, Maine and Connecticut.\n\nSuch bans failed or stalled, even as Michigan’s governor this month ordered emergency rules prohibiting flavored e-cigarettes. New York Democratic Gov. Andrew Cuomo on Monday expressed a desire to ban flavored e-cigarettes.\n\nTrump’s federal proposal, as it stands, would require no congressional approval, meaning lobbying efforts to defeat it could be less effective than in state legislatures. Juul spent $1.9 million in the first half of the year to try and sway the White House, Congress and the Food and Drug Administration.\n\nThe Vapor Technology Association has reported spending $78,000 this year in its lobbying fight against California’s proposed flavored e-cigarettes ban, while one of the world’s largest tobacco producers, Altria, reported spending over $100,000 last fall solely to lobby such legislation. The bills have since stalled.\n\nReynolds American, which sells Vuse Alto e-cigarettes, reported spending $240,000 on paid lobbyists in New York this year. At least $23,000 alone went to fund their lobbying push against a flavored tobacco ban that failed to pass this year.\n\nAltria - which is also Juul’s biggest investor- also spent over $70,000 in Maine alone this spring on an online social media and email campaign in its efforts to defeat a ban on flavored e-cigarettes and all tobacco products, according to lobbying reports filed with state ethics officials. Maine still has no flavor ban.\n\nThe global e-cigarette and vape market was valued at as much as $11 billion in 2018. The rise in teen vaping has been driven mainly by flavored cartridge-based products such as Juul, which controls roughly three-quarters of the U.S. e-cigarettes market.\n\nThe proposals and the lobbying fight come as health authorities investigate hundreds of breathing illnesses reported in people who have used e-cigarettes and other vaping devices. No single device, ingredient or additive has been identified, though many cases involve marijuana vaping.\n\nSupporters of flavors argue that adult cigarette users say flavors helped them quit, and that legislators should instead focus on companies that are trying to hook young nonsmokers with clearly kid-friendly marketing and packaging.\n\n“One of the things that we are finding is that state legislatures are reflexively reacting to media stories and without a scientific basis making determinations that flavors are the problem so we need to get rid of all the flavors,” said Tony Abboud, president of the Vapor Technology Association.\n\nThere had been concern that the tobacco and vaping industries were winning their fight to keep at least the most popular flavors - mint and menthol - in play. That concern has now been tempered by Trump’s announcement Wednesday that his ban would include menthol and mint.\n\nLast November, the FDA announced plans for a crackdown that could lead to federal regulators pulling all e-cigarette flavors besides menthol and mint - thought to be useful to adult smokers - from shelves. The FDA also said it would also seek to ban menthol cigarettes.\n\nThe FDA’s announcement came just two days after Juul announced the halting of in-store sales of mango, fruit, creme and cucumber flavors in retail stores.\n\nThe company’s CEO has said that Juul never intended for young people to use their products but that they are “sensitive” to concerns raised by the FDA.\n\nAnd a spokesman for Juul, Ted Kwong, said before Wednesday’s announcement by Trump that the company would support an outright ban on flavors that mimic kid candies, foods and drinks.\n\nStill, in line with the FDA’s proposed policy, Juul Labs still distributes mint, menthol and tobacco flavors in retail stores. The company also sells flavored products through its website.\n\nAnti-tobacco and -vaping groups say there’s no scientific basis for leaving menthol or mint alone. They warn menthol has been unethically marketed toward African Americans, and that such flavors can still increase the appeal of e-cigarettes for young people who aren’t smokers by overcoming the harshness of nicotine.\n\n“Anything that is overcoming the harshness of tobacco flavoring is something that kids are going to find more appealing,” said Hillary Schneider, director of government relations in Maine for the American Cancer Society Action Network.\n\nBut banning minty flavors has been politically contentious.\n\nIn Maine, convenience store owners upset by a proposed flavor ban argued that mint, wintergreen and menthol represent 30% of flavors offered in stores statewide and $32 million in tax revenue.\n\nLawmakers then considered a tweak to only allow menthol, mint and wintergreen flavors. Maine ended up passing a bill - backed by the tobacco and vaping industries, as well as small retail stores - that instead makes it illegal to sell e-cigarettes to people under 21 and give them to minors under 16.\n\nOfficials in Michigan Gov. Gretchen Whitmer’s administration discussed exempting mint and menthol flavors from the e-cigarette ban, but “determined that the action taken was the best path forward to protect youth,” said Bob Wheaton, spokesman for the state Department of Health and Human Services.\n\nA court challenge is expected for Michigan’s ban.\n\nAbboud argued before Wednesday that states should hold off on further action for now.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Efforts to ban flavored e-cigarettes and reduce their appeal to youngsters have sputtered under industry pressure in over a half-dozen states this year even as one state, Michigan, moves ahead with its own restrictions and President Donald Trump promises federal ones.", "authors": ["The Washington Times Http", "Marina Villeneuve"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/11/vaping_counterfeiter_25446_c0-168-5081-3130_s1770x1032.jpg?e8965e02bac61cfe71bd915e7289b14531196fe4", "published_at": "2019-09-12"}