{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/rio-ferdinand-issues-rallying-cry-20659269", "downloaded_at": "2019-10-20 12:24:17.687464+00:00", "title": "Rio Ferdinand issues rallying cry to Man Utd players ahead of Liverpool clash", "language": "en", "text": "Get the biggest Manchester United FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nRio Ferdinand has urged Man Utd to \"seize the moment\" in Sunday's clash with Liverpool which he says means \"everything\".\n\nThe former United defender is all too familiar with the fixture, having scored twice against the Reds during his playing career - including a late winner at Old Trafford.\n\nThe same ground plays host for the visit of Jurgen Klopp's league leaders, whose fortunes could not be more different to their opponents so far this season.\n\nUnited are floundering in the bottom half of the table, but Ferdinand has insisted the clash with Liverpool is the perfect opportunity for the Red Devils to kick start their campaign.\n\nSpeaking on his personal Facebook page , Ferdinand said: \" Manchester United vs Liverpool. This Game Is That Big...\n\n(Image: Getty Images)\n\n\"As a player who comes into the club and who isn’t local you are quickly made aware what this game means to you once you have signed - EVERYTHING.\n\n\"You can’t lose, you leave everything on that pitch, you win your individual battles, you give their fans nothing to shout about, you send them back across the M62 in silence...I could go on!\n\n\"Losing just isn’t an option & today that couldn’t apply more. The position Man Utd are in adds even more pressure on the players.\n\n\"The players can’t see it like us fans though - thinking about all of the above just adds to the pressure of a game of this magnitude.\n\n(Image: The Daily Mirror)\n\n\"The players have to see this game as a huge opportunity for themselves as individuals and as a team to be the catalyst for a bright new future by playing an important role in getting a win.\"\n\nLiverpool are bidding to equal a Premier League record at Old Trafford by earning their 18th consecutive win in the competition.\n\nThe Reds are eight wins from eight games so far this season and come into the contest as firm favourites, despite not having won against United on away soil in five years.\n\nBut Ferdinand feels this is the ideal chance for United to address their recent slump by earning a huge victory.\n\n(Image: Getty Images)\n\nHe added: \"This is an opportunity to play a pivotal role in turning around the fortunes at this great club.\n\n\"That should make them excited going into this game not fearful - fear comes with not being able to handle the pressure. We can’t go there.\n\n\"Seize the opportunity should be the mentality going into this game. Go and do it.\n\n\"Enjoy these moments, they are great......when you win. Good luck to the boys.\"", "description": "The Red Devils welcome league leaders and rivals Liverpool to Old Trafford who are looking to maintain their perfect start", "authors": ["Darren Wells", "Image", "Getty Images", "The Daily Mirror"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20659239.ece/ALTERNATES/s1200/0_Wayne-Rooney-Testimonial-Manchester-United-v-Everton.jpg", "published_at": "2019-10-20"}