{"pub": "businessinsider", "url": "https://businessinsider.com/elliotts-att-activist-campaign-may-bring-spin-offs-next-2019-10", "downloaded_at": "2019-10-28 23:37:08.138852+00:00", "title": "AT&T survived round one with activist hedge fund Elliott. Now, the company has to fill a board seat and weigh spin-offs under the fund's close watch.", "language": "en", "text": "Elliott's $3.2 billion stake in AT&T has pushed the telecom giant to add two new board members and split the chairman and CEO roles for Randall Stephenson's successor. The influential hedge fund is not done, though.\n\nSources tell Business Insider that one of the new board members has not been picked yet and Stephenson's one-time successor-in-waiting, John Stankey, is auditioning for Stephenson's job, though has not been guaranteed the role.\n\nThe firm is also reviewing its portfolio of companies, according to a statement on Monday, with the possibility of a sale for some of AT&T's big brands, like DirecTV.\n\nClick here for more BI Prime stories.\n\nAT&T didn't waste time reaching an agreement with Paul Singer's activist hedge fund, Elliott Management.\n\nJust a little over seven weeks after the $38 billion fund announced its campaign with a $3.2 billion investment in AT&T, the telecom giant has acquiesced on several of the fund's demands. Chief among them is a cost-cutting plan, to be led by former cable executive Bill Morrow, the addition of two new members to the company's board, and a review of the firm's sprawling list of portfolio companies.\n\nBut the lion's share of the work still remains. One of the two new board members has not been selected, sources tell Business Insider, and Elliott is pushing for someone with a media background. And while a review of the portfolio may bring about a sale of a brand like DirecTV, nothing is guaranteed, especially if the market is uninterested in AT&T's undesired pieces.\n\n\"There are no sacred cows,\" said Randall Stephenson, AT&T's CEO, on the firm's earnings call Monday morning about the firm's list of portfolio companies.\n\nSee more: We talked to 24 people about the hedge-fund wunderkind at Elliott who wants to shake up AT&T. Here's why management should be terrified.\n\nSources familiar with the back-and-forth between Stephenson and the hedge fund, whose campaign was led by its head of U.S. activism, Jesse Cohn, said Stephenson was open to the hedge fund's suggestions despite some initial skepticism of Elliott.\n\nStephenson agreed that his successor as CEO would not hold the chairman role as well, like he currently does, for example, and has opened up the search for his successor beyond his hand-picked candidate, president and chief operating officer John Stankey, who was also removed as the CEO of WarnerMedia. Elliott is pushing for an executive with more media experience to fill that WarnerMedia role.\n\nDespite Stephenson's acceptance of many of Elliott's proposals, AT&T still has to execute. A review of portfolio companies does not necessarily mean a sale of certain brands, though it is expected to from Elliott's side.\n\n\"There's a lot of low-hanging fruit here, like it's almost touching the ground,\" one person close with Elliott said.\n\nAT&T already sold its Puerto Rico operation to Liberty Latin America for nearly $2 billion earlier this month.\n\nWhile one new board member is already agreed upon by AT&T and Elliott — and will join the board later this week — the second new member is still unknown. The hedge fund is pushing for someone with media experience, which it identified as a weak spot given the job now involves overseeing operations like HBO.\n\nThe second new board member will start at the firm in 2020, though the company could look drastically different by then, depending on what happens over the next two months.\n\n\"There's going to be a lot more announcements, a lot more markers, coming out in the next few months,\" the person close to Elliott said.", "description": "AT&T said it will add two board members, cut costs, and split the CEO and chairman roles once current head Randall Stephenson leaves.", "authors": ["Bradley Saacks", "Casey Sullivan"], "top_image": "https://image.businessinsider.com/5db74c6edee01945de3684c4?width=1200&format=jpeg", "published_at": "2019-10-28"}