{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/23/hunter-strickland-no-longer-wants-strike-bryce-harper-just-strike-him-out", "downloaded_at": "2019-09-23 19:11:19.746914+00:00", "title": "Hunter Strickland no longer wants to strike Bryce Harper, just strike him out", "language": "en", "text": "\n\nHunter Strickland and Bryce Harper have a history. They could face each other this week with the Phillies in town for five games. (Kelley L. Cox/USA Today Sports)\n\nMIAMI — Once the Washington Nationals traded for Hunter Strickland on July 31, in a 30-minute stretch that netted them three new relievers, the jokes and conspiracy theories were the lowest of hanging fruit.\n\nThe Nationals got Strickland to bother Bryce Harper. They got him to troll the superstar who left Washington for Philadelphia in the offseason. They got him because, about two years prior, Strickland plunked Harper to start a brawl that’s etched into the first draft of Nationals history. You may remember Harper, hair flopping all over the place, rearing back and chucking his helmet about 10 feet wide of Strickland. Then they exchanged a flurry of punches on the mound. Then their teammates piled on, and the two players were lost shuffle, heads flung into the mess, hands still high and ready to hit anything that moved.\n\n[Bryce Harper’s fight with Hunter Strickland led to so many memes]\n\nHarper played for the Nationals and Strickland for the San Francisco Giants. Now, in a plot twist, Strickland pitches for Washington and could face Harper again this week. The Phillies, on the outside of the wild-card race, are in Washington for five games between Monday and Thursday. The Nationals are in position to lock up a postseason spot with them in town.\n\n“I’m honestly thinking about the Phillies, the team, nothing else‚” Strickland said at his locker at Marlins Park this past weekend. “Whether it’s Bryce or whoever else, I need to get outs. I need to get Bryce out if I face him, and that’s pretty much it.”\n\nThe backstory of the fight hardly matters in 2019: Harper hit a pair of home runs off Strickland in the 2014 postseason. After the second one, a moonshot that tied Game 4 of the National League Division Series in the seventh inning, Harper took a long stare before glancing at Strickland while he rounded the bases. Strickland took exception. He went for revenge three years later, throwing a fastball at Harper’s front hip, and that’s when the punches flew.\n\nStrickland was suspended six games. Harper got four. Nationals General Manager Mike Rizzo called throwing at Harper a “selfish act” by Strickland. He went even further to suggest that Strickland’s teammates didn’t seem interested in backing him up once Harper charged the mound. Strickland has since called the whole incident a mistake on his part, multiple times, and has worked on settling his temper. He missed two months in 2018 after punching a door following a blown save against the Miami Marlins. He took a look in the mirror in the offseason — a hard look — and did sessions with a life coach while dipping into anger management books.\n\nHe believes he has changed for the better. And Harper, a mark on Strickland’s history, is part of that.\n\n“You just get older, you get more mature,” Strickland, 30, said of what that day taught him. “I realize that I shouldn’t try to take everything into my own hands. It’s unfair to a lot of people to be that way.”\n\nHe paused for a second, nodding, then decided that was how he wanted to answer the question.\n\n“Yeah, that’s what I learned from it.”\n\nThe righty is, really, just narrowly focused on pitching better. The Nationals took a risk on him at the deadline, since he missed four months of this season with a Grade 2 lat strain. He does offer another year of team control beyond this one, meaning he should be with the club in 2020, but he was mostly acquired to get big outs down the stretch.\n\nThrough 21 appearances with Washington, his ability to do so has wavered. He has a 5.30 ERA in 18⅔ innings with Washington. He allowed the St. Louis Cardinals to break a late tie on Sept. 16. He allowed the Marlins to start their comeback Sunday, with a seventh-inning home run, and combined with Wander Suero for another bullpen collapse. Manager Dave Martinez has noted that Strickland is still trying to find the right balance between his mid-90s fastball and secondary pitches. Rust from the injured list could be a part of that.\n\nWhen Strickland falls behind hitters, which he is doing way too often, he relies on his fastball and has found trouble. He has to get more comfortable throwing his slider for strikes, he explained, so batters can’t sit on his heat when ahead in counts. He also needs to locate his pitches better and remember not to put so much pressure on each at-bat. That’s something he did earlier in his career, when he was still trying to prove himself, and has to resist the temptation of getting frustrated.\n\nBut he has learned how to control that. Time has helped.\n\n“When you get to the middle of your career, and you’ve been around a lot, you sort of figure out how to ride the wave and make adjustments without overhauling,” Strickland said. “A younger me wouldn’t have understood that.”\n\nSort of like how you view the possibility of staring down Harper this week?\n\n“Yep,” Strickland said, even cracking a big smile. “It’s all connected somehow.”\n\nRead more on the Washington Nationals:\n\nBoswell: The Nationals are in great shape or they’re a flawed mess, depending on how you look at them\n\nState of the wild-card race: Nationals seem destined for another clash with Brewers\n\nNationals’ Asdrúbal Cabrera should avoid MRI after tweaking right ankle\n\nKurt Suzuki balancing health concerns with urgency of pennant race\n\nAnthony Rendon’s MVP case is gaining momentum but running out of time", "description": "Strickland plunked Harper to spark a brawl in May 2017. They could face each other again this week, with Strickland now a member of the Nationals.", "authors": ["Jesse Dougherty", "Reporter Covering The Washington Nationals.", "September At Pm", "Jesse Dougherty Covers The Washington Nationals."], "top_image": "https://www.washingtonpost.com/resizer/EAobNhdtXTqBVtKiulzof8L08ck=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/M43IAT4U6VFNXJZ5DPSLJFB27A.jpg", "published_at": "2019-09-23"}