{"pub": "investingcom", "url": "https://investing.com/analysis/the-world-now-needs-a-weakening-dollar-200467363", "downloaded_at": "2019-09-24 13:58:50.201470+00:00", "title": "The World Now Needs A Weakening Dollar", "language": "en", "text": "Markets are in a state of precarious balance between good and bad news. China and the U.S. continue to argue that they are moving forward in trade negotiations, which supports a mostly positive tone of Asian bourses. Besides, the markets were supported by expectations that the monetary easing and governments stimulus already in place will put national economies back on the growth path.\n\nOn the other hand, Germany and South Korea are demonstrating a significant downturn in their business activity. These countries are often acting as critical early indicators of global trade activity, as they are actively involved in the supply of manufacturing equipment, semiconductors, and chemical materials.\n\nSo far, the situation looks quite manageable. However, over time, there are more and more signs that the current methods do not help. As in the case of antibiotics, excessively frequent use of budget financing and extremely low-interest rates has increased the level of requirements for stimulus.\n\nThe U.S. public debt exceeds the country’s and reaches an appalling $22.6 trillion. The U.S. national and municipalities debt exceeds 120% of GDP and set to grow at an accelerated pace in the coming years.\n\nIn many other developed countries, the situation is not better. Years of low-interest rate policies have poured money into the economy with an ever-decreasing effect, but with the clear consequence of rising debt. Debt-burdened countries are struggling with growth.\n\nThe Fed had a U-turn in its policy in less than a year that indicates the growing vulnerability of the U.S. economy. The Federal Reserve has to pay more and more attention to external factors. The U.S. is becoming increasingly dependent on external macroeconomic cycles.\n\nAn obvious way out of this situation is to reduce the debt burden. A chance of direct default of the U.S. government seems to be negligible. It is much more likely that debt value will be gradually depreciated due to higher inflation. Moreover, the Fed and other central banks are powerless to accelerate price growth, as they can not stimulate it over the past ten years.\n\nThere is a much higher chance that reciprocal international tariffs will become a necessary impulse for global price growth. However, this “medicine” has very severe side effects. It can also be a shock to consumers who are going to slow down their purchases for a while. At the same time, the ability of governments and central banks to stimulate demand is limited by the extremely low-interest rates, while the debt burden is close to a record level.\n\nPerhaps the least extreme scenario, in this case, maybe a gradual but prolonged weakening of the as a global measure of value. It will make current debt burden estimates less severe, support global inflation and strengthen business activity.\n\nThe first way, used in the XX century, was the possibility of coordinated interventions of the central banks and the finance ministries to weaken the USD. However, the more natural way seems through the resolution of trade conflicts. This scenario may become the very force that can trigger the weakening of the Dollar, spurring inflation and the world economic growth.\n\nUS Debt\n\nThe FxPro Analyst Team", "description": "Forex Analysis by Alexander Kuptsikevich covering: US Dollar Index Futures. Read Alexander Kuptsikevich's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-24"}