{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/technology/apple-september-quarter-earnings-what-to-watch-15145152", "downloaded_at": "2019-10-29 23:57:31.296098+00:00", "title": "Apple Reports Earnings on Wednesday: 7 Important Things to Watch", "language": "en", "text": "Apple's (AAPL) stock is up 12% since the company unveiled its latest iPhones in mid-September, as signs keep emerging that demand for the phones is better than originally expected.\n\nThat spells somewhat higher expectations going into Wednesday's September quarter (fiscal fourth quarter) earnings report. On average, analysts polled by FactSet expect revenue of $63.02 billion (roughly flat annually) and GAAP EPS of $2.83 (down 3%).\n\nFor the December quarter -- Apple provides quarterly sales guidance in its reports -- the revenue consensus stands at $86.74 billion (up 3%). Given how seasonally big the December quarter is for the iPhone and other Apple hardware franchises, the company's sales guidance might have a bigger impact on how its stock moves post-earnings than its September quarter results.\n\nTheStreet will be live-blogging Apple's report, which is expected around 4:30 P.M. Eastern Time on Wednesday, along with an earnings call that's set for 5:00 P.M. Here are some key things for investors to keep an eye on.\n\n1. iPhone Revenue and Pricing Trends\n\nBetween reports of production hikes, extended delivery time estimates (for a while) on Apple's U.S. and international websites and encouraging guidance and comments from suppliers such as Taiwan Semiconductor (TSM) , NXP Semiconductor (NXPI) and AMS AG, there are a number of reasons to think the iPhone 11 and 11 Pro are off to a better-than-expected start.\n\nBut for now, consensus analyst estimates are still pretty subdued. For the September quarter, the consensus is for iPhone revenue to be down 12% to $32.78 billion, after having risen 29% in the year-ago period with the help of the iPhone X's pricing. And for the December quarter, the consensus is for iPhone revenue be down 2.5% to $50.66 billion, following a 15% year-ago decline.\n\nIn addition Apple's iPhone revenue print, any commentary shared about iPhone average selling price (ASP) trends will be closely watched, given that Apple gave the standard iPhone 11 a $699 starting price and kept the iPhone XR (previously started at $749) around at a $599 starting price. Since Apple doesn't break out its iPhone units anymore, a precise ASP figure can't be calculated.\n\n2. 'Wearables' Growth\n\nThree months ago, Apple beat June quarter revenue estimates thanks largely to a 48% sales increase (far above analyst estimates) for its Wearables, Home & Accessories segment. The Apple Watch and AirPods appear to have driven much of this growth, with Tim Cook mentioning Apple's \"wearables\" sales, which cover the Watch, AirPods and Beats headphones, grew \"well over 50%.\"\n\nThe September quarter, which saw the Apple Watch Series 5 arrive towards its end, is believed to have been another strong quarter for the Watch and AirPods: The consensus is for Wearables, Home & Accessories revenue to be up 41% to $5.94 billion. In the seasonally big December quarter, which should get a boost from the Watch Series 5 as well as Apple's just-launched AirPods Pro, the segment's revenue is expected to grow 26.5% to $9.25 billion.\n\n3. Services Growth and Commentary\n\nThe consensus for Apple's September quarter Services revenue stands at $12.22 billion. That officially represents 22% growth relative to what was reported a year ago, but the growth rate reported in the earnings release could be lower due to an accounting change.\n\nRegardless, Apple still appears to be seeing healthy Services growth -- particularly for Apple-branded services as opposed to the large search ad revenue-sharing payments it's getting from Alphabet/Google (GOOGL) . The company has been sharing some details about its Services performance on its earnings call: In July, CFO Luca Maestri indicated that App Store, Apple Music, iCloud storage subscriptions and AppleCare revenue grew at a double-digit clip in the June quarter, and that Apple Pay and App Store search ad revenue grew at triple-digit rates.\n\nApple's latest Services disclosures will follow the recent launch of the Apple Card and the Arcade gaming service, and come just ahead of the Nov. 1st launch of the TV+ video service, which for now is provided for free for a year with many Apple hardware purchases.\n\n4. iPad and Mac Sales\n\nWith the help of favorable comps (iPad revenue was down 15% in the year-ago period), Apple's iPad revenue is expected to be up 14% in the September quarter to $4.67 billion. Healthy demand for the iPad Pros launched a year ago has been a tailwind for the business in recent quarters.\n\nMac revenue is expected to be up 1% to $7.5 billion, following an 11% June quarter increase. The MacBook revamp unveiled in early July might have provided a lift.\n\n5. Chinese Sales Trends\n\nFollowing two quarters of 20%-plus declines, Apple's Greater China revenue fell a more modest 4% in the June quarter, with Cook adding that Mainland China revenue managed to grow. iPhone sales were said to have benefited from price cuts and improved trade-in offers, and Services revenue was said to have grown by a double-digit percentage.\n\nWe'll know on Wednesday if this momentum has continued in recent months. There have been some reports indicating that early Chinese demand for the standard iPhone 11 has been healthy.\n\n6. Gross Margin Trends\n\nIn July, Apple guided for a September quarter gross margin (GM) of 37.5% to 38.5%, which compares with a year-ago GM of 38.3%. iPhone sales pressures and a strong dollar have been margin headwinds, while lower memory prices and (given Apple's 60%-plus Services margin) double-digit Services growth have been tailwinds.\n\nApple's December quarter margin guidance will be closely watched, particularly in light of how Apple revamped its iPhone pricing in September. The December quarter GM consensus currently stands at 37.6%.\n\n7. Stock Buybacks\n\nApple has been a pretty avid buyer of its own stock in recent years, and spent nearly $50 billion on stock repurchases over the first three quarters of fiscal 2019 (it ended in September). Odds are that a fair amount of stock was also repurchased in the September quarter.", "description": "iPhone sales and pricing trends, Chinese demand and wearables and services growth are among the things to watch as Apple reports....AAPL", "authors": ["Eric Jhonsa", "Apple Reports Earnings On Wednesday", "Important Things To Watch", "Iphone Sales", "Pricing Trends", "Chinese Demand", "Wearables", "Services Growth Are Among The Things To Watch As Apple Reports.", "Stocks Quotes In This Article", "Timothy Collins"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/68096b1d-ce4a-11e9-848d-0ba4746b2b6d.png", "published_at": "2019-10-29"}