{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/15/up-close-with-googles-budget-chromebook-the-pixelbook-go", "downloaded_at": "2019-10-15 23:06:21.956538+00:00", "title": "Up close with Google’s budget Chromebook, the Pixelbook Go – TechCrunch", "language": "en", "text": "The Chromebook has been a marked hit for Google — well, for Google’s hardware partners, at least. Low-cost devices have flooded the market, with a stranglehold on the educational category in particular. Google’s own first-party offerings, on the other hand, have been a bit more curious.\n\nDevices like the Pixelbook and Pixel Slate have pushed the $1,000 price point in an attempt to demonstrate Chrome OS’s viability in a more premium tier. With the Pixelbook Go, on the other hand, Google’s playing much more to the cloud-based operating system’s strengths, with a far more accessible price point.\n\nStarting at $649 (albeit configurable all the way up to ~$1,400), the Go is an attempt to play to Chrome OS’s base: users looking for a more affordable entry point. After all, hasn’t that always kind of been the point of Chromebooks?\n\nOf course, affordability comes with compromises. From a design perspective, that means losing some of the things that made the original Pixelbook so interesting. Top of the list are the convertible lid, which helps it double as a laptop and a tablet. Turns out 360-degree hinges are pretty cost-prohibitive (though admittedly we’ve seen them on some fairly cheap systems). And since the hinge is gone, Google also opted to drop pen input, while retaining the touchscreen.\n\nAs with the original Pixelbook, there are still only two USB-C ports on-board (one on either side). That limits flexibility quite a bit. Of course, the company opted not to add more due, in part, to pricing constraints. The company also tells me that most core Chromebook users should find two sufficient. Perhaps that’s the case with a majority of users.\n\nOtherwise, the design is pretty nice, down to the colorful, ribbed bottom, which is designed to make the device easier to hold in one hand. Ditto for the lighter weight. It’s an easier laptop to port around or toss in a bag on the go.\n\nThe keyboard has been improved, as well. It’s quiet, as advertised (though admittedly I was using it in a fairly loud environment), and while the keys are on the soft side (especially compared to the MacBook, which is a bit like typing on Chiclets), it has a pretty good feel to it. I could certainly see using this as my primary computer on that front, at least.\n\nWhile Chrome OS has been vastly improved since its earliest days (thanks to, among other things, Android app compatibility), it’s still limited for those looking to get more serious work done. The lower-cost Go makes that gulf even more pronounced. On a personal note, I’ve run into issues trying to do things like, say, audio editing on the product.\n\nThe lower price point also means that the device starts from a lower-power processor, with the m3 and 8GB of RAM. You can bump it to 16GB and a Core i5 or i7, but that, naturally, will cost you. At a certain point you’re starting to get into original Pixelbook territory.\n\nThe original model is sticking around, by the way. No spec changes to speak of, however, in spite of the fact that it’s a two-year-old product. That one seems overdue for a bump, especially with another new model in the line.\n\nIt seems safe to assume that Google’s going to move significantly more Gos than original Pixelbooks, based on price alone. It’s an interesting slice of the market, targeted primarily at consumers looking for a cheaper entry point. The company isn’t really targeting the education market here, in spite of the Chromebook’s success in the space. Google tells me that the product is simply priced too high for K-8 students.\n\n[gallery ids=\"1897535,1897534,1897533,1897532,1897528,1897529,1897530,1897531\"]", "description": "The Chromebook has been a marked hit for Google — well, for Google’s hardware partners, at least. Low-cost devices have flooded the market, with a stranglehold on the educational category in particular. Google’s own first-party offerings, on the other hand, have been a bit more curious. Devices like the Pixelbook and Pixel Slate have pushed […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/CMB_8462.jpeg?w=600", "published_at": "2019-10-15"}