{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/10/william-taylor-ukraine-trump.html", "downloaded_at": "2019-10-22 20:46:10.886462+00:00", "title": "In Testimony, Acting Ambassador to Ukraine Outlines Trump’s Quid Pro Quo", "language": "en", "text": "Not pulling any punches. Photo: Olivier Douliery/AFP via Getty Images\n\nIn dramatic testimony Tuesday morning, William Taylor, the American envoy to Ukraine, provided the most complete picture yet of how centrally the Trump administration’s Ukraine policy revolved around a quid pro quo: military aid and a White House visit in exchange for an investigation into Joe Biden’s son and another involving the origins of the FBI’s investigation into President Trump.\n\nIn a long opening statement that prompted sighs and gasps among lawmakers, Taylor made it clear that those who were steering the White House’s Ukraine policy, including U.S. ambassador to the E.U. Gordon Sondland, were preoccupied with the investigations. Sondland, Taylor said, had cited them as a reason why the White House held up Ukraine military aid for months. Taylor also said that Sondland had heard about the Biden investigation from the president himself, contradicting Sondland’s testimony last week. Taylor drew on extensive notes he had taken at the time of the events he described.\n\nDemocrats framed his statements as deeply damaging to the president, while Republicans attempted to shrug them off. “What he said was incredibly damning to the president of the United States,” Representative Ted Lieu, said, echoing others’ assessment of the testimony.\n\n“All I have to say is that in my 10 short months in Congress … it’s my most disturbing day in Congress so far,” said Rep. Andy Levin, a freshman Democrat from Michigan. — Shimon Prokupecz (@ShimonPro) October 22, 2019\n\nMembers have described Bill Taylor’s testimony this morning as disturbing and very credible, backed up by “meticulous” contemporaneous notes he took during phone calls and meetings. Those formed the backbone of a lengthy opening statement. — Garrett Haake (@GarrettHaake) October 22, 2019\n\nTaylor was involved in a now-notorious text message exchange between him, Sondland, and diplomat Kurt Volker, involving the administration’s unusual posture toward the country. “As I said on the phone, I think it’s crazy to withhold security assistance for help with a political campaign,” Taylor texted at one point. Sondland assured him there was no quid pro quo, in a text he has said he wrote after speaking with the president.\n\nMultiple Democrats suggested that Sondland, who testified last week, needed to return to clear up statements that conflicted with Taylor’s.\n\nRep. Connolly to reporters just now: “Speaking for myself, I think Gordon Sondland may very well have to come back.” — Sam Brodey (@sambrodey) October 22, 2019\n\nTaylor replaced the previous ambassador, Marie Yovanovitch, whose suspect firing in May is also at the heart of Democrats’ impeachment proceedings.\n\nAs with other witnesses involved in the proto-impeachment inquiry, the Trump administration attempted to block Taylor from talking to lawmakers at all. But after Democrats issued a subpoena compelling him to appear, Taylor, like previous witnesses, complied.\n\nThe White House has vociferously denied the existence of a quid pro quo, though White House chief of staff admitted the existence of one in a bungled press conference last week.", "description": "William Taylor, the U.S.’s acting ambassador to Ukraine, provided the most complete picture yet of how centrally the Trump administration’s Ukraine policy revolved around a corrupt quid pro quo.", "authors": ["Benjamin Hart"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/10/22/22-bill-taylor.w1200.h630.jpg", "published_at": "2019-10-22"}