{"pub": "yahoo", "url": "https://news.yahoo.com/found-85-000-cops-ve-012000534.html", "downloaded_at": "2019-10-15 08:12:05.709760+00:00", "title": "We found 85,000 cops who’ve been investigated for misconduct. Now you can read their records.", "language": "en", "text": "At least 85,000 law enforcement officers across the USA have been investigated or disciplined for misconduct over the past decade, an investigation by USA TODAY Network found.\n\nOfficers have beaten members of the public, planted evidence and used their badges to harass women. They have lied, stolen, dealt drugs, driven drunk and abused their spouses.\n\nDespite their role as public servants, the men and women who swear an oath to keep communities safe can generally avoid public scrutiny for their misdeeds.\n\nThe records of their misconduct are filed away, rarely seen by anyone outside their departments. Police unions and their political allies have worked to put special protections in place ensuring some records are shielded from public view, or even destroyed.\n\nReporters from USA TODAY, its 100-plus affiliated newsrooms and the nonprofit Invisible Institute in Chicago have spent more than a year creating the biggest collection of police misconduct records.\n\nObtained from thousands of state agencies, prosecutors, police departments and sheriffs, the records detail at least 200,000 incidents of alleged misconduct, much of it previously unreported. The records obtained include more than 110,000 internal affairs investigations by hundreds of individual departments and more than 30,000 officers who were decertified by 44 state oversight agencies.\n\nSearch for police discipline records\n\nUSA TODAY Network has gathered discipline and accountability records on more than 85,000 law enforcement officers and has started releasing them to the public. The first collection published is a list of more than 30,000 officers who have been decertified, essentially banned from the profession, in 44 states. Search our exclusive database by officer, department or state.\n\nSearch database\n\nAmong the findings:\n\nMost misconduct involves routine infractions, but the records reveal tens of thousands of cases of serious misconduct and abuse. They include 22,924 investigations of officers using excessive force, 3,145 allegations of rape, child molestation and other sexual misconduct and 2,307 cases of domestic violence by officers.\n\nDishonesty is a frequent problem. The records document at least 2,227 instances of perjury, tampering with evidence or witnesses or falsifying reports. There were 418 reports of officers obstructing investigations, most often when they or someone they knew were targets.\n\nLess than 10% of officers in most police forces get investigated for misconduct. Yet some officers are consistently under investigation. Nearly 2,500 have been investigated on 10 or more charges. Twenty faced 100 or more allegations yet kept their badge for years.\n\nThe level of oversight varies widely from state to state. Georgia and Florida decertified thousands of police officers for everything from crimes to questions about their fitness to serve; other states banned almost none.\n\nSearch the database: Exclusive USA TODAY list of decertified officers and their records\n\nTarnished Brass: Fired for a felony, again for perjury. Meet the new police chief.\n\nThat includes Maryland, home to the Baltimore Police Department, which regularly has been in the news for criminal behavior by police. Over nearly a decade, Maryland revoked the certifications of just four officers.", "description": "USA TODAY is leading a national effort to obtain and publish disciplinary and misconduct records for thousands of police officers.", "authors": ["John Kelly", "Mark Nichols", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/RSncL48.thKn59EbkcMkjQ--~B/aD0xOTYzO3c9MjY1MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/443db3188911e1950848dd6bcda0b0a5", "published_at": "2019-10-15"}