{"pub": "scmp", "url": "https://yp.scmp.com/over-to-you/columns/article/114416/face-does-artificial-intelligence-do-more-good-harm-mankind", "downloaded_at": "2019-10-08 11:39:24.318661+00:00", "title": "Face off: Does artificial intelligence do more good than harm to mankind?", "language": "en", "text": "Nicholas Ng, 17, South Island School\n\nArtificial intelligence (AI) promises much – and its development suggests it will continue to flourish in a manner that is beneficial for all.\n\nLet’s look at the key benefits of AI – its ability to personalise, predict, and autonomise. The key selling point of AI is that all of this is widely applicable in a huge range of areas. For consumers, this means personalised goods and services. For governments, this may mean improved law enforcement, especially in catching unlawful activities on the Internet. For economists, it may mean a better prediction of future recessions. Even in finance, AI systems are increasingly autonomising the sale of stocks. All of this is expected to improve productivity on a huge scale.\n\nAI, however, can only be as beneficial as the way its data is provided and managed. The Cambridge Analytica scandals have forced governments and tech giants to rethink the manner in which data is regulated and stored – with the European Union recently pushing through legislation that aims to hold tech firms accountable for data misuse. Ironically, the chaos of data mismanagement has been the impetus for better governance of the data that AI relies on. With increasing attention on the key input behind AI’s potential, we can be assured that the technology is much less likely to be abused with the proper enforcement and laws that today’s efforts have established.\n\nAI can also have social benefits – albeit less obvious ones. Unlike other tech revolutions that have been largely blamed for causing mass technological unemployment, the tech does provide some degree of opportunity. In Kibera, Africa’s largest urban slum area, tech company Samasource pays poor Kenyans enough for some to move out of the impoverished neighbourhoods they had been settled in. So yes, AI can’t solve poverty, but it does provide social opportunities that other innovations take away.\n\nAI has some big expectations to live up to – but as long as measures are taken to ensure it is well controlled and carefully monitored, then current conditions suggest it has unparalleled potential.\n\nHow would you explain 5G networks to people who live in the 18th century?\n\nLaila Joy Albuquerque, 18, Hong Kong University of Science and Technology\n\nArtificial intelligence is quickly becoming ubiquitous in the modern world we live in, with automated cars on the road and virtual assistants like Amazon’s Alexa in our homes. Sure, they may make our lives easier, but the risks are not worth the convenience AI brings.\n\nStudies have shown that the main cause of road accidents have been due to human errors, but who’s to say computers don’t make errors? They are programmed to react to certain situations, such as “Stop when there is a pedestrian on the road”, but the computer might not be able to detect everything the human eye can. On March 18, one of Uber’s self-driving vehicles struck and killed a cyclist. This is proof that we cannot trust these machines with our lives.\n\nAI also threatens to infringe on our personal privacy and way of life. As more and more banks and corporations gather as much information about as possible, and as voice and facial recognition monitors our every move, we give up more and more of our privacy.\n\nFurthermore, as the world uses more technological ways to simplify our daily tasks, we lose things that potentially give us pleasure – like learning how to drive, or working through complicated maths equations with friends over bubble tea. Little things like this will be lost the more we delegate to robotics.\n\nAbove all, the ultimate risk of AI is that we will lose everything great about being human; as robotics attempt to imitate everything distinct to humanity, from decision making to art, people may start to lose their instincts, passion and creativity.\n\nEdited by Ginny Wong and Nicole Moraleda", "description": "Each week, two of our readers debate a hot topic in a parliamentary-style debate that doesn’t necessarily reflect their personal viewpoint. This week …", "authors": [], "top_image": "https://yp.scmp.com/sites/default/files/styles/900x506/public/images/2729bf02-e99b-11e9-9e8e-4022fb9638c4imagehires151521.jpg", "published_at": "2019-10-08"}