{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/strictlys-catherine-tyldesley-lashes-out-20741093", "downloaded_at": "2019-10-28 13:28:18.566279+00:00", "title": "Strictly's Catherine Tyldesley lashes out at judges after her surprising exit", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nStrictly Come Dancing 's Catherine Tyldesley has hit out at the judges for sending her home.\n\nThe axed Strictly hopeful, 36, was booted off the BBC show after she and her partner Johannes Radebe went head-to-head against Mike Bushell and Katya Jones in the dance off.\n\nCatherine didn't hold back and made her feelings known when she liked a scathing tweet about her surprise exit.\n\nShortly after her departure from the show, the actress turned to Twitter to seek comfort from seething fans.\n\nShe liked Hayley Tamaddon's tweet which read: \"Sorry but @Cath_Tyledesley did not deserve to go tonight in @bbcstrictly... she was the better dance by far..\n\n(Image: PA)\n\n\"Hold your head up high my darling Cath... you've been a joy to watch from start to finish. Big love to you and @jojo_radebe.\"\n\nShirley Ballas cast the final vote that sent Catherine home in a shock twist.\n\nThe head judge had chosen to side with Craig Revel Horwood after he voted to save Mike and Katya in the competition.\n\nNew judge Motsi Mabuse and Bruno Tonioli were in agreement that Catherine and Johannes should be saved.\n\n(Image: TV Grab)\n\n(Image: PA)\n\nFans were left seething about the decision as they were convinced she shouldn't have sent the Coronation Street star home.\n\nSocial media was awash with comments from fans venting their anger.\n\n\"Was Shirley watching the same programme as the rest of us?\", questioned one viewer.\n\n\"She saved Mike!! Terrible decision\".", "description": "Catherine unleashed her anger at the judges by liking a venom-laden tweet about the Strictly Come Dancing judges", "authors": ["Lily Waddell", "Image", "Pa", "Tv Grab"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20741502.ece/ALTERNATES/s1200/0_Strictly-Come-Dancing-Launch-2019-London.jpg", "published_at": "2019-10-28"}