{"pub": "townhall", "url": "https://townhall.com/columnists/scottmorefield/2019/09/09/the-appalling-doublestandard-behind-the-politicization-of-mass-shootings-n2552759", "downloaded_at": "2019-09-09 06:50:51.462269+00:00", "title": "The Appalling Double Standard Behind The Politicization Of Mass Shootings", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nWhen it comes to the politicization of mass shootings, the left’s double standard is mind boggling. One only need to look at leftist reaction to the El Paso and Dayton shootings last month, both of which took place within 13 hours of each other, to illustrate the point. Because the El Paso shooter was seemingly at least in part motivated by, as Ann Coulter brilliantly noted, the “vital importance of ethnic chauvinism and territorial sovereignty for your own ethnic group” displayed by many immigrant groups, supposed ‘white nationalism’ is now the greatest threat to America since Nazi armies were plundering Europe, or something.\n\nAs far as Dayton is concerned, why it’s another matter entirely. CNN and the mainstream media in general are careful to hold back, to not attribute a motivation behind a clearly left-wing shooter, and even tried to fact check Trump for using the same tactics they use when it’s a supposedly “right-wing” killer: “President Donald Trump on Wednesday suggested a left-wing political motivation behind the massacre in Dayton, Ohio, despite police statements that say there's a lack of a clear motive.”\n\nNote the oh so careful differentiation between the two shootings, lest readers get the impression that leftist ideology can motivate killers too: “In contrast, investigators say … the El Paso suspect, left behind a manifesto filled with white supremacist language and racist hatred aimed at immigrants and Latinos.”\n\nIndeed, the tactics media types generally use with criminals even tangentially aligned with right-wing extremism is shockingly deceptive. As I pointed out in this piece I wrote for The Federalist last month, a significant percentage of “extremist violence” examples are simply people, who at some point might have identified with a group or ideology the Southern Poverty Law Center considers extremist, committing a crime that, in many cases, had nothing whatsoever to do with said group or ideology. For example, Joshua Daniel Miller killed a man at his ex-wife’s house during an argument, but still managed to make the ADL’s “Murder and Extremism in the United States in 2018” list because he was “involved with militia and Three Percenter groups.”\n\nThe CNN article does acknowledge the truth about the Dayton shooter’s politics, that he “retweeted messages supporting Sens. Bernie Sanders and Elizabeth Warren, as well as extreme left-wing and anti-police posts, as well as tweets supporting Antifa, or anti-fascist, protesters.” And there were other red flags: The very day of the shooting, the murderer tweeted a post that said, “Millennials have a message for the Joe Biden generation: hurry up and die.” He also at some point wrote, “I want socialism, and I’ll not wait for the idiots to finally come round to understanding” and “This is America: Guns on every corner, guns in every house, no freedom but that to kill.” He once tweeted “Kill every fascist” in response to a story about Charlottesville in 2017.\n\nYet, to CNN, there was “no clear motive behind the attack,” and the killer’s writings “did not indicate any racial or political motive,” instead pointing to “an apparent fixation ... on violence and killing.” Since leftists consider leftism itself to be the very epitome of morality, something else, such as mental illness or another factor, must have caused the Dayton shooter’s killing spree.\n\nWhile I would call leftism as an ideology the exact opposite of any sort of objective morality, I would also agree that the Dayton shooter himself, not leftism, is to blame for his actions. The difference between my position and that of leftists, of course, is that I would use the same logic for the El Paso killings.\n\nNational Review’s Alexandra DeSanctis agrees: “None of this is to suggest that the shooter’s left-wing sympathies explicitly motivated his massacre, or that the trendy Twitter accounts he followed and the Democratic politicians he supported were in any way culpable for what he did. He was a madman, and only he is personally responsible for his decision to slaughter innocents.”\n\nDeSanctis calls “deeply grotesque” the “rush to attribute responsibility for mass atrocities to one’s political opponents.” But that’s exactly what leftist media and politicians do. Instead of blaming killings on the killers, they want to somehow get inside their heads – those of the ‘right’ kind of killers, of course –so they can go after some ideologies while leaving their own intact.\n\nCase in point: Notre Dame professor Ernesto Verdeja called the El Paso shooting a “political terror attack,” but labels attempts to draw similar conclusions about the Dayton shooting “disingenuous.”\n\n“There’s a kind of a false equivalence — that one killer is on the right, another killer is on the left, and that the problem is really hateful, divisive discourse from across the political spectrum,” Verdeja said, according to the Los Angeles Times. Then, predictably, Verdeja went on to blame Trump.\n\nIn truth, Elizabeth Warren is no more to blame for the Dayton shooter’s crimes than immigration hawks are responsible for the El Paso killer. To further illustrate the absurdity of the blame game as well as hate crime legislation in general (that’s a whole other column), the majority of the Dayton killer’s victims were actually African American. Would they be any more victimized had the killer engaged in some form of racial discrimination at some point in his life?\n\nShould we counter hateful ideologies on both the left and the right side of the political spectrum with facts, reason, and common sense? Of course. But the Orwellian road we seem to be traveling down, a Minority Report-style ‘precrime’ nightmare where authorities try to predict and even potentially punish crimes that haven’t even occurred, is one no freedom loving person wants to live in.", "description": "When it comes to the politicization of mass shootings, the .09/09/2019 2:49:49AM EST.", "authors": ["Scott Morefield", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/images/2019/216/4f78eff4-6f3b-4b6d-850e-2586f00d299a.jpg", "published_at": "2019-09-09"}