{"pub": "huffpost", "url": "https://huffpost.com/entry/kevin-bacon-kyra-sedgwick-style-marriage_l_5d9cfa53e4b06ddfc50ff0db", "downloaded_at": "2019-10-10 15:04:32.249147+00:00", "title": "Kevin Bacon And Kyra Sedgwick's Style Through The Years, In Photos", "language": "en", "text": "Over the course of Kevin Bacon and Kyra Sedgwick’s 31-year marriage, their style has changed but their red carpet chemistry has stayed red-hot.\n\nIn the late 1980s and early ’90s, you could often find the actor couple sporting boxy blazers and blue jeans — hey, it was on-trend at the time — at movie premieres and other Hollywood events. By the early 2000s, they started rocking more tailored dresses and suits that showed off their toned figures.\n\nBut the one constant is that they’ve never been able to keep their hands off each other. (Well, that and they’ve both always had enviable heads of hair.)\n\n“When he walks into a room, I’m still ― I mean, my heart gets a little fluttery and I think, ‘Oh! He’s so cute. He’s so hot.’ That’s literally the first thing I think,” Sedgwick told Redbook in 2012. “You can ask people on the set — it’s palpable. He’s still a mystery to me. And getting older together is scary and exciting.”\n\nThe couple met while filming the 1988 TV movie “Lemon Sky,” but actually crossed paths briefly a decade earlier. They married on Sept. 4, 1988 and went on to have two kids: a son, Travis, and a daughter, Sosie. Since then, Bacon and Sedgwick have been vocal about their lasting love and deep respect for each other.\n\n“Being with Kyra is so natural for me. It’s the easiest aspect of my life,” Bacon previously told Good Housekeeping. “I know that I don’t need a beach or room service to be happy.”\n\nBelow, check out the couple’s style evolution and some of their sweetest PDA moments:", "description": "The actor couple, who have been married 31 years, met while filming the 1988 TV movie “Lemon Sky.\"", "authors": ["Senior Reporter", "Huffpost Life"], "top_image": "https://img.huffingtonpost.com/asset/5d9cf86e2100003107ac755a.jpeg?cache=AEiAABlqi5&ops=1778_1000", "published_at": "2019-10-09"}