{"pub": "yahoo", "url": "https://news.yahoo.com/hong-kongs-metro-legislature-open-022103742.html", "downloaded_at": "2019-10-12 07:34:26.539362+00:00", "title": "Hundreds take to Hong Kong streets ahead of weekend protests", "language": "en", "text": "People march to protest against what they say is the abuse of pro-democracy protesters by Hong Kong police, at Chater Garden in Central district, Hong Kong\n\nBy Twinnie Siu and Jessie Pang\n\nHONG KONG (Reuters) - Hundreds of mask-wearing pro-democracy protesters marched through Hong Kong's central business district on Friday, occupying a main thoroughfare and disrupting traffic as the Chinese-ruled city braced for another weekend of unrest.\n\nChanting their core demands, which include universal suffrage and an independent inquiry into perceived police brutality, the crowd occupied the financial district at lunchtime before peacefully dispersing.\n\nHong Kong's metro operator opened all stations for the first time in a week ahead of more planned anti-government protests, while the city's legislature began its first session since protesters stormed the building in July.\n\nPro-establishment and democratic lawmakers shouted at each other before the session, underscoring the tension and divisions in Hong Kong after four months of often violent anti-China protests.\n\nSome lawmakers wore black masks as they sat in the chamber, while others carried placards reading: \"Police brutality still exists, how can we have a meeting?\"\n\nHong Kong leader Carrie Lam invoked British colonial-era emergency laws last Friday and banned the wearing of face masks which protesters have used to shield their identities.\n\nThe protests have plunged the city, an Asian financial hub, into its worst crisis since it returned to Chinese rule in 1997, posing the biggest popular challenge to Chinese President Xi Jinping since he came to power in 2012.\n\nWhat began as opposition to a now-withdrawn extradition bill has evolved into a pro-democracy movement fanned by fears that China is stifling Hong Kong's freedoms, guaranteed under a \"one country, two systems\" formula introduced in 1997.\n\nChina denies the accusations and says foreign countries, including Britain and the United States, are fomenting unrest.\n\nThe Chinese embassy in Bangkok on Friday condemned Thai politicians for showing support for Hong Kong activists.\n\n\"This is wrong and irresponsible. China hopes that relevant people will understand the truth about problems in Hong Kong, act carefully and do useful things for the friendship between China and Thailand,\" the embassy said in a statement.\n\nNinety people have been arrested for anti-mask law violations in the past week, pushing the total number of arrests since June to more than 2,300, police said on Friday. Many of those arrested are under 16, authorities said.\n\nPolice said they were investigating four reports of blackmail involving emails from a group claiming to be pro-democracy and threatening to target shops unless they fund protests via bitcoin.\n\n\"The intimidating messages even include videos of rioters inflicting extensive damage to shops over the past few weeks,\" said acting police chief superintendent Kong Wing-cheung.\n\nProtesters have targeted China banks and shops with links, or perceived links, to mainland China.\n\nMany residents fear the emergency laws may be expanded, further eroding civil liberties, but the government said on Thursday it would not bring in any other measures.\n\n\n\n\n\nTRANSPORT DISRUPTION\n\nHong Kong has been relatively calm for a few days after a street march by tens of thousands of people last Sunday spiraled into a night of violent clashes.\n\nSeveral protests are planned across the city on Friday night and through the weekend. While daytime marches have been large scale, most night protests are small scale and sporadic.\n\nMetro operator MTR Corp, whose network carries about 5 million passengers a day, said the MTR would shut two hours early at 10 p.m. (1400 GMT) on Friday to allow more repairs after stations were torched or trashed last weekend.\n\nThe MTR shut down completely last Friday following arson attacks and has operated only partially since then. Protesters have targeted the MTR because it has been blamed for closing stations at the government's behest to contain demonstrations.\n\nMany stores and businesses have shut early to avoid becoming targets, and due to metro closures, putting another burden on the city's faltering economy as it faces its first recession in a decade.\n\nSeveral major conferences and other events have been called, with the latest being an annual swimming race in the city's famed Victoria Harbour.\n\nThe protest movement still appears to have a broad base of support despite the violence and vandalism carried out by small groups of front-line protesters.", "description": "Chanting their core demands, which include universal suffrage and an independent inquiry into perceived police brutality, the crowd occupied the financial district at lunchtime before peacefully dispersing.  Hong Kong's metro operator opened all stations for the first time in a week ahead of more", "authors": ["Twinnie Siu", "Jessie Pang"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Z_TMBZGhZm_4wI_vrmy7Iw--~B/aD0zMDA7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/ea6f5ca7de95dc2e3f6df935567eef6e", "published_at": "2019-10-11"}