{"pub": "cryptonews", "url": "https://cryptonews.com/news/cryptojackers-having-a-field-day-in-south-korea-more-crypto-4767.htm", "downloaded_at": "2019-10-05 13:30:46.981933+00:00", "title": "Smart Contracts Legalized in Russia + 11 More Crypto News", "language": "en", "text": "Source: iStock/CGinspiration\n\nCrypto Briefs is your daily, bite-sized digest of cryptocurrency and blockchain-related news – investigating the stories flying under the radar of today’s crypto news.\n\nRegulation news\n\nSmart contracts have become legal in Russia as of today, reports Regnum. The new law – one of a package of three pertaining to blockchain technology, crowdfunding and cryptocurrencies – was passed earlier this year. Its sister bill, which will ultimately determine the future of cryptocurrencies in Russia, has been delayed by lawmakers with no sign of progress since the middle of last month.\n\nAlso in Russia, the deputy chairman of the Bank of Russia has dismissed cryptocurrencies as a “high-tech pyramid scheme.” Per RNS, the central bank’s Sergey Shvetsov stated,\n\n“We are not going to facilitate the acquisition of cryptocurrencies for Russian citizens – especially not for investment purposes.”\n\nCryptojacking in South Korea skyrocketed last year. Per SME Daily, figures from the government-run Korea Internet Security Agency show that cryptojacking rose from 26 reported cases in 2017 to 1,355 in 2018. Opposition politicians have called for the government to take “proactive” action after cryptojackers successfully installed mining programs on servers used by the Korea Institute of Geoscience and Mineral Resources, a government-funded research institute.\n\nCryptocurrency exchange news\n\nTaoTao , an affiliate of Yahoo Japan , will provide up to USD 9,240 in compensation to customers whose accounts are compromised by spoofing attacks – but only if users activate two-factor authentication. Per Crypto Watch, compensation will only be payable in cases whereby unauthorized withdrawals in Japanese yen are made to a bank account. Customers will also need to report unusual activities to both the police and TaoTao.\n\n, an affiliate of , will provide up to USD 9,240 in compensation to customers whose accounts are compromised by spoofing attacks – but only if users activate two-factor authentication. Per Crypto Watch, compensation will only be payable in cases whereby unauthorized withdrawals in Japanese yen are made to a bank account. Customers will also need to report unusual activities to both the police and TaoTao. And also in Japan, the self-regulating Japan Virtual Currency Exchange Association (JVCEA) has issued new initial exchange offering (IEO), initial coin offering (ICO) and token listings guidelines for its members. The JVCEA is a group that comprises all licensed Japanese exchanges, as well as a number of leading policymakers and legal experts. Per Fisco News (via Minbaku), exchanges have been instructed to conduct tests on token issuers’ financial status, as well as projects’ “sustainability and feasibility.”\n\n(JVCEA) has issued new initial exchange offering (IEO), initial coin offering (ICO) and token listings guidelines for its members. The JVCEA is a group that comprises all licensed Japanese exchanges, as well as a number of leading policymakers and legal experts. Per Fisco News (via Minbaku), exchanges have been instructed to conduct tests on token issuers’ financial status, as well as projects’ “sustainability and feasibility.” Bittrex announced a new platform based in Liechtenstein, called Bittrex Global, which will launch at the end of October and will work on developing new features and products, such as customer reward programs, mobile app for crypto trading, credit card interoperability, private token sales, etc.\n\nannounced a new platform based in Liechtenstein, called Bittrex Global, which will launch at the end of October and will work on developing new features and products, such as customer reward programs, mobile app for crypto trading, credit card interoperability, private token sales, etc. Binance announced the launch of a new market maker program. Their blog post states that users whose 30-day trading volumes exceed BTC 1,000 (USD 8.4 million) (or can achieve those volumes), and have quality market maker strategies, can immediately join the Market Maker Program, which also offer trading fee reductions and higher API limits.\n\nLibra news\n\nThe head of the Institute for International Monetary Affairs Hiroshi Watanabe has spoken about Facebook’s forthcoming Libra token. In an interview with Nikkei, Watanabe says that exact 1:1 pegging of fiat assets to tokens would be “inefficient,” and instead argued that the Libra operators should aim to underpin the token just below the 100% mark in order to maximize growth while keeping risk at a minimum.\n\nAdoption news\n\nThe Thai-based data oracle platform, Band Protocol , said it went live with a reportedly world’s first fully decentralized binary options trading application, BitSwing, for its mainnet launch, following its token sale on Binance Launchpad.\n\n, said it went live with a reportedly world’s first fully decentralized binary options trading application, BitSwing, for its mainnet launch, following its token sale on Binance Launchpad. Banking giant Santander is teaming up with Blockchain certification company Vottun to develop a complete and all-encompassing blockchain-powered digital payment system that will allow people in Madrid to use it crypto to pay for public transportation, according to Blockchain Economia.\n\nLegal News", "description": "Cryptojacking in South Korea skyrocketed last year. Per SME Daily, figures from the government-run Korea Internet Security Agency show that cryptojacking rose from 26 reported cases in 2017 to 1,355 in 2018. Opposition politicians have called for the government to take “proactive” action", "authors": ["Tim Alper", "Sead Fadilpašić"], "top_image": "https://cimg.co/w/articles/0/5d9/331697a23a.jpg", "published_at": "2019-10-01"}