{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/school-district-changes-lunch-debt-policy-after-9-yearold-has-meal-taken-away-on-his-birthday-because-he-owed-975-210525574.html", "downloaded_at": "2019-09-11 07:34:16.585449+00:00", "title": "9-year-old boy has hot lunch taken away on his birthday because he owed school $9.75", "language": "en", "text": "A school district in Ohio has changed their lunch policy after a student had his hot meal taken away over a $9.75 unpaid balance. According to the boy's grandmother, the incident occurred on his birthday, Aug. 30.\n\nOn that day, the staff at Green Primary School in Uniontown, Ohio took away 9-year-old Jefferson Sharpnack’s hot lunch and replaced it with a cheese sandwich, a side dish and a serving of milk because of his lunch debt, which totaled $9.75.\n\nThe young boy said that the incident left him \"a little hurt.\"\n\n\"I can't believe that it's cost-effective to throw away food and give them cheese and bread,\" Sharpnack's grandmother, Diane Bailey, who has temporary custody of Sharpnack and his brother, told WKYC. \"When he got off the bus, he said 'worst birthday ever.'\"\n\nBailey has enrolled Sharpnack in the free and reduced lunch program, according to Fox 8, and she was informed that she would be able to write a check for any unpaid balance that may occur while they waited for the paperwork to process. Now, she believes the school district bullied her grandson.\n\n\"He was bullied. He was bullied by the school officials. He had his lunch removed from his tray at the age of 9,\" she told the news station.\n\nAfter Bailey's story sparked concern on social media, other parents made claims that similar incidents have happened to their children at Green Local School District schools.\n\nThe district has responded by implementing an immediate district-wide change to their policy, shared on Facebook by Superintendent Jeff Miller.\n\n\"All students enrolled in PreK through 12th grades will receive the standard lunch for the day at their respective buildings regardless of their account balance,\" the statement read in part. \"We are sensitive to the financial hardship families incur and challenges presented due to the cost of school breakfast and lunches. Our staff, in coordination with Family Support Specialists, will continue to work with families to ensure they have access to all available resources to assist with purchasing school meals.\"\n\nRepresentatives for Green Local Schools did not immediately respond to Yahoo Lifestyle’s requests for comment.\n\nRead more from Yahoo Lifestyle:\n\nFollow us on Instagram, Facebook, Twitter and Pinterest for nonstop inspiration delivered fresh to your feed, every day.", "description": "A school district in Ohio has changed their lunch policy after a 9-year-old had his hot lunch taken away, on his birthday, due to owing just $9.75.", "authors": ["Hope Schreiber"], "top_image": "https://s.yimg.com/uu/api/res/1.2/_3eCkZkSs57BOut3_KzOlQ--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/video/wjw_cleveland_686/2fc4c4dd96ccad51858c91e42a92a423", "published_at": "2019-09-10"}