{"pub": "marketwatch", "url": "https://marketwatch.com/story/investors-are-pivoting-to-cash-thats-not-a-good-sign-2019-10-08", "downloaded_at": "2019-10-08 15:05:44.588568+00:00", "title": "Investors are loading up on cash. That’s not a good sign.", "language": "en", "text": "MarketWatch See if you can spot the moment when investors first lost faith in a China deal and started stockpiling cash.\n\nInvestors are moving more and more money to cash in a sign of mounting skepticism about the ability of financial markets and the economy to deliver more growth.\n\nAn analysis from research firm DataTrek, drawing on fund flow data from the Investment Company Institute, shows that there was $3.4 trillion in U.S. money market funds as of October 2. That’s about 14% higher than at the end of 2018, and has risen nearly every week since May.\n\n“What’s strange about this recent influx of capital is that short-term rates have been declining all year,” DataTrek founder Nicholas Colas wrote. Money market funds “are seeing strong inflows in 2019 even as 2-year yields have been cut in half,” he added.\n\nSee: This ETF became a ‘success story’ by offering a little yield in a falling-rate world\n\nWith so many hurdles for markets over the coming weeks, higher defensive positioning is more likely a red flag than a trading strategy, Colas noted.\n\n“Investors are cautious about longer-term financial assets, likely due to macro uncertainty,” he wrote. “Some market commentators are calling this ‘dry powder’ for a late-year market rally. Perhaps, but we’ll have to get through upcoming US-China trade talks and the Fed’s October 30 meeting first.”\n\nIndeed, May was when U.S.-China trade talks first hit the skids and the two countries started to slap tariffs on each other. And those aren’t the only headwinds facing markets. Consider: an increasingly chaotic Brexit situation, intensifying impeachment proceedings against President Trump, third-quarter U.S. corporate earnings likely to be lackluster, skirmishes in the Mideast, and on and on.\n\nRelated: All that glitters might be just what your portfolio needs now\n\nIf the big shift to cash isn’t enough of a signal, there are other signs investors are girding for a waning economic cycle, if not an outright downturn.\n\nReal estate, utilities, and consumer staples ETFs picked up the most money over the past month, Colas noted, gaining $1.4 billion, $755 million, and $472 million, respectively, while health care, industrials, and materials have been the biggest losers, with outflows of $1 billion, $496 million, and $434 million.\n\n“The sudden increase in money market fund assets this year bears watching since it is a sign of investor risk aversion,” Colas concluded.\n\nRelated: Here’s how to play the trade war with ETFs", "description": "Flows into money market funds have increased nearly every week since U.S.-China trade deals hit their first serious roadblock back in May, another sign of...", "authors": ["Andrea Riquier"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS837_DJIAYT_ZG_20191008092458.jpg", "published_at": "2019-10-08"}