{"pub": "chinadaily", "url": "https://language.chinadaily.com.cn/a/201910/11/WS5da00c50a310cf3e3556fef4.html", "downloaded_at": "2019-10-11 05:10:11.781395+00:00", "title": "《蜘蛛侠：英雄远征》电影精讲（视频）", "language": "en", "text": "影片简介：\n\n在复仇者联盟众英雄的努力下，于灭霸无限手套事件中化为灰烬的人们，重新回到了人世间，曾经消失的蜘蛛侠彼得·帕克也回归到了普通的生活之中。数月后，蜘蛛侠彼得·帕克所在的学校举行了欧洲旅游，帕克也在其中。\n\n在威尼斯旅行时，一个巨大无比的水怪袭击了威尼斯，蜘蛛侠幸得一位被称为“神秘客”的英雄相助才击退敌人。之后神盾局局长找上彼得·帕克并要求其加入神盾局，并安排神秘客协助帕克。神秘客自称来自其他宇宙，并告知一群名为元素众的邪恶势力已经入侵这个宇宙了。\n\n为了守护来之不易的和平，蜘蛛侠决定与神秘客联手。然而在神秘客那头罩之中，似乎隐藏着什么不为人知的真相……\n\n精彩词句学起来：\n\n1. I felt like I wasn't in the pocket. 我感觉我不是很在状态。\n\n2. You do not ghost Nick Fury. 你不能跟尼克·弗瑞玩消失。\n\n3. You handled yourself well out there today. 你今天的表现很出色。\n\n4. I am so sorry if I seem like I'm preoccupied with my relationship. 如果我让你觉得我只顾着自己恋爱，那很抱歉。\n\n5. We're all counting on you. 我们都指望你了。\n\n6. He felt bad about snapping at you. 他对冲你发脾气感到过意不去。\n\n7. You had access to killer drones? 你还能调用杀人无人机吗？\n\n8. Deep down, you know I'm right. 内心深处，你知道我是对的。\n\n9. You are so gullible. 你太好骗了。\n\n10. I mean, you're smart as a whip, just a...sucker. 虽然你很聪明，但是……太好骗了。\n\n11. But for what it's worth, Peter, I really am sorry. 但不管如何，彼得，我真的很抱歉。\n\n12. He second-guessed everything he did. 他总质疑自己做的一切。\n\n13. He was all over the place. 他心里乱得很。\n\n14. Has no one else here noticed how shady he is? 难道没有其他人注意到他多可疑吗？\n\n15. I bought us some time. 我为咱们争取到了时间。\n\n精彩片段对白：\n\nFURY: So is there anything you want to tell us about your girlfriend?\n\nHILL: He's talking about EDITH.\n\nPETER: Look, I know I made a mistake, I'm sorry, but he is not who you think he is. Beck is a liar. Mysterio, the Elementals, it's all fake. He has some illusion tech. That's how he tricked you guys, and tricked me into giving him EDITH. It's a projector. I pulled it off the fire monster in Prague.\n\nFURY: So all that death and destruction we witnessed was created by this?\n\nPETER: No, not just this. I think he's using drones.\n\nFURY: Well, if this is true, then Beck's very dangerous and we need to be smart. Who else did you tell about this? Parker? Parker!\n\nHILL: What's wrong?\n\nPETER: It's Beck. He's here.\n\nFURY: What? Hill?\n\nPETER: No, it's just an illu... Fury! Unh. Aah! [COUGHS]\n\nBECK: Wow, Peter, wow.\n\n[PETER COUGHING]\n\nBECK: I thought we were close. Fury always had to die, but not you.\n\nPETER: Stop hiding, Beck!\n\nBECK: I tried to help you walk away. Now you're making me do this. [ECHOING] You told me, you were just a kid. You told me, you wanted to run after that girl.\n\nMJ: Help me!\n\nPETER: MJ! Oh, God!\n\nMJ: Peter, what's going on?\n\nPETER: I know this isn't real.\n\nBECK: Do you, though?\n\n[MJ GASPING]\n\nPETER: MJ!\n\n[MJ SCREAMING]\n\nPETER: MJ!\n\n[PETER GROANS]\n\nBECK: I don't think you know what's real, Peter. [ECHOING]\n\nPETER: Whoa! Whoa! [YELLING]\n\nBECK: You need to wake up!\n\n[PETER GROANING]\n\n[PETER PANTING]\n\nBECK: I mean, look at yourself.\n\n[PETER GRUNTING]\n\nBECK: You are just a scared little kid in a sweat suit. I created Mysterio to give the world someone to believe in. I control the truth. Mysterio is the truth.\n\n[PETER SCREAMS]\n\nBECK: If you were good enough, maybe Tony would still be alive.\n\n[PETER YELLING]\n\nBECK: Deep down, you know I'm right.\n\n[CLANGS]\n\n[PETER GRUNTS]\n\nBECK: You made your choice. And all you had to do was step aside. And now you have...\n\n[GUNSHOT]\n\n[BECK GASPING]\n\n[SIRENS WAILING]\n\nPETER: Fury. Unh.\n\nFURY: Beck's people are trying to find everyone who could expose him. Who'd you tell?\n\nPETER: Um...\n\nFURY: I know you told someone...\n\nPETER: Um...\n\nFURY: ...so just tell me.\n\nPETER: Okay.\n\nFURY: Who did you tell? Who else did you tell?\n\nPETER: Just Ned and MJ from my class. Maybe Ned told his girlfriend Betty, but that's it.\n\n[FURY LAUGHING]\n\nPETER: What?\n\nFURY: You are so gullible.\n\nPETER: What?\n\nFURY: You're smart as a whip. Just a...sucker. (TURNING INTO BECK) And now all your friends have to die.\n\nPETER: Oh, my God. [GASPING]\n\nBECK: It's easy to fool people when they're already fooling themselves. But for what it's worth, Peter, I really am sorry.\n\n[PETER GASPS]\n\nBECK: EDITH.\n\nEDITH: Yes, Quentin.\n\nBECK: Access files to Peter Parker's class trip. I need them to fly home from London.\n\n[PETER GRUNTING]\n\n[PETER PANTING]\n\n[PETER COUGHING]\n\n（中国日报网英语点津 陈丹妮 编辑）", "description": "重生的蜘蛛侠彼得·帕克和同学一起去欧洲旅游，在威尼斯遇到了巨大水怪和英雄“神秘客”。蜘蛛侠决定和神秘客联手守护和平，但没想到的是……", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/11/5da00c50a310cf3e97a0a4cb.jpeg", "published_at": "2019-10-11"}