{"pub": "thehill", "url": "https://thehill.com/policy/energy-environment/466885-epa-touts-great-lakes-funding-after-trump-tried-to-axe-the-program", "downloaded_at": "2019-10-22 16:04:10.229271+00:00", "title": "EPA touts Great lakes funding after Trump tried to axe the program", "language": "en", "text": "The Environmental Protection Agency (EPA) announced Tuesday it would send millions of dollars to the Great Lakes area for cleanup projects, a renewed pledge by the Trump administration after repeated attempts to scuttle funding for the region.\n\nEPA Administrator Andrew Wheeler Andrew WheelerOvernight Energy: Dems subpoena Perry in impeachment inquiry | EPA to overhaul rules on lead contamination tests | Commerce staff wrote statement rebuking weather service for contradicting Trump Hundreds of former EPA officials call for House probe, say agency's focus on California is politicized EPA to overhaul rule on testing for lead contamination MORE made the announcement outside Detroit, securing $11 million in grants over for the Great Lakes Restoration Initiative, an effort to boost the water quality of lakes that serve as a water source for more than 48 million people in the U.S. and Canada.\n\n“The Trump Administration is taking action to improve water quality while boosting local economies across the country,” Wheeler said in a press release. “The grant funding we are announcing today will continue to accelerate this great work to the benefit of millions of Americans living in and visiting the region.”\n\nThose funds will help battle invasive Asian carp, harmful algal blooms, a restore habitat that can help clean water.\n\nBut the visit rubbed some Democrats the wrong way, particularly after the Trump administration has pulled back such funding before as well as pushed for development of a factory many feared would drain the lakes and pollute the resource.\n\nEach year in office, Trump has tried to eliminate or dramatically cut funding to the Great Lakes. This year, the budget proposed to cut last year’s $300 million in funding to the Great Lakes by 90 percent.\n\n“Actions speak louder than words. Sadly, Administrator Wheeler is trying to mask the Trump Administration’s terrible environmental record,” Rep. Dan Kildee Daniel (Dan) Timothy KildeeHow Trump and Pelosi went from bad to worse Inspector general to review DOD's use of PFAS Working Families Tax Relief Act would help millions join middle class MORE (D-Mich.) said in a statement. “It takes a lot of nerve to fly into Michigan and celebrate Great Lakes programs that the Trump Administration previously tried to eliminate.”\n\nTrump has previously boasted that he would get full funding for the project.\n\n\"I support the Great Lakes. Always have. They're beautiful. They're big. Very deep. Record deepness,” Trump said during a rally in Grand Rapids, Mich., in March.\n\n“And I'm going to get, in honor of my friends, full funding of $300 million for the Great Lakes Restoration Initiative,” he continued.\n\nTrump was also personally involved in efforts to bring a Foxconn plant to Wisconsin that would manufacture LCD screens, a process that requires large volumes of pristine water. The project secured a major tax break from the state despite complaints that the project could violate EPA standards by exacerbating smog. Critics also said environmental assessment overlooked water rights issues that limit how towns just outside of the basin access the lakes.\n\nTuesday’s announcement followed the EPA’s latest lead policy proposal, another key issue for the region.\n\nThe proposal changes testing requirements for lead and speeds up notification for those who may have lead in their drinking water, but could slow the replacement of the lead pipes that connect homes to city services.", "description": "The Environmental Protection Agency (EPA) announced Tuesday it would send millions of dollars to the Great Lakes area for cleanup projects, a renewed pledge by the Trump administration after repeated attempts to scuttle funding for the region.", "authors": [], "top_image": "https://thehill.com/sites/default/files/article_images/greatlakes_getty.jpg", "published_at": "2019-10-22"}