{"pub": "yahoo", "url": "https://sg.news.yahoo.com/top-mexican-broadcasters-feel-pinch-024024629.html", "downloaded_at": "2019-10-25 03:31:22.597151+00:00", "title": "Top Mexican broadcasters feel the pinch from fewer government ads", "language": "en", "text": "FILE PHOTO: Logo of broadcaster Televisa is pictured at its offices in Ciudad Juarez\n\nBy Noe Torres\n\nMEXICO CITY (Reuters) - Revenue from government-sponsored publicity campaigns in Mexico has continued slide for the country's top two television broadcasters, part of President Andres Manuel Lopez Obrador's austerity push.\n\nGovernment ad spending on the country's most-watched television channels has fallen for four consecutive quarters.\n\nTelevisa, Mexico's largest broadcaster, reported on Thursday that advertising sales in the third quarter fell by more than 5% to total 4.8 billion pesos ($243 million), compared to the same period last year, and pointed to government spending cuts as the main culprit.\n\n\"The decrease is mainly explained by lower publicity spending from the government,\" the company said in its quarterly earnings report.\n\nAdvertising sales make up about one-sixth of Televisa's consolidated sales, which overall grew by about 3% in the July-to-September period to reach some 25.8 billion pesos ($1.3 billion).\n\nTV Azteca, Mexico's No. 2 broadcaster, announced in its third quarter filing on Thursday that advertising revenue fell 14% during the three month period to total nearly 2.8 billion pesos ($140 million).\n\nIn his first year in office, the leftist Lopez Obrador has pushed for across-the-board budget cuts as part of a broad austerity plan, but he has also authorized more spending for his priorities including state-owned oil company Pemex and a range of social programs.\n\nFrom the start of this year through August, the Lopez Obrador government has spent not quite 4% of what the previous administration led by President Enrique Pena Nieto authorized on publicity campaigns during the same eight-month period in 2018, according to government data.\n\n\n\n\n\n(Reporting by Noe Torres; Writing by David Alire Garcia)", "description": "Revenue from government-sponsored publicity campaigns in Mexico has continued slide for the country's top two television broadcasters, part of President Andres Manuel Lopez Obrador's austerity push.  Government ad spending on the country's most-watched television channels has fallen for four", "authors": ["Noe Torres"], "top_image": "https://s.yimg.com/uu/api/res/1.2/zS_qooovCPg4P72Liekkeg--~B/aD01Mjk7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/reuters.com/e64e636da297f2ca889787c94a8e1263", "published_at": "2019-10-25"}