{"pub": "investing.com", "url": "https://investing.com/news/stock-market-news/rbs-investors-call-on-new-boss-rose-to-shrink-natwest-markets-1993386", "downloaded_at": "2019-10-08 14:59:36.433718+00:00", "title": "RBS investors call on new boss Rose to shrink NatWest Markets", "language": "en", "text": "By Sinead Cruise, Simon Jessop and Lawrence White\n\nLONDON (Reuters) - With weeks to go until Alison Rose takes over as CEO of Royal Bank of Scotland (L: ), shareholders are demanding a shake-up of the state-backed lender, with cuts to its minnow investment bank topping their agenda.\n\nRose's predecessor Ross McEwan said NatWest Markets was worth keeping for its ability to supply foreign exchange, financing and hedging to the bank's corporate clients but with profits dwindling, investors say it is ripe for cuts.\n\nRBS's investment bank once spanned the globe with assets greater than Britain's GDP, but it also made catastrophic market bets that led to a 45 billion pound ($55 billion) taxpayer bailout during the 2007-2008 financial crisis.\n\nIts business is now largely confined to bond trading and earns around a 1% return on equity.\n\nThe debate over RBS's investment bank comes at a time when rival Barclays (L: ) faces pressure from activist investor Edward Bramson to scale back its own trading business.\n\nFive investors told Reuters that Rose should consider shrinking NatWest Markets further as part of her bigger vision for RBS, which should also include detailed plans to tackle the threat from digital banks like Revolut.\n\n\"The big thing for me is they should look again at whether it is really worth persisting with NatWest Markets at this scale,\" said a top-10 investor at the bank who said he knows other shareholders who feel the same way.\n\nNatWest Markets tied up around 35 billion pounds or 18.5% of the bank's assets while contributing just 11% of profits in the first half of the year, said Barrington Pitt-Miller, portfolio manager at Janus Henderson Investors, which has a small holding in the bank's shares.\n\nIts 1% return on equity in the first half is below the bank's cost of capital, and with financial markets torpid in Europe and client trading subdued, there is little chance of squeezing out more profits.\n\n\"For a shareholder, purely staring at balance sheet intensity and returns, it is optically a poor business,\" Pitt-Miller said.\n\nThe difference now versus previous calls to scale back the investment bank is that RBS has sufficient capital buffers to absorb the losses crystallized by cutting it back, he said.\n\nDescribing NatWest Markets as one of RBS's two \"problem children\", together with Ulster Bank, a second major shareholder said Rose needed to decide if it was possible to improve NatWest Markets' returns \"in a meaningful way ... inside the next 3-5 years\".\n\n\"These consume 22% and 8% of the group's capital and basically make no money,\" the shareholder said.\n\n\" ( ) are clearly doing okay at taking costs out but the revenue environment is tough and volatile. We know how hard Barclays struggles to get a decent return out of their investment bank, and that is clearly a better business than NatWest Markets,\" the first top-10 investor said.\n\nFUTURE IN BALANCE\n\nSenior RBS executives agree decisions on the future for NatWest Markets will likely be taken in the coming months, with Rose broadly expected to lay out her strategy for the bank as a whole when full-year results are published in February.\n\nThe business is in the third year of a four-year turnaround, Chief Financial Officer Katie Murray told investors at a conference in September, and at the end of this restructuring its return on equity will be between 5-6%.\n\n\"It's not the endgame for where NatWest Markets will need to be,\" Murray said, while pointing out the value of the investment bank to business clients and the importance of continuity of service.\n\n\"We'll talk more and see over the coming months what the next stage looks like for NatWest Markets.\"", "description": "RBS investors call on new boss Rose to shrink NatWest Markets", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF9711X_L.jpg", "published_at": "2019-10-08"}