{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7621647/Manchester-United-fans-arrested-Spain-drunken-rampage-charged-face-prison.html", "downloaded_at": "2019-10-28 13:36:32.840930+00:00", "title": "Manchester United fans arrested in Spain over a drunken rampage are charged and could face prison", "language": "en", "text": "Five Manchester United fans arrested over a drunken rampage in Spain last year have been charged and warned they face a one-year prison sentence if found guilty.\n\nThe Brits were held on arrest warrants at Alicante Airport in July as they reached the Costa Blanca on a flight from Manchester.\n\nA court in Seville issued the warrants after they failed to attend a court summons to be tried over damage they allegedly committed in February 2018 in Seville when United played a Champions League tie in the city.\n\nFive Manchester United fans were taken into custody after returning to Spain for a holiday 18 months after allegedly causing damage to the city of Seville after a Champions League game\n\nToday it emerged state prosecutors are demanding one-year jail sentences for the Brits, aged 29 to 31, if they are convicted at trial.\n\nAll have been charged with assaulting police, four with an additional minor wounding charge and one with a charge of minor criminal damage. They have not been publicly named.\n\nA three-page state prosecution indictment outlines how police approached the suspects just after midnight on February 23 last year when they were outside Hotel Inglaterra in Seville - which translates as England Hotel - and began to shout and hit the wall of the hotel with a stone.\n\nIt says: 'The men failed to heed the officers' orders and hindered them from doing their jobs before turning on them by pushing and hitting them.\n\n'The National Police officers were helped by other Local Police officers who were in the area and tried to arrest them but the five suspects fled and one jumped on the Local Police car, breaking its front windscreen.\n\n'The police managed to arrest all but one of the suspects at the scene despite them resisting and kicking and punching the officers. The fifth man, the one who had jumped on the police car, was arrested as he tried to enter the place where he was staying.'\n\nOne of five Manchester United fans being arrested at Alicante Airport over a drunken rampage in Seville last February\n\nA 39-year-old Local Police officer was left with a scar on the back of his hand as a result of the injuries he suffered, the indictment states.\n\nAs well as a one-year prison sentence, state prosecutors also want all five men fined 500 euros, and the four arrested at the scene ordered to pay the injured officer 1,800 euros in compensation.\n\nNo date for the trial, which will take place in Seville, has yet been set. Prison sentences of two years or less are normally suspended in Spain for first-time offenders.\n\nA spokesman for the investigating judge said today the suspects remained on bail.\n\nA spokesman for Spain's National Police said after they were re-arrested in July: 'National Police have arrested five British men at Alicante-Elche Airport after they arrived on a flight from Manchester.\n\nThen-Manchester United manager Jose Mourinho talks to Paul Pogba during the 0-0 Champions League match against Sevilla at Estadio Ramon Sanchez Pizjuan in February 2018\n\n'There was a warrant out for their arrests, which had been issued by a court in Seville after they failed to turn up for a trial after they were accused of public disorder offences, criminal damage and assaulting police which they allegedly committed in Seville in February last year.\n\n'The five men were arrested during the early hours of February 23 in the city.\n\n'The suspects were accused of throwing stones against the front of a hotel causing damage to it.\n\n'Before being arrested they allegedly pushed a number of motorbikes parked in the vicinity to the ground.\n\n'After a chase on foot through the streets of Seville, police managed to arrest them.\n\n'When they were arrested they resisted and damaged a police vehicle.\n\n'A court in Seville issued arrest warrants at the start of June ordering police to detain the five suspects.\n\n'They were held as they touched down on Spanish soil and have been handed over to the judiciary so the courts can decide the next move.'\n\nThe violence in Seville happened on the same night a police officer was killed during ugly clashes in Bilbao between Athletic Bilbao and Spartak Moscow fans ahead of their Europa League tie.\n\nThe officer, thought to have died following a heart attack, was named at the time as father-of-two Inocencio Arias Garcia.\n\nMan U drew their Champions League away tie against Seville in February last year 0-0.\n\nThe men who were arrested had stayed on in the Spanish city following the Feb 21 game.", "description": "The five British fans, aged 29 and 31, were held on arrest warrants at Alicante Airport in July when they returned to Spain for a holiday. State prosecutors are demanding one-year sentences for the fans.", "authors": ["Gerard Couzens For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/11/16764972-0-Five_Manchester_United_fans_were_taken_into_custody_after_return-a-4_1572263710613.jpg", "published_at": "2019-10-28"}