{"pub": "zdnet", "url": "https://www.zdnet.com/article/college-students-may-be-building-the-armys-next-uav", "downloaded_at": "2019-09-11 13:59:52.099290+00:00", "title": "College students may be building the army's next UAV", "language": "en", "text": "A contest to design next-generation drones for combat and defense will soon be underway. The participants? College students at U.S. institutions of higher education.\n\nThe contest is called the FirePoint C3 Challenge, and it's being administered by the FirePoint Innovations Center at Wichita State University, a collaboration between that school and the U.S. Army's Combat Capabilities Development Command, Aviation and Missile Center (CCDC AvMC).\n\nThe challenge, which will be open to university students around the U.S., asks teams to submit a design proposal for a specific component within a UAV subsystem—lift, energy, or structure. Up to 10 teams will then be selected to develop a proof of concept and finally collaborate to design and fabricate an integrated working prototype for final presentation to the Army, which will happen in February 2021. The final reports and demonstration will be presented to the U.S. Department of Defense, along with other industry experts in aerospace, aviation and manufacturing.\n\n\"Our mission with C3 is twofold. First, our primary directive is to develop the next generation of engineers and innovators to fuel the Army's talent pipeline, and there's no better way to do that than by exposing students to the technologies, techniques and career opportunities available,\" said Steve Cyrus, Manager of Technology Collaborations with FirePoint. \"Second, by building partnerships between the U.S. Army and universities across the country, we hope to bring some of the best university technology to market where it can support both U.S. military and American manufacturing superiority.\"\n\nDassault Systemes is a technology partner on the challenge and will give teams access to its 3D modeling platform. The winning team gets $35,000. It's a small pot by defense industry standards, but the real value to aspiring engineers might be the career boost.\n\n\"This is a unique and exciting opportunity for aspiring engineers and innovators to work with some of the most advanced tools and design and manufacturing techniques employed in industry and see firsthand how modern engineering problem-solving happens on a global scale,\" Cyrus said. \"The learnings and networking opportunities will be valuable as participating C3 students move forward into their career-building process.\"\n\nThe defense industry has long funded university research through IP acquisitions. Contests directly soliciting technology ideas from undergraduate students are far less common.", "description": "The defense sector has long used university brainpower. Now the next generation of combat UAVs is being sourced from campus brainiacs.", "authors": ["Greg Nichols"], "top_image": "https://zdnet3.cbsistatic.com/hub/i/r/2019/09/10/20e35f30-292b-46da-b351-f272a77390aa/thumbnail/770x578/a1073267e8f6c8219a5c9d8b4b440df0/uav.jpg", "published_at": "2019-09-11"}