{"pub": "guardian", "url": "https://theguardian.com/uk-news/2019/oct/24/essex-lorry-deaths-39-victims-were-chinese-nationals", "downloaded_at": "2019-10-24 13:54:47.088261+00:00", "title": "Essex lorry deaths: all 39 victims were Chinese nationals", "language": "en", "text": "Police say 31 men and eight women were found, as extra time secured to detain man held on suspicion of murder\n\nThe 39 people found dead in a lorry trailer in Essex were Chinese nationals, police have confirmed, as they secured extra time to hold a Northern Irish man on suspicion of murder.\n\nThe victims, discovered in a refrigerated trailer in Grays on Wednesday, were eight women and 31 men, Essex police added.\n\nIn a statement, the Chinese embassy in London said: “We read with a heavy heart the reports about the death of 39 people in Essex, England. We are in close contact with the British police to seek clarification and confirmation of the relevant reports.”\n\n‘It could have been me’: refugees describe their journeys to the UK Read more\n\nThe trailer had arrived in the UK from Zeebrugge early on Wednesday morning. Belgian authorities released details about the trailer’s journey as UK police pressed ahead with a murder investigation.\n\nEssex police secured a warrant of further detention from magistrates at Basildon for a 25-year-old man from Northern Ireland, named as Mo Robinson. Robinson was arrested on suspicion of murder and will remain in custody for up to an additional 24 hours.\n\nThe lorry was parked on Eastern Avenue shortly after it arrived as an unaccompanied trailer at Purfleet docks, just a few minutes’ drive away.\n\nOn Thursday Essex police officers continued to search the scene at the industrial estate where the lorry was parked before being removed on Wednesday evening. The road remains cordoned off, and officers could be seen conducting fingertip searches of the road behind a tall green plastic screen.\n\nThe Belgian federal prosecutor, Eric Van Duyse, announced on Thursday he had opened an inquiry into the deaths of the 39 people, to focus on all parties involved in the transport.\n\nHe told local media: “Up till now, we have a lot of questions and not a lot of answers. We don’t even know which road was followed by the truck in Belgium. We don’t know how much time it stayed in Belgian territory.\n\n“We don’t know if it stopped or not. We don’t know if the people got into the container or not. So, we have a lot of questions that we are hoping to find [answers to].”\n\nThe prosecutor said preliminary investigations showed the container had arrived in the Belgian port of Zeebrugge on Tuesday at 2.49pm local time (1.49pm BST) and left the same day, arriving at Purfleet in Essex at 1am on Wednesday morning.\n\nAmbulance workers alerted police to the discovery of the bodies at 1.40am on Wednesday.\n\nFacebook Twitter Pinterest Shipping containers at the port of Zeebrugge in Belgium. Photograph: Gareth Fuller/PA\n\nBelgian investigators said it was not yet clear when the victims were placed in the container and whether that happened in Belgium. Media reports suggested they could have frozen to death in the refrigerator unit in temperatures as low as -25C (-13F).\n\nThe chief executive of Zeebrugge port, Joachim Coens, said it was unlikely that people had been loaded into the container at Zeebrugge. “A refrigerated container in the port zone is completely sealed,” he told the Flemish TV channel VRT. “During the check, the seal is examined, as is the licence plate. The driver is checked by cameras.” The cargo can only be loaded on to a ferry once these checks have taken place.\n\nLorry horror highlights risks migrants take to try to reach UK Read more\n\nThe mayor of Bruges, Dirk De fauw, echoed this message in an interview on VRT, saying that trailers were filmed until their arrival on the ferry. “[To] break the seal, bring 39 people onboard and apply a new seal without being noticed, that chance is extremely small,” he said.\n\nPolice searched two addresses in Northern Ireland on Wednesday night that were believed to be linked to the arrest of the driver, named locally as 25-year-old Mo Robinson, from Portadown. He was being held and questioned on suspicion of murder by Essex police.\n\nThere have been increasing numbers of migrants seeking to travel to the UK from northern Belgium, after French authorities tightened controls at Calais.\n\nCoens said in 2017 that the rising numbers were “a big concern” that had led to the port becoming a closed site a decade earlier.\n\nBritish authorities have also issued repeated warnings of the rising threat of people-smuggling via Belgium in the past three years. Border Force officials highlighted Zeebrugge as a key embarkation point for migrants seeking to enter the UK in a 2016 threat assessment.\n\nFacebook Twitter Pinterest The container lorry leaves Waterglade industrial park in Grays as it is moved to Tilbury. Photograph: Stefan Rousseau/PA\n\nIn the same year the National Crime Agency (NCA) said the “highest priority” organised immigration crime threat was clandestine activity using roll-on, roll-off lorries and containers. The NCA said organised crime groups “often use seaports away from the migrant camps”. It highlighted that improved port controls at Calais and Coquelles in France meant the activity of such groups was displaced to other locations on the continent. Warnings were also made three years ago about smuggling gangs turning to less busy UK ports such as Purfleet.\n\nIn April 2016 the NCA said criminal networks were suspected to have started targeting quieter ports on the east and south coasts as well as the main Channel crossing between Calais and Dover. The NCA launched the largest dedicated operation against organised immigration crime in Europe.\n\nAt the time, Tom Dowdall, the deputy director of the NCA’s border policing command, said: “We’ve seen on the east coast evidence from Tilbury and Purfleet, up as far as Hull and Immingham. And on the south coast from Newhaven to Portsmouth.”\n\nRichard Burnett, the chief executive of the Road Haulage Association, suggested “robust” security checks at Calais and Coquelles were having a knock-on affect in other areas.\n\nHe told BBC Breakfast: “That kind of pushes the problem further out to more remote ports, and if we haven’t got the infrastructure in place there from a security perspective to check those vehicles then traffickers will definitely use those routes to try and get migrants into the UK.”\n\nAn inspection report of Border Force operations in east coast seaports in 2016 warned of the dangers of people being trapped inside lorry containers. It said: “Groups in unaccompanied, sealed containers are likely to have been placed there by organised people-smugglers. Since they are unable to release themselves, the risks are high and there have been numerous recorded deaths.”\n\nThe report included an example from August 2014 when 35 people, including 12 children, were discovered “screaming and banging” in a locked container being unloaded at Tilbury off a ship from Zeebrugge.\n\nThose inside the container had to be treated for severe dehydration and hypothermia, with one man pronounced dead at the scene and four others taken to hospital.\n\nIn subsequent years the NCA has repeatedly highlighted the risks of people-smuggling from the continent, including from Belgium. Its serious and organised crime assessment in 2017 said crime groups based in Belgium would have “an increasing impact” after the clearance of the migrant camp in Calais.\n\nIn the same report last year, the NCA said: “People-smugglers continue to favour hard-sided refrigerated lorries to transport migrants to the UK.\n\n“Belgium has become a location of greater focus for the activities of organised people-smugglers in the past year where smugglers of various nationalities operate.\n\n“The number of smugglers located there increased after the closure of the migrant camp at Dunkirk in March 2017.”", "description": "Police say 31 men and eight women were found, as extra time secured to detain man held on suspicion of murder", "authors": ["Jennifer Rankin", "Jamie Grierson", "Esther Addley"], "top_image": "https://i.guim.co.uk/img/media/ba9b7bec4b4b400a34b9f5bbe63195ce2dbfd20e/0_98_3308_1985/master/3308.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e6bf568cc5fbcba7e8405de91c06efe8", "published_at": "2019-10-24"}