{"pub": "news24", "url": "https://sport24.co.za/Rugby/Springboks/sports-minister-etzebeth-innocent-until-proven-guilty-20191011", "downloaded_at": "2019-10-12 06:52:32.532445+00:00", "title": "Sports Minister: Etzebeth innocent until proven guilty", "language": "en", "text": "Cape Town - Sports Minister Nathi Mthethwa has finally broken his silence over the Eben Etzebeth saga.\n\nThe Springbok lock, together with a group of friends, were accused of assault and racial abuse in the early hours of the morning at a restaurant in Langebaan in the Western Cape last month.\n\nThe South African Human Rights Commission is part of the ongoing investigation.\n\nSpringbok coach Rassie Erasmus has said that there is no place for racial abuse and any player in his squad found guilty will incur the full wrath of the law, but he back his players' version of events until proven otherwise.\n\nMthethwa, who was speaking at the announcement of the nominees for the South African Sports Awards on Friday, reiterated that Etzebeth is innocent until proven guilty.\n\n\"Our jurisprudence states that any person is innocent until proven otherwise by a court of law,\" he said.\n\n\"It cuts across everybody in society and we have full confidence in our criminal justice system that justice is going to be done in this matter.\n\n\"Let me say it categorically that we are not going to tolerate any racism whenever it manifests itself. If this process finds him to have violated human rights‚ he will have to face the music.\n\n\"We have given the space to the rugby leadership to speak to the coach and he did say that if it is found that any of his players are on the wrong side of race relations in this country‚ steps will have to be taken. It cuts across and that is the position of government.\"\n\nMthethwa added that despite the impending investigation, Mzansi needs to unite behind the Springboks.\n\n\"We will be watching and the team must be supported 100 percent because they are not representing an individual but the whole country,\" continued Mthethwa.\n\n\"They are hoisting the flag of SA high‚ so all South Africans must be behind the team to win.\"\n\nDespite the cloud hanging over his head, Etzebeth is likely to start for the Boks in their quarter-final clash next Sunday, October 20.\n\n", "description": "Sports Minister Nathi Mthethwa has finally broken his silence over the Eben Etzebeth saga.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9466/09d445b42ea34204a180f5f453cd784d.jpg", "published_at": "2019-10-11"}