{"pub": "mirror", "url": "https://mirror.co.uk/3am/style/shopping/fashion-editor-picks-top-5-20545126", "downloaded_at": "2019-10-09 18:33:58.210620+00:00", "title": "Our fashion editor picks her top 5 buys from the Per Una at M&S autumn collection", "language": "en", "text": "Get the biggest money stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nIf like us you are a regular M&S shopper then you'll probably be familiar with, or have seen the Per Una sub-brand dotted around in stores.\n\nThe signature florals, cable knits and cord separates are regular style hits with the more mature customer, and those who prefer a more laid back, country casual vibe.\n\nBut we've got to be honest, the Per Una rails are not always the first we desire to rummage through.\n\nWell until now that is...\n\nM&S latest A/W19 campaign for Per Una has literally changed the opinions of the fashion desk overnight.\n\nNot only has the campaign been stunningly shot in a British countryside setting, the brand has been given a contemporary refresh -and it's seriously pulling at our purse strings.\n\nQuality and attention to detail is key in this collection with carefully crafted prints, cosy knitwear and checked outerwear taking centre stage.\n\nThis might be a Per Una range that has been kicked up style a notch, but the brand have cleverly kept their brand identity intact so it will still appeal to their loyal customers, whilst bring in a new younger audience.\n\nOther key players include the silky co-ordinating set which can be playfully mixed and match within the collection to create numerous outfits.\n\nAnd if this wasn't enough, we promise you'll fall in love with the luxe olive green suit which is simply perfect for the upcoming party season.\n\nWell M&S you've done it again, we are adding these Per Una items to our shopping baskets pronto ...\n\nFASHION EDITOR'S 5 KEY PICKS\n\nIf you love a smock dress, this one ticks all the boxes and looks great layered with a polo neck.\n\nMixing textures is key to nailing casual chic. We'll be wearing this cable knits with the silky floral skirt.\n\nA midi is a must have for the autumn season- wear this skirt anywhere and everywhere.\n\nDon't be afraid to play with your prints. Pair this pyjama shirt with the skirt above for a cool clash that'll earn you extra style points.\n\nThanks to Per Una the wax jacket is has been made cool again, team with your off duty denims and a chunky knit. Trainers are optional.", "description": "Per Una has just had a gorgeous revamp for autumn and we're confident you'll want it all. Shop it online now...", "authors": ["Lauren Goodwin-Grafton"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20546306.ece/ALTERNATES/s1200/473_SHOT1A_032_F3.jpg", "published_at": "2019-10-09"}