{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7594567/How-one-woman-saved-3-749-bills-one-afternoon-phone-calls.html", "downloaded_at": "2019-10-21 01:36:34.546192+00:00", "title": "How one woman saved $3,749 on her bills - and it will only take you one afternoon of phone calls", "language": "en", "text": "A busy mum has revealed how she saved $3,749 on her bills in one afternoon simply by picking up the telephone.\n\nLeanne Blank, who works as an information technology consultant, was so annoyed at being ripped off despite being a loyal customer.\n\nThe woman from Sydney's inner-west, who lives with her 20-year-old son, decided to shop around for better deals.\n\nDuring a 'quiet afternoon' she spent two hours dialling rival car and private health insurers, along with other phone, electricity and gas providers after being unhappy with how much she was being charged.\n\nMs Blank was able to slash her bills by either switching provider or negotiating a better deal with her existing one.\n\nA mother who runs her own business has revealed how she saved $3,749 on her bills in one afternoon simply by picking up the telephone. Leanne Blank, a busy information technology consultant, was so annoyed at being ripped off despite being a loyal customer\n\nWhat Leanne saved PRIVATE HEALTH INSURANCE: $610 (switched) HOME AND CONTENTS INSURANCE: $1,595 (switched) CAR INSURANCE: $778 (switched) MOBILE PHONES (2): $333 (switched) GAS AND ELECTRICITY: $433 (stayed and negotiated) TOTAL: $3,749\n\nIn one afternoon she saved $3,749 on all her annual bills, including $610 a year on private health insurance, $1,595 on home and contents insurance, $778 on car insurance and $333 on two mobile phones.\n\n'Don't give up - its a competitive market and you just need to ask for a better deal,' she told Daily Mail Australia.\n\n'It was a quiet afternoon so I thought I'd test it out and I was really surprised how easy it was to save money and get additional benefits like a $100 gift card.'\n\nWhen her private health insurer refused to reduce the premiums, she switched.\n\nShe did the same with her home and car insurance and her mobile phone company.\n\nUtility companies were also reluctant to cut their charges when she complained.\n\nHer gas company, however, matched a rival offer after a bit of haggling.\n\n'The hardest by far was utilities - power and gas,' Ms Blank said.\n\nMs Blank found electricity and gas providers were 'the hardest by far' to negotiate a better deal\n\nThe trick for her was to compare itemised charges with other providers by having all the paperwork at hand.\n\n'Firstly even understanding how to compare your bill is a chore - just stay with it - it's usually on the last page,' she said.\n\n'Then call your provider and tell them exactly what you are doing and what is their best offer.\n\n'After that tell them you are shopping around and will call back if you don't find a better offer then theirs - usually, you are then put on hold and they go off and get approval from their supervisor for a better offer rather than let you off the phone.'\n\nMs Blank said the experience showed some insurers and utility providers didn't value customer loyalty.\n\n'It's disappointing that loyalty isn't rewarded by companies proactively reaching out and saying, \"Hey we have a better deal for you\",' she said.\n\nMs Blank's successful battle against excessive bills inspired the book Kill Bills, by consumer group One Big Switch's campaign director Joel Gibson (pictured)\n\n'I'd be happy if they did that to give them say another 12 to 24 months business but really I haven't seen this happen in a very long time.'\n\nMs Blank's successful battle against excessive bills inspired the newly published book Kill Bills, by consumer group One Big Switch's campaign director Joel Gibson.\n\nThe businesswoman likened dialling up with insurers and utility providers with bargaining for a lower price at a fashion store.\n\n'Just ask and you'll be surprised - I do that in retail shops even when they aren't having a sale and often you find there are discounts to be had,' she said.\n\nKill Bills is published for Simon&Schuster", "description": "Leanne Blank (pictured) was so annoyed at being ripped off by exorbitant bills she spent two hours on the phone. In one afternoon, she was able to save $3,749 a year on her costs of living.", "authors": ["Stephen Johnson For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/00/19969260-0-image-a-2_1571612446930.jpg", "published_at": "2019-10-21"}