{"pub": "businessinsider", "url": "https://businessinsider.com/california-bill-to-treat-contract-workers-as-employees-2019-9", "downloaded_at": "2019-09-11 07:26:10.136716+00:00", "title": "California passes landmark bill to treat contract workers as employees in a move that could devastate Uber and Lyft's business model", "language": "en", "text": "California on Tuesday approved a landmark bill that would reclassify contractors for companies like Uber and Lyft as employees.\n\nThe Assembly Bill 5 passed in a 29 to 11 vote in the State Senate, according to The New York Times, and it would apply to companies that use apps to manage their goods and services. It now heads to the State Assembly for passage before it's signed into law, and could land on Gov. Gavin Newsom's desk before the Legislature goes into recess on September 13.\n\nNewsom has indicated support for the move and said tech companies and other employers are eroding worker's basic protections like \"minimum wage, paid sick days, and health insurance benefits.\"\n\n\"Working people have lost their bargaining power,\" he wrote in an op-ed piece published on Labor Day in the Sacramento Bee.\n\n\"Employers shirk responsibility to safety net programs like workers' compensation and unemployment insurance. Taxpayers are left to foot the bill.\"\n\nThe landmark move will likely affect over 1 million workers in California.\n\nRead more: Uber and Lyft drivers explain why they are striking\n\nAccording to Business Insider's Transportation Reporter Graham Rapier, the move could put in place a three-part test which would determine a worker's status as an employee or independent contractor, paving the way for workers to receive fair wages and company support.\n\nCalifornia Assemblywoman Lorena Gonzalez, who proposed the bill in 2018, said on Twitter that the move would \"stop the misclassification of nearly a million\" California workers so that they would be entitled to employment benefits.\n\nThe bill's passage comes after years of debate on how to better manage a gig-based economy as people begin to shift their employment towards contract work.\n\nSeveral companies that rely on contract workers, like Uber, Lyft, and delivery service DoorDash, have pledged $30 million for a ballot initiative to exempt themselves from the law, the New York Times reported last month.\n\nGonzalez has said she does not predict a successful compromise with the companies.\n\n\"Just pay your damn workers!\" she wrote on Twitter on Thursday.\n\nLyft and Uber did not immediately respond to a request for comment from Business Insider.", "description": "The bill passed in a 29 to 11 vote in the State Senate and would apply to companies that use apps to manage their goods and services.", "authors": ["Rosie Perper"], "top_image": "https://amp.businessinsider.com/images/5d5704cbcd978423d17144d2-2732-1366.jpg", "published_at": "2019-09-11"}