{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/buthelezi-to-remain-parliamentary-leader-in-ifp-leadership-split-report-20190630", "downloaded_at": "2019-10-05 11:47:41.279142+00:00", "title": "Buthelezi to remain parliamentary leader in IFP leadership split - report", "language": "en", "text": "Long-serving Inkatha Freedom Party leader Mangosuthu Buthelezi is set to remain a central figure in the party once stepping down from the highest office in the IFP.\n\nButhelezi looks set to remain the party's parliamentary leader from August, iOL reported on Sunday.\n\nIFP General-Secretary Velenkosini Hlabisa, who is tipped to suceed Buthelezi as president, told the publication whoever is elected leader will work closely with Buthelezi.\n\nEarlier this year, Buthelezi indicated he would be stepping down as leader. He said he should not have been the face of the party's election campaign, but he was compelled to do so by the party's structures and to ensure his legacy was not destroyed.\n\nREAD: 'I'd rather be a small party than a party that uses poor people's money' - IFP's Buthelezi\n\nHowever, he was persuaded to stay on by the party's branches national spokesperson Mkhuleko Hlengwa said in May, soon after the announcement of the general election results.\n\nAt the time Buthelezi was quoted as saying: \"I have very publicly and clearly indicated what will happen, when it will happen and how it will happen. So, there is no surprise whatsoever that I am returning to Cape Town next week to be sworn in as a member of Parliament.\"\n\nThe IFP is enjoying a resurgence, growing its national support in the May 8 polls, reclaiming the official opposition mantle from the DA in KwaZulu-Natal and Hlengwa being appointed the head of the powerful Standing Committee on Public Accounts in Parliament.\n\nHlabisa said there would be \"no conflict\" between Buthelezi and the new IFP leader.\n\n\"If eventually it becomes what has been designated by the party (that) I am in KwaZulu-Natal as the leader of the official opposition while his excellency is in Cape Town. If he is no longer the president there will be no problem at all,\" he was quoted as saying.", "description": "Mangosuthu Buthelezi is set to be replaced as IFP leader at the party's upcoming national conference.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8747/e36f22535ac8474fa7e167c627691bf9.jpg", "published_at": "2019-06-30"}