{"pub": "abcnews", "url": "https://abcnews.go.com/Health/study-reveals-shrinking-black-white-cancer-mortality-gap/story?id=65716646", "downloaded_at": "2019-09-20 12:55:41.129351+00:00", "title": "New study reveals what's behind the shrinking black-white cancer mortality gap", "language": "en", "text": "It's been a topic addressed by Democratic presidential candidates Senators Elizabeth Warren, Kamala Harris and Cory Booker: racial disparities in health care. A new study reveals that in at least one area of health, that disparity is starting to change.\n\nInterested in Cancer Treatments? Add Cancer Treatments as an interest to stay up to date on the latest Cancer Treatments news, video, and analysis from ABC News. Add Interest\n\nThe disparity in cancer mortality rates between black and white Americans shrunk significantly in recent decades, according to a new report published by the American Association for Cancer Research.\n\nThe report, which utilized data from an American Cancer Society study published in February, found that in 1990, the cancer death rate was 47% higher for African American men than it was for white men. By 2016, however, that gap had shrunk to 19%. For women, the black-white cancer death gap shrunk from 19% in 1990 to 13% in 2016.\n\nCarol DeSantis, lead study author and cancer epidemiologist at the ACS, chalked the shrinking mortality disparity up to plummeting death rates for African Americans with lung, prostate and colorectal cancers, which are the three most common forms of the disease.\n\nDeclining lung cancer deaths mirror smoking patterns, DeSantis explained, noting that \"smoking prevalence has also decreased faster in blacks than whites.\"\n\nBrent Lewis/Denver Post via Getty Images, FILE\n\nThe shrinking disparity is \"exciting,\" said Dr. Joseph Ravenell, an associate professor of population health at NYU Langone. Ravenell was not involved with the study or the report.\n\nUIG via Getty Images, FILE\n\n\"The closing of the gap speaks not only to better therapies for treating cancer, but it is also the result of better access to these therapies and advances for groups who often have worse outcomes from cancer, including black patients, and patients who are uninsured or under-insured,\" he said.\n\nEfforts at targeted screening and detection likely played a part in identifying and treating cancer early, thus improving health outcomes for black Americans over time, Ravenell added.\n\nDaniel Linhart/The Virginian-Pilot via AP, FILE\n\nStill, African Americans have \"higher death rates than all other groups for many, although not all, cancer types,\" according to the National Cancer Institute. Roughly 73,000 black Americans are expected to die from cancer this year alone, according to the ACS study.\n\nThe black-white cancer mortality disparity is a relatively new phenomenon. As DeSantis and her coauthors detail in their study, death rates were lower among black Americans than among white Americans until the early 1950s. That changed because while white Americans had access to health insurance, early cancer screenings and treatment, many black Americans did not, and in the decades that followed, the African American cancer death rate continued to rise, until peaking around 1990.\n\nRavenell pointed to colorectal cancer mortality as an example, which fell for black men during the course of the study. Despite those gains, \"black men still have the highest incidence and mortality from colorectal cancer, in large part due to lower rates of timely screening in black men compared to white men,\" he explained.", "description": "While unequal health care and health outcomes remain a pressing concern for black Americans, in at least one area of health, that’s starting to change.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/black-women-cancer-ap-jc-190919_hpMain_16x9_992.jpg", "published_at": "2019-09-20"}