{"pub": "fox", "url": "https://foxnews.com/us/justice-department-taco-bell-franchise-owner-settlement", "downloaded_at": "2019-10-18 01:11:32.122960+00:00", "title": "DOJ settles with Texas-based Taco Bell franchises in immigration-related discrimination case", "language": "en", "text": "The Justice Department (DOJ) announced Thursday that it has reached a settlement with two Texas-based companies that own and operate several dozen Taco Bell franchises over immigration-related discrimination.\n\nThe DOJ said San Antonio-based MUY Brands LLC, which owns and operates some 78 Taco Bell restaurants in six states, and management company MUY Consulting Inc. required specific work documents from lawful permanent residents, or \"green card\" holders, who worked at their franchises. But it didn't impose the same requirements on employees who are U.S. citizens.\n\n\"As a result, some lawful permanent residents lost work opportunities, even though they had presented sufficient documentation to prove their authorization to work,\" the DOJ said.\n\nTACO BELL CUSTOMERS FILE SUIT, CLAIMING OVERCHARGE FOR CHALUPAS\n\nThe companies will pay a $175,000 penalty and create a $50,000 back-pay fund for those employees affected by discrimination. The companies will also be subject to DOJ monitoring and reporting, and some employees will be required to attend anti-discrimination training, the department said.\n\n\"Federal law allows all work-authorized individuals, regardless of citizenship status, to choose which valid, legally acceptable documents to present to demonstrate their ability to work in the United States,\" the DOJ said. Employers can't legally request additional or different documents to prove work authorization because of an employee's national origin or citizenship status, an action prohibited by the Immigration and Nationality Act's anti-discrimination provision, Assistant Attorney General Eric Dreiband said.\n\n“The Civil Rights Division is committed to enforcing the Immigration and Nationality Act and rooting out unlawful discrimination in the employment eligibility verification process to help ensure equal employment opportunities,\" Dreiband said.\n\nCLICK HERE TO GET THE FOX NEWS APP", "description": "The Justice Department (DOJ) has reached a settlement with two Texas-based companies that own and operate several dozen Taco Bell franchises over immigration-related discrimination, it announced Thursday.", "authors": ["Melissa Leon", "Melissa Leon Is A Reporter For Foxnews.Com. She Can Be Found On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/07/0ec4551d-Taco-Bell-sign.jpg", "published_at": "2019-10-17"}