{"pub": "businessinsider", "url": "https://businessinsider.com/snapback-to-higher-bond-yields-at-least-five-years-strategists-say-2019-9", "downloaded_at": "2019-09-30 05:29:47.402969+00:00", "title": "Snapback to higher bond yields? At least five years, strategists say", "language": "en", "text": "FILE PHOTO: Traders work on the floor at the NYSE in New York Reuters\n\nBy Hari Kishan\n\nBENGALURU (Reuters) - A return to significantly higher yields will take longer than previously thought, according to a Reuters poll of fixed-income strategists who slashed their year-ahead major government bond yield forecasts to the lowest since polling began 17 years ago.\n\nWith no resolution in sight to the U.S.-China trade war, the current modest global economic expansion cycle has taken a hit, prompting major central banks to shift to policy easing this year from a tightening view at the turn of last year.\n\nThat has not only pushed benchmark sovereign bonds yields to new lows this year, but has also resulted in over $17 trillion - a record amount - of debt securities pushed into the negative yields territory.\n\nAnd according to the Sept. 19-27 poll of over 100 strategists, that trend of subdued yields is here to stay.\n\nAbout 70% of strategists who answered an additional question said the era of low interest rates and sovereign bond yields will last at least another five years, compared to two years predicted just three months ago.\n\nRoughly the same proportion of respondents also said the risk to major sovereign bond yields are tilted toward further declines rather than rises for the remainder of this year.\n\n\"It is very difficult to imagine a situation where you get a significant upward move in yields. There is clearly a political element at work and then there is policy easing from central banks, which together are anchoring yields lower,\" said Beata Caranci, chief economist at TD Bank, referring to the U.S.-China trade war.\n\n\"While you can certainly get the risk premium priced-out on the political side, the economic and international side will continue to weigh.\"\n\nBond strategists have not only been wrong-footed for several years in predicting significantly higher yields, which have not materialized, their predictions last year for where major government bond yields would be at now were also well off the mark.\n\nThe U.S. 10-year Treasury is currently yielding 1.7%, almost half of the 3.3% strategists had penciled in a year ago for where it would be around now.\n\nU.S. 10-year Treasury yields have collapsed nearly 100 basis points this year and are about 35 basis points away from re-testing a lifetime low, despite the world's largest economy currently in its longest-ever expansion cycle.\n\n\"There are good odds by the end of next year that we break through the all-time low in U.S. 10 year Treasury yields which is roughly around 1.35%,\" said Guy LeBas, chief fixed income strategist at Janney Montgomery Scott.\n\nWhile strategists have cut their 10-year U.S. Treasury yield forecast to the lowest since polling began 17 years ago, it was about 10 basis points higher from here.\n\nThe latest consensus showed the 10-year U.S. Treasury note is forecast to yield 1.8% in a year, just a touch above the current consumer inflation rate of 1.7%, suggesting almost no return for locking in investment for a decade.\n\nAfter the Federal Reserve cut interest rates by 25 basis points in July for the first time in a decade and following up with a similar move this month, the two-year Treasury yield has fallen over 80 basis points.\n\nThe two-year Treasury note - sensitive to short-term interest rate expectations - is forecast to yield 1.55% in a year from about 1.66% currently.\n\nWhile that suggests a widening of the two- and 10-year part of the U.S. yield curve, it is reflecting one more Fed rate cut rather than a significant re-steepening of the curve.\n\nCurrently, the U.S. 2-10 yield curve is about 5 basis points away from an inversion, a market event which has preceded almost all U.S. recessions since World War Two.\n\nWhen asked how many more rate cuts it would take to re-steepen the yield curve significantly, the top pick was for one full percentage point cut in the fed funds rate, a move not currently priced in by the rate futures market or economists.\n\n\"Our broad scenario envisages a recession in the U.S. next year. The thinking is: the risk management approach of the Fed is insufficient to prevent that recession from taking place,\" said Elwin de Groot, head of macro strategy at Rabobank.\n\n\"Although the Fed has cut rates already and we expect one more in the near-term, it will not be sufficient. So eventually the Fed will need to cut rates further almost all the way back to zero.\"\n\n(Polling by Sarmista Sen and Richa Rebello; Editing by Ross Finley and William Maclean)", "description": "BENGALURU (Reuters) - A return to significantly higher yields will take longer than previously thought, according to a Reuters poll of fixed-income strategists who slashed their year-ahead major government bond yield forecasts to the lowest since polling began 17 years ago.", "authors": ["Hari Kishan"], "top_image": "https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png", "published_at": "2019-09-29"}