{"pub": "theverge", "url": "https://theverge.com/2019/8/27/20833761/nasa-iss-international-space-station-alleged-crime-anne-mcclain-jurisdicition-framework", "downloaded_at": "2019-10-05 14:50:47.775423+00:00", "title": "The first alleged crime committed in space raises questions about jurisdiction in orbit", "language": "en", "text": "NASA is currently investigating what could be considered the first crime perpetrated in space, after one of the agency’s astronauts was accused of illegally accessing her wife’s bank account during her stay on the International Space Station. Investigators have yet to decide if the event actually constitutes a crime, but this case does raise questions about how we should handle criminal activity in space in the future.\n\nFor the last 50 years, the majority of people who have flown to space have been representatives of their nations’ governments, such as NASA astronauts or Russian cosmonauts. Typically, these space-bound crew members have exhibited model behavior while in space, without any major conflicts in orbit. Their destinations have also been government-controlled facilities, some of which have fairly clear rules about how to handle any type of criminal behavior if it should arise.\n\nBut nation states no longer have sole sovereignty over space. Some private companies are actively working to send paying tourists to space, either for a few brief minutes to experience weightlessness or to stay long-term in hotel habitats. As space opens up to a wider array of people, the behaviors that occur here on Earth are bound to occur above Earth, too. “The things humans do don’t stop when we get into orbit,” Michelle Hanlon, the associate director for the air and space law program at the University of Mississippi, tells The Verge.\n\n“The things humans do don’t stop when we get into orbit.”\n\nRight now, there isn’t a detailed framework for how to handle criminal disputes that occur in space on commercial vehicles, especially if issues arise between individuals from separate nations. “As more private actors are starting to enter space, and as we see them staying for any kind of duration on a commercial space station, then we’re going to have to look at how we address criminal jurisdiction for even petty crime,” Jessica Sweeney Noble, a space lawyer for Nanoracks, tells The Verge.\n\nThe current case that NASA is investigating should not create any legal headaches. Summer Worden accused her estranged wife, NASA astronaut Anne McClain, of accessing Worden’s bank account without permission from the ISS, where McClain was living for six months, according to a report in The New York Times. McClain claims that it was a routine occurrence, to make sure that the couple had enough money to pay their bills. The legal dispute is still murky, and seems to be wrapped up in a deeply personal separation that McClain didn’t want disclosed to the media. But it seems fairly clear which type of law will be used to oversee this issue. “Besides the fact that this happened to happen while she was in space, this is an entirely US issue, covered entirely by US law,” says Hanlon.\n\nThe International Space Station is governed by an international treaty called the Intergovernmental Agreement (IGA) on Space Station Cooperation. The document does include a small section on criminal jurisdiction. It states very clearly that each country involved in the ISS has criminal jurisdiction over their own personnel in space, as long as they do not affect someone from another country. Both McClain and Worden are US citizens, which makes it clear that American laws would apply here.\n\nThings would have been hairier, though, if this complaint had been lodged by an international partner aboard the ISS. If a dispute arises in orbit between two members of differing countries, the two governments would have to consult with one another and figure out which type of law to use. But there is a time limit on how long the countries can bicker over jurisdiction. If they can’t come to an agreement after three months, the government of the alleged victim is granted jurisdiction if the alleged perpetrator refuses to cooperate with the negotiations.\n\nwhat would the protocol be if this were an incident on a commercial space station?\n\nBut what would the protocol be if this were an incident on a commercial space station? That’s when the law starts to get more complicated. The US’s legal obligations for space are all laid out in a document called the Outer Space Treaty, a more than 50-year-old agreement between 109 nations that sets up guidelines for how to explore space peacefully. The treaty is very clear that governments are responsible for what their commercial companies and private entities do in space. The document notes that each nation has “jurisdiction and control” over any registered object launched into space, as well as any personnel. That means the US has jurisdiction over anything US tourists do in space.\n\nIn order to meet its treaty obligations, the United States came up with a special provision of the US Code to address matters of criminal conduct that might arise in space, as well as other dubious areas. Known as the “special maritime and territorial jurisdiction of the United States,” it covers how to handle criminal complaints outside of any nation’s jurisdiction. If a US national were to, say, assault someone on a commercial space station, then this special type of jurisdiction would kick in.\n\nHowever, this special maritime law mostly covers more heinous crimes, such as “murder, manslaughter, maiming, kidnapping, rape, assault, and robbery,” according to the Justice Department. For lesser offenses, such as hacking or identity theft, it’s unclear exactly if this would apply. The law also becomes murkier if there is an incident that involves multiple people from multiple nations. For instance, if someone from the US gets hurt on a private Japanese space hotel, along with other passengers from Spain and Singapore, it’s unclear exactly how to proceed. But because of the Outer Space Treaty, a lot of governments might need to get involved. “All of the sudden you have all these nations involved, because it all rises immediately to the national level under our current outer space law,” says Hanlon.\n\nThat’s why Hanlon says it’s time for the international community to come together to discuss how to handle these cases that might arise on commercial space stations and spacecraft. She argues that private companies that plan to carry people to space need to have contracts with very specific provisions detailing what law will apply when there is criminal behavior, negligence, and more. That way companies have a plan in place to ensure all countries are adhering to the Outer Space Treaty if there is some kind of allegation. “Having a framework based on sovereign activities doesn’t make sense,” says Hanlon. “And we can’t keep going back to diplomatic and sovereign solutions to what are very everyday human issues.”\n\n“We really have the opportunity to do this right.”\n\nThe IGA could be a good model to work from, says Hanlon, and perhaps the United Nations could come up with some sort of resolution that deals with this issue specifically. And now might be the best time for it, since ambitious space projects are on their way. Companies like Bigelow Aerospace, Sierra Nevada Corporation, Lockheed Martin, Axiom, and more have developed concepts for space habitats that could potentially be used for tourism. SpaceX has proposed sending people around the Moon and to the lunar surface to start a base. It’s unclear how long it will take for these concepts to develop, but they may be closer than we think.\n\n“People sort of think the concept of a human community off this Earth is hundreds and hundreds of years away. And it’s really not,” says Hanlon, who added: “We really have the opportunity to do this right, and to promote peace through individual behavior.”", "description": "NASA is currently investigating what could be considered the first crime perpetrated in space. Investigators have yet to decide if the event actually constitutes a crime, but this case does raise questions about how we should handle criminal activity in space in the future.", "authors": ["Loren Grush", "Aug"], "top_image": "https://cdn.vox-cdn.com/thumbor/22qQwisYC4TYdzsDFE1d7O4M4F8=/0x433:6048x3599/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19123259/iss056e201248.jpg", "published_at": "2019-08-27"}