{"pub": "fox", "url": "https://foxbusiness.com/business-leaders/billionaire-carl-icahn-moving-hedge-fund-to-miami-report", "downloaded_at": "2019-09-13 07:53:10.602622+00:00", "title": "Billionaire Carl Icahn moving hedge fund to Miami: Report", "language": "en", "text": "Billionaire activist investor Carl Icahn is moving to Florida, and his employees can take a payout to relocate or apply for unemployment.\n\nContinue Reading Below\n\nIcahn wrote a letter to his staff in May inviting them to make the move as he moves the Icahn Enterprises’ offices from New York City and White Plains to Miami next year, the New York Post reported.\n\nAny employees who make the move will earn at least as much in salary and bonuses next year as they did in 2018, and anyone who gets fired before the end of March 2023 will get a payout for the same amount, according to the report. They’ll also get a $50,000 “relocation benefit” after making the move.\n\nFor employees who want to remain in New York, Icahn wrote that the company “will not contest your unemployment claim,” according to the report. But those employees can expect to make a maximum of $11,700 over 26 weeks -- far less than current earnings.\n\nIcahn reportedly wrote in the letter that moving to Florida was “not an easy decision to make.”\n\nAdvertisement\n\n“After spending my entire career in New York, while I certainly do not wish to retire, I’ve decided that at this point in my life I’d like to enjoy a warmer climate and a more casual pace year-round,” the Post quoted from his letter.\n\nAerial twilight in Brickell Miami\n\nFlorida has a reputation as a popular place to move for aging Americans, but it’s seen a boom in population thanks to President Trump’s 2017 Tax Cuts and Jobs Act.\n\nSomeone earning $650,000 can save more than $69,000 in taxes per year by moving from New York to Florida, FOX Business previously reported. For someone like Icahn, whose net worth is $17.6 billion according to Forbes, those savings could really add up.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "Billionaire activist investor Carl Icahn is moving to Florida, and his employees can take a payout to relocate or apply for unemployment.", "authors": ["James Leggate"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/10/0/0/GettyImages-480950076.jpg?ve=1&tl=1", "published_at": "2019-09-12"}