{"pub": "foxnews", "url": "https://foxnews.com/food-drink/chick-fil-a-toronto-opening-protesters", "downloaded_at": "2019-09-07 02:21:46.342177+00:00", "title": "Chick-fil-A's Toronto opening stormed by protesters: 'Cluck off'", "language": "en", "text": "The grand opening of Chick-fil-A’s first international location in Toronto was met by a grand protest Friday by LGBTQ activists, who argued that the chicken-centric chain owner’s historically antigay policies will clash with the culture of Canada's largest city.\n\nProtestors caused a commotion as soon as the restaurant opened its doors at 10:30 a.m., chanting “shame” and “cluck you,” CBC News reports.\n\n\"Hey hey, ho ho, Homophobia's got to go,” activists can be heard shouting in video shared to Twitter by BlogTo.\n\nCelebrity drag queen RuPaul's likeness was used by protestors picketing for the cause.\n\nCHICK-FIL-A MAKES 500 SANDWICHES FOR FIRST RESPONDERS AFTER TEXAS SHOOTING SPREE\n\n\"We won't allow hateful rhetoric to be here,\" Justin Khan of local LGBTQ organization The 519 told CBC. \"The fact that Chick-fil-A is opening on the streets of Toronto is something that is quite alarming.\"\n\nFounded in 1967, the biblical values of Chick-fil-A’s management strategy have long stirred controversy. Company chairman and CEO Dan Cathy has voiced his opposition to same-sex marriage, but Chick-fil-A says it doesn't have a political or social agenda. The company says that in 2017, it donated $1.6 million to the Fellowship of Christian Athletes, a group that is overtly against gay marriage, for sports camps for inner-city youth. It also donated $150,000 to the Salvation Army, which has also been accused of discrimination.\n\nThat same year, the chain asked its franchisees to not make public statements on political issues.\n\nThough most activists took issue with the chain’s reported anti-LGBTQ-stance at the Friday event, others called out the chain’s alleged treatment of animals. Some staged a “die-in” to honor chickens slaughtered by the business, as per BlogTo.\n\nDespite the commotion, franchise owner Wilson Yang remains hopeful about Chick-fil-A’s future in the city.\n\n\"We respect people's right to share their opinions and want all Torontonians to know they are welcome at Chick-fil-A Yonge & Bloor,” he said in a statement shared with CBC. “Our focus is on offering a welcoming and respectful environment for our guests and team members, and we encourage people to give us a try.\"\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\nFans of the fried chicken chain, meanwhile, were said to have lined up as early as 6:30 a.m. to await the grand opening, CTV News Toronto reports.\n\n“We’re excited to see many guests already in line this morning in anticipation of opening our doors,” a restaurant spokesperson said.\n\nReps for Chick-fil-A were not immediately available to offer further comment on news of the protests.\n\nLast year, news of the chain’s northern expansion to Toronto caused controversy on Twitter, with social media users promising that they would protest and boycott any Canadian branches of the chain.\n\nThe Atlanta-based eatery plans to open 15 more restaurants over the next five years in the greater Toronto area – though it remains unclear just how warmly the restaurant will be welcomed, as Toronto has previously been named the third most LGBT-friendly city in the world.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe company previously opened a location at the Calgary International Airport that has since closed, but the company says the Toronto location is the first franchised restaurant in Canada. The company says the restaurant will be closed on Sundays, in line with its policy for U.S. restaurants.\n\nAccording to a news release, the chain reported over $10 billion in revenue in 2018.\n\nThe Associated Press contributed to this report.", "description": "It was a grand opening with a grand protest.", "authors": ["Janine Puhak", "Janine Puhak Is An Editor For Fox News Lifestyle. Follow Her On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/chick-fil-a-protest-1-the519.jpg", "published_at": "2019-09-06"}