{"pub": "metro", "url": "https://metro.co.uk/2019/10/22/watch-prince-harry-meghan-markles-tv-interview-itv-documentary-african-journey-10961647", "downloaded_at": "2019-10-23 08:56:37.948162+00:00", "title": "How to watch Harry and Meghan's TV documentary An African Journey", "language": "en", "text": "Prince Harry, Duke of Sussex and Meghan, Duchess of Sussex both give open and honest interviews in the ITV documentary (Picture: Chris Jackson/Getty Images)\n\nPrince Harry and Meghan Markle, the Duke and Duchess of Sussex, recently returned from a whirlwind royal tour in South Africa that saw them visit charities, organisations striving for change and even have tea with renowned anti-apartheid campaigner Archbishop Desmond Tutu.\n\nDuring their time abroad, ITV News at Ten anchor Tom Bradby and has team were granted exclusive access to the royal couple to not only document their tour about also interview Harry and Meghan.\n\nWhile the focus of the documentary was meant to follow the royal couple’s work in South Africa, the spotlight has inevitably fallen on the revelations that Harry and Meghan made in interviews with Tom about the struggles they are enduring behind-the-scenes.\n\nMeghan made comments about struggling as a new mum under intense public and media scrutiny, whilst also revealing that her British friends warned her not to marry Prince Harry because of the attention she would suffer at the hands of the tabloid press.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nPrince Harry meanwhile alluded to a rift between himself and his brother Prince William, as well as communicating his fury at the media scrutiny of his wife and addressing the parallels between Meghan’s contestant criticism and the way his mother, Princess Diana, was treated by the press.\n\nAdvertisement\n\nAdvertisement\n\nHow to watch Harry & Meghan: An African Journey online\n\nAlthough Harry & Meghan: An African Journey aired on ITV on Sunday evening, there’s still a chance to watch the documentary online for those who missed it on TV.\n\nThe 60 minute documentary is available to watch online on the ITV Hub. Viewers can stream the programme through ITV’s online platform for another 28 days before it becomes unavailable.\n\nOnly those in the UK can watch shows through the ITV hub.\n\nMORE: Meghan and Harry ‘plan six week break’ after emotionally opening up on struggles\n\nMORE: What is the concept of ubuntu which Meghan Markle and Prince Harry said they were moved by?", "description": "You can still watch An African Journey, even if you missed it on TV, and see Tom Bradby's searingly honest interviews with Harry and Meghan.", "authors": ["Rachael Martin"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1173693693_1571740131.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-22"}