{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/4/no-14-iowa-no-19-michigan-aim-to-end-drought-in-bi", "downloaded_at": "2019-10-04 07:41:44.045375+00:00", "title": "No. 14 Iowa, No. 19 Michigan aim to end drought in Big Ten", "language": "en", "text": "ANN ARBOR, Mich. (AP) - No. 14 Iowa and No. 19 Michigan have at least one thing in common, failing to finish first since the schools shared the Big Ten title in 2004.\n\nIowa is in its longest conference championship drought since going two-plus decades between the titles won by the Forest Evashevski-led team in 1960 and coach Hayden Fry’s first of three conference championships in 1981.\n\nMichigan, meanwhile, is in its longest skid without a conference title in program history.\n\nThe Big Ten will not be won when the two teams meet Saturday at the Big House, but a loss certainly won’t help their chances.\n\nHere are some things to watch when the Hawkeyes (4-0, 1-0 Big Ten) and Wolverines (3-1, 1-1) meet in a possibly pivotal game:\n\nSTANLEY’S TIME\n\nIowa’s Nate Stanley might be one of the best quarterbacks under the radar. Stanley has yet to throw an interception in 2019, attempting 136 passes without getting picked off since last season. He has thrown eight touchdown passes this season and 60 in his career, putting him two touchdown passes shy of passing Drew Tate for second on Iowa’s all-time list behind 1985 Heisman runner-up Chuck Long. Stanley, who is 21-9 as a starter for the Hawkeyes, is averaging 241 yards passing per a game.\n\nThe senior is looking forward to his first and only visit to the Big House.\n\n“Obviously, it’s a great environment, one of the historic venues in college football,” he said. “It should be a great opportunity to play in a special environment.”\n\nLIMITING THE LOAD\n\nMichigan running back Zach Charbonnet has carried the ball a total of seven times since he was handed the ball 33 times in a double-overtime win over Army. The freshman standout is sharing time in the backfield with Christian Turner, Hassan Haskins and Tru Wilson.\n\nHarbaugh acknowledged he’s trying to limit the number of times Charbonnet carries the ball, saying 33 times is too many in one game.\n\n“Occasionally, that may occur,” Harbaugh said. “Not something I think you want to consistently do with running backs.”\n\nFAMILIAR FOE\n\nOliver Martin was on Michigan’s football team last spring, competing for playing time. The receiver transferred to Iowa in the summer to play for his hometown team. Martin was granted a waiver to play immediately, putting him on the field with former teammates.\n\n“It’s very weird,” Wolverines cornerback Lavert Hill said.\n\nMartin has five receptions for 28 yards and a touchdown this season. As a redshirt freshman last year with the Wolverines, he had 11 catches for 125 yards and a touchdown.\n\nHE SAID IT\n\nAfter Michigan routed Rutgers 52-0 last week, linebacker Cam McGrone was asked about the team getting widely criticized about its 35-14 loss at Wisconsin.\n\n“I’m not really tired of it because, you know, it happened,” McGrone said. “But we definitely embrace it because we know we’re going to see them again in Indy, in my hometown for the Big Ten championship. So, I don’t really mind hearing about it because I know when we see them again, we’re gonna smack them in the mouth.”\n\nON THE GROUND\n\nIowa’s revamped rushing attack is averaging nearly 5.2 yards per carry and the team hasn’t lost a fumble in three games. The Hawkeyes and Oregon State are the only teams in America that have only committed one turnover so far.\n\n“Part of it’s experience,” coach Kirk Ferentz said. “Part of it’s concentration, too.”\n\nIowa rotates running backs Mekhi Sargent and Tyler Goodson behind an offensive line with two seniors and two juniors. The Wolverines were pushed around two weeks ago at Wisconsin and allowed Jonathan Taylor to run for 203 yards and two touchdowns in a 35-14 win.\n\n___\n\nAP Sports Writer Luke Meredith contributed to this report.\n\n___\n\nMore AP college football: https://apnews.com/Collegefootball and https://twitter.com/AP_Top25\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "No. 14 Iowa and No. 19 Michigan have at least one thing in common, failing to finish first since the schools shared the Big Ten title in 2004.", "authors": ["The Washington Times Http", "Larry Lage"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/28/middle_tennessee_iowa_football_90421_c0-186-4453-2782_s1770x1032.jpg?6dfe3bd20770f8bdf86f35e7e7c0b1c957fa3ee9", "published_at": "2019-10-04"}