{"pub": "wsj", "url": "https://barrons.com/articles/porsche-debuts-a-more-affordable-taycanand-plans-a-plug-in-plane-01571158679?mod=rsswn", "downloaded_at": "2019-10-15 23:08:22.373202+00:00", "title": "Porsche Debuts a More Affordable Taycan—and Plans a Plug-In Plane", "language": "en", "text": "Text size\n\nThere’s quite a bit going on at Porsche and its parent company Volkswagen, as the brands pivot from internal combustion to state-of-the-art electric mobility—and beyond. A flying battery-powered Porsche? Yes, it’s on the drawing board.\n\nBloomberg’s report that Volkswagen might be considering a sale of Lamborghini as it concentrates on VW, Porsche, and Audi is being fervently denied by the company. “There are no plans for a sale or IPO of Lamborghini,” VW said Oct. 13. “Speculation to this effect is unfounded.”\n\nBut the report seemed plausible, because Lamborghini could be the odd company out as those other three divisions plug in. Porsche, in particular, has had a flurry of battery news lately, and is determined to be at the cutting edge—wherever that may be. “Porsche is looking to enhance its scope as a sports car manufacturer by becoming a leading brand for premium mobility,” Detlev von Platen, a member of the executive board for sales and marketing at Porsche AG, said in a statement.\n\nPorsche’s future could be at least partly in the friendly skies. On Oct. 10, the company said it had signed a memorandum of understanding to explore the premium urban air mobility market by building a prototype with Boeing NeXt. The latter could make it fly, and the former make it fly faster, and with considerable style (inside and out). Porsche Consulting’s 2018 study showed that there will be a market for urban aircraft after 2025.\n\nThe aircraft in question would be fully electric and capable of vertical takeoff and landing (VTOL). The concept is already being explored by other companies, including automakers such as Hyundai (which recently announced an Urban Air Mobility division). German startup Lilium is testing a five-seat electric VTOL craft for air taxi service. The four-passenger Bell Nexus, a hybrid VTOL for on-demand service, was announced at this year’s Consumer Electronics Show. Airbus is also a player, with the self-piloted Vahana, whose first successful test flight was last year.\n\nBoeing and Porsche are exploring urban air mobility. Could their electric vertical takeoff and landing aircraft look something like this? Porsche photo\n\nAnd there’s also a new Porsche Taycan on the horizon. The Taycan 4S (with two battery options) is a more affordable iteration of the car, arriving in the spring of 2020. The standard version, with a single-layer 79.2-kilowatt-hour battery, will offer 429 horsepower (and up to 522 when accelerating using launch control).\n\nThe other option is the Performance Battery Plus, with a two-layer, 93.4-kilowatt-hour pack, producing 482 horsepower (563 with launch control). Torque figures are close—472 pound-feet for the standard car, 479 for the Plus model. Both cars can reach 155 miles per hour.\n\nRange isn’t available yet, but the cars share all-wheel drive architecture (a motor on each axle) with the already announced Turbo models. The 4S starts at US$103,800 in standard form and climbs to US$110,380 for the Plus (add US$1,350 in destination charges to both cars).\n\nBoth cars reach 60 miles per hour in 3.8 seconds, compared to three seconds for the Taycan Turbo and a blistering 2.6 for the Turbo S. So the entry 4S is a little slower, but also US$47,000 cheaper than the Turbo and US$81,000 cheaper than the Turbo S. They had to take away something, so the 4S gets 19-inch wheels, the Turbo 20-inch, and the Turbo S 21-inchers.\n\nAmerican customers get three years of free charging at Electrify America stations across the country. When fast charged, the car can go from a 5% to an 80% charge in 22.5 minutes.\n\nThe 4S brings the Taycan down into Tesla territory. There’s no question that carmakers now are building competitive, ultra-fast, and gorgeous electric cars. And they’re increasingly affordable. The big question—and a highly placed German executive recently told me he didn’t have the answer—is whether or not customers will be lining up to buy them.", "description": "The automaker—along with its parent company Volkswagen—is going all-in on electric transport", "authors": ["Jim Motavalli"], "top_image": "https://images.barrons.com/im-117088/social", "published_at": "2019-10-15"}