{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7573603/Telstra-chairman-slams-National-Broadband-Network-NBN-cost-taxpayer.html", "downloaded_at": "2019-10-15 08:07:17.966834+00:00", "title": "Telstra chairman slams National Broadband Network (NBN) and cost to taxpayer", "language": "en", "text": "Telstra chairman John Mullen has slammed the $50billion National Broadband Network project\n\nTelstra chairman John Mullen has slammed the problem-plagued $50billion National Broadband Network, saying Australians would have faster and cheaper internet without it.\n\nDuring Telstra's annual general meeting on Tuesday, Mr Mullen criticised the NBN project for wasting money.\n\n'In the NBN we have created a state-owned monopoly that is going to cost the country more than $50billion,' he said.\n\n'Whether we like it or not, the NBN is here to stay.'\n\nThe NBN is aimed at connecting residents to a fast and reliable broadband network.\n\nSnce the rollout began a decade ago, the NBN has been the target of intense backlash over internet speeds and pricing.\n\nNot only has the finish date of the project been pushed back to 2020, but its final cost has ballooned to $50billion.\n\nThe NBN is considered the largest infrastructure project in Australia's history and is aimed at connecting residents to a fast and reliable broadband network (stock image)\n\nMr Mullen claimed private enterprises were always going to build a high-speed network to serve the majority of Australia's population.\n\nHe said the government could then have expanded the network to remote areas that companies had deemed uneconomic to service, resulting in a nationwide network at a fraction of the NBN's cost.\n\n'It is always easier to comment with the benefit of hindsight, but it is my view that over the last 10 years private sector competition between strong players such as Telstra, Optus, TPG and others was always going to build 100Mbps broadband access and speed to the majority of the population of Australia, in an ongoing competitive landscape and at no cost whatsoever to the taxpayer,' he said.\n\n'Governments could then have decided how much subsidy they were willing to provide the industry to extend this coverage to regional and rural areas where private sector economics were unattractive.\n\n'This would have been at a fraction of the cost of today's NBN.'\n\nEarlier this year, the Australian Competition and Consumer Commission (ACCC) called out NBN over its prices.\n\nThe NBN had promised faster internet speeds compared to households on an ADSL connection.\n\nThe NBN had promised faster internet speeds compared to households on an ADSL connection (stock image)\n\nThough the ACCC claimed households on the NBN were being provided with the same internet speeds as their old ADSL connections and paying more for the service.\n\nThe watchdog has since launched an inquiry into NBN affordability and whether its entry level prices are reasonable.\n\nMr Mullen appeared to take issue with NBN's overall pricing for its services.\n\n'When Telstra was the regulated wholesale provider to the industry, Telstra charged an average of approximately $20 per user per month,' Mullen said.\n\n'The NBN Co is now charging some $44 per month on average and ... states its ambition is to get this to $49 in FY23.'\n\nMr Mullen called for wholesale prices to be cut so that Telstra and others could make a profit by reselling access to the network.\n\n'Australia already has some of the highest wholesale broadband pricing in the world, and if this trend continues, over time most resellers of the NBN will withdraw or go broke,' Mr Mullen said\n\n'The downside of this in turn will be fewer service providers and ultimately higher broadband prices to the consumer.'\n\nThough since the rollout began a decade ago, the NBN has been the target of intense backlash over internet speeds and pricing (stock image)", "description": "During Telstra's annual general meeting on Tuesday, Mr Mullen criticised the NBN project for wasting Australian taxpayers' money.", "authors": ["Aidan Wondracz For Daily Mail Australia", "Australian Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/04/19721756-0-image-a-3_1571111467749.jpg", "published_at": "2019-10-15"}