{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/12/jacobs-dreams-a-little-dream-to-close-fashion-week", "downloaded_at": "2019-09-12 07:24:27.076598+00:00", "title": "Jacobs dreams a little dream to close Fashion Week on a high", "language": "en", "text": "NEW YORK (AP) - Twice a year, the New York fashion world trudges to the Upper East Side and the cavernous Park Avenue Armory to see what new tricks Marc Jacobs has up his sleeve.\n\nSomehow Jacobs, who has the final Fashion Week slot every time - a position of considerable pressure - tends to find a way to surprise and impress. But on Wednesday night he also sent a jolt of delight through the crowd with a joyful and dreamlike ode to fashion of all kinds and all eras.\n\n“Tonight is our reminder of the joy in dressing up,” he wrote in notes left on guests’ chairs, “our unadulterated love of fashion and embracing grand gestures of unbridled expressions, reactions, ideas and possibilities.”\n\nIf that was a mouthful, it reflected the ebullient mood of the show. Normally, Jacobs’ models walk down a runway in a dark room with a determined pout on their faces. Here, the lights were on and the models were smiling, winking, even waving as they sashayed by.\n\nThe room looked different, too. Entering to take their seats, guests found the huge Armory floor empty except for a gaggle of mismatched white chairs arranged in uneven rows at the back, as if in an abandoned vintage furniture store.\n\nSuddenly the doors opened and Jacobs’ models - 61 of them - entered the room to the strains of Doris Day singing “Dream a Little Dream of Me.” They spread out horizontally and then marched directly to the audience, right past them in their chairs, and out the other side of the room.\n\nWere these wonderfully colorful creatures, resembling the cast of a Fellini film on steroids, now gone? Thankfully, they returned and the show began in earnest, with models emerging one by one to parade in a circle around the seats.\n\nThere was color, sparkle, craftsmanship, dazzling variety - and far too many cultural references to count. Bella Hadid looked like a cowboy, in shades of purple, red and gray. Her sister, Gigi Hadid, was barefoot, in a pastel blue minidress and round hat that resembled a 1960s airline hostess.\n\nThere were sartorial nods to people who died recently: Chanel’s longtime designer Karl Lagerfeld, who died in February; Lee Radziwill, who died the same month, and Anita Pallenberg, who died in 2017.\n\nJacobs also made clear his love for some current TV shows. “From late nights binge-streaming … inspiration draws from the thoughtful and accurately executed set design of ‘Fosse/Verdon,’” and what he called the “boundary-pushing … ‘Euphoria,’ so accurately portraying what it means to be a young person today.”\n\nJacobs didn’t leave unaddressed the fact that the day was 9/11; he referenced, in his show notes, his fashion show the night before the 2001 attacks, just yards away from the glistening towers.\n\n“This show, like that show,” Jacobs said, “is a celebration of life, joy, equality, individuality, optimism, happiness, indulgence, dreams, and a future unwritten as we continue to learn from the history of fashion.”\n\nWhether you caught Jacobs’ historical references in his parade of fashions, you definitely could catch the feeling of joy - and no more so than when Jacobs came out for his own bow.\n\nNot content with the usual quick wave to the crowd, he threw up his arms and twirled around the room on his red platform boots - still clearly dreaming his little dream, and taking everyone else along for the ride.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Twice a year, the New York fashion world trudges to the Upper East Side and the cavernous Park Avenue Armory to see what new tricks Marc Jacobs has up his sleeve.", "authors": ["The Washington Times Http", "Jocelyn Noveck"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/12/fashion_marc_jacobs_23080_c0-220-5265-3289_s1770x1032.jpg?899a259deaa9aa57694b79e12ffcb9514e052c53", "published_at": "2019-09-12"}