{"pub": "washingtonpost", "url": "https://washingtonpost.com/outlook/2019/09/03/police-punitive-policies-make-schools-less-safe-especially-minority-students", "downloaded_at": "2019-09-03 23:44:18.537508+00:00", "title": "Police and punitive policies make schools less safe, especially for minority students", "language": "en", "published_at": "2019-09-03", "text": "\n\nOfficer Joe Plazio of the Fairfax County police patrols the hallways at West Springfield High School in January 2013. (Jahi Chikwendiu/The Washington Post)\n\nKathryn Schumaker is the Edith Kinney Gaylord presidential professor in the department of classics and letters at the University of Oklahoma and author of \" Troublemakers: Students’ Rights and Racial Justice in the Long 1960s .\"\n\nAt the start of a new school year, parents, policymakers and educators are once again focused on school safety. Although it’s an understandable concern, especially in an era of unchecked mass shootings, calls for school safety measures are not as benign as they seem: Such policies have often made schools more dangerous for students of color.\n\nThis is evident in the increasing police presence at schools over the past five decades. Last month, the U.S. Court of Appeals for the 8th Circuit grappled with the question of how to balance the rights of students with the need for security and order in schools. In a case arising from a Kansas City public school, a police officer handcuffed a 7-year-old black boy and escorted him to the principal’s office for becoming upset after a classmate “incessantly teased” him. The boy remained handcuffed until his father arrived at school 20 minutes later.\n\nBringing in police officers to handcuff second-graders simply because they are upset or defiant is not good educational policy. But according to the 8th Circuit, it’s legal.\n\nThis punitive decision is a product of changes in educational policy over the past 50 years, in which schools have argued, and courts have agreed, that harsher punishments are necessary for reasons of student safety. As students have become more vocal in asserting their rights, educators and legislators have responded by turning to police officers and more severe disciplinary policies, both of which have done little to enhance education but have done much to perpetuate racial inequality.\n\nThe increase in school security is directly linked to the rise of student activism that started to transform schools 50 years ago. In the 1969 case Tinker v. Des Moines, the U.S. Supreme Court famously declared that teachers and students “do not shed their constitutional rights to freedom of speech or expression at the schoolhouse gate,” siding with Christopher Eckhardt, John Tinker and Mary Beth Tinker, who wore black armbands to express opposition to the escalation of the Vietnam War in 1965. Their protest was only one example of the hundreds of student protests that roiled American schools in the late 1960s and early 1970s. Their lawsuit, however, was a watershed moment in U.S. legal history because it extended constitutional rights to all public school students.\n\nThis decision also included an important limit on students’ rights. In Tinker, the Supreme Court determined that students’ rights had to be weighed against school administrators’ need to maintain order. Notably, disruptive speech was not protected because the interest in maintaining an orderly school environment prevailed.\n\nDuring the 1970s and 1980s, the increase in school protests and accompanying student rights lawsuits generated public fear that there was a crisis in school discipline. In 1977, the U.S. Department of Health, Education and Welfare released “Violent Schools — Safe Schools,” which drew media attention to the issue by declaring, “School crime and disruption should be recognized as a significant problem, one that must receive open attention and public concern.” Another 1977 report from the Senate subcommittee on juvenile delinquency warned of tens of thousands of assaults by students on teachers, ominously reporting that for many teachers, their aim at work was “no longer education but preservation.”\n\nThese well-publicized reports contributed to the sense that school discipline was a major social problem requiring strong and effective solutions, even though the evidence did not sustain the idea that unruly students and school crime were reaching crisis proportions. Instead, “Violent Schools — Safe Schools” noted that principals reported that incidents of crime and violence in schools had decreased or, at worst, leveled off since the tumult of the late 1960s and early 1970s.\n\nAmid this tide of publicity about unruly students, the Supreme Court hesitated to tie the hands of school administrators, instead prioritizing order in the classroom over students’ rights. In 1977, the court decided Ingraham v. Wright, affirming the constitutionality of corporal punishment in public schools.\n\nThe facts of the Ingraham case were appalling, revealing serious abuses of the disciplinary practice of paddling. Assistant principals in Miami were accused of keeping students in line by instituting a reign of terror in the school’s hallways. Students were frequently beaten for all kinds of behavior: being tardy to class, for example, or having an untucked shirt. James Ingraham, the lead plaintiff, was paddled by the principal with such force that he required medical attention for his extensive bruising and had to stay out of school for a week. His offense? Being “slow to respond to his teacher’s instructions.”\n\nThe Supreme Court ruled against the students, however, declaring that “corporal punishment serves important educational interests,” especially when “viewed in the light of the disciplinary problems commonplace in the schools.”\n\n“Violent Schools — Safe Schools” did not, in fact, report an increase in student misbehavior, but schools did sign on to more measures to improve discipline. Increasingly, school district officials and principals allowed police officers to patrol school hallways. Although the protests and student rebellions of the late 1960s often resulted in administrators calling officers to campus, the crisis over school discipline in the 1970s justified keeping them there. And the courts, with their focus on order in the classroom, protected such policies as necessary.\n\nLos Angeles serves as an illustrative example. During the 1970s, the Los Angeles Unified School District initiated programs to bring police officers into schools in the years following the East Los Angeles “blowouts,” in which tens of thousands of Mexican American students protested discrimination in city schools. In another move to restore order to L.A. schools, the year after the Supreme Court greenlighted corporal punishment, the teachers’ union negotiated an end to the district’s recent prohibition on the practice.\n\nThis all happened even as the federal government’s reports showed that this trend toward a punitive culture in schools was more rooted in fear than in reality.\n\nBut this perception has had very real consequences for targeted students. Today, black students are much more likely to be suspended, expelled or arrested at school than white students — and such punishments are meted out mostly for minor infractions such as disrupting class or tardiness as opposed to criminal or violent behavior. Black children also are significantly more likely than their white peers to receive corporal punishment at school, even though there is no evidence that they are more poorly behaved or break school rules more often than white students do. Students with disabilities are also more likely to be physically punished than their peers without disabilities.\n\nResearch points to conscious or unconscious biases that motivate disciplinarians to overreact because they consider black children and students with disabilities to be inherently more disruptive than other students. Meanwhile, the courts’ concerns about the need to maintain order have protected school administrators, teachers and police officers who contend that punished students were disruptive and disorderly.\n\nUnless educators consider how the focus on order above all other concerns perpetuates racial disparities in school discipline, the problem is unlikely to abate. Individual teachers and principals cannot independently change the law, but they can reflect on how their daily interactions with students can mitigate or perpetuate structural forms of racism. Policymakers must also pay attention to how well-intentioned reforms in the past have harmed black students.\n\nTeaching is a stressful job, and classroom management can be tremendously difficult. Changing the punitive culture of schools and the racial disparities it produces will take coordinated efforts among parents, school officials, researchers and government. But the start of a school year is also a fresh opportunity for teachers and administrators to consider how offering a little grace in a moment of frustration could contribute to bringing about change, however small.", "description": "Presented as school safety measures, these practices have done more harm than good.", "authors": ["Kathryn Schumaker", "Kathryn Schumaker Is The Edith Kinney Gaylord Presidential Professor In The Department Of Classics", "Letters At The University Of Oklahoma", "Author Of", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/G16v4ofprN1qlYK5SSBPsW1W8Bs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ENX574TBV4I6FAPPUISJYHS3HU.jpg"}