{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-6521973/Boy-four-suffering-rare-cancer-pens-heartbreaking-letter-Father-Christmas.html", "downloaded_at": "2019-10-05 08:50:32.716229+00:00", "title": "Boy, four, suffering from rare cancer pens heartbreaking letter to Father Christmas", "language": "en", "text": "This is the first year Zac Oliver has been old enough to write a letter to Father Christmas.\n\nWhen his mother Hannah sat down to help him with it she didn't know whether to laugh or cry.\n\n'Dear Santa, I hope you are well,' the four-year-old dictated as they held the pen together.\n\n'Mummy says to tell you I've been a very good boy so please can you bring me: 1. Dinosaurs. 2. PAW Patrol. 3. Hair — please can you make it curly? Love Zac xxx'.\n\nZac Oliver, four, is undergoing a particularly harsh cycle of chemotherapy to contain his rare form of leukaemia\n\nZac, who is undergoing a particularly harsh cycle of chemotherapy to contain his rare form of leukaemia, began to lose his hair the day after he decorated the Christmas tree with his three-year-old brother Leo.\n\nHe doesn't complain. He never really has since he was diagnosed in May.\n\nInstead, he loves watching the animated tv show about superhero puppies — PAW Patrol — and making his own Christmas cards.\n\nHe shows me the cards he made with a red handprint on the front to thank those who have helped raise funds for the pioneering treatment he is having in America.\n\nThe CAR-T therapy is not available to him in this country, but increases his chances of survival from 25 per cent to more than 60 per cent.\n\n'I'd be really, really poorly if they hadn't paid for my special medicine,' he explains with the sort of earnest expression that can't fail to touch your heart.\n\nZac is the winsome little boy who captivated the nation when his story became public earlier this year.\n\nSuffering from the rare near-haploid strain of lymphoblastic leukaemia, his family wanted to send him to the U.S. for revolutionary immunotherapy to give him a fighting chance of life.\n\nWhen they launched a herculean fundraising campaign, donations poured in — including a £100,000 gift from an anonymous Daily Mail reader — enabling them to reach the £500,000 needed.\n\nToday, the fund stands at more than £625,000. It is administered by a trust and will be used to finance research into childhood cancer once Zac's needs are met.\n\nUnderstandably, for now, Hannah's only concern is her son. Last month, they went to Philadelphia, where Zac began the first phase of treatment.\n\nWithout it, this could have been his last Christmas.\n\nZac, of Broseley, Shropshire, will return to the Children's Hospital of Philadelphia in January when T cells, which were harvested from his blood in November and are currently being modified in a laboratory, will be re-infused into his body.\n\nLast month, the four-year-old from Shropshire went to Philadelphia, to begin the first phase of treatment\n\nMeanwhile, he must go daily to nearby Telford Children's Hospital — including on Christmas morning — for chemotherapy to ensure his particularly aggressive cancer does not overrun his little body before the next stage of treatment.\n\nHannah says: 'The first time he started losing his hair it was June. He said, 'I'm like the dog, aren't I mum? I'm moulting like the dog'.\n\n'I was so happy to see it growing back, but then it began falling out last week. It doesn't seem to bother him, but it's made me sad.\n\n'Wayne (her 37-year-old husband and Zac's besotted stepfather) ran his hand through Zac's hair and said, 'Look Hannah'. It was all in between his fingers.\n\n'It means you can just see how toxic the stuff is that they're pumping into him, but if he doesn't have the chemotherapy the cancer could take over his body and then . . .'\n\nShe bites her lip and shakes her head.\n\nNeedless to say, this is a particularly poignant Christmas for Hannah, 33.\n\nThis time last year they were, as she says, a 'normal' family with two little boys who were too young to fully understand the meaning of Christmas.\n\nThey both looked forward to the children appreciating it fully this year.\n\nHe will return to the Children's Hospital of Philadelphia in January when T cells, which were harvested from his blood in November and are currently being modified in a laboratory, will be re-infused into his body\n\n'We hadn't been thrown into this world of devastation,' says Hannah. 'We had no experience of c****y, horrid, childhood cancer.\n\n'You know when you think life's just going to go on being as normal as it's always been?\n\n'We'd just moved into this house and had no furniture — just the beds — because it was snowing and they couldn't get the second van up the road.\n\n'We had a mattress in the front room where the boys sat in their pyjamas opening the presents under the Christmas tree.\n\n'Wayne and I had smoked salmon on toast, which is our Christmas tradition. The boys were a little bit too young to really understand what was going on.\n\n'We just kept saying, 'Next year's going to be amazing,' and it is, they're really excited.'\n\nAs if on cue, Zac and his brother hurtle into the kitchen in search of treats. To see Hannah's face you know she'd give a lifetime of Christmases to be able to change the sheer terror of the last six months.\n\n'I've seen the worst of life in the last year, but I've also seen the best,' she says.\n\n'The way people have helped with our campaign is incredible.\n\n'As you go about life, you often question people's morals or values but the campaign has shown me that, if people are given something they believe in and something they'd like to make a difference to, they'll do anything.\n\n'People have treated Zac as if he's their own. They've missed time off work, they've spent their last £5 or whatever. They've done things you'd think people would only do for their own child to try to get him this treatment.\n\n'I still wish all of this had never happened — that I could wake up and suddenly realise it was just a horrible nightmare. I just feel, well, maybe you should read this.'\n\nShe takes an envelope from the windowsill, which sits beside two others. Each of them is for Father Christmas.\n\n'Zac wanted me to write a letter too.' She opens the envelope and hands me the note.\n\n'Dear Father Christmas,' it starts. 'You could bring me a million pounds but it wouldn't buy me happiness.\n\n'The only thing that would make a difference would be if you could make all the last six months disappear and make my little boy better.\n\n'If you can't, I would rather have nothing and just see my sons have a lovely Christmas and enjoy being with their brothers and family. Mum x.'\n\nShe is close to tears as I read it. 'I've gone all out on Christmas this year,' she says.\n\nIndeed, a full-size snowman stands outside the warm family home and the windows twinkle with numerous decorations.\n\nChristmas songs play on the music system and the delicious smell of a whole salmon Wayne has cooked for a family party tomorrow wafts through the kitchen.\n\nZac's excitement is a joy to behold as he jumps from foot-to-foot dancing to Rudolph the Red-Nosed Reindeer.\n\nOnly his hair loss marks him out as different to any other exuberant four-year-old at this time of year.\n\nBut, make no mistake, the near-haploid strain of lymphoblastic leukaemia, which affects less than 0.5 per cent of childhood leukaemia sufferers worldwide, is a cruel disease. So much so that four out of five children diagnosed with it die.\n\nThree weeks ago, Hannah was beside herself fearing Zac was about to become one of those grim statistics after a blood test revealed his white blood cell count had rocketed.\n\n'He'd had chemotherapy and was wiped out,' she says.\n\n'When he's like that your life stops until he's back running around doing normal things again, because you're thinking, 'what if he gets a seizure? What if he stops breathing? What if he has toxicity?'\n\n'He'd had a blood test but the results hadn't come back while we were at the hospital so I phoned up the ward afterwards.\n\n'The nurse started reading them out. His haemoglobin was 112, which is fine for him. His platelets were 300, which is brilliant. Then she said his white cell count was 12.4.\n\n'The only time it was that high was at diagnosis. Then he had the chemotherapy that eventually put him into remission and after that he'd never gone above four or five.\n\n'It was like, you know when you start to drive and you see an ambulance go past with flashing blue lights you do that…' she takes a sharp, quick breath to demonstrate '…because you think someone is dying.'\n\nIt was literally one of those moments. Suddenly I was like, 'the cancer's spreading. What else can be happening?'\n\nThe nurse said the results hadn't been checked so she was going to get someone to look at them. The doctor phoned back and said, 'Pack a bag, come in, we'll re-do the tests.'\n\n'I was trying to pack a bag, crying and Googling at the same time to see what the signs of relapse are.\n\n'We got there, had the tests and went into the ward. I kept Googling. It was literally panic. I was thinking, 'That's it. We're never going to come out of hospital again.\n\n'We've come in now and we're not going to leave. We'll just be in-patients and he'll die. He's relapsing and it's going to spread.'\n\n'With near-haploid, once they relapse the cancer is so aggressive it's resistant to everything. Death is usually rapid. You haven't got much time. I'm not religious, but I prayed. What else can you do?\n\n'You've got nothing else to give, nothing that can change the circumstances other than the thoughts in your head to make your child live.'\n\nHannah waited for the results for nearly two hours. Thankfully, the second test revealed Zac's white blood cell count had dropped.\n\nShe understands the steroids he is taking had caused the reading to spike. 'That's when I began to breathe again,' she says.\n\n'Last week one of the few children in the world who has Zac's cancer relapsed. It can happen just like that. Then you start thinking why? Why is near-haploid so aggressive and why did Zac get it?\n\n'Even now that still confuses me. You'd think I'd have put it to bed by now.\n\n'Even the other week, when I had a clinic meeting with our oncologist, I asked him how he got it.\n\n'Have I given him something? Have I done something that's caused him to have it? Is it my fault? What did I do wrong?\n\n'I want that answer, but maybe it's an answer I'll never get.'\n\nHannah pulls a sort of enough-of-that-it's-Christmas-time face.\n\n'We're going to make this Christmas as good as we can,' she says.\n\n'We're seeing if we can sort out a Father Christmas at the hospital for when we take him up on Christmas morning and we'll make sure there's some presents there for him and Leo. We'll tell him Santa didn't know whether he'd be in hospital or not.\n\n'Then, once he's had some chemotherapy, we'll come back here and have our Christmas.\n\n'The chemo he's going to be on is pretty harsh so he could feel like c**p, but even if he's lying on the sofa, he's here with us. I know Zac has got a really s**t prognosis, but at least he's in remission.\n\n'If he stays there until January 29 so they can put the T cells in him which will spread through his whole body and destroy any tiny little cancer cells that are left then…then…'\n\nShe searches for the right words. 'I feel as if…as if I'll believe in…'\n\nChristmas miracles?\n\nHannah nods. 'That's why we did the campaign to try to get him the Car-T therapy before he relapsed.\n\n'The money we had to raise, £500,000, seemed so huge, but through the generosity of people a miracle did happen.\n\n'We've got five weeks to go now. All we can do is pray, wait and wish.'", "description": "Zac Oliver, four, from Shropshire, who is undergoing a particularly harsh cycle of chemotherapy to contain his rare form of leukaemia, has penned a letter to Father Christmas.", "authors": ["Rebecca Hardy For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2018/12/22/01/7722510-0-image-a-43_1545440453397.jpg", "published_at": "2018-12-22"}