{"pub": "marketwatch", "url": "https://marketwatch.com/story/why-trump-hates-imports-and-why-thats-bananas-2019-09-06", "downloaded_at": "2019-09-06 12:09:48.696115+00:00", "title": "Why Trump hates imports — and why that’s bananas", "language": "en", "text": "EDUARDO SOTERAS/AFP/Getty Images Americans love bananas, but it’s difficult to grow them here. The answer? Import them from places better suited to banana cultivation. In exchange, we’ll sell things that we are good at making. That’s the logic of the benefits of international trade that President Donald Trump just doesn’t understand.\n\nCAMBRIDGE, Mass. (Project Syndicate) — When President Donald Trump quipped in March 2018 that “trade wars are good, and easy to win,” many dismissed his remark as a mostly harmless rhetorical flourish. But was it?\n\nThe reason that countries participate in international trade is to get imports — consumer goods, intermediate goods used in production, and capital equipment — in exchange for exports. Framed this way, exports are simply the goods that Americans are willing to part with to acquire something they want or need.\n\nBut international trade also boosts, on net, the size of the overall economic pie, because it means that countries can focus on doing whatever they do best, producing goods in areas where they are relatively more productive.\n\nTrump reverses economic logic\n\nAccording to David Ricardo’s theory of comparative advantage, countries’ relative strengths derive from differences in factor endowments. And, as economists Paul Krugman and Elhanan Helpman showed in the 1980s, countries’ relative strengths are also related to their investments in various areas of specialization.\n\nBy embracing a primitive mercantilist model in which exports are “good” and imports are “bad,” Trump has reversed this impeccable economic logic.\n\nIn a mercantilist model, an excess of exports over imports contributes to national wealth through the accumulation of paper claims (previously gold). This seems to be what Trump has in mind when he complains that China is draining $500 billion per year from the U.S. economy, mostly by exchanging Chinese goods for Treasury bonds.\n\nNeedless to say, it is hard to see how receiving a lot of high-quality goods at low cost amounts to “losing.”\n\nTrump seems to be relying on a theory advanced by his trade adviser Peter Navarro, who has noticed that imports appear with a minus sign in the identity relationship satisfied by gross domestic product. (That is, GDP equals consumption plus domestic investment plus exports minus imports.)\n\nHe concluded that a tariff-induced reduction in imports would lead magically to an increase in domestic production (GDP), which meets the demand previously serviced by imports.\n\nNever mind that the certainty of retaliation will lead to a contraction in overall international trade and U.S. GDP. (As an aside, I hope that Navarro did not learn his international macroeconomics while getting a Ph.D. at Harvard University in the early 1980s under Richard Caves, who had very different ideas.)\n\nChina does create problems\n\nNow, it is certainly true that China restricts international trade and imposes high costs on foreign investment, often by forcing foreign businesses to transfer technology to their Chinese partners. The outright theft of technology by Chinese entities is also an important issue.\n\nIt would be better for the world — and almost surely for China, too — if these restrictive practices were curtailed. Yet if the U.S.’s objective is to reduce trade barriers, imposing tariffs on Chinese imports is a strange way to go about it.\n\nTo be sure, there was a moment a few months ago when China seemed willing to adopt significant reforms as part of a deal to avoid tit-for-tat tariffs. But even then, there was something odd about the proposed arrangement: the Trump administration wanted a quantitative list of specific U.S. exports that China would import in greater volume.\n\nThe Chinese, of course, were happy to proceed this way, because it is in keeping with a command-and-control form of economic governance. But the American approach is supposed to be different.\n\nRecognizing that we do not know whether additional Chinese purchases should take the form of agricultural goods, Ford F, +1.52% pickup trucks, or Boeing BA, +1.06% airplanes (which used to be viewed as reliable), the United States should be advocating a general reduction in tariffs and other trade restrictions so that the market can decide what goods should be produced and exchanged.\n\nEnduring trade war\n\nIn any event, it now seems likely that the U.S. will be left with an enduring trade war, implying long-term costs for American consumers and businesses.\n\nDespite still-favorable effects from the 2017 tax reform and the administration’s cuts to harmful regulations, growth is weakening, and Trump has tried — futilely — to pin the blame on the Federal Reserve and unproductive U.S. companies.\n\nThe real problem is Trump’s approach to trade policy, which is far worse than that of his predecessor, and could well push the U.S. economy into recession.\n\nThe problem, more broadly, is that the U.S. political establishment has reached a consensus that something must be done to curb China’s restrictive trade practices. Yet sometimes it is better to live with a situation that falls short of the ideal.\n\nAs for Trump, he seems genuinely to love tariffs, because they impede “bad” imports and raise revenue. Unlike many other economic arguments that he has made, his advocacy for tariffs is apparently sincere, and his commitment to the policy thus irrevocable.\n\nBut that makes it hard to see how the U.S. can strike a satisfactory trade deal with China. Worse, Trump may further expand his use of tariffs as negotiating tools vis-à-vis many other countries.\n\nAll told, I would not say that Trump has the lowest “economics IQ” among recent presidents. But there is clearly a large gap between what he knows and what he thinks he knows. Because it is the latter that determines U.S. trade policy, America has a serious problem on its hands.", "description": "Donald Trump’s trade war won’t end soon, because the president doesn’t understand what’s good about imports, writes Robert J. Barro.", "authors": ["Robert J. Barro"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ789_banana_ZG_20190905162813.jpg", "published_at": "2019-09-06"}