{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/22/WS5dae92c8a310cf3e35571e5c.html", "downloaded_at": "2019-10-22 13:26:42.891309+00:00", "title": "Open-source chips to help growth of digital society", "language": "en", "text": "Visitors to the Light of Internet Expo of the sixth World Internet Conference take a close look at Alibaba's homegrown AI inference chip, the Hanguang 800, in Wuzhen, Zhejiang province, on Saturday. [Photo by Zhu Xingxin/China Daily]\n\nOpen-source chips are expected to bolster the new round of development of China's semiconductor industry, along with the blossoming of artificial intelligence, big data, cloud computing and other cutting-edge technologies that are increasingly reliant on core computing power provided by processor chips, according to officials and experts.\n\n\"The integration of the open-source chips ecosystem with that of intelligent products has been accelerated, becoming an important cornerstone in building a digital society,\" said Liu Liehong, vice-minister of the Cyberspace Administration of China, at a sub-forum on the sidelines of the sixth World Internet Conference in Wuzhen, Zhejiang province.\n\nLiu said that with the rapid development of the internet of things, AI and intelligent manufacturing, an array of intelligent homes, wearable devices, security systems, drones and robotics are emerging rapidly. And this has put forward a new requirement for chips that are low-cost and tailor-made with high reliability and flexibility.\n\nRISC-V, an open-source hardware instruction set architecture, or ISA, based on established reduced instruction set computer, or RISC, principles, is widely seen a core architecture of chip development and has attracted a lot of attention across the semiconductor industry.\n\nLiu pointed to the need for attracting global innovation sources to participate in the open-source chips industry, which has ushered in a golden period of development, while noting the RISC-V has increased the iteration of new chips, and reduced the costs and thresholds in the chip industry.\n\nGao Xingfu, vice-governor of Zhejiang, said the province is stepping up efforts to promote the integrated circuits, or IC, industry, and attaches importance to the open-source chip architecture, RISC-V.\n\nGao said the global IC industry is undergoing profound changes, with customized chips being the development direction of the future, adding the technology will boost the digital transformation of traditional industries.\n\nAlibaba's chip-making subsidiary, Pingtouge Semiconductor, launched its first processor, Xuantie 910, built on an open-source architecture in July. The processor can be used in applications in such fields as 5G, AI, network communications and autonomous driving, according to Alibaba.\n\nLi Shushen, vice-president of the Chinese Academy of Sciences, said the academy will promote the establishment of open-source chip standards. It will call for more international cooperation and the enrichment of application scenarios for such chips.\n\nThe biggest issue of the chip industry lies in the high design threshold, and only a few enterprises can afford the high R&D costs of medium-level and high-end chips, said Ni Guangnan, an academician at the Chinese Academy of Engineering, adding that such a situation has restricted innovation in the chip industry.\n\nNi said China has an upper hand in RISC-V open-source chip architecture, while noting the IoT, big data, edge computing and blockchain are ideal application scenarios.", "description": "Open-source chips are expected to bolster the new round of development of China's semiconductor industry, along with the blossoming of artificial intelligence, big data, cloud computing and other cutting-edge technologies that are increasingly reliant on core computing power provided by processor chips, according to officials and experts.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/22/5dae92c8a310cf3e97a267cd.jpeg", "published_at": "2019-10-22"}