{"pub": "breitbart", "url": "https://breitbart.com/border/2019/10/28/group-of-51-migrants-tried-to-sneak-past-border-patrol-in-texas", "downloaded_at": "2019-10-28 23:38:11.043377+00:00", "title": "Group of 51 Migrants Tried to Sneak Past Border Patrol in Texas", "language": "en", "text": "Del Rio Sector Border Patrol agents arrested a group of 51 migrants who attempted to sneak into the U.S. illegally.\n\nCarrizo Springs Station Border Patrol agents patrolling along the Rio Grande observed “discrepancies on a trail” leading from the river. The agents started tracking the migrants and called for assistance from U.S. Customs and Border Protection (CBP) Air and Marine Operations (AMO). Officials with AMO dispatched a helicopter crew to assist in the search for the group, according to Del Rio Sector officials.\n\nThe aircrew helped locate the migrants and guided ground-based agents to their location. The agents placed the group of 51 migrants under arrest and began an immigration interview and initial assessment.\n\nFollowing the initial interview, the agents identified all 51 migrants as Mexican nationals. They determined seven of those to be juveniles over the age of 15.\n\nThe agents turned all 51 migrants over to the Laredo West Border Patrol Station due to the location of the apprehension. The agents transported the migrants to the station where they will be processed for immigration violations.\n\nLaredo Sector Border Patrol Agent Hector Garza, in his capacity as vice president of the National Border Patrol Council, told Breitbart Texas over the past weekend that migrants are more frequently attempting to evade arrest and are finding more traditional means of being smuggled into the U.S.\n\n“We have also seen an increase in the strategy of packing human cargo into big-rig trailers,” Garza continued. “This appears to be happening as more OTMs (Other than Mexican) migrants are returned to Mexico under the MPP policy. As the migrants figure out they can’t just arrive and stay, they begin to seek more traditional human smuggling tactics to get into the country.”\n\nBob Price serves as associate editor and senior political news contributor for the Breitbart Border team. He is an original member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX and Face book.\n\n(Disclosure: Breitbart Texas sponsored the Green Line podcast for the NBPC in an effort to provide a platform for agents to inform the public about the realities on the border and what Border Patrol agents face. Director Brandon Darby received an award from the Laredo chapter of the NBPC for his work in helping to defend and bring a voice to Border Patrol agents. Breitbart News assisted in covering funeral costs for a slain Border Patrol agent previously.)", "description": "Del Rio Sector Border Patrol agents arrested a group of 51 migrants who attempted to sneak into the U.S. illegally.", "authors": ["Bob Price"], "top_image": "https://media.breitbart.com/media/2019/10/51blur-face-640x335.jpg", "published_at": "2019-10-28"}