{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/9/trump-cautions-turkeys-president-act-rationally-at", "downloaded_at": "2019-10-09 22:08:54.467689+00:00", "title": "Trump cautions Turkey's president to 'act rationally' in attacks on Kurds", "language": "en", "text": "President Trump said Wednesday that he wants Turkey’s president to “act rationally” in a military offensive against Kurdish allies of the U.S. in Syria, and warned that he’ll destroy Turkey’s economy if the fighting goes too far.\n\n“We are speaking to both sides,” Mr. Trump told reporters at the White House. “We’ve been talking to Turkey for three years, they’ve been wanting to do this for many years. They’ve been fighting each other for centuries. They’re bitter enemies, possibly always will be.”\n\nAsked what will happen if the forces of Turkish President Recep Tayyip Erdogan slaughter the Kurds, Mr. Trump replied, “If he does it unfairly, he’s going to pay a very big economic price. I will wipe out his economy if that happens. I hope that he will act rationally.”\n\nThe fighting began after Mr. Trump assured Mr. Erdogan that he was removing the small number of U.S. forces from northern Syria, where the Americans were supporting the Kurds against Islamic State fighters.\n\n“We have no soldiers in the area,” Mr. Trump said. “We are out of there. I feel that we are doing the right thing, and I think the country feels that, too. I campaigned on ending the endless wars.”\n\nThe Kurds had been guarding captured Islamic State prisoners, and the new Turkish offensive has raised concerns that the terrorists will escape to carry out more attacks against the West.\n\nMr. Trump said U.S. forces have moved some of the most dangerous Islamic State, or ISIS, captives to other locations.\n\n“We are taking some of the most dangerous ISIS fighters out,” the president said. “We’ve taken them out, and we’re putting them in different locations where it’s secure.”\n\nHe predicted some of the Islamic fighters will find their way back to Europe.\n\n“They’re going to be escaping to Europe,” he said. “That’s where they want to go, they want to go back to their homes. Europe didn’t want them from us, we could have given [Islamic State captives] to them, they could have had trials, they could have done whatever they wanted. … Those countries didn’t want to take them back, so that’s the way it goes.”\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "President Trump said Wednesday that he wants Turkey's president to \"act rationally\" in a military offensive against Kurdish allies of the U.S. in Syria, and warned that he'll destroy Turkey's economy if the fighting goes too far.", "authors": ["The Washington Times Http", "Dave Boyer"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/09/Trump_82630.jpg-73f4d_c0-206-4937-3084_s1770x1032.jpg?254e58a555653619a045684273b6db2a18550ba6", "published_at": "2019-10-09"}