{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/09/how-to-get-the-most-out-of-a-parent-teacher-conference", "downloaded_at": "2019-09-08 12:04:44.113452+00:00", "title": "How To Get The Most Out Of A Parent-Teacher Conference", "language": "en", "text": "Photo: Shutterstock\n\nParent-teacher conferences are the speed-dating of the education world. You sign up for a 10-minute slot (15 if you’re lucky), the teacher pulls out a timer, and away you go. How are his reading skills progressing? Is she doing ok with transitions? Have you noticed an issue between him and Brayden? You. Better. Talk. Fast.\n\nYes, they’re short. After all, the teacher has 21 other sets of parents to meet with over the course of two evenings, so they have to be short. But that doesn’t mean they can’t be effective.\n\nCome prepared\n\nBefore you arrive, really think through any questions you have or concerns you might want to address. You might want the teacher’s perspective of an issue between your child and another classmate. Or maybe the maths homework seems to be taking your kid longer to complete than it should, and you’re not sure how much you should intervene. This is the time to ask.\n\nThere’s no need to come up with a list of filler questions to ask just for the sake of asking; you’re not going to have time for those anyway. And maybe you don’t even have questions or concerns — even better! But the time to think that through is not at minute 7 of the conference when the teacher asks you if you have any questions. The teacher has come prepared, and you should, too.\n\nGet your child’s input\n\nTalk to your kid before the conference. If they’re young and new to the idea, explain that these conferences are helpful for both the teacher and the parents to ensure everyone is working together so they can have the best school year possible.\n\nAnd then ask them if there’s anything they think is important to discuss, Gracemarie Rozea, New York State regional director for the Parent Teacher Association, tells Scholastic:\n\nAsk how she’s doing in class, what’s going on during lunchtime, recess, and when she goes to special classes like music or gym. “You want to find out both the positive and negative,” says Rozea. If you don’t like what you’re hearing, investigate. Talk to other parents to see if their children are expressing similar concerns. “You need to find out whether your child is perceiving everything accurately or if she’s misunderstanding a situation,” she says.\n\nAfterward, update your child with all the wonderful things their teacher said about them, as well as any concerns you talked about and solutions you can all try together.\n\nAsk this question\n\nSpecial education teacher Amy Litzenblatt writes for Motherly that one of her favourite questions to ask as a parent and be asked as a teacher is a simple one: “How can I support my child at home?”\n\nThis gives teachers an opportunity to talk about academic or social areas in which your child would benefit from help or reinforcement. It will also let the teacher see that you are a team player and want to work with your child to help them succeed.\n\n“How can I support my child at home?”\n\nStick to the schedule\n\nIf everything is going great and your kid is doing well both academically and socially, a 10-15 minute conference is probably going to feel sufficient. But if they’re struggling at all, it’s not going to feel like nearly enough time to brainstorm solutions. Remember, though, that this can be the start of the conversation, not the end.\n\nIf you hit on an issue that requires more conversation than you can fit in, make a plan to follow-up through email, phone or another one-on-one meeting in the coming days. (Ask the teacher what their preferred method of communication is, and follow their lead on that.) This isn’t your only opportunity to talk to your child’s teacher for the rest of the school year.\n\nAlso, there’s already someone waiting in the hallway for their own speed-conference to begin. Don’t be the parent who throws off the timing of the next ten meetings.", "description": "Parent-teacher conferences are the speed-dating of the education world. You sign up for a 10-minute slot (15 if you’re lucky), the teacher pulls out a timer, and away you go. How are his reading skills progressing? Is she doing ok with transitions? Have you noticed an issue between him and Brayden? You. Better....", "authors": ["Brendan Hesse", "Chris Jager"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/oky1moyaa7hmvjmzurml.jpg", "published_at": "2019-09-08"}