{"pub": "indiatimes", "url": "https://timesofindia.indiatimes.com/blogs/generals-jottings/naga-peace-process-flounders-yet-again", "downloaded_at": "2019-10-27 11:57:43.204772+00:00", "title": "Naga peace process flounders yet again", "language": "en", "text": "Light at the end of long and seemingly endless tunnel has faded, yet again, primarily due to obstinacy of the main stumbling block, Naga Socialist Council of Nagaland (Issac-Muivarh) faction. The resolution of conflict, which appeared to be in striking distance, under designated interlocutor as governor and stipulated deadline of October 31, now seems remote. In all probability, talks, notwithstanding, consensus among most parties, will get extended. NSCN (IM), mother of insurgent groups in North East (NE) has the dubious distinction of being the most organised rebel group. Its functioning is comparable with organised armies when it comes to organisation, discipline and even documentation. Group’s diktats, termed as ‘Azhas’ are dreaded like ‘Taliban firmans’. This powerful group acts as catalyst for other rebel groups and fuels centrifugal forces. In fact, it is the biggest stumbling block to peace and security, essential pre-requisites for ‘Act East’ policy.\n\nThe group runs well-organised extortion racket, which is euphemistically called national tax, complete with demand notices and receipts. This network spans entire sphere of activities, including contracts, transportation, businesses extending to bureaucrats, police and politicians. According to estimates, group’s annual collection in 2008 exceeded Rs 630 million ($14.6 million). Although Nagaland is exempted from central taxes, parallel economy milks poor population to keep coffers of militias, overflowing. During demonetisation, NE was favourite destination for money launderers. It is time that extortion racket is dismantled.\n\nNaga insurgency has seen large number of twists and this longest separatist movement, despite multiple accords, defies solution. Naga separatism, traces origin to remarks of Mahatma Gandhi, during meeting with Phizo Angami and Naga leaders in July 1947, assuring them right of self-determination. Traditional tribal rights of Nagas were enshrined in Nine-point agreement, referred to as Naga-Akbar Hydari (Governor of Assam) of June 1947. Disregarding this accord, insurgency, started in early ’50s, drawing ready support, sustenance and sanctuary from erstwhile East Pakistan and China. Unfortunately, foreign Baptist organisations, NGOs and human right groups have been stoking the fires.\n\nThe salience and centrality of Nagaland can be gauged from the fact that its formation on December 1, 1963, virtually unleashed ‘domino effect’, leading to creation of seven sisters from undivided mother state of Assam. Each step in this convoluted process spawned competitive separatism. Having reached unmanageable number of states, it has morphed into creation of autonomous councils like Karbi-Anglong, Bodo, Kuki and Kachari. The trend of separatism across Brahmaputra stands in stark contrast to new approach of consolidation. These states continue to enjoy limited autonomy under Article 371, its sub-sections guaranteeing rights of tribal society across NE and even tribals in hinterland.\n\nPacts like Shillong Accord of 1975, as an inevitable corollary have unleashed radical elements leading to splintering of parent group. NSCN was created on trumped up platform of sell-out by Phizo Angami’s mother group of Naga National Council. Original movement initiated by 16 resident tribal groups of Nagaland, notably Angamis and Semas, has been hijacked by Tangkhuls, who inhabit Ukhrul region in Manipur. They effectively control entire IM faction, with token representation to Semas and Zeliangrongs. Considering their marginal demographic strength in Nagaland, they have anchored the demand for ‘Greater Nagalim’, extending to adjoining Naga inhabited areas. This obviously ruffles feathers in neighbouring Manipur, which once had Rishang Keishing, a Tangkhul, as CM for 11 years. Pragmatically, there can be Naga CMs in both states (at least periodically), instead of only one in Nagalim. The problem can be resolved by establishing statutory council to administer tribal rights with mandate extending to all Naga inhabited territories.\n\nOn the other extreme is Khaplang faction, led by Myanmar-based Heimi and Konyaks, who live in northern part of the state having kinship with the former. In effect, it has spawned counter movement for separate frontier or Eastern Nagaland province. This demand with ramifications on territorial integrity of neighbouring state, Arunachal and even Myanmar, is unlikely to be accepted. It is unfortunate that between Assam and Nagaland, there is still contested and unsettled Disturbed Area Belt (DAB), which witnesses sporadic violent incidents between police forces.\n\nMercifully, Nagaland has an officially declared cease-fire (CF) since 1997. CF was an erroneous nomenclature as it is normally between two sovereign nations. Continued reliance on vague terminologies like ‘unique history of Nagas’ and ‘shared sovereignty’ in Framework Agreement of 2014, has allowed IM faction to insist on separate flag and constitution. CF along with detailed ground rules and designated camps has proved inadequate to substantially defang capability of Naga army, which remains potent force. Naga society, meanwhile has got addicted to uneasy peace, hence return to insurgency seems unlikely. While, people are resigned to accept status-quo and agencies seem comfortable with marginal insurgency, but it stymies genuine economic integration of NE, making ‘Act East Policy’, virtually, non-starter.\n\nThe scope of consultation was extended to include six Naga National Political Groups resulting in signing of ‘Deed of Commitment’ in 2017. This apart, public, tribal bodies (Hoho) and church are enthusiastic about peace process but faction with its cohorts – Mothers Association, Student Hoho and Peoples Movement for Human Rights – is dragging its feet. It is as if the entire process is being held hostage to obduracy of NSCN (IM) denying Nagas well-deserved and much-delayed peace. It is time NSCN gives up chasing illusive sovereignty and symbols like flag and Nagas join mainstream for economic development.\n\n(The writer is former Army Commander, Western Command)", "description": "Light at the end of long and seemingly endless tunnel has faded, yet again, primarily due to obstinacy of the main stumbling block, Naga Socialist Council of Nagaland (Issac-Muivarh) faction. The resolution of conflict, which...", "authors": ["Lt General K J Singh"], "top_image": "https://timesofindia.indiatimes.com/blogs/wp-content/uploads/2017/12/kj-singh.jpg", "published_at": "2019-10-27"}