{"pub": "yahoo", "url": "https://news.yahoo.com/elizabeth-warren-declares-war-lobbying-112400418.html", "downloaded_at": "2019-09-21 07:15:29.532842+00:00", "title": "Elizabeth Warren Declares War on Lobbying, Hires Lobbyist One Day Later", "language": "en", "text": "Democratic presidential candidate Sen. Elizabeth Warren hired a Planned Parenthood lobbyist to a key role in her presidential campaign Tuesday, just one day after Warren announced a plan that would “end lobbying as we know it.”\n\nWarren unveiled an anti-corruption plan Monday that would introduce a “cooling off” period for lobbyists before they can serve in government roles and would prohibit active lobbyists from donating to political campaigns, a practice Warren called “legalized bribery.”\n\n“The fundamental promise of our democracy is that every voice matters,” Warren’s plan states. “But when lobbyists and big corporations can buy influence from politicians, that promise is broken. The first thing to do to fix it is to end lobbying as we know it.”\n\nThe next day, Kimberly Diaz Scott, who registered as a lobbyist for the Florida Alliance of Planned Parenthood Affiliates as recently as January 2019, announced that she was leaving the organization to head up Warren’s campaign in Florida.\n\n“I won’t be far from the movement, as I’m humbled and proud to announce my transition as the Florida State Director for Warren for President, assuring that we will continue to fight like hell to elect a brilliant leader who will work to protect the health, safety and future of ALL people,” Diaz wrote, the Miami Herald reported. “2020 is not for the rich or selfish, 2020 is for us.”\n\nDiaz first registered as a lobbyist for Planned Parenthood in 2015, according to Florida’s Lobbyist Registration Office.\n\nRead the original article.", "description": "Is she serious?", "authors": ["Andrew Kerr"], "top_image": "https://s.yimg.com/uu/api/res/1.2/55t4wgDioWmyIrKs5SUAuQ--~B/aD05NjA7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_national_interest_705/6b21b083689dcf55008e889d883ce43e", "published_at": "2019-09-20"}