{"pub": "independent", "url": "https://independent.co.uk/life-style/arnold-schwarzenegger-chris-pratt-jimmy-kimmel-interview-katherine-married-a9176061.html", "downloaded_at": "2019-10-29 15:11:46.077709+00:00", "title": "Arnold Schwarzenegger reveals how son-in-law Chris Pratt won him over in the gym", "language": "en", "text": "Arnold Schwarzenegger has revealed how his son-in-law, Avengers: Endgame actor Chris Pratt, won him over when the pair worked out together in the gym.\n\nIn June 2018, Pratt became romantically involved with author Katherine Schwarzenegger, the eldest child of Schwarzenegger and broadcast journalist Maria Shriver.\n\nThe couple announced their engagement in January this year, before marrying in June in California.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nOn Monday, Terminator: Dark Fate star Schwarzenegger appeared on the Jimmy Kimmel Live talk show, where he expressed how he feels about Pratt as his daughter’s husband.\n\nDescribing the 40-year-old as a “talented guy” and “a really kind man”, Schwarzenegger said the defining moment of their relationship came when they went to the gym together for the first time.\n\nThe 72-year-old explained that the Jurassic World star asked if they could work out with one another during their first ever face-to-face meeting, adding that Pratt said: “I need to have the inside scoop to pumping iron.”\n\n“So I took him to the gym and we worked out,” Schwarzenegger told Kimmel.\n\n“Pumping iron was the decision-making factor, absolutely. When I watched him make his moves in the gym, the incline press specifically did it, why I wanted him to become my son-in-law.”\n\nUpon finding out that his daughter was dating Pratt, Schwarzenegger said he felt “blown away” that she was seeing someone who is “bigger” and starring in “bigger movies” than him.\n\nShape Created with Sketch. Celebrity couples who met on film sets Show all 7 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Celebrity couples who met on film sets 1/7 Alicia Vikander and Michael Fassbender The couple met on the set of The Light Between Oceans Getty 2/7 Eva Mendes and Ryan Gosling The couple met on the set of The Place Beyond The Pines Getty 3/7 Penelope Cruz and Javier Bardem The couple starred in Jamon Jamon in 1992 and began dating in 2007 AFP/Getty Images 4/7 Jenna Dewan and Channing Tatum The couple met on the set of the 2006 film Step Up Getty 5/7 Blake Lively and Ryan Reynolds The couple met on set of the 2011 movie Green Lantern Getty 6/7 Miley Cyrus and Liam Hemsworth The teen couple met filming the 2010 film The Last Song Getty 7/7 Claire Danes and Hugh Dancy The couple met on the set of Evening in 2006 Getty 1/7 Alicia Vikander and Michael Fassbender The couple met on the set of The Light Between Oceans Getty 2/7 Eva Mendes and Ryan Gosling The couple met on the set of The Place Beyond The Pines Getty 3/7 Penelope Cruz and Javier Bardem The couple starred in Jamon Jamon in 1992 and began dating in 2007 AFP/Getty Images 4/7 Jenna Dewan and Channing Tatum The couple met on the set of the 2006 film Step Up Getty 5/7 Blake Lively and Ryan Reynolds The couple met on set of the 2011 movie Green Lantern Getty 6/7 Miley Cyrus and Liam Hemsworth The teen couple met filming the 2010 film The Last Song Getty 7/7 Claire Danes and Hugh Dancy The couple met on the set of Evening in 2006 Getty\n\nThe former governor of California praised Pratt’s display of kindness towards his daughter stating that it is “the most important thing” for him.\n\n“He’s a really nice guy and he’s very talented. I get along with him really well,” Schwarzenegger said.\n\nIn June, Pratt shared a photograph from his nuptials on Instagram the day after the ceremony.\n\nRevealing that he and his bride both wore custom Giorgio Armani for their big day, he wrote in the caption that their wedding was the “best day” of their lives.\n\n“It was intimate, moving and emotional. We feel so blessed to begin this new chapter of our lives,” Pratt stated.\n\nPratt was married to actor Anna Faris from 2009 until 2018, with whom he has a seven-year-old son named Jack.", "description": "Arnold Schwarzenegger has revealed how his son-in-law, Avengers: Endgame actor Chris Pratt, won him over when the pair worked out together in the gym. In June 2018, Pratt became romantically involved with author Katherine Schwarzenegger, the eldest child of Schwarzenegger and broadcast journalist Maria Shriver.", "authors": ["Sabrina Barr"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/29/14/arnold-schwarzenegger-chris-pratt-0.jpg", "published_at": "2019-10-29"}