{"pub": "businessinsider", "url": "https://businessinsider.com/challenges-upheld-pacers-kings-get-calls-changed-in-india-2019-10", "downloaded_at": "2019-10-06 13:12:06.201235+00:00", "title": "Challenges upheld: Pacers, Kings get calls changed in India", "language": "en", "text": "Indiana Pacers player Myles Turner plays against Sacramento Kings at the NBA India Games 2019, in Mumbai, India, Saturday, Oct. 5, 2019. (AP Photo/Rajanish Kakade) Associated Press\n\nOfficially, it's an NBA first: Coaches successfully argued referees' calls Saturday.\n\nSacramento's Luke Walton became the first coach to win a challenge — a new option for coaches to use in the NBA this season — when he asked for a review of an out-of-bounds call during the third quarter of the Kings' game against the Indiana Pacers in Mumbai, India.\n\nReview showed that Walton was right and the Kings retained possession. About a minute later, Pacers coach Nate McMillan wanted a review of a goaltending call made against Indiana center Myles Turner — and he, too, was proved correct, resulting in a jump ball at midcourt instead of two points for the Kings.\n\nSo Mumbai becomes the answer to a trivia question — the site of the first successful NBA coaches' challenge. The Pacers and Kings wrapped up a two-games trip to India, the NBA's first two games played in that country, with Indiana winning 130-106 to complete a sweep of the series.\n\n\"Thank you India for allowing us the opportunity to make history...thankful to be a part of this moment,\" Sacramento's Richaun Holmes tweeted postgame.\n\nCoaches may challenge one call per game, provided what they're challenging meets certain criteria and if they have a timeout remaining. The timeout is charged if the challenge is unsuccessful, and the challenge isn't retained even if it results in a call being overturned.\n\nLater Saturday, the Los Angeles Lakers visit the Golden State Warriors in the first game at the new Chase Center in San Francisco. Orlando plays at San Antonio and Utah welcomes the Adelaide 36ers from Australia.\n\nPACERS 130, KINGS 102\n\nAlize Johnson scored 17 points to lead eight Pacers in double figures, and Indiana scored 46 points in the second quarter alone on the way to the easy win.\n\nAaron Holiday scored 16 and JaKarr Sampson 15 for the Pacers, who outrebounded Sacramento 51-35 and had 35 assists on 49 field goals.\n\nBuddy Hield scored 17 points and Marvin Bagley III finished with 15 for Sacramento.\n\n___\n\nMore AP NBA: /and", "description": "Officially, it's an NBA first: Coaches successfully argued referees' calls Saturday.", "authors": ["Tim Reynolds", "Associated Press"], "top_image": "https://www.businessinsider.com/public/assets/BI/US/og-image-logo-social.png", "published_at": "2019-10-05"}