{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/08/espns-scott-van-pelt-says-daniel-snyders-redskins-are-treadmill-nowhere", "downloaded_at": "2019-10-08 15:10:01.615855+00:00", "title": "ESPN’s Scott Van Pelt says Daniel Snyder’s Redskins are on ‘a treadmill to nowhere’", "language": "en", "text": "\n\n(Jonathan Newton/The Washington Post)\n\nThe Redskins were the talk of the NFL on Monday, and as has usually been the case throughout Daniel Snyder’s two decades of ownership, it was for all the wrong reasons. After Washington became the first team to fire its coach this season, the discussion turned to who Snyder might recruit to replace Jay Gruden, how the change will affect first-round rookie quarterback Dwayne Haskins’s development and what the Redskins must do to recapture the glory of their increasingly distant past.\n\nOn the same day that Redskins team president Bruce Allen declared that the culture of the organization was “actually damn good,” ESPN “SportsCenter” host Scott Van Pelt, who grew up in the D.C. area, offered a rebuttal. Perhaps no one articulated the state of a once-proud franchise and captured the frustrations of its fan base better.\n\n“As long as the song remains the same at the top, what’s ever going to be different?” Van Pelt asked during his “One Big Thing” segment on Monday night. “So far under Dan Snyder, the team has been coached by the respected coordinator, Norv Turner, the respected NFL head coach, Marty Schottenheimer, who won his last five to get to .500, only to be fired after one year to be replaced by the college guy, Steve Spurrier, who called in his resignation from the golf course. He was replaced by Redskins royalty, Coach Joe [Gibbs], who was under .500 and replaced by Jim Zorn, best described as the guy who would take the job. He went 12-20, just like Steve Spurrier. He was replaced by the coach who won Super Bowls elsewhere. Mike Shanahan got twice as long — 64 games, and he won twice as many games, 24. The symmetry’s astounding. He was replaced by the up-and-coming coordinator who was fired after the 0-5 start.”\n\nAs Van Pelt noted, that’s a coaching search Bingo for Snyder. Where’s Sherm Lewis when you need him?\n\n[Scott Van Pelt on the Redskins: Is anyone at Redskins Park listening?]\n\n“What’s left to try?” Van Pelt continued. “The only coach that didn’t have a losing record was Marty, and he was given exactly one year. It’s never the owner or the GM, it’s always someone else’s fault, and that is a two-decade summary of Dan Snyder’s ownership. So is the fact that FedEx Field has been co-opted by rival fan bases like an 82,000 seat banquet hall available for weddings, birthdays, bas mitzvahes or NFL games. The last four home games have been completely overrun by fans of the Eagles, Cowboys, Bears and Patriots. If not for them, it would have been mostly empty. The Redskins lost all of those games by a total of 79 points. Rock bottom isn’t a moment, it is a seemingly perpetual state, and I’ve been trying to find the parallel for the systemic collapse that has happened here, and I just cannot.\"\n\nEarlier Monday, on “The Dan Patrick Show,” Patrick called the Redskins’ fan base “one of the best in all of sports” and recalled how beloved the team was when he covered players such as Joe Theismann and John Riggins. Van Pelt remembers those days fondly, too, and Redskins’ ability to bring a city together.\n\n“Snyder grew up there, the same time I did, when Washington was winning three Super Bowls in less than a decade,” Van Pelt said. “They were a revered franchise that was so intricately woven into the culture of the region, they bridged the racial and socioeconomic differences, they brought together all of the DMV. Season tickets had a waiting list decades long; now you can’t give ‘em away. Those three hours on Sundays in the fall used to be off limits for anything other than Redskins games. Now they’re endured, if they’re acknowledged at all.”\n\n[Another Redskins coach fired, and his successor is already destined to fail]\n\nVan Pelt bemoaned the fact that former Redskins assistant coaches Sean McVay, Kyle Shanahan and Matt LaFleur are enjoying success as head coaches elsewhere. He wondered who would want the Redskins’ job given Snyder’s reputation as a meddlesome owner, alluding to reports that it was the owner’s decision to draft Haskins, despite the coaching staff’s reservations. Finally, Van Pelt took aim at Allen, who is 42-75 as an executive in Washington, but would have everyone believe the culture in Ashburn is “actually damn good.”\n\n“Imagine taking liberties with reality like that, selling that line and thinking anybody but you buys it,” Van Pelt said. “He wouldn’t have seemed less self aware had he shown up to the press conference nude. Mostly, this is just an accounting, a repeating of the facts that will continue unabated as long as things remain status quo. Nothing changes, because nothing ever does. It’s a treadmill to nowhere. That last part, that’s my opinion, and I’d love to be wrong. You want to bet against a couple decades?”\n\nOne Big Thing\n\nThe Redskins pic.twitter.com/tFXt0Q1UYT — Stanford Steve (@StanfordSteve82) October 8, 2019\n\nRead more on the Redskins:\n\nBruce Allen defends Redskins tenure, says ‘the culture is actually damn good’\n\nBill Callahan calls Redskins’ interim job ‘different territory’; won’t start Dwayne Haskins yet\n\nThe Redskins are starting over after firing Jay Gruden, but in what direction are they headed?\n\nPlayers react: ‘Sorry we couldn’t get the job done for you’\n\nHail or Fail: Jay Gruden’s final game as Redskins coach was another dud\n\nEven Tom Brady thought it was ‘ridiculous’ how many Patriots fans were at FedEx Field", "description": "The \"SportsCenter\" host doesn't expect anything to change in Washington as long as Daniel Snyder and Bruce Allen are in charge.", "authors": ["Scott Allen", "Reporter Covering D.C. Pro", "Local College Sports", "October At Am", "Scott Allen Has Written About The Capitals", "Nationals", "Redskins", "Wizards", "More For The Washington Post'S D.C. Sports Bog Since Before Joining The Post", "He Wrote About High School Sports For Usa Today"], "top_image": "https://www.washingtonpost.com/resizer/EIwkwnXn24wnrrliUKJOhMksH3I=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ERG7CJXF3AI6RBCJD7ZGGYE2GE.jpg", "published_at": "2019-10-08"}