{"pub": "yahoo", "url": "https://sports.yahoo.com/ben-roethlisbergers-annoyed-answer-to-antonio-brown-question-was-perfect-130113548.html", "downloaded_at": "2019-09-09 23:25:16.459382+00:00", "title": "Ben Roethlisberger's annoyed answer to Antonio Brown question was perfect", "language": "en", "text": "We’re all at a bit of Antonio Brown overload at this point.\n\nThe former Pittsburgh Steeler — and can we call him a former Oakland Raider if he never played a game for them? — has dominated the news for weeks. He’s either a petulant diva or a mastermind who orchestrated a never-before-seen string of drama to land on the New England Patriots, depending what you believe.\n\nScroll to continue with content Ad\n\n[Watch live NFL games on the Yahoo Sports app, here's how]\n\nDon’t worry, Ben Roethlisberger is sick of it too.\n\nBen Roethlisberger doesn’t want to talk about Antonio Brown\n\nRoethlisberger was all of us when he was asked about Brown landing on the Patriots after the Steelers’ 33-3 loss on Sunday night.\n\nReporter: \"Ben, your thoughts on Antonio Brown joining these guys now?\"\n\n\n\nBen Roethlisberger: \"Whatever.\" pic.twitter.com/vSziIW3oTz — ESPN (@espn) September 9, 2019\n\nThough, we know it’s not just “whatever,” as Ben said. It really is a big deal. If Brown can just play football (and this is far from a sure thing after all we’ve seen this summer), the Patriots might be unbeatable.\n\nStill, that Roethsliberger clip should sum up everyone’s feelings pretty well. You can’t blame him after Brown has taken shots at Roethlisberger through the offseason.\n\n‘Please don’t ever ask me about him again’\n\nRoethlisberger wasn’t the only one asked about Brown, who is the biggest story in the NFL right now. Bill Belichick refused to answer any Brown questions, because the transaction couldn’t be official until Monday.\n\nSteelers guard Ramon Foster was more verbose than Roethlisberger but had the same approach.\n\nStory continues\n\n“Please don’t ever ask me about him again,” Foster said, according to the Pittsburgh Post-Gazette. “I ask that respectfully.”\n\nFoster might not field any more questions on Brown, but Brown’s going to continue to dominate the headlines. Attention is a boomin’ as Brown would say.\n\nAntonio Brown agreed to join the Patriots after being released by the Raiders. (AP)\n\n– – – – – – –\n\nFrank Schwab is a writer for Yahoo Sports. Have a tip? Email him at shutdown.corner@yahoo.com or follow him on Twitter! Follow @YahooSchwab\n\nMore from Yahoo Sports:\n\n\n\n\n\n", "description": "Ben Roethlisberger wasn't in the mood to talk about Antonio Brown.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/uvlkm4NNQpRICV5LX7x3cw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/xs3AmcJJ2Nb3_p7kQQ6tUw--~B/aD0yNjY2O3c9NDAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/d51211b0-d301-11e9-bb7f-df3f0b38e50c", "published_at": "2019-09-09"}