{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/afp/article-7571083/Official-results-set-seal-outsiders-victory-Tunisia-polls.html", "downloaded_at": "2019-10-14 11:30:37.480278+00:00", "title": "Official results set to seal outsider's victory in...", "language": "en", "text": "Official results in Tunisia's presidential election set to be released Monday are expected to seal a landslide victory for conservative political outsider Kais Saied\n\nTunisia's electoral commission was expected to confirm Monday that voters gave conservative political outsider Kais Saied a sweeping mandate to be the next president, thanks largely to young people who flocked to his side.\n\nIn a contest that reflected Tunisia's shifting post-revolution political landscape, Saied, an independent, scooped up more than 70 percent of the vote, polls showed -- sweeping aside his rival, charismatic media magnate Nabil Karoui.\n\n\"He was elected very comfortably,\" political scientist Selim Kharrat said.\n\nWith his three million estimated votes, Saied won double that of all 217 lawmakers combined who were elected in October 6 general elections.\n\nThis win \"is a message to parliament,\" Kharrat added. \"Voters have opted for a plan to clean up politics, fight corruption, and give more power to local entities.\"\n\nOfficial results were set to be announced at 7:00 pm (1800 GMT), according to the electoral commission ISIE, which reported turnout was at least 58 percent, a steep rise from the first round.\n\nSaied, a retired law professor with a rigid and austere demeanour that earned him the nickname \"Robocop\", was carried to victory by young voters, wooed by his anti-establishment platform.\n\nAround 90 percent of 18- to 25-year-olds voted for Saied, according to estimates by the Sigma polling institute, compared with 49.2 percent of voters over 60.\n\nThousands of people took to the streets of the capital Tunis to celebrate Saied's victory, honking horns and singing the national anthem\n\nIn his first reaction, Saied thanked the country's young people \"for turning a new page\", and vowed to try to build \"a new Tunisia\".\n\nThousands of people took to the streets of the capital Tunis late Sunday to celebrate Saied's victory, honking horns and singing the national anthem.\n\n\"Kais Saied, voice of the people,\" a gathered crowd chanted. \"Long live Tunisia!\"\n\nThe runoff pitted Saied against another newcomer, businessman Karoui, who has been dubbed Tunisia's \"Berlusconi\".\n\nKaroui had been jailed for the majority of the campaign, only walking free on Wednesday after more than a month behind bars on suspicion of money-laundering. He has dismissed the charges as politically motivated.\n\n- 'Peaceful transition' -\n\nSaied and Karoui both trounced the old guard in a September 15 first round, highlighting voter anger over a stagnant economy, joblessness and poor public services in the cradle of the Arab Spring.\n\nThe country's high unemployment rate disproportionately affected young graduates, fuelling their calls for political change.\n\nThe poll, Tunisia's second free presidential election since its 2011 revolt, followed the death of president Beji Caid Essebsi in July.\n\nSaied, a 61-year-old constitutional law expert, campaigned on the values of the 2011 revolution, based on opposition to Westernised and corrupt elites, and in favour of radical decentralisation.\n\n\"Tunisians were looking for integrity\", said newly elected conservative lawmaker Lotfi Mraihi.\n\nHe supported Saied because he thought he embodied \"the will to cut ties with the old system and to revive the hope that had been buoyed by the revolution\".\n\nResults of the second round of Tunisian presidential elections based on exit polls\n\nTunisians took to social media, many voicing pride in a successful democratic process.\n\n\"Congratulations to Tunisia... for showing a continued commitment to resolving differences via peaceful transitions,\" said H.A. Hellyer, a senior fellow at the Royal United Services Institute in London, in a tweet.\n\nThe Islamist-inspired Ennahdha party, which won the most seats in parliament in the general elections, had called on supporters to back Saied.\n\n- Sharp contrast -\n\nWhile the candidates were both seen as anti-establishment figures, the contrast between them was sharp.\n\nA social conservative, Saied has defended the death penalty, criminalisation of homosexuality and a sexual assault law that punishes unmarried couples who engage in public displays of affection.\n\nKaroui presented himself as a candidate for the poor whose appeal stemmed largely from his media empire and philanthropic activity.\n\nWhile his arrest cemented his outsider status, he had been a longtime key supporter of president Essebsi, with ties to the political establishment.\n\nFor Kharrat, what set the two finalists apart was primarily a difference of \"moral principles\".\n\n\"Karoui represents a leading political class that is dishonest and uses money for its own personal interests,\" he said.\n\nKaroui however called the election result a \"denial of justice\", saying he had been penalised by his incarceration.", "description": "Tunisia's electoral commission was expected to confirm Monday that voters gave conservative political outsider Kais Saied a sweeping mandate to be the next...", "authors": [], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/12/wire-19689772-1571052166-265_636x382.jpg", "published_at": "2019-10-14"}