{"pub": "dailybeast", "title": "Why Did Saint Peter Paralyze His Own Daughter?", "url": "https://thedailybeast.com/why-did-saint-peter-paralyze-his-own-daughter", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:00:06.042078+00:00", "text": "If you asked someone to think of St. Peter they’d probably tell you that he was an apostle, a close confidant of Jesus, the first pope, and a martyr. They might mention the idea that when you die, he’s the person who opens up the pearly gates of heaven to you and decides whether or not you can come in. Not many people could tell you that Peter was married and even fewer that he had a child. Hardly anyone could tell you about the ancient Christian tradition that Peter had a daughter that he deliberately paralyzed.\n\nThe idea that Peter was married is in the New Testament itself. According to Mark, Jesus healed Peter’s mother-in-law in Capernaum. We don’t hear anything about Peter having children in the New Testament but there’s no reason to think that he didn’t.\n\nWe don’t know much about Peter’s activities after the death of Jesus from the New Testament, but a second century apocryphal text called the Acts of Peter attempts to fill in the gaps. As Tony Burke, professor of early Christianity at York University and co-editor of New Testament Apocrypha, told the Daily Beast the composition of this story was part of a trend “around the end of the second century, imaginative writers created these texts to fill a need to learn more about these iconic figures. They probably drew on some older traditions, but the finished texts promote a rigid ascetic lifestyle popular among early Christian groups.”", "description": "It is a tale so full of shocking turn after shocking turn, it's no surprise it's not commonly known.", "authors": ["Candida Moss"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1567266225/190830-moss-st-peter-petronilla-hero_fiwxrg"}