{"pub": "businessinsider", "url": "https://businessinsider.co.za/eskom-coo-jan-oberholzer-staff-municipal-debt-eskom-savings-2019-10", "downloaded_at": "2019-10-25 16:36:44.343962+00:00", "title": "Eskom doesn’t have money to fire staff, its COO says – here’s how it plans to cut R35 billion in expenses instead", "language": "en", "text": "Elvira Wood\n\nEskom COO Jan Oberholzer said Eskom doesn’t have enough money to pay severance packages to reduce its staff, Beeld reported.\n\nHe said Eskom should instead relook at suppliers and coal suppliers which can save it R35 billion a year.\n\nEskom has debt of over R400 billion, and posted a R20.7 billion loss in 2019.\n\nFor more stories go to www.BusinessInsider.co.za.\n\nPower utility Eskom does not have enough money to pay severance packages to reduce its bloated staff, Chief Operations Officers (COO) Jan Oberholzer told Beeld.\n\nState-owned Eskom posted a loss of R20.7 billion for the 2019 financial year, the Daily Maverick reported in July. Municipal debt owed to Eskom is roughly R20 billion\n\nThe embattled power utility, with an overall debt of over R400 billion, is set to receive a state bailout of R59 billion from the National Treasury to keep doors open.\n\nEskom, for the first time since March, implemented loadshedding stage 2 last week, which Bloomberg reported cost the country 0.1% economic growth in a week.\n\nSpeaking to Beeld, Oberholzer said despite not having money to cut staff, cutting staff would at most save the company R7 billion a year.\n\nIt will also have a bad impact on the economy to have an additional 10,000 to 15,000 people unemployed.\n\nBloomberg reported that Eskom employs over 44,000 people, up from the 30,000 people at the company when Oberholzer started there 11 years ago.\n\nHe believes the company can save R10 billion a year by relooking at purchase agreements, and R25 billion in relooking at coal purchase agreements.\n\nThe unsuccessful turnaround of Eskom is one of the biggest threats to rating agency Moody’s downgrading the sovereign, Fin24 reported.\n\nThe power utility has been without a CEO since July when former CEO Phakamani Hadebe resigned.\n\nFinance minister Tito Mboweni, who is set to give the medium-term budget statement next week, said Eskom will get a CEO “very soon”, Fin24 reported.\n\n(compiled by James de Villiers)\n\nReceive a daily email with all our latest news: click here.", "description": "Eskom has debt of over R400 billion, and posted a R20.7 billion loss in 2019.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/6947/7ffe01d48ac648e7bcd92d8ca9250397.jpg", "published_at": "2019-10-25"}