{"pub": "morningstar", "url": "https://morningstar.com/articles/949222/this-fund-is-better-than-it-looks", "downloaded_at": "2019-10-18 11:05:07.745503+00:00", "title": "This Fund Is Better Than It Looks", "language": "en", "text": "The following is our latest Fund Analyst Report for Artisan Value Investor (ARTLX.) Morningstar Premium Members have access to full analyst reports such as this for more than 1,000 of the largest and best mutual funds. Not a Premium Member? Gain full access to our analyst reports and advanced tools immediately when you try Morningstar Premium free for 14 days.\n\nDespite a recent slump, Artisan Value’s experienced team and disciplined approach merit a Morningstar Analyst Rating of Bronze.\n\nTwo longtime comanagers have retired in recent years, but this fund retains plenty of veteran talent. Team founder Scott Satterwhite retired in 2016; comanager George Sertl followed in 2018. Lead manager Jim Kieffer remains, however, as do two longtime team members. Kieffer has managed this fund since its 2006 launch and worked with Satterwhite before joining Artisan in 1997. Comanager Dan Kane joined in 2008, while Craig Inman, a comanager since February 2019, joined as an analyst in 2012. Seasoned investor Tom Reynolds joined from Perkins Investment Management in 2017.\n\nThis fund’s approach can cause it to stand out from the pack, for better or worse. The team prefers firms with sustainable returns on capital that are in sound financial condition and that look cheap by a variety of valuation methods, including price multiples, sum-of-the-parts analyses, and prior transaction multiples. Its high-conviction approach can stray from the index and typical peer. The fund has been light on traditionally defensive sectors owing to lofty valuations. Consumer staples, utilities, and healthcare accounted for 28.6% of the Russell 1000 Value Index but just 10.2% of this fund as of June 2019. The managers have found value in economically sensitive fare such as technology and materials instead. While its valuation-sensitivity hasn’t always paid off, they have shown patience when their approach is out of favor. Beaten-down cyclical names were among the fund’s top contributors in 2016’s value-favoring market.\n\nFrom its March 2006 inception through September 2019, the fund’s 6.7% annualized return topped the typical large-value Morningstar Category peer's 6.2% gain but lagged the Russell 1000 Value Index’s 6.9%. It trailed more than 90% of peers in each calendar year from 2013 through 2015 as its materials and energy picks sank.\n\nAssociate analyst Nick Watson contributed to this report.\n\nPerformance | Neutral\n\nA stretch of underperformance has made this fund’s record look average since inception. It warrants a Neutral Performance rating.\n\nFrom its March 2006 launch through September 2019, the fund’s 6.7% annualized return topped the typical large-value fund’s 6.2% gain but lagged the Russell 1000 Value Index’s 6.9%. It was slightly more volatile than the typical peer and index during that period.\n\nA contrarian approach and stock selection mistakes have caused this fund to sharply lag peers at times. It trailed more than 90% of its peers in each calendar year from 2013 through 2015 as its basic materials and energy picks sank. Oil and natural gas company Devon Energy (DVN) and mining company Kinross Gold (KGC) were among the leading detractors over the period. The team is willing to be patient with beaten down names if its theses still hold, and that paid off in 2016’s value-favoring market. The fund beat 99% of its peers as a number of its basic materials and energy picks, Devon and Kinross included, rebounded.\n\nSince the start of 2016, the fund’s 11.9% return has topped the Russell 1000 Value Index’s 10.2% and the typical large-value fund’s 9.7%. It has still been prone to look out of step, though. It lost more than 6 percentage points more than the index in 2018’s fourth quarter pullback as a handful of its cyclical picks sold off.\n\nPrice | Neutral\n\nThis fund's middling fees warrant a Neutral Price rating.\n\nThe Institutional share class is the largest at just over 40% of assets. It charges 0.80%, compared with the 0.72% median for similarly sold peers. The Investor share class is the next-largest, and its 1.02% expense ratio is higher than the 0.88% peer median. The Advisor share class is more expensive than its typical peer by a similar margin.\n\nProcess | Positive\n\nThis fund’s consistent, valuation-sensitive approach earns a Positive Process rating.\n\nThe managers look for large- and mid-cap firms trading at discounts to their estimated values. They prefer firms with sustainable returns on capital and sound finances. The portfolio tends to have a higher average return on invested capital and a lower debt/capital ratio than the Russell 1000 Value Index and median large-value peer.\n\nThe managers work collaboratively to identify firms that fit their criteria. They use valuation and profitability screens to narrow a universe of companies above $2 billion in market cap, though paying attention to corporate actions such as mergers and spin-offs is also a source of ideas. They prefer stocks that look cheap by a variety of methods including price multiples, sum of the parts analyses, and prior transaction multiples. Each holding has a lead researcher, but much of the process involves ongoing debate between team members.\n\nThis fund typically holds 30-40 names, and its high-conviction approach can look out of step at times. The managers have tended to think valuations for stable fare are lofty and have favored cyclical sectors for most of the fund’s history. That hasn’t always paid off, but they have shown patience when their approach is out of favor. Beaten-down cyclical names were among the fund’s top contributors in 2016’s value-favoring market.\n\nThis concentrated portfolio stands out from the Russell 1000 Value Index. As of June 2019, its largest sector overweightings were in tech, communication services, and materials. Those sectors accounted for 41% of the fund’s assets versus 18.5% for the index.\n\nThe fund had underweightings to traditionally defensive sectors such as consumer staples, utilities, and healthcare--in total, 10.2% of the fund’s assets compared with 28.6% for the index. The managers think those sectors' valuations are lofty and see better value in economically sensitive fare. That said, the fund has recently pared the energy overweighting it had maintained since 2016, when the managers saw a drop in crude oil prices as an attractive buying opportunity. Recently, they sold exploration and production firms such as Hess Corp (HES) and Occidental Petroleum (OXY) on concerns about secular shifts in the industry.\n\nDespite the managers' valuation sensitivity, they have a few big positions in growth stocks. They bought Facebook (FB), for example, as its valuation fell in early 2018, because they liked its solid balance sheet and attractive business economics. They’re comfortable holding on to winners if their theses still hold. Longtime holdings Alphabet (GOOG) and Apple (AAPL), for example, remain top positions because they argue both names are still undervalued relative to the strength of their competitive advantages.\n\nPeople | Positive\n\nDespite comanager turnover in recent years, this team remains capable and experienced. It merits a Positive People rating.\n\nOnly one of the three portfolio managers from its 2006 inception remain, but the fund is still well-staffed. Team founder Scott Satterwhite retired in 2016, and comanager George Sertl retired in 2018. Lead manager Jim Kieffer remains and anchors the team. He had worked with Satterwhite since 1989, and the two generated a fine track record at Biltmore Special Values in the 1990s. Two longtime team members also remain: Dan Kane, a team member since 2008 and comanager since 2012, and Craig Inman, a team member since 2012 and comanager since February 2019. Both arrived with several years of experience. The team hired a less experienced analyst, Maxwell Kiely, from FPA in late 2018 following a previous analyst’s departure.\n\nThe team also added seasoned investor Tom Reynolds from Perkins Investment Management in 2017 to reinforce the squad after Satterwhite and Sertl’s retirements. Reynolds posted a solid track record as one of three comanagers on Janus Henderson Small Cap Value JDSAX between 2013 and 2017. He’s still based in Chicago with another Artisan team, instead of in Atlanta with this one. Though he's meshed well with teammates so far, it's an unusual arrangement.\n\nParent | Positive\n\nArtisan’s autonomous team model has proved effective at attracting and retaining top investment talent. Eric Colson, who has been CEO since 2010, gives managers substantial freedom to execute their investment philosophies and structure their teams. As of August 2019, the firm had approximately $112 billion under management across nine teams. Performance across the lineup has been strong. Of the 11 strategies that have at least a 10-year track record, nine have beaten their benchmarks since inception.\n\nThree teams have joined since early 2014, and two of those reflect the firm's broadened lineup, which previously focused strictly on equities: One invests in high-yield debt, while another runs a thematically driven alternatives strategy. The third is an emerging-markets equity team, which further rounds out its equity offerings.\n\nArtisan has so far demonstrated a sound record of closing funds to preserve their flexibility and limit the chances of hurting performance. Two of the firm's 15 funds are closed to new investors, and five others have been closed in the past. Three were reopened between 2018 and 2019 after consecutive years of outflows.\n\nFees are a weakness here. On average, Artisan’s funds rank in the 73rd percentile relative to similarly distributed peers. Despite generally strong performance, the current market environment suggests that low fees are a competitive advantage.", "description": "Bronze-rated Artisan Value practices a valuation-sensitive, consistent approach that stands out from the pack.", "authors": [], "top_image": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blt449bfc4a860d66a6/5cf68f9f592114fc054aa4d1/Rating_Fund_1x1.svg", "published_at": "2019-10-17"}