{"pub": "fox", "url": "https://foxnews.com/entertainment/kim-shattuck-dead-the-muffs-singer", "downloaded_at": "2019-10-03 23:30:19.659938+00:00", "published_at": "2019-10-03", "title": "The Muffs singer Kim Shattuck dead at 56", "language": "en", "text": "Kim Shattuck, singer and guitar player for the legendary Los Angeles punk band The Muffs, died on Wednesday at the age of 56.\n\nThe musician's husband, Kevin Sutherland, confirmed the news on social media.\n\nShattuck had been battling ALS.\n\nJESSYE NORMAN, OPERA LEGEND, DEAD AT 74\n\n“This morning the love of my life Kim passed peacefully in her sleep after a two year struggle with ALS,\" he wrote on Instagram.\n\n\"I am the man I am today because of her. She will live with all of us through her music, our shared memories and in her fierce creative spirit. I love you forever my Kimmy. Thank you for sharing your life,” he added.\n\nShattuck's fellow band member, Melanie Vammen, also paid tribute to her on social media.\n\n“My heart is forever broken,” she wrote.\n\nLEGENDARY MEXICAN SINGER JOSÉ JOSÉ DEAD AT 71\n\nThe Muffs’ Ronnie Barnett and Roy McDonald honored Shattuck's memory on Facebook. “We are very sorry to announce the passing of our bandmate and dear friend Kim Shattuck.\"\n\n“Besides being a brilliant songwriter, rocking guitarist and singer/screamer extraordinaire, Kim was a true force of nature. While battling ALS, Kim produced our last album, overseeing every part of the record from tracking to artwork. She was our best friend and playing her songs was an honor. Goodbye Kimba. We love you more than we could ever say.”\n\nThe Muffs released four albums in the '90s that put them on the punk and indie rock map, but it was their rendition of Kim Wilde’s 1981 hit “Kids in America,” which was featured in the movie “Clueless,\" that became their most popular song.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nThe Muffs released their first album in 1993, along with five other albums over the following 20 years.\n\nThe band's next album, titled “No Holiday,” will be released in October.", "description": "Kim Shattuck, a singer-songwriter, had died at the age of 56.", "authors": ["Jessica Napoli"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/kimshattuck.jpg"}