{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7598541/Brody-Jenner-Liam-Hemsworth-like-brothers-exes-fling.html", "downloaded_at": "2019-10-22 13:52:09.570834+00:00", "title": "Brody Jenner and Liam Hemsworth are 'like brothers' after their exes' fling", "language": "en", "text": "Brody Jenner and his wife, Kaitlynn Carter, called it quits in August, the same month Liam Hemsworth and Miley Cyrus announced their separation.\n\nAnd the former Hills star, 36, said on Australian radio this week that he and Liam, 29, are 'like brothers' now that their exes have hooked up.\n\nBrody, who will perform a DJ set at the Cox Plate horse race on Saturday, told Smallzy's Surgery that he may catch up with the Hunger Games star when he visits Byron Bay.\n\nBonding experience: Brody Jenner (pictured) says he and Liam Hemsworth are 'like brothers' after their exes, Kaitlynn Carter and Miley Cyrus, had a short-lived romance\n\nRadio host Kent 'Smallzy' Small suggested that Brody visit the famous Byron Bay mansion owned by Liam's older brother, Chris Hemsworth, when he's in town.\n\nBrody then segued into a discussion about Liam and how their exes' fling brought them together, saying: '[He] and I are like brothers nowadays!'\n\n'I'll hit Liam up when I'm down there for sure,' he added.\n\nThey have a lot to discuss! Brody told Australian radio program Smallzy's Surgery that he may catch up with Liam (pictured) when he visits Byron Bay in the coming weeks\n\nLove square: Brody and his wife, Kaitlynn (left), called it quits in August, the same month Liam and Miley (right) announced their separation. Following their respective break-ups, Miley and Kaitlynn began dating\n\nBrody also revealed that he will be spending three days on the Gold Coast in the Coolangatta area after his Cox Plate performance.\n\n'I kind of grew up there as a kid, I spent so much time there with the Mad Hueys and that whole group of guys down there,' he said.\n\n'Some really close friends of mine, they're like brothers to me. Any time that I get off in Australia that's free, it's definitely spent down in that area.'\n\nGirls' gone wild! Miley and Kaitlynn began publicly dating around August, but they had ended things by late September. Pictured in Italy in August\n\nSoon after announcing their respective splits around August, Miley and Kaitlynn began publicly dating - but they had ended things by late September.\n\nAt the time, a source told People magazine that Miley '[didn't] want a serious relationship' and instead wanted 'to focus on her career'.\n\nThe Wrecking Ball hitmaker is now dating Australian songwriter Cody Simpson.\n\nAfter keeping a low profile since his marriage breakdown, Liam was recently seen kissing Dynasty star Maddison Brown, 22, in New York City.\n\nMeanwhile, Brody has since moved on with Playboy model Josie Canseco, also 22.", "description": "Brody Jenner and his wife, Kaitlynn Carter, called it quits in August, the same month Liam Hemsworth and Miley Cyrus announced their separation.", "authors": ["Alisha Buaya For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/01/20014548-0-image-a-70_1571705598094.jpg", "published_at": "2019-10-22"}