{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/lazio-fans-make-fascist-salute-20718359", "downloaded_at": "2019-10-25 00:48:35.727941+00:00", "title": "Lazio fans make fascist salute as they march through Glasgow ahead of Celtic match", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA group of Lazio football fans were caught on camera performing a fascist salute as they marched through Glasgow ahead of their Europa League clash with Celtic .\n\nThe Italian Serie A side are already on a final warning from UEFA after they made a similar gesture during their previous European game versus French side Rennes.\n\nIn the video posted on Twitter , the fans can be seen clad in black, singing as they march through the Scottish city.\n\nPassers-by stop to see what the noise is all about as some of Lazio supporters raise their hands in what is a clear salute.\n\nIt is not just one fan out of the group, but the vast majority who take part in performing the gesture.\n\nPrior to the game Lazio security manager, Nicolo D'Angelo, has urged supporters to refrain from such gestures while on their travels.\n\n\"Unfortunately, we still have a minority of fans who believe it's acceptable to give the Roman Salute and to make racist comments,\" he said.\n\n\"We have repeatedly told them we have zero tolerance for this behaviour.\n\n\"The image of Lazio abroad is very important to us. It counts a lot to us. Our credibility is on the line.\n\n(Image: ROBERT PERRY/EPA-EFE/REX)\n\n\"When UEFA punish us, they are punishing our thousands of well behaved fans.\"\n\nA Celtic club statement said: \"Scottish law punishes any act of violence, racism, xenophobia and intolerance, especially during sporting events.\n\n\"We therefore appeal to the civic sense of the fans to avoid behaviour that can generate reactions from local authorities.\n\n\"In the same way, Lazio supporters are invited not to fall into provocations and not to provoke away fans in order to avoid putting at risk the safety and security of all the spectators present.:\n\nThe Curva Nord section of their Stadio Olimpico will be closed when Celtic visit Rome in the reverse fixtures thanks to previous offences, though Lazio have appealed this decision.", "description": "Lazio are already on their final warning from UEFA after sections of their fans made similar gestures in their previous Europa League game", "authors": ["Joe Cooper", "Image", "Robert Perry Epa-Efe Rex"], "top_image": "https://i2-prod.mirror.co.uk/sport/article20718437.ece/ALTERNATES/s1200/0_Screen-Shot-2019-10-24-at-204251.jpg", "published_at": "2019-10-24"}