{"pub": "breitbart", "url": "https://breitbart.com/news/aussie-scheme-lets-cricketers-bat-on-after-having-kids", "downloaded_at": "2019-10-11 00:29:03.089404+00:00", "title": "Aussie scheme lets cricketers bat on after having kids", "language": "en", "text": "Sydney (AFP) – Cricket Australia unveiled a “game-changing” parental leave scheme Thursday designed to let players in its history-making women’s team remain in the game while raising a family.\n\nThe policy includes 12 months’ paid parental leave for players who give birth and a guaranteed contract extension for the following season so they know they can return to the sport.\n\nCricket Australia said it had been working on the policy with players and the Australian Cricketers Association for three years.\n\n“(It is) a world-leading parental leave policy providing all professional players peace of mind when starting a family,” it said.\n\nWhile primarily aimed at female players, the policy also includes provisions that will be available to men, including three weeks’ paid parental leave.\n\nAustralia wicketkeeper-batter Alyssa Healy said it would make a huge difference for women players, allowing them to care for a child and still participate in the game.\n\n“The policy is a game-changer for players planning for the future while providing job security,” she said.\n\nUnder the scheme, women who fall pregnant can transfer to a non-playing role until they give birth and they can return at any time after having a child, subject to medical clearance.\n\nIn addition to the paid leave and contract certainty, they will also receive travel support if they are the child’s primary carer.\n\nAustralia’s female cricketers received a huge pay boost in 2017 and the national women’s team is currently on a high, posting a record-breaking 18th consecutive one-day international win this week against Sri Lanka.", "description": "Sydney (AFP) – Cricket Australia unveiled a “game-changing” parental leave scheme Thursday designed to let players in its history-making", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/10/e8ee89_australian-team-celebrates-winning-international-cricket-council-women-640x335.jpg", "published_at": "2019-10-10"}