{"pub": "metro", "url": "https://metro.co.uk/2019/10/16/boris-johnson-will-ask-brexit-extension-weekend-cant-get-deal-10927961", "downloaded_at": "2019-10-16 13:50:47.681690+00:00", "title": "Boris Johnson 'will ask for Brexit extension' if he can't get a deal", "language": "en", "text": "Boris Johnson will comply with the Benn Act, his Brexit secretary said (Picture: Getty)\n\nBoris Johnson will write to the EU and request an extension until January if he cannot get a deal agreed by the weekend, the Brexit secretary has said.\n\nStephen Barclay said the prime minister will adhere to the terms of the Benn Act which would see him send a letter on Saturday if he fails to secure an agreed plan for leaving the EU.\n\nThe PM has just hours before the start of a crucial EU summit in which to get a deal agreed with Brussels before he hopes to bring it back to MPs during an emergency meeting of Parliament in the House of Commons this weekend.\n\nMr Barclay said a new political declaration – a legal document setting out the framework for the UK’s future relationship with the European Union – has been submitted to the EU, as the clock ticks down towards an 11th hour deal.\n\nAdvertisement\n\nAdvertisement\n\nSpeaking this morning before the Brexit committee, he said changes to the Irish backstop meant it necessarily followed that ‘there would be changes to political declaration’.\n\nHe said: ‘We have submitted draft text as part of the negotiations on a number of aspects under discussion.’\n\nBrexit secretary Stephen Barclay said a new political declaration has been submitted to Brussels (Picture: AFP)\n\nMr Barclay did not confirm whether MPs will get to see the new political declaration if and when a meaningful vote is brought in the Commons.\n\nHe also told committee chair Hilary Benn that the government ‘will comply with what is set out’ in legislation named after the pro-Remain Labour MP.\n\nMr Benn said he would take that as confirmation the Prime Minister will send a letter requiring an extension.\n\nUnder the terms of the Benn Act it would mean extension until 31 January 2020.\n\nBut Mr Barclay insisted the government was still committed to leaving on 31 October and when asked how he was planning to do so, responded: ‘We will cross that bridge when we come to it.’\n\nEU chief Brexit negotiator Michel Barnier looking tired after late night Brexit negotiations (Picture: AP)\n\nInstead, he said the government is still ‘confident’ it can deliver the legislation needed to confirm an EU-UK deal by 31 October and told MPs the Benn Act had been ‘unhelpful’ to negotiations in Brussels.\n\nThe Secretary of State said: ‘I think it has been unhelpful to the negotiations, absolutely.\n\n‘But I think what is recognised, both in the EU and the UK, that the time is now for a deal. The teams are working extremely hard to take that forward.’\n\nAdvertisement\n\nAdvertisement\n\nLeader of the House, Jacob Rees-Mogg, is expected to set out the order of business for Saturday’s emergency meeting tomorrow before it is voted upon by MPs.\n\nDuring the weekend session, MPs would be able to back or reject any deal presented to them, or discuss what to do next in the Brexit saga.\n\nTuesday’s Brexit talks in Brussels ran into the small hours of the morning with a Number 10 source saying progress was still being made.\n\nReports had suggested a deal was close ahead of a midnight deadline imposed by the EU, with the PM said to be making major concessions on the Irish border.\n\nBut sources on both sides of the Channel downplayed the suggestions and Mr Johnson’s official spokesman said: ‘Talks remain constructive but there is more work still to do.’\n\nThe PM is expected to update his Cabinet on progress in the negotiations on this afternoon.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Boris Johnson will write to the EU and request an extension until January if he cannot get a deal agreed by the weekend, the Brexit secretary has said. Stephen Barclay...", "authors": ["Zoe Drewett"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_89676623-e1571218959139_1571223873.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-16"}