{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/10/corey-lewandowski-accused-drunk-tv.html", "downloaded_at": "2019-10-03 23:36:18.099578+00:00", "published_at": "2019-10-03", "title": "Another Trump Defender Is Accused of Being Drunk on TV", "language": "en", "text": "“Corey, did you have a little Merlot with dinner?” Photo: Screenshot via Fox Business\n\nIn an interview Wednesday night with Corey Lewandowski, Fox Business host Kennedy kept a straight face for about two and a half minutes. She praised the former Trump campaign manager for his recent tantrum at a congressional hearing and set him up to insult House Intelligence Committee chairman Adam Schiff. But as Lewandowski continued slurring words and garbling his pronunciation, she couldn’t let it go unremarked upon.\n\n“Corey,” Kennedy asked, “did you have a little Merlot with dinner?”\n\nLewandowski denied it, but the host didn’t let it go. “You sound a little slurry. You sound a little Biden-esque,” she said. Lewandowski was unfazed. He continued talking, calling Kennedy “Kenley” and referring to Ukraine’s president as “Salinsky” (his last name is actually Zelensky). That’s when Kennedy cut him off and suggested a “cup of coffee.”\n\nLast night on Fox Business, Corey Lewandowski looked so drunk that even the host asked him, \"did you have a little Merlot with dinner?\" pic.twitter.com/cvsBDztNUn — Bobby Lewis (@revrrlewis) October 3, 2019\n\nLewandowski, who is reportedly under consideration for a White House role to help Trump fight off impeachment, is the latest ally of the president’s to be accused of getting drunk before going on TV.\n\nBefore him, there was Trump’s personal lawyer, Rudy Giuliani, who’s spent the past couple weeks putting together a reel of increasingly unhinged TV appearances that have led to some to question his on-air sobriety. On MSNBC’s Morning Joe, Mika Brzezinski wondered “if there’s inebriation here” while discussing Giuliani’s 28-minute shouting match with CNN’s Chris Cuomo.\n\nBrzezinski’s MSNBC colleague Elise Jordan also cracked wise about Giuliani after the CNN interview, in which Giuliani denied asking the Ukrainian government to investigate Hunter Biden seconds before he confessed to doing exactly that. “It is just simply astounding to watch drunk grandpa last night,” she said.\n\nIt’s not just the MSNBC crowd wondering either. Sarah Longwell, publisher of the conservative website The Bulwark, wrote this week that the Trump administration should “[s]top putting Rudy Giuliani on television.” She continued:\n\nHe’s drunk. Or maybe just addled? I don’t know—but it doesn’t matter because he’s going to get you all sent to prison by reading text messages from State Department officials out loud on Laura Ingraham’s show. Go to the zoo. Find an adorable penguin. Put that little guy on instead.\n\nWhite House economic adviser Larry Kudlow has dealt with similar accusations over the past couple years. Last year, Kudlow slurred his way through attacks on Canadian prime minister Justin Trudeau on CNN, leading to accusations that he was drunk. It happened again last month, after Kudlow appeared on Fox News Sunday to deny that a recession is coming.\n\nDana talks with Larry Kudlow, White House Economic Adviser about a tax cut for the middle class \"There's a lot of good ideas to create more incentives to work, save and invest\" @larry_kudlow #FNS #FoxNews pic.twitter.com/PindlESTGL — FoxNewsSunday (@FoxNewsSunday) August 18, 2019\n\nSometimes, Trump lackeys arouse suspicion with more than slurred speech. Sam Nunberg, who briefly served as an adviser on the Trump campaign in 2016, smelled of booze during a spot on CNN last year. At least that’s what host Erin Burnett said. The interview came amid a media blitz that was widely labeled a meltdown and left Burnett sounding concerned.\n\n“You’ve done six interviews in the the past four hours,” she said. “‘Bizarre’ was a word that some White House officials were using to describe some of your interviews. ‘Nuts’ is another one … I reached out to a Trump ally to ask what you think about Sam and essentially this person told me … ‘You’re drunk or off your meds.’ At least half a dozen other CNN reporters have received similar messages.”\n\nAfter nearly 30 more minutes of talking, Burnett said flatly, “Talking to you, I have smelled alcohol on your breath.”\n\n“I have not had a drink,” Nunberg replied.\n\nErin Burnett to Sam Nunberg:\n\n\n\n\"I have smelled alcohol on your breath.\"pic.twitter.com/cledGLfXeV — JM Rieger (@RiegerReport) March 6, 2018", "description": "After a slurring his way through an interview, Corey Lewandowski left a Fox Business host wondering if he’d had “a little Merlot with dinner.” Trump defenders Rudy Giuliani, Larry Kudlow, Sam Nunberg have also been accused of on-air drunkenness.", "authors": ["Adam K. Raymond"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/10/03/03-corey-lewandowski-drunk.w1200.h630.jpg"}