{"pub": "independent", "url": "https://independent.co.uk/sport/general/boxing/marvelous-marvin-hagler-reflects-glorious-career-golden-age-a9126606.html", "downloaded_at": "2019-10-01 00:10:19.559794+00:00", "title": "Marvelous Marvin Hagler reflects on a glorious career from a golden age of boxing", "language": "en", "text": "In Glasgow, close to midnight on Sunday, 500 people listened in silence as Marvelous Marvin Hagler explained that there was never a time in his life when it was easy.\n\nHagler was the boxer nobody wanted to fight, the man the boxing authorities hoped would quit and the promoters - the men that had no chance of taming him - did their best to ignore. “You know,” Hagler said, “one time, Joe Frazier told me that there were three things going against me: one, I was black. Two, I was a southpaw. And three, I was good. He was right, it was never easy.”\n\nIn 1980, after defeats, robberies in the ring, fights as the outsider in hostile places, outrageous fortune and a violent siege at Wembley after he cut Alan Minter in three vicious rounds, Hagler was finally the world middleweight champion. It was his 54th fight and he had to leave the ring that shameful night at Wembley Arena under a makeshift umbrella of outstretched arms, as bottles and parts of seats were thrown at his bald head.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“Hey, I never got to celebrate - but it was only a tiny minority trying to kill me. The real fans loved me,” he added, picking up another wild cheer.\n\n“Why did it take me so long to win the title?” Hagler asked. “It was not my fault, they were scared. I was never scared, I just wanted to fight the best man. That is how you find out how good you are. I guess I was great.”\n\nShape Created with Sketch. September top 10 pound-for-pound boxers in the world Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. September top 10 pound-for-pound boxers in the world 1/11 Who is the best pound-for-pound boxer in the world? The ranking of The Independent's 10 best male boxers on the planet. Take a look through to see who comes out on top. AP 2/11 10. Manny Pacquiao (62-7-2) The Filipino looked sensational to outpoint Keith Thurman, flooring the American and rolling back the years at 40 years old to confirm himself as the No 3 welterweight in the world at worst. Considering the illustrious names on his resume, a place inside the top 10 pound-for-pound list and a world class win this year confirms his place here. AP 3/11 9. Juan Francisco Estrada (39-3-0) The two-weight world champion grabbed the lineal super flyweight title against Sor Rungvisai to snatch his pound-for-pound status and the WBC gold. Getty Images 4/11 8. Mikey Garcia (39-1-0) Despite coming up short against Errol Spence in their welterweight bout, Garcia is still a modern great as a four-weight world champion. Getty Images 5/11 7. Gennady Golovkin (38-1-1) Despite suffering the first loss of his career against Canelo Alvarez, Golovkin's stellar career keeps him in our rankings. Getty Images 6/11 6. Errol Spence (26-0-0) Spence beat Shawn Porter to unify the welterweight division as he goes in search of more belts. Danny Garcia looks set to be next. Getty Images 7/11 5. Oleksandr Usyk (16-0-0) The undisputed, undefeated, unified cruiserweight world champion moves up in weight, but injury has delayed his debut against Carlos Takam. Getty Images 8/11 4. Naoya Inoue (18-0-0) The man nicknamed the 'monster' destroyed Emmanuel Rodriguez in two rounds to win the IBF world bantamweight title, elevating his status as one of the world's most dangerous fighters. Getty Images 9/11 3. Terence Crawford (35-0-0) Another three-weight world champion, Crawford enters our top three and reaffirmed his place as one of the sport's greats after a knockout win against Amir Khan. Getty Images 10/11 2. Canelo Alvarez (52-1-2) One loss and a whole heap of controversy but Canelo's record is one to be celebrated, a three-weight world champion and still just 28. The biggest star in the sport and an impressive win over Daniel Jacobs cements his standing, arguably has a claim to the throne, but he just misses out here. Getty Images 11/11 1. Vasyl Lomachenko (14-1-0) There can only be one. The king of the amateur game has stepped up to become the king of the professionals. Just 15 fights into his career and despite one career defeat, the current unified lightweight world champion sets records for days. Loma won a world title in his third fight, became a two-weight champion in his seventh, and a three-weight champion in his twelfth fight. The king. Less magic against a brave Luke Campbell, but more brutality, slashing body shots and exquisite balance and movement. Who's next? Commey, Lopez, Davis? Getty Images 1/11 Who is the best pound-for-pound boxer in the world? The ranking of The Independent's 10 best male boxers on the planet. Take a look through to see who comes out on top. AP 2/11 10. Manny Pacquiao (62-7-2) The Filipino looked sensational to outpoint Keith Thurman, flooring the American and rolling back the years at 40 years old to confirm himself as the No 3 welterweight in the world at worst. Considering the illustrious names on his resume, a place inside the top 10 pound-for-pound list and a world class win this year confirms his place here. AP 3/11 9. Juan Francisco Estrada (39-3-0) The two-weight world champion grabbed the lineal super flyweight title against Sor Rungvisai to snatch his pound-for-pound status and the WBC gold. Getty Images 4/11 8. Mikey Garcia (39-1-0) Despite coming up short against Errol Spence in their welterweight bout, Garcia is still a modern great as a four-weight world champion. Getty Images 5/11 7. Gennady Golovkin (38-1-1) Despite suffering the first loss of his career against Canelo Alvarez, Golovkin's stellar career keeps him in our rankings. Getty Images 6/11 6. Errol Spence (26-0-0) Spence beat Shawn Porter to unify the welterweight division as he goes in search of more belts. Danny Garcia looks set to be next. Getty Images 7/11 5. Oleksandr Usyk (16-0-0) The undisputed, undefeated, unified cruiserweight world champion moves up in weight, but injury has delayed his debut against Carlos Takam. Getty Images 8/11 4. Naoya Inoue (18-0-0) The man nicknamed the 'monster' destroyed Emmanuel Rodriguez in two rounds to win the IBF world bantamweight title, elevating his status as one of the world's most dangerous fighters. Getty Images 9/11 3. Terence Crawford (35-0-0) Another three-weight world champion, Crawford enters our top three and reaffirmed his place as one of the sport's greats after a knockout win against Amir Khan. Getty Images 10/11 2. Canelo Alvarez (52-1-2) One loss and a whole heap of controversy but Canelo's record is one to be celebrated, a three-weight world champion and still just 28. The biggest star in the sport and an impressive win over Daniel Jacobs cements his standing, arguably has a claim to the throne, but he just misses out here. Getty Images 11/11 1. Vasyl Lomachenko (14-1-0) There can only be one. The king of the amateur game has stepped up to become the king of the professionals. Just 15 fights into his career and despite one career defeat, the current unified lightweight world champion sets records for days. Loma won a world title in his third fight, became a two-weight champion in his seventh, and a three-weight champion in his twelfth fight. The king. Less magic against a brave Luke Campbell, but more brutality, slashing body shots and exquisite balance and movement. Who's next? Commey, Lopez, Davis? Getty Images\n\nHagler had been a professional boxer for eight years when he became champion.\n\nOnce Hager won the title he had one of the last great, dignified and honest reigns as world champion in a sport now so horribly diluted with endless opportunities that it would be virtually impossible to repeat his achievements. Sadly, in the modern sport the greatest rivalries are between television companies and the promoters they employ to deliver the fights, and not the boxers. It means that the agendas - often understandable because of the vast financial investment - of warring men on the safe side of the ropes helps to keep boxers apart.\n\nThat is modern time, not Hagler’s time. “I had to beat and keep on beating my number one contender - that is how it should be; one man, one champion. That man was me,” he said, another great cheer rattling the chandeliers.\n\nIn recent years the Kazakh, Gennady Golovkin, held several versions of the middleweight championship and during his eight-year reign nearly 20 men also had a claim to be “world middleweight champion” after winning a piece of the title. Hagler was undisputed champion, nobody else held a version of his title, the public would have simply rejected the blatant chicanery at the time and for seven long years he beat his number one and mandated contenders, often defying the bookies, the guides and the desires of many. Marvelous Marvin Hagler was the only middleweight champion, a man made and shaped in a very different time.\n\n“When you are the champion you have to work harder,“ Hagler added. “They want what you have and I remember that feeling; I wanted every single thing the champions had. I was built to destroy, it was always war with me.” Hagler made twelve defences, stopped or knocked out eleven of the men he beat, including Tommy Hearns in Las Vegas in 1985 - the fight is considered one of the greatest.\n\n“You know, I never stopped listening when I was fighting,” Hagler continued. “In the gym I never took it easy - you take it easy there, you night take it easy in the ring. Boxing was my art, that’s how I treated it and there was a lot about the sport that I hated.”\n\nHagler might have considered his fighting days as the worst of times, with rejection, open corruption, the FBI constantly investigating crooked officials, but in many ways his fighting days were the best of times. Hagler lived in the ring in the final days of a boxing world where one man was champion; he is a relic, a living legend, a real fighting man.\n\nA gentleman.\n\nMarvelous Marvin Hagler was in Glasgow with Premier Events UK.", "description": "In Glasgow, close to midnight on Sunday, 500 people listened in silence as Marvelous Marvin Hagler explained that there was never a time in his life when it was easy.", "authors": ["Steve Bunce"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/30/15/marvin-hagler.jpg", "published_at": "2019-09-30"}