{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201910132918/asia-markets-asian-markets-rise-on-relief-over-partial-us-china-trade-deal", "downloaded_at": "2019-10-14 03:47:46.713114+00:00", "title": "ASIA MARKETS: Asian Markets Rise On Relief Over Partial U.S.-China Trade Deal", "language": "en", "text": "By MarketWatch and Associated Press\n\nStocks surge in Hong Kong, mainland China; Nikkei closed\n\nAsian markets gained in early trading Monday as investors were heartened by Friday's announcement of a partial trade deal between the U.S. and China.\n\nPresident Donald Trump in Friday announced a \"very substantial phase one deal\" (link) that included intellectual-property protections and the Chinese purchase of U.S. agricultural products. There were also reports that tariff hikes against $250 billion of Chinese goods, set to kick in this week, would be put off.\n\nSome analysts were dubious, though. \"Hardly the signs of a significant breakthrough,\" Jeffrey Halley, senior Asia-Pacific market analyst for Oanda, wrote in a note Sunday. \"Both sides appear to have taken small wins that suited them both in the here and now, kicking the significant issues down the road.\"\n\nHong Kong's Hang Seng Index rose 1.1%, while the Shanghai gained 1.5% and the smaller-cap Shenzhen Composite advanced 1.5%, despite data that China's exports fell in September (link), in yuan terms, reversing an August gain. South Korea's Kospi rose 1.3%, while benchmark indexes in Taiwan , Singapore and Indonesia all gained. Australia's S&P/ASX 200 advanced 0.6%. Japan's Nikkei was closed for a holiday.\n\nU.S. bond markets will be closed for the Columbus Day holiday Monday (link), but stock markets will be open.\n\nAmong individual stocks, casino operator Galaxy Entertainment (0027.HK) surged in Hong Kong, while food processor WH Group (0288.HK) and HSBC (HSBA.LN) also gained. Samsung (005930.SE) and chip maker SK Hynix (000660.SE) rose in South Korea. Mining giants BHP (BHP.AU) and Rio Tinto (RIO.LN) were up in Australia.\n\n(END) Dow Jones Newswires\n\nOctober 13, 2019 23:22 ET (03:22 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-14"}