{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/brilliant-mario-maker-2-designer-makes-courses-unlike-any-mario-game", "downloaded_at": "2019-09-13 07:27:44.797534+00:00", "title": "Brilliant Mario Maker 2 Designer Makes Courses Unlike Any Mario Game", "language": "en", "text": "Screenshot: Mario Maker 2 via Kotaku\n\nThe suite of building blocks offered by Mario Maker 2 means there’s no shortage of creative users out there fine-tuning a wide array of levels that would likely never be seen in the original series. But one of my favourite creators is uniquely capable of making me forget that what I’m playing is technically still a Mario game.\n\nJapanese level creator Yuzuriha started uploading Mario Maker 2 courses to the Nintendo servers the day the game launched back in June. Their first level, Karakuri Castle, is a clever demonstration of the game’s new mechanics, such as seesaws, cyclones, and icicles.\n\nIt also introduces players to some of Yuzuriha’s usual tendencies, like separating levels into bite-sized chunks and crafting elaborate ending screens. It’s still very much Mario, but with a few novel ideas that indicate the creator was likely experimenting with the updated tools for future concepts.\n\nYuzuriha always wants to make sure players know the level is over (Gif: Mario Maker 2 via Kotaku)\n\nThanks to Mario Maker 2 allowing players to keep tabs on their favourite creators, it’s easy for me to keep track of Yuzuriha’s uploads, and that’s often the very first thing I do after booting up the game.\n\nI immediately added them to my queue after stumbling upon one of my favourite Mario Maker levels thus far, Mario Arcade NEO. As the name suggests, this course is a collection of mini-games meant to mimic a real-world arcade. These include a pusher, a crane game, and a rhythm game, just to name a few. Mario Arcade NEO is by far Yuzuriha’s most popular level, with over 200,000 plays and 82,000 likes.\n\nThe rhythm game utilises basic Mario elements to create an entirely new experience. By locking the player between two Bullet Bill launchers and scrolling blocks above their head, Yuzuriha challenges players to keep up with the music they chose for that portion of the level. If the player misses just one, a key item won’t drop at the end and they’ll be asked to repeat the process to proceed.\n\nIt’s not uncommon for Mario Maker 2 players to recreate other games within the Mario framework, but Yuzuriha went above and beyond with their Mega Man level.\n\nIn addition to making an opening menu and level select, Yuzuriha managed to build ingenious replicas of the iconic boss doors and power-up cutscenes. Although there’s only one boss to choose from, it’s easy to see how these concepts could be expanded in the future with follow-up courses.\n\nMany Mario Maker 2 levels are all about trying to frustrate the player, but Yuzuriha went the opposite direction with De-Stress Land, which is meant to reduce fatigue from a day of work or school.\n\nDe-Stress Land utilises some oddly satisfying scenarios, from sliding down a hill and taking out a huge line of enemies to crushing a tower of ice blocks with a giant stiletto. There’s always been something very calming about Mario to me, and Yuzuriha cranks up some of the most satisfying aspects of the series.\n\nYuzuriha has also tried their hand at story-based levels. Virtual Multi tasks the player with navigating through a level alongside a Koopa. Don’t have any friends you can invite to a round of laggy multiplayer?\n\nThen jump into this level and cooperate with a virtual friend! There’s a small twist at the end that I don’t want to ruin, but let’s just say it’s a shocking turn of events after everything you and your Koopa buddy go through.\n\nNothing better than taking down Bowser with a friend, even if that friend is a Koopa (Gif: Mario Maker 2 via Kotaku)\n\nAs shown above, the section right before the end of Virtual Multi pits the player and the Koopa they’ve escorted through the level against Bowser. The player can’t shoot Bowser with their fiery clown car until the Koopa, who fires automatically with their own clown car, clears Munchers out of the way with POW blocks in its section of the screen.\n\nIt’s not too challenging, but it’s probably the most engaging portion of the level and makes great use of Mario Maker 2’s artificial intelligence to mimic a co-op battle.\n\nDespite all the tools provided to creators in Mario Maker 2, even the most inventive levels still end up feeling like Mario. The franchise, with its iconic mushrooms, pipes, Goombas, and Koopas, is so ubiquitous to the gaming experience that the Mario essence becomes nearly impossible to shake. Yuzuriha, however, is among the few that craft levels with such creativity and care that it’s easy to forget that they were developed within the framework of a Mario game.\n\nIf you’d like to check out Yuzuriha’s courses for yourself — and I highly recommend you do — their user ID is DN7-11P-JKG. You won’t regret it.", "description": "The suite of building blocks offered by Mario Maker 2 means there’s no shortage of creative users out there fine-tuning a wide array of levels that would likely never be seen in the original series. But one of my favourite creators is uniquely capable of making me forget that what I’m playing is technically still...", "authors": ["Leah Williams", "Alex Walker"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/nrf7oc0ervr6rfmbkzi8.jpg", "published_at": "2019-09-13"}