{"pub": "wsj", "url": "https://wsj.com/articles/california-enacts-law-to-classify-some-gig-workers-as-employees-11568831719?mod=rsswn", "downloaded_at": "2019-09-18 23:26:04.895140+00:00", "title": "California Enacts Law to Classify Some Gig Workers as Employees", "language": "en", "text": "California Gov. Gavin Newsom signed legislation Wednesday intended to classify some independent contractors as employees eligible for legal protections as companies including Uber Technologies Inc. and Lyft Inc. ramp up their resistance to the change.\n\nThe Silicon Valley giants hope to renew negotiations with labor unions that backed the newly signed law, known as Assembly Bill 5, for changes to the new standards it sets for California gig workers. The companies are simultaneously threatening a costly ballot-measure campaign to rewrite those standards themselves.\n\nShare Your Thoughts Do you expect other states to follow California’s lead in classifying gig workers as employees? Why or why not? Join the conversation below.\n\n“The hollowing out of our middle-class has been 40 years in the making and the need to create lasting economic security for our workforce demands action,” Mr. Newsom, a Democrat, said in a signing statement. He also indicated that a compromise between the companies and unions could still be reached and that he hopes to play the role of dealmaker.\n\nThe new law, which passed the legislature last week and is scheduled to take effect Jan. 1, sets standards for when companies can employ independent contractors. Gig workers such as drivers and delivery people could potentially be reclassified as employees, entitled to better wages and benefits.\n\nUber has maintained that it wouldn’t have to classify its drivers as employees under the law’s new standards.\n\nAfter losing a lobbying fight during this year’s legislative session to gain an exemption to the measure, Uber, Lyft and delivery service DoorDash Inc. have said they would put together a $90 million fund to back a ballot-measure campaign.\n\nUber has said it could spend more than the $30 million it has deposited in the campaign committee and is seeking to expand the coalition to include other gig-economy companies.\n\nThe threat of such a campaign, which unions would likely have to spend tens of millions to oppose, could increase the pressure on power players in overwhelmingly Democratic Sacramento to reach a compromise and alter the law.\n\nMr. Newsom has said he is negotiating with tech companies and labor unions with the hope that a new legislative deal can be struck that would allow workers to unionize, among other provisions.\n\n“AB5 alone doesn’t allow for organization, and that’s where it’s limited,” Mr. Newsom told reporters Monday. “California, however, can advance those efforts, but it requires subsequent legislative efforts.”\n\nKen Jacobs, a labor expert at the University of California, Berkeley, noted that the National Labor Relations Board has issued a memorandum advising gig workers that they are independent contractors, and therefore exempt from that federal right—a determination that California’s new measure doesn’t necessarily change. But the state could create its own regulations as they apply to gig workers’ unionizing, as it has done for state agricultural workers, Prof. Jacobs added.\n\nThe bill’s author, Democratic Assemblywoman Lorena Gonzalez, said organizing workers would be difficult without unions’ cooperation, but she didn’t support any effort that would take away their status as employees.\n\nRelated Video For an increasing number of Americans, a patchwork of gig work is the norm, while others have become so-called independent workers because they take second jobs through digital platforms like Uber or Etsy to make ends meet. But nearly all face the challenges of inconsistent income and access to benefits.\n\n“Is there a possibility that California could create a new organizing scheme for workers that are not classified under federal law?” she said. “There is an argument for that, but there’s no need to remove their protections.”\n\nLyft and Uber have proposed that workers be able to organize and negotiate with ridesharing and delivery companies as a group, rather than individually. The two companies also have proposed a minimum wage of $21 an hour for time spent driving and picking up customers, as well as a fund to pay for benefits such as paid sick leave, as an alternative to reclassifying freelance workers as employees. California’s unions and key state legislators, including Ms. Gonzalez, have said these proposals don’t go far enough.\n\nA potential strategy for the gig-economy companies is to gather enough signatures to introduce a ballot measure, then offer to pull the proposal if they reach a deal with lawmakers and unions to alter the law, campaign experts said.\n\nUnions used a similar approach successfully in 2016 to pressure California legislators to raise the hourly minimum wage to $15, as did a wealthy advocate last year who pressured lawmakers to pass a data-privacy measure.\n\nSpending of $90 million or more by one side alone would make a ballot battle over the future of the state’s gig economy among the costliest ever. Most recently, dialysis providers and their opponents poured $130 million into a 2018 fight over a proposition that would have capped those companies’ profits, according to Ballotpedia, a nonpartisan nonprofit that tracks political information. The companies won that contest.\n\nThe gig-economy companies likely have access to information about a significant chunk of the California electorate, including the email addresses and phone numbers of their customers, which they could use to reach out to voters.\n\n“They can communicate with them and activate them, which I feel is a built-in advantage that other groups don’t necessarily have,” said Tony Russo, a California political consultant.\n\nWrite to Alejandro Lazo at alejandro.lazo@wsj.com", "description": "California Gov. Gavin Newsom signed legislation intended to classify some independent contractors as employees eligible for legal protections as companies including Uber and Lyft ramp up their resistance to the change.", "authors": ["Alejandro Lazo", "Alejandro.Lazo Wsj.Com"], "top_image": "https://images.wsj.net/im-108360/social", "published_at": "2019-09-18"}