{"pub": "reuters", "url": "https://in.reuters.com/article/us-usa-trade-china/hopes-for-trade-breakthrough-fade-as-china-cancels-u-s-farm-visits-idINKBN1W51Z9", "downloaded_at": "2019-09-21 03:39:39.050316+00:00", "title": "Hopes for trade breakthrough fade as China cancels U.S. farm visits", "language": "en", "text": "WASHINGTON/CHICAGO (Reuters) - A U.S.-China trade deal appeared elusive on Friday after Chinese officials unexpectedly cancelled a visit to farms in Montana and Nebraska as deputy trade negotiators wrapped up two days of negotiations in Washington.\n\nChinese officials were expected to visit U.S. farmers next week as a goodwill gesture, but cancelled to return to China sooner than originally scheduled, agriculture organizations from Montana and Nebraska said.\n\nThe United States had removed tariffs overnight from over 400 Chinese products in response to requests from U.S. companies.\n\nThe Chinese Embassy and the U.S. Department of Agriculture did not immediately respond to requests for comment.\n\nThe U.S. Trade Representative’s office issued a brief statement characterizing the two days as “productive” and that a principal-level trade meeting in Washington would take place in October as previously planned.\n\nChina’s Commerce Ministry, in a brief statement, described the talks as “constructive”, and said they had also had a good discussion on “detailed arrangements” for the high-level talks in October.\n\n“Both sides agreed to continue to maintain communication on the relevant issues,” it added, without elaborating.\n\nTrade experts, executives and government officials in both countries say that even if the September and October talks produced an interim deal, the U.S.-China trade war has hardened into a political and ideological battle that runs far deeper than tariffs and could take years to resolve.\n\nThe Chinese delegation did not present any new proposals on core structural issues including intellectual property protections, forced technology transfers, industrial subsidies and other trade barriers, said a person briefed on the talks.\n\n“The conclusion from the U.S. side was that we’re not close to an agreement,” the person said.\n\nThis source and another person familiar with the talks said that the Chinese delegation’s leader, Vice Finance Minister Liao Min, laid out China’s demands that any deal must remove all U.S. tariffs and be balanced so that it is not all concessions from Beijing and none from Washington.\n\nThe sources said that a lack of results from deputy meetings is not uncommon as they often are not authorized to make deals or present new offers.\n\nThe early October meeting will include the top trade negotiators: Chinese Vice Premier Liu He, U.S. Trade Representative Robert Lighthizer and U.S. Treasury Secretary Steven Mnuchin. It is expected to determine whether the world’s two largest economies are starting to chart a path out of their 14-month trade war or headed for new and higher tariffs on each others’ goods.\n\nCancellation of the Chinese agriculture visits, which were seen as potentially leading to increased purchases of U.S. soybeans and pork, caused Wall Street’s main stock indexes to fall as early optimism about the talks faded.\n\nGrain and soybean futures on the Chicago Board of Trade and livestock futures on the Chicago Mercantile Exchange also slumped. China is the world’s largest pork market and the largest importer of soybeans.\n\n‘COMPLETE DEAL’\n\nBefore the talks started, some reports had suggested that an interim deal was being considered, involving Chinese purchases of U.S. farm goods, some improvements in Chinese market access and an easing of U.S. sanctions on Huawei Technologies Co Ltd [HWT.UL]\n\nBut U.S. President Donald Trump made clear on Friday that purchases would not be enough for him to end his punitive tariffs.\n\n“We’re looking for a complete deal. I’m not looking for a partial deal,” he told reporters, adding that he did not need a deal to happen before the 2020 presidential election.\n\nSpeaking at a White House meeting with Australian Prime Minister Scott Morrison, Trump touted the billions of dollars in U.S. tariff receipts on Chinese imports, adding that the total would soon reach $100 billion.\n\n“I will say this: we’re making a lot of progress with China,” the Republican president said.\n\nThe Trump administration and China’s Communist Party remain far apart on issues that are the basis of their trade dispute, including the U.S. declaring some Chinese state companies national security risks, and Beijing’s refusal to revamp its economic model by eliminating subsidies for state companies.\n\nFILE PHOTO: U.S. President Donald Trump speaks to reporters while meeting with Australia’s Prime Minister Scott Morrison in the Oval Office of the White House in Washington, U.S., September 20, 2019. REUTERS/Jonathan Ernst/File Photo\n\nUSTR issued three Federal Register notices on Friday to exclude a wide range of products from tariffs in response to requests from U.S. companies, which argued that the levies would cause economic hardship.\n\nThe 437 exempted products range from printed circuit boards for computer graphics processors to dog collars, laminated wood flooring and miniature Christmas lights.\n\nThe United States is asking that China substantially increase purchases of American soybeans and other farm commodities, a person with knowledge of the planned discussions told Reuters.", "description": "A U.S.-China trade deal appeared elusive on Friday after Chinese officials unexpectedly cancelled a visit to farms in Montana and Nebraska as deputy trade negotiators wrapped up two days of negotiations in Washington.", "authors": ["David Lawder", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190920&t=2&i=1432051499&w=1200&r=LYNXMPEF8J1QH", "published_at": "2019-09-21"}