{"pub": "guardian", "url": "https://theguardian.com/sport/2019/sep/27/australia-slip-up-at-death-against-china-in-basketballs-asia-cup", "downloaded_at": "2019-09-26 23:46:53.193016+00:00", "title": "Australia slip up at death against China in basketball's Asia Cup", "language": "en", "text": "Australia’s FibaWomen’s Asia Cup hopes have suffered a blow after falling to a shock 70-69 defeat against China in Bangalore. With a place in the semi-finals and automatic progression to November’s Olympic pre-qualifying tournament on the line on Thursday, Australia had the chance to win the game on the final possession but guard Siyu Wang capped a stellar performance with a steal in the final seconds to seal the victory for China.\n\nThe Opals battled back from a nine-point half-time deficit and appeared on the cusp of victory after Leilani Mitchell stepped up in the final minute by collecting a steal then putting Australia ahead with a driving lay-up with 12 seconds to play. But Ting Shao’s lay-up put China back on top before Wang’s late heroics secured her nation top spot in Group B and a rest day ahead of Saturday’s semi-finals.\n\nLiz Cambage mocks Mystics after WNBA play-offs win Read more\n\nThe result means Australia must play a qualifying match on Friday against Taiwan or India in order to reach the semi-finals.\n\nWang (18 points) and centre Yueru Li (14 points, nine rebounds) led the way for China in a physical encounter where a slight edge in rebounding (46-37) and second-chance points (13-4) proved the difference. Australia’s offence appeared out of sync throughout the match with only Katie-Rae Ebzery (13) reaching double figures.\n\nThe Opals shot out to a 10-2 lead but China fought back with Wang making an impact off the bench with nine points to trail Australia 20-19 at the end of the first quarter. A Liwei Yang triple saw China regain the lead early in the second quarter and with Australia’s offence spluttering, the underdogs continued to inch further ahead with centre Xu Han closing the half with a three-point play for a 44-35 advantage.\n\nAustralia managed to narrow China’s lead to 56-51 after a dour third term and while Sara Blicavs and Darcee Garbin combined to tie the game with four minutes to play, the Opals could not deliver the knockout blow down the stretch.", "description": "Australia’s FIBA Women’s Asia Cup hopes have suffered a blow after falling to a shock 70-69 defeat against China in Bangalore", "authors": ["Australian Associated Press"], "top_image": "https://i.guim.co.uk/img/media/1bb9e5a5a74e569898d6517f4365ab475b5220c6/0_120_3400_2041/master/3400.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5b3d36f74715244f16812353e7e8a77f", "published_at": "2019-09-26"}