{"pub": "hotair", "url": "https://hotair.com/archives/john-s-2/2019/09/03/aoc-raising-money-counter-protesters-straight-pride-parade", "downloaded_at": "2019-09-03 23:43:37.378065+00:00", "title": "AOC raising bail money for counter-protesters at straight-pride parade", "language": "en", "published_at": "2019-09-03", "text": "Saturday, AOC recommended that people support counter-protesters, including Antifa, who were present at a Boston straight-pride parade. She encouraged people to donate to a “Bail Fund for activists who put themselves on the line…”\n\nOne way to support the local LGBTQ community impacted by Boston’s white supremacist parade? Contribute to the Bail Fund for the activists who put themselves on the line protecting the Boston community:https://t.co/z2NRSqHMve (Any $ left over goes to @MassBailFund+@Boston_GLASS) https://t.co/G9xhIda6sF — Alexandria Ocasio-Cortez (@AOC) September 1, 2019\n\nThe Boston Herald reports that 36 people were arrested at the parade Saturday.\n\nChants of hatred and disgust were tossed across police barricades between protesters and supporters of the Straight Pride Parade on Saturday which ended in 36 arrests and 4 injured officers, according to Boston police. Tensions flared in the crowd of about 200 people which was composed mostly of counterprotesters and peppered with far left groups like Antifa. The controversial parade garnered national attention since its inception in June. “We’re covered in black so when we attack these guys we can’t be prosecuted,” said Jon Crowley, an Antifa member who told the Herald that he felt violence was the only way to deal with the people marching in the parade, which went from Copley Square to City Hall Plaza. “They are fascists, 100%. How else are you going to get them to shut up?”\n\nThat quote really sums up Antifa in a nutshell. Why would a lawmaker want to support people looking to commit politically-motivated violence? Here’s a bit of the parade which featured a float supporting President Trump for reelection:\n\nStraight pride parade today in Boston. pic.twitter.com/wDcFdcv6B8 — Mike🇺🇸 (@mikeandersonsr) August 31, 2019\n\nThe float in the “Straight Pride Parade” features “2020 Trump” and “Build The Wall” signs #WCVB pic.twitter.com/fnVfZ3EOnd — John Atwater (@AtwaterWCVB) August 31, 2019\n\nAt some point, protesters tried to block the streets and police pepper-sprayed them and made arrests:\n\nANTIFA getting arrested at the #StraightPrideParade in Boston!!! Thank you police!!! pic.twitter.com/iqJdzn7fZG — That Trump Guy 🇺🇸 (@ThatTrumpGuy) August 31, 2019\n\n🚨 BREAKING 🚨 Protestors of the straight pride parade are blocking police as they attempt to break up the protest after permits ran out at 4pm EST. Protestors are being arrested right now by Boston police as they yell “cops and the klan go hand in hand” pic.twitter.com/YDfUsL1YS8 — Elijah Schaffer (@ElijahSchaffer) August 31, 2019\n\nThe whole straight pride parade is a pretty obvious attempt to troll people on the left and I’m not surprised some were upset about it. As Jazz put it, this looks like an intentional effort to seek confrontation. But the police were there doing their jobs, trying to keep the groups apart so no one got hurt. They didn’t deserve to be attacked for that. Raising money for a group that comes to these events to get violent seems like an unusual angle for a lawmaker to take, but it’s not really surprising that AOC is siding with Antifa over the police.", "description": "\"We’re covered in black so when we attack these guys we can’t be prosecuted\"", "authors": ["John Sexton", "Ed Morrissey", "Andrew Malcolm"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/AOC.jpg"}