{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7555447/McDonalds-burglar-jailed-five-years.html", "downloaded_at": "2019-10-09 19:19:20.534517+00:00", "title": "McDonald's burglar jailed for five years", "language": "en", "text": "Daniel Parra-Braun, 37, burst into the fast-food restaurant in Coventry and placed a note on the counter which read: 'I am armed. Give till cash now'\n\nA bungling robber who burst into a McDonald's and demanded cash was was forced to buy a cheeseburger first so staff could open the till.\n\nDaniel Parra-Braun, 37, burst into the fast-food restaurant in Coventry and placed a note on the counter which read: 'I am armed. Give till cash now.'\n\nBut he was left stunned when he was told the tills would not open unless he bought something off the menu.\n\nIncredibly, Parra-Braun ordered a 99p cheeseburger and even handed over a £5 note before making off with £136 in cash.\n\nThe bizarre robbery was one of four Parra-Braun carried out in the city in just 12 hours before being caught on June 16 last year.\n\nOn Tuesday Parra-Braun, of Coventry, was jailed for five years after he admitted two charges of robbery and two attempted robberies at Warwick Crown Court.\n\nJudge Peter Cooke told him: 'I accept that this bizarre few hours in your life was the product of something of a psychiatric collapse you had suffered.\n\n'Your behaviour has that peculiar flavour to it and was not just about obtaining money.\n\nBut he was left stunned when he was told the tills would not open unless he bought something off the menu. Incredibly, Parra-Braun ordered a 99p cheeseburger and even handed over a £5 note before making off with £136 in cash (pictured: The Hamburglar)\n\n'There is no suggestion you produced or had a weapon, but the people on the other end of the threats were not to know that.'\n\nThe court heard Parra-Braun struck at the McDonald's on the Gallagher Retail Park in Coventry at 8pm on June 16.\n\nHe marched up to the counter and handed a staff member a note which read: 'I am armed. Give till cash now.'\n\nHe then told the terrified server: 'Give me the money from the till. You're going to have to, I'm armed.'\n\nThe man behind the counter said he could not open the till until a purchase was made so Parra-Braun ordered a cheeseburger and gave him £5.\n\nThe assistant still did not hand over any money, but the manager gave him £136 from the till, and Parra-Braun fled.\n\nEarlier in the day, Parra-Braun also held up another McDonald's as well as a bookmakers and a hotel in the city.\n\nParra-Braun ordered a 99p cheeseburger and even handed over a £5 note before making off with £136 in cash\n\nProsecutor Simon Burch said Parra-Braun entered a William Hill bookmakers at 4.30pm.\n\nHe said: 'He put down a note which read: 'I am armed. The money from the till please.'\n\n'Addressing a member of staff by her first name, with his hand in his pocket to feign to have a weapon, he told her: 'I don't want to whack it out, I just want the money.''\n\nHe left with £170 in cash but the staff recognised Parra-Braun as a regular who lived in a flat over the road.\n\nParra-Braun then held up the McDonald's before heading to the Premier Inn in the city centre where he again handed over a note to the receptionist which read: 'Till'.\n\nThe court heard Parra-Braun struck at the McDonald's on the Gallagher Retail Park in Coventry at 8pm on June 16\n\nBut he was forced to flee empty-handed after being informed the hotel had already taken the cash to the bank.\n\nTwenty minutes later he targeted a city centre McDonalds where he handed a staff member a note with: 'armed' and 'money' written on it.\n\nNo cash was handed over and the manager called the police and Parra-Braun was arrested nearby. The court heard that no weapon was found.\n\nThe court heard Parra-Braun had 11 convictions for offences including theft.\n\nIan Windridge, defending, said: 'He has mental health conditions, but they did not contribute to the offending, nor did they require hospital treatment.\n\n'He goes back to Coventry. He doesn't really know what he's doing. He makes comments and writes notes. He wasn't in need of money. It was a cry for help, but not a substantial one.'", "description": "Daniel Parra-Braun, 37, burst into the fast-food restaurant in Coventry and placed a note on the counter which read: 'I am armed. Give till cash now'. But he was forced to buy a burger to access the till.", "authors": ["Rod Ardehali For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/18/19503808-0-image-a-20_1570643480593.jpg", "published_at": "2019-10-09"}