{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7625217/Peterborough-couple-kicked-Greece-BA-flight-300-vouchers-airline-noticed-error.html", "downloaded_at": "2019-10-29 14:33:04.393960+00:00", "title": "Peterborough couple kicked off Greece BA flight get £300 vouchers before airline noticed error", "language": "en", "text": "A 'drunken' couple kicked off a British Airways flight for being disruptive pocketed £300 vouchers in compensation - but had them taken off them after they complained they weren't enough.\n\nVictoria Parker, 41, and Paul Dempsey, 44, had been on a romantic getaway to Greece last month when they were escorted off their plane.\n\nBA claims other passengers were complaining about their behaviour so they told them to disembark.\n\nThe hairdresser, of Peterborough, admitted she was 'a bit squiffy' and was refused any more alcohol after consuming 'a couple of glasses of wine and an ouzo'.\n\nBut after forking out £700 for a new flight and hotel, the couple decided to complain about their 'mistreatment' and was handed two £150 vouchers by way of an apology.\n\nTheir mistake, however, was complaining they hadn't been given enough, as the airline noticed the vouchers had been given 'in error' and they withdrew the lot.\n\nVictoria Parker, 41, and Paul Dempsey, 44, (pictured together) were jetting off for a romantic getaway to Greece last month when they were escorted off their British Airways plane\n\nInstead, BA has backed their staff for kicking the couple off the flight and said it was the 'appropriate action' as 'disruptive behaviour will not be tolerated'.\n\nThe mother-of-one has still refused to accept BA's verdict and claims they might have been targeted because the flight was 'oversold'. BA has confirmed it wasn't.\n\nMs Parker said: 'I don't believe what they are saying, it is totally outrageous and none of it makes sense.\n\n'BA [called] to say the vouchers were no longer valid and the real reason we were kicked off plane was because we were both disruptive.\n\n'[They said they'd] had a complaint that I wasn't actually fit to fly, whereas at the airport it was because I touched someone's arm.\n\n'They are back tracking. Why was I cleared through security if I was a disruption? Why has it gone from me touching a man's arm to us both being complained about.\n\n'They aren't being entirely clear because they are covering it up. And being cagey or just don't know what actually happened. I am so furious about this. It's so corrupt.\n\n'I don't care about the vouchers. It's the way we were treated.\n\n'We've been stitched up and they should have investigated it themselves before removing us. Shouldn't it be the captain's decision?\n\n'I accept I was a bit squiffy after three drinks sat in the sun, but I was not in anyway disruptive.\n\n'And why would they apologise and offer vouchers in the first place if we were those things?'\n\nAfter forking out £700 for a new flight and hotel, the couple (pictured) decided to complain about their 'mistreatment' and was handed two £150 vouchers by way of an apology\n\nThe couple had been sat on the plane on the runway for 10 minutes before a member of staff approached and asked them to follow him.\n\nShe claims it 'all happened so quickly' and before they knew it, they were being handed their luggage and told they would have to 'get a flight tomorrow'.\n\nThe hairdresser says she was told the reason she had being taken off the plane was because she 'touched a man's arm' - which she claims was 'completely fabricated'.\n\nShe added: 'I was very shocked and it all happened so quickly.\n\n'We did wonder whether or not we'd been stitched up. Was it a case of the flight being oversold and they just targeted us?\n\n'I believe [the complaint I touched a man's arm] is completely fabricated.\n\n'The airport guy said that it happened as I was walking along the plane. We boarded at the front of the plane and our seats were the very back ones, so it could have.\n\n'I was carrying a large shoulder bag and walking along such a tiny aisle, but that wouldn't explain why a Greek ground staff member boarded the plane to remove us.\n\n'The guy at the desk said 'you'll have to get a flight tomorrow'. There wasn't police or security - nothing.'\n\nPictured: Mykonos Airport where they were due to fly from\n\nMs Parker and Ms Dempsey, an engineer, had enjoyed a week away but claim the experience ruined their happy memories.\n\nShe said: 'It really spoiled the holiday. We went to Naxos and had a lovely week, but on the way back we arrived at the airport a couple of hours before the plane was due to depart.\n\n'We went to the bar and I had a few drinks. Paul wasn't drinking at all because he was driving back from Heathrow.\n\n'I only had a couple of glasses of wine and an ouzo before getting on the plane.\n\n'We went through the usual security clearance then... around 10 minutes in, a member of the Greek airport staff boarded the plane and asked us to follow them.\n\n'In that sort of country, you just comply. He asked us what our case looked like. As we walked down the stairs, our suitcase was on the tarmac.\n\n'When we got down there he asked what was going on and they said they'd had a complaint from a man that I touched his arm when we were boarding.\n\n'When we got back into the airport there was no one to speak to. As soon as we got back to the hotel, that we had to book for the night, I drafted a complaint and then sent it the next day.\n\n'We had to pay for another night in a hotel and flights which came to around £700.\n\n'That's £700 that we hadn't budgeted for. If we didn't pay it, we'd have been stuck there.\n\n'They have replied and offered us only £150 [each] and no explanation.'\n\nA British Airways spokesman said: 'Disruptive behaviour will not be tolerated on board our aircraft and we will always take the appropriate action.\n\n'Unfortunately this email was sent in error and we have been in contact with our customer to explain this.'", "description": "Victoria Parker, 41, and Paul Dempsey, 44, of Peterborough, had been on a romantic getaway to Greece last month when they were escorted off their British Airways plane.", "authors": ["Lara Keay For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/10/20320422-0-image-a-28_1572345726820.jpg", "published_at": "2019-10-29"}