{"pub": "yahoo", "url": "https://finance.yahoo.com/news/chipping-away-semiconductor-etfs-193000185.html", "downloaded_at": "2019-10-11 00:57:53.608927+00:00", "title": "Chipping Away At Semiconductor ETFs", "language": "en", "text": "The semiconductor industry is crucial to technological advances and is one of the driving forces behind a host of other industries.\n\nThere are currently four semiconductor ETFs targeting U.S. stocks, and although the iShares PHLX Semiconductor ETF (SOXX) seems to be blowing away the competition and is rated by FactSet in its market segment, there are some subtle differences investors should consider.\n\nSize & Cost\n\nSOXX weighs in with assets under management (AUM) of almost $1.8 billion, more than five times the size of its next largest competitor, the SPDR S&P Semiconductor ETF (XSD), with $336.4 million in AUM. SOXX is also the oldest fund in the category, with its inception dating back to 2001.\n\nHowever, XSD is cheaper, charging an expense ratio of 0.35% compared with SOXX’s 0.46%, making it the lowest-cost fund in the group.\n\nThe Invesco Dynamic Semiconductors ETF (PSI) is a $178 million fund and charges an expense ratio of 0.58%, while the smallest fund in the group, the First Trust Nasdaq Semiconductor ETF (FTXL) with $30.9 million in AUM, is also the most expensive, at 0.60%.\n\nSource: FactSet, as of 10/4/2019\n\nHoldings & Methodology\n\nAll four ETFs are very similar in many ways, holding 30-36 securities each, with a total of 11 securities held in common across all four funds—that’s roughly a third of each fund’s components. Still, there’s a lot of variance in the total weight of those 11 components in each fund, and that’s likely due to differences in methodology.\n\nSOXX’s 32 holdings are weighted by modified market capitalization. XSD’s 36 holdings are selected based on market capitalization and are equally weighted, while PSI implements a multifactor quantitative factor to select and weight its 31 components. FTXL’s index methodology selects its 30 components based on liquidity, and weights them based on value, volatility and growth factors.\n\nNVIDIA is SOXX’s largest holding, with a weighting of 8.42%, with Intel and Texas Instruments in the second and third spots, at 8.21% and 8.09%, respectively. All three of those securities are also held by the other three funds in the group, but at often very different weights. For example, FTXL gives NVIDIA only a 1.67% weighting, and XSD weights Intel at 3.18%.\n\n(Use our stock finder tool to find an ETF’s allocation to a certain stock.)\n\nThe 11 components held by all four funds as a group also have very different aggregated weights in the respective ETFs, with those securities representing nearly 55% of SOXX’s total weight and less than 35% of XSD’s total weight.\n\nFor someone looking for semiconductor exposure, the individual security selection and weighting in such narrow-based funds could be very important if they have particular names they are hoping to see in a fund, especially when it comes to a company like NVIDIA.\n\nCompany SOXX XSD PSI FTXL NVIDIA Corporation 8.42% 3.28% 5.27% 1.67% Intel Corporation 8.21% 3.18% 5.18% 8.08% Texas Instruments Incorporated 8.09% 3.29% 5.06% 7.91% QUALCOMM Incorporated 7.57% 3.24% 4.81% 1.53% Broadcom Inc. 7.55% 3.18% 4.70% 2.50% Analog Devices, Inc. 3.92% 3.18% 4.94% 3.87% Micron Technology, Inc. 3.73% 2.89% 4.72% 3.70% Xilinx, Inc. 3.46% 2.93% 2.37% 1.39% Maxim Integrated Products, Inc. 2.55% 3.17% 2.78% 1.62% Silicon Laboratories Inc. 0.77% 3.16% 2.61% 1.55% Cirrus Logic, Inc. 0.51% 3.22% 2.65% 3.83% 54.78% 34.72% 45.09% 37.65%\n\nPerformance & Trading\n\nSOXX has had the best performance of the four funds over the three-, five- and 10-year annualized periods ended Oct. 4. However, the returns for this group tend to be clustered. The biggest differences open up in the year-to-date period, for which XSD is the top performer, with a return of 37.43%, followed by SOXX, which was up 35.37%. FTXL was up 33.83%, while PSI trailed the group significantly, with a return of 30%.\n\nXSD is also the top performer for the one-year period, up 17.96% versus 14.53% for SOXX and 8.96% for PSI, which was at the back of the pack.\n\nInterestingly, XSD also has the most inflows year-to-date, gaining $384 million, while PSI was the only fund in the group to have year-to-date outflows, losing nearly $25 million. SOXX gained a little more than $26 million.\n\nStory continues", "description": "A major driver of our economy can get lost in the portfolio shuffle. But how do you choose?", "authors": ["Heather Bell"], "top_image": "https://s.yimg.com/uu/api/res/1.2/eJXjXGLavpOpTx3PQfZBiQ--~B/aD00MzI7dz01Mjg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-US/homerun/indexuniverse.com/9575b1b96862a363cee637c1e65e847c", "published_at": "2019-10-10"}