{"pub": "cnn", "url": "https://bleacherreport.com/articles/2856647-la-sparks-gm-penny-toler-fired-after-playoff-collapse-hc-derek-fisher-staying?utm_source=cnn.com&utm_campaign=editorial&utm_medium=referral", "downloaded_at": "2019-10-04 23:52:20.276458+00:00", "title": "LA Sparks GM Penny Toler Fired After Playoff Collapse; HC Derek Fisher Staying", "language": "en", "text": "Leon Bennett/Getty Images\n\nThe Los Angeles Sparks announced the firing of longtime general manager and executive vice president Penny Toler on Friday.\n\nLauren A. Jones of the Los Angeles Sentinel tweeted the following statement provided by the Sparks:\n\nAccording to ESPN's Ramona Shelburne, Derek Fisher will stay on as the team's head coach despite the fact that L.A. was swept in three games by the Connecticut Sun in the playoff semifinals.\n\nToler was mired in controversy Thursday when Shelburne wrote an article detailing a speech she gave the players after their Game 2 loss to the Suns. Toler, who is black, admitted to using the \"N-word\" in her speech, but said it wasn't directed toward the players:\n\n\"By no means did I call my players the N-word. I'm not saying that I couldn't have used it in a context. But it wasn't directed at any of my players.\n\n\"It's unfortunate I used that word. I shouldn't. Nobody should. ... But you know, like I said, I'm not here to defend word by word by word what I said. I know some of the words that I'm being accused of are embellished. Did I give a speech that I hoped would get our team going? Yes.\n\n\"I think that this whole conversation has been taken out of context because when we lose, emotions are running high and, unfortunately and obviously, some people feel some type of way.\"\n\nShelburne spoke with multiple Sparks players who said the speech made them feel uncomfortable. She was also told that Toler called the players \"motherf--kers\" and said she would replace them if they were swept by the Sun.\n\nWNBA Commissioner Cathy Englebert said Thursday that the league would investigate Toler's actions.\n\nFisher was also under fire for the way he coached in L.A.'s 78-56 season-ending loss in Game 3 against Connecticut. Sparks star Candace Parker played just 11 minutes in the game, and players told Shelburne they believe Fisher's decision to bench Parker was \"premeditated.\"\n\nThe Sparks hired Fisher during the offseason after Brian Agler left to become head coach of the Dallas Wings.\n\nToler played for the Sparks from 1997-1999 before retiring to become the team's GM. In 20 seasons as general manager, Toler led the Sparks to 18 playoff appearances and a trio of WNBA titles in 2001, 2002 and 2016.", "description": "The  Los Angeles Sparks  announced the firing of longtime general manager and executive vice president Penny Toler on Friday.     Lauren A...", "authors": ["Mike"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/831/459/hi-res-1c775372f124c70fc55c905458927029_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-10-04"}