{"pub": "washingtonpost", "url": "https://washingtonpost.com/outlook/2019/09/22/ted-cruz-messed-with-wrong-professor", "downloaded_at": "2019-09-22 15:18:00.202522+00:00", "title": "Ted Cruz messed with the wrong professor", "language": "en", "text": "There’s no doubt that the catastrophic Obama-Iran nuclear deal, which flooded the Iranian regime with hundreds of billions of dollars in cash and sanctions relief, directly contributed to the recent attacks. The deal didn’t just provide Iran with resources it poured into its military; it also created an incentive for the international community to ignore Iranian aggression for the sake of preserving the deal, emboldening the Iranians to launch exactly these sorts of attacks.... President Trump’s courageous decision to withdraw from the nuclear deal and implement a strategy of maximum pressure against Iran was the single most important national security decision of his presidency. Allowing these sanctions to expire would undermine all of that. Meanwhile, we must continue to pressure the Iranian regime economically. Our maximum-pressure strategy against Iran has proven predictably powerful despite dire warnings from the Iran echo chamber that it wouldn’t work. Fact is, our economy dwarfs Iran’s, and the dollar is the global currency. If we have the will, we can cut off Iran from the global financial system, forcing third-party actors to choose between us or them.\n\nLet’s break this down a little. It is entirely likely that the JCPOA, by permitting Iran access to some of its frozen assets, enhanced Iran’s influence in the region. That was always the trade-off that Iran hawks opposed.\n\nIt makes zero sense, however, to blame Iran’s recent bellicosity on the nuclear deal. No, credit for that must fall to the Trump administration’s withdrawal from the JCPOA and the reimposition of economic sanctions that Cruz extols. The maximum-pressure campaign succeeded in weakening Iran’s economy. The failure of the Trump administration to credibly signal any propensity for serious negotiation, however, sends the message that this is an act of economic warfare rather than economic coercion.\n\nIf Iran perceives that there is no bargain to be struck with the Trump administration, its leaders have an incentive to escalate their behavior in ways that increase costs to the United States. Iran has many asymmetrical means at its disposal to destabilize the Persian Gulf region. It is worth remembering at this point that the U.S. embargo of Imperial Japan convinced that government that it had no choice but to launch the Pearl Harbor attack.\n\nCruz should be concerned that the maximum-pressure campaign could force Iran to pursue similarly risky behavior. As I noted earlier this year, “it is rather difficult for the United States to criticize Iran for violating the terms of an agreement that it violated first. Trump, despite decrying the Iran deal, has managed to push Iran into doing the one thing that the deal was designed to limit.”\n\nAs for going to the United Nations? If the U.S. ambassador followed Cruz’s advice, I suspect that the Security Council would laugh as hard as the General Assembly did during Trump’s last speech to the body. The administration has burned up whatever political capital it had in Turtle Bay by exiting the JCPOA. The only thing that would make Cruz’s plan less realistic would be for him to ask the Security Council for a pony in addition to snapback sanctions.\n\nThis is all pretty clear cut to anyone following this particular crisis, which was why Dartmouth professor Nicholas Miller tweeted out some criticism of Cruz’s op-ed:\n\nTed Cruz wrote an op-ed on Iran and it’s a real gem. https://t.co/P506oWTT3y\n\n\n\nHe argues the attack on Saudi Arabia was caused by the Iran deal, as opposed to US withdrawal from the deal.\n\n\n\nHe also implies Iran is building nuclear weapons and would nuke US cities. Cool cool. pic.twitter.com/NJUqYk0Xbx — Nicholas Miller (@Nick_L_Miller) September 21, 2019\n\nIt would be safe to say that Cruz did not take too kindly to this tweet:\n\nA Dartmouth prof doubts that Iran seeks nuclear weapons & they would use them on US cities. I’m curious, what does he think Ayatollah Khamenei means when he refers to USA as “The Great Satan” & chants “Death to America”? Here’s an idea: Don’t give him billions of $$ to find out. https://t.co/lvZIDGifaH — Ted Cruz (@tedcruz) September 21, 2019\n\nYeah, what would Miller know about all of this?! He only wrote (checks notes) a peer-reviewed article in the top international relations journal as well as a Cornell University Press book about what works and what doesn’t in U.S. nonproliferation policy! It is probably not as much of a page-turner as “Green Eggs and Ham,” but maybe Cruz could read it on one of his next trips back to his home state.\n\nIn attacking Miller, Cruz is trying to deflect from the logical flaw at the heart of the administration’s policy and his op-ed. Before Trump pulled out of the JCPOA — and even for some time after — there was no evidence that Iran was pursuing nuclear weapons. It was only after the administration withdrew from the JCPOA that the trouble began. Cruz’s solution is a nonstarter, since the United States lacks the juice to get the Security Council to go along.\n\nThe moral of this story is that if you are wondering whom to trust — a professor whose expertise is in nonproliferation and sanctions or Cruz — do not pick Cruz.", "description": "Between the Republican senator and an expert on sanctions and nonproliferation, trust the expert on sanctions and nonproliferation.", "authors": ["Daniel W. Drezner", "Daniel W. Drezner Is A Professor Of International Politics At The Fletcher School Of Law", "Diplomacy At Tufts University", "A Regular Contributor To"], "top_image": "https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CSGF4JGZRMI6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-22"}