{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/johannes-makes-strictly-history-sends-20661833", "downloaded_at": "2019-10-20 23:23:18.002889+00:00", "title": "Johannes makes Strictly history and sends viewers into meltdown with high heels routine", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nJohannes Radebe sent Strictly Come Dancing viewers into meltdown tonight during one of the best opening numbers in the show's history.\n\nThe South African professional dancer wore black high heeled boots for the fabulous routine at the start of Sunday's results show.\n\nJohannes, who is partnered with Coronation Street star Catherine Tyldesley, strutted down a red carpert for his grand entrance.\n\nThe Strictly pro waved a red fan around while busting some moves in his black high heels and black leather trousers with a red stripe.\n\nJohannes even managed a stunning high kick to finish off the sensational opening routine.\n\n(Image: BBC)\n\n(Image: BBC)\n\nStrictly Come Dancing viewers took to Twitter after watching the sensational routine.\n\nOne viewer said: \"That strictly dance was INCREDIBLE! Johannes was so good!\"\n\n\"Man. Johannes dancing and hitch-kicking in heels better than I'll ever be able to *balance* in them...,\" added another.\n\n\"One of the best opening sequences in #strictly ever! Johannes rocked,\" said a third.\n\nA fourth said: \"Okay Johannes is the best thing to happen to this show in years, bloody love him!\"\n\n(Image: BBC)\n\n(Image: BBC)\n\nThe other Strictly Come Dancing pros also received high praise from viewers at home.\n\nAJ Pritchard came in as security, while Kevin Clifton was acting as an interviewer when the VIP guests came down the red carpet.\n\nThe judges also had a major part to play as they strutted their way down the red carpet.\n\nIt climaxed with the judges, who were stood on the stairs, holding out fans with phrases such as \"extra\" and \"yasss\".\n\n(Image: PA)\n\n(Image: PA)\n\nCatherine and Johannes were thrilled to make it through to Halloween week.\n\nThe pair impressed the judges and the voting public with their Tango to Little Bird.\n\nAnd they have some very big plans for next week - but viewers will have to wait and see.\n\n*Strictly Come Dancing air Saturdays and Sundays on BBC One", "description": "The South African professional wowed fans in one of the best opening numbers in Strictly Come Dancing history", "authors": ["Kyle O'Sullivan", "Image", "Bbc", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20661854.ece/ALTERNATES/s1200/1_Strictly-fans-go-wild-for-Johannes.jpg", "published_at": "2019-10-20"}