{"pub": "investing.com", "url": "https://in.investing.com/news/stock-market-news/update-1uk-stocksfactors-to-watch-on-oct-18-2008383", "downloaded_at": "2019-10-18 07:07:23.612223+00:00", "title": "UPDATE 1-UK Stocks-Factors to watch on Oct. 18", "language": "en", "text": "UPDATE 1-UK Stocks-Factors to watch on Oct. 18\n\nStock Markets 19 minutes ago (Oct 18, 2019 12:18)\n\n© Reuters. UPDATE 1-UK Stocks-Factors to watch on Oct. 18 (Adds company news items and futures) Oct 18 (Reuters) - Britain's FTSE 100 index is seen opening down nine points to 7,173 on Friday, according to financial bookmakers, with futures down 0.55% ahead of cash markets open. * WINCANTON/EDDIE STOBART: Wincanton Plc said on Friday it was mulling a possible offer for Eddie Stobart Logistics Plc and said it was performing due diligence on the company and its assets. LSE: London Stock Exchange Group reported higher-than-expected third-quarter income on Friday, driven by higher clearing activity. INTERCONTINENTAL HOTELS GROUP: InterContinental Hotels Group reported a 0.8% decline in revenue per room for the third quarter on Friday, as the Holiday Inn-owner was hurt by protests in Hong Kong and tougher trading conditions in the United States and China. OIL: Oil prices fell on Friday after China, the world's largest oil importer, recorded its weakest quarter of economic growth in nearly three decades, dragged down by a trade dispute with the United States. GOLD: prices held above $1,490 on Friday as disappointing data from China reinforced concerns that its trade spat with the United States had begun taking a toll on global economies, while the Brexit deal waits for parliamentary backing. The UK's FTSE mid-cap stocks index was well off its day's high and was last trading up 0.3% on Thursday. The blue-chip exporter-heavy FTSE 100 index rose 0.5% on sterling's reversal. For more on the factors affecting European stocks, please click on: LIVE/ TODAY'S UK PAPERS > Financial Times PRESS/FT > Other business headlines PRESS/GB\n\nUPDATE 1-UK Stocks-Factors to watch on Oct. 18", "description": "UPDATE 1-UK Stocks-Factors to watch on Oct. 18", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEB59082_L.jpg", "published_at": "2019-10-18"}