{"pub": "wsj", "url": "https://wsj.com/articles/crypto-firms-assess-how-to-comply-with-anti-money-laundering-standards-11568626200?mod=rsswn", "downloaded_at": "2019-09-16 12:00:29.556680+00:00", "title": "Crypto Firms Assess How to Comply With Anti-Money-Laundering Standards", "language": "en", "text": "The cryptocurrency industry is rushing to comply with new anti-money-laundering standards that require exchanges and other firms to share information about their customers.\n\nThe standards, adopted in June by the Financial Action Task Force, require cryptocurrency exchanges, some digital wallet providers and other firms to send customer data—including names and account numbers—to institutions receiving transfers of digital funds, similar to a wire transfer at a bank. The goal of the so-called travel rule is to help law enforcement track suspicious activity. The FATF is the global standard-setter for anti-money-laundering.\n\nBut figuring out how to comply with the standards has been something of a puzzle. Crypto firms don’t have the infrastructure in place to send customer data to each other, industry executives say. There is also the challenge of getting firms in a decentralized industry to reach a consensus on how a system for sharing information should be paid for and governed.\n\n“Is it solvable? Yes,” said Jeff Horowitz, chief compliance officer at the digital currency exchange Coinbase. “But is there a method that exists today to share this data? No.”\n\nMr. Horowitz—who last year joined the San Francisco exchange from Pershing LLC, a unit of Bank of New York Mellon Corp. —described compliance with the travel rule as one of his top priorities. Coinbase is participating in working groups with other exchanges to develop a plan for compliance, he said.\n\nUnder the FATF guidelines, crypto firms must transmit customer data to other financial institutions when transferring $1,000 or more. A similar rule has been in place for U.S. financial institutions since 1996.\n\n“ “Is it solvable? Yes. But is there a method that exists today to share this data? No.” ” —Jeff Horowitz, chief compliance officer at Coinbase, on new standards requiring cryptocurrency companies to share customer information\n\nThe FATF, created 30 years ago by the Group of Seven leading nations, conducts regular evaluations of anti-money-laundering laws in its 37 member countries. Receiving a negative evaluation can be embarrassing or, if the violations are severe enough, can restrict a country’s access to the financial system. The U.S. Treasury Department has said the travel rule applies to crypto firms.\n\nThe FATF guidelines are intended to prevent regulatory arbitrage across the globe, and to encourage countries to strengthen their cryptocurrency regulations.\n\n“What we are doing is really providing a level playing field,” said Tom Neylan, senior policy analyst at the FATF.\n\nThe travel rule also is intended to provide an audit trail that investigators could use in the aftermath of a terrorist attack, and give regulators a tool to implement targeted sanctions, Mr. Neylan said.\n\nThe challenge facing the industry is to develop an approach for sending and receiving customer data safely and in a standardized way. Executives say they are meeting regularly, participating in working groups and evaluating proposals from technology providers.\n\nFiguring out a path forward could take several months, compliance officers and other industry executives said.\n\n“The industry is looking at what technical solutions exist, and what should the standards be?” said Teana Baker-Taylor, executive director of Global Digital Finance, a London-based association that has organized a working group to focus on travel-rule standards for data storage, governance and other issues.\n\nThe FATF requirements have been criticized in the industry. Among the complaints: They could be costly for startups, and potentially ill-fitted for an industry that places a cultural value on transacting anonymously.\n\nThere is also a worry that the travel rule will encourage frustrated customers to rely more on unregulated peer-to-peer transactions. The FATF is monitoring the issue, Mr. Neylan said.\n\nThe Chamber of Digital Commerce, a Washington-based trade group, in April asked the FATF to spend additional time working with crypto firms on the new standards.\n\n“We’re looking at old rules and how to apply them in this situation,” rather than looking at new ways for blockchain technology to help law enforcement, Amy Davine Kim, the chamber’s chief policy officer, said Friday.\n\nNewsletter Sign-up\n\nExecutives say they are grappling with several logistical challenges as they figure out the best way to comply. Chief among them is how to share information so that only other exchanges and firms covered by the travel rule can view it, Mr. Horowitz said. The risk is that customer data could end up in the wrong hands.\n\n“How do we secure it?” said Jeff Kern, chief compliance officer at the U.S. unit of bitFlyer Inc., the Japanese exchange. “How do we verify members?”\n\nAdditionally, if non-FATF countries adopt a different set of rules for money transfers, it could create a thicket of regulations for crypto firms to comply with, said Jeremie Beaudry, chief compliance officer and general counsel at Celsius Network, a startup that allows customers to earn interest and borrow against their cryptocurrency.\n\n“Then it just turns into what we have in traditional finance or banking, which is different wire rules for different countries,” Mr. Beaudry said.\n\nThe FATF said in June it would monitor compliance by countries and firms and conduct a 12-month review in June 2020. Executives said getting a compliance system up and running by then is an ambitious goal.\n\nThe coming months will be a test for the emerging industry, Mr. Horowitz said. “What I am impressed with is how quickly a brand new industry can come together and work together,” he said. “We’re doing this all within a short amount of time.”\n\nWrite to Kristin Broughton at kristin.broughton@wsj.com", "description": "The cryptocurrency industry is rushing to comply with new anti-money-laundering standards that require exchanges and other firms to share information about their customers.", "authors": ["Kristin Broughton", "Kristin.Broughton Wsj.Com", "Jeff Horowitz", "Chief Compliance Officer At Coinbase", "On New Standards Requiring Cryptocurrency Companies To Share Customer Information"], "top_image": "https://images.wsj.net/im-107224/social", "published_at": "2019-09-16"}