{"pub": "yahoo", "url": "https://news.yahoo.com/democratic-candidate-tom-steyer-backs-rival-joe-biden-around-impeachment-inquiry-says-he-should-be-left-out-of-this-141419964.html", "downloaded_at": "2019-09-27 15:06:44.372194+00:00", "title": "Democratic candidate Tom Steyer backs rival Joe Biden around impeachment inquiry, says he 'should be left out of this'", "language": "en", "text": "Long-shot presidential candidate Tom Steyer, a billionaire hedge fund manager and leading Democratic donor, ruled out attacks on former Vice President Biden at the next Democratic primary debate over the allegations that are central to the impeachment inquiry.\n\n“This is an attempted smear by the Trump campaign. Just the way he tried to smear Hillary Clinton,” Steyer said in an interview with Yahoo News Thursday, defending his political rival. “I think that Mr. Biden should be left out of this. I don’t think he’s done anything wrong. I think a bunch of newspapers looked at it and decided he hadn’t done anything wrong.”\n\nSet off by a whistleblower complaint against President Trump over his repeated calls for Ukraine to investigate Biden and his son Hunter and allegedly withholding almost $400 million in military aid from Ukraine as leverage, an impeachment inquiry was announced earlier this week. Trump denounced the opening of a formal impeachment inquiry, which had been announced by House Speaker Nancy Pelosi on Tuesday, and turned to attacking Biden.\n\nTrump and his lawyer, Rudy Giuliani, have accused Biden, during his term as vice president, of intervening with the government of Ukraine in an effort to advance his son’s business interests there.\n\nSteyer, who has been described as “fiercely competitive and used to getting his way,” said he will continue to believe Biden “unless something new comes up,” but doubts anything will.\n\n“I don’t think there’s any question that that’s a red herring in this story,” he said. “The story here is that the president of the United States once again put himself ahead of the American people and used his office to help himself.”\n\nBefore Steyer announced his White House bid two months ago, he launched in 2017 a public education campaign, “Need to Impeach,” investing about $40 million in “a national movement of passionate, energetic advocates committed to removing Donald Trump from office.”\n\n2020 Democratic presidential candidate Tom Steyer at the Yahoo offices in New York City on Sept. 26, 2019. (Photo: Gordon Donovan/Yahoo News) More\n\nSteyer took to Twitter Tuesday to cheer the inquiry decision: “Two years ago, we began a movement to hold this lawless, criminal president accountable. We are finally at a watershed moment. The beginning of an official impeachment inquiry is the beginning of taking our democracy back.”\n\nHe now says “it feels like the grassroots won, like the people of the United States were on this.”\n\n“This was always about the people, and it’s still about the people,” Steyer continued. “In fact, the actual court that counts is the court of public opinion.”\n\nPelosi, who has stressed for some time that any impeachment process should be understandable to the general public and that the case against Trump needs to be “ironclad,” said, “Public sentiment is everything.”\n\n“With it, you can accomplish almost anything,” she said on Tuesday. “Without it, practically nothing.”\n\nOf the Ukraine scandal, Pelosi said, “We have many other, shall we say, candidates for impeachable offenses … but this one is the most understandable by the public.”\n\nTrump called the impeachment talk “ridiculous” and another “witch hunt.” On Thursday, after his acting Director of National Intelligence Joseph Maguire testified on Capitol Hill about the whistleblower complaint and confirmed the still-unidentified official “did the right thing,” the president lamented that House Intelligence Committee Chairman Adam Schiff would not look into Biden and his son’s dealings in Ukraine.\n\nThe unnamed whistleblower cited conversations and details provided by “more than half a dozen U.S. officials,” alleging that Trump is “using the power of his office to solicit interference from a foreign country in the 2020 U.S. election.” These efforts included Trump’s personal attorney, Rudy Giuliani, urging the government in Kyiv to investigate Biden’s role in pressing for the ouster of state prosecutor Viktor Shokin in 2016.", "description": "Long-shot presidential candidate Tom Steyer, a billionaire hedge fund manager and leading Democratic donor, ruled out attacks on former Vice President Biden at the next Democratic primary debate over the allegations that are central to the impeachment inquiry.", "authors": ["Kadia Tubman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/AIz6dIgXkm8kZ198M.KjXQ--~B/aD0zMjM4O3c9NDg1NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/5f330a40-e129-11e9-bff7-470f504b61be", "published_at": "2019-09-27"}