{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7545633/Cody-Simpson-displays-ripped-physique-competes-swim-meet.html", "downloaded_at": "2019-10-07 09:36:50.998869+00:00", "title": "Cody Simpson displays his ripped physique as he competes in swim meet", "language": "en", "text": "He was recently spotted locking lips with Miley Cyrus on Thursday.\n\nAnd Cody Simpson looked in high spirits as he competed with his University of Southern California swimming team against several other schools during a meet on Saturday.\n\nThe Australian singer, 22, displayed his ripped physique in skin-tight black swimming trunks as he joined several other college students at the event.\n\nFun in the sun: Cody Simpson, 22, looked in high spirits as he competed with his University of Southern California swimming team against several other schools during a meet on Saturday\n\nShowing off his array of inkings, Cody stood on the edge of the pool and practiced some of his moves while wearing a pair of goggles with his wet hair slicked back.\n\nCody has long been an avid swimmer and often shares a glimpse at his training schedule to his social media.\n\nThe singer previously gave fans a look at how he maintains his physique, saying he mostly sticks to body weight movements.\n\nHe wrote: 'I rarely use weights & keep it mostly body weight strength, mobility & a s**t ton of core. Stay loose!'\n\nSport: The Australian singer displayed his ripped physique in skin-tight black swimming trunks as he joined several other college students at the event\n\nThings appear to be going well for Miley, 26, and Cody, with the heartthrob taking to social media on Sunday to serenade his new love.\n\nCody shared a monochrome video cuddling up to Miley while they watched a movie together in bed.\n\nThe hitmaker sung More Today Than Yesterday, made famous by Spiral Starecase in 1969.\n\nLove is brewing! Cody serenaded Miley Cyrus in a sweet video on Sunday. The singer was in bed with the beauty when he began singing the 1969 hit love song, More Than Yesterday\n\nThe old song speaks about loving someone more and more each day.\n\n'I don't remember what day it was / I didn't notice what time it was / All I know is that I fell in love with you / And if all my dreams come true / I'll be spending time with you,' the song begins.\n\nThe chorus, which Cody was singing, says: 'Oh, I love you more today than yesterday / But not as much as tomorrow / I love you more today than yesterday / But, darling, not as much as tomorrow.'\n\nGrowing love: The old song speaks about loving someone more and more each day\n\nLyrics: The chorus, which Cody was singing, says: 'Oh, I love you more today than yesterday / But not as much as tomorrow / I love you more today than yesterday / But, darling, not as much as tomorrow'\n\nCody's profession of love come after Miley called off her relationship with Kaitlynn Carter as things were moving too fast, according to TMZ.\n\nA source said: 'There was no cheating or fighting involved in Miley's decision to break things off after a 2-month whirlwind romance.'\n\nThe insider added that the pair 'got along like a house on fire', and even discussed the prospect of marriage.\n\nMiley recently took to social media to blast haters who were 'slut-shaming' her following backlash over her PDA with the ex-boyfriend of Kylie Jenner and Gigi Hadid.\n\nThe Mother's Daughter singer first began her post by showing some love for Cody on her platform, in which she included a topless snap of him.\n\nToo fast, too soon: Cody's profession of love come after Miley called off her relationship with Kaitlynn Carter as things were moving too fast, according to TMZ\n\nLong-term pals: Cody and Miley have been friends for years - spotted here in 2015\n\nShe added a gushing checklist, listing out the hunk's credentials: his age, Australian nationality (which she mentioned is 'my type'), and his 'abs'.\n\n'I know the public feels invested in my past relationship [with ex Liam Hemsworth] because they felt like they saw it thru from the beginning,' the star began her longer confessional.\n\n'I think that's why people have always felt so entitled over my life and how I live it because they've watched me grow up.'\n\n'But I am grown now,' Miley continued, 'and make choices as an adult knowing the truth/details/reality.' People only \"know\" what they see on the internet.'\n\nMiley also addressed the inequity of how famous women are portrayed in their pursuit of love and intimacy, as compared to famous men.\n\n'Men (especially successful ones) are RARELY slut shamed. They move on from one beautiful woman to the next MOST times without consequence. They are referred to as \"legends\", \"heart throbs\",' she continued, 'where women are called s***s/w****s! I am trying to just THRIVE/survive in a \"mans\" world.'\n\nThe tick of approval: The Mother's Daughter singer first began her post by showing some love for Cody on her platform, in which she included a topless snap of him\n\nNot standing for haters! After specifically responding to being recently spotted kissing Cody, she addressed the budding relationship on the next screen of her Instagram story\n\n'If we can't beat em, join em!' Miley concluded the section. 'If our president can \"grab em by the p***y...\" can't I just have a kiss and acai bowl?!?!'\n\nAfter specifically responding to being recently spotted kissing Cody, she addressed the budding relationship on the next screen of her Instagram story.\n\n'I refuse to recluse and \"date\" from home cause A. That's not fun B. Extremely uncomfortable/puts me in a vulnerable position,' the Slide Away performer expressed.\n\n'I would like to share an activity with someone I am dating and not be stuck at home with pretty much nothing to do but \"Netflix and chill\".\n\n'This \"dating\" thing is new to me too. I've never been an \"adult\"/grown a** woman experiencing this... I was in a committed relationship for almost All my teens and early 20s; with the exception of a few breaks, which usually in those times I was working my a** off with not much R&R... and \"meeting/trusting\" people in my position is really tuff.'\n\n'Don't f***ing pity me, not what I'm asking for,' Miley concluded. 'I have a great life I wouldn't trade for \"privacy\" but PLEASE don't make this awkward for me! I am trying to make light and like always MAKE FUN of myself/and the public's perception of me! Get used to me dating – this is where I am at!'\n\nMiley's new love comes following her split from husband of eight-months, Liam Hemsworth.", "description": "The singer, 22, looked in high spirits as he competed with his University of Southern California swimming team against several other schools during a meet on Saturday.", "authors": ["Sean O'Grady", "Annita Batiwala For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/10/19387296-0-image-a-9_1570439509894.jpg", "published_at": "2019-10-07"}