{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7561171/Womans-horror-Woolworths-Discovery-Garden-pot-spontaneously-combusts.html", "downloaded_at": "2019-10-11 02:29:32.165305+00:00", "title": "Woman's horror as her Woolworths Discovery Garden pot 'spontaneously combusts'", "language": "en", "text": "A Woolworths Discovery Garden owner has claimed their pots 'spontaneously combusted' and caught on fire.\n\nSocial media user Kael Veenstra-Young shared a picture of what appeared to be two smouldering seed pots with the edges clearly blackened.\n\nThe woman said the pots belonged to a friend and had been outside and dry on a hot day when they caught alight.\n\nScroll down for video\n\nA Woolworths Discovery Garden owner has claimed her pots 'spontaneously combusted' and caught on fire (pictured)\n\nShe added the friend had been watering the tiny seedlings every day.\n\n'Warning - these little seed packs that Woolworths are giving out can catch fire,' she wrote on Facebook.\n\n'It's a hot day and they were outside and dry and they spontaneously combusted.'\n\nWhile some commenters on her post reacted in shock, others blamed the Woolworths gardener for not following safety instructions.\n\n'Says not to leave them outside when sprouting - no wonder they got so dry and lit up,' one person wrote.\n\n'They should not be in full sun in this state. They are too small to stay sufficiently hydrated,' another added.\n\nThe woman said the pots belonged to a friend and had been outside and dry on a hot day when they caught alight (blooming Discovery Garden pictured)\n\nA Woolworths spokesman told Daily Mail Australia they were looking into the claim the pots had caught fire.\n\n'As a general gardening rule, keep your plants out of direct sunlight for prolonged periods and away from surfaces that may increase the intensity of direct sunlight, such as metallic surfaces,' the spokesman said.\n\n'It is also important to check that the soil is adequately watered. Soil that requires watering will be dry and dusty to the touch and may also be a lighter colour. Seedlings need to be kept well watered in order to thrive.'", "description": "A Woolworths Discovery Garden owner has claimed their pots 'spontaneously combusted' and caught on fire. A social media user said the pots belonged to a friend and had been outside on a hot day.", "authors": ["Charlie Coë For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/02/19567532-0-image-a-30_1570758474689.jpg", "published_at": "2019-10-11"}