{"pub": "reuters", "url": "https://ca.reuters.com/article/topNews/idCAKBN1WW2TJ-OCATP", "downloaded_at": "2019-10-18 01:17:13.768931+00:00", "title": "Canada's Trudeau should resign if he fails to win the most seats: Conservative leader", "language": "en", "text": "OTTAWA (Reuters) - Canadian Prime Minister Justin Trudeau should resign if he fails to win the most seats in next week’s election, his main rival, Conservative opposition leader Andrew Scheer, said on Thursday.\n\nLiberal leader and Canadian Prime Minister Justin Trudeau and his wife Sophie Gregoire Trudeau campaign for the upcoming election, in Terrebonne, Quebec, Canada October 17, 2019. REUTERS/Stephane Mahe\n\nPolls show Trudeau’s Liberals in a statistical tie with the Conservatives four days ahead of Monday’s vote, suggesting no party will gain a majority of seats in the House of Commons. Four other parties may win seats, but far fewer than the Liberals or Conservatives.\n\n“A prime minister that enters into an election and comes out of that election with fewer seats than another party resigns,” Scheer told reporters during a campaign stop in Brampton, Ontario. “That is a modern convention in Canadian politics.”\n\nParliamentary rules and constitutional experts disagree. They say that if the election ends with no party having a majority, the incumbent prime minister can test his or her standing with a vote of confidence in the House of Commons.\n\nTrudeau, who has potential allies in the left-leaning New Democrats (NDP) and the Green Party, could win fewer seats than the Conservatives and still govern if he garners the support - formal or informal - of another party.\n\nAsked during a campaign stop in Trois-Rivieres, Quebec, whether he would be willing to form a coalition with the NDP, Trudeau did not answer the question or rule it out. Coalition governments are formal alliances where allied parties share Cabinet positions.\n\n“We are going to elect a government with Liberal MPs from right across the country,” Trudeau told reporters.\n\nCanada has had only one federal coalition and that was in 1917, during World War One. Informal alliances in the case of minority governments have happened more frequently.\n\nScheer has said he would not join forces with another party, and it is unclear if he could turn to the separatist Bloc Quebecois for help.\n\nNDP leader Jagmeet Singh has said he would not support a Conservative minority. But he added on Thursday that “coalition” was not a dirty word.\n\n“Whatever Canadians choose in any form, if you have New Democrats, whether we’re in government ... whether that’s in opposition, whether that’s working together with others, whether that’s in a coalition, you get fighters,” he said at a diner in Welland, Ontario.\n\nBloc Quebecois leader Yves-Francois Blanchet, whose party has surged in opinion polls, said his support for anyone would be issue-based.\n\n“I will not help any particular party. I will not be part of a coalition,” he said in French. “I will work on an issue-by-issue basis. If what is proposed is good for Quebec, I will vote in favor. If not, I will vote against.”", "description": "Canadian Prime Minister Justin Trudeau should resign if he fails to win the most seats in next week's election, his main rival, Conservative opposition leader Andrew Scheer, said on Thursday.", "authors": ["Kelsey Johnson", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191017&t=2&i=1442022836&w=1200&r=LYNXMPEF9G22R-OCATP", "published_at": "2019-10-17"}