{"pub": "washingtonpost", "url": "https://washingtonpost.com/business/2019/09/23/micro-unit-studio-condo-dc-mount-vernon-triangle-lists", "downloaded_at": "2019-09-23 10:34:51.781881+00:00", "title": "Micro-unit studio condo in D.C.'s Mount Vernon Triangle lists for $355,000", "language": "en", "text": "\n\nThe 473-square-foot studio condo at 400 Massachusetts Ave. NW, Unit 804, is listing for $355,000. (HomeVisit)\n\nSometimes, location is everything. If you’re longing to live in downtown Washington in the Mount Vernon Triangle neighborhood where you can walk to work, hop on Metro and stroll to bars, restaurants, museum exhibits, concerts and games at Capital One Arena, you may want to consider a micro-unit.\n\nThe median sales price in July for homes in that neighborhood and the surrounding communities of Shaw and U Street was $622,500, according to Bright MLS. If your budget is capped at $400,000, a studio may be what you can afford in this sought-after neighborhood.\n\n[Hollywood-style condo/hotel planned for D.C.’s Mount Vernon Triangle]\n\nFor example, the 473-square-foot studio at 400 Massachusetts Ave. NW, Unit 804, is priced at $355,000. Monthly condo fees are $316, and annual property taxes are $1,697.\n\nThe prime amenity for this unit is its location, within a few blocks of Red, Yellow and Green Line Metro stations. In addition, the building has amenities that may make up for the small condo unit. The building offers a 24-hour concierge service; a rooftop deck with a swimming pool, grills and monument views; a second-floor party room; a business center; and a gym. Garage parking is available, and the building is pet-friendly.\n\nThe eighth-floor condo has hardwood floors, granite counters, stainless-steel appliances and a washer and dryer. There are built-in shelves to improve efficiency in the small unit, soundproofing panels for quiet and a renovated bathroom with subway tiles and wood panels.\n\nFor more information, contact real estate agents Mandy Hursen at 240-476-9959 or Timothy Hursen at 202-518-8781, both with RLAH real estate brokerage.", "description": "AFFORDABLE HOME OF THE WEEK | The building offers a 24-hour concierge service, a rooftop deck with a swimming pool, grills and monument views, a second-floor party room, a business center and a gym.", "authors": ["Michele Lerner", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/bTdx9N4JdkJEnglTJKNDLZe1bFQ=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VK2XBF3L4ZGQHME6H3KOPFWKSM.jpg", "published_at": "2019-09-23"}