{"pub": "afr", "url": "https://afr.com/life-and-luxury/travel/secrets-of-our-distant-ancestors-beneath-the-hills-of-spain-20190924-p52ug5", "downloaded_at": "2019-10-15 00:03:16.505896+00:00", "title": "Secrets of our distant ancestors beneath the hills of Spain", "language": "en", "text": "Farther in we are shown a large fish and faint outlines of bison, plus abstract constructions that seem to foreshadow later artists of this land, such as Pablo Picasso and Salvador Dali.\n\nIt’s alarming to find we’ve walked half a kilometre, and are scores of metres under the surface. The cave system extends a further two kilometres and dives deeper, but 500 metres is the limit for visitors.\n\nThe outline of a fish in the Cueva de la Pileta.\n\nTo underline our remoteness, the guide has us turn off our lanterns. Edging closer together, absorbed by the pitch blackness, we are doubly aware of the sound of our breathing and of faintly trickling water. Mischievously, the guide tells us it’s his first day on the job and he’s not sure of the way out.\n\nThe cave paintings, together with human and animal (goat, pig, ibex) bones, pottery and remnants of fires, attest to habitation from the last Ice Age until about 4000 years ago. The drawings we see have been dated at 20,000 BC, but others deeper in the cave system are 30,000 years old.\n\nIn 1905, 20-year-old farmer José Bullon ventured deep into the cave to collect nitrogen-rich bat droppings to fertilise his fields. He stumbled on ancient bones and pottery, and then the strange art. His descendants still run the farm, showing visitors through the caves, mercifully without the high-tech special effects of tourist-centred archaeological sites run by big enterprises or government departments. It’s all very rustic and original.\n\nRonda offers sweeping views of the Andalusian countryside. Getty\n\nMost significantly, we see real paintings. Perhaps not as showy as some in Altamira in northern Spain or Lascaux in France – but tourists there are ushered into nearby replicas, a response to damage from the respirations of millions of past visitors.\n\nErnest Hemingway extolled Ronda as Spain’s loveliest town, and he particularly admired its bullring. But I much prefer those long-gone wild beasts on the walls of a nearby cave, and their elusive creators.\n\nAt a glance\n\nTours of the cave run several times a day, at €10 ($16) per adult, €6 for kids. The cave's (charmingly antiquated) website is cuevadelapileta.org, but to book a place it's best to telephone +34 687 133 338 between 10am-12.30pm or 4pm-5.30pm local time).\n\nTrains to Ronda from Granada take about 2.5 hours, and leave at 6.45am, 12.45pm and 5pm. From Madrid, the journey is just under four hours via bullet train, with trains leaving at 8.35am and 3.05pm. Bookings can be made online at renfe.com.\n\nTaxis from Ronda can be booked via ronda.taxi – €65 for a round trip from Ronda, including an hour’s wait time at the cave. A cheaper option if you have more time is a local train from Ronda to Benaojan-Montejaque for €8 return (20 minutes, five times a day), followed by a 4-kilometre uphill walk (about an hour).\n\nThe 68-page bumper Grand Journeys issue of Sophisticated Traveller is out on Friday, October 18 inside The Australian Financial Review. Follow Sophisticated Traveller on Instagram.", "description": "Dating back 20,000 years, Andalusia’s underground cave art provides a cool lesson in ancient history.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.1223%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_2/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/97b3461a81d56daa8164fb5af0ed9dabf1f69393", "published_at": "2019-09-24"}