{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/micron-is-a-tricky-name-and-i-m-holding-up-for-now-15106526", "downloaded_at": "2019-09-27 16:22:42.509329+00:00", "title": "Micron Is a Tricky Name and I'm Holding Up for Now", "language": "en", "text": "Gonna Leave A Mark\n\nHow deep a mark? How broad a mark? That remains to be seen. Shares of Micron (MU) are trading more than 9% lower now that the bell has rung. The broader semiconductor space is lower with Micron, but in much more pedestrian fashion. There is no fire sale across the space. Not even for direct competitors in the memory biz such as Western Digital (WDC) .\n\nFor the firm's fiscal fourth quarter (2019), Micron posted adjusted GAAP EPS of $0.56 on revenue of $4.87 billion. Both line entries managed to beat expectations. However, in comparison to the same quarter one year ago, earnings growth printed at -84% (following quarters of -39% and -67% sequentially) on revenue growth of -42% (following -21% and -39%). These numbers are not misprints. Operating cash flow printed in steep decline as well, at $2.23 billion. This is down from $2.71 billion sequentially, and from $5.16 billion from Q4 2018. For the full year, operating cash flow hit the tape at $13.19 billion down from $17.4 billion. So, given that growth is awful, the numbers that hit the tape did beat consensus. Why the beat-down? It's all in the presentation... and the guidance. Let's explore.\n\nThe Nitty Gritty\n\nFor this current quarter, Micron projects adjusted EPS of $0.49, with wiggle room of seven cents on either side. Not bad. The firm expects revenue of $4.8 billion to $5.2 billion, which is actually above consensus view of $4.76 billion. Sarge, I thought you said something about guidance? Hold on, I'm still getting there.\n\nGross margin appears to be a problem. For the quarter reported, gross margin comes in at 28.6% of revenue, down from 38.2% for Q3, and from 61% for Q4 2018. The firm projects that gross margin will land between 25% to 28% for FY 2020. The firm spent $9.11 billion capital expenditures in 2019, and $2.66 billion on the repurchase of 67 million shares for the year as well. This leaves the firm with a net cash position of $3.4 billion. The firm expects to reduce capex to $7 billion-$8 billion for FY 2020.\n\nDRAM\n\nFor FY 2020, the firm sees bit supply close to market demand, with cost reductions to moderate. We can live with that. I think.\n\nNAND\n\nThe firm sees minimal reductions to expenses for FY 2020, with bit growth significantly below industry demand due to inventory for the calendar year. Ouch.\n\nHuawei\n\nObviously, the U.S. ban on doing business with Chinese telecom giant/5G leader Huawei has damaged sales \"meaningfully.\" On that front, the firm has applied for waivers from the U.S. government, but admits that unless those waivers are granted sales will continue to worsen in subsequent quarters.\n\nMy Thoughts\n\nThis is a tricky name, no doubt. I have made money being long Micron in the past when I was sure that I needed to get out. I have lost money being long Micron when I was sure that I was right. This quarter is no disaster by any means. Projections are just numbers and words in this case. This stock will trade on headlines concerning the trade war with the U.S. and China. A little positivity there could easily wipe away this morning's negativity.\n\nThe Chart\n\nThe problem that I see with this chart, and I have been flat this name for a while... so this is 20/20 hindsight, is that the stock broke above a pivot created by a cup with handle pattern back in early July. At the September top, the gain off of that move comes to roughly 22%, or more than the 20% we usually shoot for on a breakout. In other words, the target would have been around 51 on that move.\n\nNow, you have a break below the 50 day SMA . These kinds of breaks are often exacerbated by an algorithmic response. Does the gap created this morning eventually fill? Technically, I think there is a good chance. Then again, that will rely on trade headlines. Traders might want to watch this one over the weekend, unless the shares weaken substantially this afternoon. Personally, I would rather hold up until I see some basing. In the past, when this stock pierces either that 50 day line or the 200, it does tend to at least approach the other in somewhat violent fashion. I could be wrong, but I think the patient may be able to hold out for prices closer to $40. Like I said... tricky name.", "description": "Traders might want to watch this one over the weekend, unless the shares weaken substantially this afternoon....MU", "authors": ["Stephen Guilfoyle", "Micron Is A Tricky Name", "I'M Holding Up For Now", "Traders Might Want To Watch This One Over The Weekend", "Unless The Shares Weaken Substantially This Afternoon.", "Stocks Quotes In This Article", "Jonathan Heller", "Bruce Kamich", "Jim Cramer", "Alex Frew Mcmillan"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/7a19f546-b68f-11e8-89b6-8d5e23b67ef9.png", "published_at": "2019-09-27"}