{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/india-court-halts-tree-felling-metro-project-protests-191007134720379.html", "downloaded_at": "2019-10-07 20:02:44.425585+00:00", "title": "India court halts tree felling for metro project after protests", "language": "en", "text": "A mass felling of trees in one of the world's most polluted megacities was halted by India's top court on Monday, amid protests arguing their removal would strip the city of a precious \"green lung\".\n\nSome 2,700 trees were being cut down in the financial capital Mumbai to make way for a depot for subway carriages in the city of nearly 20 million people.\n\nBut the felling angered locals, with Bollywood stars and residents joining regular demonstrations that grew over the weekend after workers started removing the trees at night.\n\nMore than two dozen activists arrested during weekend protests were all later released on bail, the police said.\n\nFollowing an emergency hearing called after petitions from activists, the Supreme Court said no more trees in the suburb of Aarey were to be felled until a next court session on October 21 - the same day crucial state elections are to be held, with the dispute taking on political significance.\n\nThe Shiv Sena, a powerful local ally of Prime Minister Narendra Modi's ruling Bharatiya Janata Party (BJP), has criticised the national government over the felling.\n\nThe subway project has sharply divided opinion and triggered a nationwide debate over conservation and the need for development.\n\nSupporters say Mumbai - ranked the world's fourth most polluted megacity by the World Health Organization last year - badly needs new transport, citing its overburdened colonial-era railway system used by some 7.5 million people every day.\n\nOfficials have defended the construction, saying only 30 hectares (74 acres) of the 1,300 hectares (3,212 acres) that make up Aarey - a lush, green oasis close to the Sanjay Gandhi National Park - were being cleared.\n\nPart of the dispute over the development is whether the area should fall under forest protection laws that cover the national park.\n\nPolice have barricaded all access points to Aarey, and on Monday stopped activists and journalists from entering the area.\n\nEnvironmental activist Puja Damadia told AFP that after the decision was handed down, residents reported \"hearing chainsaw noises, which means the trees are still being cut\".\n\n\"We cannot go inside to even vet the information. Mumbai police has not been letting us organise protests anywhere in the city ... despite procuring permissions in advance,\" she said.", "description": "Supreme Court stops cutting down of 2,700 trees in one of the world's most polluted cities after protests.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/7/4e82e8ade7874544a57c8ee2b44c3910_18.jpg", "published_at": "2019-10-07"}