{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/fed-chair-powell-spoke-dimon-corbat-after-july-rate-cut-2019-10-1028577871", "downloaded_at": "2019-10-05 00:04:17.065689+00:00", "title": "Jerome Powell held calls with the CEOs of JPMorgan and Citigroup the day after the Fed cut rates for the first time since 2008", "language": "en", "text": "AP Photo/Patrick Semansky\n\nFederal Reserve Chairman Jerome Powell held phone calls with top Wall Street executives at the start of August.\n\nThat came a day after the central bank cut interest rates for the first time since the global financial crisis.\n\nPowell spoke with JPMorgan's Jamie Dimon for seven minutes and Citigroup's Michael Corbat for 15 minutes on the morning of August 1, according to his public schedule.\n\nVisit Business Insider's homepage for more stories.\n\nFederal Reserve Chairman Jerome Powell held phone calls with top Wall Street executives at the start of August, a day after the central bank cut interest rates for the first time since the global financial crisis.\n\nPowell spoke with JPMorgan's Jamie Dimon for seven minutes and Citigroup's Michael Corbat for 15 minutes on the morning of August 1, according to his public schedule.\n\nLater that afternoon, financial markets dropped sharply after President Donald Trump abruptly announced he would move forward with tariffs on an additional $300 billion worth of Chinese products. The Fed had a day earlier lowered its benchmark rate by a quarter percentage point but signaled it was not necessarily the start of an easing cycle.\n\nPowell also met with Bank of America's Brian Moynihan for a half hour on August 14, the schedule said. Bank of America and Citigroup did not immediately respond to an email requesting comment. JP Morgan said it does not comment on meetings or calls with government officials.\n\nDimon, Corbat, and Moynihan separately spoke with Trump after a key recession signal flashed in mid-August for the first time since before the financial crisis .\n\nNow read: Ray Dalio warns the White House's latest plan to clamp down on Chinese investment could soon become a reality. Here's why he thinks 'all market participants need to worry.'", "description": "Federal Reserve Chairman Jerome Powell held phone calls with top Wall Street executives at the start of August. That came a day after the central bank cut...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d9792603e077413ca29f115-2400/ap19100652183006.jpg", "published_at": "2019-10-05"}