{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7620569/UK-backpacker-helped-convict-Ivan-Milat-says-serial-killers-death-doesnt-change-anything.html", "downloaded_at": "2019-10-28 07:37:31.448715+00:00", "title": "UK backpacker who helped convict Ivan Milat says serial killer's death 'doesn't change anything'", "language": "en", "text": "A British man who escaped backpacker killer Ivan Milat says the death of Australia's worst serial killer 'doesn't change anything'.\n\nPaul Onions was hitchhiking from Sydney to Mildura in January 1990 when a 'friendly' stranger with a handle-bar moustache offered him a lift at a shop near Mittagong, a tiny town in the New South Wales southern highlands.\n\nMr Onions soon got a bad feeling about Milat, who began making offensive, racist comments.\n\nSurvivor Paul Onions told 60 Minutes in 1996 that he first thought Milat looked like cricketer Dennis Lillee, and had been happy to get a ride. Soon he was running in terror. The death of the serial killer 'doesn't change anything', Mr Onions said, and he wants to put it behind him\n\nAs the white Toyota Landcruiser approached the Belanglo State Forest, Milat slowed down and pulled over, saying he would get some tapes to put some music on, which was odd as the cassettes were in between the men.\n\nSuddenly, he pulled out a gun and a length of rope, telling the 23-year-old 'this is a robbery'.\n\nThe young Englishman who had spent five years in the Navy didn't know that he was facing Ivan Milat, a dangerous serial killer who had killed his first victims just weeks earlier and would eventually be convicted of murdering seven people.\n\nIvan Milat was convicted of seven murders, five of which were committed after Paul Onions escaped. Milat is thought to have killed more people but has taken his secrets to the grave\n\nBut he realised he was in terrible danger.\n\n'When I seen the rope, that just scared me more than the gun,' he told 60 Minutes in 1996.\n\n'As soon as I seen the rope, I thought that's going to take a bit of time and he's going to do whatever he wants.'\n\nMr Onions panicked and ran.\n\n'I just thought, ''This is it, run or die'', so I undid my seatbelt and jumped straight out of the vehicle and ran,' he said in 2010.\n\nThe Englishman heard the gun go off as he ran away. Milat shot at him while he tried to stop passing vehicles.\n\nIvan Milat pictured in May when he was transferred from prison to receive treatment in a public hospital for cancer. Milat died on Sunday morning at Long Bay Gaol\n\nMr Onions desperately tried to flag down passing cars before a motorist finally stopped for him just as he had decided to jump in front of the next one.\n\nGrandmother Joanne Berry, picked Mr Onions up and drove him to the nearest police station in Bowral, a small town in NSW where he gave a report of his ordeal.\n\nNSW Police did not immediately act on Mr Onions' report and it sat in a drawer for years as Milat killed five more victims.\n\nYears later, back home in the UK, Mr Onions saw reports of bodies found in the Belanglo state forest on the news, and contacted the Australian Federal Police who flew him back to Australia where he became the star witness in Milat's trial.\n\nMr Onions' evidence was key to Milat's conviction in 1996.\n\nPaul Onions attending court as the star witness for the prosecution of Milat in 1996\n\n1971 mugshot of Ivan Milat\n\nAlthough he was given a $500,000 reward for his testimony, he returned it saying that he did not want to be paid 'blood money'.\n\nMr Onions is now 53, and his partner has said he just wants to put it all behind him.\n\nIvan Milat died of cancer on Sunday aged 74 and is believed to have taken the secrets of at least three unsolved murders to his grave.\n\nAfter news broke of the serial killer's death, Mr Onions' partner went upstairs to speak with the survivor before returning to say that 'it doesn't change anything'.\n\n'He said he's fine, 'it doesn't change anything', he's absolutely fine,' Mr Onions' partner told News Corp Australia.\n\nAt the time of his escape, Mr Onions was terrified and trembling as he got into the car of his saviour, Joanne Berry of Canberra.\n\n'I was trembling and close to tears and I said to the woman driver: 'Just drive, he's got a gun,' he said after Milat's trial.\n\n'As the car sped off, I just remember this stupid grin on Milat's face and that look has stayed with me ever since.'", "description": "A British man who escaped backpacker killer Ivan Milat has said the death of Australia's worst serial killer 'doesn't change anything'.", "authors": ["Alison Bevege For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/06/20268116-0-image-a-29_1572243114813.jpg", "published_at": "2019-10-28"}