{"pub": "hotair", "title": "Leak plugged? Trump’s personal “gatekeeper” hits the exit; CNN: White House stunned", "url": "https://hotair.com/archives/ed-morrissey/2019/08/30/leak-plugged-trumps-personal-gatekeeper-hits-exit", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:03:31.283682+00:00", "text": "In any White House, discretion is a prized value in staffers, and perhaps even more so in the Donald Trump era. As Trump’s personal assistant in the Oval Office, Madeleine Westerhout should have known that better than most. Yet Westerhout has been shown the door, as multiple news organizations reported overnight, for sharing personal information about the First Family with reporters:\n\nPresident Trump’s personal assistant Madeleine Westerhout resigned from her job abruptly, a White House official and another person familiar with the situation told NBC News late Thursday night. One of the sources said that Westerhout left the job because she shared personal information about the president’s family and Oval Office operations at an off-the-record dinner with reporters earlier this month in Bedminster, N.J., where a Trump-owned golf club that the president often visits in summer months is located.\n\nAll of the outlets reporting this departure call it a resignation, but they all also strongly suggest that the resignation came under considerable duress. The New York Times first reported it and noted that the sequence of events started when Trump found out she was leaking information to reporters, and that she’s already persona non grata anywhere in the White House. Needless to say, that’s not a departure on mutually agreeable terms.\n\nThe Times’ Annie Karni and Maggie Haberman also take note of Westerhout’s political pedigree:\n\nMs. Westerhout, a former Republican National Committee aide who also worked for Mitt Romney’s 2012 presidential campaign, reportedly cried on election night because she was upset over Mr. Trump’s victory. As such, the president at first viewed her warily, as a late convert to his cause who could not be trusted. But some of Mr. Trump’s top officials — like John F. Kelly, who has since left as chief of staff — tried to turn Ms. Westerhout into an ally who could help them manage Oval Office traffic. They hoped that she could block individuals from reaching the president on the phone or in person, and that she would report back on the calls and meetings that made it through. Ms. Westerhout’s power in the White House came almost entirely from proximity. She is not a name-brand White House aide and has never appeared on television, unless it was an accidental shot of her hovering behind her boss. But while she was not a decision maker, she enjoyed unique access to Mr. Trump.\n\nTrump tends to be a little paranoid about working with other Republicans, but in this case his first instinct might have been correct. Karni and Haberman hint at Westerhout’s state of mind in the last paragraph of the above excerpt. Politico later reported that Westerhout was attempting a little empire-building in the White House, which might have led to a slap-down or two from more senior officials:\n\nIn the past six months, Westerhout had tried to expand the boundaries of her job to encompass a broader set of tasks and to include foreign travel, said one adviser close to the White House, who suggested Westerhout had tried to act like a de facto chief of staff. This irked several White House officials and Cabinet secretaries who thought she should stick to her primary task of serving as the president’s personal secretary with a desk just outside the Oval Office. … The White House was buzzing for most of the day on Thursday about her potential departure — especially after officials learned that she had attended an off-the-record dinner with reporters in Bedminster, N.J., where she was said to have shared overly personal details about the president’s life. The close White House adviser called this “the final straw” for someone who did not have many allies left in the building.\n\nUnder those circumstances, one has to wonder whether Westerhout got set up by rivals within the White House. That’s the kind of games that get played when low-level staffers try acquiring power at the expense of others with better connections. It’s just as likely, if not more so, that a lack of success led Westerhout to lose her sense of discretion and/or attempt to gain more power by manipulating the press against her real and perceived rivals.\n\nAt least, those are the fun explanations. If this turns out to be just the mundane circumstance of a secretary with trouble keeping her mouth shut after having a couple of drinks, it’ll be a disappointment. Even so, Westerhout’s exit will serve as a warning to others to keep their mouths shut whatever the circumstance might be.\n\nUpdate: CNN reports that other staffers are stunned by her ouster. However, it also appears that she was on the short list of suspected leakers even before the most recent catalyst:", "description": "Empire building?", "authors": ["Ed Morrissey", "Taylor Millard", "Karen Townsend", "John Sexton", "Andrew Malcolm"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/08/westerhout-cohn.jpg"}