{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/everything-eyeing-glossier-black-friday-131100155.html", "downloaded_at": "2019-10-24 15:06:58.350606+00:00", "title": "Everything We’re Eyeing in the Glossier Black Friday Sale", "language": "en", "text": "Attention pink bubble pouch lovers: Glossier’s biggest (and only) sale of the year is almost here, and, if you’re like us, you’re already daydreaming about a freshly stocked medicine cabinet of millennial pink favorites. But what exactly can we expect from Glossier’s black friday sale this year? If last year’s discounts are any indication, it offered 20 percent off on everything (seriously, every. single. item.) online and in stores. Oh, and online shoppers received free shipping on orders over $30—challenge easily accepted. While the brand hasn’t announced the details of any 2019 discounts yet, we predict it starts on Black Friday (November 29) and runs through Cyber Monday (December 2), but check back here in the coming weeks for confirmed details.\n\nIn the meantime, if you need help deciding what to order, we’ve got you covered with our seven favorite products of all time—plus, two new ones that are about to hit cult status.\n\nRELATED: The 18 Best Perfumes for Women\n\nView photos\n\n1. Boy Brow\n\nNo other product in our makeup bag saves us as much time as this brow gel does. A few swipes creates perfectly fluffy, filled-in brows without requiring the time (and expertise) of pencil drawn arches with whatever the heck brush-like strokes are.\n\nBuy It ($16)\n\nView photos\n\n2. Cloud Paint\n\nThe easiest way to wake up your face, available in six complexion-suiting shades.\n\nBuy It ($18)\n\nView photos", "description": "Attention pink bubble pouch lovers: Glossier’s  biggest (and only) sale of the year is almost here, and, if you’re like us, you’re already daydreaming about a freshly stocked medicine...", "authors": ["Editor Purewow.Com", "Purewow"], "top_image": "https://s.yimg.com/uu/api/res/1.2/0RBZGRZYv9Zqz08grVWjGg--~B/aD0yODc7dz00MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/purewow_185/4d342c45c43c1441c08e17f3bb011cbd", "published_at": "2019-10-24"}