{"pub": "news24", "url": "https://news24.com/Columnists/GuestColumn/opinion-mantashe-betrayed-the-public-trust-why-he-must-be-charged-20191029", "downloaded_at": "2019-10-29 07:45:57.001210+00:00", "title": "OPINION: Mantashe betrayed the public trust. Why he must be charged", "language": "en", "text": "OPINION: Mantashe betrayed the public trust. Why he must be charged\n\nGwede Mantashe has betrayed the public trust placed in him and should, as a minimum, be immediately suspended pending the outcomes of a criminal investigation, writes Tebogo Khaas.\n\nWhen two philandering politicians duel for the affection of a nubile, enterprising lass an eclectic explosion of political intrigue, cover-ups and double standards inexorably emerge.\n\nThis could, inadvertently, threaten the integrity of a presidency predicated on a promise of ethical leadership and the rule of law.\n\nLet me explain.\n\nThe Sunday World broke a story which revealed a scandal involving Minerals and Energy Minister Gwede Mantashe, Finance Minister Tito Mboweni and a young female student. These salacious revelations punctuated a weekend pregnant with political machinations and intrigue.\n\nREAD | Mantashe bribery claims: 'Parliament must probe minister'\n\nMantashe, a married father of three and chairman of the ANC, has, reportedly, admitted to an extramarital affair with the student – arguably young enough to be his granddaughter – whose affections he competed for with Mboweni. Mboweni is unmarried.\n\nThis scandal has placed Mantashe on a shameful list of politicians who have been caught grazing on pastures other than those manicured for their matrimonial consummation.\n\nAnd just like his other already inducted comrades, Mantashe is unlikely to be admonished or censured by the toothless ANC integrity committee. His boss, President Cyril Ramaphosa, is unlikely to excoriate him either. The ANC hasn't even deigned to issue a statement on the saga.\n\nOn Sunday, millennial US Democratic congresswoman Katie Hill resigned her seat from Congress, a day after she admitted to an inappropriate relationship with a campaign staffer. Hill accuses her estranged husband of waging an abusive campaign to control and humiliate her now that their relationship is over.\n\nInstead of offering to resign over the embarrassment he has wrought to his family, his Cabinet colleagues, the ANC and the society he leads, Mantashe is ostensibly delirious over his newfound notoriety for his apparent feline-sque coital prowess.\n\nDemocrats once again proved that they are willing to uphold strict ethical standards meant to prevent abuse and harassment, even if the price of doing so means potentially giving up a seat to the opposition, should they lose the special election consequent upon Hill's resignation.\n\nMeanwhile, the Democrats, by accepting Hill's resignation, were holding her fully accountable even though her consensual affair falls nowhere near what we are accustomed to on these shores.\n\nInstead of offering to resign over the embarrassment he has wrought to his family, his Cabinet colleagues, the ANC and the society he leads, Mantashe is ostensibly delirious over his newfound notoriety for his apparent feline-sque coital prowess.\n\nIndeed, this demonstrates that the ANC is not just indifferent to serious incidents of predatory sexual and domestic abuse but, in some cases, the party is eager to support or encourage randy members who commit such acts. Whilst this criticism of the ANC may sound undeniably harsh, it is justified.\n\nAround the same time as Deputy President David Mabuza, in his capacity as the patron of the Moral Regeneration Movement was publicly lamenting \"a terrible breakdown of moral fibre of our society\", Mantashe was apparently out-sowing Mboweni with his wild oats, whilst showering his concubine with massive reams of dough.\n\nNevertheless, like the French, South Africans are unmoved about what politicians do in their private space. Mantashe is thus safe on this score notwithstanding the irony of his conduct being acutely inimical to the social and moral regeneration demands of government.\n\nBut perhaps what's remarkable, in fact astounding, about the alleged improprieties and subsequent turn of events is Mantashe's nonchalant admission that he had, reportedly, paid inducements to two journalists from the Sunday World, with the intention to prevent them from publishing the story.\n\nIt boggles the mind why Mantashe would readily admit to such a serious offence, only to do an about turn a day later. The Sunday World stands by its reporting.\n\nIt seems indisputable that Mantashe, based on the reported information, has committed an offence of bribery. If found to be credible, this episode, including the Bosasa state capture cloud still hanging over his head, could prove damning for his political future.\n\nWhereas it may not be a criminal offence to unleash the now-infamous tiger in him as he pleases, it is unlawful to offer or receive bribes.\n\nIn the end analysis, Mantashe has betrayed the public trust placed in him and should, as a minimum, be immediately suspended pending the outcomes of a criminal investigation. Ramaphosa's inaction could be interpreted as imperviousness on his part or fear to take necessary action against certain politicians.\n\nMantashe has risked the lives, health and wellbeing of his family. His shameful, selfish conduct has a corrosive effect on social mores, and exposes society's diminished moral fibre. What seems to irk some bachelors the most, however, is the fact that Mantashe and his freewheeling, state-sponsored profligacy distorts the dating market.\n\nThe irony of Mantashe, a supposed communist, splurging on an ostentatious lifestyle, compared to Mboweni, a supposed capitalist, who seems to lead a more frugal life, seems lost to the waBenzi commie.\n\nHill and Mantashe's cases illustrate the differences in ethical considerations between two political cultures, and society's gender-based double standards.\n\nAs most people would recall, during his campaign for election as US president, Donald Trump notoriously claimed that he could stand in the middle of New York City's 5th Avenue, shoot someone and nothing would happen to him.\n\nThe courts have, however, recently reminded Trump and his lawyers that, notwithstanding his justice department's policy which maintains otherwise, he is not immune to criminal prosecutions or investigations. Trump is currently a subject of an impeachment inquiry.\n\nIt is opportune that our criminal justice system be seen to be working effectively.\n\nThe proposition that the chairman of a ruling party and serving minister be criminally charged may sound too drastic, if not fantastical. However, if we are to be true to the values of our Constitution, we stand reminded that we are a nation governed by the rule of law.\n\nAnd in our constitutional democracy, nobody is above the law.\n\n- Khaas is chairman of Corporate SA, a strategic advisory and consulting firm.\n\nDisclaimer: News24 encourages freedom of speech and the expression of diverse views. The views of columnists published on News24 are therefore their own and do not necessarily represent the views of News24.\n\n\n\n", "description": "Gwede Mantashe has betrayed the public trust placed in him and should, as a minimum, be immediately suspended pending the outcomes of a criminal investigation, writes Tebogo Khaas.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7991/4ee0b1caed3b47738a6fc3868656bd8e.jpg", "published_at": "2019-10-29"}