{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/07/bernie-sanders-unveils-plan-get-corporate-money-out-politics-dnc", "downloaded_at": "2019-10-07 23:33:18.925478+00:00", "title": "Bernie Sanders Unveils Plan to 'Get Corporate Money Out of Politics'", "language": "en", "text": "Sen. Bernie Sanders (I-VT) on Monday unveiled his plans to get “corporate money out of politics”– a plan which would affect the DNC, specifically.\n\nSanders – who is recovering from a heart procedure after experiencing a heart attack last week– unveiled his plan to reduce the influence of corporate money in politics, and vowed to “ban corporate contributions to the Democratic Party Convention.”\n\n“In 2016, seventeen donors gave three-quarters of the Democratic National Convention funding, with large corporations like Bank of America, Peco Energy, Comcast, and Facebook each donating over $1 million,” Sanders website states.\n\n“Their lobbyists were everywhere and filled the VIP suites. This type of corporate sponsorship is a corrupting influence and must end if politicians are going to represent the American people,” it adds.\n\nThe bulk of Sanders’ proposal targets the “influence of corporations” at the Democratic National Committee. He pledges a lifetime ban on lobbying for National Party Chairs and Co-Chairs and aims to diminish their influence by banning chairs and co-chairs from working for entities:\n\nWith federal contracts.\n\nThat are seeking government approval for projects or mergers.\n\nThat can reasonably be expected to have business before Congress in the future.\n\nThe presidential hopeful also vows to ban donations from both corporations and lobbyists, and calls to “institute a lifetime lobbying ban for former members of Congress and senior staffers.”\n\nAnother facet of Sanders’ plan is to “ban advertising during presidential primary debates” due to the “outrageous sums of money” media outlets charge to run ads during debates.\n\nSanders uses CNN as an example:\n\nThis year CNN reportedly required a commitment of $300,000 before a sponsor could buy ad time during the presidential debates, and 30 seconds of air time can cost around $110,000,” Private media outlets are making enormous sums of money during events that are meant to inform the public about their candidates. Furthermore, many of their advertisers have vested interest in who is elected. This type of influence must end.\n\nHe also calls to end corporate influence on presidential inaugurations, arguing that it is “absolutely absurd that these entities are allowed to spend enormous sums of money in an attempt to garner favor with the President and Vice President of the United States.”\n\n“Our grassroots-funded campaign is proving every single day that you don’t need billionaires and private fundraisers to run for president,” Sanders said in a statement.\n\n“We’ve received more contributions from more individual contributors than any campaign in the history of American politics because we understand the basic reality that you can’t take on a corrupt system if you take its money,” he added.\n\nSanders has raised more than any other Democrat presidential candidate in the third quarter, reporting $25.3 million from 1.4 million individual donations. The average donation was $18.07, according to the Sanders campaign.", "description": "Sen. Bernie Sanders (I-VT) on Monday unveiled his plans to get \"corporate money out of politics\"– a plan which would affect the DNC.", "authors": ["Hannah Bleau"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-1172144034-640x335.png", "published_at": "2019-10-07"}