{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7561113/Ray-Hadleys-daughter-rushed-hospital-extreme-pain-endometriosis.html", "downloaded_at": "2019-10-11 02:28:58.435128+00:00", "title": "Ray Hadley's daughter is rushed to hospital in extreme pain due to endometriosis", "language": "en", "text": "Radio broadcaster Ray Hadley's daughter has been rushed to hospital suffering side effects from endometriosis.\n\nThe shock jock opened up about his 22-year-old daughter Sarah's battle with the 'extremely painful condition' during his show on 2GB on Friday.\n\nEndometriosis is a genetic disease which causes the tissue lining of the uterus to grow outside itself.\n\nScroll down for audio\n\nThe shock jock opened up about his 22-year-old daughter Sarah's (pictured) battle with the 'extremely painful condition' during his show on 2GB on Friday\n\nSarah has been 'putting up with it' for several years, Hadley said.\n\nHowever, the pain was so severe on Wednesday she was admitted to hospital for the second time in just six months.\n\n'She suffers dreadfully with pain, she can't walk, her legs just give out on her. She's going in next week for a second bout of surgery, it's just terrible.\n\nRadio broadcaster Ray Hadley's daughter has been rushed to hospital suffering side effects from endometriosis\n\n'She's been putting up with it for a couple of years, a bit longer possibly, and I haven't mentioned it because it's her health concerns, not mine.\n\n'But she said to me yesterday ''dad, someone's got to do something about this''.'\n\nHadley hoped to raise awareness around the illness, which he described as being 'as common as things like diabetes and asthma'.", "description": "The Australian shock jock opened up about his 22-year-old daughter Sarah's battle with the 'extremely painful condition' during his show on 2GB on Friday.", "authors": ["Kelsey Wilkie For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/02/19567112-0-image-a-59_1570757454148.jpg", "published_at": "2019-10-11"}