{"pub": "yahoo", "url": "https://finance.yahoo.com/news/asian-tech-icon-flirts-crisis-111438399.html", "downloaded_at": "2019-10-22 16:25:13.394527+00:00", "title": "Asian Tech Icon Flirts With Crisis After Whistle-Blowers Attack CEO", "language": "en", "text": "(Bloomberg) -- The dust had barely settled at Infosys Ltd. when Asia’s No. 2 software services firm once more found itself grappling with a potential leadership crisis.\n\nFor the second time in about as many years, the Indian icon synonymous with the country’s technological ascendancy is being forced to answer accusations of impropriety. In the most recent of a stream of grievances aired anonymously over past years, whistle-blowers accused Chief Executive Officer Salil Parekh of instigating employees to inflate profits, mis-represent the lucrativeness of deals, even of abusing travel privileges. In a memo reproduced in local newspapers, Parekh’s accusers offered emails and recordings to back up their claims.\n\nLittle evidence of wrong-doing has emerged publicly so far. Infosys pledged a full investigation Tuesday, while Parekh himself has remained silent. Yet investors blind-sided by the sheer volume of the charges wiped more than $7 billion off the company’s market value in a single day. They may still be smarting from 2017, when internal upheaval eventually sparked an ouster of the popular Vishal Sikka, paving the way for Parekh’s ascension and a board reshuffle.\n\n“The allegations appear serious and reputation is such a fragile thing,” said Harish Bijoor, a Bangalore-based brand consultant. “It is very unfortunate but this type of thing besmirches a company’s reputation in the eyes of employees, investors and clients.”\n\nRead more: Infosys Dives Most in 6 Years as Whistle-Blowers Target CEO\n\nThe events unfolding in Infosys’s home-town of Bangalore, the nation’s tech capital, bear a resemblance to those of 2017 that brought down the tech giant’s leadership. Two summers ago, a similar whistle-blower complaint alleged irregularities in a $200 million acquisition, setting off a chain of events that culminated in a vicious face-off with co-founder Narayana Murthy and Sikka’s removal. The accusations against him were never proven.\n\nSikka and Parekh, a former Capgemini SE executive, were the first outside professionals brought in to run the 38-year-old company, after several decades of co-founders taking turns to occupy the CEO’s office. Infosys’s shares have gained 50% since Parekh took the helm in January 2018, versus roughly 20% over Sikka’s three-year term. And the company’s revenue grew about 25% during both their tenures.\n\nYet the number of whistle-blower complaints spiked during Sikka’s and Parekh’s reigns, covering a plethora of topics. None spooked markets quite as much as the latest missive published in the Deccan Herald on Monday. The company is now taking the right steps, auditing the whistle-blowers’ letters and appointing a third-party investigator, said Sanchit Vir Gogia, chief executive officer of Singapore-based Greyhound Research.\n\n“The CEO has a difficult task at hand coming after the sudden exit of his predecessor, managing founder and investor expectations and operating in a difficult business environment,” he said. “The world over, companies take a ton of short cuts to look good in front of investors and analysts.”\n\nInfosys May Need Some Private Time to Fix Itself: Andy Mukherjee\n\nThe brewing crisis around Infosys is far from the only one to hit corporate India of late. State-run lender Punjab National Bank disclosed fraud, for instance, part of a series of scandals to hit the financial industry.\n\nInfosys itself can ill-afford the distraction. It’s grappling with fundamental changes in the software outsourcing industry, where younger rivals are snatching away contracts with newer technologies, and clients are moving away from the paid-by-the-hour outsourcing work that Infosys and rival Tata Consultancy Services Ltd. specialized in.\n\nAt Infosys, revenue growth slowed to single-digit percentages, while operating margins shrank. That marked the end of an era when its co-founders delivered stellar performances quarter after quarter, endearing the stock to investors. Fresh-out-of-college engineers compared a job offer from Infosys to winning the lottery.\n\nThis month, Infosys posted a 2% fall in quarterly profit after nervous clients held off on spending and growth in traditional service contracts stalled. That underscored the challenge for Parekh, who has pledged to drive growth.\n\nBoth he and Sikka have stressed investments in innovation, digital services and re-training employees in latest technologies such as automation and artificial intelligence. “To build the future Infosys, we have to make those investments now,” Parekh, who has a reputation for being calm and understated, told Bloomberg in an interview last year.\n\nStory continues", "description": "(Bloomberg) -- The dust had barely settled at Infosys Ltd. when Asia’s No. 2 software services firm once more found itself grappling with a potential leadership crisis.For the second time in about as many years, the Indian icon synonymous with the country’s technological ascendancy is being forced to", "authors": ["Saritha Rai"], "top_image": "https://s.yimg.com/uu/api/res/1.2/09AusWXS4XK1IRvGo073xg--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/21ba5ab08383181a365785bcf30d64f2", "published_at": "2019-10-22"}