{"pub": "fox", "url": "https://foxnews.com/sports/man-who-wrote-penn-states-jonathan-sutherland-to-criticize-his-hairstyle-speaks-out", "downloaded_at": "2019-10-09 02:12:07.913382+00:00", "title": "Penn State alum who wrote DB Jonathan Sutherland to criticize his hairstyle speaks out", "language": "en", "text": "The Penn State alumnus who wrote a “racist” letter to safety Jonathan Sutherland has said that making a racial or cultural statement “was not the intent at all.”\n\nNittany Lions defensive tackle Antonio Shelton and safety C.J. Holmes posted the letter Sutherland received criticizing his hairstyle to social media on Monday. The letter begged Sutherland to cut his long dreadlocks to look like the “clean cut” men of yesteryear.\n\nShelton had shared the letter on Twitter with the caption, “One of my teammates got this. Explain to me how this isn’t racist.\"\n\n“Though the athletes of today are certainly superior to those in my days; we miss the clean cut young men and women from those days. Watching the Idaho game on TV we couldn’t help but notice you--well-- awful hair,” Johnstown, Pa. native Dave Petersen wrote.\n\n“Surely there must be mirrors in the locker room! Don’t you have parents or girlfriend who’ve told you those shoulder length dreadlocks look disgusting and are certainly not attractive,” Petersen continued.\n\nHolmes added: “my teammate got this in the mail today, and tbh Im [sic] at a lost for words.. I also have locs [dreadlocks], Tats, and NFL dreams too, these messages can not be tolerated, this was extremely inappropriate, racially biased, and selfish to feel like you even have a right to send this message.\"\n\nPetersen told The Tribune-Democrat he was unaware that his letter had ignited a firestorm on Twitter, with many users accusing him of racial insensitivity. He said that “was not the intent at all. I would just like to see the coaches get the guys cleaned up and not looking like Florida State and Miami guys.”\n\n“It [his letter] wasn’t threatening or anything,\" Petersen added. \"I was just disgruntled about some of the hairdos that we’re seeing. You think of Penn State as a bunch of clean-cut guys. And you do see many who are clean cut. But the tattoos and the hair-- there are a lot of guys with hair coming down their backs and it just looks awful. And it’s the same for the NFL and NBA, too.”\n\nAccording to The Tribune-Democrat, Petersen is a 1966 Penn State graduate with a degree in speech pathology.\n\n\"You will certainly be playing 'on Sunday' in the future but we have stopped watching the NFL due to the disgusting, tattoos, awful hair and immature antics in the end zone. Players should act as though they've 'been there before,'\" the letter concluded.\n\nPenn State responded to Shelton's tweet by saying the letter does not align with their values.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"While we don’t know the source of this letter or the authenticity, obviously its content does not align with our values. We strongly condemn this message or any message of intolerance,\" the university tweeted.\n\nThe Nittany Lions have won their first five games of the season and are ranked No. 10 in the country. They travel to Iowa to play the No. 17 Hawkeyes Saturday night.", "description": "The Penn State alumnus who wrote a “racist” letter to defensive back Jonathan Sutherland has said that making a racial or cultural statement “was not the intent at all.”", "authors": ["Morgan Phillips"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Jonathan-Sutherland-Getty.jpg", "published_at": "2019-10-09"}