{"pub": "marketwatch", "url": "https://marketwatch.com/story/this-might-be-why-millennials-are-drinking-more-hint-theyre-short-and-loud-2019-09-05", "downloaded_at": "2019-09-06 12:12:03.623023+00:00", "title": "This might be why millennials are drinking more. (Hint: they’re short and loud)", "language": "en", "text": "Your kids really might be driving you to drink.\n\nAnd Constellation Brands Inc. would probably like to thank them for driving you nuts, particularly if you’re a millennial parent.\n\nConstellation’s chief financial officer acknowledged as much Wednesday during an interview at the Barclays Global Consumer Staples Conference in Boston.\n\nCFO David Klein mentioned that the company — which produces Corona beer and Robert Modavi wine, among other brands — has noticed that while Gen Z consumers are drinking less, there’s been an uptick in alcohol consumption by millennials.\n\nThat led Barclays analyst Lauren Lieberman to quip: “When you said the millennials are drinking more, I’m like ‘because they have kids.’”\n\n“Well, I think that’s exactly the answer,” Klein said, according to a FactSet transcript. “And what we don’t know though, is: Will we see that same thing with Gen Z as they age, will life get more stressful for them, and they drink a little more? But it’s too early to tell, but we definitely have seen that with millennials.”\n\nKlein said research found that the average millennial consumed about 24 drinks a month in 2013, but in 2019 that’s gone up to 29 drinks a month.\n\nHe added that Gen Z — those 21 to 24 — are drinking at a lower rate, but favoring higher quality brands. “I think what we have is people saying that they’re drinking less or drinking better,” he said.\n\nConstellation shares STZ, -2.50% are up 27% year to date, compared to the S&P 500’s SPX, +1.30% 19% gain.", "description": "Your kids really do drive you to drink.", "authors": ["Mike Murphy"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ799_badmom_ZG_20190905204631.jpg", "published_at": "2019-09-05"}