{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/teacher-under-fire-for-wearing-sweater-with-controversial-message-on-columbus-day-180906505.html", "downloaded_at": "2019-10-17 14:33:38.190641+00:00", "title": "Teacher under fire for wearing sweater with controversial message on Columbus Day", "language": "en", "text": "A Michigan teacher came under fire for wearing a sweatshirt with a controversial message on Columbus Day, WXYZ reports.\n\nEmma Howland-Bolton, a fifth-grade teacher at Clippert Multicultural Magnet Honors Academy in the Detroit Public Schools Community District, walked into school on Monday wearing a sweatshirt that read, \"Columbus was a murderer.\"\n\n\"I wanted to wear this shirt to spark discussion,\" she told the station.\n\nA school administrator took notice of the message and asked her to take the sweatshirt off.\n\n\"I was informed that my shirt was my opinion and I countered with it is a fact,\" the teacher explained.\n\nA teacher says she wore this shirt to school and found herself at the center of a controversy. Is this shirt a statement of fact or opinion? #ColumbusDay The story on @wxyzdetroit at 6. pic.twitter.com/L5sAJb1dq7 — Kim Russell WXYZ (@kimrussell7) October 14, 2019\n\nIn a statement, the Detroit Public Schools Community District told WXYZ that, in general, sweatshirts are not part of its business casual dress code. Administrators reportedly discussed the message on Howland-Bolton's shirt and determined that it had not been submitted as part of a pre-approved lesson plan. The teacher ultimately escaped the incident without any discipline.\n\nColumbus Day has long been the subject of intense discussion. For Native Americans, in particular, the holiday is a reminder of the 500 years of colonial oppression their community has experienced since European explorers and immigrants first settled here, according to NPR.\n\n\"Today, we understand that while [Columbus] was an explorer and is credited with being one of the first Europeans to arrive in the Americas, we now know a great deal about the history and the way that he and his people behaved when they came to this continent,\" Shannon Speed, a citizen of the Chickasaw Nation and director of the UCLA American Indian Studies Center, told the media outlet. \"Which included pillaging, raping and generally setting in motion a genocide of the people who were already here. That's not something we want to celebrate. That's not something anyone wants to celebrate.\"\n\nIn an effort to foster a more inclusive atmosphere, several major cities, including Los Angeles, Cincinnati, San Francisco and Atlanta, have instead renamed the holiday Indigenous Peoples' Day. States like Alaska, Minnesota, Vermont and South Dakota have also ditched Columbus Day in favor of one that honors Native Americans.\n\nStill, there has been some pushback.\n\nIn an opinion piece for the Washington Post this week, Henry Olsen argued that it is, in fact, possible to celebrate Columbus Day \"in the manner of a proud and decent society — one that can recognize its faults while proudly asserting its virtues.\"\n\n\"We are not perfect, but no human society ever is,\" Olsen wrote. \"We are simply what we have always been: a good society trying to get better. Columbus Day should be a celebration of that.\"", "description": "A Michigan teacher came under fire for wearing a sweatshirt with a controversial message on Columbus Day.", "authors": ["Justin Chan"], "top_image": "https://s.yimg.com/uu/api/res/1.2/QPzanve_yTIUR0nDsBUjuA--~B/aD0xMDIzO3c9MTYzMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/62bfb1d0-f02f-11e9-bb7d-4dbd53ed5103", "published_at": "2019-10-16"}