{"pub": "reuters", "url": "https://in.reuters.com/article/usa-autos-labor/gm-reverses-will-pay-for-striking-union-workers-health-insurance-major-issues-remain-idINKBN1WB32E", "downloaded_at": "2019-09-26 23:50:21.395747+00:00", "title": "GM reverses, will pay for striking union workers' health insurance; major issues remain", "language": "en", "text": "DETROIT (Reuters) - General Motors Co (GM.N) said on Thursday it will pay for the health insurance of its striking hourly workers, reversing a decision to push the costs onto the United Auto Workers union as officials on both sides said major issues remain to be resolved.\n\nFILE PHOTO: The GM logo is seen at the General Motors plant in Sao Jose dos Campos, Brazil, January 22, 2019. REUTERS/Roosevelt Cassio\n\nNo agreement was expected Thursday even as talks were continuing and could continue into the weekend, UAW and GM officials said.\n\nBecause of the complex nature of shifting health care coverage costs, GM said Thursday that UAW members’ coverage had never lapsed.\n\n“Given the confusion around what was happening, we chose to work with our providers to ensure that the benefits would remain fully in place,” GM spokesman Jim Cain said.\n\nThe UAW had accused GM of blindsiding its members with the decision to drop coverage during the strike, and some workers had claimed they could not pay their medical bills as a result. The union seized on this issue to rally public and political support for the 48,000 striking workers.\n\n“There is no doubt that public sentiment sees these actions of GM as a shameful act,” Terry Dittes, the UAW vice president in charge of the GM department, said on Thursday in a letter to GM that the union released publicly.\n\nUAW members went on strike at GM on Sept. 16 seeking higher pay, greater job security, a bigger share of the leading U.S. automaker’s profit and protection of their healthcare benefits. GM immediately shifted responsibility for the health insurance to the union’s strike fund.\n\nGM officials had previously indicated that the decision on health insurance had been telegraphed to the union well before the strike and no worker had lacked coverage thanks to the UAW strike fund.\n\nThe strike is costing GM about $100 million a day, analysts said.\n\nThe walkout - the longest autoworker strike in nearly 30 years - has become a political event, attracting the attention of Democratic presidential hopefuls, who have been visiting the striking workers on the picket lines.\n\nThe Democratic candidates have echoed the striking workers in saying GM employees deserve fair treatment from the Detroit automaker they helped get through bankruptcy, and several criticized GM for its previous decision to stop paying for the workers’ health insurance.\n\nPeople familiar with the talks said progress has been made, but the two sides are still grappling with issues over pay and job security of newer and temporary workers. The sides were still meeting late on Thursday.\n\nGM shares closed up 1.4% at $37.61 on Thursday.", "description": "General Motors Co said on Thursday it will pay for the health insurance of its striking hourly workers, reversing a decision to push the costs onto the United Auto Workers union as officials on both sides said major issues remain to be resolved.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190926&t=2&i=1434317624&w=1200&r=LYNXMPEF8P24Q", "published_at": "2019-09-26"}