{"pub": "nymag", "url": "https://thestrategist.co.uk/article/baby-foot-deep-moist-shea-butter-review.html", "downloaded_at": "2019-09-27 11:35:00.176549+00:00", "published_at": "2019-09-27", "title": "So Apparently, Baby Foot Makes a Cream (and It’s Amazing)", "language": "en", "text": "3 items in this article 1 item on sale! Even that weird callus on my baby toe is softer. Photo: Courtesy of the Vendor\n\nBy now, you’ve no doubt come across a thousand endorsements preaching the gospel of the Baby Foot peel, a pair of bootees that slather your feet in a gel concoction designed to loosen dry and cracked skin. About a week later, the skin begins to fall from your feet in giant sheets, revealing the foot of a baby that was hiding underneath. It’s basically a chemical peel for your feet, and I love it — but I don’t use it on the regular, as it makes even the skin on the tops of my feet and my ankles peel. I’m more interested in removing the calluses that build up on my feet from walking everywhere I go, and getting relief from the intense dryness that is a direct result of wearing sandals and exposing my feet to dry air all summer long.\n\nI’ve bought and tried almost every foot cream, and I’ve always found them a bit greasy and lacking in enough moisture to really kill the dry, ashy bits at the ends of my toes and on my heels. But then I was idly browsing at my favourite beauty shop in Little Tokyo where, lo and behold, sat this lone tube of foot cream made by the same manufacturer of the beloved Baby Foot peel kit. I snapped it up even though I couldn’t read a word of the instructions (it’s a Japan-only product, but of course some enterprising individual has made it available on Amazon). I figured it was foot cream, so what could go wrong?\n\nIts dry texture lets me put my shoes on immediately after applying. Photo: Courtesy of the Vendor\n\nNot only did nothing go wrong, it was better than I could have dreamed. Where most foot lotions are greasy for a good half-hour after applying (making it dangerous to walk around the house, and also a pain to put on shoes and head out the door), the Baby Foot Deep Moist Shea Butter goes on dry, but somehow moisturizes flawlessly. I’m pretty sure they mean for it to be used after performing the classic Baby Foot peel, but I’ve been using it as a stand-alone foot cream for a few weeks, and it blows any other foot cream I’ve previously used out of the water. The dry texture is a little disconcerting on your hands, so I use a butter knife to apply it (sorry, anyone I’ve invited over for dinner recently), then rub my feet together to get it into every nook and cranny. The weird callus I’ve always had on my baby toe is noticeably softer, and I don’t have those weird dry patches at the ends of my toes by midday anymore. It dries instantly, so I can apply it right before I throw on my shoes and race out the door, never worrying that my feet are slipping and sliding around like they do with other, greasier foot creams I’ve tried. I may not be able to read a word of what the tube says — but the results don’t lie.\n\nPhoto: Courtesy of the Vendor Baby Foot Gift Set [Editor’s Note: In the UK the Baby Foot Extra Rich Foot Cream is available for sale on Amazon in a gift set with the best-selling Baby Foot Exfoliation Foot Peel. So you get double the smoothness and exfoliation in a single set.] £15 at Amazon UK Buy\n\nMore Strat-approved foot smoothers\n\nGehwol Fusskraft Blue Foot Cream Strat US did a very involved guide to taking care of your feet a few years back that’s still full of great nuggets. According to master pedicurist Lia Schorr, this is the ultimate foot cream: ‘This cream is natural and full of herbs. It has a strong medicinal aroma but will hydrate your feet, leaving them lovely and silky.’ £8 at Amazon UK Buy\n\nget the strategist newsletter Actually good deals, smart shopping advice, and exclusive discounts. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\n\nThe Strategist UK is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Read about who we are and what we do here. Our editors update links when possible, but note that deals can expire and all prices are subject to change.", "description": "A review of the Baby Foot Deep Moist Shea Butter, which goes on dry and moisturizes better than any foot cream this writer tried.", "authors": ["Alison Freer"], "top_image": "https://pixel.nymag.com/imgs/daily/strategist/2018/05/18/baby-foot-cream-lede.w1200.h630.jpg"}