{"pub": "investing.com", "url": "https://in.investing.com/news/commodities-news/vegoilspalm-oil-recovers-from-losses-rival-edible-oils-gain-2003482", "downloaded_at": "2019-10-11 05:11:17.910662+00:00", "title": "VEGOILS-Palm oil recovers from losses; rival edible oils gain", "language": "en", "text": "VEGOILS-Palm oil recovers from losses; rival edible oils gain\n\nSINGAPORE, Oct 11 (Reuters) - Malaysian palm oil futures reversed losses to trade higher on Thursday, as gains in rival U.S. soyoil and palm oil futures on the Dalian exchange offset the impact of a stronger ringgit.\n\nThe benchmark palm oil contract for December delivery FCPOc3 on the Bursa Malaysia Derivatives Exchange rose 0.2% at 2,201 ringgit ($526.05) per tonne by 0311 GMT.\n\nU.S. soyoil futures on the Chicago Board of Trade BOc2 was last up 0.03%.\n\nThe January palm oil contract DCPF0 on the Dalian exchange rose 0.04% on Friday, while the January soyoil contract DBYF0 on the Dalian exchange climbed 0.2%.\n\nPalm oil is affected by price movements in related oils as they compete for a share in the global vegetable oils market.\n\nThe contract had fallen 0.1% to 2,198 ringgit per tonne at 0249 GMT.\n\nThe initial loss was due to a stronger ringgit and correction after over-buying over the last five sessions, a Kuala Lumpur-based trader said.\n\nThe ringgit was up 0.1% against the dollar on Friday. oil FCPOc3 may end its gains around a resistance at 2,223 ringgit per tonne, as suggested by its wave pattern and a projection analysis, said Reuters market analyst Wang Tao. U.S. corn futures edged higher on Friday, though the oilseed was poised to record its first weekly loss in more than a month after the U.S. Department of Agriculture pegged North American production above market estimates. GRA/\n\n* Oil prices rose early on Friday, building on gains in the previous session, after producer club OPEC hinted at making deeper cuts in supply while optimism was revived over talks between the United States and China to end their trade war. O/R\n\nMARKET NEWS\n\n* Asian shares and U.S. stock futures rose on Friday after U.S. President Donald Trump said he would meet with China's top trade negotiator, while sterling retreated after rallying on revived hopes of a possible Brexit deal. MKTS/GLOB\n\n* U.S. stocks rose on Thursday on hopes that top-level U.S.-China trade talks would yield at least a partial deal, while a jump in Apple's shares also boosted the market. .N\n\n* Hopes of progress in U.S.-China trade talks and optimistic comments from Europe on Brexit pushed back the safe-haven yen and lifted the British pound and euro early on Friday. USD/\n\nFriday Oct 11\n\nDATA/EVENTS AHEAD (GMT)\n\n0600 Germany HICP Final YY\n\n1200 India\n\nIndustrial Output YY\n\n1400 US\n\nU Mich Sentiment Prelim Oct\n\nPalm, soy and prices at 0257 GMT\n\nContract\n\nChange\n\nHigh Volume\n\nMY PALM OIL\n\n+21.00 2150\n\n6 MY PALM OIL\n\n+1.00 2164\n\n106 MY PALM OIL\n\n+2.00 2198\n\n1451 CHINA PALM\n\n+0.00 4776\n\n4800 225698 OLEIN\n\nCHINA SOYOIL JAN0\n\n+10.00 5972\n\n6006 237638 CBOT SOY OIL OCT9\n\n+0.00\n\n0 INDIA PALM\n\n+0.00 0.00\n\n0 OIL\n\nINDIA SOYOIL OCT9\n\n-0.05 756.6\n\n759.5\n\n5310 NYMEX CRUDE\n\nNOV9 53.69\n\n+0.14 53.67\n\n54.13\n\n17412\n\nPalm oil prices in Malaysian ringgit per tonne CBOT soy oil in U.S. cents per pound Dalian soy oil and RBD palm olein in Chinese yuan per tonne India soy oil in Indian rupee per 10 kg Crude in U.S. dollars per barrel ($1 = 4.1840 ringgit)\n\nhttps://tmsnrt.rs/2OvRzNR\n\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^>", "description": "VEGOILS-Palm oil recovers from losses; rival edible oils gain", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/Vegetable Oil_800x533_L_1421323694.jpg", "published_at": "2019-10-11"}