{"pub": "thehill", "url": "https://thehill.com/resources/classifieds/employer/456700-vice-president-of-policy-and-communications", "downloaded_at": "2019-10-29 00:21:52.679901+00:00", "title": "Vice President of Policy and Communications", "language": "en", "text": "Vice President of Policy and Communications\n\nGlobal Innovation Fund\n\nWashington, D.C.\n\nThe Global Innovation Fund [GIF] has a bold mission to back development innovations with the potential to improve the lives of millions of the world’s poorest people, and to influence discussions around aid effectiveness and development finance. Our engagement with policy, political, and public audiences is vital to delivering this mission, and this role is at the heart of it.\n\nEvidence and innovation are at the core of our approach: in this role, you will need to speak compellingly about both. You will be as comfortable getting wonkish with sector experts as you will be explaining complex concepts to laypeople.\n\nAs Vice President of Policy and Communications, you will drive GIF’s thought leadership globally and our policy engagement in the U.S. You will ensure that GIF has a seat at the table at discussions on the future and effectiveness of aid, and on new approaches to investing for impact. With your sharp intellect and strategic approach to stakeholder management, you will become a key adviser to the CEO, and her thought-partner on policy engagement and influencing.\n\nYou will lead GIF’s communications, managing our Head of Communications, in the delivery of corporate, investment, and innovation messaging. You are someone who loves the value of strategic communications and sees Twitter as a tool, not a toy!\n\nYou will be a great writer, able to articulate often complex messages in succinct, punchy prose, whether in op-eds for publication or in speeches for our CEO.\n\nFinally, you will bring your networks and relish the opportunity to grow GIF’s sphere of influence as a connector, convenor, and communicator.\n\nGIF has a bold vision for addressing global poverty - you should have equally bold vision and the skills, experience, and energy to deliver it.\n\n\n\nKey accountabilities for this role include:\n\nYou will lead GIF’s public and policy profile in the U.S., ensuring that GIF has a seat at the table at relevant convenings around the policy areas aligned with GIF’s work. You will:\n\n• Be GIF’s lead adviser on US policy, owning and advancing key stakeholder relationships, and supporting the CEO on US policy engagement, preparing briefings and talking points, and managing follow-up.\n\n• Be a champion for the use of evidence for development impact and the role of innovation in advancing global development.\n\n• Build a portfolio of strategic policy relationships on the Hill and in think tanks to advance understanding of GIF, build promoters of GIF’s approach, and position GIF at the core of discussions on the future of aid and development innovation.\n\n• Prepare regular policy briefings for the board and Executive Team, mobilizing their participation in strategic dialogue in line with the US engagement strategy as required.\n\nYou will own GIF’s global thought leadership, driving adoption and replication of the GIF model, and ensuring that GIF is a trusted, strategic voice for evidence-led, impact-first investment. You will:\n\n• Manage GIF’s thought leadership, authoring and commissioning compelling content for audiences in the US, in our donor countries, and in the countries in which GIF invests.\n\n• Build a US engagement program for the CEO to ensure that she remains at the forefront of GIF’s agenda of investing for impact and evidence-based aid policy, as well as advancing GIF’s engagement with non-aid investment audiences.\n\n• Position GIF in the media and with influencers in forums that contribute to the policy debates around aid effectiveness, development finance, and themes relevant to GIF’s work and portfolio.\n\n• Work across GIF to identify opportunities where entities in GIF’s portfolio can contribute to policy debates and work with these entities to maximize such opportunities.\n\nYou will use your outstanding interpersonal skills to deepen strategic stakeholder relationships in the U.S., including with donors, co-investors, the media, and impact investors. You will:\n\n• Lead strategic relationship management of USAID, and new funding partnerships as they arise, to ensure that GIF is connected across all aspects of the agencies, and that GIF can maximize leverage with policy teams and in-country missions, and pursue additional partnerships with each agency.\n\n• Manage multilateral relationships in the U.S., and with think tanks, to ensure that GIF shares lessons learned and influences the future direction of aid spending and effectiveness.\n\n• Manage the GIF Communications Team and media agencies to deliver engaging, data-rich GIF content.\n\nTo be successful in this role, you will have:\n\n• 10+ years’ experience with substantial and demonstrated experience developing advocacy and communications campaigns that yielded results.\n\n• Subject matter expertise in global development, aid effectiveness, evidence-based aid policy, and/or impact investing.\n\n• A passion for social impact and a sense of humor.\n\nDirect reports:\n\n• Head of Communications", "description": "As Vice President of Policy and Communications, you will drive GIF’s thought leadership globally and our policy engagement in the U.S. You will ensure that GIF has a seat at the table at discussions on the future and effectiveness of aid, and on new approaches to investing for impact.", "authors": [], "top_image": "https://thehill.com/sites/default/files/thehill_logo_200.jpg", "published_at": "2019-08-08"}