{"pub": "breitbart", "url": "https://breitbart.com/sports/2019/10/24/ohio-high-school-runner-disqualified-for-wearing-hijab-without-waiver", "downloaded_at": "2019-10-25 02:24:38.613407+00:00", "title": "Ohio High School Runner Disqualified for Wearing Hijab Without Waiver", "language": "en", "text": "An Ohio high school cross-country runner was disqualified from a competition because she was wearing a hijab.\n\nNoor Abukaram, a practicing Muslim and junior at Sylvania, Ohio’s Northview High, claims that she was prevented from competing at a meet in Toledo, Ohio, because she was wearing her Nike sports hijab.\n\nAbukaram told Toledo’s WTOL that ahead of the event she saw the officials talking to each other. And soon her name was removed from the runner board.\n\nInitially, Abukaram had been told that she was violating uniform rules because she was wearing long pants. She went ahead and competed in the event, but afterward she found her name was not listed with the other runners.\n\nThe teen said that her teammates told her, ‘”You got disqualified,’ and I was like, ‘For what?’ and they were like, ‘For wearing your hijab.'”\n\n“And, like, my heart dropped. I felt like something horrible happened to me, something that I always thought could happen, but never has happened,” Abukaram added. “I think I was mostly embarrassed because like I never expected that to happen.”\n\nOhio High School Athletic Association spokesman Tim Stried told the paper that students who need a religious waiver for clothing and uniforms need to submit their request ahead of time.\n\nStried insisted that the officials who disqualified the girl were “simply enforcing this rule since a waiver had not been submitted.”\n\nNorthview High did file the waiver request after the incident.\n\nHowever, Stried also noted that “OHSAA is also already looking at this specific uniform regulation to potentially modify it in the future so that religious headwear does not require a waiver.”\n\n“It’s a part of me, I’m not going to take it off so I can run! I just don’t want this to happen to anyone else, like any girls younger than me that are wearing hijab,” Abukaram insisted. “I don’t want them to ever have to worry or to have to write a letter so that they can go run.”\n\nFollow Warner Todd Huston on Twitter @WTHuston.", "description": "An Ohio high school cross-country runner was disqualified from a competition because she was wearing a hijab.", "authors": ["Warner Todd Huston"], "top_image": "https://media.breitbart.com/media/2019/10/5db1b9de210000b62534af35-640x335.jpg", "published_at": "2019-10-24"}