{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7543315/Sickening-moment-cruel-thugs-douse-rabbit-alcohol-hurl-air.html", "downloaded_at": "2019-10-07 00:22:02.313198+00:00", "title": "Sickening moment cruel thugs douse rabbit in alcohol and hurl it in the air", "language": "en", "text": "Disturbing video has emerged showing a group of young men laughing as they douse a rabbit in alcohol and throw its limp body into the air.\n\nThe disturbing footage, shared on social media on Saturday night and seen by Nine News, shows people tossing around the rabbit on a rural property near Waroona, south of Perth.\n\nThe group are filmed shaking the rabbit, shouting, pouring alcohol over it and kicking it around like a football as others watch on and cheer.\n\nA disturbing video of apparent animal cruelty was shared to social media showing a group of young men douse a rabbit in alcohol and physically abusing it before throwing it into the air.\n\nThe group of youths can be heard laughing as others continue to abuse the animal.\n\nEventually one of the men is then seen hurling the rabbit as far as he can by its neck.\n\nAfter sparking outrage online, a number of those involved deleted their social media accounts.\n\nJosiah Peck said he was one of the people who filmed the incident but insisted the rabbit was dead when they found it.\n\nHe also said he wanted to sincerely apologise for standing aside and filming the incident saying he made a drunken 'mistake'.\n\nUnder the Western Australian Animal Welfare Act 2002, being found guilty of animal cruelty carries a maximum penalty of a $27,500 fine or a $5,500 fine with a six-month jail term.", "description": "The disturbing footage, shared on social media on Saturday night, shows people tossing around the rabbit on a rural property near Waroona, south of Perth.", "authors": ["Adam Mccleery For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/15/19362626-0-image-a-87_1570371875637.jpg", "published_at": "2019-10-06"}