{"pub": "cnbc", "url": "https://cnbc.com/2019/10/15/china-economy-pork-prices-and-inflation-cpi-ppi-in-september.html", "downloaded_at": "2019-10-15 02:16:57.283618+00:00", "title": "China's pork prices surged 69.3% in September from a year ago", "language": "en", "text": "Pigs in their pen at a farm on the outskirts of Chengdu in China's south west Sichuan province, on August 2, 2005.\n\nPork prices in China jumped 69.3% in September from a year ago as the country continued to battle a shortage of the meat that followed an outbreak of African swine fever.\n\nLast month's surge in pork prices was higher compared to the 46.7% increase seen in August, according to data from China's National Bureau of Statistics. That pushed up food prices in China by 11.2% in September, accelerating from the previous month's 10% gain.\n\nOverall, China's consumer price index increased 3% year-on-year in September, while producer price index fell by 1.2%, according to Reuters. Economists polled by the news agency had expected consumer prices in China to increase by 2.9% in September, and producer prices to fall by 1.2%.\n\nChina is the world's top producer and consumer of pork. But as much as half of the country's hog population was estimated to have died from the protracted swine fever outbreak, which was discovered more than a year ago. China's pig herd could halve by the end of this year, according to a July forecast by analysts at Dutch bank Rabobank.\n\nChinese authorities have responded with measures such as consolidating pig farms and releasing pork from its strategic reserves, noted analysts from consultancy Capital Economics.\n\n\"But there are few signs that these measures have been effective: pigs continue to die in large numbers and pork price inflation is accelerating,\" the analysts wrote in a report last week.\n\n— CNBC's Weizhen Tan contributed to this report.", "description": "China is the world's top producer and consumer of pork. But an African swine fever outbreak wiped out around half of its hog population.", "authors": ["Yen Nee Lee"], "top_image": "https://image.cnbcfm.com/api/v1/image/106097853-1566880524314gettyimages-53323226.jpeg?v=1571102870", "published_at": "2019-10-15"}