{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/sep/08/donald-trump-cancelled-taliban-talks-camp-david-typical-hot-cold", "downloaded_at": "2019-09-08 23:28:20.272921+00:00", "title": "Donald Trump's cancelled Taliban talks are typical of a president who blows hot and cold", "language": "en", "text": "Donald Trump’s boundless faith in his own magnetism and negotiating skills has taken a knock after the cancellation of his bizarre plans for talks with Taliban chiefs. Most Afghans, including the president, Ashraf Ghani, can live with that. Since they believe Trump was selling them out, they will be glad the talks bombed.\n\nThe fact that Trump secretly planned a personal meeting with a murderous group proscribed by the US as terrorists days before the 18th anniversary of the 11 September 2001 attacks that they assisted, is said to have raised eyebrows in Washington. That’s diplomat-speak for shock-horror.\n\nWeirder still though were the reports that Trump was to have entertained his guests at Camp David, the presidential rural retreat located high in the hills of Maryland. Given a Taliban penchant for mountain redoubts, perhaps Trump thought they would feel at home.\n\nCamp David has hosted many illustrious figures and important international summits over the years. The leaders of Egypt and Israel made peace there in 1978. Tony Blair and George W Bush secretly plotted the invasion of Iraq there in the summer of 2002 – another wizard wheeze that went awry.\n\nTrump’s tweets announcing the cancellation smacked more of disappointment than annoyance. As he envisaged it, this was going to be his “peace in our time” moment. Trump would be able to wave a piece of paper in the air, hog the credit – and milk it in next year’s election. Or at least that seems to have been his idea.\n\nSo when he blamed his Camp David fiasco on a Taliban suicide bombing last week, which killed a US soldier and several civilians, he was probably being less than candid. It’s likely he got cold feet at the last minute about an agreement that looked dangerously ill-judged – and which could see him blamed for a resurgence in Afghanistan of both al-Qaida and Islamic State.\n\nThis snakes-and-ladders diplomacy mirrors his much-hyped, on-off talks with North Korea and his up-and-down stance on Iran, where he has blown hot and cold over a summit with Hassan Rouhani, Iran’s president.\n\nThe Kabul government will be relieved the talks didn’t happen. At the Taliban’s insistence, Ghani and his ministers have been excluded from nine rounds of withdrawal talks in Doha. The proposed deal would have ensured the safety of departing US troops but not of Afghan forces or civilians – because the Taliban opposes a nationwide ceasefire.\n\nThe group’s refusal to recognise, let alone participate in, a presidential poll planned for 28 September, plus an increased number of terror attacks in recent weeks, were more evidence of bad faith, as seen from Kabul.\n\nGhani’s long-standing objections, studiously ignored all along by Trump and his chief negotiator, Zalmay Khalilzad, were shared by former US military commanders and diplomats. They argued the Taliban were not to be trusted to keep their word and that Afghanistan could be plunged back into an all-out civil war, as in the 1990s.\n\nReacting to Trump’s announcement, Ghani questioned the entire US-led talks process, whose future is now in doubt. He has again demanded the Taliban honour a comprehensive ceasefire and join inclusive peace talks.\n\nAfghanistan’s long road to recovery | Letter Read more\n\nTrump’s volte-face is not necessarily the end of the story. He could announce tomorrow the talks are back on – although his miffed Taliban guests may ignore him. Nobody knows which way he will jump next, but the self-styled master of negotiation does seem to have absorbed one lesson in the past three years: no deal is better than a bad deal.", "description": "President’s snakes-and ladders approach to diplomacy raises eyebrows in Kabul and Washington", "authors": ["Simon Tisdall"], "top_image": "https://i.guim.co.uk/img/media/ce6b278a1454597ea129a8d2c096c23c0ac19d71/0_116_4060_2436/master/4060.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=069cfac9d41a8b5e770f2639bd6f01bc", "published_at": "2019-09-08"}