{"pub": "indiatimes", "url": "https://indiatimes.com/news/india/indian-economy-continues-to-fall-jobs-gone-but-key-ministers-in-modi-govt-chant-all-is-well-377720.html", "downloaded_at": "2019-10-13 09:25:40.368499+00:00", "title": "Indian Economy Continues To Fall, Jobs Gone But Key Ministers In Modi Govt Chant All Is Well", "language": "en", "text": "At the much-hyped “Howdy, Modi” event in the United States recently, Prime Minister Narendra Modi sounded a bugle in the presence of thousands of people of Indian origin but his apparent chest-thumping at an international venue has struck chords with some key ministers in his government, who too, like the PM, casually ignore constructive criticism and statistical evidences to boast that all is well in India.\n\nPM Modi roared at the top of his voice that all was well in back in the country but he made no note of rising unemployment, layoffs and the falling economy. Perhaps, the event did not demand him to do so but ministers occupying key portfolios in the ruling government are following the suit at an altogether different level.\n\nFinance Minister Nirmala Sitharaman has etched her name in the history books by repeatedly ignoring that Indian economy was witnessing an unprecedented slowdown, and that the disruptive measures introduced during the first term of the Modi-government, such as the GST and the demonetisation of high value currency notes, were not responsible for the downslide. She even blamed the millennials for the slumping sales of cars and motorbikes.\n\nIndications of slowdown notwithstanding, Union minister Ravi Shankar Prasad said three Bollywood movies generating business of Rs 120 crore on the October 2 holiday (a statement he later withdrew) suggested the \"economy was sound\" even as he dubbed \"wrong\" the NSSO report, which had reportedly pegged the unemployment rate at a 45-year high in 2017.\n\nDon't Miss 638 SHARES 18.3 K SHARES 1.5 K SHARES 403 SHARES 3 K SHARES\n\nDays after the International Monetary Fund (IMF) said the economic slowdown was more pronounced this year in India and Brazil, Prasad said the measurement was incomplete. He alleged that some people organised against the government were misleading people over unemployment scenario.\n\n\"I was also told that on October 2, which is observed as one of the national holidays, three Hindi movies garnered ₹120-crore business. Unless the economy is sound in the country how can only three movies collect so much business in a single day?\" Prasad asked while speaking to reporters.\n\nBut barely a day after his comments, the World Bank said today that India's growth rate is projected to fall to 6 per cent in the financial year of 2019-20 from 6.9 per cent a year ago.\n\nThe report, which has been released ahead of the annual meeting of the World Bank with the International Monetary Fund, noted India's economic growth decelerated for the second consecutive year.\n\nIn 2018-19, it stood at 6.8 per cent, down from 7.2 per cent in the 2017-18 financial year.\n\nWhile industrial output growth increased to 6.9 per cent due to a pick-up in manufacturing and construction activities, the growth in agriculture and the services sector moderated to 2.9 and 7.5 per cent, respectively.\n\nIn the first quarter of 2019-20, the economy experienced a significant and broad-based growth deceleration with a sharp decline in private consumption on the demand side and the weakening of growth in both industry and services on the supply side, the report said.\n\nThe World Bank report also noted that the current account deficit had widened to 2.1 per cent of the GDP in 2018-19 from 1.8 per cent a year before, mostly reflecting a deteriorating trade balance.\n\nOn the financing side, significant capital outflows in the first half of the current year were followed by a sharp reversal from October 2018 onwards and a build-up of international reserves to US $411.9 billion at the end of the fiscal year.\n\nThe report also said disruptions brought about by the introduction of the GST and demonetisation, combined with the stress in the rural economy and a high youth unemployment rate in urban areas may have heightened the risks for the poorest households.\n\nBy all projections, economic slowdown is real and job losses are severely impacting the common people in India even as prices of basic commodities, including vegetables, have been rising rapidly. At least 3.5 lakh people have already lost their jobs in the auto sector and tens of thousands are on the verge of losing theirs.\n\nThe economy needs immediate attention but the first step to solving any problem is accepting that there is one. Going by the comments of ministers in the Modi government, it is but apparent that they are not only refusing to accept that there is an economic slowdown but are also trashing every single report and data that challenges their claims.\n\nAfter receiving backlash for dismissing the state of the economy by comparing it to box office collections, Mr Prasad has now withdrawn his statement that compared the economy to box office collections.\n\nBut an upswing in economy that the government is projecting to have achieved remains a distant dream.\n\nWith Inputs From PTI", "description": "PM Modi roared at the top of his voice that all was well in India but he made no note of rising unemployment, layoffs and the falling economy. Perhaps, the event did not demand him to do so but ministers occupying key portfolios in the ruling government are following the suit at an altogether different level.", "authors": ["Saket Suman"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/jobs_1570954211_800x420.jpg", "published_at": "2019-10-13"}