{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/20/baylor-gets-history-lesson-before-playing-old-swc-", "downloaded_at": "2019-09-20 08:17:16.995045+00:00", "title": "Baylor gets history lesson before playing old SWC rival Rice", "language": "en", "text": "HOUSTON (AP) - Baylor and Rice spent eight decades together in the old Southwest Conference, though their meetings have become much more sporadic since the end of that league.\n\nThe Big 12’s Bears (2-0) wrap up non-conference play Saturday with only their third trip to historic Rice Stadium in the past 24 seasons, and the sixth game overall in the series during that span.\n\nWhile a dozen or so current Baylor players were part of a 2016 game at Rice, that last meeting came the season before coach Matt Rhule arrived. But 81 true or redshirt freshmen have played in the past two-plus seasons, and 39 players have already made their Bears debut this season.\n\nEnter Grant Teaff, who was 15-6 against Rice as Baylor’s coach from 1972-92, to give the current Bears a history lesson about the rivalry. Teaff addressed the team going into the game after talking to Rhule all summer about Baylor playing Rice for the 82nd time.\n\n“It’s amazing that he gets up there and it’s just, bang, and you have 130 people sitting in the team room just mesmerized at his every word,” Rhule said. “He really breathed life into the history of this game.”\n\nRhule also has interest in the stadium where President John F. Kennedy gave his “We choose to go to the moon!” speech in September 1962, and where Super Bowl VIII was played in January 1974.\n\n“To know the history … that to me as a fan of college football is really, really important,” Rhule said.\n\nIt is the second weekend in a row that the Owls (0-3) are a big underdog at home against a Big 12 opponent, though their 48-13 loss to Texas came at the home of the NFL’s Houston Texans.\n\nRice has lost 25 of its last 28 games, and is 2-14 under second-year coach Mike Bloomgren.\n\n“I think the toughest part about striving for greatness is the journey,” said Bloomgren, a former Stanford assistant. “We all want it to happen faster. I promise nobody is in more of a rush than me. But, we’re going to step back and keep working on the process and know that we’re building a very solid culture.”\n\nGETTING GREEN BACK\n\nRice quarterback Wiley Green could return against Baylor. He has been out since sustaining a neck injury early in the Sept. 6 game at Wake Forest. He was getting treatment and was back at practice this week.\n\n“We won’t rush him back,” Bloomgren said. “We think there’s a good chance he’s going to play this Saturday.”\n\nGreen is still a freshman after throwing for 621 yards and four touchdowns in three games last season.\n\nLONG RUNS\n\nBaylor has rushed for 636 yards in its first two games, but Rhule cautioned that the Bears need to realize how some of those yards came and stay focused on that aspect of the game.\n\n“You know we had a lot of yards, so sometimes … the offensive line starts thinking hey well we’re really blocking guys well,” Rhule said.\n\nThe Bears have had some long runs, some when runners reversed field. Four different players have runs of at least 38 yards, and their leading rusher is dual-threat backup quarterback Gerry Bohanon.\n\nSCOUTING HELP\n\nRhule said Baylor can absolutely take something from Rice playing one of its Big 12 rivals last week.\n\n“I think it was really good for us to get a picture of some of the things that they did versus a team in Texas who at least structurally is built the same way we are. I thought it was good for us to get that picture,” he said.\n\nEXTRA POINTS\n\nBaylor has won eight in a row against Rice, and leads the overall series 49-30-2. … Rice linebacker Blaze Alldredge had 4 ½ tackles for loss against Texas. The Owls’ 18 TFLs are seven more than they had in the first three games last season. … Baylor’s four-game winning streak is its longest since starting 6-0 in 2016, before the Bears lost 15 of their next 17 games through the 2017 season.\n\n___\n\nMore AP college football: http://apnews.com/tag/Collegefootball and http://www.twitter.com/AP_Top25\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Baylor and Rice spent eight decades together in the old Southwest Conference, though their meetings have become much more sporadic since the end of that league.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/07/utsa_baylor_football_14673_c0-228-3644-2352_s1770x1032.jpg?c63c9768d3767229866c622d7b204ce8e457ae89", "published_at": "2019-09-20"}