{"pub": "reuters", "url": "https://in.reuters.com/article/usa-immigration-profiles-los-angeles/the-migrant-caravans-finding-freedom-and-hardship-in-america-idINKBN1WP1O1", "downloaded_at": "2019-10-10 15:28:48.387333+00:00", "title": "The migrant caravans: Finding freedom and hardship in America", "language": "en", "text": "(Reuters) - A year to the day after crossing the U.S.-Mexico border in May 2018, Luis Rodriguez, 20, writhed on a gurney in a Los Angeles emergency room with a kidney and bladder infection.\n\nLuis Rodriguez, 20, who fled El Salvador with his father and the man he had been in a secret relationship with since high school, poses for a portrait in Los Angeles, California, U.S. October 8, 2019. REUTERS/ Mike Blake\n\nHe wasn’t just in pain - he was worried. His asylum claim had not yet been approved. He had no work permit, though he’d been working seven days a week anyway. Now he was seriously ill, and bills were mounting.\n\nWhen Rodriguez arrived in the United States, he had planned to finish his final year of high school, earn a university degree and then become a systems engineer. He’d always been studious and driven in El Salvador, the kid teachers commended. But here in the hospital, his goals seemed out of reach.\n\nHe felt alone in this country - but, he told Reuters, he hadn’t had much choice in leaving his own.\n\nRodriguez is gay. He and his first love, Bryan Claros, were high school classmates, meeting secretly when they could on an isolated stretch of beach outside their hometown of La Libertad. One March night, four gang members surrounded them there, beat up Claros and threatened Rodriguez, both men told Reuters.\n\n“Never show your faces here again,” Rodriguez recalled them saying.\n\nA police detective’s report on the incident, reviewed by Reuters, confirmed the outlines of their account, saying Rodriguez was the victim of “aggravated threats” by terrorist groups or gangs and that “it was recommended that he emigrate … because these individuals who threaten people always act out the threats they make.”\n\nThe couple left town within the week, along with Rodriguez’s father, Andres Rodriguez, 52. He told Reuters he accepted his son’s relationship and refused to let the pair risk the journey alone. “He’s my son, and I will always support him,” he said.\n\nThey joined a gathering caravan in spring 2018 in southern Mexico. To anyone who asked, the young men said they were cousins.\n\nJust shy of the U.S. border in Tijuana, Mexico, Andres Rodriguez decided not to cross with the younger men, convinced that his case for asylum was not as strong. He waited long enough to ensure his son made it out of detention, then headed home.\n\nLuis Rodriguez and Claros were sent to the Otay Mesa Detention Center in San Diego to await immigration court hearings. There, Rodriguez - schooled by caravan members on the language of human rights - wrote a letter on behalf of 36 other detainees to protest the living conditions.\n\n“In this country,” he wrote, “the First Amendment protects the rights of all human beings no matter their race, religion, nationality, social group, sexual orientation or political opinion. For that reason we urge CCA” - a private company, now called CoreCivic, that runs Otay Mesa - “to treat us like the humans we are.”\n\nThe May 2018 letter, reviewed by Reuters, alleged the detained migrants were forced to work six hours a day for $1.50 per hour.\n\n“When we ask for medical attention they do not treat us, and many of us have wounds and pains,” the letter said.\n\nIn a statement to Reuters, CoreCivic representative Amanda Gilchrist said work programs were “completely voluntary.” In a separate statement to Reuters, the Immigration and Customs Enforcement agency, which oversees the center, also said work was voluntary and that all detainees were screened for health issues and provided treatment as needed.\n\nConditions at the center briefly improved and Rodriguez said he suffered no punishment for taking a stand – a result that impressed him.\n\nRodriguez and Claros were released on immigration parole after four months, each moving in with their respective relatives in Los Angeles.\n\nThe young men said the addresses on their court papers were not updated. Receiving word of his San Diego hearing a day in advance, Claros said he rushed more than 100 miles to make it in time. He was granted asylum on October 18, according to his court papers. He then moved in with relatives in Texas.\n\nRodriguez got notice of his hearing on the day it was to be held and missed it, he said. His next court date is later this year.\n\n(For an interactive version see tmsnrt.rs/2VssPY7)\n\nAfter his relative learned he was gay, Rodriguez said, tension mounted in the household and he moved out. He found a job, was fired for being undocumented, then found another as a metal worker. Every day, he worked nine to 12 hours. His relationship with Claros became strained by distance and the pressures in their lives, he said. They broke up.\n\nOne afternoon in early May 2019, he was hospitalized in unbearable pain. After 15 days’ absence from work, his boss fired him, he said. Rent was due. His hospital bill climbed to $1,155.\n\nAfter he was discharged, however, his luck began to turn. His work permit landed and he began applying for jobs the next day. Soon he started as a half-time cashier at McDonald’s, making $14.50 an hour, and took a second job as a house painter.\n\nSlideshow (3 Images)\n\nA friend agreed to help him find a center where he could earn his general education diploma.\n\nMaking his way in the United States is still difficult, he said, but things are starting to work out for him.\n\n“To be able to go to school in a few years, I see that as a lot better - because then I won’t have been defeated.”", "description": "A year to the day after crossing the U.S.-Mexico border in May 2018, Luis Rodriguez, 20, writhed on a gurney in a Los Angeles emergency room with a kidney and bladder infection.", "authors": ["Delphine Schrank", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439247851&w=1200&r=LYNXMPEF9912K", "published_at": "2019-10-10"}