{"pub": "huffpost", "url": "https://huffpost.com/entry/newt-gingrich-the-view-trump-lynching_n_5daf43a6e4b08cfcc3237369", "downloaded_at": "2019-10-22 20:39:14.829845+00:00", "title": "'The View' Gets Newt Gingrich To Admit Trump's Lynching Comments Went A Bit Too Far", "language": "en", "text": "Newt Gingrich attempted to justify President Donald Trump’s comparison of the impeachment inquiry to a “lynching” before weakly suggesting it wasn’t a good choice of words.\n\nThe former House speaker was a guest host on Tuesday’s episode of “The View,” and host Whoopi Goldberg wanted his take on Trump’s language.\n\n“Well, it’s a word that nobody, you know, wants to hear,” Goldberg said. “This was not a good choice of words for him. Do you think?”\n\nGingrich tried to defend the president with a big helping of whataboutism.\n\n“Well, it’s exactly the same term that [Supreme Court Justice] Clarence Thomas used when he said he was guilty of a white-collar lynching,” Gingrich said before asking Goldberg and the other hosts to put themselves in Trump’s shoes.\n\n“You got beaten up for over two years with the Mueller thing. You start to relax,” Gingrich said. “All of a sudden, there’s this whole new wave of things, and I think part of what you have is a guy here who’s just really deeply frustrated that no matter where he turns, you know, the fight keeps going on.”\n\nGoldberg then forcefully but politely explained why she has a problem with the president describing his current political situation in terms of a violent hate crime.\n\n“Listen, Newt, you and I have known each other a long time,” Goldberg said, “and when a giant 6-foot white guy says, ‘I’m being lynched here,’ you understand why it’s a little bit like, ‘Listen, man, you’re not being lynched here, you are being held to the standard we’re supposed to be holding every president to.’”\n\nGingrich started to speak about the lynching of nonblack people, but the hosts steered him back to the question of whether Trump’s language was appropriate. He eventually acknowledged the president “often uses words more clumsily than he should” and suggested that he personally wouldn’t have made a “lynching” comment.\n\n“No, look, I’ve been comfortable just calling it a ‘witch hunt’ and a ‘kangaroo court’ and things like that, I haven’t gone up to that next level,” he said.\n\nYou can see the complete segment below.", "description": "\"I’ve been comfortable just calling it a 'witch hunt' and a 'kangaroo court' and things like that,” the former House speaker said on Tuesday's episode.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5daf4489210000ab21ad3961.png?ops=1778_1000", "published_at": "2019-10-22"}