{"pub": "cnn", "url": "https://cnn.com/2019/10/24/world/mars-landslides-scn/index.html", "downloaded_at": "2019-10-25 00:00:16.409093+00:00", "title": "Apollo astronaut investigates massive landslide on Mars", "language": "en", "text": "(CNN) About 47 years ago, Harrison Schmitt became the only scientist to ever walk on the moon. Now, the geologist and professor is studying an extensive landslide on Mars, almost 250 miles wide, that formed about 400 million years ago.\n\nSchmitt and his colleagues used 3D images captured by the Mars Reconnaissance Orbiter to study the large, deep ridges to discover that they were likely formed at speeds reaching 223 mph. Their study published Thursday in the journal Nature Communications\n\nSchmitt and fellow NASA astronaut Eugene Cernan were the last men to walk on the moon with the Apollo 17 mission. They landed in the Taurus-Littrow valley on December 11, 1972, and collected samples of the lunar surface, conducted experiments and took photos -- including the famed \"blue marble\" image of Earth.\n\n\"This work on Martian landslides relates to further understanding of lunar landslides such as the Light Mantle Avalanche I studied in the valley of Taurus-Littrow during Apollo 17 exploration and have continued to examine using images and data collected more recently from lunar orbit,\" Schmitt said.\n\n\"Flow initiation and mechanisms on the Moon may be very different from Mars; however, comparisons often help geologists to understand comparable features.\"\n\nHarrison Schmitt stands next to a huge lunar boulder during an Apollo 17 moon walk.\n\nSchmitt said that one of the samples collected from the moon during Apollo 17 has recently been unsealed by scientists to study it with current technology.\n\nLandslides on other bodies in our solar system, like the dwarf planet Ceres, are likely caused by ice . But the researchers believe there is another possibility in this case.\n\n\"Landslides on Earth, particularly those on top of glaciers, have been studied by scientists as a proxy for those on Mars because they show similarly shaped ridges and furrows, inferring that Martian landslides also depended on an icy substrate,\" said Giulia Magnarini, study author and PhD student at University College London. \"However, we've shown that ice is not a prerequisite for such geological structures on Mars, which can form on rough, rocky surfaces. This helps us better understand the shaping of Martian landscapes and has implications for how landslides form on other planetary bodies including Earth and the Moon.\"\n\nThe researchers analyzed the rough surface of Coprates Chasma in the Martian canyon Valle Marineris. they compared the width of the furrows and ridge heights with the thickness of the landslide deposit.\n\nIn the thickest part of the deposit, the ridges could be as high as 196 feet and the furrows fanned out in widths comparable to eight Olympic-sized swimming pools.\n\nThis matches up with instances where an unstable base like sand gives way to a landslide, the researchers said. In the case of the Martian landslide, they believed that a rapid landslide may have occurred due to layers of unstable and fragmented rock beneath the surface.\n\n\"The Martian landslide we studied covers an area larger than Greater London and the structures within it are huge,\" said Tom Mitchell, sudy co-author and University College London associate professor of Earthquake Geology and Rock Physics. \"Earth might harbor comparable structures but they are harder to see and our landforms erode much faster than those on Mars due to rain.\"\n\n3D modeling based on images of the landslide site.\n\nMitchell explained that they aren't ruling out ice entirely, but they also suggest that ice was not necessary.\n\nBeing able to compare how the surfaces of bodies in our solar system can help scientists to understand how they evolve.\n\n\"The impact redistribution of materials in the lunar environment has modified features that ultimately may be found to resemble those documented in the Martian landslide study,\" Schmitt said.", "description": "About 47 years ago, Harrison Schmitt became the only scientist to ever walk on the moon. Now, the geologist and professor is studying an extensive landslide on Mars, almost 250 miles wide, that formed about 400 million years ago.", "authors": ["Ashley Strickland"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/170123161022-mars-grand-canyon-valles-marineris-super-tease.jpg", "published_at": "2019-10-24"}