{"pub": "independent", "url": "https://independent.co.uk/life-style/health-and-families/serena-williams-alexis-ohanian-sr-jr-daughter-pictures-instagram-a9164371.html", "downloaded_at": "2019-10-21 11:28:38.297848+00:00", "title": "Alexis Ohanian shares sweet pictures of his and Serena Williams’ daughter comparing her growth to a tree", "language": "en", "text": "Alexis Ohanian has shared a series of pictures of his and Serena Williams‘ daughter, comparing her growth to a tree over the past couple of years.\n\nOn Sunday evening, the Reddit co-founder posted three pictures of his two-year-old daughter, Alexis Olympia Ohanian Jr, on Instagram.\n\nIn the post’s caption, Ohanian stated that his daughter has been photographed alongside the plant every year since her birth in 2017 in order to show how much she is growing.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe first picture, taken the most recently, shows the toddler standing next to a tree almost double her height wearing a multi-coloured skirt and a T-shirt that reads: “Legend.”\n\nThe second image, which was taken a year ago, shows the youngster standing next to the tree wearing a pair of leopard print trousers, while the third shows Ohanian holding his baby daughter next to the plant, which has seemingly only just been planted.\n\n“Our little mango is growing up so fast. Every year a photo,” Ohanian wrote in the post’s caption.\n\nThe entrepreneur added he was “grateful” to have spent the first few months of his daughter’s life with her while on paternity leave.\n\n“On my way to DC to make sure every American has the same opportunity for #paidfamilyleave,” he concluded the caption.\n\nOn Tuesday 22 October, Ohanian will join non-profit organisation Paid Leave US (PL+US) and Dove Men+Care on Capitol Hill in Washington, DC, as an advocate for paid family and medical leave.\n\nThe aim of PL+US is to achieve paid family leave in the US by 2022, it states on the organisation’s website.\n\nIn August, Ohanian wrote an essay for The New York Times in which he outlined the importance of ensuring every father is able to take paternity leave.\n\nHe said he had “never thought much about paternity leave” before Williams experienced “near-fatal complications” during their daughter’s birth, which included spending “days in recovery fighting for her life against pulmonary embolisms”.\n\n“Nothing could have dragged me away from my wife and daughter in those hours, days and weeks – and I’m grateful that I was never forced to choose between my family and my job,” Ohanian stated.\n\n“I get that not every father has the flexibility to take leave without the fear that doing so could negatively impact his career. But my message to these guys is simple: Taking leave pays off, and it’s continued to pay dividends for me two years later.”", "description": "Alexis Ohanian has shared a series of pictures of his and Serena Williams‘ daughter, comparing her growth to a tree over the past couple of years. On Sunday evening, the Reddit co-founder posted three pictures of his two-year-old daughter, Alexis Olympia Ohanian Jr, on Instagram.", "authors": ["Sabrina Barr"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/21/09/alexis-ohanian-sr-and-jr-0.jpg", "published_at": "2019-10-21"}