{"pub": "yahoo", "url": "https://sports.yahoo.com/why-the-los-angeles-kings-might-be-truly-cooked-142311768.html", "downloaded_at": "2019-10-12 00:21:35.627352+00:00", "title": "Why the Los Angeles Kings might be truly cooked", "language": "en", "text": "It's been a rough start to the season for Quick. (Photo by David Becker/NHLI via Getty Images)\n\nThe Los Angeles Kings made the playoffs just two seasons ago, and people — especially within the organization — thought it might be a return to form for a franchise that wasn’t too far removed from two straight Stanley Cups.\n\nBut then they started a handful of games below .500 the following year, winning just four of their first 13 games, and fired the coach who got them to that (brief) postseason run. This summer, they made very few changes to the group that finished with just 71 points, except to say they added the coach who led the Oilers to, well, what you all think of the Oilers as being.\n\nScroll to continue with content Ad\n\nThe idea, then, that the Kings were ever going to be remotely competitive this season was always far-fetched. And that’s if you want to be somewhat kind. Insiders might have hoped for a bounce-back season for Anze Kopitar, Dustin Brown, Jeff Carter, Drew Doughty, and Jonathan Quick, all of whom were rather bad in 2018-19. They also might have hoped that Todd McLellan, who’s accustomed to working with extremely talented players, could wring a little something more out of Ilya Kovalchuk than could John Stevens or Willie Desjardins.\n\nWithout too many young players being able to step in and contribute at a level the team needed, it would fall to all those guys who were still lingering from Cups won six and eight years ago to turn things around, maybe with a little help from the Adrian Kempes, Alex Iafallos, and Tyler Toffolis of the world.\n\nThough it’s only three games, you’d have to say the early returns are… not good. And if you watched Wednesday night’s bloodbath in Vancouver, you would scoff at Drew Doughty’s quote the following morning about how the Kings shouldn’t lose to “a team like that.”\n\nStory continues\n\nSo the question is, “Aren’t the Kings a team like that?” If you don’t add talent in the summer and you’re coming off a 70-something point season with all your highest-paid players another year past 30, aren’t you by definition “a team like that?” Well, yes and no.\n\nKopitar, Doughty, Kovalchuk, and Toffoli are all scoring, which is nice. The whole team has actually looked pretty good offensively, both on the power play and 5-on-5 (thus the scoring from the top talents). You’d like to see that continue, for sure, even if the overwhelming scoring success so far isn’t necessarily supported by the process — they’re second in the league in goals-per-60 at full strength, but fully 50 percent above their expected-goals rate, which is still ranked fourth and obviously good.\n\n\n\nCan they keep it up? There’s reason to believe they might be able to. McLellan is, for all his difficulties in recent years, a coach with a fairly good track record who didn’t have a ton to work with in Edmonton once McDavid and Draisaitl came off the ice. When he was coaching the Sharks, it often looked like the circus was in town when his team crossed the offensive blue line. Goals could theoretically come easy, but probably not as easy as they’ve come so far.\n\nDefense, as you might expect for a team giving up 17 goals in three games, has been the problem. They’re roughly middle of the road at 5-on-5 in terms of expected goals, even if they’re actually allowing the third-fewest shots on goal at full strength per hour. The PK is a different story entirely. While they’re giving up relatively low rates of attempts, shots on goal, and so on when they’re down a man, they also ended Wednesday’s 8-2 loss conceding the seventh-highest expected-goals rate in the league. What that means is teams aren’t getting a ton of looks, but the looks they are getting are of incredibly high quality.\n\nAnd what’s worse, they’re converting. The Kings have given up three goals on just nine power plays, in addition to 14 at even strength. But again, that seems to be because the defense both gives up a lot of quality looks (almost 11 per hour in all situations, seventh-worst in the league) but relatively few of them end up on net (17 in three games isn’t a terrible number, but it’s not great either).\n\nThe problem, then, is stopping those shots and, specifically, Jonathan Quick doing so. It’s only two games but even one game with a .750 save percentage is too many. Jack Campbell hasn’t been much better (.897). Quick has almost given up 7.5 goals below expected, and Campbell is at minus-0.74 so he hasn’t been good either.\n\nThe team certainly needs to tighten things up defensively, which is somewhat unexpected considering that was its bread and butter for the better part of a decade. But it also needs its goalies to actually play like NHL-level players. Campbell was awesome in a backup role (.928 in 31 appearances) and Quick was rather bad (.888 in 46).\n\nAgain, it’s only two games this season and one of them his team just flat out never got off the bus for, but it’s beginning to feel maybe like it’s the end of the road for Quick. He’s a few months away from being 34 and he’s got a ton of miles on him between six seasons of 60-plus games in the regular season and multiple deep playoff runs. It happens. Not sure how McLellan can justify going back to him anytime soon.\n\nAnd if Campbell can’t be anything close to what he was last year in an expanded role, and the defense doesn’t get its act together, the Kings are going to be “a team like that” for quite a while. Especially because Kopitar, Kovalchuk, Brown, Carter, Doughty, Alec Martinez, and Quick are all on the wrong side of the aging curve and signed for at least two more seasons.\n\nThe problem with saying “It’s only three games” about a team you already thought was going to be bad is simple: There are 79 more to deal with.\n\nRyan Lambert is a Yahoo! Sports hockey columnist. His email is here and his Twitter is here.\n\nAll stats/salary info via Natural Stat Trick, Evolving Hockey, Hockey Reference, CapFriendly and Corsica unless noted.\n\nMore NHL coverage from Yahoo Sports", "description": "The Kings haven't been able to keep the puck out of the net early this season.", "authors": ["Ryan Lambert"], "top_image": "https://s.yimg.com/ny/api/res/1.2/lr8L8rFUL7wtsdX9K0SVyw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD02OTkuNzMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/Cwe7V3mFqScoc03ocynehQ--~B/aD03Njg7dz0xNDA0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/f0247fe0-ec30-11e9-bc6a-093d3b1729a5", "published_at": "2019-10-11"}