{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKBN1W920Q-OCASP", "downloaded_at": "2019-09-24 16:03:34.587357+00:00", "title": "Rugby: Tsunami-hit town gets ready to welcome the world", "language": "en", "text": "TOKYO (Reuters) - Fiji’s clash with Uruguay on Wednesday may seem like just another Rugby World Cup group fixture, but for the people of Kamaishi, where the match will be played, it is an event packed with significance.\n\nMasaaki Kimura, 63, speaks to Reuters about the loss of his wife Takoko, his mother, mother-in-law and his uncle to the 2011 tsunami at his home in Unosumai, Japan September 24, 2019. Masaaki plans to watch the Rugby World Cup matches at Kamaishi stadium which was built on the former site of two schools that were destroyed by the 2011 tsunami. Masaaki lost his wife who was a schoolteacher in one of the schools that day. REUTERS/Edgar Su\n\nThe small, rugby-mad town was devastated by the massive earthquake and tsunami that struck Japan’s north-eastern coastline on March 11, 2011.\n\nMore than 1,000 people were killed or went missing in Kamaishi that day, leaving the community on its knees.\n\nIn the aftermath of the disaster, the local club, Kamaishi Seawaves, became a beacon of hope for the town as it gathered around the team and began to rebuild.\n\nAfter Japan was awarded the rights to host the 2019 World Cup, Kamaishi was chosen as a tournament venue.\n\nSince then, infrastructure projects, including the construction of a new expressway and trainline in the region, have boosted the economy and brought jobs and dynamism to the region.\n\nThe Kamaishi Recovery Memorial Stadium was built on the site of schools destroyed by the quake and tsunami, and will play host to the match on Wednesday.\n\nLOOKING FOR CLOSURE\n\nFor locals such as 63-year-old Masaaki Kimura, Wednesday’s match might just bring a little bit of closure.\n\nKimura lost his wife, mother and mother-in-law in the tsunami. His wife Takako, whose body has never been found, worked in the elementary school that was completely destroyed in the disaster.\n\nAs adults and children fled, Takako stayed.\n\nKimura still doesn’t know why.\n\n“She was the only one who was left behind at the school,” Kimura told Reuters at his newly built house on the outskirts of town.\n\nHearing that all those from the school were safe, Kimura, who survived because his office was in a building that didn’t collapse, spent five hours searching for his mother.\n\n“I walked along the rail track looking for her,” said Kimura, who needs crutches to walk.\n\n“On the rail track, there were sleepers and gravel, so it was difficult for me.\n\n“My boss who was walking with me said he is worried about his wife but he could not leave me alone so he kindly came with me. I said he did not have to, but he came along.”\n\nKimura has had Sept. 25 circled on his calendar all year, and will have a seat in an area near where the school’s staff room was located.\n\nThat was the last place Takako was seen alive. Kimura says he can imagine himself watching the rugby match with her.\n\n“It is not exactly where it was … I will be sitting just off the spot,” he said.\n\n“But I think it is correct (to say) that I will be sitting close to staff room where she worked.”\n\nFISHERMEN\n\nAs well as rugby, the region is known for its steel and fishing industries.\n\nThe steel industry may be almost completely gone, but there are still plenty of fisherman hunting for the premium produce that ends up on expensive dinner plates down in Tokyo and Osaka.\n\nThe port town of Ofunato, just down the coast from Kamaishi, was also badly damaged in the disaster.\n\nMany fishermen were lost, and those that survived are still haunted by that fateful day in March 2011.\n\n“We lost two boatloads of fishermen out in the sea. They were too late to escape,” said 71-year-old Ko Inagawa, who still works in Ofunato.\n\n“I was cleaning fish when the earthquake happened. The pier shook so strongly that I was having difficulty standing up.\n\n“I escaped to the rail track on high ground by car. I thought it would be safe enough, but within a moment the water came as near as the rear of my car so I escaped further up.”\n\nAfter the disaster, people in the area take nothing for granted.\n\n“There is nothing 100% safe that humans make. Nothing,” said fisherman Taka Shigihara.\n\n“Everyone should remember that.”\n\nThe new Recovery Memorial Stadium in Kamaishi may not stand forever but tournament organisers and locals alike are hopeful that Wednesday’s match can leave a lasting legacy in the small town.", "description": "Fiji's clash with Uruguay on Wednesday may seem like just another Rugby World Cup group fixture, but for the people of Kamaishi, where the match will be played, it is an event packed with significance.", "authors": ["Jack Tarrant", "Yoko Kono", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190924&t=2&i=1433384647&w=1200&r=LYNXMPEF8N1DD-OCASP", "published_at": "2019-09-24"}