{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7578935/Jude-Laws-son-Rafferty-lands-lead-role-Disneys-remake-Oliver.html", "downloaded_at": "2019-10-16 13:58:00.939125+00:00", "title": "Jude Law's son Rafferty lands the lead role in Disney's remake of Oliver!", "language": "en", "text": "Jude Law’s son Rafferty is following in his father’s footsteps by landing the lead role in Disney’s remake of the Charles Dickens’ classic Oliver!\n\nThe 23-year-old model, whose mother is actress Sadie Frost, 54, was handpicked by bosses to star in the upcoming movie after 'impressing with his screen presence and vocal range.'\n\nFilm insiders have also revealed to MailOnline that comedian David Walliams, 48, has been lined up to play the role of Mr. Losberne, who’s a physician that eventually befriends Oliver in the story.\n\nChip off the old block: Jude Law’s son Rafferty is following in his father’s footsteps by landing the lead role in Disney’s remake of Oliver! (pictured together in 2015)\n\nA source close to the project said: 'Shooting for the new film starts today in London and everyone is very excited to get started.\n\n'Producers aim to modernise the script and music to attract a younger audience and the adaptation has even been referred to as a “street version” of the classic.\n\n'Rafferty impressed with his vocal talent and his edginess brings a whole new dimension to the role of Oliver.\n\n'It’s an all-star cast with David in the mix after arriving at today's first rehearsal – as well as blogger Tanya Burr who was also in attendance.'\n\nMailOnline contacted Rafferty Law's representatives and Disney for comment.\n\nMovie star: Jude (pictured in September), famed for starring in Alfie and The Holiday, has five children including Rafferty, 23, Iris, 18, and Rudy, 17, from his marriage to Sadie Frost\n\nStar studded cast: David Walliams has been lined up to play the role of Mr. Losberne (pictured in May on the Britain's Got Talent panel)\n\nAccording to reports Adele has been lined up for the role of Nancy after bosses urged her to audition.\n\nSources revealed in May that Oliver! filmmakers were 'really keen to get Adele on aboard' but wanted to discover if she could act first as well as sing.\n\nRita Ora, who’s previously starred in the Fifty Shades of Grey franchise and Southpaw alongside Jake Gyllenhall, reportedly auditioned for the role of Artful Dodger – though there’s been no official confirmation of her involvement.\n\nScreenwriter Danny Strong has been tapped to script the remake while the film will be directed by Thomas Kail, who won a Tony Award for musical Hamilton.\n\nGood genes! Rafferty, pictured with his famous mum Sadie Frost in July, is said to have impressed movie bosses with his 'screen presence and vocal range'\n\nOom Pah-Pah!: Adele was reportedly urged to audition by filmmakers who were eager for her to be on board with the adaptation (pictured in 2017)\n\nLa La Land's Marc Platt, Jeff Kwatinetz and Ice Cube are producing for Disney – with the Straight Outta Compton actor also reported to be portraying the role of villainous character Fagin.\n\nMarc has been dubbed 'the king of the modern-day musical' after he also produced Mary Poppins Returns and Aladdin for Disney.\n\nJude Law, 46, famed for his roles in Alfie, The Holiday and Sherlock Holmes, has five children including Rafferty, 23, fashion model Iris, 18, and Rudy, 17, from his marriage to Sadie.\n\nHe also has daughter Sophia, 10, with ex-partner Samantha Burke and Ada, four, with Catherine Harding. The actor married his girlfriend Phillipa Coan in May.\n\nBudding film star: Blogger Tanya Burr (pictured earlier this month) is also said to have auditioned for a part in the flick – with insiders saying she was present at today's first rehearsal", "description": "Jude Law's son Rafferty is following in his father's footsteps by landing the starring role in Disney's remake of the Charles Dickens' classic Oliver! Comedian David Walliams is also lined up for a part.", "authors": ["Sarah Packer For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/12/19785394-0-image-a-34_1571226728175.jpg", "published_at": "2019-10-16"}