{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/blockchain-and-dna-based-fuel-tracking-solution-launches-commercially", "downloaded_at": "2019-10-22 13:21:41.449642+00:00", "title": "Blockchain and DNA-Based Fuel Tracking Solution Launches Commercially", "language": "en", "text": "Bunkertrace, a blockchain and DNA-based fuel tracking solution, is using DNA markers to trace bunker fuel oil throughout the supply chain.\n\nOn Oct. 21, in an article by the American Journal of Transportation, Bunkertrace announced its commercial launch after a successful trial in the Netherlands where the company added DNA markers to bunker fuel oil.\n\nThe new solution combines synthetic DNA markers and blockchain technology to trace the fuel and make it possible to track any changes made to it. The company then records each transaction in a blockchain-based system to manage risk for marine fuels by creating a transparent chain of custody. BunkerTrace CEO Marc Johnson said:\n\n“We’re seeing fundamental changes to the dynamics of the bunkering market, which in turn creates uncertainty and risk: risk for owners, charterers, credit providers and financiers in the fuels they buy or fund; risk for insurers in establishing the risks they must manage; risk for operators and the fuels they burn; and for enforcers policing the fuels market. That’s why BunkerTrace exists.”\n\nBunkertrace concluded its first trial at the beginning of October on the Boskalis-owned dredger Prins der Nederlanden, where the company was able to detect a unique DNA mark with an onboard analysis case, with the results logged onto the blockchain.\n\nBlockchain tech finds use cases in the hydrocarbons industry\n\nDistributed ledger technology like blockchains is being applied in various aspects of the hydrocarbons industry and supply chain.\n\nCointelegraph reported in September that Indian automobile manufacturer Tata Motors announced plans to apply blockchain solutions for the real-time monitoring of fuel quality.\n\nThat same month, a subsidiary of Chinese oil and chemical giant Sinochem Group was reportedly in discussions with Royal Dutch Shell and Australian financial services firm Macquarie Group regarding a blockchain platform for crude oil. The platform would reportedly be used to eliminate inefficiencies in trade and settlement, as well as improve transparency and reduce the risk of fraud in the oil industry.", "description": "A blockchain and DNA-based fuel tracking solution for fuel oil has launched after a pilot in the Netherlands", "authors": ["Joeri Cant"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvYWFiODQ0ZWQ1NmVhNzY1OWQ5OTIwYmJhZmE5ZGI1ZTQuanBn.jpg", "published_at": "2019-10-21"}