{"pub": "realclearpolitics", "url": "https://realcleardefense.com/articles/2019/09/17/post_inf_great_power_arms_control_114747.html", "downloaded_at": "2019-09-18 23:21:39.657706+00:00", "title": "Post INF Great Power Arms Control", "language": "en", "text": "The end of the 1987 Intermediate-Range Nuclear Forces (INF) Treaty (through which the United States and the Soviet Union agreed to eliminate all ground-launched missiles with ranges between 500 and 5,500 kilometers) has provoked a debate within the U.S. government over whether to develop new medium- and intermediate-range missiles. The latest House version of the Defense budget contains no money for developing new ground-based intermediate-range missiles. In their refusal to provide funding, House Democrats are encouraged by the arms control community’s arguments that the U.S. can salvage some portion of the INF Treaty by showing restraint. This advice does not take into account that, over the last century, progress on limiting great power armaments has been directly related to the power and competitiveness of America’s military. If Congress wants to promote genuine progress on arms control with great power rivals like Russia and China, it should forget restraint and double down on superiority.\n\nDespite the arguments of arms control proponents that restraint is the best way to curtail arms races and promote dialogue between great powers, the history of arms control negotiations suggests that restraint is the wrong tool to achieve that goal. When Japan began a new naval building program in 1934, American and British leaders showed restraint in their naval construction, hoping to entice or shame Japan into dismantling its new warships. Instead, that uncontested naval buildup convinced Japanese leaders that they could defeat the United States and Britain in a war – with disastrous consequences.\n\nIn the 1960s, reassured by their massive lead over the Soviet Union in long-range missiles, American leaders canceled and delayed numerous advanced weapons programs in an attempt to convince the Soviets to join arms limitation talks. President Lyndon Johnson and his advisers calculated that the cost of matching American missile deployments would destroy the Soviet economy, and so concluded that the Soviets would cancel their own strategic weapons programs if the United States did it first. Soviet leaders did the opposite, pursuing a crash program of missile construction that within a few years equaled, and even exceeded, the missile forces of the United States. Like the Japanese, the Soviets did not reciprocate American restraint and instead seized an opportunity to surge ahead. Johnson’s wager on restraint failed to produce a workable arms control agreement, though his successors enjoyed the grim satisfaction of watching the Soviet Union disintegrate under the costs of the arms race two decades later.\n\nAs the Soviet Union collapsed, President George H.W. Bush tried an ambitious experiment in great power restraint under his Presidential Nuclear Initiatives (PNI). Under Bush’s direction, the U.S. announced steep unilateral cuts to its nuclear forces in the hopes that the emerging Russian Federation would match the United States’ drawdown. Bush’s initiative was well-timed to cash in on the mutual U.S.-Russian desire for a “peace dividend” after decades of Cold War rivalry. Yet today, we know that Bush’s PNI was a mixed success. While Russia responded to some American initiatives, it refused to match the U.S. in dismantling its tactical nuclear warheads, and this remains a major impediment to future arms reduction agreements.\n\nIf unilateral restraint so often fails to produce successful negotiations, then what hope is there for arms control? The answer is simple: to succeed, the United States must compete militarily with its rivals. Virtually every major success in limiting great power armaments over the last hundred years was preceded by the deployment of new American weapons systems. The 1922 Washington Naval Treaty, which placed strict caps on great power naval armaments, was driven in large part by the Naval Act of 1916, in which the United States committed itself to build a navy second to none. The 1972 Anti-Ballistic Missile (ABM) Treaty, which prohibited virtually all superpower missile defense systems, was preceded by America’s controversial decision to build the Safeguard ABM system. The much-lamented INF Treaty of 1987, was the product of NATO’s Dual Track approach, in which the United States deployed hundreds of accurate and lethal intermediate-range missiles pointed directly at the Soviet Union and its allies. And the 1991 Strategic Arms Reduction Treaty (START I) was hastened to its conclusion by America’s deployment of powerful new nuclear missiles like the Peacekeeper and Trident.\n\nAs the U.S. returns to great power competition, we must relearn how to achieve great power arms control. House Democrats may think that they are advancing the cause of arms control by refusing to fund new missiles. They’re not. Restraint is not enough: future arms control negotiations will depend on a strong missile program that incentivizes China and Russia to come to the table. If Congress is serious about salvaging arms control as a tool of American foreign policy, they should vote for it by approving funds for new missiles.\n\nJohn Maurer is a Jeane Kirkpatrick Visiting Scholar at the American Enterprise Institute", "description": "The end of the 1987 Intermediate-Range Nuclear Forces (INF) Treaty (through which the United States and the Soviet Union agreed to eliminate all ground-launched missiles with ranges between 500 and...", "authors": [], "top_image": "https://assets.realclear.com/images/43/430569_5_.jpg", "published_at": "2019-09-17"}