{"pub": "yahoo", "url": "https://finance.yahoo.com/news/oracle-orcl-stock-sinks-market-215009376.html", "downloaded_at": "2019-10-26 07:29:10.990513+00:00", "title": "Oracle (ORCL) Stock Sinks As Market Gains: What You Should Know", "language": "en", "text": "In the latest trading session, Oracle (ORCL) closed at $54.17, marking a -0.17% move from the previous day. This move lagged the S&P 500's daily gain of 0.41%. At the same time, the Dow added 0.57%, and the tech-heavy Nasdaq gained 0.7%.\n\nComing into today, shares of the software maker had gained 0.56% in the past month. In that same time, the Computer and Technology sector gained 2.38%, while the S&P 500 gained 2.04%.\n\nWall Street will be looking for positivity from ORCL as it approaches its next earnings report date. The company is expected to report EPS of $0.88, up 10% from the prior-year quarter. Our most recent consensus estimate is calling for quarterly revenue of $9.63 billion, up 0.69% from the year-ago period.\n\nLooking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $3.89 per share and revenue of $40.12 billion. These totals would mark changes of +10.51% and +1.51%, respectively, from last year.\n\nInvestors should also note any recent changes to analyst estimates for ORCL. These recent revisions tend to reflect the evolving nature of short-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.\n\nResearch indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.\n\nThe Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 0.04% lower. ORCL is holding a Zacks Rank of #3 (Hold) right now.\n\nIn terms of valuation, ORCL is currently trading at a Forward P/E ratio of 13.95. For comparison, its industry has an average Forward P/E of 28.73, which means ORCL is trading at a discount to the group.\n\nAlso, we should mention that ORCL has a PEG ratio of 1.43. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. ORCL's industry had an average PEG ratio of 2.17 as of yesterday's close.\n\nThe Computer - Software industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 85, which puts it in the top 34% of all 250+ industries.\n\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nTo follow ORCL in the coming trading sessions, be sure to utilize Zacks.com.\n\n\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n\n\nOracle Corporation (ORCL) : Free Stock Analysis Report\n\n\n\nTo read this article on Zacks.com click here.\n\n\n\nZacks Investment Research", "description": "Oracle (ORCL) closed at $54.17 in the latest trading session, marking a -0.17% move from the prior day.", "authors": ["Zacks Equity Research"], "top_image": "https://s.yimg.com/uu/api/res/1.2/YLMsTqXvevD8pPcVvjI3Gg--~B/aD02MDE7dz05MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/bdc2850a48a0f40806db817a9e24f36f", "published_at": "2019-10-25"}