{"pub": "thehill", "url": "https://thehill.com/policy/finance/466536-warren-yang-fight-over-automation-divides-experts", "downloaded_at": "2019-10-21 00:18:47.321747+00:00", "title": "Warren, Yang fight over automation divides experts", "language": "en", "text": "Sen. Elizabeth Warren Elizabeth Ann WarrenTrump says his Doral resort will no longer host G-7 after backlash Ocasio-Cortez: Sanders' heart attack was a 'gut check' moment Ocasio-Cortez tweets endorsement of Sanders MORE (D-Mass) and entrepreneur Andrew Yang Andrew YangYang cautions Democrats: Impeachment might not be 'successful' Yang defends Gabbard: She 'deserves much more respect' Super PAC seeks to spend more than million supporting Yang MORE's fight over jobs and automation at the last Democratic debate highlighted the divide over the contentious issue, including among experts.\n\nWarren and Yang sparred at Tuesday's presidential debate over whether automation or trade were primarily responsible for eliminating jobs in key parts of the country.\n\nYang’s campaign is centered around a universal basic income, which would pay every adult citizen $1,000 a month to combat the job loss brought on by automation. Americans, he said, are already seeing the effects of speedy technological advancement.\n\n“Their Main Street stores are closing. They see a self-serve kiosk in every McDonalds, every grocery store, every CVS,\" he said at the debate in Ohio. \"Driving a truck is the most common job in 29 states, including this one; 3.5 million truck drivers in this country. And my friends in California are piloting self-driving trucks.\"\n\nADVERTISEMENT\n\nWhile some of Warren’s plans acknowledge the role of automation, she has dismissed it as the primary driver of job loss.\n\n“The data show that we’ve had a lot of problems with losing jobs, but the principal reason has been bad trade policy. The principal reason has been a bunch of corporations, giant multinational corporations who’ve been calling the shots on trade,” she said at the debate.\n\nWarren argues that empowering workers on both corporate boards and in trade negotiations would help alleviate those problems.\n\nFollowing the debate, The Associated Press issued a fact check siding with Yang, pointing to one study from Ball State University in 2015 that attributed some 88 percent of manufacturing job losses to automation.\n\n“Economists mostly blame those job losses on automation and robots, not trade deals. So the Massachusetts senator is off,” the AP Fact Check wrote.\n\nWhile members of the “Yang Gang,” Yang’s devoted online supporters, expressed glee at the report, labor economists and experts took issue with the AP ruling, issuing their own fact checks on the news wire.\n\n“That fact check strikes me as incorrect,” said Melissa S. Kearney, a University of Maryland economist who along with Katharine G. Abraham co-authored a comprehensive review of factors behind employment loss.\n\nThe paper, published last year with the National Bureau of Economic Research, found that two of the top factors affecting job loss were “increased import competition from China and the penetration of robots into the labor market,” but found competition from China had more than double the effect of automation.\n\nNoah Smith, a Bloomberg Opinion columnist, argued that the Ball State study cited by AP was “of much lower quality than research showing a big impact from China.”\n\n“AP Fact Check got this one wrong,” he tweeted.\n\nIn a statement to The Hill, the AP said it stood by its story.\n\nNobel Laureate Paul Krugman assailed both Yang’s position and the AP fact check in a New York Times column, pleading with Democrats not to “go down the robot rabbit hole.”\n\n“As it happens, Warren was more right than the supposed fact-checkers,” he wrote. “As far as I can tell, [Yang is] offering an inadequate solution to an imaginary problem, which is in a way kind of impressive,” he added.\n\nADVERTISEMENT\n\nKrugman argued that the effect of technological change on jobs is no different today than it has been at any other time in modern history, noting that similar anxieties existed about machines taking away farmers’ jobs. While technology did cause the share of the jobs devoted to agriculture to drop precipitously in the last 80 years, he noted, better, higher-level jobs replaced them.\n\nIn response to criticism from Krugman on the same issue in June, Yang pointed to the low level of labor force participation.\n\nFormer Maryland Rep. John Delaney John Kevin DelaneyThe Hill's Campaign Report: Biden camp faces new challenges Warren's surge brings new scrutiny to signature wealth tax 'We lost a giant': 2020 Democrats mourn the death of Elijah Cummings MORE, a 2020 Democratic candidate who did not qualify for the most recent debate, rejected Yang's position, noting that automation had its upsides.\n\n“Krugman is right, the idea that automation will take away all the jobs is a complete fantasy. Innovation always displaces AND creates jobs, that's how progress works. What we need is massive public investment in workers and infrastructure to manage change,” he tweeted.\n\nBut while the experts seemed to side more closely with Warren, they didn’t let her off the hook completely either.\n\nThe primary culprit in trade-related job loss, they said, was China, which upended the global economic order when it began to open up its economy and joined the World Trade Organization in the 2001.\n\n“I want to be clear that it’s not to say that trade writ large is bad, but the experience of the last 20 years, with China in particular, has led to employment loss,” said Kearney.\n\nRecent studies, she noted, have shown that the shock of China’s economic boom and integration into the global economy has begun to recede.\n\nErnie Tedeschi, a managing director and policy economist for Evercore ISI, argues that although the U.S. lost some jobs to Mexico following the North American Free Trade Agreement, the deal actually helped prevent deeper job losses by giving U.S.-based companies a reason to stay put instead of relocating entirely to China.\n\nWhile there is still a robust academic debate, he said, research seems to indicate that automation has had more of an effect on wages than on the number of jobs.\n\n“Automation has probably allowed output and profits of firms to grow faster than pay has,” he said.\n\nThe debate shows no signs of cooling off.\n\nZach Moller, deputy director of the economic program at Third Way, a think tank argued that policy-makers should instead focus on how to help workers, regardless of what’s behind it, floating a new look at unemployment compensation and skills training.\n\n“If you ask the worker who lost their job, I don't think they care whether they lost the job from a robot or outsourcing,” he said. \"They care how they will support their family.\"", "description": "Sen. Elizabeth Warren (D-Mass) and entrepreneur Andrew Yang's fight over jobs and automation at the last Democratic debate highlighted the divide over the contentious issue, including among experts.", "authors": [], "top_image": "https://thehill.com/sites/default/files/yangandrew_warrenelizabeth_101819getty.jpg", "published_at": "2019-10-20"}