{"pub": "dailybeast", "url": "https://thedailybeast.com/why-we-hate-steven-spielberg-battles-white-supremacy-in-the-age-of-trump", "downloaded_at": "2019-10-13 09:55:32.085156+00:00", "title": "Steven Spielberg Battles White Supremacy in the Age of Trump", "language": "en", "text": "It will surprise no one that Donald Trump factors heavily into Why We Hate, a six-part Discovery Channel documentary series (executive produced by Steven Spielberg and Alex Gibney) that investigates the many forms and causes of—and possible remedies for—intolerance. So ubiquitous is his presence, in fact, that even when he’s not the specific topic of conversation, his corrosive shadow looms large over the proceedings—as when international criminal lawyer Patricia Viseur Sellers, describing Khmer Rouge madman Pol Pot’s motivations for initiating genocide, states (with a pause that indicates she knows what she’s about to imply), “He was going to make Cambodia great again.”\n\nOur current president’s ugly, divisive language and policies—and the white nationalist movements and mass shootings that have been inspired by it—are a natural fit for directors Geeta Gandbhir and Sam Pollard’s non-fiction work (premiering Oct. 13), because Trump perfectly embodies key elements of their portrait of personal and societal animosity. In short, the president is the latest in a long line of leaders who’ve exploited hate in a very particular, authoritarian way. First, he promotes the propagandistic message that the world is at war with him and those like him, and that his enemies are dehumanized “others” (see, for instance, his comment about immigrants: “These aren’t people; these are animals”). Then, he establishes himself as the sole persecuted figure who can provide sanctuary and deliverance from this threat—a promise couched in victimhood and compassion. In doing so, he weaponizes intolerance, making it a permissible position to hold and any ensuing violence committed in its name justifiable.\n\nIt’s a strategy familiar to anyone who’s studied 20th century history, and Why We Hate details its employment in, among other places, 1930s Germany, 1970s Cambodia, 1990s Rwanda and 2017-2018 Myanmar—locales for massacres that were fueled by the nationally promoted idea that the enemy (Jews, Tutsis, Muslim Rohingya people) was somehow a rat, or a cockroach, or a snake. Directors Gandbhir and Pollard make no blanket condemnation of Trump, because they don’t have to; just discussing his behavior in the context of his dictatorial predecessors does the work for them, illustrating how he preys upon supporters’ feelings of marginalization and oppression, turning those emotions into drivers of prejudice and conflict. His is a bigotry game as old as time itself, and thus it’s no wonder that reformed neo-Nazi Frank Meeink states, on-camera, that his white-power brethren saw Trump’s warning about border-crossing druggies, rapists and murderers as an obvious and direct shout-out to their cause.\n\nThough our commander-in-chief is a frequent focal point of Why We Hate, he’s far from the only—or even primary—area of concentration. Gandbhir and Pollard take an expansive look at the origins of hate, casting their net far and wide, and the issue of nature versus nurture is predictably central to their inquiry. A study of infant and toddler responses to simple positive/negative stimuli suggests that humans are born with at least some fundamental comprehension of right and wrong, and justice. Other studies, on the other hand, have demonstrated that, when placed in certain circumstances, average men and women can be compelled to behave in a horrific manner—especially when encouraged to do so by a charismatic leader. That too speaks to Trump, just as it relates to Hitler and the Holocaust, which proves to be ground zero for examinations of not only why we hate, but how enormous groups of individuals can go along with, and actively partake in, unthinkable atrocities.\n\nStanley Milgram’s famous 1963 experiment—in which adults were asked to shock their fellow participants for incorrectly responding to questions—remains eye-opening evidence of mankind’s capacity for carrying out cruel orders. Still, it’s merely one of Why We Hate’s numerous examples of people’s willingness to set aside, or negate, their morality. At the same time, Gandbhir and Pollard also look into the way in which tribalism—and the symbols of those tribes— helps foster an us-against-them mentality, a sense of belonging and togetherness, and therefore a cherished identity to be protected at all costs. That’s seen in the rabid fanaticism of British footballers, in American white nationalists (including 2015 Charleston church shooter Dylann Roof), and in Jesse Morton’s Revolution Muslim—all collectives that use irrational detestation of dissimilar groups as a means of self-definition.\n\nThe role of the internet (and its plethora of insular message boards and fake news) in creating and nurturing these communities—and the media’s hand in exacerbating cultural and political polarization—are also insightfully explored by Why We Hate. For a sprawling, multi-angled view of this gargantuan subject, certain topics don’t get quite the attention they deserve; the part that religion plays in fostering hateful dynamics, for one, is only tangentially touched upon, via Morton’s former pro-Islamic terrorism rhetoric. Nonetheless, Gandbhir and Pollard waste few moments on unnecessary material, navigating the diverse biological and social dynamics that give birth to hate, and allow it to fester and spread in directions both deliberate and unexpected.\n\n“ Over the course of its six chapters, ‘Why We Hate’ only rarely repeats itself, and it moves with a swift sense of purpose. ”\n\nWhile the show is populated by a plethora of talking heads, it generally shapes each episode around one speaker, and it cannily enhances its arguments’ depth and breadth via juxtapositions of narrated comments and non-fiction archival material. Over the course of its six chapters, Why We Hate only rarely repeats itself, and it moves with a swift sense of purpose. That confident pacing and structure adds to its persuasiveness, and goes a long way toward making its material go down somewhat smoothly—a not-inconsiderable feat considering that so much of what it tackles is crushingly upsetting and awful.\n\nIn its final installment, Why We Hate turns to science as a tool for combatting the roots of hate, via neuroscientist Emile Bruneau’s plan to record interviews with Colombian FARC rebels and then show them to anti-FARC Colombians. His undertaking is guided by the hope that, as with many of the reformed xenophobes profiled here, greater understanding of the “other” will allow tolerance and peace to flourish. According to this thought-provoking series, facing that which one fears, and loathes is the most promising solution to this age-old problem. Although as evidenced by the story of a Tutsi soccer goalkeeper in Rwanda whose life was saved by his Hutu teammate—who then perished as a result of his heroism—it sometimes also takes a good heart that refuses to turn black even in the face of overwhelming evil.", "description": "The legendary filmmaker—along with Alex Gibney—serves as executive producer of “Why We Hate,” a new six-part docuseries examining the causes (and possible solutions) to bigotry.", "authors": ["Nick Schager"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1570853751/191011-Schager-why-we-hate-tease_bsxuab", "published_at": "2019-10-13"}