{"pub": "breitbart", "url": "https://breitbart.com/asia/2019/10/26/report-nearly-900-pakistani-children-test-positive-for-hiv", "downloaded_at": "2019-10-27 00:28:19.352681+00:00", "title": "Report: Nearly 900 Pakistani Children Test Positive for HIV", "language": "en", "text": "Nearly 900 children in a Pakistani city tested positive for HIV, according to a Saturday report from the New York Times.\n\nThe Times reported that the children in the Pakistani city of Ratodero were bedridden with treatment-resistant fevers, with health officials linking the outbreak to a pediatrician who reused syringes.\n\nSince the discovery, 1,100 citizens tested positive for HIV, with nearly 900 citizens being under the age of 12.\n\nHealth officials estimate the number of citizens to be much higher, because only a fraction of the city’s population has been tested for the virus.\n\nThe government was slow to respond to the outbreak at first and struggled to gain resources to treat the sick, but teams of international relief workers from several countries eventually stepped in to help. The World Health Organization also donated testing kits.\n\n“Unless these quack doctors, barbers and dentists are not checked,the number of incidents of H.I.V. infection will continue going up,” said Dr. Imran Akbar Arbani, a local doctor who had tipped off the authorities about the origin of the outbreak.\n\nThe Ratodero outbreak reflects a nationwide uptick in cases throughout the country, despite a decreasing worldwide infection rate, according to the Times.\n\nBetween 2010 and 2018, the number of HIV-positive people in Pakistan doubled to about 160,000, according to a fact sheet from UNAIDS— a United Nations task force dedicated to HIV and AIDS.\n\nDuring those years, the number of infections in the 15 to 24 age bracket increased 36 percent.", "description": "Nearly 900 children in a Pakistani city tested positive for HIV, according to a Saturday report from the New York Times.", "authors": ["Katherine Rodriguez"], "top_image": "https://media.breitbart.com/media/2019/10/Pakistan-Children-HIV-640x335.jpg", "published_at": "2019-10-26"}