{"pub": "yahoo", "url": "https://news.yahoo.com/many-more-lives-could-saved-grenfell-report-says-132434898--abc-news-topstories.html", "downloaded_at": "2019-10-30 16:05:54.441691+00:00", "title": "'Many more lives' could have been saved: Grenfell report says there were 'systemic failings' in emergency response to the blaze", "language": "en", "text": "'More lives' could've been saved in emergency response to Grenfell fire, report says originally appeared on abcnews.go.com\n\nA long-awaited report into the Grenfell Tower fire has claimed that there were “systemic failings” in the response of emergency services to the blaze and “many more lives” could have been saved.\n\nAn inquiry let by lawmaker Sir Martin Moore-Bick concluded that the decision to evacuate the tower block should have been made earlier, but that the firefighters who attended the scene “deserve the gratitude of the local community and London as a whole.”\n\n“The bravery and commitment to duty shown by individual firefighters cannot mask or excuse the deficiencies in the command and conduct of operations,” the report said. “Once it was clear that the fire had spread out of control, that compartmentation had extensively failed, but that evacuation remained possible, a decision should have been made to evacuate the tower.”\n\n(MORE: Grenfell Tower fire victims in emotional anniversary remembrance: 'Forever in our hearts')\n\nPHOTO: Survivors, bereaved families, members of the public and community leaders march from St. Helen's Church in North Kensington to the base of the Grenfell Tower during the 'Humanity for Grenfell' commemorations, June 14, 2019 in London. (Wiktor Szymanowicz/Barcroft Media via Getty Images) More\n\nAlthough the report acknowledges that the internal layout of the building meant a mass evacuation presented “serious risks,” in the face of the “pervasive spread of smoke and fire throughout the interior, prompt evacuation would have resulted in the saving of many more lives.”\n\nThe report also criticized the London Fire Brigade for sending “relatively junior rank” commanders to the scene, and for “uncertain” communication between the control room and the responders at the scene. Other key aspects of the report included the observations that the resident of the apartment where the blaze began was not at fault, and that the structural use of cladding caused the fire’s spread.\n\nLondon’s fire commissioner, Dany Cotton, defended the emergency services’ response, saying they were dealing with an “unprecedented” situation and were “disappointed at some of the criticism” levelled at individual staff.\n\n(MORE: Three billboards in London ask hard questions about Grenfell tower fire)\n\nPHOTO: A huge fire engulfs the 24 story Grenfell Tower in Latimer Road, West London in the early hours of this morning in this June 14, 2017 file photo in London. (Gurbuz Binici /Getty Images, FILE) More\n\nSurvivors’ groups have welcomed the publication of the report, the first phase of a parliamentary inquiry into the blaze which claimed 72 lives at the 24 story tower block on June 14, 2017.\n\n“While nothing can ever bring back our loved ones that passed away in the fire, this is a strong report with a forensic examination of the events of the night,” the survivors’ group Grenfell United said in a statement. Justice means different things for all of us but the truth needs to be at the heart of our collective healing…. Today’s findings give some confidence that our journey towards truth has finally begun.”\n\n(MORE: 5 men arrested for burning effigy of Grenfell Tower)\n\nPrime Minister Boris Johnson said that “no apology will ever make good the loss suffered,” although he hoped it would “bring some measure of comfort to those who suffered so much.”\n\n“We promised them the truth,” he said. “We owe them the truth. And, today, the whole country, the whole world, is finally hearing the truth about what happened at Grenfell Tower on the 14th of June 2017. For the survivors, the bereaved, and the local community, this report will prove particularly harrowing.”\n\n“Yet I hope it strengthens their faith in the Inquiry’s desire to determine the facts of the fire,” he said.\n\nA criminal investigation by the Metropolitan Police into the circumstances of the fire is still ongoing.\n\nABC News' Sophia Wang contributed to this report.", "description": "A long-awaited report into the Grenfell Tower fire has claimed that there were “systemic failings” in the response of emergency services to the blaze and “many more lives” could have been saved.  “The bravery and commitment to duty shown by individual firefighters cannot mask or excuse the deficiencies", "authors": ["Guy Davies"], "top_image": "https://s.yimg.com/uu/api/res/1.2/qXPsJDwGjXir7bYlijSOWg--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.gma.com/greenfell-gty-er-191030_hpMain_16x9_992.jpg", "published_at": "2019-10-30"}