{"pub": "reuters", "url": "https://uk.reuters.com/article/idUKKBN1WG3BP", "downloaded_at": "2019-10-02 00:43:25.429731+00:00", "title": "Ryanair boss slams UK aviation regulator after Thomas Cook collapse", "language": "en", "text": "LONDON (Reuters) - Ryanair (RYA.I) boss Michael O’Leary slammed Britain’s aviation regulator on Tuesday, saying its soft licensing rules contributed to the chaos around Thomas Cook’s TCG.L bankruptcy.\n\nRyanair Chief Executive Michael O'Leary speaks during a Reuters Newsmaker event in London, Britain October 1, 2019. REUTERS/Peter Nicholls\n\nO’Leary, whose low-fare model has squeezed less competitive rivals, said the tour operator model was “dead” and Thomas Cook’s collapse last week was no surprise.\n\nHe said that some responsibility lay with the Civil Aviation Authority (CAA) for granting Thomas Cook a license to operate without demanding more proof that they would survive.\n\n“How you can license Thomas Cook in April as fit to fly for another 12 months and then it goes bust in September. (It) is something the CAA needs to address,” O’Leary said at a Reuters Newsmaker event in London.\n\n“The CAA should be much more aggressive in requiring the shareholders of those companies to put up much more cash to get through the year, rather than allowing them to continually fail.”\n\nThe CAA could not immediately be reached for comment.\n\nThomas Cook’s UK airline immediately folded when the company went into administration, although its German Condor airline is still flying and has been offered a bridging loan by the German government. Thomas Cook’s Scandinavian airline is also still flying.\n\nO’Leary speculated that Germany’s Lufthansa (LHAG.DE) might ultimately buy Condor, whose CEO on Tuesday said that there would eventually be a new owner of the airline, according to Die Zeit.\n\nHe also said that Ryanair is not interested in Condor. However, he said he was talking to leasing companies about taking on Thomas Cook’s Airbus (AIR.PA) planes for Ryanair group’s Lauda airline, and could take on some of the travel group’s pilots if they could be trained by next summer.\n\nO’Leary said the grounding of the Boeing 737 MAX in March, following two fatal crashes, had hampered Ryanair’s ability to grow quickly to take advantage of the opportunities from Thomas Cook’s collapse. He added that Ryanair now hoped its 737 Max orders would be fulfilled for next summer.\n\nWith 135 of the Boeing jets on order and 75 options, Ryanair is one of Boeing’s (BA.N) biggest customers for the latest 737.\n\n“It will slow down our growth in summer 2020, which is a pity,” O’Leary said.\n\n“When opportunities come up like the failure of Thomas Cook... we want to be able to grow faster,” he said. “But safety is the first priority.”\n\nO’Leary said that while it was easy to point at management when a company fails, Thomas Cook’s problems ran deeper than the current board as the company’s whole business model was fundamentally outdated.\n\n“The package market I think is screwed, it’s over. It’s like whoever was making shoes for horses when there were horse-drawn carriages,” he said.\n\n“There were some good, well-managed horse-shoe companies but ultimately they went the same way as well and that will happen with tour operators here in Europe.”", "description": "Ryanair boss Michael O'Leary slammed Britain's aviation regulator on Tuesday, saying its soft licensing rules contributed to the chaos around Thomas Cook's bankruptcy.", "authors": ["Alistair Smout", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191001&t=2&i=1435819859&w=1200&r=LYNXMPEF902BK", "published_at": "2019-10-01"}