{"pub": "afr", "url": "https://afr.com/politics/federal/spy-agency-hid-warrant-bungle-from-minister-for-nine-months-20191030-p535ok", "downloaded_at": "2019-10-30 14:25:07.571933+00:00", "title": "Spy agency hid warrant bungle from minister for nine months", "language": "en", "text": "Details of the case only emerged in the Inspector-General of Intelligence and Security's annual report, tabled in Parliament earlier this month.\n\nAccording to the IGIS inquiry, ASD told the Inspector-General in June 2017 that because of an error in preparing warrants to collect \"communications of foreign intelligence value\", some staff who had intercepted telecommunications information had not been authorised to do so.\n\n\"In the absence of authorisation the collection was unlawful,\" the IGIS report said.\n\n\"By July, five months after the warrants were signed, ASD staff were aware that a significant number of unlawful interceptions had occurred. This information was not conveyed to the Inspector-General or the Minister for Defence until February 2018.\"\n\nSenator Payne, who has since become foreign minister, requested IGIS begin an investigation after she \"expressed concern with the timeliness and adequacy of reporting to her and the Inspector-General\".\n\nThe Inspector-General's year-long inquiry was finalised in May and made five classified recommendations after finding ASIO made a mistake when preparing the warrant and ASD failed to check its accuracy.\n\nWhile illegally obtained material was deleted once the error was found, the Inspector-General said ASD's initial reporting of the incident had been inadequate, while ASIO failed to tell the Attorney-General it had breached its warrant.\n\nThe Australian Financial Review understands the mistake happened because ASIO left the name of a new ASD staff member off the warrant.\n\nAdvertisement\n\nMr Wilkie, a former intelligence officer turned whistleblower, said powerful security agencies should not be allowed to make mistakes like this.\n\n\"It points to poor processes and poor management but more alarmingly it suggests dishonesty,\" he said.\n\n\"The fact they sat on it for nine months is not just possibly dishonesty on ASD's part but also a cultural problem within ASD where they seem to think they are a law unto themselves.\"\n\nAn ASD spokesman stressed the matter did not relate to unauthorised collection of intelligence on Australians and along with ASIO they were committed to operating legally and ethically within the letter and spirit of the law.\n\n\"While the intelligence collection was done in accordance with the terms of a warrant, an administrative oversight meant that a list of ASD names was not 100 per cent accurate,\" the spokesman said.\n\n\"In a sign of ASD’s commitment to legality and transparency, the Director-General asked the Minister to request a full IGIS investigation.\"\n\nASIO said it had amended its procedures to ensure it proactively reports breaches to the Attorney-General and enhanced training and administrative procedures for activities requiring warrants.\n\n\"There is a high degree of compliance with formal and procedural requirements – from time to time there will be human administration errors, particularly in a high operational tempo,\" ASIO said.\n\nDefence Minister Linda Reynolds said she had been assured steps had been taken to avoid a repeat.\n\n\"Our intelligence agencies take compliance and assurance very seriously. I have made clear to the ASD leadership this must be an ongoing priority,\" she said.", "description": "Independent MP Andrew Wilkie has criticised the Australian Signals Directorate after the spy agency made a \"significant number of unlawful interceptions\".", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.3049%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_388%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/302accb8e14ef471d6e38862b32cd558442d8772", "published_at": "2019-10-30"}