{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7615893/Tara-Moss-suing-doctor-professional-negligence.html", "downloaded_at": "2019-10-26 07:01:14.904966+00:00", "title": "Tara Moss is suing a doctor claiming professional negligence", "language": "en", "text": "She famously swapped modelling for crime writing in her twenties.\n\nNow Tara Moss is involved in legal proceedings against a doctor claiming professional negligence, according to The Sydney Morning Herald on Saturday.\n\nThe 46-year-old author has been relying on a walking stick for the past three years, following an unspecified hip injury.\n\nHeaded to court: Tara Moss (pictured), 46, is suing a doctor for professional negligence, according to The Sydney Morning Herald on Saturday, three years after a hip injury\n\nWhen approached for comment by the publication, lawyers for the Canadian-Australian writer confirmed that she 'is currently involved in legal proceedings'.\n\nNo further details have been released at this stage.\n\nThe mother-of-one appears to be taking the injury somewhat in her stride, even creating an Instagram account for her cane with the handle Tara and Wolfie.\n\nAppearing on Seven's The Morning Show last week, she shared her mission to normalise walking sticks.\n\nSo stylish: An unspecified hip injury in 2016 has seen the former model-turned-crime novelist resort to using a walking stick\n\n'Visibility matters, so it's important to start being more open about it,' she said. 'I was hoping that I wouldn't need it, but now I embrace it.'\n\n'The walking stick helps me to be more active, enjoy my life more fully and with less pain, and that's true for a lot of other people,' Tara added.\n\n'So I want to be out there and representing, as they say.'\n\nVisibility: Appearing on Seven's The Morning Show last week, Tara shared her mission to normalise walking sticks\n\n'Once it's a reality in your life, you have to either embrace it or hide it, and I don't want to hide it.'\n\nTara, who is based in Vancouver with her husband Berndt Sellheim and daughter Sapphira, eight, is currently in Australia on a promotional tour for her latest novel.\n\nDead Man Switch takes place just after World War II, and sees private investigator Billie Walker uncover the disappearance of a young man.", "description": "She famously swapped modelling for crime writing in her twenties.", "authors": ["Kristy Johnson For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/05/20207126-0-image-a-115_1572064465375.jpg", "published_at": "2019-10-26"}