{"pub": "afr", "url": "https://afr.com/work-and-careers/leaders/corporate-power-in-australia-2019-the-one-deal-that-says-it-all-20190905-p52ohi", "downloaded_at": "2019-10-05 06:09:13.722187+00:00", "title": "Corporate power in Australia 2019: the one deal that says it all", "language": "en", "text": "James Thomson Columnist Oct 2, 2019 — 11.07am Share\n\nIf there was a deal from the past year that defined the shifting sands of power in corporate Australia, it was the $4.4 billion battle for Healthscope. The rise and rise of private capital, the shrinking of public markets, the ramifications of a low-growth world and the value that can be created from megatrends such as the ageing population were all themes captured in the tussle for the country’s biggest private hospital operator.\n\nAbove all, the deal demonstrated the growing power of Australia’s superannuation industry, boosted by the fallout from the Hayne banking royal commission that trashed the public’s trust in some of our best-known companies.\n\nThat one of the combatants would be Canadian giant Brookfield was no surprise. In a world of plunging bond yields, investors will go anywhere to find returns; Brookfield’s insatiable hunger for huge, complex deals doesn’t look as risky as it once did. Squaring off against a consortium led by ambitious private equity group BGH and the $171 billion industry super titan AustralianSuper would have been unthinkable a few years ago: private equity in bed with industry super? And yet today it seems entirely predictable.\n\nAfter all, AusSuper was a cornerstone investor in BGH, run by veteran dealmakers Ben Gray, Robin Bishop and Simon Harle.\n\nAusSuper was also the long-suffering holder of a 10 per cent stake in the underperforming Healthscope; why wouldn’t it want to extract some value for its members?\n\nWhat shocked the market was the hardball tactics AusSuper employed. When BGH lobbed its first bid in April 2018, and subsequent offer in October, AusSuper took the unusual position of refusing to support any other bid, even if it was higher.\n\nThe fallout was immediate and, at times, savage. Was AusSuper suddenly prepared to use its financial might to aggressively secure deals? Was it really acting in the best interests of members by refusing to support higher bids – even if logic says every bidder wants to buy an asset for the lowest price? And was any ASX company in which AusSuper holds a stake safe from these pumped-up private equity predators? About $16 billion in funds flowed into AusSuper in 2018-19, some of which came from bank-owned superfund refugees after the royal commission.\n\nAs the battle for Healthscope reached fever pitch in early 2019, AusSuper was plunged into fresh controversy when it emerged that Michele O’Neil, the president of the Australian Council of Trade Unions and an AusSuper director, had written to 30 industry funds to seek their “active support” in pressuring BHP over an industrial dispute involving the maritime union. For some at least, it was evidence of the conflicts inherent in superannuation funds – the new kings of capitalism – whose origins lie in the trade union movement.", "description": "Our list of the 10 most powerful corporate leaders reflect a business environment that is being moulded by the new kings of capitalism.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.1936%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/7aaa2332155a1bf11d0fe6a185a2cf255092afd9", "published_at": "2019-10-02"}