{"pub": "yahoo", "url": "https://news.yahoo.com/1-attacks-iran-bring-captivity-064648063.html", "downloaded_at": "2019-09-25 08:46:46.157634+00:00", "title": "UPDATE 1-Attacks on Iran will bring captivity and defeat, senior military official says", "language": "en", "text": "(Adds more from Baqeri and background)\n\nGENEVA, Sept 24 (Reuters) - Enemies who try to attack Iran will face captivity and defeat, a senior Iranian military official said on Tuesday, a day after President Hassan Rouhani said Iran’s message to the world was \"peace and stability\".\n\nThe United States, Saudi Arabia and European powers blame Iran for a Sept. 14 attack on a Saudi oil facility. Yemen's Iran-aligned Houthi group, which has been fighting a Saudi-led military coalition since 2015, has claimed responsibility. Iran denies involvement.\n\n\"We have repeatedly told the enemy that if there is any violation toward this country, they will face the same action that took place with the American drone and the English tanker,\" Iran's armed forces chief of staff, Major General Mohammad Baqeri was cited as saying by the Tasnim news agency.\n\n\"The result of a violation toward this country will be captivity and defeat.\"\n\nIran does not have any enmity toward Saudi Arabia or the United Arab Emirates and both countries should stand by the Islamic Republic to secure the region, Baqeri said.\n\nRouhani will present a plan for creating security in the Gulf in cooperation with other countries in the region when he attends the United Nations General Assembly in New York this week.\n\n\n\n\n\n(Reporting by Babak Dehghanpisheh; Editing by Raissa Kasolowsky)", "description": "Enemies who try to attack Iran will face captivity and defeat, a senior Iranian military official said on Tuesday, a day after President Hassan Rouhani said Iran’s message to the world was \"peace and stability\".  Yemen's Iran-aligned Houthi group, which has been fighting a Saudi-led military", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-09-24"}