{"pub": "investing.com", "url": "https://ph.investing.com/news/forex-news/forexbrexit-deal-helps-keep-euro-close-to-7week-high-68774", "downloaded_at": "2019-10-18 08:54:21.943034+00:00", "title": "FOREX-Brexit deal helps keep euro close to 7-week high", "language": "en", "text": "© Reuters. FOREX-Brexit deal helps keep euro close to 7-week high\n\n* Dollar steady against major currencies\n\n* Norwegian krone close to breaking all-time low\n\n* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh\n\n\n\nBy Olga Cotaga\n\nLONDON, Oct 18 (Reuters) - The euro was hovering on Friday\n\naround the seven-week high it reached against the U.S. dollar on\n\nThursday as hopes that a Brexit deal between Britain and the\n\nEuropean Union could prevent an economic recession in the euro\n\nzone.\n\nThe common currency has been rattled this year by dismal\n\nmanufacturing data, as well as by worries that deepening\n\neconomic tensions between the United States and China could make\n\neuro zone economies grow even slower.\n\nBut with Britain's prime minister Boris Johnson and EU\n\nleaders agreeing a new deal for Britain to exit the bloc, and\n\nwith U.S.-China tensions easing, the euro was enjoying a sigh of\n\nrelief.\n\n\"Without Brexit, the euro might be now liberated from this\n\nburden,\" said Antje Praefcke, a forex analyst at Commerzbank.\n\nMoreover, expectations that the Federal Reserve may cut\n\ninterest rates at the Oct. 30 meeting added further optimism,\n\ngiven that this would shrink yield differentials between the\n\nUnited States and euro area.\n\n\"The fed looks more willing to cut\" in the immediate term,\n\nsaid Praefcke.\n\nThe euro was last trading flat at $1.1122 EUR=EBS , not far\n\nfrom $1.1140, its highest since Aug. 26.\n\nThe index which tracks the dollar against six major\n\ncurrencies was also last flat at $97.581 .\n\nThe pound was slightly weaker, down 0.2% at $1.2865, but\n\nstill very close to the five-month high of $1.2988 it reached on\n\nThursday after the U.K. and the EU agreed to a Brexit deal.\n\nTraders worry that an initial relief at securing the\n\nlong-awaited Brexit deal could be brief, however, because the\n\nprime minister still needs to sell the agreement to sceptical\n\nlawmakers when parliament sits on Saturday. The yuan held steady against the dollar after data showed\n\nChina's economy grew at the weakest pace in more than 27 years\n\nin the third quarter due to a costly trade war with the United\n\nStates and weak factory production.\n\nIn the offshore market, the yuan was last neutral at 7.0828\n\nagainst the dollar. CNH=EBS\n\nElsewhere, the Norwegian krone was very close to breaking\n\nthe all-time low of 10.2215 it plunged to against the euro on\n\nThursday, last trading flat at 10.2105. EURNOK=D3\n\nAnalysts were scratching their heads why the krone was so\n\nweak, saying one possible explanation could be the weak demand\n\nfor Norwegian equities.\n\n\"Historically the NOK has often traded weak towards the end\n\nof the year, but our FX analysts are struggling to find the\n\nflows that explain this seasonal weakness,\" said SEB analysts in\n\na note to clients.\n\n\n\n", "description": "FOREX-Brexit deal helps keep euro close to 7-week high", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPED570TR_L.jpg", "published_at": "2019-10-18"}