{"pub": "nationalreview", "url": "https://nationalreview.com/bench-memos/one-of-these-impeachment-resolutions-is-not-like-the-other", "downloaded_at": "2019-10-30 00:03:19.782068+00:00", "title": "Trump Impeachment Inquiry: One of These Impeachment Resolutions Is Not Like the Other", "language": "en", "text": "House Speaker Nancy Pelosi announces the House of Representatives will launch a formal inquiry into the impeachment of President Donald Trump, September 24, 2019. (Kevin Lamarque/Reuters)\n\nDemocrats have rejected every opportunity to pursue their impeachment inquiry in a way that at least appears non-partisan, fair, or consistent with past practice. They just won’t do it.\n\nFirst they refused to have the full House vote to authorize the inquiry. The House did it for the impeachment of Presidents Bill Clinton in 1998 and Richard Nixon in 1974. The House even did it for the impeachment of U.S. district judge G. Thomas Porteous, Jr. in 2010. But no, Speaker Nancy Pelosi refused to do so this time, instead unilaterally launching the inquiry herself.\n\nAdvertisement\n\nAdvertisement\n\nSecond, past impeachment inquiries were conducted by the House Judiciary Committee. This time, when Pelosi waved the starting flag, no less than six committees were off and running.\n\nNow we are told that the House will vote on a resolution this week that, according to a Pelosi statement, directs the six committees to “continue their ongoing investigations as part of the existing” inquiry. What’s the point of the House voting to say “Carry On”?\n\nWhile the resolution lists the six investigating committees, however, it spells out procedures for only two of them — Judiciary and Intelligence. The others, it appears, may continue in secret, making it up as they go along.\n\nAdvertisement\n\nThere’s one more curious thing about the proposed House resolution. When the House authorized the Clinton impeachment inquiry, House Resolution 581 allowed the Judiciary Committee chairman and ranking member to issue subpoenas “by acting jointly.” If “either declines to act,” the other had to first refer the matter to the full committee for decision before acting alone. House Resolution 803 spelled out the same procedure for the Nixon impeachment.\n\nAdvertisement\n\nThe proposed resolution for the Trump impeachment inquiry is different. It says only that the ranking member may issue subpoenas “with the concurrence of the chair.” If the chair “declines to concur,” the ranking member must refer the matter to the full committee for decision before acting alone.\n\nSee the difference? The chairman may issue subpoenas unilaterally, but the ranking member is always subject to the permission of the majority — either the chairman or the committee, on which Democrats have a 13–9 advantage.\n\nIf House Democrats really, or even half-heartedly, wanted something as grave as an impeachment inquiry to at least look reasonably non-partisan or fair, they know how to do it. They’ve chosen not to do it that way, which tells just what their motive really is.", "description": "Democrats have rejected every opportunity to pursue their impeachment inquiry in a way that at least appears non-partisan, fair, or consistent with past practice. They just won’t do it.", "authors": ["Thomas Jipping", "Zachary Evans", "Kevin D. Williamson", "Andrew C. Mccarthy", "Tobias Hoonhout", "John Fund", "Matthew Continetti", "Ramesh Ponnuru", "Mairead Mcardle", "Read More"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2019/09/nancy-pelosi-impeachment-inquiry.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-29"}