{"pub": "independent", "url": "https://independent.co.uk/news/world/asia/afghanistan-election-taliban-peace-talks-us-government-buddhas-bamiyan-a9122026.html", "downloaded_at": "2019-09-26 20:55:00.358599+00:00", "title": "On the Afghan campaign trail in the shadow of the destroyed Buddhas of Bamiyan, talk of Taliban return divides", "language": "en", "text": "One of the last rallies of the election campaign takes place under the shadow of the most internationally familiar symbol of religious intolerance in Afghanistan – the cliffs of Bamiyan where the magnificent statues of Buddha had stood from the sixth century before being blown up by the Taliban.\n\nThere is another shadow looming over the 10,000 people gathered in the valley below: the growing and foreboding prospect that 18 years after Mullah Mohammad Omar’s regime fell, the same year the statues were destroyed, the Taliban may be edging back to power.\n\nThe prolonged talks held in Qatar between the US and the Taliban were suspended by Donald Trump following a Taliban attack in Kabul in which an American soldier was killed. But there is expectation that they will resume again in the future, with the US president desperate to get US forces back home before the election next year, allowing him to claim credit for ending the longest war in America’s history.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nMany of the candidates in the coming Afghan election, including some who would not have countenanced this happening in the past, now say the push for Taliban involvement in government is going to get stronger over the coming months and may be difficult to resist. This is likely, they say, not just because of the signals from Washington but the violent reality on the ground, with the Taliban and other Islamist groups like al-Qaeda and Isis controlling expanding swathes of territory, and war weariness from a population suffering relentless bombings and shootings.\n\nThe star attraction at the Bamiyan rally is Abdullah Abdullah, who had been co-leader of the current National Unity Government with President Ashraf Ghani and who is now his main rival at the polls.\n\nAs we fly up to Bamiyan together from Kabul on an army helicopter, Dr Abdullah, who had the title of chief executive in the administration, tells of the need to find a way to end the bloody conflict, and how power-sharing with the Taliban could be the answer.\n\n“The Taliban are a reality in the country, their forces, their supporters, their foreign connections. Everybody agrees you cannot finish this war by just fighting and killing everybody. Hopefully the Taliban see it as well,” he said.\n\n“The point is to move to a solution, and one I would like to have is an interim set-up. All sorts of possibilities have to be looked at, including power-sharing. Then there is a permanent solution, and that will be through elections.\n\n“I think the US have done a good job, but before agreeing to a [draft] agreement they should have imposed some conditions on the Taliban. There should have been an agreement on a ceasefire. Look at how committed the people are to the election despite how dangerous it is. We cannot let down these people so we must find a solution.”\n\nDr Abdullah was once a key lieutenant of the Northern Alliance Commander Ahmed Shah Masood, ‘the Lion of Panjshir’, and fought alongside him in years of bloody conflict against the Taliban.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nShape Created with Sketch. Afghanistan war: lives of children devastated by the endless conflict Show all 20 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Afghanistan war: lives of children devastated by the endless conflict 1/20 Andrew Quilty/Save the Children 2/20 Nooria*, 15 in the home her family has lived in for the past two years in Mazar-i Sharif She was forced to flee her home with her family after their town was attacked by armed groups. Nooria describes a rocket hitting her neighbours home killing many inside. They fled on foot with just the clothes on their backs and she now lives in Mazari Shariff where Save the Children have enrolled her in school and provide vocational training Andrew Quilty/Save the Children 3/20 Nooria* hopes for a future with no war; \"When they attacked our village, the rocket hit our neighbour's house and they all died. Our house then caught fire and we ran away. My friends who I used to play with - I still don't know if they are alive or if they are dead.” Andrew Quilty/Save the Children 4/20 “I'm hoping for a better future, to learn, to support my family and to get them out of this difficult life. And I'm hoping for a future where there is no war.” Andrew Quilty/Save the Children 5/20 Naveed*, 16 at his family home in Mazar-i Sharif Naveed lost his leg when he stepped on a mine aged just 8-years-old. He was herding the family's sheep in the mountains near their home when he triggered a landmine Andrew Quilty/Save the Children 6/20 After months of medical treatment his right leg was eventually amputated. He received physiotherapy and a prosthetic leg from the International Committee for the Red Cross in Mazar Andrew Quilty/Save the Children 7/20 Now enrolled in school, Naveed is being given vocational training by Save the Children. “For around a year I felt and dreamt that I still had my leg. But when I woke up and saw, there was no leg. Sometimes I’d feel with my hand to check and find it wasn't there.” Andrew Quilty/Save the Children 8/20 “If someone has loses their leg, it does not mean that they have lost their mind.\" Andrew Quilty/Save the Children 9/20 \"With the help of our minds we can continue to study, learn, and work to make the future of our families brighter.” Andrew Quilty/Save the Children 10/20 Naveed and Mahboob*, 55 (Naveed's father) Several years ago Neveed's father, Mahboob, was brutally beaten with rifle butts by armed groups after, he says, he failed to provide food for them while they were stationed in the family's village. He suffered brain damage which affected the right side of his body, speech and his brain function Andrew Quilty/Save the Children 11/20 Habiba*, 14, and Arezo*, 15 in a village outside Kabul Habiba and Arezo were injured with their mother three years ago in a suicide bombing in Kabul. Arezo is still traumatised from what she saw and has become completely withdrawn Andrew Quilty/Save the Children 12/20 Arezo's younger sister Habiba cares for her, takes her to lessons and anywhere she wants to go. They are both in school through Save the Children's 'Steps towards Afghan girls' education success' (STAGES) programme, which helps the most marginalised girls get access to education, stay in school and learn. Andrew Quilty/Save the Children 13/20 Habiba says: “When I woke up and I opened my eyes I saw lots of bodies and I thought I was not alive any more. It was horrible. I'll never forget that. Whenever there is a big sound she gets scared because she was traumatised by the sound she heard during the attack. I love my sister, and I help her with her lessons, I take her anywhere.\" Andrew Quilty/Save the Children 14/20 \"She's older than me but I feel like the older one because I support her. I hope for a better future for me and my sister.” Andrew Quilty/Save the Children 15/20 Khalida*, 10 in a classroom in a village outside Kabul Two years ago Khalida lost her 18-year old brother when he was killed in an explosion in Kabul. She misses him every day and says the family are still carrying the grief of his loss Andrew Quilty/Save the Children 16/20 \"Two years ago, my brother was going to Kabul when an explosion happened and he lost his life. We are still carrying the grief and are crying over him. At the time we were happy, everyone was happy. Now no-one is happy in the family. When I remember him, I cry and feel so bad. I hope for peace and that war will stop, and that nobody loses their brother” Andrew Quilty/Save the Children 17/20 “I want to get education to become a teacher. I want to teach others who have never been to school” Andrew Quilty/Save the Children 18/20 Sema*,11 at her family home in Kabul Sema recalls coming home from her aunt's house and being told that her father had been killed in a suicide attack Andrew Quilty/Save the Children 19/20 Sema still thinks about him every second and likes to look at his prayer beads (Tisbeh) to remember him. They hang from the curtain in the family home. She loves school and wants to become a teacher one day. Sema says she wants peace in her country to stop other children losing their fathers. “We still have lots of his belongings, like his car, his clothes, his watch, his shoes. Whenever we see them we cry. He gave us all so much love every moment and he is on our minds. I want for the powerful people around the world to stop the war and bring peace, because I don't want other children to lose their fathers.” Andrew Quilty/Save the Children 20/20 “I want to become a teacher to serve the country and I don't want any girls to be illiterate. I want to teach all the girls, so they have access to education.” *Names have been changed to protect identities Andrew Quilty/Save the Children 1/20 Andrew Quilty/Save the Children 2/20 Nooria*, 15 in the home her family has lived in for the past two years in Mazar-i Sharif She was forced to flee her home with her family after their town was attacked by armed groups. Nooria describes a rocket hitting her neighbours home killing many inside. They fled on foot with just the clothes on their backs and she now lives in Mazari Shariff where Save the Children have enrolled her in school and provide vocational training Andrew Quilty/Save the Children 3/20 Nooria* hopes for a future with no war; \"When they attacked our village, the rocket hit our neighbour's house and they all died. Our house then caught fire and we ran away. My friends who I used to play with - I still don't know if they are alive or if they are dead.” Andrew Quilty/Save the Children 4/20 “I'm hoping for a better future, to learn, to support my family and to get them out of this difficult life. And I'm hoping for a future where there is no war.” Andrew Quilty/Save the Children 5/20 Naveed*, 16 at his family home in Mazar-i Sharif Naveed lost his leg when he stepped on a mine aged just 8-years-old. He was herding the family's sheep in the mountains near their home when he triggered a landmine Andrew Quilty/Save the Children 6/20 After months of medical treatment his right leg was eventually amputated. He received physiotherapy and a prosthetic leg from the International Committee for the Red Cross in Mazar Andrew Quilty/Save the Children 7/20 Now enrolled in school, Naveed is being given vocational training by Save the Children. “For around a year I felt and dreamt that I still had my leg. But when I woke up and saw, there was no leg. Sometimes I’d feel with my hand to check and find it wasn't there.” Andrew Quilty/Save the Children 8/20 “If someone has loses their leg, it does not mean that they have lost their mind.\" Andrew Quilty/Save the Children 9/20 \"With the help of our minds we can continue to study, learn, and work to make the future of our families brighter.” Andrew Quilty/Save the Children 10/20 Naveed and Mahboob*, 55 (Naveed's father) Several years ago Neveed's father, Mahboob, was brutally beaten with rifle butts by armed groups after, he says, he failed to provide food for them while they were stationed in the family's village. He suffered brain damage which affected the right side of his body, speech and his brain function Andrew Quilty/Save the Children 11/20 Habiba*, 14, and Arezo*, 15 in a village outside Kabul Habiba and Arezo were injured with their mother three years ago in a suicide bombing in Kabul. Arezo is still traumatised from what she saw and has become completely withdrawn Andrew Quilty/Save the Children 12/20 Arezo's younger sister Habiba cares for her, takes her to lessons and anywhere she wants to go. They are both in school through Save the Children's 'Steps towards Afghan girls' education success' (STAGES) programme, which helps the most marginalised girls get access to education, stay in school and learn. Andrew Quilty/Save the Children 13/20 Habiba says: “When I woke up and I opened my eyes I saw lots of bodies and I thought I was not alive any more. It was horrible. I'll never forget that. Whenever there is a big sound she gets scared because she was traumatised by the sound she heard during the attack. I love my sister, and I help her with her lessons, I take her anywhere.\" Andrew Quilty/Save the Children 14/20 \"She's older than me but I feel like the older one because I support her. I hope for a better future for me and my sister.” Andrew Quilty/Save the Children 15/20 Khalida*, 10 in a classroom in a village outside Kabul Two years ago Khalida lost her 18-year old brother when he was killed in an explosion in Kabul. She misses him every day and says the family are still carrying the grief of his loss Andrew Quilty/Save the Children 16/20 \"Two years ago, my brother was going to Kabul when an explosion happened and he lost his life. We are still carrying the grief and are crying over him. At the time we were happy, everyone was happy. Now no-one is happy in the family. When I remember him, I cry and feel so bad. I hope for peace and that war will stop, and that nobody loses their brother” Andrew Quilty/Save the Children 17/20 “I want to get education to become a teacher. I want to teach others who have never been to school” Andrew Quilty/Save the Children 18/20 Sema*,11 at her family home in Kabul Sema recalls coming home from her aunt's house and being told that her father had been killed in a suicide attack Andrew Quilty/Save the Children 19/20 Sema still thinks about him every second and likes to look at his prayer beads (Tisbeh) to remember him. They hang from the curtain in the family home. She loves school and wants to become a teacher one day. Sema says she wants peace in her country to stop other children losing their fathers. “We still have lots of his belongings, like his car, his clothes, his watch, his shoes. Whenever we see them we cry. He gave us all so much love every moment and he is on our minds. I want for the powerful people around the world to stop the war and bring peace, because I don't want other children to lose their fathers.” Andrew Quilty/Save the Children 20/20 “I want to become a teacher to serve the country and I don't want any girls to be illiterate. I want to teach all the girls, so they have access to education.” *Names have been changed to protect identities Andrew Quilty/Save the Children\n\nBut now he feels the Doha talks laid the groundwork for a settlement: “I wouldn’t call it the most ideal agreement, but then we are not in the most ideal situation. The Americans are concerned – they think they can get troop levels down to zero – and so there is urgency to all this, and we need to take this seriously.”\n\nThere are many among the people of Bamiyan who will view the Taliban regaining authority with great trepidation. The Hazara Shias of the region were the victims of a number of massacres and mass rapes at the hands of the Pashtun Sunni Islamists during the savage civil war.\n\nBamiyan province has experienced clashes between the two ethnic groups since the fall of the Taliban. Its wondrous landscape of mountains, gorges and valleys, deep green fields and turquoise lakes – and fascinating architecture from its time as a conduit of the Silk Road – have largely escaped the strife of recent years.\n\nThere has been investment in infrastructure and education and promotion of woman’s rights. Four years after the Taliban were whipping women for not wearing the burqa, Habiba Sarabi in Bamiyan became Afghanistan’s first female governor in 2005.\n\nBut the region has become more isolated. The roads to Kabul in the southeast are now dangerous, as are the roads to Kunduz and Mazari Sharif in the north. In the autumn of last year, the Taliban fighters began targeting Hazara residents in the central provinces of Uruzgan and Ghazni. Hundreds of people were killed and thousands displaced in the fighting which followed.\n\nResidents of Bamiyan, like those in other parts of the country, have received messages from the Taliban to keep away from election rallies during the campaign and polling stations on voting days. But a group of young students waiting to hear Dr Abdullah and the fellow speakers in his coalition, Karim Khalili and Mohammed Mohaqiq, point out they have no intention of being put off by the threats. They have come to confirm they are making the right decision when they vote in Saturday’s presidential election.\n\n“It’s the first one that I have been able to vote in because of my age and I don’t want to make a mistake”, said Parwan Nazari, who is studying at Bamiyan University. “I think I’ll vote for Dr Abdullah, but I wanted to listen to him and also the others, this is a good opportunity. I will certainly be voting and so will all my friends, our families are very encouraging about this.”\n\nMs Nazari and her friend, Nisa Ghaznavi, both 19, are reading English literature and both want to be journalists. “I want to find out for myself what is going on rather than just depending on social media. I want to travel as well and see other places. I want to look at the future,” says Ms Ghaznavi. Banen Haidari is also looking to the future, but is also deeply interested in aspects of the past. She is studying geology and architecture, and one of the key reasons for her doing so is “that”, she says, pointing at the rock niches where one of the Buddhas once stood.\n\nThey are now covered in scaffolding for buttresses. “But we are hoping that work will start, and I want to be part of a team which works on rebuilding them. I have always been interested, since I was little.” All the women in the group want the statues to be rebuilt, some not just to restore heritage, but in the hope it will bring in tourists. “We need the money, and it’s always good to see foreign people,” says Ms Ghaznavi.\n\nThe women in the group are too young to have experienced Taliban atrocities firsthand, although they have heard about them from their parents. None of them, however, object to the Taliban forming part of a future government – “people are just tired of war”, Ms Nazari says. But the friends agree with Fatima Alizada, who warns caution: “We need to make sure that the Taliban don’t impose their old rules, that they respect the reforms which have been carried out.”\n\nMs Alizada, 19, who is doing a course in Islamic studies and wants to be a defence lawyer, does not think the emancipation of women has gone far enough in Afghanistan. “Why haven’t we got one single woman running for the presidency?” she wants to know.\n\nSitting in the shade of a wall, Haji Abdullah can think of no good memories of the Taliban. “All I can recall are tortures and beatings, people being jailed, men forced not to cut their beards, so no, that was a bad time,” he says.\n\n“I remember when they blew up the Buddha. They had these big guns, they were firing from a long way away. I could see the statues getting hit, 18, 19 times, they just kept on firing at them. What they did was very bad.”\n\nHaji Abdullah is ambivalent about the Taliban returning. “We want peace, yes, but they must accept the laws and not interfere with our lives.” The 36-year-old shopkeeper is doing alright, and not hard-up financially, despite having six children. He would vote for Dr Abdullah but also wants to say Ashraf Ghani is “a good man.”\n\nAhmed Ali Wahdat, the owner of a carpentry business, is more forthright. “You cannot trust the Taliban. We know what they did last time, all the killings that took place, homes burnt.\n\n“They wanted to destroy. They used cannons and dynamite on the Buddhas, but even then it took them weeks – you know, those statues were so strong. And now they can be rebuilt again, so they won’t stay destroyed. It’s the way us Hazaras have had to be strong to survive, the way Afghanistan has had to survive. Why give all that up, bringing back the people who did this?”\n\nRead the first part of the Conflict Without End series here: Afghanistan election marred by bloodshed and corruption; and the second part here: Afghanistan families torn apart by deadly carnage: ‘My grandson will have to see more dead bodies when he grows up’; and the third part here: Raid on al-Qaeda bomb factory leaves dozens of wedding-goers dead, in latest Afghan violence​", "description": "One of the last rallies of the election campaign takes place under the shadow of the most internationally familiar symbol of religious intolerance in Afghanistan – the cliffs of Bamiyan where the magnificent statues of Buddha had stood from the sixth century before being blown up by the Taliban.", "authors": ["Kim Sengupta"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/26/17/Bamiyan.jpg", "published_at": "2019-09-26"}