{"pub": "usatoday", "url": "https://usatoday.com/story/opinion/2019/10/25/elijah-cummings-inspirational-legacy-passion-purpose-vision-column/4082900002", "downloaded_at": "2019-10-25 16:10:48.549696+00:00", "title": "How we will remember our boss, Chairman Elijah Cummings: Moral clarity in all he did", "language": "en", "text": "CLOSE Rep. Elijah Cummings died at 68 after complications from \"longstanding health issues,\" his office confirmed. USA TODAY\n\nHe listened to us, respected us, trusted us and was truly proud of us. He had so much left to accomplish, but he has left it for us to complete.\n\nAs current and former congressional staff of the late Rep. Elijah E. Cummings, chairman of the House Oversight and Reform Committee, we had the great honor and privilege of working with him over the course of more than two decades.\n\nMany public figures have praised the chairman in recent days, extolling his unmatched integrity, courageous leadership and commitment to service and justice. To these well-deserved tributes, we would like to add our own eulogy, based on our experience working by his side.\n\nHe was inspiring, both in public and even more so in private. He brought moral clarity to everything he did, and his purpose was pure — to help those among us who needed it most. He taught us that our aim should be to “give a voice to the voiceless,” including families whose drinking water had been poisoned, sick patients who could no longer afford their medicine and, most of all, vulnerable children and “generations yet unborn.”\n\n'What feeds your soul?'\n\nWhether in a hearing room full of members of Congress or in a quiet conversation with staff, his example motivated us to become our best selves in the service of others.\n\nHe was genuine. He insisted on personally interviewing every staff member he hired so he could “look into their eyes.” Each of us has a personal memory of sitting down with him for the first time, and it was like nothing we had experienced before. He would ask why we were interested in public service, how we thought we could contribute and what motivated us.\n\nRep. Elijah Cummings, D-Md. (Photo: Andrew Caballero-Reynolds/AFP via Getty Images)\n\nThen he would lean in and ask in his low baritone voice, “But … what feeds your soul?”\n\nMore than a few of us left those interviews with tears in our eyes, perhaps feeling that we had learned more about ourselves than about him. He made that kind of personal connection with everyone he met, from the people of his district, to witnesses who testified at hearings, to whistleblowers who reported waste, fraud or abuse. Since his passing, we have been inundated with messages from many whose lives he touched.\n\nBe efficient and seek 'higher ground'\n\nHe was demanding. He would boast that he had the hardest working staff in Congress and that he sometimes would call or email us in the middle of the night, which was absolutely true. His directive to be “effective and efficient in everything you do” still rings in our ears.\n\nDear President Donald Trump: Let me tell you about my ex-boss Elijah Cummings\n\nIn exchange, he listened to us, respected us and trusted us. He made sure we knew he was truly proud of us — memories we each now cherish. The result of his unwavering support was fierce loyalty from every member of his staff. We committed to doing everything in our power to fulfill his vision.\n\nHe was a unifying force, even in this era of partisanship. He would command order with a sharp rap of his gavel, elevate debate by noting that “we are better than that” and urge all of us to seek “not just common ground, but higher ground.”\n\nGuided by his faith and values, he would look for and bring out the good in others, forming bridges through human connection.\n\nWe are here 'only for a minute'\n\nHe fully grasped the moment in which we are now living. He invoked history books that will be written hundreds of years from now as he called on us to “fight for the soul of our democracy.” As he said, this is bigger than one man, one president or even one generation.\n\nHe was acutely aware of his own transience in this world. He reminded us repeatedly that we are here “only for a minute” and that all of us soon will be “dancing with the angels.”\n\nBridging the gap: All college students should take a mandatory course on black history and white privilege\n\nHe would thunder against injustice, or on behalf of those who could not fight for themselves, and he would vow to keep battling until his “dying breath.” He did just that. His final act as chairman came from his hospital bed just hours before his death, as he continued to fight for critically ill children suddenly in danger of deportation.\n\nHe had so much left to accomplish, but he has left it for us to complete. As he told us presciently, “These things don’t happen to us, they happen for us.”\n\nGrateful he was part of our destiny\n\nIt is difficult to describe the emptiness we now feel. His spirit was so strong, and his energy so boundless, that the void is devastating.\n\nBut, of course, he left us with instructions: “Pain, passion, purpose. Take your pain, turn it into your passion, and make it your purpose.” He lived those words, and he inspired us to do the same.\n\nSometimes, after a big event, he would take us aside for a quiet moment and say, “I just want to thank you for everything you do and for being a part of my destiny.”\n\nToday, we thank him for being part of ours. And we commit to carrying forward his legacy in the limited time allotted to each of us — to give voice to the voiceless, to defend our democracy, and to always reach for higher ground.\n\nThe authors of this tribute are current and former staff of the late House Oversight Committee Chairman Elijah Cummings, D-Md., whose funeral is Friday. Their names are below:\n\nAaron D. Blacksberg, Abbie Kamin, Ajshay Charlene Barber, Alex Petros, Alexander M. Wolf, Alexandra S. Golden, Aliyah Nuri Horton, CAE, Amish A. Shah, Amy Stratton, Andy Eichar, Angela Gentile, Esq., Anthony McCarthy, Anthony N. Bush, Aryele N. Bradford, Ashley Abraham, Ashley Etienne, Asi Ofosu, Asua Ofosu, Ben Friedman, Bernadette \"Bunny\" Williams, Beverly Ann Fields, Esq., Beverly Britton Fraser, Brandon Jacobs, Brett Cozzolino, Brian B. Quinn, Britteny N. Jenkins, Candyce Phoenix, Carissa J. Smith, Carla Hultberg, Carlos Felipe Uriarte, Cassie Fields, Cecelia Marie Thomas, Chanan Lewis, Chioma I. Chukwu, Chloe M. Brown, Christina J. Johnson, Christopher Knauer, Dr. Christy Gamble Hines, Claire E. Coleman, Claire Leavitt, Courtney Cochran, Courtney French, Courtney N. Miller, Crystal T. Washington, Daniel Rebnord, Daniel Roberts, Daniel C. Vergamini, Darlene R. Taylor, Dave Rapallo, Davida Walsh Farrar, Deborah S. Perry, Deidra N. Bishop, Delarious Stewart, Devika Koppikar, Devon K. Hill, Donald K. Sherman, Eddie Walker, Elisa A. LaNier, Ellen Zeng, Emma Dulaney, Erica Miles, Fabion Seaton, Ferras Vinh, Fran Allen, Francesca McCrary, Frank Amtmann, Georgia Jenkins, Dr. Georgia Jennings-Dorsey, Gerietta Clay, Gina H. Kim, Greta Gao, Harry T. Spikes II, Hope M. Williams, Ian Kapuza, Ilga Semeiks, Jamitress Bowden, Janet Kim, Jaron Bourke, Jason R. Powell, Jawauna Greene, Jean Waskow, Jedd Bellman, Jenn Hoffman, Jennifer Gaspar, Jenny Rosenberg, Jess Unger, Jesse K. Reisman, Jessica Heller, Jewel James Simmons, Jill L. Crissman, Jimmy Fremgen, Jolanda Williams, Jon Alexander, Jordan H. Blumenthal, Jorge D. Hutton, Joshua L. Miller, Joshua Zucker, Julia Krieger, Julie Saxenmeyer, Justin S. Kim, K. Alex Kiles, Kadeem Cooper, Kamau M. Marshall, Kapil Longani, Karen Kudelko, Karen White, Kathy Crosby, Katie Malone, Katie Teleky, Kayvan Farchadi, Kellie Larkin, Kelly Christl, Kenneth Crawford, Kenneth D. Crawford, Kenyatta T. Collins, Kevin Corbin, Jr., Kierstin Stradford, Kimberly Ross, Krista Boyd, Kymberly Truman Graves, Larry and Diana Gibson, Laura K. Waters, Leah Nicole Copeland Perry, LL.M.,Esq., Lena C. Chang, Lenora Briscoe-Carter, Lisa E. Cody, Lucinda Lessley, Madhur Bansal, Marc Broady, Marianna Patterson, Mark Stephenson, Martin Sanders, Meghan Delaney Berroya, Michael F Castagnola, Michael Gordon, Michell Morton, Dr. Michelle Edwards, Miles P. Lichtman, Mutale Matambo, Olivia Foster, Patricia A. Roy, Paul A. Brathwaite, Paul Kincaid, Peter J. Kenny, Philisha Kimberly Lane, Portia R. Bamiduro, Rachel L. Indek, Rebecca Maddox-Hyde, Regina Clay, Ricardo Brandon Rios, Rich Marquez, Richard L. Trumka Jr., Robin Butler, Rory Sheehan, Roxanne (Smith) Blackwell, Russell M. Anello, Safiya Jafari Simmons, Sanay B. Panchal, Scott P. Lindsay, Sean Perryman, Senam Okpattah, Sonsyrea Tate-Montgomery, Susanne Sachsman Grooms, Suzanne Owen, Tamara Alexander Lynch, Theresa Chalhoub, Timothy D. Lynch, Todd Phillips, Tony Haywood, Tori Anderson, Trinity M.E. Goss, Trudy E. Perkins, Una Lee, Valerie Shen, Vernon Simms, Wendy Ginsberg, William A. Cunningham, William H. Cole, Wm. T. Miles, Jr., Yvette Badu-Nimako, Yvette P. Cravins, Esq., Zeita Merchant\n\nYou can read diverse opinions from our Board of Contributors and other writers on the Opinion front page, on Twitter @usatodayopinion and in our daily Opinion newsletter. To respond to a column, submit a comment to letters@usatoday.com.\n\nRead or Share this story: https://www.usatoday.com/story/opinion/2019/10/25/elijah-cummings-inspirational-legacy-passion-purpose-vision-column/4082900002/", "description": "He listened to us, respected us, trusted us and was truly proud of us. He had so much left to accomplish, but he has left it for us to complete.", "authors": ["Current", "Former Staff Of Rep. Elijah Cummings", "Opinion Contributors", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/24/USAT/579f121d-158b-4e40-9408-18d7e90bafb6-Cummings_2.jpg?crop=4895,2753,x0,y59&width=3200&height=1680&fit=bounds", "published_at": "2019-10-25"}