{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-england-essex-50108052", "downloaded_at": "2019-10-20 16:56:51.259219+00:00", "title": "Mum writes diversity book as 'gift' to daughter Philly", "language": "en", "text": "Image copyright Vese Aghoghovbia Wolu Image caption Vese Aghoghovbia Wolu said she did not want her daughter to have the experience she had with books\n\nA mum has depicted her toddler daughter in a picture book about identity, love and acceptance after struggling to find black children in books as a child.\n\nVese Aghoghovbia Wolu wrote Who Do I See in The Mirror? as a gift to Philly while on maternity leave.\n\nThe chartered engineer, of Buckhurst Hill in Essex, said the response to its publication had been \"amazing.\"\n\n\"People from all backgrounds, not just the black community, have said that diversity is so important,\" she said.\n\nImage copyright Philly and Friends Image caption Philly was a baby when her mother had the idea for the book\n\nThe 31-year-old said she read voraciously as a child in Nigeria but could not recall any books with children that looked like her.\n\n\"I didn't want my daughter to have that experience,\" she explained.\n\n\"I wanted her to see herself in books as she deserved to be appreciated for who she is.\"\n\nHer experience is backed up by research - in 2018, figures from the Centre for Literacy in Primary Education (CLPE) showed that of the 9,115 children's books published over the previous 12 months, 4% featured black and minority ethnic (BAME) characters.\n\nIn an interview with the BBC in April, black children's writer Sharna Jackson said: \"All children need to see themselves and others reflected in culture - representation leads to empathy.\n\n\"That visibility is extremely important.\"\n\nImage copyright Philly and Friends Image caption The book shows Philly with children from different backgrounds in illustrations by Irene Omiunu\n\nHaving never written a book, Ms Aghoghovbia Wolu said she awoke with the entire story in her head of a girl looking in the mirror and realising she is unique, from her curly hair to her strong legs.\n\nPhilly says she is \"much more\" than her physical appearance, and most of all she has a \"good heart and curious mind\".\n\n\"When I put the book on Instagram, people said 'this is amazing, this is so needed for children',\" added Ms Aghoghovbia Wolu.\n\n\"Some of them had had the same experience as me - they wanted to see diversity in books while trying to teach children love and acceptance.\n\n\"It's about being a good person and that's a message for anyone.\"", "description": "Vese Aghoghovbia Wolu struggled to find black children in books when she was young.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/E614/production/_109300985_5baa729b-18d2-4547-9df6-3f2008e61bdc.jpg", "published_at": "2019-10-20"}