{"pub": "blastingnews", "url": "https://us.blastingnews.com/gaming/2019/10/tfue-responds-amid-ninja-fortnite-feud-hes-always-hated-me-002995609.html", "downloaded_at": "2019-10-11 00:54:39.480474+00:00", "title": "Tfue responds amid Ninja 'Fortnite' feud: 'he's always hated me'", "language": "en", "text": "\"Fortnite Battle Royale\" has established itself as one of the biggest games in video gaming history throughout it's brief existence. The video game was released in September 2017, and it has broken numerous records since then, including the record for most concurrent players with 10.8 million. As the game was getting more popular, many players who were streaming it gained fame and popularity as well, and some of them have gained millions of followers thanks to it.\n\nTyler \"Ninja\" Blevins has been the most popular \"Fortnite Battle Royale\" streamer for over a year. His amazing skills and family-friendly streams have turned him into one of the most popular figures in the gaming world. Turner \"Tfue\" Tenney is also very popular and is considered one of the best video game players. The two of them recently got into a Twitter beef and Tfue claims that Ninja has never really liked him.\n\nThe Twitter beef\n\nA few days ago, Tfue expressed his disappointment with \"Fortnite Battle Royale\" on his Twitter profile, saying that the game \"sucks.\" Just 10 minutes after he posted the tweet, he got a response from Ninja, who had a different point of view. \"I actually have been enjoying the game recently after the Gotham City update. If you don’t enjoy the game, stop playing and roasting it all the time,\" Ninja tweeted.\n\nDon’t miss the latest news! Click on the topic you interest most. We'll keep you updated with all the news you shouldn't miss. Fortnite\n\nNinja referred to Tfue's history of complaining about \"Fortnite Battle Royale.\" Tenney is well known for his complaints about the game and it seems that he genuinely doesn't enjoy it anymore, yet he keeps playing it. The majority of Tfue's followers enjoy the video game and it is not a secret that he wasn't that popular before it. On the day when the game came out, Tfue only had around 78,000 followers on his Twitch channel.\n\nRight now, he has over 7 million followers and is one of the biggest streamers in the world.\n\nIt is very unlikely that he will stop streaming the game anytime soon, as his followers wouldn't like it. However, he will have to change his attitude if he wants to enjoy it. Ninja recently broke the world record for most Duo wins in a row with 51, and unlike his rival, he is definitely enjoying the game and having a lot of fun with it.\n\nTfue 'doesn't care' about Ninja\n\nTfue and Ninja had known each other long before \"Fortnite Battle Royale\" was released, yet both of them gained success in the game. Tfue claims Ninja has never really liked him, but he doesn't really care about it. “Ninja has hated me forever. No matter how nice I am to the kid, he’s always hated me,” Tfue recently stated on his live stream. “So, I don’t really know what to tell you guys, but I don’t really care.”", "description": "There seems to be a lot of bad blood between the two popular 'Fortnite Battle Royale' streamers.", "authors": ["E. Cross", "Asmir Pekmic", "Jane Flowers", "Read More On The Same Topic Asmir Pekmic", "Things We Don'T Want To See In 'Fortnite' Season", "'Fortnite'", "Fortnitemares Skins Have Been Leaked", "The Bouncer Trick Lets 'Fortnite' Players Jump Into Enemy Boxes"], "top_image": "https://staticr1.blastingcdn.com/media/photogallery/2019/10/8/os/b_1200x630/ninja-and-tfue-are-fighting-once-again-image-credit-own-work-edited-from-tfues-and-ninjas-streams_2335697.jpg", "published_at": "2019-10-08"}