{"pub": "news24", "url": "https://health24.com/Medical/infectious-diseases/Ebola/ebola-survivors-can-pass-on-the-virus-were-trying-to-understand-what-role-sex-plays-20190927", "downloaded_at": "2019-10-05 10:52:39.712014+00:00", "title": "Ebola survivors can pass on the virus: we're trying to understand what role sex plays", "language": "en", "text": "Ebola survivors can pass on the virus: we're trying to understand what role sex plays Trying to understanding the role sex plays in 'otherwise healthy survivors' has now been added to scientists, researchers and doctors load as they continue to battle the second largest Ebola disease outbreak in history.\n\nResearchers need to understand the role sex plays in transmitting the Ebola virus. ~\n\nThe current Ebola disease outbreak in the Democratic Republic of the Congo (DRC) is the second largest in history.\n\nIt has been raging for over a year with no indication that it is nearing an end. Many of the issues that prevent effective containment of Ebola disease outbreaks have been discussed.\n\nThese include porous borders, community mistrust of health workers, and the spread of misinformation.\n\nRead more: Why it's hard to stop Ebola spreading – between people and across borders\n\nBut one area that requires further study is Ebola virus’ persistence in the reproductive systems of otherwise healthy survivors.\n\nUnderstanding how Ebola disease outbreaks are exacerbated by sexual transmission is important to stop new chains of transmission and to prevent the disease from spreading to new geographic regions.\n\nMultiple reports strongly suggest that re-emergence of Ebola disease is linked to persistent infections and sexual transmission from survivors.\n\nWhat this means is that people who have survived infection by Ebola virus – and who no longer show any symptoms of the disease – can continue to carry the virus and pass on the infection months after they have recovered.\n\nOur research group recently reviewed the current understanding of rates and mechanisms of Ebola virus persistence in male disease survivors.\n\nWe are using this information to fill in gaps about how persistence relates to sexual transmission of the virus.\n\nIn addition, we are combining molecular investigations with insights from survivors to better equip future outbreak response efforts.\n\nWe also hope the work will help address long-term health issues faced by Ebola disease survivors.\n\nThe role of the reproductive system\n\nNearly everything known about Ebola virus persistence in the reproductive system has resulted from testing semen of West African Ebola disease survivors.\n\nIt has been established that the Ebola virus can be detected in semen long after it is cleared from other organs and tissues. For example, a recent study showed that the virus could be detected in 50% of male survivors 115 days after recovery and may linger for up to three years.\n\nThe virus has also been detected in semen at concentrations greatly exceeding that found in the blood at peak infection. The data suggests that this occurs in the absence of any symptoms of disease.\n\nIn addition, sexual transmission of Ebola virus from male survivors has been reported up to 18 months following their recovery.\n\nThese observations are important to public health. Firstly, long-term persistence of Ebola virus could lead to the initiation of new chains of disease transmission long after outbreaks have ended.\n\nSecondly, the presence of high concentrations of virus in the semen in the absence of disease symptoms means that male survivors could carry and transmit the virus without knowing they’re still infected.\n\nBut the fact that only semen is being used in these studies presents a problem. This means that the perseverance of the virus is only being traced in males. This means that little is known about persistence of the virus in women.\n\nThis urgently needs attention because Ebola virus has been detected in female survivors up to 15 months following recovery, and there are recorded cases of female to male transmission.\n\nUnanswered questions\n\nThere is a strong need for greater understanding of Ebola virus infections, including:\n\nWhen Ebola virus is transmitted to reproductive tissues during illness.\n\nHow Ebola virus persists over extended periods in reproductive tissues.\n\nHow long persistent virus remains infectious.\n\nHow often sexual transmission occurs.\n\nIn a bid to answer some of these questions – particularly the molecular intricacies of Ebola virus persistence within the reproductive system – we used laboratory models of male and female reproductive systems. This allowed us to:\n\nStudy the dynamics of Ebola virus transmission to the reproductive system.\n\nIdentify the particular types of cells that are infected by Ebola virus in the reproductive system.\n\nDetermine how local immune responses in the infected cells help facilitate Ebola virus persistence.\n\nCharacterise damage to the reproductive system, including altered sperm health.\n\nWe have also performed Ebola virus infections in mice to better understand how our molecular data reflects the complex pathophysiology of Ebola virus disease and persistence in humans. Mouse models have been used in numerous investigations of Ebola virus infection.\n\nBy infecting mice with Ebola virus, we can determine whether the male reproductive system is damaged by persistent infection. We can also determine if there is an effect on fertility, and how often persistent infections result in sexual transmission.\n\nIn addition, infections of female mice help us determine the severity of disease caused by sexually transmitted Ebola virus, the effects on female fertility, and consequences for gestational development.\n\nIn addition to our laboratory research, we are surveying Ebola disease survivors in Sierra Leone in an effort to identify and understand the long-term health consequences, with a focus on reproductive health.\n\nOur goal is to determine if survivors have encountered post-recovery reproductive complications such as reduced fertility or problems during pregnancy.\n\nWe are also investigating whether Ebola disease survivors face greater burdens of subsequent infections by other pathogens.\n\nFuture outbreaks\n\nThe recent success of vaccination and therapeutic treatments in the current DRC Ebola disease outbreak provides hope. But a great deal about the virus remains unknown.\n\nA greater understanding of the mechanisms of how persistent infections occur will help us guide future outbreak response efforts, with the goal of reducing additional Ebola virus transmission events and providing increased care, support and safety for survivors and their communities.\n\nAndrew L. Webb, PhD Candidate, University of Manitoba; Brayden G. Schindell, PhD Candidate, University of Manitoba; Jason Kindrachuk, Assistant Professor/Canada Research Chair in emerging viruses, University of Manitoba, and Jia B. Kangbai, PhD candidate, Ludwig Maximilian University of Munich\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article.\n\nImage credit: iStock", "description": "Trying to understanding the role sex plays in 'otherwise healthy survivors' has now been added to scientists, researchers and doctors load as they continue to battle the second largest Ebola disease outbreak in history.", "authors": ["Andrew L. Webb", "Brayden G. Schindell", "Jason Kindrachuk", "Jia B. Kangbai"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8922/e860b38f39424f6b9886334ce596228c.jpg", "published_at": "2019-09-27"}