{"pub": "npr", "url": "https://npr.org/2019/09/16/761118726/oil-prices-jump-following-drone-attack-on-saudi-oil-facility", "downloaded_at": "2019-09-16 09:15:07.143539+00:00", "title": "Oil Prices Jump Following Drone Attack On Saudi Oil Facility", "language": "en", "text": "Oil Prices Jump Following Drone Attack On Saudi Oil Facility\n\nEnlarge this image toggle caption AP AP\n\nThe price of oil saw a massive price spike Monday following drone strikes on a Saudi oil facility over the weekend that has shut off more than half of the kingdom's daily exports, or about 5% of the world's crude production.\n\nBenchmark Brent crude briefly surged almost 20% in early trading before settling to 10% higher, up $6 to $66.28, according to The Associated Press. The U.S. benchmark West Texas crude was up 9%.\n\nThe increase, which follows drone attacks on Saudi Arabia's Abqaiq oil processing plant and Khurais oil field, marks the single-largest daily surge in crude prices in years.\n\nExperts say it could take weeks before the kingdom is able to restore full production at the facilities, according to The Telegraph.\n\nYemen's Iranian-backed Houthi rebels have claimed responsibility for the attacks. Although Saudi officials have been cautious about laying blame, Secretary of State Mike Pompeo has directly accused Tehran of playing a key role in the strikes.\n\n\"Amid all the calls for de-escalation, Iran has now launched an unprecedented attack on the world's energy supply. There is no evidence the attacks came from Yemen,\" Pompeo tweeted Saturday.\n\nTehran is behind nearly 100 attacks on Saudi Arabia while Rouhani and Zarif pretend to engage in diplomacy. Amid all the calls for de-escalation, Iran has now launched an unprecedented attack on the world’s energy supply. There is no evidence the attacks came from Yemen. — Secretary Pompeo (@SecPompeo) September 14, 2019\n\nIran's Foreign Ministry spokesman Abbas Mousavi dismissed Washington's accusations, calling them \"blind and futile.\"\n\n\"The Americans adopted the 'maximum pressure' policy against Iran, which, due to its failure, is leaning toward 'maximum lies,'\" Mousavi said.\n\nPresident Trump on Sunday tweeted that he had authorized the release of oil from the U.S. Strategic Petroleum Reserve if necessary \"in a to-be-determined amount ... sufficient to keep the markets well-supplied.\"\n\nThe president also tweeted that \"we know the culprit\" and said the U.S. was \"locked and loaded depending on verification.\"\n\nSaudi Arabia oil supply was attacked. There is reason to believe that we know the culprit, are locked and loaded depending on verification, but are waiting to hear from the Kingdom as to who they believe was the cause of this attack, and under what terms we would proceed! — Donald J. Trump (@realDonaldTrump) September 15, 2019\n\nTrump has used similar language about North Korea in the past and toward Tehran in June after a U.S. drone was shot down over what Washington says were international waters.\n\nTrump's latest tweets followed a National Security Council meeting at the White House that included Pompeo, Vice President Mike Pence and Defense Secretary Mark Esper, the AP reported.\n\nAccording to figures from the Paris-based International Energy Agency, the loss of the 5.7 million barrels of crude production from the Saudi facility represents the largest such disruption on record.\n\nRiyadh says its stockpiles will keep world markets supplied until it can repair the damage at Abqaiq and Khurais.", "description": "The price surge comes after weekend strikes on the kingdom's Abqaiq oil processing plant and Khurais oil field. Yemen's Houthi rebels claimed responsibility, but the U.S. says Iran played a key role.", "authors": ["Scott Neuman"], "top_image": "https://media.npr.org/assets/img/2019/09/16/ap_19258692884235_wide-d1423e1cba33fa92dae7e18a2b187fdc92548744.jpg?s=1400", "published_at": "2019-09-16"}