{"pub": "theverge", "url": "https://theverge.com/circuitbreaker/2019/7/3/20680982/canon-ivy-rec-camera-indiegogo", "downloaded_at": "2019-10-05 14:21:09.864840+00:00", "title": "Canon is crowdfunding a tiny clippable camera that connects to your phone", "language": "en", "text": "Canon is turning to Indiegogo to crowdfund the Ivy Rec, a tiny outdoor camera built into a keychain carabiner. It’s about the size of a USB flash drive, and it wirelessly connects via Wi-Fi or Bluetooth to the companion CanonMini Cam App to show a live preview on your phone. The empty square space of the clip doubles as a viewfinder, and there’s a single dial on the back that lets you switch between modes.\n\nThe Ivy Rec has a 13-megapixel 1/3-inch CMOS sensor that can record 1080p / 60 fps video, and it’s waterproof up to 30 minutes for depths of up to three feet. At its retail price of $130, it’s slightly more expensive than hoped, but could still be a good option for parents looking to get their kids a starter camera. Canon says the camera is shockproof and great for the outdoors, so it could be useful if you clip it onto your backpack while you ride a bike. Or maybe clip it onto your dog or cat’s collar so you can see the world from your pet’s POV? (I mean, GoPros are already a thing.)\n\nDPReview cites a previous interview to speculate why Canon is going the crowdfunding route for its latest camera, in which the company revealed that it’s looking to capture as many new customers as it can, particularly casual photographers.\n\nThe Canon Ivy Rec is available for pre-order now at $120, and it’s expected to ship October 2019.\n\nUpdate July 11th, 5:01PM ET: Updated to reflect pre-order availability and pricing information.", "description": "Canon is turning to Indiegogo to crowdfund the Ivy Rec, a tiny outdoor camera that’s waterproof and clippable. A companion CanonMini Cam App can be used to get a live preview on your phone.", "authors": ["Dami Lee", "Jul"], "top_image": "https://cdn.vox-cdn.com/thumbor/x0ktlDpR1Kv_iI3DyRSuW7cYz0o=/0x45:800x464/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18278932/iajhb3gy1ovu64pgfxvo.jpg", "published_at": "2019-07-03"}