{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/trump-impeachment-inquiry-senate-republicans-no-win-situation", "downloaded_at": "2019-10-09 10:44:59.659259+00:00", "title": "Trump Impeachment Inquiry: Senate Republicans in a No-Win Situation", "language": "en", "text": "Sen. Lindsey Graham (R-SC) on Capitol Hill, March 25, 2019. (Joshua Roberts/Reuters)\n\nThe political hell most Senate Republicans have found themselves in since 2016 can be described as the chasm between how Trump wants them to behave and how they believe they should govern.\n\nIn response to news reports over the weekend that at least one additional administration whistleblower has come forward to say what he or she knows about President Trump’s Ukrainian schemes, South Carolina senator Lindsey Graham tweeted, “I’ve seen this movie before — with Brett Kavanaugh. More and more doesn’t mean better or reliable.”\n\nAdvertisement\n\nAdvertisement\n\nGraham’s raw political spinning has a fatal flaw.\n\nGraham wants to tar the whistleblowers as part of a partisan campaign. But their motivation is largely irrelevant now because the bulk of the allegations have already been corroborated by the rough phone call transcript released by the White House and by the statements of the president and his aides. So while it’s still possible that the whistleblowers are part of some elaborate Democratic or “deep state” plot to take down the president, the plotters are using truthful information to do the deed. Graham surely knows this but is opting to pretend that there’s no there there.\n\nThe most charitable view of Graham’s sycophancy is that the president has put him and GOP senators in general in a no-win predicament.\n\nAdvertisement\n\nThe political hell most Senate Republicans have found themselves in since 2016 can be described as the chasm between how Trump wants them to behave and how they believe they should govern. Virtually none of these senators can get reelected without the third of Republicans who adore Trump, but the vulnerable ones need more than just the Trumpers to get across the finish line. This means they have to attract less single-minded voters who are often more Trump-skeptical — mostly suburban, college-educated Republicans and Republican-leaning independents. But because the president and his most ardent fans will not brook any criticism of the president, the senators have been left trying to thread a very narrow needle: Differentiate yourself from Donald Trump while not actually criticizing Donald Trump.\n\nAdvertisement\n\nThe impeachment drama is shrinking the needle’s eye even more, and from both sides.\n\nOn one side is the president. For instance, going by published reporting, my own conversations with senators and Senate staffers, as well as straightforward common sense (as opposed to the fantasy reasoning one finds in some corners of cable news and Twitter), I can tell you with a high degree of confidence that virtually no GOP senator agrees with the president that his July 25 phone conversation with Ukrainian president Volodymyr Zelenskiy was, as Trump likes to say, “perfect.” Beyond that, opinions differ, but it’s a safe bet that most Senate Republicans think the conversation could have gone better and would dearly love for the president to say so.\n\nAdvertisement\n\nPast presidents in the crosshairs of scandal have resorted to apologizing. Ronald Reagan admitted that “mistakes were made” after he stumbled on the facts during the Iran-Contra scandal. Bill Clinton initially denied everything, then told the nation, “I have sinned,” and asked for forgiveness for the conduct that led to his impeachment.\n\nAdvertisement\n\nTrump is determined to go another way and to punish those who disagree, as he has already tried to do with Utah senator Mitt Romney. That’s why Graham, Iowa senator Joni Ernst, and Florida senator Marco Rubio find it necessary to hide behind various parsing rationalizations. Rubio’s response to Trump’s calling on the Chinese to investigate Joe Biden is now the official safe harbor for Republicans: He didn’t really mean it; he’s just trolling the press. Ernst says, in effect, that criticizing the president won’t change his behavior, so why bother?\n\nAdvertisement\n\nMeanwhile, the Democrats have bungled the impeachment issue. House Intelligence Committee chairman Adam Schiff, in particular, has never missed an opportunity to burn any credibility he might have as a sober and honest investigator. Democratic partisans may like his red-meat rhetoric, but they lose sight of the fact that trolling Trump just makes the president’s job easier. Schiff’s entirely fictional account of Trump’s conversation with the Ukrainian president, read into the congressional record, may have infuriated the president, but it also gave Trump a talking point and an excuse for Republicans to hide behind the unfairness of the process.\n\nIf impeachment is going to be anything other than a partisan protest immediately swatted down by the GOP-controlled Senate, Democrats need to carefully and methodically make their case through serious fact-finding — an investigation that not only persuades at least 20 Republican senators but also a sufficient number of the voters those senators need to stay in office.\n\nAdvertisement\n\nShort of that, the safer path will be for Republicans to continue to pretend everything is “perfect.”\n\n© 2019 Tribune Content Agency LLC", "description": "The political hell most Senate Republicans have found themselves in since 2016 can be described as the chasm between how Trump wants them to behave and how they believe they should govern.", "authors": ["Jonah Goldberg", "Kevin D. Williamson", "Andrew C. Mccarthy", "Rich Lowry", "John Fund", "John Mccormack", "George Will", "Jim Geraghty", "The Editors", "Read More"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/lindsey-graham.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-09"}