{"pub": "independent", "url": "https://independent.co.uk/voices/top-10-unlikely-things-named-after-battles-a9150726.html", "downloaded_at": "2019-10-18 11:05:34.586043+00:00", "title": "The Top 10: Unlikely Things Named After Battles", "language": "en", "text": "This started with a quiz question about Crimean-war-related headgear (balaclava), and escalated from there, thanks to Dmitri Seymour. I ruled out stations, roads and bridges (Austerlitz, Trafalgar, Waterloo and so on), although I was tempted to make an exception for Quatre Bras, a small road in Hexham, nominated by Emmabella Murray, which is named after a battle of 16 June 1815 – a prelude to Waterloo, which took place two days later.\n\n1. Battle Abbey, and the town, Battle, East Sussex, on the presumed site of the battle of Hastings. Thanks to Henry Peacock, James Johns and John Peters.\n\n2. Alamo. Battle fought in and around a Roman Catholic mission of that name during the Texan Revolution, 1836. Alamo Rent A Car was founded in Florida in 1974. From Robert Boston. There’s nothing in the company’s history page on its website about why the name was chosen.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n3. Blenheim Orange. A variety of apple named after Blenheim in Oxfordshire, which took its name from Marlborough’s victory at the battle of Blenheim, 1704. Nominated by Thomas Penny.\n\n4. Bomarsund, former mining village, Northumberland. The pit was sunk in 1854 and named after the Franco-British capture of a Russian fortress off the coast of Finland in the Crimean War. Thanks to Dan Jackson.\n\n5. Batter of Bosworth, fish and chip shop in Market Bosworth, near the site of the War of the Roses battle of 1485. Nominated by Chris Skidmore, the universities minister.\n\n6. Marathon. “Battle in 490 BC gave its name to the foot-race over 26.2 miles. Many years later it became the name of a popular chocolate bar, which in 1990 was changed to Snickers,” said Robert Boston. Also nominated by Graham Kirby and Michael Barber.\n\n7. The Kop end at Liverpool FC, after the battle of Spion Kop in the Boer War, in which the Lancashire Fusiliers fought. Best known of several football terraces known as the Kop. From Mark Ramsbottom, Steven Richards, Francis Jones and Michael Crick.\n\n8. Magenta. An aniline dye patented in 1859 by François-Emmanuel Verguin, a French chemist, who originally called it fuchsine. It was renamed to celebrate the Italian-French victory at the battle fought between the French and Austrians on 4 June, near the Italian town of Magenta in Lombardy. Thanks to Henry Peacock, William Barnes, Matthew Davis and Nick Reid.\n\n9. Maida Vale in north London is named after the battle of Maida (pronounced my-eeda), or rather after a local pub named after a little-known victory by the British under Sir John Stuart over the French in Italy in 1806. Nominated by Allan Holloway.\n\n10. Chicken Marengo. Victory for Napoleon over the Austrians at Marengo in Italy, 1800. One of Napoleon’s horses was also called Marengo – another was called Austerlitz. Thanks to Richard Bratby and many others.\n\nHonourable mention for Henry Peacock, who was first to nominate the remarkable category of names given to people in honour of battles, mostly in the First World War, in which a relative died. These were mostly girls’ names, such as Sommeria, Arrasina, Verdunia, Monsalene and Dardanella, although Verdun was a surprisingly common boy’s name. Passchendaele, Cambrai, Ypres and Jutland also featured, more usually as middle names. More than 1,600 children were given names related to the Great War.\n\nWe could have had Plassey: Simon Levack said Robert Clive wanted his Irish peerage to be “Baron Clive of Plassey”, to commemorate his victory at the battle of Plassey in India, so he bought an estate in Ireland and renamed it. But it’s not there any more.\n\nI ruled out mayonnaise, allegedly named after the Duc de Richelieu’s victory over the British at Port Mahon, Minorca, 1756, for which there is sadly no evidence.\n\nThere is always one, and this week it is Lee Donaghy, who nominated Britain. Sometimes there are two, and the second was Steve Anderson, who nominated Wagamama – named after the battle of Coleen Rooney and Rebekah Vardy.\n\nNext week: “You Haven’t Thought That Throughs”, after Flick Drummond the Tory former MP said Boris Johnson was “incredibly popular … like the Pied Piper”. How does that story end?\n\nComing soon: TV series that changed lead part way through, starting with Doctor Who.\n\nYour suggestions please, and ideas for future Top 10s, to me on Twitter, or by email to top10@independent.co.uk", "description": "This started with a quiz question about Crimean-war-related headgear (balaclava), and escalated from there, thanks to Dmitri Seymour. I ruled out stations, roads and bridges (Austerlitz, Trafalgar, Waterloo and so on), although I was tempted to make an exception for Quatre Bras, a small road in Hexham, nominated by Emmabella Murray, which is named after a battle of 16 June", "authors": ["John Rentoul"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/10/30/08/istock-994148670.jpg", "published_at": "2019-10-18"}