{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/halloween-chesapeake-virginia-restrictive", "downloaded_at": "2019-10-23 10:05:45.157532+00:00", "title": "Halloween in Chesapeake, Virginia Is Still Too Restrictive", "language": "en", "text": "Kids trick-or-treating during Halloween in Port Washington, N.Y., in 2014. (Shannon Stapleton/Reuters)\n\nWhat on earth is so wrong with a 15-year-old wanting to ask the neighbors for candy on Halloween?\n\nLast year, I wrote about how a law in Chesapeake, Virginia allowed for the jailing of 13-year-olds who dared to go trick-or-treating.\n\nThis year, they softened up the laws. A statement on the city’s official Twitter account, posted October 1st, reads, in part:\n\n“Earlier this year, the Chesapeake City Council voted to remove the (never before used) penalty of jail time from the ordinance, and to raise the age limit from 12 to 14. This makes our ordinance one of the least restrictive in the entire Hampton Roads region.”\n\nNow, you might think that I’d be quick to applaud this move, and leave Chesapeake alone this year. But guess what? You’d be wrong. Rather, I’d characterize the new law as a shift from “completely and totally insane” to “still insane, but less” because — and I’m sorry if I’m coming off as an anarchist here — I just don’t think that the proper role of government is to protect people from kids wanting to get candy on a holiday that’s centered around kids getting candy.\n\nSeriously, Chesapeake — what on Earth is so wrong, so dangerous, about a 15-year-old wanting to ask the neighbors for candy on Halloween? What else do you want them to do? Get a fake ID; go to the club wearing fishnets, a thong, and rodent ears; and get blackout drunk? Meet a random, go home with him, and walk home the next morning — still wearing the fishnets and the thong, the rodent ears left behind somewhere covered in UV Blue-stained vomit? I mean, sure, those may be sorts of activities are more typical of Adult Halloween, but seeing as you’re putting a limit on them engaging in the childhood one, I’m not sure you’re giving them much of a choice.\n\nThe truth is, one of the best things about being 15 years old is that things like candy are still exciting. Once you get older, once you’ve been knocked down enough by this cruel thing we call life, that just won’t be the case anymore. Eventually, you’ll become jaded. Eventually, you’ll have to try harder than a free king-sized Reese’s to make you feel alive. Eventually, you’ll become an adult. And guess what? It sucks.\n\nKids only have a certain number of years to be kids, and the last thing we should be doing is incarcerating them for wanting to make that short-lived magic last. Personally, I trick-or-treated all throughout high school, and I am proud to say that I still have managed to be not dead, nor have I ever caused the death of another. In fact, I even beat teen pregnancy, and I’m not addicted to drugs!\n\nI’m a fair person, and so I’d be totally willing to reconsider if I could see some (any!) benefit coming from a law like this, but I really just can’t. It’s true: I can’t think of even a single way in which society suffers because of a 15-year-old trick-or-treater.\n\nThe United States of America is supposed to be a free country, and its law enforcement is supposed to exist to protect and serve its citizens. Although I may not know any of the Founding Fathers personally (they never return my calls) I am still confident in saying that I’m pretty damn sure they did not rebel against British rule to create a nation where a child’s freedom could be taken away for asking for candy on a holiday that’s all about children asking for candy.\n\nSo, Chesapeake: Get rid of this still insane law. You may pride yourselves on being the least insane out of all of Hampton Road; however, being the least insane one an obvious asylum is hardly something to brag about.\n\nIf you don’t change it? Well, don’t be surprised if you see kids staggering around in fishnets and thongs, stuck somewhere in the space between hungover and still drunk, on November 1st — and don’t say I didn’t warn you if you do.\n\nEditor’s Note: This article originally stated that Chesapeake had not amended the law that banned trick-or-treating for those over the age of 12. It has been corrected and we regret the error.", "description": "I’d characterize the new law as a shift from “completely and totally insane” to “still insane, but less.”", "authors": ["Katherine Timpf", "Robert Verbruggen", "Andrew C. Mccarthy", "George Will", "Rich Lowry", "Scot Bertram", "William Z. Nardi", "Wesley J. Smith", "Jim Geraghty", "Read More"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/halloween-trick-or-treat.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-22"}