{"pub": "npr", "url": "https://npr.org/2019/10/03/766576603/wilco-ode-to-joy-new-album-review", "downloaded_at": "2019-10-03 23:28:24.353183+00:00", "published_at": "2019-10-03", "title": "Wilco, Forever In Competition With Its Own Best Work, Tries Shifting The Stakes", "language": "en", "text": "Wilco, Forever In Competition With Its Own Best Work, Tries Shifting The Stakes\n\nEnlarge this image toggle caption Annabel Mehren/Courtesy of the artist Annabel Mehren/Courtesy of the artist\n\nOde to Joy was announced as Wilco's 11th album, but it really depends who you ask. Factor in the two Mermaid Avenue records the band recorded with Billy Bragg, or the three albums that songwriter Jeff Tweedy has released under his own name, or a steady stream of official live recordings, and the numbers start to matter less. If you've followed Wilco all the way to 2019, you're likely one of two main types of listener: the casual fan who dips in and out but mostly focuses on the breakthrough trilogy of classics (Summerteeth, Yankee Hotel Foxtrot, A Ghost is Born), or the diehard who keeps up with everything in a catalog that keeps sprawling outwards. And if you hate this band, you probably don't make a big deal about it anymore, and have moved on to performatively disliking someone else.\n\nIn other words, Wilco is under much less pressure these days. That comes through in the sound of Ode to Joy (out Oct. 4), a studio album so low-key and informal that it often sounds more like a collection of demos. Produced by Tweedy and Tom Schick, the recordings have a loose, sketchy quality and largely skeletal arrangements, with Tweedy's voice and acoustic guitar at the center and the remaining instruments filling in structure and ambiance around him. Wilco is a six-piece band, but these songs rarely sound like six people playing at once.\n\nYouTube\n\nTweedy named his two recent solo records Warm and Warmer, which accurately describes their general tone. Ode to Joy could easily been called Cold or Colder, as so much of the music evokes the chilled air and muted light of an overcast winter afternoon. The opening track, \"Bright Leaves,\" sets the scene in the aftermath of a winter storm, with Tweedy singing about finding keys he'd lost in the snow after the weather turned to rain. Though the rest of the songs don't directly reference weather, the mood sticks: Lead guitar lines evoke brittle twigs and branches, percussion clunks down like boots on ice and tinkling distant piano notes float in like a cold breeze.\n\nThe heavy atmosphere isn't new — merging arty noise with roots rock was the innovation that made the band's reputation at the dawn of the 21st century — but this may be the Wilco album where vibe and sensation have become the main selling point. Tweedy is still good with melody, but his tunes aren't quite as bright or bold. If you've heard a lot of his records, these vocal lines will feel instantly familiar, and you'll find you can often anticipate the next few notes.\n\nTo some extent, familiarity is just what happens with prolific career artists: settling into comfortable creative patterns, some cozy and some a little boring. And Tweedy seems to have been hyper-aware of this phenomenon in constructing Ode to Joy, whose emphasis on texture and tension subverts the \"same old\" aspects of his songwriting to a degree, while accentuating the weariness of his lyrics. The desolate tone of \"Before Us\" makes its chorus, which reads like it ought to be an inspirational sing-along, sound like a lonely man trying to reach out to people who aren't there to listen. \"Quiet Amplifier\" and \"We Were Lucky\" have the creakiness of machines on the verge of breaking down. Without the subtle tension of a tick-tick rhythm and a piano part that seems to impatiently barge in a beat too soon, the music in \"White Wooden Crosses\" would likely sound too gentle and pretty to match the frazzled existentialism of the words.\n\nThe focus on sound also probably has a lot to do with where and how this record was made. Like all of Wilco's releases since 2007's Sky Blue Sky, Ode to Joy was recorded at the band's own studio in Chicago, The Loft. As he and the group have settled into that space, Tweedy's records have become increasingly insular, and the scope of the music has shrunk — from epics like \"Spiders (Kidsmoke)\" and \"Impossible Germany,\" which implied vast vistas, to the tiny and occasionally claustrophobic scale of this latest material. Though the band is performing many of these songs on the road right now, only a few, like the relatively perky \"Everyone Hides\" and \"Hold Me Anyway,\" sound as though they were written with the stage in mind. Perhaps armed with the knowledge that Wilco's live show doesn't necessarily need new crowd-pleasers, Tweedy's priorities seem to have shifted to music that sounds best in the room where it was made — and which, by extension, may translate best to the intimate experience of listening at home or on headphones.\n\nWhat's ironic is that in many ways, Tweedy is considerably more direct as a songwriter than he was 20 years ago. The lyrics on Ode to Joy are clear and plainspoken, nearly devoid of the evocative but often nonsensical turns of phrase he favored in his classic era. Still, music communicates more in melody and phrasing, and the abstracted language of, say, \"Poor Places\" or \"Company in My Back\" hits harder than Tweedy flatly stating \"I'm left with only my desire to change\" on Ode's \"One and a Half Stars.\" Much of the new album feels like a push and pull between the desire to connect and the urge to be withdrawn, as though its narrator wants to speak from the heart but is circumspect about whom he's willing to trust.\n\nAll of this probably sounds wishy-washy, or like faint praise. And maybe it is: The curse of a body of work like Wilco's, which is never bad and sometimes absolutely brilliant, is that perfectly good material that might be the highlight of another act's catalog seems minor or disposable next to something as excellent and culturally significant as a Yankee Hotel Foxtrot. This certainly isn't lost on Tweedy, who seems fully uninterested in trying to recapture a moment or outdo himself. There was a sense of life-or-death urgency on Yankee, and even more so on its follow-up A Ghost Is Born, that gave those songs a special emotional charge and musical oomph. Their relative merit is ultimately subjective, but it's indisputable that the Wilco that made those albums is far more ambitious than the one that produced Ode to Joy. That's not at all to suggest that ambition is a virtue in and of itself — just that those were albums with high stakes, musically and emotionally. They demanded your attention and encouraged identification.\n\nFor better or worse, Ode to Joy is a deliberately small record by a group of musicians who aren't trying to impress anyone or expand an audience, who are truly happy to do their own thing on their own terms. That may not be as inviting, but it is admirable.", "description": "The new Ode to Joy couldn't sound less like the ambitious clatter of Yankee Hotel Foxtrot — but Jeff Tweedy and crew sound at home in its skeletal frame, driven by something cozier than ambition.", "authors": ["Matthew Perpetua"], "top_image": "https://media.npr.org/assets/img/2019/10/02/annabel-mehran_wilco_highres_wide-5a7ad9bf8fff2f30f98a3d6e204348c96f4910c5.jpg?s=1400"}