{"pub": "cnbc", "url": "https://cnbc.com/2019/09/12/the-man-behind-the-smiley-face-symbol-was-paid-45-for-his-design.html", "downloaded_at": "2019-09-12 23:48:34.673043+00:00", "title": "The man behind the iconic smiley face logo, which is worth millions, was paid $45 for the original design", "language": "en", "text": "When Harvey Ross Ball was hired by an insurance company in 1963 to create a morale-boosting icon for its employees, he whipped up a yellow-and-black smiley face with a wide, dimpled grin. He was paid $45 for his 10 minutes of work. \"I made a circle with a smile for a mouth on yellow paper, because it was sunshiny and bright,\" the late graphic designer from Worcester, Massachusetts later told the Associated Press. The company slapped the simple design on posters and buttons for employees, and it was an instant hit — but it didn't just stay within the office.\n\nNeither Ball, nor the insurance company, trademarked the logo — it was a French journalist named Franklin Loufrani who first registered the mark, dubbed it \"Smiley,\" and formed a business around it by licensing it to companies like Levi's and Mars candy. Today, The Smiley Company is run by Loufrani's son, Nicolas, and generates hundreds of millions of dollars in revenue a year by charging brands like Zara and Fendi a fee to put the recognizable grin on apparel and other merchandise. Ball, on the other hand, only collected his payment of $45, which is worth about $375 in today's dollars. \"Smiley\" isn't the only iconic logo with humble origins: Nike cofounder Phil Knight paid $35 for the \"Swoosh\" design.\n\nA Nike logo in Beijing, China TPG | Getty Images\n\nIn 1971, Knight needed a logo for a new shoe his company was introducing, so he called up Carolyn Davidson, a graphic design student he'd met while teaching at Portland State University. He gave her one stipulation: The logo had to be \"something that evokes a sense of motion,\" Knight recalls in his memoir \"Shoe Dog.\" \"Two weeks later she came back with a portfolio of rough sketches,\" Knight writes. \"They were all variations on a single theme, and the theme seemed to be … fat lightning bolts? Chubby check marks? Morbidly obese squiqqles?\" \"None spoke to me,\" he adds. \"I singled out a few that held out some promise and asked her to work with those.\" Davidson returned a few weeks later with more variations. Knight settled on one that his team particularly liked — it looked like \"a wing\" or \"a whoosh of air,\" he says — but he still didn't love it. \"You guys like it more than I do,\" he remembers telling his team. \"But we're out of time. It'll have to do.\" Davidson's $35 design eventually grew on Knight — and helped transform the small shoe company into a multi-billion dollar sports brand. Don't miss: Here's how much Nike's billionaire founder paid for the infamous swoosh logo in 1971 Like this story? Subscribe to CNBC Make It on YouTube!", "description": "In 1963, an insurance company hired graphic designer Harvey Ross Ball to create a morale-boosting icon for its employees. His design, the yellow-and-black smiley face that has become a fixture in popular culture, took 10 minutes to finish.", "authors": ["Kathleen Elkins"], "top_image": "https://image.cnbcfm.com/api/v1/image/106124359-1568220471490gettyimages-579729574.jpeg?v=1568220569", "published_at": "2019-09-12"}