{"pub": "reuters", "url": "https://ca.reuters.com/article/technologyNews/idCAKBN1WG42H-OCATC", "downloaded_at": "2019-10-01 15:33:21.758481+00:00", "title": "Zuckerberg says breaking up tech firms make election interference more likely: Verge", "language": "en", "text": "FILE PHOTO: Facebook CEO Mark Zuckerberg testifies before a House Energy and Commerce Committee hearing regarding the company’s use and protection of user data on Capitol Hill in Washington, U.S., April 11, 2018. REUTERS/Leah Millis/File Photo\n\n(Reuters) - Facebook Inc’s Chief Executive Officer Mark Zuckerberg said that breaking up tech companies would make election interference more likely, according to transcripts of an internal company meeting from July published by The Verge.\n\nReuters was not able to independently verify the authenticity of the transcript.\n\nZuckerberg added that Facebook would face legal challenges if Democratic Senator Elizabeth Warren was elected as U.S. President, as she has vowed to break up giant tech companies like Amazon.com Inc, Alphabet Inc’s Google.\n\n“.. and I would bet that we will win the legal challenge. And does that still suck for us? Yeah. I mean, I don’t want to have a major lawsuit against our own government,” the transcript read.\n\n“What would really ‘suck’ is if we don’t fix a corrupt system that lets giant companies like Facebook engage in illegal anticompetitive practices, stomp on consumer privacy rights,” Warren tweeted.\n\nFacebook did not immediately respond to a Reuters request for comment.", "description": "Facebook Inc's Chief Executive Officer Mark Zuckerberg said that breaking up tech companies would make election interference more likely, according to transcripts of an internal company meeting from July published by The Verge.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191001&t=2&i=1435906590&w=1200&r=LYNXMPEF902XK-OCATC", "published_at": "2019-10-01"}