{"pub": "investing.com", "url": "https://uk.investing.com/news/economy/about-4-billion-hong-kong-deposits-may-have-left-for-singapore-as-protests-rage--goldman-1974558", "downloaded_at": "2019-10-03 08:00:18.629040+00:00", "published_at": "2019-10-03", "title": "About $4 billion Hong Kong deposits may have left for Singapore as protests rage - Goldman", "language": "en", "text": "© Reuters. About $4 billion Hong Kong deposits may have left for Singapore as protests rage - Goldman\n\nBy Noah Sin\n\nHONG KONG (Reuters) - Hong Kong may have lost as much as $4 billion in deposits to rival financial hub Singapore between June and August as political unrest escalated in the Chinese city, Goldman Sachs (N: ) estimated this week.\n\nModest net outflows from local currency deposits in Hong Kong and the net inflows of foreign currency deposits in Singapore in August could be the latest sign showing $3-4 billion left for the city state, the bank's analysts said in a report on Monday.\n\n\"That said, the HK banking system still has ample liquidity in Hong Kong dollar as well as in foreign currencies,\" though \"this set of data is unlikely to allay investor concerns around outflows from HK,\" they said.\n\nAnti-government protests have gripped Hong Kong for four months with widespread violence this week as China, which resumed ruling the territory in 1997, celebrated the 70th anniversary of the People's Republic.\n\nHong Kong's stockpile of deposits stood at HK$13.6 trillion ($1.73 trillion) in August, according to Refinitiv Datastream.\n\nBut Hong Kong dollar deposits in the city dropped in August for the most in over a year while U.S. dollar savings surged. Hong Kong Monetary Authority (HKMA) insisted on Monday that the fluctuations were \"normal\".\n\nThe central bank said the uptick in U.S. dollar deposits was driven by a \"transfer of funds resulting in a higher amount of foreign-currency deposits placed by the Exchange Fund,\" which backs Hong Kong's currency peg with the greenback at 7.75-7.85.\n\nAsked by Reuters about the reason behind this transfer, a HKMA spokesperson said in an emailed statement on Wednesday, that \"in line with past practices, we do not comment on the details of our management of the Exchange Fund.\"\n\nThe Hong Kong Dollar was trading largely flat at 7.8414 per dollar at 0514 GMT.\n\nCharts: HK deposits by currencies, August 2019 https://tmsnrt.rs/2oC7SOh", "description": "About $4 billion Hong Kong deposits may have left for Singapore as protests rage - Goldman", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEAAC0QB_L.jpg"}