{"pub": "yahoo", "url": "https://news.yahoo.com/menopause-champion-yes-paid-leave-142957788.html", "downloaded_at": "2019-10-20 12:37:03.240843+00:00", "title": "A 'Menopause Champion' at Work? Yes. You Also Get Paid Leave.", "language": "en", "text": "LONDON — A British broadcaster is prioritizing women’s health by rolling out a raft of measures to aid those dealing with a subject that is rarely discussed freely and openly in the workplace: menopause.\n\nChannel 4, a national television station in Britain, announced Friday that it would offer its female employees flexible working arrangements, tailored work spaces and even paid leave if they experienced menopause symptoms.\n\nCommon symptoms include hot flashes, heavy periods, low mood, increased anxiety, difficulty sleeping, joint pain, and problems with memory and concentration often referred to as “brain fog.” They can persist for years and are both physical and psychological, and about 80% of women will experience them in some form, according to the British National Health Service.\n\nMenopause — a natural part of aging that is caused by a drop in the production of estrogen — typically occurs between the ages of 45 and 55.\n\n“This is Channel 4 living its remit, normalizing a taboo subject by making it more visible,” Channel 4’s chief executive, Alex Mahon, said in a statement.\n\nMahon, the first woman to be chief executive in Channel 4’s 37-year history, added that she hoped the policy would inspire other media companies to support women in their workplaces going through menopause.\n\nThe broadcaster says that its menopause initiative — pioneered by an in-house gender equality staff network — is the first known among British media companies.\n\nWhile some workplaces have introduced lactation rooms for breastfeeding mothers and free period products in bathrooms, they have been slow to accommodate or recognize the battles that older women face during menopause.\n\nDr. Philippa Kaye, a London-based physician and author of “The M Word: Everything You Need to Know About the Menopause,” said that more companies needed to take action.\n\n“There is a significant brain drain that could happen,” Kaye said. “Women worry that they will be considered ‘past it’ or sidelined if they speak up about their symptoms. Businesses should be talking about menopause so that women do not feel so uncomfortable about it.”\n\nThe broadcaster’s announcement was rolled out on World Menopause Day, created by the International Menopause Society.\n\nAlthough research has found that many women believe that menopause affects their work negatively, a study from the University of Nottingham found that they are loath to speak up about its impact and are frequently embarrassed to disclose the reason they could be underperforming or missing work altogether.\n\nTo combat hot flashes, a private and cool space has been set aside at Channel 4’s offices, and women will be entitled to an assessment to ensure that their work spaces do not make their symptoms worse.\n\nA human resources employee has been designated as the “Menopause Champion,” and the broadcaster said it would introduce briefings to raise awareness of menopause within its leadership.\n\n“It is vital that not just women themselves, but that all members of staff, are aware of menopause symptoms and have access to information to make work environments more supportive places for women in menopause,” Sarah Francis, a spokeswoman for the British women’s health charity Wellbeing of Women, said in a statement about Channel 4’s initiative.\n\nReaction on social media to the initiative was overwhelmingly positive, even prompting one Twitter user to suggest “Let’s all go and work at Channel 4.”\n\nWhile the broadcaster joins only a handful of other British companies in offering menopause support, a number of businesses worldwide are striving to improve their female workers’ experiences.\n\nSome offer “menstrual leave” policies, which allow women to take a paid day off menstruating, and others provide backup day care benefits for working parents whose arrangements fall through.\n\nAlthough Channel 4 has taken steps to tackle what has been coined the “gender pain gap,” the more widely talked-about gender pay gap remains a persistent problem. The British broadcaster reported a 28% mean average pay gap in 2018.\n\nThe television channel isn’t the only employer that has struggled to close the gap in paying men and women equally.\n\nAfter Britain made it compulsory for businesses with at least 250 employees to report the difference between average salaries and bonuses for male and female staff members, a report showed a majority were still paying men more than women.\n\nThis article originally appeared in The New York Times.\n\n© 2019 The New York Times Company", "description": "LONDON -- A British broadcaster is prioritizing women's health by rolling out a raft of measures to aid those dealing with a subject that is rarely discussed freely and openly in the workplace: menopause.Channel 4, a national television station in Britain, announced Friday that it would offer its", "authors": ["Anna Schaverien"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-19"}