{"pub": "marketwatch", "title": "Argentina imposes capital controls", "url": "https://marketwatch.com/story/argentina-imposes-capital-controls-2019-09-02", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:05:03.988838+00:00", "text": "BUENOS AIRES—Argentina’s government imposed capital controls in its latest bid to prevent a depletion of foreign-currency reserves amid a crisis of confidence that has fueled dollar outflows and financial-market turbulence.\n\nThe unexpected measure, which takes effect on Monday, comes after President Mauricio Macri ’s government sought last week to unilaterally extend the maturity of all short-term paper after it was unable to roll over obligations as a result of plunging demand for government debt.\n\n“It’s Macri’s latest gambit to regain control of the situation,” said Matías Carugati, an Argentine economist. “These are very challenging times, and people are beginning to panic. It’s no surprise that the government is working on the fly, and the improvisation has some costs.”\n\nThe central bank has been selling dollars at a faster pace in an effort to contain a sharp depreciation of the Argentine peso. Carugati said reserves have fallen by $12.2 billion since Aug. 9, or about 20% of foreign-currency reserves. The peso USDARS, +0.1278% has shed more than 20% of its value since Macri suffered a crushing setback in a primary vote on Aug. 11.\n\nAn expanded version of this story is available at WSJ.com\n\nAlso at WSJ.com\n\nManhattan luxury apartment sales slump after rush to beat tax\n\nGrowing acceptance for those who don’t see themselves as male or female", "description": "Argentina’s government imposed capital controls in its latest bid to prevent a depletion of foreign-currency reserves amid a crisis of confidence that has...", "authors": ["Santiago Pérez", "Ryan Dube"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ532_macri__ZG_20190902065543.jpg"}