{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7595571/Linda-Hamilton-Arnold-Schwarzenegger-don-Korean-gats-Terminator-Dark-Fate-event-Seoul.html", "downloaded_at": "2019-10-21 08:56:57.616701+00:00", "title": "Linda Hamilton and Arnold Schwarzenegger don Korean gats at Terminator: Dark Fate event in Seoul", "language": "en", "text": "They are hot on the promo trail for the explosive latest film in the iconic sci-fi action franchise.\n\nAnd Linda Hamilton and Arnold Schwarzenegger looked delighted as they attended a press conference for Terminator: Dark Fate in Seoul, South Korea on Monday.\n\nThe co-stars were in great spirits as they embraced the local culture and donned traditional gats, hats made from horsehair with a bamboo frame.\n\nLocal traditions: Linda Hamilton and Arnold Schwarzenegger looked delighted as they attended a press conference for Terminator: Dark Fate in Seoul, South Korea on Monday\n\nAction star: The co-stars were in great spirits as they embraced the local culture and donned traditional gats, hats made from horsehair with a bamboo frame\n\nSarah Connor star Linda, 63, looked effortlessly chic in a black gown adorned with semi-sheer lace panels and sparkling silver stripes as she donned the wide brimmed hat and struck a pose.\n\nThe dress cinched in at her slender waist before flowing into a ruffled skirt, with the beauty boosting her height with a pair of black stiletto boots.\n\nHer platinum crop was styled in a sleek sidepart while her pretty features were enhanced with a radiant palette of make-up.\n\nTerminator actor Arnold looked dapper in an electric blue blazer, black tee and denim jeans, teamed with chestnut trainers while he tried on the hat, which was worn by men in the Joseon period (1392-1897).\n\nFashion: Sarah Connor star Linda, 63, looked effortlessly chic in a black gown adorned with semi-sheer lace panels and sparkling silver stripes as she donned the wide brimmed hat and struck a pose\n\nStyle: The dress cinched in at her slender waist before flowing into a ruffled skirt, with the beauty boosting her height with a pair of black stiletto boots\n\nSmile: Arnold looked in good spirits as he donned the gat during the press conference\n\nThey were joined by their co-stars Mackenzie Davis, Gabriel Luna and Natalia Reyes at the press conference.\n\nIn the movie, which opens in theatres on November 1, Reyes plays Danielle Ramos, a young woman targeted for termination by the new advanced Terminator prototype Rev-9 - who Sarah Connor seeks to protect.\n\nDark Fate comes 28 years after the second chapter in the legendary franchise - Judgment Day.\n\nLinda will play Sarah once again while Arnold plays an aging Terminator, one of several sent back in time to kill John Connor in the past who now lives in human society.\n\nMackenzie Davies, plays a cyborg from the future who also wants to protect Dani, and Diego Boneta, plays Dani's older brother Miguel.\n\nStrike a pose: Linda revealed her tattoo as she held up the hat's brim and posed for the camera\n\nDapper: Terminator actor Arnold looked dapper in an electric blue blazer, black tee and denim jeans, teamed with chestnut trainers\n\nChic: Mackenzie Davis also tried on the gat during the press conference\n\nEdward Furlong, who played John Connor in the 1991 film, is also slated to reprise his role.\n\nThe pair appeared together on BBC's Graham Norton Show in London on Friday night, where Arnold revealed that he's 'disappointed' that he can't run for President of the United States of America.\n\nAnd Linda revealed that she and her ex-husband James Cameron 'don't talk at all' - despite the Canadian filmmaker directing the latest Terminator instalment.\n\nArnold said: 'I hate politics. Even when I was Governor (of California) I never considered myself a politician.\n\nAcclaimed: Natalia Reyes, Mackenzie, Arnold, Linda, Gabriel Luna and Tim looked delighted as they took to the stage\n\nChic: Her platinum crop was styled in a sleek sidepart while her pretty features were enhanced with a radiant palette of make-up\n\nLegends: Arnold looked focused as he promoted the new film in Seoul\n\nSmile: Natalia and Mackenzie looked pleased as they answered questions while trying on the hats\n\nLegend: Arnold held out his hands as he greeted the assembled crowd at the press conference\n\n'I was a public servant who created policies to make things better for people.'\n\nAsked if he's disappointed that, because he is Austrian he can't run for president, he said: 'Of course. It would have been great to jump in and run.\n\n'It's the only thing I can't do in America. Everything else I've done is because it is in America, it's the land of opportunity.'\n\nTurning his attention to Linda, Graham asked how she was persuaded by James Cameron, her ex-husband and director of the new movie, to reprise the role.\n\nLinda revealed: 'We don't talk at all. He rang three times and it was only on the third call when he mentioned it was about work that I rang him back!\n\n'It took me a little while to decide if I had something more to do with her character.'\n\nStyle: Mackenzie looked casually chic in a white blouse and bootcut jeans\n\nRevealing that she'd had to be persuaded to do the very first Terminator, Linda said: 'I didn't want to do it at all. I was a snotty New York actress and I didn't want to go to California.\n\n'It was only when I saw Arnie on set and he was fantastic, that I thought, \"I'm in!\"\n\nArnold, a little crestfallen, asked: 'You didn't want to work with me? That's the first time I've heard that story.'\n\nLinda divorced Terminator director James in 1999 after two years of marriage. The former couple share daughter Josephine, 26.", "description": "Linda Hamilton and Arnold Schwarzenegger looked delighted as they attended a press conference for Terminator: Dark Fate in Seoul, South Korea on Monday.", "authors": ["Eve Buckland For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/08/19980256-0-image-a-6_1571643212041.jpg", "published_at": "2019-10-21"}