{"pub": "indiatimes", "url": "https://indiatimes.com/news/india/moirangthem-loiya-has-single-handedly-replanted-a-300-acre-forest-in-manipur-and-saved-over-250-species-of-plants-374674.html", "downloaded_at": "2019-10-11 12:35:44.978991+00:00", "title": "manipur forests:This Manipur Man Has Single-Handedly Replanted A 300-Acre Forest And Saved Over 250 Species Of Plants", "language": "en", "text": "Forests are quickly disappearing and if we don't act soon to regain the lost cover, we might soon bear the brunt. In the last quarter of 20th century, forest cover in Asian and third world countries, in particular, have been reduced drastically. However in recent years, there are several people who continue to raise awareness about our depleting forest cover but some have gone the extra mile. One such man, who has turned a barren land into a lush green forest is Moirangthem Loiya from Uripok Khaidem Leikai in Imphal West. His story is an inspiration for all given how much flora and fauna he has saved single-handedly.\n\nManipur: Moirangthem Loiya from Uripok Khaidem Leikai in Imphal West, has replanted Punshilok forest in Langol hill-range in 17 years, says,\"Today,forest area covers 300acres. 250 species of plants&25 species of bamboo grow here&its home to a variety of birds,snakes&wild animals\" pic.twitter.com/PIP0GQXydM — ANI (@ANI) August 30, 2019\n\nMoirangthem Loiya has replanted Punshilok forest in Langol hill-range in 17 years. Today, forest area covers 300 acres. 250 species of plants and 25 species of bamboo grow here and its home to a variety of birds, snakes and wild animals\", he was quoted to as saying by news agency ANI.\n\nKereilhouvi Angami, Principal Chief Conservator of Forest, Manipur: We appreciate his efforts. We welcome all those who protect the environment & are engaged in reforestation. We would encourage other people to also take part in protection, revival and re-forestation of forests. pic.twitter.com/r9gEU93f3Z — ANI (@ANI) August 30, 2019\n\nKereilhouvi Angami, Principal Chief Conservator of Forest, Manipur, lauded his efforts. \"We appreciate his efforts. We welcome all those who protect the environment & are engaged in reforestation. We would encourage other people to also take part in protection, revival and re-forestation of forests\", he said.\n\nDon't Miss 10.8 K SHARES 15.5 K SHARES 8.7 K SHARES 3.6 K SHARES 1.3 K SHARES\n\nThis is not the first time someone from Manipur has hogged the limelight for doing their bit for the nature. Recently, a 9-year-old girl from Manipur, Valentina Elangbam, was appointed as the first 'Green Ambassador' of Manipur. This happened after a video of her surfaced where she was seen crying after two trees that she had planted and nurtured for years were cut.\n\nManipur CM N Biren Singh appointed Valentina as the \"Green Ambassador\" for \"Chief Minister's Green Manipur Mission\" and all official plantation activities taken up in the State in recognition of her immense love and exemplary affection for the trees and to generate mass awareness on conservation of environment.\n\nPeople from Manipur are definitely setting a positive precedent for those who actually care for the environment.", "description": "There are several people who continue to raise awareness about our depleting forest cover but some have gone the extra mile. One such man, who has turned a barren land into a lush green forest is Moirangthem Loiya from Uripok Khaidem Leikai in Imphal West. His story is an inspiration for all given how much flora and fauna he has saved single-handedly.", "authors": ["Sylvester Tamang"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Aug/moirangthem_loiya_1567142725_800x420.jpg", "published_at": "2019-08-30"}