{"pub": "guardian", "url": "https://theguardian.com/music/2019/oct/24/coldplay-use-classified-ads-in-local-papers-to-reveal-new-album-tracks", "downloaded_at": "2019-10-24 04:51:53.988054+00:00", "title": "Coldplay use classified ads in local papers to reveal new album tracks", "language": "en", "text": "Band reveal details of double album Sunrise and Sunset among ads for bales of hay and whitegoods\n\nColdplay has revealed the tracks of its new album by placing ads in the classified sections of newspapers around the world.\n\nThey started close to home with local papers in north Wales and Devon but also included Australia’s Sydney Morning Herald, the Otago Daily Times in New Zealand and Le Monde in France.\n\nFacebook Twitter Pinterest A Coldplay classified ad, which has been placed in newspapers around the world Photograph: Sydney Morning Herald\n\nColdplay announced that they would release a new album – their first in four years – on 22 November, in a letter to a fan, which she shared on social media.\n\n“For the last 100 years or thereabouts, we have been working on a thing called Everyday Life,” the band wrote in a typewritten letter to a fan who initially thought it was a fake.\n\nThe ad, which appears in Wednesday’s editions of various international newspapers, reports that the new album will be split into two sections, called Sunrise and Sunset.\n\nIn the North Wales Daily Post, the advertisement sits alongside ads for bales of hay and a fridge-freezer. In the Express and Echo, a Devon newspaper, it appears above an ad for a car boot sale and next to an advertisement for someone seeking a tenant in their apartment.\n\nColdplay has strong links to both Devon and north Wales, with frontman Chris Martin coming from Exeter in Devon, and lead guitarist Jonny Buckland growing up in north Wales and tweeting that he once had a holiday job at the Daily Post.\n\nThe advertisement was also spotted in Le Monde, where it was headlined: “A VENDRE: DOUBLE ALBUM” (For sale: double album), the Otago Daily Times and the Sydney Morning Herald.\n\nColdplay (@coldplay) I once had a holiday job at the Daily Post, placing photos of houses for sale. I wasn't very good at it. JB https://t.co/tYquPUn8S4\n\nThe band have been teasing the announcement of a new album for a week, after black and white posters appeared in cities around the world, including Madrid and Hong Kong, showing the band dressed as a 1920s wedding band, which prompted rumours a new album was dropping soon.", "description": "Band reveal details of double album Sunrise and Sunset among ads for bales of hay and whitegoods", "authors": ["Kate Lyons"], "top_image": "https://i.guim.co.uk/img/media/304a50b95b9d1a9886f413bada3a2c378b09aeaa/0_104_3050_1830/master/3050.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=054fea3e86fbf2306fa9c25aaba02d09", "published_at": "2019-10-24"}