{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/jane-fraser-named-president-of-citi-and-head-of-global-consumer-banking", "downloaded_at": "2019-10-24 23:49:26.411511+00:00", "title": "Jane Fraser Named President of Citi and Head of Global Consumer Banking", "language": "en", "text": "Citi CEO Michael Corbat Announces Leadership Changes\n\nNEW YORK — Citi today announced leadership changes in the below message to colleagues from CEO Michael Corbat:\n\nDear Colleagues:\n\nJust as talent planning and development is something we ask of all our leaders, I also have a responsibility to you, and all of our stakeholders, to make sure our firm is well positioned to succeed, not just in the coming years, but into the next decade and beyond.\n\nTo that end, I have asked Jane Fraser to serve as President of Citi, a role that has been open since earlier this year. Stephen Bird has informed me of his decision to leave Citi to pursue an opportunity outside our firm, so Jane will also become CEO of Global Consumer Banking. Stephen will be available over the next few weeks to ensure a smooth transition.\n\nErnesto Torres Cantu, currently CEO of Citibanamex, will succeed Jane as CEO of Latin America. We will make an announcement about the leadership in Mexico in the near future.\n\nJane has been at our firm for 15 years, since she joined from McKinsey to run Client Strategy in the Corporate and Investment Bank. During the financial crisis, she led our Corporate Strategy and M&A group and, in many ways, Jane helped shape the company we are today. She subsequently ran two of our businesses, the Global Private Bank followed by U.S. Consumer and Commercial Banking & Mortgages.\n\nMost recently, Jane served as CEO of Latin America, where she and Ernesto have been overseeing our substantial investment in Citibanamex, which has strengthened our franchise as well as improved our products and services.\n\nErnesto is a 30-year veteran of Citi, having joined as a corporate banker in 1989. He was appointed CEO of Citibanamex in 2014. He has an excellent track record of driving business results while also prioritizing our culture and controls. Ernesto is well prepared to take on the role of CEO of the region.\n\nStephen has spent over 20 years at Citi and has served in several key roles, such as Head of Consumer Banking in Asia Pacific and ultimately CEO of the region. In 2015, he began setting a new path for Global Consumer Banking. He established a digital-heavy, footprint-light strategy in the U.S., our largest consumer market, while protecting and enhancing our competitive positions in Mexico and Asia. The strategy is clearly delivering results. We are grateful for his many contributions and wish him the very best in the future.\n\nWorking together, we have made tremendous progress. I remain committed to leading our firm in the coming years and look forward to working even more closely with Jane in her new roles. We will continue to execute our strategy so we can deliver the results our stakeholders expect and deserve.\n\n– Mike\n\nCiti\n\nCiti, the leading global bank, has approximately 200 million customer accounts and does business in more than 160 countries and jurisdictions. Citi provides consumers, corporations, governments and institutions with a broad range of financial products and services, including consumer banking and credit, corporate and investment banking, securities brokerage, transaction services, and wealth management.\n\nAdditional information may be found at www.citigroup.com | Twitter: @Citi | YouTube: www.youtube.com/citi | Blog: http://blog.citigroup.com | Facebook: www.facebook.com/citi | LinkedIn: www.linkedin.com/company/citi\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191024006053/en/\n\nContacts\n\nMedia: Jennifer Lowney (212) 793-3141\n\nInvestors: Elizabeth Lynn (212) 793-2033\n\nFixed Income Investors: Thomas Rogers (212) 559-5091", "description": "Citi CEO Michael Corbat Announces Leadership ChangesNEW YORK — Citi today announced leadership changes in the below message to colleagues from CEO Michael Corbat: Dear Colleagues: Just as talent planning and development is something we ask of all our leaders, I also have a responsibility to...", "authors": [], "top_image": "https://mms.businesswire.com/media/20191024006053/en/311741/3/00000CitiLogoBlue210_1.jpg", "published_at": "2019-10-24"}