{"pub": "investing.com", "url": "https://uk.investing.com/news/economic-indicators/recession-risks-rise-for-germany-as-industrial-orders-plunge-1956030", "downloaded_at": "2019-09-05 07:16:11.607007+00:00", "title": "Recession risks rise for Germany as industrial orders plunge", "language": "en", "text": "© Reuters. FILE PHOTO: Steel rolls are pictured at the plant of German steel company Salzgitter AG in Salzgitter\n\nBy Michael Nienaber\n\nBERLIN (Reuters) - German industrial orders fell more than expected in July on weak demand from abroad, data showed on Thursday, suggesting that struggling manufacturers could tip Europe's biggest economy into a recession in the third quarter.\n\nGermany's export-reliant economy is suffering from weaker foreign demand and business uncertainty caused by trade disputes and Britain's planned but delayed exit from the European Union.\n\nContracts for 'Made in Germany' goods were down 2.7% from the previous month, driven by a big drop in bookings from non-euro zone countries, the economy ministry said. That undershot a Reuters consensus forecast for a 1.5% drop.\n\nThe reading for June was revised up to an increase of 2.7 from a previously reported 2.5% increase.\n\n\"Overall, new orders in the manufacturing sector had a weak start to the third quarter,\" the ministry said.\n\n\"In light of still unresolved international trade conflicts and muted business expectations in manufacturing, there are still no signs of a fundamental improvement in the industrial sector in the coming months,\" the ministry added.\n\nOrders from non-euro zone countries plunged nearly 7% on the month while demand from other euro zone countries and domestic bookings rose slightly, the data showed.\n\nWithout the distorting effects of bulk orders, industrial orders rose 0.5% on the month in July, the ministry added.\n\n\"The misery in manufacturing continues. The decline in new orders significantly increases the risk of a recession for the German economy,\" VP Bank analyst Thomas Gitzel said.\n\nThe German economy contracted by 0.1% quarter-on-quarter in the second quarter on weaker exports, with the drop in foreign sales mainly driven by Britain.\n\n\"The danger is great that negative growth will also be recorded in the third quarter,\" Gitzel added.", "description": "Recession risks rise for Germany as industrial orders plunge", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXNPEF840G2_L.jpg", "published_at": "2019-09-05"}