{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/jameela-jamil-sparks-spat-caroline-20648976", "downloaded_at": "2019-10-19 10:57:58.427720+00:00", "title": "Jameela Jamil sparks spat with Caroline Flack over show she hasn't even seen", "language": "en", "text": "Get the biggest Daily Love Island stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nJameela Jamil sparked a Twitter war with Caroline Flack as she took exception to a show she hasn't even seen.\n\nThe Good Place star took to social media to express her disapproval for the Love Island host's new plastic surgery-themed show The Surjury.\n\nThe outspoken activist shared a link to a story that called the new Channel 4 programme a \"new low for television\".\n\nThe Surjury sees contestants try to convince a 12-strong jury that they should have some sort of plastic surgery, from nose jobs to boob jobs, with the panel deciding whether or not to let them go through with it.\n\n(Image: Twitter)\n\n(Image: Hewitt / SplashNews.com)\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nExpressing her disgust, Jameela tweeted: \"Welp. Black Mirror is officially happening guys. It’s here\"\n\nBut Caroline wouldn't let her get away with it.\n\nShe cheekily responded: \"Have you managed to see a copy before me ? Please forward .. am desperate to see..\"\n\nIt seems Jameela, 33, stayed quiet after that, but Caroline's response sparked a lot of comeback from fans.\n\nOne asked her: \"How can you be so defensive about a show this toxic and exploitative that you’re willingly hosting?\"\n\n(Image: David Buchan/Variety/REX/Shutterstock)\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nCaroline, 39, hit back: \"Because I’ve filmed it and the people who have taken part are amazing and have been through a lot and life is about individual choice ...\"\n\nAnother fan asked: \"Are you saying it's not how the article suggested? Is it done in a 'positive, compassionate way'?\n\n\"After reading about your personal journey with your mental health I'm surprised at your choice of job but ultimately they would have got another presenter.\"\n\nCaroline responded: \"Well mental health is a sensitive subject and as we progress we are constantly asked to be more open and visible.\n\n(Image: carolineflack/Instagram)\n\n\"My feeling toward the show is that it opens up conversations on why some people turn to surgery to help them lead the life that they believe will make them happier.\"\n\nEveryone who takes part on the show needs to convince at least 75 per cent of the jury in order to be awarded their surgery.\n\nAnd they'll go back a few months later to show off the results.\n\nIt was filmed in Manchester and is expected to air on the show in 2020.\n\nDo you have a story to sell? Get in touch with us at webcelebs@trinitymirror.com or call us direct 0207 29 33033", "description": "The outspoken star took aim at presenter Caroline over a new TV show she's filmed - but it hasn't even aired yet", "authors": ["Vicki Newman", "Image", "Twitter", "Hewitt", "Splashnews.Com", "David Buchan Variety Rex Shutterstock", "Carolineflack Instagram"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article18793842.ece/ALTERNATES/s1200/0_TBS-The-Misery-Index-TV-Show-Panel-TCA-Winter-Press-Tour-Los-Angeles-USA-11-Feb-2019.jpg", "published_at": "2019-10-18"}