{"pub": "euronews", "url": "https://euronews.com/2019/04/06/boeing-cuts-737-production-by-a-fifth-as-crash-investigation-continues", "downloaded_at": "2019-10-18 04:52:44.387544+00:00", "title": "Boeing cuts 737 production by a fifth as crash investigation continues", "language": "en", "text": "Boeing says it plans to cut its monthly 737 aircraft production by nearly 20 percent in the wake of two deadly crashes, signalling it does not expect aviation authorities to allow the plane back in the air anytime soon.\n\nDeliveries of Boeing's best-selling aircraft were frozen after a global grounding of the narrowbody model following the crash of an Ethiopian Airlines jet on March 10, killing all 157 people onboard.\n\nProduction will be cut to 42 airplanes per month from 52 starting mid-April, the company said in a statement, without giving an end-date.\n\nU.S. and airline officials said they now believe the plane could be grounded for at least two months, but an even longer grounding is a serious possibility.\n\nThe crash in Ethiopia and the crash of a Lion Air plane in Indonesia last October that killed all 189 people on board have left the world's largest planemaker in crisis.\n\nChief Executive Officer Dennis Muilenburg said on Friday that the company now knows that a chain of events caused both disasters, with erroneous activation of so-called MCAS anti-stall software \"a common link\" between the two.\n\nBoeing said it would not reduce jobs at the new production rate and will work to minimize the financial impact.\n\nThe company's board will establish a committee to review how the company designs and develops airplanes, Muilenburg said.\n\nThe group will \"recommend improvements to our policies and procedures\" for its 737 MAX and other airplane programmes.\n\nBoeing said it continues to make progress on a 737 MAX software update to prevent further accidents.\n\nShares in Boeing Co fell around two percent after the market closed on Friday. While the number of 737 MAX planes grounded is just over 370, nearly 5,000 more are on order.\n\nBoeing faces logistical issues in finding places to park the growing number of planes as well as being responsible for all their maintenance costs since it has been unable to deliver the jets to customers, two people briefed on the situation said.\n\nManufacturers avoid halting and then resuming production as this disrupts supply chains and can cause industrial snags.\n\nBoeing had been planning to speed up production in June to 57 a month.\n\nNational Transportation Safety Board chairman Robert Sumwalt told reporters that U.S. investigators were given the raw data from Ethiopian Airlines Flight 302 as soon as it was read in France last month. He added that the Ethiopian Airlines 302 preliminary report \"was very thorough and well done.\"\n\nFormer NTSB chairman Christopher Hart was named by the Federal Aviation Administration this week to head an international team to review the safety of the 737 MAX.\n\nHe told reporters on Friday he thought the review, which will start on Monday, could take about three months. It is still not clear what countries will take part.\n\nHe said investigators are going to be focused far more on the interaction between software and pilots than mechanical issues in future.", "description": "A crash in Ethiopia in March and a previous crash in Indonesia October have\nleft the world's largest planemaker in crisis.", "authors": ["Daniel Bellamy"], "top_image": "https://static.euronews.com/articles/stories/03/78/34/42/1000x563_cmsv2_b930d145-9e2b-53b0-8de9-ebe673ee014e-3783442.jpg", "published_at": "2019-04-06"}