{"pub": "washingtonpost", "title": "Is alkaline water really better for you?", "url": "https://washingtonpost.com/lifestyle/wellness/is-alkaline-water-really-better-for-you/2019/08/27/8c646d26-c462-11e9-b72f-b31dfaa77212_story.html", "language": "en", "published_at": "2019-08-27", "downloaded_at": "2019-09-02 07:08:24.969206+00:00", "text": "The idea that alkaline water promotes health has been around for decades. But with new marketing, the same beverage is being promoted as a performance-enhancing sports drink that’s at least double the price of bottled water. Global sales of alkaline water are expected to reach $1 billion this year, according to food and beverage consultancy Zenith Global.\n\nBut there’s no solid evidence that these beverages boost energy, strengthen bones or fight cancer, or that alkaline water is any better than other types of bottled water — or even tap water. Here’s what you need to know about this specialty waters.\n\nWhat exactly is alkaline water?\n\nThe terms acid and alkaline refer to the pH level of a water-based solution. The pH scale runs from 0 to 14, with 0 being completely acidic, 14 being totally alkaline and 7 being neutral. Lemon juice has a pH of 2, while baking soda has a pH of 9. Water, including tap water, has a pH of 7, or neutral.\n\nAlkaline water has a pH of up to 8 or 9. It can be naturally alkaline (for example, spring water can contain minerals that make it more alkaline), or it can be ionized to make it that way.\n\nIonized water has been put through an electrical process called electrolysis (not to be confused with the hair-removal treatment with the same name). In this process, an electrical current is sent through the water, separating the molecules into acidic ions with a positive charge and alkaline ones with a negative charge. Then, the acidic ions are siphoned off, leaving behind a more alkaline water. The water can be further enhanced or made even more alkaline by adding alkaline compounds such as minerals and salts.\n\nHow does alkaline water affect the body's pH level?\n\nA healthy body does an excellent job of keeping its pH levels within a narrow range called acid-base balance. For example, the acid in your stomach and the alkaline secretions from the pancreas work to “even out” the pH of food and beverages. And your lungs and kidneys keep the pH of your blood tightly regulated between 7.35 to 7.45. So, whether your water is more alkaline or not, it will end up neutralized once you ingest it.\n\nYou wouldn’t want your blood to be more alkaline or more acidic than these ranges, anyway, because that would indicate an underlying health problem. Blood that is too acidic or alkaline could be a sign of liver, kidney or lung disease.\n\nWhat are alkaline water's alleged health benefits?\n\nManufacturers claim alkaline water can boost energy or hydration, aid in digestion, or strengthen bones because it neutralizes acid in the body. But, as noted above, your body does a fine job of neutralizing acid on its own, and these claims are based on flimsy science.\n\nOne small study funded by an ionized/alkaline water company found that blood and urine pH increased after participants drank its water for two weeks compared with a control group of people who drank non-mineralized bottled water. The values were still within normal ranges, however, and there isn’t any evidence to suggest that these minor shifts would promote better health.\n\n[What are ‘hormone diets’ — and can they really help you lose weight quickly?]\n\nThe researchers also claimed that the alkaline water was more hydrating because the average urine output of the experimental group was lower. But because fluid intake was self-reported in this study, we don’t know whether the two groups took in the same amounts. As such, we can’t conclude that urinating less was a sign of being more hydrated.\n\nAnother study of 100 healthy people funded by an ionized/alkaline water company found that drinking the company's water after exercising in a hot environment led to a smaller percent change in a measure of blood viscosity from baseline compared with bottled water.\n\nThe researchers proposed having thinner blood could help people get oxygen more efficiently after exercise. We don’t know whether that’s true. We do know that blood viscosity isn’t a recognized measure of hydration.\n\nThere haven’t been any research studies demonstrating a protective effect of alkaline water against cancer in humans. And research on alkaline water and longevity has only been conducted on mice, so the findings can’t be generalized to humans.\n\nClaims that alkaline water may help with acid reflux is based on lab research. One study found that alkaline water with a pH of 8.8 deactivates pepsin, a digestive enzyme found in the stomach. What happens in a Petri dish isn’t indicative of what happens in your body, so it’s a stretch to say alkaline water will help with reflux.\n\nIn preliminary studies, alkaline water (with sodium bicarbonate or baking soda in it or added to it) has been shown to reduce the concentration of markers of bone breakdown. This doesn’t mean consuming it is better for long-term bone health, because this hasn’t been measured. Researchers have postulated that bone health effects of certain types of water could be due to higher calcium content or the presence of silica in some alkaline water. Higher intakes of silica, a mineral found in quartz, is linked to higher bone density.\n\nThe U.S. Food and Drug Administration has denied the use of claims for health benefits of alkaline water relating to bone health due to insufficient evidence.\n\nPotential drawbacks of ionized and enhanced waters\n\nNot only is alkaline water not helpful, drinking it may have drawbacks. Ionized or enhanced water isn’t necessarily purified. Make sure water you drink often is properly filtered and/or from a clean source without contaminants.\n\nThough enhanced water may have some minerals or other nutrients added to it, ionized or processed alkaline water that has been distilled or filtered via reverse osmosis may not contain any minerals, making it less nutritious; the World Health Organization advises against regularly consuming water that has low mineral content because it could negatively affect your digestive system and cause mineral loss. Naturally alkaline water or spring water are better choices because they typically contain minerals.\n\nThe bottom line about alkaline water\n\nAlkaline water isn’t necessarily better. Instead, you should focus on consuming water that’s filtered and contains minerals and making sure you’re getting enough of it. According to the National Academies of Sciences, Engineering and Medicine, healthy sedentary men need about 15.5 cups of fluid and women need 11.5 cups of fluid each day — and you get only about 20 percent of that from food.\n\nIn most areas of the country, you can safely and inexpensively rely on tap water to fulfill your fluid needs. You’ll be doing the environment a favor, too: drinking less bottled water means less single-use plastic waste.\n\nChristy Brissette is a registered dietitian, nutrition writer, TV contributor and president of 80TwentyNutrition.com. Follow her on Twitter @80twentyrule.", "description": "Manufacturers claim the product makes your body less acidic. But your body does a good job of keeping your pH levels where they need to be.", "authors": ["Christy Brissette"], "top_image": "https://www.washingtonpost.com/resizer/xs-862shAzHqQ05ySa5I-1-lp14=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6PDAXQWEMMI6TC7XZXRNTYEQKU.jpg"}