{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2017/feb/27/wilbur-ross-confirmed-trumps-commerce-secretary", "downloaded_at": "2019-09-08 12:53:52.628296+00:00", "title": "Wilbur Ross confirmed as Trump's commerce secretary", "language": "en", "text": "The Senate on Monday confirmed billionaire investor Wilbur Ross as commerce secretary as President Donald Trump adds to his economic team.\n\nThe vote was 72-27.\n\nBreaking with Republican orthodoxy, Ross said the Trump administration will work quickly to re-do the North American Free Trade Agreement. That’s the massive trade pact with Canada and Mexico that has boosted trade but still stings laid-off workers across the Midwest.\n\nSenators from both political parties were deferential to Ross at his nearly four-hour confirmation hearing, which was much more subdued than the confirmation hearings of other Trump nominees. Former commerce secretaries have praised him, including one who served under former President Barack Obama.\n\n“Mr. Ross will bring decades of business, entrepreneurial and civic experience to this important position,” said Sen. John Thune, R-S.D., chairman of the Commerce Committee. “I believe his extensive management experience in the private sector, and his understanding of the challenges faced by workers and businesses alike, will equip him well for the job of leading the Department of Commerce.”\n\nSen. Elizabeth Warren of Massachusetts criticized Ross‘ business ties to Russia and the way he ran a mortgage lender during the housing crisis.\n\n“Mr. Ross has extensive ties to Russia. He plans to keep making money from his major oil shipping companies while working as Commerce Secretary. He’s made billions off the backs of struggling home owners,” Warren said Monday. “He is practically a cartoon stereotype of a Wall Street fat cat.”\n\nAs part of his ethics agreement, Ross is giving up his position at Diamond S. Shipping, but he will retain a stake in the company, which ships petroleum and other products. As part of the agreement, Ross has promised not to take any action as commerce secretary that would benefit any company in which he has a financial interest.\n\nAt his confirmation hearing, Ross was not asked about business ties to Russia or his work as a mortgage lender, and he did not address the issues.\n\nSenators did note that Ross is divesting from much of his business empire.\n\nWorth an estimated $2.9 billion, Ross has extensive business ties around the globe. In 2000, he founded WL Ross & Co., a private equity firm. As part of his ethics agreement, Ross will divest from the firm.\n\nSo far, the Senate has confirmed 15 out of 22 Trump Cabinet or Cabinet-level picks requiring confirmation. Senators also were expected to move forward on Trump’s nomination of Montana Rep. Ryan Zinke to lead the Interior Department. If Zinke clears a procedural vote set for late Monday a final vote on confirmation could occur on Tuesday or Wednesday.\n\nDuring the presidential campaign, Trump criticized U.S. trade deals, including NAFTA. Trump’s stance on trade is at odds with many Republicans in Congress, but it endeared him to some voters in the Midwest who believe trade deals cost American jobs.\n\nNAFTA was negotiated and signed by President Bill Clinton, with broad support among Republicans in Congress.\n\nRoss said all free trade agreements should be systematically re-opened every few years to make sure they are working in the best interests of the U.S.\n\nRoss said he is pro-free trade but noted his close relationship with the United Steelworkers union as proof that he will fight to protect American jobs. The union has endorsed him.\n\nThe commerce secretary has several roles in promoting American business interests in the U.S. and abroad. The department handles trade issues, working to attract foreign investment to the U.S. The department also oversees agencies that manage fisheries, weather forecasting and the Census Bureau, which will conduct a count in 2020.\n\nRoss said he has experience at that agency; he was a census-taker while he attended business school.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Senate on Monday confirmed billionaire investor Wilbur Ross as commerce secretary as President Donald Trump adds to his economic team.", "authors": ["The Washington Times Http", "Stephen Ohlemacher"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2017/02/27/Senate_Trump_Cabinet_22743.jpg-70d61_c0-330-4928-3203_s1770x1032.jpg?0f2ca2cb6bb1d0fd62bec6417a1f9ba54c954fc7", "published_at": "2017-02-27"}