{"pub": "reuters", "url": "https://reuters.com/article/us-private-equity-dividendrecap-analysis/ripe-for-a-fall-private-equity-debt-rush-stokes-bond-market-fears-idUSKBN1WU291", "downloaded_at": "2019-10-15 16:27:35.674217+00:00", "title": "Ripe for a fall: private equity debt rush stokes bond market fears", "language": "en", "text": "LONDON (Reuters) - A growing number of private equity firms are taking advantage of Europe’s buoyant bond market to extract money from companies they hold by loading them with debt, prompting some investors to warn the fixed income rally is nearing its peak.\n\nFILE PHOTO: Traders are seen at work at Northern Trust offices in London, Britain August 1, 2019. REUTERS/Toby Melville\n\nSeveral private equity-backed companies have issued bonds backing “dividend recapitalizations” in recent weeks — a term that refers to the contentious practice of a companies issuing debt to pay dividends to the owner.\n\nBritain’s Pinewood Studios, owned by Aermont Capital, and Spanish gaming company Cirsa, owned by Blackstone, both issued debt to undertake dividend recaps in September, raising 500 million pounds ($625.4 million) and 375 million euros ($413.1 million) respectively.\n\nElsewhere, Switzerland’s Salt and Greece’s Wind Hellas issued debt which included language allowing for the proceeds to be used for dividend payments.\n\nThere has been 3.33 billion euros of dividend recap-related issuance this year so far, according to data provider 9fin, over three times the 2018 figure.\n\n(GRAPHIC - \"Dividend recapitalisation\" issuance builds up again: here)\n\nThe deal structure has courted controversy in the past, with critics accusing private equity firms of piling debt onto their subsidiaries for personal gain and making them more vulnerable in the future.\n\nThe 2014 collapse of British high street retail firm Phones4U was blamed partly on the company issuing 200 million pounds of debt to pay a dividend to owner BC Partners just a year earlier. <reut.rs/2Mv7HN6>\n\nPrivate equity executives say that as a structure it is no different to any company paying a dividend rather than investing in the business.\n\nBut portfolio managers who cover this market said the return of these deals has left them uneasy, with one high-yield bond fund manager saying he has been switching out of bonds in recent weeks.\n\n“It is a controversial structure that usually means the bond market has peaked,” he said.\n\nThe jump in debt-funded dividend recapitalizations offer warnings that the fixed income cycle might be about to turn.\n\nFirstly, investors are turning to such risky instruments because yield is so hard to find elsewhere. However, the fact that yields have been squeezed so much — in some cases into negative territory — is a sign that the next move may be downward for fixed income prices, which move inversely with yields.\n\nSuch a warning light flashed in the run-up to the financial crisis. In 2007 dividend recaps were booming - with more than 20 billion euros worth in Europe that year, mainly issued through loans, according to S&P Global Intelligence.\n\nA year later the crisis exploded and the structure lost traction, slowing re-emerging only in 2011.\n\nThere are also more recent examples of a rise in dividend recaps in European bond markets followed by a sell-off.\n\nIn late 2017, there was 4.69 billion euros of dividend recap issuance in Europe in the fourth quarter of 2017 alone, according to 9fin.\n\nThis proved to be the top of that particular run in European junk bonds, with the average yield on Markit’s iBoxx euro-denominated high-yield bond index rising over 70 basis points in the last six weeks of 2017, and continuing to climb all the way through 2018.\n\n(GRAPHIC - European junk bond yields: here)\n\nCharles Diebel, head of fixed income strategy at Mediolanum Asset Management, agreed an uptick in deals such as dividend recaps is usually a sign of a bond market peak.\n\n“Whether it’s right to call a widening of spreads now, I’m not sure, but we are clearly entering a period where the risk of idiosyncratic factors triggering a negative turn in markets is high,” he said.\n\nHIGH PRICES, LOW SENTIMENT\n\nThe bond market has rallied across the board and yields have dropped to unprecedented levels in 2019, as the U.S. Federal Reserve and the European Central Bank ramp up stimulus in the face of a potential economic slowdown.\n\nWith over a third of the European corporate bond market now in negative-yielding territory, according to Tradeweb, dividend recap deals have stepped up.\n\nHowever, those central bank actions to shore up the economy highlight another factor that is pushing interest in dividend recaps — that despite soaring fixed income valuations, underlying market sentiment is still very shaky.\n\n“There is clearly a continued major concern for stressed and distressed credits and lack of willingness (from banks) to underwrite there,” said Fraser Lundie, head of credit at Hermes.\n\n“In this type of environment if you’re coming across a repeat issuer where you’ve done the work, you already know the management, the decision to invest is an easy one,” he said.\n\nA credit analyst who works for a firm that bought Cirsa’s bond said knowledge of the company helped in their decision, but acknowledged that it didn’t mean she wasn’t worried about the structure in general.\n\n“People are worried at the moment, so it’s not ‘oh, everything will be great’, but these sillinesses happen because they can’t find yield,” she said.\n\nA Blackstone spokesperson declined to comment when contacted by Reuters.\n\nPrivate equity firms also show interest in dividend recapitalizations in anticipation of future fundraising pitches to their own investors, says Tanneguy De Carne, head of financial sponsor coverage UK, Nordics & Benelux at Societe Generale.\n\n“They need to demonstrate they can monetise investments. For them a recapitalization is a demonstration that their investment thesis is correct; they can take money off the table without damaging value,” he said.", "description": "A growing number of private equity firms are taking advantage of Europe's buoyant bond market to extract money from companies they hold by loading them with debt, prompting some investors to warn the fixed income rally is nearing its peak.", "authors": ["Abhinav Ramnarayan", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191015&t=2&i=1441159445&w=1200&r=LYNXMPEF9E1ER", "published_at": "2019-10-15"}