{"pub": "dailybeast", "url": "https://thedailybeast.com/patrik-mathews-missing-canadian-bomb-expert-with-ties-to-neo-nazi-group-the-base-may-be-in-us", "downloaded_at": "2019-10-30 23:17:37.189502+00:00", "title": "Missing Canadian Bomb Expert With Neo-Nazi Ties May Be in U.S.", "language": "en", "text": "A Canadian army reservist with reported ties to a violent white supremacist group has been missing for two months after his car was abandoned near the border, raising questions about whether he’s gone underground in the U.S.\n\nIn August, the Winnipeg Free Press reported that Canadian Army Reserve Master Cpl. Patrik Mathews was a recruiter for the neo-Nazi group The Base. Mathews, 26, is a trained explosives expert, making him useful to The Base, which promotes terror tactics and survivalist training. Mathews disappeared from his home shortly after the report—two days before the military announced that he had been dismissed for his alleged neo-Nazi ties.\n\nEarly last month, his truck was discovered fewer than 10 miles from the U.S. border, prompting police to warn that he might have crossed into Minnesota on foot. But two months after his disappearance, Mathews remains missing, leading to new pressure for law enforcement in both countries.\n\nA survivalist-themed paramilitary group, The Base has factions across the U.S. and Canada. The group reportedly hosted multiple “hate camps” in northern U.S. states this year. Mathews claimed to have crossed the border multiple times to attend U.S.-based hate camps, the Free Press reported after an undercover investigation of the group. But he was reportedly turned away from the border during a trip to a hate camp this spring, prompting The Base to discourage international trips, while encouraging an increased presence in Canada.\n\nMathews appears to have been part of that Canadian recruitment effort, leaving posters for the group around Winnipeg. Vice previously reported that The Base advertises a Minnesota chapter, indicating Mathews might have sympathizers in the state, if he managed to cross over. Police in Canada also seized a number of weapons from Mathews’ home after his disappearance, raising the possibility that he may be armed.\n\nStill, Canadian police have not found a trace of him, they confirmed this week. But the lack of answers has led to questions about just how serious the search efforts are.\n\nMathews is not wanted for any crime, Canadian police noted.\n\n“He’s not wanted by the RCMP right now, he’s missing,” Royal Canadian Mounted Police spokesman Sgt. Paul Manaigre said. “Our American counterparts obviously are very aware of what we are doing and we've also provided them with information.”\n\nMatthews is the third Canadian man with alleged far-right sympathies to go missing in recent months. Earlier this year, a pair of British Columbia teens went missing after killing three strangers they met on the road, they admitted in a video . A Vice investigation suggested the pair held extremist views, with both expressing far-right ideologies and one posing for pictures in a Nazi armband. Both were later discovered dead as the result of a suicide pact.", "description": "His car was found abandoned near the border two months ago, and authorities have found no trace of him.", "authors": ["Kelly Weill"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2700,w_4800,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1572456614/Weill-Canadian-neo-Nazi-tease_rlbbte", "published_at": "2019-10-30"}