{"pub": "washingtonpost", "url": "https://washingtonpost.com/arts-entertainment/2019/09/17/women-journalism-mourn-iconic-cokie-roberts-complete-irreplaceable-loss", "downloaded_at": "2019-09-17 23:26:45.685771+00:00", "title": "Women in journalism mourn iconic Cokie Roberts as a ‘complete, irreplaceable loss’", "language": "en", "text": "\n\nCokie Roberts in her Bethesda, Md., home in February. (Marvin Joseph/The Washington Post)\n\nFor decades when there was news, there was Cokie Roberts.\n\nThe Emmy-winning mainstay reporter for NPR and ABC News died at 75 on Tuesday, ABC said, after a long and storied career that began in the 1960s.\n\nAlmost instantly, her death prompted a wave of condolences across social media, particularly from women in the industry who regarded Roberts as a role model when the voice and names of men crowded newspaper bylines and radio waves.\n\n“Sad news about one of our founding mothers,” wrote Michele Kelemen, an NPR correspondent who has been with the outlet for more than two decades.\n\nFor many women, Roberts was the reason they pursued a career in journalism.\n\n“A legend has passed,” NPR’s Rachel Martin said. “When I was in high school I wanted to grow up to be Cokie Roberts.”\n\nCokie Roberts inspired me to become a journalist (and go to ⁦@Wellesley⁩) She was one of the few women on Sunday talks shows when I was growing up. She was always smart, fierce and insightful.\n\n\n\nI was fortunate to meet her a few times at CNN. #RIPCokie #thankyou pic.twitter.com/gLez9qSbKo — Heather Long (@byHeatherLong) September 17, 2019\n\n“Cokie Roberts inspired me to become a journalist (and go to Wellesley),” Washington Post reporter Heather Long said on Twitter. “She was one of the few women on Sunday talks shows when I was growing up. She was always smart, fierce and insightful.”\n\nFarrah Fazal, an investigative reporter, said the death of Roberts was a “complete, irreplaceable loss” to the field. “She was a pioneer, a mentor, committed to integrity and truth, a driving force in trying to change the system that held women back.”\n\nOther reporters recalled Roberts’s career wisdom.\n\n“The advice from @CokieRoberts was consistent,” journalist and former NPR host Michele Norris tweeted. “Forget the office politics. Just do the work … She read my copy and pushed me to write in my own voice.”\n\nThe advice from @CokieRoberts was consistent. Forget the office politics. Just do the work. She knew I was a writer and told me that was the ace in my deck. She advocated for me to get assignments. She read my copy and pushed me to write in my own voice — Michele Norris (@michele_norris) September 17, 2019\n\nNina Totenberg, an NPR legal affairs reporter, said she bid Roberts farewell Monday evening.\n\n“The world will be a lesser place without my darling friend, Cokie Roberts,” Totenberg said. “Told her I’d see her on the other side some day, where I know she will still be a star.”\n\nTotenberg praised Roberts’s reporting and writing prowess in a longer tribute posted by NPR, where Totenberg says her friend’s death left the newsroom in tears. But she also remembered a woman who was “the personification of human decency” — the kind of person who spoke often at funerals, visited casual friends in the hospital and helped those in need.\n\nRoberts did not let her cancer keep her from giving speeches, making media appearances and doing her work, Totenberg said. She had planned to attend last week’s Democratic primary debate until “her disease finally trumped her grit,” as Totenberg put it. And she went out to the movies with Totenberg and others 10 days ago despite her pain and the fact she could hardly eat.\n\n“There was not a chance she was going to cancel commitments, no matter how rotten she felt,” Totenberg wrote. “There was not a chance she would just lie in bed.”\n\nThis was always my fav photo to come across in the communication department's files at @NPR. These 3 women really shaped how I viewed a workplace and journalism in general. I always wanted to know what they were laughing about & wish I had been in on the joke. RIP #Cokie. pic.twitter.com/S8hO64bi3A — andy danyo kubis (@andykubis) September 17, 2019\n\nSo so sad. Cokie and Steve helped guide me in countless ways as a young journalist on Capitol Hill. She was both a mentor and a friend. Her work will continue in the generations of journalists whose careers she helped to shape. https://t.co/5dGxojWG20 — julie rovner (@jrovner) September 17, 2019\n\nI never had the honor of meeting Cokie Roberts, but I loved hearing her voice and her reporting and analysis over the decades. The fact that I’ll never hear her on Wednesday mornings during her “Ask Cokie” segment breaks my heart. 💔 https://t.co/JqbzEz75fv — Julia Ioffe (@juliaioffe) September 17, 2019\n\nheartbreaking. Cokie was one of the women I looked up to as a young girl who wanted to be a journalist, and as an adult, I loved her weekly segments on NPR — they were refreshing. https://t.co/hMiw7AcISX — Hadas Gold (@Hadas_Gold) September 17, 2019\n\nCokie Roberts was an icon and treasure in American political reporting. She was - and is - an absolute role model for women in this field. https://t.co/PCWcNXf96B — Jessica Huseman (@JessicaHuseman) September 17, 2019\n\nThe world will be a lesser place without my darling friend, Cokie Roberts, who died early this morning. I said good-bye last night. Told her I'd see her on the other side some day, where I know she will still be a star. pic.twitter.com/Ei8d2zkHAb — Nina Totenberg (@NinaTotenberg) September 17, 2019\n\nCokie Roberts was gracious and elegant, smart and funny. Just last week, she spoke at the home of a friend of mine to raise money for cancer research. She gave of her time and her heart. May her memory be a blessing. https://t.co/xAWvpMyJjR — Sheryl Gay Stolberg (@SherylNYT) September 17, 2019\n\nRoberts joined CBS on the radio as a foreign correspondent soon after her 1964 graduation from Wellesley College. She covered Capitol Hill for NPR beginning in 1978, when she reported on the Panama Canal Treaty, then served as congressional correspondent for more than a decade, according to ABC News.\n\nHouse Speaker Nancy Pelosi (D-Calif.) called Roberts “a trailblazer who forever transformed the role of women in the newsroom and in our history books.”\n\n“Over five decades of celebrated journalism, Cokie shone a powerful light on the unsung women heroes who built our nation, but whose stories had long gone untold,” Pelosi said in a statement. “As she helped tell the full story of America’s history, she helped shape its future — inspiring countless young women and girls to follow in her groundbreaking footsteps.”\n\nHarrison Smith contributed to this report.\n\nRead more:\n\nCokie Roberts, Emmy-winning journalist and political commentator, dies at 75", "description": "\"Cokie was one of the women I looked up to as a young girl who wanted to be a journalist,\" a CNN reporter said.", "authors": ["Alex Horton", "General Assignment Reporter Covering National", "Breaking News", "Hannah Knowles", "General Assignment Reporter", "September At Pm", "Alex Horton Is A General Assignment Reporter For The Washington Post. He Previously Covered The Military", "National Security For Stars", "Stripes", "Served In Iraq As An Army Infantryman."], "top_image": "https://www.washingtonpost.com/resizer/z-DVu6zN08y6G6KGE7vCOaq9BzA=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YV7BCZBLVAI6TEDOTVK3MRI6WQ.jpg", "published_at": "2019-09-17"}