{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7564651/Angie-Kent-looks-like-shes-having-ball-intruder-Ryan-Anderson-Bachelorette.html", "downloaded_at": "2019-10-12 06:45:31.223112+00:00", "title": "Angie Kent looks like she's having a ball with intruder Ryan Anderson on The Bachelorette", "language": "en", "text": "Angie Kent's passion for dogs is well known.\n\nAnd it looks like the blonde beauty might have met her match on next's weeks episode of The Bachelorette.\n\nIn photos from an upcoming challenge, the 29-year-old looks particularly at ease with intruder Ryan Anderson as they enjoyed a group doggy day out.\n\nSomething to howl about? Angie (left) looked like she was having a ball on a doggy day out with intruder Ryan Anderson (right)\n\nBest in show! The two potential lovebirds appeared to be having a laugh with a producer between takes\n\nThe two potential lovebirds even appeared to be having a laugh with a producer between takes.\n\nMeanwhile, the other gents competing for Abbie's affections were divided into pairs and dressed in yellow, pink, purple, red, and green shirts - indicating teams.\n\nAs Angie and the dogs raced around the set circuit, the bachelors waited on the sidelines with their assigned dogs for their turn on the track.\n\nRunning with it! Angie was seen on the set running around with a pooch on an obstacle course\n\nWaiting on the bleachers: The bachelors waited on the sidelines with their assigned dogs for their turn on the track as Angie and the dog raced her way around the set circuit\n\nCiaran, in particular, appeared to be enjoying his playtime with his Jack Russell.\n\nOn the day he dressed in a pink shirt, super skinny jeans and statement socks.\n\nThe British ex-army rifle man was later seen posing for a photo beside Angie, possibly hinting he may have won the doggy day out.\n\nBeaming! Ciaran (right) was seen posing for a photo beside Angie, showing off his toned pins in black skinny jeans - possibly hinting he wins the dog show challenge\n\nChatting away: Off camera, Angie appeared to be deep conversation with host Osher Gunsberg who turned up on set to see what all the fuss was about\n\nCanine companions: Before leaving the set, Angie enjoyed a conversation with Ryan as he fed his pampered pooch a dog treat\n\nCoffee down, ready to go! Angie enjoyed a sneaky coffee to help get her in the mood for the day's barking festivities\n\nEarlier in the day, Angie was seen in a blue blazer with a white top and a checked blazer.\n\nShe also caught up with host Osher Günsberg, who dressed for the event in a dark plaid jumper, black skinny jeans and Doc Marten boots.\n\nThe Bachelorette continues Wednesday at 7:30pm on Channel 10", "description": "Angie Kent's passion for dogs is well known.", "authors": ["Alisha Buaya For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/00/19611406-0-image-a-54_1570835667716.jpg", "published_at": "2019-10-12"}