{"pub": "theverge", "url": "https://theverge.com/interface/2019/10/9/20904516/facebook-political-ad-lies-regulation", "downloaded_at": "2019-10-09 10:43:00.491283+00:00", "title": "Why Facebook can’t stop politicians from lying", "language": "en", "text": "The Interface is a daily column about the intersection of social media and democracy. Subscribe to the newsletter here .\n\nIf you see an ad on Facebook, should the contents of that ad be true? Historically, the answer has been yes. The company’s posted advertising guidelines prohibit “misinformation,” defined here as “ads that include claims debunked by third-party fact checkers or, in certain circumstances, claims debunked by organizations with particular expertise.”\n\nAs of this week, though, that policy comes with an asterisk. As Judd Legum reported this week in his newsletter, Popular Information, Facebook is now exempting political figures from this policy. If a political candidate or party wants to run a Facebook ad announcing that their rival is a lizard person, they now have an open lane to do so.\n\nLegum has already found several examples of the Trump campaign appearing to lie in its Facebook ads:\n\nA false ad targeting seniors that claimed Trump was still considering closing the southern border “next week” when he had already publicly announced he would not close the border for at least a year. An ad scamming its supporters by claiming there was a midnight deadline to enter a contest to win the “1,000,000th red MAGA hat signed by President Trump.” The ad was run every day for weeks. An ad that falsely claimed Democrats are trying to repeal the Second Amendment.\n\nSo how should we think about this change in Facebook’s policy? Is this a crippling blow to the company’s efforts to prevent abuses on the platform? A principled stand for the freedom of speech? A pragmatic decision intended to avoid conflict with the company’s most dangerous regulators?\n\nTo some degree, it’s all of these things. But it’s also probably the right call.\n\nNot that it has been generally received that way. News of Facebook’s policy change led to much fulminating over the past week. “Social media platforms have a responsibility to protect our democracy and counter disinformation online,” Seema Nanda, CEO of the Democratic National Committee, told CNN. “This is a serious missed opportunity by Facebook.”\n\nThen, on Tuesday, Sen. Elizabeth Warren laid into the company in a series of tweets:\n\n“There’s no indication that Zuckerberg or Facebook executives have come to terms with the role their unpreparedness played in that successful attack, nor have they shown that they understand what needs to be done to prevent another attack in the 2020 election,” Warren said. “In fact, this time they’re going further by taking deliberate steps to help one candidate intentionally mislead the American people, while painting the candidacy of others (specifically: mine) as an “existential” threat. This is a serious concern for our democratic process.”\n\nCertainly it would be nice if politicians stuck to the truth in their campaign advertising. And we live in a nation that has truth-in-advertising laws, enforced by the Federal Trade Commission. But like Facebook, the FTC also declines to weigh in on the truth of political advertising. And in a case earlier this decade where a state attempted to mandate truth in political advertising, the law was struck down by a federal judge.\n\nAs recounted by Stephen Dinan in the Washington Times, Ohio had passed a law ...\n\nthat declared it illegal to publish or broadcast “a false statement concerning the voting record” of a candidate. The law also gives the power to decide truth and falsehood to the state elections commission.\n\nThen an anti-abortion group tried to put up billboards accusing a congressman of voting for abortion funding because he had voted for the Affordable Care Act. The congressman protested, arguing that Obamacare did not fund abortions.\n\nBut federal District Court Judge Timothy S. Black struck down the law:\n\n“We do not want the government (i.e., the Ohio Elections Commission) deciding what is political truth — for fear that the government might persecute those who criticize it,” Judge Black wrote in his opinion. “Instead, in a democracy, the voters should decide.”\n\nFacebook’s decision not to determine the merits of political speech in advertising seems to me to come from the same sensible place. If you don’t want the state making calls on political speech, you probably don’t want a quasi-state with 2.1 billion daily users making calls on political speech, either.\n\nOn one hand, I get why people are angry. Viral misinformation remains a significant and disturbing problem. And so when Facebook shrugs off any responsibility for evaluating the content of political advertising, it can look like cowardice. Particularly when the company continues to face bipartisan criticism that its content moderation decisions are “biased” — your decisions can’t be biased if you refuse to make them in the first place. Problem solved!\n\nAnd yet it strikes me that some of the same people mad at Facebook for failing to police the claims in political ads are the same people complaining that the company is too big, too powerful, and lacks any real accountability to the public or its shareholders. To worry about Facebook’s vast size and influence — and I do! — while also demanding that it referee political speech seems like an odd contradiction.\n\nFacebook’s approach to this problem has been to make political ads public so that researchers, journalists like Legum, and curious citizens can investigate the content of those ads themselves — and then have a free debate over their merits on and off the platform. It’s not a perfect solution, but it is a democratic one.\n\nHovering around this debate is a larger, unspoken concern about our current moment, which is that there is increasingly little penalty in public life for telling any lie at all. Pressing as that issue is, though, it’s unclear what a tech platform ought to do about it.\n\nThe Ratio\n\nToday in news that could affect public perception of the tech platforms.\n\nTrending up: Instagram is killing off its snoop-friendly “following” tab, a welcome if overdue pro-privacy gesture.\n\nTrending down: The number of state attorneys general planning to participate in the antitrust probe against Facebook has risen to 40. The group recently met with Attorney General William Barr to discuss the investigation. (Tony Romm / The Washington Post)\n\nGoverning\n\n⭐ The Trump administration is inserting legal protections for companies like Facebook, Twitter and YouTube into recent trade agreements, to shield them from lawsuits overseas. The goal is to have more countries follow the lenient regulatory guidelines set by the US, rather than the stricter ones mandated by the General Data Protection Regulation in Europe. Here are David McCabe and Ana Swanson in The New York Times:\n\nThe protections, which stem from a 1990s law, have already been tucked into the administration’s two biggest trade deals — the United States-Mexico-Canada Agreement and a pact with Japan that President Trump signed on Monday. American negotiators have proposed including the language in other prospective deals, including with the European Union, Britain and members of the World Trade Organization. The administration’s push is the latest salvo in a global fight over who sets the rules for the internet. While the rules for trading goods have largely been written — often by the United States — the world has far fewer standards for digital products. Countries are rushing into this vacuum, and in most cases writing regulations that are far more restrictive than the tech industry would prefer.\n\nGovernment officials including former special envoy Kurt Volker, EU ambassador Gordon Sondland and diplomat Bill Taylor, used WhatsApp to communicate with Ukraine. The revelation is a bit ironic, given that Attorney General Bill Barr just asked Facebook to hold up its plans to roll out encrypted messaging across its apps, citing public safety concerns. (Ali Velshi and Stephanie Ruhle / MSNBC)\n\nThe company behind the non-partisan news site RealClearPolitics has been secretly running a Facebook page called “Conservative Country” filled with far-right memes and Islamophobic smears. The page launched in 2014 and now has nearly 800,000 followers. (Kevin Poulsen and Maxwell Tani / The Daily Beast)\n\nMore than 30 civil rights groups joined forces to ask regulators to shut down Amazon’s doorbell surveillance partnerships with police. In an open letter, the group noted Amazon-owned surveillance company Ring has 400 partnerships with law enforcement agencies around the country. (Fight for the Future)\n\nContrary to what Mark Zuckerberg said during an internal Facebook meeting that leaked last week, Twitter’s unique approach to content moderation isn’t only about budgeting constraints. Vice talked to executives and employees about why they de-emphasize and hide certain content rather than just taking it down. (Jason Koebler and Joseph Cox / Vice)\n\nThe Trump administration blacklisted eight Chinese tech companies, including two of the largest video surveillance companies, for alleged human rights violations against Muslim minorities in the country’s far-western region of Xinjiang. (Shawn Donnan and Jenny Leonard / Bloomberg)\n\nHouston Rockets general manager Daryl Morey experienced the scope of China’s influence when he was forced to delete a tweet that showed support for protestors in Hong Kong. Chinese companies began pulling their NBA sponsorships, forcing Morey to write an apology, or risk losing his job. (Adi Robertson / The Verge)\n\nThe United States should require ByteDance to spin off TikTok as an American company, and Apple should start investing heavily in alternatives to manufacturing in China. Ben Thompson makes a forceful and timely case here for American companies to reconsider their relationship with China, and to do it now. (Ben Thompson / Stratechery)\n\nEgyptian authorities are cracking down on protestors with cyberattacks and random searches of phones and laptops on the street. More than 3,000 people have been arrested since online dissent against President Abdel Fattah Al Sisi spiked in late September. (Jared Malsin and Amira El-Fekki / The Wall Street Journal)\n\nIndustry\n\n⭐ Instagram removed its Following tab so users can no longer see their friends’ late night likes. Instagram said it wasn’t a popular feature, but it was a reliable showcase of your friends’ horniest faves, and led to neat weirdo art projects like the Photos Drake Liked Tumblr. Still, for privacy reasons, it’s good that it’s gone. Katie Notopoulos reports at BuzzFeed:\n\nInstagram launched its “Following” tab as an early feature back in 2011, long before its Explore tab debuted. At the time, Following was the best way to discover new content, since it would show you things your friends were liking. But that’s no longer true now that Explore has established itself as the primary means of discovering new stuff on Instagram. Now that Following has disappeared, it’s likely few people will notice it’s gone. Vishal Shah, Instagram’s head of product, told BuzzFeed News it wasn’t a feature that people used frequently and that the company suspected many users didn’t know it existed. And for those that did, it was often a source of unwelcome surprises. “People didn’t always know that their activity is surfacing,” Shah said. “So you have a case where it’s not serving the use case you built it for, but it’s also causing people to be surprised when their activity is showing up.”\n\nInstagram updated its iPhone app to take advantage of dark mode, which rolled out in iOS 13. It makes scrolling through the app much easier if you’re not a fan of Instagram’s aggressive color palette. Instagram doesn’t let you toggle dark mode on or off within the app itself, though — it has to match your phone’s system-wide settings. (Nick Statt / The Verge)\n\nFacebook announced that Workplace, its communication tool for companies, will now work with Portals, which so far have just been marketed for consumers. This is the first time Portals have launched into the business world, and means Facebook is going head-to-head Zoom and Skype. (Salvador Rodriguez / CNBC)\n\nFacebook passed five billion installs on Android, becoming the first non-Google app to reach that level of popularity. Facebook was also the first non-Google app pass 1 billion installs, a feat it achieved five years ago. (Corbin Davenport / Android Police)\n\nFacebook outages seem to be getting worse. In July, the company experienced a day-long outage across Facebook, Instagram, and WhatsApp. That followed a 24-hour outage in March. During an internal meeting that leaked last week, Zuckerberg and one of his VPs of engineering, Santosh Janardhan, discussed why. (Casey Newton / The Verge)\n\nFacebook’s is trying to woo European publishers with a three-month program to help them master video content. The program comes with $300,000 in funding (which the publishers will have to split), as well as workshops and advice. Let’s hope that advice includes a warning not to end up like Mic with an overzealous pivot to video. (Lucinda Southern / Digiday)\n\nA peak into Facebook Horizon, a new virtual world that’s coming out in beta next year to a select group of Facebook’s Oculus VR audience. Unlike Facebook’s previous VR offerings, Horizon will be highly social, with users able to interact with one another. According to Scott Stein, “it looks like NintendoLand.” (Scott Stein / CNET)\n\n8chan is plotting its return after getting kicked offline this summer due to its connection with multiple mass-murders. On Sunday, it tweeted a teaser for a new site called “8kun,” which has a slightly different logo. (Kelly Weill / The Daily Beast)\n\nAnd finally...\n\nWhy did Tinder make a show about the apocalypse? We drank margaritas and found out.\n\nTinder’s latest feature is a Bandersnatch-style choose-your-own-adventure video, in which your choices somehow lead you to potential romantic matches, and it threw a party in LA to celebrate. Rachel Kraus has details of the party, but also the plot. Which, uh:\n\nThe plot of Swipe Night involves a comet careening into Earth, so everything — drinks, desserts, decor — was vaguely space oriented. The whole offices and party area kind of looked like a bubblegum mashup of retro neon ‘80s style that had been invaded by aliens.\n\nThe end of the world does tend to put people in the mood, I suppose. Happy swiping.\n\nTalk to us\n\nSend us tips, comments, questions, and misleading political ads: casey@theverge.com and zoe@theverge.com.", "description": "Facebook’s new rules let politicians lie in their ads. It’s bad, but asking Facebook to regulate political speech is worse", "authors": ["Casey Newton", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/ubaxELNj6vUqs8uuJwmC4rS9Kvk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11559995/akrales_180614_1777_0080.jpg", "published_at": "2019-10-09"}