{"pub": "cbc", "url": "https://cbc.ca/sports/hockey/nhl/ottawa-senators-nhl-season-ex-toronto-maple-leafs-1.5283377", "downloaded_at": "2019-09-14 01:48:17.713117+00:00", "title": "Sports-no-CBC", "language": "en", "text": "Connor Brown doesn't mind switching sides in the Battle of Ontario.\n\nTwo months ago, the Ottawa Senators acquired the 25-year-old forward and defenceman Nikita Zaitsev from the Toronto Maple Leafs for blue-liners Cody Ceci and Ben Harpur.\n\nFor a kid who grew up in Toronto and was drafted by the Leafs, 156th overall in 2012, it was a bit of a shock to learn he would soon be wearing the Senators logo.\n\n\"You always see everyone being traded and you never think it's going to be you and then it comes,\" Brown said on Friday as the Senators opened training camp. \"I think it's going to be a good opportunity for me here and I think I fit in nicely with the guys. It's a good group in there so I'm just excited to get things going.\"\n\nThe transition has been made easier because Brown has a number of familiar faces in his corner.\n\nIn addition to Zaitsev, former Leafs forward Tyler Ennis and defenceman Ron Hainsey signed in Ottawa as free agents, joining new head coach D.J. Smith, a former assistant in Toronto.\n\nWhile much has been made of the Toronto contingent joining the Senators, Bobby Ryan said it really hasn't been a big deal.\n\n\"None of those guys were there that long,\" said Ryan.\n\n\"Tyler was there a year, Hainsey a year and a half, give or take I think. Brownie was the only one that I had to stare at and take a double take.\n\n\"It has been said in the media how good of guys they are and how good of locker-room guys they are and they came right in and asserted themselves quickly and the guys took to them so I'm expecting by the end of the year they'll be three core guys that are leading the room and that's nice because we needed some of that from some older guys.\"\n\nInitially caught off guard, Brown admits he suspected a change might be on the horizon.\n\n\"I did not think my future in Toronto was cemented or certain,\" he said. \"I obviously knew with the salary cap and everything going on there and just the kind of role I was being used I knew I was the guy that would have been easier to move. I was honest with myself and honest about the situation so I wasn't too shocked.\"\n\nBrown expects Senators to be 'a lot better than people think'\n\nIn Toronto, Brown was part of a team that had high playoff expectations, whereas the situation in Ottawa is all about development and contending in the future.\n\n\"In Toronto we felt we were a Cup contender there and obviously it's a little different here being in a bit of a rebuild,\" said Brown. \"Now that I've kind of got accustomed to the team and the kind of guys we've got in the system and the way we want to play, I think we'll be a lot better than people think.\"\n\nThe 38-year-old Hainsey was brought in for his experience and leadership and the Senators didn't wait long to put him to work, making him an alternate captain before the team's first on-ice session at camp. Homegrown Senators Jean-Gabriel Pageau and Mark Borowiecki also will wear 'A's' as the team goes without a captain for the second year in a row.\n\nThe Senators are Hainsey's eighth team, so he's used to moving around. But he admits it's nice to have some guys he knows in the room.\n\n\"It doesn't hurt; some of the faces I like better than others so it depends on who you're talking about,\" joked Hainsey. \"I've played against a lot of these guys. As you move around over the years you have some familiarity, but it certainly doesn't hurt.\"\n\nSenators open regular season against Maple Leafs\n\nEnnis said the decision to sign in Ottawa was an easy one after learning Smith had been hired. He liked the idea of being part of a rebuild.\n\n\"I think with all the experiences that I've had over my 10 years I can help bring in to this extremely talented young group,\" said Ennis. \"The future's definitely bright here. I'm impressed with a lot of the young guys and they seem like really good kids, too. I think it's important that D.J. sets a high standard and we all grow together and we work hard.\"\n\nThe new Senators won't have to wait long to face their former teammates as Ottawa plays Toronto twice in the pre-season and opens the regular season against the Leafs Oct. 2.\n\n\"It will be exciting for sure,\" said Ennis. \"Obviously, I developed a lot of great relationships over there and had a lot of fun. It's always fun playing your former team.\"", "description": "In addition to Connor Brown and Nikita Zaitsev, former Leafs forward Tyler Ennis and defenceman Ron Hainsey signed in Ottawa as free agents, joining new head coach D.J. Smith, a former assistant in Toronto.", "authors": [], "top_image": "https://i.cbc.ca/1.5283402.1568409358!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/connor-brown.jpg", "published_at": "2019-09-13"}