{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/meghan-markle-kisses-archie-brand-115100435.html", "downloaded_at": "2019-10-16 00:27:47.112481+00:00", "title": "Meghan Markle Kisses Archie in a Brand New Clip from an Upcoming Royal Documentary", "language": "en", "text": "From Marie Claire\n\nRoyal fans, I come bearing major news: Meghan Markle, Prince Harry and baby Archie will appear in a new documentary airing this Sunday, following the royals on their recent tour of southern Africa. And in a sweet preview clip from the show, the Duchess of Sussex plants a gentle kiss on Archie's head as Harry holds him, a moment that is, frankly, almost too cute to bear.\n\nTitled Harry & Meghan: An African Journey, the upcoming documentary will offer an exclusive look into the Sussexes' recent tour of South Africa, Botswana, Angola, and Malawi. An official description reads, \"In this new documentary filmed on their tour of Africa, The Duke and Duchess of Sussex speak exclusively to Tom Bradby about the causes and issues they care most about, and their fresh and personal approach to being modern Royals.\"\n\nHere's the snag: The documentary will air Sunday at 9 p.m. in the U.K., on British channel ITV, and as of yet, there's no word on whether it will be available in the U.S. Perhaps a formal letter of request to the Queen will secure the deal?\n\nAs People reports, Archie's scene-stealing appearance in the trailer seems like it was filmed before his first ever official engagement: meeting Archbishop Desmond Tutu and his daughter, Thandeka Tutu-Gxashe. Tutu told the press he was \"thrilled\" by the \"rare privilege and honor,\" of meeting the royal family, CNN reports.\n\nHarry said little Archie, who found himself the focal point of a crowd of cameras at the meeting, was \"used to it already,\" according to CNN, while Meghan said of her son, \"He's an old soul.\" Literally every single one of the clips and photos of the occasion is delightful—so it seems fair to assume the documentary will be a treat.\n\nFor more stories like this, including celebrity news, beauty and fashion advice, savvy political commentary, and fascinating features, sign up for the Marie Claire newsletter.\n\nsubscribe here\n\n\n\n\n\n\n\nYou Might Also Like", "description": "'Harry & Meghan: An African Journey' will air in the U.K. this Sunday.", "authors": ["Emily Dixon"], "top_image": "https://s.yimg.com/uu/api/res/1.2/zQ5jK_WqcV740R1.Uy6qbg--~B/aD03MjI7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/marie_claire_447/ab6ee50beba7ff70d52d86d978a9143d", "published_at": "2019-10-15"}