{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/someone-please-figure-out-what-all-these-weird-destiny-2-rabbits-are-for", "downloaded_at": "2019-10-10 15:28:30.515544+00:00", "title": "Someone Please Figure Out What All These Weird Destiny 2 Rabbits Are For", "language": "en", "text": "There are more than a few mysteries tucked away in Destiny 2’s Shadowkeep expansion, some more obvious than others. It’s one of my favourite things about the game: You’re wandering around, chasing some bounty or quest, and then you spot something. Something that maybe shouldn’t be there, something that you could interact with somehow if you had the right item, or came at the right time. So let me tell you about some rabbits.\n\nOne of the first strange things I noticed in Shadowkeep were these little rabbit figurines. They were like little Funko Pop! Figures, strange little dudes with creepy glowing eyes. I noted them immediately in my Shadowkeep impressions, as did many players, like Kotaku Editor-in-Chief Stephen Totilo, who took the screenshot you see above. Here’s one I found:\n\nThere are nine of these little dudes. It’s not clear what they are here for, but if you play enough, eventually you’ll get an item called a Small Rice Cake as a random drop that you can give to one of the figurines, causing it to disappear and be added to a collection near the Sanctuary base on the Moon. It’s similar to a secret hidden in the Forsaken expansion’s Dreaming City, where cat statues were hidden in various locations. Giving them a random drop called Small Offerings would yield part of a unique armour set.\n\nThese figurines don’t do that though — all you get for giving them rice cakes is a chunk of experience. And it seems like there’s a hard cap for how quickly we’ll be able to collect all the rice cakes necessary to gather all the rabbit figurines — players speculate that the rice cake drop is limited to a maximum of three per account per week, one for each character you might have.\n\nThis implies that something might happen for players who gather all nine — why else would there be a limit? Why the arbitrary three-week minimum timer? There are also a few other small details tucked away in Shadowkeep that suggests there’s more at play here. First, why rabbits?\n\nThe rabbit is associated with Daito, one of the fictional weapon manufacturers in Destiny. Most of their weapons are unremarkable fodder for levelling, but they do make a few exotics, like the Jade Rabbit exotic scout rifle. Daito has a room in the Tower that, upon Shadowkeep’s release, was closed — the implication being whoever set up that room has moved on to the one on the moon for all of the rabbits you’ve gathered.\n\nThis is all very spare, but you can stitch together a bit of a story here. While we don’t know a lot about Daito, the lore entry for the Jade Rabbit rifle is unusual. It’s not a snippet of story or a quote from a character, but an ad for Daito products that aren’t weapons, but pharmaceuticals — products called Lunal and Immortalia, meant to combat the side-effects of all the resurrecting that happens to Guardians.\n\nIt’s something that dovetails nicely with the real Jade Rabbit lore — an old folktale about a jade rabbit who lives on the moon, working away at the elixir of immortality.\n\nTaken in isolation, the lore entry for the Jade Rabbit gun is just a fun bit of allusion to an old folk story. But maybe now, it’s leading to something else, now that the moon has returned to Destiny. It might not be much, mind you — perhaps just a new exotic quest or weapon, perhaps even the Leviathan’s Breath bow quest that’s scheduled to drop on October 22. It might lead to nothing, like the rogue cat statue found hidden beneath the European Aerial Zone. Or maybe it’ll just lead to a very silly joke of little gameplay merit. No one really knows — but Destiny’s coolest parts are often the puzzles — large or small — players that work together to solve.", "description": "There are more than a few mysteries tucked away in Destiny 2’s Shadowkeep expansion, some more obvious than others. It’s one of my favourite things about the game: You’re wandering around, chasing some bounty or quest, and then you spot something. Something that maybe shouldn’t be there, something that you...", "authors": ["Luke Plunkett", "Stephen Totilo"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/cyuv7tmaf38agixsvbft.jpg", "published_at": "2019-10-10"}