{"pub": "foxnews", "url": "https://foxnews.com/us/kentucky-girl-9-dies-freak-accident", "downloaded_at": "2019-09-23 11:54:40.200899+00:00", "title": "Kentucky girl dies on 9th birthday in 'freak accident' after bike handle brake severs artery", "language": "en", "text": "A Kentucky girl died on her 9th birthday last week in what officials described as a \"freak accident\" that occurred while she rode her bicycle.\n\nCharlene \"Charlie\" Sipes was riding her bike in a rural area near Hodgenville, a city roughly 55 miles south of Louisville, on Tuesday when she fell, investigators said.\n\nBOY, 12, SURVIVES 'FREAK' TRAMPOLINE ACCIDENT AFTER METAL SPRING SHOT INTO HIS BACK 'LIKE A BULLET'\n\nAs she fell, the bike's handlebar brake hit her neck, severing an artery, WDRB reported, citing LaRue County Sheriff Russell McCoy. The sheriff said the girl's mother, Tiffany Fischer, found her and carried her around 200 feet back to their home, but she never recovered.\n\nFischer wrote on Facebook Saturday that her daughter \"is smiling right now\" seeing the news coverage of herself, as \"she always wanted to be famous.\"\n\n\"I think she would have been a comedienne. She loved Adam Sandler. Ellen [DeGeneres] made her laugh hysterically, [as did] Robin Williams. Now she's up there with our family listening to some of Robin Williams standup acts,\" Fischer said.\n\nIDAHO GIRL, 9, DIES AFTER FREAK ACCIDENT, ORGANS ARE DONATED TO 5 PEOPLE, FAMILY SAYS\n\nFischer said she's \"a mother who lost her entire heart. I lost my entire world on Tuesday. I loved that little girl with every ounce of my being. I lived because of her. She gave me purpose.\"\n\n\"She would be smiling and laughing right now. I love you so much, baby. So, so much,\" the grieving mother added. \"But you will live on. You are still here. You will not be forgotten.\"\n\nA GoFundMe page set up for the Sipes family with a goal of $2,000 had raised nearly $13,000 as of Monday. The organizer, family friend Lisa Deweese, told the Louisville Courier-Journal losing a child is unimaginable.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"I just wanted to help in any way I could.\"\n\nCharlie was a third grader at Abraham Lincoln Elementary School in Hodgenville, according to her obituary, which said the child is survived by her parents, grandparents, a great-grandmother and four siblings. The school's principal described Charlie as \"a charming, caring student who was loved by her teachers and her peers.\"", "description": "A beloved Kentucky girl died on her 9th birthday last week in what officials described as a \"freak accident\" that involved her bicycle.", "authors": ["Nicole Darrah", "Nicole Darrah Covers Breaking", "Trending News For Foxnews.Com. Follow Her On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Charlene-Sipes-1.jpg", "published_at": "2019-09-23"}