{"pub": "dailymail", "url": "https://dailymail.co.uk/money/markets/article-7627947/MARKET-REPORT-Royal-Mail-big-loser-JP-Morgan-analysts-sound-alarm-industrial-action.html", "downloaded_at": "2019-10-30 02:29:23.871655+00:00", "title": "MARKET REPORT: Royal Mail is big loser after JP Morgan analysts sound alarm over industrial action", "language": "en", "text": "The FTSE 350's biggest loser yesterday was Royal Mail, after JP Morgan Cazenove analysts sounded the alarm over industrial action.\n\nMore than 97 per cent of Royal Mail staff balloted by the Communication Workers Union have backed a strike – though whether this will go ahead is very much uncertain.\n\nRoyal Mail yesterday made a fresh plea to avoid the strikes, saying it would speak to the CWU 'without preconditions' if it removes the threat of walkouts.\n\nJP Morgan has been rattled by the fact that the union intends to time a strike for maximum impact – meaning it could coincide with Black Friday sales on November 29, Cyber Monday on December 2 and December General Election.\n\nAlthough analysts believe the direct cost may be 'manageable', the knock-on effects, such as fewer parcels being sent, could hit the 500-year-old postal service where it hurts.\n\nJP Morgan cut its rating to 'underweight' from 'neutral' and trimmed its target price to 192p from 252p, sending Royal Mail down 4.8 per cent, or 10.7p, to 211.5p.\n\nAnalysts also took a swipe at Natwest-owner Royal Bank of Scotland, after the lender revealed last week it had swung into the red in the third quarter. UBS downgraded its shares from 'buy' to 'neutral' and rolled back its target price from 225p to 235p. RBS fell 2 per cent, or 4.4p, to 219.2p.\n\nDawn Fitzpatrick, a non-executive director at Barclays who is also chief investment officer at billionaire George Soros's hedge fund Soros Fund Management, splashed out £1.5m buying shares in the British bank. Barclays rose 0.7 per cent, or 1.22p, to 171.72p. Director share purchases on a more modest scale boosted esports firm Gaming Realms and mining minnow Rainbow Rare Earths on the junior market.\n\nAIM-listed Gaming Realms jumped 12.8 per cent, or 0.85p, to 7.5p after chairman Michael Buckley bought another 2m shares for £100,000. And Rainbow bosses – chief executive George Bennett and chairman Adonis Pouroulis – spent £163,934 each, snapping up 5.5m shares for 3p each. It climbed 6 per cent, or 0.15p, to 2.65p.\n\nThe FTSE 100 for the most part brushed off uncertainty about the prospect of a December election, shedding 0.34 per cent, or 25.02 points, to finish at 7306.26, while the FTSE 250 tracked 0.21 per cent lower to close down 41.83 points at 20,168.33.\n\nThe volatility on global stock markets over the summer, driven by Brexit and the US-China trade spat, was a boon for online trading platform Plus500. Revenues between July and September rose 10 per cent to £86m and the number of new customers using Plus500 to trade surged to 24,359 from 20,684 in the same period of 2018.\n\nIt follows a plunge in profits last year when Plus500 and its peers were knocked by European regulators clamping down on trading of risky financial products. Plus500 rose 5.5 per cent, or 43.4p, to 832p.\n\nOilfield drilling equipment provider Hunting lost ground as it said challenging conditions, particularly in the US market, would hit profits, putting full-year figures at the lower end of City forecasts. It fell 1 per cent, or 4p, to 416p.\n\nOver on AIM, oil and gas tiddler Cabot Energy nosedived 46.7 per cent, or 1.75p, to 2p, after it said it was looking to quit the junior market and go private.\n\nSports nutrition specialist Science in Sport added 1 per cent, or 0.5p, to close at 50.5p, after it said that Neil Tinegate, a former digital director at Heineken and Argos, will join as ecommerce director.\n\nWomenswear retailer Sosandar jumped a further 7.5 per cent, or 1.5p, to 21.5p, building on a rally it made on Monday after it revealed sales surged 53 per cent in the first half.", "description": "More than 97 per cent of Royal Mail staff balloted by the Communication Workers Union have backed a strike - though whether this will go ahead is very much uncertain.", "authors": ["Francesca Washtell For The Daily Mail", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/i/newpix/2019/07/03/19/029257D400000578-0-image-a-23_1562176910256.jpg", "published_at": "2019-10-30"}