{"pub": "mirror", "url": "https://mirror.co.uk/travel/usa-canada/adults-pay-kids-prices-walt-20537284", "downloaded_at": "2019-10-08 12:54:01.633817+00:00", "title": "Adults pay kids' prices at Walt Disney World and Universal Studios in ticket deal", "language": "en", "text": "Get the biggest Weekly Travel stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nOrlando isn't exactly renowned for being budget-friendly, but thanks to a new deal you could bag some serious bargains to explore the theme parks.\n\nThat's because Attraction Tickets Direct has brought back its popular 'Adults pay kids prices' offer for holidays in 2020.\n\nYou can currently bag adult tickets to theme parks like Walt Disney World and Universal Studios - all for the same price as a child's ticket.\n\nThe discounted tickets are already available to book on Attraction Tickets Direct here but you'll want to be quick as the sale ends at midnight on Monday 14th October, not to mention there's limited availability.\n\nThe best part? The offer even includes combination tickets, so it's ideal if you are planning to visit all the different theme parks during your getaway.\n\n(Image: iStock Unreleased)\n\nThere are loads of variations whether you're looking for Disney and Universal combos , or whether you're after a multi-Disney parks ticket , or a multi-Universal parks ticket (both resorts count multiple parks so it can take a few days to explore them all).\n\nIt's also worth noting that the tickets are subject to availability so if you spot one that is exactly what you're after it's worth snapping it up.\n\n(Image: Bloomberg via Getty)\n\nOh, and if you're on a tight budget ahead of Christmas, you can bag each ticket with a £25pp deposit, making it ideal to spread the cost of your holiday (the full balance needs to be paid up to 42 days before the day of departure).\n\nDon't be disheartened if you can't quite make the offer work for you.\n\nWe've got guides for finding cheap Walt Disney World packages and cheap Universal Studios tickets , and even Legoland Florida deals if you've got younger children.\n\nAs for cheap hotels and flights? We've got a guide for finding cheap Orlando holidays including top tips for nabbing the best bargains.", "description": "Adults can pay kids prices at both Walt Disney World and Universal Studios in Orlando but the deal isn't on for long", "authors": ["Julie Delahaye", "Image", "Ryan Wendler", "Istock Unreleased", "Bloomberg Via Getty"], "top_image": "https://i2-prod.dailyrecord.co.uk/incoming/article13380369.ece/ALTERNATES/s1200/2_Partners-a-statue-of-Walt-Disney-and-Mickey-Mouse-sits-i.jpg", "published_at": "2019-10-08"}