{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7629209/Corrective-Services-minister-tells-Milat-family-use-GOFUNDME-pay-funeral.html", "downloaded_at": "2019-10-30 11:48:25.409850+00:00", "title": "Corrective Services minister tells Milat family to use GOFUNDME to pay for funeral", "language": "en", "text": "The minister for Corrective Services NSW has suggested Ivan Milat's family should set up an online fundraiser to pay for his funeral.\n\nThe 74-year-old, who killed seven backpackers and hitch-hikers between 1989 and 1992, died on Sunday - and told his family is dying wish was for Corrective Services NSW to foot the bill for his funeral.\n\nCorrective Services NSW minister Anthony Roberts said his department would not pay a cent towards burying the loathed killer, while Milat's family continue to insist it should.\n\n'If they're not going to stump up the cash well they can shut up,' Mr Roberts told 2GB on Wednesday.\n\nIvan Milat died on Sunday and said he wants Corrective Services NSW to pay for his funeral. Pictured: Ivan Milat and his girlfriend Maureen Murray\n\n'If the Milat family is so incensed about this they can go start a GoFundMe campaign to bury Milat.'\n\nMr Roberts said Corrective Services NSW sometimes, at their discretion, will give money for inmate's funerals.\n\nHe said Milat was told this by a priest but it was not promised to Milat.\n\nCorrective Services NSW minister Anthony Roberts (pictured) said his department would not pay a cent towards Milat's funeral - despite Milat's family insisting they should\n\nDespite Mr Roberts' insistence his department won't contribute money to the serial killer's funeral another government body could have to.\n\n'If NSW police determine that Milat is destitute then NSW Health would be required to arrange a funeral director for burial or cremation,' Mr Roberts said.\n\nWhen someone dies while in custody - even of natural causes - their body is taken for a coronal inquiry. Police also investigate their financial situation.\n\nThere has been a lot of speculation about what should happen to Milat's body.\n\nHis brother said because he still has more than four hundred years left to serve of his sentence he should be thrown back in Long Bay jail.\n\nBill Milat and the New South Wales prisons minister Anthony Roberts have been locked in a tense stand-off over who will pay up for the backpacker murderer's funeral.\n\nMilat was sentenced to seven consecutive life sentences for the murders of respective backpackers - and now his brother has jokingly suggested he be sent back to jail\n\nMr Milat is adamant that he will stick to his guns and follow his 74-year-old brother's dying wish that the family not pay a cent for the funeral.\n\n'I'm not going to pay for anything,' he told Daily Mail Australia on Wednesday, before throwing out some very unlikely suggestions about what should be done with the body.\n\nMr Milat told Daily Mail Australia he didn't mind what happened to his brother -whether he is left on ice in the morgue indefinitely, and even suggested he be chucked back in jail.\n\n'I don't care where (he goes) - they can stick him back in Long Bay,' he said.\n\nTense standoff: Bill Milat (left) is refusing to pay for his brother's funeral as it was his dying wish\n\nAbove is a look inside a cell in the Long Bay prison. Ivan spent most of his thirty years behind bars at the jail\n\n'He was given seven life sentences, he did one, so that means there's six (sentences of) seventy-four years to go.\n\n'Which is what, four hundred and forty four years?'\n\nHe continued to throw out other suggestions as he insisted: 'We're not going to claim the body, we're not going to do anything.\n\n'They can stick it down Macquarie Street, they can do whatever they please.'\n\nBut there was one exception - he ruled out scattering Milat's ashes at the Belanglo state forest, saying the family never wanted to offend Milat's victims.\n\nThe family has explicitly ruled out scattering his ashes in the Belanglo state forest, despite troll suggestions online, and say his eventual grave will be unmarked\n\nBill Milat reads the final letter from his brother Ivan this week asking for 'a pauper's burial or whatever is suitable'\n\nMr Milat was handed a letter from his brother, days before his death, which told him 'don't pay for my funeral services or contribute in any way.' The backpacker killer suggested a pauper's funeral.\n\n'That's not what his last wishes were and it's as simple as that,' the stubborn sibling said.\n\nIn his statement earlier this week, minister Mr Roberts said: 'Hell will freeze over before Corrections pays a cent for this man's funeral.\n\nJoanne Walters, 22, (left) was stabbed to death by Ivan Milat. Her friend Caroline Clarke, 21, (right) was shot 10 times as if she was target practice. The pair disappeared in April, 1992\n\nFormer prison governor John Heffernan said if nobody steps forward, Corrective Services or the NSW government is going to end up burying Milat\n\n'Ivan Milat's body will remain on ice until the family stumps up cash or the family can tell police where the bodies are buried.'\n\nA Corrective Services spokeswoman said while the agency sometimes provides a funeral subsidy to families of inmates who died in custody, 'that will definitely not be happening in this case.'\n\nBut former jail governor John Heffernan, who worked in prisons for three decades, said one way or the other the government would probably have to pay for it.\n\n'If nobody steps forward, given the fact he died in custody, Corrective Services has to step up to the mark and they've got to bury him,' he said.\n\nMr Heffernan said 'I couldn't give a stuff if they took him out to sea and threw him overboard. Most people probably think that way.\n\n'We can't do that - we're supposed to be a humane society'.\n\nNSW Health, which currently has his body on ice, was approached for comment.\n\nDeborah Everist (left) and Anja Habschied (right) were among Ivan Milat's seven victims. Everist, 19, died after being stabbed multiple times. Habschied, 20, was decapitated", "description": "Corrective Services NSW minister Anthony Roberts said backpacker murder Ivan Milat's family should 'shut up' and use Go Fund Me to pay for the killer's funeral as the department won't be.", "authors": ["Claudia Poposki", "Daniel Piotrowski For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/09/20366462-0-image-a-19_1572427411306.jpg", "published_at": "2019-10-30"}