{"pub": "nyt", "url": "https://nytimes.com/2019/09/11/opinion/why-are-poor-women-poor.html", "downloaded_at": "2019-09-12 07:07:33.376705+00:00", "title": "Opinion | Why Are Poor Women Poor?", "language": "en", "text": "Proponents of unrestricted capitalism also promote the idea that ending poverty is a matter of changing individual poor people one by one — teaching a man to fish is supposed to feed him for a lifetime. Scratch the surface, and we can see that portrays his poverty as caused by lack of knowledge, rather than, say, the fact that there are no fish in the ocean.\n\nSimilarly, we love a good success story about a woman lifting herself up with a goat or a sewing machine. During the 20th century, images of poor women as victims were all the rage. Today, we see them as superheroes-in-waiting, ready to lift up their families and countries once a $70 loan frees them from their husbands and the cultural expectations that prevent them from working for pay.\n\nYet the type of work poor women do, and that development programs funnel them into, is not the kind that brings people out of poverty. Goat farmer, maid and seamstress, for example, are poorly paid jobs with no benefits that leave women vulnerable to abuse. They are also precarious — there one day and gone the next. Better jobs will not appear unless the global economy changes. Gendered employment discrimination is a serious problem, but it’s not as though most developing countries are teeming with well-paid jobs that women are excluded from.\n\nThe assertion that women just need a job in order to escape poverty suggests that the problem lies in their not working enough. But women in the global South are, as Diane Elson puts it, an “overutilized” resource. Women who are supposed to be pulling their families out of poverty are already cooking, carrying fuel, farming, and caring for children and elderly people for more than 14 hours a day. This work affects women across cultures, but the global economy makes the burdens on Southern women especially intense.\n\nRather than suggesting that poor women don’t work enough, the conventional narrative sometimes suggests they don’t know enough. Coca-Cola’s Jocelyn needed to learn to make jewelry. In Ms. Gates’s book, female farmers need technology in the form of genetically modified seeds. Yet hunger is driven more by lack of purchasing power than by lack of food. Food farmed by rural African women routinely leaves for cities and other countries. All the while, international financial institutions encourage policies that push farmers in Africa off their land.\n\nThe concept of women’s empowerment did not have to turn into one that trains our gaze on local causes of poverty. The concept’s origins are usually traced to women activists from the global South, whose vision included transformation of local and global institutions. This meant changing the economic rules of the game that kept women behind and giving women a voice at the global decision-making table. Empowering poor women was, in their eyes, inextricable from doing something about the vast gulf separating the global rich and poor.\n\nDrawing attention to the situation of poor women may seem to be a good thing, even if our way of doing so omits our causal role in their poverty. But as long as we don’t understand the scope of the problem, we won’t go far enough in solving it. In fact, we might end up making it worse. The result of focusing on income generation has been a “feminization of responsibility,” where women do more and more to support their families while ignoring their own needs and watching their status in their households and societies go down.", "description": "Our feel-good narratives put the burden back on the oppressed and let rich countries off the hook.", "authors": ["Serene J. Khader"], "top_image": "https://static01.nyt.com/images/2019/09/11/opinion/11stoneWeb/11stoneWeb-facebookJumbo.jpg", "published_at": "2019-09-11"}