{"pub": "cbs", "url": "https://cbsnews.com/news/jack-eaton-100-year-old-former-tomb-of-the-unknown-soldier-guard-honored-with-his-own-salute", "downloaded_at": "2019-10-24 02:24:40.294864+00:00", "title": "100-year-old who guarded the Tomb of the Unknown Soldier honored with his own salute", "language": "en", "text": "Arlington, Virginia — Honor flights have flown nearly a quarter of a million veterans to the nation's capital to visit the monuments built in their honor. Safe to say no veteran has felt prouder, or happier, than 100-year-old Jack Eaton, the oldest living American who stood watch at the Tomb of the Unknown Soldier.\n\nEighty years ago, he stood guard at the Tomb of the Unknown Soldier, the monument to America's fallen that has the power to silence teenagers. It has been guarded around the clock since 1937. Eaton became a sentinel in 1938 and served for three years.\n\n\"At night, you're mighty quiet. You do a lot of thinking about who that is under that marble statue there,\" he said.\n\nThere are no records dating back that far, but he was able to prove his service by remembering details only a sentinel would know, like a small chapel hidden behind the tomb. So on Wednesday, he was back at Arlington National Cemetery, not just to witness another changing of the guard, but to see his name go up on the honor roll of those who have stood watch over the unknown.\n\nJack Eaton CBS News\n\n\"That's going to be up there forever. When I'm gone, people are going to come up and look at it,\" Eaton said.\n\nYour place on the wall can be revoked if later in life you bring dishonor on the tomb. But that's not likely with Eaton, unless dancing becomes a crime.\n\n\"When the music starts, my feet want to move,\" he said.\n\n\"Never will I falter,\" the sentinel's creed reads, and though his step has slowed, he never did.", "description": "Jack Eaton was back at Arlington National Cemetery to see his name go up on the honor roll of those who stood watch", "authors": ["David Martin"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/10/23/87abc11d-652d-4c76-a5d8-80a7d0ac3b4c/thumbnail/1200x630/66f64b97dce9b94fd56ad4c89ce26c36/550c-oldest-sentinel-frame-75.jpg", "published_at": "2019-10-23"}