{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7601391/Trump-says-TERMINATE-NYT-Washington-Post-canceling-White-House-subscription.html", "downloaded_at": "2019-10-22 20:46:09.520244+00:00", "title": "Trump says he may 'TERMINATE' NYT and Washington Post subscriptions", "language": "en", "text": "Donald Trump said in an interview that aired Monday that he no longer wants to have hard copies of The New York Times and The Washington Post in the White House, claiming he was going to 'terminate' the newspapers.\n\n'We don't even want it in the White House anymore,' Trump told Fox News host Sean Hannity. 'We're going to probably terminate that and The Washington Post. They're fake.'\n\nHannity suggested media wasn't making a bigger story about former Vice President Joe Biden and his son Hunter's business dealings in Ukraine and China.\n\nTrump is an avid reader of print newspapers, but White House Press Secretary Stephanie Grisham confirmed to Politico that the president was referencing hard copy subscriptions, “which we won’t be renewing.”\n\nDonald Trump told Fox News' Sean Hannity that he wants to 'terminate' the New York Times and Washington Post\n\nIn context, it appears Trump was referring to stopping the hardcopy delivery of the two newspapers to the White House\n\nAlthough Trump appears not to have been referring to the papers’ access to the White House, the comments drew the attention of an attorney who represented two reporters whose White House press passes were pulled.\n\n'More compelling evidence, indeed another confession, that @realdonaldtrump and his team engage in content- and viewpoint- discrimination regarding certain (indeed many) members of the White House press corps, in plain violation of the First Amendment,' attorney Ted Boutrous tweeted Monday night.\n\nBoutrous was the lawyer for CNN's Jim Acosta and Playboy's Brian Karem after the Trump administration withdrew their White House press credentials.\n\nTrump, who frequently rails against reporters and the media, which he calls 'fake news,' appeared on Hannity for an hour-long interview Monday night with the Rose Garden as a backdrop.\n\nBoth the Times and Post are usual targets of the president – along with other outlets like CNN and MSNBC – but no outlet is safe from the president's ire.\n\nThe question that led Trump to issues criticism of the media was referencing a scandal that led the House to officially launch impeachment proceedings.\n\nA whistle-blower revealed in September that he filed a complaint in August alleging the president's phone call with his Ukrainian counterpart was improper.\n\nThe unnamed CIA agent said Trump urged Ukrainian President Volodymyr Zelesnky to investigate the Bidens. Zelensky claims he was not 'pressured' or 'blackmailed,' and Trump has called the conversation 'perfect.'\n\nThe attorney for two reporters whose press passes were revoked by Trump's White House said the president's comments proved he wanted to silence voices in the media with which he disagrees\n\nTrump often lashes out against media outlets and reporters, and the Times and Post are two of his main targets, which he refers to as the 'fake news' media\n\nThe July 25 call was just a few days after the Trump administration froze millions in military aid to Ukraine – prompting Democrats to claim that the president used his office to set a quid pro quo that would benefit his reelection campaign.\n\nActing Chief of Staff Mick Mulvaney essentially admitted to a quid pro quo during a press conference last week, but walked back on his comments and has since claimed otherwise.\n\nHannity is a defender of the president on his nighttime Fox show, which airs Monday through Thursday, and conducted a relatively friendly interview with Trump. He did not bring up Mulvaney's comments that seemed to contradict the president's.\n\nThe Fox News host also interviewed Trump last year.", "description": "Donald Trump said that he no longer wants to have hard copies of The New York Times and The Washington Post in the White House, claiming he was going to 'terminate' the newspapers.", "authors": ["Katelyn Caralle", "U.S. Political Reporter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/18/20046750-0-image-a-21_1571764208280.jpg", "published_at": "2019-10-22"}