{"pub": "japantoday", "url": "https://japantoday.com/category/rugby-world-cup-2019/south-africa-star-pollard-wary-of-%27suffocating%27-wales", "downloaded_at": "2019-10-25 23:43:12.064077+00:00", "title": "South Africa star Pollard wary of 'suffocating' Wales", "language": "en", "text": "By Julian GUYER\n\nSpringbok fly-half Handre Pollard has warned South Africa against falling into the trap laid by a \"suffocating\" Wales ahead of Sunday's World Cup semifinal in Yokohama.\n\nWales have won all four of their tests against South Africa since a 23-19 loss at Twickenham in the quarterfinals of the 2015 World Cup.\n\n\"They know what they are good at, and focus on that,\" Pollard told reporters at the Yokohama Stadium on Friday. \"They starve you of possession and territory, and enforce their kicking game on you. They take away your set-piece. It's not a game-plan or rugby with a lot of flair in it, but it's just suffocating.\"\n\nPollard was playing when Wales beat South Africa 20-11 in the teams' most recent meeting in Cardiff in November and he said he was glad to be facing Warren Gatland's men on neutral territory this weekend and with most of the squads fit.\n\n\"Lately, we've struggled against them. It's always our last game on the end-of-year tour, after a long season and in the Millennium Stadium (in Cardiff).\n\n\"It's always tough, and you never have all your guys fit and ready to go.\n\nAs for how South Africa would counter Wales' tactics, a smiling Pollard said: \"We have a couple of plans up our sleeves! I'm not going to go into that too much. We will see on Sunday.\"\n\nThis weekend sees Pollard up against Wales fly-half Dan Biggar in another World Cup knockout match.\n\nThe Springbok credited his opposite number with a \"brilliant game\" when the two teams played in the 2015 quarter-final.\n\n\"He is a world-class player. I know Gareth Anscombe played for them over the last couple of years, and he's had that big (knee) injury.\n\n\"But Dan is an unbelievably good rugby player. He is really not scared of the physical part of the match, and that's something that excites both of us.\n\n© 2019 AFP", "description": "Springbok fly-half Handre Pollard has warned South Africa against falling into the trap laid by a \"suffocating\" Wales ahead of Sunday's World Cup semifinal in Yokohama. Wales have won all four of their tests against South Africa since a 23-19 loss at Twickenham in the quarterfinals of the 2015 World…", "authors": [], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/d9/45/3a3205e0e4ffca3a8413a77e77d16a711d73/d9453a3205e0e4ffca3a8413a77e77d16a711d73.jpg", "published_at": "2019-10-25"}