{"pub": "businessinsider", "url": "https://businessinsider.my/hsbc-to-cut-10000-jobs-as-interim-ceo-quinn-makes-his-mark-ft-says-2019-10", "downloaded_at": "2019-10-07 12:21:31.384294+00:00", "title": "HSBC is reportedly planning to axe 10,000 jobs amid a brutal year for global bank workers", "language": "en", "text": "source Reuters\n\nHSBC is planning to cut 10,000 jobs as it embarks on a major cost-cutting effort, the Financial Times says.\n\nThe Financial Times broke the story on Sunday, saying that the new interim CEO of the bank, Noel Quinn, is looking to make his mark.\n\n“We’ve known for years that we need to do something about our cost base, the largest component of which is people – now we are finally grasping the nettle,” one unnamed person at the bank told the newspaper.\n\nThe paper reported that most of the jobs being cut will be at the higher levels of the bank.\n\nView Markets Insider’s homepage for more stories.\n\nHSBC is joining the list of banks this year cutting thousands of jobs as it has plans to axe 10,000 people from the bank, according to the Financial Times.\n\nTwo sources who had been briefed on the bank’s plans told the Financial Times that the headcount at the bank would be reduced to 238,000 globally.\n\nIt’s been a brutal year for bank employees. So far this year, Deutsche Bank, Barclays, and Citigroup are among banks that have reportedly shed a total of over 60,000 roles.\n\nNew interim CEO Noel Quinn is looking to make his mark on the bank, the newspaper said, as the new job cuts come on top of the 4,700 that were announced in August along with stepping down of chief executive John Flint. Flint was let go in part because he shied away from cutting jobs, as the bank faced mounting Brexit and trade war woes, the FT wrote.\n\nThe newspaper cited one of the sources as saying: “We’ve known for years that we need to do something about our cost base, the largest component of which is people – now we are finally grasping the nettle.”\n\n“There’s some very hard modelling going on. We are asking why we have so many people in Europe when we’ve got double-digit returns in parts of Asia,” the source added.\n\nQuinn, who replaced Flint in August, has been told that he is the front runner to take the top spot permanently, the FT said. The newspaper said that most of the jobs being cut will likely be taken from those in higher-paid roles.\n\nThe bank faces “an increasingly complex and challenging global environment” amid Brexit, low-interest rates, and trade disputes, the FT said.\n\nMarkets Insider has reached out to HSBC for comment. The bank declined to comment to the FT.", "description": "Business Insider - The Financial Times reported on Sunday the bank faced “an increasingly complex and challenging global environment,\" citing Brexit and trade conflict.. Read more at businessinsider.my", "authors": ["Yusuf Khan", "Business Insider Us"], "top_image": "https://static.businessinsider.my/sites/3/2019/10/5d9aebc3ee40e42b7c12395d.png", "published_at": "2019-10-07"}