{"pub": "reuters", "url": "https://uk.reuters.com/article/us-companies-competition-breakingviews/breakingviews-hadas-different-rules-for-new-corporate-giants-idUKKBN1X91TO", "downloaded_at": "2019-10-30 23:25:40.430253+00:00", "title": "Breakingviews - Hadas: Different rules for new corporate giants", "language": "en", "text": "LONDON (Reuters Breakingviews) - “The most important thing (is) trying to find a business with a wide and long-lasting moat around it … protecting a terrific economic castle with an honest lord in charge of the castle,” when Warren Buffett gave that advice in 1995, the boss of investment giant Berkshire Hathaway was only thinking of returns for shareholders. Politicians, regulators and economists might draw some different lessons, especially as these corporate moats become more common and harder to cross.\n\nA 3D-printed Facebook logo are seen in front of displayed binary digits in this illustration taken, March 18, 2018.\n\nThere’s nothing new about companies establishing monopolies, cooperative oligopolies and dominant market positions in order to earn high profits. However, recent developments have made these competitive moats deeper and easier to dig.\n\nThe first is the sharp fall in the cost of collecting, analysing and distributing information. Ever cheaper data is what the likes of Google owner Alphabet and Facebook provide, collect and sell. This abundant information helps create network effects. The more searches that Google performs, the more it can connect users to the right advertisers. The more people use Facebook, the more valuable the platform becomes.\n\nAbundant data is also one of the key factors in running a truly global company, and big groups often have a valuable advantage over smaller peers. Greater data expertise may give the giants an edge in many domains: minimising inventories, designing products, servicing customers, spreading best practices and dodging taxes.\n\nThe other change is in economies of scale. Globalisation had made the advantages of size more costly to obtain, as operations are not really efficient unless they are worldwide. But the operating leverage from global scale can be tremendous. Multinationals can spread the costs of developing new products and technologies over more customers. They are often also better placed to influence regulatory standards.\n\nIn many industries, mere national competitors are too small to thrive. For example, the competition to install 5G mobile phone infrastructure is entirely among global payers. Even a home market with 1.4 billion people is probably too small for Huawei. If security concerns limit the Chinese leader’s worldwide market share, its profitability will suffer.\n\nOf course, small and nimble can get around large and lumbering, at least for a while. Clever innovations such as Dyson vacuum cleaners or Chobani yoghurt can outsmart the big guys. New biotech companies can develop one special product. Small video production houses can make a hit show or two.\n\nHowever, the cost of building up anything like global distribution is generally prohibitive. The logical strategy is not to give it a try, but to sell out to an established global competitor. Such deals can look expensive, but they let the buyer put alligators in its moat.\n\nSuch mergers are facing increased criticism. Economists such as Thomas Philippon and Matt Stoller have written books saying, among other things, that America’s ever-weaker enforcement of its antitrust laws has given industry leaders too much power.\n\nThey are not exactly wrong. A general deregulatory trend has helped the M&A business, especially in the United States, and wink-and-nudge price collusion among big companies has probably become easier. Still, the critics are missing something important. Many of the moats surrounding companies today are quite different from the vast monopolies like Standard Oil and U.S. Steel that were created in the late 19th century and broken up in the early 20th century.\n\nFor one thing, the current corporate behemoths often seem consumer-friendly. Customers would probably lose more than they gain from breaking up Facebook or Alphabet, or from mandating that more companies try to develop rival mobile phone or self-driving car technologies. Similarly, consumers are often better off buying from global giants such as Unilever, and Nestlé than from local competitors with higher costs and possibly lower quality controls.\n\nStill, the new kinds of corporate power are not necessarily benign. Even when Buffett’s lords are honest, they may not be looking out for the common good. And they are not always honest. If enforcing competition rules does not work, then a new style of regulation is needed to keep companies from extracting the wrong kind of advantage from their impregnable positions.\n\nNot totally new, actually. Utilities, airports and other natural monopolies have often faced complex and detailed regulation. Watchdogs may mandate certain levels of customer service or emissions as well as controlling prices and returns on capital. Something along those lines, ideally on a global scale, looks like the best way forward now.\n\nThe challenges and best solutions vary by company and industry. For example, Facebook may need its very own watchdog to keep track of all the ways that boss Mark Zuckerberg and his minions might take unfair and secret advantage of their customers’ data.\n\nThese new regulators would not necessarily aim directly at lower profitability, but they might want to focus on inappropriate prices. For example, in the United States monopolistic moats often allow pharmaceutical companies to charge what customers are willing to pay for a drug, regardless of the much lower costs of development and manufacturing.\n\nNew corporate moats are wider, deeper and harder to cross. Nevertheless, regulators can acquire the equipment needed to pave over them.", "description": "(Reuters Breakingviews) - “The most important thing (is) trying to find a business with a wide and long-lasting moat around it … protecting a terrific economic castle with an honest lord in charge of the castle,” when Warren Buffett gave that advice in 1995, the boss of investment giant Berkshire Hathaway was only thinking of returns for shareholders. Politicians, regulators and economists might draw some different lessons, especially as these corporate moats become more common and harder to cross.", "authors": ["Edward Hadas", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191030&t=2&i=1446566597&w=1200&r=LYNXMPEF9T1CA", "published_at": "2019-10-30"}