{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/most-netflix-subscribers-wont-leave-for-apple-disney-analyst-says-2019-10-1028572332", "downloaded_at": "2019-10-03 07:48:56.902766+00:00", "published_at": "2019-10-03", "title": "Here's why Wall Street's biggest Netflix bull thinks subscribers won't be tempted by Apple and Disney's competing services (NFLX, AAPL, DIS)", "language": "en", "text": "Netflix\n\nOver the next six weeks, Apple and Disney are set to release their own streaming platforms to compete with Netflix.\n\nAccording to a survey conducted by Piper Jaffray analyst Michael Olson, about 75% of Netflix subscribers don't plan on subscribing to either Disney Plus or Apple TV Plus.\n\nOlson, who has the highest price target out of any major-bank analyst that's published research in the past month, said Netflix's current share price already reflects the risks from new competition.\n\nNetflix has erased almost all of its gains for year in recent weeks as investors have grown more concerned new streaming platforms could start sapping the company's market share.\n\nVisit the Business Insider homepage for more stories.\n\nThe streaming world is about to get a lot more crowded over the next six weeks as Apple and Disney roll out their own platforms. But Wall Street's biggest Netflix bull says the company might not have to worry just yet.\n\nAccording to a survey conducted by Piper Jaffray analyst Michael Olson, about 75% of Netflix subscribers don't intend to use Disney Plus or Apple TV Plus.\n\nOlson currently has $440 price target on Netflix's stock, the highest out of any major-bank analyst that's published research in the past month. He's also assigned an \"overweight\" rating to the stock.\n\n\"Despite an onslaught of new streaming services currently casting a cloud of concern over NFLX shares, we expect the company will continue to capture a significant portion of traditional content dollars, as those dollars migrate to streaming,\" Olson said in a note to clients on Tuesday.\n\nPiper Jaffray's surveyed 1,500 US Netflix subscribers in September and 72% said they don't plan to subscribe to Disney Plus, while 77% indicated they don't intend to purchase Apple TV Plus. The survey also found that the vast majority of respondents that showed interest in a competing service also plan to keep their Netflix subscription.\n\nRead more: America's No. 1-ranked millennial wealth adviser reveals his 5 definitive tips for young investors\n\nNetflix has shed almost all of its gains for the year over the last few weeks as investors and other Wall Street analysts have expressed concern that streaming competitors will eat into the company's business.\n\n\"Investors are concerned about the potential for market share loss as these services become available,\" Olson said.\n\nHe added that Netflix's current valuation suggests its shares already reflect the increased risk of competition and subscriber volatility.\n\nShares of Netflix are now up less than 1% year-to-date.\n\nRead more: Morgan Stanley breaks down how the next market downturn could upend what even the most prepared investors are expecting\n\nMarkets Insider", "description": "Over the next six weeks, Apple and Disney are set to release their own streaming platforms to compete with Netflix.  According to a survey conducted ...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d94fd734175320cd27b0e10-2400/netflix-stranger-things-scoops-ahoy.jpg"}