{"pub": "telegraph", "url": "https://telegraph.co.uk/football/2019/10/29/granit-xhaka-should-apologise-arsenal-fans-says-unai-emery-captaincy", "downloaded_at": "2019-10-30 00:09:57.632321+00:00", "title": "Granit Xhaka fuels doubt over Arsenal future as Unai Emery tells him to apologise to fans", "language": "en", "text": "Arsenal captain Granit Xhaka has fuelled further doubt over his future at the Emirates by changing his Instagram profile picture from one in which he is sporting the club armband for one of him captaining Switzerland.\n\nThe midfielder had already enraged Arsenal supporters with the angry way he reacted to being substituted last Sunday in the 2-2 home draw with Crystal Palace, gesturing towards the stands when he was booed off, before appearing to swear at fans as he made his way down the tunnel.\n\nXhaka has had an uneasy relationship with Arsenal’s supporters and manager Unai Emery acknowledged the player’s actions last Sunday were wrong but insisted he had been badly affected by the incident.\n\nEmery confirmed the 27-year-old would not be involved in tonight’s Carabao Cup tie at Liverpool, with Mesut Özil due to return.\n\nArsenal have offered the player support and Emery was at pains to point out Xhaka’s well-being should be addressed as a priority before considering the captaincy or the possibility of disciplinary action.\n\n“When we make individual mistakes, we need to make apologies for the circumstances,” said Emery. “I prefer to do that. We suggest to him to do it.", "description": "Arsenal captain Granit Xhaka has fuelled further doubt over his future at the Emirates by changing his Instagram profile picture from one in which he is sporting the club armband for one of him captaining Switzerland.", "authors": ["Ian Winrow"], "top_image": "https://www.telegraph.co.uk/content/dam/football/2019/10/29/TELEMMGLPICT000214341020-xlarge_trans_NvBQzQNjv4BqQsQKkypbxxkGLu6JU8b2QHi2PKU30DeV0BYwgytUyGA.jpeg?imwidth=1200", "published_at": "2019-10-29"}