{"pub": "nytimes", "url": "https://cooking.nytimes.com/recipes/1020004-hasselback-kielbasa", "downloaded_at": "2019-09-10 23:31:43.251580+00:00", "title": "Hasselback Kielbasa Recipe", "language": "en", "text": "This is a no-recipe recipe, a recipe without an ingredients list or steps. It invites you to improvise in the kitchen.\n\nGet a sheet pan ripping hot in a 425-degree oven while you cut up a small onion and a bell pepper, whatever color you prefer. Toss the vegetables in a splash of neutral oil, salt and pepper them, and tip them into a single layer on the hot pan. Allow these to roast in the oven while you cut the kielbasa into thin slices, stopping short of cutting all the way through the meat. You want to end up with a long accordion, basically, or an attenuated pill bug. Now remove the vegetables from the oven, give them a stir, and put the kielbasa on top. Return the sheet pan to the oven and allow everything to roast into crisp softness, 20 to 25 minutes, basting heavily two or three times with a mixture of equal parts apricot preserves and mustard, about 2 tablespoons each. Serve with steamed greens or a fresh baguette. It’ll go fast.\n\nSam Sifton features a no-recipe recipe every Wednesday in his What to Cook newsletter. Sign up to receive it. You can find more no-recipe recipes here.", "description": "This is a no-recipe recipe, a recipe without an ingredients list or steps It invites you to improvise in the kitchen.\n\nGet a sheet pan ripping hot in a 425-degree oven while you cut up a small onion and a bell pepper, whatever color you prefer Toss the vegetables in a splash of neutral oil, salt and pepper them, and tip them into a single layer on the hot pan", "authors": ["Sam Sifton", "Alex Ward", "Mark Bittman", "Melissa Clark", "Alison Roman", "Dorie Greenspan", "Margaux Laskey"], "top_image": "https://static01.nyt.com/images/2019/02/17/dining/17norecipe-hasselback/merlin_147765537_e8710660-abbd-46cb-b785-bafebe6476f8-articleLarge.jpg", "published_at": "2019-02-17"}