{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/is-it-okay-to-use-an-hdtv-as-a-computer-monitor", "downloaded_at": "2019-10-20 03:36:48.251556+00:00", "title": "Is It OK To Use An HDTV As A Computer Monitor?", "language": "en", "text": "Photo: Shutterstock\n\nEvery time I go to buy a new computer monitor, I ask myself the same thing: Why am I doing this? Why not just run everything through the gigantic monitor I already have, otherwise known as my big-arse television?\n\nBlasting your computer’s picture through a television might seem like the best solution on paper, but there are some considerations you should take into account before you cross “a brand-new desktop monitor” off your shopping list. That’s not to say you can’t do this, or do it well; it’s just not a picture-perfect solution that works in all instances.\n\nWhat are you using your computer to do?\n\nTo help you figure out whether you should connect your PC to an HDTV, first consider what you typically do on your PC. A ton of variables factor into your daily use, but chances are you fall into one of two basic categories: a regular PC user or an entertainment user.\n\nDaily might include everything from sending a few emails to working in Photoshop all day, whereas entertainment would mean the bulk of your time is spent watching movies or playing games.\n\nOnce you’ve taken a moment to self-reflect, let’s dig a little deeper into what an HDTV means for these two types of users:\n\nA regular ol’ computer user who doesn’t do a ton of gaming or streaming\n\nIf you spend the bulk of your computer time browsing articles on the internet, reading email, writing, or anything similar, the biggest problem you’ll have with a larger HDTV screen is its resolution.\n\nRemember, when it comes to monitors, resolution matters most. A 32-inch HDTV can sport the same resolution as a 27-inch monitor (assuming they’re both 1080p), but blown up an additional five inches. This makes everything a little fuzzy and not conducive for reading. Go up to a 42-inch 1080p display, and you’re going to hate what you’re staring at — it’ll lack crispness and clarity, and you’ll question your life choices.\n\nThe other problem is ergonomics and the sheer size of an HDTV. You want your eye level lined up about two to three inches below the top of the monitor. This can be difficult with a large screen unless you’re very tall or sit especially high. Plop a 44-inch television on your desk, and you’ll be craning your eyes and head all around to see everything on your digital desktop, which might get real annoying, real fast.\n\nThat all said, there are plenty of instances where YouTube-watchers and programmers alike have turned to an HDTV instead of a traditional computer monitor and had a blast doing so. Here’s what they typically look for:\n\n4K resolution, at minimum\n\n60Hz refresh rate, at minimum\n\nSupport for Chroma 4:4:4 subsampling (to avoid blurry text)\n\nHDMI 2.0 (and the right cables) to achieve all of the aforementioned\n\nLow input lag — a fact you’ll only really be able to test out yourself once you set up the TV. Either read a bunch of reviews for what you’re about to purchase or find a retailer with a strong return policy, in case the lag for things like your mouse movements drives you nuts.\n\nVESA mounting. If you’re slapping a giant TV on your desk, you might want the ability to position it in better spot, rather than sitting on a stand (which might require you to crane your head up a bit).\n\nBuilt-in speakers. This one is optional, but having built-in speakers never hurts if you don’t have an alternative sound setup for your computer.\n\nOn the PC side, you’ll want to make sure your system can output a 4K resolution at 60Hz, at minimum. Your system should be able to do this if you have around a 7th or 8th-generation Intel CPU (if you’re running integrated graphics) or a decent discrete video card — just check the specs and see what it can do (on what connection).\n\nOdds are good you’ll be using HDMI for this, as I wouldn’t expect most modern TVs to come with a DisplayPort connection since most TV manufacturers don’t assume you’re going to be hooking one up to your computer. If you only have DisplayPort on your desktop or laptop, you’ll probably need an active adaptor.\n\nEntertainment\n\nIf you’re looking to game or watch movies on your HDTV-turned-monitor, you have a few extra options (and considerations). Most importantly, you might want to consider using a 4K television as the second monitor in a dual-monitor setup. Hear me out.\n\nIn doing so, you’d be able to keep your primary monitor for everyday use — which means you’ll still be able to have a great experience for web browsing, working on spreadsheets, sending email, or whatever else it is you do. When you switch to movie or gaming mode, you can dump those onto your gigantic, nearby TV.\n\nAssuming you can drag your keyboard and mouse (or controller) to a far-enough-away point, and don’t mind the experience of doing so, I think you’ll enjoy this hybrid approach even more than slapping a 42+ inch TV on your desk.\n\nDepending on what you’re watching (or the size of the text in your games), you might even be able to get away with a television that has lesser specs than what we’ve previously identified. You’re (hopefully) not staring at tiny text on your screen, so maybe the set’s Chroma subsampling might not be as critical. If you’re just watching a lot of movies, you might not care at all about input lag or the television’s refresh rate (if it can’t do 4K at 60Hz, for example).\n\nIf you’re gaming, you’ll definitely care about your set’s input lag and refresh rate — I can’t think of two more important specifications, seeing as you’ll want to have as precise an experience as possible. You also might find that certain games lend themselves to a better experience on your TV than others, so be prepared for potential disappointment if your favourite title doesn’t work as well as you expected for whatever reason — like slightly blurry text, for example.\n\nSince the quality of your picture is more important when you’re watching John Wick or playing Doom Eternal than when you’re working in a spreadsheet, you might also want to consider a television (and a video card / HDMI 2.0a setup) that can support HDR10 for more gorgeous and accurate colours.\n\nThis story was originally published on 2/10/12 and was updated on 10/17/19 with more current information.", "description": "Every time I go to buy a new computer monitor, I ask myself the same thing: Why am I doing this? Why not just run everything through the gigantic monitor I already have, otherwise known as my big-arse television?...", "authors": ["Thorin Klosowski", "David Murphy", "Hayley Williams", "Claire Lower"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/zabs8zzurantuvf8r8nc.jpg", "published_at": "2019-10-20"}