{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/vegan-group-occupy-smithfield-market-demanding-government-ban-meat-10878555", "downloaded_at": "2019-10-07 19:44:47.240463+00:00", "title": "Vegan group occupy Smithfield Market demanding government ‘ban meat’", "language": "en", "text": "The group is demanding that the sale of meat is ended (Picture: Twitter/RebelsAnimal)\n\nA vegan group calling itself ‘Animal Rebellion’ is occupying Smithfield Market in an attempt to ban the sale of meat.\n\nAn offshoot of Extinction Rebellion, the group is demanding the country adopt a ‘plant-based diet’.\n\nThey began their occupation at 5pm today, despite the market being closed and opening between the hours of 2am and 8am.\n\nActivists held a moments silence to ‘remember all the animals whose lives are lost at the market daily’.\n\nThey also held a ceremony to open the ‘plant-based market’ which had been set up by the protestors.\n\nA banner which read ‘Fruit and vegetable market’ was placed at the top of the building.\n\nThose taking part have vowed to occupy the market for the next two weeks.\n\nActivists occupied Smithfield Market earlier today (Picture: Twitter/RebelsAnimal)\n\nProtesters have converted the market to a plant-based market (Picture: Twitter/RebelsAnimal)\n\nSmithfield Market is one of the oldest meat markets in London, and one where activist Dillon Fernando said ‘death and environmental destruction would be bought to an end’.\n\nAdvertisement\n\nAdvertisement\n\nHe added that ‘farming and fishing industries are massive contributors to the climate crisis’.\n\nDillon told LBC: ‘So we’re going to be occupying Smithfield Meat Market overnight, we’re going to be artistically transforming Smithfield to show a vision to the public of what that plant-based food system could look like.’\n\nIt comes as the Metropolitan police said they had arrested a total of 217 people during today’s climate protests by Extinction Rebellion, which the group says will last for two weeks across London.\n\nThe protest coincided with climate protests by Extinction Rebellion in the capital today (Picture: Twitter/RebelsAnimal)\n\nActivists held a moments silence to ‘remember all the animals whose lives are lost at the market daily’ (Picture: Animal Rebellion)\n\nGroups of demonstrators shut down parts of London (Picture: Twitter/RebelsAnimal)\n\nOrganisers blockaded key sites in central London, and held demonstrations outside government departments.\n\nGroups of demonstrators shut down roads around Parliament and Whitehall, with vehicles and bikes, and banners reading ‘tell the truth’ and ‘No coal mines, no fracking’.\n\nSimultaneous protests occurred across the world, including Berlin, Sydney and Amsterdam.\n\nExtinction rebellion says the protests could be five times bigger than those held in April.\n\nThe group is calling on the Government to declare a climate and ecological emergency, to act immediately to halt wildlife loss and to reduce greenhouse gas emissions to net-zero by 2025.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "A group calling itself Animal Rebellion is demanding the country adopt a 'plant-based diet'.", "authors": ["Basit Mahmood"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_88871629_1570472331.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}