{"pub": "arstechnica", "url": "https://arstechnica.com/science/2019/10/a-gas-giant-planet-that-couldnt-have-formed-the-way-jupiter-did", "downloaded_at": "2019-10-05 10:44:25.623507+00:00", "title": "A gas giant planet that couldn’t have formed the way Jupiter did", "language": "en", "text": "One of the difficulties in studying our Earth and the Solar System in which it resides is that you’re generally working with a sample size of one. But astronomy is increasingly loosening that restriction with clearer and clearer pictures of worlds around other stars. Within the wild variety of the cosmos, the rest of our galaxy is looking like an experiment in an infinite laboratory, generating exosolar systems with all sorts of odd combinations of planets. When one of those combinations bucks your prediction, there’s a good chance you’re about to learn something.\n\nA diminutive star tagged GJ 3512, about 31 light years from us, seems to present one of those opportunities. A group of researchers participating in the CARMENES survey has discovered a surprising gas giant planet at least half the size of Jupiter orbiting this wee star.\n\nSmall star, big planet\n\nThe survey scans for planets around small, M-type dwarf stars using Earth-based telescopes. Instead of looking for changes in a star’s brightness as a planet orbits in between, it looks for tiny shifts in the star caused by gravitational tugs from its planets. Just as the familiar Doppler effect causes a siren to rise in pitch as it nears you and lower in pitch after it passes, the star’s movements cause a Doppler shift in the wavelengths of light we receive from it.\n\nNow that we're a few years into the CARMENES project, some planets have completed enough orbits for their clockwork pattern to be apparent in the data. This particular planet—which gets dubbed “GJ 3512 b”—takes 204 days to orbit the star. The data also reveals that its orbit isn’t perfectly circular, taking a fairly elliptical shape, instead.\n\nThe star is estimated to be just 12% the mass of our Sun, and researchers used that value to work out the size of the planet orbiting it and concluded that it must be a gas giant. Despite its gargantuan size, it orbits about as close to its star as Mercury does around the Sun. But because that star is nowhere near as bright as the Sun, planet GJ 3512 b must check in at a numbing -120 degrees Celsius.\n\nBy themselves, the figures aren't that unusual. What makes this exoplanet stand out a bit is that it’s hard to explain how such a large planet could end up orbiting such a small star.\n\nExosolar systems develop from spinning disks of material, with a star growing in the center. The bigger the disk, the more massive the star and the more material available for building big planets. In our Solar System, we've concluded that gas giants like Jupiter formed in a two-step process. First, a rocky core five to ten times the size of the Earth comes together, and then the gravitational pull of that core gathers up enough hydrogen and helium to become truly gigantic.\n\nBut in a small stellar system—like star GJ 3512 would have been born in—there isn’t really enough material for this process to play out. By the time a massive rocky core could form in a stellar disk like that, there wouldn’t be any gas left to gather up.\n\nUnstable\n\nIn the late 1990s, one odd-couple pair of dwarf star and gas giant was identified, but no more had turned up in more recent observations. This new discovery seems to show that this wasn’t a fluke and suggests there must be another way to build a gas giant.\n\nThe researchers point to an alternative planet formation model called “disk instability.” In this model, the process begins early, when the baby star is still a small fraction of the total mass in the disk. Under the right conditions, where temperature is dropping quickly, pockets of gas in the disk could quickly condense directly into large clumps. That could get the proverbial ball rolling early enough to grab a lot of gas before it’s gone.\n\nThis planet’s elliptical orbit, though, also implies something happened after formation. While the researchers could only formally detect one planet, there is a hint in the data of a second one farther from the star that they can’t say much more about. But even beyond that, they posit there could originally have been a third planet in between. If the gravitational dance between the objects in this system led to the middle planet being flung out into interstellar space, the interior planet would be left with a more elliptical orbit in the process.\n\nThis is certainly a different story from the one behind our own Solar System—that’s why it pays to look elsewhere in the Universe.\n\nScience, 2019. DOI: 10.1126/science.aax3198 (About DOIs).", "description": "At about half the size of Jupiter, GJ 3512 b challenges planet formation models.", "authors": ["Scott K. Johnson"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/09/morales4HR-760x380.jpg", "published_at": "2019-10-01"}