{"pub": "realclearpolitics", "url": "https://realcleardefense.com/articles/2019/10/17/why_north_korea_can_and_should_give_up_their_nukes_114795.html", "downloaded_at": "2019-10-18 01:05:29.416894+00:00", "title": "Why North Korea Can, and Should Give Up Their Nukes", "language": "en", "text": "Summary\n\nThe dominant conclusion among the North Korea analyst community is that Kim Jong-un will never give up his nuclear weapons because they are necessary to ensure his regime’s survival. Yet North Korea possesses a significant conventional deterrent capability. If Kim shifts his strategy to focus on other military capabilities to deter an attack, he can negotiate away his nuclear program in exchange for a massive payout in economic benefits. This would prove more beneficial in the long run for North Korea as the true existential threat to the regime is more likely to come internally than from an outside attack.\n\nDeterrence by Punishment\n\nThe typical argument for why North Korea cannot give up its nuclear weapons is that the ruling party needs its demonstrated nuclear capability as a deterrent to ensure it does not face a forced regime change from a South Korean or U.S. attack. In a basic deterrence framework, this is deterrence by punishment. North Korea cannot stop the U.S. and South Korea should they choose to attack (deterrence by denial), but the threat of a North Korean nuclear response would be too devastating for South Korea or the U.S. to accept (deterrence by punishment).\n\nA typical suggestion, then, is that the key to North Korea giving up its nuclear weapons is security guarantees, primarily from the U.S. Guarantees could take the form of a peace treaty to formally end the war, normalized relations, or a series of more incremental measures. But this will always be problematic as it requires trust. North Korea has no reason to believe that any guarantees or agreements will not be scrapped by a future administration or simply fall apart if tensions flare again. One need look no further than the collapse of the 1994 Agreed Framework or the failure of the Six Party Talks. Though North Korea bears significant blame for these breakdowns, they nevertheless highlight how fragile the trust between the U.S. and North Korea can be. Furthermore, the recent trend in both U.S. and South Korean presidents withdrawing from international and bilateral agreements reached under previous administrations indicates that it would be foolish for North Korea to stake its long-term existence on any kind of paper guarantee.\n\nFortunately for North Korea, it can guarantee its own external security even without nuclear weapons. It has long possessed a credible deterrence by punishment capability with conventional artillery and short-range missiles aimed at Seoul, and this capability continues to increase. Projections of the casualties North Korea can inflict on Seoul vary from hundreds of thousands in some of the highest estimates[1] to a more thorough analysis that suggests a low-end estimate in the thousands.[2]\n\nEstimates aside, the fact of the matter is that North Korea in a single volley could launch hundreds of tons of explosives[3] at the greater Seoul area, a densely populated area of more than 25 million people. There currently exists no means to intercept such a barrage, and no amount of sheltering or attempted evacuation from such a congested area could prevent a massive amount of casualties from such an attack. North Korea further augments this deterrence by punishment with ever increasing capabilities in cyber warfare, special operations infiltrators capable of wreaking havoc, and conventional intermediate-range missiles that can strike Japan or U.S. bases in the Pacific.\n\nIt is possible to argue that North Korea’s non-nuclear deterrent is sufficient only to deter South Korea but not the U.S., as South Korea would bear the brunt of the punishment. Yet it seems absurd to posit that the U.S. would sacrifice Seoul for the purpose of striking a non-nuclear North Korea that does not pose an existential threat to the U.S. No party to such a conflict would remain unscathed. In addition to the physical destruction and loss of life throughout the region, all parties must acknowledge the massive cost and disruption a war in Northeast Asia would cause to one of the most economically significant parts of the world.\n\nIn sum, North Korea possesses a sufficient deterrence by punishment array of non-nuclear capabilities to ensure that the U.S. and South Korea do not initiate an unprovoked attack. Unprovoked is a key point, as nothing can save North Korea should it choose to initiate hostilities.\n\nSo North Korea can give up its nuclear program. This is why it should.\n\nNorth Korea can sufficiently ensure no regime change is forced upon it from an outside aggressor, but it must also ensure that regime change does not come from an internal collapse or massive civil unrest. Most of the North Korean population has endured decades of stagnated development and periodic famine. Even today, North Korea ranks dead last in economic freedom,[4] and nearly last on the Global Hunger Index.[5] Meanwhile, the proliferation of more diffuse information technology is providing the North Korean population greater access to contraband media than ever before, which is forcing the Kim regime to expend increasing effort attempting to control information flow to his people. This situation creates the potential for instability and poses a persistent threat to the regime. Against this backdrop, the more significant existential threat to the Kim dynasty comes from within North Korea.\n\nKim Jong-un has promised to boost his country’s economic performance. That requires loosening the stifling sanctions, securing foreign aid, and attracting foreign investment. Kim Jong-un, and his father before him, managed to keep their hermit kingdom afloat with a trickle of aid and trade, primarily from benefactors such as China, while doing their best to skirt sanctions where they could. North Korea exports cheap labor and leverages illicit activities such as drug trade, counterfeiting, and cyber theft to bring in much needed cash. Yet these activities combined will never be enough for North Korea to realize a significant breakthrough in economic development, like so many of their Asian neighbors enjoyed during the twentieth century. In pursuit of that end, Kim Jong-un has emerged onto the international stage to try to make inroads with the global and regional leaders.\n\nWhether or not nuclear weapons are necessary for deterring an attack, nuclear weapons got Kim Jong-un a seat at the bargaining table, and they are his ultimate bargaining chip. Rather than small quid-pro-quo measures, like a moratorium on testing or a temporary dismantling of one facility in exchange for some fuel oil or bags of grain, North Korea could cash in its nuclear chip for an almost unlimited aid, development, and investment package from the surrounding countries, including the U.S.\n\nThe goal of permanent, verifiable denuclearization has built up over the years into a massive prize in the minds of the U.S. and other negotiators. If North Korea can agree to permanent, verifiable measures, it can cash them in, piecemeal if necessary, reaping the economic benefits while continuing to increase its conventional, cyber, special ops, and other deterrent capabilities. This move would go further toward ensuring regime survival than returning to a policy of dangerous nuclear saber rattling that risks miscalculation. It could bring North Korea into the legitimate international community.\n\nConclusion\n\nThe basis of this argument is not new. There has always been a school of thought that suggests nuclear weapons are not necessary for deterrence when conventional power is sufficiently deterring. Yet nuclear weapons have always carried a psychological weight, perhaps greater than their actual utility. Nuclear weapons got North Korea a seat at the negotiating table. While predictions in the past that North Korea was near collapse have always proven false, Kim Jong-un knows that at some point, his small nation must break out of its stifling economic isolation. Now, at a time when South Korea is actively pursuing a policy of engagement toward its northern neighbor, and world leaders, including the U.S. president, are eager to meet with Kim Jong-un, this may be North Korea’s best chance to cash in their nuclear chip for the jackpot payout.\n\nMAJ Peter Murphy (USA), has experience working in Iraq, the Philippines, South Korea, and the Pentagon. He has a bachelor’s degree in History from the University of Michigan, a Master of International Relations from Bond University in Australia, and a Master of Global Affairs and Policy from Yonsei Graduate School of International Studies in Korea. The opinions expressed here are his own and do not represent the U.S government or any other organization.\n\nNotes:\n\n[1] Daniel Davis, (2019). “I Have Fought in War. I Can Tell You Attacking North Korea Is a Mistake,” The National Interest, August 2, 2019, https://nationalinterest.org/blog/buzz/i-have-fought-war-i-can-tell-you-attacking-north-korea-mistake-71141\n\n[2] “How North Korea Would Retaliate,” Stratfor, January 5, 2017, https://worldview.stratfor.com/article/how-north-korea-would-retaliate\n\n[3] Ibid.\n\n[4] “2019 Index of Economic Freedom,” (2019). The Heritage Foundation, Accessed: September 5, 2019, https://www.heritage.org/index/ranking\n\n[5] “2018 Global Hunger Index Results,” Global Hunger Index, Accessed: September 5, 2019, https://www.globalhungerindex.org/results/", "description": "Summary\nThe dominant conclusion among the North Korea analyst community is that Kim Jong-un will never give up his nuclear weapons because they are necessary to ensure his regime\u0092s survival. Yet...", "authors": [], "top_image": "https://assets.realclear.com/images/49/491467_5_.jpg", "published_at": "2019-10-17"}