{"pub": "washingtonpost", "url": "https://washingtonpost.com/entertainment/books/life-lessons-from-a-mole--and-the-man-who-made-a-living-catching-them/2019/10/10/684b7fc6-e945-11e9-85c0-85a098e47b37_story.html", "downloaded_at": "2019-10-14 23:24:32.168707+00:00", "title": "How to Catch a Mole by Marc Hamer book review", "language": "en", "text": "The English gardener and poet Marc Hamer spent much of his adult life catching moles for a living in the Welsh countryside. His wonderful book, “How to Catch a Mole,” is a beautiful, elegiac ode to a remarkable creature. It’s also an exploration of Hamer’s life as he approaches his sunset years. Each page is filled with wonder, love, regret, humility and a sense of wonder (and oneness) with nature.\n\n“Having worked all my life, created a family, discovered a home, I feel as secure as a working-class man ever feels,” he writes. “I feel a sense of equality again with the crow and the toad and the hawthorn, with the rain and wind. I am them and they are me. . . .. I am just another animal, another tree, another wild flower in the meadow among billions of others. . . . There is something deeply magnificent in being just ordinary.”\n\nAD\n\nAD\n\n“How to Catch a Mole,” could be used as a guide to ridding a pest, but it’s first a fine work of nature writing. Like all the classics of the genre — J.A. Baker’s “The Peregrine,” Eugene Marais’ “The Soul of the White Ant” and John Lewis-Stempel’s “Meadowland” — it teaches us to look at the natural world anew, to develop eyes for the overlooked or the unseen. The book also delivers, via its furry central character, some useful life lessons.\n\nA mole can hear a human coming a half-mile away and when its tunnels are breached, it can sense the change in air pressure. Alert! Danger is afoot! “If a mole comes across something it doesn’t like,” Hamer writes, “he either digs it out and pushes it to the surface, or he blocks the tunnel and digs around the problem. Undefeated, he makes more molehills. He is a master of survival strategy, the first rule of which is ‘Take a detour around the dangerous thing.’ ”\n\nClever mole. In “The Wind in the Willows,” he wears glasses for a reason. So a molecatcher needs patience, quietude and shrewdness. These are qualities Hamer has in abundance. At 16, Hamer left home, and over the course of the next 18 months, walked across Britain, honing the skills that make him a superlative mole catcher — invisibility and placidness.\n\nAD\n\nAD\n\nWhen laying a trap, he made the mole’s home appear as undisturbed — and palatable — as possible. “I try hard to give him the world he wants,” Hamer explains, “the one he expects and feels comfortable in.”\n\nThe great sadness of Hamer’s career is that he loves the animals whose lives he ended. “I didn’t enjoy killing, so my methods had to be efficient, detached, fast and technical,” he writes. You get a sense that a small part of him died every time he trapped a mole. But Hamer became a molecatcher to assure himself the work was done humanely.\n\n“In my early days as a gardener I was concerned that the few molecatchers I had come across showed little sensitivity, and that creatures were suffering. Looking back, of course, I have no idea what they felt. I judged them to be brutal men, but I am no different, not any more: the hammer shapes the hand, and I am moulded by the life I chose.”\n\nAD\n\nAD\n\nHamer is retired now. He refuses to kill moles anymore. He will, for a fee, advise people how to do it themselves, though he wishes they’d leave them be, as they do in Germany and Austria, where the European mole is a protected species.\n\nRead Hamer’s wondrous book, then explore your yard. You won’t quite see it the same again.\n\nTimothy R. Smith a former office manager of Book World, just completed a season as a park ranger in Alaska.\n\nHOW TO CATCH A MOLE\n\nWisdom From a Life Lived in Nature\n\nBy Marc Hamer\n\nGreystone. 256 pp. $24.95\n\nAD", "description": "‘How to Catch a Mole’ is a wondrous work that will show you a new way to look at nature — and life.", "authors": ["Timothy R. Smith"], "top_image": "https://www.washingtonpost.com/resizer/PoGgmvVjh_NnyimQL_eHAC3A0q4=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PM3TADHJ3QI6THDNINVA35HTDU.jpg", "published_at": "2019-10-10"}