{"pub": "news.com.au", "url": "https://news.com.au/sport/superracing/the-everest-2019-hugh-bowman-banks-on-godolphins-star-mare-alizee-to-claim-ultimate-prize/news-story/76aadc970392b4863590e450a61aa2bd", "downloaded_at": "2019-10-17 08:06:27.691602+00:00", "title": "The Everest 2019: Hugh Bowman declares Alizee the real deal", "language": "en", "text": "Racing editor Ray Thomas breaks down the 12-strong field that will race The Everest.\n\nCould Winx have won The Everest? You betcha.\n\nWinx’s jockey Hugh Bowman thinks the retired champion would have won the 1200m dash for cash on Saturday had she been kept in training. And her trainer Chris Waller said she could have won the Melbourne Cup (3200m) too had he prepared her for that race.\n\nBowman rode Winx to all 25 of her Group 1 wins and despite the fact she only ran over 1200m or less twice early in her career, he still thinks she would have had the speed to win Australia’s best sprint.\n\n“It’s a philosophical question but obviously she’d go well in The Everest,” Bowman said. “If she was trained for this race she would probably win it.”\n\nStream over 50 sports live & anytime on your TV or favourite device with KAYO SPORTS. The biggest Aussie sports and the best from overseas. Just $25/month. No lock-in contract. Get your 14 day free trial\n\nBut Winx is retired now and The Everest is the only event that will attract more than 40,000 fans to a race day in NSW. Bowman said the jockeys will once again be able to hear the big roar from the crowd of mainly young racegoers as they head into the barriers at 4:15pm.\n\n“Obviously Winx has helped everyone in the industry. She’s moved on to the next stage of her career and The Everest has really taken the ball and kept running,” Bowman said.\n\n“The Everest is its own beast and the interest of the youth around the race is just amazing.\n\n“The racing here in NSW has gone to a new level in the past three or four years and The Everest headlines that.”\n\nBowman has plenty of confidence in his Everest ride, Alizee who jumps from gate 10.\n\nShe’s a Randwick specialist and loves firm ground but he doesn’t want the race to pan out like it has in previous years with Redzel getting things all his own way out in front.\n\n“At the 400m I’d like to be coming off the back of a horse like Yes Yes Yes or Ten Sovereigns,” Bowman said. “I’d like to be no more than four-and-a-half lengths off a horse like Redzel. If that’s the case, we’ll be in business.\n\n“I’d like Santa Ana Lane to be back on my inside waiting for me to go.”\n\nBowman said the five-year-old Sepoy mare was the “perfect horse” for The Everest and he thinks she can produce a devastating finish like the one Santa Ana Lane performed in smashing a similar field in the Group 1 TJ Smith Stakes (1200m) in the autumn.\n\nThe champion jockey has also learnt how best to ride the hulking mare who he combined with two starts ago to win the Group 2 Missile Stakes (1200m) first-up.\n\n“I’ve ridden her at this track and distance (in the Furious Stakes),” Bowman said.\n\n“I was moving my way through traffic and I asked her to stretch out before she was balanced.\n\n“She’s a very big horse. She’s over 600kg, so it’s important that she’s well and truly balanced before you ask her to move and the barrier draw will give me the opportunity to do that.\n\n“I just think she’s the real deal. It’s a strong race but I’m confident she’ll make her presence felt.”\n\nEverest prestige mounts\n\nThe Everest is the richest race in Australia and often promoted that way, but it’s also one of the most prestigious events in just its third year.\n\nThat’s the opinion of Godolphin’s head trainer James Cummings who has Alizee and Trekking in Saturday’s $14 million race after running third with Osborne Bulls last year.\n\nCummings said the worldwide appeal of the Randwick 1200m sprint has elevated its reputation and it’s easily one of the most talked about events on the racing calendar.\n\n“They’re not talking about it just because of the money,” Cummings said. “They are talking about it also due to the status of the race and the challenge.\n\n“There’s pride on the line to be winning a race that is so well-known throughout the world.\n\n“There’s no doubt that the prestige of the race has grown at a rapid rate.”\n\nLast year Coolmore had US Navy Flag come over from Europe to run ninth and this time it’s Ten Sovereigns who adds the international flavour, which is expected to grow.\n\n“Next year we’re hearing about Aethero, the top horse form Hong Kong,” Cummings said. “Even a horse like Blue Point. He didn’t come but those types of horses are winning races overseas then there’s talk about The Everest.\n\n“We have the assembly of the best sprinters in the country and the inclusion this year, and last year, of an outstanding sprinter from abroad.”\n\nAnd Godolphin owner Sheikh Mohammed bin Rashid Al Maktoum will have his eyes glued on the race as his two chances go around.\n\n“He’s passionate for his horses,” Cummings said.\n\n“One thing about Godolphin is that we really stand for pushing ourselves to the limit and thinking outside the square and if this race isn’t that to a tee then I don’t know what is.”\n\nAlizee is the team’s No.1 seed and she’s at attractive odds at $14 considering she loves Randwick, where five of her nine wins have come, and the absence of wet weather has helped Cummings sleep better in the lead up to the race.\n\n“It’s important because she just hasn’t handled the wet so I’m happy I haven’t had to talk about it this week,” Cummings said. “She’s a fast mare and the truth is that it’s going to play a lot more into her hands than the sort of track (heavy) we had 12 months ago.”\n\nSo where does Cummings want his big mare as the field hits the rise at the top of the straight?\n\n“It will depend on the pace but in a perfect worked she’ll be starting to loom and look menacing at that point,” he said.\n\nTrekking is Godolphin’s other runner and he earned his way into the race by winning the Group 2 Schillaci Stakes at Caulfield last Saturday.\n\nThe winner of that race qualified for The Everest through the Melbourne Racing Club’s slot.\n\nThe Stradbroke Handicap winner is a $26 chance and two starts back finished less than 1 ½ lengths off Nature Strip in the Group 1 Moir Stakes.\n\n“Horses can rise to the challenge,” Cummings said. “We did it with Osborne Bulls last year and we’ll be looking to do the same with him. He hasn’t had a quick back up before so he’s got his work cut out from that perspective.”", "description": "Could Winx have won The Everest? You betcha.", "authors": ["Matt Jones"], "top_image": "https://cdn.newsapi.com.au/image/v1/b996a6822ad014bd9ba3598c6fab3cac?width=650", "published_at": "2019-10-17"}