{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/10/28/trumps-newest-impeachment-defense-was-devised-by-al-gore", "downloaded_at": "2019-10-29 02:15:20.107082+00:00", "title": "Trump’s newest impeachment defense was devised by … Al Gore?", "language": "en", "text": "Charles Kupperman, Trump’s former deputy national security adviser, blatantly defied a congressional subpoena Monday, standing up lawmakers who had come to hear his deposition. Instead, he filed a lawsuit saying Trump’s “assertion of immunity against congressional process may override the House subpoena.” Kupperman, the lawsuit said, “is aware of no controlling judicial authority definitively establishing which branch’s command should prevail.”\n\nAD\n\nAD\n\nAnd not so much as a footnote for Gore! What next — Republicans attempting to put impeachment in a lockbox?\n\nIf no controlling judicial authority has answered the question posed by Kupperman, that’s because nobody has had the chutzpah to ask such a question before. Never before has there been such a blanket refusal by an administration to recognize any and all congressional investigative authority. If the Trump White House were to prevail in its argument that current and former advisers to the president are “absolutely immune” from appearing before Congress for any reason, effective congressional oversight of any presidential administration would cease to exist.\n\nThe argument is likely a legal loser; Chief U.S. District Judge Beryl Howell of the D.C. federal court last week smacked down a similarly expansive argument by the administration. But its danger is less as a legal argument than a stall technique: If the Trump administration can block senior administration officials from testifying by keeping the matter in the courts for months, they can dismiss the testimony given by lower-level officials as “hearsay” as they try to outlast the impeachment inquiry.\n\nAD\n\nAD\n\nBut Democrats aren’t about to idle their inquiry for months waiting for Kupperman’s controlling judicial authority to weigh in. Rep. Adam Schiff (D-Calif.), who is leading the inquiry, emerged from the witness-free hearing room after Kupperman’s no-show to say there may be contempt-of-Congress proceedings against Kupperman. “We are not willing to allow the White House to engage us in a lengthy game of rope-a-dope in the courts,” he said.\n\nA few hours later, House Speaker Nancy Pelosi backed up that promise: She announced the House would vote Thursday formalizing the impeachment inquiry to “eliminate any doubt” about the House’s authority.\n\nIt’s not clear that the latest strategy will work better than previous defenses, which have quickly unraveled.\n\nAD\n\nFor the past couple of weeks, for example, the White House and Republicans proclaimed that Gordon Sondland, U.S. ambassador to the European Union, had testified that there was “no quid pro quo” between Trump and the Ukrainian president. But over the weekend, the Wall Street Journal quoted Sondland’s lawyer saying Sondland had testified that he did indeed believe the arrangement was a quid pro quo.\n\nAD\n\nThe administration’s sweeping claims of immunity from testimony, meanwhile, would be the end of decades in which successive administrations found accommodations with Congress. A tally by the progressive group Co-Equal found that over the past seven administrations, five chiefs of staff, nine white House counsels and six national security advisers were among 90 White House officials who testified before Congress regarding alleged misconduct or impropriety. National security officials testified on the Iran-Contra Affair, on presidential brother Billy Carter’s business dealings, on the 9/11 attacks, on Benghazi and more.\n\nNone of those inquiries would have happened, very likely, if the Trump administration’s claims had been the rule. And no inquiry into any president will happen in the future if they prevail now.\n\nAD\n\nYet congressional Republicans defend the administration’s immunity from all. After Kupperman’s no-show in the Capitol for his deposition Monday morning, Rep. Jim Jordan (R-Ohio) came before the cameras to defend Kupperman’s willingness to testify “if the court rules against him.”\n\nAD\n\nThat undermined Kupperman, whose lawsuit claimed he merely sought a legal opinion and wasn’t trying to evade testifying. Jordan quickly retracted his inadvertent admission.\n\nA few minutes later, Schiff said he warned Republicans about such support for the administration’s defiance. “This will not be our last president,” he reminded them.\n\nNo, but this may be the last of anything in U.S. government resembling a controlling legislative authority.\n\nInterested in following Dana Milbank’s take on the impeachment inquiry? Sign up here to receive future installments by email.\n\nRead more:\n\nAD", "description": "Republicans endlessly ridiculed Gore for the clumsy phrase, but now they're using it.", "authors": ["Dana Milbank", "Op-Ed Columnist Covering National Politics"], "top_image": "https://www.washingtonpost.com/resizer/24jR7HsADu7y2er4S6pQpsJO1QU=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SRZ2WEXZZAI6TLEMR3HNFHFG54.jpg", "published_at": "2019-10-28"}