{"pub": "usatoday", "url": "https://usatoday.com/story/tech/reviewedcom/2019/10/30/25-most-popular-october-purchases/3979154002", "downloaded_at": "2019-10-30 23:25:34.447309+00:00", "title": "The 25 products our readers loved most in October", "language": "en", "text": "The 25 products our readers loved most in October\n\nOur readers loved things like Hydro Flask tumblers and convenient egg cookers this October. (Photo: Dash / Hydro Flask)\n\n— Our editors review and recommend products to help you buy the stuff you need. If you make a purchase by clicking one of our links, we may earn a small share of the revenue. However, our picks and opinions are independent from USA Today’s newsroom and any business incentives.\n\nAs we inch closer to the holidays, we like to keep a close eye on what our readers are buying for themselves and for their loved ones. The colder weather tends to send people toward home-cooked meals and the tools they need to make them, like cast iron pots and brilliantly designed strainers, but there were plenty of folks snagging deals on Echo Dots and Apple Airpods and REI and Anthropologie sales on October.\n\nI always love to see how many things I bought or already own among the most popular purchases every month, and this time around only three are already in my arsenal, but items like the snap-on strainer and the neck massager have been on my wishlist for a while. Maybe I'll get on the bandwagon in November!\n\n1. Echo Dots and Amazon Music Unlimited\n\nWhen the Dot is on sale, especially for more than half off, buyers take notice. (Photo: Reviewed / Betsey Goldwasser)\n\nA little over a week ago, Amazon launched an insane deal on the Echo Dot in conjunction with their music streaming service. You could (and still can) get the best value Alexa smart speaker and a month of Amazon Music Unlimited for just $10.98. Considering the Dot alone costs $49.99 and Amazon Music Unlimited is $9.99/month, this is insane. You're effectively getting a Dot for $11 if you decide to cancel the Amazon music service at the end of the first month. And the sale is still going strong!\n\nGet the Amazon Echo Dot (3rd gen.) with 1 month of Amazon Music Unlimited for $10.98 (Save $39.01)\n\n2. Kitchen Gizmo Snap n' Strain Strainers\n\nCooking pasta has never been easier with this gadget. (Photo: Kitchen Gizmo)\n\nThis strainer is a cult favorite among our readers, and among all Amazon shoppers with over 2,300 glowing reviews. Instead of the bulky standalone strainers we're all used to (even though they drive us insane), this one takes up way less space and makes it easier to drain the water from your pasta with one hand. And for just $12, we're not surprised so many people have given it a try.\n\nGet the Kitchen Gizmo Snap n Strain Strainer on Amazon for $11.99\n\n3. InnoGear Aromatherapy Diffusers\n\nThe best essential oil diffuser is already affordable, so when it goes on sale people go bonkers. (Photo: Reviewed / Jackson Ruckar)\n\nAromatherapy diffusers are here to stay, and if you're ready to get in on the trend, we can't recommend the InnoGear enough. We named it the best essential oil diffuser money can buy because it's got an extra-large reservoir (and an automated shutoff option) so you can run it longer than others. Plus, there's been an on-page coupon for it for a while that puts it at the $10 mark, making it a great time to get it for an extra amazing price.\n\nGet the InnoGear Aromatherapy Diffuser on Amazon for $9.99 (with on-page coupon)\n\n4. Apple Airpods\n\nAirpods are on lots of people's wishlists this year, and you can still get them at their sale price. (Photo: Reviewed / Betsey Goldwasser)\n\nIf you want to be at the forefront of style and tech, Airpods are a must, and they've been on sale for a while now on Amazon. Our tester found them to be well worth the full price, despite not wanting to like them at all, and our readers have been taking advantage of the sale price, which is still available now. Will they go on sale for less during Black Friday? We're not 100% sure, but if they do drop lower, it probably won't be a staggering discount from today's price and you might also risk them selling out before you can snag them.\n\nGet the newest Apple Airpods with Charging Case on Amazon for $144 (Save $15)\n\n5. REI\n\nLovers of the outdoors (and indoors) can find great deals at REI's outlet. (Photo: Osprey / Sanuk)\n\nREI is the place to shop if you're the outdoorsy type, whether you enjoy a quiet hike through the woods or you spend your winters on the slopes. They had a handful of really great sales in October, including a sale on their clearance section, and our readers jumped at the chance to score things like Patagonia sweaters, hammocks, weatherproof jackets, backpacks, and more.\n\nThey may not have any sales running right now, but they often have a big discount event in November that comes before Black Friday. (Did you know REI is one of the only retailers that actively does not participate in the biggest shopping holiday of the year? Yep, they give all their employees the day off and run their own sale at a different time.)\n\nCheck out the selection of apparel and sporting goods at REI\n\n6. Maxboost and RAVPower Car Chargers\n\nEither of these chargers will make sure your phone is always juiced up no matter how long your trip. (Photo: Maxboost / Reviewed)\n\nHaving a charger in your car is so essential. You don't want to have a dead phone when you're on a long trip or need to check in with your spouse about last-minute groceries on your way home from work. But really, you don't want to run out of juice and be forced to listen to the regular radio (shudder). Two of our favorite car chargers went on sale in October, with small discounts on each. But considering they're both under $10 already, saving an extra buck or two can make all the difference. We recommend the Maxboost because it has a sturdy metal build but the RAVPower one is extra tiny, which is great if you hate clutter. Both feature two charging ports and work wonderfully to keep you and your passengers charged up.\n\n7. Anthropologie\n\nWe and our readers never miss a sale at Anthropologie. (Photo: Anthropologie)\n\nWhenever we spot an Anthropologie sale, we always try to let our readers snow as soon as possible. Why? You guys love Anthro (and so do we), and their sales are always worth shopping, whether you want a coveted Capri candle or a faux fur throw. Sadly, the Anthro Day sale that ran in mid October is long over, but we're hoping they'll have some great deals in November so you can spoil your loved ones and yourself with some Anthro finds for less.\n\nCheck out the best things to buy at Anthropologie\n\n8. Fire TV Sticks with 4K and Alexa\n\nThe Fire TV Stick is a great way to stream all your shows without the hefty cost of a cable bill on top of everything else. (Photo: Amazon)\n\nDitching your cable bill can be liberating, but doesn't mean you have to go without TV at all. Loads of our readers took advantage of a $15 discount on the Amazon Fire TV Stick in October to stream their favorite shows, and while it's not on sale right now, we can pretty much guarantee Amazon will discount it again for Black Friday. So add it to your wishlist now and you'll get alerted when the price drops.\n\nGet the Amazon Fire TV Stick with 4K and Alexa on Amazon for $49.99\n\n9. Eufy BoostIQ RoboVac 11S and Ecovacs Deebot N79S Robot Vacuums\n\nTwo of our favorite robot vacuums went on sale last month, and our readers took advantage. (Photo: Ecovacs / Eufy)\n\nRobot vacuums are really great, especially now that you can get a good one for under $200. Last month, the Eufy RoboVac 11S, our favorite affordable model, was on sale in the beginning of October for $185, and the Deebot N79S, a smart robot vacuum that used to be our favorite affordable option was on sale for $149 (usually $200). Neither sale is still going now, but both vacuums are still available for discounts, albeit smaller ones.\n\n10. Dash Rapid Egg Cookers\n\nTake the guesswork out of hard boiling your eggs with this handy and adorable egg cooker. (Photo: Dash)\n\nCooking eggs takes practice, patience, and precise timing. It can be a hassle, to be perfectly honest, but this handy device makes it so much easier to soft and hard boil half a dozen at a time. It uses steam to cook eggs and shuts off when the measured water is totally gone, ensuring you won't overcook your eggs. I've had mine for over two years and use it often to batch-cook eggs for snacking, salads, and other recipes. The device can also poach and make omelets in a pinch, but they are not the prettiest or tastiest. But for such a low price, especially when the device went on sale last month, our readers love these egg cookers as much as I do.\n\nGet the Dash Rapid Egg Cooker (Holds 6 Eggs) on Amazon for $19.99\n\n11. Cast iron and nonstick pans\n\nA good frying pan is a must if you want to cook better meals at home. (Photo: Lodge / Calphalon)\n\nWhen the weather turns colder, we tend to see more people buying more cooking products, and October was a big month for cast iron and nonstick frying pans. These are our two favorite options, and each is affordable and works super well, so we're glad so many of our readers upgraded their arsenals.\n\n12. L.L.Bean's Bean Boot sale\n\nWhen Bean Boots go on sale, people freak out. (Photo: L.L.Bean)\n\nL.L.Bean is known primarily for its coveted Bean Boots, and in early October, they had a big sale on them, along with lots of other great apparel. Our readers jumped at the chance to get their own weatherproof boots, flannels, and other fall- and winter-weather gear for 20% off. They don't currently have any sales, but we're certain they will again as we get closer to Black Friday.\n\nCheck out the most popular things to buy from L.L.Bean\n\n13. Scalp Massaging Shampoo Brush\n\nAhhh, now this is the kind of shower treatment you deserve. (Photo: Maxsoft)\n\nWe recently wrote about this bizarre shower accessory in a list of weird but useful finds on Amazon, and our readers were as interested as we were. This scalp massaging brush is designed to work shampoo into your hair while also stimulating your scalp (which can help with new hair growth). Plus, who doesn't like a good head massage, especially for under $10?\n\nGet the Maxsoft Scalp Massager Shampoo Brush on Amazon starting at $6.98\n\n14. Hatchimals Wow LLalacorns\n\nTickle me Elmo has nothing on this guy. (Photo: Hatchimals)\n\nHatchimals have been a hot-ticket holiday toy for the past few years, and this year is no different. These weird Llalacorns are among the most popular toys fo the holiday season, and we think they might sell out well before the holidays. Loads of our readers are already snatching them up early, and if you've got kids on your list who would flip for these, you might want to do the same.\n\nGet the Hatchimals Wow Llalacorn 32-Inch Interactive Toy at Amazon for $67\n\n15. WOW Apple Cider Vinegar Shampoo\n\nThis apple cider vinegar shampoo and conditioner can make your hair really shine. (Photo: Wow Skin Science)\n\nApple cider vinegar is one of those things like coconut oil and kale that touts loads of health benefits and myriad ways to get them. This shampoo and conditioner set is at the top of many people's wishlists and lots of our readers have already taken the plunge. Reviewers claim it has helped them with things like dandruff and other hair issues.\n\nGet the WOW Apple Cider Vinegar Shampoo and Conditioner Set on Amazon for $29.94\n\n16. Nordstrom\n\nOur readers love shopping for cozy cold weather gear like slippers, sweaters, and more. (Photo: Nordstrom and Ugg)\n\nOctober brought us two big sales on popular brands: Sam Edelman and Longchamp. But our readers are also in the gift-giving mood, taking cues from our list of the best gifts for women and getting a jump start on holiday shopping with things like UGG slippers, Lululemon leggings, jeans, sweaters, and more.\n\nShop Nordstrom's sale section for everyday discounts\n\n17. The best can openers\n\nThe best manual can opener makes the little things a little easier. (Photo: Reviewed / Jackson Ruckar)\n\nI don't know about you, but I get so annoyed when I grab a can that doesn't have a pop-top lid. Opening cans the \"old fashioned\" way is a task I'd rather avoid, but sometimes you just have to have those cannellini beans, you know? So it's no surprise that our readers opt for the best manual can opener we've ever tested because it is reliable and affordable.\n\nGet the EZ-DUZ-IT Deluxe Manual Can Opener on Amazon for $9.99\n\n18. Clorox toilet brushes\n\nUpgrade that dirty toilet brush with a more hygienic version. (Photo: Clorox)\n\nVery few of us enjoy cleaning our toilets, but it is a task that simply must be done. Toilet brushes are gross, though, so when we spotted a sale on a Clorox brush with reusable scrubbers, we alerted our readers and they went nuts. This set, which is still super affordable, comes with six disposable brushes, making it easy for you to keep your toilet in primo condition.\n\nGet the Clorox ToiletWand Disposable Toilet Cleaning System on Amazon for $8.88\n\n19. Hydro Flask tumblers\n\nKeep your drinks hot or cold for hours upon hours with a Hydro Flask tumbler. (Photo: Hydro Flask / Urban Outfitters)\n\nHydro Flask makes our favorite water bottle, thanks to superior insulation that can keep ice frozen for over 24 hours (and it keeps hot drinks hot too). Hydro Flask had a sale on its tumblers in October, and our readers jumped at the chance to grow their collection of portable, insulated cups.\n\nBrowse Hydro Flask's selection of insulated tumblers starting at $27.95\n\n20. Eufy smart scales\n\nThis smart scale from Eufy can help track your weight loss and improve your overall health. (Photo: Eufy)\n\nIf you're watching your weight (whether you're looking to lose, gain, or maintain) a smart scale can help you stay on track. Some people like to check in weekly, others daily. But remembering what the scale said can be a challenge. A smart scale will store all that information for you so you can track your progress over time, which helps you see long-term trends even when the scale is bouncing around day in and day out. This one from Eufy is super popular among our readers for its typical affordable price, but a sale last month made it an even bigger draw.\n\nGet the Eufy C1 Smart Scale on Amazon for $29.99\n\n21. Wayfair\n\nYou can always get incredible discounts on furniture, home decor, and more at Wayfair. (Photo: Wayfair)\n\nWayfair is one of our favorite online furniture retailers, thanks to their everyday low prices (compared to brands like Crate & Barrel, at least) and wide selection of styles for every room of the house. This month, they had a big weekend-long sale on their clearance section, and our readers jumped at the chance to score discounts on everything from barstools to end tables to lighting to rugs. And while the sale is over, you can still find great deals on loads of furniture during the fall savings event.\n\nShop the Wayfair Fall Refresh Sale\n\n22. Shutterfly\n\nPrint out your most cherished photo memories with Shutterfly. (Photo: Reviewed / Jackson Ruckar)\n\nShutterfly is one of those services that is always running some discount or other. Our favorite is when they offer up to 50% off, a sale which you can still take advantage of right now with the code UNLIMITED. They're our top recommendation for photo printing services, so we're confident that whether you're printing your Instagram photos for a small frame collage or you're getting things printed on mugs or in photo books, you'll be thrilled with the outcome.\n\nGet your photos printed with Shutterfly and save up to 50% with the code UNLIMITED\n\n23. Zyllion shiatsu neck and back massager\n\nThis gadget is basically a personal masseuse that you can bring anywhere. (Photo: Zyllion)\n\nYou don't have to go to Brookstone or get a pedicure to enjoy a good massage, and our readers decided to take self-care into their own hands in October when this self-heating neck and back massager was discounted in the beginning and at the end of the month for about $10-$15. We haven't tested it, but it's got over 9,000 reviews and 4.4 out of 5 stars, so we're confident you'll be pleased with your purchase whether you want to get one now or wait for the next sale to save a few bucks on this indulgent buy.\n\nGet the Zyllion Shiatsu Neck and Back Massager on Amazon for $44.95\n\n24. Wool dryer balls\n\nThese dryer balls can replace your dryer sheets—what's not to love about that! (Photo: Smart Sheep)\n\nWool dryer balls claim to speed up drying times and reduce static cling in a more sustainable and natural way than dryer sheets. While we've tested the timing aspect and found it to be a negligible difference, the idea of replacing disposable dryer sheets with something reusable and not laden down with chemicals is something we and our readers love.\n\nGet the Smart Sheep Wool Dryer Ball 6-Pack on Amazon for $16.95\n\n25. Nectar mattresses\n\nHave your most peaceful sleep yet knowing that you saved on a brand new mattress. (Photo: Nectar)\n\nNectar makes the mattress that we've ever tested, and while we have not yet tested all the popular brands, we're confident this is a great option for most people. They ran a deal where you could save $100 or more with a minimum purchase of $500 (a.k.a. buy a mattress) in early October that our readers took advantage of. Right now, you can get a free set of pillows or sheets if you buy a mattress, and they will more than likely have bigger sales as we approach Black Friday. So keep your eyes peeled if you're in the market for a new bed.\n\nFind your new mattress at Nectar\n\nThe product experts at Reviewed have all your shopping needs covered. Follow Reviewed on Facebook, Twitter, and Instagram for the latest deals, reviews, and more.\n\nPrices were accurate at the time this article was published but may change over time.\n\nRead or Share this story: https://www.usatoday.com/story/tech/reviewedcom/2019/10/30/25-most-popular-october-purchases/3979154002/", "description": "This October, things like Echo Dots, egg cookers, outdoor apparel, and neck massagers topped the list of our readers' favorite things.", "authors": ["Samantha Gordon", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/30/USAT/f668b524-5b2e-4939-8cf9-7c8a1d88e4c7-october-buys.jpg?crop=994,560,x4,y0&width=1600&height=800&fit=bounds", "published_at": "2019-10-30"}