{"pub": "news24", "url": "https://traveller24.com/Explore/SAHolidayGuide/20-best-ice-cream-shops-in-sa-20151212", "downloaded_at": "2019-10-09 18:51:35.064901+00:00", "title": "SA ice cream parlour named best in the world + 20 top ice cream spots to visit this summer", "language": "en", "text": "YOU MIGHT ALSO LIKE {{item.title}}\n\nSouth African summers are hot. Really hot.\n\nBut thankfully one little ice cream shop in Cape Town has all the gelato cool in world you need to beat the heat. Ranking at number one on the 50 Best Ice Cream Parlours In The World list, is the Mother City's very own Unframed Ice Cream.\n\nThe list was curated by Big 7 Travel, which gives this artisanal ice cream maker - and its healthy ice creams (yes healthy!) made from scratch - the five-scoop nod.\n\nLicc – York, United Kingdom\n\nBang Bang Ice Cream & Bakery – Toronto,\n\nCanadaFRYST – Stockholm,Sweden\n\nGelato Messina Circular Quay – Sydney,Australia\n\nChurn – Phoenix, Arizona,USA\n\nBirds of Paradise Gelato Boutique – SingaporeEmilia Cremeria – Parma,\n\nItalyGiapo – Auckland,New Zealand\n\nShubert’s Ice Cream & Candy – Chico, California, US\n\nCheck out the full list here and let us know which ice-cream parlor is your favorite.\n\nWhat earned Unframed Ice Cream the top spot on the list are their dairy-based, fruit-based sorbets and nut-based vegan options. They also incorporate an array of superfoods as toppings and flavours like their famous “Blue Coconut” made with Blue Spirulina. But if you want the classic flavors, they've got you covered in that department as well.\n\n\n\nWhat’s good: Blue coconut\n\nWhere: V&A Waterfront, V&A Food Market\n\nI scream, you scream, we all scream for...\n\nSo now that we know nothing beats the cool, creamy taste of ice cream in summer - we giving a few more options to indulge your taste buds around SA.\n\n\n\nSo in honour of the humble sugar cones, the swirls of vanilla and strawberry, the bits of caramel crunch and the chocolate coated cups - here are 20+ of the Best Ice Cream parlours across SA.\n\nCape Town & surrounds\n\nSea Breeze Ice Cream\n\n\n\nWhat’s good: Strawberry and Vanilla soft serve\n\nWhere: Beach Blvd, Table View\n\n\n\nSirocco\n\nWhat’s good: Vanilla soft serve\n\nWhere: Empire, 80 Beach Rd, Muizenberg\n\n\n\nThe creamery\n\nWhat’s good: Seasonal flavours, plus cookie dough and sea salt caramel scoops\n\nWhere: 97 Durham Avenue, Salt River OR Shop 4, Newlands Quarter, Dean Street, Newlands OR 163 Beach Road (opposite the maze), Mouille Point\n\nSorbetiere\n\nWhat’s good: All the local flavours like rooibos and lemon or fig and Pinotage\n\nWhere: Side Street Studios, 48 Albert Road, Woodstock\n\n\n\nThe Nice Company\n\nWhat's good: Try their dark chocolate or raspberry or rose flavours\n\nWhere: 46 Bell Crescent, Westlake\n\n\n\nSea Point Promenade Ice Cream shop – Icezeit\n\nWhat's good: The Greek frozen yogurt soft serve\n\nWhere: 397 Sea Point Promenade, Sea Point\n\n\n\nFanny Chanel\n\nWhat's good: Something seasonal\n\nWhere: 7 Church Street, Stellenbosch\n\nIceDream\n\nWhat's good: Try the grapefruit and lemon sorbet\n\nWhere: Main Rd, Hout Bay\n\n\n\nIce Café\n\nWhat's good: Try the liquorice flavour\n\nWhere: Colyn Rd, Kalk Bay\n\n\n\nSinfull Ice Cream Emporium\n\nWhat's good: Choose from flavours like condensed milk, espresso, butter pecan, Turkish delight and more\n\nWhere: Harbour Road, Hout Bay\n\nDon Gelato\n\nWhat's good: Hazelnut & meringue, Zebra (vanilla & Nutella) and plain vanilla with melted chocolate...\n\nWhere: 23 Queen Victoria Street, Stanford and in the V&A Waterfront, Cape Town\n\n\n\n\n\n\n\nDurban\n\n\n\nLegenDairy Handmade Ice Cream\n\nWhat's good: Seasonal flavours are available, but the vanilla bean and toasted meringue remains one of the best\n\nWhere: Freedom Café is amongst a few retailers selling the ice creams\n\n\n\nERA Ice Cream\n\nWhat's good: Try Frida Kahlo's Coffee Liqueur flavour\n\nWhere: Cowey Park, 8 Problem Mkhize Road\n\nScoop Handmade Ice Cream\n\n\n\nWhat's good: The salted caramel flavour is out of this world\n\nWhere: Unit 2, The Litchi Orchard, Seaforth Avenue, Foxhills, Salt Rock\n\n\n\nBallina Ice Cream\n\nWhat's good: The Chilli & Dark Chocolate is amazing... They also have sugar free options\n\nWhere: Lot 75, 6 Impala Ridge Drive, Drummond, Valley of 1000 Hills\n\n\n\nREAD: City Guide: Ice cream wrapped in French macaron shells and Victorian architecture in Durban's Morningside neighbourhood\n\n\n\nOther Coastal Towns\n\n\n\nFriesland Milk Bar - East London\n\nWhat's good: The tutti fruity and butterscotch flavours are delicious... they also make the best milkshakes\n\nWhere: 49 Tennyson Street Quigney, East London, Eastern Cape\n\n\n\nVanilla Dream Ice Cream Parlour – Jeffrey’s Bay\n\nWhat's good: A rum-and-raisin scoop\n\nWhere: 19 Da Gama Rd, Jeffreys Bay, Eastern Cape\n\n\n\n\n\n\n\nInland - Joburg and Pretoria\n\n\n\nRoyal Danish Homemade Ice Cream\n\nWhat's good: Try an old-school soda float\n\nWhere: Corner of Gordon Road and Bernard Street, Pretoria\n\n\n\n\n\nTortellino D’Oro\n\nWhat's good: The sorbets are to die for, as are the Italian classics like Stracciatella (Vanilla & choc chips), Amaretto and Pistaccho\n\nWhere: Oaklands Shopping Centre, Oaklands, Johannesburg\n\n\n\nPaul’s Homemade Ice Cream\n\nWhat's good: Try the White Chocolate & Passion Fruit or Red Velvet flavours\n\nWhere: 5 17th street Orange Grove, Johannesburg\n\n*Compiled by Thutolore Tsatsane\n\nFind Your Escape by signing up for the Traveller24 Weekly Newsletter – Subscribe here. Or download the News24 App here, to receive expertly curated travel ideas and deals directly to your mobile.", "description": "Find the best ice-cream in the world in Cape Town - and they have healthy, yes healthy, options too.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/311/1e989e4be68840908753715b1f192b41.jpg", "published_at": "2019-10-09"}