{"pub": "yahoo", "url": "https://news.yahoo.com/erratic-trump-struggles-control-message-164629117.html", "downloaded_at": "2019-10-08 05:14:38.123215+00:00", "title": "Erratic Trump struggles to control message as impeachment threat grows", "language": "en", "text": "As Donald Trump strived to enforce message discipline among Republicans in the face of a building threat that he will be impeached, new forces beyond the US president’s control appeared likely to accelerate the congressional impeachment inquiry further in the coming week.\n\nAt least one additional whistleblower has stepped forward to describe an alleged scheme by Trump to extort Ukraine for dirt on Democratic 2020 presidential rival Joe Biden, the individual’s lawyer announced.\n\nCongress is preparing to take testimony on Tuesday from a major figure in the Ukraine scandal, Gordon Sondland, a wealthy hotelier and major Trump donor who was made US ambassador to the European Union.\n\nSimilar testimony last week by former US special envoy to Ukraine Kurt Volker led to the disclosure of a damaging series of text messages further implicating Trump in the scandal.\n\nRelated: Trump-Ukraine texts: read the revealing diplomatic messages in full\n\nAnd Trump’s would-be defenders in the Republican ranks, with the notable exception of two figures who themselves are deeply implicated in the Ukraine affair – the US secretary of state, Mike Pompeo, and Trump lawyer Rudy Giuliani – have fallen mostly silent. No Trump defender from the White House appeared on the US Sunday morning news shows, nor did any members of the congressional Republican political leadership.\n\nTrump’s course of self-defense, meanwhile, appeared to be increasingly erratic. The president told House Republicans that his reportedly outgoing energy secretary, Rick Perry, was the secret Machiavelli behind a phone call Trump held with Ukrainian president Volodymyr Zelenskiy, central to the scandal, Axios reported.\n\n“Not a lot of people know this but, I didn’t even want to make the call,” Trump was quoted as saying. “The only reason I made the call was because Rick asked me to.”\n\n\n\n\n\nArticle 1 of the United States constitution gives the House of Representatives the sole power to initiate impeachment and the Senate the sole power to try impeachments of the president. A president can be impeached if they are judged to have committed \"treason, bribery, or other high crimes and misdemeanors\" – although the constitution does not specify what “high crimes and misdemeanors” are.\n\nThe process starts with the House of Representatives passing articles of impeachment. A simple majority of members need to vote in favour of impeachment for it to pass to the next stage. Democrats currently control the house, with 235 representatives.\n\nThe chief justice of the US supreme court then presides over the proceedings in the Senate, where the president is tried, with senators acting as the jury. For the president to be found guilty two-thirds of senators must vote to convict. Republicans currently control the Senate, with 53 of the 100 senators.\n\nTwo presidents have previously been impeached, Bill Clinton in 1998, and Andrew Johnson in 1868, though neither was removed from office as a result. Richard Nixon resigned in 1974 before there was a formal vote to impeach him.\n\nMartin Belam\n\n\n\n\n\nA spokesperson said that Perry had urged Trump to speak with Ukraine about natural gas but not about Joe Biden and his son Hunter Biden, or a conspiracy theory about Ukrainian election tampering, which were the topics Trump raised on the July call.\n\n“Lesson to all of you Trump aides,” tweeted Neera Tanden, president of the liberal Center for American Progress, “he’s taking you all down with him so you might as well get off the boat while you can.”\n\nAfter a week in which his campaign seemed to dither over Trump’s constant attacks, Biden published a pugilistic op-ed in the Washington Post declaring “enough is enough”. “You won’t destroy me, and you won’t destroy my family,” the piece concluded. “And come November 2020, I intend to beat you like a drum.”\n\nOn Sunday afternoon, Biden criticized Trump on Twitter.\n\nIn my experience, asking a foreign government to manufacture lies about your domestic political opponent is not “done all the time.” https://t.co/w8K8C17yUj — Joe Biden (@JoeBiden) October 6, 2019\n\nNews of at least one more whistleblower with direct knowledge of Trump administration interactions with Ukraine emerged Sunday. “I can confirm that my firm and my team represent multiple whistleblowers in connection to the underlying 12 August disclosure to the Intelligence Community Inspector General,” tweeted Andrew Bakaj. “No further comment at this time.”", "description": "Republican defenders mostly silent, with two vivid exceptions, as at least one additional whistleblower steps forward Trump’s course of self-defense, meanwhile, appeared to be increasingly erratic. Photograph: Brendan Smialowski/AFP via Getty ImagesAs Donald Trump strived to enforce message discipline", "authors": ["Tom Mccarthy In New York"], "top_image": "https://s.yimg.com/uu/api/res/1.2/moA3nmy3EAH6jf9ObffXvw--~B/aD0zMDA7dz01MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/the_guardian_765/acd917ef3f5a63943728267de6241934", "published_at": "2019-10-06"}