{"pub": "guardian", "url": "https://theguardian.com/technology/2019/sep/27/facebook-to-hide-number-of-likes-in-trial-aimed-at-improving-users-wellbeing", "downloaded_at": "2019-09-26 23:47:04.844287+00:00", "title": "Facebook to hide number of likes in trial aimed at improving users' wellbeing", "language": "en", "text": "Social media giant said the move was backed by anti-bullying and mental health groups\n\nSome Facebook users will soon no longer see the number of likes, reactions and video views on other’s posts in a world-first trial aimed at boosting users’ wellbeing.\n\nInstead, likes will be private and only visible to the post’s author in a change that follows a similar test on Instagram which started in July in Australia. The new Facebook trial, which begins on Friday, will also kick off in Australia.\n\nFacebook Australia’s director of policy Mia Garlick said the change was based on wellbeing research and feedback from mental health professionals that the number of likes can cause social comparison.\n\n“We’ve had really positive feedback from a lot of the anti-bullying groups and mental health organisations that we work with,” Garlick said.\n\n“It really is just taking that number out of the equation, so that people can focus on the quality of their interactions and the quality of the content rather than on the number of likes or reactions.”\n\nMay I have a word about… Facebook claiming the word ‘book’ | Jonathan Bouquet Read more\n\nIt’s hoped that people will be more comfortable with sharing on the platform rather than feeling like it’s a competition, she said.\n\nGarlick assured businesses who rely on Facebook they will still receive all the same metrics and insights they previously accessed.\n\nShe said it was too early to say if the test would roll out to other countries like Instagram’s trial has in Australia, Canada, Brazil, New Zealand, Japan, Italy and Ireland.\n\nAs with Instagram, which is owned by Facebook, there is no indication of when the trial will end or if the change will be made permanent.\n\n“We have had some initial positive feedback from the public about the experience [on Instagram], but we’re still just learning and listening to feedback at this stage,” she said.\n\nOn being the world’s training ground Garlick said Australia has very active “tech-savvy” users of Facebook and Instagram.\n\n“We think this is a great country where we can get some really good feedback about whether this is a valuable experience for people on our services or not.”", "description": "Social media giant said the move was backed by anti-bullying and mental health groups", "authors": ["Australian Associated Press"], "top_image": "https://i.guim.co.uk/img/media/e689cc02058627e4109089f5114534ce21675005/3_0_5572_3346/master/5572.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=58571facb4285329f910b5cf91559b31", "published_at": "2019-09-26"}