{"pub": "fox", "url": "https://foxbusiness.com/lifestyle/coca-cola-beats-quarterly-revenue-mark-as-coffee-product-grows", "downloaded_at": "2019-10-19 12:29:27.895491+00:00", "title": "Coca-Cola that's good to the last drop? Soft drink-maker infuses signature brand with java", "language": "en", "text": "Coca-Cola Plus Coffee and its zero-sugar alternative are part of a growing diversification of beverages that have helped the company boost sales.\n\nContinue Reading Below\n\nThe infusion of Brazilian coffee beans into the signature soft drink is available in over 25 international markets after successful trial runs dating back to 2017.\n\n\"Internationally, a scaled launch of Coca-Cola Plus Coffee in more than 20 markets with a diligent consumer focus, consistent messaging and an integrated execution plan has driven strong performance,\" the Atlanta-based company said. International success hasn't led Coca-Cola to commit to bringing the product to the United States, however, according to a company spokeswoman.\n\nThe market for carbonated soft drinks declined 1.6 percent annually from 2012 to 2017, according to a bevindustry.com report, and brands have responded with a variety of strategies. As consumers drink less sugary sodas and look for healthier alternatives, beverage companies have had no choice but to adjust their product lineups.\n\nBut Coca-Cola topped Wall Street's sales expectations in Friday's third-quarter earnings report, bumping its stock 2 percent higher on the back of a changing product development strategy. Revenue grew 8 percent for the Atlanta-based beverage giant.\n\nStocks in this Article KO COCA-COLA COMPANY $54.78 +0.99 (+1.84%)\n\n\"Our performance gives us confidence that our strategies are taking hold with our consumers, customers and system,\" CEO James Quincey said in a statement. \"We are positioning the company to create a better shared future for all of our stakeholders.\"\n\nCoke's move toward smaller cans, lower caloric intake without sacrificing taste and low-sugar offerings, such as sparkling water beverages, have helped boost earnings, according to the company.\n\nThe largest contributor to retail value growth was the flagship U.S. market, driven by continued double-digit volume gains in Coca-Cola Zero Sugar, in addition to strong growth in smaller packages, led by double-digit growth in 7.5-ounce mini cans.\n\nCoca Cola Plus Coffee is the company's second attempt at blending the two drinks together under its flagship brand name. The predecessor, Coca Cola Blāk, launched internationally in 2006, but failed to catch on and was discontinued two years later.\n\nGlobal coffee consumption is growing at 5.5 percent a year, according to Mordor Intelligence. And after Starbucks and Kraft-Heinz, which owns the Maxwell House brand among others, Mordor ranked Coca-Cola as the third-largest global player in the coffee market.\n\nThe Coke Plus Coffee product family packs slightly more caffeine than a regular can of Coke, but still clocks in under what a traditional cup of coffee contains. A typical 8-ounce cup of coffee has 95 to 165 milligrams of caffeine. and a typical 8-ounce serving of cola has 24 to 46 milligrams, according to the Mayo Clinic.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nIn a further expansion of its coffee enterprise, Coca-Cola closed its $5.1 billion acquisition of England-based Costa Coffee, which was announced last August, earlier this year. Costa joins Coca-Cola's extensive family of non-soda brands, including Dasani, Odwalla and Honest Tea, that target the ever-growing base of health-conscious consumers.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "Coke-and-coffee is proving itself a surprise growth engine for the over-performing beverage giant.", "authors": [], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/Coca-Cola-Plus-Coffee-001-1.jpg?ve=1&tl=1", "published_at": "2019-10-18"}