{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/22/google-picks-up-microsoft-veteran-javier-soltero-to-head-g-suite", "downloaded_at": "2019-10-22 13:19:37.768598+00:00", "title": "Google picks up Microsoft veteran, Javier Soltero, to head G Suite – TechCrunch", "language": "en", "text": "Google has hired Microsoft’s former Cortana and Outlook VP, Javier Soltero, to head up its productivity and collaboration bundle, G Suite — which includes consumer and business tools such as Gmail, Hangouts, Drive, Google Docs and Sheets.\n\nHe tweeted the news yesterday, writing: “The opportunity to work with this team on products that have such a profound impact on the lives of people around the world is a real and rare privilege.”\n\nSome news on the professional front… I’ve joined Google to lead the G Suite team! The opportunity to work with this team on products that have such a profound impact on the lives of people around the world is a real and rare privilege. I’m excited to get to work. pic.twitter.com/D0lMY81PXv — Javier Soltero 🇵🇷 (@jsoltero) October 21, 2019\n\nSoltero joined Microsoft five years ago, after the company shelling out $200M to acquire his mobile email application, Acompli — staying until late last year.\n\nHis LinkedIn profile now lists him as vice president of G Suite, starting October 2019.\n\nSoltero will report to Google Cloud CEO Thomas Kurian — who replaced Dianne Green when she stepped down from the role last year — per a company email reported by CNBC.\n\nPreviously, Google’s Prabhakar Raghavan — now SVP for its Advertising and Commerce products — was in charge of the productivity bundle, as VP of Google Apps and Google Cloud. But Mountain View has created a dedicated VP role for G Suite. Presumably to woo Soltero into his next major industry move — and into competing directly with his former employer.\n\nThe move looks intended to dial up focus on the Office giant, in response to Microsoft’s ongoing push to shift users from single purchase versions of flagship productivity products to subscription-based cloud versions, like Office 365.\n\nThis summer Google CEO, Sundar Pichai, announced that its cloud business unit had an $8 billion annual revenue run rate, up from $4BN reported in early 2018, though still lagging Microsoft’s Azure cloud.\n\nHe added that Google planned to triple the size of its cloud sales force over the next few years.", "description": "Google has hired Microsoft’s former Cortana and Outlook VP, Javier Soltero, to head up its productivity and collaboration bundle, G Suite — which includes consumer and business tools such as Gmail, Hangouts, Drive, Google Docs and Sheets. He tweeted the news yesterday, writing: “The opportunity to work with this team on products that have such […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2015/10/486234008.jpg?w=599", "published_at": "2019-10-22"}