{"pub": "thehill", "url": "https://thehill.com/policy/cybersecurity/466950-officials-say-foreign-governments-should-not-investigate-presidential", "downloaded_at": "2019-10-23 08:32:48.688067+00:00", "title": "Officials say foreign governments should not investigate presidential political opponents", "language": "en", "text": "Federal officials from the FBI, the Department of Homeland Security (DHS) and the Election Assistance Commission (EAC) said Tuesday that they did not support the idea of a foreign government investigating political opponents of President Trump Donald John TrumpTrump says he doesn't want NYT in the White House Veterans group backs lawsuits to halt Trump's use of military funding for border wall Schiff punches back after GOP censure resolution fails MORE.\n\nHouse Judiciary Committee Chairman Jerrold Nadler Jerrold (Jerry) Lewis NadlerDem committee chairs blast Trump G-7 announcement Top Democrat holds moment of silence for Cummings at hearing Barr to speak at Notre Dame law school on Friday MORE (D-N.Y.) questioned witnesses at a committee hearing on election security about whether they thought it was “appropriate for the president of the United States to ask a foreign government to investigate his political opponent in the 2020 elections.”\n\nWitnesses including Matthew Masterson, DHS’s senior cybersecurity advisor; Nikki Floris, the deputy assistant director for counterterrorism at the FBI; and EAC Vice Chairman Ben Hovland all answered “no.”\n\nAdam Hickey, the deputy assistant attorney general within the Justice Department’s National Security Division, was the only witness to not answer \"no,\" instead saying he did not “comment on the president’s activities” but that the Justice Department is “committed to confronting violations in the law wherever we find them.”\n\nNadler’s question referred to the subject of a House impeachment inquiry into Trump, which was launched by House Speaker Nancy Pelosi Nancy PelosiOvernight Health Care — Presented by Partnership for America's Health Care Future — Four companies reach 0M settlement in opioid lawsuit | Deal opens door to larger settlements | House panel to consider vaping tax | Drug pricing markup tomorrow Schiff punches back after GOP censure resolution fails Trump urges GOP to fight for him MORE (D-Calif.) last month after Trump allegedly pressured Ukrainian President Volodymyr Zelensky to investigate former Vice President Joe Biden Joe BidenTrump says he doesn't want NYT in the White House Warren to protest with striking Chicago teachers Schiff punches back after GOP censure resolution fails MORE’s son Hunter Biden during a late-July phone call.\n\nADVERTISEMENT\n\nQuestions about the impeachment inquiry at times overshadowed the overall hearing on election security. This is the second time the House Judiciary Committee has formally held a hearing on the issue this year.\n\nRep. Debbie Lesko (R-Ariz.) asked the witnesses a similar question to Nadler's, questioning them on whether “it is appropriate for the president to ask a foreign government to investigate previous election interference” in order to find if there was “something unlawful happening” in other countries.\n\nMasterson said he believed it’s “appropriate to understand any attempts at interference in our elections so that we can continue to build resilience in the process,” while Hovland said he was in favor of “election officials having the information they need to prepare for future elections.”\n\nThe witnesses also discussed the state of election security ahead of 2020, saying that while federal agencies are much better prepared to face interference threats than in 2016, there is more that can be done and more teamwork between agencies is needed to confront foreign threats.\n\n“Combating malign foreign influence operations requires a ‘whole of society’ approach that relies on coordinated actions by Federal, State, and local government agencies; support from the private sector; and the active engagement of an informed public,” Hickey said.\n\nHovland praised the efforts of state and local election officials to increase election security and resiliency ahead of 2020 but pleaded with the committee to provide consistent federal funding to bolster election security efforts going forward.\n\n“The threat of foreign adversaries remains real and, ultimately, our state and local election officials do not have the resources to thwart a truly determined and sophisticated nation-state actor,” Hovland said.\n\nThe EAC was appropriated $380 million by Congress in 2018 to give to states to increase election security, with both the House and Senate now considering giving between $250 million and $600 million to states for the same purpose during the upcoming fiscal year.\n\nDHS’s Masterson, who previously served as an EAC commissioner, said he was “confident” these combined funds would “allow us to maintain that level of support to ensure election officials have what they need as they head into election day.”\n\nThe FBI’s Floris added that she was “confident that we are throwing every tool we have against the threat to our election security.”\n\nElection security has continuously been in the spotlight over the past several months after the release of former special counsel Robert Mueller Robert (Bob) Swan MuellerFox News legal analyst says Trump call with Ukraine leader could be 'more serious' than what Mueller 'dragged up' Lewandowski says Mueller report was 'very clear' in proving 'there was no obstruction,' despite having 'never' read it Fox's Cavuto roasts Trump over criticism of network MORE's report on Russian election interference efforts in 2016 and two reports from the Senate Intelligence Committee on the same issue.\n\nMueller found that Russian operatives launched a sweeping campaign to interfere in the 2016 U.S. elections through hacking and social media disinformation efforts, with the intention of swaying the election results in favor of rump.\n\nThe Senate Intelligence Committee’s most recent report on social media disinformation concluded that these efforts were directed by the Kremlin.", "description": "Federal officials from the FBI, the Department of Homeland Security (DHS) and the Election Assistance Commission (EAC) said Tuesday that they did not support the idea of a foreign government investigating political o", "authors": [], "top_image": "https://thehill.com/sites/default/files/nadlerjerrold_092419gn_lead.jpg", "published_at": "2019-10-22"}