{"pub": "breitbart", "url": "https://breitbart.com/asia/2019/10/30/china-urges-hong-kong-to-abandon-saboteur-rogue-protest-leader-joshua-wong", "downloaded_at": "2019-10-30 16:07:43.556358+00:00", "title": "China Urges Hong Kong to Abandon 'Saboteur' Joshua Wong", "language": "en", "text": "China and its state propaganda outlets praised Hong Kong on Wednesday for banning youth protest leader Joshua Wong from running for local office for being an immoral “rogue” out to “destroy Hong Kong society.”\n\nWong, the secretary-general of the pro-freedom Demosisto movement, has become one of the most prominent voices against the growing threat of communist rule over his home city. Wong joined protests against a law granting Beijing the ability to ban candidates from the ballot in 2014 at the age of 17, having championed democracy in Hong Kong since the age of 14. Now, at 23, the law that triggered the 2014 Umbrella Movement is keeping him from campaigning for a spot on his local district council.\n\nHong Kong’s electoral authority announced Monday that it would take the unprecedented measure of banning Wong from running because it was insufficiently convinced that Wong did not support independence for Hong Kong. Hong Kong law bans individuals who have publicly supported independence from running for office.\n\nWong says he does not support independence but, rather, the self-determination of the people of Hong Kong under “One Country, Two Systems” – the policy both China and Hong Kong agreed to when British rule ended in 1997. The policy prevents Hong Kong from seeking sovereignty in exchange for China agreeing not to impose communist laws on the city.\n\nThe current protest movement erupted in June, as Wong was completing a jail sentence for his peaceful participation in the 2014 protests. Millions in Hong Kong took to the streets that month, and continue to do so, demanding China stop attempting to overtake the Hong Kong legal system. The protesters are making five demands: the withdrawal of a bill granting China extradition powers in Hong Kong, freedom for political prisoners, an end to calling protesters “rioters,” an independent probe into police brutality, and direct election of lawmakers.\n\nChief Executive Carrie Lam granted one of these: the withdrawal of the extradition bill.\n\nThe Communist Party’s Hong Kong and Macau Affairs Office applauded Wong’s disqualification on Wednesday, accusing him of challenging “One Country, Two Systems.”\n\nWong “repeatedly grovelled to foreign powers for sympathy and begged for interference” and “proclaimed the viewpoints of so-called ‘self-determination’ and ‘Hong Kong independence’ and publicly denied that Hong Kong is a part of China,” a statement on the office’s website read, according to the Hong Kong Free Press (HKFP). “We express approval and support of this decision.”\n\nThe Global Times, China’s largest English-language propaganda newspaper, hurled a barrage of insults at Wong in an editorial titled, “Disqualifying Joshua Wong Is a Law-Based Righteous, Reasonable Decision” Wednesday.\n\n“Wong has no bottom line in morality. Although he is young, he is a political extremist and rogue,” the Global Times proclaimed. “[W]hat he does every day is to try to get rid of Hong Kong’s Basic Law and turn the city into an anti-China fortress manipulated by the U.S.”\n\n“How can Wong, a man who has used his full strength to attack the political system in Hong Kong and stood against the country by publicly relying on the political forces of the U.S. and the West, have no shame to participate in the election in Hong Kong to become part of the political system?” the editorial asked, going on to call Wong a “saboteur” who wants to “push Hong Kong into the arms of the U.S. and the West.”\n\nThe Global Times also published a story citing pro-Communist Party “experts” who implored Hong Kong to “abandon people like Wong who gain political capital by ruining the public order and flattering the foreign anti-China forces.”\n\n“Hong Kong can only achieve good democracy by excluding separatists and rioters like Wong out of its power system,” one “expert” claimed. “People like Wong will destroy Hong Kong society. If they enter the power system of Hong Kong, Hong Kong’s future will be even more shadowed.”\n\nWong joined his first protests at age 15 against the Chinese government’s attempts to overrun the Hong Kong educational system and teach loyalty to the Communist Party. By 2014, he was actively involved in the Umbrella Movement’s attempts to prevent the Communist Party from choosing candidates for elections, limiting Hong Kong voters’ choices at the ballot. He is an avowed pacifist who has advocated for non-violent resistance against communism and accountability for police who brutalize protesters with impunity.\n\nDemosisto, the movement organization Wong helps run, advocates for “democratic self-determination,” which it defines as “the city’s political and economic autonomy from the oppression of the Communist Party of China (CPC) and capitalist hegemony.” China uses the veneer of capitalism – through powerful millionaires loyal to the Party – to control Hong Kong’s government; special interests appoint half of the city’s lawmakers.\n\nIn his statements to the election commission, Wong did not advocate for sovereignty for Hong Kong. According to the commission, when asked if he did, he noted that communist dictator Xi Jinping made it illegal to do so.\n\n“The decision to ban me from running office [sic] is clearly politically-driven,” Wong wrote on Twitter following the ban on his campaign. “The so-called ‘reasons’ is judging subjectively on my intention to uphold Basic Law. But everyone would know that the true reason is my identity, Joshua Wong, is the crime in their mind.”\n\nPrior to his ban, the election official in charge of approving his candidacy, Dorothy Ma, mysteriously took indefinite “sick leave,” leaving him the only person applying for candidacy in district elections with no confirmation on his status on the ballot.\n\nSpeaking to Germany’s Deutsche Welle following the ban, Wong insisted that he “of course” does not support Hong Kong independence.\n\n“I have every reason to believe Beijing issued the order … I firmly believe that the question of whether the govenrment disqualifies me does not depend on my political agenda,” he said. “That’s why the crime is not self-determination nor the pursuit of Hong Kong’s independence, which of course I do not support.”\n\n\"My crime is simple, it's my name being Joshua Wong,\" the 23-year-old pro-democracy activist told DW, after he had been disqualified from running in Hong Kong's district council elections. pic.twitter.com/Dj0tjoKiWY — DW News (@dwnews) October 29, 2019\n\nDuring his press conference to address his disqualification, a small group of communist agitators attempted to drown out Wong’s statements by shouting “Han traitor!”, a reference to his race. The protesters did not clarify who Wong was betraying the Han Chinese for, though the Global Times insults appear to indicate he is betraying them for the America and the West by opposing communist rule.\n\nA group of pro-Beijing protesters chanted: “Han traitor! Shut up!” as @joshuawongcf spoke to the media about his election ban on Tuesday. Full story: https://t.co/kn9hhHsXit @demosisto #hongkong pic.twitter.com/WaDiOeWkWW — Hong Kong Free Press (@HongKongFP) October 29, 2019\n\nWong is currently campaigning for Kelvin Lam, another member of the protest movement, who is running in Wong’s stead in the South Horizons West district.\n\nWong received significant support from members of the Congress in the United States, who disparaged China for violating his rights.\n\n“Barring Wong from running in elections that are already rigged by Beijing is a sign of Communist China’s weakness and fear,” Sen. Rick Scott (R-FL) said on Twitter Tuesday.\n\n“Singling out and banning [Joshua Wong] from running in the upcoming District Council election is another blow against rule of law in Hong Kong and the principle of ‘One Country, Two Systems,'” House Speaker Nancy Pelosi wrote.\n\nCongress is currently considering the Hong Kong Human Rights and Democracy Act to protect the protest movement against communist repression; the bill enjoys wide bipartisan support.\n\nFollow Frances Martel on Facebook and Twitter.", "description": "China and its state propaganda outlets praised Hong Kong on Wednesday for banning youth protest leader Joshua Wong from running for office.", "authors": ["Frances Martel"], "top_image": "https://media.breitbart.com/media/2019/10/Joshua-Wong-640x335.jpg", "published_at": "2019-10-30"}