{"pub": "marketwatch", "url": "https://marketwatch.com/story/moviepass-is-shutting-down-heres-how-the-remaining-movie-ticket-subscription-plans-compare-2019-09-16", "downloaded_at": "2019-09-16 23:15:11.055640+00:00", "title": "MoviePass is shutting down — here’s how the remaining movie-ticket subscription plans compare", "language": "en", "text": "After struggling for months, MoviePass has finally been shut down.\n\nMoviePass’ parent company, Helios & Matheson Analytics HMNY, -22.22% , announced late last week that the movie-ticket subscription service would be shuttered as of Saturday.\n\nBefore Helios & Matheson acquired it roughly two years ago, MoviePass had just 20,000 subscribers. But the service quickly expanded to 3 million subscribers after cutting its monthly fee from up to $50 to just $9.95. For that price, MoviePass users could see one movie a day at most theaters nationwide.\n\nOver time, MoviePass tweaked its subscription service as it struggled to stay solvent. The company found itself quickly running out of money as ticket purchases outpaced subscription fees.\n\nThe popularity of MoviePass quickly attracted competition. Another subscription service, Sinemia, expanded its operations from Europe to the United States on the heels of MoviePass’ initial success. But Sinemia too eventually encountered financial trouble, and ended its U.S. operations earlier this year.\n\nEven as services like MoviePass and Sinemia have gone out of business, the model they created lives on. Movie theater chains like AMC AMC, -0.42% and Regal CINE, +0.62% created their own movie-ticket subscription services that continue to operate.\n\nRead more: These are the worst tippers in America\n\nFor cinephiles, the big catch with the movie theaters’ own subscription services is that they are designed to restrict where people see movies.\n\n“They’re really running a loyalty program,” said Bruce Nash, president of Nash Information Services and publisher of The Numbers, a movie-industry data website. “They want to get the same person to go back to the same theater over and over again and get you to have a relationship with them, much like with airlines.”\n\nHere are how the remaining subscription plans stack up:\n\nRegal Unlimited\n\nThe newest subscription plan on the block, Regal Unlimited is closely modeled after the unlimited movie-ticket programs previously offered by MoviePass and Sinemia.\n\nWith the Unlimited program, members can see as many movies as they want as many times as they want. The program is broken up into three price tiers, based on the number of participating theaters.\n\nThe cheapest plan costs $18 per month plus tax and gives the member access to around 200 theaters nationwide. The most expensive plan costs $23.50 per month plus tax and gives customers access to all Regal theaters.\n\nAdditional surcharges will apply if people with the lower-tier plans purchase tickets at theaters that aren’t included in their plan and for premium seating tickets. Unlimited members can also see ScreenX, 4DX, IMAX, RPX, 3D and VIP screenings for an additional fee.\n\nThe plan is tied to a person’s Crown Club account — those who are not already members of Regal’s loyalty program must sign up to get an Unlimited subscription. The subscription can only be purchased through the Crown Club mobile app.\n\nIn addition to movie tickets, the program also gives members a 10% discount on all food and non-alcoholic drink purchases and a free large popcorn and soft drink on their birthdays. Users can earn loyalty credits for every dollar spent with their Unlimited subscription.\n\nThere are some catches to the program. When you enroll, you must commit to a full years’ worth of membership, even if you choose to pay on a monthly rather than annual basis. Monthly plans automatically renew each month until they are cancelled, whereas annual plans are automatically cancelled after one year. Therefore, those who sign up for an annual plan must purchase another plan after one year or switch to the monthly plan.\n\nWhen it comes to purchasing tickets, members can buy them for same-day movies or make reservations ahead of time. Members are limited to three advance reservations at a time, but can still purchase same-day tickets if they’ve used up all their advance reservations.\n\nYou also have to submit of photo of yourself for Regal to use to verify that no one else attempts to purchase tickets with your account. The subscription can also only be active on one mobile device at a time. People who switch mobile devices multiple times could see their service interrupted or cancelled.\n\n(Regal did not respond to a request for comment.)\n\nAMC Stubs A-List\n\nAMC’s program is one of the oldest on this list, debuting back in June 2018.\n\nThe key difference between Regal’s program and AMC’s is that AMC members can only see three movies per week. Weekly benefits reset every Friday morning, so if someone sees three movies over the course of the weekend, they won’t be able to use their A-List allotment until the following Friday. If someone reserves a ticket using their A-List account but doesn’t show up for the movie, it still counts as one of their three movies for that week.\n\nAnd unlike Regal, the minimum commitment for AMC’s program is only three months, and there is no annual subscription option.\n\nThe cost of AMC Stubs A-List varies depending on where a person lives and wants to see movies. For $19.95 per month, a member can see movies in 34 states. The price goes up to $21.95 per month to see movies in all states except California, Connecticut, Massachusetts, New Jersey and New York. The $23.95-per-month plan is valid for all 50 states.\n\nThe membership entitles users to see movies at any AMC location in those states, including Dolby Cinema and Imax screenings.\n\nLike Regal, there are no blackout dates, and account holders can earn 10% back on food and drink purchases. Subscription holders can purchase same-day or advance tickets, but are limited to three reservations at a time. Tickets can be bought online or through the mobile app.\n\nAMC also limits the subscription benefits to the person who signs up for the account, and theater employees will ask to see photo ID to ensure the correct person is using the account. Account holders can earn AMC Stubs points for the money spent on their subscription fees.\n\n(AMC did not respond to a request for comment.)\n\nAlso see: This state’s average household now owes $10,175 in credit card debt\n\nAlamo Drafthouse Season Pass\n\nAlamo Drafthouse, the theater chain famous for its wide selection of food and beverages and in-seat waiter service, is currently beta testing its own subscription service, called Season Pass, in select cities across the country. The membership plan is expected to roll out at Alamo’s locations nationwide by the end of year.\n\nLike the offerings from Regal and AMC, Alamo’s plan is built off its loyalty program, Alamo Victory, and people must be members of that program before signing up for Season Pass.\n\nWith Season Pass, members can see one movie a day, every day. Tickets can be booked up to seven days in advance. The plan is reportedly set to cost $20 per month. An additional $1.99 fee applies to see 3D movies. Online convenience fees also apply for tickets booked in advance.\n\nUnlike Regal and AMC, the plans can be set up to include multiple people. Up to four “Extra Seats” can be added to the monthly Season Pass subscription. The main account holder’s name will be the only one on the account, and they must be present whenever the plan is used to procure tickets. However, the extra seats can be used for anyone.\n\nAlamo has a strict no-show policy, so if Season Pass members don’t show up for a movie they reserved, they could be barred from making advance reservations. And if you choose to cancel your Season Pass subscription, you may be barred from subscribing again for a year. Theater employees will ask to see ID to ensure the account holder is present for movie reservations — those caught cheating could have their subscriptions cancelled.\n\n(Alamo did not respond to a request for comment.)\n\nCinemark Movie Club\n\nThe most bare-bones of all the subscription services, this program entitles members to one ticket to a 2D movie each month for a monthly fee of $8.99. After that, they can purchase two additional tickets at $8.99 each. However, the program also includes 20% off concessions, which can add additional savings.\n\nIf they are unused, the monthly credits roll over and are even redeemable for up to six months after a consumer chooses to cancel his or her membership. Credits are applied to members’ Cinemark accounts and can be redeemed in person, online or in the Cinemark mobile app.\n\nAnd unlike other programs, Cinemark Movie Club CNK, +0.05% members are not locked into a contract, meaning they can cancel at any time.", "description": "Cinema buffs looking for cheap ways to see movies in theaters still have options.", "authors": ["Jacob Passy"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GL264_amc062_ZG_20180620171603.jpg", "published_at": "2019-09-16"}