{"pub": "financialpost", "url": "https://business.financialpost.com/news/economy/these-are-the-worlds-best-and-worst-pension-systems", "downloaded_at": "2019-10-22 13:25:17.790860+00:00", "title": "Canada ranked among top 10 pension systems in world — but we only got a B", "language": "en", "text": "The Netherlands and Denmark have the best pensions systems in the world, according to a global study that shines a light on how nations are preparing aging populations for retirement.\n\nThe countries took the top two slots in the Melbourne Mercer Global Pensions Index published Monday, both earning an A grade for the level of financial security provided in retirement. Australia came in third, with a B+ grade, while the top 10 was rounded out with Finland, Sweden, Norway, Singapore, New Zealand, Canada and Chile all on B.\n\nThe survey of 37 nations, which covers almost two-thirds of the world’s population, uses 40 metrics to assess whether a system leads to improved financial outcomes for retirees, whether it is sustainable and whether it has the trust and confidence of the community.\n\nThe Netherlands again took the top spot in 2019 with most workers benefiting from defined benefit plans based on lifetime average earnings. The U.K. and the U.S. both earned a C+ grade, coming in 14th and 16th place respectively. Both could boost their scores by raising the minimum pension for low-income pensioners, according to the report.\n\nJapan came in at No. 31 and was ranked with a D — a grade that reveals “major weaknesses and/or omissions that need to be addressed.” A key recommendation included raising the state pension age as life expectancy continues to increase in the nation. Thailand was in the bottom slot and should introduce a minimum level of mandatory retirement savings and increase support for the poorest, the report said.\n\nThe study comes as policy makers grapple with more people entering retirement, living longer and needing a steady flow of income on which to survive. Almost one-fifth of the world’s population is forecast to be of retirement age by 2070, up from about 9 per cent this year, United Nations data show.\n\n“Systems around the world are facing unprecedented life expectancy and rising pressure on public resources to support the health and welfare of older citizens,” said David Knox, the report’s author and senior partner at Mercer. “It’s imperative that policy makers reflect on the strengths and weaknesses of their systems to ensure stronger long-term outcomes for the retirees of the future.”\n\nWhile retirement systems in many Asian nations improved from last year the report found they lack transparency and workers aren’t saving enough for retirement compared to their global peers.\n\nThe study also explores the so-called wealth effect — the tendency for spending to increase with rising wealth. Mercer found that as pension assets increase, people feel wealthier and are more likely to borrow.\n\n“Such an outcome is not a bad thing,” Knox said in the report. “The assurance of future income from existing pension fund assets enables households to improve both their current and future living standards.”\n\nBloomberg.com", "description": "The U.K. and the U.S. both earned a C+ grade, coming in 14th and 16th place respectively", "authors": ["Matthew Burgess", "Bloomberg News"], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/cpp.jpg", "published_at": "2019-10-21"}