{"pub": "afr", "url": "https://afr.com/property/residential/australia-s-super-rich-population-to-grow-by-20-per-cent-20191001-p52wjd", "downloaded_at": "2019-10-05 06:19:53.577401+00:00", "title": "Australia's super-rich population to grow by 20pc", "language": "en", "text": "Australia's billionaire population is projected to grow by a further 14 per cent to 49, with Sydney hosting 11 of these individuals.\n\nThe rise in the ultra-wealthy has come off the back of resilient stock and bond markets, as well as the strong long-term property price growth, Knight Frank head of research Michelle Ciesielski said.\n\nMore than a third (35 per cent) of the total wealth of Australia's super-rich is derived from residential property. Each owns, on average, three residential homes.\n\nBy the end of 2019, one in six of the super-rich is likely to have bought a second or third home in Australia.\n\nMs Ciesielski said that strong population growth in the ultra-wealthy and millionaire segments and their buying intentions will continue to fuel demand for prime real estate around the country.\n\n\"The ultra-rich are not necessarily just looking for one home to live in, they tend to have the main family home, the city pad and country estate,\" she said.\n\nTech billionaire Mike Cannon-Brookes, who already owns Australia's most expensive home, recently splurged $14.5 million on a 155-hectare farm in the NSW Southern Highlands.\n\nAdvertisement\n\nLooking ahead, Ms Ciesielski said the prime residential market was poised to see a healthy, sustainable growth despite the global economic headwinds that could potentially impact on business confidence.\n\n\"We think the prestige market still has further growth to be had. There remains a buoyancy in the local prime market indicators,\" she said.\n\nKnight Frank is forecasting a 2 per cent rise in Sydney's prime residential price by the end of 2019, with a potential to add 3 per cent in 2020.\n\nMelbourne is expected to grow by 1 per cent while Brisbane is set to grow by 3 per cent over the period.", "description": "Sydney will remain the largest city for people with a net wealth over $US30 million, says report.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.1412%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_12/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/f57ff6da6bb4cabb7851c7e6037489d52abe081a", "published_at": "2019-10-01"}