{"pub": "fox", "url": "https://foxnews.com/auto/gorilla-glass-ford-f-series-windshield", "downloaded_at": "2019-09-27 16:23:27.036874+00:00", "title": "First Gorilla Glass Ford F-Series windshield is ready for the rough stuff", "language": "en", "text": "A new Michigan company has an idea for how to make your truck a little tougher.\n\nHyperformance Glass Products has introduced a Gorilla Glass windshield for the Ford F-Series that it claims is five times stronger than the factory equipment. HGP is a consumer-focused spinoff of Polymer Process Development, which is a business-to-business firm that specializes in glass encapsulation for various applications that include solar and automotive.\n\nThe windshield features a three-layer construction with conventional soda lime glass on the outside, Corning Gorilla Glass on the inside and a sound and energy-absorbing layer of polyvinyl butyral (PVB) in between.\n\nWith a starting price of $899 before installation, which is two to three times more than many replacement windshields, it’s not cheap. But sales and marketing V.P. Scott Kolinski said the design allows minor chips to be repaired like with any window and that it comes with a two-year replacement warranty for normal damage caused by stones, etc. (Just don’t try hitting it with a bat, or throwing a brick at it to test it out.)\n\n2020 FORD F-SERIES SUPER DUTY CLAIMS ALL THE DIESEL TOWING TITLES\n\nFord already uses a Gorilla Glass windshield and engine cover on its $450,000 GT supercar, but the HGP product was independently developed. It is compatible with most versions of the latest aluminum body F-Series, including the Super Duty models. Kolinsky said it offers benefits to both recreational and commercial and truck owners.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nHGP chose the F-Series to launch with because of how popular it is, but Kolinski said it will add 10 to 15 new products in the coming year, including windshields for other pickups and muscle cars, and that side and rear windows are also in the works.\n\nThe company will be revealing more at its booth at the SEMA aftermarket parts show in Las Vegas this November.\n\nFOLLOW FOX NEWS ON FACEBOOK FOR MORE AUTOMOTIVE NEWS", "description": "Five times stronger than standard.", "authors": ["Gary Gastelu", "Gary Gastelu Is Foxnews.Com'S Automotive Editor. Follow Him"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/glass.jpg", "published_at": "2019-09-27"}