{"pub": "reuters", "url": "https://af.reuters.com/article/sportsNews/idAFKBN1WJ1F5-OZASP", "downloaded_at": "2019-10-04 13:14:25.822732+00:00", "title": "Ashwin puts India on top after Elgar, de Kock hundreds", "language": "en", "text": "(Reuters) - Dean Elgar and Quinton de Kock struck commanding hundreds to author South Africa’s spectacular fightback before Ravichandran Ashwin wrested back India’s control with a five-wicket haul on the third day of the opening test at Visakhapatnam on Friday.\n\nSouth Africa's Dean Elgar in action. REUTERS/Mike Hutchings\n\nElgar was out for 160 after completing his 12th hundred in tests while Quinton de Kock made 111 as South Africa reached 385 for eight at close, 117 runs behind the hosts’ first innings score of 502 for seven declared.\n\nLate in the day, Ashwin, who had picked up two wickets on Thursday, completed his 27th five-wicket haul in tests with figures of 5-128 to put the hosts back on top.\n\nAfter South Africa resumed on a precarious 39-3, India would have expected their spin duo of Ashwin and Ravindra Jadeja to produce quick wickets but their only success in the first session came from experienced fast bowler Ishant Sharma.\n\nTemba Bavuma was out leg before for 18 to the lanky paceman who got the delivery to curl back in viciously and hit the batsman’s pad, reducing the touring side to 63-4.\n\nA massive first innings deficit stared in South Africa’s face, bringing back memories of a 3-0 series defeat on their last tour of India, but the 32-year-old Elgar had other ideas.\n\nThe left-handed batsman added 115 for the fifth wicket with captain Faf du Plessis to launch South Africa’s rearguard action in the morning before going on to compile a counter-punching stand of 164 for the sixth with de Kock to keep India at bay.\n\nElgar, who was unbeaten on 27 overnight, displayed nimble footwork against the spinners and was not afraid to take the aerial route to score runs as he hit 18 fours and four sixes in his knock.\n\nHe reached his century in style by hitting Ashwin over the midwicket boundary with a slog sweep and followed it up with an emotional celebration.\n\nElgar had a lucky escape when wicketkeeper Wriddhiman Saha, making a comeback to the Indian side after an injury-induced lengthy absence, failed to hold on to a catch on 74 off Jadeja.\n\nHe was finally dismissed when Cheteshwar Pujara completed a smart running catch to give Jadeja his 200th wicket in tests.\n\nIndia also missed an opportunity to dismiss de Kock for seven with Rohit Sharma flooring a sharp chance at close in off spinner Hanuma Vihari.\n\nThe wicketkeeper-batsman made full use of the reprieve, producing the fireworks with a stroke-filled innings during which he hit 16 fours and two sixes.\n\nThe 26-year-old hit one of those sixes off Ashwin to bring up his fifth test hundred but the off-spinner had his revenge when he disturbed his wickets with a straight delivery.\n\nDu Plessis looked fluent at the crease and used the sweep shot well to neutralise the spinners, hitting eight fours and a six in his innings of 55 before he was caught by Pujara at leg slip off Ashwin, who also dismissed Vernon Philander.", "description": "Dean Elgar and Quinton de Kock struck commanding hundreds to author South Africa's spectacular fightback before Ravichandran Ashwin wrested back India's control with a five-wicket haul on the third day of the opening test at Visakhapatnam on Friday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191004&t=2&i=1437024841&w=1200&r=LYNXMPEF930XZ-OZASP", "published_at": "2019-10-04"}