{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/20/trump-says-he-target-partisan-whistleblower", "downloaded_at": "2019-09-20 22:57:43.746935+00:00", "title": "Trump says he is target of 'partisan' whistleblower, Joe Biden deserves scrutiny instead", "language": "en", "text": "President Trump said Friday his private conversations with foreign leaders are “always appropriate,” responding to allegations of what he called a “partisan whistleblower” who has accused him of making an inappropriate promise to the president of Ukraine.\n\n“I do not know the identity of the whistleblower,” Mr. Trump told reporters during an Oval Office meeting, calling the report a “ridiculous story.”\n\n“It’s just another political hack job,” the president said.\n\nAsked if he discussed Democratic presidential front-runner Joseph R. Biden with Ukraine’s president in a July phone call, Mr. Trump responded, “It doesn’t matter what I discussed.”\n\nThe issue reportedly involves Mr. Biden’s son, Hunter, and his position as director of a Ukrainian gas company while his father was serving as vice president.\n\nMr. Biden urged Ukraine in 2015 to fire its top prosecutor who had been investigating the gas company, with the threat of withholding $1 billion in U.S. aid. The former vice president even boasted about his actions in a speech last year, although he said he forced the issue because the Ukrainian prosecutor wasn’t doing his job properly.\n\nMr. Trump reportedly urged Ukrainian President Volodymyr Zelensky “about eight times” to cooperate with his personal lawyer Rudy Giuliani on investigating Hunter Biden, the Wall Street Journal reported Friday.\n\nMr. Giuliani said on CNN “of course” he pressured Ukraine to investigate Hunter Biden. He tweeted that a “President telling a Pres-elect of a well known corrupt country he better investigate corruption that affects US is doing his job.”\n\nMr. Trump said Mr. Biden’s role in the episode deserves more scrutiny by the media.\n\n“Somebody ought to look into Joe Biden because it was disgraceful, where he talked about billions of dollars that he’s not giving to a certain country, or let’s say certain prosecutors taken off the case,” Mr. Trump told reporters. “Somebody had to look into that and you wouldn’t, because he’s a Democrat and the fake news doesn’t look into things like that. It’s a disgrace.”\n\nAsked to confirm whether the conversation with the foreign leader was the July 25 phone call with Mr. Zelensky, Mr. Trump replied, “I really don’t know.”\n\nThe inspector general for the U.S. intelligence community received a complaint from a whistleblower in August, and reported later that the complaint was a credible and urgent matter. Congressional Democrats complained Thursday that acting Director of National Intelligence Joseph Maguire won’t turn over the complaint to lawmakers.\n\nHouse Speaker Nancy Pelosi said Friday the situation presents “grave, urgent concerns for our national security.”\n\n“If the president has done what has been alleged, then he is stepping into a dangerous minefield with serious repercussions for his administration and our democracy,” she said. “The president and acting DNI’s stonewalling must end immediately, and the whistleblower must be provided with every protection guaranteed by the law to defend the integrity of our government and ensure accountability and trust.”\n\nShe pledged Friday to explore “every possible option” in getting at the truth, urging Republicans to join Democrats in “supporting the Constitution.”\n\nA House Democratic leader and member of the Judiciary Committee, Rep. David Cicilline of Rhode Island, warned Mr. Trump Friday that lawmakers would consider impeachment for refusing to turn over the whistleblower’s complaint.\n\n“This is deadly serious,” Mr. Cicilline tweeted. “If the President does not allow the whistleblower complaint against him to be turned over to Congress, we will add it to the Articles of Impeachment.”\n\nMr. Trump is scheduled to meet with Mr. Zelensky next week at the United Nations General Assembly in New York.\n\nOn Sept. 12, the U.S. agreed to release $250 million in military aid to Ukraine.\n\n“I had conversations with many leaders, they’re always appropriate at the highest level,” the president said. “Anything I do, I fight so strongly for this country. It was a totally appropriate conversation.”\n\nThe president also slammed the U.S. news media for having a bad week, after press reports raised more unsubstantiated allegations against Supreme Court Justice Brett M. Kavanaugh.\n\n“It’s another media disaster, and the media has lost so much credibility in this country, our media has become the laughingstock of the world,” the president told reporters. “You’re a joke.”\n\nMr. Trump taunted reporters about the whistleblower story: “Keep playing it up because you’re going to look really bad when it falls … keep asking questions and building it up as big as possible because you can have a bigger downfall.”\n\n• Tom Howell Jr. contributed to this story.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "President Trump said Friday his private conversations with foreign leaders are \"always appropriate,\" responding to allegations of what he called a \"partisan whistleblower\" who has accused him of making an inappropriate promise to the president of Ukraine.", "authors": ["The Washington Times Http", "Dave Boyer"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/20/Trump_US_Australia_State_Visit_40451.jpg-81539_c0-219-5242-3275_s1770x1032.jpg?2fa89390179d578f542d227f1df019b2f7b3511d", "published_at": "2019-09-20"}