{"pub": "yahoo", "url": "https://sports.yahoo.com/mlb-gpp-pivots-tuesday-9-175144109.html", "downloaded_at": "2019-09-17 23:24:38.133191+00:00", "title": "MLB GPP Pivots: Tuesday 9/17", "language": "en", "text": "Welcome to the MLB GPP Pivots article, where we’ll be looking to uncover some sneaky-good DFS plays away from the popular lifts. These recommendations are usually risk/reward commodities meant to be used in large-field tournaments. Typically, blending these low-owned hidden gems with well-aligned staples contributes to a viable GPP strategy.\n\nKeep in mind that the following player write-ups were constructed earlier in the day, and sometimes injury/rest situations can alter the fantasy landscape. Monitoring our MLB News & Headlines Feed throughout the day will keep you in the loop while giving you the subsequent DFS consequences of each information piece.\n\nWe will be looking at the 14-game main slate beginning at 7:05 ET.\n\nScroll to continue with content Ad\n\nPITCHER\n\nAdam Plutko - Cleveland (vs. Detroit)\n\nPlutko isn’t the sneakiest of fantasy pitchers tonight, as a matchup with the lowly Tigers makes him somewhat obvious. However, I’ll be looking towards the Cleveland right-hander for a non-imposing salary in order to squeeze those high-priced bats into my lineup. Detroit ranks near the bottom in almost every hitting category this season, and they have a historically bad offense - especially for an American League team. Plutko notched nine strikeouts through 5.2 innings (3 hits, 1 ER) against the Tigers on August 23, and I’m expecting him to come up big for the Tribe in this must-win tilt.\n\nCATCHER / FIRST BASE\n\nAustin Nola - Seattle (at Pittsburgh)\n\nStory continues\n\nThere are seemingly infinite options at first base tonight, as Pete Alonso, Freddie Freeman, Jose Abreu, Carlos Santana, and Matt Olson all find themselves with confident matchups. However, let’s not forget about Austin Nola of Seattle, who checks in with a much friendlier price tag. The hitting environment at PNC Park isn’t great, but Nola has been heating up after a sweet 4-5, 2 RBI showing on Sunday. He’s a multi-hit candidate while facing Pittsburgh RHP Mitch Keller, who has allowed 20 earned runs across 25 innings over his last five appearances.\n\nSECOND BASE\n\nJurickson Profar - Oakland (vs. Kansas City)\n\nOakland checks in with a relatively high run-scoring projection, but most DFS enthusiasts will look towards stacks from the Mets, Rockies, Twins, or Red Sox before considering the A’s. Profar makes for a sneaky-good lift within that underrated stack, stepping in as a switch-hitter against Kansas City RHP Jorge Lopez’s .366 wOBA split to left-handed bats. Profar hasn’t done much over the past week, but he’s fully capable of upside displayed by three homers over a five-game span in late August.\n\nTHIRD BASE\n\nHunter Dozier - Kansas City (at Oakland)\n\nDozier is another player with a capable skillset, strong matchup, and budget-friendly salary. He’ll likely be underrated due to an uninspiring recent game log, but let’s keep in mind that the Kansas City third baseman is having a career season with 26 homers, 82 RBIs, and a respectable .286 average. He’ll hold the platoon advantage over mediocre Oakland LHP Brett Anderson, who has allowed a ton of contact with 34 hits compared to 20 strikeouts through 33 innings over his past six starts.\n\nSHORTSTOP\n\nBrandon Crawford - San Francisco (at Boston)\n\nCrawford has been a fantasy flop this season while holding a .231 average with 11 homers and 55 RBIs. His salary has dropped to near-minimum levels as a result, but I’m interested in a buy-low opportunity this evening. Crawford and his teammates will notice a substantial park shift in hitter-friendly Fenway Park, instantly enhancing their upside. The matchup isn’t bad either, facing Boston RHP Nathan Eovaldi and his 5.81 ERA.\n\nOUTFIELD\n\nDwight Smith Jr. - Baltimore (vs. Toronto)\n\nThis game has numerous tournament options from both sides, but Dwight Smith Jr. catches my eye as a boom-or-bust commodity. Smith made several appearances in this article series towards the beginning of the season, and he’s back on track after collecting five hits, one double, one triple, two runs, and two RBIs over his past three starts. The park factor in Baltimore should help, as does the matchup against Toronto RHP Trent Thornton’s .344 wOBA split to left-handed bats.\n\nAdam Engel - Chicago White Sox (at Minnesota)\n\nI’m not a believer in Minnesota LHP Martin Perez, who has struggled since the month of May. Perez carries a vulnerable .362 wOBA split to right-handed bats, and the White Sox have several quality sluggers to take advantage. Jose Abreu, Yoan Moncada, Tim Anderson, and Eloy Jimenez come to mind, but don’t forget about Adam Engel in this spot. Engel is heating up with seven hits, three homers, and five RBIs over his last five starts, and this is an excellent spot to throw some fuel on that fire.", "description": "Spencer Limbach finds some sneaky-good MLB GPP Pivots away from the popular picks for Tuesday, September 17. (Getty Images)", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/1lBZc6CNB5whN.BsOb_ZAw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTguOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/VmzUiw6P56r.yOfij_1WAg--~B/aD0xMTMyO3c9MjAxNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/rotoworld.com/ac350bf633cea1e11d840ed6565cacc5", "published_at": "2019-09-17"}