{"pub": "businessinsider", "url": "https://businessinsider.com/conservative-party-risks-going-into-opposition-for-very-long-time-2019-9", "downloaded_at": "2019-09-30 10:50:29.564388+00:00", "title": "Boris Johnson's Conservatives risk going into opposition for a 'very long time,' warns a senior member of his government", "language": "en", "text": "MANCHESTER, ENGLAND — The Conservatives risk going into opposition \"for a very long time,\" a senior member of Boris Johnson's government has said.\n\nSpeaking at a fringe event at Conservative party conference on Sunday evening, Justice Secretary Robert Buckland warned that Johnson's party will struggle to get back into government if it is booted out at the next general election.\n\n\"That election is coming. If we do not get more bums on those seats in the House of Commons then we will be in minority, we will be in opposition for a very long time indeed,\" Buckland told party members.\n\nRead more: Rebel Conservatives torpedo prospect of replacing Boris Johnson with Jeremy Corbyn to stop Brexit\n\nJohnson wants to hold a general election as soon as possible but Labour and other opposition parties have refused to support holding one until the prime minister delays Brexit to avoid a no-deal exit on October 31.\n\nBuckland warned that a Labour victory at the next election, which is expected to take place in the next few months, would allow leader Jeremy Corbyn to implement radical left-wing policy \"very quickly.\"\n\nBuckland takes a dig at 'unaccountable' figures in Johnson's team\n\nThe member of Parliament for Swindon South also appeared to take a swipe at Dominic Cummings, the controversial chief advisor to Johnson, and other \"unaccountable\" members of the prime minister's top team.\n\nCummings is a hugely influential figure in Johnson's administration and is widely-believed to be responsible for a large share of quotes which are reported in the media and attributed to government sources.\n\nThe justice secretary criticised people in Johnson's team while defending British judges, who have recently been in the spotlight after the Supreme Court ruled that Johnson's decision to suspend Parliament for five weeks was illegal.\n\n\"Whatever one thinks about the merits of decisions that are made, one iron rule has to apply, we have an independent judiciary, we have respect for the rule of law,\" Buckland said.\n\n\"That is what your Lord Chancellor will do time and time again, without worrying about the politics of it. Without worrying about what Number 10 [Downing Street] might say.\"\n\nHe added: \"My word is the law, not some unaccountable person who might be saying something off record.\n\n\"What I say and what the prime minister says matters far more than anything else.\"\n\nBuckland was a guest speaker at a reception hosted by the Tory Reform Group of moderate Conservatives, where Culture Secretary Nicky Morgan was also a speaker.\n\nDominic Grieve, who Downing Street recently sacked as a Conservative MP after voted to stop a no-deal Brexit, was also in attendance.", "description": "Justice Secretary Robert Buckland warned that the Conservatives will struggle to get back into government if they lose the next election.", "authors": ["Adam Payne"], "top_image": "https://amp.businessinsider.com/images/5d91d6692e22af41d711caf2-960-480.jpg", "published_at": "2019-09-30"}