{"pub": "metro", "url": "https://metro.co.uk/2019/10/09/an-iconic-rainbow-90s-brand-just-threw-up-all-over-this-hotel-suite-10888076", "downloaded_at": "2019-10-09 12:08:23.913114+00:00", "title": "An iconic rainbow 90s brand just threw up all over this hotel suite", "language": "en", "text": "Stay in the Hotels.com Lisa Frank Flat (Picture: Hotels.com)\n\nFed up with beige-washed minimalist interiors that look like they’ve been plucked right off a Pinterest board? Well, Hotels.com is now offering the antithesis to neutral tones.\n\nThe accommodation site has joined forces with 90s brand Lisa Frank to create a nostalgic room of rainbow.\n\nA penthouse suite at Barsala in Los Angeles has been kitted out with custom Lisa Frank merch.\n\nSome highlights include the oh-so-extra canopy bed plus desk equipped with your younger self’s stationery dream of rainbow pencils, stickers and notebooks.\n\nWe think we love it … even if the entire suite does look like it’s been attacked with a pack of highlighters.\n\nThe desk of your younger self’s dreams (Picture: Hotels.com)\n\nThe bathroom is where it gets wet and wild, with the splash palace resembling the tie-dyed aquarium from your dreams … or nightmares.\n\nThis bathroom is essentially your own aquarium (Picture: Hotels.com)\n\nIf the 90s was more of a grungy time for you, here’s the low down on Lisa Frank. The concept is rainbow. Rainbow everywhere.\n\nAdvertisement\n\nAdvertisement\n\nThe American brand freakin’ owned the realm of 90s school supplies and stickers, creating a range of multi-coloured, psychedelic products to carve out your trippy little identity with.\n\n‘Over the past four decades, Lisa Frank fans have grown up enjoying our art in many forms,’ said the Lisa Frank team.\n\n‘Many of them now book hotel rooms for themselves and their families, and we are excited to partner with Hotels.com to be able to offer this immersive Lisa Frank experience.’\n\nSpeaking of immersive, the mini-bar is hella loaded with classic American 90s junk food including Fun Dip, Air Heads, Pixy Stix, Gushers and Cheez Balls.\n\nYou can even keep a piece of your vibrant stay. You’re welcome to cart off the limited edition Lisa Frank plush robes, eye masks and slippers.\n\nYes, you’ll have all the makings of a slumber party you can host for your pals who missed out on the penthouse.\n\nA stay will set you back $199 (£163) a night.\n\nIf you’d like to call dibs on this pad, you’re going to need to pop your hair in a scrunchie, feed that Tamagotchi, then trot over to Hotels.com when reservations open on Friday, 11 October.\n\nAdvertisement Advertisement", "description": "A penthouse at the Barsala in Los Angeles has been kitted out with custom Lisa Frank merch, and you can spend the night there.", "authors": ["Serena Coady"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_89105901_1570620690.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-09"}