{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/schneider-electric-commits-s16m-to-build-singapore-firms-with-global-potential", "downloaded_at": "2019-10-30 07:55:21.849175+00:00", "title": "Schneider Electric commits S$16m to build Singapore firms with global potential", "language": "en", "text": "SCHNEIDER Electric on Wednesday said it is committing at least S$16 million over the next four years to incubate and develop up to four Singapore-based companies with global growth potential.\n\nThe investment is part of the energy and automation digital solutions provider’s global innovation programme which includes incubations, investments and partnerships.\n\nThrough the programme, Schneider Electric will use its expertise in energy management, industrial automation and digital transformation to help these companies go global, it said in an announcement. It will also provide market access and its understanding of the global supply chain.\n\nThe company has signed a memorandum of understanding with the Singapore Economic Development Board (EDB) to create the new programme which will focus on creating new business ventures, increasing innovation and help companies with strong global potential and the ability to scale.\n\nsentifi.com Market voices on:\n\nThe venture building programme will target new ventures from climate change solutions to helping the transition to renewable energy sources.\n\nStay updated with\n\nBT newsletters Terms & conditions Sign up\n\nIt will also look at new technologies like Internet of Things, 5G, artificial intelligence and robotics, in order to address growing markets like distributed energy resources, energy-as-a-service, electromobility, energy storage, and efficient heating, ventilation and cooling.\n\n“We are excited about this partnership to build new companies in Singapore,” said Emmanuel Lagarrigue, Schneider Electric’s chief innovation officer. “Singapore is a hub for innovation and we look forward to working with talented entrepreneurs to build new technology and business models.”\n\nSchneider Electric previously worked with EDB to launch a management trainee programme for Nanyang Technological University and National University of Singapore graduates.", "description": ": THE BUSINESS TIMES Government & Economy - SCHNEIDER Electric on Wednesday said it is committing at least S$16 million over the next four years to incubate and develop up to four Singapore-based companies with global growth potential. . Read more at The Business Times.", "authors": ["Vivienne Tay"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-10-30"}