{"pub": "afr", "url": "https://afr.com/companies/energy/gas-plant-delay-ramps-up-energy-uncertainty-20191018-p5323i", "downloaded_at": "2019-10-20 13:26:56.737319+00:00", "title": "Gas plant delay ramps up energy uncertainty", "language": "en", "text": "While some electricity players are arguing for a switch to a \"capacity\" market where plant owners are paid to have generators on standby, Alinta Energy has suggested the maximum price cap in the wholesale market of $14,700 a megawatt-hour be more than doubled to spur investment in new peaking plants.\n\nAlinta told the Energy Security Board's consultation process on the design of the National Electricity Market that the large discrepancy between the current cap and the figure put on the value of customer reliability of $33,460/MWh could explain why no new peaking plant had been built in the past decade without significant government support.\n\nCloser alignment of those two prices \"may be needed to ensure sufficient incentives exist for marginal generation to be built, while satisfying expectations of reliability standards at least cost,\" Alinta said. It said \"directly applying\" the value of customer reliability as price cap should be investigated.\n\nIt also questioned whether the market floor price of negative $1000/MWh is still appropriate as prices swing more often into negative territory.\n\nMeanwhile, Trevor St Baker's Delta Electricity, which owns the Vales Point coal power plant in NSW, also called for modifications to reduce the impact of price swings through the day that are piling financial pressure on coal-fired power stations. It said it is drawing up a proposal for an operating reserve mechanism that would keep existing synchronous generators in the market.\n\nThe need for new on-demand power generation, such as gas peaking plants and pumped hydro, has been broadly recognised by governments, regulators and industry to help offset surging investment in intermittent wind and solar generation.\n\nBut energy suppliers such as Origin Energy and EnergyAustralia told the Australian Financial Review National Energy Summit earlier this month that the absence of stable long-term climate and energy policy was hindering investment decisions.\n\nAdvertisement\n\nThe Morrison government's controversial underwriting program for new dispatchable power plants is still in its early stages, while federal Energy Minister Angus Taylor has set up a task force to consider how the Liddell plant may be extended or replaced.\n\nMr Turecek described Tallawarra B as \"one of NSW' best options for helping fill the gap when the Liddell power station retires\". He said Energy Australia was hopeful it could find a \"sensible\" way to bring new capacity to NSW but in a way that didn't compromise safety.\n\nThe NSW Department of Planning has recommended the Tallawarra B open cycle gas plant not be allowed until it can show to the satisfaction of the Civil Aviation Safety Authority that the plume from the generator won't adversely affect aircraft operations at Illawarra airport.\n\n\"Safety is our No. 1 priority and we are working on finding a way that manages the potential risk to pilots,\" Mr Turecek said.\n\n\"We are looking at a number of engineering solutions to mitigate the plume from the gas turbine.\n\n\"The market is calling out for fast-start flexible capacity, to complement the volume of renewables coming into the system.\"\n\nWhile a combined cycle gas plant wouldn't raise the same objections because it would have a much smaller plume, that technology doesn't allow critical fast-start capability as required in the current market to complement renewables.\n\n\"We believe this role is best suited to open-cycle rather than a combined-cycle plant, with its ability to start within minutes as opposed to hours,\" Mr Turecek said.", "description": "The delay at EnergyAustralia's gas power project in NSW comes as some are suggesting a doubling in the cap in wholesale power to ensure investment in reliable generation.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.3976%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_95/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/c3686c25e1fb069e6021b406b92ba165966a48d5", "published_at": "2019-10-18"}