{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7558979/Alzheimers-halted-treatment-eliminates-immune-cells.html", "downloaded_at": "2019-10-11 00:26:40.484160+00:00", "title": "Alzheimer's could be halted with treatment which eliminates immune cells", "language": "en", "text": "Alzheimer's could be halted with treatment which eliminates cells produced by the immune system, scientists claim.\n\nStudies on mice found cells called microglia kill neurons in the brain, accelerating the rate of brain damage.\n\nThe research at Washington University suggests that suppressing microglia might prevent or delay the onset of the memory-robbing disease.\n\nHowever, a leading charity said the research, although promising, was too preliminary to get excited.\n\nAlzheimer's could be halted with treatment which eliminates cells produced by the immune system, scientists claim. Pictured, a healthy neuron in the brain of an Alzheimer’s sufferer\n\nProtein known as tau begins to clump together. This is a hallmark sign of Alzheimer’s\n\nThe presence of tangled tau attracts immune brain cells called microglia (red) which attack the harmful protein\n\nBut in trying to kill of the tau, the microglia actually damage the neuron, which accelerates the degenerative process\n\nProfessor David Holtzman, lead author of the study, said: 'If we could find a drug that specifically deactivates the microglia just at the beginning of the neurodegeneration phase of the disease, it would absolutely be worth evaluating in people.'\n\nUntil now, Professor Holtzman, a neurologist, believed that microglia were helpful in slowing the speed of dementia.\n\nFound in the brain and spinal cord, the cells are one of the main forms of immune defense in the central nervous system.\n\nMicroglia attacks tau tangles, which are clumps of protein in the brain believed to play a role in the cause of dementia.\n\nIn fit and healthy humans, the presence of tau protein is perfectly normal and even contributes to the proper functioning of neurons.\n\nProfessor Holtzman's and colleagues found evidence that microglia attacks the tau with such ferocity that it inadvertently destroys neurons.\n\nThey achieved this breakthrough in the field's understanding of Alzheimer's by observing the neurodegeneration process in mice.\n\nHalf of the rodents were genetically modified with a protein called Apolipoprotein E4 (APOE4) which is strongly correlated with Alzheimer's in people.\n\nEvery human carries APOE, but those who have the APOE4 strand are 12 times more likely to contract the disease.\n\nSome of the mice were fed a compound called PLX33976 which killed off their microglia, whereas those in the control group retained their supply\n\nFrom the age of six months, some of the mice which had been modified with APOE4 were also fed an inhibitor compound called PLX3397 to kill off their much of their microglia.\n\nWhen the mice were nine months old, those with the APOE4 and a normal presence of microglia showed severly shrunken brains.\n\nIn contrast, the brains APOE4 mice without microglia were still healthy, according to the findings published in the Journal of Experimental Medicine,\n\nProfessor Holtzman said: 'If you could target microglia in some specific way and prevent them from causing damage, I think that would be a really important, strategic, novel way to develop a treatment.'\n\nBut the application to humans seems far off, as the PLX3397 compound used to deplete microglia in mice has side effects of hair colour changes, fatigue, nausea, diarrhoea and vomiting.\n\nDr James Pickett, Head of Research at Alzheimer's Society, said: 'There is a growing body of knowledge that suggests the immune system might play a key role in the development of Alzheimer's disease.\n\n'This research builds on this theory but while promising, this work is still at a very early stage - it was a small study in mice that did not look at the impact of these techniques on memory and thinking abilities.\n\n'Further in-depth research is needed to establish the exact role of the immune system in Alzheimer's disease and our scientists are taking steps to explore every avenue that may one day bring hope to people affected by dementia.'\n\nThe findings were published in the Journal of Experimental Medicine.", "description": "Researchers at Washington University experimented on mice to discover that microglia kill neurons in the brain, accelerating the rate of brain damage.", "authors": ["Jack Elsom For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/18/19551578-0-image-a-20_1570729420641.jpg", "published_at": "2019-10-10"}