{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/trump-impeachment-inquiry-result-already-assumed", "downloaded_at": "2019-10-30 23:19:50.535991+00:00", "title": "Trump Impeachment Inquiry: Result Is Already Assumed", "language": "en", "text": "President Donald Trump delivers keynote remarks at the Shale Insight 2019 Conference in Pittsburgh, Pa., October 23, 2019. (Leah Millis/Reuters)\n\nOur rivalries are decadent and damaging. Our refusal to conciliate among ourselves is a sign of our spoiled adolescence.\n\nNoah Baumbach’s 1995 film Kicking and Screaming features Chris Eigeman playing Max, one of several postgraduate men floundering at the start of their manhood. In one scene, a friend challenges Max about his crippling nostalgia. We graduated four months ago, what could you be nostalgic for? Max replies: “I’m nostalgic for conversations I had yesterday. I’ve begun reminiscing events before they even occur. I’m reminiscing this right now. I can’t go to the bar because I’ve already looked back on it in my memory . . . and I didn’t have a good time.”\n\nAdvertisement\n\nAdvertisement\n\nIt is a great comedic line. But one that is especially poignant for me. Because I find that, like Max, I’m already nostalgic — about the impeachment of Donald Trump, even as it hasn’t happened yet.\n\nWhat strikes me most about impeachment is how low the stakes seem to be. The framers of our Constitution believed that impeachment would preoccupy and concentrate the public mind. But the public mind seems already bored by it. The result is already assumed. The Democratic House will impeach, the Republican Senate will decline to remove Trump from office.\n\nIn an age of polarization we almost assume the logic of partisan enmity in the way we assume the functioning of physical laws. Many Democrats consistently believed that Republicans would impeach Barack Obama. And Republicans have been expecting impeachment — perhaps two impeachments — for Donald Trump. Partisan enmity — really, fear of our fellow countrymen — seems to shrink to mere microns the space in which Republicans and Democrats would have shared norms and a culture, the violations of which would make sense of a functioning impeachment. Of course this constitutional mechanism, like so many others, would be subordinated to factional passions. Why wouldn’t it be?\n\nAdvertisement\n\nMany people connected to Washington have become fascinated by the HBO drama Succession, which takes the story of a family-owned old-media empire of newspapers, magazines, and broadcast channels. The show is not subtle about its allusions to the Murdoch family, from which it takes its inspiration, or, in its subplots, to other powerful dynasties such as the Kennedys. The four characters who inherit their father’s media empire often treat their inheritance as a curse. Bearing the organization’s politics, the organization’s history of moral misdeeds, its record of success, or the real responsibility of choosing between the livelihoods of some loyal employees and others is felt as a great and sometimes unwanted burden.\n\nAdvertisement\n\nThe show cannily demonstrates how the wealth, comfort, and opportunities this organization has bequeathed to this family allow the sibling members to indulge in rivalrous behavior, between one another and with their father, that would utterly destroy families of lesser means and annihilate the relationships that constitute them.\n\nAdvertisement\n\nIt is only when tragedy or an external threat visits their company — their father’s stroke, a hostile-takeover bid, or a meddling Congress — that the family begins to see their differences as trifling and recognize their common interest in protecting the estate they have been blessed, cursed, and fated to inherit.\n\nI wonder if all the political class who watches the show recognize themselves in it. The plot twists that happen over a five- or ten-episode arc, that go from indulgent rivalry to necessary reconciliation, seem to mirror those of America’s public life.\n\nAdvertisement\n\nAlthough there is a great deal of commentary about the end of the 1990s moment, and about America’s return to history, in fact the threats from abroad to the American inheritance are still eminently manageable or remote. And so, perhaps from the conflict of the Gingrich Congress with the Clinton presidency until now, Americans have been able to indulge their rivalries and jealousies of one another. We preoccupy ourselves with plotting at home. Our power and prestige is such that our debates are often exported almost immediately to other parts of the world.\n\nProgressives and conservatives have used the levers at hand to break up and derationalize their opponents’ strongholds in different facets of American life.\n\nAdvertisement\n\nAnd so the gritty reboot of impeachment in my lifetime has me feeling nostalgic for the period of time in which I’ve lived most of my life. These rivalries feel decadent because they are decadent. That doesn’t meant they aren’t real. And aren’t really damaging. But our refusal to conciliate among ourselves is a sign of our spoiled adolescence. And while nearly everyone wants to rush toward the exits of this era, I worry that the only way out is through a national tragedy or event none of us should desire to see.", "description": "Our rivalries are decadent and damaging. Our refusal to conciliate among ourselves is a sign of our spoiled adolescence.", "authors": ["Michael Brendan Dougherty", "Zachary Evans", "Tobias Hoonhout", "Frederick M. Hess", "Hannah Warren", "Kevin D. Williamson", "John Fund", "Andrew C. Mccarthy", "Matthew Continetti", "Rich Lowry"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/donald-trump-shale.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-30"}