{"pub": "yahoo", "url": "https://finance.yahoo.com/news/american-giant-ceo-brands-retail-174941367.html", "downloaded_at": "2019-09-22 16:34:18.966008+00:00", "title": "American Giant CEO: Businesses rethinking manufacturing overseas from 'moral' and 'better business' standpoint", "language": "en", "text": "The CEO of clothing brand American Giant says retailers are feeling pressure to bring manufacturing back to the United States, as trade war tariffs between the U.S. and China intensify.\n\n“Brands are beginning to feel both from a moral standpoint and from a better business standpoint, about bringing some of their manufacturing back into a U.S. supply chain,” American Giant CEO Bayard Winthrop told Yahoo Finance’s “The Ticker.” “It’s a concern that there’s been so much underinvestment in U.S. manufacturing over the last 30 years or so. That’s something that’s impacted manufacturing broadly and textiles specifically.”\n\nWinthrop says he hopes his business model will be a blueprint for other companies since American Giant, which manufactures 100% of its products in the U.S., feels a minimal impact from the trade war.\n\nU.S. President Donald Trump, U.S. Secretary of State Mike Pompeo, U.S. President Donald Trump's national security adviser John Bolton and Chinese President Xi Jinping attend a working dinner after the G20 leaders summit in Buenos Aires, Argentina December 1, 2018. REUTERS/Kevin Lamarque More\n\n“In our specific supply chain, most if not all of our partners are growing and are stabilizing, so that’s been a really gratifying thing,” Winthrop said. “That business model has allowed us to think a little more liberally in how we manage our supply chain in ways that older school brands that have wholesale distribution will have a harder time.”\n\nRetailers are eyeing Washington as deputy trade negotiators from the two countries resume face-to-face trade talks this week. The negotiations, which include a delegation on 30 Chinese officials, aim to lay a foundation for further talks next month.\n\nManufacturing output gains in the U.S. for the apparel and leather goods sector are on a steady decline, plummeting 85% between 1987 and 2017, according to the Federal Reserve Board. Winthrop says it’s time to rethink the trend of moving manufacturing overseas.\n\n“Most of the last 40 years were marked by a massive movement overseas by all the brands that I grew up around,” Winthrop explained. “There are two things that have happened there. One is that the work has left and that’s had real implications for towns, communities and middle class paying jobs… And the other thing is quality. American Giant is rooted in a quality story and trying to get quality back in the supply chain.”\n\n\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.", "description": "Bayard Winthrop, CEO of clothing company American Giant, joins Alexis Christoforous on 'The Ticker' to discuss how his companying weathering the trade war.", "authors": ["Meghan Fitzgerald"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ujpP79oqINon2epgxWiFHw--~B/aD0yMTk3O3c9MzUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/5a1ffbc0-db21-11e9-bbd7-952fc37edd0c", "published_at": "2019-09-20"}