{"pub": "reuters", "url": "https://in.reuters.com/article/us-canada-alberta-budget/canadas-alberta-to-unveil-budget-on-october-24-spending-cuts-loom-idINKBN1W81ZQ", "downloaded_at": "2019-09-23 17:37:30.827357+00:00", "title": "Canada's Alberta to unveil budget on October 24, spending cuts loom", "language": "en", "text": "CALGARY, Alberta (Reuters) - The government of Canada’s main oil-producing province Alberta will unveil its first budget on Oct. 24, the premier said on Monday, warning that “difficult decisions” would need to be made on spending to help tackle hefty deficits.\n\nPremier Jason Kenney and his United Conservative Party were elected in April, ousting the left-leaning New Democratic Party (NDP), with promises to get Alberta’s finances in order.\n\nThe western province holds most of Canada’s oil reserves, the third-largest in the world, but it has been struggling with persistent deficits and a slump in capital investment since the 2014/15 global oil price collapse.\n\nThe latest fiscal update showed Alberta had a C$6.7 billion ($5.05 billion) deficit for the 2018/19 financial year, which runs April 1 to March 31.\n\nEarlier this month, a government-appointed panel headed by former Saskatchewan Finance Minister Janice MacKinnon warned Alberta is facing a serious threat to its financial health unless the province reins in spending.\n\nMany economists expect the government to announce sweeping cuts in the October budget, and Kenney said ordinary Albertans would welcome fiscal responsibility from politicians.\n\nHe pointed to the example of Alberta’ Progressive Conservatives (PC), who governed the province for more than four decades years before losing the 2015 election to the NDP.\n\n“The last PC government lost after 44 years in part because they failed to keep to their commitment to get their finances back in order,” Kenney told reporters at a news conference. “I think Albertans were disappointed that government kicked the can down the road yet again, we are not going to make that mistake.”", "description": "The government of Canada's main oil-producing province Alberta will unveil its first budget on Oct. 24, the premier said on Monday, warning that \"difficult decisions\" would need to be made on spending to help tackle hefty deficits.", "authors": ["Nia Williams", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-23"}