{"pub": "realclearpolitics", "url": "https://cnn.com/2019/10/13/opinions/trump-staffers-testimony-congress-vinograd/index.html", "downloaded_at": "2019-10-14 23:18:47.002392+00:00", "title": "This is just the tip of the impeachment inquiry iceberg", "language": "en", "text": "Samantha Vinograd is a CNN national security analyst. She served on President Barack Obama's National Security Council from 2009 to 2013 and at the Treasury Department under President George W. Bush. Follow her @sam_vinograd . The views expressed in this commentary are her own. View more opinion articles on CNN.\n\n(CNN) Size does matter. As President Donald Trump tries to slash drastically the size of the National Security Council and make way for more political appointees instead, he's going to lose out on the important expertise and valuable relationships that career government employees bring to the NSC.\n\nNational security adviser Robert O'Brien announced the staff cut Thursday after the whistleblower complaint detailed concerns raised by a number of White House staffers. The move looks a lot like an attempt to push out witnesses to Trump's potential crimes.\n\nIf this is Trump's legal strategy, he needs new counsel. Cutting NSC staff won't protect him from Congress' power to call on key figures to testify about his behavior and alleged abuses of power -- in fact it may motivate more officials to come forward and speak freely about what they've seen or heard.\n\nAs the House prepares to meet with a mix of current and former administration officials this week -- including Fiona Hill, a former top Russia and Ukraine official at the White House, US Ambassador to the EU Gordon Sondland, deputy assistant secretary of European and Eurasian affairs George Kent, and senior adviser to the secretary of state Ulrich Brechbuhl, the world is watching to see just what these staffers have to say about where and when Trump's personal insecurities trumped our national security.\n\nRussia is definitely listening\n\nOne woman had a front-row seat to Trump's romance with Russia and his posture toward Ukraine. As the former senior director for Europe and Russia at the NSC, Fiona Hill's core responsibilities (if Trump let her fulfill them) should have included advising the President on all things Russia and Europe (including Ukraine); sitting in on all foreign meetings and engagements related to these topics; reviewing readouts; and helping run the official interagency process on her areas of responsibility.\n\nAs part of her testimony next week, Congress will probably learn more about how Trump's clique of campaign surrogates -- some of whom were employed by the US government -- reportedly side-stepped this NSC process , and used their official titles to gain access to individuals and information that were politically helpful to Trump.\n\nBecause of her portfolio at the White House, Hill will likely also have critical information to share about the President's behavior on Russia, including his calls with President Vladimir Putin and the dangerous 2017 meeting in which he declassified sensitive information in front of the Russian ambassador and foreign minister and reportedly said he was unconcerned about Russian election interference.\n\nRussia will definitely be listening to any news about what she says behind closed doors and will probably use it to continue their mission of sowing divisions in the US and undermining the credibility of our institutions, even though Trump is doing a good job of that already. All of this is an advantage to Russia.\n\nAmbassador in name only\n\nAmbassador Sondland is set to testify before the House next Thursday.\n\nGiving someone the title of ambassador doesn't mean that they're actually implementing US foreign policy. We learned that reading Sondland's text messages -- including those with Rudy Giuliani. It appears his actual portfolio wasn't high on his to-do list -- instead he facilitated inappropriate communications between the President's personal lawyer and Ukrainians. What we already know about his behavior undermines the credibility of the State Department, White House, and US foreign policy overall.\n\nTo top it off, the President, former national security adviser John Bolton, acting chief of staff Mick Mulvaney, and Secretary of State Mike Pompeo -- all of whom were mentioned in the text messages -- were probably aware that he was freelancing on Ukraine instead of doing his actual job.\n\nThey were likely aware that he was side-stepping official anti-corruption channels and instead relying on Rudy to get access to information that could help the President's campaign needs. Sondland reportedly called Trump before telling a top US ambassador there was \" no quid pro quo ,\" -- a message that came from Trump himself, according to a source who spoke to the Washington Post . Sondland is reportedly going to testify that he didn't know whether the message was true or not, just that the President relayed the message to him. The fact that Sondland was willing to parrot the President doesn't inspire a lot of confidence when it comes to delivering an honest testimony this week.\n\nPlus, because of the official perch that Trump gave him, Sondland had access a whole host of European officials. Congress may also want to ask Sondland if he used his Rolodex for Rudy on more than one occasion in more than one location.\n\nReality check\n\nWhile Sondland, who donated $1 million to Trump's inaugural committee , appears to have abused his title to further Trump's personal vendettas, plenty of diplomats are still working hard for the State Department.\n\nOne of them -- deputy assistant secretary of state for Europe and Eurasian affairs George Kent -- is also scheduled to testify next week, although the State Department may try to block his testimony like they did with Yovanovitch and Sondland.\n\nKent is a real expert on the very issues that Trump, Giuliani, Sondland and former special envoy for Ukraine negotiations Kurt Volker spent so much time talking about: anti-corruption in Ukraine. Kent was the No. 2 at the embassy in Kiev from 2015 to 2018, and the anti-corruption coordinator for the State Department's European Bureau from 2014 to 2015.\n\nKent, like Ambassador Yovanovitch , can share some facts on US anti-corruption efforts in Ukraine, including the work of former Vice President Joe Biden and other members of the Obama administration, along with organizations like the G-7, the International Monetary Fund and European Bank for Reconstruction and Development.\n\nThese facts will stand in stark contrast to the fiction that Trump and his squad are circulating. Kent's testimony about his interactions with acting ambassador to Ukraine Bill Taylor (who is not yet scheduled to testify) will be particularly important. Based on how the State Department operates, Taylor and Kent should have been in close touch, especially on priority issues like security assistance to Ukraine and Taylor's concerns about a perceived quid pro quo on the President's part.\n\nPlus, as deputy assistant secretary, Kent should have been involved in, or had knowledge of, the events that ultimately led John Sullivan, the deputy secretary of state, to tell Yovanovitch that she was being recalled from her post\n\nKent's testimony may shine more light on Trump's preference for using ambassadors like Sondland and Volker over seasoned professionals like Taylor, Kent, and Yovanovitch. His testimony will be key to Congress's oversight responsibilities, and will likely cement the notion that career State Department officials were cut out of key conversations and punished just for doing their actual jobs while their boss Secretary of State Pompeo failed, and is failing to speak up for them.\n\nCamp counselor\n\nCounselor of the US State Department Ulrich Brechbuhl listened in on Trump's July 25th call with Ukrainian President Volodymyr Zelensky, according to the whistleblower complaint.\n\nAs a political appointee reporting to Pompeo, Brechbuhl's purview is expansive. His job is to be with the secretary of state at all times -- to staff him, know everything Pompeo knows or needs to know, implement his guidance, and communicate his priorities.\n\nThe fact that he was allowed to listen in on a POTUS call indicates his access to sensitive information; State Department officials don't often have access to presidential calls. Any knowledge of or possible involvement in key issues like Yovanovitch's recall, the delayed release of security assistance to Ukraine, or efforts to investigate Biden, for example, will probably be top of mind for Congress.\n\nBut because Pompeo really led two different Departments -- one staffed by career officials doing their actual jobs and another in which political appointees engaged in extracurricular activities to please POTUS -- whatever Brechbuhl has to say -- if he's allowed to testify -- will have an impact on the State Department's credibility. Brechbuhl will know Pompeo's reactions to unseemly requests from the President and why Pompeo's been so willing to let the President abuse power and potentially break the law.\n\nGet our weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\n\nPompeo still hasn't defended Ambassador Yovanovitch, for example, and he's been serving as Trump's personal diplomat -- defending his activities and pillorying anyone who disagrees with them.\n\nThe House has said that more depositions will be scheduled -- and this may be the tip of the iceberg when it comes to officials wanting to share their experiences with Congress. The White House and the State Department may try to block officials from speaking up, but that may only motivate them further.\n\nEither way, the world is watching, listening, and reading about how several senior officials probably abused our system. That degrades our ability to implement credible foreign policy and for dedicated government officials to do their jobs as they are sidelined by those pursuing work on behalf of the President's personal needs, and not US national security.", "description": "As the House prepares to meet with a mix of current and former administration officials this week, the world is watching to see what these staffers have to say, writes Samantha Vinograd.", "authors": ["Opinion Samantha Vinograd"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191008091654-sondland-trump-split-super-tease.jpg", "published_at": "2019-10-13"}