{"pub": "indiatimes", "url": "https://indiatimes.com/sports/manchester-united-are-paying-the-highest-wages-in-the-premier-league-and-still-can-t-produce-results-377819.html", "downloaded_at": "2019-10-15 08:01:26.648183+00:00", "title": "Manchester United:Manchester United Are Paying The Highest Wages In The Premier League And Still Can't Produce Results", "language": "en", "text": "Manchester United Are Paying The Highest Wages In The Premier League And Still Can't Produce Results\n\nManchester United Are Paying The Highest Wages In The Premier League And Still Can't Produce Results\n\nThey might be struggling to muster good results on the pitch, but Manchester United continue to splash the big bucks on player wages.\n\nAFP\n\nThe struggling Old Trafford club spend an outrageous £332million a year - around £6.5m-a-week - on player wages alone. There is little to justify the exuberant amount of money the club spends on their players, with the results on the pitch anything but good.\n\nThat sky-high tally has grown by £100m in the last three years alone - with the likes of Alexis Sanchez taking in £505,000-a-week by himself. The Chilean has be loaned to Italian giants Inter Milan, but it is reported United pay majority of his wages.\n\nAFP\n\nDon't Miss 57.7 K SHARES 37.1 K SHARES 17.7 K SHARES 18.8 K SHARES\n\nMeanwhile, the report shows Liverpool (£264m per year), Manchester City (£260m), Chelsea (£244m), Arsenal (£223m) and Tottenham (£148m) are all spending considerably less than United.\n\nAs expected, Twitter users started to pound further misery by having a laugh about the whole matter.\n\nHere are lots of numbers that show if you spend loads on wages, you should do pretty well in the Premier League compared to those who don't.\n\nTakeaway: Man Utd really not doing it since alchemist Fergie hung up his cloak. pic.twitter.com/uzObWRkAH3 — Nick Harris (@sportingintel) October 6, 2019\n\nSo Rashford in 18/19 scored 13 goals in 47 games. Then over the summer Man Utd double his wages. No wonder they are where they are. Shambles. — Stew Scott (@StewScott1) October 6, 2019\n\n#MUFC are reportedly paying £150,000 a week of Alexis Sanchez's Inter Milan wages this season.\n\nThis will make him Man United's EIGHTH highest paid player... despite not playing for Man Utd. pic.twitter.com/pCLQl2myNk — Coral (@Coral) August 28, 2019\n\nMan Utd have have highest wage bill in PL history... damn trust me Man Utd are so bad right now that I’m sick and tired of dissing them. Like literally so fkn bored everyday I laugh and share new Utd problems. Y’all have fallen big time. #ManUtd — Varunrajsinh Jadeja (@Varunrajsinh23) October 14, 2019\n\nHugely concerning that Dick Ed #Woodward is running around @ManUtd handing out huge contracts to underperforming players like Lingard. No wonder our wage bill is so high & we can only afford to bring in 3 new signings. The rebuild is gonna be looooong at this rate! #MUFC #ManUtd — J_Fran29 🔰🔰🔰 (@J_Fran29) September 30, 2019\n\nSay what you want about United but they're still breaking records...They currently have the highest wage bill in Premier League history with a staggering £332m spent on wages 😳\n\nEven more ridiculous considering how they're performing on the pitch.. pic.twitter.com/C1qyHbiQxw — Footy Accumulators (@FootyAccums) October 14, 2019\n\n📉 Worst squad in their Premier League history\n\n📈 Highest wage bill in Premier League history\n\nWhen you realise United are paying record amounts for a squad containing Lingard, Young and Fred... 😲💵https://t.co/b2xHFE7GMF — SPORTbible (@sportbible) October 14, 2019\n\nNothing is going to plan for Manchester United - they can't seem to catch a break.\n\nFor the money they are paying, players should be performing and winning matches, but they are doing neither.\n\n\n\n", "description": "They might be struggling to muster good results on the pitch, but Manchester United continue to splash the big bucks on player wages. The struggling Old Trafford club spend an outrageous £332million a year - around £6.5m-a-week - on player wages alone. There is little to justify the exuberant amount of money the club spends on their players, with the results on the pitch anything but good.", "authors": ["Basit Aijaz"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/manchester_united_1571117089_800x420.jpg", "published_at": "2019-10-15"}