{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/03/wayne-rooney-luciano-acosta-start-dc-united-friendly-vs-puebla", "downloaded_at": "2019-09-03 23:44:12.804484+00:00", "title": "Wayne Rooney, Luciano Acosta to start in D.C. United friendly vs. Puebla", "language": "en", "published_at": "2019-09-03", "text": "\n\nLuciano Acosta, left, has started one of the past five MLS matches, and Wayne Rooney has missed four of eight. (Jonathan Newton/The Washington Post)\n\nD.C. United vs. Puebla preview\n\nWhat: Friendly.\n\nWhen: 8 p.m. Wednesday.\n\nWhere: Audi Field.\n\nOutlook: With no MLS match this weekend and some regulars needing minutes, Coach Ben Olsen said Wayne Rooney and Luciano Acosta will start against the Mexican club.\n\nRooney, the team’s captain and leading scorer, has missed four of the past eight matches, including the past two because of a red card. Acosta has started one of the previous five.\n\nOlsen will use a mix of regulars, reserves and second-division players from Loudoun United in the last of three friendlies against international foes. Relying on many young players amid busy stretches of league games, D.C. lost to Spain’s Real Betis, 5-2, in May and France’s Olympique Marseille, 8-1, in July.\n\n“A little bit of a puzzle, but it will probably be the best team we put forward for one of these friendlies because of the circumstances,” Olsen said. “We need the training session for some guys — meaning 30 minutes or 45 — and some guys need to get pushed and get real game time. There will be some 90-minute performances.”\n\nRooney returned to Washington on Monday after spending several days in England with family. Acosta entered in the 87th minute of the 3-0 victory Saturday at Montreal.\n\n[Canouse was in right spot for much-needed United victory]\n\nOn how much Rooney and Acosta will play, Olsen added: “You go into the game scheduling the minutes, then the whistle blows and you have to adapt and still evaluate their fitness. If the data says they are fine, we will keep pushing them.”\n\nSecondary players likely to see time include goalkeeper Chris Seitz, defender Marquinhos Pedroso and winger Emmanuel Boateng, as well as Loudoun-based homegrown Antonio Bustamante. Griffin Yow, the 16-year-old attacker who scored against Real Betis, is nursing a minor ankle injury and is unlikely to play.\n\nWith four league matches left, United (11-10-9, 42 points) is fourth in an Eastern Conference race that will send seven to the postseason. The next league date is Sept. 15 at Portland.\n\nPuebla (1-3-3) is 17th in the 19-team Liga MX following a 1-1 draw at Queretaro on Sunday. Midfielder Alejandro Chumacero was recalled by the Bolivian national team for next Tuesday’s friendly at Ecuador.\n\nRead more:\n\nVirginia knocks off Maryland in match of college soccer titans at Audi Field\n\nAmericans abroad weekend roundup: Josh Sargent, 19, scores brilliant goal in Bundesliga\n\nD.C. United loans Chris Durkin to Belgian club, continues pursuit of Yamil Asad for 2020 season", "description": "With no MLS matches until Sept. 15, Ben Olsen will use several regulars against the Mexican club at Audi Field.", "authors": ["Steven Goff", "Reporter Covering Soccer", "D.C. United", "Mls", "U.S. National Teams", "World Cup", "Plus Some College Basketball.", "September At Pm", "Steven Goff Has Covered Soccer For The Washington Post Since The Early His Beats Include D.C. United", "The U.S. National Teams. He Has Been On Assignment At Every World Cup Since"], "top_image": "https://www.washingtonpost.com/resizer/GR_5oalmoP-_72qHS17DrVhbpSY=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/35DRUGVXDMI6TDUDJZTIP2MYCQ.jpg"}