{"pub": "thehill", "url": "https://thehill.com/blogs/congress-blog/politics/468052-congress-doesnt-need-to-pause-it-needs-to-act-and-strengthen", "downloaded_at": "2019-10-30 15:58:07.862220+00:00", "title": "Congress doesn't need to pause, it needs to act and strengthen Social Security", "language": "en", "text": "A recent piece in The Hill has said that Social Security is entering a new era. They’re right, Social Security is entering a new era – and it needs to be strengthened. We don’t have to look back to the Great Depression to understand the timeliness and urgency needed to strengthen Social Security, we need only go look back to 2008.\n\nEconomists at the Federal Reserve have found that 90 percent of working Americans have not recovered their wealth and assets lost in the Great Recession of 2008. People were horrified as they lost their savings and saw their 401(k)s become 101(k)s, but Social Security was always there for them. In fact, Social Security never has missed a payment. With 10,000 baby boomers retiring each day, America is facing a looming retirement crisis, and most are not prepared. This is not the time to pause – this is the time to strengthen Social Security!\n\nSocial Security is neither an entitlement nor a tax. It’s an earned benefit that people contribute to from each paycheck. Employers pay half of the premium (which they write off, just as they do for health insurance and other employee benefits). No tax exists that provides a pension benefit, a disability policy, dependent and spousal coverage, and a death benefit, like Social Security does. Nor can anything like it be purchased in the private market. It’s a guarantee that every American understands and relies upon. It’s why this is America’s most important retirement program and America’s number one anti-poverty program.\n\nHere are the facts: to pause and to do nothing by 2035 will result in an about $300 per month cut in benefits for the average retiree and a $250 cut for the average disabled veteran. Poll after poll shows that citizens are willing to pay a little bit extra to get the guarantee that Social Security provides.\n\nEven President Trump Donald John TrumpNumber of uninsured children rises for second year, tops 4 million Trump moment from White House Halloween trick-or-treat event goes viral White House official says transcript of Ukraine call omitted key phrases: report MORE stood up to 16 other Republicans who tried to get him to say that this was an entitlement. He responded correctly, that Social Security is an earned benefit and he pledged to not cut it.\n\nRather than doing nothing as Republicans suggest, we have a very practical and pragmatic choice to strengthen Social Security: the Social Security 2100 Act. The legislation modestly raises contributions by one percent and phases them in over 24 years.\n\nThe last time Congress did anything to strengthen Social Security was in 1983, 36 years ago. It’s been almost 50 years since Congress has expanded Social Security benefits. The 2100 Act expands benefits across the board and offers a new Cost of Living Adjustment (COLA) formula that reflects seniors’ needs.\n\nThree-quarters of the revenue from the Social Security 2100 Act pays for current benefits, which would otherwise be reduced after 2035 if we do nothing.\n\nThe Social Security benefits in this bill are designed to meet the needs of the elderly and disabled. They’re also designed to meet the needs of the everyday, average, middle-class American citizen so they don’t fall into poverty and despair. Right now, for nearly one-third of beneficiaries, Social Security benefits are 90 percent or more of their income.\n\nIn a recent piece in The Hill, four Democratic commentators suggested that the House pause on moving forward with the Social Security 2100 Act. How can we justify pausing and doing nothing when two-thirds of beneficiaries rely on Social Security for the majority of their income? This is not the time to pause. This is the time to fulfill the promise and guarantee of Social Security. Americans sitting around their kitchen table, who have not recovered what they lost in 2008, don’t want Congress to pause. They want Congress to act!\n\nStrengthening Social Security isn’t just about retirement security. This is a civil rights and women’s issue. Social Security ensures that people of color and women who face societal discrimination receive the benefits they earned!\n\nSocial Security benefits are also a huge economic driver for every congressional district in the nation. On average there are 125,000 Social Security beneficiaries in each district who are using their benefits to buy goods and services.\n\nEnacting this legislation does not preclude us from continuing our work on other important priorities facing our nation. The Ways and Means Committee marked up critical legislation to lower drug prices for Americans, and the House, under Speaker Nancy Pelosi Nancy PelosiOvernight Defense: House approves Turkey sanctions in rebuke of Trump | Trump attacks on Army officer testifying spark backlash | Dems want answers from Esper over Ukraine aid Mark Mellman: Three questions for Republicans White House: Democrats' resolution shows impeachment is 'illegitimate sham' MORE’s (D-Calif.) leadership, is moving ahead with an aggressive positive agenda.\n\nFurther, the Social Security 2100 Act does not cost the Treasury a penny, so it does not affect resources needed for other priorities. In fact, it reduces the national deficit by $525 billion in just the first 10 years according to the Congressional Budget Office (CBO), and using the CBO projections it is Pay-Go compliant under the House rules. The Social Security chief actuary (by law the official government scorekeeper for the Trust Funds) has found that this bill makes Social Security solvent for 75 years and beyond, giving every American the assurance that the program will always be there for them.\n\nThe time to act is now. That’s why we and the over 200 other co-sponsors support the Social Security 2100 Act and continue to push the bill forward. It is the only plan which meets the goals of protecting and strengthening Social Security. The time has come for a vote.\n\nPascrell, Sánchez, Kildee, Boyle, and Higgins are members of the Ways and Means Social Security Subcommittee.", "description": "A recent piece in The Hill has said that Social Security is entering a new era. They’re right, Social Security is entering a new era – and it needs to be strengthened.", "authors": [], "top_image": "https://thehill.com/sites/default/files/socialsecurity_042619istock.jpg", "published_at": "2019-10-30"}