{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/30/w-samuel-patten-gop-political-consultant-survivor-", "downloaded_at": "2019-10-01 04:29:55.698792+00:00", "title": "EXCLUSIVE: Political consultant a 'survivor' after getting caught in Mueller web", "language": "en", "text": "W. Samuel Patten, whose work took him to some of the world’s most exotic and dangerous locations, found himself last winter in a Washington gym populated with carjackers and crack dealers.\n\nThe longtime Republican political consultant had pleaded guilty to charges spun out of special counsel Robert Mueller’s Russian election interference investigation. Patten avoided prison, but he sought the advice of ex-convicts when he thought he was going to serve time.\n\n“I was mentally and physically preparing to go to prison,” he told The Washington Times. “I was learning how to behave in prison. I didn’t think I’d be there for long, but I was ready for it.”\n\nInstead, Patten was sentenced to serve three years of probation, pay a $5,000 fine and complete 500 hours of community service for failing to register under the Foreign Agents Registration Act. In pleading guilty, he admitted to but was not charged for securing tickets to President Trump’s inauguration on behalf of a Ukrainian oligarch. That act, made through an American “straw purchaser,” violated laws barring foreign money from flowing to presidential inauguration committees.\n\nPatten remains among a handful of people convicted of violating foreign lobbying laws in the past 50 years. A jury last month found Obama White House counsel Greg Craig not guilty of similar charges. Last week, the Justice Department ended its foreign lobbying investigation into Democratic lobbyist Tony Podesta and former Republican Rep. Vin Weber without bringing charges.\n\nAvoiding jail time gave Patten a jump-start on stitching up a reputation tarnished by the Mueller probe, which turned up plenty of wrongdoing. The special counsel filed 34 indictments, including against nearly two dozen Russians accused of election meddling. On Monday, the Trump administration imposed sanctions on the Internet Research Agency and its financier, who were among those indicted by Mr. Mueller.\n\nBut mere witnesses caught up in the investigation had their lives wrecked as business clients walked away and death threats piled up. For those tainted by a guilty plea, the road is even tougher.\n\nUnlike others, however, Patten sees his scarlet letter as an asset, not an albatross.\n\n“In this town, to survive an investigation like that is actually a plus,” he said. “Few people have looked the dragon in the face and survived.”\n\nStill, the conviction stings, and there is a twinge of bitterness over becoming ensnared in an investigation into a president whom Patten says he didn’t support.\n\n“I held my nose and voted for the witch who later destroyed me,” he said. “I wanted to vote for [Libertarian Party candidate] Gary Johnson, but my wife persuaded me to vote for [Democratic nominee Hillary] Clinton.”\n\nPatten is trying to rebuild his life by creating a better one. He has quit drinking, attends Alcoholics Anonymous meetings and has dropped 40 pounds. He jokingly refers to his weight loss as the “Bob Mueller diet.”\n\nBut challenges remain.\n\nA political junkie, Patten longs to return to the consulting work that has evaporated. He sees that avenue as unlikely.\n\nThe saga also has taken an economic toll on Patten and his wife, Laura. Legal fees have wiped out his retirement savings, and the stigma of a conviction hangs over him as he ponders his next opportunity.\n\nThe lack of work has left him to focus on completing his community service obligations. He is tutoring inner-city youths, cooking meals for the homeless and working to help formerly incarcerated people in the District find work. Some groups rebuffed his assistance because of the Mueller stain.\n\nSome of the wounds are starting to heal, Patten said, and it helps that the Mueller investigation did not find any collusion between Russia and the Trump campaign.\n\n“Time does make a difference,” he said. “Some of the rancor, bitterness and resentment does start to fade a little bit because the worm is turning. I think the national perspective and public opinion is changing and more people are seeing it for what it is.”\n\nPatten said he hasn’t decided on his next steps. He grew up in Maine and has floated the idea of running against Sen. Susan M. Collins, a moderate Republican from that state. He worked on her failed gubernatorial bid in 1994 and her successful Senate run in 1996.\n\nThe former newspaper reporter also is writing a book.\n\nIt’s hard to imagine how he ended up this position.\n\nHe was raised in a blue-blooded Washington family. As a child, he attended dinner parties whose guests included Supreme Court justices, ambassadors and journalists. Those parties were hosted by his grandmother, Susan Mary Alsop, who was dubbed “the grand dame of Washington Society” by the Los Angeles Times upon her death.\n\nObsessed with politics after the Collins campaigns, he moved on to George W. Bush’s 2000 presidential campaign.\n\nIn 2001, Patten moved to Moscow, where he worked for a pro-democracy nonprofit headed by Sen. John McCain. He met Konstantin Kilimnik before Mr. Kilimnik became an associate of Mr. Trump’s former campaign chairman Paul Manafort, another Mueller target. Patten and Mr. Kilimnik eventually formed a consulting business, which received more than $1 million for Ukrainian lobbying work, according to court documents.\n\nMr. Kilimnik was later indicted by Mr. Mueller, who said he had ties to Russian intelligence.\n\nPatten disputes that assertion.\n\n“It continues to be my belief that he’s a hustler like I am,” he said. “Mueller said he had a diplomatic passport. I never saw it or was aware he had one. If he had one, that is a question, but Russia is a mercenary country where you can get anything for a fee.”\n\nPatten’s consulting work led to Ukraine, where he worked alongside Manafort to advise a pro-Russia Ukrainian political party. In 2014, Patten wrote op-eds on behalf of his Ukrainian clients and introduced them to members of the executive branch and Congress. Federal prosecutors said those activities violated foreign lobbying laws.\n\nThe activities included buying four inauguration tickets paid for by Ukrainian oligarch Vadim Novinsky, who has business interests in the U.S. Although Mr. Novinsky did not attend the bash, Patten said, he was at President Obama’s inauguration. Patten attended Mr. Trump’s inauguration with another wealthy Ukrainian and noted that he wasn’t the only foreigner there.\n\n“None of this struck me as high treason,” he said. “This wasn’t some devilish conspiracy. I was doing a favor for a client. Because I’m an international political consultant, I didn’t have this ‘oh my God they’re foreigners’ mentality, but in retrospect maybe I should have. I just thought we were a more sophisticated country.”\n\nThe identity of the American straw purchaser will remain secret, Patten said.\n\n“This dogs– narrative has hurt enough people, and this person was simply doing me a favor,” he said. “This is a town full of snitches, but I won’t be one.”\n\nIn January 2018, Patten voluntarily testified before the Senate Select Committee on Intelligence. He later admitted in court that he “misled” the committee by withholding documents that would have disclosed foreign money was used to purchase the tickets.\n\nPatten’s Senate testimony attracted the attention of the special counsel’s team.\n\nUnlike others grilled by Mr. Mueller’s team, Patten doesn’t have animosity toward them. He agreed to cooperate and provide assistance with other investigations.\n\n“I was surprised at the basic decency of the people on the Justice Department side,” he said. “It is not fun and sort of terrifying, but my general sense is they were diligently going through a bunch of stuff foisted upon them to try to figure out what happened.”\n\nHowever, Patten’s view of the Senate intelligence committee is vastly different. He called his hearing a “setup.”\n\n“The viciousness and nastiness of the people on the Hill is stunning,” he said. “These are the people who pushed the [Russian] investigation based on wishful thinking, innuendo and lies to destroy people.”\n\nPatten admits he withheld “a handful” of emails detailing how he bought the inauguration tickets from the more than 1,300 documents he turned over to the committee, but he paints the omission as a mistake rather than an attempt to conceal.\n\n“I should have turned them over and I didn’t, and I admitted my wrongdoing. But I made judgment calls and thought, stupidly, that I was giving them enough,” he said. “I gave them the full flavor without every little detail.\n\n“Also, they said they were investigating Russian interference in the 2016 election, not Ukrainians attending the 2017 inauguration. I would submit there is a difference,” he said.\n\nPatten said the Senate committee misled him. He said he and his attorney were assured he would not be asked about the Foreign Agents Registration Act — the federal law Patten later admitted to violating — but instead the investigators asked him about it multiple times.\n\n“This is unequivocally, categorically false. As court documents have noted, it is Mr. Patten who lied to the committee — never the other way around,” said Rachel Cohen, a committee spokeswoman.\n\nPatten sees it differently. “My honest responses to those questions are what the government used to prosecute me,” he said.\n\nHe said he hopes there will eventually be some accountability for the runaway investigations and has even filed a complaint with the Senate Select Committee on Ethics, but he added, “I’m not holding my breath.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "W. Samuel Patten, whose work took him to some of the world's most exotic and dangerous locations, found himself last winter in a Washington gym populated with carjackers and crack dealers.", "authors": ["The Washington Times Http", "Jeff Mordock"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/30/AP_18243658997437_c0-21-4500-2644_s1770x1032.jpg?c0bde930c07c8bf54d131e4e0b33946b3a3ad31b", "published_at": "2019-09-30"}