{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7559111/Pablo-Escobars-brother-wins-legal-battle-cybersquatter-owner-PabloEscobar-com-domain-name.html", "downloaded_at": "2019-10-10 15:34:28.861842+00:00", "title": "Pablo Escobar's brother wins legal battle with 'cybersquatter' owner of PabloEscobar.com domain name", "language": "en", "text": "The brother of feared drug lord Pablo Escobar has won a $3million legal battle over a web domain named after his notorious relative.\n\nRoberto De Jesus Escobar Gaviria, known as 'El Osito', won through his company Escobar Inc, a complaint over the use of www.PabloEscobar.com.\n\nHe wants to use the domain, which is currently inactive, to sell merchandise relating to the dead Colombian kingpin, who was responsible for the death of thousands during his reign of terror during the 1980s and early 1990s.\n\nThe website is said to be going live by the end of next year and plans to feature official Pablo Escobar products and merchandise, all sponsored by the drug lord's holding company Escobar Inc.\n\nOne of the products that would be sold in the online store includes the notorious Escobar Inc-branded flamethrower - an the idea which the firm alleges Elon Musk stole and used for his own The Boring Company.\n\nRoberto Escobar (left), the older brother of the notorious deceased drug lord, Pablo Escobar (right), won a legal battle over the use of the www.PabloEscobar.com domain name\n\nCurrently Escobar Inc-branded flamethrowers are on sale for $249 on a different domain. Roberto Escobar now plans to sell all Pablo merchandise on one site\n\nThe current owner of the domain wanted $3million to hand over the site to Escobar Inc, but The National Arbitration Forum decided to transfer it.\n\n\n\nRoberto Escobar, co-Founder of Escobar Inc, vowed to fight 'anyone that is in our way'.\n\nHe said: 'I am happy. Escobar Inc is the only true owner of anything relating to Pablo Escobar. Infringers need to stop. We will fight anyone that is in our way.'\n\nRoberto Escobar accused the Tesla founder and CEO of stealing his firm's flamethrower idea in July, after one of his employees visited Colombia in 2017 and saw one of the toys owned by the Escobars.\n\nThe billionaire responded via Twitter, writing: 'It's not a Flamethrower, Mr. Escobar.'\n\nAround $2 million was raised through Musk's The Boring Co's version of the devices to fund his tunnelling projects.\n\nDaniel Reitberg, Escobar Inc COO, said that following their latest victory, the company will 'take down' Musk.\n\nRoberto Escobar accused Tesla Ceo and founder Elon Musk of stealing the idea for his flamethrowers from Escobar Inc\n\nSpaceX CEO Elon Musk (left) sold flamethrowers through his The Boring Company that Roberto Escobar alleges were stolen from his own company\n\nHe told The Next Web: 'Yes [the flamethrower] will be [available], at $249 per piece.\n\n'Elon Musk will go down soon, we are preparing some huge cases against him. He will regret not paying us, just like everyone else has regretted it.'\n\nOlof Gustafsson, CEO of Escobar Inc, claimed the company will launch a technology company to rival Apple.\n\nHe said: 'Pablo Escobar spent hundreds of millions of dollars maintaining his image. We are the only true rights holders of anything relating to Pablo Escobar.\n\n'People need to realise this and contact us for licensing deals. Anybody that does anything relating to Pablo Escobar should consult with us prior.\n\n'We are in the process now of starting a $50 million technology company which will beat Apple Inc, easily.'\n\nIn January Roberto Escobar claimed to have dirt on the US president and launched a GoFundMe campaign to impeach Donald Trump, raising more than $10 million in just 10 hours before the crowdfunding service stopped it to investigate.\n\nEscobar Inc continued to raise money on its Impeach Trump Fund website that included an option to buy an ESCOBAR token cryptocurrency.\n\nPablo Escobar's (left) with one of his notorious hit men 'Popeye' Vasquez (right), who killed more than 300 people and ordered the death of 3,000 to enforce his reign of terror\n\nEscobar Inc filed a cybersquatting claim in August with the National Arbitration Forum in August, arguing that the previous owner of PabloEscobar.com was cybersquatting with his ownership of the domain name.\n\nArbitration panellist Terry F. Peppard did not reportedly question Escobar Inc's trademark claims and the domain owner didn't respond.\n\nAccording to the decision, the domain owner was asking $3 million for the name. The National Arbitration Forum decided to transfer the domain to the Escobar Inc.\n\nEscobar Inc is a private holding company based in Medellín, Colombia, that was first established in 1984 by Roberto De Jesus Escobar Gaviria, brother of Pablo.\n\nThe company is responsible for managing the assets of the Escobar family, including the intellectual property rights and licensing of same.\n\nPablo Escobar\n\nHe has the subject of multiple books, TV shows and films and was killed during a shootout with Colombian National Police in December of 1993.", "description": "Roberto Escobar, brother of drug lord Pablo, won a complaint over the use of www.PabloEscobar.com. He wants to use the domain to sell Escobar-related merchandise online.", "authors": ["Chris Dyer For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/15/19543114-0-image-a-48_1570717792593.jpg", "published_at": "2019-10-10"}