{"pub": "yahoo", "url": "https://news.yahoo.com/strong-economy-why-many-workers-162127675.html", "downloaded_at": "2019-10-20 17:07:42.505085+00:00", "title": "In a Strong Economy, Why Are So Many Workers on Strike?", "language": "en", "text": "At first glance, it may seem like a paradox: Even as the economy rides a 10-year winning streak, tens of thousands of workers across the country, from General Motors employees to teachers in Chicago, are striking to win better wages and benefits.\n\nBut, according to those on strike, the strong growth is precisely the point. Autoworkers, teachers and other workers accepted austerity when the economy was in a free fall, expecting to share in the gains once the recovery took hold.\n\nIncreasingly, however, many of those workers believe that they fell for a sucker’s bet, having watched their employers grow flush while their own incomes barely budged. Corporate profits are near a record high, up nearly 30% since the prerecession peak in 2006. During the same time, the income of the typical household has increased by less than 4%. Some workers are responding with measures like strikes partly as a result.\n\n“That was the understanding — that if we gave up the concessions back in 2007 and 2009, that once GM got back on their feet, we would slowly get those things back,” said Tammy Daggy, who worked at the now-idled GM plant in Lordstown, Ohio, for nearly 25 years. But on many issues, “we never did.”\n\nTo an extent, the pattern of strikes reflects a recurring feature of the labor market: Workers typically become bolder the longer an expansion continues, using the leverage they have when jobs are harder to fill to demand greater compensation. This was particularly true during the three decades after World War II, according to a survey of research by Jake Rosenfeld, a sociologist at Washington University in St. Louis.\n\nOverall strike activity has fallen sharply since the 1970s, as the ranks of unions have been depleted, dropping to about 10% of the workforce from over 25%. Employers have also responded more aggressively — for example, by permanently replacing striking employees.\n\nNow, though, workers appear increasingly willing to walk off the job. Last year, the number of workers who participated in significant strikes soared to nearly 500,000, its highest point since the mid-1980s, while the total duration of such strikes reached a 15-year high.\n\nThe backdrop for this trend is a rising gap between the money employers are making and the portion they are sharing with workers. The share of the national income that workers receive fell in the early 2000s to its lowest level since World War II according to some measures, then collapsed further in 2009. It has yet to recover.\n\nThat may be partly because the labor market is weaker than the picture painted by the official unemployment rate of 3.5%. That rate measures only the number of out-of-work Americans who say they are looking for jobs. It excludes Americans in their prime working years who are not actively looking for work but, given the opportunity, might choose to reenter the workforce.\n\nAccording to Neel Kashkari, president of the Federal Reserve Bank of Minneapolis, the group who could quickly reenter the workforce is potentially large, and may help employers avoid bidding up wages to lure those who are currently employed. “We still don’t know how much shadow labor is out there,” Kashkari said in an interview Thursday.\n\nBut regardless of the strength of the labor market, in recent decades employers have amassed more power to hold wages down.\n\n“In the late 1990s, it seemed like maybe a hot economy was sufficient” to substantially raise workers’ incomes and narrow inequality, said Jason Furman, who led the White House Council of Economic Advisers during President Barack Obama’s second term. But a series of reports that Furman’s council released in 2016 documented changes that have allowed employers to pocket more of the gains from growth. Those changes include noncompete clauses in employment contracts and even outright collusion, in which companies explicitly agree not to hire workers away from one another or to offer identical wages.\n\nEmployers argue that they need additional flexibility with their workforce as they contend with global competition and technological changes.\n\nScholars say there was an element of economic opportunism behind the strikes of the 1950s and ’60s, as unions exploited their bargaining power in tight labor markets.\n\nBut workers say today’s strikes are fueled by a deeper sense of unfairness and economic anxiety. This past week, for example, unions representing about 2,000 workers at copper mines and smelters in Arizona and Texas went on strike, saying their members had not received raises for a decade.", "description": "At first glance, it may seem like a paradox: Even as the economy rides a 10-year winning streak, tens of thousands of workers across the country, from General Motors employees to teachers in Chicago, are striking to win better wages and benefits.But, according to those on strike, the strong growth is", "authors": ["Noam Scheiber"], "top_image": "https://s.yimg.com/uu/api/res/1.2/tZ2xaU43EZWXVDFnou7XBg--~B/aD0yNDAwO3c9MzYwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_new_york_times_articles_158/e7b537eca1d7aad5bf5f3a36a9f9bc46", "published_at": "2019-10-20"}