{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/23/vikings-game-presents-special-opportunity-adrian-peterson-i-helped-build-that-stadium", "downloaded_at": "2019-10-23 16:35:08.470755+00:00", "title": "Vikings game presents a special opportunity for Adrian Peterson: ‘I helped build that stadium’", "language": "en", "text": "When final approval came just months before Peterson would win the NFL’s 2012 MVP award with 2,097 rushing yards, he felt as if his previous six seasons of rushing dominance had helped wrest the last, elusive political votes.\n\nAD\n\nAD\n\n“Of course I helped build that stadium,” he said this week, just days before returning for the Redskins’ game Thursday night against the Vikings.\n\n“What we were able to do with the team, the winning we had, it definitely helped,” Peterson continued. “You think of players like Aaron Rodgers and those guys and the boost they gave to their cities, and you think of the spark that I gave Minnesota.”\n\nIt wouldn’t matter that Peterson would tear the meniscus in his right knee that night or that trainers would oddly carry him through a field-level bar because it was the quickest way to the locker room or that he would only play two more games in U.S. Bank Stadium — one as a Viking and one the next year as a New Orleans Saint. All he remembered three years later was that he prayed.\n\nAD\n\nHe kneels before all his games, but this one was different. He was on his knees for 15 minutes that Sunday night, grateful, he said, for “the opportunities” and “to be doing what I was about to do,” by playing in that stadium that felt like a personal triumph. He gazed through the stands, up the great wall of windows that stretched to the sky and toward the soaring half roof. As he did, he thought about all that had gone into getting the stadium built; the seven Pro Bowl seasons in what would be a 10-year Minnesota career, the three rushing titles, the drives to get to that Super Bowl that kept eluding him.\n\nAD\n\n“I was talking to God,” he said of those moments in the empty end zone. “I was talking to Him about the stadium and where we came from [in the Metrodome and two years at the University of Minnesota] and how we were able to be there at the end. I was just very thankful.”\n\nLast Sunday afternoon, Peterson sprained his ankle. It happened in the mud at FedEx Field, against the San Francisco 49ers, when he was trying to pull the Redskins to an unlikely victory the way he had tried to pull the Vikings to the postseason so many times. The pain in his ankle was so intense when he was hit that he dropped the ball, fumbling away what might have been Washington’s best chance to score in a game it would lose 9-0, all but sealing this as a lost season with a 1-6 record.\n\nHe went for an MRI on Monday and spent most of Tuesday hobbling in a big, gray plastic walking boot that looked as if it should be attached to a ski. But even though he hurt and should probably not play on Thursday given the short rest between games, he was determined to make the game against the Vikings. Much like that night he knelt in the end zone, he knew this trip would be different, bigger than the rest on the Redskins schedule.\n\nAD\n\nAD\n\nThis Thursday’s game features two teams facing their former quarterbacks, with Kirk Cousins lining up against Washington and Case Keenum returning to the field where he threw the pass to Stefon Diggs that became known as the “Minnesota Miracle.” But the most important reunion involves the superstar running back who spent a decade in Minneapolis, running through tacklers and injuries and the 2014 season where an indictment and no-contest plea of recklessly endangering his four-year-old son cost him all but one game.\n\n“He had and made a lot of memories in Minnesota, so it probably will be a little bit of an emotional game for him,” Redskins running back Chris Thompson, who sits almost beside Peterson in the team’s locker room, said this week.\n\n“If it was any other team I would be just as motivated [to play],” Peterson said. “But of course I want to play against Minnesota.”\n\nAD\n\nAD\n\nHow could he not? He wants to see what he can do against the vaunted defense of his former head coach Mike Zimmer, which features several of his former teammates. He might be from rural Texas, might have starred at Oklahoma and might play now for the Redskins, but perhaps the most important 10 years of his life were spent in Minneapolis. He’s been waiting for this day for many months now.\n\nPeterson returns in one of his more challenging years, nothing like the 1,042-yard season he had last year when he helped lead Washington to a 6-3 start that collapsed into 7-9 after season-ending injuries to starting quarterback Alex Smith and backup Colt McCoy. He thought he would be a big part of this season, only to find himself not dressing for the first game after former Coach Jay Gruden decided to play Derrius Guice ahead of him.\n\nThen Gruden went back to Peterson after Guice tore his meniscus in the opener, although never too much, choosing to throw more than run — often out of necessity — during an 0-5 start. When Gruden was fired Oct. 6, his replacement, Bill Callahan, all but declared Peterson to be the offense’s most vital player.\n\nAD\n\nAD\n\n“At the end of the day, it was what it was,” Peterson said of the season’s first weeks. “I thought, ‘I guess we don’t want to use the philosophy that we used last year that helped us win.’ I had to respect him as a head coach and what he wanted to do with his players.\n\n“Even though I wasn’t in agreement with it or … a lot of the other players weren’t in agreement with it, he was the head coach and it’s still his team,” Peterson added. “I was like ‘Okay, I’m all right.’ It immediately changed when he was fired. I knew I wasn’t going to make him change his mind, he’s the head coach. I didn’t stress about it. I didn’t get down. Well, I did get down. But I didn’t allow myself to get too down about it.”\n\nHe chuckled.\n\nAD\n\n“Who knows? Maybe someone could have traded for me,” he said.\n\nNow, after games of 118 and 81 rushing yards, Peterson isn’t thinking about trades. In fact, he often thinks about Emmitt Smith’s all-time rushing record, and despite his being 34 years old and it being nearly 5,000 yards away, he still believes he can catch him. He is also thinking about a season that has fallen apart, and whether he can help stop it as he returns to the stadium he considers to be at least partly his, even if he never really got to play inside.\n\nAD\n\nSo many memories have been coming back from his time in Minnesota, like the day he met Prince after a game. In a way, he will always feel like a Viking. That’s why, no matter how much his ankle might hurt, he seems determined to be on the field Thursday and show a national TV audience that he can still run.\n\nRead more:\n\nAD", "description": "Peterson, who was once Minnesota's most important player, is looking forward to the chance to play his former team.", "authors": ["Les Carpenter", "Reporter Covering Washington Redskins"], "top_image": "https://www.washingtonpost.com/resizer/fED9q2zhuo_npt_ShNTIMXEnZ6o=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/44HKJUHN64I6TO362IBG5YGBTE.jpg", "published_at": "2019-10-23"}