{"pub": "newrepublic", "title": "Deporting Harvard Students Was Always the Goal", "url": "https://newrepublic.com/article/154860/deporting-harvard-students-trump-goal", "language": "en", "published_at": "2019-08-28", "downloaded_at": "2019-09-02 07:00:02.449174+00:00", "text": "Ajjawi was ultimately allowed to call his parents before immigration officials canceled his student visa and put him on a plane back to Lebanon. When contacted by the Crimson and other news outlets, U.S. Customs and Border Protection spokesperson Michael McCarthy offered only the following vague explanation for Ajjawi’s deportation: “This individual was deemed inadmissible to the United States based on information discovered during the CBP inspection.”\n\nAmid the ongoing waves of heartbreaking deportation stories made public in the past two years, Ajjawi’s story stands out for several reasons—the fact of Ajjawi being a Harvard-admitted student chief among them.\n\nMatt Segal, legal director at the ACLU of Massachusetts, pointed to the beliefs underpinning Trump’s chilling anti-immigrant rhetoric. “This story, if accurate, would confirm our worst fears about current immigration policy and border searches: that they will be used not to improve America’s security, but instead to impose Trump’s ideology,” Segal wrote in a statement to TNR.\n\nSarang Sekhavat, the Federal Policy Director at the Massachusetts Immigrant and Refugee Advocacy Coalition (MIRA) echoed the ACLU’s sentiments. “That this happened to Mr. Ajjawi is deeply disappointing but not surprising and is a natural extension of the anti-immigrant and anti-Muslim policies that President Trump has espoused since the launch of his campaign,” Sekhavat wrote in a statement. “Boston has many world-renowned educational institutions that not only provide a first class education to people from all over the world, but also serve as a form of soft power to increase our nation’s standing and reputation in parts of the world that would otherwise have little contact with all that the US has to offer. The actions taken by this administration and amplified by individual officials without oversight create a chilling-effect on those who would otherwise seek out American institutions to further their education and pose a significant threat to global development and American standing.”\n\nAs pointed out by both MIRA and the ACLU, Ajjawi’s case represents the collision of a number of federal immigration policies, not all of which can be directly pinned on Trump’s executive actions and racist rhetoric. The idea that immigration officials were able to stop Ajjawi, comb through his personal electronics—the Crimson story infers he provided them permission—and deport him because of messages he never posted himself is straight out of the Patriot Act playbook. And in some respects, President Barack Obama and the prior enabling Congresses must share some of the blame, as well. Still, there exists a sense of dark irony and disconnect between Trump’s core message of “They’re not sending their best” and Ajjawi’s story.", "description": "Trump's anti-immigration policies were introduced with talk of \"rapists\" and \"murderers,\" but that was just a pretext to come after the rest.", "authors": ["Nick Martin"], "top_image": "https://images.newrepublic.com/599f5d59eb5c9c9b907d7b01bb08be52203cfed3.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg"}