{"pub": "yahoo", "url": "https://sg.news.yahoo.com/khazanah-too-many-airlines-based-231143565.html", "downloaded_at": "2019-10-24 00:35:16.254111+00:00", "title": "Khazanah: Too many airlines based here bad for Malaysia Airlines, weaker ones need to quit", "language": "en", "text": "According to a PAC report, Khazanah managing director Datuk Shahril Ridza Ridzuan said the national carrier was supposed to break even in 2018 and become profitable this year. — Picture by Yusof Mat Isa\n\nKUALA LUMPUR, Oct 24 ― Khazanah Nasional Bhd believes an oversupply of airlines and flights based in the country is the main reason why Malaysia Airlines Bhd’s (MAB) is struggling to make money.\n\nIn a Public Accounts Committee (PAC) report published yesterday, Khazanah managing director Datuk Shahril Ridza Ridzuan said the national carrier was supposed to break even in 2018 and become profitable this year.\n\n“What is the problem with Malaysia Airlines? The problem with Malaysia Airlines is actually a problem with our aviation industry as a whole,” Shahril told the bipartisan PAC when summoned in April to explain Khazanah’s massive RM6.3 billion loss.\n\nKhazanah, through its subsidiary Malaysian Aviation Group Bhd, fully owns MAB.\n\n“If you look at Malaysia today, we actually have four home carriers ― Malaysia Airlines, AirAsia, AirAsia X and Malindo ― in the market of 30 million people and a massive oversupply where effectively you have roughly about 1.7 seats for every actual customer,” Shahril said.\n\nHe was replying to Subang MP Wong Chen, who said that political feedback indicated that the reality about MAB is different from how it is perceived in the public.\n\nShahril said the problem with the industry is with the amount of revenue and not cost, as most airlines have managed very well in cutting down on the latter.\n\nHe also warned that the situation is bound to get worse for the region, as it has the most number of new aircrafts coming in between AirAsia and Malindo’s parent group Lion Group over the next five years.\n\nShahril also pointed to Malaysia’s “open sky policy”, which allows any carrier to fly into Malaysia instead of providing more flights for local-based airlines.\n\n“So, the policy has been good for Malaysia in terms of boosting total passenger numbers, total tourist numbers but it has been terrible for the local airlines, because it essentially, you have cut into the revenue stream by forcing downward pressure on prices in terms of consumers,” he said.\n\nHe then suggested that typically to reduce the excess capacity in an industry, the weakest players would quit the market, or a consolidation of capacity and operation to rationalise the industry as a whole.\n\n“If things were to carry on like this, what essentially it means is that the shareholder of all four airlines, not just Malaysia Airlines, will have to keep pumping money in to sustain operation of their airlines,” he said, adding that AirAsia sets to benefit the most since it has the lowest cost.\n\nReverting to the suggestion later, Wong jokingly asked: “In that case, we just keep supporting you RM1 billion a year for seven years and wait for Malindo to close? [Laughs] I mean that is the strategy, right? [Laughs]”\n\n“Well, probably not best for me to comment on that one,” Shahril replied, to laughter from the room.\n\nOn Tuesday, Economic Affairs Minister Datuk Seri Mohamed Azmin Ali said the government will appoint a strategic partner to take over MAB within the next few months.\n\nAzmin told Parliament that four potential bidders have been shortlisted from 20 received by Khazanah and the airlines’ parent company Malaysian Aviation Group Bhd.\n\nThe sovereign wealth fund has been trying to get MAB off its hands after a botched RM6 billion capital injection since 2014, as well as a massive restructuring which saw the termination of 6,000 employees.\n\nPAC said it is satisfied with Khazanah’s explanation over its RM6.3 billion loss last year, which was due to: a change in the government’s telecommunication policy, financial reporting standards, and a change in investment strategy.\n\nRelated Articles Too few local biz class flyers to keep Malaysia Airlines airborne, Khazanah concludes Why did Khazanah lose RM6.3b in 2018? New policy, strategy and financial reporting, PAC says Malaysia Airlines has bitter pill to swallow on road to recovery, says Qatar Airways CEO", "description": "KUALA LUMPUR, Oct 24 ― Khazanah Nasional Bhd believes an oversupply of airlines and flights based in the country is the main reason why Malaysia Airlines Bhd’s (MAB) is struggling to make money....", "authors": ["Zurairi Ar"], "top_image": "https://s.yimg.com/uu/api/res/1.2/bXUYBku6lnb6S9MSRu3cOA--~B/aD02Njc7dz0xMDAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/mmail.com.my/2351887ac0163680556a03bbd01e91db", "published_at": "2019-10-23"}