{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/1/pope-francis-warns-barbaric-artificial-intelligenc", "downloaded_at": "2019-10-02 00:32:43.820580+00:00", "title": "Pope Francis warns of barbaric artificial intelligence", "language": "en", "text": "ANALYSIS/OPINION:\n\nPope Francis, in a Vatican conference titled, “The Common Good in the Digital Age,” warned that artificial intelligence could one day, if humans aren’t careful, bring about a world where the weak are suppressed and outright ruled by those with the technological mostest — and that would lead to a society more barbaric than free.\n\nAnd as left as this pope typically leans when he speaks of policy and politics, on this, he’s got a point.\n\nHere’s what he said, A.I. News reported: “If mankind’s so-called technological progress were to become an enemy of the common good, this would lead to an unfortunate regression to a form of barbarism dictated by the law of the strongest.”\n\nHere’s what he means: If scientists, researchers and technological wizards don’t consider the ethical and moral sides of what they’re advancing, then humanity will take a back seat to progress. The less fortunate, the less intelligent, the less creative, the less all-around capable will become swept to the side, the shoulder-shrugging byproduct of continuous competitive computer advancement.\n\nThis is true.\n\nThis is a real societal danger.\n\nWe’ve already seen a taste of this sweeping in the business sector where human workers are being replaced with rising frequency with machines. Think retail and self-checkout lines; think customer service and online chatbots.\n\nTechnology has its many positives, but it also forces workers to retrain, re-educate and reevaluate how they might stay relevant — not to mention cost-efficient, in comparison to machines.\n\nNot all are up to the task.\n\nSo as a solution, some Democrats, some Republicans and almost all the socialists and progressives and elitists in the scientific community suggest the implementation of a universal basic income — a sort of set salary for those displaced by, say, robots. A salary for the sake of being alive.\n\nA salary that depends nothing on ability and everything on entitlement.\n\nBut this is not the answer — particularly in America, where the free market is supposed to reign, and where the prices for goods and services — and by logical extension, profits — are driven by demand.\n\nThe pope, in his remarks, didn’t mention job displacement. He focused instead of fake news — on what he called “false data” from A.I.-fueled online sites that “could poison public debates and even manipulate the opinions of millions of people, to the point of endangering the very institutions that guarantee peaceful civil coexistence.”\n\nAnd no doubt, knowing this pope, knowing his leftist way of thinking — his embrace of climate change regulation, his push for open borders around the world, his barely concealed contempt for President Donald Trump — he probably meant “fake news” as code for conservative.\n\nBut he still has a point.\n\nThe pope, warning about the barbaric conditions of societies that embrace technology over humanity, sounds an important alarm.\n\nArtificial intelligence absent moral and ethical people will doom humanity to dark ages.\n\n• Cheryl Chumley can be reached at [email protected] or on Twitter @ckchumley.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Pope Francis warned that artificial intelligence could one day, if humans aren't careful, lead to a world where the weak are suppressed and outright ruled by those with the technological mostest, leading to a barbaric society. And as left as this pope typically leans when he speaks of policy and politics, on this, he's got a point.", "authors": ["The Washington Times Http", "Cheryl K. Chumley"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/30/vatican_pope_migrants_34593_c0-163-3903-2438_s1770x1032.jpg?512ee7dc843c50a4546b334f913071223bc1494e", "published_at": "2019-10-01"}