{"pub": "yahoo", "url": "https://news.yahoo.com/keep-eating-red-meat-controversial-134650319.html", "downloaded_at": "2019-10-04 02:41:46.889950+00:00", "title": "Should you keep eating red meat? Controversial study says well-known health risks are just bad science", "language": "en", "text": "Should you stop eating red meat for health reasons?\n\nThat's the question rocking the nutrition and scientific community after guidelines published in a peer-reviewed journal said people should continue eating red meat, running counter to what many scientific and health organizations have said for years.\n\nThe paper’s authors say the existing evidence is not strong enough to back a guideline that urges people to avoid eating red meat.\n\nGroups like American Heart Association and World Cancer Research Fund recommend people reduce red meat consumption, and the World Health Organization in 2015 even classified processed red meat as a human carcinogen and said all red meat consumption was probably carcinogenic.\n\nHowever, the study's authors reject these sweeping public health claims.\n\n\"It's a form of patriarchy if we just tell people they should eliminate or reduce their meat consumption,\" said Bradley Johnston, the lead study author. \"We don't believe that there should be broad public health recommendations, almost like scare tactics, for the population as a whole.\"\n\nHowever, the paper has drawn sharp criticisms from doctors who say the methodology used to grade the existing research misrepresents the vast data that shows red meat’s ties to adverse health outcomes, like heart disease, cancer or type 2 diabetes.\n\nYou may like: Impossible Burger goes on sale at all Wegmans and two Fairway Market stores\n\nWhat did the research find?\n\nPublished Monday in the Annals of Internal Medicine, the guideline \"suggests that adults continue current unprocessed red meat … (and) processed meat consumption.”\n\nThe recommendations were based on five analyses of existing research: four on the health effects of eating red meat and one on people's health-related preferences on red meat, meaning how much they value meat and its effects on their health.\n\nJohnston, a professor of community health and epidemiology at Dalhousie University in Halifax, Nova Scotia, said his group used the GRADE standard of analyzing scientific evidence to make a determination about existing research.\n\nGRADE is one method to review existing scientific evidence and make a recommendation based on its strength, and it gives higher weight to randomized controlled trials than to observational studies, which many nutrition studies are.\n\n\"Based on these reviews, we cannot say with any certainty that reducing red meat or processed meat will prevent cancer, diabetes or heart disease,\" Johnston said.\n\nConsider this: How plant-based stacks up versus animal-based meats\n\nWhy are people criticizing the research?\n\nThe Annals’ paper has drawn sharp criticism from some researchers in the scientific community who say evidence does show the link between eating red meat and health problems.\n\n“Nothing new is coming out of the study,\" said Dr. Frank Hu, chairman of the Department of Nutrition at Harvard T.H. Chan School of Public Health. \"There was no breakthrough. It just confirmed previous findings.\"\n\nDr. Neal Barnard, a professor of internal medicine at George Washington University who is also critical of the guidelines, said the Johnston group's analyses show \"clear evidence that if you do reduce red meat that your risk of stroke, diabetes, heart attack and cancer not only goes down, but that it's statistically significant.\"\n\nThe issue, the doctors say, is that the guidelines published in Annals do not match up with the analyses Johnston's group did.\n\nBarnard, also president of the Physicians Committee for Responsible Medicine, has since filed a petition with the Federal Trade Commission through his group, saying the Annals of Internal Medicine misrepresented the new guidelines as definitive and did not accurately describe the risks of red meat.\n\nMore about your diet: Mediterranean is the best way to eat in 2019, according to new diet rankings\n\nWhat much of the difference comes down to is whether the use of the GRADE system to rate the quality of existing data was appropriate.\n\nDr. Christine Laine, editor of the Annals of Internal Medicine, said the reviews and guidelines are valuable because they provide a transparent and independent look at existing data and make a recommendation based on the clear methodology of the GRADE system.", "description": "A study from the NutriRECS group published in the Annals of Internal Medicine urged adults to keep eating red meat. Doctors are now pushing back.", "authors": ["Ryan W. Miller", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/7fxvE_RZtp5_Qx924sp1cA--~B/aD01NDA7dz05NjA7c209MTthcHBpZD15dGFjaHlvbg--/http://d.yimg.com/hd/cp-video-transcode/1009217/f940929f-fe2d-4932-ab80-fa14c6a227f1/420ff5a2-7651-51d1-aaa9-2130b291004d/data_3_0.jpg?s=c33c22639d212268ccada21f4fb6197d&c=c5dcf48d654e7717248c936227700f1e&a=tripleplay4us&mr=0", "published_at": "2019-10-03"}