{"pub": "reuters", "url": "https://af.reuters.com/article/sportsNews/idAFKBN1WB0T5-OZASP", "downloaded_at": "2019-09-26 15:23:00.129989+00:00", "title": "South Africa will be stronger after New Zealand defeat –Boks' Nienaber", "language": "en", "text": "NAGOYA (Reuters) - South Africa defence coach Jacques Nienaber has warned Rugby World Cup rivals the team has emerged stronger from its opening 23-13 Pool B loss to New Zealand in Yokohama.\n\nSouth Africa's Pieter-Steph du Toit scores their first try REUTERS/Annegret Hilse\n\nThe Springboks dominated large parts of the match on Sept. 21 but were undone by two tries in four minutes from the world champions, both coming from South African errors in fielding high balls.\n\nBok coach Rassie Erasmus said afterwards that the All Blacks had played almost a ‘South Africa-style’ kicking game that meant his side had to adapt their tactics, and Nienaber believes the lessons from the match will only strengthen the squad for later in the tournament.\n\n“I told Rassie it is probably a benefit to have almost played a semi-final style game in the pool stages,” Nienaber told reporters in Nagoya.\n\n“I know it is a cliché that everybody says when they lose, that ‘we learnt a lot out of it’, but we did. For us it was a great match in terms of tactical, physical and getting challenged in all departments.\n\n“Mentally ... the build-up during the week, the enormousness of the game, the physicality and speed. You know if you play the All Blacks and you make two errors, it is 14 points (against you), so it was nice to play in a game like that where there is so much pressure.”\n\nThe Boks are next in action against minnow neighbours Namibia in Toyota City on Sept. 28 and have made 13 changes to their side in what is expected to be a comfortable win.\n\nFar from being down after the New Zealand loss, Nienaber said the mood in the squad has been one of steely determination.\n\n“We have had an unbelievable vibe at training in terms of the intensity and the things we wanted to fix. Our system will develop and New Zealand opened up something in the way they attacked and their style of play that we have to work on, so it was nice to get that (challenge).”\n\nThe Boks are widely expected to breeze to a bonus-point win over Namibia, which lost its opener 47-22 to Italy, but Nienaber said there are no specific targets in the game other than to put in a performance that showcases what the team has worked on in training.\n\n“We have a plan in terms of developing the squad and that will always take precedence over everything else. We are trying to develop our game across all facets - attack, defence, kicking and mental approach,” he said.\n\n“We are always trying to improve, so there is no points limit, or to say, ‘if we only concede three points that would be a good defensive performance’, or ‘if we concede 30 I will be disappointed’.\n\n“We want to build our systems and the skill-set of our individual players. Seeing improvement there will be more enjoyable than whether we concede 30 points or no points.”", "description": "South Africa defence coach Jacques Nienaber has warned Rugby World Cup rivals the team has emerged stronger from its opening 23-13 Pool B loss to New Zealand in Yokohama.", "authors": ["Nick Said", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190926&t=2&i=1434061101&w=1200&r=LYNXMPEF8P0GR-OZASP", "published_at": "2019-09-26"}