{"pub": "thehill", "url": "https://thehill.com/opinion/opinion/467524-reasons-for-economic-optimism-even-in-manufacturing", "downloaded_at": "2019-10-25 22:10:07.401289+00:00", "title": "Reasons for economic optimism — even in manufacturing", "language": "en", "text": "The decline in durable goods orders for September was another reminder of how difficult conditions have been this year for the manufacturing sector. The primary drag over the course of the year has been the pall cast by the implementation of tariffs and, more importantly, the uncertainty regarding the outlook for trade policy. Businesses with a global scope have put many of their prospective investment projects on hold in recent months, waiting for more clarity on the future of U.S.-China trade relations and the likely course for global supply chains.\n\nTo make matters worse, one of the largest corporations relevant to the durable goods portion of the manufacturing sector has been hamstrung virtually the entire year. The grounding of Boeing’s 737 MAX has led to a dramatic slowdown in new orders and shipments of that aircraft, adding up to a discernible drag on overall economic activity and particularly on manufacturing production. When the 737 MAX was initially grounded, the assumption was that it would be back in good standing with regulators by now. But the process for signing off on the controversial aircraft has languished and may now stretch into early 2020.\n\nOn top of all that, the manufacturing sector was struck by yet another blow recently, when the United Automobile Workers called for a companywide strike against General Motors. The automaker’s assembly lines came to a halt in mid-September and have been idle since. Union leaders and GM management reached a tentative deal last week, but the UAW chose to continue its strike until the rank-and-file have formally approved the contract. Thus, even in a best-case scenario (the union approves the deal), GM production will have been idle for half of September and virtually all of October.\n\nADVERTISEMENT\n\nGiven this toxic cocktail of developments, it should be no surprise that the factory sector of the economy is struggling mightily. Broad gauges such as the Fed’s measure of industrial production and the ISM’s diffusion index point to a mild contraction in manufacturing activity, even as the overall economy continues to expand at a moderate pace. Indeed, there is a wide and growing divergence in the economy between sectors that are global-facing (e.g. manufacturing, business investment and exports), which are at best treading water, and those areas that are predominantly domestic in nature (consumer spending, the labor market, services and housing), which continue to perform well.\n\nLooking ahead, these drags on the manufacturing sector should unwind. Going in reverse order, the GM strike is likely to be resolved within the next week or two if the UAW approves the tentative deal. The automaker is likely to get busy in November and December, attempting to make up for lost time in assembling vehicles such as pickup trucks and SUVs that are in high demand. While Boeing’s 737 MAX issues seem endless, the airline will presumably eventually satisfy regulators at the FAA and other global safety agencies. Once the MAX is recertified, airlines will presumably be happy to take delivery of the planes that they have ordered and resume their bookings of new planes. Thus it seems likely that Boeing’s assembly lines will return to normal at some point in the first half of 2020.\n\nThat still leaves the big cloud over the manufacturing sector: The trade dispute with China. Here, the election cycle may play a role in how developments play out. President Trump Donald John TrumpCharles Barkley: 'Vice President Pence needs to shut the hell up' Democrats say whistleblower deposition no longer central to impeachment investigation: report Trump plans to appeal House subpoena for financial records to Supreme Court MORE is undoubtedly going to base his reelection appeal in large part on the strength of the economy. Thus, the administration is likely to do everything it can to ensure that the economy is performing at its best once the campaign season swings into full gear.\n\nPresident Trump has it within his power to lift a significant risk for the economy by creating a more favorable atmosphere for trade relations and thus for global trade flows. Indeed, the interim trade deal struck earlier this month was arguably a response to the economic damage that had occurred in the wake of the ratcheting up of tariffs in August.\n\nThus, while there are plenty of things that could go wrong, a case can be made that the manufacturing sector is going through its worst stretch right now and that things should improve from here.\n\nStephen Stanley is chief economist for Amherst Pierpont Securities, a broker dealer providing institutional and middle-market clients with access to fixed-income products.", "description": "President Trump has it within his power to lift a significant risk for the economy by creating a more favorable atmosphere for trade relations and thus for global trade flows.", "authors": [], "top_image": "https://thehill.com/sites/default/files/blogs/manufacturing.jpg", "published_at": "2019-10-25"}