{"pub": "guardian", "url": "https://theguardian.com/travel/2019/sep/15/omori-village-hiroshima-japan-sustainable-traditional-abeke-gungendo-shibusa", "downloaded_at": "2019-09-15 10:55:30.943624+00:00", "title": "A new take on old Japan – that's Omori", "language": "en", "text": "One summer’s day 14 years ago, my husband and I and our then two-year-old daughter, Addie, took a fast train, a slow train, a bus and a car to get from Kyoto to a 400-person village called Omori, near the Sea of Japan about 70 miles north of Hiroshima. In a narrow valley amid forested hills, Omori had one main street, few cars and even fewer shops. Most of the people seemed to be around 60 or older and lived in wooden houses, some originally owned by samurai, with tiled roofs and sliding wooden doors.\n\nOmori had once been famous for its nearby underground silver mine, Iwami Ginzan, which was open between 1526 and 1923 and a Unesco world heritage site since 2007. But by the time Tomi Matsuba and her husband, Daikichi, moved there in the early 1980s most of the homes sat empty. Daikichi’s parents, who ran a kimono business there, encouraged Tomi and Daikichi to settle elsewhere. But the young couple had ideas about recapturing the beauty and pace of rural Japan by working with local artisans and farmers.\n\nWhen Tomi began to make clothes for her daughter, neighbours and friends asked her to do the same for them. Soon, Daikichi was selling the clothing at railway stations and department store events. Within a few years, the couple were turning down offers from big companies. Instead, they opened their own shop, which they called Gungendo, a word adapted from a Chinese proverb about people sharing their knowledge and opinions to work together.\n\nOn my family’s first trip to Omori, the shop had been open for several years and it was large and modern, with exposed wood and glass walls and a cafe that looked on to a garden. One room had shelves of handmade tea cups with ridges like sand, whimsical baby clothes and local jams and sauces. In another room hung women’s cotton and linen skirts, shirts and pants, many of them designed by Tomi.\n\nFacebook Twitter Pinterest Rooms at Takyo Abeke retain the Edo style.\n\nAnd when we paid attention – and the Matsubas always encouraged people to slow down and pay attention – the shop offered little surprises everywhere. There was the tiny door to the garden only big enough for a child to fit through. In the bathroom, stones gathered at the drain of the bathroom sink were so smooth I wanted to scoop them into my hands. And hidden among the garden’s trees were two metal sculptures, made by a local artist known as Yoshida. Tall and round with amorphous faces and arms stretching toward the sky, they looked as if they might be friends with Totoro, from the popular animated tale.\n\nThe most magical place, though, was the Matsubas’ home, an Edo-period building that they had spent more than a decade restoring with materials from an old school and demolished houses, and even bits and pieces of wood they found on the street. A stone path, lined with a clan of Yoshida’s sculptures, led to the entrance. Beyond the noren curtains, rooms flowed into other rooms, with shoji screen doors that opened on to porches and simple gardens. Along a pathway, woven wicker baskets hung from the walls. And in the gardens, stone sculptures peeked from the bushes.\n\nAt night, Tomi invited us to take a bath in a handmade wooden tub that was so deep we could almost have swum. Next to it stood a stove that heated stones in the winter, turning the room into a sauna. In summer, the stained-glass and wood sliding doors opened to the stars outside.\n\nFacebook Twitter Pinterest Rice balls are made from local grains.\n\nTomi cooked dinners of sushi, tempura, pickled vegetables and soups, along with a traditional Japanese breakfast one morning and pancakes and fresh fruits the next. We’d spent weeks eating fabulous food in Japan, but hers was the best. Though Tomi mostly cooked for people she knew well – her family, employees of the store – she also included guests she’d never met, like us: friends of a friend of another friend. She relished introducing people to the Japan she loved, as it once was, as it still was in Omori.\n\nFor the first time in more than a decade, I recently returned to Omori with Addie. I scheduled the trip so that Omori was the last stop – an antidote to days of konbinis (convenience stores), subways, temples, bullet trains, sprees at Uniqlo stores and carousel sushi restaurants. Now Gungendo has a website and the Matsubas have more than 28 shops within department stores and other commercial spaces throughout the country, as well as four freestanding stores. Of Gungendo’s 180 employees, about 50 work in Omori, where Tomi and others design the fabrics and clothes and ship them to shops and customers throughout Japan. The Matsubas had also turned their home into Takyo Abeke – an inn sleeping 12, which is often booked months in advance, as is a newer, second guest house called Katoke.\n\nFacebook Twitter Pinterest Omori has an overtly traditional feel. Photograph: Masao Ishihara/Getty Images\n\nOther things have evolved over the past decade, too. Tomi no longer makes all the meals herself: her head chef, Takuro Onodera, cooks for guests, following a book of recipes created by Tomi and previous Abeke chefs. The meals are not designed to be fancy or gourmet, but simple, fresh and replicable. And though she and her husband now live down the street, Tomi joins her guests for almost every breakfast and dinner.\n\nOn our first night, Onodera created about 15 dishes, served family-style at the kitchen’s long communal table: peeled fresh tomatoes soaked in black vinegar and maple syrup, and blackthroat sea perch (nodoguro) caught in the nearby Sea of Japan and cooked with soy sauce and sweet sake. There were bowls of smoked edamame and sesame tofu, dishes of sesame snap peas and a homemade pizza with dried sardines, pickled vegetables and a local cheese.\n\nMany of the vegetables were locally grown. The fish was from a port just 20 minutes away. Even the sea salt came from a nearby salt farmer.\n\nFacebook Twitter Pinterest The 260-year-old farmhouse that the Matsubas bought at auction and moved, in pieces, to Omori. Photograph: Maggie Jones\n\nThen there were the rice balls, onigiri and omusubi. Perhaps it was the seasoning that made them so delicious. Or the fact that the rice was harvested from a nearby rice terrace. Or maybe it was because, while many Japanese make their rice in a steamer, at Takyo Abeke the rice – like most of the food – is cooked on the large woodburning stove that Tomi calls the heart of the home.\n\nAfter breakfast the next morning – broth with strips of hardened tofu and seaweed, pickled plums, rice porridge and a whole, though small, mackerel – I joined the morning tour Tomi offers her guests. The architectural scale of the town has remained virtually unchanged over the past 200 years and Tomi pointed out several of the 10 buildings she and her husband have renovated, all of which retain the Edo style. One of the most serene was the community centre, Mujaku-an, a simple, one-floor building without running water or electricity, where many of the ideas for Gungendo were sparked.\n\nFacebook Twitter Pinterest Breakfast at Abeke House. Photograph: Maggie Jones\n\nCultural highlights of Japan: readers’ travel tips Read more\n\nFurther down the street, Tomi pointed out a bakery run by a Japanese-born, German-trained baker who settled in Omori not long ago with his family. Over the next couple of days, it would become our late-morning snack stop for brioches, warm pretzels, and raisin and olive breads.\n\nA few blocks away stood Tomi’s business headquarters and next to it a majestic 260-year-old thatched farmhouse that the Matsubas bought at auction – using their profits, along with a crowdfunding campaign – in neighbouring Hiroshima Prefecture. They moved the entire thing, in pieces, to Omori and hired about a dozen workers to restore the thatched roof. The building is now the gathering spot for employee lunches, meetings and retreats.\n\nFacebook Twitter Pinterest A house restored by Gungendo, which aims to value the styles and tastes from previous generations. Photograph: Courtesy of Gungendo\n\nOutsiders have put down roots in town, including a violinist with the Orchestre National de France who lives in Omori when she isn’t in France. Louie Miura, who jointly heads Gungendo’s PR department, lives here too, having met Daikichi when he visited Miura’s university to speak about Gungendo. Another employee, Mizu Ohkouchi, told me she visited Takyo Abeke several years ago for a one-night break. Tomi offered her a job on the spot after Ohkouchi told her she was unhappy in Tokyo.\n\nChildren are also helping boost the population. About 20 babies have been born here in the past couple of years. On our first day, we met Tomi’s daughter Yukiko out for a walk, one newborn twin in a carrier on her chest, the other sharing a buggy with her two-year-old sister, Haniwa. Yukiko remembered my daughter from years earlier and immediately put one of her babies in Addie’s arms. Unsure exactly what Addie would do for two days in Omori, I suggested that she help Yukiko with the children.\n\nFacebook Twitter Pinterest Addie (second left) meets some of the newest members of town. Tomi Matsuba is on the far right; her daughter Yukiko is behind the stroller . Photograph: Maggie Jones\n\nAs often happens in Omori, Addie became immersed in the life. She spent the next day with Yukiko and her family, going on walks and shopping for groceries. Addie helped cook lunch and wash the kids’ clothes, and she and Haniwa picked plums for pickling. For better or worse, Addie also introduced Haniwa to the wonders of Snapchat filters.\n\nAt dinner that night, Tomi told Addie she had a gift with children. I suggested half-joking that Addie could return the next summer as a babysitter. But really it was me who longed for more time in town and with Tomi’s family and her philosophy. I longed to make the Omori life a bit of my own.\n\n• Rooms (sleeping up to 4) from around £229 half-board (including alcohol), kurasuyado.jp/takyo-abeke. More information on the Matsubas, Takyo Abeke and the village at oishisojapan.com\n\nLooking for a holiday with a difference? Browse Guardian Holidays to see a range of fantastic trips", "description": "In a village north of Hiroshima, traditional culture is evolving into a modern idyll, as a talented family revives the fortunes of a quiet backwater", "authors": ["Maggie Jones"], "top_image": "https://i.guim.co.uk/img/media/1d143897aecfd320a26e941c38e60c4e4a7b358c/0_36_5025_3015/master/5025.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b5aa71367c00f10df6b372649c13a155", "published_at": "2019-09-15"}