{"pub": "cnbc", "url": "https://cnbc.com/2017/09/28/10-silly-things-you-do-that-make-you-less-likable.html", "downloaded_at": "2019-10-07 06:54:19.037292+00:00", "title": "10 silly things you do that make you less likable", "language": "en", "text": "Too many people succumb to the mistaken belief that being likable comes from natural, unteachable traits that belong only to a lucky few — the good looking, the fiercely social, and the incredibly talented. It's easy to fall prey to this misconception. In reality, being likable is under your control, and it's a matter of emotional intelligence (EQ). In a study conducted at UCLA, subjects rated over 500 descriptions of people based on their perceived significance to likability. The top-rated descriptors had nothing to do with being gregarious, intelligent, or attractive (innate characteristics). Instead, the top descriptors were sincerity, transparency, and capable of understanding (another person). More from Travis Bradberry:\n\n50 inspirational quotes to motivate you\n\n6 unusual habits of the world's most creative people\n\nFour ways sleeping naked makes you healthier and wealthier These adjectives, and others like them, describe people who are skilled in the social side of emotional intelligence. TalentSmart research data from more than a million people shows that people who possess these skills aren't just highly likable; they outperform those who don't by a large margin.\n\nLikability is so powerful that it can completely alter your performance. A University of Massachusetts study found that managers were willing to accept an auditor's argument with no supporting evidence if he or she was likable, and Jack Zenger found that just one in 2000 unlikable leaders are considered effective. I did some digging to uncover the key behaviors that hold people back when it comes to likability. Make certain these behaviors don't catch you by surprise.\n\nHumble-bragging\n\nWe all know those people who like to brag about themselves behind the mask of self-deprecation. For example, the gal who makes fun of herself for being a nerd when she really wants to draw attention to the fact that she's smart or the guy who makes fun of himself for having a strict diet when he really wants you to know how healthy and fit he is. While many people think that self-deprecation masks their bragging, everyone sees right through it. This makes the bragging all the more frustrating, because it isn't just bragging; it's also an attempt to deceive.\n\nBeing too serious\n\nPeople gravitate toward those who are passionate. That said, it's easy for passionate people to come across as too serious or uninterested, because they tend to get absorbed in their work. Likable people balance their passion for their work with their ability to have fun. At work they are serious, yet friendly. They still get things done because they are socially effective in short amounts of time and they capitalize on valuable social moments. They focus on having meaningful interactions with their coworkers, remembering what people said to them yesterday or last week, which shows people that they are just as important to them as their work is.\n\nNot asking enough questions\n\nThe biggest mistake people make in conversation is being so focused on what they're going to say next or how what the other person is saying is going to affect them that they fail to hear what's being said. The words come through loud and clear, but the meaning is lost. A simple way to avoid this is to ask a lot of questions. People like to know you're listening, and something as simple as a clarification question shows that not only are you listening but that you also care about what they're saying. You'll be surprised how much respect and appreciation you gain just by asking questions.\n\nEmotional hijackings\n\nMy company provides 360 degree feedback assessments, and we come across far too many instances of people throwing things, screaming, making people cry, and other telltale signs of an emotional hijacking. An emotional hijacking demonstrates low emotional intelligence. As soon as you show that level of instability, people will question whether or not you're trustworthy and capable of keeping it together when it counts. Exploding at anyone, regardless of how much they might \"deserve it,\" turns a huge amount of negative attention your way. You'll be labeled as unstable, unapproachable, and intimidating. Controlling your emotions keeps you in the driver's seat. When you're able to control your emotions around someone who wrongs you, they end up looking bad instead of you.\n\nWhipping out your phone\n\nNothing turns someone off to you like a mid-conversation text message or even a quick glance at your phone. When you commit to a conversation, focus all of your energy on the conversation. You'll find that conversations are more enjoyable and effective when you immerse yourself in them.\n\nName-dropping\n\nIt's great to know important and interesting people, but using every conversation as an opportunity to name-drop is pretentious and silly. Just like humble-bragging, people see right through it. Instead of making you look interesting, it makes people feel as though you're insecure and overly concerned with having them like you. It also cheapens what you have to offer. When you connect everything you know with who you know (instead of what you know or what you think), conversations lose their color. People are averse to those who are desperate for attention. Simply being friendly and considerate is all you need to win people over. When you speak in a friendly, confident, and concise manner, people are much more attentive and persuadable than if you try to show them that you're important. People catch on to your attitude quickly and are more attracted to the right attitude than who you know.\n\nGossiping\n\nPeople make themselves look terrible when they get carried away with gossiping. Wallowing in talk of other people's misdeeds or misfortunes may end up hurting their feelings if the gossip ever finds its way to them, but gossiping is guaranteed to make you look negative and spiteful every time.\n\nHaving a closed mind\n\nIf you want to be likeable, you must be open-minded, which makes you approachable and interesting to others. No one wants to have a conversation with someone who has already formed an opinion and is unwilling to listen. Having an open mind is crucial in the workplace, where approachability means access to new ideas and help. To eliminate preconceived notions and judgment, you need to see the world through other people's eyes. This doesn't require that you believe what they believe or condone their behavior; it simply means that you quit passing judgment long enough to truly understand what makes them tick.\n\nSharing too much, too early\n\nWhile getting to know people requires a healthy amount of sharing, sharing too much about yourself right off the bat comes across wrong. Be careful to avoid sharing personal problems and confessions too quickly. Likable people let the other person guide them as to when it's the right time for them to open up. Over-sharing comes across as self-obsessed and insensitive to the balance of the conversation. Think of it this way: if you're getting into the nitty gritty of your life without learning about the other person first, you're sending the message that you see them as nothing more than a sounding board for your problems.\n\nSharing too much on social media\n\nStudies have shown that people who over-share on social media do so because they crave acceptance, but the Pew Research Center has revealed that this over-sharing works against them by making people dislike them. Sharing on social media can be an important mode of expression, but it needs to be done thoughtfully and with some self-control. Letting everyone know what you ate for breakfast, lunch, and dinner along with how many times you walked your dog today will do much more harm than good when it comes to likability. Dr. Travis Bradberry is the award-winning co-author of the No. 1 bestselling book, \"Emotional Intelligence 2.0\" and the co-founder of TalentSmart, the world's leading provider of emotional intelligence tests and training, serving more than 75 percent of Fortune 500 companies. Like this story? Like CNBC Make It on Facebook. Don't Miss: 5 psychological tricks that can help you get ahead in your career This article originally appeared on LinkedIn.", "description": "These common, off-putting habits will cost you.", "authors": ["Travis Bradberry"], "top_image": "https://image.cnbcfm.com/api/v1/image/104707517-jean_ralphio_aziz_computer.jpg?v=1532563762", "published_at": "2017-09-28"}