{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/celebrities/2019/10/07/alex-trebek-jeopardy-host-pancreatic-cancer-diagnosis/3896011002", "downloaded_at": "2019-10-07 20:02:29.746965+00:00", "title": "'I'm not afraid of dying': 'Jeopardy!' host Alex Trebek opens up about cancer diagnosis", "language": "en", "text": "CLOSE \"Jeopardy!\" host Alex Trebek revealed his fans' thoughts and prayers have made a positive difference during his battle with pancreatic cancer. USA TODAY\n\nAlex Trebek knows his public battle with Stage 4 pancreatic cancer has become an inspiration to fans around the world. But there are times when the \"Jeopardy!\" host wonders if he should have gone public in the first place.\n\n\"There are a lot of people out there who have cancers who continue to live their lives and go about their business and do it without recognition,\" Trebek, 79, said in an interview with CTV News. \"To be the inspiration to a lot of other people makes me feel good, but it does place a responsibility on me that I feel I'm not deserving of.\"\n\nAfter revealing his cancer in March, Trebek has been approached by others with similar diagnoses, hoping the longtime friendly TV figure will give them reassurance. He recalled recently being contacted by a woman about 10 years his junior who recently learned she had pancreatic cancer.\n\n\"I tried to cheer her up best I could, but it's tough to be as optimistic as you can when the other person feels none of that optimism. They feel only despair. And I don't know that I'm strong enough or intelligent enough to alleviate that despair.\" he said. \"There are moment when I have some regrets about having gone public with it because there's a little too much of Alex Trebek out there and I regret that. I have become, in many ways, the spokesperson for pancreatic cancer and I'm not sure… there are a lot of expectations.\"\n\nAlex Trebek poses for a photo in 2017. (Photo: Emma McIntyre, Getty Images)\n\nNow in his second round of chemotherapy, he says there are occasional \"weaknesses,\" but he always feels good to go when it's time to record \"Jeopardy!\"\n\n\"I will keep doing (the show) as long as my skills do not diminish. And they have started to diminish,\" Trebek said, noting a chemo side affect occasionally makes him slur his words. \"When I feel my skills have diminished to the point where I notice and am bothered by it because all the people around me are saying, 'No, it's OK!' But there will come a point when they're no longer able to say 'It's OK' … We'll play it by ear and keep chunking along until we either win or lose.\"\n\nHe added: \"The thought of the pancreatic cancer does not frighten me. I'm not afraid of dying. One thing they're not going to say at my funeral as part of a eulogy: 'He was taken from us too soon.' I'm 79 years old. I have lived a good life, a full life and I'm nearing the end of that life. I know that. I'm not going to delude myself.\"\n\n'I'm still here': Alex Trebek launches Season 36 of 'Jeopardy!' after cancer diagnosis\n\n'Jeopardy!': Did Jason Zuffranieri extend his 19-game win streak?\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/celebrities/2019/10/07/alex-trebek-jeopardy-host-pancreatic-cancer-diagnosis/3896011002/", "description": "\"Jeopardy!\" host Alex Trebek got brutally honest about his stage 4 pancreatic cancer diagnosis and how it feels to battle the disease so publicly.", "authors": ["Hannah Yasharoff", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/03/06/USAT/9f69e978-8035-46cf-b03d-b0fade5582d4-4710.jpg?crop=2999,1687,x0,y76&width=3200&height=1680&fit=bounds", "published_at": "2019-10-07"}