{"pub": "axios", "url": "https://prnewswire.com/news-releases/united-states-postal-service-announces-retirement-of-postmaster-general-megan-j-brennan-300939877.html", "downloaded_at": "2019-10-17 01:49:28.410638+00:00", "title": "United States Postal Service Announces Retirement of Postmaster General Megan J. Brennan", "language": "en", "text": "WASHINGTON, Oct. 16, 2019 /PRNewswire/ -- The United States Postal Service today announced that Megan J. Brennan, Postmaster General and Chief Executive Officer, is retiring effective Jan. 31, 2020.\n\n\"Megan Brennan is a devoted public servant who has helped lead the United States Postal Service through some very challenging circumstances,\" said Robert M. Duncan, Chairman of the Board of Governors. \"The Governors greatly appreciate her leadership and devotion to the Postal Service.\"\n\n\"Having begun her career as a letter carrier more than three decades ago, Megan has a fundamental understanding of the important role this organization plays in communities around the country and to our broader economy,\" said Duncan. \"She has been a strong advocate for postal employees and customers. We especially appreciate her recent leadership of the Postal Service's efforts to make significant changes to the international mail system, and level the playing field for American businesses.\"\n\n\"In the months to come, the Governors will conduct a nationwide search for the 75th Postmaster General of the United States, while continuing to work with Postmaster General Brennan through a successful holiday season and a seamless transition in leadership.\"\n\nBrennan expressed her sincere gratitude to the men and women of the United States Postal Service, \"I have had the privilege to work with you over the course of my 33-year career. You embody the spirit of public service, you earn the trust of the American people every day, and you continually reinforce my reverence for this institution and my abiding belief in our mission.\"\n\nBrennan is the 74th Postmaster General and first woman to serve in this role. Upon her retirement she will have served in the position for five years. Brennan previously served as Chief Operating Officer and Executive Vice President of the Postal Service for four years, and held prior roles as Vice President of both Eastern Area and Northeast Area Operations. Brennan began her Postal Service career as a letter carrier in Lancaster, PA.\n\nAs Postmaster General, Brennan advanced technology and customer-centric strategies to invest in the future of the Postal Service, and to shape growth opportunities for the organization and the industries it serves. These strategies encompassed better use of data and technology, improved speed to market of product and service innovations, continuously improved processes throughout the organization and fully engaged and leveraged the talents of the organizations 635,000-employee workforce.\n\n\"When I was appointed Postmaster General, I made a commitment to the Board of Governors that I would serve for five years and it has been my absolute honor to do so,\" said Brennan. \"I feel a deep responsibility to this organization and to its future. The advance notice of my retirement will allow the Board adequate time to conduct an executive search, select the next Postmaster General, and ensure a seamless transition.\"\n\nThe Postal Service receives no tax dollars for operating expenses and relies on the sale of postage, products and services to fund its operations.\n\nPlease Note: For U.S. Postal Service media resources, including broadcast quality video and audio and photo stills, visit the USPS Newsroom. Follow us on Twitter,Instagram, Pinterest, and LinkedIn. Subscribe to the USPS YouTube Channel, like us on Facebook and enjoy our Postal Posts blog. For more information about the Postal Service, visit usps.com and facts.usps.com.\n\nContact: Dave Partenheimer\n\n202-268-2599\n\ndavid.a.partenheimer@usps.gov\n\nusps.com/news\n\nSOURCE U.S. Postal Service\n\nRelated Links\n\nhttp://www.usps.com\n\n", "description": "WASHINGTON, Oct. 16, 2019 /PRNewswire/ -- The United States Postal Service today announced that Megan J. Brennan, Postmaster General and Chief Executive...", "authors": ["U.S. Postal Service"], "top_image": "https://mma.prnewswire.com/media/645058/US_Postal_Service_Logo.jpg?p=facebook", "published_at": "2019-10-16"}