{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7627663/Johnson-Johnson-says-new-tests-no-asbestos-FDA-tested-baby-powder.html", "downloaded_at": "2019-10-30 00:12:40.209112+00:00", "title": "Johnson & Johnson claims the same baby powder FDA found asbestos in is now NEGATIVE", "language": "en", "text": "Johnson & Johnson said on Tuesday that 15 new tests found no asbestos in a bottle of baby powder that the US Food and Drug Administration (FDA) says tested positive for trace amounts of asbestos.\n\nBut the FDA is standing firmly by its own test results, the agency told Reuters.\n\nThe tests are the latest effort by J&J to prove the safety of its widely used consumer product after a test by the FDA prompted J&J to undertake a nationwide recall of one lot of its Johnson's Baby Powder - the first time its ever done so over asbestos.\n\n'They would say the product is free of asbestos based on their testing, and we would say the opposite for that sample,' said Steve Musser, deputy director for scientific operations in the FDA's Center for Food Safety and Nutrition.\n\nJohnson & Johnson now claims its done 15 additional tests of the same baby powder bottle that the FDA said was positive for asbestos - and found it's not. But the FDA stands by its own finding, according to an interview with Reuters\n\nEarlier this month, J&J recalled around 33,000 bottles of baby powder in the United States after the FDA found trace amounts of asbestos in samples taken from a bottle purchased online.\n\n'Rigorous and third-party testing confirms there is no asbestos in Johnson's Baby Powder. We stand by the safety of our product,' J&J said in a statement.\n\nThe company did not immediately respond to a request for additional comment on the FDA standing by its test result.\n\nThe different test outcomes could have resulted from the fact that contaminants are not uniformly dispersed throughout talc and there is no standard test for asbestos in talc, FDA officials said.\n\nThe voluntary recall was limited to one lot of Johnson´s Baby Powder produced and shipped in the United States in 2018, the company said at the time.\n\nThat move marked the first time the company recalled its iconic baby powder for possible asbestos contamination, and the first time US regulators have announced a finding of asbestos in the product.\n\nAsbestos is a known carcinogen that has been linked to deadly mesothelioma.\n\nJ&J will not reverse the recall of those 22-ounce containers, but its baby powder remains available to consumers in stores, a company spokesman told Reuters.\n\nHowever, retailers including Walmart, CVS, Target, Walgreens and Rite Aid have all voluntarily pulled the 22-ounce bottles from their store shelves and online markets.\n\nThe recall had been the latest blow to the more than 130-year-old U.S. healthcare conglomerate that is facing thousands of lawsuits over a variety of products, including baby powder, opioids, medical devices and the antipsychotic Risperdal.\n\nJ&J faces more than 15,000 lawsuits from consumers claiming its talc products, including Johnson´s Baby Powder, caused their cancer.\n\nJust 13 days before announcing its recall, J&J CEO Alex Gorsky gave a deposition in one such lawsuit, swearing under oath that the company's baby powder was safe and asbestos-free.", "description": "Johnson & Johnson claimed on Tuesday that it had done 15 new tests on the baby powder bottle the FDA said contained asbestos and found it negative. FDA officials stand by their own tests.", "authors": [], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/22/19885822-0-image-a-12_1572388813926.jpg", "published_at": "2019-10-29"}