{"pub": "yahoo", "url": "https://finance.yahoo.com/news/goldman-sachs-steer-clear-3-124528803.html", "downloaded_at": "2019-09-15 23:13:10.174440+00:00", "title": "Goldman Sachs: 3 Large-Cap Stocks To Sell Now", "language": "en", "text": "Most of the time analysts issue bullish calls on stocks. So when an analyst publishes a Hold rating, or even more rarely a Sell rating, it’s time to take note. Here are three stocks with a very bearish outlook from Goldman Sachs right now. According to the firm, these 3 stocks all deserve the most worrying ‘underperform’ rating based on their outlook for the coming months. Here we take a closer look at why Goldman Sachs is advising against these three stocks, and whether or not the rest of the Street agrees. Let’s dive in now:\n\nSeagate Technology PLC\n\nWith the HDD (hard disk drives) market in secular decline, it’s not surprising that Goldman Sachs analyst Mark Delaney remains unconvinced about Seagate Tech (STX– Get Report). His Sell rating comes with a $37 price target- suggesting prices could plummet 34% in the coming months. Indeed, the data storage company has already rallied 46% year-to-date- and for Delaney that’s a key reason for caution going forward.\n\n\"We believe HDDs remain a cyclical industry, and one facing secular challenges in many parts of the market from the growth of SSDs (solid-state drives) that are based on NAND flash,\" Delaney told investors when he first downgraded the stock. He also prefers larger storage rival Western Digital (WDC)- which has a more neutral Hold rating from the Goldman analyst. Unlike STX, WDC also has large exposure to NAND flash, thanks to its 2016 SanDisk acquisition.\n\nMeanwhile Barclays analyst Tim Long also recently initiated STX with a Sell rating- and an even more bearish price target of $32. He warns that top-line pressure and a possible increase in research and development \"could disrupt the capital return to shareholders.\" Overall STX scores a Hold rating from the Street based on all the ratings published over the last three months. The average analyst price target stands at $47 (16% downside potential).\n\nGilead Sciences Inc\n\nDrugs giant Gilead (GILD– Get Report) received the thumbs down from Goldman Sachs earlier this year. “We are downgrading GILD to Sell from Neutral and lowering our price target to $60 from $70 which represents -10% downside vs 17% avg upside for the rest of our coverage,” Terence Flynn wrote. Indeed, with Gilead now trading at $66 the analyst’s new $60 price target is one of the Street’s lowest price targets and suggests considerable downside risk lies ahead.\n\nWith the loss of the blockbuster HCV franchise and near total market dominance in HIV (80% of US patients on anti-retrovirals are on a Gilead product), Gilead is in a period of change as management searches for new avenues to generate growth. \"GILD currently trades at ~10x NTM P/E and barring another \"Pharmasset\" and/or internal pipeline success we find it difficult to see the stock's multiple expanding\" says Flynn.\n\nAccording to the analyst, GILD has a “very limited” mid-to-late stage pipeline of drugs under development. The analyst told investors: “[T]he company has a new CEO and we assume that rebuilding the pipeline and improving R&D productivity across the organization will be a key area of focus… This can clearly take time and we anticipate there will be tremendous competition for innovative/growth assets.”\n\nHowever, the rest of the Street is notably more optimistic. Not only are we looking at a Strong Buy analyst consensus, but significant upside potential of 28% according to the average analyst price target. “We look towards the expansion of the pipeline via M&A (i.e., Galapagos so far) to drive long-term growth” writes Maxim analyst Jason McCarthy. He has a buy rating on GILD with an $84 price target.\n\nStory continues", "description": "Most of the time analysts issue bullish calls on stocks. So when an analyst publishes a Hold rating, or even more rarely a Sell rating, it’s time to take note. Here are three stocks with a very bearish outlook from Goldman Sachs right now. According to the firm, these 3 stocks all deserve the most worrying", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/2f68KNMdVGVeHH7bdj.eaQ--~B/aD00MTQ7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/tipranks_452/762c66143223516ea33f945bbd718c83", "published_at": "2019-09-15"}