{"pub": "cbc", "url": "https://cbc.ca/news/business/air-canada-porter-united-gender-non-binary-male-female-1.5326284", "downloaded_at": "2019-10-20 08:19:42.255682+00:00", "title": "Air Canada plans gender-neutral greeting, Porter, United create gender X category | CBC News", "language": "en", "text": "In an effort to be more inclusive, Air Canada plans to drop gender references when welcoming passengers. That means no more onboard announcements opening with, \"Ladies and gentlemen.\"\n\nThe move follows a growing awareness and acceptance — including in the travel industry — that some individuals are non-binary, meaning they don't identify as male or female.\n\nHowever, Air Canada — along with most other airlines — still requires passengers to designate themselves as female or male when booking flights, something activists say needs to change.\n\n\"That just feels dishonest and also disrespectful that we're forced to have to pick an identity that we don't identify with,\" said Gemma Hickey, a transgender activist in St. John's who identifies as non-binary.\n\nA few carriers, including Canada's Porter Airlines, have added a gender-neutral booking option. Many others, including Air Canada, have pledged to do it. Hickey said Air Canada's plan to revise its greeting is a good first step.\n\nAn excerpt from an Air Canada employee memo announcing that passengers will soon be greeted with the gender-neutral term 'everyone' instead of 'ladies and gentlemen.' (Air Canada)\n\nAccording to an employee memo issued last month, Air Canada said it will soon switch to the gender-free term \"everyone\" when greeting passengers.\n\n\"We want to ensure an inclusive space for everyone, including those who identify as gender X,\" said the memo.\n\nSince June, the federal government has allowed people who don't identify as female or male to have an X printed on their passport, travel document, citizenship certificate or permanent resident card.\n\nMost provinces now also offer the X gender option for government-issued ID cards such as driver's licences.\n\nMost airlines still only offer two gender categories — male and female — when passengers book flights. (CBC)\n\nHickey was one of the first Canadians to get a passport with an X. But typically when booking a flight, that option still doesn't exist.\n\n\"I'm not sure what the holdup is,\" said Hickey, who emailed Canada's major airlines in June 2018, lobbying for a non-binary gender category. \"It doesn't feel like I'm being respected as a person.\"\n\nHowever, Hickey had a positive experience recently when booking a flight with Porter. The airline adopted the X option, along with a gender-neutral onboard greeting, in the summer of 2018.\n\n\"It made me feel great to be able to choose [X] on an airline,\" said Hickey.\n\nTravelling with a passport marked with an X, Hickey had no problems visiting four European countries and Japan. (Paula Gale/CBC)\n\nPorter made the change \"to better reflect the preferences of travellers\" and to stay in step with gender categories offered on government documents, said spokesperson Brad Cicero in an email.\n\nIn March, U.S. airline United added the X, plus a U option, which stands for \"undisclosed\" gender.\n\n\"We are so proud to be the first U.S. airline to offer these inclusive booking options for our customers,\" said United's Chief Customer Officer Toby Enqvist in a statement.\n\nIn June, Air Italy became the first European airline to include the X gender category.\n\nIn March, U.S. airline United added two non-binary gender categories for customers booking flights. (United Airlines)\n\nBack in Canada, WestJet says it's making the necessary changes to its system to offer the X option.\n\nThe airline said that \"due to the complexity of changes required,\" it anticipates the category won't be available until 2020.\n\nWestJet is also re-evaluating its onboard greeting which refers to passengers as \"ladies and gentlemen.\"\n\n\"We are continuously assessing and evolving our practice and policies to maximize inclusiveness,\" said spokesperson Morgan Bell in an email.\n\nAir Canada didn't respond to requests for comment. In February, it told The Canadian Press that it was looking into whether other governments and airline partners would recognize the X designation for international travellers.\n\n\"We are actively working on this, and we do intend to eventually offer a non-binary option to our customers,\" said spokesperson Peter Fitzpatrick.\n\nWill other countries accept an X passport?\n\nOn its website, the federal government warns there are no guarantees that when people travel, the countries they visit will accept an X gender identifier on their passport.\n\nHickey, who uses the pronoun \"they,\" said that, travelling with a passport marked with an X, they have visited four European countries plus Japan with no hassles.\n\nIn fact, Hickey said the gender designation actually helps cut the confusion when travelling, caused by appearing masculine but having a feminine-sounding first name, Gemma.\n\n\"My identity isn't called into question anymore,\" said Hickey. \"People don't ask me any questions about that because the X explains my name as well as how I present.\"\n\nTransgender activist Fran Forsbert, left, of Saskatoon with two of her children, Renn and Krista. (Craig Edwards/CBC)\n\nNot all transgender activists are campaigning for an X option. Fran Forsberg of Saskatoon has two transgender children and wishes people could buy a plane ticket or get a passport without having to indicate a gender.\n\n\"It's nobody's business, and it's irrelevant,\" said Forsberg, who was recently involved in a court challenge which forced Saskatchewan to allow people of all ages to remove the gender on their birth certificates.\n\n\"I wished they just abolished [gender markers] altogether,\" she said.\n\nHickey believes that's a possibility, but for now, is happy with the X option, because it provides recognition to a marginalized group.\n\n\"It's important that we have that visibility because we've been invisible.\"", "description": "There's a growing recognition — including in the airline industry — that some people don't identify as male or female. However, most airlines still require passengers to designate themselves that way when booking flights. Activists say this needs to change.", "authors": ["Business Reporter", "Sophia Harris Has Worked As A Cbc Video Journalist Across The Country", "Covering Everything The Start Of The Annual Lobster Fishery In Yarmouth", "N.S.", "To Farming In Saskatchewan. She Now Has Found A Good Home At The Business Unit In Toronto.", "Contact", "Sophia.Harris Cbc.Ca", "More This Author"], "top_image": "https://i.cbc.ca/1.4872724.1540219091!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/gemma-hickey.jpg", "published_at": "2019-10-20"}