{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7583357/Winnie-Harlow-cuts-low-key-figure-bomber-jacket-jeans-steps-London.html", "downloaded_at": "2019-10-17 11:37:36.803956+00:00", "title": "Winnie Harlow cuts a low-key figure in a bomber jacket and jeans as she steps out in London", "language": "en", "text": "She's used to treading the world's top runways.\n\nYet Winnie Harlow swapped her high fashion garb for a wholly more low-key look on Wednesday as she emerged in London.\n\nThe supermodel, 25, looked sensational as she stepped out in skin-tight jeans and a bomber jacket while opting to go make-up free.\n\nHot stuff: Winnie Harlow swapped her high fashion garb for a wholly more low-key look on Wednesday as she emerged in London\n\nWinnie looked stunning as she stepped out in the capital while sporting the tight jeans which skimmed her ankles in length.\n\nShe paired the look with stacked, chunky trainers and a stylish Christian Dior saddlebag to prove she is bang on trend.\n\nLast month, Winnie detailed her pre-event make-up routine - with the routine including eye drops on the vitiligo patches of her skin to help reduce any redness.\n\nThe model recently filmed a make-up routine with Vogue in honor of New York Fashion Week. During the video, she detailed the different tricks she uses on her vitiligo patches — a skin disease that causes discoloration.\n\nA vision: The supermodel, 25, looked sensational as she stepped out in skin-tight jeans and a bomber jacket while opting to go make-up free\n\nStylish: Last month, Winnie detailed her pre-event make-up routine - with the routine including eye drops on the vitiligo patches of her skin to help reduce any redness\n\n'What I like to do is use Visine Eye Drops on the skin, on the white parts of my skin, to take the redness out,' Winnie said while dropping the liquid onto her face.\n\nWinnie said she came up with the trick because she always carried Visine around in her bag to help with any eye redness from allergies.\n\n'I have really bad allergies so I always have Visine on me anyway,' she said. 'I thought if it it whitens my eyes, wouldn’t it whiten my skin? And I tried it and it does.'\n\nPrior to adding Visine to patches of her face to help brighten the area, Winnie will first cleanse her skin and then do a homemade mask made up of manuka honey, Aztec Secret Indian Healing Clay and apple cider vinegar.\n\nStunner: Winnie looked stunning as she stepped out in the capital while sporting the tight jeans which skimmed her ankles in length\n\nHot stuff: She looked stunning as she walked down the street\n\n'I really feel like my skin breakouts the most around Fashion Week,' Winnie said from in the video, which was filmed at The Dominick Hotel in New York City.\n\nThe model had a busy New York Fashion Week as she appeared in multiple shows, including walking for Tom Hilfiger x Zendaya and LaQuan Smith.\n\nBut she felt like she was prepping for 'war' because of the makeup required for each show. 'Your skin isn’t made for makeup,' Winnie said. 'But prep the skin and prepare it for war.'\n\nThe make-up routine continued with Winnie detailing to her followers how she decides to do her make-up around her vitiligo patches.", "description": "The supermodel, 25, looked sensational as she stepped out in skin-tight jeans and a bomber jacket while opting to go make-up free", "authors": ["Ciara Farmer For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/11/19830808-0-image-a-35_1571307360613.jpg", "published_at": "2019-10-17"}