{"pub": "usatoday", "url": "https://usatoday.com/story/opinion/2019/10/24/navy-seals-vs-my-client-edward-gallagher-editorials-debates/4089179002", "downloaded_at": "2019-10-25 00:43:15.934138+00:00", "title": "Navy SEALs have a problem, but it's not my client Edward Gallagher", "language": "en", "text": "Rear Adm. Collin Green should abandon his fixation on punishing Eddie Gallagher and learn from him: Opposing view\n\nRear Adm. Collin Green was correct when he said “we have a problem” in Naval Special Warfare, but his desire to punish Edward Gallagher is not the solution, it is part of the problem.\n\nEddie Gallagher spent months in jail for a murder he did not commit. His children were dragged from their home in their underwear at gunpoint by Navy criminal investigation agents. Prosecutors repeatedly violated his constitutional rights. Senior Navy SEAL leaders tried to improperly influence the proceedings and send him to jail for life. But an impartial jury found Gallagher not guilty of every serious charge.\n\nJust before the trial began, Green touted the results of a study on Navy SEAL culture as “properly balancing a culture of operational excellence with a culture of sound ethical compliance.” After the trial, he reversed himself to say “we have a problem.”\n\nThere was not a precipitous deterioration in the culture, but rather the sudden need to find a scapegoat because during the trial, we had exposed massive leadership failures. Instead of learning from mistakes and holding leadership accountable, leadership chose to blame Gallagher and deflect attention from themselves.\n\nGreen’s stated goal of restoring good order and discipline is both needed and laudable, but his methods are not. He recalled an entire platoon from Iraq for drinking on base, yet, according to eyewitness statements, both Green and Capt. Matthew Rosenbloom drank in Iraq on prior occasions. Green is under investigation by the inspector general for retaliating against SEALs who consult with attorneys.\n\nAnonymous sources made a stunning admission to The New York Times that, even after being acquitted, “Green and other Navy leaders were planning to demote (Gallagher) and force him out of the SEALs,” but that they couldn’t execute this unlawful plan because they’re afraid of the president.\n\nOUR VIEW: Navy SEALs want to kick out bad actors. Then Donald Trump stepped in.\n\nNavy Special Operations Chief Edward Gallagher (Photo: Andrea Gallagher via AP)\n\nTheir attempt to appeal to the partisan divide misses the point. Respecting jury verdicts and the constitutional rights of military members is not a partisan issue.\n\nIf Green really wanted to fix Navy SEAL culture, he should abandon his fixation on punishing Gallagher and instead sit down with him to learn what the real problems are from his deckplate perspective. Gallagher has experienced both the best and the worst aspects of the SEAL culture, but he loves the SEAL teams and would do anything to help them improve.\n\nTimothy Parlatore, a former Navy officer, is a lawyer representing Navy SEAL Eddie Gallagher.\n\nIf you can't see this reader poll, please refresh your page.\n\nRead or Share this story: https://www.usatoday.com/story/opinion/2019/10/24/navy-seals-vs-my-client-edward-gallagher-editorials-debates/4089179002/", "description": "Rear Adm. Collin Green should abandon his fixation on punishing Eddie Gallagher and learn from him, writes Timothy Parlatore, a former Navy officer", "authors": ["Timothy Parlatore", "Opinion Contributor", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/24/USAT/993cb460-ff8f-48bd-99d2-a049ffc6a9d0-SEAL.oppose_1.jpg?crop=2224,1251,x0,y450&width=3200&height=1680&fit=bounds", "published_at": "2019-10-24"}