{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/robbie-williams-thought-going-die-20708719", "downloaded_at": "2019-10-24 00:36:44.985269+00:00", "title": "Robbie Williams thought he was going to die if he didn't change his lifestyle", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nRobbie Williams has confessed he would probably have ended up dying if he didn't sort out bad habits and address his mental health.\n\nThe singing sensation, 45, unveiled the whole truth in the latest WW podcast, as he feared he was \"going to die\" if he didn't \"take action\" towards his eating habits and busy lifestyle.\n\nSpeaking on the latest episode of WW's Wellness That Works podcast, the former Take That star admitted: \"I knew I had to take action or I was going to die. Take it in small steps.\n\n\"You only get bucked off the horse so many times - daily, secondly, minutely, but you just keep getting back on the horse and then your percentage of who you are, where you are and how you feel about yourself and life will get better and better. But it's a hard journey.\"\n\n(Image: PA)\n\nWilliams, a global hitmaker, is an ambassador for WW, formerly Weight Watchers, having battled with his weight for many years.\n\nThe pop icon used to smoke 40 cigarettes a day and was previously entered into rehab for an addiction to prescription drugs.\n\nBut he has shut out the bad habits and moved on - now following a health and fitness plan after joining WW.\n\n(Image: Instagram)\n\nHe discussed how it has been vital for him to open up about how he was feeling, and added he's so \"happy\" that talking about mental health is no longer a taboo because it's vital to getting well.\n\nThe singer, who has children Teddy, six, Charlie, four, and 13-month-old Coco with wife Ayda Field said: \"We have come leaps and bounds with how the public perceive what's going on with mental health.\n\n(Image: Mohai/EPA-EFE/REX/Shutterstock)\n\n\"It's a much healthier place to be. People are very open and talking about what's going on for them and their minds, and their mental health.\n\n\"It's basically the start of the process of talking about this stuff, and I'm very proud and happy to be in a society that is now getting to grips with what this is.\"", "description": "The Take That sensation unveiled all of his previous bad habits in a podcast", "authors": ["Brogan-Leigh Hurst", "Image", "Pa", "Instagram", "Mohai Epa-Efe Rex Shutterstock"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20323735.ece/ALTERNATES/s1200/0_Robbie-Williams.jpg", "published_at": "2019-10-23"}