{"pub": "businessinsider", "url": "https://businesstimes.com.sg/garage/istox-raises-undisclosed-series-a-funds-from-thai-bank-kkp", "downloaded_at": "2019-09-25 13:55:40.297705+00:00", "title": "iSTOX raises undisclosed Series A funds from Thai bank KKP", "language": "en", "text": "DIGITAL securities platform iSTOX has raised an undisclosed amount of Series A funds from Kiatnakin Phatra Financial Group (KKP), a Thai investment bank, the startup announced on Wednesday.\n\nBacked by the Singapore Exchange and Temasek's Heliconia Capital, iSTOX is developing a platform for the issuance, settlement, custody and secondary trading of digitised securities. It was admitted into the Monetary Authority of Singapore's FinTech Regulatory Sandbox in May.\n\nThe startup plans to launch its first issuance of digital securities by Q4 this year, with trading to kick off after. It aims to be fully operational in 2020, after graduating from the MAS sandbox.\n\nAphinant Klewpatinond, CEO of KKP, said in a press release that \"investing in iSTOX will strategically underpin KKP's position as pioneers in the next-era capital market ecosystem\". The investment was made via the bank's capital markets arm, Phatra Capital.\n\n\"The digitisation of securities will certainly be critical in re-intermediating the value chain and offering solutions not yet available in conventional capital markets. Through this collaboration, we will be able to offer more bespoke services to our clients from both a fundraising and investment perspective,\" he said.\n\n\"iSTOX and KKP will also collaborate on market education and outreach initiatives to facilitate a better understanding of the benefits digitised assets can bring,\" said Darius Liu, chief strategy officer of iSTOX.", "description": ": THE BUSINESS TIMES Garage - DIGITAL securities platform iSTOX has raised an undisclosed amount of Series A funds from Kiatnakin Phatra Financial Group (KKP), a Thai investment bank, the startup announced on Wednesday.  . Read more at The Business Times.", "authors": ["Sharanya Pillai"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/garage/images/BTGaragedefault600.jpg", "published_at": "2019-09-25"}