{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7553261/Cardi-B-announces-going-wear-bra-thrown-performing-bed-tonight.html", "downloaded_at": "2019-10-09 07:51:07.791238+00:00", "title": "Cardi B announces she going to wear 'a bra thrown at me while I was performing to bed tonight'", "language": "en", "text": "Cardi B wrapped up her last show from her most recent tour of the US on Tuesday, October 8.\n\nAnd now one lucky fan from her concert at the El Paso County Coliseum in El Paso, Texas can go to bed knowing that the hip-hop superstar will be wearing her bra.\n\n'Somebody threw me their bra while I was performing.....I'm going to wear it to bed tonight,' Cardi shared on Twitter after the gig.\n\nEnd of the line: Cardi B wrapped up her US tour with a show in El Paso, Texas on Tuesday\n\nSo far there's no word on exactly what the bra looks like.\n\nBackstage, while in her dressing room, Cardi also put on an impromptu show in an Insta-Story video, dressed in an orange sequin ensemble that showed off her ample assets with his plunging neckline.\n\nAdding to the sparkle-appeal, the Bronx native also wore matching knee-high boots and a long and straight orange and black wig.\n\nOne with her fans: The hip-hop superstar, 26, tweeted out about wearing a fan's bra to bed after her show in El Paso, Texas\n\nShining star: Cardi also shared some video of herself backstage in El Paso, Texas on Insta-Story dressed in an all-orange ensemble\n\nBaby got back: Of course, the Bronx native flaunted her famous derriere in the video\n\nImpromptu performance: At one point Cardi began to sing the song, I Will Always Love You, which was hit for songwriter Dolly Parton in 1974, and again in 1992 for Whitney Houston\n\nAt one point during her Instagram Story video, she began to sing the song, I Will Always Love You, which was hit for songwriter Dolly Parton in 1974, and again in 1992 for Whitney Houston, as part of The Bodyguard movie soundtrack.\n\nShe also made it a point to show off her famous derriere with a healthy dose of twerking.\n\nCardi's show in El Paso was a make-up date that was cancelled back on May 21 'due to circumstances beyond her control.'\n\nEnd of the line: Cardi announced at the Austin City Limits Festival in Austin, Texas on Monday that her show in El Paso on Tuesday would be her final one of 2019\n\nIt was likely among the slew of shows postponed earlier this year when she suffered complications after undergoing another plastic surgery procedure.\n\nDuring her gig the previous day at the Austin City Limits in Austin, Texas on Monday, Cardi told the crowd that that show and one in El Paso were going to be her last ones in 2019.\n\n'Those will be my last shows l, cuz I’m gonna go record my f------ album,' KVUE reported.", "description": "Cardi B wrapped up her last show from her most recent tour of the US on Tuesday, October 8. And now one lucky fan from her concert at the El Paso County Coliseum in El Paso threw her a bra.", "authors": ["Kevin Kayhart For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/08/19479410-0-image-a-100_1570605419833.jpg", "published_at": "2019-10-09"}