{"pub": "investingcom", "url": "https://investing.com/analysis/asia-market-update-pboc-yuan-fed-repo-200466931", "downloaded_at": "2019-09-23 08:38:47.945927+00:00", "title": "Asia Market Update: Pboc, Yuan, Fed Repo", "language": "en", "text": "Pboc\n\nEven with trade war winds blowing in a slightly favourable direction this morning regional risk assets stalled and drifted lower on a less accommodating Pboc\n\nSimilar to last week, the People's Bank of China cautiously injected short-term liquidity into the system via 7-day and 14-day reverse repo before the national day holiday. The central bank appears very reluctant to have the markets very flush cash. Suggesting Beijing is being extremely careful to avoid signalling it's open season on re-leveraging and subsequently reheating of the property sector.\n\nUSD/CNH\n\ntraded up to 7.1299 on EBS after Chinese officials unexpectedly cancelled U.S. farm visits. The Asia Trader were short dollar (USD/CNH) into the weekend, so short covering during the low liquidity New York session likely exaggerated the topside move. The pair retraced early this morning but remains stubbornly bid.\n\nI still think both China and the U.S. are keen to make some accommodation in October, so spot should remain a sell into rallies with Friday's high water print on EBS a point of resistance.\n\nFed 14 day repo\n\nThe Fed stated repo operations over the next two weeks with will impact the quarter-end( QE) turn, on Friday. As a quick fix band-aid job, and to provide some grease to the cranky repro market over \" the turn\" , they conducted a 14-day term repo in conjunction with the overnight repo operations. Since the implementation on Sept. 17, the cut-off rate in overnight repo operation has come off to 1.823%, 18bp below the Fed fund target range, from 2.481%, 23bp above the Fed fund target range. I suspect money market desks are viewing this extremely proactive move by the Fed in a comforting light.", "description": "Forex Analysis by Stephen Innes covering: USD/CNH. Read Stephen Innes's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-23"}