{"pub": "independent", "url": "https://independent.co.uk/travel/news-and-advice/easyjet-ryanair-wizz-air-shortest-longest-flights-europe-budget-airlines-a9177871.html", "downloaded_at": "2019-10-30 23:19:54.113276+00:00", "title": "The shortest and longest budget flights in Europe", "language": "en", "text": "On the day that Ryanair launches one of its shortest-ever routes, The Independent can reveal the quickest and the longest links operated by Europe’s biggest budget airlines.\n\nThe Irish airline has started flying from Paphos in Cyprus to Beirut, its first venture to Lebanon. The distance is just 183 miles, a hop of barely half an hour in the air.\n\nRyanair’s new link joins the top 10 of Europe-wide short no-frills links, just ahead of easyJet’s Geneva-Nice route. But it is by no means the shortest hop in the low-cost business.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThat honour – although environmentalists may not see it like that – is held by easyJet’s twice-weekly link from Belfast International to the Isle of Man.\n\nThe distance is just 74 miles, representing a flight time of 20 minutes; the “block time” from gate to gate is twice as much.\n\nShape Created with Sketch. Top ten airlines of 2019 Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Top ten airlines of 2019 1/10 10. Thai Airways According to the Skytrax World Airline awards AFP/Getty 2/10 9. Lufthansa According to the Skytrax World Airline awards Getty 3/10 8. Qantas Airways According to the Skytrax World Airline awards Getty 4/10 7. Hainan Airways According to the Skytrax World Airline awards Getty Images 5/10 6. EVA Air According to the Skytrax World Airline awards Getty Images 6/10 5. Emirates According to the Skytrax World Airline awards Getty 7/10 4. Cathay Pacific According to the Skytrax World Airline awards Getty 8/10 3. ANA All Nippon Airways According to the Skytrax World Airline awards Getty 9/10 2. Singapore Airlines According to the Skytrax World Airline awards Getty 10/10 1. Qatar Airways According to the Skytrax World Airline awards Getty 1/10 10. Thai Airways According to the Skytrax World Airline awards AFP/Getty 2/10 9. Lufthansa According to the Skytrax World Airline awards Getty 3/10 8. Qantas Airways According to the Skytrax World Airline awards Getty 4/10 7. Hainan Airways According to the Skytrax World Airline awards Getty Images 5/10 6. EVA Air According to the Skytrax World Airline awards Getty Images 6/10 5. Emirates According to the Skytrax World Airline awards Getty 7/10 4. Cathay Pacific According to the Skytrax World Airline awards Getty 8/10 3. ANA All Nippon Airways According to the Skytrax World Airline awards Getty 9/10 2. Singapore Airlines According to the Skytrax World Airline awards Getty 10/10 1. Qatar Airways According to the Skytrax World Airline awards Getty\n\nRyanair takes second place for brevity among the big three European budget airline with its 88-mile hop across the western Mediterranean from Malaga in Spain to Tetouan in Morocco.\n\nJust one mile longer is an easyJet link from the Isle of Man to Liverpool.\n\nThe next six places are also taken by easyJet, with routes almost exclusively within the British Isles – only Southend-Amsterdam, in eighth place, ventures to Continental Europe.\n\nWizz Air, the third force in European budget aviation, does not make the top 10 of short routes. The Hungarian airline mainly operates in landlocked central and Eastern Europe, where profitable short hops across bodies of water are less readily available.\n\nIts shortest route is from Gdansk in Poland to Malmo in Sweden at 218 miles, with Katowice – also in Poland – to the Ukrainian city of Lviv only three miles further.\n\nWhen it comes to the longest routes, Wizz Air is much better represented.\n\nBut top place for ultra-long-haul-no-frills goes to Ryanair for its weekly link from Stockholm Skavsta to Gran Canaria, covering 2,629 miles.\n\nIts route takes the Boeing 737-800 over Denmark, the northern tip of Germany, the Netherlands, Belgium, northern France, the northern Spanish mainland and Portugal. But the flight leaves at 7.15pm and touches down just after midnight, so the views will not be spectacular.\n\nThe flight is scheduled to take five hours, 50 minutes. Flying out on 24 November, the fare is 506 Swedish krona (£40) – for a journey longer than the transatlantic link from Glasgow to Halifax in Canada.\n\nAll the remaining routes in the top 10 are to the Canaries, Egypt or Dubai.\n\nWizz Air’s services to Dubai’s new World Central airport from Katowice in Poland and Budapest are second and seventh respectively.\n\nIn third place, Wizz Air’s trans-European express from Bucharest to Tenerife South traverses Bulgaria, Serbia, Bosnia, Croatia, Italy and Morocco on its way to the sunshine.\n\nHurghada in Egypt is the destination for all four easyJet entries in the top 10. The Red Sea resort is served from Manchester, Bristol, Stansted and Gatwick.\n\nWhen Sharm el Sheikh is back in the easyJet schedules, the link from Manchester will become the fifth longest in Europe.\n\nThe shortest route in the world is on the Scottish airline, Loganair, from Papa Westray to Westray in Orkney. The one-mile flight is scheduled to take two minutes.\n\nThe world’s longest nonstop route is on Singapore Airlines from its hub to New York. The 9,529-mile flight takes 18 hours on a good day.\n\nTop 10 shortest routes from Europe’s top three budget airlines (distances in statute miles)\n\n1. easyJet: Belfast International-Isle of Man (74)\n\n2. Ryanair: Malaga-Tetouan (88)\n\n3. easyJet: Liverpool-Isle of Man (89)\n\n4. easyJet: Belfast International-Glasgow (109)\n\n5. easyJet: Belfast International-Edinburgh (143)\n\n6. easyJet: Gatwick-Jersey (160)\n\n7. easyJet: Belfast International-Liverpool (164)\n\n8. easyJet: Southend-Amsterdam (180)\n\n9. easyJet: Belfast International-Newcastle (181)\n\n10 = easyJet: Belfast International-Manchester (183)\n\n10 = Ryanair: Paphos-Beirut (183)\n\nTop 10 longest routes from Europe’s top three budget airlines\n\n1. Ryanair: Stockholm-Gran Canaria (2,629)\n\n2. Wizz Air: Katowice-Dubai World Central (2,607)\n\n3. Wizz Air: Bucharest-Tenerife South (2,602)\n\n4. easyJet: Manchester-Hurghada (2,575)\n\n5. Ryanair: Warsaw-Tenerife South (2,542)\n\n6. easyJet: Bristol-Hurghada (2,525)\n\n7. Wizz Air: Budapest-Dubai World Central (2,503)\n\n8. Ryanair: Oslo-Gran Canaria (2,479)\n\n9. easyJet: Stansted-Hurghada (2,433)\n\n10. easyJet: Gatwick-Hurghada (2,422)", "description": "On the day that Ryanair launches one of its shortest-ever routes, The Independent can reveal the quickest and the longest links operated by Europe’s biggest budget airlines. The Irish airline has started flying from Paphos in Cyprus to Beirut, its first venture to Lebanon. The distance is just 183 miles, a hop of barely half an hour in the air.", "authors": ["Simon Calder"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/30/15/easyjetedinburgha319.jpg", "published_at": "2019-10-30"}