{"pub": "mirror", "url": "https://mirror.co.uk/news/us-news/woman-28-shot-dead-police-20571464", "downloaded_at": "2019-10-13 18:36:21.714909+00:00", "title": "Woman, 28, shot dead by police while playing video games with young nephew", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA woman has been shot dead through a window by police as she played video games at home with her eight-year-old nephew.\n\nAtatiana Jefferson was killed instantly in the bedroom of her Texas property after an officer fired a bullet on Saturday at around 2.30am.\n\nBody cam footage shows the police officer peering into her window and shouting: “Put your hands up! Show me your hands!”\n\nMoments later, he fired the fatal shot.\n\nAtatiana, 28, was given emergency medical care, but could not be saved.\n\nPolice had been called to the home by Atatiana's neighbour James Smith, 62, who reported that the front door was wide-open and the lights were on in the early hours of the morning.\n\n(Image: Facebook)\n\nHe had dialed the police department's non-emergency number after becoming concerned and knew Atatiana was at home with her young nephew.\n\nHowever he wanted police to check on their welfare.\n\nOfficers were on the scene within 15 minutes and Mr Smith was shocked when he heard the gunshot and saw police storm inside the home.\n\n“I don’t know what went on in the house, but I know that she wasn’t a threat,” he told WFAA-TV.\n\nThere was “no domestic violence, no arguing, nothing that they should have been concerned with as far as them coming with guns drawn to my neighbour’s house.\"\n\nThe bodycam footage shows officers searching the outside of the home in Fort Worth.\n\nOne officer outside noticed a person standing inside, near a window. “Perceiving a threat,” he drew his weapon and fired once into the house at the person.\n\nAtatiana’s relatives’ attorney said she went to the window to see what was going on when she was shot.\n\nPolice said in a statement: “Perceiving a threat, the officer drew his duty weapon and fired one shot striking the person inside the residence.\n\n“Officers entered the residence locating the individual and a firearm and began providing emergency medical care.”\n\nPolice also released photographs of a gun they said that they found in a bedroom at the house.\n\nThey did not say whether Atatiana, who worked in pharmaceutical equipment sales, was holding the weapon when the officer shot her.\n\n(Image: Facebook)\n\nS. Lee Merritt, an attorney who handles civil rights cases that involve police misconduct allegations, said his office was representing Atatiana’s family.\n\n“Before law enforcement goes about their pattern of villainizing this beautiful peaceful woman, turning her into a suspect, a silhouette, or threat, let me tell you about [her,]” Mr Merritt wrote.\n\n“She was a premed graduate of Xavier University. She was very close to her family. She was the auntie that stayed up on Friday night playing video games with her 8-year-old nephew.\n\n“Her mom had recently gotten very sick, so she was home taking care of the house and loving her life.\n\n“There was no reason for her to be murdered. None. We must have justice,” Mr Merritt wrote.\n\n(Image: Facebook)\n\nMr Smith, who has lived on the street for 50 years, said he feels as though the shooting was his fault – even though he was just trying to be a good neighbour.\n\n“I’m shaken. I’m mad. I’m upset. And I feel it’s partly my fault,” he said.\n\n“If I had never dialled the police department, she’d still be alive.”\n\nMayor Betsy Price called on Fort Worth to support Atatiana’s family following the shooting.\n\n“Writing a statement like this is tragic and something that should never be necessary,” she said.\n\n“A young woman has lost her life, leaving her family in unbelievable grief.\n\n“All of Fort Worth must surround Atatiana Jefferson’s family with prayers, love and support.”\n\nPolice say they are completing \"an extremely thorough investigation.\"\n\nThe officer in question has been placed on administrative leave pending the outcome.", "description": "Police were called to the Texas home of Atatiana Jefferson at around 2.30am on Saturday after a neighbour noticed her front door wide open and became concerned", "authors": ["Amber Hicks", "Image", "Facebook"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20571738.ece/ALTERNATES/s1200/0_Atatiana-Jefferson.jpg", "published_at": "2019-10-13"}