{"pub": "businessinsider", "url": "https://businesstimes.com.sg/consumer/christian-dior-apologises-over-china-map-excluding-taiwan", "downloaded_at": "2019-10-17 06:01:17.360141+00:00", "title": "Christian Dior apologises over China map excluding Taiwan", "language": "en", "text": "French luxury brand Christian Dior apologised on Thursday and said it supported China's territorial sovereignty after it was criticised for using a map of China that excluded Taiwan in a presentation.\n\n[SHANGHAI] French luxury brand Christian Dior apologised on Thursday and said it supported China's territorial sovereignty after it was criticised for using a map of China that excluded Taiwan in a presentation.\n\nTaiwan is China's most sensitive territorial issue. Beijing considers the self-ruled island a wayward province and part of \"one China\".\n\nThe incident involving the map occurred during a presentation that Dior was making about its boutique network at Zhejiang Gongshang University in the eastern Chinese city of Hangzhou, posts on China's Weibo social media platform showed.\n\nA staff member at the university's careers office told Reuters that Dior had held a recruitment event on Wednesday and there had been an issue with the maps it had shown.\n\nsentifi.com Market voices on:\n\nDior, which is part of luxury group LVMH, said in a post on its Weibo account that it had started to \"seriously investigate\" the incident.\n\n\"Dior first extends our deep apologies for the incorrect statement and misrepresentation made by a Dior staff member at a campus presentation,\" the company said, without providing more details about the event.\n\n\"Dior always respects and upholds the one China principle, strictly safeguards China's sovereignty and territorial integrity, and treasures the feelings of the Chinese people,\" it said, adding that it would take precautions to prevent similar incidents from happening.\n\nDior is the latest firm to become involved in political issues involving China, which has been more assertive in its territorial claims and how it expects foreign companies doing businesses in China to describe them.\n\nFashion labels such as Givenchy, Coach and Versace are among companies that have issued similar apologies in recent months.\n\nThe topic \"Dior statement\" was among the most viewed on Weibo on Thursday with about 100 million views.\n\nREUTERS", "description": ": THE BUSINESS TIMES Consumer - [SHANGHAI] French luxury brand Christian Dior apologised on Thursday and said it supported China's territorial sovereignty after it was criticised for using a map of China that excluded Taiwan in a presentation. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/17/Dior_0.jpg?itok=Rhx59Mb0", "published_at": "2019-10-17"}