{"pub": "investing.com", "url": "https://ca.investing.com/news/stock-market-news/china-grants-tesla-car-manufacturing-certificate-industry-ministry-1985911", "downloaded_at": "2019-10-17 08:06:38.189140+00:00", "title": "Tesla gets approval to start manufacturing in China", "language": "en", "text": "© Reuters. FILE PHOTO: Workers are seen outside a planned entrance of U.S. electric carmaker Tesla's Gigafactory that is under construction in Shanghai\n\nSHANGHAI (Reuters) - Tesla Inc was added to a government list of approved automotive manufacturers, China's industry ministry said on Thursday, as it granted the electric-vehicle maker a certificate it needs to start production in the country.\n\nThe list was published by the Ministry of Industry and Information Technology.\n\nThis means \"the green light is fully given to Tesla for production in China,\" said Yale Zhang, head of the Shanghai-based consultancy Automotive Foresight. Tesla can start production any time, he said\n\nTesla did not immediately respond to an e-mailed request for comment. The $2 billion factory it is building in the eastern Chinese city of Shanghai is its first car manufacturing site overseas.\n\nReuters reported earlier this month that Tesla plans to start production at its China factory this month. It is unclear when it will meet year-end production targets because of uncertainties around orders, labor and suppliers.\n\nTesla intends to produce at least 1,000 Model 3s a week from the Shanghai factory by the end of this year, as it tries to boost sales in the world's biggest auto market and avoid higher import tariffs imposed on U.S. cars.\n\nThe factory, China's first fully foreign-owned car plant, also reflects Beijing's broader shift to open up its car market.\n\nShanghai authorities have offered Tesla assistance to speed up construction, and China excluded Tesla models from a 10% car purchase tax on Aug. 30.", "description": "Tesla gets approval to start manufacturing in China", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF9G0IW-OCABS_L.jpg", "published_at": "2019-10-17"}