{"pub": "investing.com", "url": "https://ph.investing.com/news/forex-news/forextrade-talk-plans-cheer-risk-currencies-hit-safehaven-yen-45941", "downloaded_at": "2019-09-05 03:50:48.480061+00:00", "title": "FOREX-Trade talk plans cheer risk currencies, hit safe-haven yen", "language": "en", "published_at": "2019-09-05", "text": "© Reuters. FOREX-Trade talk plans cheer risk currencies, hit safe-haven yen\n\n* Trade-exposed currencies jump on U.S.-China trade talks\n\ndate\n\n* Yen sold as risk-on mood returns\n\n* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh\n\n\n\nBy Tom Westbrook\n\nSINGAPORE, Sept 5 (Reuters) - Risk-sensitive currencies such\n\nas the Aussie and yuan rallied on Thursday as investors cheered\n\nthe announcement of U.S.-China trade talks for next month and\n\nabandoned safe haven assets such as yen.\n\nThe Australian and New Zealand dollars, AUD=D3 NZD=D3\n\nChinese yuan and South Korean won all jumped\n\nagainst the dollar, while the yen JPY=EBS fell nearly 0.4% to\n\n106.75 per dollar, its cheapest in more than three weeks.\n\nThe early-October talks will be held in Washington, China's\n\ncommerce ministry announced, following a phone call between\n\nChina's Vice Premier Liu He, U.S. Treasury Secretary Steven\n\nMnuchin and U.S. Trade Representative Robert Lighthizer.\n\nThe news followed optimism that a no-deal Brexit could be\n\navoided, which sent the pound GBP=D3 sharply higher, and a\n\npotential breakthrough for the Hong Kong political crisis.\n\nThose political developments, seen as positive for\n\ninvestment, also fueled a jump in Asian equities and bond\n\nyields. \"We've seen markets hold up relatively well overnight, this\n\n(trade) news has injected a fair amount of optimism in markets,\"\n\nsaid Prashant Newnaha, senior rates strategist at TD Securities\n\nin Singapore.\n\n\"It does seem that the markets were positioning more\n\nbearishly, and now we've gotten this potential good news and the\n\nmarkets are running with it,\" he said, adding global economic\n\nindicators had also recently been showing some green shoots.\n\nThe Australian dollar rose to a one-month high of $0.6825,\n\nseen as a technical resistance level while the New Zealand\n\ndollar hit a one-week peak of $0.6377. The trade-exposed won\n\nclimbed the most of Asia's currencies to 1198.00 per dollar.\n\nAgainst a basket of currencies, the dollar lifted a\n\nlittle from a one-week low to 98.492.\n\nThe Canadian dollar spiked sharply to C$1.3344 per\n\ndollar after the Bank of Canada left interest rates on hold and\n\nsounded less dovish than the market had expected.\n\nThe pound sat around $1.2245 and euro EUR=EBS at $1.1030,\n\nholding overnight gains.\n\nThey had climbed after British parliament voted on Wednesday\n\nto prevent Johnson from taking Britain out of the European Union\n\nwithout a deal on Oct. 31, but rejected his first bid to call a\n\nsnap election two weeks before the scheduled exit. That still leaves Brexit up in the air, with possible\n\noutcomes ranging from a no-deal exit to abandoning the whole\n\nendeavour, prompting some to sound a note of caution.\n\n\"It's important to keep in mind that the situation continues\n\nto look pretty bad,\" J.P. Morgan analysts reminded investors in\n\na market note, pointing out that Johnson, a staunch Brexiteer,\n\nleads opinion polls.\n\nNevertheless, the fact that a hard Brexit has, for now, been\n\nremoved as an immediate risk gave markets some cheer, as did\n\nHong Kong leader Carrie Lam's move to withdraw the bill that\n\ntriggered months of violent protests in the city. \"While there is no 'all clear' on market concerns, investor\n\nsentiment pulled back from extremes...the deferral of a no-deal\n\nBrexit, soothed nerves,\" said Michael McCarthy, chief market\n\nstrategist at brokerage CMC Markets in Sydney.\n\n\n\n", "description": "FOREX-Trade talk plans cheer risk currencies, hit safe-haven yen", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC6A013_L.jpg"}