{"pub": "indiatimes", "url": "https://indiatimes.com/trending/social-relevance/image-motor-vehicle-act-dog-wearing-helmet-delhi-police-378178.html", "downloaded_at": "2019-10-20 06:52:37.945983+00:00", "title": "dog in helmet:Image Of Dog Wearing Helmet While On A Scooter Is Going Viral, Some Call It The Fear Of Motor Vehicles Act", "language": "en", "text": "Dog Riding Scooter With Helmet Is Proof That People Are Finally Taking Motor Vehicle Act Seriously\n\nDog Riding Scooter With Helmet Is Proof That People Are Finally Taking Motor Vehicle Act Seriously\n\nThe fear of hefty challans under the Motor Vehicles Act made people go to bizarre lengths to avoid challans. As soon as news of people getting fined for not wearing a helmet inside a car (that was a mistake, of course), or not wearing a seat belt in an auto, came to forefront, some people actually started wearing helmets inside their cars.\n\nBut the Act did prove to be effective with the number of fines going down by a large percentage across various cities of the country.\n\nAmong people who left no chance for the traffic police to fine them, was a picture of a person traveling with his dog on a two-wheeler.\n\nThe picture of the dog wearing a helmet and sitting calmly on a scooter, behind its owner, has been doing rounds on Twitter for sometime now. Someone even shared it with the caption, ‘Delhi me traffic police ka Khauf’. Clearly, the owner wanted to take no chances with the police, even if the pillion was not human.\n\nDon't Miss 576 SHARES 242 SHARES 6.7 K SHARES\n\nSomebody shared this pic with a caption\n\n*Delhi mei traffic police ka Khauf* @dtptraffic @DelhiPolice pic.twitter.com/Lz9m1AXTko — Himanshu Gupta (@gupta_iitdelhi) September 5, 2019\n\nConversely, we can also learn from the dog and its owner. Human or not, everyone should travel safely when on road. All those teenage kids especially, who think it is cool to travel without helmet - even dogs are more aware than you.\n\nThe Motor Vehicles Act seems to have had impact across more species than expected.", "description": "The fear of hefty challans under the Motor Vehicles Act made people go to bizarre lengths to avoid challans. As soon as news of people getting fined for not wearing helmet inside a car (that was a mistake of course), or not wearing a seat belt in an auto came to forefront some people actually started wearing helmets inside their cars.", "authors": ["Shreya Chauhan"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/police_dog_1571549257_800x420.jpg", "published_at": "2019-10-20"}