{"pub": "yahoo", "url": "https://news.yahoo.com/what-is-direct-primary-care-netflix-and-costco-160903738.html", "downloaded_at": "2019-10-21 05:38:12.813627+00:00", "title": "What is direct primary care? 'Think of a combination of Netflix and Costco'", "language": "en", "text": "Direct primary care (DPC) has become an intriguing alternative to the pricey system that is American health care.\n\n“Think of a combination of Netflix and Costco,” Dr. Jeffrey Gold, a family physician who sees his patients through DPC, told Yahoo Finance. “With Netflix, you pay a monthly fee to have streaming movies and TV shows — maybe there’s a month you watch five, maybe there’s a month you watch zero, but you still pay the same fee. The only difference with direct primary care is we obviously don’t have the infrastructure to carry 2 million users. So we do limit our panel size to about 600 to 1,000 patients.”\n\nHe continued: “But it’s also like Costco in the sense that by being a member of the practice, you’re getting discounts from anywhere from 70-85% on labs, many medications, imaging studies, and specialty visits.”\n\nDr. Millie Marie Tolentino (R) examines patient Dora Leon at Clinica Sierra Vista's Central Bakersfield Community Health Center in Bakersfield, California. (Photo: USA-HEALTHCARE/DOCTORS REUTERS/Phil McCarten) More\n\nThe American Academy of Family Physicians defines direct primary care as giving “family physicians a meaningful alternative to fee-for-service insurance billing, typically by charging patients a monthly, quarterly, or annual fee. This fee covers all or most primary care services including clinical and laboratory services, consultative services, care coordination, and comprehensive care management.”\n\nGold is president of Gold Direct Primary Care and co-founder of the Massachusetts chapter of the Free Market Medical Association (FMMA) alongside Adam Russo of the PHIA Group. The FMMA is part of a free market movement in health care pushing for more affordable services for both doctors and patients.\n\n‘A Stockholm Syndrome’ with the current system\n\nThe problem that direct primary care attempts to solve relate to the relationship between patients and health care providers.\n\n“Overall, we’ve devalued the relationship between a primary care doctor and the patients,” Gold said. “There are a lot of factors that go into it, a lot of fault to go around. … At its core, everybody needs a relationship with a primary care doctor that can not only help prevent illness, but also be there to treat the acute problem and actually be a navigator [for] this complex labyrinth that we have a system.”\n\nDirect primary care typically consists of a contract between the two, “under which the provider agrees to deliver primary care services in exchange for a monthly fee, which typically runs between $50 and $150,” according to The Commonwealth Fund (TCF). Much like Netflix, it is like a subscription-based service. As a result, there is no middle man involved, solidifying the patient/doctor relationship.\n\n\n\n“We have a Stockholm Syndrome with the current health care system,” Gold said, adding: “It’s resistance to change.”\n\nA patient winces as he is attended to by a doctor. (Photo: USA-HEALTHCARE/TEXAS REUTERS/Jessica Rinaldi) More\n\nWhile employer health care does ensure that most working Americans have some kind of health insurance, the costs are still high. According to a report from the TCF, “employer plan premium contributions and out-of-pocket costs, like those for prescription drugs, are eating up an increasing portion of household budgets.” An estimated 23.6 million Americans with employer coverage had high premium contributions, high out-of-pocket costs, or both, according to the report.\n\nMuch of the issue stems from the fact that different hospitals and providers charge various amounts for the same type of service, depending on who the payer is or what their insurance plan is. With DPC, there are no hidden fees — just a flat rate.", "description": "Direct primary care (DPC) has become an intriguing alternative to the pricey system that is American health care.", "authors": ["Adriana Belmonte", "Associate Editor"], "top_image": "https://s.yimg.com/uu/api/res/1.2/EOoQBSLYOK1VhjkAwZREAA--~B/aD0xOTQxO3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-08/3bd18d90-c862-11e9-baeb-f86781ea9148", "published_at": "2019-10-20"}