{"pub": "nationalreview", "url": "https://nationalreview.com/news/british-police-arrest-over-800-climate-change-protesters-trying-to-shut-down-airport", "downloaded_at": "2019-10-10 18:23:19.906540+00:00", "title": "Climate Change Protesters Arrested for Trying to Shut Down British Airport", "language": "en", "text": "Young protesters participate in a rally near the U.S. Capitol as part of the D.C. Climate Strike March in Washington, D.C., September 20, 2019. (Erin Scott/Reuters)\n\nLondon’s Metropolitan Police arrested over 800 climate change activists this week throughout the city, some of whom attempted to shut down London City Airport on Thursday.\n\nDemonstrators with Extinction Rebellion, a climate activism movement that says it encourages civil disobedience to compel government action, have cropped up around London over the past four days. Activists said they planned a “Hong Kong-style occupation of the terminal building,” a reference to pro-democracy protesters in Hong Kong who shut down the city’s international airport in August.\n\nThe group targeted the London airport over the travel hub’s £2 billion expansion plan, which activists say does not comply with Britain’s goal to have net zero carbon emissions by 2050.\n\nAt least 29 people have been charged with crimes. The protests have so far not forced the airport to close but have caused some delayed flights.\n\nOne protester, former Paralympic cyclist James Brown, even climbed on top of a British Airways plane. Another activist refused to resume his seat on a plane as the flight was preparing to depart and began lecturing the other passengers on climate change before police removed him from the plane for “disruptive behavior on board,” the airline said.\n\nNot sure he’s in the right seat number #londoncityairport pic.twitter.com/jpUIbBM0tu — Jonathan Mew (@jonmew) October 10, 2019\n\nThe London protests come as climate change emerges at the forefront of the political debate in the U.S.\n\nLast month, Swedish teenage climate activist Greta Thunberg gave remarks before world leaders at the United Nations Climate Action Summit in New York City, accusing the assembled heads of state of having “stolen my dreams and my childhood with your empty words.”\n\n“We are in the beginning of a mass extinction, and all you can talk about is money and fairy tales of eternal economic growth,” Thunberg said.\n\nMeanwhile, Extinction Rebellion has organized five days of protests this week in New York City and around the U.S. One such demonstration outside the New York Stock Exchange featured protesters lying in pools of fake blood.", "description": "Activists said they planned a \"Hong Kong-style occupation of the terminal building.\"", "authors": ["Mairead Mcardle", "Jim Geraghty", "Victor Davis Hanson", "John Mccormack", "A. G. Hamilton", "Zachary Evans", "Andrew C. Mccarthy", "Alexandra Desanctis", "Read More", "The American Conservative"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/09/climate-strike-11.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-10"}