{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/area-51-raid-live-news-countdown-stream-watch-alien-facebook-event-nevada-a9113266.html", "downloaded_at": "2019-09-20 13:05:52.701461+00:00", "title": "Area 51 raid – live updates: Alien hunters arrive near base amid official warnings and fears of ‘humanitarian disaster’", "language": "en", "text": "Alien-hunters are arriving near Area 51 after a viral craze that saw them commit to storm the mysterious US military base.\n\nA variety of events are taking place to mark the weekend, including music festivals in a variety of locations. But some appear to be still committed to at least getting close to the base's famous military gates, coming near enough to snap selfies alongside the warnings of how violently the base will be protected.\n\nThe parties come amid warnings from the US military to anyone who might think of actually trying to breach the base's defences. There have also been dire warnings from local, who have suggested that visitors might not be able to cope in a town in a harsh environment with no grocery store and little cellular coverage.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHere are some dancing aliens from the Las Vegas event: Connie West, who runs the Little A'Le'Inn as well as the Rachel Alienstock event says she is feeling great. Her event had been cast into serious doubt – by local residents, who warned that the town couldn't support the visitors, as well as by Matty Roberts, who created the original event but pulled out of the Rachel event amid fears it would go badly wrong – but she says she has proven those doubters wrong. Advertisement That same reporter also has some great pictures of the gathering at the gate This gives you a great view of what it was like at the Alienstock festival last night These pictures do, however, appear to be real – and match with what was on the stream earlier. So this is probably a more accurate of how the events outside the Area 51 gate actually went. This picture is circulating widely on the internet. It looks very dramatic – but when you look closely, it's clearly not real. (The people look like they're from a video game, though I haven't yet been able to work out where exactly it has come from.) This image often accompanies it – and doesn't seem to be a real photo of any of the Storm Area 51 events, either. It does look more real, though, so might be a picture of something else rather than purely fake like the one above appears to be. Advertisement And here's Matty Roberts, who created the original Facebook page, speaking to crowds at the Las Vegas event he encouraged people to go to instead. (While flanked by men in black.) Here's one of the highlights of the Area 51 event in Nevada: a giant inflatable alien head The event is clearly fairly aimless: dozens of people stood around, while sheriffs watch on. But they seem to be having a good time, taking pictures, chatting, occasionally chanting. On the stream, you can see a variety of people speaking, as well as protestors holding placards that include slogans about locked up aliens. One man is waving a North Korean flag. Some people are wearing tin-foil hats. Advertisement A live stream that claims to show events around the fence – which is very much unverified – has gone live again. Perhaps the most famous person to come out of the event is this man, who Naruto runs past a reporter live on TV. (That said, the festivals are actually scheduled to keep happening until Sunday, so there's plenty of time for things to happen and go wrong.) We are right in the middle of the time Area 51 was due to be stormed – the original Facebook event was set for 3am to 6am local pacific time, or 11am to 2pm UK time. Advertisement If you're wondering how we managed to get here – as well you should – here's how this happened and what's going on now. What is actually happening at the 'Storm Area 51' event A viral meme very quickly led to US military warnings and fears people could be in danger About 1,500 people have headed to the two desert events, in Rachel and Hiko, according to Lincoln County Sheriff Kerry Lee. Late last night, more than 150 people took the difficult journey to the two gates of Area 51, Lee said, so that they could take selfies. No arrests were made and heading to the gate is allowed – so long as you go no further.\n\n\n\n\"It's public land,\" the sheriff said. \"They're allowed to go to the gate, as long as they don't cross the boundary.\"\n\n\n\nThe atmosphere is similar at the rival Alienstock, being held in the town of Rachel, Nevada, at the Little A'Le'Inn: Meanwhile the one in Hiko, Nevada – a town that is much smaller and thoroughly ill-equipped for an event like this, though is closer to Area 51 – looks a little more gruelling: Advertisement 1 2 Next\n\nPlease allow a moment for the live blog to load", "description": "Alien-hunters are arriving near Area 51 after a viral craze that saw them commit to storm the mysterious US military base. A variety of events are taking place to mark the weekend, including music festivals in a variety of locations. But some appear to be still committed to at least getting close to the base's famous military gates, coming near enough to snap selfies alongside", "authors": ["Andrew Griffin"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/20/11/area-51-0.jpg", "published_at": "2019-09-20"}