{"pub": "yahoo", "url": "https://news.yahoo.com/subaru-breaks-sales-streak-9-153000156.html", "downloaded_at": "2019-10-05 00:11:41.938369+00:00", "title": "Subaru Breaks Sales Streak with 9.4 Percent Drop in September", "language": "en", "text": "From Car and Driver\n\nSubaru's U.S. sales were down more than 9 percent in September, the company's first decline after 93 months of sales increases.\n\nAugust was an all-time record for the brand, with sales up more than 9 percent, and the September drop can be partly explained by an overall slump in auto sales throughout the industry.\n\nSubaru's biggest loser was the BRZ (pictured above), which was down 61 percent last month.\n\nAfter 93 straight months of continuous sales growth—that's almost eight years' worth—the winning streak has ended for Subaru, at least temporarily. Sales in September fell by 9.4 percent, a drop that comes despite a sharp increase in sales incentives that were up by 49 percent from last year and, Automotive News reported, amounted to $1860 per vehicle. The drop comes across the entire Subaru lineup:\n\nSubaru attributes the cause to low inventories and fewer selling days in September 2019 than in September 2018. Additionally, two of Subaru's redesigned vehicles, the 2020 Legacy (pictured below) and the 2020 Outback, started production in late July and will be reaching customers this fall.\n\n\n\nPhoto credit: Subaru More\n\nThere certainly doesn't appear to be reason to panic for Subaru—which sold its 10 millionth vehicle in the United States, a 2019 Impreza, during the month of Spetember. And August was a record-breaking month for Subaru—sales surpassed 70,000 vehicles for the first time. For the year to date, sales are up by 4.4 percent, at 525,329. However, the critical Labor Day weekend sales were included in the August numbers. The automaker said it is still on track to hit its sales target of 700,000 in 2019, which would add up to \"12 consecutive years of sales increases.\"\n\nIs it possible that everyone who wants a Subaru now has one? It's too soon to say just yet; what happens in October will be more revealing of what is in store both for Subaru and the industry as a whole.\n\nYou Might Also Like", "description": "Does everybody who wants a Subaru have one by now? Probably not.", "authors": ["Kirk Seaman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/XBt0unw163kGFBZNn7lnHA--~B/aD03MTk7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/car_and_driver_581/f5c1e7830bbb71713aaf33b7dd95b213", "published_at": "2019-10-03"}