{"pub": "metro", "url": "https://metro.co.uk/2019/10/13/thieves-jailed-kidnapping-man-outside-pub-demanding-lots-money-10908938", "downloaded_at": "2019-10-13 11:39:15.242705+00:00", "title": "Thieves jailed for kidnapping man outside pub and ‘demanding lots of money’", "language": "en", "text": "Cameron Halls, 33, Marc Spittle, 34, and Alisha Dale, 29, kidnapped their victim on New Year’s Eve (Picture: SWNS)\n\nA gang of thieves who kidnapped a man at knife-point after hearing he’d recently come into some money have been jailed.\n\nCameron Halls, 33, Marc Spittle, 34, and Alisha Dale, 29, picked up their victim, in his 20s, from outside a pub on New Year’s Eve last year.\n\nThey then bundled him into a car and drove him around Stafford, while demanding he hand over the cash.\n\nSpittle, who knew the victim, was anxious to pay off some debts, Stafford Crown Court heard.\n\nHe and Halls held the man down while Dale drove the car, as the group threatened him with a blade and put him into headlocks in their desperate bid to get the money.\n\nHalls was deemed the ringleader by the judge (Picture: SWNS)\n\nThe victim was known to Spittle (Picture: SWNS)\n\nThe victim told them he no longer had the cash, and he was taken to a relatives house, where others inside were threatened and assaulted by the trio.\n\nAdvertisement\n\nAdvertisement\n\nAfter still failing to get the money, the gang took the man back into the car before finally dropping him off on Belt Road, near Cannock, around two hours after they first kidnapped him.\n\nGreat-granddad lies 'freezing' in street as ambulance takes two hours to arrive\n\nHe then found a working man’s club and told a woman inside: ‘I’ve been kidnapped. They had a knife and they demanded lots of money.’\n\nSpittle, Halls and Dale were sentenced for a total of more than 36 years behind bars.\n\nHalls, of Sidney Avenue, Stafford, was found guilty of kidnap, conspiracy to rob and robbery and was sentenced to 17 years.\n\nDale drove the vehicle the trio used to kidnap the man (Picture: SWNS)\n\nSpittle, of Greensome Lane, Stafford, pleaded guilty to kidnapping and two counts of conspiracy to rob at an earlier hearing and was jailed for 14 years.\n\nDale, of Exeter Street, Stafford, was jailed for five years and six months for kidnapping and conspiracy to rob.\n\nDetective Sergeant Ian Press, of Staffordshire Police, said: ‘This was a terrifying experience for the victim that lasted for several hours.\n\n‘He was held at knife-point, in fear for his own life and those of family members.\n\n‘We’re glad the three involved are now serving substantial sentences which reflect the seriousness of this disturbing crime.’\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Cameron Halls Marc Spittle and Alisha Dale picked up their victim from outside a pub in Stafford on New Year's Eve last year.", "authors": ["Lucy Middleton"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_89560576_1570963009.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-13"}