{"pub": "independent", "url": "https://independent.co.uk/sport/general/boxing/ksi-vs-logan-paul-rematch-undercard-dazn-tickets-ryan-garcia-youtube-eddie-hearn-a9095641.html", "downloaded_at": "2019-09-09 23:24:46.503184+00:00", "title": "Why KSI vs Logan Paul II is no gimmick", "language": "en", "text": "KSI vs Logan Paul. Boxing spectacle or commercial gimmick?\n\nThe first chapter in this curious tale started back in February 2018 when KSI first stepped into the ring with Joe Weller. An instant sell out, 7,500 screaming fans crammed into London’s Copper Box Arena to watch the 26-year-old YouTuber, wearing a bright red headguard, win via stoppage. This was, after all, an amateur bout.\n\n“If any YouTuber wants it they can come and get it. Jake Paul, Logan Paul, any of the Pauls I don’t care. Bring it,” said KSI, full of adrenaline in the aftermath of his victory.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nAnd so six months went by, online jabs were traded and finally the pair made a deal. Paul, on the back of the near career-ending suicide forest incident, was looking for an out, a distraction. He found it. Boxing.\n\nShape Created with Sketch. KSI vs Logan Paul in pictures Show all 65 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. KSI vs Logan Paul in pictures 1/65 It was a tense affair 2/65 After months of verbal jabs 3/65 KSI and Logan Paul finally met in the squared circle 4/65 Paul started the quicker of the pair 5/65 Fast establishing his jab 6/65 Both men met in the middle of the ring 7/65 Refusing to back down to one another 8/65 Paul's much longer reach helped him gain an early lead 9/65 But KSI used his ring prowess to get close to his opponent 10/65 They fought in a packed out Manchester Arena 11/65 With more than 18,000 believed to be in attendance 12/65 KSI was defending his \"YouTube Championship\" belt 13/65 Which he won in his first amateur bout against Joe Weller 14/65 It took KSI 3 rounds to get into the fight 15/65 And when he did, he really got into the swing of things 16/65 KSI weighed in at 84.9kg for the fight 17/65 Looking lean as he hit the ring 18/65 The pair were forced to hold each other a lot in the ring 19/65 As KSI worked the body 20/65 Using his previous amateur experience to gain an edge later in the fight 21/65 The pair quickly tired as they realised the true toll of the boxing game 22/65 KSI was sporting a typically eye-catching ensemble 23/65 While Paul opted for all black 24/65 Paul entered the ring at 86kg dead 25/65 And used his size to his advantage in the early stages 26/65 The fierce rivalry began after KSI called Paul out 27/65 When he beat Weller in the first match-up between YouTubers 28/65 Paul answered the call and a fight was quickly announced 29/65 It's believed both men made 30/65 Upwards of £5 million each 31/65 With early reports they had made £25 million a hand wildly overestimated and denied 32/65 Paul trained at the Mayweather gym prior to his amateur debut 33/65 While KSI trained in London with professional boxer Viddal Riley 34/65 It took a lot of effort for KSI to find his range 35/65 With Logan the much taller man 36/65 The rematch between the pair 37/65 Will be fought at Staples Centre in Los Angeles 38/65 On 9 November 39/65 But this time... 40/65 There's a twist 41/65 It will be in the professional ranks 42/65 Promoted by Eddie Hearn and Matchroom Boxing USA 43/65 The two YouTube stars 44/65 Will be whipping their headguards off 45/65 Putting on 10oz gloves 46/65 And finding out what the pro game is really like 47/65 The fight will be contested at cruiserweight 48/65 With the likes of 49/65 Billy Joe Saunders and Devin Haney 50/65 Set to feature on the undercard 51/65 The move has come under some controversy 52/65 With many in boxing criticising the pair's ability and skill 53/65 It will be a six-round fight 54/65 And unlike the first event which featured the likes of Deji, Jake Paul and other YouTubers 55/65 This event will solely be for professional fighters 56/65 It's expected that the Staples Centre will be a sell-out 20,000 crowd 57/65 With the arena previously playing host to the likes of Deontay Wilder and Tyson Fury 58/65 The first time round 59/65 A two-fight deal was signed 60/65 And the pair fought to 61/65 A majority draw 62/65 But now, they will look to settle the score 63/65 With professional judges and the show live on DAZN in America and around the world 64/65 No stone will be left unturned by the pair 65/65 KSI vs Logan Paul II is on 9 November in Los Angeles, California 1/65 It was a tense affair 2/65 After months of verbal jabs 3/65 KSI and Logan Paul finally met in the squared circle 4/65 Paul started the quicker of the pair 5/65 Fast establishing his jab 6/65 Both men met in the middle of the ring 7/65 Refusing to back down to one another 8/65 Paul's much longer reach helped him gain an early lead 9/65 But KSI used his ring prowess to get close to his opponent 10/65 They fought in a packed out Manchester Arena 11/65 With more than 18,000 believed to be in attendance 12/65 KSI was defending his \"YouTube Championship\" belt 13/65 Which he won in his first amateur bout against Joe Weller 14/65 It took KSI 3 rounds to get into the fight 15/65 And when he did, he really got into the swing of things 16/65 KSI weighed in at 84.9kg for the fight 17/65 Looking lean as he hit the ring 18/65 The pair were forced to hold each other a lot in the ring 19/65 As KSI worked the body 20/65 Using his previous amateur experience to gain an edge later in the fight 21/65 The pair quickly tired as they realised the true toll of the boxing game 22/65 KSI was sporting a typically eye-catching ensemble 23/65 While Paul opted for all black 24/65 Paul entered the ring at 86kg dead 25/65 And used his size to his advantage in the early stages 26/65 The fierce rivalry began after KSI called Paul out 27/65 When he beat Weller in the first match-up between YouTubers 28/65 Paul answered the call and a fight was quickly announced 29/65 It's believed both men made 30/65 Upwards of £5 million each 31/65 With early reports they had made £25 million a hand wildly overestimated and denied 32/65 Paul trained at the Mayweather gym prior to his amateur debut 33/65 While KSI trained in London with professional boxer Viddal Riley 34/65 It took a lot of effort for KSI to find his range 35/65 With Logan the much taller man 36/65 The rematch between the pair 37/65 Will be fought at Staples Centre in Los Angeles 38/65 On 9 November 39/65 But this time... 40/65 There's a twist 41/65 It will be in the professional ranks 42/65 Promoted by Eddie Hearn and Matchroom Boxing USA 43/65 The two YouTube stars 44/65 Will be whipping their headguards off 45/65 Putting on 10oz gloves 46/65 And finding out what the pro game is really like 47/65 The fight will be contested at cruiserweight 48/65 With the likes of 49/65 Billy Joe Saunders and Devin Haney 50/65 Set to feature on the undercard 51/65 The move has come under some controversy 52/65 With many in boxing criticising the pair's ability and skill 53/65 It will be a six-round fight 54/65 And unlike the first event which featured the likes of Deji, Jake Paul and other YouTubers 55/65 This event will solely be for professional fighters 56/65 It's expected that the Staples Centre will be a sell-out 20,000 crowd 57/65 With the arena previously playing host to the likes of Deontay Wilder and Tyson Fury 58/65 The first time round 59/65 A two-fight deal was signed 60/65 And the pair fought to 61/65 A majority draw 62/65 But now, they will look to settle the score 63/65 With professional judges and the show live on DAZN in America and around the world 64/65 No stone will be left unturned by the pair 65/65 KSI vs Logan Paul II is on 9 November in Los Angeles, California\n\nIn the way so many young up and coming boys and girls who need a new lease of life find, boxing answered the call.\n\nThis time, an upgrade. With a combined following of well over 50,000,000 people, the tiny Copper Box simply wouldn’t do.\n\nThe Manchester Arena it was. A total of 18,000 people in attendance, pay-per-view online, KSI defending his ‘YouTube Boxing Championship’ against the man who everyone wanted to hurt. Headguards back on and away they went.\n\nWhat happened next was unprecedented. The fight, ending in a controversial draw, sold 1,300,000 pay-per-views at £7.50 per person. £10,000,000 was generated from online purchases alone. A monumental success for all involved. Something that only the elite in contact sport are capable of, the Floyd Mayweathers of the world, the Conor McGregors. KSI and Paul have bigger followings than both men combined.\n\nAnd so here we are, over a year on from the ‘Biggest Internet Event in History’ and with a score still to settle, KSI and Paul meet again. This time, the Staples Centre plays host. The arena that has seen it all: Oscar de la Hoya vs Shane Mosley, Lennox Lewis vs Vitali Klitschko, Deontay Wilder vs Tyson Fury.\n\nNow KSI vs Logan Paul.\n\nWe all know that the quality won’t be at the same level as the many world title fights the legendary arena has seen, but this time it’s different.\n\nThis time, it’s professional rules. No headguards, 10oz gloves, KSI and Paul are getting into the real hurt business.\n\nPromoted by Matchroom Boxing USA’s Eddie Hearn, this is no gimmick. There will be no YouTubers on the undercard, it won’t be on the platform that caters to their millions of followers. This time it’s different.\n\nWorld champions want to be on the undercard, others won’t be able to keep their eyes away. Billy Joe Saunders, the WBO super middleweight champion of the world, personally send KSI a text message asking if he could be on the card.\n\nA genius marketing move by the struggling DAZN which, having failed to put together the trilogy bout between Saul ‘Canelo’ Alvarez and Gennady Golovkin, looks to round off its 2019 in strong fashion, with Anthony Joshua also attempting to regain his belts from the grasp of boxing’s unlikeliest hero, Andy Ruiz Jr. Put KSI vs Logan Paul up there. From one streaming service in YouTube to another in DAZN, this will be easy for the pair’s millions of consumers to convert to. It could be the biggest fight the platform has seen to date – and will ever see.\n\nHopes that fans of the YouTube stars tuning in to the fight will convert into full-time boxing fans are ambitious, but could just work.\n\nRyan Garcia, darling of Golden Boy Promotions, manages to blur the line between boxing prospect and online sensation.\n\nA boxing talent with an 18-0 record, 15 by way of knockout, the 21-year-old could well be on his way to a world title bid. But he understands that being a good boxer just isn’t enough anymore. With an Instagram following of over 3,300,000 and the star of a YouTube series, ‘The Flash’ caters to his young audience. And it’s helped him; he sells out minor arenas and is known among the mainstream as well as the typical hardcore boxing crowd.\n\nWhy can’t it work the other way? With KSI and Paul lacing up their gloves for their professional debuts among the bruising cruiserweight division, this huge event, which guarantees millions of pay-per-view buys and an instant sell out crowd of 20,000, could become the new norm for the YouTube generation, its stars and their followers.", "description": "KSI vs Logan Paul. Boxing spectacle or commercial gimmick? The first chapter in this curious tale started back in February 2018 when KSI first stepped into the ring with Joe Weller. An instant sell out, 7,500 screaming fans crammed into London’s Copper Box Arena to watch the 26-year-old YouTuber, wearing a bright red headguard, win via stoppage. This was, after all, an amateur", "authors": ["Adam Hamdani"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/05/16/ksi-vs-logan-paul-60.jpg", "published_at": "2019-09-09"}