{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/adorable-school-photo-harry-8-20586935", "downloaded_at": "2019-10-16 13:47:38.275296+00:00", "title": "Adorable school photo of Harry, 8, hides heartbreaking fight against rare illness", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLike many other proud mums, Melanie Elliston Addy couldn't hide her joy when she shared an adorable photo of her son, Harry, on his first day back at school on Facebook .\n\nBut behind the eight-year-old's broad grin and bright red uniform hides his brave fight against a rare form of cancer.\n\nLittle Harry has been battling a pilocytic astrocytoma, which is a spinal cord tumour, since December 2015.\n\nHe also has leptomeningeal disease in his brain - a rare complication of his cancer where the disease has spread to the membranes surrounding the brain and spinal cord.\n\nThe schoolboy is currently undergoing gruelling weekly chemotherapy at Addenbrooke's Hospital in Cambridge.\n\nBut his determined mum wants to raise £70,000 for proton beam therapy, a pioneering radiotherapy treatment that pinpoints tumours with better accuracy and is said to reduce damage to other organs.\n\nHarry, who loves wrestling, and his family are still waiting to hear if the NHS will approve him for treatment in the UK, so Melanie wants to raise enough to ensure he can have it abroad.\n\nMelanie said: \"Harry is still smiling. He’s just a happy boy who wants to get on with life.\n\n\"He’s endured weekly chemo for almost two and a half years. With an adult, someone might end up feeling sorry for themselves.\n\n\"But with Harry, it’s completely different. He’s just the most amazing child you could possibly imagine.\n\n\"He’ll never be able to run around like other kids but he’s returned to school and he loves watching WWE Wrestling. We sit and watch Monday Night Raw together - it’s awesome.\n\n\"And we just have to keep fighting, together, as a family.\"\n\nMelanie - also mum to Daisy, 11, Matilda, six, and three-year-old Hattie - explains that Harry has already had to major operations to remove the tumour.\n\nEach time he has had to learn how to walk again but still the growth hasn't been totally removed.\n\nHarry began his first year of chemotherapy in February 2017, a treatment which ultimately failed to bring the tumour under control.\n\nMeanwhile a subsequent - and successful - 18 month-long stint of weekly chemotherapy is due to end soon.\n\nMelanie, a former marketing worker from Stalham, Norfolk, has been documenting her son’s progress through the Facebook page ‘Harry’s Journey’.\n\nUnderneath the photo of Harry returning to school this month, she wrote: \"So proud of Harry today.\n\n\"He’s gone off to school for the first time since May - with a big smile on his face!\n\n\"Fingers crossed it all goes well for him today! I’m picking him up at 1 for his weekly chemo!\n\n\"After today it will be four left. We are very excited about this - although also very anxious for the next part of Harry’s Journey xxxxx’.\"\n\nHarry had to have shunts fitted into his brain in June to remove the excess fluid that was building there.\n\nMelanie says that procedure took Harry and her family to their lowest ebb yet.\n\nIn one agonising Facebook post, Melanie revealed: \"Harry woke up crying, wanting to go home, saying he hates his life, and asking why do bad things always happen to me?\n\n\"Our hearts are completely breaking. I have watched him go through so much, and it doesn’t get any easier.\"\n\n(Image: Roisin Pelan)\n\nIn July she added: \"Today has been a tough day!! It’s heartbreaking to watch - he’s been through so much, and continues to go through so much on a daily basis!\"\n\nNow, as Harry prepares to ring a bell at Addenbrooke’s signalling the end of this round of chemo, Melanie faces an anxious wait to discover what happens next.\n\nHarry is due a new MRI scan in October which will determine the next treatment.\n\nThe youngster has already been denied by the NHS’ proton therapy commissioning panel that decides which patients receives the treatment.\n\nThey argued that proton therapy was not appropriate for Harry at this time owing to the complications in his brain.\n\nAnd while Melanie accepts that decision, she feels Harry will fit the clinical criteria for proton therapy in the future - but fears that because he’s been rejected once, he’ll be rejected again.\n\nShe’s instead hoping to pay for proton therapy privately at a treatment centre abroad and has already managed to raise £34,397 of a £70,000 target.\n\nMelanie said: \"Harry’s diagnosis is extremely rare - Addenbrooke’s oncologists say they’ve never seen what Harry has in his brain before - and we have to take every day at a time.\n\n\"I feel the tumour in Harry’s spine would be best treated with protons. He’ll definitely need proton therapy in the future.\n\n\"But because we’ve already been rejected by the NHS, I worry we’ll never get it.\n\n\"Which is why we’re attempting to crowdfund for future treatment. Just the other day, someone anonymously donated £1,000.\n\n\"I have no idea who did it, but it’s amazing. People are amazing.\n\n\"And if Harry does eventually get accepted for proton therapy on the NHS, every penny we’ve raised will be donated to the charities who’ve helped us so far.\"\n\nThe first ever NHS proton therapy centre opened at the Christie Hospital in Manchester last year while a second NHS facility is due to launch at the University College Hospital, London, next year - at a combined cost of £250million.\n\nBut they will only be able to treat around 750 patients each year - the vast majority being children.\n\nAnd European proton beam therapy expert Dr Jiri Kubes, medical director of the Proton Therapy Center in Prague, Czech Republic, says the treatment can be highly beneficial when it comes to treating paediatric cancers.\n\nHe added: \"Unlike standard photon radiation, protons release only a small amount of energy as they pass through the healthy tissues.\n\n\"Just before the end of the proton’s trajectory, the tissue absorbs most of the energy, and there is a sharp increase in the dose to the tumour, followed by a subsequent sharp decrease beyond the tumour.\n\n\"And by sparing the healthy tissue we can improve the quality of life of pediatric patients after treatment, particularly when it comes to secondary tumours.\n\n\"It will also be the case, however, that many UK patients who want proton therapy are not given access to it through the NHS.\n\n\"While the NHS acknowledges the benefits of Proton Beam Therapy, and is building its own centres, they will still only be able to treat a fraction of those who might benefit from it, while many people will be turned down for the treatment because of the very limited indication criteria.\n\n\"There’s still a long way to go before patients in the UK have widespread access to it.\"\n\nThe Proton Therapy Center has treated more British patients than any other facility in Europe - including the famous UK toddler Ashya King in 2014 - and often sees patients referred there by private medical insurers, such as BUPA.\n\nProton therapy is used to treat a range of cancers, including cancers of the brain, central nervous system, head and neck, prostate, breast and lymphomas.\n\nTo donate to Harry's fund visit www.justgiving.com/crowdfunding/protons-for-harry\n\nFor more information about proton beam therapy, visit ukprotontherapy.co.uk", "description": "Harry Addy is battling a rare form of brain cancer and his mum, Melanie, is appealing for help in beating the disease", "authors": ["Jane Lavender", "Image", "Roisin Pelan"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20587143.ece/ALTERNATES/s1200/0_Melanie-Elliston-Addy.jpg", "published_at": "2019-10-16"}