{"pub": "cnbc", "url": "https://cnbc.com/2019/10/09/why-suze-orman-keeps-exactly-170-dollars-in-her-wallet.html", "downloaded_at": "2019-10-09 18:38:33.493382+00:00", "title": "Suze Orman keeps exactly $170 in her wallet—here's why", "language": "en", "text": "That's why Orman is meticulous about keeping hers pristine. She believes that how you physically treat money reflects how you use it. \"If you disrespect money by crumbling it up, not having it in order, not touching it, just having everything stuffed in there ... I will guarantee you that you're not making the most out of your money,\" she said.\n\n\"I could tell you your story by looking at your wallet,\" she said during a conversation with CNBC Make It managing editor Jenna Goudreau.\n\nTo Suze Orman, personal finance expert, best-selling author of \"Women & Money\" and host of the \"Women & Money\" podcast , your wallet is \"a picture of your life.\"\n\nSo what does the personal finance expert keep on her at all times? Orman's slim wallet holds her driver's license, prescription and health insurance cards, three credit cards and $170 in cash.\n\nThe cash consists of crisp bills arranged from highest to lowest denomination, all facing the same way. And $170 is not a random amount. The numbers — one, seven, zero — add up to eight. \"In Asia, eight is the number of wealth,\" Orman explained.\n\nAs for her credit cards, \"I'm sure you'd expect me to have a black card or a platinum,\" Orman said. However, she opts for ones with perks that fit her lifestyle, rather than those that offer prestige. Her American Express card offers 6% cash back on some items and makes sense for Orman's spending habits.\n\nMore from Invest in You:\n\nDeepak Chopra: Your bad money habits could be hurting your health\n\nHow to start an emergency fund when you live paycheck to paycheck\n\nSallie Krawcheck: Here's the 'right time' to negotiate your salary\n\nInvesting legend Warren Buffett takes a different approach. You'll find far more sentimental items in the Berkshire Hathaway CEO's wallet, including photos of both his children and grandchildren as kids.\n\nBuffett also keeps a $50 bill from a bank Berkshire Hathaway once owned in Rockford, Ill., signed by the owner. \"They issued their own currency, so I carry that around for good luck,\" he told GOBankingRates.\n\nCHECK OUT: Grocery chain CEO who ate expired food for a year says ignoring some sell-by dates can save you 'a ton of money' via Grow with Acorns+CNBC.\n\nDisclosure: NBCUniversal and Comcast Ventures are investors in Acorns.", "description": "Personal finance expert Suze Orman believes that your wallet is a reflection of your attitude toward money. Here's exactly what she keeps in hers.", "authors": ["Emmie Martin"], "top_image": "https://image.cnbcfm.com/api/v1/image/106160751-1570034192759gettyimages-1146917073.jpeg?v=1570138152", "published_at": "2019-10-09"}