{"pub": "cbc", "url": "https://cbc.ca/news/canada/edmonton/variant-edition-comics-wins-national-award-for-best-comic-book-store-1.5291233", "downloaded_at": "2019-09-23 17:31:15.834350+00:00", "title": "Being named Canada's best comic book store a 'vindication' for Edmonton retailers | CBC News", "language": "en", "text": "An Edmonton shop that is in the business of selling stories has written a happy ending for itself by being named Canada's best comic book retailer.\n\nEarlier this week, Variant Edition Comics received the Harry Kremer Award for Outstanding Comic Book Retailer, one of the 2019 Joe Shuster Awards.\n\n\"It's a labour of love,\" shop co-owner Danica LeBlanc told CBC Radio's Edmonton AM. \"We basically started a store that we would enjoy and found out it's a store that a lot of people enjoy.\"\n\nThe west Edmonton shop, located at 10132 151st St., was cited by judges for the experience it provides it customers.\n\n\"Variant Edition prides themselves on their inclusive environment and innovative recommendation system, which will help you find books you didn't even know you loved.\"\n\nLeBlanc describes that experience as the art of selling stories.\n\n\"Our sense of community comes first. We don't just sell books. We sell stories, we invite readers in,\" she said.\n\n\"It's not just, 'Here's a comic or here's a graphic novel.' We try to make a connection with you and find a story that you're really going to connect with.\"\n\nLeBlanc noted that the thriving world of comics and graphic novels offers a wide variety of stories to put on the store shelves. Lots of times, she said, they'll order books with specific customers in mind.\n\nIt also means that the store's owners make decisions about titles or authors that they don't want to promote through in-store sales.\n\nThat was the situation in May 2018 when Variant endured a barrage of criticism for choosing not to stock a book written by Richard Meyer, who LeBlanc described as a supporter of online harassment and someone who mis-genders trans people.\n\n'A welcoming experience, not just to some'\n\nIn a blog post announcing its award, LeBlanc and co-owner Brandon Schatz make reference to that incident and describe the honour as a \"certain measure of vindication\" for that and other difficult decisions.\n\n\"At Variant Edition, we've always been careful to curate a welcoming experience, not just to some, but to all,\" the post reads.\n\n\"We fight against ideologies that push for 'comics for the few.' In doing so, we've been told that our fight for inclusivity is coming at the expense of those who have maintained power positions in this industry for years.\n\n\"We're here to say: that's a good thing.\"\n\nThe Joe Shuster Awards, named after one of the Superman co-creators, recognize outstanding achievements in Canada in the creation of comic books, graphic novels and web comics.", "description": "Variant Edition Comics says it's in the business of selling stories, connecting with the community and making decisions about what - and what not - to stock.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.3505924.1568994124!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/geek-week.jpg", "published_at": "2019-09-20"}