{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7563015/Warriors-coach-Steve-Kerr-slams-Trump-President-called-scared-little-boy.html", "downloaded_at": "2019-10-11 20:43:33.051778+00:00", "title": "Warriors coach Steve Kerr slams Trump after the President called him a 'scared little boy'", "language": "en", "text": "After being called a 'scared little boy' by Donald Trump for refusing to address the growing rift between the NBA and China, Golden State Warriors coach Steve Kerr told reporters that the Oval Office has 'sunken low' and the country needs 'a mature unifier from either party to sit in that chair.'\n\nKerr recently declined to address the NBA's situation in China, where many took offense to a recent tweet from Houston Rockets general manager Daryl Morey supporting pro-democracy protesters in Hong Kong.\n\nWhen asked about the situation, which threatens the NBA's lucrative business interests in China, Kerr told reporters he was among those who don't 'know what to make' of the story, which is why he refrained from addressing the issue.\n\nTrump seized on Kerr's decision to sidestep the question, claiming that the 54-year-old former NBA player has spoken 'about the United States very badly.'\n\nKerr, who insisted he loves his 'country despite what President Trump said yesterday,' has been outspoken on social issues, such as gun control, and is a frequent critic of the President.\n\nWhile speaking with reporters on Thursday before a preseason game against the Minnesota Timberwolves, Kerr admitted being surprised to hear Trump's remarks.\n\nSCROLL DOWN FOR VIDEO\n\nKerr joked about Trump's 'scared little boy' comment, saying he thought about arriving to Wednesday's exhibition 'on a tricycle' while wearing 'one of those beanies with the propeller'\n\nOn Wednesday, Trump seized on Kerr's decision to sidestep the question, claiming that the 54-year-old former NBA player has spoken 'about the United States very badly'\n\n'It was really surprising,' Kerr. 'But mainly just because it was me. Then you stop and you think, this is just every day. This is just another day. I was the shiny object yesterday. There was another one today; there will be a new one tomorrow. And the circus will go on. It's just strange, but it happened.'\n\nKerr joked about Trump's 'scared little boy' comment, saying he thought about arriving to the game 'on a tricycle' while wearing 'one of those beanies with the propeller.'\n\nHe also compared Trump to the last five presidents, all of whom Kerr had met for a variety of reasons.\n\n'I was thinking about my various visits to the White House,' Kerr said. 'I've lived a privileged life and met, I think, the past five previous presidents prior to President Trump.'\n\nKerr and his family visited the White House several times after his father, Malcolm, was killed by members of the Shia Lebanese militia while he worked for the American University of Beirut in 1984.\n\nSince then, Kerr has won five NBA titles as a player and another three as a head coach, leading to multiple encounters with U.S. leaders.\n\nKerr (right) has met the previous five presidents, thanks largely to his NBA career. In this 2016 photo, Kerr is seen meeting Barack Obama after guiding the Golden State Warriors to a title\n\n'The first one was in 1984, and Ronald Reagan was president,' Kerr began. 'He invited my mom and me, six months after my dad was killed in a terrorist attack. President Reagan and Vice President [George H.W.] Bush invited us into the Oval Office, spent about half an hour with us thanking us for my dad's service – he was in education -- thanking us for my dad's commitment to American values in the Middle East, trying to promote peace in the Middle East.\n\nSteve Kerr said he is an outspoken supporter of gun control because his father was shot to death, and he doesn't want other families to suffer a similar fate. Malcolm Kerr (pictured) was killed by members of the Shia Lebanese militia while he worked for the American University of Beirut in 1984\n\n'And all I could think of last night was the contrast of what has happened in 35 years. There was no regard for whose side you were on politically... The office held such dignity and respect, both from the people who were visiting and especially the people who sat inside it. It's just sad it's come crashing down, that we are now living this.\n\n'I realize the horse was out of the barn a long time on this,' Kerr continued. 'But for me personally, this was my experience with, wow, has the office sunken low. My hope is that we can find a mature unifier from either party to sit in that chair and try to restore some dignity to the Oval Office again, and I think it will happen.'\n\nAs for his willingness to speak out in the future, Kerr said he would not hesitate, as long as it happens to be a subject he's familiar with and passionate about.\n\n'As far as North Korea, I don't know much about North Korea,' he said. 'As far as the Ukraine situation, I don't know much about the Ukraine situation.'\n\nKerr explained his public support for gun control by explaining that it's a personal subject for him: 'I don't want people to feel what my family felt when my father was killed. I know what it feels like to have a family member ended by a bullet.'\n\nSpurs coach Gregg Popovich (left) and Warriors coach Steve Kerr (right) have both been Trump critics in the past. Now Trump accuses them of 'pandering to China' for refusing to address the ongoing rift between the country and the NBA over Rockets general manager Daryl Morey's support for pro-democracy protesters in Hong Kong. Popovich, an air force veteran, recently guided the U.S. national team to a seventh-place finish at the FIBA World Cup\n\nAs for Morey's situation, Kerr refused to comment, saying he chose 'not to be a soundbite,' later admitting, 'it's probably too late for that.'\n\nKerr recently served as the assistant coach on the U.S. national team that finished a disappointing seventh at the FIBA World Cup in China, although many of America's top players, such as LeBron James, decided to sit out of the tournament.\n\nTrump also criticized the team's head coach, Gregg Popovich, but was somewhat more reserved in that case.\n\n'I watched (Team USA and San Antonio Spurs head coach Gregg) Popovich, sort of the same thing, but he didn't look quite as scared, actually,' Trump said Wednesday. 'They'll talk badly about the United States, but when the talk's about China, they don't want to say anything bad. I thought it was pretty sad, actually.'\n\nPopovich, an Air Force veteran who served as an intelligence officer in Eastern Turkey, has also been critical of Trump, saying the President is a racist and a 'pathological liar.'\n\nMorey's since-deleted tweet ignited tensions between the NBA and China, which remains at odds with activists in Hong Kong over the implementation of extradition laws in the former British territory.\n\nThe NBA has not apologized for Morey's social media post, but the league has taken criticism for its perceived kowtowing to China.\n\nMorey's tweet expressed support for anti-government protesters in Hong Kong, and sparked fallout that has completely overshadowed the NBA's annual trip to China — which typically takes on a celebratory tone.\n\nAlthough Morey has since deleted it, the tweet caused the NBA a torrent of negative within the prized Chinese market, which is reportedly worth over $4 billion to the league\n\nA worker removes a large poster from a building ahead of a preseason game in Shanghai between Brooklyn Nets and Los Angeles Lakers. The two teams play again on Saturday\n\nNBA commissioner Adam Silver (standing), speaking in Japan before a preseason game between the Rockets and Toronto Raptors, said it was not up to the league to regulate what players, employees and team owners said. Silver said on Tuesday the league supported Morey's right to exercise his freedom of expression, further angering authorities and some fans in China and threatening the NBA's business there, said to be worth more than $4 billion\n\nNot this year. Most events in advance of the game, such as NBA Cares events to benefit educational causes and the Special Olympics, were called off, as was a 'fan night' where Lakers and Nets players were to interact directly with some Chinese ticketholders. Signage in Shanghai to promote the game — huge photos of James, Anthony Davis, Irving and other players — was ripped down, and mentions of the game were scrubbed from the arena website.\n\nAll that comes as many Chinese corporations suspended their business ties to the NBA. Chinese state broadcaster CCTV said it was not going to show the Lakers-Nets games on Thursday or in Shenzhen on Saturday, and NBA broadcast partner Tencent also said it was changing its coverage plans for the league.\n\nKerr jokes with Obama, a noted basketball fan, in this picture from 2016\n\nSaturday's game between the Lakers and Nets in Shenzhen remains scheduled.\n\nHong Kong has endured nearly four months of protests ignited by a now-scrapped plan to allow extraditions of criminal suspects to be tried in China's opaque courts.\n\nThe protests snowballed into a movement calling for more democratic freedoms, the biggest challenge to China's rule of Hong Kong since its handover from the British in 1997.\n\nChina reacted fiercely to any questioning of its sovereignty over semi-autonomous Hong Kong, and state media has repeatedly warned foreign firms that voicing support for protesters could cost them access to China's market of 1.4 billion people.\n\nNBA China, the league's operation in the country, is valued at about $4 billion, according to Forbes.\n\nThe Houston Chronicle estimated that the Rockets could lose between $10 million and $25 million in Chinese business as a result of the tweet.", "description": "Golden State Warriors coach Steve Kerr responded to criticism from Donald Trump, calling for a 'mature unifier from either party' to replace the President as the Oval Office has 'sunken low.'", "authors": ["Alex Raskin Sports News Editor For Dailymail.Com", "Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/15/19592994-0-image-a-17_1570804215969.jpg", "published_at": "2019-10-11"}