{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/sep/22/trump-ukraine-scandal-joe-biden", "downloaded_at": "2019-09-22 16:32:58.240182+00:00", "title": "What is the Trump-Ukraine scandal about and how is Joe Biden involved?", "language": "en", "text": "What you need to know about the whistleblower’s complaint that the White House is refusing to release to Congress\n\nWhat is the Trump-Ukraine scandal about and how is Joe Biden involved?\n\nRecently, a whistleblower from the US intelligence community voiced urgent concern about a matter involving the president.\n\nTrump goes on offensive over Biden and Ukraine as Schiff ponders impeachment Read more\n\nThe White House is refusing to release the whistleblower’s complaint to Congress but it has been reported that it is about a conversation between Donald Trump and the president of Ukraine.\n\nIn public, Trump is calling for an investigation of former vice-president Joe Biden and his son that involves Ukraine.\n\nThe president’s interest in getting dirt from abroad on a prospective election rival has been hiding in plain sight for months.\n\nThe president has behaved this way before. In 2016, he openly encouraged Russia to snoop on Hillary Clinton’s email. More recently, he said he would listen to foreigners who came to him with dirt on opponents.\n\nHere are some questions and answers about why the Ukraine matter has now become a full-blown scandal.\n\nHow did the whistleblower complaint happen?\n\nSomeone in the government, under the umbrella of US intelligence, saw or heard something that raised a credible and “urgent concern” about how someone else in government did or said something that “involves confidential and potentially privileged communications by persons outside the intelligence community”.\n\nThat’s according to Michael Atkinson, the inspector general for intelligence. The contents of the complaint remain a closely held secret. But reporting has revealed that the complaint was based on a series of events, one of which was a 25 July call between Trump and Ukrainian president Volodymyr Zelenskiy.\n\nWhat has Trump said about the complaint?\n\n“Just another political hack job.”\n\n“I have conversations with many leaders. It’s always appropriate.”\n\n“It doesn’t matter what I discussed.”\n\nWhat have Democrats said?\n\nHouse Speaker Nancy Pelosi has said that if reports about the complaint bear out, Trump will face “serious repercussions” and the nation will have “grave, urgent concerns for our national security”.\n\nPelosi has resisted pressure from members to impeach Trump over his links to Russia. She will find her every word on this matter scrutinized for signs of whether this makes her want to move ahead.\n\nOn Sunday Adam Schiff, the Democratic chair of the House intelligence committee, told CNN “we may have crossed the Rubicon” regarding impeachment.\n\nWhere does Ukraine come into this?\n\nBiden was vice-president, with some influence over US policy on Ukraine, when his son Hunter was on the board of an energy company owned by a Ukrainian businessman.\n\nTrump has been calling for more scrutiny of that period and attributing corrupt motives to the business and government work of the Biden family, without putting forward evidence of wrongdoing, undeterred by the revelation of the whistleblower complaint.\n\nThe question is whether Trump personally pressed Zelenskiy to investigate the Bidens in their call or other times and, if so, whether seeking or accepting such help from a foreign leader to benefit his re-election constitutes a misuse of presidential power. That question can’t be answered with what’s known so far.\n\nIs this Russia redux?\n\nThere are some similarities with the episode investigated by special counsel Robert Mueller, the aggressive effort by Russia to tilt the 2016 election to Trump. There are also differences, as well as much that remains unknown.\n\nThe Mueller report informed or reminded everyone that it is illegal for a political campaign to accept a “thing of value” from a foreign government. It could be argued that an investigation by a foreign government meant to harm a political opponent would be a thing of value, and pressing for one could be perilous for a US president.\n\nIt could also be argued that it is not. The Trump administration has had longstanding complaints about corruption in Ukraine and asking for corruption to be investigated is, on the surface, different than the potential collusion between Moscow and the Trump campaign which Mueller investigated.\n\nOne striking twist is that pressure for a Ukrainian investigation of the Bidens has come most publicly not from the government or the campaign, but from Trump’s personal lawyer. Rudy Giuliani has been working for months to get Ukraine’s leadership to investigate the Bidens.\n\nWhat has Giuliani been doing?\n\nIn May, Giuliani scrapped plans to take his case for a Biden investigation directly to authorities in Kiev, when word got out about the trip. But he’s been talking to Ukrainians about it.\n\nAt the time, he tweeted: “Explain to me why Biden shouldn’t be investigated if his son got millions from a Russian loving crooked Ukrainian oligarch while He was VP and point man for Ukraine.”\n\nTrump tag-teamed him , telling Fox News: “I’m hearing it’s a major scandal, major problem.”\n\nAsked Thursday on CNN if he had pressed Ukrainian leaders to investigate the Bidens, Giuliani said: “Of course I did” seconds after saying, “No, actually I didn’t.”\n\nWhere’s the whistleblower complaint?\n\nUnder wraps. Only bits and pieces of information about it have emerged because the administration has balked at showing it to Congress, much less to the public.\n\nAtkinson, the inspector general, received the complaint on 12 August, reviewed it and found it credible and urgent, and forwarded it two weeks later to Joseph Maguire, acting director of national intelligence.\n\nMaguire’s office decided the complaint was outside the agency’s jurisdiction and not urgent, and informed Congress on 9 September of the situation without showing it the complaint. Atkinson said that was a break from normal procedure, which is to disclose the contents to lawmakers.\n\nHouse Democrats began to suspect that Trump was the subject of the complaint and quickly followed with a subpoena, yet to be satisfied.\n\nAtkinson appeared before the House intelligence committee behind closed doors on Thursday but declined, under administration orders, to tell lawmakers the substance of the complaint.\n\nMaguire has agreed to give public testimony on 26 September and both are expected to talk to the Senate intelligence committee next week.", "description": "Here’s what you need to know about the whistleblower’s complaint that the White House is refusing to release to Congress", "authors": ["Associated Press In Washington"], "top_image": "https://i.guim.co.uk/img/media/c511e7eb806e38092353955b88f8716fe0f7bbe9/0_16_4800_2880/master/4800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d0e6b2733c604889fb12b7147f9b0e0c", "published_at": "2019-09-22"}