{"pub": "metro", "url": "https://metro.co.uk/2019/10/22/mum-tells-protesters-to-shush-because-her-babys-scared-so-they-sing-baby-shark-10961259", "downloaded_at": "2019-10-22 13:35:28.563311+00:00", "title": "Mum tells protesters to shush because her baby’s scared so they sing Baby Shark", "language": "en", "text": "A mum asked the protesters to keep quiet because they were scaring her baby so they started singing Baby Shark (Elaine Jabbour)\n\nDemonstrators in Lebanon took a break during escalating protests over the country’s crumbling economy to sing Baby Shark to a scared toddler.\n\nElaine Jabbour’s car was surrounded by cheering protesters in Baabda District, South of Beirut, as she was driving with her 15-month-old son Robin on Saturday.\n\nShe said: ‘I told them, “I have a baby, don’t be too loud”.’\n\nIn response, the group of men spontaneously broke into the viral internet song that has become popular with toddlers all over the world.\n\nElaine told CNN: ‘He likes this song. He hears it many times at home and laughs.’\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nThe video was shared across Lebanon so rapidly that the Elaine’s husband saw it online before she could tell him about it.\n\nAdvertisement\n\nAdvertisement\n\nShe said the video showed what the heart of the protests are all about – that children in Lebanon should have a better future.\n\nShe said: ‘Robin will see the video when he grows up and know that Lebanese guys were fighting for him.’\n\nThe massive protests in Lebanon have paralyzed the country, as hundreds of thousands flood public squares in cities.\n\nPeople are angry about proposed new taxes from the decades-long ruling government which is seen to be enriching itself while driving the country’s economy into the ground.\n\nMrs Jabbour says that her son really likes Baby Shark (Elaine Jabbour)\n\nThe video of protesters bursting into song instantly went viral (Elaine Jabbour)\n\nOn Monday, Lebanese Prime Minister Saad Hariri attempted to appease demonstrators by approving a package of economic reforms and a 2020 budget without taxes.\n\nBut that only seemed to stoke the flames as more people took to the streets after his announcement, calling the package ’empty promises’.\n\nThe hundreds of thousands of people on the streets form the largest protest movement in Lebanon since the so-called Cedar revolution, which saw a massive uprising against the Syrian occupation of the country and Damascus being blamed for the car bomb assassination of Prime minister Rafik Hariri.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Demonstrators in Lebanon took a break during escalating protests over the country's crumbling economy to sing Baby Shark to a scared toddler. Elaine Jabbour’s car was surrounded by cheering protesters...", "authors": ["Sophia Dourou"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_91155442_1571740127.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-22"}