{"pub": "investing.com", "url": "https://za.investing.com/news/stock-market-news/us-stockswall-st-mixed-after-earnings-reports-twitter-plunges-1971180", "downloaded_at": "2019-10-24 15:08:11.482700+00:00", "title": "US STOCKS-Wall St mixed after earnings reports; Twitter plunges", "language": "en", "text": "© Reuters. US STOCKS-Wall St mixed after earnings reports; Twitter plunges\n\n(For a live blog on the U.S. stock market, click LIVE/ or type LIVE/ in a news window.)\n\n* Microsoft gains on upbeat cloud sales forecast\n\n* PayPal, Tesla among top boosts on Nasdaq\n\n* Twitter drops to seven-month low\n\n* 3M (NYSE: ) drops on lowering profit outlook\n\n* Dow down 0.29%, S&P 500 off 0.06%, Nasdaq up 0.31%\n\n(Updates to open)\n\nBy Shreyashi Sanyal and Arjun Panchadar\n\nOct 24 (Reuters) - A rise in shares of Microsoft and PayPal boosted the Nasdaq on Thursday, but poor earnings reports from Twitter and 3M dragged down the S&P 500 and Dow Jones indexes, taking the shine off what has been an upbeat earnings season so far.\n\nTwitter Inc TWTR.N plunged about 18% to a seven-month low after the social media platform posted disappointing quarterly results. wider communication services sector fell 0.9%, logging the biggest decline among the 11 major S&P 500 sectors.\n\nPost-it notes maker 3M MMM.N dropped 5.16% and was on course for its worst day in six months after lowering its full-year profit forecast. market is reacting to \"micro volatility, which is driven by individual company names, and macro calm around trade,\" said Art Hogan, chief market strategist at National Securities in New York.\n\nThird-quarter earnings reports have taken center stage as investors try to gauge the fallout from a drawn out U.S.-China trade war, which has already shown up in the domestic economy.\n\nThe narrative so far has been fairly positive, with only a small crop of companies including industrial giant Caterpillar (NYSE: ) CAT.N , toymaker Hasbro Inc and chipmaker Texas Instruments blaming the tariff moves for denting results.\n\nOf the 124 S&P 500 companies that reported results up to Wednesday, more than 82% topped earnings estimates, according to Refinitiv data. The S&P 500 index came within a hair's breadth of its record high this week.\n\nWhite House trade adviser Peter Navarro said on Thursday the phase-one trade deal between Washington and Beijing would include much of an agreement scrapped in May around intellectual property. 10:22 a.m. ET the Dow Jones Industrial Average was down 77.95 points, or 0.29%, at 26,756.00, the S&P 500 was down 1.87 points, or 0.06%, at 3,002.65.\n\nThe Nasdaq Composite was up 25.06 points, or 0.31%, at 8,144.85.\n\nTech giant Microsoft Corp gained 1.82% as its outlook for cloud computing services surpassed analysts' expectations, while PayPal Holdings Inc rose 7.73% on a strong full-year earnings forecast. Research Corp jumped 10.6%, boosting the Philadelphia Semiconductor Index by 1.3% after the chip equipment maker forecast strong results for the December quarter. Inc DOW.N gained 2% after the company exceeded profit estimates, while electric car maker Tesla Inc surged 15.12% on a surprise quarterly profit. high profile companies including Amazon.com Inc , Intel Corp and Visa Inc (NYSE: ) V.N are slated to report after markets close on Thursday.\n\nDeclining issues outnumbered advancers for a 1.12-to-1 ratio on the NYSE and for a 1.26-to-1 ratio on the Nasdaq.\n\nThe S&P index recorded 25 new 52-week highs and three new lows, while the Nasdaq recorded 45 new highs and 21 new lows.", "description": "US STOCKS-Wall St mixed after earnings reports; Twitter plunges", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC0K0YG_L.jpg", "published_at": "2019-10-24"}