{"pub": "thehill", "url": "https://thehill.com/policy/technology/466318-zuckerberg-defends-allowing-misinformation-in-campaign-ads", "downloaded_at": "2019-10-18 01:11:38.074686+00:00", "title": "Zuckerberg defends allowing misinformation in campaign ads", "language": "en", "text": "Facebook founder and CEO Mark Zuckerberg Mark Elliot ZuckerbergHillicon Valley: FCC approves T-Mobile-Sprint merger | Dems wrangle over breaking up Big Tech at debate | Critics pounce as Facebook's Libra stumbles | Zuckerberg to be interviewed by Fox News | Twitter details rules for political figures' tweets Facebook's Mark Zuckerberg to be interviewed on Fox News On The Money: Tax, loan documents for Trump properties reportedly showed inconsistencies | Tensions flare as Dems hammer Trump consumer chief | Critics pounce as Facebook crypto project stumbles MORE on Thursday defended his company’s controversial decision of allowing politicians to post political ads with misleading or false claims on its platform, saying it’s “something we have to live with.”\n\n“People worry, and I worry deeply, too, about an erosion of truth,” Zuckerberg told The Washington Post ahead of a speech at Georgetown University. “At the same time, I don’t think people want to live in a world where you can only say things that tech companies decide are 100 percent true. And I think that those tensions are something we have to live with.\n\nADVERTISEMENT\n\n“In general, in a democracy, I think that people should be able to hear for themselves what politicians are saying,\" Zuckerberg continued. \"Often, the people who call the most for us to remove content are often the first to complain when its their content that falls on the wrong side of a policy.”\n\nIn his 35-minute speech at Georgetown Thursday afternoon, Zuckerberg elaborated on that defense, saying that having tech company's moderate content could be dangerous.\n\n“Political ads on Facebook are more transparent than anywhere else,” Zuckerberg said. “We don’t factcheck political ads… because we believe people should be able to see for themselves what politicians are saying.\n\n“I know many people disagree, but in general I don’t think it’s right for a private company to censor politicians or the news in a democracy. And we are not an outlier here.”\n\nZuckerberg said that the company had considered banning political ads all together but rejected that approach.\n\n“Political ads can be an important part of voice, especially for local candidates and up and coming challengers that the media might not otherwise cover,” he explained. “Banning political ads favors incumbents and whoever the media chooses to cover.”\n\nZuckerberg and Facebook have received backlash over their policy, which came under scrutiny this month after President Trump Donald John TrumpGOP congressman slams Trump over report that U.S. bombed former anti-ISIS coalition headquarters US to restore 'targeted assistance' to Central American countries after migration deal Trump says lawmakers should censure Schiff MORE’s reelection campaign released an advertisement accusing former Vice President Joe Biden Joe BidenTrump says lawmakers should censure Schiff Schiff says committees will eventually make impeachment inquiry transcripts public Trump threat lacks teeth to block impeachment witnesses MORE — without evidence — of using his office to pressure Ukrainian officials to drop an investigation into a company where his son, Hunter Biden, sat on the board.\n\nThe Democratic National Committee called on Facebook to remove the \"false ad.\" Cable network CNN has refused to run the ad, but Facebook has declined to remove it.\n\nFacebook does have a third-party fact-checking program but for now has exempted posts and ads from political figures from that process. Critics argue that the social media giant is responsible for regulating ads on its platform, which reaches more than 2 billion people globally. But Facebook and free speech advocates say they are wary of giving tech companies authority over vetting political claims.\n\nDemocrats are keeping pressure on Facebook.\n\nBiden’s 2020 contender, Sen. Elizabeth Warren Elizabeth Ann WarrenButtigieg tweeted support for 'Medicare for All' in 2018 Overnight Health Care — Presented by National Taxpayers Union — House Dems change drug pricing bill to address progressive concerns | Top Republican rejects Dem proposal on surprise medical bills | Vaping group launches Fox News ad blitz Hillicon Valley: FCC approves T-Mobile-Sprint merger | Dems wrangle over breaking up Big Tech at debate | Critics pounce as Facebook's Libra stumbles | Zuckerberg to be interviewed by Fox News | Twitter details rules for political figures' tweets MORE (D-Mass.), has repeatedly hammered Facebook over the policy by running her own campaign ad that falsely claims that Zuckerberg supports Trump for re-election.\n\nFacebook also came under fire earlier this year when it declined to take down a user-posted video of Speaker Nancy Pelosi Nancy PelosiLawmakers, social media users praise photo of Pelosi confronting Trump Trump turns Pelosi's 'meltdown' criticism around: 'She is a very sick person' Trump threat lacks teeth to block impeachment witnesses MORE (D-Calif.) that was doctored to make it seem like she was slurring her words.\n\nZuckerberg told the Post that Facebook is “working through what our policy should be” when it comes to deepfake videos and is “getting pretty close to at least rolling out the first version of it.”\n\nZuckerberg will testify before the House Financial Services Committee next Wednesday in a hearing on his company’s plans to launch Libra, a new digital currency that has drawn scrutiny from lawmakers and regulators alike.\n\nUpdated at 3:13 p.m.", "description": "Facebook founder and CEO Mark Zuckerberg on Thursday defended his company’s controversial decision of allowing politicians to post political ads with misleading or false claims on its platform, saying it’s “something we have to live with.”", "authors": [], "top_image": "https://thehill.com/sites/default/files/zuckerbergmark_091919as_lead.jpg", "published_at": "2019-10-17"}