{"pub": "news24", "url": "https://channel24.co.za/News/Local/the-unusual-trait-prince-harry-inherited-from-prince-charles-20191018", "downloaded_at": "2019-10-18 10:34:51.312001+00:00", "title": "The unusual trait Prince Harry inherited from Prince Charles", "language": "en", "text": "Cape Town - The apple doesn’t fall far from the tree – and Prince Harry is proof of that!\n\nPrince Charles instilled in his sons a sense of responsibility towards the environment and since they were young had them picking up litter, something the Duke of Sussex constantly got teased for at school, Express UK reported.\n\nDuring a recent interview with the BBC to mark Prince Charles' impending 70th birthday, the 35-year-old royal revealed that he thought it was the norm to pick up garbage, after watching his father do it.\n\n\"I used to get taken the mickey out of at school for just picking up rubbish,\" he said.\n\n\"When you go for walks anywhere, if you see something, it stands out, you pick it up.\"\n\nWhile picking up litter as a royal often left his schoolmates in disbelief, the prince, who’s advocated for environmental conservation for many years, continued to do it.\n\n\"I've literally done this because I am programmed to do it because my father did it. And actually, we should all be doing it,\" Prince Harry explained.\n\nAccording to Prince William (37), the trio used to go on litter-picking trips, Mirror reported.\n\n\"He took us litter picking when we were younger. On holiday!\" the Duke of Cambridge said.\n\n\"And again, both of us thought this is perfectly normal; everyone must do it. We were there with our spikes stabbing the rubbish into black plastic bags.\"\n\nPrince Harry has continued to carry out his father’s legacy of environmental conservation.\n\nHe made this quite evident in an essay recently written for the Telegraph in which he called for people to “overcome greed, apathy and selfishness to make real progress”.\n\nSources: Express UK, Mirror, Telegraph, BBC", "description": "The apple doesn’t fall far from the tree – and Prince Harry is proof of that!", "authors": ["Lesego Mkhize"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9370/5051a83fa3fb4ef6b0c98c6768add8ad.png", "published_at": "2019-10-18"}