{"pub": "theverge", "url": "https://theverge.com/2019/10/15/20908095/google-pixel-4-xl-event-news-products-announcements-updates-highlights", "downloaded_at": "2019-10-15 15:02:19.161946+00:00", "title": "The biggest announcements, live from Google’s 2019 Pixel event", "language": "en", "text": "Google’s big 2019 hardware event is underway. The company has shared details on Pixel Buds, Stadia, Nest Wifi, Nest Mini, and Pixelbook Go. Based on rumors, we also expect it to announce the Pixel 4.\n\nWe’re live at the event, and if you want minute-to-minute updates of everything that’s happening, check out our live blog. But if you just want the headlines with the context that you need, we’re putting them all below.\n\nGoogle breaks down what’s new with the Pixel 4 camera\n\nGoogle’s Pixel 4 uses hybrid digital and optical zoom with both its lenses. It’s shipping with four new features: Live HDR Plus, allowing you to see what your photo, complete with the HDR effect, will look like after processing.\n\nThe camera app offers dual-exposure controls, allowing you to adjust brightness and shadows so you can get the look that you’re looking for.\n\nGoogle has been using machine-based white balancing to provide more accurate colors in tricky shooting scenarios. Snow, for instance, tends to look blue with some SLRs, but Google is working to ensure that photos look realistic on Pixel 4.\n\nNight Sight has been improved, and it showed off the Pixel 4’s ability to take pictures of the stars.\n\nGoogle announces the Pixel 4 and Pixel 4 XL\n\nThe Pixel 4 and Pixel 4 XL have been revealed — officially, this time. Google started off by talking about its Soli radar chip, which it says enables gestures that you can use to command the phone without actually touching it.\n\nBoth phones have a 90Hz refresh rate OLED display, meaning that scrolling around on social media and through the news will appear much more fluid than it usually does on a phone. Both will also come in several color options, including white, black, and orange.\n\nIt also detailed a recording app that can transcribe voice recordings. And it’s not just capable of transcribing, it can dive into recordings to find mentions of any word or sound.\n\nPreorders begin today, and the phones will ship on October 24th.\n\nGoogle’s next mesh Wi-Fi router is called Nest Wifi\n\nGoogle Nest is introducing its new mesh Wi-Fi router system. It’s called the Nest Wifi, and compared to the Google Wifi currently on the market, it stands out with rounded cylindrical design, plus it comes in a few color options. Also what sets them apart is the ability to double as a smart speaker, a la Google Home. Google Nest is introducing two versions of the Nest Wifi: one that is a router that plugs into your modem, and the other (called a “point”) that can double as a smart speaker.\n\nIt will be available starting November 4th.\n\nGoogle’s new Nest Mini is like the Home Mini, but smarter\n\nGoogle Nest’s latest smart speaker is the Nest Mini. It looks like a Google Home Mini, but a few things seem to have been changed. There’s now a hole on its underside to let you mount it to your wall, and it appears to use a sensor to turn on indicator lights when you move a hand toward it. Google Nest says that it will cost $49.99, the same price as the Home Mini.\n\nIt will be available starting October 22nd.\n\nGoogle announces its new Pixelbook Go\n\nGoogle has announced a new flagship Chromebook called Pixelbook Go. Despite the similarity in name to 2017’s Pixelbook, it doesn’t seem to be a follow-up. Instead, this one’s design looks (at a passing glance, at least) like to a modern MacBook — until you flip it over. Its bottom is covered in a ribbed texture that presumably makes it easier to hold.\n\nIt’s available for preorder now in Just Black for $649, and Not Pink will be available to preorder soon.\n\nGoogle’s “all-new” Pixel Buds are small, true wireless headphones\n\nGoogle has announced its next-generation Pixel Buds, called the “all-new Pixel Buds”. These are truly wireless headphones that allow for hands-free access to Google Assistant with the “Hey Google” wake work. They support long-range connectivity, and Google claims that they can remain connected to your phone through three rooms, or up to a football field’s length.\n\nGoogle says that each charge lasts five hours, and its wireless charging case can last up to 24 hours of playtime. These will be available in Spring 2020 for $179.\n\nMark your calendars! Stadia will start arriving November 19.\n\n\n\nNeed a quick guide on what exactly Stadia is? We got you covered. Become an expert in all things Stadia just in time for launch. pic.twitter.com/iwbCQiJ0CH — Stadia (@GoogleStadia) October 15, 2019\n\nGoogle Stadia launches on November 19th\n\nGoogle announced that Stadia, its cloud gaming platform, will launch on November 19th. It will be playable on TV via Chromecast, Google’s Pixelbook lineup, as well as Pixel phones.", "description": "Google has announced the Pixelbook Go, Pixel Buds, Pixel 4, a Stadia release date, and more. We’re live at the event, but if you just want the announcements, we’ve got you covered.", "authors": ["Cameron Faulkner", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/h4BiDNW36g8tNw773MKuqytPr-c=/0x145:2000x1192/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19289026/lcimg_e456eaed_754a_481d_972e_a62c9682f97e.jpg", "published_at": "2019-10-15"}