{"pub": "independent", "url": "https://independent.co.uk/arts-entertainment/music/news/lily-allen-sexual-assault-abuse-warner-bros-record-label-a9103591.html", "downloaded_at": "2019-09-13 09:18:00.958598+00:00", "title": "Lily Allen says her record label failed to act after she reported sexual assault by industry figure", "language": "en", "text": "Lily Allen has claimed that her record label did not take appropriate action after she told them she had been sexually assaulted by an industry figure within the company.\n\nSpeaking on The Next Episode podcast, Allen said that she told a chief executive at Warner Music Records that she had been sexually assaulted, but that she believes the man responsible still works for the company.\n\nAllen said her assault occurred during a work trip to the Caribbean in 2016 and after she had attended a party with the industry figure.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“We got to my hotel,” she recalled. “I couldn’t find my room keys. So he was like, ‘Well, why don’t you sleep in my bed while I go and get the keys or whatever.’ So I passed out in his bed. I woke up and he was in my bed naked slapping my bum and trying to insert his penis into my private parts. I recoiled and got up out of the bed and I screamed.”\n\nShape Created with Sketch. The 35 best debut albums of all time Show all 35 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The 35 best debut albums of all time 1/35 35) Arctic Monkeys – Whatever People Say I Am, That’s What I’m Not (2006) A new wave of British guitar bands was already being pioneered by the likes of The Libertines, Bloc Party and Franz Ferdinand when the Sheffield-formed Arctic Monkeys arrived on the scene. But their 2006 debut – the defiantly titled Whatever People Say I Am, That’s What I’m Not – is arguably the most generation-defining, by a band experiencing the kind of hype that hadn’t been seen since Oasis with Definitely Maybe. Alex Turner’s sardonic and keenly observational lyrics on songs like “Fake Tales of San Francisco” and “When the Sun Goes Down” had fans clamouring to get into their early shows. It was an early example of the power the internet would hold over the music industry – propelling them from an unknown indie band on MySpace to the top of the charts in the space of six months. 2/35 34) Please Please Me – The Beatles (1963) Please Please Me has a rhythm to it like little else released by The Beatles. Songs like “Twist and Shout” and “I Saw Her Standing There” have an energy that reflects the youthful vim of the band themselves, who were raring to go following the number one single from which the album takes its name. Their harmonies are thrilling to hear, and this is arguably the best album for capturing the band’s raw power. 3/35 33) Yeah Yeah Yeahs – Fever to Tell (2003) In 2003, the Yeah Yeah Yeahs stuck a middle finger up to the naysayers who scoffed that they were little more than a bunch of posers. Their debut album Fever to Tell is a bristling record loaded with New York snark supplied by Karen O’s impressive vocal turns. Nick Zinner keeps the urgency going with roaring guitar licks while Brian Chase offers earth-shaking percussion on the likes of “Date With the Night” and “Y Control”. More than trendsetters – the Yeah Yeah Yeahs were the brains behind the smartest album of that year. 4/35 32) Franz Ferdinand – Franz Ferdinand (2004) Kanye West called it “white crunk music”. The band themselves called it “music for girls to dance to”. And songs such as “This Fire” certainly livened things up their irresistible hooks and disco energy, as frontman Alex Kapranos turned the male gaze on its head with lyrics like “I can feel your lips undress my eyes”. Fifteeen years later and “Take Me Out” still makes you swing your hips. 5/35 31) Oasis – Definitely Maybe (1994) Blur versus Oasis is a battle music fans will be waging for decades to come, but when it comes to debut albums, Oasis emerge as top dogs. Definitely Maybe was exciting, aggressive and loaded with attitude: a 22-year-old Liam Gallagher spits and snarls over the reverb-soaked guitars of “Cigarettes & Alcohol”, and soars on that falsetto for “Live Forever”. Among the “too cool for school” alt-rockers who spurned the glitz and glamour of fame, Oasis asserted themselves as the definitive rock and roll stars. 6/35 30) Lady Gaga – The Fame (2008) Stefani Germanotta’s debut album The Fame brought maximalist pop back to the forefront of the late-Noughties music scene, in an industry that was desperately lacking in pop divas. Lady Gaga already sounded famous and she acted famous – but that doesn’t mean her music couldn’t stand on its own. Songs like “Beautiful, Dirty, Rich” and “Just Dance” seemed to convey Gaga’s love of fame and hedonism while remaining supremely self-aware of its superficiality. To top it off, it was masterfully produced and resplendent with slick, catchy dancepop and Eurodisco influences. 7/35 29) Kendrick Lamar – good kid, m.A.A.d City (2012) Kendrick Lamar subtitled his debut record “A Short Film by Kendrick Lamar”, and indeed it feels as though you’re watching the movie of his early life – such is the autobiographical nature of this record. He raps in low, furtive tones, interrupted by voicemails from his family (his mother asks him pleadingly to return her car) that reinforce the familial themes. It is family, and faith, that keep Lamar on the outskirts of a world of violence and sin. Even this early on his career you hear the virtuosity and acute understanding of rhythm – Good kid, m.A.A.d City now stands as a classic album from a rapper who chooses the power of storytelling over a cheap punchline. 8/35 28) Led Zeppelin – Led Zeppelin (1969) Not every great debut album is defined by whether the artist has landed on their “sound” by the first track. Led Zeppelin were still figuring things out when they released their self-titled debut, yet it is essential because it laid the groundwork for what they would go onto achieve the following decade. “We were learning what got us off most and what got people off most,” Robert Plant said. You had the blues and folk notes on “Babe I’m Gonna Leave You”, and the chugging rock of “Communication Breakdown”; Plant’s yowling vocals and Jimmy Page’s guitar. It did the trick. 9/35 27) The Jesus and Mary Chain – Psychocandy (1985) “It was the crap coming out of the radio that made us want to be in a band more than anything else,” Jim Reid told Rolling Stone for the 30th anniversary of the Scottish alt-rocker’s debut album Psychocandy. “Because it was like, ‘Why is everything we hear so f***ing awful?’ That was the main driving force: how bad things were.” Psychocandy was certainly like nothing anyone else released at that time. Inspired by the Velvet Underground and The Stooges, the Reid brothers loaded their debut with buzzy guitars and hair-raising levels of feedback on singles like “You Trip Me Up” and “Never Understand”. It paved the way for countless shoegaze and alt-rock bands in the decades that followed. 10/35 26) Jeff Buckley – Grace (1994) Grace is a masterpiece, and the only album the perfectionist Jeff Buckley was satisfied with before he drowned, aged 30, in a freak accident in Memphis in 1997. Yet had Grace been the only material ever released under his name (live recordings, covers and demos were released posthumously), it would have been enough to prove he was a rare and exceptional talent. His exquisite rendering of Leonard Cohen’s “Hallelujah”, his melismatic singing on “Grace” and the church-like hush of “Lover, You Should Come Over” – all of this and more carved out a rich legacy that ensures Buckley’s music will never fade. 11/35 25) Eminem – The Slim Shady LP (1999) The whipsmart, cynical, outrageous young man on Eminem’s major label debut was a breath of fresh air – or perhaps more of a slap in the face – after a spate of soulful, conscious hip hop records. Of course, the rampant misogyny and homophobia his so-called “character” Slim Shady spat out caused uproar, regardless of how surreal the scenarios to which they were applied were. Arguably what stands out the most on The Slim Shady LP is the sheer technical skill and lyrical ability that few have been able to match since. 12/35 24) The Who – My Generation (1965) Not only did it lay the groundwork for so many punk, rock and heavy metal bands that came after them – but the manic rhythms and raw intensity of their power-chord ballads featured on The Who's my Generation propelled rock and roll to new heights in 1965. 13/35 23) The Strokes – Is This It (2001) “Saviours of rock and roll!” “The greatest rock band since the Rolling Stones!” You have to pity The Strokes, who released their debut album under the biggest wave of hype imaginable. Yet it’s hard to deny the impact Is This It had on rock music – critics have argued that the Arctic Monkeys and Franz Ferdinand wouldn’t have existed if not for this band. They eschewed pre-programmed beats and autotuned vocals in favour of a gritty post-punk approach, and the result was an album that reinvigorated a floundering music industry, and inspired an entire generation of bands. 14/35 22) Run-DMC – Run-DMC (1984) The idea of a rap album was virtually inconceivable until Run-DMC released their full-length, self-titled debut in 1984. When he inducted them into the Rock and Roll Hall of Fame, Eminem called them “the first movie stars of rap… they are The Beatles”. Busta Rhymes proclaimed: “Run-DMC didn’t change music, they changed everything.” The trio’s aggressive yet stark tracks – like “Sucker MCS” and “Hard Times” – were a dramatic contrast against the R&B-driven rap of the time, an approach emulated by the rappers themselves, who spurned outlandish costumes in favour of tracksuits and sneakers. As an anniversary piece in Billboard noted, “they were authentic before authenticity in hip hop was even a thing”. 15/35 21) Roxy Music – Roxy Music (1972) Brian Eno’s experimental synths met Bryan Ferry’s romantic, old-school charm on the debut album from Roxy Music's bizarre art-glam-rock outfit. There were odes to Humphrey Bogart (“2HB”) and cyber-rock jams (“Ladytron”), and songs decorated with spooky-sounding hooks that wouldn’t sound out of place in The Rocky Horror Show (the character Riff Raff even seemed to take his cues from a balding Brian Eno). 16/35 20) Jay-Z – Reasonable Doubt (1996) Still regarded by many as his greatest album to date, Reasonable Doubt asserted Jay-Z as a master freestyle – perhaps the best of his generation – recorded in a studio he compared to a psychiatrist’s couch. At the heart of the record is a blistering duet with the Notorious BIG, “Brooklyn’s Finest”, which practically heralded the shift of focus back from West Coast hip hop to the East. 17/35 19) Black Sabbath – Black Sabbath (1970) Rolling Stone's Lester Bangs described the Black Sabbath as “just like Cream! But worse”, and their debut album as “a shuck – despite the murky song titles and some inane lyrics that sound like Vanilla Fudge paying doggerel tribute to Aleister Crowley, the album has nothing to do with spiritualism, the occult, or anything much except stiff recitations of Cream clichés”. The Village Voice weren’t keen either, with critic Robert Christgau condemning it as “bulls**t necromancy.” Yet this is the album that invented heavy metal. Black Sabbath arrived ready to lure fans over to the dark side with Ozzy Osbourne’s piercing, operatic cry: “My name is Lucifer, please take my hand.” Critics be damned. 18/35 18) Sex Pistols – Never Mind the Bollocks, Here's the Sex Pistols (1977) “The album will last. The sleeve may not,” said the adverts for the Sex Pistols’ first and only studio album in 1977. The Sex Pistols were already controversial before the release of Never Mind the Bollocks, having caused nationwide uproar for swearing on live TV, been fired from two record labels, and been banned from a number of live venues in England. Yet despite many major retailers refusing to sell it, the album debuted at number one on the UK album charts and is today regarded as one of the most important punk albums in music history. 19/35 17) The Clash – The Clash (1977) Joe Strummer was a ball of rage and ambition when he and the rest of The Clash laid down the tracks for their debut album. Most of the guitar on this record was provided by Mick Jones, because Strummer didn’t think technical ability was punk enough. Yet their vision burns through on the buzz-saw attack of “Career Opportunities” and “White Riot”, raising a fist against unemployment, racism and the fat cats of industry. 20/35 16) Guns N Roses – Appetite for Destruction (1987) Guns N Roses' Appetite for Destruction was the biggest thing to happen to hard rock since Led Zeppelin IV. Slash’s guitar and Axl Rose’s wild, animal howls contribute to the raw energy on songs like “Paradise City” and marked a dramatic shift away from the commercialised heavy rock that was being played on MTV at the time – proudly championing a gritty form of hedonism instead. “A lot of rock bands are too f***ing wimpy to have any sentiment or emotion,” Rose said. Not this band. 21/35 15) Daft Punk – Homework (1996) Daft Punk's Homework was originally intended as “just a load of singles”, until Thomas Bangalter and Guy-Manuel de Homem-Christo realised they had enough quality tracks for a full-length release. Each one opens with a kind of motif upon which multiple textures build and sprawl outwards – sleazy guitar hooks, G-funk whines and glittering synths. It’s the album that alerted the rest of the world to the French house music scene. 22/35 14) The Doors – The Doors (1967) Sex and poetry go hand in hand, especially if you’re a Jim Morrison fan. While few bands manage to divide critical opinion as much as The Doors, their debut album’s organ-driven rock was as tight as their frontman’s famous leather trousers. They brought theatricality to the Sixties music scene and went onto inspire as broad a range of artists as The Stranglers to Skrillex. The baroque pop stylings and lustful lyrics on “Light My Fire” proved to be a breakthrough, and helped propel them to number two on the US Billboard 200. 23/35 13) Kanye West – The College Dropout (2004) After making a name for himself on Jay-Z’s The Blueprint as well as by producing hits for Janet Jackson and Ludacris, Kanye West spent four years recording The College Dropout. His background as a producer was obviously beneficial to his own debut, at a time where hip hop sampling was being accused of being too safe. And he subverted many other hip hop clichés, skirting round the dominant “gangsta” persona and instead finding solace in family and the church. Def Jam 24/35 12) Pink Floyd – The Piper at the Gates of Dawn (1967) Pink Floyd’s debut The Piper at the Gates of Dawn stands as a classic of psychedelic rock. Helmed by an unravelling Syd Barrett – ousted a year after the album’s release – it shows the band at their most playful, with several tracks going onto become staples of their live shows. Songs such as “Bike”, meanwhile, proved the band were not averse to a good pop hook along with the acid guitars and hazy production. 25/35 11) Lauryn Hill – The Miseducation of Lauryn Hill (1998) Lauryn Hill raised the game for an entire genre with the immense and groundbreaking record, The Miseducation of Lauryn Hill. Flipping between two tones – sharp and cold, and sensual and smoky – the former Fugees member stepped out from rap’s misogynist status quo and drew an audience outside of hip hop thanks to her melding of soul, reggae and R&B, and the recruitment of the likes of Mary J Blige and D’Angelo. Its sonic appeal has a lot to do with the lo-fi production and warm instrumentation, often comprised of a low thrumming bass, tight snares and doo-wop harmonies. But Hill’s reggae influences are what drive the album’s spirit: preaching love and peace but also speaking out against unrighteous oppression. Even today, it’s one of the most uplifting and inspiring records around. 26/35 10) Dizzee Rascal – Boy in Da Corner (2003) It’s staggering to listen back to Boy in Da Corner and remember Dizzee Rascal was just 18-years-old when he released it. Rising through the UK garage scene as a member of east London’s Roll Deep crew, the MC born Dylan Mills allegedly honed his skills in production after being excluded from every one of his classes, apart from music. If you want any sense of how ahead of the game Dizzee was, just listen to the opening track “Sittin’ Here”. While 2018 has suffered a spate of half-hearted singles playing on the listener’s sense of nostalgia for simpler times, 15 years ago Dizzee longed for the innocence of childhood because of what he was seeing in the present day: teenage pregnancies, police brutality, his friends murdered on the streets or lost to a lifestyle of crime and cash. Boy in da Corner goes heavy on cold, uncomfortably disjointed beats, synths that emulate arcade games and police sirens, and Dizzee himself delivering bars in his trademark, high-pitched squawk. 27/35 9) Beastie Boys – Licensed to Ill (1986) Hip hop’s first number one album was an incendiary, all-guns-blazing record that would send shockwaves around the music industry for years to come. Few artists release something so assertive as this – a statement of intent to middle America that demanded they fight for their right to party. Beastie Boys' Mike D, Ad-Rock and MCA would move on from the frat boy humour and “good time” attitude of Licensed to Ill, but it is that record that delivered rap against a backdrop of Led Zeppelin and James Brown-inspired guitar licks. 28/35 8) The Notorious BIG – Ready to Die (1994) The rapper Notorious BIG, born Christopher Wallace, had been taking part in rap battles around Fulton Street, Brooklyn since he was 13 years old, but it was only at the urging of his friends that he quit a lucrative drugs operation and devoted himself to music. Living on a knife’s edge was all Biggie Smalls knew as a kid, when he was “waking up every morning, hustling, cutting school, looking out for my moms, the police, stickup kids; just risking my life every day on the street selling drugs”, as he told Rolling Stone back in 1995. The things he witnessed and experienced were poured into Ready to Die – one of the best debut albums in hip hop – delivered in his signature throaty vocals with wit and humour. 29/35 7) Ramones – Ramones (1976) At less than 30 minutes, Ramones’ debut injects their rage, their disillusionment and their frustration directly into the listener’s veins. It’s a record that spurned the posturing of Seventies rock and stripped all of the artifice away to the bare bones beneath, with songs such as “Beat on the Brat” and “Now I Wanna Sniff Some Glue” proving to be as surly as the band themselves. “Our early songs came out of our real feelings of alienation, isolation, frustration – the feelings everybody feels between seventeen and seventy-five,” singer Joey Ramone said. The whole record cost just $6,000 to make. 30/35 6) NWA – Straight Outta Compton NWA unveiled their cold, menacing sound on debut record Straight Outta Compton that heralded the beginning of gangsta rap and also launched the careers of Dr Dre, Eazy-E and Ice Cube. The latter made it clear they weren’t positioning themselves as people to look up to: “Do I look like a mother***ing role mode?” he demands on “Gangsta Gangsta”. Their track “F*** tha Police” – a protest track against racism and police brutality – led to them receiving a threatening letter from the FBI, which only contributed to their growing fame. 31/35 5) The Velvet Underground – The Velvet Underground & Nico (1967) Dubbed the Banana Album for its famous Andy Warhol cover art, The Velvet Underground & Nico is proof of what a band can do when they are completely fearless. With Nico – the beautiful German vocalist added to the band at Warhol’s request – you have this exquisite balance of cool femininity and fiery machismo. Sex and hedonism are everywhere on this record, from “Venus in Furs” to “Run Run Run”, but it’s not so much glamour as glam rock – gritty tales of drug addiction and raw desire. Speaking of its initially low sales figures, Brian Eno observed that, nonetheless, “everyone who bought one of those 30,000 copies started a band”. David Bowie called it “the future of music”, and 52 years later, it still feels like it. 32/35 4) Jimi Hendrix Experience – Are You Experienced A virtual unknown to rock fans just a year before – Jimi Hendrix used Are You Experienced to assert himself as a guitar genius who could combine pop, blues, rock, R&B, funk and psychedelia in a way no other artist had before. That’s even without the essential contributions of drummer Mitch Mitchell and bassist Noel Redding, who handed Are You Experienced the rhythmic bridge between jazz and rock. Few album openers are as exquisite as “Purple Haze”. Few tracks are as gratifying, as sexy, as the strut on “Foxy Lady”. And few songs come close to the existential bliss caused by “The Wind Cries Mary”. Hendrix’s attack on the guitar contrasted against the more polished virtuosos in rock at the time – yet it is his raw ferocity that we find ourselves coming back to. Few debuts have changed the course of rock music as Hendrix did with his. 33/35 3) Patti Smith – Horses (1975) “Jesus died for somebody’s sins, but not mine,” go the immortal opening words of Patti Smith’s debut album Horses. There’s a heady anticipation as she speaks the lyric in a low, seductive murmur, before switching to a cocky swagger as the electric guitar line kicks in. It was a bold move, to open her debut album with a reinvention of someone else’s song (in this case Van Morrison’s “Gloria”), but Smith was unlike anything the music world had ever seen. She was a poet, who wanted to capture the literary genius of her idol Arthur Rimbaud and channel it via the raw passion of an artist like Jimi Hendrix. “She was like a wildcat, walking out with this jacket slung over her shoulder,” Sonic Youth’s Thurston Moore once recalled of seeing her perform the album live in 1976. “It was life-changing.” 34/35 2) Illmatic – Nas (1994) How good can rap get? This good. There are albums where the myth can transcend the music; not on Illmatic, where Nas vaulted himself into the ranks of the greatest MCs in 1994, with an album that countless artists since have tried – and failed – to emulate. Enlisting the hottest producers around – Pete Rock, DJ Premier, Q-Tip, L.E.S and Large Professor – was a move that Complex blamed for “ruining hip hop”, while still praising Nas’s record, because it had a lasting impact on the use of multiple producers on rap albums. Nas used the sounds of the densley-populated New York streets he grew up on. You hear the rattle of the steel train that opens the record, along with the cassette tape hissing the verse from a teenage Nasty Nas on Main Source’s 1991 track “Live at the BBQ”: ‘When I was 12, I went to Hell for snuffing Jesus.” 35/35 1) Joy Division – Unknown Pleasures (1979) Unknown Pleasures is unlike any album that had been created before it – or indeed any album since. It’s mysteriousness makes it as compelling as many great works of literature; indeed, our critic Chris Harvey said the spiritual force emanating from the Joy Division's record's grooves make it feel “almost Dostoevskyan”. Peter Hook’s basslines veer and thrum wildly beneath Ian Curtis’s dark mutterings that are at once urgent, detached, and strangely sexless. On “She’s Lost Control” it as though you’re hearing the band play from the end of a dark tunnel – the echoes of Curtis's voice and the ominous rumblings of that bass build and build. By the time you reach those final, shivery notes on “I Remember Nothing”, it doesn’t feel like an overstatement to call this a life-changing record. 1/35 35) Arctic Monkeys – Whatever People Say I Am, That’s What I’m Not (2006) A new wave of British guitar bands was already being pioneered by the likes of The Libertines, Bloc Party and Franz Ferdinand when the Sheffield-formed Arctic Monkeys arrived on the scene. But their 2006 debut – the defiantly titled Whatever People Say I Am, That’s What I’m Not – is arguably the most generation-defining, by a band experiencing the kind of hype that hadn’t been seen since Oasis with Definitely Maybe. Alex Turner’s sardonic and keenly observational lyrics on songs like “Fake Tales of San Francisco” and “When the Sun Goes Down” had fans clamouring to get into their early shows. It was an early example of the power the internet would hold over the music industry – propelling them from an unknown indie band on MySpace to the top of the charts in the space of six months. 2/35 34) Please Please Me – The Beatles (1963) Please Please Me has a rhythm to it like little else released by The Beatles. Songs like “Twist and Shout” and “I Saw Her Standing There” have an energy that reflects the youthful vim of the band themselves, who were raring to go following the number one single from which the album takes its name. Their harmonies are thrilling to hear, and this is arguably the best album for capturing the band’s raw power. 3/35 33) Yeah Yeah Yeahs – Fever to Tell (2003) In 2003, the Yeah Yeah Yeahs stuck a middle finger up to the naysayers who scoffed that they were little more than a bunch of posers. Their debut album Fever to Tell is a bristling record loaded with New York snark supplied by Karen O’s impressive vocal turns. Nick Zinner keeps the urgency going with roaring guitar licks while Brian Chase offers earth-shaking percussion on the likes of “Date With the Night” and “Y Control”. More than trendsetters – the Yeah Yeah Yeahs were the brains behind the smartest album of that year. 4/35 32) Franz Ferdinand – Franz Ferdinand (2004) Kanye West called it “white crunk music”. The band themselves called it “music for girls to dance to”. And songs such as “This Fire” certainly livened things up their irresistible hooks and disco energy, as frontman Alex Kapranos turned the male gaze on its head with lyrics like “I can feel your lips undress my eyes”. Fifteeen years later and “Take Me Out” still makes you swing your hips. 5/35 31) Oasis – Definitely Maybe (1994) Blur versus Oasis is a battle music fans will be waging for decades to come, but when it comes to debut albums, Oasis emerge as top dogs. Definitely Maybe was exciting, aggressive and loaded with attitude: a 22-year-old Liam Gallagher spits and snarls over the reverb-soaked guitars of “Cigarettes & Alcohol”, and soars on that falsetto for “Live Forever”. Among the “too cool for school” alt-rockers who spurned the glitz and glamour of fame, Oasis asserted themselves as the definitive rock and roll stars. 6/35 30) Lady Gaga – The Fame (2008) Stefani Germanotta’s debut album The Fame brought maximalist pop back to the forefront of the late-Noughties music scene, in an industry that was desperately lacking in pop divas. Lady Gaga already sounded famous and she acted famous – but that doesn’t mean her music couldn’t stand on its own. Songs like “Beautiful, Dirty, Rich” and “Just Dance” seemed to convey Gaga’s love of fame and hedonism while remaining supremely self-aware of its superficiality. To top it off, it was masterfully produced and resplendent with slick, catchy dancepop and Eurodisco influences. 7/35 29) Kendrick Lamar – good kid, m.A.A.d City (2012) Kendrick Lamar subtitled his debut record “A Short Film by Kendrick Lamar”, and indeed it feels as though you’re watching the movie of his early life – such is the autobiographical nature of this record. He raps in low, furtive tones, interrupted by voicemails from his family (his mother asks him pleadingly to return her car) that reinforce the familial themes. It is family, and faith, that keep Lamar on the outskirts of a world of violence and sin. Even this early on his career you hear the virtuosity and acute understanding of rhythm – Good kid, m.A.A.d City now stands as a classic album from a rapper who chooses the power of storytelling over a cheap punchline. 8/35 28) Led Zeppelin – Led Zeppelin (1969) Not every great debut album is defined by whether the artist has landed on their “sound” by the first track. Led Zeppelin were still figuring things out when they released their self-titled debut, yet it is essential because it laid the groundwork for what they would go onto achieve the following decade. “We were learning what got us off most and what got people off most,” Robert Plant said. You had the blues and folk notes on “Babe I’m Gonna Leave You”, and the chugging rock of “Communication Breakdown”; Plant’s yowling vocals and Jimmy Page’s guitar. It did the trick. 9/35 27) The Jesus and Mary Chain – Psychocandy (1985) “It was the crap coming out of the radio that made us want to be in a band more than anything else,” Jim Reid told Rolling Stone for the 30th anniversary of the Scottish alt-rocker’s debut album Psychocandy. “Because it was like, ‘Why is everything we hear so f***ing awful?’ That was the main driving force: how bad things were.” Psychocandy was certainly like nothing anyone else released at that time. Inspired by the Velvet Underground and The Stooges, the Reid brothers loaded their debut with buzzy guitars and hair-raising levels of feedback on singles like “You Trip Me Up” and “Never Understand”. It paved the way for countless shoegaze and alt-rock bands in the decades that followed. 10/35 26) Jeff Buckley – Grace (1994) Grace is a masterpiece, and the only album the perfectionist Jeff Buckley was satisfied with before he drowned, aged 30, in a freak accident in Memphis in 1997. Yet had Grace been the only material ever released under his name (live recordings, covers and demos were released posthumously), it would have been enough to prove he was a rare and exceptional talent. His exquisite rendering of Leonard Cohen’s “Hallelujah”, his melismatic singing on “Grace” and the church-like hush of “Lover, You Should Come Over” – all of this and more carved out a rich legacy that ensures Buckley’s music will never fade. 11/35 25) Eminem – The Slim Shady LP (1999) The whipsmart, cynical, outrageous young man on Eminem’s major label debut was a breath of fresh air – or perhaps more of a slap in the face – after a spate of soulful, conscious hip hop records. Of course, the rampant misogyny and homophobia his so-called “character” Slim Shady spat out caused uproar, regardless of how surreal the scenarios to which they were applied were. Arguably what stands out the most on The Slim Shady LP is the sheer technical skill and lyrical ability that few have been able to match since. 12/35 24) The Who – My Generation (1965) Not only did it lay the groundwork for so many punk, rock and heavy metal bands that came after them – but the manic rhythms and raw intensity of their power-chord ballads featured on The Who's my Generation propelled rock and roll to new heights in 1965. 13/35 23) The Strokes – Is This It (2001) “Saviours of rock and roll!” “The greatest rock band since the Rolling Stones!” You have to pity The Strokes, who released their debut album under the biggest wave of hype imaginable. Yet it’s hard to deny the impact Is This It had on rock music – critics have argued that the Arctic Monkeys and Franz Ferdinand wouldn’t have existed if not for this band. They eschewed pre-programmed beats and autotuned vocals in favour of a gritty post-punk approach, and the result was an album that reinvigorated a floundering music industry, and inspired an entire generation of bands. 14/35 22) Run-DMC – Run-DMC (1984) The idea of a rap album was virtually inconceivable until Run-DMC released their full-length, self-titled debut in 1984. When he inducted them into the Rock and Roll Hall of Fame, Eminem called them “the first movie stars of rap… they are The Beatles”. Busta Rhymes proclaimed: “Run-DMC didn’t change music, they changed everything.” The trio’s aggressive yet stark tracks – like “Sucker MCS” and “Hard Times” – were a dramatic contrast against the R&B-driven rap of the time, an approach emulated by the rappers themselves, who spurned outlandish costumes in favour of tracksuits and sneakers. As an anniversary piece in Billboard noted, “they were authentic before authenticity in hip hop was even a thing”. 15/35 21) Roxy Music – Roxy Music (1972) Brian Eno’s experimental synths met Bryan Ferry’s romantic, old-school charm on the debut album from Roxy Music's bizarre art-glam-rock outfit. There were odes to Humphrey Bogart (“2HB”) and cyber-rock jams (“Ladytron”), and songs decorated with spooky-sounding hooks that wouldn’t sound out of place in The Rocky Horror Show (the character Riff Raff even seemed to take his cues from a balding Brian Eno). 16/35 20) Jay-Z – Reasonable Doubt (1996) Still regarded by many as his greatest album to date, Reasonable Doubt asserted Jay-Z as a master freestyle – perhaps the best of his generation – recorded in a studio he compared to a psychiatrist’s couch. At the heart of the record is a blistering duet with the Notorious BIG, “Brooklyn’s Finest”, which practically heralded the shift of focus back from West Coast hip hop to the East. 17/35 19) Black Sabbath – Black Sabbath (1970) Rolling Stone's Lester Bangs described the Black Sabbath as “just like Cream! But worse”, and their debut album as “a shuck – despite the murky song titles and some inane lyrics that sound like Vanilla Fudge paying doggerel tribute to Aleister Crowley, the album has nothing to do with spiritualism, the occult, or anything much except stiff recitations of Cream clichés”. The Village Voice weren’t keen either, with critic Robert Christgau condemning it as “bulls**t necromancy.” Yet this is the album that invented heavy metal. Black Sabbath arrived ready to lure fans over to the dark side with Ozzy Osbourne’s piercing, operatic cry: “My name is Lucifer, please take my hand.” Critics be damned. 18/35 18) Sex Pistols – Never Mind the Bollocks, Here's the Sex Pistols (1977) “The album will last. The sleeve may not,” said the adverts for the Sex Pistols’ first and only studio album in 1977. The Sex Pistols were already controversial before the release of Never Mind the Bollocks, having caused nationwide uproar for swearing on live TV, been fired from two record labels, and been banned from a number of live venues in England. Yet despite many major retailers refusing to sell it, the album debuted at number one on the UK album charts and is today regarded as one of the most important punk albums in music history. 19/35 17) The Clash – The Clash (1977) Joe Strummer was a ball of rage and ambition when he and the rest of The Clash laid down the tracks for their debut album. Most of the guitar on this record was provided by Mick Jones, because Strummer didn’t think technical ability was punk enough. Yet their vision burns through on the buzz-saw attack of “Career Opportunities” and “White Riot”, raising a fist against unemployment, racism and the fat cats of industry. 20/35 16) Guns N Roses – Appetite for Destruction (1987) Guns N Roses' Appetite for Destruction was the biggest thing to happen to hard rock since Led Zeppelin IV. Slash’s guitar and Axl Rose’s wild, animal howls contribute to the raw energy on songs like “Paradise City” and marked a dramatic shift away from the commercialised heavy rock that was being played on MTV at the time – proudly championing a gritty form of hedonism instead. “A lot of rock bands are too f***ing wimpy to have any sentiment or emotion,” Rose said. Not this band. 21/35 15) Daft Punk – Homework (1996) Daft Punk's Homework was originally intended as “just a load of singles”, until Thomas Bangalter and Guy-Manuel de Homem-Christo realised they had enough quality tracks for a full-length release. Each one opens with a kind of motif upon which multiple textures build and sprawl outwards – sleazy guitar hooks, G-funk whines and glittering synths. It’s the album that alerted the rest of the world to the French house music scene. 22/35 14) The Doors – The Doors (1967) Sex and poetry go hand in hand, especially if you’re a Jim Morrison fan. While few bands manage to divide critical opinion as much as The Doors, their debut album’s organ-driven rock was as tight as their frontman’s famous leather trousers. They brought theatricality to the Sixties music scene and went onto inspire as broad a range of artists as The Stranglers to Skrillex. The baroque pop stylings and lustful lyrics on “Light My Fire” proved to be a breakthrough, and helped propel them to number two on the US Billboard 200. 23/35 13) Kanye West – The College Dropout (2004) After making a name for himself on Jay-Z’s The Blueprint as well as by producing hits for Janet Jackson and Ludacris, Kanye West spent four years recording The College Dropout. His background as a producer was obviously beneficial to his own debut, at a time where hip hop sampling was being accused of being too safe. And he subverted many other hip hop clichés, skirting round the dominant “gangsta” persona and instead finding solace in family and the church. Def Jam 24/35 12) Pink Floyd – The Piper at the Gates of Dawn (1967) Pink Floyd’s debut The Piper at the Gates of Dawn stands as a classic of psychedelic rock. Helmed by an unravelling Syd Barrett – ousted a year after the album’s release – it shows the band at their most playful, with several tracks going onto become staples of their live shows. Songs such as “Bike”, meanwhile, proved the band were not averse to a good pop hook along with the acid guitars and hazy production. 25/35 11) Lauryn Hill – The Miseducation of Lauryn Hill (1998) Lauryn Hill raised the game for an entire genre with the immense and groundbreaking record, The Miseducation of Lauryn Hill. Flipping between two tones – sharp and cold, and sensual and smoky – the former Fugees member stepped out from rap’s misogynist status quo and drew an audience outside of hip hop thanks to her melding of soul, reggae and R&B, and the recruitment of the likes of Mary J Blige and D’Angelo. Its sonic appeal has a lot to do with the lo-fi production and warm instrumentation, often comprised of a low thrumming bass, tight snares and doo-wop harmonies. But Hill’s reggae influences are what drive the album’s spirit: preaching love and peace but also speaking out against unrighteous oppression. Even today, it’s one of the most uplifting and inspiring records around. 26/35 10) Dizzee Rascal – Boy in Da Corner (2003) It’s staggering to listen back to Boy in Da Corner and remember Dizzee Rascal was just 18-years-old when he released it. Rising through the UK garage scene as a member of east London’s Roll Deep crew, the MC born Dylan Mills allegedly honed his skills in production after being excluded from every one of his classes, apart from music. If you want any sense of how ahead of the game Dizzee was, just listen to the opening track “Sittin’ Here”. While 2018 has suffered a spate of half-hearted singles playing on the listener’s sense of nostalgia for simpler times, 15 years ago Dizzee longed for the innocence of childhood because of what he was seeing in the present day: teenage pregnancies, police brutality, his friends murdered on the streets or lost to a lifestyle of crime and cash. Boy in da Corner goes heavy on cold, uncomfortably disjointed beats, synths that emulate arcade games and police sirens, and Dizzee himself delivering bars in his trademark, high-pitched squawk. 27/35 9) Beastie Boys – Licensed to Ill (1986) Hip hop’s first number one album was an incendiary, all-guns-blazing record that would send shockwaves around the music industry for years to come. Few artists release something so assertive as this – a statement of intent to middle America that demanded they fight for their right to party. Beastie Boys' Mike D, Ad-Rock and MCA would move on from the frat boy humour and “good time” attitude of Licensed to Ill, but it is that record that delivered rap against a backdrop of Led Zeppelin and James Brown-inspired guitar licks. 28/35 8) The Notorious BIG – Ready to Die (1994) The rapper Notorious BIG, born Christopher Wallace, had been taking part in rap battles around Fulton Street, Brooklyn since he was 13 years old, but it was only at the urging of his friends that he quit a lucrative drugs operation and devoted himself to music. Living on a knife’s edge was all Biggie Smalls knew as a kid, when he was “waking up every morning, hustling, cutting school, looking out for my moms, the police, stickup kids; just risking my life every day on the street selling drugs”, as he told Rolling Stone back in 1995. The things he witnessed and experienced were poured into Ready to Die – one of the best debut albums in hip hop – delivered in his signature throaty vocals with wit and humour. 29/35 7) Ramones – Ramones (1976) At less than 30 minutes, Ramones’ debut injects their rage, their disillusionment and their frustration directly into the listener’s veins. It’s a record that spurned the posturing of Seventies rock and stripped all of the artifice away to the bare bones beneath, with songs such as “Beat on the Brat” and “Now I Wanna Sniff Some Glue” proving to be as surly as the band themselves. “Our early songs came out of our real feelings of alienation, isolation, frustration – the feelings everybody feels between seventeen and seventy-five,” singer Joey Ramone said. The whole record cost just $6,000 to make. 30/35 6) NWA – Straight Outta Compton NWA unveiled their cold, menacing sound on debut record Straight Outta Compton that heralded the beginning of gangsta rap and also launched the careers of Dr Dre, Eazy-E and Ice Cube. The latter made it clear they weren’t positioning themselves as people to look up to: “Do I look like a mother***ing role mode?” he demands on “Gangsta Gangsta”. Their track “F*** tha Police” – a protest track against racism and police brutality – led to them receiving a threatening letter from the FBI, which only contributed to their growing fame. 31/35 5) The Velvet Underground – The Velvet Underground & Nico (1967) Dubbed the Banana Album for its famous Andy Warhol cover art, The Velvet Underground & Nico is proof of what a band can do when they are completely fearless. With Nico – the beautiful German vocalist added to the band at Warhol’s request – you have this exquisite balance of cool femininity and fiery machismo. Sex and hedonism are everywhere on this record, from “Venus in Furs” to “Run Run Run”, but it’s not so much glamour as glam rock – gritty tales of drug addiction and raw desire. Speaking of its initially low sales figures, Brian Eno observed that, nonetheless, “everyone who bought one of those 30,000 copies started a band”. David Bowie called it “the future of music”, and 52 years later, it still feels like it. 32/35 4) Jimi Hendrix Experience – Are You Experienced A virtual unknown to rock fans just a year before – Jimi Hendrix used Are You Experienced to assert himself as a guitar genius who could combine pop, blues, rock, R&B, funk and psychedelia in a way no other artist had before. That’s even without the essential contributions of drummer Mitch Mitchell and bassist Noel Redding, who handed Are You Experienced the rhythmic bridge between jazz and rock. Few album openers are as exquisite as “Purple Haze”. Few tracks are as gratifying, as sexy, as the strut on “Foxy Lady”. And few songs come close to the existential bliss caused by “The Wind Cries Mary”. Hendrix’s attack on the guitar contrasted against the more polished virtuosos in rock at the time – yet it is his raw ferocity that we find ourselves coming back to. Few debuts have changed the course of rock music as Hendrix did with his. 33/35 3) Patti Smith – Horses (1975) “Jesus died for somebody’s sins, but not mine,” go the immortal opening words of Patti Smith’s debut album Horses. There’s a heady anticipation as she speaks the lyric in a low, seductive murmur, before switching to a cocky swagger as the electric guitar line kicks in. It was a bold move, to open her debut album with a reinvention of someone else’s song (in this case Van Morrison’s “Gloria”), but Smith was unlike anything the music world had ever seen. She was a poet, who wanted to capture the literary genius of her idol Arthur Rimbaud and channel it via the raw passion of an artist like Jimi Hendrix. “She was like a wildcat, walking out with this jacket slung over her shoulder,” Sonic Youth’s Thurston Moore once recalled of seeing her perform the album live in 1976. “It was life-changing.” 34/35 2) Illmatic – Nas (1994) How good can rap get? This good. There are albums where the myth can transcend the music; not on Illmatic, where Nas vaulted himself into the ranks of the greatest MCs in 1994, with an album that countless artists since have tried – and failed – to emulate. Enlisting the hottest producers around – Pete Rock, DJ Premier, Q-Tip, L.E.S and Large Professor – was a move that Complex blamed for “ruining hip hop”, while still praising Nas’s record, because it had a lasting impact on the use of multiple producers on rap albums. Nas used the sounds of the densley-populated New York streets he grew up on. You hear the rattle of the steel train that opens the record, along with the cassette tape hissing the verse from a teenage Nasty Nas on Main Source’s 1991 track “Live at the BBQ”: ‘When I was 12, I went to Hell for snuffing Jesus.” 35/35 1) Joy Division – Unknown Pleasures (1979) Unknown Pleasures is unlike any album that had been created before it – or indeed any album since. It’s mysteriousness makes it as compelling as many great works of literature; indeed, our critic Chris Harvey said the spiritual force emanating from the Joy Division's record's grooves make it feel “almost Dostoevskyan”. Peter Hook’s basslines veer and thrum wildly beneath Ian Curtis’s dark mutterings that are at once urgent, detached, and strangely sexless. On “She’s Lost Control” it as though you’re hearing the band play from the end of a dark tunnel – the echoes of Curtis's voice and the ominous rumblings of that bass build and build. By the time you reach those final, shivery notes on “I Remember Nothing”, it doesn’t feel like an overstatement to call this a life-changing record.\n\nAllen said that she did not report the incident to the police, explaining: “I didn’t want to make a fuss and I wanted to keep it quiet. I remember thinking about his mum and how she would deal with the news that her son was a sexual predator and I was prioritising everybody else in this situation except for myself.”\n\nShe did, however, write about the experience in her 2018 autobiography My Thoughts Exactly, and as a result had a meeting over the incident with Max Lousada, a chief executive at Warner Music. When The Next Podcast host Miquita Oliver asked whether Warner Bros took any action as a result of Allen’s claims, Allen replied, “No.”\n\nAllen added that she believed the man may be working with young female artists, explaining that “it’s my responsibility just to let some people know that this incident happened”.\n\nShe also claimed that her career has been “f***ed with” because she spoke about her sexual assault.\n\nIn a statement to the BBC, Warner Music said: “We take accusations of sexual misconduct extremely seriously and investigate claims that are raised with us. We’re very focused on enforcing our Code of Conduct and providing a safe and professional environment at all times.”", "description": "Lily Allen has claimed that her record label did not take appropriate action after she told them she had been sexually assaulted by an industry figure within the company.", "authors": ["Adam White"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/09/15/12/lily-allen.jpg", "published_at": "2019-09-13"}