{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/ex-premier-league-chief-richard-20588371", "downloaded_at": "2019-10-16 01:14:41.493482+00:00", "title": "Ex-Premier League chief Richard Scudamore lands new role with Australian A-League", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nFormer Premier League chief Richard Scudamore has reportedly been drafted in to try and save the Australia A-League.\n\nScudamore, who led the Premier League for 19 years, was due to receive a £5million golden handshake after stepping down from the role in November last year.\n\nAnd he has landed a role as a 'special advisor' to all 11 A-league clubs and the competition's boss Greg O'Rourke, according to the Sydney Morning Herald .\n\nThe move is being seen in Australia as a coup for the league, with Scudamore credited as having overseen a period of phenomenal growth for the Premier League, with revenues having risen from £148million in the 1997-98 season to £3.2 billion this season.\n\nThe Herald says of Scudamore: \"While his football business acumen is wide-ranging, Scudamore's specific experience in negotiating increasingly lucrative television deals for the EPL can only be of benefit to the A-League as it confronts a rapidly changing broadcast landscape at a time when ratings on Fox Sports are nosediving and general interest is flagging.\"\n\n(Image: Getty)\n\nHowever, reaction to the news on social media was mixed - while fans in Australia saw it as a boost for the A-league, some British Twitter users bemoaned his £5m golden handshake from the Premier League.\n\nOne fan said, \"Signing of the season? The the biggest coup Australian football has ever made\", while another said: \"If nothing else, the Premier League is a great case study of how to market and brand a competition well.\"\n\nHowever, another suggested he \"give back his £5m leaving gift and donate it grassroots football\".\n\nThe A-League is in the process of transitioning away from the control of Football Federation Australia and towards an independent structure run by the clubs – much like the transformation of the Premier League back in 1992.\n\nIn quotes reported by the Herald, Scudamore said: \"If anything, Australia has more potential to harness the economic and commercial opportunities available to the game.\n\n\"Certainly all the ingredients are there for significant and rapid development and growth – most importantly there is a groundswell of shared ambition in the Australian game, and that is as uncommon as it is vital.\"", "description": "Man who headed up the Premier League for 19 years has reportedly been drafted in to help save the competition", "authors": ["Gareth Bicknell", "Image", "Getty"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article12663446.ece/ALTERNATES/s1200/1_Premier-League-Media-Event.jpg", "published_at": "2019-10-16"}