{"pub": "abcnews", "url": "https://abcnews.go.com/US/wireStory/indiana-ag-165-fetal-remains-linked-late-doctor-66207143", "downloaded_at": "2019-10-11 19:58:54.874641+00:00", "title": "Indiana AG: 165 more fetal remains linked to late doctor", "language": "en", "text": "Indiana's attorney general said Friday that 165 sets of fetal remains have been found in the Chicago area inside a car owned by a late Indiana abortion doctor, boosting the total number of abandoned sets of fetal remains discovered at properties linked to him to more than 2,400.\n\nAttorney General Curtis Hill said the 165 remains were discovered Wednesday in the trunk of a Mercedes-Benz parked at a business property in Dolton, Illinois, where Dr. Ulrich Klopfer had kept a total of eight cars.\n\nThose remains are believed to be from abortions Klopfer performed in 2002 at his three Indiana abortion clinics, Hill said.\n\nLast month, 2,246 sets of fetal remains were found in Klopfer's Will County, Illinois, garage, after relatives stumbled onto them while cleaning out that building after he died Sept. 3 at age 79.\n\nThose remains, which have been returned to Indiana, were determined to be from abortions Klopfer performed from 2000 to 2002 at his clinics in Fort Wayne, Gary and South Bend. The Fort Wayne clinic closed in 2014, and the Gary and South Bend clinics closed the next year.\n\nThe new discovery brought the total number of sets of fetal remains discovered at properties connected to Klopfer to 2,411.\n\nHill, a conservative Republican who opposes abortion rights, said the disturbing discoveries represent \"uncharted territory for all of us,\" adding that his office is committed to ensuring that all of the remains \"receive a respectful final disposition here in Indiana.\"\n\n\"We are following the same protocol for these additional 165 fetal remains that we have already established,\" he said in a news release.\n\nKevin Bolger, a Chicago attorney for Klopfer's widow, said Friday the family had no comment on the discovery of the latest remains. Bolger said last month following the discovery of the remains in Klopfer's garage that his widow and other relatives were shocked when the remains were found and didn't know they were there.\n\nHill's office is working with Democratic Illinois Attorney General Kwame Raoul to investigate the fetal remains. That investigation has also uncovered thousands of patient medical records at Klopfer's former Indiana clinics and other properties. The exact number of medical records found hasn't been disclosed.\n\nKlopfer was believed to be Indiana's most prolific abortion doctor, and Hill said Friday that he is believed to have performed tens of thousands of abortions during his career.\n\nIndiana's Medical Licensing Board suspended Klopfer's medical license in 2016 after finding numerous violations, including a failure to ensure that qualified staff were present when patients received or recovered from medications given before and during abortions.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/WireAP_b69935cfb1a34e75ac381adf8c7463a4_16x9_992.jpg", "published_at": "2019-10-11"}