{"pub": "news24", "url": "https://news24.com/SouthAfrica/Life/centurion-man-celebrates-40th-at-home-after-diving-accident-20191024", "downloaded_at": "2019-10-25 23:54:35.396758+00:00", "title": "Centurion man celebrates 40th at home after diving accident", "language": "en", "text": "“I just walked into my home. It’s the best feeling on Earth.”\n\nJohan Botha from Centurion, who broke his neck in a diving accident on 14 September, says he and his family are deeply grateful that he’s been able to return home after a successful surgery saved him from being paralysed.\n\nHe’ll soon be celebrating his 40th birthday at home.\n\nOn 14 October, surgeons at the Kalafong Hospital in Pretoria performed the operation. They had to get to Johan’s damaged vertebrae from the front – in other words, through his neck. They had to move his larynx out of the way, so it might be weeks before Johan’s voice has recovered.\n\nWe’re communicating via WhatsApp and a telephone call for which his wife, Anneke, is present.\n\n“It was a huge success, thank God. I spent two days in high care and was then moved to a general ward. I was discharged on Tuesday (22 October),” he tells YOU.\n\nHe’s still wearing a neck brace, is on three kinds of painkillers and still has a long rehabilitation process ahead of him. But compared to the days after the accident when he was in excruciating pain and the month spent in hospital waiting for surgery, he says, “I feel like a new person.”\n\nJohan, a facilities manager at a home for the disabled, previously told YOU how the accident happened. He and his family were at a holiday resort near Pretoria when he dove head-first into a murky swimming pool and hit his head against the bottom. The water was only a metre deep and he weighs 125kg, so he hit his head hard.\n\n\n\n\n\nHe broke a vertebra in his neck, and the impact ruptured one of the shock-absorbing cushions between his vertebrae. Other vertebrae lower down in his spine, as well as his sternum, were cracked. The damage caused dangerous swelling in his spine which led to pressure on his nerves.\n\nHe was on morphine for the excruciating pain in his shoulders and arms. His middle fingers were numb. Doctors were amazed that he’d walked into the emergency room of a private hospital and hadn’t been paralysed.\n\nAfter he was stabilised he was transported to Kalafong, a state hospital, where he waited a month for the surgery. It was a long month, he says, as he needed to be kept as still as possible and wore a neck and shoulder brace. “The smallest bump could paralyse me.”\n\nThe reason for the delay was a long waiting list and a shortage of space in the high-care unit. But Johan and Anneke have nothing but praise for the care he received at Kalafong.\n\n“They treated him very well and the high-care unit was awesome,” Anneke says. “He called me at 5am on the morning of the surgery and said I shouldn’t come then, ‘but please be here when I wake up’.” She says she counted down the hours in the waiting room.\n\n\n\n\n\nSurgeons repaired Johan’s vertebrae with synthetic bone, plates and screws to relieve the dangerous nerve pressure.\n\n“They were worried about whether the feeling and functioning of his limbs would be affected,” Anneke says. But when they checked afterwards there weren’t any problems.\n\n“He had to use a walking frame but he’s stable on his feet now, though sometimes he still gets dizzy and struggles to get up from the bed.”\n\nJohan has to go back to hospital on 5 November for a follow-up examination. If the doctors are satisfied, his rehabilitation will be planned.\n\nIt could take about six months before he’s completely healed. Because he’s the breadwinner of the family, this puts a strain on their finances.\n\nIn the meantime, he says, “I’m just so happy to be home with my wife and children. I can barely describe the feeling.”\n\n“Our focus now is on getting him healthy again,” Anneke adds.", "description": "“I just walked into my home. It’s the best feeling on Earth.”", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9515/c7fde663ee4c4848b442b8a14ec367af.jpg", "published_at": "2019-10-24"}