{"pub": "dailymail", "url": "https://dailymail.co.uk/money/mortgageshome/article-7500027/Overpay-mortgage-beat-rock-bottom-savings-rates.html", "downloaded_at": "2019-10-05 06:41:39.699758+00:00", "title": "Overpay your mortgage to beat rock bottom savings rates", "language": "en", "text": "With interest rates at rock bottom, families saving for their next step up the housing ladder can use their home as a piggy bank instead.\n\nSavings rates have been at low levels for more than five years since the Government offered the banks a cheap source of cash which meant they did not need to offer decent interest rates to attract savers’ deposits.\n\nBut overpaying your mortgage on a regular monthly basis could earn you a better return on your money than a paltry savings account.\n\nBalancing act: Overpaying your mortgage on a regular monthly basis could earn you a better return on your money than a paltry savings account\n\nA family saving £500 a month into top paying easy access account Marcus by Goldman Sachs can earn 1.45 per cent on their cash.\n\nAfter 12 months you would have £6,000 savings and earn £47 in interest. After two years you would have saved £12,000 and earned £180.88 in interest.\n\nIf, however, you overpaid your mortgage by £500 every month for 12 months, your equivalent saving in interest on the debt would be more than you could earn on the top paying instant access account.\n\nA borrower paying 2 per cent on a typical mortgage of £150,000 over 25 years would pay £635.78 a month, for example.\n\nIf you paid an extra £500 a month on to your mortgage debt, the loan would be reduced by a further £6,055, giving you a return of £55 on your £6,000 saving.\n\nAfter two years, you would have overpaid £12,000 on your mortgage, and reduced your debt by £12,232, giving you a return of £232.\n\nAnna Bowes, co-founder of Savings Champion, says: ‘It has never been more important to make your cash work as hard as possible.\n\n‘While saving into one of the best easy access accounts doesn’t appear to reap huge rewards, if you were to leave your money in a poor paying account with a High Street bank the outcome would be even more dire.’\n\nThe HSBC Flexible Saver, for example, is paying just 0.15 per cent before tax so you would earn £4.88 in interest over 12 months, and £13.88 over two years.\n\nDavid Hollingworth, of mortgage broker L&C, says: ‘Overpaying a mortgage can be very effective because of the higher rates of interest payable on a loan but your cash will not be easily accessible.\n\n‘In many cases it could require the borrower to remortgage in order to withdraw their savings if they are needed ahead of selling the property.\n\nIt’s important to keep some rainy day funds that are easy to access or you could consider an offset mortgage where the cash can be held in an attached savings account.’\n\nAn offset deal is a mortgage with an attached savings account. Any savings deposited in the account do not earn interest but are offset against the mortgage, lowering the amount of interest on your debt but still giving you easy access to your cash. Offset mortgage rates are typically higher than standard deals.\n\nIt is also important to check you will not incur any early repayment charges by overpaying your mortgage, says Mr Hollingworth.\n\nThese can be substantial if incurred, but most lenders offer some flexibility, typically allowing overpayments of up to 10 per cent of the outstanding balance each year.\n\nmoneymail@dailymail.co.uk", "description": "Rates have been low for more than five years since the Government offered the banks a cheap source of cash which meant they did not need to offer decent interest rates to attract savers' deposits.", "authors": ["Samantha Partington For The Daily Mail", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/09/24/19/18882806-0-image-a-5_1569348075101.jpg", "published_at": "2019-09-24"}