{"pub": "reuters", "url": "https://reuters.com/article/us-cuba-usa-amazon/amazon-sued-for-marketing-charcoal-produced-on-land-seized-by-cuba-in-1960s-idUSKBN1WB31J", "downloaded_at": "2019-09-26 23:47:25.312617+00:00", "title": "Amazon sued for marketing charcoal produced on land seized by Cuba in 1960s", "language": "en", "text": "HAVANA (Reuters) - A Florida resident is suing Amazon (AMZN.O) for marketing charcoal produced on land he says Cuba confiscated from his grandfather after the 1959 revolution, the latest in a recent slew of lawsuits regarding the island piling up in U.S. courts.\n\nFILE PHOTO: Marabu prepared to be burned at a traditional charcoal factory is pictured in Ciro Redondo, Cuba, February 9, 2017. REUTERS/Alexandre Meneghini/File Photo\n\nThe lawsuit was filed in Florida on Thursday, the day after another was filed accusing American Airlines (AAL.O) and the Latam Airlines Group (LTM.SN) of trafficking in stolen property for using Havana’s international airport.\n\nSuch lawsuits were allowed by U.S. President Donald Trump’s activation in May of a controversial provision of the 1996 Helms Burton Act that had been waived by every previous president due to opposition from the international community and fears it could create chaos in U.S. courts.\n\nSo-called Title III allows U.S. citizens, including Cuban Americans, to file lawsuits against both Cuban entities and foreign companies over property seized after 1959.\n\nIn the lawsuit filed on Thursday, Daniel Gonzalez says he is the rightful owner of 2,030 acres of land in Cuba’s eastern Granma province that were nationalized in 1964.\n\nAuthorities gave his family only seven days to leave with just their personal belongings, he says.\n\n“The communist Cuban Government ... has not paid any compensation to Plaintiff for its seizure,” the filing reads.\n\nGonzalez claims Amazon promoted the sale of Marabu charcoal produced on that property, meaning it was trafficking in stolen property. Amazon declined to comment because it is an active lawsuit.\n\nGonzalez is also suing Florida-based Fogo Charcoal for importing the charcoal.\n\n“Will the next defendant be Crowley Liner Services, which transported the charcoal from Cuba to the United States? FedEx that delivered some of the charcoal?” asked John Kavulich, president of the U.S.-Cuba Trade and Economic Council, underscoring how many companies could potentially be sued under Title III.\n\nThe U.S. State Department has said Title III could produce up to 200,000 claims reaching a value in the tens of billions of dollars given the scale of expropriation after the Cuban revolution and of exile to the United States.\n\nThe Cuba government, as well as traditional U.S. allies the European Union and Canada, say it violates international law.\n\nSo far, around 11 lawsuits have been filed under Title III against 19 defendants, 14 of which are foreign firms doing business with Cuba directly or indirectly, according to Kavulich.\n\nThe latter include U.S. cruise lines Royal Caribbean (RCL.N), Norwegian Cruise (NCLH.N) and Carnival Corp (CCL.N), U.S. travel website operator Expedia Group Inc (EXPE.O) and Spanish hotel operator Melia Hotels International (MEL.MC).\n\nFive of the defendants are Cuban companies.\n\nFive of the lawsuits are by multiple plaintiffs seeking class action, Kavulich said. In the largest, nearly 40 plaintiffs are suing Melia for “trafficking” in properties they say rightfully belong to them.\n\nIt remains unclear how these lawsuits will fare in the courts, given the lack of precedent.\n\nMoreover, it is doubtful how plaintiffs could collect if they win against foreign firms, given many countries have implemented laws blocking the law’s implementation.\n\nBut the lawsuits are worsening Cuba’s already-weak business climate.\n\nThe Trump administration activated the long-dormant Title III as part of a campaign to increase pressure on Cuba to reform and drop its support of leftist Venezuelan President Nicolas Maduro.\n\nSome analysts say the Trump administration is also seeking to win over the influential Cuban-American community in the swing state of Florida ahead of the November 2020 presidential election.", "description": "A Florida resident is suing Amazon for marketing charcoal produced on land he says Cuba confiscated from his grandfather after the 1959 revolution, the latest in a recent slew of lawsuits regarding the island piling up in U.S. courts.", "authors": ["Sarah Marsh", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190926&t=2&i=1434328366&w=1200&r=LYNXMPEF8P244", "published_at": "2019-09-26"}