{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7554777/Woman-pleads-guilty-impersonating-missing-toddler-Katrice-Lee-vanished-Germany-1981.html", "downloaded_at": "2019-10-09 19:14:49.531322+00:00", "title": "Woman pleads guilty to impersonating missing toddler Katrice Lee who vanished in Germany in 1981", "language": "en", "text": "A woman has pleaded guilty to a malicious communications offence after impersonating missing Hartlepool toddler Katrice Lee online.\n\nHeidi Robinson, 40, (pictured) appeared at Wirral Magistrates' Court on Wednesday and admitted posing as Katrice, who vanished on her second birthday on November 28, 1981, on the outskirts of Paderborn in Germany, near the British military base where her father Richard, 69, was stationed\n\nHeidi Robinson, 40, appeared at Wirral Magistrates' Court on Wednesday and admitted posing as Katrice, who vanished on her second birthday on November 28, 1981, on the outskirts of Paderborn in Germany, near the British military base where her father Richard, now 69, was stationed.\n\nRobinson, who had her blonde hair in a side ponytail and wore a black top and black trousers, pleaded guilty to using a public communications network to send a message that was grossly offensive, indecent or menacing on November 3 last year.\n\nThe case was adjourned until October 30 for a pre-sentence report to be prepared. District Judge Nicholas Sanders said the report should include information on the defendant's mental health.\n\nThe judge said: 'Clearly at the time you were not very well but, on the other hand, what you have now admitted to also caused some very real distress to people in this matter.'\n\nRobinson from Moreton, was given unconditional bail.\n\nKatrice's father Richard Lee, a retired sergeant major, from Hartlepool, revealed in March that someone had been impersonating his daughter on social media and a woman would appear in court.\n\nMr Lee told MailOnline on Wednesday, following Robinson's guilty plea, that he will be there at sentencing to 'look her in the eye.'\n\nKatrice (pictured) disappeared during a trip to buy food for her birthday party from a NAAFI store on an army base in Paderborn, Germany, where Richard had been deployed with his family\n\n'I've always believed Katrice was abducted. I've always believed she is out there,' dad Richard said. (Katrice (left) is pictured with her mother Sharon, dad Richard (right) and elder sister Natasha)\n\nKatrice disappeared during a trip to buy food for her birthday party from a NAAFI store on an army base in Paderborn, Germany, where Richard had been deployed with his family.\n\nMr Lee has expressed anger and dismay at the way the Royal Military Police (RMP) dealt with Katrice's disappearance.\n\nThe RMP would only treat Katrice's disappearance as a missing person inquiry.\n\nThey failed to close borders and it was weeks before they even interviewed staff at the supermarket where Katrice vanished in the few seconds it took her mother Sharon to fetch some crisps.\n\nNor did they notify hospitals of an eye condition Katrice had that would have helped to identify the little girl.\n\nRichard Lee (pictured holding a photo of his daughter) has expressed anger and dismay at the way the Royal Military Police (RMP) in Germany dealt with Katrice's disappearance\n\nIn 2012, the Ministry of Defence apologised for its 'flawed investigations' and a review team was appointed to reassess the case, but Richard believes the RMP has done little to redeem itself since.\n\nHe claims that in May last year, after police excavated a German riverbank close to where Katrice was last seen, the realisation that bones they uncovered belonged not to his daughter but to a horse was broken on social media before police told him.\n\n'They informed Instagram, Facebook and Twitter that it wasn't Katrice but they hadn't informed the family,' he says. 'This is why I feel angry,' he added.\n\n'I've always believed Katrice was abducted. I've always believed she is out there,' he said.\n\nIn September, military police arrested a man in connection with her disappearance and began searching a terraced house in Swindon, Wiltshire. The man was later released without charge.\n\nThe case of Heidi Robinson was adjourned until October 30 for a pre-sentence report to be prepared. District Judge Nicholas Sanders said the report should include information on the defendant's mental health. (Richard Lee (C), the father of missing toddler Katrice Lee and Richard O'Leary (L), Senior Investigating Officer at Royal Military Police arrives for a press conference near the Benteler Arena in Paderborn, Germany, 03 May 2018)\n\nMr Lee said he wasn't surprised that the man had been released without charge.\n\nHe told MailOnline: 'I have learnt over the years never to get my hopes up. It never gets easier though, when developments like this occur you can't help but hope it will lead to some answers.\n\n'We must make no assumptions about the person who was arrested, everyone is innocent until proven guilty and we must all abide by that.\n\n'I have heard from the RMP yet but I'm anticipating a call soon. I'll wait and hope to hear that there has been some progress in this case but I can't help but feel they are still trying to rectify mistakes made back in 1981.'\n\nThis picture shows an age progression image of Katrice showing how she might have looked in recent years\n\nKatrice's mother Sharon, a 66-year-old administration worker — divorced from Richard in 1991 but united with her ex-husband in their desire for answers — said that she was 'very happy with the investigation team from the RMP this time around'.\n\nSpeaking from her home in Gosport, Hampshire, she added: 'I want the police to carry on their investigation and then, when the time is right, to tell me why this arrest was made. I don't want this arrest and search to be the end of it.'\n\nThe Mail revealed in September that the man arrested was a 74-year-old former soldier who served at the same base as Mr Lee.\n\nThe ex-serviceman is only the second person to be arrested since Katrice disappeared.", "description": "Heidi Robinson appeared at Wirral Magistrates' Court and admitted posing as Katrice, who vanished on her second birthday on November 28, 1981, on the outskirts of Paderborn in Germany.", "authors": ["Chantalle Edmunds For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/16/19496816-0-image-a-2_1570633689191.jpg", "published_at": "2019-10-09"}