{"pub": "cnn", "url": "https://cnn.com/2019/07/13/motorsport/charles-leclerc-ferrari-british-gp-formula-one-spt-intl/index.html", "downloaded_at": "2019-09-04 00:32:58.823509+00:00", "title": "Ferrari youngster Charles Leclerc dreams of 'becoming world champion'", "language": "en", "published_at": "2019-07-13", "text": "Competing in his debut season for Ferrari, the 21-year-old has now out-qualified his far more illustrious teammate, four-time world champion Sebastian Vettel, for the third consecutive race following his third place on the grid at the British Grand Prix on Saturday.\n\nGiven the history and weight of expectation that comes with wearing the famous red of The Prancing Horse, many have remarked at how Leclerc has taken it all in his stride.\n\nEven in the face of bitter disappointment, the Monegasque driver rarely seems fazed.\n\nTwice he has agonizingly missed out on a maiden grand prix win; once in Bahrain when engine failure robbed him of a straightforward victory and again in Austria when Max Verstappen muscled past him with just one lap remaining.\n\nIn his mind, it's just all part of a longer process that has his ultimate goal at the end.\n\n\"Becoming a world champion,\" Leclerc says matter-of-factly. \"This is a dream since I was child, as it was to come into Formula One,\" he told CNN.\n\n\"But now that I'm here, it's of course being a world champion but the road is still long.\n\nCharles Leclerc has impressed in his first season as a Ferrari driver.\n\n\"I don't put any pressure on myself (to get a first win). I definitely work as hard as I possibly can to get it as quickly as possible but to tell you when exactly, I don't know.\n\n\"But one thing is for sure, I'm doing my absolute best to get it as quickly as possible.\"\n\n'Crazy' support\n\nLeclerc's meteoric rise through the ranks of Formula Three, Formula Two and into a coveted F1 seat with Sauber all happened by the time he was just 20.\n\nMany questioned whether after just one full season in Formula One -- albeit an impressive one -- he would be ready for the step up to Ferrari, who are under the added pressure of not having won a world title since 2007.\n\nLeclerc even admits he was taken by surprise at the sheer size of the operation at the headquarters in Maranello, Italy and just how adored the team are across the globe.\n\n\"You have a lot more support all over the world for Ferrari, this is quite crazy,\" he tells CNN. \"But also in terms of inside the team. How much they push in every single detail, how many people there are -- there are a lot!\n\nJUST WATCHED Daniel Ricciardo talks Silverstone and his F1 career Replay More Videos ... MUST WATCH Daniel Ricciardo talks Silverstone and his F1 career 04:07\n\n\"It is quite difficult (leaning all the names) but people are extremely nice. I've been welcomed very, very well here but it's difficult to work with so many people at the beginning.\"\n\n'A dream'\n\nLeclerc's step up to a team competing at the front of the grid has seen him renew on-track acquaintances with long-time rival Verstappen.\n\nBoth the same age, Leclerc and Verstappen have competed against each other throughout their childhoods and racing careers.\n\nTheir near-collision at the Austrian Grand Prix two weeks ago -- eventually deemed to be a racing incident after a three-hour deliberation -- is likely to be the first of many battles between these two potential future world champions.\n\n\"We've done all our karting years together,\" Leclerc recalls. \"Then in car racing, we took different paths but in karting we have been fighting each other for for many, many years. Now to find ourselves (fighting) again, in two top teams in Formula One, feels good.\n\n\"It's what I've always wanted to do. So to finally be here now and be fighting with the best drivers in the world is a dream that I had seen since I was a child.\"", "description": "With each passing grand prix, Charles Leclerc's stock continues to rise.", "authors": ["Matias Grez", "Amanda Davies"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190713140740-charcles-leclerc-super-tease.jpg"}