{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/michigan-state-university-sexual-abuse-scandal-larry-nassar-a9093751.html", "downloaded_at": "2019-09-06 12:18:57.817738+00:00", "title": "Michigan State University fined record $4.5m over Larry Nassar sexual abuse scandal", "language": "en", "text": "Michigan State University has been ordered to pay a $4.5m fine for failing to protect students from sexual abuse, education secretary Betsy DeVos has announced.\n\nThe fine sets a record as the largest to be paid under the Clery Act, a federal law that requires colleges to report all campus crimes. But it’s small compared to the university’s $500m civil settlement with young women sexually abused by Larry Nassar, the school’s gymnastics team doctor.\n\nThe sum is part of a settlement with the education department, which is overseeing two investigations into the school’s handling of abuse allegations against Mr Nassar and William Strampel, a former dean.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“What happened at Michigan State University was abhorrent,” Ms DeVos said. “The crimes for which Larry Nassar and William Strampel have been convicted are disgusting and unimaginable. So too was the university’s response to their crimes.”\n\nLast year, Nassar was sentenced to up to 175 years in prison for abusing dozens of girls and young women under the guise of providing medical treatment.\n\nHe was also given a separate sentence of up to 125 years for the abuse and an additional 60-year federal prison term for child pornography.\n\nShape Created with Sketch. In Colombia, victims of sexual abuse speak out Show all 28 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. In Colombia, victims of sexual abuse speak out 1/28 Reuters 2/28 Reuters 3/28 Reuters 4/28 Reuters 5/28 Reuters 6/28 Reuters 7/28 Reuters 8/28 Reuters 9/28 Reuters 10/28 Reuters 11/28 Reuters 12/28 Reuters 13/28 Reuters 14/28 Reuters 15/28 Reuters 16/28 Reuters 17/28 Reuters 18/28 Reuters 19/28 Reuters 20/28 Reuters 21/28 Reuters 22/28 Reuters 23/28 Reuters 24/28 Reuters 25/28 Reuters 26/28 Reuters 27/28 Reuters 28/28 Reuters 1/28 Reuters 2/28 Reuters 3/28 Reuters 4/28 Reuters 5/28 Reuters 6/28 Reuters 7/28 Reuters 8/28 Reuters 9/28 Reuters 10/28 Reuters 11/28 Reuters 12/28 Reuters 13/28 Reuters 14/28 Reuters 15/28 Reuters 16/28 Reuters 17/28 Reuters 18/28 Reuters 19/28 Reuters 20/28 Reuters 21/28 Reuters 22/28 Reuters 23/28 Reuters 24/28 Reuters 25/28 Reuters 26/28 Reuters 27/28 Reuters 28/28 Reuters\n\nAmong the violations to the Clery Act fund by the department’s federal student aid office were a failure to properly report incidents and disclose crime statistics, and a failure to notify campus security of complaints.\n\nMs DeVos had also ordered the education department’s office for civil rights to investigate whether the university met its obligations under Title IX, the federal civil rights law that requires schools to respond to and address sexual assaults on campus.\n\nThat investigation, separate from the first, found that the school failed to adequately respond to complaints against Nassar. Mr Strampel was also found to have to subjected students to a “sexually hostile” environment, and repeatedly failed to take action regarding the horrific situation.\n\n“Too many people in power knew about the behaviours and the complaints, and yet the predators continued on the payroll and abused even more students,” Ms DeVos told reporters.\n\nUnder the settlement, the university will also have create a system for complying with the Clery Act in the future, and offer support to those impacted by past sexual misconduct.", "description": "Michigan State University has been ordered to pay a $4.5m fine for failing to protect students from sexual abuse, education secretary Betsy DeVos has announced. The fine sets a record as the largest to be paid under the Clery Act, a federal law that requires colleges to report all campus crimes. But it’s small compared to the university’s $500m civil settlement with young", "authors": ["Lily Puckett"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/05/19/gettyimages-909801604.jpg", "published_at": "2019-09-05"}