{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/19/fans-of-chinas-own-loch-ness-monster-deflated-as-beast-turns-out-to-be-airbag", "downloaded_at": "2019-09-19 06:01:13.689040+00:00", "title": "Fans of China's own 'Loch Ness monster' deflated as beast turns out to be airbag", "language": "en", "text": "Pictures and video of a huge snake-like object in the Yangtze river viewed tens of millions of times online\n\nFans of China's own 'Loch Ness monster' deflated as beast turns out to be airbag\n\nA mysterious long, black object that was captured on video in the Yangtze river, and ended up captivating China with theories of its own Loch Ness monster, has been revealed as 20 metre-long industrial airbag.\n\nGrainy footage showing what appeared to be a long black sea creature slithering among the waves near the Three Gorges Dam in Hubei province circulated widely on Chinese social media. On Weibo, the video and a discussion thread about it has been viewed more than 32m times since it emerged on Friday. The video was covered by most major media, including the party paper Beijing Youth Daily and state broadcaster CCTV and China Daily.\n\nThe Paper 澎湃新闻 (@thepapercn) Water #MONSTERS in the Three Gorges? Netizens speculated that the giant mysterious creature might be a fish or a big snake. Experts believe it is unlike living animals, more like floating objects. https://t.co/CGGrfWzckI pic.twitter.com/RCdbaDAvv9\n\nSome believed the visible part was just the top of a much larger animal, which netizens soon called the “Three Gorges Water Monster”. Some theorised whether pollution in the river could have given rise to the creature. Scientists dismissed any idea of a new species, saying the creature was most likely a giant water snake.\n\nBut on Tuesday, workers at a ferry pier downstream from the reservoir fished out a long piece of tubing, likely discarded from a shipyard. Photos from local media also showed another large piece of black rubbish washed up on the shore near the alleged sighting.\n\nThe Yangtze, Asia’s longest largest river, stretching from the edge of Tibet to China’s east coast, is now one of the most polluted as a result of industrial growth and overfishing. Environmental advocates believe those effects have been compounded by the construction of the Three Gorges Dam, completed in 2012, the world’s largest hydropower project.\n\nAn estimated one third of fish species in the river are endangered and the baiji dolphin, believed to have lived in Yangtze for more than 20 million years, has become extinct.\n\nWhile some observers lamented the end of the tale, and the poor video quality giving rise to theories of a sea monster, others said local authorities should maintain the mystery.\n\nOne said: “Don’t take it out of the water. Seal the area, turn it into a tourist attraction and open it up to the world.”\n\n“Disappointed. This is a cruel blow to human imagination and the desire to explore,” another said.", "description": "Pictures and video of a huge snake-like object in the Yangtze river viewed tens of millions of times online", "authors": ["Lily Kuo"], "top_image": "https://i.guim.co.uk/img/media/6ca3b384a147061915f3af78fa0721b4192dd908/0_54_3826_2297/master/3826.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a978fa4ca29d3a480d291889a54749d5", "published_at": "2019-09-19"}