{"pub": "investing.com", "url": "https://investing.com/news/politics/damning-facts-will-help-sell-impeachment-probe-to-divided-voters-at-home-democrats-say-1988280", "downloaded_at": "2019-09-28 12:08:26.516974+00:00", "title": "'Damning' facts will help sell impeachment probe to divided voters at home, Democrats say", "language": "en", "text": "© Reuters. Demonstrators hold protest signs as part of a demonstration in support of impeachment hearings in New York\n\nBy Susan Cornwell\n\nWASHINGTON (Reuters) - Some moderate Democratic lawmakers who a week ago had little interest in talking about an impeachment inquiry against President Donald Trump say they are now optimistic they can sell it to voters at home during a recess of the U.S. Congress over the next two weeks.\n\nRepresentative Susan Wild was among a number of Democrats from highly competitive \"swing\" seats in the House of Representatives who changed her mind to back an impeachment probe against Trump. She expects to hear about it at a town hall meeting next week in Allentown, Pennsylvania.\n\nWild says her district is about equally divided between Democrats and Republicans, including Trump voters. But she doesn't appear worried.\n\n\"I don't think I have to convince them. I think the facts will convince them,\" Wild told Reuters on Friday. Her office email and phone calls have been running 11-to-one in favor of an impeachment inquiry, a \"marked contrast to the kind of communications that we've gotten the last few months from our constituents,\" she said.\n\nHouse Speaker Nancy Pelosi announced a formal impeachment inquiry against Trump on Tuesday. She had resisted demands for such a probe for months, but reversed course after reports that Trump pressured Ukrainian President Volodymyr Zelenskiy in a July 25 telephone call to investigate his political rival Joe Biden and his son Hunter, who did work for a Ukraine gas company.\n\nWild had previously tried to stay quiet about impeachment, even as liberal activists pressured her. Now her doubts have evaporated.\n\n\"The initial summary of the phone call was damning,\" she said. But a whistleblower complaint about the call released this week was \"horrifying\" and \"put me over the line to say this is not a qualified call for an impeachment inquiry. We're there.\"\n\nDemocratic Representative Dean Phillips, who ousted a Republican from a suburban seat in Minnesota last year and announced support for an impeachment probe on Tuesday, also knows he will have to explain his decision to voters in the coming days.\n\n\"First I'm going to be listening, and (then) explain the process, and why principles have to take precedence over party or anything else right now,\" Phillips told Reuters.\n\nSome vulnerable Democrats from so-called \"frontline\" congressional districts sought guidance from the party leadership on talking about impeachment back home. A group met Pelosi and other leaders on Thursday evening to talk about the impeachment process, including how to sell it to voters in their districts, a senior Democratic aide said.\n\nHelp came in the form of talking points that one prominent Democrat, Representative David Cicilline, was distributing to members leaving for the break on Friday.\n\nPrompts included: \"The president has engaged in serious wrongdoing, betrayed his oath of office, and undermined our national security,\" and \"Trump abused the office of the president by pressuring a foreign government to target a political opponent ....(and) tried to cover it up.\"\n\nTrump denies pressuring Ukraine, and many Republicans argue that the known facts don't rise to the level of impeachable offenses.\n\nRepublican Representative Greg Walden said on Wednesday that the phone call to Zelenskiy \"wasn't President Trump's finest moment\" but does not constitute \"high crimes and misdemeanors,\" the terminology the Constitution uses for impeachable offenses.", "description": "'Damning' facts will help sell impeachment probe to divided voters at home, Democrats say", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8R022_L.jpg", "published_at": "2019-09-28"}