{"pub": "investing.com", "url": "https://investing.com/equities/bolsa-mexicana-de-valores-a-earnings", "downloaded_at": "2019-10-15 04:28:08.151030+00:00", "title": "Bolsa Mexicana De Valores Earnings", "language": "en", "text": "Bolsa Mexicana De Valores SAB De CV (BOLSAA) Real-time derived Symbol Exchange Currency BOLSAA Derived MXN Real-time BOLSAA Mexico MXN Delayed BC51 Stuttgart EUR Delayed BC51 Berlin EUR Delayed Add to/Remove from a Portfolio Add to Portfolio\n\n36.640 -0.340 -0.92% 14/10 - Closed. Currency in MXN Disclaimer ) - Closed. Currency in Type: Equity Market: Mexico ISIN: MX01BM1B0000 Prev. Close: 36.640\n\nOpen: 36.980\n\nDay's Range: 36.590 - 37.180 START TRADING NOW | AD |\n\nBolsa Mexicana De Valores 36.640 -0.340 -0.92% START TRADING NOW | AD |\n\nBOLSAA Earnings\n\nLatest Release Oct 15, 2019 EPS / Forecast -- / 0.6 Revenue / Forecast -- / 935.2M\n\nRevenue EPS Forecast\n\nRelease Date Period End EPS / Forecast Revenue / Forecast Oct 15, 2019 09/2019 -- / 0.6 -- / 935.2M Jul 16, 2019 06/2019 0.56 / 0.56 884M / 883.91M Apr 23, 2019 03/2019 0.55 / 0.55 845.45M / 845.23M Feb 19, 2019 12/2018 0.6 / 0.6 916.14M / 916M Oct 16, 2018 09/2018 0.56 / 0.56 871.91M / 871.91M Jul 17, 2018 06/2018 0.62 / 0.62 918M / 918M\n\nYour ability to comment is currently suspended due to negative user reports. Your status will be reviewed by our moderators. Please wait a minute before you try to comment again.\n\nDisclaimer: Fusion Media would like to remind you that the data contained in this website is not necessarily real-time nor accurate. All CFDs (stocks, indexes, futures), cryptocurrencies, and Forex prices are not provided by exchanges but rather by market makers, and so prices may not be accurate and may differ from the actual market price, meaning prices are indicative and not appropriate for trading purposes. Therefore Fusion Media doesn't bear any responsibility for any trading losses you might incur as a result of using this data. Fusion Media or anyone involved with Fusion Media will not accept any liability for loss or damage as a result of reliance on the information including data, quotes, charts and buy/sell signals contained within this website. Please be fully informed regarding the risks and costs associated with trading the financial markets, it is one of the riskiest investment forms possible.", "description": "Get the latest Bolsa Mexicana De Valores earnings report, revenues as well as upcoming BOLSAA earnings dates, historical financial reports, news, analysis & more.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investing_300X300.png", "published_at": "2019-10-15"}