{"pub": "breitbart", "url": "https://breitbart.com/news/hard-rock-hotel-collapses-in-new-orleans-1-dead-2-missing", "downloaded_at": "2019-10-13 03:50:32.443515+00:00", "title": "Hard Rock Hotel collapses in New Orleans; 1 dead, 2 missing", "language": "en", "text": "Oct. 12 (UPI) — A hotel under construction in downtown New Orleans partially collapsed Saturday morning, killing one person and leaving two missing, local authorities said.\n\nAuthorities said there were multiple injuries with 18 people transported to area hospitals in stable condition. One injured person refused medical treatment.\n\nAt 7 p.m., officials said they were halting search efforts for the night.\n\nOriginally three people were missing but that person has been accounted for, city emergency officials said during an afternoon conference near the site.\n\nAnthony Magrette of King Company, a construction company in Louisiana, was among the missing.\n\n“I don’t know where my husband is,” Nova Espinoza said. “Nobody from his company has seen him. They can’t find where he is.”\n\nNew Orleans Fire Department Superintendent Tim Connell said during a news conference the upper six to eight floors of the planned Hard Rock Hotel collapsed and more “collapse is still possible” since “the building is unstable.”\n\nFlorida-based Hard Rock International unveiled plans in February 2018 for the 18-story hotel with 350 rooms for hotel guests along with 62 one- and two-bedroom units for purchase.\n\n“We’re praying for the individuals who remain unaccounted for,” Louisiana Gov. John Bel Edwards said. “This remains a very fluid scene, and we have to allow the first responders to continue to do their work uninterrupted.”\n\nAbout 45 people were working inside the building, according to one worker.’\n\n“I was on the 18th floor when it happened,” he told NOLA.com. “We ran to the center of the building to escape.”", "description": "Oct. 12 (UPI) — A hotel under construction in downtown New Orleans partially collapsed Saturday morning, killing one person and leaving two missing,", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-12"}