{"pub": "cnbc", "url": "https://cnbc.com/2019/06/27/free-cash-handouts-what-is-universal-basic-income-or-ubi.html", "downloaded_at": "2019-09-06 12:12:07.884178+00:00", "title": "Why everyone is talking about free cash handouts—an explainer on universal basic income", "language": "en", "text": "The idea of free cash for all may seem too good to be true, but a growing number of high-profile people — from Democratic presidential hopeful Andrew Yang to tech billionaire Elon Musk — say universal basic income, or UBI, may become a reality. And the rest of America is becoming more interested, too: Google searches for the term \"universal basic income\" have multiplied as much as 50 times between 2015 and 2019.\n\nSo what is UBI? Here's a primer.\n\nWhat is UBI?\n\nUniversal basic income refers to regular cash payments made to a given population (such as adult U.S. citizens, for example) with minimal or no requirements for receiving the money, in order to increase people's income, according to the International Monetary Fund. Beyond that, however, there is often disagreement about what constitutes UBI. \"[T]here is no established common understanding\" of UBI, according to economists Maura Francese and Delphine Prady. And therefore, \"very different income-support programs are often labeled 'universal basic income,' even when they have little in common or do not aim at the same goal.\" However, common variances on the basic tenet include whether cash handouts replace or supplement existing social welfare programs, whether payments are distributed to a household or individual, who foots the bill and how often the payments are distributed.\n\nWhy is everybody talking about UBI now?\n\nThere are two main conditions fueling the emergence of UBI as a serious topic over the last few years. The first is fears that automation will put millions of people out of work, leaving them with little or no income. \"There is a pretty good chance we end up with a universal basic income, or something like that, due to automation,\" SpaceX and Tesla boss Elon Musk told CNBC in 2016. \"Yeah, I am not sure what else one would do. I think that is what would happen.\"\n\nThis is Andrew Yang's thinking too. Yang, a 44-year-old entrepreneur running for the Democratic presidential nomination, has made UBI the foundation of his 2020 campaign platform. His plan, which he calls the \"Freedom Dividend,\" is for the federal government to give all U.S. citizens ages 18 and over $1,000 per month. Fellow Democratic hopeful Sen. Bernie Sanders said in 2015 he is \"absolutely sympathetic to that approach,\" and former Vice President Joe Biden said in 2018 he would consider a UBI as a last resort. Republicans are more likely to be against UBI. Americans, however, are split on whether they would support universal basic income as a solution for those whose jobs are replaced by robots: 48% support and 52% do not, according to a February 2018 Gallup survey. There is also debate as to whether robots will actually take people's jobs: A 2017 McKinsey & Company report estimates as much as one-third of the U.S. workforce may need to learn new skills and find a new job because of automation by 2030, while a 2017 report from Gartner says artificial intelligence will create more jobs than it eliminates. The other major situation motivating the current conversation about UBI is America's extreme and growing wealth inequality. Some see cash payments as a way to help even the playing field.\n\nAndrew Yang in his campaign headquarters in February 2019. CNBC Make It\n\nFacebook founder Mark Zuckerberg, for one, falls into this camp. \"Every generation expands its definition of equality. Now it's time for our generation to define a new social contract .... We should explore ideas like universal basic income to make sure everyone has a cushion to try new ideas,\" Zuckerberg said in his 2017 Harvard commencement speech. After all, he said, it was because he had a financial safety net from his dentist father that he felt free to try something as risky as turning Facebook into a business. The wave of interest in UBI is also inspiring a smattering of experiments and pilot studies with UBI in the U.S. The once-bankrupt town of Stockton, California, initiated an 18-month experiment in February, distributing monthly checks for $500 to 130 randomly selected Stockton residents to mitigate poverty and inequality. Michael Tubbs, the town's now 28-year-old mayor, decided on the program after reading Dr. Martin Luther King Jr.'s 1967 book, \"Where Do We Go From Here: Chaos or Community?\" In the book, King writes: \"... the solution to poverty is to abolish it directly by a now widely discussed measure: the guaranteed income.\" And one of the country's top start-up accelerators' research arm, Y Combinator Research, has run small-scale tests in Oakland, California, to test and improve procedures ahead of a larger-scale program. In that program, 1,000 randomly selected individuals across two as-yet-undisclosed states will receive $1,000 per month for three years to study the impact of the cash transfer.\n\nWho pays?\n\nThat depends on who you talk to. Hillary Clinton seriously considered running her 2016 campaign for president on a platform built with UBI. But she couldn't figure out a reasonable way to pay for it. \"Unfortunately, we couldn't make the numbers work,\" Clinton wrote in her campaign memoir, \"What Happened.\" \"To provide a meaningful dividend each year to every citizen, you'd have to raise enormous sums of money, and that would either mean a lot of new taxes or cannibalizing other important programs. We decided it was exciting but not realistic....\" Others believe there is a solution. Facebook co-founder Chris Hughes, a UBI supporter, says a guaranteed basic income should be paid for by the wealthiest 1% of society, according to his book, \"Fair Shot: Rethinking Inequality and How We Earn.\" And Yang proposes to pay for UBI by implementing a value-added tax, or VAT, of 10% on goods and services a company produces. \"Because our economy is so vast, this would generate between $700 and $800 billion in revenue,\" he said on Reddit in 2018. Indeed, Eric Toder of the Washington, D.C.-based Tax Policy Center told CNBC Make It in 2018 that such a VAT in the United States could raise anywhere from $500 billion to $1 trillion, depending on how broadly the tax is applied. One thing is certain, however: It would cost a lot. \"A truly universal UBI would be enormously expensive,\" say Hilary Hoynes and Jesse Rothstein, economics and public policy professors at the University of California at Berkeley. \"The kinds of UBIs often discussed would cost nearly double current total spending on the 'big three' programs (Social Security, Medicare, and Medicaid),\" according to their working paper published by the National Bureau of Economic Research in February. They also say these social welfare programs would still be needed even with UBI.\n\nWill it work?\n\nCritics say universal basic income is too expensive, that it gives people incentive to be unproductive, that it's bad for people's self-worth and that there are more efficient ways to spend government money to help those who can't support themselves. \"Just giving $1,000 to everybody in itself is not the right solution\" if helping those who need it most in society is the goal, Thomas Piketty, an economist and professor at the Paris School of Economics, told CNBC Make It at Columbia University in March. And Ian Goldin, a professor of globalization and development at the University of Oxford, argued in the Financial Times that \"individuals gain not only income, but meaning, status, skills, networks and friendships through work. Delinking income and work, while rewarding people for staying at home, is what lies behind social decay.\" Nobel laureate in economics Joseph Stiglitz told CNBC in April, \"I think there's a certain dignity from work. Some of my younger students say, 'Oh there could be a lot of dignity from meditation and from other ways of spending time.' But I think for most people there will be a real desire to work,\" Stiglitz says. As far as the data goes, it's mixed. Some of the news seems positive. For example, left-leaning think tank Roosevelt Institute says a $1,000-a-month payment would actually grow the economy by $2.5 trillion by 2025 if it was paid for by increasing the federal deficit; however, increasing taxes would have no net benefit to the economy. And some small UBI use cases seem to show that cash handouts help those who receive them in some ways — alleviating emotional stress and helping individuals pay their bills. However, it is not a silver bullet for unemployment.\n\nFor instance, preliminary results of a two-year experiment in Finland that gave 2,000 unemployed people 560 euros ($638) a month show that, for the first year of the study, 2017, those getting cash payments reported improved well-being. However, there was no effect on employment status. Results for employment status in 2018, the second year of the study, are not yet available. A basic income pilot program in Ontario, Canada, launched in April 2017 with a plan to distribute varying monthly payments to more than 4,000 people living on incomes less than $34,000 Canadian (or about $25,925 U.S.) for up to three years via tax credits. In July, the government of Ontario announced it would shut down the program (due to the cost and a change in government leadership), and in August, it said that payments would run through March. But the advocacy group Basic Income Canada Network got some feedback. Responses from 424 participants indicated the payments gave them increased personal agency, relief from anxiety, increased social connection and the ability to invest in things like education and job-hunting. Then there are the residents of Alaska, who receive a yearly dividend from the Alaska Permanent Fund, which was launched in 1982 to pass along oil profits to future generations. In 2018, the payment was $1,600. Alaskans reportedly use the money for everything from heating oil and clothing to medical emergencies, travel and student loan payments. And a 2018 study of Alaskans suggests that \"a universal and permanent cash transfer does not significantly decrease aggregate employment.\"", "description": "The idea of universal basic income has been steadily moving from niche to mainstream with big names from Elon Musk to presidential candidate Andrew Yang stoking the conversation. Here's a look at what it means and whether it might ever become reality in the United States.", "authors": ["Catherine Clifford"], "top_image": "https://image.cnbcfm.com/api/v1/image/105991548-1561646968728gettyimages-1157890006.jpeg?v=1567512682", "published_at": "2019-06-27"}