{"pub": "yahoo", "url": "https://finance.yahoo.com/news/p-500-weekly-price-forecast-172537016.html", "downloaded_at": "2019-10-12 00:26:43.757327+00:00", "title": "S&P 500 Weekly Price Forecast – Stock Markets Recover Again", "language": "en", "text": "The S&P 500 fell initially during the week, reaching down towards the 50 week EMA. The uptrend line is very much intact and therefore I think that buyers came in to pick up what they thought was cheap pricing, and now that the United States and China are talking it will come down to how that turns out in the short term, and possibly earnings season which starts next week. At this point, it looks as if we can break above the 3025 level, then the market is free to go much higher. However, if those talks break down, and we don’t know how that’s going to turn out quite yet, we will more than likely get a break down again. If we were to break down below the uptrend line, then the 2800 level comes into the picture, and that of course a break down below the 2800 level offers a potential move down to the 2600 level.\n\nWe are in an overall uptrend, but the most recent high was less impressive than the one before. Ultimately, earnings season will be what drives this market longer-term, but in the short term over the weekend we will get some type of announcement how the US/China trade talks when, so there is the possibility that we get some type of massive move in one direction or the other. The levels are pretty clear on this chart, so pay attention to them and trade accordingly. I suspect though, that there is more than likely a “by on the dips” mentality.\n\nThis article was originally posted on FX Empire\n\nMore From FXEMPIRE:", "description": "The S&P; 500 fell during a large portion of the week, but then turned around to recapture those losses and reach towards the top of the hammer from the previous week. That’s a bullish sign, but we also are at near all-time highs.", "authors": ["Christopher Lewis"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-11"}