{"pub": "metro", "url": "https://metro.co.uk/2019/10/06/latest-whatsapp-update-rumours-including-vanishing-messages-10871121", "downloaded_at": "2019-10-07 00:12:14.277128+00:00", "title": "What are the latest WhatsApp rumours and updates?", "language": "en", "text": "WhatsAppenin’ over at WhatsApp? (Picture: Getty Images)\n\nWhatsApp is looking to make a few adjustments.\n\nBack in February 2018, over one and a half billion people used the app, making it one of the most popular apps of all time.\n\nAnd we can only imagine that number has grown since then.\n\nSo what are WhatsApp working on to keep improving and growing?\n\nVanishing messages\n\nVanishing text – or for more of an oomph let’s call them self-destructing messages – are making their way to the app.\n\nAccording to information found in the Beta software by Twitter account WABetaInfo, it looks like you can send messages that will self-destruct after a certain time has passed, like how Snapchat works.\n\nWhatsApp’a newest features could have been inspired by other successful apps (Picture: Getty Images)\n\nWhatsApp looks set to name the feature ‘Disappearing Messages,’ which feels very ‘does-what-it-says-on-the-tin.’\n\nCan you get WhatsApp other devices?\n\nAdvertisement\n\nAdvertisement\n\nAccording to a report from BGR, WhatsApp has plans to become a multi-platform system that will enable users to use the same account across a number of devices – like how Apple’s iMessage works.\n\nThis will be a step further than the current WhatsApp web feature, which still requires you to have your phone on and connected.\n\nCan you get WhatsApp on the iPad?\n\nIf it starts to work across multiple devices, we might not be far off WhatsApp for an iPad or tablet.\n\nIf you send video clips or files to read over WhatsApp, the larger screen of an iPad could be much more useful.\n\nWhatsApp Dark Mode\n\nTwitter’s done it. Apple and Android have a setting for it. So now WhatsApp might be unveiling a dark mode to save your eyes from glaring white screens or bright colours.\n\nThe dark mode on Twitter switches the colour settings so the white background and pops of turquoise blue become darker blues against a black backdrop.\n\nWhatsApp currently has quite bright green and white colour palettes, so the dark mode might make it easier to check your messages first thing after waking up.\n\nHow to update WhatsApp to the latest version\n\nThese improvements and extra features haven’t officially launched yet, so there’s no need to rush and update your systems.\n\nBut if you want to check you’re using the latest version of the app, the steps are different depending on what phone you’re using.\n\nUpdating WhatsApp on an Android Go to the Play Store, then tap Menu (the three horizontal lines in the top-left corner of your screen). From there, select ‘My apps & games’, which will show you a list of pending updates for the applications installed on your phone. Tap ‘Update’ next to WhatsApp Messenger, and the latest version of the app will download and install onto your device. Or you can go to the Play Store and search for WhatsApp. Tap ‘Update’ under WhatsApp Messenger.\n\nAdvertisement\n\nAdvertisement\n\nUpdating WhatsApp on an iPhone Go to the App Store and tap on ‘Updates’. Tap ‘Update’ next to WhatsApp Messenger. Or you can go to the App Store and search for WhatsApp. Tap ‘Update’ next to WhatsApp Messenger.\n\nUpdating WhatsApp on a Windows 8.1 Go to the Store, then tap Menu (the three little dots). From there, select ‘my apps’, then WhatsApp, then ‘Update’. Alternatively, go to the Store and search for WhatsApp. Then tap WhatsApp and ‘Update’.\n\nUpdating WhatsApp on a Windows 10 Go to the Microsoft Store, then tap Menu (the three horizontal lines). From there, select ‘My Library’. Tap ‘Update’ next to WhatsApp. Alternatively, you can go to the Microsoft Store and search for WhatsApp. Then tap WhatsApp, then ‘Update’.\n\nMORE: The next gif you send on WhatsApp could cause a lot of pain and torment\n\nMORE: WhatsApp is working on an Instagram-style Boomerang feature", "description": "What are the latest rumours surrounding WhatsApp updates, new features and other changes?", "authors": ["Jack Slater"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1155294672_1570378342.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-06"}