{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/oct/29/why-are-men-so-desperate-to-think-domestic-violence-isnt-a-male-problem", "downloaded_at": "2019-10-29 01:16:27.191755+00:00", "title": "Why are men so desperate to think domestic violence isn’t a male problem? | Karen Williams", "language": "en", "text": "A recent report on domestic violence has been seized upon as “proof” that domestic violence is not a male problem.\n\nOne of the people leading the charge is Joe Hildebrand, who wrote a piece describing the report as an apparent “watershed moment”, and suggested that the commentary surrounding domestic violence is all part of a “the deadliest of lies” propagated by hysteria and outrage.\n\nThe “watershed” moment Joe is referring to is the release of latest Domestic Violence report from the Australian Institute of Criminology. Unfortunately, Joe’s ability to analyse the report in its context is marred by either his lack of experience and expertise in this topic or is just reflecting prevailing male attitudes when interpreting results of the report.\n\nAs a doctor who works in this field I feel compelled to correct the misinformation being disseminated by clarifying the report in greater detail.\n\nThe study itself immediately identifies that reporting rates of violence for women are only around 30%. In other words, 70 % of women who are abused do not report the abuse at all.\n\nThe study also states – very early on – that the data they have collated is almost exclusively police and court data. In essence, this paper is not representative of the majority of cases of domestic violence.\n\nHow Joe Hildebrand made the murder of a woman about his feelings | Van Badham Read more\n\nNevertheless, with respect to the population it does cover, Joe Hildebrand stated:\n\nThere was a massive concentration of domestic violence in disadvantaged and indigenous communities and that alcohol was also a driving factor.”\n\nKeeping in mind that this is mostly police data, we need to remember that police are much more likely to charge and incarcerate an Aboriginal person for all types of crimes.\n\nPolice are also more likely to do a blood alcohol level for an Indigenous person. So the data is skewed with a greater share of Indigenous perpetrators. It is well established that all forensic data demonstrates an over-representation of Indigenous people and this is unfortunately no exception.\n\nIn any event it is important to note that those working in the field of domestic violence are very well aware of the specific needs and increased vulnerability of our Aboriginal population and continue to advocate very strongly for improved accessibility and treatment for all Australians.\n\nPoverty was also raised as being the cause of domestic violence. When this is done my interpretation is that it is an attempt to “other” victims and offenders by suggesting it’s only an issue for those with socioeconomic disadvantage.\n\nWhile the dataset demonstrates greater numbers of police reports in poorer areas it also included the following:\n\nNon-physical forms of violence such as shouting, provoking arguments and controlling behaviours were found to be more common among offenders with higher levels of education and employment.”\n\nOffenders who self report coercive or controlling behaviours were more likely to have completed year 12 or above and to earn $100, 000 per annum or more”.\n\nThat changes things. A lot.\n\nIt’s an important distinction to make, because while this type of domestic violence is just as harmful, it does not result in a charge, let alone a conviction. Coercive control is not “illegal”. Therefore one will not obtain this data from police or court reports.\n\nMany victims of coercive control do not recognise the abuse while they are in the relationship, or if they do, they feel they should not report it because it isn’t “physical”.\n\nAll these elements culminate in the fact that wealthier, more educated perpetrators are more likely to get away with family and domestic abuse. It means that the dataset is skewed heavily toward perpetrators from lower socio-economic groups and thus, needs to be interpreted with caution.\n\nObscurely, the study Joe Hildebrand used to prove that “prevailing narrative that domestic violence is a male vs female issue” is a “deadly lie” reveals that men accounted for between 75 and 94% of all offenders. It also acknowledged that most of the female offenders were involved in bidirectional violence, a fancy word to state that they were victims too – and were violent in retaliation.\n\nFinally, and most importantly, men accounted for five out of every six domestic violence offences recorded by police.\n\nJoe Hildebrand is privileged to have a platform to speak about any topic regardless of experience or expertise.\n\nThere are many professionals in this area, professionals who work with perpetrators and victims, within the health system, legal system or as academics in criminology, it is a pity he did not enlist their assistance to avoid himself, spreading the deadliest of lies.\n\nThis issue does impact all men, from all walks of life. Not just the poverty stricken.", "description": "We should be past thinking family violence is a problem of poor and Indigenous people", "authors": ["Karen Williams"], "top_image": "https://i.guim.co.uk/img/media/8de0b51914ba4a4392d68918d35a2747b930b96a/0_46_4863_2917/master/4863.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=4862ab3bf068746253cc474901cd6532", "published_at": "2019-10-29"}