{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/analysis-no-one-is-watching-the-watchers-why-we-should-be-worried-20191020", "downloaded_at": "2019-10-20 06:55:52.884291+00:00", "title": "ANALYSIS: No one is watching the watchers - why we should be worried", "language": "en", "text": "The apartheid government used the country's security apparatus to crush dissent and entrench its brutal regime. With this in the forefront of their minds, the drafters of our Constitution set out to write safeguards into our law to protect South Africa from rogue intelligence services.\n\nFour paragraphs in chapter 11 of the Constitution set out, in idealistic terms so typical of our country's founding document, how the new democratic South Africa was to break with the past: \"National security must reflect the resolve of South Africans, as individuals and as a nation, to live as equals, to live in peace and harmony, to be free from fear and want and to seek a better life,\" reads section 11a.\n\nAnd later: \"National security must be pursued in compliance with the law, including international law. National security is subject to the authority of Parliament and the national executive. \"\n\nRead those last two sentences again, and it becomes clear that our State Security Agency (SSA) is playing fast and loose with its constitutional mandate.\n\nIn the first place, as News24 reported this week, State Security Minister Ayanda Dlodlo allegedly issued a direct instruction to the SSA's head of domestic intelligence, advocate Sam Muofhe, to intercept the communications of someone without prior authorisation of a judge. Muofhe refused, as News24 understands.\n\nThen, several acting appointments at the SSA were allowed to lapse, leaving the country essentially unsecured for three days.\n\nSecondly, the SSA is accountable to Parliament's joint standing committee on intelligence (JSCI). News24 also reported this week that that body had yet to start its work, four months into the sixth Parliament.\n\nSSA abused for political purposes\n\nIn May, a high level review panel into the SSA released a report which set out in grim detail how the security services in the country have been abused for political ends. The Constitution, laws and policies governing our intelligence agencies have been flagrantly flouted.\n\nA former senior intelligence services member with intimate knowledge of the inner workings of the SSA told News24 that there was no need for a minister, and that the Constitution does not envisage that appointment.\n\nHe said all ministers were necessarily political, and none were able to resist the temptation to act outside of their mandates to play politics.\n\nThe former spy said that there should be a national security adviser who is not a member of Cabinet who could report to the president on intelligence issues, and that the real intelligence work should be left to the directors-general.\n\nThis is what former president Nelson Mandela tried to do, he said, but subsequent administrations saw things differently.\n\n\"It doesn't matter who the minister is; they will not want to limit themselves to administrative matters. [President Cyril] Ramaphosa shouldn't have appointed a minister if he had read the Constitution properly.\n\n\"The intelligence agencies must not collect political intelligence. But intelligence on service delivery protests, for example, can never be apolitical - you'll want to understand the political forces at play.\n\n\"Why the hell are we still involved in political intelligence?\" he said.\n\nJakkie Cilliers, the former executive director at the Institute for Security Services (ISS), wrote in 1996, on the eve of the passing of the final Constitution, about the delicate balance between security and transparency being thrashed out during the negotiations of the 1990s: \"On a political level, the national intelligence structures should be non-partisan and should not promote or influence the activities of any political party.\n\n\"It should at all times attempt to reflect a reasonable balance between secrecy and transparency in the pursuance of its tasks. The conduct of the intelligence function should be reconciled with fundamental civil liberties, ethical norms and the democratic values contained in the Constitution and universally accepted.\"\n\nBut \"non-partisan\" is not the term used by the review panel to describe the SSA. In fact, under the leadership of top spy Thulani Dlomo, the SSA's special operations unit had used state resources to benefit former president Jacob Zuma and his allies, the panel found.\n\nUnit reported directly to Zuma\n\nNow Dlomo is missing, and has been for about eight months. The SSA is trying to find him so that his dismissal letter can be delivered. News24 also revealed last week that Dlomo's unit reported directly to Zuma, and that many of the agents who worked for him might still be active.\n\nThose insights were revealed in an interview with the Inspector General for Intelligence (IGI) in an interview with the Public Protector in another matter. The IGI is supposed to provide oversight of the SSA, but it does so in near-total secrecy and the scarce detail about its findings (that are made public) are also reported to the top-secret JSCI (which presently does not exist).\n\nThe SSA says it is taking steps to implement the panel's recommendations, which include splitting the SSA into separate and domestic and foreign intelligence agencies.\n\nBut the question remains: With little to no oversight over the intelligence services, and when the laws designed to protect citizens from the abuse of these services are ignored, who watches the watchers?\n\nAlmost universally, intelligence services claim that blanket secrecy is critical to their work. Until September, South Africa had been conducting bulk surveillance based on nothing more than fantasy.\n\nA High Court recently found that there was no law, whatsoever, granting our intelligence agencies the right to do this, but with no transparency around what our intelligence agencies do, they were doing it anyway.\n\nFamously, the US' gargantuan bulk interception programme was exposed by whistleblower Ed Snowden.\n\nFor years, the Barack Obama administration claimed that this surveillance and, crucially, the secrecy around it, had foiled countless terrorist plots. Not so, said evidence that emerged in the hearings that followed Snowden's revelations.\n\nSix years on, legislation has been passed to rein in the US' bulk interception programme, but critics say it is deeply problematic, still.\n\nWhat protections do citizens have?\n\nIn South Africa and abroad, the question remains: What protections do citizens have, if the intelligence services can act as they please?\n\nNews24 understands that the review panel was supposed to have had a second innings, where it would propose a new intelligence structure, but that has not happened.\n\nA deeper conversation about the role of intelligence in South Africa needs to be had if we are to hold true to our Constitutional values.\n\nOtherwise, the noble ideals in chapter 11 of the Constitution are nothing more than ideals; the starry-eyed musings of idealists in 1996, who envisioned a society where people are free to \"live as equals, to live in peace and harmony, to be free from fear and want and to seek a better life\".", "description": "A deeper conversation about the role of intelligence in South Africa needs to be had if we are to hold true to our Constitutional values.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7079/462efac95b074c4eac1fc52fae230280.jpg", "published_at": "2019-10-20"}