{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7630241/John-Bolton-warned-Rudy-Giuliani-obstacle-White-House-progress-Ukraine.html", "downloaded_at": "2019-10-30 23:30:32.809577+00:00", "title": "John Bolton warned that Rudy Giuliani was 'obstacle' to White House progress in Ukraine", "language": "en", "text": "John Bolton warned in June that Donald Trump's personal attorney Rudy Giuliani was an 'obstacle' to White House progress with the Ukraine, according to the opening statement of a career diplomat testifying in Wednesday's closed-door impeachment inquiry.\n\nChristopher Anderson, a State Department employee who was a special adviser on the Ukraine, will testify that Bolton cautioned in a June 13 White House meeting that Giuliani 'was a key voice with the President on Ukraine which could be an obstacle to increased White House engagement.'\n\nAnderson's opening statement, obtained by The Wall Street Journal, outlines staff efforts to shore up U.S.-Ukraine relations and support Volodymyr Zelensky's presidency in the wake of Ambassador Marie Yovanovitch's firing and a tweet from Giuliani sent shortly after Zelensky's election that claimed the new president was surrounded by enemies of President Trump.\n\nChristopher Anderson, a State Department employee arrives for a closed-door testimony on Capitol Hill\n\nCatherine Croft, a State Department adviser on Ukraine, arrives to testify on Capitol Hill Wednesday\n\nBolton's warning came before Trump's July 25 phone call with Zelensky that led to the impeachment inquiry, which is entering a new phase on Capitol Hill as lawmakers prepare to take the investigation public.\n\nAnderson will testify that in a June White House meeting, Bolton, who was national security adviser at the time, 'supported increased senior White House engagement' with the Ukraine in order to help them fight off Russian aggression.\n\nHe was at that meeting with his boss at the time, Ukraine special envoy Kurt Volker, who resigned that position and testified to lawmakers earlier this month.\n\nBolton also suggested Vice President Mike Pence travel to Toronto in early July to meet with Zelensky at the Ukraine Reform Conference hosted by the Canadian government. Pence did not make that trip.\n\nAdditionally, there was a follow-up meeting at the Department of Energy on June 18 where officials had a 'vague' discussion about how to deal with Giuliani's 'continued calls for a corruption investigation,' Anderson will testify.\n\nJohn Bolton warned in June that Donald Trump's personal attorney Rudy Giuliani was an 'obstacle' to White House progress with the Ukraine\n\nBolton warned Rudy Giuliani 'was a key voice with the President on Ukraine,' a State Department official will testify on Wednesday\n\nAnderson's last day advising Volker was July 12 - a few weeks before Trump and Zelensky's phone call.\n\nHe was replaced by Catherine Croft, who will also testify to lawmakers on Wednesday.\n\nCroft will testify she never had any interactions with Giuliani, according to her opening statement obtained by The Washington Post.\n\nShe was on the July 18 staff call where an OMB representative reported that acting White House Chief of Staff Mick Mulvaney put a hold on U.S. security assistance to Ukraine because of an 'order came at the direction of the President.'\n\nBut neither Croft nor Anderson were on the July 25 phone call with Trump and Zelensky.\n\nAdditionally Mark MacDougall, the lawyer who represents both of them, will tell lawmakers that neither of his clients are the whistleblower, CNN reported.\n\nHe will also say that Anderson and Croft will not answer questions about the whistleblower's identity.\n\nBoth career diplomats, in their testimony, offer an optimistic view of Ukraine under Zelensky that clashed with a more pessimistic view held by Trump.\n\nCroft, who was a staffer on the National Security Council in 2017, will testify how she heard President Trump describe the Ukraine as 'corrupt.'\n\n'I heard - directly and indirectly - President Trump describe Ukraine as a corrupt country,' she notes in her prepared testimony.\n\nCroft does offer additional details into the behind-the-scenes maneuvering that led to Ambassador Yovanovitch's firing.\n\nShe details in her opening statement a phone call she received from former Representative Bob Livingston, now a lobbyist.\n\nLivingston told her 'Ambassador Yovanovitch should be fired,' she will say.\n\n'He characterized Ambassador Yovanovitch as an “Obama holdover” and associated with George Soros. It was not clear to me at the time - or now - at whose direction or at whose expense Mr. Livingston was seeking the removal of Ambassador Yovanovitch. I documented these calls and told my boss, Fiona Hill, and George Kent, who was in Kyiv at the time. I am not aware of any action that was taken in response,' her opening statement reads.\n\nYovanovitch was recalled from the Ukraine earlier this year after Giuliani and his associates waged a campaign of unsubstantiated allegations that she was blocking the Ukraine from investigating Joe and Hunter Biden.\n\nShe testified to lawmakers earlier this month that President Trump dismissed her following a smear campaign and ordered her back to Washington on the next available aircraft.\n\nAnother official will testify on details behind the firing of former Ambassador Marie Yovanovitch (center), who testified on Capitol Hill earlier this month\n\nBoth Hill, the former deputy national security adviser, and Kent, a deputy secretary of state, have already testified to lawmakers.\n\nLivingston, after leaving Congress, formed the Livingston Group, an influential lobbying firms. The firm has represented clients in the Middle East and around the world, including political figures in Ukraine such as former prime minister Yulia Tymoshenko, The Washington Post reported.\n\nTymoshenko ran against Zelensky for Ukrainian president.\n\nLivingston tried to arrange meetings for Tymoshenko with President Trump, Bolton and Secretary of State Mike Pompeo, the Wall Street Journal reported.\n\nNeither Croft nor Anderson appears to add to the allegation Trump linked nearly $400 million in U.S. military aid to public declarations by Zelensky that he would investigate Joe Biden, his son Hunter Biden's tenure on the board of a Ukrainian energy company called Burisma, and a debunked conspiracy theory that Ukraine, and not Russia, meddled in the 2016 U.S. presidential election.\n\nTrump has maintained he did nothing wrong, there was no quid pro quo, and the call was he had with Zelensky was 'perfect.'\n\nBut the two government staffers do add to the narrative about the shadowy foreign policy team at work in U.S.-Ukraine relations.\n\nThey are rounding out a series of appearances this week by career staff.\n\nOn Thursday, Timothy Morrison, an NSC staff member who was on the July 25 phone call, is scheduled to appear.\n\nThursday is the same day Democrats will hold a vote in the full House on their impeachment resolution.", "description": "John Bolton warned in June that Donald Trump's personal attorney Rudy Giuliani was an 'obstacle' to White House progress with the Ukraine, a State Department official will testify to lawmakers.", "authors": ["Emily Goodin", "U.S. Politcal Reporter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/12/20374608-0-image-a-15_1572439115732.jpg", "published_at": "2019-10-30"}