{"pub": "yahoo", "url": "https://news.yahoo.com/oval-office-mystery-doctored-hurricane-222620095.html", "downloaded_at": "2019-09-05 10:30:24.233160+00:00", "title": "An Oval Office mystery: Who doctored the hurricane map?", "language": "en", "text": "Donald Trump’s affinity for Sharpies may finally leave a mark.\n\nA map that the president held up Wednesday indicating the possible paths of Hurricane Dorian carried an odd marking: Lumped onto the end of the “cone of uncertainty” — indicating areas the storm could hit — was a chunk of the state of Alabama.\n\nThe only problem: Alabama was never expected to see any outsize effects of the storm, which has changed course numerous times over the past week, keeping a significant portion of the southeastern part of the country and the Caribbean on edge.\n\nAccording to an advisory issued Friday by the National Hurricane Center, the city of Montgomery had the greatest possibility — an 11 percent chance — of seeing sustained wind speeds of at least 39 mph over the next five days.\n\nThe Sharpie-gate saga appears to have begun Sunday with — like so many controversies in the Trump White House — a post from the president on Twitter.\n\n“In addition to Florida - South Carolina, North Carolina, Georgia, and Alabama, will most likely be hit (much) harder than anticipated,” Trump warned. “Looking like one of the largest hurricanes ever. Already category 5. BE CAREFUL! GOD BLESS EVERYONE!”\n\nAlso that day, he mentioned Alabama in a briefing on Dorian. “It may get a little piece of a great place: It’s called Alabama,” Trump said. “And Alabama could even be in for at least some very strong winds and something more than that, it could be. This just came up, unfortunately.“\n\nBirmingham’s branch of the National Weather Service quickly rushed to correct the record, clarifying in a tweet 20 minutes after Trump's original that “Alabama will NOT see any impacts from #Dorian,” because the system would remain too far east.\n\nConfronted by reporters on Wednesday about the apparent Sharpie edit, the president employed a common dodge: “I don’t know,” he quickly told reporters three times.\n\nHe first insisted the White House would be issuing “a better map.”\n\n“I know that Alabama was in the original forecast. They thought it would get it, as a piece of it,” Trump said. “We have a better map than that which is going to be presented where we had many lines going directly, many models — each line being a model — and they were going directly through. And in all cases Alabama was hit, if not likely, in some cases pretty hard.”\n\n“It was a different route,” the president continued, adding falsely that “they actually gave that a 95 percent chance probability. It turned out that was not what happened. It made the right turn up the coast, but Alabama was hit very hard — was going to be hit very hard.”\n\nSharpie-gate may have run afoul of the law, which calls for either a fine, no more than 90 days in jail — or both — for “whoever knowingly issues or publishes any counterfeit weather forecast or warning of weather conditions falsely representing such forecast or warning to have been issued or published by the Weather Bureau, United States Signal Service, or other branch of the Government service.”\n\nTrump also defended his Twitter forecasting earlier in the week, decrying a report from ABC News White House correspondent Jon Karl and claiming that \"under certain original scenarios, it was in fact correct that Alabama could have received some 'hurt.'\"\n\nIn response to Sharpie-gate blowing up on social media Wednesday, the Trump campaign‘s rapid-response team pointed to a Facebook post Thursday by the National Weather Service in Birmingham, warning that \"it is too soon to say with much confidence if (or how much) Dorian\" would impact on the state.\n\nBut the modification took off, making Sharpie and Sharpiegate trend on Twitter, with users sharing their own Sharpie'd takes on the Trump presidency.\n\nTrump weighed in on the melee for the third time Wednesday with an evening tweet, posting a photo of what he said were early models of the storm's possible paths dated Aug. 28. \"As you can see, almost all models predicted it to go through Florida also hitting Georgia and Alabama,\" he said, referring to a handful of possible paths that showed the storm making landfall in the U.S. as far west as Louisiana.\n\n\"I accept the Fake News apologies!\" he added.", "description": "The perpetrator may have committed a crime with the suspicious Sharpie marking. “I don’t know,” the president said repeatedly when confronted.", "authors": ["Caitlin Oprysko"], "top_image": "https://s.yimg.com/uu/api/res/1.2/_eQSMuARMptQKuy1upzu5g--~B/aD03NzM7dz0xMTYwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/politico_453/e4b90dedb5a79be02c0eb6049e1c2998", "published_at": "2019-09-04"}