{"pub": "huffpost", "url": "https://huffpost.com/entry/mindy-kaling-the-office-michael-scott-2019-lilly-singh_n_5d80b2abe4b077dcbd6424b4", "downloaded_at": "2019-09-17 11:25:29.502993+00:00", "title": "Mindy Kaling Imagines What Michael Scott From 'The Office' Would Be Doing Now", "language": "en", "text": "Just what would Michael Scott be up to now, if the (fake) documentary crew of “The Office” was still following his every move?\n\nMindy Kaling — who starred in, directed and produced NBC’s hit comedy— predicted on Monday’s debut episode of Lilly Singh’s “A Little Late” show that Scott (played by Steve Carell) would probably still be trying to keep up with trends that he’s “far too old” for.\n\n“To me, seeing Michael Scott dab, because I feel like he would do it all the time. Can’t you picture him doing that? And also Michael Scott on Instagram and the thirsty comments he would leave on celebrities’ pages,” said Kaling. “Those to me are what like come to mind.”\n\nCheck out the interview here:\n\nKaling wrote the screenplay for and starred in the recent comedy-drama movie “Late Night” about a female late-night TV host, played by Emma Thompson, a fact she discussed with Singh.\n\nIn January, Kaling predicted where her own character from “The Office,” Kelly Kapoor, could be in 2019. “There’s not an insignificant part of me that thinks that Kelly might be in jail, a crime of passion,” she told Variety.\n\n“The character just kept getting a little bit more and more unhinged,” she noted. “I don’t want to say that she murdered Ryan, but like, I’m also not convinced that he’s still alive in the world of ‘The Office.’”", "description": "It involves Instagram. And dabbing.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d80ba293b00002efad5501e.jpeg?cache=i7ugeelr4s&ops=1778_1000", "published_at": "2019-09-17"}