{"pub": "marketwatch", "title": "Ex-Canadian leader said in now-deleted tweet she hopes Hurricane Dorian makes ‘direct hit’ on Trump’s Mar-a-Lago", "url": "https://marketwatch.com/story/ex-canadian-leader-says-she-hopes-hurricane-dorian-makes-direct-hit-on-trumps-mar-a-lago-2019-08-30?mod=hp_econ", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:09:00.085944+00:00", "text": "Getty Images President Donald Trump's Mar-a-Lago resort in West Palm Beach, Fla., photographed earlier this year.\n\nA former Canadian prime minister said in a now-deleted tweet that she hoped Hurricane Dorian makes a “direct hit” on one of Florida’s most famous properties: President Donald Trump’s Mar-a-Lago resort.\n\nKim Campbell, who was prime minister for less than a year in 1993, made the comment in a tweet on Wednesday. Friday, as Dorian strengthened and was said to pose a significant threat to Florida, Campbell apologized and said her comment was “intended as sarcasm — not a serious wish of harm.”\n\n‘I’m rooting for a direct hit on Mar a Lago!’ Kim Campbell\n\nReplying to angry comments about the original tweet, Campbell told one Twitter user, “sorry you don’t get snark.”\n\nBut she went on to use her account to criticize Trump on environmental policy, saying: “[Would] also help if he tackled climate change which is making hurricanes more destructive! Instead, he will remove limits on methane! Get a grip!”\n\nRead: Regulation rollback expected for climate-changing methane releases from oilfields.\n\nIn her tweet Friday Campbell said “Throwaway lines get a life of their own on Twitter.”\n\nI have deleted my tweet about the hurricane & Mar a Lago and sincerely apologize to all it offended. It was intended as sarcasm-not a serious wish of harm. Throwaway lines get a life of their own on Twitter. I shd know better. Mea culpa. — Kim Campbell (@AKimCampbell) August 30, 2019\n\nDorian has strengthened and slowed over warm Atlantic waters. Florida and the Bahamas are preparing for a potentially big hit as forecasters warn of deadly winds and storm surges, The Wall Street Journal reports.\n\nCampbell is a longtime Trump critic. The president canceled a planned visit to Poland to deal with the hurricane, which he said looked like it could be an “absolute monster” in a video message on Thursday.", "description": "A former Canadian prime minister said in a now-deleted tweet that she hoped Hurricane Dorian makes a “direct hit” on one of Florida’s most famous properties:...", "authors": ["Robert Schroeder", "White House Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HG974_marala_ZG_20190404094752.jpg"}