{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/10/french-police-afraid-report-suspicious-colleagues-islamophobia-label", "downloaded_at": "2019-10-10 18:45:51.894214+00:00", "title": "Police Afraid to Report Suspicious Colleagues Due to 'Islamophobia'", "language": "en", "text": "French police are said to be reluctant to report the suspicious activity of Muslim colleagues over fears of being branded Islamophobic.\n\nInstitutional failures in reporting possible extremist behaviour are in the spotlight in France after a Muslim convert working in a police support role killed four officers in Paris. Senior officers are under pressure to explain how a radicalised individual could continue to work inside the force without being identified, with unions representing rank-and-file officers demanding to know what is being done to tackle the issue of infiltration.\n\nFrench newspaper Le Parisien reports part of the problem stems from fear by officers that if they report Islamic radicalisation in their colleagues, they could be flagged as potential Islamophobes by their superiors.\n\nA spokesman for a police union said in response to the issue that the government should be preparing to “fight against radicalization in the police” and that whistleblowers within the force raising suspicions about colleagues should receive legal cover to protect them.\n\n“An investigation has been launched into a grudge the assailant may have held against his colleagues, but terrorism cannot be ruled out,” a source said following the Paris police station attack.\n\nIt has also been revealed that radicalised Islamic convert Mickaël Harpon possessed a top-secret security clearance and had full access to the police prefecture’s directorate of intelligence (DRPP).\n\nIt was also reported that he had a USB stick in his possession that contained both Islamic State propaganda and the personal details of dozens of police officers. Investigators found the USB stick in his apartment shortly after the attack took place.\n\nRevealed: Islamist Infiltration of French Public Services https://t.co/Y1NmsLrclx — Breitbart London (@BreitbartLondon) June 21, 2019\n\nDespite his possession of Islamist materials, no terror group took credit for the attack.\n\nLast year, investigators found in possession of a female radical Islamist a similar USB stick. It contained the names and personal details of 2,626 intelligence officials from France’s Central Directorate of Interior Intelligence (DCRI). However, the data was listed as being from 2008.\n\nThe French police force is not the only public agency to see potential infiltration by radical Islamists. In June, a report by MPs Éric Diard of the conservative Republicans and Éric Poulliat of President Emmanuel Macron’s La République En Marche! (LREM/Republic on the Move) found many public sector workers are concerned about radical Islam.", "description": "French police are said to be reluctant to report the suspicious activity of Muslim colleagues over fears of being branded Islamophobic.", "authors": ["Chris Tomlinson"], "top_image": "https://media.breitbart.com/media/2016/12/GettyImages-461429572.png", "published_at": "2019-10-10"}