{"pub": "aljazeera", "url": "https://aljazeera.com/ajimpact/erdogan-calls-charges-turkey-halkbank-unlawful-191016131156597.html", "downloaded_at": "2019-10-16 20:57:15.673801+00:00", "title": "Erdogan calls US charges against Turkey's Halkbank 'unlawful'", "language": "en", "text": "Turkey's Halkbank said on Wednesday that the United States' charges against it amount to an escalation of Washington's sanctions on Ankara over its military action in Syria, while President Recep Tayyip Erdogan called them an \"unlawful, ugly\" step.\n\nUS prosecutors on Tuesday charged the state-owned lender with taking part in a multibillion-dollar scheme to evade US sanctions on Iran. In response, Halkbank's shares plunged as much as seven percent on Wednesday despite government measures designed to limit the fallout by banning trades that wager on a decline in Halkbank's share price - so-called \"short selling\".\n\nThe indictment came a day after the US imposed sanctions on Turkish officials, hiked tariffs and halted trade talks in an effort to persuade Turkey to stop attacks against the Kurdish People's Protection Units (YPG) fighters in northeastern Syria.\n\nThe indictment in a US district court in New York, which further strains ties between the North Atlantic Treaty Organization (NATO) allies, alleges Turkey's second-largest state bank conducted fraud, money laundering and other sanctions offences.\n\nWhile the US district attorney did not tie the charges to sanctions over Syria, Halkbank did.\n\n\"These were filed as part of the sanctions introduced against our country by the US government in response to Operation Peace Spring, heroically launched by the Turkish army to secure our borders and establish peace in the region,\" the bank said of Turkey's military campaign, now in its eighth day.\n\nHalkbank said it did not engage in sanctions violations as alleged and falls outside of the US Department of Justice's jurisdiction since it has no branches or employees in the US.\n\n\"Therefore the decision to indict is an unprecedented legal overreach,\" it said.\n\nThe case against Halkbank follows from a previous criminal case that came to light in 2016 against Turkish-Iranian gold trader Reza Zarrab, who was accused of playing a central role in the sanctions evasion scheme.\n\nMehmet Hakan Atilla, a former Halkbank deputy general manager, was arrested in New York the following year and was later sentenced to 32 months in prison. He returned to Turkey in July after serving out his sentence.\n\nZarrab pleaded guilty and testified for US prosecutors. He said Iran, with the help of Halkbank and Turkish government officials including the president, used a web of shell companies and sham transactions in gold, food and medicine to sidestep US sanctions.\n\nTurkey cast that case as a political plot against Erdogan's government and said it was an extension of a 2013 domestic corruption investigation, which Ankara says was launched by the network of Fethullah Gulen, a US-based Muslim leader.\n\nErdogan told reporters in Ankara the Halkbank issue was \"supposedly closed, but now they have taken an unlawful, ugly step with the southern New York prosecutors opening it again\".\n\n\"We will see the decision they will take, and we will [respond] accordingly,\" he added.\n\n'Political leverage'\n\nBefore Turkish markets opened, authorities banned short selling on seven large Turkish bank stocks including Halkbank.\n\nHalkbank shares nonetheless fell as much as 7.2 percent at the open and were down 5.2 percent at 11:37 GMT.\n\nTurkey's main banking index, which has fallen more than 16 percent this month on fears of US repercussions, was down 2.4 percent while Turkey's broader stock index was off 1.3 percent.\n\nTurkey's military campaign in northeast Syria has tested its ties with the US and could imperil its economy's recovery from last year's currency crisis. The military action was launched after President Donald Trump's abrupt decision to withdraw US troops from the area.\n\nThe YPG, which spearheaded the US-backed Syrian Democratic Forces (SDF), was a key US ally in the fight against the Islamic State of Iraq and the Levant (ISIL or ISIS).\n\nTurkey's lira has declined some 10 percent against the dollar this year, due largely to worries over strained relations between Ankara and Washington.\n\nBut the currency has firmed this week since US sanctions were announced, with many investors deeming the punitive measures lighter than expected. After the Halkbank indictment, the lira was up 0.3 percent at 5.9015 against the dollar.\n\nA banking analyst who declined to be named said the Halkbank case \"has always been on the table as political leverage\".\n\nOn Tuesday, US prosecutors said: \"This is one of the most serious Iran sanctions violations we have seen, and no business should profit from evading our laws or risking our national security.\"\n\nSadrettin Bagci, a bank analyst at Deniz Yatirim, said Halkbank had the ability to absorb a possible fine of $1.3bn to 2.3bn, depending on the capital measurement.\n\nThe Turkish stocks covered by the short selling ban are: Akbank, Garanti Bank, Halkbank, Isbank, TSKB, VakifBank and Yapi Kredi Bank.", "description": "'These were filed as part of the sanctions introduced against our country by the US,' says Halkbank.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/16/e6eecfea17444c888043bb6192b11f4c_18.jpg", "published_at": "2019-10-16"}