{"pub": "abcnews", "url": "https://abcnews.go.com/International/indonesian-aviation-authority-releases-report-lion-air-crash/story?id=66527149", "downloaded_at": "2019-10-25 22:12:33.137043+00:00", "title": "Indonesian aviation authority releases report on the Lion Air crash, citing defective sensors", "language": "en", "text": "Just days before the anniversary of the deadly Lion Air crash, some new insights about what happened are being shared publicly.\n\nInterested in Airlines? Add Airlines as an interest to stay up to date on the latest Airlines news, video, and analysis from ABC News. Add Interest\n\nIndonesia's National Transportation Safety Committee released a report Friday on the causes of the Oct. 29, 2018, crash that left 189 people on board dead.\n\nThe report echoes earlier findings, that there were detrimental problems with the left angle of attack (AOA) sensor.\n\nThe report states that the AOA was replaced the day before the deadly flight, and the report says that the installation left it with a 21 degree bias that went undetected. Other malfunctions on an earlier flight were reported, but the problematic AOA was not clear and therefore not reported.\n\nSteve Ganyard, a retired Marine Corps colonel and current ABC News aviation consultant, said the AOA is \"important because the flight control computers in the airplane are dependent on accurate information.\"\n\nHe said that in both the Lion Air and the subsequent similar crash involving the same model plane in Ethiopia, \"the AOA sensor was giving erroneous information to the computer and that bad information, through a series of events led to both airplanes going down.\"\n\n\"This confirms what has already been made public and will reinforce the anticipated conclusions and recommendations by the National Transportation Safety Board,\" Ganyard said.\n\nAll told, the report listed nine contributing factors that played a role in the crash, several of which are related to the AOA.\n\nMast Irham/EPA/Shutterstock, FILE\n\nThe report also lists several of the safety actions taken by a number of different groups and agencies in the wake of the crash. The most -- 35 -- were taken by the airline, Lion Air, and others who made unspecified changes were Boeing and the Federal Aviation Administration (FAA).\n\nThe FAA released a statement about the report, calling it \"a sober reminder to us\" of the importance of prioritizing safety.\n\n\"The FAA is committed to ensuring that the lessons learned from the losses of Lion Air Flight 610 and Ethiopian Airlines Flight 302 will result in an even greater level of safety globally,\" it said in its statement.\n\nBoeing, the makers of the 737 Max plane that was used in the Lion Air crash, released a statement saying that it \"commend Indonesia's National Transportation Safety Committee for its extensive efforts to determine the facts of this accident, the contributing factors to its cause and recommendations aimed toward our common goal that this never happens again.\"\n\n\"We are addressing the KNKT's safety recommendations, and taking actions to enhance the safety of the 737 MAX to prevent the flight control conditions that occurred in this accident from ever happening again. Safety is an enduring value for everyone at Boeing and the safety of the flying public, our customers, and the crews aboard our airplanes is always our top priority. We value our long-standing partnership with Lion Air and we look forward to continuing to work together in the future,\" the Boeing statement reads.", "description": "Indonesia's National Transportation Safety Committee released a report Friday on the causes of the Oct. 29, 2018, crash that left 189 people on board dead.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/lion-air-plane-crash-file-gty-ml-190405_hpMain_2_16x9_992.jpg", "published_at": "2019-10-25"}