{"pub": "nymag", "url": "https://thecut.com/2019/09/amy-klobuchar-killed-duck-golfing.html", "downloaded_at": "2019-10-01 00:22:52.080907+00:00", "title": "Amy Klobuchar Shares Fun, Relatable Story About Accidentally Killing a Duck", "language": "en", "text": "Amy Klobuchar and a duck, but not the one she killed, probably. Photo: Getty Images\n\nWho among us has not, at one point or another, set out to enjoy a nice afternoon on the links, our polo shirts tucked securely into our khakis, only to misfire on a swing, and accidentally take an animal’s life?\n\nOh, no one? Just Minnesota senator and 2020 presidential hopeful Amy Klobuchar? All right.\n\nKlobuchar shared this highly specific, supposedly humanizing anecdote at a United Food and Commercial Workers forum in Detroit on Sunday.\n\n“I did one time try to play golf … I misfired on the first try, and the ball hit a duck in the head, and it appeared to perish,” Klobuchar said, to groans from the audience. “So I don’t think it’s a good idea for the bird population of America if I play golf.”\n\nAMY KLOBUCHAR ADMITS SHE KILLED A DUCK WHILE GOLFING #UFCWForum pic.twitter.com/IpWGjWc2PJ — Brett Banditelli (@banditelli) September 29, 2019\n\nThis is not the first time Klobuchar has hurled a projectile to disastrous effects. In February, HuffPost and BuzzFeed reported that Klobuchar had allegedly mistreated her staff, berating them, and occasionally throwing objects at them, including a binder. (Over 60 former staffers later wrote an open letter defending the senator, saying she was a caring “mentor and friend” to them.)\n\nKlobuchar has struggled to gain footing in the crowded Democratic primary race. Currently, she’s polling at about 2 percent, positioning herself as a moderate candidate, emphasizing bipartisanship.\n\nGoing forward, ducks and other waterfowl — hot or otherwise — will presumably watch the primary race with renewed interest for their own safety. If they’re lucky, maybe they’ll catch a break like the groundhogs.\n\nStay in touch. Get the Cut newsletter delivered daily Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.", "description": "At at a United Food and Commercial Workers forum in Detroit on Sunday, Minnesota senator and presidential hopefuly Amy Klobuchar said she once killed a duck while golfing.", "authors": ["Madeleine Aggeler"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/30/30-amy-klobuchar-duck.w1200.h630.jpg", "published_at": "2019-09-30"}