{"pub": "thehill", "url": "https://thehill.com/opinion/international/465274-trumps-syria-blunder-is-escapism-not-strategy", "downloaded_at": "2019-10-11 12:39:51.359249+00:00", "title": "Trump's Syria blunder is escapism not strategy", "language": "en", "text": "President Trump Donald John TrumpDemocratic 2020 hopefuls tout LGBTQ plans at town hall Trump defends Syria move at rally: 'Bring our troops back home' Pompeo adviser resigning: report MORE’s decision to pull U.S. troops out of northern Syria – opening the door to the Turkish invasion that began Wednesday – bears all the distinctive hallmarks of his “America First” foreign policy. It’s impulsive, strategically vapid and morally obtuse.\n\nIn justifying bolting from Syria, Trump says he wants to extricate the United States from “ridiculous endless wars” in the Middle East. Such rhetoric goes down well with neo- isolationists like Sen. Rand Paul (R-Ky.). But the complaint that America is mired in “endless wars” also is a staple of the progressive left, which sees U.S. actions as mostly to blame for the region’s longstanding sectarian and ethnic conflicts.\n\nIt’s time to retire this mindless trope. U.S. forces aren’t engaged in the Middle East because Americans are addicted to war or the trappings of superpower status. They are fighting mainly to contain the very real threat of Islamist terrorism.\n\nADVERTISEMENT\n\nWorking with local forces in Syria and Iraq, they have succeeded in toppling the Islamic State’s barbaric caliphate. But Trump’s purblind desire to wash his hands of Syria threatens to squander that hard-won victory.\n\nHis decision, which followed a telephone call to Turkish President Recep Erdogan, blindsided U.S. military and intelligence officials, who strongly oppose the move. So have many of Trump’s Republican allies on Capitol Hill, who this week blistered the president’s judgment and vowed to punish Turkish aggression with sanctions.\n\nIn attacking the Kurds, Erdogan aims to create a “safe zone” in northern Syria. That territory is now controlled by the Kurdish militia, which Erdogan claims is allied with Kurdish insurgents in Turkey. Stepping aside so Turkey can attack was a rank betrayal of Syria’s Kurds, who have done most of the fighting and dying on the ground. Backed by U.S. special forces directing highly effective airstrikes, the Kurdish militia has lost more than 11,000 fighters in dislodging ISIS from Raqqa and other bastions. Of the fewer than 2,000 American troops in Syria, just five have been killed over the last two years. That’s hardly the Vietnam-style quagmire that Trump invokes to justify his retreat from Syria.\n\nIn addition to creating a buffer zone in northern Syria, Erdogan plans to forcibly repatriate more than a million Syrian Arab refugees there. The ethnically distinct Kurds vow to resist this mass exercise in “ethnic cleansing.” That means they’ll turn from mopping up bitter-end ISIS cells to confronting the Turkish invaders.\n\nThe coming clash also could endanger Kurdish control of tens of thousands of unrepentant ISIS captives and their families. If these fighters get loose, ISIS could regroup and launch fresh attacks in Syria and Iraq. This prospect also has unnerved U.S. allies in Europe, who aren’t eager to welcome home hardened jihadists with French, German and British passports.\n\nADVERTISEMENT\n\nTrump, who now lamely says he doesn’t support the Turkish incursion he enabled, doesn’t appear to have thought carefully about any of this. Along with hardboiled conservative “realists” and the anti-war left, he imagines America can shed the burdens of upholding peace and stability in the world without risk to our own security. Just let “somebody else” do the job.\n\nIn Syria, that “somebody else” will likely be Syrian dictator Basher al-Assad and his authoritarian patrons, Iran and Russia. The Kurds pose the most formidable barrier to Assad’s reclaiming control of all of Syria. That would constitute a huge strategic victory for the axis of autocrats, demoralize pro-democracy forces in Syria and elsewhere and embolden Iran to intrigue against Iraq, Israel and moderate Arab countries.\n\nThe “endless war” lament, of course, really reflects America’s frustratingly long military interventions in Afghanistan (since late 2001) and Iraq (on and off since 2003). No doubt Americans are weary of the costs and losses of these engagements. But even Trump recognizes that the United States cannot withdraw from Afghanistan without striking a deal with the Taliban to prevent another 9/11 attack. Nor does he seem eager to repeat President Obama’s error in precipitously pulling U.S. troops out of Iraq, which allowed ISIS to infiltrate from Syria and seize the important northern city of Mosul. On the contrary, Trump has said he wants to keep U.S. troops in Iraq to “watch” Iran.\n\nIn short, America actually isn’t locked into pointless “endless wars” in the Middle East. We have troops there for the same reason we keep troops in other parts of the world — to preempt threats to our homeland, deter aggression and protect America’s far-flung interests. Their mission is counterterrorism, not war, in support of Afghan and other local forces that are doing most of the fighting on the ground.\n\nIt’s been 74 years since Japan surrendered unconditionally on the battleship USS Missouri, but the United States still has 56,000 troops there. About 65,000 active duty U.S. troops are stationed in Europe (including NATO ally Turkey). We have over 25,000 troops in South Korea. And the U.S. Central Command overseas between 60,000 and 70,000 troops in the Middle East, most of whom are not engaged directly in combat.\n\nAt a time when Americans are looking inward and rethinking the assumptions that undergird liberal internationalism, it’s not unreasonable to ask whether we still need or can afford 800 military bases around the world. Let’s have that debate, and let’s be honest about the security risks more limited engagement in the world entails.\n\nBut let’s drop the bogus “endless wars” excuse for American retreat. As Trump’s Syria blunder shows, it’s political escapism, not national strategy.\n\nWill Marshall is president and founder of the Progressive Policy Institute (PPI).", "description": "Let’s drop the bogus “endless wars” excuse for American retreat. As Trump’s Syria blunder shows, it’s political escapism, not national strategy.", "authors": [], "top_image": "https://thehill.com/sites/default/files/us_patrols_syria_02012019_1.jpg", "published_at": "2019-10-11"}