{"pub": "yahoo", "url": "https://news.yahoo.com/aoc-says-democrats-failure-impeach-053638880.html", "downloaded_at": "2019-09-23 11:55:08.072837+00:00", "title": "AOC Says Democrats’ Failure to Impeach Trump Is Its Own Scandal", "language": "en", "text": "(Bloomberg) -- Representative Alexandria Ocasio-Cortez said Democrats were being weak on President Donald Trump, in the wake of reports that he asked Ukraine’s government to investigate the son of Democratic front-runner Joe Biden.\n\n“At this point, the bigger national scandal isn’t the president’s lawbreaking behavior - it is the Democratic Party’s refusal to impeach him for it,” she tweeted on Saturday night.\n\n“It is one thing for a sitting president to break the law. It’s another to let him,” she said in a series of postings. “The integrity of our democracy isn’t threatened when a president breaks the law. It‘s threatened when we do nothing about it. The GOP’s silence & refusal to act shouldn’t be a surprise. Ours is.”\n\nHouse Speaker Nancy Pelosi and congressional Democratic leaders have so far resisted calls to impeach the president, fearing it would be harmful to Democratic candidates seeking re-election in Republican-leaning areas in 2020. There also is little prospect that any effort would be successful in the Republican-controlled Senate.\n\nPelosi has said Congress should pass laws so a sitting president can be indicted. Several House committees are also pursuing investigations of the Trump administration.\n\nYet, calls for a stronger Democratic response are coming not just from the freshman congresswoman from New York and her allies, but much of the Democratic presidential field. Elizabeth Warren, who leads in the latest Des Moines Register/CNN Iowa poll, pressed Congress to “step up” and begin impeachment proceedings against Trump while campaigning in the state.\n\n“What the president has now demonstrated is that he thinks it’s pretty clear, he doesn’t have to follow the law and in fact can continue to commit high crimes and misdemeanors,” Warren said Friday in Cedar Rapids.\n\nOcasio-Cortez, widely known as AOC, also retweeted a post from presidential candidate Beto O’Rourke. “What is Congress waiting for?” O’Rourke asked while elevating a tweet on the Ukraine issue and Pelosi’s lack of impeachment response. “This is crazy. Unless we take action now, we will see the end of American democracy.”\n\nTo contact the reporter on this story: Karen Leigh in Hong Kong at kleigh4@bloomberg.net\n\nTo contact the editors responsible for this story: Shamim Adam at sadam2@bloomberg.net, Derek Wallbank\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Representative Alexandria Ocasio-Cortez said Democrats were being weak on President Donald Trump, in the wake of reports that he asked Ukraine’s government to investigate the son of Democratic front-runner Joe Biden.“At this point, the bigger national scandal isn’t the president’s lawbreaking", "authors": ["Karen Leigh"], "top_image": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "published_at": "2019-09-22"}