{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7603539/The-horse-breeder-accused-raping-German-backpacker-doing-farm-work.html", "downloaded_at": "2019-10-23 11:00:15.903339+00:00", "title": "The horse breeder accused of raping a German backpacker who was doing her farm work", "language": "en", "text": "A farm manager accused of sexually assaulting an 18-year-old German backpacker on his isolated property has been denied bail.\n\nGregory Richard Douglas, 66, allegedly sexually touched the tourist on several occasions between September 28 and 18 October.\n\nHe is facing one charge of sexual assault and four counts of touching a person without consent.\n\nGregory Richard Douglas, 66, allegedly sexually touched the tourist on several occasions between September 28 and 18 October\n\nCourt documents allege that throughout that time Douglas had sex with the teen, kissed her bottom, touched her breasts and inner thigh near her vagina and grabbed her hips, according to The Daily Telegraph.\n\nThe woman had been staying with the man as part of a 'farmstay' program at a rural property in Peelwood, between Goulburn and Bathurst, when the alleged assaults happened.\n\nShe had reportedly spent months at the farmstay where access in and out is limited.\n\nThe woman reported the alleged incidents to Surry Hills Police Area Command earlier this week.\n\nInvestigators searched a rural property in Peelwood on Tuesday and officers seized computers, mobile phones and electronic storage devices.\n\nThe magistrate said that someone else would have to look after the horses on the farm as it was too dangerous for the community to grant the defendant bail.\n\nHe will appear again at Goulburn Local Court on December 18.\n\nPolice inquiries are continuing.", "description": "A farm manager accused of sexually assaulting an 18-year-old German backpacker on his isolated \nNew South Wales property has been denied bail.", "authors": ["Brett Lackey", "Kelsey Wilkie For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/06/20070290-0-image-a-2_1571809575115.jpg", "published_at": "2019-10-23"}