{"pub": "dailymail", "url": "https://thisismoney.co.uk/money/markets/article-7617293/Marks-Spencer-clothes-slump-falling-property-values-set-hit-profits.html", "downloaded_at": "2019-10-27 01:00:48.943988+00:00", "title": "Marks & Spencer clothes slump and falling property values set to hit profits", "language": "en", "text": "Marks & Spencer is preparing to announce a profits slump after a slide at its clothing business, according to analysts.\n\nTony Shiret at stockbroker Whitman Howard has forecast that profit before exceptional costs fell to £185million in the six months to the end of September, from £224million the year before.\n\nHe said sales at its general merchandise division, which mainly sells clothing, may have fallen by as much as 4 per cent, offsetting improved food sales, based on like-for-like figures.\n\nMarks & Spencer is preparing to announce a profits slump, according to analysts\n\nAnalysts also expect the half-yearly figures, due to be published on November 6, to be further affected by exceptional costs. These include falling property values for its estate.\n\nShiret said: ‘Marks & Spencer has had nearly £1.5billion of exceptional charges in the last three years. There will be more. Its accounts have become a bit of a farce to be honest.’\n\nHe said the retailer had already indicated there could be a one-off drain of up to £100million of cash in the full year to March 2020.\n\nChief executive Steve Rowe said this month that the clothing business had a ‘lost 18 months’ under its former clothing boss Jill McDonald.\n\nM&S chairman Archie Norman has warned it will take years to revive the fortunes of the chain, which is battling with a shift in demand from the high street to online.", "description": "Marks & Spencer is preparing to announce a profits slump after a slide at its clothing business, according to analysts.", "authors": ["Neil Craven For The Mail On Sunday", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/20/20224370-0-image-a-260_1572119214508.jpg", "published_at": "2019-10-26"}