{"pub": "investing.com", "url": "https://investing.com/analysis/uschina-economic-damage-despite-trade-deal-optimism-200473036", "downloaded_at": "2019-10-14 11:32:58.558013+00:00", "title": "U.S.-China: Economic Damage Despite Trade Deal Optimism", "language": "en", "text": "On Friday, U.S. President Donald Trump announced the signing of phase one of a trade agreement with China to end the trade wars. This partial deal was the most significant breakthrough in the 15-month long dispute. The financial markets experienced considerable growth on the news as Shanghai Blue Chip Index of China A50 updated its 20-month highs and rose by more than 4% since Thursday, while the jumped by 1.3%. American markets experienced more tempered increase than the Asian bourses. The rose 3% against Thursday’s lows, but only reached early October levels.\n\nChina A50 updated its 20-month highs on Monday\n\nThe market demand on Monday was constrained by investors’ concerns that the most challenging moments of the agreement between China and the US are postponed again to a later date. The signing of this trade agreement is similar to pick the lowest hanging fruits. But to get the deal done, more and more efforts will be needed with each phase. Political observers note that Trump, at the background of the situation around impeachment, needed a small victory to ease the onslaught of his opponents.\n\nSPX experienced tempered rally\n\nA significant victory for the markets is a pause in further tariff increases. However, the measures already in place hurt the economy.\n\nChinese foreign trade data, published in the morning, showed a decline in both exports and imports – a sure sign of a slowdown in the second world economy. These weaker expectations caused a downward reversal of the Asian indices.\n\nOn Monday, trading is likely to be very calm due to the holidays in the US and Canadian markets. Most likely, markets will move to more realistic estimates of the outcome of the deal after initial optimism.\n\nBesides, it is worth noting that this week starts the reporting season for the largest US companies, which will also attract the attention of markets. Investors will try to assess the extent to which the trade disputes on the one hand and rates cut, on the other hand, have affected the performance and forecasts of companies.\n\nThe FxPro Analyst Team", "description": "Forex Analysis by Alexander Kuptsikevich covering: S&P 500, USD/CNY. Read Alexander Kuptsikevich's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-14"}