{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/trump-responds-accusations-having-meltdown-democrats-pelosi-tweetstorm-2019-10", "downloaded_at": "2019-10-16 23:44:20.669395+00:00", "title": "Trump went on a Twitter rant responding to accusations of having a 'meltdown' in a meeting with Democrats", "language": "en", "text": "President Donald Trump accused House Speaker Nancy Pelosi of having an \"unhinged meltdown\" after she said he was \"shaken\" by the House voting in favor of a resolution condemning his Syria retreat.\n\nTrump tweeted photos of a meeting with Democratic leaders regarding strategies to contain ISIS, captioning a photo Pelosi and Senate Minority Leader Chuck Schumer with \"Do you think they like me?\"\n\nPrior to Trump's tweetstorm, Pelosi told reporters that Trump had a \"meltdown\" during his meeting with Democratic leaders, as he was particularly upset with the resolution vote, in which 129 Republicans joined Democrats to condemn Trump's move.\n\nVisit Business Insider's homepage for more stories .\n\nPresident Donald Trump accused House Speaker Nancy Pelosi of having an \"unhinged meltdown\" after she said he was \"shaken\" by the House voting in favor of a resolution condemning his Syria retreat.\n\nTrump tweeted photos of a meeting with Democratic leaders regarding strategies to contain ISIS, captioning a photo Pelosi and Senate Minority Leader Chuck Schumer with \"Do you think they like me?\"\n\nIn a follow-up tweet, the president took a photo of empty seats, saying that Pelosi and Schumer had \"stormed out of the Cabinet Room.\"\n\nRead more: Pelosi said Trump had a 'meltdown' after the House overwhelmingly voted to condemn his Syria retreat\n\nPrior to Trump's tweetstorm, Pelosi told reporters that Trump had a \"meltdown\" during his meeting with Democratic leaders, as he was particularly upset with the resolution vote on his decision to pull US troops from Syria, in which 129 Republicans voted with Democrats to condemn Trump's move.\n\nPulling US troops was seen as a move of abandonment, leaving Kurdish — US allies in the fight against the Islamic State — forces vulnerable to an attack from Turkey.\n\nA Turkish assault on northern Syria earlier this month. Lawmakers fear that the Kurds, who have been responsible for detaining Islamic State fighters and their families, may not be able to maintaining detention centers while fighting Turkish forces. This could lead to the breakout of hundreds of ISIS militants in northern Syria.\n\n\"He was shaken up by it,\" Pelosi said, referring to the vote. \"That's why we couldn't continue in the meeting, because he was just not relating to the reality of it.\"\n\nSchumer described the president's conduct as \"insulting.\" He said the president called Pelosi a \"third-rate politician,\" while Pelosi later said she heard \"third-grade politician,\" both of which were insulting to her character.\n\n\"It was sort of a diatribe, a nasty diatribe not focused on the facts,\" Schumer said.\n\nWhite House press secretary Stephanie Grisham told Business Insider's John Haltiwanger that Trump's demeanor during the meeting was \"measured, factual and decisive,\" adding that \"Pelosi's decision to walk out was baffling, but not surprising.\"\n\n\"She had no intention of listening or contributing to an important meeting on national security issues,\" Grisham said. \"While democratic leadership chose to storm out and get in front of the cameras to whine, everyone else in the meeting chose to stay in the room and work on behalf of this country.\"\n\nFollowing Trump's Wednesday evening tweets, Pelos changed her Twitter cover photo with the image of her \"unhinged meltdown.\"", "description": "Trump tweeted photos of a meeting with Democratic leaders, captioning a photo of Nancy Pelosi and Chuck Schumer with \"Do you think they like me?\"", "authors": ["Lauren Frias"], "top_image": "https://image.businessinsider.com/5d8bb1b82e22af40a973c8aa?width=1200&format=jpeg", "published_at": "2019-10-16"}