{"pub": "huffpost", "url": "https://huffpost.com/entry/bbc-naga-munchetty-complaint-donald-trump-racism_n_5d926eede4b0ac3cddad3cc0", "downloaded_at": "2019-10-01 04:28:22.349244+00:00", "title": "BBC Reverses Decision To Fault Anchor Who Called Out Trump's Racist Remarks", "language": "en", "text": "The BBC has reversed its decision to find fault with an anchor who called out President Donald Trump’s racist attacks on four U.S. congresswomen of color earlier this year.\n\nNaga Munchetty had addressed Trump’s now-infamous mid-July Twitter tirade in which he urged the lawmakers to “go back” to “the totally broken and crime infested places from which they came,” taking aim at progressive Democratic Reps. Alexandria Ocasio-Cortez (N.Y.), Ilhan Omar (Minn.), Ayanna Pressley (Mass.) and Rashida Tlaib (Mich.). Only one of the four, Omar, was not born in the U.S.; she is a native of Somalia who came to America as a youngster with her family.\n\nMunchetty, a native of London whose mother is Indian and whose father is from the Republic of Mauritius, joined in the outraged reaction from several quarters to Trump’s tweet. She said on-air, “Every time I have been told, as a woman of color, to go back to where I came from, that was embedded in racism. Now I’m not accusing anyone of anything here, but you know what certain phrases mean.”\n\nShe added, “I can imagine lots of people in this country will be feeling absolutely furious that a man in that position feels it’s okay to skirt the lines with using language like that.”\n\nA viewer submitted a complaint to the BBC about Munchetty’s comments, asserting the bias in its coverage\n\nIn line with BBC procedures, its executive complaints unit reviewed the matter and determined that “it was entirely legitimate” for Munchetty to invoke “her own experience of racism and the racist context in which suggestions that people from ethnic minorities should go back to their own countries are generally made.”\n\nBut the unit also found that because “she went on to comment critically on the possible motive for, and potential consequences” of Trump’s words, her comments “fell short of due impartiality” and found the complaint was justified.\n\nOn Monday, BBC Director-General Tony Hall emailed staffers to announce that the ruling would be thrown out.\n\nA copy of the message shared on Twitter by Simon Gilbert, one of the network’s political reporters, said, “Racism is racism and the BBC is not impartial on the topic.”\n\nIn this case, Munchetty’s words were not “sufficient to merit a partial uphold around the comments she made,” Hall said. He stressed that no sanction had ever been issued against Munchetty, and he called her “an exceptional journalist.”\n\nHall’s memo came after an outcry from politicians, media professionals and other public figures over the initial finding against Munchetty. Some of the critics urged the network in an open letter published by The Guardian on Friday to reconsider its original decision.\n\n“To suggest that future [Black, Asian, and minority ethnic] broadcasters will be hired at the corporation on the premise that they remain ‘impartial’ about how they feel about their experiences of racism is ludicrous,” the letter read. “To require journalists of all ethnicities and races to endorse racism as a legitimate ‘opinion’ is an abrogation of responsibility of the most serious nature.”", "description": "Naga Munchetty spoke out against Trump tweets in July that targeted four congresswomen of color.", "authors": ["Trends Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d928d522100005b00fe67fe.jpeg?cache=442zgbrgku&ops=1778_1000", "published_at": "2019-10-01"}