{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7608621/Two-Liverpool-fans-miss-Champions-League-win-accidentally-travelling-Ghent-not-Genk.html", "downloaded_at": "2019-10-24 16:14:12.659143+00:00", "title": "Two Liverpool fans miss Champions League win after accidentally travelling to Ghent and not Genk!", "language": "en", "text": "Two Liverpool fans endured every supporter's nightmare on Wednesday evening.\n\nWhat's the first rule of going on an European away day: make sure you know what city it is that you're travelling to.\n\nUnfortunately for two Liverpool fans, they forgot to do their research before making the trip to Belgium, and ended up 95 miles away from where they were supposed to be!\n\nTwo Liverpool fans missed their win after accidentally travelling to Ghent instead of Genk\n\nThey were over a two-hour drive away from Genk and didn't realise until it was too late\n\nThey had made the journey across the channel to watch Liverpool play Genk in their Champions League group game.\n\nBut instead of going to Genk, Rob, from London, and Lee, from Leicester travelled to Ghent, over a two-hour drive away from the Luminus Arena - where the game was being played.\n\nThe worst thing about it... they didn't realise their error until they had spent hours trying to find the stadium, and by then kick-off was only 30 minutes away.\n\nThey consequently missed Alex Oxlade-Chamberlain's superb strike against Genk\n\nThe pair had to resign themselves to watching the match in a cafe in Ghent.\n\nAlthough they were able to see the funny side - making a joke at their own expense by posting a picture on Facebook - what they saw on the TV screen would have only rubbed salt in the wounds.\n\nRob told PA: 'We are really embarrassed. We were hoping our mistake would fly under the radar but we were pulling into Calais just now and a friend sent me a link to the story, which has started going viral.\n\n'My wife didn't know, but I expect she is going to find out soon.'\n\nLiverpool comfortably claimed a 4-1 victory in the Champions League group game\n\n'We took a taxi from the airport and drove past the stadium and said to the taxi driver, \"We are going there tonight to watch Liverpool\", but he didn't say much.\n\n'In hindsight that should have made us realise.\n\n'When we were checking into the hotel, the person working looked at us a bit quizzically but it was only when we went out to a restaurant, the waiter was a Ghent fan, and he told us our mistake.\n\n'We were absolutely gutted. By then it was too late - even if we had left immediately we wouldn't have made the match.'\n\n'Me and Lee have a bit of a track record for this. Last time we tried to watch Liverpool we got on the wrong train - instead of taking the fast train, we ended up on the slow train which took six hours.\n\n'I think next time we will let someone else book the travel.'\n\nAlex Oxlade-Chamberlain scored one of the best goals of the season with a superb outside-of-the-boot chip as Liverpool eased to a 4-1 victory.\n\nRob and Lee may not be able to say 'I was there' for it, but their disastrous trip may yet be salvaged.\n\nAA Gent have kindly offered them free tickets to their Europa League match with Wolfsburg on Thursday night as some form of compensation for their woes, and rather aptly, some geography lessons too.\n\nIt won't make up for missing their team win away in Europe, but it will certainly soften the blow. You suspect they won't be making that same mistake again in a hurry.", "description": "Two Liverpool supporters (pictured bottom left) missed Wednesday's Champions League win in Belgium after accidentally travelling to Ghent and not Genk!", "authors": ["Jordan Seward For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/09/20122384-0-image-a-11_1571906835950.jpg", "published_at": "2019-10-24"}