{"pub": "afr", "url": "https://afr.com/politics/federal/the-man-who-sold-jackson-pollock-s-blue-poles-to-australia-20191010-p52zl5", "downloaded_at": "2019-10-18 01:04:08.166856+00:00", "title": "The man who sold Jackson Pollock's Blue Poles to Australia", "language": "en", "text": "Chernick worked with the NGA on the production, telling the story of one of Pollock's best-known works, now thought to be worth as much as $350 million.\n\n\"I’m so pleased I caught this story on camera before Ben’s recent passing,\" she told AFR Weekend.\n\n\"The story of Blue Poles is the story of Ben Heller. It was his vision and foresight that helped create Pollock's place in art history.\"\n\nThen prime minister Gough Whitlam authorised the purchase of Blue Poles from Ben Heller, sparking years of debate about the landmark work. AFR\n\nChernick says many international audiences didn't know the controversy the Whitlam government's purchase of the painting began, including claims of cultural cringe and snobbery that persist to this day.\n\n\"The film took six months to make. Ben Heller was a friend and had been talking to me about his story for the past decade and then the NGA rang me to make the film,\" she says.\n\nHeller bought the work for $32,000, shortly after Pollock's death. His New York apartment was considered a temple of abstract art.\n\nOriginally titled simply Number 11, Blue Poles helped place Pollock among the leading names of the post-World War II art world, alongside contemporaries Willem de Kooning, Robert Motherwell and Mark Rothko.\n\nAdvertisement\n\nHeller was criticised for letting Blue Poles leave the United States but the sale, negotiated with visionary foundation director of the NGA James Mollison, added modern and contemporary star power to the Canberra gallery, which opened in 1982.\n\nThe purchase, first reported on the front page of The Australian Financial Review in August 1973, was described as securing \"possibly the most important picture painted since Picasso's Guernica\".\n\nArt collector Ben Heller in Alison Chernick's new film on Blue Poles. AFR\n\nIn the film, which premiered at New York's Hamptons International Film Festival this week, Heller recalls seeing the painting for the first time at New York's Whitney Museum.\n\n\"I was kind of wowed. The oranges, the yellows were terrific, the whites splendid.\"\n\nThe nearly 5 metre wide work had to be moved in and out of the Heller family's Central Park West apartment through a window and a specially altered railing. Crews carefully lowered it to the street level, holding up traffic for hours at a time.\n\nHeller recalls breaking up the unrivalled private collection.\n\n“It’s impossible to have such glory in one place. It’s more than you can expect anything to be.\n\nAdvertisement\n\n“One thing that was said to me by Jim Mollison I found very persuasive. That Australia did not want to see itself as a white bastion in a yellow world but wanted to be part of the Pacific community.\"\n\nHe tells the viewer Blue Poles and Pollock \"made\" the NGA.\n\n“If you think what Jackson did, he’s made this museum. In this case, a nation’s life.\n\n“The financial is a record, in a way, of the world opinion ... now 'priceless' is the word.\"", "description": "A new film looking at Jackson Pollock's Blue Poles includes the final interview with powerhouse New York art collector Ben Heller.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_1.0232%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_7%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/538bac5f0e9a215c9cb2bc3a76f966ff6006ffb6", "published_at": "2019-10-10"}