{"pub": "yahoo", "url": "https://sports.yahoo.com/tony-romo-could-miss-sundays-game-for-cbs-if-he-makes-the-cut-in-pga-event-195530744.html", "downloaded_at": "2019-09-25 23:36:06.821347+00:00", "title": "Tony Romo could miss Sunday's game for CBS if he makes the cut in PGA event", "language": "en", "text": "CBS had a unique quandary with its star NFL analyst this week.\n\nTony Romo is a good golfer. Good enough that he got a sponsor’s exemption to play in this week’s Safeway Open on the PGA Tour.\n\nAnd that would be fine if this was June or July, but Romo is scheduled to join Jim Nantz on the call of the Minnesota Vikings-Chicago Bears game on Sunday afternoon.\n\nScroll to continue with content Ad\n\nCBS had to come up with a contingency plan if Romo plays well enough to make the cut and last to the weekend in his golf event, according to the Chicago Tribune.\n\nTony Romo will be at PGA Tour event\n\nRomo is a very good golfer, but not great. CBS probably doesn’t need to worry about Romo, the former Cowboys quarterback, making the cut.\n\nThe most likely scenario is Romo plays, generates some publicity for the tournament (which he’s already done, considering it’s already generating stories about his availability for Vikings-Bears), misses the cut and then leaves Napa, Calif. for Chicago after a couple days of golf. He’ll take a private jet if he misses the cut and be on hand for Saturday preparations, the Tribune said.\n\nThat’s if he misses the cut. If he makes it, the Tribune said fellow former NFL quarterback Boomer Esiason will fill in with Nantz.\n\nRomo is a star in the booth\n\nRomo’s entire career at CBS has been unique.\n\nHe came straight from NFL retirement to the broadcast booth. He was raw and excitable, and that became part of his charm. He was an instant star in the CBS booth at a time in which everything and anything is ripped apart on social media.\n\nRomo presumably doesn’t want to miss work on Sunday. But if he does, it’s because he’s had a fantastic week on the golf course.\n\nTony Romo is participating in a PGA Tour event this week. (Getty Images)\n\n– – – – – – –\n\nStory continues\n\nFrank Schwab is a writer for Yahoo Sports. Have a tip? Email him at shutdown.corner@yahoo.com or follow him on Twitter! Follow @YahooSchwab\n\nMore from Yahoo Sports:\n\n\n\n", "description": "Tony Romo isn't likely to make the cut in this week's PGA Tour event, but CBS is prepared if he does.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/9yUPRAmPg_8KOeJwbAK9Xw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/c6QG6EjPC8EviSKxg9aroA--~B/aD0zMjY0O3c9NDg5NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/ad722720-dfcd-11e9-bfff-37f74ccdd507", "published_at": "2019-09-25"}