{"pub": "usatoday", "url": "https://usatoday.com/story/news/50-states/2019/10/23/lynyrd-skynyrd-breaking-bad-beer-cheetahs-record-muskie-news-around-states/40382169", "downloaded_at": "2019-10-23 12:16:06.701960+00:00", "title": "Lynyrd Skynyrd, ‘Breaking Bad’ beer, cheetahs, record muskie: News from around our 50 states", "language": "en", "text": "CLOSE\n\nAlabama\n\nBirmingham: The city council has approved an ordinance prohibiting smoking in a 100-block zone around schools and health facilities. Al.Com reported Birmingham City Council unanimously approved the rule last week. It will go into effect on Dec. 1. The ordinance said the no-smoking zone will be called the “health district” and will cover the University of Alabama at Birmingham, Children’s Hospital and Veteran’s Administration Medical Center. The council banned smoking in most places in 2012 and gave violators a fine. Council President Valerie Abbott said she’s worried about enforcing the ordinance but Health Officer and CEO of the Jefferson County Department of Health Mark Wilson said a few “gentle reminders” will be enough. The ordinance doesn’t include vaping; Wilson said he hopes the council will amend the ordinance.\n\nAlaska\n\nFairbanks: An escaped goat that eluded authorities for two days has been adopted as the official mascot of an organization supporting people affected by opioids. The Fairbanks Daily News-Miner reported Monday that The Bridge announced the adoption on its Facebook page. The organization provides employment and peer support organization for people affected by opioid use disorder. Animal control officials asked the public to contact law enforcement in a social media post that was shared more than 500 times after the goat escaped from its owner Oct. 14. Facebook users who followed the chase updates named the male goat Curry. The goat was delivered to Fairbanks North Star Borough Animal Control the following night after members of the public captured it near a road where it had jumped into traffic.\n\nArizona\n\nDameon Bender holds his daughter Kallie while nurse Becky Cole examines her. Kallie has spent nearly 150 days at Dignity Health St. Joseph’s Hospital and Medical Center in Phoenix since being born prematurely. (Photo: Dignity Health)\n\nPhoenix: A baby weighing less than one pound when she was born nearly five months ago is being released Monday from a Phoenix hospital. The girl was born 15 weeks premature, underwent surgery to address a heart defect and now weighs 7 pounds. She didn’t suffer brain bleeds or blindness because of prematurity. Her parents waited 37 days to hold their daughter for the first time. The girl will have to use an oxygen tank and feeding tube as she learns to breathe and eat on her own. She spent nearly 150 days at Dignity Health St. Joseph’s Hospital and Medical Center.\n\nArkansas\n\nConway: A technology company that works with Medicaid programs is expanding its central Arkansas facility and hiring 1,200 new workers. DXC Technology announced Tuesday the expansion of its facility in Conway, which employs nearly 450 workers. The company said the new positions will be in health care and life sciences, automotive and security information technology services. The company said it will establish a global “Center of Excellence” that serves the Medicaid business for 30 states and other clients. DXC says it provides health and human services to clients in 42 states and territories. The state’s economic development commission said DXC will receive cash rebates for the expansion.\n\nCalifornia\n\nMajani, a 2-year-old male African cheetah, chases a mechanical rabbit at the San Diego Zoo's Wild Animal Park as part of the Park's environmental enrichment program. Wild Wonders conservation and education center in Bonsall, Calif., has scheduled a fundraiser on Nov. 2 to benefit the Cheetah Conservation Fund in Africa. (Photo: Ken Bohn/AP)\n\nBonsall: A wildlife center is planning a fundraiser for the construction of a safe house for the world’s decreasing population of cheetahs, officials said. Wild Wonders conservation and education center in Bonsall scheduled the Nov. 2 event to benefit the Cheetah Conservation Fund in Africa, the San Diego Union-Tribune reported Sunday. The proceeds will go toward construction of a facility in the Republic of Somaliland to care for cheetah cubs seized from smugglers, said Wild Wonders founder Jackie Navarro. Three cubs die for each one that is illegally smuggled to collectors. There are fewer than 7,100 cheetahs worldwide, about half the number from 10 years ago, according to the Cheetah Conservation Fund. Wild Wonders conducts more than 1,000 wildlife conservation programs at schools throughout the Western U.S. and Canada. Since 2007, the center 47 miles north of San Diego has raised a trio of captive-bred cheetahs that have helped raise more than $100,000 for cheetah conservation, Navarro said.\n\nColorado\n\nFairplay: Classes are resuming in rural Park County School District RE-2 despite a teachers’ strike now in its second week. School district president Kim Bundgaard told The Denver Post that classrooms will be staffed Monday by teachers who chose to come back to work, licensed substitute teachers and other staffers. Teachers went on strike Oct. 14 over salary increases and other issues. It is the third teachers’ strike in Colorado in the last 18 months.\n\nConnecticut\n\nA plaque at the Otis Libreary in Norwich, Conn., commemorates the 1984 Sikh Genocide. The library has removed the memorial to Sikhs killed in India 35 years ago after a protest call from the Indian Consulate in New York. (Photo: John Shishmanian/NorwichBulletin.com via AP)\n\nNorwich: The Otis Library has removed a memorial to Sikhs killed in India 35 years ago after a protest call from the Indian Consulate in New York. The memorial, which was put up in June, included a plaque, flags and a portrait of a Sikh separatist movement leader who was among those killed in a June 1984 attack by the Indian army on the Sikh Golden Temple in Amritsar. Prime Minister Indira Gandhi was assassinated five months later by two of her Sikh bodyguards, leading to anti-Sikh riots in India. Nicholas Fortson, president of the Otis Library’s board of trustees, said the library is not a political institution and removed the memorial last month amid support for it and criticism, including the call from the consulate.\n\nDelaware\n\nWilmington: A significant decline in blood donors has caused the Mid-Atlantic's supply to drop to critically low levels, according to a release from the Blood Bank of Delmarva. The blood bank said in order to maintain a safe blood supply, a seven-day inventory of all blood types must be continually replenished. Reserves are now below the minimum. The shortage is a result of a decline in overall donors, including first-time donors and repeat donors, and increased demand, the blood bank said. Cancer patients, those undergoing surgery and people being treated for accidents, burns, and other traumas are some of the most in need of blood transfusions. People with O-negative blood type are especially encouraged to donate, as their blood can be used in emergencies. To donate blood, call 888-825-6638 (888-8-BLOOD-8), visit www.donate.bbd.org or visit the Blood Bank of Delmarva’s Salisbury office at 1309 Mount Hermon Road. The bank supplies blood and blood products to 19 hospitals in the region.\n\nDistrict of Columbia\n\nWashington: A 35-year old Alexandria, Virginia, man was arrested for impersonating an officer at a Southeast housing complex, WUSA-TV reported. Police arrested Joshua Taber after a security guard at the Forest Ridge Vistas Apartments on Elvans Road tipped off officers that his supervisor was on the property with an unlicensed gun. Resident Curtis Kelly captured the dramatic arrest on his cellphone. The man they all thought was a special police officer was being arrested by police. \"He always had a gun, that's why police took the gun off his hip,\" Kelly said According to court documents, when police asked Taber if he had weapons in his car, he said, “not that I know of.\" But officers discovered an AR-15 in a duffle bag and a military-style vest with rifle plates. The police report contained a long list of evidence seized by officers, including multiple fully loaded 30-round magazines, a police raid jacket and badges. Police said Taber even added his own red-and-blue flashing lights to the top of his white Chevy Impala. Taber was released from custody and will be back in court to answer to the charges on Nov. 4th.\n\nFlorida\n\nJim Durkin of Cape Coral, Fla., takes a closer look at his heavily damaged car that was thrown across the street from the home where he was staying. Family, friends and neighbors picked up the pieces of their northwest Cape Coral neighborhood Saturday morning after a tornado hit near the 2000 block of Van Buren Parkway. (Photo: Andrea Melendez/The News-Press)\n\nCape Coral: The National Weather Service confirmed that an EF-1 tornado touched down in northwest Cape Coral on Saturday morning. It was on the ground for about a mile, which would have lasted a few minutes. The tornado started at 6:45 a.m., according to the weather service. The Cape Coral Fire Department and other partnering agencies were working the scene in the Van Buren and Coral Oaks area, according to a fire department’s Facebook post. Debby Gonzales, who lives on Van Buren Parkway, said she heard a noise and got up screaming. The tornado took out her water system and tore down phone lines. Her roof was damagerd and her grill was moved into her pool. Officials don’t have a total number of houses affected by the tornado, but three homes are inhabitable, according to police Master Sgt. Patrick O’Grady said. There have been no reports of any injuries.\n\nGeorgia\n\nArmy Maj. Gen. Antonio Aguto, left, and Army accident investigator Michael Barksdale hold a news conference at Fort Stewart, Ga., about a training accident that killed three soldiers and injured three others. (Photo: Russ Bynum/AP)\n\nFort Stewart: The commanding general of the Army post where three soldiers died in a weekend training accident said their armored vehicle rolled off a bridge and was submerged upside down in a stream. Maj. Gen. Antonio Aguto struggled to hold back tears during a news conference at Fort Stewart on Monday as he announced the deaths of Sgt. 1st Class Bryan Jenkins of Gainesville, Florida; Pfc. Antonio Garcia of Peoria, Arizona; and Cpl. Thomas Walker of Conneaut, Ohio. Aguto said the soldiers were training in a Bradley fighting vehicle in darkness shortly before 3:30 a.m. Sunday. He gave no other details about the crash, citing an active investigation. Three other soldiers inside the vehicle suffered injuries that were not believed to be life-threatening.\n\nHawaii\n\nHonolulu: The city is considering setting limits on the number of surfing contests held on Oahu’s South Shore, officials said. The restrictions might be similar to those for North Shore surfing contests, which are limited to 16 per site between 8 a.m. and 4 p.m., The Honolulu Star-Advertiser reported Monday. Prospective changes would need to be presented in a public hearing, which could happen as early as summer 2020, said Nathan Serota, spokesman for the city Parks and Recreation Department. The frequency of South Shore surfing contests has drawn complaints. The most common concerns include limited space on the beach for events, equipment taking up too much space, event organizers monopolizing beach areas during events and the displacement of local surfers, Serota said. The goal of establishing limits would be to prevent local surfers from being frequently prevented access to their favorite areas. The South Shore was the site for seven events in Waikiki over 28 days in the fiscal year 2019, which ended June 30. Serota declined to provide the number of South Shore contests held in previous years.\n\nIdaho\n\nBoise: A panel of lawmakers is examining property tax options amid complaints that taxes are going up with rising property values, while also hearing on Monday concerns from cities and counties that they’re operating on tight budgets. The Property Tax Working Group took no action following a day of presentations, including from university and state financial experts. The group aims to make recommendations and perhaps offer legislation to the Legislature in January. The group is planning to meet again on Nov. 18. State officials said home values have increased sharply in recent years, though other factors are also involved in property taxes. Officials also said that just under a third of property taxes go to schools, followed by counties and then cities each using about 26%.\n\nIllinois\n\nSpringfield: A new area code is being added to the 217 territory in central Illinois. The area code will be 447. The Illinois Commerce Commission said new phone numbers with the new area code won’t start until after March 29, 2021. Current phone customers will keep 217. The 217 area code covers 36 counties in Illinois and includes Springfield, Champaign, Urbana, Decatur, Danville, Quincy and Rantoul.\n\nIndiana\n\nA school bus crashed into the side of a Cash America on the corner of 16th Street and North Emerson Ave. in Indianapolis. The accident involved a second vehicle and no injuries were reported. The predawn accident blocked traffic on northbound Emerson while crews worked to remove the bus from the building. (Photo: Robert Scheer/IndyStar)\n\nIndianapolis: Police said a school bus carrying about two dozen students crashed into a pawn shop, leaving most of the bus inside the business. Police said that no students were injured when the Indianapolis Public Schools bus plowed into the side of a Cash America Pawn store on Tuesday morning. The bus driver also wasn’t injured when it smashed into the brick building, leaving only the vehicle’s rear end visible outside. The bus was extracted from the building. IPS spokeswoman Carrie Black told WRTV-TV that 23 high school students were on the bus when it crashed about 7 a.m. Indianapolis police spokesman Officer Aaron Hamer said a car was also involved in the crash but officers are still investigating what led up to the bus crashing into the building.\n\nIowa\n\nPeosta: The city council has accepted the resignation of its mayor despite his request that they let him remain in office. The Telegraph Herald reported that Larry Mescher quit in an email sent Oct. 13 to the Peosta council members. It was sent just days after a contentious council meeting and follow-up work session on Oct. 11 regarding a proposed study on moving City Hall offices from Peosta Community Centre to the city’s new police station. On Oct. 15, however, Mescher sent another email, saying that in haste “and a bit of anger, I sent out an email that I resign. I would like to apologize and ask that you allow me to rescind my previous email.” On Monday night, the council said no. Council Member John Kraft said the city needed its leader to step up when the city hits tough times and then told Mescher, “Unfortunately, I feel you jumped ship.”\n\nKansas\n\nWichita: The National Agricultural Statistics Service reported Monday that winter wheat planting was 77% complete, near the five-year average for this time of year in Kansas. Nearly half had already emerged. Kansas farmers had also cut about 62% of their corn, along with 32% of the soybeans and 27% of their sorghum crops.\n\nKentucky\n\nOwingsville: The state Transportation Cabinet said a bridge-replacement project on Kentucky 1944 in northwest Bath County is expected to begin Monday over White Oak Creek just east of Cow Creek Road. The bridge and road will be closed for up to three weeks. The location is about 50 miles northeast of Lexington. Local traffic will be able to access locations up to the worksite, but through traffic should use Kentucky 36 and Kentucky 111 to detour. The cabinet said the work is part of a two-bridge project, including one on Kentucky 681 in Fleming County that was finished this summer. The work for both is being done through a $994,208 low-bid contract awarded to RGF Inc.\n\nLouisiana\n\nBaton Rouge: The state agriculture department said the destruction of two pieces of equipment at a logging site in Winn Parish has stalled work for a Natchitoches Parish logging business. Agriculture Commissioner Mike Strain said in a statement Monday that the logger faces a $16,000 repair bill for the equipment. The Winn Parish Sheriff’s Office and the agriculture department’s enforcement agents are seeking assistance from the public in finding those responsible. Strain’s office said the Louisiana Forestry Association is offering up to a $2,000 reward to anyone who provides information that leads to an arrest and conviction of whoever is responsible for damaging equipment at the logging site.\n\nMaine\n\nEllsworth: Maine is holding lotteries for licenses to participate in one of the most lucrative fisheries in the state, which is home to a near-shore scallop fishery that was worth about $6 million last year. The volume of the fishery is much smaller than Maine’s famous lobster fishery, but the scallops are typically worth more to fishermen on a per-pound basis. The Maine Department of Marine Resources said there will be two license lotteries. One will be for six licenses to operate a drag boat for scallops and the other will be for four licenses to dive for scallops. Most scallops in the state are harvested via boat. The state said the lottery applications are open now and will remain open until 4:30 p.m. on Nov. 8.\n\nMaryland\n\nBaltimore: Federal officials said they’re close to breaking a record for the number of guns they have seized this year at the Baltimore/Washington International Thurgood Marshall Airport. The Transportation Security Administration said in a statement Tuesday that they have caught 26 guns at BWI’s checkpoints. The number ties the record set in 2017. The TSA said “it is highly likely” the record will be broken before 2019 ends. Officials said the 26th gun caught this year was spotted Saturday. An Annapolis, Maryland, man had a 9-mm handgun loaded with 15 bullets in his carry-on bag. He said he forgot he had it. The TSA said the unidentified man was arrested on weapons charges. The agency said that 4,239 firearms were discovered in carry-on bags across the nation last year.\n\nMassachusetts\n\nMusic artist and actress Queen Latifah applauds during ceremonies at Harvard University, which awarded her and six others the W.E.B. Dubois Medal for contributions to black history and culture. (Photo: Elise Amendola/AP)\n\nCambridge: Harvard awarded the W.E.B. Du Bois Medal to Queen Latifah and six other recipients on Tuesday, according to the Cambridge, Massachusetts, school’s Hutchins Center for African and African American Research The honorees are being recognized for their contributions to black history and culture. Other honorees include poet and educator Elizabeth Alexander, Secretary of the Smithsonian Institution Lonnie Bunch III, poet Rita Dove, co-founder of Black Entertainment Television Sheila Johnson, artist Kerry James Marshall and Robert Smith, founder, chairman and chief executive of Vista Equity Partners. The award is named after Du Bois, a scholar, writer, editor and civil rights pioneer who became the first black student to earn a doctorate from Harvard in 1895.\n\nMichigan\n\nFlint: Mott Community College officials said bedbug-infested chairs have been removed from a student lounge. The college said the chairs were removed for treatment to kill the insects after they were found Thursday on the chairs in the Mott Memorial Building’s student lounge. MLive.com reported that the bedbug finds on the campus follows the discovery of bedbugs earlier this month in a high school classroom in the Carman-Ainsworth Community Schools, which is also in Genesee County. The U.S. Environmental Protection Agency, Centers for Disease Control and Prevention and the U.S. Department of Agriculture consider bedbugs a public health pest. But unlike most public health pests, bedbugs are not known to transmit or spread disease.\n\nMinnesota\n\nSt. Paul: The Minnesota Department of Natural Resources said a huge muskie caught on Lake Vermilion is a catch-and-release record. The DNR said Monday the 57¼-inch muskie weighed about 47 pounds and was caught by Corey Kitzmann in August. The previous record was just short of 57 inches and was caught on Pelican Lake in Otter Tail County in 2016. Kitzmann said when he set the hook, he knew immediately he had a good-sized fish, but it wasn’t until the fish made its way to the side of his boat that he realized he had “a true giant.” Minnesota Public Radio News said a nearby boater helped him haul the muskie into his boat.\n\nMississippi\n\nA monument honoring the victims of a plane crash that killed Lynyrd Skynyrd founder/frontman Ronnie Van Zant and five others was unveiled in Gillsburg, Miss., on Sunday, the 42nd anniversary of the tragedy. (Photo: Matt Williamson/Enterprise Journal)\n\nGillsburg: A 15,000-pound monument made of black granite built to honor victims of a plane crash that took the lives of Lynyrd Skynyrd founder and lead singer Ronnie Van Zant and five others was unveiled Sunday, the 42nd anniversary of the tragedy. The monument is located about 400 yards from the crash site, which is difficult to navigate because of trees, vines and marsh. The memorial sits on land donated by Dwain and Lola Easley on Easley Road, just off Hwy. 568. Dwain Easley was one of the rescuers that night. Judy Van Zant-Jenness, Ronnie Van Zant’s widow, held sway over the crowd of 1,000 that included five of the 20 crash survivors: former drum technician Marc Frank, security guard Gene Odem, lighting techs Steve Lawler and Mark Howard and stage and sound tech Paul Welch. Besides Ronnie Van Zant, guitarist/vocalist Steve Gaines, backing vocalist Cassie Gaines, assistant road manager Dean Kilpatrick and pilots Walter McCreary and William Gray died in the crash.\n\nMissouri\n\nRepublic: A man broke state records for the heaviest and second-heaviest pumpkins. KMBC-TV reported that the 1,798-pound and 1,677-pound giants that Richard Bottorf entered into the Republic Pumpkin Daze weigh more combined than a compact car. Bottorf carved the smaller pumpkin after it was weighed earlier this month. The larger one will be on display Wednesday at an elementary school in Harrisonville. Bottorf has a history of breaking records. In 2017, he grew a 1,563-pound pumpkin that beat the state record by more than 300 pounds. The Guinness World Records said the largest-pumpkin weighed 2,624 pounds and was grown in Belgium in 2016.\n\nMontana\n\nGreat Falls: The U.S. Department of Justice has awarded $2.9 million to four tribes in Montana, to improve public safety, serve victims of crime, combat violence against women and support youth programs in their communities. The Chippewa Cree Tribe of the Rocky Boy’s Reservation received $250,000, the Confederated Salish and Kootenai Tribes on of the Flathead Reservation received $488,049, the Assiniboine and Sioux Tribes of the Fort Peck Reservation received $1,714,489 and the Northern Cheyenne Tribe received $450,000. A portion of the funding will support tribal youth mentoring and intervention services, help native communities implement requirements of the Sex Offender Registration and Notification Act and provide training and technical assistance to tribal communities.\n\nNebraska\n\nSouth Bend: Work is expected to begin this winter on a pedestrian-bicycle bridge over the Platte River southwest of Omaha that was battered during flooding earlier this year. The Lied Platte River Bridge near South Bend has been closed since March. Trees flattened a few hundred feet of bridge railing and damaged concrete ice breakers on the upstream side. In addition, the floodwaters left sand atop thousands of feet of the MoPac Trail, running on the east side of the Platte to the trail parking lot along Nebraska Highway 31. The bridge and trail closures created a disconnect for the annual Market to Market Relay race from Omaha to Lincoln earlier this month. The runners had to be loaded into vans and driven across the Platte before resuming the race. The bridge is owned by the Papio-Missouri River and Lower Platte South natural resources districts, and they’ve approved a first step toward reopening it by hiring a contractor to clear away the debris. The hope is that any needed bridge repairs will be completed next year. The work on the sand-buried trail remains problematical.\n\nNevada\n\nReno: A whooping cough outbreak has prompted the closure of a private high school until next week. The Washoe County Health District said it has confirmed four cases of whooping cough at Bishop Manogue High School and additional cases are listed as probable. District officials said the Catholic school is cooperating with an investigation into the highly-contagious respiratory disease and agreed to close the school until Monday to protect students and staff. District Health Officer Kevin Dick said late Monday the outbreak is “very serious.” He said it underscores why all students are required to be vaccinated for the disease, which is called “pertussis” and is known for uncontrollable, violent coughing that makes it hard to breathe. Washoe County School District officials said no other cases have been confirmed at any other schools in the Reno-Sparks area.\n\nNew Hampshire\n\nSugar Hill: Members of St. Matthew’s Chapel said they discovered a time capsule from 1893 in the church’s foundation. The Caledonian-Record reported a metal box was discovered chiseled into the cornerstone of the church. The chapel is being temporarily relocated a few dozen feet away so its foundation can be stabilized. The team tasked with moving the building found the box. Inside the box, chapel members found a newspaper clipping from August 1893, when the church was built, as well as five coins and a prayer book or small Bible. Church member Betsy Holcombe said they plan to take the book to a book conservator to see if it can be salvaged.\n\nNew Jersey\n\nCommercial fishing boats are docked in Atlantic City, N.J. On Tuesday, a conference at Monmouth University in West Long Branch, N.J. examined growing competition for space on the ocean by users including the fishing, shipping, wind energy industries and conservationists. (Photo: Wayne Parry/AP)\n\nWest Long Branch: A conference on Tuesday at Monmouth University brought together industry and environmental groups who agreed that communication and coordination are essential to sharing the ocean. Bradley Campbell, president of the New-England-based Conservation Law Foundation, and New Jersey’s former environmental protection commissioner, said shipping lanes that were altered to protect endangered right whales need to be changed again now that the animals are migrating. Orsted, a wind energy company, said it has to coordinate closely with fishing and onshore communities before building its offshore turbines.\n\nNew Mexico\n\nTown: A beer named after the AMC-TV hit series “Breaking Bad” and brewed by an actor from the show sold out after its debut. KOB-TV reported “Breaking Bad” fans lined up at three Albuquerque Costcos, but the brew was gone within three hours. Dean Norris, who played a DEA agent in the series, started to brew German lager, Schraderbräu, following the premiere of Netflix’s “El Camino: A Breaking Bad Movie” earlier this month. Norris said he will launch the beer nationwide soon. “Breaking Bad” follows an Albuquerque high school chemistry teacher turned meth lord, Walter White, played by Bryan Cranston. The series ran from 2008 to 2013.\n\nNew York\n\nAlbany: Insurance companies must ensure that patients don’t face higher out-of-pocket costs when receiving emergency care under a new state law. Democratic Gov. Andrew Cuomo recently signed the legislation. He said it’s ridiculous to expect someone facing a life-or-death situation to check if a hospital is part of their insurance network. The law also said hospital charges for emergency services are subject to an independent dispute resolution process. Cuomo in his Oct. 17 announcement said the bill went into effect immediately.\n\nNorth Carolina\n\nWinston-Salem: The city has voted to change the name of its annual Dixie Classic Fair. News outlets reported the Winston-Salem City Council voted Monday night to change the name to the “Carolina Classic Fair” starting in 2020. Community members had said the previous name was divisive. The fair has been an annual tradition for more than 130 years. Councilmember D.D. Adams suggested the fair’s name be changed to Carolina Classic. She said Winston-Salem used to have two segregated fairs: “The Carolina Colored Fair” and “The Dixie Classic Fair.” She said the new name combines the old ones. The name change is expected to cost $97,000. The money will be used to replace signs and order new banners.\n\nNorth Dakota\n\nDucks fly from a water-covered cornfield south of Mandan, N.D., on Monday. North Dakota Gov. Doug Burgum declared a statewide flood emergency and said officials were looking at other measures to help residents affected by heavy rains and a blizzard that dumped record amounts of snow in some places, especially farms. (Photo: Tom Stromme/The Bismarck Tribune via AP)\n\nFargo: Gov. Doug Burgum on Monday declared a statewide flood emergency and said officials were looking at other measures to help residents affected by heavy rains and a blizzard that dumped record amounts of snow in some places, especially farmers. Burgum’s order cleared the way for the state to request federal funding and other help. The cities of Grand Forks, Jamestown, LaMoure and Valley City had requested emergency aid, as had the counties of Barnes, Cavalier, Grand Forks, LaMoure, Stutsman, Traill, Walsh and Wells. Burgum and Agriculture Commissioner Doug Goehring toured the state Monday to talk with rural and urban residents about the potentially devastating effects of the unusually wet weather and to share information about the state’s response. Burgum said that could include requests for a USDA secretarial disaster designation and a presidential disaster declaration.\n\nOhio\n\nPiketon: A private company will test schools and homes near a former uranium enrichment plant for radiological contaminants after trace amounts of enriched uranium were found at a nearby middle school over the summer. Pike County officials said North Canton-based Solutient Technologies will test schools, public and private properties and state waters in the Piketon area within a 6-mile radius from the center of the former Portsmouth Gaseous Diffusion Plant. Students from Scioto Valley Local School District’s Zahn’s Corner Middle School were relocated to other schools in the district after the trace amounts of contaminants were found there. The U.S. Department of Energy said its tests found levels of radioactivity that aren’t above naturally occurring levels, but it agreed to fund independent, third-party testing of the area.\n\nOklahoma\n\nOklahoma City: Thousands of illegal cellphones are making it into the hands of prison inmates who use the devices to commit crimes, but prison officials testified Monday that they’re prohibited from using one of the best tools to stop it – jamming technology. Prison officials from Oklahoma and South Carolina testified about the effectiveness of cellphone-jamming technology before an Oklahoma Senate committee. Federal law bans the use of such technology by state agencies, and it is opposed by the wireless industry. Oklahoma seized more than 5,200 contraband cellphones from inmates last year. Although that’s a decline from about 7,500 seized a year earlier, the problem remains a major one, said Mike Carpenter, chief of security for the Oklahoma Department of Corrections. Carpenter said a fight between rival gangs at an Oklahoma prison last month quickly escalated through the use of contraband cellphones into melees at several other prisons. One inmate was killed and more than a dozen were wounded. The wireless industry opposes the use of cellphone-jamming technology inside prisons, mostly because of concerns that it would also block signals for legitimate users, said Gerard Keegan, a spokesman for the Cellular Telecommunications and Internet Association. Federal legislation to allow states to use jamming technology is pending in the House and Senate.\n\nOregon\n\nCorvallis: Oregon State University has announced plans to immediately reinstitute an abandoned 2005 management plan for its McDonald-Dunn research forest outside Corvallis, a sign of continued fallout from criticism of the school for clear-cutting a stand of ancient trees that included a 420-year-old giant. The Oregonian/OregonLive reported the leader of the university’s college of forestry also said he would add 36 acres of nearby old growth to protected reserves. Those trees were going to be cut until the furor erupted this summer over the old-growth clearcut, a 16-acre harvest known as the No Vacancy cut. The university had already paused logging of trees older than 160 years. In his Monday letter to the forestry school’s community, Anthony Davis, the interim dean, said the college’s decision-making around the management of the McDonald-Dunn “has impaired our ability to lead by example, something that is a reasonable expectation of us, and we should expect of ourselves.”His letter comes just more than a month before top state leaders are scheduled to discuss what role Oregon State’s forestry school should have in controlling the 82,500-acre Elliott State Forest, a transfer that would quintuple Oregon State’s forest holdings.\n\nPennsylvania\n\nPittsburgh: President Donald Trump’s visit to Pittsburgh on Wednesday will close roads and a dozen schools. Police Chief Scott Schubert is advising residents and employees to leave early, work from home if they can and expect heavier than usual traffic. The president on Wednesday will speak at an annual natural gas industry conference. Trump’s motorcade also is expected to disrupt traffic near Pittsburgh’s airport. Streets will reopen on a staggered basis after Trump leaves. A dozen schools are closing because of the traffic disruptions and the city schools have canceled all athletic events. Trump was the first Republican presidential candidate since 1988 to win Pennsylvania, and the state is important to his re-election campaign.\n\nRhode Island\n\nProvidence: The Providence Journal reported that the Rhode Island Historical Preservation & Heritage Commission said it made a mistake in determining a hunting lodge in Richmond does not meet qualifications for inclusion on the National Register of Historic Places. The Department of Environmental Management, which inherited the lodge and the surrounding 1,825-acre nature preserve from stockbroker Theakston de Coppet, announced plans earlier this month to tear it down. Commission Director J. Paul Loether said the mistake will require an additional review process, though it doesn’t necessarily mean the state can’t demolish the structure. State officials said de Coppet’s will focuses on the preserve and doesn’t mention the lodge, and restoring it would cost millions.\n\nSouth Carolina\n\nCharleston: Charleston County said it is sending its recyclable material to a facility that separates garbage from salvageable material and turns irrecoverable waste into fuel pellets. News outlets reported the county announced Friday that it will start paying Berkeley County about $40 a ton to transport recyclable material to RePower South facility, a mixed-waste factory. Charleston County’s recycling facility on Romney Street has had issues. In June, machinery problems caused recyclables to be sent to a landfill. County spokesman Shawn said says Romney Street is too small to handle Charleston waste and sending recyclables to RePower is a fix until the county’s 2020 opening of a $24 million recycling center. The Post and Courier said the county decided to build the recycling center in 2013\n\nSouth Dakota\n\nAberdeen: Officials said a small plane missing for nearly two weeks has been found crashed near Aberdeen. There was no immediate word on the pilot of the Cessna 172, the only one on board. Brown County Chief Deputy Dave Lunzman said Tuesday a hunter found the wreckage about 3 miles north of Aberdeen on Monday night. Lunzman said adverse weather conditions prevented deputies from reaching the wreckage late Monday, but they were expected to get tehre Tuesday. The plane departed Aberdeen Regional Airport for Oakes, North Dakota, on Oct. 9 but never arrived. The Civil Air Patrol has helped local officials from South Dakota and North Dakota to search for the missing plane. The National Transportation Safety Board tweeted Tuesday it would investigate the crash.\n\nTennessee\n\nCaryville: The U.S. Department of Agriculture said more than 6,000 pounds of frozen sausage patties manufactured by George’s Prepared Foods have been recalled over concerns they might be contaminated with salmonella. A Food Safety and Inspection Service statement released Friday said the ready-to-eat pork and turkey sausage products were made by the Caryville company. News outlets reported they were sold under the “Great Value” brand name and shipped nationwide. The agency’s statement doesn’t say how or where the potential contamination was discovered. Officials said there haven’t been any adverse reactions reported. But the agency did label the health risk high, and advised that salmonella can cause an infection accompanied by abdominal cramps and fevers, among other symptoms.\n\nTexas\n\nSarita: U.S. Border Patrol agents seized more than $4 million worth of drugs at a checkpoint last Thursday. Kingsville agents working at the Javier Vega Jr. checkpoint referred a sports utility vehicle for a secondary inspection after a K-9 alert, and discovered multiple bundles of methamphetamine hidden within the vehicle, said a release. The narcotics, weighing 75 pounds, were estimated to be worth $2.4 million. On Sunday, Falfurrias agents working at the same checkpoint referred a pickup truck for a secondary inspection after another K-9 alert. Agents discovered bundles of cocaine throughout the vehicle, weighing nearly 62 pounds total and estimated to be worth $1.9 million. Border Patrol has referred both cases to the Drug Enforcement Administration.\n\nUtah\n\nLogan: A power company replaced three ceramic insulators during an unplanned outage. The Herald Journal reported Monday that Hyrum Light & Power believed the insulators were damaged by someone shooting at them. Company authorities said the power outage was caused when a Rocky Mountain powerline went down Friday affecting the south of Cache Valley last week. Authorities said about 3,000 customers were without power for about 5 hours in Hyrum, Wellsville and Mendon. Authorities said the insulators cost about $250 each, not including labor fees. Authorities said it takes workers about 3 hours to replace the insulators on the live 46,000-volt line. Company authorities said any outage is costly for city residences and businesses, including planned maintenance outages.\n\nVermont\n\nSt. Albans: People are being allowed back into an industrial complex after firefighters ventilated a building because of a hydrogen leak. Reports said St. Albans fire crews were called to Superior Technical Ceramics in the town’s industrial park just before 6 a.m. Tuesday. Officials said kilns at the facility use hydrogen and for some unknown reason levels spiked. Fire crews evacuated the building and checked on area residents before ventilating the structure. St. Albans Town Fire Chief Harold Cross said they had to ventilate several areas in the building, but once the hydrogen is outside, it goes up into the atmosphere and dissipates. Just the one building was evacuated. There was no danger to schools and no injuries were reported\n\nVirginia\n\nSt. Paul: The Bristol Herald Courier reported Tuesday that three Amazon executives visited parts of western Virginia on what Gov. Ralph Northam characterized as a listening tour to become familiar with the area’s assets. Educators, business leaders and economic developers are eager to convince Amazon to consider investing in places outside the Crystal City-Arlington area. That’s where the company is building a second headquarters that will employ about 25,000 workers. Northam praised western Virginia’s educational assets, from its public schools to community colleges and a satellite campus of the University of Virginia. He predicted that Amazon would be interested in “working with all parts of Virginia.”\n\nWashington\n\nSedro-Woolley: Students at Sedro-Woolley High School are building and using aerial drones in a high-tech extension of traditional math studies. The Skagit Valley Herald reported that students in an advanced algebra class are using RubiQ-brand drones to chart distance, speed and create graphs. The students also work in small groups to assemble the drones before learning to fly them and collect data needed to complete their algebra assignments. Kathy Chace and Jason Dilley teach the new class, which is part of series of courses offered at the high school incorporating the real world with principles of STEM, short for science, technology, engineering, and math. Dilley said students who complete the class will earn a career and technical education credit, as well as a math credit.\n\nWest Virginia\n\nMorgantown: A spokesman for West Virginia University said a campus building was evacuated after a student’s chemical lab experiment went awry. WVU spokesman John Bolt said students, faculty and staff in the engineering research building on the Evansdale campus were ordered out Tuesday. No injuries were reported. Bolt said WVU issued an alert by text message. Drivers of vehicles in a parking area also were ordered to move them. No other buildings were affected. Bolt said police and fire crews helped remove some materials from the research building as a precaution. He said the building is expected to reopen Wednesday.\n\nWisconsin\n\nMadison: University of Wisconsin researchers are trying to persuade legislators to approve a bill that would fund their efforts to locate the remains of missing Wisconsin soldiers and bring them home. The bill would allow the UW-Madison Missing-In-Action Recovery and Identification Project to seek $360,000 in state tax dollars over the 2019-2021 biennium to find missing soldiers from Wisconsin. Currently, federal defense officials give the project assignments and fund its efforts. Charles Konsitzke, the project’s founder, told the state Senate’s military affairs committee during a hearing on the bill Tuesday that about 1,500 soldiers from Wisconsin are missing in action and the bill would enable the project to look for them independently of federal assignment.\n\nWyoming\n\nCasper: Power Company of Wyoming has moved a step closer to clearing a final environmental requirement for its massive Chokecherry and Sierra Madre Wind Energy Project in Carbon County. The Casper Star-Tribune reported that the Bureau of Land Management recently released the third environmental assessment of the wind farm for public comment. The agency concluded in its study that the planned wind farm will have no new significant impacts on the “human environment” beyond what is outlined in a 2012 environmental impact statement. Power Company of Wyoming first began applying for state and federal permissions in 2008. Company spokeswoman Kara Choquette said the latest study will complete the BLM federal environmental analysis of the project. The wind farm south of Rawlins is expected to include up to 1,000 wind turbines.\n\nRead or Share this story: https://www.usatoday.com/story/news/50-states/2019/10/23/lynyrd-skynyrd-breaking-bad-beer-cheetahs-record-muskie-news-around-states/40382169/", "description": "Hawaii city to curb surfing events, Missouri man grows record-size pumpkins, and more", "authors": ["Usa Today Network", "Wire Reports", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/8c005baa64b202cf91646379d5b536707b764d45/c=0-120-1280-840/local/-/media/2019/10/23/USATODAY/usatsports/B9338230091Z.1_20191023001136_000_G8GPHM4QR.3-0.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-23"}