{"pub": "independent", "url": "https://independent.co.uk/sport/golf/solheim-cup-2019-suzann-pettersen-latest-results-anne-van-dam-a9104891.html", "downloaded_at": "2019-09-13 19:20:27.198266+00:00", "title": "Suzann Pettersen pays tribute to 'rock star' Anne Van Dam after silencing critics", "language": "en", "text": "Suzann Pettersen justified her controversial selection and silenced Danielle Kang into the bargain as Europe had to settle for a slender lead after the opening day of the 16th Solheim Cup.\n\nPettersen had played just twice since November 2017 when she was handed a wild card by captain Catriona Matthew, since when she finished 59th in the CP Women’s Open and missed the cut in the Cambia Portland Classic.\n\nHowever, the 38-year-old Norwegian produced the goods when it mattered as she partnered rookie Anne Van Dam to a 4&2 victory over Kang and Lizette Salas before a dramatic climax to the afternoon fourballs.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nAfter Anna Nordqvist and Caroline Hedwall suffered a record-equalling 7&5 loss to Ally McDonald and Angel Yin, Carlota Ciganda and Bronte Law fought back from two down with four to play to take the lead up the 18th against Lexi Thompson and Jessica Korda, only for Thompson to make birdie and snatch half a point.\n\nAnd there was more disappointment for the home side in the final match as Charley Hull and Azahara Munoz were unable to convert a four-hole lead with six to play against Nelly Korda and Brittany Altomare, who birdied five of the holes and saw Korda almost make a hole-in-one on the 17th.\n\nKang had caused controversy earlier in the week after her comments to the Drop Zone podcast in which she outlined her approach to the Solheim Cup.\n\n“You’re trying to take souls, you know,” Kang said. “You’re going there to make people cry at this point, just crush the other team.”\n\nPettersen’s response of “we’re just going to step on their necks” was said with a smile and the two-time major winner had more reasons to be cheerful after dovetailing superbly with the big-hitting Van Dam.\n\n“I just want to say I have the best partner in the world,” Pettersen said. “Today I felt a bit like Seve (Ballesteros), I was left and right and everywhere. But when you have a superstar partner like this who just bombs it, you just have to be very happy.\n\n“I mean, this girl I think is the best golfer I’ve ever seen on the women’s side. And today she just was absolutely a rock star.”\n\nVan Dam added: “I was so relaxed. Standing on the first tee Suzann told me, ‘Just enjoy this experience’, and that’s what I did. I saw so many of my family and friends, hit a good drive and good iron shot and I was just rolling after that.”\n\nIn the morning foursomes, Caroline Masson and Jodi Ewart Shadoff were thrashed 6&4 by sisters Jessica and Nelly Korda before the home side fought back with victories from Georgia Hall and Celine Boutier and Hull and Munoz.\n\nThe first match between Ciganda and Law and Morgan Pressel and Marina Alex was halved to leave the contest finely poised ahead of the afternoon fourballs, with the four players on each side who sat out the morning session getting their first taste of the action.\n\nPA", "description": "Suzann Pettersen justified her controversial selection and silenced Danielle Kang into the bargain as Europe had to settle for a slender lead after the opening day of the 16th Solheim Cup. Pettersen had played just twice since November 2017 when she was handed a wild card by captain Catriona Matthew, since when she finished 59th in the CP Women’s Open and missed the cut in the", "authors": ["Phil Casey"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/13/19/suzann-pettersen.jpg", "published_at": "2019-09-13"}