{"pub": "yahoo", "url": "https://sports.yahoo.com/brown-says-focus-football-addresses-222417008.html", "downloaded_at": "2019-09-21 15:49:14.304520+00:00", "title": "Brown says his focus is on football as he addresses media for first time as a Patriot", "language": "en", "text": "Antonio Brown said his focus was on football as he spoke to the media on Thursday for the first time since he was accused of sexual assault in a civil lawsuit.\n\nBrown was accused by his former trainer Britney Taylor of sexual assault and rape, while a second unnamed woman has also made allegations of sexual misconduct against the New England Patriots wide receiver.\n\nBrown has strongly denied the allegations through his attorney and the 31-year-old opted against discussing the matter further when he was questioned on his continued availability for NFL action.\n\nScroll to continue with content Ad\n\nSpeaking to reporters in the Patriots locker room, Brown said: \"I appreciate that question. I'm just here to focus on ball and [I] look forward to getting out there in the home stadium and being with the team.\"\n\nAsked about \"everything else going on in his life,\" he stated: \"It's football. I'm grateful to play football. Every time you walk in the doors here you [have to] be your best for the team so every time I walk in here I just want to make sure I'm prepared.\"\n\nBrown, who skipped the postgame media session after his debut against the Miami Dolphins on Sunday, also expressed his gratitude at being given an opportunity by the Patriots following his tumultuous off-season with the Oakland Raiders.\n\n\"I'm just super grateful to be here, thankful for Bill Belichick and Tom Brady,\" Brown said. \"I've got a lot of offense to learn and catch up but I'm excited and grateful to be here.\"\n\n\"It's been a tremendous honour [to play with Brady],\" Brown added. \"He's been here a long time, a lot of details, a lot of work ethic. He's a great guy to be around, just inspires everyone here.\"", "description": "Speaking to reporters for the first time as a Patriot, Antonio Brown said: \"I'm just here to focus on ball. I'm grateful to play football.\"", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/L41TqBRL9eAxeipQ65C5ew--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/v_WRjTjZ1cGCLa8qshoV6g--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-GB/homerun/omnisport.uk/33b11ec379a77d796b5ae202da435e92", "published_at": "2019-09-19"}