{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nfl/2019/10/13/steelers-conner-scores-2-tds-hodges-wins-first-start/40314071", "downloaded_at": "2019-10-14 03:48:10.892316+00:00", "title": "Steelers' Conner scores 2 TDs, Hodges wins first start", "language": "en", "text": "CLOSE\n\nCARSON, Calif. (AP) — James Conner scored two touchdowns, Devin Bush recovered a pair of turnovers and Devlin Hodges won his first NFL start as the Pittsburgh Steelers held off the Los Angeles Chargers 24-17 on Sunday night.\n\nConner had his first game with both a rushing and receiving touchdown and accounted for 119 scrimmage yards (41 rushing, 78 receiving).\n\nHodges, who was elevated into the starting spot after Mason Rudolph suffered a concussion last week against Baltimore, didn't look fazed. He completed 15 of 20 for 132 yards and benefited from a running game that helped control the clock. Benny Snell led the way with 75 yards on 17 carries.\n\nBush forced turnovers on the Chargers second and third drives. The rookie linebacker scored his first NFL touchdown when he scooped up a backward pass from Philip Rivers that Melvin Gordon was unable to handle and went 9 yards to give the Steelers a 7-0 lead\n\nBush got his second turnover four plays later when he intercepted a Rivers' pass that was deflected by defensive end Tyson Alualu at the line of scrimmage. That would lead to Conner's first TD.\n\nThe Chargers (2-4) trailed 24-0 after three quarters but rallied to get within seven on a Chase McLaughlin field goal and two TD passes from Rivers to Hunter Henry.\n\nAfter Henry's 11-yard TD catch made it 24-17, Los Angeles tried an onside kick with 1:28 remaining but it was recovered by Steelers. The Chargers forced a three-and-out and got the ball at the 1 after a punt, but Rivers was picked off by Cameron Sutton to preserve the Steelers win to improve to 2-4.\n\nRivers was 26 of 44 for300 yards with two touchdowns and two interceptions while Henry, who missed the past four games due to a knee injury, had eight receptions for 100 yards.\n\nConner gave the Steelers a 14-0 lead with 4:39 remaining in the first quarter with a 12-yard run around left end on a nice block from left tackle Alejandro Villanueva.\n\nConner put Pittsburgh up by three touchdowns with 6:34 remaining in the second when he caught a short pass from Hodges and went 26 yards up the right sideline after Chargers linebacker Jatavis Brown was unable to tackle the third-year running back at the 25.\n\nLos Angeles didn't get on the board until one minute into the fourth quarter on Chase McLaughlin's 38-yard field goal. Rivers ended the offense's seven-quarter drought without a touchdown when he found Hunter Henry in the back of the end zone from 5 yards out with 7:13 remaining.\n\nIMMEDIATE FORCE\n\nBush has been involved in six of the 14 turnovers the Steelers have forced. He has had an interception two straight weeks and leads the NFL with four fumble recoveries. He is the first Steelers' linebacker to return a fumble for a touchdown since L.J. Fort last season against Atlanta.\n\nSTILL IN NEUTRAL\n\nLos Angeles' running game struggled again as Melvin Gordon and Austin Ekeler were held to 13 carries for 32 yards.\n\nBACK TO BACK BLANKS\n\nThis is only the second time in Rivers' career the Chargers have failed to score points in the first half in two straight games. The last time it happened was the first two weeks of the 2007 season.\n\nLos Angeles' best chance to score in the first half came on its final possession. Rivers connected with Mike Williams three times for 48 yards as the Chargers drove to the Steelers 25, but Chase McLaughlin's 43-yard field-goal attempt hit the left upright with 32 seconds remaining.\n\nIt is also the first time in 44 years that the Chargers have been blanked in consecutive home games.\n\nUP NEXT\n\nSteelers have their bye week before hosting Miami in a Monday night game on Oct. 28.\n\nChargers travel to Tennessee next Sunday to start a stretch of three of their next four on the road.\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nCopyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "James Conner scored two touchdowns, Devin Bush recovered a pair of turnovers and Devlin Hodges won his first NFL start as the Pittsburgh Steelers held off the Los Angeles Chargers 24-17 on Sunday night", "authors": ["Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/07423467a1930f7751dd50f618a6859d55aec700/c=0-264-5073-3118/local/-/media/2019/10/13/USATODAY/usatsports/b009ea4712844059ba91464449a4cc46.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-13"}