{"pub": "businessinsider", "url": "https://businessinsider.com/the-hwood-group-accused-of-letting-celebrities-drink-underage-2019-10", "downloaded_at": "2019-10-11 20:22:39.677727+00:00", "title": "Drake's favorite restaurant is known to let underage celebrities drink alcohol there", "language": "en", "text": "Multiple former workers for LA nightlife business The H.Wood Group told Insider that minors are regularly allowed to drink underage at the company's venues.\n\nInsider learned about the underage drinking while reporting on an assault that happened outside of one of The H.Wood Group's restaurants, Delilah, last year.\n\nVisit Insider's homepage for more stories.\n\nAn LA nightlife business popular with celebrities has been accused of letting minors, including members of the young Hollywood set, drink underage.\n\nInsider began reporting on The H.Wood Group when it learned a former server sued the company after he was brutally beaten right outside of one of their restaurants, Delilah, in March 2018. Drake was also named in the suit, which included assault and related claims. Bennett Sipes, the former server, alleged the rapper directed his private security detail to carry out the attack.\n\nKylie Jenner arriving at Delilah for her sister Kendall's 21st birthday in November 2016. The youngest Jenner was 19 years old at the time. Splash News\n\nWhen we started looking into the company, we learned of accusations that celebrities are allowed to run wild at H.Wood properties.\n\nAs part of these claims, we heard that their clubs, restaurants, and bars have attracted a particular set of young Hollywood types looking for a place to drink underage.\n\nDespite the fact that many of their restaurants and clubs have a no-camera policy, on one occasion there are pictures backing this up. In 2014, TMZ published photos showing Justin Bieber drinking beer at one of H.Wood's clubs, Bootsy Bellows. The outlet speculated at the time that the photo could \"put the hottest nightclub in Hollywood in jeopardy,\" but it doesn't appear that the club was ever cited for the incident, according to California Department of Alcoholic Beverage Control records obtained by Insider.\n\nSeveral former employees we spoke to said underage drinking is a regular occurrence at H.Wood properties, especially among the famous clientele. Some gave specific examples, such as Kylie Jenner and Chloe Grace Moretz (representatives for both the reality star and actress did not respond to Insider's request for comment.)\n\nServing minors in the state of California is a crime that carries a fine of $2,500, and multiple workers said they were afraid of getting caught. But when concerns were taken to management, former employees told Insider they were told to break the law anyway.\n\n\"You're not allowed to ask questions. If they're in there, you have to serve them,\" one former Delilah worker told us.\n\nTwo former Delilah servers said some famous teens drank in the private dining room, a smaller room in the restaurant that could be booked out for special events. One former server described the teen daughters of an actor and reality star brazenly ordering tequila during an event in this room one night.\n\nRead more: Drake and a night of violence: How one LA nightclub business allows its employees to be vulnerable to mistreatment by celebrities\n\n\"They would put 18-year-old birthday parties in the backroom for bottle service,\" another former employee said.\n\nBoth of these servers said that they complained to management about the minors ordering alcohol, but were told to serve them anyway.\n\n\"You'd go up to them and be like, 'I know they're not old enough' and they'd be like 'Don't worry about it, we'll take care it,'\" one of the servers said. The private dining room at Delilah, where two employees said they witnessed teen celebrities drinking underage. Rachel Murray/Getty\n\nAnother server echoed this, saying a manager gave him \"permission\" to break the law and promised to \"take the blame\" if he got caught. He said he felt \"pushed\" to serve minors.\n\n\"I didn't really have much of a choice, I guess,\" he said.\n\nIt was the same story at The Nice Guy, H.Wood's super-exclusive Italian restaurant. One former server said that whenever an underage celebrity sat in her section and ordered alcohol, she would have another server take the drink to their table. She said she believed this meant she wouldn't risk the possibility of being fined.\n\nIt isn't illegal for minors to be inside Delilah or The Nice Guy, since both are licensed as restaurants. But ask anyone who has been to Delilah late at night, and they'll tell you that the live DJ and dancers make it decidedly unlike, say, a Cheesecake Factory. H.Wood Group co-founders John Terzian, left, and Brian Toll, right, attending a party in July 2017. Tasia Wells/Getty Images\n\nAt the Peppermint Club, former workers said that people were ID'd at the door, so they didn't often ask for ID again once they ordered drinks inside the club. But it was a flawed system, and one former bartender said that sometimes groups could get around showing their ID to the bouncer if they came in with a promoter. He said the patrons looked so young sometimes that he asked for ID again anyway.\n\n\"There's definitely been times where I was like, if this person's 21, then I'm Bob Saget,\" he recalled.\n\nDespite the many workers who admitted to serving minors at H.Wood clubs and restaurants, the company has only been cited once, according to the documents obtained by Insider. Blind Dragon, a karaoke bar owned by H.Wood, was cited once in August 2016. Their liquor license is still active.\n\nThe H.Wood Group declined to comment on this story, through their PR firm EMC Bowery.", "description": "Multiple former workers for The H.Wood Group said they felt pressure from management to serve alcohol to underage celebrities at the company's venues.", "authors": ["Ashley Collman"], "top_image": "https://image.businessinsider.com/5da0c83be94e86361e069db8?width=1200&format=jpeg", "published_at": "2019-10-11"}