{"pub": "independent", "url": "https://independent.co.uk/life-style/health-and-families/mel-c-diet-daughter-scarlet-eating-disorder-depression-spice-girls-a9122381.html", "downloaded_at": "2019-09-27 07:15:57.570819+00:00", "title": "Mel C banned 'diet talk' around daughter after eating disorder battle", "language": "en", "text": "Melanie Chisholm says she has banned people from discussing diets around her daughter following her own battle with an eating disorder.\n\nThe Spice Girl, known as Sporty Spice or Mel C, revealed that she \"obsessively exercised\" and “cut out food groups” during the girl bands height of fame in the 1990s.\n\nChisholm was later diagnosed with depression as well as an eating disorder and said she was lucky to survive.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nSpeaking to Women's Health magazine, the 45-year-old spoke about how her experiences have changed the way she has she raised her 10-year-old daughter, Scarlet.\n\n“I didn't ever allow people to speak about diets in our house,” Chisholm told the magazine.\n\nShape Created with Sketch. Spice Girls – in pictures Show all 23 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Spice Girls – in pictures 1/23 1997 Spice Girls performing at the Brit Awards ceremony PA 2/23 1996 PA 3/23 1997 Spice Girls outside the Martinez Hotel in Cannes, during the 50th Cannes Film Festival PA 4/23 1996 PA 5/23 1997 Prince of Wales with the Spice Girls at the Royal Gala celebrating the Princes Trust 21st Anniversary in Manchester PA 6/23 1997 Spice Girls arriving at the Empire, Leicester Square, for the gala premiere of the film Spice - The Movie PA 7/23 1997 Prince Harry with Mel B, Emma Bunton and Victoria Beckham PA 8/23 1997 The Prince of Wales and Nelson Mandela with the Spice Girls at the presidential residence Mahlamba Nalopfu in Pretoria, South Africa PA 9/23 1998 PA 10/23 1998 Modena, Italy PA 11/23 1999 Unveiling of their wax doubles at Madame Tussaud's Rock Circus in Piccadilly PA 12/23 1999 Mel B, Victoria Beckham, Mel C and Emma Bunton launching their book 'Forever Spice' PA 13/23 2000 Posh, Scary, Sporty and Baby arriving at the launch party of their new album 'Forever PA 14/23 2000 Emma Bunton, Mel C, Victoria Beckham and Mel B celebrate after their finale performance at the Brit Awards where they received the Outstanding Contribution to British Music Award PA 15/23 2000 MTV Europe Music Awards in Stockholm PA 16/23 The Spice Girls kicking off their reunion tour in Vancouver in 2007 Reuters 17/23 2007 PA 18/23 The Spice Girls perform at the Victoria's Secret Fashion Show in 2007 Reuters 19/23 PA 20/23 2012 Spice Girls performing during the Closing Ceremony of the London 2012 London Olympics PA 21/23 2012 The Spice Girls perform during the closing ceremony of the London 2012 Olympic Games Reuters 22/23 2012 The launch of Viva Forever, a musical featuring songs from the Spice Girls PA 23/23 Geri Horner, Melanie Chisholm, Emma Bunton and Melanie Brown announced they will kick off a six-date UK stadium tour in June 2019 in Manchester as a four-piece without Victoria Beckham Dawbell/PA 1/23 1997 Spice Girls performing at the Brit Awards ceremony PA 2/23 1996 PA 3/23 1997 Spice Girls outside the Martinez Hotel in Cannes, during the 50th Cannes Film Festival PA 4/23 1996 PA 5/23 1997 Prince of Wales with the Spice Girls at the Royal Gala celebrating the Princes Trust 21st Anniversary in Manchester PA 6/23 1997 Spice Girls arriving at the Empire, Leicester Square, for the gala premiere of the film Spice - The Movie PA 7/23 1997 Prince Harry with Mel B, Emma Bunton and Victoria Beckham PA 8/23 1997 The Prince of Wales and Nelson Mandela with the Spice Girls at the presidential residence Mahlamba Nalopfu in Pretoria, South Africa PA 9/23 1998 PA 10/23 1998 Modena, Italy PA 11/23 1999 Unveiling of their wax doubles at Madame Tussaud's Rock Circus in Piccadilly PA 12/23 1999 Mel B, Victoria Beckham, Mel C and Emma Bunton launching their book 'Forever Spice' PA 13/23 2000 Posh, Scary, Sporty and Baby arriving at the launch party of their new album 'Forever PA 14/23 2000 Emma Bunton, Mel C, Victoria Beckham and Mel B celebrate after their finale performance at the Brit Awards where they received the Outstanding Contribution to British Music Award PA 15/23 2000 MTV Europe Music Awards in Stockholm PA 16/23 The Spice Girls kicking off their reunion tour in Vancouver in 2007 Reuters 17/23 2007 PA 18/23 The Spice Girls perform at the Victoria's Secret Fashion Show in 2007 Reuters 19/23 PA 20/23 2012 Spice Girls performing during the Closing Ceremony of the London 2012 London Olympics PA 21/23 2012 The Spice Girls perform during the closing ceremony of the London 2012 Olympic Games Reuters 22/23 2012 The launch of Viva Forever, a musical featuring songs from the Spice Girls PA 23/23 Geri Horner, Melanie Chisholm, Emma Bunton and Melanie Brown announced they will kick off a six-date UK stadium tour in June 2019 in Manchester as a four-piece without Victoria Beckham Dawbell/PA\n\n”Scarlet's 10 years old now and I'm starting to notice that she's more conscious of the way she looks, but I think one of the positives of having gone through having an eating disorder is that I'm very conscious of how I speak around her.\n\n“That positive language – it's habit now.”\n\nThe singer added that comments she read about herself in the press affected the way she saw herself.\n\n“These days with social media, everyone has an opinion, but in the 90s, it was what journalists were saying about you, and some of those things were disgusting. “You wouldn’t get away with it now,” Chisholm added.\n\n“I started not looking after myself properly, cutting out food groups, and my exercising became more and more obsessive, to the point that I was underweight.\n\n\"I was unwell and that probably continued for a couple of years.”\n\nYou can read the full interview with Mel C in the November 2019 Mind Issue of Women's Health, on sale on 2 October.\n\nFor help, support and advice with eating disorders, call Beat on 0808 801 0677 or visit www.beateatingdisorders.org.uk.", "description": "Melanie Chisholm says she has banned people from discussing diets around her daughter following her own battle with an eating disorder.", "authors": ["Sarah Young"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/27/07/mel-c-womens-health-01.jpg", "published_at": "2019-09-27"}