{"pub": "investing.com", "url": "https://za.investing.com/news/forex-news/forexyen-slides-to-fiveweek-lows-as-risky-bets-thrive-1952475", "downloaded_at": "2019-09-10 08:25:54.648757+00:00", "title": "FOREX-Yen slides to five-week lows as risky bets thrive", "language": "en", "text": "© Reuters. FOREX-Yen slides to five-week lows as risky bets thrive\n\n* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh\n\nBy Saikat Chatterjee\n\nLONDON, Sept 10 (Reuters) - The Japanese yen fell to a five-week low against the U.S. dollar on Tuesday as a rebound in government bond yields prompted some investors to cut back on bearish bets on the global economy.\n\nGermany's 30-year bond yield rose into positive territory for the first time in more than a month. Benchmark U.S. Treasury yields rose to three-week highs as investors ventured into riskier assets.\n\n\"What we are seeing now is a reversal of some of those investment flows in the summer,\" said Lee Hardman, a currency strategist at MUFG in London.\n\nAgainst the dollar , the yen fell to a five-week low of 107.50 yen, its weakest since early August.\n\nRecent data has lifted some of the gloom over the global economy. Citi's economic-surprise indices for the United States turned positive in the past week for the first time since February. The UK equivalent turned positive for the first time since June. The G10 aggregate index is on the cusp of flipping into the black and is at its highest in a year\n\n\"Over the past 24 hours there has been a move towards more risk-friendly, pro-growth currencies,\" Rodrigo Catril, senior FX strategist at National Australia Bank in Sydney.\n\nThe euro was flat at $1.104. It reached an overnight high of $1.1067 after a Reuters report that Germany may set up public-investment agencies to boost fiscal stimulus without breaching national spending rules Swedish crown SEK=D3 was the only notable loser in early London trading, falling 0.5% versus the dollar and 0.7% against the euro, after August inflation data came in below market expectations.\n\nSterling was steady GBP=D3 as Britain's parliament voted to block Prime Minister Boris Johnson's bid for an early election, which pushed him to promise he would secure a Brexit deal at a European Union summit next month.\n\nhttps://tmsnrt.rs/2A4eDuu\n\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^>", "description": "FOREX-Yen slides to five-week lows as risky bets thrive", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB7I0RU_L.jpg", "published_at": "2019-09-10"}