{"pub": "fox", "url": "https://foxnews.com/politics/bernie-sanders-wants-to-ban-advertising-during-presidential-primary-debates", "downloaded_at": "2019-10-15 23:11:00.059078+00:00", "title": "Bernie Sanders wants to ban advertising during presidential primary debates", "language": "en", "text": "Democratic presidential candidate Bernie Sanders says he wants to ban advertising during presidential primary debates.\n\nSanders, a self-identified Democratic socialist, tweeted Tuesday that the relationship between media organizations hosting such debates and their corporate advertisers, which may prefer one candidate over another, is untenable.\n\n\"Private media outlets charge outrageous sums to run ads during presidential primary debates like tonight's — and many of their advertisers have vested interest in who is elected,\" he said. \"This type of influence must end. We're going to ban advertising during presidential primary debates.\"\n\nBERNIE SANDERS CAMPAIGN VIDEO CREATOR HIRED, FIRED WITHIN 24 HOURS OVER CONTROVERSIAL YOUTUBE COMEDY\n\nTuesday's debate is co-hosted by The New York Times and CNN.\n\nFor the two primary debates it broadcast in July, CNN required companies to commit to at least $300,000 worth of advertising on the network in order to have a spot appear during a debate, according to Variety. The price for one 30-second ad in a CNN debate was $110,000, Variety reported, which is approximately 11 times higher than an average spot in its primetime programming.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSanders regularly directs his ire against the rich and corporations as he pushes policies that aim to redistribute wealth from the rich to poor and middle-class Americans through high tax rates on higher earners and expansive entitlements such as so-called \"Medicare-for-all.\"", "description": "Democratic presidential candidate Bernie Sanders says he wants to ban advertising during presidential primary debates.", "authors": [], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/15/694940094001_6095021473001_6095019267001-vs.jpg", "published_at": "2019-10-15"}