{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Wellness/doctors-1st-signs-vaping-outbreak-speak/story?id=66024276", "downloaded_at": "2019-10-04 01:23:24.061188+00:00", "published_at": "2019-10-03", "title": "Doctors who saw 1st signs of vaping outbreak speak out", "language": "en", "text": "As the number of vaping-related illnesses and deaths continues to grow across the country, several of the doctors who first sounded the alarm are tracing the outbreak back to its beginning.\n\nInterested in Vaping? Add Vaping as an interest to stay up to date on the latest Vaping news, video, and analysis from ABC News. Add Interest\n\nA group of physicians at the Children’s Hospital of Wisconsin quickly believed they had a trend on their hands when treating four teenagers suffering from illness.\n\n\"Most of the patients that came into the hospital and required more intensive services were having breathing problems,\" Dr. Michael Gutzeit, of Children’s Hospital of Wisconsin, told \"Good Morning America.\" \"And that was being presented as shortness of breath, coughing, unexplained weight loss. Those would be symptoms that we wouldn’t expect to see in an otherwise healthy teenager without any other explainable cause.\"\n\nNot knowing what could be behind their symptoms, the doctors ran tests and conducted a \"social history\" that asked the teens about their lives and habits to find the cause. Using that history, they were able to conclude that vaping was the likely root cause of their illnesses.\n\nCarlo Allegri/Reuters, FILE\n\nSurgeon General Jerome Adams has called the vaping outbreak an \"E-cigarette epidemic\" with more than 800 lung injury cases lung injury cases across the country and at least 12 deaths. New statistics will be released on Thursday.\n\nThe Centers for Disease Control report that 62% of patients are between 18 and 34 years old -- and 38% are younger than 21.\n\nIt was also found that most of the lung illnesses associated with vaping involve THC, with or without nicotine.\n\nDoctors are advising people to be honest with their physicians if they are experiencing similar symptoms and to be treated immediately.\n\n\"It’s very important to be honest and to tell your trusted health care provider all the details that you can think of related to vaping especially if you’re experiencing an unexplained cough, weight loss, fatigue or other respiratory symptoms,\" Gutzeit said.\n\nAbove all, they’re urging people to stop vaping all together.\n\nDr. Louella Amos, a pulmonologist at Children’s Hospital of Wisconsin who was part of that group of physicians to see the outbreak first hand, said, \"My mantra is that nothing other than air should be inhaled.\"", "description": "Doctors who first sounded the alarm on the vaping outbreak speak out about how they first saw the signs of an epidemic.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/vape-pens-display-rt-jt-190917_hpMain_16x9_992.jpg"}