{"pub": "reuters", "url": "https://reuters.com/article/us-japan-economy-currentaccount/diplomatic-row-with-south-korea-starts-to-hurt-japans-services-account-idUSKCN1VU04U", "downloaded_at": "2019-09-09 06:54:04.372627+00:00", "title": "Diplomatic row with South Korea starts to hurt Japan's services account", "language": "en", "text": "TOKYO (Reuters) - Japan’s surplus in spending by overseas travelers declined in July from a year earlier as the number of visitors from South Korea tumbled, a sign the souring bilateral relations are taking a toll on the world’s third largest economy.\n\nFILE PHOTO: Tourists visit the Nara Temple in Nara, Japan October 25, 2017. REUTERS/Thomas White/File Photo\n\nThe travel account surplus - or the amount spent in Japan by foreign visitors minus that by Japanese traveling overseas - shrank 0.9% in July from a year earlier to 229.3 billion yen, current account data by the Ministry of Finance showed on Monday.\n\nJapan’s decision in July to tighten controls on exports of materials to South Korea, which are used to make semiconductors, has prompted a backlash in Korea, with consumers boycotting Japanese goods and cancelling tours to the neighboring country.\n\nIn July, the number of South Korea visitors dropped by 7.6% from a year earlier - and was the lowest in nearly a year, according to Japanese government data.\n\nSuch a drop is “certainly a factor” in the travel services account, a finance ministry official said. “We are monitoring developments.”\n\nThe decline in the travel account surplus helped cause a 32% rise in Japan’s service account deficit, the data showed.\n\nAs a result, Japan’s overall current account surplus fell 1.4% in the year to July to 1.9999 trillion yen ($18.72 billion), largely in line with economists’ median forecast for a surplus of 2.0832 trillion yen.\n\nThe drop in South Korean tourists is a blow to Prime Minister Shinzo Abe’s plan to make inbound tourism a pillar of Japan’s economic growth, and comes at a time the export-reliant recovery is hit by slowing global demand and the Sino-U.S. trade war.\n\nSince Abe took office in late 2012, foreign visitors to Japan have more than tripled to 30 million people as of 2018, helped by a weaker yen and easing of visa requirements.\n\nAbe’s government set a target to increase the number of foreign visitors to 40 million by 2020 and 60 million by 2030.\n\nSouth Koreans account for the second largest chunk of visitors to Japan at around 7.1 million in 2017, following Chinese at 7.4 million, according to government data.\n\nIn the balance of payment data since 1996, travel accounts are included in service accounts, which cover transactions for tourism and logistics with other countries.\n\nThe travel account surplus rose 3% to a record 1.3 trillion yen in January-June from the same period a year earlier, helping the service account balance swing to a surplus for the first time.\n\nJapan’s current account surplus mainly consists of income gains from foreign direct investments, and services including money spent by overseas travelers, while the trade balance tends to log deficits due to trade frictions and weak global demand.", "description": "Japan's surplus in spending by overseas travelers declined in July from a year earlier as the number of visitors from South Korea tumbled, a sign the souring bilateral relations are taking a toll on the world's third largest economy.", "authors": ["Tetsushi Kajimoto", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190909&t=2&i=1427789453&w=1200&r=LYNXNPEF8803U", "published_at": "2019-09-09"}