{"pub": "yahoo", "url": "https://finance.yahoo.com/news/boeing-outlook-lowered-negative-p-164519651.html", "downloaded_at": "2019-10-23 15:10:51.701131+00:00", "title": "Boeing Outlook Lowered to Negative by S&P Amid 737 Max Probe", "language": "en", "text": "(Bloomberg) -- S&P Global Ratings lowered the outlook on Boeing Co.’s credit grades to negative, citing the possibility that the planemaker misled the U.S. Federal Aviation Administration amid a probe into the company’s 737 Max airplane.\n\nThe possible misleading could further delay the plane’s return to the air, which could hurt the company’s profitability and financial strength, S&P said. The ratings firm affirmed Boeing’s grade at A, or five steps above junk, but revised the outlook on the ratings to negative, indicating that a downgrade over the medium term is more likely than it had been.\n\nThe company could reverse the outlook change if 737 Max deliveries resume sooner, production for the plane rises, Boeing reduces debt that it incurred to support liquidity while the plane was grounded, and the company avoids large order cancellations or a material loss in market share, according to S&P.\n\nBoeing is engulfed in one of the biggest crisis in its 103-year history after two deadly crashes of the 737 Max killed 346 people. The company’s best-selling plane has been grounded since March.\n\nLate last week, the FAA said that a high-ranking Boeing pilot working on the 737 Max three years ago during its certification had expressed misgivings about a feature since implicated in two fatal crashes, calling its handling performance “egregious.” The agency said it finds the document “concerning” and that it was disappointed that Boeing did not bring the document to its attention sooner, when it discovered the information.\n\n--With assistance from Brendan Case.\n\nTo contact the reporter on this story: Elizabeth Rembert in New York at erembert@bloomberg.net\n\nTo contact the editors responsible for this story: Nikolaj Gammeltoft at ngammeltoft@bloomberg.net, Dan Wilchins\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- S&P Global Ratings lowered the outlook on Boeing Co.’s credit grades to negative, citing the possibility that the planemaker misled the U.S. Federal Aviation Administration amid a probe into the company’s 737 Max airplane.The possible misleading could further delay the plane’s return to", "authors": ["Elizabeth Rembert"], "top_image": "https://s.yimg.com/uu/api/res/1.2/qcIjQjgDoSI5oRRHDRjDvA--~B/aD0xMzMzO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/cc27ef30a73bec274ada3a73435c5c63", "published_at": "2019-10-22"}