{"pub": "businessinsider", "url": "https://businessinsider.com/sanders-set-for-vigorous-campaign-return-after-heart-scare-2019-10", "downloaded_at": "2019-10-19 12:30:09.128874+00:00", "title": "Sanders set for 'vigorous' campaign return after heart scare", "language": "en", "text": "NEW YORK (AP) — Bernie Sanders isn't going anywhere.\n\nLess than three weeks after suffering a heart attack, the Democratic presidential contender is beginning what he's calling a \"vigorous\" return to the campaign trail with a rally expected to draw thousands of supporters to New York City on Saturday afternoon. One of them will be Rep. Alexandria Ocasio-Cortez, Sanders' latest high-profile endorsement, who will share the stage with Sanders this weekend and give his stagnant White House bid an instant dose of energy.\n\nThe event marks a coming-out party of sorts for the 78-year-old Vermont senator, who left the campaign trail earlier this month after he underwent emergency heart surgery but who insists that he's more committed than ever to his 2020 White House bid. With the first voting contests less than four months away, he has some work to do.\n\nBeyond health concerns, Sanders suddenly finds himself looking up at progressive rival Elizabeth Warren and establishment favorite Joe Biden in the polls. Now he must reassure voters that he has the physical stamina to go forward while addressing broader concerns that his policies may be too far left to defeat President Donald Trump in a general election.\n\nEnter Ocasio-Cortez.\n\nThe endorsement from the 30-year-old progressive star \"send the message that the movement is growing, that it's gaining influence, that it's gaining traction,\" Sanders' campaign manager Faiz Shakir said.\n\nHe predicted that the newly announced support from Ocasio-Cortez and Rep. Ilhan Omar, D-Minn., who will not be present Saturday, would help Sanders generate significantly more support from young people and minorities going forward.\n\n\"Those are two people who I think have immense power to mobilize young people, and I promise you you'll be seeing them in Iowa, but not only in Iowa, but around the country, trying to get people engaged around the issues,\" Shakir said.\n\nFor now, at least, Sanders can use the help.\n\nWhile he pledged during this week's presidential debate to move forward with a \"vigorous\" campaign, he's moving cautiously in the short term. The rally in Queens is his only scheduled appearance before he returns to Iowa late next week.\n\nThe week after, he'll join Rep. Rashida Tlaib, D-Mich., for a tour of her congressional district. Tlaib hasn't announced whether she'll join Ocasio-Cortez and Omar in endorsing Sanders, but she is also part of the so-called \"Squad\" of minority women on Capitol Hill who has been frequent targets of Trump's attacks.\n\nDespite aggressive rhetoric from Sanders himself, senior adviser Jeff Weaver said Sanders would ease himself back onto the campaign trail. But by December, Weaver predicted, Sanders' health scare will be forgotten.", "description": "NEW YORK (AP) — Bernie Sanders isn't going anywhere.", "authors": ["Steve Peoples", "Associated Press"], "top_image": "https://www.businessinsider.com/public/assets/BI/US/og-image-logo-social.png", "published_at": "2019-10-19"}