{"pub": "dailybeast", "url": "https://thedailybeast.com/the-best-sheets-to-upgrade-your-bed-with", "downloaded_at": "2019-09-27 11:32:39.447890+00:00", "title": "Upgrade Your Sheets With These 5 Options from Brooklinen, Casper, and More", "language": "en", "text": "Let’s just start this out by stating the obvious: We all deserve good sheets. Sheets should be enjoyable, not just a necessity. You should be putting thought into what you’ll be sleeping under each night. Whether that’s percale or sateen, your sheets decision could affect how you sleep, which will affect the rest of the day. We’ve rounded up some of the highest-rated sheets that will keep you waking up on the right side of the bed each morning (or at least give you a head start).\n\nLuxe Core Sheet Set, $149 from Brooklinen: These are the first sheets I’ve ever truly cared about, and that’s coming from someone that requests a specific pillowcase when visiting her parents’ house. The Luxe Core Set is all you could need (a flat sheet, a fitted sheet, and two pillowcases) and it comes in a multitude of colors. These sheets have a hotel-like softness that I only thought existed in, well, hotels.\n\nPercale Sheet Set, $149-$229 from Riley: If you’re looking for durable sheets that will wear into the perfect vintage T-shirt-like softness, look no further than these. I love Riley’s towels and the sheets are pretty fantastic, too. They’re crisp, cool, and comfortable and will get even softer as you wash them.\n\nSolid Hemmed Sheet Set, $200-295 from Boll & Branch: The Signature Soft sheets from Boll & Branch are made from organic cotton and are soft to the touch, without even having to wash them. The hemmed edge gives it an upscale feel without feeling too finicky. These are simple, organic sheets that will make your sleep more comfortable every time you get in.\n\nCasper Sleep Soft and Durable Supima Cotton Sheet Set, $70-$170 on Amazon: Obviously, Casper knows its way around a bed. These Supima cotton sheets are strong, meaning they won’t pill or thin even after you wash them a million-and-one times. They’re breathable and soft without feeling like you’ll tear them in the middle of the night if you tend to toss and turn in your sleep. They also come in pretty snazzy two-tone options.\n\nThread Spread True Luxury 1000-Thread-Count 100% Egyptian Cotton Bed Sheets, $90-$100 on Amazon: A 4-star rating on over 4,000 reviews is nothing to scoff at. The sateen weave of these 100% Long Staple Pure Egyptian Cotton sheets from Thread Spread (what a name!) are some of Amazon’s highest-rated and best-selling sheets.\n\nNEWSLETTERS The Scouted Newsletter Product recommendations that'll make your life better and tips to help you shop smarter. Subscribe By Clicking \"Subscribe\" you agree to have read the Terms of Use and Privacy Policy\n\nScouted is internet shopping with a pulse. Follow us on Twitter and sign up for our newsletter for even more recommendations and exclusive content. Please note that if you buy something featured in one of our posts, The Daily Beast may collect a share of sales.", "description": "Sheets are something that is worth investing in. Here are some worth the investment.", "authors": ["Jillian Lucas", "Commerce Editorial Manager"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1575,w_2800,x_0,y_2466/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1559944551/jonathan-willis-1394010-unsplash_rynreq", "published_at": "2019-06-08"}