{"pub": "time", "url": "https://time.com/5690707/judge-blocks-california-law-trump-tax-returns", "downloaded_at": "2019-10-02 12:46:34.607789+00:00", "published_at": "2019-10-02", "title": "Judge Temporarily Blocks Law Aimed at Trump's Tax Returns", "language": "en", "text": "(SACRAMENTO, Calif.) — A U.S. judge on Tuesday temporarily blocked a California law aimed at forcing President Donald Trump to release his personal income tax returns in order to appear on the 2020 primary ballot.\n\nU.S. District Judge Morrison C. England Jr. issued a written opinion saying the law likely violates the U.S. Constitution. He had announced last month he planned to block the law.\n\nThe law requires candidates for president or governor to file copies of their personal income tax returns dating back five years with the California secretary of state’s office. If they refuse, they could not appear on the state’s primary ballot. The law would not have applied to general elections.\n\nDemocratic Gov. Gavin Newsom said he signed the law because California has a “special responsibility” to hold candidates to high ethical standards. The Trump campaign sued, arguing the law seeks to add another qualification for running for president, something state governments don’t have the authority to do.\n\nIn his 24-page ruling, Morrison wrote the state’s concerns are “both legitimate and understandable,” highlighting that candidates have offered “unnecessary and irrelevant excuses for shielding the public from such information.”\n\n“It is not the job of the courts, however, to decide whether a tax return disclosure requirement is good policy or makes political sense,” wrote Morrison, who was appointed by former Republican President George W. Bush. “Instead, it is the court’s job to make sure the Constitution wins.”\n\nCalifornia Secretary of State Alex Padilla said he will appeal the ruling, asserting “this law is fundamental to preserving and protecting American democracy.”\n\nMorrison said the law violates Trump’s First Amendment right of associating with voters who share his political beliefs. He also noted the California Legislature is controlled by Democrats, who passed a law targeting a Republican president.\n\n“The dangerous precedent set by this act, allowing the controlling party in any state’s legislature to add substantive requirements as a precondition to qualifying for the state’s presidential primary ballot, should concern all candidates alike,” he wrote.\n\nCalifornia Republican Party chairwoman Jessica Millan Patterson called the ruling a victory for voters and their ability to vote for the candidate of their choice.\n\n“This decision rightfully stops the Democrats’ petty politics and their efforts to disenfranchise millions of California voters and suppress Republican voter turnout,” Patterson said in a news release.\n\nDemocratic Sen. Mike McGuire, the author of the law, said “the judge got it wrong.”\n\n“Some of the brightest constitutional minds in the nation have been very clear that this law will withstand a constitutional test,” he said.\n\nThe deadline to file tax returns for California’s March 3 presidential primary would be Nov. 26.\n\nContact us at editors@time.com.", "description": "The law was aimed at forcing Trump to release his personal income tax returns in order to appear on the 2020 primary ballot.", "authors": ["Adam Beam"], "top_image": "https://timedotcom.files.wordpress.com/2019/10/judge-blocks-california-law-trump-tax-returns.jpg?quality=85&w=1024&h=628&crop=1"}