{"pub": "realclearpolitics", "title": "Gregg Jarrett: James Comey owes America an apology – He abused his position as FBI Director", "url": "https://foxnews.com/opinion/gregg-jarrett-james-comey-apology-fbi-director", "language": "en", "published_at": "2019-08-29", "downloaded_at": "2019-09-03 00:57:14.864975+00:00", "text": "Only the audaciously arrogant fired FBI Director James Comey would demand the equivalent of an apology in the wake of a blistering denunciation of his actions by the Justice Department’s inspector general Thursday.\n\nAs usual, Comey has it backwards. Comey is the one who owes the American public a sincere apology for abusing his position as FBI director, violating government rules, concealing information from his former agency, leaking sensitive documents without authorization, mismarking memos without classification banners, improperly retaining records in an unsecured location, failing to surrender those records to the FBI, and assuming “carte blanche authority” he did not have.\n\nAll of this is contained in the IG’s report disparaging Comey’s behavior. Yet, the fired director has chosen to play the victim by tweeting, “I don’t need a public apology from those who defamed me, but a quick message with a ‘sorry we lied about you’ would be nice.”\n\nJAMES COMEY VIOLATED FBI POLICIES WITH MEMOS ON TRUMP DISCUSSIONS, IG REPORT SAYS\n\nComey is not a casualty of lies. He is the richly-deserved recipient of an unprecedented condemnation meticulously spelled out in the report. He victimized himself through his repeated acts of wrongdoing. He is lucky he was not indicted. Yet.\n\nTheft of government documents\n\nComey has always insisted that the seven memos he composed about conversations he allegedly had with President Trump were his own personal documents. This was absurd, of course. These memos were written in the course and scope of his employment as FBI director. He spoke with the president in his capacity as head of the bureau.\n\nSure enough, the IG found that “Comey’s characterization of the Memos as personal records finds no support in the law and is wholly incompatible with the plain language of the statutes, regulations, and policies defining Federal records, and the terms of Comey’s FBI Employment Agreements.”\n\nNevertheless, Comey kept copies of these documents at his home, an unsecured and unauthorized location. He did not return the records to the FBI upon his termination, as required.\n\nWhile the IG made a criminal referral to prosecutors at the Department of Justice, Comey is fortunate that he was not charged with several violations of the federal statute, 18 U.S.C. 641. This makes it a crime to “steal or knowingly convert” a government record “with intent to convert it to his use” or to convey it to another without authority.\n\nAs the IG pointed out, not a single member of Comey’s senior staff agreed with his interpretation that the memos were personal. The FBI relied on them as official records and kept them at its headquarters in a secure location.\n\nComey gave one of his memos to his friend and attorney, Daniel Richman, with instructions that it be leaked to The New York Times. This was a serious violation of FBI rules, inasmuch as the content involved sensitive information about an ongoing investigation and it was incumbent on the former director to protect it.\n\n“Former Director Comey failed to live up to this responsibility,” according to the report. But again, in Comey’s contorted world, he is the victim.\n\nRecall that in one memo, Comey recounted how he promised the president: “I don’t do sneaky things, I don’t leak, I don’t do weasel moves.”\n\nComey’s leak to the media was the quintessential weasel move. Later, he had the temerity to tell Bret Baier of Fox News in an interview, “I don’t consider what I shared with Mr. Richman a leak.” In what distorted universe does that make sense or is remotely credible? It was a classic Comey prevarication.\n\nComey’s illicit scheme to leak a sensitive government record to trigger the appointment of a special counsel succeeded. His long-time friend and ally, Robert Mueller, was named as special counsel.\n\nWhile excoriating Comey for the leak, the IG rightly noted that other lawful options were available to him. “What was not permitted was the unauthorized disclosure of sensitive investigative information, obtained during the course of FBI employment, in order to achieve a personally desired outcome,” the IG report states.\n\nBut naturally, Comey is the victim in his view. In his tweet, he claims he was unfairly maligned as a “liar and leaker.” A hypocrite will always accuse others of what they are guilty of themselves.\n\nMishandling classified documents\n\nAt least one of the presidential memos that Comey kept at his home contained classified information at the “Confidential” level. This classified document was among four memos that he conveyed to his attorneys. To make matters worse, he concealed from the FBI that he had given a classified record to unauthorized individuals.\n\nIn other words, Comey did exactly what he wrongfully cleared former Democratic presidential candidate and Secretary of State Hillary Clinton of doing. Under 18 U.S.C. 793, it is a crime to mishandle classified records by storing them in an unsecured location or convey them to individuals who do not have a security clearance.\n\nIt is disappointing that prosecutors at the Justice Department seem to have given Comey the same “get out of jail free” card that he delivered to Clinton.\n\nWhether Comey’s actions can be described as intentional or grossly negligent is of little consequence. Both constitute a basis for criminal charges under the law. He should not be absolved, as Clinton was, merely because he was once a high-ranking government official. No one is above the law.\n\nComey’s malevolence and deceptions know no bounds. In his tweet, he pointed out that the IG did not find that he or his attorneys “released any of the classified information contained in any of the memos to members of the media.”\n\nNote the reference to the media. This is a clever misdirection. Comey conveniently overlooks that it is a violation of the law for a classified document to be stored in his home and given to his lawyers. He wants you to focus on the media, not the other ostensible acts of illegality.\n\nCLICK HERE TO GET THE OPINION NEWSLETTER\n\nIn his phony embrace of victimhood, Comey states he has been “defamed.” This is as ludicrous as the many yarns he has peddled for the better part of two years. The law of defamation requires proof of a false statement. By my reckoning, the only false statements seem to have emanated from Comey himself.\n\nTruth is a defense to defamation, a concept that seems strangely alien to the sacked director.\n\nComey may have eluded a criminal indictment for now, but he is not out of the legal woods yet. The gravamen of the inspector general’s investigation has yet to be revealed.\n\nAn upcoming report from the inspector general s expected to focus on the actions of Comey and others who appear to have deceived the Foreign Intelligence Surveillance Court in order to obtain a warrant to wiretap former Trump campaign adviser Carter Page. If the court was deceived and vital evidence concealed from the judges, as the known evidence indicates, more criminal referrals will ensue.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nAttorney General William Barr has vowed that no one is above the law, not even law enforcement. If those who broke the law are not held accountable, there is little justice in our system of justice.\n\nRegardless of what happens next, Comey will continue to play the victim. This is what insufferably self-righteous people do.\n\nCLICK HERE TO READ MORE FROM GREGG JARRETT", "description": "Former FBI Director James Comey may have eluded a criminal indictment for now, but he is not out of the legal woods yet.", "authors": ["Gregg Jarrett", "Gregg Jarrett Is A Fox News Legal Analyst", "Commentator", "Formerly Worked As A Defense Attorney", "Adjunct Law Professor. He Is The Author Of The No. New York Times Best-Selling Book"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/08/29/694940094001_6079250194001_6079265992001-vs.jpg"}