{"pub": "breitbart", "url": "https://breitbart.com/news/top-spain-court-to-rule-on-catalan-separatist-leaders-fate", "downloaded_at": "2019-10-14 05:16:48.441668+00:00", "title": "Top Spain court to rule on Catalan separatist leaders’ fate", "language": "en", "text": "Madrid (AFP) – Spain’s Supreme Court is expected to issue a verdict Monday in the controversial case of 12 Catalan leaders over their role in a failed 2017 independence bid that sparked the country’s worst political crisis in decades.\n\nTension has been mounting steadily ahead of the ruling with police sending reinforcements to Catalonia where separatists have pledged a mass response of civil disobedience, calling for rallies, roadblocks and a general strike.\n\nThe 12 defendants, most of them members of the former Catalan government, are facing long prison terms for their role in the banned October 1 referendum and the short-lived independence declaration that followed it.\n\nFollowing a high-profile trial which ended in June, judges at Spain’s highest court will issue their decision on charges ranging from rebellion and sedition to disobedience and misappropriation of funds.\n\nFormer Catalan vice president Oriol Junqueras is the main defendant after his boss, Carles Puigdemont, fled to Belgium to avoid prosecution.\n\nThe government is hoping the long-awaited ruling will allow it to turn the page on the crisis in this wealthy northeastern region where support for independence has been gaining momentum over the past decade.\n\nBut the separatist movement is hoping for just the opposite: that the anticipated guilty verdicts will unite their divided ranks and bring supporters onto the streets.\n\n– Activists gear up to protest –\n\nActivists from the region’s two biggest grassroots pro-independence groups, the Catalan National Assembly (ANC) and Omnium Cultural, have urged followers to rally on the evening of the verdict.\n\nAnd in the following days, demonstrators will march from five towns towards Barcelona where they will congregate on Friday, when a general strike has been called.\n\nActivists from the radical CDR (Committees for the Defence of the Republic), have also promised “surprises”. On Sunday they briefly occupied the main train station in Barcelona before cutting traffic on a main avenue of the city.\n\nAnti-riot police have been discreetly deployed to Catalonia, but the interior ministry has refused to give numbers.\n\nFor many, the situation has brought back memories of tensions in the street in the run-up to the October 1 referendum which was marred by police violence, and ahead of the short-lived independence declaration of October 27.\n\nIn recent weeks, Prime Minister Pedro Sanchez has made it clear that his government will not tolerate any violence, warning he will not hesitate to renew a suspension of Catalan autonomy as happened two years ago.\n\nThe situation is worrying the main Catalan business lobby which said although the verdict would have a “significant emotional impact”, it was important the response avoided disrupting “business activity or social cohesion”.\n\n– Sedition not rebellion –\n\nThe court is widely reported in the media to have chosen to sentence them for sedition and not rebellion, which carries a far heavier sentence.\n\nBut after those leaks, the president of the court, Manuel Marchena, warned on Saturday that no decision is final until it has been signed by all seven judges. The signature is expected on Monday or Tuesday at the latest.\n\nBy definition, rebellion is “rising up in a violent and public manner” to, among other things, “declare independence for part of the (Spanish) territory”.\n\nSedition, however, is “rising up publicly and in turbulent fashion” to “prevent by force or in an illegal way” the law from being applied, or the application of an administrative or legal decision.\n\nThe trial comes just weeks before Spain heads to the polls for its fourth election in as many years, putting the Catalan question once more at the centre of the political debate.\n\nAlthough Sanchez’s government is hoping the trial’s end might give fresh impetus to dialogue, Junqueras’ leftwing ERC party has said it would not be possible without an “amnesty” for “political prisoners and those in exile”.", "description": "Madrid (AFP) – Spain’s Supreme Court is expected to issue a verdict Monday in the controversial case of 12 Catalan leaders over their role in", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/13/66e4f3_situation-has-brought-memories-run-up-referendum-2017-top-spain-court-rule-640x335.jpg", "published_at": "2019-10-13"}