{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/brexit-no-deal-latest-businesses-customs-forms-hmrc-a9147866.html", "downloaded_at": "2019-10-09 00:28:08.287068+00:00", "title": "Businesses would have to spend £15bn a year on filling out customs forms if there is no-deal Brexit, HMRC document says", "language": "en", "text": "Businesses would be hit with a £15bn a year bill for filling out customs forms if there is a no-deal Brexit, according to a new government assessment.\n\nThe HM Revenue and Customs (HMRC) analysis said companies would face a \"significant new and ongoing administrative burden\" when transporting goods between the UK and EU in the event of no-deal.\n\nThe finding means companies are likely to have to fork out more in administration costs if there is no Brexit deal than the entire £12bn per year that Boris Johnson claims the UK will save when it leaves the EU.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHMRC said UK importers and exporters would likely have to fill out 215 million customs forms a year if Britain crashes out of the bloc.\n\nWith administrative costs of between £15 and £56 per form, the total burden on UK businesses would be £7.5bn per year, it said.\n\nHMRC said similar expenses would be expected to hit EU businesses shipping goods to and from the UK, giving a total cost of £15bn, assuming trade remains at 2017 levels.\n\nThe hefty burden means that \"costs imposed on UK or EU businesses will have wider implications for supply chains therefore for consumers and businesses in either market\", the assessment found.\n\nHMRC estimated that companies would have to pay around £28 in administration costs per customs form, given it would take an employee an hour and a quarter to fill out each one.\n\nIf this was outsourced to a specialist company then the time would be cut to one hour per declaration, it said, but the cost would rise to £56 per form once charges were included.\n\nThe estimates do not include the cost of companies having to amend their systems and train staff in how to use the new customs regime.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nThe analysis was published as the Institute for Fiscal Studies (IFS) said even a \"relatively benign\" no-deal Brexit would result in UK debt rising to its highest level since the 1960s.\n\nBorrowing would rise to £100bn and overall debt would increase to 90 per cent of national income, the think-tank said.\n\nShape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty\n\nLabour MP Margaret Beckett, a leading supporter of the campaign for a fresh Brexit referendum, said: “The IFS and HMRC today confirmed no-deal would be a disaster for the economy, for jobs and for living standards and we know it will risk supplies of food and medicine and the security of our country.\n\n\"It would mean the Brexit crisis dragging on for years to come, with the UK left in a much weaker negotiating position, desperately trying to put our shattered relationships with our friends and allies in Europe back together from scratch. But the wreckers in Downing Street don’t care about any of that. They will not be the ones left to pick up the pieces.\"\n\nBut Boris Johnson's spokesman said: “These figures are estimates. The final costs of completing customs declarations will vary significantly from business to business, depending on how often they trade. We expect them to reduce over time as businesses become more proficient in filling in customs declarations.”", "description": "Businesses would be hit with a £15bn a year bill for filling out customs forms if there is a no-deal Brexit, according to a new government assessment. The HM Revenue and Customs (HMRC) analysis said companies would face a \"significant new and ongoing administrative burden\" when transporting goods between the UK and EU in the event of no-deal.", "authors": ["Benjamin Kentish"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/12/14/no-deal-dover.jpg", "published_at": "2019-10-08"}