{"pub": "businessinsider", "url": "https://businessinsider.my/apple-iphone-11-pro-battery-life-consumer-reports-rankings-2019-10", "downloaded_at": "2019-10-08 06:33:47.625463+00:00", "title": "The iPhone 11 Pro’s battery life is so impressive, it beat out Samsung in Consumer Reports’ smartphone rankings for the first time in years", "language": "en", "text": "caption The iPhone 11 Pro Max. source Crystal Cox/Business Insider\n\nThe new iPhone 11 Pro Max is the top-rated smartphone on the market, as ranked by Consumer Reports’ latest ratings, followed by the iPhone 11 Pro – the highest placement Apple has won in recent years.\n\nSamsung phones have consistently beaten iPhones in the Consumer Reports ratings in the past few years, but the iPhone 11 Pro and iPhone 11 Pro Max gained an edge this year thanks to their beefed-up battery lives.\n\nApple’s latest generation of smartphones were also more competitive in the ratings thanks to their improved cameras, physical durability, and faster processors.\n\niPhones now lead the pack in battery life\n\nUnder the duress of Consumer Reports’ testing, the iPhone 11 Pro Max lasted 40.5 hours on a single charge, while the iPhone 11 Pro lasted 34 hours. Those are both huge leaps from the battery lives of the iPhone XS Max and iPhone XS, which were 29.5 hours and 27.5 hours, respectively.\n\nTo gauge a realistic estimate of a phone’s battery life, the tests used a robotic finger that used the phones periodically throughout the day in a way meant to resemble the average phone user.\n\nApple has made the improved battery life of its newest iPhones a huge selling point, touting next-generation battery hardware and more efficient processors that use less energy.\n\nsource Crystal Cox/Business Insider\n\nTriple lenses make iPhone cameras competitive with Galaxy and Pixel\n\nApple has caught some flack for the quirky appearance of three separate lenses on the back of the iPhone 11 Pro and iPhone 11 Pro Max, but the new and improved cameras put the smartphones on similar footing with Samsung’s and Google’s offerings.\n\nThe iPhone 11 Pro and iPhone 11 Pro Max both feature an ultra-wide lens, which most of Samsung’s recent phones also boast, and their new Night Mode is similar to a feature already available on Google’s Pixel phones.\n\nRead more: Apple’s new iOS 13 iPhone update has a security flaw that lets you bypass the lock screen to view contact lists\n\nThe most durable iPhones yet\n\nTesters found that the body and screens of the iPhone 11 Pro and iPhone 11 Pro Max are more durable than any past iPhone model, thanks to stronger glass screens and more robust water resistance.\n\nTo test their durability, Consumer Reports submerges each smartphone underwater, and places each phone in a tumbler that drops the phones from approximately 2.5 feet 100 times. While all the new iPhones passed the water resistance test, only the iPhone 11 Pro Max survived the drop test – the iPhone 11 Pro screen broke after 50 drops.\n\nThe iPhone 11 Pro Max and 11 Pro start at $1,100 and $1,000, respectively. You can read more about how the phones held up during testing over at Consumer Reports.", "description": "Business Insider - For the first time in recent years, Apple beat out Samsung in Consumer Reports' latest smartphone ratings.. Read more at businessinsider.my", "authors": ["Aaron Holmes", "Business Insider Us"], "top_image": "https://static.businessinsider.my/sites/3/2019/10/5d853e1f2e22af6ca61351c7.png", "published_at": "2019-10-07"}