{"pub": "guardian", "url": "https://theguardian.com/environment/2019/sep/14/i-dont-know-how-we-come-back-from-this-australias-big-dry-sucks-life-from-once-proud-towns", "downloaded_at": "2019-09-14 01:38:54.052590+00:00", "title": "'I don't know how we come back from this': Australia's big dry sucks life from once-proud towns", "language": "en", "text": "Australia is experiencing one of its most severe droughts on record, resulting in desperate water shortages across large parts of New South Wales and southern Queensland. Dams in some parts of western NSW have all but dried up, with rainfall levels through the winter in the lowest 10% of historical records in some areas.\n\nThe crisis in the far west of the state became unavoidable after the mass fish kills along the lower Darling River last summer, but now much bigger towns closer to the coast, including Dubbo, are also running out of water.\n\nResidents of three distinct areas talked to Guardian Australia about the state of their towns under extreme stress from water shortages, expressing anxiety about their future but also determination to keep communities alive.\n\nDubbo, NSW\n\nIt seems unthinkable that the city of Dubbo, with a population of 40,000 and home to the Western Plains Zoo, could be facing the prospect of running out of water by mid- 2020. But as the drought enters its second summer, that’s exactly what is facing the main town in the central west of NSW.\n\nIt’s also raising questions about management of water in the region, as irrigators in the basin have been permitted to continue to take water in the expectation that inflows would occur. Instead inflows into the Macquarie River are at historic lows.\n\nFacebook Twitter Pinterest Burrendong Dam, which supplies Dubbo and surrounding towns. Photograph: Mike Bowers/The Guardian\n\nThe vast Burrendong dam on the Macquarie – six times the size of Sydney Harbour and the main water source for Dubbo, Wellington, Narromine, Nyngan, Cobar and Warren – is now at 4.5% capacity and dwindling rapidly as unseasonably high temperatures hit the region.\n\nThis is not just a matter of water restrictions and inconvenience. The drought and water shortages spell potential economic catastrophe for Dubbo as farmers leave fields unplanted and sell off stock, tourist numbers wither and parks and gardens turn brown.\n\nDubbo still looks like an oasis in the brown landscape that surrounds it, despite being on level two restrictions.\n\nBut tougher level three restrictions are imminent if there is no spring rain, as the Bureau of Meteorology is forecasting. Then the city will rapidly go to level five, then level six.\n\nThat means no watering of lawns and parks. Some of the council’s pools will be emptied and residents will be required to use no more than 120 litres a day – half the amount now permitted. That means short showers and limited use of evaporative coolers, in a summer when the temperature on most days will be well over 30C.\n\n“There are no records of the sort of drought that we are experiencing,” says the chief executive of Dubbo council, Michael McMahon. “At the same time the population has grown and there are more businesses here.”\n\nFacebook Twitter Pinterest A huge mat of red duckweed floats on the surface of the Macquarie River. Photograph: Mike Bowers/The Guardian\n\nA fortnight ago the state government announced a $30m program to sink more bores, and McMahon says he hopes to shift to roughly 50/50 bore and dam water by March.\n\nBut there are serious questions about whether groundwater in sufficient quantity and quality can be found to support all the people who rely on Burrendong.\n\n“I’m quite concerned that the groundwater they find won’t be enough or of good enough quality to help Dubbo,” says the Healthy Rivers Dubbo convenor, Melissa Gray.\n\nShe points to a risk assessment by state water authorities in November 2018 that found the risk of compaction and subsidence, caused by extraction of groundwater, was high in several zones of the Macquarie aquifer. There is also a high risk of poor quality water travelling through the aquifer as water is withdrawn at other points.\n\nBill Johnson, a former Murray-Darling Basin Authority senior staff member, says the problem is the climate is getting hotter and drier but allocations are being made on the expectation of previous dry times.\n\n“There isn’t plenty of water for towns now because too much has been given to irrigation in the recent past,” he says.\n\nMcMahon also acknowledges concerns about bore water. He is confident it can be treated to provide drinking water but says there are limits to how much can be extracted.\n\nFacebook Twitter Pinterest The Hippo enclosure at the Western Plains zoo. Photograph: Mike Bowers/The Guardian\n\nAstoundingly, farms with groundwater entitlements are still permitted to extract from underground aquifers for irrigation, Gray says. “They can still flood irrigate with groundwater so, despite the conditions, there will be cotton grown in this region this year.”\n\nIn the meantime some of the city’s big water users, including the zoo, are trying to reduce water use further.\n\nThe zoo has a 500-megalitre allocation from Burrendong, which it uses for its non-potable water, mainly for the irrigation of lawns, for water features and moats around enclosures, and for growing “browse” feed for animals.\n\nThe zoo’s director, Steve Hinks, says it has already cut irrigation back significantly to 340ML a year but is looking at what else can be done, through greater recycling.\n\n“We hold 50ML on site at any one time,” he says. “The water is stored in a reservoir and flows through a lake system, so the hippo lake here is one of the last lakes in our natural system.”\n\nThe zoo is installing a pump system to take the hippo lake water back to the reservoir, where it will run through a series of natural wetlands to purify it.\n\n“We can not only reuse the water and get a longer lifespan, but we are creating an environment for a lot of the native bird species,” Hinks says.\n\n“Even if it rains in the next few months we will forge ahead with this project as it sets us up for the future, because historically droughts are cyclical, and historically people tend to put the changes on hold.\n\nFacebook Twitter Pinterest The Albert Priest channel where it crosses the Dubbo-Nyngan road. Photograph: Mike Bowers/The Guardian\n\n“We are planning for the eventuality of no water in Burrendong but I don’t think we would necessarily close the zoo or drastically reduce the animals here. We are working closely with Water NSW and council about options such as sinking bores on site, and desalination and sewage treatment and recycling.”\n\nThe further you travel from Dubbo, the more acute the problems are. Nyngan, which sits on the red soil plains 120km to the north-west, was seared into the national consciousness in 1990 when the Bogan River overran its banks, inundating the town of just over 2,000 people.\n\nSuch excesses are now a distant memory. There has been no rain since 2016 and the town is relying on a combination of its off-river storage, shrewdly built by the council in 2017, and a channel that brings water from Dubbo and the Burrendong.\n\nFacebook Twitter Pinterest The ruins of the train station at Girilambone. Photograph: Mike Bowers/The Guardian\n\n“Having this backup makes it a lot better than it would be,” says Nyngan’s water manager, Trevor Waterhouse. It holds about 700ML, which is close to a year’s water for the town, particularly with water restrictions. But it depends on water from Burrendong, brought by the 66km Albert Priest channel.\n\nFacebook Twitter Pinterest Publican Darren Painter at Girilambone. Photograph: Mike Bowers/The Guardian\n\nFurther west along the road to Bourke, the situation is already dire.\n\nGirilambone, population 26, is already part of the way towards becoming a ghost town but this drought could be the last straw. The town water supply ran out six months ago and water is now trucked in every two days.\n\nThe rail line to Bourke closed in 1986 and, since then, the town has been in retreat. The station is derelict. The hotel burned down. The general store and petrol station closed two years ago.\n\n“The mines [at Cobar and Girilambone] have already had meetings and said if they don’t have rain before January, it’s no more,” says Darren Painter, who runs the hotel in the old RSL. “This is the only small business here. In turn that will shut us too.\n\n“There’s not much laughter here in the pub these days. The farmers try to come in to buy two beers but then they have to go.\n\n“Ah, but it will be all right. We’ve got through this before.”\n\nWarwick and Stanthorpe, Queensland\n\nAfter 73 days it rained a trickle in the southern Queensland town of Warwick in August.\n\nFew locals celebrated the end of the longest dry spell in living memory. The drought had passed the point where 5mm in the rain gauge could make a drop of difference.\n\n“Warwick is a fantastic town, a very proud town, but it’s on its knees,” says Ian Macdonald, who runs a local garden nursery with his son, Brent. “I don’t know how we ever come back from this. Because if it rained tonight, it doesn’t rain money and we’re about a quarter of a million dollars down the gurgler.”\n\nFacebook Twitter Pinterest A water restriction sign greets drivers arriving in Warwick. Photograph: Ben Smee/The Guardian\n\nWarwick is on track to run out of water within months. Roadside signs heading into town remind residents of the new restrictions: 100 litres per person, per day.\n\nLocals take pride in their rose gardens – shopping centres and hotels and Chinese restaurants are named after Warwick’s signature flower. Each year in October the Rose and Rodeo festival is the town’s showpiece event.\n\n“We can’t afford the money to bring in roses this year because no one is buying and you’d quite easily do your arse taking a gamble,” Macdonald says. “What people don’t get about a drought is that it hurts everybody … If the farmers have got no money, none of us have got any money ... People don’t buy plants to take home. They don’t stop after the cattle sales and buy a pie at the pie shop.”\n\n‘Dead things everywhere’: is Australia facing the summer from hell? Read more\n\nIn Stanthorpe, 60km to the south, “day zero” – when drinking water supply runs dry – is approaching just as quickly. The towns in Queensland’s Southern Downs and Granite Belt are hubs for primary producers; mostly fruit and vegetable growers. Last month the Granite Belt Growers Association estimated the reduction in wages and expenditure would cost the local economy $100m.\n\nAnn Bourke from Jester Hill Wines – a spokeswoman for the Granite Belt Wine Tourism body – says the latest vintage was picked a month earlier than usual, and most local winemakers now have business plans that assume they will lose one harvest in every five.\n\n“It’s costing us $2,000 a week to buy in water,” Bourke says. “We’re still in two minds, do we throw the dollars at buying more water and have a vintage, or do we concentrate on just keeping the vines alive?”\n\nSome of the bigger farms have decided not to plant this year, which means there is no additional work, and few backpackers in town.\n\n“That means there’s less people employed, families might move away, next year our school numbers will drop,” says Amanda Harold, the secretary of the Stanthorpe chamber of commerce. “It’s very scary and very stressful for everyone.”\n\nHarold says Stanthorpe faced a similar situation 10 years ago, when the community was months away from running out of water. She, like many locals, thinks authorities should have acted more quickly to build the Emu Swamp dam. The dam tends to split opinion, but most accuse successive councils and governments of failing to plan properly.\n\nRick Humphreys, a small producer, decided not to grow his primary crop – parsley – this year. He says there’s an increased acceptance that climate change will force farmers to adapt their practices.\n\n“I think people now acknowledge that we’re in uncharted territory,” says Humphreys, who is a member of the group Farmers for Climate Action. “A lot of the old blokes, whose families have been keeping records a long way back, they say this is the worst drought on record …\n\nAustralians increasingly fear climate change related drought and extinctions Read more\n\n“If the numbers are right a version of this is going to become the new normal in the mid-term and we need to think differently about how we produce things and what we produce. The worst thing we can do is carry on farming ... the way we always have.”\n\nMacdonald says he was called “a communist” by a local Warwick identity for suggesting the weather patterns had changed and that October thunderstorms were no longer a regular occurrence.\n\n“I’d be too frightened to talk about [climate change] in this town,” he says. “It doesn’t get through to people at all. Not one bit.”\n\nWalgett, NSW\n\nThe far western town of Walgett will be back on bore water again next week.\n\nRain in March sent the last natural flow down the once-mighty Barwon River, and the quality of what remains has been declining ever since.\n\nOn 3 September the shire council warned locals to boil water for drinking and food preparation owing to “high turbidity” – a level of murkiness that can indicate the presence of disease-causing bacteria such as E coli.\n\nFacebook Twitter Pinterest The Castlereagh Highway near Walgett in January. Photograph: Carly Earl/The Guardian\n\nLocals say the water coming out of the tap is brown, brackish and smells bad.\n\n“It’s yucky water,” says Clem Dodd, from the Dhariwaa elders group. “It stinks. You can’t wash in it or wash your clothes in it, or they’ll stink too.”\n\nWalgett shire’s general manager, Greg Ingham, agrees the situation is “pretty dire”. “I really do feel for the community about the river,” he says. “It’s sad to go down and see what was a thriving lifeblood of our community just a dry, parched riverbed.”\n\nWalgett’s bore water is high in sodium, which can pose a risk for people with heart disease, diabetes and other chronic health conditions. The water supply is regularly independently tested, and the NSW health department has said it is safe but the taste can be unpalatable.\n\nIngham says the shire is in discussions with the state government to install a desalination system but that in itself will not solve the town’s water woes.\n\nFor centuries the rivers sustained Aboriginal culture. Now they are dry, elders despair Read more\n\n“The output of any desalination treatment won’t be the same as what is currently going through our treatment plant. Desalination on its own won’t be enough to supply all our needs. We might have to look at a blend of the two.”\n\nFor the past year locals have been buying bottled water or receiving crowdfunded donations shipped in by truck and car.\n\nWhen Walgett’s only supermarket burnt down after an electrical fault in June, locals had to make an 80-minute round trip to Coonamble to buy water, or go further afield. A temporary shop opened in August.\n\n“We’ve had various campaigns,” Ingham said. “We’ve had a lot of bottled water coming in, through GoFundMe pages. Then we had a concern about all those small empty bottles piling up here, not being great for the environment.\n\n“Now 20- to 50-litre-sized containers are being delivered to households. But the bottom line is we’re no different to any other part of regional Australia suffering through the drought. The only real long-term solution is rain.”\n\nThe Walgett Aboriginal Medical Service and the Dhariwaa elders group have been distributing bottled water, and delivering water to housebound elders.\n\n“Buying water is expensive,” says a local Gamilaraay woman, Vanessa Hickey, “having to spend extra, to wash fruit and veggies.”\n\nBoth she and Dodd have started to think about what the lack of water might mean for the future. Dodd says moving away is a possibility but Hickey says she’s not going anywhere.\n\n“They’ve already ruined our rivers with cotton, coal seam gas and mining. But I’m not moving. The community suffers from other people’s wrongdoing. It’s not our fault but we’re the ones who suffer the most.\n\n“They want us gone because they want the land; they want what’s under the land. But where can we live in the city? We only live in the country. I’d rather live in a tent on the riverbank – only we’ve got no river to live on.”", "description": "Guardian Australia reports from three communities hard hit by one of the worst droughts in living memory", "authors": ["Lorena Allam", "Anne Davies", "Ben Smee"], "top_image": "https://i.guim.co.uk/img/media/b6a54322f523601cdc0b7aa5d9a20851a71c64fe/131_0_5053_3032/master/5053.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=990042c63076b15c59405b45484f550c", "published_at": "2019-09-14"}