{"pub": "abcnews", "url": "https://abcnews.go.com/US/houston-rockets-gm-daryl-morey-ignites-firestorm-tweet/story?id=66110737", "downloaded_at": "2019-10-07 23:32:16.417415+00:00", "title": "Houston Rockets GM Daryl Morey ignites firestorm with tweet backing Hong Kong protests", "language": "en", "text": "Houston Rockets general manager Daryl Morey's tweet supporting pro-democracy demonstrators in Hong Kong was up for less than a day before he erased it, but it set off a firestorm that one NBA owner said could take years for Morey and his team to rebound from.\n\nInterested in NBA? Add NBA as an interest to stay up to date on the latest NBA news, video, and analysis from ABC News. Add Interest\n\nFollowing Morey's Twitter post, the Rockets went from most beloved NBA team in China to most despised, and the backlash left Morey, Rockets' ownership, players and NBA brass scrambling to repair the damage.\n\nThe international backlash also prompted criticism from U.S. politicians, including two Democratic presidential candidates, who slammed the NBA as hypocritical and more concerned about its bottom line than with free speech and human rights.\n\nJoe Scarnici/Getty Images for Turner Sports, FILE\n\nOn Friday, Morey tweeted an image that read, \"Fight for Freedom. Stand with Hong Kong.\"\n\nThe message was in response to the anti-government protests that have erupted in the semi-autonomous territory of China over the last four months and have become increasingly violent with police clubbing demonstrators and shooting two teenage protesters last week.\n\n\"I did not intend my tweet to cause any offense to Rockets fans and friends of mine in China,\" Morey tweeted Monday from Japan, where the Rockets are scheduled to play two pre-season games against the Los Angeles Lakers this week.\n\n1/ I did not intend my tweet to cause any offense to Rockets fans and friends of mine in China. I was merely voicing one thought, based on one interpretation, of one complicated event. I have had a lot of opportunity since that tweet to hear and consider other perspectives. — Daryl Morey (@dmorey) October 7, 2019\n\n2/ I have always appreciated the significant support our Chinese fans and sponsors have provided and I would hope that those who are upset will know that offending or misunderstanding them was not my intention. My tweets are my own and in no way represent the Rockets or the NBA. — Daryl Morey (@dmorey) October 7, 2019\n\n\"I was merely voicing one thought, based on one interpretation, of one complicated event,\" Morey added. \"I have had a lot of opportunity since that tweet to hear and consider other perspectives.\"\n\nKyodo via Newscom\n\nOne of those other perspectives came from Morey's boss, Rockets' owner Tilman Fertitta, who took to Twitter on Friday night writing that Morey \"does NOT speak for the @HoustonRockets.\"\n\n\"Our presence in Tokyo is all about the promotion of the @NBA internationally and we are NOT a political organization,\" Fertitta wrote.\n\nListen....@dmorey does NOT speak for the @HoustonRockets. Our presence in Tokyo is all about the promotion of the @NBA internationally and we are NOT a political organization. @espn https://t.co/yNyQFtwTTi — Tilman Fertitta (@TilmanJFertitta) October 5, 2019\n\nMike Bass, the NBA's chief communications officer, released a statement saying that while the NBA encourages individuals to share \"views on matters important to them,\" the league recognized that Morey's tweet \"deeply offended many of our friends and fans in China, which is regrettable.\"\n\n\"We have great respect for the history and culture of China and hope that sports and the NBA can be used as a unifying force to bridge cultural divides and bring people together,\" Bass said.\n\nThe fallout from Morey's tweet was swift and widespread in China, where the country is set to host two preseason games between the Brooklyn Nets and the Lakers later this week in Shanghai and Shenzhen.\n\nOn Sunday, China's consulate general in Houston urged the Rockets to \"clarify and immediately correct the mistakes\" made by Morey.\n\nMorey's tweet prompted an angry response from several Chinese companies that sponsor the Rockets, including sporting goods manufacturers Li-Ning and Shanghai Pudong Development Bank, which both announced they are suspending their relationship with the Rockets.\n\nChinese state television and internet giant Tencent -- who inked a five-year, $1.5 billion deal in August to stream NBA games in China -- both said they will not show Rockets games.\n\nVCG via Getty Images, FILE\n\nPerhaps the biggest blowback came from former Rockets' star Yao Ming, the catalyst behind the team's enormous popularity in China. Ming announced that the Chinese Basketball Association, which he is president of, is suspending its relationship with the Rockets.\n\nEven current Rockets players were put in the awkward position of attempting to distance themselves from Morey's tweet.\n\n\"We apologize. You know, we love China, we love playing there,\" James Harden, a seven-time All-Star player for the Rockets, said on Monday during the team's practice in Japan as he stood next to new teammate Russell Westbrook. \"For both of us individually, we go there once or twice a year. They show us the most important love. We appreciate them as a fan base. We love everything there about them and we appreciate the support that they give us individually and as an organization.\"\n\nBrooklyn Nets majority owner Joe Tsai, the co-founder of Chinese e-commerce giant Alibaba, posted an open letter to NBA fans on Facebook, calling Morey's Twitter comment a \"third-rail issue\" that will take years to repair.\n\n\"When I bought controlling interest in the Brooklyn Nets in September, I didn't expect my first public communication with our fans would be to comment on something as politically charged and grossly misunderstood as the way hundreds of millions of Chinese NBA fans feel about what just happened,\" Tsai wrote.\n\nHe went on to write, \"The one thing that is terribly misunderstood, and often ignored, by the western press and those critical of China is that 1.4 billion Chinese citizens stand united when it comes to the territorial integrity of China and the country’s sovereignty over her homeland. This issue is non-negotiable.\"\n\nToshifumi Kitamura/AFP via Getty Images\n\nStill, several American politicians, both Republican and Democrat, defended Morey's freedom of expression.\n\n\"As a lifelong @HoustonRockets fan, I was proud to see @dmorey call out the Chinese Communist Party's repressive treatment of protestors in Hong Kong,\" Sen. Ted Cruz, R-Texas, wrote on Twitter Sunday night. \"Now, in pursuit of big $$, the @nba is shamefully retreating.\"\n\nAs a lifelong @HoustonRockets fan, I was proud to see @dmorey call out the Chinese Communist Party's repressive treatment of protestors in Hong Kong.\n\n\n\nNow, in pursuit of big $$, the @nba is shamefully retreating. https://t.co/7waMde5KrM — Ted Cruz (@tedcruz) October 7, 2019\n\nJulian Castro, a Democrat from Texas running for president, also spoke out on Twitter in support of Morey.\n\nChina is using its economic power to silence critics—even those in the U.S.\n\n\n\nThe United States must lead with our values and speak out for pro-democracy protestors in Hong Kong, and not allow American citizens to be bullied by an authoritarian government. https://t.co/87U4jgsAAp — Julián Castro (@JulianCastro) October 7, 2019\n\n\"China is using its economic power to silence critics—even those in the U.S.,\" Castro tweeted. \"The United States must lead with our values and speak out for pro-democracy protestors in Hong Kong, and not allow American citizens to be bullied by an authoritarian government.\n\nThe only thing the NBA should be apologizing for is their blatant prioritization of profits over human rights. What an embarrassment. https://t.co/bbiwCBTwc1 — Beto O'Rourke (@BetoORourke) October 7, 2019\n\nFormer Texas Rep. Beto O'Rouke, another Democratic candidate for president, echoed Castro's sentiment, writing on Twitter, \"The only thing the NBA should be apologizing for is their blatant prioritization of profits over human rights. What an embarrassment.\"", "description": "Rockets GM Daryl Morey tweeted support for pro-democracy protests in Hong Kong.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/daryl-morey-gty-jt-191007_hpMain_16x9_992.jpg", "published_at": "2019-10-07"}