{"pub": "investingcom", "url": "https://investing.com/analysis/enterprise-products-to-carry-more-natural-gas-from-haynesville-200466668", "downloaded_at": "2019-09-20 23:15:09.603565+00:00", "title": "Enterprise Products To Carry More Natural Gas From Haynesville", "language": "en", "text": "Enterprise Products Partners LP (NYSE: ) announced that it will expand its Acadian pipeline system. Thus, it plans to capitalize on the mounting demand for transporting growing natural gas volume to key LNG markets in South Louisiana from the prolific Haynesville Shale.\n\nThe to-be-constructed pipeline will spread over 80 miles and is expected to transport natural gas to third-party interconnects —located near Gillis, LA —from a place near Cheneyville, LA. Notably, the partnership’s new system will connect several pipeline networks that are providing services to export facilities of LNG located in south Louisiana and southeast Texas. Enterprise Products stated that the development will include the increase in horsepower at its Mansfield compressor station in De Soto Parish.\n\nOnce the expansion project comes online, likely in mid-2021, the Acadian pipeline system will be capable of transporting natural gas volume from Haynesville Shale at a rate of 2.1 billion cubic feet per day (Bcf/D), higher than the current rate of 1.8 Bcf/D. Enterprise Products added that the new project has already been backed by long-term contracts of shippers.\n\nThus, the partnership secured additional fee-based revenues, further strengthening its stable business model.\n\nCurrently, Enterprise Products carries a Zacks Rank #3 (Hold). Some better-ranked players in the energy sector include National Oilwell Varco Inc. (NYSE: ) , World Fuel Services Corporation (NYSE: ) and Delek Logistics Partners LP (NYSE: ) . While, National Oilwell currently sports a Zacks Rank #1 (Strong Buy), World Fuel and Delek Logistics carry a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nNational Oilwell is likely to see earnings growth of 75% in 2019.\n\nWorld Fuel beat the Zacks Consensus Estimate for earnings in each of the trailing four quarters, the average surprise being 16.4%.\n\nDelek Logistics is likely to see earnings growth of 4.9% in 2019.\n\nJust Released: Zacks’ 7 Best Stocks for Today\n\nExperts extracted 7 stocks from the list of 220 Zacks Rank #1 Strong Buys that has beaten the market more than 2X over with a stunning average gain of +24.6% per year.\n\nThese 7 were selected because of their superior potential for immediate breakout.\n\nSee these time-sensitive tickers now >>", "description": "Stocks Analysis by Zacks Investment Research covering: National Oilwell Varco Inc, Natural Gas Futures, World Fuel Services Corporation, Enterprise Products Partners LP. Read Zacks Investment Research's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-20"}