{"pub": "independent", "url": "https://independent.co.uk/sport/motor-racing/formula1/sebastian-vettel-charles-leclerc-ferrari-italian-grand-prix-standings-nico-rosberg-a9097696.html", "downloaded_at": "2019-09-09 23:19:58.760676+00:00", "title": "Sebastian Vettel in ‘dark place’ after losing number one status at Ferrari to Charles Leclerc, says Nico Rosberg", "language": "en", "text": "Former world champion Nico Rosberg believes Sebastian Vettel is in a dark place after claiming the German has lost his number one status at Ferrari to Charles Leclerc.\n\nVettel will take part in the Singapore Grand Prix a week on Sunday, 13 points behind Leclerc in the championship following the 21-year-old Monegasque’s superlative drive to victory in Monza.\n\nAs Leclerc lapped up the adulation of the Tifosi, quadruple world champion Vettel was reflecting on yet another torrid afternoon.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHe spun for a second successive year at the Italian team’s home race before colliding with Lance Stroll and damaging his car. He was penalised with a 10-second-stop-and-go punishment, finishing 13th, a lap behind his team-mate.\n\n“This moment must be so dark for Vettel,” said Rosberg. “His team-mate just became an absolute Ferrari legend, taking his number one status in the team.\n\n“It is unexplainable for me. He is a four-time world champion, he is one of the best guys out there and to make a mistake like that, on your own, just spinning the car, is so strange.”\n\nPublicly, Ferrari are standing by their £36million-a-year driver, with chief executive Louis Camilleri, who was among the team’s bigwigs in Monza to witness Vettel’s latest capitulation, insisting he will bounce back.\n\n“I don’t like the fact that people are trying to write off Seb,” he said. “He’s an amazing driver and I have every confidence that Seb’s going to come back.”\n\nBut privately, the Scuderia will be alarmed. Vettel is desperately out of form, out of confidence, and might well be considering his future.\n\nHis Ferrari contract expires at the end of next season, but the emergence of Leclerc may see him depart before then.\n\nVettel has not been able to add to his 52 victories – only Michael Schumacher and Lewis Hamilton have won more times in Formula One – in more than a year.\n\nVettel should have triumphed at June’s Canadian Grand Prix, only to run off the road under pressure from Hamilton. He has been out-qualified by Leclerc at the following seven rounds.\n\nDuring the same period, Leclerc has also scored three poles to Vettel’s zero, won twice, and accumulated 41 more points than his more experienced team-mate.\n\nLeclerc saw off Hamilton and Valtteri Bottas, in the sister Mercedes, to secure his second win in as many races on Sunday.\n\nLeclerc was aggressive in his defence of first position, with Hamilton insisting he will speak to the Ferrari driver about his conduct.\n\nBut the five-time world champion, who holds a 63-point title lead with seven races left, says he does not harbour any ill feeling towards the sport’s rising star.\n\n“There are zero issues between us,” said Hamilton. “Charles is one of the most respectful drivers.\n\n“This was the first time that I have gone wheel-to-wheel with him and with a new driver you learn how they approach different scenarios. Maybe next time I will position my car differently, and I will do a better job.”\n\nPA", "description": "Former world champion Nico Rosberg believes Sebastian Vettel is in a dark place after claiming the German has lost his number one status at Ferrari to Charles Leclerc. Vettel will take part in the Singapore Grand Prix a week on Sunday, 13 points behind Leclerc in the championship following the 21-year-old Monegasque’s superlative drive to victory in Monza.", "authors": ["Philip Duncan"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/09/14/Sebastian-Vettel.jpg", "published_at": "2019-09-09"}