{"pub": "axios", "url": "https://buzzfeednews.com/article/laurenstrapagiel/blizzard-boycott-hong-kong", "downloaded_at": "2019-10-11 19:40:51.125725+00:00", "title": "There's A Blizzard Boycott Movement After A \"Hearthstone\" Player Was Suspended For Supporting Hong Kong Protesters", "language": "en", "text": "Players are boycotting games like World of Warcraft, Overwatch, and Hearthstone after a user was punished for supporting pro-democracy protests in Hong Kong during a tournament.\n\nAll those games are made by Blizzard, more formally known as Activision Blizzard.\n\nIt all started on Oct. 6 in Taiwan during the Asia-Pacific Hearthstone Grandmasters, a tournament for the card-based game. Two casters were conducting a post-match interview with Chung Ng Wai, known by his screen name Blitzchung.\n\n“Liberate Hong Kong, revolution of our time,” Chung said during the interview, while also wearing goggles and a face mask. Chung is based in Hong Kong, and the phrase he spoke has become a rallying slogan for pro-democracy protesters.\n\n\n\nOn Tuesday, Blizzard announced that Chung's prize money had been rescinded and that he was suspended from competitive play for a year. The two casters interviewing him were also fired.\n\nAccording to Blizzard, Chung violated 2019 Hearthstone Grandmasters Official Competition Rules section 6.1, which forbids any act that \"brings you into public disrepute, offends a portion or group of the public, or otherwise damages Blizzard image.\"\n\n\"Grandmasters is the highest tier of Hearthstone Esports and we take tournament rule violations very seriously,\" said a statement from Blizzard. \"After an investigation, we are taking the necessary actions to prevent similar incidents from happening in the future.\"\n\nBlizzard also took down video of the interview, but it's still being shared on social media.", "description": "Memers are turning popular characters, like Overwatch's Mei, into pro-democracy protesters.", "authors": ["Lauren Strapagiel", "Buzzfeed News Reporter"], "top_image": "https://img.buzzfeed.com/buzzfeed-static/static/2019-10/9/19/campaign_images/5af98b90bbd9/theres-a-blizzard-boycott-movement-after-a-hearth-2-1915-1570650655-0_dblbig.jpg", "published_at": "2019-10-09"}