{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/katie-price-confirms-romance-fiance-20590222", "downloaded_at": "2019-10-16 14:03:03.738503+00:00", "title": "Katie Price confirms romance with fiance Kris Boyson is back on as she shares sweet post", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nKatie Price has well and truly moved on from toyboy ex Charles Drury as she's confirmed her romance with former fiance Kris Boyson is up and running again.\n\nPricey, 41, shared a rather sweet Instagram post to prove she's back with her ex.\n\nGushing over personal trainer Kris, she wrote: \"The world is going to throw us a million reasons why this isn't going to work out between us, but I'm armed with the one reason why it will...\"\n\nShe continued: \"...I LOVE YOU!\" with a hand drawn love heart to sign off the message.\n\nIt looks like their romance is back on the cards again despite her move to 22-year-old Charles after meeting him on Instagram back in August.\n\n(Image: Instagram)\n\nThe former glamour model shared the message just moments after she posted a deep quote which could also have been aimed at hunky Kris.\n\n\"Maybe I'm scared because you mean more to me than any other person,\" the quote reads.\n\n(Image: Instagram)\n\nAnd it's quite suggestive towards a certain blond beau. The quote continued: \"You are everything I think about, everything I need, everything I want.\"\n\nKris and Katie are once again smitten - despite her moving builder Charles into her home during her and Kris' break-up - and are \"back to being loved-up again like they never split.\"\n\n(Image: CRYSTAL PIX / SplashNews.com)\n\nAccording to The Sun , a source told: \"He's taken her back and they're already moving some of his things back into the house.\n\n\"They're officially back on - everyone's shocked that he didn't make it harder for her, but they're back to being loved-up again like they never split up.\"\n\n(Image: Youtube)\n\nThe relationship turned sour for engaged Katie and Kris back in August when the glamour model dumped the personal trainer for Charlie - however now it seems all has been forgiven.\n\nA rep for Katie has been contacted by Mirror Online.", "description": "The glamour model gushed over the fitness trainer on her Instagram story, confirming their romance is on", "authors": ["Brogan-Leigh Hurst", "Image", "Instagram", "Crystal Pix", "Splashnews.Com", "Youtube"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20584027.ece/ALTERNATES/s1200/1_Kris-Boyson-and-Katie-Price.jpg", "published_at": "2019-10-16"}