{"pub": "cbc", "title": "How Spoiling a Dog Taught Me to Be the Grandparent I’d Always Wanted to Be", "url": "https://cbc.ca/parents/learning/view/how-owning-a-dog-prepared-me-to-be-grandparent", "language": "en", "published_at": "2018-10-18", "downloaded_at": "2019-09-02 09:03:09.150814+00:00", "text": "In 2010, my then 59-year-old husband said, “You get Margaret ready and I’ll open the C-A-R so we can take her to C-A-M-P.”\n\nI was 59, and I added, “OK, and I’ll bring a small bag of T-R-E-A-T-S, in case she gets hungry.”\n\nWe weren’t talking about a grandchild, because we didn't have one — yet. We were talking about our English bulldog.\n\nYou'll Also Love: We Got a Dog and My Kids Still Help a Year Later\n\nIt occurred to me when I took Margaret for a W-A-L-K that we had resorted to spelling words around her. It reminded me of when our kids were toddlers and would demand, “We need candy.” Just the mention of treats instigates a tantrum similar to a child.\n\nWe bought Margaret in 2008, and she’s the first dog we’ve ever owned. Why would middle-aged, empty-nesters introduce such a huge canine commitment into their lives? Maybe it’s because we had all this grandparental love to lavish on a willing recipient, and no willing recipient. Luckily for us, our dog laps up as much attention as we’re willing to pour out.\n\nColourful rubber toys and mangled stuffed animals dot our living room, kitchen and office floors. We have to be careful to not trip over Margaret’s play things, because at our age, we could break a hip.\n\nI work out of our home, and it used to be that I had a good day if I met all my writing deadlines. Now, I measure the quality of my day by whether Margaret pees and poos on schedule. In fact, I am amazed at how the words “pee,” “poo” and “bum” have made their way back into our everyday vocabularies.\n\nIn fact, I am amazed at how the words 'pee,' 'poo' and 'bum' have made their way back into our everyday vocabularies.\n\nI worry about Margaret as though she’s a toddler. Is she getting into something that can harm her? Does she have a tummy ache? Will the zipper she just ate make her sick?\n\nWe bought her a kids’ playhouse for the back deck, and yes, we have clothing for her — although she’s grown out of her pink plaid Chanel spring coat. Our pièce de résistence was dressing her as Queen Victoria for a greeting card.\n\nHow did we get her to sit still enough to say cheese? We bribed her with cheese. Like her mother (namely, me), she’ll do anything for food. She may be an English bulldog, but I think some of my Italian ancestry rubbed off on her.\n\nMargaret has won awards, but not for professional dog competitions. She received a trophy for best costume at the 2009 Sunderland Maple Syrup Festival, where we dressed her as a fairy, complete with wings and tiara. A couple of months later, we entered her photo into a competition at the Stouffville Country Market, and she was chosen as most adorable dog. We’re so proud, like a grandparent watching a grandchild's recital.\n\nYou'll Also Love: Multi-Generational Living — Why I Welcome My Dad Moving In\n\nShe gets occasional pieces of popcorn, and when we go out, we leave the TV set to her favourite show, Murder, She Wrote. In other words, we’ve turned into the kind of dog owners I used to criticize. But it has prepared us for grandchildren, who need love and support and attention.\n\nFive years ago, my daughter finally plopped a squishy newborn into our waiting arms, so we’ve had someone else to buy cute little clothes and toys for. Two years later, that same daughter presented us with twin boys, so we have ample wee ones to love.\n\nSo, here’s my advice to those of you who are thinking of getting a bulldog or becoming grandparents: remember that training is the key to happiness. That’s going well here since Margaret and our grandkids have us doing pretty much everything they want.\n\n", "description": "We weren't sure if we'd have grandkids. Then we had three. But first came a dog named Margaret.", "authors": [], "top_image": "https://www.cbc.ca/parents/content/imgs/_8col/grandparentdog_lead_123RD.jpg"}