{"pub": "businessinsider", "url": "https://businessinsider.com/millennial-craft-brewer-pioneering-non-alcoholic-beer-2019-10", "downloaded_at": "2019-10-19 11:35:21.781383+00:00", "title": "A millennial craft brewer pioneering a boom in nonalcoholic beer shares 7 marketing strategies he says drove production from 1,000 to 15,000 barrels in one year", "language": "en", "text": "Alcohol consumption is declining among younger generations, and more of them are looking for satisfying alternatives to drink. Wellness and environmental concerns are driving a surge in foods and beverages that are more compatible with a healthy lifestyle.\n\nThe nonalcoholic-beer category hasn't seen major innovation in 25 years, and the available products have long disappointed beer connoisseurs. The 35-year-old Bill Shufelt saw a business opportunity on the long-neglected shelf of the beer aisle at grocery and liquor stores.\n\nWith the launch of Athletic Brewing Co., Shufelt is leading a transformation of booze-free beer using innovative techniques and e-commerce.\n\nShufelt spoke with Business Insider and shared the key insights and strategies that have supercharged his volume and revenue growth by more than 10 times in the first year of production.\n\nVisit BI Prime for more stories.\n\nIt's not impossible — and it could be the perfect drink to pair with your Beyond Meat burger: a nonalcoholic IPA that actually tastes like its boozy brethren.\n\nThe brewer and entrepreneur Bill Shufelt was inspired to reinvent nonalcoholic beer when he was reflecting on his lifestyle choices in the months before getting married.\n\nHe quit drinking alcohol, but he still missed the social and culinary enjoyment that beer once provided. So in 2018, he launched Athletic Brewing Co. with the craft brewer John Walker to offer a full line of nonalcoholic beers in their home state of Connecticut.\n\n\"It's something I really got obsessed with,\" Shufelt said in a recent interview with Business Insider. \"Our goal was to make good craft beer that just happens to be nonalcoholic.\"\n\nBusiness Insider spoke with Shufelt to hear how he was able to grow his business from 1,000 barrels in 2018 up to an expected 2019 total of more than 15,000.\n\nWhen existing products don't satisfy the need\n\nThe alcohol content of beer is highly dependent on brewing factors like time, temperature, acidity, and processing. Throughout history, brewers have used a variety of practices to offer libations like session ales, small beer, or near beer.\n\nModern nonalcoholic beer has been around in the US since the days of Prohibition but hadn't been the center of any major brewers' strategy. The pace of change in the segment was glacial.\n\n\"The landscape had been totally stagnant for 25 years,\" Shufelt said. \"There was no demand for the prior products that evolved with the existing shelf, so there'd been no marketing, no attention, no innovation on those brands.\"\n\nBeer enthusiasts turned up their noses at the available mass-produced lagers, and few brewers seemed to notice or care.\n\n\"Because the beers didn't sell, no one thought there was a market,\" he added.\n\nThere's probably a reason something's wrong, so figure out why\n\nShufelt discovered that the mass producers were using blunt techniques to remove alcohol from their lagers and ales, which imparts a bland or bitter taste to the options available at most grocery or liquor stores.\n\n\"We started with the baseline that, because these techniques have been around so long, people would be using them to make good beer if it was possible,\" Shufelt said.\n\nWith the expertise of his cofounder John Walker, the Athletic team set about developing a custom process to ferment their beer without crossing the 0.5% alcohol-by-volume threshold. And they didn't constrain their inspiration to the history of beer.\n\n\"Fermented foods are very in trend right now for health-conscious adults,\" Shufelt said. \"People love all sorts of fermented foods, like kimchi, kombucha — even some fruit juices and breads are fermented foods.\"\n\nNutritionally, beer has a lot to offer that is in line with those increasingly popular foods and beverages, and Shufelt sees his product tapping into that consumer demand.\n\n\"Beer actually has a lot of very positive elements: electrolytes, potassium, calcium,\" he said. \"It's just that the word 'nonalcoholic' carries a huge stigma in beer.\"\n\nCultivate local and social supports for business success\n\nThe stigma associated with the term \"nonalcoholic\" made the initial attempts a big challenge.\n\n\"It's something that people were laughing at five years ago,\" Shufelt said. \"I couldn't get anyone to talk to me, but thankfully, John believed in me, and the trends are kind of falling in behind us now.\"\n\nShufelt and Walker stuck with the plan and were rewarded with the support of a few angel investors who shared Shufelt's vision for the company and its market potential.\n\nThe decision to locate Athletic's facilities an hour north of New York City in Stratford, Connecticut, was a careful one. Not only was there strong support from the state and city governments, but colleagues at Stratford's award-winning Two-Roads Brewing Co. also welcomed the new arrival with open arms.\n\n\"It's really nice that our business models are so complementary,\" Shufelt said. \"They do a full range of amazing alcoholic beers, and we do a range of nonalcoholic beers. They sell our beer in their taproom and are amazing neighbors.\"\n\nSpencer Platt/Getty Images\n\nDefine your mission and your team will come\n\nAt the launch, Athletic's team consisted of just three employees; it has grown to 24 today. Despite a tight labor market, Shufelt said he has had no trouble finding talent and hasn't needed to post job ads.\n\n\"We've got a very clear mission centered around positive impact both for people's health and wellness and the environment,\" he said. \"That really has spoken to people from all industries, and we've kind of been a magnet for people attracted to our mission.\"\n\nThe company may not post help-wanted ads, but its outreach helps its team feel connected to Athletic's commitment to health and the environment.\n\nShufelt said the company has donated 2% of sales since day one to hiking-trail-cleanup efforts around New England and organizes a monthly company outing to do the dirty work themselves. Business Insider even spotted an Athletic beer tent at a recent half-marathon.\n\n\"Most of those donations are driven by the trail systems that we love using or that our customers recommend,\" he said.\n\nInnovative products open untapped sales channels\n\nThe US government doesn't recognize beverages as beer when they have less than a half percent of alcohol by volume, and that is creating an unprecedented sales channel for craft beer: e-commerce.\n\nAthletic is traditionally distributed in stores and bars from Pennsylvania to Maine, but Shufelt said nationwide online sales drove as much as half of their business. Sometimes that figure ticks below half, when consumer demand outstrips Athletic's supply capacity.\n\n\"Some of our e-commerce releases sell out a hundred cases in 30 seconds,\" Shufelt said. \"It's a pretty ridiculous demand for online beer releases, which is great — and we love our enthusiastic community.\"\n\nIn response to Athletic's surging business, the company moved production in June to a facility that is double its original space.\n\n\"We now have a 20,000-square-foot brewery, but it was immediately too small,\" Shufelt said. \"By July, it was totally full. It's been pretty fun.\"\n\nNew sales channels lead to new data and insights\n\nWith a totally unique sales channel for craft beer, Shufelt is learning even faster about the market for his product.\n\n\"Beer has never had e-commerce availability before, just because of alcohol laws, but we're neither alcohol nor beer by the federal definition, so we can ship,\" he said.\n\n\"The great thing is we can interact directly with all our customers. We know who they are. We know where we're selling beer,\" he added. \"So we have a totally different dataset and level of access to our customers than beer companies normally get.\"\n\nWith his capacity maxed out in Connecticut, Shufelt said strong demand from areas like Colorado, California, and the Pacific Northwest were guiding his next expansion.\n\n\"I definitely think we're going to be making beer somewhere west of the Mississippi sometime in 2020,\" he said.\n\nAnticipate long-term societal change\n\nWhen asked how his product compares with the increasing popularity of plant-based meat alternatives, like Impossible Burger and Beyond Meat, Shufelt said Athletic beers were a strong complement.\n\nHe also draws encouragement from health-focused beverage brands like Honest Tea, whose founder, Seth Goldman, is now the executive chairman on the board of Beyond Meat.\n\n\"I was fortunate enough to meet Seth from Beyond Meat, who was a huge inspiration for how I live my lifestyle,\" he said. \"I do think how there's very low levels of vegetarianism right now, that is going to be surging in the future, and I think reduced alcohol intake will too.\"\n\nBefore Athletic's arrival, some contract brewers were making individual runs of nonalcoholic beer, and a handful of other full-line breweries have since arrived on the scene.\n\nMarket-research surveys indicate that millennials and Gen Zers are drinking less than older generations, often for health and wellness reasons.\n\n\"People take so much care to feel good — working out, eating well — and alcohol is inconsistent with that,\" Shufelt said. \"We want to help people just be healthy, active, and at their best.\"\n\nOther craft brewers, like Brooklyn Brewery, are seeing the same potential that Athletic has identified and expanding their lineups to include nonalcoholic offerings.\n\n\"I definitely think it's a lifestyle change that's here to stay,\" Shufelt said.", "description": "The nonalcoholic-beer category hasn't seen major innovation in 25 years — but the 35-year-old Bill Shufelt saw a business opportunity.", "authors": ["Dominick Reuter"], "top_image": "https://image.businessinsider.com/5daa15e54af90913ff1f5c72?width=1200&format=jpeg", "published_at": "2019-10-18"}