{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/4/dc-council-hold-hate-crimes-enforcement-hearing", "downloaded_at": "2019-09-05 02:17:08.368662+00:00", "title": "D.C. Council to hold hate crimes enforcement hearing", "language": "en", "published_at": "2019-09-04", "text": "D.C. Council member Charles Allen said Wednesday he will schedule after summer recess a hearing on the increase of hate crimes in the city and the lack of prosecution of those crimes by the Office of the U.S. Attorney for the District of Columbia.\n\n“I certainly heard from many LGBT residents that are hurt by this, frightened by this, that are concerned that when hate comes into our city, we don’t have a proper response from a prosecution standpoint,” said Mr. Allen, Ward 6 Democrat.\n\nHe said plans to schedule in October a hearing by the Judiciary and Public Safety Committee, which he chairs.\n\nD.C. Delegate Eleanor Holmes Norton last week sent a second letter to U.S. Attorney Jessie K. Liu about her office’s decline in prosecutions as the city sees an increase in hate crimes, especially against the LGBT community. She said she had gotten no response to her first letter requesting information in July.\n\n“I am concerned about the low prosecution rates by your office compared to those of other cities,” Ms. Norton wrote in a letter dated Aug. 28. “I would like an explanation for the very high declination rate for hate crime prosecutions by your office and whether these declination decisions stemmed from a lack of resources or from other causes.”\n\nShe requested a response to her letter within 15 days.\n\nThe Metropolitan Police Department said it investigated 205 hate crimes last year, 94 of which were for committed against people because their sexual orientation, gender identity or expression.\n\nThe department made 59 arrests for those crimes, and only three of those arrests were prosecuted by the U.S. attorney’s office, according to a story by The Washington Post.\n\nAs of June, 45 of the 108 hate crimes committed this year targeted persons for their sexual orientation or gender identity, according to police.\n\nMs. Liu, who was appointed in 2017 by President Trump, did not respond to a request for comment.\n\nPolice Lt. Brett Parson, commanding officer of the Special Liaison Branch, said he understands Ms. Norton’s and the LGBTQ community’s frustration over the lack of prosecutions but noted that it’s tricky to prove someone’s motivation in a crime.\n\nMotivation is “normally not something that needs to be proven when you are prosecuting a crime,” Lt. Parson said.\n\nThe Special Liaison Branch conducts outreach to marginalized and underserved communities, which Lt. Parson said puts the division “at the tip of the spear with regards to bias-related crimes response.”\n\nDoron Ezickson, a director in D.C. office of the Anti-Defamation League, said successful hate crime enforcement has three components: a comprehensive hate crime law, adequate police infrastructure and priority in prosecution. He said the District has the first two components and needs more resources to meet the third factor.\n\nLt. Parson said a key to reducing hate crimes is changing people’s thinking through uncomfortable conversations among communities, families and police.\n\n“What you are talking about is people’s mindset. You are talking about the way people think, their beliefs, morals and ethics. None of those things are impacted by law enforcement or prosecutors, those are all impacted by the way we raise our children and educate them,” the police lieutenant said.\n\nLt. Parson attributed some of the increase in hate crimes to more people feeling safe in reporting such crimes to police — a product of better technology and better training among the police force.\n\n“There is also no question that the particular environment and divisiveness in our society we are facing right now has generated a higher level of hate crimes across the country,” Mr. Ezickson said.\n\nAccording to the District’s Bias-Related Crime Act of 1989, a court can fine or sentence a hate crime felon up to 1.5 times the maximum amount for the underlying crime.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "D.C. Council member Charles Allen said Wednesday he will schedule after summer recess a hearing on the increase of hate crimes in the city and the lack of prosecution of those crimes by the Office of the U.S. Attorney for the District of Columbia.", "authors": ["The Washington Times Http", "Sophie Kaplan"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2018/07/09/IMG_7221_c0-0-5184-3022_s1770x1032.JPG?f8af44803671c941549f723d1fe30bad83d555a9"}