{"pub": "heritage", "url": "https://heritage.org/budget-and-spending/report/policies-strengthen-the-presidents-fy-2021-budget", "downloaded_at": "2019-10-03 23:25:47.923173+00:00", "published_at": "2019-10-03", "title": "Policies to Strengthen the President’s FY 2021 Budget", "language": "en", "text": "Balancing the budget and reducing the national debt are critical to the economic well-being of current and future generations. While the economy is currently performing well, projected budget deficits and cumulative debt are worsening. This is rare for a time where the country is experiencing economic growth and low unemployment.\n\nThe Congressional Budget Office’s (CBO’s) latest Budget and Economic Outlook projects that the deficit will rise to $960 billion by the end of fiscal year (FY) 2019 (which ended this week), $181 billion higher than for FY 2018. The CBO projects that deficits will surpass the trillion-dollar threshold in FY 2020, and will climb to $1.4 trillion annually by the end of the next decade. Debt is projected to rise by more than $12.6 trillion through 2029.REF\n\nPresident Donald Trump’s first three budget proposals made tremendous progress toward reducing the scope and reach of the federal government. The FY 2018 budget proposal would have balanced in 10 years. The two subsequent budget proposals would not have balanced within a decade. However, the proposals would have cut deficits by $4.4 trillion and $2.8 trillion over 10 years, respectively, compared to the Administration’s current baseline spending projections.REF\n\nReducing deficits is important, and the President should also pursue budgets that balance within 10 years. It is critical that lawmakers pursue policies to bring the budget back to balance. The President’s budget acts as a template to inform Congress’s annual budget process and lays out the Administration’s fiscal principles. It is important that the Administration show that balancing within 10 years is still achievable. Doing so would provide the public with a symbolic victory over the mounting deficits of recent years.\n\nIf the president abandons the goal of balancing the budget over 10 years, he abandons a key fiscal target and emboldens Congress to do the same.\n\nThe Heritage Foundation’s Blueprint for Balance paves a clear path to balancing the federal budget with detailed and specific recommendations across all budget categories, from right-sizing annual appropriations to reforming entitlement programs and privatizing certain federal assets. In addition, important legislative policy riders provide specific proposals by which Congress can leverage the annual appropriations process to advance conservative policy objectives.\n\nThe Blueprint for Balance has proven influential in both Congress and the Administration’s budget process. The Administration fully or partially included 61 percent of the most recent Blueprint’s proposals in its FY 2020 budget submission.REF For the President’s budget to be successful, it must have support among lawmakers. Past budget resolutions produced by the House and Senate Budget Committees, as well as the House Republican Study Committee, have also incorporated many of the proposals contained in the Blueprint for Balance. There is significant policy agreement between the President’s budget, the Republican Study Committee budget, and the Blueprint for Balance,REF and conservatives are likely to support additional reforms along these lines.\n\nWith that in mind, this Backgrounder expands on policies recommended by Heritage analysts that the Administration has partially embraced, highlights policies that the President’s budgets have not addressed, and even identifies new options not included in the FY 2020 Blueprint for Balance. This Backgrounder explicitly excludes policies that the Administration has previously rejected, per our analysis. The federal government could save an additional $271 billion in FY 2021 if lawmakers implement all of the policy recommendations included in Table 1.\n\nHowever, these reforms alone will not be enough to divert the debt-driven economic crisis that the country could soon face. The reason for the worsening fiscal situation is clear: Above-average revenues cannot keep up with out-of-control spending growth, particularly the growth in Social Security and health care entitlement spending. Over the next decade, revenues are projected to rise steadily, averaging 17.4 percent of gross domestic product (GDP). Meanwhile, the CBO projects that spending will rise above 23 percent of GDP by FY 2028.REF\n\nPresident Trump has built much of his presidency on the positive economic impacts of the tax cuts in the Tax Cuts and Jobs Act (TCJA) of 2017. Runaway spending is a direct threat to the progress made by the President’s pro-growth economic agenda. No matter how strong the economy is, economic growth will not be able to keep pace with projected spending growth. It also means that the TCJA, one of the President’s signature legislative victories, may be short lived. If deficits continue to rise, it may be harder for conservative lawmakers to make the case for permanently extending the 2017 tax cuts.\n\nThe proposals put forth by the Administration make tremendous progress toward reducing the size and scope of the federal government. It is critical that the President continue to pursue even bolder reforms that will further limit the role of the federal government, and reduce spending and debt. This Backgrounder provides policies to help the Administration move closer to those goals. Strong leadership from President Trump is essential to reducing the footprint of the federal government and returning the nation’s budget to a sustainable path.\n\nRomina Boccia is Director of the Grover M. Hermann Center for the Federal Budget, of the Institute for Economic Freedom, at The Heritage Foundation. Justin Bogie is Senior Policy Analyst in Fiscal Affairs in the Hermann Center. David Ditch is Research Associate in the Hermann Center.", "description": "Balancing the budget and reducing the national debt are critical to the economic well-being of current and future generations. While the economy is currently performing well, projected budget deficits and cumulative debt are worsening. This is rare for a time where the country is experiencing economic growth and low unemployment.", "authors": ["Romina"], "top_image": "https://www.heritage.org/themes/heritage/src/images/bell.png"}