{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7597577/Ernst-Young-held-seminar-female-executives-dress-men.html", "downloaded_at": "2019-10-22 13:54:04.423243+00:00", "title": "Ernst & Young told female executives how to dress in 'sexist' seminar", "language": "en", "text": "Accounting firm Ernst & Young held a training seminar for female employees during which they were told not to flaunt their bodies because 'sexuality scrambles the mind'.\n\nThe seminar, which was called Power-Presence-Purpose, was held at the firm's New Jersey offices in June last year.\n\nAbout 30 female executives attended the day-long training seminar on leadership and empowerment.\n\nA female employee, who attended the seminar when she was an executive director at the firm, leaked the 55-page training document they were given to the Huffington Post this month.\n\nAccounting firm Ernst & Young held a training seminar for female employees in June last year during which they were told not to flaunt their bodies because 'sexuality scrambles the mind'\n\nThat employee, who has since left the global accounting company, did not want to be named.\n\nThe presentation was delivered by outside consultant Marsha Clark and its aim was to teach female employees how to grow their networks and build better teams.\n\nOne section advises women about being 'polished' in their appearance. It goes on to suggest they should have a 'good haircut, manicured nails, well-cut attire that complements your body type'.\n\n'Don't flaunt your body - sexuality scrambles the mind (for men and women),' the training documents states.\n\nWomen were advised that the most important thing they could do professionally was 'signal fitness and wellness'.\n\nThere was also a list of 'invisible rules' for men and women included in the presentation.\n\nWomen were told to 'speak briefly', 'phrase their thoughts and ideas as questions' and 'wait their turn (that never comes) and raise their hands'.\n\nThe employee who leaked the document claimed the rules were presented as expectations when she participated in the training.\n\nShe said the woman giving the presentation gave them advice on how to interact with men at work, including that women shouldn't directly confront men in meetings, don't talk face-to-face with men because they see it as a threat and don't be too outspoken or aggressive.\n\nShe said those in the room were told that it was harder for women to focus because their brains take in information like pancakes absorb syrup. They were told that me can focus better because their brains collect information like waffles in each square.\n\nWhen contacted about the specific training, an EY spokesperson said the program had been under review for several months.\n\nThey said that version hadn't been offered since the June 2018 event that the female employee attended.\n\nThe company said it was one of many training programs they offered to male and female employees.\n\nThey said they offered it after female employees requested it.\n\nThe spokesperson said any 'isolated aspects' of the training were taken wholly out of context.", "description": "The seminar for female employees, which was called Power-Presence-Purpose, was held at Ernst & Young's New Jersey offices in June last year.", "authors": ["Emily Crane For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/19/20003154-0-image-a-12_1571683352009.jpg", "published_at": "2019-10-21"}