{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7631087/Catherine-Tyldesley-keeps-Strictly-fitness-regime.html", "downloaded_at": "2019-10-30 16:13:45.201768+00:00", "title": "Catherine Tyldesley keeps up with Strictly fitness regime", "language": "en", "text": "Catherine Tyldesley was the fifth star to be voted off Strictly Come Dancing on Sunday.\n\nAnd despite getting tearful while discussing her premature exit on It Takes Two, the actress was on fine form when she stepped out in Hale Village, Cheshire on Wednesday.\n\nThe soap star, 36, made the most of her toned figure in a pair of purple leggings and leather jacket, slinging a Chanel bag around her shoulders.\n\nBouncing back: Catherine Tyldesley looked on fine form when she stepped out in Hale Village, Cheshire on Wednesday... days after her early Strictly Come Dancing exit\n\nShe embraced a vibrant colour theme by completing her outfit with a pink top and a pair of matching trainers.\n\nThe star kept warm thanks to a patchwork scarf in muted shades of grey knotted around her neck.\n\nLooking like she was en route to the gym, Catherine flashed a smile as she headed out for a busy day of errands.\n\nStepping out: The soap star, 36, made the most of her toned figure in a pair of purple leggings and leather jacket, slinging a Chanel bag around her shoulders\n\nBusy: Looking like she was en route to the gym, Catherine flashed a smile as she headed out for a busy day of errands\n\nCatherine was overwhelmed with emotion as she struggled to rewatch her last dance with her professional partner Johannes Radebe on Monday's edition of It Takes Two.\n\nDuring an interview with host Rylan Clark-Neal, the TV star admitted she's 'gutted' over her departure and even confessed her painful elimination felt like a 'divorce'.\n\nThe actress and the South African dancer, 32, performed their Cha Cha at the end of the show's Halloween Week, after scraping the bottom of the leaderboard with a score of 24 out of a possible 40.\n\nEmotional: Catherine was overwhelmed with emotion as she struggled to rewatch her last dance with her professional partner Johannes Radebe on Monday's edition of It Takes Two\n\nAs the sister show began to air a clip of their doomed performance, the Scarborough star sharply exclaimed: 'Let's not... no!'\n\nReflecting on her short stint, the media personality said: 'I'm gutted. I kind of thought, hoped that we had a couple of weeks left. I struggled with the Cha Cha, it was evil!'\n\nCatherine - who shares Alfie, three, with husband of three years, Tom Pitfield - later compared her axe to the breakdown of a marriage: 'I feel like I've gone through a divorce and I've got Jojo!'\n\n'Friendship for life, it's absolutely phenomenal', the brunette beauty enthused about choreographer Johannes.\n\nPainful: During an interview with host Rylan Clark-Neal, the former Corrie star, 36, confessed her elimination felt like a 'divorce' (pictured on the show over the weekend)\n\nOverwhelmed: As the sister show began to air a clip of their doomed performance, the Scarborough star sharply exclaimed: 'Let's not... no!'\n\nCandid: Reflecting on her short stint, the media personality said: 'I'm gutted. I kind of thought, hoped that we had a couple of weeks left'\n\nThe competition series was hit by fix rumours as fans claimed news anchor Mike Bushell - who was saved over Catherine - avoided the chop as he works for the BBC as a breakfast presenter.\n\nOn Monday, host Mike, 53, and his wife Emily hit back at trolls on Twitter who have slammed the BBC Breakfast presenter after he was saved by judge Shirley Ballas.\n\nThe TV star was told to 'f**k off' by vicious viewers of the ballroom show, with others branding it 'a fix', given that Mike is a BBC employee.\n\nThe barrage of abuse endured by the father-of-three including tweets such as: 'That strictly decision was the biggest fix ever, just because Mike is a BBC employee.'\n\nBold: Catherine - who shares Alfie, three, with husband of three years, Tom Pitfield (pictured together in 2017) - later compared her axe to the breakdown of a marriage\n\nPals forever: 'Friendship for life, it's absolutely phenomenal', the brunette beauty enthused about the choreographer\n\nAnother posted: 'F**k this #Strictly result! if Shirley and Craig thought Mike stomping around the floor was better than Catherine they are deluded! Shirley has hated Catherine since the start and had it in for her. Shirley needs her head testing! ITS A FIX - Mike can p**s off and so can Katya!'\n\nSomeone else raged: 'Have the judges been told to keep the BBC personality in? Catherine has been good each week, certainly better than Mike and had more potential. Poor and unfair decision in my opinion!'\n\n'What a fix!! MIKE BUSHELL?! What a load of s***e! You've ruined this year's competition for thousands of people including me and my mother!'\n\nShock: The competition series has been hit by fix rumours as fans alleged news anchor Mike Bushell avoided the axe over Catherine because he works for the BBC as a presenter\n\nMike defiantly appeared on BBC Breakfast to defend himself, already at rehearsals for his next dance.\n\nHe said: 'It's an entertainment show, we're all trying our best, you're not really competing against anybody else, you compete against yourself to try and learn to get better and better each week, even if its just learning a couple of new steps.\n\n'As a non-dancer all I can do is put the hours in, do my best and get through it. You have to rise above the abuse on social media, that's one of the sad things about social media.\n\nUproar: Fans took to Twitter to slam the outcome of Sunday's show\n\n'All you can do is do your best, accept the judges' decision and move on. Johannes and Catherine are lovely people, I didn't want to see them go but someone has to go.\n\n'It's like football - you have to accept the referee's decision. [The judges] are the best judges in the world, they do know what they're talking about, if they'd sent me home that would have been the best decision, I can't get involved in any of that.\n\n'I just have to concentrate on improving, and if Katya is happy with what I'm doing then I'm happy.'\n\nMoving on: On Monday, host Mike, 53, and his wife Emily (pictured earlier this year) hit back at trolls on Twitter who slammed the BBC Breakfast host after he was saved\n\nBiting back: 'Wow the abuse! Painful. We’re beyond gutted Catherine and Johannes have left but Mike danced well and deserves his spot,' Emily tweeted", "description": "Catherine Tyldesley was the fifth star to be voted off Strictly Come Dancing on Sunday.", "authors": ["Kate Thomas For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/15/20383396-0-image-a-16_1572450391883.jpg", "published_at": "2019-10-30"}