{"pub": "metro", "url": "https://metro.co.uk/2019/10/12/ronnie-wood-admits-shocked-still-alive-decades-living-rock-roll-lifestyle-10908392", "downloaded_at": "2019-10-13 00:22:46.773144+00:00", "title": "Rolling Stones' Ronnie Wood shocked to be alive after lifetime of excess", "language": "en", "text": "Ronnie Wood admits he’s shocked to still be alive (Picture: Getty Images)\n\nRolling Stones star Ronnie Wood has joked that the biggest shock of his new documentary, Somebody Up There Likes Me, is that he’s still alive today to make it.\n\nAhead of the London premiere on Saturday evening, the 72-year-old opened up on what fans can expect from the feature – despite not yet seeing the complete project himself – and he promised it will be a ‘buzz’ before excitedly heading on into the screening with his proud wife, Sally, in tow.\n\nRonnie told Metro.co.uk: ‘There’s a lot of revelations, in that I’m still here today!’\n\nBeaming from ear to ear, the rocker laughed: ‘Fans will be like, “Wow! How’d he get through that one?”‘\n\nTalking about the parts of the film he’d seen, it sounds as though things will get emotional as the Honky Tonk Women hitmaker revealed how survival was a key factor throughout.\n\nAdvertisement\n\nAdvertisement\n\n‘The great thing [in the documentary] is the essence of survival,’ the star affirmed: ‘And like I said, the support was reflected throughout the cuts that I’ve seen of the movie the short clips I’ve seen.’\n\nThe star opened up about his new documentary, Somebody Up There Likes Me (Picture: WireImage)\n\nExplaining that he’s ‘touched’ by what the producer Mike Figgis has done with the film, he smirked: ‘To see it all together… Well, it’s going to be a buzz.’\n\nThe icon looked suave as he rocked on up the evening dressed in a tailored black suit that he’d matched with a white shirt – making sure his top button was undone.\n\nHe attended the premiere with his wife Sally (Picture: Getty Images)\n\nHis 31-year-old wife joined the guitarist and appeared in high spirits as she stunned in a floral white gown – despite the heavy rain on the evening.\n\nRonnie’s new documentary will take a look at his entire career that spans over five incredible decades.\n\nIt’s been billed as the first-ever in-depth film biography of the star and promises to get brutally honest over his relationship with drugs, and that rock and roll lifestyle.\n\nAs well as the legend himself, Sir Mick Jagger, Keith Richards and Charlie Watts will also be interviewed as part of the movie, with Sir Rod Stewart, from his former band Faces, having his say too.\n\nAdvertisement\n\nAdvertisement\n\nWhen the project was first announced, filmmaker Mike explained: ‘The combination of [Ronnie’s] eclectic musical range and his love of painting seemed like a promising start to a documentary.’\n\nSomebody Up There Likes Me premieres tonight, 12 October, at London’s Film Festival.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: The Chase’s Jenny Ryan leaves viewers ‘speechless’ on X Factor: Celebrity with Queen cover\n\nMORE: Gogglebox star George Gilbey jailed for drink-driving year after assaulting ex-girlfriend", "description": "Ronnie Wood admits he's shocked to still be alive after decades of living rock and roll lifestyle.", "authors": ["Abigail Gillibrand"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1180654740_1570915646.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-12"}