{"pub": "yahoo", "url": "https://news.yahoo.com/were-just-trying-play-woman-153427947.html", "downloaded_at": "2019-10-19 14:10:34.609526+00:00", "title": "'We Were Just Trying to Play': Woman Posing as Police Officer Scolds Teens on Texas Playground", "language": "en", "text": "A group of teenagers was aggressively scolded by a woman posing as a police officer in Fort Worth, Texas, on October 16 as they a played on a swing in a park.\n\nIn a video shared to Twitter, a girl can be seen laughing as she used a large round swing at the Dream Park in Fort Worth. Her laughter is interrupted by shouting from a woman off-camera repeatedly saying “stop” and “this is a children’s park.”\n\nA blond woman then approaches the girl and slams her hands on the swing to stop it from moving. A girl standing nearby tells the woman “we are children,” and the woman replies, “No, you’re f***ing not.”\n\nThe woman then shouts at the group: “Well, I’m a f***ing PD. So get the f*** out of here now if you’re not here to play as a child.” As the group of teens begins to leave the park, the blond woman continues to shout at one girl and tell her that she is not a child. She can be heard saying, “I could literally arrest you as a f***ing adult.”\n\nThe Fort Worth Police Department (FWPD) confirmed that the woman was not a Fort Worth police officer. FWPD said she was a “possible local resident.”\n\n“We are actively investigating this incident for several potential criminal charges including Impersonating a Public Servant and Disorderly Conduct. We #ThankYou for all the tip & messages we received,” FWPD added. Credit: Crystal via Storyful", "description": "A group of teenagers was aggressively scolded by a woman posing as a police officer in Fort Worth, Texas, on October 16 as they a played on a swing in a park. In a video shared to Twitter, a girl can be seen laughing as she used a large round swing at the Dream Park in Fort Worth. Her laughter is interrupted by shouting from a woman off-camera repeatedly saying “stop” and “this is a children’s park.” A blond woman then approaches the girl and slams her hands on the swing to stop it from moving. A girl standing nearby tells the woman “we are children,” and the woman replies, “No, you’re f***ing not.” The woman then shouts at the group: “Well, I’m a f***ing PD. So get the f*** out of here now if you’re not here to play as a child.” As the group of teens begins to leave the park, the blond woman continues to shout at one girl and tell her that she is not a child. She can be heard saying, “I could literally arrest you as a f***ing adult.” The Fort Worth Police Department ( FWPD ) confirmed that the woman was not a Fort Worth police officer. FWPD said she was a “possible local resident.” “We are actively investigating this incident for several potential criminal charges including Impersonating a Public Servant and Disorderly Conduct. We #ThankYou for all the tip & messages we received,” FWPD added. Credit: Crystal via Storyful", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/d7.ZxSlQ33cThc0FpGSHdw--~B/aD0zNTA7dz02NTY7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-US/video/video.storyful.com/b2f367db48e509c5c49f42d7bcedfeb8", "published_at": "2019-10-18"}