{"pub": "fox", "url": "https://foxnews.com/health/arizona-teen-icu-vape-illness-mom-feels-total-failure", "downloaded_at": "2019-10-15 23:06:19.142810+00:00", "title": "Arizona teen in ICU with vape illness, mom feels like 'total failure'", "language": "en", "text": "An Arizona mother said she had no idea that her 16-year-old daughter had been vaping for the last two years until she was found unresponsive and landed in the intensive care unit for a lung illness.\n\n“Devastated as a parent, I feel like a total failure,” Betty Ford, whose daughter Samantha was rushed to Phoenix Children’s Hospital after being found “pretty much lifeless,” told Fox 10 Phoenix.\n\nCDC GIVES VAPING-RELATE LUNG ILLNESSES A NAME\n\n“I tried to get her off the bed but she was pretty much lifeless,” Ford told the news outlet. “I tried to do CPR but I couldn’t because there was so much mucus and fluid coming out of her mouth.”\n\nSamantha was put on life support after doctors determined that there was damage to her lungs and low heart function. She’s slowly started recovering and has come off life support, but doctors estimate she’ll remain hospitalized for at least the next five weeks, Fox 10 reported.\n\nCHEMICAL BURNS FROM VAPING? LUNG DAMAGE RESEMBLES MUSTARD GAS EXPOSURE, MAYO CLINIC DOCTOR SAYS\n\nSamantha’s case joins the chorus of dozens of other vape-related lung illnesses, which the Centers for Disease Control and Prevention (CDC) recently started referring to as EVALI, which stands for “e-cigarette or vaping product use associated lung injury.”\n\nAs of Oct. 8, 49 states have reported EVALI illnesses, with 21 states reporting 26 deaths due to the epidemic. While officials have not pinpointed any one particular ingredient or product that’s been linked to the illnesses, they have reported that more than 80 percent of cases involve THC products.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nFord said that police who entered her daughter’s room after she called 911 for help found nicotine oils and various vape products. She said she hopes her daughter’s brush with death serves as a warning to her friends.\n\n“I’m thinking that maybe seeing her this way might wake them up and that it can happen,” Ford told Fox 10.", "description": "She said her daughter's friends revealed that the teen had been vaping for two years without her knowledge.", "authors": ["Alexandria Hein"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/15/694940094001_6095005266001_6095008636001-vs.jpg", "published_at": "2019-10-15"}