{"pub": "bbc", "url": "https://bbc.com/news/technology-50234141", "downloaded_at": "2019-10-30 10:09:05.490498+00:00", "title": "Facebook agrees to pay Cambridge Analytica fine to UK", "language": "en", "text": "Image copyright Getty Images Image caption Facebook's chief executive has repeatedly declined to answer questions from UK MPs about the scandal\n\nFacebook has agreed to pay a £500,000 fine imposed by the UK's data protection watchdog for its role in the Cambridge Analytica scandal.\n\nIt had originally appealed the penalty, causing the Information Commissioner's Office to pursue its own counter-appeal.\n\nAs part of the agreement, Facebook has made no admission of liability.\n\nThe US firm said it \"wished it had done more to investigate Cambridge Analytica\" earlier.\n\nJames Dipple-Johnstone, deputy commissioner of the ICO said: \"The ICO's main concern was that UK citizen data was exposed to a serious risk of harm. Protection of personal information and personal privacy is of fundamental importance, not only for the rights of individuals, but also as we now know, for the preservation of a strong democracy.\"\n\nHarry Kinmonth, a Facebook lawyer, noted that the social network had made changes to restrict the information app developers could access following the scandal.\n\n\"The ICO has stated that it has not discovered evidence that the data of Facebook users in the EU was transferred to Cambridge Analytica,\" he added.\n\n\"However, we look forward to continuing to cooperate with the ICO's wider and ongoing investigation into the use of data analytics for political purposes.\"\n\nResearcher Dr Aleksandr Kogan and his company GSR used a personality quiz to harvest the Facebook data of up to 87 million people.\n\nSome of this data was shared with London-based Cambridge Analytica.\n\nThe ICO argued that Facebook did not do enough to protect users' information.", "description": "The social network has dropped an appeal against a £500,000 penalty from UK's privacy watchdog.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/6A01/production/_102473172_059df995-ac13-4786-ba16-c36ca210fb4a.jpg", "published_at": "2019-10-30"}