{"pub": "huffpost", "url": "https://huffpost.com/entry/kawhi-leonard-sister-kimesha-williams-murder_n_5d74c876e4b06451356fa133", "downloaded_at": "2019-09-08 23:26:56.504640+00:00", "title": "Sister Of NBA Star Kawhi Leonard Reportedly Charged In 84-Year-Old Woman's Death", "language": "en", "text": "A woman who is reportedly the sister of Los Angeles Clippers star Kawhi Leonard has been arrested in connection with the robbery and death of an 84-year-old at a California casino.\n\nAfaf Anis Assad died on Wednesday after being attacked at the Pechanga Resort Casino in Temecula over Labor Day weekend, police said.\n\nKimesha Williams, 35, is one of two women who’s been charged with first-degree murder and robbery in the incident, a spokesman for the Riverside County Sheriff’s Department told the Los Angeles Times.\n\nThe spokesman would not comment on Williams’ connection with Leonard but the Riverside Press-Enterprise said a relative of the 28-year-old NBA star confirmed the pair were brother and sister.\n\nAccording to court documents, surveillance footage showed Williams and 39-year-old Candace Townsel following Assad into a casino bathroom on the morning of Aug. 31. The two women exited the bathroom minutes later and left the premises; an unconscious Assad was found by a witness ― her skull broken and her purse, which had about $1,000 inside, missing.\n\nExclusive: Riverside County woman charged with murdering and robbing elderly woman at a casino is a sister of Clippers star Kawhi Leonard. https://t.co/Xjrp1zwbfw — Brian Rokos (@Brian_Rokos) September 7, 2019\n\nInvestigators described Williams in court documents as having “a violent history,” the Press-Enterprise said.\n\nThe outlet added that Williams has been convicted of numerous crimes in the past including petty theft, grand theft auto and attempted robbery.\n\nWilliams is currently being held without bail at the Indio Jail, the LA Times reported.\n\nWilliams’ bail had initially been set at $1 million, but a sheriff’s investigator filed a request with a judge to hold her without bail because of concerns that she might flee. She “has family that are well-off and could post her bail,” the investigator wrote.\n\nLeonard, who signed a three-year, $103 million deal with the Clippers in July, was not mentioned in the court documents.\n\nThe NBA player has not publicly commented on the arrest.", "description": "Kimesha Williams, 35, has been charged with murder and robbery in the death of the woman at a California casino.", "authors": ["Senior Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d74d100230000c703512794.jpeg?cache=upctq0avmd&ops=1778_1000", "published_at": "2019-09-08"}