{"pub": "thehill", "url": "https://thehill.com/policy/national-security/467537-key-impeachment-testimony-what-weve-learned-so-far", "downloaded_at": "2019-10-28 00:29:09.114426+00:00", "title": "Key impeachment testimony: What we've learned so far", "language": "en", "text": "A handful of witnesses have already turned over evidence to House Democrats painting what party leaders describe as a damning picture of President Trump Donald John Trump Comey: Mueller 'didn't succeed in his mission because there was inadequate transparency' During deposition, official says he made several efforts to advocate for Marie Yovanovitch Bolton looms large as impeachment inquiry accelerates MORE’s efforts to pressure Ukraine into opening politically charged investigations that might benefit his reelection.\n\nIn the weeks ahead, they seem determined to talk to many more officials. In a sign of their pace, lawmakers will depose one witness on Saturday after taking two days off at the end of the work week as former Rep. Elijah Cummings Elijah Eugene CummingsSchiff says committees are making 'rapid progress' in impeachment probe Trump lashes out at Pelosi, slams San Francisco district as 'very bad and dangerous' Chairman Cummings' 'phenomenal' team MORE (D-Md.) was honored with memorial services.\n\nADVERTISEMENT\n\nDemocrats say they intend to lock down more interviews to strengthen their case.\n\n“As you know, five sources is better than two or three,” Rep. Tom Malinowski Thomas (Tom) MalinowskiSchiff says committees are making 'rapid progress' in impeachment probe Trump rages against 'garbage' Ukraine probe ahead of latest witness deposition Large majority says they are following impeachment inquiry closely: poll MORE (D-N.J.), a member on one of the three House committees investigating the Ukraine affair, remarked to reporters Wednesday.\n\nHere is what we've learned so far from snippets of key witness depositions.\n\nKurt Volker Kurt VolkerBolton looms large as impeachment inquiry accelerates Schiff says committees are making 'rapid progress' in impeachment probe White House official to corroborate diplomat's version of Ukraine events: report MORE\n\nVolker, the former U.S. special envoy to Ukraine, is named as someone who tried to help Ukrainian officials “navigate” the president’s demands on Ukraine in a whistleblower’s report that helped spark the impeachment inquiry.\n\nVolker discussed the administration’s decision to withhold aid to Ukraine in text messages with two other U.S. diplomats — U.S. Ambassador to the European Union Gordon Sondland and William Taylor, the top diplomat to Ukraine.\n\nDemocrats, who released the text conversations, say the messages are evidence of a quid pro quo involving the aid and Trump’s demands for investigations.\n\n“Heard from White House — assuming President Z convinces trump he will investigate / 'get to the bottom of what happened' in 2016, we will nail down date for visit to Washington,” Volker said in one message with Andrey Yermak, a top adviser to Ukraine President Volodymyr Zelensky.\n\nRepublicans, who have called for a full transcript of Volker's Oct. 3 testimony to be released, say his testimony and the messages show there was no promise to withhold Ukraine aid in exchange for an investigation of former Vice President Joe Biden Joe BidenDuring deposition, official says he made several efforts to advocate for Marie Yovanovitch Bolton looms large as impeachment inquiry accelerates Giuliani associate used small town in Ukraine to gain influence with American figures: report MORE.\n\n“The president has been crystal clear no quid pro quo’s of any kind,” Sondland wrote in one message to Taylor after he said he had spoken directly to the president.\n\nBut after pushing back on Taylor's quid pro quo view, Sondland said he and the other diplomats should end their conversation, something that has been viewed with suspicion by Democrats and other observers.\n\n“The president is trying to evaluate whether Ukraine is truly going to adopt the transparency and reforms that President Zelensky promised during his campaign,” Sondland wrote in a message. “I suggest we stop the back and forth by text.”\n\nMarie Yovanovitch\n\nYovanovitch, the ousted U.S. Ambassador to Ukraine, bluntly described what she viewed as a shadowy effort by Trump and other officials to pressure the State Department to remove her.\n\n“Although I understand that I served at the pleasure of the President, I was nevertheless incredulous that the U.S. government chose to remove an Ambassador based, as best as I can tell, on unfounded and false claims by people with clearly questionable motives,” she testified on Oct. 11.\n\nADVERTISEMENT\n\nYovanovitch identified Trump’s personal attorney Rudy Giuliani Rudy GiulianiDuring deposition, official says he made several efforts to advocate for Marie Yovanovitch Bolton looms large as impeachment inquiry accelerates Giuliani associate used small town in Ukraine to gain influence with American figures: report MORE and his associates as taking part in the effort to discredit her.\n\n“I do not know Mr. Giuliani’s motives for attacking me. But individuals who have been named in the press as contacts of Mr. Giuliani may well have believed that their personal financial ambitions were stymied by our anti-corruption policy in Ukraine,” her prepared remarks read.\n\nThe longtime civil servant said that when she learned of her firing, a superior at the State Department said there had been a “concerted campaign against” her and that “the Department had been under pressure from the President” to remove her since last summer.\n\nYovanovitch denied claims that she made disparaging remarks about Trump, which is an allegation some critics of hers passed along to Secretary of State Mike Pompeo Michael (Mike) Richard PompeoDuring deposition, official says he made several efforts to advocate for Marie Yovanovitch Schiff says committees are making 'rapid progress' in impeachment probe State Dept. official broached Pompeo's role in Ukraine in new testimony MORE.\n\n“Equally fictitious is the notion that I am disloyal to President Trump. I have heard the allegation in the media that I supposedly told the Embassy team to ignore the President’s orders ‘since he was going to be impeached.’ That allegation is false,” Yovanovitch testified.\n\nFiona Hill\n\nHill, a former top Russia expert at State, testified on what she viewed as a dangerous shadow foreign policy led by Giuliani, Sondland and acting White House chief of staff Mick Mulvaney John (Mick) Michael MulvaneyCompany with ties to Trump's brother awarded million government contract: report Kelly says he warned Trump against hiring 'yes man' to avoid impeachment Trump considers selling DC hotel MORE, The New York Times reported earlier this month.\n\nHill, who testified on Oct. 14, told House investigators that former national security adviser John Bolton John BoltonBolton looms large as impeachment inquiry accelerates US restores trade benefit to Ukraine after delay Key witness in impeachment investigation asks federal judge to rule on testifying MORE was so alarmed by news of Trump officials’ Ukraine contacts that he asked Hill to notify the chief lawyer for the National Security Council (NSC) about such efforts.\n\n“I am not part of whatever drug deal Sondland and Mulvaney are cooking up,” Bolton told Hill, according to her reported testimony.\n\nHill also said she believed Sondland created a counterintelligence risk because his inexperience could be exploited, according to a separate report by the Times.\n\nGeorge Kent\n\nKent, a top State Department official, testified on Oct. 15 about efforts by Trump and Giuliani to oust Yovanovitch and get Zelensky to open a corruption investigation into Biden, according to one Democratic lawmaker who offered a series of details about what the diplomat said during his lengthy closed-door deposition.\n\n“What I can say is he was clearly bothered by the role Mr. Giuliani was playing and the disinformation he was spreading,” Rep. Gerry Connolly Gerald (Gerry) Edward ConnollyDemocrats say whistleblower deposition no longer central to impeachment investigation: report Speier to run for Oversight gavel Overnight Energy: Watchdog warns of threats to federal workers on public lands | Perry to step down on December 1 | Trump declines to appear in Weather Channel climate special MORE (D-Va.), a member of the House Oversight and Reform Committee, told reporters after leaving the gathering.\n\nConnolly said Kent, who serves as Deputy Assistant Secretary of State, expressed concerns with what he described as an informal alliance between three figures wrapped up in the Ukraine affair who worked in concert against Yovanovitch.\n\nThe individuals included Giuliani; Yuriy Lutsenko, Ukraine's former chief prosecutor; and John Solomon, a former opinion contributor at The Hill, who wrote a series of columns critical of the Bidens.\n\n“Lutsenko had his own vendettas — one of which apparently was to get at our ambassador, to get her out of the way. And he persuaded Giuliani that she was a problem for him too. And then Giuliani then persuaded the president,” Connolly said. “And it's sort of this unholy alliance — or unholy triad — that somehow managed to seize control of U.S. foreign policy with respect to Ukraine.”\n\nIn a win for Republicans, Kent also told congressional investigators that he had voiced concerns in early 2015 about a conflict of interest for Hunter Biden to work for Burisma, a Ukrainian energy company, a source familiar with the deposition confirmed to The Hill.\n\nThe source said Kent testified that he expressed concerns to an unidentified Biden official about the situation. The official told Kent that Biden didn’t have the bandwidth to focus on Hunter’s business matters because the family was consumed with their other son, Beau, who was battling cancer.\n\nGordan Sondland\n\nSondland in his Oct. 17 testimony further tied Giuliani to the Trump administration’s foreign policy towards Ukraine, while also seeking to distance himself from Trump officials’ efforts to get Ukraine to launch two politically motivated probes.\n\nSondland testified that he was disappointed when the president directed diplomats to work with his personal lawyer on such matters, according to his prepared remarks for testimony that were widely disseminated.\n\n“We were also disappointed by the President’s direction that we involve Mr. Giuliani. Our view was that the men and women of the State Department, not the President’s personal lawyer, should take responsibility for all aspects of U.S. foreign policy towards Ukraine,” he testified.\n\n“However, based on the President’s direction, we were faced with a choice: We could abandon the goal of a White House meeting for President Zelensky, which we all believed was crucial to strengthening U.S.-Ukrainian ties and furthering long-held U.S. foreign policy goals in the region; or we could do as President Trump directed and talk to Mr. Giuliani to address the President’s concerns,” his remarks continue, while condemning any efforts to get a foreign nation involved in a domestic election.\n\nSondland denied knowledge of efforts to get Ukraine to investigate Biden, saying that he did not make the connection that Hunter Biden served on Burisma’s board — a statement has raised some eyebrows given published reports and Giuliani's public interviews on the matter.\n\nSome Democrats have claimed Sondland has some explaining to do, suggesting that he may have misled lawmakers during his deposition.\n\nThe wealthy hotelier and GOP mega-donor also maintained that Trump stressed during a phone conversation with him that there was no quid pro quo for the Ukraine financial aid.\n\nWilliam Taylor\n\nTaylor told House investigators that he believed the Trump administration withheld aid to Ukraine in an effort to get Zelensky to launch politically motivated investigations, according to his opening statement.\n\n“[T]he push to make President Zelensky publicly commit to investigations of Burisma and alleged interference in the 2016 election showed how the official foreign policy of the United States was undercut by the regular efforts led by Mr. Giuliani,” Taylor said in his prepared remarks, which were obtained by The Hill and other outlets.\n\nTaylor also implicated several Trump officials in what he described as a secret, shadowy foreign policy led by Giuliani and Sondland.\n\n“During our call on September 8, Ambassador Sondland tried to explain to me that President Trump is a businessman. When a businessman is about to sign a check to someone who owes him something, he said, the businessman asks that person to pay up before singing the check,” Taylor told investigators on Oct. 22, in a roughly 10-hour closed-door testimony\n\nLeaving Taylor’s deposition, Democrats called his interview one of the most powerful they have heard so far, while Republicans have sought his attack his record and undercut his testimony as being in conflict with other officials like Sondland.", "description": "A handful of witnesses have already turned over evidence to House Democrats painting what party leaders describe as a damning picture of President Trump’s efforts to pressure Ukraine into opening politically charged investigations that might benef", "authors": [], "top_image": "https://thehill.com/sites/default/files/impeachment_volkerkurt_hillfiona_taylorwilliam_102519gn_getty_as.jpg", "published_at": "2019-10-27"}