{"pub": "independent", "url": "https://independent.co.uk/voices/brexit-boris-johnson-no-deal-insulin-diabetic-stockpile-medication-a9114481.html", "downloaded_at": "2019-09-22 15:26:30.477587+00:00", "title": "I usually punch up, but the views of some Brexiteers are so diabolical I have to make an exception", "language": "en", "text": "If you wanted an example of the callous selfishness of hardline Brexiteers, the BBC sure dug one up on the streets of Birmingham.\n\nIt was another series of vox pops, canvassing the views of “ordinary people”. (They never seem to take place in Remain areas, but there you go.)\n\n“I’m a diabetic. I rely on insulin but I still want to leave,” said one of the people who was interviewed.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe reporter, appearing shocked, followed up by asking the man if he would think it a price worth paying if his insulin didn’t arrive. That is a real risk if Boris Johnson and his fundamentalist Tory pals get the no deal outcome they crave.\n\nThe response: “Yeah I do, because we voted to leave.”\n\nShape Created with Sketch. Opposing protesters flock to parliament on would be date of Brexit Show all 30 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Opposing protesters flock to parliament on would be date of Brexit 1/30 Pro-Brexit leave the European Union supporters attend a rally in Parliament Square after the final leg of the \"March to Leave\" in London AP 2/30 The protest march which started on March 16 in Sunderland, north east England, finished on what was the original date for Brexit to happen before the recent extension Reuters 3/30 AP 4/30 Reuters 5/30 PA 6/30 Reuters 7/30 EPA 8/30 A Brexit supporter sips a can of Stella in protests outside of the Houses of Parliament AFP/Getty 9/30 Dedicated anti-Brexit campaigner Steve Bray and likewise pro-Brexit campaigner Joseph Afrane go head to head near the Houses of Parliament AFP/Getty 10/30 A pro-Brexit marching band in Parliament Square Getty 11/30 Remain supporters wave EU flags from a bus in Parliament Square PA 12/30 A Brexit supporter shouts slogans outside parliament EPA 13/30 A Brexit supporter protests outside parliament Reuters 14/30 A Brexit supporter protests outside of the Houses of Parliament Getty 15/30 Brexit supporters protest outside of the Houses of Parliament REUTERS 16/30 A pro-Brexit flag is waved in Parliament Square AP 17/30 The March to Leave nears the Houses of Parliament Reuters 18/30 A Brexit protester holds a sign outside parliament EPA 19/30 Brexit supporters carry the coffin of democracy AFP/Getty 20/30 Brexit supporters march outside parliament AFP/Getty 21/30 Brexit supporters take part in the March to Leave protest in London PA 22/30 Brexit supporters protest outside parliament AFP/Getty 23/30 A Brexit supporter holds a sign outside the Houses of Parliament Getty 24/30 A man holds satirical paintings of politicians Reuters 25/30 An pro-Brexit float on the March to Leave march in London Reuters 26/30 Far-right activist Tommy Robinson addresses protesters outside the Houses of Parliament Getty 27/30 A Brexit supporter outside the Houses of Parliament Reuters 28/30 A Tommy Robinson supporter arrives at the Houses of Parliament Getty 29/30 A jogger gestures rudely at a Brexit supporter outside of the Houses of Parliament AFP/Getty 30/30 A Brexit supporter outside the Houses of Parliament PA 1/30 Pro-Brexit leave the European Union supporters attend a rally in Parliament Square after the final leg of the \"March to Leave\" in London AP 2/30 The protest march which started on March 16 in Sunderland, north east England, finished on what was the original date for Brexit to happen before the recent extension Reuters 3/30 AP 4/30 Reuters 5/30 PA 6/30 Reuters 7/30 EPA 8/30 A Brexit supporter sips a can of Stella in protests outside of the Houses of Parliament AFP/Getty 9/30 Dedicated anti-Brexit campaigner Steve Bray and likewise pro-Brexit campaigner Joseph Afrane go head to head near the Houses of Parliament AFP/Getty 10/30 A pro-Brexit marching band in Parliament Square Getty 11/30 Remain supporters wave EU flags from a bus in Parliament Square PA 12/30 A Brexit supporter shouts slogans outside parliament EPA 13/30 A Brexit supporter protests outside parliament Reuters 14/30 A Brexit supporter protests outside of the Houses of Parliament Getty 15/30 Brexit supporters protest outside of the Houses of Parliament REUTERS 16/30 A pro-Brexit flag is waved in Parliament Square AP 17/30 The March to Leave nears the Houses of Parliament Reuters 18/30 A Brexit protester holds a sign outside parliament EPA 19/30 Brexit supporters carry the coffin of democracy AFP/Getty 20/30 Brexit supporters march outside parliament AFP/Getty 21/30 Brexit supporters take part in the March to Leave protest in London PA 22/30 Brexit supporters protest outside parliament AFP/Getty 23/30 A Brexit supporter holds a sign outside the Houses of Parliament Getty 24/30 A man holds satirical paintings of politicians Reuters 25/30 An pro-Brexit float on the March to Leave march in London Reuters 26/30 Far-right activist Tommy Robinson addresses protesters outside the Houses of Parliament Getty 27/30 A Brexit supporter outside the Houses of Parliament Reuters 28/30 A Tommy Robinson supporter arrives at the Houses of Parliament Getty 29/30 A jogger gestures rudely at a Brexit supporter outside of the Houses of Parliament AFP/Getty 30/30 A Brexit supporter outside the Houses of Parliament PA\n\nNow, I usually prefer to kick upwards in these columns, and we’ll get to that, but for this person who is willing to drag me, along with hundreds of thousands of other diabetics and their loved ones, down into a pit with them, I’m going to make an exception.\n\nThat man is a first class arse. Not the sort of thing you’d expect to see in a family newspaper? Tell me how you’d feel about someone happy for you to die for you in pursuit of their twisted cause.\n\nIt has been pointed out to me that this was someone who’d just had a camera poked in their face, something they were probably unused to. They might have come up with a different response had they had the time to think their words through.\n\nThen again, perhaps not. Perhaps it would take their blood turning into a sticky syrup, their mouth feeling like the bottom of a hamster’s cage, their experiencing a thirst that’s impossible to slake, which are the typical symptoms an insulin dependent diabetic like me will experience if we don’t get our insulin prior to death by organ failure.\n\nIt’s often said that Brexit is more like a religious faith than a political movement because the rational arguments have all been demolished and reality has debunked the claims made by the Leave campaign during the EU referendum. You know, the ones that held that leaving the EU would be easy, and we could have our cake and eat it (per the BoZo in Number 10 Downing Street) and we’d get rich quick if only the dead hand of Brussels were removed from the mighty Britannia.\n\nAsk people like that man in Birmingham how they think their lives will be improved by Brexit, and what the EU has done to inspire such a venomous hate that they’re willing to die and kill other people along with them, and they probably couldn’t answer. The high priests of the church of Brexit struggle with that, so they turn instead to myth.\n\nWhat the Beeb’s man shows us is that at its fringes, and increasingly at its core, their Brexit religion is turning into a cult and a death cult at that. We’re talking al-Qaeda, perhaps, the Branch Davidians under cult leader David Koresh, or one of those other unhinged sects with a penchant for murder/suicides that crop up every now and again.\n\nBuckle up, and let’s mow down them diabetics, and cancer patients, and epileptics, and people with heart conditions and, well you name it.\n\nThoughtful people often like to argue that the cult’s followers should be listened to and that the grievances they have are legitimate, if misdirected. I confess that I grow weary of this view.\n\nThere are millions of people with similarly legitimate grievances who haven’t chosen to buy into a destructive and potentially lethal ideology dreamed up in the debating societies of posh boys who speak of “ordinary people” with contempt when they’re dining in their clubs.\n\nThere is also a substantial number of people who have united under the Remainer Now banner because they have thought through the implications of what’s been happening and realised that they were sold a pup.\n\nThat man talked to the BBC about “democracy”. It’s not democracy if you don’t allow for the fact that people can change their minds.\n\nHowever, as much as I was angered by his callous lack of regard for the lives of other people with his condition, it is ultimately those posh boys who are to blame. They cooked this dish. Into the hot water of grievance bubbling on a hob that they created, they stirred lies, and hatred, and then added a sprinkling of racism.\n\nThe sentiments expressed by that man are the foul tasting result.", "description": "If you wanted an example of the callous selfishness of hardline Brexiteers, the BBC sure dug one up on the streets of Birmingham.  It was another series of vox pops, canvassing the views of “ordinary people”. (They never seem to take place in Remain areas, but there you go.) “I’m a diabetic. I rely on insulin but I still want to leave,” said one of the people who was", "authors": ["James Moore"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/20/09/brexit-protest.jpg", "published_at": "2019-09-21"}