{"pub": "realclearpolitics", "url": "https://fivethirtyeight.com/features/if-this-is-trumps-best-case-the-ukraine-scandal-is-looking-really-bad-for-him", "downloaded_at": "2019-09-26 14:53:45.936571+00:00", "title": "If This Is Trump’s Best Case, The Ukraine Scandal Is Looking Really Bad For Him", "language": "en", "text": "Sometimes, when a news story is still unfolding in real time, we can’t do much better than to hazard a guess about how it will affect the polls. Of course, we can also not hazard a guess — that is, we can not say anything about it at all. But given that I wrote yesterday about public opinion surrounding the impeachment of President Trump, this is one time when I think it’s worth weighing in on the latest development; namely, the White House’s decision to release, on Wednesday, Trump’s reconstructed conversation (note: not a verbatim transcript) with Ukrainian president Volodymyr Zelensky.\n\nThis conversation seems to have triggered a nearly Yanny or Laurel-like reaction in my Twitter feed, almost as though people are seeing and hearing two different things. Everyone either seems to think it’s either really bad for Trump, or not very damaging at all, with few people landing in between.\n\nAnd I’m not that rare person who hears it both ways. No. I’m on the side that says it’s bad for Trump. And like the Yanny or Laurel thing or The Dress, I have trouble seeing how people see it any other way.\n\nBut I’d also say you shouldn’t take that guess very seriously. Our track record when using statistical models is pretty darn good, but when I’m in guess mode, I don’t claim to be much better than a replacement-level pundit.\n\nWith that said, there is a little bit of polling data that points in the bad-for-Trump direction (more about that in a moment). And for the record, this is relatively new territory for me. Up until now, I’ve been skeptical of the political wisdom of impeachment for Democrats, as yesterday’s post detailed.\n\nThe logic behind my this-is-bad-for-Trump guess is that the White House’s record of Trump’s conversation with Zelensky represents the best–case scenario for Trump. And that best-case scenario is still potentially fairly bad for him. They have Trump on record as imploring a foreign leader to investigate Joe Biden, one of his most likely opponents in the 2020 general election.\n\nThe White House’s spin is that the conversation is exculpatory because it doesn’t contain a “quid pro quo” — that is, a direct and explicit threat to Zelensky or a direct and explicit promise to him — in exchange for turning the screws on Biden. The problem for the White House is that its spin presumes three things to be true, all of which seem debatable:\n\nFirst, it presumes that the public actually cares about the quid pro quo, rather than viewing Trump telling a foreign leader to investigate a political rival as a prima facie abuse of presidential powers. Or, to use a term that Trump wouldn’t like, the public might see it as prima facie evidence of “collusion” between Trump and a foreign power that aims to influence the election — the sort of direct evidence that was lacking in the Mueller report.\n\nSecond, the White House line presumes that the public won’t see the White House’s record of the conversation as containing a quid pro quo. But there are plenty of readings by which it does. In the conversation, Trump directly invokes the idea of “reciprocity” between the United States and Ukraine. He says “we do a lot for Ukraine …. We spend a lot of effort and a lot of time.” Zelensky also discusses the purchase of Javelin missiles from the U.S. All of this comes before two fairly direct requests — Trump calls the first one a “favor” — that Trump makes of Zelensky, one concerning a cybersecurity firm called CrowdStrike and the other concerning Biden.\n\nThird, it presumes that there won’t be more evidence of a quid pro quo that emerges later on. Given how rapidly the story is developing, that doesn’t seem like a safe bet, either.\n\nYou might object that the public won’t care so much about the technical details here. But that potentially cuts both ways. The public could view the quid pro quo part to be a technicality and see Trump’s “favors”/demands/requests of Zelensky to be the nut of the story.\n\nAnd keep in mind that Trump has more to lose than to gain when it comes to public opinion on impeachment. Until now, a fairly sizable number of voters — somewhere around 15 percent of the electorate — has both disapproved of Trump and disapproved of efforts to impeach him. If the hardcore Trump partisans are the only ones who believe the White House’s spin, his impeachment numbers would get worse, although his approval ratings might not.\n\nAs far as polling evidence for how the public feels about Ukraine, there isn’t much of it, but there is some, and it isn’t great for Trump. A YouGov poll on Tuesday asked voters how they’d feel about impeachment if Trump “suspended military aid to Ukraine in order to incentivize the country’s officials to investigate his political rival”; 55 percent of voters supported impeachment in that case, 26 percent opposed it. The problem is that, so far, the delay in military aid has not been proven to be related to Trump’s requests of Zelensky on Biden. We don’t know how much that matters to the American public. Hopefully, pollsters will ask voters different versions of questions about impeachment over Ukraine that can test the importance of the quid pro quo. Meanwhile, polling from Reuters/Ipsos suggests that while relatively few Americans knew much about the Ukraine scandal before today, those who had heard of it were more supportive of impeachment.\n\nThat’s all we’ve really got to work with, for now. We will, of course, track the polls in the upcoming days.", "description": "Sometimes, when a news story is still unfolding in real time, we can’t do much better than to hazard a guess about how it will affect the polls. Of course, we c…", "authors": ["Nate Silver"], "top_image": "https://fivethirtyeight.com/wp-content/uploads/2019/09/GettyImages-1170493074-1.jpg?w=575", "published_at": "2019-09-25"}