{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-tennis-olympics-federer/federer-confirms-tokyo-olympics-participation-idUKKBN1WT1ST", "downloaded_at": "2019-10-15 08:01:58.554371+00:00", "title": "Federer confirms Tokyo Olympics participation", "language": "en", "text": "(Reuters) - Roger Federer confirmed his participation in next year’s Olympic Games in Tokyo and said on Monday that he had listened to his heart before making the decision.\n\nFILE PHOTO: Tennis - Shanghai Masters - Men's Singles - Quarterfinals - Qi Zhong Tennis Center, Shanghai, China - October 11, 2019. Roger Federer of Switzerland in action against Alexander Zverev of Germany. REUTERS/Aly Song\n\nThe Swiss 38-year-old competed in the first of four Olympic Games at Sydney in 2000 and won the doubles gold partnering Stan Wawrinka in 2008 and a silver in singles in 2012. He missed the 2016 Olympics due to a knee injury.\n\n“At the end of the day my heart decided I would love to play the Olympic Games again,” Federer told reporters during a promotional event for his sponsor Uniqlo in Tokyo.\n\nFederer will attempt to win a singles gold medal at the July 24-Aug 9 Games, the only major prize that the 20-time Grand Slam winner has yet to win.\n\n“I’ve been debating with my team for a few weeks now, months actually, what I should do in the summer after Wimbledon and before the U.S. Open (in 2020),” Federer, who will turn 39 during the Games, added.\n\n“I carried the flag twice for Switzerland in Athens and Beijing, I’ve got a gold and a silver, and I would love to play again so I’m very excited.”\n\nFederer will require an exemption to compete in Tokyo as he is yet to play in the Davis Cup for Switzerland in the current Olympic cycle that began after the Rio Olympics in 2016.\n\nTo fulfil the ITF participation requirements, a player must be part of a Davis Cup or Fed Cup team and present at the tie on at least three occasions in the Olympic Cycle, provided one of those ties is in 2019 or 2020.\n\nFederer will have little reason to worry, however, as one of the special conditions that could gain him entry is his historical participation in the Games and the Davis Cup, as stated in the ITF's regulations here\n\nSwitzerland's national tennis federation confirmed here it would appeal to the ITF for Federer's inclusion.", "description": "Roger Federer confirmed his participation in next year's Olympic Games in Tokyo and said on Monday that he had listened to his heart before making the decision.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191014&t=2&i=1440745619&w=1200&r=LYNXMPEF9D16Y", "published_at": "2019-10-14"}