{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7614253/Belles-Britain-glamorous-Rugby-World-Cup-WAGS-cheering-England-Wales-stars.html", "downloaded_at": "2019-10-26 07:29:57.799781+00:00", "title": "Belles of Britain! The VERY glamorous Rugby World Cup WAGS cheering on their England and Wales stars", "language": "en", "text": "Rugby fans are in for a treat this weekend with two epic clashes, as England takes on reigning champions New Zealand today and Wales play South Africa tomorrow in the World Cup semi-finals.\n\nThe two British sides will no doubt be grateful for the support of their glamorous wives and girlfriends - the rugby WAGs - many of whom will be cheering them on from the stands.\n\nEngland manager Eddie Jones is said to have taken a relaxed stance to players mixing with their families while the tournament's on.\n\nThough with some partners expecting babies and looking after little ones at home, not all of them have made the journey to Japan and will be screaming on their boys in front of the TV.\n\nHere FEMAIL provides the lowdown on the rugby WAGs from both squads...\n\nENGLAND\n\nMEGAN BROWSE (HENRY SLADE)\n\nHenry Slade paid tribute to his partner Megan Browse on Instagram earlier this month, thanking her for attending some of the earlier games in Japan\n\nThe stunning couple, pictured on holiday on the Greek island of Santorini in June, often post loved-up snaps on Instagram\n\nThe couple certainly made the most of their time in Kobe, enjoying a traditional meal out in a local restaurant\n\nSlade may have been dropped to the bench after he was recalled at outside centre for the quarter-final win over Australia last Saturday, but he's still the number one pick of girlfriend Megan.\n\nThe Exeter Chiefs player, 26, paid tribute to his partner on Instagram earlier this month, thanking her for attending some of the earlier games in Japan.\n\nThe couple certainly made the most of their time in Kobe, enjoying a traditional meal out in a local restaurant.\n\nThe pair share an adorable cockapoo called Frank - with Sladey so devoted to the pooch he's been known to have his name embossed on his rugby boots. Megan isn't jealous at all...\n\nALEX JOHNS (MAKO VUNIPOLA)\n\nSaracens star Mako flew back early from England's tour of South Africa last year to attend the birth of his first child, Jacob\n\nClearly a mega proud dad, Mako often shares cute snaps of his and Alex's little boy on Instagram - while Alex prefers to stay out of the spotlight\n\nAlex and Mako welcomed their first child - a little boy called Jacob Fe’ao-moe-Lotu Vunipola - in June last year at Southmead Hospital.\n\nThe Saracens star flew back early from England's tour of South Africa to attend the birth.\n\nAlex clearly likes to shy away from the limelight, as her Instagram account is private, but proud dad Mako often shares adorable snaps of their son on his page.\n\nVunipola, whose brother Billy is also in the squad, has been a first-choice player for England since 2016.\n\nMICHELLE CUSSELL (ELLIOT DAVY)\n\nChildhood sweethearts Elliot and Michelle recently tied the knot in France after meeting when they were just 18\n\nBlonde beauty Michelle looked stunning in a classic white gown with delicate lace cap sleeves and wore her hair in a loose updo\n\nElliot married long-term girlfriend Michelle in a romantic ceremony in France in June this year, after he proposed in Mykonos in 2017.\n\nBlonde beauty Michelle looked stunning in a classic white gown with delicate lace cap sleeves and wore her hair in a loose updo.\n\nThe couple met at the £18,618-a-year Whitgift School for boys in Croydon, south London, where Daly was a pupil and Michelle worked as a sports events organiser – though they were both 18 at the time.\n\nSOPHIE MAY (JONNY MAY)\n\nWinger Jonny will be cheered on by his stunning wife-of-two-years Sophie Snook, whom he married in July 2017. Pictured together in Vancouver in May\n\nThe couple's Instagram feeds are filled with shots of the couple enjoying sporting events, including a day out watching the play on Centre Court at Wimbledon\n\nFans will be relieved to hear Jonny May has been cleared to start today, having recovered from a hamstring injury.\n\nAnd the winger will be cheered on by his stunning wife-of-two-years Sophie Snook, whom he married in July 2017.\n\nSophie is more than a match for her husband in the sporting stakes, it seems, as the blonde-haired fitness fanatic earns her living as a personal trainer, posting regular updates on her @Girlsontopoffitness Instagram page.\n\nMeanwhile, her husband is known as the joker in the England pack - and used to play football with Ed Sheeran when he was a child growing up in Somerset.\n\nJESSICA PORTMAN (GEORGE FORD)\n\nPerfect match! Jessica is a regular at the Leicester Tigers stadium, where Ford plays his club rugby\n\nJessica has been regularly sharing stylish snaps of her posing on the streets of Tokyo, suggesting she'll be there in person to cheer on her man\n\nJess posted this sweet 'Meghan and Harry-esque' engagement shot after George popped the question in June\n\nLondon Boutique owner Jessica, 26, will certainly be bringing the style as she cheers on fiance George - who will return as fly-half for the semi-final after being benched last weekend.\n\nOriginally from Bath, brunette Jessica is a graduate in Business and Fashion from Manchester University and recently launched her own fashion store in London - an eponymous boutique called Portman.\n\nThe couple have been dating for nearly four years and announced their engagement in June. Jessica has been regularly sharing stylish snaps of her posing on the streets of Tokyo, suggesting she'll be there in person to cheer on her man.\n\nThe Michelle Keegan-lookalike is a regular at the Leicester Tigers stadium, where George plays his club rugby. She's also a regular on the clearly devoted rugby star's Instagram page.\n\nCHARLOTTE BEARDSHAW (BEN YOUNGS)\n\nCharlotte, who keeps a low profile on social media, works at a cosmetic enhancement clinic in Leicester and is also mum to the couple's two young children Boris, three, and 20-month-old Billie (pictured with Boris, centre, and Ben above)\n\nBen Youngs, who is starting today, wed glamorous wife Charlotte Beardshaw in a lavish ceremony back in 2015\n\nCosmetic enhancement nurse Charlotte is married to scrum-half Youngs, picked by Jones to start this weekend.\n\nThe couple both herald from Norfolk but now live closer to the Leicester, where Ben plays for Leicester Tigers, alongside his brother Tom, and Charlotte works at an upmarket clinic.\n\nThey retreated back to their home county for their wedding in 2015 and now have two young children, Boris, three, and 20-month-old Billie.\n\nWith a private Instagram account, Charlotte clearly definitely prefers to stay away from the media spotlight.\n\nJESSICA LAWES (COURTNEY LAWES)\n\nMumpreneur Jessica certainly knows a thing or two about raising children - she and Northampton Saints and England flanker beau Courtney are parents to four\n\nThe couple married in 2015 and Jessica now runs her own parenting website, regularly blogging about the family's busy lives\n\nMumpreneur Jessica certainly knows a thing or two about raising children - she and Northampton Saints and England flanker beau Courtney are parents to four.\n\nThe couple married in 2015 and Jessica now runs her own parenting website, regularly blogging about the family's busy lives.\n\nGlamorous Jessica also has another sideline in her portfolio career - developing properties. She recently shared a sweet snap of two of their children taking a bath in the kitchen sink due to their bathroom undergoing a makeover, suggesting she'll be cheering on from home.\n\nALYSE MILLER (ANTHONY WATSON)\n\nPR consultant and events planner Alyse moved from the US to be with Bath player Anthony Watson. Pictured cheering him on at Twickenham in the summer\n\nThe stunner shared an adorable clip to Instagram recently of her beloved running over to her in the stands following England's win over Australia. She captioned it: 'Number one fan always, still so proud'\n\nThe couple regularly share images of themselves soaking up the sun in far-flung locations\n\nPR consultant and events planner Alyse moved from the US to be with Bath player Anthony Watson.\n\nShe regularly shows off snaps from her jet-setting life on her Instagram account - and has certainly been enjoying exploring the sights in Japan.\n\nThe stunner shared an adorable clip to Instagram recently of her beloved running over to her in the stands following England's win over Australia. She captioned it: 'Number one fan always, still so proud.'\n\nAlyse also proved a rock to partner Watson, who was sidelined for over a year with an Achilles injury, but is now firmly back in the national team. He described his partner as 'awesome' for keeping morale high.\n\nAMANDA McCLATCHIE (PIERS FRANCIS)\n\nPregnant Amanda, who is close friends with Saturdays singer Una Healy, joined fiance Piers early on in the competition, but bid goodbye to him 'too early' due to the typhoon\n\nDevoted Amanda was there to cheer on Piers in his world cup debut against America earlier in the competition\n\nThe glamorous brunette proudly showed off her blossoming baby bump as the couple explored Tokyo together in between matches\n\nPregnant Amanda, who is close friends with Saturdays singer Una Healy, joined fiance Piers early on in the competition, but bid goodbye to him 'too early' due to the typhoon.\n\nThe glamorous brunette proudly showed off her blossoming baby bump as the couple explored Tokyo together in between matches.\n\nThe former lawyer turned broadcaster and Gravesend-born fly-half are expecting a son later this year. Francis will start on the bench today.\n\nGEORGIE LYON (OWEN FARRELL)\n\nWhile Owen Farrell's star is in the ascendance as England's rugby captain, his wife Georgie, 27, is happy to keep out of the media spotlight. The couple, pictured on their wedding day in 2018, remain fiercely private\n\nCaptain Farrell and his other half Georgie, both 27, wed last summer and welcomed their first son, rugby player in the making Tommy, in March earlier this year.\n\nThe couple also have a dog, Ron, but you're unlikely to find either baby or pet on social media, as Georgie is happy to let her husband do the talking via his rugby.\n\nToday Farrell will switch to inside centre as Ford has been recalled as fly-half.\n\nWALES\n\nJESS TUMELY (LEIGH HALFPENNY)\n\nFull-back Leigh Halfpenny will replace Liam Williams in the clash against the Springboks this weekend - though he'll be without his 'girls' - partner Jess and daughter Lily, pictured - in Japan\n\nStunning Jess, pictured while on holiday in Portugal with their adorable little girl, keeps her Instagram private\n\nFull-back Leigh Halfpenny will replace Liam Williams in the clash against the Springboks this weekend - though he'll be without his 'girls' in Japan.\n\nHis partner Jess will be cheering on at home with their daughter Lily, who arrived in January this year.\n\nLeigh said her birth made him the 'luckiest guy in the world' - and he'll be hoping some of that luck carries over into Sunday's clash.\n\nBECKY JAMES (GEORGE NORTH)\n\nFormer Olympic cyclist Becky is well and truly a match for her rugby player husband George in the sporting stakes, having won two silver medals in Rio in 2016\n\nMulti-talented Becky recently turned her hand to baking, and her Instagram page BakedbyBecks has a staggering 14.6K followers\n\nFormer Olympic cyclist Becky is well and truly a match for her rugby player husband George in the sporting stakes, having won two silver medals in Rio in 2016.\n\nThe multi-talented stunner recently turned her hand to baking, and her Instagram page BakedbyBecks has a staggering 14.6K followers - and it's no surprise given the calibre of cakes she produces.\n\nBecky shared photos of her and her family cheering on George in Japan, so she could well be there again in person today.\n\nLOUISE ROBYN (JONATHAN DAVIES)\n\nFood blogger and self-confessed 'country girl' Louise runs a brunch blog called the Cardiff bruncher - when she's not cheering on partner Jonathan\n\nLouise recently joked about her boyfriend's severe haircut, and said she hopes to see a 'full head of hair' when she joins him in Japan\n\nFood blogger and self-confessed 'country girl' Louise runs a brunch blog called the Cardiff bruncher - when she's not cheering on partner Jonathan.\n\nLouise recently joked on Instagram about her boyfriend's severe haircut, and said she hopes to see a 'full head of hair' when she joins him in Japan.\n\nShe joined her future in-laws to cheer on Jonathan at the Fiji game and for the quarter final against Australia - and it doesn't sound like she'll miss the semi.\n\nSUZY PARKES (HADLEIGH PARKES)\n\nMum-to-be Suzy married New Zealand-born Welsh international centre Hadleigh last year and is expecting their first child next month\n\nThe couple, pictured at a recent wedding, are keen jet-setters and often post enviable snaps from exotic holidays abroad\n\nMum-to-be Suzy married New Zealand-born Welsh international centre Hadleigh last year and is expecting their first child next month.\n\nAs a result she hasn't flown to Japan, but is sure to be cheering on her hubby from home.\n\nBefore he left, Suzy posted an adorable photo of Hadleigh in his Wales kit, with the caption: 'And he's off! Goodluck in Japan - so incredibly proud of you.'\n\nThe couple are keen jet-setters and often post enviable snaps from exotic holidays abroad.\n\nDR ANWEN JONES (ALUN WYN JONES)\n\nUniversity lecturer Dr Anwen Jones is the wife of Welsh captain Alun Wyn Jones and mother to his two daughters. Pictured in June 2018 on their anniversary\n\nIn June this year, Alun was awarded the freedom of his home city of Swansea\n\nDr Anwen Jones, wife of Welsh captain Alun Wyn Jones, 34, is a Welsh medium physiology and health lecturer at Cardiff Metropolitan University.\n\nShe joined the school as a lecturer in September 2012 after complet​ing a PhD looking at the prevalence of cardiovascular disease risk factors in adolescents.\n\nLike her husband she's incredibly sporty - she's a former 400m hurdler and was Welsh champion from 2000-2007.\n\nThe pair enjoyed a day out together in Wimbledon earlier this year, but it's unknown if Anwen has travelled to Japan to cheer on her husband as she keeps her social media relatively private - though she did share an adorable video of the children cheering on their daddy for Wales' clash against Australia in September.", "description": "Rugby fans are in for a treat this weekend with two epic clashes, as England takes on reigning champions New Zealand today and Wales play South Africa tomorrow in the World Cup semi-finals.", "authors": ["Hayley Richardson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/17/20189004-0-image-a-62_1572021120648.jpg", "published_at": "2019-10-26"}