{"pub": "townhall", "url": "https://twitchy.com/samj-3930/2019/09/22/shed-like-to-speak-with-your-manager-possible-hurricane-karen-trend-the-funniest-damn-thing-youll-read-on-twitter-today", "downloaded_at": "2019-09-22 16:32:22.668534+00:00", "title": "She’d like to speak with YOUR manager! Possible Hurricane #Karen trend the funniest damn thing you’ll read on Twitter today", "language": "en", "text": "Yeah yeah yeah, we know, tropical storms and hurricanes are no laughing matter but OMG c’mon, naming one ‘Karen’? How can we NOT laugh at that? And thankfully Twitter is as warped as this editor is (or more so, which is pretty freakin’ warped) so #Karen is trending today for all the right reasons.\n\nNew: A Tropical Storm Watch has been issued for Puerto Rico, and the U.S. and British Virgin Islands for Tropical Storm #Karen. Latest information at https://t.co/tW4KeFW0gB pic.twitter.com/77FsrBz88i — National Hurricane Center (@NHC_Atlantic) September 22, 2019\n\nBecause she’d like to speak with your manager, duh.\n\nTropical Storm #Karen has formed and she's already in search of a manger to speak to https://t.co/C65IHf5g5E — Liz Finnegan (@TheGingerarchy) September 22, 2019\n\nSo #Karen got on trending due to hurricane Karen My mind immediately jumped to take the kids jokes\n\nWtf is wrong with me — Rowlet (CEO of Rowlet) (@MrEevee7) September 22, 2019\n\nThe same thing that’s wrong with us.\n\nTropical Storm #Karen has formed, and she already wants to speak to a manager. — Bryan Boggiano (@Bryan_KnowsBest) September 22, 2019\n\nThe hurricane being named #Karen is like a gift to the internet. — AKA WonderKat 💫 (@WonderKat365) September 22, 2019\n\n#Karen\n\nThis went trending because of the tropical storm.\n\nNot because she wants to speak with the manager. — Pete (@0010001000012l) September 22, 2019\n\n#Karen took the kids now she's taking my twitter trends, son of a. — repharos on 3ds (@Repharos) September 22, 2019\n\nMe: Dear Meme gods, what do we have after Area 51 and Tekashi? Meme gods: You ask for miracles, I give you Tropical Storm Karen. Me, with tears in my eyes: I would like to speak to your manager. #karen — Ian (@Desert_Ian) September 22, 2019\n\nNo, tropical storm #Karen , you can NOT speak to the manager or call 911. — theneutralground (@neutralground01) September 22, 2019\n\nOk these Karen memes are funny! But like it must be a real thing though! Probably why no one names their kid Karen anymore! #Karen #Memes pic.twitter.com/P3xU5Gu9se — Just Moody (@Justmoodywisdom) September 20, 2019\n\nDo you think #Karen is mad she's not been upgraded and is about to ask the weather service to see their manager? pic.twitter.com/5vk7bRvOwB — Victoria Veruca Salt (@trumpanzeetamer) September 22, 2019\n\nHIDE YO KIDS HIDE YO ISLAND CAUSE SHE TAKING EVERYONE TONIGHT #Karen — A Traveller (@im_very_mature) September 22, 2019\n\nTropical storm #Karen is on her way to speak to the manager — Chloe (@Wheezixg) September 22, 2019\n\n#Karen would like to speak to the manager. pic.twitter.com/R8fKW1ed1B — Michael Williams (@Biggydawg315) September 22, 2019\n\nAnnnd we officially can’t even.\n\nRelated:\n\nLook OUT Right-wingers! Max Boot says he’s ‘thoroughly sick’ of you guys calling the climate change cult a religion and LMAO\n\nWoke or INCEL? SJW sweetheart Saira Rao calls white women the greatest villains of ALL TIME and HOO-BOY look at that blowback\n\n‘You corrupt LOSERS’: Nick Searcy isn’t having ANY of David Axelrod’s lame attempt to cover for Biden’s Ukraine ‘problem’", "description": "And you KNOW how #Karen can be ...", "authors": ["Sam Janney", "Posted At Am On September", "Sam J."], "top_image": "https://twitchy.com/wp-content/uploads/2019/09/00001-4-1.jpg", "published_at": "2019-09-22"}