{"pub": "cnbc", "url": "https://cnbc.com/2019/09/12/1-in-5-workers-accepted-a-job-offer-and-ghosted-on-their-first-day.html", "downloaded_at": "2019-09-13 00:57:32.725102+00:00", "published_at": "2019-09-12", "title": "1 in 5 workers accepted a job offer and 'ghosted' on their first day — here's why", "language": "en", "text": "Ghosting is no longer a phenomenon exclusive to the dating world. These days, it's officially moved beyond the apps and straight into the office. And thanks to a tight labor market, job seekers are the ones disappearing from the hiring process at higher rates than ever. In a new survey on the subject, Indeed found a whopping 83% of employers had experienced \"ghosting\" from applicants — or, disappearing without letting the employer know why — a practice that's skyrocketed in the last two years. And it's not just young, inexperienced professionals driving the trend. The median age of candidates who ghost is 34, and 70% are employed in full-time positions, Indeed found. The jobs site surveyed over 4,000 job seekers and nearly 900 employers across industries, with the highest share of respondents representing health care, retail, education and construction and manufacturing. Job seekers were most likely to drop off a hiring manager's radar early in the process. About half of ghosters said they have bailed on a scheduled job interview, while 46% stopped replying to recruiters or hiring managers. However, a notable share of applicants pull the disappearing act after initially committing: 19% have accepted a verbal offer but never signed the paperwork, and 22% accepted the offer and didn't show up to work on their first day.\n\nWhy job seekers are ghosting\n\nOn a positive note for workers, 40% of those surveyed said they ghosted because they received a better job offer with the right pay and compensation. Employers are likely to see more of this, as workers gain confidence in their abilities to find a new job with today's record-low unemployment rate. \"The job seeker is in the driver's seat in today's hiring market and should feel empowered to keep their options open while interviewing with potential new employers,\" Paul Wolfe, Indeed's senior vice president of global human resources, tells CNBC Make It. \"That being said, it is important to remain professional and be as communicative as possible.\" It's worth letting recruiters know you're interviewing with other companies, as it could move along your hiring process or give you leverage to negotiate, says Vicki Salemi, a career expert with Monster. Once you've landed the best offer, a brief courtesy email to recruiters should do the trick. According to the survey, however, it's easy to see why applicants might not feel the need to offer the closure. Poor communication with the hiring party was a major reason why candidates didn't bother to fire off a \"breakup\" email. Broken down, 26% of job seekers say they weren't comfortable telling the employer they had a change of heart to end the process, while 13% say they had general issues getting in touch with the recruiter. Another 11% say they didn't know what to do, so they disappeared. Younger workers (18 to 34) were twice as likely as older counterparts (45 to 64) to ghost to avoid hurting their recruiter's feelings. In this case, Wolfe suggests: \"Job seekers should feel empowered to treat the interaction with a recruiter as professionally as possible, rather than a personal conversation.\"\n\nJob seekers aren't the only ones ghosting\n\nA long or slow hiring process was another top reason why job seekers disappeared, a scenario in which applicants may themselves feel ghosted by hiring managers. After all, because employers have historically held more power in the hiring process, applicants may assume that not hearing back means it's time to move on to other search prospects — and quickly. A survey from staffing and search firm Addison Group found that 70% of job applicants will lose interest in a role if they haven't heard back from an employer within a week of their first interview. That's not going to cut it in today's hot hiring market. \"If hiring managers or recruiters know the hiring process may be held up for whatever reason, they need to relay that to candidates so that they don't lose interest prematurely,\" Thomas B. Moran, CEO of Addison Group, tells CNBC Make It. Companies have a ways to go in making the hiring process more efficient and transparent on both sides. While the majority of recruiters and hiring managers from the Indeed survey said they feel frustrated by ghosting, just 29% have strategies in place to stop it before it starts. Most of the remedies noted were reactive, such as keeping a record of no-shows and tracking job seekers who bailed on interviews.\n\nWhatever you do, don't just not show up", "description": "Here's what keeps job seekers from sending that 'breakup' email.", "authors": ["Jennifer Liu"], "top_image": "https://image.cnbcfm.com/api/v1/image/105865551-1556005901408three-sugary-marshmallow-candy-ghosts-on-a-peach-pink-background-for-halloween_t20_vknklk.jpg?v=1556006158"}