{"pub": "metro", "url": "https://metro.co.uk/2019/10/22/trevor-mcdonald-problem-hired-bbc-needed-black-reporters-10961652", "downloaded_at": "2019-10-22 13:37:46.207818+00:00", "title": "Trevor McDonald speaks on being hired when BBC needed more black reporters", "language": "en", "text": "The legendary broadcaster was hired by the BBC in the sixties (Picture: Getty Images)\n\nTrevor McDonald has opened up about being hired when the BBC needed more black reporters, admitting he ‘had a problem’ with the process.\n\nThe legendary reporter was first hired by the BBC in 1969, after his work as a print and broadcast journalist in Trinidad in the early sixties.\n\n‘I was asked to go to Wood Lane and meet somebody. And I thought mistakenly, as it happened, that they had heard about how famous I was in Trinidad and Tobago television, you know?’ he recalled.\n\n‘Absolutely stupidly. And then they said, we’re looking for black reporters on the BBC. I have no problem with that,’ he added on the Chris Evans Virgin Radio Breakfast Show.\n\n‘But I have a problem with the whole business of positive discrimination, where it affects me. I didn’t want to be the person who was chosen as the black reporter because somebody from a board wanted black reporters. I felt that I could do some things on my own merit and I wanted to do it.’\n\nAdvertisement\n\nAdvertisement\n\nTrevor went on to describe his jump to ITV, revealing he was offered a job quickly and wanted time to think about it.\n\nThe 80-year-old recalled one of his colleagues telling him: ‘Silly man, pick up a phone call now,’ with him going on to spend years at ITN.\n\nTrevor went on to work at ITN for years (Picture: PA Archive)\n\nDespite the reporter coming into contact with all kinds of stars and famous figures throughout his career, he previously revealed that he’s only been left starstruck once.\n\n‘I was very over-awed by going into the Oval Office in the West Wing,’ he previously said on Good Morning Britain.\n\nTrevor had an iconic spot on News At Ten (Picture: BBC)\n\n‘ [George] Bush Jr did that [for me] and he was very kind and generous and he said to me, “I’ve given you this privilege which none of the White House correspondents got.”\n\n‘And I said, “Oh Mr President I’m terribly sorry, I hope that doesn’t get you into any trouble”, he said, “No, no I can deal with them”.’\n\nComing in at a close second, Sir Trevor described his meeting with Nelson Mandela as a ‘terribly emotional moment’.\n\nMetro.co.uk has contacted the BBC for comment.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Sir Trevor McDonald reveals the one person who left him starstruck in his five-decade career\n\nMORE: ‘Trevor McDonald is the Don’: Viewers react to legendary broadcaster taking on the mafia", "description": "Trevor McDonald speaks on being hired when BBC needed more black reporters", "authors": ["Louise Griffin"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-529433434_1571747980.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-22"}