{"pub": "cbc", "url": "https://cbc.ca/radio/thecurrent/voters-returning-to-bloc-qu-b-cois-over-fears-provinces-are-ganging-up-on-quebec-chantal-h-bert-1.5324511", "downloaded_at": "2019-10-18 01:12:21.943999+00:00", "title": "CBC Radio", "language": "en", "text": "Quebec voters are looking to a resurgent Bloc Québécois amid fears that parts of the rest of the country are \"ganging up\" on the province, according to veteran political commentator Chantal Hébert.\n\nThere is \"the notion that there are forces marshalling — mostly around the Conservative Party — but that would be ganging up on Quebec,\" said Hébert, an award-winning author and a political columnist with the Toronto Star.\n\n\"I'm not saying that that's the case, but I'm saying that that perception was certainly built on events that have happened over the pre-election year,\" she told The Current's Laura Lynch.\n\nShe noted over the past year, Ontario, New Brunswick and Alberta have elected Conservative provincial governments, and each has held \"some discourse or narrative that a Francophone Quebecer, for various reasons, would probably find threatening.\"\n\nShe said Premier Doug Ford's government had tried to cut back on Francophone services in Ontario; there was hostility \"to the equality of the two languages\" in New Brunswick; and Alberta Premier Jason Kenney has argued Quebec should not oppose pipelines because the province receives money from equalization payments.\n\nIt adds up to \"all of the ingredients for Quebecers to say: 'We're running for cover here,'\" Hébert told Lynch.\n\n\"And here is an articulate Bloc leader who happens to be in the right place, at the right time.\"\n\nLiberal Leader Justin Trudeau says Bloc Québécois Leader Yves-François Blanchet can't fight climate change because he will never form government and implement a pan-Canadian climate change plan. 0:56\n\nThe CBC Poll Tracker has shown a surge for the Bloc Québécois in the past week, with the party averaging 29.3 per cent support provincially, in a close second place to the Liberals with 31 per cent. The uptick followed a strong performance from Bloc Québécois Leader Yves-François Blanchet at the Oct. 10 French-language debate, but Hébert said the resurgence has been long in the making.\n\n\"Francophone Quebecers are a majority in the province, but they are very mindful of the fact that they are a French-speaking minority, not only in Canada but across North America.\"\n\n\"And so they collectively react to the level of the temperature out there, towards their difference.\"\n\nLiberal Leader Justin Trudeau says Quebecers need to think twice about voting for the Bloc Québécois because it would bring back a government like the one led by former prime minister Stephen Harper. 0:39\n\nFederal party leader were in the province in recent days, making final pitches to voters.\n\nSpeaking Tuesday, Conservative Leader Andrew Scheer said that his party represented change, adding that a Conservative government \"would be an ally to all Quebecers.\"\n\nSpeaking in Montreal Wednesday, Liberal Leader Justin Trudeau asked Quebecers to support his party, arguing that a vote for the NDP or Bloc Québécois could help elect a Conservative government.\n\nNDP Leader Jagmeet Singh visited Jack Layton Park in Hudson, Que. on Wednesday, where he spoke about the legacy of former NDP leader Layton, who won 59 seats in the province in 2011.\n\nWritten by Padraig Moran. Produced by Idella Sturino and Samira Mohyeddin.", "description": "Veteran journalist Chantal Hébert talks to Laura Lynch about Quebec politics, and what's at stake this election.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5324550.1571330276!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/press-gallery-dinner-20120524.jpg", "published_at": "2019-10-17"}