{"pub": "businessinsider", "url": "https://pedestrian.tv/entertainment/bachelorette-australia-recap-episode-4-ciarran", "downloaded_at": "2019-10-17 10:32:58.598999+00:00", "title": "‘BACHIE’ RECAP: Well Fuck Us Up, That Was A Lot Of Ass & Dick For Prime Time", "language": "en", "text": "While we’re quite used to seeing dicks in the Bachelorette Australia it’s usually people behaving like dicks, not, like their actual penises. But tonight was different – Angie Kent, god love her, copped an eyeful of two.\n\nOne was live and in the flesh courtesy of a very brave Ciarran in a life drawing class and the other was a baby photo of Timm, so not quite the sexy peen you might imagine but still, weird.\n\nAs usual, myself (Josie) and my sidekick Mel were there every step of the way and will now recap it, just for you. Enjoy.\n\nJOSIE: Mel, in yesterday’s recap you predicted there would be people sipping tea and glaring sideways at Jamie in today’s episode, and you were absolutely bang-on. The Boys (well mainly Timm) were NOT happy about Jamie dogging them and approaching Angie at last night’s cocktail party.\n\nBut before Jamie can have a complete “I’M HERE FOR ANGIE NOT THE BOYS” meltdown, a well-timed Tom appears from Osher‘s home within the walls carrying a mysterious box.\n\nMEL: How dare Tom enter Osher’s lair, ever! The rudeness. The box came with a date card, with half the guys listed on it – including Jamie, who was listed last. Naturally he almost had heart failure over the possibility of not scoring time with Angie. Then the box was opened – feather boas, bridesmaid sashes, and other hen’s party paraphernalia! I have to say, this was a great idea for a group date.\n\nJOSIE: Especially when the token stretch Hummer rolled up to the mansion containing none other than Yvie, Angie’s BFF and Gogglebox sidekick. First Angie’s bro, now her best mate – they’re really choosing some good judges of character to suss out these blokes.\n\nWhen they’re all piled into the car Yvie does single out Ryan as being Angie’s perfect match on paper, and it’s not only Jamie who begins to stare into the void over it. Bloody Carlin also looks like he wants to hijack the Hummer and drive it and Ryan off a cliff, Thelma & Louise style.\n\nMEL: And tbh, same? How shit would it be if some rando who knew the person you liked waltzed into the Bachelorette with a history and the bestie’s approval? Fuck that right off this planet. So then we see Angie with Osher and some lady, and she has NFI that a) her Bachelorette party is on today and b) that Yvie’s in attendance.\n\nJOSIE: Yeah and like I said to you, everyone’s all “OMG RYAN SUCH A THREAT” but I haven’t seen much evidence of that? Like he’s very good-looking and likes dogs, but tbf a lot of these blokes are very good-looking and also like dogs. I don’t think a few DMs are that damning. Anyway, I loved that Angie also referred to her as “some lady”. She truly had no idea what was going on. So the party and Yvie were genuinely great surprises for her. One thing that wasn’t a surprise? Ciarran self-nominating to be the nude model in the life drawing class. Of course he did.\n\nMEL: And aren’t we fucking 10000% glad he did, hoooo boy.\n\nJOSIE: I mean, we saw his butt in the first episode which was actually super out of context because it was just him talking about his skincare routine and then suddenly there’s him naked in the shower? Not that I minded, but it was a little jarring. This however, THIS was most welcome. He just gets up there in front of his new mates, the girl he likes and her best friend and gets his junk out. Amazing confidence levels there.\n\nMEL: He clearly had a good dick, and even Angie says it – yes, girl. We were all thinking it. You’d have to love your peen to be confident enough to whip it out, flaccid, in front of 15 dudes you’re competing with and the woman you like. So he starts modelling, and Angie/Yvie aren’t coping. They’re giggling into their champagne like schoolgirls. Best. Group Date. Ever.\n\nJOSIE: It was incredible. I have no idea how much time passed but it felt like he was nude up the front of that room for hours. He did get a little breather though when Yvie requested a one-on-one chat with him, which he did wearing only two bunches of grapes as clothing. I need these Ciarran levels of confidence. Do you think he’ll become a life coach after this show, because sign me up.\n\nMEL: SAME. Yvie was very into him, she loved his cheeky vibe and his confidence. She also chatted to Ryan, who she loved, and Carlin – who she found a bit too serious for Angie. Meanwhile, Jamie was doing whatever he could to get Angie and Yvie’s attention with his Bachelorette party getup.\n\nJOSIE: Showing that he’s Fun And Silly™ just like Ciarran! Mate, no. You’re about as fun as a pap smear tbh. He was really like stewing on the fact that Yvie didn’t approach him for a chat – maybe he should have taken the initiative and spoken to her? He wasn’t chained to the chair, people were moving around the room. It was weird that he just sat there.\n\nMEL: It was so weird, he just sat there looking like a zesty creep. Then after the ad break we had Angie waiting for Timm – I’m SO glad this first date happened! We knew Timm would be a vibe for Angie and we weren’t wrong. They have such a natural chemistry together and you can tell he genuinely makes her laugh. READ MORE Lobster Lad Timm Reportedly Felt Like He Was Gonna Faint During A 'Bachie' Rose Ceremony JOSIE: Can I just say, I have never been so invested in an office sweep before. You have Timm and I have Ciarran and my god, they’re the best. They’d be my faves even we didn’t have them. I was super happy Timm got the single date and what was even better was it was actually like a normal date. Not a typical Bachelorette date of “okay let’s be hung by our ankles upside down from the tallest building in Australia and then have a cheese plate, sound okay?” MEL: Yes! They just strolled around Centennial Park eating Gelato Messina, that’s even more chill than dates I go on.\n\nI loved it so much, even when they sat down to the eventual cheese plate in the rain – to look at baby photos of Timm, including one where he is entirely nude. How many of the Bachelorette contestants’ dicks is Angie gonna see at this point? JOSIE: Two actual cocks in this Bachelorette episode instead of people just behaving like cocks. A refreshing change! Anyway their rainy date was so cute, Timm seemed really genuine and heartfelt about relationships and finding that person you’re gonna grow old with. Did I cry? Maybe (definitely). I know that Angie thinks he’s a “naughty boy” but I think she was surprised by him being able to talk seriously about that stuff. When she gave him a rose and then he grabbed her for a kiss I nearly slid off my damn chair. HOT HOT HOT. MEL: I was getting so flustered! We both were, there may have been some fanning of the face going on. He is so sexy, if Angie doesn’t choose him as the Bachelorette winner I’ll volunteer as tribute. Hell, we’ll BOTH volunteer as tribute. So then it was like BAM! Cocktail party! And fuuuuuck me up, how sexual did Timm & Ciarran look. JOSIE: At one point I was like “MARRY US TIMM” which definitely took it into a weird polyamorous area. I couldn’t help myself! And then they both looked outrageously good at that cocktail party, if I was literally any of the other guys (except maybe Carlin) I would have just backed into a bush, Homer Simpson-style, never to be seen again. What’s even the point of hanging around with these two in the mix? MEL: Meanwhile, Jamie was being his usual batshit self and it was so painful to watch, you literally looked AWAY Josie. Ryan’s having a chat with Angie and Jamie legit swoops in after 0.002 seconds, saying he wants to speak with BOTH of them (!!) because he wanted to get to the bottom of why Yvie thinks Ryan’s such a perfect match for Angie??? What the fuck? JOSIE: It was so, so bad. Just such a cringe moment. And while some people might just politely go “Okay sure”, both Ryan and Angie were like… nup. So then Jamie had to kind of skulk off again and it made my entire soul hurt, Mel. Why is he like this. MEL: Just be NORMAL, fuck. Don’t go up to people having a chat and say “I want to analyse you and see why Yvie likes you together”. What the shit is that? Anyway, thankfully we then had some minor drama with Timm swooping in after Ryan and taking some precious Angie-time away from the other dudes. It was preeetty snaky considering just last ep, he was roasting Jamie for not abiding by “bro code” and jostling for time with the woman. JOSIE: Like, he was literally the one who gathered The Boys around the fire pit and made the rule that there would be NO SWOOPING. And then he goes and swoops. I mean, I don’t care because look at him, but the others were a bit miffed. They had an emergency fire pit meeting of The Boys just to discuss it, and it gave Jamie a new anxiety: that Timm is a “new threat”. Honestly the way these Bachelorette guys talk and act it’s like Survivor in suits, isn’t it.\n\nMEL: YES! At least 80% of these guys are not here for Angie’s heart, they just want to win/make it far enough that their ego is soothed. I feel like the women on The Bachelor are more invested in the guy, or at least better at hiding their ulterior motives. JOSIE: Totally. The Bachelorette is very much about the competition for the guys. Anyway, The Boys were right to be worried about Timm because during his and Angie’s zesty little cocktail party hang, they bloody well pashed again! A secret cocktail party pash! To his credit he didn’t saunter back into the party with red lipstick smeared all over his face smugly saying “That was a lot”, Abbie from last season of The Bachelor-style.", "description": "Bachelorette Australia turned into an actual bachelorette party tonight, with Ciarran acting as the nude entertainment. YES PLEASE.", "authors": ["Josephine Rozenberg-Clarke", "Melissa Mason"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/10/BACH-EP-4-FB-IMAGE.jpg", "published_at": "2019-10-17"}