{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/25/warren-gatland-wales-rugby-world-cup-south-africa", "downloaded_at": "2019-10-25 16:05:55.210271+00:00", "title": "Warren Gatland’s 12-year Wales rollercoaster reaches the final straight | Paul Rees", "language": "en", "text": "Head coach goes into his penultimate game in charge hoping to get a shot at the World Cup, the one trophy that has eluded him\n\nWarren Gatland was asked after announcing his team to face South Africa the single biggest difference he had made since being appointed Wales’s head coach 12 years ago. He took his time before replying, although his response to the previous question, how his players had developed the mentality to see out tight matches rather than throw them away, would have been fitting.\n\n“Respect for what we have done is the biggest thing,” he eventually said. “What I am most proud of is that we have earned the respect of the rest of the world, which I am not sure was there before given where we were in the world rankings (10th). We have won championships and grand slams.”\n\nHe paused before adding: “I would love to beat the All Blacks, one thing I have not achieved.”\n\nSemi-final return of Jonathan Davies softens Liam Williams blow for Wales Read more\n\nHe may have one final opportunity on what would be his last day with Wales, next Saturday, when the World Cup final will be played, one week before the anniversary of his appointment. It would need New Zealand to beat England in the first semi-final before Wales took down South Africa (although if they both lose they will be in a battle for third place the day before), but Gatland’s coaching career, apart from the manner of his departure from Ireland in 2001 after they had been pipped for the Six Nations by England on points difference has largely been one of dreams fulfilled.\n\nWhen he started with Wales, it was reported that the players had refused to have more than one contact session during the 2007 World Cup, which they exited at the group stage after losing to Fiji. “We will be having plenty of contact sessions,” he said, “and we will break a few players.”\n\nHe wanted his charges to be physical but also saw that he needed to boost the self-belief of a side that had been mentally fragile. The second task took rather longer to complete than the first.\n\nIf W under Gatland has come to stand for win, before him the letter itself reflected the up-and‑down nature of the national side: whitewashed in the 2003 Six Nations, they won the grand slam in 2005 and avoided another wooden spoon two years later with victory over England on the final weekend. Coaches were lucky to last 12 months never mind 12 years, the domestic game was prone to regular upheaval and success was sporadic because it tended to be achieved by accident rather than design.\n\nFacebook Twitter Pinterest George North was one of the core group of youngsters Gatland began to develop more than a decade ago. Photograph: Ben Evans/Huw Evans/Rex/Shutterstock\n\nGatland changed all that. He learned from his Ireland experience, when at the point he thought he would be offered a new contract he was outmanoeuvred by one of his assistants, Eddie O’Sullivan, and released. His first two appointments were men he had worked with at Wasps and whose loyalty he could be assured of: Shaun Edwards, the defence coach whose fierce competitiveness became quickly ingrained in his charges, and Rob Howley. Robin McBryde and Neil Jenkins followed and until Howley was sent home after a few days here while the Welsh Rugby Union launched an investigation after being approached by a betting company the team remained together, confounding the theory that fresh voices are needed if one playing dynasty is to follow another.\n\nGatland won the grand slam in 2008 at the first attempt, but the next couple of years were his stickiest as he came to terms with the need of his players for direction, different to what he was used to in New Zealand and at Wasps, but he then developed a core group of youngsters – Leigh Halfpenny, George North, Jonathan Davies, Dan Lydiate, Sam Warburton and Taulupe Faletau – and moulded them in his own image.\n\nThey were a missed kick from making the 2011 World Cup final despite playing for an hour against France a man short.\n\nHe has never been afraid to test a player early: Warburton was not a regular for Cardiff Blues when Gatland made him captain and in this tournament he included Rhys Carré, who won his first cap at the end of August in the warm-up against Ireland after a handful of regional starts and the prop will again be on the bench this Sunday having leapfrogged established rivals. Players know that if they impress in training they will be given their chance.\n\nThree grand slams and a Six Nations title in 2013, when Gatland was on sabbatical with the Lions, have been supplemented by two World Cup semi-finals: the five tournaments before Gatland had brought two quarter-final appearances and three early exits. Respect has been restored with Wales enjoying their most consistent run of success since the golden era of the 1970s when they were supported by a buoyant club system rather than four regions who have been unable to make much of an impact in Europe.\n\n“Warren’s results on the field with Wales and the Lions speak for themselves,” said South Africa’s director of rugby, Rassie Erasmus. “He is an absolute legend of the game, a gentleman on and off the pitch. You seldom see him in a mud fight before matches. I have never had to reply to something he has said and he does not create unnecessary nonsense before a match.\n\n“I will see him again with the Lions in 2021 and it is always a pleasure competing with him.”\n\nThe Breakdown: sign up and get our weekly rugby union email.\n\n\n\nThe World Cup is the one trophy that has eluded Gatland. He turned 56 a few days before the start of the tournament and will very probably have another tilt at it. But doing it here would be his crowning achievement, in charge of a side which, on paper, does not look as well-equipped as the other three. His brilliance has been in turning a country that prided itself on the exceptional individuals it produced down the decades into a team that runs on maximum output.\n\nHe has put his players through it in training and most were made, not broken. South Africa know they will come up against opponents of implacable will. A team that used to fashion various ways of losing a match now does not know when it is beaten: it may wobble but it will not fall down.\n\n“Gats has won grand slams, titles and taken Wales to No 1 in the world rankings, but this is the ultimate for him,” said South Africa’s 2007 World Cup-winning coach, Jake White. “He will have been giving it to his players this week, telling them they were close to going home. He wants that final cherry on his cake.”", "description": "Warren Gatland, the Wales head coach, goes into his penultimate in charge hoping to get a shot at World Cup, the one trophy that has eluded him", "authors": ["Paul Rees"], "top_image": "https://i.guim.co.uk/img/media/a2549366289bd3d2d29318085f1bce2e277b96bb/0_139_5224_3134/master/5224.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=71e796a985e8a6a3a6bfd6d1d498b1e4", "published_at": "2019-10-25"}