{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/10/rush-limbaugh-nba-media-would-back-china-over-tian", "downloaded_at": "2019-10-11 00:21:31.782479+00:00", "title": "Rush Limbaugh blasts hypocrisy of NBA, media on China criticism", "language": "en", "text": "Radio host Rush Limbaugh says the NBA’s decision to mute criticism of China demonstrates how far the culture has shifted since 1989’s Tiananmen Square protests.\n\nThe conservative told his audience on Thursday that “tank man” — captured in an iconic photo by Jeff Widener during pro-democracy movement — may be treated with a “put that guy in jail!” mentality today.\n\nMr. Limbaugh’s comments are in response to the NBA apologizing for Houston Rockets general manager Daryl Morey’s “Fight for Freedom” message on social media.\n\nA CNN reporter was also told not to ask questions regarding the issue.\n\n“As you stand back and you objectively observe the current U.S. Drive-By Media news cycle, there’s some things that stand out,” Mr. Limbaugh said. “Almost all of the Drive-By Media Democrats and NBA players and owners — almost all — are in support of Communist China and against free speech. And we’re told, “Well, the ChiComs have this gigantic market over there, Rush, 1.2 billion customers.”\n\n“They are sidling up to the most repressive anti-free speech, anti-freedom regime you can find on the planet today,” he continued. “Communist China! Over one tweet by a general manager for the Houston Rockets supporting Hong Kong freedom fighters! Remember when the one guy stood up in front of the tank at Tiananmen Square, remember everybody stood up and loved that guy? This would be the equivalent if the NBA said, ‘Put that guy in jail!’”\n\n“If the NBA and the Democrat Party and the media said, ‘Run him over! Run over that guy, he’s insulting our brethren in the Chinese communist government.’ That’s the equivalent. They’ve done a 180 off Tiananmen Square. And that guy who was celebrated as a hero, if that happened today, he’d be lynched. And the NBA and all of these communist Chinese loving American enterprises would be demanding that guy be made an example of. … Well, we all know why. It’s money. Once again, money trumping ideas. Too much money to be made there in China.”\n\nMr. Limbaugh also said that it was telling how the NBA waded into issues regarding transgender bathroom laws and other LGBT issues, but the league says nothing about China’s record on those issues.\n\n“Do you know what China does to transgender people?” the host asked. “Do you know what China does to homosexuals? Do you know where those people end up in China? They end up in reeducation camps with the Uyghurs.”\n\nNBA Chief Communications Officer Mike Bass released a statement on Monday saying Mr. Morey’s opinion on Hong Kong protesters “does not represent the Rockets or the NBA.”\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Radio host Rush Limbaugh says the NBA's decision to mute criticism of China demonstrates how far the culture has shifted since 1989's Tiananmen Square protests.", "authors": ["The Washington Times Http", "Douglas"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/27/China_70_Years_Mao_to_McDonalds_86123.jpg-a7e20_c0-99-3000-1848_s1770x1032.jpg?b9dc9f7d6a17737d5fa7ea39ec03add384cdbd70", "published_at": "2019-10-10"}