{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/12/winds-of-change-hit-ferrari-as-charles-leclerc-moves-in-on-no-1-spot", "downloaded_at": "2019-10-12 17:48:34.679091+00:00", "title": "Charles Leclerc brings winds of change to Ferrari in move on No 1 spot", "language": "en", "text": "Formula One may have had to hunker down this weekend when Typhoon Hagibis forced qualifying for the Japanese Grand Prix to be postponed but Ferrari were already busy weathering a storm of their own. Hagibis will pass but the turbulent air at the Scuderia may continue to roll.\n\nTeam orders left Ferrari looking poorly organised and impotent at the previous race in Russia. They want more victories now they have the car to achieve them. But, as Lewis Hamilton suggested, perhaps what they need – with the mechanical finally firing – is a rethink.\n\nIn Sochi, Ferrari attempted to micromanage the start between Charles Leclerc and Sebastian Vettel. Vettel took the lead and disobeyed orders to give it back, and the team could not explain why they had used such intricate instructions and yet not made their implementation clear to both drivers. They also failed to appreciate that Vettel might choose to interpret the plan in his own way. As well may Leclerc in future.\n\nJapan orders evacuations as Typhoon Hagibis arrives Read more\n\nFerrari started the season with Vettel the clear No 1 driver. Leclerc’s performances, not least two wins in the past four races, have usurped him and the two were at odds in Russia. Both pointed out in Japan that the matter has been discussed and clarified. “We need to obey team orders and what is clear is that the situation wasn’t clear for both of the drivers starting the race,” said Leclerc. “I think that’s most important.”\n\nYet perhaps clarity is not the most important aspect, but rather the fundamental shift that has occurred in the team. “It’s an interesting dynamic they have there, because obviously Seb was No 1, and now clearly not,” Hamilton said. “From the energy, from the outlook, [Ferrari is] trying to ramp Charles up to be [the No 1]. Is that good for a team? I don’t think so. But that’s the philosophy they’ve had forever.”\n\nFerrari have pursued a lead-driver policy extensively. When Kimi Räikkönen played second fiddle to Vettel it made no difference, with harmony ensured by Vettel being quicker than his teammate. Leclerc has allowed no such comfort and suddenly shifting focus from one driver to another is rarely harmonious.\n\nHamilton experienced this in his debut season, joining McLaren where then world champion Fernando Alonso was No 1. When the young Briton proved himself almost immediately and became a title challenger, McLaren gave him equal footing. “When I was with Fernando, he was the hired No 1,” he said. “But then mid-season that dynamic shifted, and it didn’t go well for the team.”\n\nHamilton joined Mercedes in 2013, where the team allow their drivers to race with no No 1 designated driver (albeit within rules of engagement). He believes he has enjoyed a management philosophy from which Ferrari should learn.\n\n“Over the course of history you’ve seen world champions in the same team and there’s always going to be friction in a racing team because you’ve got this conflicting target,” he said. “There’s the team but it’s also an individual target between the two drivers. So you are constantly trying to balance that conflict. It’s all about trying to find the balance and how it’s managed from the top down. It’s just about respect and how it’s managed.”\n\nFerrari’s principal, Mattia Binotto, admitted he could still not guarantee control over his two forceful talents. “How much I’m confident it will not happen [again], I’m not at all,” he said. “I think these are both very good drivers. They are all going for a single objective which is winning themselves but what is more important is that at least we, between us, we’ve got clarity and fairness and that’s key.”\n\nBeware the enemy within: Leclerc and Vettel continue a timeless F1 tradition | Richard Williams Read more\n\nThe problem he and Ferrari face is that this approach, however much clarity is applied, may still not work. Perhaps the concept of a favoured lead driver must be discarded. Mercedes, who could secure their record-equalling sixth consecutive constructors’ title in Japan, have done handsomely without it, as Hamilton wryly observed.\n\n“There are different philosophies up and down the paddock,” he said. “Probably mostly just between our two teams in particular and over the following years we will see if it works or it doesn’t. It hasn’t worked for a long time over there [Ferrari] and most likely will not work going forwards either, but that’s not bad for us.”", "description": "Sebastian Vettel started the year as Ferarri’s lead driver but his young teammate has disrupted the status quo", "authors": ["Giles Richards"], "top_image": "https://i.guim.co.uk/img/media/af49a53a7104eee818085d97d6c64766ed4a05ce/0_0_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=d9295a9769a713cd0e14dc3dce86738c", "published_at": "2019-10-12"}