{"pub": "independent", "url": "https://independent.co.uk/news/uk/home-news/thomas-cook-news-collapse-customer-refund-travel-holiday-a9116391.html", "downloaded_at": "2019-09-23 11:56:19.561413+00:00", "title": "'I'll go off': Thomas Cook customer rages over refund after company collapses", "language": "en", "text": "A Thomas Cook customer due to go on her first holiday ever has threatened to “go off” if she is not refunded, after the travel company's collapse.\n\nCorenza Smith said she had paid £2,000 for a trip to go to Turkey in 2020 with her mother and younger sister.\n\nThe firm's descent into administration means her trip is among thousands in doubt and it is equally unclear whether she and other will receive their money back.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe failure of a last-ditch attempt to save the company has seen it cease trading, putting more than 20,000 jobs at risk around the world, leaving many travellers stranded and disrupting thousands of others’ future travel plans.\n\nMs Smith expressed her frustration at the disruption to what would have been her first ever holiday in an interview with Global’s Newsroom.\n\nShape Created with Sketch. Airlines that went bust Show all 12 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Airlines that went bust 1/12 Air Berlin Air Berlin, which operated flights to and from Berlin Tegel, went bankrupt in 2017 Getty 2/12 Small Planet Lithuanian airline Small Planet filed for insolvency at the end of 2018 Igor Dvurekov 3/12 Monarch Airlines The airline ceased operations in October 2017 AFP/Getty 4/12 VLM Antwerp-based VLM went bankrupt in September 2018 Flo Weiss 5/12 Germania German airline Germania filed for insolvency in February 2019 Getty 6/12 Kingfisher Founded in 2005 ceased flying in October 2012 AFP/Getty 7/12 Cobalt Cobalt, based in Larnaca, Cyprus, stopped flying in October 2018 Steve Lynes 8/12 Mexicana An airline that had been in operation since 1921, went bust in August 2010. It was Mexico's largest airline AFP/Getty 9/12 WOW Air Icelandic Wow Air ceased operation in March 2019 Getty 10/12 Primera Primera, known for its cheap transatlantic fares, went bust in October 2018 Getty 11/12 Transaero A privately-owened airline founded in Russia, 1990 lasted until October 2015 Getty 12/12 Malev After 66 years, Hungary's national airline went stopped flying in 2012 AFP/Getty 1/12 Air Berlin Air Berlin, which operated flights to and from Berlin Tegel, went bankrupt in 2017 Getty 2/12 Small Planet Lithuanian airline Small Planet filed for insolvency at the end of 2018 Igor Dvurekov 3/12 Monarch Airlines The airline ceased operations in October 2017 AFP/Getty 4/12 VLM Antwerp-based VLM went bankrupt in September 2018 Flo Weiss 5/12 Germania German airline Germania filed for insolvency in February 2019 Getty 6/12 Kingfisher Founded in 2005 ceased flying in October 2012 AFP/Getty 7/12 Cobalt Cobalt, based in Larnaca, Cyprus, stopped flying in October 2018 Steve Lynes 8/12 Mexicana An airline that had been in operation since 1921, went bust in August 2010. It was Mexico's largest airline AFP/Getty 9/12 WOW Air Icelandic Wow Air ceased operation in March 2019 Getty 10/12 Primera Primera, known for its cheap transatlantic fares, went bust in October 2018 Getty 11/12 Transaero A privately-owened airline founded in Russia, 1990 lasted until October 2015 Getty 12/12 Malev After 66 years, Hungary's national airline went stopped flying in 2012 AFP/Getty\n\n“I better get it back, or I will go off,” she said several times. “I am not amused, I am not happy about it either.”\n\nThe woman said the first she had heard of the company going bust was on Facebook and via the news.\n\n‘I didn’t get an email, I haven’t heard anything.”", "description": "A Thomas Cook customer due to go on her first holiday ever has threatened to “go off” if she is not refunded, after the travel company's collapse.  Corenza Smith said she had paid £2,000 for a trip to go to Turkey in 2020 with her mother and younger sister.", "authors": ["Corazon Miller"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/23/10/tthomas-cook-customer.png", "published_at": "2019-09-23"}