{"pub": "yahoo", "url": "https://finance.yahoo.com/news/oil-prices-surge-saudi-disruption-063802077.html", "downloaded_at": "2019-09-16 23:16:29.518235+00:00", "title": "Oil price posts biggest spike on record after Saudi facility attack: as it happened", "language": "en", "text": "5:13PM\n\nSaudi Arabia has long been the bed rock of global oil production, but the weekend’s events — and how markets have reacted — shows just how unstable that foundation can be.\n\nThe aftershock ended a winning streak in European stocks, which had been rising for the last five sessions. Oil giants did well, but that wasn’t enough to stock the overall decline.\n\nThat’s all from me today — I’ll be back tomorrow with the latest news on markets, business and economics! Have a good night.\n\n4:52PM\n\nAldi could open up to 250 stores in and around London by 2025\n\nAldi could open up to 250 stores in and around London by 2025 Credit: Joel Chant\n\nWith markets now closed, here’s another batch of the UK’s biggest business stories:\n\n4:48PM\n\nWell, it started out bad and never got much better: European stocks have closed red across the board.\n\nHow things move in coming days is likely to depend on what comes out of Saudi Arabia, particularly whether Riyadh is confident enough to stick the blame for the attack directly on Tehran. Donald Trump is certainly pointing a finger at the Islamic Republic...\n\nRemember when Iran shot down a drone, saying knowingly that it was in their “airspace” when, in fact, it was nowhere close. They stuck strongly to that story knowing that it was a very big lie. Now they say that they had nothing to do with the attack on Saudi Arabia. We’ll see?\n\nStory continues\n\n4:30PM\n\nFull report: Chinese economy slows again as trade war bubbles on\n\nChinese state council premier Li Keqiang Credit: Andrea Verdelli/POOL/EPA-EFE/REX More\n\nChinese industrial production grew at its lowest rate since 2002, according to figures released by the Asian economic giant this morning. Tim Wallace has a full report. He writes:\n\nPremier Li Keqiang admitted China may now miss its goal to keep the economy growing by more than 6pc a year. “For China to maintain growth of 6pc or more is very difficult against the current backdrop of a complicated international situation and a relatively high base, and this rate is at the forefront of the world's leading economies,” he said in a Russian interview.\n\nYou can read more here: China’s economy slows again as trade war threatens global slump\n\n4:14PM\n\nThomas Cook schedules hearings on recapitalisation for later in the month\n\nThomas Cook’s future remains in doubt Credit: Thomas Cook/PA More\n\nBeleaguered travel operator Thomas Cook says it will hold meetings between its creditors and shareholders at the end of the month, as it tries to secure a rescue package worth £1bn. The company said:\n\nAs part of the process to finalise the full commercial terms between Thomas Cook Group's creditors and stakeholders, the Scheme Meetings and the Schemes Sanction Hearing relating to Thomas Cook Group's proposed recapitalisation will take place on the 27 and 30 September respectively. The Company continues to target implementation of the recapitalisation in early October.\n\n4:09PM\n\nWall Street downbeat as global tensions bubble\n\nTrading in New York has been open for just over an hour now, and indices are looking pretty solidly downbeat. The Dow is off about 0.5pc, while the S&P 500 and Nasdaq have both dropped about 0.3pc.\n\nIn Europe, things look similarly grim: the FTSe is 0.3pc off, with Germany’s DAX and France’s CAC both shedding about 0.6pc.\n\n3:45PM\n\nMeanwhile, in Luxembourg...\n\nLuxembourg's Prime Minister Xavier Bettel gestures during a news conference after his meeting with British Prime Minister Boris Johnson in Luxembourg Credit: YVES HERMAN/REUTERS More\n\nBoris Johnson has cancelled a press conference with the Prime Minister of the tiny Principality after being booed. Follow the latest on our politics live blog:\n\n2:54PM\n\nSaudis say weapons used in attack came from Iran\n\nJust in: The spokesperson for the Saudi-led coalition in Yemen has said preliminary findings from its investigation into Saturday’s attacks suggest Iranian weapons were used.\n\nThough they did not go as far as directly blaming Iran for the attack, they said it did not come from Yemen.\n\n2:43PM\n\nBumper round-up: Chinese media attack LSE takeover bid, Cobham investors back takeover, Eddie Stobart warns of cash squeeze, PwC cranks up pay, Man Group finds its new guy\n\nBig Four accounting giant PwC is paying £765,000 to each of its 913 partners Credit: Jack Taylor/Getty Images Europe More\n\nHere’s an (unusually bulky) round-up of the day’s biggest business stories:\n\n1:57PM\n\nAramco IPO under threat?\n\nCould the multi-billion dollar flotation of oil giant Saudi Aramco be derailed by the attacks on oil refineries? The Wall Street Journal is reporting that Saudi officials are wondering whether investors will get cold feet over fear of further attacks.\n\nThe IPO could value Aramco, the national oil producer, at up to $2 trillion. But according to the Journal:\n\nThe attacks could now also figure in any investor valuation. If Aramco continues to be a target of attacks, some Saudi officials and advisers say the market might need a further discount of as much as $300 billion.\n\n1:08PM\n\nMeanwhile, in China...\n\nThe Hong Kong stock exchange's shock bid for its London counterpart was the big story of last week. The controversy rumbles on. Sophia Yan in Beijing reports that Chinese state media is not happy about the deal:\n\nThe People’s Daily, a Communist Party mouthpiece, published a scathing commentary giving a laundry list of reasons as to why the LSE would rebuff Hong Kong Exchanges and Clearing (HKEX), given “persistent worries” over ongoing political unrest, a lack of strategic vision, and a lowball bid. LSE’s rejection is a sign that Hong Kong cannot break away from the mainland and develop on its own without the support of a China brimming with opportunities, according to the piece. It also praised the LSE for identifying its existing tie-up with the Shanghai Stock Exchange as its preferred way to access the market in China. The LSE “won’t worry about Shanghai ... as long as China continues to rise, so will Shanghai”.\n\nSophia has more here.\n\n12:36PM\n\n'Straw that breaks the camel's back'\n\nHere's Ivan Petrella, of Warwick Business School, on the oil price spike:\n\n\"High oil prices are clearly an unwelcome event in the current economic climate, especially if they stay at this level for a prolonged period of time. \"With the economy already showing clear signs of slowing down in most developed and developing countries, high oil prices could be the straw that breaks the camel's back contributing to a recession. \"Central banks around the world will be forced to rethink their current policy stance if this rise in oil prices is passed onto the public through inflation.\"\n\n12:15PM\n\nAnalyst: US military escalation ‘not going to happen’\n\nBrent crude prices are holding steady at just under 9pc up. They spiked to 20pc up early this morning when Asian markets opened, which was the first chance traders had to react to the attacks over the weekend.\n\nUS Energy Secretary Rick Perry has joined the voices pinning the attack directly upon Iran, calling them “unacceptable”.\n\nDespite the sabre-rattling in Washington, OANDA’s Edward Moya writes:\n\nIt will take a lot to disrupt the bull case for US stocks and the today’s selloff that stemmed from the Saudi oil field attacks could see buyers eventually re-emerge. The possibility of a US military escalation remains a key risk but that is probably not going to happen. President Trump’s 2020 re-election bid cannot stomach a war and we should not be surprised if we continue to hear tough talk, and possibly further escalations in the Persian Gulf, with maybe a couple US coordinated air strikes that will look to avoid any loss of life. With the Fed likely to deliver a few more rate cuts and with the recent progress in the trade war, we should see limited downward pressure with US equities. Oil stocks could have a nice couple of days, while airline and cruise line stocks could see some pain. Geopolitical risks will increase calls for a trading range or even for another pullback.\n\n12:04PM\n\nHere’s where the strikes against Saudi oil facilities took place\n\nHere’s a reminder of how things stand\n\nPrime Minister Boris Johnson’s spokesperson has called the attacks “a wanton violation of international law”, adding: “The UK is concerned abut this behaviour and stands firmly in support of Saudi Arabia.”\n\n11:46AM\n\nToday’s oil price spike looks less significant in the longer run...\n\n...but just how long it takes for Saudi Arabia to rebuild capacity could be the key test.\n\n11:28AM\n\nWatchdog chief Bailey: City needs to do more to prepare for Brexit\n\nAndrew Bailey spoke at Bloomberg’s London headquarters this morning Credit: Jason Alden/Bloomberg More\n\nThe financial services industry has more work to do to ensure an orderly Brexit, Financial Conduct Authority head Andrew Bailey said in a speech this morning.\n\nMy colleague Harriet Russell reports:\n\nBailey outlined seven outstanding issues during a speech at Bloomberg headquarters in London, despite saying that preparations for a no-deal Brexit had “advanced over the course of this year” Mr Bailey said there were a “number of issues” that “require further action”, including a possible overlap in share trading rules, which he said had the potential to damage market liquidity “to no good end”.\n\nThe FCA, Harriet adds, has faced criticism for its role in protecting customers in several financial scandals this year, including the collapse of mini-bond seller London Capital & Finance, peer-to-peer company Lendy and the suspension of Neil Woodford’s flagship equity income fund.\n\nYou can read her full report here: Watchdog warns ‘further action’ needed to get City ready for Brexit\n\n11:24AM\n\nCobham vote passes\n\nJust in from the Cobham takeover deal meeting: voting on Advent’s takeover offer was 93.1pc in favour, 6.9pc against. More when I get it...\n\n11:18AM\n\nSt James’s Place shares slip as partners lose cruises-and-cufflinks bonus scheme\n\nBritain’s largest wealth manager has been criticised for its staff reward programme Credit: ANDREA MEROLA/EPA More\n\nShares in wealth manager St James’s Place have slipped almost 4pc this morning, after further reporting about its plans to cut down on lavish rewards for its advisers.\n\nIn a call to its advisers — or ‘partners’ — leaked to the Sunday Times, boss Ian Gascoigne said the company was likely to cut its bonus scheme.\n\nEarlier this month, Telegraph Money reported that St James’s Place had begun reviewing its incentives program as part of plans to “modernise”.\n\n11:05AM\n\nFull report: Trump says US is ‘locked and loaded’ as talk hopes cool\n\nUS President Donald Trump (left), and Iranian President Hassan Rouhani Credit: NICHOLAS KAMM/AFP More\n\nThe Telegraph’s middle east correspondent Josie Ensor has a full report on how things stand between the US and Iran following the weekend’s events. She writes:\n\nUS President Donald Trump and Iranian counterpart Hassan Rouhani appeared to back away from the prospect of talks on Monday, after an attack on a Saudi Arabian oil facility blamed on Tehran sent oil prices soaring... ...The Houthis, a Shia group aligned with Iran fighting Saudi-backed forces in Yemen, claimed responsibility for the attack and said it had the oil field “locked in its crosshairs”. However, experts and officials say it was unlikely to have been the Houthis, who lack the capability to carry out such a highly orchestrated attack on the kingdom. “This wasn’t done by an amateur, to put it very mildly,” tweeted Carl Bildt, co-chair of the European Council on Foreign Relations . “It was a massive and highly sophisticated attack.”\n\nYou can read her full report here: Donald Trump and Hassan Rouhani back away from talks as US is ‘locked and loaded’ after Saudi oil attack\n\n10:56AM\n\nSound investment? A battle lies ahead for HMV’s new owner\n\nCanadian music mogul Doug Putman Credit: John Rennison/The Hamilton Spectator More\n\nWhen HMV teetered once more of the brink of total shutdown earlier this year, it was Canadian masuic mogul Doug Putman who stepped in to rescue to ailing retailer.\n\nRetail correspondent Laura Onita has spoken to him about his plans for the trouble-prone company. She writes:\n\nMusic retailers have found it tough over the years to stay afloat because of high costs, a fall in sales and the rise of download and then streaming services that have made CDs obsolete. Putman nevertheless is optimistic. Last week he unveiled plans for the so-called Vault, a cavernous shop in Birmingham, previously home to furniture seller Ikea. It is so big that when it will open its doors next month, it should be one of Europe’s largest entertainment stores, if not the largest, with tens of thousands of titles and live gigs on the cards.\n\nDoes the HMV dog have a another day in it? Read more here: Challenges lie ahead in fight to save HMV under new Canadian owner\n\n10:45AM\n\nReuters: Return to normal production “may take months”\n\nReuters has heard from sources that it could be months before Saudi Arabia can return to full production capacity.\n\nSaudi Aramco’s full return to normal oil production volumes “may take months”, two sources briefed on the company’s operations said on Monday, after attacks on Saudi oil plants knocked out more than half of the country’s output. “It is still bad,” one source said. On Sunday, an industry source briefed on the developments told Reuters that Saudi Arabia’s oil exports will continue as normal this week as the kingdom taps into stocks from its large storage facilities, but that Aramco may have to cut exports later if the outage in output continued for long.\n\nIt’s still too early to measure what the long-term disruption of the Abqaiq attack will be, but this is how the numbers look currently (complete with useful preamble, courtesy of Wood Mackenzie’s Ed Crooks):\n\nA good chart showing the history of oil supply disruptions, from @JavierBlas and colleagues at Bloomberg pic.twitter.com/AfNKDqOrvv — Ed Crooks (@Ed_Crooks) September 16, 2019\n\n10:27AM\n\nOil price holds steady around 9pc up\n\nThe price of oil, which registered its biggest intraday spike ever (about 20pc) as Asian markets opened in the wee hours of this morning, is now up around 9pc.\n\nThat has left the price at around $66 a barrel, which is where it stood in mid-July.\n\nIt’s worth remembering August was a tough month for the black liquid, as trade war wobbles raised fears of slowing demand.\n\n10:12AM\n\nAvon Rubber bounces forward with revenues expectations holding\n\nAvon Rubber supplies tactical equipment to police and military forces Credit: Christopher Jones More\n\nContinuing what has been an unusually military-heavy blog, Avon Rubber has posted a trading statement ahead of its twelve-month results, saying it expects revenues to grow by 4pc for the full year.\n\nThe firm, which supplies tactical equipment to police and military forces, said it had experienced a “strong” year, with successful aircrew mask deliveries to the US Department of Defence a highlight.\n\nIt said strong law-enforcement performance had also bolstered its numbers.\n\nPaul McDonald, its chief executive. said:\n\nWe are on track to deliver a strong set of results in what has been a transformational year for Avon Rubber.\n\nJefferies analysts said:\n\nWe retain our positive stance on Avon. [Management] has again delivered in FY19F... The group’s fundamentals look strong and we believe there is still plenty more to come from Avon.\n\n9:51AM\n\nCobham shareholders set to vote on takeover bid\n\nDefence and aerospace supplier Cobham provides technology for governments around the world Credit: Chris Radburn/PA Wire More\n\nCobham investors will vote today on a £4bn takeover offer by American private equity firm Advent International, my colleague Alan Tovey reports. He writes:\n\nAdvent’s 165p-a-share offer to delist the business, which has the backing of Cobham’s board, needs the support of 75pc of shareholders at a meeting being held at City law firm Allen & Overy. Investors are signalling they will approve the bid after no rival contenders emerged with better offers. One major shareholder said: “It’s with reluctance. We were hoping someone else would stick their head above the parapet but it hasn’t happened.”\n\nYou can read his full report here: Cobham investors to vote on £4bn Advent takeover\n\n9:48AM\n\nMJ Gleeson raises dividend after revenue rise\n\nA builder lays bricks at a property development (stock photo) Credit: Chris Ratcliffe/Bloomberg More\n\nMJ Gleeson has raised its annual dividend following double-digit increases in its revenues and profit.\n\nThe low-cost housebuilder benefited from strong operational performance including a 25pc rise in unit sales for its Gleeson Homes division.\n\nThe company also announced it would maintain hold of its Strategic Land segment, which it had explored the idea of selling.\n\nPeel Hunt Analysts called the results “solid”, putting the company on a ‘Hold’ rating. They said:\n\nWe continue to like the relative defensive qualities of the business and growth outlook, but this is reflected in the share price\n\n9:22AM\n\nSpire Healthcare shares slip despite profit boost\n\nNurses outside the Spire Nottingham Hospital More\n\nShares in Spire Healthcare are down around 2pc currently, despite the small-cap hospital operator posting a rise in profit to £9.6m during the first half of the year.\n\nSpire managed to turn around a £2.2m loss for the same period last year, following cost-cutting and expectation-beating revenue from NHS referrals.\n\nJustin Ash, its chief executive, said:\n\nThis was a good performance with clear signs of our strategic and operational initiatives bearing fruit. We promised 2019 would be a year of stabilisation with revenue growth, continued quality improvement, cash generation and net debt reduction. All have been achieved in H1, with good operating profit performance. We saw growth in both private insurance and self-pay, with a particularly strong result in private insurance reflecting rising consumer awareness following our marketing campaigns\n\nLiberum analysts said:\n\nWhile today's update was very welcome given its patchy track record of earnings delivery, we still require more confidence that the market backdrop has stabilised before turning positive.\n\n9:11AM\n\nUBS: Attacks puts the heat back on over Iran\n\nThere had been hopes that Donald Trump’s firing on national security adviser John Bolton (right) would ease tensions over Iran Credit: Chip Somodevilla/Getty Images North America More\n\nUBS analysts say the weekend’s events blow up any sense that relations between Washington, Riyadh and Tehran would soon settle. They write:\n\nIf nothing else a reassessment of risk pricing will likely presumably come in the aftermath of this attack. To take out over 5pc of global supply (in the country with the bulk of ‘spare capacity’) in a single strike — a volume exceeding cumulative non-OPEC supply growth over 2014-2018 — is highly worrying. The departure of National Security Adviser [John] Bolton last week was interpreted by many as a reduction in political risk — this event may be significant magnitudes more consequential.\n\n8:56AM\n\nHouthis say Saudi Oil facilities will remain a target\n\nYemen’s Iran-backed Houthi rebels have said their weapons can reach anywhere in Saudi Arabia, and have vowed to continue targeting Saudi Arabian facilities.\n\nIn comments cited by the Houthi television station, the group — which is at war with a Saudi-led coalition in Yemen — said it the attacks on Saturday were carried out by “planes” with new engines, most likely in reference to drones.\n\n8:43AM\n\nMarket movements: Oil giants and arms companies gain, airlines slip\n\nVisitors look at a display model of a Saudi Air Force Eurofighter Typhoon jet, manufactured by BAE Systems, in Riyadh, Saudi Arabia, in February Credit: Mohammed Almuaalemi/Bloomberg More\n\nOil giants Royal Dutch Shell and BP are the biggest risers on the FTSE 100 today, with British Gas-owner Centrica and arms manufacturer BAE Systems also finding gains.\n\n94 of the blue-chip index’s 101 stocks are in the red, however, with British Airways-owner IAG the top faller.\n\nOn the mid-cap FTSE 250, airlines are also suffering, with Easyjet and Wizz Air both among the biggest drops. Predictably, energy firms Tullow Oil and Premier Oil are among the biggest risers.\n\n8:34AM\n\nReaction and analysis: ‘traders may be a little on edge for a while’\n\nHere’s a sample of the reaction to this morning’s oil price move.\n\nMarkets.com’s Neil Wilson said:\n\nThis is a big escalation in terms of the scale and reach of these attacks so raises prospect of ongoing disruption and raises the geopolitical danger. It’s going to add a massive risk premium to crude prices, so it will likely materially drive prices higher for a while. The big uncertainties right now for crude are 1) the extent of the outage, 2) how does this escalate, and 3) could there be more attacks of this kind. What is certain is the genie is out of the bottle in terms of risk premium. The implications of these attacks are far-reaching and lasting, going well beyond the immediate disruption to albeit a very large portion of global output. It is a material escalation in the risks to supply and, in short, traders now worry that Saudi Arabian oil production can be swiftly and easily knocked out, which goes against everything we’ve come to expect for the last 50 years. Saudi Arabia is supposed to be the reliable lynchpin, able to ramp production at will. It indicates ongoing destabilization to global energy markets and will raise very real concerns about the Aramco IPO.\n\nBiggest losers are oil consumers (and SJP|) pic.twitter.com/7O2EBXKjF1 — Garry White (@GarryWhite) September 16, 2019\n\nJefferies’ Jason Gammel said:\n\nIf the Iranians have been driven to desperate measures from the loss of crude export revenues, an attack on Saudi capacity seems a likely response. The risk of wider conflict in the regions, including a Saudi or US response, will likely raise the political risk premium on crude prices by $5-10/bbl.\n\nIn a worst case scenario that resulted in a shutdown of oil transport through the Straits of Hormuz, oil prices could push through $100/bbl. We think this outcome is highly unlikely however, not least because important Iranian allies like the Chinese would be hit hard.\n\nSaudi Riyal 12mth forwards set for biggest move since 2015 after attack of oil facility. Riyal has been pegged to US Dollar for decades, some traders use forward to speculate on the currency regime, BBG says. pic.twitter.com/SY6Pat5nkC — Holger Zschaepitz (@Schuldensuehner) September 16, 2019\n\nOANDA’s Craig Erlam said:\n\nThe attack was as severe as it was unexpected but that's not the worst thing about it. Saudi Arabia believes a significant proportion of the outages can be back online in a few days while Trump also approved release of supplies from the Strategic Petroleum Reserve to ensure the market remains well surprised. None of this should make us feel relaxed about the potential for further attacks though and the longer-term implications on the oil market. Spikes in oil prices when the global economy is already flirting with the idea of recession is not ideal and, if repeated and sustained, could ultimately be what tips us over the edge. While oil prices have pared gains following the initial knee-jerk reaction to the reports, Brent and WTI remain around 10pc higher as the geopolitical risk premium keeps prices elevated. This may settle down if attacks are not repeated but traders may be a little on edge for a while, keeping oil trading at a premium for some time.\n\n8:26AM\n\nEuropean stocks sink as oil attacks undercut rally\n\nWith markets finally getting a chance to react to the weekend’s oil attack shock, European equities are sliding slightly, losing some of the momentum they were building at the end of last week.\n\nCredit: Bloomberg TV More\n\n7:56AM\n\nChinese data adds to market gloom\n\nIt’s not just oil prices causing consternation.\n\nMSCIs broadest index of Asia-Pacific shares outside Japan slipped 0.4pc, Reuters reports, after data showed China's industrial production growth unexpectedly fell to its weakest pace in 17.5 years in August.\n\nPainting a dour picture of the world’s second-biggest economy, China’s statistics bureau said the country faces increasing downward pressure from external uncertainties.\n\nChina's blue-chip index eased 0.5pc, while Hong Kong's Hang Seng index faltered about 1pc, despite expectations Beijing will soon announce more support measures.\n\nLiquidity was relatively thin with Japanese markets shut for a public holiday.\n\n7:41AM\n\n‘Biggest one-day move ever’\n\nSmoke is seen following a fire at an Aramco factory in Abqaiq, Saudi Arabia, on Saturday Credit: REUTERS More\n\nState energy producer Saudi Aramco lost about 5.7m barrels per day of output in Saturday’s attack after 10 unmanned aerial vehicles struck the world’s biggest crude-processing facility in Abqaiq and the kingdom’s second-biggest oil field in Khurais.\n\nFor oil markets, it was the single worst sudden disruption ever, surpassing the loss of Kuwaiti and Iraqi petroleum supply in August 1990, when Saddam Hussein invaded his neighbour. It also exceeded the loss of Iranian oil output in 1979 during the Islamic Revolution, according to data from the US Department of Energy.\n\nIn an extraordinary start to trading on Monday, London’s Brent futures leapt almost $12 in the seconds after the open, the most in dollar terms since they were launched in 1988. Prices have since pulled back about half of that initial surge of almost 20pc, but were still heading for the biggest advance in more than three years.\n\nSaudi Arabia can restart a significant volume of the halted oil production within days, but needs weeks to restore full output capacity, people familiar with the matter said. The kingdom — or its customers — may use stockpiles to keep oil supplies flowing in the short term.\n\nAramco could consider declaring itself unable to fulfill contracts on some international shipments – known as force majeure – if the resumption of full capacity at Abqaiq takes weeks.\n\nThat would rattle oil markets and cast a shadow on Aramco’s preparations for what could be the world’s biggest initial public offering. It’s also set to escalate a showdown pitting Saudi Arabia and the US against Iran, which backs proxy groups from Yemen to Syria and Lebanon.\n\n7:37AM\n\nTrump: US is ‘locked and loaded’\n\nDonald Trump tweeted yesterday promising to respond to the drone attack on Saudi Arabia:\n\nSaudi Arabia oil supply was attacked. There is reason to believe that we know the culprit, are locked and loaded depending on verification, but are waiting to hear from the Kingdom as to who they believe was the cause of this attack, and under what terms we would proceed! — Donald J. Trump (@realDonaldTrump) September 15, 2019\n\n4:50PM\n\nAgenda: Oil prices surge\n\nThick black smoke rising from Saudi Aramco's Abqaiq oil processing facility in Buqyaq Credit: Planet Labs Inc More\n\nOil prices surged nearly a fifth after drone strikes on two plants in Saudi Arabia knocked out more than 5pc of global oil supply.\n\nThe dollar fell while safe havens and currencies of oil-producing countries rallied on Monday, as Middle East tensions mounted.\n\nBrent crude hit $66.31 a barrel in morning trading amid warnings prices at petrol pumps will rise.\n\nYemen's Iran-aligned Houthi group claimed responsibility for the damage, but the US has pointed the finger directly at Iran.\n\n5 things to start your day\n\n1) Thomas Cook has secured an extra week to hammer out a £1.1bn rescue deal, as debt speculators pile pressure on the troubled holiday company. A meeting had been scheduled for Wednesday to agree terms but has been moved to next week as Thomas Cook battles to survive.\n\n2) No-deal Brexit planners fear panic buying could cause shortages of toilet roll and disposable nappies despite reassurances from supermarket bosses, Whitehall insiders have told The Telegraph. Short supplies of such essentials are viewed as a genuine prospect if consumers take fright at lack of other goods, they said.\n\n3) Business investment will fall this year and again next year, dragging down economic growth and harming future productivity, the British Chambers of Commerce has warned. Companies are slamming the brakes on new projects illustrating “the impact of the political turmoil and lingering unwanted prospect of no-deal exit”, the business group said.\n\n4) O2, the mobile phone giant, is set to begin testing \"smart ambulances\" equipped with next generation 5G technologylater this month in a deal with Samsung and the NHS. Britain's biggest mobile network operator by number of users will pilot the technology on six ambulances from the East of England Ambulance Trust.\n\n5) The economist who predicted the US housing bubble that triggered the financial crisis has warned that cracks are emerging in the property market again. In an interview with The Telegraph Robert Shiller, the Nobel prize-winning economist, said a recent slowdown in price increases worryingly echoes trends in the American housing market before the bubble burst.\n\nComing up today\n\nRoyal Bank of Canada analysts struck an upbeat tone on Spire Healthcare ahead of its first-half results today. After analysing NHS data, they wrote that “a positive surprise in H1 2019” was anticipated from the private hospital operator, adding “we would buy into the results”.\n\nInterim results: City of London Investment Group, Horizon Discovery Group, Spire Healthcare Group\n\nFull-year results: MJ Gleeson\n\nTrading statement: Avon Rubber\n\nEconomics: Rightmove house prices (UK), Empire manufacturing (US)", "description": "Oil price makes biggest intraday jump since 1988 after Houthi drone attack on Saudi oil plants Disruption could send prices soaring ‘as high as $100 a barrel’ Donald Trump says US is ‘locked and loaded’ to go after aggressor European indices open lower as mood sours Robin Pagnamenta: A tit-for-tat oil", "authors": ["Louis Ashworth"], "top_image": "https://s.yimg.com/uu/api/res/1.2/CHvzLJfeT20pow0JaO1JPQ--~B/aD0xNDQ2O3c9MjMxNDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_258/9bb9af89fe01e4fda937cb4d338f31d3", "published_at": "2019-09-16"}