{"pub": "usatoday", "url": "https://usatoday.com/story/sports/college/2019/10/09/college-athletes-with-name-image-likeness-control-could-make-millions/3909807002", "downloaded_at": "2019-10-09 22:13:06.887496+00:00", "title": "If college athletes could profit off their marketability, how much would they be worth? In some cases, millions", "language": "en", "text": "CLOSE SportsPulse: Former NBPA Executive Director Charles Grantham spoke with Trysta Krick about his feelings on compensation for collegiate athletes. USA TODAY\n\nClemson quarterback Trevor Lawrence has a national championship to his name.\n\nHe could have a million dollars or more in his bank account as a result of his college superstardom, too.\n\nThat could have been the sophomore's reality if college athletes were able to sell their image on the open marketplace, experts in the economics of sports suggest.\n\nThat’s not allowed now under NCAA rules that restrict what athletes can earn. But America is drawing closer to an era in which college athletes will be able to turn themselves into commercial ventures, and big stars like Lawrence stand to benefit the most — perhaps with endorsement deals that would pay them more than a million dollars.\n\nClemson quarterback Trevor Lawrence (16) runs down the hill with teammates before the game at Memorial Stadium in Clemson, South Carolina Saturday, September 21, 2019. (Photo: Ken Ruinard / staff)\n\nBut they won’t be the only ones. Experts foresee a range of potential winners:\n\nHometown college sports stars at Power Five schools being able to pocket $25,000 a year from local businesses.\n\nFemale athletes who don’t have the option of professional sports being able to profit for the first time from their four years in the collegiate spotlight.\n\nVideo game enthusiasts who have spent six years mourning the loss of EA Sports’ popular NCAA Football game getting a chance to play once again, with a cut of the money spent being divided among thousands of college players depicted in the game.\n\n“It’s all going to depend on the marketability of the athlete,” said Ricky Volante, an attorney who represents athletes and entertainers who has studied this issue. “You could see the potential for athletes to have promotional deals both where they’re playing and where they came from.\n\n“College sports markets are very different than professional sports markets. You put a basketball player in Lexington, Kentucky, or a football player in Birmingham, Alabama, and now all of the sudden they’re in one of the biggest college sports markets. If you remove those restrictions and allow boosters to give them endorsement deals, you could certainly see athletes bringing in a substantial amount of money through names, images and likenesses rights.”\n\nSEISMIC CHANGE: Recruiting will shift if endorsements come to college sports\n\nCalifornia recently became the first state to pass legislation allowing college athletes to accept money for the use of their names, image and likeness, beginning in 2023. Other states are discussing similar laws, and multiple U.S. congressmen are looking at a federal bill. Meanwhile, the NCAA has a task force that will make its recommendation on allowing endorsements by the end of this month.\n\nWith this discussion intensifying, USA TODAY Sports talked with a range of experts to determine what sort of value colleges would have on an open market.\n\nHow much could college stars earn?\n\nThere’s no question the biggest stars in football and men’s basketball stand to earn the most. Those are the rare college athletes who would attract national advertising deals from sporting good suppliers and soft drink companies.\n\nLawrence, the quarterback who led Clemson to a national championship as a freshman last season, is viewed as a once-in-a-generation talent. Tye Gonser, a lawyer who once worked with an agency that handled endorsement deals for athletes such as Reggie Bush, has no doubt that Lawrence, if he were allowed to now, would have four national ad campaigns worth $250,000 apiece. Oklahoma quarterback Jalen Hurts, one of the top Heisman contenders this fall, would have similar appeal. A Heisman-winning quarterback like Lamar Jackson, who played at Louisville, could have parlayed that into a seven-figure income before heading to the NFL.\n\nZion Williamson, a basketball phenom who had 69.4 million views of his YouTube highlights before playing at Duke last year, could have made $2.5 million in his lone collegiate season, Gonser estimated.\n\nBut those are the outliers.\n\n\"A small number of athletes would get a healthy amount of money from national deals and national brands — things we think of as endorsements when you look at professional athletes — and the majority would get no cash probably, just some in-kind product or services. So, I think it’s just a sliver — maybe 5% of athletes — that would have any kind of meaningful deal at major universities.” Said A.J. Maestas, CEO of Navigate Research, a Chicago-based firm that assists colleges, conferences and pro sports entities with rights valuations.\n\n“What’s more difficult to predict is what would happen with local deals. Local car dealers is the example I hear and think of most often, and when it might not really make sense as a marketing investment, but they’re a fan and they’re highly interested in what it might mean as a recruiting advantage.”\n\nMost college athletes who earn extra money will get it by selling locally, the experts say. There are 347 Division I universities, and in many cases, the college sports teams are the chief form of entertainment in town.\n\n“One of the things we know about these high-profile college athletes is they have a lot of authenticity in their market. They have a tremendous amount of support from the alumni and the media coverage of them is fairly consistent. I think there’s going to be a lot of local and regional (advertising) plays because that’s where these athletes have the most fervent following,” said David Carter, principal owner of The Sports Business Group and associate professor of sports business at Southern California.\n\n“I think we’re talking about largely five-figure deals, $10,000 to $25,000.”\n\nThe NCAA opposes the movement toward allowing its athletes to profit from their brand. Its president, Mark Emmert, told USA TODAY Sports last week that athletes coming out of high school need to make the choice of whether to compete professionally or in college, but that the two can’t mix.\n\n“The biggest worry is that when you have complete unfettered licensing agreements or unfettered endorsement deals, the model of college athletics is negligible at best and maybe doesn't even exist,\" Emmert said. \"Those deals would be arranged with support or engagement of the school ... so they do become professional employees of schools? That is what most member schools are concerned about, not that people are opposed to have an appropriate way to get some form of (compensation for athletes).”\n\nBill author: Women would also profit under California law\n\nNancy Skinner is the California state representative who shepherded the \"Fair Pay to Play Act\" into law. She said she saw it primarily as a civil-rights issue: That college athletes should not be denied the opportunity to make money that every other citizen has just because the NCAA bans it while trying to protect its version of amateurism.\n\nBut Skinner has come to view the law as a potential revolution for female college athletes. Many of them reached out to her as the bill wound its way to the governor’s desk, Skinner said.\n\n“College may be the only time that a woman athlete is going to have the spotlight on her. Why is she then restricted from getting any income from her skill and talent?” Skinner said.\n\n“Women are really excluded from professional (sports) opportunities and so they really should have a shot at getting something while they’re in college. It was the women themselves who began to point out to me the ways beyond my understanding how the NCAA’s rules hurt women athletes.”\n\nCalifornia lawmaker Nancy Skinner introduced the state's \"Fair Pay to Play\" bill that was signed into law late last month. (Photo: AP PHOTO)\n\nHayley Hodson provided a case in point. She was a volleyball player so gifted that she was a member of the U.S. national team at age 17, set on an Olympic path. She felt there were two options open to her after high school graduation: Play professionally in Europe, where she might not get the best coaching or face elite competition, or play at a major American university.\n\nHodson chose to compete at Stanford and was careful to turn away any endorsement deals.\n\nAs a freshman, Hodson suffered two concussions so severe that she eventually had to retire from her sport, never making a dime. Now a law student at UCLA, she testified on behalf of Skinner’s bill and wrote a letter of support to Gov. Gavin Newsom.\n\n“I wasn’t trying to put food on the table. I was living at home, so I said ‘better safe than sorry.’ I’m not in dire need,” Hodson said of not accepting any money before competing at Stanford, not even her Olympic stipend, for fear the NCAA might rule her ineligible.\n\n“But that’s me. There are all these other athletes in the world. There’s so much money that these families spend and have to sacrifice.”\n\nHodson believes women’s sports is an untapped market, and the California law might bring that to light. Women who compete in volleyball, gymnastics, soccer and more have large social media followings among youth participants in those sports, Hodson said. And that should be attractive to sponsors looking to move merchandise.\n\n“With social media these days and the Internet and the speed of communication, the sky is the limit. There’s no set slice of the pie. I know a lot of women’s volleyball players who will probably make a good amount of money just because they’re talented and they already have a platform,” Hodson said.\n\n“The monetary value hasn’t been proved yet. Whether you’re playing tennis at Notre Dame or water polo at Long Beach State or squash on the East Coast, there are people who really support those sports.”\n\nJonathan Jensen thinks national brands will see the value in promoting female athletes at universities alongside their male counterparts. It’s good business, said Jensen, an assistant professor of sport administration at North Carolina who spent more than a decade working out sponsorship deals with professional sports teams, leagues and athletes.\n\nJensen pointed out university athletic departments already have contracts with corporate sponsors who can use the school logo in advertising, meaning it would be an easy transition for those companies to extend those agreements to individual athletes.\n\n“You can have the quarterback and the point guard on your packaging, but also the field hockey and women’s soccer player,” Jensen theorized. “Given that females make more than 90 percent of the buying decisions in the grocery store, why wouldn’t they leverage the images of great female athletes that every university has along with the male student-athletes?”\n\nUntapped markets of video games, apparel sales\n\nFootball is by far the most popular sport in America, so it’s no surprise that those athletes stand to get a financial benefit that no others will. It may come in the form of annual payments from EA Sports, assuming that company revives its “NCAA Football” game once the names, images and likenesses rules take effect.\n\nEA Sports discontinued the game in 2013 after former college athletes sued the NCAA and the video-game maker seeking a cut of the money for the use of their images.\n\n\"NCAA Football 14,\" which was released in 2013, was the last college football game from EA Sports. (Photo: EA Sports)\n\nDan Rascher is the professor of sport management at the University of San Francisco who was hired for that trial to estimate what college football players would make off the video game. He said he went with a conservative figure of $1,000 to $1,500 per year for every player depicted. That’s about 30 players per team — the starters and key backups — at the 130 FBS programs.\n\n“That’s a nice chunk of money to have in your pocket each year,” Rascher said.\n\nHe also pointed out another new source of revenue that some star athletes will be able to tap into: Jersey sales. Under current NCAA rules, apparel companies can’t manufacture jerseys of specific players while they’re still competing. The Collegiate Licensing Co. conducted a 2006 analysis that found more than a billion dollars of potential merchandise going unsold because of that.\n\nThat value has probably doubled since, given that college sports revenue grows 7 to 8 percent each year, Rascher said.\n\nWhat does that mean? If apparel companies can make and sell jerseys of the starting quarterback or leading scorer on the basketball team, some of the profit would be split between the university and the athlete. That’s potentially hundreds of millions of dollars nationally to divide up.\n\n“In a competitive market, some players could be making five and maybe even six figures,” Rascher said. “Think of the four- or five-star athlete coming out of high school with a lot of anticipation from fans. Marketers haven’t been creative before because there’s been no need to be. It will be the same sort of model used for professional athletes. Olympic athletes who come back to school. Anyone with a large following on social media. I think it really is just a matter of who is popular in the marketplace.\n\n“The universities, they’re going to fight this the whole time. But as soon as it becomes law, then they’re going to want to be in on it, too. They can finally fully monetize the athletes.”\n\nUltimately, the marketplace will dictate how much college athletes can make, and which ones will reap the largest benefit.\n\nJensen said that’s the way it’s always been. A company will determine if, for example, paying Hurts $10,000 in order to put the Oklahoma quarterback’s picture on their packaging will result in additional sales of that much money or more.\n\n“That system essentially already exists,” Jensen said. “The economists would probably simply suggest: Let a free-market mentality manage this and the companies can decide what the athlete is worth.”\n\nSkinner said that’s all her legislation was intended to do. She can’t understand why it took so long to get to this point.\n\n“This bill is going to benefit everybody. It’s not just about the elite athlete,” she said. “You could be the hometown hero of your small town because you won the statewide wrestling championship at your high school. Your local car dealership, for example, may want to sponsor you.\n\n“This is really about much more than the big endorsements that might invoke in some people’s minds.”", "description": "As discussion of athlete endorsement money in college sports grows, USA TODAY Sports talked with experts to determine what value colleges would have.", "authors": ["Mark Emmert", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/22/PGRE/a50a3923-4e4f-41d8-85f9-d667280f01bb-0921_Clemson_Charlotte_1stQ_1543.JPG?crop=1705,959,x695,y206&width=3200&height=1680&fit=bounds", "published_at": "2019-10-09"}