{"pub": "washingtonpost", "url": "https://washingtonpost.com/nation/2019/10/20/new-orleans-officials-prepare-blow-up-two-giant-cranes-site-deadly-hard-rock-hotel-collapse/?tid=pm_pop", "downloaded_at": "2019-10-20 23:25:38.647660+00:00", "title": "Collapsed Hard Rock Hotel in New Orleans will be demolished, officials say", "language": "en", "text": "The explosions “could not have gone much better,” New Orleans Fire Superintendent Tim McConnell said Sunday. Authorities are working to reroute a damaged sewer line, he said, but the blasts did not affect the gas or electric lines, which would have been much harder to repair.\n\nAD\n\nAD\n\nOne crane collapsed on top of the hotel, while another came down into a portion of the street where rubble had already fallen, McConnell said. The building itself remains “very unstable,” he said, but little damage to the surrounding area was reported beyond three broken windows at a theater.\n\nThe demolition of the cranes was just one step in what is sure to be a long, laborious and expensive response to the collapse.\n\n“To be clear, I don’t want anything salvaged on this site,” Mayor LaToya Cantrell (D) said Sunday.\n\nAuthorities’ first priority is a search of the rubble. Emergency workers on Monday removed the body of Anthony Magrette, a construction worker who died when floors of the 18-story building crashed down. But the mass of steel and concrete was deemed so precarious that crews could not remove the bodies of the two other men killed inside.\n\nAD\n\nAD\n\nOfficials are still assessing the site’s stability, but Cantrell said she hopes the search and rescue mission can move ahead.\n\nA controlled demolition of the cranes was initially set to take place Friday, but officials decided to hold off after crews inspecting the structures realized that bringing them down would be more hazardous than they originally believed.\n\n“As they got up there and got close to it they found out some things about it that have changed the way they’re going to take it down,” McConnell said in a news conference Saturday. “Safety is the number one concern, and when they tell us it’s too dangerous to do it one way and they want to do it in another way, we’re going with the experts.”\n\nAD\n\nOn Sunday morning, city authorities ordered people to leave the temporary evacuation zone around the site.\n\nAD\n\nIf you are in the temporary evacuation zone and need a place to stay, we are opening a temporary relocation center at the Treme Rec Center, 900 N. Villere St. You can stay there until the event is over. #HealthyNOLA #HardRockCollapse pic.twitter.com/It4fgAVuGk — New Orleans Health Department (@nolahealthdept) October 20, 2019\n\nThe cranes were heavily damaged when several floors of the 18-story building fell on Oct. 12. For days, the structures swayed precariously over the site, raising fears that they could topple in any direction and cause further damage. One crane stood about 270 feet, the other about 300 feet. Both had long boom arms that could be seen extending out over the wreckage.\n\nAfter consulting with demolition experts, city officials on Thursday announced plans to attach explosive charges to the towers. The goal was to detonate them in a precise sequence that would send the structures cascading into the footprint of the building without damaging surrounding streets or other infrastructure in the area, NOLA.com reported.\n\nAD\n\nBut officials cautioned that the cranes might not drop in the clean, controlled manner experts were hoping for. “That’s our goal, but it might not happen that way,” McConnell said.\n\nAD\n\nAccording to McConnell, one of the cranes shifted over the weekend and did not sway back, causing it to rub against the building’s concrete. That probably meant it was weakening, he said.\n\n“The plan is to make sure we’re prepared for whatever happens,” McConnell said. “It is a damaged crane. You’re not bringing down something that’s new construction. This thing is being brought down because it’s highly damaged.”\n\nOfficials removed residents in a roughly four-block radius surrounding the site. The city also established a temporary “exclusion zone” where people must stay indoors and a traffic closure zone extending several blocks farther. Additionally, the city has set up a relocation center across town where displaced residents can ride out the demolition. Workers went door to door to tell people what they need to do and gave residents four hours’ notice before the explosions begin, officials said.\n\nAD\n\nAD\n\n“The controlled detonation will be very loud. The best way to protect you & your family is to stay away until the all clear is given from the City,” Mayor Cantrell tweeted Saturday night.\n\nMcConnell said he expects evacuation zones to “collapse rather quickly,” though he could not give a specific timeline. NOLA Ready — New Orleans’ emergency preparedness campaign — tweeted Sunday afternoon that the exclusion zone had been lifted but that evacuations remained in place for some blocks closest to the hotel.\n\nAs city officials work to recover the last bodies, some of the people injured in the collapse have filed a lawsuit against the companies involved in the hotel construction. The lawsuit accuses the companies of negligence, saying they used inferior construction materials that were not strong enough to support the weight of the upper floors.\n\nThe companies did not immediately respond to a request for comment.\n\nAD", "description": "Authorities are preparing to extract two bodies still stuck in the building after bringing down two dangerously unstable cranes with carefully timed explosions.", "authors": ["Derek Hawkins", "National", "Breaking News Reporter", "Hannah Knowles", "General Assignment Reporter"], "top_image": "https://www.washingtonpost.com/resizer/CfTvaXks5TPKXgFHMjhEEY7hRMI=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ATMX7ZHSOEI6TO362IBG5YGBTE.jpg", "published_at": "2019-10-20"}