{"pub": "thehill", "url": "https://thehill.com/opinion/campaign/465742-valerie-jarrett-democrats-debate-must-include-gender-equity-solutions", "downloaded_at": "2019-10-14 23:20:57.034823+00:00", "title": "Valerie Jarrett: Democrats' debate must include gender-equity solutions", "language": "en", "text": "Last month, like millions of Americans, I tuned in to the Democratic presidential debate. The Democratic Party has an embarrassment of riches of candidates stepping up to run for president in 2020. Indeed, we are fortunate to have a group of candidates that is reflective of the rich diversity of our nation.\n\nAnd, like many others, I was impressed and encouraged by the robust debate and thoughtful discussion I heard on many issues that matter to the American people, including ensuring that all Americans have health insurance, addressing the threat of climate change, and ending our nation’s gun-violence epidemic. We also have seen town halls devoted to single issues such as climate, gun violence and LGBTQ rights.\n\nAnd yet, there is one set of issues that has been conspicuously absent from the conversation in the media. We have yet to have a critical discussion about gender equity and about strategies to ensure that America’s working families are able to thrive. Too often, these policies are brushed aside as “women’s issues,” but they have a huge impact on our productivity and on our nation’s workforce and global competitiveness.\n\nADVERTISEMENT\n\nAs a young working mom, I had a good job, with health insurance, four months paid leave, equal pay with my male peers, workplace flexibility and affordable, excellent child care. Nonetheless, I often felt as though I was holding on by my fingertips as I tried to fulfill my responsibilities at work and at home. And I often worried about the working families who did not have a safety net of support. Addressing the policy, political and cultural impediments that prevent working families from thriving has been a top priority of mine for over three decades.\n\nI am interested in hearing how the candidates intend to close the gender pay gap and proactively protect women from wage discrimination. Despite the historic progress that women have achieved in the workplace, we still earn only 82 cents for every dollar paid to our male counterparts. And we know these figures are even worse for women of color. In comparison to white, non-Hispanic men, black and Latina women only make 62 cents and 54 cents, respectively.\n\nThe United States is the only industrialized country in the world to not offer paid family leave. We’ve seen countless studies on the importance of paid leave. It’s beneficial to both employers and the workforce. We’ve even seen many candidates put forth innovative proposals around these issues. Yet, these debates should offer a platform to further explain and discuss these ideas.\n\nThe national minimum wage has not been raised in a decade. Thankfully, efforts such as Fight for $15 have gained traction around the country, but we need the federal government to raise the national standard. A country as wealthy as ours should not have millions of working families living in poverty.\n\nFar too many women do not re-enter the workforce because quality affordable child care is unavailable. What do candidates intend to do to address this need?\n\nADVERTISEMENT\n\nWe should be discussing strategies for protecting women’s reproductive rights, which are under constant attack. We need to hear about how the candidates would address the increasing maternal mortality and morbidity rate in the United States, and the significantly worse maternal outcomes for black women compared to the rest of the population.\n\nAnd, finally, we have heard no conversations about sexual harassment, sexual assault and violence. We see new allegations of sexual misconduct every day, in industries across the board, and we need to hear the candidates discuss their solutions to this pervasive problem. I commend Tarana Burke, an incredible advocate for gender equity, for calling attention to this last week, and Tina Tchen, who has devoted her career to working on diversity and inclusion issues, for taking the reins as president and chief executive of Time’s Up.\n\nTo have no discussion of working family issues in the last nationally televised debate was a huge missed opportunity. These issues aren’t only women’s issues; they affect everyone. They are economic issues and directly impact our ability to attract and retain the most talented workforce in the world. At Tuesday’s debate, I call on the moderators to ask questions about these issues. And if they don’t, it’s incumbent upon the candidates to figure out how to bring them to the forefront. The American people deserve to know where the candidates stand on these issues, and the debates provide the forum to do so.", "description": "We must have a critical discussion about strategies to ensure that America’s working families are able to thrive.", "authors": [], "top_image": "https://thehill.com/sites/default/files/democratic_debate_10142019_1.jpg", "published_at": "2019-10-14"}