{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7564725/New-Yorks-Museum-Modern-Art-set-reopen-bigger-better.html", "downloaded_at": "2019-10-12 07:01:54.623357+00:00", "title": "New York's Museum of Modern Art reopens this week after a $450 million makeover", "language": "en", "text": "New York's Museum of Modern Art reopens on October 21 after its latest expansion\n\nA message welcomes the public to the newly renovated Museum of Modern Art in New York\n\nThe heralded museum is set to reopen on October 21 after its multi-million-dollar makeover allowing curators to display hundreds more works annually. The works will also have the benefit of more natural light\n\nNew York's heralded Museum of Modern Art reopens this month after a multi-million-dollar makeover that will allow curators to display hundreds more works every year.\n\nThe museum has been closed for four months but will open again on October 21 following the latest renovations which increase the venerated institution's capacity.\n\nMoMA, which moved to its current location in 1939, has undergone remodeling in 1950, 1962, 1980 and 2001 to cope with a growing collection and increased footfall.\n\nSpace was expanded by a third this time and director Glenn Lowry says the layout has been reinvented to reflect the philosophy of the museum's first director, Alfred Barr.\n\nThe upgrade, which cost $450 million, means the museum will be able to exhibit around 2,400 works a year, compared to an average of 1,500 previously\n\nA piece by artist Rivane Neuenschwander titled 'Work of Days' is viewed during a press preview on October 10 at MoMA\n\nSpace was increased by a third under MoMA's latest expansion\n\n'Barr imagined it as a laboratory to which the public was invited. The public would participate in the experiment of looking at and thinking about modern art,' Lowry said.\n\n'He understood that the museum was to be a work in progress, changing and evolving as modern and contemporary art changes and evolves,' Lowry told reporters at a preview.\n\nThe museum took advantage of a real estate project by selling some land to a developer to build a luxury tower, in which MoMA would make use of the first three floors.\n\nBy also making some tweaks to its existing buildings, MoMA has increased its capacity to 165,000 square feet (15,329 square meters).\n\nA member of the media walks through one of the MoMA's galleries during a Thursday press preview held for the expanded and re-imagined museum ahead of the October 21 opening of its expanded campus. Artworks will now be presented by theme rather than by time period\n\nA woman walks past Andy Warhol 'Campbell's Soup Cans' during a press preview on Thursday. The MoMA's themes and artwork will change every six months or so but the major pieces will always be on show\n\nA member of the media stands next to Edward Ruscha 'OOF' during a renovated MoMA press preview on Thursday. The museum took advantage of a real estate project by selling some land to a developer to build a luxury tower, in which MoMA would make use of the first three floors\n\nThe upgrade, which cost $450 million, means the museum will be able to exhibit around 2,400 works a year, compared to an average of 1,500 previously, Lowry said.\n\nThe most radical change is that for the first time artworks will be presented by theme rather than by time period. The works will also have the benefit of more natural light.\n\n'What makes modern and contemporary art exciting is precisely the debates and arguments that are still taking place,' said Lowry.\n\n'(We want to) make the public aware the questions are more interesting than the answers,' he added.\n\nThemes and artwork will change every six months or so but the major pieces, such as Claude Monet's 'Water Lilies' and Pablo Picasso's 'The Ladies of Avignon' will always be on show.\n\n'For people who come and want to see the icons, they'll be there,' said Lowry.", "description": "The heralded New York museum is set to reopen later this month after its multi-million-dollar makeover allowing curators to display hundreds more works annually.", "authors": ["Chauncey Alcorn For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/06/19617664-0-image-a-17_1570857621094.jpg", "published_at": "2019-10-11"}