{"pub": "yahoo", "url": "https://news.yahoo.com/climate-protesters-fight-bank-england-144037392.html", "downloaded_at": "2019-10-15 08:12:17.054464+00:00", "title": "Climate Protesters Take Fight to the Bank of England, BlackRock", "language": "en", "text": "(Bloomberg) -- Hundreds of activists from the climate protest movement Extinction Rebellion blocked roads around the Bank of England and glued themselves to BlackRock Inc.’s London headquarters on Monday, calling out the financial sector for funding of fossil fuels.\n\nThe action marks the start of the second week of disruption around London by the group who have targeted government buildings, bridges and key produce markets to raise the alarm that governments and business aren’t moving fast enough to contain climate change.\n\n“It’s time we had a grown-up conversation about the economic and legal system which is killing life on Earth,” said Gail Bradbrook, co-founder of Extinction Rebellion. “It’s time to think about what kind of finance system we need to support the thriving of life on Earth.”\n\nAmong several demands, the movement wants politicians to aim for net-zero emissions worldwide by 2025, a quarter of a century quicker than the U.K.’s current plans. It’s urging government ministers to establish a citizens’ assembly to analyze climate change and draw up proposals that would feed into legislation.\n\nLondon police have arrested 1,336 protesters as the force balances citizens’ right to protest with causing the least amount of disruption for Londoners. Dozens of police were stationed around Bank Underground station on Monday. At Blackrock protestors glued themselves to the building and blocked entrances accusing the investment of being the “world’s biggest” backer of fossil fuels, according to a press release from the group.\n\nPressure on companies to divest from investing in fossil fuels has never been higher. The world’s biggest investors have increasingly pushed companies this year to reverse course on climate change and set short-term targets for cutting greenhouse gas emissions.\n\nBlackRock has been pushing to enhance climate-related disclosures through the Task Force on Climate-related Financial Disclosures. Michael Bloomberg, founder and majority stakeholder of Bloomberg News parent Bloomberg LP, chairs the group.\n\nHowever, a recent report from the largest investor initiative tackling climate change said that the world’s most polluting companies aren’t moving fast enough to fall in line with the Paris accord on global warming.\n\nBank of England Governor Mark Carney has been at the forefront of a push to force companies to be more transparent about their climate risks. In a recent interview with the Guardian newspaper, he said that industries that are not moving toward zero-carbon emissions will be punished by investors and face bankruptcy.\n\n(Updates with Blackrock from first paragraph.)\n\nTo contact the reporter on this story: Jeremy Hodges in London at jhodges17@bloomberg.net\n\nTo contact the editors responsible for this story: Reed Landberg at landberg@bloomberg.net, Adveith Nair, Lars Paulsson\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Hundreds of activists from the climate protest movement Extinction Rebellion blocked roads around the Bank of England and glued themselves to BlackRock Inc.’s London headquarters on Monday, calling out the financial sector for funding of fossil fuels.The action marks the start of the second", "authors": ["Jeremy Hodges"], "top_image": "https://s.yimg.com/uu/api/res/1.2/j9jkre0ZVGA2_k3ZyOGbMg--~B/aD0xNDI3O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/9822798730e0691e720268f4a44aadb2", "published_at": "2019-10-14"}