{"pub": "japantoday", "url": "https://blog.gaijinpot.com/common-japanese-phrases-to-help-you-study-jlpt-n2-and-n3-grammar", "downloaded_at": "2019-10-15 16:20:14.261314+00:00", "title": "Common Japanese Phrases To Help You Study JLPT N2 and N3 Grammar", "language": "en", "text": "Master advanced Japanese grammar by listening out for these phrases on the daily.\n\nBy Matthew Coslett Oct 15, 2019 5 min read\n\nStudying for the Japanese Language Proficiency Test (JLPT) N2 and N3 exams can be pretty exhausting. I lost track of the number of times that I drilled myself with the grammar books or free apps for studying Japanese to the point that the key sentences for understanding each grammar point became a mantra that I’d recite even in my sleep.\n\nZzzzzzz… その 問題 （ もんだい ） をめぐって 賛否 （ さんぴ ） が 分 （ わ ） かれた. Zzzzzzz… “We are divided on things surrounding this issue.”\n\nLuckily a lot of these grammar points aren’t necessarily found in seldom-used sentences like the one above.\n\nTake, for example, two grammar points that I struggled with which were: ～ 得 （ え ） ない and ～たて.\n\nThese are often found in exam sentences like 現実 （ げんじつ ） では 起 （ お ） こり得ない and 大学 （ だいがく ） を 出 （ で ） たてのお 医者 （ いしゃ ） さん.\n\nBut how do you remember the meaning of sentences like this?\n\nOverheard in Japan\n\nIf you’ve lived in Japan long enough you’ve probably heard the term あり得ない (Unbelievable!) overused to the point of redundancy.\n\nSo it isn’t too much of a leap from that to remembering that ～得ない means (Cannot be done) and therefore working out the meaning of 現実では起こり得ない (That couldn’t happen in reality).\n\nSimilarly, while learners may struggle with a tricky subject like 大学を出たてのお医者さん in a sentence, you probably wouldn’t if you remembered 焼 （ や ） きたてパン —the freshly baked bread that you come across every time you go to a bakery.\n\nImmediately, the meaning of ～たて (Just done) reveals itself and you can work out that 大学を出たてのお医者さん is used to describe a doctor who is freshly graduated from college.\n\nThis is one of the interesting things about this kind of grammar; it’s all around us and by practicing it daily we can put ourselves on the road to mastery.\n\nConcentrating on small talk\n\nOne of the best ways that learners can master JLPT grammar it is by talking about every Japanese elderly guy’s favorite small-talk topic: the weather.\n\nBelieve it or not, but this deceptively simple subject will help you master some of the trickiest grammar forms!\n\nSome of the most obvious examples of this are the grammar forms ～のような, っぽい, and ～らしい that confuse so many learners.\n\nBut this doesn’t need to be the case. When chatting about the weather, you should slip in terms like\n\n夏 （ なつ ） っぽい (It is very summery summer weather)\n\n(It is very summery summer weather) 夏らしい (It is very summery weather except NOT in summer)\n\n(It is very summery weather except NOT in summer) 夏のような 暑 （ あつ ） さが 続 （ つづ ） く (Heat like that in summer is continuing)\n\n… into your small talk to get daily exposure to the differences between these similar forms.\n\nEven some of the trickier grammar points can be used to talk about the weather: 今夜 （ こんや ） から 明日 （ あした ） にかけて 全般 （ ぜんぱん ） に 曇 （ くも ） りや 雨 （ あめ ） の 天気 （ てんき ） でしょう (It will probably be generally cloudy and rainy weather over tonight and tomorrow) is a great way to practice the tricky form, にかけて (spread over an area).\n\nSimilarly, listen out for phrases like １週間 （ いっしゅうかん ） 雨 （ あめ ） が 降 （ ふ ） りつづくことになる (It has been raining for a week) to practice ことになる grammar (Something that I have no control over is happening).\n\nWeather can also be used to practice the tricky AうちにB (Before A happens, do B) grammar.\n\nGuys like me who value their beauty sleep will almost certainly never use the standard prep phrase 陽 （ ひ ） が 昇 （ のぼ ） らないうちに 出発 （ しゅっぱつ ） しよう (Let’s start before the sun rises).\n\nBut with the sort of baking hot summers that we get in Japan, 暑 （ あつ ） くならないうちに 出 （ で ） かけよう (Let’s leave before it gets too hot) is definitely a useful phrase.\n\nFinally, don’t forget to also add phrases like 雨はやむどころかいよいよひどくなった (Far from stopping, the rain increased) into your daily repertoire in order to practice the tricky どころか grammar (Far from ~).\n\nListen out for phrases that you hear at work\n\nRegardless of whether you work in a コンビ二 (convenience store), 英会話 （ えいかいわ ） (English-language school), or 会社 （ かいしゃ ） (office) there are plenty of chances to practice the other N2 and N3 forms.\n\nThese simple meaningless phrases that you might mutter to your colleagues such as\n\n諦 （ あきら ） めないで (Don’t give up!)\n\n(Don’t give up!) 気 （ き ） にしないで (Don’t worry about it)\n\n(Don’t worry about it) やり 過 （ す ） ぎないで (Don’t overdo it)\n\n… offer a chance to practice the ないで (Don’t do~) and 過ぎない (Don’t do too much~) grammar forms daily.\n\nばかり (Just done) is another one that is used a lot in office chat.\n\n仕上 （ しあ ） がったばかり (Just finished it) and 私 （ わたし ） は 今着 （ いまつ ） いたばかりだ (I just arrived now) are both useful daily phrases.\n\nSimply the other use of ばっかり (Nothing but) can be practiced in forms like:\n\n上司 （ じょうし ） は 帰国 （ きこく ） したばかりだ (The boss has just returned from abroad)\n\n(The boss has just returned from abroad) 彼 （ かれ ） らは 不平 （ ふへい ） ばかり 言 （ い ） う (They do nothing but moan about things)\n\n(They do nothing but moan about things) 言い 訳 （ わけ ） ばかりするなよ (Don’t just keep making excuses!).\n\nAnd hang on to phrases you use to complain about things\n\nGeneral grumblings can also be useful for practicing other forms such as がち (Have a tendency to do something).\n\n彼は 遅刻 （ ちこく ） しがちだ (He is apt to be late)\n\n(He is apt to be late) 彼はなまけがちである (He tends to be idle)\n\n(He tends to be idle) 言い訳をしがちだ (Apt to make excuses).\n\nThis can be practicing with other terms for tendencies such as 最近 （ さいきん ） 風邪 （ かぜ ） ぎみ and 最近 太 （ ふと ） りぎみだ followed by the inevitable いけない advice form:\n\n夜更 （ よふ ） かしはいけない (You must not stay up late)\n\n(You must not stay up late) 食 （ た ） べすぎはいけない (You shouldn’t eat to excess).\n\nA related form is ないではいられない (I cannot help but~) that appears in sentences like 私はその 老人 （ ろうじん ） に 同情 （ どうじょう ） しないではいられない (I cannot but feel sorry for the old man).\n\nIn addition, conflicts can be useful for practicing certain forms such as ~しかない found in:\n\n謝 （ あやま ） るしかない (There is nothing to do but apologize)\n\n(There is nothing to do but apologize) 待 （ ま ） つしかない (I can only wait)\n\n(I can only wait) 彼は 怒 （ おこ ） るべきだ (He should be angry)\n\n(He should be angry) 真実 （ しんじつ ） をいうべきだ (You should tell the truth)\n\n(You should tell the truth) 君 （ きみ ） は 謝罪 （ しゃざい ） すべきだ (You should apologize)\n\nHang in there!\n\nAnother common one that you will hear or use is the ～ば～ほど (The more ~ the better). This can be tricky to say, so it is always worth practicing.\n\nYou might have heard 早 （ はや ） ければ早いほど 良 （ よ ） い with means “the sooner, the better.”\n\nThis can also be paired with ～ようになる to make sentences like すぐに 出来 （ でき ） るようになる (You will soon be able to do it) and 英語 （ えいご ） を 話 （ はな ） せるようになるだろう (You will be able to speak English).\n\nAnother thing you’ll soon be able to do? Pass the JLPT! While all of these won’t be useful every single day, these examples show that a lot of everyday phrases contain the kernels of the larger, more difficult ideas that come up in the test.\n\nAnd as that other common phrase goes: “Every little helps!”", "description": "", "authors": ["Matthew Coslett", "Amelie Marie Nishizawa", "Mike Kozlowski"], "top_image": "https://gaijinpot.scdn3.secure.raxcdn.com/app/uploads/sites/4/2019/10/Common-Phrases-JLPT.jpg", "published_at": "2019-10-15"}