{"pub": "cbs", "url": "https://cbsnews.com/news/ernst-young-seminar-ey-cancels-seminar-that-told-women-not-to-flaunt-bodies", "downloaded_at": "2019-10-23 10:53:46.679355+00:00", "title": "Ernst & Young cancels seminar that told women not to \"flaunt\" bodies", "language": "en", "text": "Accounting firm Ernst & Young has backtracked after defending a training seminar that encouraged its female executives to conform to gender stereotypes.\n\nThe program, called \"Power-Presence-Purpose,\" was prepared by a third-party vendor and suggested that women who work at Ernst & Young have good haircuts, manicured nails and refrain from showing skin so as not to distract their male counterparts.\n\n\"This voluntary program, which was delivered to a small group of EY professionals, does not reflect EY's values or culture and should not have been offered to any of our women,\" Ernst & Young said in a statement to CBS MoneyWatch.\n\nAn Ernst & Young spokesperson said the company has canceled the program after conceding that \"elements of the program included offensive content that is inconsistent with our core beliefs.\"\n\n\"Don't flaunt your body — sexuality scrambles the mind (for men and women),\" reads an excerpt form the training materials obtained by HuffPost.\n\nThe accounting and management consultancy said it is reviewing \"processes and controls around program content\" to ensure that no similar mistakes occur.\n\nErnst & Young initially defended the seminar, telling Huff Post that \"any isolated aspects are taken wholly out of context.\" The company also told the news outlet that the program was well-reviewed by participants.\n\nTwitter disagreed.\n\n\"Enforcing stereotypes has absolutely nothing to do with training women leaders,\" a Twitter user named Meghan Gaffney tweeted.\n\n\"Folks, we'd like to welcome you to 2019 where these 'trainings' are 100% hogwash (and sexist),\" a Twitter user named A.C. Pokharel said.\n\nEY has some work to do. Enforcing stereotypes has absolutely nothing to do with training women leaders. NOTHING. https://t.co/8E2woBNcxZ — Meghan Gaffney (@meghangaffney) October 22, 2019\n\nEY told women how to act and dress and told them they shouldn’t talk to men, but made the Fortune list of best large workplaces for women? 🤔🤔🤔\n\nhttps://t.co/cwercyfwt5 — krissy trujillo (@katullys) October 22, 2019\n\nThis is not a great look for @EY_US . Folks, we'd like to welcome you to 2019 where these \"trainings\" are 100% hogwash (and sexist) https://t.co/oBr2Ukh5ZV — A.C. Pokharel (@Ayushpokh) October 22, 2019\n\nErnst & Young said it celebrates diversity within the 270,000-employee firm — and seeks to prop up women.\n\n\"The women of EY thrive because of the strength of their character, the authenticity they display and their capabilities. We value and celebrate the differences of our people and do not advocate conformity among our people,\" the spokesperson told CBS MoneyWatch. \"We are incredibly proud of our women and our longstanding commitment to diversity, inclusion and creating a culture of belonging for all.\"", "description": "Big Four accounting firm said an executive training course with \"offensive\" content \"should not have been offered\"", "authors": ["Megan Cerullo"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/22/07d7d643-a5f7-4370-9001-f8b387930f7c/thumbnail/1200x630/64d828dd9d99d57d7f68f3e1844d075a/gettyimages-626256908.jpg", "published_at": "2019-10-22"}