{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-finland-security/one-killed-10-injured-in-attack-at-finnish-college-idUKKBN1WG3O3", "downloaded_at": "2019-10-01 15:34:45.199376+00:00", "title": "One killed, 10 injured in attack at Finnish college", "language": "en", "text": "STOCKHOLM (Reuters) - One person was killed and 10 were injured at a college in eastern Finland on Tuesday in a violent incident that a newspaper said began when a student attacked a teacher with a sword.\n\nPolice said they had opened fire during the incident at a college located in a shopping centre in the town of Kuopio. One person, identified as a male Finnish citizen, was taken into custody. Police said he was among the injured.\n\nFinnish newspaper Iltalehti quoted a witness as saying that a student had come to class with a large bag, taken out a sword and attacked a teacher.\n\nVille Hokkanen, spokesman at the Eastern Finland Police Department, told Reuters the man had used a bladed weapon in the attack and had carried a gun.\n\n“One person died in the incident and 10 were injured, one of which was the suspect,” Hokkanen said. “Two of these 10 were seriously injured.”\n\nHe declined to say whether police knew the reason for the attack or whether man was a student at the school.\n\nRelated Coverage Finland school attacker attacked fellow students with sword - police\n\nPolice were expected to give more details in a news conference later in the afternoon.\n\n“The act of violence at Savo Vocational College in Kuopio is shocking and we utterly condemn it,” Prime Minister Antti Rinne said on Twitter. “I have had discussions with top police officers and the government is following the situation closely.”\n\nFinland has seen two deadly school attacks in the past 12 years. In 2007, a student at the Jokela High School shot 8 people dead before killing himself. In 2008, a 22-year-old student at a vocational school in Kauhajoki shot 10 people dead before committing suicide.", "description": "One person was killed and 10 were injured at a college in eastern Finland on Tuesday in a violent incident that a newspaper said began when a student attacked a teacher with a sword.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191001&t=2&i=1435908182&w=1200&r=LYNXMPEF902Y8", "published_at": "2019-10-01"}