{"pub": "cbc", "url": "https://cbc.ca/sports/hockey/nhl/nhl-senators-islanders-recap-oct-24-1.5336247", "downloaded_at": "2019-10-26 06:46:16.697065+00:00", "title": "CBC Sports", "language": "en", "text": "There was plenty of frustration following the Ottawa Senators' 4-2 loss to the New York Islanders Friday night.\n\nOttawa was looking to win back-to-back games for the first time this season, but failed to put in a 60-minute effort.\n\n\"It wasn't our most complete effort for sure,\" said Mark Borowiecki. \"We've just got to stop this one great game and one kind of lay an egg a little bit. We dug ourselves a hole early. We tried to claw our way back and played a little better as the game went on, but our margins for error are slim right now and we can't dig ourselves holes.\"\n\nThe Islanders had their own share of frustration when Matt Martin was checked by J.C. Beaudin midway through the second period and fell into an open door at the Senators bench.\n\nWATCH | Islanders stay on winning roll:\n\nNick Leddy connected on his first two goals of the season to push the New York Islanders to a 4-2 victory over the Ottawa Senators. 1:04\n\nMartin, who had a goal and an assist, left the game, but was able to come back and admitted it was a bit of a scary moment.\n\n\"It wasn't a good feeling,\" said Martin. \"The door was closed as I was skating up the wall, I knew that, and I just kind of got bumped and it swung open so obviously it wasn't locked. It kind of went numb there originally.\"\n\nBorowiecki ended up having to answer for the Senators as he and Cal Clutterbuck exchanged punches. Borowiecki said the hit was a total accident and was glad to see Martin return to the game.\n\n\"It's not intentional,\" Borowiecki said. \"If you think it's a set play to open the door to get a guy hurt it's just not correct. [Martin] plays a hard game and it was an unfortunate accident.\"\n\nMartin said his knee was stiffening up, but preferred to focus on the fact the Islanders pulled off their sixth straight win.\n\nWATCH | Emerging NHL storylines at the 10-game mark:\n\nIt's still very early in the season, but Rob Pizzo has already found things to get excited about. 1:47\n\nNew York (7-3-0) was led by a two-goal effort from Nick Leddy and a solid 30-save performance in goal by Thomas Greiss. Derick Brassard also scored.\n\n\"It was a gritty win,\" said Leddy. \"I don't think it was our best game, but gritty nonetheless and we got the two points.\"\n\nTyler Ennis scored twice for the Senators (2-6-1). Anders Nilsson allowed four goals on 16 shots before being pulled. Craig Anderson stopped all 13 shots he faced.\n\nThe Islanders were playing the second half of back-to-back games, yet the Senators were unable to take advantage.\n\n\"That first period was a step in the wrong direction,\" said Connor Brown. \"We weren't ready to go right off the bat and they were. That's a team we caught on a back-to-back and we should have been coming out of the gate and it was a little bit too little too late.\"", "description": "Nick Leddy had two goals and an assist as the New York Islanders beat the Ottawa Senators 4-2 Friday night.", "authors": [], "top_image": "https://i.cbc.ca/1.5336701.1572057056!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/nhl-islanders-senators-nelson-and-anderson-20191025.jpg", "published_at": "2019-10-26"}