{"pub": "breitbart", "url": "https://breitbart.com/news/fiat-chrysler-and-peugeot-in-talks-to-create-50-bn-car-giant", "downloaded_at": "2019-10-30 07:53:56.977989+00:00", "title": "Fiat Chrysler and Peugeot in talks to create $50 bn car giant", "language": "en", "text": "Milan (AFP) – US-Italian auto giant Fiat Chrysler said Wednesday it was in merger talks with France’s Groupe PSA, the maker of Peugeot and Citroen cars.\n\nFiat Chrysler Automobiles (FCA) said in a statement it “confirms there are ongoing discussions aimed at creating one of the world’s leading mobility groups” with PSA, but declined to offer additional details.\n\nUS-Italian auto firm Fiat Chrysler and France’s Peugeot said Wednesday they are in merger talks that could result in the creation of a $50 billion carmaking giant.\n\nBoth firms issued statements before the opening of markets confirming reports that they in talks to combine their businesses.\n\nFiat Chrysler Automobiles (FCA) said in a statement it “confirms there are ongoing discussions aimed at creating one of the world’s leading mobility groups” with Groupe PSA, whose historical brands include Peugeot and Citroen.\n\nThe statement declined to offer additional details.\n\nPSA’s statement also offered no details.\n\nA person with knowledge of the matter told AFP on Tuesday that the merger would yield an entity valued at about $50 billion.\n\nThe person said Carlos Tavares, the chief executive of Peugeot’s parent, Groupe PSA, would lead the new company as CEO while John Elkann, chairman of FCA, would be chairman.\n\nDiscussions between the automakers are ongoing and there is no guarantee of an agreement, the source said, confirming details first published in the Wall Street Journal.\n\nAccording to Bloomberg News, FCA’s board of directors is expected to hold an emergency meeting on Wednesday.\n\n– Consolidation –\n\nA merger of the two groups would bring under one roof Alfa Romeo, Chrysler, Citroen, Dodge, DS, Jeep, Lancia, Maserati, Opel, Peugeot and Vauxhall.\n\nThe discussions come just months after a proposed merger between Fiat Chrysler and French automaker Renault fell through.\n\nPSA has never hidden its interest in automotive sector consolidation.\n\nFiat Chrysler’s former boss Sergio Marchionne, who died last year, also spoke repeatedly about the need for consolidation in the automotive sector.\n\nThe tie-up would combine the strengths of the two groups.\n\nDespite its Italian origins with Fiat, FCA doesn’t have a very strong position in Europe compared to PSA with its French and German brands.\n\nOn the other hand, PSA is absent from the massive US market, where FCA has Chrysler plus the Jeep, Dodge and Ram brands.\n\nPeugeot posted a new record for revenues of $82 billion (74 billion euros) in 2018 while FCA reported 110 billion euros in revenue.\n\nThe French group has a market capitalisation of 22.54 billion euros on the Paris Stock Exchange, while FCA is valued at just over $28 billion on Wall Street and 20.74 billion euros in Milan.\n\nburs-rl/wdb", "description": "Milan (AFP) – US-Italian auto giant Fiat Chrysler said Wednesday it was in merger talks with France’s Groupe PSA, the maker of Peugeot and", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/30/16cec2_fiat-is-seeking-french-partner-months-tie-up-renault-fell-fiat-chrysler-640x335.jpg", "published_at": "2019-10-30"}