{"pub": "investingcom", "url": "https://ng.investing.com/news/stock-market-news/draghis-qe-triumph-hinged-on-ecb-colleagues-from-tiny-economies-51873", "downloaded_at": "2019-09-17 13:10:29.722164+00:00", "title": "Draghi’s QE Triumph Hinged on ECB Colleagues From Tiny Economies", "language": "en", "text": "© Reuters. Draghi’s QE Triumph Hinged on ECB Colleagues From Tiny Economies\n\n(Bloomberg) -- Mario Draghi’s controversial push to restart bond purchases counted on the support of European Central Bank policy makers who might never have expected to be so influential.\n\nThe president cited the backing of a “significant majority” and “very broad consensus” for the decision on Thursday. But around eight of the 25-member Governing Council opposed quantitative easing, including the Dutch, French and German central bank chiefs, meaning the addition of just a handful of others could have thwarted his plans.\n\nThat made the views of officials from the region’s smallest countries consequential. Among those supporting him were governors from the euro area’s two Mediterranean island economies, Malta and Cyprus, two of its Baltic members, Latvia and Lithuania, and possibly Luxembourg too. Those five make up 20% of the Governing Council -- but just 2% of the region’s population and 1.4% of its gross domestic product. Without them, his majority would have evaporated.\n\nSeen in that context, the unprecedented resistance faced by Draghi highlights a stark geographical split. Support of governors mainly from southern Europe, and from small countries, allowed him to overcome resistance from colleagues whose economies form the heartland of the euro area, and more than half of it as measured by output and number of people.\n\n“In every central bank that I know of, there’s a range of views at the moment about how do you deal with below-target inflation,” ECB Chief Economist Philip Lane said in London on Monday. “At the Fed or Bank of England, there’s not that many votes that are unanimous. There will be differences of views.”\n\nIn that sense, the ECB decision may mark the coming-of-age of an institution that is much younger than its global counterparts. It’s conceivable that the degree of opposition would have convinced former presidents Wim Duisenberg and Jean-Claude Trichet not to proceed. Last week’s outcome may set a precedent for future decisions on how sheer numbers in the room should carry the day.\n\nThat would complete Draghi’s shift away from the consensus-driven approach of his predecessors just as he prepares to hand over the reins to Christine Lagarde. She’s likely to preside over highly controversial decisions too, including whether to expand QE. Such a move might require an adjustment to the ECB’s self-imposed rules limiting bond purchases, which are intended as a safeguard against stepping into monetary financing.\n\nLagarde and Draghi can always cite the authority of being appointed by the collective decision of the region’s governments, an empowerment of legitimacy that national governors can’t match. But his claim of broad support from colleagues implicitly acknowledges that he can’t act alone, and that such backing is needed.\n\nECB policy makers -- comprising 19 governors and six Executive Board members -- all attend as individuals rather than as national representatives. Similarly, the institution doesn’t weight participation in accordance with population, unlike some European Union voting procedures.\n\n“It’s very important to remember, everyone on the Governing Council is there as an individual,” Lane said. “Everyone there, in the Governing Council, is making an assessment of what is a good idea for the euro area.”\n\nDraghi didn’t call a vote on QE because he judged that bulk of policy makers were behind him. Resorting to such a device is rare, in any case.\n\nUnder the formal rules, which rotate voting every month to streamline decisions, the French and Estonian governors -- both of whom were opposed to bond purchases -- couldn’t have cast ballots this time. But it wouldn’t really have changed the size of the swing needed either way.", "description": "Draghi’s QE Triumph Hinged on ECB Colleagues From Tiny Economies", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC1E0RG_L.jpg", "published_at": "2019-09-17"}