{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKBN1WU2FC-OCASP", "downloaded_at": "2019-10-15 23:10:02.748287+00:00", "title": "Tiger to tell his 'definitive story' in memoir", "language": "en", "text": "FILE PHOTO: Golf - Masters - Augusta National Golf Club - Augusta, Georgia, U.S. - April 14, 2019. Tiger Woods of the U.S. celebrates with with his green jacket and trophy after winning the 2019 Masters. REUTERS/Lucy Nicholson\n\n(Reuters) - Tiger Woods will write a memoir billed by the publishers as a “candid and intimate narrative of an outsize American life”.\n\nA publication date was not given for “Back”, which is the first account from 15-times major winner Woods, 43, and is being written with the full cooperation of his friends, family and inner circle.\n\n“This book is my definitive story. It’s in my words and expresses my thoughts. It describes how I feel and what’s happened in my life,” Woods said in a statement from HarperCollins Publishers on Tuesday.\n\n“I’ve been working at it steadily, and I’m looking forward to continuing the process and creating a book that people will want to read.”\n\nA child golfing prodigy, Woods went on to dominate the sport and has long since cemented his place as the greatest player of his generation and arguably of all time.\n\nSince Woods turned professional in 1996 he has virtually redefined the game.\n\nNot only did he usher in an era of multi-million dollar endorsements and lucrative appearance money, but his Afro-American-Asian background spread the sport to an audience far beyond its traditional image of male, white and middle-class.\n\nWoods later went through a highly-public divorce in 2010 after revelations of his marital infidelities convinced him to take a self-imposed hiatus from professional golf, a DUI arrest in 2017 and multiple knee and back surgeries that convinced many his best days were behind him.\n\nYet Woods made a stirring return to the top of the sporting world in April when he triumphed at this year’s Masters for his first major victory in nearly 11 years.", "description": "Tiger Woods will write a memoir billed by the publishers as a \"candid and intimate narrative of an outsize American life\".", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191015&t=2&i=1441179427&w=1200&r=LYNXMPEF9E1KL-OCASP", "published_at": "2019-10-15"}