{"pub": "npr", "title": "As A Crowdfunding Platform Implodes, A Legendary Composer Rebounds", "url": "https://npr.org/2019/05/14/723225435/as-a-crowdfunding-platform-implodes-a-legendary-composer-rebounds", "language": "en", "published_at": "2019-05-14", "downloaded_at": "2019-09-02 07:20:59.686466+00:00", "text": "As A Crowdfunding Platform Implodes, A Legendary Composer Rebounds John Zorn is one of many who were negatively impacted by the recent bankruptcy of crowdfunding platform PledgeMusic\n\nEnlarge this image toggle caption Jack Vartoogian/Getty Images Jack Vartoogian/Getty Images\n\nJohn Zorn, the prolific and brilliantly iconoclastic composer, realized a dream of sorts last year when he released The Book Beriah — a box set of 11 new albums, featuring as many different groups interpreting music he had written for that purpose.\n\nThe 92 songs in the set amounted to the final column of an impressive edifice: the Masada songbook, which he began just over 25 years ago, building on the legacies of Jewish folk music. Originally limited in scope to a single working band called Masada, the project expanded to include many branches and collaborators and a series of releases on Zorn's label, Tzadik.\n\nThe Book Beriah was a Tzadik release too, though its elaborate sprawl and high production costs led Zorn to involve an outside partner: PledgeMusic, a British-based, direct-to-fan crowdfunding service designed to help bring musical projects to fruition. \"The only way we could have broken even was going on a platform like this,\" Zorn tells NPR Music.\n\nNow, after a calamitous turn for PledgeMusic — which announced last week that it is headed for bankruptcy — Zorn hopes to recoup a substantial loss: $197,559, all of it raised through the platform and still owed to Tzadik.\n\n\"This is a lot of bread for us, it really is,\" Zorn says. \"After three years of work on this project, with dozens of musicians, and hundreds of hours of recording and mixing. Then to have this happen, my first thought was: 'Why are they doing this to us?' \"\n\nZorn is far from alone. PledgeMusic owes hundreds of thousands of dollars to artists and labels, many of them independents operating on small margins. An untold number of fans have also been shortchanged, because the projects they invested in remain unfinished, or caught in limbo. \"There have been no good outcomes here,\" Benji Rogers, a co-founder and former CEO of PledgeMusic, wrote last week in an open letter, \"and I cannot bear that something that I created to benefit artists and fans has caused so much pain to so many people.\"\n\nIn Tzadik's case, consumers, at least, have been unaffected: Everyone who ordered The Book Beriah or related merchandise has received the product. But Zorn's ongoing plight with the project reveals some of the pitfalls of a business model that has become increasingly common in the music industry — one that relies, to a large degree, on economies of trust.\n\nYouTube\n\nZorn — an experimental music linchpin, a 2007 MacArthur Fellow, and the founder-proprietor of The Stone — has long been a paragon of artistic self-reliance. Tzadik came out of that impulse, after his tenure on Elektra/Nonesuch in the 1980s and early '90s, and a series of releases on the Japanese label DIW. The first Tzadik releases appeared in 1995, and since then it's been a deluge, consisting of albums by not only Zorn and his inner circle but also avant-garde eminences like Derek Bailey, Alvin Curran and Wadada Leo Smith.\n\nSarah Robertson, co-founder of the music manufacturing company A to Z Media, has been working with Zorn since Tzadik's inception. She also has history with PledgeMusic: About a decade ago, when the company was getting started in the United States, she sublet office space to Rogers and his fledgling team.\n\n\"It was shocking and devastating when this happened,\" Robertson tells NPR Music. \"For a small label like Tzadik, that's an enormous amount of money to have lost. And I personally took it pretty hard, because I had recommended John to do this, to work with Pledge.\"\n\nEchoing reports in Billboard and elsewhere, Robertson suggests that the collapse of PledgeMusic had less to do with a flawed business model than with a failure of execution. \"I think it's mismanagement of funds,\" she says. \"The money should have been held and then paid out to the artist. Not to pay operating expenses. Where has all that money gone?\"\n\nRogers, who had left PledgeMusic in 2017, returned to his company in a volunteer capacity early this year. \"I wanted to be a part of the efforts to get things back on track,\" he explains in the open letter, \"but it is obvious now that too much damage had already been done.\" Part of his efforts involved a Hail Mary plan to sell the company. In March, Variety reported that the company had pared down to a \"skeleton staff\" and stopped payroll in the United States.\n\nZorn and his Tzadik co-founder, Kazunori Sugiyama, began to realize something might be wrong in the early weeks of this year. For a while, they gave PledgeMusic the benefit of the doubt. \"I'm basically a trusting person,\" Zorn says. \"If someone doesn't get back to me, I don't assume that they're crooks or that they hate my guts. I just assume that maybe they're too busy, or maybe the email got lost in the digital ether somewhere.\"\n\nYouTube\n\nAfter the truth emerged and Zorn processed his initial shock, he says, \"I went into my let's-fix-it mode. I always have a Plan B. I try to find a way to solve the problem that's a creative way.\" To that end, Tzadik has just announced four limited-edition vinyl releases, handpicked by Zorn with input from Sugiyama.\n\nAmong them is Masada — The Best of Sanhedrin, the first-ever vinyl release by the original Masada Quartet, which consisted of Zorn on alto saxophone, Dave Douglas on trumpet, Greg Cohen on bass and Joey Baron on drums. Alhambra Love Songs is an acoustic trio recording featuring Cohen, pianist Rob Burger and drummer Ben Perowsky.\n\nThe two other releases underscore Zorn's breadth as a composer. Nove Cantici Per Francesco D'Assisi features a suite inspired by the life of St. Francis of Assisi, performed by an all-star guitar trio of Bill Frisell, Julian Lage and Gyan Riley. And The Last Judgment is the final recording by a heavy-gauge project called Moonchild, with vocal chameleon Mike Patton, organist John Medeski, bassist Trevor Dunn and Baron on drums.\n\nRobertson offered to make the vinyl free of charge, as a gesture of goodwill. Others involved, like mastering engineer Scott Hull and designer Heung-Heung Chin, were also generous with their time and services.\n\nThere are also still several hundred copies of The Book Beriah available for purchase — direct through Tzadik's website. (A number of additional copies are also being held by a fulfillment company, which wasn't paid for its services by PledgeMusic. Zorn says that when he raises the requisite amount, he'll pay the balance and reclaim that outstanding product.)\n\nFor Zorn, it all amounts to a lemons-into-lemonade situation, one that he hopes will strengthen the label's base by rallying public support. \"We made something that's beautiful; it looks and sounds great; it's special; and it also gives our fans and the world outside an opportunity to help,\" he says. \"And also get something really cool in exchange.\"", "description": "For John Zorn, realizing an ambitious, 11-album project was only possible through a crowdfunding campaign — except that the company he used, PledgeMusic, went bankrupt. It may cost him a lot of money.", "authors": ["Nate Chinen"], "top_image": "https://media.npr.org/assets/img/2019/05/14/gettyimages-175623473_wide-444dd13afaa74570d636572cc22d3571154382ba.jpg?s=1400"}