{"pub": "fox", "title": "Google Maps plots course for billion dollar payday with ads", "url": "https://foxbusiness.com/technology/google-maps-app-projected-earn-11-billion-ads-revenue", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:01:09.982159+00:00", "text": "Google Maps will need to find directions to the nearest bank.\n\nContinue Reading Below\n\nThe app that billions of people use every day, to find the nearest gas station, Starbucks or freeway on-ramp, Google Maps, is about to be monetized in a very big way. According to Skift.com, Google has been perfecting the ubiquitous app before in advance of launching advertising on the results which will bring in an estimated $11 billion in revenue over the next four years.\n\nSome transportation experts believe users will put up with the new ads. “Google has developed a high-quality mapping product with a significant user base over the past two decades,” Juan Matute Deputy Director at UCLA’s Institute of Transportation Studies told FOX Business, “That they haven't fully monetized it sooner is the anomaly. But linking people with information about nearby businesses, services, and events provides a useful service.”\n\nSkift's story was based on research conducted by the investment firm Morgan Stanley. The report expects that by highlighting donut shops, shoe stores or any other ad driven partnership on the maps app, Google could bring in $4.86 billion next year.\n\nThis report comes on the heels of Google announcing that it plans to also integrate bike riding, ride-sharing and transit information into their maps giving users more options for deciding on how to arrive at their destinations.\n\nWith or without ads, urban planners and transit experts see positives from the app. “Google Maps helps transit and commuters,” said UCLA's Matute, It provides them with easy-to-understand, actionable information in context, which can help them make informed travel decisions.”\n\nAdvertisement\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nMorgan Stanley projects revenue to increase exponentially as users become more used to accessing promoted ads/pins that highlight specific businesses. Desktop searches may add $1.23 billion says the firm while mobile devices may account for up to $9.82 billion and going as high as $11 billion in 2023.\n\nGoogle brought in $116 billion in advertising last year alone but Morgan Stanley predicts that with maps reaching an international audience in 240 countries the potential for earnings and growth is huge.", "description": "Google maps app is set to roll out ads and create $11 billion dollars in new revenue.", "authors": ["Mike Cherico"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/06/0/0/google-maps-1-Google.jpg?ve=1&tl=1"}