{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/28/democrat-senator-accuses-trump-showing-disrespect-pelosi-by-not-telling-her-about-al-baghdadi-raid", "downloaded_at": "2019-10-29 00:16:54.103099+00:00", "title": "Democrat Senator: Trump Disrespected Pelosi by Not Telling Her of Raid", "language": "en", "text": "President Trump disrespected House Speaker Nancy Pelosi (D-CA) by not telling her about the raid that killed ISIS founder Abu Bakr al-Baghdadi, according to Sen. Chris Coons (D-DE).\n\n“There is a long tradition of the President notifying leaders in Congress of both parties when there’s a sensitive operation underway,” Coons said during an interview on CNN’s New Day with John Berman on Monday.\n\n“But to disrespect the speaker of the House, who is in the direct line of succession to the President, and to not inform bipartisan leaders in Congress, to only inform a few Republicans, I think was just one more important norm of cooperation shattered by this President,” the Democrat senator concluded.\n\nOn Sunday, President Trump announced that al-Baghdadi had died in a raid carried out by United States special forces.\n\n“He died like a dog, he died like a coward,” he said. “The world is now a much safer place.”\n\nWhen pressed as to why he did not notify Pelosi in advance about the raid, Vice President Mike Pence told Fox News host Chris Wallace on Sunday that President Trump’s only focus was to bring al-Baghdadi to justice.\n\nHe commented:\n\nI just want to emphasize the president’s focus here throughout particularly the last several days was on the mission to bring a man who was the most wanted man in the world, a man who had brought unspeakable violence through the isis caliphate, who was exporting violence throughout the world to justice and that combined with ensuring the safety of our forces coming in from executing the mission and moving out was the president’s directive throughout this effort and I know it animated every decision that he made along the way.\n\nIn a statement following the president’s announcement over the weekend, Pelosi made a veiled criticism of his decision not to inform House leaders of the raid.\n\nThe statement said:\n\nThe House must be briefed on this raid, which the Russians but not top Congressional Leadership were notified of in advance, and on the Administration’s overall strategy in the region. Our military and allies deserve strong, smart and strategic leadership from Washington.\n\nHowever, Breitbart News reported that Congressional leaders were not briefed prior to the event due to fears that the information might be leaked.\n\n“We were going to notify them last night but we decided not to do that because Washington leaks like I’ve never seen before. There is no country in the world that leaks like we do and Washington is a leaking machine,” President Trump stated.", "description": "Trump disrespected House Speaker Nancy Pelosi (D-CA) by not telling her about the raid on al-Baghdadi, according to Sen. Chris Coons (D-DE).", "authors": ["Amy Furr"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-1176367758-640x335.png", "published_at": "2019-10-28"}