{"pub": "bbc", "url": "https://bbc.com/news/world-us-canada-49805207", "downloaded_at": "2019-09-29 00:18:59.674064+00:00", "title": "Andrew Yang: The 'Asian math guy' trying to be next US president", "language": "en", "text": "Image copyright Getty Images\n\nThe success of Andrew Yang has been one of the unexpected sub-plots of the 2020 presidential race. And his fan base is surely one of the most devoted.\n\nWhat's the opposite of Donald Trump?\n\nThe answer, says 2020 Democratic presidential candidate Andrew Yang, is himself - \"an Asian guy who's good at math\".\n\nWith a $1,000-a-month universal basic income proposal, a pessimistic outlook of economic havoc and a self-deprecating humour, Yang has mounted a surprising surge.\n\nPolitically unknown when he started the campaign, he now enjoys a devoted internet following known as the \"Yang Gang\" and the honourable title of \"meme king\" among the Democratic presidential candidates.\n\nThe 44-year-old tech entrepreneur centres his campaign on \"Freedom Dividend\", a proposal to provide every American between the ages of 18 and 64 $1,000 every month with no strings attached.\n\nYang warns that automation and artificial intelligence could take away nearly half of American jobs in the next three decades, and he believes that universal basic income can help ease the pain and solve various social problems. His ambitious plan may sound too good to be true, drawing laughs from his fellow candidates on the debate stage, but Yang says that he has \"looked at the numbers\".\n\nHis support in national polls hovers around 3%, which places him behind the top tier of candidates but above vastly experienced senators like Cory Booker and Amy Klobuchar.\n\nYang is fulfilling his \"Make America Think Harder\" campaign slogan by stoking a national conversation about the threat artificial intelligence poses to American jobs.\n\nAt a Yang rally in Washington DC, hundreds of supporters passionately shouted out his name and held up \"MATH\" signs, abbreviation of his campaign line. The crowd were mostly white and Asian, slightly more male and very young.\n\nImage caption Chinese immigrant Allison Qiu brought her six-year-old daughter to a Yang rally\n\n\"One state has adopted a dividend. Everyone in that state gets one or two thousand dollars a year. Which state is that?\" Yang asked, pointing at the crowd.\n\n\"Alaska!\" A large portion of the crowd yelled back. It was still relatively early in the presidential race, but Yang's loyal supporters had memorised his lines.\n\n\"And how did they fund it?\"\n\n\"Oil!\" Since 1982, Alaska has paid an annual dividend to every person living in Alaska from the state-owned investment fund funded by oil revenue.\n\n\"And what's the oil of the 21st century?\" Yang cued his supporters again.\n\n\"Technology!\"\n\nWith a satisfied smile, Yang said what Alaska did with oil money can be done nationwide through his universal basic income plan with \"technology money\", a value-added tax on the big tech companies.\n\nAmong the crowd in the rally were 19-year-old Jalen Adams and 18-year-old Emily Synoski, who travelled three hours from Delaware for the event. Ms Synoski tells BBC News that she and many of her generation support Yang because he focuses on the future, in which young people have the most at stake.\n\n\"We will be the ones working in this country when automation becomes big.\"\n\nMedia playback is unsupported on your device Media caption Andrew Yang's debate surprise - a giveaway to random families\n\nSupport from this social media-savvy generation has also boosted Yang's online popularity. Since the first Democratic primary debate, Yang has gained more Twitter followers than any other candidates.\n\n\"I make sure every one of my friends would hear about Andrew Yang,\" says Mr Adams.\n\nSome of the online support is not the kind that Yang is happy to gain. His warning about mass unemployment caused by automation resonates with the far right, who see him as sympathetic to the plight of blue-collar white Americans.\n\nMeet the leading candidates\n\nMemes of Yang were trending on online forums known for racist and sexist comments. Several prominent white nationalists have praised his policies, which Yang has denounced: \"They're antithetical to everything I stand for.\"\n\nPortraying himself as a political outsider who recognises the most urging problem of America's future, Yang has successfully won support from both progressives and conservatives, from former supporters of Bernie Sanders to people who voted for Donald Trump in 2016.\n\nYang appeals to Silicon Valley tech workers, including Tesla's Elon Musk who has endorsed him on Twitter, arguing that Yang appears to understand technology's societal implications and proposes data-driven approaches to solve them.\n\nImage copyright BBC News Image caption Allison Qiu wanted her six-year-old to see a presidential candidate that looks like her\n\nYang has also mobilised Asian-American voters, who generally tend to be less politically active. A son of Taiwanese immigrants, he is one of the first and most recognisable East Asian-Americans in history to run for president.\n\nChinese immigrant Allison Qiu brought her six-year-old daughter to a Yang rally, the first political rally for both of them. \"I want my daughter to see that a person who looks like us can run for president in this country,\" Qiu tells BBC News.\n\nYingchao Zhang, a Chinese-American community leader in New Jersey and a supporter of Yang, believes his campaign will encourage more young Asian-Americans to participate in politics. \"They will no longer think they are perpetual foreigners.\"\n\nMedia playback is unsupported on your device Media caption What young people think of Democratic Party's future\n\nHowever, some of Yang's signature self-deprecating jokes could be seen as reinforcing Asian stereotypes. His campaign character is built upon \"an Asian man who is good at maths\".\n\n\"I'm Asian, so I know a lot of doctors,\" he claimed during the nationally-televised Democratic presidential primary debate in Houston. Yang soon found himself at the centre of a national debate of racism.\n\nWhen stand-up comedian Shane Gillis came under fire for having mimicked Chinese accents and an instance of using a racial slur to refer to Yang, Yang advocated for forgiveness rather than punishment, which triggered a blowback from the Asian-American community.\n\nHe also received criticism for appearing to draw a comparison between how American society reacts to anti-Asian racism and anti-black racism.\n\nThe Taiwanese-American candidate may as well have to navigate the international political dynamics under added scrutiny. In the Democrats' first primary debate, one of the only two questions Yang got was about the trade war with China, which he believes will end up hurting Americans' wallets.\n\nImage copyright Getty Images Image caption Journalists watch Yang during the Houston Democratic debate\n\nDuring the latest debate, Yang stated his father grew up in \"a peanut farm in Asia,\" without specifically mentioning Taiwan, a practically independent island considered by most Chinese as a rebel region of China.\n\nSome view his vague statement as an attempt to refrain from potential controversy that could alienate him and his Chinese American supporters. Even though Yang said his Mandarin is only \"shoddy\", Chinese-language media have covered his candidacy with great curiosity and high expectation.\n\nOne of the most popular news websites in China, The Paper, has defined his campaign as a \"supernova-to-be\" fighting \"the underdog's fight\".\n\nWhether Yang can surge higher remains to be seen. Meanwhile, he certainly appears to be having the most fun on the campaign trail, often posting videos of him dancing, playing basketball and crowd-surfing.\n\nHis crowd-surfing video got 35,000 likes on Twitter, winning praise for his authenticity.\n\nA Twitter user comments: \"It's really refreshing to see a politician having fun and enjoying his supporters.\"\n\nWho will take on Trump in 2020?", "description": "Andrew Yang's pledge of $1,000-a-month for every American has piqued the interests of many US voters.", "authors": ["Zhaoyin Feng", "Bbc Chinese Service"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/DED3/production/_108934075_gettyimages-1174321623.jpg", "published_at": "2019-09-28"}