{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/18/WS5da96fe7a310cf3e35571561.html", "downloaded_at": "2019-10-18 08:03:38.496112+00:00", "title": "Ban on drivers using mobile phones in Shenzhen", "language": "en", "text": "By ZHENG CAIXIONG in Guangzhou | chinadaily.com.cn | Updated: 2019-10-18 15:55\n\n[Photo/IC]\n\nDrivers who use mobile phones and other electronic devices while driving will be fined a total of 300 yuan ($42.86) and have three points deducted in Shenzhen of Guangdong province starting Nov 1.\n\nIn addition to making phone calls and sending messages, watching video and viewing messages on mobile phones and other electronic devices fixed in the shelves inside cars will also be regarded as violations of traffic rules and liable for punishment, according to a statement released by Shenzhen traffic police on Friday.\n\n\"Watching videos and viewing messages will distract the drivers and increase the risk of causing traffic accidents,\" said the statement.\n\nDrivers' distractions have become one of the major reasons for traffic accidents in the southern metropolis in recent years, the statement added.\n\nAccording to statistics revealed by Shenzhen traffic police department, a total of 316 drivers were killed in traffic accidents in 2018. Nearly one-third were killed in accidents caused by drivers using mobile phones and other electronic devices while driving.\n\nShenzhen traffic police urged drivers to use Bluetooth hands-free systems or park their cars along the roadside when they have important phone calls, text messages and WeChats to answer or reply to, the statement said.\n\nAccording to traffic rules in China, drivers will have their driving license revoked when they have 12 points deducted in a year.", "description": "Drivers who use mobile phones and other electronic devices while driving will be fined a total of 300 yuan ($42.86) and have three points deducted in Shenzhen of Guangdong province starting Nov 1.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/18/5da96fe7a310cf3e97a1eb26.jpeg", "published_at": "2019-10-18"}