{"pub": "nationalreview", "url": "https://nationalreview.com/news/cory-booker-violence-against-lgbt-youth-national-emergency", "downloaded_at": "2019-10-11 00:54:39.480474+00:00", "title": "Cory Booker: Violence Against LGBT Youth a 'National Emergency'", "language": "en", "text": "Sen. Cory Booker takes part in a televised townhall dedicated to LGBTQ issues in Los Angeles, Calif. October 10, 2019. (Mike Blake/Reuters)\n\nDemocratic presidential candidate Cory Booker said Thursday evening that he considers the level of violence against LGBT youth in America a “national emergency” and added that he would making combatting it a priority should he be elected president.\n\n“Thirty percent of LGBTQ youth, 30 percent, have reported missing school in the last month because of fears for their physical safety,” the New Jersey senator said at a town hall focusing on LGBT issues, which was hosted by CNN and the Human Rights Campaign Foundation on the eve of National Coming Out Day.\n\n“We live in a country where we still see regular, everyday violence and intimidation and bullying against Americans, because of who they are,” Booker continued. “So, number one, I am going to appoint a secretary of education, first of all, that sees the dignity and the worth and the value of every one of our children, and I will have a department of education that takes the steps necessary to protect all children in America.”\n\nBooker, New Jersey’s first African-American senator, also referenced the struggles of African-Americans in the U.S. during his remarks Thursday night.\n\n“I’m here because people of all races and all backgrounds fought to affirm the rights of African-Americans and stand up for them,” Booker said. “You can be sure that as president of the United States I will be focused every day not just on executing the laws of this land that should protect all but I will be setting an example that we are a nation of love of all people.”\n\nThe senator has admitted that he was once “a young man in a toxic environment of football and the like” who held bigoted views against LGBT people, views Booker says have evolved.\n\nWhile he once “hated gays” and the “thought of two men kissing each other was about as appealing as a frontal lobotomy,” Booker has since eschewed those views, he said.", "description": "Democratic presidential candidate Cory Booker said Thursday evening that he considers the level of violence against LGBT youth in America a \"national emergency\" and added that he would making combatting it a priority should he be elected president.", "authors": ["Mairead Mcardle", "Victor Davis Hanson", "Jim Geraghty", "John Mccormack", "A. G. Hamilton", "Zachary Evans", "Alexandra Desanctis", "Read More", "The American Conservative", "The Week"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/cory-booker-lgbtq-town-hall-2.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-11"}