{"pub": "thestreet", "url": "https://realmoney.thestreet.com/investing/kass-here-s-the-deal-with-amazon-15140799", "downloaded_at": "2019-10-25 22:07:44.205087+00:00", "title": "Kass: Here's the Deal With Amazon", "language": "en", "text": "Amazon (AMZN) beat on the top line ($70 billion vs. consensus of $68 billion, +24% which was +300 bps better than the previous quarter) and bottom line but guided lower for 4Q2019.\n\nE-commerce accelerated. Higher margin advertising sales also accelerated. Other revenue did as well (in rate of growth terms, +45% year over year and +8% quarter over quarter). AWS sales growth of +35% (about $150 million below consensus) dropped from +37% in 2Q2019 - the fifth consecutive quarterly slowdown in the growth rate. (But, put into perspective, the AWS add of $9.3 billion is larger than Microsoft's (MSFT) Azure and Alphabet's (GOOGL) Google cloud combined. Moreover, future commitments indicate a long runway lies ahead.)\n\nThe conference call suggested that Japan sales were pushed forward due to a scheduled consumption tax hike and to a Diwali Holiday shift in India.\n\nThe important metrics of absolute unit growth and an acceleration of sales delivered by 1-Day Prime were intact.\n\nForward guidance was weak (margins were projected to drop by 70 bps, the first drop in a decade) - reflecting, among other things, rising shipping and fulfillment costs (one day Prime shipping), higher personnel and marketing expenses (AWS) and a slightly weaker than expected Holiday season. I would not be surprised to see the company beat these conservative forecasts.\n\nImportantly, based on our analysis, we don't consider these investments as permanently increasing the company's cost structure and long term profitability.\n\nThough higher than expected, we must recognize that this will serve to put more daylight between Amazon and its competitors - it's this deepening moat that underscores the fundamental reason why I still expect Amazon to become the first $2.5 trillion company:\n\nIn the annals of U.S. corporate history there is no company that has as large and lengthy a runway of opportunity as Amazon.\n\nIt is that prism of opportunity that supports my strong belief that Amazon's earnings growth will far exceed consensus expectations.\n\nHere are the five keys to my increasingly bullish case:\n\nAmazon's first-mover advantage is now impenetrable; the company no longer can be caught by its competitors. Amazon's broad product offerings and technological advantages no longer can be duplicated. On the wings of a nearly zero cost of capital Amazon has expended enormous sums of capital to produce the massive and insurmountable competitive advantage that exists today. That \"kindness of strangers\"in such scale likely will never be duplicated again by a competing business entity, thus placing Amazon light years ahead of its competition. Indeed, in this marathon of disruptive growth (a marathon approximates 26.2 miles), Amazon is at least 20 miles ahead of its closest competitor. Based on my company analysis, Amazon is about two years away from \"hockey stick\" earnings-per-share (EPS) growth that will far exceed consensus expectations. The source of my profit optimism and above-consensus growth projections are several fold, but are keyed on an expansion in operating leverage and profit margins produced by a lower rate of growth in expenses and higher top-line results. The latter will be aided by continued above-expected core retail sales gains and the anticipated success in the company's high-margin advertising initiative as well as other emerging businesses. Based on our EPS model I am more optimistic than the consensus regarding the assumptions of top- and bottom- line growth over the next five years. 2021 is the year when the largest gain relative to expectations is projected. With more than one quarter of this year already in the rear-view mirror, it is not too early to consider results out two years.\n\nReturns for Amazon Shareholders Will Likely Come in The Second Half of 2020\n\nAs noted recently, I now believe that the next six months will be a challenge to social media stocks like Amazon - that is why I reduced my holdings from very large to between small and medium several days ago.\n\n\"It is now clear that to this observer that the bull market in the larger social media stocks may be delayed, reflecting a clear inflection point in greater potential legal, legislative and regulatory disruption towards the social media companies. These changes and pressures are likely to multiply as we approach the November 2020 election - as how to deal with \"surveillance capitalism\" becomes one of the primary policy positions of the Democratic party.\"\n\nBottom Line\n\n\n\nAfter having sold a lot of stock recently (at much higher levels), I began to reestablish a larger position in the after hours yesterday (at $1637-$1640).\n\nAmazon now trades at under 20x 2020 EBITDA. The stock trades at less than half the average across the large cap tech universe (0.6x 2020E EV/EBITDA to growth compared to 1.3x the large cap average) - compelling especially in light of the prospects for future upside profit.\n\nI expect, by year-end 2020, that Amazon's shares will trade between $2,000-$2,300 as investors begin to recognize that a \"hockey stick\" acceleration in EPS and in cash flow, and a faster pace of margin expansion (as it grows into a larger infrastructure) lies ahead in 2021-22.\n\n(Amazon, Microsoft and Alphabet are holdings in Jim Cramer's Action Alerts PLUS member club. Want to be alerted before Jim Cramer buys or sells these stocks? Learn more now.)\n\n(This commentary originally appeared on Real Money Pro on October 25. Click here to learn about this dynamic market information service for active traders and to receive Doug Kass's Daily Diary and columns from Paul Price, Bret Jensen and others.)", "description": "I still expect Amazon to become the first $2.5 trillion company....AMZN", "authors": ["Doug Kass", "Kass", "Here'S The Deal With Amazon", "I Still Expect Amzn To Become The First", "Trillion Company.", "Stocks Quotes In This Article", "Eric Jhonsa", "Bruce Kamich", "James", "Rev Shark"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/ced6dbf4-d854-11e8-bc3c-3b5cf5a78902.jpg", "published_at": "2019-10-25"}