{"pub": "metro", "url": "https://metro.co.uk/2019/10/25/little-moons-launches-cookie-dough-flavoured-ice-cream-bites-10983356", "downloaded_at": "2019-10-26 00:01:43.195363+00:00", "title": "Little Moons launches cookie dough-flavoured ice cream bites", "language": "en", "text": "The new product launches on 28 October (Picture: Little Moons)\n\nIf you’ve never tried a Little Moons mochi ball, you’re in for a treat.\n\nThe company, which opened in 2010 with a mission to make the UK fall in love with the Japanese treat, has just announced that there’s a brand new product on its way.\n\nPlease welcome: cookie dough ice cream bites.\n\nIt’s the same shape as a mochi ball, but that’s where the similarities end.\n\nWhen you bite into it, you’ll get a mouthful of chocolate chip vanilla ice cream, while the coating is a cookie dough shell topped with chocolate chips.\n\nAnd you can eat your snack in peace, knowing that it doesn’t contain any artificial flavourings, colours of preservatives.\n\nThe product will launch in Tesco on 28 October, but will also be available online through Ocado.\n\nTo celebrate the new flavour, Little Moons is also hosting a cookie dough pop-up in London next month, but details are yet to be revealed.\n\nAdvertisement\n\nAdvertisement\n\n‘Little Moons has re-invented how consumers can enjoy ice cream and with our new cookie dough line, we want to take on the competition by turning conventional thinking inside out,’ said co-founder Howard Wong, who started the company with his sister Vivien.\n\n‘Why bury the star of the show inside ice cream when you can guarantee it with every bite?\n\nDon’t fancy ice cream bites and just want to eat mochi balls instead?\n\nGive the Sumatran Coconut or the Vegan Chocolate balls a go, or try the Himalayan Salt Caramel.\n\nEither way, there’s mochi to choose from (sorry).\n\nMORE: KFC is selling an 80-piece popcorn chicken bucket for less than £6\n\nMORE: Prosecco Christmas crackers are back for 2019\n\nMORE: Cadbury announces its Easter range for next year and people are confused\n\nAdvertisement Advertisement", "description": "The brand is known for its Japanese mochi balls, and is now releasing a new product: ice cream bites.", "authors": ["Almara Abgarian"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_92277744_1572021070.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-25"}