{"pub": "independent", "url": "https://independent.co.uk/life-style/fashion/ariana-grande-sue-forever-21-look-a-like-model-riley-rose-lawsuit-a9090516.html", "downloaded_at": "2019-09-03 23:41:41.658617+00:00", "title": "Ariana Grande is suing Forever 21", "language": "en", "published_at": "2019-09-03", "text": "Ariana Grande is suing Forever 21 for $10m (£8m) after the fashion retailer allegedly used her name and likeness to promote its products.\n\nIn a complaint filed in Los Angeles federal court on Monday, Grande’s lawyers accused the clothing brand and beauty company Riley Rose – which is owned by the daughters of Forever 21’s founders – of trademark infringement.\n\nThe lawsuit was launched after both companies allegedly published at least 30 unauthorised images and videos that created a false perception Grande had endorsed the brands.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nAccording to the complaint, the allegations follow the breakdown of talks with Forever 21 to create a collaborative social media campaign after the company refused to pay the proposed amount.\n\nThe document, which asserts that the market value for a single Instagram post by Grande is “well into the six figures,” says negotiations commenced in December 2018.\n\nShape Created with Sketch. H&M x Ariana Grande Show all 9 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. H&M x Ariana Grande 1/9 H&M x Ariana Grande T-shirt, £9.99, H&M 2/9 H&M x Ariana Grande T-shirt with a motif, £12.99, H&M 3/9 H&M x Ariana Grande Short printed hoodie top, £19.99, H&M 4/9 H&M x Ariana Grande Printed jersey bodysuit, £9.99, H&M 5/9 H&M x Ariana Grande Short printed hoodie top, £19.99, H&M 6/9 H&M x Ariana Grande T-shirt with a motif, £12.99, H&M 7/9 H&M x Ariana Grande Printed t-shirt, £12.99, H&M 8/9 H&M x Ariana Grande Text-print t-shirt, £9.99, H&M 9/9 H&M x Ariana Grande Boxy sweatshirt, £19.99, H&M 1/9 H&M x Ariana Grande T-shirt, £9.99, H&M 2/9 H&M x Ariana Grande T-shirt with a motif, £12.99, H&M 3/9 H&M x Ariana Grande Short printed hoodie top, £19.99, H&M 4/9 H&M x Ariana Grande Printed jersey bodysuit, £9.99, H&M 5/9 H&M x Ariana Grande Short printed hoodie top, £19.99, H&M 6/9 H&M x Ariana Grande T-shirt with a motif, £12.99, H&M 7/9 H&M x Ariana Grande Printed t-shirt, £12.99, H&M 8/9 H&M x Ariana Grande Text-print t-shirt, £9.99, H&M 9/9 H&M x Ariana Grande Boxy sweatshirt, £19.99, H&M\n\nHowever, the deal never came to fruition because “the amounts that Forever 21 offered to pay for the right to use Ms Grande’s name and likeness were insufficient for an artist of her stature”.\n\nGrande’s lawyers state that the Forever 21 and Riley Rose launched a “misleading campaign across its website and social media platforms” instead of paying for the right to the singer’s assets.\n\n“Forever 21’s and Riley Rose’s unauthorised use of Ms Grande’s name, image, likeness and music to promote their brands and products are blatant and wilful violations of her statutory and common law rights of publicity,” the complaint reads.\n\n“By this action, plaintiffs seek an award of actual damages, the disgorgement of Forever 21’s ill-gotten profits, and an award of punitive damages to deter Forever 21 and Riley Rose from future violations of Plaintiff’s personal and intellectual property rights”.\n\nThe complaint included a number of cases where Grande’s lawyers suggested Forever 21 had misappropriated the singer’s name, image and likeness.\n\nExamples included Instagram posts that used a “look-alike model” who was dressed in clothes and accessories resembling those worn by Grande in her music videos, and the use of lyrics from Grande’s song \"7 Rings\" in the caption.\n\nOn Tuesday, the United States District Court Central District of California confirmed to The Independent that a judge has not yet been assigned to Grande’s case.\n\nThe Independent has contacted Forever 21 for comment.", "description": "Ariana Grande is suing Forever 21 for $10m (£8m) after the fashion retailer allegedly used her name and likeness to promote its products.", "authors": ["Sarah Young"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/07/29/16/gettyimages-1078371026-2.jpg"}