{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7598813/What-REALLY-fund-buy-bottled-water-charity-Thankyou.html", "downloaded_at": "2019-10-22 13:38:31.914481+00:00", "title": "What you REALLY fund when you buy bottled water from charity Thankyou", "language": "en", "text": "A charity which claims to give all of its profits to 'ending poverty' keeps millions in the bank while spending big on staff wages and entertainment.\n\nThe social enterprise Thankyou, set up in Melbourne in 2008, sells bottled water, personal care and baby care products at premium prices to raise money for charity.\n\nIt is owned by Thankyou Charitable Trust which receives its profits in quarterly dividends and passes the money on to other charities.\n\n\n\nThe social enterprise Thankyou, set up in Melbourne in 2008, sells 1.5L bottles of water for $2 and hand wash for $7.99\n\nThe website says: 'We commit 100% of Thankyou's profits to ending extreme poverty'.\n\nBut financial documents seen by news.com.au reveal that over the past four years, Thankyou gave only of 67 per cent of its profits to the charity.\n\nThe rest it held in the bank to be invested back into the business at a later date - a normal practice of commercial companies.\n\nIn the 2017/18 financial year it paid out around $698,000 in dividends, only 48 per cent of its near $1.4million profit.\n\nIn the same period, it spent $4.56million on employing its 47 staff including wages, super, payroll tax and other expenses.\n\nThe enterprise also spent $580,000 on 'travel and entertainment' which included flying employees overseas to meet suppliers.\n\nThere was also a hefty $820,000 bill for 'office expenses' for the headquarters on the fourth floor of a building in Collingwood, Melbourne.\n\nA spokeswoman for the company admitted to news.com that not all of its profits were paid to the charity in dividends and that some were held 'for good financial stewardship'.\n\nThe enterprise spent $580,000 on 'travel and entertainment' which included flying employees overseas to meet suppliers (stock image; not actual employees)\n\nBut she insisted that all funds would eventually go to charity.\n\n'All funds are ultimately committed to the charitable purposes of Thankyou, which is to help end global poverty,' she told news.com.au.\n\n'If Thankyou entities were to be wound up, anything surplus would go straight through to the Charitable Trust.'\n\nShe said the high wage bill was justified because it had to compete with big consumer brands - and that it tried to keep travel expenses to a minimum.\n\n'All funds are ultimately committed to the charitable purposes of Thankyou, which is to help end global poverty. If Thankyou entities were to be wound up, anything surplus would go straight through to the Charitable Trust.\n\nLast year the enterprise spent $4.56million on employing its 47 staff including wages, super, payroll tax and other expenses (stock image; not actual employees)\n\n'The distribution was lower in 2018 given challenges the business faced when it launched into the New Zealand market whilst managing the existing category expansion and aggressive competitor activity.'\n\nShe went on to say that profit was held back to 'remain solvent and ensure working capital for things like purchasing inventory and all other standard business costs'.\n\n'One of the challenges with our very low retained earnings is we are going against bigger FMCG (fast-moving consumer goods) competitors who have very deep pockets.\n\n'This is a challenge we’ve had to manage throughout the Thankyou journey. If the business were to ever cease operations everything would go to the Charitable Trust.'\n\nDaily Mail has contacted Thankyou for further comment.", "description": "The social enterprise Thankyou, set up in Melbourne in 2008, sells bottled water, personal care and baby care products to raise money for charity.", "authors": ["Charlie Moore For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/04/20018336-0-image-a-49_1571715849753.jpg", "published_at": "2019-10-22"}