{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7600073/Chanelle-Hayes-displays-results-weight-loss-shares-progress-photos.html", "downloaded_at": "2019-10-22 13:53:26.317182+00:00", "title": "Chanelle Hayes displays the results of her weight loss as she shares progress photos", "language": "en", "text": "Earlier this year she overhauled her fitness and diet routine.\n\nAnd Chanelle Hayes showed off the results of her weight loss as she shared a collection of motivational progress photos on Tuesday.\n\nThe Big Brother star, 31, took to her Instagram to show off her slimmed-down frame in a pair of old shorts, which are now too big for her.\n\nWeight loss: Chanelle Hayes showed off the results of her weight loss as she shared a collection of motivational progress photos on Tuesday (pictured at her current weight)\n\nStanding in front of a mirror, Chanelle was able to pull away the gaping item of clothing as she showed off her results of her weight loss.\n\nShe teamed the shorts with a blue swimsuit layered with a black vest top which displayed her slimmed-down frame.\n\nAlongside the post, the reality star shared two throwback pictures of herself wearing the shorts when they used to fit her perfectly.\n\nOne snap showed Chanelle in the item of clothing while holding her two-year-old son Frankie while a different snap saw her running errands with a friend in the shorts.\n\nBefore: The Big Brother star, 31, shared a throwback picture of herself wearing the shorts when they used to fit her perfectly (pictured holding her two-year-old son Frankie)\n\nProgress: Chanelle took to her Instagram to show off her slimmed-down frame in a pair of old shorts, which are now too big for her (pictured, left, and before, right)\n\nFeeling motivated, the mother-of-two captioned the montage: '#MondayMotivation swipe for before and after in same pair of shorts... Before and During. Yet to reach the After. A lot has changed in a year.\n\n'I’m still not at my healthiest size or weight but these pictures have shown me I am making amazing progress and that I can do it. Slow and steady wins the race.'\n\nShe added the hashtags: '#instaweightloss #weightloss #weightlosstransformation #healthylifestyle #beforeandafter #plussize #instagood.'\n\nChanelle, who first shot to fame in 2007 as a feisty 19-year-old contestant on Big Brother, was inundated with praise from her fans and followers as they flocked to the comments section to applaud her.\n\n'Slow and steady wins the race': Feeling motivated, the mother-of-two captioned the montage as she unveiled her progress\n\nFame: She rose to fame on the 2007 series of Big Brother, she was just 19 (pictured in 2007)\n\nOne person said: 'Omg u look amazing and you have worked so hard you have done this the healthy way xxx.'\n\nA different user put: 'Love posts like these. You work so hard. Well done☺️.'\n\nAnother follower commented: 'A massive well done to you. I need some motivation, can I pinch some of yours please.x.'\n\nWhile a different account added: I know how hard it is fitting in exercise and finding motivation with one sprog, let alone two - so hats off to you, really well done! You look amazing.'\n\nIn May, Chanelle revealed that she had lost more than three stone and gone down to a size 12 for the first time in three years.\n\nTransformed: In May, Chanelle revealed that she had lost more than three stone and gone down to a size 12 for the first time in three years (pictured)\n\nShe happily shared a snap of herself in her skinny jeans, where she detailed how confident she felt after shedding enough weight to slip back into them.\n\nShe penned: 'THIS IS OFFICIALLY THE SMALLEST I HAVE BEEN SINCE SUMMER 2016!!\n\n'So in November for my birthday I wore a size 18-20 jumpsuit and hated it, felt like [poo emoji]. I’ve put in a lot of effort and hard work and I can now fit into my size 12s.\n\n'DON’T GET ME WRONG- these jeans are nice and stretchy lol. But my belt is on the smallest hole and could do with being a bit tighter...\n\n'I have no overhang and I feel confident. I have lots of other 12s that still don’t fit yet, but the fact that these do is helping me keep going until I get where I want to be.'\n\nBefore and after: Sharing a before and after photo, she said: 'November 2018 vs May 2019 Size 18-20 outfit vs size 12 outfit 15st 6lbs vs 11st 13lbs 84 RHR vs 54 RHR.'\n\nLater that month she revealed yet another before and after photo of herself in a black jumpsuit, she said: 'November 2018 vs May 2019 Size 18-20 outfit vs size 12 outfit 15st 6lbs vs 11st 13lbs 84 RHR vs 54 RHR.'\n\nYet in August Chanelle revealed that she had gone up a dress size to a 14 after six weeks of bad eating during a holiday.\n\nSharing a make-up free and sun-kissed selfie of herself, she candidly said: 'I have had a really bad 6 weeks diet and nutrition wise. Totally fallen off the bandwagon and have gone from the size 12 I got down to back up to a 14.\n\n'I can also tell in myself that I feel softer and have lost definition which is such a shame.\n\n'When I am home I need to get back on it big time as I can feel with every pound gained, a little confidence has been lost.\n\nStunning: The star is mother to Blakely, nine, with footballer Matthew Bates, and two-year-old son Frankie with ex boyfriend Ryan Oates, and she admits she battles staying in shape with motherhood (pictured over the summer)\n\n'It’s a marathon not a sprint so I’m not being hard on myself, just ready to get back to how well I was doing and focusing back on my health.'\n\nThe star is mother to Blakely, nine, with footballer Matthew Bates, and two-year-old son Frankie, with ex boyfriend Ryan Oates, and she admits she battles staying in shape with motherhood.\n\nBack in January, Chanelle broke down in tears as she discussed her yo-yoing weight on This Morning and spoke about the detrimental impact trolls have on her.\n\nThe star admitted other women such as Cheryl lost weight with heartbreak, but she goes the other way.", "description": "The Big Brother star, 31, took to her Instagram to show off her slimmed-down frame in a pair of old shorts, which are now too big for her.", "authors": ["Olivia Wheeler For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/12/20031808-0-image-a-28_1571742515143.jpg", "published_at": "2019-10-22"}