{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/strictly-come-dancings-david-james-20660910", "downloaded_at": "2019-10-20 23:25:45.364826+00:00", "title": "and gives heartfelt message to Will Bayley", "language": "en", "text": "Get the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nDavid James has become the fourth celebrity to leave Strictly Come Dancing 2019.\n\nThe former footballer and his professional partner Nadiya Bychkova were sent home in a unanimous decision by the judges.\n\nAfter discovering his fate, David gave a heartfelt message to fellow celeb Will Bayley, who reduced half the judges and most of the audiences to tears with his moving routine.\n\nThe pair found themselves at the bottom of the leaderboard after failing to impress with their Jive to 'Such a Night' by Michael Bublé on Saturday night.\n\nThey lost out to BBC Breakfast star Mike Bushell and his partner Katya Jones, who gave a stronger performance in the dreaded dance-off.\n\n(Image: BBC/Guy Levy)\n\n(Image: BBC/Guy Levy)\n\nWhen asked by presenter Tess Daly about his time on the show, David confessed he felt he had let Nadiya down.\n\nThe football pundit said: \"Oh I’ve loved it. I feel so bad I’ve let Nadiya down in a sense. I’ve enjoyed it but I’ve put some weight on though.\"\n\nSending out an emotional message to his co-stars while discussing his highlights, David added: \"Having the best partner and the guys up there. Everyone’s lovely.\n\n\"Just a word to Will: I think I work hard, but, man, that guy puts a shift in.\"\n\n(Image: BBC/Guy Levy)\n\n(Image: BBC)\n\nThis came after the Paralympic gold medalist, who was born with Arthrogryposis Multiplex Congenita or AMC (curvature of the limbs), left almost everyone in the studio in tears with his moving performance.\n\nPraising her partner, Nadiya said: \"He’s done so well. I’m so proud of you.\n\n\"From the first day he couldn’t lift his elbows up or stand straight and now he’s delivered such an amazing jive. I’m so proud.\"\n\n(Image: PA)\n\n(Image: PA)\n\nCraig Revel Horwood admitted that neither of the couples were technically sound but decided to save Mike.\n\nHe said: \"Well for me both couples were pretty much technically equal but the couple who I’d like to save were the most confident performers and that was Mike And Katya.\"\n\nMotsi Mabuse, who also chose to save Mike, said: \"Well I felt that one couple gave me a better performance than I saw the first time so I’m going to save Mike and Katya.”\n\n(Image: BBC/Guy Levy)\n\nSpecial guest judge Alfonso Ribeiro, who was standing in for Bruno Tonioli, put the final nail in the coffin.\n\nThe Fresh Prince Of Bel Air star said: \"The couple who I’m going to save put on a great show. The technique wasn’t there but they came out and delivered a showstopper for the audience to love so I’m going to save Mike And Katya.\"\n\nHead judge Shirley Ballas agreed with her fellow judges and revealed she would have also chosen to save Mike and Katya.\n\n*Strictly Come Dancing air Saturdays and Sundays on BBC One", "description": "Former footballer David James and his professional partner Nadiya Bychkova were sent home after a tense dance-off", "authors": ["Kyle O'Sullivan", "Image", "Bbc Guy Levy", "Bbc", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20660875.ece/ALTERNATES/s1200/0_EMB-19102263-high_res-strictly-come-dancing-2019.jpg", "published_at": "2019-10-20"}