{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/its-now-easier-to-create-ships-in-eve-online", "downloaded_at": "2019-09-29 00:21:57.791256+00:00", "title": "It's Now Easier To Create Ships In EVE Online", "language": "en", "text": "Practically every new EVE Online player is confused by the game’s user interface, endless menus and difficult systems. During a recent player conference, developer CCP pointed out that the new player retention rate is abysmally low, with almost 90 per cent of new players quitting within the first seven days.\n\nOne of the main goals of the current era of EVE is to make the game easier and more streamlined for new players. The community ship fittings system, released with the game’s most recent update, is an attempt to do just that.\n\nBefore undocking one of EVE’s hundreds of unique spaceships from the space station housing it, you have to fit it. Each ship has between 12 and 35 different “equipment” slots, broken down into four separate categories into which you can fit hundreds if not thousands of different modules, all offering different offensive, defensive and utilitarian bonuses.\n\nThe process of fitting ships can be daunting even to EVE veterans. Getting a ship perfectly optimised can take hours, and many players use third-party programs to make the process easier.\n\nThe new Community Fittings tool is an attempt to help players make more effective ships faster.\n\nLast October, players were invited to share their favourite fittings for five different ships: The four basic exploration vessels and the most basic mining vessel. These ships were chosen because they open the door to some of the most effective and easy ways for new players to earn money in EVE.\n\nSimulated Fitting Window - Heron\n\nAfter the fits were collected, compared and analysed by CCP, the 10 best (two for each chosen hull) were added to the in-game fitting window under a new section, called “community fittings”. Players can navigate to this new page in the UI, select the ship they want to fly, and use the fitting window as a guide to properly equip their ships.\n\nOver the years, player-run corporations have seen that taking a lot of the guesswork, research and stress out of the early days of a player’s EVE career can help those players stick around the game and skip straight to the fun.\n\nAccording to CCP, the community fitting program will continue to expand beyond early exploration vessels. Forum threads have already been made to gather example fittings for entry level PvP focused vessels. The system will also soon expand to larger PvE focused ships, to assist players in navigating one of EVE’s galaxy-spanning epic arcs.\n\nAny player with an active EVE Online account can submit a community fitting suggestion to the appropriate forum thread. If their submission is chosen by the game developers and selected player volunteers, the fitting will carry their name inside of its tooltip as a thank you for contributing to the game.\n\nThe community fittings feature is very much in its infancy. Hopefully, in the coming months, it will become a tool that players can use to overcome EVE’s infamously steep learning curve.", "description": "Practically every new EVE Online player is confused by the game’s user interface, endless menus and difficult systems. During a recent player conference, developer CCP pointed out that the new player retention rate is abysmally low, with almost 90 per cent of new players quitting within the first seven days.  One of...", "authors": ["Jackson Ryan", "Alex Walker"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/fdg885mqld3qocxnlcx6.jpg", "published_at": "2019-09-29"}