{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7575287/Beverly-Sackler-one-owners-Purdue-Pharma-dies-aged-94.html", "downloaded_at": "2019-10-15 15:19:47.099083+00:00", "title": "Beverly Sackler, one of the owners of Purdue Pharma, dies aged 94", "language": "en", "text": "Beverly Sackler (pictured), one of the owners of OxyContin maker Purdue Pharma, has died. She was 94 years old\n\nBeverly Sackler, one of the owners of OxyContin maker Purdue Pharma, has died. She was 94 years old.\n\nAccording to a filing made by her lawyers in US Bankruptcy Court, Beverly died on Monday.\n\nShe was the widow of Raymond Sackler, one of the brothers who bought the drug company Purdue Frederick in 1952.\n\nThe company later became Purdue Pharma. Beverly, who lived in Connecticut, was on its board for decades.\n\nNo details surrounding her death were in the court filing. Phone calls seeking comment were made to a lawyer and a family spokesman.\n\nBeverly's death comes amid the nearly 2,700 lawsuits that have been filed against the family.\n\nThe Sacklers and their company Purdue Pharma have been blamed for helping spark the opioid crisis that has killed more than 400,000 people in the US in the last two decades.\n\nPurdue has proposed to settle them in a deal that would require the family to give up company ownership and pay at least $3billion.\n\nLast month, Purdue Pharma, filed for bankruptcy as part of an effort to settle some of the lawsuits.\n\nAnd just last week, US Bankruptcy Judge Robert Drain agreed to pause the lawsuits against Purdue Pharma and the Sackler's until next month with the intention of stopping suits longer so a settlement can be worked out.\n\nDrain gave the company, state attorneys general and lawyers for local government until November 6 to work out the details of a six-month pause on the litigation.\n\nBeverly was the widow of Raymond Sackler (left), one of the brothers who bought the drug company Purdue Frederick in 1952\n\nPurdue Pharma was founded by brothers (L to R) Mortimer, Raymond and Arthur Sackler\n\nThe Sacklers and their company Purdue Pharma have been blamed for helping spark the opioid crisis that has killed more than 400,000 people in the US in the last two decades. Protesters are seen outside the company's headquarters in Stamford, Connecticut\n\nThe groups are supposed to work out how to share detailed financial information and other wrinkles that could allow them to work toward a bigger settlement.\n\nDrain strongly brushed aside the argument from a group of state attorneys general that lawsuits against members of the wealthy Sackler family would be essential to getting accountability in the case.\n\nIn exchange for the paused litigation, Purdue Pharma agreed to advance $200million to battle the opioid crisis within the six-month period.\n\nThe Sacklers have expressed sympathy but refuse to take responsibility for the nation's opioid epidemic.\n\nThe lawsuits assert that the company aggressively sold OxyContin as a drug with a low risk of addiction despite knowing that wasn't true.\n\nSince OxyContin, a time-released opioid, was introduced in 1996, addiction and overdoses have surged.\n\nIn both 2017 and 2018, opioids were involved in more than 47,000 deaths, according to the US Centers for Disease Control and Prevention.\n\nIn recent years, there have been more deaths involving illicit opioids, including heroin and fentanyl, than the prescription forms of the drugs.\n\nThat change has happened as awareness of the dangers of prescription opioids has increased and prescribers have become more cautious.\n\nPurdue's drugs are just a slice of the opioids prescribed, but critics assign a lot of the blame to the company because it developed both the drug and an aggressive marketing strategy.\n\nPurdue Pharma, OxyContin's manufacturer, flied for Chapter 11 bankruptcy protection last month. In addition to seeking a pause in widespread litigation against it, Purdue also asked Judge Robert Drain to shield the wealthy Sacklers from related opioid lawsuits they face\n\nThe Sacklers have expressed sympathy but refuse to take responsibility for the nation's opioid epidemic. Pictured is the Purdue Pharma headquarters in Stamford, Connecticut\n\nBrothers Mortimer, Raymond and Arthur Sackler - all physicians - bought the drug company known as Purdue Frederick in 1952.\n\nThey are all dead, but the widows, children and grandchildren of Mortimer and Raymond own the company, along with an international drug company, Mundipharma.\n\nIn 2016, Forbes magazine listed the Sacklers as one of the 20 wealthiest families in the US and tallied their holdings at $13billion.\n\nFor decades, the family members have been major philanthropic donors.\n\nIn the 1970s, they underwrote the Metropolitan Museum of Art wing that houses an ancient Egyptian temple and bears the Sackler name.\n\nThis year, institutions including the Met, Britain's Tate museums, New York's Guggenheim and Tufts University, where the graduate school of biomedical sciences also bears the family's name, have announced they will stop taking gifts from the family or re-evaluate the relationship.\n\nThe Louvre Museum in Paris took the Sackler name off a wing.\n\nIn legal filings, states have contended that the heirs of Mortimer and Raymond Sackler have accepted payments of at least $4billion over the last dozen years.\n\nArizona's attorney general has asked the US Supreme Court to force the family to return some money to Purdue so it could be fair game in lawsuits against the company.\n\nNew York's attorney general has requested financial records of entities connected to the family to try to trace the money.\n\nHer office said in a legal filing this month that it found $1 billion transferred to the family through Swiss banks and other secret accounts.", "description": "Beverly Sackler (right), one of the owners of Purdue Pharma, died Monday at the age of 94. Beverly's death comes amid the nearly 2,700 lawsuits that have been filed against the Sacklers.", "authors": ["Valerie Edwards For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/14/19742670-0-image-a-20_1571146628903.jpg", "published_at": "2019-10-15"}