{"pub": "npr", "url": "https://npr.org/2019/09/12/760197676/ntsb-releases-report-on-fatal-boat-fire-in-california", "downloaded_at": "2019-09-13 00:57:27.760943+00:00", "published_at": "2019-09-12", "title": "NTSB Releases Report On Fatal Boat Fire In California", "language": "en", "text": "NTSB Releases Report On Fatal Boat Fire In California\n\nEnlarge this image toggle caption Christian Monterrosa/AP Christian Monterrosa/AP\n\nThe National Transportation Safety Board has released a preliminary report on the boat fire which killed 34 people earlier this month off the coast of Santa Cruz island in California. The report confirms that all crewmembers were asleep when the boat caught fire.\n\nThe 75-foot Conception was owned by Truth Aquatics, Inc., and was on a three-day diving trip when it caught fire at anchor early in the morning on Sept. 2.\n\n\"Five crewmembers were asleep in berths behind the wheelhouse, and one crewmember was asleep in the bunkroom,\" at the time of the fire, according to initial findings. If true, that would be a violation of regulations requiring one crewmember to be awake to monitor the vessel throughout the night.\n\nLisa Novak, public affairs officer for the U.S. Coast Guard, said in an email to NPR that \"according to its certificate of inspection, the passenger vessel Conception was required to have a roving watch.\"\n\nTruth Aquatics, Inc., declined to comment on the NTSB's findings.\n\nAccording to the report, all of the passengers and one of the crew were asleep below deck, where they became trapped by the flames. Crewmembers above deck say they were unable to reach them because a ladder to the sleeping area was engulfed with fire. The victims include 21 women and 13 men, ranging in age from 16 to 62 years old, and officials suspect all died of smoke inhalation.\n\nInvestigators will be looking at key issues including whether passengers had been informed of safety procedures on board. They will also be looking carefully at an escape hatch which was to have provided an alternative route out of the sleeping area.\n\nNPR's Kirk Siegler reported that a source who pilots charter boats in the same area said Truth Aquatics enjoyed a \"longstanding reputation.\" The Coast Guard also said that the dive company had passed its federal inspection and\n\nThe Coast Guard backed that up, saying it's passed its federal inspection.\n\nNTSB spokesman Eric Weiss says investigators are looking at \"all ignition sources\" as they try to find the source of the blaze in the wooden-hulled boat. According to the report, interviews with crewmembers indicate there were no mechanical or electrical issues reported on the boat that could have caused a fire.\n\nWeiss says the NTSB is also looking at what crewmembers were doing when the fire broke out, whether a crewmember was assigned to keep watch over the boat, and if so, what was their level of training.\n\nOn Thursday the Coast Guard issued safety recommendations which include limiting the unsupervised charging of lithium-ion batteries, and reducing potential hazards from the use of power strips and extension cords.\n\nNovak says, \"The Coast Guard Investigative Service, the Federal Bureau of Investigation, and the Bureau of Alcohol, Tobacco, Firearms and Explosives are supporting the U.S. Department of Justice's investigation and will work in close coordination with the U.S. Attorney's Office.\"\n\nWeiss says the NTSB will include the findings of its investigation in a final report. He says that report will take more than a year to complete.", "description": "The preliminary findings indicate that all crewmembers were asleep when the fire broke out. The blaze trapped passengers below deck, where they died of smoke inhalation, officials say.", "authors": ["Shannon Van Sant"], "top_image": "https://media.npr.org/assets/img/2019/09/12/ap_19251655828839-1-_wide-b9ce9aa827b44573a1fecbe8821308538f425b0a.jpg?s=1400"}