{"pub": "realclearpolitics", "url": "https://thenation.com/article/warren-endorsement-wfp", "downloaded_at": "2019-09-18 05:08:58.709739+00:00", "title": "WFP’s Nod to Warren Reminds Progressives of the Inevitable Need to Choose", "language": "en", "text": "Ready to fight back? Sign up for Take Action Now and get three actions in your inbox every week. You will receive occasional promotional offers for programs that support The Nation’s journalism. You can read our Privacy Policy here. Sign up for Take Action Now and get three actions in your inbox every week.\n\nThank you for signing up. For more from The Nation, check out our latest issue\n\nSubscribe now for as little as $2 a month!\n\nSupport Progressive Journalism The Nation is reader supported: Chip in $10 or more to help us continue to write about the issues that matter. The Nation is reader supported: Chip in $10 or more to help us continue to write about the issues that matter.\n\nFight Back! Sign up for Take Action Now and we’ll send you three meaningful actions you can take each week. You will receive occasional promotional offers for programs that support The Nation’s journalism. You can read our Privacy Policy here. Sign up for Take Action Now and we’ll send you three meaningful actions you can take each week.\n\nThank you for signing up. For more from The Nation, check out our latest issue\n\nTravel With The Nation Be the first to hear about Nation Travels destinations, and explore the world with kindred spirits. Be the first to hear about Nation Travels destinations, and explore the world with kindred spirits.\n\nSign up for our Wine Club today. Did you know you can support The Nation by drinking wine?\n\nEven before the Working Families Party endorsed Elizabeth Warren, the labor-left organization that advocates for a more progressive Democratic politics had endorsed Elizabeth Warren. While the WFP’s decision to back the senator from Massachusetts for the 2020 Democratic presidential nomination drew lots of attention Monday, the group first endorsed Warren in February 2015, when it called on the senator—as “the nation’s most powerful voice for working families”—to challenge front-runner Hillary Clinton for the party’s 2016 nomination. Warren chose not run, and Vermont Senator Bernie Sanders stepped up. The WFP eventually backed his bid, with a December 2015 announcement from party leadership that “we’re standing with Bernie Sanders to build the political revolution and make our nation into one where every family can thrive.” Ad Policy\n\nNow the WFP is again with Warren. That’s significant, as is the fact that it isn’t with Sanders. Significant is not necessarily the same as definitional, however. Many friends and allies of the WFP were still speaking up for the senator from Vermont after the announcement Monday that the senator from Massachusetts had prevailed in endorsement balloting in which 50 percent of the vote was cast by WFP members and grassroots supporters and 50 percent by the WFP national committee.\n\nThe WFP’s decision to endorse distinguished it from the majority of progressive groups and unions, which are waiting to make choices between Warren and Sanders, and the several other contenders who lay claim to the progressive mantle in 2020. (New Jersey Senator Cory Booker, former secretary of housing and urban development Julian Castro, and New York Mayor Bill de Blasio were also in the running for the WFP nod.) There have been few major endorsements so far even from the left-leaning labor, environmental, and activist groups that in 2015 first cheered on a “Draft Warren” movement and then backed Sanders—although the Vermonter has gained endorsements from Democratic Socialists of America, Progressive Democrats of America and, more recently, the United Electrical, Radio and Machine Workers of America union. MORE FROM John Nichols Mad About Kavanaugh? Impeach Him September 16, 2019 Of Course It’s an Impeachment Inquiry September 13, 2019 Jorge Ramos Was the Best Debate Moderator Yet September 13, 2019 Author page\n\nOn Monday, Warren campaign aides expressed hope that the WFP move might break loose additional endorsements—especially among the national and local labor organizations that have worked closely with the party in New York, Philadelphia, Milwaukee, and other communities across the country. Sanders backers expressed doubts that this would happen. They also pointed out that while Sanders once declared that “the WFP is the closest thing there is to a political party that believes in my vision of democratic socialism,” the party’s endorsements of New York Governor Andrew Cuomo over Democratic primary rival Zephyr Teachout in 2014 and of New York Representative Joe Crowley against challenger Alexandria Ocasio-Cortez in a 2018 primary had drawn criticism from progressives. (Notably, the party backed Cynthia Nixon’s 2018 from-the-left challenge to Cuomo, and earned high marks for throwing in early with the 2019 campaign of Tiffany Caban for Queens district attorney.)\n\nThe WFP vote illustrated the challenges that arise when two favorites of progressives are running against one another. Sanders won almost 90 percent of the vote against Clinton in the WFP endorsement vote four years ago. This time the WFP announced that—”after a three-month endorsement process in which tens of thousands participated in debate and discussion, online forums, house parties, and live Q&As with five contenders for the Democratic nomination…. The two highest vote-getters were Senator Warren with 60.91% of the vote, and 35.82% for U.S. Sen. Bernie Sanders. More than 80% of voters listed Warren and Sanders as their top two picks.”\n\nThat was good news for Warren on several levels. The endorsement drew lots of attention from media outlets that barely covered the WFP’s 2015 decision. Beyond the media coverage of the endorsement itself was the fact that it came at a moment when many progressives are starting to talk about when they will have to make choices between two senators whose combined poll support consistently tops that attained by former vice president Joe Biden.\n\nWFP national director Maurice Mitchell argues that the time is now. He couched this assessment in the kindest terms, speaking about “the tough choice progressives face this year,” noting that the WFP still considers Sanders “a crucial ally in the fight for a more just world” and expressing hope that Warren and Sanders will continue to align during the primary campaign as “a formidable duo on the campaign trail, organizing voters behind full-throated progressive messages.” Current Issue View our current issue\n\n“But in the end,” Mitchell said, “we believe this campaign is too important to sit on the sidelines.”\n\nJoe Dinkin, the national campaign director for the party that started in New York but now organizes and campaigns in more than a dozen states nationwide, echoed that theme. “The right-wing is organized and they’re working for their candidate Donald Trump,” said Dinkin. “The corporate wing of the Democratic Party is working for their candidate: Joe Biden. And we just could not sit on the sidelines. We have to start organizing to make sure that the Democrats nominate and elect a progressive candidate.”\n\nWarren posted a video of herself throwing her hands up in celebration after the endorsement was announced. She also headed for a Monday evening rally that drew thousands to Washington Square Park in New York City—the urban base from which the union-aligned WFP began working more than two decades ago on an inside-outside strategy to move the Democratic Party to the left on economic, social, and racial justice issues. Her campaign left little doubt that it would make everything it could of the endorsement from a prominent progressive group.\n\nBut plenty of WFP allies responded to the endorsement of Warren with kind words and shows of solidarity for Sanders. “Although I’m proud of my work with @WFP, I still believe @BernieSanders is the best choice for working families because of his stance on CJR, M4A, Economic Justice and #NoMiddleGround,” tweeted Milwaukee County (WI) Supervisor Marcelia Nicholson.\n\n“I love all that the @WorkingFamilies does,” declared Randy Bryce, a Wisconsin labor activist and 2018 congressional candidate who ran with early and enthusiastic support from WFP. “I just have to add as a longtime Bernie Sanders supporter that up to this point he has been the most pro-labor candidate that we have.” Jacobin founder Bhaskar Sunkara observed, “The [WFP] has changed New York politics fundamentally and for the better but their decision to endorse Warren is baffling. Bernie is the national manifestation of the WFP’s politics. The fact that the WFP doesn’t recognize that reflects how much it has strayed.”\n\nSunkara argued that the WFP should release breakdowns of the voting among grassroots members and supporters—who many Sanders backers believe to be more sympathetic to their candidate than the leaders of WFP-aligned groups who serve on the national committee. “It may not reveal a plurality for Sanders,” suggested Sunkara, “but it definitely shows a divided base.” WFP leaders said they would not release the breakdowns.\n\nWith an eye toward competing for votes from folks who have been engaged with the WFP in New York and other states over the years, the Sanders campaign struck a reconciling note. Instead of complaining, they sent a statement to The Nation from campaign manager Faiz Shakir that read, “The Bernie Sanders campaign is built from the support of millions of working people across the country, with our leading donors being Walmart workers, teachers, and nurses. We look forward to working with the Working Families Party and other allies to defeat Donald Trump. Together, we’ll build a movement across the country to transform our economy to finally work for the working class of this country.”", "description": "A lot of progressive groups (and voters) have held off on making the Sanders-vs.-Warren choice. But they’ll face more and more pressure to decide how best to block Biden.", "authors": ["John Nichols", "September", "Tina Vasquez", "Spencer Green", "Sasha Abramsky", "Tom Tomorrow", "The Nation", "Mychal Denzel Smith"], "top_image": "https://www.thenation.com/wp-content/uploads/2019/09/warren_wsp_img.jpg", "published_at": "2019-09-17"}