{"pub": "nationalreview", "url": "https://nationalreview.com/news/sondland-to-testify-that-trump-wanted-ukraine-to-investigate-bidens-2016-election", "downloaded_at": "2019-10-18 01:03:10.885043+00:00", "title": "President Trump -- Gordon Sondland to Testify that Trump Wanted Ukraine to Investigate Bidens, Election", "language": "en", "text": "U.S. Ambassador to the EU Gordon Sondland poses in Brussels, Belgium, June 4, 2019. (Francois Lenoir/Reuters)\n\nU.S. Ambassador to the European Union Gordon Sondland is expected to break from President Trump in his testimony to Congress on Thursday and tell lawmakers that according to Trump lawyer Rudy Giuliani, the president wanted Ukraine to investigate both the 2016 election and the Ukrainian gas company tied to Joe Biden’s son, Hunter.\n\nGiuliani reportedly told diplomats, including Sondland, that a Ukrainian corruption investigation into the natural-gas company Burisma, on whose board the younger Biden once sat, was an issue “of importance for the president.”\n\nDuring a July 25 phone call with Ukraine’s president, Volodymyr Zelensky, Trump asked Zelensky to help his administration investigate allegations that Joe Biden used his position as vice president to help Burisma Holdings avoid a corruption probe soon after Hunter Biden was appointed to its board of directors. The phone call led to an Intelligence Community whistleblower complaint that ultimately sparked a formal impeachment inquiry into Trump’s actions.\n\nSondland, a millionaire hotel owner and major Trump donor, has become a closely watched figure in the impeachment probe because of his heavy involvement in diplomacy with Ukraine.\n\n“My understanding was that the president directed Mr. Giuliani’s participation, that Mr. Giuliani was expressing the concerns of the president,” Sondland will tell lawmakers, according to his prepared remarks, which were leaked just as he began testifying behind closed doors before the House committees conducting the impeachment inquiry.\n\n“We were also disappointed by the president’s direction that we involve Mr. Giuliani,” Sondland will say. “Based on the President’s direction, we were faced with a choice: We could abandon the goal of a White House meeting for President Zelensky, which we all believed was crucial to strengthening U.S.-Ukrainian ties and furthering long-held U.S. foreign policy goals in the region; or we could do as President Trump directed and talk to Mr. Giuliani to address the President’s concerns.”\n\n“I did not understand, until much later, that Mr. Giuliani’s agenda might have also included an effort to prompt the Ukrainians to investigate Vice President Biden or his son or to involve Ukrainians, directly or indirectly, in the president’s 2020 re-election campaign,” Sondland plans to say.\n\nZelensky has since said that “nobody pushed me” regarding the investigation, and Trump has claimed the same.\n\nBiden, for his part, has admitted that in the spring of 2016, during his tenure as vice president, he called on Ukraine to fire the top prosecutor investigating the energy company paying his son, though he has denied that there was anything improper in his actions. Biden suggested he would withhold $1 billion in U.S. aid to Ukraine if the country did not fire the prosecutor, who was accused by the State Department and U.S. allies in Europe of being soft on corruption.", "description": "U.S. Ambassador to the European Union Gordon Sondland is expected to break from President Trump in his testimony to Congress on Thursday.", "authors": ["Mairead Mcardle", "Jim Geraghty", "Kevin D. Williamson", "John Mccormack", "Victor Davis Hanson", "Katherine Timpf", "David French", "Kyle Smith", "Read More", "The American Conservative"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/Gordon-Sondland.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-17"}