{"pub": "politico", "url": "https://politico.eu/article/6-takeaways-from-frans-timmermans-hearing", "downloaded_at": "2019-10-09 07:02:42.695333+00:00", "title": "6 takeaways from Frans Timmermans’ hearing", "language": "en", "text": "Timmermans never looked in danger during his hearing Tuesday with the European Parliament’s environment, energy and transport committees | Michael Owens/Getty Images for Freuds 6 takeaways from Frans Timmermans’ hearing The Dutchman is set to get the backing of MEPs.\n\nFrans Timmermans is set to become the European Commission’s new climate chief, after an easy hearing before the European Parliament where he laid out his ideas for bringing the European Green Deal policy to life.\n\nTimmermans — the Socialists and Democrats’ most senior politician in the new Commission lineup — never looked in danger during his three-hour hearing Tuesday evening with the European Parliament’s environment, energy and transport committees.\n\nParty coordinators will meet Wednesday to give him the nod.\n\n“We will support him, but carefully monitor him for what he will deliver,” said Peter Liese, coordinator of the center-right European People’s Party.\n\n“He is the right man” for the job, said Green MEP Bas Eickhout.\n\nHere are six takeaways from the hearing.\n\n1. Deep emissions cuts by 2030\n\nTimmermans wants to raise the bloc’s emissions cutting target to at least 55 percent by 2030 from the current 40 percent, and wants scientific ammunition to persuade reluctant governments.\n\nThe Commission is planning to assess the impacts of raising the target, and Timmermans said: “I personally would be extremely surprised if the outcome of this would lead to any other conclusions than at least 55 percent by 2030 … but let’s do the research on that.”\n\nA multi-country alliance already supports 55 percent, but many Central and Eastern European countries worry that doing so carries enormous costs. Timmermans acknowledged that moving to 55 percent means “asking for some really tough extra measures to be taken.”\n\nBut MEPs want more. Jytte Guteland, coordinator for the Socialists and Democrats group, asked Timmermans to be the Commission’s own version of Swedish teen climate activist Greta Thunberg. The Greens said they want him to go for a 65 percent target.\n\n2. Financing for the Just Transition Fund is unclear\n\nGoing climate neutral will cost a lot of money — and MEPs wanted to know where it will come from.\n\nCommission President-elect Ursula von der Leyen has promised to create a Just Transition Fund to help regions and workers — especially in the coal sector — adapt to greener energy, but hasn’t said how the fund will be financed. Timmermans wasn't much clearer.\n\n“Of course, there will be new money … it can't all be rechanneling of existing funds,” he said. It will be a “mix of fresh money, combined with co-financing,” links with existing programs such as agriculture, cohesion and structural funds, and with the European Investment Bank.\n\nBut that can only really be determined once the Commission sets out its proposal for the fund — something it is promising in its first 100 days — and once EU leaders agree on the next long-term EU budget.\n\nTimmermans made clear he sees “no future in coal,” but the murky finances around the transition fund left an opening for his political opponents. “‘Coal has no future’ says Frans #Timmermans, but how does he want to help countries like Poland with the clean energy transition? Just Transition Fund is clearly not enough,” the EPP tweeted.\n\n3. Transport emissions have to fall\n\nTimmermans underlined that transport has to contribute to the European Green Deal. “I don't want a car-free Europe. I want emissions-free cars in Europe,” he said.\n\nHe promised to work on extending the Emissions Trading System to the maritime sector (as well as to aviation, although it’s already included) — and to consider bringing in the car industry, while warning it “cannot be used as an excuse not to attain emissions targets.” He also called for more investment in railways to shift people away from flying.\n\n\"This should not be seen as a threat to the transport sector. It's actually an offer. It's an offer because I want to empower the sector to roll out new clean efficient and affordable vehicles and infrastructure,\" he said.\n\nBut green group Transport & Environment said that “concrete proposals to clean up transport” would be needed to “live up to the positive rhetoric” of the hearing.\n\n4. Europe can't fight climate change alone\n\nTimmermans wants the European Green Deal to be replicated by other major economies: “We have to work to convince others to step up their ambition too,” he said. If the bloc’s “climate diplomacy” doesn’t work, he’s prepared to use the stick, too.\n\n“We should also be prepared to consider other instruments, for instance a carbon border tax, to level the playing field for European products if other countries do not go as far as us or refuse to go in the right direction,” he said. \"As an economic giant we have tremendous leverage in our trade relations.\"\n\nThe green deal is, above all, an industrial policy, Timmermans said. “I believe European manufacturing has understood this [green] transition is inevitable to safeguard jobs in the future.\"\n\n5. He faces a fight in with other Commission barons\n\nAlthough his job is to bring in the Green Deal, the new structure of the Commission means Timmermans lacks control over the economic tools to implement his promises: Taxation, budget and economic policy are all under the control of other commissioners.\n\nHe said he “will need the commissioners to work with me, we will need to pull in the same direction … we all need to coordinate our efforts and that is part of my job.”\n\n6. He’s a people’s man\n\nTuesday’s hearing showed Timmermans is a skilled politician, at ease with skirting challenging questions but not afraid of verbal fights.\n\nHe charmed MEPs with his multilingual skills and sprinkled jokes throughout the hearing. He also took on Italy’s Silvia Sardone, from the right-wing League, who challenged the incoming Commission’s climate plans and criticized the hype around Thunberg. “How weak do your arguments have to be if you have to resort to attacking a 16-year-old girl,” Timmermans replied to applause.\n\nHis final remarks ended with a poetic warning. He delivered a verse from a poem by Edwin James Milliken about a man who falls asleep while driving a train — a process he likened to the current trajectory of the Earth’s climate. “For the pace is hot, and the points are near, and sleep hath deadened the driver’s ear; and signals flash through the night in vain. Death is in charge of the clattering train!” he recited.\n\n“We should never come to that,” he told MEPs.", "description": "The Dutchman is set to get the backing of MEPs.", "authors": ["Paola Tamma", "Anca Gurzu", "Kalina Oroschakoff"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/10/GettyImages-1176799810-1200x628.jpg", "published_at": "2019-10-09"}