{"pub": "marketwatch", "url": "https://marketwatch.com/story/apple-iphone-launch-event-5-things-to-watch-for-2019-09-06", "downloaded_at": "2019-09-07 02:16:46.041620+00:00", "title": "Apple iPhone launch event: 5 things to watch for", "language": "en", "text": "As Apple Inc.’s iPhone sales growth has stagnated, its iPhone launch event has increasingly been about much more than just the newest iteration of its iconic smartphone.\n\n\n\nExpect much more than a single new iPhone on Sept. 10, when Apple AAPL, -0.01% has invited media to an annual fall event to roll out its new devices and give more information about other elements of its business, particularly its fast-growing services segment. Apple should again introduce three upgraded iPhone models, as well as the price points and launch timing for new gaming and video subscriptions that it showed off in a spring event.\n\nSee more: The iPhone likely won’t be the core of Apple’s iPhone event\n\nWhen Chief Executive Tim Cook takes the stage at 1 p.m. Eastern time on Tuesday, here are the key things for which to watch.\n\nCompelling new features?\n\nThe smartphone giant has struggled in recent years to excite consumers about device upgrades, and users seem to be holding on to devices longer. Apple’s new models will need to offer features compelling enough to convince iPhone owners that it’s time to trade up from older models. Bank of America Merrill Lynch analyst Wamsi Mohan estimates that there could be 200 million “really old” iPhones—meaning iPhone 6 models or earlier—still in use world-wide, and plenty of later models could be upgraded as well.\n\nAccording to multiple reports and analyst notes, Apple’s two new premium devices are expected to feature a triple-lens camera, which could allow for higher-resolution photos and better zoom capabilities. The company is also expected to roll out an enhanced lower-end model, as it did last year, with only an LCD screen. This device is thought to have only two cameras and potential new color options. Other new features could include the ability to charge devices like the Apple Watch and AirPods using the iPhones power as well as better battery life, CFRA analyst Angelo Zino recently wrote.\n\nSee also: The real reason Apple hasn’t launched a pocket-size iPhone\n\nMissing from the devices will likely be support for 5G, the new wireless standard that carriers are beginning to roll out. Many expect that Apple won’t release a 5G-enabled iPhone until 2020, and there’s concern that some Apple fans will hold out another year until that device comes out. Apple recently purchased Intel Corp.’s INTC, +1.64% modem unit, which suggested that it will work toward developing its own 5G modem instead of relying solely on Qualcomm Inc. QCOM, -0.19%\n\nPricing strategy\n\nPerhaps the ultimate “feature” determining upgrade rates will be the price tags for the new iPhones. Apple faces some tough choices, since potential tariffs loom toward the end of the year, but consumers have grown more resistant to the steep price of Apple’s smartphones.\n\n“Apple saw meaningful elasticity of demand in China when it lowered the price of iPhone XR, and we expect Apple to potentially lower pricing of some models,” Wamsi wrote. He doesn’t project any tariff-related price hikes “just yet.”\n\nZino thinks Apple will keep pricing and sizing the same when it launches the new devices, matching the 6.1-inch iPhone XR, which now sells for a starting price of $749; the 5.8-inch OLED iPhone XS, which goes for $999; and the 6.5-inch OLED iPhone XS Max, which starts at $1,099.\n\nDon’t miss: Apple’s new services could either be Netflix ‘poison’ or barely meaningful\n\nApple used to keep older iPhone models available for lower prices after launching newer versions, but that strategy has become more complicated with the company rolling out more devices every year and keeping the feature set fairly similar. The company must walk a delicate balance in making sure it offers enough reasonably affordable older models in its lineup, to grow its base of users, without lowering prices so much that consumers would be deterred from upgrading to its new lineup.\n\nKey services details\n\nApple teased its forthcoming video and gaming subscription services earlier this year, but left out many of the key details. Of key interest heading into Tuesday’s event are pricing and launch-date information for Apple TV+ and Apple Arcade, as well as any plans to bundle these services with existing offerings.\n\nSee more: Apple targets payments, news, TV and videogames in event detailing new subscription services\n\nThe new TV+ service is at a disadvantage relative to its peers because Apple doesn’t have a robust library of existing content like Netflix Inc. NFLX, -1.05% and Walt Disney Co. DIS, +0.51% Reports indicate that Apple is targeting a $9.99 monthly price for the video service, but CFRA’s Zino worries that might “prove to be too rich” given stiff competition in streaming.\n\nThe company may look to compensate for its limited initial library by bundling the service together with Apple Music at a discounted rate, in Zino’s view. Such a move might help Apple better compete with Spotify in streaming music and amass a base of video subscribers.\n\nFrom March: Apple leaves a lot of questions about its subscription services unanswered\n\nApple is reportedly planning to launch its gaming service for $4.99 a month, according to 9to5Mac,following a one-month free trial. The company has yet to announce when Arcade will be released, but both it and Apple TV+ are expected out by the end of the year.\n\nA new member of the family\n\nApple fans might see a new piece of hardware when Cook and his team make their big announcements. The company is reportedly working on a tracking device, similar to Tile, that Apple users can attach to belongings like keys or wallets to help locate them, according to 9to5Mac and others. Such a device would seek to leverage the “Find My” feature that already helps iOS users find lost iPhones, AirPods, and other devices.\n\nThe company typically rolls out an upgraded Apple Watch in the fall, and an upgraded smartwatch could feature new sleep-monitoring sensors, Bank of America’s Mohan wrote. The watches may also have new titanium and aluminum casing options, according to Mohan.\n\nBloomberg has reported that Apple plans to debut a new 16-inch version of the MacBook Pro laptop, which hasn’t gotten an upgrade in three years, as well as new iPad Pros that have better cameras and chips.\n\nAny surprises or clues about the future?\n\nWhile plenty of leaks tend to appear before Apple launch events, there is typically at least one nugget that is not expected, or at least offers much more than expected or clues about where Apple is headed.\n\nAt last year’s iPhone event, Apple spent a lot of time discussing its A12 Bionic semiconductor that would be used in the new iPhones. The in-depth discussions about how the chip was engineered signaled that Apple could be diving deeper into making its own components for the devices and building out its chip knowledge, which was driven home earlier this year when Apple bought Intel’s wireless-modem business.\n\nApple’s launch event in March was focused on its new Netflix competitor and other streaming services, but most of the talk after the event was about the surprise announcement of the Apple Card, a titanium credit card developed in partnership with Goldman Sachs GS, +0.08% and Mastercard Inc. MA, -0.24% The lack of fees, staggered cash-back and rewards offers, and integration with the Apple Pay digital-payments service had tongues wagging after the event much more than the celebrity appearances celebrating TV+.\n\nWhat will the unanticipated or illuminating announcement be on Tuesday? Watch the live stream, join in a live blog on MarketWatch or check back for the news after the event to find out.\n\nApple shares have climbed 35% so far this year, while the Dow Jones Industrial Average DJIA, +0.26%, of which Apple is a component, has risen 15%.\n\nMarketWatch staff writer Jeremy C. Owens contributed to this article.", "description": "As Apple Inc.’s iPhone sales growth has stagnated, its iPhone launch event has increasingly been about much more than just the newest iteration of its iconic...", "authors": ["Emily Bary"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HI578_apple__ZG_20190501063409.jpg", "published_at": "2019-09-06"}