{"pub": "reuters", "url": "https://in.reuters.com/article/uk-india-npcil-malware/nuclear-power-corp-of-india-says-detected-malware-in-its-systems-idINKBN1X91FM", "downloaded_at": "2019-10-30 14:32:30.071174+00:00", "title": "Nuclear Power Corp of India says detected malware in its systems", "language": "en", "text": "NEW DELHI (Reuters) - State-run Nuclear Power Corp of India Ltd (NPCIL), which runs nuclear reactors across the country, said on Wednesday it had identified malware in one of its computers last month but its plant systems were unaffected.\n\n“The investigation revealed that the infected PC belonged to a user who was connected in the internet network used for administrative purposes. This is isolated from the critical internal network,” the utility said in a statement.\n\nOn Tuesday, the NPCIL rejected media reports that its Russian-built reactors in Kudunkulam in southern India had suffered a cyber attack.\n\nSome cyber security experts had tweeted on Tuesday that NPCIL’s computers were potentially compromised.\n\nOne of the experts, Pukhraj Singh who works independently, said he had notified the Indian government on Sept. 4 that there had been an incident at the Kudankulam nuclear power plant.\n\nNPCIL said the government’s CERT-In department, which is responsible for emergency response, had notified about the malware on Sept. 4 and that it was immediately investigated by the department of atomic energy specialists.\n\n“The networks are being continuously monitored. Investigation also confirms that the plant systems are not affected.”\n\nNPCIL, which designs, constructs and runs nuclear power reactors in India, currently operates 22 commercial nuclear power reactors with an installed capacity of 6,780 megawatts, according to its website.\n\nIndia has previously attempted to tighten rules for businesses entering its power transmission sector, making stringent checks on both power and telecoms equipment to guard against malware.", "description": "State-run Nuclear Power Corp of India Ltd (NPCIL), which runs nuclear reactors across the country, said on Wednesday it had identified malware in one of its computers last month but its plant systems were unaffected.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-30"}