{"pub": "hotair", "url": "https://hotair.com/archives/allahpundit/2019/09/22/sunday-morning-talking-heads-179", "downloaded_at": "2019-09-22 13:10:54.535166+00:00", "title": "Sunday morning talking heads", "language": "en", "text": "An occupational hazard of serving in a presidential cabinet is being booked on TV to discuss Topic A and then having the news cycle suddenly force you into talking about a much less comfortable Topic B. That’s the situation Mike Pompeo and Steve Mnuchin find themselves in this Sunday morning, with Pompeo set for “This Week,” “Face the Nation,” and “Fox News Sunday” while Mnuchin guests on “State of the Union.” They were scheduled to discuss the standoff between Iran and Saudi Arabia, of course: On Trump’s orders, Mnuchin’s Treasury Department is imposing new sanctions on Tehran while Pompeo takes the lead on coordinating a U.S.-Saudi response to Iran’s attack on Saudi oil facilities. But both will be challenged on the mysterious whistleblower complaint that’s dominated the news over the last few days and which may or may not involve Trump threatening Ukraine with the loss of U.S. military aid if they didn’t start investigating Joe Biden’s son for corruption. What’s tricky for the two is that they probably don’t know what’s in the complaint; anything they say this morning in Trump’s defense could come back to haunt them if the evidence ends up contradicting them. They’ll have to play it safe and defend Trump on the assumption that he’s guilty of the worst-case scenario, an overt threat to cut Ukraine off if they didn’t make trouble for the Democratic frontrunner. “What’s wrong with that?” Pompeo and Mnuchin will argue.\n\nThere’ll be Democrats on to discuss Ukraine and the whistleblower situation too, of course. If it’s Sunday, it means “Pencil Neck” Adam Schiff is in front of a camera somewhere; this week it’s “State of the Union” that has him. A more interesting guest may be Dem Sen. Chris Murphy, who met with Ukraine’s president not long ago, after the July 25 phone call with Trump in which Trump allegedly leaned on him for help with Biden. Murphy’s been tweeting about that encounter:\n\nA few weeks ago in Ukraine, I met w President Zelensky and we discussed the surprise cut off of aid and the inappropriate demands the Trump campaign was making of him. The obvious question everyone in Kiev was asking was – were the two things connected? https://t.co/8yXFiFRlQm — Chris Murphy (@ChrisMurphyCT) September 20, 2019\n\nI don’t know what is in the whistleblower complaint, but it was clear to me that Ukraine officials were worried about the consequences of ignoring Giuliani’s demands. And of course they were. That’s why presidents shouldn’t have their campaigns talking to foreign leaders. — Chris Murphy (@ChrisMurphyCT) September 20, 2019\n\nThat was three days ago. He was less circumspect on Friday evening, when reports emerged of Trump pressuring Zelensky on the Biden matter:\n\nTo ask a foreign leader to interfere in a presidential election – right after a year long investigation into potential foreign interference in a presidential election – would be pretty extraordinary. Even for these times. — Chris Murphy (@ChrisMurphyCT) September 20, 2019\n\nIt doesn’t matter if there was a “quid pro quo” if he did actually beg a foreign government to interfere in our election. If you burn down the house, the fact that you didn’t also burn down the garage is not exculpatory. https://t.co/ba5ZVFtmeh — Chris Murphy (@ChrisMurphyCT) September 21, 2019\n\nJudging by my twitter feed it seems like people think there are other things in politics that matter tonight besides the possibility that the President of the United States asked a foreign nation to ruin his political opponent and then cut off their foreign aid when they refused. — Chris Murphy (@ChrisMurphyCT) September 21, 2019\n\nMurphy is the lead guest on “Meet the Press,” where he’ll elaborate on those themes. If none of that grabs you, though, keep an eye on “This Week” after Pompeo’s interview is over: The next guest is slated to be James Mattis, who’s dodged questions about Trump’s fitness at every opportunity during his book tour. Will the Ukraine revelations change that for him? If Mattis says something harsh, it’ll affect the complexion of the story, both in the media and to some degree among Republicans in Congress. The full line-up is at the AP.", "description": "Clean-up.", "authors": ["Karen Townsend", "Ed Morrissey", "Jazz Shaw", "John Sexton"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/y-1.jpg", "published_at": "2019-09-22"}