{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/1/tom-brady-is-the-greatest-so-of-course-the-left-sa", "downloaded_at": "2019-10-02 00:36:26.588439+00:00", "title": "Tom Brady is the greatest, so of course the left says it's because of racism", "language": "en", "text": "ANALYSIS/OPINION:\n\nSix Super Bowl championships, four Super Bowl MVPs, three NFL MVPs, 14 Pro Bowl appearances, two Offensive Player of the Year awards, three times the passing-yards leader, four times the touchdown leader, a member of the NFL 2000s All-Decade team, and so many more awards.\n\nYou know who I’m talking about before I even name him, because no other football player has accomplished what he’s accomplished, but according to one (very obviously liberal) University of Rhode Island professor, Tom Brady is only popular because of … white nationalism.\n\nWelcome to modern day progressive America where, even if you’re quite possibly the greatest athlete in the history of the National Football League, your popularity will only be written off as some sort of intrinsic societal racism. Kyle W. Kusz, an associate professor in URI’s Department of English, breaks down why he’s sure Tom Brady is only popular because of racism in a book called “The Palgrave Handbook of Masculinity and Sport.”\n\nIn his 22-page chapter, Mr. Kusz, who looks like the now well-known stereotype of a man who regularly declares himself a “feminist” and would put his pronouns in his Twitter profile, says “performances of white masculinity” by both Mr. Brady and of course President Trump show “how they represent the cultural (re-) emergence and valorization of a white masculinity that unapologetically desires a manly omnipotence … .”\n\nYou might need to read that sentence again because he/him wrote it in, ‘I need to prove that I’m smarter than you by using bigger words that aren’t necessary’ English — so I’ll break it down for you. When translated, all he’s saying is “Orange man bad” and “Friend of Orange man who had a MAGA hat in his locker, also very bad.”\n\nHe continues down the Trump Derangement Syndrome path by declaring Mr. Brady’s Under Armour commercial to be similar to Nazi propaganda films because it uses a black and red color scheme, “militaristic” sounds, and an “army of Bradys … .”\n\nI just want to stop at this point in my op-ed and seriously ask, who actually picked up this book and read it to find this chapter on Mr. Brady?\n\nThis is like a few weeks ago when Mollie Hemingway on her anniversary, God bless her, was the only person to read the new Brett Kavanaugh smear book, “The Education of Brett Kavanaugh,” to discover that there was no new valid claim of sexual assault against Justice Kavanaugh when the media and Democratic candidates were running rampant with that tale. To Ms. Hemingway and whoever suffered through this book, I owe you a drink.\n\nMr. Kusz’s ridiculous claim that Tom Brady is only popular because of white nationalism and hate honestly sounds like a game where progressives free-associate words to excuse away actual success. He could look to other incredibly popular athletes and do the same, except many of our current sports heroes and icons are — wait for it — not white males. And in trying to excuse away the incredible athletic success of say, LeBron James or Megan Rapinoe as something tied to race, gender or sex, he would be outcast from whatever social justice soirée I assume he attends on Tuesday nights where they discuss cat grooming, newly created genders and hating Donald Trump.\n\nUnfortunately for un-athletic people like Mr. Kusz and I, we’re stuck having to do things like write for a living — and that doesn’t always come with the same glory, fame, models and multi-million dollar deals that come with being the greatest athlete of a generation. The difference between Mr. Kusz and I, however, is that I won’t sit around excusing away the great success of anyone else by using tired progressive talking points and big words. I also won’t get a book deal to opine about how I hate all the demographics about myself that I was born with and can’t change.\n\nIf the left wants to beat Donald Trump and change the narrative, this is the wrong way to go about it. There are real issues of injustice and inequality in the world that we could all be working on. But instead, they’ll lose the narrative, and the House of Representatives and continue to lose the White House as long as this type of lunacy continues to get a platform.\n\nSo unfortunately for people like me who hate the Patriots and Kyle W. Kusz who hates Donald Trump and white athletes who identify as male, Tom Brady is popular and rich and married a hot model because he’s one of the greatest athletes of all time — not because of racism.\n\n• Tim Young is a political comedian and author of “I Hate Democrats/I Hate Republicans” (Post Hill Press).\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Tom Brady is popular and rich and married a hot model because he's one of the greatest athletes of all time -- not because of racism.", "authors": ["The Washington Times Http", "Tim Young"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/02/05/aptopix_super_bowl_patriots_parade_football_46350_c0-88-2100-1312_s1770x1032.jpg?30dd1078ff68c7666153ff7c17bf3b0bdf3ea7ae", "published_at": "2019-10-01"}