{"pub": "cbc", "title": "", "url": "https://cbc.ca/news/canada/nova-scotia/zine-magazine-cape-breton-1.5256498", "language": "en", "published_at": "2019-08-25", "downloaded_at": "2019-09-02 07:06:34.012346+00:00", "text": "Working from her bedroom in Sydney River, N.S., 18-year-old Gee Stewart draws, glues, types, hand stitches and edits zines.\n\nA zine, short for magazine, is a self-published, small-circulation collection of original or photocopied artwork bound into a book.\n\nStewart accepts online submissions from artists and creative people all over the world — everything from artwork, photography, poems or stories — which she then puts into a handmade issue.\n\n\"There's people from all over the world that send stuff in,\" Stewart said. \"You get to see their art and sometimes talk back and forth to them about their submission. And yeah, it's awesome.\"\n\nA recent graduate of Riverview Rural High School, Stewart ran the art club and graduated with a fine arts certificate.\n\nThe zine was launched on Dec. 31, 2017. Since then, there have been 11 issues and three mini-issues. (Emily Latimer/CBC)\n\nDigital and physical copies of her zine reach audiences worldwide.\n\n\"I think I've sold an issue in pretty much every continent, except Antarctica, obviously,\" Stewart said.\n\nShe was inspired to launch her zine, Guillozine, a year and a half ago.\n\n\"There was not really any planning to it, and I kind of launched it overnight,\" Stewart said. \"And then it blew up and it's still blowing up.\"\n\nZines are relatively low-cost to produce. Some issues are printed at home, some are handmade and others are printed on glossy paper at shops.\n\n\"They're sort of just a mishmash of whatever you want them to be. Sometimes they're just pictures or just writing,\" Stewart said.\n\nGuillozine accepts submissions from all over the world. (Emily Latimer/CBC)\n\nThe name Guillozine is a mashup of zine and Stewart's favourite film director, Guillermo del Toro.\n\nIssue 11 of Guillozine will be released in September to coincide with the Lumière arts festival.\n\nNomination\n\nStewart's zine earned her a nomination for a 2019 Vital Excellence Award from NextGen Cape Breton, an initiative that recognizes Cape Bretoners 16 to 40 who are making the island \"a better place to live, work and play.\"\n\nStewart is excited about the nomination, even though she feels like a \"very small part of the community.\"\n\n\"But this proves that other people think I'm pretty cool, which is awesome,\" she said.\n\nJoe Costello, arts and culture director at the Cape Breton Regional Municipality, invited Stewart to run a zine workshop for the municipality.\n\nHe said Stewart will help change the arts landscape by showing other young people that they can take chances on things they are passionate about.\n\n\"Young people are inherently innovative as they are eager to explore and create their own path rather than seek direction,\" Costello said.\n\nInspiration\n\nStewart was inspired to start her zine because of one that was self-published by Stewart's favourite band 28 years ago. Washington state punk band Bikini Kill published the riot grrrl manifesto in the Bikini Kill Zine 2. The riot grrrl manifesto was about creating a space for women in the punk music scene.\n\nBikini Kill is often cited as the pioneers of the riot grrrl movement, an underground feminist punk movement that began in the early 1990s.\n\nInspired by Bikini Kill frontwoman Kathleen Hanna, Stewart has hosted her own \"girls to the front\" punk shows in Sydney.\n\n\"Our music scene here is very male dominated, so I thought it was necessary to give young, female musicians the chance to take centre stage,\" she said.\n\nStewarts, who also sings and plays guitar and bass, said there's a thriving punk scene in Sydney and she hopes more people go check out shows.\n\n\"It's a great opportunity to see local music that isn't Celtic music,\" Stewart said.\n\nMORE TOP STORIES", "description": "Inspired by feminist punk bands from the 1990s, 18-year-old Gee Stewart creates a zine from her Cape Breton bedroom. She gathers artwork submitted by people from all over the world and sells issues on the internet.", "authors": [], "top_image": "https://i.cbc.ca/1.5256514.1566502379!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/gee-stewart-creator-of-guillozine.jpg"}