{"pub": "fox", "url": "https://foxnews.com/media/msnbc-mehdi-hasan-trump-isis-recruiter-sergeant", "downloaded_at": "2019-10-29 06:13:13.052926+00:00", "title": "MSNBC guest claims Trump is 'recruiting sergeant for ISIS' after al-Baghdadi death", "language": "en", "text": "A guest on MSNBC made a wild claim Monday night that President Trump is a \"recruiting sergeant for ISIS\" and compared him to a \"Bond villain\" following the death of ISIS leader Abu Bakr al-Baghdadi.\n\nThe Intercept columnist Mehdi Hasan said \"good riddance\" to al-Baghdadi and added that his death was a \"blow to ISIS.\"\n\nHowever, the Al Jazeera host then quickly suggested that Trump was helping ISIS maintain its existence by trying to ensure the U.S. military helped secure Syrian oil fields, while other troops left northern Syria.\n\n\"It's beyond parody. He's almost like a Bond villain who also tells you his whole master plan before he tries to kill you... He's a recruiting sergeant for ISIS, Chris, in so many ways,\" Hasan told \"All In\" host Chris Hayes, pointing to Trump's rhetoric on oil fields. \"He is also someone who is an Islamophobe, which obviously helps groups like ISIS recruit disillusioned, angry young men from across the world, not just across the Middle East. He's been featured in ISIS recruiting videos and his Muslim ban has definitely been a recruiting ad for ISIS.\"\n\nHayes did not push back on any of those claims.\n\nJAMIE LEE CURTIS RIPS TRUMP FOR COMPARING AL-BAGHDADI TO DOG: ALL LIVING THINGS SUFFER\n\nHasan wasn't the only critic of Trump following al-Baghdadi's death. Actress Jamie Lee Curtis blasted him after he called al-Baghdadi a dog, telling the president that dogs are \"brave, bold, loyal, loving and healing.\"\n\nIn a tweet that has since been deleted, Curtis knocked the president's remarks following al-Baghdadi's death, arguing the ISIS leader \"suffered\" when he blew himself up and went on to refute Trump's assertion that al-Baghdadi, whom he called a dog, was also a coward.\n\n\"He may have died a coward @realDonaldTrump but ALL living things suffer when they are blown up,\" the \"Halloween“ star tweeted. \"Anyone who has experienced warfare, unlike yourself, would know that. War is brutal. Dogs are brave, bold, loyal, loving and healing.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nWashington Post columnist Max Boot had a similar complaint, criticizing Trump for calling al-Baghdadi a \"coward.\"\n\n\"A president who has never heard a shot fired in anger reveled in Baghdadi's last moments, even claiming 'he died like a coward... whimpering and crying and screaming all the way.' Trump could not possibly have heard \"whimpering and crying\" on the overhead imagery because there was no audio,\" Boot wrote in an opinion piece. \"The assertion that Baghdadi died as a coward was, in any case, contradicted by the fact that rather than be captured, he blew himself up.\"\n\nBoot later noted in a tweet that his \"coward\" insight was later removed from the piece because \"it wrongly conveyed the impression that I considered Baghdadi courageous. As I wrote Sun: Baghdadi was 'a sick and depraved man.'\"", "description": "A guest on MSNBC made a wild claim Monday night that President Trump is a \"recruiting sergeant for ISIS\" and compared him to a \"Bond villain\" following the death of ISIS leader Abu Bakr al-Baghdadi.", "authors": ["Joseph Wulfsohn", "Joseph A. Wulfsohn Is A Media Reporter For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Mehdi-Hasan.jpg", "published_at": "2019-10-29"}