{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nhl/2019/10/11/burakovsky-scores-late-goal-avalanche-beat-bruins-4-2/40299031", "downloaded_at": "2019-10-11 05:10:51.254321+00:00", "title": "Burakovsky scores late goal, Avalanche beat Bruins 4-2", "language": "en", "text": "CLOSE\n\nDENVER (AP) — Andre Burakovsky skated by one Boston defender and collided with another. In between, he had an instant of separation, just enough to get off a shot.\n\nBurakovsky scored the go-ahead goal with 7:06 remaining, Boston had two goals disallowed after video reviews, and the unbeaten Colorado Avalanche handed the Bruins their first loss of the season with a 4-2 victory on Thursday night.\n\nGabriel Landeskog added an empty-net goal with 1:01 remaining for the Avalanche, who are off to a 3-0 start for just the second time since relocating to Denver from Quebec in 1995. The 2013-14 club opened the season 6-0.\n\nPierre-Edouard Bellemare and Nathan MacKinnon also had goals for Colorado and Philipp Grubauer made 39 saves.\n\nDavid Pastrnak and Zdeno Chara had goals for the Bruins.\n\nBurakovsky, acquired last June in a trade with the Washington Capitals, scored his first goal as a member of the Avalanche. From the top of the left circle, Burakovsky banged in a shot off the post, falling on his backside an instant after the shot as he took a hit from a defender.\n\n\"It felt great,\" Burakovsky said. \"I don't think the (defenseman) was fully awake when I kind of jumped by him. We've been talking all the time about getting pucks to the net. That's something that was in my mind and I was just lucky it hit the post and went in.\"\n\nColorado coach Jared Bednar said there was a lot more than luck involved in Burakovsky's game-winner.\n\n\"That's the best game we've seen out of him,\" Bednar said. \"He was on pucks, he was making some plays, he was using his speed and driving by guys in foot races.\"\n\nBoston had appeared to take a 3-1 lead on a goal by Karson Kuhlman at 1:50 of the second period, but it was negated after Bednar's challenge was upheld. Officials rescinded the goal after a video review determined David Krejci interfered with Grubauer as he jostled with a defender in front of the net.\n\nThe Bruins had an apparent tiebreaking power-play goal by Jake DeBrusk negated in the opening seconds of the third period, again when a challenge by Bednar was upheld on a video review that showed Pastrnak was narrowly offside on the play.\n\n\"Any time you get production finally and it gets taken away from you — twice — you almost don't believe it, but that's how things are going for me,\" said DeBrusk, who also was in line for an assist on the first disallowed goal. \"I scored and had an assist tonight but they got called back. We should've won this game 4-2, but I guess neither of them were goals and that's how they called it. They looked at it and called it out how it was. It won't snowball for me, but I'm definitely (upset).\"\n\nBoston took a 2-0 lead on first-period goals by Pastrnak and Chara, who scored on a slap shot from just inside the blue line.\n\nColorado got on the board with a power-play score by MacKinnon. Gabriel Landeskog split defenders while leading a rush into the Boston zone and let fly a shot that Jaroslav Halak turned away. But MacKinnon knocked in the rebound from up close.\n\nThe Avalanche evened the score at 2 on a goal by Bellemare at 9:43 of the second.\n\nNOTES: Brad Marchand is one assist shy of the 300th of his career. ... Boston's four-game road trip to start the season was its longest since opening the 2008-09 campaign with a four-game trip. ... Cale Makar registered an assist on MacKinnon's goal, becoming the third defenseman in the Avalanche's franchise history to have points in each of their first three career regular-season games.\n\nUP NEXT\n\nBruins: Open their home schedule by hosting New Jersey on Saturday night.\n\nAvalanche: Host Arizona on Saturday night to wrap up a season-opening four-game homestand.\n\n___\n\nMore AP NHL: https://apnews.com/NHL and https://twitter.com/AP_Sports\n\nCopyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "Andre Burakovsky scored the go-ahead goal with 7:06 remaining and Boston had two goals disallowed after video reviews as the unbeaten Colorado Avalanche handed the Bruins their first loss of the season 4-2 on Thursday night", "authors": ["Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/3ca236be40f173c7ddeb96364d6d93584733806c/c=0-96-2260-1367/local/-/media/2019/10/11/USATODAY/usatsports/0bac9d2b3cc54ed1935e588c1f3f57e3.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-11"}