{"pub": "thenextweb", "url": "https://thenextweb.com/hardfork/2019/10/28/moonday-morning-china-goes-crazy-over-blockchain", "downloaded_at": "2019-10-28 13:19:47.315328+00:00", "title": "Moonday Morning: China goes crazy over blockchain", "language": "en", "text": "Hello, happy Monday and welcome to another Moonday Morning – Hard Fork’s roundup of the weekend’s top cryptocurrency and blockchain news.\n\nHere’s what we’ve found:\n\n1. A cryptocurrency exec is suing AT&T over a SIM swapping hack which he claims cost him $1.7 million in digital assets. Seth Shapiro claimed in his lawsuit, submitted on October 17 in US District Court for the Central District of California, that the cell carrier gave hackers repeated access to his SIM card in May 2018, enabling them to empty his cryptocurrency wallets on 11 exchanges, according to CoinDesk.\n\n2. The New York State Department of Financial Services (NYDFS) has asked cryptocurrency exchange Bittrex to postpone closing its accounts in New York until further notice, The Block reports. This means that the exchange‘s New York-based customers can continue to withdraw funds, but may not be able to deposit or trade cryptocurrency.\n\n3. Bitcoin‘s price continued to make headlines over the weekend, increasing by a noticeable 22 percent. As is often the case, pundits have been trying to figure out what has caused this sudden surge, focusing mostly on three plausible theories: new legal developments relating to Bitfinex, short squeezes, and an announcement by Chinese President Xi Jinping on Friday that the country would be investing heavily in blockchain technology. Decrypt has more.\n\n4. In fact, President Xi Jinping’s comments have seemingly caused a blockchain frenzy in China, with investors buying every blockchain-related stock available, Bloomberg reports.", "description": "Hello, happy Monday and welcome to another Moonday Morning – Hard Fork's roundup of the weekend’s top cryptocurrency and blockchain news.", "authors": ["Yessi Bello Perez", "October"], "top_image": "https://img-cdn.tnwcdn.com/image/hardfork?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2Fmoonday.jpg&signature=69c4805ab6e4f9bdade5a6edaccbc9ab", "published_at": "2019-10-28"}