{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/21/astros-could-force-nationals-ditch-their-navy-blue-uniforms-world-series", "downloaded_at": "2019-10-21 13:14:50.100618+00:00", "title": "Astros could force the Nationals to ditch their navy blue uniforms in World Series", "language": "en", "text": "In baseball, the home team decides which color jersey to wear and, according to an MLB spokesman, the league has a rule against teams wearing jerseys that are too similar in color. If the Astros elect to break out their navy alternates for the first time during these playoffs for Games 1 or 2 in Houston, the Nationals would be prohibited from wearing the navy blue alternates with the white script that they’ve worn for six consecutive games, all of them wins. The Nationals will have the first pick of which jersey to wear for Games 3, 4 and 5, if necessary, in D.C.\n\nAD\n\nAD\n\nThe Nationals are 7-0 in their navy blue alternates this postseason, including five straight wins since facing elimination in Game 4 of the NLDS against the Dodgers. Dating back to the start of the start of the 2018 season, when Washington debuted its navy alternates, the Nationals are 24-5 in the jerseys.\n\nThe Astros haven’t worn their navy blue jerseys during the playoffs, and there’s been no indication that they plan to start now. They wore them nine times during the regular season, most often for Sunday home games. Houston went 8-1 in its navy alternates, according to SportsLogos.net. The Astros most recently wore their navy alternates in a 21-1 rout of the Mariners on Sept. 8.\n\nAs documented by SportsLogos.net, there are several examples of teams wearing the same color jerseys in regular season games in recent years. The league’s uniform guidelines are the same during the regular season and postseason, but perhaps are more strictly enforced during the playoffs.\n\nAD\n\nAD\n\nThe past three World Series champions have clinched the title while wearing an alternate jersey. The Astros were wearing their orange alternates when they clinched their first World Series championship in 2017 with a Game 7 win at Dodger Stadium.\n\nThe Cubs and Indians both wore blue alternate jerseys during the 2016 World Series, but Chicago’s jerseys were royal and Cleveland’s jerseys were navy, and the shades were evidently deemed different enough.\n\nThe Nationals’ navy blue alternate jerseys have become popular with fans during the team’s playoff run. On Friday, the Nationals said the jerseys were out of stock with the manufacturer. There’s no word yet on when more will be available for purchase, or whether Washington will be permitted to wear them in Game 1.\n\nRead more on the Nationals:\n\nAD\n\nAD\n\nAD", "description": "MLB rules prohibit teams from wearing jerseys that are too similar in color.", "authors": ["Scott Allen", "Reporter Covering D.C. Pro", "Local College Sports"], "top_image": "https://www.washingtonpost.com/resizer/GgZDTtW074AKG5VR-kqNev5fun4=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PTKJW3WLOJAAFGBDN3R7ULQ4V4.jpg", "published_at": "2019-10-21"}