{"pub": "indiatimes", "url": "https://prime.economictimes.indiatimes.com/news/71812791/energy/whats-clouding-indias-grand-solar-park-plan-a-lack-of-land-and-transmission-infrastructure", "downloaded_at": "2019-10-30 04:15:01.228363+00:00", "title": "What’s clouding India’s grand solar-park plan? A lack of land and transmission infrastructure", "language": "en", "text": "A solar park in Thirumani village in Karnataka\n\nThe landowner may not own the wind turbines in their entirety but may be an equity shareholder. They receive royalty for land plus a percentage of the returns from the business. This takes care of land availability and makes renewable projects viable. Developers in India hope that a similar model is adopted soon — and on the fast track. Forty-two solar parks approved in the past four years — across 18 states. The total generation capacity is 23GW. But where’s the land to set up these parks? How were these plans approved, when one of the most essential factors is missing? India wants a sizeable portion of its energy needs to be fulfilled by solar power, with large-scaleThe landowner may not own the wind turbines in their entirety but may be an equity shareholder. They receive royalty for land plus a percentage of the returns from the business. This takes care of land availability and makes renewable projects viable. Developers in India hope that a similar model is adopted soon — and on the fast track.\n\nForty-two solar parks approved in the past four years — across 18 states. The total generation capacity is 23GW. But where’s the land to set up these parks? How were these plans approved, when one of the most essential factors is missing? India wants a sizeable portion of its energy needs to be fulfilled by solar power, with large-scale The landowner may not own the wind turbines in their entirety but may be an equity shareholder. They receive royalty for land plus a percentage of the returns from the business. This takes care of land availability and makes renewable projects viable. Developers in India hope that a similar model is adopted soon — and on the fast track.", "description": "Solar parks account for 40% of the government’s target to build 100GW of solar-power capacity by 2022. However, faced with land-acquisition problems and transmission challenges, the target is unlikely to be achieved.", "authors": ["Et Prime"], "top_image": "https://etimg.etb2bimg.com/thumb/770632/71812791.cms?width=800&height=435&overlay=etprime", "published_at": "2019-10-30"}