{"pub": "yahoo", "url": "https://news.yahoo.com/cyntoia-brown-long-says-shed-050113298.html", "downloaded_at": "2019-10-16 14:11:24.274504+00:00", "title": "Cyntoia Brown-Long says she'd like to speak with her victim's family", "language": "en", "text": "This article, Cyntoia Brown-Long says she'd like to speak with her victim's family, originally appeared on CBSNews.com\n\n, who was granted clemency earlier this year after serving 15 years of a life sentence for killing a man, says she'd like to someday speak with her victim's family.\n\n\"I completely understand how they feel,\" Brown-Long told CBS News. \"This was somebody's son, it was someone's brother. If you lose someone, grief doesn't care about what the situation was.\"Brown-Long, now 31, was released from prison in August after former Tennesse Governor Bill Haslam commuted her sentence for murdering 43-year-old Johnny Allen, who allegedly hired her for sex when she was 16. Her lawyers argued that she fatally shot Allen in self-defense.Brown-Long was tried as an adult and convicted of first-degree murder and aggravated robbery in 2006 without the possibility for parole until 2055. In Tennessee, a juvenile sentenced to life in prison must spend at least 51 years behind bars before they are eligible for review — the highest minimum requirement in the U.S.\n\nCyntoia-Brown-Long.jpg More\n\nCyntoia Brown-Long CBS News\n\nHer case received national attention, with celebrities like Kim Kardashian West, Rihanna, LeBron James and Snoop Dogg advocating for her freedom. Brown-Long says she hopes her experience can help young women who find themselves in similar situations. \"I want you to know that there are people who see you, who hear you,\" Brown-Long said. \"You do have a voice even though there are people, there is a system, that's trying to tell you that you don't have a voice.\"\n\nThe Sentencing Project estimates that juveniles sentenced to life with the possibility of parole spend on average 25 years behind bars before being considered for an early release.Brown-Long will be on parole for the next 10 years and is subjected to supervision conditions, such as employment and counseling requirements. She said she believes the criminal justice system can be reformed, but its broader impact on individuals needs to be recognized for any real changes to be made.\"In some way, everybody is just one bad decision, one mistake, one accident from being caught up in the justice system,\" she added. \"We all should be invested in making sure that we're treating people the way they should be treated, the way that you would want to be treated.\"\n\nMarc Benioff on how Salesforce was able to \"do well and do good\"\n\nPaul Rudd on the challenges of playing opposite himself in new Netflix series\n\nBreast cancer in men often diagnosed at more advanced stage", "description": "Brown-Long was released from prison in August after Tennesse's former governor commuted her sentence for murdering 43-year-old Johnny Allen", "authors": ["Tyler Kendall"], "top_image": "https://s.yimg.com/uu/api/res/1.2/uYD3oTNkuewHxAF5WElT2w--~B/aD0xMDI1O3c9MTYwMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/cbs_news_897/809f8ace08dddd206484345f018ef2e2", "published_at": "2019-10-16"}