{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-eu-legislation-factbox/factbox-brexit-delay-to-become-law-can-pm-johnson-ignore-it-idUKKCN1VU14W", "downloaded_at": "2019-09-09 11:47:30.200883+00:00", "title": "Factbox: Brexit-delay to become law, can PM Johnson ignore it?", "language": "en", "text": "LONDON (Reuters) - A bill to force Prime Minister Boris Johnson to seek an extension to Brexit negotiations with the European Union if there is no deal in place by Oct. 19 is due to get Royal Assent on Monday and become law.\n\nFILE PHOTO: Britain's Prime Minister Boris Johnson makes a speech during a visit to West Yorkshire, Britain September 5, 2019. Danny Lawson/PA Wire\n\nThe law sets out that if by Oct. 19 the government has not got parliamentary approval for an agreement with Brussels or for leaving the EU without a deal, Johnson must request a delay until Jan. 31, 2020 to avoid a so-called no-deal Brexit.\n\nBut Johnson has said he would rather be “dead in a ditch” than seek a delay to Brexit, which he has promised to deliver by Oct. 31 “do or die”.\n\nThis is what the legislation would do:\n\n- It requires that by Oct. 19, the government must meet one of the following two conditions:\n\n1) Reach a deal with the EU, which is then approved by parliament\n\n2) Get parliament’s approval to leave without a deal\n\n- If neither of these has happened, the prime minister must write to the European Union seeking an extension until Jan 31, 2020. The bill even gives the exact text here of the letter.\n\n- If the EU agrees to an extension to Jan. 31, Johnson must immediately accept the extension.\n\n- If the European Council proposes an extension to a different date then the Johnson must accept that extension within two days, unless parliament rejects it.\n\n- If either of these conditions are met after the letter is sent, then the government can withdraw or amend the letter.\n\nWhat has the government said about the law?\n\nOn Sunday, foreign minister Dominic Raab said the government would “adhere to the law”, but went on to say: “We will also, because this is such a bad piece of legislation, the surrender bill that (Labour leader) Jeremy Corbyn backed, we will also want to test to the limit what it does actually lawfully require.”\n\n“We will look very carefully at the implications and our interpretation of it ... At what it requires and what it doesn’t require,” Raab told the BBC.\n\nFinance minister Sajid Javid also said Johnson would not seek an extension at an EU summit on Oct. 17-18.\n\n“The bill talks about the 19th (of October) being an important date and at that point we will consider our options but our policy is clear, it is unchanged, we will be leaving on Oct. 31,” he said.\n\n“We will obey all laws because all governments should obey laws absolutely, but you will have to wait and see what happens then.”\n\nCould the government circumvent the law?\n\nThe Telegraph newspaper reported that Johnson’s team has drawn up plans to “sabotage” any Brexit extension without breaking the law.\n\nOne plan would see the prime minister send an accompanying letter alongside the request for an extension setting out that the government does not want any delay after Oct. 31, the newspaper reported, citing a source.\n\nThe government could also hope that the other 27 EU members would not agree to another delay. Any extension needs unanimous approval.\n\nBut Jonathan Sumption, a former senior judge, told BBC radio that such a letter would not be legal.", "description": "A bill to force Prime Minister Boris Johnson to seek an extension to Brexit negotiations with the European Union if there is no deal in place by Oct. 19 is due to get Royal Assent on Monday and become law.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190909&t=2&i=1427918529&w=1200&r=LYNXNPEF8810P", "published_at": "2019-09-09"}