{"pub": "metro", "url": "https://metro.co.uk/2019/10/25/drag-race-uks-sum-ting-wong-praises-iconic-geri-horner-reveals-fairytale-coming-10985077", "downloaded_at": "2019-10-25 22:06:11.004330+00:00", "title": "Drag Race UK's Sum Ting Wong praises Geri Horner after exit", "language": "en", "text": "Sum Ting Wong reckons that Geri was ‘iconic’ and the perfect judge. (Picture: BBC)\n\nRuPaul’s Drag Race UK fans saw the brilliant Sum Ting Wong to sashay away on Thursday after failing to impress the judges with her David Attenborough impression for Snatch Game.\n\nStill, as the queen tells Metro.co.uk, she’s glad she went out on a high – namely, meeting guest judge Geri Horner.\n\n‘It was the most iconic thing to ever happen in my life,’ says Sum Ting, ‘it was the perfect episode, such a nice way to go’.\n\n‘Geri coming in at the end was the icing on the cake I didn’t need, the doughnut you have after dinner even when you don’t need it!’\n\nSpice Girls star Geri has reinvented her image in recent years, making a somewhat unusual guest judge for the sweary innuendo fest that is Drag Race, with a number of fans calling her ‘dull’ in comparison to her fellow judges.\n\nAdvertisement\n\nAdvertisement\n\nBut Sum Ting reckons that Geri was ‘iconic’ and the perfect judge.\n\n‘I was fine until she came in, and when she came in I thought “what is happening, is this a joke?”\n\n‘She said so many lovely things and I don’t cry normally so when she said “you are the embodiment of drag and everything I love about drag”, she said I give off this warmth and loving energy and “you don’t know how special that is”, and I was like “[random noise] I love you!’\n\nSum Ting has left the competition (Picture: BBC)\n\nIn a surprising move, the show revealed that after Sum Ting was asked to sashay away, Geri re-joined Sum Ting in the Werk Room to congratulate her for getting this far in the competition.\n\n‘I just wanted to come and say hello to you because I thought you had such a great energy and it really came across, for me it did. I really connected with that,’ Geri said.\n\n‘I thought you brought a lot of joy, so well done,’ she continued to the teary drag queen, who could only get out the words: ‘Geri Horner made me cry.’\n\nSum Ting Wong (Picture: PA)\n\nThe episode was criticised by fans for having a marked lack of British celebrities impersonated by the queens for Snatch Game, but Sum Ting defended their choices saying that ‘snatch game has to be a character you love, it has to be who you can do’.\n\n‘It’s pop culture and people you know,’ she says.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nAs for whether she regrets doing David Attenborough? No way.\n\nAdvertisement\n\nAdvertisement\n\nIn fact, there’s a high probability he may end up seeing the moment if Sum Ting’s friends have their way.\n\n‘I have been watching David since I was 10, I listen to him as I fall asleep, I have watched Planet Earth and Deep Sea, all of them, I love classic David Attenborough, I just love him,’ she says.\n\n‘The point is to embody the character and be funny and I think he is funny. I have watched him be interviewed by Graham Norton and he is hilarious but in a very sweet way.\n\n‘A lot of friends of mine don’t watch Drag Race but are scientists and ecologists – they call him Sir David – and they said they will send it around their next EU ecology meeting and “Sir David will see this”, and I am like “whaaaat!”\n\n‘If I ever meet him I would die.’\n\nSum Ting Wong decided to impersonate David Attenborough on Snatch Game (Picture: BBC)\n\nSum Ting lives in London but is ‘first-generation born Chinese-Vietnamese heritage’ and originally from Birmingham.\n\nIn the first episode of the season, she told her fellow queens that her parents did not know she was gay, nor that she had made drag a career.\n\nHowever, since appearing on the show, she has come out to them – and revealed that it was the ‘fairytale coming out’ of which she had always dreamed.\n\n‘I called my dad and said “I am bringing my boyfriend back this weekend” and he said “what, you mean girlfriend?” and then he said “ok see you this weekend”. For me, we come out every day as LGBT people, in new jobs, at the bus stop – we come out all the time – so I didn’t want it to be a whole moment. I wanted it to be nothing so I gave it as nothing,’ she reveals.\n\nAdvertisement\n\n‘I called my mum and told her I was bringing home my boyfriend and she was like “yeah you said twice, what food do you want?”‘\n\nA queen (Picture: Getty)\n\nWhen Sum Ting’s father finally met the boyfriend though, she admits he was brutally honest: ‘My dad told him “I always wanted a daughter-in-law”, completely honest, “but I guess now I have four sons instead of three”.\n\n‘And that was the fairytale I could have asked for. They didn’t have to accept it straight away but the fact he said that proves he is trying his best.’\n\nThe response to the show, and her appearance has also made her reevaluate the importance of representation on the screen.\n\n‘I didn’t want to be on the show because I was Asian, I don’t want to be just a box ticked – we were cast for our own merits,’ she says.\n\n‘But then being on it, as first-generation born Chinese-Vietnamese heritage it does mean a lot and I’ve only realised now watching it back… the messages and support form people, young kids from Birmingham with religious or ethnic backgrounds all saying “I am in the same situation as you, you are me”, and it’s nice to hear, it makes me feel incredible.\n\nAdvertisement\n\n‘I never went on [the show] to become a role model so having people reach out if really touching, it’s beautiful.\n\n‘And I am not saying everyone needs to come out or stay in the closet but even if my parents didn’t accept me, I had an LGBT family I picked myself who will always love me.’\n\nRuPaul’s Drag Race UK continues on Thursday nights on BBC Three.\n\nMORE: Mum saves over £400 on LEGO table for son by making it herself for just £16\n\nMORE: Rebekah Vardy thanks husband Jamie for ‘faith, trust and loyalty’ amid Coleen Rooney drama", "description": "RuPaul's Drag Race UK: Sum Ting Wong praises Geri Horner amid criticism.", "authors": ["Rebecca Lewis"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_88188931-e1572024859346_1572026013.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-25"}