{"pub": "nationalreview", "url": "https://nationalreview.com/corner/two-more-points-on-whether-the-ultra-rich-pay-less-in-taxes-than-the-poor", "downloaded_at": "2019-10-20 00:07:31.196217+00:00", "title": "Taxing the Rich: Saez and Zucman Face Two More Critics", "language": "en", "text": "Yesterday I had a piece about this issue, explaining the massive backlash that a New York Times article and the book that inspired it have sparked among economists. The central claims here, that the American tax system is essentially flat and that the ultra-rich pay lower tax rates than the poor, have suffered two more blows worth adding.\n\nFirst, Matthew Lilley points out a problem with an important aspect of the book’s methodology. It doesn’t count governmental transfers as income, but it does count sales taxes when quantifying the tax burden. So if someone earns just $1,000 on his own, receives $9,000 from the government, spends the full $10,000, and pays a 5 percent sales-tax rate, his $500 in taxes is treated as taking 50 percent of his income. This means “that if welfare to the poor is increased, this will be measured as an increased tax rate.” Indeed, the book’s authors removed some people from the data to avoid making their results even more absurdly skewed.\n\nSecond, Laurence Kotlikoff has a piece in the Wall Street Journal that adds some more criticisms. Most important, he explains his attempt with two co-authors to figure out how progressive the tax-and-benefit system is “on a remaining-lifetime basis.” Here’s how he summarizes the results:\n\nI’ll focus on 40-year-olds, but the results are similar for all age groups. Each dollar of pretax remaining lifetime resources of those in the top 1% of the resource distribution is, on average, taxed on net at a 34.5% rate. For those in the top quintile, the average net tax rate is 28.4%. For those in the bottom quintile, every dollar of pre-tax resources is matched by a 46.6% net subsidy. (The tax rises steadily to 4.2% for the second quintile, 12.6% for the third and 18.5% for the fourth.)", "description": "Matthew Lilley points out a problem with an important aspect of the book's methodology. It doesn't count governmental transfers as income, but it does count sales taxes when quantifying the tax burden.", "authors": ["Robert Verbruggen", "Jim Geraghty", "Alexandra Desanctis", "David French", "Mona Charen", "Rich Lowry", "Victor Davis Hanson", "Mairead Mcardle", "Jack Crowe", "Read More"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/rich-people-income-inequality.jpg?resize=300%2C300&ssl=1", "published_at": "2019-10-19"}