{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/6/sharpie-gate-new-russia", "downloaded_at": "2019-09-06 12:17:10.396287+00:00", "title": "Sharpie-gate is the new Russia", "language": "en", "text": "ANALYSIS/OPINION:\n\nWell move over Russia collusion, Russia obstruction of justice, Russia conspiracy. And move over race card, gender card and all that President Donald Trump hates the immigrants type of messaging. There’s a new scandal that’s seized Washington, D.C.\n\nIt’s called — Sharpie-gate.\n\nAnd it’s bound to be the tool by which Democrats will finally, at long last, ultimately and with nothing but sighs of relief all around, Take. Down. Donald. Trump.\n\nOr not.\n\nRegardless: Just look at all these headlines. Just take in all this coverage.\n\n“Perfect storm: Media pound Trump over ‘Sharpie-gate’ hurricane map,” Fox News reported just this Friday.\n\nAnd this, a day earlier, from CNN: “Trump called Fox News correspondent into Oval Office to argue he wasn’t wrong about Alabama.”\n\nAnd this, from the Los Angeles Times: “Why Trump’s hurricane map overshadowed CNN’s climate town hall.”\n\nAnd this, from The Washington Post: “Trump’s insistence that his incorrect Alabama tweet was correct tips into the Orwellian.”\n\nAnd this, from Popular Science: “What the president can teach us about reading hurricane forecasts.”\n\nAnd this, from GovExec.com: “Play of the Day: The President and Weather Maps.”\n\nAnd this, from the Salt Lake Tribune, an opinion piece from Eugene Robinson: “Trump’s bogus weather map embodies the man.”\n\nAnd this, again from Fox News: “Sunny Hostin suggests Trump could be charged with felony for claim about Hurricane Dorian’s path.”\n\nEven Democrat presidential hopeful Mayor Pete Buttigieg took a time-out from his campaign trail to comment about the — crisis? — to say, as CNN’s headline put it: “Buttigieg: ‘I feel sorry for the president’ after he showed apparently altered hurricane map.”\n\nSharpie-gate has turned into the crime of the century, a media whirlwind driven by a “we got you now, Mr. President” kind of attitude.\n\nTrump, of course, isn’t helping calm coverage with his tweets. But then again, in the end, who gives a rat’s you know what?\n\nHurricane Dorian is steadily plowing up the East Coast. Alabama seems safe — as Alabama itself tweeted some days ago.\n\n“Alabama will NOT see any impacts from #Dorian,” NWS Birmingham tweeted. “We repeat, no impacts from Hurricane #Dorian will be felt across Alabama. The system will remain too far east.”\n\nGood news.\n\nBut here’s an interesting message retweeted by Trump just recently. It’s from Alabama’s National Guard, sent out on Aug. 30, and it goes: “#HurricaneDorian is projected to reach southern Alabama by the early part of the week. We are watching closely and #ready to act. Are you?”\n\nSigh.\n\nSharpie-gate. The new Russia? Hmm, guess not.\n\nOh well, perhaps there’s a pencil-gate out there, just waiting in the wings.\n\n• Cheryl Chumley can be reached at [email protected] or on Twitter, @ckchumley.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Well move over Russia collusion, Russia obstruction of justice, Russia conspiracy. And move over race card, gender card and all that President Donald Trump hates the immigrants type of messaging. There's a new scandal that's seized Washington, D.C. It's called -- Sharpie-gate.", "authors": ["The Washington Times Http", "Cheryl K. Chumley"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/06/trump_47307_c0-0-4939-2879_s1770x1032.jpg?1de1d225a9022c826587ea195f65f8a0f83d74ea", "published_at": "2019-09-06"}