{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/bellator-231-steve-mowry-another-submission-win-added-resume", "downloaded_at": "2019-10-26 02:12:26.585856+00:00", "title": "Watch 6-foot-8 Steve Mowry add another submission win to his resume at Bellator 231", "language": "en", "text": "UNCASVILLE, Conn. – Heavyweights are usually known for their knockouts, so it’s not entirely common you come across a 6-foot-8 heavyweight with the takedown and grappling skills of Steve Mowry.\n\nFriday night at Bellator 231, Mowry (7-0 MMA, 3-0 BMMA) defeated Gegard Mousasi protege Gokhan Saricam (4-1 MMA, 0-1 BMMA) in the second round of their preliminary fight.\n\nAfter he absorbed a few hard shots from the Netherlands native, Mowry decided to go back to his roots. Despite dragging the fight to the ground in Round 1, he wasn’t able to put away Saricam.\n\nIn Round 2, Mowry took his undefeated opponent to the ground again. This time, he saw the opening he was looking for and seized the moment. Mowry grabbed a hold of Saricam’s arm and cranked it behind his back. With the brutal torque on his shoulder and arm, it didn’t take long for Saricam to tap out.\n\nThe submission was Mowry’s fifth and it marked his seventh career finish.\n\nMowry’s performance seemingly impressed Bellator president Scott Coker, who tweeted out a video of Mowry’s submission. Check out the video below:\n\nThe Blue Corner is MMA Junkie’s blog space. We don’t take it overly serious, and neither should you. If you come complaining to us that something you read here is not hard-hitting news, expect to have the previous sentence repeated in ALL CAPS.", "description": "Friday night at Bellator 231, Steve Mowry defeated Gokhan Saricam in the second round of their preliminary card fight.", "authors": ["Nolan King", "The Blue Corner", "Farah Hannoun", "Simon Samano", "Matt Erickson", "Mmajunkie Staff", "Mike Bohn"], "top_image": "https://usatmmajunkie.files.wordpress.com/2019/10/steve-mowry-bellator-231-tbc.jpg?w=640&h=420&crop=1", "published_at": "2019-10-26"}