{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7547441/Bella-Thorne-new-girlfriend-Alex-Martini-hold-hands-head-Toronto-airport.html", "downloaded_at": "2019-10-07 20:40:47.329499+00:00", "title": "Bella Thorne and new girlfriend Alex Martini hold hands as they head out of Toronto airport", "language": "en", "text": "She declared her new relationship status on Instagram Sunday afternoon with a sultry topless photo.\n\nAnd Bella Thorne seemed to be in great spirits as she headed off on another adventure out of the Toronto International Airport holding hands with Alex Martini.\n\nThe 21-year-old actress donned a cozy black sweatsuit as she walked hand-in-hand through the terminal with her set production assistant girlfriend.\n\nLove is in the air: Bella Thorne seemed to be in great spirits as she headed off on another adventure out of the Toronto International Airport holding hands with Alex Martini\n\nBella kept her famous figure under wraps wearing an over-sized back sweatshirt with matching track pants.\n\nShe stepped out into the airport in fuzzy black slides and socks, and walked her pet pooch Tampon on a pink leash.\n\nThe Her and Him director hid her auburn hair underneath a grey beanie with the Canadian flag plastered across the front and appeared to be makeup-free.\n\nHappiness: The 21-year-old actress donned a cozy black sweatsuit as she walked through the terminal with her set production assistant girlfriend\n\nBreak: Bella made sure to grab a quick cigarette before heading into the airport\n\nClassic: Shortly after her airport stint, the Shake It Up star stripped down to a white bra and matching shorts for a series of social media snaps\n\nAlex walked by her new lady love wearing a grey ensemble complete with skinny jeans, a zipped-up hoodie and the bright yellow Converse trainers featured in Bella's latest saucy snaps.\n\nShortly after her airport stint, the Shake It Up star stripped down to a white bra and matching shorts for a series of social media snaps.\n\n'TOMORROW I TURN 22,' she shared to her 21million followers, with the #Libra hashtag to follow.\n\nBella made things Instagram official on Sunday when posing topless with her new gal pal.\n\n'TOMORROW I TURN 22,' she shared to her 21million followers, with the #Libra hashtag\n\nHug it out: Bella made things Instagram official on Sunday when posing topless with her new gal pal\n\n'She’s very cute,' Thorned captioned the image while the ladies cuddled in bed. 'first girl I have dated that’s camera shy'\n\n'She’s very cute,' Thorned captioned the image while the ladies cuddled in bed. 'first girl I have dated that’s camera shy.'\n\nDespite her new romantic interest, things are still going strong with Bella's Italian boyfriend Benjamin Mascolo.\n\nMascolo, of the Italian pop duo Benji and Fede, seemed to comment in support of the women, marking another polyamorous relationship for the star.\n\nBenjamin, who she's been dating since April and was last seen with back in September, commented 'You girls are cute.'", "description": "The 21-year-old actress donned a cozy black sweatsuit as she walked hand-in-hand through the terminal with her set production assistant girlfriend.", "authors": ["Tracy Wright For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/18/19407730-0-image-a-67_1570470798746.jpg", "published_at": "2019-10-07"}