{"pub": "aljazeera", "url": "https://aljazeera.com/programmes/listeningpost/2019/09/perspective-youtube-radicalisation-rebel-media-190929065716435.html", "downloaded_at": "2019-10-01 15:54:56.119836+00:00", "title": "The right perspective? YouTube, radicalisation and Rebel Media", "language": "en", "text": "It might surprise you to learn that one of the internet's most influential far-right publications comes out of Canada.\n\nIn 2015, The Rebel Media - founded by longtime Canadian pundit and political operative Ezra Levant -launched and quickly latched onto the monumental rise of YouTube, carving themselves a considerable online presence.\n\nIn four short years, the network cultivated an impressive lineup - the who's who of the far-right: from homegrown Canadian provocateurs like Faith Goldy, Lauren Southern and Gavin McInnes; to international agitators like Sebastian Gorka, Jack Posobiec, Laura Loomer, Katie Hopkins and Tommy Robinson.\n\nCollectively, these high-profile contributors, as well as numerous others, have helped to tally up nearly half a billion views and 1.2 million subscribers on YouTube.\n\nThe Rebel Media's sales pitch is simple: They claim to tell \"the other side of the story\" - the side the mainstream media are too afraid to tell. But what that actually translates into is an obsession with controversial subjects championed by the far right.\n\n\"I would say anti-Muslim, anti-immigrant, anti-refugee, anti-climate, anti-liberal, anti a lot of things,\" says Amira Elghawaby, a board member of the Canadian Anti-Hate Network. \"And unlike a real news organisation they don't look for balance. They don't look to try to actually find out what's really going on. But they simply try to create narratives and anger that really get people riled up. And sort of looking for conspiracies. Everywhere.\"\n\nCaleb Cain, an American 26 year old from West Virginia, used to devour its content.\n\n\"When I first found The Rebel Media it was through Lauren Southern,\" Cain told The Listening Post's Flo Phillips and Ryan Kohls. \"She went out and held up a sign and basically criticised feminism and said that feminism was the death of the West.\"\n\nFrom there, Cain confesses he went down a Rebel Media rabbit hole on YouTube and some of his views became radicalised.\n\n\"I believed in this conspiracy theory called white genocide,\" said Cain. \"And the theory goes something like Muslims and people from the Third World with low IQs and bad dangerous cultures are coming in and purposely invading Western society in efforts to replace it. And I really bought into this and it created a lot of fear for me.\"\n\nThe success of The Rebel Media is undoubtedly connected to the ubiquitous platform that YouTube provides. Prior to 2015, The Rebel's founder Levant had relied on more traditional avenues to express his views like the now-defunct Sun News Network. With the advent of YouTube however, the need for a high-tech studio and the watchful eye of broadcasting standards disappeared.\n\n\"The fact is YouTube allows someone to find an audience for content that is both more extreme and very frequently less factual than conventional mass media would be,\" says Jonathan Goldsbie, editor at Canadaland. \"YouTube as far as I'm concerned is perhaps, even more than Facebook, the most powerful force for radicalisation, misinformation and propaganda that the world has ever seen.\"\n\n\"Not surprisingly, many have made a career out of it. In cases like The Rebel people have made a business out of it,\" Goldsbie added.\n\nThe Rebel's short tenure has not been without controversy. In 2017, one of its most popular contributors, Goldy, was fired after her sympathetic coverage of the Charlottesville protests in the United States, and a subsequent appearance on a neo-Nazi podcast that went viral. In quick succession, numerous contributors and supporters backed away.\n\nPerhaps even more damaging to The Rebel's reputation has been its connection to violent acts; acts like the Finsbury Park Mosque attack in London, the Quebec City mosque shooting, and in Fredericton, New Brunswick, the murder of two police officers. In all three instances, the men involved watched The Rebel Media and had become convinced Muslims were invading their countries.\n\n\"We see horrific mass killings. And I think that there's an idea that wants to sort of dismiss those instances as you know just weird fringe acts,\" says Jared Holt an investigative reporter at Right Wing Watch. \"But I think that's kind of the logical conclusion of this. If you're teaching people that people in their community are trying to destroy them, to upend their idea of culture, I think it's almost you know a logical next step that some people will choose to act on it.\"\n\nProduced by:\n\nFlo Phillips and Ryan Kohls\n\nContributors:\n\nMichael Coren - Former host, Sun News Network, columnist & broadcaster\n\nJonathan Goldsbie - Editor, Canadaland\n\nAmira Elghawaby - Board member, Canadian Anti-Hate Network\n\nJared Holt - Investigative reporter, Right Wing Watch\n\nCaleb Cain - Former Rebel Media viewer\n\nSource: Al Jazeera", "description": "How far-right outlet Rebel Media uses YouTube as a powerful force for radicalisation, misinformation and propaganda.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/9/29/3eeee88b5f8347fb9d48986e0988d8c2_18.jpg", "published_at": "2019-09-29"}