{"pub": "thestreet", "title": "Jim Cramer: The World of Short Squeezes", "url": "https://realmoney.thestreet.com/jim-cramer/jim-cramer-the-world-of-short-squeezes-15061046", "language": "en", "published_at": "2019-08-21", "downloaded_at": "2019-09-03 00:56:37.576074+00:00", "text": "What does it mean when you see the stock of Target (TGT) up 19% or a Lowe's (LOW) up 10%? How can the stock of Nvidia (NVDA) be up another five points after moving up relentlessly last week? Does it signal that there are major changes afoot? That there's a sudden reorganization or a big positive in the macro world that's descending right to the micro, or the actual stock?\n\nNo, not at all. These moves, while they would have been pronounced no matter what because of a series of upside earnings surprises and better than expected forecasts, are really the results of short squeezes and for those of you not aware of this world, it's time you learned lest you think that there's something magical going on.\n\nFirst, understand that at all times there are hedge funds making gigantic bets on individual companies. They do so because they are paid to make money in good or bad tapes. They can't just show a small beat of the S&P 500 because they often get paid as much as 2% for giving it to them and 20% of your gains. Two and 20 is the rule.\n\nWhat many a hedge fund does these days is try to merge the top down with the bottoms up and throw in some reporting, largely anecdotal, and some supposition. Plus you always are supposed to have the wind at your back: in this market many hedge funds believe we are going to have a recession so retail is particularly vulnerable.\n\nSo,, let's take the cases of Lowe's and Home Depot (HD) , its bitter opponent. There were hedge fund managers out there who decided to take a paired position: long Home Depot short Lowe's. It made sense. Just like if you are at the track, you look at the last performance and for Lowe's is was wanting. If you were on the very good call yesterday from Home Depot no one could fault you for suspecting that Home Depot took share from Lowe's.\n\nSo it made plenty of sense. When the news came out this morning about the strength of Lowe's - across ever aisle and in every geography - the trade was blown. When you are a trader you know that discipline trumps conviction. When you have a busted trade you have to go in and cover at any price. That's why you could see the stock up $10 in the pre-market. That's just disciplined short-sellers covering.\n\nTarget has a different set of circumstances. There was a two-fold case against Target: 1, That it can't compete with Amazon (AMZN) and Walmart (WMT) because it doesn't have the scale, and 2., It would be hurt by the tariffs - be tarrafied - because it has so much imported from China materials.\n\nAs a denizen of good Targets, I had a suspicion that it would be a terrific quarter which is why I included it in WATCH - Walmart, Amazon, Target, Costco (COST) and Home Depot. The new stores and the small formats are fantastic, as is the Shipt same day delivery system. Those were enough to blow away those concerns were way wrong. Target's stock was a totally wayward short that was dead on arrival, so the covering began way before the open.\n\nOh, and the macro people look pretty foolish now because the wind seems to be of the tail not a head variety.\n\nFinally, Nvidia. Here's a company that had a series of subpar quarters with products that were supposed to be either too early for their time - Ray tracing - or in the thick of the data center which is regarded as weakening. But when the company reported you heard those concerns ameliorated. Moreover, its artificial intelligence and inference chips are the hottest out there. A real good short at $280 becomes a nightmare at $140, $160 and now $170, and it's not done going higher.\n\nRemember, shorts are great fuel for exaggerated moves. I don't like to bet against shorts - that's a fool's game as they often know more than you. But when a short is crowded and wrong you can make the biggest money possible, save for a takeover, and that's what you are getting with the stocks of Lowe's, Target and Nvidia.\n\n(Nvidia, Home Depot and Amazon are holdings in Jim Cramer's Action Alerts PLUS member club. Want to be alerted before Jim Cramer buys or sells NVDA, HD or AMZN? Learn more now.)", "description": "Remember, shorts are great fuel for exaggerated moves....TGT", "authors": ["Jim Cramer", "The World Of Short Squeezes", "Remember", "Shorts Are Great Fuel For Exaggerated Moves.", "Stocks Quotes In This Article", "Paul Price", "Kevin Curran", "Doug Kass", "Bruce Kamich", "Jim"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/66cef9c1-a1ba-11e9-928d-ff9a12cf3fcc.jpg"}