{"pub": "yahoo", "url": "https://news.yahoo.com/u-forces-withdrawing-syria-iraq-081543102.html", "downloaded_at": "2019-10-24 02:29:00.811598+00:00", "title": "Iraq says U.S. forces withdrawing from Syria have no approval to stay", "language": "en", "text": "By Ahmed Rasheed and Idrees Ali\n\nBAGHDAD/PRINCE SULTAN AIR BASE, Saudi Arabia (Reuters) - U.S. forces that crossed into Iraq as part of a pull-out from Syria do not have permission to stay and can only be there in transit, the Iraqi military said on Tuesday.\n\nU.S. Defense Secretary Mark Esper said, however, that Washington aimed eventually to bring the troops withdrawing from Syria back to the United States.\n\nThe Iraqi military statement contradicted the Pentagon's announcement that all of the nearly 1,000 troops withdrawing from northern Syria are expected to move to western Iraq to continue the campaign against Islamic State militants and to help defend Iraq.\n\n\"All U.S. forces that withdrew from Syria received approval to enter the Kurdistan Region so that they may be transported outside Iraq. There is no permission granted for these forces to stay inside Iraq,\" the Iraqi military said.\n\nEsper said Washington's objective was for the troops not to remain in Iraq.\n\n\"The aim isn't to stay in Iraq interminably, the aim is to pull our soldiers out and eventually get them back home,\" Esper said at the Prince Sultan Air Base near Riyadh, Saudi Arabia.\n\nEsper said the details had not yet been worked out on how long the U.S. troops would stay in Iraq and he would be having discussions with his Iraqi counterpart on Wednesday.\n\nIt is unclear whether the U.S. troops will use Iraq as a base to launch ground raids into Syria and carry out air strikes against Islamic State militants.\n\nThe additional U.S. troops would add to the more than 5,000 American troops based in the country, training Iraqi forces and helping to ensure that Islamic State militants do not make a comeback.\n\n\n\n\n\n\"NOT A MERCENARY FORCE\"\n\nEsper, speaking in front of a Patriot missile battery where he was meeting U.S. troops, said Saudi Arabia had agreed to help underwrite the deployment to the kingdom. He did not provide details on what specifically Saudi Arabia had agreed to pay for.\n\nThe United States has deployed thousands of additional military forces in recent months to bolster Saudi defenses, including an air expeditionary wing and air defense personnel.\n\nThat includes radar systems, Patriot missiles and support personnel to bolster Saudi Arabia’s defenses after the largest-ever attack on the kingdom’s oil facilities on Sept. 14.\n\nSome experts have criticized President Donald Trump's administration for saying that Saudi Arabia will pay for the deployment of U.S. troops to the Kingdom, suggesting it makes the U.S. military a mercenary force.\n\nTrump has repeatedly said that Saudi Arabia would pay for the recent U.S. deployments.\n\n\"We are not a mercenary force,\" Esper said.\n\n\"Mercenary forces do things for the pay, we are doing this (to).. help defend our allies, second to deter Iran so we don't have increasingly bad behavior, and third defend the international rules based order,\" he added.\n\nEsper's trip to Saudi Arabia comes as U.S.-Iran tensions have risen to new highs since May 2018, when the Trump administration withdrew from an international accord that put limits on Tehran's nuclear program in exchange for easing sanctions.\n\nEsper said he had spoken with allies like France and Germany about contributing to air defenses in the Gulf and would be discussing it with NATO partners this week.\n\n\n\n\n\n(Reporting by Ahmed Rasheed in Baghdad and Idrees Ali in Prince Sultan Air Base, Saudi Arabia; Writing by Ahmed Aboulenein; Editing by Angus MacSwan and Ed Osmond)", "description": "BAGHDAD/PRINCE SULTAN AIR BASE, Saudi Arabia (Reuters) - U.S. forces that crossed into Iraq as part of a pull-out from Syria do not have permission to stay and can only be there in transit, the Iraqi military said on Tuesday. U.S. Defense Secretary Mark Esper said, however, that Washington aimed eventually", "authors": ["Ahmed Rasheed", "Idrees Ali"], "top_image": "https://s.yimg.com/uu/api/res/1.2/LiFGD6lHMQoyJflPUYW2xw--~B/aD01MzM7dz03OTk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/3abc8b25d2976b24964bd4ebec114419", "published_at": "2019-10-22"}