{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7572193/Comedian-Kathy-Griffin-slams-Trump-murder-spree-parody-video.html", "downloaded_at": "2019-10-14 23:24:29.325626+00:00", "title": "Comedian Kathy Griffin slams The Trumpsman murder spree parody video", "language": "en", "text": "Comedian Kathy Griffin has voiced outrage over the disturbing pro-Trump parody video that depicts her being savagely beheaded with an ax.\n\nHer brutal killing in the shocking video entitled The Trumpsman, which was played at a conference hosted by conservative group American Priority at the Trump National Doral Miami, is a reference to the infamous photo in 2017 where she posed with Donald Trump's bloody severed head.\n\n'I'm depicted as being murdered by the President of the United States in this video,' Griffin tweeted Sunday evening, slamming the unsettling video. However in the clip Trump doesn't kill her himself, a character portrayed as CNN does.\n\n'The left, right & center left me hanging out to dry regarding the Trump mask photo. Please don’t let it happen again. No, this video isn’t a joke to his followers. And it will not be taken as such,' she added.\n\nComedian Kathy Griffin has slapped the Trumpsman parody video that shows him on a killing spree, murdering his rivals and news organizations. In the disturbing clip she's beheaded with an axe\n\nThe parody uses her likeness from her infamous 2017 photo holding what's supposed to be Donald Trump's bloody severed head\n\nShe slammed the clip on Sunday saying 'I'm depicted as being murdered by the President of the United States in this video. Please don’t let it happen again. No, this video isn’t a joke to his followers'\n\nThe clip went viral after the New York Times reported Sunday that the video was played at a Trump event last week.\n\nThe Trumpsman depicts Trump violently killing his political opponents and media organizations inside a church called 'Church of Fake News'.\n\nThe bloody video edits a scene from the 2014 Colin Firth spy movie Kingsman: The Secret Service and superimposes Donald Trump slaughtering dozens of characters inside the church.\n\nThe clip edits the victims of the massacre to be political rivals like John McCain, Barack Obama, Bernie Sanders, Hillary Clinton, Rosie O'Donnell, Kathy Griffin, and media organizations including NPR, Huff Post, The Washington Post, Buzzfeed, and CNN.\n\nOne of Trump's allies in the clip is Harvey Weinstein who chokes Bill Clinton.\n\nAfter posing the severed head Trump photo in 2017, Griffin faced severe backlash and lost marketing sponsorship and was fired from her New Year's Eve broadcast on CNN\n\n'I’ll be watching to see if anyone has the balls this to advocate for me this time,' she tweeted\n\nThe White house condemned the video after it went viral Sunday night\n\nTrump's 2020 campaign says it had nothing to do with the video and does not condone violence.\n\nAmerican Priority said the clip was shown as part of a meme exhibit and was 'not associated with or endorsed by the conference in any official capacity'.\n\nDonald Trump Jr., his former spokeswoman Sarah Huckabee Sanders, and Florida Governor Ron DeSantis attended that event.\n\nGriffin was outraged with the video as her own comedic photo posing with Trump's severed head led to the downfall of her career.\n\n'I get asked in interviews \"what’s WAS the hardest part of the photo scandal?\" Now this #TrumpVideo. I never broke the law, or violated the 1A. I’ll be watching to see if anyone has the balls this to advocate for me this time...publicly. Hello???' Griffin said on Twitter.\n\nMany on Twitter came to Griffin's defense after the Trumpsman clip went viral, pointing out suffered damage to her career for making a violent joke, and the Trump supporters behind the clip should face consequences\n\nShe reposted and shared a slew of tweets expressing outrage with the Trump parody, pointing out the double standards of people complacent with the clip, when her infamous 2017 photo sparked furious backlash for propagating violence against political opponents and led to a lull in her career.\n\nGriffin was quick to call out the political figures who tried to come to her defense.\n\n'Oh yes, countless cable political pundits will all be running to my defense,' she tweeted.\n\nDonald Trump 'strongly condemns' the video, his spokesperson said Monday morning.\n\nA gruesome, violent video which depicts Donald Trump killing members of the media and Democrats in a 'church of fake news' was screened during an event attended by the president's supporters at his Miami resort last week\n\nThe video is an edited version of the church massacre scene from the 2014 film Kingsman: The Secret Service. Trump's head is superimposed on the body of the film's star, Colin Firth, who goes on to kill the parishioners who are depicted as media entities\n\nThe graphic clip shows Trump shooting and stabbing the parishioners as well as prominent Democrats and media personalities\n\n'Re: the video played over the weekend: The @POTUS @realDonaldTrump has not yet seen the video, he will see it shortly, but based upon everything he has heard, he strongly condemns this video,' White House press secretary Stephanie Grisham tweeted on Monday morning.\n\nThe president, who was active on Twitter Monday morning, has not yet personally addressed the video.\n\nSeveral news organizations and the White House Correspondents Association called on the president to disavow the video after its existence was revealed Sunday night.\n\n'The images depicted are vile and horrific,' CNN, one of the news organizations depicted, said Sunday night in a statement.\n\nThe event at Trump's resort in Miami was attended by former White House Press Secretary Sarah Huckabee Sanders (left); Florida Governor Ron DeSantis (center); and the president's eldest son, Donald Trump Jr (right)\n\nA spokesperson for Trump's re-election campaign says the campaign had nothing to do with the clip. The Trump National Doral Miami is seen in the above stock image\n\n'The president and his family, the White House, and the Trump campaign need to denounce it immediately in the strongest possible terms. Anything less equates to a tacit endorsement of violence and should not be tolerated by anyone.'\n\nSanders and an individual close to Don Jr told the Times that they did not see the video in question.\n\n'I was there to speak at a prayer breakfast, where I spoke about unity and bringing the country together,' Sanders told the Times.\n\n'I wasn't aware of any video, nor do I support violence of any kind against anyone.'\n\nDeSantis has yet to comment on the matter.", "description": "Comedian Kathy Griffin has slammed the Trumpsman parody video that shows him on a killing spree and depicts her getting beheaded by CNN.", "authors": ["Marlene Lenthang For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/18/19704322-0-image-a-49_1571075166931.jpg", "published_at": "2019-10-14"}