{"pub": "businessinsider", "url": "https://pedestrian.tv/sponsored-jobs/feature-jobs-mushroom-group-rusty-surfboards-rocket-comms-more", "downloaded_at": "2019-10-18 04:51:44.698696+00:00", "title": "FEATURE JOBS: Mushroom Group, Rusty Surfboards, Rocket Comms + More", "language": "en", "text": "Are you a fan of music and are an excellent communicator? Then Mushroom Group have the perfect role for you! They are seeking a full-time PR/Communications Coordinator (MELB) to publicise tours and events for industry leaders, Frontier Touring, Chugg Entertainment, Illusive Presents and many more. A typical day in this role would consist of securing interview and editorial placements, monitoring and compiling media coverage reports and attending events. You will need to have a minimum of 2 years paid experience in a music or media role and be a team player. Are you interested? Then apply now!\n\nRusty Surfboards are on the look out for a full time Store Manager at their Warringah Mall store. Candidates will need to be excellent salespeople, leaders and motivators who are ready to take the next step in their career. The benefits of working with Rusty Surfboards include a great place to work, generous salary (including clothing allowance!) and flexibility. If this role catches your fancy, then apply here.\n\nAre you ready for a new and exciting opportunity in the communications world? Then look no further because Rocket Comms are hiring a full time PR Account Manager (SYD) to work on accounts such as Oz Comic-Con, Pax and Oktoberfest. The ideal candidate will need to have 3+ years experience, be result driven and have great media relationships. A plus would be that you also like pop culture, technology and beer! Tasks range from event activation, influencer marketing, sampling, stunts and social media management. Go ahead and apply here if you are interested in knowing more!\n\nDid not find what you were looking for? Check out more roles below:\n\nNelson O’Neill, a Melbourne-based digital marketing agency require a full time SEO Technical Specialist. Apply here.\n\nThe Township, a social media agency for the beauty and consumer goods industry are searching for a full time Web Developer (MELB). Apply today.\n\nWonder Smile are currently disrupting the dental industry by offering the latest treatments and need a full time Mid-Weight Graphic Designer (SYD). Apply here.\n\nStill searching? Find out more about our ethical jobs & non-for-profit jobs, jobs in WA and our jobs in Sydney, Perth, Melbourne, Brisbane, Adelaide, Gold Coast and more.\n\nFollow us on Facebook, Twitter, LinkedIn and get yourself signed up to our Daily Job Alerts.\n\nFor employers looking to Post a Job, click here.", "description": "", "authors": ["Yasmin Adhami"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/09/Featured-JOBS-Header_13.jpg", "published_at": "2019-10-18"}