{"pub": "nytimes", "url": "https://nytimes.com/2019/10/10/books/nobel-literature.html", "downloaded_at": "2019-10-11 00:21:30.001648+00:00", "title": "Olga Tokarczuk and Peter Handke Awarded Nobel Prizes in Literature", "language": "en", "text": "Mr. Handke, who is from Austria and whose mother was Slovenian, has espoused nationalistic views, and has publicly expressed doubt about the massacres of Muslims during the Balkans War. Ms. Tokarczuk has been a frequent critic of right-wing nationalists in Poland, who have branded her a traitor. Her Polish publisher at one point hired bodyguards to protect her.\n\nSome prominent authors, among them Hari Kunzru and Salman Rushdie, were critical of the choice of Mr. Handke, who could not be reached through his American publisher.\n\nMs. Tokarczuk, for her part, seemed untroubled. In an interview with the Polish newspaper Gazeta Wyborcza on Thursday, Ms. Tokarczuk said she was happy to receive the Nobel alongside Mr. Handke. “I am also very happy that Peter Handke has received the award with me, I value him very much,” she said. “It’s great that the Swedish Academy appreciated literature from the central part of Europe. I am glad that we are still holding on.”\n\nIn awarding the prizes to two renowned European authors, the academy seemed to brush off criticism it has received in the past that the prize had become too Western and Eurocentric. Since the literature prize was first awarded in 1901, the vast majority of winners have been European and English-language authors.\n\nWomen have also been underrepresented historically. Ms. Tokarczuk is the 15th woman to win the Nobel for literature, out of 116 laureates.\n\nSome observers in the literary world anticipated that the academy would select at least one non-European writer this year, perhaps awarding the prize to one of the often-cited favorites, among them the Kenyan novelist Ngũgĩ wa Thiong’o, the Chinese writer Can Xue or the Syrian poet Adunis.\n\nIn a statement this year, Anders Olsson, who leads the academy’s literature committee, conceded that diversity should be more of a priority and indicated that the committee would take geographic diversity and gender into account in making its selection.", "description": "The 2018 and 2019 laureates were named at the same time because last year’s prize was postponed over a scandal involving a husband of an academy member.", "authors": ["Alex Marshall", "Alexandra Alter"], "top_image": "https://static01.nyt.com/images/2019/10/10/world/10nobel2/10nobel2-facebookJumbo.jpg", "published_at": "2019-10-10"}