{"pub": "guardian", "url": "https://theguardian.com/sport/2019/sep/17/world-rugby-cvc-six-nations-premiership-deal", "downloaded_at": "2019-09-17 11:25:32.787893+00:00", "title": "World Rugby admits concerns over proposed CVC and Six Nations deal", "language": "en", "text": "World Rugby officials have expressed their concern at the potential implications of Europe’s major rugby-playing nations signing a game-changing new deal with a private equity firm. A proposed package worth around £300m is said to have been agreed in principle between the Six Nations and CVC, which would also mean the latter owning a 15 % share of autumn and summer tour commercial rights.\n\nSouth Africa reveal scope of random drug testing at Rugby World Cup Read more\n\nWith CVC, previously involved in Formula One, having already bought into the Gallagher Premiership and looking to tie up a further partnership deal with the Guinness Pro14, the prospect of radical alterations to the existing international and club structure is steadily increasing, potentially undermining World Rugby’s authority as the sport’s governing body.\n\n“Someone who is as big an investor in the sport as a private equity firm like CVC will create influence. That is something that in some areas could concern us,” said Brett Gosper, World Rugby’s chief executive. “When you have a high-funding commercial owner of the sport that isn’t the governing body then certain calls can be made which we might think aren’t in the interests of the sport’s growth, player welfare or other areas. We would want to make sure things are being done for the right reasons and that our influence wasn’t usurped.”\n\nWorld Rugby will now be pressing for further details, having previously failed to reach their own agreement with CVC to back their rejected World League proposal which would have involved the world’s leading 10 nations playing against each other to create more interest in non-World Cup years. “The Six Nations have decided to take another route but I’d have to say we don’t know enough about the ins and outs of that deal,” said Gosper.\n\n“We can’t really comment at this stage whether it’s good or bad. But many of our biggest members have welcomed this increased funding and so we can only recognise it as a positive. We just have a couple of concerns and I’m sure we’ll have a chance to discuss those with CVC and the Six Nations. Given the recent positions CVC have taken in the game it would be madness for us not to be in some source of communication with them. We all want a healthy, growing sport.”", "description": "World Rugby officials have expressed their concern at the potential implications of Europe’s major rugby-playing nations signing a game-changing new deal with a private equity firm", "authors": ["Robert Kitson"], "top_image": "https://i.guim.co.uk/img/media/d180d95bc60db9eba78ecd337f220779b0b9259d/0_71_4331_2598/master/4331.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d7212efecba69ce26f01f80832157515", "published_at": "2019-09-17"}