{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/09/what-is-situation-north-eastern-syria-turkey-kurds", "downloaded_at": "2019-10-09 18:30:56.209587+00:00", "title": "What is the situation in north-eastern Syria?", "language": "en", "text": "Who is in control in north-eastern Syria?\n\nThe region makes up more than a quarter of the entire country and is the largest area outside of the control of the Syrian president, Bashar al-Assad, and his allies. It is controlled by the Syrian Democratic Forces (SDF), which comprises militia groups representing a range of ethnicities, though its backbone is Kurdish. The Kurds are an ethnic group of about 30 million people spread across the Middle East who have been fighting for their own state for more than a century.\n\nTurkey’s president, Recep Tayyip Erdoğan, on Wednesday announced an invasion of territory with the intention of forcing the SDF out of at least a 20-mile “safe zone” below its border, or from as far south as Raqqa and Deir ez-Zor.\n\nHow did the SDF come to control the region?\n\nBefore the SDF was formed in 2015, the Kurds had created their own militias who mobilised during the Syrian civil war to defend Kurdish cities and villages and carve out what they hoped would eventually at least become a semi-autonomous province within Syria.\n\nIn late 2014, the Kurds were struggling to fend off an Islamic State siege of Kobani, a major city under their control.\n\nEnter the US. The Americans had been desperately searching for a reliable partner to help them fight Isis. They had spent $500m training and equipping other Syrian rebel groups without success. In the Kurds – effective fighters, whose political leaders were secular and advocated modern values such as gender equality – they saw a group with whom they could ally.\n\nWith US support, including arms and airstrikes, the Kurds managed to beat back Isis and went on to win a string of victories against the radical militant group. Along the way the fighters absorbed non-Kurdish groups, changed their name to the SDF and grew to include 60,000 soldiers.\n\n“Without [the SDF], President Donald Trump could not have declared the complete defeat of Isis,” said Gen Joseph Votel, the American commander of operations in Syria who struck the alliance with the Kurds in 2015. The SDF suffered 11,000 casualties in the battle against Isis.\n\nFacebook Twitter Pinterest An SDF commander waves the group’s flag in Raqqa, formerly an Isis stronghold. Photograph: Bülent Kılıç/AFP/Getty Images\n\nWhy does Turkey oppose the Kurds?\n\nFor years, Turkey has watched the growing ties between the US and SDF with alarm. Significant numbers of the Kurds in the SDF were also members of the People’s Protection Units (YPG), an offshoot of the Kurdistan Workers’ party (PKK) that has fought an insurgency against the Turkish state for more than 35 years in which as many as 40,000 people have died. The PKK initially called for independence and now demands greater autonomy for Kurds inside Turkey.\n\nTurkey claims the PKK has continued to wage war on the Turkish state, even as it has assisted in the fight against Isis.\n\nThe PKK is listed as a terrorist group by Turkey, the US, the UK, Nato and others and this has proved awkward for the US and its allies, who have chosen to downplay the SDF’s links to the PKK, preferring to focus on their shared objective of defeating Isis.\n\nWhat are Turkey’s objectives on its southern border?\n\nTurkey aims firstly to push the SDF away from its border, creating a 20-mile (32km) buffer zone that would have been jointly patrolled by Turkish and US troops until Trump’s recent announcement that American soldiers would withdraw from the region.\n\nErdoğan has also said he would seek to relocate more than 1 million Syrian refugees in this “safe zone”, both removing them from his country (where their presence has started to create a backlash) and complicating the demographic mix in what he fears could become an autonomous Kurdish state on his border.\n\nHow would a Turkish incursion impact on Isis and stability of the wider Middle East?\n\nNearly 11,000 Isis fighters, including almost 2,000 foreigners, and tens of thousands of their wives and children, are being held in detention camps and hastily fortified prisons across north-eastern Syria.\n\nThe SDF has been pleading for international assistance in dealing with these prisoners, who countries including the US, UK and Australia have been reluctant to take back – in some cases cancelling the citizenship of prisoners.\n\nFacebook Twitter Pinterest A guard at the al-Hawl refugee camp in northern Syria. Photograph: Achilleas Zavallis/The Guardian\n\nSDF leaders have warned they cannot guarantee the security of these prisoners if they are forced to redeploy their forces to the frontlines of a war against Turkey. They also fear Isis could use the chaos of war to mount attacks to free their fighters or reclaim territory.\n\nThere has been speculation that SAS and French special forces present in Rojava region of northern Syria would be tasked with securing the camp perimeters if the Kurds withdrew. However, with only several hundred troops between them, their numbers would need to be quickly boosted by regular soldiers to avoid a catastrophic collapse in security.\n\nA Turkish invasion could also open the door for Russian and Syrian forces to invade SDF territory from the west, or else prompt the SDF to form an alliance with the Assad regime and its allies to protect the mostly Kurdish force from Turkey’s advance. That could increase the influence of Assad’s Russian and Iranian partners in the region and grant them access to north-east Syria’s lucrative oil fields.\n\n", "description": "Turkey has begun an offensive in an area controlled by the Kurdish-led SDF", "authors": ["Michael Safi"], "top_image": "https://i.guim.co.uk/img/media/7cbe7f2f058099457c5245e563cd2508d846c6ca/0_172_3333_2000/master/3333.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=91b75c85d80e0841e4fc5997ee93291f", "published_at": "2019-10-09"}