{"pub": "independent", "url": "https://independent.co.uk/news/world/asia/trump-north-korea-missile-tests-kim-jong-un-latest-a9089591.html", "downloaded_at": "2019-09-03 23:49:20.784015+00:00", "title": "Trump attacked by US intelligence officials for dismissing fears over North Korea missile tests", "language": "en", "published_at": "2019-09-03", "text": "As North Korea fired off a series of missiles in recent months – at least 18 since May – President Donald Trump has repeatedly dismissed their importance as short-range and “very standard” tests. And although he has conceded “there may be a United Nations violation,” the president says any concerns are overblown.\n\nKim Jong Un, North Korea’s leader, Trump explained recently, just “likes testing missiles.”\n\nNow, American intelligence officials and outside experts have come to a far different conclusion: that the launchings downplayed by Mr Trump, including two late last month, have allowed Kim to test missiles with greater range and maneuverability that could overwhelm US defences in the region.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nJapan’s defence minister, Takeshi Iwaya, told reporters in Tokyo last week that the irregular trajectories of the most recent tests were more evidence of a program designed to defeat the defences Japan has deployed, with US technology, at sea and on shore.\n\nMr Kim’s flattery of Trump with beguiling letters and episodic meetings offering vague assurances of eventual nuclear disarmament, some outside experts say, are part of what they call the North Korean leader’s strategy of buying time to improve his arsenal despite all the sanctions on North Korea.\n\nShape Created with Sketch. North Korea's pervasive leaders: the Kim portraits Show all 16 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. North Korea's pervasive leaders: the Kim portraits 1/16 In the Democratic People's Republic of North Korea, portraits of former supreme leaders Kim Il Sung and Kim Jong Il are required by law to be hung in the home, the classroom, the factory and all manner of other private and public places Reuters 2/16 In the classroom AFP/Getty 3/16 In the living room AFP/Getty 4/16 In the maternity ward of the hospital Alamy 5/16 On board the ship Reuters 6/16 At the ballot box Mannen av börd 7/16 In the office AFP/Getty 8/16 On the bridegroom Reuters 9/16 On the Pyongyang subway Reuters 10/16 On a government building Reuters 11/16 In the teacher training facility AFP/Getty 12/16 In Kim Il Sung square in Pyongyang Reuters 13/16 In the home AFP/Getty 14/16 At the military parade Reuters 15/16 In the hall Reuters 16/16 At the Chinese border AFP/Getty 1/16 In the Democratic People's Republic of North Korea, portraits of former supreme leaders Kim Il Sung and Kim Jong Il are required by law to be hung in the home, the classroom, the factory and all manner of other private and public places Reuters 2/16 In the classroom AFP/Getty 3/16 In the living room AFP/Getty 4/16 In the maternity ward of the hospital Alamy 5/16 On board the ship Reuters 6/16 At the ballot box Mannen av börd 7/16 In the office AFP/Getty 8/16 On the bridegroom Reuters 9/16 On the Pyongyang subway Reuters 10/16 On a government building Reuters 11/16 In the teacher training facility AFP/Getty 12/16 In Kim Il Sung square in Pyongyang Reuters 13/16 In the home AFP/Getty 14/16 At the military parade Reuters 15/16 In the hall Reuters 16/16 At the Chinese border AFP/Getty\n\nThe rapid improvements in the short-range missiles not only put Japan and South Korea in increased danger but also threaten at least eight US bases in those countries housing more than 30,000 troops, according to an analysis of the missile ranges by The New York Times.\n\nSuch missiles, experts say, could be designed to carry either conventional or nuclear warheads.\n\n“Kim is exploiting loopholes in his agreements with President Trump pretty brilliantly,” said Vipin Narang, a political-science professor at MIT who studies North Korean weapon advances. “These are mobile-launched, they move fast, they fly very low, and they are maneuverable.\n\nThat’s a nightmare for missile defence. And it’s only a matter of time before those technologies are migrated to longer-range missiles.”\n\nMr Trump says that Mr Kim committed to him during a meeting in Singapore 14 months ago that he would refrain from testing intercontinental ballistic missiles and conducting nuclear tests while negotiations are underway, and he has kept those promises even though there have been no substantive talks since a second summit in Hanoi, Vietnam, in February resulted in an impasse.\n\nBut North Korean state-run media made clear last week that the country feels no such limits when it comes to improving other missile technologies, saying it would never accede to the West’s demand “for disarmament under pressure and appeasement of ‘international society'.”\n\nFor his part, Mr Kim has not been shy about touting the latest missile advances, attending many of the tests and releasing photographs of post-launch celebrations with his missile brain trust, a group of officers who have steadily continued weapons development while diplomacy has sputtered.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nAn estimate by the Defence Intelligence Agency, circulated to select officials inside the US government this summer, estimates that the North has also produced enough fuel for roughly a dozen new nuclear weapons since the historic talks in Singapore.\n\nOther intelligence agencies have “more conservative numbers,” one former senior official said, but all point to an expanding cache of bombs.\n\nDefence Secretary Mark Esper told reporters Wednesday that “we are concerned” about North Korea’s missile tests, but that “we’re not going to overreact” in the interest of preserving efforts at a diplomatic solution.\n\nEven so, Secretary of State Mike Pompeo, who has taken the lead in the effort to rid North Korea of its nuclear weapons and missiles, has hinted to foreign counterparts in private meetings in recent weeks that he is fearful the administration is being strung along, according to Japanese and South Korean officials.\n\nIn public, Mr Pompeo is more circumspect. He recently told CBS, “We haven’t gotten back to the table as quickly as we would have hoped, but we’ve been pretty clear all along we knew there would be bumps along the way.”\n\nThe bumps, though, have gotten much larger in recent months as the North began lobbing missile after missile aloft, testing at least three new varieties. The tests have showcased the North’s ability to consistently launch solid-fuel missiles that are easier to hide in the mountains and which could be quickly deployed on mobile launchers and fired before the United States could respond.\n\n“Kim understands what he is doing,” said Mr Narang, the MIT professor. “He likely thinks Mr Trump can live with a nuclear North Korea as long as they don’t test ICBMs and nuclear weapons, which would humiliate Mr Trump and take away the perception he has achieved some kind of victory” with his diplomacy.\n\nAdministration officials dispute that view and say the tests are a symptom of a North desperately trying to end “maximum pressure,” which is how Mr Pompeo describes the sanctions the United States has imposed on the country. And there is some evidence for his position: North Korea’s official media recently described the secretary of state as a “die-hard toxin.”\n\nIf there is any lesson to be taken from the latest North Korean provocations, it is that Mr Kim clearly has a maximum pressure strategy of his own.\n\nIn 2015 and 2016, the country’s missile tests were failing at an astoundingly high rate. Some intelligence officials and outside experts tied at least some of those setbacks to a covert Pentagon effort to sabotage the launches with cyber and electronic strikes.\n\nBut by 2017, Mr Trump’s first year in office, Mr Kim had adopted new designs and conducted 14 successful launches, mostly of medium- and long-range missiles, for the first time raising the spector that he might be able to reach all of the United States.\n\nAt the same time, he conducted a series of nuclear tests, including of its largest weapon yet, which he described as a hydrogen bomb.\n\nThose successes prompted Mr Trump to first warn of “fire and fury like the world has never seen,” then to begin the diplomatic dance towards the Singapore summit last year, the first time a sitting American president had met any member of the Kim family. After the meeting, Mr Trump said that North Korea was on the road to disarmament, telling reporters he expected they would see major results within six months.\n\nFor almost a year afterward, Mr Kim appeared to refrain from firing missiles, perhaps in the hope that the Mr Trump administration would ease sanctions.\n\nThen the diplomacy stalled at the second summit, in Hanoi. Mr Kim offered to close the North’s major nuclear complex at Yongbyon — but not other nuclear facilities or any missile sites — in return for the lifting of the most severe sanctions. Trump rejected that offer at the insistence of Mr Pompeo and John R. Bolton, his hawkish national security adviser.\n\nMr Kim now appears to be reverting to the tactic that worked for him two years ago: escalating tests to demonstrate new capabilities.\n\n“Their stock-in-trade has always been to press the edge of the envelope and see what they can get away with,” said Vann H. Van Diepen, a top official on weapons of mass destruction in the Office of the Director of National Intelligence until 2009.\n\nThe recent bout began in early May when the North fired a 30-foot-tall missile from an eight-wheeled truck. Analysts said it was a solid-fuel rocket that can be launched in minutes – unlike liquid-fuelled missiles, which can take hours of preparation.\n\nIn all, the North conducted eight flight tests of the new missile in May, July and August. Its maximum range was found to be roughly 430 miles, according to the Center for Nonproliferation Studies, a private group in Monterey, California.\n\nThe missile, if perfected, could target all of South Korea, including at least six US bases, and parts of southern Japan, including two large bases.\n\nNorth Korea debuted another type of missile in late July and early August, along with a new launching system. Mr Van Diepen, the former top American official on weapons of mass destruction, described the system in 38 North, a respected publication on North Korea, as a new generation of weapon that could fire an unknown number of missiles simultaneously. The older type could fire eight.\n\nThe range of the newly tested missile, he wrote, was 155 miles, about 40 miles farther than the older version. Mr Van Diepen said it would increase the North’s ability to subject US and South Korean targets to “saturation attacks,” which can also defeat antimissile defences.\n\nNorth Korea tested a third new missile twice in early August. Analysts have yet to determine what advances it might represent.\n\nThen, late last month, the North fired two projectiles from what it called a “super-large multiple rocket launcher.” Narang of MIT said the system appeared new, making it perhaps the fourth missile system to debut this year and another iteration of a multiple rocket launcher.\n\nNew York Times", "description": "As North Korea fired off a series of missiles in recent months – at least 18 since May – President Donald Trump has repeatedly dismissed their importance as short-range and “very standard” tests. And although he has conceded “there may be a United Nations violation,” the president says any concerns are overblown. Kim Jong Un, North Korea’s leader, Trump explained recently,", "authors": ["David E Sanger", "William J Broad"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/03/09/trump-kim.jpg"}