{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7507429/Derby-captain-Richard-Keogh-broke-wrist-injured-knee-car-crash.html", "downloaded_at": "2019-10-05 06:57:58.580158+00:00", "title": "Derby County captain Richard Keogh 'broke his wrist and injured his knee' in car crash", "language": "en", "text": "Derby County have warned their stars will 'pay a heavy price' after a night of drinking ended in a car crash that saw two players charged with drink-driving and captain Richard Keogh suffer a season-ending injury.\n\nTom Lawrence and Mason Bennett will appear in court next month after they were arrested by police on Tuesday night following the incident shortly before midnight, which saw Lawrence's Range Rover hit a lamppost after colliding with Bennett's Mercedes.\n\nThe crash, which has left Keogh with a knee injury as well as reported damage to his wrist, came after a 'small group' of Derby players stayed out following a team night of bowling, dinner and drinks.\n\nRichard Keogh is out for the rest of the season after he injured his knee in a car collision\n\nDerbyshire Road Policing Unit tweeted a picture of the wreckage from their account\n\nKeogh, Lawrence and Bennett were among those who continued drinking and turned down the offer of being driven home by cars provided by the club, who have promised a 'rigorous internal investigation'.\n\n'Some senior players made a very bad example and a very bad choice. They made a big mistake and there will be consequences,' said manager Phillip Cocu on Thursday.\n\nHis comments came after Derby released an explosive statement slamming their own players, saying they 'cannot, and do not, condone (their) actions'.\n\nCocu will on Friday make a decision on whether Lawrence or Bennett feature in Saturday's game against Birmingham and the club insisted that while those involved will 'pay' for their actions, the players would be supported 'with their rehabilitation back into the squad and team.'\n\nThe statement read: 'The players were out as part of a scheduled team-building dinner with staff and while the majority of them acted responsibly and left at around 8pm and were not involved, a small group, including the team captain Richard Keogh, continued drinking into the night.\n\n'They should have known when to stop and also ignored the opportunity to be driven home using cars laid on by the club, and chose to stay out. As a result of an alcohol-related incident, Richard Keogh has sustained a serious knee injury that will prevent him from playing until the end of the season.\n\n'The players involved in the incident on Tuesday evening will be subject to a rigorous internal investigation under the club’s code of conduct and disciplinary procedures, but over and above any punishment they receive we will be expecting them to become involved with the excellent work the Community Trust does helping the communities we serve.\n\nTom Lawrence was taken to hospital after the collision but fortunately escaped without injury\n\nMason Bennett (top) was the other player involved and Derby are investigating the incident\n\n'We have been very clear about our attitude towards alcohol and the players know that at certain and specific times of the season they are permitted a drink together as a group in a controlled environment.\n\n'Those involved in Tuesday’s incident know they will pay a heavy price for their actions, but also that we will support them with their rehabilitation back into the squad and team.'\n\nFull details of the evening are emerging but Cocu revealed on Thursday: 'We had a team-building activity planned. The first idea was to play some golf but the weather was bad so we went bowling instead.\n\n'After the bowling we had a team dinner, sitting with each other for most of the evening. Most of the players left about 8pm but a small group stayed and continued at the bar.'\n\nBennett and Lawrence will appear at Southern Derbyshire Magistrates Court on October 15\n\nRepublic of Ireland international Keogh, 33, moved to Derby in July 2012 and has made 356 appearances for the Rams.\n\n'I've spoken to Richard briefly and he is extremely down,' the Derby boss continued. 'He realises what has gone wrong for him personally, he feels responsible. It will have a huge effect on him personally.'\n\nTom Huddlestone will captain the side in the defender's absence.\n\nWinger Lawrence was taken to hospital as a precaution after the crash but escaped serious injury.", "description": "Derby County have warned their stars will 'pay a heavy price' after a night of drinking ended in a car crash that saw two players charged with drink-driving and Richard Keogh suffer a season-ending injury.", "authors": ["Daniel Matthews For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/26/14/18966450-0-image-a-2_1569505400972.jpg", "published_at": "2019-09-26"}