{"pub": "atlantic", "url": "https://theatlantic.com/entertainment/archive/2019/09/gauff-osaka-and-williams-us-open-womens-draw/597283", "downloaded_at": "2019-09-03 23:39:57.724440+00:00", "title": "The Thrilling Unpredictability of Women’s Tennis", "language": "en", "published_at": "2019-09-03", "text": "On one hand, the parity that characterizes women’s tennis today is thrilling. There’s no shortage of exceptional players to root for, and an undeniable frisson springs from the idea that it’s impossible to forecast who might prevail at the biggest tournaments. Bencic, whose win marked the third time she has defeated Osaka this season, is a wonderfully gifted ball striker with a counterpunching style predicated on her uncanny ability to redirect opponents’ powerful shots. Elina Svitolina, the highest-ranked player left in the women’s draw, overwhelmed the former U.S. Open finalist Madison Keys in the fourth round with an impressive display of athleticism and consistency from the back of the court. Nineteen-year-old Bianca Andreescu is the youngest woman still in contention, and her victories this season at Indian Wells and against an injured Williams at the Rogers Cup suggest that she may be on the precipice of a career breakthrough. To say that women’s tennis is genuinely unpredictable at the moment would be to state the very obvious.\n\nOn the other hand, it’s been impossible to watch this year’s U.S. Open and not get the sense that fans are quietly desperate for the emergence of a dominant champion to replace Williams, the 37-year-old GOAT candidate whose body of work eclipses the combined accomplishments of just about all other active players. (Williams will play Qiang Wang in the quarterfinals; if Williams wins the tournament, she’ll tie Margaret Court’s all-time grand-slam singles-title record.) The anticipation that surrounded the Osaka-Gauff match was partially motivated by the idea that those young women are poised to one day take over the sport from Williams and become the sort of repeat champions against whom every other player can benchmark themselves and their games.\n\nWomen’s tennis now is somewhat reminiscent of the men’s game at the turn of the century, a time of transition between the glory days of Pete Sampras and the onset of the current Roger Federer–Rafael Nadal–Novak Djokovic era. That brief time is not often spoken about in reverent terms, because many of the grand-slam champions it produced—players such as Thomas Johansson and Juan Carlos Ferrero—are generally, and unfairly, considered insignificant footnotes in the sport’s history. Like Sampras in those years, Williams is the icon whose presence continues to loom large. But she is likely nearing the end of her career, and it’s impossible to look at the current roster of women’s tennis and say with any certainty who will succeed her.\n\nPrior to the start of this year’s U.S. Open, ESPN aired a segment of an interview with Williams’s coach, Patrick Mouratoglou, in which he claimed that the controversy that engulfed the 2018 singles final between Williams and Osaka was “fantastic for tennis” because it generated an incredible amount of attention. His reasoning betrays a sense that, at the end of the day, star power more so than parity is what makes sports interesting to follow. That match became front-page news, not just because a chair umpire took the drastic step of issuing a game penalty during one of the most important matches of the year—and between two women of color. It also became the stuff of legend and infamy because it involved Williams, one of the most transcendent athletes ever. Had a chair umpire acted in an identical manner during a grand-slam final between, say, Simona Halep and Petra Kvitová, two accomplished but not historically great players, the reaction likely wouldn’t have been quite so uproarious.\n\nWilliams is the last bona fide superstar left in the women’s draw. If she advances to the final, there’s a chance that match will generate more interest than the Osaka-Gauff contest and be remembered as the greatest moment of the tournament. If not, the women’s final may be well played, but it probably won’t live up to last year’s match. That’s because parity, while commendable, isn’t quite as enthralling as watching dynastic talents spar on a sport’s biggest stages.", "description": "This year’s U.S. Open has no shortage of female players who could win the title, which has made for an exciting tournament—with one caveat.", "authors": ["Kevin Craft"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/RTS2OE49/facebook.jpg?1567532183"}