{"pub": "investing.com", "url": "https://au.investing.com/news/stock-market-news/chix-wants-more-oversight-of-australias-asx-blockchain-system-1981969", "downloaded_at": "2019-10-30 07:57:36.475907+00:00", "title": "CHI-X wants more oversight of Australia's ASX blockchain system", "language": "en", "text": "© Reuters. CHI-X wants more oversight of Australia's ASX blockchain system\n\nSYDNEY, Oct 30 (Reuters) - Chi-X Australia wants the country's competition regulator to look into the implications of blockchain technology for share trading and to arbitrate disputes with the Australian Securities Exchange .\n\nThe Australian markets operator has said it would replace its registry, settlement and clearing system with blockchain technology to cut costs for customers and is currently testing the platform.\n\nChi-X Australia, which handles a fifth of all share trading volume in the country, on Wednesday raised concerns the switchover to blockchain technology would disadvantage it.\n\nThe ASX's project, one of the world's most ambitious of its kind, will replace Australia's main bourse's Clearing House Electronic Subregister System (CHESS) into one using distributed ledger technology by April 2021. Chi-X, ASX's largest client and its only competitor, fears the new system would give the Australian-listed bourse an unfair advantage, company executives told a media briefing.\n\n\"There's a substantial moat around the ASX clearing and settlement business...and the CHESS replacement project is perhaps making it bigger,\" said Michael Somes, Chi-X General Counsel.\n\n\"It would be very difficult for the competition to bridge that moat - I'm not saying it won't happen... but it needs to be regulated as if it won't.\"\n\nThe move to blockchain will make the Australian Securities Exchange one of the biggest mainstream financial markets to use the relatively new ledger system, best known as the technology underpinning the bitcoin cryptocurrency.\n\nChi-X, owned by New-York headquartered J.C. Flowers, says it handles about 20% of share trading volumes in Australia and depends entirely on the ASX for clearing services.\n\nThe company is concerned the ASX could use the project to gain further advantages in areas where it competes with Chi-X.\n\n\"There should be a legislative framework whereby the Australian Competition and Consumer Commission can act as an arbitrator on disputes,\" Somes said. \"That should happen as soon as possible.\"\n\nA spokesman for the ASX said the issue was a \"matter for government\".\n\n\"We are continuing to engage closely with government and regulators, including the ACCC, throughout our CHESS replacement programme. We are focused on building a platform for the future that will stimulate further innovation and competition.\"\n\nMedia representatives for the competition watchdog did not immediately return requests for comment.", "description": "CHI-X wants more oversight of Australia's ASX blockchain system", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB65083_L.jpg", "published_at": "2019-10-30"}