{"pub": "breitbart", "url": "https://breitbart.com/tech/2019/10/10/oberlin-college-will-appeal-25-million-defamation-verdict", "downloaded_at": "2019-10-10 18:27:08.177133+00:00", "title": "Oberlin College Will Appeal $25 Million Defamation Verdict", "language": "en", "text": "Oberlin College announced this week that it is filing an appeal on the Gibson’s Bakery defamation case, which resulted in a $25 million jury verdict against the school.\n\nAccording to a press release, Oberlin College has assembled a team of high-profile attorneys to challenge the outcome of its high profile defamation case. In the case, an Ohio jury ruled that Oberlin College should pay $25 million over the college’s role in a smear campaign against local business Gibson’s Bakery.\n\nBreitbart News has reported extensively on Gibson’s Bakery’s legal battle with Oberlin College. Gibson’s Bakery sued the college after administrators engaged in a smear campaign against the bakery, calling it “racist” over an incident at the bakery that involved two black Oberlin students. The problem? Both students admitted in a court of law that race did not play a role in the shopkeeper’s response to their shoplifting attempt.\n\nOberlin argues that the verdict poses a threat to the First Amendment. Oberlin hired First Amendment attorneys Lee Levine and Seth Berlin, an adjunct professor at Georgetown University, to defend them in the upcoming appeal.\n\n“The verdict and judgment in this case set a precedent that endangers free speech on campuses and for all Americans,” Levine said in a comment used in the press release. “The jury was allowed to award substantial damages for speech that is protected by the Constitution. The case should absolutely be reviewed by an appellate court.”\n\nBenjamin Sassé, an appellate attorney who will also work with Oberlin’s legal team, argues that Ohio’s free speech protections should have kept the case out of court from the beginning.\n\n“This case never should have gone to the jury in light of the heightened speech protections in the Ohio Constitution, and the trial court made several procedural errors during trial that led to this verdict. Among other things, those errors prevented jurors from hearing critical information about the original incident,” Sassé said in a short comment.\n\nGibson Bakery’s attorney Lee Plakas has a different perspective on the case. Plakas argued this week that Oberlin is “hiding behind” the First Amendment as a means of defending their abuse of Gibson’s Bakery.\n\n“The jury’s verdict sent a clear message that institutions like Oberlin College should not be permitted to bully others while hiding behind the claimed shield of free speech,” Plakas told a local reporter. “There are no exemptions from the law of defamation – a fact we trust will be confirmed during the appeal process.”\n\nStay tuned to Breitbart News for more updates on this story.", "description": "Oberlin College announced this week that it is filing an appeal on the Gibson's Bakery defamation case, which resulted in a $25 million jury verdict against the school.", "authors": ["Tom Ciccotta"], "top_image": "https://media.breitbart.com/media/2019/06/gibsons-bakery-legal-battle-oberlin-college-file-ap-640x335.jpg", "published_at": "2019-10-10"}