{"pub": "dailymail", "url": "https://dailymail.co.uk/money/cars/article-7473541/Almost-12-000-new-drivers-licences-revoked-points-year.html", "downloaded_at": "2019-10-05 07:39:23.335609+00:00", "title": "Almost 12,000 new drivers had licences revoked for too many points last year", "language": "en", "text": "An average of 33 newly-qualified motorists have their licences taken off them every day in the UK, shocking new stats have revealed.\n\nUnder the New Drivers Act 1995, anyone who racks up more than six penalty points within two years of passing their test will automatically have their licence revoked.\n\nThis happened to 11,953 people in 2018, with two thirds being between the ages of 17 and 24, according to road safety charity, Brake.\n\nRevoked: Under the New Drivers Act 1995, anyone who racks up more than six penalty points within two years of passing their test will automatically have their licence taken off them\n\nThe information was gathered from the Driver and Vehicle Licencing Agency (DVLA) via a Freedom of Information request.\n\nBrake has been campaigning for stricter rules for new drivers in a bid to cut the number of accidents they're involved in.\n\nAccording to official figures, motorists aged 17 to 24 represent nearly a fifth of all drivers killed and seriously injured on the roads despite making up only seven per cent of of all licence holders.\n\nBrake is calling for the introduction of a Graduated Driver Licensing (GDL) system for new drivers, which would include restricted driving hours and a limit on the number of passengers they're allowed to carry while new motorists are still gaining experience.\n\nIt believes this would not only reduce the number of incidents involving recently qualified drivers but also lower the volume of motorists who lose their licence for accumulating too many points in the first 48 months of driving.\n\nThis not only reduces their risk but should save young drivers the expense of having to retake their test.\n\nSome 11,953 new drivers had their licecnes revoked in 2018, with two thirds being between the ages of 17 and 24\n\nJoshua Harris, director of campaigns for the charity, said: 'It's shocking that so many new drivers are racking up enough penalty points to have their licences revoked so soon after passing their test, in particular, those in the 17 to 24 age bracket.\n\n'It clearly demonstrates that we need to make our licensing system more robust so that when a driver passes their test, they have all the necessary tools and knowledge to drive safely on all roads and in all conditions.\n\nIdea to share driving footage with parents A new report by the RAC Foundation said one way to reduce the risk of younger drivers on the road was to force them to have cameras in their vehicles and footage shared with parents so they can monitor their behaviour at the wheel. Studies in America have found that a combined use of dash cams and 'accelerometers' – which record the high G-forces created when a car is driven erratically or dangerously – reduces bad driving, if young novices know the information will be shared with their mum and dad.\n\n'Fortunately, there is a proven solution which can deliver this, graduated driver licensing.'\n\nThe GDL scheme would demand all new motorists to have a 12-month learner period, an initial test, and then a two-year novice period when drivers can drive independently but with restrictions – such as a late-night driving curfew.\n\nMinisters announced in the recent Road Safety Action Plan that they will explore the issue of Graduated Driver Licensing further in a bid to cut new driver crashes.\n\n'The Government's announcement that they will explore the issue of GDL further is welcome,' added Harris.\n\n'Swift and decisive action must, however, be taken to introduce GDL across the UK, as a priority to ensure new drivers have the skills and experience they need and to end the tragedy of young people dying on our roads.'", "description": "Under the New Drivers Act, anyone who racks up more than 6 penalty points within 2 years of passing their test will automatically have their licence revoked. This happened to 11,953 people in 2018.", "authors": ["Rob Hull For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/09/17/15/18583558-0-image-a-36_1568731957686.jpg", "published_at": "2019-09-18"}