{"pub": "cbs", "url": "https://cbsnews.com/news/nature-up-close-the-massive-decline-of-bird-populations", "downloaded_at": "2019-10-07 19:48:53.371967+00:00", "title": "Nature up close: The massive decline of bird populations", "language": "en", "text": "By \"Sunday Morning\" contributing videographer Judy Lehmberg.\n\nBirds are the most-studied group of animals on Earth, in part because of the ease of finding them and the proliferation of citizen scientists-bird enthusiasts. But even expert ornithologists who have studied them were surprised by a study recently published in the journal Science, which found that bird populations have declined 29% in the U.S. and Canada since 1970 – a much faster rate than previously realized.\n\nIncluding accidentals and introduced species, there are 1,121 bird species in North America north of Mexico. Some of those species have decreased much more than 29%. The common blue jay is down to 20% of what it was 50 years ago. Even the common grackle's numbers have gone down 50%.\n\nNorth America has lost 3 billion birds in the last 50 years\n\nMost species have declined, except ducks and geese; their numbers have actually increased. Why? Because waterfowl hunters became concerned about their decline well over 100 years ago and began doing something about it, by forming organizations such as Ducks Unlimited. It not only buys and protects wetlands; it also encourages the creation of conservation easements on private land which protects the conservation value of the land. It has also encouraged legislation, such as including wetlands restoration and conservation in the federal Farm Bill.\n\nMany other species of wetland birds have benefitted from Ducks Unlimited's work, but non-wetland species have not, especially grassland birds (down 53%), boreal forest species (down 33%), and western forest birds (down 29%).\n\nAlthough the decline is staggering, there are ways to stop it, or at least slow it down. The successes that waterfowl species have seen can be adapted for other habitats – and habitat is the key word here. The major reason for bird species decline is loss of habitat, especially grasslands and forests. But other problems exist as well, including deadly pesticides, particularly neonicotinoids (which kill bees as well as birds); feral cats (who along with domestic cats allowed outside kill several billion birds a year); collisions with buildings, cell phone towers, electricity generating windmills and powerlines; and, of course, global warming.\n\nA current bill in the U.S. House of Representatives, the Recovering America's Wildlife Act, would direct about $1.4 billion a year to improving both state and tribal habitat conservation. That along with expanding some of the Farm Bill conservation programs that saved so many ducks and geese would go a long way to increasing bird populations.\n\nAmong the most colorful North American songbirds are in the New World wood warbler family. There are 56 species in the U.S. and Canada. Half of those warblers can be seen below. All have experienced declines in some areas since the 1960s and '70s, and further declines are anticipated, due to habitat loss and deforestation, and climate change.\n\nClockwise from upper left: American redstart, blackburnian warbler, worm-eating warbler, and hooded warbler.\n\nClockwise from upper left: MacGillivray's warbler, blackpoll warbler, Louisiana waterthrush, and bay-breasted warbler.\n\nClockwise from upper left: Tennessee warbler, prothonotary warbler, black and white warbler. and magnolia warbler.\n\nClockwise from upper left: common yellowthroat, Kentucky warbler, northern parula, and black-throated green warbler.\n\nClockwise from upper left: golden-winged warbler, blue-winged warbler, chestnut-sided warbler, and ovenbird.\n\nClockwise from upper left: Lucy's warbler, female yellow warbler, hermit warbler, and black-throated gray warbler.\n\nClockwise from upper left: painted redstart, red-faced warbler, Townsend's warbler, and yellow-rumped warbler.\n\n\n\n\n\n\n\nFor more info:\n\n\n\nJudy Lehmberg is a former college biology teacher who now shoots nature videos.\n\n\n\nSee also:\n\nTo watch extended \"Sunday Morning\" Nature videos click here!", "description": "The U.S. and Canada have lost 29% of their birds over the past 50 years, as species are subjected to habitat loss, pesticides, predation, and climate change", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/07/076d3a77-6c23-479f-ae55-6a82843afbe6/thumbnail/1200x630/af5a52e92d51bc14a5ede449fc6adc98/prothonotary-warblers-and-worm-eating-warbler-verne-lehmberg-promo.jpg", "published_at": "2019-10-07"}