{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7531999/Teen-Mom-vet-Farrah-Abraham-talks-vibes-billionaire-Jeff-Bezos-Emmys.html", "downloaded_at": "2019-10-05 07:47:20.117015+00:00", "title": "Teen Mom vet Farrah Abraham talks the 'vibes' she had with billionaire Jeff Bezos at the Emmys", "language": "en", "text": "Farrah Abraham revealed that Jeff Bezos oozed confidence when they met at the Emmy Awards during an interview on Thursday's episode of the FoodGod podcast.\n\nThe 28-year-old reality star told podcast host Jonathan Cheban, 45, that other men were 'ducking and diving' away from her at the September 22 awards ceremony in Los Angeles.\n\n'The one other guy who had my same vibe was Jeff Bezos,' Abraham said of the 55-year-old billionaire who is the founder and CEO of Amazon.\n\nPodcast guest: Farrah Abraham is shown with daughter Sophia and Jonathan Cheban last week while appearing on the FoodGod podcast\n\nAbraham told Cheban that she got up to let another actor pass by and noticed how 'secure' Bezos was.\n\n'There's no intimidation, no jealousy, no hatred toward me. I can feel free to say what I need to say and enjoy my time with this person. Not all men give off that confidence,' Abraham said.\n\nThe Teen Mom star shared a selfie with Bezos at the Emmys on Instagram and wrote in the caption that she hoped 'to be in an amazon original soon'.\n\nShe added, 'let's do a deal for my bio pic !'.\n\nSocial media: The 28-year-old reality star shared a selfie with Bezos on Instagram at the Emmys\n\nAbraham admitted to Cheban that she's been been working on her biopic for a year and it's not yet ready to go.\n\nShe also shared her desire to perform stand-up comedy and mentioned taking meetings with Comedy Central.\n\n'I'm here to have a good time and make people laugh,' said Abraham, who brought her 10-year-old daughter Sophia to the interview.\n\nBiopic pending: Abraham, shown September 22 at the Emmy Awards in Los Angeles, said that she's been been working on her biopic for a year and it's not yet ready to go\n\nAbraham also revealed that she often hears that she looks like Cheban's best friend Kim Kardashian, 38.\n\nShe also disapproved of Kim and her half-sister Kendall Jenner, 23, being laughed at while presenting an award at the Emmys.\n\n'A lot of people need to support them. If there's a misconception, like, let it be known. ...We should be lifting women up, embracing women,' Abraham said.\n\n'It's a classy, nice awards show. Let's keep it together people,' she added.\n\nAbraham also announced that she's working on a new jewelry line and Sophia is working on her first music video.", "description": "The 28-year-old reality star revealed that Jeff Bezos oozed confidence when they met at the Emmy Awards during an interview on Thursday's episode of the FoodGod podcast.", "authors": ["Paul Chavez For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/03/06/19239046-0-image-a-6_1570080355333.jpg", "published_at": "2019-10-03"}