{"pub": "yahoo", "url": "https://news.yahoo.com/trump-denies-knowledge-of-air-force-resort-stays-nothing-to-do-with-me-155949352.html", "downloaded_at": "2019-09-09 23:26:03.285639+00:00", "title": "Trump denies knowledge of Air Force resort stays: 'Nothing to do with me'", "language": "en", "text": "President Trump on Monday denied any knowledge of military and government personnel using (and paying for) overnight stays at his Turnberry resort in Scotland after the Air Force ordered an investigation of the practice, which was disclosed Friday by Politico.\n\n“I know nothing about an Air Force plane landing at an airport (which I do not own and have nothing to do with) near Turnberry Resort (which I do own) in Scotland, and filling up with fuel, with the crew staying overnight at Turnberry (they have good taste!). NOTHING TO DO WITH ME,” tweeted Trump.\n\nThe aircraft, carrying supplies to the Middle East, stopped in Scotland both en route and on its return leg, and the five-person crew stayed at Turnberry both nights. Military flights to and from the Middle East more commonly stop for refueling and rest at American bases in Germany or elsewhere in Europe.\n\nWhile Trump referred to one plane in his tweet, the Air Force probe involves allegations of multiple instances of stopovers at the lightly used Prestwick Airport and overnight stays at Trump’s property, around 23 miles away. Over the past several months, the House Oversight Committee has been investigating U.S. military expenditures at and around the Trump property in Scotland, raising questions about a conflict of interest. The property lost $4.5 million in 2017, but revenue went up $3 million in 2018. Politico reporters Natasha Bertrand and Bryan Bender raised the possibility that Trump is trying to keep Prestwick in business and the resort afloat.\n\nI know nothing about an Air Force plane landing at an airport (which I do not own and have nothing to do with) near Turnberry Resort (which I do own) in Scotland, and filling up with fuel, with the crew staying overnight at Turnberry (they have good taste!). NOTHING TO DO WITH ME — Donald J. Trump (@realDonaldTrump) September 9, 2019\n\nQuestions have been raised about the resort’s partnership with Prestwick Airport, where a C-17 military transport plane had stopped earlier this year to refuel. The Pentagon has spent $11 million on fuel at the airport since October 2017, according to a House Oversight Committee letter, while it is cheaper to refuel at a U.S. military base.\n\nAccording to the New York Times, “the Defense Department signed an agreement with the Prestwick airport to serve as a refueling location for military flights in August 2016, during the final months of the Obama administration.” But last year, the Pentagon and the Scottish government sought out a contract to help increase revenue at the airport, according to the Guardian.\n\nTrump also said he “had nothing to do with the decision” of Vice President Mike Pence to stay at a Trump hotel in Doonbeg, Ireland, about 180 miles from his meetings during an official visit in Dublin.\n\n“Mike’s family has lived in Doonbeg for many years, and he thought that during his very busy European visit, he would stop and see his family!” Trump tweeted.\n\nBut last Wednesday, a top aide for the vice president said Trump had offered “a suggestion” for Pence to stay at his property, contradicting the president’s earlier denial that he “had no involvement” in the idea for Pence to stay at his Irish golf resort.\n\nI had nothing to do with the decision of our great @VP Mike Pence to stay overnight at one of the Trump owned resorts in Doonbeg, Ireland. Mike’s family has lived in Doonbeg for many years, and he thought that during his very busy European visit, he would stop and see his family! — Donald J. Trump (@realDonaldTrump) September 9, 2019\n\nMarc Short, Pence’s chief of staff, told reporters that Trump did suggest the vice president stay at the Trump International at Doonbeg. The vice president flew back and forth on Air Force Two for his meetings in Dublin.\n\n“I don’t think it was a request, like a command. I think that it was a suggestion,” said Short. “It’s like, ‘Well, you should stay at my place.’”\n\nThe initial reasoning for staying there, provided by Short, was security: The club is “the size that … we think can accommodate us, and Secret Service can protect us,” and it is “a facility that could accommodate the team.”\n\nBut Pence’s staff changed its explanation after Politico reported that many veterans of the Secret Service protective detail said the logistical issues were irrelevant, and offered that the vice president was staying at the club because it was close to his ancestral home. His great-grandmother had lived there, next door to a castle.\n\n_____\n\nDownload the Yahoo News app to customize your experience.\n\nRead more from Yahoo News:", "description": "President Trump on Monday denied any knowledge of military and government personnel using (and paying for) overnight stays at his Turnberry resort in Scotland.", "authors": ["Kadia Tubman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ei_jQjUSPb_ADedeZKmkSw--~B/aD03NTY7dz0xNDA0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/7e29a660-d31a-11e9-bdab-f850813aaf5d", "published_at": "2019-09-09"}