{"pub": "metro", "url": "https://metro.co.uk/2019/10/17/dimitar-berbatov-admits-liverpool-favourites-manchester-united-s-newcastle-display-10938530", "downloaded_at": "2019-10-18 01:07:44.121417+00:00", "title": "Berbatov admits Liverpool are favourites against Man United after 's***' Newcastle display", "language": "en", "text": "Dimitar Berbatov expects Manchester United to struggle against Liverpool (Picture: Getty)\n\nDimitar Berbatov has conceded that Liverpool are the ‘overwhelming favourites’ to beat his former club Manchester United on Sunday after describing their 1-0 defeat to Newcastle as ‘s***’.\n\nUnited’s loss at St James’ Park prior to the international break has piled the pressure on Ole Gunnar Solskjaer and his players as they currently sit just two points above the relegation zone ahead of this weekend’s games.\n\nIn contrast, Jurgen Klopp’s Liverpool have been in outstanding form, racking up eight straight victories to open an eight-point lead at the top of the Premier League table ahead of Manchester City.\n\nAlthough Berbatov is trying to remain optimistic about United’s chances, he admitted that they face another difficult afternoon unless they can drastically increase the tempo of their attacking play.\n\nManchester United slumped to a dismal defeat to Newcastle before the international break (Picture: Getty)\n\nSpeaking to Betfair, Berbatov said: ‘Based on the form of both teams, where Liverpool and United are in the table and the way they are playing football at the moment, Liverpool are obviously ahead. United will need to be prepared for a very difficult game and the sad part is that Liverpool are overwhelming favourites.\n\nAdvertisement\n\nAdvertisement\n\n‘I try to stay optimistic but it is going to be very difficult for United to get a result if they play the way they did against Newcastle. That was probably the s******* game I have seen them play, honestly, it was painful.\n\n‘It is still early in the season and maybe there is still time to turn things around, to catch up to the top four, there is still time in my opinion but they need to correct the way they are playing football, the way they move into the spaces, how the players are looking for the ball, their speed of the ball when they are passing – these are the things they need to work on.\n\n‘United now have an opportunity to challenge themselves but it is going to be difficult because they have had players on international duty that are only just coming back and they will only have a couple of days to prepare, train and play together.\n\n‘If you look at the tempo and the way United are playing, as a United player you feel s*** and you look at the games that you play and you don’t feel well, but now they need to challenge themselves and this big test is a great way for them to do just that.’\n\nAdvertisement\n\nAdvertisement\n\nAs well as being in poor form, United’s chances of beating Liverpool at Old Trafford have been made harder by the absence of a number of key players including David De Gea and Paul Pogba who are both out injured.\n\nLiverpool, on the other hand, are expected to be at full-strength with Alisson Becker and Joel Matip both returning to full training this week and Mohamed Salah likely to overcome an ankle problem sustained against Leicester City.", "description": "Dimitar Berbatov has conceded that Liverpool are the 'overwhelming favourites' to beat his former club Manchester United on Sunday after describing their 1-0 defeat to Newcastle as 's***'. United's loss...", "authors": ["Metro Sport Reporter"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1153346602_1571337006.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-17"}