{"pub": "yahoo", "url": "https://sports.yahoo.com/eto-apos-o-gives-verdict-075800564.html", "downloaded_at": "2019-10-03 07:44:38.654983+00:00", "published_at": "2019-10-01", "title": "Eto'o gives his verdict on Lukaku to Inter & reveals how he'd stop racism in football", "language": "en", "text": "Legendary striker Samuel Eto’o has backed Romelu Lukaku to be a hit with Inter.\n\nThe Belgium international forward, who was a team-mate of Eto’o’s with Everton during the 2014-15 campaign, moved to the Serie A side from Manchester United for €80 million (£71m/$87m) in the summer.\n\nHis Old Trafford exit was followed by a chorus of criticism that suggested he had been a flop with the Red Devils, with whom he scored 28 Premier League goals in 66 outings.\n\nScroll to continue with content Ad\n\nThe 26-year-old has hit the ground running in Italy, though, netting three times in his first six Serie A games to get back to the one-goal-in-two ratio that distinguished him in previous spells at Anderlecht, West Bromwich Albion and the Toffees.\n\n“I like Lukaku on and off the pitch,” Eto’o told Gazzetta dello Sport. “There are footballers who feel like stars and others who are like normal people - he's in the second group. And you'll see how many goals he'll score. We were together at Everton. He was very young but very intelligent and has said important things about racism.”\n\nRacism is an issue close to Eto’o’s heart and it wounded him to see Inter’s Curva Nord defend Cagliari supporters after they targeted Lukaku for such abuse in a recent fixture.\n\nThe 38-year-old, who had spells with Real Madrid, Barcelona, Inter, Chelsea, Sampdoria and many more during a long and distinguished playing career, believes that there should be a general strike in response to the issue.\n\n“Getting off the field is the right answer,” he said. “Football moves a lot of money but most of the players who generate it are black. If one day, all over the world, with the help of their white colleagues, they decided not to play, that's it: it would change a lot.\n\n“FIFA president Gianni Infantino said something very important on the night of the FIFA Best awards: ‘No more talking: doing.’ The head of world football said that.\n\n“We need rules in football, too, tough rules.\n\n“In future, I’d like to be remembered not as a footballer, but as a guy who brought something to football. And who helped in the fight against racism.”", "description": "The former Barcelona forward says that the only way to stop the issue in the game is for players to walk off the field of play", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/WS25XjcGqyPzXjExshvkQg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/Y0t5bvx6jSqm_7Bd4Fi0KA--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-GB/homerun/uk.goal.com/e1445c21ebe913ea680021e7f9a95945"}