{"pub": "businessinsider", "url": "https://businessinsider.com/mini-retirement-advice-how-to-reenter-workforce", "downloaded_at": "2019-09-16 23:26:18.208220+00:00", "title": "Mini-retirements can help prevent burnout, but returning to the workforce afterward can be tough. Here's how to pull it off, from 4 people who have actually done it.", "language": "en", "text": "The daily grind can be exhausting.\n\nFor some, a mini-retirement — a meaningful respite in which you take a break from your career — can be the right move to overcome burnout and refocus your purpose.\n\nOnce you have enough money saved, leaving work for a mini-retirement can feel like an easy decision. But re-entering the rat race after it's over may be a harder battle to face. However, if you play your cards right, getting back into the workforce is more manageable than it sounds.\n\nHere's what four people who've actually been through the process have to say about it.\n\nTalk to your boss before your mini-retirement.\n\nBefore your mini-retirement, first see what kind of advantages you can set up with your employer.\n\n\"Always try to negotiate taking the time off unpaid from your current employer if you think you might want to return there,\" Jillian Johnsrud, who has taken five mini-retirements, told Business Insider. \"Even if it's without pay or healthcare, it can give you peace of mind while you're gone. I've seen people be granted anywhere from a month to a year off with a promise of a job when they return.\"\n\nYou could even negotiate temporarily reducing your work hours and working remotely instead of fully stopping work. Mark Tew, who moved to Nicaragua with his wife and four children for a year, told Business Insider that with more flexible work arrangements than ever before, it's not uncommon for employers to allow employees to work remotely part-time. Doing this, he said, \"will help you keep your foot in the door.\"\n\n\"I know several people who have successfully made arrangements with their employers to allow them to work remotely through a mini-retirement,\" he said, adding that such a scenario would be a mini-semi-retirement.\n\nRead more: An American family who moved to Nicaragua for a year to live cheaply ended up blowing their $30,000 budget thanks to unexpected costs — but still spent less than life at home in the US\n\nBe good at your job and know your value.\n\n\"Be very good at your job before you leave to take a mini-retirement,\" Kyle Stimpson, who took a six-month mini-retirement at age 27, told Business Insider. \"If you work hard and have talent, companies will always be looking to find great people, so you will have a leg up on the competition. If you don't put in any effort at your old job and then burn bridges as you leave, that will get around and come back to bite you.\"\n\nChris Durheim, who took a year-long mini-retirement, is of a similar mindset.\n\n\"In order to get to the point where you financially could take a mini-retirement, you had to have been pretty successful in your earlier career,\" he told Business Insider. He said he struggled with self-confidence during the job hunting process because he feared he was no longer hireable. He ultimately ended up making a successful transition to a new industry, switching from medical device development to web development.\n\n\"Whether you're feeling the self-confidence or not, know that you're capable of getting back in and that your skills are highly valuable,\" Durheim said. \"Don't be afraid to push for the things that are really important to you in a new career; with your time in mini-retirement, you may find that you value some things differently than you did before. This is a great opportunity to reinforce those new values.\"\n\nJillian Johnsrud (pictured with family) has taken five mini-retirements. Courtesy of Jillian Johnsrud\n\nMaintain your network before, during, and after.\n\nJohnsrud suggests emailing your close contacts to let them know you're leaving; mention how much you loved the field and that you're looking forward to returning to it after your mini-retirement. She recommends keeping it brief, such as: \"I'm excited to be traveling these next six months, but if you happen to hear about an interesting opportunity in this field, I'd love for you to connect me.\"\n\n\"You might get a few great job offers while you're gone,\" she said. \"I've seen people leverage their mini-retirement into much more interesting, better-fitting and well-paid jobs.\"\n\nRead more: Forget early retirement — people who saved enough money to travel for weeks or years say a 'mini-retirement' is just as rewarding\n\nJohnsrud said staying connected to your network while you're gone is just as important — you should touch base every few months to stay on the radar.\n\nStimpson also seconds leveraging your contacts and recruiters to make connections. He returned to work as a sales engineer, which he was able to do by reaching out to recruiters and contacts in his industry. However, he said it helped that he worked in a niche market.\n\n\"One just needs to be consistent and patient,\" he said. \"Keep working new angles and expect for the process to take two to three months at least, which is why it's important to still have sufficient savings left even when you are ready to go back to work.\"\n\nConsider self-employment.\n\nMini-retirement can serve as a good transition to self-employment, Tew said. During his mini-retirement, Tew did tax and accounting work on the side. Once it was over, he pursued his lifelong desire of becoming a CFP and is now self-employed.\n\n\"I remember watching a TED talk called 'The Power of Time Off,' and I believe I experienced some of the things the speaker talked about,\" he said. \"The creative juices flow so much more freely when you get away from it all. You can use that year or that six months to lay the foundation for a new life.\"\n\nHe added: \"With so many US workers already participating in the ' gig economy' by having side freelance work, it's just a matter of taking those side gigs and scaling them up into full-fledged businesses. Either route is doable!\"", "description": "Returning to the rat race after a mini-retirement can be intimidating. Four people who've done it themselves share tips for getting back in the game.", "authors": ["Hillary Hoffower"], "top_image": "https://amp.businessinsider.com/images/5d7594802e22af5321479d34-1920-960.jpg", "published_at": "2019-09-16"}