{"pub": "yahoo", "url": "https://news.yahoo.com/zealand-gun-buyback-exposes-emotions-052010366.html", "downloaded_at": "2019-09-05 02:16:57.120504+00:00", "title": "New Zealand gun buyback exposes emotions, possibly hustlers", "language": "en", "published_at": "2019-09-04", "text": "WELLINGTON, New Zealand (AP) Some New Zealand gun owners are upset they're being compelled to hand over their assault weapons for money. Others believe a government-imposed ban on certain semi-automatics following a March shooting massacre is the best way to combat gun violence. And The Associated Press has found at least one man may have tried to swindle hundreds of thousands of dollars from the system set up to compensate gun owners.\n\nNew Zealand is six weeks into an ambitious program to buy tens of thousands of guns from owners across the country. After a lone gunman killed 51 people at two Christchurch mosques nearly six months ago, the government rushed through new laws banning military-style semi-automatics in a move that's being closely followed around the world.\n\nPrime Minister Jacinda Ardern told the AP in July that most New Zealanders disagree with the U.S. model under which gun ownership is seen as a constitutional right. The new laws in New Zealand emphasize that gun ownership is instead considered a privilege.\n\nSo far, owners have turned in more than 15,000 newly banned guns as well as 64,000 parts and accessories. In return, the government has handed them 32 million New Zealand dollars ($20 million). But nobody has a clear target for the program because authorities haven't kept track of the number of guns in the country.\n\nTentative estimates put the total number of guns in New Zealand at about 1.5 million and the number of weapons that are now banned at up to 175,000. If those numbers are correct, it would mean less than 10% of the banned weapons have been handed in so far. Owners have until Dec. 20 to turn them over or potentially face charges.\n\nSome politicians and opponents say the buyback scheme is a fiasco that is unfairly targeting law-abiding gun owners rather than criminals or gangs. However, Police Deputy Commissioner Mike Clement, a 40-year veteran tapped to oversee the scheme, says it has been working well. He's traveled to some of the dozens of buyback events and says nobody really knows how many banned guns are out there so any estimates are unhelpful.\n\n\"We're just going to keep pushing ourselves,\" Clement said.\n\nOn Saturday, the last day of the Southern Hemisphere winter, Clement stood in the sun outside an event center near Wellington owned by a dog owners' club. On this day, the center had been turned into a makeshift venue to hand in guns. Heavily armed officers patrolled while others greeted gun owners cheerfully as they arrived and ushered them inside.\n\nUnder the buyback scheme, gun owners get between 25% and 95% of the pre-tax price of a new gun, depending on the condition of their guns. Police take bank details from owners and usually deposit money into their accounts within a few days.\n\nAfter collecting the weapons, police use a hydraulic machine to crush the barrels and triggers out of shape before tossing them into crates that are loaded onto a truck for disposal.\n\nOne of the owners who showed up on Saturday was Paul Campbell, a chiropractor who has enjoyed target shooting since he was 10 years old. Campbell said he was turning in an AR-15 rifle, an AR-10 rifle and a 1961 ex-army SLR rifle that he considered sacred because it was part of a collection used by soldiers in battle. He said he disagreed with the ban and felt it was a knee-jerk reaction to an isolated event. He said previous laws were adequate if they'd been properly enforced.\n\n\"Nothing is going to stop crazy behavior when crazy shows up, except good watchfulness by society to see the cracks, to see the problems, to see problem people,\" Campbell said. \"This is a mental aberration, it's not a behavior brought on by the object.\"\n\nMichael Dowling, chairman of the Council of Licensed Firearm Owners, said gun owners had mixed reactions to the ban and some felt badly treated but most were trying to comply with the law. He said the council doesn't agree with the ban and believes it could create a much bigger black market.\n\n\"We're concerned at a high level that the way this has been approached, it potentially could mean a lot of firearms don't get handed in,\" Dowling said. \"And that will create issues for generations to come.\"\n\nBut gun owner Phillip Fee, who was handing in his Remington semi-automatic rifle, said he supported the ban wholeheartedly, especially after the Christchurch shootings. He said there were lots of people who wanted to become infamous or highlight a cause, and that powerful semi-automatics gave them the means.", "description": "Some New Zealand gun owners are upset they're being compelled to hand over their assault weapons for money. Others believe a government-imposed ban on certain semi-automatics following a March shooting massacre is the best way to combat gun violence. New Zealand is six weeks into an ambitious program", "authors": ["Nick Perry"], "top_image": "https://s.yimg.com/uu/api/res/1.2/WVNTNhdlvapdESOBPLmJmQ--~B/aD0yNTkyO3c9Mzg4ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/cf790c617e0bc048a834b0a326bde98f"}