{"pub": "bbc", "url": "https://bbc.com/news/uk-scotland-scotland-politics-50084610", "downloaded_at": "2019-10-18 03:21:14.289612+00:00", "title": "SNP calls for Brexit extension and general election", "language": "en", "text": "Image copyright Getty Images Image caption Ian Blackford has tabled an amendment to Saturday's motion.\n\nThe SNP is to call for a three month extension to Brexit to allow time to hold a general election.\n\nIan Blackford, the party's Westminster leader, has tabled an amendment to Saturday's motion in the Commons, rejecting the new Brexit deal.\n\nHe also calls for an extension until at least 31 January 2020, allowing for an early election.\n\nBoris Johnson has said he is \"very confident\" MPs will back the Brexit deal he has struck with the EU.\n\nThey are due to debate the withdrawal deal at a special sitting of Parliament on Saturday.\n\nEarlier Nicola Sturgeon warned that the prime minister's deal would lead to a \"much harder Brexit\" than earlier plans.\n\nMr Blackford's amendment was tweeted by the SNP's director of communications at Westminster, Tom French.\n\nSkip Twitter post by @tomfrench85 The SNP has tabled an amendment to reject Boris Johnson’s appalling Brexit deal, and force the Prime Minister to secure an extension and call an election pic.twitter.com/NgkU9fusOU — Tom French (@tomfrench85) October 17, 2019 Report\n\nMeanwhile the BBC's Nick Eardley reported that SNP would \"look carefully\" at any amendment on a second EU referendum.\n\nMr Blackford said Mr Johnson's Brexit deal would be \"devastating for Scotland\".\n\n\"The SNP will never vote for this deal, which would inflict lasting harm on jobs, living standards, public services and the economy,\" he added.\n\n\"It is crucial that opposition parties quit dithering, back our amendment, and finally act to bring this appalling Tory government down and stop Brexit.\"\n\nSkip Twitter post by @nickeardleybbc Confirmed:\n\n\n\n- declines to approve the withdrawal agreement and future\n\n\n\n- calls for the Prime Minister to secure an extension until at least 31 January 2020 for the purpose of holding an early general election before the end of the extension period. https://t.co/qghdKGdxIY — Nick Eardley (@nickeardleybbc) October 17, 2019 Report\n\nEarlier the first minister said it was \"clear that Scotland is being treated unfairly\", and confirmed that SNP MPs \"will not vote for Brexit in any form\".\n\nAfter an agreement between the UK and EU was announced on Thursday morning, Ms Sturgeon said a \"much harder Brexit beckons if this deal passes\".\n\nIt is unclear if the new deal will pass a vote of MPs, with the DUP saying they still cannot support it.\n\nMr Johnson said the \"great new deal\" would see the UK \"take back control of our laws, borders, money and trade without disruption\".\n\nMedia playback is unsupported on your device Media caption Nicola Sturgeon: 'It's hard to imagine a worse Brexit deal'\n\nThe deal was announced by Mr Johnson and European leaders via Twitter on Thursday morning, ahead of a summit in Brussels.\n\nIt removes the much-disputed \"backstop\" proposals for the Irish border post-Brexit, and would instead see Northern Ireland remain in the UK's customs territory - while adhering to a limited set of EU rules on goods. Representatives in Northern Ireland would be able to decide whether to continue this arrangement every four years.\n\nEuropean Commission President Jean-Claude Juncker said it was a \"fair and balanced agreement\" - and suggested that it was the final deal on offer, saying there would be \"no other prolongation\".\n\nMr Johnson said the \"great\" new deal \"allows us to get Brexit done and leave the EU in two weeks' time, so we can then focus on the people's priorities and bring the country back together again\".\n\nHowever, opposition parties in the UK have been critical, with Labour leader Jeremy Corbyn saying the deal sounded \"even worse\" than what was negotiated by the previous prime minister, Theresa May\".\n\nImage copyright Getty Images Image caption Nicola Sturgeon and Boris Johnson do not see eye to eye on Brexit\n\nAnd Ms Sturgeon said Mr Johnson's plan would lead to a \"much harder Brexit\", highlighting that people in Scotland voted for Remain by 62% in the 2016 poll.\n\nThe SNP leader had always been clear that her 35 MPs would reject any deal brought back by Mr Johnson which takes the UK out of the EU's single market and customs union.\n\nReiterating this on Thursday, she said: \"We support efforts to ensure peace and stability on the island of Ireland, in line with the Good Friday Agreement, which must be respected.\n\n\"At the same time, it cannot be right that Scotland alone is facing an outcome it did not vote for - that is democratically unacceptable and makes a mockery of claims that the UK is in any way a partnership of equals.\n\n\"The Brexit envisaged by Boris Johnson is one which sees a much looser relationship with the EU when it comes to issues like food standards, environmental protections and workers' rights. That is not the future that I or my government envisage for Scotland.\"\n\nIndependence vote\n\nThe Scottish Conservatives said the \"onus\" was on Ms Sturgeon and her MPs to back the deal, saying it would be \"unforgivable\" if opposition parties \"put their narrow party interests, grievances and ambitions over the best interests of the country\".\n\nMs Sturgeon also repeated her call for a second independence referendum to take place in 2020, saying it was \"clearer than ever that the best future for Scotland is one as an equal, independent European nation\".\n\nShe told her party conference on Tuesday that she would submit an official request to the UK government for an agreement to hold such a referendum by the end of this year.\n\nHowever, the UK government has repeatedly said it will not do such a deal, saying the 2014 ballot was a \"once in a generation decision\".", "description": "Ian Blackford tables an amendment calling for a three month delay to allow time for a general election.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/F859/production/_109277536_hi057272645.jpg", "published_at": "2019-10-17"}