{"pub": "yahoo", "url": "https://sports.yahoo.com/kaepernicks-reps-nfl-teams-not-interested-qb-013652398--nfl.html", "downloaded_at": "2019-10-11 13:03:25.807249+00:00", "title": "Kaepernick's reps say NFL teams not interested in QB", "language": "en", "text": "Los Angeles (AFP) - Representatives for Colin Kaepernick say there has been \"little to no response\" from any of the 32 NFL teams after they sought opportunities for the quarterback whose kneeling protests became a national controversy.\n\nJeff Nalley and Jasmine Windham issued a statement on Thursday titled \"Facts to Address the False Narratives Regarding Colin Kaepernick.\"\n\nThe two said Kaepernick still wants to play in the NFL and has not made any specific salary demands to teams that might be interested in signing him.\n\nScroll to continue with content Ad\n\n\"Not a single team has brought Colin in for a workout,\" the statement said. \"Seattle brought Colin in for a visit but did not work him out. ... No other NFL team has interviewed or worked out Colin in the past three seasons, despite other false statements to the media to the contrary.\n\n\"In 25 years, I have never seen anything like it,\" Nalley wrote.\n\nKaepernick, 31, hasn't played in the NFL since 2016 when he began protesting racial injustice by kneeling during the national anthem before NFL games.\n\nHe opted out of his contract with the San Francisco 49ers in March 2017 and has since settled a lawsuit against the NFL alleging collusion to deny him a contract.\n\nFormer 49ers teammate Eric Reid was also part of the lawsuit, but has since signed with the Carolina Panthers.\n\nReid shared the document on Twitter on Thursday.\n\n\"There have been so many false narratives in the media regarding Colin, we believe it's important to set the record straight, again.\" Please read this!! Don't believe the lies being told about my brother .@Kaepernick7\" Reid posted.\n\nKaepernick, who led the 49ers to a 2013 Super Bowl appearance, has declared himself fit and available throughout this season, using social media to show himself working out prior to the start of the 2019 campaign.", "description": "Representatives for Colin Kaepernick say there has been \"little to no response\" from any of the 32 NFL teams after they sought opportunities for the quarterback whose kneeling protests became a national controversy.  The two said Kaepernick still wants to play in the NFL and has not made any", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/WH8.O327WNzn4KfAdMhQOA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTEuNjY2NjY2NjY2NjY2Ng--/https://s.yimg.com/uu/api/res/1.2/zyxav.qS8rXUOcNm82lvBQ--~B/aD01MTE7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/d73a61b57f56325ada32ee9d3223a5358e4e7c82.jpg", "published_at": "2019-10-11"}