{"pub": "independent", "url": "https://independent.co.uk/sport/football/international/bulgaria-vs-england-racism-euro-2020-qualifier-apology-a9157991.html", "downloaded_at": "2019-10-16 14:06:59.263457+00:00", "title": "Bulgaria coach apologises to England team after racism mars qualifier", "language": "en", "text": "Bulgaria coach Krasimir Balakov has apologised to the England team after fans taunted their black players with Nazi salutes and monkey chants during a Euro 2020 qualifier in Sofia on Monday.\n\nEngland thrashed Bulgaria 6-0 to hand the hosts their heaviest ever home defeat but the game will be remembered more for the racist incidents that led to action being temporarily stopped in the first half.\n\nEuropean soccer’s ruling body UEFA has opened disciplinary proceedings against Bulgaria over the racist behaviour.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nWhile Balakov said after the game he had not heard any racist abuse from the stands, in an email to reporters late on Tuesday he apologised for the fans’ behaviour.\n\n“I strongly condemn and reject racism as a norm of conduct that contradicts modern human relations,” Balakov said.\n\nShape Created with Sketch. England suffer racist abuse in Bulgaria Show all 12 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. England suffer racist abuse in Bulgaria 1/12 England's players were subjected to racist abuse during Monday night's 6-0 Euro 2020 qualifying win over Bulgaria in Sofia.\n\n\n\nHere are some of the most notable responses. PA 2/12 England forward Raheem Sterling \"Feeling sorry for Bulgaria to be represented by such idiots in their stadium. Anyway.. 6-0 and we go back home, at least we did our job. Safe travel to our fans, u guys did well.\" Getty Images 3/12 England boss Gareth Southgate \"We know it is an unacceptable situation. I think we have managed to make two statements by winning the game but also we have raised the awareness of everyone to this situation.\" AFP via Getty Images 4/12 FA chairman Greg Clarke \"I would like to see a very stringent review by UEFA because I know they take racism very seriously. If we say 'we've got zero tolerance for racism', one person making monkey chanting noises is the same as 100 - zero tolerance is zero tolerance.\" AFP/Getty Images 5/12 England striker Marcus Rashford \"Not an easy situation to play in and not one which should be happening in 2019. Proud we rose above it to take three points but this needs stamping out. Thankful to the brilliant England support. You got behind us in the most meaningful way possible tonight and we are all very grateful. Have a safe journey home and take care. Also been told what the Bulgaria captain did at half-time. To stand alone and do the right thing takes courage and acts like that shouldn't go unnoticed.\" Action Images via Reuters 6/12 England debutant Tyrone Mings \"Hopefully the higher powers will deal with the incidents that happened, we couldn't do much more on the pitch.\" Getty Images 7/12 MP David Lammy \"Monkey chants and Nazis salutes from Bulgarian fans is utterly deplorable. England players should not have to put up with this kind of vile abuse. UEFA must act and kick them out of international football altogether.\" PA 8/12 Former England defender Rio Ferdinand \"Will there even be a punishment? What type of punishment.... Will this show us how serious racism is taken by the powers that be?\" PA 9/12 England goalkeeper Jordan Pickford \"Good win under difficult circumstances. There is absolutely no place for scenes like that. Proud of the team tonight.\" UEFA via Getty Images 10/12 England defender Harry Maguire \"The best way to bounce back. Proud of the team. There's no place in football for that - disgraceful behaviour. Something must be done.\" Getty Images 11/12 Former England captain Gary Lineker \"Gareth Southgate has shown, once again, under trying circumstances what a sound, measured and intelligent leader he is. We've got the right man in charge of our young team at the right time.\" EPA 12/12 Labour leader Jeremy Corbyn \"Solidarity with the England players who faced appalling racism tonight. UEFA needs to do far more to tackle this kind of abuse.\" EPA 1/12 England's players were subjected to racist abuse during Monday night's 6-0 Euro 2020 qualifying win over Bulgaria in Sofia.\n\n\n\nHere are some of the most notable responses. PA 2/12 England forward Raheem Sterling \"Feeling sorry for Bulgaria to be represented by such idiots in their stadium. Anyway.. 6-0 and we go back home, at least we did our job. Safe travel to our fans, u guys did well.\" Getty Images 3/12 England boss Gareth Southgate \"We know it is an unacceptable situation. I think we have managed to make two statements by winning the game but also we have raised the awareness of everyone to this situation.\" AFP via Getty Images 4/12 FA chairman Greg Clarke \"I would like to see a very stringent review by UEFA because I know they take racism very seriously. If we say 'we've got zero tolerance for racism', one person making monkey chanting noises is the same as 100 - zero tolerance is zero tolerance.\" AFP/Getty Images 5/12 England striker Marcus Rashford \"Not an easy situation to play in and not one which should be happening in 2019. Proud we rose above it to take three points but this needs stamping out. Thankful to the brilliant England support. You got behind us in the most meaningful way possible tonight and we are all very grateful. Have a safe journey home and take care. Also been told what the Bulgaria captain did at half-time. To stand alone and do the right thing takes courage and acts like that shouldn't go unnoticed.\" Action Images via Reuters 6/12 England debutant Tyrone Mings \"Hopefully the higher powers will deal with the incidents that happened, we couldn't do much more on the pitch.\" Getty Images 7/12 MP David Lammy \"Monkey chants and Nazis salutes from Bulgarian fans is utterly deplorable. England players should not have to put up with this kind of vile abuse. UEFA must act and kick them out of international football altogether.\" PA 8/12 Former England defender Rio Ferdinand \"Will there even be a punishment? What type of punishment.... Will this show us how serious racism is taken by the powers that be?\" PA 9/12 England goalkeeper Jordan Pickford \"Good win under difficult circumstances. There is absolutely no place for scenes like that. Proud of the team tonight.\" UEFA via Getty Images 10/12 England defender Harry Maguire \"The best way to bounce back. Proud of the team. There's no place in football for that - disgraceful behaviour. Something must be done.\" Getty Images 11/12 Former England captain Gary Lineker \"Gareth Southgate has shown, once again, under trying circumstances what a sound, measured and intelligent leader he is. We've got the right man in charge of our young team at the right time.\" EPA 12/12 Labour leader Jeremy Corbyn \"Solidarity with the England players who faced appalling racism tonight. UEFA needs to do far more to tackle this kind of abuse.\" EPA\n\n“This is a prejudice that comes from the past that must be eradicated forever.\n\n“I want to say something very clear: given that there have been insults on such a basis, I, as a coach of the national team, apologise to the English footballers and all those who feel hurt.”\n\nBulgarian Football Union President Borislav Mihaylov resigned on Tuesday, a few hours after the Balkan country’s Prime Minister Boyko Borissov called for the former international goalkeeper to step down.\n\nMihaylov had previously defended Bulgarian soccer from accusations of racism and criticised England for what he saw as ‘a fixation’ on potential incidents that could raise tension.", "description": "Bulgaria coach Krasimir Balakov has apologised to the England team after fans taunted their black players with Nazi salutes and monkey chants during a Euro 2020 qualifier in Sofia on Monday. England thrashed Bulgaria 6-0 to hand the hosts their heaviest ever home defeat but the game will be remembered more for the racist incidents that led to action being temporarily stopped", "authors": ["Peter Rutherford"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/16/10/krasimir-balakov.jpg", "published_at": "2019-10-16"}