{"pub": "reuters", "url": "https://in.reuters.com/article/facebook-cryptocurrency-france/spooked-by-facebooks-libra-euro-zone-to-step-up-work-on-public-cryptocurrency-idINKCN1VY0HE", "downloaded_at": "2019-09-13 18:38:01.906432+00:00", "title": "France, Germany blast Facebook's Libra, back public cryptocurrency", "language": "en", "text": "HELSINKI (Reuters) - France and Germany said on Friday that Facebook’s Libra currency posed risks to the financial sector that could block its authorisation in Europe, and backed the development of an alternative public cryptocurrency.\n\nFILE PHOTO: Small toy figures are seen on representations of virtual currency in front of the Libra logo in this illustration picture, June 21, 2019. REUTERS/Dado Ruvic/File Photo\n\nThe criticism came as the European Central Bank said it was working on a long-term plan to launch a public digital currency that could make projects such as Libra redundant.\n\nVirtual currencies pose risks to consumers, financial stability and even “the monetary sovereignty” of European states, France’s Finance Minister Bruno Le Maire and his German counterpart, Olaf Scholz, said in a joint statement issued at a meeting of euro zone finance ministers in Helsinki.\n\n“France and Germany consider that the Libra project, as set out in Facebook’s blueprint, fails to convince that those risks will be properly addressed,” they said.\n\nThe 19-country euro zone bloc is united in pursuing a tough regulatory approach should Libra seek authorisations to operate in Europe, officials said at the meeting.\n\nIt is also considering a common set of rules for virtual currencies, which are currently largely unregulated.\n\nThe currency union has worked in past years on several plans to make digital payments cheaper and faster, but none of them has properly taken off so far.\n\nWAKE-UP CALL\n\nPlans unveiled in June by U.S. social media giant Facebook to launch its own digital currency, Libra, for payments among its hundreds of millions of users in Europe and around the world have triggered a rethink.\n\nLibra was “a wake-up call”, European Central Bank (ECB) board member Benoit Coeure told a news conference in Helsinki after a meeting of euro zone finance ministers.\n\nHe said Libra had revived efforts to widen the uptake of an ECB-backed project for real-time payments in the euro zone, known as TIPS. The project, launched last year, has been met with caution by banks.\n\n“We also need to step up our thinking on a central bank digital currency,” he added, unveiling a so-far little known plan.\n\nAn ECB official said the project could allow consumers to use electronic cash, which would be directly deposited at the ECB, without need for bank accounts, financial intermediaries or clearing counterparties.\n\nThese actors are all needed now to process digital payments, but may no longer be necessary if the ECB took over their functions, slashing transaction costs. Libra’s plan also would do without financial intermediaries.\n\nWork on the ECB project started before the launch of Libra and could last months or even years, Coeure said. The technical feasibility remains to be seen and opposition from banks is likely. He will present a report on virtual currencies to G7 finance ministers next month, officials said.\n\nLe Maire said one of the purposes of this initiative was to make sure that banks reduce fees on international payments.\n\n“We encourage European central banks to accelerate work on issues around possible public digital currency solutions,” Le Maire said in the joint statement with Germany’s Scholz.\n\nLEGAL LIMBO\n\nWhile euro zone ministers seem united on a tough regulatory line on Libra, it is less clear whether they agree to set up common rules for virtual currencies.\n\nThe EU’s financial services commissioner, Latvia’s Valdis Dombrovskis, is always careful to underline that cryptoassets are an opportunity as much as a threat.\n\nThe EU does not have specific regulations on cryptocurrencies, which until Libra was unveiled had been considered a marginal issue by most decision-makers because only a tiny fraction of bitcoins or other digital coins are converted into euros.\n\nNew EU-wide rules came into force last year to increase checks on virtual currencies’ trading venues with the purpose of reducing risks of money laundering and other financial crime.\n\nBut apart from that, virtual currencies move in what is largely a legal limbo in the EU, as regulators have not yet managed to agree on whether to treat them as securities, payment services or currencies in themselves - the latter option being ruled out by most.\n\nIn the absence of specific regulations, EU officials are assessing whether existing rules governing financial instruments could apply, but have so far reached no conclusion.\n\nWhen asked whether Libra would need a licence to operate in the EU, a spokeswoman for the European Commission told Reuters that an authorisation would likely be necessary. But “with the publicly available information on Libra, it is currently not possible to say which exact EU rules would apply,” she added.\n\nFrench Finance Minister Bruno Le Maire at the Maximos Mansion in Athens, Greece, August 9, 2019. REUTERS/Costas Baltas/Files\n\nIn Switzerland, Libra is applying for a payment service licence, although it could face rules that typically apply to banks, regulators in the non-EU Alpine state said on Wednesday.\n\nThe EU-wide legal vacuum has paved the way for smaller states to fill it. Tiny Malta, which already hosts the bloc’s largest online gambling industry and an outsized finance sector, has devised its own framework to attract virtual currency operators.\n\nIt is unclear whether Malta and other smaller EU states would agree with Le Maire’s tough stance on Libra and cryptocurrencies.", "description": "France and Germany said on Friday that Facebook's Libra currency posed risks to the financial sector that could block its authorisation in Europe, and backed the development of an alternative public cryptocurrency.", "authors": ["Francesco Guarascio", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190913&t=2&i=1429438901&w=1200&r=LYNXNPEF8C16D", "published_at": "2019-09-13"}