{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/trumps-minneapolis-rally-demonstration-moral-145900190.html", "downloaded_at": "2019-10-11 20:00:04.286989+00:00", "title": "Trump's Minneapolis Rally Was a Demonstration of the Moral Suicide Pact He's Made With His Supporters", "language": "en", "text": "From Esquire\n\nIt was surely a swift process for some people. Here's a talk-radio soundboard running for president, yelling about Mexicans and Muslims and how we need a Big, Beautiful Wall to keep Those People out. He knows whose country this is. He knows who should make the rules, and who ought to shut up and follow them. He knows who gets a seat at the table in America. They were in from the jump, from the moment they first stood at a rally and felt that twisted power coursing through their veins.\n\nBut others, you have to think, were more gradual converts. Maybe they felt the world was passing them by. Maybe they didn't know until he came along how much they needed an outlet for their rage at a million quotidian cuts—the new boss who doesn't look like a boss should look, having to press \"1\" for English. They were primed for it, sure, but it took a while to fully commit. Day after day, as they continued to support him—through the racist tirades and the attacks on veterans and their families and the exploding allegations that he is a serial sexual predator—they were forced to give up more and more of themselves to stay on-board. And as they gave up more of themselves, they became more and more devout in their allegiance to The Movement. At some point, the sunk cost became insurmountable. There is no going back now. They have given all of themselves to him.\n\nThat is how we arrived in the place we did on Thursday night at a rally in Minneapolis, Minnesota. Donald Trump, American president took the stage and, among a great many other things, did this. The crowd laughed and cheered.\n\nHere's Trump doing a dramatic reading of Peter Strzok and Lisa Page's text messages pic.twitter.com/oEokCo6pvb — Aaron Rupar (@atrupar) October 11, 2019\n\nHe may once have told you, in his way, not to believe your eyes and ears. But you can. The President of the United States did indeed just act out some sort of sexual fantasy, in front of thousands and on C-SPAN, between two characters from his extended Deep State Conspiracy Universe. The stars of this show were Peter Strzok and Lisa Page, two FBI employees involved in the Russia probe who were having an affair and were opposed to the president's candidacy for president. (There is no evidence of misconduct.)\n\nThis is the president channeling everything he learned from Vince McMahon, pausing after he recites the names of the various heels so the crowd can howl their derision. The details aren't important. This is the show, where the enemies get bashed and We cheer together. This is the president deliberately debasing his office, of going lower than ever before and bringing his supporters with him, because he knows they have ventured into the deep and dark together now and they can't see any path back. They will follow him until he is stopped, and the farther they follow, the more they are his. There is nothing that cannot be excused away with half-baked crap about Fake News or What About Hillary. Nihilism is at the heart of things now. There are no standards or ethics to be observed, only enemies to lash out at from the darkness.\n\nThe rest of last night's national disgrace was predictable by now. The president cooked up egregious lies about Democratic leaders in Congress. He recited the names of his greatest allies on State TV and talked about how great their ratings are. He proudly said, \"There was no blackmail,\" on his call with the leader of Ukraine. Mr. President: Thank you. He accused his enemies of that which he is guilty. He joked about serving more than his constitutionally mandated two terms. He exhibited clear signs of cognitive decline. He said Joe Biden, the former Vice President of the United States, only got the job \"because he understood how to kiss Barack Obama's ass.\" And what exactly, was Proper Evangelical Good Boy Mike Pence doing while the president simulated orgasms on-stage last night? After all, he and Mother were standing there in the arena.\n\nBut the real ugliness came on a similarly predictable topic. Minneapolis is home to Ilhan Omar and the sizable Somali community there from which she hails, and it was always bound to feature in this Thursday Night Raw-meets-Riefenstahl with a script courtesy of Stephen Miller. First, he recited some evidence-free conspiracy theories he got off a right-wing blog.", "description": "They have given too much of themselves to The Leader to go back now. They will support him, no matter what he does, until he is stopped.", "authors": ["Jack Holmes"], "top_image": "https://s.yimg.com/uu/api/res/1.2/BZojGBYVDeHxTeUk8YCyvw--~B/aD03MjQ7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/esquire_269/42dec660303d39fbc641f838833ba833", "published_at": "2019-10-11"}