{"pub": "reuters", "url": "https://reuters.com/article/us-hugo-boss-outlook/hugo-boss-cuts-outlook-again-citing-weak-u-s-hong-kong-business-idUSKBN1WP2NP", "downloaded_at": "2019-10-10 19:03:10.997664+00:00", "title": "Hugo Boss cuts outlook again, citing weak U.S., Hong Kong business", "language": "en", "text": "FILE PHOTO: The Hugo Boss logo is seen on a store in Metzingen, Germany, June 16, 2017. REUTERS/Michaela Rehle/File Photo\n\nFRANKFURT (Reuters) - German fashion house Hugo Boss (BOSSn.DE) cut its 2019 earnings forecast again, citing weak demand in the United States and Hong Kong, and reported third quarter results that were below its expectations.\n\n“In North America, the market environment further deteriorated during the third quarter, ... Besides lower local demand, also sales generated with tourists decreased over there,” it said late on Thursday.\n\n“Business in Hong Kong has been substantially negatively affected since the beginning of the political unrest and demonstrations,” it added.\n\nLuxury labels rely on Hong Kong as a magnet for travelers and shoppers across Asia, and several months of pro-democracy protests have forced some retailers to close their doors temporarily.\n\nHugo Boss now expects 2019 operating earnings before interest and tax (EBIT) to fall to between 330 million euros and 340 million euros, down from 347 million last year.\n\nIn August, it had pared its forecast for EBIT growth to the lower end of a high single-digit percentage increase.\n\nIn an early release of quarterly results that it described as below expectations, it reported flat group sales on a currency-adjusted basis and EBIT falling to 80 million from 92 million euros in the year-earlier period.\n\nEarlier on Thursday its shares had closed up almost 1% after a strong sales update from Louis Vuitton owner LVMH (LVMH.PA) which suggested the unrest in Hong Kong may have had less impact than expected.\n\nLVMH said revenues were down roughly 25% in the July to September period in Hong Kong. Analysts had projected industry sales there could potentially have halved.", "description": "German fashion house Hugo Boss cut its 2019 earnings forecast again, citing weak demand in the United States and Hong Kong, and reported third quarter results that were below its expectations.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439358283&w=1200&r=LYNXMPEF991VS", "published_at": "2019-10-10"}