{"pub": "yahoo", "url": "https://news.yahoo.com/another-tropical-storm-developing-atlantic-183344733.html", "downloaded_at": "2019-09-15 09:25:35.056619+00:00", "title": "Another tropical storm is developing in the Atlantic. Here's when it could hit Florida", "language": "en", "text": "Tropical storm watches have been hoisted along portions of the east coast of Florida due to a strengthening tropical system that's dumping heavy rain on the Bahamas.\n\nThe system, now known as Tropical Depression Nine, will almost certainly become Tropical Storm Humberto within the next 24 hours, the National Hurricane Center said.\n\nThe system's winds are now at 30 mph; when they reach 39 mph, it will become Humberto, the eighth named storm of the 2019 Atlantic hurricane season.\n\n“The depression is moving toward the northwest near 8 mph,\" the hurricane center said. \"A turn toward the north-northwest is expected on Saturday.\"\n\n\"On the forecast track, the system is anticipated to move very near the northwestern Bahamas tonight and Saturday, and east of the east coast of Florida during Saturday and Sunday,” the hurricane center said.\n\nRead this: Are Category 5 hurricanes such as Dorian the 'new normal'?\n\nIn Florida, a tropical storm watch has been posted for coastal areas from the Jupiter Inlet to the Flagler-Volusia county line. This means that tropical-storm-force winds of at least 39 mph are possible in the watch area by Saturday night, the Weather Channel said.\n\nIn addition to the wind, \"heavy rainfall and scattered flash flooding is possible this weekend in coastal sections of eastern Florida, Georgia and South Carolina,\" the hurricane center warned. \"Depending on the track of the system, heavy rainfall could reach eastern North Carolina next week.\"\n\nMost areas should see 2 to 4 inches of rain, AccuWeather said, though a few isolated ares could see as much as 8 inches.\n\nIn the Bahamas: As people search for missing and try to rebuild, a potential tropical storm approaches\n\nGov. Ron DeSantis told Floridians to prepare now.\n\n“Regardless of the exact track or development, Floridians along the East Coast should be prepared for heavy rain and potential flooding, have supplies ready and follow local media for updates,” the governor tweeted Friday afternoon.\n\nThe storm should be near the Atlantic coast of Florida over the weekend, then near the Georgia coast by Monday, and possibly near the Carolina coast by Tuesday.\n\nOther impacts: High surf and rip currents may build along the Atlantic beaches of Florida, Georgia and the Carolinas into this weekend, the Weather Channel warned, while an isolated waterspout or tornado is also possible in Florida.\n\nAs of the latest forecast, the storm is not projected to make a direct landfall anywhere along the U.S. coast for at least the next several days, the hurricane center said.\n\n“Global models develop the system and guidance suggests that the cyclone could even reach hurricane intensity by the end of the forecast period,” the hurricane center said. “By then, the system is expected to be over the Atlantic well southeast of the coast of the Carolinas.”\n\nForecasters are also watching two other weather disturbances now spinning in the tropical Atlantic Ocean. Both could become tropical depressions or tropical storms next week.\n\nThis article originally appeared on USA TODAY: Florida tropical storm watch: Cyclone likely to become Humberto", "description": "The system headed toward Florida, now \"Tropical Depression Nine,\" will almost certainly become Tropical Storm Humberto within next 24 hours", "authors": ["Doyle Rice", "Usa Today"], "top_image": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "published_at": "2019-09-13"}