{"pub": "yahoo", "url": "https://sports.yahoo.com/tottenham-where-going-wrong-mauricio-094700016.html", "downloaded_at": "2019-09-25 13:51:16.803440+00:00", "title": "Tottenham: Where has it all going wrong for Mauricio Pochettino’s Spurs?", "language": "en", "text": "Pochettino looks on as Spurs suffer a humiliating exit vs Colchester: PA\n\nTottenham’s difficult start to the season continued on Tuesday as they were dumped out of the Carabao Cup on penalties by League Two Colchester.\n\nDark clouds appear to be circling at Spurs, even though they were in the Champions League final less than four months ago - so where exactly has it all gone wrong?\n\nScroll to continue with content Ad\n\nHow bad is their form?\n\nThe run to that Champions League final last term masks what has been a pretty torrid 2019 for Spurs. Their Premier League form has nosedived this year, with just five wins from their last 20 games – hardly a run of results befitting their top-four status. There are mitigating circumstances for running out of steam last season, with injuries, fatigue and the Champions League distraction among them, but their slump has carried over to the new campaign.\n\nThey have won just two of their opening six top-flight games, drew at Olympiacos in the Champions League and then suffered the embarrassment of a Carabao Cup defeat to a side 71 places below them in the football pyramid.\n\nA painful rebuild\n\nBoss Mauricio Pochettino warned that there was going to be a “painful rebuild” of his squad this summer, but it ended up being more painful than expected.\n\nThe inability to sort out the future of a host of players before the season kicked off left them in limbo until the European transfer window shut at the start of the month.\n\nThe likes of Christian Eriksen, Jan Vertonghen, Serge Aurier, Toby Alderweireld, Danny Rose and Victor Wanyama were all uncertain of their futures and it left Pochettino speaking of an unsettled squad.\n\nHe was hoping it would be cured after September 2, but admitted on Tuesday night that his players need time to be reunited and that he is still working against “different agendas” within the dressing room.\n\nRead more\n\nStory continues\n\nPochettino hints at divisions within his Tottenham squad\n\nLack of cutting edge\n\nSpurs’ Carabao Cup embarrassment was a result of their inability to break down a team who put 10 men behind the ball, and that has been an early theme of the 2019-20 season.\n\nThey remain a devastating side on the counter-attack, but when there has been a wall to break down they simply have not got the creativity to get through. That saw them lose 1-0 to Newcastle, labour to a 0-0 draw at Colchester and need two late goals to beat Aston Villa.\n\nBrittle at the back?\n\nSpurs’ stingy defence used to be the foundation of their success – they conceded only 29 times in the 2016-17 Premier League season. But, even though four of the back five remain the same, they have become very leaky this term.\n\nTottenham players react after their shootout defeat (Reuters)\n\nIn addition, they have been flaky when holding onto a lead. Twice they have drawn games from 2-0 up and they lost at Leicester having led 1-0 going into the final quarter.\n\nA six-year itch?\n\nPochettino is now in his sixth season at the helm, and nine of his current strongest starting XI were in the side that challenged Leicester for the 2015-16 title.\n\nRead more\n\nLeague Two Colchester topple Tottenham in Carabao Cup\n\nThere has been virtually no turnover of the squad in recent years and there is a chance that it has all gone a bit stale for both the players and the manager.\n\nThe players have been listening to the same man giving the same message for several years, and Pochettino has been unable to freshen up his squad in the way he would have liked. He spoke about the possibility of leaving the club had they won the Champions League.\n\nPA\n\nRead more\n\nRead more Pochettino hints at divisions within his Tottenham squad", "description": "Tottenham’s difficult start to the season continued on Tuesday as they were dumped out of the Carabao Cup on penalties by League Two Colchester.Dark clouds appear to be circling at Spurs, even though they were in the Champions League final less than four months ago - so where exactly has it all gone", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/205LpegjHQv.E3LNvscfVg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTI7aD03OTA-/https://s.yimg.com/uu/api/res/1.2/qYahCfFR.KWgiW8TcvNLjQ--~B/aD0zOTU7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/348e1fa627571c951cb72cb2b6a7b406", "published_at": "2019-09-25"}