{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/almost-three-quarters-of-a-billion-rand-spent-on-mps-housing-over-the-past-10-years-20191015", "downloaded_at": "2019-10-15 04:27:07.384894+00:00", "title": "Almost three quarters of a billion rand spent on MPs' housing over the past 10 years", "language": "en", "text": "The three parliamentary villages, its upkeep and transport have cost South Africa almost three quarters of a billion rand over the two previous parliamentary terms.\n\nIn a reply to a written Parliamentary question on Monday, Public Works and Infrastructure Minister Patricia de Lille revealed that the total cost incurred by the government for the three parliamentary villages during the terms of the Fourth and Fifth Parliaments - from 2009 to 2019 – is R743 788 400.04.\n\nREAD | De Lille's sister resigns from public works post for 'ethical reasons'\n\nThe parliamentary villages house MPs in Cape Town when they attend committee meetings and sittings within the parliamentary precinct during the year.\n\nThe costs in De Lille's reply includes bus transport, water and electricity, rates and taxes, village management, construction of new buildings, maintenance of buildings, purchasing of new furniture and appliances, and any other expenses.\n\nThe question was asked by DA MP Willem Faber, who also wanted to know whether De Lille has considered providing each MP with a housing allowance instead of accommodation.\n\n\"The responsibility of the Department of Public Works and Infrastructure is to provide accommodation to Government Departments and Members of Parliament, amongst others, in terms of its mandate. Any request for allowances to public office bearers must be made to the Independent Commission for Remuneration of Public Office Bearers,\" read De Lille's response.\n\nREAD | The curious case of Mmusi Maimane's R4m house\n\nTransport\n\nAccording to the reply, the total cost incurred by the government for all three parliamentary villages – Acacia Park, Pelican Park and Laboria Park - for transport was R38 570 345 for the Fourth Parliament (2009 - 2014) and R35 997 143 for the Fifth (2014 - 2019).\n\nMunicipal services\n\nThe total cost in terms of the municipal services and rates of the three parliamentary villages during the Fourth Parliament were as follows:\n\nLaboria Park: R7 875 171.81\n\nPelican Park: R6 470 925.33\n\nAcacia Park: R12 836 995.19\n\nFor the Fifth Parliament, it was:\n\nLaboria Park: R12 185 225.49\n\nPelican Park: R22 328 442.08\n\nAcacia Park: R50 959 085.40\n\nEmployment of officials\n\n\"The parliamentary villages are managed by the Department of Public Works and Infrastructure through officials who are employed full-time and render the required services,\" read De Lille's reply.\n\nFor the Fourth Parliament, the cost relating to the employment of the officials amounted to R8 053 472.75 and for the Fifth Parliament, it was R13 102 467.25\n\nNew access buildings\n\nDuring the Fifth Parliament's term, the building of new access buildings at the three parliamentary villages amounted to R35 550 947.07.\n\nMaintenance\n\nThe maintenance of the buildings took the largest chunk over the 10 years.\n\nFor the Fourth Parliament, De Lille provided the figure of R300 000 000, and for the Fifth, the three villages combined cost R162 454 497.67.\n\nNew furniture and appliances\n\nDuring the Fourth Parliament's term, the government spent R6 422 237 on new furniture and appliances, while this figure was almost five times more for the Fifth Parliament, which amounted to R30 981 445.\n\nIn another question, Faber asked De Lille \"whether her department intends transferring the village to the City of Cape Town for housing development purposes since it already has an operating school, pre-school and sport and recreation facilities\".\n\n\"Acacia Park is currently used by members of Parliament and Sessional officials,\" De Lille answered.\n\nHouses and facilities\n\nDuring the Fifth Parliament, Acacia Park housed 226 Members of Parliament, 259 Sessional Officials, one departmental official performing standby duties, four assistants to MPs and two parliament staff members.\n\nLaboria Park housed 56 MPs, six sessional officials and two departmental official performing standby duties.\n\nPelican Park housed 71 MPs, 35 sessional officials and one departmental official.\n\nAcacia Park has 337 housing units, 155 apartments and facility buildings comprising a primary school, crèche, soccer/rugby field, three recreational halls, tennis court, swimming pool and a gym facility.\n\nLaboria Park has 64 housing units and facility buildings comprising a recreational hall with a gym facility, tennis court and swimming pool.\n\nPelican Park has 107 housing units and a facility building comprising a recreational hall with a gym facility, tennis court and swimming pool.", "description": "Public Works and Infrastructure Minister Patricia de Lille has revealed that the total cost incurred by the government for the three parliamentary villages from 2009 to 2019 was R743m.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8136/518c7ea6c38448b0993c46a73838e08b.jpg", "published_at": "2019-10-15"}