{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/inside-one-uks-most-haunted-20641731", "downloaded_at": "2019-10-17 14:36:18.178914+00:00", "title": "Inside one of UK's most haunted pubs - with a creepy doll left in cellar forever", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nOne of the country's most haunted pubs always has a doll in the cellar.\n\nIf there isn't one strange things happen at the Ye Olde Salutation Inn in Nottingham.\n\nRosie, a five-year-old flower seller, is one the resident ghosts inside the pub built over a system of caves which dates back to the 9th century.\n\nLocal legend says she died after she was accidentally struck by a carriage in the courtyard at her tender young age, Nottinghamshire Live reports.\n\nAfter the accident, Rosie was carried down to the caves to keep her cool and comfortable until the doctor arrived but, tragically, she died before he could get there.\n\n(Image: Nottingham Post)\n\nSoon afterwards, customers at the pub started to complain about being scratched.\n\nThey all had four small scratch marks, as though they had been scratched by a child.\n\nThis continued over a two-week period until the landlord of the pub took a doll down to the cave and left it there for Rosie.\n\n(Image: Nottingham Post)\n\nThe scratching stopped and since then, customers and staff have continued to take dolls and teddy bears down to the cave as presents for Rosie.\n\nPublican Jason Weston has had a number of ghostly encounters over the years.\n\nHe said: “One former landlord didn’t believe in ghosts and took all the dolls and teddies out of the cave. All his beer went off overnight.\n\n\"Since then nobody, myself included, has dared to risk it again.”\n\n(Image: Nottingham Post)\n\nAlongside Rosie there are tales of three former landlords, all called John, who died in the pub and are said to haunt it.\n\nOne is said to have hung himself upstairs, one accidentally poisoned himself and his family when he prepared a meal after handling rat poison (he died but his family survived), and one fell down the cellar steps and broke his neck.\n\nOf the latter, Jason said: “John is fastidious about the cleanliness of the cellar.\n\n\"If it’s not absolutely spotless he slams doors and throws things. My first encounter with him was when I first moved to the pub.\n\n(Image: Nottingham Post)\n\n\"The cellar needed a really good clean, so I’d spent about 18 hours down there sorting it out. I popped upstairs briefly and when I returned there was a really old half pint glass of beer in the middle of the floor.\n\n\"I’m absolutely 100% sure that nobody else had been down there!\n\n“I get on pretty well with John now. I’ve even forgotten to close the cellar door on my way back up into the pub before now and jokingly shouted back ‘close the door for me John’ and it has slammed shut.”\n\nOther sightings at the pub include a pirate who is said to have fallen into the well and drowned when he was hiding in one of the caves, and a highwayman who can sometimes be seen drinking at the ground floor bar.\n\n(Image: Nottingham Post)\n\nThere are even stories of a legion of Roman soldiers who have been seen emerging from the wall, marching through the cellar and disappearing into the wall on the opposite side.\n\nJason said: “Nottingham has always been famous for being haunted and Ye Olde Salutation Inn has plenty of stories for people to hear.\n\n\"We have visits from paranormal investigators and ghost hunters because of the amount of haunted tales associated with the pub.\n\n\"We’re always extremely busy around Halloween as customers hope to catch a glimpse of one of the ghosts.”\n\n(Image: Nottingham Post)\n\nPub company Ei Publican Partnerships chose the spooky pub, which is also one of the odest in Nottingahm, out of more than 4,000 properties.\n\nNick Light, managing director at Ei Publican Partnerships, said: “We’re extremely lucky to have a number of historic buildings that are home to some very haunting stories and the Ye Olde Salutation Inn has more than most.\n\n\"Many staff and customers have encountered strange goings-on and we’re expecting Halloween to be a particularly spooky evening.”", "description": "Spooky things happen in the Ye Olde Salutation Inn in Nottingham", "authors": ["Lynette Pinchess", "Lorraine King", "Image", "Nottingham Post"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20641671.ece/ALTERNATES/s1200/2_An-historic-Nottingham-pub-has-been-named-as-one-of-the-UKs-most-haunted-watering-holes-with-supern.jpg", "published_at": "2019-10-17"}