{"pub": "bbc", "url": "https://bbc.com/news/world-middle-east-50181212", "downloaded_at": "2019-10-25 16:10:33.939041+00:00", "title": "Iraq protests: Two dead as police fire tear gas amid fresh unrest", "language": "en", "text": "Image copyright Reuters Image caption Iraqi security forces blocked protesters as they tried to reach government buildings\n\nAt least two people were killed as protests escalated in the Iraqi capital Baghdad, with police firing tear gas to repel demonstrators.\n\nThe dead were reportedly hit by tear gas canisters. Scores were injured, including security forces.\n\nProtests have erupted nationwide, with demonstrators marching on government buildings.\n\nThey are demanding more jobs, better public services and an end to corruption.\n\nSimilar protests earlier this month were brutally put down by security forces, leaving nearly 150 people dead.\n\nA government report has acknowledged that authorities used excessive force in quelling that unrest.\n\nAhead of the latest rallies, Iraq's leading Shia cleric, Grand Ayatollah Ali al-Sistani, used his weekly sermon on Friday to call for restraint.\n\nA day earlier Prime Minister Adel Abdul Mahdi warned that although people could exercise their right to demonstrate, violence would not be tolerated.\n\nFriday marks the first anniversary of Mr Mahdi taking office. He has promised a cabinet reshuffle and a package of reforms to address protesters' demands but many remain unconvinced.\n\nCorrespondents say confrontations could escalate later when supporters of Moqtada Sadr, a highly influential Shia cleric who leads the largest opposition bloc in parliament, are expected to take to the streets.\n\nWhat's the latest?\n\nHundreds of protesters gathered in Baghdad's Tahrir Square on Thursday evening and many camped out overnight.\n\nEarly on Friday they crossed a bridge, bringing them close to the Green Zone where government buildings and foreign embassies are located.\n\nAccording to witnesses, security forces then fired a volley of tear gas to drive them back.\n\nImage copyright AFP Image caption Demonstrators ran for cover as police fired tear gas\n\nPolice and medical sources told Reuters news agency that two demonstrators died after being struck by tear gas canisters.\n\nMore than 350 people, the sources added, were wounded as security forces sought to prevent protesters reaching the Green Zone.\n\nThere is no official confirmation of the figures. However, pictures from the scene did show at least one person, apparently hit by a canister, lying motionless on the street.\n\nDemonstrations were also reported in the southern cities of Diwaniyah, Najaf and Nasiriyah. In Nasiriyah, at least 3,000 protesters broke into a government building and set it alight, police said.\n\nThe Iraqi interior ministry said 68 security forces personnel were injured across the country.\n\nImage copyright Reuters Image caption Demonstrators disperse as Iraqi security forces use tear gas in Baghdad\n\nThe government's handling of the protests has fuelled discontent across Iraq, whose political leaders have faced calls to resign.\n\n\"We're not hungry, we want dignity,\" shouted one marcher. Another said that Iraq's politicians had \"monopolised all the resources\".\n\nImage copyright Getty Images Image caption Anti-government protesters march through flood waters in the city of Najaf\n\nWhat's the background?\n\nThe protests started in Baghdad on 1 October. Most of those taking part were young and unemployed.\n\nAfter security forces used live ammunition against demonstrators, the unrest escalated and spread to other cities and towns.\n\nWhen the scale of the bloodshed became clear, a government committee was tasked by Prime Minister Mahdi with investigating the violence.\n\nMedia playback is unsupported on your device Media caption Video from early October shows protesters fleeing from Iraqi security forces\n\nIts report said 149 civilians and eight security personnel had been killed in protests between 1 and 6 October. Three-quarters of the deaths were in Baghdad province.\n\nThe committee concluded that \"officers and commanders lost control over their forces during the protests\" and that this \"caused chaos\".", "description": "There are appeals for calm after similar rallies earlier this month left nearly 150 protesters dead.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/57E0/production/_109369422_057542433.jpg", "published_at": "2019-10-25"}