{"pub": "yahoo", "url": "https://news.yahoo.com/south-korea-moon-sees-approval-020920902.html", "downloaded_at": "2019-10-18 03:24:52.627424+00:00", "title": "South Korea’s Moon Sees Approval Rating Hit New Low Amid Scandal", "language": "en", "text": "(Bloomberg) -- The approval rating for South Korean President Moon Jae-in hit a record low in a poll released just days after he issued a public apology for the resignation of a scandal-tainted minister who was a close political ally.\n\nThe support rate for Moon’s government was at 39%, according to data released Friday by Gallup Korea, which conducts regular tracking polls. The resignation of Cho Kuk -- a former justice minister who resigned just five weeks after taking the job -- added to Moon’s woes that include a tepid economy, a trade war with Japan, and North Korea snubbing his overtures for talks.\n\nThe approval rating slipped from 43% a week ago, with 53% of respondents saying they disapproved of the Moon government, Gallup said. Major reasons cited by the public for faulting Moon included economic mismanagement and his personnel appointments.\n\nMoon’s appointment of Cho on Sept. 9 touched a nerve with many as they questioned why a person whose family was being probed for financial irregularities should lead the ministry conducting the investigation. Protests also spread to university campuses with students angered about reports that Cho may have used his influence to help his daughter win admission to a prestigious college.\n\nMoon came to office in 2017 with an approval rate above 80% with calls to increase employment and cut into income inequality. But he has presided over an economy forecast to expand this year at the weakest pace in a decade. Exports -- a key pillar of the Korean economy -- have fallen for ten straight months, and hurt corporate investment and hiring.\n\nTo contact the reporter on this story: Jihye Lee in Seoul at jlee2352@bloomberg.net\n\nTo contact the editors responsible for this story: Brendan Scott at bscott66@bloomberg.net, Jon Herskovitz, Peter Pae\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- The approval rating for South Korean President Moon Jae-in hit a record low in a poll released just days after he issued a public apology for the resignation of a scandal-tainted minister who was a close political ally.The support rate for Moon’s government was at 39%, according to data", "authors": ["Jihye Lee"], "top_image": "https://s.yimg.com/uu/api/res/1.2/_llImJSCWNdLFMjwQd.IeA--~B/aD0xMzM0O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/d24fde79638e5f936dca36cb47580b95", "published_at": "2019-10-18"}