{"pub": "investing.com", "url": "https://investing.com/news/forex-news/trump-sees-warmer-feelings-as-schumer-sounds-off-trade-update-1995130", "downloaded_at": "2019-10-11 20:23:13.771251+00:00", "title": "Trump Sees ‘Warmer Feelings’ as Schumer Sounds Off: Trade Update", "language": "en", "text": "© Reuters. Trump Sees ‘Warmer Feelings’ as Schumer Sounds Off: Trade Update\n\n(Bloomberg) -- President Donald Trump continued to send positive vibes about getting a trade deal with China.\n\nBut as day two of U.S.-China trade talks got under way, Senate Minority Leader Chuck Schumer is criticizing any deal that would include breaks for Huawei Technologies Co., the Chinese telecom giant that’s raised national-security concerns in Washington.\n\n“A China mini deal? It must not include concessions on Huawei,” he tweeted just before the Chinese delegation arrived at the U.S. Trade Representative’s offices. “That’s what China wants most, and it would show tremendous weakness.”\n\nChinese Delegation Arrives for Day Two (Earlier)\n\nVice Premier Liu He and his team arrived around 9 a.m. and was greeted by USTR Robert Lighthizer, who’s celebrating his 72nd birthday on Friday, and Treasury Secretary Steven Mnuchin. Liu has a scheduled meeting with Trump at the White House at 2:45 p.m.\n\nThe talks led by Liu and Lighthizer are the first senior-level in-person talks since late July to try and end an 18-month trade war that is taking a toll on the global economy and U.S. manufacturing.\n\nStocks rose in Asia, Europe and the U.S. partly on expectations for a tariff ceasefire.\n\nOther key developments:\n\nForeign firms have a clear road map for full ownership of financial services companies in China. Overseas institutions can apply for total control of onshore ventures starting in 2020, the China Securities Regulatory Commission said Friday.\n\nMarkets cheered positive trade developments for China, the U.S. and Europe.\n\nFormer Trump adviser Steve Bannon told CNBC he “wouldn’t be surprised if they saw some interim deal.”\n\nChina plans to ask the U.S. to lift sanctions on its biggest shipping company at this week’s talks.\n\nSoybean prices are higher this week partly on expectations China will purchase more from the U.S.\n\nTrump Says Day One of Talks Went Well (Earlier)\n\nTrump on Thursday said the first day of high-level trade negotiations between the U.S. and China on Thursday went “very well” and that he plans to meet with the top Chinese negotiator Friday.\n\n“We just completed a negotiation with China, we’re doing very well, we’re having another one tomorrow. I’m meeting with the vice premier over at the White House, and I think it’s going really well,” Trump said Thursday. “We’re going to see them tomorrow, right here, and it’s going very, very well.”\n\nThe U.S. and China have both appeared willing to work toward a partial deal, and leave the more controversial issues for later discussions. However, Trump repeated on Wednesday that he would prefer a complete agreement. The core U.S. demands would commit China to cracking down on the alleged theft of intellectual property and stop forcing U.S. companies to hand over their commercial secrets as a condition of doing business in China.\n\nWithout progress, the U.S. is due to increase tariffs on about $250 billion of Chinese imports to 30% from 25% on Oct. 15. More duties on $160 billion of Chinese imports are due Dec. 15.", "description": "Trump Sees ‘Warmer Feelings’ as Schumer Sounds Off: Trade Update", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEE8L0VY_L.jpg", "published_at": "2019-10-11"}