{"pub": "guardian", "url": "https://theguardian.com/football/2019/sep/10/gareth-southgate-praises-raheem-sterling-defensive-errors", "downloaded_at": "2019-09-11 14:00:40.639412+00:00", "title": "Southgate worried by England's 'ridiculous' mistakes in 'crazy' win over Kosovo", "language": "en", "text": "Gareth Southgate said he was concerned with the ridiculous, crazy and basic errors that littered England’s victory over Kosovo as he hailed Raheem Sterling for an “unstoppable” display in the Euro 2020 qualifier.\n\nThe England manager was highly critical of his team’s defending at St Mary’s Stadium despite a 5-3 win extending their immaculate record in qualification. England can secure their place at Euro 2020 with three matches to spare with victory in the Czech Republic next month. But Southgate admitted the individual mistakes that crept into the performance, following similar lapses against the Netherlands in the Nations League this summer, left major room for improvement.\n\nJadon Sancho the difference as blunders mar England’s 5-3 win against Kosovo Read more\n\nMichael Keane gifted Kosovo the lead after just 34 seconds with a wayward pass and the visitors struck twice early in the second half having trailed 5-1 at the interval. Harry Kane also missed a penalty in a chaotic game illuminated by Sterling’s brilliance and the first goals of Jadon Sancho’s international career.\n\n“It was bizarre. The outstanding features and the poor features are apparent to everybody, so we don’t need to get the video out and go back through it,” the England manager said. “Poor individual mistakes, a poor start to the game. I like the way we showed the composure to recover from that initial mistake and our use of the ball throughout the first half was excellent, right the way through the team.\n\n“The small period after half-time: ridiculous mistakes, poor decisions, lack of covering back. So, we made the game really uncomfortable for ourselves. There were obviously mistakes that were concerning. Whether it was the intensity of the game, whether it was the pressure, I don’t know. We’ve got to reflect on that but they were such basic errors, really, that you have to learn from. We just made some crazy errors.”\n\nEngland 5-3 Kosovo: player ratings from the Euro 2020 qualifier | Jacob Steinberg Read more\n\nBy contrast, England were formidable in attack with Sterling scoring once, providing three assists and hitting a post. Sancho scored twice and forced an own goal in his third competitive start for his country.\n\nSouthgate added: “Our attacking play from Raheem, Jadon and Harry was outstanding. Raheem’s two performances have been of the highest level. I think he’s been almost unstoppable, his awareness of where defenders were, his ability to ride challenges, his vision and desire to get in on goal, and unselfish play as well, so I couldn’t speak highly enough of the way he played. Jadon – you know we were talking about the three on Saturday – Jadon’s performance was at that level as well. He worked really hard for the team without the ball and showed the ability he has to go past people, to be calm in tight areas. So, that part of our game was absolutely outstanding. We continued that threat for most of the game.”\n\nThe Kosovo manager, Bernard Challandes, said Sterling was one of the best players in the world on current form. “It is impossible to play against him,” he said. “I know Sterling in the past was very speedy but the last choice or shot was not good. Now he is incredible. He has learned a lot from Guardiola and is one of the best players in the world now.”\n\nSouthgate denied England’s error-strewn display stemmed from his philosophy of playing out from the back and insisted it was an individual concern. He said: “We haven’t got caught being pressured in our own six-yard box. The errors in Guimãraes were basics and the errors tonight were basics, so that’s nothing to do with any philosophy. We didn’t play out any more than Kosovo did. I don’t think our mistakes came from playing ridiculous errors or taking unnecessary risks.\n\n“I know we were saying international football was dull but that wasn’t the case tonight. Did it go exactly as I hoped it would have gone? No, but I’ve got to balance the two performances, the nine goals and what we’ve achieved this week against the obvious errors that will cost you, have cost us tonight, and of course would cost us against better opposition.”", "description": "The England manager, Gareth Southgate, called Raheem Sterling ‘almost unstoppable’ but also highlighted ‘poor’ mistakes in the 5-3 victory over Kosovo", "authors": ["Andy Hunter"], "top_image": "https://i.guim.co.uk/img/media/e9877b42707847719be34cb62d0b4a68ffe8f3eb/0_61_5077_3048/master/5077.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=be859eb05c4caf69a97a19914d0ebf5c", "published_at": "2019-09-10"}