{"pub": "businessinsider", "url": "https://businessinsider.com/army-night-vision-future-goggles-rifles-drones-2019-10", "downloaded_at": "2019-10-07 20:27:55.510041+00:00", "title": "The US Army wants to combine its powerful new night-vision goggles and its new pocket-sized spy drones so soldiers can see the battlefield like never before", "language": "en", "text": "The US Army recently fielded L3's Enhanced Night Vision Goggles - Binocular (ENVG-B) with the Family of Weapon Sights - Individual (FWS-I), systems that give soldiers an improved ability to operate in the dark, as well as accurately shoot from the hip and around corners.\n\nThe service has also fielded Black Hornet personal reconnaissance drones, part of the Soldier Borne Sensor (SBS) program, that allow soldiers to deploy pocket-sized unmanned aerial vehicles for reconnaissance missions without leaving their cover.\n\nThe Army is now considering integrating the ENVG-B and SBS \"to provide dismounted leaders a live video feed\" from the mini drones inside their goggles, Business Insider learned Monday.\n\nThe US Army recently fielded new night-vision goggles that give soldiers the ability to not only see and maneuver better in the dark but also shoot accurately from the hip and around corners, and there may be more to come for this technology.\n\nThe Army is thinking about integrating video feed from already operational mini-drones into these next-level optics, the Army told Business Insider Monday.\n\nToward the end of September, the Army began fielding the L3's new Enhanced Night Vision Goggles - Binocular (ENVG-B) and accompanying BAE System's Family of Weapon Sights - Individual (FWS-I), giving this equipment to soldiers in the 2nd Brigade Combat Team, 1st Infantry Division at Fort Riley, Kansas.\n\nRead more: A Marine tore up distant targets while lying on his back and shooting backwards over his shoulder with the help of this new weapons tech\n\nThe first 40 goggles were delivered to soldiers at Fort Riley on Sept. 23. By the end of this year, over 600 will have been fielded. Over the course of 2020, the Army will hand these systems out to more than 10,000 soldiers in seven Brigade Combat Teams and one Security Force Assistance Brigade.\n\nThe new binocular goggles offer improved situational awareness, vision in the presence of various battlefield obscurants, depth perception and mobility while rifles equipped with the new weapon sights allow soldiers to see where the weapon (either the M4A1 Carbine or the M249 Squad Automatic Weapon) is pointed for rapid target acquisition and improved marksmanship.\n\nArmy soldiers equipped with the ENVG-B Army Futures Command\n\nBack in March, the Army started fielding FLIR Black Hornet personal reconnaissance drones, pocket-sized nano drones that are part of the Soldier Borne Sensor (SBS) program, to soldiers in the 3rd Brigade Combat Team, 82nd Airborne Division at Fort Bragg, North Carolina. These soldiers deployed to Afghanistan with this technology in July.\n\nRead more: US soldiers in Afghanistan are patrolling like never before with these awesome pocket-sized spy drones\n\nThese small, lightweight drones can be carried on a utility belt or in a pack, launched with relative ease, and provide covert surveillance out to roughly 1.5 miles for about half an hour. This technology allows soldiers to conduct recon missions without leaving their cover.\n\nFLIR Black Hornet III FLIR Systems\n\nAs the Army looks to the future of systems designed to boost soldier lethality, the service is considering the \"integration of the Soldier Borne Sensor (SBS) into the ENVG-B display to provide dismounted leaders a live video feed from the SBS,\" documents provided to Business Insider by PEO Soldier revealed.\n\nThe video would be available inside a soldier's goggles, most likely in a picture-in-picture format, as the FWS-I currently is. With advanced add-ons like the FWS-I and the SBS, the new goggles could give US soldiers a critical edge in battle, both at night and during the day.\n\n\"This capability started from a 'what if' within PEO Soldier and is in the very early stages of integration with no timelines or exact requirements in place,\" a PEO Soldier spokesman said.\n\nThe project was, however, characterized as a short-term effort. Long-term objectives include weapon sight (FWS) developments for snipers and mounted gunners.", "description": "US Army soldiers may soon be able to see live video from pocket-sized personal spy drones inside their already game-changing night-vision goggles.", "authors": ["Ryan Pickrell"], "top_image": "https://image.businessinsider.com/5cddc588021b4c0b0d323edd?width=1200&format=jpeg", "published_at": "2019-10-07"}