{"pub": "yahoo", "url": "https://news.yahoo.com/rachel-hollis-shares-her-tips-making-last-2-121632584--abc-news-lifestyle.html", "downloaded_at": "2019-10-30 12:33:40.451122+00:00", "title": "Rachel Hollis shares her tips on making the last 2 months of 2019 count", "language": "en", "text": "Rachel Hollis shares her tips on making the last 2 months of 2019 count originally appeared on goodmorningamerica.com\n\nJan. 1 is just two months away, which means many people will soon start to think about next year's New Year's resolutions.\n\nRachel Hollis, the motivational speaker and bestselling author of \"Girl, Stop Apologizing\" and, \"Girl, Wash Your Face,\" does things exactly the opposite.\n\n(MORE: Rachel Hollis on what women get wrong about self-care)\n\nShe sets her New Year's resolutions now and then spends the last months of the year working to make them happen.\n\nHollis's Last 90 Days program is one of her most popular, with tens of thousands of people using the #Last90Days hashtag on social media to share their successes.\n\nRead below for Hollis's tips to make the last months of the year as impactful as possible.\n\n***************\n\nHow to finish off the year stronger than you started\n\nRemember when you said at the beginning of January that this was going to be \"the year\"? This would be the year that you finally stuck with your New Year's resolution -- but then life caught up to you and you fell off track. Well, we're in the last two months of 2019.\n\nThe last two months, you guys! And not just that, it’s the end of a decade!\n\nHow many of you feel like the year just flew by? How many of you can't believe we're here nearing November? You've got two months until New Year's Eve. Two months until -- if you're like me -- you make goals or resolutions about what you'd like to accomplish and who you'd like to be.\n\nWell, you are way more likely to achieve your New Year's goals if you end your year flying high instead of crashing and burning.\n\nThink of it like this: If you needed to climb to the 20th floor of a building and you're already on the 10th floor, does it make sense to go back down to the basement and start all over in January? No way! We're already here. Maybe we charged up the 10 flights last January or maybe it took us all of 2019 to get to this place, but dang it, we're here. It doesn't make any sense to blow it all now. But the thing is, that's exactly what we do when we mail it in at the end of the year! You throw away any momentum you have and keep resetting in January and you wonder why you can't even get across the finish line. You can't get across the finish line because you keep leaving the race! What if we try something new? What if we reset our intentions and keep working our way up the remaining flights? What if we find the energy and momentum today that we usually reserve for Jan. 1? An object in motion stays in motion, and I say we don't stop moving.\n\nHere's the deal: If you want to see real and lasting change you've got to change your whole life and your whole outlook. No pressure, right? I know it seems like a massive ask, but honestly, you only have to take this one day at a time.\n\nThey say if you do something for 21 days it becomes a habit, but if you do it for 90 days it becomes who you are. That's what we're interested in -- not a quick adjustment or a short-term solution, but a total upgrade to the life we're currently living. The way to do that is by committing to change individually, and by committing as a community to hold each other accountable and lift each other up and that starts here. This is why I started the #Last90days Challenge. Each week of our challenge is themed around a different topic based on the things my community has told me they struggled with most: procrastination, anxiety, self-doubt, relationships, health, fitness, relationships -- we're going to work to change our perception on every single one.\n\nBesides challenging ourselves weekly we will also challenge ourselves daily. I call it \"Five to Thrive,\" and we're going to do these things every single day, for 90 days, my friends. Any one of them, formed into a habit, will brighten your outlook. The combination of them all, will utterly change your life.\n\nEvery day, I want you to ...\n\n1. Get up an hour earlier than you normally do and use the time for yourself. Workout, pray, meditate, read, work on your novel, get started on your 10,000 steps -- whatever it is, just commit to something that makes you feel great! Everyone constantly says they don't have enough time for self-care. I call bull-crap! You make the time. So every day for the rest of the year, commit to waking up an hour earlier. You'll be shocked at all you can accomplish.", "description": "Jan. 1 is just two months away, which means many people will soon start to think about next year's New Year's resolutions.  Rachel Hollis, the motivational speaker and bestselling author of \"Girl, Stop Apologizing\" and, \"Girl, Wash Your Face,\" does things exactly the opposite", "authors": ["Gma Team"], "top_image": "https://s.yimg.com/uu/api/res/1.2/0m7M0936lBVviei_5y3Ynw--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.gma.com/190311_gma_hollis4_839_hpMain_16x9_992.jpg", "published_at": "2019-10-30"}