{"pub": "washingtonpost", "url": "https://washingtonpost.com/entertainment/theater_dance/bob-dylan-bare-chested-swans-a-dancer-in-her-80s-two-unorthodox-swan-lakes-for-today/2019/09/03/e1d10c1a-bf6c-11e9-aff2-3835caab97f6_story.html", "downloaded_at": "2019-09-04 23:40:11.344573+00:00", "title": "Bob Dylan, bare-chested swans, a dancer in her 80s: Two unorthodox ‘Swan Lakes’ for today", "language": "en", "published_at": "2019-09-03", "text": "\n\nMichael Keegan-Dolan’s “Swan Lake.” (Marie Laure Briane)\n\nAt a time of upended status quos across the cultural landscape, two gutsy reinterpretations of “Swan Lake” this season fit right in, promising to toss out tradition and shine a bright new light on the story.\n\nThe time-honored version of the ballet, prized as it is for its transcendent beauty, rides on female stereotypes — innocent Odile as a fey victim dependent on a man, and wicked Odette as the boyfriend-stealing sexual predator. Adaptations by Ireland’s Michael Keegan-Dolan and Britain’s Matthew Bourne steer clear of anything so predictable. For instance, a commanding 84-year-old woman has a prominent role in Keegan-Dolan’s “Locho na hEala” (“The Lake of the Swan” in Irish) at the Brooklyn Academy of Music Oct. 15-20.\n\nIt isn’t Keegan-Dolan’s style to follow convention. Every couple of years — or whenever inspiration strikes — he invites dancers to collaborate on a new project, calling the group Teac Damsa, or “House of Dance.” They work at his home in the small coastal town of Dingle, in Ireland’s County Kerry (lately a hot tourist spot; the last two Star Wars movies were shot nearby). Keegan-Dolan moved there to be immersed in the native Irish language, which should give you a sense of what kind of “Swan Lake” he has created. Keegan-Dolan’s version looks beyond the 19th-century treatment to older folk tales about people being turned into animals and birds as punishment, and reaches forward, pulling in aspects of modern Irish life.\n\nAt 75 minutes, this eclectic work is surreal and industrial looking all at once. The lake is black plastic. Keegan-Dolan has tossed out the Tchaikovsky score and remodeled the traditional character of Von Rothbart, the evil sorcerer, into a holy man who addresses the audience in monologues and takes on multiple identities. He also sings Bob Dylan’s “A Hard Rain’s a-Gonna Fall.” Live musicians contribute most of the music, which veers toward traditional Irish. The prince is a fellow named Jimmy O’Reilly, who happens to be suicidal.\n\n“Depression is common,” Keegan-Dolan said in a recent phone interview from Dingle, where he had to step outside his house to get a connection. “And it is universal, and it is almost necessary, like winter is necessary for things to regenerate.”\n\nIt was the notion of a depressed prince that attracted Keegan-Dolan to “Swan Lake.” Depression has surfaced in his family, and he thought it could explain why the ballet’s leading man is typically depicted as a loner, uninterested or unable to connect with the people around him.\n\n“That aspect of the prince is much more interesting to me than a prince who’s 6 feet tall with a great chin and blond hair,” he said. “So you can take a childish, perhaps silly story that’s founded on a profound mythology, and it has all this information that might help one navigate life.”\n\nHow so?\n\n“How long do you have?” Keegan-Dolan replied, chuckling. “Basically, it’s this: Somehow one could walk away from a performance thinking it’s okay that these darker emotions take hold of us. We don’t need to be ashamed of them. They’re part of life.”\n\n\n\nMatthew Bourne’s “Swan Lake” swaps out the traditional female corps de ballet with men in feathered breeches. (Kristian Dowling/Getty Images)\n\nBourne’s “Swan Lake,” coming to the Kennedy Center on Jan. 21-26 with its thunderous flock of hairy, shirtless and homoerotic male swans, isn’t what you’d call experimental — after all, it played on Broadway. But it challenged expectations of what “Swan Lake” could be and now features some updates since its explosive 1995 premiere, when Bourne shocked and thrilled audiences (and angered some) by swapping out a corps de ballet in tutus for glistening men in feathered breeches.\n\nThe story centers on a modern royal family beset by scandal. The queen is struggling to put things right, yet the heir apparent (one can’t help but compare him to a young Prince Charles) wants none of it; he’s having doubts about his sexual identity and his future. His tender duet with a male swan created a stir and prompted some walkouts in the work’s early outings, but 24 years later, that feels like a different age.\n\nIt’s the timelessness of Bourne’s approach that will be tested by this revival tour. Indeed, the quest for acceptance and resiliency in the face of loss are its major themes, just as they are in the traditional, classical “Swan Lake.”\n\n\n\nBe prepared, however, for twists. Bourne takes inspiration from the whirling glamour of Fred Astaire and Ginger Rogers, and from Alfred Hitchcock’s “The Birds,” to deliver fresh views of what love, romance and midnight hookups look like. And even what a Tchaikovsky waltz can look like.\n\nEspecially when miniskirted molls in a back-alley dive are leading it.", "description": "Michael Keegan-Dolan and Matthew Bourne knock the classical ballet sideways.", "authors": ["Sarah L. Kaufman", "Dance Critic Covering Arts", "September At Pm", "Sarah L. Kaufman Is The Pulitzer Prize-Winning Dance Critic Of The Washington Post", "Is The Author Of", "The Art Of Grace", "On Moving Well Through Life.", "She Writes About The Arts", "Entertainment", "The Union Of Art"], "top_image": "https://www.washingtonpost.com/resizer/nt_gi_Fd6sbHC9mOrDAi5GdUgRA=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CUNUX2GALEI6TJOGDZ2PP3CKSM.jpg"}