{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7542793/Millie-Bobby-Brown-looks-chic-lilac-jumpsuit-kicks-glittering-heels.html", "downloaded_at": "2019-10-06 11:43:45.756583+00:00", "title": "Millie Bobby Brown looks chic in a lilac jumpsuit but kicks off her glittering heels", "language": "en", "text": "She's a dedicated follower of fashion, walking the red carpet in the most coveted designer gowns.\n\nBut on Saturday Millie Bobby Brown fell victim to the perils of fashion, kicking off her heels for a more comfortable exit from a fan meet and greet event at an Ulta Beauty outlet in the U.S.\n\nThe Stranger Things star, 15, showed off a cute lilac jumpsuit with an open collar and waist sash as she emerged barefoot from the store, heels in hand.\n\nNot so strange! Millie Bobby Brown, 15, kicked off her heels for a more comfortable exit from a fan meet and greet event at an Ulta Beauty outlet in the U.S on Saturday\n\nLooking every inch the burgeoning film star, Millie rocked her beautiful outfit which was complemented by her golden-tipped brunette tresses.\n\nThey hung in soft waves over her shoulders and she carried her pink heels in her hand.\n\nThe appearance comes after the star put on a stylish display last month when she launched her Florence by Mills beauty range at a London Boots store.\n\nChic: The Stranger Things star, 15, showed off a cute lilac jumpsuit with an open collar and waist sash as she emerged\n\nShe earlier announced plans for the new range in an Instagram video.\n\nShe explained: 'Every young person deserves to have a good start with their skin.'\n\n'I wanted it to be vegan, clean, cruelty-free, that would be easy to get and fun to use, and still youthful, but you know, playing that sophisticated teenager as well.'\n\nSay cheese: It comes after the star put on a stylish display last month when she launched her Florence by Mills beauty range at a London Boots store\n\nHey guys: The star donned a pair of sunglasses to greet waiting fans outside the venue\n\nMillie added: 'What I want my beauty brand to represent is individuality, and embrace who you are. All I know is that I want you to feel yourself.'\n\nIn the caption to the Instagram promotion, she revealed that she had spent two years developing the line for her age group.\n\nThe actress plays Eleven in the hit TV series Stranger Things and was nominated for an Emmy award for her performances.\n\nHer film debut came earlier this year with her role in Godzilla: King Of The Monsters.", "description": "The Stranger Things star, 15, showed off a cute lilac jumpsuit with an open collar and waist sash as she emerged barefoot from an Ulta Beauty store in the U.S.", "authors": ["Harry Howard For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/09/19355680-0-image-a-19_1570349377275.jpg", "published_at": "2019-10-06"}