{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Culture/lizzie-mcguire-cast-announcement-stars-reprise-roles-jo/story?id=66511045", "downloaded_at": "2019-10-25 00:04:24.545922+00:00", "title": "'Lizzie McGuire' cast announcement: Stars to reprise their roles as Jo, Sam and Matt McGuire", "language": "en", "text": "The McGuires are back!\n\nInterested in Disney? Add Disney as an interest to stay up to date on the latest Disney news, video, and analysis from ABC News. Add Interest\n\nDisney announced Thursday that Hallie Todd, Robert Carradine, and Jake Thomas will reprise their roles as Jo, Sam, and Matt McGuire in the new \"Lizzie McGuire\" series for Disney+.\n\nAs previously announced, Hilary Duff will star as Lizzie.\n\n\"Lizzie McGuire\" premiered on Disney Channel in 2001, and starred Duff, now 32, as a 13-year-old trying to navigate teenage life with the help of her animated self. In the new series, in which Duff plays 30-year-old Lizzie who's working as an apprentice to a New York City-based interior designer, the cartoon will also be prominent.\n\n“We are incredibly excited to bring back one of the most popular Disney Channel series of all time along with some beloved and familiar faces,” said Ricky Strauss, president of content and marketing for Disney+. “With Terri at the helm and Hilary, Hallie, Robert, and Jake back after all these years, it’s our honor to welcome the McGuire family into the Disney+ family.”\n\n\"Just like there is no Lizzie McGuire without Hilary Duff, there is no McGuire family without Hallie, Robert, and Jake,\" added Gary Marsh, president and chief creative officer of Disney Channels Worldwide. \"The original series holds a special place in the hearts of so many, and we can't wait to introduce fans, both old and new, to an older, wiser, yet still perfectly imperfect Lizzie.\"\n\nDuff recently talked to \"Good Morning America\" about stepping back into the role.\n\n\"She is everyone's best friend and there are big hurdles to climb over when you're 30,\" Duff said. \"If she can be there for all the ... women that are going through what she's going through, I am so happy to step into the shoes again.\"", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/lizzie-mcguire-ht-er-191024_hpMain_16x9_992.jpg", "published_at": "2019-10-24"}