{"pub": "foxnews", "url": "https://foxnews.com/us/ohio-sex-sting-104-arrested-doctor-church-youth-director", "downloaded_at": "2019-09-20 12:59:01.360789+00:00", "title": "Ohio child sex trafficking sting nabs more than 100, including church leader, ER doctor: report", "language": "en", "text": "More than 100 people, including a medical doctor and a church youth director, were arrested as part of a massive human trafficking and child sex sting operation based in central Ohio, according to a report.\n\nThose arrested included 24 men caught when they showed up at an undisclosed location with the intention of meeting a child for sex, Maj. Steven Tucker of the Franklin County Sheriff's Office said.\n\n\"They show up with sex toys, they show up with lubrication,\" Tucker said. \"They show up with things that clearly somebody isn't going to show up to a house with, unless they intended to engage in sexual activity.\"\n\n\"They show up with sex toys, they show up with lubrication. They show up with things that clearly somebody isn't going to show up to a house with, unless they intended to engage in sexual activity.\" — Maj. Steven Tucker, Franklin County Sheriff's Office\n\nALLEGED ‘MADAME’ OF CHICAGO SEX ‘DUNGEON’ FACING FEDERAL PROSTITUTION AND FINANCIAL CHARGES: REPORT\n\nThe 24 suspects were charged with attempted unlawful sexual conduct with a minor and importuning, Columbus’ WBNS-TV reported.\n\nThe total group of 104 suspects included Christian Gibson, 26, a former youth director at Redeemer's at Courtright Church in Columbus, and Austin Kosier, 31, an emergency room doctor, authorities said, adding that the sting was focused on Franklin, Fairfield and Delaware counties.\n\nTucker said he oversaw the investigation carried out by the Internet Crimes Against Children Task Force. Officers would pose as underage boys or girls online and communicated with the men in Internet chats.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nOhio Attorney General Dave Yost said the four-part simultaneous operation involved more than 30 law enforcement agencies. The probe also focused on nailing those who went beyond preying on children to have sex with them and also sought to sell vulnerable individuals into human trafficking.\n\n\n\nAmong those arrested, 36 men were charged with trying to buy sex and one man was arrested for promoting prostitution. Forty-three women were arrested for selling sex — they were connected with social services aimed at rehabilitating human trafficking victims, WBNS-TV reported.", "description": "More than 100 people, including a medical doctor and a church youth director, were arrested as part of a massive human-trafficking and child-sex sting operation based in central Ohio, according to a report.", "authors": ["Danielle Wallace", "Maj. Steven Tucker", "Franklin County Sheriff'S Office"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/ohio-sex-sting.jpg", "published_at": "2019-09-20"}