{"pub": "yahoo", "url": "https://news.yahoo.com/capitol-hill-drafts-sanctions-turkey-224351475.html", "downloaded_at": "2019-10-11 20:24:15.246134+00:00", "title": "Trump’s GOP Allies Are Livid at His Inaction on Turkey", "language": "en", "text": "Capitol Hill managed a rare show of unity on Wednesday, as lawmakers from both parties recoiled in horror at a lightning-fast Turkish invasion of Kurdish territory in Syria and coalesced around the idea of responding through tough new sanctions on Turkey.\n\nAnd nearly every single one—regardless of party—blamed President Donald Trump for starting it all, when he abruptly announced on Sunday the withdrawal of U.S. forces from Kurdish lands in northern Syria.\n\nSen. Lindsey Graham (R-SC), who spent the week engaging in a lengthy Twitter tirade against the president’s decision, ratcheted up his rhetoric on Wednesday morning against Turkey and the administration.\n\n“Pray for our Kurdish allies who have been shamelessly abandoned by the Trump Administration. This move ensures the reemergence of ISIS,” Graham tweeted on Wednesday. “Will lead effort in Congress to make Erdoğan pay a heavy price.”\n\nBy Wednesday afternoon, Graham announced legislation with Sen. Chris Van Hollen (D-MD) that would impose aggressive new sanctions on Turkey.\n\nThe bill would sanction the U.S. assets of top Turkish leaders, including President Recep Tayyep Erdoğan; it also would punish any foreign individual or entity who sells weapons or provides military aid to Turkey, or supports the country’s domestic energy industry.\n\nVan Hollen, meanwhile, tweeted on Wednesday morning that Turkey must pay a “heavy price” for its actions. “Senators on both sides of the aisle won't support abandoning the one regional group most responsible for putting ISIS on its heels.”\n\nTrump himself initially promised to impose crippling sanctions on Turkey if they moved forward with military action against the Kurdish ethnic minority, which has been a steadfast partner to American military efforts in the region for years but is viewed as a terrorist element by Erdoğan.\n\n“If Turkey does anything that I, in my great and unmatched wisdom, consider to be off limits, I will totally destroy and obliterate the Economy of Turkey,” he tweeted.\n\nBut by Wednesday afternoon, Trump appeared less committed to the fire and fury in the wake of the invasion, but indicated he had no problem with Graham’s sanctions and still promised to “wipe out” Turkey’s economy if Erdoğan attempted to “wipe out” the Kurds.\n\n“We’re speaking to both sides. We’ve told President Erodgan how we feel, but we are speaking to both sides and we’re seeing what can be made out of a situation, but we have no soldiers in the area,” Trump told reporters when asked about the decision to abandon the Kurds. “We are getting out of the endless wars. We have to do it.”\n\nThe president then, appearing to cite an article on TownHall.com, added the Kurds, “didn’t help us in the Second World War, they didn’t help us with Normandy as an example” … “but they’re there to help us with their land, and that’s a different thing.”\n\n“With all of that being said, we like the Kurds,\" he said.\n\nBy the time Trump spoke, Graham and like-minded lawmakers had already determined a tough response was warranted. “While the Administration refuses to act against Turkey, I expect strong bipartisan support,” Graham said of his legislation.\n\nIndeed, criticism was widespread in the GOP ranks for Trump’s move. While Rep. Kevin McCarthy (R-CA), the top House Republican, slammed the move by calling on Turkey to stop it instead of mentioning Trump, Rep. Liz Cheney (R-WY), the number three House Republican, named names.\n\nThe president’s decision to withdraw is “having sickening and predictable consequences,” said Cheney. “The U.S. is abandoning our ally the Kurds, who fought ISIS on the ground and helped protect the U.S. homeland… This action imperils American security and that of our allies. Congress must and will act to limit the catastrophic impact of this decision.”\n\nThe quick turn of events—one of the harshest rebukes yet of GOP establishment foreign policy from a president who never warmed to it in the first place—has left many Republicans on the Hill scratching their heads. “We have maybe one senator happy about this decision,” a GOP staffer told The Daily Beast. “It perplexes me that we’re in a position where the majority of Republicans who will carry the banner of Republicans in the post-Trump era are, saying this is not good.”", "description": "Deilil Souleiman/GettyCapitol Hill managed a rare show of unity on Wednesday, as lawmakers from both parties recoiled in horror at a lightning-fast Turkish invasion of Kurdish territory in Syria and coalesced around the idea of responding through tough new sanctions on Turkey. And nearly every single", "authors": ["Sam Brodey"], "top_image": "https://s.yimg.com/uu/api/res/1.2/gvz0IBx9XelpEHZLHISzvw--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/986b5cec977ee801b32576baf7143498", "published_at": "2019-10-09"}