{"pub": "japantoday", "url": "https://japantoday.com/category/rugby-world-cup-2019/wales-wary-of-fit-french-ahead-of-world-cup-quarter-final", "downloaded_at": "2019-10-16 23:15:11.764135+00:00", "title": "Wales wary of fit French ahead of World Cup quarterfinal", "language": "en", "text": "By Julian GUYER\n\nWales will be up against an increasingly fit France in Sunday's World Cup quarterfinal in Oita according to their conditioning expert Paul Stridgeon.\n\nThe physically grueling and heavyweight Top 14 has often been held to blame for leaving France's players underprepared for the more dynamic nature of modern test rugby.\n\nBut Wales physical performance manager Stridgeon, whose CV includes several years in France with a star-studded Toulon side featuring Jonny Wilkinson and Matt Giteau, said that perception was out of date.\n\n\"I think it has changed in the last three, four, five years definitely,\" Stridgeon told reporters at Wales's hotel in Beppu. \"There's a lot of foreign conditioners gone into the French game and the French conditioners have changed their approach about how they train people to play rugby.\"\n\nStridgeon, who was drafted into the Welsh set-up for the 2015 World Cup, said the particular grinding nature of French club rugby had to be taken into consideration as well.\n\n\"It's not as much of a running based game, there's a lot more scrum and maul, so the players have to be fit for a different kind of game,\" he said. \"People sometimes forget they need big scrummaging props, big props who couldn't run around as much as some smaller props in other unions but they are great for the French game.\"\n\nStridgeon's counterpart in the French set-up is someone he knows well.\n\nThibault Giroud played rugby and American football to a high level and also went to the Salt Lake City Winter Olympics in 2002 as a part of the French bobsleigh team.\n\nHe then became a strength and conditioning coach, starting at Saracens in England before heading to Pau, Biarritz and Glasgow Warriors.\n\nThe 45-year-old is now on Stridgeon's old beat at Toulon.\n\n\"I've got a lot of respect for Thibault,\" said Stridgeon. \"I think the French team are in good shape. He's obviously had a big effect.\"\n\nFrance, who have lost four players to injury since the start of the World Cup, will go into the quarterfinal on the back of an unexpectedly long break after their final pool game against England was cancelled because of Typhoon Hagibis.\n\nWales, by contrast, have won all four of their pool games at a World Cup for the first time since the inaugural 1987 edition, when they achieved their best placing of third, with Stridgeon adamant that was a \"massive achievement\" for Warren Gatland's men.\n\n\"You can look at it both ways,\" added Stridgeon, who made his international coaching reputation with his native England and on three tours with the British and Irish Lions.\n\n\"They (France) have had a rest and is that a good thing for them? But they have missed a game as well. Are you game fit, are you ready to go?\"\n\nWales won this season's Six Nations Championship with a Grand Slam but only after coming from 16-0 down at half-time to beat France 24-19 in their opening match in Paris.\n\nStridgeon reckoned it was too simplistic to put Wales' Stade de France revival down to superior fitness alone.\n\n\"People always think that if you have won in the last 20 minutes it means you are fitter than them. We work on repeatability and being able to do things at maximum intensity and hopefully in the last 20 minutes of games that pays off,\" he added.\n\n© 2019 AFP", "description": "Wales will be up against an increasingly fit France in Sunday's World Cup quarterfinal in Oita according to their conditioning expert Paul Stridgeon. The physically grueling and heavyweight Top 14 has often been held to blame for leaving France's players underprepared for the more dynamic nature of modern test rugby.…", "authors": [], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/2f/02/ad3ecc4e9a152bf271f58932238aa5bae97d/2f02ad3ecc4e9a152bf271f58932238aa5bae97d.jpg", "published_at": "2019-10-16"}