{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7547555/New-Microsoft-patent-shows-technology-VR-floor-mat-paired-Xbox.html", "downloaded_at": "2019-10-07 23:39:13.106758+00:00", "title": "New Microsoft patent shows technology for VR floor mat that is paired with an Xbox", "language": "en", "text": "Microsoft could be secretly developing a virtual reality mat that helps users avoid obstacles and be fully immersed in a digital world.\n\nThe tech giant has recently filed a patent for a 'virtual reality floor mat activity region' that uses a guardian system to display warnings when users leave the 'play place'.\n\nThe documents also hints that Xbox could soon support virtual reality, as it includes images of the virtual reality hardware being used with the gaming console.\n\nScroll down for video\n\nMicrosoft as filed a patent for a 'virtual reality floor mat activity region' that uses a guardian system to display warnings when users leave the 'play place'. The documents also hints that Xbox could soon support virtual reality, as it includes images of the virtual reality hardware being used with the gaming console\n\nThe patent was filed in April 2018 and awarded on October 3, 2019.\n\n'A virtual reality experience is provided to one or more users by a computing system through the use of a special-purpose virtual reality mat,' reads the patent published by the US Patent & Trademark Office.\n\n'The computing system receives image data from an optical sensor imaging a physical environment.\n\n'The mat includes one or more fiducial markers that are recognizable by the computing system.'\n\nSenors could be arranged in the mat to monitor and detect the user's motions in order to alter the virtual world accordingly\n\nIt seems the technology was developed to deal with two major problems virtual reality faces: obstacles and being fully immersed.\n\nThe mat works with a guardian system that is designed to keep players safe by notifying them when they are 'approaching a boundary of the activity region' and helping them avoid obstacles.\n\nA warning will pop up in the display of the goggles, letting users know when they are in danger.\n\nThis technology, although does not sound very high-tech, could save many lives.\n\nJust last year, a Russian gamer was said to have died after falling through a glass table while immersed in a virtual world.\n\nAnother case occurred a year earlier in Russia, when a man and woman were hit by a car after they decided to play with virtual reality goggles in a car park.\n\nTHE TRILLION DOLLAR RISE OF MICROSOFT April 4, 1975 Microsoft founded by Bill Gates and Paul Allen June 25, 1981 Microsoft incorporates November, 1983 Microsoft Windows announced November, 1985 Microsoft Windows version 1.0 released February 26, 1986 Microsoft moves to corporate campus in Redmond, Washington where it is today March 13, 1986 Microsoft stock goes public August 1, 1989 Microsoft introduces earliest version of Office suite of productivity applications August 24, 1995 Microsoft launches Windows 95 1995 - Bill Gates, founder of Microsoft, becomes the richest man in the world aged 39 with a fortune of $12.9 billion at the time October 25, 2001 Microsoft launches Windows XP November 15, 2001 Microsoft launches Xbox October 21, 2003 Microsoft launches Microsoft Office System November 22, 2005 Microsoft launches Xbox 360 January 30, 2007 Microsoft launches Windows Vista and the 2007 Microsoft Office System to consumers worldwide June 28, 2011 Microsoft launches Office 365 April 24, 2019 Microsoft becomes the third company in the world to peak at more than $1 trillion in market capitalization value\n\nThe patent also describes including pressure sensors in the mat.\n\n'A virtual reality mat may include a plurality of spatially distributed pressure sensors integrated into the mat to detect a physical pressure or force applied to an activity surface of the mat,' it reads.\n\n'Such pressure sensors enable the virtual reality system to identify where the user is standing in relation to the mat, without necessarily requiring that the user be visually detected by an optical sensor.'\n\nAnd it could use the gamer's motions to manipulate the digital world.\n\n'The floor mat may include one or more vibration devices integrated into the floor mat to generate vibration at the floor mat; and the virtual reality experience may be augmented by generating vibration at the floor mat via at least one vibration device of the one or more vibration devices.'\n\nThe main illustration of the patent shows a person sporting a pair of VR goggles, using a Kinect controller and standing on the sensor fitted mat -- and in the corner on the television stand sits an Xbox.\n\nThis picture suggests that Microsoft may not have completely given up on the idea of developing a gaming console with virtual reality capabilities.\n\n'In some examples, (the) computing device may take the form of a gaming console, and (the) HMD device and peripheral control devices (…) may be peripheral to the gaming console,' reads the document.", "description": "Microsoft could be developing a VR floor mat that pairs with an Xbox -- suggesting the next gaming console could have VR capabilities. The mat is said to help users avoid obstacles.", "authors": ["Stacy Liberatore For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/20/19410504-0-image-a-9_1570476908437.jpg", "published_at": "2019-10-07"}