{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/airlines-begin-telling-you-how-to-avoid-sitting-next-to-a-baby-sparking-hope-for-wider-adoption", "downloaded_at": "2019-09-28 12:42:11.283461+00:00", "title": "Airlines Begin Telling You How To Avoid Sitting Next To A Baby, Sparking Hope For Wider Adoption", "language": "en", "text": "Photo: Getty\n\nAt least two airlines have adopted the brilliant idea of allowing passengers to try to sit as far away as possible from auditory powder kegs — babies on aeroplanes.\n\nI can’t confirm this, but based on my decades of flying I believe it is a scientific impossibility for a baby to make it through an entire flight without wailing with the ferocity of someone who has slammed their fingers in an overhead bin. It’s also inevitable that if there is a baby on my flight, it will be seated within a couple of metres of me.\n\nAnd that’s fine! Babies have to fly too. I imagine parents travelling with babies have enough to worry about without arseholes giving them stink-eyes. So I just accept whatever damage is happening to my eardrums.\n\nBut if I ever fly Japan Airlines (JAL) or All Nippon Airways, I can counteract fate and book a seat that isn’t near a toddler.\n\nJAL recently announced it now uses a booking tool that displays where children aged two and younger are sitting. The Guardian reports that All Nippon Airways has already had this feature.\n\nThank you, @JAL_Official_jp for warnings me about where babies plan to scream and yell during a 13 hour trip. This really ought to be mandatory across the board. Please take note, @qatarairways: I had 3 screaming babies next to me on my JFK-DOH flight two weeks ago. pic.twitter.com/kQYQFIqqCD — Rahat Ahmed (@dequinix) September 24, 2019\n\nThe feature may not work if parents book through third-party services. JAL notes on its site the baby icons might not show a flight is changed right before departure.\n\nHopefully, airlines in the West will start adopting this tool. Though I imagine if this catches on, carriers will use it as a way to charge more for certain seats.", "description": "At least two airlines have adopted the brilliant idea of allowing passengers to try to sit as far away as possible from auditory powder kegs — babies on aeroplanes....", "authors": ["James Whitbrook", "Elizabeth Blackstock"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/zgi2gcbk35kc6a7sqa0s.jpg", "published_at": "2019-09-28"}