{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/demi-moore-56-naked-harpers-bazaar-153253922.html", "downloaded_at": "2019-09-13 00:57:27.576049+00:00", "published_at": "2019-09-12", "title": "Demi Moore, 56, goes naked for Harper's Bazaar: 'Looking as gorgeous as you always have'", "language": "en", "text": "Demi Moore has bared all once again — this time at age 56.\n\nAhead of the release of her memoir, the infamously raspy-voiced actress posed nude for October’s Harper’s Bazaar. She sits alongside a pool in the buff, wearing only an oversized pink hat.\n\nThe interview for the cover story was conducted by Lena Dunham and centers on Moore’s book, Inside Out. The Girls star describes it as “honest and arresting” as Moore writes about the “emotional poverty” she suffered after finding fame, “the sort that only decades of tabloid harassment and unchecked trauma can alchemize.” The book covers Moore’s “divorces, addiction and eventual isolation” with a “no-f**ks woman of wisdom.”\n\nBuzzy moments from the book include Moore recounting being a child and pulling pills out of her mother’s mouth as she overdosed, finding out the man who she thought was her father wasn’t and getting sober twice — in her 20s and again in her 50s.\n\nBut really it’s the cover, the cover, the cover that people are talking about. As Moore creeps toward 60, the Ghost, G.I. Jane and Indecent Proposal star receives praise for doing the shoot and looking so beautiful. On her page, the comments include, “Looking as gorgeous as you always have” and “How are you real?” with a little “aye Chihuahua” sprinkled as well as a Benjamin Button reference.\n\nPeople react to Demi Moore's nude Harper's Bazaar cover. (Screenshot: Demi Moore via Instagram) More\n\nPeople react to Demi Moore's nude Harper's Bazaar cover. (Screenshot: Demi Moore via Instagram) More\n\nPeople react to Demi Moore's nude Harper's Bazaar cover. (Screenshot: Demi Moore via Instagram) More\n\nPeople react to Demi Moore's nude Harper's Bazaar cover. (Screenshot: Demi Moore via Instagram) More\n\nPeople react to Demi Moore's nude Harper's Bazaar cover. (Screenshot: Demi Moore via Instagram) More\n\nPeople react to Demi Moore's nude Harper's Bazaar cover. (Screenshot: Demi Moore via Instagram) More\n\nPeople react to Demi Moore's nude Harper's Bazaar cover. (Screenshot: Demi Moore via Instagram) More\n\nPeople react to Demi Moore's nude Harper's Bazaar cover. (Screenshot: Demi Moore via Instagram) More\n\nPeople react to Demi Moore's nude Harper's Bazaar cover. (Screenshot: Demi Moore via Instagram) More\n\nOn the Harper’s Bazaar Instagram, however, there is a lot of criticism about excessive Photoshop and other enhancements.\n\nReactions to Demi Moore's nude Harper's Bazaar cover. (Screenshot: Harper's Bazaar via Instagram) More\n\nReactions to Demi Moore's nude Harper's Bazaar cover. (Screenshot: Harper's Bazaar via Instagram) More\n\nReactions to Demi Moore's nude Harper's Bazaar cover. (Screenshot: Harper's Bazaar via Instagram) More\n\nReactions to Demi Moore's nude Harper's Bazaar cover. (Screenshot: Harper's Bazaar via Instagram) More\n\nReactions to Demi Moore's nude Harper's Bazaar cover. (Screenshot: Harper's Bazaar via Instagram) More\n\nReactions to Demi Moore's nude Harper's Bazaar cover. (Screenshot: Harper's Bazaar via Instagram) More\n\nWhile it’s been a minute, Moore — whose next film, Corporate Animals, comes out on Sept. 20 — is no stranger to taking it off for a magazine cover. She was headline news back in 1991 when she graced the cover of Vanity Fair (“Demi’s Big Moment”) while naked and pregnant with her second child, Scout Willis.\n\nShe didn’t stop there. A year later, Moore did it again (“Demi’s Birthday Suit”) — that time with body paint. It was a whole decade of going bare, also covering Rolling Stone sans clothes in 1995.\n\nInside Out: A Memoir will be released on Sept. 24. Pre-order it here.\n\nRead more from Yahoo Entertainment:\n\nWant daily pop culture news delivered to your inbox? Sign up here for Yahoo Entertainment & Lifestyle’s newsletter.", "description": "Ahead of the release of her memoir, the infamously raspy-voiced actress posed nude for October’s Harper’s Bazaar.", "authors": ["Suzy Byrne", "Editor", "Yahoo Entertainment"], "top_image": "https://s.yimg.com/uu/api/res/1.2/al.PtcxyF9lBADD.Gzd4JQ--~B/aD0xMTgwO3c9MTY2NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/5e8f6910-d569-11e9-b6fe-205642125a4d"}