{"pub": "zdnet", "url": "https://www.zdnet.com/article/adobe-intros-new-commerce-tools-for-smb-mid-market-merchants", "downloaded_at": "2019-10-22 13:25:35.239883+00:00", "title": "Adobe intros new commerce tools for SMB, mid-market merchants", "language": "en", "text": "Adobe on Tuesday announced a bevy of updates to its commerce platform that aim to bring Adobe's enterprise-grade commerce capabilities to SMB and mid-market merchants. Key updates include the launch of an Amazon sales channel in Magento for Europe; the integration of the Magento commerce platform with Adobe Stock; a new product recommendations tool powered by Adobe Sensei; and a new multi-cloud infrastructure offering with Microsoft.\n\nBolstered by its acquisitions of Marketo and Magento, the SMB and mid-market segments are seen as key 2020 growth areas by Adobe CEO Shantanu Narayen. The company is now focused on extending its enterprise capabilities down market, pitching itself to SMB and mid-market customers as providers of agility, scalability, flexibility and value.\n\nAs for the commerce updates, the new Amazon sales channel in Magento, now available in the UK, automatically synchronizes product catalog, inventory and order information across Amazon and Magento. Merchants can manage Amazon orders and customer accounts within the Magento sales order grid.\n\n\"Amazon Sales Channel removes the barriers to entry for Magento merchants trying to gain a foothold in Amazon and reduces friction for those already selling on Amazon by allowingt hem to quickly integrate their catalog, establish a bi-directional data flow and start managing listings from their Magento admin,\" said Jason Woosley, VP of Commerce Product and Platform for Adobe.\n\nThe new product recommendations feature in Magento Commerce analyzes shopper behavior to help merchants generate highly personalized recommendations, which can be added to relevant store pages via widgets and flexible APIs. Adobe is rolling out an early access program for the feature in January.\n\nMeanwhile, the Adobe Stock integration with Magento will give Magento admins a searchable interface to find, preview and embed licensed stock images within the platform. Adobe Stock contains more than 130 million assets, including images, templates, 3D assets, stock videos, and premium collection images.\n\nOn the infrastructure side, Adobe is making Magento Commerce available on Microsoft Azure, in addition to its existing availability on Amazon Web Services. Adobe also announced the general availability of Magento 2.3.3, which includes several performance improvements and security enhancements.\n\nRELATED:", "description": "Key updates include the launch of an Amazon sales channel in Magento for Europe and a new multi-cloud infrastructure offering with Microsoft.", "authors": ["Natalie Gagliordi"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2019/05/13/34c2d20f-05c7-42df-a650-410262e65ae5/thumbnail/770x578/f23cd8adf0f6d275bea06ac343a976f4/istock-1007845610.jpg", "published_at": "2019-10-22"}