{"pub": "atlantic", "url": "https://theatlantic.com/international/archive/2019/09/ukraine-volodymyr-zelensky-ubiquity-transparency/598774", "downloaded_at": "2019-09-25 23:27:38.384328+00:00", "title": "Volodymyr Zelensky Plays Himself", "language": "en", "text": "The “movie interview,” as it has been dubbed in Ukraine, built on an earlier success, when Zelensky was interviewed on his party’s YouTube channel ahead of parliamentary elections in a scene reminiscent of Jerry Seinfeld’s Comedians in Cars Getting Coffee. Zelensky sat behind the wheel of a Tesla while an unseen and unnamed, but friendly, interviewer asked him questions. This effort has left journalists scrambling to make sense of a new genre that does not even pretend to include them.\n\nRead: What Edmund Burke can teach us about impeachment\n\n“We conducted analysis and realized that people do not want to watch the president at press conferences, in interviews with television channels, the media, or during short press encounters,” Kyryllo Tymoshenko, the deputy head of Zelensky’s office, said in an interview with Interfax-Ukraine. “They want to listen to him directly.”\n\nSo far the strategy seems to have been successful: Zelensky’s approval ratings are continuing to rise. With more than 70 percent approval, he is not only nearly 50 points ahead of his predecessor at the end of his term, but ahead of Russian President Vladimir Putin’s own ratings at home.\n\nThe question then becomes not whether the Ukrainian public likes what Zelensky and his team are doing when it comes to their use of social media—it does—but what role traditional media play in a democracy in this new age.\n\nZelensky’s chief of staff, Andriy Bohdan, argues that journalists—who he said are corrupt and need to “purify” themselves, in an interview with BBC News Ukrainian—are no longer necessary, and has said that a press conference with Zelensky will take place “when society demands such a press conference. So far society wants to communicate directly with the president, without intermediaries.” His argument is essentially that journalists have no role in deciding what the people want, and provide only one microphone of many the government can choose from.\n\nBut journalism in a democracy is not just the transmission of information. Journalism is supposed to act as a check on abuse of power by measuring leaders’ words against their actions, and stopping them from rewriting the record. Democracies everywhere are struggling to define the role of journalism in a world where the flow of information is relentless, giving the illusion of total transparency. In countries dealing with war and endemic corruption, such as Ukraine, the cost of that can be devastating. “Without rigorous journalism,” Matthew Schaaf, the director of Freedom House Ukraine, told me, “officials' statements will go unchecked, corruption will remain hidden, human-rights abuses will continue, and the public will be left in the dark.”\n\nThe limitations of Zelensky’s “direct communication” model have already started to become clear. A week before the Ukrainian prisoners were released in the exchange with Russia, Ukraine’s new prosecutor general shared a Facebook post written by a lower-ranking official, saying that the prisoners were heading home that day. Family members rushed to the airport to see their loved ones, only to have their hopes dashed when it turned out that the prosecutor general had not verified the information.", "description": "The president of Ukraine is easily found on social media, but rarely submits to journalists’ questioning.", "authors": ["Ian Bateson"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/RTX6VQTH/facebook.jpg?1569419819", "published_at": "2019-09-25"}