{"pub": "fox", "url": "https://foxnews.com/us/new-hampshire-snapchat-rumor-high-school-sexual-assault", "downloaded_at": "2019-09-15 23:11:01.101116+00:00", "title": "New Hampshire students circulate Snapchat rumor that student assaulted a dozen girls, but police say it's false", "language": "en", "text": "Allegations that a male New Hampshire high school student sexually assaulted a dozen female students — and that educators knew and failed to act — circulated on Snapchat, prompting students to walk out in protest last week. But investigators say \"no crimes\" seem to have been committed.\n\nThe allegations spread among students at Pinkerton Academy in Derry, according to Derry Police Capt. Vern Thomas, who said rumors that the student sexually assaulted a dozen female students quickly spread on the social media app.\n\nMICHIGAN STATE FINED $4.5M FOR FAILING TO RESPOND TO LARRY NASSAR SEXUAL ASSAULT COMPLAINTS\n\nBut despite the accusations, \"it appears no crimes were committed as alleged in the Snapchat posting,\" Thomas said in a news release, according to the New Hampshire Union Leader.\n\nThe social media post that found its way to a number of students claimed the accusations had been reported to administrators at Pinkerton, who did nothing in response. But school officials say nothing was ever reported to them.\n\nOn Thursday, the school's headmaster, Dr. Timothy Powers, explained the situation in a letter to parents, writing that on Wednesday and Thursday they learned of \"deeply disturbing\" allegations that constitute unacceptable behavior.\n\n\"We take allegations such as these extremely seriously, and we will not tolerate behavior that threatens the safety, health, and well-being of any member of our school community,\" Powers said.\n\nNEW HAMPSHIRE HIGH SCHOOL FOOTBALL PLAYERS SUSPENDED IN DUCK ATTACK CAUGHT ON VIDEO\n\nThe headmaster said when they learned of the accusations, the school contacted local law enforcement and the New Hampshire Department of Children and Youth Services. He said school officials were cooperating with investigators.\n\nAfter learning of the accusations, police reportedly began to investigate immediately and interviewed dozens of students, including someone who shared the allegation on Snapchat herself.\n\n“She also stated that she had no personal information about the sexual assaults and merely re-posted something she read. She had no idea who may be a victim or suspect or any details of a crime,\" the police chief said in a news release. “We don’t know where it came from. She claims that she re-posted something that she read.\"\n\nThe rumors sparked a protest from a group of students who \"participated in a demonstration between classes,\" a spokesperson for the school, Julia Mitchell, told the Union Leader in a statement.\n\n“As stated in our letter, Pinkerton Academy supports and encourages all students to use their voices in a peaceful and constructive manner,\" the statement read. \"We appreciate our students’ respectful display of support for one another during this challenging time.”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThomas said rumors of false information have spread among the student body before, but he's never seen anything of this \"magnitude.\"\n\n“Messages such as the one detailed in this incident should not be ‘shared’ but reported immediately to law enforcement,” the police chief said, adding that if any students feel uncomfortable speaking to police, they should instead tell an adult what's happening.\n\nSnapchat did not immediately return Fox News' request for comment.", "description": "Allegations that a male New Hampshire high school student sexually assaulted a dozen female students — and that educators knew and failed to act — circulated on Snapchat, prompting students to walk out in protest last week. But investigators say \"no crimes\" seem to have been committed.", "authors": ["Nicole Darrah", "Nicole Darrah Covers Breaking", "Trending News For Foxnews.Com. Follow Her On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/0301-snapchat.jpg", "published_at": "2019-09-15"}