{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7498653/Nissan-recalls-1-3M-vehicles-fix-backup-camera-display.html", "downloaded_at": "2019-10-05 08:13:51.920056+00:00", "title": "Nissan recalls 1.2MILLION vehicles across the US and Canada to fix backup camera display", "language": "en", "text": "Nissan is recalling 1.2million cars mainly in the U.S. and Canada to fix a problem with the backup camera displays.\n\nNissan says in government documents posted Tuesday that owners can adjust the camera and display settings to the extent that an image is no longer visible on the dashboard display.\n\nThe displays will retain that inadequate image the next time the vehicles are shifted into reverse and that is in violation of federal safety standards.\n\nThe recall covers the 2018 and 2019 Nissan Altima, Frontier, Kicks, Leaf, Maxima, Murano, NV, NV200, Pathfinder, Rogue, Rogue Sport, Sentra, Titan, Versa Note and Versa Sedan. Also included are the Infiniti Q50, Q60, QX30 and QX80 vehicles.\n\nThe recall covers the 2018 and 2019 Nissan Leaf model (pictured) as well as a raft of others\n\nFrom the 2019 model year, the Nissan GT-R and Taxi and Infiniti QX50, QX60, Q70, Q70L also are included.\n\nThe recalled vehicles also went to Israel, Korea and Saipan, the company says.\n\nNissan's statement to the National Highway Traffic Safety Administration says: 'FMVSS No. 111, Rear Visibility, requires the rear visibility system of vehicles manufactured on or after May 1, 2018 to return to a default image at the beginning of each backing event regardless of any modifications the driver previously selected.\n\n'On affected vehicles, a driver may potentially adjust the rear view camera and display settings to the degree that the image is no longer visible, and the system will retain those settings at the next backing event.\n\n'This condition does not meet the requirements of S5.5.6 Default View as required by FMVSS No. 111.\n\nThe 2018 Nissan Rogue, a compact SUV which is also affected by the reverse camera problem\n\n'A temporarily reduced rear visibility when the driver has adjusted the display to this extent could lead to an increased risk of an accident in the event the driver does not re-adjust the display before reversing.'\n\nThe company says it has no reports of crashes or injuries.\n\nDealers will update the backup camera software settings at no cost to owners starting Oct. 21. The company says the repair will take less than a half hour.", "description": "Nissan says in federal papers posted Tuesday that owners can adjust the camera and display settings to the extent that an image is no longer visible on the dashboard display.", "authors": ["Ross Ibbetson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/25/12/18913620-0-image-a-37_1569409224224.jpg", "published_at": "2019-09-24"}