{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7611421/BAZ-BAMIGBOYE-Ruth-Wilson-wait-wicked-way-all.html", "downloaded_at": "2019-10-25 02:30:12.653589+00:00", "title": "BAZ BAMIGBOYE: Why Ruth Wilson can't wait to have her wicked way with us all!", "language": "en", "text": "Ruth Wilson plays the scheming Mrs Coulter in the epic BBC TV adaptation of Philip Pullman's His Dark Materials trilogy of novels\n\nRuth Wilson has always been envious of men who get to flaunt their nasty side on screen.\n\nAnd now she has found the crème de la crème of femmes fatales, in the form of the scheming Mrs Coulter, in the epic BBC TV adaptation of Philip Pullman's His Dark Materials trilogy of novels.\n\n'She's the ultimate literary villain, isn't she?' Wilson said, with evident relish, when we meet for breakfast at the Corinthia Hotel in Westminster.\n\nMrs Coulter may be a woman in a man's world, but she knows how to manipulate. 'She's fun to play,' Wilson told me. 'She's determined. She knows how to use her sex to get what she wants.'\n\nAnd with a truly evil run as the psychotic Alice Morgan, in TV's Luther, under her belt, Wilson has honed her craft to be so deliciously wicked that her role in His Dark Materials has been expanded beyond what Pullman wrote in his books.\n\nThe first two episodes, in which she battles for the soul of teenager Lyra Belacqua (played by Dafne Keen), a character who represents good in the world, are compelling.\n\nWe talked about how, perhaps because they're so rare, good female villains really capture an audience's imagination.\n\nIn Pullman's magical world, all the human characters have an animal companion or 'daemon' — and Mrs Coulter's is a monkey with no name, who doesn't speak\n\nThe actress believes Pullman's trilogy is about 'sex, religion and coming of age... it's about Lyra as the new Eve, and everyone is intent on stopping her committing the original sin'\n\n'I feel when they do come along, people love them — because they're missing from the canon. People are writing stories of what you think women should be. But women can be vicious!'\n\nThough her heart may be black, the rest of Mrs Coulter is mesmerising. Indeed, Wilson's character has a touch of old-style Hollywood glamour about her.\n\nShe said she thought of Forties icon Hedy Lamarr, in the way she had Mrs Coulter's hair styled — all soft and wavy. And I reckoned she had a touch of the dark side of Barbara Stanwyck (in Billy Wilder's classic Double Indemnity) about her, too.\n\nThe actress worked with her monkey's puppeteer, Brian Fisher, to try to bring 'a bit of monkey into Mrs C'\n\nLin-Manuel Miranda, who plays Lee Scoresby in the series, with the puppet of his character's daemon Hester\n\nThe first two episodes of His Dark Materials see Mrs Coulter battle for the soul of teenager Lyra Belacqua (pictured, Dafne Keen), a character who represents good in the world\n\nBut there's a dark purpose to that beautiful exterior. 'She's dressing for power — but also, the shiny fabrics she wears are attractive to others.' In particular, 'they're attractive to the children she has to pretend to be friendly with'.\n\nThe actress believes Pullman's trilogy is about 'sex, religion and coming of age... it's about Lyra as the new Eve, and everyone is intent on stopping her committing the original sin'.\n\nShe added she had been delving into the stories, searching for explanations for Mrs Coulter's bad, often downright dangerous behaviour.\n\nA prop was used to portray Iorek Byrnison, an armoured bear who Lyra meets in Svalbard, in scenes\n\nPictured: Ruth Wilson as Marisa Coulter and Dafne Keen as Lyra Belacqua in His Dark Materials\n\nIn Pullman's magical world, all the human characters have an animal companion or 'daemon' — and Mrs Coulter's is a monkey with no name, who doesn't speak.\n\nWilson worked with her monkey's puppeteer, Brian Fisher, to try to bring 'a bit of monkey into Mrs C'.\n\n'We had a lot of fun trying to work out her dynamic,' she laughed. 'Like, what is she like when she's alone with her monkey? What does she do when she's at home, on her own?\n\n'She can't bear herself. That's what I feel about her.'\n\nBehind the scenes of His Dark Materials with James Cosmo as Farder Coram and Dafne as Lyra, with the puppet of her daemon Pantalaimon\n\nPictured: Dafne as Lyra and Ann-Marie Duff as Ma Costa in a scene from the adaptation\n\nHis Dark Materials begins on Sunday, November 3, at 8pm on BBC1 (Pictured: Dafne Keen)\n\nThe alethiometer, nicknamed the symbol-reader, in a behind-the-scenes image from the show\n\nI asked her if working with so many children on His Dark Materials had made her think about having a family of her own.\n\n'Maybe; maybe not,' she said. 'I think it would be an extraordinary experience. But at the same time I love my life, and I'm very happy. So if it happens, it happens.'\n\nShe noted that she has eight nieces and nephews. 'The Wilsons have produced quite a lot of people in the world, so if I don't produce any, there are enough Wilsons,' she said.\n\nHis Dark Materials begins on Sunday, November 3, BBC1 (8pm).\n\nWatch out for...\n\nEd Stoppard, who has joined the cast of Leopoldstadt — the new play written by his distinguished playwright father Tom Stoppard.\n\nThe drama, which Stoppard senior has described as his most personal work, is named for the district of Vienna which was a famous Jewish quarter, before being razed by the Nazis during World War II.\n\nDirected by Patrick Marber and produced by Sonia Friedman, the production will run at Wyndham's Theatre from January 25; the season has already been extended through till June 13.\n\nFriedman said she had contracted an ensemble totalling 41 actors — including three sets of children, with five in each set.\n\nEd Stoppard has joined the cast of Leopoldstadt — the new play written by his distinguished playwright father Tom Stoppard\n\nThe cast includes the actress-playwright Alexis Zegerman, whose own play, Holy Sh!t, was staged at the Kiln Theatre in North-West London last year.\n\nShe will be joined by Sebastian Armesto, Jenna Augen, Caroline Gruber, Dorothea Myer-Bennett and Luke Thallon — a fast-rising young star.\n\nDuring the war, more than 65,000 Austrian Jews were murdered by the Nazis, many of them in concentration camps. Tom Stoppard's own four grandparents, who were Czech Jews, all perished in the camps.\n\nAdam Cork has written the score for Leopoldstadt, which is likely to be one of the major cultural highlights of next year.\n\nRuthie Henshall, who is taking her show, In My Life, on the road, kicking off at The Lowry, Salford Quays, on April 11. She and Paul Schofield, her pianist and musical director, will then visit the Curve, Leicester on April 12; Cadogan Hall in Sloane Square on April 17 — after which she will do a night at the Helix in Dublin on April 30.\n\nI have seen almost everything Ms Henshall has done, from Crazy For You and Billy Elliot to Miss Saigon and Oliver!.\n\nJulian Clary, who has been cast by director Terry Johnson to play Norman, the bitter backstage worker desperate for a kind word from the once great leading man known as 'Sir', in Ronald Harwood's poignant play The Dresser.\n\nClary plays the title part, with Matthew Kelly as Sir. The play will tour, starting at the Cheltenham Everyman Theatre on September 10, 2020, before moving to the Theatre Royal, Bath on September 21.\n\nGiles Terera has been rehearsing with director Clarke Peters on a musical about Rat Pack entertainer Sammy Davis Jr (pictured)\n\nGiles Terera, who won an Olivier award for Hamilton, has been rehearsing with director Clarke Peters on a musical about the Rat Pack entertainer Sammy Davis Jr.\n\nTerera will portray Davis in Sammy, based on a show written by composer Leslie Bricusse, who wrote a series of songs for Davis such as The Candy Man and What Kind of Fool Am I.\n\nPeters told me that Sammy is Bricusse's take on the showman, who died in 1990. Peters said any attempt to cover all of Davis's life 'would be the Nicholas Nickleby of musicals' (a reference to the mammoth two-part play put on by the Royal Shakespeare Company).\n\nInstead, Peters will set the musical on the night Davis received a Kennedy Center honour in Washington, and use it as a springboard to reflect on a life that included marriage to white actress May Britt — considered controversial back in the early 1960s.\n\n'He had this conflict of identity' Peters said. 'He was born in Harlem in 1923, with no advantages, and he rose to become a star we still celebrate.'\n\nSammy's producers at Anthology Theatre Productions and Aria Entertainment are presenting a workshop of Sammy next Thursday and, depending on how that goes, hope to stage it in the West End next year.", "description": "BAZ BAMIGBOYE: Ruth Wilson has found the crème de la crème of femmes fatales in the form of the scheming Mrs Coulter in an adaptation of Philip Pullman's His Dark Materials.", "authors": ["Baz Bambigboye For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/23/20155618-0-image-a-2_1571957570812.jpg", "published_at": "2019-10-24"}