{"pub": "cbs", "url": "https://cbsnews.com/news/louisville-cardinals-football-child-with-down-syndrome-becomes-honorary-band-conductor-at-clemson-game", "downloaded_at": "2019-10-21 00:19:03.593724+00:00", "title": "Child with Down syndrome becomes honorary Louisville Cardinal Marching Band conductor at game against Clemson", "language": "en", "text": "Allen Norton may only be four years old, but he is already a dedicated Louisville Cardinals football fan. During Saturday's game against Clemson, the child — who was born with Down syndrome — stole the halftime show when he got to be an honorary conductor for the Cardinal Marching Band.\n\nThousands of fans turned out for the game in Kentucky and cheered Norton on as \"the cutest band director\" led the University of Louisville marching band in playing the fight song.\n\nSpecial Halftime Band Director Cutest band director ever! #GoCards Posted by Louisville Cardinals on Saturday, October 19, 2019\n\nHis parents told CBS Greensboro, North Carolina affiliate WFMY that it was an experienced that neither them, nor Allen, will ever forget.\n\n\"It's something he'll remember for the rest of his life,\" his father Scott Norton said.\n\nDr. Amy Acklin raising the L with the Cardinal Marching Bands special halftime guest Allen Norton. #uofl #louisville... Posted by University of Louisville Cardinal Marching Band on Saturday, October 19, 2019\n\nCardinal band director Amy Acklin told WFMY that having Allen become a part of the band, even temporarily, helps unite the community.\n\n\"We want to be a part of something that's much bigger than us as a band,\" she said. \"These are fighters; these are inspirational people. We think this is a very powerful idea that I think will connect with our community.\"\n\nThe marching band posted photos of the experience on Facebook, saying \"Allen warmed our hearts.\"\n\nThe Cardinal Marching Band in collaboration with the UofL Department of Pediatrics and Norton Healthcare, perform their... Posted by University of Louisville Cardinal Marching Band on Saturday, October 19, 2019\n\nWhen Allen was less than a year old, his family found out he had holes in his heart. Doctors were able to fix the condition a few months later, and now, Allen only needs annual check-ups once a year. His mom Mary Beth Norton said that it was scary at first, but things are looking a little brighter.\n\n\"The diagnosis doesn't put a cap on what is possible and that's what's exciting for us,\" she said. \"This is Allen getting to show who he really is and things are really limitless for him.\"", "description": "A 4-year-old from Kentucky stole the halftime show when he conducted the Cardinal Marching Band at Saturday's football game", "authors": ["Li Cohen"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/10/21/55529324-6e60-44c5-aee6-01414d1fce77/thumbnail/1200x630/d6e255954d60600d26c5ae58d31c692c/screen-shot-2019-10-20-at-8-00-04-pm.png", "published_at": "2019-10-21"}