{"pub": "cnn", "url": "https://cnn.com/travel/article/mastercard-global-destination-cities-index/index.html", "downloaded_at": "2019-09-04 08:06:36.983597+00:00", "published_at": "2019-09-04", "title": "World's most popular cities revealed", "language": "en", "text": "(CNN) — The world's appetite for travel is voracious.\n\nSince 2009, the number of international overnight visitors has grown by 76% globally, according to third-party research and proprietary analysis by financial services company Mastercard.\n\nFor the fourth year in a row, Bangkok is the No. 1 most popular city on Mastercard's Global Destination Cities Index.\n\nIn 2018, the Thai capital welcomed 22.78 million international overnight visitors, with 3.34% growth forecast for 2019.\n\nMany of Bangkok's visitors originate from these top five destinations , listed in order: Mainland China, Japan, South Korea, India and the United Kingdom. Popular attractions include the Grand Palace, Wat Arun and for a day trip outside the city, the Damnoen Saduak Floating Market.\n\nParis and London rank No. 2 and No. 3 for visitors, both welcoming more than 19 million international visitors for overnight stays in 2018.\n\nMastercard's index ranks 200 cities based on proprietary analysis of visitor volume and spending data that is publicly available.\n\nAll but one of the top 10 cities for visitor numbers in 2018 saw an uptick in international overnight visitors, with increases predicted across the board for 2019.\n\nRelated content World's safest city to visit in 2019 revealed\n\nLondon was the only city on the current top 10 that saw a visitor decline year-over-year -- a nearly 4% drop.\n\nAsia-Pacific cities have seen the largest regional increase in international travelers since 2009, with a more than 9% increase spurred by rising numbers of mainland Chinese travelers.\n\nThe index also ranks cities by international overnight visitor spending. By that measure, Dubai in the United Arab Emirates is the No. 1 city. International overnight visitors spent $30.82 billion there in 2018, spending a whopping $553 per day, on average.\n\nBy comparison, visitors to Bangkok -- the most popular city by visitor numbers -- spent an average of $184 per day. Bangkok ranked third for total international overnight visitor spending ($20.03 billion), with Mecca, Saudi Arabia, at No. 2 ($20.09 billion).\n\nTop 10 cities ranked by 2018 visitor numbers\n\n1. Bangkok, Thailand: 22.78 million international overnight visitors\n\n2. Paris, France: 19.10 million international overnight visitors\n\n3. London, England: 19.09 million international overnight visitors\n\n4. Dubai, United Arab Emirates: 15.93 million international overnight visitors\n\n5. Singapore: 14.67 million international overnight visitors\n\n6. Kuala Lumpur, Malaysia: 13.79 million international overnight visitors\n\n7. New York City, USA: 13.60 million international overnight visitors\n\n8. Istanbul, Turkey: 13.40 million international overnight visitors\n\n9. Tokyo, Japan: 12.93 million international overnight visitors", "description": "Antalya, Turkey, is the No. 10 most popular city in the world among international overnight travelers, according to Mastercard's Global Destination Index of 200 cities. What nine places had even more visitors in 2018?", "authors": [], "top_image": "https://dynaimage.cdn.cnn.com/cnn/w_1200/http%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F161014171010-01-thailand-travel-hp-1014-super-tease.jpg"}