{"pub": "cbs", "url": "https://cbsnews.com/news/mcdonalds-enlists-alexa-and-google-to-help-with-its-hiring", "downloaded_at": "2019-09-25 23:29:12.912722+00:00", "title": "McDonald's job seekers can now \"apply\" through Alexa and Google Voice", "language": "en", "text": "Want a job at McDonald's? Just ask your smartphone.\n\nStarting Wednesday, McDonald's will let job seekers start an application by using voice commands with Amazon's Alexa or Google's Assistant.\n\nIf users say, \"Alexa, help me get a job at McDonald's,\" Alexa will ask which country they want to work in and play McDonald's \"I'm lovin' it\" jingle. After that, users can share their phone number and get a link to continue the application process. Alexa also shares some facts about working for the company, such as how it can lead to jobs in other fields.\n\nThe function, dubbed \"Apply Thru,\" is available in the U.S., Canada, Australia, France, Germany, Ireland, Italy, Spain and the United Kingdom. McDonald's is also exploring adding the feature in other markets. It's not yet available through Apple's Siri.\n\nWhy \"you should feel weird\" about Amazon listening to what you say to Alexa\n\nThe move is an unusual one. While some job recruitment companies have built voice-recognition systems on Google's and Amazon's platforms, both companies say McDonald's is the first direct employer to use its platform in this way. McDonald's developed the technology itself.\n\nFor McDonald's, voice-initiated hiring is a way to stand out in a tight job market. The U.S. unemployment rate of 3.7% is near a 50-year low. Unemployment is also below 4% in the U.K. and Germany.\n\nMcDonald's employs 2 million people at 38,000 restaurants worldwide, and its needs change quickly based on turnover and seasonal demands. Over the summer, the Chicago-based company said it was hiring 250,000 people in the U.S. alone, for instance. McDonald's is currently seeking 338 part-time crew workers in the New York area and 414 in Toronto, according to company hiring sites.\n\nApplications by voice are also part of a broader effort to use technology to streamline every part of the restaurant, said David Fairhurst, McDonald's executive vice president and chief people officer. For customers, that means digital ordering kiosks and mobile ordering. For employees, it means online scheduling and virtual reality games to train store managers.", "description": "McDonald's \"Apply Thru\" assistant is part of a broader effort to digitally streamline every part of the company", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/08/27/0df48a1e-3a62-48bb-bbbc-dc0bb8891fe9/thumbnail/1200x630/8163e377da3f57d9a3615df310ced432/gettyimages-84709618.jpg", "published_at": "2019-09-25"}