{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/29/WS5db7b19ea310cf3e35574319.html", "downloaded_at": "2019-10-29 06:13:12.521815+00:00", "title": "China to push for lasting business environment improvement nationwide", "language": "en", "text": "Xinhua | Updated: 2019-10-29 11:27\n\nA bird's-eye view of the central business district in Beijing. [Photo/VCG]\n\nBEIJING - More efforts should be made to promote a continuous improvement in China's business environment nationwide, an official said Monday.\n\nImproving the business environment is an important guarantee for further opening up to the outside world and developing an open economy at a higher level, said Lin Nianxiu, deputy head of the National Development and Reform Commission, at a meeting on exchanges of such experiences.\n\nA market-oriented, law-based and world-class business environment is of great significance for enhancing the vitality of market entities, improving the government's capacity for governance and for promoting a higher level of opening-up, he said.\n\nLin also stressed the need to build a coordinated, efficient and co-governance mechanism, establish and improve fair, open and transparent market rules, provide equal, convenient, efficient and intelligent public services, deepen reform, strengthen the rule of law and focus on boosting the business environment nationwide.\n\nThe World Bank last week released a report entitled \"Doing Business 2020: Comparing Business Regulation in 190 Economies,\" saying that China's ease of doing business ranking climbed to 31 this year from 46 last year, with the country also ranking among the 10 most-improved economies after implementing regulatory reforms.", "description": "More efforts should be made to promote a continuous improvement in China's business environment nationwide, an official said Monday.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/29/5db7b19ea310cf3e97a35fcb.jpeg", "published_at": "2019-10-29"}