{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7548443/Made-Chelsea-fans-divided-Zara-McDermotts-debut.html", "downloaded_at": "2019-10-08 01:25:37.635292+00:00", "title": "Made In Chelsea fans divided over Zara McDermott's debut", "language": "en", "text": "She’s better known for her exploits on the fourth series of Love Island, but Zara McDermott added another string to her bow when she made her Made in Chelsea debut on Monday evening.\n\nAnd while her stint was a short one, E4 viewers were left divided over her appearance with many calling her out for wading into the feud between her boyfriend Sam Thompson and Jamie Laing.\n\nWhile, others believed she was correct for standing up for her beau.\n\nNewcomer: E4 viewers were left divided over Zara McDermott's appearance with many calling her out for wading into the feud between her boyfriend Sam Thompson and Jamie Laing\n\nThe moment came after she let slip that she didn't think that Jamie added anything to Sam's life.\n\nAnd it wasn't long before Sam's ex Sophie Habboo repeated her words to Jamie, just as Zara walked in to join her for a drink.\n\nAfter exchanging awkward pleasantries, Jamie then confronted Zara over her comments.\n\nAsking Zara about what she said, Jamie said: 'What do you think about the whole situation at the moment? Because you think I don't add anything to his life, right?'\n\nSupport: While, others believed she was correct for standing up for her beau\n\nBut instead of backtracking, Zara clarified her point, saying: 'I just feel like, at this point, no.\n\n'Right now, you're kind of no good for each other at this point.'\n\nResponding to her words, Jamie said: 'That just sucks for me,' before going on to ask Zara to send his best wishes to his former BFF.\n\nMade In Chelsea fans at home took to Twitter to share their opinion on Zara's involvement, with many having differing thoughts.\n\nSpilling the beans: It wasn't long before Sam's ex Sophie Habboo repeated her words to Jamie, just as Zara walked in to join her for a drink\n\nAwkward run-in: After exchanging awkward pleasantries, Jamie then confronted Zara over her comments\n\nOne person asked: 'Why is Zara backing this argument between Jamie and Sam, that is essentially over her boyfriends ex!! MADNESS!!!! #MadeInChelsea.'\n\nWith another picking up on the tension, writing: 'Awkward Jamie and Zara #MadeInChelsea.'\n\nWhile a third called her out for getting involved, adding: '#MadeInChelsea Zara.. you been in it for 5 seconds, give it at least one episode before you start getting into the drama.'\n\nStanding form: Instead of backtracking, Zara clarified her point, saying: 'I just feel like, at this point, no. Right now, you're kind of no good for each other at this point'\n\nHowever, one viewers stuck up for the Love Island beauty and praised her for fighting her man's corner, tweeting: 'Zara has got a point! Friends don’t hurt each other!!!! #MadeInChelsea.'\n\nWith another fan simply gushing over her gorgeous looks, commenting: 'How pretty is Zara tho! #MadeInChelsea.'\n\nEarlier on the E4 show, Zara was awkwardly introduced by boyfriend Sam Thompson after he crosses paths with ex-girlfriend Sophie Habboo and co-star Miles Nazaire in a west London bar.\n\nOpinions: Made In Chelsea fans at home took to Twitter to share their opinion on Zara's involvement, with many having differing thoughts\n\nBut any potential for confrontation with Sophie, who abruptly dumped Sam before embarking on new relationship with best friend Jamie Laing, is quickly soothed by Zara, with Miles asking her where they met.\n\n‘So we actually me that an event about a year and a half ago,’ she explained. 'He was a bit intoxicated at the time, and doesn't remember it.'\n\n'She immediately saw me and thought, \"that guy, I wanna marry!\"' Sam added. 'And then before I knew it, bam! Boyfriend and girlfriend, and I couldn't be happier.'\n\nWhile Sophie maintains an appropriate silence, Miles acknowledges the chemistry between Sam and his new girlfriend.\n\nFace to face: Earlier on the E4 show, Zara was awkwardly introduced by boyfriend Sam Thompson after he crosses paths with ex-girlfriend Sophie Habboo and co-star Miles Nazaire\n\n'I can actually see it,' he said. 'He always smiles. Every time he talks about you he's so happy.'\n\nWhile the extent of Zara's involvement is still to be determined, it's understood that, at present, she is only set to appear in one episode.\n\nNot so Sam, who is back to face best friend Jamie Laing and ex Sophie, who got together at the end of season 17.\n\nCameo: While the extent of Zara's involvement is still to be determined, it's understood that, at present, she is only set to appear in one episode\n\nCalming influence: Any potential for confrontation with Sophie, who abruptly dumped Sam before embarking on new relationship with best friend Jamie Laing, is soothed by Zara in the new clip\n\nWhile Sam wasn't around to see it, both Jamie and Habbs were seen worrying about what he'd make of the matter.\n\nA source revealed to The Sun in May: 'Sam has been left devastated by Jamie’s actions. They’ve been close friends for years and Jamie knows how heartbroken Sam was when Habbs finished with him.'\n\nZara and Sam, on the other hand, are going from strength-to-strength it would seem, telling MailOnline last month that they are 'in love'.\n\nOpening up: ‘So we actually me that an event about a year and a half ago,’ she explained. 'He was a bit intoxicated at the time, and doesn't remember it'\n\nThe ex: Sophie's first meeting with Sam goes off without incident during Monday's show\n\nThey also reiterated that they first met nearly two years ago, before the brunette bombshell appeared on Love Island.\n\nTalking about how they first met, Zara revealed: 'We met a year-and-a-half ago at an event before I was on Love Island. He doesn't remember as he was drunk! We got speaking on Instagram three to four months ago and here we are.'\n\nTo which Sam elaborated: 'I was in the Dominican Republic, minding my own business, when Zara replied to an Instagram story... Zara slid into my DMs.\n\n'It was great as then I had the courage to ask her out on a date, we went on our first date about three months ago now. Since the moment she slid into my DMs, we haven't not spoke every day.'", "description": "Made In Chelsea fans were left divided over Zara McDermott's debut as they called her out for wading into boyfriend Sam Thompson's feud with Jamie Laing", "authors": ["Niomi Harris", "Jason Chester For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/01/19419742-0-image-a-83_1570494466192.jpg", "published_at": "2019-10-08"}