{"pub": "news24", "url": "https://news24.com/World/News/turkish-forces-have-displaced-160-000-civilians-in-syria-20191014", "downloaded_at": "2019-10-15 04:26:41.158714+00:00", "title": "Turkish forces have displaced 160 000 civilians in Syria", "language": "en", "text": "Displaced Syrians sit in the back of a pick up truck as Arab and Kurdish civilians flee amid Turkey's military assault on Kurdish-controlled areas in northeastern Syria. (Delil Souleiman, AFP)\n\nThe Turkish military offensive in Syria has displaced at least 160 000 civilians, the UN secretary general said on Monday in a statement urging an \"immediate de-escalation\".\n\nUN Secretary-General Antonio Guterres \"is gravely concerned over the military developments in northeast Syria\", the statement said.\n\nIt said Guterres was urging \"all parties to resolve their concerns through peaceful means\", adding that \"civilians not taking part in hostilities must be protected at all times\".\n\nGuterres also expressed \"serious concern\" that the Turkish onslaught could lead to the \"unintended release of individuals\" associated with the Islamic State group.\n\nSome of the Kurdish forces guarding ISIS prisoners or their families have been pulled away to fight the Turks, raising fears that many IS militants might be able to escape.\n\nGuterres also demanded \"sustained, unimpeded and safe humanitarian access to civilians in need\" to allow the United Nations and its humanitarian partners to carry out aid work.\n\nAfter US President Donald Trump said over the weekend that he was withdrawing the US troops who had effectively prevented a Turkish incursion, Syrian government forces on Monday were nearing the border with Turkey for the first time in years after striking a deal with the embattled Kurds.\n\nREAD | US troops in northern Syria ordered to leave country", "description": "The Turkish military offensive in Syria has displaced at least 160 000 civilians, the UN secretary general said in a statement urging an \"immediate de-escalation\".", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9471/26a3b123f4a84a42a7abcca80a441481.jpg", "published_at": "2019-10-14"}