{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7587547/Police-charge-five-Extinction-Rebellion-activists-including-83-year-old-grandfather.html", "downloaded_at": "2019-10-18 10:38:26.619379+00:00", "title": "Police charge five Extinction Rebellion activists including 83-year-old grandfather", "language": "en", "text": "Five people have been charged over yesterday's Tube protests by Extinction Rebellion activists.\n\nThe three men and two women, arrested in connection with the protests at Canning Town and Shadwell stations, will appear in court today.\n\nA further three men arrested at either Canning Town or Stratford have been bailed 'under strict conditions', British Transport Police said.\n\nYesterday as Extinction Rebellion's eco-protest entered its 11th day activists launched a co-ordinated strike on three London Underground stations, clambering on top of carriages and gluing themselves to doors despite Monday's city-wide ban issued by the Met Police.\n\nBut their efforts to disrupt public transport were met with a furious backlash from commuters, industry groups and politicians leading one XR spokesman to admit the move had been a 'huge own goal'.\n\nVideo surfaced from Canning Town station of a protester seemingly being beaten and kicked by angry workers on the station platform having been dragged bodily from the top of a train.\n\nBritish Transport Police said today that four people will appear at court this morning charged in connection to the incident at Shadwell DLR station.\n\nThey are: Margreit Bos, 32 of Chartham, Kent; Martin Newell, 52 of Birmingham; Philip Kingston, 83 of Patchway; and Sue Parfitt, 77 of Bristol.\n\nBuddhist trainee teacher Mark Ovland (left in left picture, and right) has been charged after scrambling atop a tube at Canning Town yesterday\n\nThey have each been charged with obstructing an engine or carriage on the railway contrary to Section 36 of the Malicious Damage Act and will appear at Highbury Corner Magistrates’ Court this morning.\n\nOne of the men arrested at Canning Town will also appear at Highbury Corner Magistrates corner today.\n\nMark Ovland, 36 of Keinton Mandeville, was charged with breaching bail conditions.\n\nA second man, aged 35 and from Filton, South Gloucestershire was arrested on suspicion of obstructing the railway and has been bailed with strict conditions, pending further enquiries.\n\nThe police added that 'enquiries continue in relation to the obstruction incident'.\n\nAt Stratford two men aged 32 from Lewisham and Hull were arrested for obstructing the railway. They have been bailed with strict conditions, while further enquiries continue.", "description": "British Transport Police moved quickly to bring charges against XR activists. Three men and two women have already  been charged over Tube protests.", "authors": ["Joel Adams For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/10/19843928-0-image-a-13_1571389224880.jpg", "published_at": "2019-10-18"}