{"pub": "marketwatch", "url": "https://marketwatch.com/story/aaron-levie-is-now-living-a-founders-nightmare-as-starboard-invests-in-box-2019-09-03", "downloaded_at": "2019-09-04 03:47:00.938771+00:00", "title": "Aaron Levie is now living a founder’s nightmare as Starboard invests in Box", "language": "en", "published_at": "2019-09-03", "text": "Aaron Levie, the co-founder and chief executive of Box Inc., is now living the nightmare that all tech-company founders hope to avoid.\n\nOn Tuesday, shares of Box Inc. BOX, +1.50% surged 8% in after-hours trading, after the activist hedge fund Starboard Value LP disclosed in a regulatory filing that it has purchased 11 million shares, or a 7.5% stake, in the cloud storage company. That position will make Starboard the third-largest shareholder in Box, after the Vanguard Group and Black Rock, according to Factset.\n\nThe difference in these investors is that Starboard is a known activist investor. In the past, Starboard has rattled the cages at many companies. In tech, most notably at the since-acquired Yahoo, where the firm negotiated a total of four seats on the internet pioneer’s board in April 2016, paving the way for its sale to Verizon Communications Inc. VZ, -0.21% VZ, -0.21% a few months later.\n\nStarboard only said in its 13-D filing that it believe Box shares, “when purchased, were undervalued and represented an attractive investment opportunity.” It also said that it may engage in discussions with management, stockholders, or other third parties about its investment, “including potential business combinations or dispositions involving the issue,” and making recommendations about ownership structure, board makeup, capitalization and or potential business combinations.\n\nIndeed, Box shares are down 12% so far this year, and its past two quarterly earnings reports were met with downgrades or price-target cuts by Wall Street analysts, as its revenue growth has slowed and it has been slapped with class-action lawsuits.\n\n“While we do not comment on interactions with our investors, Box is committed to maintaining an active and engaged dialogue with stockholders,” Box officials said in a statement. “The board of directors and management team are focused on delivering growth and profitability to drive long-term stockholder value as we continue to pioneer the cloud content management market.” Levie was not available for an interview.\n\nWhen Box went public in early 2015, it did what many tech companies have done. It went public with dual-class shares, giving its founders and company insiders 98.8% of the company’s voting power.\n\nLast June, Box did the right thing when it comes to investors and overall corporate governance — it ended the life of its controlling dual-class shares, just as SEC Commissioner Robert Jackson has been advocating. In June 2018, all of Box’s outstanding Class B shares converted into the same number of Class A common stock shares. Gone was the control of company founders and insiders, including Levie. At the same time, Box opened itself up to activist investors who lobby for change, or who hope the company will be acquired or make some acquisitions to spur growth.\n\nIt remains to be seen exactly what Starboard will do next, but it’s quite likely that it will push for an acquisition or for the company to be acquired, in light of the past two quarters’ performance. Ironically, by getting rid of its dual-class shares, Box could become the poster child of the worst-case scenario for companies looking to do the right thing.", "description": "Aaron Levie, the co-founder and chief executive of Box Inc., is now living the nightmare that all tech company founders hope to avoid.", "authors": ["Therese Poletti"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ615_levie0_ZG_20190903195436.jpg"}