{"pub": "townhall", "title": "China's Chemical Warfare", "url": "https://townhall.com/columnists/betsymccaughey/2019/08/28/chinas-chemical-warfare-n2552270", "language": "en", "published_at": "2019-08-28", "downloaded_at": "2019-09-02 07:17:40.445417+00:00", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nPresident Donald Trump got slammed by all sides -- Democrats, the media and European politicians -- for suddenly escalating economic war with China on Friday. But for Americans who have lost a family member or friend to the Chinese-made street drug fentanyl, Trump's harsh pivot is the right move.\n\nHe hiked tariffs on Chinese goods, labeled President Xi Jinping an \"enemy\" and told U.S. companies manufacturing in China to pull out. Wall Street went into a tailspin, and partisans called Trump \"unhinged.\"\n\nBy Monday, Trump had changed his tone, in response to friendly overtures from China. But the reality is that harsh words and economic threats are what's needed. China has been waging chemical warfare against us for several years, flooding our neighborhoods with poison.\n\nIn the last three years alone, fentanyl and similar synthetic opioids manufactured in Chinese labs have killed 79,000 Americans. That's more than the American combatants killed in Vietnam, Afghanistan and Iraq combined. And like those combatants, most fentanyl victims are young.\n\nChinese-made narcotics started showing up on our streets in 2013, according to the Centers for Disease Control and Prevention. Each year, overdose deaths soared, but the Obama administration never confronted China to stop its deadly assault.\n\nTrump is fighting back. Instead of soldiers and bullets, he's using tariffs and other economic sanctions. How civilized of him. \"We're losing thousands of people to fentanyl,\" Trump told reporters Friday night. \"This is more important than anything else that we're working on.\"\n\nTrump explained that China's refusal to curb the flood of fentanyl is a major reason for the tariff hikes. Outraged by the tens of thousands of deaths caused by Chinese-made fentanyl, Trump tweeted, \"President Xi said this would stop - it didn't.\"\n\nIn fact, China is refusing to cooperate with U.S. law enforcement. Federal authorities have indicted three Chinese drug kingpins who manufacture fentanyl and fentanyl ingredients and use the internet to market the lethal drugs to Americans. China won't extradite the accused to the U.S. and instead is allowing them to continue to operate freely.\n\nTrump's critics, like Bryce Pardo of the RAND Corporation, claim that getting tough with China is futile because China doesn't have the inspectors or law enforcement to shut the poison factories. That's nonsense. A country with the brutal totalitarian apparatus to enforce a one-child policy -- which China did for years, dictating what went on in the bedroom -- can control what gets sold on the internet and put in the mail. China's synthetic opioid factories typically employ hundreds of people seated at internet terminals, openly selling their lethal wares.\n\nThe Obama administration, and many Democrats even now, insist the right strategy is to fund drug treatment programs and expand Medicaid, curbing the demand for killer street drugs rather than cutting off the supply. Actually, we need to do both -- attack the supplier and treat the addicts. In war, you don't stop fighting the enemy while you're bandaging the wounded.\n\nFor years, the United States Postal Service has been the Chinese drug dealers' shipping method of choice. The feds did nothing until Congress passed a law in 2018 requiring that every package from China be labeled with its content and origin. Still, only about 100 of the 1.3 million packages coming in every day actually get inspected by Customs and Border Protection. Friday, Trump tweeted, \"I am ordering all carriers, including Fed Ex, Amazon, UPS and the Post Office, to SEARCH FOR & REFUSE all deliveries of Fentanyl from China.\" A daunting task.\n\nSome of the Chinese fentanyl supplies are actually shipped to Mexico and then smuggled across the southern border to the U.S. Inspecting packages at that border for fentanyl, a Congressional report concluded, is like \"finding a needle in a haystack.\"\n\nTrump knows that stopping the drugs on our border is less likely to succeed than stopping China from sending them.\n\nMeanwhile, Monday morning, Trump announced that Chinese officials had called U.S. trade officials Sunday night and said, \"Let's get back to the table.\"\n\nWill Trump's hard-line stance on trade stop the drug massacre on America's streets? It's possible. Trump said Monday morning, reflecting on China's change of tone, that the Chinese \"understand how life works.\"\n\nBetsy McCaughey is a former lieutenant governor of New York State. Contact her at betsy@betsymccaughey.com. To find out more about Betsy McCaughey and read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate website at www.creators.com.", "description": "President Donald Trump got slammed by all sides -- Democrats, .09/02/2019 3:17:39AM EST.", "authors": ["Betsy Mccaughey", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/208/f137209b-4cae-4134-83a8-5fa7ffa95bf5.jpg"}