{"pub": "zdnet", "url": "https://www.zdnet.com/article/netsuite-moves-to-oracle-cloud-infrastructure", "downloaded_at": "2019-09-18 23:22:30.898828+00:00", "title": "NetSuite moves to Oracle Cloud Infrastructure", "language": "en", "text": "Three years after NetSuite was acquired by Oracle, the SaaS buiness is moving onto Oracle Cloud Infrastructure (OCI). The move fulfills part of the promise that the acquisition held for NetSuite -- the opportunity to take advantage of the larger company's global infrastructure. It also gives Oracle one further proofpoint as it argues that its cloud infrastructure is ready for prime time.\n\n\"It really is a two-way street,\" Oracle NetSuite Executive VP Evan Goldberg told ZDNet. \"Besides obviously giving Oracle an opportunity to showcase that OCI can handle a cloud application as sophisticated at scale as NetSuite, it also is something we really look forward to and would bring benefits that otherwise would be difficult or impossible for us to achieve.\"\n\nNetSuite began the transition away from what Goldberg calls its \"DIY data centers\" to the OCI a couple years ago. On Wednesday, the company announced that customers in Frankfurt and London are already live on OCI.\n\nOver the next 18 months, NetSuite plans to go live in a total of 18 OCI data centers across the US, EMEA and JAPAC. By Spring 2020, the plan is to provision 100 percent of new NetSuite customers in Europe on OCI. NetSuite also plans to have two US OCI regions available to customers by the spring.\n\nUltimately, the goal is to have all NetSuite customers provisioned on OCI, but NetSuite has not yet set a time frame for moving existing customers. Goldberg said he's confident NetSuite will be able to move its existing customers with minimal disruption, given its long history of moving customers to new data centers.\n\nMeanwhile, the Autonomous Database, one of the marquee features of OCI, will be especially beneficial for NetSuite customers, Goldberg said.\n\n\"The promise is no matter how small you are, you basically have your own automatic database administrator making sure your system is secure and reliable and tuned for whatever your company is doing,\" he said. \"NetSuite is extremely customizable, so at a lower level [customers] are really using NetSuite pretty differently. Having a database automatically tuned to how they're using NetSuite is going to be a performance benefit for them for sure.\"\n\nAs for NetSuite's own workforce, Goldberg said, \"I can say for sure the bulk of our people that work on our infrastructure team are safe and secure in their jobs for many years.\n\n\"We still have to figure out what we want to use in OCI and how we want to use it,\" he continued. \"There's so many great technologies there for AI and Internet of Things and blockchain that NetSuite will want to take advantage of.\"\n\nRather than making NetSuite's teams obsolete, the new infrastructure \"kind of just uplevels a lot\" of employees, Goldberg said.", "description": "The move should help Oracle demonstrate that its cloud can handle sophisticated, at scale cloud applications.", "authors": ["Stephanie Condon"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2015/03/24/4218c865-ae80-4f65-814d-d5dca44ca5f2/thumbnail/770x578/4ed8caa519c03e2db953d657019c078d/oracle-cloud.jpg", "published_at": "2019-09-18"}