{"pub": "scmp", "url": "https://scmp.com/sport/outdoor/trail-running/article/3031537/hong-kong-protests-spread-trail-races-runners-chant", "downloaded_at": "2019-10-05 22:18:13.560411+00:00", "title": "Hong Kong protests spread to trail races, as runners chant slogans and wear posters calling for ‘revolution of our times’", "language": "en", "text": "As I walked up with my teammates to the start line of the Ferei Dark 45km trail running race just before midnight on Monday, shouts rang out in the air.\n\n“Restore Hong Kong!” someone yelled in the crowd.\n\n“Revolution of our times!” came the resounding response.\n\n“Hongkongers!” someone else cried out. “Add oil!” the crowd called back, not missing a beat.\n\nIt was a surreal scene. Here we were, hundreds of runners on the eve of the October 1, about to embark on a 45km overnight jaunt on the MacLehose Trail. Everything looked exactly like the start line of other trail races: people in running backpacks, headlamps on, hiking poles at the ready, bibs attached at the waist. What was different were the protest chants.\n\nMore than four months into the anti-government protests, which started in June against an extradition bill and have since morphed into a broader movement for greater democracy and against what many see as police brutality, each and every aspect of daily life now holds within it a potential to be a site of political action, no matter how fleeting.\n\nIn a split second, floodgates can open and energy can pour forth, transforming an otherwise typical and mundane interaction into a symbolically significant moment. It can happen anywhere: at shopping malls, on the Star Ferry, at a concert hall, in the mountains at the start of a trail race. And it’s a powerful phenomenon: even in the dark, in the woods, squeezed shoulder to shoulder with other competitors, the protest movement manages to put on a display of unity and solidarity.\n\nIt was not the first time Hong Kong has seen political activism on the trails this year. In late August, as part of a citywide campaign to form a human chain as a show of solidarity in the protest movement, more than 1,000 trail runners and nature enthusiasts climbed their way up the iconic Lion Rock as part of the “Hong Kong Way”. And in late July, dozens of runners had run along the coastline of Hong Kong, setting off from Siu Sai Wan and finishing at Kennedy Town while making pit stops at Lennon Walls along the way.\n\nAlso on Tuesday, the Victoria to Peak Challenge saw runners playing ﻿Glory to Hong Kong on repeat, chanting slogans as they slogged through the steep 11km course.\n\nAt the Naked Trail Chase on September 22, I met a male competitor as I milled about the start area. He was wearing what you’d expect someone about to go on a 20km trail run would wear: black compression shorts, a black sports tee, arm sleeves for protection from the sun, and hydration backpack to carry fluids and a bit of nutrition.\n\nBut his outfit was unique for one reason: attached to his hydration pack were protest posters printed on A4 paper, slipped into plastic envelopes to protect them from rain and sweat. One was a photo of Lion Rock, emblazoned with the slogan “Fight for Freedom, Stand with Hong Kong”. The other was read, in Chinese, “Restore Hong Kong, Revolution of our Times”. And a small strip of black cloth attached to the top of his bag read “Free Hong Kong”.\n\nI went up to him and asked if I could take a photo. “I’m a journalist,” I explained. “But today I’m here as a trail runner.”\n\nHe did not hesitate to say yes, and turned around to let me take a photo of his backpack. He stared ahead, likely looking into the distance at Tai Mo Shan, Hong Kong’s highest peak and what we were about to climb up.\n\nPhoto taken, I thanked him for his help. Then we told each other to “Add oil” – both for the hilly kilometres ahead of us, and the long road ahead in these trying and uncertain times for Hong Kong.", "description": "The masses of runners lined up for races bring their political stance to the course calling for other participants to ‘add oil’ and to ‘restore Hong Kong’", "authors": ["Mary Hui"], "top_image": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2019/10/05/30bbd802-e64e-11e9-8a10-b9721f28293e_image_hires_211109.jpg?itok=9AvM5EHQ&v=1570281076", "published_at": "2019-10-05"}