{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/4/religious-group-defends-texas-judge-giving-amber-g", "downloaded_at": "2019-10-04 23:56:26.522677+00:00", "title": "Religious group defends Texas judge for giving convicted murderer a Bible", "language": "en", "text": "A religious group came to the defense of a Texas judge Thursday after a secularist organization filed a complaint against the jurist for giving a Bible to a former Dallas police officer convicted of murder.\n\nReligious freedom group First Liberty Institute came to Judge Tammy Kemp’s defense after The Freedom from Religion Foundation (FFRF) filed their complaint with the Texas State Commission on Judicial Conduct, accusing her of engaging in an “inappropriate” use of religion in her government role during the trial of Amber Guyger.\n\n“We should all be thankful the law allows Judge Kemp’s actions. We stand with her and will gladly lead the charge in defending her noble and legal actions,” Hiram Sasser, legal counsel for the First Liberty Institute, said.\n\nMs. Kemp provided Guyger the Bible after the former police officer had been sentenced to ten years in prison for murdering Botham Jean, a neighbor in her apartment complex whom she fatally shot after mistakenly entering his apartment.\n\n“You just need a tiny mustard seed of faith. You start with this,” Ms. Kemp said to her, hugging the crying Guyger before she left the courtroom.\n\nFFRF criticized this move in their letter to the Commission: “It is perfectly acceptable for private citizens to express their religious beliefs in court, but the rules are different for those acting in a governmental role.”\n\nDespite the group not calling for an actual punishment for Judge Kemp’s actions, FFRF attorney Andrew L. Seidel said this act was “unconstitutional” and an “abuse of power.”\n\n“We need more compassion in our criminal justice system, but here, compassion crossed the line into coercion. Judges cannot impose their personal religion on others,” Mr. Seidel said.\n\nGuyger was convicted for the murder of Jean Tuesday after she claimed to mistake his apartment for her own and shot him, thinking he was an intruder.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "A religious group came to the defense of a Texas judge Thursday after a secularist organization filed a complaint against the jurist for giving a Bible to a former Dallas police officer convicted of murder.", "authors": ["The Washington Times Http", "Bailey Vogt"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/02/dallas_officer_mistaken_apartment_73725_c0-0-5231-3049_s1770x1032.jpg?6b3de6f9239688ee4fd8502964871f98e2e79661", "published_at": "2019-10-04"}