{"pub": "metro", "url": "https://metro.co.uk/2019/10/23/khloe-kardashian-wages-war-mum-kris-jenner-lamar-odom-memoir-10968587", "downloaded_at": "2019-10-23 11:01:14.446803+00:00", "title": "Khloe Kardashian wages war against mum Kris Jenner over Lamar Odom memoir", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nKhloe Kardashian wages a war against her mum Kris Jenner over her ex Lamar Odom in the next episode of Keeping Up With The Kardashians.\n\nIn a trailer for the upcoming installment, the 35-year-old reality star learns that Lamar has written his autobiography Darkness To Light, which was released earlier this year, and is left raging when she finds out that Kris has lied to her about something.\n\n‘Lamar is writing a book,’ Khloe tells the cameras before turning to her sister Kylie Jenner and saying: ‘In the book I found out…’\n\nAdvertisement\n\nAdvertisement\n\nWhat painstaking discovery Khloe has stumbled across so far remains under lock and key, but Khloe is heard saying: ‘Mum is lying to me.’\n\nAs the clip continues, Kris is seen defending her actions and explains herself, saying: ‘I’m trying to do damage control.’\n\nHowever, it looks like Kris’s efforts have little impact as Scott Disick is then roped in to try and help smooth Khloe’s relationship with her mum over.\n\nKhloe Kardashian learns her mum is ‘lying to her’ in the next episode of Keeping Up (Picture: E!)\n\nKris Jenner admits to doing ‘damage control’ (Picture: E!)\n\n‘She literally thinks you’re going to come for her,’ Scott tells Khloe as he attempted to calm her down.\n\nBut it looks like Kris should be worried, as Khloe confirms: ‘What? I am [coming for her.]’\n\nOooooooh boy we can’t wait for this drama to unfold.\n\nKhloe and Lamar married in 2009 just one month after meeting but called it quits with Khloe filing for divorce in 2013.\n\nThe businesswoman withdrew the documents when Lamar was found unconscious in a brothel so she could help make medical decisions but later continued the separation with it becoming official in December 2016.\n\nKhloe and Lamar were previously married (Picture: Getty)\n\nFans who’ve been keeping up with Khloe know that there’s no bad blood between her and her ex-husband over his book though.\n\nAdvertisement\n\nAdvertisement\n\nKhloe congratulated Lamar on his autobiography success back in June when it was revealed to be on the New York Times bestsellers list, writing: ‘Look at God!!! Congratulations Lammy! Keep shining’.\n\nKeeping Up With The Kardashians continues Sunday on E! in the US.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Kylie Jenner pays tribute to ‘beautiful big sister’ Kim Kardashian as she celebrates 39th birthday\n\nMORE: Kim Kardashian and Kanye West renew their vows for fifth wedding anniversary", "description": "Khloe Kardashian wages war against mum Kris Jenner over Lamar Odom memoir in Keeping Up With The Kardashians.", "authors": ["Cydney Yeates"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/kardashians_1571827045.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-23"}