{"pub": "guardian", "url": "https://theguardian.com/business/2019/oct/03/asian-markets-fall-as-us-ignites-new-trade-war-with-europe", "downloaded_at": "2019-10-03 07:32:11.645030+00:00", "published_at": "2019-10-03", "title": "Asian markets fall as US ignites new trade war with Europe", "language": "en", "text": "Stocks drop in Sydney and Tokyo mirroring falls in US and UK, as Washington slaps 25% tariffs on range of European goods\n\nAsian markets have tanked after a below-par US jobs report compounded worries about the world’s top economy, while Washington opened up another front in its trade wars by imposing swingeing tariffs on European goods, including Scotch whisky and French wine.\n\nStocks fell 2% in Tokyo, Sydney and Seoul on Thursday as investors reacted to the surprise new tariffs and also heavy losses in Europe and on Wall Street on Wednesday. Shanghai was down nearly 1% and Hong Kong shares were off 0.5%.\n\nSafer assets such as gold felt the benefit, rising more than 1%. Brent crude was down 10c at $57.79 per barrel after steep falls on Wednesday.\n\nThe tariffs announced on Wednesday were approved by the World Trade Organization after it found that the EU unfairly subsidised aerospace company Airbus.\n\nBut the chance that Europe might respond in kind fuelled worries there could be prolonged damage to an already struggling global economy.\n\nScotch whisky and French wine hit by $7.5bn US tariffs Read more\n\n“Tariffs could be a source of tension between the United States and the EU,” said Masayuki Kichikawa, the chief macro strategist at Sumitomo Mitsui Asset Management in Tokyo.\n\n“The US economy is finally starting to slow, because of trade friction and problems in the manufacturing sector,” he said. “People in the markets want to see if this leads to weaker job growth.”\n\nOn Wednesday, data from payrolls firm ADP showed US companies added far fewer jobs than expected last month, while August’s reading was also revised sharply lower. That followed news of the weakest US manufacturing conditions since 2009 – at the height of the financial crisis.\n\nThe figures also come before the release of the non-farm payrolls data on Friday, that are closely watched for a gauge on the health of the economy, with observers fretting that a slowdown across the world could now be biting in the United States.\n\nNew York traders rushed for the exit, as did their European counterparts who were also hammered by fears Britain would leave the EU without a divorce deal as well as increasingly bleak economic data in the region.\n\n“The market was still digesting the weaker (factory) data and the implication for global growth then got whacked with the slide on the ADP data compounded by a catastrophic decline in US auto sales, which now raises more questions than answers about the resilience of the US consumer,” said Stephen Innes, the Asia-Pacific market strategist at AxiTrader in Hong Kong.\n\nHopes for a China-US trade breakthrough “could keep the risk-on light flickering, but the dreary economic data does perhaps suggest that traders could be better sellers in this risk-toxic environment,” he added.\n\nThe US tariff hit on the EU adds up to $7.5bn and affects a huge range of agricultural and industrial products including British woollen jumpers, European foodstuffs such as cheese, salami, butter and olives, and also German and British camera parts, industrial microwave ovens and books.\n\nDespite sanctioning the levies, the WTO is due to rule in the next six months on whether to allow the EU to impose its own huge tariffs the other way because of US subsidies to Boeing. It raises the possibility of another bruising trade war between the US and a key trade ally.\n\nThe weak US data has ramped up the possibility the Federal Reserve will cut interest rates for a third time this month, weighing on the dollar against most currencies including higher-yielding, riskier units.\n\nIt held its ground against the pound after Boris Johnson published his “final” Brexit proposals and warned the EU that Britain would leave without a deal on 31 October if the bloc did not accept them.", "description": "Stocks drop in Sydney and Tokyo mirroring falls in US and UK, as Washington slaps 25% tariffs on some European goods", "authors": ["Martin Farrer"], "top_image": "https://i.guim.co.uk/img/media/e204a5f51ceb4f9dd5d904740b130cb008598dab/0_0_5000_3001/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=bb1a3eaea0ef1b0af86c548cd36bdd65"}