{"pub": "yahoo", "url": "https://finance.yahoo.com/news/pg-e-begins-shutting-off-012443380.html", "downloaded_at": "2019-10-27 04:48:32.750605+00:00", "title": "PG&E Begins Shutting Off Power to More Than 2.5 Million People", "language": "en", "text": "(Bloomberg) -- PG&E Corp. began cutting power to more than 2.5 million Californians in the state’s largest deliberate blackout ever.\n\nThe bankrupt utility giant is shutting off the lights in phases to about 940,000 homes and businesses across Northern California -- including parts of Oakland, Berkeley and other ares around San Francisco -- as it tries to keep power lines from igniting wildfires during the strongest wind storm in years. The shutoff will hit almost a fifth of the utility’s total customers, and the company said it expects most to have power restored on Monday morning. San Francisco is expected to be spared.\n\n\"What we find ourselves experiencing is a historic wind event,” Andy Vesey, head of the Pacific Gas & Electric utility unit, said at a press conference Saturday night. The shutoff is a “last resort to make sure that in these conditions our operations will not create a major public safety issue. That’s why we do it.”\n\nThe start times in some cases were pushed back because anticipated winds -- which will reach gusts of 65 to 80 miles per hour -- didn’t arrive as early as initially forecast.\n\nIt’s the third time this month that PG&E has resorted to mass blackouts to avoid wildfires. The San Francisco-based company has been taking more extreme measures since its equipment sparked blazes in 2017 and 2018, saddling it with an estimated $30 billion in liabilities and forcing it into bankruptcy. The shutoffs have ignited a debate over how far California is willing to go to prevent fires in an increasingly warm and dry climate. Despite the power cuts, blazes continue to burn.\n\nRead More: The Cost of Doing Business in California Is One Blackout a Week\n\nIn Southern California, Edison International is warning that it may cut service to more than 100,000 customers. Further south in the San Diego area, Sempra Energy said it’s monitoring weather forecasts.\n\nWeather models show the wind storm could be the most powerful to hit California in years, according to PG&E.\n\nWildfires are already raging at both ends of California, prompting Governor Gavin Newsom to declare a state of emergency Friday. The Tick blaze near Los Angeles forced tens of thousands of evacuations. And north of San Francisco, the Kincade fire is raging amid the vineyards of Sonoma County, triggering a historic evacuation of 50,000 residents. It has destroyed at least 49 structures and burned more than 25,000 acres.\n\nThe Sonoma County fire was reported minutes after a PG&E transmission line in the area malfunctioned late Wednesday. Firefighters have not determined the cause of the blaze. PG&E’s shares plummeted 31% Friday to $5, a record low. Shares of Edison fell 8.5% as fires burned in its Southern California service territory.\n\nOn Saturday, Sonoma County Sheriff Mark Essick implored residents to leave immediately before the storm causes the fire to grow even more rapidly. “We’d like to get you out while we still have power and we still have communications,” he said.\n\nAll told, there’s about $12 billion worth of property within a mile of the active fires, said Chuck Watson, a disaster modeler with Enki Research.\n\nThe prospect of more liabilities from wildfires is especially vexing for PG&E. Since filing for Chapter 11 in January, the judge overseeing the case has warned that another big blaze would upend the utility’s bankruptcy and potentially wipe out shareholders. Any claims from new fires sparked by PG&E would have to be paid out first -- and in full -- before those from previous blazes get a dime.\n\nThe winds are arriving at a precarious moment. California receives almost no rain during its summer, and a five-year drought earlier this decade killed millions of trees that can now easily ignite. Recent winds have dried out grasses and shrubs even further.\n\nAnd the threat won’t end this weekend: Another front is expected to move in through Tuesday, bringing back strong, dry winds and once again raising the risk of wildfires spreading uncontrollably.\n\n“We may have another weather system -- not with this intensity-- that may hit us early or middle of next week,” Vesey said.\n\nTo contact the reporters on this story: Mark Chediak in San Francisco at mchediak@bloomberg.net;David R. Baker in San Francisco at dbaker116@bloomberg.net\n\nTo contact the editors responsible for this story: Lynn Doan at ldoan6@bloomberg.net, Tina Davis, Linus Chua\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- PG&E Corp. began cutting power to more than 2.5 million Californians in the state’s largest deliberate blackout ever.The bankrupt utility giant is shutting off the lights in phases to about 940,000 homes and businesses across Northern California -- including parts of Oakland, Berkeley", "authors": ["Mark Chediak", "David R. Baker"], "top_image": "https://s.yimg.com/uu/api/res/1.2/1y.FwHukyjxEHtKrdvi6pQ--~B/aD0xMDM2O3c9MTI5NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/d9e24a53fc493b415ea49a7b4a930b3d", "published_at": "2019-10-27"}