{"pub": "mirror", "url": "https://mirror.co.uk/3am/style/3am-fashion-celebrity-beauty/sleep-remedies-insomnia-potpourri-crystals-20537289", "downloaded_at": "2019-10-13 00:21:55.719308+00:00", "title": "Sleep remedies for insomnia from potpourri crystals to clever pillow mists tested", "language": "en", "text": "Get the biggest Weekly Fashion stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nStruggling to get a good night's sleep?\n\nJoin the sleepless club.\n\nWith the clocks about to go back on October 27th, you may be in for an extra hour in bed but that could just spell an extra hour of restless sleep for some.\n\nLuckily there are plenty of ways to help ease an anxious mind and get yourself in the mood for slumber.\n\nWhether it's a trusty pillow mist (with a upgrade!) or a fancy new room diffuser that puffs out a spa-like aroma, these new launches are promising to make it easier than ever to get to sleep.\n\nWe've had our expert team of tester try them out so you know the best ones to invest in...\n\nBeauty writer Zoe says: ‘These crystals come in a jar and are meant to act as a room diffuser when you put 6-10 drops of oil onto them.\n\n'I went for the Recovery + Sleep Essence, £35, which was a lovely punchy lavender scent.\n\n'I put the jar next to my bed but I had to be so close to it to actually smell the oil and I used half the bottle by night three.\n\n'I don’t think I slept better for them but they looked nice.’\n\nSub editor Bex says: ‘This is just dreamy – literally.\n\n'Smells gorgeous, so helps me drift off within minutes, but it’s my daughter, who is six, who really struggles to go to sleep.\n\n'She can get herself so worked up in the evening when she can’t drift off, and this instantly relaxes her enough to help her reach the Land Of Nod.\n\n'Happy mum all round.’\n\nBeauty director Lynne says: ‘Much as I love them, scented candles are the last thing I’d use to make me sleepy in case I actually nod off and set the house on fire.\n\n'This plug-in diffuser is good for my peace of mind because it’s not going to overheat, and it hardly takes any time for the essential oil to fill my bedroom with a spa-like aroma.\n\n'I’ve been using the calming Puressentiel Relax Blend, £9.90, which gets me ready for sleep.’\n\nDeputy features ed Rosie says: ‘It has a very rich and sophisticated sandalwood, chamomile and vetiver fragrance, which was a nice change to the usual lavender.\n\n'One little spray was enough to keep the scent lingering for ages.\n\n'It was very soothing and relaxing and did positively affect my falling asleep so I’ll definitely keep on using it.’\n\nEditor-in-chief Mel says: ‘I threw quite a lot into my bath so the water had a very strong lavender smell.\n\n'The salts were bright purple but the water stayed clear, but very silky.\n\n'When I was finished, the scent wafted from the bathroom into the bedroom and I instantly fell asleep - but woke up at 4.30am.\n\n'They did make my skin feel very soft which was a nice bonus.’", "description": "Having trouble getting to sleep? You're not alone, and these new products promise to get you dozing off faster and staying asleep for longer", "authors": ["Zoe Cripps"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20537520.ece/ALTERNATES/s1200/1_GettyImages-1074270532.jpg", "published_at": "2019-10-12"}