{"pub": "foxnews", "url": "https://foxnews.com/politics/chris-smith-new-jersey-former-intern-reelection-challenge", "downloaded_at": "2019-09-03 23:43:56.231674+00:00", "title": "GOP Rep. Chris Smith may face reelection challenge from onetime intern", "language": "en", "published_at": "2019-09-03", "text": "A former intern for Rep. Chris Smith, R-N.J., is among a handful of candidates looking to unseat the veteran congressman next year.\n\nStephanie Schmid, 39, interned for Smith's office 23 years ago while she was in high school. The human rights activist and former foreign service officer is one of four Democrats seeking the party's nomination in the race for the 4th Congressional District.\n\nShe told WHYY radio that she credited her internship with exposing her to human rights issues, but said it also helped her realize she didn't share the same politics as Smith, who's held office for nearly 30 years.\n\n“Even though I was only 16, I knew then that we did not share the same values, particularly when it comes to women’s rights and equality,” Schmid said.\n\nIn a tweet announcing her candidacy, she cited Smith's vote against the Violence Against Woman Act and his \"extreme views on women's health care.\"\n\nSchmid moved back to New Jersey this year after leaving her position as legal counsel for the Center for Reproductive Rights in Washington, CQ Roll Call reported.\n\nSmith was elected to Congress in 1980 and has been a staunch opponent of abortion. He has a reputation within his constituency for writing laws that benefit veterans and families dealing with autism and Alzheimer's disease, New Jersey Republican State Chairman Doug Steinhardt told the station.\n\nSmith's office did not immediately respond to a Fox News request for comment.\n\nSchmid said she was hoping to ride a blue wave similar to the one during the 2018 midterm elections, in which Dems retook control of the House, as some voters express frustration with President Trump at the polls.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSmith won his last election by 13 percentage points and is seen as a favorite going into 2020.\n\nOther potential challengers include writer David Applefield, lobbyist Tiffany Kaszuba and life coach Christine Conforti.", "description": "A former intern for U.S. Rep. Chris Smith, R-N.J., is among several candidates looking to unseat the nearly 30-year congressman.", "authors": ["Louis Casiano"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Chris-Smith.jpg"}