{"pub": "marketwatch", "url": "https://marketwatch.com/story/with-yet-another-restructuring-hp-wakes-up-to-the-realities-of-its-struggling-cash-cow-2019-10-03", "downloaded_at": "2019-10-04 01:21:28.847797+00:00", "published_at": "2019-10-03", "title": "With yet another restructuring, HP wakes up to the realities of its struggling cash cow", "language": "en", "text": "Hewlett Packard Inc. is embarking on yet another massive restructuring of its business, with plans to cut 7,000 to 9,000 jobs over the next three years, as its biggest profit generator, printing, continues to reel from soft demand pressures and cheaper printing supplies.\n\nThe Palo Alto, Calif.-based computer and printing giant told Wall Street analysts at its annual investor meeting Thursday that it will save about $1 billion over the next three years with the restructuring. Job cuts will occur through a combination of employee exits and voluntary early retirement. One of the biggest moves HP HPQ, -1.02% will make is a shift to more services in printing: Customers will have two options — either pay more for an unlocked printer and buy the ink of your choice, or pay less for the hardware with a locked printer that can only use HP printer-ink refills.\n\nThis change in business model is not without risk, as Evercore Securities analyst Amit Daryanani pointed out in a note during the meeting.\n\n“This is an interesting idea but implementation of this and what ... peers do will be crucial to ensure Hewlett-Packard doesn’t end up losing market share,” Daryanani wrote.\n\n“We need to optimize our business model, maximize the installed base of 150 million printers,” said Tuan Tran, who will take over as president of HP’s printing business when Enrique Lores takes the helm as the company’s new chief executive next month.\n\nThe supplies business, made up mostly of ink cartridges, is HP’s biggest profit generator, but it has been under attack by two big factors: users who print far less, and copycats who are making cheaper clones of HP supplies to be used in HP printers, primarily in Europe, the Middle East and Asia. As Bernstein Research analyst Toni Saggonaghi wrote in a note last month, “there is a higher likelihood the printing business is a ‘melting ice cube,’ despite myriad efforts by HP to improve the business.”\n\nMost of the questions during the Q&A portion of the 4½-hour meeting focused on the printing business. Saggonaghi asked whether HP would eventually have to revisit yet another restructuring, once the benefits from the current plans have been realized. “Do we get another $1 billion in restructuring in another three years?” he asked. HP said that it did not expect the supplies business to grow in fiscal 2020 and executives declined to predict if supplies would grow again.\n\nHP executives said they are also reinvesting back in the business by streamlining and transforming their way of selling and distributing products, especially in printing. In addition, on the overall corporate side it is modernizing its systems. HP has, for example, been using 13 different enterprise resource-planning systems, which are being consolidated down into one. Still, all these efforts will not change the fact that its most important cash cow, ink, is falling out of favor.\n\n“This is why we think the solution to the problem is a shift in the business model,” Lores said.\n\nInvestors had come to associate the old Hewlett-Packard Co. — before it spilt into two companies, HP Inc. and enterprise computing-focused Hewlett Packard Enterprise HPE, +0.42% — with constant restructuring and reorganizations as its growth stalled. The goal of the 2015 split was to create two smaller, more nimble companies. But neither company has been able to avoid cost-cutting and layoffs, as headwinds arrived in various markets. HP Inc.’s supplies business has been under serious attack for the past year, and its various measures to address the problems have not helped so far, even as it made a huge acquisition, buying Samsung’s printer business in 2017.\n\nHP’s bold plans are not going to halt the changes in the market, and investors now need to wake up to the reality of the changes facing its crown jewel.", "description": "Hewlett Packard Inc. is embarking on yet another massive restructuring, with plans to lay off 7,000 to 9,000 employees over the next three years, as its...", "authors": ["Therese Poletti"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HE751_hp0227_ZG_20190227215415.jpg"}