{"pub": "yahoo", "url": "https://finance.yahoo.com/news/boeing-max-737-likely-biggest-ever-insurance-payout-005839885.html", "downloaded_at": "2019-09-05 00:31:40.303618+00:00", "published_at": "2019-09-03", "title": "Boeing MAX 737 likely biggest ever insurance payout: SP", "language": "en", "text": "Paris (AFP) - The insurance payout on the beleaguered Boeing 737 MAX aircraft after two crashes claimed 346 lives will likely be the biggest ever, S&P Global Ratings said Tuesday.\n\nMarc-Philippe Juilliard, a directer with S&P, told a press conference the twin crashes and the subsequent global grounding of the aircraft since March amounted to the \"worst disaster in the history\" of aviation insurance.\n\nBesides the accidents, insurers and re-insurers must also cover the costs of grounding the aircraft which will rise the longer it lasts, Juillard said, adding that it was \"too early\" to estimate the eventual payout.\n\nBoeing has repeatedly been forced to push back the expected clearance of the aircraft by aviation regulators as a series of problems has come to light, stoking demands from airlines with the 737 MAX, or waiting on deliveries, for compensation for their loss of business.\n\nMany are now fixing December as the most probable date for the plane to resume flying again but there is considerable uncertainty still if that will be possible.\n\n\"We will be able to talk (about the cost) when the airplanes begin to fly... but clearly that is going to cost money,\" Juillard said.\n\nBoeing reported a second quarter loss of nearly three billion dollars, largely due to the problems with the 737 MAX.\n\nThe US aviation giant has said that so far total costs come to about eight billion dollars, including a charge of $5.6 billion to cover possible airline compensation claims.", "description": "The insurance payout on the beleaguered Boeing 737 MAX aircraft after two crashes claimed 346 lives will likely be the biggest ever, S&P Global Ratings said Tuesday.  Marc-Philippe Juilliard, a directer with S&P, told a press conference the twin crashes and the subsequent global grounding of the aircraft", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/esvbf9ZbbjqHPgAv6Cd4EA--~B/aD01MTE7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/a9278297a20436f347fd8199ffbf3b03fbc111c5.jpg"}