{"pub": "fox", "url": "https://foxbusiness.com/lifestyle/espn-host-michael-smith-agrees-to-buyout-of-10m-contract", "downloaded_at": "2019-10-03 23:28:32.362972+00:00", "published_at": "2019-10-03", "title": "ESPN host Michael Smith agrees to buyout of $10M contract", "language": "en", "text": "Former ESPN anchor and on-air personality, Michael Smith, finally negotiated a buyout of his $10 million contract with the network.\n\nContinue Reading Below\n\nHe is leaving to become the executive vice president and chief content officer of a new startup -- (Co)laboratory, which will feature content for various media platforms.\n\nSmith, 40, has been in limbo, albeit well-compensated, ever since early 2018, when he and then-co-host Jemele Hill were separately replaced as the two lead anchors on the 6 p.m. edition of ESPN's flagship show, \"SportsCenter.\" In conjunction with the sports television network, the two were a part of a renovated version of the legendary program -- known as \"The Six\" or \"SC6\" -- that made an effort to be somewhat hipper and more informal, with mixed results. That version of the show lasted for only about a year before returning to its more classic format.\n\nHill negotiated a buyout of her own $10 million contract more than a year ago and currently writes for The Atlantic. Prior to hosting \"SportsCenter\" together, Smith and Hill had co-hosted another ESPN show called \"Numbers Never Lie\" (which later was renamed \"His & Hers\") for more than five years.\n\nSmith did not divulge the exact financial terms of his ESPN exit, but he told the New York Post in an interview: “I was ready for a new chapter. I was ready for a new challenge. I’ve been at ESPN for 15 years. I’ve worn pretty much every hat imaginable. Realistically, the opportunities that were available to me at this point, I don’t know how much growth they truly represented, especially compared to this opportunity. I think what we are going to do for athletes and content creators throughout the industry when it comes to storytelling and when it comes to content development and distribution, it is going to be significant, impactful and disruptive.\n\nCLICK HERE FOR MORE FROM FOX BUSINESS", "description": "ESPN host Michael Smith agrees to buyout of $10M contract.", "authors": ["Christian De La Chapelle"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/Michael-Smith-GettyImages-813110784.jpg?ve=1&tl=1"}