{"pub": "bbc", "url": "https://bbc.com/news/business-50189019", "downloaded_at": "2019-10-28 00:27:54.569447+00:00", "title": "Virgin Galactic: Branson's space firm set for stock market launch", "language": "en", "text": "Image copyright Reuters Image caption The entrepreneur has been working on his space tourism project for over 10 years\n\nVirgin Galactic, the space venture backed by Sir Richard Branson, is ready to launch - not into space but on the New York Stock Exchange (NYSE).\n\nShares in Virgin Galactic are set to start trading on Monday, a first for a space tourism company.\n\nThe move follows Virgin's merger with publicly-listed Silicon Valley holding firm Social Capital Hedosophia.\n\nThat deal brought $800m (£624m) to Virgin as it rushes to meet its goal of sending customers to space in 2020.\n\nTaking the firm public will \"open space to more investors and in doing so, open space to thousands of new astronauts,\" Sir Richard said at the time.\n\nSocial Capital Hedosophia is already listed on the NYSE, allowing Virgin to sell shares without following the traditional stock offering process.\n\nShares in Social Capital Hedosophia, which will start trading under the ticker SPCE on Monday, jumped 11% on Friday in anticipation of the debut.\n\nSpace race\n\nVirgin Galactic is racing with Elon Musk's SpaceX and Jeff Bezos's Blue Origin to be the first company to send fee-paying passengers into space.\n\nThe company, founded in 2004, has spent more than $1bn developing its programme, which is years behind schedule and took a hit after a fatal accident in 2014.\n\nImage copyright Virgin Galactic Image caption Virgin Galactic's plane will be carried to a height of 12,000m before its rocket ignites\n\nHowever, Virgin has told investors it hopes to make 16 trips to space with customers as soon as next year.\n\nIn a presentation, it predicts that revenue will skyrocket as the number of flights increases.\n\nIn 2023, the firm expects to make 270 trips to space, bringing in nearly $600m and generating profit of more than $430m.\n\nAbout 600 people, including pop star Justin Bieber, have already put down deposits for the 90-minute experience at a price of about $250,000 per ticket, according to the company.\n\nVirgin's plans are exciting - but investing carries some significant risks, notes Swen Lorenz, of the financial analysis website Undervalued Shares.\n\n\"No disrespect, but Virgin Galactic is both a plan and a dream, rather than a secure future cash flow,\" he concludes in his write-up of the company.\n\nBillion dollar business\n\nThe New York Stock Exchange launch follows last week's completion of the tie-up, which valued Virgin at $1.5bn.\n\nSocial Capital Hedosophia took a 49% stake in Virgin in exchange for a roughly $700m investment.\n\nSocial Capital Hedosophia's founder, former Facebook executive Chamath Palihapitiya, also personally invested $100m.\n\nIn addition, Virgin recently announced that US aerospace giant Boeing would invest $20m by buying shares.\n\nSir Richard last year said Virgin would not move forward with talks on possible investment from Saudi Arabia after the murder of journalist Jamal Khashoggi.", "description": "Shares in the space tourism company are due to start trading in New York on Monday.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/16BA6/production/_101749039_045828512.jpg", "published_at": "2019-10-28"}