{"pub": "washingtonpost", "url": "https://washingtonpost.com/powerpost/former-republican-congressman-collins-pleads-guilty-in-insider-trading-case/2019/10/01/1de62172-e484-11e9-b403-f738899982d2_story.html", "downloaded_at": "2019-10-02 00:35:56.578680+00:00", "title": "Former Republican congressman Collins pleads guilty in insider-trading case", "language": "en", "text": "Collins, President Trump’s first congressional supporter, resigned from the House on Monday, giving up the seat he had represented since 2013 in New York’s 27th Congressional District, which encompasses suburban and rural areas stretching east of the Buffalo metropolitan area.\n\nAD\n\nIn admitting his guilt Tuesday afternoon, Collins also expressed remorse and regret that he had let down his longtime friends, family and constituents.\n\nAD\n\n“I’m embarrassed and dismayed,” he said. “There’s nothing I can change except to take responsibility, and that’s why I’m here.”\n\nCollins was indicted in August 2018. He allegedly tipped off his son to confidential information about an Australian biotechnology company, Innate Immunotherapeutics, that he learned as a member of its board. Collins and several others used the information to avoid more than $700,000 in losses, according to prosecutors.\n\nCollins’s son, Cameron, and another family member are scheduled to change their pleas Thursday.\n\nAD\n\nRepublican Rep. Chris Collins resigns House seat ahead of guilty plea to insider-trading charges\n\nInnate Immunotherapeutics was developing a therapy for multiple sclerosis. Collins served on the company’s board of directors and was its largest shareholder, according to a federal indictment.\n\nWhile at the June 2017 congressional picnic at the White House, Collins received an email from the chief executive of Innate Immunotherapeutics, alerting the company’s board that an eagerly anticipated drug trial had been a failure, according to prosecutors. Minutes later, Collins responded to the email: “Wow. Makes no sense. How are these results even possible???”\n\nAD\n\nCollins immediately tried to contact his son, who owned millions of Innate Immunotherapeutics shares, according to the indictment. Within a few minutes, Collins and his son called each other six times before connecting and talking for six minutes. During that call, Collins told his son about the failed drug trial, according to the indictment, which cites phone and bank records, as well as texts.\n\nAD\n\nWith that insider knowledge, Collins and his family were able to avoid significant losses before the news became public and the company’s stock price fell more than 90 percent, prosecutors allege.\n\nIn the courtroom Tuesday, Collins said, “I strongly believed . . . that this drug was going to succeed, and I was devastated by the news and thinking about the multiple sclerosis patients we wouldn’t be able to treat.”\n\nAD\n\nStill, Collins said, when he called his son and let him know the trials had failed, and then lied to the FBI 10 months later when they questioned him, “I knew [those things] were illegal and improper.”\n\nIn a televised news conference the day the charges were announced, Collins insisted he was innocent; he called the charges against him “meritless.” After initially suspending his reelection campaign last year, he reversed that decision despite pressure from Republicans to step aside and allow another GOP candidate on the ballot. Collins, who narrowly won, was sworn in for a fourth term in January but was not seated on any House committees pending resolution of his indictment.\n\nAD\n\nCollins will be sentenced Jan. 17, 2020.\n\nThe maximum prison sentence for the conspiracy charge is five years in prison, as is the maximum prison sentence for the second count. Stiff financial fines are possible, with the maximum for both counts $250,000, or twice the gross gain or loss.\n\nAD\n\nCollins’s resignation from the House sets up a special election in the coming months; its date will be set by New York Gov. Andrew M. Cuomo (D). Several candidates had announced campaigns to challenge Collins in 2020, including GOP state Sens. Chris Jacobs and Rob Ortt, as well as Democratic lawyer Nate McMurray, who came about 1,000 votes shy of unseating Collins last year.\n\nRead more at PowerPost\n\nAD", "description": "The plea came one day after the New Yorker resigned his House seat.", "authors": ["Sheila Mcclear"], "top_image": "https://www.washingtonpost.com/resizer/FiaRUnryHgdQ3fpyWBZgT_nOsRE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5YWW3EHETAI6TNAD644ITGMC2I.jpg", "published_at": "2019-10-01"}