{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/leah-bracknells-family-devoted-husband-20636382", "downloaded_at": "2019-10-16 21:11:05.918719+00:00", "title": "Leah Bracknell's family: Devoted husband and the children she leaves behind", "language": "en", "text": "Get the biggest soaps stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLeah Bracknell's devastated family have been quietly grieving the loss of the former Emmerdale star, who died last month at the age of 55.\n\nThe actress was supported until the very end by her husband Jez Hughes and her two grown-up daughters Lily and Maya, who released a poignant statement today confirming she had lost her fight with terminal lung cancer.\n\nLeah - known as Ali to her family - quietly married her long-term partner in March 2017 , six months after learning her stage 4 cancer was uncurable and inoperable.\n\nThey wed in a small and intimate civil ceremony in Horsham, West Sussex, on March 10 2017 after 13 years together.\n\n(Image: Leah's Cancer Fund)\n\nLeah initially chose not to have chemotherapy as it offered her little extra time.\n\nInstead, her research suggested immunotherapy, which boosts the body’s own ability to fight the cancer, was her best chance of prolonging her life.\n\nBut it was not available on the NHS and she would have to pay for treatment privately in Germany.\n\nHer family appealed to relatives and friends for help raising the money on a private Facebook page, but it wasn’t long before the news spread and the public raised nearly £65,000 in just two weeks.\n\n(Image: Daily Record)\n\nBefore Leah could fly out, a new consultant discovered she was eligible for a targeted drug which she qualified for thanks to her Chinese heritage on her mother’s side.\n\nBut by March 2017, it was clear the new treatment was no longer working.\n\nLeah and Jez then decided to tie the knot in fear that she didn't have much time left to set her affairs in order.\n\nAs time would tell, Leah managed to hold on until September 2019 before her cancer became too aggressive to fight.\n\n(Image: ITV)\n\nThe inspirational actress and yoga teacher had spoken frequently and bravely about her battle, insisting that she would stay positive throughout the worst of it.\n\nBut she admitted in 2016 that her worst moment came when it was time to tell her adult daughters of her diagnosis.\n\n\"Any mother will know how I felt,\" she told the Daily Mail at the time.\n\n\"It's the worst thing you can imagine having to tell those closest to you, something like this . . . trying to find the words. It's the worst thing I've had to do…\"\n\nShe added: \"I think it's almost worse for those close to you because they're trying to look after and protect the person who's poorly, not just physically, but emotionally.\"\n\n(Image: Rex Features)\n\nIn a statement, her family said: \"It is with the deepest sadness that Leah Bracknell's family confirm that Leah passed away in September, three years after her diagnosis with stage 4 lung cancer.\n\n\"They would like to thank all the public for their support and generosity which contributed to the extension and quality of her life over the past three years.\n\n\"Leah continued to embrace life and faced her illness with positivity. Many aspects of her journey can be found on her blog.\n\n\"Leah was best known and much loved as Zoe Tate in Emmerdale.\n\n\"She also had roles in Judge John Deed, A Touch of Frost, The Royal Today and DCI Banks to name just a few, as well as numerous appearances on stage and in pantomime.\n\n\"As well as acting, Leah was also an accomplished yoga teacher and shamanic healer.\n\n\"Leah had an energy and enthusiasm for life, a kind heart and much love to give to those around her.\n\n\"Her family have asked for privacy at this very sad time.\"", "description": "Emmerdale star Leah Bracknell, who played Zoe Tate in the ITV soap, has died at the age of 55 after losing her fight with lung cancer", "authors": ["Emmeline Saunders", "Image", "Leah'S Cancer Fund", "Daily Record", "Itv", "Rex Features"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article12012771.ece/ALTERNATES/s1200/0_Leahs-Cancer-Fund.jpg", "published_at": "2019-10-16"}