{"pub": "yahoo", "url": "https://news.yahoo.com/subterranean-blaze-indonesia-struggles-douse-undergound-fires-070807153.html", "downloaded_at": "2019-09-17 10:40:27.826364+00:00", "title": "Subterranean blaze: Indonesia struggles to douse underground fires", "language": "en", "text": "Pekanbaru (Indonesia) (AFP) - Thousands of Indonesian firefighters are locked in an around-the-clock game of Whack-a-Mole as they battle to extinguish an invisible enemy -- underground fires that aggravate global warming.\n\nVast blazes are ripping across the archipelago's rainforests, unleashing a toxic haze over Southeast Asia that has triggered health fears and sent diplomatic tensions with Indonesia's neighbours soaring.\n\nJakarta deployed more than 9,000 personnel to battle fires turning land into charred landscapes and consuming forests in hard-hit Sumatra and Borneo island.\n\nBut many of the blazes smoulder deep underground in once-swampy areas known as peatlands, where they can last for months and release eye-watering amounts of thick, acrid smoke.\n\n\"It's so much harder to fight fires on peatlands,\" a dirty and exhausted Hendri Kusnardi told AFP outside smog-hit Pekanbaru city in Sumatra.\n\n\"Even after we've managed to put out a fire on the ground, sometimes it is not over because it's still burning underground. And then the next morning the ground fire will just reignite.\"\n\n- 'Human behaviour' -\n\nThe culprit behind Indonesia's blazes is usually illegal fires set to clear land for the lucrative palm oil and pulpwood industries -- and the situation this year has been worsened by drier weather.\n\nSome of the most serious fires happen in carbon-rich peatlands -- topped with layers of decomposed plant material several metres thick -- which become highly combustible when they're drained of water to be converted into plantations.\n\n\"The forest and peatland fires that occur every year are a crisis created by human behaviour,\" said Rusmadya Maharuddin, a forest campaigner at Greenpeace Indonesia.\n\n\"Sometimes the fires will continue to burn for months, releasing emissions and causing haze.\"\n\nPeat fires can belch out three times as much smoke per kilogramme of material than high-temperature forest fires, she added.\n\nAt the peak of Indonesia's 2015 forest fires -- the country's worst in two decades -- blazes in peat swamp forests emitted nearly 16 million tonnes of carbon emissions daily, more than the entire US economy in the same period, according to watchdog The International Union for Conservation of Nature.\n\nAcross the Pacific Ocean, huge fires tearing through the Amazon are compounding concerns about the long-term impact, as increasing fire outbreaks globally creates more greenhouse gas emissions and makes it harder to limit temperature rises, experts say.\n\n- Detection drawback -\n\nFighting peatland fires comes with myriad challenges because they're often in remote locations, the soft soil makes them inaccessible by car and firefighters need huge amounts of water -- often pumped below ground -- to get at subterranean blazes.\n\nIndonesia has deployed water-bombing helicopters, but the onset of the rainy season, which usually starts in October, could be the only thing able to douse the fires.\n\n\"When you're dealing with large areas of peat burning it's just so expensive to bring in large quantities of water,\" said Michael Brady, an Indonesia-based peatlands expert at the Center for International Forestry Research.\n\n\"Water-bombing is not very effective because you just can't drop enough water\" to douse them, he added.\n\nSatellite radar used to find hotspots -- areas of intense heat which indicate a high chance of fire -- does not always pinpoint below-ground blazes.\n\n\"It may not show up as a hotspot...(because) there might not be enough heat at the surface of the ground,\" Brady said.\n\n\"So, one of the challenges is just to detect them.\"\n\n- 'Not going away' -\n\nAuthorities are beefing up law enforcement to catch those responsible for illegal burning and have moved to restore degraded peatland forests -- a key buffer against annual flooding and home to endangered species, including Sumatran orangutans.\n\nBut despite Indonesia's progress over the past few decades, fighting fires is still a challenge even for countries like the United States, Canada and Australia which have some of the top technologies and fire prevention programmes, Brady said.\n\n\"This is not going to go away,\" he added.\n\n\"We're not going to find a solution to eliminate fires on the landscape completely and we're not going to 'tackle' it. This requires an ongoing investment.\"", "description": "Thousands of Indonesian firefighters are locked in an around-the-clock game of Whack-a-Mole as they battle to extinguish an invisible enemy -- underground fires that aggravate global warming.  Vast blazes are ripping across the archipelago's rainforests, unleashing a toxic haze over Southeast Asia", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/u6xjziOvScI5jdrtCs8pfw--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/927fe4026b4d3cdd41cc678aa61a27e0d5c56cea.jpg", "published_at": "2019-09-16"}