{"pub": "cbc", "url": "https://cbc.ca/news/canada/toronto/cupe-threatens-work-to-rule-campaign-1.5295013", "downloaded_at": "2019-09-24 13:42:29.043428+00:00", "title": "CUPE education workers threaten 'disruptive' work-to-rule campaign | CBC News", "language": "en", "text": "The chances are \"very high\" that 55,000 employees of Ontario schools will work-to-rule starting next week, according to a union leader representing them.\n\nLaura Walton, the president of CUPE's Ontario School Board Council of Unions, told CBC Radio's Metro Morning that the move would disrupt things like cleaning operations at some schools.\n\n\"I think it's fairly disruptive,\" Walton said Tuesday.\n\nAmong the thousands CUPE represents are custodians, administrative assistants and early childhood educators. Last week, those workers voted 93 per cent in favour of a potential strike as negotiations on a new contract continue with the Ontario government.\n\nCUPE is just one of the unions locked in talks with Doug Ford's PC government. So far, none have been able to reach a deal, raising the concern of a widespread school strike that could happen this fall.\n\nEducation Minister Stephen Lecce has previously called on all of the parties involved to reach a deal as soon as possible to give \"predictability and confidence\" to parents, students and educators and said that the government is operating in good faith.\n\nHowever, Walton said there's a \"big disconnect\" between Lecce's words and what CUPE is seeing at the bargaining table. She said the concessions being asked of the union would be detrimental to the public education system.\n\n\"This is something worth fighting for,\" she said.\n\nWalton also rejected the idea that education workers should prepare themselves for less as the Ontario government tries to reduce its deficit.\n\n\"People who make an average of $38,000 a year didn't cause the deficit,\" Walton said, referencing the average annual wage CUPE workers make.\n\nCBC Toronto has contacted Lecce's office for a response to Walton's comments and will update this story as soon as possible.\n\nMore education stories you might be interested in:", "description": "The chances are \"very high\" that 55,000 employees of Ontario schools will work-to-rule starting next week, according to a union leader representing them.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5295028.1569326766!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_620/ontario-classroom-generic.jpg", "published_at": "2019-09-24"}