{"pub": "washingtontimes", "title": "BOOK REVIEW: 'Debunking Howard Zinn'", "url": "https://washingtontimes.com/news/2019/aug/19/book-review-debunking-howard-zinn", "language": "en", "published_at": "2019-08-19", "downloaded_at": "2019-09-03 00:04:43.993416+00:00", "text": "ANALYSIS/OPINION:\n\nEver wonder why 31-year old pro-quarterback Colin Kaepernick and other young people became so alienated from the freest, most generous nation in the world? Could recent generations be “learning” things that just aren’t so? The answer is “yes.”\n\nAs the New Criterion’s estimable Roger Kimball wrote, Howard Zinn’s “‘A People’s History of the United States’… has probably done more to poison the minds of high school students than any other work of history.”\n\nIn “Debunking Howard Zinn,” Mary Grabar takes on an icon of the left who has sold 2.5 million copies of his wildly distorted book. Zinn’s one-sided polemic against the United States has been used as a text in countless universities and high schools. The predictable result — many American youth soured on their country.\n\nMs. Grabar dissects her subject analytically, quoting him accurately and demonstrating that Zinn rarely returned that favor when writing about his targets. Columbus Day is being “de-celebrated” nowadays, in part because of Zinn’s tendentious presentation of the explorer’s supposedly genocidal interactions with native peoples. Ms. Grabar proves the opposite, pointing to Columbus’ diaries, revealing what Zinn omitted.\n\nIndeed, Columbus prevented many abuses against the tribes he encountered and his diary reflects instructions to his men that they should employ “kindness” toward the natives. Zinn ignores such history entirely.\n\nZinn’s ripest target is slavery, that huge stain on American history. But to him, capitalism is somehow the cause of human ownership. He never concedes that the famously capitalistic Abraham Lincoln and the free Union forces fought and died to end slavery. Zinn depicts abolitionist leader Frederick Douglass as anti-American, ignoring Douglass’ famous 1852 speech, referring to our Declaration of Independence as that “glorious liberty document.” Douglass loved his country, but simply called upon his fellow Americans to live up to our founding ideals by ending human bondage.\n\nLincoln himself is caricatured as racist by Zinn, even suggesting that he “initiated hostilities” with the Confederacy.\n\nMs. Grabar deftly exposes Zinn’s shameful treatment of America’s motives in World War II. In his twisted view, we were not fighting aggressive Nazism and fascism, but rather to advance imperialism and rapacious capitalism. Of course, the United States and Western democracies were less responsible for Hitler’s defeat than were the Soviets. He opposed the use of atomic weapons, suggesting that our unreasonable “insistence on unconditional surrender” was the primary obstacle to peace with Japan.\n\nMs. Grabar adds: “Zinn obscenely compares internment camps for the Japanese to Nazi concentration camps.” Perhaps Congresswoman Ocasio-Cortez studied Zinn prior to comparing today’s border processing centers to concentration camps, just this summer.\n\nPostwar, following the Soviets’ violent domination of Eastern Europe, Zinn wrote that President Truman “worked to create an atmosphere of crisis and cold war.” Stalin’s ruthless nationalization of private property resulted in the starvation of millions of Soviet citizens. But Zinn praises the USSR’s “astounding comeback” from the ravages of war.\n\nAnd as Mao’s Communist forces swept in to Peking, eventually murdering tens of millions, Zinn describes the “closest thing … to a people’s government, independent of outside control.” Ms. Grabar rightly calls this “another lie,” linking Mao to his master in Moscow, Stalin.\n\nZinn was reverential in hewing to Soviet propaganda lines. As Ms. Grabar put it: “No amount of proven treason, agitation for violent revolution, or, for that matter, mass murder and the immiseration of millions by socialist governments … would ever persuade Zinn to dial down his indignation at what he characterized as ‘hysteria’ about Communism.”\n\nZinn painted an untruthful picture of North Vietnam, as conflict was mounting in the 1960s. The Soviet-armed North was, in Zinn’s mind, simply part of “an upsurge all over the world of colonial peoples’ demanding independence.” But the North was essentially a Soviet colony, with support from Mao, bent on extending that brutal colonization to the relatively free South.\n\nZinn compared Ho Chi Minh to Thomas Jefferson, though Ho was a hard-line Leninist, trained in Stalin’s Moscow. Ho’s Communist forces openly practiced torture and terror on captured soldiers and civilians hesitant to cooperate with them. Over a million southeast Asians were murdered in the wake of the Communist victory there.\n\nMs. Grabar demonstrates how Howard Zinn constantly violated the methods of inquiry deemed essential by the American Historical Association. He routinely omitted critical portions of quotes and documents; he manufactured “facts”; he downplayed significant events and amplified the unimportant.\n\nMary Grabar’s sober research and analysis are more than equal to Zinn’s pretend history. Any university, high school or student who persists in taking Zinn seriously should balance their readings with “Debunking Howard Zinn.”\n\n• Herbert W. Stupp was a NYC Commissioner appointed by Mayor Rudolph Giuliani, after serving in the administrations of Presidents Ronald Reagan and George H. W. Bush.\n\n• • •\n\nDEBUNKING HOWARD ZINN: EXPOSING THE FAKE HISTORY THAT TURNED A GENERATION AGAINST AMERICA\n\nBy Mary Grabar\n\nRegnery History, $29.99, 342 pages\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Ever wonder why 31-year old pro-quarterback Colin Kaepernick and other young people became so alienated from the freest, most generous nation in the world?   Could recent generations be \"learning\" things that just aren't so? The answer is \"yes.\"", "authors": ["The Washington Times Http", "Herbert W. Stupp"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/08/19/SAXoPicture-07D115A4-269323073_c0-0-878-511_s1770x1032.jpg?6d32a95e7b1635f0101061f3b85a16213b477a26"}