{"pub": "indiatimes", "url": "https://indiatimes.com/news/india/rss-worker-pregnant-wife-and-child-brutally-murdered-in-west-bengal-377525.html", "downloaded_at": "2019-10-10 18:22:21.002176+00:00", "title": "RSS Worker, Pregnant Wife And Child Brutally Murdered In West Bengal", "language": "en", "text": "In a tragic incident, three people, including a child, were murdered by unknown miscreants in their house on Thursday in Jiyaganj area of Murshidabad. The deceased have been identified as Bandhu Prakash Pal (35), his wife Beauty Mondal Pal (30) and son Angan Bandhu Pal (6).\n\nBandhu Prakash Pal was a school teacher who worked in Gosaigram Sahapara Primary school and his wife was pregnant. All the three were brutally murdered by a sharp weapon, police said.\n\nWest Bengal: A teacher, his wife and child were murdered by unidentified miscreants in West Bengal's Murshidabad district yesterday. As per RSS West Bengal secretary Jishnu Basu, he was also an RSS worker and was recently associated with a 'weekly milan'. — ANI (@ANI) October 10, 2019\n\n\"Prakash was a teacher in Gosaigram Sahapara Primary school. He was working for the last 20 years. He is originally from the Sahapur area and had shifted in Murshidabad for his son's education. We do not know if they had any problem with anyone,\" said Sujoy Ghosh, brother of the deceased teacher.\n\nThe brutality of the murder has shocked everyone in the vicinity. The incident came to light after the neighbours found the bodies inside their house and informed the police.\n\nDon't Miss 2.3 K SHARES 1.2 K SHARES 480 SHARES 564 SHARES\n\nThe investigation into the matter is underway.\n\nNational Commission for Women (NCW) chairperson Rekha Sharma demanded the immediate arrest of the miscreants who murdered three members of a family.\n\nThe NCW chief raised the concerns in a letter to West Bengal Chief Minister Mamata Banerjee a day after the trio, including an eight-year-old boy, was murdered by an unidentified person.\n\n\"The commission being concerned in the matter directs that the culprits must be arrested immediately and ensure swift and fair investigation in the matter,\" the letter stated.\n\nBCCL/NCW chairperson Rekha Sharma\n\nSpeaking to ANI, Rekha Sharma said, \"I have taken the cognizance. After the incident, I do not know where these culprits vanish. The police do not take any action.\"\n\n(With PTI Inputs)", "description": "A Rashtriya Swayamsevak Sangh (RSS) worker, his pregnant wife, and their eight-year-old son were on Wednesday found murdered in West Bengal's Murshidabad district. The bodies of Bondhu Gopal Pal, a 35-year-old primary school teacher, his wife Beauty, and son were found lying in a pool of blood inside their residence on Tuesday in Jiaganj area of the district, police said.", "authors": ["Sylvester Tamang"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/rss_worker_murdered_1570699451_800x420.jpg", "published_at": "2019-10-10"}