{"pub": "cbs", "url": "https://cbsnews.com/news/hong-kong-protests-china-accuses-nancy-pelosi-interference-battle-to-control-media-message-2019-09-20", "downloaded_at": "2019-09-20 12:55:36.657907+00:00", "title": "China accuses Pelosi of \"interference\" as battle rages to control narrative on Hong Kong", "language": "en", "text": "House Speaker Nancy Pelosi, left, with Hong Kong activist Joshua Wong during a news conference on human rights in Hong Kong on Capitol Hill in Washington, September 18, 2019. AP\n\nBeijing — Joshua Wong, the secretary general of Hong Kong's pro-democracy political party Demosisto, met this week with Speaker of the U.S. House of Representatives Nancy Pelosi. Wong's mission was to push for more open U.S. support for the pro-democracy protests in the semi-autonomous Chinese territory. But audiences in Hong Kong and mainland China got very different accounts of his visit from their respective media outlets.\n\nA headline from Hong Kong's public broadcaster RTHK, said: \"Pelosi promises swift progress on HK rights act.\"\n\nBut the millions of people who tuned into coverage of the same meetings on CGTN, the global arm of China's state television network, heard that \"China strongly opposes U.S. interference in Hong Kong affairs.\"\n\nThe headline came after Chinese Foreign Ministry spokesman Geng Shuang reacted angrily to Wong's visit with Pelosi and other congressional leaders, saying Wednesday: \"We urge the U.S. to stop bolstering radical violent forces in Hong Kong that advocate Hong Kong independence, and stop intensifying words and actions that undermine the prosperity and stability of Hong Kong.\"\n\nHe called on the U.S. to \"respect China's sovereignty, stop interfering in Hong Kong affairs in any form and stop promoting the review of relevant Hong Kong-related proposals.\"\n\nThe mass demonstrations in Hong Kong have just passed the 100-day mark. The unrest continues despite Hong Kong's Beijing-appointed leader Carrie Lam's move to formally withdraw an extradition bill that would have allowed Hong Kong residents to be sent to mainland China for trial.\n\nViolent protests erupt in Hong Kong\n\nIt was that proposed legislation that sparked the mass upheaval months ago; Hong Kongers saw it as evidence of Beijing trying to erode the level of autonomy the territory was granted when it was returned from Britain to Communist China in 1997.\n\nWhile the protests were initially focused on calling for Lam to withdrawal the extradition bill, her administration's initial reluctance to do that, combined with violent clashes between protesters and Hong Kong police, led the movement to issue five demands.\n\nIn addition to the extradition bill withdrawal, the protesters now demand that Lam step down, an independent inquiry be launched into police brutality, arrested protesters be released without charge, and that universal suffrage be implemented in Hong Kong so residents can directly elect their own next leader.\n\nReliable sources?\n\nBoth sides are trying hard to control the narrative. Lam said this week that international public relations firms have turned down her administration's requests to help restore the city's reputation.\n\nHong Kong's activists have been raising money through a crowdfunding campaign, meanwhile, to publish newspaper ads globally to push their pro-democracy cause.\n\nReport: TikTok may be censoring Hong Kong protests\n\nPeople on mainland China, who often have no access to foreign media due to government censorship, hear a different version of events from state media.\n\nNews outlets that are state-run or have links to the government spill out headlines along the lines of, \"Hong Kong female protester hit in the eye by fellow protester.\" CBS News reported several weeks ago that a female protester was shot in the eye at close range with a beanbag fired by police. The image of a bloodied eye has become a symbol for the pro-democracy movement.\n\nAnother official Chinese agency reported on how \"black hands behind the scene teach activists who disrupt Hong Kong.\"\n\nThe efforts often go beyond traditional news media. Social media companies in the U.S. have shut down accounts deemed to be involved in a Chinese state-directed disinformation campaign.\n\nNancy Pelosi has been a frequent target of such accounts. The Democratic lawmaker from California has been an outspoken advocate of democratic reform in China since 1991, not long after the Tiananmen Square crackdown.\n\nChina's state-controlled newspapers called her \"a politician who can't tell right from wrong,\" and accuse her of \"backing and encouraging radical activists.\"\n\nIt's impossible to know what the majority of mainland Chinese think of the protests in Hong Kong, or American politicians' views on them. But with celebrations to mark the 70th anniversary of the founding of Communist China less than two weeks away, leaders in Beijing are trying very hard to keep their country's - and the world's - attention focused on anything other than Hong Kong.", "description": "While media in Hong Kong reported the U.S. House Speaker promising to work for rights in the city, Chinese news outlets spoke of \"interference\"", "authors": ["Shuai Zhang"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/09/20/c60ce430-2c7b-401a-be2e-13ebe6ff9f33/thumbnail/1200x630/64efaab527684b08f35de44c1842305a/nancy-pelosi-joshua-wong-hong-kong-ap-19261576930195.jpg", "published_at": "2019-09-20"}