{"pub": "huffpost", "url": "https://huffpost.com/entry/jim-mattis-regrets-criticism-joe-biden-new-book_n_5d756665e4b07521022e6e1c", "downloaded_at": "2019-09-09 00:34:03.394365+00:00", "title": "Jim Mattis Says He Regrets Strong Criticism Of Joe Biden In New Book", "language": "en", "text": "Former Secretary of Defense Jim Mattis on Sunday expressed regret for criticizing Joe Biden in his new memoir, claiming he wouldn’t have been as harsh had he known the former vice president would launch a bid for the White House.\n\nMargaret Brennan, host of CBS’s “Face the Nation,” read an excerpt of Mattis’ book, “Call Sign Chaos: Learning to Lead,” in which he suggests Biden ignored advice from intelligence officials who cautioned against the Obama administration’s withdrawal from the Iraq War.\n\n“He exuded the confidence of a man whose mind was made up, perhaps even indifferent to considering the consequences were he judging the situation incorrectly,” Mattis wrote in the book.\n\nMattis told Brennan he had begun writing his “history book” in 2013 and was unaware that Biden ― now a Democratic front-runner whose candidacy was long suspected ― would actually run.\n\n“Had I known that the former vice president was going to run for office, I assure you I would not have probably been that forthcoming,” he said.\n\n“Had I known the former vice president was going to run for office, I assure you, I would not have probably been that...forthcoming,” Jim Mattis tells @margbrennan of his analysis of Obama-era foreign policy in his new book. pic.twitter.com/2blbEka1Oi — Face The Nation (@FaceTheNation) September 8, 2019\n\nStill, Mattis defended his assessment of Biden, speculating that the administration had decided prematurely to pull U.S. troops out of Iraq.\n\n“The intelligence community was very clear,” he said. “They forecasted the rise of a group ― you and I know it as ISIS, and we should have taken their advice on board.”\n\nMattis served under former presidents George W. Bush and Barack Obama, and he has discussed his policy differences with each of them. But he has taken particular care to avoid any criticism of President Donald Trump in his writing and during interviews.\n\nMattis said Tuesday during a Q&A session with Council on Foreign Relations President Richard Haass that he would speak out about the current administration “when the time’s right.” He offered no indication as to when he would break his silence.\n\n“I don’t believe that if you leave an administration over a matter of policy ... that you then get out and start talking in what we commonly call a kiss-and-tell now,” he said. “I don’t think it’s the right thing to do.”\n\nMattis stepped down from his post as defense secretary last year with a resignation letter that appeared to scrutinize Trump’s military judgment and imply that the president did not take seriously the threat of authoritarianism in Russia and China.", "description": "The former defense secretary said he didn't know the former vice president would launch a bid for the White House.", "authors": ["Trends Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d7570cd240000122777c74d.jpeg?ops=1778_1000", "published_at": "2019-09-08"}