{"pub": "businessinsider", "url": "https://businessinsider.com/rb-salzburg-coach-yellow-card-celebrations-against-liverpool-champions-league-2019-10", "downloaded_at": "2019-10-03 23:34:57.048612+00:00", "published_at": "2019-10-03", "title": "RB Salzburg's coach was penalized for celebrating with his team, then got beaten by Liverpool FC 9 minutes later", "language": "en", "text": "Jesse Marsch, who manages Austrian side RB Salzburg, sprinted down the sideline to celebrate after his side pulled back a 3-0 deficit against Liverpool FC in the Champions League on Wednesday night.\n\nHowever, the American coach's actions came back to haunt him just nine minutes later when Liverpool's Mohamed Salah scored what proved to be the winner.\n\n\"The emotion I had in that moment and the pride I had in the way the team started out the second half is what led to that celebration,\" Marsch told BeIN Sports after the game.\n\nLiverpool scored one of the goals of the season on the night via Andy Robertson, which you can watch below.\n\nRead more of our soccer stories here.\n\nVisit Business Insider's homepage for more stories.\n\nJesse Marsch, manager of Austrian side RB Salzburg, sprinted down the sideline to celebrate with his players after they came back from 3-0 down against Liverpool FC to level the score in the 60th minute of their Champions League group stage match Wednesday night.\n\nHe was shown a yellow card for his actions.\n\nHowever, the 45-year-old from Wisconsin, USA, was silenced just nine minutes later when Liverpool's Mohammed Salah scored the winner, sinking Salzburg to a 4-3 defeat.\n\nMarsch, the first American to ever coach in the Champions League, had no regrets, though, telling BeIN Sports after the game: \"The emotion I had in that moment and the pride I had in the way the team started out the second half is what led to that celebration.\n\n\"I think in years past they didn't give yellows, or punish, trainers for that. But I'm ok with taking a yellow there.\"\n\nRead more: A magical 'rainbow flick,' 2 goals, and a world class display: Robert Lewandowski shines as Bayern humiliates Tottenham\n\nOn the night at Anfield, Liverpool rushed to a 3-0 lead after just 36 minutes, thanks to goals from Sadio Mané, Andrew Robertson, and Mohamed Salah.\n\nRobertson's goal was particularly brilliant — the Scotland international started and finished a perfectly executed team move.\n\n—Football on BT Sport (@btsportfootball) October 2, 2019\n\nThough it looked like the home side had secured all three points, Marsch's Salzburg hit back in explosive fashion, scoring three goals of its own in just 21 minutes.\n\nHwang Hee-chan got the comeback rolling in the 39th minute, before Takumi Minamino added a second in the 56th.\n\nFour minutes later, Salzburg was level when substitute Erling Braut Haaland tapped in from close range for his 18th goal of the season — a goal which Marsch celebrated all too enthusiastically.\n\nMohamed Salah spared Liverpool's blushes, however, in the 69th minute, prodding home Roberto Firmino's flick-on.\n\nRead more: 2 teenage soccer stars who once played together as children could soon become the sport's biggest rivals since Lionel Messi and Cristiano Ronaldo\n\nLiverpool's win takes it into second place in Group E, ahead of Salzburg on goal difference, and behind leaders SSC Napoli.", "description": "Jesse Marsch sprinted down the touchline to celebrate Salzburg's equalizer against Liverpool, but was silenced just moments later by Mohammed Salah.", "authors": [], "top_image": "https://image.businessinsider.com/5d95b4d078c0cd1a422e66f4?width=1200&format=jpeg"}