{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/2019100210214/asia-markets-asian-markets-sink-amid-wall-street-losses-new-us-tariffs-against-eu", "downloaded_at": "2019-10-03 07:09:54.159633+00:00", "published_at": "2019-10-03", "title": "ASIA MARKETS: Asian Markets Sink Amid Wall Street Losses, New U.S. Tariffs Against EU", "language": "en", "text": "By Marketwatch and Associated Press\n\nStocks in Japan, Australia down about 2%\n\nAsian markets fell in early trading Thursday, following losses on Wall Street triggered by fresh worries about an economic slowdown.\n\nU.S. stocks are off to their worst start to a quarter since 2008 (link), as the Dow Jones Industrial Average has lost more than 800 points in the past two days. Data showing slower job creation and weaker manufacturing output are indicating that the Trump administration's trade war is taking a toll on the U.S. economy.\n\nGlobal markets were further uneased after the U.S. announced late Wednesday that it planned to slap tariffs as high as 25% on $7.5 billion of European imports (link), after the WTO ruled the EU improperly favored Airbus over Boeing in a long-running trans-Atlantic dispute.\n\n\"The dreary economic data does perhaps suggest that traders could be better sellers in this risk-toxic environment,\" Stephen Innes, Asia-Pacific market strategist at AxiTrader, said in a note.\n\nJapan's Nikkei dropped 2% and Hong Kong's Hang Seng Index slipped 0.6%. Australia's S&P/ASX 200 fell 1.9% and New Zealand's NZX 50 slid 1.2%, while benchmark indexes in Taiwan , Singapore , Malaysia and Indonesia all declined. Markets in mainland China and South Korea were closed for holidays.\n\nAmong individual stocks, SoftBank (9984.TO) , Fast Retailing (9983.TO) , Toyota (7203.TO) and Honda (7267.TO) all sank in Tokyo trading. Casino operator Galaxy Entertainment (0027.HK) rose in Hog Kong, while Wharf Real Estate (1997.HK) and CNOOC (0883.HK) declined. In Australia, Beach Energy (BPT.AU) , BHP (BHP.AU) and Westpac Banking (WBC.AU) all fell.\n\n(END) Dow Jones Newswires\n\nOctober 02, 2019 22:55 ET (02:55 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png"}