{"pub": "breitbart", "url": "https://breitbart.com/news/russian-court-blocks-major-lgbt-online-groups-2", "downloaded_at": "2019-10-05 06:11:52.157616+00:00", "title": "Russian court blocks major LGBT online groups", "language": "en", "text": "Moscow (AFP) – A Russian court has ruled that two popular LGBT networking sites be blocked for disseminating “anti-family values”, including a major online group with nearly 200,000 members.\n\nThe court in Saint Petersburg on Wednesday announced the decision against the groups on VK, a Russian platform similar to Facebook.\n\n“An inspection showed they contain information available to the public, including children, which negates family values, propagates non-traditional sexual relations and promotes disrespectful attitudes towards parents,” the court statement said.\n\nRussia in 2013 introduced a law against “gay propaganda”, which officially bans the “promotion of non-traditional lifestyles to minors” but in effect outlaws LGBT activism.\n\nOne of the groups mentioned in the court decision is called the Russian LGBT Community, which has more than 187,000 members.\n\nOne of its administrators, who asked to be identified only as Alex, said the group was created in 2017 and has provided crucial support to Russian LGBT people.\n\n“People get support from the community, advice from other members and help in difficult situations,” he told AFP.\n\n“If it’s blocked, LGBT people won’t have anything to lean on in Russia, no way to write anonymously, share their emotions or coming-outs.”\n\nThe other group, LGBT Russia, is overseen by the NGO Russian LGBT Network, which told AFP the decision was a complete surprise.\n\n“The court spends about five minutes blocking LGBT internet resources and the decisions have identical wording,” said the organisation’s spokeswoman, Svetlana Zakharova.\n\n“We don’t publish anything on our pages that needs to be marked ‘adults only’,” Zakharova said. “We talk about cases of discrimination and human rights violations and help anybody who needs it, including teenagers,” she said.\n\nZakharova said the NGO would appeal the ruling.\n\nHomophobia is widespread in Russia where reports of rights violations and attacks on LGBT people are common, though there are gay scenes in major cities.", "description": "Moscow (AFP) – A Russian court has ruled that two popular LGBT networking sites be blocked for disseminating “anti-family values”,", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/04/a8851a_russia-in-2013-introduced-law-gay-propaganda-officially-bans-promotion-640x335.jpg", "published_at": "2019-10-04"}