{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/16/impeachment-probe-state-official-testified-obama-admin-knew-ukraine-company-burisma-was-corrupt", "downloaded_at": "2019-10-16 23:16:17.450700+00:00", "title": "State Dept:: Obama Admin Knew Ukraine Company Burisma Was Corrupt", "language": "en", "text": "George Kent, a top U.S. State Department official, told lawmakers Tuesday he warned the Obama administration that the Ukrainian company that employed then-Vice President Joe Biden’s son was corrupt.\n\nKent’s comments came during his deposition in the House Democrats’ impeachment probe.\n\nNear the end of an article on his testimony, NBC News noted:\n\nDuring his nearly 10 hours of testimony, Kent also told members of Congress and their staff that Burisma, the energy company where Hunter Biden was a board member, was corrupt, according to a separate person who was present in the room. Kent said he told the Obama administration in 2016 that they should not hold an event with Burisma because of the company’s extensive corruption in Ukraine.\n\nRep. Gerry Connolly (D-VA), who spoke to reporters after witnessing Kent’s deposition, failed to mention the State official’s warnings about Burisma.\n\nIt appears that the warning came before or during Hunter’s tenure as the board member of Burisma, which began in 2014.\n\nIn the fateful July 25 call with Ukrainian President Volodymyr Zelensky, Trump urged his counterpart to investigate corruption allegations against Biden and his son Hunter.\n\nAs vice president, Biden pushed Ukraine to fire its top prosecutor in 2016, who was investigating the owner of Burisma, Mykola Zlochevsky.\n\nHunter had been serving on the board of Burisma at the time, prompting allegations of corruption.\n\nA “whistleblower” allegation that Trump attempted to pressure Ukraine into investigating the Bidens during the July 25 call triggered the impeachment probe. Trump and Ukraine have denied the allegations.\n\nKent also testified that he was ordered by a superior to “lay low” when he raised concerns about the activities in Ukraine of Trump’s private lawyer Rudy Giuliani, Connolly told reporters, according to NBC News.\n\nGiuliani traveled to Ukraine on behalf of Trump to lobby the government to investigate the corruption allegations against the Bidens.\n\nTrump’s private lawyer has maintained that he did nothing wrong in Ukraine. Combatting corruption in Ukraine is a component of U.S. policy.\n\nRep. Lee Zeldin (R-NY), who witnessed Kent’s deposition along with Connolly, blasted the House Democrat for leaking details of the testimony after they were told not to discuss it.\n\n“He was barely there, and he walks out and starts telling the public of what substantively happened behind closed doors,” Zeldin, a member of the House Foreign Affairs Committee, declared, referring to Connolly, the Washington Post reported. “This is a disgusting strategy that has been on display.”\n\nThe Democrat-led Committees on Oversight and Reform, Intelligence, and Foreign Affairs are pursuing the impeachment investigation. Connolly is a member of two of the panels.\n\nThe congressman said Kent testified that he was sidelined by White House chief of Staff Mick Mulvaney, who told him to leave Ukraine policy in the hands of three other Trump administration officials — Energy Secretary Rick Perry, European Amb. Gordon Sondland, and special envoy Kurt Volker who has resigned.\n\nConnolly said the trio called themselves the “three amigos” and pushed other State Department officials out of the way.\n\nThe Democrat congressman reportedly proclaimed:\n\nHere is a senior State Department official responsible for six countries, one of which is Ukraine, who found himself outside of a parallel process that he felt was undermining 28 years of U.S. policy and promoting the rule of law in Ukraine. And that was wrong. He used that word, ‘wrong.'”\n\nHouse Democrat leaders have refused to make the transcripts of the testimony by impeachment probe witnesses public, prompting criticism from Republicans. GOP lawmakers have accused Democrats of cherry-picking and mischaracterizing evidence. Republicans have asserted that the Democrats are leaking bits and pieces of testimony to fuel their impeachment agenda.\n\nEchoing the White House position, several Trump administration officials and Giuliani have opted not to cooperate with the impeachment probe, dismissing it as illegitimate.", "description": "Kent told lawmakers he warned the Obama administration the Ukrainian company that employed then-Vice President Joe Biden's son was corrupt.", "authors": ["Edwin Mora"], "top_image": "https://media.breitbart.com/media/2019/09/Joe-and-Hunter-Biden-with-Obama-640x335.jpg", "published_at": "2019-10-16"}