{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-eurozone-italy-breakupindicators-grap/graphic-quitaly-how-last-year-say-markets-idUKKBN1W81RX", "downloaded_at": "2019-09-23 17:40:33.056096+00:00", "title": "'Quitaly'? - How 'last year', say markets", "language": "en", "text": "LONDON (Reuters) - The risk of the euro zone breaking up, which preyed on investors’ minds in 2018, has fallen to the lowest level in over a year, market gauges show, as Italy’s new government allays fears of “Quitaly”, the possibility of Rome exiting the single currency bloc.\n\nFILE PHOTO: 50 Euro banknotes are displayed in this picture illustration taken November 14, 2017. REUTERS/Benoit Tessier/Illustration\n\nItalian bond yields have slid to record lows below 1%, galvanised by the formation of a new coalition government comprising the 5-Star Movement and the pro-European Democratic Party.\n\nWith the League - a party with a strong eurosceptic element - now out of government, the risk of Italy leaving the euro zone has tumbled.\n\n“All that matters ultimately for Italian government bonds is whether Italy leaves the euro (or the euro zone breaks up),” said Mike Riddell, head of UK fixed income at Allianz Global Investors.\n\n“The Italian government is arguably now the most market friendly in its history, and we therefore see a negligible risk of Italy wanting to leave the euro (or a euro zone breakup) over the next 12 months.”\n\nEuro break-up risk has been a key driver of Italian bonds in recent years, and the easing of such risks boosts the appeal of one of the few positive-yielding debt markets in the bloc.\n\nIndicators closely tracked by analysts support this view:\n\nDOLLAR\n\n1/ Take the performance of Italian bonds denominated in dollars versus those issued in euros.\n\nThe yield on a 15-year euro-denominated Italian bond, or BTP, hit a record low in early September IT15YT=RR, while the yield on a similar maturity bond denominated in dollars is near seven-week highs.\n\nItaly's \"dollar\" bonds underperform as \"Quitaly\" fears fade: here\n\nInvestors believe dollar bonds, governed by New York law, would offer stronger protection against debt restructuring, including currency redenomination, than the euro issues governed by Italian law.\n\nSo, whenever concern over Italy arises, dollar-denominated BTPs outperform their euro peers.\n\nThat happened after the 2016 Brexit vote in Britain, in 2017 when anti-euro far-right French presidential candidate Marine Le Pen surged in opinion polls ahead of elections, and last year when Italy’s government quarrelled with the EU over spending policy.\n\nWhile the dollar bonds’ recent underperformance is down partly to speculation of a new dollar issue, investors said the removal of “Quitaly” risks was crucial, especially as other indicators too suggest a reduced risk of Italy exiting the euro.\n\n2/ LINKERS\n\nFor most of last year, Italian bonds linked to local inflation performed better than those linked to euro zone inflation - the view was a return to the lira would result in significant currency devaluation, and subsequently, higher inflation.\n\nThese fears accelerated after the League proposed issuing short-term bills known as mini-BOTs to settle state arrears. These could become a parallel currency and represent a de facto step towards leaving the euro, markets believed.\n\nBut with the League no longer in power, the yield on an Italian bond maturing in 2023 and linked to euro zone inflation, IT532934= has fallen almost 90 bps since early August. A similar maturity bond linked to local inflation has seen yields slip 71 bps.\n\n“The key really is the fact that (Matteo) Salvini and the League are not involved and this has been a turning point for Italian politics,” said Mohammed Kazmi, a portfolio manager at UBP.\n\n“It has meant that investors have become more relaxed somewhat on fearing market unfriendly headlines whether that’s something negative on the euro or something very expansionary on fiscal policy.”\n\nItaly’s new finance minister, Roberto Gualtieri, has signaled that he wants to avoid a clash with the EU.\n\nItalian BTP linked to euro zone inflation outperforms as \"Quitaly\" fears fade: here\n\n3/ INSURANCE\n\nKazmi said the sharp fall in insurance that investors take out against a sovereign default and a tightening in the Italian/German bond yield gap perhaps offer the best evidence that investors are more relaxed about “Quitaly” and a euro breakup.\n\nItaly’s 10-year bond yield premia over Germany has tumbled almost 200 basis points from highs above 300 bps reached late last year DE10IT10=RR. Five-year credit default swaps earlier this month fell to their lowest since just before the May 2018 bond rout\n\nAll that, alongside new ECB asset purchase plans and sliding debt-servicing costs, are easing concerns about Italy’s credit rating outlook. Michele Napolitano, head of the western European sovereign ratings team at Fitch, said more detail on fiscal policy was needed before any improvement in the BBB rating - two notches above junk.\n\nBut he told a conference last week: “Any EU exit is off the table.”\n\nMarket indicators show \"Quitaly\" risk ebbing: here", "description": "The risk of the euro zone breaking up, which preyed on investors' minds in 2018, has fallen to the lowest level in over a year, market gauges show, as Italy's new government allays fears of \"Quitaly\", the possibility of Rome exiting the single currency bloc.", "authors": ["Dhara Ranasinghe", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190923&t=2&i=1432999084&w=1200&r=LYNXMPEF8M1DS", "published_at": "2019-09-23"}