{"pub": "yahoo", "url": "https://news.yahoo.com/uaw-contract-gm-expires-increasing-041639007.html", "downloaded_at": "2019-09-16 11:59:41.108072+00:00", "title": "Union votes to strike at General Motors' US plants", "language": "en", "text": "DETROIT (AP) — The United Auto Workers union announced Sunday that its roughly 49,000 workers at General Motors plants in the U.S. would go on strike just before midnight because contentious talks on a new contract had broken down.\n\nAbout 200 plant-level union leaders voted unanimously in favor of a walkout during a meeting Sunday morning in Detroit. Union leaders said the sides were still far apart on several major issues and they apparently weren't swayed by a GM offer to make new products at or near two of the four plants it had been planning to close, according to someone briefed on the matter.\n\n\"We stood up for General Motors when they needed us most,\" union Vice President Terry Dittes said in a statement, referring to union concessions that helped GM survive bankruptcy protection in 2009. \"Now we are standing together in unity and solidarity for our members.\"\n\nMembers of UAW Local 598 wave to passing cars honking in support on Van Slyke Road in front of the General Motors Flint Assembly plant in Flint, Michigan on Sunday, September 15, 2019. The United Auto Workers union announced Sunday that its workers at General Motors plants in the U.S. would go on strike just before midnight because contentious talks on a new contract had broken down. (Eric Seals/Star Tribune via AP) More\n\nIt's still possible that bargainers could return to the table and hammer out an agreement, but union spokesman Brian Rothenberg said at a news conference that it would be unlikely because it is hard to believe they could resolve so many issues before 11:59 p.m.\n\nGM on Friday offered to build a new all-electric pickup truck at a factory in Detroit that is slated to close next year, according someone who spoke to The Associated Press on the condition of anonymity because that person wasn't authorized to disclose details of the negotiations, which hadn't been released to the public. The automaker also offered to open an electric vehicle battery plant in Lordstown, Ohio, where it has a plant that has already stopped making cars. The new factory would be in addition to a proposal to make electric vehicles for a company called Workhorse, the person said.\n\nIt's unclear how many workers the two plants would employ. The closures, especially of the Ohio plant, have become issues in the 2020 presidential campaign. President Donald Trump has consistently criticized the company and demanded that Lordstown be reopened.\n\nThe UAW's Rothenberg said the company made general statements about why it is planning to strike, but he would not comment further on GM's offer. The union said it would strike for fair wages, affordable health care, profit sharing, job security and a path to permanent employment for temporary workers.\n\nFlint resident Dorrit Madison, who has worked at the plant for more than 11 years, shouts out at cars passing by as General Motors employees demonstrate outside of the Flint Assembly Plant on Sunday, Sept. 15, 2019 in Flint. GM autoworkers in Lansing officially go on strike at midnight Sunday after UAW leadership voted to do so Sunday morning. (Jake May/The Flint Journal via AP) More\n\nIn a statement, GM also said the offer made to the union on Saturday included more than $7 billion in U.S. factory investments and the creation of 5,400 new positions, a minority of which would be filled by existing employees. GM would not give a precise number. The investments would be made at factories in four states, two of which were not identified.\n\nThe statement also said the company offered \"best in class wages and benefits,\" improved profit sharing and a payment of $8,000 to each worker upon ratification. The offer included wage or lump sum increases in all four years of the deal, plus \"nationally leading\" health benefits.", "description": "The United Auto Workers union announced Sunday that its roughly 49,000 workers at General Motors plants in the U.S. would go on strike just before midnight because contentious talks on a new contract had broken down. About 200 plant-level union leaders voted unanimously in favor of a walkout during a", "authors": ["Tom Krisher"], "top_image": "https://s.yimg.com/uu/api/res/1.2/So43WVYaDRF83z.zPSGBaQ--~B/aD0xOTkyO3c9MTg4MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/e77c1f9eeb4686cab6f3a3765ef20386", "published_at": "2019-09-15"}