{"pub": "investing.com", "url": "https://in.investing.com/news/stock-market-news/uk-stocksfactors-to-watch-on-oct-8-2001123", "downloaded_at": "2019-10-08 06:37:21.297755+00:00", "title": "UK Stocks-Factors to watch on Oct. 8", "language": "en", "text": "UK Stocks-Factors to watch on Oct. 8\n\nStock Markets 1 hour ago (Oct 08, 2019 10:40)\n\n© Reuters. UK Stocks-Factors to watch on Oct. 8 Oct 8 (Reuters) - Britain's FTSE 100 index is seen opening up 17 points at 7,214 points on Tuesday, according to financial bookmakers. *LSE: Hong Kong's bourse on Tuesday scrapped its unsolicited $39 billion approach for the stock Exchange after failing to convince LSE management to back a move that could have transformed both global financial services giants. SMITH: Packaging firm Liqui-Box Corp on Monday agreed to sell its bag-in-box business to Peak Packaging to comply with requirements from Britain's competition watchdog over the U.S.-based company's takeover of DS Smith's plastics business. STOBART LOGISTICS: Eddie Stobart Logistics Plc said on Monda, DBAY Advisors Limited, its third-largest shareholder, has been granted more time to make a firm takeover offer for the haulage company, and that their talks are ongoing. prices slipped for a third straight session on Tuesday, pressured by a stronger dollar and an uptick in equities ahead of upcoming U.S.-China trade talks in Washington. Oil prices rose on Tuesday, buoyed by overnight gains in industrial commodities, while unrest in oil-producing countries Iraq and Ecuador raised concerns of supply disruption, adding to support. The UK blue-chip index closed up 0.6% on Monday fuelled by hopes of an end to the stand-off between the world's two largest economies, with U.S. President Donald Trump saying his administration had a \"very good chance\" of making a trade deal with China. UK CORPORATE DIARY: Physiomics PLC Full Year 2019 Earnings Release Plutus Powergen PLC Full Year 2019 Earnings Release easyJet plc Q4 2019 Pre-Close Trading Statement Release YouGov PLC Full Year 2019 Earnings Release Electrocomponents PLC Q2 2020 Trading Statement Release Stock Spirits Group PLC Pre-close Trading Statement Release * For more on the factors affecting European stocks, please click on: LIVE/ TODAY'S UK PAPERS > Financial Times PRESS/FT > Other business headlines PRESS/GB\n\nUK Stocks-Factors to watch on Oct. 8", "description": "UK Stocks-Factors to watch on Oct. 8", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEB2N09U_L.jpg", "published_at": "2019-10-08"}