{"pub": "bbc", "url": "https://bbc.com/news/world-middle-east-50195757", "downloaded_at": "2019-10-27 00:04:52.509347+00:00", "title": "Iraq protests: Fresh clashes leave five people dead", "language": "en", "text": "Media playback is unsupported on your device Media caption Protesters cover their faces to shield themselves from tear gas in Baghdad\n\nAt least five people have been killed in fresh clashes with security forces in Iraq as nationwide anti-government protests entered a second day.\n\nThree of the dead were reportedly hit by tear gas canisters fired by security forces in the capital Baghdad.\n\nAt least two more were killed when protesters tried to storm an official's home in the city of Nasiriya, reports say.\n\nThe unrest follows a day of protests that left dozens dead on Friday.\n\nProtesters are demanding more jobs, better public services and an end to corruption.\n\nSimilar protests earlier this month were brutally put down by security forces, leaving nearly 150 people dead.\n\nA government report has acknowledged that authorities used excessive force in quelling that unrest.\n\nViolence flared again on Saturday despite calls from protest leaders to pause the demonstrations to give the government time to respond to their demands.\n\nImage copyright Reuters Image caption Protesters gathered for a second day in Baghdad, where they clashed with security forces\n\nHundreds took to the streets of Baghdad and Iraq's southern provinces, with protesters chanting slogans against the government, demanding its resignation.\n\nPrime Minister Adel Abdul Mahdi has promised a cabinet reshuffle and a package of reforms to address protesters' demands, but many remain unconvinced.\n\n\"Our demands are very simple but they can't even give us that. This is our country,\" one protester told Reuters news agency on Saturday.\n\nWhat's the background?\n\nThe protests started in Baghdad on 1 October. Most of those taking part were young and unemployed.\n\nAfter security forces used live ammunition against demonstrators, the unrest escalated and spread to other cities and towns.\n\nA government committee tasked with investigating the violence said 149 civilians and eight security personnel had been killed in protests between 1 and 6 October.\n\nMedia playback is unsupported on your device Media caption Video from early October shows protesters fleeing from Iraqi security forces\n\nThe committee concluded that \"officers and commanders lost control over their forces during the protests\".\n\nThe government's handling of those protests in early October fuelled discontent with the Shia-led Iraqi government, which has been accused of corruption and stoking sectarian divides.\n\nA second phase of protests erupted on Friday, leading to the imposition of a curfew by the government.", "description": "Protests sweep the country again, a day after dozens of people died in clashes with security forces.", "authors": [], "top_image": "https://ichef.bbci.co.uk/images/ic/1024x576/p07s2h8v.jpg", "published_at": "2019-10-26"}