{"pub": "zdnet", "url": "https://www.zdnet.com/article/war-on-deepfakes-amazon-backs-microsoft-and-facebook-with-1m-in-cloud-credits", "downloaded_at": "2019-10-22 13:28:02.300685+00:00", "title": "War on deepfakes: Amazon backs Microsoft and Facebook with $1m in cloud credits", "language": "en", "text": "Deepfake tech is mainly being used for porn and women are the main victims Deepfakes pose a serious threat to democracy in the long run but women are likely to suffer first, a new study says.\n\nAWS has thrown its weight behind the upcoming Deepfake Detection Challenge, a competition with a $10m prize pool that Microsoft and Facebook announced in September.\n\nFacebook is helping create a large dataset of deepfake videos for the competition, which aims to unearth novel techniques to detect video that's been manipulated with AI and to develop systems to benchmark detection technologies.\n\nCloud giant AWS on Monday announced it will offer up to $1m in AWS credits over the next two years towards the challenge, which launches this December and runs through to the end of March 2020. The initiative is backed by Facebook, Microsoft, the Partnership on AI, and several universities, including MIT.\n\nThe initiative comes amid heightened concerns that deepfakes and, more generally, misinformation on social networks could be used to manipulate public opinion ahead of the US 2020 presidential election schedule for November.\n\nFacebook, for example, this week launched Facebook Protect to help candidates, elected officials and public-sector workers enable two-factor authentication for publishing Facebook Page information.\n\nIt's also recently suspended thousands of apps to avoid a repeat of the Cambridge Analytica scandal, which may have influenced the outcome of the 2016 US presidential election.\n\nParticipants in the Deepfake Detection Challenge will be given access to a dataset to train their models and then need to submit code to a 'black-box' environment for testing. And to do that, researchers are going to need access to compute power, storage and machine-learning tools that AWS has.\n\nAmazon says it will host the full competition dataset when it becomes available later this year. It's also providing Amazon machine-learning experts to help teams build their detection models.\n\n\"We want to ensure access to this data for a diverse set of participants with varied perspectives to help develop the best possible solutions to combat the growing problem of deepfakes,\" AWS said.\n\nDeepfakes are seen as dangerous in part because they don't require any skills to produce, thanks to smartphone apps that can do a good enough job to fool humans with fake video. In the short term, deepfakes could be used to sway public opinion, but over the long term deepfakes could erode trust in all information.\n\nThe project itself comes with certain risks. As the project notes in an FAQ, there is a risk that malicious actors try to exploit the dataset Facebook is creating as well as the code that participants create.\n\nAccording to AWS, the Deepfake Detection Challenge steering committee will share the first 5,000 videos of the dataset with researchers. There will be a \"targeted\" technical working session at the International Conference on Computer Vision (ICCV) in Seoul beginning on October 27, 2019.\n\nAfter conducting due diligence, it will release the full dataset and launch the Deepfake Detection Challenge at the world's primary AI conference – NeurIPS or the Conference on Neural Information Processing Systems – in December.\n\nGoogle hasn't backed the Deepfake Detection Challenge but it and Alphabet's Jigsaw have contributed a dataset of 3,000 manipulated videos with 28 actors to the FaceForensics benchmark, which aims to become an automated benchmark for facial-manipulation detection. FaceForensics forms part of the competition's initial 5,000 video dataset.\n\nMore on deepfakes and security\n\nThe lurking danger of deepfakes TechRepublic\n\nThese deepfakes of Bill Hader are absolutely terrifying CNET", "description": "AWS offers computing power to researchers in the Facebook-backed deepfake detection competition.", "authors": ["Liam Tung"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2019/09/06/b55671f6-a379-4864-a4ba-3495e4f3dd87/thumbnail/770x578/ef20e56d0627a353caf292a740e975f0/facebookdeepfakesept19.jpg", "published_at": "2019-10-22"}