{"pub": "investing.com", "url": "https://uk.investing.com/analysis/sterling-soars-european-stocks-lifted-by-brexit-deal-hopes-200433479", "downloaded_at": "2019-10-15 16:58:02.011760+00:00", "title": "Sterling Soars, European Stocks Lifted By Brexit Deal Hopes", "language": "en", "text": "Europe\n\nThe is underperforming its Continental counterparts as commodity, consumer as well as health care stocks are in red. Mining stocks like Rio Tinto (LON: ), BHP Billiton (LON: ) plus Anglo American (LON: ) are lower on the back of the poor Chinese PPI report. The reading showed that prices at the factory level declined by 1.2% - which suggests that demand is weak, hence why mineral extractors are down today.\n\nSterling has surged on the report that EU and UK trade negotiators are getting close to reaching a Brexit deal. The sharp move higher in the pound has hurt international stocks like GlaxoSmithKline (LON: ), AstraZeneca (LON: ), Reckitt Benckiser plus Diageo (LON: ), as they all derive a large portion of their revenue outside of the UK, so the firmer pound impacts their bottom lines. On the other hand, the optimism surrounding Brexit has boosted British banks in addition to homebuilders.\n\nThe slump in the global manufacturing sector has hurt Renishaw (LON: ). For over one year the US-China trade spat has been rumbling on, and the result has been a subdued manufacturing sector in China, as well as dreadful manufacturing reports from Germany as well as the US.\n\nconfirmed that a number of big orders from Asia were not repeated, which caused revenue to fall in excess of 19% in the first-quarter. Adjusted profit-before tax tumbled by 86%, hence why the stock took a beating today. The group reassured traders the balance sheet is ‘strong’ but the statement that trading is ‘challenging’ took precedence. The decline in the worldwide manufacturing sector looks as if it is going to get worse before it gets better, so Renishaw (LON: ) are likely to be in for more pain.\n\nThe accounting scandal that rocked Wirecard (LON: ) has resurfaced today as the Financial Times published the group’s accounting practices. There were concerns a number of dubious transactions took place at the company’s Singapore branch, which rattled investor confidence. Traders have seen too many accounting scandals over the years, so even the whiff that something in the accounts department isn’t accurate is enough to send traders running. If stakeholders can’t be confident in a group’s published figures, it raises major concerns about it long-term prospects.\n\nBellway (LON: ) shares are in the red today after it cautioned about higher costs in addition to a slowdown in the house price growth. During a housing boom, the growth in property prices usually exceeds the growth in costs, but when the market comes off the boil, house prices grow at a slower pace, but costs gallop ahead. Bellway cautioned about ‘continued upward pressure’ in building costs. At the same time, the house builder predicts the number of houses sold in London on a proportional basis will fall. Profit before tax and revenue increased by 3.4% and 8.6% respectively, but it seems the boom times are over for Bellway.\n\nUS\n\nTraders have shrugged off the IMF downgrade to global, Chinese plus and US growth, as traders are still a little optimistic about the US-China trade situation.\n\nThis morning, Beijing confirmed the US statement about a partial deal being stuck was accurate, which has added to the bullish move. Reporting season has gotten underway, and the updates have been largely positive, which is a factor in the upward move too.\n\nJPMorgan (NYSE: ) was the first of the major banks to publish its . Adjusted EPS was $2.68 which was comfortably above the $2.44 forecast. Revenue and fixed income, currency and commodity trading revenue was $30.06 billion and $3.56 billion respectively, while the consensus was $28.49 billion and $3.09 billion respectively. In terms of investment banking fees, the bank had a record third-quarter which underlines the general Wall Street desire to derive more money for advisory work rather than trading. The stock is fractionally higher today despite the impressive numbers, which suggests that traders aren’t overly bullish on banks.\n\n(NYSE: ) revealed a broadly disappointing set of numbers. Net income on an annual basis dropped by 23%. Adjusted EPS was $1.07, but the consensus estimate was $1.15. Revenue for the three month period was $22.01 billion, marginally above forecasts. The bank is a major player in the US mortgage market, so the decline in net interest margin (NIM) to 2.66% from 2.94% in the same quarter last year is concerning. Given the Fed have cut interest rates twice in the past four months, the NIM metric is likely to remain under pressure in the medium-term.\n\nFX\n\nhas rallied on the report that EU-UK negotiations are getting close to a Bexit deal. There are no guarantees that anything will come out of this as the DUP might pour cold on whatever the proposal is, but for now, dealers are snapping up sterling. The pound hit its highest level against the US dollar since May, and if the bullish run continues it might target the 1.2900 area.\n\nis only slightly higher despite the broad decline in the . It suggests the single currency is weak when it can’t make decent headway against the dollar on a day like this.\n\nCommodities\n\nis in the red as traders are in risk-on mode. The broad push higher in European as well as US stocks has prompted traders to drop safe-haven assets like gold. Recently, gold has had a strong inverse relationship with the greenback, so today’s bearish move when the dollar is soft, could point to further losses.\n\nis subdued today on the back of the poor data. The IMF downgraded global growth to 3%, from the 3.2% forecast in July, which added to the downbeat sentiment. Demand for the energy is likely to be low should the likes of China, Germany plus the US cool down economically.\n\nDISCLAIMER: CMC Markets is an execution only provider. The material (whether or not it states any opinions) is for general information purposes only, and does not take into account your personal circumstances or objectives. Nothing in this material is (or should be considered to be) financial, investment or other advice on which reliance should be placed.\n\nNo opinion given in the material constitutes a recommendation by CMC Markets or the author that any particular investment, security, transaction or investment strategy is suitable for any specific person.\n\nOriginal Post", "description": "Market Overview Analysis by CMC Markets (David Madden) covering: EUR/USD, GBP/USD, FTSE 100, XAU/USD. Read CMC Markets (David Madden)'s latest article on Investing.com UK.", "authors": [], "top_image": "https://uk.investing.com/analysis/not found", "published_at": "2019-10-15"}