{"pub": "atlantic", "url": "https://theatlantic.com/technology/archive/2019/10/how-monocle-became-joke/599914", "downloaded_at": "2019-10-13 11:34:24.208578+00:00", "title": "Monocles Were Never Cool", "language": "en", "text": "Read: The New York Times resurrects the monocle, a century after trashing it\n\nJoseph Chamberlain wore one. So did Woodrow Wilson and Otto von Bismarck. Joseph Conrad had one, as did Yeats and Auden. The villainous Penguin fights the Batman wearing a monocle. The Monopoly Man, Rich Uncle Pennybags, ought to have one but doesn’t. But the plutocratic legume Mr. Peanut is never seen without his, nor is Eustace Tilley, The New Yorker’s cartoon mascot.\n\nThis little glass disk designed as corrective eyewear wound up as a comic prop, a universal metonym for wealth and snobbery. Monocles were briefly stylish at first. But they were never cool.\n\nThe magnifying properties of glass have been in use for millennia, and wearable since at least the Middle Ages. The first spectacles appeared in Europe in the late 13th century. By the early 17th, Galileo had his telescope. The sextant sailors used in the 18th century for celestial navigation had a telescopic attachment (which gave Popeye the Sailor his characteristic squint). Around the same time, a single lens on a little stick appeared, called a quizzing-glass.\n\nRead: Galileo fought dirty with his fellow scientists\n\nThe monocle followed. It was fixed in the eye socket and held in place hands-free, wedged behind the loose skin around the eye thanks to the orbicularis oculi, the muscle that closes the eyelid. Its advent is usually associated with Philipp von Stosch, an 18th-century German baron, who in his time was better known for writing the definitive work on carved gemstones and living an active, open life as a homosexual. Notwithstanding, popularizing the monocle became his lasting legacy. By the end of the century, it was in use all over German-speaking countries. It jumped to London around the turn of the 19th century, where it took hold among the aristocracy.\n\nThis period, the Regency era, was ground zero for British dandyism. Men cared how they dressed. Attire became a language of status. Older aristocrats wore monocles; younger and poorer men copied them. They were explosively popular, and why not? In its brief heyday the monocle was an attractive little object, round or octagonal, rimmed with silver or gold or horn, fixed to one’s coat by a silken ribbon. It was even useful for looking at things.\n\nBut by the middle of the century, monocles had already become a comic staple. Cartoons of the period show caricatures of self-regarding young fops posing and preening with their monocles on full display. In Little Dorrit, Charles Dickens lampooned a character unable to hold one, because he “had such flat orbits to his eyes and such limp little eyelids that it wouldn’t stick in when he put it up, but kept tumbling out against his waistcoat buttons.”\n\nBy the start of the 20th century, the monocle gag was already tired. In 1925, The New Yorker put a monocle on its mascot—the guy in the high collar looking at a butterfly, created for the magazine’s inaugural cover. The joke (which doesn’t land as well today as it used to) is that the overrefined urbanite preens in curious contemplation of the butterfly, his affectation thrown into relief by nature’s unpretentious beauty. New Yorker readers were supposed to see that this guy is a poser, making them feel like the real sophisticates.", "description": "Unlike other trappings of the aristocracy, the monocle has mostly been a joke since its invention. An Object Lesson.", "authors": ["Austin Grossman"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/RTS1F6AF/facebook.jpg?1570830218", "published_at": "2019-10-13"}