{"pub": "businessinsider", "url": "https://businessinsider.com/vinicius-jr-is-the-worlds-best-youngster-says-dani-alves-2019-9", "downloaded_at": "2019-09-26 14:55:20.550436+00:00", "title": "Dani Alves says a 19-year-old Brazilian is the most talented young soccer player in the world, and his latest wonder goal for Real Madrid proves why", "language": "en", "text": "Dani Alves says Real Madrid's Vinicius Junior is the best young player in world soccer.\n\nThe 19-year-old scored a wonderful goal on Wednesday night, bending the ball into the top corner from outside the box, as Madrid beat CA Osasuna 2-0 at the Santiago Bernabeu.\n\n\"There are some players that are born with the talent and for sure he is one of them.\" Alves told Business Insider. \"I'm positive we will see and hear a lot more about him soon.\"\n\nMadrid's rivals and Alves' former side, FC Barcelona, have had a difficult start to the new season in the absence of Lionel Messi, winning just three of seven games.\n\nBut Alves believes Barça can find a Vinicius Jr. of its own to cope with Messi's absence in the long run, saying: \"I believe that in football we will always discover new talents.\"\n\nRead more of our soccer stories here.\n\nVisit Business Insider's homepage for more stories.\n\nDani Alves says Real Madrid's Vinicius Junior is the best young player in world soccer.\n\nAnd on Wednesday night, the 19-year-old scored a goal that did very little to disprove his compatriot's claim.\n\nPlaying against CA Osasuna in front of approximately 80,000 fans at the Santiago Bernabeu, Vinicius produced a moment of magic in the 36th minute to give Zinedine Zidane's side a well deserved lead.\n\nAfter receiving the ball on the edge of the box from Toni Kroos' pass, the Brazilian teenager took one touch before taking aim and bending the ball beautifully into the top corner, past goalkeeper Ruben Martinez.\n\nThe Brazilian then fell to the floor, appearing to break down in tears after scoring what was his first goal of the new season.\n\nThe goal, only his fifth ever in the famous white strip of Real Madrid, was just a glimpse of Vinicius' talent, something his countryman Dani Alves has been fortunate enough to witness first hand — talent he believes makes him the most promising youngster in world soccer.\n\n\"I would have to say Vinicius Junior from Real Madrid.\" Alves told Business Insider when asked who we thinks is the biggest young talent in the sport at the moment.\n\n\"There are some players that are born with the talent and for sure he is one of them. I had the chance to watch him play closely, with the Brazil national team – I'm positive we will see and hear a lot more about him soon.\"\n\nRead more: Dani Alves says Neymar's 'happiness is in Barcelona,' and he thinks his former teammate should leave PSG and return to Camp Nou\n\nAlves' former side and Real Madrid's rivals, FC Barcelona, has endured a difficult start to the new season, winning just three of its seven games in all competitions so far this term.\n\nManager Ernesto Valverde has had to make do without star man Lionel Messi for most of those games after the Argentine suffered an injury during pre-season, and will have to do so again in the coming weeks after he again succumbed to injury against Villarreal on Tuesday.\n\nMessi has been a huge miss for Barcelona, and his absence has been a worrying sign as to how the Spanish club may fare after the 32-year-old either retires or leaves the club.\n\nRead more: The 12 highest-paid soccer players in the world\n\nHowever Alves, who recently partnered with The Players' Tribune to document his glistening career at Barcelona, believes his former side will find a replacement for its talismanic star, similar to the way Real Madrid have done so with Vinicius in the aftermath of Cristiano Ronaldo's departure.\n\n\"I believe that in football we will always discover new talents.\" the veteran defender said. \"In this club before Messi, you had Ronaldinho, before Ronaldinho you had other great players.\n\n\"You're always going to have someone who will be better, but I still believe that it will be very hard to measure up to a player like Messi. Players like Messi are very hard to come around, but we can't forget that as football evolves, players do as well.\"", "description": "Vinicius Jr, who scored a wonderful goal as Real Madrid won 2-0 on Wednesday, is the most talented youngster in the world according to Dani Alves.", "authors": [], "top_image": "https://image.businessinsider.com/5d8c93362e22af52a74b73a9?width=1200&format=jpeg", "published_at": "2019-09-26"}