{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/8/nba-bowing-to-china-reminds-democrats-why-america-", "downloaded_at": "2019-10-09 00:38:20.810461+00:00", "title": "NBA bowing to China reminds Democrats why America is great", "language": "en", "text": "ANALYSIS/OPINION:\n\n“We have never been more divided than we are now,” seems to be the go-to, above-it-all line from the left since the election of President Trump, but occasionally, we find windows where we find common ground. The NBA provided that the other night by bowing down to its cash cow emperor, China.\n\nThe controversy started when Houston Rockets General Manager Daryl Morey tweeted an image in support of Hong Kong protesters that read, “Fight for Freedom. Stand with Hong Kong.” No freedom-loving American would have thought much about that — after all, the principles of our democratic republic include freedom of speech and the ability to freely elect our leaders.\n\nWhat Americans wouldn’t stand side-by-side with the Hong Kong protesters, who, at times, seem even more patriotic than us, singing our national anthem and holding our flag as a sign of the freedoms that they desire?\n\nThe answer to that question is simple: The National Basketball Association. The NBA quickly made Mr. Morey retract his statement and posted their own, which I won’t quote here, because it’s a waste of everyone’s time. The summary of the retractions was: CHINA IS AMAZING AND THE BEST PLACE ON EARTH WITH ALL THE FREEDOM. (I wrote that in all caps and bold so you could detect the heavy sarcasm. Also, if the Chinese censors are lazy, they may just read that and suddenly allow The Washington Times to have distribution throughout their land. You’re welcome, editors.)\n\nYou’d think that it would be rare for an American company to sell out in order to cash in in China, but the NBA’s ridiculous actions make it just the latest in a long line of huge American companies that have been forgoing freedom of speech in order to kowtow to the restrictions of the Chinese government.\n\nBefore the NBA, the biggest public company to do so was Disney, which had to essentially kill off Winnie the Pooh in that country because of online memes comparing China’s President Xi Jinping to him. Almost as if they were predicting the future, this exact topic was covered in last week’s episode of “South Park,” which showed a main character (Randy Marsh) brutally killing Winnie on order to save Disney’s presence in the country and gain access for his own. The episode went on to be critical of Disney’s story writing, showing that the company literally sits in a room with the Chinese government; letting them make calls on what can and can’t be in their own creations in order to be allowed access in their country.\n\nThis brings up a much more interesting point to me. Have you ever noticed how American companies will “take a stand” against Republican-led states with conservative policies before they will “take a stand” against countries that actually have human rights violations, are undeniably destroying the environment, who treat women like property and who outlaw homosexuality?\n\nAlthough it’s great that congressional Democrats, including Chuck Schumer and Ron Wyden, are now standing against the NBA for bowing to China on this issue, where are they on human rights issues in, say, Saudi Arabia? And where Hollywood progressives are quick to condemn and threaten not to work in the state of Georgia because of their new anti-abortion laws, they’re happy to curb their own creativity by writing films and television shows specifically designed to get a thumbs up by the authoritarian Communist regime in China.\n\nSure, the NBA wants to make money; we all do, but at what expense? The NBA is clearly willing to sacrifice the First Amendment rights of players, coaches, management and officials to speak against a country known for suppressing free speech and much worse. That’s so incredibly un-American that it actually makes me feel a bit appreciative that we live in a country where NFL players are free to kneel for the national anthem and not live in fear of being locked in jail.\n\nWhat the NBA did, and continues to do by silencing free speech against China for the almighty dollar is wrong. And oddly at the end of the day, it briefly unified both Democrats and Republicans alike under the banner of American nationalism.\n\nYou see, as much as the left pushes the idea that believing that America is the best country in the world is somehow wrong, when faced with another nation silencing our businesses’ speech and freedoms, they realize just how great we are — and that we shouldn’t stand for another country telling us what to do.\n\nPS: If the left is outraged about China’s influence on the NBA and Disney, just wait until they find about that time Hunter Biden flew on Air Force Two to China with his father, who was vice president at the time, and two weeks later magically had a $1.5 billion deal with the Chinese national bank.\n\n• Tim Young is a political comedian and author of “I Hate Democrats/I Hate Republicans” (Post Hill Press).\n\nSign up for Daily Opinion Newsletter Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The NBA's ridiculous actions make it just the latest in a long line of huge American companies that have been forgoing freedom of speech in order to kowtow to the restrictions of the Chinese government.", "authors": ["The Washington Times Http", "Tim Young"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/08/B1-YOUN-Money-Shoe-_c0-125-935-670_s1770x1032.jpg?2450835d26d98000193fdb92fb584bad55bbb7d2", "published_at": "2019-10-08"}