{"pub": "afr", "url": "https://afr.com/markets/equity-markets/seven-questions-with-charlie-lanchester-20191014-p530ca", "downloaded_at": "2019-10-14 23:23:26.965284+00:00", "title": "Seven questions with Charlie Lanchester", "language": "en", "text": "What's gone right for you this year, and what's gone wrong?\n\nThe fund is up around 21 per cent this calendar year. Healthcare, property and some tech have done well for us although, as always, it is very stock specific. It has not all gone right and we have unfortunately owned one of the worst performing tech stocks as well.\n\nDo you think ASX-listed businesses are growing in complexity, and do you agree this is probably a bad thing?\n\nI don't think that companies are becoming more complex per se. It does seem that we are again (think 1999) in the grips of a technology bubble with many companies valued in the billions with little or no earnings. Unlike 1999, I do think that some of these companies will justify these valuations in time.\n\nHowever, given our relatively limited pool of established technology companies, valuations are inflated right now. E-commerce and disruptive business models do mean that the old days of cosy oligopolies in Australia are coming to an end. This takes time, but many of the largest and oldest companies that have done so well over the last 30 years may well struggle in the next 30. We are scouring the market for the companies that will replace them.\n\nWhere's your favourite surf break these days? Is it a hidden gem?\n\nNot wanting to give away too many local secrets, I recently travelled to North West, Western Australia and surfed a break at a place called Gnaraloo. It is one of the best left handers in the world and an incredible place to visit.\n\nWe're always looking for new TV shows to stream. What's caught your eye?\n\nAdvertisement\n\nGiven my English heritage, I am a big fan of the Peaky Blinders on Netflix. There is a new series just out.\n\nFinally, a recommendation for the readers on a good value quick bite in Sydney.\n\nClove Lane in North Randwick is an absolute cracker.", "description": "AFR Markets Live talks to BlackRock's Charlie Lanchester about the tech bubble and tired oligopolies, and one of the best surf breaks in WA.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.5484%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_1024%2C$y_140/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/65789ca0ab64e5980a9a428089c5f99b0b7b8bee", "published_at": "2019-10-14"}