{"pub": "yahoo", "url": "https://news.yahoo.com/trudeau-says-doesnt-know-more-025130310.html", "downloaded_at": "2019-09-20 08:18:56.190492+00:00", "title": "Trudeau says he doesn't know if there will be more blackface photos of him because he didn't remember doing it before the photos came out", "language": "en", "text": "Wayback Machine/West Point Grey Academy\n\n\n\n\n\nCanadian Prime Minister Justin Trudeau apologized again on Thursday for photos that have recently surfaced showing him in blackface.\n\nPhotos and videos show Trudeau in offensive makeup on at least three occasions dating back from the early 1990s.\n\nIn his second apology, Trudeau said he his actions were \"unacceptable\" and a \"terrible mistake.\"\n\nTrudeau said he was unsure if more photos of him would come to light, and said he had \"not remembered\" the pictures that were released on Wednesday.\n\nVisit Business Insider's homepage for more stories.\n\nCanadian Prime Minister Justin Trudeau made a second apology in 24 hours for several photos that have recently surfaced showing him in blackface.\n\nA photo of Trudeau, then 29, in blackface and wearing a turban during an \"Arabian Nights\" themed party at the private West Point Grey Academy where he taught in 2001, was uncovered by Time on Wednesday. Other photos and a video obtained by Global News Canada of Trudeau in blackface have also come to light.\n\nTrudeau on Wednesday apologized for the offensive costume, and said he \"should have known better.\"\n\nOn Thursday, Trudeau offered up another apology during a press conference and said donning blackface \"is always unacceptable.\"\n\n\"Darkening your face, regardless of the context or the circumstances, is always unacceptable because of the racist history of blackface,\" he told reporters. \"I should have understood that then and I never should have done it.\"\n\nRead more: 13 photos that threatened to derail political careers — from Canadian Prime Minister Justin Trudeau to presidential candidate Gary Hart\n\nCanadian Prime Minister and Liberal Party leader Justin Trudeau makes a statement in regards to a photo coming to light of himself from 2001, wearing More\n\nAssociated Press\n\nIn response to a question about whether Trudeau remembered any other instances that may come to light, he said he had \"not remembered\" the recent pictures that were released on Wednesday.\n\n\"I am wary of being definitive about [the number of instances] because the recent pictures that came out I had not remembered,\" he said.\n\n\"And I think the question is, 'how can you not remember that'? The fact is, I didn't understand how hurtful this is to people who live with discrimination every day.\"\n\nHe added that the incident was a \"terrible mistake\" and hoped he would be forgiven by people who considered him an ally.\n\n\"This has been personally a moment where I've had to reflect on the fact that wanting to do good and wanting to do better simply isn't good enough,\" he said.\n\n\"And you need to take responsibility for mistakes that hurt people who thought I was an ally — who hopefully, many of them still consider me an ally even though this was a terrible mistake.\"\n\nCanadian politicians have criticized Trudeau over the photos, and have called the act \"insulting.\" The incident comes at a time when Canada is in the middle of an election campaign and Trudeau is fighting for a second term.\n\nNOW WATCH: Why the US border facilities are 'concentration camps,' according to historians", "description": "Photos and videos surfaced this week showing Canadian Prime Minister Justin Trudeau in offensive makeup on three occasions in the 1990s and 2000s.", "authors": ["Rosie Perper"], "top_image": "https://s.yimg.com/uu/api/res/1.2/A6clRuXj10nstQlufJ2Veg--~B/aD0xMTIzO3c9MjI0NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/business_insider_articles_888/2e2be1ee5b94bbe0fecaf2687292e7f4", "published_at": "2019-09-20"}