{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/23/WS5dafb201a310cf3e3557207e.html", "downloaded_at": "2019-10-23 08:52:41.827457+00:00", "title": "Gains from upgraded Russia ties in store", "language": "en", "text": "By Ren Qi in Moscow | China Daily | Updated: 2019-10-23 09:50\n\n[Photo/IC]\n\nEnvoy outlines cooperation covering political, trade and strategic spheres\n\nBilateral trade between China and Russia has witnessed steady growth this year and the two countries will continue to maintain close ties under the upgraded relations that have launched into for a new era, said Zhang Hanhui, China's ambassador to Russia.\n\nZhang made the remarks during an interview with Chinese and Russian media on Friday in Moscow.\n\nThe most important result of Chinese President Xi Jinping's visit to Russia and his meeting with Russian counterpart Vladimir Putin in St. Petersburg in June was the leaders' joint announcement of an upgrading in the bilateral relationship to that of a comprehensive strategic partnership of coordination for a new era, Zhang said.\n\nThe upgraded relations enable the partners to continue to support each other in their efforts to defend core interests and nurture a strong degree of political and strategic mutual trust, said Zhang, adding that they will actively push forward their efforts for all-around cooperation amid a deepening in the convergence of their national interests.\n\nZhang noted that the Sino-Russian relationship for a new era could be understood from three perspectives. First, both countries are facing the biggest changes and challenges in a century, and they should work together to find solutions.\n\nSecond, they have entered a new era in their own development stages. And Russia is strongly defending its national dignity and has played an important role on the international stage, Zhang said. On China's part, it has made tremendous gains under its reform and opening-up policy against the backdrop of its overall achievements since the founding of the People's Republic of China 70 years ago.\n\nGlobal uncertainties\n\nLast but not least, Zhang said, China and Russia in the face of global uncertainties should strengthen political mutual trust and practical cooperation for the new era and jointly maintain world peace and the strategic balance.\n\nZhang highlighted the strong growth in bilateral trade logged this year. Figures from China's General Administration of Customs show a gain of 3.7 percent year-on-year for January to September to $80.13 billion. In September, trade between the two countries amounted to $9.47 billion.\n\nZhang said the two countries have agreed to promote growth in bilateral trade with the goal of reaching $200 billion by 2024. The target was set during Xi's June visit to Russia. In 2018, trade between them increased 27.1 percent in annual terms to more than $107 billion.\n\nZhang stressed the importance of high-tech innovations in maximizing the gains from economic cooperation.\n\nHe said Beijing and Moscow plan to develop a joint program for a business incubator in the field of innovative technologies.\n\n\"Our leaders have already announced that the next two years will be dedicated to joint innovations,\" he said.\n\n\"We have already set up a joint innovation fund that will help those willing to work in that field. We can identify leading joint projects and then implement them. Of course, the creation of the joint business incubator is also very important.\"\n\nThe ambassador, noting Russia's experience in this field, said he plans to visit Skolkovo, a high-tech park in western Moscow that is dubbed Russia's Silicon Valley.\n\n\"I think we can find common ground and define future areas of joint work,\" he said.\n\nChina also has plenty of experience with the many incubator programs in the country's south, Zhang said, adding that the partners' knowledge and experience can be pooled for successful outcomes.\n\n\"Our common future depends on these prospects,\" Zhang said.", "description": "Bilateral trade between China and Russia has witnessed steady growth this year and the two countries will continue to maintain close ties under the upgraded relations that have launched into for a new era, said Zhang Hanhui, China's ambassador to Russia.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/23/5dafb201a310cf3e97a288f0.jpeg", "published_at": "2019-10-23"}