{"pub": "news24", "url": "https://news24.com/Africa/Zimbabwe/millennials-eke-out-a-living-in-informal-sector-as-zimbabwes-economy-founders-20190925", "downloaded_at": "2019-10-05 11:22:44.150974+00:00", "title": "Millennials eke out a living in informal sector as Zimbabwe's economy founders", "language": "en", "text": "A minibus tout is reflected in the vehicle's window as a passenger sits waiting to leave in Harare, Zimbabwe. (August 2, 2018) (Marco Longari/AFP)\n\nHarare – Tafadzwa Chirimumimba jogs with the ease of an athlete as he waves down a slow-moving bus on the Julius Nyerere road in Zimbabwe's capital city.\n\nThe bus pulls over. Chirimumimba, energetic despite the scorching midday sun, chats with the driver while gesturing to a small group of people waiting by the side of the road – prospective passengers who the enterprising 28-year-old has rounded up in advance, hoping to collect a modest gratuity from a bus driver for his efforts.\n\nChirimumimba collects his tip, then flags down a car, hoping to broker a deal where he can collect a small fee in exchange for scrounging up a passenger travelling in the same direction. In Harare, Chirimumimba is known as a \"tout\" – an unemployed youth eking out a living as a middleman between passengers and drivers.\n\n\"I get varying amounts from the motorists depending on the person,\" he tells Al Jazeera. \"On average, I take home around 40 Zimbabwean dollars daily.\"\n\nZimbabwe's currency has been under intense downward pressure over the past two weeks. As of Monday, 40 Zimbabwean dollars or \"Zimdollars\" were worth around $2.75 at interbank exchange rates, and $2.66 at black market rates in Harare.\n\nBut for Chirimumimba and countless other youths in Zimbabwe, informal, unregulated work is the only option in an economy beset by eye-watering inflation, stagnant wages and shortages of food and other essential commodities.\n\nEconomy moving in reverse\n\nWhen Chirimumimba finished high school in 2007, the country's currency was under siege, and the economy was in freefall.\n\nAfter his father died in 2008 – the year Zimbabwe's currency collapsed – he started working in the informal, unregulated economy to help provide for his mother and three younger siblings.\n\n\"I could not find a job and my family needed a breadwinner after my father's death,\" says Chirimumimba. \"At least now I can survive and provide for my family with the little I earn on the street.\"\n\nThat living can be perilous. It's not uncommon for touts to be struck by motorists while hustling. And because touting is illegal in Zimbabwe, the threat of arrest is constant.\n\nChirimumimba says he has looked for other work, but to no avail. \"It's the only job I know and have,\" he says. \"[There] are no jobs in the country.\"\n\nZimbabwe's official unemployment rate is notoriously tough to pin down. But youths aged 18-34 are estimated to account for some 60% of the country's unemployed, according to the Labour and Economic Development Research Institute of Zimbabwe (LEDRIZ).\n\n\"There is very little chance for young people to get a job,\" says LEDRIZ founder, Godfrey Kanyenze.\n\n\"The country's economy is going through a structural regression where it is basically deindustrialising.\"\n\nThe regression can be traced to 2000, when Zimbabwe began its controversial seizure of white-owned farms for redistribution to landless black citizens under the late president Robert Mugabe.\n\nAt its peak in 1992, the country's manufacturing sector accounted for just over a quarter of its economic output. By 2002, following the land seizures, manufacturing collapsed to less than 10% of the country's total output – and remained below 12% from 2009 to 2014. Today, only around half of the country's manufacturing capacity is utilised.\n\n\"In a normal formal economy, labour should be moving from low-productive and low-income sectors, such as agriculture, to high-productive and high-income sectors such as manufacturing and other industries,\" Kanyenze, a labour economist, tells Al Jazeera. \"But it's vice versa in this country. Labour is actually going back to agriculture and other low-income sectors of the economy.\"\n\nAs manufacturing has ebbed, informal work has swelled. Of the 1.5 million people in paid employment in Zimbabwe, LIDREZ estimates 1.4 million work in the informal economy.\n\nFor the country's youths, it's especially bleak, with a staggering 96% of them believed to hold informal jobs.\n\nSome youths are so discouraged by the lack of prospects in the formal economy that they choose to bypass it altogether.\n\nKnowledge Mudzamiri is a 31-year-old informal book vendor in Harare.\n\n\"I left school in 2001 and I just never looked for a job,\" he told Al Jazeera. \"I passed my O-levels [secondary school exams], but this is the time when the economy was worsening. Teachers, nurses, doctors and all those professionals were earning peanuts for years, and I decided to earn money through selling books.\"\n\nSome youths, if given the chance, simply give up on Zimbabwe altogether.\n\n\"In the Matabeleland provinces, once young people reach adolescence, they skip the border into South Africa,\" Kenyanze said.\"For those born in 2000 and [who] are 19 years old now, there is no opportunity,\" he adds.\n\nFoundering economy feeds political unrest\n\nKanyenze argues that the lack of professional opportunities is driving social unrest, which has grown this year as the economy has foundered yet again – this time following a June decision to outlaw the use of foreign currencies that had helped stabilise the economy after the Zimbabwean dollar collapsed in 2009.\n\n\"Without a job, all dreams are dead,\" Kanyenze explains. \"That means one can't buy a car, a house and marry. Marriage is now a luxury. It's so expensive to pay a dowry for a wife.\"\n\nInflation in Zimbabwe hit 200% this June, and where it is now is anyone's guess. The government of President Emmerson Mnangagwa has suspended the publication of new figures until February of next year.\n\nThe government has also cracked down on protests against its stewardship of the economy that have been organised by the opposition Movement for Democratic Change (MDC) Alliance.\n\n\"If you look at the age profile of demonstrators, it is mainly young people,\" says Kanyenze.\n\nChirimumimba expressed his growing impatience with the status quo. \"Maybe there is a need to change the current government,\" he said. \" I think when that happens, things will genuinely change.\"", "description": "A chronic shortage of professional opportunities drives Zimbabwe's youth to informal work and feeds social unrest.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9396/86b1e2f6cb814c8f9cb15cf02c687e51.jpg", "published_at": "2019-09-25"}