{"pub": "vice", "url": "https://vice.com/en_us/article/bjw3q5/this-silicon-valley-startup-is-dedicated-to-detecting-ufos-off-the-california-cost", "downloaded_at": "2019-10-23 16:37:15.516964+00:00", "title": "This Silicon Valley Startup Is Dedicated to Detecting UFOs Off the California Coast", "language": "en", "text": "With this summer’s revelation that the US Navy considers UFOs and “Unidentified Aerial Phenomena” (UAPs) to be real, a team of venture capitalists, university professors, and military veterans are launching a project to track UFOs off the coast of California.\n\nUAP eXpeditions is a non-profit group based in Oregon that will “field a top-notch group of uber-experienced professionals providing the public service of field testing new UAP related technologies.” With some of the Silicon Valley UFO Hunters, UAP eXpeditions will pioneer the ability to predict, find, observe, and document UAP for study and analysis. They will use “classical observation techniques, by trained observers and scientists, while using the latest experimental technologies—in the right places and the right times,” Kevin Day, the group’s founder and CEO, wrote in a Facebook post viewed by Motherboard.\n\nDay, who has appeared on the History Channel’s Unidentified: Inside America’s UFO Investigation and Discovery Channel’s Contact, is a retired U.S. Navy Chief Petty Officer and radar operator. Day served in the Nimitz Carrier Strike Group on the USS Princeton during the 2004 infamous “Nimitz UFO Incident” which was reported by The New York Times in December of 2017.\n\nHe recalls tracking the infamous “Tic Tac” UFOs for several days around Catalina Island off the coast of California using the USS Princeton’s advanced radar system. Now, he believes that these objects continue to operate along the same trajectory and “migrate” from Catalina Island south along the California coast.\n\nThe company’s white paper is pretty wild. It asks, “Do fleets of UAP 'migrate' from Catalina Island to Guadalupe Island with a certain frequency? And if so, how well do whale songs correlate, if at all, to UAP appearances?” It’s unclear how whale songs are relevant here, but let’s move along.\n\nDay, who believes that his experience tracking these objects has led to some curious special abilities, such as “advanced cognition” told Motherboard that the organization is hoping to “offer technology developers a way to test their new tech at no direct cost to them.” Using state of the art cameras and other experimental monitoring devices, the idea is to put this high tech gear into the field and attempt to track unknown aerial objects off the coast of California.\n\nLeading the team of scientists is Dr. Kevin Knuth, a former scientist with NASA’s Ames Research Center, now an associate professor of physics at the University of Albany. Knuth specializes in machine learning and the study of exoplanets. While the organization and the project is still in its infancy, Knuth told Motherboard that “the goal of the expedition is to give us some ground truth. We aim to try to observe these objects directly, and record them using multiple imaging modalities.”\n\nKnuth explained that the project has two phases. First, the team “will obtain current satellite imagery of the area (more or less in the area of Catalina Island and southward for ~100 miles) and determine whether these anamolous objects can be observed. We will monitor these satellite images both manually and using machine learning and build up a database of detections, classifications, and any observed patterns of activity.”\n\nIf, and it's a big “if,” the satellite imagery does point to a strange concentration of unknown objects, the team will go hunt UFOs. The second step, which is slated for November 2020, is to basically park a large boat off the coast of California loaded with various cameras and sensors to detect and record anomalous aerial activity. The team has already begun negotiations to charter the MV Horizon, a small research vessel.\n\n“We will be using tracking security cameras in the visual to infrared wavelengths with telephoto lenses, human eyes on the water with high power binoculars and spotting scopes, as well as digital SLR cameras with high power telephoto lenses ranging from 400mm - 600+mm,” Knuth told Motherboard. “We plan to have high-quality drones in the air with imaging capabilities. We are looking into IR imaging as well, as well as detectors for x-ray, gamma-ray and custom-built neutron detectors (which are designed to look for dark matter).”\n\nKnuth presented a lecture at the Maximum Entropy and Bayesian Methods in Science and Engineering Workshop at the Max Planck Institute for Plasmaphysics in Garching Germany on determining the flight characteristics of unidentified anomalous vehicles in July 2019. His paper, which is currently waiting to be peer-reviewed, can be found online.\n\n\"This is an effort that I believe is rare and timely given current events\"\n\nKnuth explained that much is still unknown about what exactly people are reporting when it comes to UFOs.\n\n“These are always delicate issues in any study relying on people reporting information. This includes studies in medicine, psychology, and neuroscience which rely on subject responses, sociology studies relying on surveys, and even data reported by scientists (all of whom can make mistakes or lie). The key to ensuring consistency is reproducibility and this requires additional study,” Knuth explained.\n\nOutside of SETI, this is one of the more serious attempts to look for UFOs. It is, admittedly, a bit of a wild goose chase and will cost a boatload of cash. But the team includes some heavy hitters outside of Knuth himself. According to the organization’s white paper, Silicon Valley tech entrepreneur and MIT technologist Rizwan Virk and the Toronto-based CEO of the quantum computing company, ReactiveQ, Deep Prasad have both signed on to help with securing investment for the project.\n\n“I am personally very excited no matter the outcome,” Prasad told Motherboard. “This is an effort that I believe is rare and timely given current events, such as the apparent increase in UAP incidents through official military channels.”\n\nSome other individuals on the team include Luis Elizondo, former Pentagon staffer who quit his job to hunt UFOs with Tom DeLonge, Sean Cahill, the former Chief Master-at-Arms who served aboard the USS Princeton during the 2004 Nimitz Incident, and optical physicist and UFO researcher Bruce Macabee.\n\nGetting the money to pay for all this isn’t going to be easy. While Day’s team is working on grant proposals, they know that the vast majority of funding will have to be private. Renting a research vessel and acquiring the high-tech gear needed to search for UFOs is not cheap. While Day is looking at potentially crowd funding this project, he hopes that the non-profit can secure a few angel investors who are interested in funding scientific research into studying the UFO phenomenon. Day is asking for any interested parties to reach out to him via email as the group’s website is still under development.\n\nKnuth believes it is time to start doing real scientific work on UFOs. While the study is unorthodox (especially the whale bit), so is the very real fact that unidentified aerial vehicles are tracked by the Air Force and Navy, and seem to easily evade the technological weapons apparatus maintained by the most powerful military on the planet.\n\n“The failure to study these phenomena scientifically has resulted in a state of ignorance, which is unacceptable considering the aviation safety issues that have been reported by the US Navy,” stated Knuth.", "description": "UAP eXpeditions is made up of former military officials, Silicon Valley entrepreneurs, venture capitalists, and academics.", "authors": [], "top_image": "https://video-images.vice.com/articles/5dae17b95c8441000a240b6f/lede/1571690681881-START-UP_LOOKING_FOR_UFOS_LK.png?crop=0.9977777777777778xw:1xh;center,center&resize=1200:*", "published_at": "2019-10-23"}