{"pub": "cnbc", "url": "https://cnbc.com/2019/10/01/umb-bank-and-dc-partnered-to-offer-the-dc-power-rewards-visa-card.html", "downloaded_at": "2019-10-01 15:17:34.243613+00:00", "title": "UMB Bank and DC are offering a new rewards credit card—just in time for NYC Comic Con", "language": "en", "text": "Thousands of fans are getting ready to convene in the city for New York City Comic Con, four days of jam-packed events celebrating comics, anime, movies and more. It's perfect timing for UMB Bank and DC to release the DC Power Visa Credit Card, with seven unique cards celebrating iconic characters and DC milestones.\n\nApplicants can choose which card design they want during the application process. The unique designs include DC favorites: Batman, Wonder Woman, the Justice League, Superman, The Flash and Harley Quinn. In addition, there's a limited-edition version of the Batman card that has a vertical design and celebrates the comic's 80th anniversary.\n\nSource: All DC characters and elements © & ™ DC Comics. (s19)\n\nThe DC Power Visa Credit Card offers competitive rewards on entertainment spending with 3X points per dollar on popular entertainment categories: movie theaters, streaming services, digital media (such as books, movies and music) and cable and internet bills. Plus earn 2X points per dollar on dining and gas and 1X points per dollar everywhere else Visa is accepted.\n\nPoints can be redeemed for a statement credit, travel, experiences, gift cards, merchandise, entertainment and more.\n\nIn addition, there's a welcome bonus for new cardholders: Receive 2,500 bonus points and a $50 Fandango promo code after you spend $500 within 90 days of account opening. This is a great way to cover the cost of upcoming movie tickets.\n\nCardholders can also benefit from DC-centric perks provided through UltimateHero Rewards:\n\n10% off a DC Universe annual subscription\n\n10% off purchases at ShopDCEntertainment.com\n\n20% off Warner Bros. Studio Tour Hollywood and merchandise\n\nIf you're a DC fan, this card can help you enjoy special discounts on eligible DC purchases while also earning competitive entertainment rewards — all at no annual fee. For more details, see rates and fees.\n\nDon't miss:\n\nLike this story? Subscribe to CNBC Make It on YouTube!", "description": "Just in time for NYC Comic Con, UMB Bank and DC partnered to release the DC Power Visa Credit Card, with seven unique designs, including a nod to Batman's 80th anniversary.", "authors": ["Alexandria White"], "top_image": "https://image.cnbcfm.com/api/v1/image/105493804-1539009871955comicconcropped.jpg?v=1569875058", "published_at": "2019-10-01"}