{"pub": "afr", "url": "https://afr.com/companies/retail/coles-defends-150m-ocado-centralised-fulfilment-centre-deal-20191017-p531ir", "downloaded_at": "2019-10-17 08:07:18.798457+00:00", "title": "Coles defends $150m Ocado centralised fulfilment centre deal", "language": "en", "text": "“We view Kroger’s centralised fulfilment centre platform as a considerably more expensive, time-consuming model that carries higher risk in what is still a nascent market,” Mr Mandeville said.\n\nJefferies favours the approach taken by Walmart, which started testing MFCs last year with Alert Innovation, and Woolworths, which signed an exclusive partnership with Takeoff Technologies in August to build three automated MFCs in 12 months.\n\n\"Micro-fulfilment helps retailers solve the labour and last-mile costs conundrum,\" Mr Mandeville said.\n\nMicro-fulfilment centres, such as these being built in three Woolworths stores, are cheaper and faster than centralised fulfilment centres, Jefferies says.\n\nHowever, Mr Cain is standing by the Ocado deal, saying MFCs are relatively untested when large volumes are involved.\n\n\"The ones we've seen have a very limited range,\" Mr Cain told The Australian Financial Review. \"Ocado will have the widest range and we think it's the most productive in terms of picks per hour.\n\n\"But we also recognise that there is a need for micro-fulfilment where the central fulfilment solution isn't volume-effective, because you need big volumes to run these CFCs.\n\n\"The other thing is that the Ocado deal is more of an opex deal as opposed to a capex deal. With Witron (which is building two automated distribution centres for Coles) we're paying for the equipment until we own it, but with Ocado we're paying more fees based on delivery, so it's a slightly different model than normal.\"\n\nAdvertisement\n\nSupermarkets' stocks to rise\n\nDespite Jefferies' reservations about CFCs, Jefferies Australia initiated coverage on Coles earlier this month with a buy recommendation and a share price target of $17, 26 per cent higher than the average price target of analysts surveyed by Bloomberg and well above the current market price of $15.27.\n\nJefferies analyst Michael Simotas, who joined the bank from Deutsche Bank last month, said Coles and Woolworths stood to gain as inflation returned to the market and independent and specialty retailers lost market share.\n\nMr Simotas also downplayed the threat from newcomer Kaufland, saying it was unlikely to have a material impact for some time because the hypermarket format was unlikely to resonate with Australian consumers.\n\n\"We expect Coles to continue to lose market share to Woolworths for two more years while still growing at a level sufficient to underpin modest operating leverage, resulting in supermarket [earnings] growth of about 4.5 per cent from the 2020 base,\" Mr Simotas said.\n\nJefferies also has a buy on Woolworths and a price target of $42.50, compared with the market price of $37.95.\n\n\"Coles and Woolworths are trading well above consensus valuations, but in a world of\n\nlow yields and macro uncertainty, we believe they will continue to outperform given their stable earnings, solid cash generation and the strengthening industry thematic,\" Mr Simotas said.", "description": "Coles boss Steven Cain is confident centralised fulfilment centres will be cheaper and faster than the micro-fulfilment centres Woolworths plans to use.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_1%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_941%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/b32db6b5ef6cdc3062359ff30239ccacac620816", "published_at": "2019-10-17"}