{"pub": "marketwatch", "url": "https://marketwatch.com/story/this-magic-word-may-convince-airline-passengers-to-spend-more-money-to-protect-the-environment-2019-10-07", "downloaded_at": "2019-10-07 12:13:56.100178+00:00", "title": "Airline passengers say one magic word would convince them to spend more money on their tickets", "language": "en", "text": "People are much more inclined to pay more money for a carbon “offset” than they were for a carbon “tax,” a new study found.\n\nThe study from researchers at the University of British Columbia in Canada and the Environmental Defense Fund explored the wording around “carbon pricing” — fees that can be charged to mitigate the environmental impact of the good or service being purchased.\n\nThe researchers examined how people responded to different carbon-pricing strategies when purchasing airfare.\n\nThey ran a series of experiments where people were presented with two options for flights, one of which was $14 more expensive. They then tested to see whether people would be willing to choose the costlier flight if the $14 fee was described alternately as a “carbon offset on aviation fuel production and importation” and as a “carbon tax on airplane travel and cargo.”\n\nConsistently, people said they preferred to purchase flights with the carbon fee if it was described as an offset rather than a tax. People were also just as inclined overall to spring for the flight with the $14 fee as they were a cheaper flight.\n\n“Carbon ‘tax’ frames may focus consumers on the cost, and therefore be less effective than carbon ‘offset’ frames that draw attention to the environmental impact of the policy,” the researchers wrote.\n\nBeyond the distinction between taxes and offsets, the researchers noted that the focus of the fee likely also played a role in consumers’ preferences. By describing the offset as being used to counter fuel production and imports, it could be “perceived both to help the environment more and to hold accountable those responsible for the emissions,” the researchers said. A tax on airplane travel, meanwhile, could give the people the impression that they were the ones being penalized.\n\nThe study’s findings could have major ramifications for climate-change policies. The global airline industry is a major source of the carbon emissions that are contributing to climate change. Aircraft produce around 2.5% of global carbon dioxide emissions, and that figure is expected to grow substantially in coming years are more people travel by air.\n\nIn response, climate activists have targeted the airline industry and travelers, seeking to raise awareness of the potentially harmful effects of air travel on the environment. Swedish teen climate activist Greta Thunburg began leading the so-called “flight shame” movement this summer in an effort to convince people either to use more climate-friendly forms of transportation or to purchase carbon offsets for their trips.\n\nAirlines have reported a significant increase in the purchase of these offsets this summer — the money raised from them goes toward a variety of environmental initiatives from the planting of trees to the installation of solar panels.\n\nMost major airlines, including Delta DAL, +1.86%, JetBlue JBLU, +2.12%, United UAL, +1.22% and Alaska ALK, +1.94%, offer customers the option to purchase carbon offsets for their travel or to donate airline miles to partner organizations. In most cases, the cost of these offsets is based on the distance traveled on the flight.\n\nIf this new study is any indication, more people may start spending money on offsets as awareness grows.", "description": "The researchers examined how people responded to different pricing strategies when purchasing airfare.", "authors": ["Jacob Passy"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS717_airpla_ZG_20191004155016.jpg", "published_at": "2019-10-07"}