{"pub": "theverge", "url": "https://theverge.com/2019/9/28/20887015/new-trailers-frozen-2-el-camino-the-irishman-more", "downloaded_at": "2019-10-05 13:52:31.421193+00:00", "title": "New trailers: Frozen 2, El Camino, and more", "language": "en", "text": "I’m filling in for Jake this week, and this is usually where he writes some pithy thoughts about a movie or show that he watched recently. I was really hoping that there would be a new Star Wars: The Rise of Skywalker trailer out so I could write about that, but, sadly, there wasn’t. Although, if history is anything to go by, we’ll probably get one sometime over the next few weeks, so hopefully there won’t be too long to wait.\n\nI did watch Once last week. It was very cute, and the music was fantastic. It was also nice to see a movie that didn’t just go straight for a boy-meets-girl love story. Once’s relationship between Guy and Girl was more complex, bittersweet, and honest than that.\n\nCheck out nine trailers from this week below.\n\nFrozen 2\n\nFrozen’s back! We still don’t have previews of the music, which will probably make or break this movie, but songwriting couple Robert Lopez and Kristen Anderson-Lopez are returning. The movie looks dark and moody, which is perfect for fall. It comes out on November 22nd.\n\nEl Camino: A Breaking Bad Movie\n\nAs the full name suggests, El Camino is a sequel film to Breaking Bad, and it will see the return of Aaron Paul’s Jesse Pinkman as he deals with the aftermath of the series. If you haven’t watched Breaking Bad, you might want to skip this trailer. It’ll hit Netflix on October 11th.\n\nThe Irishman\n\nRobert De Niro, Al Pacino, and Joe Pesci are starring in a Martin Scorsese film about the Irish mob and the disappearance of Jimmy Hoffa. It’s unclear if it’ll be the best mob movie ever made, but it certainly seems like the most mob movie. It’ll hit theaters in a limited release on November 1st followed by a Netflix release on November 27th.\n\nBoJack Horseman, season 6\n\nBoJack Horseman is one of Netflix’s oldest and longest-running shows, but the sixth season, which just got a trailer this week, will be its last. Expect more of the show’s trademark mix of depression, joy, and animal puns as we head into the final stretch. The last season will be split into two parts: the first half comes out on October 25th, and the second half comes out on January 31st, 2020.\n\nAmerican Son\n\nAmerican Son is an interesting project. It’s a film adaptation of the Broadway show that follows parents as they look for their missing son. It features the same cast as the stage production: Kerry Washington, Steven Pasquale, Jeremy Jordan, and Eugene Lee. I saw it on Broadway, and I’m curious to see if it’ll make the jump to film well. It comes out on November 1st.\n\nIn My Room\n\nWhat if The Last Man of Earth was a bleak-looking movie about the end of the world instead of an off-kilter Will Forte comedy show? Well, it’d probably look like In My Room. It’s out on October 11th.\n\nThe Wolf Hour\n\nNaomi Watts stars in this psychological thriller as a novelist who has cut herself off from the outside world, as she fights off writers’ block and paranoia, during the 1977 blackout riots in NYC. This looks pretty stressful? It’ll be out later in 2019.\n\nDollface\n\nKat Dennings stars in Dollface, a new Hulu series that sees her character Jules try to reconnect with her female friends (and her life) after breaking up with her longtime boyfriend. Things get weird, fast: there’s a giant talking cat? But it looks fun. It premieres on November 15th on Hulu.\n\nServant\n\nM. Night Shyamalan’s Apple TV Plus show hasn’t gotten a full trailer yet, but Apple has released two teasers (the other one is here). I’m sure everything is absolutely fine with this mysterious baby. There’s no release date yet.", "description": "Nine new trailers to watch this week, including Frozen 2, El Camino, The Irishman, and more.", "authors": ["Chaim Gartenberg", "Sep"], "top_image": "https://cdn.vox-cdn.com/thumbor/xqK3sfC9seMitkHbdgZ2D7M22T8=/301x0:2700x1256/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19101242/frozen.jpg", "published_at": "2019-09-28"}