{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/hurricane-dorian-students-homeless-virginia-university-free-term-bahamas-a9096411.html", "downloaded_at": "2019-09-08 23:28:13.192622+00:00", "title": "US university offers free term to students left homeless by Hurricane Dorian", "language": "en", "text": "A historically black university in Virginia is offering a free term of education to Bahamian students displaced by Hurricane Dorian.\n\nHampton University announced on Thursday an agreement to help the University of the Bahamas-North, which serves students from the battered islands of Grand Bahama and Abaco Islands.\n\nUnder the plan, students from the Bahamas will be able to attend Hampton this autumn without charge for tuition, room and board.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe main University of the Bahamas campus in Nassau reopened on Thursday.\n\nBut the Grand Bahama campus “sustained severe flooding and devastating storm damage”, the school said in an appeal for donations online.\n\nShape Created with Sketch. \"Huge damage\" as record Hurricane Dorian hits Bahamas: In pictures Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. \"Huge damage\" as record Hurricane Dorian hits Bahamas: In pictures 1/15 A road is flooded during the passing of Hurricane Dorian in Freeport, Grand Bahama. AP 2/15 Hurricane Dorian's eye taken by Nasa astronaut Nick Hague, from aboard the International Space Station. The station orbits more than 200 miles above the Earth. Hurricane Dorian, which made landfall on the Bahamas as category 5 and now reclassified as category 4, is expected to continue on its projected path towards the Florida coast. Nasa/EPA 3/15 Buildings damaged by Hurricane Dorian are swept by deep floodwater in the Abaco Islands in The Bahamas. Latrae Rahming 4/15 Tropical Storm Dorian as it approached the Bahamas. NOAA/AFP/Getty 5/15 Strong winds blow the tops of trees while whisking up water from the surface of a canal that leads to the sea in Freeport, Grand Bahama AP 6/15 A woman walks in a flooded street after the effects of Hurricane Dorian arrived in Nassau, Bahamas. REUTERS 7/15 Uprooted trees, fallen power lines and debris scatter a road as Hurricane Dorian sweeps through Marsh Harbour in The Bahamas Ramond A King via Reuters 8/15 Buildings damaged by Hurricane Dorian are swept by deep floodwater in the Abaco Islands in The Bahamas Latrae Rahming 9/15 A building is strewn with debris after its roof was torn off by Hurricane Dorian in the Abaco Islands in The Bahamas Latrae Rahming 10/15 Uprooted trees, fallen power lines and debris scatter a road as Hurricane Dorian sweeps through Marsh Harbour in The Bahamas Ramond A King via Reuters 11/15 Hurricane Dorian is pictured from a plane flying inside the eye of the storm Garrett Black/US Air Force 12/15 Inmates from a Florida jail fill sandbags to hand out to residents ahead of Hurricane Dorian in Cocoa, Florida on September 1 EPA 13/15 Residents stock up at Wal-Mart in preparation for Hurricane Dorian in Orlando, Florida Getty 14/15 A shop is boarded-up ahead of Hurricane Dorian in Cocoa, Florida on September 1 Reuters 15/15 Waves batter a pier in Marsh Harbour in The Bahamas on September 1e Mark Hall vie Reuters 1/15 A road is flooded during the passing of Hurricane Dorian in Freeport, Grand Bahama. AP 2/15 Hurricane Dorian's eye taken by Nasa astronaut Nick Hague, from aboard the International Space Station. The station orbits more than 200 miles above the Earth. Hurricane Dorian, which made landfall on the Bahamas as category 5 and now reclassified as category 4, is expected to continue on its projected path towards the Florida coast. Nasa/EPA 3/15 Buildings damaged by Hurricane Dorian are swept by deep floodwater in the Abaco Islands in The Bahamas. Latrae Rahming 4/15 Tropical Storm Dorian as it approached the Bahamas. NOAA/AFP/Getty 5/15 Strong winds blow the tops of trees while whisking up water from the surface of a canal that leads to the sea in Freeport, Grand Bahama AP 6/15 A woman walks in a flooded street after the effects of Hurricane Dorian arrived in Nassau, Bahamas. REUTERS 7/15 Uprooted trees, fallen power lines and debris scatter a road as Hurricane Dorian sweeps through Marsh Harbour in The Bahamas Ramond A King via Reuters 8/15 Buildings damaged by Hurricane Dorian are swept by deep floodwater in the Abaco Islands in The Bahamas Latrae Rahming 9/15 A building is strewn with debris after its roof was torn off by Hurricane Dorian in the Abaco Islands in The Bahamas Latrae Rahming 10/15 Uprooted trees, fallen power lines and debris scatter a road as Hurricane Dorian sweeps through Marsh Harbour in The Bahamas Ramond A King via Reuters 11/15 Hurricane Dorian is pictured from a plane flying inside the eye of the storm Garrett Black/US Air Force 12/15 Inmates from a Florida jail fill sandbags to hand out to residents ahead of Hurricane Dorian in Cocoa, Florida on September 1 EPA 13/15 Residents stock up at Wal-Mart in preparation for Hurricane Dorian in Orlando, Florida Getty 14/15 A shop is boarded-up ahead of Hurricane Dorian in Cocoa, Florida on September 1 Reuters 15/15 Waves batter a pier in Marsh Harbour in The Bahamas on September 1e Mark Hall vie Reuters\n\n“I think this agreement is something that can be helpful to a great number of students and families, and is part of something I’ve tried to do my entire career – helping people to achieve and meet their goals,” William R Harvey, president of Hampton, said.\n\nThe leaders of the two schools have a personal connection. Before becoming president of the University of the Bahamas, Rodney Smith was an administrator at Hampton.\n\nMr Harvey said displaced Bahamian students would be welcome to stay at Hampton after the autumn term, but they would be charged the university’s regular rates for tuition and fees.\n\nOrdinarily, tuition and fees for a full school year at Hampton would be about $28,000 (£22,790), not including room and board. The university had about 4,300 students as of last autumn.\n\n“Hampton has been the educational choice for many Bahamians over its long history,” Lawrence Rigby, a former Hampton student body president, who is from Nassau, said.\n\n“Young Bahamians from Abaco and Grand Bahama who are looking for the tools to rebuild their lives and our home will find them at Hampton.”\n\nThe Washington Post", "description": "A historically black university in Virginia is offering a free term of education to Bahamian students displaced by Hurricane Dorian.  Hampton University announced on Thursday an agreement to help the University of the Bahamas-North, which serves students from the battered islands of Grand Bahama and Abaco Islands.", "authors": ["Rachel Weiner"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/04/13/Hurricane-Dorian2.jpg", "published_at": "2019-09-08"}