{"pub": "theverge", "url": "https://theverge.com/2019/9/27/20886781/apple-tv-plus-movies-theater-release-sofia-coppola-a24-netflix-amazon", "downloaded_at": "2019-10-05 14:42:54.601925+00:00", "title": "Apple will reportedly release films in theaters weeks before they come to Apple TV Plus", "language": "en", "text": "People may not need an Apple TV Plus subscription to see some of the company’s biggest upcoming original films. According to Variety, Apple will reportedly start rolling out its original films in select theaters nationwide, weeks before they’re slated to arrive on its forthcoming streaming service, beginning in October.\n\nThe films are being distributed via boutique distributors, according to Variety, which may suggest that mega chains like AMC and Regal aren’t currently looking to distribute the films. The Verge has reached out to AMC, Regal, and Apple for comment.\n\nThe three films Apple is set to release this year all spell possible Oscar contenders. Highly anticipated documentary The Elephant Queen is the first Apple original film to hit theaters on October 18th. It will then be available to stream on Apple TV Plus beginning on November 1st, when the service launches. The Elephant Queen will be followed by Hala, a film about a Muslim girl trying to reconcile her life with her family’s religious ideals, which hits theaters on November 22nd, and will reportedly be available to stream on TV Plus in December. Finally, Anthony Mackie and Samuel L. Jackson’s The Banker, about two real estate giants living during the Jim Crow era, will be released on December 6th, and reportedly later streamed on TV Plus in January.\n\nThe aforementioned dramas and documentary aren’t exactly an Avengers movie; they’re not going to break $1 billion at the box office.\n\nVariety’s report follows an earlier article by The Wall Street Journal that suggested Apple was pursuing a more traditional theatrical release for some of its original films. This could go beyond what Netflix offers for some of its biggest movies. That means some films would stay in theaters for a 12-week period before they’re available to stream.\n\nSofia Coppola’s On the Rocks, which was produced by A24 for Apple as part of an overall five-movie deal, is one film that could see a wider national release with chains like AMC and Regal. The company wants to release it around mid-2020, possibly following a premiere at Cannes, according to the Journal. The movie is a drama from Sofia Coppola that tells the story about the rocky relationship between a daughter and father (played by Rashida Jones and Bill Murray).\n\nThe aforementioned dramas and documentary aren’t exactly an Avengers movie; they’re not going to break $1 billion at the box office. Theatrical releases does give Apple, however, the opportunity to vie for an Oscar, though. Amazon Studios started pursuing similar theatrical releases for some of its award contenders in 2015. Movies like Manchester by the Sea, which saw lead actor Casey Affleck take home the Oscar for Actor in a Leading Role in 2017, received a lengthier, three-month release in theaters than other movies. Amazon will sometimes release a film for two weeks in theaters.\n\nThe decision to give movies proper theatrical releases also comes at a time when Netflix is going head-to-head with major theater distributors like AMC and Regal. Netflix has never given a movie a 12-week release, and therefore a Netflix movie has never played a major national theater chain. Netflix’s priority has always been to its subscribers and serving their needs at home. A source close to the Apple deal told Variety that Apple doesn’t “want to be Netflix,” when it comes to relationships with theater chains.\n\nThe company has released films in theaters for a limited release, including Oscar-winning Roma, which was in theaters for 21 days. Netflix’s newest film, Martin Scorsese’s The Irishman, will also receive a 21-day release in theaters, but that’s not without internal strife and controversy. Scorsese wanted a full national release, according to a report from The New York Times, but Netflix, AMC, and Regal wouldn’t budge.\n\nA source close to the Apple deal told Variety that Apple doesn’t “want to be Netflix,” when it comes to relationships with theater chains\n\nThe dichotomy between Netflix’s plans and Apple’s could also give Apple an upper hand when it comes to courting talent. Netflix can’t promise big directors like Scorsese that their movies will play at AMC, and therefore in major theaters across the country. If Apple does play the theatrical release long game, the company can offer something Netflix can’t.\n\nStill, Apple is just getting into original content, and it’s going to take time to build some trust. The company reportedly offered Star Wars: The Rise of Skywalker director J.J. Abrams $500 million to make content exclusively for Apple with his company Bad Robot. Abrams walked away from the deal and signed an overall contract with WarnerMedia that is reportedly worth $250 million, under the condition that he could work with other studios and networks, including Apple and Disney.\n\nApple doesn’t appear to be chasing after Disney’s box office dominance, but instead focusing on a prestige play. Its TV originals, including The Morning Show and For All Mankind, are examples of series that could make Emmy plays for traditional networks. Its films, especially those produced by A24, are likely to be major Oscar contenders for the company, too. Get used to seeing Apple CEO Tim Cook sitting at a table at the Oscars — maybe even across the aisle from other tech pals like Amazon CEO Jeff Bezos.\n\nUpdate September 27th, 5:35pm ET: The story has been updated to include new information from Variety about specific movies getting release dates.", "description": "Apple is reportedly going to pursue a traditional theatrical release plan, according to The Wall Street Journal, which could go beyond what Netflix offers for some of its biggest movies. It’s partially a play for Oscar nominations, and it also helps Apple court talent.", "authors": ["Julia Alexander", "Sep"], "top_image": "https://cdn.vox-cdn.com/thumbor/N2Vm_ecIQRnsYFgZ5_i-FpRJvfE=/0x662:5568x3577/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19237891/1132806365.jpg.jpg", "published_at": "2019-09-27"}