{"pub": "yahoo", "url": "https://finance.yahoo.com/news/labour-expand-u-k-financial-171518860.html", "downloaded_at": "2019-09-13 00:57:27.123308+00:00", "published_at": "2019-09-12", "title": "Labour to Expand U.K.'s Financial Transaction Tax If Elected", "language": "en", "text": "(Bloomberg) -- The opposition Labour Party would seek to expand a tax on financial transactions if it is elected to government, according to the party’s Treasury spokesman John McDonnell.\n\nThe party accepts the broad principles of a report published Thursday calling for the tax to cover foreign-exchange transactions, interest-rate derivatives and commodities, McDonnell said. Specific details will be announced as part of Labour’s process for deciding its manifesto commitments.\n\n“All you want to hear from me is if we’re going to adopt the policy,” McDonnell said in a speech in London. “Yes.”\n\nWith Prime Minister Boris Johnson’s government facing gridlock over Brexit, political parties are gearing up for an early general election sometime in the fall. At the last national ballot in 2017, the party’s relentless focus on domestic policies and reforming the economy contributed to a stronger-than-expected showing that cost the Conservative Party its majority.\n\nThe U.K’s existing transactions tax -- the Stamp Duty Reserve Tax -- is set at 0.5% on purchases of U.K.-issued shares, and generated more than 3.5 billion pounds ($4.3 billion) in 2017/18, according to the report by Intelligence Capital for the Progressive Economy Forum.\n\nExpanding it to cover the three areas Labour is considering would generate an additional £2.1bn in revenue for the Exchequer, according to the report.\n\n“We need to move beyond a world dominated by fast finance,” McDonnell said in a separate statement.\n\nBut Stephen Jones, chief executive of U.K. Finance, said the plan would hit savers, homeowners and small businesses.\n\n“At a time of great uncertainty for business we would encourage policy makers to focus on proposals that would support the growth and competitiveness of the U.K.’s financial sector,” he said in an emailed statement.\n\nTo contact the reporter on this story: Jessica Shankleman in London at jshankleman@bloomberg.net\n\nTo contact the editors responsible for this story: Tim Ross at tross54@bloomberg.net, Stuart Biggs, Thomas Penny\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- The opposition Labour Party would seek to expand a tax on financial transactions if it is elected to government, according to the party’s Treasury spokesman John McDonnell.The party accepts the broad principles of a report published Thursday calling for the tax to cover foreign-exchange", "authors": ["Jessica Shankleman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/bybfwfPIIv6PDTwtCLblaQ--~B/aD0xMjk3O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/6738b20786742f33db534a6d71d0d856"}