{"pub": "arstechnica", "url": "https://arstechnica.com/science/2019/10/study-claimed-a-gmo-trial-went-horrifically-wrong-the-studys-authors-disagree", "downloaded_at": "2019-10-05 10:51:35.398783+00:00", "title": "Study claimed a GMO trial went horrifically wrong. The study’s authors disagree", "language": "en", "text": "Six researchers are reportedly calling for the retraction of their study, which claimed that a trial of genetically modified (GM) mosquitoes went horrifically wrong and resulted in extra-dangerous, mutant blood-suckers flying rampant in a Brazilian city.\n\nThe study —authored by 10 researchers in total and published September 10 in Scientific Reports—monitored the consequences of a pilot release of GM mosquitoes in Jacobina, Brazil, that started in 2013.\n\nThe GM mosquitoes are a strain of Aedes aegypti created by British biotechnology company Oxitec and dubbed OX513A. The insects carry an artificially created gene (a transgene) that kills nearly all of their offspring, thereby smacking down the mosquito population overall.\n\nBetween 2013 and 2015, researchers released 450,000 male OX513A mosquitoes per week in the Brazilian city (male mosquitoes don't bite). The trial was previously considered a success, with the local mosquito population falling around 90%.\n\nBut according to the contested study, some of the survivors were viable hybrid mosquitoes that are \"very likely\" to be \"more robust\" than the original mosquito population. This conclusion is based on a genetic theory called \"hybrid vigor.\" The study's text suggests that the hybrid mosquitoes could be more resistant to insecticides or better at spreading infectious viruses, such as dengue and Zika. The suggestion spurred alarming headlines and played to the fears of anti-GMO advocates.\n\nOxitec and other critics say that such a suggestion is incendiary conjecture and that the study's text is flawed. A small number of such hybrids (3%-5%) were expected, Oxitec and other researchers note. These hybrid mosquitoes contain chunks of genetic material from the strain of mosquito used to make OX513A—a cross of A. aegypti stains found in Mexico and Cuba. But the hybrids do not contain the transgene and thus are not GM mosquitoes. More importantly, there is no evidence in the paper or elsewhere that the hybrid mosquitoes are more dangerous than the original mosquitoes.\n\nIt's also worth noting that A. aegypti is an invasive species in Brazil and many other places. The local population and the GM strain are both not native.\n\nBiting criticism\n\nIn an emailed statement to Ars in September, an Oxitec spokesperson called the study \"an unqualified research article with misleading, speculative, and unsubstantiated claims and statements about Oxitec's mosquito technology.\"\n\nOxitec said it was working with the publisher of Scientific Reports to \"remove or substantially correct this article.\"\n\nOn September 17, the journal's editors attached a note to the online publication. It read:\n\n[R]eaders are alerted that the conclusions of this paper are subject to criticisms that are being considered by editors. A further editorial response will follow the resolution of these issues.\n\nWhile that editorial response is still pending, the study now appears to be under criticism from the majority of its own authors. Six of the study's 10 authors have requested its retraction, according to Brazilian science magazine Revista Questão de Ciência.\n\nOne co-author, Margareth Capurro a molecular biologist at University of São Paulo, told the magazine that the final version of the study did not match the data that she and her collaborators submitted to their co-authors. She also said that the published text was different from the version of the manuscript that all the authors had agreed upon.\n\nIn an emailed statement to Science magazine, a lawyer representing Capurro said that she is \"trying to solve this issue directly and amicably with the other authors.\" But she added that she \"does not support the inflammatory, dramatic, and speculative statements contained in the manuscript.\"\n\nThe leading author of the study is population geneticist Jeffrey Powell of Yale University. He told Science that he stands by the data and the text, which he says clearly states that the significance of the hybrids is not clear.", "description": "After scary news headlines, one study author said she didn't get to read the final text.", "authors": ["Beth Mole"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2016/11/GettyImages-618402148-760x380.jpg", "published_at": "2019-10-02"}