{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/obituaries/alicia-alonso-ballet-star-who-founded-national-ballet-of-cuba-dies-at-98/2019/10/17/4b5c0d9a-f101-11e9-8693-f487e46784aa_story.html", "downloaded_at": "2019-10-18 01:12:42.439182+00:00", "title": "Alicia Alonso, indomitable ballet star who founded National Ballet of Cuba, dies at 98", "language": "en", "text": "Ms. Alonso leaped to prominence in the 1940s as a member of American Ballet Theatre. She performed in works by renowned choreographers including George Balanchine, Antony Tudor, Michel Fokine and Agnes de Mille, and her longtime onstage partnership with the late Igor Youskevitch was such a successful match that the pair earned favorable comparisons to ballet legends Margot Fonteyn and Rudolf Nureyev.\n\nAD\n\nAD\n\nAs a performer, Ms. Alonso’s singular achievement was her rendition of the title role in “Giselle.” More than 60 years after she first performed it, Ms. Alonso’s interpretation is still widely considered the definitive version of one of ballet’s most difficult and demanding parts.\n\nCritics were impressed by Ms. Alonso’s versatility and power. “Equally admired for her classical and modern interpretations, in her prime she also commanded extreme extensions, stunningly fast turns and powerful jumps of the kind that made audiences gasp,” Washington Post dance critic Alan M. Kriegsman once wrote.\n\nIn launching the National Ballet in 1959, Ms. Alonso gave Cuba a first-rate classical dance troupe and school that could rival the world’s best — no minor feat in a small country without any noteworthy ballet tradition. She imbued the company with the sensuality and musicality that defined her own dancing and that she has said is ingrained in Cuban culture.\n\nAD\n\nAD\n\nCuban leader Fidel Castro sought to revitalize the arts in post-revolution Cuba, and his backing was critical to the National Ballet’s success. “He knew I was a cultural ambassador for our little land. He saw I had vision. Well, he did, too,” Ms. Alonso told an interviewer in 2007.\n\nGiven her formidable contributions to the arts and her strong ties to Castro, arts critic Octavio Roca wrote in the Miami Herald in 2004 that Ms. Alonso “is unique in the world of culture: one of the greatest of all time and a political figure who polarizes argument in every corner of the Cuban diaspora.”\n\nThough she typically shunned discussing politics in interviews, she occasionally spoke of her support of Cuba’s communist regime, earning her adoration from loyalists and ire from defectors and others who opposed Castro’s government.\n\nAD\n\nAD\n\nIn 1957 and 1958, Ms. Alonso was asked to give guest performances with the Bolshoi Ballet and Kirov Ballet, a rare invitation for a ballerina from the Americas in an era when Russian and European performers reigned supreme in the ballet world. She also performed with the Ballet Russes de Monte Carlo and served as a guest choreographer for the Paris Opera Ballet.\n\nAlicia Ernestina de la Caridad delCobre Martinez y del Hoyo was born in Havana on Dec. 21, 1920, to an army officer and his wife.\n\nBefore beginning ballet lessons at 9, “Mama used to put me in a room with a phonograph and a scarf,” she told Dance magazine in 1953. “That would keep me quiet for a few hours, doing what I imagined was dancing.”\n\nAD\n\nWhen she was 15, she eloped with Fernando Alonso, a fellow ballet student. The pair left Cuba for New York, convinced they’d have a better chance of becoming ballet stars. Within a year, Ms. Alonso gave birth to their only child, Laura. She later divorced Fernando Alonso and married Pedro Simon, a lawyer and dance writer. Her husband and daughter survive.\n\nAD\n\nBefore she was able to land jobs in ballet, Ms. Alonso and her first husband appeared in two short-lived Broadway musicals, “Great Lady” (1938) and “Stars in Your Eyes” (1939).\n\nNot long after, Ms. Alonso received a contract with Ballet Caravan, a group headed by impresario Lincoln Kirstein that was a precursor to the New York City Ballet. In 1940, she became a member of the nascent Ballet Theatre, which is today known as American Ballet Theatre.\n\nAD\n\nThe following year, just as her star was beginning to rise, she noticed that her vision was beginning to fail. She underwent three surgeries to try to correct a detached retina, the last of which required her to stay in bed for a year, lying practically motionless with her eyes covered by bandages.\n\nStill, her passion for dance wouldn’t allow her to remain completely sedentary. Employing small movements of her hands and feet, she taught herself the lead role in “Giselle” during this time.\n\nAD\n\n“It was torture for me to be still, feeling myself gain weight and become flabby,” she told Dance magazine in 1953. “I realized then that dancing was the most important part of my life.”\n\nAD\n\nIn a testament to her grit and determination, Ms. Alonso was back onstage by 1943. The surgeries did not completely correct her sight; she still lacked peripheral vision from that point forward. To help her, a wire was often placed at the front of the stage to prevent her from falling into the orchestra pit, and lights were strategically placed around the stage so she could determine where she was by their relative brightness.\n\nYouskevitch, her partner, became an expert at dancing with her, making sure he was always in the exact correct position relative to Ms. Alonso so she would not have to rely on sight to dance with him.\n\nAD\n\nMs. Alonso gave her first performance of “Giselle” in 1943 as a last-minute replacement for an ill Alicia Markova. The part would come to define her career, and she would perform it for ABT, Ballet Russes de Monte Carlo and National Ballet of Cuba for decades to come.\n\nAD\n\nMs. Alonso’s other notable roles include a turn as Lizzie Borden in de Mille’s “Fall River Legend” (1948) and in Fokine’s “Les Sylphides.” She originated lead roles in Balanchine’s “Theme and Variations” (1947) and “Undertow” (1945), Tudor’s psychological drama about a tormented man who commits a murder.\n\nWhile working with Tudor, fellow ABT dancer Donald Saddler remembered Ms. Alonso’s flinty attitude when the choreographer, notorious for berating his dancers, approached her. “She put her hands on her hips and she said, ‘Mr. Tudor, you can’t ever make me cry.’ He never picked on her again,” Saddler told the Los Angeles Times in 1998.\n\nAD\n\nIn 1948, Ms. Alonso headed back to Cuba to establish her own company. However, Alicia Alonso Ballet Co. struggled from the start, largely because of a lack of funding, and it folded in 1956. Three years later, when Castro came into power, Ms. Alonso asked the new leader for funds to set up a ballet school and company.\n\nAD\n\nFernando Alonso, who served as an administrator for the company, settled on the details with Castro during a late-night meeting at the Alonso home.\n\nIn 1978, he told The Post that Castro said, “ ‘It’s so late, I forgot I have an appointment and must go.’ He started down the stairs and stopped to shout up, ‘I forgot what I came for! I forgot to ask you how much money you need for the ballet.’ ”\n\n“I shouted back, without thinking, ‘About $100,000!’ ”\n\n“I’ll give you $200,000, but it better be a good ballet!”\n\nAD\n\nWith that, Ms. Alonso founded the National Ballet of Cuba, which would comprise a school and professional company. To recruit dancers and drum up interest in ballet among Cubans, she had her fledgling group give small performances at unconventional places like farms, factories and on military bases. She looked for male dancers in orphanages and gave free tuition to those with potential.\n\nThe company landed touring gigs in South and Central America and throughout Europe. Over the years, several of the company’s dancers have defected during international tours, but a few of its brightest stars have been granted permission to leave Cuba to perform with other troupes, most notably Jose Manuel Carreño of American Ballet Theatre, Lorena Feijoo of San Francisco Ballet and Carlos Acosta, who has performed with the Royal Ballet.\n\nThroughout her tenure with the National Ballet of Cuba, Ms. Alonso guest performed internationally with other troupes but was rarely seen in the United States during some of the prime years of her career because the Eisenhower administration cut off diplomatic ties to Cuba. However, she was to appear in the country again, performing in New York with ABT in 1975 and 1977. She brought her full company for its U.S. debut in 1978.\n\nLong after her final curtain call, dance remained Ms. Alonso’s passion. “I’m breathing life into other people,” she told an interviewer in 2007. “I make choreography for others to dance. It’s like dancing through their spirit. You see I’m still dancing, even if my feet never move.”", "description": "The ballet company became one of the country’s premiere cultural institutions, and she maintained a steel-like grip on power over the troupe well into her 90s.", "authors": ["Sarah Halzack"], "top_image": "https://www.washingtonpost.com/resizer/NVsF-6TIAvdWncpW_8nhUcT89j8=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HJKOGWHRAMI6TCPL5RLM2QKHGI.jpg", "published_at": "2019-10-17"}