{"pub": "fox", "url": "https://foxbusiness.com/lifestyle/prince-harrys-war-with-the-press-continues", "downloaded_at": "2019-10-05 22:45:45.537021+00:00", "title": "Prince Harry ramps up war on British tabloids with lawsuit over cell-phone hacking", "language": "en", "text": "Prince Harry is suing two of Britain’s biggest tabloid newspapers, claiming The Sun and the Daily Mirror hacked his cell phone.\n\nContinue Reading Below\n\nThe case marks an escalation in Harry’s ongoing battle with British tabloids. Earlier, he backed up a lawsuit by his American wife, Meghan Markle, the Duchess of Sussex, against the Mail on Sunday over misuse of private information, copyright infringement and violating the U.K.'s data protection law when it published a private letter to her father.\n\nOn Saturday, Buckingham Palace confirmed a claim of \"illegal interception of voicemail messages\" against the two newspapers, but declined to release any more information because \"the particulars of the claims are not yet public.\"\n\nHarry has criticized the press for ruthlessly hounding his wife, just as it did his mother, the late Princess Diana. She died in a 1997 car accident while fleeing paparazzi in Paris.\n\nByline Investigates, meanwhile, has reported that the Mirror publications face legal claims over newsgathering activities that stretch back to newsman Piers Morgan's tenure as editor.\n\nMorgan, who writes a column in The Daily Mail, called Markle “a self-obsessed professional actress who has landed the role of her life and is determined to milk it for all she’s worth” last year.\n\n“Stop playing the victim, Harry -- you and Meghan brought the negative press on yourselves, and just when you turn things around, you ruin it all,” Morgan’s most recent headline read.\n\nCLICK HERE TO GET THE FOX BUSINESS APP\n\nThe parent company of The Sun, News Group Newspapers, confirmed a legal claim by Prince Harry in a statement obtained by the Daily Beast. The Daily Mirror’s parent company, Reach, said it, too, is aware of the proceedings.", "description": "Prince Harry has criticized the press for ruthlessly hounding his wife, just as it did his mother, the late Princess Diana. She died in a 1997 car accident while fleeing paparazzi in Paris.", "authors": ["Matthew Mcnulty"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/05/0/0/Meghan-Harry-AP.jpg?ve=1&tl=1", "published_at": "2019-10-05"}