{"pub": "foxnews", "url": "https://foxnews.com/entertainment/ny-gov-andrew-cuomo-food-network-host-sandra-lee-split-after-14-years", "downloaded_at": "2019-09-26 03:58:35.954279+00:00", "title": "NY Gov. Andrew Cuomo, Food Network host Sandra Lee split after 14 years", "language": "en", "text": "New York Gov. Andrew Cuomo and longtime girlfriend Food Network host Sandra Lee announced Wednesday they are splitting up after 14 years together.\n\n\"Over the recent past, we have realized that our lives have gone in different directions and our romantic relationship has turned into a deep friendship,” the couple said in a joint statement. “We will always be family and are fully supportive of each other and dedicated to the girls. Our personal lives remain personal and there will be no further comment.\"\n\nTV CHEF SANDRA LEE SELLING HOME SHE SHARES WITH NY GOV. ANDREW CUOMO\n\nRumors of a breakup started last May when Lee put the home she shared with Cuomo in the New York suburbs on the market.\n\nAfter a Page Six column reported breakup rumors at the time, Lee told the New York Post on Facebook to \"knock it off\" and said they're \"very much together.\"\n\nThe couple began dating in 2005 and Lee often functioned as New York’s de facto first lady at official events.\n\nCuomo has three grown daughters from his marriage to Kerry Kennedy, Robert F. Kennedy’s daughter, which ended in 2005.\n\nLee works for Food Network and is a contributor for \"'Good Morning America.\" She is known for her \"semi-homemade\" approach. She is also a cookbook author and cancer screening advocate since she battled the disease in 2015.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nCuomo, in his third term as governor, has spent much of his time in the governor's mansion in Albany since they decided to sell the house.\n\nThe Associated Press contributed to this report.", "description": "New York Gov. Andrew Cuomo and longtime girlfriend Food Network host Sandra Lee announced Wednesday they are splitting up after 14 years together.", "authors": ["Brie Stimson"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/AP19268797234183.jpg", "published_at": "2019-09-26"}