{"pub": "yahoo", "url": "https://news.yahoo.com/pete-buttigieg-won-democratic-debate-162650490.html", "downloaded_at": "2019-10-17 06:07:00.548777+00:00", "title": "Pete Buttigieg won the Democratic debate by bringing a youthful bite back to moderate politics", "language": "en", "text": "Pete Buttigieg wasn’t looking to make friends at last night’s Democratic presidential debate; he was to make a standout performance – and he delivered. The South Bend, Indiana mayor had a stellar evening yesterday in Ohio, second only to Sen. Elizabeth Warren.\n\nIn previous debates, the 37-year-old Afghanistan war veteran and Rhodes Scholar came across as genuine and thoughtful, if not a bit stiff. But on Tuesday, Buttigieg gave his most impassioned and aggressive performance yet, and he took no prisoners.\n\nThe former naval intelligence analyst didn’t waste any time going after frontrunner Warren on multiple issues; instead, he concentrated on framing himself as the alternative to Joe Biden for voters looking for a moderate candidate with a cleaner record, more energy and fresher views. Importantly, his views echo those of many Americans who aren’t ready for obligatory Medicare-for-All plans, among other more progressive proposals. With the Iowa caucuses coming up on February 3rd, Buttigieg may have arrived on the scene just in time.\n\nWhen former Rep. Beto O’Rourke attacked Buttigieg over the logistics of mandatory buybacks of AK-47s, Buttigieg blasted him with one of the best lines of the night, saying, “I don’t need a lesson from you on courage, political or personal.” But Buttigieg isn’t the type to deliver a one-liner then coast. He followed up on that jab with the most important point about the gun control debate, explaining that “the problem is the National Rifle Association and their enablers in Congress”, not other Democrats who may disagree on how exactly to end the gun violence crisis in the US.\n\nThe moderator’s questioning about Trump’s withdrawal of US troops from Syria and the resulting violence understandably provoked some emotional responses from the candidates.\n\nButtigieg called out the only other veteran onstage, Hawaii Rep. Tulsi Gabbard, for her views on Syria after Gabbard echoed Republican talking points that the US pullout of Syria wasn’t Trump's fault and that the US had wrongly been in Syria for a “regime change war”. When Buttigieg responded that her statement was “dead wrong”, he delivered an eloquent and hard-hitting explanation of the military situation: “The slaughter going on in Syria is not a consequence of American presence, it is a consequence of a withdrawal and a betrayal by this president of American allies and American values. Look, I didn’t think we should have gone to Iraq in the first place. I think we need to get out of Afghanistan, but it’s also the case that a small number of specialized, special operations forces and intelligence capabilities were the only thing that stood between that part of Syria and what we’re seeing now, which is the beginning of a genocide and the resurgence of Isis.”\n\nWithout naming Gabbard, former VP Joe Biden also appeared to chastise the representative from Hawaii, an Iraq war veteran, for mischaracterizing the reasons for the US involvement in Syria – emphasizing that the US didn’t get involved strictly for a regime change, as she said, but to make sure dictator Bashar al-Assad didn’t commit genocide against his fellow Syrians.\n\nBut Sen. Bernie Sanders schooled everyone when, while other candidates referred to Turkey as an ally, the Senator from Vermont reminded his onstage colleagues and the audience that “Turkey is not a US ally when they invade another country and engage in mass slaughter. The crisis here, as I think Joe [Biden] said and Pete [Buttigieg] said, is when you begin to betray people.”\n\nIt's true that Buttigieg remains a long shot in the race – he’s polling at just above 5 per cent. But if Warren could forgive him for his jabs at her policy positions and proposals, as a VP running mate he could provide the infusion of moderation and youth that some analysts think her campaign is lacking. It’s a long race ahead, after all.", "description": "Pete Buttigieg wasn’t looking to make friends at last night’s Democratic presidential debate; he was to make a standout performance – and he delivered. The South Bend, Indiana mayor had a stellar evening yesterday in Ohio, second only to Sen. Elizabeth Warren.In previous debates, the 37-year-old Afghanistan", "authors": ["Carli Pierson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/7knlnlQ4xhSZEYR2dQIW8g--~B/aD0zNTE7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/8ec4b002fa1b963baef03c252923f281", "published_at": "2019-10-16"}