{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/tommy-robinson-boris-johnson-brexit-corbyn-eu-telegram-post-a9097256.html", "downloaded_at": "2019-09-09 10:25:42.363853+00:00", "title": "Tommy Robinson endorses Boris Johnson", "language": "en", "text": "Jailed far-right activist Tommy Robinson appears to have endorsed Boris Johnson as Britain's prime minister.\n\nThe operators of Robinson’s official Telegram channel, Tommy Robinson News, called on Sunday evening for supporters to “back Boris”.\n\n\"It is refreshing to actually see someone have a pair and stand up for British democracy,\" the message reads. \"21 Tory traitors decided to side with Corbyn and the Labour traitors and try and block the Brexit that the majority of people voted for.\"\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n\"Boris sacked them which was good to see! Amber Rudd resigns - who gives a s***. We back Boris, now just get us out of the EU. Labour are crying that Boris is stealing democracy when in fact he is trying to do what the people voted for.\n\n\"The very same Labour traitors crying that democracy is being stolen are preventing a general election because they know that the people will vote Boris. #BackBoris\"\n\nShape Created with Sketch. Tommy Robinson supporters standoff with police Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Tommy Robinson supporters standoff with police 1/11 Tommy Robinson (Stephen Yaxley-Lennon) supporters in Oxford Street protesting against his prison sentence after he was jailed for nine months for contempt of court PA 2/11 Police chase supporters in order to keep them apart from counter-protesters AFP/Getty Images 3/11 Police confront supporters AFP/Getty Images 4/11 AFP/Getty Images 5/11 AFP/Getty Images 6/11 PA 7/11 AFP/Getty Images 8/11 AFP/Getty Images 9/11 AFP/Getty Images 10/11 PA 11/11 PA 1/11 Tommy Robinson (Stephen Yaxley-Lennon) supporters in Oxford Street protesting against his prison sentence after he was jailed for nine months for contempt of court PA 2/11 Police chase supporters in order to keep them apart from counter-protesters AFP/Getty Images 3/11 Police confront supporters AFP/Getty Images 4/11 AFP/Getty Images 5/11 AFP/Getty Images 6/11 PA 7/11 AFP/Getty Images 8/11 AFP/Getty Images 9/11 AFP/Getty Images 10/11 PA 11/11 PA\n\nAnother message posted later reads: \"Lying elitist scum bags who do not give a s*** about democracy or what the real people voted for. #BackBoris\"\n\nRobinson, whose real name is Stephen Yaxley-Lennon, was jailed last month for contempt of court over a video the anti-Islam activist broadcast on Facebook which featured defendants in a criminal trial.\n\nThe message of support for Mr Johnson came after far-right group the Democratic Football Lads Alliance (DFLA) staged a pro-Brexit rally in London on Saturday.\n\nThe demonstration in Parliament square, attended by around 200 people, saw an altercation with anti-Brexit protesters which led police to intervene.\n\nIt comes amid a crisis in parliament which has seen Mr Johnson rip up constitutional norms in an attempt to give him the freedom to push through a no-deal Brexit.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Inside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nNo 10's latest strategy, revealed by foreign secretary Dominic Raab, will see the government go to court to challenge an order from parliament to delay leaving the EU.\n\nThe showdown in the Supreme Court, likely just days before the EU's 31 October Brexit deadline, is an attempt by ministers to avoid directly breaking the law when compelled to ask for a further Article 50 extension, while also sidestepping the requirement to comply with it.\n\nUnder the terms of the new law, Mr Johnson must request an extension to Brexit negotiations to the end of January next year unless he can secure a deal or parliamentary approval for no-deal by 19 October.\n\nShape Created with Sketch. Protesters take to streets after Boris Johnson suspends parliament Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Protesters take to streets after Boris Johnson suspends parliament 1/11 Anti Brexit protesters march on Whitehall EPA 2/11 Many of the protesters carried placards AP 3/11 A demonstrator wears a Boris Johnson mask during a London rally AFP/Getty Images 4/11 An anti-Brexit demonstrator wields an EU flag during a London rally. AFP/Getty Images 5/11 The protesters also marched to Trafalgar Square, where they blocked traffic AP 6/11 John McDonnell addressed crowds in Whitehall. PA 7/11 A small group of Brexit supporters attempted to stage a counter protest in central London. AP 8/11 Three people were arrested in London, including a woman who sat on the road near Trafalgar Square. AP 9/11 In Oxford, locals and students gathered outside Balliol College, Boris Johnson's alma mater, to protest. PA 10/11 Thousands of people gather in central Glasgow to protest against the prime minister. AFP/Getty Images 11/11 Jeremy Corbyn spoke to protesters in central Glasgow. Getty 1/11 Anti Brexit protesters march on Whitehall EPA 2/11 Many of the protesters carried placards AP 3/11 A demonstrator wears a Boris Johnson mask during a London rally AFP/Getty Images 4/11 An anti-Brexit demonstrator wields an EU flag during a London rally. AFP/Getty Images 5/11 The protesters also marched to Trafalgar Square, where they blocked traffic AP 6/11 John McDonnell addressed crowds in Whitehall. PA 7/11 A small group of Brexit supporters attempted to stage a counter protest in central London. AP 8/11 Three people were arrested in London, including a woman who sat on the road near Trafalgar Square. AP 9/11 In Oxford, locals and students gathered outside Balliol College, Boris Johnson's alma mater, to protest. PA 10/11 Thousands of people gather in central Glasgow to protest against the prime minister. AFP/Getty Images 11/11 Jeremy Corbyn spoke to protesters in central Glasgow. Getty\n\nBut Mr Johnson's “plan B” paves the way for an unprecedented political crisis after the 19 October date – with the threat of the prime minister being jailed for contempt of court.\n\nWith the deadline for crashing out on 31 October, it will be a race against time to force Mr Johnson to Brussels before Halloween, or to bring him down in a vote of no confidence and send a replacement.", "description": "Jailed far-right activist Tommy Robinson appears to have endorsed Boris Johnson as Britain's prime minister.  The operators of Robinson’s official Telegram channel, Tommy Robinson News, called on Sunday evening for supporters to “back Boris”.", "authors": ["Tom Embury-Dennis"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/07/10/12/tommy-robinson-0.jpg", "published_at": "2019-09-09"}