{"pub": "yahoo", "url": "https://yahoo.com/entertainment/shay-mitchell-reveals-she-suffered-130006641.html", "downloaded_at": "2019-10-04 17:08:24.269337+00:00", "title": "Shay Mitchell Reveals She Suffered from a 'Severe Depression' Before Going Public with Pregnancy", "language": "en", "text": "Shay Mitchell isn’t afraid to reveal that she felt “extremely lonely” during the time she kept her pregnancy private.\n\nThe Pretty Little Liars alum, 32, didn’t announce the news of her first child on the way until she was five months along in June — a decision that was “super isolating” and caused her to go through a “severe depression,” she told maternity lifestyle brand HATCH in a new interview.\n\n“I previously had a miscarriage and that experience gave me anxiety about sharing the news of this pregnancy with anyone outside of our parents,” Mitchell admitted. “With the first pregnancy, I was elated and told everyone at eight weeks. However, I wanted to be sure that this second pregnancy would be viable before shouting it from the rooftops, so I hid it for nearly six months and became very antisocial.”\n\n“Usually, I’m incredibly active and outgoing, but instead, I mainly stayed home to avoid stares and questions. I was extremely lonely,” Mitchell said.\n\nWant all the latest pregnancy and birth announcements, plus celebrity mom blogs? Click here to get those and more in the PEOPLE Parents newsletter.\n\nShay Mitchell | Hatch More\n\nRELATED: Pregnant Shay Mitchell Shows Off Baby Bump on Red Carpet, Says She’ll Take “No Maternity Leave”\n\nThe star explained that by not telling anybody about her pregnancy as she was noticeably gaining weight, she was “paranoid” that her team was judging her and thinking she should “hit the gym,” which contributed to her loneliness.\n\nAs Mitchell revealed that she suffered from “prepartum depression,” she remains curious why it remains a topic that is rarely discussed.\n\nHatch More\n\n“As long as I can remember, I’ve heard about postpartum depression. However, to be depressed at the beginning came as a shock,” she said. “The isolation and anxiety I experienced was crippling. I thought I was going out of my mind and questioned why nobody ever talked to me about this phase.”\n\n“I’ve been fortunate since sharing the news of my pregnancy to have some amazing conversations with other pregnant women and moms and know that all these feelings are ‘normal,’ so now we just need to normalize them by discussing more openly!” Mitchell added.\n\nShay Mitchell | Hatch More", "description": "Pregnant Shay Mitchell Says She Suffered 'Severe Depression'", "authors": ["Georgia Slater"], "top_image": "https://s.yimg.com/uu/api/res/1.2/PJ63PQpRV.6NPzLkHo5lBQ--~B/aD02MzA7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/people_218/c903ffce3d888be5f4646a2b57be77e2", "published_at": "2019-10-04"}