{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/brian-wilson-the-zombies-1968-concert-something-great", "downloaded_at": "2019-10-05 12:24:27.550840+00:00", "title": "Brian Wilson and the Zombies in Concert: Something Great from 1968", "language": "en", "text": "(Pixabay)\n\nFun, fun, fun with the heart and soul of the Beach Boys.\n\nNineteen sixty-eight was a year of cataclysms in the United States and the Western world. We endured the assassinations of MLK and RFK, the Vietnam war raged and polarized the nation, and rioting engulfed multiple American cities, while the Soviets saw their chances and took them by invading Czechoslovakia, deposing leaders who favored limited freedoms and replacing them with loyal totalitarians.\n\nAdvertisement\n\nAdvertisement\n\nWhat, then, was so great about 1968? Two noteworthy rock-and-roll bands with numerous hits back then, now touring together, that’s what. The present-day collaborators, 51 years later, are the Zombies, from Britain, and California-raised musical icon Brian Wilson, founder of the Beach Boys. Hence the theme of the Zombies–Brian Wilson U.S. tour: Something Great from ’68.\n\nThe concert took place at the landmark Beacon Theater on Manhattan’s Upper West Side, the ground-zero neighborhood for “progressive” politics, as evidenced by the long career of Representative Jerrold Nadler. Some in the audience wore their political viewpoints on their heads and T-shirts. But in perhaps an unintentional nod to Laura Ingraham’s “Shut up and sing” counsel, there were no political pronouncements from the stage at all.\n\nOpening the festivities were the Zombies, 2019 inductees to the Rock and Rock Hall of Fame. Two of the band’s original five members, now both 74, led the group to the stage. Rod Argent is the composer of most Zombie songs, and is quite a keyboardist, demonstrating his dexterity on the organ, piano, harpsichord, and mellotron. Many vocalists lose their range at much younger ages, but lead singer Colin Blunstone impressively replicated his portions of the group’s mega-hits from the Sixties.\n\nAdvertisement\n\nThe band offered some of their catchy newer songs, written by Mr. Argent. Repeating a pattern we’ve seen at concerts over the decades, the old hits were what brought the crowd to its feet. “Tell Her No,” “Time of the Season,” and “She’s Not There” took Baby Boomers like me back to our youth, and these renditions were as close to the original 45-rpm vinyl recordings as is humanly possible.\n\nAdvertisement\n\nNext came the main attraction, Brian Wilson, accompanied by original Beach Boy Al Jardine, some-time Beach Boy Blondie Chaplin, and a truly impressive eleven-piece band. Brian’s cousin, Mike Love, who has the rights to the Beach Boys name, leads his own first-rate group playing the same tunes. If you like the Boys’ music, you’ll enjoy both bands. In 2012, Brian Wilson and his group reunited with cousin Mike’s Beach Boys for a memorable tour, but they then again went their separate ways. There was talk of the two groups reuniting, but that hasn’t happened as of this writing.\n\nAdvertisement\n\nThe theater’s stage hands quickly exchanged the Zombies’ drum set and equipment for those of Brian Wilson and his band, including the white piano behind which he sat and sang for the concert. As the ensemble members strode to their appointed places on the stage, everyone rose to their feet. Then came Brian Wilson, pushing an unexpected walker and triggering an ear-piercing ovation from 3,000 fans. As he was assisted to his seat, the applause and cheers continued.\n\nDuring the summer, Wilson cancelled some of his tour dates, explaining that his recovery from three recent back surgeries was an ongoing challenge for him. But in his statement he elaborated that he also had been feeling “mentally insecure,” and adding that “it is no secret that I have been living with mental illness for many decades.” In his autobiography, I Am Brian Wilson, he acknowledged his anxiety and other demons, past use of drugs, and coercive relationships with his father and, decades later, with [[Correct?]] a psychotherapist.\n\nAdvertisement\n\nAdvertisement\n\nWilson is still gripped by stage fright before every concert and calms down only when the music commences. At that moment, we are all transported by Wilson’s lyrics, the singers’ harmonies, and some of the finest guitarists, percussionists, and keyboarders anywhere. His “Good Vibrations” has been praised as the best-produced rock recording of all time, and the “Pet Sounds” album was ranked No. 2 on Rolling Stone magazine’s list of the top 500 albums of all time.\n\nAl Jardine did most of the speaking for the group from the stage, so we can surmise that Brian wasn’t feeling up to his traditional role. Future concert attendees should not expect Brian Wilson to hit his famous high notes from the 1960s. He kicked off most songs with his deeper, 77-year old voice but was then soon complemented by harmonies and accompaniment from the others. Al’s son Matthew Jardine positively emulated Brian’s old higher-pitched lyrics. Sorry to echo my own comment about the Zombies, but for Brian and many other rock and roll bands, it’s the old hits from the ‘60s and ’70s that get the audience stomping and cheering.\n\nAdvertisement\n\nEven if you have no yearning for songs about surfing, muscle cars, and love in California, it’s difficult to imagine someone not being moved and set to toe-tapping by the uniquely American “Fun, Fun, Fun,” “Good Vibrations,” “California Girls,” “Help Me, Rhonda,” “Wouldn’t It Be Nice” (Paul McCartney’s favorite non-Beatles tune), and many others.\n\nAdvertisement\n\nConsider that last song, written in the midst of the sexual revolution: The teen male singer laments that his age prevents him from marrying his dream girl. “Oh, we could be married . . . And then we’d be happy . . . Wouldn’t it be nice?” young Brian first intoned. Imagine a paean to marriage in 2019! We rarely hear one from our pulpits.\n\nAdvertisement\n\nThese ditties were the soundtrack of the 1960s and ’70s, and not just in the United States. The Beach Boys and Brian Wilson sold out concert halls on all the populated continents. One Boomer friend in Berlin volunteered that he enjoyed his first kiss as a Beach Boys tune was playing on his German radio station.\n\nWith all the focus today on mental health and how best to get care to those in need, Brian Wilson deserves our admiration for his honest elucidation of the anxiety and other disorders he faces and stares down on a daily basis. For millions, he is a genuinely sympathetic figure and a living public example of someone who is “working it through,” as they say. Let’s hope this American musical genius can continue bringing his sublime American sounds to a venue near you.", "description": "Fun, fun, fun with the heart and soul of the Beach Boys.", "authors": ["Herbert W. Strupp", "Andrew C. Mccarthy", "Alexandra Desanctis", "Kevin D. Williamson", "John Yoo", "Kyle Smith", "David French", "Mairead Mcardle", "Victor Davis Hanson", "Madeleine Kearns"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/electric-guitar.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-05"}