{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/pence-seeks-to-dodge-impeachment-spotlight-as-his-ukrainian-moves-attract-notice/2019/09/26/d397bdea-e07a-11e9-be96-6adb81821e90_story.html", "downloaded_at": "2019-09-27 01:31:08.091261+00:00", "title": "Pence seeks to dodge impeachment spotlight as his Ukrainian moves attract notice", "language": "en", "text": "Vice President Pence listens as President Trump speaks from the Diplomatic Reception Room at the White House on Aug. 5. (Jabin Botsford/The Washington Post)\n\nAs President Trump fumed Thursday about a whistleblower complaint that accused him of abusing his power and endangering national security, Vice President Pence was in his home state, sticking to the script.\n\n“I came to Indiana to say it’s time for Congress to pass the U.S.-Mexico-Canada Agreement, and pass it this year,” Pence said at an Indianapolis machinery plant, where he touted a trade deal that has been put on the congressional back burner amid an impeachment inquiry into alleged misconduct by Trump.\n\nEven as Pence distanced himself from the impeachment saga playing out in Washington, his penchant for sidestepping the Trump administration’s most controversial episodes is perhaps facing its greatest test thus far. Congress is preparing to mount an aggressive probe into allegations that Trump pressured Ukraine to interfere in the 2020 elections and that the White House sought to cover it up — and Pence’s dealings with Ukraine have already become part of the focus.\n\nPence did not participate in a controversial July 25 phone call in which Trump pushed Ukrainian President Volodymyr Zelensky to investigate former vice president Joe Biden and his son, according to a senior administration official who spoke on the condition of anonymity to discuss internal deliberations.\n\nBut Pence’s name has emerged in several other contexts — including as a potential successor should Trump be ousted from office — since Democrats announced this week that they were launching a formal impeachment inquiry.\n\nThe whistleblower complaint, released Thursday, said Pence canceled a planned trip to Ukraine at the direction of Trump, who was seeking to pressure the Ukrainians to help him politically.\n\n\n\nTrump speaks with Pence during a ceremony in the Rose Garden on Aug. 29. (Jabin Botsford/The Washington Post)\n\nThree people familiar with the matter confirmed that Pence’s attendance had been requested at Zelensky’s inauguration and that his office had looked at dates for a visit to Kiev.\n\n“I learned from U.S. officials that, on or around 14 May, the President instructed Vice President Pence to cancel his planned travel to Ukraine to attend President Zelenskyy’s inauguration on 20 May,” the unidentified whistleblower wrote in the report, which alleges a pattern of misconduct by Trump and some of his top aides.\n\nThe canceled Pence trip was listed among several moves taken by Trump that may have been part of “an overall effort to pressure the Ukrainian leadership.”\n\nA senior administration official said a trip was never officially scheduled and no advance staff had traveled to Ukraine to prepare for a Pence visit. However, it was standard practice for Pence to get Trump’s approval before traveling abroad, according to people familiar with the matter.\n\n“As is our practice, we don’t comment on any conversation between the president and the vice president,” said Marc Short, Pence’s chief of staff.\n\nTrump himself reminded reporters Wednesday that Pence has had extensive conversations with Ukrainian officials during the same time period covered in the whistleblower complaint.\n\n“And I think you should ask for VP Pence’s conversation, because he had a couple conversations also,” Trump told reporters Wednesday as he faced questions about the July 25 phone call. “They’re all perfect.”\n\nTrump’s comments — which administration officials said were not seen internally as trying to undermine Pence — set off a debate inside the administration about whether to release the vice president’s transcripts. While some in the White House were concerned about precedent, others argued that Pence’s conversations with Zelensky were appropriate and contain nothing alarming, and would be reassuring to those worried about the U.S.-Ukraine relationship, according to a person familiar with the matter.\n\nIn forceful language, the whistleblower described Trump’s phone call as the centerpiece of a broader effort by the Trump White House to “solicit interference from a foreign country in the 2020 U.S. election.” The whistleblower said Trump’s overtures to Zelensky were seen as so politically problematic that White House lawyers directed other officials to remove the electronic transcript of the conversation from the computer system where it was stored and load it onto a separate system meant for classified information.\n\nThe White House has said Trump did nothing wrong.\n\nPence is one of few officials who would be high-ranking enough to have access to many of Trump’s phone calls with foreign leaders. When Trump canceled a trip to Poland where he was scheduled to meet with Zelensky, he sent Pence in his place.\n\nThe vice president’s Sept. 1 meeting with Zelensky, and his discussions with Trump, will be key targets for House Democrats seeking to determine if the White House tried to leverage nearly $400 million in military aid to force a Ukrainian investigation into Biden. The White House released the aid earlier this month after a weeks-long delay ordered by Trump.\n\nPence told reporters after the meeting that he had not discussed Biden with Zelensky but said that he had relayed Trump’s “great concerns about issues of corruption.”\n\nThe impeachment inquiry could test Pence’s role as a Zelig-type figure who has thus far sidestepped much of the controversy in a White House plagued by infighting, devastating leaks, indictments and intrigue. In the far-ranging investigation into Russian election interference and potential obstruction of justice by Trump, Pence was never interviewed by special counsel Robert S. Mueller III.\n\nPence has managed to stay just a step removed from the drama, said Michael Steel, a Republican strategist who worked under former House speaker John A. Boehner.\n\n“He’s always in asbestos underwear. He’s close to the fire but never gets burned,” he said. “He’s done an incredible job always being out front as a loyal soldier to the president, without ever taking a bullet himself.”\n\nThe vice president has defended Trump against allegations of misconduct with Ukraine, telling Fox Business Network’s Lou Dobbs on Wednesday that Trump “did nothing wrong” and “has been completely vindicated.”\n\nDuring his remarks in Indianapolis, Pence did not directly address the whistleblower complaint, but he accused Democrats of being focused on “baseless accusations.”\n\n“I’m here to make you a promise — whatever the Democrats and their allies want to spend their time on, President Donald Trump and I are going to stay focused on the issues that matter most to you,” he said.\n\nPence’s decision to stay focused on policy rather than impeachment is a way to inoculate himself against the scandals surrounding the president, said Doug Heye, a Republican strategist and former spokesman for the Republican National Committee.\n\n“That’s the smart thing to do,” Heye said.\n\nRussell Riley, a presidential historian at the University of Virginia’s Miller Center, said Pence’s cautious approach was reminiscent of vice president Al Gore during Bill Clinton’s impeachment in 1998.\n\n“There is a conundrum with being the vice president of the United States in a controversial administration, because everybody knows that you are the heir apparent in case something happens,” he said. “You have to be exceedingly guarded.”", "description": "The vice president’s name has emerged in several contexts since Democrats announced they were launching a formal impeachment inquiry.", "authors": ["Toluse Olorunnipa", "White House Reporter", "Ashley Parker", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/HxfqMUrH9G8DNZeSz9K2-8k8kvo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3FDYHCVXSII6TDUDJZTIP2MYCQ.jpg", "published_at": "2019-09-26"}