{"pub": "marketwatch", "url": "https://mansionglobal.com/articles/novelist-george-eliots-former-south-london-home-asking-2-8m-207678", "downloaded_at": "2019-09-26 23:46:37.972133+00:00", "title": "Novelist George Eliot’s Former South London Home Asking £2.8M", "language": "en", "text": "Holly Lodge, a three-story brick row house in Putney, London, and former residence of renowned novelist George Eliot, hit the market Thursday asking £2.795 million (US$3.44 million).\n\n\n\nMary Ann Evans, better known by her pen name George Eliot, moved into the spacious terraced house on Wimbledon Park Road in early 1859. It was there, in the sun-filled house with views over South London and its own spacious garden, that she wrote her second book, a semi-autobiographical novel “The Mill on the Floss,” according to English Heritage, a historical body that bestowed the blue plaque honoring Eliot on the house in 1905.\n\n\n\nEliot initially wrote under a pseudonym in part to protect her work from her somewhat scandalous private life as the partner of a married man, writer and critic George Henry Lewes.\n\n\n\nMore: Dusty Springfield’s Former London Home Now Asking £11.5 Million\n\nInitially, she expected to live at Holly Lodge for many years, finding the house “very comfortable, with far more of vulgar indulgences in it than I ever expected to have again,” she wrote to a friend, according to a record from English Heritage.\n\n\n\nBut as her professional fame—and personal notoriety—grew, she found the home, among streets of snugly built row houses, a little too exposed. In her own words, Holly Lodge was overlooked by “houses full of eyes” and she and Lewes moved to a large detached property in Marylebone in late 1860.\n\n\n\nToday, Holly Lodge remains true to Eliot’s description: “a tall cake, with a garnish of holly and laurel.” Built over four levels, the home has spacious interiors with vistas from a rooftop patio and a lush landscaped 75-foot-long rear garden, according to the listing with Savills.\n\n\n\n“This gorgeous period house has it all: period charm and features in abundance, light contemporary living space throughout, ample off-street parking and a wonderful garden and terrace,” said property agent Alex Howard Baker.\n\n\n\nThe house, which last traded hands for £1.2 million in 2006, spans roughly 3,500 square feet, including five bedrooms. The lower floors have been opened up in a modern way, including an open kitchen on the lower ground floor and a vast single reception room with two fireplaces on the next floor up.\n\n\n\nFrom Penta: Global UHNW Population Flatlines, Combined Wealth Declines for the First Time in Three Years\n\nThere’s also a sunroom, study and two stairwells, “a very unusual feature at this price range,” according to the listing.\n\n\n\nMr. Baker added: “The blue plaque and its special historical context rounds it all off quite beautifully.”\n\n", "description": "", "authors": ["Beckie Strum"], "top_image": "https://images.mansionglobal.com/im-111411?size=1.673202614379085&width=1280", "published_at": "2019-09-26"}