{"pub": "cnbc", "url": "https://cnbc.com/2019/10/26/meet-the-former-vc-leading-robinhood-in-effort-to-disrupt-wall-street.html", "downloaded_at": "2019-10-27 00:02:43.608969+00:00", "title": "Meet the former Google executive leading Robinhood in an uphill battle of disrupting Wall Street", "language": "en", "text": "Robinhood COO Gretchen Howard Source: Colson Griffith Photography.\n\n(This story is part of the Weekend Brief edition of the Evening Brief newsletter. To sign up for CNBC's Evening Brief, click here.) It was early January — just one month after stock-trading start-up Robinhood announced a failed checking and savings product. It was also Gretchen Howard's first day on the job. In the 11 months since, Robinhood has re-launched its cash account, expanded to the U.K. and doubled its employee count. Additionally, its no-fee model has caught on with major brokerage firms, including Charles Schwab, TD Ameritrade, Fidelity, to slash commissions to zero in early October. Howard, a former Google executive and venture capital partner, left her coveted role in Silicon Valley to join the fast growing start-up as vice president of operations. The job description meant guiding a young company through a highly regulated industry and working towards the lofty goal of \"democratizing finance.\" Friends and former colleagues say Howard seems to thrive on the ground floor with her sleeves rolled up, figuring out what went wrong and how to fix it. She was quickly promoted to chief operating officer, helping grow the $7.6 billion startup in the high-stakes world of financial services. \"It was almost motivating when I started,\" 46-year-old Howard told CNBC at Robinhood's Menlo Park, California offices. \"When I joined in January, it was very much about learning from those mistakes, and moving forward to remedy the situation.\" Howard's path is not typical of venture capitalists. They don't usually leave their jobs as partner to go to start-ups. It's usually the other way around. But her path to VC wasn't typical, either. With a degree in history, she started as a coder in a computer language that no longer exists. Howard made her way to Harvard Business School, then Fidelity, then to the west coast to what's now a wildly successful arm of Google: Sheryl Sandburg's team in AdWords. She later moved to Google's late-stage venture capital arm, and is settling in as one of the highest ranking executives at the stock-trading start-up.\n\nTitle IX\n\nHoward grew up in West Hartford, Connecticut playing hockey and lacrosse and eventually made it to Williams College to compete in both. Hockey was still a club sport, despite playing against other nationally ranked NCAA teams. She wrote her January mid-term paper on Title IX, using data to argue that the women's hockey team deserved to be funded and integrated as a varsity sport. The administration agreed, and the team just celebrated its 25th anniversary in the NCAA. The former team captain is now a trustee at her Alma mater. With a liberal arts education and a history major, she took a shot at computer coding at Andersen Consulting, which was later bought by Accenture. She eventually landed at Harvard Business School right before the dotcom bubble burst. An internship at Fidelity evolved to a full-time job at the Boston-based brokerage firm, which Robinhood is now competing with. Lexi Reese, now COO at another Silicon Valley start-up, Gusto, met Howard on her first day of business school in Cambridge, Massachusetts. Her new car had broken down, and smoke was billowing out from under the hood. Howard walked right up to Reese and asked if she needed help. \"Crisis management is a sweet spot for her — when others get crazy, she gets calm and she gets very focused,\" she said. Reese said in that sense, Howard's move to Robinhood was perfect. While she had to reconcile with leaving a comfortable venture capital job for the risk of a start-up, Howard is a \"consummate operator\" who thrives \"rolling up sleeves,\" thinking at really high speeds, and building things. While at Fidelity, Howard relocated to the West Coast with her husband. She decided to look for new opportunities, and landed at Google in 2006 in its AdWords section, which ended up being one of the tech giants' most well-known businesses. She helped launch and scale the ad products, rising to managing director in global business operations where she worked alongside Sheryl Sandberg, who is now chief operating officer at Facebook. \"Google was in hyper growth mode — we were figuring out how do we maintain quality and scale at the same time,\" Howard said. \"It was an amazing time to be there.\" Howard eventually moved to Google's late-stage venture capital arm, now called CapitalG. She was one of four partners, in charge of building the fund's operations and working with portfolio companies. CapitalG writes large checks to start-ups that already have a proven use case. As Howard put it, it's a \"creative way for Alphabet to do something with their cash.\" She helped advise leaders of companies like Lyft, Airbnb, Credit Karma and Robinhood. \"She's not afraid to ask and just pushes to get things done — she has a knack for looking at a problem and breaking it down,\" said David Lawee, partner and founder of CapitalG who first met Howard at Google. \"She's not one to shy away from identifying problems, which are inherent in a fast growth business.\" Lawee pointed to her ability to lead a team. As Lawee put it, there's no job she views as too junior to do. \"She just does what it takes — that's very much a sports orientation.\" Based on that skill set, Lawee said a COO role seemed like a natural transition for Howard. She had worked closely with a number of portfolio companies, and \"had her pick\" in terms of which role to consider. Howard started working with Robinhood co-founders and co-CEOs Vlad Tenev and Baiju Bhatt after CapitalG participated in their Series D funding round. CapitalG would often leverage Google's internal expertise. In this case, she helped Robinhood do a deep dive with the tech giant's cyber security experts. She talked to the founders about other issues — including its lack of a chief financial officer. Howard helped bring in Amazon veteran Jason Warnick as its first-ever CFO. But they were still missing a chief operating officer. Tenev said Howard was the obvious choice. As an investor, she had been eager to dive in with the start-up and help it scale — not something all of their financial backers were equipped to do. He floated the possibility of Howard Joining them for the role. The process was \"not easy\" and the founders needed to \"put their best foot forward,\" he said. They lined up conversations throughout the company to make sure she was comfortable with it. For Howard, the growth potential was the real pull. Robinhood had jumped from 4 million to 6 million customers in a matter of months, something she said she had never seen before. Still, she had to convince herself, and her family, that it was the right decision. Howard was adding a painstaking commute from San Francisco to Robinhood's Menlo Park offices, and was leaving one of the most high-profile venture jobs in the Valley. \"The closest thing I can compare Robinhood to is when I joined Google in 2006,\" she said. \"I wanted to be a part of building it.\"\n\n'Resetting' after checking & savings", "description": "Gretchen Howard, a former Google executive and venture capitalist, is now leading Robinhood in an uphill battle of disrupting Wall Street.", "authors": ["Kate Rooney"], "top_image": "https://image.cnbcfm.com/api/v1/image/106201582-1571932373240gretchen-howard-headshot.jpg?v=1571932453", "published_at": "2019-10-26"}