{"pub": "marketwatch", "url": "https://marketwatch.com/story/trump-complains-ecb-rate-cut-will-hurt-us-and-mnuchin-doesnt-disagree-2019-09-12", "downloaded_at": "2019-09-12 23:35:04.794374+00:00", "title": "Trump complains ECB rate cut will hurt U.S. and Mnuchin doesn’t disagree", "language": "en", "text": "Associated Press President Donald Trump thinks U.S. trading partners are manipulating their currencies.\n\nPresident Donald Trump complained Thursday about the European Central Bank’s latest massive monetary stimulus measures, saying the easing was designed to strengthen the U.S. dollar and would hurt U.S. exports.\n\n“They are trying, and succeeding, in depreciating the Euro against the VERY strong Dollar, hurting U.S. exports,” Trump wrote.\n\nEuropean Central Bank, acting quickly, Cuts Rates 10 Basis Points. They are trying, and succeeding, in depreciating the Euro against the VERY strong Dollar, hurting U.S. exports.... And the Fed sits, and sits, and sits. They get paid to borrow money, while we are paying interest! — Donald J. Trump (@realDonaldTrump) September 12, 2019\n\nAsked for his comments on the president’s overt complaints about the strength of the U.S. dollar, Treasury Secretary Steven Mnuchin said: “There is a lot of validity to the things he is saying.”\n\n“We’ve been focused on a stable dollar. That is something over the longer term, a stable dollar is important to the U.S. government,” Mnuchin said.\n\nIn Thursday mornings ECB press conference, the eurozone central bank president, Mario Draghi, responded to the tweet by Trump saying, “We do not target the exchange rate, period.”\n\nThe euro EURUSD, -0.0271% fell versus the dollar, hitting a two-year low, after the ECB pushed its key interest rate further into negative territory, announced the relaunch of its bond-buying program and took other steps to stimulate a flagging eurozone economy.\n\nRead: ECB cuts rate, restarts QE\n\nTrump also used the ECB decision to take another shot at the Federal Reserve, saying the ECB was acting quickly while the Fed was taking a more cautious approach.\n\nOn Wednesday, Trump called the Fed “boneheads” and said they should cut its benchmark rate to zero or negative.\n\nMnuchin said that negative interest rates might not help the euro-zone resuscitate its economy because such low rates make it much harder for banks to make a profit.\n\n“It is very hard for banks to make money in negative interest rates and if banks can’t make money it is hard to have a good economy,” he said.\n\nMnuchin wouldn’t comment about whether the Fed should push for negative interest rates.\n\nEconomists said they don’t think Trump understands that negative rates are a sign of a weak economy.\n\nSee also: Dear Mr. President, why is it a good thing if a 10-year Treasury note is worth less than a bag of dirt?", "description": "President Donald Trump reacted quickly and negatively to Thursday’s ECB interest rate cut and U.S. Treasury Secretary Steven Mnuchin, in a subsequent TV...", "authors": ["Greg Robb", "Senior Economics Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HL959_19trum_ZG_20190622131020.jpg", "published_at": "2019-09-12"}