{"pub": "cbc", "url": "https://cbc.ca/news/canada/ottawa/run-ottawa-executive-director-1.5272336", "downloaded_at": "2019-09-08 11:41:01.160574+00:00", "title": "Ian Fraser named new head of Run Ottawa | CBC News", "language": "en", "text": "Run Ottawa, the organization behind Ottawa Race Weekend, has a new face at the head of the pack.\n\nCoach and former elite triathlete Ian Fraser, the entrepreneur behind Ottawa's Cyclelogik bike shop, has been appointed as the organization's executive director and race director.\n\n\"It's a big responsibility, and I think it's such an iconic organization,\" Fraser told Alan Neal, host of CBC's All In A Day. \"[Ottawa Race Weekend is] such an amazing event that I just eventually couldn't say no.\"\n\nFraser replaces longtime director John Halverson, who stepped down in the spring.\n\nA pace runner leads Hiwot Gebrekidan of Ethiopia, second from left, Gelete Burka of Ethiopia, second from right, and Lucas McAneney of Canada across the Alexandra Bridge in front of Parliament Hill during the Ottawa Marathon on Sunday, May 27, 2018. (Justin Tang/Canadian Press)\n\nDeclining numbers\n\nOne of Fraser's biggest challenges will be finding a way to reverse the race weekend's declining numbers.\n\nSince the event's 40th anniversary in 2014, which saw about 48,000 runners lace up, participation has dropped dramatically, falling to 33,000 in 2018 and even fewer this year.\n\nFraser said tying in more local activities could help attract more runners from out of town.\n\n\"Runners are looking for a different kind of experience in some way, so they're looking at something that's going to complete the entire weekend,\" he said.\n\nHe's well known in Ottawa as the entrepreneur behind the Cyclelogik Bike Shop...Now the coach and former elite triathlete, Ian Fraser, has accepted one more responsibility...to lead Run Ottawa as executive director. 10:47\n\nFraser, who was born and raised in Ottawa, began running when he was just eight years old, and has enjoyed a long relationship with the race weekend.\n\n\"I probably haven't gone more than 10 days without running in the last 46 years, so I'm still pretty connected,\" Fraser said.\n\nHis first marathon was right here in Ottawa back in the late 1980s.\n\n\"I remember being so nervous,\" he said. \"I remember getting new running shoes [and] doing all the things you shouldn't do before your first marathon.\"\n\nThe shoes were a bad idea, as he quickly discovered soon after the race started.\n\n\"About 10 minutes later the wheels fell off and I had blisters,\" he said. \"It was an interesting first experience, but I loved it. I was hooked.\"\n\nIan Fraser says he's sad to bid farewell to the various businesses he's been involved with, including Ottawa bike shop Cyclelogik. (Robyn Miller/CBC)\n\nFraser begins his new job on Monday.\n\nRun Ottawa is a not-for-profit organization that organizes more than 20 running events throughout the year.", "description": "Run Ottawa, the organization behind Ottawa Race Weekend, has a new face at the head of the pack.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5272618.1567727547!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/ian-fraser.jpg", "published_at": "2019-09-08"}