{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/public-safety/former-virginia-governor-mcauliffes-car-stolen-in-dc-he-says/2019/09/23/625440f8-de6e-11e9-8dc8-498eabc129a0_story.html", "downloaded_at": "2019-09-24 13:43:18.237283+00:00", "title": "Former Va. governor McAuliffe reports his car stolen in D.C.", "language": "en", "text": "Former Virginia governor Terry McAuliffe said his car was stolen Monday in Washington.\n\n“Went in for lunch … came out and car was stolen,” McAuliffe wrote on Twitter.\n\nA report from D.C. police said McAuliffe, a resident of Northern Virginia, had parked a Ford Explorer about 1 p.m. in the 900 block of Sixth Street NW. When he returned to the spot at 2 p.m., the vehicle was gone, the report said.\n\nMcAuliffe said police were “right on it,” and the vehicle was “recovered immediately.”\n\nPolice said the vehicle was found parked and unoccupied on K Street NW, just west of North Capitol Street. The site is a little more than a half-mile from where the vehicle was parked initially.\n\nIt was not immediately clear who took the Explorer or why.\n\n\n\nFormer Virginia governor Terry McAuliffe (D) speaks at Politics and Prose in Washington on Aug. 1. (Evelyn Hockstein for The Washington Post)\n\n“Thank you for a job well done,” McAuliffe tweeted to D.C. police.\n\nMcAuliffe (D) was governor from 2014 to 2018.\n\nA spokesman for the former governor said McAuliffe was on his way to a party connected to his new book, “Beyond Charlottesville: Taking a Stand Against White Nationalism.”\n\nAccording to the spokesman, Jake Rubenstein, the only thing that upset McAuliffe was that whoever took the car “didn’t think to grab a few copies” of the book.\n\nRead more:\n\nLocal newsletters: Local headlines (8 a.m.) | Afternoon Buzz (4 p.m.)\n\nLike PostLocal on Facebook | Follow @postlocal on Twitter | Latest local news", "description": "Police recovered the vehicle quickly and close by.", "authors": ["Martin Weil", "Local Reporter", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/IgoCOOj7iQFQ0ZmhcSovmCIwodI=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FQ7QY6FHAEI6RLLPBADXBXG5YI.jpg", "published_at": "2019-09-23"}