{"pub": "nyt", "url": "https://nytimes.com/2019/09/16/science/hair-dna-murder.html", "downloaded_at": "2019-09-17 08:25:00.509423+00:00", "title": "Why This Scientist Keeps Receiving Packages of Serial Killers’ Hair", "language": "en", "text": "While reading a newspaper, she stumbled across something that excited her. It was the word “hair” in an article about a tiny coffin found in a San Francisco couple’s yard. While renovating, they had unearthed the remains of a mystery child in a white embroidered dress, who had likely died in the early 1900s. Volunteers had identified likely family. And using her hair, Dr. Green had confirmed that they were related.\n\nAt that time, Dr. Rae-Venter was working with authorities in New Hampshire to identify a woman and three girls found in barrels in a state park. The bodies had been exposed to decades of sunlight and water, degrading the DNA, even in their bones.\n\n“Suddenly here was the solution,” she said.\n\nSi nce then, many articles and a podcast series have been dedicated to the case, known as the Bear Brook murders. But when the hair first arrived at his lab, Dr. Green knew little beyond the fact that another lab had failed to get what was needed.\n\nOnce Dr. Green had the locks in hand, his team rinsed them in a bleach solution. The novel part came next. Traditional forensic labs do work with old and rootless hair. They have a technique to obtain mitochondrial DNA — which is passed from mother to child. At most it could tell them whether the source of one hair is related to the source of another.\n\nIn order to identify a person, nuclear DNA is required. Traditional methods can get it out of hair with a root, though if it fell out more than a week ago it could be a problem , said Suzanna Ryan, a forensic consultant and lab director. “Hairs need to be in a growth stage in order to obtain nuclear DNA,” she said.\n\nThrough his previous work , Dr. Green knew that wasn’t necessarily true.\n\nIn 2005, he was part of a team at the Max Planck Institute in Leipzig, Germany, which developed an advanced genetic sequencing technology to read DNA extracted from fossilized bones. In 2010, he was involved in sequencing the entire N eanderthal genome from shards of bone that were at least 38,000 years old.", "description": "Getting sufficient DNA out of a rootless hair has long been considered impossible. A scientist, better known for work with ancient fossils, has figured it out. It’s a game-changer for crime and surveillance.", "authors": ["Heather Murphy"], "top_image": "https://static01.nyt.com/images/2019/06/19/science/19xp-hair/19xp-hair-facebookJumbo.jpg", "published_at": "2019-09-16"}