{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/fallout-76s-paid-subscription-service-has-not-had-a-good-launch", "downloaded_at": "2019-10-24 23:51:22.964735+00:00", "title": "Fallout 76's Paid Subscription Service Has Not Had A Good Launch", "language": "en", "text": "Part of Fallout 76's controversial new paid subscription service Fallout First is the addition of an unlimited Scrap Box, which is somewhere players can store all of their junk. Problem being that some players are finding that the Scrap Box is bugged in the worst way possible: they’re losing everything they put into it.\n\nThere have been multiple reports over the past day, both on Reddit and the game’s support forums, of paid subscribers putting loads of scrap into the box, going on with their game, accessing the box to get some of it back and finding it was all gone.\n\nWhile Bethesda investigates this—they currently believe it’s an interface issue—current support advice is to “try opening another player’s scrap box on a public server”, which “may help in getting the items to show up again”. And if that doesn’t work, they’re suggesting “restarting the game client” or “uninstalling and reinstalling the game”.\n\nThe bottomless, scrap-eating Scrap Box isn’t the only busted introduction as part of Fallout First, either. The launch of private servers was meant to be one of the service’s main draws, but they’re not quite as private as many were hoping.\n\nInstead of being completely walled-off, invite-only servers, if you start a Fallout 76 private server anyone on your friends list can just walk right on in. For people who have done a lot of trading, friending someone only to swap some gear, that’s...not ideal.\n\nA Bethesda rep told Polygon “we understand this is not what players expected for their Private Worlds”, before adding “We are looking to provide an option in an upcoming patch that will allow Fallout 1st members to restrict access to their servers more completely.”\n\n“We understand this is not what players expected” is a very good motto for Fallout 76.", "description": "Part of Fallout 76's controversial new paid subscription service Fallout First is the addition of an unlimited Scrap Box, which is somewhere players can store all of their junk. Problem being that some players are finding that the Scrap Box is bugged in the worst way possible: they’re losing everything they put into...", "authors": ["Stephen Totilo", "Alanah Pearce"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/rkhdgvmxmuvlend0hxac.jpg", "published_at": "2019-10-24"}