{"pub": "metro", "url": "https://metro.co.uk/2019/10/05/strong-women-10861116", "downloaded_at": "2019-10-05 12:25:54.341226+00:00", "title": "'Two friends took their lives so I'm walking 1,000 miles for charity'", "language": "en", "text": "Strong Women: ‘Two of my friends took their own lives – now I’m walking 1,000 miles to raise awareness’\n\nStrong Women: ‘Two of my friends took their own lives – now I’m walking 1,000 miles to raise awareness’\n\nSophia Badger is walking from London to Rome to raise funds and awareness in the face of serious tragedy.\n\nIn the summer of 2018, two of Sophia’s friends took their own lives. Now she is undertaking this mammoth challenge\n\n‘Their deaths came as a huge shock. It was the kind of news that you can’t quite believe, and it stops you in your tracks,’ Sophia tells Metro.co.uk.\n\n‘You mull over the last time you saw or spoke to them and wonder if you could’ve been in touch a bit more often and been there, been available, to lend an ear. You’re left with lots of questions that will never get answered. Lots of “whys” and “what-ifs”.\n\n(Picture: Sophia Badger)\n\nOne was a friend Sophia met at university, and the other a friend she met during a work sabbatical travelling in Central America.\n\nThe pair didn’t know each other, but they passed away about six weeks apart. Like Sophia, they were both in their mid-30s, with so much of their lives left to live.\n\nAdvertisement\n\nAdvertisement\n\n‘Their deaths were incredibly tragic and we lost them both far too soon,’ she says.\n\n‘Suicide produces a very challenging form of grief. You don’t really want to believe it, and you struggle to understand it. But my own experience pails into insignificance compared to that of the families of my two friends.\n\n‘The past year has been incredibly challenging for them, day in and day out. And that will continue for the rest of their lives.’\n\nChampagne vineyards at dawn in France (Picture: Sophia Badger)\n\nThe idea to do something substantial to honour the memory of her friends came to Sophia at the height of her grief, but it helped her realise that she needed to do something positive.\n\n‘I was at the memorial service of one of my friends,’ says Sophia.\n\n‘The celebrant did a fantastic job of channelling our energy away from all of those unanswerable questions to remembering the person that we had lost. Remembering her outgoing character, adventurous spirit, and charitable work, rather than the way in which she passed away.\n\n‘Driving home after the service I was filled with the feeling that I wanted to do something to raise awareness about mental health and raise money for a mental health charity.\n\n‘I had often given thought to doing a long walk or an overland horseback adventure, but never quite found the right time to actually commit myself to anything.\n\nThe Roman bridge in Pont Saint Martin, Italy (Picture: Sophia Badger)\n\n‘By the time I pulled up outside my house, I had more or less decided that I was going to walk to Rome, following a medieval pilgrimage route called the Via Francigena which I’d read about a few years previously.\n\nAdvertisement\n\nAdvertisement\n\n‘I decided that I would do it to raise money for the mental health charity Mind.’\n\nSophia is half Italian, so her once-in-a-lifetime walk has also been an eye-opening journey into her heritage as well. She says the trip has also been an incredible physical challenge, crossing the Alps, the Jura Mountains, and the Apennines, and walking for days through wheat and rice fields, all solo.\n\nTellaro, Ligurian Coast, Italy (Picture: Sophia Badger)\n\nSophia has already raised more than £10,000 for Mind, money that will help to change lives. But what she wants to achieve is bigger than just money.\n\n‘I’m learning a lot about myself and the places that I pass through, and having my eyes opened by the life stories of locals and other walkers that I meet along the way.\n\n‘Mind has told me that the money I have raised so far will allow them to answer more than 1,200 calls to their info line, which provides advice and support to people experiencing a mental health problem.\n\n‘But raising money is just one aspect of what I hope to achieve though.\n\n‘It’s so important that we have conversations about mental health, to open up and share our experiences and ask for help when we need it. So often we keep what’s going on with our mental health to ourselves.’\n\nSophia aims to use her journey to start these conversations. To let people know that it’s OK and normal to not feel OK, and that no-one needs to go through a mental health problem alone.\n\nAdvertisement\n\n‘What I’ve noticed is that when someone opens up it has a domino effect,’ says Sophia. ‘It’s an amazing thing to see, suddenly people understand that they aren’t alone in the way they think or feel, and there’s a huge amount of comfort they take from hearing someone else’s story.’\n\nThe village of Lods in the Jura Mountains (Picture: Sophia Badger)\n\nBefore embarking on her walk, Sophia also visited a number of huge companies including Google, O2, GoCompare and Shell, to help them start those conversations and to raise awareness about mental health both inside and outside the workplace.\n\n‘Mental health is something that we all have, every day, just like physical health. It’s not something to be scared of, and it’s something that we should all feel comfortable and capable of talking about in the same way that we talk about our physical health.\n\n‘Historically there has been a lot of stigma around mental illness, which has made this incredibly challenging.\n\n‘That’s changing, and we’re in the midst of a huge movement to raise awareness and start those all-important conversations that will help to normalise mental health problems. But there is still some way to go.\n\nOne in four people experience a mental health problem each year, but so many people find it difficult to talk about. That’s what Sophia is hoping to address.\n\nViews across Lake Geneva (Picture: Sophia Badger)\n\n‘Sometimes you can see the look on someone’s face drop when you say the words “mental health”, she says.\n\nAdvertisement\n\n‘That might be because they’re uncomfortable talking about it, or they don’t understand it, or they have certain preconceived ideas about it.\n\n‘Poor mental health is all around us, and the people experiencing that poor mental health need others to be understanding, to provide support systems, and to not make them feel isolated and alone.’\n\nNeed support? Contact the Samaritans For emotional support you can call the Samaritans 24-hour helpline on 116 123, email jo@samaritans.org, visit a Samaritans branch in person or go to the Samaritans website.\n\nTo fund her trip, Sophia has been using Airsorted to rent her flat our while she is away, which takes care of her rent and her bills and allows her to focus on raising vital funds.\n\n‘I’ve been walking for three months now, and it hasn’t been cheap,’ she explains. ‘Every penny that people donate goes directly to Mind and doesn’t fund my walk in any way. And that’s as it should be.\n\n‘Without Airsorted I don’t think I would’ve been in a position to do the walk, so using their services has been a real game-changer.’\n\nSophia is due to reach her final destination Rome in the next couple of weeks.\n\nStrong Women Strong Women is a weekly series that champions diversity in the world of sport and fitness. A Sport England study found that 40% of women were avoiding physical activity due to a fear of judgement. But, contrary to the limited images we so often see, women of any age, size, race or ability can be active and enjoy sport and fitness. We hope that by normalising diverse depictions of women who are fit, strong and love their bodies, we will empower all women to shed their self-consciousness when it comes to getting active. Each week we talk to women who are redefining what it means to be strong and achieving incredible things.\n\nMORE: ‘I caught a flesh-eating parasite in the Amazon jungle – doctors told me it could eat away my face’\n\nMORE: Strong Women: ‘My rugby team fought for equality in Japan – but the fight against prejudice isn’t over’\n\nMORE: Strong Women: ‘I was struggling to cope with my husband’s MS – mountain biking brought me back from the brink’\n\nAdvertisement Advertisement", "description": "This week on Strong Women Sophia's walking from London to Rome to honour two friends who took their own lives within six weeks of each other.", "authors": ["Natalie Morris", "Senior Lifestyle Reporter"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/strong-women-35-09c6_1570266150.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-05"}