{"pub": "politico", "url": "https://politico.com/news/2019/10/22/trump-jim-mattis-policies-book-054967", "downloaded_at": "2019-10-23 08:29:13.331457+00:00", "title": "‘The White House is not to be trusted right now’", "language": "en", "text": "During the summer of 2018, Snodgrass writes, Mattis confided to then-White House chief of staff John Kelly in a secret meeting that he was quitting the Cabinet at the end of the year — making his departure far more premeditated than the supposedly abrupt resignation that Mattis would later announce in December.\n\nThe book is the first account from inside the highest reaches of the Pentagon of how Trump has remade the American national security apparatus, reporting that Mattis respected the president for having highly tuned political skills but came to believe his policies were undermining the nation. And it reveals that even a Cabinet member like Mattis, a four-star general with ample experience in wartime, found himself unable to make a difference in shaping major decisions.\n\nPOLITICO obtained an early copy of the book and published an excerpt from it Monday.\n\nMattis did not immediately respond to a request for comment about this story, and the White House did not respond to inquiries. The book went through a review by the Pentagon, which released it for publication only after Snodgrass threatened legal action this summer, but Defense Department officials warned him of the consequences of violating the trust of Mattis and other senior leaders.\n\nSnodgrass' account portrays a seldom-displayed side of the famously stoic Mattis, who has been loath to criticize Trump publicly since leaving the administration.\n\n“The White House is not to be trusted right now,\" Mattis said in a meeting with close aides in his office in March 2018, when Trump appointees such as national security adviser H.R. McMaster, Secretary of State Rex Tillerson and White House economic adviser Gary Cohn — the colloquial “adults in the room,” to the president’s detractors — were departing the administration or had been fired. \"It’s too undisciplined at the moment.”\n\nFormer Defense Secretary Jim Mattis' (right) public solidarity crumbled in private as his frustration grew at President Donald Trump's dismissal of allies and shoot-from-the-hip pronouncements, writes Guy Snodgrass. | Chip Somodevilla/Getty Images\n\nHe then advised his staff about trying to predict the White House's next move: “Let's not walk into an L-shaped ambush.\"\n\nWhen John Bolton took over for McMaster in April 2018 and began appointing his own defense and foreign policy team, Mattis stopped receiving transcripts of Trump’s calls with foreign leaders, the kinds of sensitive conversations that are now at the center of the House's impeachment inquiry.\n\nMattis' patience began to wear especially thin in the spring of 2018 when Trump failed to consult with him on a host of big policy moves, from ordering the creation of a military Space Force to deploying troops to the U.S.-Mexican border, Snodgrass writes.\n\nThe surprise presidential decisions had grown for months, after beginning in earnest with a tweet from Trump in the summer of 2017 banning transgender troops from the military.\n\n“Trump’s tweets created chaos in the Pentagon,\" writes Snodgrass, who was detailed to work for Mattis early in his tenure. The damage from the transgender pronouncement \"was a terrific example of how an ill-informed, and ill-considered, tweet from 1600 Pennsylvania Avenue could result in a strategic defeat.\"\n\n“Mattis described the lack of a cohesive White House strategy in more colorful terms,\" he adds. \"He labeled the situation as one where the administration was holding itself hostage. He formed his right hand into a make-believe pistol and pointed it toward his temple, saying ‘No one move or the hostage gets it!’”\n\nThe decision to end war games with South Korea especially “caught the Pentagon flat-footed,\" Snodgrass writes. And shortly afterward, in a previously unreported off-the-record conversation with reporters, a journalist asked Mattis a direct question about Trump's performance: “But do you think the country will be stronger for [Trump’s] policies?”\n\n“Mattis didn’t hesitate,\" Snodgrass recounts. \"'No, I don’t. I do not think Trump’s policies will make America stronger, although we will appear stronger in the short term.’\"\n\nA week later came Trump's announcement that he was establishing a Space Force as a separate branch of the armed forces — what Snodgrass describes as \"the next complete surprise.” Mattis learned of it after the fact, in a call from Kelly, another retired Marine general and close ally in the administration.\n\n“A few minutes later, at 12:45 p.m., the secure phone line rang,\" according to the book. \"The caller ID flashed. It was General Kelly, White House chief of staff, calling to let Mattis know after the official announcement that Trump has just ordered the creation of a Space Force.”\n\nSnodgrass relates that Mattis grew surprisingly passive over the course of 2018, beaten down by what he perceived as dysfunction and and unwise policy decisions.\n\nA meeting Mattis hosted with Trump's refashioned team in May 2018, including Bolton, Secretary of State Mike Pompeo and new economic adviser Larry Kudlow, uncovered the growing rifts and Mattis’ diminished role in the administration. Also on hand was Treasury Secretary Steven Mnuchin.\n\n“As a former commanding general, Mattis was used to controlling the room and the conversation, especially when seated at the head of the table,\" writes Snodgrass, who was present. \"But today I watched as Pompeo, Mnuchin, and Bolton — peers within the administration — all cut Mattis off midsentence at various times.\n\n\"I fully expected Mattis to say something about it or to reassert himself,\" he continues, \"but he never did. When they cut him off, he just stopped talking. I was shocked at the rudeness of it, but Mattis’ inability to control the meeting also reinforced what had been nagging at me since McMaster’s firing — the balance of power in the administration has shifted. Today’s unruly scene only reinforced that fact.”\n\nMattis also chafed at the president's push for the Pentagon to deploy active-duty troops to the border to help stem the flow of illegal immigrants, a move the secretary considered an abuse of the military. “Mattis was now caught in his own graveyard spiral, expressing public support for a policy he didn’t agree with, bending his personal and professional beliefs to support the president,” the book says.\n\nMorning Defense Sign up for Morning Defense, a daily briefing on Washington’s national security apparatus. Sign Up Loading By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nOn the other hand, Trump's continued insistence on a military \"victory\" parade was just too much for Mattis to keep his views to himself, telling aides, “I’d rather swallow acid.” A watered-down version of the parade took place this past July 4, five months after Mattis resigned.\n\nIn the end, Mattis' seemingly abrupt decision to resign in December, after Trump unceremoniously announced the United States was pulling its troops out of Syria without consulting with allies or many of his own advisers, had actually been made months earlier, according to Snodgrass.\n\n\"Watching from a distance, I knew that the framing of Mattis' resignation as a spur-of-the-moment decision made in a final moment of passion was incorrect,\" Snodgrass writes.\n\nIn fact, Snodgrass writes that in the summer he “had — quite literally — stumbled upon the meeting that led to his decision” to leave.\n\n“I had stopped in to see Mattis' scheduler, asking 'Hey how's it going? I need to sync with your schedule for the next couple of weeks,'” Snodgrass says in the book. \"She admonished me, for the second time, for being far too loud, stating, '...Jeez, keep your voice down. The boss is meeting with General Kelly.'\"\n\nNo meeting with Kelly had been listed on Mattis' schedule that day. \"She cleared up the mystery for me,\" Snodgrass writes. \"'This is a private meeting. We deliberately kept Kelly off the schedule so no one, not even our staff, would know. We want to keep this under wraps.'\n\n\"'They are discussing departures,' she explained further. 'The boss is planning to leave this winter but Kelly is going to stay on at the White House.'\" It turned out that Mattis also had nothing scheduled beyond December.", "description": "", "authors": [], "top_image": "https://static.politico.com/c6/15/5c6bf411445e8b2160ae94594bfe/20191022-mattis-ap-773.jpg", "published_at": "2019-10-22"}