{"pub": "marketwatch", "url": "https://marketwatch.com/story/if-the-democrats-keep-saying-crazy-things-about-the-economy-trump-will-win-again-2019-10-18", "downloaded_at": "2019-10-19 15:14:21.905660+00:00", "title": "If the Democrats keep saying crazy things about the economy, Trump will win again", "language": "en", "text": "SAUL LOEB/AFP via Getty Images Elizabeth Warren and Andrew Yang exchange a high-five at the Democratic presidential candidates debate.\n\nWith felonies flying fast and furious at 1600 Pennsylvania Avenue this week, it may seem a curious time to write about how Democrats running for president are saying kind of crazy things.\n\nBut they are.\n\nBecause Andrew Yang, Bernie Sanders and (sometimes) Elizabeth Warren are radically misdiagnosing problems in the U.S. economy, they are off — often miles off — in prescriptions for reform.\n\nThe sheer amount of loose talk about how capitalism is failing is stunning. This myth-making scares workers in the present, and sparks proposals that should scare markets for the future.\n\nLike, what?\n\nRobot reaction\n\nBegin with the worst: The notion that automation is robbing the economy of millions of jobs. Relying on a Brookings Institution study that says 61% of U.S. jobs face high or medium exposure to automation in coming decades, candidates are proposing everything from universal basic income to limitations on trade.\n\nNews: Trump bashes Pelosi, Democrats during Texas rally\n\nYang, who brandished the Brookings study, and Warren, who engaged Yang in a long argument about whether automation or trade was doing more to kill jobs in a nearly full-employment economy, the candidates tried to outdo each other, declaring the economy broken and vowing to spend, in some cases, trillions of dollars on badly targeted “cures.”\n\nWow. This is so untrue it basically hurts.\n\nFirst, you know automation is happening when productivity rises. The point of automation is to raise the amount of output each worker can generate by supplementing their labor with machines. If productivity grows faster than sales of goods these workers make, fewer workers will be necessary. If sales rise faster than productivity, firms need fewer new hires to meet fresh demand, and will pocket more of the new revenue as profit.\n\nIf that sounds harsh, consider this: Productivity is where raises come from, as companies and workers divide these gains\n\nBut here’s the thing — growth has been terrible for the past decade or more. Business investment growth (which leads to productivity growth) has been spotty, too, as companies pulled back after the dot-com crash, again during the 2008 financial crisis, and more recently (and modestly) in reaction to President Donald Trump’s trade clashes with China and others.\n\nNot happening\n\nThis means that the wave of job-killing automation hasn’t happened. The 3.5% unemployment rate might have been a clue.\n\nYang, for his part, is more concerned about future job losses. He argued that driverless trucks alone will cost 3 million U.S. jobs and artificial intelligence will claim many more. It’s not hard to read futurists claiming AI will replace everyone from office workers to doctors.\n\nBut let’s unpack the trucking claim illustratively.\n\nAutonomous trucks aren’t here. There are pilots and tests, but autonomous vehicles are far from ready for day-to-day use — much farther than hype for Uber Technologies UBER, -1.72% , TSLA, -1.92% and others (remember Apple AAPL, +0.48% Car buzz?) has suggested.\n\nWhen Uber went public this year, CEO Dara Khosrowshahi dampened speculation about how fast Uber would be able to replace drivers — even though that’s key to an inflection in Uber’s profits. That’s one reason Uber is down 25% since its IPO. Tesla’s few orders for electric semi trucks are for models that use AI-like technologies to assist drivers, not replace them. And the number of truck drivers is steady to growing modestly, Labor Department data say.\n\nTake away Yang’s assumptions about tech-driven job loss, and the case for a universal basic income to supplement wages lost collapses. (If you think jobs pay too little to live on, raise the $7.25 an hour minimum wage and re-empower unions).\n\nSkeptical of free trade\n\nWarren and Sanders also remain skeptical of free trade — listening to the argument at this week’s Democratic debate about whether trade or automation costs more jobs, when both are job-additive, was pretty rich. Indeed, the slowdown in exports this year is the biggest factor that has the U.S. looking at an economic slowdown.\n\nThe argument that capitalism’s a con leads naturally into the idea that government knows best, and vastly more economic decisions should be left to it.\n\nSanders’s corporate governance plan, announced this week, would put Washington in charge of who should own public companies, by mandating that 20% of each public company belong to workers. It would ban stock buybacks, assuming an 86--year old president (in Sanders’s second term) knows better than CEOs how to use capital at specific firms. And he would bar private health insurance because it’s all just greed anyway.\n\nAll this risks upending a system — capitalism, you’ve heard of it — that has delivered, by far, the world’s highest living standards for many years. And these and other policies would reorient what remains the developed world’s fastest-growing large economy.\n\nWhat’s needed is much more measured change.\n\nBarack Obama reduced income inequality by modestly raising taxes on the rich and putting in near-universal health insurance, even if the government doesn’t provide all insurance. A $15 minimum wage would boost pay for 33.5 million workers, according to the Economic Policy Institute. Without trillions of government spending. A two-worker household at that minimum would pull in $54,600 a year (assuming 35 hours a week — not bad for minimum wage. Even $12 would restore the working class’s lost ground.\n\nPragmatism\n\nCommon-sense solutions — minimalist liberalism, if you need a new term — is practical, sellable to voters and achievable in a mixed economy. Many of Warren’s ideas fit this mold, even as others don’t.\n\nSubsidized child care, for example, would boost working families’ effective earnings with money raised by a tax increase on higher incomes — taxes Trump cut, to little economic benefit. So would tuition-free university education — as many states once offered.\n\nAnswers like this flow naturally from seeing the economy as it actually is — imperfect, but hardly collapsing.\n\nPolitically, it’s easier to sell a view of the economy that matches what people see around them. And that’s the best path to making sure Trump doesn’t win four more years.", "description": "The sheer amount of loose talk from Democrats about how capitalism is failing is stunning.", "authors": ["Tim Mullaney"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT613_yang_w_ZG_20191018101233.jpg", "published_at": "2019-10-18"}