{"pub": "breitbart", "url": "https://breitbart.com/news/u-s-air-force-hits-all-2019-recruitment-goals", "downloaded_at": "2019-10-11 02:29:51.414015+00:00", "title": "U.S. Air Force hits all 2019 recruitment goals", "language": "en", "text": "Oct. 10 (UPI) — The U.S. Air Force Recruiting Service surpassed its recruiting goal in fiscal year 2019, with over 34,000 airmen taking the oath of enlistment.\n\nThe strong numbers, announced by the Air Force on Thursday, compare to 2014 and 2015, when active-duty recruitment fell to about 24,000 each year. Air Force personnel strength is currently at about 506,000.\n\nThe figure announced on Thursday is about 1,000 enlistments more than in 2018, and the highest number since the Vietnam War era.\n\nAmong the newly accessed members are 32,421 airmen, 1,442 line officers, 763 health professionals, and 34 chaplains.\n\nAdditionally, the Air Force Reserve assessed 7,323 enlisted airmen, 982 line officers, 361 health professionals and 50 chaplains, and the Air National Guard assessed 11,075 enlisted airmen and 1,929 officers.\n\n“I think this is significant because the goals were high, the economy was strong and unemployment was low,” Maj. Gen. Jeannie Leavitt, commander of the Recruitment Service, said in a statement, “so this is a true testament to the outstanding professionals we have in the total force recruiting enterprise.”\n\nIn September, the U.S. Army announced that it, too, surpassed its recruitment and retention goals in Fiscal 2019 after a year in which it missed its target by 6,500 soldiers. It will exceed its aim of recruiting 68,000 more soldiers by the end of 2019, and credited an outreach in selected cities and additional recruiting stations for its success.\n\n“We did better in cities like Boston, Chicago and Los Angeles than we had done in years,” Acting Secretary of the Army Ryan McCarthy told Military.com. “By readdressing the 22 cities in America, we had a double-digit lift with females and minorities. We are getting a much more comprehensive cohort of men and women to join the force that are a reflection of the country.”\n\nThe Army Recruiting Command noted that women now comprise 18 percent of the ranks, compared to 17.1 percent in 2018.", "description": "Oct. 10 (UPI) — The U.S. Air Force Recruiting Service surpassed its recruiting goal in fiscal year 2019, with over 34,000 airmen taking the oath of", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-10"}