{"pub": "guardian", "url": "https://theguardian.com/environment/2019/oct/02/shoppers-uk-avoid-north-sea-cod-wild-atlantic-salmon", "downloaded_at": "2019-10-02 12:50:05.751716+00:00", "published_at": "2019-10-02", "title": "Shoppers told to avoid North Sea cod and wild Atlantic salmon", "language": "en", "text": "Consumers are being urged to steer clear of North Sea cod and wild Atlantic salmon – and eat more herring, plaice and hake – in a fresh attempt to alleviate pressure on threatened stocks.\n\nThe Marine Conservation Society (MCS) will publish its updated 2019 Good Fish Guide this week, setting out which is the most sustainable seafood and what to avoid in order to help safeguardat-risk species in UK waters.\n\nCod from the North Sea has been awarded a red rating this year – moving back on to the society’s fish to avoid list – while UK sea-caught seabass has been removed from that list after stocks recovered.\n\n‘Fishyleaks’ website hopes to land those guilty of overfishing Read more\n\nLast week the Marine Stewardship Council announced that it was suspending its “blue tick” certification of North Sea cod after a dramatic decline in the population, which means it could disappear from UK supermarket shelves next year. However, the majority of the cod sold in Britain is from other stocks.\n\nWith Brexit looming there are significant changes expected to the management of the UK’s fisheries, with Britain assuming more responsibility for managing stocks within its seas. The guide notes “it is more important than ever for consumers to pay close attention to how our UK fisheries and fish farms are doing, and to support sustainable UK seafood”.\n\nCharlotte Coombes, the MCS Good Fish Guide manager, said: “UK-caught or farmed seafood can be a great sustainable option when done right, but it is vital that people take note of what species they’re buying, where it was caught or farmed, and how. MCS’s Good Fish Guide looks at all of these key aspects, as well as wider environmental impacts and how well-regulated the farms and fisheries are.”\n\n“Whatever the future of the UK’s relationship with the EU, shopping for sustainable UK seafood will help to support sustainable UK fishers and fish farmers and reduce the pressure on at-risk species.”\n\nConsumers determined to have a cod supper are advised to look for fish from the north-east Arctic or Iceland. Also to be shunned is European eel, a critically endangered species due to overfishing, habitat changes and pollution. Whether farmed or caught wild, the MCS warns there are currently no sustainable options for this species.\n\nConsumers are also urged not to buy or eat wild Atlantic salmon, given that there are no rivers in England or Wales where salmon stocks are meeting conservation targets and only 28% of rivers in Scotland doing so. Shoppers are advised to look for UK organic farmed salmon or fish from Scottish grade-one rivers.\n\nWhere did all the cod go? Fishing crisis in the North Sea Read more\n\nWhiting caught from the west of the UK should also be avoided, given that all its populations are below safe levels. Wild Atlantic halibut – an “amazing but endangered species” – is highly vulnerable to the impact of fishing, so consumers are urged to avoid wild Atlantic halibut caught anywhere in UK waters.\n\nAmong the most sustainable seafood species caught or farmed in the UK are herring (from the Irish or North Sea) where the population is in a good state, while oysters, mussels and king prawns are singled out as the tasty UK-farmed shellfish hailed as “real delicacies on our doorstep”.\n\nPlaice is recommended as populations are booming, as is UK-farmed Atlantic halibut, but not the endangered wild species. Following low stock levels in 2006, UK-caught European hake populations have bounced back and been consistently high over the past 10 years.\n\n“Whatever the future of the UK’s relationship with the EU” said Coombes, “shopping for sustainable UK seafood will help to support sustainable UK fishers and fish farmers and reduce the pressure on at-risk species.”", "description": "Exclusive: species added to at-risk list as numbers fall, but hake and plaice are booming", "authors": ["Rebecca Smithers"], "top_image": "https://i.guim.co.uk/img/media/9574941ddf877959eab1186f708c3b43369e4b8f/0_0_3024_1814/master/3024.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=702124d7d90f15f79bdf2cc663b8d39b"}