{"pub": "townhall", "url": "https://townhall.com/tipsheet/katiepavlich/2019/09/03/did-walmarts-ceo-forget-about-these-armed-heroes-who-stopped-massacres-at-his-stores-n2552550", "downloaded_at": "2019-09-03 23:41:52.508680+00:00", "title": "Did Walmart's CEO Forget About These Armed Heroes Who Stopped Massacres at His Stores?", "language": "en", "published_at": "2019-09-03", "text": "Earlier today Walmart CEO Doug McMillon officially announced a number of firearms and ammunition will no longer be sold at stores nationwide. The statement was quite incoherent, but here it is.\n\nHere is the @WalmartInc press release making the announcement about discontinuing ammunition sales. The CEO's description of ammunition and firearms is bizarrely incoherent. Great to know they put zero effort into learning about the products they sell. https://t.co/9jDviI1pkj — Stephen Gutowski (@StephenGutowski) September 3, 2019\n\nJust last month an armed citizen became a hero after stopping a mass shooting at a Walmart in Missouri. From local NBC 25 News:\n\nPolice in Springfield, Missouri, said they arrested a man who showed up Thursday at a Walmart store carrying a rifle and wearing body armor, terrifying shoppers who fled from the store.\n\n\n\nSpringfield police posted on Facebook that \"an armed individual\" was arrested. No shots were fired.\n\n\n\nThe Springfield News-Leader quoted Lt. Mike Lucas as saying that the man arrived Thursday afternoon wearing body armor and military-style clothing. He walked inside the Walmart carrying a \"tactical rifle\" and another gun. Lucas said the man had more than 100 rounds of ammunition.\n\n\n\nLucas said an off-duty firefighter held the suspect — a 20-year-old man who was not immediately identified — at gunpoint until police arrived about three minutes after receiving an initial call.\n\nLast year, an armed citizen stopped a shooting spree in Washington state. From the Washington Post:\n\nA gunman who opened fire inside a Walmart in Washington state and injured at least two people during carjacking attempts was fatally shot by one of two armed civilians on Sunday evening, according to police.\n\n\n\nAbout 5 p.m. Pacific Time, authorities received a call about a possibly drunk driver heading the wrong way on a main road near a local high school, said Laura Wohl, Tumwater police public information officer.\n\n\n\nAs police sped to the scene, they received a second call about a carjacking with shots fired. When officers arrived, they found a 16-year-old girl with unspecified non-life-threatening injuries but no suspect. They quickly located the stolen car but once again no suspect.\n\n\n\nShe said the man entered the Walmart, fired shots at a display case and then went into the parking lot.\n\n\n\nThere he attempted to carjack another vehicle, shooting an occupant in it at least twice. Apparently frustrated in his effort, the gunman then attempted a second carjacking.\n\n\n\nAt that point, Wohl said, two armed civilians in the parking lot confronted the suspect, one of whom fatally shot the man.\n\n\n\nWitnesses told the Seattle Times that at least three civilians pulled guns in the parking lot. Police reported just two, one of whom fired at the suspect and killed him.\n\n\n\n“He is a hero,” Adams told KING 5. “If this customer hadn’t done what he did, who knows what would have happened.”\n\nMcMillon's decision makes Walmart customers and employees less safe.", "description": ".09/03/2019 19:41:54PM EST.", "authors": ["Katie Pavlich", "Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/303/dcab0d07-abc7-42f0-849c-e0504c89dc62.jpg"}