{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7574015/Brexit-deal-hopes-rise-minute-compromises-made.html", "downloaded_at": "2019-10-15 08:06:38.171482+00:00", "title": "Brexit deal hopes rise after 'last-minute compromises are made'", "language": "en", "text": "brexit countdown_bg Created with Sketch.\n\nMichel Barnier fuelled hopes that a Brexit deal is close today as he insisted it is still 'possible' to seal a package for a crunch EU summit this week.\n\nIn his most optimistic comments for days, the bloc's negotiator admitted the process was 'more and more difficult' but could be completed.\n\nArriving to brief EU ministers in Luxembourg, he said: 'Reaching an agreement is still possible. Obviously, any agreement must work for all, the whole of the UK and the whole of the EU.\n\n'Let me add also that it is high time to turn good intentions in a legal text.'\n\nBoris Johnson is making a final push amid claims that the two sides are homing in on an agreement.\n\nIn signs that negotiations are gathering pace, the PM has cancelled a Cabinet meeting this morning - and the DUP was sighted in Downing Street last night.\n\nTomorrow looks to be the absolute deadline for getting a settlement in time for a crunch summit in Brussels on Thursday and Friday, although the Finnish PM has warned he believes time has already run out.\n\nBriefing coming out of the discussions suggests the outlines of a 'hybrid' customs proposal have been thrashed out, and the UK has put forward a new legal text.\n\nBrexit Secretary Steve Barclay is in Luxembourg this morning to meet Mr Barnier and other ministers. However, sources told MailOnline no-one was getting 'overexcited' about an imminent breakthrough.\n\nSources in Brussels and London told The Telegraph there was now 'cautious optimism' that a joint position will be found.\n\nHowever, the tone has dramatically shifted from the weekend, when Mr Barnier warned little progress was being made and demanded more concessions from the UK.\n\nBoris Johnson (left in Downing Street last week) has postponed today's Cabinet meeting as Brexit talks intensify. Brexit Secretary Steve Barclay is meeting Michel Barnier (right in Brussels this morning) later\n\nRepresentatives of he DUP (deputy leader Nigel Dodds and leader Arlene Foster pictured earlier this month) were last night spotted entering Number 10\n\nNo10 was buoyed yesterday when Irish deputy PM Simon Coveney said an agreement was still 'possible' this week.\n\nBut Finnish PM Antti Rinne, who holds the rotating presidency of the EU, last night played down hopes of a breakthrough on the Irish border.\n\nWhat happens next in the Brexit crisis? Here is how the coming weeks could pan out: Today: Michel Barnier and Steve Barclay meet other EU ministers in Luxembourg. Technical talks continue in Brussels. Tomorrow: The final deadline for having an agreement place for sign-off by EU leaders. Thursday-Friday: A crunch EU summit in Brussels. Any deal could be signed off by leaders here. If the talks have broken down, expect Boris Johnson to either boycott the event, or stage a dramatic walkout. Saturday: Parliament will sit on Saturday for the first time since the Falklands War. If there is no Brexit deal by this date Remainer legislation obliges the PM to beg the EU for an extension to avoid No Deal. Mr Johnson is likely to force a vote to make MPs 'own' any delay, having said he would rather 'die in a ditch' than accept one. If there is a deal in place, there will be a make-or-break vote on whether to back it. If passed by the Commons, the government will start rushing legislation through Parliament immediately. Monday: Jeremy Corbyn has said that he will let Mr Johnson trigger an election after an extension has been secured. This would probably be the first day when a motion can be brought to a vote under the Fixed Term Parliaments Act, or a confidence vote can be held. October 31: The current deadline for the UK to leave the EU, which Mr Johnson has previously described as 'do or die'.\n\n'I think there is no time in a practical or legal way to find an agreement before the EU Council meeting,' he said. 'We need more time and we need to have negotiations after the meeting.'\n\nMr Johnson is anxious to get a deal agreed before Saturday, when legislation requiring him to seek another Brexit delay kicks in.\n\nThe PM has said he will lead Britain out of the EU on October 31 come what may. But any attempt to get around the law would lead to a clash with the courts and could spark a Cabinet walkout led by Attorney General Geoffrey Cox.\n\nDowning Street has been tight-lipped about the latest compromise plans, which emerged from head-to-head talks between Mr Johnson and Irish premier Leo Varadkar last week.\n\nBut the decision to delay Cabinet will fuel hopes that a deal is close.\n\nA government source said: 'There is a feeling there is no point holding a Cabinet meeting if the PM can't brief ministers on the deal and that maybe things will look different in a day or two.'\n\nSources said the PM was considering a call to European Commission president Jean-Claude Juncker today to help speed up the process.\n\nMr Coveney said it was still 'possible' to strike a Brexit deal by the end of the week. He also appeared to suggest that those briefing against Mr Johnson's new proposal should stop. EU sources say the Republic of Ireland is very keen on Mr Johnson's latest plan for breaking the border backstop deadlock.\n\nBut Mr Barnier previously trashed the plan, insisting it would be 'very difficult' to do a deal in time for Britain to leave on October 31.\n\nBrussels sources last night denied divisions between EU capitals and Mr Barnier over his hardline stance, insisting he was not the 'roadblock' to a deal.\n\nDespite major concessions made by Mr Johnson, Mr Barnier told EU ambassadors on Sunday night that the UK's proposals would cause 'the unravelling of the EU's customs code', that they are 'untested' and could open up the single market to fraud.\n\nMr Johnson's alternative for replacing the backstop is thought to be a dual customs arrangement which would see Northern Ireland subject to EU tariffs on goods, but de facto remain within the UK's customs jurisdiction.\n\nAt the weekend, Jacob Rees-Mogg said he was ready to 'eat my own words' and back the 'dual customs' plan, which he previously opposed.\n\nHowever, the Democratic Unionist Party continue to express doubts over the plan.\n\nArriving for a meeting of foreign ministers in Luxembourg yesterday, Mr Coveney said: 'I think, as Leo Varadkar has said, a deal is possible and it's possible this month, it may even be possible this week.\n\n'But we're not there yet, and as Michel Barnier said yesterday there is still a lot of work to do, so I hope that we can make more progress today.'", "description": "In a surprise move, Downing Street sources said today's Cabinet meeting would be postponed in the hope the PM will be able to brief ministers on the details of an agreement tomorrow.", "authors": ["James Tapsfield", "Political Editor For Mailonline", "Jason Groves And David Williams For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/08/19727340-0-image-a-89_1571122876899.jpg", "published_at": "2019-10-15"}