{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/big-innovation-jobs-leaders-grow-business-nincompoopery-author-john-brandt-2019-10", "downloaded_at": "2019-10-29 14:17:16.926198+00:00", "title": "A CEO explains the 4 'big innovation jobs' every leader should take on to successfully grow their business", "language": "en", "text": "John R. Brandt is the CEO and founder of The MPI Group.\n\nThe following is an excerpt from his book, \"Nincompoopery: Why Your Customers Hate You — and How to Fix It.\"\n\nIn it, he identifies the \"nincompoopery\" that can plague corporate businesses, and how business leaders can go above and beyond to deliver more value.\n\nThere are four \"big innovation jobs\" that leaders can take on: utilizing logistics, partnering with customers, using data, and crafting bundled solutions.\n\nVisit Business Insider's homepage for more stories.\n\nCustomers expect us to provide quality — outstanding product performance and service delivery — as a minimally acceptable threshold to even be considered in a purchasing process.\n\nThis means that quality, though essential to value, is no longer a differentiating component of value.\n\nCustomers want more.\n\nThe good news is that we now have more ways than ever to deliver the \"more\" in \"more value,\" which means business leaders now have four Big Innovation Jobs.\n\nBig innovation job #1: Leverage delivery and logistics for competitive advantage\n\nCustomers have always wanted services and products to be delivered on time. But in an era when just-in-time deliveries are critical to organizations adopting lean management principles, precision delivery is a differentiating component of value. If a customer has only limited inventories of a key part that you provide and you screw up a promised delivery, they'll never forget you. But not in the way you hoped.\n\nFor most large and mid-sized businesses, the solution to improved delivery lies within, by improving measurement practices and operational processes both internally and externally.\n\nPlumbers Supply Company, a 250-employee distributor in Louisville, Kentucky, had an order fill rate of 95%, which seems impressive until you realize that missing even one item out of a 100-part order can bring an entire construction project to a dead stop.\n\nPlumbers Supply responded by adopting a lean improvement methodology focused on a new measurement: 100% complete order fill rate. Did we ship everything the customer wanted, on time? The new metric uncovered a host of process problems throughout the organization; with the help of a consultant, the company invested in three years of intense analysis and workflow changes. The result? A renewed customer focus and higher margins, driven by a 20% jump in productivity.\n\nBig innovation job #2: Partner with customers by offering business expertise in creative new ways\n\nTotal cost of ownership used to refer to purchase price plus annual fees and maintenance. Now, however, customers conceive of it much more expansively, and include evaluations of such diverse factors as:\n\nHow difficult is your organization to work with?\n\nHow well do your management and information technology systems integrate with those of the customer?\n\nWhat business expertise, even if not directly related to your product or service, do you offer?\n\nIn short: Are you a good partner?\n\nThe jet-engine industry has been a pioneer in rethinking partnership as a differentiating component of value. Engines are massively expensive (up to $35 million each) and are sold into a highly competitive market that keeps margins low. The only way to make money is selling parts and maintenance over the thirty-year life of the engine, but competition is just as keen here.\n\nWhat to do? Executives at GE Aviation decided to stop selling engines altogether. Instead, GE sells \"Power by the Hour,\" charging airlines thousands of dollars per engine-operating-hour. This benefits both GE and the airline in several ways, including:\n\nAn enormous fixed cost for the airline becomes a variable cost, allowing for flexible responses to changes in flight supply and demand.\n\nGE continuously gathers data on engine performance, spurring improvements in maintenance techniques and product design.\n\nThe point isn't how much money you spend, but how much real connection you can create between your two organizations among a variety of departments and employees. Your best customers will recognize the long-term value that this type of partnership creates, which will reduce the importance of price in your negotiations with each other and prevent competitors from even getting in the door.\n\nBig innovation job #3: Incorporate data and information into your value proposition\n\nCreatively collecting, analyzing, and sharing data with customers offers a significant opportunity to differentiate. This can be as easy as sharing data on trends or end markets. A small organization might host a quarterly lunch-and-learn on the local economy, while marketers at professional services organizations might offer thought leadership and content marketing. Visit the website of any top-25 accounting firm and you'll find digital acres of white papers, articles, newsletters, blogs, infographics, videos, and podcasts, each targeted at a mind-numbingly specific subindustry.\n\n\"NINCOMPOOPERY: Why Your Customers Hate You — and How to Fix It\" Courtesy of HarperCollins Leadership\n\nThe good news for small companies is that thanks to social media platforms such as Facebook, Instagram, Pinterest, and LinkedIn, thought leadership and content marketing are now affordable for anyone with creativity and chutzpah.\n\nYet thought leadership and content are just two ways — and not always innovative ones, given the flood of boring thought leadership and atrocious content marketing out there — to use data and information to differentiate value. A better path is to provide information to customers so that they can independently make better decisions about how to customize and use your organization's products or services, improving their outcomes (because solutions are tailored to their unique issues) and your profitability (because better information allows them to manage processes previously staffed by your company).\n\nBig innovation job #4: Offer value or solution bundles\n\nCustomers are overwhelmed by massive to-do lists, whether electronic or legal pad in nature, and desperately want partners who can make those to-dos disappear.\n\nHere's the problem: Most of their daunting lists have a series of bundled to-dos — a series of process tasks that together (might) solve a larger problem. An example might be: Our current batch of vendors stink, so I need to (A) generate a list of new vendors; (B) interview, research, and rank them all; (C) check with other departments to see if the new vendors meet quality and delivery standards; and ... well ... lunch is coming up, and now that I think about it, maybe our current vendors aren't so bad after all.\n\nAll of which means that bundled to-dos require bundled solutions, which are typically more lucrative than individual products and services (customers will happily pay more to see a bundle of problems vanish) but much harder to deliver because they demand broader capabilities.\n\nIf you run a small business, you can do this Big Innovation Job by finding gaps in current value systems and bundling your new (or existing) product or service with another customer purchase to increase the value of both.\n\nExcerpt from \"Nincompoopery: Why Your Customers Hate You — and How to Fix It\" by John R. Brandt. Copyright © 2019 by John R. Brandt.", "description": "In his book \"Nincompoopery,\" John Brandt, the CEO and founder of The MPI Group, says there are four ways leaders can deliver more value to customers.", "authors": ["John Brandt"], "top_image": "https://image.businessinsider.com/5db70be5dee01969c93ef827?width=1200&format=jpeg", "published_at": "2019-10-29"}