{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/despite-a-reputation-for-indestructible-phones-nokias-only-just-announced-its-first-rugged-phone", "downloaded_at": "2019-09-10 02:21:25.048347+00:00", "title": "Despite A Reputation For Indestructible Phones, Nokia's Only Just Announced Its First Rugged Phone", "language": "en", "text": "In recent years the old Nokia phones, particularly the 3310, have developed a reputation for being indestructible. They could handle an insane amount of torture before they stopped working, and had the powerful battery life to boot. Believe it or not making a hardy phone was never Nokia's intention, and it hasn't been until now that the company has launched a phone designed to handle more than the usual day-to-day shit we put our phones through.\n\nThe aptly named Nokia 800 Tough is the phone in question, though some of you might be disappointed to hear that it's a feature phone rather than a deliberately-indestructible (ish) smartphone. So it's more like the Cat B35 than the Samsung Galaxy Active.\n\nBut being a rugged phone it's designed to handle the rigours of a more active lifestyle, and comes with IP68 water resistance, which means it can handle a dip in up to 1.5 metres of water for up to 30 minutes. Likewise it can deal with drops from the standard 1.8 metre height, and has been tested to military standard 810G. That means it can also handle extreme temperatures, pressures, and all the other things not covered by a general IP rating.\n\nThe 800 Tough has a tough exterior to accommodate a lot of this too, with an anti-slip coating and rubber edges to make sure you can keep hold of it - though I imagine that rubber will come in handy if you ever drop the thing. There's also a bar at the bottom to attach a strap, should you like to take extra measures against your butterfingers.\n\nThe phone is 4G ready, and runs on Kai OS, so like the other Nokia feature phones it has smarter features like Google Assistant, WhatsApp, Facebook, and so on. It also comes with 4GB of storage, and a microSD slot that can handle cards up to 32GB in size.\n\nBut the best thing of all? It comes with the longest standby time of any Nokia phone ever made - a whopping 43 days.\n\nThe Nokia 800 Tough will arrive in the UK early October for around $180 and will be available in black and desert camo colouring.\n\nEditor's Note: Pricing and availability for the Australian market has yet to be confirmed.\n\nThis post originally appeared on Gizmodo UK, which is gobbling up the news in a different timezone.", "description": "In recent years the old Nokia phones, particularly the 3310, have developed a reputation for being indestructible. They could handle an insane amount of torture before they stopped working, and had the powerful battery life to boot. Believe it or not making a hardy phone was never Nokia's intention, and it hasn't been...", "authors": ["Mack Hogan", "Adam Clark Estes"], "top_image": "https://edge.alluremedia.com.au/m/g/2019/09/Screen-Shot-2019-09-09-at-8.34.56-am.png", "published_at": "2019-09-10"}