{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7626667/Plane-crashes-house-New-Jersey-bursts-flames.html", "downloaded_at": "2019-10-30 00:11:28.076659+00:00", "title": "Plane crashes into a house in New Jersey and bursts into flames", "language": "en", "text": "Advertisement\n\nA small plane has crashed into a home in New Jersey setting at least two properties alight and leaving the pilot unaccounted for.\n\nThe FAA said the twin-engine Cessna 414 came down in Berkley Avenue in Colonia at 11am on Tuesday, just several hundred yards from Claremont Avenue Elementary School.\n\nWoodbridge Mayor John McCormac said only the pilot was on-board and that no one was injured on the ground.\n\nThe condition of the pilot is unknown and there was no one in the home hit, he confirmed.\n\nA woman in a nearby home managed to escape without injury after the flames spread there, McCormac added.\n\nImages from the scene show emergency crews on the residential street as fire crews battle the flames. The family who live in the home hit broke down in tears as they watched their house burn, a neighbor told NJ.com.\n\nAt least two houses are said to be on fire after the Cessna 414 came down in Berkley Avenue in Colonia at 11am\n\nImages from the scene show fire crews battling flames on the residential street lined with trees\n\n'It sounded really low, it started to sputter a little bit. ', one eyewitness said, before a 'huge explosion'\n\nOfficials said there were no reports of injuries on the ground and the plane was occupied by only the pilot (stock image of a Cessna 414)\n\nA reporter at the scene told NBC New York: 'Very heavy flames and very heavy black smoke coming up from the fire.'\n\nThe FAA are said to be heading to the scene. The National Transportation Safety Board will also investigate.\n\nIt is understood the eight-seat plane came down in the back of the house en route to Linden Airport. It was due to land there at 10:58 after taking off from Leesburg, Virginia.\n\nThe fire was said to be under control by 1pm.\n\nMayor John McCormac said: 'There was nobody home at the time, which was very fortunate. There was a car in the driveway, so everybody thought somebody was home, but nobody was home, they confirmed with the owner. Right now, we don’t believe any civilians on the ground were impacted by the crash.'\n\nThe nearest airport to the scene is in Linden where a visibility of two miles, calm winds, mist and a ceiling of 700 feet was reported at the time of the crash.\n\nThe weather in the area was cloudy and misty at the time of the crash.\n\nOne eyewitness said: 'It sounded really low, it started to sputter a little bit.\n\n'All of a sudden there was this huge explosion, or just this big bang, louder than any car crash I've ever heard.'\n\nAnother told ABC7: 'I saw this thing coming in like wing up, wing down, and for a little plane he had a pretty wide wingspan, about maybe 100 feet above the house just roaring in, and then boom - an explosion lit up the sky.'\n\nNeighbor Matt Loomis said of the homeowners: 'They actually both started crying immediately when they started talking.'\n\nIt is understood the eight-seat plane came down in the back of the house en route to Linden Airport. It was due to land there at 10:58 after taking off from Leesburg, Virginia", "description": "At least two houses are said to be on fire after the Cessna 414 hit a property in Colonia at 11 am. The FAA said the plane came down in Berkley Avenue.", "authors": ["Lauren Fruen For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/16/20335932-0-image-a-90_1572367579044.jpg", "published_at": "2019-10-29"}