{"pub": "mirror", "url": "https://mirror.co.uk/film/maleficent-2-review-angelina-jolie-20584509", "downloaded_at": "2019-10-15 15:06:29.400464+00:00", "title": "Maleficent 2 review: Angelina Jolie is Disney's No.1 'Mistress of Evil'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAngelina Jolie swoops back into cinemas in her irresistible dark witch persona in this gorgeous blockbuster fairytale, the fourth live-action Disney film of the year.\n\nThe Hollywood royal is captivating as the magical Maleficent, a role which allows her to be glamorous, powerful, conflicted and regal, and have great fun being puzzled by the ways of ordinary mortals like us.\n\nFive years after her original film saw Maleficent save her forest realm, she is once again considered a danger to any human who dares venture into her lands.\n\n(Image: YOUTUBE/WALT DISNEY STUDIOS)\n\nElle Fanning as the sweet Princess Aurora knows better, but she antagonises her fearsome fairy god-mother by accepting the marriage proposal of Harris Dickinson's handsome and harmless Prince Phillip.\n\nMichelle Pfeiffer is icily authoritative as Maleficent's rival, Queen Ingrith, who sees the impending marriage of her son not as losing a child but an opportunity to gain a kingdom and wipe out Maleficent's woodland folk.\n\nWith an army of heavily armed henchmen and a scientist in a secret underground laboratory, Ingrith is more akin to a James Bond villain than a medieval queen. She even has a pet cat.\n\n(Image: Walt Disney)\n\nAs ever with Disney fantasies there's no lack of spectacle on screen, with the costumes, make-up, and locations breathtakingly rich in detail, and should be up for all the major awards.\n\nNewcomers such as Chiwetel Ejiofor and Ed Skrein play members of a threatened race, whose presence suggests a wider world for future films to explore.\n\n(Image: Walt Disney)\n\nThe first half scene-setting of politics and social oneupmanship may pass over the heads of very little kids, but there’s always something great to look at, and the smaller woodland creatures are distractingly funny and super cute.\n\nPlus the second half is an exciting colourful battle which swoops about the turrets of a glorious castle, and the ending is everything you’d expect from a Disney family movie. Awww.", "description": "Angelina Jolie stars as the powerful, glamorous and conflicted Maleficent in Disney's fourth live-action film of 2019", "authors": ["Chris Hunneysett", "Image", "Youtube Walt Disney Studios", "Walt Disney"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20584501.ece/ALTERNATES/s1200/1_MALEFICENT.jpg", "published_at": "2019-10-15"}