{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/20/hong-kong-protests-tech-war-opens-up-with-doxxing-of-protesters-and-police", "downloaded_at": "2019-09-20 08:16:03.664223+00:00", "title": "Hong Kong protests: tech war opens up with doxxing of protesters and police", "language": "en", "text": "Campaigns to expose personal details of those on both sides of protests skyrocket, with nearly 1,000 cases being investigated\n\nHong Kong has seen an unprecedented wave of doxxing – the malicious spread of private information online – since anti-government protests began in early June.\n\nSocial media forums such as LIHKG, a Reddit-like website, and encrypted apps such as Telegram have played a critical role in organising the leaderless protest movement but are now being used to share names, photos, phone numbers, ages and the occupation of individuals on both sides of the protest line.\n\nSupporters of the Hong Kong government have sought to identify masked protesters at demonstrations, while protesters themselves also appear to have taken part, sharing private information about police officers and their families across Telegram.\n\nHong Kong police show 'alarming pattern' of violence in protests Read more\n\nOne of the latest leaks this week saw a Chinese-language website with a Russian domain post information about journalists at local newspaper Apple Daily. It also has dozens of entries on protesters and other activists, similar to several pro-government telegram channels.\n\nChris Yeung, chair of the Hong Kong Journalist Association, said the doxxing of journalists was an attack on press freedom and appeared to be part of a “concerted and apparently orchestrated campaign to undermine reporting of the protests in Hong Kong and to intimidate reporters”.\n\nThe leak, however, represents just a small proportion of doxxing cases, which have skyrocketed in the past three months. Hong Kong’s privacy commission said it had received 1,376 complaints and 126 enquiries between 14 June and 18 September regarding personal information being leaked online, according to Stephen Kai-yi Wong, privacy commissioner for personal data.\n\nWhile journalists have become a high-profile target, about 40% of cases involve police officers while the rest concern government officials, community leaders, the families of police officers, and other citizens, Wong said.\n\nCraig Choy, a spokesperson for Hong Kong’s Progressive Lawyers Group and a specialist in data protection law, said the high volume of cases was unprecedented in Hong Kong.\n\n“Before [the protests], occasionally, we would see doxxing of other people but it is not very common in Hong Kong. This time and in this kind of scale and the number of victims is unprecedented,” Choy said.\n\nThe privacy commission has referred nearly 1,000 cases for criminal investigation and consideration for prosecution. Eight people were arrested in July for doxxing police officers, according to Hong Kong Free Press.\n\nChoy said doxxing of police began after officers stopped wearing badge numbers on their uniforms when they attended protests – leading protesters to attempt to identify officers independently as police tactics and arrests began to escalate.\n\nTelegram channels like Dadfindboy, with more than 136,000 subscribers, continue to share social media photos of Hong Kong police officers with other identifying information.\n\nHong Kong police were criticised this week by Amnesty International for its excessive use of force at protests and during the arrest of anti-government protesters.", "description": "Campaigns to expose personal details of those on both sides of protests skyrocket, with nearly 1,000 cases being investigated", "authors": ["Erin Hale"], "top_image": "https://i.guim.co.uk/img/media/8fdcbc6132d3569b1c7f79bd5f11342cd8f4d6ad/0_320_4823_2895/master/4823.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=49fa9141579f63516aa2a514772377fc", "published_at": "2019-09-20"}