{"pub": "businessinsider", "url": "https://businessinsider.com/next-recession-investors-using-wrong-economic-signal-raoul-pal-says-2019-9", "downloaded_at": "2019-09-14 11:18:55.432201+00:00", "title": "'The bond market is screaming at us': A Wall Street expert says investors are focused on the wrong recession signal — and warns a meltdown may come sooner than expected", "language": "en", "text": "It's not everyday that behavior in a specific asset class makes a compelling case that a recession is on the way.\n\nBut according to Raoul Pal— former hedge fund manager and founder of Real Vision— that's exactly what's happening in the bond market. And he says few few people seem to be listening to it.\n\n\"The bond market is screaming at us,\" Pal said during a recent appearance on The Meb Faber show, an investing podcast.\n\nYields have fallen off a cliff since the beginning of the year as investors scared of a slowdown have poured into bonds. And yet equities are up double digits, seemingly immune to the risk aversion pervading the fixed-income market.\n\nAnd Pal is someone worth listening to. He used to manage GLG Partners' global macro fund, and has over 27 years of experience in financial markets. Due to his success, he retired from managing the fund at age 36.\n\nPal says that investors are electing to overlook the ominous price action in credit markets — which are signaling an imminent economic downturn — and instead focusing on US consumers and the labor market. Conventional wisdom suggests both are signaling continued strength amidst the turmoil.\n\nBullish investors have highlighted these metrics, saying calls for an economic contraction are overblown. They point to an unemployment rate that's close to its lowest in 50 years, as well as consumer sentiment and spending that remains strong.\n\nBut Pal isn't buying it.\n\n\"The problem is, all of those data points are pointing to things that happened 18 months ago,\" Pal said on the podcast. \"Everybody's looking at the wrong thing.\"\n\nHe notes that employment and consumption figures are backward-looking — and according to Pal's assessment, the economic landscape is vastly different today than what these metrics are currently conveying.\n\nTo demonstrate the incongruousness of this idea, he points to the Purchasing Managers Index, which is a metric he prefers. He views it as an important, forward-looking variable that paints a contrasting picture of the economic landscape.\n\n\"Oddly enough, it maps very, very well indeed to GDP,\" he said.\n\nThe monthly PMI survey is designed to encompass the business outlook for over 400 companies, signaling whether it's improving, declining, or staying the same. And it just contracted for the first time in 10 years, echoing the nerves we're seeing in the bond market.\n\nPal says this is a clear warning sign worth heeding immediately, since the variable shares a close relationship with real-time economic growth.\n\nProblems in the corporate debt market\n\nTo further his recession argument, Pal reiterates the nefarious action he's seeing in corporate debt. A phenomenon he refers to as a \" doom loop\" — and one he thinks has the power to seize up the entire fixed-income market in one fell swoop.\n\nThe graph below depicts the gargantuan increase in corporate issuance.\n\nBoard of Governors of the Federal Reserve System (US)\n\nPal believes that if economic conditions continue to deteriorate, pension funds — which own a great deal of this debt — will be forced to sell as rating agencies downgrade a significant portion of it to junk. This would result in a deluge of supply, and limited buyers to sop it up. It's a situation that could result in catastrophe.\n\nDue to these factors, Pal now believes that the US economy is now at a \"tipping point\" — and if the data continues to deteriorate, a massive unwind will be set in motion.\n\nBut not all hope is lost. He's identified 4 trades that will make a killing if his thesis comes to fruition.\n\n\"The best trade in the world is Eurodollar futures, because the Fed are going to have to cut to zero and through it\" he said. \"If you don't really understand those — 2-year bond futures, they're fine.\"\n\nPal continued: \"If you don't understand that, TLT ETFs, even that's easy. And if you're feeling a little bit racy — and you don't mind a bit more speculation — then just buy some puts on the HYG, because the HYG is basically high yield, and high-yield is basically going to get obliterated if that BBB thing works.\"", "description": "Raoul Pal, the former hedge fund manager and founder of Real Vision, thinks the US economy is at a crucial tipping point.", "authors": ["Christopher Competiello"], "top_image": "https://amp.businessinsider.com/images/5cfad0d211e2054007798c37-1536-768.jpg", "published_at": "2019-09-14"}