{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7615545/Brian-says-Queen-NEVER-play-Glastonbury-founder-Michael-Eavis-supports-badger-cull.html", "downloaded_at": "2019-10-26 00:59:54.308068+00:00", "title": "Brian May says Queen will NEVER play Glastonbury because founder Michael Eavis supports badger cull", "language": "en", "text": "Brian May has said Queen will never play Glastonbury due to its founder's support of the badger cull.\n\nMichael Eavis, 84, who is also a dairy farmer, has called May a 'danger' over his opposition to the cull, which is aimed at curbing bovine tuberculosis.\n\nMay, 72, yesterday rubbished claims that his band had been booked to headline Glastonbury's 50th anniversary next year, saying Mr Eavis had 'frequently insulted' him.\n\nBrian May (left) has said Queen will never play Glastonbury due to its founder's support of the badger cull. Michael Eavis (right), 84, who is also a dairy farmer, has called May a 'danger' over his opposition to the cull, which is aimed at curbing bovine tuberculosis.\n\nMay, 72, yesterday rubbished claims that his band had been booked to headline Glastonbury's 50th anniversary next year, saying Mr Eavis had 'frequently insulted' him\n\nThe musician described the badger cull as an 'unnecessary crime'.\n\nIn an interview with Zoe Ball on BBC Radio 2, May said of Glastonbury: 'There is a little bit of a schism there.'\n\nHe said he would not perform at the festival 'unless things changed radically'.\n\nQueen now tours with Adam Lambert, 37, as lead singer.\n\nHe rose to fame after appearing on the US version of Pop Idol.\n\nThe Queen guitarist described the badger cull as an 'unnecessary crime'. (File image)", "description": "Michael Eavis, 84, who is also a dairy farmer, has called May a 'danger' over his opposition to the cull, which is aimed at curbing bovine tuberculosis.", "authors": ["Daily Mail Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/00/20201778-0-image-a-29_1572046537326.jpg", "published_at": "2019-10-25"}