{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/20/WS5dabd792a310cf3e35571779.html", "downloaded_at": "2019-10-20 05:12:07.288285+00:00", "title": "International Monetary and Financial Committee urges resolving trade tensions", "language": "en", "text": "Updated: 2019-10-20 11:42\n\nPedestrian with an umbrella near International Monetary Fund, IMF Headquarters 2 Building (HQ2) in DC. [Photo/IC]\n\nWASHINGTON - The International Monetary and Financial Committee (IMFC), the policy-setting body of the International Monetary Fund (IMF), on Saturday called on countries to resolve trade tensions and support the necessary reform of the World Trade Organization.\n\nIn a communique released after the 40th meeting of the IMFC, the committee said growth outlook is \"highly uncertain and subject to elevated downside risks,\" including trade tensions, policy uncertainty, and geopolitical risks, against a backdrop of limited policy space, high and rising debt levels, and heightened financial vulnerabilities.\n\n\"Free, fair, and mutually beneficial goods and services trade and investment are key engines for growth and job creation. A strong international trading system with well-enforced rules addressing current and future challenges would support global growth,\" the IMFC said in the communique.\n\n\"To this end, we recognize the need to resolve trade tensions and support the necessary reform of the World Trade Organization to improve its functioning,\" it said.\n\nLesetja Kganyago, the IMFC chairman and governor of the Reserve Bank of South Africa, said in a press conference Saturday that trade tensions have adversely impacted global trade and the global economy. \"There cannot be winners in a trade war. In the end, the biggest loser is going to be the global economy.\"\n\nIMF Managing Director Kristalina Georgieva said at the press conference what the IMFC meeting did was to clearly build the \"cost consequence chain\" from trade tensions to uncertainty, to the slowing down of investment, to a reduction of growth, to a potential erosion of jobs, and to an erosion of consumer confidence.\n\n\"I believe that there has been a very strong echo in the room of an understanding that policymakers, out of enlightened self-interest, ought to take very seriously their obligation to international cooperation in trade,\" Georgieva said.\n\n\"We will cooperate to reduce excessive global imbalances through macroeconomic and structural policies that support sustainable global growth,\" the IMFC also said in the communique.\n\nIn addition, it said countries are working toward a modern and globally fair international tax system, particularly taxation related to digitalization, and will address harmful tax competition, artificial profit shifting, and other tax challenges.\n\nReuters", "description": "WASHINGTON - The International Monetary and Financial Committee (IMFC), the policy-setting body of the International Monetary Fund (IMF), on Saturday called on countries to resolve trade tensions and support the necessary reform of the World Trade Organization.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/20/5dabda3aa310cf3e97a213fa.jpeg", "published_at": "2019-10-20"}