{"pub": "nationalreview", "url": "https://nationalreview.com/bench-memos/this-day-in-liberal-judicial-activism-october-21-2", "downloaded_at": "2019-10-21 13:09:15.221488+00:00", "title": "This Day October 21", "language": "en", "text": "1949—President Truman recess-appoints David L. Bazelon to the D.C. Circuit. With a lifetime appointment from Truman a few months later, Bazelon serves for 30 years in active status and an additional 14 years in senior status.\n\nOn his death in 1993, a New York Times obituary praises Bazelon for “expanding the rights of criminal defendants” and for disregarding precedent: “Rather than follow precedent set in a simpler time, he questioned the status quo and sought to apply new findings in the social sciences and psychiatry to issues the court faced.” The obituary also states that Bazelon “believed the judiciary should reach beyond the bench and speak out on social issues,” but that he “was assailed by conservatives as being soft on crime.”\n\nAdvertisement\n\nOne testament to Bazelon’s craftsmanship: In 1978, in a unanimous opinion written by Justice Rehnquist (in Vermont Yankee Nuclear Power Corp. v. Natural Resources Defense Council), the Supreme Court reverses decisions by Bazelon that would have overturned the Atomic Energy Commission’s grant of an operating license and a permit to nuclear power plants. Bazelon’s decisions “seriously misread or misapplied” basic principles of administrative law, the Court rules, and amounted to “judicial intervention run riot.”", "description": "1949—President Truman recess-appoints David L. Bazelon to the D.C. Circuit. With a lifetime appointment from Truman a few months later, Bazelon serves for 30 years in active status and an additional 14 years in senior status.\r\n\r\nOn his death in ...", "authors": ["Ed Whelan", "Jim Geraghty", "Mona Charen", "David French", "William Z. Nardi", "Rich Lowry", "Tobias Hoonhout", "Katherine Timpf", "Read More", "The American Conservative"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2018/02/judge-gavel-law-book-home.jpg?fit=1200%2C701&ssl=1", "published_at": "2019-10-21"}