{"pub": "reuters", "url": "https://in.reuters.com/article/television-lordoftherings/new-zealand-to-be-middle-earth-again-in-amazons-the-lord-of-the-rings-series-idINKBN1W3047", "downloaded_at": "2019-09-18 05:12:12.513759+00:00", "title": "New Zealand to be Middle-earth again in Amazon's The Lord of the Rings series", "language": "en", "text": "WELLINGTON/SAN FRANCISCO (Reuters) - New Zealand will be home again to hairy feet and pointed-ear Hobbits after Amazon Studios confirmed the Pacific country will be the location for its new “The Lord of the Rings” series, a TV show widely tipped to be the most expensive ever made.\n\nThe remains of the Hobbiton movie set from the film the Lord of the Rings at the town of Matamata in the North Island of New Zealand, September 2007. AAP Image/Tracey Nearmy/via REUTERS/Files\n\nThe Amazon.com Inc unit said the multi-series adaptation will explore new storylines preceding author J.R.R. Tolkien’s “The Fellowship of the Ring”, the first instalment in the famed fantasy trilogy set in the fictional land of “Middle-earth”.\n\nAmazon bought the TV rights to Tolkien’s literary classic two years ago when screens were ruled by HBO’s blockbuster fantasy series, “Game of Thrones”. Unlike HBO and others such as Netflix Inc, a hit for Amazon could not only draw in viewers but also shoppers to its Prime subscription service.\n\nThree movies made of The Lord of the Rings trilogy in the early 2000s were filmed in New Zealand by director Peter Jackson. They garnered nearly $3 billion at the box office and 17 Academy Awards.\n\n“As we searched for the location in which we could bring to life the primordial beauty of the Second Age of Middle-earth, we knew we needed to find somewhere majestic, with pristine coasts, forests, and mountains, that also is a home to world-class sets, studios, and highly skilled and experienced craftspeople and other staff,” showrunners and executive producers J.D. Payne and Patrick McKay said in a statement.\n\nPre-production for the series has started, and production on the series will begin in Auckland, New Zealand’s biggest city, in the coming months, the statement showed.\n\nTolkien’s prequel to The Lord of the Rings, “The Hobbit”, was also made into a movie trilogy by Jackson in New Zealand.\n\nHowever, production ran into disputes with unions in 2010 over labour contracts that nearly sent filming overseas and resulted in the government changing employment laws.\n\nThe new series is likely to boost the economy of the tiny country and create several jobs, having been widely hyped in the media as likely one of the most expensive TV shows of all time.\n\n“This is a sought after production and fantastic news for New Zealand’s screen sector and our economy,” New Zealand’s Economic Development Minister Phil Twyford said in a separate statement.", "description": "New Zealand will be home again to hairy feet and pointed-ear Hobbits after Amazon Studios confirmed the Pacific country will be the location for its new \"The Lord of the Rings\" series, a TV show widely tipped to be the most expensive ever made.", "authors": ["Praveen Menon", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190918&t=2&i=1431088530&w=1200&r=LYNXMPEF8H09P", "published_at": "2019-09-18"}