{"pub": "politico", "url": "https://politico.com/story/2019/09/03/greg-craig-trial-self-lawyering-1479457", "downloaded_at": "2019-09-03 23:49:22.111824+00:00", "title": "Greg Craig trial shows dangers of self-lawyering", "language": "en", "published_at": "2019-09-03", "text": "Greg Craig, former White House counsel to former President Barack Obama, is acting as his own lawyer. | Patrick Semansky/AP photo legal Greg Craig trial shows dangers of self-lawyering\n\nGreg Craig’s real crime might be ignoring one of the longest-standing maxims of the legal profession: He who represents himself has a fool for a client.\n\nMany of the statements that have landed the former Obama White House general counsel on trial for the past few weeks in federal court could most charitably be described as lawyerly evasions.\n\nStory Continued Below\n\nThey’re the kind of sophistry and wordsmithing that, while perhaps galling to the plainspoken person on the street, might actually see someone like Craig celebrated and amply compensated in another context.\n\n“There’s no question it’s a really blurry line,” former federal prosecutor Randall Eliason said. “There’s all this gray area around zealous advocacy and what crosses the line. … The facts of this case highlight those issues. There is a gray area between zealous advocacy and outright misrepresentation.”\n\nFor instance, when discussing the project at the heart of the case — a report he prepared in 2012 on the controversial trial of Ukrainian Prime Minister Yulia Tymoshenko — Craig appeared to assure Justice Department investigators he was simply fielding media inquiries by providing journalists with copies of the review.\n\n”This was done in response to requests from the media,” Craig wrote in an Oct. 10, 2013, letter to the Justice Department’s foreign-agent registration office.\n\nCraig’s defense argues his claim was literally true, but does so by squeezing nearly all meaning out of the 10 words, contending that all he was telling DOJ was that he had not foisted the report on unwilling reporters. In fact, Craig had emailed New York Times reporter David Sanger in October 2012, asking if he would talk to a lobbyist handling the rollout of the report, former GOP Rep. Vin Weber. Craig later directly offered the report to Sanger and even delivered it to his Washington home.\n\nCraig, 74, faces a felony false-statement charge over an alleged scheme to deceive the DOJ’s Foreign Agent Registration Act office when it sought information about work he and his former law firm — Skadden, Arps, Slate, Meagher & Flom LLP — did in 2012 examining the politically charged trial of Tymoshenko.\n\nPOLITICO Playbook newsletter Sign up today to receive the #1-rated newsletter in politics Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nCraig concluded his testimony last week, and the jury of nine men and three women is expected to begin deliberating in the case in the coming days after closing statements from the prosecution and defense.\n\nAnother passage in the same letter from Craig also seems — at first blush — to contain several flat-out whoppers.\n\n“In responding to inaccuracies in U.S. news reports — some of which were directly attributable to Ukraine — the law firm did not consult with Ukraine, did not inform Ukraine, did not act under instruction from Ukraine and was in no way serving as an agent for Ukraine,” Craig wrote.\n\nProsecutors have said there’s ample evidence Craig did, in fact, coordinate a key part of his media outreach with a public relations firm for Ukraine and a now-infamous GOP operative who served as a top strategist for Ukrainian President Viktor Yanukovych, Paul Manafort.\n\nCraig even told Sanger via email that Ukraine had picked him to get “first look” at the report.\n\nThat interaction seems sharply at odds with Craig’s assurances he “did not consult with Ukraine” and “did not inform Ukraine.”\n\nProsecutors have already harped on those denials in front of the jury. However, if allowed to do a lot of work, the clause at the beginning of the sentence could arguably make the rest of Craig’s statement true.\n\nWhen “responding to inaccuracies in U.S. news reports,” Craig does not seem to have been acting at Ukraine’s direction or to have asked for anyone’s permission. Indeed, the misstatements Craig was fighting against were generally coming from Yanukovych’s PR team and making Craig’s report sound more flattering to Ukraine than it actually was.\n\nOf course, Craig did more than just correct errors in the media, but his defense argues the assurances in his letter about not coordinating with Ukraine applied only to his effort to combat misinformation.\n\nIndeed, Craig attorney Ezra Marcus argued just that to Judge Amy Berman Jackson last week.\n\n“The reason that that statement is literally true is the clause at the beginning,” Marcus said.\n\nProsecutors, however, have railed against Craig over such hairsplitting.\n\n“He very carefully words the response to provide only half-truths and to conceal other information,” prosecutor Molly Gaston told jurors in her opening statement.\n\nThe jury will decide whether Craig’s pettifogging crossed the legal line, but several legal experts consulted by POLITICO said they doubt the Justice Department would ever have brought such a case if Craig made such arguments for a client, rather than for himself. Most lawyers would recoil from an accusation of presenting “half-truths,” but they will admit to torquing the facts to make the best case they can.\n\n“It’s called advocacy,” said Todd Presnell, a Nashville lawyer who advises lawyers on attorney-client-privilege issues. “You can certainly advocate on behalf of your client by emphasizing facts favorable to them or trying to render less relevant the facts damaging to them, as long as you stay within the bounds of the truth.”\n\nProsecutors do sometimes bring charges against individuals over flat-out falsehoods relayed through an attorney, but a criminal charge over misleading or diversionary responses directed through legal counsel is exceedingly rare.\n\n“You can never say never, but it’s highly unlikely in that situation,” Presnell said.\n\nTechnically speaking, someone could be prosecuted for misleading the government through an attorney but lawyers said that rarely happens because figuring out where the client’s spin ends and the attorney’s gloss begins is a tricky task. An outright falsehood can be a bit easier to trace from start to finish.\n\nEven though Craig was acting as his own lawyer in his dealings with the Justice Department about his Ukraine work, some see the prosecution as posing a risk to the daily work attorneys do crafting arguments and evidence presentations on behalf of clients.\n\n“Do we really want half-truths by an attorney handling a legal matter to be the basis for criminal charges?” asked Stetson University law professor Ellen Podgor. “There is a difference between ethical misconduct and criminal misconduct.”\n\nSome judges have issued stern warnings about prosecutors seeking to police misleading conduct that falls short of outright falsehoods, especially when lawyers are involved.\n\nIn 2003, San Francisco Giants slugger Barry Bonds was called before a federal grand jury investigating steroid use in professional baseball. He was later hit with a federal indictment for evasive answers he gave when asked about injections he’d received.\n\nIn 2015, the 9th U.S. Circuit Court of Appeals voted 10-1 to overturn Bonds’ conviction for obstruction of justice. The judges had trouble agreeing on why the Hall of Famer's dilatory and diversionary statements didn’t amount to obstruction, but some jurists worried that allowing such prosecutions could discourage attorneys from doing their utmost to present cases in the light most favorable to their clients.\n\n“Zealous advocacy sometimes calls for pushing back against an adversary’s just case and casting a despicable client in a favorable light, yet such conduct could be described as ‘endeavor[ing] to ... impede ... the due administration of justice,’” then-Judge Alex Kozinski wrote, joined by four other jurists.\n\n“One need not spend much time in one of our courtrooms to hear lawyers dancing around questions from the bench rather than giving pithy, direct answers.”\n\n“Making everyone who participates in our justice system a potential criminal defendant for conduct that is nothing more than the ordinary tug and pull of litigation risks chilling zealous advocacy,” added Kozinski, who resigned in 2017 amid allegations of inappropriate sexual comments to clerks and colleagues.\n\nOther judges in the Bonds case warned that allowing convictions over evasive testimony would create a perverse incentive for prosecutors to not home in on the truth.\n\n“The government is obligated to do all it can to obtain a direct statement in response to its questioning,” Judge N.R. Smith wrote, joined by three colleagues. “A statement that ‘goes off into the cosmos’ merely triggers the prosecutor’s duty to pin the witness down and elicit a clear response.”\n\nDefense attorneys have made a similar argument in Craig’s case, complaining that he is effectively charged with failing to answer questions that the head of Justice’s foreign-agent unit, Heather Hunt, never asked.\n\nDuring Hunt’s testimony last week, Craig attorney William Taylor noted that while she sent Craig a letter asking what he or others at Skadden knew about two firms doing Ukraine-related public relations work, she did not ask directly if Skadden dealt with any other PR outfits.\n\n“You could have asked, I suppose, any question you wanted about the report in the letter, could you not have?” Taylor asked.\n\n“I could have,” Hunt replied.\n\nCraig’s lawyers contend that, with the exception of one erroneous date Craig has said was a mistake, all his statements to the government were literally true. They note it has been well established for more than four decades that one can’t be convicted of perjury — in most instances, false statements — for remarks that are literally true, even if they are arguably misleading.\n\nThe Supreme Court held in a widely cited 1973 case that an evasive response doesn’t constitute perjury. “The requirements for pure perjury are really, really strict,” Eliason said.\n\nHowever, Craig isn’t charged with perjury or making false statements, but under a related provision of law that prohibits using a “trick, scheme or device” to conceal material facts from the government. Jackson ruled before Craig’s trial opened that literal truth is not a complete defense to such a charge.\n\n“Once he undertook to answer the questions, he had to answer the questions truthfully, and he could not omit facts that left his answers false or misleading in their absence,” Jackson declared last month.\n\nBut the judge said it was unclear how complete a story Craig was required to tell when trying to persuade the Justice Department to reverse a decision that Skadden needed to register. She also, ever so briefly, raised the question of whether passing statements through an outside attorney might effectively immunize skewed factual presentations that could be deemed illegal if made directly by the target of an inquiry.\n\n“Is there a duty to be truthful when you take it upon yourself to persuade the government that they're wrong about something and they need to change their decision? ... If an individual submits a white paper to the U.S. Attorney's Office saying, ‘Don't prosecute me for this or that’ — and that's usually filtered through a lawyer — but, if it was actually signed by the CEO of the company, could that” constitute a scheme to conceal material facts? the judge asked.\n\nSkadden could have gone in that direction, having a lawyer uninvolved in the Ukraine work handle the response to the DOJ, or the firm could have tapped outside counsel, as it did years later. But, at the time, the firm made the fateful decision to have one of the partners overseeing the project answer.\n\nAn email shown to jurors at Craig’s trial shows that the global head of litigation at Skadden, David Zornow, thought it would look “less defensive” for Craig to sign the firm’s response to DOJ.\n\nJurors might find the government’s case lacking for reasons beyond Craig’s wordsmithing, such as a considerable lack of clarity about what Craig said at a meeting with DOJ officials the day before the pivotal letter was sent.\n\nNo one appears to have taken any notes at the session and none of the attendees who testified could recall any specific words Craig used. That could establish reasonable doubt — if jurors can get past the strained statements in the letter Craig wrote summing up his position.\n\nThere may be no lawyer in the U.S. more familiar with the law surrounding false statements than Craig. That’s because two decades ago, he joined the team of attorneys defending President Bill Clinton against impeachment.\n\nIn the Senate trial, Craig was assigned to fight the charge related to what may be the most famous act of legal hairsplitting ever — Clinton’s statement to a grand jury about whether he lied about his sexual relationship with Monica Lewinsky. “It depends what the meaning of the word ‘is’ is,” he said.\n\nDuring Craig’s argument to senators, he conceded that Clinton erred by advancing an argument better left to his attorneys. However, Craig insisted it was no crime.\n\n“The president makes a political mistake here and gives in to his instinct to play his own lawyer, to be his own advocate,” Craig said. “You may find it frustrating, you may find it irritating when you watch him do this, but he is not committing perjury. He is committing the offense of nitpicking and arguing with the prosecutors. He is arguing a point.”", "description": "Craig concluded his own testimony last week, and the jury is expected to begin deliberating in the case in the coming days.", "authors": ["Josh Gerstein"], "top_image": "https://static.politico.com/8a/ec/44e52a224867bbe6d054989d87b9/1992-greg-craig-ap-773.jpg"}