{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/rubicon-project-acquires-rtk-io-a-leader-in-open-source-header-bidding-solutions", "downloaded_at": "2019-10-21 10:29:41.006220+00:00", "title": "Rubicon Project Acquires RTK.io, A Leader in Open Source Header Bidding Solutions", "language": "en", "text": "Acquisition Extends Company’s Managed Prebid Strategy and Client Base\n\nLOS ANGELES — Rubicon Project (NYSE:RUBI), the global exchange for advertising, today announced the acquisition of RTK.io, a leading provider of tools and services that bring simplicity and control to header bidding for publishers. RTK’s solution is built on Prebid, the same open source framework as Demand Manager, the header bidding solution Rubicon Project launched in May 2019. RTK’s technology and team enable Rubicon Project to extend its Demand Manager product portfolio and client base. In the coming months, the company plans to integrate the two solutions to address the growing needs of publishers globally. Rubicon Project acquired RTK in an all-cash transaction for $11 million.\n\n“RTK shares our commitment to open source and our passion for serving publishers with powerful tools and incredible client service,” said Michael Barrett, President and CEO of Rubicon Project. “The company has a strong group of header bidding experts and Prebid developers that adds depth to our already great team. Together, we will accelerate our shared vision of helping publishers regain control of their monetization and make quick, informed decisions to grow their businesses.”\n\nFounded in 2014 and headquartered in New York City, RTK is a programmatic infrastructure and ad operations company dedicated to making ad tech more efficient. RTK provides publishers with an integrated user interface to configure, install, and implement a complete header bidding solution. In addition, the company’s reporting and analytics capabilities are extremely fast and flexible, driving better yield management.\n\n“We are thrilled to be joining Rubicon Project and look forward to being part of the Demand Manager team,” said Gareth Glaser, Co-Founder and CEO of RTK. “Rubicon Project’s resources and footprint supporting our integrated product will enable us to bring new levels of service and innovation to publishers globally, and to further our shared vision of bringing a transparent and collaborative approach to the industry.”\n\nTo learn more about how the acquisition of RTK fits into Rubicon Project’s strategy, please see President and CEO Michael Barrett’s blog post.\n\nAbout Rubicon Project\n\nFounded in 2007, Rubicon Project is one of the world’s largest advertising exchanges. The company helps websites and apps thrive by giving them the tools and expertise to sell ads easily and safely. In addition, the world’s leading agencies and brands rely on Rubicon Project’s technology to execute billions of advertising transactions each month. Rubicon Project is an independent, publicly-traded company (NYSE:RUBI) headquartered in Los Angeles, California.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191021005162/en/\n\nContacts\n\nCharlstie Veith\n\nGlobal Head of Communications & Marketing, Americas\n\ncveith@rubiconproject.com\n\n516-300-3569", "description": "Acquisition Extends Company’s Managed Prebid Strategy and Client BaseLOS ANGELES — Rubicon Project (NYSE:RUBI), the global exchange for advertising, today announced the acquisition of RTK.", "authors": [], "top_image": "https://cts.businesswire.com/ct/CT", "published_at": "2019-10-21"}