{"pub": "reuters", "url": "https://reuters.com/article/us-mastercard-results/strong-consumer-spending-drives-mastercard-profit-beat-idUSKBN1X81D9", "downloaded_at": "2019-10-29 14:13:51.333638+00:00", "title": "Strong consumer spending drives Mastercard profit beat", "language": "en", "text": "FILE PHOTO: A Mastercard logo is seen on a credit card in this picture illustration August 30, 2017. REUTERS/Thomas White/Illustration/File Photo\n\n(Reuters) - Mastercard Inc (MA.N) on Tuesday beat Wall Street estimates for quarterly profit as customers shrugged off fears of an economic slowdown and spent more with their credit and debit cards, boosting fees for the world’s second-largest payment processor.\n\nThe company’s gross dollar volume, the dollar value of transactions processed, rose 12.4% to $1.65 trillion in the third quarter.\n\nAround 28.2 billion transactions were processed, up about 22% from a year earlier. The gain was led by a near 12% rise in the United States and a 31.4% jump in Europe.\n\nLarger rival Visa Inc (V.N) and credit card issuer American Express Co (AXP.N) had also reported better-than-expected quarterly earnings, benefiting from a rise in consumer spending.\n\nCross-border volumes at Mastercard jumped 17% from a year earlier.\n\nThe company's net income rose to $2.11 billion, or $2.07 per share, in the third quarter ended Sept. 30 from $1.9 billion, or $1.82 per share, a year earlier. [here]\n\nExcluding one-time items, the company earned $2.15 per share, while analysts had expected a profit of $2.01 per share, according to IBES data from Refinitiv.\n\nShares of the company were up 1.6% at $280.3 in premarket trading.", "description": "Mastercard Inc on Tuesday beat Wall Street estimates for quarterly profit as customers shrugged off fears of an economic slowdown and spent more with their credit and debit cards, boosting fees for the world's second-largest payment processor.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191029&t=2&i=1446167755&w=1200&r=LYNXMPEF9S0VZ", "published_at": "2019-10-29"}