{"pub": "businessinsider", "url": "https://businesstimes.com.sg/companies-markets/repsol-buys-40-stake-in-united-global-unit-for-up-to-us465m", "downloaded_at": "2019-09-30 11:31:32.592324+00:00", "title": "Repsol buys 40% stake in United Global unit for up to US$46.5m", "language": "en", "text": "GLOBAL energy company Repsol Downstream Internacional S.A. has entered a share purchase agreement with Singapore-based lubricant manufacturer and trader United Global Limited to acquire a 40 per cent stake in its wholly-owned subsidiary United Oil Company Pte Ltd for up to US$46.5 million.\n\nThe acquisition of 14,959,600 shares consists of an initial cash consideration of US$36.5 million, with a further US$10 million payable depending on the delivery of revenue related earn-out targets for FY2023, Catalist-listed United Global announced on Monday at the signing ceremony at St Regis Singapore.\n\nUpon completion of the deal, United Oil and its subsidiaries (UOC Group) will become a joint-control entity of Madrid-listed Repsol, making it part of one of the top companies in the oil and gas industry. This places UOC Group in a strategic position for new growth opportunities by leveraging Repsol's international brand presence to enhance its production and distribution, according to United Global in an exchange filing.\n\nRepsol is principally engaged in the production and marketing of oil derivatives while UOC Group blends, manufactures and distributes lubricants. The joint venture will hence allow UOC Group to manufacture and supply Repsol's brand of products across Singapore, Indonesia, Malaysia and Vietnam to accelerate its growth and increase its business volume.\n\nsentifi.com Market voices on:\n\n\"Repsol's position as an international brand with good reputation, recognised products and a good production management in place give us the opportunity to learn a lot from them and value-add to our business,\" United Global chief executive officer Jacky Tan told The Business Times (BT).\n\nThis marks Repsol's first venture into the South-east Asian market.\n\n\"We understand that there is room for growth in South-east Asia and we recognise that the lubricant business here is under-developed,\" Repsol commercial businesses and chemicals executive managing director Maria Victoria Zingoni told BT.\n\n\"Instead of going along with what we had, we decided we could do more by looking for a good local partner, and with the right relationship, we can be part of the growth in South-east Asia,\" she said.\n\nUnited Global will receive net proceeds of about US$36 million from the deal after deducting all costs and expenses, which will be used to fund future business expansion, investments and acquisitions.\n\nBased on the latest audited consolidated financial statements for FY18, United Global's net profit was about US$7.6 million. Assuming that the deal was completed on Jan 1 last year, it would result in a net profit of US$75 million, including the estimated gain from the sale shares of US$27.2 million and gains from the re-measurement of the remaining 60 per cent of United Oil's shares of US$40.7 million. This translates to US$0.2373 per share.\n\nMs Zingoni acknowledged that since Repsol is a well-known brand, it could potentially be a challenge to rebrand itself with the joint venture.\n\n\"But those are regular challenges that you have every time you start a new business and you want to expand to new geographies with new partners,\" she noted.\n\nThe proposed disposal is subject to shareholders' approval at an extraordinary general meeting to be convened. No independent formal valuation was conducted on UOC Group by United Global for the proposed disposal.\n\nUnited Global called for a trading halt last Friday prior to Monday's announcement, with its shares last traded at 47 Singapore cents.", "description": ": THE BUSINESS TIMES Companies & Markets - GLOBAL energy company Repsol Downstream Internacional S.A. has entered a share purchase agreement with Singapore-based lubricant manufacturer and trader United Global Limited to acquire a 40 per cent stake in its wholly-owned subsidiary United Oil Company Pte Ltd for up to US$46.5 million. . Read more at The Business Times.", "authors": ["Claudia Tan"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-09-30"}