{"pub": "metro", "url": "https://metro.co.uk/2019/10/14/girl-2-faces-deportation-despite-her-parents-having-british-passports-10913173", "downloaded_at": "2019-10-14 10:13:04.021563+00:00", "title": "Girl, 2, faces deportation despite her parents having British passports", "language": "en", "text": "Lindsay Dutton with her daughter Lucy who is facing deportation from the UK (Picture: Adrian White)\n\nA two-year-old girl whose parents both hold British passports faces being deported because she hasn’t lived in the UK for seven years.\n\nLucy Dutton’s child visa expired and she faces being kicked out of the country unless her family can raise £3,000 to appeal the Home Office’s decision.\n\nBoth her parents have British citizenship through their own parents but the right only extends to one generation – so Lucy has not been granted it.\n\nMum Lindsay Dutton, 30, who was born in South Africa and moved with her daughter to Swansea, Wales, last year, branded the decision ‘inhumane’ .\n\nShe claimed that a letter from the Home Office gave her daughter just 14 days to stay in the UK if they didn’t appeal the decision.\n\nLindsay Dutton, mother of Lucy, is fighting the decision to deport her daughter (Picture: Adrian White)\n\nLindsay said: ‘It’s against human rights what they are doing to us.\n\nAdvertisement\n\nAdvertisement\n\n‘It’s cruel and heartbreaking to do that to a parent, all I have done the entire week is sob.’\n\nThe Home Office letter states Lucy must have lived here continuously for seven years and recommends Lucy should return to South Africa where her mother could find employment.\n\nIt claimed the toddler ‘failed to provide evidence of a familial link between yourself and these alleged relatives’.\n\nLindsay, 30, said she has taken out a £3,052 high-interest loan to cover the application costs and needs another £3,000 to appeal.\n\nLindsay Dutton called the Home Office decision to deport her daughter Lucy ‘inhumane’ (Picture:Adrian White)\n\nGower MP Tonia Antoniazzi is lobbying the Home Secretary on behalf of Lindsay on the basis it breaches her human rights.\n\nShe said: ‘Both parents and grandparents have UK passports and all live here.\n\n‘This is a ridiculous situation which needs resolving immediately.’\n\nA Home Office spokeswoman added: ‘All applications are considered on their individual merits and on the basis of the evidence available.’\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Lucy Dutton will be kicked out unless her family can raise £3,000 to appeal Home Office's decision.", "authors": ["Paul Harper"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89813233_1571046733.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-14"}