{"pub": "investingcom", "url": "https://investing.com/news/stock-market-news/futures-tick-lower-as-fed-policy-meeting-looms-1979625", "downloaded_at": "2019-09-17 13:16:11.848275+00:00", "title": "Wall Street set to open slightly lower as Fed policy meeting looms", "language": "en", "text": "© Reuters. Traders work on the floor at the NYSE in New York\n\nBy Medha Singh\n\n(Reuters) - Wall Street was set to open slightly lower on Tuesday as investors stayed away from making big bets ahead of the Federal Reserve's two-day policy meeting, where it is widely expected to cut interest rates.\n\nThe Fed concludes its policy meeting on Wednesday, facing a host of global growth worries including a prolonged U.S.-China trade war into which the weekend bombings on Saudi Arabia's oil refinery have thrown an oil price shock.\n\nTraders currently see a 65.8% chance of a quarter percentage point cut from the Fed this week, down from 88.8% on Friday, according to CME's FedWatch.\n\n\"It's just typical trading on the vigil of a Fed meeting,\" said Peter Cardillo, chief market economist at Spartan Capital Securities in New York.\n\n\"We haven't seen any panic from what happened over the weekend. I think (the Fed) will stick with a quarter of a percentage point cut even after the Saudi attack.\"\n\nSince the last interest rate cut in July, U.S. economic data has shown mixed signals about the domestic economy. While strong retail sales and wage growth have bolstered consumer confidence, the trade war with China has weighed on manufacturing and business sentiment.\n\nDeputy-level trade talks between the United States and China are set to resume on Thursday, but any agreement between the two sides is expected to be a superficial fix at this stage.\n\nTariff concessions from both countries last week helped the benchmark to trade within 1% of its all-time high touched in July.\n\nAt 8:35 a.m. ET, <1YMcv1> were down 74 points, or 0.27%. were down 5.75 points, or 0.19% and were down 13.5 points, or 0.17%.\n\nU.S. industrial production is expected to have risen 0.2% in August after a fall of 0.2% in July. The data is due at 09:15 a.m. ET.\n\nHome Depot Inc (N: ) was the biggest decliner among Dow-listed stocks in trading before the bell, dropping 1.4% after Guggenheim downgraded the home improvement chain's shares to \"neutral\" from \"buy\".\n\nShares of Corning Inc (N: ) tumbled 10.1% after the Gorilla glass maker cut its current-quarter display volume forecast.\n\nKraft Heinz Co (O: ) slipped 2.9% after the packaged food maker's second-largest investor, 3G Capital, sold over 25 million shares in open market at a discount.", "description": "Wall Street set to open slightly lower as Fed policy meeting looms", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8G0VR_L.jpg", "published_at": "2019-09-17"}