{"pub": "nyt", "url": "https://nytimes.com/2019/09/20/nyregion/de-blasio-2020-drops-out.html", "downloaded_at": "2019-09-20 13:01:15.375129+00:00", "title": "Bill de Blasio Drops Out of 2020 Democratic Presidential Race", "language": "en", "text": "Combative interviews with Sean Hannity and Tucker Carlson on Fox News did not increase his standings in the polls or his ability to raise money. Protesters, upset that Mr. de Blasio had refused to fire the police officer who placed Eric Garner in a chokehold before he died, interrupted both a national debate and a CNN town hall in which the mayor participated.\n\n“This is what democracy looks like and no one said it was pretty,” Mr. de Blasio responded on Twitter to the protesters who disrupted the second Democratic debate in July.\n\nEven Mr. de Blasio’s successes on the campaign trail were marred by mishaps. After being praised for his performance in the first debate in Miami, Mr. de Blasio quoted Che Guevara, the Cuban revolutionary, during a union protest the next day, angering the local anti-Fidel Castro Cuban community.\n\nNew Yorkers repeatedly questioned whether Mr. de Blasio should travel from rural Iowa to the Nevada desert to address a handful of listeners about the travails of working people when there were serious problems to address in the largest city in the country such as rising homelessness and a public housing crisis.\n\nThe mayor’s whereabouts became an issue in July when a 13,000-volt cable fire caused 72,000 New Yorkers to lose power in Manhattan. Mr. de Blasio was delivering a stump speech at a union hall in Waterloo, Iowa, but fretted about returning to the city.\n\nHe gave an update live on CNN, allowing space for Corey Johnson, the City Council speaker who is angling to be the next occupant of Gracie Mansion, to provide New Yorkers with constant and precise updates via social media. The mayor was unable to return to New York until the next day, hours after the power had already been restored.\n\n“New Yorkers want their mayor to be a national figure, but they want him to do it from the steps of City Hall because they want the garbage picked up,” said Sid Davidoff, a supporter of Mr. de Blasio’s who was the deputy campaign manager for John V. Lindsay, the last person to run for president while still mayor of New York City.", "description": "Mr. de Blasio, the New York City mayor whose campaign was seen as a long shot and often described as quixotic, never gained traction.", "authors": ["Jeffery C. Mays"], "top_image": "https://static01.nyt.com/images/2019/09/20/world/00HFODeBlasio/00HFODeBlasio-facebookJumbo.jpg", "published_at": "2019-09-20"}