{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/11/iac-outlines-its-plans-for-a-match-group-spinoff", "downloaded_at": "2019-10-11 19:37:18.597131+00:00", "title": "IAC outlines its plans for a Match Group spin-off – TechCrunch", "language": "en", "text": "Digital media holding company IAC has taken the next step toward spinning off Match Group, with a proposal outlining what that process would look like.\n\nMatch Group (which owns Tinder, PlentOfFish, OkCupid, Hinge and of course Match itself) is already a publicly traded company, but IAC remains the majority owner. With the spin-off, IAC says it should distribute its Match Group shares to IAC stockholders, “resulting in two independent public companies.”\n\n“Today IAC proposed an important first step in the separation of Match Group from IAC,” said IAC CEO Joey Levin in a statement. “IAC is confident that the proposal communicated to the Match Group special committee provides strong footing for Match Group to begin its journey as a thriving, independent company.”\n\nUnder the proposal (which IAC says still needs to be approved by its board of directors, as well as the aforementioned special committee, as well as stockholders), Match Group’s dual-class stock structure would be eliminated, creating a single class of stock.\n\nThe company said in August that it was exploring spin-offs of both Match Group and ANGI Homeservices.\n\nIn his statement today, Levin said, “As it relates to evaluating our ownership stake in ANGI Homeservices, we don’t currently expect to turn our attention to the question of a spin-off until a Match Group transaction has been completed.”", "description": "Digital media holding company IAC has taken the next step toward spinning off Match Group, with a proposal outlining what that process would look like. Match Group (which owns Tinder, PlentOfFish, OkCupid, Hinge and of course Match itself) is already a publicly traded company, but IAC remains the majority owner. With the spin-off, IAC says […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/GettyImages-1084876154.jpg?w=526", "published_at": "2019-10-11"}