{"pub": "wsj", "url": "https://barrons.com/articles/houdini-sportswears-drive-toward-sustainable-innovation-01569524221?mod=rsswn", "downloaded_at": "2019-09-26 21:00:54.053258+00:00", "title": "Good Company: Houdini Sportswear’s Drive Toward Sustainable Innovation", "language": "en", "text": "Houdini is a cult-favorite in the high-end mountaineering market, in part because of its spirit of change and sustainable innovation.\n\nText size\n\nIn the late 1980s, mountaineer Lotta Giornofelice quietly began making technical, snug-fitting base and mid layers that filled a missing void for her and her high-level mountain-climbing friends.\n\nThey needed precise insulation, the kind that would stand up to tough Scandinavian ski and climbing expeditions.\n\nThe initial line of garments kept these athletes’ essential muscles warm, but didn’t cause overheating during extended activity. Giornofelice sold the first releases out of the trunk of her car to friends.\n\nBy 1993, she had a few years of light production underneath her belt, producing the exact clothes that their mountaineering community was lacking. She had enough success to open a small office in Stockholm, branded as Houdini Sportswear (named after the famous magician, whose name is sometimes called on the mountain when in need of an escape route).\n\nMore than 25 years later, Houdini has cemented itself as a cult-favorite in the high-end mountaineering market not only because of its apparel performance, but because of a constant spirit of change and sustainable innovation.\n\nTHE ITEMS\n\nWith a history on the mountain behind the company, Houdini has tried and tested gear for just about any winter-related need.\n\n“We quite often hear that our products are ‘addictive,’ which matches our ambition to exceed customer expectations,” says Houdini CEO Eva Karlsson, who joined the company in 2001.\n\nShe notes that some of their most popular items include the Mr. Dunfri, a stowable, insulated jacket padded with Primaloft Gold Eco that’s recycled to the level of one PET bottle, meaning the material can be recycled over and over again. (Occasionally, new fabric might have to be added to retain full performance capabilities.) There is also a “Ms.” version available that follows the same guidelines.\n\nAdditionally, their Power Air Houdi is an insulated mid-layer jacket made from a new version of Polartec fleece that releases up to 80% less microfiber than other fleeces through wear-and-tear.\n\nThe Sleepwalker skirt is one of their more interesting offerings as a unisex insulation layer that’s highly packable as well. Houdini also makes a range of snow jackets and bottoms, all with a sustainable component.\n\nHoudini jackets range from US$250-US$700. Erik Nylander\n\nPRICE\n\nHoudini apparel is at the higher end of the market with jackets ranging from US$250-US$700. Bottoms start at US$120 for tights and top out just under US$500 for their highest-performing snow pants. Mid-layers are priced from US$120-US$300 and shirts run US$60-US$200.\n\nDESCRIPTION\n\nWell before much of the outdoor industry began to consider its environmental impact, Houdini was already working on ways to “close the loop” with their apparel production.\n\nIn 2005, they became one of the first European brands to move from virgin to recycled polyester in shell layers and to begin transitioning to a circular system for closed-loop garment recycling. The full scope of their plans began to bear fruit in 2006.\n\n“Moving from linear to circular without compromising performance, quality, comfort, or aesthetics was something we had been working on since 2001. It took five years but that was a huge breakthrough considering our goal was to eliminate the concept of waste,” Karlsson says.\n\nBeyond a reputation for sheer performance and durability, Houdini also launched a number of environmentally focused initiatives over the next decade in everything from garment recycling to proprietary biodegradable fabric development. The result cemented the brand as one of the industry leaders in sustainable production in an era where fast fashion (the highly-polluting “linear” model) was the driving economic force in the apparel business.\n\nWHAT’S THE GOOD?\n\nIn 2018, Houdini released a company assessment entitled This Is Houdini based on the strict Planetary Boundaries standards that outline recommendations for the “stability and resilience” of Earth for generations to come. The company was the first in any industry to review their practices at this level in an attempt to understand their total environmental impact.\n\nIn short, Houdini discovered the much broader implications of the industry’s environmental issues. The report tackles everything from microplastics to phasing out destructive PFC-based Durable Water Repellents. Among a variety of benchmarks, Houdini announced they reached 100% fluorocarbon-free production, the product of an eight-year transition and implementation.\n\nAs of this fall, the company’s Fall/Winter 2019-20 lineup will be their first to be made from completely 100% sustainable materials, whether recycled, recyclable, Bluesign-certified, or biodegradable. It’s a significant milestone for a company focused on environmental leadership.\n\n“Moving from linear to circular requires knowledge, research, and innovation at the polymer level for products in the technological cycle and knowledge, research, and innovation at the microbial level for products in the natural cycle,” Karlsson says. “It is for sure a co-creative effort, and I believe what we bring to the table that is essential is through leadership, science-based principles, uncompromised commitment, and a sense of urgency.”\n\nThe company's Fall/Winter 2019-20 lineup will be their first to be made from completely 100% sustainable materials. Erik Nylander\n\nWHAT’S NEXT\n\nThe company’s goals are nothing short of ambitious for an outdoor company.\n\nBy 2022, Houdini plans on being 100% circular, completely closing the chain of garment production through end use. The goal is to have all garments made from recycled, renewable, or biodegradable materials and encourage customers to return products once they’re done with them so they can be recycled into new garments once again. It’s a substantial undertaking that requires the commitment of a number of stakeholders, inside the company and outside of it. In tandem, they’ll have 100% traceability and transparency throughout the process.\n\n“All in all it’s about building a smart circular system for the flow of products, resources, and knowledge that allows and inspires our end-users to re-connect to nature and spend more time in the great outdoors,” Karlsson says.", "description": "How the Swedish company’s tough environmental standards have pioneered on-mountain performance and off-mountain industry leadership", "authors": ["Geoff Nudelman"], "top_image": "https://images.barrons.com/im-111321/social", "published_at": "2019-09-26"}