{"pub": "businessinsider", "url": "https://businessinsider.co.za/whatsapp-stokvel-scam-national-stokvel-association-of-sa-nasasa-pyramid-scheme-2019-10", "downloaded_at": "2019-10-09 10:43:02.020407+00:00", "title": "If you joined a ‘WhatsApp stokvel’ you’ve probably been scammed", "language": "en", "text": "A stokvel association has warned South Africans that \"WhatsApp stokvels\" are likely to be pyramid schemes.\n\nThis after people lost hundreds of rands by joining \"stokvels\" with anonymous administrators.\n\nA stokvel is a savings scheme where a group of people come together to save, or increasingly invest, jointly.\n\nFor more stories, go to Business Insider SA.\n\nThe National Stokvel Association of SA (Nasasa) has warned South Africans that WhatsApp stokvels are most likely to be pyramid schemes rather than genuine savings vehicles – and those who have joined them have probably been scammed.\n\nThis after WhatsApp messages have been doing the rounds encouraging people to invest in a stokvel for R200 and make R1,000 profit, Jacaranda FM reported.\n\nLike most pyramid schemes, the first few to join received a pay-out, but those who followed often lost all their money.\n\nEWN reported that victims would join a WhatsApp group after they made the R200 payment, only to see the group administrator disappear, with no further word on their money.\n\nSee also: No, Chicken Licken is not selling jobs for R300\n\nFounder and chairperson of Nasasa Andrew Lukhele told TimesLive that scammers were using the popularity of stokvels to create pyramid schemes and take advantage of people.\n\n\n\nLukhele said traditional stokvels are based on trust where everyone in the stokvel knows each other, and the terms of payout have already been set.\n\nSee also: South Africans will save so much money through stokvels this year that they could buy Pick n Pay in cash and still have R10 billion left over\n\nThe Whatsapp scams, he said, often involves anonymous people, so it is impossible to track or trace the money when it disappears.\n\nA stokvel, derived from “stock fair”, is a savings scheme where a group of people come together to save or increasing invest together, Business Insider South Africa previously reported.\n\n(Compiled by James de Villiers)\n\nReceive a daily email with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "A stokvel association warned South Africans that 'WhatsApp stokvels' are likely pyramid schemes, not a way to save.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9452/9d638f0d20c6463184b262b1f2634759.png", "published_at": "2019-10-09"}