{"pub": "hotair", "url": "https://hotair.com/headlines/archives/2019/10/conservatives-say-liberals-say-bother-thats-problem", "downloaded_at": "2019-10-12 06:45:31.223112+00:00", "title": "Conservatives say “I do.” Liberals say “Why bother?” And that’s a problem.", "language": "en", "text": "Families provide a certain amount of “social insurance” — someone to care for you if you’re sick, or provide backup income if you’re unemployed, or take care of the kids when you need to be elsewhere. If you don’t have those benefits, then you’ll look elsewhere for them — and today, “elsewhere” probably means the government. You’re also likely to be unfriendly to socially conservative messages that suggest you ought to be married.\n\nWhich explains why unmarried women are among the Democratic Party’s strongest constituencies, having gone for Hillary Clinton by 31 points over Donald Trump in 2016. (Married women also supported Clinton, but by a narrow margin, 49 to 47 percent.) And unmarried women with children are even more overwhelmingly Democratic; 74 percent of them voted for Barack Obama in 2008, long before Trump arrived, with news of his adult-film-star payoffs and bragging about molesting women.\n\nBut the IFS study also shows that conservatives do value marriage more than moderates or liberals. Among conservatives, 80 percent say marriage is needed to create strong families; among liberals, that figure is only 33 percent. It’s possible that the causation runs in the other direction — that conservatives congratulate themselves for a lifestyle they chose for other reasons — but it’s hard to imagine what those other reasons might be. No, it seems reasonable to assume that more conservatives get married because more conservatives think it’s important to be married, especially before having children.", "description": "", "authors": ["Megan Mcardle", "Washingtonpost.Com Opinions Conservatives-Say-I-Do-Liberals-Say-Why-Bother-Thats-Problem"], "top_image": "", "published_at": "2019-10-12"}