{"pub": "businessinsider", "url": "https://pedestrian.tv/news/newcastle-pole", "downloaded_at": "2019-10-28 07:35:40.355021+00:00", "title": "In A Moment Of A+ Urban Planning, Newcastle Now Has A Power Pole In The Middle Of A Road", "language": "en", "text": "In news that is just too much for my Monday afternoon brain to handle, some dickhead in Newcastle has put a power pole in the middle of the road.\n\nREAD MORE Get Yr Studded Belts Ready 'Coz The Veronicas Are Releasing Their OG Albums On Vinyl\n\nAs if Monday mornings aren’t tough enough, residents in Newcastle awoke to the perplexing sight of a power pole in the middle of the Foundry and Albert Street intersection in Wickham, according to the Newcastle Herald.\n\nThe pole has just been sitting in the middle of the road after tradies had to abandon road works over the weekend due to safety concerns.\n\n“Just bizarre — what else can you say,” Warwick, a Novocastrian businessman told news.com.au today.\n\nIn a truly “Newcastle” attempt to resolve the issue, a pile of those god-awful looking orange barriers have been put up around the pole. You know, so nobody crashes into it.\n\nBut residents aren’t stoked about the situation, claiming the works have been ongoing for at least a week with no resolution in sight.\n\n“It’s been there for a week, they’ve been working on this for ages,” Warrick said. “Apparently installing a roundabout eventually. The designer certainly made a few boo-boos.”\n\nBut the local council reckons this isn’t just a big oopsie daisy, claiming they couldn’t fix the rogue pole even if they wanted to.\n\nAccording to Newcastle City Council Chief Executive Jeremy Bath, the council can’t actually do anything about the rogue post because of a ban on “live work” put in place by Ausgrid.\n\nFollowing the accidental electrocution of an employee in April, electricity provider Ausgrid have put a temporary halt on any work that involves power. I’m no expert here, but I’m fairly certain everything electricity companies do requires power.\n\n“Anything involving electricity, they will not touch,” Bath told Triple M in an interview.\n\n“So any time that we need — and we do a whole heap of work where we want Ausgrid to come in and actually turn something off essentially, like a telegraph pole so it can be relocated — Ausgrid say ‘Sorry, we can’t do it at the moment.”\n\nThe temporary live work ban came into action after the death of 39-year-old Robert Nicholls, who died while replacing a low-voltage power pole earlier this year. Following the incident, which was the first death in 20 years, Ausgrid has undergone an extensive safety evaluation.\n\nSo, because the council couldn’t remove the pole, they just decided to continue with the rest of the road works and remove the kerb from around it. It’s unclear why anyone thought that was a good, or a safe idea, but it happened.\n\n“So our choices are we either do no work or we have to stage work such as what you’re seeing in Foundry St.”\n\nThe whole situation is all just a little bit fucked. Ausgrid are trying to keep their employees safe, the city council are trying to actually get work done, and the end result is a wildly inconvenient pole in the middle of Foundry Street.\n\nThe City Of Newcastle Council and Ausgrid are working to resolve the issue as soon as possible because it is clearly a safety hazard for local residents.\n\nNobody is really in the wrong here, and nobody wants to take the blame for it. The result, you ask? A big fuck off power pole in the middle of the street.\n\nAhh, Newcastle. The only city where this story isn’t surprising in the slightest.", "description": "A rogue pole has been left on Foundry Street in Newcastle after the council removed the kerb, but didn't remove the power pole itself.", "authors": ["Lavender Baj"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/10/r0_324_766_865_w1200_h678_fmax.jpg", "published_at": "2019-10-28"}