{"pub": "thestreet", "url": "https://realmoney.thestreet.com/investing/stocks/no-shortage-of-candidates-for-next-year-s-portfolio-of-losers-15106440", "downloaded_at": "2019-09-27 16:24:43.779002+00:00", "title": "No Shortage of Candidates for the Next Portfolio of Losers", "language": "en", "text": "In December I'll be rolling out my 2019 Tax Loss Selling Portfolio, but wanted to give an early preview. With the S&P 500 up about 19% year to date, the presumption might be that there simply won't be an adequate number of candidates. Not to worry, there will be plenty. Small-caps and microcaps have not done as well as their larger and midcap counterparts, with the Russell 2000 Index up about 15%, and Russell Microcap up about 9%, and there are plenty of companies that have taken a beating this year.\n\nThe trick here is to identify those that might ultimately recover. Beaten-up stocks often face greater pressure heading into year-end as investors and institutions sell off the losers in order to offset gains, and that might -- with the emphasis on \"might\" -- set them up for a recovery in the New Year.\n\nThe screening criteria are very simple:\n\nDown at least 30% year to date,\n\nForward price-to-earnings (P/E) ratios below 15 in the next two fiscal years\n\nMinimum market cap of $100 million\n\nIn 2016, 42 candidates made the cut. That number more than doubled in 2017 and exploded to more than 200 last year. From those candidates I've whittled the list down to those I find most interesting. While it's too early to predict how big the pool will be this year, I can tell you that there are currently 221 names with a minimum market cap of $100 million that are down at least 30% over the past year. I will revisit that list with updated, year-to-date return figures and forward P/Es data in late November\n\nThere are some big names on the list, including Altria Group Inc. (MO) , Carnival Corp. (CCL) , Biogen Inc. (BIIB) and Halliburton Co. (HAL) . There's a repeat offender from this year's list, Kraft Heinz Co., (KHC) , which has been this year's worst performer.\n\nAs you might imagine, the list is dominated by retailers, including Kohl's Corp. (KSS) , Tapestry Inc. (TPR) , Nordstrom Inc. (JWN) , At Home Group Inc. (HOME) , Macy's Inc. (M) , L Brands Inc. (LB) and GameStop Corp. (GME) , to name a handful. There are also plenty of names related to oil and gas, which is not all that surprising.\n\nThe notion of buying down-and-out name that also have relatively cheap valuations has borne fruit in the years that I've been conducting this experiment; however, one thing has become quite clear. They don't all work out. Some of the names continue to get hammered, and there's usually one or two out of the group that soar. This year, it has been Winnebago Industries Inc. (WGO) , Skechers U.S.A. Inc. (SKX) and General Mills Inc. (GIS) doing the heavy lifting. Last year it was Dine Brands Global (DIN) and Wesco Aircraft Holdings Inc. (WAIR) that did the heavy lifting. In 2017, it was all Weight Watchers (WTW) .\n\nIf I've learned anything from this, it has been the importance of buying several names that fit the criteria rather than concentrating in one or two.", "description": "Dozens of beaten-up stocks could see tax-loss selling into the end of the year; here's a preview of some that could make up the next Tax Loss Selling Portfolio....MO", "authors": ["Jonathan Heller", "No Shortage Of Candidates For The Next Portfolio Of Losers", "Dozens Of Beaten-Up Stocks Could See Tax-Loss Selling Into The End Of The Year", "Here'S A Preview Of Some That Could Make Up The Next Tax Loss Selling Portfolio.", "Stocks Quotes In This Article", "James", "Rev Shark", "Bruce Kamich", "Jim Cramer", "Stephen Guilfoyle"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/157179e8-d3bc-11e7-a8e6-6d5724689a1f.png", "published_at": "2019-09-27"}