{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/2019/10/15/new-poll-shows-elizabeth-warren-leading-democratic-field-with-percent", "downloaded_at": "2019-10-15 12:28:18.459263+00:00", "title": "A new poll shows Elizabeth Warren leading the Democratic field, with 28 percent", "language": "en", "text": "In the most recent George Washington University Politics Poll, the senator from Massachusetts leads the Democratic field with 28 percent of the vote. Sanders is second at 21 percent, and Biden, the front-runner since his entrance into the race, is at 18 percent. South Bend, Ind., Mayor Pete Buttigieg and Sen. Kamala D. Harris each draw 5 percent.\n\nAlthough it’s just one survey, the findings suggest that Warren’s growing popularity, evident in other polls, comes from her increasing appeal beyond the party’s left wing. And with Warren also establishing herself as the second choice for many Democrats currently backing other candidates, she may be well-positioned to pick up more support as the field thins.\n\nAD\n\nAD\n\nThe GW Politics Poll is a joint venture of George Washington University’s School of Media and Public Affairs, Department of Political Science, and Graduate School of Political Management. The survey, conducted by YouGov and including interviews with 600 Democrats and Democratic-leaning independents, went into the field Sept. 26, two days after House Democrats announced their impeachment inquiry, and was completed Sept. 30. As a result, respondents were probably aware of Biden’s entanglement in the Trump-Ukraine drama but didn’t know about Sanders’s heart attack, which was revealed after the poll ended.\n\nWarren appears to be broadening her appeal\n\nWarren has throughout the campaign had her strongest support from the most liberal Democrats. And, not surprisingly, 4 in 10 voters who call themselves “very liberal” say they would vote for her. But the survey confirms she is now winning over other voters. Among Democrats who call themselves simply “liberal,” she is polling at 33 percent, 12 points ahead of Sanders and 17 points better than Biden.\n\nAD\n\nAD\n\nBiden, meanwhile, continues to hold a lead among moderate and conservative Democrats, with 28 percent. But in what may be a sign of concern, he is polling just 12 points better among those voters than both Warren and Sanders.\n\nWarren’s improvement among less liberal Democrats also means she’s doing slightly better with black voters, who are more ideologically conservative than whites. Long mired in single digits, Warren is at 13 percent among black voters (and Sanders at 12) in the GW Politics Poll, though she still trails Biden at 35 percent by a significant margin.\n\nWarren’s image is also evolving. Respondents were asked whether they prefer elected officials who “make compromises with people they disagree with” or those who “stick to their positions.” Despite Warren’s reputation as a proponent of “uncompromising liberalism,” 34 percent of Democrats who said they prefer compromise are backing her. Among those who prefer politicians to stick to their positions, Sanders is the top choice (26 percent), with Biden at 20 percent and Warren at 18.\n\nAD\n\nAD\n\nWarren is the prevailing second choice\n\nPerhaps the poll’s most bullish finding on Warren comes from asking respondents whom they would support if their favored candidate dropped out or they had to choose someone else. Warren is the second choice of 34 percent of voters who support another candidate. That includes 45 percent of Biden voters and 31 percent of Sanders voters.\n\nOn the other hand, the numbers don’t look as good for Sanders and Biden. Sanders is the second choice of just 21 percent, and Biden is the second choice of 17 percent.\n\nAt the same time, Warren has work to do to win over voters who aren’t currently backing one of the other top-polling candidates (Biden, Sanders, Buttigieg and Harris). Among supporters of the many candidates polling below 5 percent, 20 percent have Biden as their second choice and 18 percent have Warren. This appears to be a function of ideology, as the lower-tier candidates’ supporters tend to be more moderate.\n\nAD\n\nAD\n\nBut views about Warren may also be less crystallized. Seventy-two percent of Democrats say they have a favorable impression of her, trailing Sanders (79 percent) and slightly better than Biden (69 percent). But 12 percent don’t know enough to give her a rating, twice as many as her two main rivals. Assuming Warren continues to get lots of media attention, that number will almost certainly diminish.\n\nThe implication of all this is that among the three front-runners, Warren appears to be in the best position to pick up supporters when other candidates start to pull the plug.\n\nWarren’s rise isn’t about women\n\nFinally, the GW Politics Poll also suggests that Warren’s rise is not being driven mainly by an increase in support among female voters. In an analysis for FiveThirtyEight in September, Amelia Thomson-DeVeaux found that Warren’s polling for most of the campaign had been about three points higher among women than men. In a reversal, our survey has Warren as the first choice of 29 percent of men and 26 percent of women.\n\nAD\n\nAD\n\nThat suggests that an increase in the support of male voters is responsible for at least part of Warren’s recent trajectory. And the shift of the men’s vote may have come at Biden’s expense. Although Thomson-DeVeaux’s analysis found Biden polling roughly equally with men and women, in our survey he is at 22 percent among women but just 15 percent among men.\n\nOf course, this one poll is a snapshot, and the state of the race remains fluid. But as the candidates take the debate stage Tuesday night, the recent news for Warren certainly appears favorable, especially as Biden and Sanders continue to contend with distractions on the campaign trail.\n\nAD", "description": "That’s 7 percent ahead of Sanders and 10 percent ahead of Biden.", "authors": ["Danny Hayes"], "top_image": "https://www.washingtonpost.com/resizer/5UQ4wMnPtxstR1TzGQNiL5YTdpU=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BHB6PXXL5II6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-15"}