{"pub": "cbc", "title": "Meet the man hired to end a western Quebec town's surgeon shortage | CBC News", "url": "https://cbc.ca/news/canada/ottawa/maniwaki-surgeon-malek-tabbara-1.5267751", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:04:53.300959+00:00", "text": "A town north of Gatineau, Que., hit by a surgeon shortage in the last several months is hoping the arrival of a new doctor will address that gap.\n\nDr. Malek Tabbara is about two months into a five-year contract at the Maniwaki Hospital.\n\nThe community of nearly 4,000 people had one of its surgeons suddenly retire in the fall of 2018. That retirement, along with a shortage of anesthesiologists, has meant that on multiple occasions the hospital has either had to close its surgical department or pay extra to bring in specialists from other regions.\n\nTabbara, who studied in Lebanon, Paris and the United States before his most recent fellowship in Montreal, was officially approved by the province's governing board in April.\n\n\"My goal is to do good in the region. This makes me feel good because I have a job in Quebec, which has welcomed me,\" he said in a French-language interview.\n\nWhile the Maniwaki Hospital has hired a new surgeon, it's still bringing in anesthesiologists from other regions to keep its operating room open. (CBC)\n\nLong process\n\nTabbara said the hiring process took longer than he'd like because he graduated from medical school outside of Canada or the United States.\n\nIf it were easier to hire internationally-trained doctors, it would help both communities in need of French-speaking doctors and the physicians themselves, he said.\n\n\"Despite my two years I spent doing my fellowship in Montreal, I still had to have my skills recognized,\" he said. \"It went well [for me], but I know doctors who have to do an internship for their skills to be recognized.\"\n\nThe Maniwaki Hospital is still relying on a team of anesthesiologists from elsewhere in the region to fill in, which has kept the operating room from having to close.", "description": "A town north of Gatineau, Que., hit by a surgeon shortage in the last several months is hoping the arrival of Dr. Malek Tabbara will fix that gap.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5267764.1567427687!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/malek-tabbara-maniwaki-surgeon-doctor-hospital-shortage.jpg"}