{"pub": "bbc", "url": "https://bbc.com/news/world-middle-east-49633146", "downloaded_at": "2019-09-09 10:26:47.607753+00:00", "title": "Syria war: 'Air strikes' hit Iran-backed forces near Iraq border", "language": "en", "text": "Warplanes have struck positions of Iran-backed militias near Syria's border with Iraq, activists say.\n\nThe Syrian Observatory for Human Rights, a UK-based monitoring group, said at least 18 Iranian and pro-Iranian fighters were killed.\n\nIt was not clear who carried out the overnight strikes in and around the town of Albu Kamal.\n\nBut Israel has carried out hundreds of attacks on Iranian-linked targets in Syria during the country's civil war.\n\nIt has sought to thwart what it calls Iran's \"military entrenchment\" in Syria and shipments of Iranian weapons to militant groups such as Hezbollah in Lebanon.\n\nMedia playback is unsupported on your device Media caption A young face destroyed by war: The impact of an airstrike one year on\n\nThe Syrian Observatory for Human Rights cited its sources as saying the unidentified warplanes had bombed bases, arms depots and vehicles belonging to Iran-backed militias in al-Hizam al-Akhdar and other areas around Albu Kamal.\n\nOmar Abu Layla, a Europe-based activist from the DeirEzzor 24 group, said powerful explosions were heard across the town, and that there was a \"state of chaos and panic\" among the militia fighters.\n\nAnother activist group, Sound and Picture, cited medical sources as saying 21 people were killed, and that militias had taken all the bags of blood at Albu Kamal's hospital to treat their wounded fighters.\n\nHours later, a number of rockets were launched towards Israel from the outskirts of the Syrian capital, Damascus, but failed to hit Israeli territory, according to the Israeli military.\n\nIt blamed militia fighters operating under the command of the Iranian Revolutionary Guards' Quds Force, but said it held the Syrian government responsible.\n\nMeanwhile, Hezbollah said its fighters had shot down an unmanned Israeli drone over southern Lebanon early on Monday and seized it.\n\nThe Israeli military said one of its drones \"fell inside southern Lebanon during routine operations\". It did not give a reason, but said there as \"no concern information could be taken from it\".", "description": "A monitoring group says 18 fighters were killed in the overnight raids near the Iraq border.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/6A1E/production/_108666172_syriaalbukamal9760919.png", "published_at": "2019-09-09"}