{"pub": "bbc", "url": "https://bbc.co.uk/mediacentre/latestnews/2019/me-my-brother-and-our-balls", "downloaded_at": "2019-09-25 23:29:09.716875+00:00", "published_at": "2019-09-25", "title": "BBC Three commissions Me, My Brother And Our Balls", "language": "en", "text": "What started as an attempt to shed light on an issue that affects so many men turned into an incredibly personal journey for me and my family and has brought me even closer to my brother, Ben.\n\nChris, who rose to fame on Love Island, was aiming to raise awareness for testicular cancer and encourage men to check themselves. What he didn’t expect was the effect it would have closer to home.\n\nAs a consequence of that appearance and inspired by his brother for having had the ‘balls’ to do it, Chris’s older brother Ben checked himself for the first time, found a lump and was diagnosed with testicular cancer. Prior to an operation to have his testicle removed, Ben went to freeze his sperm for potential use after the operation. It was during this process that he discovered his sample didn’t contain any sperm at all.\n\nBen’s cancer diagnosis has brought the fertility issue into focus for both brothers. Chris previously had a health scare due to a problem with his testicles and has subsequently undergone several operations. His last sperm test was six years ago and he is long overdue another test.\n\nIt’s not just the Hughes brothers who are struggling with fertility issues. Studies show the sperm count of western men has more than halved in the past 40 years and is currently falling by an average of 1.4% a year. There is no definitive understanding of the reason why.\n\nBen’s scare combined with the fact that both brothers are in new relationships has inspired the boys to tackle the issue head on. The film features both brothers’ partners, including Chris’s girlfriend Jesy Nelson, whose recent BBC Three documentary, Odd One Out, had huge impact.\n\nIn the same vein of spotlighting personal, impactful stories Me, My Brother and Our Balls will bring a fresh and authentic take to the largely unexplored but highly topical issue of male fertility.\n\nChris Hughes says: “What started as an attempt to shed light on an issue that affects so many men turned into an incredibly personal journey for me and my family and has brought me even closer to my brother, Ben. I also learned things about male fertility that really surprised me, so hopefully people will find the documentary educational. Fertility is often a subject that guys don’t consider until it might be too late, so I’m hoping this documentary will raise awareness and help men who might be struggling with these issues.”\n\nMe, My Brother And Our Balls is a 1x40’ for BBC Three. It is produced by Twenty Six 03 Entertainment. It was commissioned by Head of Documentaries Clare Sillery and BBC Three Controller Fiona Campbell. The Commissioning Editor is Max Gogarty. The Director is Dominic Sivyer. The Executive Producers are Pamela Gordon and Antonia Hurford-Jones.\n\nRG", "description": "When Chris Hughes appeared on live television to have a testicular examination it made a huge impact. Facebook views of the clip total over thirty-five million and continue to rise.", "authors": ["Chris Hughes"], "top_image": ""}