{"pub": "reuters", "url": "https://in.reuters.com/article/afghanistan-election-education/afghanistans-taliban-tells-teachers-students-to-block-presidential-elections-or-risk-death-idINKBN1W315N", "downloaded_at": "2019-09-18 10:38:36.203612+00:00", "title": "Afghanistan's Taliban tells teachers, students to block presidential elections or risk death", "language": "en", "text": "KABUL (Reuters) - Afghanistan’s Taliban insurgent group on Wednesday warned teachers, students and other education workers to avoid the upcoming presidential vote or risk dying in attacks on election centres.\n\n“Do not allow election organisers to turn your schools and institutions into electoral centres, and teachers and students should not work as electoral staff,” said the Taliban statement.\n\n“We do not want to cause the loss of lives and financial losses for civilians, teachers and students,” it said.\n\nIn 10 days, Afghanistan will hold its fourth presidential election since United States-led forces toppled the hardline Islamist Taliban from power in 2001. The insurgents have sworn to violently disrupt the vote, which comes in the aftermath of collapsed peace talks between the militants and the United States.\n\nSchools and universities make up between seven and eight out of every ten polling centres across the country, and though no students, teachers or education officials are being hired as election workers, they can volunteer, said Abdul Aziz Ibrahimi, a spokesman for Afghanistan’s election commission.\n\n“We are committed to holding elections on the announced date, and such threats from the Taliban cannot prevent us from holding them,” the spokesman said.\n\nThe Ministry of Education was not immediately available for comment, but the United Nations and international donors have asked it to help with elections because of its relatively developed infrastructure.\n\nOn Tuesday, Taliban attackers killed nearly 50 people in separate suicide bombings, one targeting an election rally for incumbent President Ashraf Ghani, who is seeking a second five-year term.\n\nSecurity across the country has been tight in the run-up to the vote, after threats by the Taliban to attack meetings and polling stations. The group has vowed to intensify clashes with Afghan and foreign forces to dissuade people from voting in the upcoming elections.\n\nLast week, peace talks between the United States and the Taliban collapsed. The two sides had been seeking to reach an accord on the withdrawal of thousands of American troops from Afghanistan in exchange for security guarantees from the insurgents.\n\nThe negotiations, which did not include the Afghan government, were intended as a prelude to wider peace negotiations to end more than more 40 years of war in Afghanistan.", "description": "Afghanistan's Taliban insurgent group on Wednesday warned teachers, students and other education workers to avoid the upcoming presidential vote or risk dying in attacks on election centres.", "authors": ["Abdul Qadir Sediqi", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-18"}