{"pub": "cbs", "url": "https://cbsnews.com/news/know-my-name-chanel-miller-victim-impact-statement-brock-turner-emily-doe-stanford-assault-60-minutes-2019-09-04", "downloaded_at": "2019-09-05 02:12:18.041195+00:00", "title": "Stanford sexual assault victim reveals her identity", "language": "en", "published_at": "2019-09-04", "text": "\"Emily Doe,\" the anonymous sexual assault victim whose impact statement was read by millions before the #MeToo movement caught fire, will appear on \"60 Minutes,\" putting her own voice, name and face to her powerful words. Chanel Miller tells her story for the first time in an interview with Bill Whitaker to be broadcast on \"60 Minutes,\" Sunday, September 22 at 7:30 p.m. ET and 7 p.m. PT on CBS.\n\nChanel Miller speaks with \"60 Minutes\" correspondent Bill Whitaker\n\nMiller, who has written a memoir called \"Know My Name,\" read her victim impact statement in court to her assailant, the former Stanford swimming standout Brock Turner, who was convicted of three felony sexual assault charges supported by two eyewitnesses who stopped and subdued him. Her story became a cause célèbre when the statement was published online after Turner was sentenced to six months jail time. In the statement, \"Emily\" recounts her inability to control her own narrative in a justice system she says is brutal and dehumanizing for victims.\n\nTurner served three months of the six-month sentence that also included three years of probation and the requirement to register as a sex offender. The judge in the trial was recalled for the lenient sentence he gave Turner.\n\n\"Know My Name\" appears in bookstores September 24.", "description": "For years she was known as \"Emily Doe,\" the young woman sexually assaulted in 2015 by Brock Turner. Now she's revealing her name, face, and voice", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/09/04/a277c82c-e7e8-46d7-9afa-0beb290b0443/thumbnail/1200x630/5e792206c51659fddedd2f73f2717c3e/emily-intv-tp12-one.jpg"}