{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/brexit-news-latest-boris-johnson-eu-brussels-further-faster-deal-a9154506.html", "downloaded_at": "2019-10-13 23:37:10.091957+00:00", "title": "Brexit: EU tells Boris Johnson he must move ‘further and faster’ to get deal in time", "language": "en", "text": "The EU has told Boris Johnson he must move “further and faster” in last-ditch Brexit talks if he is to secure an exit deal and avoid having to ask for another extension next weekend.\n\nOfficials said intensive talks over the weekend had been “constructive” but that the pace of progress was not enough for a deal to be agreed this week.\n\nMr Johnson is desperate for an agreement to be signed off before Saturday to avoid him having to ask for further delay to Brexit.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBut while EU sources said that a breakthrough during the prime minister’s talks with his Irish counterpart, Leo Varadkar, last week meant there was now “a deal to be done”, they urged Mr Johnson to make further concessions to secure an agreement.\n\nOne told The Independent: “The UK is going to have to move much further and faster if it wants a deal by Saturday.”\n\nUnder the terms of the so-called Benn Act passed by parliament last month, Mr Johnson must ask the EU for another delay to Brexit if an exit deal has not been approved by MPs by next Saturday.\n\nThe prime minister has repeatedly said he will not seek an extension and will instead deliver his “do or die” pledge to deliver Brexit by 31 October.\n\nOn Sunday, Jean-Claude Juncker, the European Commission president, said he thought Mr Johnson would “probably not” request a further delay but that he would be willing to grant an extension if needed.\n\nWhile talks were described by the EU last night as “constructive” and sources said the mood in Brussels was “cautiously optimistic”, officials doubt that a deal will be in place in time to be be signed off at a European Council summit at the end of this week.\n\nInstead, an emergency summit is increasingly likely to be needed to finalise an agreement. This would take place either next week or as late as the week after – possibly just two or three days before Britain is due to leave the bloc.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nThat would make it all but impossible for Mr Johnson to get the legislation needed to implement the deal through parliament in time, raising the prospect of a short delay, possibly of one month, to ensure that the necessary laws are in place.\n\nSome EU officials believe that an even longer delay will be necessary, with post-Brexit customs arrangements so complex that up to three months may be needed to thrash out all the details.\n\nDespite fears that time is running out, EU sources said that Mr Varadkar giving the nod for further discussions after his meeting with Mr Johnson last week meant the bloc was able to move forward while keeping its promise not to cast Ireland adrift.\n\nMr Johnson held lengthy discussions with the Irish taoiseach after it became clear that the likes of France and Germany would take Ireland’s lead on a potential alternative to the controversial Northern Ireland backstop, rather than placing pressure on Dublin.\n\nAn EU source said: ”Both sides think there is a deal to do. The crucial change is that Ireland is on board for a deal.”\n\nShape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty\n\nThe plan reportedly being discussed in Brussels would see Northern Ireland adopt the same tariffs as the EU, which would remove the need for customs checks on the border with the Republic of Ireland. However, the collections of customs would be managed by the UK and Northern Ireland would be part of future UK trade deals.\n\nThe plan is similar to a proposal put forward by Theresa May earlier this year, but the idea was quickly dismissed by the EU, meaning no serious discussions were held on it.\n\nThat means that significant work is now needed to finalise a legal text agreeable to both sides.\n\nA statement from the European Commission described talks over the weekend as “constructive” but added: “A lot of work remains to be done.”\n\nBriefing EU ambassadors on Sunday night, Michel Barnier, the bloc’s chief Brexit negotiator, said the latest negotiations had been “difficult”.\n\nDiscussions between officials are due to continue on Monday, and Brexit is likely to have been top of the agenda for talks between Angela Merkel, the German chancellor, and Emmanuel Macron, the French president, in Paris on Sunday night.\n\nEarlier in the day, Mr Johnson updated his cabinet during a 30-minute conference call, warning that there was still a “significant amount of work” to do before a deal can be struck.\n\nAfterwards, a No 10 spokesperson said: “The prime minister updated cabinet on the current progress being made in ongoing Brexit negotiations, reiterating that a pathway to a deal could be seen but that there is still a significant amount of work to get there and we must remain prepared to leave on 31 October.\n\n“The prime minister said there was a way forward for a deal that could secure all our interests, respect the Good Friday Agreement, get rid of the backstop and get Brexit done by 31 October so we can push on with domestic agenda.”\n\nEven if Mr Johnson does secure a deal with the EU, he will then have to turn to the tricky task of ensuring it secures parliament’s approval.\n\nThat will involve winning over the DUP, whose deputy leader, Nigel Dodds, warned on Saturday that any proposal which would see Northern Ireland remain in the EU customs union ”cannot work”.\n\nIn an attempt to ensure that Tory Brexiteers step into line, Jacob Rees-Mogg, the House of Commons leader and a prominent Eurosceptic, insisted that Mr Johnson could be “trusted” to deliver Brexit.\n\nWriting in the Sunday Telegraph, he said of the prime minister: “His charisma and intellect are undoubted, and his electoral appeal has been tested and proved in London. In the final stages of the Brexit negotiation, compromise will inevitably be needed, something even the staunchest Leavers recognise, albeit unwillingly – but, as a Leaver, Boris can be trusted.\n\n“He wants to take back control and has dedicated his political career to this noble cause.”\n\nNew analysis by academics at King’s College London found that Mr Johnson’s proposed deal would leave people in the UK £2,000 worse off compared to staying in EU and would deliver a significantly bigger hit to national income than if the UK had left on the terms of Theresa May’s deal.", "description": "The EU has told Boris Johnson he must move “further and faster” in last-ditch Brexit talks if he is to secure an exit deal and avoid having to ask for another extension next weekend. Officials said intensive talks over the weekend had been “constructive” but that the pace of progress was not enough for a deal to be agreed this week. Mr Johnson is desperate for an agreement to", "authors": ["Benjamin Kentish"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/10/18/boris-suspicious.jpg", "published_at": "2019-10-13"}