{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Food/made-top-10-pinterest-halloween-recipes-2019-spooktacular/story?id=65599347", "downloaded_at": "2019-10-01 09:27:35.958902+00:00", "title": "I made the top-10 Pinterest Halloween recipes of 2019 and they were spooktacular", "language": "en", "text": "It’s here, it’s here! October, that is -- Halloween is still 30 days away.\n\nInterested in Halloween? Add Halloween as an interest to stay up to date on the latest Halloween news, video, and analysis from ABC News. Add Interest\n\nBut I like to get the celebrating started early, so I dove right in to making the top-10 Halloween recipes of 2019 on Pinterest.\n\nThis is quickly becoming an annual tradition for me, as last year was the first time I tried my hand at making the top recipes of 2018. Last year, chicken and rice stuffed peppers that looked like jack-o'-lanterns ended up being my favorite of the bunch, so I was excited to see what recipes made the cut this year.\n\nTo my surprise, there was no overlap in the recipes at all so I was excited to start fresh. The recipes were as boo-tiful as they were fang-tastic to eat. So for all my fellow Pinterest witches out there -- these recipes are the pick of the patch!\n\nPink Brain Mousse in White Chocolate Skulls\n\nRecipe IRL:\n\nABC News\n\nIf you're a perfectionist, this recipe is not for you. Getting these skulls right took a lot of patience and in the end I still didn't end up with the beautiful, whole skulls that I had pictured in my mind. Dealing with melting chocolate disks can always be fickle if you're trying to mold something perfectly, as the chocolate has to be hot enough to melt, but not too hot to overcook and seize.\n\nI normally use my crock pot for melting chocolate, instead of the microwave, which I find can burn chocolate fast. I put a mason jar with melting disks in a crock pot set to high and waited about 20 minutes for the chocolate to melt. I did that when prepping this recipe, but for whatever reason the chocolate wouldn't get thin enough for me to easily fill the mold. I kept having to squish semi-melted chocolate into the mold with a spoon.\n\nWhen I put them in the freezer and took them out, the back of the skull was never attached to the front no matter what I did, so I had to try to use more chocolate to fuse them together and refreeze them outside of the mold. Aside from those issues, I found it hard to \"crack\" the chocolate skulls without breaking them and ended up with totally broken heads half the time. I probably made more than two dozen versions of these before getting ones I felt were decent enough to photograph.\n\nI will say that the mousse brains were delicious -- so good in fact that I ate some of it with a spoon instead of eating it in the chocolate skull! That was definitely the best part of the recipe and fairly easy to make. All in all though this recipe took a lot longer than I expected both because of all of the chocolate issues, but also I whipped the cream by hand (silly me!). This can be a fun one to make with the whole family since there's zero real cooking required, but be prepared for messy skulls and bits of broken chocolate all over the kitchen.\n\nGET THE FULL RECIPE HERE.\n\nRecipe reprinted courtesy of Mom Foodie.\n\nDark Chocolate Halloween Cookies\n\nRecipe IRL:\n\nABC News\n\nThese cookies were so decadent and rich I thought that I'd end up eating all the batter and having no mix left to make the cookies (sadly I'm not kidding). I followed this recipe to a T except for the optional instant espresso powder. I also used black and orange M&M's as opposed to just orange ones, which I found harder to find. The cookies were delicious, but they turned out a little flatter than I intended or expected. I think it might have something to do with the fact that when I added the dry ingredients to the wet ones, I had the standing mixer on high and about a half a cup of dry ingredients ended up in the air (and on my stove and floor).\n\nMaybe much of the baking powder and baking soda was in that half a cup and that's why they turned out a little flat. Otherwise, I loved how they turned out (and tasted) and I'd definitely make this recipe for any Halloween party or get together. It's also a fun and fairly simple recipe to make with kids. I suggest pressing extra M&M's right onto the cookies too, so that the color really pops as opposed to just having them in the batter. This is definitely a Halloween recipe that I'd recommend to anyone. Maybe adding a drop or two of black food dye would have made them a little spookier, but honestly I think it's fine as is.\n\nGET THE FULL RECIPE HERE.\n\nRecipe reprinted courtesy of Simply Happy Food.\n\nShrunken Potato Heads\n\nRecipe IRL:\n\nABC News\n\nThis recipe was overall pretty simple, with very few ingredients or cooking skills required! The carving of the potatoes was the hardest and most time consuming part of this recipe.\n\nOne thing I learned from making this recipe was to buy a pumpkin carving kit and use pumpkin carving tools to carve the potatoes versus a knife which is a little more cumbersome to carve with. I got my carving tools in a kit at Michael's and they worked great. I also ended up using black sea salt to season the potatoes instead of regular salt, as I thought the black specks gave the potatoes an even spookier vibe. I think the potatoes turned out as ghoulish as I wanted them to and they definitely tasted good -- who doesn't love a good ol' baked potato?\n\nThe avocado sour cream mixture was also a good pairing with it. I'm more of a standard baked potato, sour cream, butter and chive type of girl, though, so if I was making it again I'd probably just dye sour cream green with food dye rather than making the avocado mixture.\n\nI will say though that I can't picture anyone eating these at Halloween parties, as baked potatoes aren't really a party snack. I'd say this recipe works better for a Halloween dinner or small gathering. I also used Yukon Gold Potatoes because I couldn't find Charlotte Potatoes.\n\nGET THE FULL RECIPE HERE.\n\nRecipe reprinted courtesy of Tesco.\n\nPoison Apples\n\nRecipe IRL:\n\nABC News\n\nThere's nothing that screams Halloween more than candy apples! This was my first time making candy apples, and while I liked how they turned out, making them wasn't without its troubles. The recipe is easy enough, but I felt like the entire time the sugar coating was at risk of burning in the pot. Right when it got to the consistency I wanted it to, I started to dip the apples in, but I felt like the sugar mixture wasn't deep enough and I hadn't made enough of the coating using this recipe to make the dipping easy. I had to use a spoon to keep coating the top of the apples to make sure that I got them fully coated.\n\nAbout halfway through the process I got nervous that the sugar was burning, so I turned off the burner thinking that it'd remain hot enough for the next few minutes to give me enough time to coat the other half of my apples. Instead, the consistency quickly started to turn stickier, and soon, the candy coating started to form strings when I would try to put a finished apple on the parchment, ruining the perfectly coated apples.\n\nWhen I was done, I realized that you could see through my candy coating to the color of the apples which is unlike the original Pinterest recipe. I couldn't figure out if it was because I didn't put enough blue food dye in (I used food color drops vs. food color gel) or if it needed a second coat. I started to try to coat them again to make them bluer, but all I ended up doing was make the coating stringier and sticker, causing a mess.\n\nIf I wasn't trying to be so perfect with these, I think the recipe would have been pretty simple. But I'd recommend making double the amount of sugar coating than the recipe calls for to make it easier to dip the apples, and make sure you have enough candy coating for all 12 apples. I'd also make sure you put in more food dye than the recipe, to make sure that your blue comes out dark and spooky.\n\nGET THE FULL RECIPE HERE.\n\nRecipe reprinted courtesy of Travel Cook Tell.\n\nWitches Brew\n\nRecipe IRL:\n\nABC News\n\nAt first I thought this recipe was so easy to try as part of this process that honestly it almost felt like cheating. I mean, how can you mess up mixing a drink and coating shot glasses with sugar? Then I made the recipe just as the directions said, by mixing blue and red food coloring together to make purple -- and will you believe it when I tell you that the purple concoction photographed brown!? I swear that it looked purple in real life, and then every time I took a picture it was a muddy brown. I thought I was going crazy!\n\nSo of course I didn't want to put an ugly brown photo on my beautiful article. After literally taking five hours to cook cockroach donuts (see below) and managing to master THAT, how could a drink be the recipe that I have to do twice? So I tried again, making it even darker with more food dye, and same thing -- but this time a muddier brown.\n\nSo then I gave up and dyed it black so that I could get a halfway decent photo to grace this page of the internet.\n\nI think the drink is a good idea in theory, but I do worry about the food dye turning tongues black. I'm all game for spooky snacks at Halloween parties, but black teeth is too far for even me.\n\nGET THE FULL RECIPE HERE.\n\nRecipe reprinted courtesy of Sprinkles & Sprouts.\n\nMummy Pizza Pies\n\nRecipe IRL:\n\nABC News\n\nThis recipe was by far my favorite! So easy to make and it tasted great. It's also the perfect food to serve at Halloween parties -- kid and adult friendly.\n\nI modified this recipe a little bit by using Pillsbury crescent roll dough for the mummy strips and using Pillsbury biscuit dough for the base of the pizza since I couldn't find sheets of puff pastry dough at the store. This ended up working out in my favor because each biscuit was the perfect size for a pizza when flattened out, and the perforated crescent roll triangles were easy to separate into strips. This also meant that I didn't have to use a circle cutter to get the bottom of the dough to be perfect circles.\n\nAt first I started cutting the strips to be the same size with scissors, but I quickly realized I didn't need to be that precise about it and started tearing it and it worked just as well. Instead of using tomato puree I used jar sauce, I skipped the onions and peppers and used mozzarella cheese instead of cheddar cheese. I used scissors to cut the eyes out of provolone cheese slices and an edible marker pen to make the pupils.\n\nMy one regret here was putting the \"eyes\" on when the pizzas were still hot, because the cheese started sweating when I took the pictures. But overall I'd definitely recommend making this recipe because it was easy and tasty.\n\nGET THE FULL RECIPE HERE.\n\nRecipe reprinted courtesy of Eats Amazing blog.\n\nBrimstone Bread\n\nRecipe IRL:\n\nABC News\n\nI've never made bread before or dealt with yeast, so I didn't really know what I was getting myself into when making this recipe. Let me tell you that I have a newfound respect for all you bakers out there -- this is HARD work! You really need patience for this recipe too, as it requires a lot of down time just waiting for the dough to rise, so I'd recommend making this recipe on a day when you have a lot of time to dedicate to it.\n\nMaking the red bun dough was fairly easy, but when I used my mixer to mix it it kept rising and getting stuck in the very top of the mixer tongs before all the flour was mixed in. To avoid this I'd recommend using a bigger mixer as mine is fairly small. I used the 8 drops of food coloring as recommended but by the time my dough was done mixing it was a light pink and not red. At this point I started adding in a lot more drops of food coloring into the dough as I kneaded it, which made for one very messy table and dough that was a bit tie-dyed. I'd recommend doubling the amount of food coloring the recipe calls for to make sure it's a deep red instead of a pink.\n\nAfter waiting an hour for the dough to rise and then transferring it to baking sheets, I found I only got about 12 buns not 16. The black topping came out a lot less watery than the recipe and a lot more 'dough-like,' so I spread it on the buns with a frosting knife instead of using my heads to spread it or pouring it on. They turned out just as I wanted them to which I was happy about and tasted as buns normally do but with a bit more crunch.\n\nI'd recommend serving these hot with some butter or something to mix the buns in (maybe hummus) so they don't feel so bland at a Halloween party.\n\nGET THE FULL RECIPE HERE.\n\nRecipe reprinted courtesy of Eats the Dead and Alison's Wonderland Recipes.\n\nBurrito skulls\n\nRecipe IRL:\n\n\n\nABC News\n\nThis recipe was delicious and one of the only one of the bunch besides Mummy Pizzas that I got to eat as a real full meal for dinner. I definitely made more modifications to this recipe though than the others.\n\nFirst off, I didn't want to make my own dough from scratch so instead I looked to buy puff pastry sheets of dough. When I couldn't find it, I bought Pillsbury crescent roll dough, but since the perforated lines are already in the dough, I ended up having to flour a table and roll out the dough anyway so I might as well have just made it from scratch.\n\nThe crescent roll dough is definitely not the same as the homemade burrito dough -- it's a lot thicker and fluffier than a burrito calls for -- but it still tasted delicious. The thickness of the dough also prevented it from taking on the shape of the skull so visibly, as the recipe's thin burrito dough did, and although you can see they are skulls the effect isn't as dramatic.\n\nI also edited the taco meat recipe, using ground sirloin, taco seasoning, corn and cheddar cheese like the recipe calls for, but subbing in a cup of jar salsa for the tomatoes, nixing the black beans and adding onions and peppers instead. The recipe was DELICIOUS.\n\nThis will be a hit at any Halloween party hands down and will go like hotcakes! In fact, I only made five of these since I only bought one package of Pillsbury crescent roll dough and my fiancé and I gobbled them up for dinner and wished we had more.\n\nIf I were to recreate this recipe again for a Halloween event, I'd definitely keep the taco meat just as I made it but would make the dough from scratch so that it looked and felt more like a burrito.\n\nGET THE FULL RECIPE HERE.\n\nRecipe reprinted courtesy of Hungry Happenings.\n\nCockroach Doughnuts\n\nRecipe IRL:\n\nABC News\n\nI must admit that this recipe weighed on me for weeks. I was so nervous to attempt this and balked at the amount of hours I knew it'd end up taking me. It took me five hours by the way. Yes, you heard that right, five whole hours. I was definitely proud of the outcome though and I will say that this recipe is the one that was the \"talker\" amongst all my friends when I told them I was doing this project, and I'm sure it'd be a talker at any Halloween party too.\n\nI definitely had some hiccups along the way in making this recipe, the biggest of which was that my dough, after its first rise, was such a sticky and wet consistency it was impossible to knead. I must have added three whole cups of flour to it to even make it manageable, and I wish I'd had the foresight to add some more sugar to it too, because the end result donut could have used it.\n\nCutting the dough with oval cookie cutters wasn't a problem (I used both 3\" and 4\" for variety, but wish I'd just used 4\" because the bigger they are the easier they are to fill with cream). I got impatient waiting another hour for the dough to have its second rise so I put them in the oil a little more quickly than I should have as some were the nice puffy quality I wanted but some definitely weren't.\n\nI also wish I'd cut the extra dough strips to be used for the \"legs\" much thinner than I did. They puff up quickly in the hot oil and they look more like cockroach legs and antennae if they are really thin. Side note: I realized while I was making the \"cockroach legs\" that if you throw some powder sugar on it, it's basically a funnel cake recipe!\n\nMaking the Boston cream filling was actually fun and it tasted great. I kept eating it with a spoon for the duration of the rest of the recipe because it was so good. I will say that the vanilla bean paste was not only expensive but hard to find, so honestly I'd try to find an alternative and maybe use vanilla extract instead. It probably won't taste exactly the same but will save you the trouble and the money. I fumbled my way through piping the filling into the donuts (wow, that's not easy), but making the chocolate glaze was easy.\n\nBesides the making of the dough, the hardest part of this recipe was the decorating. Dealing with sticky caramel is never fun and I definitely suggest using a pizza cutter to cut the caramel into strips like the recipe calls for. At first I tried with a knife but the caramel kept getting stuck. I found cutting the caramel strips down to size pretty hard and it took me a long time to decorate all the cockroaches.\n\nI used black cookie icing to \"paint\" the donuts, and it worked just as fine as food dye since it's a thin consistency. Dealing with the glazed, painted, caramel lined donuts was a messy business and after many attempts with poking and prodding I found it way too hard to insert the legs and antenna into the donuts. Instead I only inserted the antenna and laid the donuts on the legs to give it the effect without driving myself nuts.\n\nOverall, this recipe screams creativity and will definitely spook out guests, but it's a lot of work and takes a lot of patience so don't say I didn't warn you!\n\nGET THE FULL RECIPE HERE.\n\nRecipe reprinted courtesy of Jeromina Juan.\n\nJack-o-lantern chips & dips\n\nRecipe IRL:\n\nABC News\n\nIf you want to give all your ghouls pumpkin to talk about, then try this recipe. This recipe was so fun to make because it involved pumpkin carving -- and nothing brings back fond, nostalgic memories of childhood Halloween than pumpkin carving!\n\nThe design of the carving was fairly simple and took very little time and the drawn on eyes were basic as well. I took the easy way out and made the guacamole by mixing three avocados with a half jar of salsa. I also used jar queso as opposed to making it on my own as well like the recipe calls for. This was the very last recipe I made, so after the donut project I was wiped out! But I'm happy with the results here and I'd definitely recommend this recipe overall.\n\nFor the little effort it took it looks great and can be a centerpiece on a Halloween snack table.\n\nHave a very be-witching Halloween!", "description": "I made everything from cockroach Boston cream doughnuts to burrito-stuffed skulls!", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/MainImage_HalloweenRecipes_v01_sd_hpMain_16x9_992.jpg", "published_at": "2018-10-29"}