{"pub": "fox", "url": "https://foxnews.com/entertainment/ewan-mcgregor-daughter-abortion-rape-addiction-depression", "downloaded_at": "2019-10-01 04:30:07.608410+00:00", "title": "Ewan McGregor's daughter says she was raped, had abortion, suffered drug addiction in 'year of hell'", "language": "en", "text": "Ewan McGregor’s daughter, Clara, has revealed she was raped, beaten and suffered pill addiction and depression in a heartrending open letter.\n\nThe brave model and actress, 23, who also had an abortion, lifted the lid on her “year of hell” in the hope “it can help others feel less alone.”\n\nTaking to Instagram, she wrote: “I’ve been so ashamed of some of my mental health issues that I haven’t even wanted to tell friends.\n\nEWAN MCGREGOR SPENT NINE MONTHS WITH HIS KIDS FOLLOWING AFFAIR SCANDAL\n\nEWAN MCGREGOR THANKS BOTH ESTRANGED WIFE AND CURRENT GIRLFRIEND IN SPEECH\n\n“This past year I dealt with addiction, I got sober, and I dealt with a great deal of depression and anxiety, I had an abusive relationship, I had an abortion, the list goes on.”\n\nClara, who has three younger sisters, added: “I’ve suffered from crippling anxiety since I was 4. [It] has stopped me living the life I wanted to lead. It was a cage I still struggle to get out of.\"\n\nEWAN MCGREGOR'S DAUGHTER CLARA CALLS HIS MISTRESS MARY ELIZABETH WINSTEAD 'A PIECE OF TRASH'\n\nEWAN MCGREGOR FILES FOR DIVORCE FROM WIFE AMID MARY ELIZABETH WINSTEAD AFFAIR\n\n“I’ve also struggled with substance abuse, it led me to Xanax and I’m proud to say I’ve been clean and sober off of pills for 110 days.”\n\nHer post – a year after she appeared with her dad in the \"Christopher Robin\" film – also revealed she had been attacked by an unnamed ex.\n\nEWAN MCGREGOR'S DAUGHTER SEEMINGLY SLAMS HIM IN SONG\n\nClara, who lives in New York, wrote: “I was ashamed of the abuse I had let happen to me. I blamed myself for the bruises, the black eyes, the rapes and for the attacks a man did to me.\n\n“But I’m regaining this power now . . . I feel so loved and blessed with where I am now.”\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nHundreds of followers have posted messages of support — calling Clara “beautiful and brave” for speaking out.\n\nThis article originally appeared in The Sun.", "description": "Ewan McGregor’s daughter Clara has revealed she was raped, beaten and suffered pill addiction and depression in a heart-rending open letter.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/ewan-mcgregor-clara.jpg", "published_at": "2019-09-30"}