{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/13/spotlight-falls-max-scherzers-right-arm-nationals-braves-starts-friday-night", "downloaded_at": "2019-09-13 18:12:22.637046+00:00", "title": "Max Scherzer in spotlight as Nationals-Braves starts Friday night", "language": "en", "text": "The only remedy is to keep pitching. It’s the only way for Scherzer to prove to the team and himself he’s back to his Cy Young-caliber self, the only way to show he’s here to stay. The Nationals are depending on him to make this leap, because this week they tweaked their rotation to start him in Friday’s series opener against the Braves. This decision was not only important for Scherzer to display his progress against a potent lineup but also to line him up for later.\n\nThe schedule now puts him as the starter on regular rest for a potentially important season finale at home against the Cleveland Indians — or it could give him two extra days rest before the National League wild-card game on Oct. 1.\n\nThe question now is not the durability. Scherzer said last week against the New York Mets he felt good adding to his workload, despite one bumpy inning, and last Sunday against the Braves he felt great at “full-throttle,” a phrase of which he’s fond.\n\n“I was even ready to pitch the seventh inning,” he added after the Braves game. “Really thought I had 110 pitches today.”\n\nBut the Nationals, in a winner-take-all game, don’t need length as much as they usually might. They can dip into the bullpen early and often, and that includes fellow starters, if necessary. What they need is Scherzer’s best stuff.\n\nMax Scherzer looks more like Max Scherzer as Nationals pound Braves, 9-4\n\nThe veteran right-hander dominates when he throws his mid- to high-90s fastball, a mid-80s slider that falls out of the zone and a mid-80s change-up that bears enough resemblance to a fastball to get some swings-and-misses but also stays mostly out of the strike zone as to not let batters who recognize it inflict too much damage. He complements these with the occasional low-90s cutter and high-70s curveball. Those velocities are one thing, and he’s hit them consistently since his return, but it’s movement that he’s concerned about.\n\nHe measures progress in fastball life and spin rates, which are measured in revolutions per minute and primarily track how much a pitch moves and changes trajectory. Scherzer didn’t love the shape of his pitches as he traversed the comeback trail, but he understood that it’d take time regain them. His initial outings showed the rust as the fastball wasn’t as lively as normal and the rotation on each pitch type varied almost each time he threw them.\n\nLast Sunday against the Braves pointed upward. The fastball life showed signs of stirring, including on a 98-mph ball to Ronald Acuna Jr. in the third inning, and the spin rates reflected Scherzer’s apparently increased nastiness on the mound. His slider and cutter moved more consistently, and his curveball must’ve looked to hitters as though it were flying down a roller-coaster. The ball revolved as much as it had in June, one of the best months of his career.\n\n“I’m just frustrated it took this long,” Scherzer said of his progress after last Sunday. “I’ve been wanting this to happen a lot quicker than the way it has been and [have been] doing everything to make it happen.”\n\nFacing an offense as difficult as the Braves for the second time in as many starts provides a formidable, as well as useful, proving ground. Atlanta has scored the sixth-most runs in baseball this season behind the sixth-best team on-base-plus-slugging-percentage (.794). They feature a dangerous, do-it-all leadoff hitter (Acuna Jr.), a fearsome, middle-of-the-order left-handed bat (Freddie Freeman) and flexibility to, for the most part, mix left- and right-handed hitters through the order. Their depth is such that even the No. 8 hitter (Dansby Swanson) has a .253 batting average and 17 home runs.\n\nScherzer seems up for the task. His stamina is there and his stuff looks as though it’s shaping up. But he needs to prove, as he did in rehab with his back, that he can sustain this progress and that it’s not a lingering issue. The Nationals and Scherzer need him to be at his best because, well, both their seasons might depend on it.\n\nRead more:\n\nFor some Marines, intramural softball championship at Nationals Park is ‘like a dream come true’\n\nStephen Strasburg and an effective bullpen help Nationals hold off Twins on Wednesday\n\nDave Martinez tearfully shares memories of being on field for first game in New York after 9/11\n\nDave Martinez has to walk a fine line with Nationals’ late-season bullpen management\n\nNationals reliever Jonny Venters can’t stay on the mound, but he can’t walk away, either", "description": "The Nationals need their ace to show that the progress with his stuff is sustainable, because they’re relying on him.", "authors": ["Sam Fortier", "Sports Reporter"], "top_image": "https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7ED3K3WO2UI6TJRABKIWK3L5WY.jpg", "published_at": "2019-09-13"}