{"pub": "bbc", "url": "https://bbc.com/news/world-europe-49686818", "downloaded_at": "2019-09-13 11:11:16.555976+00:00", "title": "Macron pension reform: Paris paralysed by massive strike", "language": "en", "text": "Image copyright Reuters Image caption Some workers took to electric scooters to beat the strike\n\nThe French capital is seeing huge jams and massive crowds on the few metro lines running as transport workers strike against planned pension reform.\n\nTen of Paris's 16 lines were shut and service on the others was disrupted.\n\nMany workers cycled, walked or stayed at home, while free rides were on offer on transport operator RATP's e-moped and Uber's e-bike and scooter networks.\n\nThe strike, the biggest since 2007, is the first big act against President Macron's plan for a universal pension.\n\nIt would replace dozens of different pension schemes for different professions.\n\nMembers of other professions including lawyers, airline staff and medical workers have called for more strikes starting on Monday.\n\nWhat is the situation in Paris?\n\nThere were 235km (145 miles) of traffic jams in the Paris region, officials said, more than double normal levels.\n\nLocal media showed photos of crammed platforms on four metro lines, where some trains were running.\n\nLe Parisien newspaper said a legal requirement to maintain a minimum level of service - in place following a big strike in 2007, which was also against a pension overhaul - was not being fulfilled.\n\nThree of the city's five regional rail lines, run by national rail operator SNCF, were running as normal but the two other lines were offering a reduced rush hour service and no trains at all during the rest of the day.\n\nTravellers reported a surge in prices on ride-hailing services, with one journalist posting a screenshot showing a ride across the city costing €100 (£90), about three times the usual fare.\n\nHowever Uber was also offering two free 15-minute rides on its Jump electric bikes and scooters in the city. RATP meanwhile was offering free 30-minute rides on the Cityscoot network of electric mopeds.\n\nParis has about 20,000 electric scooters available for hire.\n\nWhy is the pension reform controversial?\n\nRATP's three main unions have called the strike a \"shot across the bow\" for Mr Macron's reform plans.\n\nMetro workers say the new universal pension would force them to work longer by taking away their right to retire early, negotiated decades ago to compensate for having to work long hours underground.\n\nOn average, Metro workers retire at 55 while most French workers retire at 63.\n\nImage copyright Reuters Image caption The busy République metro station was closed\n\nThe move to a universal points-based pension system would also remove the most advantageous pensions for a range of jobs ranging from sailors to notaries and including Paris opera workers.\n\nMeanwhile those retiring before 64 would receive a lower pension. For example someone retiring at 63 would receive five percent less.\n\nOn Thursday French Prime Minister Edouard Philippe insisted the reforms would be fair for everyone.\n\n\"We're going to construct a truly universal system where every euro paid in will provide the same rights for everyone, whether a labourer, a shop owner, a researcher, a farmer, a civil servant, a doctor or an entrepreneur,\" he said.\n\nThe French government wants parliament to vote on the plans early next year.\n\nLast year lawmakers overwhelmingly voted in favour of overhauling rail operator SNCF, which saw employees lose generous job and pension guarantees. That followed months of rolling strikes by SNCF workers.", "description": "Most metro lines are not running amid union resistance to President Macon's reform plans.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/4947/production/_108795781_mediaitem108795780.jpg", "published_at": "2019-09-13"}