{"pub": "cnbc", "url": "https://cnbc.com/2019/09/17/the-median-net-worth-of-millennials.html", "downloaded_at": "2019-09-17 23:26:01.288095+00:00", "title": "How much money millennials have, compared to what their parents had at the same age", "language": "en", "text": "Are you a millennial who is helping your parents save for retirement? If you would like to discuss why and how you are doing so, please email reporter Alicia Adamczyk at alicia.adamczyk@nbcuni.com for a potential CNBC Make It article.\n\nMillennials aren't worth as much as their parents were at the same age.\n\n\"While young adults in general do not have much accumulated wealth, millennials have slightly less wealth than boomers did,\" the Pew Research Center explains in a 2019 report. The median net worth of millennial households was about $12,500 in 2016, while boomers had $20,700 at the same age in 1983. Gen X households had about $15,100 at the same age in 2001. (Pew's analysis of net worth is in 2017 dollars.)\n\nNet worth refers to assets minus liabilities, which is your total savings, including the value of your home, 401(k) and any other assets you may have, minus any debt.\n\n\"This modest difference in wealth can be partly attributed to differences in debt by generation,\" says Pew, which defines millennials as those born between 1981 and 1996, Gen Xers as those born between 1965 and 1980 and Boomers as those born between 1946 and 1964.\n\nCompared with earlier generations, more millennials have student loans: \"The share of young adult households with any student debt doubled from 1998 (when Gen Xers were ages 20 to 35) to 2016 (when millennials were that age).\"\n\nMillennials also tend to owe more. \"The median amount of debt was nearly 50% greater for millennials with outstanding student debt ($19,000) than for Gen X debt holders when they were young ($12,800),\" the report says.", "description": "Here's the median net worth of households headed by millennials, Gen Xers and boomers, according to the Pew Research Center.", "authors": ["Kathleen Elkins"], "top_image": "https://image.cnbcfm.com/api/v1/image/106132618-1568666907936small-business-owner-working-on-a-laptop-in-a-stylish-minimal-space_t20_kognar.jpg?v=1568666976", "published_at": "2019-09-17"}