{"pub": "financialpost", "url": "https://business.financialpost.com/transportation/autos/trump-white-house-wants-direct-control-over-where-cars-are-made?video_autoplay=true", "downloaded_at": "2019-10-30 00:00:30.009444+00:00", "title": "Trump White House wants direct control over where cars are made as part of new NAFTA", "language": "en", "text": "The Trump administration wants to dictate how and where global auto companies make cars and parts to secure duty-free treatment under the new NAFTA — in its most direct intervention yet to manage trade and production, according to people familiar with the effort.\n\nThe issue is being discussed between Trump administration officials, congressional staff, and domestic and foreign auto makers in the context of the legislation that lawmakers will vote on for the trade deal to take effect. The White House wants specific language that would allow it to unilaterally administer the production rules for companies.\n\nThe U.S.-Mexico-Canada Agreement, signed by President Donald Trump and his counterparts in November 2018, is still awaiting approval from the U.S. Congress. The White House has touted the new production rules for the auto sector as one area of the deal that’s most beneficial to America.\n\nBut the companies, lawmakers and even the U.S. International Trade Commission in an economic analysis have cautioned that the rules are so strict that they would result in higher car prices and lost sales.\n\nManufacturing Slowdown\n\nThe push comes amid Trump’s tariff-led assault on supply chains that run through China. It illustrates how much his administration has drifted from Republicans’ free-market ways and is willing to employ the sort of coercive tools used in command economies like China to force domestic production.\n\nIt’s also happening as the president’s tariffs on steel, aluminum and imported components from China have contributed to a slowdown in American manufacturing that has begun to cause the loss of factory jobs in some politically important swing states going into Trump’s 2020 reelection bid.\n\nThe negotiations over auto rules are taking place in parallel to discussions U.S. Trade Representative Robert Lighthizer is having with House Democrats on changes the lawmakers are seeking to the new Nafta, or USMCA.\n\nOfficials from Lighthizer’s office for months have been meeting with auto-industry executives to talk through the firms’ transition plans. Those would allow for a grace period of as many as five years before they have to comply fully with the new rules in order to ship products across North American borders duty-free.\n\nPolitical Pressure\n\nThe agreement the three countries signed refers to these transition plans as an “alternative staging regime” that each nation can apply on a producer-by-producer basis, giving USTR wide discretion to treat one company better than another.\n\nPeople familiar with the discussions say the language gives the White House a chance to abuse the transition-plan approval process to pressure companies into making politically expedient investments. To avoid an opaque process ripe for meddling by politicians, auto companies and Congress are asking USTR to commit to uniform rules so they can plan accordingly and don’t have to fear retribution for opening a plant in Mexico, for instance, instead of the U.S.\n\nA spokesman for Lighthizer didn’t respond to a request for comment.\n\nThere’s precedent in the Trump administration for treating one company differently from another in its various trade battles. Apple Inc., for example, got multiple tariff reprieves after its Chief Executive Officer Tim Cook personally asked the president to exclude some of its products from the wide-ranging duties he imposed against imports from China.\n\nAnother worry, the people said, is how the White House would treat companies participating in contentious litigation on California emissions rules. The industry is split on the matter, with General Motors Co., Toyota Motor Corp. and Fiat Chrysler planning to side with the Trump administration over their rivals.\n\nTime Running Out\n\nThe car industry has been publicly supportive of USMCA and is lobbying for swift approval — mainly for the sake of much-needed certainty in an environment that has been clouded by Trump’s multiple threats to withdraw from the existing NAFTA. An exit from that deal would leave more than a trillion dollars in annual trade between the three countries hanging in the balance.\n\nBut compliance with USMCA is much more difficult for auto companies because of the more stringent rules that govern whether a car or auto parts qualify as made in North America and can cross borders without tariff.\n\nUnder the deal, 75 per cent of a car has to be made in the three countries to qualify. It also needs to contain 70 per cent of North American steel and aluminum, and 40 per cent of a vehicle has to be made in plants with an average wage of US$16 an hour or higher. The last part, in particular, is intended to shift more production and investment to the U.S. and away from Mexico.\n\nTalks With Congress\n\nIn April, USTR tried to preempt an independent economic analysis of the deal by releasing its own “white paper” focused on the automotive sector. USTR said then it sees the new NAFTA leading to US$34 billion in auto investment. Many of those investments, however, had been decided on long before the deal was finalized.\n\nA senior USTR official said in April that the International Trade Commission’s auto estimates were less positive than its own because the ITC did not have access to privileged commercial information automakers had shared with the administration.\n\nThe wrangling over language on the auto rules shows that even if Lighthizer and House Democrats reach an agreement on fixes to USMCA soon, the administration is still facing an uphill battle in getting support for its demands in the legislation going before Congress, called an implementing bill.\n\nRepublican lawmakers and administration officials are worried that time is running out to get the deal voted on this year, people briefed on the internal deliberations said. House Speaker Nancy Pelosi and labour leaders have consistently reiterated that the substance of the agreement is more important than when it gets done.\n\nBloomberg.com", "description": "Companies, lawmakers and the U.S. International Trade Commission caution the rules are so strict they would result in higher car prices and lost sales", "authors": ["Jenny Leonard", "Bloomberg News"], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/ford-1.jpg", "published_at": "2019-10-29"}