{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/first-pictures-paedophile-whose-girlfriend-20693111", "downloaded_at": "2019-10-22 20:50:31.960877+00:00", "title": "First pictures of paedophile whose girlfriend took own life after finding sick images", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThese are the first pictures of paedophile Adam Wells whose girlfriend took her own life after discovering sickening images on his phone.\n\nThey emerged as the mother of tragic Lydia Roberts revealed her anger at her daughter's former boyfriend being \"allowed to carry on with his life\".\n\nWells found Lydia hanged at the home they shared.\n\nThe 21-year-old H&M worker felt \"violated and hurt\" after finding the photos on a second phone belonging to her businessman boyfriend.\n\nWells, a 27-year-old who ran a beauty products company, was handed a 12-month community order and ordered to sign the Sex Offender Register for five years for possessing indecent photographs of children when he appeared in court.\n\nLydia's mother, Michelle Roberts, spoke to MailOnline after the inquest into her daughter's death.\n\nShe said: \"Adam has been allowed to carry on with his life while we are still here, suffering.\n\n\"He has changed his name and got a new job. As a family, we feel very angry about what has happened.\"\n\nAnd in a statement read out at the inquest she said they family would never forgive Wells, who she feels \"made her make the decision to do what she did.\"\n\nShe said: \"Lydia lived with Adam Wells and had been in a relationship for two years from 2015 to 2017.\n\n\"On June 9th Lydia found a second phone of Adams and found it contained inappropriate images of young girls from a Russian based website.\n\n\"Lydia felt violated, hurt and disgusted at what she found - even more so at the thought of Adam being with her young niece and nephew.\n\n\"I feel that he made her make the decision to do what she did.\n\n\"Adam Wells was at court July 2018 and has been charged with possessing indecent images of children and has been put on the sex offenders register.\n\n\"As a family we are devastated at the loss of our beautiful daughter and for this we will never forgive him.\n\n\"In our opinion we are left now with more unanswered questions and hope one day to find out the truth.\"\n\n(Image: Lydia Roberts/ Cavendish Press)\n\n(Image: Lydia Roberts/ Cavendish Press)\n\nThe inquest into Lydia's death heard she argued with Wells after confronting him over the images.\n\nHe found her hanged at their home in Radcliffe, Greater Manchester, when he returned from a night out with friends at 3.30am.\n\nLydia had a previous history of suicide attempts and had been prescribed medication for depression, the inquest heard.\n\nRecording a conclusion of suicide, Coroner Zak Golombeck told the Manchester hearing: \"Adam and Lydia had been had been corresponding by text message during the course of June 9 when Lydia was at home and Adam was at work for a larger period of the day and later out with friends and colleagues.\n\n\"The nature of the messages had been that Lydia and Adam had argued about content found on one of Adam Wells mobile phones.\n\n\"Adam Wells had returned home at around lunch time and shortly after him departing, Lydia had continued to message Adam Wells.\n\n\"It continued up until 7pm or shortly thereafter, whereupon no further text messaging or contact was made between Adam and Lydia.\n\n(Image: Lydia Roberts/ Cavendish Press ()\n\n(Image: Lydia Roberts/ Cavendish Press)\n\n\"I have considered the totality of the evidence and I am able to conclude that Lydia Roberts took her own life and intended to do so.\n\n\"There is evidence relating to her mental health and the nature of the correspondence taking place on that day between herself and Adam Wells.\n\n\"She had a history of attempting to take her own life, also had depression and had been prescribed antidepressants, sadly died on 10th June 2017, when she was found hanging at home by Adam Wells. To the family, I offer my condolences.\"\n\nWells appeared at Manchester Magistrates' Court in July 2018 charged with possessing 31 indecent photographs of children.\n\nHe was sentenced to a 12 month Community order, was ordered to complete 150 hours unpaid work and pay a £85 victim surcharge.\n\nThe Samaritans is available 24/7 if you need to talk. You can contact them for free by calling 116 123, email jo@samaritans.org or head to the website to find your nearest branch. You matter.", "description": "Adam Wells has 'changed his name and got a new job' and Lydia Roberts' mum is angry about him being allowed to carry on with his life", "authors": ["Joseph Wilkes", "Image", "Lydia Roberts", "Cavendish Press"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20699815.ece/ALTERNATES/s1200/0_Adam-Wells.jpg", "published_at": "2019-10-22"}