{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/guy-builds-incredible-replica-of-link-to-the-past-in-dragon-quest-builders-2", "downloaded_at": "2019-09-25 07:01:41.242539+00:00", "title": "Guy Builds Incredible Replica Of Link To The Past In Dragon Quest Builders 2", "language": "en", "text": "The Legend of Zelda: A Link to the Past is one of the most recognisable games of all time, with an iconic overworld that players become intimately familiar with during their travels as the Hero of Time. A prolific creator recently took a stab at recreating Hyrule in the blocky anime style of Dragon Quest Builders, with absolutely beautiful results.\n\nFor two years, BenXC has regularly uploaded YouTube videos showcasing his Dragon Quest Builders projects, which range from relatively simple builds like hotels and bridges to more detailed ones like the treehouse from The Simpsons.\n\nA little while back, BenXC previewed work on a much larger project to recreate the overworld of A Link to the Past, followed by detailed looks at his work on the Eastern Palace and Death Mountain. Now, seven months later, he’s ready to unveil the entire thing.\n\nAccording to the above video, BenXC spent 150 hours faithfully constructing the landmarks and monuments of Hyrule in Dragon Quest Builders 2. Fans of A Link to the Past will immediately recognise some of its most iconic locations, like Hyrule Castle and the Lost Woods. BenXC says that the venture includes over 300,000 blocks, not to mention the 2,500 trees he had to plant by hand. It’s an incredibly detailed project that adds a brand new look to the classic world of A Link to the Past.\n\nThe coolest thing about games like Dragon Quest Builders, Minecraft and Mario Maker are the tools they give users to flex their creative muscles. This often results in folks transplanting completely different games into these spaces, giving us the opportunity to view classics with a new coat of paint.\n\nInterested players can check out BenXC’s version of A Link to the Past’s Hyrule for themselves by using the following Island ID: npyrd8ZJVM. Happy exploring!", "description": "The Legend of Zelda: A Link to the Past is one of the most recognisable games of all time, with an iconic overworld that players become intimately familiar with during their travels as the Hero of Time. A prolific creator recently took a stab at recreating Hyrule in the blocky anime style of Dragon Quest Builders,...", "authors": ["Heather Alexandra", "Alex Walker"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/cxtvch6ftdfuqaijjvrt.jpg", "published_at": "2019-09-25"}