{"pub": "news24", "url": "https://sport24.co.za/Rugby/RugbyWorldCup2019/Livescoring/rwc-live-springboks-v-italy-20191004", "downloaded_at": "2019-10-05 11:55:35.570968+00:00", "title": "As it happened | Springboks 49-3 Italy", "language": "en", "text": "01:51:50PM Thanks for tuning in! The Springboks are next in action against Canada on Tuesday (October 8) at 12:15 SA time.\n\n01:48:01PM An easy victory for South Africa against a hapless 14-man Italian outfit. The Springboks will take the win but there is lots to work on. The Boks' execution, especially their passing game, let them down badly at times.\n\n\n\n01:46:17PM FULL-TIME: South Africa 49-3 Italy\n\n\n\n01:45:59PM 83'- Pollard again misses with his conversion attempt...\n\n\n\n01:45:27PM 82'- TRY to the Springboks as replacement hooker Malcolm Marx barges over after a dominant driving maul.\n\n\n\n01:43:56PM 80' - The Boks with one last surge on the Italian line after the hooter...\n\n\n\n01:42:46PM 79'- Kolbe looks to be in quite a bit of discomfort. Let's hope for the best. He had a similar issue after the All Blacks game...\n\n\n\n01:42:03PM 78'- Kolbe almost away for his hat-trick after an intercept but the Italian defence catches up with him. He's now limping with what looks like an ankle issue... this will be of grave concern for coach Rassie Erasmus.\n\n\n\n01:40:27PM 76'- Pollard misses the conversion to the left. SA 44-3 Italy\n\n01:39:51PM It was set up by a great tackle from Kolbe on Italian fullback Matteo Minozzi, who wildly threw the ball in-field...\n\n\n\n01:39:12PM 75'- TRY to the Springboks as RG Snyman scoops on a loose Italian ball to score in the corner. His first Test try.\n\n\n\n01:37:54PM 75'- The Boks are throwing too many wild passes in this game. Their execution has let them down against a very poor Italian outfit.\n\n\n\n01:35:24PM 73'- DEFENDERS BEATEN SA 15 Italy 14\n\n01:35:05PM 73'- METRES MADE ON ATTACK SA 444m Italy 241m\n\n01:29:08PM 68'- Pollard chips over the CONVERSION. SA 39-3 Italy\n\n01:28:30PM 67'- TRY to the Springboks as wing Makazole Mapimpi scores under the posts after collecting a chip kick in behind the Italian defence by Willie le Roux.\n\n\n\n01:24:04PM 64'- Bok sub: Louw on for Vermeulen.\n\n\n\n01:21:57PM 62'- PENALTIES CONCEDED SA 5 Italy 10\n\n01:21:09PM 60'- Bok subs: Mostert on at lock for De Jager, Jantjies on at scrumhalf for De Klerk.\n\n01:19:46PM Not that it will matter much in this Pool B, but that was also the bonus-point try for South Africa.\n\n\n\n01:18:53PM 59'- CONVERSION slotted by Pollard. SA 32-3 Italy\n\n01:18:15PM 57'- TRY to the Springboks as centre Lukhanyo Am intercepts to score! It comes after helter-skelter period of attack from both sides.\n\n\n\n01:15:58PM 56'- It's all South Africa now, with a 14-man Italy seemingly tiring. The Boks should cash in with a few late tries in the final quarter.\n\n\n\n01:12:41PM 53'- Marx and Snyman are also now on for the Boks. Mbonambi and Etzebeth off.\n\n\n\n01:12:00PM 53' - Pollard's conversion attempt is away to the right. SA 25-3 Italy\n\n\n\n01:11:08PM 52'- TRY to the Springboks as Cheslin Kolbe collects a cross-kick from Pollard to round off his second try in style!\n\n\n\n01:09:05PM 50'- PENALTY slotted by Pollard. SA 20-3 Italy\n\n01:08:32PM 50'- The Boks get penalty in front - and Pollard will line up a shot at goal...\n\n\n\n01:03:50PM 45'- Bok subs: Kitshoff, Koch and Steyn all on.\n\n\n\n01:02:55PM 45'- TRY cancelled as replays show obstruction from captain Siya Kolisi.\n\n\n\n01:02:23PM 44' - TRY to the Springboks as Pieter-Steph du Toit rounds off. It was set up by a terrific break by Pollard in midfield... Oh wait, hang on, the referee wants to check for potential obstruction...\n\n01:00:07PM 42'- RED CARD for Andrea Lovotti. Absolute madness from the Italian prop!\n\n\n\n12:59:25PM Replays show a clear tip tackle from prop Andrea Lovotti.\n\n\n\n12:58:25PM 42'- TMO CALL Italy won a penalty but there is potential trouble for them for a tip tackle on Duane Vermeulen.\n\n12:57:26PM 42' - Italy into the red zone after a strong run by SA-born Braam Steyn. He brushed off Duane Vermeulen in the process.\n\n\n\n12:53:34PM Welcome back for the second half! Pollard restarts proceedings...\n\n\n\n12:48:23PM Interestingly, the territory stakes are level at 50% at half-time and Italy have enjoyed slightly more possession 51%.\n\n\n\n12:40:00PM The Boks will be disappointed having let slip a few scoring chances. But they'll be happy with their staunch defensive effort, especially when the Italians were camped in the red zone.\n\n12:38:42PM HALF-TIME: South Africa 17-3 Italy\n\n\n\n12:37:50PM 39'- No they can't as Bok skipper Siya Kolisi is penalised for an illegal cleanout at a ruck...\n\n", "description": "Recap the scoring in the Rugby World Cup encounter between South Africa and Italy from Shizuoka Stadium Ecopa.", "authors": ["Herman Mostert -"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7834/20c9373f54b94a239a90ce1876a25d39.png", "published_at": "2019-10-04"}