{"pub": "thehill", "url": "https://thehill.com/opinion/immigration/467294-no-ken-blackwell-sanctuary-city-policies-arent-threat-to-anyone", "downloaded_at": "2019-10-25 00:03:50.189605+00:00", "title": "No, Ken Blackwell, sanctuary city policies aren't a threat to anyone", "language": "en", "text": "On Oct. 22, Ken Blackwell penned an op-ed for The Hill in which he argued that sanctuary policies pose a threat to “decent people.” I would like to address the claims Blackwell made, but let me begin by saying that I do not take issue with opposition to sanctuary policies.\n\nDiscussing and debating these issues is at the core of American democracy. What I do take issue with is a debate almost completely devoid of the actual facts and which ignores the body of research that exists on sanctuary policies\n\nBlackwell, through lurid accounts of murders and sexual assaults, is not trying to stimulate a debate on these policies, but instead he is simply seeking to use fear to generate opposition.\n\nADVERTISEMENT\n\nHe claims that sanctuary policies, “illegitimately usurp lawful power from the federal government. They do not. Most sanctuary jurisdictions forbid local law enforcement and officials from inquiring into the immigration status of residents, something that is not required by federal law.\n\nCities and states are not in any way required to provide assistance of any kind in immigration enforcement, as this rests with the Department of Homeland Security (DHS) and Immigration and Customs Enforcement. ICE’s 287(g) program, which Blackwell mentions, is voluntary and there is no federal requirement that local officials collect immigration-related information or assist ICE in enforcement operations.\n\nThe only federal requirement regarding immigration-related information is 8 U.S.C. Section 1373, which prohibits local government from passing policies that limit communication with the (DHS), regarding the immigration or citizenship status of residents.\n\nHe goes on to dismiss as the claim that undocumented immigrants do not commit most crimes as “specious.” Nearly all research to date has found that immigrants, and the undocumented, offend at rates that are significantly lower than native-born Americans.\n\nBlackwell lists off some statistics on crime in Texas, but again, studies have found that even in the Lonestar State, undocumented immigrants offend at a far lower rate than the native-born.\n\nADVERTISEMENT\n\nHe then goes on to ask if this even matters and claims that, “Each crime committed by an illegal alien has the unique characteristic of being fully preventable.” This assumes that sanctuary cities in some way “breed crime,” something that is not supported by the evidence.\n\nSecondly, it suggests that all of these crimes would have been prevented if sanctuary policies did not exist. Yes, some undocumented immigrants offended after being released, but this could be due to jurisdictions being unable to hold individuals after they are eligible for release because of the Fourth Amendment’s prohibition of unreasonable searches and seizures.\n\nEven if we grant that a handful of tragedies could possibly been prevented through the participation of local law enforcement in immigration enforcement, this ignores the very real possibility that sanctuary policies prevent far more tragedies from occurring. In our book, Loren Collingwood and I show Texas’ SB4, which banned sanctuary cities in the state and allows local law enforcement to inquire into immigration status, decreased calls to 911 from immigrant neighborhoods.\n\nOther research has shown that Latinos are less likely to call the police if they are worried they will be asked about their immigration status. Blackwell chooses to ignore these victims, who should be able to reach out to the police to report sexual assaults and domestic violence but will not because of fear they could be deported.\n\nIn many cases local law enforcement relies on immigrant communities to report crimes and serve as witnesses, something that is far less likely if these individuals fear they could be asked about their immigration status.\n\nAll research has shown that sanctuary policies do not increase crime, either at the city or county level. These policies have also been shown to have positive effects on Latino political incorporation, with sanctuary jurisdictions having higher Latino voter turnout, more Latinos who run for local offices, and greater Latino participation in the police force. Sanctuary policies are not a threat to anyone.\n\nIf Blackwell truly wanted to prevent crime, he should be penning pieces on the need for comprehensive immigration reform instead of fear-mongering about sanctuary policies. We need to bring people out of the shadows so it is more likely they will report abusers and criminals. It is our broken immigration system that is the threat to decent people, both citizens and non-citizens, documented and undocumented.\n\nBenjamin Gonzalez O’Brien is an assistant professor of Political Science at San Diego State University and the author of “Handcuffs and Chain Link: Criminalizing the Undocumented in America\" and \"Sanctuary Cities: The Politics of Refuge.”", "description": "Discussing and debating these issues is at the core of American democracy, but I do take issue with this debate, which is almost completely devoid of the actual facts.", "authors": [], "top_image": "https://thehill.com/sites/default/files/immigration_protest_getty100119.jpg", "published_at": "2019-10-24"}