{"pub": "reuters", "url": "https://af.reuters.com/article/topNews/idAFKBN1W81BQ-OZATP", "downloaded_at": "2019-09-23 17:37:48.773112+00:00", "title": "The cool new thing in French haute cuisine? Madagascar caviar", "language": "en", "text": "LAKE MANTASOA, Madagascar (Reuters) - Jerome Bastide slides an ultrasound wand over the sturgeon’s belly, swiftly extracts a dozen eggs with a thick biopsy needle, and returns the fish to the lake.\n\nA can of Rova caviar is seen in the processing line at the Acipenser fish farm in Ambatolaona, Madagascar, September 10, 2019. REUTERS/Baz Ratner\n\n“Perfect for caviar,” he says, lining up the tiny grey orbs against a ruler. “Here we have really good eggs, we have great colour.”\n\nFloating fish laboratories like this one are common in Russia or Iran, around the Caspian Sea - but this is Lake Mantasoa, a hydropower reservoir in the highlands of Madagascar at an altitude of 1,400 metres (4,600 feet). It is Africa’s first, and so far only, caviar farm.\n\nWith the world’s fourth highest rate of chronic malnutrition, Madagascar is an unlikely source for a luxury food that fetches upwards of 700 euros ($775) per kg in plush French restaurants.\n\nBut Mantasoa’s cool fresh water and inexpensive labour inspired three French entrepreneurs to set up a company in 2009, and they imported their first batch of fertilised sturgeon eggs from France four years later.\n\n“Friends thought we were crazy,” said Delphyne Dabezies, one of the founders of Acipenser.\n\n“Even our closest friends said: ‘Ridiculous, caviar in Madagascar – what’s next, salmon in the desert?’ Lots of them laughed.”\n\nNow her Parisian friends are eating not only their words, but also the subtle flavours of Madagascar’s newest delicacy: the Rova Caviar brand.\n\nThe global caviar market is projected to grow at 7% per year to around $560 million by 2025, according to Adroit Market Research, an Indian-based business analytics and consulting company.\n\nA short drive from the lake lie the hatching ponds and processing factory, a featureless building where employees in head-to-toe sterile white protective clothing work in a chilled, spotless interior.\n\nInside, a four-foot sturgeon is heaved onto a stainless steel gurney. One worker slices it open while another carefully removes caviar for cleaning, sifting and salting. Each fish produces a pile of dark grey, brown or black eggs.\n\n“Before opening the fish we don’t know what colour the caviar will be. But whichever caviar, we know it will be excellent,” said Lanja Rajaobelina, deputy manager of the factory.\n\nDiscoloured eggs are removed with tweezers, a salt mixture produced according to a jealously guarded recipe is added, and the final product is decanted into cans. Around six months later, the precious granules are repackaged for export.\n\nAcipenser employs between 250 and 300 locals, depending on the season. It made its first batch in 2017.\n\nThis year the company will produce almost 5,000 kg for export - mostly to France, but also the United States and Reunion island.\n\nDabezies hopes to double production in the next five years as Acipenser introduces caviar from five other varieties of sturgeon. This month, the company launched an online shop.\n\nOutside the factory, a row of 19 rectangular hatching ponds lie side-by-side like a barcode.\n\nBeneath the grey-green waters in two of the ponds are 1,500 highly-prized beluga sturgeon which, when they start to mature in 2026, will carry a payload each worth $86,600 at current prices.\n\nAn even more exclusive fish lurks beneath the surface of another pond: a rare albino sturgeon. Their creamy roe sells for $34,500 per kg. The Guinness Book of Records calls it the world’s most expensive food - but the breeders don’t know yet whether this one is male or female.\n\nLalaina Ravelomanana, head chef at Marais, a glitzy rooftop restaurant in Madagascar’s capital Antananarivo, takes great pride in serving local caviar.\n\n“This caviar - it is very subtle in the mouth, buttery,” he says, plating up six of his own caviar recipes, replete with vodka jelly, maize cream, artistic smears of sauce, fumes of smoked cocoa and edible flowers.\n\n“I started using the caviar a year ago. I’ve already invented 60 recipes and I’m not stopping.”\n\n($1 = 0.9054 euros)", "description": "Jerome Bastide slides an ultrasound wand over the sturgeon’s belly, swiftly extracts a dozen eggs with a thick biopsy needle, and returns the fish to the lake.", "authors": ["Hereward Holland", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190923&t=2&i=1432941296&w=1200&r=LYNXMPEF8M0YN-OZATP", "published_at": "2019-09-23"}