{"pub": "guardian", "url": "https://theguardian.com/uk-news/2019/oct/05/i-was-by-dianas-side-in-her-press-battles-meghan-harry-patrick-jephson", "downloaded_at": "2019-10-05 22:46:59.907504+00:00", "title": "I was by Diana’s side in her press battles. I know the risks involved for Harry and Meghan | Patrick Jephson", "language": "en", "text": "The Duke of Sussex’s unprecedented multi-front war on the media is either a stroke of genius – bamboozling his enemies with the speed and breadth of his attack – or a risky overstretch of finite resources, of the kind that decides the outcome of most long wars.\n\nNot financial resources, obviously (although potentially years of top-notch legal work will rack up bills to make even a prince’s accountant swallow hard), but the intangible and ultimately more decisive resources of public sympathy and personal resolve. Public sympathy will reliably start in the duke’s corner but is notoriously volatile – hence probably a gamble on one or more swift settlements to steady the troops. As for the rest … all will depend on the scales of justice.\n\nPrince Harry: tabloids hid hacking crimes for 20 years Read more\n\nPersonal resolve is another matter. To stay the course, up to and possibly including personal court appearances, is a punishing trek on which to set out. Add a crowded baggage train of family, friends and patronages and the Sussexes have set themselves a long march to whatever they have defined as victory.\n\nWe must assume they’ve calculated that the cost of doing nothing is higher than the price of whatever this is. If not, now’s the time to ask themselves what that price might be.\n\nThe duke’s current sense of resolve is clear from last week’s explosive statement asserting wholesale press misbehaviour. Along with the duchess’s suit against the Mail on Sunday, Harry’s blunderbuss opens a campaign that PR masterminds and legal brains have presumably plotted for some time (the special website sussexofficial.uk has been up and ready since March). We’re told that it was all part of the plan to pull the trigger in the heady climax of a successful African tour. So damn the consternation in the palace or the Foreign Office or on the faces of those poor loyal blindsided courtiers – I bet it felt absolutely great. The justified fury of a reasonable husband driven beyond endurance finds blessed release in legal processes and good old fashioned purgative prose. Applause, surely.\n\nFacebook Twitter Pinterest Patrick Jephson with Diana at the Burghley horse trials in 1989. Photograph: Getty Images\n\nI went through something similar with Harry’s mother when we sued the Mirror for sneakily acquired pictures of her working out in a gym. In the heat of battle and gripped by self-righteous indignation, the royal hand reaches resolutely for the mighty sword of truth and… waits. And waits.\n\nUnless the head of the offending editor(s) can be served up on a plate with the speed to which royal customers are accustomed, the whole business can start to feel like a bad idea. Somebody else’s bad idea, naturally.\n\nEventually, with the Princess of Wales, our legal champions reached a settlement, but by then it was all rather deflating. We were on tour half a world away when the news of our long-awaited vindication came in. It was the middle of the night so I climbed out of my bed in the embassy and tiptoed across the chilly landing to slide the agreed cryptic note under my boss’s door. It didn’t feel like a victory parade and, funnily enough, next day the familiar faces of the press pack wore expressions that were everything except contrite. And they were still just as peskily objective, as they always should be in a democracy of which (to borrow a phrase from Prince Harry’s statement) they are the cornerstone. It occurred to me then that an attack of cold feet at the beginning of the exercise might have been a blessing in disguise.\n\nIt seems Harry did not have time to cite any actual examples of the offences marching through his mind. It would have been worth the effort to do so, if he were seriously seeking an improved modus vivendi with the press he so obviously despises.\n\nDocumented evidence of the alleged “ruthless campaign” is presumably easy to find and would certainly have silenced some sceptics. Unquestionably, there has been ruthlessness – and cruelty – to spare online but the thoroughly modern Sussex digital operation must have been prepared for that, not least psychologically.\n\nAccusations of media bullying and prejudice are now being launched from the duchess’s homeland. This can be a learning opportunity for some of her celebrity sisters: royal people have to learn the difference between bullying and criticism, between sarcasm and irony. It’s part of the historic deal that’s overseen by the British media holding to account public figures whose lives are subsidised by (usually) benign British taxpayers.\n\nBut when royal blood is up and the quarry is in plain view, it’s too late to suggest a nice soothing stroll in the autumn air and a happy review of one’s bountiful royal blessings. Not the least of these being the welcome reality that, as sixth in line, and without anyone minding very much, one could push off to America or Africa or Elton John’s corner of Provence for a life of earnest good works and unassailable eco-virtue.\n\nWin or lose in the courts, Harry and Meghan's royal destiny is still split between two worlds\n\n“Follow your dream”, the duke exhorted young Africans last week. Words for the Sussexes to ponder as they survey the royal future through the sheeting rain over Windsor Great Park. And what a dream: celebrity without apology, Gulfstreams without guilt, Sundays without the Sunday papers and happy anonymity for baby Archie. All this plus gold-plated endorsements from two former US first ladies one of whom, Michelle Obama, hails the duchess “a mould-breaker”.\n\nWell, no surprise, breaking British moulds is a risky business, can be messy and is definitely not for the faint-hearted. It’s hardly Dunkirk or even Afghanistan where bachelor Harry earned such respect, but now’s the time for team Sussex to show what it’s really made of.\n\nThere’s just one small detail to be resolved. Win or lose in the courts, Harry and Meghan’s royal destiny is still split between two worlds, much as they themselves seem split between the progressive idealism of Meghan’s home state and the obstinate reality of Britain’s preference for a comfortably conservative ruling family (and who doesn’t need a bit of comfort in these troubling times?). Diana may have been something in the mould-breaker stakes herself, but she never ducked Balmoral, lectured voters on democracy or borrowed invective more normally found in the White House to communicate with a free and fundamentally friendly press.\n\nWhat’s it to be? Now would be a brilliant time to give Fleet Street and its deplorable insolent tendencies an unequivocal answer. And here’s a respectful suggestion: unclenching your fists will help.\n\nPatrick Jephson was equerry and private secretary to Diana, Princess of Wales from 1988 to 1996. His latest book The Meghan Factor is available from Amazon", "description": "As the Sussexes launch their legal battle, Diana’s ex-private secretary says they might benefit from a less confrontational approach", "authors": ["Patrick Jephson"], "top_image": "https://i.guim.co.uk/img/media/36a8039dc90251d24d508b252c0bd658cd07b9b6/156_346_2527_1516/master/2527.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tb3BpbmlvbnMucG5n&enable=upscale&s=2f4ee3b62614bd71d2ab945cc75b43d3", "published_at": "2019-10-05"}