{"pub": "cnn", "url": "https://cnn.com/2019/09/25/business/worlds-largest-wind-farm/index.html", "downloaded_at": "2019-09-25 13:49:18.760971+00:00", "title": "The world's largest offshore wind farm is nearly complete. It can power 1 million homes", "language": "en", "text": "London (CNN Business) The world's largest offshore wind farm is taking shape off the east coast of Britain, a landmark project that demonstrates one way to combat climate change at scale.\n\nLocated 120 kilometers (75 miles) off England's Yorkshire coast, Hornsea One will produce enough energy to supply 1 million UK homes with clean electricity when it is completed in 2020.\n\nThe project spans an area that's bigger than the Maldives or Malta, and is located farther out to see than any other wind farm . It consists of 174 seven-megawatt wind turbines that are each 100 meters tall. The blades have a circumference of 75 meters, and cover an area bigger than the London Eye observation wheel as they turn.\n\nJust a single rotation of one of the turbines can power the average home for an entire day, according to Stefan Hoonings, senior project manager at, the Danish energy company that built the farm.\n\nThe project will take the United Kingdom closer to hitting its target of deriving a third of the country's electricity from offshore wind by 2030.\n\nIt's the kind of project that can help governments achieve environmental targets set out at this week's United Nations Climate Action Summit in New York. Some 77 countries committed at the summit to cut greenhouse gas emissions to net zero by 2050, but climate activists including Greta Thunberg say that major emitters must do more to mitigate rising temperatures.\n\nThe Hornsea One proejct will produce enough energy to power up to 1 million UK homes.\n\nRenewable energy will be critical to achieving those climate goals.\n\nDespite the commitments made as part of the 2015 Paris climate agreement , global emissions continued to rise in 2018, and global energy demand grew at its fastest pace in a decade, according to the International Energy Agency. Coal use in power generation accounted for a third of total CO2 emissions, the IEA said\n\nThe trends demonstrate the need for additional clean energy solutions. In Britain, three more phases of the Hornsea project are planned.\n\nThe share of renewables in the global energy mix is small but growing. Eventually a tipping point may be reached. After 2035, renewables are projected to make up more than 50% of generation, according to McKinsey\n\nWind power is a big part of the solution. According to the IEA, electricity generation from wind grew by an estimated 12% in 2018, keeping its position as the largest renewable technology that doesn't involve water.\n\nThe company behind Hornsea\n\nOrsted has built 25 offshore wind farms across Europe, the United States and Asia.\n\nIt changed its name from Danish Oil and Natural Gas in 2017 to reflect its transformation to a green energy company. The company has cut its use of coal by 73% since 2006 and plans to be coal free by 2023.\n\nThe United Kingdom is its biggest market for offshore wind and Orsted will have invested £12 billion ($15 billion) in the sector by 2020.\n\nWith a capacity of 1.2 gigawatts, Hornsea One will generate nearly twice the power of Orsted's Walney Extension — the current largest offshore wind farm in the world, located in the Irish Sea.\n\nEquipment used by Orsted crews at work in the North Sea.\n\nHornsea Two is under construction and has potential to meet the electricity needs of up to 1.6 million homes a year, according to Orsted. Hornsea Three could provide electricity to more than 2 million homes.\n\nThere are now 37 offshore wind farms operating in the United Kingdom, said Orsted. That makes Britain the biggest offshore wind market in the world.", "description": "The world's largest offshore wind farm is taking shape off the east coast of Britain, a landmark project that demonstrates one way to combat climate change at scale.", "authors": ["Hanna Ziady", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190924071335-04-uk-worlds-biggest-wind-farm-super-tease.jpg", "published_at": "2019-09-25"}