{"pub": "thenextweb", "url": "https://thenextweb.com/podium/2019/10/17/you-cant-use-western-digital-marketing-tactics-for-emerging-markets-so-adapt", "downloaded_at": "2019-10-17 11:34:44.475504+00:00", "title": "You can’t use Western digital marketing tactics for emerging markets — so adapt", "language": "en", "text": "For digital marketers targeting urban audiences within emerging markets — such as India, Indonesia, and Pakistan — it’s imperative that your marketing strategy employs a dynamic approach in identifying and assigning potential customers on either side of two broad market segments: the haves and have-nots.\n\n\n\nWhile this may be fairly common sense; the act of execution is not so straightforward. Maintaining a repository of accurate and trusted demographic identifiers remains a primary challenge for digital marketers in these parts of the world, as data can be scarce.\n\nAnd to clarify, I’m using the ‘haves’ and ‘have-nots’ nomenclature to refer to two broad economic segments that populate and divide such urban centers along established and biased social-economic lines: the informed, quality-conscious upper middle class and those who still struggle to meet their basic needs as defined in the context of a robust and developed society.\n\nOnce a company has assessed whether its consumer profiles match up against one or both broad segments (the haves and have-nots), the next practical step is to translate these real world stereotypes into platform-specific (Facebook, Google Ads, LinkedIn, etc.) audience selection configurations that maximize the return-on-marketing-investment (ROMI) for each campaign.\n\nHowever, a plethora of homemade Google Ads-certified advisers will be the first to warn you: like many neo-liberal democratic institutions, any attempt to pick-and-drop ‘best practices’ from western sources can often lead to unanticipated results.\n\nSame game. Same rules. Different players.\n\nIn regions such as Pakistan, where reliable economic data on individual users is scant and partisan divides (a la Republicans v. Democrats) are not always clearly defined or enduring, digital marketers must go the extra mile in their customer acquisition drives. You do not want to be marketing Iranian rugs to 95 percent of the audience.\n\nEven if your company and its products are both desirable and affordable enough for both segments (the haves and have-nots) yet do not have the sustained goodwill of a blue-chip brand like Coca Cola, you will need to devise segment-specific marketing strategies or risk sustained damage to your brand reputation. After all, few companies can hire the Tendulkars and Ronaldos of the world for an one-size-fits-all marketing campaign.\n\nThese and other valuable insights are detailed below in the rules of segmentation for digital markets in emerging economies:\n\n1. ‘No shit, Sherlock’ alert: Know your consumers\n\nUnless you were in tl:dr mode, you may have noticed the sub-heading above, ‘Same game. Same rules. Different players.’ If your product is new and does not have the VC coffers to blitz scale its way to market dominance, you will need to be extra cautious with your brand image. In import-oriented consumer cultures such as India and Pakistan, domestic brands are often seen as inferior quality products once they have are perceived as being ‘used by the masses’.\n\nThere is certain pragmatism in this: domestic products in developing countries tend to be low quality to cut down on price. This works because minimum quality expectations are much lower.\n\n\n\nThis presents a challenge for products that appeal to both demographics: adding too many western pop culture references to your advertising design may confound the masses (80-90 percent of the population in any developing country) while keeping your message orthodox and indigenous may result in it being seen as substandard.\n\n2. Location is never enough\n\nNever trust solely on location-based audience selection tools to do the job. While it may be true that you are more likely to sell your trendy high-street halter dresses in downtown Mumbai rather than a neighborhood in old Delhi, location never works without an accompanying set of trusted descriptors.\n\nMost of the location-based data held by Facebook and Google comprises of map usage and check-in history. Idiosyncratic device usage habits such as a tendency to keep ‘location services’ off except for ride booking apps and traveling to new locations limits the utility of location data. This may tell us where a person goes every now and then, but not who he or she actually is.\n\n3. Do not bank on generic demographics\n\nOther than gender, which most people are truthful about, other biodata factors tend to be a ‘hit or miss.’ Online consumers in emerging markets are a bit tricky; a general environment of distrust means that no one likes to jot down too many details accurately.\n\nCultural differences also play their role in inaccurately populating the data set which informs the demographic selection options. In a conservative Muslim country, for example, how does one ascertain who is single or in a relationship?\n\n4. Be obsessive about the details\n\nThe above three rules lead to this one. Simply knowing your consumers isn’t enough: you need to obsess over them. Even if you need to vet and add each alumni page from each notable university in the city to sell your energy drink, do it.\n\nBeing listed as a ‘college graduates’ should never be enough squeeze within your campaign’s reach. Being aggressively particular about your audience subsets, even if these aggregate to form a broad audience overall, is the best way to ensure that you reach your target consumers.\n\nThe costs of being a marketing sloth\n\nThe cost of not designing a proactive segmentation approach is substantial. Far too often, digital marketers tend to procrastinate when it comes to devising and maintaining their market segments.\n\n1. Customer engagement will soon be about ‘restraint’ rather than purpose’ if you lump everyone together\n\nModerating debates over politics, social values, and religion usually will not add much value to your brand or sales. If you’re in Pakistan, go to your favorite marketing-heavy brand’s page (Coca Cola, Nestle, Lipton). Now ask yourself: is the comment thread adding any value to the brand image?\n\n2. You don’t get a clear picture of your company’s true worth\n\nIt may feel great to see everyone engaging with your brand, but what tangible lessons can be inferred for future marketing campaigns other than ‘my product is great?’ Audience-specific adsets and content lead to more meaningful engagement and feedback.\n\n3. Ultimately, it all boils down to sub-par ROMI\n\nWhen you advertise a blog post about your high-end restaurant in Zone 1 (using London’s not-so-subtle status differentiator) to someone in Zone 5 just because you lazily used Facebook’s location-based selection method as the main identifier, you are ultimately losing money for your company. And no — absorbing ‘collateral damage’ should not be seen as an acceptable norm in the complex world of digital marketing.\n\nThe rule books that apply to New York and Stockholm rarely apply here. While it is much cheaper on average to generate basic engagement (visits, likes, comments) in the developing world, the downside remains that predicting and sustaining long-term digital marketing outcomes is much tougher. The solution? Get your hands dirty, and repeat.", "description": "The playbooks of the West rarely workin in emerging markets such as India and Pakistan - it's the same game, same rules, but different players.", "authors": ["Ali Umair", "October"], "top_image": "https://img-cdn.tnwcdn.com/image/podium?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2FUntitled-design123.png&signature=3e77b9111345654c037448425faf4549", "published_at": "2019-10-17"}