{"pub": "guardian", "url": "https://theguardian.com/environment/2019/oct/09/eco-warrior-swampy-on-extinction-rebellion-it-gives-me-hope", "downloaded_at": "2019-10-09 02:42:20.816544+00:00", "title": "Eco-warrior Swampy on Extinction Rebellion: 'It gives me hope'", "language": "en", "text": "After being fined for blocking oil refinery traffic, Daniel Hooper, once the public face of green activism, applauds new generation\n\nMore than two decades after Britain saw its first widespread environmental protests, Extinction Rebellion is the latest in the vanguard.\n\nBut while campaign groups have come and gone, it’s business as usual for Daniel Hooper, the veteran eco-warrior known as Swampy who says the latest protests give him “hope”.\n\nHooper became a national figure after living underground for a week in a tunnel protesting against the rerouting of the A30 in Devon in the 1990s.\n\nHooper, who now lives in West Wales, was also involved in a series of high-profile environmental campaigns, also targeting the M11 Newbury bypass and Manchester airport.\n\nBut after being out of the headlines for years he was in court on Tuesday charged with obstructing traffic in a blockade of an oil refinery in Wales.\n\nHe told ITV News: “My beliefs are the same as they always were and I did have a quiet 10 years, almost to the point where you have apathy towards how we can change things, then Extinction Rebellion started happening.\n\n“You think there is hope and I believe there is hope and now everyone needs to think about what we are doing, governments needs to change, companies need to change.\n\n“We need people’s assembly to decide what to do, this is a state of emergency.”\n\nHooper, who is 46, had earlier been fined £40 and ordered to pay £85 costs and a £32 surcharge after appearing before magistrates in Haverfordwest.\n\nHe pleaded guilty to wilful obstruction of a highway after blocking a road to the Valero Pembroke refinery during a protest last month.\n\nHooper was one of many of a new generation of environmental protesters to emerge in the 90s.\n\nRather than the climate crisis focus of the current generation, their campaigns targeted what they saw as unnecessary development, especially of roads.\n\nHooper rose to to prominence during the A30 protests but the clashes between activists and police over the building of the Newbury bypass in 1996, which required the destruction of 10,000 mature trees, ensured that their concerns cemented the place of environmental issues on the national political agenda.", "description": "After being fined for blocking oil refinery traffic, Daniel Hooper, once the public face of green activism, applauds new generation", "authors": ["Staff"], "top_image": "https://i.guim.co.uk/img/media/b2e673667b4f9ae02bcfad499ab5f1d27f3e582d/0_5_2048_1229/master/2048.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9a8320fda7edad2dd6335dd9eb11f44b", "published_at": "2019-10-09"}