{"pub": "metro", "url": "https://metro.co.uk/2019/10/15/suri-cruise-keen-reader-holds-handmaids-tale-day-mum-katie-holmes-10920830", "downloaded_at": "2019-10-15 09:43:32.374741+00:00", "title": "Tom Cruise daughter Suri pictured out with mum Katie Holmes", "language": "en", "text": "Katie and Suri enjoyed a girls day out (Picture: Backgrid)\n\nIt looks like Suri Cruise has some pretty good taste in books.\n\nThe 13-year-old was pictured carrying a copy of Margaret Atwood’s The Handmaid’s Tale as she headed out and about with mum Katie Holmes.\n\nWhile reviews online recommend that the book be given to readers over the age of 16, due to the violence and dystopian horror in the plot, it seems Katie deemed the book appropriate for her teenage daughter.\n\nSuri – dressed in leggings and a pink hoodie – looked pretty excited to get to reading as she ran ahead of her mother, who wore a long navy coat over jeans and a white t-shirt.\n\nSuri – the daughter of Katie, 40, and her ex-husband Tom Cruise, 57 – clutched the book as she and her mum went to visit a friend in Manhattan.\n\nSuri held a copy of The Handmaid’s Tale (Picture: Skyler2018 / BACKGRID)\n\nKatie, on the other hand, held onto her coffee (Picture: Backgrid)\n\nWhile Suri was bouncing around, Dawson’s Creek star Katie wasn’t as chipper, as she covered up in sunglasses and held onto a cup of coffee.\n\nAdvertisement\n\nAdvertisement\n\nRelatable AF.\n\nThis comes after Mission Impossible star Tom was pictured on a rare outing with his son Connor.\n\nThe actor beamed away as he headed to a helipad in London – well, how else does an action hero travel – with his 24-year-old son.\n\nSuri is now 13 years old (Picture: T.JACKSON / BACKGRID)\n\nTom hasn’t been seen publicly with Suri since 2013 (Picture: MJ Kim/Getty Images)\n\nTom adopted Connor and Isabella, now 26, in the 90s with then-wife Nicole Kidman, with the kids choosing to stay with Cruise after the high profile couple divorced in 2001.\n\nConnor and Isabella have stayed in Scientology with their dad, with Nicole saying: ‘They have made the choice to be Scientologists and as a mother, it’s my job to love them.’\n\nWhile Cruise is still close to his eldest kids, the Top Gun star hasn’t been seen publicly with daughter Suri since 2013, when she was seven years old.\n\nKatie welcomed Suri with Mission Impossible star Tom in April 2006, with the couple getting married in November of the same year.\n\nHowever, the pair split in 2012, with Tom not being pictured with the family since 2013.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Ryan Reynolds teases secret Marvel meeting amid rumours Deadpool could join Marvel Cinematic Universe\n\nMORE: Ant and Dec announce details of new show and it’s basically Pimp My Ride meets Top Gear", "description": "Tom Cruise and Katie Holmes' daughter Suri pictured with a copy of The Handmaid's Tale on day out with mum.", "authors": ["Emma Kelly"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89946724_1571131662.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-15"}