{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/durban-doctors-murder-woman-arrested-will-not-face-charges-for-now-20191021", "downloaded_at": "2019-10-22 13:41:56.300942+00:00", "title": "Durban doctor's murder: Woman arrested will not face charges for now", "language": "en", "text": "A Durban woman arrested in connection with the death of orthopaedic surgeon Dr Melvin Naidu acted in self-defence, her lawyer said on Monday.\n\nThe woman, 31, who cannot be named because she has not appeared in court yet, did not face any charges or stand before a magistrate after the State chose to investigate the case further.\n\nHer lawyer, Ravindra Maniklall, said she had claimed self-defence.\n\n\"She claims she was attacked, and she acted in self-defence. We made confidential representations in terms of the actual incident that occurred between the parties.\"\n\nHe added: \"The State is not enrolling the case. They don't believe they have a sufficient case to prosecute at this point in time.\"\n\nManiklall said the decision not to prosecute her could, however, be overturned.\n\n\"The State will investigate the case more fully and wait for the reports to come in and make a final decision. It must be emphasised that this is an interim decision.\"\n\nThe National Prosecuting Authority has not yet responded to a request for comment.\n\nThe woman is thought to have been the only other person in the plush Pearls Hotel room with Naidu on October 17.\n\nPolice spokesperson Captain Nqobile Gwala previously told News24 that other guests heard shouting before calling hotel security.\n\nShe said the woman had called for help, as did Naidu who lay on the floor outside his hotel room. He had sustained a stab wound to the neck and was certified dead on the scene.\n\nThe woman was then arrested.", "description": "A Durban woman arrested in connection with the death of orthopaedic surgeon Dr Melvin Naidu acted in self-defence, says her lawyer.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9419/7586bf9f82ba40788267661e72ea603f.jpg", "published_at": "2019-10-21"}