{"pub": "usatoday", "url": "https://usatoday.com/story/sports/mlb/columnist/bob-nightengale/2019/10/05/mlb-playoffs-twins-randy-dobnak-uber-driver-alds-starter/3879148002", "downloaded_at": "2019-10-05 22:13:32.447116+00:00", "title": "From Uber driver to postseason starter, Twins' Randy Dobnak may be baseball's best story", "language": "en", "text": "CLOSE\n\nNEW YORK — You never caught his name, or even paid attention, but if you vacationed in Fort Myers, Fla., this past spring, you might have seen him.\n\nHe was your Uber driver.\n\nYep, the kid with the glasses, with a thick, handlebar mustache, driving a Toyota Camry.\n\nYou may have noticed his 4.99 Uber rating as a driver, but little else.\n\nWell, if you get a chance, turn on your TV set Saturday afternoon, and look again.\n\nGAME 1: Yankees beat Twins 10-4\n\nNLDS: Nationals doing whatever it takes to beat Dodgers\n\nThat 24-year-old , a guy by the name of Randy Dobnak, just so happens to be pitching for the Minnesota Twins in Game 2 of the American League Divison Series against the New York Yankees.\n\nThe Twins, who haven’t won a playoff game since George W. Bush’s first administration, have already tried Cy Young winners. Twenty-game winners. Homegrown phenoms. And aging journeymen.\n\nWhy not let an Uber driver have a shot at ending their major-league record 14-game postseason losing streak, culminating in one of the wildest, zaniest and improbable weeks of any player in baseball?\n\n'Greatest week of my life'\n\nLet’s see, he started and won the Twins’ AL Central Division clinching game on Sept. 26 against the Detroit Tigers. He got married four days later in Maryland. And now he’s pitching a playoff game at Yankee Stadium.\n\n“This has been the greatest week of my life,’’ Dobnak says. “I don’t think it’s going to get any better than this.’’\n\nYes, even better than that fare two years ago in downtown Pittsburgh when he dropped off a woman with two kids at a Pittsburgh Steelers’ football game, and discovered that she tipped him $100.\n\n“I got to the light, reached out to the cup holder, and “Holy [smokes], it was $100. I tried to figure out who it was to message her, but I never figured it out.\n\n“I hate people that don’t tip. It sucks. The pizza delivery guys, if you think about it, they always get tipped. I’m driving you around, using my gas, using my car, whatever….\n\n“I tip everybody now when I use Uber, unless it’s a really bad driver. Come on, it’s good karma too.’’\n\nAnd he’d still like to know who the idiot was who ruined that don’t give him a 5.0 rating too, with one unknown person giving him a 4-star rating to ruin his perfect store.\n\n“I don’t know what I did wrong, or if it was a mistake,’’ he said, “but that was the only person who didn’t give me a 5-rating.’’\n\nDobnak made nine appearances for the Twins in the regular season. (Photo: Jeffrey Becker, USA TODAY Sports)\n\nIn the world of baseball where the rating system is 20 to 80, and you’re undrafted after pitching at Alderson Broaddus University, a tiny Division II school in West Virginia, wind up pitching for the Utica Unicorns in the four-team independent United Shore Professional Baseball League in Michigan, Dobnak barely registered on the rating scale.\n\nTwins veteran scout Billy Milos wound up discovering him in 2017, hearing about him from Jim Essian, the former Cubs’ major-league manager who was managing Dobnak’s independent league team. Milos never scouted him in person, but watched video on YouTube, before recommending the Twins sign him.\n\n“I searched the entire internet,’’ Milos told USA TODAY Sports on Saturday morning. “Come on, where do you get film on a guy from Alderson Broaddus? Whoever heard of that school?\n\n“I mean, look at him, he looks like an Uber driver. He looks like your accountant. But what he’s done now, going through four different levels in one year to starting Game 2 of the playoffs. What he’s done, it’s nuts, man. This is the stuff you dream of. This never happens. Not even first-rounders. He’s a freak.’’\n\nThe Twins wound up signing Dobnak for $2,000, and after pitching well between his Uber shifts this spring, wound up breaking camp with the Twins’ Class A team in Cedar Rapids, Iowa.\n\n“If everything went right,’’ he said, “I was hoping to maybe make it to Class AA (Pensacola) by the end of the year.’’\n\nDobnak paused, broke into a grin, and said, “But this year has been insane.’’\n\nHe soared through every level of the Twins’ system, was called up to the big leagues on Aug. 9, pitched four times in relief, earned a spot in the starting rotation, made his first start at Fenway Park, and now is makes postseason debut in front of a frenzied crowd at Yankee Stadium.\n\n“I don’t know if it sunk in yet,’’ he said. “I don’t know if it ever will. I think everything that’s happened to me is something I never would have thought of.’’\n\nWell, if it did, he certainly wouldn’t have scheduled his wedding last weekend.\n\nHe and his fiancée, Aerial, figured the timing was perfect. The minor league baseball season is over. The weather’s great that time of year in Maryland. And all of his baseball buddies from the minor leagues could attend.\n\nWho’d ever imagine that three days after clinching the AL Central with Dobnak pitching a one-hitter over six innings against the Tigers, he’d be wearing those same celebratory goggles at his wedding reception with the maid of honor ending her speech by yelling out, “Go Twins!’’\n\n“I still got ‘em, never washed ‘em,’’ Dobnak says of the goggles. “Still have all of that good stuff in them.’’\n\nWho knows, maybe he’ll break them out if he decides to go behind the wheel again this winter, driving Uber, just as he did when he showed up to spring training two months early, worked out in the mornings, and drove from 2 p.m. to 9 pm., and all day on Sundays.\n\n“We’ll see, it’s something I like to do with my free time,’’ he said. “Really, it’s the second perfect job for baseball guys. It’s your own hours. You work when you want to work. You drive when you want to drive, no obligations. It’s really fun. Every ride is different.’’\n\nHe never picked up any of his future Twins’ teammates, but with the Boston Red Sox also training in Fort Myers, it’s quite possible he picked up some ballplayers.\n\n“Well, not Mookie Betts,’’ he said, “I would have known if Mookie Betts got in my car. He probably would have ordered an Uber Lux though.’’\n\nAnd when his new teammates in spring training learned what he did for a living, he did give them a break, permitting them to simply text him for rides, particularly for late-night pizza and Chick-fil-A deliveries.\n\nHey, what’s a buddy for, right?\n\n'He won't be intimidated'\n\nNow, with all of the minor leaguers he left behind in spring training, with only one Twins’ player from the 2017 draft even making it past Class AA, they’ll all be watching Dobnak make one of the most stunning starts in Twins’ history.\n\nThis will be only the fourth traditional start of his major-league career – with two other starts being used as an opener – going 2-1 with a 1.59 ERA in 28 ⅓ innings over nine appearances since his call-up.\n\n“I don’t know how he’ll do,’’ said Milos, who also discovered 29-year-old Tampa Bay Rays rookie Nick Anderson in independent ball, “but I know he won’t be intimidated or scared. He won’t even hear those fans. He just has that makeup that’s different than all these other dudes. Nothing bothers this kid. You never know if he got his ass kicked or pitched a one-hitter. He was just born like this.\"\n\nWhile several of Dobnak’s teammates conceded they felt pressure pitching in New York in Game 1, Dobnak is practically begging the Yankee Stadium crowd to be as raucous and rowdy as possible. Bring on the noise.\n\n“The louder they are,’’ he says, “the more I love it. I can block it out. I’ve been doing it all year. I’ve been trying to simplify the game my whole life, and to do that, I’ve always been able to keep calm. I won’t let my emotions get to me.\"\n\nNow, he’ll be pitching in front of the biggest crowd of his life, leaving eight tickets to his wife, parents, in-laws, agent, and wife’s friend who happens to be a Yankee fan.\n\n“But not tonight,’’ he said.\n\nDobnak, who 10 days ago wasn’t even guaranteed a spot on the playoff roster, was chosen to pitch for his ability to keep the ball down, with a 52.9% groundball rate. He’ll throw 90-96 mph, mix in an array of sliders, and try to keep the baseball in the ballpark facing the most intimidating lineup he has ever faced. The Bronx Bombers hit 306 home runs this season, but Dobnak has given up only one in his big-league career.\n\n“I have confidence,’’ says Dobnak, who wears white glasses while he pitches. “I believe in myself. I’m going to be the same person I’m always going to be.\"\n\nOh, and when the Twins depart New York after the game, he has to remind himself to take a souvenir.\n\nHe forgot to collect anything from Fenway Park, but this time, he can’t leave New York empty-handed.\n\n“Maybe,’’ he says, “I’ll just steal something.’’\n\nA Twins’ victory ending a 15-year drought will do for starters.", "description": "In one of baseball's most inspiring stories, Twins rookie Randy Dobnak will start Game 2 of the ALDS against the New York Yankees.", "authors": ["Bob Nightengale", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/05/USAT/fb28b1bb-2a5b-4071-acc1-9e8ced641a3d-USATSI_13328990.jpg?crop=1773,997,x213,y235&width=3200&height=1680&fit=bounds", "published_at": "2019-10-05"}