{"pub": "cnn", "url": "https://cnn.com/2019/10/02/world/andromeda-galaxy-collision-scn/index.html", "downloaded_at": "2019-10-03 07:33:17.560349+00:00", "published_at": "2019-10-02", "title": "This violent galaxy next door is set for a collision with the Milky Way", "language": "en", "text": "(CNN) Astronomers predict that in about four billion years, the Andromeda galaxy will collide with our own galaxy, the Milky Way. The Andromeda galaxy is our largest and closest neighbor in the universe.\n\nGalaxies are more competitive with each other than friendly. To keep growing, Andromeda had a voracious appetite in the past. Being such a large galaxy, Andromeda was surrounded by smaller galaxies. It's expected to have consumed hundreds of them over the last few billion years.\n\nAndromeda also gobbled up M32p , once the third largest galaxy behind Andromeda and the Milky Way and considered the Milky Way's long-lost sibling. It was at least 20 times larger than any galaxy that has ever merged with the Milky Way.\n\nAndromeda's cannibalistic nature was discovered because there are large streams of stars in its galactic halo, leftovers from meals worn like a badge of honor.\n\nWhile working on a new study, researchers have discovered faint traces of small galaxies Andromeda consumed 10 billion years ago when it was forming.\n\n\"The Milky Way is on a collision course with Andromeda in about four billion years. So, knowing what kind of a monster our galaxy is up against is useful in finding out the Milky Way's ultimate fate,\" said Dougal Mackey, author of the new study at the Australian National University's Research School of Astronomy and Astrophysics. \"Andromeda has a much bigger and more complex stellar halo than the Milky Way, which indicates that it has cannibalized many more galaxies, possibly larger ones.\"\n\nResearchers literally followed the crumb trail to find globular clusters of stars that once belonged to other galaxies within Andromeda.\n\n\"By tracing the faint remains of these smaller galaxies with embedded star clusters, we've been able to recreate the way Andromeda drew them in and ultimately enveloped them at the different times,\" Mackey said.\n\nThe researches realized that the Andromeda galaxy consumed other galaxies in different directions, which presents a new mystery for them to investigate.\n\n\"This is very weird and suggests that the extragalactic meals are fed from what's known as the 'cosmic web' of matter that threads the universe,\" said Geraint Lewis, study co-author and professor at the Sydney Institute for Astronomy and University of Sydney School of Physics. \"More surprising is the discovery that the direction of the ancient feeding is the same as the bizarre 'plane of satellites', an unexpected alignment of dwarf galaxies orbiting Andromeda.\"\n\nStudying Andromeda, a large galaxy like our own, can also inform us more about the evolution of the Milky Way. Because we live in the Milky Way, it's harder to study — like trying to study an entire forest while standing inside it.\n\n\"We are cosmic archaeologists, except we are digging through the fossils of long-dead galaxies rather than human history,\" Lewis said.\n\nSo, what happens to Earth when the inevitable collision between two massive galaxies occurs?\n\n\"I think it's unlikely the Earth will be physically destroyed by the collision with Andromeda,\" Mackey said. \"It's not out of the question, but in general the stars in galaxies are spaced sufficiently sparsely that direct collisions between stars are rare. However, it's possible that the Sun could be thrown out of the merged Andromeda and Milky Way system by the collision, into intergalactic space, and/or a nearby close passage with another star could perturb the Earth's orbit such that the Earth can no longer support life.\"\n\nA collision course future\n\nThis isn't the only collision threat facing the Milky Way.\n\nThe Large Magellanic Cloud will catastrophically collide with the Milky Way in 2 billion years, according to a study published January in the Monthly Notices of the Royal Astronomical Society. The impact, which study says is long overdue, has a chance of sending our solar system \"hurtling through space.\"\n\nOur galaxy is orbited by smaller satellite galaxies, the kind of dance that can go on undisturbed for billions of years. Other times, things take a violent turn, and satellite galaxies can migrate toward the Milky Way until they collide and are gobbled up.\n\nThe Large Magellanic Cloud is fairly new to orbiting the Milky Way, entering our corner of the universe 1.5 billion years ago. It's now the brightest satellite galaxy we have, 163,000 light-years from the Milky Way. Previously, astronomers thought it would hang out in a quiet, long orbit or speed away from the gravity of the Milky Way and move on.\n\nBut new measurements suggest that this little satellite galaxy was hiding a big secret, and it has a much larger mass than expected. This means the Large Magellanic Cloud is losing energy, which will trigger it to collide with the Milky Way.\n\n\"The destruction of the Large Magellanic Cloud, as it is devoured by the Milky Way, will wreak havoc with our galaxy, waking up the black hole that lives at its center and turning our galaxy into an 'active galactic nucleus' or quasar,\" said Marius Cautun, study author and postdoctoral fellow at Durham University's Institute for Computational Cosmology, in a statement.\n\nIf it doesn't send our solar system hurtling through space, the galactic show will be something to see from Earth's perspective. And the researchers suggested that violent events have long shaped the universe.\n\n\"Barring any disasters, like a major disturbance to the Solar System, our descendants, if any, are in for a treat: a spectacular display of cosmic fireworks as the newly awakened supermassive black hole at the center of our galaxy reacts by emitting jets of extremely bright energetic radiation,\" said Carlos Frenk, study co-author and director for the Durham University's Institute for Computational Cosmology, in a statement.", "description": "Astronomers predict that in about four billion years, the Andromeda galaxy will collide with our own galaxy, the Milky Way. The Andromeda galaxy is our largest and closest neighbor in the universe.", "authors": ["Ashley Strickland"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/180723093031-01-wonders-of-the-universe-super-tease.jpg"}