{"pub": "businessinsider", "url": "https://businessinsider.co.za/these-stunning-images-show-how-sandton-durban-and-cape-town-have-transformed-since-the-1930s-2019-9", "downloaded_at": "2019-09-12 07:48:42.755333+00:00", "title": "These stunning images show how Sandton, Durban, and Cape Town have transformed since the 1930s", "language": "en", "text": "Using aerial footage from the 1930s, ecologist Glenn Moncrieff reveals how Sandton, Durban, Cape Town and Theewaterskloof have transformed over the last 80-odd years.\n\nThe aerial photos form part of the National Geo-spatial Information (NGI), a survey system used by the department of rural affairs and land reform .\n\nFor more stories go to www.BusinessInsider.co.za.\n\nUsing archived aerial footage from the 1930s, Glenn Moncrieff, an ecologist at SAEON who creates visual stories of South Africa's ever-changing environment, has produced stunning illustrations of how Sandton, Durban, Cape Town and Theewaterskloof have transformed over the last 80-odd years.\n\n“Since the 1930s aerial photographs of South Africa have been collected, showing the radical changes in our country's landscape. Some incredible stories are documented in this archive,” said Moncrieff.\n\nThe aerial photos form part of the National Geo-spatial Information (NGI), a survey system that includes aerial photographs covering all of South Africa. The archive is publicly accessible via the department of rural development and land reform. The first images date as far back as 1928, and photos have been taken approximately every three years.\n\nThey reveal how human activities have altered landscapes, how cities have grown and reshaped themselves, and how natural ecosystems have been degraded and depleted.\n\n“Digging through these images is like a treasure hunt. Obvious landscape changes like the construction of a dam or a new suburb are easy to discover, but there are many many stories hidden in these archives,” Moncrieff said.\n\nThe hard work is aligning the old images with modem maps, he said because often there are very few features that have survived the 80 or more years since the old photos were taken. But once they are accurately matched, peeling the modern images back to reveal the history underneath is often jaw-dropping.\n\nHere is how parts of South Africa have transformed over the past 80 years.\n\nCape Town Foreshore, 1944 and 2016\n\nDurban harbour 1937 and 2016\n\nSandton 1938 and 2016\n\nTheewaterskloof dam 1953 and 2016\n\nReceive a daily email with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "They reveal the radical changes in our country's landscape.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9348/2daee3524f024eb5adf1dd81b8e3d57c.png", "published_at": "2019-09-12"}