{"pub": "politico", "url": "https://politico.com/story/2019/09/24/pete-buttigieg-bus-tour-2020-1508795", "downloaded_at": "2019-09-24 13:36:10.483005+00:00", "title": "Buttigieg’s bus tour is no Straight Talk Express", "language": "en", "text": "Democratic presidential candidate Pete Buttigieg speaks to reporters on his bus in Iowa. | Scott Olson/Getty Images 2020 elections Buttigieg’s bus tour is no Straight Talk Express The buttoned-down mayor opened his campaign bus in an homage to John McCain, a challenge to Joe Biden and a play to break open the 2020 race.\n\nWATERLOO, Iowa — Driving along a wide-open stretch of Iowa highway, Pete Buttigieg told a clutch of reporters that beef jerky was his favorite road snack, he misses his two dogs, Buddy and Truman, and that he packed four white, button-down shirts — which he ironed himself — and one pair of jeans for this four-day swing across eastern Iowa.\n\nThanks to social media, you may know that already.\n\nStory Continued Below\n\nThe South Bend mayor’s bus tour — leaning into the ultimate press access that fueled his early rise last spring and propelled him into the middle of the 2020 Democratic presidential primary — is more of a Live Tweet Express than its original inspiration, John McCain’s 2000-era Straight Talk Express. Entering the fall months outside the top three spots in the polls, Buttigieg’s campaign is betting again on that transparency, and a rush of headlines and social media posts from reporters transcribing all of his on-the-bus musings, to boost him in Iowa and draw a strong contrast with other candidates less inclined to engage the media.\n\nBut more than the media landscape has shifted in the two decades since McCain’s free-wheeling, print-chronicled campaign. Buttigieg’s careful, professorial manner of speaking is far removed from the late Arizona senator’s bombast and salty language that made him a media sensation. Buttigieg isn’t a “let his hair down and vamp kind of candidate,” said Mike Murphy, a Republican strategist who sat shotgun on McCain’s 2000 campaign bus tour.\n\nButtigieg, though, pushed back on the suggestion that he isn’t as loose as McCain. “Maybe one of you just needs to get a rise out of me,” he said on the Monday morning ride to Waterloo to Elkader, Iowa. (No one did.) He added that McCain, then a veteran senator, “regaled” the press “with stories of other senators,” but said, “I’m not here to educate you on the ways of Washington.”\n\n“You can push my buttons,” he added. Lis Smith, Buttigieg’s senior communications adviser, laughed: “You can try.”\n\nPete Buttigieg boards his campaign bus in Iowa. | Scott Olson/Getty Images\n\nWhen asked, Buttigieg said the last thing that made him yell was a football game.\n\n“McCain was ruthlessly honest, and that’s why it worked. He was not one who minced words or chose them carefully. So, to make a Straight Talk Express work, you need to be forthright,” said David Axelrod, the chief strategist for former President Barack Obama’s campaigns. “Not that Pete is not forthright, but he chooses his words carefully.”\n\n“It may not have the same galvanic effect,” Axelrod said.\n\nOn the bus, a clutch of 10 or so traveling reporters, crushed together on leather seats, pecked away at their laptops and phones as they peppered Buttigieg with questions over the last three days. The moment he answered a query — including what he’d be if not an elected official (“a literary critic at some university”), the nickname he picked up in Afghanistan when buddies found out he was a mayor (“honorable lieutenant”), and the sport most comparable to politics (“football provides the most analogies”) — those answers appeared on Twitter.\n\nThe prolonged exposure yielded a range of on-the-record conversations that meandered from his criticism of Medicare for All proponents’ clearness about how they would pay for the program to the views of the philosopher John Rawls, and then to the nagging question of “electability” in the 2020 primary.\n\n“I remember so many conversations in Indiana, when Obama was emerging, it was always the same thing: ‘I think it’s great, but I’m not sure if the world is ready for this or if my neighbor is ready for this,” Buttigieg said. “I know people are having the same conversations about me, and I think we have a pretty good answer for that.”\n\nButtigieg is competing against a media cycle driven by President Donald Trump, whose move to pressure Ukraine to investigate Joe Biden has dominated the news conversation in recent days. All 2020 candidates are looking to break through in new-fangled ways, from Elizabeth Warren’s thousands of post-event selfies to Beto O’Rourke’s live-streaming. Even Cory Booker transparently laid out his fundraising woes, begging for $1.7 million to keep his campaign going.\n\n“We’re trying to cut through a lot of noise,” Buttigieg said. “One way to do that is to make sure that we’re having a direct conversation in a different way than the others can do.”\n\nJoin our reporters for live coverage of the U.N. General Assembly 9AM on SEPT. 24 for live coverage of the U.N. General Assembly LIVE\n\nButtigieg is hoping to peel away at former Vice President Joe Biden’s supporters in much the same manner that McCain sought to be the “mainstream GOP alternative” to then-Texas Gov. George W. Bush in New Hampshire, opening up all-access line to the press to compete with Bush’s financial lead. He’s positioning himself to be “Biden’s understudy,” said Murphy, adding that, “like McCain, [Buttigieg] is picking his shots.”\n\n\"There's a contrast between a candidate who’s willing to surround himself with reporters 24/7 and a candidate whose interactions with the media are carefully managed,” Axelrod said. “It’s hard to avoid the contrast, and I assume that’s intentional.\"\n\nButtigieg acknowledged that he and Biden are “competing for a lot of the same folks” in the primary. He added: “Part of what’ll shift that my way is when folks start thinking about electability in a way that’s consistent with history, because right now there’s still, I think, a sense that the most familiar face is the most electable face.\"\n\nButtigieg used the “familiar face” line frequently while stumping throughout Iowa this week. And it’s starting to show up in polling. A Des Moines Register/CNN survey found Warren surging to a slim advantage in the first caucus state, with Biden in second place. Buttigieg had 9 percent support in the poll but boasted some of the best favorability numbers. On the bus, Buttigieg said the poll “shows we’re in the hunt.”\n\nButtigieg is also spending seven-figures on a TV and digital ad blitz there, introducing himself in a series of biographical ads.\n\n“When people see Pete for the first time, all of a sudden, they pick their heads up and listen and everything changes,” said Mayor Ryan Arndorfer of Britt, Iowa, who endorsed Buttigieg last week and came to see him in Iowa Falls.\n\nPete Buttigieg speaks to reporters on his bus following a campaign stop in Webster, Iowa. | Scott Olson/Getty Images\n\nThe conversation on the bus occasionally turned personal. Buttigieg said Chasten, his husband, is “ready to be a dad” and the couple would have kids while in the White House, if things get that far. And on Jacob Wohl, the Republican provocateur who tried to smear Buttigieg with a false sexual assault allegation, Buttigieg said, “The biggest thing on my mind was a sense of relief that it was so obviously a sham.”\n\nTo deal with it, though, Buttigieg said he had to “do a lot of compartmentalizing.”\n\nBut the dialogue cut deepest on the shooting in South Bend, when a white police officer shot and killed a black man in June. Buttigieg acknowledged that he was “so focused on making sure that I just did my duty to not take a side and to get information out that I missed a chance to show my level of resonance with why people were upset.”\n\nAs the police union pressured Buttigieg to defend the officer and activists pressured him to fire the officer, “inevitably it feels like you’re not registering the moral and emotional power of what’s going on” when you’re stuck in the middle, Buttigieg said. “What’s really happening is you’re registering all of it, and it’s tearing you up.”\n\nButtigieg acknowledged his campaign has been weak appealing to minority voters, but he said that as “the white candidate most likely to be asked questions about race,” there is “an opportunity in that, especially if I can use that as a way to talk to white people to have a conversation about race that many white people are not ready to have.”\n\nButtigieg did take a break from the press by hopping on Twitter on Monday afternoon. What was scheduled as a 15-minute Twitter question-and-answer turned into a 45-minute conversation between Buttigieg and his supporters, organized via the hashtag #ButtigiegBusTour.\n\n“We’re trending,” Buttigieg said casually, a few questions in.\n\n“Good work,” Smith said, looking over Buttigieg’s shoulder as he scrolled through his mentions. Later, Smith advised Buttigieg to add the hashtag to “juice” its chances of jumping higher on the trends list, while Buttigieg trolled a reporter’s music taste via tweet, as they sat less than three feet apart from each other on the bus.\n\n“If anyone wanted to know how this bus tour would be different from 1999,” Buttigieg said.\n\nThe reporters on the bus sat silently, staring at their phones.", "description": "The buttoned-down mayor opened his campaign bus in an homage to John McCain, a challenge to Joe Biden and a play to break open the 2020 race.", "authors": ["Elena Schneider"], "top_image": "https://static.politico.com/8d/cf/7b8b7858494e9b63aa2da2ae7664/190923-pete-bus-gty-773.jpg", "published_at": "2019-09-24"}