{"pub": "yahoo", "url": "https://finance.yahoo.com/news/peoples-financial-services-corp-reports-201200924.html", "downloaded_at": "2019-10-23 10:04:14.066699+00:00", "title": "Peoples Financial Services Corp. Reports Third Quarter 2019 Earnings", "language": "en", "text": "SCRANTON, Pa., Oct. 22, 2019 /PRNewswire/ -- Peoples Financial Services Corp. (\"Peoples\") (PFIS), the bank holding company for Peoples Security Bank and Trust Company, today reported unaudited financial results at and for the three and nine months ended September 30, 2019. Peoples reported net income of $7.1 million, or $0.97 per share for the three months ended September 30, 2019, compared to $6.7 million, or $0.91 per share for the comparable period of 2018. The increase in earnings for the three months ended September 30, 2019 is the product of higher net interest income of $1.3 million due to growth of $116.1 million in our average earning assets from the year ago period and a decrease of $0.4 million to the provision for loan losses when comparing the three months ended September 30, 2019 to the same period in 2018, partially offset by an increase of $1.5 million in noninterest expenses in the current period.\n\nPeoples Financial Services Corp. Logo. (PRNewsFoto/Peoples Financial Services Corp.) (PRNewsFoto/PEOPLES FINANCIAL SERVICES CORP_) More\n\nNet income for the nine months ended September 30, 2019, totaled $20.7 million or $2.80 per share, an 11.7% increase when compared to $18.5 million or $2.50 per share for the same period last year. The increase in earnings in the current period is the result of higher net interest income of $3.5 million due to our earning asset growth coupled with a $1.1 million decrease in the provision for loan losses when comparing the nine months ended September 30, 2019 to the same period in 2018. These positives were partially offset by an increase of $2.4 million in salaries and employee benefit expenses and $0.6 million in occupancy and equipment expenses in support of our growth initiative.\n\nIn addition to evaluating its results of operations in accordance with GAAP, Peoples routinely supplements its evaluation with an analysis of certain non-GAAP financial measures, such as tangible stockholders' equity and core net income ratios. The reported results included herein contain items, which Peoples considers non-core, namely gains and losses incurred within the investment securities portfolio and gains on the sale of other business lines. Peoples believes the reported non-GAAP financial measures provide information useful to investors in understanding its operating performance and trends. Where non-GAAP disclosures are used in this press release, a reconciliation to the comparable GAAP measure is provided in the accompanying tables. The non-GAAP financial measures Peoples uses may differ from the non-GAAP financial measures of other financial institutions.\n\nCore net income, which we have defined to exclude losses or gains on investment securities and gains from other nonrecurring sources, for the three months ended September 30, totaled $7.1 million and $6.7 million in 2019 and 2018, respectively. Core net income per share for the three months ended September 30, 2019 was $0.97, an increase from $0.91 for the same period in 2018. The results in both 2019 and 2018 exclude a pre-tax $14 thousand gain in the value of our equity investment securities portfolio.\n\nCore net income for the nine months ended September 30, 2019 was $20.7 million or $2.80 per share, an increase of 13.1% compared to $18.3 million or $2.47 per share for the same period of 2018. Results for the nine months ended September 30, 2019 exclude a pre-tax gain of $23 thousand on the sale of debt securities and a pre-tax $6 thousand gain in the value of our equity investment securities portfolio. The 2018 results were impacted by a pre-tax $14 thousand gain in the value of our equity investment securities portfolio and the pre-tax gain of $291 thousand from the sale of our credit card portfolio.\n\nStory continues", "description": "SCRANTON, Pa. , Oct. 22, 2019 /PRNewswire/ -- Peoples Financial Services Corp. (\"Peoples\") (NASDAQ: PFIS), the bank holding company for Peoples Security Bank and Trust Company, today reported ...", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/f_tTxQhOazVbmCbSYbsdtQ--~B/aD04Njt3PTQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://globalfinance.zenfs.com/en_us/Finance/US_AFTP_PRNEWSWIRE_LIVE/Peoples_Financial_Services_Corp_Reports-2a7908b64ffb59d4553143eb75c461aa", "published_at": "2019-10-22"}