{"pub": "nymag", "url": "https://thecut.com/2019/09/review-dermalogica-age-bright-spot-fader.html", "downloaded_at": "2019-09-04 23:48:16.195699+00:00", "published_at": "2019-09-04", "title": "The Fastest-Working Acne Product I’ve Ever Tried", "language": "en", "text": "Photo: Courtesy of the vendor\n\nIf pimples are cool now, then I definitely had the coolest summer. Tomato season was in full bloom at the farmers market — and also on my face, thanks to a tomatoey zit with a gestation period so long it should’ve been considered an heirloom. Unlike most zits, which know exactly how they want to torture you, this one was an indecisive tormentor, switching back and forth from cystic to pustule and back to cystic again. Since I couldn’t anticipate the zit’s evil whims, my usual methods of attack, such as clay and tea-tree oil, were about as effective as bringing a baguette to a fencing match.\n\nAround the fourth week, I found Dermalogica’s Age Bright Spot Fader in the beauty closet. I took it home, and, to my complete surprise, it started working pretty much immediately. After one night of using it, my heirloom shrunk to the size of a Sungold. Two days later, the bump completely disappeared with no flakiness.\n\nMost pimples linger, leaving behind hyperpigmentation. But this handy Dermalogica stick nipped any scarring right in the bud. The spot left over from my zit — which would normally take weeks or even months to fade — is now almost gone. I suspect it’s because of the formula’s clever blend of salicylic acid (which fights pimples) and niacinamide and hexylresorcinol, ingredients proven to help even out skin tone. I’m thankful for this new way to terrorize a zit.\n\nIf you buy something through our links, New York may earn an affiliate commission.", "description": "A review of Dermalogica Age Bright Spot Fader, an acne-fighting product that zaps zits and hyperpigmentation.", "authors": ["Kathleen Hou"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/05/04-dermalogica-spot-fader-feed-b.w1200.h630.jpg"}