{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nascar/2019/10/20/denny-hamlin-wins-hollywood-casino-400-kansas-playoff-race/4046888002", "downloaded_at": "2019-10-20 23:25:56.096674+00:00", "title": "Denny Hamlin edges Chase Elliott as Brad Keselowski eliminated from NASCAR playoffs", "language": "en", "text": "Denny Hamlin earned his fifth victory of the season Sunday in the Hollywood Casino 400 in a drama-filled finish at Kansas Speedway that determined which drivers would advance to the Round of 8 of the Monster Energy NASCAR Cup Series playoffs.\n\nHamlin led 153 of 277 laps, but two late cautions threatened to put his victory in peril. Bubba Wallace brought out a caution with five laps to go to send the race to overtime, then a multicar crash in overtime brought out another yellow flag just before Hamlin took the white flag which would have ended the race under caution.\n\nHamlin executed strong restarts each time, keeping his grip on the lead before finally taking the checkered flag in double overtime.\n\n\"I just had to hold the bottom and get a good push. It was all about the push that I got on those last couple of restarts. That was the most important thing for us – to get a good restart. Once we got out front, we could hold it wide open.\n\n\"Our car was built for downforce, so it worked out that it was just fast enough to win.”\n\nDenny Hamlin celebrates after winning the Hollywood Casino 400 at Kansas Speedway. (Photo: Adam Hagy, USA TODAY Sports)\n\nHamlin edged Chase Elliott, who entered the race below the cutline and needed every point he could amass to earn a berth to the third round. With his runner-up finish, Elliott was able to knock 2012 champion Brad Keselowski out of the playoffs by just three points.\n\n\"I pushed as hard as I knew how and didn’t quite do good enough on the last restart and that was it,\" a disappointed Keselowski said. \"We clawed as hard as we could and there were times it looked like we were going to be fine and times it didn’t. In the end it didn’t work out.”\n\nHendrick Motorsports teammates Alex Bowman and William Byron were also eliminated from championship contention along with Stewart-Haas Racing's Clint Bowyer, who was racing at his hometown track.\n\nHamlin joins Dover International Speedway winner Kyle Larson and Talladega Superspeedway winner Ryan Blaney in the semifinals, along with Martin Truex Jr., Kyle Busch, Kevin Harvick. reigning series champion Joey Logano and Elliott, who each advanced on points.\n\nI'm just excited we get to fight another race,\" a relieved Elliott said. \"With our backs up against the wall here and battling for a win, that's what you have to do when you're in the position that we were in.\"\n\nOVERTIME DRAMA: Keselowski made contact with Daniel Suarez and collected pole winner Daniel Hemric in a crash just before leader Hamlin took the white flag in overtime. As cars tried to avoid the crash, Logano was pushed down on the apron into the grass, sustaining damage to the right front of his No. 22 Ford. Logano brought his car down pit road for repairs before the second overtime restart.\n\nA crash RIGHT BEFORE the white flag!\n\n\n\nAnother restart coming up on @NBC! #NASCARPlayoffspic.twitter.com/rNYcthPfF6 — NASCAR on NBC (@NASCARonNBC) October 20, 2019\n\nWHEEL EXPLOSION: Bubba Wallace brought out a caution with three laps remaining when his rear wheel completely came off his car, causing him to spin in the middle of the track and into the inside wall as his tire rolled aimlessly down the track.\n\nRunaway tire, never coming back.\n\n\n\nWrong way on a one-way track. pic.twitter.com/W9nplZhdTf — NASCAR on NBC (@NASCARonNBC) October 20, 2019\n\nThe yellow flag meant the race would be decided in a green-white-checkered finish.\n\nSTAGE 2: Hamlin passed Joe Gibbs Racing teammate on Lap 125 and maintained the lead to take the second segment. Six consecutive playoff drivers followed with last week's winner Blaney coming home second, Truex third, Byron fourth and Elliott fifth. Harvick, Logano, Paul Menard, Bowyer and Kyle Busch rounded out the top 10.\n\nSTAGE 1: A caution with five laps remaining brought a mix of strategies for the end of the segment with the leaders opting to come down pit road for tires, while a number of drivers stayed on the track to gain positions. The gamble paid off for Logano, one of those drivers who opted not to make a pit stop, as he stormed to the lead on a restart with two laps remaining to win the opening stage at the bonus playoff point.\n\nValuable stage points for Joey Logano and Chase Elliott in Stage 1 at Kansas, presented by @Kroger#ClickList! pic.twitter.com/u5xy2KhRhg — NASCAR on NBC (@NASCARonNBC) October 20, 2019\n\nLogano, who was sitting just above the cutline entering the race, held off Elliott at the checkered flag. They were followed by Suarez, Truex, Kyle Busch, Keselowsi, Blaney, Hamlin, Erik Jones and Ricky Stenhouse Jr.\n\nHollywood Casino 400 results\n\nSunday from the 1.5-mile Kansas Speedway (starting position in parentheses):\n\n1. (23) Denny Hamlin, Toyota, 277.\n\n2. (14) Chase Elliott, Chevrolet, 277.\n\n3. (18) Kyle Busch, Toyota, 277.\n\n4. (15) Kurt Busch, Chevrolet, 277.\n\n5. (25) William Byron, Chevrolet, 277.\n\n6. (11) Martin Truex Jr., Toyota, 277.\n\n7. (20) Erik Jones, Toyota, 277.\n\n8. (21) Clint Bowyer, Ford, 277.\n\n9. (40) Kevin Harvick, Ford, 277.\n\n10. (12) Jimmie Johnson, Chevrolet, 277.\n\n11. (16) Alex Bowman, Chevrolet, 277.\n\n12. (28) Ryan Preece, Chevrolet, 277.\n\n13. (26) Chris Buescher, Chevrolet, 277.\n\n14. (5) Kyle Larson, Chevrolet, 277.\n\n15. (27) Matt DiBenedetto, Toyota, 277.\n\n16. (19) Ricky Stenhouse Jr., Ford, 277.\n\n17. (29) Joey Logano, Ford, 277.\n\n18. (22) Paul Menard, Ford, 277.\n\n19. (4) Brad Keselowski, Ford, 277.\n\n20. (9) Austin Dillon, Chevrolet, 277.\n\n21. (3) Ryan Blaney, Ford, 277.\n\n22. (24) Ty Dillon, Chevrolet, 276.\n\n23. (13) Aric Almirola, Ford, 274.\n\n24. (6) Michael McDowell, Ford, 274.\n\n25. (17) Matt Tifft, Ford, 273.\n\n26. (2) David Ragan, Ford, 273.\n\n27. (33) Ross Chastain, Chevrolet, 272.\n\n28. (31) Corey LaJoie, Ford, 272.\n\n29. (32) Parker Kligerman, Toyota, 271.\n\n30. (36) JJ Yeley, Ford, 271.\n\n31. (1) Daniel Hemric, Chevrolet, Accident, 270.\n\n32. (8) Daniel Suarez, Ford, Accident, 270.\n\n33. (34) Reed Sorenson, Chevrolet, 268.\n\n34. (35) Garrett Smithley, Ford, 267.\n\n35. (10) Bubba Wallace, Chevrolet, Accident, 263.\n\n36. (37) Josh Bilicki, Ford, 262.\n\n37. (30) Landon Cassill, Chevrolet, Vibration, 203.\n\n38. (39) Joey Gase, Toyota, Accident, 107.\n\n39. (38) Timmy Hill, Chevrolet, Too Slow, 95.\n\n40. (7) Ryan Newman, Ford, Accident, 72.\n\nRace Staistics\n\nAverage Speed of Race Winner: 136.491 mph.\n\nTime of Race: 3 Hours, 2 Minutes, 39 Seconds.\n\nMargin of Victory: 0.128 Seconds.\n\nCaution Flags: 7 for 32 laps.\n\nLead Changes: 15 among 12 drivers.\n\nLap Leaders: D. Hemric 1-4; K. Larson 5-6; B. Keselowski 7-8; K. Larson 9-48; W. Byron 49; D. Hamlin 50-58; K. Larson 59-76; R. Blaney 77-78; J. Logano 79-82; C. Elliott 83-86; D. Suarez 87-92; M. Truex Jr. 93-125; D. Hamlin 126-218; A. Bowman 219-225; R. Stenhouse Jr. 226; D. Hamlin 227-277.\n\nLeaders Summary (Driver, Times Lead, Laps Led): Denny Hamlin 3 times for 153 laps; Kyle Larson 3 times for 60 laps; Martin Truex Jr. 1 time for 33 laps; Alex Bowman 1 time for 7 laps; Daniel Suarez 1 time for 6 laps; Chase Elliott 1 time for 4 laps; Daniel Hemric 1 time for 4 laps; Joey Logano 1 time for 4 laps; Brad Keselowski 1 time for 2 laps; Ryan Blaney 1 time for 2 laps; Ricky Stenhouse Jr. 1 time for 1 lap; William Byron 1 time for 1 lap.", "description": "The elimination race, which saw four drivers knocked out of championship contention, was won by Hamlin in double overtime.", "authors": ["Ellen J. Horrow", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/20/USAT/caadae06-1b6b-4499-8b91-00d29201b517-new-hamlin.jpg?crop=1470,827,x631,y201&width=3200&height=1680&fit=bounds", "published_at": "2019-10-20"}