{"pub": "washingtontimes", "title": "How the Redskins are bucking one NFL trend in 2019", "url": "https://washingtontimes.com/news/2019/sep/1/how-redskins-are-bucking-one-nfl-trend-2019", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-03 00:55:59.291589+00:00", "text": "ASHBURN — New Washington Redskins offensive coordinator Kevin O’Connell fits the stereotype.\n\nAround the NFL, owners and general managers looking to replicate the success of Sean McKay and the Los Angeles Rams are rushing to hire their own versions of the coach who called the plays for last season’s NFC champs — young, offensive-minded gurus who understand that the modern NFL game is more Madden 2019 than it is Lombardi 1968.\n\nO’Connell, who at 34 is just eight months older than McVay, is clearly part of that trend — with one key difference. The Redskins want the cutting-edge offensive schemes, but the guy calling the plays this season will still be Jay Gruden, whose seat has never been hotter in his sixth year as the head coach.\n\nFifteen teams have new play-callers, according to sports website The Ringer, since the start of last season, but the Redskins — despite finishing 29th in offensive efficiency in 2018 — aren’t among them.\n\nSitting on a couch inside the Redskins’ facility, Gruden said no when asked if he seriously considered relinquishing play-calling duties.\n\n“It’s what I like to do. So… what the (heck)?” he laughed.\n\nIt wouldn’t have been unheard of. After all, before McVay became the genius behind the Rams’ video-game offense, he was Gruden’s and the Redskins’ offensive coordinator — including calling the plays until he left in 2017.\n\n“People think I’m calling everything,” Gruden said. “I’m really not. … It’s a group effort. That’s what I intend on continuing to do.”\n\nThe Redskins begin their season Sunday in Philadelphia with more question marks around the offense than just Gruden’s play-calling. The wide receivers are regarded as one of the least-talented units in the league. The offensive line, missing a seven-time Pro Bowler at left tackle, has plugged in a former first-round bust at left guard. Oh, and there’s another new quarterback set to start — Washington’s fifth since last year.\n\nWith a defense that has the potential to be one of the league’s best, can Washington score enough points to win games?\n\nIf they want to keep up, the Redskins will have to rediscover the success that they had in 2015 and 2016 — the last time Washington had back-to-back winning seasons — when they ranked 12th and fifth in offensive efficiency. It starts with Gruden.\n\nFinding balance\n\nThe Redskins surprised last year when they emerged as a run-heavy, grind-it-out offense with Alex Smith at quarterback and Adrian Peterson in the backfield. The offense hardly seemed to fit the perception of Gruden as a pass-happy play-caller.\n\nBut Gruden dismisses that reputation. Relying on the run and being physical in the trenches, he says, are two principles he insists upon.\n\n“That’s my type of game,” Gruden said. “I like winning 20-17, 17-10, really.”\n\nLast season’s retro approach had its drawbacks. The Redskins ranked near the bottom of practically every category, from basic stats to advanced. They ranked just 28th in yards, 29th in points per game (17.6) and 29th in passing efficiency. Just 31.8% of their drives ended in an offensive score, eighth-worst in the NFL.\n\nThis year, Gruden wants balance — and that doesn’t mean having a 50-50 split between the run and the pass, he says. As run-heavy as the Redskins got at times in 2018, they still only rushed 42.8% of the time (11th league-wide). In the modern NFL, teams rarely have a true 50-50 split as offenses skew more toward passing. Only one team — the Seattle Seahawks — ran more running plays than passing.\n\nBalance for Gruden means being able to open up the playbook to dial up a variety of plays.\n\nThe Redskins were inefficient last year in part because the offense was constantly in negative situations.\n\nFor instance, Washington led the league in offensive penalties with 4.19 per game. Of their 67 penalties, 32 were the result of holding, and false starts (27) trailed narrowly behind. Digging out of self-inflicted setbacks made it harder to sustain drives.\n\nThe Redskins faced third-and-10-or-longer 69 times last year, tied for third-most in the NFL. On second down, they faced having to convert at least 10 yards on 138 plays, 12th-highest league-wide. Gruden said the Redskins have to do better. Avoiding penalties and negative plays on early downs is key to improving those stats.\n\n“It’s really a chess match,” running back Chris Thompson said. “The coach on one end is guessing and offensive play-caller is guessing and Jay, I feel like he’s making the right calls in those situations way more times than not.\n\n“For us, it’s really just an execution thing on our end.”\n\nAn unproven group\n\nPaul Richardson heard the same things in Seattle. When the 27-year-old was with the Seahawks for the first four years of his career, Richardson and his fellow receivers faced the same doubts, same criticisms the Redskins do now.\n\n“They called us pedestrian,” Richardson said.\n\nRichardson isn’t fazed by the skepticism. The unit may have been one of the least productive in the NFL last year, but, as Richardson notes, Washington played with four quarterbacks. That made it tough for any wideout to produce. “I expect to put points on the board, for sure,” he said. “I think we’ve got enough talent to.”\n\nStill, there are reasons the position group is lightly regarded. Other than Richardson, the other members of the Redskins’ receiving corps have played a combined four games in the NFL. That’s it.\n\nThere are also questions as to whether the team’s best players can stay healthy. Thompson and Richardson each missed six and nine games in 2018, respectively. Tight end Jordan Reed suffered a concussion in the preseason and has yet to play a full season in his career. Derrius Guice is coming off a torn ACL.\n\nIf the Redskins lack talent, this might be a situation in which Gruden and his coaching staff will have to get creative in order to exploit opposing defenses.\n\n“To find good units, whether offense or defense in the NFL, you gotta have a coach who brings you a really good scheme,” ESPN analyst Dan Orlovsky said. “I do think their scheme is a good scheme. And then you’ve got to have the players. And then you’ve got to have the coach who knows how to call that scheme.\n\n“Do they have the players? The answer would be no.”\n\nGruden acknowledged the Redskins have an “unproven group,” but expressed confidence in them.\n\n“I think we can be diverse in what we can do,” Gruden said. “I think we’ve obviously got to be able to run it, stay balanced. If we can be balanced and not be one dimensional on third down and longs and be behind, then we’ll have a chance to be pretty good. “\n\nThe Haskins factor\n\nGruden created a mini-stir this offseason when he joked that if the Redskins miss the playoffs in 2019, he’ll be fired. It’s a fair assumption, given Washington has missed the postseason three straight years.\n\nYet, just as important this season for the Redskins is first-rounder Dwayne Haskins’ development.\n\nIf the Redskins don’t make the playoffs, could Gruden retain his job if Haskins thrives? First, the Ohio State product will need to see the field. Haskins lost the starting job to Case Keenum, though hardly anyone expects the veteran to keep the role for the entire year.\n\nIn today’s NFL, the relationship between the quarterback and coach is more emphasized than ever. Teams aren’t just hiring the McVays of the world because they’re young and charismatic — they’re doing so with the expectation that the hires will elevate their signal-callers.\n\nMcVay transformed Jared Goff’s career. Likewise, Indianapolis’ Frank Reich and Chicago’s Matt Nagy both made the playoffs as first-year coaches and helped their quarterbacks’ development in 2018. This offseason, Cleveland, Cincinnati, Green Bay, Arizona, Tampa Bay and the Jets all made offensive-minded hires to pair with their quarterbacks. Three of them are first-time head coaches.\n\nThe idea, however, isn’t revolutionary. Gruden was hired to save Robert Griffin III’s career when he was hired by the Redskins in 2014.\n\nGruden has a mixed track record when it comes to working with quarterbacks. He elevated Andy Dalton in Cincinnati, but didn’t get results with Griffin. Kirk Cousins flourished into a full-time starter, but Alex Smith was inconsistent.\n\nGruden’s scheme, a variation of the West Coast offense, allows for quarterbacks to get into rhythm with quick throws. Orlovsky, too, said the Redskns do a good job of mixing up their formations and splitting out their wide receivers.\n\nBut every quarterback is different, Gruden said.\n\n“You have to handle them as so,” the coach said. “You have to try and implement a system that fits their style. And certain guys might have more zone reads or bootlegs and other guys might have more pure dropbacks. Dwayne is more of a pocket pure presence of a guy. Case may be able to get outside the pocket a little bit more and do some different things.\n\n“You try to cater to the skill that you have and do the best you can to put the pieces around them where they can succeed.”\n\nHis job might depend on it this season.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Fifteen teams have a new play-callers, per The Ringer, since the start of last season, but the Redskins -- despite finishing 29th in offensive efficiency in 2018 -- aren't among them. That task will remain with coach Jay Gruden, whose job status has never been hotter entering his sixth season.", "authors": ["The Washington Times Http", "Matthew Paras"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/08/26/Redskins_Browns_Football_21353.jpg-adff0_c0-219-5240-3274_s1770x1032.jpg?907d581297011285c7107642d6d4c0e1585509df"}