{"pub": "breitbart", "url": "https://breitbart.com/entertainment/2019/10/17/ronan-farrow-reveals-clinton-camp-raised-concerns-over-harvey-weinstein-reporting", "downloaded_at": "2019-10-18 01:10:22.123787+00:00", "title": "Ronan Farrow Reveals Clinton Camp ‘Raised Concerns’ over Harvey Weinstein Reporting", "language": "en", "text": "A partial transcript is as follows:\n\nBRET BAIER: At one time, you worked for Hillary Clinton. You were doing an interview on a separate project, here spokesman calls and says that they had concerns about the Weinstein story at NBC. Did you feel pressure from Hillary Clinton on this?\n\nRONAN FARROW: Like everything else in the book, Bret, this is handled in a very measured way. The book is meticulously fact-checked, we had long conversations with everyone discussed in it, including Hillary Clinton’s people, and it’s extremely fair to her. I can’t speak to her state of mind. What I can say is she attempted to withdraw from an interview that she had committed to for a foreign policy book I was working on, for which I interviewed every other living secretary of State. And, before doing so, her staff raised concerns about the fact that I was working on this story about one of her most significant donors, a big bundler of Hollywood money.\n\nBAIER: At one point, NBC kills your story. Are you demoralized, do you think it’s going to see the light of day?\n\nFARROW: The fundamental fact here is that I took reporting that this network looked at, and you can read the book for yourself, and took it across the street to the New Yorker, and in just a matter of weeks, it became a Pulitzer Prize-winning body of reporting. I owe that to the bravery of my sources, I owe it to incredible editors there, and I think that it tells an important story about the circles of mutual protection and power in our business, the media, and the need to hold ourselves accountable. That’s true of CBS, where I did reporting on allegations of misconduct and secret settlements there. It’s true of Fox, which has done a great job at confronting some of the issues here, including the use of secret settlements, and now there’s tough conversations about this at NBC.", "description": "Appearing Wednesday on Fox News Channel's Special Report, Pulitzer Prize-winning reporter and author Ronan Farrow detailed how aides to failed presidential candidate Hillary Clinton raised concerns to him regarding his reporting on disgraced Hollywood producer and Democrat Party bundler Harvey Weinstein in his new book \"Catch and Kill.\"", "authors": ["Joshua Caplan"], "top_image": "https://media.breitbart.com/media/2017/10/HarveyAndHillary.jpg", "published_at": "2019-10-17"}