{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/16/ozunas-4-rbis-throw-to-plate-lift-cards-over-nats-", "downloaded_at": "2019-09-17 08:25:23.398624+00:00", "title": "Ozuna's 4 RBIs, throw to plate lift Cards over Nats 4-2", "language": "en", "text": "ST. LOUIS (AP) - Dakota Hudson is a big fan of Marcell Ozuna’s arm.\n\nOzuna drove in four runs and threw out a runner at home plate from left field, leading the St. Louis Cardinals over the Washington Nationals 4-2 on Monday night.\n\n“That’s the second one he’s had for me this year,” Hudson said of Ozuna’s assist to the plate. “He’s looking really good. He threw a perfect one in there to save a run.”\n\nSt. Louis maintained a two-game NL Central lead over the second-place Chicago Cubs, who closed within a half-game of the Nationals for the top NL wild card\n\nNationals manager Dave Martinez missed the game following a heart procedure in Washington, and bench coach Chip Hale was in charge of the dugout.\n\n“I’m sure he’ll give us a call after the game if he’s up,” Hale said. “I know he’s been through a battery of tests. Hopefully he’s feeling good.”\n\nOzuna hit a two-run homer in the first off Stephen Strasburg, who walked Dexter Fowler leading off.\n\n“I was in the same division as him and I faced him a lot,” Ozuna said. “I know this guy. I know what I can handle to get a good at-bat.”\n\nOzuna has faced Strasburg 41 times and has 12 hits, including three home runs and six RBIs.\n\n“I figured based on his numbers that Ozuna would have a good night, but I feel that way every night about him,” St. Louis manager Mike Shildt said. “It was a nice, nice job by him all the way around tonight. I’m pleased with the homer and two-run but the throw, he’s put a lot of time, effort and energy in his arm. He is sincere about being a complete player.”\n\nWashington tied the score 2-2 on Víctor Robles’ RBI single in the fourth and Anthony Rendon’s 34th homer leading off the sixth. Ozuna charged on Robles’ hit and made a one-hop throw to catcher Yadier Molina, who tagged out Asdrúbal Cabrera trying to score from second.\n\n“I’m getting my rhythm back,” Ozuna said. “I’m almost there.”\n\nSean Doolittle (6-5) walked Fowler with one out in the seventh, Hunter Strickland walked Paul Goldschmidt with two outs and Ozuna doubled just inside the left-field line, just the second hit in 11 at-bats for the Cardinals with runners in scoring position.\n\n“He just missed with his pitch,” Hale said. “He just sort of pulled it across the plate, and Ozuna did a nice job.”\n\nHudson (16-7) won for the sixth time in seven starts, giving up two runs and five hits in seven innings.\n\n“I didn’t have very much tonight,” Hudson said. “The ball was moving a lot, but I didn’t have the best command. I had to battle with what I had.”\n\nJohn Brebbia, Andrew Miller and Martínez followed with perfect relief. One day after he was released from a hospital following respiratory problems caused by asthma and allergies, Martinez needed just two pitches to retired Ryan Zimmerman on a flyout for his 20th save in 23 chances.\n\n“I told them I had two innings in me because right now, I feel good. I needed just two pitches,” Martinez said. “I’m focused to compete. I was happy to get out there. They need me. I’m ready for tomorrow and the next day.”\n\nStrasburg gave up two runs, three hits and four walks in five innings, his shortest outing since Aug. 3. He is 3-2 in his last nine outings after winning seven straight starts in late June and July, leaving his record at 17-6.\n\nHOLD ON\n\nMiller tied his season best with his 27th hold.\n\nBASE BURGLERS\n\nMolina, Kolten Wong, Tommy Edman and Dexter Fowler all stole second base, raising the Cardinals‘ NL-leading total to 109.\n\nUP NEXT\n\nNationals: LHP Patrick Corbin (12-7, 3.20) is 1-2 with a 4.89 ERA against the Cardinals. His lone win came in 2016 when he pitched for Arizona.\n\nCardinals: RHP Miles Mikolas (9-13, 4.28) beat the Nationals 5-1 on May 1 when matched against Max Scherzer.\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Dakota Hudson is a big fan of Marcell Ozuna's arm.", "authors": ["The Washington Times Http", "Warren Mayes"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/16/nationals_cardinals_baseball_66483_c0-213-5103-3188_s1770x1032.jpg?9da276ccda780477c5f4ccdeea53e45d7dd5b7ea", "published_at": "2019-09-16"}