{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/19/no-23-california-carries-unbeaten-record-into-ole-", "downloaded_at": "2019-09-19 23:07:49.793170+00:00", "title": "No. 23 California carries unbeaten record into Ole Miss", "language": "en", "text": "No. 23 California (3-0) at Mississippi (2-1), Saturday at 12 p.m. EDT (ESPNU).\n\nLine: Ole Miss by 2 1/2.\n\nSeries record: Cal leads 1-0.\n\nWHAT’S AT STAKE?\n\nCal is aiming to remain unbeaten and start 4-0 for the first time since 2015. Ole Miss is seeking its first win over a Top 25 team since beating No. 16 Mississippi State 31-28 in 2017.\n\nKEY MATCHUP\n\nThe Ole Miss rushing attack vs. the Cal run defense: After getting held to 80 yards rushing on 33 carries in a season-opening loss to Memphis, Ole Miss has run for at least 220 yards in each of its last two games. California has allowed just 129.3 yards rushing per game and 3.6 yards per carry.\n\nPLAYERS TO WATCH\n\nCal: LB Evan Weaver: He has 41 total tackles to lead all Football Bowl Subdivision performers, and his 13.7 tackles per game rank fourth nationally. He has made at least 10 tackles in 10 straight games. He collected 18 tackles, forced a fumble and recorded a sack in a road upset of then-No. 14 Washington.\n\nOle Miss: RB Scottie Phillips: He averages 102.7 yards rushing per game to rank third in the Southeastern Conference. He has four touchdown runs this season and has gained over 100 yards in each of his last two games.\n\nFACTS & FIGURES\n\nCal has held its last 10 opponents below 24 points, a stretch that began last season. … Ole Miss’ offensive and defensive coordinators are both former Pac-12 head coaches - offensive coordinator Rich Rodriguez (Arizona) and defensive coordinator Mike MacIntyre (Colorado). … Cal owns an 8-0 regular-season nonconference record during Justin Wilcox’s coaching tenure. The Golden Bears did lose to TCU in the Cheez-It Bowl last season. … Ole Miss hasn’t lost a nonconference home game since 2012. … Ole Miss has collected at least eight tackles for loss in each of its three games. … These two teams last faced each other in 2017, when Cal beat the visiting Rebels 27-16. … Ole Miss’ Jerrion Ealy has 367 all-purpose yards, the second-highest total for a true freshman this season. Ealy scored on a 94-yard kickoff return in a victory over Southeastern Louisiana last week.\n\n___\n\nMore AP college football: https://apnews.com/tag/Collegefootball and https://twitter.com/AP_Top25\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "No. 23 California (3-0) at Mississippi (2-1), Saturday at 12 p.m. EDT (ESPNU).", "authors": ["The Washington Times Http", "The Associated Press"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/14/north_texas_california_football_71287_c0-177-4222-2638_s1770x1032.jpg?817a7f6aed919170de4f84fbbb67c464797defbb", "published_at": "2019-09-19"}