{"pub": "yahoo", "url": "https://sg.finance.yahoo.com/news/nordea-takes-1-3-billion-050345832.html", "downloaded_at": "2019-10-24 06:58:13.200011+00:00", "title": "Nordea's third-quarter earnings take 1.3 billion euro hit as new CEO takes over", "language": "en", "text": "Nordea bank sign is seen in Copenhagen\n\nHELSINKI (Reuters) - Nordea Bank Abp <NDAFI.HE>, one of the Nordic region's biggest lenders, on Thursday reported its first quarterly earnings under a new chief executive, saying they were dragged down by surprise one-off charges totalling 1.3 billion euros ($1.45 billion).\n\nThe results come in a year which has seen Nordic bank shares tumble following a money-laundering scandal at Danske Bank A/S <DANSKE.CO>.\n\nNordea, which has also struggled with declining profitability, reported an operating loss for July-September at 421 million euros.\n\nThat compared with the average expected profit of 905 million in a Refinitiv poll of six analysts.\n\nThe bank blamed the loss in part on 1.3 billion euros worth of one-off items including an impairment charge for IT intangibles, a restructuring provision, an additional loan loss provision and an expense related to a share sale.\n\nSeveral key executives, including the chief financial officer and chief operating officer, have left bank recently, marking the first moves under newly appointed CEO Frank Vang-Jensen.\n\nInterest income, the bank's most-watched income line, fell 4% versus the same period a year prior to 1.08 billion euros.\n\nNordea also announced financial targets for 2022, with a return-on-equity target of above 10% and cost-to-income ratio of 50%.\n\nNordea said it targets a dividend of 0.4 euros for 2019. Analysts' average forecast stood at 0.47 euros in the poll.\n\n\n\n\n\n($1 = 0.8980 euros)\n\n\n\n\n\n(Reporting by Anne Kauranen and Tarmo Virki; Editing by Christopher Cushing)", "description": "Nordea Bank Abp , one of the Nordic region's biggest lenders, on Thursday reported its first quarterly earnings under a new chief executive, saying they were dragged down by surprise one-off charges totalling 1.3 billion euros ($1.45 billion).  The results come in a year which has seen Nordic bank", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/B2K85upmLITvYXdCInA3HA--~B/aD01Njk7dz03OTk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/reuters.com/9fcd090421f94053e61eb96824b51348", "published_at": "2019-10-24"}