{"pub": "rt", "url": "https://rt.com/news/470856-us-troops-cutoff-turkey-syria", "downloaded_at": "2019-10-13 18:51:35.866756+00:00", "title": "Turkish-backed forces ‘CUT OFF US troops’ after seizing key highway in Syria", "language": "en", "text": "Turkish forces have taken control of a key supply route in northern Syria, as Ankara’s offensive against Kurdish militias continues. The seizure cuts off US forces in the region, amid a hasty American withdrawal.\n\nThe M4 highway runs parallel to the Syria-Turkey border, and is an essential supply route for Kurdish militia groups in the area. The Turkish Defense Ministry announced on Sunday that it has seized control of the route, and pushed 30-35km into Kurdish-held territory, several kilometers beyond its proposed 30km ‘safe zone.’\n\nAs a result of the successful conduct of Operation Peace Spring, a depth of 30-35 km has been reached and M-4 highway has been taken under control.🇹🇷 — T.C. Millî Savunma Bakanlığı (@tcsavunma) October 13, 2019\n\nIn an earlier report, CNN stated that its reporters witnessed anti-government Syrian rebels – allied with Turkey – taking control of the route as Turkish aircraft buzzed overhead.\n\nThe Turkish incursion reportedly isolates US troops stationed in the Kurdish stronghold of Kobani from those stationed in the eastern reaches of Kurdish territory. Though the offensive was launched after the withdrawal of a small number of US troops near the Turkish border in northern Syria, its speed and depth prompted Washington to pull another 1,000 American personnel from the area.\n\nAlso on rt.com Trump threatens to impose ‘powerful sanctions’ on Turkey\n\nDefense Secretary Mark Esper told CBS News on Sunday that the US is “preparing to evacuate” the troops “as safely and quickly as possible,” to avoid being pinned between the Turkish advance and Kurdish defense, and also to allow the Kurds to “cut a deal” with the Syrian government and Russia to “counter-attack against the Turks.”\n\n“And so we find ourselves, we have American forces likely caught between two opposing advancing armies, and it’s a very untenable situation,” he told CBS.\n\nThere is no way they could stop 15,000 Turks from proceeding south.\n\nIt is not clear whether the troops will be flying home to America, despite President Donald Trump’s pledge to cease the US’ “endless wars.” Gen. Mark Milley, chairman of the Joint Chiefs of Staff, said on Friday that American troops will remain “co-located” with Kurdish forces, but that will likely be dictated by the depth of the Turkish advance.\n\nWith Turkish forces pressing south, President Recep Tayyip Erdogan has been criticized worldwide for launching the operation, out of concern for civilian casualties and fear that Islamic State (IS, formerly ISIS) prisoners may escape in the carnage. Kurdish officials have already claimed that several hundred IS-affiliated prisoners have fled from a camp shelled by the Turks over the weekend. Erdogan has dismissed the claims, calling them “disinformation.”\n\nThink your friends would be interested? Share this story!", "description": "Turkish forces have taken control of a key supply route in northern Syria, as Ankara’s offensive against Kurdish militias continues. The seizure cuts off US forces in the region, amid a hasty American withdrawal.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5da3550485f5401bb20dc12b.JPG", "published_at": "2019-10-13"}