{"pub": "metro", "url": "https://metro.co.uk/2019/10/13/uncharted-2-among-thieves-a-10th-birthday-celebration-readers-feature-10905149", "downloaded_at": "2019-10-13 00:24:06.485612+00:00", "title": "Uncharted 2: Among Thieves, a 10th birthday celebration – Reader’s Feature", "language": "en", "text": "On the day of the game’s original US release a reader looks back at Uncharted’s first sequel and explains why he thinks it’s a 10/10 classic.\n\n*** WARNING: CONTAINS SPOILERS FOR THE UNCHARTED SERIES! ***\n\nI was late for the Uncharted party, finally getting around to playing the first game in early 2009. I really enjoyed the adventure romp vibe with likeable, relatable characters, so I pre-ordered Uncharted 2: Among Thieves as soon as I could and played it on release day. I adored it, so much so that when I finished it I just started playing it all over again! On the 16th October Uncharted 2 is 10 years old in the UK [the 13th in America – GC] and it’s still one of my favourite games of all time, here are some of the reasons why:\n\n‘What’s going on?…’\n\nWhile lots of entertainment ends on a cliffhanger Uncharted 2 started with a literal one! Nate is wounded and hanging off a train, which is itself hanging off a cliff. We don’t know what’s happened to get Nate into this precarious situation but as beginnings of games goes this really hooks you from the start.\n\nAdvertisement\n\nAdvertisement\n\n‘Elena Fisher… last year’s model.’\n\nOne of the main reasons I enjoyed the first Uncharted so much was the chemistry between Nate and Elena, but now along comes Chloe Frazer! It could have all gone very James Bond – new adventure, new love interest – but no, Naughty Dog chose to do something far more interesting, by having both Chloe and Elena in the sequel.\n\nThe dynamic between Nate and these two very different ladies really added more depth to the roguish thief.\n\nChloe initially seems a more suitable girlfriend for Nate, after all they’re in the same line of work, but when their paths cross with Elena’s in Nepal the dynamic between Nate and Chloe shift.\n\nI really love how Naughty Dog have developed these characters over the series and none more so than Elena – in Uncharted 2 she’s lost the sense of wide-eyed wonder she had in the first game and instead of doing her archaeology/adventure show she was working on then, she’s now a more serious journalist trying to expose a war criminal – the very same guy Nate is trying to beat to the treasure!\n\nAlthough initially sceptical about Nate’s motives, Elena proves to be the perfect companion for him on his adventures – funny, smart, and tough yet caring. She’s also incredibly loyal, while Chloe often chooses to save her own skin over the safety of others, Elena always has Nate’s back.\n\n‘Desperate times, right?’\n\nAs much as I loved the first game it was basically just a treasure hunt, with Nate and his companions trying to beat some other guys (who have hired an army of pirates and mercenaries to keep attacking Nate!) to the treasure.\n\nAdvertisement\n\nAdvertisement\n\nIt’s only revealed right near the end that it’s Navarro not Roman who’s the real villain, as he plans to sell the cursed treasure as a weapon.\n\nBut with Uncharted 2 Naughty Dog gave us Zoran Lazarevic and made me feel there was far more at the stake. He’s a war criminal hell-bent on getting the treasure for his own sinister purposes and having a proper villain this time around makes Nate rise up to be the unlikely hero far earlier in the game.\n\n‘We have a train to catch.’\n\nAnother flaw with the first game was that the climbing and combat were kept largely separate, which was another thing the sequel fixed, the prime example of this is the train!\n\nTo have Nate climbing over and running through the carriages of a speeding train, all the while involved in gun and fist fights was a breathtaking experience, throw in a gunship (thankfully Lazarevic remembered to load a very useful tank on the train!) and you have my favourite action sequence of the whole series.\n\n‘How did I get here?’\n\nFollowing the adrenaline fuelled train ride and subsequent wreck, the game changes pace in the most wonderful way. After collapsing in the snow after the train wreck, Nate wakes up in a small mountain village. It’s not a huge level but as you wander around as Nate you get to interact in a very different way. No climbing and fighting, instead you can shake hands with the villagers, kick a football back to some children and pet the yaks. These simple interactions make the village chapter feel like a little oasis of calm after all the train chaos, which makes it hurt all the more when Lazarevic and his troops turn up a few chapters later and tear the place apart.\n\nAdvertisement\n\n‘So, on a scale of one to 10…’\n\nSo I guess to some it all up, for me Uncharted 2 is the perfect sequel, taking everything that made the first game fun, whilst improving the combat, adding awesome set pieces, delivering a stronger story with more characters and developing the original pairing of Nate and Elena that I so loved. My rating on a scale of one to 10? 10, definitely… and no clowns either!\n\nBy reader LastYearsModel\n\nThe reader’s feature does not necessary represent the views of GameCentral or Metro.\n\nYou can submit your own 500 to 600-word reader feature at any time, which if used will be published in the next appropriate weekend slot. As always, email gamecentral@ukmetro.co.uk and follow us on Twitter.", "description": "On the day of the game’s original US release a reader looks back at Uncharted’s first sequel and explains why he thinks it’s a 10/10 classic.", "authors": [], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/182g0vqq8xa8zjpg-16d1_1570840424.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-13"}