{"pub": "yahoo", "url": "https://finance.yahoo.com/news/european-equities-brexit-earnings-economic-010246830.html", "downloaded_at": "2019-10-17 12:02:30.578347+00:00", "title": "European Equities: Brexit, Earnings and Economic Data in Focus", "language": "en", "text": "Wednesday, 16th October\n\nItalian CPI (MoM) (Sep) Final\n\nEurozone Core CPI (YoY) (Sep) Final\n\nEurozone CPI (MoM) (Sep)\n\nEurozone CPI (YoY) (Sep) Final\n\nEurozone Trade Balance (Aug)\n\nThe Majors\n\nIt was a bullish day for the European majors on Tuesday. The DAX30 led the way, rallying by 1.15%, with the EuroStoxx600 and CAC30 up by 1.11% and 1.04% respectively.\n\nFollowing a bearish start to the week, the majors were able to brush aside continued uncertainty over the ongoing U.S – China trade war.\n\nPositive updates on Brexit from the EU on the possibility of a Brexit deal this week provided strong support for the majors.\n\nMichael Barnier, the EU’s chief negotiator, spoke on Tuesday of a deal still being possible this week.\n\nFrom the U.S, corporate earnings were a boost for the global equity markets, with JPMorgan earnings impressing.\n\nThe Stats\n\nIt a relatively busy day on the Eurozone economic calendar on Tuesday. Economic data included Germany and the Eurozone’s ZEW economic sentiment figures for October.\n\nOf less influence on the day were Germany’s ZEW current conditions and French finalized September inflation figures.\n\nAccording to the latest ZEW report,\n\nThe German ZEW Current Conditions Index fell from -19.9 to -25.3 in October. Economists had forecast a decline to -26.0.\n\nGermany’s ZEW Economic Sentiment Index fell from -22.5 to -22.8 in October, which was better than a forecast of -27.0\n\nThe Eurozone’s ZEW Economic Sentiment Index fell from -22.4 to -23.5 in October. Economists had forecast a decline to -33.0.\n\nConcerns over a possible recession weighed on consumer sentiment at the start of the 4th quarter, with progress in the U.S – China trade talks having provided little comfort.\n\nFrom the U.S, a modest pickup in manufacturing sector activity in New York State was enough to avoid stressing the majors. The NY Empire State Manufacturing Index rose from 2 to 4 in October.\n\nThe Market Movers\n\nFor the DAX: Autos found strong support, with BMW leading the way, rallying by 2.45%. Daimler was also amongst the best performers on the DAX, rallying by 2.26%. Continental and Volkswagen weren’t far behind, with gains of 1.8% and 2.20% respectively.\n\nBank stocks also found further support. Deutsche Bank rallied by 2.88% to lead the way on the DAX30, while Commerzbank rose by 0.97%\n\nFrom the CAC, it was also a bullish day for the banks. BNP Paribas and Soc Gen led the way with gains of 3.64% and 2.12% respectively. Credit Agricole saw a more modest rise of 1.51%. For the autos, it was also positive with Renault rising by 1.36%, while Peugeot rallied by 2.85%.\n\nOn the VIX Index\n\nThe VIX Index saw red for a 5th consecutive day on Tuesday, declining by 7.07%. Following on from a 6.48% fall on Monday, the VIX ended the day at 13.5.\n\nProgress on Brexit and U.S corporate earnings, with JPMorgan Chase earnings, in particular, supported risk appetite on the day.\n\nThe Day Ahead\n\nIt’s a relatively busy day ahead on the Eurozone economic calendar. Economic data includes finalized September inflation figures for Italy and the Eurozone. Alongside the inflation figures, the Eurozone’s August trade data is also due out.\n\nWe would expect the inflation figures to have a relatively muted impact on the majors, however, with Brexit and corporate earnings in focus.\n\nA material narrowing in the Eurozone’s trade surplus could test the majors in the early part of the session.\n\nFrom the U.S, September retail sales figures will provide direction later in the day. With recession talk continuing to do the rounds, any unexpected slide in sales will impact.\n\nOn the earnings front, corporate earnings from the U.S will also have influence. Bank of America and Morgan Stanley’s 3rd quarter results are in focus.\n\nWhile U.S stats and corporate earnings will be key, expect Brexit chatter to have the ultimate say on the day. With just days remaining until the EU Summit, it’s crunch time for Boris and the Brexiteers.\n\nIn the futures market, at the time of writing, the DAX30 was down by 11 points, with the Dow down by 50 points.\n\nThis article was originally posted on FX Empire\n\nMore From FXEMPIRE:", "description": "Brexit remains a key driver on the day as the EU Summit rapidly approaches. Eurozone trade data, U.S retail sales, and earnings will also influence.", "authors": ["Bob Mason"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Ni0FoVo4o69gSBoEBNmXAg--~B/aD01ODY7dz03NjE7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/fx_empire_176/a1d15d841224882985b08cdaebb45368", "published_at": "2019-10-16"}