{"pub": "realclearpolitics", "url": "https://insidehook.com/daily_brief/sports/colin-kaepernick-still-being-ignored-by-nfl-despite-rash-of-qb-injuries", "downloaded_at": "2019-09-18 23:22:38.983870+00:00", "title": "Colin Kaepernick Still Being Ignored by NFL Despite Rash of QB Injuries", "language": "en", "text": "Though he hasn't played in the league since 2016, Colin Kaepernick is interested in an NFL return\n\nColin Kaepernick Still Being Ignored by NFL Despite Rash of QB Injuries\n\nThough he hasn’t played in the league since 2016, Colin Kaepernick is still interested in returning to the NFL. Unfortunately for the 31-year-old quarterback, the NFL doesn’t seem to be interested in him.\n\n“He is actively, actively interested in trying to play in the NFL,” Mark Geragos, Kaepernick’s attorney, told USA TODAY Sports on Tuesday.\n\nKap is so interested in getting back on the field that members of his team reportedly reached out to the Steelers, Jets and Saints, all of whom now have holes at quarterback thanks to injuries and illness. But according to Stephen A. Smith of ESPN, none of those teams have expressed interest in Kaepernick’s services.\n\n“I am being told that he has contacted — Colin Kaepernick’s agent and others — have contacted the Pittsburgh Steelers. Essentially they’re not interested,” Smith said on First Take. “They’ve contacted the Jets, no word on them yet. They’ve contacted the Saints. They didn’t get their phone calls returned.”\n\nNext up on the list could be the Jacksonville Jaguars, who will be without starter Nick Foles for two months, and the Carolina Panthers, as it seems Cam Newton could miss this Sunday.\n\n“Colin is literally in the best shape of his life,” Chris Williamson of SNY reported, according to ProFootballTalk. “He’s been working out five days a week at 5 a.m. for three years. He wants to play and his agent has been contacting teams in need of a quarterback.”\n\nIt’s high time for one of those teams to call Kaepernick back.\n\nEditor’s Note: RealClearLife, a news and lifestyle publisher, is now a part of InsideHook. Together, we’ll be covering current events, pop culture, sports, travel, health and the world. Subscribe here for our free daily newsletter.\n\nRead the full story at USA Today", "description": "Kap is so interested in getting back on the field that members of his team reached out to the Steelers, Jets and Saints, all of whom have holes at QB.", "authors": ["Evan Bleier"], "top_image": "https://www.insidehook.com/wp-content/uploads/2019/09/GettyImages-1164675179-2-e1568813897722.jpg?fit=847%2C565", "published_at": "2019-09-18"}