{"pub": "businessinsider", "url": "https://businessinsider.com/the-park-terrace-hotel-review-new-york", "downloaded_at": "2019-10-15 23:13:39.976947+00:00", "title": "Hotel Review: We spent a night at the boutique Park Terrace Hotel in Bryant Park and loved the mod room, free breakfast, and upscale amenities", "language": "en", "text": "Many people visiting New York want to stay in Midtown Manhattan, near Times Square. Nearby Bryant Park is a more relaxed option to consider, and home to the boutique four-star Park Terrace Hotel.\n\nOnly a year old, the Park Terrace is an amenity-rich, sophisticated hotel with many perks that help offset a starting price of $300 per night, such as free breakfast, complimentary amenities and water, and great health and wellness options.\n\nI spent a night in a Studio View room, and recommend it to those who prefer boutique hotels over large chains, and want something cheaper than a five-star hotel, but more stylish than a three-star budget option.\n\nMany hotels near Times Square in Manhattan are big brand chains, where the lobby can feel just as crowded as Times Square itself. And while that serves a purpose for some (hello loyalty points!), the Park Terrace Hotel offers a refreshing alternative. It's a great base when you want to be near Times Square, but not actually thrust into the center of it.\n\nDirectly overlooking Bryant Park and the New York Public Library, and just steps to Times Square, Grand Central, and other major Midtown Manhattan attractions, the Park Terrace is an upscale four-star boutique property for discerning grownups. There are no large tour groups like in the high volume hotels, nor are there big families. Rather, the newish hotel (open just a year) seems to attract mostly couples, business types, and tourists who favor a stylish stay without the bells and whistles (or inflated price tag) of a full five-star luxury hotel.\n\nWith rooms starting around $300 per night for classic options, rising to $500 and up for suites, the Park Terrace is comparable to other high-end New York hotels, but also comes with added perks like free gourmet breakfast, complimentary water and amenities (more on that in a bit), and a Peloton-equipped gym.\n\nI spent a night in a Studio View room and wouldn't hesitate to recommend it to friends and family looking to stay in Midtown.\n\nKeep reading to see why I was so impressed by the Park Terrace Hotel.", "description": "Visiting Midtown Manhattan? Here's why we think you should strongly consider booking the boutique Park Terrace Hotel overlooking Bryant Park.", "authors": ["Emily Hochberg"], "top_image": "https://image.businessinsider.com/5da609e6cc4a0a0f132f871a?width=1200&format=jpeg", "published_at": "2019-10-15"}