{"pub": "breitbart", "url": "https://breitbart.com/sports/2019/10/14/watch-psa-claims-tackle-football-is-like-smoking", "downloaded_at": "2019-10-14 23:28:52.699866+00:00", "title": "WATCH: PSA Claims ‘Tackle Football Is Like Smoking’", "language": "en", "text": "A new public service announcement is taking a direct shot at youth tackle football, by claiming that participating in the sport is “just like smoking.”\n\nAlong with the video, is a new study which claims that the number of years someone participates in tackle football is tied to their risk for developing chronic traumatic encephalopathy (CTE).\n\nWatch:\n\nAccording to Boston University’s CTE Center:\n\nFor every year of absorbing the pounding and repeated head collisions that come with playing American tackle football, a person’s risk of developing chronic traumatic encephalopathy (CTE), a devastating neurodegenerative disease, increases by 30 percent. And for every 2.6 years of play, the risk of developing CTE doubles. These new findings from an analysis of 266 deceased former amateur and professional football players—reported in Annals of Neurology by a team of researchers from the Boston University CTE Center—are the first to quantify the strength of the link between playing tackle football and developing CTE.\n\nThese findings, made possible by the large number of families who allowed the brains of their relatives to be analyzed for the research, convinced researchers that the length of time one plays tackle football can lead to a rise in CTE.\n\n“This study is a testament to the hundreds of families who have donated their loved one’s brain. … It is only because of this support that we can confidently estimate the strength of the relationship between duration of [football] play and risk of CTE,” Neurologist and CTE Center Director Dr. Ann McKee, said in a statement.\n\nIt’s these findings that led the Concussion Legacy Foundation, a non-profit “committed to protecting athletes and families through research, policy, and education,” to create the ad comparing tackle football to smoking.\n\nAccording to Sporting News, “The ad is part of the Concussion Legacy Foundation’s “Tackle Can Wait” campaign that has the goal of children younger than 14 playing flag football instead of full-contact tackle football, leaning on its claim (backed by the new study) that kids who start playing tackle football at the age of 5 have 10 times the risk of developing CTE compared to those who wait until they’re 14.”\n\nAccording to recent survey of sports participation in America, youth and high school football participation was found to have only increased in three states (Texas, California, and Minnesota) from last year. States such as California and Massachusetts have either introduced legislation to ban youth football, or are seriously considering doing so.\n\nFollow Dylan Gwinn on Twitter @themightygwinn", "description": "A new public service announcement is taking a direct shot at youth tackle football, by claiming that participating in the sport is \"just like", "authors": ["Dylan Gwinn"], "top_image": "https://media.breitbart.com/media/2019/10/AP-Mark-Schiefelbein-640x480-640x335.jpg", "published_at": "2019-10-14"}