{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/tony-stark-know-endgames-snap-going-happen-way-back-2008s-iron-man-10875021", "downloaded_at": "2019-10-07 12:20:48.840587+00:00", "title": "Avengers theory suggests Tony Stark knew Endgame's Snap would happen", "language": "en", "text": "Is this explaining how he was able to survive for as long as he did? (Picture: Rex Features)\n\nWhile Tony Stark was a very smart man, it seems he knew something big was coming the way of the Avengers way, way back.\n\nOne fan has unearthed a moment from an old Marvel Cinematic Universe (MCU) scene in which Iron Man – played by Robert Downey Jr – was talking about his Arc Reactor.\n\nWe’re talking way back in the first MCU movie, 2008’s Iron Man.\n\nIt seems this little (at the time what we thought was inconsequential) moment in the OG movie explains how Iron Man wasn’t immediately incapacitated by the Snap, after he wielded the Infinity Gauntlet at the end of Avengers: Endgame.\n\nSure he eventually succumbed to the power the Snap created, however being human it’s thought he should have fallen victim to its energy long before he did.\n\nAdvertisement\n\nAdvertisement\n\nGoing back over a decade, speaking to Shaun Toub’s Yinsen about the artificial heart in Iron Man, Stark was told the reactor could ‘run his heart for 50 lifetimes’.\n\nIt was here he said: ‘Or something really big for 15 minutes.’\n\nWhile the Arc reactor ended up living in the suit and was what powered Iron Man, did it help absorb the energy from The Snap? Or are we just getting carried away?\n\nWhat does this mean? (Picture: WolverineKuzuri93/reddit)\n\nReddit user u/WolverineKuzuri93 made the revelation over the weekend as they shared a screenshot of the moment Stark appeared to foresee his future – or at least the threat of Thanos, perhaps.\n\n‘It just dawned on me how Tony was able to not only wield the stones but also do so without immediately being incapacitated like the Hulk was. His Arc reactor took the bulk of the energy,’ the Redditor wrote.\n\nThey were challenged by the Avengers fans, who came up with their own theories as to how Stark kept kicking long enough for Pepper Potts (Gwyneth Paltrow) to say her goodbye.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nOne chimed in: ‘I think he lasted a bit longer because the nanoparticles kept on trying to repair the suit and took the main damage until the snap which was too much and eventually got to Tony’s frail human body.’\n\nAdvertisement\n\nAdvertisement\n\nThey might be on the money, but not dispelling this theory altogether – after the Russo Brothers, who directed Infinity War and Endgame, once confirmed Iron Man’s suit’s nanotech and that of the Infinity Gauntlet were one in the same.\n\nAnother fan was simply floored by how everything may tie in, despite the decade in between these two films.\n\n‘What’s really amazing about this is how relevant everything from the first marvel movies still is, and how it ties into endgame,’ a commenter wrote.\n\n‘Marvel did an amazing job at bringing everything back around. It’s part of what made these movies so great.’\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Please let Tony Stark rest in peace and don’t bring him back to the MCU\n\nMORE: Alesha Dixon brings daughter to work on America’s Got Talent after secretly giving birth seven weeks ago", "description": "Avengers theory suggests Tony Stark knew Endgame's Snap would happen in 2008's Iron Man.", "authors": ["Mel Evans"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_85670799_1570443642.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}