{"pub": "realclearpolitics", "url": "https://realclearenergy.org/articles/2019/09/12/american_energy_security_and_climate_change_110475.html", "downloaded_at": "2019-09-13 19:20:27.200265+00:00", "title": "American Energy Security and Climate Change", "language": "en", "text": "This week the House of Representatives is scheduled to vote on legislation that would permanently ban any future offshore oil and natural gas activity in the Eastern Gulf of Mexico and along the Outer Continental Shelf of the Atlantic and Pacific Oceans. If successful, these measures could strongly affect future oil and natural gas production at a time when technology and government cooperation have dramatically improved every aspect of the industry.\n\nThe Gulf of Mexico remains a prime resource for oil and gas, currently providing 16 percent of all domestic oil production. Local revenue sharing from these activities provides major economic benefits to neighboring states, particularly Louisiana. Permanently restricting activity in the Eastern Gulf will take both oil and revenues off the table, and will not deter future offshore development activities further to the south, by Mexico.\n\nBanning all future activities many miles offshore in the waters of the Atlantic and Pacific Oceans would preclude even the most careful exploration using sophisticated technology. It is difficult for most Americans to believe that ninety four percent of our offshore federal acreage is today off limits to oil and gas exploration and development. Yet our neighbors are already aggressively pursuing and benefitting from the Gulf.\n\nThese proposed restrictions are taking place at a time when offshore exploration and production is expanding around the globe. Nearly 30 percent of global crude oil output now comes from offshore production. Natural gas output from offshore has risen by 50 percent since the year 2000. China and Russia are exploring in the Arctic. Saudi Arabia and Norway remain highly active. Mexico is rapidly expanding its own activities in the Gulf, including a recent lease for exploration by China. Brazil has become a global leader in deepwater production.\n\nThese early votes in the House are about more than offshore exploration. They comprise the opening salvoes of the 2020 election process. From presidential candidates to those running for Congress, the national leadership of the Democratic Party has signaled that its top political issue in 2020 will be climate change, including proposals for a dramatic restructuring of America’s energy policies, practices and infrastructure.\n\nThe Democratic majority in the House and most of that Party’s presidential candidates are simply not interested in stopping future offshore oil exploration and extraction. Their clear objective is to eliminate all fossil fuels, as soon as possible. We are seeing proposals to spend trillions of dollars toward the elimination of all fossil fuels within the next decade, to be replaced through vaguely worded policies designed to bring about unbounded amounts of alternate energy that, frankly, do not yet exist.\n\nAs one example, candidate Kamala Harris recently released her “10 Trillion Dollar Climate Change Plan,” which at bottom would “require the world to reduce greenhouse gas emissions roughly 50 percent by 2030 and reach net zero global emissions by 2050.” Terming the United States “the largest single greenhouse gas emitter in history,” she offers “a bold target to exceed the Paris Agreement climate goals and achieve a clean economy by 2045, investing $10 trillion in public and private funding to meet the initial 10-year mobilization. By 2030 we will run on 100 percent carbon neutral electricity, all new buses, heavy duty vehicles, and vehicle fleets will be zero emission. All new buildings will be carbon-neutral.”\n\nLet’s talk about today. The issue of climate change is indeed global, and other countries must be encouraged to do their part. Here in the United States, CO2 emissions are at their lowest levels in a generation, thanks to the increased use of natural gas and cleaner fuels, evidence that energy and climate progress can coexist. A recent report by Air Visual indicated that 47 of the 50 most polluted cities in the world are in either India or China. Fortune Magazine notes that China is theworld’s largest producer of greenhouse gases, and by far the world’s heaviest user of coal. Politicians who want to bring about responsible global behaviors in such areas should be advertising the dramatic technological, safety and environmental improvements the U.S. has made. We are a role model for countries such as China to follow.\n\nIn the actual world of energy production the reality is that while an “all-of-the-above” energy approach – including renewables – is important, natural gas and oil are going to be essential for at least the next few decades. Oil and natural gas currently supply 67 percent of the energy used in our nation, with the U.S. Energy Information Administration is projecting consumption to grow over the next 30 years. The U.S. continues to import oil daily, as we are only utilizing a very small amount of our vast potential offshore energy resources.\n\nGovernment projections show that even under optimistic scenarios for renewables, natural gas and oil will supply about 60 percent of U.S. energy needs in 2040. And in a global marketplace, where economies are expanding, and living standards are increasing, the demand for gas and oil in developing countries is growing. Current projections are that global demand for oil consumption will grow by over 10% by 2040, and demand for natural gas will increase by over 40 percent. Natural gas is projected to increase by 43%.\n\nAs our country shifts toward clean energy, it is important that we do so in a manner that does not impact our economic and national security. We are now the world’s leading refiner and producer of oil and natural gas. This not only provides good jobs and strong growth in our communities but also guarantees that our economy is safer from foreign manipulation and our national security is less likely to be intimidated by potential adversaries.\n\nAmericans should think hard about whether such draconian restrictions are needed, and what our economic and national security costs might be if we fail to take advantage of energy resources that are under our own jurisdiction. We benefit every day from the strength of our energy sector, buttressing the health of our economy and national security in a world of frequent turmoil.\n\nAll Americans should be concerned with political leaders who are willing to take a known and valuable energy resource off the table when we can work cooperatively and safely to ensure our future energy needs are met and our national security is not at risk. Why should we tie our own hands behind our back?\n\nJim Webb is Former Secretary of the Navy and former Democratic Virginia Senator. Jim Nicholson is Former Secretary of Veterans Affairs and Former U.S. Ambassador to the Holy See. They are National Chairs of Explore Offshore.", "description": "This week the House of Representatives is scheduled to vote on legislation that would permanently ban any future offshore oil and natural gas activity in the Eastern Gulf of Mexico and along the...", "authors": [], "top_image": "https://assets.realclear.com/images/42/427988_5_.jpg", "published_at": "2019-09-12"}