{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/24/bill-oreilly-rips-abysmal-beto-orourke-i-have-no-r", "downloaded_at": "2019-09-25 04:41:11.565284+00:00", "title": "Bill O'Reilly rips 'abysmal' Beto O'Rourke: 'I have no respect for him at all'", "language": "en", "text": "Political commentator Bill O’Reilly declared in a new interview that Democratic presidential candidate Beto O’Rourke is an “irresponsible, shallow thinker” who doesn’t stand a chance in the 2020 election.\n\n“I think O’Rourke bought into the media hype about himself,” Mr. O’Reilly told The Washington Examiner in an interview published Tuesday. “They said he was going to be the next Kennedy. RFK would be embarrassed. RFK’s a smart guy. Beto O’Rourke is not.”\n\nMr. O’Reilly cited the many times that Mr. O’Rourke, a former Texas congressman, has branded President Trump a racist and claimed the United States was founded on white supremacy. After the August mass shooting in El Paso, Texas, Mr. O’Rourke claimed the shooter was inspired by the president’s white nationalist rhetoric.\n\nMr. O’Reilly said he has “no respect” for the way Mr. O’Rourke has conducted himself on the campaign trail.\n\nHe said, “Anybody that would support a man like Beto O’Rourke has got to look in the mirror and say, ‘Is that really what you want, somebody who would call somebody the most heinous names? Racist, misogynist, whatever it may be. Somebody who will accuse the president of the United States of inciting violence in El Paso.’ This is just irresponsible stuff. I have no respect for him at all. The way he’s conducted himself has been abysmal and he’s not going anywhere. He’s hurt himself. He will never be elected, in my opinion, to any [higher] office, ever.”\n\nIn contrast, Mr. O’Reilly said he liked Democratic presidential candidate Pete Buttigieg as the kind of measured politician the country needs right now.\n\n“I like him,” he said. “I think he’s sincere. He’s not a phony. I think that he’s got a future in Democratic politics. He’s in over his head now, but come on, he’s a small-town mayor. Articulate, well-meaning, so he’s the kind of politician that I think the country needs. I don’t agree with him on some things but I don’t agree with most politicians on some things. But I think he’s sincere and I think he has a future.”\n\nMr. O’Reilly, who was fired from Fox News in 2017 amid several sexual harassment allegations, is promoting his new book, “The United States of Trump: How the President Really Sees America,” which is already a No. 1 best-seller on Amazon.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Political commentator Bill O'Reilly declared in a new interview that Democratic presidential candidate Beto O'Rourke is an \"irresponsible, shallow thinker\" who doesn't stand a chance in the 2020 election.", "authors": ["The Washington Times Http", "Jessica Chasmar"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2018/04/23/books_bill_oreilly_79010_c0-254-2695-1825_s1770x1032.jpg?39d85e7a98de827186d220f852b96fc0b9926c97", "published_at": "2019-09-24"}