{"pub": "metro", "url": "https://metro.co.uk/2019/10/21/coronation-street-spoilers-gemma-winter-gives-birth-to-quads-while-trapped-in-a-cable-car-10842128", "downloaded_at": "2019-10-22 13:38:00.254378+00:00", "title": "Coronation Street spoilers: Gemma gives birth to quads while trapped in cable car", "language": "en", "text": "Gemma Winter (Dolly-Rose Campbell) was shocked to discover that she was not only pregnant, but that she’s pregnant with quadruplets in Coronation Street and, in the coming episodes, she finally gives birth — however, things don’t exactly go as she’d hoped, as she does so in a cable car!\n\nWith the death of Sinead (Katie McGlynn) weighing on his mind, Chesney (Sam Aston) decides that he and Gemma should make a proper go of things — something which he later relays to her. Soon after, he arranges for Fizz to babysit so that he can take Gemma out to Speed Dahl on a date but — when she experiences some twinges — said date is ultimately called off.\n\nAfterwards, Chesney tells his sister that he’s planning on proposing to Gemma.\n\nThe press begin to hound Chesney and Gemma as a result of Bernie’s (Jane Hazelgrove) magazine interview — in which she painted Chesney as a love rat for the purposes of a more compelling story — and Gemma’s frustrated. She informs Chesney that she wishes they could get away for the day.\n\nAdvertisement\n\nAdvertisement\n\nChesney suggests they go out for the day to Llandudno. Later, while in a cable car, Chesney seizes the moment and proposes. However, things don’t exactly go to plan, as Gemma goes into labour!\n\nChesney pulls the emergency brake, and thus the cable car swings in the breeze. Gemma grows concerned as Chesney calls the ambulance.\n\nWill Gemma give birth in the cable car?\n\nOr will she make it to hospital in time?\n\nOne to watch: Wednesday 28th October at 8:30pm on ITV.\n\nAdvertisement Advertisement", "description": "Things don't go according to plan for Gemma!", "authors": ["Stephen Patterson"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/30_10_coro_gemma_chesney_2nd_ep_01-77fa_1571051902.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-21"}