{"pub": "dailymail", "url": "https://dailymail.co.uk/money/bills/article-7565749/Elderly-people-urged-sign-new-scheme-secure-140-discount-energy-bills.html", "downloaded_at": "2019-10-13 03:58:34.089359+00:00", "title": "Elderly people urged to sign up to new scheme to secure £140 discount on energy bills", "language": "en", "text": "A vital scheme launches tomorrow that helps elderly people meet the cost of energy bills every winter, known as the Warm Home Discount.\n\nFor many, an automatic discount of £140 will be applied by energy suppliers to electricity bills anytime between now and March next year – but millions eligible for the rebate need to take action to secure it.\n\nPeter Earl, head of energy at comparison website comparethemarket, says: ‘The Warm Home Discount is a financial lifeline for elderly people who will struggle to afford to heat their homes this winter. But not all suppliers offer the discount.’\n\nWarm Home Discount: Millions are eligible for the rebate, but need to take action to secure it\n\nThe vast majority of energy companies are signed up to the scheme, but dozens of smaller suppliers are not – affecting around 100,000 customers. People in this category should switch suppliers to a cheaper deal with a company that offers the discount.\n\nThey need to apply to the new supplier to get it. A full list of those participating can be found online at gov.uk/the-warm-home-discount-scheme/energy-suppliers.\n\nAutomatic deductions from bills are awarded to a ‘core group’ of customers – those receiving the ‘guarantee credit’ element of Pension Credit. This benefit tops up income to a minimum level for people of State pension age.\n\nOthers fall into the ‘broader group’ and need to apply directly. For example, people on low incomes, in receipt of certain means-tested benefits such as income support or child tax credits, and who are looking after young children.\n\nDiscounts for this group may be limited so customers are advised to contact their suppliers at the earliest opportunity. If you are in the core group but do not receive a letter about the discount by December 6 call the helpline – which opens tomorrow – 0800 731 0214.", "description": "A vital scheme launches tomorrow that helps elderly people meet the cost of energy bills every winter, known as the Warm Home Discount.", "authors": ["Laura Shannon For The Mail On Sunday", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/15/19625252-0-image-a-117_1570890466883.jpg", "published_at": "2019-10-12"}