{"pub": "marketwatch", "url": "https://marketwatch.com/story/oil-pegged-currencies-pop-after-the-biggest-jump-for-crude-prices-in-a-decade-2019-09-16", "downloaded_at": "2019-09-16 23:12:30.211267+00:00", "title": "Oil-pegged currencies pop after the biggest jump for crude prices in a decade", "language": "en", "text": "Currencies linked to oil prices rose against the U.S. dollar on Monday after an attack on Saudi Arabian oil production facilities over the weekend temporarily knocked out 5% of the world’s production, with some analysts speculating that it could take months to bring the facilities back online.\n\nThe currencies of Canada and Norway — two of the world’s largest oil exporters — were both gaining solidly. The Canadian dollar USDCAD, -0.0151% has climbed 0.3% against the greenback, with a single dollar fetching C$1.3250, while the Norwegian krone USDNOK, -0.0223% added 0.4%, changing hands at 8.9547 krone per dollar.\n\nThe currency of another major oil producer Russia, also a member of the Organization of the Petroleum Exporting Countries’s OPEC+ group, was rising 0.8% against the buck. The U.S. dollar last bought 63.9170 rubles USDRUB, +0.0030% on Monday.\n\nMeanwhile, Mexico’s peso USDMXN, -0.0190% also was enjoying a 0.2% rise against the buck, with the dollar buying 19.4377 pesos Monday afternoon.\n\nThe so-called petrocurrencies are those where the country derives a sizable share of its domestic revenue from oil exporting and therefore tends to see price swings along with crude-oil values.\n\nOn Monday, West Texas Intermediate crude for October delivery CLV19, -1.46% the U.S. benchmark contract, was up 14.7%, or $8.05, to settle at $62.90 a barrel, marking the largest daily gain for the most-active contract since Jan. 16, 2009, when prices surged more than 20%, according to FactSet data.\n\nNovember Brent crude BRNX19, -1.45% jumped $8.64, or 14.4%, to trade at $68.88 a barrel, which would represent the sharpest daily rise for the international benchmark since Dec. 11, 2008.\n\nDespite the gains for oil-pegged currencies, the dollar, as measured by the ICE U.S. Dollar Index DXY, +0.39%, was up 0.4% at 98.65 against a basket of major currency rivals.\n\nPrice spikes in crude came on the back of a Saturday attack on Saudi Arabia’s Abqaiq plant and its Khurais oil field, which has thrown offline an estimated 5.7 million barrels of the kingdom’s crude-oil production a day, equivalent to more than 5% of the world’s daily supply.\n\nQuestions about the severity and duration of the disruption has rattled the energy markets, producing a lift to energy stocks and other assets pegged to crude prices and its byproducts.\n\n“This attack, which will no doubt raise headline inflation rates, makes steep cuts in US rates less likely. It may therefore boost the dollar,” wrote Marshall Gittler, an independent currency analyst, in a Monday research report, referring to the Federal Reserve’s Sept. 17-18 gathering, where is widely expected to cut benchmark domestic rates and signal its coming monetary policy plans.", "description": "Currencies linked to oil prices pop on Monday after an attack on Saudi Arabian oil production facilities over the weekend knocked out 5% of the world’s...", "authors": ["Mark Decambre"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GM429_cash_0_ZG_20180712133152.jpg", "published_at": "2019-09-16"}