{"pub": "independent", "url": "https://independent.co.uk/sport/live/england-vs-australia-live-stream-rugby-world-cup-2019-latest-score-updates-how-to-watch-online-tv-a9162516.html", "downloaded_at": "2019-10-19 11:11:17.094124+00:00", "title": "England reach Rugby World Cup 2019 semi-finals with 40-16 win over Australia", "language": "en", "text": "It was the day England’s Rugby World Cup finally started.\n\nThree straightforward victories over two tier two nations and a 14-man Argentina had impressed nobody and, after an agonising two-week wait for a match, there was a genuine risk they would be caught out by a crafty and cunning Australian team.\n\nThose worries were unfounded. Led by the inspirational Owen Farrell, who delivered his best performance of the tournament so far, England showed a clinical edge to equal their record victory over the Wallabies. This matched the 30-6 victory from November 2017 and was just the second time England have reached 40 points in this famous old rivalry.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThis time though, a long way from home and with the pressure on, Eddie Jones’s side delivered a statement that may just make New Zealand and Ireland take note.\n\nJonny May’s first-half double set the tone for England, with the boot of Farrell returning to its very best after the wobble against Argentina to give England a 17-6 lead at the break. But that advantage was instantly cut to a solitary point within four minutes of the restart, with Christian Lealiifano adding his third penalty of the afternoon and Marika Koroibete producing a stunning finish to ignite the contest.\n\nShape Created with Sketch. Ratings: England vs Australia Show all 31 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Ratings: England vs Australia 1/31 Ratings: England vs Australia Getty 2/31 Elliot Daly – 6 AFP via Getty Images 3/31 Anthony Watson – 6 Action Images via Reuters 4/31 Henry Slade – 7 AFP via Getty Images 5/31 Manu Tuilagi – 6 AFP via Getty Images 6/31 Jonny May – 8 AFP via Getty Images 7/31 Owen Farrell – 8 AFP via Getty Images 8/31 Ben Youngs – 7 AFP via Getty Images 9/31 Mako Vunipola – 7 AFP via Getty Images 10/31 Jamie George – 7 AP 11/31 Kyle Sinckler – 8 Getty Images 12/31 Maro Itoje – 7 Icon Sport via Getty Images 13/31 Courtney Lawes – 7 AP 14/31 Tom Curry – 8 EPA 15/31 Sam Underhill – 8 Getty Images, 16/31 Billy Vunipola – 7 REUTERS 17/31 Australia World Rugby via Getty Images 18/31 Kurtley Beale – 6 AP 19/31 Reece Hodge – 6 Getty Images 20/31 Jordan Petaia – 7 REUTERS 21/31 Samu Kerevi – 6 REUTERS 22/31 Marika Koroibete – 7 AFP via Getty Images 23/31 Christian Lealiifano – 5 AP 24/31 Will Genia – 6 Getty Images, 25/31 Scott Sio – 7 Getty Images, 26/31 Tolu Latu – 6 AP 27/31 Izack Rodda – 6 World Rugby via Getty Images 28/31 Rory Arnold – 7 AFP via Getty Images 29/31 David Pocock – 7 AFP via Getty Images 30/31 Michael Hooper – 6 Getty Images, 31/31 Isi Naisarani – 6 Getty Images 1/31 Ratings: England vs Australia Getty 2/31 Elliot Daly – 6 AFP via Getty Images 3/31 Anthony Watson – 6 Action Images via Reuters 4/31 Henry Slade – 7 AFP via Getty Images 5/31 Manu Tuilagi – 6 AFP via Getty Images 6/31 Jonny May – 8 AFP via Getty Images 7/31 Owen Farrell – 8 AFP via Getty Images 8/31 Ben Youngs – 7 AFP via Getty Images 9/31 Mako Vunipola – 7 AFP via Getty Images 10/31 Jamie George – 7 AP 11/31 Kyle Sinckler – 8 Getty Images 12/31 Maro Itoje – 7 Icon Sport via Getty Images 13/31 Courtney Lawes – 7 AP 14/31 Tom Curry – 8 EPA 15/31 Sam Underhill – 8 Getty Images, 16/31 Billy Vunipola – 7 REUTERS 17/31 Australia World Rugby via Getty Images 18/31 Kurtley Beale – 6 AP 19/31 Reece Hodge – 6 Getty Images 20/31 Jordan Petaia – 7 REUTERS 21/31 Samu Kerevi – 6 REUTERS 22/31 Marika Koroibete – 7 AFP via Getty Images 23/31 Christian Lealiifano – 5 AP 24/31 Will Genia – 6 Getty Images, 25/31 Scott Sio – 7 Getty Images, 26/31 Tolu Latu – 6 AP 27/31 Izack Rodda – 6 World Rugby via Getty Images 28/31 Rory Arnold – 7 AFP via Getty Images 29/31 David Pocock – 7 AFP via Getty Images 30/31 Michael Hooper – 6 Getty Images, 31/31 Isi Naisarani – 6 Getty Images\n\nBut as Kyle Sinckler celebrated hit maiden international try – created and delivered by Farrell – you sensed England had that winning feeling. They seized control of the match as Australia ran out of ideas, and by the time Anthony Watson picked off Kurtley Bele’s audacious 30m pass to run in the fourth try four minutes from time, the party had already started.\n\nEngland are off to Yokohama for a semi-final against the winners of the day’s second encounter. Jones’s job is safe and, with wind in their sails, it will take something special to stop them.\n\nOn Wednesday, May admitted that the feeling of reaching the half-century for England would not really sink in until he pulls himself away from the World Cup bubble and allows himself to think about it. And his workmanlike attitude was evident from the moment he led out the team, with the wing urging captain Farrell to follow quickly instead of letting him soak up the acclaim. He didn’t want this to be the Jonny May show.\n\nOnly it was, thanks to a devastating two tries in three minutes, a sucker punch to the body of the Wallabies who had dominated possession throughout the first quarter. Eddie Jones triggered many a raised eyebrow with his team selection this week, dropping arguably his most impressive performer so far in George Ford in order to beef up the defence and bringing in Henry Slade in an effort to fix their ‘clunky’ attack.\n\nIt proved a masterstroke.\n\nFarrell played like a man possessed, leading by example and combining with Slade and Elliot Daly to unlock the defence in sublime style. With the Wallabies three points to the good after Vunipola was penalised for going high on Koroibete following a beautiful counter attack from Beale, England clicked into gear.\n\nAustralia had dominated possession until the 17th, when Slade took the ball to the line and slipped a disguised pass out the back to Farrell. With Tuilagi the decoy, the ball slipped through the hands of Farrell, Daly and Watson in the blink of an eye, and the panic on the right wing created the space on the left. Farrell looped back round, released Tom Curry, and the flanker timed his pass perfectly to fix Reece Hodge and send May in for the first try.\n\nBarely four minutes later, May was celebrating again. David Pocock had been prominent in the opening exchanges, but his loose passed evaded Lealiifano and found the hands of Slade. The Devonian raced away, but knowing that Samu Kerevi was bearing down on him, he smartly kicked ahead for May to collect and score.\n\nWith Farrell and Lealiifano trading penalties before the half closed out, England were eight points to the good at the break, yet you sensed they weren’t safe.\n\nThe Wallabies proved why immediately. Nineteen-year-old Jordan Peteaia made a good start to the game beating Curry within the opening minutes, and again he proved the dangerman as he drifted to avoid a rushing Slade to break free. The centre fed Koroibete, whose change of speed did for England full-back Daly to cut the gap.\n\nAt a one-point game, the contest could have gone either way, but England managed to roll with the punches and hit back immediately. Farrell again turned provider, with his lethal flat pass missing out two teammates to find a charging Sinckler, and the prop had enough gas to hold off Beale and score his first try for England. His celebration said it all, England had their tails up.\n\nEntering the final quarter the Australian attack grew more and more desperate as Farrell kicked two further penalties, and the final roll of the dice came when Beale’s gamble failed to pay off, with Watson plucking the ball from the grasp of Michael Hooper and seal England’s progression to the semi-finals.", "description": "It was the day England’s Rugby World Cup finally started. Three straightforward victories over two tier two nations and a 14-man Argentina had impressed nobody and, after an agonising two-week wait for a match, there was a genuine risk they would be caught out by a crafty and cunning Australian team.", "authors": ["Jack De Menezes"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/19/10/england-win.jpg", "published_at": "2019-10-19"}