{"pub": "news24", "url": "https://wheels24.co.za/NewModels/tokyomotorshow-mazda-launches-its-updated-cx-8-suv-in-japan-20191023", "downloaded_at": "2019-10-23 15:15:51.910126+00:00", "title": "#TokyoMotorShow | Mazda launches its updated CX-8 SUV in Japan", "language": "en", "text": "Mazda officially launched the updated version of its Mazda CX-8 crossover SUV in Japan to go on sale next month.\n\nThe crossover SUV, that first made its debut in 2017, comfortably accommodates six or seven adults while boasting high-quality design, responsive driving performance and comfortable ride.\n\n\n\nUpdated features\n\n\n\nSpace is undoubtedly its best feature on the inside with a third row of seats able to accommodate passengers with ease while they can make also use of additional USB ports. In addition, boot space can house as much as four carry-on bags with the third row of seats in use. A power sunroof is an optional extra to the buyer.\n\nWATCH | The SA-bound Mazda CX-30 speaks the 'Kodo' language\n\n\n\nAs part of its range, there is a new special edition model known as Exclusive mode, offering power sliding and reclining and seat ventilation in second row seats for the first time in a Mazda. Furthermore, the second row of seats also have an armrest-equipped console.\n\nConvenience is done at the touch of a button with an 8-inch WVGA centre display while all passengers can enjoy the ride with black leather heated seats available in the XD Proactive S Package.\n\nImage: Mazda Japan\n\nCustomers also have the choice of choosing between front-wheel and all-wheel-drive configurations for all three of its engine options. All AWD models come with Off-Road Traction Assist.\n\nPricing starts from an estimated R398 727 (¥2.9-million) with a host of colour options also available at an additional cost.\n\nCompiled by: Robin Classen\n\n", "description": "Mazda officially launched the updated version of its Mazda CX-8 crossover SUV in Japan to go on sale next month in its home country.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9505/a760d58877d34949bb3afb052a221c28.jpg", "published_at": "2019-10-23"}