{"pub": "businessinsider", "url": "https://businessinsider.co.za/fnb-affordable-housing-insight-residential-properties-south-africa-r250000-to-r500000-properties-2019-10", "downloaded_at": "2019-10-29 15:11:14.347834+00:00", "title": "‘Cheaper’ homes in South Africa are hot right now – in some cases even selling for above the asking price", "language": "en", "text": "Properties priced between R250,000 and R500,000 are experiencing a strong third quarter, a new report by FNB showed.\n\nDue to increased demand, 5% of properties in that bracket is sold above asking price.\n\nFNB said there is a lack of supply in that bracket which leads to strong house price growth.\n\nGo to www.BusinessInsider.co.za for more stories.\n\nSouth African residential properties priced between R250,000 and R500,000 are experiencing a strong third quarter, with some properties sold at 5% above asking price, a new report from FNB revealed.\n\nThe FNB Affordable Housing Insight for the third quarter of 2019, released on Tuesday, showed a third of properties in the R250,000 to R500,000 price range sold below initial asking price.\n\nThe average discount offered for the R250,000 to R500,000 market, also known as the gap market, was 12.7%.\n\nIn contrast, over 95% of properties in the higher end of the market sell below-asking price, at approximately 10% discount, the report said.\n\nOn average, properties in the R250,000 to R500,000 bracket remained on the market roughly 6 weeks, with 13 average viewings.\n\nIn the higher-end market, properties spend 16 weeks on the market with 9.6 average viewers.\n\nThe report showed that in South Africa 35% of transactions are typically for buy-to-let, compared to 50% of transactions in the R250,000 to R500,000 bracket.\n\nFNB Home Finance CEO Lee Mhlongo said there is an inadequate supply of lower-end residential properties which contributes to strong house price growth.\n\n“Prospective home buyers are looking and finding value in affordable housing. We believe that a better pipeline of supply, especially within the gap market, will go a long way to improving home ownership in our country,” Mhlongo said.\n\nMhlongo said emigration and relocation-related sales remain low in affordable housing bracket but is more prominent in higher price segments.\n\nThe FNB Affordable Housing Insight was compiled through surveys with the country’s top real estate agencies in Gauteng, Western Cape, Eastern Cape and KwaZulu-Natal.", "description": "FNB said there is a lack of supply in the 'cheaper' market which leads to strong house price growth.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9350/d1c5e7f1bd1c4b0f93466301065d3406.png", "published_at": "2019-10-29"}