{"pub": "reuters", "url": "https://reuters.com/article/us-autos-emissions-trump-antitrust/house-democrats-ask-if-trump-interfered-in-doj-automaker-antitrust-probe-idUSKBN1W42WE", "downloaded_at": "2019-09-19 23:18:35.173731+00:00", "title": "House Democrats ask if Trump interfered in DOJ automaker antitrust probe", "language": "en", "text": "WASHINGTON (Reuters) - Two U.S. Democratic lawmakers on Thursday asked the White House to turn over documents that would show if President Donald Trump interfered or directed a Justice Department antitrust probe of four automakers that struck voluntary agreements with California to reduce tailpipe emissions, according to a letter seen by Reuters.\n\nU.S. President Donald Trump descends from Air Force One at Joint Base Andrews, Maryland, U.S. September 19, 2019. REUTERS/Tom Brenner\n\nJerrold Nadler, chairman of the House of Representatives Judiciary Committee, and Representative David Cicilline, head of the antitrust subcommittee, asked White House counsel Patrick Cipollone and Makan Delrahim, assistant attorney General for the Justice Department’s Antitrust Division, to turn over any documents or communications between Trump, White House staff or Justice Department officials related to the probe into Ford Motor Co (F.N), Honda Motor Co (7267.T), BMW AG (BMWG.DE) and Volkswagen AG (VOWG_p.DE) by Oct. 2.\n\n“Actual interference would of course constitute a serious abuse of power,” the two lawmakers wrote, saying the probe appears to be “another example of the administration’s weaponization of the antitrust laws to target perceived political adversaries of the president.”\n\nDelrahim confirmed he sent Aug. 28 letters to the four automakers asking questions in testimony before a Senate panel this week, but said he was not conducting the investigation for “political reasons.”\n\nThe Justice Department and White House did not immediately comment.\n\nAlso Thursday, four Senate Democrats wrote to U.S. Attorney General William Barr seeking documents that would show if Trump was involved in the probe and asked if Delrahim was instructed to open the probe.\n\nOn Wednesday three other Senate Democrats said in a letter to Barr they opposed the probe.\n\nReuters and other outlets reported earlier the existence of the investigation as the Trump administration had ramped up its opposition to automakers seeking to sidestep it on rolling back Obama-era fuel-efficiency rules. Trump has repeatedly expressed anger with automakers for working with California, which has vowed to enforce the stricter Obama-era emissions standards.\n\n“Automakers should seize this opportunity because without this alternative to California, you will be out of business,” Trump tweeted Wednesday.\n\nOn Thursday, the Environmental Protection Agency said it was revoking California’s waiver under the Clean Air Act to set tailpipe emissions standards, citing the voluntary agreement as one reason for the need to take the unprecedented decision.\n\nDelrahim’s letters to the automakers said the government was worried the agreements “may violate federal antitrust laws” but adding it had “reached no conclusions,” according to documents seen by Reuters.", "description": "Two U.S. Democratic lawmakers on Thursday asked the White House to turn over documents that would show if President Donald Trump interfered or directed a Justice Department antitrust probe of four automakers that struck voluntary agreements with California to reduce tailpipe emissions, according to a letter seen by Reuters.", "authors": ["David Shepardson", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190919&t=2&i=1431753739&w=1200&r=LYNXMPEF8I1YP", "published_at": "2019-09-19"}