{"pub": "yahoo", "url": "https://news.yahoo.com/latest-turkey-claims-knew-us-124219927.html", "downloaded_at": "2019-10-27 13:02:53.184215+00:00", "title": "The Latest: Turkey claims it knew about US raid on IS leader", "language": "en", "text": "FILE - In this Feb. 22, 2019 file photo, U.S.-backed Syrian Democratic Forces (SDF) fighters stand guard next to men waiting to be screened after being evacuated out of the last territory held by Islamic State group militants, near Baghouz, eastern Syria. The IS erupted from the chaos of Syria and Iraq's conflicts and swiftly did what no Islamic militant group had done before, conquering a giant stretch of territory and declaring itself a \"caliphate.\" U.S. officials said late Saturday, Oct. 26, 2019 that their shadowy leader Abu Bakr al-Baghdadi was the target of an American raid in Syria and may have died in an explosion. (AP Photo/Felipe Dana, File)\n\nBEIRUT (AP) — The Latest on the alleged death of Islamic State group leader Abu Bakr al-Baghdadi in a U.S.-led operation in northern Syria (all times local):\n\n3:40 p.m.\n\nA senior Turkish official says \"to the best of my knowledge\" Abu Bakr al-Baghdadi arrived at a location in Syria 48 hours prior to the U.S. military raid that is believed to have targeted the Islamic State group leader.\n\nThe Turkish official said in a written statement Sunday that there has been \"close coordination\" among relevant parties and the Turkish military had advanced knowledge of the raid.\n\nIn a tweet earlier, the Turkish army said it had \"information exchanged and coordination\" with U.S. military authorities prior to the operation but did not elaborate.\n\nThe official added: \"I can neither confirm nor deny that any intelligence was shared to facilitate last night's operation.\"\n\nThe U.S. raid with helicopters took place in the Barisha area north of Idlib city a few kilometers from the Turkish border.\n\n— By Zeynep Bilginsoy\n\n___\n\n7:45 a.m.\n\nThe leader of the Islamic State militant network is believed dead after being targeted by a U.S. military raid in Syria.\n\nA U.S. official told The Associated Press late Saturday that Abu Bakr al-Baghdadi was targeted in Syria's Idlib province. The official said confirmation that the IS chief was killed in an explosion is pending.\n\nPresident Donald Trump teased a major announcement, tweeting Saturday night that \"Something very big has just happened!\"\n\nA White House spokesman, Hogan Gidley, would say only that the president would be making a \"major statement\" at 9 a.m. EDT Sunday.", "description": "A senior Turkish official says \"to the best of my knowledge\" Abu Bakr al-Baghdadi arrived at a location in Syria 48 hours prior to the U.S. military raid that is believed to have targeted the Islamic State group leader.  The Turkish official said in a written statement Sunday that there has", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/7SVVQ7GeG6SG4UNeZ7_oMg--~B/aD0zMzMzO3c9NTAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/59995d6f42a84b13d2fffc473014a9e2", "published_at": "2019-10-27"}