{"pub": "hotair", "url": "https://hotair.com/archives/john-s-2/2019/10/16/obama-endorses-justin-trudeau-twitter", "downloaded_at": "2019-10-16 23:12:49.082806+00:00", "title": "Obama endorses Justin Trudeau despite his history of blackface", "language": "en", "text": "If you’re a white, progressive Prime Minister whose blackface scandal is uncovered weeks before a national election, you probably expect it’s going to cost you in a big way. But as we saw in the case of Virginia Gov. Ralph Northam, different rules apply to progressives. Former President Obama made that clear today by endorsing Trudeau for another term:\n\nI was proud to work with Justin Trudeau as President. He's a hard-working, effective leader who takes on big issues like climate change. The world needs his progressive leadership now, and I hope our neighbors to the north support him for another term. — Barack Obama (@BarackObama) October 16, 2019\n\nReally, if you’re Justin Trudeau, having America’s only black president offer an endorsement is like being offered racial absolution. But let’s be honest about it. The real value of this endorsement isn’t whatever progressive bona fides Obama is praising. I mean, it’s a tweet. It’s not about details. The whole point here is that the world’s most famous black politician is telling us to overlook Justin’s unmentioned problem. Obama gave Justin a hall pass.\n\nAs good as Justin must feel today, this has to be causing Joe Biden to flinch a bit. Biden is struggling to raise money and last night’s debate showed that the other candidates now see Elizabeth Warren as the leader of the pack. So where is the Obama endorsement for Uncle Joe? Biden claimed months ago that he had asked Obama not to endorse him but I bet he’d welcome a surprise endorsement now. It’s true that Biden has made some odd and awkward statements but at least he hasn’t worn blackface.\n\nThe other person that came to mind when I saw this endorsement was Harvey Weinstein. Weinstein was famously an outspoken progressive and friendly with Bill and Hillary Clinton among many others on the left. After the New Yorker published the story that resulted in his downfall, the Clinton’s and the Obamas were initially silent. It took several days for the Democratic bigwigs to react and decide what to do about all the money he had given them. Meanwhile, Weinstein’s own statement about the allegations was heavy on promises to do more for the cause:\n\nI want a second chance in the community, but I know I’ve got work to do to earn it. I have goals that are now priorities. Trust me, this isn’t an overnight process. I’ve been trying to do this for 10 years, and this is a wake-up call. I cannot be more remorseful about the people I hurt, and I plan to do right by all of them. I am going to need a place to channel that anger, so I’ve decided that I’m going to give the NRA my full attention. I hope Wayne LaPierre will enjoy his retirement party. I’m going to do it at the same I had my Bar Mitzvah. I’m making a movie about our President, perhaps we can make it a joint retirement party. One year ago, I began organizing a $5 million foundation to give scholarships to women directors at USC. While this might seem coincidental, it has been in the works for a year. It will be named after my mom, and I won’t disappoint her.\n\n‘I’ll take down the NRA and the President!’ said the accused rapist. Here’s what I wrote about this two years ago:\n\nThis guy’s one and only redeeming quality may be the sheer contempt in which he holds the left’s intelligence and willingness to be bought off. He’s essentially offering them the same hush-money settlement he allegedly offered his victims if they’ll just keep their mouths shut, look the other way, and let him go on doing what he does. The difference this time is that instead of paying it to them personally, he’ll pay it to their pet causes. You want a million bucks for gun-control groups in return for pretending like he’s not inviting starlets to his hotel room and “asking” them if they want to watch him shower? Done. Two million? Done, done. Name your price. Everyone has one. Oh, and don’t forget, this is all a right-wing conspiracy, you partisan progressive zombies.\n\nIf you were wondering why Weinstein thought he could get away with his behavior because of his politics, this endorsement is a microcosm of why. Of course, blackface and rape aren’t remotely the same thing, not by a longshot. Weinstein is a genuine monster and doesn’t deserve a pass. But then so is Bill Clinton and so was Ted Kennedy depending on what you believe they did. Clinton got a pass on alleged (but I believe Juanita) rape and Kennedy on something akin to murder but both were lionized and defended by the left. Weinstein thought he could get the same deal. He was wrong and maybe that shows things have changed a bit with regard to sexual abuse. But more generally, people on the left still expect to get a pass on behavior that would prove fatal for anyone else. Obama’s endorsement of Trudeau is proof they still do.\n\nImagine if President Trump had been caught wearing blackface. There would be an army of journalists demanding that Republicans denounce him. I don’t expect any of those same reporters will be complaining about Obama giving a foreign leader a hall pass days before an election. It’s always different when Democrats do it.", "description": "Hall pass.", "authors": ["John Sexton", "Jazz Shaw", "Ed Morrissey", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/10/Trudeau-Obama.jpg", "published_at": "2019-10-16"}