{"pub": "yahoo", "url": "https://sports.yahoo.com/ad-dwight-lead-lakers-rally-beat-hornets-120-041150607--nba.html", "downloaded_at": "2019-10-28 13:35:13.449278+00:00", "title": "AD, Dwight lead Lakers' rally to beat Hornets 120-101", "language": "en", "text": "LOS ANGELES (AP) -- Anthony Davis had 29 points and 14 rebounds, and Dwight Howard added 16 points, 10 boards and four blocked shots in the Los Angeles Lakers' 120-101 victory over the Charlotte Hornets on Sunday night.\n\nLeBron James had 20 points, 12 assists and six rebounds for the Lakers, who took control of their second straight victory with an 18-2 rally starting late in the third quarter.\n\nDavis showed off his world-class skill to his new home fans in the first half, scoring 25 points. James and Howard took charge after the break, with James orchestrating the offense and Howard putting in an impressive all-around performance that drew multiple ovations.\n\nScroll to continue with content Ad\n\nHoward got wild cheers from the same fan base that booed him relentlessly for the past six years after he left the Lakers in free agency. Now back with LA as a reserve center, Howard has already slid back into fans' good graces with his energy, defense and overall effort in the team's first two home games.\n\nJames was mostly a facilitator until the fourth quarter, when he scored his 10th point on a layup with 9:57 left. James hasn't been held under 10 points in a regular-season game since Jan. 5, 2007, although it also happened twice in the playoffs in the nearly 13 years since.\n\nMiles Bridges scored 23 points, while Cody Zeller and Terry Rozier added 19 apiece for the Hornets in the opener of a four-game road trip.\n\nDavis was dominant from the start, racking up 16 points on 6-of-8 shooting in the first quarter while getting around anyone who tried to guard him. But James had a rare scoreless first quarter, and Danny Green went 0 for 7 in the first half.\n\nDavis hit three 3-pointers and grabbed six rebounds in his huge first half.\n\nStory continues\n\nHe even persevered after Zeller and Davis accidentally elbowed each other in the face while fighting for a rebound with 2:10 to play. Zeller got a loose ball foul after a long video review, but he was in the Hornets' locker room getting help for a cut.\n\nJames didn't score his first points until he hit two free throws 1:40 before halftime, and he got his first field goal with a layup on LA's next possession.\n\nTIP-INS\n\nHornets: Devonte Graham converted a four-point play in the second quarter. He finished with nine points after scoring 23 and 24 in the Hornets' first two games. ... Nicolas Batum missed his second straight game with a broken finger on his left hand. The big man got hurt in Charlotte's season opener.\n\nLakers: Kentavious Caldwell-Pope finished with 10 points after he ended his 0-for-11 start to the season from the field with three straight baskets in the second quarter. ... The backup point guards both played well. Quinn Cook had 12 points and eight assists, and Alex Caruso added five points and two assists.\n\nUP NEXT\n\nHornets: Stay in town to face the Los Angeles Clippers on Monday night.\n\nLakers: Host the Memphis Grizzlies on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports", "description": "Anthony Davis had 29 points and 14 rebounds, and Dwight Howard added 16 points, 10 boards and four blocked shots in the Los Angeles Lakers' 120-101 victory over the Charlotte Hornets on Sunday night.  LeBron James had 20 points, 12 assists and six rebounds for the Lakers, who took control of their", "authors": ["Greg Beacham", "Ap Sports Writer"], "top_image": "https://s.yimg.com/ny/api/res/1.2/v7GswfKhOpEKkYcq_ZE8TA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/G9italHWXbTDa7hAuq8Ojw--~B/aD0zMjIzO3c9NDgzNTtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/Sports/ap/201910122155789406868", "published_at": "2019-10-28"}