{"pub": "news24", "url": "https://wheels24.co.za/News/Guides_and_Lists/body-types-matter-heres-how-buyers-choose-their-new-cars-20190926", "downloaded_at": "2019-10-05 11:44:32.867817+00:00", "title": "Body types matter: Here’s how buyers choose their new cars", "language": "en", "text": "Consumers shop and compare cars in many ways. In this instance, consumers shopped based on the cars' shape. This functionality is especially useful when a model of a car comes in multiple shapes i.e. Audi A3 hatchback vs. Audi A3 sedan.\n\nThe data revealed that 4 million searches occurred for SUV's when make and/or model were not selected on AutoTrader SA. However, when make and model was selected, consumers filtered for body type less frequently. We selected the top 6 most populated body types as being representative of 33% of all body types available on our platform.\n\nOf all body type searches, single and double cab bakkies generated the highest search volume.\n\n\n\nSEE | 'Everyone wants a GTI!' - Here are the top 10 most searched for vehicle derivatives in SA\n\n\n\nVolkswagen dominated with 3 out of 5 cars in the hatchback category, and at least one car represented in the top 6 body type search categories, except for the coupé category.\n\nThe Kia Rio was the third most searched for hatchback but did not generate enough volume to make the top 10 most searched for Brands in South Africa. Despite the BMW X5 not being on the top 5 SUV list, data has revealed that consumer attention seems to be shifting to the X5 over the last 4 months.\n\n\n\nSide note: BMW X5 appears 10th on the most searched for Models.\n\n\n\n\n\nThe Toyota Fortuner is the mos-searched for vehicle under SUV body types. Image: Motorpress\n\n\n\n\n\nHere's a list of the 5 most-searched for vehicles under the following body types", "description": "Consumers shop and compare cars in many ways. In this instance, consumers shopped based on the cars' shape. This functionality is especially useful when a model of a car comes in multiple shapes i.e.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8779/4c522a5fbe5943bbb444f24eb9588913.jpg", "published_at": "2019-09-26"}