{"pub": "npr", "url": "https://npr.org/2019/10/02/762275448/the-afghan-government-must-lead-peace-talks-its-national-security-adviser-says", "downloaded_at": "2019-10-02 12:46:34.672765+00:00", "published_at": "2019-10-02", "title": "The Afghan Government Must Lead Peace Talks, Its National Security Adviser Says", "language": "en", "text": "The Afghan Government Must Lead Peace Talks, Its National Security Adviser Says\n\nEnlarge this image toggle caption Don Emmert/AFP/Getty Images Don Emmert/AFP/Getty Images\n\nAny peace in Afghanistan must be negotiated for Afghans by their elected leaders, the country's national security adviser, Hamdullah Mohib, says.\n\n\"We have objected to being part of the negotiations and not being a central part of this discussion,\" Mohib, 36, tells NPR's Rachel Martin from New York City, where he addressed the United Nations General Assembly on Monday.\n\n\"And if we want to see peace in Afghanistan, the Afghan government must be at the forefront of any negotiations,\" he added.\n\nMohib is back in the U.S. a little over six months after the Trump administration said it was ending contact with him after he criticized its approach to Afghanistan peace talks.\n\nAfghan President Ashraf Ghani, who ran in the country's election over the weekend, did not attend this year's General Assembly. Despite hundreds of attacks by Taliban insurgents during the months before, national elections went ahead on Saturday, though voter turnout was low and there have been allegations of fraud and other irregularities. On Monday, however, both Ghani and his challenger, Abdullah Abdullah, claimed they were ahead as the vote count continues.\n\nIt is not clear how much sway the Taliban will hold or what possible role they will have in a new government.\n\nIn March, Mohib — who also served as Afghanistan's ambassador to the U.S. from 2015 to 2018 — accused the U.S. envoy to Afghanistan, Zalmay Khalilzad, of \"delegitimizing\" Ghani's government by excluding it from peace talks with the Taliban. Soon after, the U.S. told Ghani that Washington would end communications with Mohib.\n\nU.S. negotiations with the Taliban, the closest the White House has come to ending a nearly 18-year troop presence in Afghanistan, collapsed in September when President Trump abruptly declared the talks \"dead.\" An agreement was expected to include an initial withdrawal of more than a third of the 14,000 U.S. troops in Afghanistan in exchange for a Taliban promise to not let the country become a base for global terrorist attacks.\n\nThe Taliban have said \"doors are open\" to resume talks with the United States. They have continued to mount frequent, large-scale attacks on Afghan civilians but also lifted bans on activities by the International Committee of the Red Cross and the World Health Organization.\n\nInterview Highlights\n\nOn Trump calling off talks with the Taliban\n\nIt was a good decision. The Taliban were becoming considerably more arrogant than they previously were. They were preparing their victory speeches and thought that they were going to take over Afghanistan. So I think it was a blessing. Now is an opportunity for us to take this issue and follow the lead of the Afghan government, a partner that the United States has worked with and invested in, a country where we have made a tremendous amount of sacrifices together to build the democratic institutions that we currently have.\n\nOn the Taliban in 2019\n\nThe Taliban are a discredited organization now, heavily divided over power sharing and among themselves. Others are engaged in the illegal mining and logging in our country. Some are fighting because other countries are paying them to do so.\n\nTheir narrative is no longer valid in Afghanistan. They said that they were fighting a foreign invader. That is not the case. They are fighting the Afghan people now.\n\nOn division within the Kabul government\n\nDemocracy is not perfect anywhere in the world, and Afghanistan is no exception. I think the American people would sympathize with that, but our competition or disagreements are on ballots, not on bullets. I think the difference here is the Taliban are killing the Afghan people. The disagreements between the Afghan politicians is a political discourse that is on Afghan TVs and in media. They are not fighting each other literally.\n\nArezou Rezvani edited the broadcast version of this interview.", "description": "After U.S.-Taliban talks excluded Afghanistan's government and collapsed last month, the senior official tells NPR that the only way to lasting peace is to include the country's leaders.", "authors": ["Rachel Martin", "Ashley Westerman"], "top_image": "https://media.npr.org/assets/img/2019/10/01/gettyimages-1172544867_wide-6ddd14c4f9ff397cdb164d70e37f65e65099c4cf.jpg?s=1400"}