{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7596055/TOWIEs-Olivia-Attwood-joins-Chloe-Brockett-Courtney-Green-shoot-Halloween-special.html", "downloaded_at": "2019-10-21 11:31:08.192723+00:00", "title": "TOWIE's Olivia Attwood joins Chloe Brockett and Courtney Green to shoot Halloween special", "language": "en", "text": "Advertisement\n\nShe shot to fame as a contestant on ITV2's hit reality show Love Island back in 2017, as she searched for romance while donning a range of skimpy swimwear.\n\nAnd Olivia Attwood went back to the look that made her famous - with a twist - on Monday, when she stepped out in head-turning style to shoot scenes for TOWIE's upcoming Halloween special.\n\nJoined by her co-stars Chloe Brockett and Courtney Green, the reality TV beauty looked both sultry and scary as she emerged wearing a deeply plunging black leotard, while her body was covered in fake blood.\n\nFright night: (L-R) Olivia Attwood, Chloe Brockett and Courtney Green shot scenes for TOWIE's Halloween special on Monday\n\nHer barely-there ensemble of choice featured sheer panels and was teamed with a pair of fishnet stockings and racy thigh-high black suede boots.\n\nSporting mounds of flaxen crimped extensions, the TV personality added to her look a with feline-eared hair band, while bandages soaked in fake blood were tied around her leg and arm.\n\nIn between shooting scenes for the special, which kicked off before sunrise, Olivia was seen getting into character, as she struck a series of playful poses for photographers.\n\nSheer delight: Her barely-there ensemble of choice featured sheer panels and was teamed with a pair of fishnet stockings and racy thigh-high black suede boots\n\nFeline fine: She sported a with feline-eared hair band, while bandages soaked in fake blood were tied around her leg and arm\n\nGetting into character: In between shooting scenes for the special, which kicked off before sunrise, Olivia was seen getting into character, as she struck a series of playful poses for photographers\n\nUpbeat: Erstwhile Love Island star Olivia appeared to be in a decidedly upbeat mood as she joined her co-star Joey Turner\n\nTress-ed to impress: She boosted the volume and length of her golden locks with mounds of crimped flaxen extensions\n\nMeanwhile, Chloe Brockett was hard to miss in her red fishtail sleeveless embellished gown, which featured a sweetheart neckline.\n\nSporting a red wig with deep bold waves, she was also seen with stage blood smeared across her body, with the addition of playing card embedded into her chest.\n\nWith an occult symbol on her chest, Courtney Green sported a black velvet corset and matching bolero jacket, while she mixed textures with satin shorts.\n\nStanding tall in a pair of black patent knee-high boots, she wore her chestnut brown locks in long extensions with her face was given a streaky and bloody makeover.\n\nLady in red: Chloe was hard to miss in her red fishtail sleeveless embellished dress, which featured a sweetheart neckline\n\nPlay your cards right: Chloe added to her eye-catching look with the addition of playing card embedded into her chest\n\nContrasting outfits: Chloe Sims was a true head-turner both on arrival and once her working day got underway, thanks to two contrasting outfits\n\n.\n\nChloe Sims was a true head-turner both on arrival and once her working day got underway, thanks to two contrasting outfits.\n\nShe arrived in black satin off-shoulder dress, which featured a a thigh-high split and was cinched at the waist with a thick patent band.\n\nLengthening her shapely legs with a pair of clear strappy heels, she wore her honey brown tresses in wet look curls, which fell beyond her shoulders.\n\nBy the time she went in for hair and makeup, the star wowed as she emerged in a black catsuit with a matching cropped leather jacket and thigh-high heeled boots.\n\nGoing for a completely different look, she wore a wig styled into a platinum blonde bob, while purple face makeup, bold red lipstick, light contacts and heavy mascara made her almost unrecognisable.\n\nCourtney Green underwent a routine smear test on Sunday evening's edition of The Only Way Is Essex - and was hailed 'a hero' by fans for raising awareness.\n\nThe reality starlet, 24, was seen telling her friend Dan Edgar that she had to skip the plans they had made together for the following day as she had her cervical screening booked.\n\nShe was then seen attending the appointment, allowing the crew to film inside the consultation room, recording what was involved.\n\nCourtney was seen lying back as the nurses walked her through it, explaining how smear tests work and what they're for - to test cells for signs of cancer.\n\nCourtney underwent the procedure, which many believe to be painful and therefore off-putting.\n\nBut Chloe said, afterwards: 'It's really not that bad!'\n\nShe did, however, declare that she was going to wine and ice cream after.\n\nOne viewer tweeted: '@courtneyMgreen what a hero having her smear done on TV! Raising awareness and encouraging young women to attend their appointments is so important. Huge amount of respect for you!'\n\nAnother posted: '@courtneyMgreen @OnlyWayIsEssex Well done on flagging the importance of having smear tests and how there is nothing to be afraid of!'\n\nFollowed by: 'So much appreciation for #towie raising awareness about smear tests. It’s honestly so important & girls often mistake that it’s painful. It’s not. It’s over within seconds. There is honestly nothing for these scared women to panic about. The nurses make you feel so at ease too.'\n\nAnother posted: 'This is actually incredible. Well done @courtneyMgreen for showing how quick and easy it is. Girls, please go for your smear!!'\n\nChloe herself posted about the matter, taking to her own Twitter to write: 'To all women please book in your cervical screening it’s so important and it’s really not scary at all it can prevent cervical cancer I can’t stress enough how important and it really isn’t bad!!'\n\nShe posted a similar message to Instagram, along with a snap of the TOWIE scene, in which she looked more than happy to undergo the procedure.\n\nOther female stars have used their platform to promote having the routine check - with Michelle Keegan doing so last year.\n\nShe shared a picture of herself during the test as she urged women not to put off going for the potentially life saving check-up.\n\nThe 31-year-old actress also posted a series of Instagram videos as she admitted she was guilty of putting off the procedure herself, but wanted to show people just how quick and simple the check is.\n\nSmear tests help to prevent cervical cancer by checking the health of the entrance of the womb and detecting any abnormal cells, yet the screening rates are currently the lowest they have been for two decades as women are not attending the check ups.\n\nAddressing her 3.7 million followers in an Instagram Story, the former Coronation Street star said: 'Today I'm on the way to the doctors for a smear that I've been putting off for a quite long time now.\n\n'I think the thought of going for a smear for women puts them off more than anything. 1 in 4 women now don't turn up for their appointments apparently, so I'm going to do a video blog today to show you how simple a smear test actually is.'\n\nThe soap starlet then filmed herself filling out a quick medical form in the doctor's waiting room, before sharing a snap on the medical bed captioned: 'Here we go'.\n\nAfter the procedure, Michelle shared another video on her way home, revealing: 'Smear's been done. I was in the room five minutes, on the bed for two. It was really quick, really easy. It wasn't painful at all, just a little bit uncomfortable.\n\n'Around three and a half thousand women are diagnosed with cervical cancer every year and I know it can be daunting going for a smear but these doctors and nurses do it every single day.\n\n'So ladies, I'm urging you to book in for your smear. Go and get it done and tell all your family and friends to do the same. because it is so important and it's so easy.'", "description": "She shot to fame as a contestant on ITV2's hit reality show Love Island back in 2017, as she searched for romance while donning a range of skimpy swimwear.", "authors": ["Ryan Smith For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/11/19987114-0-image-a-157_1571655431319.jpg", "published_at": "2019-10-21"}