{"pub": "cbs", "url": "https://cbsnews.com/news/eastern-equine-encephalitis-michigan-warns-mosquito-borne-virus-after-3-deaths", "downloaded_at": "2019-09-18 23:26:45.228684+00:00", "title": "Michigan sounds alarm on mosquito-borne virus after 3 deaths", "language": "en", "text": "Public health officials are urging people to guard against mosquito bites after more cases of a rare mosquito-borne virus, including two additional deaths in southwestern Michigan. The Michigan Department of Health and Human Services issued an update Tuesday on eastern equine encephalitis, saying there were deaths in Cass and Van Buren counties. Those follow an earlier death in Kalamazoo County.\n\nThere also have been human cases in Barry and Berrien counties, and animal cases in St. Joseph, Genesee and Lapeer counties.\n\nMDHHS is strongly urging residents to protect themselves from mosquito bites as four additional cases of Eastern Equine Encephalitis (EEE) have been confirmed in Southwest Michigan - including two that were fatal. https://t.co/UuYZtvOJgF pic.twitter.com/celHB7Zm8k — Michigan HHS Dept (@MichiganHHS) September 17, 2019\n\nThe department is encouraging officials in affected Michigan counties to consider postponing, rescheduling or cancelling outdoor activities occurring at or after dusk, particularly activities that involve children, until there's a hard frost. Those include sports.\n\nOfficials recently said the virus was detected in insects and animals in northern Indiana.\n\nSymptoms of an EEE infection include chills, fever, and joint and muscle pain. Other signs can include headache, irritability, restlessness, drowsiness, anorexia, vomiting, diarrhea, cyanosis, convulsions, and coma.\n\nDeath typically occurs two to 10 days after onset of symptoms but can occur much later, according to the CDC.\n\nThe CDC reports that there is no antiviral vaccine for EEE and patients who believe they've been infected should get to a doctor as soon as possible.\n\nConnecticut and Rhode Island have also reported human cases of EEE this week. In Connecticut, officials say mosquitoes in 12 towns in the state and horses in two other towns have tested positive for EEE this season.", "description": "Death typically occurs two to 10 days after onset of symptoms but can occur much later, according to the CDC", "authors": [], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2017/08/01/ddddc78a-05f7-411a-a33a-50a29c35fe32/thumbnail/1200x630/f2ac647a0e2b328b6929dfbfa405a3a6/gettyimages-506748274.jpg", "published_at": "2019-09-18"}