{"pub": "washingtonpost", "url": "https://washingtonpost.com/outlook/2019/10/03/i-owe-my-new-life-my-marine-husbands-hideous-death-i-pay-price-every-day", "downloaded_at": "2019-10-03 10:48:25.746712+00:00", "published_at": "2019-10-03", "title": "I owe my new life to my Marine husband’s hideous death. I pay the price every day.", "language": "en", "text": "Cleve’s prosthetic leg stood in the corner of my living room, its plastic foot still wearing the left shoe of his khaki Converses. It was the third anniversary of his death, and I stared at the socket that once held his nub, remembering its shape. After the amputation, it was rounded, a pink scar cut clean across the top. As the muscle atrophied, his flesh hung like a boneless chicken breast, the scar left amorphous and supple.\n\nOn April 1, 2006, men were hiding in bushes on the side of a steaming-hot road in Ramadi, Iraq, when the Humvee driven by my husband, Marine Cpl. Jimmy Cleveland Kinsey II, passed. They waited for the perfect moment, then set off an improvised explosive device, blowing off the door and flipping the four-ton hunk of metal onto its side with Cleve and his buddies inside. “The bomb was double-stacked,” he told me. “Twice the power.” He held his hands out wide to mimic its bigness. He said the shrapnel flew in all directions like fireworks, ripping flesh from bone. Cleve got the worst of it. Afterward, he was flown to Washington and told that hardly any soft tissue remained on his lower left leg. He was, the doctors said, lucky to be alive.\n\nIn fact, his surgeon called my husband a guinea pig. He said they’d never done a leg salvage like the one they did on him. A strap of muscle, the latissimus dorsi, was severed from his back and stitched to his leg. The top layer of skin was removed from his right thigh and placed over the fresh meat of his flesh, a brand-new calf. Frankenfoot, we called it, joking. We joked a lot to cope. Things started going wrong when the tiny veins that had been stitched together didn’t cooperate, causing venous congestion. His leg would turn a deep purple and bleed and bleed and ooze. Not long after, bone infection set in, and amputation was the only option. Suddenly, we had nothing left to joke about.\n\n\n\nFugett was widowed at 24. \"Technically, he died of an overdose,\" she says of her husband, Cleve, whom she had known since childhood, \"but I also think it was isolation and loneliness.\" (Leah Nash/For The Washington Post)\n\nI was 22 years old, married only two years and gingerly rubbing my beloved’s stump as we watched “Sopranos” reruns from a box set Rudy Giuliani had given us on one of his visits to Bethesda Naval Hospital, where Cleve was being treated. We’d been living at hospitals on and off in the three months since he had been wounded. I thought about how we’d gotten there. Both of us had come from families who were too busy working to help us with schoolwork and too broke to pay for college. We’d done the best we could with the options given to us, and this was the result: a war hero and his caregiver, two young people who had chosen to serve their country. Or at least that’s how the military wanted us to think of ourselves. The reality was much more complicated. Yes, we were proud of his service. But ending up in that hospital, me feeding him cans of Ensure as he lay in his bed after surgeries, felt more like a stumble than a choice. We huddled into each other, and I felt around for bone spurs — fingerlike growths that commonly form at the end of amputated bones. It was soft like dough. “Does it hurt?” I asked, and he told me he’d just taken an OxyContin. “I can’t feel anything anymore,” he said.\n\n[How to keep going after a mass shooter kills your husband]\n\nSince the wars began in 2001, more than 52,000 service members have been wounded in action. These men and women are often unable to work and depend on disability benefits to survive. The disability rating system, in my experience, is sketchy. Initially, Cleve was given a low rating — a disability of 35 percent, they said, which meant less money to live on. Thirty-five percent is what you got back then for a single, below-the-knee amputation. I knew he would not be able to work with the severity of his injury, so I spent more than a year collecting his medical paperwork and making phone calls. Finally, someone with some power helped us secure him a higher rating. This kind of experience was common among our friends. A service member with three amputated limbs would have the same disability rating as someone who had no amputations and was willing to work full time. The rating you got seemed to depend on whom you knew.\n\nAt Walter Reed Army Medical Center, where Cleve was transferred after his leg was finally amputated, many patients had missing body parts and, therefore, prosthetics. There were the AKs (above-the-knee amputees) and the BKs (below-the-knee), each further categorized by what limbs were amputated, and how many: single, double, triple and, God forbid, quadruple. There, the more bionic you were, the cooler you were. The word “disabled” was hardly ever used. It felt like an exclusive club. Humans are so good at reframing terrible circumstances in order to survive them. Cleve ended up thriving in the hospital, mostly. He was comfortable there with friends who looked like him. He felt as if he belonged.\n\nAt parties, it was common for the amputees to pop off their prosthetics, all metal and carbon fiber and plastic, fill them with alcohol and pass them around for everyone to drink from. Once, a friend with a prosthetic eye wanted to participate, too, so he popped the glass sphere from his eye socket and passed it around. Everyone took turns licking it. If you participated, you were in the club, even if you didn’t have a missing body part. To participate meant you could be trusted. The eye was smooth and cool on my tongue.\n\n[How the military is making it hard to remember our wars]\n\nSo many things we did probably seemed strange to outsiders, but nothing about our lives was normal anymore. If we wanted normal — and we did, even if we didn’t want to admit it — we had to create a new version of it, so we did. We made our own rules. We were desperate to take back some control in what felt like complete chaos.\n\nWhen Cleve medically retired from the military, we moved to Maylene, Ala., only four hours’ drive from Foley, the small town where we’d met in eighth-grade English class 11 years before. We bought a house we could just barely afford next to his best Marine Corps buddy, Matt, and his wife, Shannon. We hoped for the American Dream. Cleve couldn’t work, so we lived off what was left of his traumatic-injury insurance payment, monthly disability payments and eventually the $10 an hour I made after finally finding a job. The military by that time called him 90 percent disabled. That meant, in exchange for his leg and mind — he also had post-traumatic stress disorder — he received a one-time check for $100,000 and a little more than $1,700 a month. Neither of us had ever made so much money in our lives. For the price of his body, we were finally somewhat financially stable.\n\nFugett keeps mementos of her husband, including photographs. The Purple Heart he received after he was wounded.\n\nLEFT: Fugett keeps mementos of her husband, including photographs. RIGHT: The Purple Heart he received after he was wounded.\n\nBut suddenly, Cleve was the only amputee we knew. So few civilians were willing to drink from his leg. Three years of pain medications — Dilaudid, morphine, Lortab, Percocet, OxyContin, fentanyl — meant he became an addict, which isolated him further. For me, his addiction quickly became scarier than his war wounds. When the military couldn’t figure out what to do with him after his first overdose, in the fall of 2008, and then a failed rehab attempt, in the spring of 2009, they retired him: Let Veterans Affairs figure it out. Where the doctors were skilled at treating gnarly wounds, they seemed ill-equipped to treat the addiction that many experienced as a result. Less than a year after his retirement, Cleve died.\n\nTechnically, he died of an overdose, but I also think it was isolation and loneliness. It was the summer of 2009, August or maybe July, when he finally retired. It had been two years since the amputation of his leg and a little more than three since the bomb. By January 2010, he’d grown violent. Without the comfort of the hospital and the friends he’d made there, he seemed to have lost his ability to control his temper, a symptom of PTSD that had shown itself in waves since he was wounded. He was pushing me away. In an attempt to save our marriage, he went to what we thought was an inpatient PTSD facility called Project Victory in Houston. There, he was kept in a hotel room across the street from the hospital. In it, he decided to smoke the medicine on his fentanyl patch. I assume he was bored. Maybe he craved the feeling of being high. There was no one there to stop him. He died there, alone.\n\n[The other opioid crisis: pain patients who can’t access the medicine we need]\n\nCleve’s autopsy report took nearly half a year. While I waited for it, my car was repossessed, and our home went into foreclosure. Once the service member is gone, the military isn’t as concerned with taking care of the family, not without the correct paperwork. In my case, it was a death certificate and a statement from the coroner that the death was service-connected. I was alone, and my grief was so severe, I couldn’t work. Before the house was to be taken, I called Matt and asked him to help me sift through Cleve’s belongings. We took shots of cheap tequila and rummaged through dusty boxes. We read love letters women before me had sent Cleve on his first deployment, looked at pictures of him as a teen, counted wads of colorful Iraqi money he’d brought home.\n\nMatt and I hadn’t had much of a friendship when Cleve was alive, even though they were inseparable. When Cleve and I decided to elope, we had been dating for only three months, and Matt was understandably skeptical. When I asked him years later why he hadn’t approved of me, he said it was because I’d missed out on their first deployment by the time I showed up to Camp Lejeune. Cleve and I had known each other since childhood — a rushed relationship didn’t feel as odd to us — but Matt thought of me as an outsider, so he picked on me and cracked jokes at my expense. But our unique grief brought us closer. No one else in the world would understand Cleve’s death the way we did.\n\nBy the time of the foreclosure, I couldn’t handle the stress. It all seemed to happen so fast, and I didn’t have the energy to fight it, so I let all our belongings go except for what I could fit in my car, including the three boxes of Cleve’s things that Matt and I had packed. For months, I lived on a friend’s couch reading books like “Eat Pray Love,” trying to imagine a new life, until, finally, the autopsy report called Cleve’s death “service connected,” and the military paid me more money than I could fathom in exchange for his life. Blood money, I thought.\n\nAfter I buried Cleve, I couldn’t help but think of his body rotting, the worms, the ants, the heat. I decided the Christian God wasn’t real, replacing him with walks in the woods and Buddhist philosophies about life and death. I cried every day. I talked to Cleve in the shower. I slept with his leg, tucking it in next to me as if it were a child. I prayed to Cleve every night, begging him for answers to questions like What do I do next? How do I go on? Are you okay? I thought I might be going insane. I thought I might want to die. I had been stripped of everything and left to rebuild myself, and I wasn’t sure how to do that.\n\nWhen the insurance money came, things began to change. It gave me space to grieve without having to worry about food or shelter. I had never been in a position where I could choose things I actually wanted rather than choose the only things available to me. Suddenly, I was able to buy a comfortable home and a reliable car without anyone’s help. I enrolled in college and no longer identified as a high school dropout. “Student,” I repeated to myself. And then “college graduate.” And then “MFA graduate.” From his ashes, I built myself into something beautiful and new. Could I have done this had my husband not died? No. I don’t think I could have.\n\nWhen Cleve died, I promised him I would live a good enough life for both of us. Grief became a sort of motivator. I was determined to make him proud. For the first time in my life, I had enough money to focus on improving myself, to become the kind of person someone could be proud of. Finally, I could find some version of the American Dream. When I meditate on the sacrifice it took to get there, guilt and anger burn deep.\n\nI imagine myself as a little girl, born to a young woman and her soldier husband who struggled to make ends meet. Pink cheeks, large blue eyes and loose brown curls to my shoulders, I wait a year at a time for my father to return home from Korea and watch as my mother struggles to feed and clothe us. I say to my little-girl self: “One day, you will have all the money you ever wanted, but it will come at a price.” I am angry for her, at this country for sacrificing us, for sacrificing the working class, to wars and deployments for unclear reasons.\n\nIn the nine years since his death, I have come to treasure Cleve’s prosthetic leg as if it were a part of his body. I feel lucky to have a piece of him. But I’ve never known what to do with it. By the third anniversary of his fatal overdose, the leg had collected dust, a thin layer shimmering in the window light, a reminder that enough time had passed for his real body to decay in that hole on a hill in Summerdale, Ala., where I’d buried him next to his older brother. I was packing to meet Matt to celebrate his life. A week before, Matt demanded that I bring the leg camping, to which I responded, incredulous, “The leg is obviously coming with.” I tucked it into my bag along with my deodorant, hair ties, underwear.\n\nMatt and I sat in front of a campfire, filling Cleve’s leg with champagne. We passed it back and forth, taking swigs, the bubbles burning the backs of our throats. Trampled by Turtles played “Codeine” in the background, and we sang along and stomped our feet until we were laugh-crying. “That jerk left us here,” Matt said. I nodded in agreement. “Total jerk.”\n\nI still have the leg in my home, nearly a decade after his death. It is something like decor or a conversation piece. Sometimes it holds fabric flowers or kindling. I wait for visitors to notice it on their own, wondering what their reaction will be. Having his leg around reminds me of where I came from and who I am. It reminds me of what was sacrificed in order to have this home at all.\n\n\n\nFugett and her husband, Cleve. (Leah Nash/For The Washington Post)\n\nThis essay was supported by the Economic Hardship Reporting Project.", "description": "He lost his leg to a bomb in Iraq and his life to painkillers back home.", "authors": ["Karie Fugett"], "top_image": "https://www.washingtonpost.com/resizer/gED9Yj__Jnf765F7_YBwy2YxqUA=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/77WL6FGQ6YI6TJRABKIWK3L5WY.jpg"}