{"pub": "usatoday", "url": "https://usatoday.com/story/travel/hotels/2019/10/08/resort-fees-proposed-legislation-everything-you-need-to-know/3854924002", "downloaded_at": "2019-10-08 15:03:15.337772+00:00", "title": "Congress takes on 'hidden fees' at hotels and resorts. Here's what it could mean for travelers", "language": "en", "text": "CLOSE You might want to kiss goodbye the days of getting free stuff when staying at a hotel. Buzz60\n\nIf you find yourself scanning and clicking on hotel prices only to see a higher bill when it's time to pay, you're not alone.\n\nResort fees are mandatory charges that include a bundle of services guests have come to expect during a hotel stay. They're labeled everything from resort fees to hotel fees to destination fees and more.\n\nThat bundle could include free Wi-Fi, access to the pool and, at resorts in big travel cities like New York and San Francisco, a free drink or discounted breakfast.\n\nA new bill proposed in the House of Representatives would force companies to more accurately reflect the price of hotel rooms — by including mandatory fees before taxes in a hotel room's advertised cost — and stakeholders from all sides are weighing in.\n\n\"Why would any member of Congress want to let their constituents be scammed?\" Lauren Wolfe, founder of the Kill Resort Fees website and counsel for consumer advocacy group Travelers United, told USA TODAY.\n\nWhat hotel fees look like\n\nLet's say you want to stay at The Venetian Casino in Las Vegas. When you go to search for a room, it might look something like this:\n\nA look at pricing for a one-night say at The Venetian Casino in Las Vegas this November. (Photo: Expedia.com screenshot)\n\nOnce you click on the $164 option, you can see what's available and choose a room.\n\nHere are room options that come up, with a \"reserve\" option. (Photo: Expedia.com screenshot)\n\nOnce you go to pay, you'll notice that price has jumped from $164 all the way to $237.25, with $51.02 coming from resort fees alone. You have to click on the \"Due at Property\" link to see the reason for the charge.\n\nWhat the true cost of a room looks like. (Photo: Expedia.com screenshot)\n\nWhy are people upset about hotel fees?\n\nMore than one-third of people said they experienced a hidden hotel fee in the last two years, according to a Consumer Reports nationally representative survey of more than 2,000 adults in 2018.\n\n\"We are now seeing people turn away from visiting areas plagued by resort fees such as Las Vegas,\" Wolfe says. \"The worst hotel resort fee offenders are in areas where the hotels can prey upon unsuspecting tourists,\" Wolfe adds. \"These hidden fees are now found at almost every hotel surrounding Walt Disney World, Times Square and the Las Vegas Strip\"\n\nSamantha Jones, a hotel industry veteran who is now senior vice president of hotel programs for travel agency consortium Travelsavers, says that hotels the company has worked with have been above board and transparent about rates.\n\n\"For some hotels, they’re providing a value in the fee that they’re charging,\" Jones says. \"I think it just has to be a matter of choice whether or not the traveler actually wants to accept that fee.\"\n\nJones agrees with the need for transparency but understands what hoteliers are up against: The need to drive revenue while also delivering on the services they're charging guests. \"If they can win that battle, then they’re gonna have a loyal customer,\" she told USA TODAY.\n\nMore: How to avoid a hotel cancellation penalty\n\nWhat is the new hotel fee legislation?\n\nCongresswoman Eddie Bernice Johnson (D-Texas) and Congressman Jeff Fortenberry (R-Neb.) introduced the Hotel Advertising Transparency Act of 2019, which would require consumers see the full pre-tax price of a hotel room. The bill includes short-term rentals.\n\n“All we’re trying to do is say tell people upfront what to expect, what will be included when they get ready to pay the bill,\" Johnson told USA TODAY in an interview. They are working on getting a Senate sponsor.\n\n\"When travelers search for hotel options, they deserve to see straightforward prices. They should not get hit with hidden fees that are designed to confuse consumers and distort the actual price,\" Fortenberry said in a statement accompanying the bill. \"I am pleased to support this legislation that will result in greater transparency for the traveling public.\"\n\nThe bill has been referred to the House Committee on Energy and Commerce for review.\n\nWhat else has been going on with hotel fees in court?\n\nFormer Sen. Claire McCaskill (D-Mo.) tried to pass similar legislation in 2016, but it fizzled.\n\nSeveral lawsuits were introduced earlier this year in July against specific hotel chains in both Washington, D.C., and Nebraska. Attorney General Karl Racine of Washington filed one against Marriott, and Attorney General Doug Peterson of Nebraska filed one against Hilton.\n\nThe Marriott lawsuit was filed in D.C. Superior Court in July after an investigation conducted by all 50 state attorneys general.\n\nThe Hilton case came out of an investigation into hotel fees, Meghan Stoppel, consumer protection division chief in the Nebraska attorney general's office, tells USA TODAY. They found Hilton's advertising of these fees both on its website, and in some instances over the phone, was deceptive, misleading and in violation of the state's consumer protection statute.\n\nWhat is the industry saying about it?\n\n\"When resort fees are applied, they are clearly and prominently displayed by hotel websites prior to the end of the booking process, in accordance with guidance issued by the U.S. Federal Trade Commission,\" Brian Crawford, executive vice president of government affairs for the American Hotel and Lodging Association, told USA TODAY. \"We believe that all online lodging advertisers, including third-party online travel agencies and short-term rental platforms, should be held to the same standards of transparency.\"\n\nHilton claims that resort fees aren't at most of its locations around the world and that they meet the proper disclosures.\n\n\"Resort fees are charged at less than two percent of our properties globally, enable additional value for our guests, and are always fully disclosed when booking through Hilton channels,\" Nigel Glennie, a Hilton spokesperson, told USA TODAY in a statement.\n\nOthers think this legislation will benefit the industry.\n\n\"The removal of hidden fees and an increase in transparency will benefit the occupancy levels and booking conversions for the hotels and resorts,\" Will Hatton, owner of travel site Hotel Jules and founder of travel blog The Broke Backpacker, told USA TODAY. \"Personally, for me, it is a massive frustration thinking I have got a good deal on an Airbnb property, then to be hit with a cleaning and admin (fee) that can almost double the price,\" he added.\n\n\"We’re not trying to say to hotels change the way you charge,\" Johnson adds. \"We’re saying please be transparent so people will know what to expect.\"\n\nWhat can consumers do to voice their concerns about hotel fees?\n\nAnna Laitin, the director of financial policy at Consumer Reports, says consumers need to be careful when making reservations and know what they’re getting into by reading the fine print. If you see a fee on your bill you weren’t expecting, bring it up with front desk (and get a printed receipt).\n\nWolfe recommends consumers file a consumer complaint with their attorney general for a resort fee refund. \"I believe resort fees violate existing state consumer protection laws. If your attorney general feels the same, they should be happy to respond to your complaint,\" she says. \"They will likely work with the hotel to make sure you get refunded. The consumer complaint form is online and can be filled out in less than two minutes.\"\n\nContributing: Morgan Hines, USA TODAY; Ed Komenda, Reno Gazette Journal; Associated Press\n\nRead or Share this story: https://www.usatoday.com/story/travel/hotels/2019/10/08/resort-fees-proposed-legislation-everything-you-need-to-know/3854924002/", "description": "New legislation proposed in the House of Representatives would force companies to more accurately reflect the price of hotel rooms.", "authors": ["David Oliver", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/04/USAT/44b5c0de-70e6-44b0-a1c9-ff2ff33a8543-19_Las_Vegas.JPG?crop=2999,1687,x1,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-08"}