{"pub": "independent", "url": "https://independent.co.uk/independentpremium/editors-letters/boris-johnson-brexit-parliament-dominic-cummings-a9121971.html", "downloaded_at": "2019-09-26 23:46:01.773445+00:00", "title": "Parliament has always been a source of colorful language, but this week the tone darkened", "language": "en", "text": "The House of Commons is not for the thin-skinned or the faint of heart.\n\nNot for nothing is the chamber known as a bear pit. When passions run high, insults are hurled between the green benches and angry MPs’ tongues often run away from them until they have to be reined in by Speaker John Bercow’s famous cry of: “Order! Order!”\n\nRules on parliamentary language which prevent them from using straightforward epithets like “liar” force MPs into ever more inventive invective, and the Commons has seen honourable members denounced as “a semi-house-trained polecat” (Michael Foot on Norman Tebbit) or “a pig’s bladder on a stick” (Tony Banks on Tory MP Terry Dicks).\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBut Wednesday evening was something quite different.\n\nBoris Johnson’s use of words like “surrender” and “sabotage” in relation to opponents of his Brexit stance, and his claim that the opposition wanted to “betray the people”, angered many MPs by appearing to give fuel to a narrative of hostility between the public and their parliamentary representatives.\n\nAnd his dismissal as “humbug” of warnings that he was encouraging abuse of MPs – particularly women MPs – drove many more into fury.\n\nCompared to the semi-affectionate knockabout of many Commons exchanges, the language used as the emotional temperature soared was blunt and brutal. The PM was a “disgrace”, his comments “genuinely and seriously dangerous”, MPs said. Some were seen to leave the chamber in anger while others were close to tears.\n\nIn the morning, after the dust had settled, a shaken Bercow made a plea to MPs to tone down their rhetoric from the “toxic” experience on Wednesday, which he said was the worst he had seen in 22 years in parliament.\n\nSpeaking to MPs, it was clear that many believe the stoking up of anger and division is all part of a deliberate strategy by the PM and his Downing Street adviser Dominic Cummings to cast the coming election as a battle between “the people” – and their tribune Johnson – and the “establishment”, represented by MPs with their supposedly obsessive desire to frustrate Brexit.\n\nNo 10 did little to dispel this view, with one government source saying that Johnson was doing nothing more than forcing MPs to confront the “reality” that they have been evading for the past three years, and warning that they will “destroy confidence in democratic politics” if they do not deliver Brexit.\n\nThe source seemed a little chastened by the idea that the MPs are themselves the representatives of the people, elected to Westminster by communities around the country to scrutinise a government with no majority led by a man voted into No 10 by a little over 90,000 party members.\n\nIn many ways, the scenes on Wednesday crystallise the impact that Brexit has had on Britain, and that the rancour, disunity and distress on display are all too representative of the national mood it has created.\n\nYours,\n\nAndrew Woodcock\n\nPolitical editor", "description": "The House of Commons is not for the thin-skinned or the faint of heart. Not for nothing is the chamber known as a bear pit. When passions run high, insults are hurled between the green benches and angry MPs’ tongues often run away from them until they have to be reined in by Speaker John Bercow’s famous cry of: “Order! Order!”", "authors": ["Andrew Woodcock"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/25/22/boris-parliament-supreme-court.jpg", "published_at": "2019-09-26"}