{"pub": "cbs", "url": "https://cbsnews.com/news/ted-cruz-says-he-would-be-happy-to-meet-with-actress-alyssa-milano-about-guns", "downloaded_at": "2019-09-03 23:45:47.412749+00:00", "title": "Ted Cruz says he would be \"happy\" to meet with actress Alyssa Milano about guns", "language": "en", "published_at": "2019-09-03", "text": "Texas GOP Senator Ted Cruz says he'd be \"happy\" to meet with actress and activist Alyssa Milano to talk through their differences on guns. After Cruz and Milano tangled over guns and the Bible on Twitter, Milano proposed a meeting with the lawmaker when she visits Washington next week.\n\n\"I'd love to come in and meet with you on the gun issue and many other issues that include life, liberty and the pursuit of happiness,\" Milano tweeted.\n\n\"Also, 1 Peter 4:8,\" she added, a reference to a Bible passage that reads, \"Above all, love each other deeply, because love covers over a multitude of sins.\" The actress suggested live streaming the meeting so the public could \"hear your bull**** first hand.\"\n\nThe liberal actress and activist has made frequent stops to the U.S Capitol lately to speak with lawmakers and participate in demonstrations against strict abortion bans, Brett Kavanaugh's Supreme Court confirmation and the rise in gun violence across the country.\n\nActress Alyssa Milano is seen ahead of a Senate Judiciary Committee hearing of Dr. Christine Blasey Ford at the Capitol Hill in Washington, U.S., September 27, 2018. Michael Reynolds/Pool via POOL New / REUTERS\n\nWhile he didn't address the more colorful language in Milano's tweet, Cruz said he's open to a peaceful meeting. He tweeted in response that he'd be willing to \"unite to stop gun violence.\"\n\n\"If we can have a civil and positive conversation — in the spirit of 1 Peter 4:8 as you suggest — despite our political differences that might help resolve the discord in our nation,\" Cruz added. Like President Trump, the Texas Republican argues that mental illness often plays a \"critical role\" in the rise in mass shooting events.\n\n\"People who commit sick acts of mass murder like this are often dealing with very severe mental illness,\" Cruz told CBS News in the fallout of the El Paso, Texas Walmart shooting last month.\n\nTheir Twitter debate began when Milano asked over Twitter, \"Can someone cite which passage of the Bible God states it is a god-given right to own a gun? This guy is unbelievable and is clearly owned by the gun lobby.\" She was referring to Texas GOP Congressman Matt Schaefer's tweet: \"I am NOT going to use the evil acts of a handful of people to diminish the God-given rights of my fellow Texans. Period. None of these so-called gun-control solutions will work to stop a person with evil intent.\"\n\nCruz responded with a lengthy string of tweets and cited the Bible: \"The right to self-defense is recognized repeatedly in the Bible, eg Exodus 22:2: 'If a thief is caught breaking in at night & is struck a fatal blow, the defender is not guilty of bloodshed.' (Note, though, verse 3 says it IS murder if during daylight (ie, not self-defense).\"\n\nHe also quoted the Constitution, a couple of scholars and went on to argue that the Second Amendment protected the rights of black Americans to defend themselves in the face of threats by the KKK. He concluded by with a tweet that said, \"We need to do MUCH more to stop violent criminals & those w/ dangerous mental illness BEFORE they murder & I'm leading the fight in the Senate to do so.\"\n\nMany mental health experts disagree with the argument that mass shootings stem from mental illness. They say that most people with mental illness are not violent and that they are more likely to be victims — rather than perpetrators — of violent crime, and access to firearms is the larger part of the problem.\n\nCruz, who is consistently endorsed by the National Rifle Association, has instead pushed for stopping violent criminals before they commit acts of gun violence, instead of removing or impeding Americans' ability to obtain firearms in the first place.\n\nHe has lent his support to expanding and improving the nations' background check database system through which aims to do just that.", "description": "\"I'd love to come in and meet with you on the gun issue and many other issues that include life, liberty and the pursuit of happiness,\" Milano tweeted to Cruz", "authors": ["Emily Tillett", "Emily Tillett Is A Politics Reporter", "Video Editor For Cbs News Digital"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/04/02/6035454a-ff35-4d22-9f96-b2b90bf7fc8d/thumbnail/1200x630g2/db34b6e59a42d39a18993d3c4af5e948/am.jpg"}