{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/4/illegal-vape-name-draws-scrutiny-as-illness-spread", "downloaded_at": "2019-10-04 07:42:28.206818+00:00", "title": "Illegal vape name draws scrutiny as illness spreads", "language": "en", "text": "LOS ANGELES (AP) - It’s a widely known vape cartridge in the marijuana economy, but it’s not a licensed brand. And it’s got the kind of market buzz no legitimate company would want.\n\nThe vape cartridges that go by the catchy, one-syllable name “Dank” _ a slang word for highly potent cannabis _ are figuring prominently in the federal investigation to determine what has caused a rash of mysterious and sometimes fatal lung illnesses apparently linked to vaping. Most of the cases have involved products that contain the marijuana compound THC, often obtained from illegal sources.\n\nThe suspect Dank vapes are a familiar product in the underground marijuana economy _ it’s not a legal, tested brand. It’s merely a name on a box or a cartridge, packaging that’s easily obtained online and used by illicit producers to lure customers.\n\nBut with colorful boxes and names like Cherry Kush and Blue Dream, the homemade vapes appear convincing on the shelf.\n\n“It doesn’t look very different from what you can buy in a (legal) dispensary,” said Beverly Hills-based cannabis attorney Allison Margolin.\n\nSo far, investigators have not identified a culprit in the illnesses reported in dozens of states. But officials say patients have mentioned the Dank name frequently. Many of the people who got sick in Illinois and Wisconsin, for example, said they used cartridges sold in Dank packaging.\n\nThe raw materials to produce a Dank vape aren’t hard to find: Ready-to-fill Dank boxes and cartridges can be ordered from Chinese internet sites for pennies apiece. A Craigslist post last week offered a box stuffed with empty Dank packages for $16. And you can buy the boxes and empty cartridges in shops in downtown Los Angeles.\n\nA rogue producer adds cannabis oil _ almost certainly untested _ and it’s ready for sale.\n\n“It’s a generic product name that doesn’t really tie back to one store or one distributor,” Dr. Jennifer Layden, chief medical officer for the Illinois Department of Public Health, said last month. “Folks are getting it from friends or folks on the street, with no understanding of where it came from prior to that.”\n\nThe chief selling point for pot vapes in Dank packaging: It’s a quick high on the cheap, available for as little as $20 a gram on the illicit market, roughly one-third of what a customer would pay for a cartridge in a legal marijuana shop in California\n\nBut they come with risk: Products in the legal marijuana market are tested for safety and purity, while those in the illicit market are not and could contain pesticides, heavy metals or other dangerous contaminants.\n\nAccording to California records, no licensed company is manufacturing a cannabis vape carrying the Dank name them in the state.\n\n“It was never a legitimate company,” said Los Angeles dispensary owner Donnie Anderson. “It was always an underground brand.”\n\nGiven the shadowy pedigree of Dank vapes, it’s not surprising that details about its history are scarce. In California, the Dank name appears to have emerged during the largely unregulated medical cannabis era, prior to broad legalization that began in 2018.\n\nDispensary owner Jerred Kiloh, who heads the Los Angeles-based United Cannabis Business Association, recalls seeing Dank vapes for the first time about seven years ago. Kiloh remembers being visited by vendors selling them at his shop, though that stopped long ago.\n\nWhat remains is the name, which has managed to retain a surprising cache in the underground industry.\n\nLast month, Wisconsin authorities uncovered an illegal vape-cartridge operation that they said was producing thousands of cartridges loaded with THC oil every day for almost two years. Photographs released by the Kenosha County Sheriff’s Department showed neatly stacked Dank boxes and cartridges, apparently ready for shipment.\n\nAlso last month, Minnesota authorities seized nearly 77,000 THC vaping cartridges, some of which were packaged in Dank boxes.\n\nIn November 2018, authorities in Lorain County, Ohio, intercepted four packages mailed from California holding individually wrapped and sealed packages of Dank cartridges. They believed numerous similar packages were sent to the area previously.\n\n“Dank Vapes appears to be the most prominent in a class of largely counterfeit brands, with common packaging that is easily available online and that is used by distributors to market THC-containing cartridges with no obvious centralized production or distribution,” said a report by Illinois and Wisconsin officials, and from the federal Centers for Disease Control and Prevention.\n\nDoctors say the illnesses resemble an inhalation injury. Symptoms have included shortness of breath, fatigue, chest pain, diarrhea and vomiting.\n\nRon Gershoni, co-founder of vape producer Jetty Extracts who sits on the board of the California Cannabis Manufacturers Association, said the strictly regulated legal industry has been working to distinguish itself from the underground market that continues to thrive in California.\n\nHis company doesn’t view Dank vapes as a competitor, but he understands how the name has survived in the illegal market.\n\nThey “essentially sell empty packaging, and anyone can fill it,” he said. “It’s a business model that made sense. Anybody who wanted to make a buck.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "It's a widely known vape cartridge in the marijuana economy, but it’s not a licensed brand. And it’s got the kind of market buzz no legitimate company would want.", "authors": ["The Washington Times Http", "Michael R. Blood"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/04/vaping_illnesses_outlaw_brand_16368_c0-251-3003-2001_s1770x1032.jpg?2d6c5fe88608ee3b9709cc4978ac8c10d0b4984f", "published_at": "2019-10-04"}