{"pub": "news24", "url": "https://city-press.news24.com/Sport/absa-premiership-a-break-for-reflection-20191009", "downloaded_at": "2019-10-09 19:01:59.879983+00:00", "title": "Absa Premiership: A break for reflection", "language": "en", "text": "Sport Absa Premiership: A break for reflection\n\nThe opening eight rounds of PSL fixtures have really provided something to mull over about the future during the international break. Three coaches – four if you include a caretaker coach – did not last long and more are likely to be fired as the season enters the crucial stage in the next round of fixtures.\n\nAlthough it’s said that it does not matter how teams start the race but rather how they finish, Kaizer Chiefs’ good run gives them hope of salvaging something at the end of the campaign.\n\nBut the question is, does a good start matter more than peaking at the right time?\n\nIt’s still a long way to the end of the season, but a good foundation sets the tone. This is what Chiefs have managed to do so far, grabbing the headlines with impressive performances.\n\nAmakhosi went into the international break sitting pretty at the summit of the Premiership table – having won six of their eight matches with just one defeat. Defending champions Mamelodi Sundowns have quietly gone about their business.\n\nWith two games in hand, the Brazilians are still a good bet to retain the league title. Sundowns are the only side yet to lose, although they have already dropped four points, having drawn two of their six matches.\n\nDespite their involvement in the CAF Champions League campaign, Pitso Mosimane has been able to box cleverly thus far.\n\nBut they were fortunate to be handed “local” sides in the preliminary rounds of the continental club competition as Mosimane and his team only travelled to Congo Brazzaville and the Seychelles.\n\nWe don’t mind playing every three days, but the most taxing [part] is the travelling Pitso Mosimane, Mamelodi Sundowns coach\n\nBut getting to the group stages of the tournament will tax them as they are likely to travel the length and breadth of the continent, which could affect their domestic showing.\n\n“We don’t mind playing every three days, but the most taxing [part] is the travelling,” Mosimane told City Press this week.\n\nMeanwhile, Bidvest Wits have also had a positive start to the season and coach Gavin Hunt should be satisfied with how his troops are grinding out results.\n\nOrlando Pirates and Cape Town City have been disappointing. Both sides were touted as serious title contenders when the season started, but they are nowhere near the top.\n\nIt is clear that the sudden departure of head coach Milutin Sredojevic has rocked the Pirates ship as caretaker Rhulani Mokwena has found the going tough.\n\nThe Sea Robbers have just two victories to their name and have lost as many games, with three draws compounding their stuttering start. The Soweto powerhouse will need to improve drastically if they are to claw their way back into serious contention.\n\nCity have not been any better, with just a single victory under their belt.\n\nCoach Benni McCarthy’s charges have not been able to replicate the same top-notch performances of the previous seasons. If they continue at the same rate, McCarthy might soon find himself in the unemployment queue.\n\nNewcomers Stellenbosch and AmaZulu picked up their first wins of the season only recently, with 2-0 and 2-1 victories over Polokwane City and Cape Town City, respectively.\n\nChippa United remain the only side still to taste victory and they are languishing at the bottom of the table.\n\nAfter a positive start, Polokwane City have gone back to their old ways of losing their momentum.\n\nTheir back-to-back defeats against Highlands Park and Stellies have seen them drop to fourth in the standings.\n\nOwen Da Gama’s Highlands Park have done well quietly and occupy the fifth spot, while SuperSport United have been blowing hot and cold.\n\nBaroka and Maritzburg have also not been convincing and will need to clean up their acts when the league programme resumes on October 23.\n\nThe league has gone into a recess and the lengthy break gives coaches a chance to reflect and fix their shortcomings, but others would have preferred to keep going and maintain their momentum.", "description": "The first quarter of the Absa Premiership season has given football followers a lot to talk about during the international holiday, writes Timothy Molobi.", "authors": ["Timothy Molobi"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9071/9ddcc953bea14649a932db7fe068f820.jpg", "published_at": "2019-10-09"}