{"pub": "axios", "url": "https://axios.com/greta-thunberg-visit-standing-rock-reservation-5bcc6b65-2203-4643-a139-bb69212c3ef6.html", "downloaded_at": "2019-10-07 01:11:59.760017+00:00", "title": "Greta Thunberg to visit Standing Rock Reservation, site of #NoDAPL protests", "language": "en", "text": "Details: Thunberg will participate on a panel on Sunday about the Keystone XL pipeline at the Red Cloud Indian School Field House on the Pine Ridge Reservation in South Dakota.\n\nOn Tuesday, she'll participate in a forum on the Dakota Access Pipeline at the Standing Rock High School in Fort Yates, North Dakota.\n\nContext: TC Energy's (formerly TransCanada) Keystone XL pipeline is a proposed addition to the Keystone Pipeline System. The Keystone XL would carry oil from Canada across Montana and South Dakota to Steele City, Nebraska. In South Dakota, the XL would run near the Pine Ridge and Rosebud reservations.\n\nTC Energy on Oct. 4 informed a federal court that it would begin preparing for the XL's construction in South Dakota and Montana, according to the Rapid City Journal.\n\nThe Keystone Pipeline System, which runs through eastern North Dakota, South Dakota and Nebraska, leaked 210,000 gallons of oil in eastern South Dakota on Nov. 17, 2017.\n\nThe Dakota Access Pipeline starts in North Dakota and runs for 1,172 miles through South Dakota and Iowa to oil terminals in Illinois.\n\nIn North Dakota, it runs near the Standing Rock Reservation and under Lake Oahe, the reservation's main source of water.\n\nLake Oahe's river crossing was the center of protests over potential water contamination and damage to sacred tribal sites in 2016 and 2017.\n\nOf note: Thunberg will join fellow youth climate activist and indigenous rights advocate Tokata Iron Eyes on both panels.\n\nThunberg and Iron Eyes spoke together at an Amnesty International event at George Washington University in September.\n\nGo deeper ... Axios-NewsWhip 2020 attention tracker: Greta's climate moment", "description": "The 16-year-old Swedish climate activist will participate on a panel about the environmental effects of the pipeline.", "authors": [], "top_image": "https://images.axios.com/5Nu8g425-29AAzPj5le7YT7p0b0=/461x501:3500x2212/1920x1080/2019/10/06/1570387300640.jpg", "published_at": "2019-10-06"}