{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/advice/carolyn-hax-an-age-old-question-how-to-respond-to-tone-deafness/2019/09/20/2a4edffc-da4e-11e9-bfb1-849887369476_story.html", "downloaded_at": "2019-09-21 07:12:19.138768+00:00", "title": "Carolyn Hax: An age-old question: How to respond to tone-deafness?", "language": "en", "text": "Advice columnist\n\nAdapted from recent online discussions.\n\nDear Carolyn: Recently a middle-aged person told me that they wouldn't want to live past the age of 80. I'm in my mid-70s and still working full time at a job I love in a field I'd be happy to pursue at least part time as long as I'm able — think past 100, if I'm lucky!\n\nMy feelings are really hurt by this person's expressed view, and I feel it is ageism. I was too stunned to reply at the time but now wonder what I should have said. Nothing snarky.\n\n— Hurt\n\nHurt: I’m curious about your reasons for taking it so personally. To me, it just sounds like ignorance. With some tone-deafness thrown in, given the audience.\n\nIf there’s a next time, then a plainly stated, “I hope I have more than five years left, but I speak only for myself,” would get any necessary points across.\n\n\n\n(Nick Galifianakis/The Washington Post)\n\nAs for whether it’s ageism, yes, it is, since this person basically said a life after 80 has no value. But I’m struggling with a way to say this. It doesn’t sound like mindful or purposeful ageism but instead flippant and accidental ageism, like the person who hasn’t given a moment’s thought to what s/he was actually saying. Like a 7-year-old thinking anyone over 45 is ancient.\n\nRe: Ageism?: My parents lived very happy and healthy lives until they were around 85. Now at 87 and 92, they are living very unhappy and unhealthy lives. So I've said something similar about not wanting to be in their position. I have seen also that they have little agency over their lives now — in almost every way you can think of. So I'm not sure it's ageism to say I wouldn't want to live past 85. It's been my life experience for the past few years.\n\n— Not Sure\n\nNot Sure: How about just saying, then, that you hope not to outlive your good health? Because the sentiment isn’t the problem, the arbitrary age tacked on to it is.\n\nDear Carolyn: How should I respond to a longtime friend who repeatedly points out that my 10-year-old isn't growing or developing like her peers? She phrases them as pointed observations, not curious questions. Our child is well within the range of normal, according to her doctor. I've said as much, but my friend doubles down. I'd like to shut this down for good. Any advice?\n\n— My Kid is Fine, Thanks\n\nMy Kid is Fine, Thanks: Stop responding as if you owe her a response.\n\n“You keep saying this. May I ask why?”\n\nThen respond to her response. Maybe there’s a non-obnoxious reason for her statements that hasn’t occurred to you. If it’s just that she’s worried and boundary-challenged, then say you appreciate her concern but her harping doesn’t help.\n\nOnce you’ve drawn that line, enforce it thereafter with, “Next topic, please,” then talk about something else.\n\nRe: Unhelpful: \"I don't know what you want me to do about that\" also works. I've said this repeatedly to certain family members who openly complain about an ugly facial feature I have.\n\n— Anonymous\n\nAnonymous: It’s a great answer, but — seriously? Those family members are the ugliest feature here.", "description": "Letter-writer is hurt by a younger person’s comment about not wanting to live past 80.", "authors": ["Carolyn Hax", "Advice Columnist", "September At Pm", "Carolyn Hax Started Her Advice Column In", "After Five Years As A Copy Editor", "News Editor In Style", "None As A Therapist. The Column Includes Cartoons", "Relationship Cartoonist", "Nick Galifianakis", "Carolyn'S Ex-Husband"], "top_image": "https://www.washingtonpost.com/resizer/fFeeuBECfreICMlLF0yNcs2iQEs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/V2UVWHW2GEI6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-20"}