{"pub": "foxnews", "url": "https://foxnews.com/sports/tom-brady-carli-lloyd-nfl-field-goal", "downloaded_at": "2019-09-07 02:22:08.045714+00:00", "title": "Tom Brady weighs in on Carli Lloyd potentially kicking field goals in NFL", "language": "en", "text": "Six-time Super Bowl-winning quarterback Tom Brady earlier this week tossed his support for U.S. soccer great Carli Lloyd and her ambitions to become a kicker in the NFL.\n\nLloyd reportedly drew serious offers from a handful of teams who were in search of a kicker during the preseason but turned them down because of her commitment to the U.S. women’s national soccer team and their victory tour.\n\nNEW ENGLAND PATRIOTS 2019 NFL OUTLOOK: SCHEDULE, PLAYERS TO WATCH & MORE\n\nBrady commented on her pursuit in a radio interview.\n\n“I think if you're good enough to do it and teams wanted to explore that, then everyone should have an opportunity,” Brady said on WEEI’s “The Greg Hill Show” on Tuesday. “It's a very highly competitive game and it's hard to find good players. It's hard to find good quarterbacks. It's hard to find good coaches. It's hard to find good linebackers. It's certainly hard to find good kickers.”\n\nCARLI LLOYD: IT WOULD BE 'FOOLISH' NOT TO ENTERTAIN NFL OFFERS IN 2020\n\nThe New England Patriots quarterback added: “It's kind of, in a lot of ways, survival of the fittest. It goes back to a very archaic way, but football is a very difficult sport and because there's a limited roster size you do give everyone a chance to make the team. It's a challenging camp, challenging offseason and then the coach decides, or the owner decides, or the general manager decides who makes it and who doesn't. Everyone is trying to win games. The NFL is a very competitive landscape. I believe that the owners try to put the best people on the field in order to give their teams the best chance to win.”\n\nThe possibility of Lloyd kicking in the NFL was brought up after she nailed a 55-yarder during an appearance at Philadelphia Eagles training camp.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nLloyd, who is coming off a women's World Cup championship win, said she would pursue the league in 2020.", "description": "Six-time Super Bowl-winning quarterback Tom Brady earlier this week tossed his support for U.S. soccer great Carli Lloyd and her ambitions to become a kicker in the NFL.", "authors": ["Ryan Gaydos", "Ryan Gaydos Is An Editor For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/SOC-Carli-Lloyd3.jpg", "published_at": "2019-09-06"}