{"pub": "yahoo", "url": "https://sports.yahoo.com/khabib-nurmagomedov-tops-ufc-242-221304578.html", "downloaded_at": "2019-09-08 11:45:47.862933+00:00", "title": "Khabib Nurmagomedov tops UFC 242 performance bonus winners", "language": "en", "text": "Khabib Nurmagomedov hand raised at UFC 242\n\nKhabib Nurmagomedov not only solidified his status as the sole UFC lightweight champion at UFC 242 on Saturday in Abu Dhabi, he also walked away with one of four Performance of the Night honors. There was no Fight of the Night bonus awarded.\n\nNurmagomedov did what he always does. He took Poirier down repeatedly, wearing him out, eventually setting up a rear-naked choke. He finished the fight a little over two minutes into the third round, securing the victory and a $50,000 bonus.\n\nScroll to continue with content Ad\n\nhttps://twitter.com/ufc/status/1170435535401189376?s=20\n\nJoining Nurmagomedov as bonus winners were Ottman Azaitar, Belal Muhammad, and Muslim Salikhov.\n\nAzaitar needed just one round to nab his $50,000 bonus check. He and Teemu Packalen fought at a blistering pace until Azaitar landed one brutal punch that sent Packalen to the canvas.\n\nhttps://twitter.com/ufc/status/1170370267274604553?s=20\n\nLike Nurmagomedov, Belal Muhammad earned his bonus with a fight-finishing submission. Muhammad sunk a rear-naked choke on Takashi Sato at the 1:55 mark of round three on the early prelims.\n\nhttps://twitter.com/ufc/status/1170365087342743552?s=20\n\nMuch like Azaitar, Salikhov also scored a one-punch, walk-off knockout. He landed a lightning-quick right hand that sent Nadine Taleb crashing onto his back. The knockout earned him a victory and a Performance of the Night bonus check.\n\nhttps://twitter.com/ufc/status/1170357629681430528?s=20\n\nTRENDING > The Eagle soars, as Khabib Nurmagomedov submits Dustin Poirier at UFC 242\n\nUFC 242: Khabib vs. Poirier Fighter Performance Bonuses", "description": "Khabib Nurmagomedov not only solidified his status as the sole UFC lightweight champion at UFC 242 on Saturday in Abu Dhabi, he also walked away with one of four Performance of the Night honors. There was no Fight of the Night bonus awarded.Nurmagomedov did what he always does. He took Poirier down repeatedly", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/VSAAsCdSgubPl8C8edTm4w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD02MzEuNDY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/Tu4.7j.wRCUE28uGk875bQ--~B/aD0zNzA7dz03NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/mmaweekly.com/dbc3f9e45028f8b588f8958d98f362d7", "published_at": "2019-09-07"}