{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7594821/Saints-knock-Bears-fifth-straight-win.html", "downloaded_at": "2019-10-21 00:19:29.701017+00:00", "title": "Saints knock off Bears for fifth straight win", "language": "en", "text": "Teddy Bridgewater completed 23 of 38 passes for 281 yards and two touchdowns, and the visiting New Orleans Saints rolled to a 36-25 win over the Chicago Bears on Sunday.\n\nSaints running back Latavius Murray finished with 27 carries for 119 yards and two touchdowns. New Orleans (6-1) notched its fifth straight victory despite the absence of injured starters Drew Brees, Alvin Kamara and Jared Cook.\n\nWide receivers Allen Robinson and Javon Wims each hauled in a touchdown pass for Chicago (3-3), which dropped its second game in a row. The Bears gave up 24 straight points to start the second half before responding late.\n\nNew Orleans opened the scoring with a safety early in the first quarter. Saints cornerback J.T. Gray blitzed up the middle and blocked a punt by the Bears' Pat O'Donnell. The ball bounced into the end zone as both players gave chase before O'Donnell swatted the ball out of the back of the end zone.\n\nThe Saints increased their lead to 9-0 when Bridgewater found Josh Hill for a 7-yard score with 3:14 to go in the first quarter.\n\nCordarrelle Patterson pulled Chicago within 9-7 on his 102-yard return for a touchdown on the ensuing kickoff. The play marked Patterson's seventh career kickoff return for a touchdown, which ranks third in NFL history. The only players ahead of him are Josh Cribbs and Leon Washington with eight apiece.\n\nChicago's Eddy Pineiro and New Orleans' Will Lutz traded field goals in the second quarter. The Saints led 12-10 at the half.\n\nMurray scored on a 3-yard run to put the Saints on top 19-10 early in the third quarter. Ted Ginn Jr. set up the scoring opportunity one play earlier with a 45-yard reception.\n\nNew Orleans made it 26-10 on a 4-yard touchdown catch by Taysom Hill with 2:55 left in the third quarter.\n\nLutz pushed the lead to 29-10 with a 30-yard field goal early in the fourth quarter.\n\nMurray recorded his second touchdown, this time from 4 yards, to make it 36-10 with 4:33 to play.\n\nThe Bears notched their first offensive touchdown when Mitchell Trubisky connected with Robinson for a 7-yard score with 2:31 remaining. Trubisky then hit tight end Adam Shaheen for a two-point conversion.\n\nChicago capped the scoring when Trubisky tossed a 6-yard touchdown pass to Wims in the final minute.\n\nMichael Thomas had nine catches for 131 yards for New Orleans.\n\n--Field Level Media", "description": "Teddy Bridgewater completed 23 of 38 passes for 281 yards and two touchdowns,  and the visiting New Orleans Saints rolled to a 36-25 win over the Chicago ...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-21"}