{"pub": "reuters", "url": "https://in.reuters.com/article/usa-trump-whistleblower-russia/trump-told-russians-in-2017-he-was-not-concerned-about-election-meddling-washington-post-idINKBN1WD03W", "downloaded_at": "2019-09-28 10:25:09.929395+00:00", "title": "Trump told Russians in 2017 he was not concerned about election meddling: Washington Post", "language": "en", "text": "U.S. President Donald Trump speaks at the Hispanic Heritage Month reception at the White House in Washington, U.S., September 27, 2019. REUTERS/Kevin Lamarque\n\nWASHINGTON (Reuters) - President Donald Trump told two Russian officials in a 2017 meeting that he was not concerned about Moscow’s meddling in the U.S. election, which prompted White House officials to limit access to the remarks, the Washington Post reported on Friday.\n\nA summary of Trump’s Oval Office meeting with Russia’s foreign minister and its ambassador to the U.S. was limited to a few officials in an attempt to keep the president’s comments from being disclosed publicly, the Post said, citing former officials with knowledge of the matter.\n\nThe White House did not immediately respond to a request for comment from Reuters.\n\nA whistleblower complaint about a July phone call in which Trump urged Ukrainian President Volodymyr Zelenskiy to investigate Democratic political rival Joe Biden is at the heart of the U.S. House of Representatives impeachment inquiry launched this week.\n\nA member of the U.S. intelligence community who filed the complaint against Trump said notes from other conversations the president had with foreign leaders had been placed on a highly classified computer system in a departure from normal practice in a bid to protect information that was politically sensitive, rather than sensitive for national security reasons.\n\nTrump’s 2017 meeting with Russian Foreign Minister Sergei Lavrov and Ambassador Sergei Kislyak was already considered controversial after it was learned that Trump disclosed highly classified information about a planned Islamic State operation.\n\nOn election interference, Trump told Lavrov and Kislyak he was not concerned about Russian meddling because the United States did the same in other countries, the Post reported.\n\nCNN, citing people familiar with the matter, said efforts to limit access to Trump’s conversations with foreign leaders extended to phone calls with Saudi Crown Prince Mohammed bin Salman and Russian President Vladimir Putin.\n\nWhite House senior adviser Kellyanne Conway told reporters that procedures for handling records of Trump’s conversations with world leaders had changed early in his tenure after calls with Mexico’s president and Australia’s prime minister were leaked.", "description": "President Donald Trump told two Russian officials in a 2017 meeting that he was not concerned about Moscow's meddling in the U.S. election, which prompted White House officials to limit access to the remarks, the Washington Post reported on Friday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190928&t=2&i=1434766606&w=1200&r=LYNXMPEF8R04E", "published_at": "2019-09-28"}