{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKCN1VU24U-OCASP", "downloaded_at": "2019-09-09 23:18:41.856847+00:00", "title": "Blue Jackets D Werenski agrees to 3-year deal", "language": "en", "text": "FILE PHOTO: May 6, 2019; Columbus, OH, USA; Columbus Blue Jackets defenseman Zach Werenski (8) wrists a shot on goal against the Boston Bruins during the third period in game six of the second round of the 2019 Stanley Cup Playoffs at Nationwide Arena. Mandatory Credit: Russell LaBounty-USA TODAY Sports\n\nColumbus Blue Jackets defenseman Zach Werenski agreed to terms on a three-year, $15 million contract on Monday.\n\nWerenski recorded 11 goals and 33 assists in 82 games last season while averaging 22:54 of ice time per contest.\n\nWerenski added one goal and five assists in 10 playoff games in the spring as Columbus advanced to the second round for the first time in franchise history.\n\nThe 22-year-old Werenski is set to become Columbus’ second-highest paid defenseman behind Seth Jones, who carries a $5.4 million cap hit for the next three seasons.\n\n“Zach Werenski is one of the best young defensemen in the National Hockey League and we couldn’t be happier that he will continue to be a foundational player for the Columbus Blue Jackets,” general manager Jarmo Kekalainen said. “He is a gifted offensive player that has continued to improve in all facets of the game and will be an elite player for many years.”\n\nWerenski has collected 38 goals and 90 assists in 237 career NHL games since being selected by the Blue Jackets with the eighth overall pick of the 2015 NHL Draft.\n\n— Field Level Media", "description": "Columbus Blue Jackets defenseman Zach Werenski agreed to terms on a three-year, $15 million contract on Monday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190909&t=2&i=1428050218&w=1200&r=LYNXNPEF881MU-OCASP", "published_at": "2019-09-09"}