{"pub": "politico", "url": "https://politico.com/magazine/story/2019/09/09/president-donald-trump-dynasty-228050", "downloaded_at": "2019-09-09 23:20:12.679285+00:00", "title": "The Dynasty Ends With King Donald", "language": "en", "text": "President Donald Trump (center) stands with Donald Trump Jr. (left) and Ivanka Trump during the Republican National Convention on July 20, 2016. | Joe Raedle/Getty Images Fourth Estate The Dynasty Ends With King Donald There will be no President Ivanka. No President Jared. And certainly no President Donald Jr.\n\nJack Shafer is Politico’s senior media writer.\n\nThe United States of America might not be a hereditary monarchy, but that doesn’t keep us from willing political dynasties into existence. Speaking at a California Republican Party convention over the weekend, President Donald Trump’s campaign manager, Brad Parscale, predicted that “the Trumps will be a dynasty that will last for decades.”\n\nAs if measuring the Trump children for their imperial purple robes, Parscale effused like a courtier. “I think they’re all amazing people,” he said, “with amazing capabilities. I think you see that from Don Jr. I think you see that from Ivanka. You see it from Jared.”\n\nStory Continued Below\n\nYou probably don’t take Parscale’s forecast seriously, but the Trump family does, according to McCay Coppins’ feature in the October Atlantic. Inside the family, Donald Jr. and Ivanka are battling one another for their father’s favor in an old-fashioned succession battle. Junior has the political edge, exciting the Trump faithful when he goes on TV or the hustings. But Ivanka, always the favorite child, still rouses the old man, who swoons at the thought of her becoming the first female president.\n\nBefore this jabber of a Trump dynasty grows thick enough to choke the commentariat, let’s mow it down. There will be no Trump dynasty. No President Ivanka. No President Jared. And certainly no President Donald Jr. If I were making book on the odds, I’d give Barron Trump a better shot at winning the office in 2060—when he’ll be 54 years old—than any of his kin if only because his father’s taint will have ebbed to the point that we will be able to consider him his own man and not a dynastic heir.\n\nAmerican voters, informed by a revolution—it’s kinda famous; you may have heard of it—in which the hereditary monarchy was considered evil, wisely recoil when offered the opportunity to create modern presidential dynasties. The best way to read the 2016 election is as a referendum against presidential dynasties. On the Democratic side, Hillary Clinton, inheritor of her husband’s royal plumage and all of her husband’s fund-raising acumen, failed to rouse enough Democrats to beat a first-time campaigner with no political experience. And this was the second time she lost—in her first round she was smoked by a first-term U.S. senator! On the Republican side, Jeb Bush, brother and son of a president, spent more than $130 million and reaped a total of three delegates before bailing out.\n\nIf any family had the right stuff to go dynastic on the White House, it would have been the Kennedys. Robert Kennedy might have won in 1972 or 1976 if he had not been assassinated, but we will never know. What we do know is that none of his surviving relatives who have pursued political careers—his brother and nieces, nephews, grand-nieces and grand-nephews—have come very close to inheriting the White House. Is a Trump really going to do what Kennedy can’t?\n\nThat’s not to say that the children, siblings and spouses of presidents are electoral poison. Being related by blood or marriage to a president, a senator or a representative tends to give you an edge in politics. The ledgers are filled with successful politicians—the Adamses, Kennedys, Bushes, Gores, Cuomos, Lodges, Udalls, Rockefellers, Daleys, Longs, Talmadges, Tafts, Browns and all the rest—who treated politics as a family business, finding a safe seat for a relative to win, much as the owner of a bank or construction company will find a spot in his enterprise for a beloved brother or daughter.\n\nBut where’s the safe seat for Donald Jr., Ivanka or Jared? Surely not the Trumps’ ancestral home in Queens, which just sent a hardcore socialist to Congress. The heirs could carpetbag it to some state where their president is strong, like Hillary Clinton did, and contend for a Senate seat there. According to Coppins, 75 percent of Montana Republicans view Donald Jr. favorably, so it’s not inconceivable he might follow her example. But Montana soil has yet to grow presidential timber, and even though Donald Jr. can affect a convincing lumberjack look, I suspect it takes more than that to win the presidency.\n\nWhat about George W. Bush in 2000, you say? Well, what about him? I will let you say he was a dynastic president—but in return I demand an asterisk next to his name. For one thing, Bush barely won, losing the popular vote and winning sloppily with a contested Florida victory that put him on top in the Electoral College. For another, the guy he defeated, Al Gore, had been raised from birth to run for the presidency by his father, Al Gore Sr., who served continuously in the House and Senate from 1939 to 1971. It was one political dynasty against another! In such cases, not even I can prevent a dynasty from winning.\n\nHereditary elders like George H.W. Bush, Bill Clinton and Donald Trump seek to form dynasties because they think it will preserve their accomplishments and organization. Placing an heir on the 1600 Pennsylvania Avenue NW throne lends a kind of temporary immortality to an ex-president, especially if his policies continue and his followers continue to thrive.\n\nGiven everything we know about our current president, nothing short of putting a gold “Trump” sign on the White House could make him happier than extending his family’s lease on the property. Each of those scenarios is equally unlikely.\n\n******\n\nHow serious is Parscale about the Trump dynasty? As New York Times reporter Maggie Haberman wrote on Monday about Parscale’s prediction, some Trump supporters “chalked up the ‘dynasty’ remark” to puffery designed to sate the family’s hunger for public flattery. Send flatter via email to Shafer.Politico@gmail.com. My email alerts puff my Twitter feed. My RSS feed rejects all blandishments.", "description": "There will be no President Ivanka. No President Jared. And certainly no President Donald Jr.", "authors": ["Jack Shafer"], "top_image": "https://static.politico.com/dc/7a/77622f234a1594b114aae510b0af/20190909-trump-family-gty-773.jpg", "published_at": "2019-09-09"}