{"pub": "usatoday", "url": "https://usatoday.com/story/news/politics/2019/10/24/doj-inquiry-into-russia-investigation-shifts-criminal-probe/4091645002", "downloaded_at": "2019-10-25 03:28:52.533877+00:00", "title": "DOJ inquiry into origins of Russia investigation has shifted to criminal probe", "language": "en", "text": "USA TODAY\n\nWASHINGTON – The Justice Department's politically-charged inquiry into the origins of the Russia investigation has shifted to a criminal probe, a person familiar with the matter said late Thursday.\n\nThe move is all but certain to fuel fresh suspicion among Democrats that Attorney General William Barr is providing political cover to President Donald Trump, who has repeatedly disparaged former special counsel Robert Mueller's two-year investigation into the Kremlin's intervention in the 2016 election as a \"witch hunt.\"\n\nBarr launched the inquiry in April into whether federal investigators abused their surveillance authority as they sought to understand Russia's interference during the 2016 presidential campaign.\n\nBarr later appointed Connecticut's chief federal prosecutor, John Durham, to manage the investigation.\n\nIt was unclear Thursday evening when the examination moved from an administrative review to a criminal investigation. The development was first reported by The New York Times.\n\nJames Baker, the FBI’s former general counsel who oversaw the launch of the Russia investigation, and Michael Bromwich, attorney for former FBI deputy director Andrew McCabe, declined to comment.\n\nRep. Mark Meadows, R-North Carolina, praised Barr after news of the criminal investigation broke.\n\n“If true, this shows Bill Barr is doing EXACTLY his job: following the facts,” Meadows, former chairman of the House Freedom Caucus, said on Twitter. “Those who damaged America and broke the law to spread this hoax are about to face accountability.”\n\nSen. Ted Lieu, D-California, tweeted that the Mueller investigation resulted in 34 indictments and eight convictions. Barr, he said, “is now essentially trying to say that none of that should have happened.\"\n\nBarr: 'I think spying did occur'\n\nWhen he first announced the inquiry during testimony before a Senate subcommittee in April, Barr expressed concern about the FBI's use of surveillance of associates of Trump during the presidential campaign.\n\nAt the time, Barr said he did not know whether officials had done anything wrong.\n\nThe attorney general said he planned to examine the \"genesis and the conduct\" of the FBI's investigation into possible ties between the Trump campaign and Russia.\n\n\"Spying on a campaign is a big deal,\" Barr told lawmakers then. \"I think spying did occur. The question is whether it was adequately predicated.\"\n\nDurham has led several high-profile special investigations, including an examination of the FBI's handling of criminal informants in Boston during the Clinton administration, which led to the prosecution of former agent John Connolly. He led an inquiry during the George W. Bush administration into the CIA's destruction of videotapes depicting the torture of terror detainees.\n\n'The FBI doesn't spy':Comey slams Barr for spying claim, 'misleading' Mueller summary\n\nTrump has asked world leaders to assist inquiry\n\nBarr has personally overseen the inquiry and has sought assistance from law enforcement partners around the globe, including those in Italy and the United Kingdom.\n\nWhite House officials confirmed last month that Trump had asked multiple countries, including Australia, to help Barr's inquiry.\n\nSpying, treason and politics:President Trump ups the stakes in Russia probe battle despite scant evidence\n\nAustralia played a pivotal role in the FBI's decision to launch the initial investigation into Russia interference in 2016.\n\nAustralia's top diplomat in the United Kingdom passed information to U.S. authorities after a meeting with George Papadopoulos, a Trump campaign foreign policy adviser. The diplomat said Papadopoulos confided that Russians were offering damaging information on then-Democratic presidential candidate Hillary Clinton.\n\nPapadopoulos ended up serving two weeks in prison for lying to FBI agents about his interactions with a Russian national while working for the Trump campaign. Trump has dismissed Papadopoulos as a low-level campaign aide.\n\nHe was the first former Trump aide to be sentenced in Mueller's investigation of Moscow's interference operation.\n\nThe disclosure about Barr's probe comes as a House impeachment inquiry has elicited damning testimony from current and former Trump administration officials who have outlined the president’s efforts to press Ukraine to investigate political rival and former Vice President Joe Biden – or risk losing millions in military aid.\n\nThe impeachment investigation has focused on Trump's July 25 telephone call with Ukraine President Volodymyr Zelensky. Trump repeatedly invoked Barr's name during the call, indicating that the attorney general would assist a Ukrainian inquiry into an energy company where Biden's son, Hunter Biden, served as a board member.\n\nNeither the former vice president nor his son have been accused of wrongdoing by the Ukrainian government.\n\nJustice Department officials said Barr didn't know Trump had suggested that he work with the Ukrainian president until weeks after the call, and Barr didn't contact Ukrainian officials.\n\nRelated probe into surveillance warrants is wrapping up\n\nThe Justice Department's inspector general has been conducting a parallel examination to Barr's and is expected to release its own report in a matter of weeks.\n\nInspector General Michael Horowitz told lawmakers Thursday that his report on the use of surveillance warrants during the Russia investigation is going through a review process that’s “nearing completion,” according to a letter obtained by CBS News.\n\nHorowitz told lawmakers he expects the final report to be released to the public “with few redactions.”\n\nHorowitz launched his review in March 2018 in response to requests from lawmakers and then-Attorney General Jeff Sessions. The inspector general looked into whether the FBI violated the Foreign Intelligence Surveillance Act, or FISA, when it sought court-ordered surveillance of former Trump campaign aide Carter Page in late 2016 as part of the Russia investigation.\n\nThe surveillance of Page has long animated Trump and Republicans and has fueled claims of spying – even treason – against former top law enforcement officials.\n\nContributing: Kristine Phillips", "description": "The move is likely to fuel suspicion among Democrats that the attorney general is providing political cover to President Trump.", "authors": [], "top_image": "https://www.gannett-cdn.com/presto/2019/10/12/USAT/f86e600e-be79-4f42-99f4-9834a2e4a8f4-AP_William_Barr_Notre_Dame.JPG?crop=3829,2154,x0,y215&width=3179&height=2154&format=pjpg&auto=webp", "published_at": "2019-10-24"}