{"pub": "cbs", "url": "https://cbsnews.com/news/thomas-piketty-new-book-capital-and-ideology-a-1200-page-tome-about-abolishing-billionaires", "downloaded_at": "2019-09-12 23:46:59.233644+00:00", "title": "Economist Piketty's latest book a 1,200 page tome about abolishing billionaires", "language": "en", "text": "Thomas Piketty's sequel to his 2013 best-seller \"Capital in the 21st Century\" stretches to more than 1,200 pages.\n\nThe new book, published today in France, advocates for measures that would reduce income inequality, such as taxing some wealthy estates as much as 90%.\n\n\"It's time to go beyond capitalism,\" Piketty told a French publication.\n\nThomas Piketty is back with a new economics book – and it's even weightier than his 2013 700-page best-seller \"Capital in the 21st Century.\" The new book, called \"Capitalism and Ideology,\" tops 1,200 pages and delves into the political ideologies behind income inequality, while providing radical solutions for reversing the world's wealth disparities.\n\n\"It's time to go beyond capitalism,\" Piketty told the French publication L'Obs earlier this month.\n\nThat message may find a welcome audience among some in the U.S., given that the gap between the top 1% of income earners and the bottom 99% has widened to levels not seen since the 1920s. Several hopefuls for the Democratic presidential nomination have vowed to fix the growing gulf between rich and everyone else, including Senator Elizabeth Warren.\n\nHer plan to tax the fortunes of America's richest families is based on research by Emmanuel Saez, an economist from the University of California Berkeley, who frequently publishes academic research with Piketty.\n\nBy the way, Capital and ideology is published today in France! In a few months in English and other languageshttps://t.co/7ps5Pi7MgG pic.twitter.com/GnokeItioT — Thomas Piketty (@PikettyLeMonde) September 12, 2019\n\nPiketty's \"Capital in the 21st Century\" sought to explain the growing gulf between rich and poor, with his research finding the rate of return on capital has far outpaced the rate of economic growth. The result in the U.S. has been mounting income inequality, as the wealthiest Americans gain a growing share of the nation's economic spoils. His core argument from the research — if you're not born rich, you won't become rich — posed formidable challenges to defenders of the economic status quo and put into question the viability of the American Dream.\n\nHis new book focuses on economies outside the West, with references to India and China and analyses of communist, colonial and slave-owning economies, according to Bloomberg. It also explores the ideologies behind inequality, challenging the notion that the growing concentration of wealth in the U.S. and elsewhere represents a natural state of affairs, the publication added.\n\nWhere is the middle class heading?\n\nThe solutions suggested by Piketty in his newest doorstopper would upend the current capitalist system, where corporate boards are largely composed of wealthy, well-connected shareholders, and taxes on capital are lower than on income. His proposals, according to The Guardian, include:\n\nHalf of the seats on company boards should filled by employees.\n\nNo shareholder should have more than 10% of a company's voting power.\n\nTaxes as high as 90% on the wealthiest estates.\n\nA lump-sum investment of $132,000 provided to everyone when they turn 25 years old.\n\nA personalized carbon tax that would be based on an individual's contribution to climate change.\n\n\n\nEven so, Americans will have to wait to get their hands on an English-language copy of Piketty's newest book. While it's published today in France, the English release won't be available until March 2020.", "description": "The famed economist has some ideas for reducing income inequality, like a 90% tax on the wealthiest estates", "authors": ["Aimee Picchi"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2014/04/23/a32a63c5-9392-4ea3-b329-d78de6706bf0/thumbnail/1200x630/168b1eb8fb6de1bffe08ae339bf0d0ff/piketty.jpg", "published_at": "2019-09-12"}