{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/aap/article-7595445/Ex-skipper-Slack-calls-rugby-review.html", "downloaded_at": "2019-10-21 06:48:23.997728+00:00", "title": "Ex-skipper Slack calls for rugby review", "language": "en", "text": "Former Australian captain Andrew Slack is among the voices calling for an independent review of both the Wallabies coaching role and the Rugby Australia hierarchy following the World Cup debacle.\n\nWith Michael Cheika falling on his sword after their disappointing quarter-final exit in Japan on Saturday, there are demands that more figures from Rugby Australia follow him out the door.\n\nDirector of rugby Scott Johnson, who came on board in January to rein in Cheika after a series of dismal results, is set to conduct a World Cup review and find the new Wallabies coach.\n\nRather than rush to appoint Cheika's replacement, Slack said he'd like to see an independent audit of Australia's performance at the World Cup and the months preceding it.\n\nFormer Test lock turned television commentator and also president of the Players' Association Justin Harrison is another pushing for an autonomous review.\n\nSlack said that rugby IQ from former players such as Harrison and Dan Herbert should be tapped into and they should have a voice in the review and Johnson should be kept out of it.\n\n\"It should be an independent review - I don't know how you could contemplate it being legitimate if it's not independent,\" Slack said.\n\n\"With Scott's role he will need to be investigating certain aspects but in terms of that overall bigger picture he shouldn't be running that.\"\n\nSlack said a review of Cheika couldn't be completed without a probe into those who appointed him and the RA board should be willing if they felt they had done a good job.\n\nHe also said that some criticism of CEO Raelene Castle was unfair given a \"number of poor decisions\" were made before she started her tenure in early 2018.\n\nGiven Australia's next Test isn't until midway through next year Slack said Rugby Australia shouldn't be rushed into appointing a new coach.\n\n\"We shouldn't have a gun put at our head - we've got to be not bullied by potential candidates,\" said Slack who led the Wallabies on the triumphant 1984 Grand Slam tour and to a Bledisloe Cup series victory on New Zealand soil two years later.\n\n\"The right person will be the one who wants the job, not because of the money or the praise but they want the Australian job to do the best by the team and country.\"\n\nSlack had no issue with a Kiwi taking the top job but said if the next coach was to be Australian there was a dearth of stand-out candidates.\n\nHe said a conversation must be had with England's Australian coach Eddie Jones, who orchestrated the Wallabies' World Cup downfall, about him returning to the position he held for five years until 2005.", "description": "Former Australian captain Andrew Slack is among the voices calling for an independent review of both the Wallabies coaching role and the Rugby Australia...", "authors": ["Australian Associated Press"], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-21"}