{"pub": "townhall", "title": "Arizona AG Suing Over Outrageous University Tuition Increases", "url": "https://townhall.com/columnists/rachelalexander/2019/08/26/arizona-ag-suing-over-outrageous-university-tuition-increases-n2552165", "language": "en", "published_at": "2019-08-26", "downloaded_at": "2019-09-02 07:06:44.818568+00:00", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nThere is a student debt crisis, but the solution is not providing free tuition courtesy of the taxpayers. As I’ve covered previously, it hasn’t worked in Sweden, where students merely take out loans for room and board instead. What few people are looking at is the massive increases in tuition by universities. This forces students to take out higher loans.\n\nUniversity tuition is skyrocketing everywhere. But tuition at Arizona public universities is about the worst. The Arizona State Constitution says that tuition at state colleges “shall be as nearly free as possible.” But since 2003, the Arizona Board of Regents increased tuition and mandatory fees at the state’s three public universities by 315 to 370%. Tuition is now $10,792 to $12,228 per year. If you live on campus, the full price is $26,923 to $28,900 per year.\n\nIn contrast, the consumer price index increased only 36% over the same period. Median family income in Arizona increased only 27%. Tuition at other public 4-year universities around the country increased by around 100% — still far less than at Arizona’s public universities. Arizona public university tuition went from around the 25th percentile nationally to over the 75th percentile.\n\nThe regents arrogantly think they know best what is “affordable.” But they abandoned their responsibility to act as a check on the flagrant spending by university presidents. Since Michael Crow became president of Arizona State University in 2002, tuition has gone up dramatically.\n\nThe regents require students to pay for other, noneducational things in order to get an education. These include athletic, recreation, technology and health fees. Part time and online students are hit harder than full time students, with higher charges per credit hour.\n\nCommunity colleges are about three times less expensive. This is evidence that the increase in tuition at the universities is not going to instruction, but rather other university pursuits. What are they spending the money on? Politically correct research and programs?\n\nThe universities waste money like it’s going out of style. University of Arizona President Robert Robbins gave an $850,00-a-year job to longtime friend Michael Dake last year. A man who was fired by Dake recently filed a notice of claim against the university, which stated that Robbins had been warned that Dake was not qualified for the position. The job oversaw the university’s medical schools. He said the search committee co-chair told Robbins the hire would be a grave mistake that “could very likely cost you your presidency.”\n\nA list was compiled a couple of years ago of the highest paid state employees. The top 260 were all employees at state universities. The jobs were mostly related to sports or were in the medical industry. David Garcia, who ran as a Democrat for governor in 2018, made $82,063 annually for teaching only three classes that year at ASU. Two were online and the class he taught in person lasted only six weeks. He had time to campaign across Arizona, travel to Hollywood for a fundraiser and spend many days in Washington, D.C.\n\nArizona State University fired head football coach Todd Graham a couple of years ago, costing the university $12 million to buy him out. The University of Arizona fired head football coach Rich Rodriguez about the same time, costing $6.28 million in a buyout.\n\nAt the same time, while Arizona residents are being ripped off, the universities are providing subsidized tuition for illegal immigrants. Illegal immigrants who enroll in DACA, Deferred Action for Childhood Arrivals, are only required to pay 150% of the in-state tuition rate. But Arizona enacted Prop. 300 in 2006, which prohibits education subsidies to illegal immigrants. In addition, the Arizona Supreme Court ruled last year that state universities and community colleges can’t offer in-state tuition to DACA recipients. But somehow, arrogantly, the regents have ignored that ruling. ASU even has a special page dedicated to DACA and other illegal immigrants.\n\nFortunately, Arizona has an attorney general who isn’t afraid to take on this racket. Arizona AG Mark Brnovich filed a lawsuit against the regents over the tuition increases and subsidies to illegal immigrants, which has been winding its way through the courts over the last couple of years. He is taking on some powerful interests, but he doesn’t care. He is a principled conservative who wants to actually solve the problem of the student debt crisis, not just put a band-aid on it like some Democratic candidates for president would do with their free tuition plan.\n\nThis isn’t the only lawsuit Brnovich has going against the universities. He also sued them earlier this year for real estate projects by ASU that he says are illegal. ASU rents out its tax-exempt property to favored private businesses, Brnovich alleges. One of the biggest land deals was a development at Tempe Town Lake that State Farm occupies. Why are taxpayers subsidizing these private businesses?\n\nThe problem lies with the irresponsible regents who approve of the wasteful spending and tuition hikes. They are acting like typical Democrats who get into office and recklessly spend the public’s money. Brnovich says, “The costs for paying for college are going up faster than almost anything. Instead of demanding debt forgiveness, maybe it’s time to start asking what the hell are the people doing who oversee public universities. They’re out of touch. Nothing demonstrates that more than what is happening in Arizona.” The governor needs to appoint more accountable people as regents.", "description": "There is a student debt crisis, but the solution is .09/02/2019 3:05:33AM EST.", "authors": ["Rachel Alexander", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/105/c67cfbad-4d39-4408-ae70-412d83fcb452.jpg"}