{"pub": "guardian", "url": "https://theguardian.com/food/2019/sep/05/canned-applause-why-tinned-food-isnt-just-for-brexit", "downloaded_at": "2019-09-05 10:30:05.428861+00:00", "title": "Canned applause: why tinned food isn’t just for Brexit", "language": "en", "text": "OK, stockpiling jokes really aren’t funny any more, but the following thoughts have absolutely nothing to do with the political disgrace that engulfs us. It is purely by coincidence that I am thinking a lot about food that works in cans. That, and bodybags.\n\nThere is a category of food that is denatured by the canning process yet still delicious – such as sweetcorn, which loses its bite and takes on an almost waxy texture that is charming, maybe nostalgically. It tastes of church fetes and train journeys, diets you went on in teenagehood before you heard of the glycemic index. Spaghetti hoops, likewise – nothing like spaghetti in any real sense (unnaturally soft, sauce like service station ketchup) but intensely pleasing in a toast context, a delinquent double-carb on a par with a chip butty. Baked beans are universally faultless; I don’t even mind the low-salt and sugar versions. These are foods it is not possible to ruin.\n\nThat is not what I am interested in, however; not for the moment. I am interested in the chic, in the statement, in the can you could open and serve to your spouse’s boss if you were Samantha from Bewitched (Google that, millennials). I’m interested in the food that turns to silk, to spun gold.\n\nObviously, fish: anchovies of any provenance will work as a flavour bomb, which is plainly because of the salt more than anything else. Your standard supermarket anchovy tastes like a fish-infused crystallised salt, and there’s nothing wrong with that. But if you want to make the anchovy the star – the classic means of doing so is with bread, butter an inch thick, fish and shallots – they have to come from Santoña, on the north coast of Spain, where they only catch them between March and June, to make sure they are young. The eye-wateringly expensive Don Bocarte brand is said to use less salt, but they don’t taste any less salty, just fleshier, softer, less harsh, more miraculous.\n\nThe fullest possible range of fish you could put in a tin is displayed like a gallery in Sol e Pesca, a cafe in Lisbon, Portugal: elephant tuna and abalone, mussels (smoked and not), octopus, squid. Octopus and mussels stay closest to their fresh texture, although canned tuna has been legitimised with familiarity and nobody would want it to taste as it does fresh.\n\nYou would think you could write off all vegetables, and most of them you can: anything prized for its crunch is out, and the best thing you could do with a tinned carrot is to mash it before you start, so you are not expecting anything. But wait: hearts of palm take on a beautiful and quite varied texture, almost melting in the middle and crunchy at the outside. They could never remind you of anything else. Vegetables that would have been stewed anyway adapt brilliantly to canned life. The worst thing you could say about most canned ratatouille is that it is under-seasoned.\n\nI could not name a more stylish can-based dish than ackee and callaloo, which is eaten for breakfast in Jamaica but is deeply savoury and thus adaptable. Ackee is a fruit, known for its beautiful pip like a conker but, when stewed and canned, it takes on the texture of scrambled egg; honestly, it could almost be mistaken for egg. Callaloo is a deep-green leaf vegetable, also stewed; depending on your recipe, it is the consistency of saag, and seems to have a buttery slickness without butter. Together, ackee and callaloo make quite a sloppy ensemble, but you wouldn’t want it any other way.\n\nOf meat, I remain sceptical; meatballs and frankfurters taste like hospital food when you can them. Classic French stews often need something from a can or they will take you a month to prepare – confit duck legs for a cassoulet, maybe – and those retain their integrity fine, if you can swallow their wowsome expense (though it would be rich of me to complain, after those anchovies).\n\nCheese has been the canning surprise of this investigation; I mean, I would not count stilton in a pot and nor would I entertain a tinned cheddar, even if I had ever seen one. But there is a Turkish manufacturer, Gazi, that does a range of cured sheep and goats’ milk cheeses that are grouped together as “nomad’s cheese” because, before cans were invented, they were cured and wrapped in animal skin to preserve them. Canned, they have an extraordinary shelf life of two years or so. They do not taste like classic feta; they are a bit drier and crumblier despite their brine and have a more delicate flavour. If anything, they taste like cheeses from Georgia, almost neutral unless you concentrate, and then incredibly complex. You could do anything with these cheeses – salad, pastries, chop them into chickpeas. They are wonderful, with beautiful graphics featuring a surprised goat. Or sheep.\n\nI pass this on only in case of impromptu entertaining. No other reason, none at all.", "description": "From the expensive delights of Spanish anchovies to Jamaica’s humbler ackee or callaloo, some things actually taste all the better for coming in a can", "authors": ["Zoe Williams"], "top_image": "https://i.guim.co.uk/img/media/09665aa2d469ec6311fe8ebf39c7c6a7678214b4/302_376_4574_2745/master/4574.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0e43b277f9cd71e3a70e5bbe8db1b6f7", "published_at": "2019-09-05"}