{"pub": "fox", "url": "https://foxnews.com/sports/bryce-harper-jealousy-nationals-world-series", "downloaded_at": "2019-10-19 11:05:42.512818+00:00", "title": "Bryce Harper says there's no 'jealousy' after Nationals make World Series without him", "language": "en", "text": "Even though Bryce Harper will be watching his former team, the Washington Nationals, from the sofa as they make their World Series debut, the six-time MLB all-star says he isn't jealous of their recent success.\n\n\"I think it's about being able to be the person that I am and not saying to myself, 'Oh my gosh, I can't believe I'm not a National.' Or, 'Oh my gosh, those guys are doing what they're doing. I can't believe it. I'm so jealous,'\" Harper told The Athletic. \"No. I'm so happy for them. You know how hard it is to get into the postseason and win games. For them to be able to put it together this year the way they have, it's an amazing thing.\"\n\nWASHINGTON NATIONALS TROLL BRYCE HARPER AHEAD OF NLCS-CLINCHING VICTORY\n\nHarper played seven seasons with the Nationals, winning rookie of the year in 2012 while being voted as the 2015 National League MVP. The Nationals made the playoffs in 2012, 2014, 2016 and 2017 with Harper on the team, but were never able to make it past the NL Division Series.\n\nHe left the Nationals and signed a 13-year $330 million contract with the Philadelphia Phillies in the off-season after reportedly turning down a 10-year $300 million extension with Washington last winter. In his first season, the Phillies could only muster an 81-81 record.\n\nHarper says he doesn't regret that decision, saying \"jealousy isn't good.\"\n\n\"I made my decision, and that was my decision,\" Harper said. \"And it was the final decision that I made. You know, jealousy isn't good. For me, it's about having the gratitude to go out and do what I do each day and not having an attitude toward anybody else.\"\n\nWASHINGTON NATIONALS SWEEP ST. LOUIS CARDINALS FOR DC'S FIRST TRIP TO WORLD SERIES IN 86 YEARS\n\nHarper's exit gave the Nationals the cap space to sign pitchers Patrick Corbin and Anibal Sanchez to the roster.\n\n\"It was kind of the perfect storm for them,\" Harper said. \"Not signing me, they were able to go out and get the starting pitching that they needed and the pitching that they needed for their bullpen.\"\n\nWhen Harper signed with the Phillies he mistakenly stated that he \"couldn't wait to bring a title back to D.C\" even though his new team was in Philadelphia.\n\nCLICK FOR THE ALL-NEW FOXBUSINESS.COM\n\nThe Nationals must have remembered his D.C. quote based on a tweet by the team before their game 4 victory against the Cardinals, which sent them to the World Series.", "description": "Even though Bryce Harper will be watching his former team, the Washington Nationals from the TV screen following their World Series appearance, the MLB all-star says he isn't jealous of their recent success.", "authors": ["David Aaro", "David Aaro Is A Freelance Reporter At Fox News Digital Based In New York City."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/MLB-Bryce-Harper2.jpg", "published_at": "2019-10-18"}