{"pub": "reuters", "url": "https://widerimage.reuters.com/story/rohingya-violence-exposed-in-shocking-photos", "downloaded_at": "2019-09-27 02:13:29.362534+00:00", "published_at": "2019-09-27", "title": "Violence against Rohingya exposed in ‘shocking photos’", "language": "en", "text": "Advertisement\n\nWhen a Rohingya refugee boat capsized on the Bangladesh coastline, photographer Damir Sagolj rushed to the scene and saw locals collecting the drowned and arranging their bodies next to the road.\n\nIn the torrential night-time rain, the sheets that covered them clung to the bodies.\n\n\"You couldn't see how many were under the sheets, but what I could see was that most were children,\" Sagolj said.\n\nHamida, a Rohingya refugee woman, weeps as she holds her 40-day-old son after he died as their boat capsized before arriving on shore in Shah Porir Dwip, Teknaf. The photo he captured was one of a series awarded the Pulitzer Prize for feature photography on Monday, described by the judging committee as \"shocking photographs that exposed the world to the violence Rohingya refugees faced in fleeing Myanmar.\"\n\nRohingya refugees are reflected in rain water along an embankment next to paddy fields after fleeing from Myanmar into Palang Khali, near Cox's Bazar. The latest crackdown by authorities and Buddhist civilians against the Rohingya population in Myanmar’s Rakhine state created a mass exodus of over 600,000 Rohingya children, women and men who fled their homes at the end of 2017. The refugees have reported killings, rape and arson on a large scale, and senior United Nations officials have described the violence against the Muslim Rohingya population as a \"textbook example of ethnic cleansing.\"\n\nRohingya refugees scramble for aid at a camp in Cox's Bazar. Myanmar has denied ethnic cleansing or systematic human rights abuses, saying it waged a legitimate counter-insurgency operation. The army has said its crackdown was provoked by the attacks of Rohingya militants on more than two dozen police posts and an army base last August. Reuters has covered the plight of the Rohingya since 2012, but in 2017 it became clear that the scale of this exodus was far larger than previous migrations.\n\nAn exhausted Rohingya refugee woman touches the shore after crossing the Bangladesh-Myanmar border by boat through the Bay of Bengal. For the next several months, a team of photographers, including Sagolj, Cathal McNaughton, Danish Siddiqui, Soe Zeya Tun, Adnan Abidi, Mohammad Ponir Hossain, and Hannah McKay, working under the direction of Asia Picture Editor Ahmad Masood, documented the journeys of refugees by sea on rickety fishing boats and over land through barbed wire and along other routes. They also visited refugee camps to tell the stories of the new lives the Rohingya built and the scars they brought with them. While the size of camps expanded, one thing that never changed was the stories the refugees brought with them.\n\nMohammed Shoaib, 7, who was shot in his chest before crossing the border from Myanmar in August, is held by his father outside a medical centre near Cox's Bazar. \"The same horror stories of killings and rape and massacres that we were hearing when the first refugees started crossing in August and September, the exact same – if not worse – stories were being told three months after that,\" Sagolj said. Even as the team captured images of the refugees at their most vulnerable – mourning mothers, scarred children, survivors of violent attacks – the journalists found that the refugees were surprisingly open. The photographers experienced almost no resistance from refugees as they photographed the refugees and asked about their experiences.\n\nThe remains of a burned Rohingya village is seen in this aerial photograph near Maungdaw, north of Rakhine State, Myanmar. \"I had the impression that these people want everybody to know what happens to them,\" Sagolj said. \"They all really wanted their story to be told.\"", "description": "When a Rohingya refugee boat capsized on the Bangladesh coastline, photographer Damir Sagolj rushed to the scene and saw locals collecting the drowned and arranging their bodies next to the road.", "authors": ["Reuters Photographers", "Andrea Januta"], "top_image": "https://photos.wi.gcs.trstatic.net/WBTnOVC7qqta06gXHeKsQ6kLHoYc5IU53HuCvd_Ul2OhawbqABZaUACvhnqic92hRHePOiCKCuSWXSOCwiXR8AoZoVRXw_cUYULu74WaGPRTrUjUBjHEXLOHeuJx5B5Z"}