{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7626443/Bulgaria-play-home-game-closed-doors-racism-sanction.html", "downloaded_at": "2019-10-29 15:19:37.195585+00:00", "title": "Bulgaria to play next home game behind closed doors as...", "language": "en", "text": "Bulgaria have been ordered to play their next competitive home game behind closed doors with a further match suspended for two years following the racist behaviour of their fans during the Euro 2020 qualifier against England on October 14.\n\nA section of supporters at the match in Sofia’s Levski Stadium directed racial abuse at England’s black players, while some were also seen making Nazi salutes.\n\nThe Bulgarian Football Union was also fined 75,000 euros (£64,641) for “the racist behaviour of its supporters and the throwing of objects”.\n\nBulgaria fans in the stands at the qualifier against England on October 14 (Nick Potts/PA)The punishment, announced by UEFA on Tuesday afternoon, exceeds the standard sanction for a second offence at a home match within a period of five years, which would normally be one match behind closed doors.\n\nThe sanction means Bulgaria’s qualifier against the Czech Republic on November 17 will be played behind closed doors.\n\nThe match against England was stopped in the 28th minute and the first step of UEFA’s anti-racism protocol – a public address announcement calling on the abuse to stop – was enacted.\n\nThe abuse continued and Croatian referee Ivan Bebek halted the match again just before half-time, though it was later confirmed that this did not constitute the second step of the protocol under which the referee leads the teams from the field temporarily.\n\nGreat performance and I’m proud of the togetherness we showed in some disgraceful circumstances. Racism has no place in society or football. It needs stamping out for good. Also a massive congrats to @OfficialTM_3 on a great debut 👏 #ThreeLions pic.twitter.com/yS9pEFeXie — Harry Kane (@HKane) October 14, 2019\n\nMonkey chanting and booing directed at England’s players and staff could still be heard during the second half, but the match was completed with England winning 6-0.\n\nThe president of the BFU, Borislav Mihaylov, resigned the following day, with UEFA president Aleksander Ceferin saying the football family had to “wage war” on racism.\n\nThe Bulgarian federation was also fined 10,000 euros (£8,619) for causing disturbance during a national anthem, while the English Football Association was fined 5,000 euros (£4,309) for the same offence.\n\nThe charge against the FA related to an insufficient number of travelling stewards will be heard on November 21 after the association requested more time to present its defence.\n\nPiara Powar, the executive director of the Fare network which works to combat racism and discrimination in football across Europe, felt Bulgaria should have been disqualified from the competition.\n\n“We welcome the speed of this decision, but we are disappointed that Bulgaria will not be expelled from the Euro 2020 qualifying competition given their previous record, and obvious inability to deal with the problems they face,” he said.\n\nBulgaria fans in the stands after an announcement over the tannoy during the UEFA Euro 2020 qualifying match at the Vasil Levski National Stadium (Nick Potts/PA)\n\n“We think that the evidence and circumstances of this match would have justified European football being given a stronger signal on the need to tackle racism.\n\n“Obtaining justice for racist acts is not easy in any setting, it is clear that football is no exception.\n\n“We will be in touch with UEFA to explore options ￼and maintain that Bulgaria and others in the same situation fundamentally reappraise how they deal with racism.”", "description": "Bulgarian supporters racially abused some of England´s black players.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/15/wire-20332192-1572362088-522_636x382.jpg", "published_at": "2019-10-29"}