{"pub": "reuters", "url": "https://reuters.com/article/us-lebanon-protests/demonstrators-fill-lebanons-streets-in-third-day-of-fiery-protests-idUSKBN1WY0AC", "downloaded_at": "2019-10-19 14:13:01.066614+00:00", "title": "Demonstrators fill Lebanon's streets in third day of fiery protests", "language": "en", "text": "BEIRUT (Reuters) - Thousands of demonstrators poured into Lebanon’s streets on Saturday for a third day of anti-government protests, directing growing rage at a political elite they blame for driving the country to the economic brink.\n\nSupporters of Lebanon's Hezbollah leader Sayyed Hassan Nasrallah gesture as they listen to his televised speech in Baalbeck, Lebanon October 19, 2019. REUTERS/Aziz Taher\n\nFrom the south to the east and north, protesters blocked roads, burned tyres and marched through the streets to keep the momentum going despite gunmen loyal to Shi’ite Muslim Amal movement appearing with heavy guns to scare them away.\n\nIn central Beirut, the mood was fiery and festive with protesters of all ages waving flags and chanting for revolution outside upmarket retailers and banks that had their storefronts smashed in by some rogue rioters the night before.\n\n“This country is moving toward total collapse. This regime has failed to lead Lebanon and it must be toppled and replaced,” said Mohammad Awada, 32, who is unemployed. “We no longer feel we have a state. This state tramples on all institutions.”\n\nPrime Minister Saad al-Hariri gave his government partners a 72-hour deadline on Friday to agree on reforms that could ward off economic crisis, hinting he may otherwise resign.\n\nThe latest unrest erupted out of anger over the rising cost of living and new tax plans, including a fee on WhatsApp calls, which was quickly retracted after protests - the biggest in decades - broke out.\n\nIn a televised speech addressing the protests on Saturday, Hezbollah leader Sayyed Hassan Nasrallah said the group opposed the government’s resignation, and that the country did not have enough time for such a move given the acute financial crisis.\n\n“Everyone should take responsibility rather than being preoccupied with settling political scores while leaving the fate of the country unknown,” said Nasrallah, adding that Lebanon could face “financial collapse”.\n\n“All of us have to shoulder the responsibility of the current situation that we arrived at in Lebanon. Everyone should take part in finding a solution,” added Nasrallah, whose Iranian-backed Shi’ite group is Lebanon’s most influential.\n\nThe protests that swept villages and towns across the country on Friday recalled the 2011 Arab revolts that toppled four presidents. Lebanese from all sects and walks of life waved banners and chanted for Hariri’s government to go.\n\nRelated Coverage Lebanon's Hezbollah says does not want government to resign\n\nIn southern Lebanon, Amal militiamen loyal to parliamentary speaker Nabih Berri attacked peaceful demonstrators who tore his posters and chanted slogans denouncing him as corrupt. They prevented TV crews from filming the protests.\n\n‘COLLAPSE’\n\nIn the speech, Nasrallah predicted that imposing more taxes would lead to an “explosion” of unrest.\n\n“If we don’t work toward a solution we’re heading toward a collapse of the country, it will be bankrupt and our currency will not have any value,” he said.\n\n“The second danger is a popular explosion as a result of wrong handling of the situation,” Nasrallah said.\n\nIn the southern port city of Tyre protesters filled the streets.\n\n“I am taking part because over the last 30 years warlords have been ruling us. I am about to be 30 and my parents still tell me tomorrow will be better. I am not seeing better days ahead...,” said Sylvia Yaqoub, 29, a laboratory manager.\n\n“We want back the money they stole because 30 families are ruling five million people. We won’t accept this any longer.”\n\nThe government, which includes nearly all Lebanon’s main parties, has pledged no new taxes as it seeks to finalize a 2020 budget.\n\nThe budget could help it unlock billions of dollars pledged by international donors who have conditioned their support on long-delayed reforms to curb waste and corruption.\n\nSlideshow (6 Images)\n\n“The protests must continue because this is a matter of our dignity. We’ll be left humiliated otherwise,” said Miriam Keserwan, 28.\n\nRiot police in vehicles and on foot rounded up protesters late on Friday, firing rubber bullets and tear gas canisters to disperse riots in Beirut that grew violent as the night wore on, leaving streets strewn with glass and burning debris.\n\nLebanon’s internal security apparatus said 52 police were injured on Friday and its forces arrested 70 people.", "description": "Thousands of demonstrators poured into Lebanon's streets on Saturday for a third day of anti-government protests, directing growing rage at a political elite they blame for driving the country to the economic brink.", "authors": ["Laila Bassam", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191019&t=2&i=1442642050&w=1200&r=LYNXMPEF9I093", "published_at": "2019-10-19"}