{"pub": "cnn", "url": "https://cnn.com/2019/09/07/africa/south-africa-xenophobia-attacks-mckenzie-intl/index.html", "downloaded_at": "2019-09-07 13:40:07.197222+00:00", "title": "Xenophobia has reared its ugly head in the Rainbow Nation. African nations have had enough", "language": "en", "text": "Johannesburg, South Africa (CNN) When I travel out of South Africa, I am often asked a version of the same question. \"So, what will you be doing in Africa?\"\n\nThe question usually comes with a slightly horrified look, or with genuine puzzlement. And it generally comes from South Africans.\n\nAs a South African, who has lived extensively overseas, that detached way of looking at the rest of the continent - and its people -- has often puzzled me.\n\nThis week at least 10 people were killed , and hundreds arrested in a spasm of xenophobic violence and looting in Johannesburg, Pretoria and elsewhere in the country.\n\nMuch of the violence and crime targeted foreign African migrants from countries such as Nigeria, Ethiopia, Zambia, and Kenya.\n\nOf course, there is a difference between feeling separated from the continent and its people and violence against African migrants.\n\nBut is it part of a continuum?\n\nSouth Africa's isolation\n\nIn an essay recently re-published in the influential blog Africa is a Country (the title is ironic), South African writer Sisonke Msimang writes about experiencing this geographic dissonance on returning from exile in the 1990s.\n\n\"In the early years after I got 'home,' it took me some time to figure out how to respond to the idea that Africa was a place that began beyond South Africa's borders. I was surprised to learn that the countries where I had lived -- the ones that had nurtured my soul in the long years of exile -- were actually no places at all in the minds of some of my compatriots,\" she writes.\n\nShe writes about the influence of apartheid on South Africa's physical isolation from the rest of Africa -- but also of the clear and sometimes real sacrifices that countries like Nigeria, Zambia and Botswana (to name just a few) made to isolate that racist regime and support the liberation movement.\n\nA protestor gestures and holds a placard during a demonstration in front of the South African Embassy in Lusaka, Zambia on September 4, 2019\n\nMsimang's essay was written back in 2014.\n\nIt is still relevant because, since the dawn of democracy here, the shame of xenophobia has happened in South Africa again and again.\n\nAnd the toll of violence and hatred is devastating for its victims.\n\n\"They rob us over and over again\"\n\nWhen we met Hussein Osman before South Africa's election this year, he told us his shops in Soweto had been looted four times since fleeing violence in Somalia fifteen years ago.\n\n\"We live amongst South Africans and whenever there are elections, blackouts or no water they rob us over and over again,\" he said.\n\nHe said his grandson was killed during looting in August last year and his nephew was killed after being robbed just weeks before we spoke to him.\n\n\"I have lost hope since he died,\" said Osman.\n\nJUST WATCHED Anti-immigrant sentiments peak in South Africa election Replay More Videos ... MUST WATCH Anti-immigrant sentiments peak in South Africa election 03:22\n\nIn a divided nation like South Africa, where racism is universally and rightly condemned, the prejudice against foreigners is out in the open.\n\nI am often told by fellow South Africans that foreigners are to blame for crime, drugs, importing fake goods, taking people's jobs and their wives.\n\nThat casual xenophobia crosses racial lines and income brackets. And attacks on foreigners so frequent, they don't always generate headlines.\n\nDiplomatic tensions\n\nThis week was different, in part, because of the swift reaction from Nigeria, Zambia and other countries.\n\nNigeria has recalled its ambassador to South Africa, while its citizens retaliated against South African owned businesses. Nigeria has also offered to repatriate its citizens, while Zambia and Madagascar canceled soccer matches with Bafana Bafana.\n\nStudents marched on the South African High Commission in Lusaka, and Ethiopia's foreign ministry said rioters destroyed South African owned businesses and a popular South African clothing chain was looted in the Democratic Republic of Congo Thursday.\n\nAfter several days of incidents, South African President Cyril Ramaphosa did make a series of statements on his Twitter feed.\n\n\"The attacks on people who run businesses from foreign nationals is totally unacceptable,\" Ramaphosa said.\n\n\"There can be no justification whatsoever about what people are having a grievance over that they should go out and attack people from other countries because when they do so here, they should also know that fellow South Africans will be attacked in other countries,\" the President added.\n\nOnce a beacon of hope\n\nBut South African politicians, security chiefs and traditional leaders have, over the years, made contradictory statements about xenophobia. At times they have even incited the violence.\n\nYou get the sense that some South Africans don't take the calls for calm all that seriously, given the impunity of attacks.\n\nOnce, in the afterglow of Nelson Mandela, countries in the rest of Africa deeply admired South Africa. Now, they seem to have had enough.\n\nIn 1996, when South Africa passed its free constitution, then-President Thabo Mbeki gave his now-famous \"I am an African,\" speech.\n\nIn his poetic terms, sometimes treated cynically in today's South Africa, Mbeki's speech was aimed at bringing together a fractured nation.\n\nBut he also spoke about the beacon he hoped South Africa would become for the rest of the continent.\n\n\"This thing that we have done today, in this small corner of a great continent that has contributed so decisively to the evolution of humanity says that Africa reaffirms that she is continuing her rise from the ashes,\" he said.\n\nThe beacon of South Africa has faded -- and much needs to be done to repair those bonds.", "description": "More xenophobic attacks against immigrants in South Africa this week has led to tensions and a diplomatic fallout with other African countries that threatens to leave the Rainbow Nation isolated.", "authors": ["David Mckenzie"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190905130329-xenophobia-attacks-2-super-tease.jpg", "published_at": "2019-09-07"}