{"pub": "abcnews", "url": "https://abcnews.go.com/US/mlb-umpire-threatened-cival-war-president-trump-impeached/story?id=66497915", "downloaded_at": "2019-10-24 15:01:17.207063+00:00", "title": "MLB umpire threatened a 'Cival War' if President Trump is impeached: Report", "language": "en", "text": "Major League Baseball is looking into longtime umpire Rob Drake after he tweeted that he was ready to buy an AR-15 and threatened a civil war if President Trump was impeached, according to ESPN.\n\nInterested in Impeachment Inquiry? Add Impeachment Inquiry as an interest to stay up to date on the latest Impeachment Inquiry news, video, and analysis from ABC News. Add Interest\n\nDrake, 50, allegedly tweeted late Tuesday he \"will be buying an AR-15 tomorrow, because if you impeach MY PRESIDENT this way, YOU WILL HAVE ANOTHER CIVAL (sic) WAR!!! #MAGA2020.\"\n\nAnother tweet read, \"You can't do an impeachment inquiry from the basement of Capital (sic) Hill without even a vote! What is going on in this country?\" according to screenshots of the tweet posted online.\n\nPatrick Semansky/AP, FILE\n\nBoth tweets and Drake's Twitter account have since been deleted.\n\nDrake did not respond to ABC News for comment.\n\nMajor league umpire Rob Drake tweeted “I will be buying an AR-15 tomorrow, because if you impeach MY PRESIDENT this way, YOU WILL HAVE ANOTHER CIVAL WAR!!! #MAGA2020”, according to a copy of the tweet obtained by ESPN. MLB says it is aware of it. News: https://t.co/Qf7VMAXEoJ — Jeff Passan (@JeffPassan) October 23, 2019\n\nThe MLB's Umpire Association appeared to stand by Drake, calling him \"a passionate individual and an outstanding umpire.\"\n\n\"He chose the wrong way to convey his opinion about our great country. His posting does not represent the view of the MLBUA or reflect those of the umpires we represent,\" the statement read. \"The MLBUA supports all of the umpires who ensure fair play in the greatest game on earth. We are a group of individuals with diverse opinions and beliefs, united in our desire to continue our excellence officiating MLB games.\"\n\nDrake has been with MLB since 2010, according to his umpire profile. He is also the co-founder of Calling for Christ, a ministry of umpires in Major and Minor League Baseball, his profile reads.", "description": "MLB umpire Rob Drake tweeted he planned", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/rob-drake-ap-file-ml-191024_hpMain_16x9_992.jpg", "published_at": "2019-10-24"}