{"pub": "yahoo", "url": "https://news.yahoo.com/missing-woman-saved-spelling-sos-114414219.html", "downloaded_at": "2019-10-30 08:50:36.655278+00:00", "title": "Missing woman saved after spelling SOS in rocks in Sequoia National Park", "language": "en", "text": "VISALIA, Calif. – A Mississippi woman missing in Sequoia National Park was found safe Monday after rescuers spotted an SOS spelled out in rocks.\n\nThe SOS was nearly four miles from where rangers found Mary Joanna Gomez's car in the Little Baldy region of the Sequoias early Sunday.\n\nRescue teams combed the area for the 56-year-old but didn't have much to go until the SOS was spotted by a C-130 plane. The rocks were seen about three-and-a-half miles from the nearest trail. Gomez was found in steep terrain, rangers said.\n\nRangers planned to reunite the woman with her family Monday evening.\n\nRelated Video: Hiker Rescued From Quicksand at Utah Park\n\nGomez, a traveling nurse based in San Francisco, had last spoken with her daughter Thursday when she text messaged photos taken in different areas of Kings Canyon, according to park officials.\n\nShe was expected back to work Friday but missed her shift. Her family reported her missing to the San Francisco Police Department.\n\nEarlier this year, another hiker was reported missing in Sequoia National Park. On June 18, his body was found on the north side of Mt. Whitney.\n\nAfter locating Ling Dao's body, he was taken to the Ash Mountain Helibase and turned over to the Tulare County Coroner's Office.\n\nDao, 41, was reported missing to the Inyo County Sheriff’s Department on June 14 after he didn't show up back home.\n\nThis article originally appeared on Visalia Times-Delta: Sequoia National Park: Missing woman saved, spelled SOS in rocks", "description": "The SOS was nearly four miles from where Sequoia National Park rangers found Mary Joanna Gomez's car in the Little Baldy region early Sunday.", "authors": ["Joshua Yeager", "Visalia Times-Delta"], "top_image": "https://s.yimg.com/uu/api/res/1.2/J2sPuzZu3QRPHfJM5D0vEw--~B/dz0wO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-us/usa_today_news_641/cced9d91ba3ba662c747364af7a00ff6", "published_at": "2019-10-29"}