{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/jimmy-kimmel-joaquin-phoenix-joker-outtake-was-prank-on-director-2019-10", "downloaded_at": "2019-10-07 23:34:04.711562+00:00", "title": "The viral 'Joker' outtake with an angry Joaquin Phoenix originated as a prank on the movie's director", "language": "en", "text": "A \"Joker\" outtake aired on \"Jimmy Kimmel Live\" last week in which the actor Joaquin Phoenix is yelling at someone named \"Larry.\"\n\n\"Larry\" himself, the cinematographer Lawrence Sher, told Business Insider that the outtake originated as a prank on the movie's director, Todd Phillips.\n\nBut Phoenix is \"such a good actor\" that the joke didn't land on the set, according to Sher.\n\nVisit Business Insider's homepage for more stories.\n\nThe actor Joaquin Phoenix plays a man slowly spiraling into madness in \"Joker,\" but that doesn't mean he can't have a bit of fun in real life.\n\nA viral outtake from the set of \"Joker,\" which was presented on \"Jimmy Kimmel Live\" last week, showed Phoenix in his character's makeup yelling at someone named \"Larry\" to \"shut up\" with the \"constant whispering.\"\n\n\"Larry,\" in this scenario, is the movie's cinematographer, Lawrence Sher. Sher told Business Insider during an interview on Monday that the outtake originated as a prank on the \"Joker\" director Todd Phillips and that it was all Phoenix's idea.\n\n\"It was a bit,\" Sher said. \"Joaquin is actually a super playful guy and loose.\"\n\nSher said that Phoenix wanted to pull a prank on Phillips and \"get into a fight.\" So Phoenix requested another take of the scene they were filming, which takes place near the end of the movie after Phoenix's character, Arthur, dons the Joker's signature green hair and white makeup. But the joke went right over everyone's head.\n\n\"He's such a good actor that nobody even got it on set,\" Sher said. \"He played it too straight.\"\n\nSher had no idea that the clip would air on \"Jimmy Kimmel Live,\" and he was bombarded with messages from friends and family afterward.\n\n\"My son asked if it would hurt my reputation,\" he said.\n\nWatch the full \"Jimmy Kimmel Live\" clip below:", "description": "In the clip, which aired on \"Jimmy Kimmel Live\" last week, the \"Joker\" star Joaquin Phoenix is yelling at someone named \"Larry.\" We talked to Larry.", "authors": ["Travis Clark"], "top_image": "https://image.businessinsider.com/5d9b8f79707bdf3957585d86?width=1200&format=jpeg", "published_at": "2019-10-07"}