{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7552873/MLB-notebook-Yanks-Chapman-hurts-hand-celebration.html", "downloaded_at": "2019-10-09 02:46:17.815260+00:00", "title": "MLB notebook: Yanks' Chapman hurts hand in celebration", "language": "en", "text": "New York Yankees closer Aroldis Chapman injured his pitching hand in a postgame celebration at Target Field following the division series sweep of the Minnesota Twins on Monday night.\n\nChapman wore a large bandage and wrap over his left hand when he met with reporters following the champagne and beer celebration of the team's three-game sweep. The protective covering was the size of a small ham and any damage to the left-hander's hand was not visible.\n\n\"I was just celebrating, and everyone was jumping around,\" said Chapman through an interpreter. \"(My hand) got hit with a bottle. But it's fine.\"\n\nChapman's injury came after Yankees left-hander Zack Britton left the game in the eighth inning with an ankle injury. General manager Brian Cashman said neither injury is believed to be serious. The Yankees expect both powerful lefties to pitch in the ALCS.\n\n--Major League Baseball commissioner Rob Manfred told Oakland officials the Athletics could move to Las Vegas if the city doesn't drop a current lawsuit, mayor Libby Schaaf confirmed in a television interview.\n\nThe city of Oakland is trying to stop Alameda County from selling its share of the Coliseum to the team. The city and county share ownership of the stadium. The A's, who have sought a new stadium for years, are trying to build a ballpark on the Oakland waterfront.\n\nOakland wants Alameda County to sell its half of the stadium to the city instead of to the A's. A judge issued a temporary restraining order last week blocking the transaction. The mayor told KTVU she objected to the city's lawsuit.\n\n--Tampa Bay Rays third baseman Yandy Diaz was not in the starting lineup for Game 4 of the American League Division Series against the Houston Astros due to foot soreness.\n\nRays manager Kevin Cash said Diaz, who exited Monday's ALDS Game 3 in the second inning, would be available off the bench.\n\nJoey Wendle was listed at third base and batted seventh against Astros ace Justin Verlander.\n\n--St. Louis right-hander Adam Wainwright likely will be available to pitch in relief on two days' rest Wednesday during Game 5 of the National League Division Series against the Atlanta Braves, Cardinals manager Mike Shildt said.\n\nWainwright pitched 7 2/3 scoreless innings in St. Louis' 3-1 loss to Atlanta in Game 3 on Sunday.\n\nThe NLDS is tied 2-2 heading into the decisive Game 5 at Atlanta's SunTrust Park.\n\n\"I would expect Waino (Wainwright) to be available,\" Shildt said. \"Dakota (Hudson) may be a little different scenario. Listen, we've got guys we have a lot of confidence in. You never say never. Extenuating circumstances.\"\n\n--The Boston Red Sox have reassigned pitching coach Dana LeVangie and assistant pitching coach Brian Bannister, the team announced.\n\nLeVangie will remain in the organization as a pro scout. Bannister will assume the role of VP of pitching development, dealing primarily with minor leaguers.\n\nBoston finished 19th in the major leagues with a 4.70 team ERA this season. The staff endured injuries to veterans Chris Sale, David Price and Nathan Eovaldi.\n\n--Field Level Media", "description": "New York Yankees closer Aroldis Chapman injured his pitching hand in a  postgame celebration at Target Field following the division series sweep of  the...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-09"}