{"pub": "guardian", "url": "https://theguardian.com/cities/2019/oct/16/urban-living-makes-us-miserable-this-city-is-trying-to-change-that", "downloaded_at": "2019-10-16 13:42:58.055969+00:00", "title": "The 'Glasgow effect' implies cities make us sad. Can the city prove the opposite?", "language": "en", "text": "If you live in Glasgow, you are more likely to die young. Men die a full seven years earlier than their counterparts in other UK cities. Until recently, the causes of this excess mortality remained a mystery.\n\n“Deep-fried Mars bars,” some have speculated. “The weather,” others suggested. For years, those reasons were as good as any. In 2012, the Economist described it thus: “It is as if a malign vapour rises from the Clyde at night and settles in the lungs of sleeping Glaswegians.”\n\nThe phenomenon has become known as the Glasgow effect. But David Walsh, a public health programme manager at the Glasgow Centre for Population Health, who led a study on the excess deaths in 2010, wasn’t satisfied with how the term was being used. “It turned into a Scooby-Doo mystery but it’s not an exciting thing,” he says. “It’s about people dying young, it’s about grief.”\n\nYou have to understand what sort of shape Glasgow was in. They thought the best approach was to start afresh David Walsh, Glasgow Centre for Population Health\n\nHe wanted to work out why Glaswegians have a 30% higher risk of dying prematurely – that is, before the age of 65 – than those living in similar postindustrial British cities. In 2016 his team published a report looking at 40 hypotheses – from vitamin D deficiency to obesity and sectarianism. “The most important reason is high levels of poverty, full stop,” says Walsh. “There’s one in three children who are classed as living in poverty at the moment.”\n\nBut even with deprivation accounted for, mortality rates in Glasgow remained inexplicable. Deaths in each income group are about 15% higher than in Manchester or Liverpool. In particular, deaths from “diseases of despair” – drug overdoses, suicides and alcohol-related deaths – are high. In the mid-2000s, after adjusting for sex, age and deprivation, there was almost a 70% higher mortality rate for suicide in Glasgow than in the two English cities.\n\nWalsh’s report strongly suggested a theory: that radical urban planning decisions from the 1950s onwards had made not just the physical but the mental health of Glasgow’s population more vulnerable to the consequences of deindustrialisation and poverty.\n\nStudies have consistently linked city living with poorer mental health. For example, growing up in an urban environment is correlated with twice the risk of developing schizophrenia as growing up in the countryside. And the unintended legacy of some urban planning exacerbates the already considerable challenges of living in a city – something 68% of the world’s population will be doing by 2050, according to UN projections.\n\nAre these urban dwellers doomed to poor mental health, or can planners design cities that will keep us healthy and happy? Can we learn from what happened in Glasgow?\n\nNew Towns, new problems\n\nPostwar Glasgow was severely overcrowded. The 1945 Bruce report proposed solving this by housing people in high-rises on the periphery, while the following year’s Clyde Valley report suggested encouraging workers and their families to move to new towns. In the end, the council did a combination of both: New Towns like East Kilbride and Cumbernauld are now among the most populous towns in Scotland; many of those who stayed in Glasgow were relocated to large housing estates such as Drumchapel, Easterhouse and Castlemilk.\n\nThis rapid change in the city’s makeup was soon recognised as disastrous. Relocating workers and their families to new towns was described in mid-1960s parliamentary discussions as “skimming the cream”. In an internal review in 1971, the Scottish Office noted that the manner of population reduction was “destined within a decade or so to produce a seriously unbalanced population with a very high proportion [in central Glasgow] of the old, the very poor and the almost unemployable…”\n\nHousing estate in Drumchapel, Glasgow. Photograph: Alamy\n\nAlthough the government was soon aware of the consequences, these were not necessarily intentional, says Walsh. “You have to understand what sort of shape Glasgow was in, in terms of the really lousy living conditions, the levels of overcrowded housing and all the rest of it,” he says. “They thought the best approach was to just start afresh.”\n\nAnna left the tenements for a high-rise in Glasgow’s Sighthill estate, where she has lived on and off since the mid-60s. She was a teenager when she moved with her mother and sister to a brand-new fourth-floor flat, picked from a bowler hat. It had two bedrooms, a bathroom, a kitchen and a glass partition in the hallway. “It was like Buckingham Palace,” remembers Anna. She is now 71, dressed in jeans and a denim shirt, with a blonde bob and a raspy cough that doubles as a laugh.\n\nYou’re more likely to have violence, you’re more likely to have conflict; even sexual abuse is much higher in households where there are drinkers Carol Craig, author and researcher\n\nSighthill’s 10 20-storey tower blocks were meant to herald the future. Set in parkland, with a view over the city, they would house more than 7,000 people drawn from the tenements and the slums.\n\nUntil then, the family had lived in a tenement building in nearby Roystonhill. “I slept with my mammy and my sister in a recess,” she says. The toilet was shared.\n\nBut when the tenements went, something else went, too. “There were communities which had a social fabric, if you like, which were then broken up by these processes,” says Walsh.\n\nAnna recalls the change. “When we were in the tenements, you’d shout up to the window: ‘Mammy, I want a piece of jam!’ Before you knew it there was a dozen of them being thrown out of the window.” In the tower block, she did not let her own children play unsupervised. Neighbours only spoke if they took the same lift. Her daughter was threatened with a bread knife.\n\nTenements in the Gorbals, Glasgow, in 1968. Photograph: David Newell Smith/The Observer\n\nBy the 2000s, the tower blocks were infamous for deprivation, violence and drugs. Many residents had moved out, including Anna and her family. Empty flats were used to rehouse asylum seekers. Fractures within the community were worsening. Glasgow Housing Association eventually decided to condemn the buildings, and the towers were demolished over eight years; the last one came down in 2016.\n\nBut the roots of Glasgow’s excess mortality stretch back further – to the Industrial Revolution, argues Carol Craig, who has written two books on the subject. In Glasgow, then called the Second City of the Empire, factories and the docks needed workers. Overcrowding coupled with a culture of drinking produced an explosive situation.\n\nFaced with the prospect of returning to a cramped tenement, many men preferred to visit the pub; there were few other public meeting places. “You’re more likely to have violence, you’re more likely to have conflict; even sexual abuse is much higher in households where there are drinkers,” Craig says.\n\nBeing exposed in childhood to stressful events like domestic violence, parental abandonment, abuse, or drug and alcohol addictions is thought to be linked to poor mental and physical wellbeing in later life. The higher a person’s number of adverse childhood experiences (ACEs), the more likely they are to suffer from mental illness or addiction. In turn they are more likely to expose their children to similar types of experiences, she says: “ACEs tend to cascade through the generations.”\n\nHigh-rise brought low\n\nIn the early 20th century, cities were meant to show us how to live. Modern urban planning would make people in the world’s cities healthier and happier. In 1933, the influential Swiss-French architect Le Corbusier published his blueprint for the ideal city. In contrast with the past, he said, the city would now be designed to benefit its residents “on both the spiritual and material planes”.\n\nIn his “Radiant City”, industrial, commercial and residential zones would be segregated to allow workers to escape pollution; homes would be surrounded by open green spaces to allow residents to meet; wide roads would be set out in a grid system; and high-rise blocks would help clear the slums, overcrowded and unsanitary places where the inhabitants were, as the architect put it, “incapable of initiating ameliorations”.\n\nGlasgow enthusiastically adopted these new buildings. In 1954 a delegation of councillors and planners visited Marseilles to see the Le Corbusier-designed Unité d’Habitation, an 18-storey block of flats and amenities resting on concrete stilts. Glasgow soon had the highest number of high-rise dwellings in the UK outside London.\n\nLe Corbusier’s ‘Radiant City’ project in Marseille. Photograph: Boris Horvat/AFP/Getty Images\n\nSince Le Corbusier, we have learned more about how the design of buildings can affect behaviour. In an oft-cited study from 1973, the psychologist Andrew Baum looked at how the design of two student dormitories changed how the residents interacted. In the first design, all the students shared common lounge and bathroom facilities along a corridor. In the second, smaller groups of four to six each shared bathrooms and lounges.\n\nBaum found that the first design was a “socially overloaded environment” that did not allow residents to regulate who they interacted with and when. Being faced with too many people, at times not of their choosing, led students to experience stress; they became less helpful and more antisocial than those in the second design as the year went on.\n\nMental health is almost uniformly worse in cities … that’s just what the data shows Andreas Meyer-Lindenberg, psychiatrist\n\nPerhaps the most famous example of buildings’ effects on their inhabitants still referenced today is the Pruitt–Igoe housing complex in St Louis, USA: 33 towers of 11 storeys each, inspired by Le Corbusier and designed by the modernist Minoru Yamasaki. Finished in 1956, it was initially seen as a miracle solution to inner-city living. Less than 20 years later, the social problems the blocks seemed to have spawned were deemed so irreparable that the local authorities imploded the buildings.\n\nThe architect Oscar Newman toured Pruitt–Igoe in 1971, a year before demolition started. He argued that the design of a building affected the extent to which residents contributed to its upkeep. If people feel responsible for both keeping an area clean and controlling who uses it, it is likely to be safer. He called this sense of ownership over a territory “defensible space”.\n\n“The larger the number of people who share a communal space, the more difficult it is for people to identify it as theirs or to feel they have a right to control or determine the activity taking place within it,” Newman wrote. Pruitt–Igoe was not designed to accommodate defensible space, he argued. “Landings shared by only two families were well maintained, whereas corridors shared by 20 families … were a disaster – they evoked no feelings of identity or control.”\n\nPart of the Pruitt-Igoe public housing development in St. Louis, Missouri, being demolished by dynamite charges in 1972. Photograph: Fred Waters/AP\n\nTower blocks with wealthier residents are less likely to have issues with defensible space: they can pay for cleaners and security guards. Children, on the other hand, are often most affected: these common areas – communal corridors, or landings, or the nearby park – are usually spaces for play.\n\nDuring his inauguration as rector of Glasgow University in 1972, the Clydeside trade unionist Jimmy Reid argued powerfully that working-class communities left behind by economic advancement were being stored out of sight. “When you think of some of the high flats around us,” he said, “it can hardly be an accident that they are as near as one could get to an architectural representation of a filing cabinet.”\n\nNewts in the city\n\nInequality is at its most conspicuous in cities: the very poor and the very rich live side-by-side yet separately. Relative social status is more likely to be the first measure by which we judge people in places where communities are more transient and inequality starker. This has been shown to have an impact on our psychological wellbeing.\n\nIn their book The Inner Level, epidemiologists Kate Pickett and Richard G Wilkinson argue that inequality not only creates social rupture by highlighting people’s differences but also encourages competition, contributing to increased social anxiety. They cite a 2004 paper by two psychologists at the University of California, Los Angeles – Sally Dickerson and Margaret Kemeny – who analysed 208 studies to find that tasks involving some threat of social evaluation affected stress hormones the most.\n\nKate Pickett and Richard Wilkinson: ‘Inequality strikes at our health and happiness’ | Dawn Foster Read more\n\nPickett and Wilkinson argue that this type of stress harms our psychological health: “The more unequal countries had three times as much mental illness as the more equal ones.” This affects people of all social classes. In high-inequality countries, such as the USA and the UK, even the richest 10% of people suffer more anxiety than any group in low-inequality countries except the poorest 10%.\n\nResearch has also shown that living in a city can alter our brain’s architecture, making it more vulnerable to this type of social stress. In 2011, a team led by psychiatrist Andreas Meyer-Lindenberg of Heidelberg University’s Central Institute of Mental Health looked at the implications of urban living on brain biology, scanning the brains of students while they were given arithmetic tasks and simultaneously subjected to criticism on headphones.\n\nThe results of the test, designed to simulate social stress, were stark: the participants who lived in a city demonstrated a greater neurophysiological reaction, with the amygdala, an area of the brain which processes emotion, activated more strongly. Those who’d grown up in cities also displayed a stronger response in their perigenual anterior cingulate cortex, which regulates the amygdala and is associated with stress and negative emotion, than those brought up in towns or the countryside.\n\nMeyer-Lindenberg’s previous work on risk mechanisms in schizophrenia focused on genes. But these are only thought to account for a 20% increased chance of developing the illness at most – and growing up in a city is associated with double the risk. His research has shown that stressful experiences in early life correlate with reduced volume of grey matter in the perigenual anterior cingulate cortex, a factor often seen in people with schizophrenia.\n\n“Mental health is almost uniformly worse in cities … that’s just what the data shows,” Meyer-Lindenberg says. “There isn’t really a bright side to this.”\n\nLack of agency – the feeling that we don’t have control over a situation – is one of the core mechanisms determining how strongly social stress is experienced, says Meyer-Lindenberg, adding: “People who are in leadership positions tend to cope better with a given amount of stress.”\n\nIf you can see children, it’s probably a healthy and happy city Liz Zeidler, Happy City Initiative\n\nIn a city, and particularly if you are poor, you are far more dependent on other people and the urban infrastructure, whether waiting impatiently for a bus or a lift, wondering who you’ll have to share a lift with in your high-rise complex, or hoping the local council will not choose your neighbourhood for redevelopment.\n\nCities can also of course be liberating. “The flip side of being more stressful is that they may be more stimulating,” Meyer-Lindenberg says. “This tighter community that you have in a village, say, can be very oppressive if you don’t feel like you belong, if you’re an outsider of some sort.”\n\nInequality has been shown to lower trust in others and damage social capital – the networks between people which allow societies to function effectively. People are so worried about security that they’re mentally building walls around themselves, says Liz Zeidler, chief executive of the Happy City Initiative, a research centre based in Bristol. “We need to be doing the opposite: we need to be creating more and more spaces where people can connect, learn across their differences.”\n\nHappy City has designed a way to measure the local conditions shown to improve well-being. Its Thriving Places Index looks at housing, education, inequality, green space, safety and community cohesion.\n\nPerhaps a good measure for the happiness of a place, Zeidler says, is the status of the “indicative species”, an idea borrowed from the author and urbanist Charles Montgomery. For ponds, she says, it might be that the presence of a certain type of newt tells you whether or not the water is healthy. In cities, the newts are children: “If you can see children, it’s probably a healthy and happy city.”\n\nThe way a city is laid out can foster this environment, she says, by “closing of streets, making it more pedestrianised, more green spaces, having more what urban planners would call ‘bumping spaces’, where you can literally bump into people. Slowing places down is really good for everybody’s wellbeing and, obviously, you then see more children on the streets.”\n\n‘The city will get what it invites’\n\nWithout looking at the car swinging towards him, the urban planner Christopher Martin crosses the road. Thankfully, the car slows down. Martin continues, blithely, discussing the priority of pedestrians and rule 170 of the Highway Code.\n\nThe Dutch traffic engineer Hans Monderman used to perform a similar trick in the early 2000s. He would walk, usually with a journalist in tow, backwards, eyes closed, into a four-way crossing with no traffic lights or signs. Monderman believed roads were safer without traffic signs; in order to navigate unfamiliar routes, cars would slow down. The common sense of the drivers would act as a more powerful safety guard than any sign.\n\n“What we’re trying to do is to get people to interact with each other – be human beings,” Martin says as we continue to walk up Sauchiehall Street in Glasgow.\n\nView looking west along Sauchiehall Street, Glasgow. Photograph: Alamy\n\nSauchiehall Street is the first area to be worked on as part of the Avenues, a £115m project to form an integrated network of pedestrian and cycle routes on 17 roads and surrounding areas in the city centre between the Clyde and Glasgow’s infamous motorway, which forms a near noose around the area.\n\nGlasgow’s central grid is mostly made of four-lane roads. When you walk across the city, the roads, some at a steep incline, others stretching towards a grey horizon, seem solely taken up with cars and buses. “The city will get what it invites,” says Martin. Now parts of these roads will be given over to those walking and biking, and to trees and benches.\n\nIt’s very antisocial being sat in a metal box by yourself. The rise of urban loneliness and mental health [issues] to do with that disconnection is vast Christopher Martin, urban planner\n\nCity planners the world over have a history of favouring the needs of cars. In 1955 Robert Moses, New York City parks commissioner, was planning to build a four-lane road through Washington Square Park. Some of the residents demurred, including the journalist Jane Jacobs. In 1958, three years into what would become a successful 14-year fight to save Greenwich Village, she wrote an article in Fortune magazine that eventually formed the basis of her book The Death and Life of American Cities.\n\nTo keep downtown activities “compact and concentrated”, Jacobs advocated removing cars: “The whole point is to make the streets more surprising, more compact, more variegated, and busier than before – not less so.” She argued against grand schemes that sought to demolish and redevelop, instead saying that cities should grow in line with what people want and how they use the spaces that already exist: “There is no logic that can be superimposed on the city; people make it, and it is to them, not buildings, that we must fit our plans.”\n\nGlasgow City Deal (@GlasgowCityDeal) The @GlasgowCityDeal Avenues project will transform the city centre, with the #SauchiehallAvenue showing what can be done. Watch @robertflorence explain how the #ArgyleAvenue will make the area and city more resilient in the face of climate change. @nature_scot #ScotClimateWeek pic.twitter.com/RnKHgDqCPi\n\nGiving priority to cars has distorted cities’ proportions, Martin says: “If you build at the scale of cars, you get wide roads, you get wide streets, you get cities which stretch out because cars are fast and cars are big.” Taking space away from cars gives the public realm back to the people. “It’s very antisocial being sat in a metal box by yourself,” he says. “The rise of urban loneliness and mental health [issues] to do with that disconnection is vast.”\n\nIn Glasgow, Sauchiehall Street is being used as a proof of concept, while the other “Avenues” will be implemented over the next eight years.\n\nThe way forward\n\nIf designed well, cities can be good for us. “If you look at urban dwellers epidemiologically,” says Meyer-Lindenberg, “they tend to be richer, better educated, [with] better access to healthcare. And they also tend to be somatically healthier.” They also tend to have a smaller carbon footprint. “You can’t raze cities to the ground and rebuild them,” he says. “You have to find ways to maximise people’s wellbeing.”\n\nMeyer-Lindenberg is currently tracking how different parts of the city affect our mental wellbeing, using a technique called ecological momentary assessment, in which participants repeatedly report on the environment around them in real time. Various studies have suggested that nature – be that a tree or a park – has an important impact on people’s mental health. The app he is currently designing will allow people to plan their routes through the city in order to maximise their exposure to nature.\n\n“The most beneficial nature is the one that looks like the kind of nature that humans would have encountered during their early evolution,” he surmises. Perhaps the manicured parks of the type preferred by urban planners may not actually be that effective at improving our wellbeing.\n\nIn 2012, Emily Cutts realised the importance of these kinds of green spaces when the meadow overlooked by her second-floor flat in west Glasgow was threatened with development. Once used as an informal football pitch by locals, the meadow had mostly been frequented by dog walkers and drug addicts since the council, who wanted to sell the land, removed the goalposts. Now it finally looked as if a plan to build 90 deluxe flats might pass.\n\nThe community garden in North Kelvin Meadow, Glasgow. Photograph: Chris Leslie\n\nCutts decided that the only way to save the meadow was to launch a campaign. Over the next few years, the community organised petitions, events and a three-month vigil in St George’s Square in the city centre. Eventually the Scottish government stepped in. On 21 December 2016, it was determined that the meadow would remain undeveloped. It is known locally as the Children’s Wood and is managed by a charity.\n\nBut why did Cutts and her fellow campaigners fight so passionately for this dingy meadow? Her neighbourhood, about 10 minutes north of the Botanic Gardens, already had plenty of green space. Was it simply a case of not wanting development on her doorstep?\n\nWhen I meet Cutts in the community garden, she is deep in discussion with the gardener, Christine, about the possibility of using a wormery to transform dog faeces into compost for the trees. There are raised beds for planting, a bathtub with upturned earth for children to dig and an “edible” teepee (pea shoot tendrils will soon be climbing up the twigs). It was planted by a 12-year-old boy who, Cutts tells me, is regularly excluded from school.\n\nReclaiming the land for community is definitely the way forward. You can tell there’s a need but it’s not happening all over and it could be Emily Cutts, green space campaigner\n\nCutts is slight with long blonde hair, a soft Glaswegian accent and an eager countenance. She has an MSc in positive psychology. It was while working as Carol Craig’s researcher, compiling and presenting research on how to improve wellbeing, that she grew to understand the meadow’s potential to make her community healthier and happier.\n\nToday, more than 20 schools and nurseries from the local area use the meadow. During my visit, Kelvinside Academy is having a forestry lesson. Children are playing around the thin birch trees, tying ropes around them, swinging friends vigorously in hammocks that look like laughing body bags, and digging in the earth. They learn to use knives for woodland tasks.\n\nCutts collaborated with a researcher at the University of Glasgow on a series of tests comparing the attention spans of children who spent their lunchtime in the meadow with those who stayed indoors or played in the school’s concrete playground. The attention of children exposed to nature was “significantly better”.\n\nAttention restorative theories argue that nature can have an impact on our attention span by engaging our indirect attention; this allows the type of attention we use for more challenging cognitive tasks, such as mathematical problems, to recuperate. The team also performed a similar experiment looking at children’s creativity in art. “Children who came here used more colours, used more texture, made more depth to their pictures than those who hadn’t played outside,” says Cutts.\n\nPlay area at the Children’s Wood, Glasgow. Photograph: Chris Leslie\n\nRichard Mitchell, a professor in the Social and Public Health Sciences Unit at the University of Glasgow, has also been looking at how exposure to nature affects stress in deprived communities. Despite previous research showing a beneficial impact, his own findings have shown it to be slight.\n\n“These are all very deprived communities with a whole range of other problems going on, and the detrimental impact of life in poverty and other stressful situations is not outweighed by access to green space,” he says. “I think what we have to understand is that at a population level it may not have an absolutely spectacular impact straight away, [but] it is important.”\n\nFurther study, however, showed that one aspect of exposure to nature “had pretty strong protective effects on mental health in adulthood”, Mitchell says. Those who had been Scouts or Guides, and had repeated contact with nature over a long period of time “where they’re learning a whole variety of skills including being outdoors and appreciation of nature”, were less vulnerable to mental ill-health.\n\nCould bad buildings damage your mental health? Read more\n\nThe Children’s Wood charity runs a regular youth club where they bring young people to help with the gardening. Many of the children come from deprived families. “That’s what always interests us about the space,” says Cutts. “It’s bang right in the centre of inequality – there’s so much poverty and there’s a lot of affluence around. So, we feel it’s sort of a level playing field and everybody is welcome.” Unlike in parks, which can be anonymous, here you have “a committed community who are involved in the space”, she says.\n\nWe go up the road together to visit a GP at home who works in Possilpark, one of the poorest districts in the city. She prescribes visits to the Children’s Wood, in addition to other treatments, due to the benefits of “peer support, getting out of your house, talking to others, getting more engaged in your community, watching things grown, nurturing other things, nurturing oneself and self-care”. She says that when her patients talk about the wood, it is one of the few times she sees them smile.\n\nOver 60% of Glasgow’s population live within 500 metres of a derelict site. A 2013 study found that vacant land and deprivation were linked to poor mental and physical health. It recommended that the city council grant the more than 700 hectares (1,730 acres) available to highly deprived communities to be used for community good.\n\n“Reclaiming the land for community is definitely the way forward,” Cutts says as we both look over the meadow in the drizzling rain. “You can tell there’s a need but it’s not happening all over and it could be.”\n\nIn the evening, Cutts shows me the youth programme where 40 or so children are learning how to trampoline. As I wait for the bus, I see some of the children leaving, mostly boys who are about 13 or 14, jostling and pushing each other playfully in the middle of the wide road. They are the newts in the city.\n\nThis is an edited version of an article first published by Wellcome on Mosaic and is republished here under a Creative Commons licence. Sign up to the newsletter at mosaicscience.com/newsletter\n\nFollow Guardian Cities on Twitter, Facebook and Instagram to join the discussion, catch up on our best stories or sign up for our weekly newsletter", "description": "Life expectancy for Glaswegians has long been notoriously low, but planners are starting to learn how to make citizens healthier – and happier", "authors": ["Fleur Macdonald"], "top_image": "https://i.guim.co.uk/img/media/f02d745ac71098049931c8dcfd08ffa5687c59b3/319_161_2076_1245/master/2076.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=afbee4645f7f6bd7b7838d5dd5538060", "published_at": "2019-10-16"}