{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/19/elijah-cummings-widow-may-run-his-congressional-seat", "downloaded_at": "2019-10-19 19:10:51.599596+00:00", "title": "Report: Elijah Cummings’ Widow May Run for His Congressional Seat", "language": "en", "text": "Rep. Elijah Cummings’ widow, Dr. Maya Rockeymoore Cummings, may run for his congressional seat, according to a report.\n\nThe 48-year-old chairwoman of the Maryland Democratic Party has not yet made a statement about a possible run, but sources said she is the “most likely successor to fill his congressional seat,” according to the Washington Examiner.\n\nThe article also stated that other potential candidates “will make room for her out of respect for her and her late husband” if she decides to run in April.\n\nHowever, one political operative noted that Rockeymoore is not planning any immediate political moves in the near future.\n\n“Word is that Maya Rockeymoore will pass on the special election,” the operative said.\n\nOn Thursday, Breitbart News reported that Rep. Cummings (D-MD) had died of “health complications” at the age of 68.\n\n“Cummings died at Johns Hopkins Hospital at 2:45 a.m. Thursday morning from ‘complications concerning longstanding health challenges,'” the article said.\n\nPresident Trump offered his condolences on Twitter Thursday and stated that it will not be easy to fill the congressman’s seat:\n\nMy warmest condolences to the family and many friends of Congressman Elijah Cummings. I got to see first hand the strength, passion and wisdom of this highly respected political leader. His work and voice on so many fronts will be very hard, if not impossible, to replace! — Donald J. Trump (@realDonaldTrump) October 17, 2019\n\nOn the day of his passing, the White House ordered the American flag to be flown at half-staff in honor of Cummings.\n\nA proclamation by President Trump read:\n\nAs a mark of respect for the memory and longstanding public service of Representative Elijah E. Cummings, of Maryland, I hereby order, by the authority vested in me by the Constitution and the laws of the United States of America, that the flag of the United States shall be flown at half-staff at the White House and upon all public buildings and grounds, at all military posts and naval stations, and on all naval vessels of the Federal Government in the District of Columbia and throughout the United States and its Territories and possessions through October 18, 2019. I also direct that the flag shall be flown at half‑staff for the same period at all United States embassies, legations, consular offices, and other facilities abroad, including all military facilities and naval vessels and stations.\n\nCummings had served Maryland’s 7th Congressional District since 1996. His body will lie in state at the U.S. Capitol through next week until his funeral in Baltimore on Friday, according to Fox News.", "description": "Rep. Elijah Cummings' widow, Dr. Maya Rockeymoore Cummings, may run for his congressional seat, according to a report.", "authors": ["Amy Furr"], "top_image": "https://media.breitbart.com/media/2019/10/Maya-Rockeymoore-Cummings-Elijah-Cummings-swearing-in-getty-640x335.jpg", "published_at": "2019-10-19"}