{"pub": "reuters", "url": "https://in.reuters.com/article/saudi-aramco-iran/iran-says-it-will-destroy-any-aggressor-idINKBN1W603I", "downloaded_at": "2019-09-21 10:08:47.371226+00:00", "title": "Iran says it will destroy any aggressor", "language": "en", "text": "DUBAI (Reuters) - Iran will pursue any aggressor, even it carries out a limited attack, and seek to destroy it, the head of the elite Revolutionary Guards said on Saturday, after attacks on Saudi oil sites which Riyadh and U.S officials blamed on Tehran.\n\nHossein Salami, deputy head of Iran's Revolutionary Guard, speaks during Tehran's Friday prayers July 16, 2010. REUTERS/Morteza Nikoubazl/Files\n\n“Be careful, a limited aggression will not remain limited.\n\nWe will pursue any aggressor,” the head of the Guards, Major General Hossein Salami, said in remarks broadcast on state TV.\n\n“We are after punishment and we will continue until the full destruction of any aggressor.”\n\nU.S. President Donald Trump on Friday approved sending American troops to bolster Saudi Arabia’s air and missile defences after the Sept. 14 attack, which Washington has squarely blamed on Iran.\n\nIran denies involvement in the attack, which was claimed by Yemen’s Houthi movement, a group aligned with Iran and currently fighting a Saudi-led alliance in Yemen’s civil war.\n\nAmirali Hajizadeh, who heads the Revolutionary Guards’ aerospace branch, said any attacks on Iran would receive “a crushing response”, the official news agency IRNA reported.\n\nHajizadeh was speaking at a public exposition called “Hunting Vultures” where remains of drones downed in Iran and the Iranian air defence system which shot down a U.S. military drone in June were displayed.\n\nThe exposition is part of annual events commemorating the start of the 1980-88 war with Iraq, which also includes air and naval displays in the Gulf and military parades on Sunday.\n\nIran’s foreign minister earlier denounced renewed U.S. sanctions against its central bank following the Saudi attacks as an attempt to deny ordinary Iranians access to food and medicine, and said the move was a sign of U.S. desperation.\n\nThe United States on Friday imposed more sanctions on Iran, some aimed at its central bank and sovereign wealth fund.\n\n“This is a sign of U.S. desperation ... When they repeatedly sanction the same institution, this means their attempt at bringing the Iranian nation to its knees under ‘maximum pressure’ has failed,” Foreign Minister Mohammad Javad Zarif told reporters in remarks shown on state television.\n\n“But this is dangerous and unacceptable as an attempt at blocking ... the Iranian people’s access to food and medicine,” Zarif said, speaking after arriving in New York for the annual U.N. General Assembly next week.\n\nCYBER-ATTACK\n\nMeanwhile, there were reports on social media that a number of Iranian servers and websites - including those of some petrochemical firms - were under a cyber-attack. There was no immediate official comment, and the websites of the main state oil company NIOC appeared to be functioning normally. Residents said their internet access was not affected.\n\nNetBlocks, an organisation that monitors internet connectivity, reported “intermittent disruptions” to some internet services in Iran starting on Friday evening.\n\nBut the group said the impact was limited, affecting only specific providers, and the cause was unclear. “Data are consistent with a cyber-attack or unplanned technical incident on affected networks as opposed to a purposeful withdrawal or shutdown incident,” it said in a tweet.\n\nNetBlocks Director Alp Toker said they saw four Iranian networks falling offline over a three hour period on Friday evening. This began when the first reports emerged and ended shortly afterwards. The networks have been stable since.\n\nThe fresh sanctions target the Central Bank of Iran, which was already under U.S. sanctions, the National Development Fund of Iran - the country’s sovereign wealth fund - and an Iranian company that U.S. officials say is used to conceal financial transfers for Iranian military purchases.\n\nZarif said he would on Wednesday meet foreign ministers of the remaining signatories to the 2015 nuclear accord, which was agreed with Britain, France, Germany, China and Russia as well as the United States.\n\nIran's Foreign Minister Javad Zarif reacts during a news conference with Russia's Foreign Minister Sergei Lavrov (not pictured) after their meeting in Moscow, Russia, September 2, 2019. REUTERS/Evgenia Novozhenina/Files\n\n“As we have said before, the United States can only attend if it returns to the (nuclear accord) ... and ends its economic war against Iran,” Zarif said.\n\nThe United States withdrew from the accord last year and re-imposed unilateral sanctions on Iran.\n\n“I hope the U.S. government realises that they are no longer the only economic superpower in the world and that there are many countries that want to benefit from the Iranian market,” Foreign Ministry spokesman Abbas Mousavi said, according to state media.", "description": "Iran will pursue any aggressor, even it carries out a limited attack, and seek to destroy it, the head of the elite Revolutionary Guards said on Saturday, after attacks on Saudi oil sites which Riyadh and U.S officials blamed on Tehran.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190921&t=2&i=1432281686&w=1200&r=LYNXMPEF8K06Y", "published_at": "2019-09-21"}