{"pub": "fox", "url": "https://foxnews.com/us/oregon-taco-bell-maryland-woman-slash-throat-prison", "downloaded_at": "2019-10-07 00:15:27.578656+00:00", "title": "Oregon Taco Bell customer who slashed man's throat sentenced to 7 years in prison, report says", "language": "en", "text": "A knife-wielding Maryland woman who slashed a man’s throat at a Taco Bell in Oregon this past July -- after he told her to “zip it” for berating the staff -- was sentenced Thursday to 7 years in prison, according to a report.\n\nCaley Mason, 22, pleaded guilty in Clackamas County in September to second-degree assault in the knife attack that gave 48-year-old Jason Luczkow an 8-inch gash across his face and throat and required 100 stitches.\n\nOn July 9, Luczkow said he walked into a Taco Bell in Sandy – about 30 miles east of Portland – and saw Mason, clad in a blonde wig, yelling at the employees for taking too long.\n\n“Apparently the management had already told her to leave,” Luczkow said. “As she continued to rant and rave, I told her to be quiet. Told her to zip it.”\n\nMason left the restaurant but returned moments later with a knife and attacked Luczkow, Det. Sam Craven told The Oregonian/OregonLive.\n\nMason then sped off in a silver Kia Soul, nearly running over his wife in the process, Luczkow said. Police said they pulled her over with her boyfriend and two young children – ages 2 and 4 – in the car, according to Clackamas County prosecutor Matt Semritc.\n\n4 FATALLY INJURED IN STABBING SPREE IN SOUTHERN CALIFORNIA, SUSPECT NABBED\n\nCraven said police found Mason’s blonde wig “in the boyfriend’s pants.”\n\nMason was arrested and indicted on multiple criminal counts, including attempted murder, first-degree assault and unlawful use of a weapon, according to records cited by The Oregonian/OregonLive.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nMason’s boyfriend, Phillip Thomas, was arrested for tampering with physical evidence but his case later was dismissed, the records showed.\n\nProsecutors said Mason was on state supervision for an armed robbery of a pizza deliveryman in Maryland. Her children, meanwhile, have been sent back to Maryland with a relative, investigators added.", "description": "A knife-wielding Maryland woman who slashed a man’s throat at a Taco Bell in Oregon this past July -- after he told her to “zip it” for berating the staff -- was sentenced Thursday to 7 years in prison, according to a report.", "authors": ["Bradford Betz", "Bradford Betz Is An Editor For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Oregon.jpg", "published_at": "2019-10-06"}