{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7611779/Couple-accused-killing-Kamille-Cupcake-McKinney-face-DEATH-PENALTY.html", "downloaded_at": "2019-10-25 02:25:26.165253+00:00", "title": "Couple accused of killing Kamille 'Cupcake' McKinney could face the DEATH PENALTY", "language": "en", "text": "The couple accused of killing three-year-old Kamille 'Cupcake' McKinney could face the death penalty after being charged with capital murder.\n\nJefferson County District Attorney Danny Carr announced Thursday that Patrick Devone Stallworth, 39, and his girlfriend Derick Irisha Brown, 29, had both been charged with capital murder of a child under the age of 14.\n\nThe charge carries a possible death penalty in the state of Alabama.\n\nSpeaking at a press conference, DA Carr said Stallworth and Brown are both being held without bond.\n\nLawyers for the pair say they maintain their innocence.\n\nKamille, who was known to relatives as 'Cupcake', vanished from a birthday party being held in a Birmingham park on October 12.\n\nPolice and members of the public conducted a massive search for the little girl before her remains were discovered in a trash bin taken to a landfill on Tuesday.\n\nInvestigators said they suspected Stallworth and Brown within 24 hours of Kamille's abduction.\n\nScroll down for video\n\nPatrick Devone Stallworth (left) and his girlfriend Derick Irisha Brown (right) have both been charged with capital murder of a child under the age of 14 in relation to the death of three-year-old Kamille 'Cupcake' McKinney\n\nKamille, known to relatives as 'Cupcake', was abducted from a birthday party on October 12\n\nTIMELINE OF KAMILLE'S DISAPPEARANCE October 12 - Kamille 'Cupcake' McKinney is reported missing from a birthday party at a playground in Birmingham at 8.30pm October 14 - Patrick Devone Stallworth, 39, and his 29-year-old girlfriend, Derick Irisha Brown, are arrested on unrelated charges and named as persons of interest in Kamille's disappearance October 18 - Police release surveillance video from the night Kamille was abducted, which showed a man approaching her at a park near the Tom Brown public housing projects before he walked off with her October 22 - Police announce that Kamille's remains were found in a trash bin at a landfill near where the three-year-old was taken October 24 - Police formally charge Stallworth and Brown with capital murder of a child under age 14\n\nBoth Stallworth and Brown were arrested last week on unrelated charges and named persons of interests in Kamille's disappearance.\n\nStallworth was charged with seven counts of possession of child pornography after investigators found multiple photos on his phone - none of which featured Kamille.\n\nHe was released on $500,000 bond and taken back into custody on Tuesday night.\n\nBrown was charged with violating probation conditions from a previous kidnapping case involving her own children. She was held without bond.\n\nBirmingham Mayor Randall Woodfin said investigators have not determined any links between the suspects and Kamille or her family.\n\n'We believe that this was something they thought about and acted upon and they saw an opportunity to take a young child, and they did,' Woodfin said Tuesday.\n\n'At this moment that we're standing in, I ask one thing of this community: not to take sides and not to finger point. But if there is any finger pointing to do it is only at the perpetrator, who would kidnap an innocent three-year-old.'\n\nThe mayor added: 'This is a tough moment for this city. This is a tough moment for this family.\n\nAlabama Gov Kay Ivey released a statement about the discovery of Kamille's body, which read: 'Given the tragic news that is breaking this evening, I offer my heartfelt condolences to Kamille's family.\n\nPolice and members of the public conducted a massive search for Kamille before her remains were discovered in a trash bin taken to a landfill on Tuesday.\n\nPrior to the discovery of Kamille's body police offered a $28,000 reward for information on her whereabouts.\n\nMeanwhile, her family made desperate appeals for her safe return.\n\n'I mean she's three, man. She's innocent. I just want my baby back at the end of the day like anybody else would,' her father told WBRC last week.\n\n'I just want my daughter back. I'll pay anything, I'll put up anything,' he said.\n\n'Everybody knows Cupcake and I'll do anything to bring that baby back home.\n\n'She's scared, she's lonely, she doesn't know what's going on. She's just a baby. Whatever the situation is, whatever they've got going on, it don't concern her.'", "description": "The Jefferson County District Attorney announced Thursday that Patrick Devone Stallworth and Derick Irisha Brown had both been charged with capital murder of a child under the age of 14.", "authors": ["Andrew Court", "Megan Sheets For Dailymail.Com", "Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/02/20161108-0-image-a-12_1571965602573.jpg", "published_at": "2019-10-25"}