{"pub": "yahoo", "url": "https://finance.yahoo.com/news/jpmorgan-warns-u-money-market-093439609.html", "downloaded_at": "2019-10-21 11:32:31.897496+00:00", "title": "JPMorgan Warns U.S. Money-Market Stress to Get Worse", "language": "en", "text": "(Bloomberg) -- JPMorgan Chase & Co. says the money-market stress that sent short-term borrowing rates surging last month is likely to get much worse despite the Federal Reserve’s attempts to inject billions of dollars into the financial system.\n\nThe Fed has offered overnight loans and started buying up to $60 billion of U.S. Treasury bills a month in an effort to ease pressure in the vast repo market, where banks typically lend their assets in exchange for short-term financing. Secured lending rates shot up in late September, with analysts pointing to scarcity of interbank reserves as well as regulations that limits the size of bank balance sheets and their repo-lending capacity as the potential culprits.\n\nJPMorgan says it’s not convinced the Fed has resolved the issues in the funding markets, according to a note from analysts led by Joshua Younger in New York. Funding pressures resurfaced last week even after primary dealers, firms approved to trade directly with the Fed, took all of the available overnight liquidity from the central bank and sold it as many T-bills as possible.\n\n“Given the benefits of our newfound perspective, we recommend viewing these moves as highlighting the limitations of the Fed’s chosen solution to their operational issues,” the analysts wrote. “With year-end coming up, this is all likely to get much worse, in our view, before it gets better.”\n\nThe overnight liquidity provided by the Fed goes directly to primary dealers, whereas those most in need of it are the non-primary dealers, the JPMorgan analysts wrote. The success of the program therefore depends on how much of the liquidity is passed along, but primary dealers are deterred from doing so by rules specifying how much capital they must hold to protect against losses.\n\nMeanwhile, a preliminary analysis of balance sheets at the largest banks based on their third-quarter results suggests they may have to cut back on repo activity even more at year-end to avoid liquidity charges.\n\n“What new permanent reserves are being delivered to the banking system should face the same frictions -- both from balance sheet constraints and intraday liquidity requirements -- that generated these issues in the first place,” the JPMorgan analysts said.\n\nJPMorgan’s note follows similar warnings from Bank of America Merrill Lynch and Goldman Sachs Group Inc., who have also attributed September’s funding stresses to factors including post-financial crisis bank regulation. Even after the Fed’s latest moves to ease the log-jam in funding markets, “intermediation bottlenecks remain,” Goldman Sachs said.\n\nAnalysts at sell-side banks have argued for the creation of a “standing repo facility” by the Fed that would allow banks to continuously exchange their securities with the central bank in exchange for cash. Meanwhile, JPMorgan Chief Executive Officer Jamie Dimon said his bank -- still one of the biggest players in the repo market -- was unable to calm, or profit from, the dislocation in funding markets last month because of regulation.\n\nThe JPMorgan analysts recommend investors use futures markets to position for the spread between Fed Funds rate and repo to widen in December, as this will capture year-end funding stress. This has been a popular way for traders to play the funding squeeze, with a surge in activity in these contracts seen following September’s repo spike.\n\n(Corrects full name of company at start of story.)\n\nTo contact the reporters on this story: Tracy Alloway in Hong Kong at talloway@bloomberg.net;Stephen Spratt in Hong Kong at sspratt3@bloomberg.net\n\nTo contact the editors responsible for this story: Tan Hwee Ann at hatan@bloomberg.net, Nicholas Reynolds\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- JPMorgan Chase & Co. says the money-market stress that sent short-term borrowing rates surging last month is likely to get much worse despite the Federal Reserve’s attempts to inject billions of dollars into the financial system.The Fed has offered overnight loans and started buying up", "authors": ["Tracy Alloway", "Stephen Spratt"], "top_image": "https://s.yimg.com/uu/api/res/1.2/0qDNwv6aoIBd_JztPyvBlg--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/253e39287a72cd6e9e763e971b695cf8", "published_at": "2019-10-21"}