{"pub": "npr", "title": "Former Top Aide To Canada's Trudeau Pushes Back Amid Brewing Political Scandal", "url": "https://npr.org/2019/03/06/700827370/top-aide-to-canadas-trudeau-pushes-back-amid-brewing-political-scandal", "language": "en", "published_at": "2019-03-06", "downloaded_at": "2019-09-02 07:00:26.086382+00:00", "text": "Former Top Aide To Canada's Trudeau Pushes Back Amid Brewing Political Scandal\n\nEnlarge this image toggle caption Drew Angerer/Getty Images Drew Angerer/Getty Images\n\nUpdated at 9:26 p.m. ET\n\nA close ally of Canadian Prime Minister Justin Trudeau testified before Parliament on Wednesday, hoping to quell a growing political scandal that has already forced three high-level resignations.\n\n\"At the end of the day, we really didn't feel that anybody was doing anything wrong,\" said Gerald Butts, a principal secretary and top aide to Trudeau. Butts abruptly stepped down last month.\n\nAt issue are allegations made by Canada's former attorney general, Jody Wilson-Raybould, who says Trudeau and his inner circle intervened inappropriately in the criminal prosecution of a powerful engineering firm, SNC Lavalin, headquartered in Trudeau's home city of Montréal in Quebec province. The firm is accused of an international bribery and fraud scheme worth tens of millions of dollars.\n\nIt is a perilous moment for Trudeau, in part because many of those leveling accusations against him are friends, former allies and members of his own Cabinet.\n\nHis office announced that the prime minister will speak directly to Canadians about the crisis Thursday morning in Ottawa and take questions from reporters.\n\nDuring explosive testimony last week, Wilson-Raybould said Trudeau, Butts and others pressured her over a series of months to soften prosecution of Lavalin in order to shore up the Liberal Party's popularity in Quebec ahead of this year's elections. She says they threatened her with political repercussions if she didn't comply.\n\n\"I was having thoughts of the Saturday Night Massacre,\" Wilson-Raybould told a parliamentary committee, referring to the ousting of multiple Nixon administration officials in one day during the Watergate scandal.\n\nShe was later stripped of her post as attorney general and eventually resigned from Trudeau's Cabinet.\n\nIn his own testimony, Butts attempted to refute Wilson-Raybould's account, suggesting that high-level discussions of the Lavalin matter focused appropriately on how the case might affect jobs and employment, not on political repercussions of the case. He said Trudeau urged Wilson-Raybould to seek additional legal opinions before deciding how the prosecution would be handled.\n\nButts said he was startled when he learned that Wilson-Raybould felt the secret talks had threatened the independence of the criminal justice system.\n\n\"I asked her in a surprised tone whether she was questioning the integrity of the Prime Minister,\" he told members of Parliament.\n\nDuring roughly two hours of testimony, Butts faced often hostile and skeptical questions. They came from members of Canada's largest opposition party, the Conservatives, but also from lawmakers representing Trudeau's Liberal Party and two influential left-of-center parties, the New Democratic Party and the Greens.\n\n\"I will let you know, I completely believe every word we heard from Jody Wilson-Raybould without a doubt,\" said Green Party leader Elizabeth May, a longtime Trudeau friend, during her question time. May went on to accuse Trudeau's staff of making \"veiled threats\" against the attorney general over the Lavalin matter.\n\nIn a further blow to Trudeau, his treasury board chair, Jane Philpott, stepped down Monday after blasting the prime minister's team in a scathing public letter.\n\n\"It is a fundamental doctrine of the rule of law that our attorney-general should not be subjected to political pressure or interference regarding the exercise of her prosecutorial discretion in criminal cases,\" Philpott wrote.\n\nThe timing couldn't be worse for Trudeau. Canadians go to the polls in October to decide whether he deserves another term. Meanwhile, Conservative Party leader Andrew Scheer has called for Trudeau to resign and insisted on a new criminal probe into the case by the Royal Canadian Mounted Police.\n\nThe prime minister himself has said repeatedly that he did nothing wrong. He told reporters Monday that he intervened in the Lavalin case in hopes of preserving thousands of Canadian jobs but never challenged the independence of Canada's judiciary or the rule of law. \"This matter is to be determined by the attorney general,\" he said.", "description": "The prime minister is facing accusations that he and his advisers tried to intervene inappropriately in a criminal prosecution of a powerful firm hailing from Trudeau's home city of Montréal.", "authors": ["Brian Mann"], "top_image": "https://media.npr.org/assets/img/2019/03/06/gettyimages-518364020_wide-732039caa80044e9f3e2a54db9cf56c66e8e0ddf.jpg?s=1400"}