{"pub": "npr", "url": "https://npr.org/2019/10/02/766568889/how-rep-susan-wild-is-balancing-the-impeachment-inquiry-her-constituents-concern", "downloaded_at": "2019-10-03 23:27:32.280451+00:00", "published_at": "2019-10-02", "title": "How Rep. Susan Wild Is Balancing The Impeachment Inquiry, Her Constituents' Concerns", "language": "en", "text": "How Rep. Susan Wild Is Balancing The Impeachment Inquiry, Her Constituents' Concerns\n\nPennsylvania Democratic Rep. Susan Wild recently came out in support of the impeachment inquiry, but her constituents say they want her to focus on pocketbook issues.\n\nMARY LOUISE KELLY, HOST:\n\nImpeachment may be taking up most of the oxygen on Capitol Hill these days. That's not necessarily the case in House swing districts. One moderate Democrat is balancing pocketbook issues and an investigation of the president. NPR congressional reporter Claudia Grisales has more.\n\nCLAUDIA GRISALES, BYLINE: Susan Wild says she didn't run on impeachment, but she just recently backed a House Democrats inquiry. She's a freshman lawmaker from a labor-heavy district, and she really wants her constituents to know her time is focused on committee work that has nothing to do with investigating the president.\n\n(SOUNDBITE OF ARCHIVED RECORDING)\n\nSUSAN WILD: I'm going to say it again so you can tell other people who think that all we're doing down there is, you know, living, breathing and foaming at the mouth for impeachment. I get really testy on this when people say that because I spend 90% of my committee time in education and labor.\n\nGRISALES: That's Wild meeting with labor leaders at the Teamsters Local 773 in Pennsylvania's Lehigh Valley.\n\nGREGG POTTER: In seven months, you've done more than your predecessor did in 13 years, so thank you very much. We're grateful to have you here.\n\nGRISALES: That's one teamster who gave Wild a good review for the work she's done. High school English teacher Kevin Deely appreciates Wild talking about the other issues.\n\nKEVIN DEELY: We do need to get other business taken care of, and I do appreciate the congresswoman's focus on that work because I think that is important.\n\nGRISALES: That theme was Wild's mantra when she met with child care workers, manufacturers and parents at the start of the fall congressional recess.\n\nWILD: I'll tell you, not a single person asked me about impeachment at any of my events.\n\nGRISALES: That's Wild at her tiny district office in downtown Strasburg in Lancaster County. Unlike the majority of her caucus in the House, Wild held off from issuing public support for the impeachment inquiry of President Trump. That changed last week when details broke related to a Trump call with the Ukrainian president. Wild has to answer to constituents like David Potter. He's a Trump supporter who voted for her GOP opponent. He came out to an event at a church in Allentown.\n\nDAVID POTTER: Yeah, I'm definitely ex-Democrat.\n\nGRISALES: Potter is an engineer and father to four. He wants to hear from Wild on education, but not impeachment. Potter says he may vote for Wild. But if she's for impeachment, he'll vote for the Republican.\n\nPOTTER: Because if you're going to basically fight against the president when his goal is to make America great, then you should come up with a plan to make America great and not try to, you know, get in a fight with the president.\n\nGRISALES: Last year, Wild flipped her redrawn district from red to blue. In 2016, Trump won Pennsylvania by a slim margin.\n\nVoters like Cynthia McInnis are grateful that Wild has stuck to what's important to her. McInnis came to her education forum because she's worried she won't have enough money to keep paying workers at her longtime day care center.\n\nCYNTHIA MCINNIS: Whether he's impeached or not, it doesn't make that much of a difference on our level because we don't understand how funding for early childhood education comes from there to here to where we are.\n\nGRISALES: Wild says she's juggling two different sides. One, she has to stick by her constituents and the issues that matter most to them. But two, supporting the inquiry is also important.\n\nWILD: I did take an oath to uphold the Constitution. My feeling about the impeachment inquiry arises from that. I do feel that that is a very important undertaking.\n\nGRISALES: Wild has more events planned with voters over the break and expects worker's safety and education to remain front-burner issues for her, not impeachment.\n\nClaudia Grisales, NPR News, Strasburg, Pa.\n\n[POST-BROADCAST CORRECTION: In an early version of this report, we mistakenly said Rep. Susan Wild’s district office is in Strasburg, Pa. In fact, it is in Stroudsburg, Pa.]\n\nCopyright © 2019 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.", "description": "Pennsylvania Democratic Rep. Susan Wild recently came out in support of the impeachment inquiry, but her constituents say they want her to focus on pocketbook issues.", "authors": ["Claudia Grisales"], "top_image": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400"}