{"pub": "axios", "url": "https://axios.com/expert-voices-live-ai-in-2050-4f35efb5-6320-4339-a40e-a7868f793ef0.html", "downloaded_at": "2019-10-25 23:41:07.996947+00:00", "title": "A conversation on the future of AI.", "language": "en", "text": "The big picture: On Thursday morning, Axios' Cities Correspondent Kim Hart and Emerging Technology Reporter Kaveh Waddell hosted a roundtable conversation to discuss the future of AI, with a focus on policy and innovation.\n\nThe conversation touched on how to balance innovation with necessary regulation, create and maintain trust with users, and prepare for the future of work.\n\nThe relationship between the public and private sector\n\nDr. Mona Siddiqui, Chief Data Officer at HHS, in conversation at the Axios roundtable. Photo: Chuck Kennedy for Axios\n\nAs AI continues to become more sophisticated and more widely used, how to provide regulatory guardrails while still encouraging innovation was a focal point of the discussion.\n\nRep. Jerry McNerney (D-CA) stressed the importance of regulators being more informed about new technology: \"How can we best use resources? We need the expertise within the government to manage these developments as they come.\"\n\nstressed the importance of regulators being more informed about new technology: \"How can we best use resources? We need the expertise within the government to manage these developments as they come.\" Dr. Mona Siddiqui, Chief Data Officer at HHS, on the existing gaps at the federal level: \"Investment and infrastructure is lacking. A lot of departments need the support to build that.\"\n\non the existing gaps at the federal level: \"Investment and infrastructure is lacking. A lot of departments need the support to build that.\" Collin Sebastian, Head of Software Products and Engineering at SoftBank Robotics America, on how the government can serve as an effective partner to the private sector: \"One of the best ways the government can help without stifling innovation is to provide direction...If you give me a specific problem to address, that’s going to guide my development without having to create new legislation.\"\n\nAttendees discussed balancing regulation and innovation in the context of global competition, particularly with China.\n\nRob Strayer, Deputy Assistant Secretary of State for Cyber and International Communications Policy at the State Department, on the challenges of regulation in the context of international competition in AI development: \"We need to not impede growth of AI technologies and...[be] aware of a competitive international environment. Other countries won’t put [these] guardrails in.\"\n\nPreparing for the future of work\n\nWilliam Carter, Deputy Director and Fellow at the Technology Policy Program at the Center for Strategic & International Studies, answers a question on Thursday morning. Axios: Chuck Kennedy for Axios\n\nThe conversation also highlighted who is most impacted by technological development in AI, and the importance of future-proofing employment across all industries. As AI is something that touches all industries, the importance of centering the human experience in creating solutions was stressed at multiple points in the conversation.\n\nWilliam Carter, Deputy Director and Fellow at the Technology Policy Program at the Center for Strategic & International Studies, highlighted the importance of future-proofing systems: \" Creating trust is more than regulation and mediating algorithmic risk. [People want to feel that] AI can be a part of the world in which they can participate. [We should be] creating incentives for companies to retrain workers who are displaced.\"\n\nhighlighted the importance of future-proofing systems: Creating trust is more than regulation and mediating algorithmic risk. [People want to feel that] AI can be a part of the world in which they can participate. [We should be] creating incentives for companies to retrain workers who are displaced.\" Molly Kinder, David Rubenstein Fellow with the Metropolitan Policy Program at the Brookings Institution, on the importance of having a clear picture of who is most at risk to be adversely affected by AI job displacement:\n\non the importance of having a clear picture of who is most at risk to be adversely affected by AI job displacement: \"We’re finding that...the least resilient are the ones who are least likely to be retrained. Our insights suggest that we as a country are not equipped to help working adults.\"\n\n\n\n\"Latina women are the most at-risk group for AI [job displacement]...We need to make sure we’re human-centered in developing our solutions...[and that] we update our sense of who the workers are that are most being affected.\"\n\nCreating trust with users\n\nWith the accelerating development of AI, creating and maintaining trust with users, consumers, and constituents alike was central to the discussion.\n\nKristin Sharp, Senior Fellow at New America and Partner at Entangled, on how keeping people informed can create trust: \"People tend to be worried about their privacy when they don’t know what the end-use case is for the data that’s being collected.\"\n\non how keeping people informed can create trust: \"People tend to be worried about their privacy when they don’t know what the end-use case is for the data that’s being collected.\" Lindsey Sheppard, Associate Fellow at the Center for Strategic & International Studies, on the importance of seeing AI as part of social, economic, and educational systems that also need future-proofing: \"You’re not let off the hook if you’re not using AI. You need that infrastructure whether or not you’re using AI. You still need skilled workers that have those software and data skills.\"\n\nThank you Softbank Group for sponsoring this event.", "description": "A conversation on the future of AI.", "authors": [], "top_image": "https://images.axios.com/AUEV4dDZaT5w0eBuiiuO7O2S9VQ=/0x179:4000x2429/1920x1080/2019/10/25/1572014463315.jpg", "published_at": "2019-10-25"}