{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/News/video/bob-iger-65796591", "downloaded_at": "2019-09-23 17:30:20.835937+00:00", "title": "1-on-1 with Bob Iger Video", "language": "en", "text": "Transcript for 1-on-1 with Bob Iger\n\nOkay, George, as you know this, almost 100 years our parent company Disney has been a household name. Now, since taking over the helm in 2005, Bob iger has transformed them into a worldwide empire whose top grossing films have hit over $6 billion in box office sales worldwide. In 2018 alone 150 million people visited Disney parks worldwide including the monumental Shanghai Disney resort. Under Bob's leadership Disney acquired four powerhouse company, Pixar, marvel, lucasfilm and 21st century fox and the person behind it all is here live with us this morning, Disney chairman and CEO Bob iger who is hoping to help others achieve success by sharing his top principles on leadership. It's in his brand-new book called \"The ride of a lifetime: Lessons learned from 15 years as CEO of the Walt Disney company.\" You better give it up for Bob iger right now. No pressure. No pressure. Good to see you. Thank you very much. Thank you. Okay, as I said, there's no pressure at all interviewing -- none whatsoever. We're old friends. Yes, we are old friends and when you see the scope and magnitude, what goes through your mind first? Well, it seemed like an out-of-body experience a bit. I started at this company at ABC 45 years ago as I studio supervisor working on shows like \"A.M. America,\" the precursor to \"Good morning America\" and ABC sport, never expecting that I would end up having the opportunity to run one of the greatest companies in the world so I'm deeply appreciative. I try to remain humble. Sometimes it's not an easy but you know, I love what I do. I love the people I work with. I love the ride of a lifetime that I've had. You make it look so easy. The grace and I know I just have a quick aside. My momma met Bob at a wedding, way, way, back when in the '80s and Bob gave her his business that tells you how long ago it was and it was just -- my mom said at that time, Bob, and my mom was very intuitive but I talked to about her a lot. There was something about you and when I thought I knew a lot about you, having known you for so long but reading your book, when you talk about your family, I think this is something that a lot of folks are going to relate to, your father, a loving man but had his issue, had his challenges and you said you could tell by his footsteps when he came home what dad was showing up. Yes, he was a loving father and a great influence on my life. He was intellectually curious and he pushed me to be productive all the time. Which I guess in a way was like saying to his son, don't waste your time, maybe sounds a bit harsh but that's just who he was but he also had severe depression, manic depression and it created incredible mood swings and so it was quite unpredictable. He was unpredictable and we never quite knew what father would be coming home, whether he is's be in one of his down moods or one of his up moods, but it was something we -- my sister and I learned to live with over the years, reflecting on it I think it was probably a little bit more difficult than I even imagined at the time but it also created resilience and an ability to understand that the world was far from perfect and people were far from perfect, even loved ones and that mental illness was in fact just that, an illness. I appreciate because many people have dealt with that in hair own families. Your work ethic, it's been unbelievable. You want to share and you do that. What are the top principles that you learned that you think can help others? Well, clearly liking what you do and applying yourself, working hard. I think my self-satisfaction comes mostly from the fact that I feel like I've put in the work and that feels great. There are a number of things, I talk a lot about the need to be optimistic. That's mostly a leadership principle people don't like to follow pessimist, for instance, particularly true in the military when you think about it. I like taking bold steps, I think in today's world with all the change that is around us, that being timid and in some form or another trying to protect the status quo does not make any sense, doesn't work so I like being risky or not being risk averse. It's really important to be focused and to be decisive and, of course, to treat people fairly and well and to be accessible, to be communicative. To tell people what you expect of them as a for instance, set standards and to live by them so there are a number of things that I talk about in the book that have served me well. I try not to be too presumptuous about the meaning. They serve me well. I hope they will work for others but I don't know for sure. That's how it comes across. That is something that was pervasive throughout the book about your optimism. That was quite apparent. Also and I told you this, Steve jobs, former -- the co-founder of apple, oh, my goodness. You are new in your tenure as CEO and wasn't a given and write about how tenuous it is and you're new on the job, we'll acquire Pixar way was big at the time and the relationship between Pixar and Disney wasn't at its best so 30 minutes before this acquisition is going to be announced, Steve jobs shares something very personal with you. Right, Steve was the controlling shareholder of Pixar. He had bought it from George Luke characters owned half of it and we decided to acquire Pixar for $7.4 billion in 2005. Excuse me. 7.4. And you're new on the job. And we were announcing the deal at Pixar when the stock market closed about 1:00 in the pacific coast and he asked me an hour before to go for a walk. We went for a walk on the Pixar campus, beautiful campus, sat on a bench. Put his arm behind me and said I'm going to tell you something that only my wife and my doctor knows and I said what's that. He said, I have cancer, again, he had had cancer a few years earlier. Announced that he was cured and said it's back. And I said, well, why are you telling me this? And he said I'm giving you a chance to back out of the deal and I looked at my watch and I realized we're announcing the deal in less than an hour at that point. I had no idea what to do. He made me promise not to tell anyone an so I thought about it and thought about it and thought about it. Ultimately decided there was no way I could back out of the deal since I couldn't really counsel anyone or ask for anybody's counsel, I just made that decision and out we went and announced the deal. Two of us standing on the podium smiling holding that Pixar lamp as though nothing had happened and meanwhile inside me I'm in tear, I'm crying actually within, knowing that I'm standing with someone who I admired greatly and had such a positive influence on the world and that he might not be around very long. And you're married to Willa bay who knew Steve very well and how you wrote about how emotional it was that night when you went home and willow has been one that has said to you, be bold and to take risks. What is the one risk that you here Pixar and marvel and then lucasfilm and other, as well. But what is the one that kept you up most at night? I've been really lucky over the years in that I sleep well and I don't suffer from great anxiety over these decisions that we've made and so while they all seem very risky, I was determined in each case to see the deals through and I believed in them so much, mostly because in all of those acquisitions we were acquiring people in that each company that we bought Pixar, marvel, lucasfilm and 21st century fox had great talent there and I just knew that if we showed them respect, gave them support, that they would continue to thrive even under Disney so I didn't really lose sleep over those things. I'm fortunate, I guess, over the years that I -- maybe it's enabled me to be a little more bold than perhaps I would have been. I don't lose sleep. I don't get much sleep either. Can I just say wakanda forever. Thank you very much. That was bold. That was big. And, you know, there were some folks that were saying, Bob, that's never going to work. Yes and making \"Black panther.\" You asked whether I lost sleep. That I definitely did not lose sleep. I did not think that was a risk. I believed strongly in the need to tell stories involving more diverse people and essentially telling stories that better reflected the world that we live in that is a far more diverse world than ever before and it was time we made a superhero film, a marvel film starring a black character with a predominantly black cast and we put it in the hands of a director and creator named Ryan coogler, had done two movies, \"Creed\" among them and had never done a movie of that scale and had such a great vision for that film that we just gave him the support that he needed and went along for the ride and it was a great one. I think one of the highest moments maybe a moment that I felt more pride than ever before was bringing \"Black panther\" out, showing it to the w0r8. I remember being at the premiere and sitting for the first time with an audience. In fact, I think you and I might have communicated right after that because you came to the new York premiere and feeling such a strong sense of pride and accomplishment. Not necessarily for me but for the company, for marvel and for Ryan coogler and that brilliant cast and costume designers and set designers and the music was tremendous. It was -- it was an artistic accomplishment that had a huge cultural impact. It did and it was all about Disney as well. The time that we have remaining I could ask you what you're doing next. I don't know if it's going to be going back to your roots. Do you know he was a weatherman. Did you know that, also he starred in was it ithaca. You were a reporter. But don't trust me. Oh, don't show that. Here we go. Roll the tape. Tonight a look at ithaca college winter weekend. A new campus credit union and pluses and minuses are reinstated. Also a sampling of student opinion on a drug policy for ithaca college and a summary of this week's sports events. That is talent. Good evening, I am Bob iger. Your voice. What is next, Bob? 2021 is going to be coming up. What is next? I don't know what's next. As I said earlier I've been at this for 45 years and had a great ride. I've loved every moment of it and I have no need to make any plans post-disney. Maybe I'll just go to disneyland. What are you going to do next, go to disneyland. That would be a good line? I'd have to wait in line though. I got to tell you, it's been a heck of a ride and thank you for takening us along on that ride with you. Pleasure. Thank you for having me. Ginger, the ride of a Beautiful sunshine and the\n\nThis transcript has been automatically generated and may not be 100% accurate.", "description": "Walt Disney's CEO discusses his new book,", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/190923_gma_iger_hpMain_16x9_992.jpg", "published_at": "2019-09-23"}