{"pub": "guardian", "url": "https://theguardian.com/artanddesign/2019/sep/30/kara-walker-turbine-hall-review-a-shark-infested-monument-to-the-victims-of-british-slavery", "downloaded_at": "2019-10-01 00:12:55.287166+00:00", "title": "Kara Walker Turbine Hall review – a shark-infested monument to the victims of British slavery", "language": "en", "text": "The real challenge of Kara Walker’s Fons Americanus is not the scale of her 13 metre-high fountain in Tate Modern’s Turbine Hall. Nor that at first glance, we are faced with an outmoded work of monumental public sculpture, populated by figures and sea creatures, which towers towards the roof, accompanied by the sound of rushing water. The challenge, instead, is one of tone.\n\nTate Modern fountain tells 'jarring' history of British empire Read more\n\nOne of Walker’s reference points has been the Victoria Memorial in front of Buckingham Palace: a great, ludicrous heap of marble and gilded nonsense, topped by a Winged Victory – so Fons Americanus is also a heap of allusions and references, humour and horror. Playing on an odious sentimentality, inverting stereotypes, Walker’s aim is to entertain as she instructs. Fons Americanus is a sustainable, non-toxic, solvent-free, marble-like gift, a monument not to the beneficiaries of the British empire, but to its victims, and to the hypocrisies and accommodations to evil that led to slavery.\n\nPart-way down the Turbine Hall ramp, a black boy is up to his chest in a lake of his own tears in an open conch shell, a pearl in an oyster, drowning. In the fountain, sharks – rather than dolphins – sport in the spume.\n\nDescribing her work, in its full, lengthy cod-18th century title (which she has printed on the Turbine Hall wall) as an “allegorical wonder”, Walker lards up an already over-the-top monument. How could it be other? This miserable monument to the slave trade and colonialism is a ripe and fitting cenotaph to imperial ambition, and the human and material profiting on misery at the heart of empire.\n\nFacebook Twitter Pinterest Sardonic … Fons Americanus by Kara Walker at Tate Modern. Photograph: David Levene/The Guardian\n\nHer sculpted allegory owes its edge to the regency-era political cartoons of James Gillray and Thomas Rowlandson, and also to its multilayered, internal references. JMW Turner’s abolitionist painting Slave Ship, originally titled Slavers Throwing overboard the Dead and Dying – Typhoon Coming On, is rendered as a bath-toy frigate, riding plaster waves. Walker nods to Damien Hirst’s shark in formaldehyde, but one must also think of John Singleton Copley’s 1778 painting Watson and the Shark. Twelve-year-old Brook Watson was saved following a shark attack in Havana harbour, and Copley’s painting shows him rescued by a small group of sailors, including a black man. Watson went on to become a British MP and Lord Mayor of London. He also voted against the abolition of slavery.\n\nThe black man adrift in a rowing boat is taken from Winslow Homer’s 1899 painting The Gulf Stream, but the name engraved on the back of the craft is K West – a reference either to Key West, in the Straits of Florida, or to Kanye West (West, like Walker, spent his childhood in Atlanta). Or both.\n\nFacebook Twitter Pinterest Allegory … the ramp sculpture of a tearful boy Photograph: Guy Bell/Rex/Shutterstock\n\nWalker’s art, with its frequent, sometimes controversial use of antebellum imagery, is in any case a shark-infested pool of citations. Venus, naked on the top of the monument, throws her head back and spurts water from her nipples and her cut throat, which arcs noisily to the pool below. Is this Tintoretto’s The Origin of the Milky Way? And who is the seated black buccaneer captain in his four-league boots? And what of the boy with the snorkel, playing oblivious in the water? The man holding a figure whose back is riddled with bullet-holes, the Gillray-like bewigged figure praying, and the figure with seaweed-braided hair (or are they dreadlocks?) in the pool, and the figure crouching under the raised skirt of an African Caribbean deity all have their referents. We are never far from lynchings in Walker’s work, and here’s a noose, dangling from a branch.\n\nTurbine Hall artist Kara Walker: 'Apparently, the only thing I am is black' Read more\n\nThe key reference in the work is Thomas Stothard’s preposterous and disgusting 1801 engraving of a black Venus, carried on a shell, wafted across the Atlantic by white cherubs and a Neptune bearing a Union Jack. The engraving was used in 1801 as the frontispiece to a pro-slavery book entitled The History, Civil and Commercial, of the British Colonies in the West Indies. Walker invites us to “marvel and contemplate”, to “Gasp Plaintively, Sigh Mournfully and Gaze Knowingly and Regard the Immaterial Void of the Abyss” in what she calls a “Delightful Family Friendly Setting”. Fons Americanus is sardonic, barbed, monstrous, absurd, astonishing and funny, tipping over into the obscene. Monuments are always troubling, and rarely to be trusted. Walker has got the tone just right.", "description": "Tate Modern, LondonThe controversial American artist has made a giant fountain and filled it with sharks, tears, slave ships, stricken souls and a noose. It’s monstrous, funny, absurd – and astonishing", "authors": ["Adrian Searle"], "top_image": "https://i.guim.co.uk/img/media/359f91761d33aebc37692f499e05aeb127c80af3/194_804_7517_4511/master/7517.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTQucG5n&enable=upscale&s=fac30cc58c66449365e475521986ce96", "published_at": "2019-09-30"}