{"pub": "news24", "url": "https://news24.com/Columnists/GuestColumn/ramaphosa-needs-to-be-read-the-riot-act-20190804", "downloaded_at": "2019-10-05 10:36:18.472963+00:00", "title": "Daniel Silke: Ramaphosa needs to be read the riot act", "language": "en", "text": "Daniel Silke: Ramaphosa needs to be read the riot act\n\nAn activist citizenry is now essential as the alternative is to be reduced to a passive, helpless side-line view as SA Inc sinks. It may be too late to just \"hope\" that the president's faction will prevail on its own, writes Daniel Silke.\n\nIt has been a grim week in South Africa.\n\nThe destabilisation of the Ramaphosa Presidency from elements within the ANC, from the institutions of state and – more broadly – from radical parties outside continues unabated.\n\nDislocating the ability of President Cyril Ramaphosa to govern has resulted in an inertia from within causing increasing societal consternation and a fear of – at best – a \"neutered\" Presidency or at worst, a truncated term-of-office leading to a return of the Zuptoids.\n\nAll this is occurring as unemployment reaches crisis proportions and spiralling debt (led by Eskom) threatens the approach of a fiscal cliff and its manifold concomitant dangers.\n\nAs the chattering classes contemplate financial or physical emigration, and tax revenues look set to undershoot required estimations, South Africa is indeed a troubled land.\n\nBut we should not just sit back and watch the ship flounder, rather we should raise our collective voices to pressure the president to take urgent corrective action.\n\nCyril Ramaphosa is an unusual South African president. Perhaps afraid of his own shadow, his support in the ANC has always been marginal. Ironically and notwithstanding the confines of the narrow-minded (and sometimes myopic) party-political debate, the president still enjoys the goodwill of a large proportion of South Africans – whether they voted for the ANC or not.\n\nIn large measure, a broad swathe of South Africans is willing the president to succeed and hold off the challenges from his detractors.\n\nThese many millions breathed a collective sigh of relief when he was elected as party president at Nasrec in December of 2017. Despite deep frustration and concern they would readily support his side of the factional battles even though they might put their crosses behind other political parties and have very divergent views on alternative economic models for the country.\n\nWhile political parties will pontificate on their own ideological offerings, South Africa – and the ANC with it – has now reached such an extreme state of distress, that the greater good of the maintenance of the Ramaphosa faction can now find support across party lines.\n\nWhat this means is that Ramaphosa derives his support not just from the ANC. He embodies a broader backing while simultaneously struggling to secure this from within his own party. He may think that he primarily needs to satisfy his own ANC apparatchiks, but he has another constituency outside of the formal ANC structures equally, if not more keen to see him succeed.\n\nPart of the \"external\" constituency helped him get elected. From large domestic financial and industrial institutions down to black professionals, SMMEs, entrepreneurs, sole traders and the Goldman Sachses of this world. Foreign missions in South Africa rejoiced at his election with the Chinese only this week suggesting he was still \"the last hope for South Africa\". Ramaphosa hasn't lost these backers – but many sit wringing their hands in deep despair seemingly unable to take a pro-active role in changing the prevailing discourse.\n\nWithin the domestic NGO context, the promise of a cleaner administration under Ramaphosa was also supported, and a broad centrist collation of ordinary South Africans largely agreed – even if they were at odds with each other on ideology.\n\nRamaphosa therefore was not only elected by the ANC as a party, he was supported by a variety of cross-cultural, ethnic and economic interests all with the common desire for a better South Africa.\n\nRamaphosa's legitimacy is technically derived from those 2 440 delegates at Nasrec who put him just ahead of Nkosazana Dlamini-Zuma but it is putatively from a much wider base; much wider even than the 57% of registered voters who supported the ANC in May.\n\nIt is this wider constituency that is now disillusioned. It covers all interest groups in South Africa and is a diverse cross-cutting coalition of centrists found in all political parties, economic spheres and geographic corners of this land.\n\nBut, now is the time for this coalition of forces to begin to pressure the president to act with greater strength, commitment and vigour.\n\nTo this end, while the president requires signs of visible support, he also requires signs of visible pressure. While he might be struggling to command a working majority inside the ANC, he must know he has it outside the ANC. Those outside should not hold back.\n\nFirst-and-foremost, the business community (big and small) needs to mobilise. While they were happy to see Ramaphosa elected, how quiet they have become as disruption and disillusionment dominate the domestic discourse.\n\nSitting on the side-lines – as they have regrettably done before – is a dereliction of duty and they fail the country by simply acquiescing to the status quo. Instead of waiting for the president to call a summit, they should summons him – after all, the president is but a civil servant and answerable to each and every citizen.\n\nSimilarly, civil society don't need to agree on the nuts and bolts of policy platforms. But they too need to express themselves in a new \"coalition of the willing\" to bolster the president.\n\nBut lest you think this suggests sending the president a pretty greeting card of encouragement, think again. It has to be much tougher. It has to call him to account on the need to speed up policy reform, act on graft and implement best policy practice to underpin economic growth.\n\nAnd, following the News24 email leaks of this weekend, the broader public are clearly owned a fuller and much more transparent understanding of the nature of the CR17 campaign – lest this alleged subterfuge undermine the goodwill the president still has amongst his wider support base.\n\nThe president needs to be read the proverbial riot act. It has to pressure him – and support him – in this battle royal. It also has to begin to redefine a new political order in which those keen to rescue South Africa find common ground – as complex and idealistic as that might sound.\n\nIt is therefore time for some \"tough-love\" for President Ramaphosa. And, the inability of the ANC to find a clear path now calls for the broader society to make a stand. South Africa has had a variety of \"national convention\" moments in the past – and we might be approaching yet another in the near future.\n\nOrdinarily, existing opposition parties – like the DA – would need to lead the charge. But, caught up in their own lacklustre performance, something else outside of political labels is required.\n\nAn activist citizenry is now essential as the alternative is to be reduced to a passive, helpless side-line view as SA Inc sinks. It may be too late to just \"hope\" that the president's faction will prevail on its own. It might need a broader societal intervention for this to occur.\n\nThe good news is that when South Africans do eventually stand together, they are remarkably successful and resourceful. It's something to work on.\n\n- Daniel Silke is director of the Political Futures Consultancy and is a noted keynote speaker and commentator. Views expressed are his own. Follow him on Twitter at @DanielSilke or visit his website.\n\nDisclaimer: News24 encourages freedom of speech and the expression of diverse views. The views of columnists published on News24 are therefore their own and do not necessarily represent the views of News24.", "description": "It may be too late to just \"hope\" that the president's faction will prevail on its own. An activist citizenry is now essential, writes Daniel Silke.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8971/20d6cbb605de46b7a369cbf8bb378d22.jpg", "published_at": "2019-08-04"}