{"pub": "independent", "url": "https://independent.co.uk/news/world/africa/lion-poaching-south-africa-black-magic-muti-traditional-medicine-a9175946.html", "downloaded_at": "2019-10-30 00:01:24.699715+00:00", "title": "Lions found with paws and jaws hacked off by poachers ‘for magic potions’", "language": "en", "text": "Four lions in an urban game reserve in South Africa are believed to have been fed poisoned meat which painfully killed them, before poachers butchered them, removing jaws and paws apparently for use in \"magic potions\" and occult rituals.\n\nPolice in Pretoria were reportedly “working around the clock” to apprehend the suspects behind the killing of the rescued lions at the Rietvlei Nature Reserve in Tshwane on Thursday night, according to local reports.\n\nThe carcasses of the slain animals were found by officials on Friday morning, all four missing their lower jaws and their paws, which are prized in “muti” – a term for traditional medicine in southern Africa closely associated with magic and witchcraft.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nInvestigators have said the criminals are believed to have known the exact layout of the facility.\n\nDana Wannenburg, who works for the local government’s environment department, told South African news outlet Independent Online: “These people knew how to gain access through the main roads and where to cut into the fences to gain access to the lions. No ordinary person could have known that information.”\n\nShape Created with Sketch. Neglected lions at breeding programme in South Africa Show all 6 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Neglected lions at breeding programme in South Africa 1/6 Horrific conditions of captive bred lions on a captive lion breeding farm in South Africa Humane Society International 2/6 Horrific conditions of captive bred lions on a captive lion breeding farm in South Africa Humane Society International 3/6 Horrific conditions of captive bred lions on a captive lion breeding farm in South Africa Humane Society International 4/6 Horrific conditions of captive bred lions on a captive lion breeding farm in South Africa Humane Society International 5/6 Horrific conditions of captive bred lions on a captive lion breeding farm in South Africa Humane Society International 6/6 Humane Society International 1/6 Horrific conditions of captive bred lions on a captive lion breeding farm in South Africa Humane Society International 2/6 Horrific conditions of captive bred lions on a captive lion breeding farm in South Africa Humane Society International 3/6 Horrific conditions of captive bred lions on a captive lion breeding farm in South Africa Humane Society International 4/6 Horrific conditions of captive bred lions on a captive lion breeding farm in South Africa Humane Society International 5/6 Horrific conditions of captive bred lions on a captive lion breeding farm in South Africa Humane Society International 6/6 Humane Society International\n\nSpeaking after the killing of the lions, he said: “This brutal act will not go unpunished and Tshwane Conservation officials, SAPS (South African Police Service) and national and provincial departments will work round the clock to identify and apprehend the perpetrators.\n\n“Rietvlei’s lions were the pride of Tshwane and a major tourist attraction, and their loss will be felt for many years to come.”\n\nSecurity had now been stepped up to protect remaining animals, he added.\n\nHead ranger Bradden Stevens said his world had been “turned upside down” by the deaths of the lions which he had worked with for 10 years.\n\n“My heart is breaking for my four boys and girls and I am in a very dark place right now,” he said, according to MailOnline.\n\nHe added: “I am convinced these lion parts do not go far but find their way into local muti markets with muti being body parts that are used to make traditional medicines or magic potions.”\n\nHe explained the four lions killed were rescued animals that could not have been released into the wild as they would be unable to feed properly and survive.", "description": "Four lions in an urban game reserve in South Africa are believed to have been fed poisoned meat which painfully killed them, before poachers butchered them, removing jaws and paws apparently for use in \"magic potions\" and occult rituals. Police in Pretoria were reportedly “working around the clock” to apprehend the suspects behind the killing of the rescued lions at the", "authors": ["Harry Cockburn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/29/13/lions.jpg", "published_at": "2019-10-29"}