{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7575983/Klose-heaps-praise-fellow-Bundesliga-legend-Lewandowski-says-hes-10-times-better.html", "downloaded_at": "2019-10-15 16:32:47.548961+00:00", "title": "Klose heaps praise on fellow Bundesliga legend Lewandowski and says he's 10 times better", "language": "en", "text": "Both have scored upwards of 200 goals in their glittering careers, but Miroslav Klose insists that Robert Lewandowski is TEN times the player he ever was.\n\nKlose is a Bundesliga legend with 121 goals across 307 appearances for Werder Bremen, Kaiserslautern and Bayern Munich - while Lewandowski has 309 and counting for Dortmund and Bayern.\n\nAlthough Klose's numbers are small in comparison to his fellow striker, it was on the international stage that he thrived - and he perhaps best-known as the record goalscorer at World Cup finals with 16 goals spread across four tournaments.\n\nRobert Lewandowski is one of the Bundesliga's best-ever goalscorers and he is still climbing\n\nThe Bayern striker (right) has been called '10 times better than Miroslav Klose' by Klose himself\n\nDespite his impressive achievements, a self-deprecating Klose told Bild: 'Robert Lewandowski plays a bit like I did, but he's 10 times better than I ever was.\n\n'He's the complete striker, uses both feet, is strong in the air and has a great shot on him.'\n\nLewandowski is currently fourth in the all-time Bundesliga scoring charts behind Gerd Muller, Klaus Fischer and Jupp Heynckes with a stunning 213 goals in 297 appearances. He is sure to climb higher in that list in the coming months.\n\nKlose, meanwhile, is still working behind the scenes at Bayern and took over their Under 17s side in the summer of 2018. So far this season, they are second in the B-Junioren Bundesliga Sud, a point behind leaders Hoffenheim.", "description": "Both have scored upwards of 200 goals in their glittering careers, but Miroslav Klose insists that Robert Lewandowski is TEN times the player he ever was.", "authors": ["Ben Nagle For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/16/19748148-0-image-a-80_1571153505702.jpg", "published_at": "2019-10-15"}