{"pub": "theverge", "url": "https://theverge.com/2019/7/17/20696238/apple-macbook-pro-13-inch-2019-review-specs-price-features", "downloaded_at": "2019-10-05 14:13:02.663328+00:00", "title": "Apple’s new entry-level 13-inch MacBook Pro is an obvious upgrade", "language": "en", "text": "There’s a new entry-level MacBook Pro in town. An “entry-level pro” machine is a bit of an oxymoron, so the best way to look at this computer is to think of it as an upgrade to the mainstream MacBook Air — one that doesn’t command the extremely high price tags of the rest of Apple’s MacBook Pro lineup.\n\nThis particular model starts at $1,299 and replaces the entry-level MacBook Pro from 2017. It brings along a few new features and upgrades, most notably a much more capable processor and the ability to log in with your fingerprint. It’s a much better upgrade over the Air than the prior model, and I think it’s certainly worth the $200 premium you’ll pay to get it. For that price, you’ll get a faster, quieter, more powerful machine and I’d strongly recommend considering it if you’re looking at the MacBook Air.\n\nBut this is still a MacBook, and it comes with a lot of the baggage and bugbears that have plagued every new MacBook released since 2015. Primarily, it has the super low-profile “butterfly” keyboard, which has proven to be horribly unreliable over the years. Apple says this latest revision should be more reliable than before, but that’s impossible to confirm after a week of testing. At any rate, this brand-new computer is included in Apple’s Keyboard Service Program right from the get-go. That could either inspire confidence or concern, depending on how you look at it.\n\nIf you need to buy a new laptop this year and you want one with macOS, you’re going to have to live with the butterfly keyboard, as it’s the only option across the entire lineup. That makes the new entry-level Pro the best model for most people, as it has more power and provides a better overall experience than the Air for everyday tasks, but doesn’t cost nearly as much as Apple’s higher-end MacBook Pro models.\n\nOur review of MacBook Pro with 2 ports (13-inch, 2019) Verge Score 7.5 out of 10 Good Stuff Snappy performance\n\nQuiet fan\n\nClass-leading trackpad\n\nBright, sharp display\n\nTouch ID is excellent Bad Stuff Keyboard reliability is a real concern\n\nOnly two USB-C ports and… nothing else\n\nJust average battery life Buy for $1,299.00 from Apple Buy for $1,274.99 from Walmart\n\nApple’s MacBook Pro line has turned out to be one of the most controversial tech products of the past few years. Beyond the already-mentioned keyboard, the last major design revision ditched all ports save for USB-C and traded the standard row of function keys for the Touch Bar on the higher-end models. That last feature has now made it to the entry-level MacBook Pro, leaving only the MacBook Air with physical keys for brightness, volume, and escape in Apple’s lineup.\n\nThe base configuration of the MacBook Pro 13 comes with an 8th Gen Core i5 quad-core processor, 8GB of RAM, and 128GB of storage. I’d strongly recommend upgrading that storage to 256GB for $200 more, since it’s not possible to increase it after the fact. As an upgrade pick to the MacBook Air, it does mean spending quite a bit more over the very base model Air — but you’d be spending more to get that amount of storage on the Air anyway.\n\nIf you’re feeling extra spendy, upgrade the RAM to 16GB for yet another $200 more. Most people will be fine with 8GB of RAM and 256GB of storage, though the model I’ve been using for the past week does have 16GB of RAM and it’s worked very well in my tests. If your budget comes down to either larger storage or more RAM, however, go with the increased storage.\n\nThe new processor is surprisingly capable and well cooled\n\nThe new processor, which has a base clock speed of just 1.4GHz but can “turbo” up to 3.9GHz, has been stellar in my testing. Though its base speed is much lower than the old 2.3GHz dual-core chip in the prior version, it has no trouble handling everyday productivity work, including juggling multiple browser windows with many open tabs; simultaneously running apps like Word, Excel, Slack, email, and other typical programs used in a modern office environment; and switching between multiple virtual desktops frequently. The MacBook Pro gives you noticeably more headroom for this kind of multitasking work, so you don’t have to worry as much about opening that one extra app or browser tab that can slow down the MacBook Air.\n\nThe Core i5 processor can also easily edit photos in Apple Photos, Adobe Photoshop, or Lightroom, and if you occasionally need to do video editing, it can power through that, too. I don’t think there’s much benefit to spending $300 to upgrade to the slightly faster Core i7 chip in this model, as its performance advantage will likely be limited by the thermal constraints of the Pro’s thin design. (If you are buying a laptop primarily for video editing, however, I’d strongly recommend stepping up to the more expensive four USB port-equipped 13-inch or even better, 15-inch, MacBook Pro models, which have even more powerful processors and graphics card options designed specifically for that kind of work.)\n\nSurprisingly, even with the same overall chassis design, the new MacBook Pro stays far cooler than the prior model, with temperatures hovering below 50 degrees Celsius the vast majority of the time. That means the fan (yes, singular, it only has one) almost never comes on — in fact, during my week of using the Pro for all of my work, the fan only spun up once while I was doing standard productivity tasks. That’s far better than the old dual-core model or the MacBook Air, whose fans will spin to a mighty roar with just a few Chrome tabs open. It’s not enough for me to say this is as quiet as a truly fanless computer — an import or export of RAW image files in Lightroom will certainly bring the fan to life — but it’s much more pleasant to work at than the other models that seem to be blowing air more often than they are not.\n\nThe Touch Bar, which replaces the standard row of function keys with a touchscreen strip, has been quite controversial since its launch, with many MacBook Pro customers lamenting the loss of physical keys for brightness, volume, and most importantly, the escape key. And while the Touch Bar’s design allows for more contextual flexibility than fixed keys, it seems that most people are just using it for the same things they used function row keys for before: adjusting volume, changing the brightness, and hitting the escape key.\n\nPersonally, I can take or leave the Touch Bar. I don’t find it that much harder to use in my everyday work to adjust the volume or brightness, and while I occasionally like the contextual options that pop up in different apps (especially the ability to shrink a YouTube video playing in Safari to picture-in-picture mode), I don’t think I’d miss the Touch Bar if it wasn’t there. I would miss Touch ID, however, as it’s a much easier way to log in to the computer with my fingerprint than typing out a password.\n\nKeyboard reliability remains the dark cloud looming over everything\n\nOf course, as I mentioned earlier, the most controversial thing about any new MacBook is its keyboard. The new entry-level MacBook Pro still has the extremely low-profile butterfly switch keyboard found on the prior model and every other MacBook you can buy right now, but it has been revised with the “new materials” and dust shield that Apple introduced in later iterations. This has the effect of making the keyboard slightly quieter to type on, but these changes are primarily to improve the reliability of the keyboard, so it’s less likely to succumb to stuck or doubling keys because a tiny piece of dust got lodged in the switch. I’m hesitant to say Apple has “fixed” this keyboard, but it has worked fine during my review period.\n\nAside from the very real reliability concerns, the low-profile keyboard is something you either viscerally hate to type on or don’t mind at all. I’m in the latter camp — I find the size and spacing of the keys very comfortable under my fingers and I don’t mind the low travel. I do appreciate that it is a little bit quieter than before, as well.\n\nThe trackpad is exactly the same as before, and it remains the best trackpad you can get on any 13-inch laptop. It’s enormous, silky smooth, and extremely responsive to multifinger swipes and gestures. Apple also has the best palm-rejection I’ve ever used, preventing the cursor from jumping around erratically when I’m typing.\n\nBest-in-class trackpad, but only average battery life\n\nAlso the same as the outgoing entry-level Pro is the port selection: you get two Thunderbolt 3 USB-C ports on the left and a 3.5mm headphone jack on the right. You’ll need to use one of those ports to charge the computer, and unless you have a fleet of brand-new accessories that already have USB-C cables, you’ll need dongles and adapters to plug anything else into the other port. It’d be wise to budget for a few USB-C dongles or even a full-fledged hub when you purchase this computer. That’s the same number of ports you get on the MacBook Air and two short of what you get on higher-end MacBook Pro models.\n\nApple did appear to change the speakers in this model — they aren’t quite as full-sounding as before. I don’t think they are bad by any stretch, and they run laps around the speakers you get on most Windows computers, but they are noticeably tinnier sounding than on other MacBook Pro models.\n\nFinally, while Apple claims this latest MacBook Pro can get up to 10 hours of battery life between charges, my experience with it has been closer to six and a half to seven hours. That’s a little less than I prefer — if I can’t get through a full eight-hour day with the brightness set to 50 percent and running my usual suite of a web browser, Slack, email, Tweetdeck, Word, Excel, and other productivity apps, I’m a little disappointed. Battery life was the same whether I used Safari or Chrome, as well, in case you were wondering if changing the browser makes a meaningful difference with this computer.\n\nOverall, this latest entry-level MacBook Pro addresses some of the issues from the prior model, while still leaving the door wide open for improvement on others. This machine performs better, is quieter and cooler to the touch, and is overall more pleasant to use than the model it replaces or the current MacBook Air.\n\nThe MacBook line is full of compromises, but the entry-level MacBook Pro is the right compromise for most people\n\nIf you look at the entire MacBook lineup right now, you’ll find compromises aplenty. The Air is slightly underpowered, this Pro only has two USB ports, and even the higher-end models have faced complaints about their thermals, not to mention the high prices they command. But on the whole, I think this entry-level MacBook Pro is the ideal compromise for the vast majority of buyers: you get much better performance over the Air, while not having to spend nearly as much as the higher-end MacBook Pro models. Most people needing a laptop for school or productivity work will be well-served by this model. Unless you have particular and demanding needs, and you know who you are if you do, this model is more than capable of handling most anything thrown at it.\n\nHopefully this will be the last MacBook Pro where we have to worry about the keyboard breaking, as Apple is rumored to release a new design in the next year or so that utilizes an entirely new keyboard setup. But until that happens, if you’re looking to buy a new MacBook for school or work, this entry-level MacBook Pro is the one to get.", "description": "Apple’s latest entry-level MacBook Pro is the best option for most people looking for a new MacBook, but that doesn’t mean it’s perfect.", "authors": ["Dan Seifert", "Jul", "Photography Amelia Holowaty Krales"], "top_image": "https://cdn.vox-cdn.com/thumbor/gOewgO9zI0WevqY9OCBKzQT4peo=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18311681/akrales_190711_3536_0019.jpg", "published_at": "2019-07-17"}