{"pub": "reuters", "title": "Exclusive: Telia offers concessions as EU probes Bonnier deal - EU document", "url": "https://in.reuters.com/article/bonnierbroadcasting-m-a-telia-company-eu/exclusive-telia-offers-concessions-as-eu-probes-bonnier-deal-eu-document-idINKCN1VN1RD", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:08:07.593663+00:00", "text": "BRUSSELS (Reuters) - Swedish telecoms operator Telia has offered concessions to allow rivals fair access to its TV channels to address EU antitrust concerns about its $957 million bid for Bonnier Broadcasting, an EU document seen by Reuters showed.\n\nFILE PHOTO: Telia sign is seen on a building in Vilnius, Lithuania March 30, 2019. REUTERS/Ints Kalnins/File Photo\n\nTelia announced the Bonnier deal in July last year, underlining the telecoms industry’s attempt to try to compete with big internet players such as Netflix and Amazon by acquiring media companies.\n\nBut EU competition enforcers expressed concerns about the deal such as the possibility of rivals being unable to access Bonnier’s TV channels once the deal is completed, or blocked from accessing TV advertising space on its free-to-air and basic pay TV channels in the markets for retail mobile telecommunication, fixed internet and TV services.\n\nTo allay the European Commission’s worries, Telia has offered to grant TV distributors in Sweden and Finland fair and reasonable access to its free-to-air and basic pay TV channels, according to the document.\n\nTelia also offered fair access to its premium sports channels and the Liiga channel package which features the first division men’s Finnish ice hockey league.\n\nTelia also pledged to grant a licence to its TV channels to one internet provider in Sweden and Finland respectively, and committed to sell advertising space on its TV channels on fair and reasonable terms to telecoms providers and TV distributors in Sweden and Finland.\n\nThe concessions are likely to assuage regulatory concerns and ensure the deal gets through, said a person familiar with the matter.\n\nThe Commission, which is scheduled to decide on the deal by Nov. 19, declined to comment.\n\nTelia said: “In order not to interfere with this process, we do not want to go into detail about what concessions have been offered.”\n\nBonnier’s brands include Sweden’s biggest commercial broadcaster TV4, streaming service C More and Finnish MTV. It competes with state broadcaster SVT. Critics have cited media plurality in Sweden and Finland as one reason for concerns about the deal.", "description": "Swedish telecoms operator Telia has offered concessions to allow rivals fair access to its TV channels to address EU antitrust concerns about its $957 million bid for Bonnier Broadcasting, an EU document seen by Reuters showed.", "authors": ["Foo Yun Chee", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190902&t=2&i=1425459837&w=1200&r=LYNXNPEF811E7"}