{"pub": "metro", "url": "https://metro.co.uk/2019/10/14/poundland-is-selling-harry-potter-inspired-invisibility-cloaks-for-free-10909843", "downloaded_at": "2019-10-14 10:12:31.466994+00:00", "title": "Poundland is selling Harry Potter-inspired invisibility cloaks for free", "language": "en", "text": "He’s looking for the right size (Picture: Poundland)\n\nSo long as Potterheads live, Harry Potter fever will never truly die.\n\nThe magic of the wizardry world endures, with people willing to part with their cash for Potter-themed weddings, educational institutions, even Christmas dinner.\n\nBut usually, you get something tangible for your money – a cute replica, an experience, memories or furniture to show your guests that you stan Gryffindor.\n\nPoundland’s latest Potter offering is something a little more quirky, and a little less real – an invisibility cloak.\n\nExcept, as its name suggests, the cloak is invisible meaning you can’t see it. Therefore it’s non-existent.\n\nDon’t worry though, the budget retailer isn’t just exploiting people’s enthusiasm for all things Harry, they’re actually offering the ‘cloaks’ for free.\n\nSo, in essence, you get to come away with a free hanger. Neat.\n\nCan’t miss it (Picture: Poundland)\n\nAs part of their largest Halloween offering, Poundland’s latest venture comes in the form of a purple card with the words ‘invisibility cloak FREE’, which is handy as there’s no fabric to help you work out what it is.\n\nLet’s hope it doesn’t sell out.\n\nAdvertisement\n\nAdvertisement\n\nMORE: It wasn’t a love of Harry Potter that drove me to join a Quidditch team\n\nMORE: You can now study Harry Potter law at university\n\nMORE: Boots launches Harry Potter themed beauty advent calendar\n\nAdvertisement Advertisement", "description": "As part of their largest Halloween offerings, Poundland's latest venture comes in the form of an invisibility cloak.", "authors": ["Faima Bakar"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89696165_1571039799.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-14"}