{"pub": "nytimes", "url": "https://nytimes.com/2019/10/16/world/australia/china-tulagi-solomon-islands-pacific.html", "downloaded_at": "2019-10-16 13:32:20.694421+00:00", "title": "U.S. Marines Fought and Died for an Island. China Just Leased It.", "language": "en", "text": "“They cannot come in and lease the whole island like that,” said Michael Salini, 46, a business owner on Tulagi who is helping organize a petition to oppose the China Sam agreement.\n\n“Everyone is really scared about the possibility of China turning the island into a military base,” he added. “That is what really scares people — because why else do they want to lease the whole island?”\n\nA military installation would carry strategic and symbolic significance. Some American officials believe China’s efforts in the region echo the period before and during World War II, when Japan wrested control of island assets, which were won back in turn by American and Australian troops in bloody battles.\n\nBut it is also a matter of feasibility: China goes where there’s value and interest. With the United States pulling back in much of the world under President Trump’s America First policy, Beijing is often knocking on doors left open.\n\nSome American and Solomon Islands officials note that Chinese businesses and officials have cultivated local politicians for years with bribes and gifts like luxury trips to China and Singapore. In a poor country of 600,000 people with a national Parliament of 50 members, it doesn’t take much to tilt debate, they argue.\n\n“What worries me much more about the new Chinese engagement, be it political or economic, in the Pacific is the way in which this engagement is taking place, being lubricated by elite capture and corruption,” said Jonathan Pryke , a Pacific islands expert with the Lowy Institute in Sydney. Though patronage and corruption have long been a challenge, he added, “this engagement has certainly taken it to a whole new level.”", "description": "What could Beijing want with Tulagi, where Allied forces fought a bloody battle with Japan in World War II? Some fear military ambitions.", "authors": ["Damien Cave"], "top_image": "https://static01.nyt.com/images/2019/10/16/world/16solomons1-promo/16solomons1-promo-facebookJumbo-v2.jpg", "published_at": "2019-10-16"}