{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7572259/Newborn-baby-girl-SURVIVES-buried-three-feet-underground-clay-pot-India.html", "downloaded_at": "2019-10-14 23:30:23.755068+00:00", "title": "Newborn baby girl SURVIVES after she was buried three feet underground in a clay pot in India", "language": "en", "text": "A newborn baby girl has survived after being rescued from a buried clay pot three feet underground in India.\n\nThe now five-day-old baby girl weighed just 2.5lbs and was barely breathing when she was rescued by a woman who was at a funeral for her own stillborn baby.\n\nShe was immediately rushed to hospital where she is undergoing treatment for a lung infection.\n\n'Premature babies often need less oxygen supply to survive,' said Dr Saurabh Anjan, the paediatrician who is treating the child.\n\n'She is truly a fighter,' he added.\n\nA newborn baby girl has survived after being rescued from a buried clay pot three feet underground in India\n\nThe baby was three days old when she was brought to the hospital by the family of Hitesh Kumar, whose wife Vaishali gave birth to a stillborn.\n\nDoctors believe she was receiving some oxygen through the pores in the soil.\n\nDr Saurabh Anjan said: 'She must have received some oxygen when buried in the grave through the pores in the soil which was possibly loose as the grave must have been fresh.\n\n'She is currently under the condition of hypothermia and constantly on oxygen support. Her lungs have caught an infection and she is unable to take direct feed. We are providing every possible treatment to her.\n\n'He body weight is only 2.4lbs. Her condition suggests that she is a premature baby and was over three days old when she was brought at the hospital as her umbilical cord had already fallen.\n\nThe now five-day-old baby girl weighed just 2.5lbs and was barely breathing when she was rescued by a woman who was at a funeral for her own stillborn baby\n\n'She used her brown fat also known as Brown Adipose tissue, and is a special type of body fat that is activated to maintain core temperature, to survive.\n\nThe baby was found wrapped in a piece of cloth by labours who were digging a grave for the stillborn child of Hitesh Kumar and Vaishali in Bareily in Uttar Pradesh\n\n'She survived despite her platelet count dropping to 10,000 while the normal range is 150,000 and exhibited the character of a true fighter.'\n\nThe baby was found wrapped in a piece of cloth by labours who were digging a grave for the stillborn child of Hitesh Kumar and Vaishali in Bareily in Uttar Pradesh.\n\nHitesh said: 'My wife had given birth to a stillborn child at a private hospital in Rampur Garden locality of the city.\n\n'We took the baby to a crematorium where the labours were digging a grave. Suddenly, a labour's spade hit a pot. It was kept in a bag.\n\n'When they took the bag out, they found a baby wrapped in a cloth. She was alive and crying.\n\n'At one point I thought my daughter has come alive but the voice was actually coming from the pot.\n\n'We couldn't understand much and asked the guard to have a look at it. When the pot was opened, a baby girl was kept inside. I immediately called ambulance and informed police to ensure that her life was saved.'\n\n'Premature babies often need less oxygen supply to survive,' said Dr Saurabh Anjan, the paediatrician who is treating the child. Pictured is the clay pot the baby was found in\n\nThe couple is now hoping to adopt the child thinking their own daughter has returned to them.\n\nPooja, Viashali sister told the local reporters: 'My sister and her husband were devastated after they gave birth to a stillborn but this baby has given some hopes to them.\n\n'They are willing to adopt her and will approach the child welfare committee once she is completely healed and fit enough to go home.'", "description": "The now five-day-old baby girl weighed just 2.5lbs and was barely breathing when she was rescued by a woman who was at a funeral in India for her own stillborn baby.", "authors": ["Isabella Nikolic For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/18/19703226-0-image-a-28_1571073073358.jpg", "published_at": "2019-10-14"}