{"pub": "thenextweb", "url": "https://thenextweb.com/podium/2019/10/23/q4-digital-report-pinterest-gains-on-instagram-and-tiktok-dont-stop", "downloaded_at": "2019-10-23 15:54:57.745061+00:00", "title": "Q4 digital report: Pinterest gains on Instagram and TikTok don’t stop", "language": "en", "text": "A wealth of new data has contributed to impressive growth across various aspects of digital over the past three months, so my new Digital 2019 Q4 Global Digital Statshot report – produced in partnership with We Are Social and Hootsuite – has plenty of juicy headlines, as well as essential insights for brands and organizations preparing 2020 digital plans.\n\nYou’ll find all the latest numbers in the SlideShare embed below (or click here), but read on below to get richer context and insights into this quarter’s top headlines.\n\nBig jump in internet user numbers\n\nThe number of internet users around the world is now 400 million higher than it was this time last year, representing annual growth of 10 percent.\n\nHowever, these figures have been significantly influenced by new data published by the ITU, and our understanding is that much of the ‘growth’ is likely due to more accurate and timely reporting, rather than because of a sudden increase in the number of internet users over the past three months.\n\nRegardless of the cause, however, the new figures are particularly encouraging. The number of internet users around the world is rapidly approaching 4.5 billion, and if current trends continue, we should see some impressive new milestones as we head into 2020.\n\nI’m particularly pleased to note that much of the growth in the ITU’s new data has come from emerging economies – especially across Africa – and this could signal the start of a whole new wave of growth across all kinds of connected behaviors in the coming months.\n\nSocial media user numbers up again\n\nGlobal social media user numbers have surged this quarter too, but once again this is mainly due to the availability of new data, and not because of a sudden rush of new users.\n\nThe key driver in this quarter’s growth comes from India, where WhatsApp recently revealed that they have passed the 400 million active user mark. For context, that’s 100 million active users more than Facebook’s core platform.\n\nThese figures suggest that almost 30 percent of India’s total population already uses WhatsApp each month. What’s more, with the number of mobile internet subscribers in India growing at a rate of more than 250,000 every day, there’s still plenty more opportunity for social media growth in India.\n\nOther platforms belonging to Facebook Inc. and Tencent also contributed to overall growth in social media user numbers, but – as we’ll see below – there are some interesting trends emerging at the individual platform level.\n\nFacebook’s ad audience growth slows\n\nFacebook’s core product saw significantly slower growth in its advertising audience numbers over the past three months, with the platform adding just 8 million new users between July and September 2019. At just 0.4 percent, this quarterly growth rate is significantly lower than the 3 percent growth in advertising audience numbers that the platform delivered in the second quarter of this year.\n\nMeanwhile, individual country figures tell an even more interesting story. Facebook’s own advertising tools suggest that advertisers can reach fewer people in the United States and Indonesia today compared to this time three months ago, suggesting that advertising audiences in two of the platform’s biggest markets may actually be shrinking, albeit only by small margins.\n\nMeanwhile, despite the fact that Facebook still appears to have the largest youth audience of any social media platform in the world, the company’s latest numbers suggest that its youth advertising audience is also shrinking. Facebook’s advertising tools indicate that advertisers can now reach 2.6 percent fewer users aged 13 to 17 compared to the second quarter of 2019, and 2 percent fewer users aged 18 to 24.\n\nHowever, there may be various reasons for these drops, including proactive moves by Facebook to remove accounts that have breached the platform’s terms and conditions. These numbers are also only representative of the platform’s advertising audiences, and may not correlate to changes in the platform’s total monthly active users [note: the figures that Facebook reports in its investor earnings reports are monthly active user numbers, and not the advertising audience numbers that we report here].\n\nIt’s also worth highlighting that Facebook delivered improved advertising performance during the third quarter compared to the previous three months. The platform’s Audience Insights tool reveals that the typical global Facebook user clicked on a median of 12 adverts per month between July and September 2019, compared to a median of 11 adverts per month between April and June.\n\nTikTok don’t stop\n\nBytedance hasn’t published active user numbers for TikTok in recent months, focusing instead on sharing its latest app download numbers, or the combined number of active users across all of the apps in the company’s broader portfolio. The company’s new self-service advertising tools don’t show audience numbers either, opting instead to report audience reach on a five-point scale.\n\nHowever, the latest data from app intelligence company App Annie suggest that TikTok continues its explosive growth around the world, with the insights company ranking TikTok just behind Instagram in terms of monthly active users through the third quarter of 2019.\n\nApp Annie’s latest data also suggest that TikTok’s download rates may have increased in the past few weeks, with the global download rankings for September 2019 showing TikTok in second place, just behind Mario Kart Tour, and ahead of all of Facebook’s platforms.\n\nPinterest’s steady ascent\n\nPinterest’s first investor earnings report revealed that the platform now has 300 million monthly active users around the world, representing annual growth of 30 percent versus Q2 2018. Data from the company’s self-service advertising tools also show solid growth in advertising reach over the past three months, and marketers can now use Pinterest to target more than 150 million users across the globe.\n\nThe demographics of Pinterest’s advertising audience are particularly interesting. You probably won’t be surprised to hear that women account for a significant share of Pinterest’s total audience, but you may be surprised to learn what this share means when we translate it into actual user numbers.\n\nFor example, in the United States, advertisers can now reach almost as many women over the age of 30 on Pinterest as they can on Instagram, despite Instagram’s total global advertising audience (male and female) being almost six times bigger than Pinterest’s.\n\nPinterest also performs well in Western Europe. The platform’s advertising tools suggest that advertisers can now reach roughly 8.3 million women across all age groups in Germany, compared to the 9.9 million women that advertisers can reach on Instagram.\n\nThe situation in France is similar, with Pinterest reporting a female advertising audience of 8.1 million, compared to Instagram’s female audience of 9.1 million, again across all age groups.\n\n5G making its mark\n\nThe latest internet connection speed data from Ookla indicate that the promise of 5G hasn’t been exaggerated. Average mobile data speeds in South Korea – which arguably has seen the most extensive 5G rollout so far – have gone into overdrive in the past two quarters, and the numbers tell a compelling story for 5G’s future.\n\nOokla reports that the average mobile internet connection in the country reached 95.11Mbps in September – almost 40 percent faster than the average mobile download speed in second-placed Qatar.\n\nHowever, Korea actually saw a slight drop in mobile download speeds in September, and if we look at mobile connection speeds across the third quarter of 2019 as a whole, the average Korean mobile internet connection actually exceeded 100Mbps. That’s more than double the speeds that South Korea’s mobile users enjoyed just this time last year.\n\nFor context, Netflix recommends that users need a minimum connection bandwidth of 25Mbps to stream “Ultra HD quality” content (e.g. movies in 4K definition). That means that the average Korean mobile user can now stream four separate 4K movies on a single mobile internet connection at the same time.\n\nAt the risk of resurrecting one of digital’s oldest clichés, these trends suggest that 2020 may be “the year of 5G mobile.” However, 5G’s real promise doesn’t lie in multi-streaming 4K movies to phones, but in powering the internet of things.\n\nThe impact of IoT devices may take a little longer to influence people’s everyday lives, but now is still a good time to start preparing, because the future is accelerating.\n\nAsia rising\n\nApp Annie’s latest data show that six of the world’s ten most-used mobile apps are now owned by Chinese companies (side note: the remainder are all owned by Facebook). Chinese companies also dominate when it comes to mobile games, which App Annie reports account for 40 percent of all global app downloads.\n\nBut Asia’s digital influence isn’t limited to Chinese companies, and organizations in Japan and Korea consistently deliver some of the world’s most popular apps too.\n\nMeanwhile, it’s a similar story when we look at the web. Asian sites increasingly dominate the world’s most-visited online destinations, with China’s ecommerce platforms showing particular success.\n\nHowever, the latest global web traffic insights from SimilarWeb reveal some more interesting trends. The company’s ranking of the world’s most visited websites for September 2019 show that Korea’s naver.com and Japan’s yahoo.co.jp have both entered the global top 20, although sadly there’s nothing obvious in the data to suggest what may be behind the increasing appeal of either site.\n\nData from Amazon’s insights division, Alexa (not to be confused with the company’s voice assistant of the same name), tell a similar story. The company’s latest reports show that Chinese websites now account for three of the five most-visited web destinations in the world, and more than half of the top 20.\n\nTmall performs particularly well in Alexa’s latest rankings, with the company ranking three distinct domains in the world’s top 20 websites. Critically, the ecommerce platform’s homepage now ranks as the fourth most-visited website in the world – significantly higher than Amazon.com, which Alexa currently ranks thirteenth.\n\nIt’s worth noting that an increasing number of shoppers may be making use of Amazon’s mobile apps, but – once again – Chinese companies are winning in the mobile ecommerce world too, with Alibaba’s Taobao app coming in at ninth place in App Annie’s ranking of the world’s most used mobile apps.\n\nWith the sheer size of Asia’s population and the rapid growth of internet users across the region, these numbers and trends are easy to explain, but their implications cannot be overstated. As we head into the next decade, expect to see some significant shifts in the center of the internet’s gravity.\n\nIf you’d like to dig a bit deeper into ecommerce behaviors and trends in Asia, check out our recent deep-dive reports on online shopping across Southeast Asia.\n\nLooking ahead to 2020\n\nWe’re already preparing for our flagship Digital 2020 reports, which I’ll be publishing in the first few weeks of the new year.\n\nHowever, based on the emerging trends that we’re already seeing in our preparations, here are three things I’d recommend adding to your watchlist for 2020:\n\n1. Voice\n\nOne of the biggest changes in 2020 will be the rising use and influence of voice interfaces, and how these tools will shape the evolution of digital as a whole.\n\nFor clarity, the story here isn’t just about the rise of smart speakers, and the opportunity certainly isn’t limited to building an Echo Skill for your next ad campaign. Rather, voice interfaces have the potential to revolutionize the ways in which each and every one of us uses and interacts with all of our connected devices, with content, and – crucially – with search results.\n\n2. Games\n\nWhether it’s playing them or watching others play them, and whether it’s a quick five minutes at the bus stop or a global esports tournament, games will be another top story in 2020.\n\nThere are some huge opportunities for brands here, but marketing in these active, ‘lean-forward’ environments will require some very different thinking to the kind of ‘lean-back’ marketing that has dominated ‘mass entertainment’ advertising over the past 50 years.\n\n3. A cultural shift\n\nAs internet access and connection speeds accelerate across emerging markets, we can expect to see meaningful increases in the volume and popularity of content coming out of these geographies too.\n\nMany decry the dangers of today’s internet ‘filter bubbles’, but – in reality – it has never been easier for individuals to connect with people from all over the world; to learn about their worlds and their cultures, and to explore valuable new perspectives and opportunities. So, my top tip for 2020 is to “feed your feed”: actively add diverse perspectives and opinions into your digital diet, and embrace what diversity can do for you.\n\nThat’s all for this quarter – I’ll see you again in the next decade!\n\nThis post is part of our contributor series. The views expressed are the author's own and not necessarily shared by TNW.", "description": "Catch up on the global state of digital in October 2019 with data highlights from the new Digital 2019 Q4 Global Digital Statshot report.", "authors": ["Simon Kemp", "October"], "top_image": "https://img-cdn.tnwcdn.com/image/podium?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2FUntitled-design10.png&signature=e945d34caebfecd66206342327a6d52c", "published_at": "2019-10-23"}