{"pub": "breitbart", "url": "https://breitbart.com/news/argentina-draws-with-germany-while-without-suspended-lionel-messi", "downloaded_at": "2019-10-10 15:07:39.978907+00:00", "title": "Argentina draws with Germany, while without suspended Lionel Messi", "language": "en", "text": "Oct. 10 (UPI) — Argentina fought back from a two-goal deficit to draw with Germany in an international soccer friendly, despite not playing with suspended star Lionel Messi.\n\nThe Germans were also without the services of some of their top players due to injuries. Serge Gnabry and Kai Havertz scored for Germany in the first half of the 2-2 draw Wednesday at Signal Iduna Park in Dortmund, Germany. Lucas Alario and Lucas Ocampos scored in the second half for Argentina.\n\nMessi missed the game after receiving a three month international ban from CONMEBOL tied to accusations of corruption he made at the Copa America. Argentina stars Angel Di Maria and Sergio Aguero also missed the game.\n\nGnabry drew first blood in the 15th minute. He fought to get to a loose ball before tapping a shot past Argentina keeper Agustin Marchesin. Gnabry assisted Germany’s second score. The star striker held the ball on the right side of the box during that sequence, before spotting Havertz making a far-post run. Gnabry placed a perfect pass ahead for his teammate, who finished with a one-touch shot past Marchesin in the 22nd minute.\n\nGermany held the 2-0 lead through halftime before Argentina caught fire.\n\nMarcos Acuna bent in a perfect cross in the 66th minute to help cut the deficit in half. The ball curved into Alario, who headed the feed into the far-post netting. Alario assisted the equalizer in the 85th minute.\n\nThe Argentine star dribbled into the box before leaving a pass for Ocampos during that sequence. Ocampos blasted a shot into the near-post netting, beating German keeper Marc-Andre ter Stegen.\n\nArgentina faces Ecuador in another international friendly at 10 a.m. EDT Sunday in Elche, Spain. Germany battles Estonia in the UEFA Euro qualifiers at 2:45 p.m. EDT Sunday at A. Le Coq Arena in Tallinn, Estonia.", "description": "Oct. 10 (UPI) — Argentina fought back from a two-goal deficit to draw with Germany in an international soccer friendly, despite not playing with", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-10"}