{"pub": "vice", "url": "https://vice.com/en_us/article/ne8qzq/daily-horoscopes-october-17-2019", "downloaded_at": "2019-10-17 14:22:23.312609+00:00", "title": "Daily Horoscopes: October 17, 2019", "language": "en", "text": "Download the Astro Guide app by VICE on an iOS device to read daily horoscopes personalized for your sun, moon, and rising signs, and learn how to apply cosmic events to self care, your friendships, and relationships.\n\n\n\nToday's moon in intellectual air sign Gemini finds us busily connecting with people and sharing ideas. Things move along speedily as the moon connects with action planet Mars at 3:11 PM. A productive and social mood flows!\n\nAll times ET.\n\nLibra (September 22 - October 23)\n\nThe moon is in fellow air sign Gemini today, encouraging you to look at the big picture. You're in an adventurous mood too, courageously sharing your message with whoever is willing to hear it as the moon connects with Mars.\n\nScorpio (October 23 - November 22)\n\nAstrologers often describe you as intense, Scorpio, but is that a backhanded compliment or high praise? It all depends on how much work you've done emotionally and how honest you're able to be with yourself! As today's Gemini moon makes a harmonious connection with incisive Mars, you're able to go deep with your own issues.\n\nSagittarius (November 21 - December 21)\n\nThe pace is picking up in your partnerships as the moon in your opposite sign Gemini connects with fiery Mars, boosting communication. It's a powerful time to visualize the future: What are your wishes, Sagittarius?\n\nCapricorn (December 21 - January 19)\n\nIt's a productive day for you at work as the Gemini moon connects with fiery Mars, helping you multitask with speed and ease. You usually prefer to focus on one thing at a time, but you're getting it all done seamlessly today!\n\nAquarius (January 19 - February 18)\n\nThe moon is in fellow air sign Gemini today, finding you in a flirtatious mood, Aquarius. You're especially up for adventure and trying new things as the moon connects with action planet Mars!\n\nPisces (February 18 - March 20)\n\nThe moon in Gemini illuminates the home and family sector of your chart today, encouraging you to find ways to get cozy. Privacy and security are on your mind, and you're working through emotions as the moon connects with Mars—it's a powerful time to let the past go.\n\nAries (March 20 - April 19)\n\nYou're in a chatty mood today thanks to the moon in Gemini. The moon connects with your ruling planet Mars, finding you in a good spirits (though maybe a little competitive!) and eager to connect with your partners.\n\nTaurus (April 19 - May 20)\n\nThe moon in Gemini illuminates the financial sector of your chart today, Taurus, and its connection with action planet Mars finds you in an especially productive mood. It's an excellent time to tackle your responsibilities—and get paid!\n\nGemini (May 20 - June 21)\n\nThe moon is in your sign today, GeminI, so make time to nourish yourself! Today, that means enjoying the chase in your love life, expressing your creativity, and having some rowdy fun as the moon connects with fiery Mars.\n\nCancer (June 21 - July 22)\n\nYour intuition is especially sharp today as the moon in Gemini connects with fiery Mars. As the moon connects with the planet of war, recognize your own rage—it's normal and human, so forgive yourself for being angry and find healthy ways to blow off steam.\n\nLeo (July 22 - August 23)\n\nYou have fantastic connections, know all the gossip, and are connected to so many communities, dear Leo. Today is an especially busy time in your social life as the moon in Gemini connects with fiery Mars!\n\nVirgo (August 23 - September 22)\n\nNo one does your job better than you, Virgo, and you're especially productive today as the moon in Gemini makes a harmonious connection with the planet of strength, Mars. You have a lot to show off, so be proud!\n\nWhat's in the stars for you in October? Read your monthly horoscope here.\n\nWant these horoscopes sent straight to your inbox? Click here to sign up for the newsletter.", "description": "The moon is in Gemini today.", "authors": [], "top_image": "https://video-images.vice.com/articles/5d9b385d7ea0fc000a38b94e/lede/1570453634248-Illustration-of-a-woman-in-pajamas-laying-on-a-bed-filled-with-zodiac-themed-items.jpeg?crop=1xw:1xh;center,center&resize=1200:*", "published_at": "2019-10-16"}