{"pub": "thenextweb", "url": "https://venturebeat.com/2019/10/10/meta-games-raises-2-million-for-esports-mobile-games", "downloaded_at": "2019-10-11 12:40:26.635094+00:00", "title": "Meta Games raises $2 million for esports mobile games", "language": "en", "text": "Meta Games raised $2 million in seed fudning for esports-themed mobile games. Bitkraft Esports Ventures is the primary backer of the Berlin startup.\n\nMeta Games will use the new funding to complete game development on its upcoming mobile game Rivals, a manager game based on multiplayer online battle arena (MOBA) esports, and to begin development on future mobile games for esports fans.\n\nInvestors include Everblue Management, Crest Capital, and Klaas Kersting, among others.\n\nDeveloped with the input of pro teams, Rivals Esports Manager offers players the opportunity to watch their own team compete to reach the pinnacle of esports glory. Players can manage their own pro esports team, compete in PvP leagues, trade players in their roster, and create an esports legacy.\n\nImage Credit: Meta Games\n\nUsing real-time simulation to create a highlight-reel experience of a MOBA game, players can turn the tide of the game with last-minute tactic adaptations. Future integrations will include the ability to engage with favorite professional teams and brands to acquire the best sponsorship deals and have truly authentic esports experiences that mirror the real-life scenarios.\n\nExpanding its scope to match the variety of genres represented in the spectrum of esports, Meta Games’ future products will expand to audiences beyond just MOBAs or FPSs. By creating a portfolio of esports-themed mobile games, Meta Games wants to make it possible for fans to engage with the specific esport and genre they are most passionate about.\n\n“We believe esports fans deserve authentic and complementary gaming experiences that reflect what they watch every day,” said Roman Frank, CEO and Founder of Meta Games, in a statement. “By providing players with the ability to manage a professional team they are able to get a behind-the-scenes look at how some of their favorite teams operate on their path to success.”\n\nPhilipp Karstaedt is chief operating officer and cofounder of Meta Games. The company has 11 employees. Frank, Karstaedt, and Arvid Hahn founded the company in 2017.\n\n“By having the most popular PC esports game genres in the palm of their hand, players now have the excitement of a pro esports coach in a snack-size, on-the-go experience,” said Bitkraft founding partner, Malte Barth, in a statement. “Similar to traditional sports, each esports genre is distinct and has its own unique fanbase which is why Meta Games’ vision to bring esports-themed games to these diverse, loyal audiences is extremely necessary. We believe with this funding this strong, proven team can continue its momentum of developing mobile games that address the entire audience of esports fans worldwide.”\n\nA preliminary version of Rivals Esports Manager is now available in Open Beta on the Google Play store.", "description": "Meta Games raises $2 million for esports-themed mobile games. Bitkraft Esports Ventures is the primary backer of the Berlin startup.", "authors": ["Dean Takahashi"], "top_image": "https://venturebeat.com/wp-content/uploads/2019/10/meta-games.jpg?w=1200&strip=all", "published_at": "2019-10-10"}