{"pub": "washingtonpost", "url": "https://washingtonpost.com/news/powerpost/paloma/daily-202/2019/10/30/daily-202-omissions-and-gaps-in-the-rough-transcript-of-july-25-ukraine-call-undercut-another-trump-defense/5db90e1588e0fa5ad928dba0", "downloaded_at": "2019-10-30 15:58:58.085530+00:00", "title": "The Daily 202: Omissions and gaps in the rough transcript of July 25 Ukraine call undercut another Trump defense", "language": "en", "text": "Army Lt. Col. Alexander Vindman departs the Capitol on Tuesday night after a closed-door deposition. (Patrick Semansky/AP)\n\nWith Mariana Alfaro\n\nTHE BIG IDEA: President Trump tweeted this morning that “just a casual reading of the Transcript leads EVERYBODY to see that the call with the Ukrainian President was a totally appropriate one.” He’s referring to the rough transcript of his July 25 phone call with Volodymyr Zelensky, which showed that Trump asked for a “favor” from his counterpart in Kyiv. To see how “perfectly appropriate” he behaved, the president tweeted yesterday, “all anyone has to do is READ THE TRANSCRIPT!” On Oct. 2, Trump claimed that the document is “an exact word-for-word transcript of the conversation.”\n\nBut we’re learning new details that suggest what the White House put out was rougher than previously acknowledged. During more than 10 hours of testimony on Tuesday, Lt. Col. Alexander Vindman – the top Ukraine expert on the National Security Council and the first witness in the House impeachment inquiry who actually heard the call – said that the rough transcript released by the White House does not include everything that transpired.\n\nThe Army officer, who earned the Purple Heart for valor during combat in Iraq, recalled Zelensky specifically referencing the Ukrainian natural gas firm Burisma by name when Trump pushed him to investigate a company related to Joe Biden’s son Hunter. Vindman also remembered Trump talking about how the former vice president was on tape boasting about Ukraine funds. This is most likely a reference to comments Biden made last year that the United States iced $1 billion in loan guarantees until the Ukrainian government fired a corrupt former prosecutor, per Karoun Demirjian and Greg Jaffe.\n\nEven if the filled-in gaps don’t materially change our previous understanding of what took place, the revelation highlights just how much the public still does not know. As the investigation proceeds at what seems like a rapid pace, it’s also an important reminder that official White House pronouncements should not be taken at face value.\n\n-- Vindman not only testified that the rough transcript omitted “crucial words and phrases,” according to the New York Times, but he also said that his efforts to update the record of the call to reflect Trump’s mentions of Burisma and Biden on tape failed: “Colonel Vindman did not testify to a motive behind the White House editing process … but the decision by a White House lawyer to quickly lock down the reconstructed transcript subverted the normal process of handling such documents …The note-takers and voice recognition software used during the July 25 call had missed Mr. Zelensky saying the word ‘Burisma,’ according to people briefed on the matter, but the reconstructed transcript does refer to ‘the company,’ and suggests that the Ukrainian president is aware that it is of great interest to Mr. Trump. …\n\n“After the call, Colonel Vindman was given a hard copy of the rough transcript to make updates and corrections … Colonel Vindman went through the transcript, made changes and gave his written edits to his boss … After the call, Colonel Vindman went with his brother, a lawyer on the National Security Council staff, to see John A. Eisenberg, the council’s legal adviser, to raise his concerns about the conversation. Colonel Vindman declined to detail to investigators his discussions with Mr. Eisenberg, citing attorney-client privilege…\n\n“One explanation for why Colonel Vindman’s changes were not made could be that the transcript had been quickly placed into a highly secure computer system, the N.S.C. Intelligence Collaboration Environment, or NICE system, making it more difficult to alter. Mr. Eisenberg ordered the transcript moved to ensure that people who were not assigned to handle Ukraine policy could not read the transcript, a decision he hoped would prevent gossip and leaks about the call. Putting the transcript in the secure server would have made it more difficult to make further edits to the document, and in the case of the July call effectively stopped additional changes. Mr. Eisenberg made the decision without consulting with his supervisor, Pat A. Cipollone, the White House counsel. A White House review of the handling of the call is examining if Mr. Eisenberg acted properly in securing the notes.”\n\n-- “One of the Times’ examples of how Vindman wanted to adjust the transcript contradicts what the White House said about the transcript when it was released,” CNN notes. “Asked in September why there were three ellipses, a senior White House official said they ‘do not indicate missing words or phrases’ but ‘refer to a trailing off of a voice or pause. If there were missing words or phrases, they would be represented by brackets or redactions. This is the standard practice that is followed for all records of Presidential phone calls.’ However, the Times reports that one of the changes to the transcript sought by Vindman was regarding replacing an ellipses: ‘The rough transcript also contains ellipses at three points where Mr. Trump is speaking. Colonel Vindman told investigators that at the point of the transcript where the third set of ellipses appears, Mr. Trump said there were tapes of Mr. Biden.’”\n\nNBC, the AP and BuzzFeed reported that they confirmed various elements of the Times reporting, including that Vindman tried to change the transcript to no avail.\n\n-- Flashback: The initial transcripts that Richard Nixon released of his conversations in the Oval Office were also incomplete. They didn’t include the most incriminating material because the then-president edited it out.\n\n-- Vindman’s testimony draws fresh attention to the White House’s failure to release any rough transcript of Vice President Pence’s conversation with Zelensky.\n\nCatherine Croft, a State Department adviser on Ukraine, arrives at the Capitol on Wedneday morning for closed-door testimony. (Alex Wroblewski/Bloomberg)\n\n-- Sketchy backchanneling surrounding U.S. policy toward Ukraine long predates this summer. That’s a big takeaway from the prepared remarks of two career diplomats who are testifying on the Hill today.\n\nChristopher Anderson, a career Foreign Service officer, will detail efforts when U.S. officials tried to demonstrate support for Ukraine only to be batted down by the White House, including after Russian forces attacked and seized Ukrainian military vessels in the Sea of Azov in 2018. “While my colleagues at the State Department quickly prepared a statement condemning Russia for its escalation, senior officials in the White House blocked it from being issued,” Anderson planned to say.\n\nCatherine Croft, who worked on Ukraine issues at the White House and the State Department, will disclose that she received inexplicable phone calls from Washington lobbyist Robert Livingston, “who told me that Ambassador Yovanovitch should be fired,” referring to Marie Yovanovitch, then the top U.S. envoy in Kyiv. “He characterized Ambassador Yovanovitch as an ‘Obama holdover’ and associated with George Soros,” she planned to say. Yovanovitch was recalled from her position at Trump’s direction earlier this year after the president’s personal lawyer Rudy Giuliani and his associates made unsubstantiated allegations that she was opposed to Trump. “It was not clear to me at the time — or now — at whose direction or at whose expense Mr. Livingston was seeking the removal of Ambassador Yovanovitch,” Croft planned to say.\n\n“Croft is expected to say she notified her boss, Fiona Hill, and another State Department official, George Kent, of Livingston’s activities, and declare that she is ‘not aware of any action that was taken in response,’” John Hudson and Elise Viebeck report. “Livingston, a former Republican congressman from Louisiana, was chosen as the successor to Newt Gingrich as speaker of the House in 1999, but he declined the position after revelations of an extramarital affair. After leaving Congress, he formed the Livingston Group, one of Washington’s most influential lobbying firms. His firm has represented clients in the Middle East and around the world, including political figures in Ukraine such as former prime minister Yulia Tymoshenko, according to Justice Department documents.”\n\n-- Read Croft’s opening statement here and Anderson’s here.\n\nRep. Adam Schiff (D-Calif.), the chairman of the House Intelligence Committee, arrives on Wednesday for the closed-door deposition of Catherine Croft. (Alex Wroblewski/Bloomberg)\n\n-- It’s also important to emphasize that Vindman’s concerns were broader than the July 25 call. Greg Miller looks into two White House meetings on July 10 with Ukrainian officials that have become central to the impeachment inquiry: “One of the officials Trump had entrusted to pursue this agenda, Ambassador to the European Union Gordon Sondland, was undeterred by the fierce opposition from [John] Bolton and others. He persisted in pressing Ukraine to commit to Trump’s demands, convening a second meeting even after a spectacular blowup in the West Wing. … After seeing Sondland outline political demands that Trump would reiterate in his July 25 call, Vindman said, he became worried that what he had witnessed was improper …\n\n“Sondland has testified that he didn’t know of any Biden connection in Trump’s demands for a Burisma investigation until much later, after the allegations in the whistleblower complaint became known. He has also said that no White House officials ever expressed any concern to him about his efforts to push Ukraine to commit to the Burisma probe. His lawyer declined to comment Tuesday after the release of Vindman’s opening statement. Sondland’s account is contradicted by statements from Hill and Vindman. Hill testified that she entered the Ward Room as the follow-up meeting was already underway and heard Sondland say the word ‘Burisma’ as he resumed pressing the Ukrainians to pursue certain investigations. She then ordered that meeting to an immediate close.\n\n“Vindman said that Sondland used the downstairs meeting to press for ‘investigations into the 2016 election, the Bidens and Burisma.’ Vindman said he then confronted Sondland, saying that ‘his statements were inappropriate, that the request to investigate Biden and his son had nothing to do with national security, and that such investigations were not something the [National Security Council] was going to get involved in or push.’” (The Fix created a Trump-Ukraine timeline to help keep straight what we’ve learned.)\n\n-- “It’s become a case of he said, they said” is how the Wall Street Journal puts it: Vindman and Hill, in addition to acting ambassador to Ukraine Bill Taylor, have all contradicted to varying degrees what Sondland told investigators.\n\nWHIPPING TOMORROW’S VOTE:\n\n-- House Democrats unveiled the new procedures for the impeachment inquiry that they plan to vote on Thursday. Mike DeBonis reports: “The resolution backed by House Speaker Nancy Pelosi (D-Calif.) hands the lead role to the House Intelligence Committee and its chairman, Rep. Adam B. Schiff (D-Calif.), who would have broad latitude to organize extended questioning of potential public witnesses. Two other committees that have so far participated in the closed-door investigation into Trump’s dealings with Ukraine — Foreign Affairs and Oversight and Reform — would not be permitted to directly participate in the open proceedings under the legislation. It also sets out for the first time the ability of House Republicans to make their own requests for testimony and documents, though those requests will be subject to a vote of the Democratic-majority committee — a practice that matches the minority powers in the 1998 impeachment of President Bill Clinton.\n\n“The House Rules Committee will debate and potentially amend the measure at a panel meeting Wednesday afternoon. … By confining the public hearings to the Intelligence Committee and excluding the other two panels that have participated in the closed-door interviews, Democrats are in effect sidelining several of the GOP’s most aggressive and outspoken defenders of Trump. They include Reps. Jim Jordan (Ohio) and Mark Meadows (N.C.), who serve on the Oversight panel, as well as Rep. Lee Zeldin (N.Y.) of the Foreign Affairs Committee, who have led the public pushback to the Democratic impeachment effort in the House.” (Read the draft of the resolution and the House Judiciary Committee’s draft procedures.)\n\n-- Pelosi expects all but a handful of her Democratic members to support the resolution. One holdout is Rep. Jeff Van Drew (D-N.J.). “What’s going to happen in my mind, it’s going to happen here in the House; it will go over to the Senate, and then he will believe that he has been exonerated,” Van Drew told reporters. “He will still be the president, and he will still be the candidate — a candidate who has been exonerated by the Senate.”\n\n-- The latest on timing: House Democrats increasingly expect their effort to stretch well past Thanksgiving, possibly forcing a Senate trial into January or later. Michael Scherer and DeBonis report: “House leaders had initially hoped to hold a floor vote before the Nov. 28 holiday so the Senate could hold trial before Christmas. But the surprising number of witnesses agreeing to testify behind closed doors … over the past few weeks has extended the timeline and sparked a debate over whether prolonged impeachment proceedings are politically prudent. … A January trial would also disrupt the final weeks of campaigning before the Iowa caucuses for candidates who are senators in Washington. … The caucuses are Feb. 3.”\n\n-- The timing depends, in part, on how quickly the courts move: The Justice Department got a reprieve yesterday afternoon when a federal appeals court said the Trump administration does not have to immediately release to the House Judiciary Committee certain grand jury materials from Bob Mueller’s investigation. “The court order means the issue will not be resolved before Nov. 5, when the final filing from the parties is due,” Ann Marimow reports. “The U.S. Court of Appeals for the D.C. Circuit was responding to an emergency request from the Justice Department, which said in a court filing that it would be ‘irreparably harmed’ without a stay and that ‘once the information is disclosed, it cannot be recalled and the confidentiality of the grand jury information will be lost for all time.’ A three-judge panel paused the order pending further review but made clear it was not deciding the merits of the case.” (Read the court’s order.)\n\nWelcome to the Daily 202, PowerPost's morning briefing for decision-makers.\n\nSign up to receive the newsletter.\n\nWHILE YOU WERE SLEEPING:\n\n-- The Nationals beat the Astros, 7-2, to force a decisive Game 7 of the World Series in Houston tonight. Check out our team coverage:\n\nChelsea Janes: “Trea Turner out, Dave Martinez ejected: What happened on that bizarre interference call.”\n\nBarry Svrluga: “How did the Nats respond to a controversial call? By leaving absolutely no doubt.”\n\nSam Fortier: “The Nationals handed Stephen Strasburg their season. He delivered a legendary performance.”\n\nThomas Boswell: “The Nats had plenty of heroes in Game 6 — and even owe a thank you to Astros’ Alex Bregman.”\n\nScott Allen: “The six wackiest moments from a truly wacky Game 6.”\n\nSyrians sift through the rubble at the site of the operation that led to the death of Islamic State leader Abu Bakr al-Baghdadi in Syria on Oct. 26. (Omar Haj Kadour/AFP/Getty Images)\n\nTHE NEW WORLD ORDER:\n\n-- An Islamic State defector inside Abu Bakr al-Baghdadi’s hideout was critical to the success of the raid against the ISIS leader, U.S. officials said. Joby Warrick, Ellen Nakashima and Dan Lamothe report: “The mole’s detailed knowledge of Baghdadi’s whereabouts as well as the room-by-room layout of his sanctuary proved to be critical in the Oct. 26 raid that ended with the death of the world’s most-wanted terrorist, the officials said. The informant was present during the assault on Baghdadi’s compound in the Syrian province of Idlib, and he was exfiltrated from the region two days later with his family. The man, whose nationality had not been revealed, is expected to receive some or all of the $25 million U.S. bounty that had been placed on Baghdadi’s head, according to the officials. One official said he was a Sunni Arab who turned against the Islamic State because one of his relatives had been killed by the group. The Islamic State defector had been cultivated as an asset by the Syrian Democratic Forces.”\n\n-- Out of the loop: “Acting White House chief of staff Mick Mulvaney first learned about the U.S. military raid against ISIS leader Abu Bakr al-Baghdadi after the operation was already underway,” NBC News reports. “The extraordinary move by Trump to leave his chief of staff out of the most significant U.S. military operation against the world’s most wanted terrorist since the killing of Osama bin Laden in 2011 represents a major blow to Mulvaney, suggesting that he is increasingly sidelined inside the White House. The White House chief of staff typically would be central to such a momentous gambit for a president, coordinating logistics, public statements and notifications of congressional leaders and allies. Bill Daley, who was White House chief of staff during the bin Laden raid, was seated next to then-President Barack Obama as he monitored the raid ... Andrew Card, former President George W. Bush’s longtime chief of staff, said the exclusion of Mulvaney from a moment of such magnitude in the presidency is difficult to grasp … ‘I’m baffled by it,’ Card said. ‘It’s hard for me to imagine.’”\n\n-- Dread descended upon Syria during the final hours of the cease-fire as American troops withdrew. Louisa Loveluck reports: “In towns and cities, families debated, and sometimes fought, over whether, and where, to run. Selling their houses to pay for the help of unpredictable smugglers was one option. Moving closer to the Iraqi border, where thousands of refugees had already crossed, and then praying the violence wouldn’t follow, was another. … While U.S. troops withdrew to the south and out of the area where they’d long kept the peace, Russian military police moved in. Under an agreement reached last week between Russian President Vladi­mir Putin and Turkish President Recep Tayyip Erdogan, the Russian forces would now patrol the border. At times, American and Russian armored vehicles passed on the road, each with their own red, white and blue flags flapping in the wind.”\n\n-- Prime Minister Boris Johnson finally won support from lawmakers for an early election, setting up a December vote that will be dominated by Brexit. Karla Adam and William Booth report: “Parliament will dissolve next week, and the parties will go into overdrive on their five-week campaigns. This will be the United Kingdom’s first election in dark and dreary December since 1923 — a time of year when Britons prefer Christmas parties to political party hustings. Voters will be offered some stark choices on Brexit, alongside the usual overenthusiastic promises, scary scenarios, misrepresentations and foggy numbers. Will the British double down on wanting to leave the European Union? Or will they change their minds and decide to stay in the largest trading club on the planet?”\n\n-- The House voted overwhelmingly to recognize the \"genocide\" of Armenians by the Ottoman Turks, a damning rebuke of Turkey in the wake of its invasion of Syria. From the AP: “Historians estimate that up to 1.5 million Armenians were killed around World War I, and many scholars see it as the 20th century’s first genocide. Turkey disputes the description, saying the toll has been inflated and considering those killed victims of a civil war. The nonbinding resolution passed 405-11 Tuesday. American lawmakers have been critical of Ankara’s recent incursion against the Kurds along the Turkish-Syrian border.”\n\n-- Chilling: The messaging service WhatsApp filed suit in federal court against the Israeli surveillance company NSO, claiming it acted illegally in helping governments hack into the mobile devices of more than 100 people worldwide, including journalists, human rights workers and women who had been the subject of online attacks. Targets, who also included religious figures and lawyers, were identified in 20 countries, according to the lawsuit. Craig Timberg and Jay Greene have more details: “The suit amounted to a new legal front in attempts to curb the abuses of the burgeoning but almost entirely unregulated global surveillance industry. Victims of hacking previously have sued NSO in Israeli courts, but a technology company has not before pursued such legal action for using its services to help conduct spying operations on users.\n\n“WhatsApp alleged that NSO helped government agencies deliver malicious software through seemingly harmless WhatsApp video calls, even if the targets never answered their phones. The malware was capable of initiating a powerful form of spying that included the ability to intercept communications, steal photos and other forms of data, activate microphones and cameras, track the locations of targets and more … An NSO surveillance tool called Pegasus has been implicated in spying on Washington Post contributing writer Jamal Khashoggi before he was killed by people affiliated with Saudi Arabia’s security services last year. A friend of Khashoggi, Omar Abdulaziz, has alleged in a lawsuit that his phone was infected with Pegasus without his knowledge and that the malicious software helped the Saudis snoop on Khashoggi.”\n\nWhatsApp says in a blog post that the company, which is owned by Facebook, believes NSO violated U.S. and California law, as well as the terms of service for WhatsApp. “At WhatsApp, we believe people have a fundamental right to privacy and that no one else should have access to your private conversations, not even us,” writes Will Cathcart, head of WhatsApp, in an op-ed for The Post. NSO rejected the allegations in the lawsuit, saying its technology is used by governments and law enforcement to fight terrorism. “In the strongest possible terms, we dispute today’s allegations and will vigorously fight them,” the Israeli company said in a statement forwarded by a Washington public relations agency.\n\n-- Scientists tripled their estimates of the number of people threatened by rising seas. Chris Mooney reports: “The upshot of the study is that 110 million people worldwide live below the high-tide level — including many partly protected by sea walls or other infrastructure, as in New Orleans. Even under a scenario of very modest climate change, that number will rise to 150 million in 2050 and 190 million by 2100. If climate change and sea level rise follow a worse path, as many as 340 million people living below the high-tide level could be in peril, to say nothing of how many could be affected by floods and extreme events.”\n\n-- Climate activist Greta Thunberg declined the 2019 Nordic Council Environment Prize, saying the world needs more action on climate change and fewer awards. (CNN)\n\nRepublican National Committee Chair Ronna McDaniel deplanes Air Force One with Jared Kushner and two GOP congressmen before a Trump rally in Texas on Oct. 17. (Andrew Harnik/AP)\n\n2020 WATCH:\n\n-- Pay-to-play politics: “Payday lenders discussed raising money for Trump’s campaign to fend off regulation,” by Renae Merle: “Billing himself as one of President Trump’s top fundraisers, Michael Hodges told fellow payday lenders recently that industry contributions to the president’s reelection campaign could be leveraged to gain access to the Trump administration. ‘Every dollar amount, no matter how small or large’ … is important, Hodges, founder of Advance Financial, one of the country’s largest payday lenders, said during a 48-minute webcast … ‘For example, I’ve gone to Ronna McDaniel and said, “Ronna, I need help on something,” ’ Hodges said, referring to the chair of the Republican National Committee. ‘She’s been able to call over to the White House and say, “Hey, we have one of our large givers. They need an audience. … They need to be heard and you need to listen to them.” So that’s why it’s important.’ ...\n\n“The payday lending industry, made up of businesses that make short-term loans to consumers at high interest rates, is awaiting new rules that could weaken Obama administration requirements. … Sen. Elizabeth Warren (D-Mass.) would pose a big threat if elected president, Hodges and three other industry insiders said during the talk. They called Trump their ‘ultimate backstop’ against attempts to defeat legislation the industry wants. …Hodges said on the webinar that he has made [about $1.25 million] in campaign contributions to help Trump since 2016. … ‘That is important to the campaign, which means it’s important to the president, which means it’s important if you ever had to call on anyone for anything in the administration,’ he said during the call. ‘That’s how those things work.’\n\n“The White House declined to comment for this report. Trump’s reelection committee did not return a call for comment. In a statement, Mike Reed, a spokesman for the Republican National Committee, said: ‘Part of the RNC’s job is sharing what we hear from supporters across the country with party leaders. We often will connect our supporters with other Republican officials when they have a message they would like to pass along.’” Note that this is not a denial.\n\n-- Rep. Bradley Byrne (R), a leading candidate for Senate in Alabama, warned Jeff Sessions that he will not back out of the race if the former attorney general tries to reclaim his old seat. Seung Min Kim reports: “Both Byrne and Sessions draw their main base of political support from the Mobile area, triggering some speculation among insiders in the state that Byrne would bow out of the Senate race and run again for his old House seat if Sessions wages a bid. But Byrne said in an interview Tuesday that Sessions’s entry would not make ‘any difference to me’ and vowed to stay in the race regardless. Then, unprompted, Byrne referenced what would almost certainly be Sessions’s biggest political liability should he run again for the Senate. ‘The president is very angry with Jeff. I think the president will be very vocal against him,’ Byrne said. ‘For Jeff’s sake, I don’t want that. But I think that’s the reality of what he’s facing.’”\n\n-- George Papadopoulos, the former Trump foreign policy adviser who pleaded guilty to lying to FBI agents, plans to run for the House seat being vacated by Rep. Katie Hill (D-Calif.). Allyson Chiu reports: “Papadopoulos, 32, filed paperwork to run as a Republican in California’s 25th District and is expected to formally announce his candidacy later this week, Fox News reported. The news was met with swift backlash from California State Assemblywoman Christy Smith, who is so far the lone Democrat in the race for Hill’s seat. Three Republicans are also running, the Associated Press reported.\"\n\n-- Bernie Sanders and Warren are in a close race among likely voters in New Hampshire’s Democratic primary, according to a new CNN poll. Sanders pulls 21 percent, while Warren follows him at 18 percent, which is within the margin of error. Biden stands slightly behind at 15 percent, while Pete Buttigieg is the final candidate to reach double digits with 10 percent. Three candidates landed 5 percent in the poll – Hawaii Rep. Tulsi Gabbard, Minnesota Sen. Amy Klobuchar and businessman Andrew Yang. Sen. Kamala Harris (Calif.), who polled at 9 percent in a July New Hampshire poll, received just 3 percent support now. The poll shows that the race remains very fluid, and many people have not made up their minds.\n\n-- Biden’s cash-strapped campaign is talking to top donors about ways to beef up fundraising in the next quarter. Ideas include spending more on social media platforms. From CNBC: “People familiar with the campaign’s deliberations say boosting online efforts doesn’t necessarily represent a major shift in strategy. Yet several of Biden’s fundraisers believe that the campaign needs to improve its appeal to online donors. … Biden’s campaign has been behind in spending on Facebook ads that often entice contributors. Since he entered the race in April, Biden has spent $2.5 million on Facebook. Warren’s campaign has spent $2.7 million and Sanders has bought $3.1 million in ads.”\n\n-- Biden’s campaign warned a newly formed super PAC not to attack the former vice president’s Democratic competitors. \"Our campaign would be extremely frustrated if the super PAC was used to attack other Democrats,\" Biden's campaign manager Greg Schultz told reporters Tuesday, per CBS News.\n\n-- Sanders has gained key endorsements from some of the country’s most powerful Latinas, leading some to believe that he might have a shot in capturing the Latinx vote, which has huge sway potential but low turnout numbers. From Politico: “Sanders' star support from prominent Latinas ‘gives him barrio cred, street cred for this old white Jewish dude who is running for president,’ said Domingo Garcia, president of the League of United Latin American Citizens. Garcia backed the Vermont senator in 2016 but, as president of LULAC, has refrained from endorsing a candidate in the current primary. … There’s also the reality that Sanders probably can’t win the Democratic nomination without Latinos, since his campaign is relying on a strong finish in states such as Nevada and California. Speaking to a crowd of hundreds of Latinos at a LULAC town hall in Iowa last week, Sanders received the loudest welcome of any presidential candidate in attendance, rousing the audience as he took the stage.\"\n\n-- Former Wisconsin governor Scott Walker (R) mocked Sanders and Michigan Rep. Rashida Tlaib for speaking to reporters in front of empty shelves during a campaign stop. Walker said the backdrop looked like the “empty shelves of grocery stores in many socialist countries.\" In reality, they were empty shelves at a Detroit food pantry for low-income families. From the Guardian: “The Rev Roslyn Bouier, the executive director of the Brightmoor Pantry, pointed out that the shelves were empty because of the overwhelming demand there is for food and water in Detroit. The pantry sees around 1,700 families a month. ‘The pantry shelves are so empty because we are doing our job. Because people need the food. That shows the inhumanity. America needs to do better. That’s the sadness of it.’”\n\n-- The Bennet brothers – Michael, a senator running for president, and James, the editorial page editor at the New York Times – are struggling to figure out their place in an altered political landscape. Ben Terris profiles the duo: “The Bennets are the anti-Trump dynasty, institutionalists at a time when their very institutions — Capitol Hill, the mainstream media — have come under attack. To their critics on the left, they are mealy-mouthed centrists, focused on giving a platform to ‘both sides,’ for whom ‘civility’ is just another cudgel used by elites to cling to power. To their friends and supporters, they are what a politician and a newspaperman are supposed to look and act like, brothers in the mold of the Kennedys, idealists fighting for what’s right. ‘Are they dinosaurs or are they the future?’ their lifelong friend Eric Kolodner said. ‘I’m worried that it’s the former.’”\n\nWomen wearing Handmaid costumes protest in front of the Alabama state capitol in May. (Elijah Nouvelage for The Washington Post)\n\nIMPORTANT DOMESTIC STORIES THAT SHOULD BE ON YOUR RADAR:\n\n-- The U.S. economy cooled over the summer, growing at a 1.9 percent annualized pace from July through September, the latest sign that the slowdown is deepening. Heather Long and Andrew Van Dam report: “The data, released Wednesday morning by the Commerce Department, came as economists anticipated slightly weaker growth following Trump’s decision to dramatically expand his trade war with China in early August. … Consumer spending continues to power the economy, but business investment has now contracted for six straight months, falling 3 percent in the third quarter, the biggest drop since the end of 2015. … Spending on both structures and equipment was deeply negative. … Slow growth abroad and problems at big employers such as Boeing and General Motors also were a drag on growth. … The Fed is widely expected to make a modest cut to interest rates at 2pm on Wednesday.”\n\n-- A federal judge issued an injunction to block Alabama’s near-total abortion ban from going into effect. Ariana Eunjung Cha and Emily Wax-Thibodeaux report: “The Alabama bill was tumultuous from the start, with an argument breaking out during one of its introductions. … Both sides reacted with similar passion on Tuesday to U.S. District Court in Middle Alabama Judge Myron H. Thompson’s decision to issue an injunction against the law going into effect. … Alabama Gov. Kay Ivey said in a statement that she signed it into law ‘as a testament to Alabamians’ long-standing belief that every human life is sacred’ and said she is trusting the attorney general to do ‘everything he can to challenge today’s ruling and obtain a just result.’ Amanda Reyes, executive director at Yellowhammer Fund, a grass-roots organization that helps low-income women pay for abortions, said that while she is relieved to learn that abortion will remain legal in Alabama, 'this changes nothing when it comes to the crisis marginalized communities have faced and will continue to face when it comes to accessing a termination.'”\n\n-- The White House thinks it found a loophole that could allow Trump to ignore the clear intent of federal law so that he can choose someone to lead the Department of Homeland Security who could not get confirmed by the Senate. From the Times: “After Kevin K. McAleenan, the acting secretary … announced this month that he would resign, it was widely believed in the administration that Mr. Trump would tap someone who would not question his more extreme policies. … But officials leading agencies in homeland security who echo Mr. Trump’s fiery language on immigration were initially deemed ineligible under the federal Vacancies Act. The law states that acting officials who take over cabinet-level positions must be next in the line of succession, have the approval of the Senate or have served 90 days under the previous secretary. The White House, however, is exploring a loophole in the law, according to an administration official. Under this route, the White House would tap someone to be the assistant secretary of the Countering Weapons of Mass Destruction Office, which is vacant, and then elevate that person to be the acting secretary of homeland security.”\n\n-- No refugees will be resettled in the U.S. in October, leaving hundreds in limbo around the world. From CNN: “A pause on admissions that was expected to lift on Tuesday will now extend into November, leaving those who expected to resettle in the US in limbo. It also means additional travel will need to be canceled and re-booked at the expense of federal taxpayers. The moratorium will run through November 5, according to a State Department spokesperson.\"\n\n-- The Trump administration is working to close immigration “loopholes,” but the border still remains “in crisis,” officials said. Robert Moore and Abigail Hauslohner report: “U.S. Customs and Border Protection agents took 970,000 people into custody along the southern border in the past year — more than double the previous year’s total — including a ‘record-breaking’ number of families, CBP’s acting commissioner Mark Morgan said. Border crossings in fiscal 2019 hit their highest number in more than a decade, despite a continuous drop in border crossings during the past four months, Morgan said. … Authorities credit the significant drop in border crossings in recent months to the administration’s initiatives to close what Morgan called ‘loopholes’ in the immigration system — exceptions within U.S. law that officials say draw people to the country.”\n\n-- PG&E’s role in the Sonoma fire is being questioned as power outage frustrations mount across California. Douglas MacMillan and Faiz Siddiqui report: “The fires have deepened the sense of frustration felt by local residents and politicians as California’s largest utility company embarks on an unprecedented schedule of forced blackouts. Buried in a contentious bankruptcy proceeding, unable to pay victims of past fires and preparing for the danger of hurricane-like winds, PG&E tried to stave off more damage and future liability by turning off power to more than 2 million customers. PG&E serves about 16 million customers over 70,000 square miles in Northern and Central California. The blackouts may have helped contain the destruction; as of Tuesday, no deaths had been reported in connection to the fires, according to the California Department of Forestry and Fire Protection. But the blowback from residents who have been forced to live on generators and batteries, and the growing concern that the power shut-offs have failed to prevent the exact problem they were designed to solve, have plunged PG&E into deeper political and financial crisis.”\n\n-- Another windstorm will likely complicate the battle against Northern California’s Kincade Fire. Derek Hawkins, Marisa Iati and Andrew Freedman report: “The National Weather Service issued a wind advisory for parts of Sonoma and Napa counties between noon Tuesday and 11 a.m. Wednesday, with the most powerful gusts expected during the overnight hours. … The Kincade Fire grew by about 700 acres on Tuesday. At 76,138 acres total — an area more than twice the size of San Francisco — it is already California’s biggest fire of the year. The inferno was 15 percent contained, and officials said they expected it to burn until at least Nov. 7. At the same time, conditions in Southern California, where the Getty Fire scorched the western edge of Los Angeles on Monday, were expected to be even more dangerous.”\n\nSOCIAL MEDIA SPEED READ:\n\nStephen Strasburg was one of the heroes of the Nationals win in Game 6, which prompted an old Trump tweet to recirculate:\n\nHOW CAN THERE BE A TWEET FOR EVERYTHING.....! https://t.co/RKvME1lYnY — Richard Deitsch (@richarddeitsch) October 30, 2019\n\nThe Nationals’ loyalty to Strasburg finally paid off:\n\nNats are rewarded 7 years later for doing the right thing for Stephen Strasburg, 5-0 this postseason and the likely MVP if they win. Good organization. They treat their players right. — Jon Heyman (@JonHeyman) October 30, 2019\n\nThe cartoonist at the Atlanta Journal-Constitution pictured what Halloween at the White House could’ve looked like:\n\nA National Review editor lamented how Trump has warped the way some Republicans think:\n\nA short while ago, men such as Robert Mueller, William Taylor, and Alexander Vindman would have been pin-ups for (us) American conservatives: decorated combat veterans; patriots; straight arrows. The urge to prop up Trump changed all of this. A heartbreaking and infuriating era. — Jay Nordlinger (@jaynordlinger) October 29, 2019\n\nWhile some conservatives hung on the fact that Vindman was born outside of the U.S. as evidence that he couldn't be loyal to the country, a former Clinton White House press secretary pointed out that one of the president's most outspoken boosters, Sebastian Gorka, wasn't born in the U.S. either. (Neither, for that matter, was the first lady.)\n\nHey Trumpers. @sebgorka wasn’t born in the US. Can he put America first? — Joe Lockhart (@joelockhart) October 29, 2019\n\nHouse Republicans hung out with Trump at his D.C. hotel last night:\n\nGreat night with the President. Republicans are united! pic.twitter.com/Ea60bt1EWM — Kevin McCarthy (@GOPLeader) October 30, 2019\n\nSanders embraced a satire by the Onion:\n\nNo one was supposed to find out about this. https://t.co/cx4vQtFC28 — Bernie Sanders (@BernieSanders) October 29, 2019\n\nQUOTE OF THE DAY: “We’re talking about decorated veterans who have served this nation, who have put their lives on the line,” said Rep. Liz Cheney (R-Wyo.), responding to attacks on Vindman by Trump allies. “It’s shameful to question their patriotism, their love of this nation, and we should not be involved in that process.” (Toluse Olorunnipa)\n\nVIDEOS OF THE DAY:\n\nVindman, as a child, was briefly interviewed in Ken Burns’s 1985 film, “Statue of Liberty\":\n\nStephen Colbert believes Vindman's character is \"unimpeachable\":\n\nSeth Meyers criticized those who decided to attack Vindman:\n\nJimmy Kimmel's team mashed-up Trump's speech about Baghdadi with Barack Obama's speech on Bin Laden:\n\nTrevor Noah explained what rapper Kanye West is missing on black voters:\n\nAnother presidential candidate guest-starred in a TikTok video for The Post:\n\nAnd this video of the president and the first lady trying to figure out where to give a Minion his Halloween candy drew many laughs online:", "description": "Testimony coming today will highlight suspicious White House activity toward Kyiv dating to last year.", "authors": ["James Hohmann", "National Political Correspondent", "Author Of The Daily", "October At Am"], "top_image": "https://www.washingtonpost.com/pbox.php?url=https://palomaimages.washingtonpost.com/pr2/22010a336b7225207212a63bba2f54f7-680-453-70-8-56AN2GH3EEI6THQCDVC4WPP2R4.jpg&w=1484&op=resize&opt=1&filter=antialias&t=20170517", "published_at": "2019-10-30"}