{"pub": "townhall", "url": "https://townhall.com/columnists/jacobsullum/2019/10/30/cops-dont-need-another-excuse-to-hassle-innocent-drivers-supreme-court-shouldnt-let-police-stop-cars-simply-because-theyre-registered-to-people-with-suspended-licenses-n2555536", "downloaded_at": "2019-10-30 04:14:56.292023+00:00", "title": "Cops Don't Need Another Excuse to Hassle Innocent Drivers", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nAt any given time, millions of Americans are forbidden to drive because their licenses have been suspended, often for reasons that have nothing to do with traffic safety. But their cars can still be legally driven by relatives, friends and neighbors.\n\nGiven that reality, should police be allowed to pull over a car simply because it is registered to someone with a suspended license? While the assumption that the registered owner is behind the wheel might seem reasonable, condoning such traffic stops, as the state of Kansas is asking the U.S. Supreme Court to do in a case the justices will hear on Monday, would expose many innocent drivers to the constant threat of police harassment, even when they're not doing anything illegal.\n\nLast year, the Kansas Supreme Court ruled that pulling over cars solely because they're owned by people with suspended licenses violates the Fourth Amendment's ban on unreasonable seizures. The case involved a 2016 traffic stop in Lawrence, Kansas, by a sheriff's deputy who pulled over a pickup truck registered to Charles Glover, whose license had been revoked.\n\nWhile Glover was in fact the driver, the deputy did not know that at the time. All he knew was the registration information he obtained by running the license plate, and the Kansas Supreme Court concluded that was not enough to provide \"reasonable suspicion,\" which requires \"specific and articulable facts\" indicating that a particular person is engaged in illegal activity.\n\nUrging the U.S. Supreme Court to overturn that decision, Kansas says the probability that the driver of a car registered to someone with a suspended license will turn out to be the owner is high enough to provide reasonable suspicion for a stop. But the data it presents to back up that argument demonstrates nothing of the sort.\n\nAs \"there are two to three drivers for every registered automobile in Kansas,\" the state says, \"the likelihood that the registered owner of a vehicle in Kansas is driving his or her vehicle is no less than 33%.\" The state also cites studies indicating that between 30% and 75% of people with suspended licenses continue to drive.\n\nThat first calculation assumes people with suspended licenses drive as often as the general population, which we know is not true. And even if we take the highest estimate of continued driving by people with suspended licenses at face value, it does not tell us how likely it is that they will be the drivers when police stop their cars.\n\nGlover's lawyers illustrate that point with a \"stylized (but realistic) example\" of a woman whose license is suspended for six months. If she drives her car twice during that period, taking her husband to and from a medical appointment, while her husband drives it twice a day (\"to and from work on weekdays and to and from the grocery store and religious services on weekends\"), the probability that she is driving on any given occasion is less than 1%.\n\nKansas argues that stopping cars based solely on the fact that their owners' licenses are suspended is necessary to protect public safety. Yet states commonly suspend people's licenses for reasons unrelated to the threat they pose as drivers, including failure to pay parking tickets, overdue child support and drug possession offenses.\n\nSuch sanctions make it hard to keep a job and run errands. The policing approach favored by Kansas would extend the punishment to everyone who helps out by driving the cars that people with suspended licenses cannot legally use.\n\nThe threat of such harassment is compounded by the use of automated license plate readers, which can readily identify cars for police to stop if all that's required is a registered owner with a suspended license. Given the multiplicity and ambiguity of traffic regulations, cops already have myriad pretexts for hassling drivers who pose no threat to public safety. Why give them another excuse?\n\nJacob Sullum is a senior editor at Reason magazine. Follow him on Twitter: @JacobSullum. To find out more about Jacob Sullum and read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate webpage at www.creators.com.", "description": "At any given time, millions of Americans are forbidden to .10/30/2019 0:14:59AM EST.", "authors": ["Jacob Sullum", "Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/310/fa08a2d5-aee5-4617-acb3-78310f437399.jpg", "published_at": "2019-10-30"}